[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara manusia ada yang membeli perkataan yang melalaikan (yaitu semua permainan yang melenakan dari ketaatan kepada Allah dan menghalangi dari keridhaan Allah) untuk menyesatkan manusia dari jalan petunjuk ke jalan hawa nafsu, dan menjadikan ayat-ayat Allah sebagai hinaan. Mereka akan mendapatkan siksa yang menghinakan dan merendahkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Di antara manusia -seperti An-Naḍr bin Al-Hāriṡ- ada yang memilih ucapan-ucapan yang membuat terlena dengan tujuan mengalihkan manusia dari agama Allah kepada ucapan-ucapan itu tanpa didasari ilmu, dan menjadikan ayat-ayat Allah sebagai bahan olok-olok yang mereka cemooh. Orang-orang yang mempunyai kriteria semacam ini, mereka akan mendapatkan siksa yang menghinakan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan dari sebagian manusia terdapat orang yang lebih memilih sesuatu yang melalaikan hatinya dari ketaatan kepada Allah dan yang sesuatu yang dilarang Allah dan rasul-Nya, agar dapat menyesatkan dari jalan hidayah menuju jalan kesesatan karena jahil terhadap dosa, dan menjadikan agama Allah sebagai olokan. Orang-orang yang jauh dari kebenaran itu akan mendapat azab yang menghinakan di neraka Jahannam. Imam at-Thabari meriwayatkan dari Jabir dan lainnya dengan beberapa sanad yang saling menguatkan tentang firman Allah: (وَمِنَ ٱلنَّاسِ مَن يَشْتَرِى لَهْوَ ٱلْحَدِيثِ) yang dimaksud adalah nyanyian dan mendengarkan nyanyian. (Hal ini disebutkan pula oleh Ibnu Katsir, Ibnu Mas’ud, Ibnu Abbas, Ikrimah, Sa’id, Mujahid, dan Makhul)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَمِنَ النَّاسِ مَن يَشْتَرِى لَهْوَ الْحَدِيثِ (Dan di antara manusia (ada) orang yang mempergunakan perkataan yang tidak berguna) Makna (لهو الحديث) adalah segala yang dapat melalaikan manusia seperti, nyanyian, tempat-tempat permainan, obrolan, dan dongeng-dongeng. لِيُضِلَّ عَن سَبِيلِ اللهِ(untuk menyesatkan (manusia) dari jalan Allah) Yakni melakukan permainan ini dengan tujuan menyesatkan orang lain dari jalan hidayah dan jalan kebenaran. Ia menyeru kepada permainan ini agar orang lain tidak mendengarkan dan menghayati al-Qur’an. Dan orang yang berhak mendapat olokan adalah orang yang menggunakan permainan ini dengan tujuan tersebut. بِغَيْرِ عِلْمٍ(tanpa pengetahuan) Ia menggunakan permaianan ini sedangkan ia tidak mengerti apa yang ia gunakan itu atau tidak mengetahui apa yang bermanfaat dan apa yang berbahaya sehingga ia lebih memilih sesuatu yang buruk daripada sesuatu yang baik. وَيَتَّخِذَهَا هُزُوًا ۚ( dan menjadikan jalan Allah itu olok-olokan) Yakni menggunakan permainan ini untuk menyesatkan orang lain dari jalan Allah dan untuk mengolok-olok kitab Allah. أُو۟لٰٓئِكَ لَهُمْ عَذَابٌ مُّهِينٌ (Mereka itu akan memperoleh azab yang menghinakan) Yakni azab yang sangat berat sehingga menjadikan orang yang diazab menjadi terhina."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dan ada sebagian manusia yang menjual kata-kata hiburan, yaitu setiap sesuatu yang digunakan untuk menghibur manusia, berupa lagu, hiburan dan dongeng untuk mengeluarkan dan menyesatkan manusia dari agama Allah yaitu Islam tanpa pengetahuan dan menjadikan jalan Allah, yaitu kitab Allah sebagai bahan olok-olok dan bahan ejekan. Mereka itu akan mendapatkan siksa yang sangat menginakan di neraka jahanam. Maksudnya untuk memberi perhatian tentang buruknya tujuan para pendongeng dan usaha mereka dalam menghalangi manusia dari Al-Qur’an. Ayat ini diturunkan untuk seorang laki-laki Quraisy yang membeli budak perempuan yang bisa menyanyi. Dia adalah Nadhr bin Harits yang mengutus budak perempuannya untuk menyanyi bagi setiap orang yang ingin masuk Islam supaya mereka menolak Islam. FirmanNya {Li Yudhilla} untuk memelihara fungsi lafadz (Man). Dan firmanNya {Ulaaiak} untuk menjaga makna, yaitu suatu golongan manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara manusia ada orang yang membeli} memilih dan menyukai {percakapan kosong} percakapan yang membuat lupa dari ketaatan kepada Allah {untuk menyesatkan dari jalan Allah} untuk menghalangi manusia dari agama Allah {tanpa ilmu dan menjadikannya olok-olok} dan menjadikan ayat-ayat Allah sebagai bahan olok-olok {Mereka itu akan memperoleh azab yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. maksudnya, “dan diantara manusia ada orang,” dia adalah orang yang sial lagi terlantar (tidak memperoleh pertolongan) “yang membeli,” maksudnya, memilih dan senang sebagaimana senangnya orang yang mengeluarkan harga pada sesuatu, “perkataan yang tidak berguna,” maksudnya, perkataan-perkataan yang melalikan hati, yang menghalang-halanginya dari nilai-nilai yang mulia. Termasuk dalam hal ini adalah setiap perkataan yang diharamkan dan setiap perkataan yang tidak berguna nan palsu lagi rendahan dadri perkataan-perkataan yang mendorong kepada kekafiran, kefasikan dan maksiat, dan dari perkataan-perkataan para penolak kebenaran, yang mendebat dengan kebatilan untuk mencampakkan yang benar, dan drai gunjingan, adu domba (memfitnah), dusta, cacian dan celaan, serta dari lagu, tiupan seruling-seruling setan, serta dari wanita-wanita penghibur yang melalaikan, yang tidak ada gunanya dalam agama maupun dunia. Maka golongan manusia semacam ini “membeli perkataan yang tidak berguna,” dari perkataan yang berguna, “untuk menyesatkan,” manusia “tanpa pengetahuan.” Maksudnya, setelah dia sesat karena perbuatannya, maka dia menyesatkan orang lain. Sebab, penyesatan itu tumbuh dari kesesatan, dan penyesatannya dalam perkataannya itu adalah sikapnya yang menghalang-halangi manusia dari perkataan yang berguna, amal yang bermanfaat, dari kebenaran yang jelas dan jalan yang lurus. Dan semua itu tidak akan bisa terlaksana sehingga dia mencemoohkan petunjuk dan kebenaran, dan menjadikan ayat-ayat Allah sebagai bahan ejekan, dia memperolok-oloknya serta ahlinya, maka (sungguh) dia telah menyesatkan orang-orang yang tidak berilmu, dan dia menipunya dengan perkataan-perkataan yang disampaikannya, yaitu perkataan yang tidak bisa dibedakan oleh orang yang sesat dan dia pun tidak mengenal hakikatnya, “mereka itu akan memperoleh azab yang menghinakan,” karena mereka sesat, menyesatkan, memperolok-olokan ayta-ayat Allah dan mendustakan kebenaran yang sudah sangat jelas sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 6: Allah mengabarkan bahwasanya manusia yang membeli perkataan yang tiada berguna untuk memalingkan manusia dari agama Allah dan juga dari jalan yang lurus serta mengambil ayat-ayat Allah untuk kesombongan dan olok-olok, maka ketahuilah bahwasanya mereka akan diberikan adzab yang menghinakan dan merendahkan mereka di hari kiamat. Berkata Ibnu Mas’ud : Lahwul hadits demi Allah adalah musik. Dia berkata ada tiga macam : alat musik, nyanyian dan ucapan yang dicintainya. Akan tetapi ayat ini lebih mencakup semua itu, maka jadilah maknanya : Sebagian manusia ada yang menggunakan ucapan yang diharamkan, dan setiap dari kesia-siaan ucapan dan kefasikan yang menyesatkan manusia dari hidayah dan jalan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan tentang orang-orang yang mengambil Al Qur’an sebagai petunjuk dan mendatanginya, maka Dia menyebutkan orang yang berpaling darinya, tidak peduli terhadapnya, dan akhirnya ia mendapat hukuman, yaitu dengan digantikan untuknya ucapan yang batil, ia pun meninggalkan ucapan yang tinggi dan ucapan yang baik, dan mengantinya dengan ucapan yang paling buruk dan jelek. Yaitu orang yang berpaling dari Al Qur’an. Yaitu ucapan-ucapan yang memalingkan hati dan menghalanginya dari tuntutan yang agung. Termasuk ke dalam perkataan yang sia-sia ini adalah setiap ucapan yang haram, setiap ucapan yang batil dan sia-sia, ucapan yang mendorong kepada kekafiran, kefasikan dan kemaksiatan, ucapan orang-orang yang menolak kebenaran, syubhat, ghibah (menggunjing orang lain), namimah (adu domba), dusta, mencaci-maki, nyanyian, hal-hal yang melalaikan yang tidak ada manfaatnya bagi agama maupun dunia. Setelah dirinya sesat, dia sesatkan orang lain. Ucapannya yang menyesatkan itu menghalanginya dari ucapan yang bermanfaat, dari amal yang bermanfaat, dari kebenaran dan jalan yang lurus. Ucapan yang sesat itu menjadi sempurna kesesatannya ketika ia mencacatkan petunjuk dan kebenaran dan menjadikan ayat-ayat Allah sebagai bahan olokan, dia mengolok-olokkannya, demikian pula mengolok-olokkan orang yang membawanya. Sehingga ketika dipadukan antara memuji yang batil dan mendorong orang lain kepadanya, mengkritik yang hak, mengolok-olokkannya, dan mengolok-olokkan orang yang membawanya, ditambah lagi dengan menyesatkan orang yang tidak berilmu, dan menipunya, maka semakin sempurnalah kesesatannya, dan bagi mereka azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 6",
    "description": "Beralih dari penjelasan mengenai fungsi Al-Qur'an dan kriteria orang mukmin, pada ayat ini Allah menggambarkan sikap orang yang lebih senang mendengarkan selain Al-Qur'an. Dan di antara manusia ada orang yang mempergunakan percakapan atau cerita-cerita kosong untuk menyesatkan dan memalingkan manusia dari jalan Allah tanpa ilmu, yakni pemahaman yang benar. Mereka juga menghina ayat-ayat Al-Qur'an dan menjadikannya bahan olok-olokan karena ketidaktahuan mereka tentang manfaat Al-Qur'an atau keengganan mereka mengambil manfaat darinya. Di akhirat nanti mereka itu akan memperoleh azab yang menghinakan. 7. Bukan itu saja kelakuan buruk orang yang menggunakan cerita-cerita kosong untuk menyesatkan manusia. Apabila dibacakan kepadanya ayat-ayat kami, dia serta-merta berpaling dengan menyombongkan diri dan bersikap seolah-olah dia belum mendengarnya. Dia dengan sikap demikian seperti layaknya orang tuli yang seakan-akan ada sumbatan di kedua telinganya. Maka, sebagai bentuk ejekan, gembirakanlah dia dengan azab yang pedih di akhirat kelak."
  }
]