[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila ayat-ayat al-Qur’an dibacakan kepadanya, dia berpaling dari ketaatan kepada Allah, takabur dan tidak mengambil pelajaran, seolah-olah tidak mendengar apapun, seolah-olah telinganya tersumbat. Barangsiapa yang keadaannya seperti ini, maka sampaikanlah berita gembira kepadanya (wahai Rasul) dengan siksa yang menyakitkan di dalam api neraka pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan jika ayat-ayat Kami dibacakan kepadanya, ia berpaling dari mendengarnya, seakan-akan ia tidak mendengarnya, seakan-akan di kedua telinganya ada sumbatan yang mencegahnya untuk mendengar. Maka berilah kabar gembira kepadanya -wahai Rasul- dengan siksa pedih yang menantinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Orang yang suka dengan perkataan yang tidak berguna itu akan berpaling jika dibacakan ayat-ayat al-Qur’an karena kesombongannya, sehingga dia tidak peduli dengan peringatan dan hukum-hukum yang ada di dalamnya seakan-akan dia tidak mendengarnya karena tuli. Hai Rasulullah, sampaikan dan peringatkanlah dia dengan azab neraka yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِذَا تُتْلَىٰ عَلَيْهِ ءَايٰتُنَا (Dan apabila dibacakan kepadanya ayat-ayat Kami) Yakni apabila ayat-ayat al-qur’an dibacakan kepada orang yang mengolok-olok ini. وَلَّىٰ مُسْتَكْبِرًا(dia berpaling dengan menyombongkan diri) Ia berpaling darinya dengan penuh kesombongan. كَأَن لَّمْ يَسْمَعْهَا(seolah-olah dia belum mendengarnya) Padahal ia telah mendengarnya. كَأَنَّ فِىٓ أُذُنَيْهِ وَقْرًا ۖ( seakan-akan ada sumbat di kedua telinganya) Makna (الوقر) yakni sumbatan atau penyakit tuli. فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ (maka beri kabar gembiralah dia dengan azab yang pedih) Allah mengabarkan bahwa ia akan mendapatkan azab yang sangat pedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dan jika kamu bacakan ayat-ayat Al-Qur’an kepada pendongeng yang suka mereka-reka ini, maka dengan angkuh tanpa menghiraukan, dia akan menjauh dan berpaling, seakan akan tidak mendengarnya. Seakan akan telinganya itu tuli. Maka beritahulah dia tentang azab yang sangat menyakitkan yang pasti terjadi pada hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dibacakan kepadanya ayat-ayat Kami, dia berpaling} berpaling {dengan menyombongkan diri seolah-olah dia tidak mendengarnya, seakan-akan di kedua telinganya ada sumbatan} pemberat dan ketulian {Maka berilah kabar gembira kepadanya dengan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. maka dari itu Allah berfirman, ”dan apabila dibacakan kepadanya ayat-ayat kami,” supaya dia beriman dan tunduk patuh kepadanya, “dia berpaling dengan menyombongkan diri,” maksudnya, dia berpaling kebelakang dengan menyombongkan diri terhadapnya dan menolaknya, dan ayat-ayat itu tidak bisa masuk kedalam hatinya dan tidak pula berpengaruh padanya, akan tetapi ia membelakanginya, “seolah-olah dia belum mendengarnya,” bahkan, “seakan-akan ada sumbat di kedua telinganya,” maksudnya, penutup hingga tidak ada suara yang bisa memasukinya. Orang seperti ini sama sekali tidak ada jalan untuk memberinya petunjuk. “maka berilah dia kabar gembira,” dengan sutau kabar gembira yang bisa membuat di dalam hatinya rasa sedih dan duka, dan pada raut wajahnya keburukan, kegelapan dan kemuraman, “dengan azab yang pedih,” menyakitkan hati dan badannya, yang tidak dapat diukur kadarnya dan tidak dapat diketahui betapa hebat siksaan itu. Ini adalah berita gembira untuk para pelaku kejahatan. Sungguh berita gembira seperti itu sama sekali tidak ada kenikmatannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 7: Ini semua adalah kelompok manusia, jika mereka telah membaca ayat-ayat Allah mereka tidak beriman dan juga ada yang tidak patuh terhadap ayat-ayat tersebut, dengan menolak apa yang telah disampaikan dengan kesombongan, seolah-olah mereka tidaklah membacanya sesuatu apapun, tidak juga mendengar apapun dan seolah-olah pada telinganya terdapat ketulian yang tidak mendengar apapun. Maka pada kelompok ini, kabarkan kepada mereka wahai Nabi Allah dengan adzab yang pedih sebagai balasan bagi olok-olok mereka dan penolakan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan kepadanya ialah kepada orang yang mempergunakan perkataan-perkataan yang sia-sia untuk menyesatkan manusia. Agar dia beriman dan tunduk. Ayat itu tidak masuk ke dalam hatinya, dan tidak berpengaruh apa-apa, bahkan menolaknya serta berpaling darinya. Sehingga tidak ada satu pun suara yang masuk, dan tidak ada celah untuk memberinya petunjuk. Pedih bagi hatinya dan pedih bagi badannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 7",
    "description": "Bukan itu saja kelakuan buruk orang yang menggunakan cerita-cerita kosong untuk menyesatkan manusia. Apabila dibacakan kepadanya ayat-ayat kami, dia serta-merta berpaling dengan menyombongkan diri dan bersikap seolah-olah dia belum mendengarnya. Dia dengan sikap demikian seperti layaknya orang tuli yang seakan-akan ada sumbatan di kedua telinganya. Maka, sebagai bentuk ejekan, gembirakanlah dia dengan azab yang pedih di akhirat kelak. 8-9. Balasan yang akan diterima oleh orang yang menjadikan perca-kapan kosong untuk menyesatkan manusia berbanding terbalik de-ngan ganjaran bagi orang mukmin. Sesungguhnya orang-orang yang beriman kepada Allah dengan mengimani Al-Qur'an dan mengamalkan isinya dan dengan tulus mengerjakan kebajikan yang memberi manfaat dan maslahat, mereka akan mendapat surga-surga yang penuh kenikmatan; mereka kekal di dalamnya dengan penuh suka cita. Yang demikian itu sebagai janji Allah yang benar kepada siapa saja yang beriman dan beramal saleh. Dan dia mahaperkasa; tidak seorang pun bisa mengalahkan-Nya, mahabijaksana pada setiap kebijakan-Nya."
  }
]