[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan RasulNya, serta melaksanakan amal-amal shalih yang diperintahkan kepada mereka, mereka itu akan mendapatkan kenikmatan yang tetap di surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Sesungguhnya orang-orang yang beriman kepada Allah dan mengerjakan amal-amal saleh, bagi mereka Surga kenikmatan, mereka mendapatkan kenikmatan di dalamnya dengan apa yang telah Allah siapkan untuk mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Pahala bagi orang-orang yang beriman yang mengerjakan amal shalih adalah balasan yang mulia di surga yang penuh dengan kenikmatan, mereka akan kekal di dalamnya. Allah benar-benar menjanjikan hal tersebut, Dia tidak menyelisihi janji dan Dia Maha Perkasa dalam kekuasaan-Nya dan Maha Bijaksana dalam mengurus hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya orang-orang yang beriman kepada Allah dan Rasulallah serta mengerjakan amal shalih yang diperintahkan, maka bagi mereka itu kenikmatan surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman dan mengerjakan kebajikan, bagi mereka itu surga-surga yang penuh kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. adapun berita gembira untuk para pelaku kebaikan, maka Allah berfirman, ”sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal shalih,” mereka telah memadukan antara ibadah batin dengan beriman dan (ibadah) lahiriyah dengan islam dan amal shalih, “mereka mendapatkan surga-surga yang penuh kenikmatan,” sebagai berita gembira bagi mereka disebabkan (apa) yang telah mereka persiapkan, dan sebagai hidangan bagi mereka disebabkan amal yang telah mereka kerjakan. “mereka kekal di dalamnya,” maksudnya, di dalam surga-surga yang penuh kenikmatan, kenikmatan hati, jiwa, dan raga. “sebagai janji Allah yang benar,” yang tidak mungkin diingkari, dirubah atau diganti. “dan Dia-lah Yang Mahaperkasa lagi Mahabijaksana,” sempurna keperkasaanNya, paripurna kebijaksanaanNYa. Dari keperkasaan dan hikmahNya Dia memberikan taufikNya kepada orang yang dikehendakiNya, dan mengabaikan (orang yang Dia kehendaki) sesuai dengan tuntutan ilmu dan hikmahNya pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 8: 8-9. Dan inilah kabar gembira bagi pelaku kebaikan, di mana mereka beriman kepada Allah dan mengesakan-Nya dan membenarkan utusan-Nya ﷺ serta beriman dengannya kemudia ia beramal dengan amalan shalih, karena sesungguhnya Allah mempersiapkan dan menghidupkan mereka di dalam surga yang penuh kenikmatan tidak akan hilang kenikmatan itu selamanya, padanya (surga) yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, tidak juga terbesik di dalam hati manusia, mereka akan tinggal pada surga ini, yang terus menerus tak terputus padanya. Ini adalah janji Allah secara benar tanpa keraguan, Dialah Allah yang maha kuat dan maha menaklukkan atas apa yang dia kehendaki dan Dia adalah yang maha bijaksana di mana meletakkan segala sesuatu sesuai pada tempatnya, Dialah Allah yang maha suci dengan menghukumi (makhluk-Nya) sesuai kehendak-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka menggabung antara ibadah batin dengan iman, dan ibadah zahir (lahir) dengan Islam (syariat Islam atau amal saleh). Baik kenikmatan bagi hati, ruh maupun badan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 8",
    "description": "8-9. Balasan yang akan diterima oleh orang yang menjadikan perca-kapan kosong untuk menyesatkan manusia berbanding terbalik de-ngan ganjaran bagi orang mukmin. Sesungguhnya orang-orang yang beriman kepada Allah dengan mengimani Al-Qur'an dan mengamalkan isinya dan dengan tulus mengerjakan kebajikan yang memberi manfaat dan maslahat, mereka akan mendapat surga-surga yang penuh kenikmatan; mereka kekal di dalamnya dengan penuh suka cita. Yang demikian itu sebagai janji Allah yang benar kepada siapa saja yang beriman dan beramal saleh. Dan dia mahaperkasa; tidak seorang pun bisa mengalahkan-Nya, mahabijaksana pada setiap kebijakan-Nya"
  }
]