[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kehidupan mereka di surga tersebut adalah kehidupan abadi, tidak terputus dan tidak berakhir, dan Allah menjanjikan itu sebagai janji yang benar. Dia tidak menyelisihi janjiNya. Dia Mahaperkasa dalam perintahNya dan Mahabijaksana dalam pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Mereka menetap di dalamnya, dan Allah menjanjikan hal itu kepada mereka dengan janji yang pasti, tidak ada keraguan padanya. Dan Dia Żat Yang Maha Perkasa, yang tidak ada sesuatu pun yang mampu mengalahkan-Nya, Maha Bijaksana di dalam penciptaan-Nya, takdir-Nya dan syari’at-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. خٰلِدِينَ فِيهَا ۖ وَعْدَ اللهِ حَقًّا ۚ (Kekal mereka di dalamnya; sebagai janji Allah yang benar) Yakni Allah menjanjikan hal itu dengan sebenar-benarnya yang tidak akan diingkari. وَهُوَ الْعَزِيزُ(Dan Dialah Yang Maha Perkasa) Yang tidak akan terkalahkan. الْحَكِيمُ (lagi Maha Bijaksana) Dalam segala perbuatan dan firman-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Mereka tinggal disana selama-lamanya. Allah memberikan janji yang benar dan tidak mungkin diingkari tentang hal itu. Dialah Dzat yang Maha Kuat lagi Maha Perkasa dan Maha Bijaksana dalam menepati janjiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka kekal di dalamnya sebagai janji Allah yang benar. Dia Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8-9. adapun berita gembira untuk para pelaku kebaikan, maka Allah berfirman, ”sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal shalih,” mereka telah memadukan antara ibadah batin dengan beriman dan (ibadah) lahiriyah dengan islam dan amal shalih, “mereka mendapatkan surga-surga yang penuh kenikmatan,” sebagai berita gembira bagi mereka disebabkan (apa) yang telah mereka persiapkan, dan sebagai hidangan bagi mereka disebabkan amal yang telah mereka kerjakan. “mereka kekal di dalamnya,” maksudnya, di dalam surga-surga yang penuh kenikmatan, kenikmatan hati, jiwa, dan raga. “sebagai janji Allah yang benar,” yang tidak mungkin diingkari, dirubah atau diganti. “dan Dia-lah Yang Mahaperkasa lagi Mahabijaksana,” sempurna keperkasaanNya, paripurna kebijaksanaanNYa. Dari keperkasaan dan hikmahNya Dia memberikan taufikNya kepada orang yang dikehendakiNya, dan mengabaikan (orang yang Dia kehendaki) sesuai dengan tuntutan ilmu dan hikmahNya pada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Luqman ayat 9: 8-9. Dan inilah kabar gembira bagi pelaku kebaikan, di mana mereka beriman kepada Allah dan mengesakan-Nya dan membenarkan utusan-Nya ﷺ serta beriman dengannya kemudia ia beramal dengan amalan shalih, karena sesungguhnya Allah mempersiapkan dan menghidupkan mereka di dalam surga yang penuh kenikmatan tidak akan hilang kenikmatan itu selamanya, padanya (surga) yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, tidak juga terbesik di dalam hati manusia, mereka akan tinggal pada surga ini, yang terus menerus tak terputus padanya. Ini adalah janji Allah secara benar tanpa keraguan, Dialah Allah yang maha kuat dan maha menaklukkan atas apa yang dia kehendaki dan Dia adalah yang maha bijaksana di mana meletakkan segala sesuatu sesuai pada tempatnya, Dialah Allah yang maha suci dengan menghukumi (makhluk-Nya) sesuai kehendak-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang tidak mungkin diingkari dan dirubah. Oleh karena itu, tidak ada yang dapat menghalangi pelaksanaan janji dan ancaman-Nya. Dia menempatkan sesuatu pada tempatnya. Di antara kebijaksanaan-Nya adalah Dia memberikan taufik atau membiarkan seseorang sesuai ilmu dan hikmah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Luqman Ayat 9",
    "description": "8-9. Balasan yang akan diterima oleh orang yang menjadikan perca-kapan kosong untuk menyesatkan manusia berbanding terbalik de-ngan ganjaran bagi orang mukmin. Sesungguhnya orang-orang yang beriman kepada Allah dengan mengimani Al-Qur'an dan mengamalkan isinya dan dengan tulus mengerjakan kebajikan yang memberi manfaat dan maslahat, mereka akan mendapat surga-surga yang penuh kenikmatan; mereka kekal di dalamnya dengan penuh suka cita. Yang demikian itu sebagai janji Allah yang benar kepada siapa saja yang beriman dan beramal saleh. Dan dia mahaperkasa; tidak seorang pun bisa mengalahkan-Nya, mahabijaksana pada setiap kebijakan-Nya. 10. Di antara tanda-tanda keesaan dan kekuasan Allah adalah bahwa dia menciptakan langit tanpa tiang penyangga sebagaimana kamu melihatnya, dan dia juga meletakkan gunung-gunung di permukaan bumi sebagai pasak agar ia tidak menggoyangkan kamu sehingga kamu dapat tinggal di bumi dengan tenang; dan dia memperkembangbiakkan segala macam jenis makhluk bergerak yang bernyawa di bumi, baik yang hidup di darat, laut, maupun udara. Dan kami turunkan air hujan dari langit ke bumi, lalu kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik, sedap dipandang, dan bermanfaat."
  }
]