[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2 (shad) pembicaraan tentang huruf-huruf yang terpisah-pisah (diawal surat seperi ini) telah hadir di awal surat al-baqarah. Allah swt bersumpah dengan al-qur’an yang berisi tentang peringatan manusia dari apa-apa yang mereka lalaikan. tetapi orang-orang kafir itu justru menyombongkan diri di depan kebenaran dan menyimpang darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ṣād. Pembahasan tentang huruf hijaiah seperti ini telah disebutkan di awal surah Al-Baqarah. Allah bersumpah dengan Al-Qur`ān yang berisi peringatan kepada manusia tentang apa yang berguna bagi mereka di dunia dan Akhirat. Perkaranya tidak sebagaimana yang kaum musyrikin duga, bahwa Allah memiliki sekutu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Shad. Pada huruf muqattha’ah seperti ini mengandung isyarat tentang mukjizat al-Qur’an dan tantangan bagi orang-orang yang menguasai bahasa arab dengan fasih untuk mendatangkan sesuatu yang semisal dengan al-Qur’an. Pada ayat ini terdapat sumpah menggunakan al-Qur’an yang agung dan mulia, dan ia merupakan peringatan bagi orang yang lalai. Akan tetapi orang-orang kafir itu angkuh dan berpaling dari kebenaran, dan berada dalam permusuhan dengan Allah dan Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. صٓ ۚ (Shaad) Ini merupakan pembukaan surat yang telah disebutkan penjelasannya tentang huruf-huruf muqattha’ah. وَالْقُرْءَانِ ذِى الذِّكْرِ (demi Al Quran yang mempunyai keagungan) Allah bersumpah demi al-Qur’an untuk menjelaskan kemuliaan dan ketinggian kedudukannya. Sedangakan makna (الذكر) yakni al-Qur’an mengandung peringatan yang menjelaskan segala sesuatu. Dan pendapat lain mengatakan maknanya adalah al-Qur’an memiliki kemuliaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Shaad, salah satu huruf hijaiyah sebagai peringatan sebagaimana yang dijelaskan sebelumnya. Allah bersumpah demi Alquran yang mengandung peringatan atau bermakna kemuliaan yang agung, karena mengandung penjelasan tentang segala sesuatu. Sumpah atas Alquran untuk menyebutkan keagungan kekuasaan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ṣād, demi Al-Qur’an yang mengandung peringatan} mengandung peringatan dan pelajaran bagi manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini adalah penjelasan dari Allah perihal al-Quran dan perihal orang-orang yang mendustakannya dan mendustakan orang yang datang membawanya, seraya berfirman, “Shad, demi al-quran yang mempunyai keagungan.” Yakni, yang mempunyai kedudukan yang agung dan kemuliaan, yang mengingatkan manusia akan segala apa yang mereka butuhkan, seperti pengetahuan tentang nama-nama Allah, sifat-sifatNya dan perbuatan-perbuatanNya, dan seperti pengetahuan tentang hukum-hukum syariatNya serta pengetahuan tentang hukum-hukum di akhirat kelak dan pembalasan. Jadi, al-Quran itu mengingatkan mereka tentang prinsip-prinsip dan cabang-cabang agama mereka. Dan di sini tidak diperlukan penyebutan apa yang disumpahkan, karena pada hakikatnya yang digunakan bersumpah dan yang disumpahkan adalah satu (sama), yaitu al-Quran yang disifati dengan sifat yang mulia ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Shad ayat 1: Ayat ini menerangkan tentang keadaan Al Qur'an, keadaan orang-orang yang mendustakannya dan keadaan orang yang datang membawanya. Yakni memiliki kedudukan yang agung, mulia dan mengingatkan segala yang dibutuhkan manusia, seperti pengetahuan tentang nama-nama Allah, sifat-Nya dan perbuatan-Nya. Demikian pula pengetahuan tentang hukum-hukum syar’i dan pengetahuan tentang hukum-hukum jaza’i (pembalasan) di akhirat. Ia mengingatkan kepada mereka ushul (dasar-dasar) agama mereka dan furu’(cabang-cabang)nya. Di ayat ini tidak perlu menyebutkan hal yang disumpahi, karena hakikatnya yakni yang dipakai bersumpah dan hal yang disumpahi sama, yaitu Al Qur’anul Karim yang disifati dengan sifat yang agung ini. Jika demikian keadaan Al Qur’an, maka dapat diketahui secara pasti bahwa manusia butuh sekali kepadanya, bahkan di atas semua kebutuhan. Oleh karena itu, mereka wajib mengimani dan membenarkannya serta mendatanginya. Maka Allah menunjuki orang yang Dia beri petunjuk kepada Al Qur’an ini, akan tetapi orang-orang kafir malah bersikap sombong dari beriman kepadanya dan memusuhi orang yang membawanya (Nabi Muhammad shallallahu 'alaihi wa sallam) serta berusaha membantahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 1",
    "description": "Pada ayat terakhir surah a'-''ff't Allah menjelaskan perjuangan rasulullah dan sahabat dalam menegakkan ajaran tauhid. Meski mendapat tantangan besar, tetapi dengan kesabaran dan kegigihan me-reka akhirnya memperoleh kemenangan. Tema itu dilanjutkan dengan pembicaraan pada awal surah ini yang menegaskan bahwa upaya orang kafir menghalangi tersebarnya ajaran tauhid pasti berakhir dengan kehancuran. 2. Sekalipun mengetahui kedudukan Al-Qur'an, tetapi orang-orang yang kafir tetap dalam kesombongan mereka dengan mengingkari wahyu dan menampakkan permusuhan terhadap rasulullah dan ajaran yang di-sampaikannya. Mereka berbuat demikian salah satunya karena mere-ka menialai ajaran nabi mengancam eksistensi agama nenek moyang mereka dan patung sesembahan mereka."
  }
]