[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "ataukah orang-orang musyrik itu mempunyai kerajaan langit dan bumi serta apa yang ada diantara keduanya, sehingga mereka bisa memberi dan menahan? hendaknya mereka mengambil sebab-sebab yang bisa menyampaikan mereka ke langit sehingga mereka bisa menetapkan apa yang mereka inginkan, apakah memberi atau menahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Apakah mereka itu memiliki kerajaan langit, kerajaan bumi dan apa yang ada di antara keduanya sehingga mereka berhak untuk memberi dan menahan? Bila mereka mengaku demikian, maka hendaknya mereka mengambil sebab-sebab yang bisa menyampaikan mereka ke langit agar mereka bisa memutuskan sekehendak mereka, memberi atau menolak, dan mereka tidak akan mampu melakukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Atau orang-orang musyrik yang berpaling itu memiliki kerajaan langit, bumi, dan seisinya; sehingga mereka mereka dapat memberi dan menghalangi semau mereka?! Hendaklah mereka membuat tangga yang dapat mengantarkan mereka ke langit agar mereka dapat memiliki kerajaan dan berbuat sesuka hati dalam memberi dan menghalangi pemberian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَلْيَرْتَقُوا۟ فِى الْأَسْبٰبِ (maka hendaklah mereka menaiki tangga-tangga (ke langit)) Yakni tempuhlah segala jalan yang dapat mengantarkan mereka ke langit sehingga mereka dapat memberi atau menahan sesuai keinginan mereka dan mengurus seluruh alam sesuai kehendak mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Atau apakah mereka itu pemilik kerajaan langit bumi dan segala apapun yang berada di antara keduanya, sehingga mereka bebas memberi dan melarang apapun yang mereka inginkan? Jika memang begitu maka hendaknya mereka menaiki tangga ke menuju langit, agar mereka bisa menurunkan wahyu kepada siapun yang mereka kehendaki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau apakah mereka mempunyai kerajaan langit dan bumi serta apa yang ada di antara keduanya. Biarlah mereka menaiki tangga-tangga} biarkanlah mereka menaiki tangga-tangga yang membuat mereka sampai ke langit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Atau apakah mereka memiliki kerajaan langit dan bumi dan yang ada di antara keduanya,” sehingga mereka kuasa melakukan apa saja yang mereka inginkan? “Maka hendaklah mereka menaiki tangga-tangga,” yang dapat mengantarkan mereka ke langit, lalu mereka mencegat Rahmat Allah terhadap Rasulullah! Beraninya mereka membicarakan, padahal mereka adalah makhluk ciptaan Allah yang paling lemah dan paling tidak berdaya, tentang apa yang mereka bicarakan!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 10: (Atau apakah bagi mereka kerajaan langit dan bumi dan yang ada di antara keduanya?) jika mereka menduga hal tersebut (maka hendaklah mereka menaiki tangga-tangga) yang dapat mengantarkan mereka ke langit, lalu mereka mengambil wahyu dan mendatangkannya, kemudian mereka memberikannya secara khusus kepada orang-orang yang mereka kehendaki. Istifham atau kata tanya pada kedua tempat itu mengandung makna ingkar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka mampu melakukan semua yang mereka inginkan. Yakni biarlah mereka naik ke langit untuk mengambil wahyu lalu menyerahkan kepada orang yang mereka kehendaki atau biarlah mereka naik ke langit untuk memutuskan rahmat yang turun kepada Rasulullah shallallahu 'alaihi wa sallam. Jika tidak bisa, maka mengapa mereka berbicara terhadap sesuatu yang mereka sangat lemah sekali terhadapnya. Atau apakah maksud mereka adalah membuat pasukan atau kelompok besar serta berkumpul untuk bersama-sama membela yang batil dan menolak kebenaran, dan seperti ini kenyataannya. Padahal usaha mereka untuk berkumpul bersama memerangi yang hak (benar) akan sia-sia dan tentara mereka akan dikalahkan sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 10",
    "description": "\"atau apakah mereka mendustakan nabi Muhammad karena merasa mempunyai kerajaan dan kekuasaan di langit dan bumi dan apa yang ada di antara keduanya' jika tidak, semestinya mereka tidak mencampuri urusan Allah dalam menentukan seseorang menjadi rasul karena dialah yang memiliki wewenang mutlak untuk itu. Jika tetap ingkar maka biarlah mereka menaiki tangga-tangga menuju langit guna menghalangi turunnya wahyu kami kepada rasulullah. \"11. Mereka yang ingkar itu laksana kelompok besar bala tentara yang berada di suatu tempat sana yang akan dikalahkan oleh kelompok kecil yang memiliki keyakinan kuat dan keteguhan iman. Mereka kalah ka-rena perjuangan mereka tidak didasari keyakinan yang kukuh, melain-kan rasa iri dan kesombongan."
  }
]