[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14 Bala tentara yang mendustakan itu adalah bala tentara yang kalah, sebagaimana sekutu-sekutu kafir sebelum mereka juga dikalahkan. Sebelum mereka kaum nuh, ad, fir’aun pemilik kekuatan yang besar, tsamud, kaum luth, juga para penduduk desa dengan pohon-pohon dan kebun-kebun yang lebat, yaitu kaum syuaib, semuanya telah mendustakan. para umat yang bersekutu dalam kekafiran dan pendustaan dan bersatu padu di atasnya, masing-masing dari mereka tidak lain kecuali mendustakan para rasul, sehingga mereka berhak untuk diazab oleh Allah dan hukumannya pun turun menipa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Orang-orang yang mendustakan Rasul adalah bala tentara yang kalah, seperti bala tentara sebelum mereka yang mendustakan para Rasul."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. orang-orang yang mendustakan itu merupakan pasukan yang terkalahkan, sebagaimana pasukan sebelum mereka yang telah terkalahkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ الْأَحْزَابِ (Suatu tentara yang besar yang berada disana dari golongan-golongan yang berserikat, pasti akan dikalahkan) Yakni maka janganlah kamu bersedih hati akibat kekuasaan dan kekuatan mereka, sebab Aku dapat mengambil kekuatan mereka dan dapat mengalahkan pasukan mereka. Dan itu telah terjadi pada perang Badar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Mereka para kafir Makkah yang menentang dakwah Islam adalah para tentara yang bersekutu dengan iblis pasti akan dikalahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bala tentara yang berada di sana dari golongan yang bersekutu tentu akan dikalahkan} para pendusta itu adalah tentara yang dikalahkan itu terdiri dari sejumlah tentara yang melawan para nabi sebelummu, lalu mereka ditaklukkan dan dibinasakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Atau apakah tujuan mereka adalah penggalangan koalisi, pasukan dan saling bahu-membahu dalam membela kebatilan dan menyia-nyiakan kebenaran. Dan memang inilah realitanya! Sesungguhnya rencana jahat ini tidak akan bisa mereka capai, malah upaya-upaya mereka pasti sia-sia dan bala tentara mereka pasti tercerai-berai. Maka dari itu Allah berfirman, “Suatu tentara yang besar yang berada di sana dari golongan-golongan yang berserikat, pasti akan dikalahkan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 11: (Suatu tentara) maksudnya, suatu pasukan yang hina (di sana) yang telah mendustakanmu (pasti dikalahkan) menjadi sifat bagi lafal Jundun, sekalipun mereka terdiri (dari golongan-golongan yang bersekutu) lafal ayat ini menjadi sifat pula bagi lafal Jundun. Yakni suatu pasukan yang sama dengan pasukan-pasukan yang berserikat sebelum kamu yang memerangi para nabi. Pasukan-pasukan dahulu itu dapat dikalahkan dan dibinasakan, maka demikian pula mereka yang bersekutu untuk menghancurkanmu akan Kami binasakan pula."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika terjadi perang Khandak (parit), pasukan kafir terdiri dari beberapa golongan, yaitu golongan kaum musyrik, orang-orang Yahudi dan beberapa kabilah Arab yang menyerang kaum muslimin di Madinah. Peperangan ini berakhir dengan kocar-kacirnya tentara mereka. Sebagian ahli tafsir mengatakan bahwa yang dimaksud di sini ialah peperangan Badar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 11",
    "description": "Mereka yang ingkar itu laksana kelompok besar bala tentara yang berada di suatu tempat sana yang akan dikalahkan oleh kelompok kecil yang memiliki keyakinan kuat dan keteguhan iman. Mereka kalah ka-rena perjuangan mereka tidak didasari keyakinan yang kukuh, melain-kan rasa iri dan kesombongan. 12. Kebenaran pasti akan menang melawan kebatilan, dan hal itu terbukti dengan hancurnya para penentang nabi-nabi terdahulu. Bila kaum musyrik mekah mendustakan nabi Muhammad maka sebelum mereka itu kaum nabi nuh, 'ad, dan fir'aun yang mempunyai bala tentara yang banyak juga telah mendustakan rasul-rasul Allah. Musuh nabi nuh dihancurkan dengan banjir besar, kaum 'ad dengan angin kencang, dan fir'aun ditenggelamkan di laut merah."
  }
]