[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14 Bala tentara yang mendustakan itu adalah bala tentara yang kalah, sebagaimana sekutu-sekutu kafir sebelum mereka juga dikalahkan. Sebelum mereka kaum nuh, ad, fir’aun pemilik kekuatan yang besar, tsamud, kaum luth, juga para penduduk desa dengan pohon-pohon dan kebun-kebun yang lebat, yaitu kaum syuaib, semuanya telah mendustakan. para umat yang bersekutu dalam kekafiran dan pendustaan dan bersatu padu di atasnya, masing-masing dari mereka tidak lain kecuali mendustakan para rasul, sehingga mereka berhak untuk diazab oleh Allah dan hukumannya pun turun menipa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Orang-orang yang mendustakan itu bukanlah orang-orang yang pertama mendustakan Rasul, sebelum mereka juga telah ada para pendusta seperti kaum Nuh, kaum 'Ād, dan juga kaum Fir'aun pemilik pancang-pancang untuk menyiksa manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12-14. Hai Muhammad, sebelum kaummu, telah terdapat banyak kaum yang mendustakan seperti kaum Nabi Nuh, kaum ‘Aad, Tsamud, Fir’aun yang memiliki kekuatan, kaum Luth, dan penduduk al-Aikah yang memiliki banyak kebun yang merupakan kaum Nabi Syuaib. Mereka adalah kaum yang memiliki kekuatan, kekayaan, dan jumlah yang banyak; mereka adalah golongan yang disatukan dalam kekafiran dan pendustaan. Mereka semua mendustakan dan mengingkari para rasul dan risalah mereka; sehingga mereka berhak mendapatkan azab dan siksaan dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَفِرْعَوْنُ ذُو الْأَوْتَادِ (Fir’aun yang mempunyai tentara yang banyak) Yakni memiliki bangunan yang kokoh, dan mungkin yang dimaksud adalah bangunan-bangunan piramida."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Kaum sebelum mereka, yaitu kam Nuh, kaum ‘Ad, kaum Hud dan Firaun pemilik bangunan-bangunan yang kokoh dan raja yang tetap."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebelum mereka itu, kaum Nuh, ‘Ad, dan Fir‘aun yang mempunyai kekuatan besar telah mendustakan} memiliki kekuatan untuk menyiksa manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-15. Allah mewanti-wanti akan bertindak terhadap mereka seperti yang dilakukanNya terhadap umat-umat sebelum mereka yang keberadaannya jauh lebih kuat daripada mereka (kaum Quraisy) dan lebih besar jumlah koalisinya dalam kebatilan, yakni, “kaum Nuh, ‘Ad,” kaum nabi HUd, dan “Firaun yang mempunyai tentara yang banyak.” Maksudnya, bala tentara yang sangat besar jumlahnya dan (memiliki) kekuatan yang luar biasa, “dan Tsamud” yaitu kaum Nabi Shalih, “kaum Luth dan penduduk Aikah,” yang memiliki banyak pepohonan dan kebun-kebun yang rindang. Mereka adalah kaum Nabi syuaib. “Mereka itulah golongan-golongan yang bersekutu,” yang bersatu dengan kekuatan, jumlah dan perlengkapan mereka untuk menolak kebenaran. Namun semua itu sama sekali tidak berguna bagi mereka. “semua mereka,” masing-masing dari mereka itu “tidak lain hanyalah mendustakan rasul-rasul,” maka pastilah mereka ditimpa oleh “azab” dari Allah. Mereka (kaum musyrikin Quraisy), apa yang dapat menyucikan dan membersihkan mereka agar tidak ditimpa oleh apa yang telah menimpa umat-umat sebelumnya?! Maka hendaklah mereka menunggu “satu teriakan saja yang tidak ada baginya saat berselang,” maksudnya, untuk kembali. Teriakan (tiupan sangkakala malaikat Israfil) itu akan membinasakan dan memusnahkan mereka jika mereka tetap ngotot pada kesesatan yang mereka anut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 12: (Telah mendustakan pula sebelum mereka itu kaum Nuh) lafal Qaum dianggap sebagai muannats karena ditinjau dari segi maknanya (Ad dan Firaun yang mempunyai patok yang banyak) disebutkan bahwa Firaun selalu mematok atau memasung setiap orang yang menentangnya, lalu kedua kaki dan tangan orang yang menentangnya itu diikatkan pada empat patok, kemudian disiksa. Oleh karenanya ia dijuluki sebagai Dzul Autaad."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menakut-nakuti mereka terhadap tindakan-Nya kepada umat-umat sebelum mereka yang mendustakan, di mana mereka lebih besar kekuatannya dan lebih banyak pasukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 12",
    "description": "Kebenaran pasti akan menang melawan kebatilan, dan hal itu terbukti dengan hancurnya para penentang nabi-nabi terdahulu. Bila kaum musyrik mekah mendustakan nabi Muhammad maka sebelum mereka itu kaum nabi nuh, 'ad, dan fir'aun yang mempunyai bala tentara yang banyak juga telah mendustakan rasul-rasul Allah. Musuh nabi nuh dihancurkan dengan banjir besar, kaum 'ad dengan angin kencang, dan fir'aun ditenggelamkan di laut merah. 13. Dan seperti halnya kaum nabi nuh, 'ad, dan fir'aun, kaum samud, kaum nabi lut, dan penduduk aikah, yakni kaum nabi syuaib, pun mendustakan para rasul mereka. Kaum samud dihancurkan dengan suara menggelegar, kaum nabi lut dengan hujan batu, dan penduduk aikah dengan kilat yang menyambar. Mereka itulah golongan-golongan yang bersekutu dalam menyembah berhala dan berbuat kejahatan."
  }
]