[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14 Bala tentara yang mendustakan itu adalah bala tentara yang kalah, sebagaimana sekutu-sekutu kafir sebelum mereka juga dikalahkan. Sebelum mereka kaum nuh, ad, fir’aun pemilik kekuatan yang besar, tsamud, kaum luth, juga para penduduk desa dengan pohon-pohon dan kebun-kebun yang lebat, yaitu kaum syuaib, semuanya telah mendustakan. para umat yang bersekutu dalam kekafiran dan pendustaan dan bersatu padu di atasnya, masing-masing dari mereka tidak lain kecuali mendustakan para rasul, sehingga mereka berhak untuk diazab oleh Allah dan hukumannya pun turun menipa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Kaum Ṡamūd, kaum Lūṭ, kaum Syuaib, mereka semuanya mendustakan, mereka adalah sekutu-sekutu yang bersatu untuk mendustakan para rasul mereka dan kufur kepada apa yang di bawa para rasul tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَأَصْحٰبُ لْـَٔيْكَةِ ۚ (dan penduduk Aikah) Mereka adalah kaum nabi Syu’aib. أُو۟لٰٓئِكَ الْأَحْزَابُ (Mereka itulah golongan-golongan yang bersekutu (menentang rasul-rasul)) Yakni orang-orang yang memiliki kekuatan dan jumlah yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Juga kaum Tsamud kaum nabi Soleh, kaum Luth, juga para penduduk semak belukar yaitu kaum nabi Syu’aib. Mereka itulah kelompok yang menentang rasul mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{juga kaum Tsamud, kaum Luth, dan penduduk Aikah} kaum Syu’aib penghuni negeri yang memiliki pepohonan yang rindang {Mereka itulah golongan yang bersekutu} orang-orang yang bersekutu melawa rasul mereka dengan mendustakan apa yang mereka bawa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-15. Allah mewanti-wanti akan bertindak terhadap mereka seperti yang dilakukanNya terhadap umat-umat sebelum mereka yang keberadaannya jauh lebih kuat daripada mereka (kaum Quraisy) dan lebih besar jumlah koalisinya dalam kebatilan, yakni, “kaum Nuh, ‘Ad,” kaum nabi HUd, dan “Firaun yang mempunyai tentara yang banyak.” Maksudnya, bala tentara yang sangat besar jumlahnya dan (memiliki) kekuatan yang luar biasa, “dan Tsamud” yaitu kaum Nabi Shalih, “kaum Luth dan penduduk Aikah,” yang memiliki banyak pepohonan dan kebun-kebun yang rindang. Mereka adalah kaum Nabi syuaib. “Mereka itulah golongan-golongan yang bersekutu,” yang bersatu dengan kekuatan, jumlah dan perlengkapan mereka untuk menolak kebenaran. Namun semua itu sama sekali tidak berguna bagi mereka. “semua mereka,” masing-masing dari mereka itu “tidak lain hanyalah mendustakan rasul-rasul,” maka pastilah mereka ditimpa oleh “azab” dari Allah. Mereka (kaum musyrikin Quraisy), apa yang dapat menyucikan dan membersihkan mereka agar tidak ditimpa oleh apa yang telah menimpa umat-umat sebelumnya?! Maka hendaklah mereka menunggu “satu teriakan saja yang tidak ada baginya saat berselang,” maksudnya, untuk kembali. Teriakan (tiupan sangkakala malaikat Israfil) itu akan membinasakan dan memusnahkan mereka jika mereka tetap ngotot pada kesesatan yang mereka anut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 13: (Dan Tsamud, kaum Luth dan penduduk Aikah) yakni penduduk kota Al-Ghidhah, mereka adalah kaum Nabi Syuaib a.s. (Mereka itulah golongan-golongan yang bersekutu menentang rasul-rasul)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan penduduk Aikah ialah penduduk Madyan Yaitu kaum Nabi Syu'aib ‘alaihis salam. Namun usaha mereka sia-sia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 13",
    "description": "Dan seperti halnya kaum nabi nuh, 'ad, dan fir'aun, kaum samud, kaum nabi lut, dan penduduk aikah, yakni kaum nabi syuaib, pun mendustakan para rasul mereka. Kaum samud dihancurkan dengan suara menggelegar, kaum nabi lut dengan hujan batu, dan penduduk aikah dengan kilat yang menyambar. Mereka itulah golongan-golongan yang bersekutu dalam menyembah berhala dan berbuat kejahatan. 14. Semua mereka itu mendustakan seruan rasul-rasul Allah, maka pantas mereka merasakan azab-ku sehingga mereka pun hancur."
  }
]