[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-14 Bala tentara yang mendustakan itu adalah bala tentara yang kalah, sebagaimana sekutu-sekutu kafir sebelum mereka juga dikalahkan. Sebelum mereka kaum nuh, ad, fir’aun pemilik kekuatan yang besar, tsamud, kaum luth, juga para penduduk desa dengan pohon-pohon dan kebun-kebun yang lebat, yaitu kaum syuaib, semuanya telah mendustakan. para umat yang bersekutu dalam kekafiran dan pendustaan dan bersatu padu di atasnya, masing-masing dari mereka tidak lain kecuali mendustakan para rasul, sehingga mereka berhak untuk diazab oleh Allah dan hukumannya pun turun menipa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Tidak ada seorang pun dari para sekutu tersebut kecuali mendustakan rasul Allah, maka mereka berhak mendapatkan azab Allah yang menimpa mereka sekalipun terkadang tertunda untuk beberapa waktu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِن كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ (Semua mereka itu tidak lain hanyalah mendustakan rasul-rasul) Yakni setiap golongan itu pasti terjerumus dalam pendustaan terhadap para rasul. فَحَقَّ عِقَابِ (maka pastilah (bagi mereka) azab-Ku) Yakni sehingga mereka berhak mendapat siksaan-Ku akibat pendustaan mereka, meskipun siksaan itu lama kedatangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Mereka semua itu tidak lain adalah para pendusta rasul-Ku, barang siapa mendustakan satu rasul maka sama seperti mendustakan semua rasul. Maka azab-Ku wajib bagi mereka atas pendustaan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Masing-masing tidak lain} masing-masing golongan tidak lain {kecuali mendustakan para rasul. Maka, Maka pantaslah mereka merasakan hukumanKu} maka mereka wajib menerima azabKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-15. Allah mewanti-wanti akan bertindak terhadap mereka seperti yang dilakukanNya terhadap umat-umat sebelum mereka yang keberadaannya jauh lebih kuat daripada mereka (kaum Quraisy) dan lebih besar jumlah koalisinya dalam kebatilan, yakni, “kaum Nuh, ‘Ad,” kaum nabi HUd, dan “Firaun yang mempunyai tentara yang banyak.” Maksudnya, bala tentara yang sangat besar jumlahnya dan (memiliki) kekuatan yang luar biasa, “dan Tsamud” yaitu kaum Nabi Shalih, “kaum Luth dan penduduk Aikah,” yang memiliki banyak pepohonan dan kebun-kebun yang rindang. Mereka adalah kaum Nabi syuaib. “Mereka itulah golongan-golongan yang bersekutu,” yang bersatu dengan kekuatan, jumlah dan perlengkapan mereka untuk menolak kebenaran. Namun semua itu sama sekali tidak berguna bagi mereka. “semua mereka,” masing-masing dari mereka itu “tidak lain hanyalah mendustakan rasul-rasul,” maka pastilah mereka ditimpa oleh “azab” dari Allah. Mereka (kaum musyrikin Quraisy), apa yang dapat menyucikan dan membersihkan mereka agar tidak ditimpa oleh apa yang telah menimpa umat-umat sebelumnya?! Maka hendaklah mereka menunggu “satu teriakan saja yang tidak ada baginya saat berselang,” maksudnya, untuk kembali. Teriakan (tiupan sangkakala malaikat Israfil) itu akan membinasakan dan memusnahkan mereka jika mereka tetap ngotot pada kesesatan yang mereka anut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 14: (Tidak lain) tiada lain (semuanya) artinya masing-masing dari golongan-golongan yang bersekutu itu (hanyalah mendustakan rasul-rasul) karena mereka telah mendustakan salah seorang dari rasul-rasul itu, ini berarti sama saja dengan mendustakan semua rasul-rasul, karena sesungguhnya seruan dan ajaran mereka satu, yaitu menyeru kepada ajaran tauhid (maka pastilah) wajiblah bagi mereka (azab-Ku)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebut mendustakan rasul-rasul karena mendustakan seorang rasul sama saja mendustakan semua rasul, di mana dakwah mereka sama, yaitu tauhid. Sedangkan mereka ini (orang-orang yang mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam), apa yang menyucikan dan membersihkan mereka sehingga mereka tidak tertimpa sesuatu yang menimpa umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 14",
    "description": "Semua mereka itu mendustakan seruan rasul-rasul Allah, maka pantas mereka merasakan azab-ku sehingga mereka pun hancur. 15. Dan apabila kaum musyrik mekah dan umat-umat durhaka terdahulu itu tetap dalam keingkaran mereka, maka sebenarnya yang mereka tunggu adalah satu teriakan saja yang tidak ada selanya. Itulah teriakan sebagai tanda datangnya hari kiamat'teriakan yang sangat keras dan cepat."
  }
]