[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu tidak menunggu turunnya azab atas mereka bila mereka tetap mempertahankan kesyirikan mereka kecuali satu tiupan yang tidak akan terulang kembali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Orang-orang yang mendustakan Muhammad -ṣallallāhu 'alaihi wa sallam- itu tidak menunggu kecuali tiupan sangkakala kedua yang tidak ada kesempatan bagi untuk kembali lagi, sehingga akan mendapatkan azab Allah jika mati dalam keadaan mendustakan para rasul tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Maka apa yang ditunggu orang-orang musyrik yang mendustakan itu setelah mengetahui azab yang menimpa umat-umat sebelum mereka? Tidak lain mereka hanya menunggu suara keras yang menimpa mereka yang tidak akan berhenti hingga suata itu membinasakan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَمَا يَنظُرُ هٰٓؤُلَآءِ إِلَّا صَيْحَةً وٰحِدَةً (Tidaklah yang mereka tunggu melainkan hanya satu teriakan saja) Yakni tidak ada yang memisahkan antara mereka dan siksaan neraka yang disiapkan Allah bagi mereka melainkan hanya tiupan kedua sangkakala. مَّا لَهَا مِن فَوَاقٍ (yang tidak ada baginya saat berselang) Makna (الفواق) adalah selang waktu antara dua perahan susu unta. Yakni jika tiupan sangkakala telah datang maka ia tidak akan berhenti selama waktu antara dua perahan susu unta. Pendapat lain mengatakan maknanya adalah mereka tidak akan tersadar kembali, tidak seperti orang sakit atau pingsan yang dapat kembali tersadar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Tidak ada yang mereka tunggu-tunggu kecuali suara yang memekakkan telinga mereka, suara itu adalah tiupan terompet sangkakala kedua. Suara itu adalah tanda mereka akan menerima azab. Tidak akan ada penundaan sama sekali sekalipun sebentar, tanpa ada selang. Maksudnya jika waktu itu telah datang maka tidak ada selang sedikitpun walaupun diupamakan dengan jalur unta"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tidak menunggu} tidan menunggu {melainkan satu teriakan } satu tiupan Sangkakala {yang tidak ada selanya} kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-15. Allah mewanti-wanti akan bertindak terhadap mereka seperti yang dilakukanNya terhadap umat-umat sebelum mereka yang keberadaannya jauh lebih kuat daripada mereka (kaum Quraisy) dan lebih besar jumlah koalisinya dalam kebatilan, yakni, “kaum Nuh, ‘Ad,” kaum nabi HUd, dan “Firaun yang mempunyai tentara yang banyak.” Maksudnya, bala tentara yang sangat besar jumlahnya dan (memiliki) kekuatan yang luar biasa, “dan Tsamud” yaitu kaum Nabi Shalih, “kaum Luth dan penduduk Aikah,” yang memiliki banyak pepohonan dan kebun-kebun yang rindang. Mereka adalah kaum Nabi syuaib. “Mereka itulah golongan-golongan yang bersekutu,” yang bersatu dengan kekuatan, jumlah dan perlengkapan mereka untuk menolak kebenaran. Namun semua itu sama sekali tidak berguna bagi mereka. “semua mereka,” masing-masing dari mereka itu “tidak lain hanyalah mendustakan rasul-rasul,” maka pastilah mereka ditimpa oleh “azab” dari Allah. Mereka (kaum musyrikin Quraisy), apa yang dapat menyucikan dan membersihkan mereka agar tidak ditimpa oleh apa yang telah menimpa umat-umat sebelumnya?! Maka hendaklah mereka menunggu “satu teriakan saja yang tidak ada baginya saat berselang,” maksudnya, untuk kembali. Teriakan (tiupan sangkakala malaikat Israfil) itu akan membinasakan dan memusnahkan mereka jika mereka tetap ngotot pada kesesatan yang mereka anut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 15: (Tiadalah yang ditunggu-tunggu) yang dinantikan (oleh mereka) oleh orang-orang kafir Mekah. (melainkan hanya satu teriakan) yaitu tiupan sangkakala untuk kiamat yang saat itu mereka ditimpa oleh azab (yang tidak ada bagi mereka saat berselang) maksudnya, sesudah itu tidak akan ada saat hidup kembali seperti di dunia. Lafal Fawaaqin dapat pula dibaca Fuwaaqin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Satu teriakan itu adalah tiupan sangkakala yang ditiup oleh malaikat Israfil, di mana hal ini menunjukkan tibanya hari Kiamat, dan teriakan ini sangat keras dan cepat yang tidak memungkinkan mereka kembali dam menolaknya. Suara keras tersebut saking kerasnya membinasakan dan menghabiskan mereka yang hidup ketika itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 15",
    "description": "Dan apabila kaum musyrik mekah dan umat-umat durhaka terdahulu itu tetap dalam keingkaran mereka, maka sebenarnya yang mereka tunggu adalah satu teriakan saja yang tidak ada selanya. Itulah teriakan sebagai tanda datangnya hari kiamat'teriakan yang sangat keras dan cepat. 16. Dan mereka dengan nada sinis dan penuh keingkaran berkata, 'ya tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan. ' dengan ucapan ini mereka bermaksud memperolok nabi yang menyampaikan bahwa ancaman yang Allah tujukan kepada mereka adalah azab di hari kiamat (lihat pula: surah al-anf'l/8: 32)."
  }
]