[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka berkata, ”wahai tuhan kami, segerakanlah bagi kami bagian dari azab kami di dunia sebelum hari kiamat tiba” ini adalah penghinaan dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Mereka berkata memperolok-olok, “Wahai Rabb kami! Segerakanlah bagian kami dari azab di dunia ini sebelum hari Kiamat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. orang-orang musyrik itu berkata untuk mengolok-olok: “Ya Tuhan kami, percepatlah azab bagi kami di dunia sebelum datang hari perhitungan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَقَالُوا۟ رَبَّنَا عَجِّل لَّنَا قِطَّنَا (Dan mereka berkata: “Ya Tuhan kami cepatkanlah untuk kami azab yang diperuntukkan bagi kami) Yakni berikanlah jatah kebaikan atau keburukan kami, dan janganlah Engkau akhirkan sampai pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Mereka berkata: Ya Allah segerakanlah siksa dan azab untuk kami sebelum hari perhitungan tiba atau hari akhirat tiba. Jangan Engkau tunda hingga datangnya hari kiamat, sebagaimana yang disampaikan Muhammad bahwa kami akan diazab saat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Wahai Tuhan kami, segerakanlah untuk kami bagian kami} bagian azab Kami {sebelum hari perhitungan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Maksudnya, orang-orang yang mendustakan itu, karena kebodohan dan sikap keras kepala, mereka berkata dengan maksud meninta supaya segera ditimpa azab, “Dan Mereka berkata, ‘Ya Rabb kami cepatkanlah untuk kami azab yang diperuntukkan bagi kami’, yakni bagian siksa dan azab yang telah diperuntukkan bagi kami sesegera mungkin, “sebelum hari berhisab.” Mereka berkeras hati mengatakan perkataan tersebut dan beranggapan, bahwa sesungguhnya engkau wahai Muhammad, jika engkau benar-benar orang yang benar, maka tanda kebenaranmu adalah kamu bisa mendatangkan azab terhadap kami. Maka Allah berfirman kepada RasulNya, “Bersabarlah atas segala apa yang mereka katakan” sebagaimana para rasul sebelummu telah bersabar, sebab sesungguhnya perkataan mereka sama sekali tidak membahayakan kebenaran dan tidak membahayakanmu sama sedikitpun,melainkan membahayakan diri mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 16: (Dan mereka berkata) sewaktu Allah menurunkan firman-Nya, \"Adapun orang-orang yang diberikan kepadanya kitabnya dari sebelah kanannya...\" (Q.S. Al-Haqqah, 19) (\"Ya Rabb kami! Segerakanlah untuk kami catatan amal kami) yakni kitab catatan amal kami (sebelum hari berhisab\") mereka mengatakan hal ini dengan nada yang sinis dan mengejek."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mendustakan itu meminta disegerakan azab karena kebodohan mereka dan penolakan mereka kepada yang hak. Ada yang mengatakan, bahwa mereka mengucapkan kata-kata ini sebagai olok-olokkan. Hal ini melebihi sikap mendustakan. Mereka mendesak sekali meminta disegerakan azab dan menganggap bahwa jika memang Nabi Muhammad shallallahu 'alaihi wa sallam itu benar, maka bukti kebenarannya adalah dengan mendatangkan azab yang diperuntukkan bagi mereka, maka Allah Subhaanahu wa Ta'aala dalam ayat selanjutnya memerintahkan Beliau untuk bersabar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 16",
    "description": "Dan mereka dengan nada sinis dan penuh keingkaran berkata, 'ya tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan. ' dengan ucapan ini mereka bermaksud memperolok nabi yang menyampaikan bahwa ancaman yang Allah tujukan kepada mereka adalah azab di hari kiamat (lihat pula: surah al-anf'l/8: 32)17. Allah meminta nabi bersabar dalam menghadapi keingkaran orang-orang musyrik, sebagaimana nabi-nabi terdahulu juga menghadapi rintangan yang sama. Bersabarlah wahai nabi Muhammad atas apa yang mereka katakan dan tuduhkan kepadamu bahwa kamu adalah pendusta dan penyihir. Dan ingatlah akan kisah seorang hamba sebelum kamu yang kami utus, yaitu nabi dawud, yang mempunyai kekuatan dalam memahami dan menjalankan ajaran agama. Sungguh dia sangat taat dan selalu mengembalikan urusannya kepada Allah. Bila merasa bersalah, ia pun segera minta ampun kepada Allah."
  }
]