[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sabarlah (wahai rasul) atas apa yang mereka katakan dari perkataan yang tidak kamu sukai, dan ingatlah hamba Kami, Dawud, pemilik kekuatan atas musuh-musuh Allah dan selau sabar menaatiNya. Sesungguhnya dia bertaubat dan kembali kepada apa yang diridhai Allah. Dalam ayat ini mengandung hiburan untuk rasulullah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sabarlah -wahai Rasul- terhadap apa yang dikatakan oleh orang-orang yang mendustakan itu yang tidak menyenangkanmu. Ingatlah hamba Kami Daud pemilik kekuatan dalam mengalahkan musuh-musuhnya dan kesabaran dalam menaati Allah, sesungguhnya dia bertobat untuk kembali kepada Allah dan mengamalkan apa yang mendatangkan rida-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai Rasulullah, bersabarlah atas perkataan mereka yang tidak ingin kamu dengar dan takut akan mendatangkan azab itu. Dan ingatlah hamba dan nabi Kami, Daud, orang yang memiliki kekuatan untuk menjalankan ketaatan Allah, dan memiliki kesabaran dan kekuatan dalam melawan musuh-musuh Allah; dia senantiasa bertaubat kepada Allah dan menuju apa yang Allah ridhai."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَاذْكُرْ عَبْدَنَا دَاوُۥدَ ذَا الْأَيْدِ ۖ (dan ingatlah hamba Kami Daud yang mempunyai kekuatan) Makna (الأيد) adalah kekuatan. إِنَّهُۥٓ أَوَّابٌ(sesungguhnya dia amat taat (kepada Tuhan)) Makna (الأواب) adalah berhenti dari segala yang dibenci Allah menuju segala yang dicintai Allah; dan tidak ada orang yang dapat melakukan ini selain orang yang memiliki agama yang kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Bersabarlah atas perkataan, kekufuran dan pendustaan mereka wahai Nabi, sungguh Kami adalah penolongmu. Ingatkanlah mereka tentang cerita nabi Dawud yang kuat, yang teguh dan istiqamah dalam agama. Dengan kekuatan yang dia miliki, dia pergunakan untuk selalu kembali kepada segala yang diridhoi dan disenangi Allah. Yang demikian itu adalah pengagungan terhadap nabi Daud atas segala maksiat yang mereka lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bersabarlah atas apa yang mereka katakan dan ingatlah akan hamba Kami, Dawud, yang mempunyai kekuatan} yang memiliki kekuatan dalam beribadan dan berperang {Sesungguhnya dia adalah orang yang selalu kembali} kembali dari setiap hal yang dibenci Allah menuju sesuatu yang dicintai olehNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Setelah Allah memerintah RasulNya untuk bersabar dalam menghadapi kaumnya, DIa memerintah beliau untuk memohon pertolongan dalam bersabar tersebut dengan beribadah hanya kepada Allah saja dan mengingat-ingat keadaan para ahli ibadah, sebagaimana dikatakanNya di dalam ayat yang lain, “Maka sabarlah kamu atas apa yang mereka katakan, dan bertasbihlah dengan memuji Tuhanmu, sebelum terbit matahari dan sebelum terbenamnya dan bertasbih pulalah pada waktu-waktu di malam hari dan pada waktu-waktu di siang hari, supaya kamu merasa senang.” (Thaha:130). Dan di antara ahli ibadah yang teragung adalah Nabiyullah Dawud, yang “mempunyai kekuatan,” maksudnya, kekuatan yang sangat besar untuk beribadah kepada Allah yang terdapat pada jasad dan dalam hatinya, “sesungguhnya dia amat taat,” maksudnya, selalu kembali kepada Allah segala permasalahannya dengan inabah kepadaNya, mencintai, menghambakan diri, takut, berharap dan selalu merendahkan diri dan berdoa kepadaNya; selalu kembali kepadaNya di kala terlanjur melakukan kekeliruan dengan cara menghentikan kesalahan itu dan beratubat dengan sebenarnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 17: Allah swt. berfirman, (\"Bersabarlah atas segala apa yang mereka katakan; ingatlah hamba Kami Daud yang mempunyai kekuatan) dalam beribadah; tersebutlah bahwa dia sepanjang tahun selalu berpuasa sehari dan berbuka sehari; bangun pada tengah malam untuk melakukan salat, kemudian tidur selama sepertiga malam dan seperenam malam harinya lagi ia gunakan untuk salat (sesungguhnya dia amat taat) yakni selalu mengerjakan hal-hal yang menjadi keridaan Allah swt."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sebagaimana para rasul sebelummu bersabar. Hal itu, karena ucapan mereka tidaklah merugikan kebenaran sedikit pun dan mereka tidak merugikanmu sedikit pun, yang mereka rugikan adalah diri mereka sendiri. Setelah Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk bersabar terhadap sikap kaumnya, maka Allah Subhaanahu wa Ta'aala memerintahkan Beliau untuk meminta bantuan agar dapat bersabar dengan beribadah kepada Allah Subhaanahu wa Ta'aala saja dan mengingat keadaan orang-orang yang ahli ibadah sebagaimana dalam ayat lain, “Maka bersabarlah kamu atas apa yang mereka katakan, dan bertasbihlah dengan memuji Tuhanmu, sebelum terbit matahari dan sebelum terbenamnya dan bertasbih pulalah pada waktu-waktu di malam hari dan pada waktu-waktu di siang hari, agar kamu merasa senang,” (Terj. Thaha: 130) Di antara ahli ibadah yang mulia adalah Nabi Dawud ‘alaihis salam. Yakni kuat dalam beribadah baik dengan anggota badannya maupun dengan hatinya. Rasulullah shallallahu 'alaihi wa sallam bersabda: أَحَبُّ الصَّلاَةِ إِلَى اللَّهِ صَلاَةُ دَاوُدَ - عَلَيْهِ السَّلاَمُ - وَأَحَبُّ الصِّيَامِ إِلَى اللَّهِ صِيَامُ دَاوُدَ ، وَكَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ ، وَيَصُومُ يَوْماً وَيُفْطِرُ يَوْماً “Shalat yang paling dicintai Allah adalah shalat Nabi Dawud ‘alaihis salam, dan puasa yang paling dicintai Allah adalah puasa Nabi Dawud. Beliau tidur di tengah malam, bangun di sepertiganya dan tidur di seperenamnya. Beliau berpuasa sehari dan berbuka sehari.” (HR. Bukhari dan Muslim). Kata “Awwaab” artinya banyak kembali kepada Allah dalam segala urusan, yaitu dengan kembali kepada-Nya, mencintai-Nya, beribadah kepada-Nya, takut dan berharap kepada-Nya, banyak bertadharru’ dan berdoa. Demikian pula kembali kepada-Nya ketika tergelincir, yaitu dengan berhenti melakukan dosa tersebut dan bertobat dengan tobat nasuha (yang murni)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 17",
    "description": "Allah meminta nabi bersabar dalam menghadapi keingkaran orang-orang musyrik, sebagaimana nabi-nabi terdahulu juga menghadapi rintangan yang sama. Bersabarlah wahai nabi Muhammad atas apa yang mereka katakan dan tuduhkan kepadamu bahwa kamu adalah pendusta dan penyihir. Dan ingatlah akan kisah seorang hamba sebelum kamu yang kami utus, yaitu nabi dawud, yang mempunyai kekuatan dalam memahami dan menjalankan ajaran agama. Sungguh dia sangat taat dan selalu mengembalikan urusannya kepada Allah. Bila merasa bersalah, ia pun segera minta ampun kepada Allah. 18-20. Karena ketaatan nabi dawud, sungguh kami telah menganugerahinya beberapa kenikmatan. Kamilah yang menundukkan gunung-gunung yang kukuh untuk senantiasa bertasbih dan beribadah bersama dia pada waktu petang dan pagi. Kami tundukkan pula baginya burung-burung untuk bertasbih bersamanya dalam keadaan terkumpul maupun terbang. Burung-burung itu ikut bertasbih begitu mendengar suara nabi dawud yang merdu bertasbih dan melantunkan kitab zabur. Masing-masing dari gunung-gunung dan burung-burung itu sangat taat kepada Allah. Dan kami kuatkan kerajaannya dengan kewibawaan, tentara yang banyak, kekayaan yang berlimpah, dan kepiawaiannya mengatur strategi perang. Dan kami berikan hikmah kepadanya berupa kenabian, kesempurnaan ilmu, dan ketelitian dalam berbuat serta pemahaman yang tepat (lihat pula: surah saba'/34: 10'11), dan kebijaksanaan dalam memutuskan perkara dengan menunjukkan bukti-bukti yang akurat."
  }
]