[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Sesungguhnya Kami menundukan gunung-gunung untuk Dawud, ia bertasbih bersama tasbihnya di pagi hari dan petang hari, dan Kami menundukan burung bersamanya dengan berkumpul untuk bertasbih bersamanya dan menaati dan mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Sesungguhnya Kami menundukkan gunung-gunung untuk Daud yang bertasbih dengan tasbih Daud di petang dan pagi hari, dan saat matahari terbit."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Kami menjadikan gunung-gunung bertasbih bersama Daud pada pagi dan sore hari, dan burung-burung pun bertasbih bersamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. بِالْعَشِىِّ وَالْإِشْرَاقِ (di waktu petang dan pagi) Muqatil berkata: jika Daud berzikir kepada Allah maka gunung-gunung akan ikut berzikir bersamanya, dan dia mampu memahami tasbih gunung-gunung itu yang dilakukan setiap pagi dan sore hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Sesungguhnya Kami telah menundukkan gunung-gunung beserta Daud, mereka selalu bertasbih kepada Allahpagi maupun petang. Itu menunjukkan bahwa mereka terus menerus bertasbih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah menundukkan gunung-gunung untuk bertasbih bersamanya pada waktu petang dan pagi} akhir dan permulaan siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. Di antara kesungguhan inabah dan ibadahnya kepada Rabbnya adalah, Allah menundukkan gunung-gunung untuk turut bertasbih berasamanya dengan memuji Rabbnya, “di waktu petang dan pagi,” pada waktu menjelang siang dan menjelang malam, “dan” Allah juga menundukkan “burung-burung dalam keadaan terkumpul,” yakni bergerombolan dan terhimpun. “Masing-masing,” baik gunung maupun burung “kepadaNya” kepada Allah “amat taat”, sebagai pengamalan terhadap Firman Allah, “\"Hai gunung-gunung dan burung-burung, bertasbihlah berulang-ulang bersama Daud\", (Saba:10). Itu adalah karunia Allah kepadanya yakni kekuatan dalam ibadah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 18: (Sesungguhnya Kami menundukkan gunung-gunung untuk bertasbih bersama dia di waktu petang) di waktu salat Isyak (dan pagi) di waktu salat Duha, yaitu di waktu matahari mencapai sepenggalah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 18",
    "description": "18-20. Karena ketaatan nabi dawud, sungguh kami telah menganugerahinya beberapa kenikmatan. Kamilah yang menundukkan gunung-gunung yang kukuh untuk senantiasa bertasbih dan beribadah bersama dia pada waktu petang dan pagi. Kami tundukkan pula baginya burung-burung untuk bertasbih bersamanya dalam keadaan terkumpul maupun terbang. Burung-burung itu ikut bertasbih begitu mendengar suara nabi dawud yang merdu bertasbih dan melantunkan kitab zabur. Masing-masing dari gunung-gunung dan burung-burung itu sangat taat kepada Allah. Dan kami kuatkan kerajaannya dengan kewibawaan, tentara yang banyak, kekayaan yang berlimpah, dan kepiawaiannya mengatur strategi perang. Dan kami berikan hikmah kepadanya berupa kenabian, kesempurnaan ilmu, dan ketelitian dalam berbuat serta pemahaman yang tepat (lihat pula: surah saba'/34: 10'11), dan kebijaksanaan dalam memutuskan perkara dengan menunjukkan bukti-bukti yang akurat"
  }
]