[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Sesungguhnya Kami menundukan gunung-gunung untuk Dawud, ia bertasbih bersama tasbihnya di pagi hari dan petang hari, dan Kami menundukan burung bersamanya dengan berkumpul untuk bertasbih bersamanya dan menaati dan mengikutinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Kami menundukkan burung-burung tertahan di angkasa, semuanya patuh, bertasbih bersamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَالطَّيْرَ مَحْشُورَةً ۖ (dan (Kami tundukkan pula) burung-burung dalam keadaan terkumpul) Yakni burung-burung juga berkumpul untuk bertasbih kepada Allah bersama Daud. كُلٌّ لَّهُۥٓ أَوَّابٌ (Masing-masingnya amat taat kepada Allah) Yakni gunung-gunung dan burung-burung bertasbih demi bertasbih bersama Daud."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Juga burung-burung Kami tundukkan dengan Kami kumpulkan, mereka senantiasa bertasbih kepada Allah. Semua itu adalah bukti bahwa mereka selalu kembali kepada ketaatan kepada Allah. Mereka tunduk dan berserah diri kepada Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan burung-burung dalam keadaan berkumpul} dikumpulkan kepadanya {Masing-masing sangat patuh kepadanya} patuh bertasbih mengikutinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. Di antara kesungguhan inabah dan ibadahnya kepada Rabbnya adalah, Allah menundukkan gunung-gunung untuk turut bertasbih berasamanya dengan memuji Rabbnya, “di waktu petang dan pagi,” pada waktu menjelang siang dan menjelang malam, “dan” Allah juga menundukkan “burung-burung dalam keadaan terkumpul,” yakni bergerombolan dan terhimpun. “Masing-masing,” baik gunung maupun burung “kepadaNya” kepada Allah “amat taat”, sebagai pengamalan terhadap Firman Allah, “\"Hai gunung-gunung dan burung-burung, bertasbihlah berulang-ulang bersama Daud\", (Saba:10). Itu adalah karunia Allah kepadanya yakni kekuatan dalam ibadah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 19: (Dan) Kami tundukkan pula (burung-burung dalam keadaan berkumpul) berkumpul untuk bertasbih bersama dengan dia. (Masing-masing) dari gunung-gunung dan burung-burung itu (amat taat kepada-Nya) taat bertasbih kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik gunung-gunung maupun burung-burung. Apa yang Allah sebutkan di atas merupakan nikmat Allah Subhaanahu wa Ta'aala kepada Nabi Dawud ‘alaihis salam untuk beribadah kepada-Nya. Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepadanya berupa kerajaan yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 19",
    "description": "18-20. Karena ketaatan nabi dawud, sungguh kami telah menganugerahinya beberapa kenikmatan. Kamilah yang menundukkan gunung-gunung yang kukuh untuk senantiasa bertasbih dan beribadah bersama dia pada waktu petang dan pagi. Kami tundukkan pula baginya burung-burung untuk bertasbih bersamanya dalam keadaan terkumpul maupun terbang. Burung-burung itu ikut bertasbih begitu mendengar suara nabi dawud yang merdu bertasbih dan melantunkan kitab zabur. Masing-masing dari gunung-gunung dan burung-burung itu sangat taat kepada Allah. Dan kami kuatkan kerajaannya dengan kewibawaan, tentara yang banyak, kekayaan yang berlimpah, dan kepiawaiannya mengatur strategi perang. Dan kami berikan hikmah kepadanya berupa kenabian, kesempurnaan ilmu, dan ketelitian dalam berbuat serta pemahaman yang tepat (lihat pula: surah saba'/34: 10'11), dan kebijaksanaan dalam memutuskan perkara dengan menunjukkan bukti-bukti yang akurat"
  }
]