[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2 (shad) pembicaraan tentang huruf-huruf yang terpisah-pisah (diawal surat seperi ini) telah hadir di awal surat al-baqarah. Allah swt bersumpah dengan al-qur’an yang berisi tentang peringatan manusia dari apa-apa yang mereka lalaikan. tetapi orang-orang kafir itu justru menyombongkan diri di depan kebenaran dan menyimpang darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Akan tetapi orang-orang kafir itu berada di atas fanatisme berat dan kesombongan sehingga mereka menolak mentauhidkan Allah dan selalu menentang dan memusuhi Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. بَلِ الَّذِينَ كَفَرُوا۟ فِى عِزَّةٍ وَشِقَاقٍ (Sebenarnya orang-orang kafir itu (berada) dalam kesombongan dan permusuhan yang sengit) Seakan-akan Allah menyatakan bahwa hal ini sama sekali tidak diragukan; yakni orang-orang musyrik yang enggan menerima kebenaran itu sama sekali tidak diragukan, namun mereka dalam keangkuhan dan kesombongan dan keengganan menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Bal berfungsi untuk menekankan kalimat awal kepada kalimat sesudahnya. Sesungguhnya orang-orang kafir dalam ketinggian yang menipu, yaitu kesombongan dan permusuhan dan pertikaian yang sengit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Akan tetapi orang-orang kafir (berada) dalam kesombongan} meremehkan kebenaran dan sombonh {dan permusuhan} menentang dan melawan Nabi SAW"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Kalau al-Quran seperti itu sifatnya, maka dapat diketahui bahwa kebutuhan manusia kepadanya adalah meresponnya dengan mengimani, membenarkan, dan seruis untuk mengambil pelajaran darinya. Maka Allah memberi petunjuk kepada orang-orang yang mendapatkan petunjuk untuknya, sedangkan orang-orang kafir menolaknya dan menolak menurunkannya, dan mereka selalu bersikap sombong dan memusuhi, sombong, dan menolak untuk beriman kepadanya, congkak dan memusuhinya. Artinya, menentang dan memusuhi dalam menolak, merusaknya dan dalam memperolok-olokkan Nabi yang datang membawanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 2",
    "description": "Sekalipun mengetahui kedudukan Al-Qur'an, tetapi orang-orang yang kafir tetap dalam kesombongan mereka dengan mengingkari wahyu dan menampakkan permusuhan terhadap rasulullah dan ajaran yang di-sampaikannya. Mereka berbuat demikian salah satunya karena mere-ka menialai ajaran nabi mengancam eksistensi agama nenek moyang mereka dan patung sesembahan mereka. 3. Kami telah mengingatkan melalui nabi Muhammad betapa banyak umat sebelum mereka yang telah kami binasakan akibat kesombongan dan keingkaran terhadap utusan Allah, lalu mereka meminta tolong pada saat azab itu datang, padahal waktu itu bukanlah saat yang tepat untuk meminta pertolongan dan mereka tidak bisa lari melepaskan diri dari siksa itu (lihat pula: surah g'fir/40: 84)."
  }
]