[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami menguatkan kerajaannya dengan kemegahan, kekuatan dan kemenangan, dan Kami memberikan kenabian kepadanya dan kecakapan berbicara dan menetapkan hokum."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Kami menguatkan kerajaannya dengan apa yang telah Kami berikan kepadanya berupa kewibawaan, kekuatan dan kemenangan atas musuh-musuhnya. Kami memberinya kenabian dan kebenaran dalam urusan-urusannya. Kami memberinya penjelasan yang menyeluruh dalam segala tujuan dan keakuratan dalam pembicaraan dan menetapkan hukum."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Dan Kami kuatkan kerajaannya dengan kewibawaan, kekuatan, kebijaksanaan dan kemenangan. Dan Kami memberinya kenabian dan keutamaan dalam ucapan dan keputusan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَشَدَدْنَا مُلْكَهُۥ (Dan Kami kuatkan kerajaannya) Kami Kami kuatkan dan kokohkan dia dengan kemenangan dalam berbagai pertempuran melawan musuh-musuhnya, serta Kami masukkan rasa takut terhadap Duad ke dalam dada pada musuh itu. وَءَاتَيْنٰهُ الْحِكْمَةَ (dan Kami berikan kepadanya hikmah) Yakni kenabian dan pengetahuan tentang hukum yang dia tetapkan. وَفَصْلَ الْخِطَابِ (dan kebijaksanaan dalam menyelesaikan perselisihan) Yakni kebijaksanaan dalam setiap keputusan. Dan pendapat lain mengatakan maknanya adalah memiliki kemampuan untuk merangkai kalimat yang memiliki makna yang luas dalam kata-kata yang singkat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Kami jadikan keraajaannya kuat, Kami tetapkan wibawa dan kekuatan atas musuh-musuhnya. Kami anugerahkan kenabian kepadanya, beserta kesempurnaan ilmu dan kebenaran dalam perkataan dan perbuatan, dan dapat menyelesaikan segala permasalahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menguatkan kerajaannya} Kami menguatkan kerajaannya dengan kemuliaan, pertolongan dan tentara yang banyak {serta menganugerahkan kepadanya hikma} kenabian {dan kemampuan dalam menyelesaikan perkara} kemampuan menentukan pembicaraan dan hukum"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Kemudian Allah menyebutkan karuniaNya kepada beliau, yaitu kerajaan agung, seraya berfirman, “dan Kami kuatkan kerajaannya,” maksudnya, Kami mengokohkannya dengan apa-apa yang Kami anugerahkan kepadanya, seperti berbagai fasilitas, banyaknya jumlah pasukan dan perlengkapan yang dengannya Allah menguatkan kerajaannya. Kemudian Allah menyebutkan karuniaNya yang lain kepada beliau berupa ilmu, seraya berfirman, “Dan Kami berikan kepadanya hikmah,” maksudnya, kenabian dan ilmu yang agung, “dan kebijaksanaan dalam menyelesaikan perselisihan,” yakni pertikaian dan perselisihan di antara manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 20: (Dan Kami kuatkan kerajaannya) Kami kuatkan kerajaannya itu dengan para penjaga dan bala tentara; dan setiap malam mihrab Nabi Daud selalu dijaga oleh tiga puluh ribu pasukan (dan Kami berikan, kepadanya hikmah) yakni, kenabian dan ketepatan dalam berbagai perkara (dan kebijaksanaan dalam menyelesaikan perselisihan\") yaitu penjelasan yang memuaskan dalam semua urusan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami kuatkan dia dengan pemberian dari Kami berupa sebab-sebab untuk menguatkannya, banyaknya jumlah dan perlengkapan yang dengannya Allah Subhaanahu wa Ta'aala kuatkan kerajaan-Nya. Selanjutnya, Allah Subhaanahu wa Ta'aala menyebutkan nikmat-Nya kepadanya dengan ilmu sebagaimana pada lanjutan ayat di atas. Yang dimaksud hikmah di sini ialah kenabian, kesempurnaan ilmu dan tepatnya dalam bertindak dan berbuat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 20",
    "description": "18-20. Karena ketaatan nabi dawud, sungguh kami telah menganugerahinya beberapa kenikmatan. Kamilah yang menundukkan gunung-gunung yang kukuh untuk senantiasa bertasbih dan beribadah bersama dia pada waktu petang dan pagi. Kami tundukkan pula baginya burung-burung untuk bertasbih bersamanya dalam keadaan terkumpul maupun terbang. Burung-burung itu ikut bertasbih begitu mendengar suara nabi dawud yang merdu bertasbih dan melantunkan kitab zabur. Masing-masing dari gunung-gunung dan burung-burung itu sangat taat kepada Allah. Dan kami kuatkan kerajaannya dengan kewibawaan, tentara yang banyak, kekayaan yang berlimpah, dan kepiawaiannya mengatur strategi perang. Dan kami berikan hikmah kepadanya berupa kenabian, kesempurnaan ilmu, dan ketelitian dalam berbuat serta pemahaman yang tepat (lihat pula: surah saba'/34: 10'11), dan kebijaksanaan dalam memutuskan perkara dengan menunjukkan bukti-bukti yang akurat. 21-22. Dan apakah telah sampai kepadamu, wahai nabi Muhammad, suatu berita tentang orang-orang yang berselisih saat nabi dawud sedang berada di tempat peribadatan, ketika mereka datang dengan cara memanjat dinding mihrab' yaitu ketika mereka masuk untuk menemui nabi dawud lalu dia terkejut karena kedatangan mereka yang tak terduga itu dan me-ngira mereka hendak berbuat tidak baik kepadanya. Mereka berkata untuk menenangkan hatinya, 'janganlah takut! wahai nabi dawud, kami berdua sedang berselisih tentang suatu perkara; sebagian dari kami berbuat zalim kepada yang lain, maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus dan benar."
  }
]