[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22 apakah telah datang kepadamu (wahai rasul) berita dua orang yang berselisih yang menyelinap masuk kepada dawud di tempat ibadahnya, sehingga hal itu mengejutkannya? mereka berkata kepadanya, ”jangan takut, kami adalah dua seteru, salah seorang dari kami telah berbuat dzolim kepada yang lain, maka putuskanlah perkara diantara kami dengan adil, jangan berbuat zhalim dalam menetapkan hokum dan bimbinglah kami ke jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Apakah telah datang kepadamu -wahai Rasul- berita dua orang yang berselisih saat keduanya memanjat mihrab tempat ibadah Daud -'alaihissalām-?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21-22. Hai Muhammad, apakah telah datang kepadamu dan kepada kaummu kisah dua orang yang berselisih dalam perkara yang mengherankan; ketika mereka memanjat pagar mihrab Daud dan memasuki tempat peribadatannya, sehingga Daud merasa takut ketika mereka masuk. Mereka kemudian berkata kepadanya: “Janganlah kamu takut, kami dua orang yang berselisih; salah satu dari kami telah menzalimi lainnya, maka berilah kami keputusan hukum secara adil, janganlah kamu berbuat zalim dalam memberi ketetapan, dan tunjukkanlah kepada kami jalan yang benar dan adil.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَهَلْ أَتَىٰكَ نَبَؤُا۟ الْخَصْمِ إِذْ تَسَوَّرُوا۟ الْمِحْرَابَ (Dan adakah sampai kepadamu berita orang-orang yang berperkara ketika mereka memanjat pagar?) Allah mengutus dua malaikat kepada Daud agar mengingatkannya untuk bertaubat. Mereka mendatanginya dari atas pagarnya kemudian turun di mihrab tempat dia menjalankan ibadah. Ibnu Abbas meriwayatkan bahwa Daud pernah melihat istri dari Uria sedang mandi, dan ia membuat Daud takjub. Maka Daud menjadikan Uria pasaukan terdepan dalam peperangannya sehingga dia terbunuh. Setelah istrinya telah selesai melalui masa ‘iddah, Daud melamarnya kemudian menikahinya; maka dua malikat mendatanginya dengan memanjat pagar menuju mihrabnya, dan perkara mereka berdua telah dikisahkan oleh Allah dalam kitab-Nya; dan Daud lalu sujud bersimpuh memohon ampun dari Allah, maka Allah mengampuninya dan menerima taubatnya. Sebagian ulama mengingkari kebenaran kisah ini mengenai istri Uria, mereka mengatakan: kedua orang itu bukanlah dua malaikat namun manusia biasa yang saling berselisih dalam perkara kambing mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Wahai nabi, apakah cerita tentang orang-orang yang memanjat pagar itu. Ketika mereka turun dari pagar pembatas para sesembahan yang mereka sembah. Khasm adalah bentuk jamak dan mufrad."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah telah sampai kepadamu berita} kabar {orang-orang yang berselisih} orang-orang yang saling berselisih {ketika mereka memanjat} memanjat {dinding mihrab} tempat ibadah Dawud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Setelah Allah menjelaskan bahwasanya Dia telah menganugerahkan kepada NabiNya dawud, kebijaksanaan dalam menyelesaikan perselisihan di antara manusia, hingga ia menjadi terkenal dengan sifat itu dan menjadi sandaran, maka Allah menyebutkan berita tentang dua orang yang berselisih di hadapannya dalam suatu perkara yang mana keduanya dijadikan oleh Allah sebagai fitnah (cobaan) bagi Nabi Dawud. Lalu Allah menerima taubat dan mengampuninya, dan Allah menakdirkan perkara tersebut baginya. Maka Allah berkata kepada NabiNya, Muhammad, “Dan adakah sampai kepadamu berita orang-orang yang berperkara?” sebab ia merupakan berita yang sangat menakjubkan, “ketika mereka memanjat pagar” untuk menemui Dawud “ di mihrab,” yaitu tempat ibadah beliau tanpa izin dan mita izin terlebih dahulu, mereka tidak masuk untuk menjumpainya lewat pintu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 21: (Dan adakah) Istifham atau kata tanya di sini mengandung makna Ta'ajjub dan Tasywiq, atau dengan kata lain mengandung makna yang mendorong dan merangsang pendengar untuk mendengarkan kalimat-kalimat selanjutnya (sampai kepadamu) hai Muhammad (berita orang-orang yang berperkara ketika mereka memanjat pagar mihrab?) yaitu mihrab Nabi Daud, yang dimaksud adalah mesjidnya; demikian itu terjadi karena mereka dilarang masuk, sebab Nabi Daud sedang beribadah. Akhirnya mereka masuk dengan memanjat pagar mihrabnya. Makna ayat ialah apakah kamu telah mendengar berita dan kisah mereka?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa Dia telah memberikan kepada Nabi-Nya Dawud ‘alaihis salam kebijaksanaan dalam memutuskan perkara di antara manusia, dan Beliau sudah terkenal dengan kebijaksanaannya dalam memberikan keputusan, maka Allah Subhaanahu wa Ta'aala menyebutkan berita dua orang yang bertengkar tentang suatu masalah di hadapan Nabi Dawud yang Allah Subhaanahu wa Ta'aala jadikan sebagai ujian bagi Nabi Dawud dan sebagai nasihat terhadap ketergelincirannya, maka Allah Subhaanahu wa Ta'aala menerima tobatnya dan mengampuninya. Mihrab Dawud di sini maksudnya adalah masjidnya atau tempat ibadahnya atau tempat utama di rumahnya yang dia pakai untuk ibadah. Ketika itu, Beliau memerintahkan agar tidak ada yang masuk menemuinya pada hari itu, tetapi ada dua orang yang masuk tanpa meminta izin dan tidak melewati pintu, bahkan dengan memanjat dinding, sehingga Nabi Dawud ‘alaihis salam terkejut dan takut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 21",
    "description": "21-22. Dan apakah telah sampai kepadamu, wahai nabi Muhammad, suatu berita tentang orang-orang yang berselisih saat nabi dawud sedang berada di tempat peribadatan, ketika mereka datang dengan cara memanjat dinding mihrab' yaitu ketika mereka masuk untuk menemui nabi dawud lalu dia terkejut karena kedatangan mereka yang tak terduga itu dan me-ngira mereka hendak berbuat tidak baik kepadanya. Mereka berkata untuk menenangkan hatinya, 'janganlah takut! wahai nabi dawud, kami berdua sedang berselisih tentang suatu perkara; sebagian dari kami berbuat zalim kepada yang lain, maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus dan benar"
  }
]