[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Salah seorang dari keduanya berkata ’sesungguhnya ini adalah saudaraku, dia memiliki Sembilan puluh Sembilan kambing, sedangkan aku hanya memiliki satu ekor saja, lalu dia menginginkannya dan berkata kepadaku, ”berikanlah kambing-kambingmu kepadaku” dan dia mengalahkanku dengan hujjahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Salah seorang dari keduanya berkata kepada Daud -'alaihissalām- “Sesungguhnya laki-laki ini adalah saudaraku, dia mempunyai sembilan puluh sembilan ekor domba betina, dan aku punya seekor saja, dia meminta kepadaku agar memberikannya kepadanya, dia mengalahkan hujahku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Salah satu dari mereka berkata: “Temanku ini memiliki 99 ekor domba, sedangkan aku hanya memiliki satu ekor saja. Akan tetapi temanku ini masih ingin merebut domba milikku dengan berkata, ‘Berikanlah domba itu kepadaku’, dan dia berkata kepadaku dengan keras dan memaksaku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِنَّ هٰذَآ أَخِى لَهُۥ تِسْعٌ وَتِسْعُونَ نَعْجَةً (Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina) Kemudian salah seorang dari mereka berdua mengatakan ini. Makna (النعجة) yakni domba betina, dan terkadang kata ini juga dipakai untuk sapi liar betina. وَلِىَ نَعْجَةٌ وٰحِدَةٌ (dan aku mempunyai seekor saja) Orang arab mengistilahkan istri dengan domba betina atau mengumpamakan wanita dengan sapi betina. فَقَالَ أَكْفِلْنِيهَا (Maka dia berkata: “Serahkanlah kambingmu itu kepadaku) Yakni berikanlah domba betinamu kepadaku agar dapat aku gabung dengan domba-domba betinaku yang lain dan agar dombamu itu dalam tanggungan dan perawatanku. وَعَزَّنِى فِى الْخِطَابِ(dan dia mengalahkan aku dalam perdebatan”) Yakni dia mengalahkanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesungguhnya dia ini adalah saudaraku, dia mempunyai 99 kambing betina sedangkan aku hanya mempunyai satu saja. Dia berkata: serahkan kambingmu kepadaku, biarkan aku memilikinya, sehingga kambing itu menjadi kelompok kambingku. Dia telah mengalahkanku dalam menjelaskan hujjah atas perdebatan kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Sesungguhnya ini saudaraku. Dia mempunyai sembilan puluh sembilan ekor kambing betina, sedangkan aku mempunyai seekor kambing. Lalu dia berkata,”Biarkan aku yang memeliharanya} berilah aku hewan itu {Lalu dia mengalahkanku} lalu dia mengalahkanku {dalam perdebatan”} dalam perdebatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Maksudnya adalah, bahwa kedua orang yang bersengketa ini telah diketahui bahwa tujuan mereka adalah mencari kebenaran yang jelas lagi murni. Jika demikian, maka mereka akan menceritakan kepada Dawud tentang informasi mereka dengan benar. Nabiyullah Dawud sama sekali tidak merasa muak oleh nasihat mereka berdua padanya dan tidak pula mencela keduanya, di mana salah satu dari keduanya berkata, “Sesungguhnya saudaraku ini,” artinya ia menyatakan persaudaraan seagama atau seketurunan atau persahabatan untuk menyatakan tidak adanya perbuatan zhalim, dan bahwa perbuatan zhalimnya yang keluar darinya lebih besar daripada yang lain; “mempunyai Sembilan puluh Sembilan ekor kambing betina.” Ini adalah suatu keuntungan yang sangat besar yang patut diterima dengan puas hati atas apa yang telah dikaruniakan Allah, “dan aku mempunyai seekor saja.” Lalu ia berambisi memilikinya. “Maka ia berkata, ‘Serahkanlah kambingmu itu kepadaku’,” maksudnya, biarkanlah semuanya padaku dalam tanggunganku, “dan dia mengalhkan aku dalam perdebatan.” Yakni, dia telah mengalahkanku dalam perkataan, dan ia terus mengalahkanku atau hampir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 23: (Sesungguhnya saudaraku ini) maksudnya, saudara seagamaku ini (mempunyai sembilan puluh sembilan ekor kambing) ini sebagai kata kiasan dari istri (dan aku mempunyai seekor saja. Maka dia berkata, 'Serahkanlah kambing itu kepadaku) yakni jadikanlah aku sebagai suaminya (dan dia mengalahkan aku) atau dia menang atas diriku (dalam perdebatan'\") yakni dalam sengketa ini, dan lawannya pun mengalah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Hafizh Ibnu Katsir berkata, “Di sini para mufassir menyebutkan kisah yang kebanyakan diambil dari cerita israiliyyat, dan tidak ada hadits shahih pun yang wajib diikuti tentang hal ini dari Rasul yang ma’shum shallallahu 'alaihi wa sallam. Akan tetapi, Ibnu Abi Hatim meriwayatkan di sini sebuah hadits yang tidak shahih sanadnya karena melalui riwayat Yazid Ar Raqaasyi dari Anas radhiyallahu 'anhu. Yazid meskipun termasuk orang-orang saleh, tetapi lemah haditsnya menurut para imam. Oleh karena itu, sebaiknya membatasi diri dengan membaca kisah ini dan mengembalikan pengetahuan tentang hal itu kepada Allah ‘Azza wa Jalla. Karena Al Qur’an adalah hak dan kandungannya juga hak. Mereka (para mufassir) menyebutkan, bahwa orang yang bertengkar itu adalah malaikat Jibril dan Mikail, dan dhamir (kata ganti nama) jama’ pada kata “tasawwaruu” kembalinya kepada keduanya karena melihat lafaz khashm. Sedangkan kata na’jah (kambing betina) menurut mereka adalah kiasan untuk wanita, maksudnya adalah ibu Sulaiman, sedangkan sebelumnya ia adalah istri Auriya’ sebelum dinikahi Dawud dan perkataan lainnya yang disebutkan yang tidak sahih.” Yakni saudara seagama, senasab atau seperkawanan. Ini adalah kebaikan yang banyak yang seharusnya disikapi dengan qanaa'ah (diterima dengan apa adanya). Dari susunan perkataan mereka berdua dapat diketahui bahwa seperti itulah kenyataannya, oleh karena itu tidak perlu yang satu lagi berbicara sehingga tidak bisa dikatakan, “Mengapa Nabi Dawud ‘alaihis salam langsung memutuskan sebelum mendengar perkataan orang yang satunya lagi?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 23",
    "description": "Berusaha menjelaskan duduk perkara, salah satu dari kedua orang itu mengatakan, 'sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor kambing betina saja, lalu dia berkata kepadaku sambil menuntut, 'serahkanlah kam-bing betinamu itu kepadaku!' dan dia mengalahkan aku karena aku tidak mempunyai dalih yang kuat dalam perdebatan itu. '24. Nabi dawud menyimak aduan pria itu, lalu dia memberi keputusan seraya berkata, 'sungguh, dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk ditambahkan kepada kambingnya sehingga kambingnya bertambah banyak. Memang banyak di antara orang-orang yang bersekutu itu berbuat zalim kepada yang lain karena pihak yang lemah tidak memiliki bukti yang menguatkan perkaranya. Banyak yang berbuat zalim, kecuali orang-orang yang beriman dan mengerjakan ke-bajikan yang menjunjung tinggi keadilan, dan hanya sedikitlah mereka yang begitu. ' dan setelah memberi putusan berdasarkan aduan sepihak itu, nabi dawud sadar dan menduga bahwa kami mengujinya; maka dia segera memohon ampunan kepada tuhannya atas kekeliruannya, lalu dia menyungkur sujud dan bertobat."
  }
]