[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dawud berkata ‘saudaramu itu telah menzhalimimu dengan meminta satu ekor kambingmu itu untuk digabungkan dengan kambing-kambingnya dan sesungguhnya tidak sedikit partner yang melakukan pelanggaran terhadap yang lain dan menzhaliminya dengan mengambil haknya dan tidak menetapkan keadilan untuk dirinya kecuali orang-orang mukmin yang shalih, sebagian dari mereka tidak melanggar sebagain yang lain dan mereka berjumlah sedikit. dan dawud pun mengetahui bahwa Kami mengujinya dengan perseteruan ini, maka dia memohon ampun kepada tuhannya, dia bersujud mendekatkan diri kepada Allah, kembali dan bertaubat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Daud menetapkan keputusan di antara keduanya, dia berkata kepada pihak yang mengadu, \"Saudaramu telah menzalimimu ketika dia meminta seekor dombamu untuk digabungkan dengan domba-dombanya, dan sesungguhnya kebanyakan dari para sekutu, sebagian dari mereka melakukan pelanggaran terhadap sebagian lainnya dengan mengambil hak partnernya dan berlaku tidak adil, kecuali orang-orang beriman yang melakukan amal-amal saleh, mereka adalah orang-orang yang berlaku adil kepada partner-partner mereka dan tidak menzalimi mereka, orang-orang yang seperti itu tidak banyak. Dan Daud -'alaihissalām- pun yakin bahwa Kami hanya mengujinya dengan pertikaian dua orang ini, maka dia meminta ampunan kepada Rabbnya dan sujud mendekatkan diri kepada Allah serta bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Daud berkata: “Temanmu itu telah menzalimimu dengan meminta dombamu agar dapat menggenapkan dombanya menjadi 100 ekor. Sungguh banyak dari orang-orang yang berserikat, sebagiannya menzalimi sebagian lainnya dengan merampas haknya dan merasa tidak puas dengan apa yang telah dimiliki; kecuali orang-orang beriman yang shalih, mereka ini tidak menzalimi orang lain, menunaikan hak, dan merasa puas; akan tetapi orang yang seperti ini sangat sedikit.” Kemudian Daud menyadari bahwa Kami sedang mengujinya dengan perselisihan itu, sehingga dia memohon ampun atas kesalahannya, sebab dia hanya mendengar alasan dari satu pihak saja, lalu segera menentukan hukum. Dia sujud bersimpuh dan memohon ampun dari Tuhannya. Sehingga Kami mengampuni kesalahannya dan Kami kabulkan doanya, dan Kami menjadikannya termasuk orang-orang yang didekatkan kepada Kami, dan Kami siapkan baginya kemuliaan, kedekatan, dan tempat kembali yang baik di sisi Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِۦ ۖ (Daud berkata: “Sesungguhnya dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk ditambahkan kepada kambingnya) Daud menganggap salah apa yang dia dengar berupa permintaan orang yang memiliki 99 ekor domba betina ini untuk menyerahkan domba betina satu-satunya milik temannya itu. An-Nahhas berkata: bahwa kesalahan Daud adalah ketika dia berkata “dia telah berbuat zalim” karena dia mengatakan itu sebelum meminta klarifikasi, sebab bisa jadi pemilik satu domba betina itulah yang berbuat zalim. وَإِنَّ كَثِيرًا مِّنَ الْخُلَطَآءِ(Dan sesungguhnya kebanyakan dari orang-orang yang berserikat itu) Yakni orang-orang yang berserikat dalam harta mereka. لَيَبْغِى بَعْضُهُمْ عَلَىٰ بَعْضٍ(sebahagian mereka berbuat zalim kepada sebahagian yang lain) Yakni menzalimi dengan tidak memperhatikan hak temannya. إِلَّا الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ(kecuali orang-orang yang beriman dan mengerjakan amal yang saleh) Karena mereka menjauhi sifat zalim, mereka tidak menzalimi orang yang berserikat dengan mereka atau menzalimi orang lain. وَقَلِيلٌ مَّا هُمْ ۗ( dan amat sedikitlah mereka ini) Yakni mereka amat sedikit. وَظَنَّ دَاوُۥدُ أَنَّمَا فَتَنّٰهُ(Dan Daud mengetahui bahwa Kami mengujinya) Dia meyakini bahwa Kami sedang mengujinya dan dia mengetahui bahwa dialah yang dimaksud dalam perselisihan dua orang itu, sebab dia telah memanfaatkan kekuasaannya untuk menang atas temannya sehingga dapat menikahi istri temannya itu. فَاسْتَغْفَرَ رَبَّهُۥ(aka ia meminta ampun kepada Tuhannya) Atas dosanya. وَخَرَّ رَاكِعًا(lalu menyungkur sujud) Yakni dia bersujud. Allah menggunakan kata ruku’ untuk mengungkapkan kata sujud. وَأَنَابَ(dan bertaubat) Yakni kembali kepada Allah dengan bertaubat dari dosanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dawud berkata: Saudaramu telah mendholimimu, atas permintaannya itu. Sesungguhnya kebanyakan orang yang kerjasama dalam harta, biasanya saling menyalahi satu sama lain. Kecuali orang-orang yang beriman dan beramal saleh. Mereka tidak akan mendholimi siapapun, namun mereka sedikit sekali. Huruf ma berfungsi untuk menekankan jumlah yang sedikit. Daud pun tahu, bahwa Kami telah mengujinya atas kejadian yang mendadak dalam memberi keputusan ini. Yaitu takut kepada manusia, padahal Daud bertanggung jawab di depan tuhannya, berbeda dengan kakeknya Ibrahim yang tidak terpengaruh dengan manusia. Sehingga Dawud memohon ampun kepada tuhannya atas dosa dan prasangka buruknya kepada kedua orang yang mendatanginya akan membunuhnya, karena dia merasa sendirian di mihrab/kamarnya. Sehingga dia langsung tersungkur bersujud dan bertaubat kepada Allah dan kembali kepada ketaatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} {Dawud AS berkata {“Sungguh, dia benar-benar telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk (digabungkan) dengan kambing-kambingnya. Sesungguhnya banyak di antara orang-orang yang berserikat itu} berserikat {benar-benar saling merugikan} benar-benar merugikan {satu sama lain, kecuali orang-orang yang beriman dan beramal shalih, dan sedikit sekali mereka itu”} dan mereka itu sedikit {Daud meyakini} meyakini {bahwa Kami hanya mengujinya} mengujinya {Lalu dia memohon ampunan kepada Tuhannya dan dia tersungkur jatuh} bersujud {serta kembali} kembali kepada Allah dengan bertaubat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Maka Nabi Dawud berkata demikian tadi setelah mendengar perkataannya. Dan merupakan hal yang telah dimaklumi dari konteks terdahulu, dari perkataan mereka berdua, bahwa yang demikian itulah yang terjadi, maka dari itu, yang satu tidak perlu untuk bicara dan juga tidak ada alasan untuk menentang dengan perkataan yang mengatakan, “kenapa Dawud memberikan keputusan sebelum mendengar pembicaraan lawan sengketa orang itu?” “SEsungguhnya dia telah berbuat zhalim kepadamu dengan meminta kambingmu itu untuk ditambahkan kepada kambingnya,” dan inilah kebiasaan orang-orang yang berserikat, kebiasaan kebanyakan mereka. Beliau berkata, “Dan sesungguhnya kebanyakan dari orang-orang yang berserikat itu sebagian mereka berbuat zhalim kepada sebagain yang lain,” sebab kezhaliman itu merupakan sifat (ciri khas) nya nafsu. “Kecuali orang-orang yang beriman dan mengerjakan amal yang shalih,” sebab iman dan amal-amal shalih yang mereka miliki dapat mencegah mereka melakukan kezhaliman, “Dan amat sedikitlah mereka ini,” seperti yang difirmankan Allah, “Dan sedikit sekali dari hamba-hamba Ku yang berterima kasih.” (Saba:13). “Dan Dawud mengetahui” pada saat memberikan keputusan di antara mereka berdua, “bahwa kami mengujinya.” Kami memberinya cobaan dan kami yang merekayasa persengketaan itu kepadanya agar ia waspada, “maka ia meminta ampun kepada Rabbnya” atas keluputan yang terjadi dari dirinya “lalu menyungkur rukuk,” maksudnya, bersujud, “dan kembali” kepada Allah dengan bertaubat yang tulus dan beribadah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 24: (Daud berkata, \"Sesungguhnya dia telah berbuat lalim kepadamu dengan meminta kambingmu itu) dengan maksud untuk menggabungkannya (untuk ditambahkan kepada kambingnya. Sesungguhnya kebanyakan dari orang-orang yang berserikat itu) yakni orang-orang yang terlibat dalam satu perserikatan (sebagian mereka berbuat lalim kepada sebagian yang lain, kecuali orang-orang yang beriman dan mengerjakan amal yang saleh; dan amat sedikitlah mereka ini\") huruf Ma di sini untuk mengukuhkan makna sedikit. Lalu kedua malaikat itu naik ke langit dalam keadaan berubah menjadi ujud aslinya seraya berkata, \"Lelaki ini telah memutuskan perkara terhadap dirinya sendiri.\" Sehingga sadarlah Nabi Daud atas kekeliruannya itu. Lalu Allah berfirman, (Dan Daud yakin) yakni merasa yakin (bahwa Kami mengujinya) Kami menimpakan ujian kepadanya, berupa cobaan dalam bentuk cinta kepada perempuan itu (maka ia meminta ampun kepada Rabbnya lalu menyungkur rukuk) maksudnya bersujud (dan bertobat.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni iman dan amal saleh yang mereka lakukan menghalangi mereka berbuat zalim. Yaitu ketika memberikan keputusan di antara keduanya. Yakni Kami mengujinya dan mengatur masalah itu untuknya agar ia sadar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 24",
    "description": "Nabi dawud menyimak aduan pria itu, lalu dia memberi keputusan seraya berkata, 'sungguh, dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk ditambahkan kepada kambingnya sehingga kambingnya bertambah banyak. Memang banyak di antara orang-orang yang bersekutu itu berbuat zalim kepada yang lain karena pihak yang lemah tidak memiliki bukti yang menguatkan perkaranya. Banyak yang berbuat zalim, kecuali orang-orang yang beriman dan mengerjakan ke-bajikan yang menjunjung tinggi keadilan, dan hanya sedikitlah mereka yang begitu. ' dan setelah memberi putusan berdasarkan aduan sepihak itu, nabi dawud sadar dan menduga bahwa kami mengujinya; maka dia segera memohon ampunan kepada tuhannya atas kekeliruannya, lalu dia menyungkur sujud dan bertobat. 25. Setelah nabi dawud meminta ampun dan bertobat kepada Allah, lalu kami mengampuni kesalahan yang ia sadari itu. Dan lantaran ke-sadaran dan ketajaman nuraninya sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi kami dan berhak mendapatkan tempat kembali yang baik, surga yang penuh kenikmatan."
  }
]