[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami mengampuninya dan menjadikankannya termasuk orang-orang yang dekat kepada Kami. Kami menyipakan untuknya di akhirat tempat kembali yang baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Kami mengabulkan permohonannya, Kami mengampuninya, sesungguhnya dia di sisi Kami termasuk hamba-hamba yang dekat, baginya tempat kembali yang baik di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ(Dan sesungguhnya dia mempunyai kedudukan dekat pada sisi Kami dan tempat kembali yang baik) Makna (الزلفى) yakni kedekatan dan kemuliaan setelah ampunan dari dosanya. Dan makna (حسن المآب) yakni tempat kembali yang baik yaitu surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Maka kami ampuni kesalahannya atas prasangka buruk kepada dua orang tersebut. Dia memiliki kedudukan yang dekat dan kemuliaan di sisi Kami, dia akan masuk pada sebaik-baik tempat kembali yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Kami mengampuni hal itu. Sesungguhnya di sisi Kami dia mempunyai kedudukan yang benar-benar dekat} kedekatan dan kedudukan {dan tempat kembali} tempat kembali di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “Maka Kami ampuni baginya kesalahannya” yang terjadi darinya dan Allah memuliakannya dengan berbagai macam karamah. Allah berfirman, “Dan sesungguhnya dia mempunyai dekat pada sisi Kami.” Maksudnya, kedudukan tinggi dan kedekatan kepada Kami, “dan tempat kembali yang baik,” yakni tempat berpulang yang baik. Dosa yang terjadi dari Nabi Dawud ini tidak dijelaskan oleh Allah, karena tidak ada faidahnya kalau dijelaskan. Siapa pun yang mencoba membahasnya maka itu merupakan sikap memaksakan diri. Sedangkan yang mengandung faidah adalah apa yang telah Allah kisahklan kepada kita, yaitu kelembutan Allah padanya, menerima taubat dan inabahnya, dan kedudukannya yang makin tinggi. Dan setelah Nabi Dawud bertaubat, kedudukannya lebih baik dari sebelumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 25: (Maka Kami ampuni baginya kesalahannya itu. Dan sesungguhnya dia mempunyai kedudukan dekat pada sisi Kami) yakni dengan ditambahkan kebaikan baginya di dunia (dan tempat kembali yang baik) kelak di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tidak disebutkan kesalahan Nabi Dawud ‘alaihis salam karena tidak perlu disebutkan. Oleh karena itu, berusaha mencarinya merupakan sikap berlebihan dan membebani diri. Yang penting adalah faedah dari kisah itu, yaitu kelembutan Allah kepadanya, demikian pula tobat Nabi Dawud dan kembalinya kepada-Nya, dan bahwa kedudukan Beliau tinggi di sisi Allah, dan setelah tobat keadaan Beliau menjadi lebih baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 25",
    "description": "Setelah nabi dawud meminta ampun dan bertobat kepada Allah, lalu kami mengampuni kesalahan yang ia sadari itu. Dan lantaran ke-sadaran dan ketajaman nuraninya sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi kami dan berhak mendapatkan tempat kembali yang baik, surga yang penuh kenikmatan. 26. Karena ketaatan, kebijaksanaan, dan ilmunya yang luas, Allah memilih nabi dawud sebagai khalifah, 'wahai nabi dawud! sesungguhnya engkau telah kami jadikan khalifah dan penguasa di bumi. Karena itu, hiasilah kekuasaanmu dengan kesopanan dan tunduk pada aturan kami. Maka berilah keputusan tentang suatu perkara yang terjadi di antara manusia dengan adil dan mengacu pada wahyu kami, dan janganlah engkau mengikuti hawa nafsu dalam menjalankan amanah kami karena hawa nafsu akan menyesatkan engkau dari jalan Allah dan menggiringmu jauh dari kebenaran. ' sungguh, orang-orang yang sesat dari jalan Allah akibat mengikuti hawa nafsu akan mendapat azab yang berat dan pedih di akhirat. Yang demikian itu karena mereka melupakan hari perhitungan, hari ketika perbuatan manusia dihisab. Ayat ini menunjukkan bahwa seorang pemimpin harus bersikap adil, amanah, dan mendahulukan kepentingan umum daripada kepentingan pribadi."
  }
]