[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "wahai dawud, sesungguhnya Kami menjadikanmu berkuasa dan memiliki kerajaan di muka bumi, maka putuskanlah hokum diantara manusia dengan adil dan obyektif. Dan jangan mengikuti hawa nafsu dalam menetapkan hukum karena hal itu akan menyesatkanmu dari agama dan syariat Allah. sesungguhnya orang-orang yang tersesat dari jalan Allah akan mendapatkan siksa yang pedih di dalam api neraka, karena kelalaian mereka terhadap hari pembalasan dan perhitungan amal. Dalam ayat ini terkandung pesan kepada ulil amri (pemerintah) agar mereka menetapkan hukum dengan berpijak kepada kebenaran yang diturunkan dari Allah swt dan tidak menyimpang darinya karena hal itu akan menyesatkan mereka dari jalannNya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Wahai Daud! Sesungguhnya Kami mengangkatmu sebagai khalifah di muka bumi untuk menegakkan hukum-hukum dan perkara-perkara agama dan dunia, maka putuskanlah di antara manusia dengan adil, jangan mengikuti hawa nafsu dalam memutuskan perkara di antara manusia, di mana kamu condong kepada salah seorang dari dua orang yang berselisih karena adanya hubungan kekerabatan atau pertemanan atau kamu berpaling darinya karena adanya permusuhan, akibatnya hawa nafsu menyesatkanmu dari jalan Allah yang lurus. Sesungguhnya orang-orang yang tersesat dari jalan Allah yang lurus akan mendapatkan azab yang berat karena mereka melupakan hari hisab, sebab andai mereka mengingatnya dan takut kepadanya, niscaya mereka tidak memperturutkan hawa nafsu mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Hai Daud, Kami menjadikanmu khalifah dan penguasa di bumi; maka berilah keputusan di antara manusia dengan adil, dan janganlah kamu menuruti hawa nafsu dalam memutuskan perkara, karena itu dapat menyesatkanmu dari agama dan syariat Allah. Sungguh orang-orang yang tersesat dari jalan Allah, mengikuti hawa nafsunya, dan berpaling dari syariat Allah, maka mereka akan mendapatkan azab yang keras dan menyakitkan akibat kelalaian mereka dari akhirat dan hari pembalasan di hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَـَٔابٍ(Dan sesungguhnya dia mempunyai kedudukan dekat pada sisi Kami dan tempat kembali yang baik) Makna (الزلفى) yakni kedekatan dan kemuliaan setelah ampunan dari dosanya. Dan makna (حسن المآب) yakni tempat kembali yang baik yaitu surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Wahai Dawud, sesungguhnya Kami telah menjadikanmu sebagai khalifah di kerajaan di bumi untuk menjadi hakim atas permasalahan manusia. Maka hukumilah permasalahan manusia dengan penuh keadilan. Jangan kau ikuti hawa nafsu, yang akan menjauhkanmu dari bukti-bukti kebenaran. Sesungguhnya orang-orang yang menentang perintah Allah dan petunjuk-Nya mereka akan mendapatkan azab yang pedih atas keacuhan dan ketidakpedulian mereka untuk beramal sebagai bekal hari perhitungan di akhirat, Dia Maha Adil dalam memutuskan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Dawud, sesungguhnya Kami menjadikanmu khalifah di bumi. Maka berilah keputusan di antara manusia dengan adil} adil {dan janganlah mengikuti hawa nafsu sehingga menyesatkanmu dari jalan Allah. Sesungguhnya orang-orang yang sesat dari jalan Allah, bagi mereka itu azab yang berat, karena mereka melupakan hari perhitungan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Hai Dawud, sesungguhnya Kami menjadikan kamu khalifah di muka bumi,” di sana engkau menerapkan berbagai persoalan agama dan dunia, “maka berilah keputusan di antara manusia dengan haq.” maksudnya, dengan adil. Hal ini tidak mungkin dapat beliau lakukan kecuali dengan ilmu pengetahuaan tentang yang wajib, pengetahuan tentang realita dan kemampuan menegakkan yang haq, “dan jangaanlah kamu mengikuti hawa nafsu,” seperti lebih condong kepada seseorang karena adanya hubungan keluarga, atau hubungan persahabatan, rasa cinta atau rasa tidak suka kepada yang lain. “Karena ia akan menyesatkan kamu,” maksudnya, hawa nafsu, “dari jalan Allah,” dan mengeluarkanmu dari jalan yang lurus. “SEsungguhnya orang-orang yang sesat dari jalan Allah,” terutama orang-orang yang berbuat sengaja di antara mereka, “akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.” Kalau saja mereka mengingatnya da nada rasa takut di dalam hati mereka, tentu mereka tidak condong bersama hawa nafsu yang menyesatkan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 26: (Hai Daud, sesungguhnya Kami menjadikan kamu khalifah penguasa di muka bumi) yaitu sebagai penguasa yang mengatur perkara manusia (maka berilah keputusan perkara di antara manusia dengan adil dan janganlah kamu mengikuti hawa nafsu) kemauan hawa nafsu (karena ia akan menyesatkan kamu dari jalan Allah) dari bukti-bukti yang menunjukkan keesaan-Nya. (Sesungguhnya orang-orang yang sesat dari jalan Allah) dari iman kepada Allah (mereka akan mendapat siksa yang berat karena mereka melupakan) artinya, disebabkan mereka lupa akan (hari perhitungan) hal ini ditunjukkan oleh sikap mereka yang tidak mau beriman, seandainya mereka beriman dengan adanya hari perhitungan itu, niscaya mereka akan beriman kepada Allah sewaktu mereka di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Beliau ditugaskan oleh Allah memberlakukan syariat-Nya dan mengatur siasat untuk memimpin umat. Hal ini tidak mungkin terlaksana kecuali dengan mengetahui yang wajib (mengetahui syariat), mengetahui realita dan memiliki kemampuan untuk mewujudkan yang hak (benar). Seperti memihak salah satunya karena hubungan kerabat, teman atau rasa suka, atau benci kepada yang lain. Khususnya dengan sengaja. Kalau mereka mengingat hari perhitungan dan rasa takut terhadapnya masuk ke dalam hati mereka, tentu mereka tidak akan menyimpang dari kebenaran mengikuti hawa nafsu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 26",
    "description": "Karena ketaatan, kebijaksanaan, dan ilmunya yang luas, Allah memilih nabi dawud sebagai khalifah, 'wahai nabi dawud! sesungguhnya engkau telah kami jadikan khalifah dan penguasa di bumi. Karena itu, hiasilah kekuasaanmu dengan kesopanan dan tunduk pada aturan kami. Maka berilah keputusan tentang suatu perkara yang terjadi di antara manusia dengan adil dan mengacu pada wahyu kami, dan janganlah engkau mengikuti hawa nafsu dalam menjalankan amanah kami karena hawa nafsu akan menyesatkan engkau dari jalan Allah dan menggiringmu jauh dari kebenaran. ' sungguh, orang-orang yang sesat dari jalan Allah akibat mengikuti hawa nafsu akan mendapat azab yang berat dan pedih di akhirat. Yang demikian itu karena mereka melupakan hari perhitungan, hari ketika perbuatan manusia dihisab. Ayat ini menunjukkan bahwa seorang pemimpin harus bersikap adil, amanah, dan mendahulukan kepentingan umum daripada kepentingan pribadi. 27. Usai menegaskan adanya hari perhitungan, Allah beralih menjelas-kan bukti-bukti kekuasaan-Nya di jagat raya. Dan sungguh, kami tidak serta-merta menciptakan langit dan bumi dan apa yang ada di antara keduanya, seperti bintang, matahari, dan bulan, dengan sia-sia dan tanpa manfaat tertentu (lihat pula: surah ad-dukh'n/44: 38'39). Itu semua adalah anggapan orang-orang kafir yang tidak memercayai kekuasaan Allah, maka celakalah orang-orang yang kafir itu karena mereka akan masuk ke neraka yang telah Allah persiapkan untuk mereka."
  }
]