[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidak menciptakan langit dan bumi serta apa yang ada diantara keduannya hanya untuk sekedar main-main dan iseng. Itulah dugaan orang-orang kafir, maka celaka mereka, mereka akan masuk kedalam api neraka di hari kiamat, karena dugaan batil, karena duugaan batil mereka dan kekafiran mereka kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kami tidak menciptakan langit dan bumi karena iseng. Itu hanyalah dugaan orang-orang kafir. Celakalah orang-orang kafir yang menduga dengan dugaan demikian, mereka mendapatkan azab Neraka pada hari Kiamat bila mereka mati di atas kekufuran dan prasangka buruk kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Tidaklah Kami menciptakan langit, bumi, dan seisinya -berupa berbagai makhluk yang menakjubkan, beraneka ragam, dan penuh ketelitian- untuk sesuatu yang batil dan sia-sia. Dan keyakinan bahwa makhluk-makhluk ini diciptakan tanpa mengandung hikmah merupakan keyakinan orang-orang kafir. Maka neraka bagi mereka akibat pada hari kiamat kekafiran dan prasangka buruk mereka terhadap Allah Yang Menciptakan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَمَا خَلَقْنَا السَّمَآءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بٰطِلًا ۚ( Dan Kami tidak menciptakan langit dan bumi dan apa yang ada antara keduanya tanpa hikmah) Namun Allah menciptakan keduanya sebagai bukti kekuasaan-Nya, serta agar ketaatan kepada-Nya dilakukan di langit dan bumi. ذٰلِكَ ظَنُّ الَّذِينَ كَفَرُوا۟ ۚ( Yang demikian itu adalah anggapan orang-orang kafir) Mereka menganggap bahwa hal-hal ini diciptakan tanpa tujuan; mereka juga mengatakan bahwa hari kiamat dan hari kebangkitan tidak akan datang, sehingga penciptaan makhluk-makhluk ini tidak memiliki tujuan. فَوَيْلٌ لِّلَّذِينَ كَفَرُوا۟ مِنَ النَّارِ (maka celakalah orang-orang kafir itu karena mereka akan masuk neraka) Akibat kekafiran dan anggapan mereka yang batil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kami tidak menciptakan langit dan bumi dan segala apa yang ada di antara keduanya hanya main-main dan sia-sia. Namun Kami menciptakan keduanya sebagai bukti atas kekuasaan Kami. Sangkaan bahwa semua itu diciptakan hanya main-main dan tanpa tujuan juga tidak akan ada hari kiamat adalah sangkaan orang-orang kafir. Maka azab dan kebinasaan pada neraka Jahannam adalah bagi mereka orang-orang kafir atas kekufuran mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menciptakan langit dan bumi serta apa yang ada di antara keduanya secara sia-sia} sia-sia dan main-main {Itulah anggapan orang-orang yang ingkar. Maka celakalah} celakalah {orang-orang yang ingkar karena (masuk) neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Allah memberitahu tentang kesempuranaan hikmahNya dalam penciptaan langit dan bumi, dan sesungguhnya Dia tidak menciptakannya “sebagai suatu yang batil,” artinya, dengan sia-sia dan main-main, tanpa ada faidah ataupun maslahatnya. “Yang demikian itu adalah anggapan orang-orang kafir” terhadap Rabb mereka, di mana mereka meyakini apa yang tidak pantas bagi kebesaranNya. “Makaa celakalah orang-orang kafir itu, karena mereka akan masuk neraka.” Nerakalah yang akan mengambil yang hak dari mereka dan akan menghanguskan mereka. Sebab, sesungguhnya Allah menciptakan langit dan bumi ini dengan (alasan) yang hak dan untuk (tujuan) yang hak. Allah menciptakan keduanya agar manusia mengetahui kemahasempurnaan ilmuNYa, kemampuanNYa dan keluasan KuasaNya, dan bahwa sesungguhnya hanya Allah semata sembahan, bukan yang tidak pernah menciptakan sebesar biji sawi pun dari langit dan bumi ini; dan sesungguhnya kebangkitan itu benar adanya dan Allah akan memberikan keputusan antara para pelaku kebaikan dan para pelaku keburukan. Dan hendaknya orang yang tidak mengetahui (bodoh) terhadap hikmah (kebijaksanaan) Allah, tidak menyangka bahwa Allah akan menyetarakan antara kedua golongan itu dalam putusan hukumNya kelak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 27: (Dan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan batil) dengan main-main. (Yang demikian itu) yakni penciptaan hal tersebut tanpa hikmah (adalah anggapan orang-orang kafir) dari penduduk Mekah (maka neraka Waillah) Wail adalah nama sebuah lembah di neraka (bagi orang-orang yang kafir karena mereka akan masuk neraka.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang sempurnanya hikmah (kebijaksanaan)-Nya dalam menciptakan langit dan bumi, dan bahwa Dia tidaklah menciptakan keduanya sia-sia (tanpa hikmah, faedah dan maslahat). Mereka beranggapan dengan anggapan yang tidak layak dengan kebesaran Allah Subhaanahu wa Ta'aala. Yakni biarlah neraka yang mengambil hak yang mereka abaikan itu. Allah Subhaanahu wa Ta'aala menciptakan langit dan bumi dengan kebenaran dan untuk kebenaran, Dia menciptakan keduanya (langit dan bumi) untuk memberitahukan kepada hamba sempurnanya ilmu-Nya, kemampuan-Nya, luasnya kekuasaan-Nya, dan bahwa Dia yang berhak disembah tidak selain-Nya yang tidak mampu menciptakan apa-apa, dan bahwa kebangkitan adalah hak, dan bahwa Allah akan memutuskan masalah yang terjadi antara orang-orang yang baik dan orang-orang yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 27",
    "description": "Usai menegaskan adanya hari perhitungan, Allah beralih menjelas-kan bukti-bukti kekuasaan-Nya di jagat raya. Dan sungguh, kami tidak serta-merta menciptakan langit dan bumi dan apa yang ada di antara keduanya, seperti bintang, matahari, dan bulan, dengan sia-sia dan tanpa manfaat tertentu (lihat pula: surah ad-dukh'n/44: 38'39). Itu semua adalah anggapan orang-orang kafir yang tidak memercayai kekuasaan Allah, maka celakalah orang-orang yang kafir itu karena mereka akan masuk ke neraka yang telah Allah persiapkan untuk mereka. 28. Allah menegaskan perbedaan perlakuan-Nya kepada orang ber-iman dan orang kafir. Pantaskah kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan serta percaya akan keesaan kami sama dengan orang-orang yang berbuat kerusakan di bumi dan tidak mau mengikuti petunjuk kami' atau pantaskah kami menganggap orang-orang yang bertakwa dan patuh pada perintah kami sama dengan orang-orang yang jahat, ingkar, dan sombong'."
  }
]