[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah pantas Kami menjadikan orang-orang yang beriman dan beramal shalih sama seperti orang-orang yang berbuat kerusakan di bumi, atau Kami menjadikan orang-orang yang bertakwa lagi beriman sama seperti para pelaku dosa yang kafir? penyamaan ini tidak layak bagi Allah denan segala kebijaksanaan dan keputusan Allah maka mereka semua tidak sama di sisi Allah, karena Allah akan memberikan pahala bagi orang-orang mukmin yang bertakwa dan menghukum orang-orang yang merusak lagi celaka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Kami tidak akan menyamakan orang-orang yang beriman kepada Allah, mengikuti Rasul-Nya dan beramal saleh dengan orang-orang yang berbuat kerusakan di bumi dengan kekufuran dan kemaksiatan. Kami tidak menyamakan orang-orang yang bertakwa kepada Rabb mereka dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya dengan orang-orang kafir dan munafik yang larut dalam kemaksiatan. Menyamakan di antara mereka merupakan kezaliman yang tidak layak bagi Allah -Subḥānahu wa Ta'ālā-. Tetapi Allah akan membalas orang-orang Mukmin yang bertakwa dengan memasukkan mereka ke dalam Surga, dan menghukum orang-orang kafir yang sengsara dengan memasukkan mereka ke dalam Neraka, karena mereka di sisi Allah tidak sama, maka balasan masing-masing di sisi Allah juga tidak sama."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Apakah mungkin Kami menjadikan orang-orang yang beriman dan beramal shalih seperti orang-orang yang berbuat kerusakan di bumi yang ingkar terhadap Tuhan? Dan apakah mungkin Kami menjadikan orang-orang baik dan bertakwa kepada Tuhan mereka seperti orang-orang kafir yang selalu berbuat dosa?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. أَمْ نَجْعَلُ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ كَالْمُفْسِدِينَ فِى الْأَرْضِ(Patutkah Kami menganggap orang-orang yang beriman dan mengerjakan amal yang saleh sama dengan orang-orang yang berbuat kerusakan di muka bumi?) Yakni apakah Kami menjadikan orang-orang yang beriman kepada Allah dan mempercayai rasul-rasul-Nya serta menjalankan kewajiban mereka itu seperti orang-orang yang berbuat kerusakan di bumi dengan kekafiran dan kemaksiatan? أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ (Patutkah (pula) Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang berbuat maksiat?) Yakni apakah Kami juga menjadikan orang-orang yang beriman dan bertakwa seperti orang-orang kafir, munafik, dan orang-orang Islam yang tenggelam dalam kemasiatan kepada Allah. Jika kami melakukaan demikian maka itu bukanlah suatu keadilan. Kalaulah hari kebangkitan, hari perhitungan dan pembalasan tidak ada niscaya mereka semua akan bernasib sama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Patutkah Kami menjadikan orang-orang yang beriman kepada Allah dan rasul-Nya, serta mengerjakan perintah-Nya layaknya mereka orang-orang musyrik dan pembuat kedurhakaan di dunia. Juga patutkah Kami jadikan orang-orang yang bertaqwa layaknya orang-orang kafir munafik dan durhaka? Maka sekali-kali tidak ada kesamaan antara mereka. Kata am bisa berfungsi dua makna, bal untuk menekankan kalimat kedua. Fungsi selanjutnya seperti hamzah iistifham untuk mengingkari, sehingga kalimat sesudahnya menjadi nafi. Sehingga kalimat sesudahnya ada penyamaan makna antara atqiya’ dan asyrar. Fujjar bermakna orang-orang fasik yang berusaha keras untuk menutup terhadap syariat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah (pantas) Kami menjadikan orang-orang yang beriman dan beramal shalih itu seperti orang-orang yang berbuat kerusakan di bumi. Ataukah (pantas) Kami menjadikan orang-orang yang bertakwa itu seperti orang-orang yang durhaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Maka dari itu Dia berfirman, “Patutkah Kami menganggap orang-orang yang beriman dan mengerjakan amal yang shalih sama dengan orang-orang yang berbuat kerusakan di muka bumi? Patutkah pula Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang berbuat maksiat?” ini sama sekali tidak patut bagi kebijakan dan keputusan Kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 28: (Patutkah Kami menganggap orang-orang yang beriman dan mengerjakan amal yang saleh sama dengan orang-orang yang berbuat kerusakan di muka bumi? Patutkah pula Kami menganggap orang-orang yang bertakwa sama dengan orangorang yang berbuat maksiat?) Ayat ini diturunkan sewaktu orang-orang kafir Mekah berkata kepada orang-orang yang beriman, \"Sesungguhnya kami kelak di hari kemudian akan diberi seperti apa yang diberikan kepada kalian.\" Lafal Am di sini untuk menunjukkan makna sanggahan, yakni jelas tidak sama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni janganlah orang yang tidak mengetahui tentang kebijaksanaan Allah Subhaanahu wa Ta'aala menyamakan antara orang-orang yang baik dan yang buruk dalam hukum-Nya. Hal ini tentu tidak layak dengan kebijaksanaan Allah dan hukum-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 28",
    "description": "Allah menegaskan perbedaan perlakuan-Nya kepada orang ber-iman dan orang kafir. Pantaskah kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan serta percaya akan keesaan kami sama dengan orang-orang yang berbuat kerusakan di bumi dan tidak mau mengikuti petunjuk kami' atau pantaskah kami menganggap orang-orang yang bertakwa dan patuh pada perintah kami sama dengan orang-orang yang jahat, ingkar, dan sombong'29. Wahai nabi Muhammad, sesungguhnya kitab Al-Qur'an yang telah kami turunkan kepadamu adalah kitab yang penuh berkah. Kami menurunkannya agar mereka menghayati dan memahami ayat-ayatnya dan agar orang-orang yang berakal sehat menggunakan akal budinya untuk mendapat pelajaran darinya dan mengamalkan kandungannya."
  }
]