[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang diwahyukan kepadamu ini, (wahai rasul) adalah sebuah kitab yang Kami turunkan kepadamu yang diberkahi agar mereka merenungkan ayat-ayatnya dan melaksanakan kandungan dan petunjuknya, dan agar orang-orang yang memiliki akal yang lurus merenungkan apa yang Allah bebankan kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Sesungguhnya Al-Qur`ān ini yang Kami turunkan kepadamu wahai Nabi berisi banyak manfaat dan kebaikan, supaya manusia merenungkan ayat-ayatnya dan memikirkan makna-maknanya, dan supaya orang-orang yang memiliki akal sehat dan cerdas mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Hai Muhammad, al-Qur’an yang Kami turunkan kepadamu ini merupakan kitab yang mulia dan diberkahi, mengandung banyak kebaikan, keberkahan, dan manfaat di dunia dan di akhirat. Kami menurunkannya agar kalian dapat menghayati ayat-ayatnya dan mentadabburi petunjuk dan bukti-buktinya; agar orang-orang yang berakal sehat dapat mengamalkan dan menjadikannya peringatan atas apa yang telah Allah turunkan bagi mereka dan hidayah yang telah Allah tunjukkan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. كِتٰبٌ أَنزَلْنٰهُ إِلَيْكَ مُبٰرَكٌ(Ini adalah sebuah kitab yang Kami turunkan kepadamu penuh dengan berkah) Yakni al-Qur’an yang Kami turunkan kepadamu ini hai Muhammad, mengandung banyak kebaikan dan keberkahan. لِّيَدَّبَّرُوٓا۟ ءَايٰتِهِۦ(supaya mereka memperhatikan ayat-ayatnya) Yakni Kami menurunkannya agar difikirkan dan direnungkan makna-maknanya. وَلِيَتَذَكَّرَ أُو۟لُوا۟ الْأَلْبٰبِ(dan supaya mendapat pelajaran orang-orang yang mempunyai fikiran) Yakni dan agar orang yang berakal itu mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Inilah kitab yang Kami turunkan kepadamu wahai Nabi, terdapat banyak kebaikan dan manfaat. Agar mereka mengkaji makna ayat-ayatnya. Juga orang-orang yang berakal untuk dapat mengambil nasihat darinya, kemudian mengamalkannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kitab yang Kami turunkan kepadamu itu penuh berkah} memiliki banyak kebaikan dan manfaat {supaya mereka menghayati ayat-ayatnya} berpikir tentang ayat-ayatnya, sehingga mereka mendalaminya dan mengamalkannya {dan agar orang-orang yang berakal sehat} orang-orang yang berakal sehat {mengambil pelajaran} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Ini adalah sebuah kitab yang Kami turunkan kepadamu penuh dengan berkah.” Di dalamnya terkandung banyak kebaikan dan ilmu yang banyak. Dan di dalamnya terdapat banyak kebaikan dan ilmu yang banyak. Dan di dalamnya terdapat setiap petunjuk dari kesesatan, penawar dari segala penyakit dan cahaya yang dapat dijadikan penerang di dalam berbagai kegelapan serta segala hukum yang dibutuhkan oleh orang-orang mukallaf. Dan di dalamnya juga terdapat dalil-dalil qath’I (pasti) untuk segala hal yang diinginkan, yang menjadikannya sebagai suatu kitab paling agung yang pernah mengetuk dunia ini semenjak diciptakan oleh Allah, “supaya mereka memperhatikan ayat-ayatnya.” Maksudnya, inilah hikmah diturunkannya al-Quran ini, yaitu agar manusia merenungkan ayat-ayatnya lalu mereka mendapatkan ilmunya, dan agar mereka menghayati rahasia-rahasia dan hikmah-hikmahnya. Sebab sesungguhnya dengan menghayatinya, merenungkan makna-maknanya dan kembali memikirkannya secara berulang-ulang akan diketahui berkah dan kebaikan di dalamnya. Ini menunjukkan anjuran (himbauan) untuk menghayati dan merenungkan al-Quran, dan ia termasuk amal yang oaling utama, dan bahwa bacaan yang disertai dengan penhayatan itu lebih utama, daripada bacaan cepat yang maksud seperti ini tidak akan bisa dicapai. “Dan supaya orang-orang yang mempunyai pikiran mendapat pelajaran,” maksudnya, orang-orang yang berakal sehat. Dengan perenungan dan penghayatan yang mereka lakukan itu mereka dapat mempelajari berbagai ilmu dan segala apa yang dicari. Ini membuktikan bahwa pelajaran dan manfaat dari al-qur’an itu dapat diperoleh tergantung kepada daya akal dan pikiran seseorang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 29: (Ini adalah sebuah Kitab) menjadi Khabar dari Mubtada yang tidak disebutkan, yakni, Ini adalah Kitab (yang Kami turunkan kepadamu penuh dengan berkah supaya mereka memperhatikan) asal lafal Yaddabbaruu adalah Yatadabbaruu, kemudian huruf Ta diidghamkan kepada huruf Dal sehingga jadilah Yaddabbaruu (ayat-ayatnya) maksudnya supaya mereka memperhatikan makna-makna yang terkandung di dalamnya, lalu mereka beriman karenanya (dan supaya mendapat pelajaran) mendapat nasihat (orang-orang yang mempunyai pikiran) yaitu yang berakal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, di dalam Al Qur’an terdapat kebaikan dan ilmu yang banyak, terdapat petunjuk dari kesesatan, terdapat obat dari penyakit, cahaya sebagai penerang di tengah kegelapan, dan terdapat hukum yang dibutuhkan oleh manusia. Di dalamnya terdapat dalil yang qath’i untuk semua tuntutan agama, di mana kitab tersebut merupakan kitab paling agung yang datang ke alam semesta. Ini di antara hikmah diturunkan-Nya Al Qur’an, yaitu agar manusia menghayati ayat-ayat-Nya, sehingga mereka dapat menggali ilmunya serta mengkaji rahasia dan hikmah-Nya. Hal itu, karena dengan mentadaburi isinya dan mengayati maknanya serta mengulang-ulang pikiran untuknya, maka akan dicapai keberkahan dan kebaikannya. Dalam ayat ini terdapat dorongan untuk mentadabburi Al Qur’an, dan bahwa ia termasuk amalan yang paling utama, dan bahwa membaca sambil mentadabburinya lebih utama daripada membaca cepat namun maksud tersebut tidak tercapai. Dengan Al Qur’an, maka orang-orang yang berakal sehat dapat mengingat semua ilmu dan semua tuntutan. Ayat ini menunjukkan, bahwa semakin tinggi tingkat kecerdasan seseorang, maka ia akan semakin sadar dengannya dan memperoleh manfaat daripadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 29",
    "description": "Wahai nabi Muhammad, sesungguhnya kitab Al-Qur'an yang telah kami turunkan kepadamu adalah kitab yang penuh berkah. Kami menurunkannya agar mereka menghayati dan memahami ayat-ayatnya dan agar orang-orang yang berakal sehat menggunakan akal budinya untuk mendapat pelajaran darinya dan mengamalkan kandungannya. 30. Dan tidak hanya anugerah ilmu pengetahuan dan kenabian, kepada nabi dawud kami karuniakan pula seorang putra yang mengikuti jejak dan perjuangannya, yaitu nabi sulaiman. Dia adalah sebaik-baik hamba yang selalu beribadah dan bersyukur. Sungguh, dia sangat taat pada perintah Allah."
  }
]