[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "kami telah membinasakan banyak umat sebelum orang-oang musyrik tersebut, lalu mereka berteriak meminta pertolongan dan mengikrarkan diri bertaubat, padahal waktu tersebut bukanlah waktu yang diterimanya taubat, bukan pula waktu untuk selamat dan berlari dari apa yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Berapa banyak umat-umat sebelum mereka yang telah Kami binasakan, di mana mereka mendustakan para Rasul mereka. Saat azab turun menimpa mereka, mereka beristigasah minta pertolongan, padahal saat itu bukanlah saat keselamatan bagi mereka dari azab sehingga istigasah mereka itu bisa bermanfaat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Banyak umat yang mendustakan sebelum orang-orang musyrik itu telah Kami binasakan akibat kekafiran mereka terhadap Tuhan mereka dan pendustaan mereka terhadap para rasul-Nya. Ketika azab menimpa mereka, mereka berteriak meminta tolong; akan tetapi telah waktu untuk meminta pertolongan telah berlalu, sehingga mereka tidak lagi memiliki tempat perlindungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فَنَادَوا۟ (lalu mereka meminta tolong) Yakni seruan untuk mengharap pertolongan saat azab menimpa mereka. وَّلَاتَ حِينَ مَنَاصٍ (padahal (waktu itu) bukanlah saat untuk lari melepaskan diri) Yakni ketika itu tidak mungkin untuk melepaskan diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Betapa banyak, atau Kami telah membinasakan orang-orang banyak sebelum kalian atau umat terdahulu. Lalu mereka meminta tolong, padahal waktu itu bukan lagi saatnya meminta pertolongan dan keselamatan. Inilah janji atas kekufuran dan kesombongan mereka atas Alquran. Laat tersusun atas huruf La nafi yang bermakna laisa (tidak/bukan) dan bersambung atas ta’, seperti pada kata rabbatu rajulin aslinya rabbun dan tsammata aslinya tsamma"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Betapa banyak generasi} umat {sebelum mereka yang telah Kami binasakan. Lalu mereka meminta tolong} lalu mereka meminta tolong ketika azab itu turun {padahal bukanlah saat untuk melepaskan diri} padahal waktu itu bukan waktu untuk melarikan diri dan melepaskan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Maka Allah mengancam mereka dengan kebinasaan seperti yang telah ditimpakan kepada umat-umat terdahulu yang mendustakan para rasul; dan mereka, pada saat kebinasaan datang melanda, mereka menyeru dan meminta keselamatan agar dilepaskan dari azab itu. Akan tetapi “waktu itu bukanlah saat untuk lari melepaskan diri.” Maksudnya, dan waktu itu bukan waktu penyelamatan dari apa yang mereka terjerumus di dalamnya, dan bukan pula waktu pembebasan dari apa yang menimpa mereka. Maka hendaklah mereka berhati-hati kalau tetap pada sikap kesombongan dan permusuhan mereka, karena mereka akan ditimpa oleh apa yang telah menimpa orang-orang sebelumnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Shad ayat 3: Di ayat ini Allah mengancam mereka dengan menyebutkan pembinasaan-Nya terhadap umat-umat tedahulu yang mendustakan para rasul, di mana ketika azab dan kebinasaan datang kepada mereka, mereka berteriak meminta tolong agar dihindarkan azab itu dari mereka, padahal ketika itu bukan lagi waktu untuk melarikan diri. Oleh karena itu, hendaknya mereka (orang-orang kafir) takut jika tetap sombong lagi memusuhi, bahwa mereka akan ditimpa azab seperti yang menimpa umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 3",
    "description": "Kami telah mengingatkan melalui nabi Muhammad betapa banyak umat sebelum mereka yang telah kami binasakan akibat kesombongan dan keingkaran terhadap utusan Allah, lalu mereka meminta tolong pada saat azab itu datang, padahal waktu itu bukanlah saat yang tepat untuk meminta pertolongan dan mereka tidak bisa lari melepaskan diri dari siksa itu (lihat pula: surah g'fir/40: 84). 4. Kami utus nabi Muhammad kepada penduduk mekah dan mereka yang ingkar merasa heran karena mereka kedatangan seorang rasul pemberi peringatan yang tidak lain berasal dari kalangan mereka sendiri; dan karena keingkaran yang begitu dalam kepada rasulullah, orang-orang kafir berkata, 'orang ini adalah penyihir yang banyak berdusta. ' mereka berkata demikian karena apa yang disampaikan oleh nabi tidak sesuai dengan apa yang mereka inginkan."
  }
]