[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami memberikan kepada dawud seorang anak bernama sulaiman sebagai sebuah nikmat dari Kami kepadanya, dan Kami membahagiakannya dengannya. Sebaik-baik hamba adalah sulaiman, sesungguhnya dia banyak kembali kepada Allah dan pasrah kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Kami memberi Daud seorang anak bernama Sulaiman sebagai nikmat dan karunia dari Kami kepadanya, agar dia berbahagia dengannya. Sulaiman adalah sebaik-baik hamba, sesungguhnya dia banyak bertobat dan kembali kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Dan Kami karuniakan kepada Daud seorang anak yang shalih bernama Sulaiman, Kami menjadikannya sebagai kenikmatan dan penyejuk mata bagi Daud; sungguh sebaik-baik kenikmatan dan karunia adalah Sulaiman, dia senantiasa taat dan menghadap Tuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَوَهَبْنَا لِدَاوُۥدَ سُلَيْمٰنَ ۚ( Dan Kami karuniakan kepada Daud, Sulaiman) Yakni Allah mengaruniai Daud seorang anak bernama Sulaiman. Kemudian Allah memuji Sulaiman dengan firman-Nya: نِعْمَ الْعَبْدُ ۖ( dia adalah sebaik-baik hamba) Yang dimaksud adalah Sulaiman. إِنَّهُۥٓ أَوَّابٌ(Sesungguhnya dia amat taat (kepada Tuhannya)) Yakni orang yang banyak bertaubat. Kemudian pada ayat selanjutnya Allah menyebutkan dua peristiwa pertaubatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Kami telah menganugerahkan rahmat kepada Dawud dan Sulaiman, Sulaiman adalah sebaik-baik hamba. Dia adalah orang yang banyak bertaubat dan kembali kepada ketaatab kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menganugerahkan kepada Dawud, Sulaiman. Dia adalah sebaik-baik hamba. Sesungguhnya dia sangat taat} banyak kembali kepada Allah dengan bertaubat dan taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Setelah Allah memuji Nabi Dawud dan menjelaskan apa yang terjadi baginya dan darinya, seraya berfirman, “Dan Kami karuniakan kepada Dawud, Sulaiman,” maksudnya, Kami anugerahkan Nabi Sulaiman kepadanya dan Kami bahagiakan jiwanya dengannya, “sebaik-baik hamba” adalah Sulaiman, sebab dia mempunyai sifat-sifat yang pantas dipuji, yaitu “sesungguhnya dia amat taaat,”maksudnya, yang sangat kembali kepada Allah dalam seluruh keadaannya dengan menghambakan diri, berinabah, mencintai, berdzikir, berdoa, bertadharru’ dan bersungguh-sungguh dalam mencari keridhaan Allah dan mengutamakannya atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 30: (Dan Kami karuniakan kepada Daud, Sulaiman) sebagai anaknya (dia adalah sebaik-baik hamba) maksudnya Sulaiman adalah sebaik-baik hamba. (Sesungguhnya dia amat taat) kepada Rabbnya, selalu bertasbih dan berzikir pada semua waktunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Katsir berkata, “Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia memberikan kepada Dawud (anak bernama) Sulaiman yang menjadi nabi sebagaimana firman Allah Ta’ala, “Dan Sulaiman telah mewarisi Dawud,” (Terj. An Naml: 16) yakni dalam kenabian. Hal ini, karena Dawud memiliki banyak anak selain Sulaiman, karena Beliau memiliki seratus istri yang merdeka.” Ini adalah pujian bagi Sulaiman karena ia sangat taat, banyak beribadah, dan kembali kepada Allah ‘Azza wa Jalla. Kata \"Awwab\" bisa juga diartikan sangat sering kembali kepada Allah dalam semua keadaannya, baik dengan beribadah, kembali, mencintai, berdzikr, berdoa dan bertadharru' (merendahkan diri) serta berusaha mencari keridhaan Allah dan mengedepankannya di atas segala sesuatu. Oleh karena itulah, ketika dipertunjukkan kepadanya kuda yang cepat larinya, di mana ketika kuda itu berhenti salah satu kakinya diangkat, dan lagi pemandangan kuda-kudanya cukup indah dan menarik terlebih bagi orang yang memerlukannya seperti raja, dan pertunjukan itu terus ditampilkan sampai matahari tenggelam sehingga Beliau lupa tidak shalat Ashar dan menyesal, kemudian berkata, “Sesungguhnya aku menyukai segala yang baik (kuda), yang membuat aku lalai dari mengingat Tuhanku, sampai matahari terbenam.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 30",
    "description": "Dan tidak hanya anugerah ilmu pengetahuan dan kenabian, kepada nabi dawud kami karuniakan pula seorang putra yang mengikuti jejak dan perjuangannya, yaitu nabi sulaiman. Dia adalah sebaik-baik hamba yang selalu beribadah dan bersyukur. Sungguh, dia sangat taat pada perintah Allah. 31. Ingatlah karunia kami kepada nabi sulaiman, yaitu ketika pada suatu sore, antara asar dan magrib, dipertunjukkan kepadanya kekayaan dan kuda-kuda yang jinak dan tangkas serta memiliki kaki yang kuat sehingga sangat cepat larinya, ."
  }
]