[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "ingatlah suatu saat di waktu ashar dia melihat kuda-kuda pilihan yang berlari cepat, kuda-kuda itu berdiri di atas tiga kakinya dan mengangkat kakinya yang keempat, karena kekuatan dan kelincahannya, dia terus melihatnya sampai matahari terbenam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Ingatlah ketika di sore hari dia melihat kuda-kuda yang kuat dan mampu berlari cepat, yang sedang berdiri dengan tiga kaki sambil mengangkat kaki yang keempat. Sulaiman terus memandangi kuda-kuda pilihan tersebut hingga matahari terbenam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Ingatlah para waktu ashar ketika dipertunjukkan kepada Sulaiman kuda yang berdiri dengan bertumpu pada tiga kaki dan menganggat satu kakinya, kuda itu sangat gagah saat berdiri, cepat saat berlari, lincah saat bergerak, dan memiliki badan yang indah, kuat, dan berwibawa. Kuda itu terus dipertunjukkan kepadanya hingga dia terkagum."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. إِذْ عُرِضَ عَلَيْهِ((ingatlah) ketika dipertunjukkan kepadanya) Yakni kepada Sulaiman. بِالْعَشِىِّ (pada waktu sore) Makna (العشي) yakni waktu mulai dari dhuhur atau ashar sampai menjelang malam. الصّٰفِنٰتُ (kuda-kuda yang tenang di waktu berhenti) Kata (الصافن) yakni sifat dari kuda. Yaitu kuda yang berdiri dengan dua kakinya dan mengangkat dua kakinya yang lain, kemudian ia meletakkan satu kakinya lagi ke atas tanah sehingga ia berdiri dengan tiga kaki. Dan ini merupakan suatu bentuk keindahan. الْجِيَادُ (dan cepat waktu berlari) Yakni bentuk jamak dari kata (الجواد) yaitu kuda yang mampu berlari dengan cepat dan memiliki nafas yang panjang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai Nabi, ingatlah ketika diperlihatkan kepada Sulaiman pada waktu sore kuda-kuda yang berdiri hanya dengan 3 kaki./pijakan, yaitu yang bermakna bahwa kuda tersebut dapat berlari dengan kencang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika ditunjukkan kepadanya} kepada Sulaiman {pada suatu petang} di akhir siang {(kuda) yang jinak} kuda-kuda yang kokoh berdiri di atas tiga kaki dan mengangkat kaki yang keempat {yang sangat cepat larinya} yang sangat cepat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-33. Maka dari itu, tatkala diperlihatkan kepadanya kuda-kuda yang gagah lagi sangat kencang larinya. “yang tenang,” maksudnya, yang salah satu cirinya adalah ash-shufun, yaitu salah satu kakinya terangkat tinggi saat berdiri, dan itu merupakan pemandangan yang sangat indah dan kegagahan yang sangat menakjubkan, terutama bagi orang yang membutuhkannya, seperti para raja. Kuda-kuda itu pun terus diperlihatkan kepadanya hingga matahari hilang dari penglihatan. Dengan demikian kuda-kuda itu telah membuatnya lupa melakukan shalat di waktu sore dan berdzikir. Lalu ia berkata dengan penuh penyesalan atas apa yang telah terjadi dari dirinya dan sebagai taqarrubnya kepada Allah disebabkan apa yang telah membuatnya lupa mengingatNya, dan demi mengutamakan cinta Allah atas cinta kepada yang lain, “Sesungguhnya aku menyukai kesenangan terhadap barang yang baik ini.” Kata aku menyukai mengandung makna (aku lebih mengutamakan). Artinya, aku lebih mengutamakan suka kepada barang baik ini, yaitu harta pada umumnya, dan yang dimaksud di sini adalah kuda. “Sehingga aku lalai mengingat Rabbku sampai kuda itu hilang dari pandangan. Bawalah kuda-kuda itu kembali kepadaku.” Maka mereka pun mengembalikannya. “Lalu ia” pada kuda-kuda itu “mengusap-usap kaki dan lehernya.” Maksudnya, beliaupun lalu memotongnya dengan pedangnya pada bagian leher dan kakinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 31: (Ingatlah ketika dipertunjukkan kepadanya di waktu sore) yakni sesudah matahari tergelincir (kuda-kuda yang tenang di waktu berhenti) lafal Ash-Shaafinaat adalah bentuk jamak dari lafal Shaafinah, artinya kuda yang kalau berhenti berdiri pada tiga kaki, sedangkan kaki yang keempatnya berdiri pada ujung teracaknya atau berjinjit. Lafal ini berasal dari kata Shafana Yashfinu Shufuunan (dan cepat pada waktu berlari) lafal Al-Jiyaad adalah bentuk jamak dari lafal Jawaadun, artinya kuda balap. Maksud ayat, bahwa kuda-kuda itu bila berhenti tenang, dan bila berlari sangat cepat. Tersebutlah bahwa Nabi Sulaiman memiliki seribu ekor kuda, kuda-kuda itu ditampilkan di hadapannya setelah ia selesai melakukan salat Zuhur, karena ia bermaksud untuk berjihad dengan memakai kuda sebagai kendaraannya untuk melawan musuh. Sewaktu penampilan kuda baru sampai sembilan ratus ekor ternyata waktu Magrib telah tiba, sedangkan ia belum melakukan salat asar. Hal ini membuatnya berduka cita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 31",
    "description": "Ingatlah karunia kami kepada nabi sulaiman, yaitu ketika pada suatu sore, antara asar dan magrib, dipertunjukkan kepadanya kekayaan dan kuda-kuda yang jinak dan tangkas serta memiliki kaki yang kuat sehingga sangat cepat larinya, 32. Maka ketika itu dia berkata, 'sesungguhnya aku menyukai segala se-suatu yang baik, yaitu kuda dan harta kekayaan, yang membuat aku selalu ingat akan kebesaran tuhanku. ' nabi sulaiman menyaksikan dan mengawasi pertunjukan itu sampai matahari terbenam."
  }
]