[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-33 Lalu dia berkata ’sesungguhnya aku telah lebih mementingkan kecintaan kepada kuda-kuda itu daripada mengingat tuhanku sampai matahari terbenam dari kedua amtaku. Kembalikan kepadaku kuda-kuda yang telah aku lihat tadi. maka kuda-kuda itu dikembalikan kepadanya, lalu dia mulai menebas kaki-kaki dan leher-lehernya dengan pedang untuk mendekatkan diri kepada Allah, karena kuda-kuda itu menjadi sebab dirinya melalikan shalat. Dan mendekatkan (diri kepada Allah) dengan menyembelih kuda disyariatkan dalam syariat sulaiman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Maka Sulaiman berkata, “Aku dikalahkan oleh kecintaan kepada harta, termasuk kuda, sehingga aku lalai dari mengingat Rabbku di petang hari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Maka dia berkata: “Aku telah mengutamakan kecintaan terhadap kuda dan pertunjukannya, hingga itu melalaikanku dari mengingat Tuhanku. Kuda itu telah melalaikanku sampai waktu matahari tenggelam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. فَقَالَ إِنِّىٓ أَحْبَبْتُ حُبَّ الْخَيْرِ عَن ذِكْرِ رَبِّى (maka ia berkata: “Sesungguhnya aku menyukai kesenangan terhadap barang yang baik (kuda) sehingga aku lalai mengingat Tuhanku) Yakni aku lebih mementingkan kecintaan kepada kuda daripada mengingat tuhanku yaitu shalat ashar. حَتَّىٰ تَوَارَتْ بِالْحِجَابِ(sampai kuda itu hilang dari pandangan) Yakni sampai terbenamnya matahari. Dan pendapat lain mengatakan maknanya adalah sampai kuda itu hilang dari pandangan saat lomba lari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Sulaiman berkata: “Aku menyukai barang yang baik, yaitu kuda ini. Kecintaan yang tumbuh dari perintah Tuhanku untuk menjaganya, karena kuda-kuda itu termasuk hal yang termasuk dalam hal untuk memperjuangkan agama, bukan kecintaan yang tumbuh dari nafsu dan kesenangan dunia. Sehingga sampai melalaikan aku bahwa matahari sudah tidak terlihat lagi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia berkata} Sulaiman berkata {“Sesungguhnya aku menyukai kesenangan terhadap yang baik (kuda)} Aku menyukai kuda itu {sehingga aku lalai mengingat Tuhanku sampai yang baik itu bersembunyi di balik tabir} matahari terbenam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-33. Maka dari itu, tatkala diperlihatkan kepadanya kuda-kuda yang gagah lagi sangat kencang larinya. “yang tenang,” maksudnya, yang salah satu cirinya adalah ash-shufun, yaitu salah satu kakinya terangkat tinggi saat berdiri, dan itu merupakan pemandangan yang sangat indah dan kegagahan yang sangat menakjubkan, terutama bagi orang yang membutuhkannya, seperti para raja. Kuda-kuda itu pun terus diperlihatkan kepadanya hingga matahari hilang dari penglihatan. Dengan demikian kuda-kuda itu telah membuatnya lupa melakukan shalat di waktu sore dan berdzikir. Lalu ia berkata dengan penuh penyesalan atas apa yang telah terjadi dari dirinya dan sebagai taqarrubnya kepada Allah disebabkan apa yang telah membuatnya lupa mengingatNya, dan demi mengutamakan cinta Allah atas cinta kepada yang lain, “Sesungguhnya aku menyukai kesenangan terhadap barang yang baik ini.” Kata aku menyukai mengandung makna (aku lebih mengutamakan). Artinya, aku lebih mengutamakan suka kepada barang baik ini, yaitu harta pada umumnya, dan yang dimaksud di sini adalah kuda. “Sehingga aku lalai mengingat Rabbku sampai kuda itu hilang dari pandangan. Bawalah kuda-kuda itu kembali kepadaku.” Maka mereka pun mengembalikannya. “Lalu ia” pada kuda-kuda itu “mengusap-usap kaki dan lehernya.” Maksudnya, beliaupun lalu memotongnya dengan pedangnya pada bagian leher dan kakinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 32: (Maka ia berkata, \"Sesungguhnya aku menyukai) artinya, mempunyai maksud (bersenang-senang terhadap barang yang baik) yakni kuda (hingga aku lupa untuk berzikir kepada Rabbku) lupa melakukan salat asar (sehingga tertutuplah) matahari (dari pandangan mata.\") artinya sehingga matahari itu tenggelam dan tidak kelihatan lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Katsir berkata, “Lebih dari seorang kaum salaf dan mufassir menrangkan, bahwa Nabi Sulaiman dibuat sibuk karena pertunjukan itu sampai lewat waktu Ashar, namun yang pasti bahwa Beliau tidaklah meninggalkannya karena sengaja, bahkan karena lupa sebagaimana Nabi shallallahu 'alaihi wa sallam dibuat sibuk pada peperangan Khandaq sampai tidak sempat shalat Ashar, dan melakukannya setelah matahari tenggelam.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 32",
    "description": "Maka ketika itu dia berkata, 'sesungguhnya aku menyukai segala se-suatu yang baik, yaitu kuda dan harta kekayaan, yang membuat aku selalu ingat akan kebesaran tuhanku. ' nabi sulaiman menyaksikan dan mengawasi pertunjukan itu sampai matahari terbenam. 33. Lalu nabi sulaiman berkata kepada pelatih kuda, 'bawalah semua kuda itu kembali kepadaku. ' lalu dia pun mengusap-usap kaki dan leher kuda itu sebagai wujud syukurnya kepada Allah."
  }
]