[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "32-33 Lalu dia berkata ’sesungguhnya aku telah lebih mementingkan kecintaan kepada kuda-kuda itu daripada mengingat tuhanku sampai matahari terbenam dari kedua amtaku. Kembalikan kepadaku kuda-kuda yang telah aku lihat tadi. maka kuda-kuda itu dikembalikan kepadanya, lalu dia mulai menebas kaki-kaki dan leher-lehernya dengan pedang untuk mendekatkan diri kepada Allah, karena kuda-kuda itu menjadi sebab dirinya melalikan shalat. Dan mendekatkan (diri kepada Allah) dengan menyembelih kuda disyariatkan dalam syariat sulaiman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Kembalikanlah kuda-kuda itu ke sini.” Maka mereka mengembalikannya. Maka dia mulai membabat kaki-kaki dan leher-lehernya dengan pedang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Datangkanlah kuda yang telah dipertunjukkan itu kepadaku. Maka kuda itu didatangkan kepadanya, kemudian dia mulai mengusap kaki dan leher kuda itu seraya menegurnya dengan lembut, karena kuda itu telah melalaikannya dari mengingat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. فَطَفِقَ مَسْحًۢا بِالسُّوقِ وَالْأَعْنَاقِ (Lalu ia potong kaki dan leher kuda itu) Sulaiman kemudian menyembelih kuda-kuda itu dengan pedangnya, lalu memotong kaki dan leher kuda-kuda itu sebagai bentuk kemarahan karena Allah, sebab kuda-kuda itulah yang menyebabkannya melewatkan shalat. Pendapat lain megatakan bahwa Sulaiman hanya mengelus kepala kuda-kuda itu dengan tangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Kembalikanlah kuda-kuda itu, lalu dia menebas kaki dan leher kuda-kuda itu, sebagai penebusan/qurban untuk hal yang telah ditinggalkannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bawalah semua kuda itu kembali kepadaku”} bewa kembali kuda itu kepadaku {Lalu dia mulai} mulai {memotong kaki dan lehernya} memotong kaki dan lehernya menggunakan pedang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-33. Maka dari itu, tatkala diperlihatkan kepadanya kuda-kuda yang gagah lagi sangat kencang larinya. “yang tenang,” maksudnya, yang salah satu cirinya adalah ash-shufun, yaitu salah satu kakinya terangkat tinggi saat berdiri, dan itu merupakan pemandangan yang sangat indah dan kegagahan yang sangat menakjubkan, terutama bagi orang yang membutuhkannya, seperti para raja. Kuda-kuda itu pun terus diperlihatkan kepadanya hingga matahari hilang dari penglihatan. Dengan demikian kuda-kuda itu telah membuatnya lupa melakukan shalat di waktu sore dan berdzikir. Lalu ia berkata dengan penuh penyesalan atas apa yang telah terjadi dari dirinya dan sebagai taqarrubnya kepada Allah disebabkan apa yang telah membuatnya lupa mengingatNya, dan demi mengutamakan cinta Allah atas cinta kepada yang lain, “Sesungguhnya aku menyukai kesenangan terhadap barang yang baik ini.” Kata aku menyukai mengandung makna (aku lebih mengutamakan). Artinya, aku lebih mengutamakan suka kepada barang baik ini, yaitu harta pada umumnya, dan yang dimaksud di sini adalah kuda. “Sehingga aku lalai mengingat Rabbku sampai kuda itu hilang dari pandangan. Bawalah kuda-kuda itu kembali kepadaku.” Maka mereka pun mengembalikannya. “Lalu ia” pada kuda-kuda itu “mengusap-usap kaki dan lehernya.” Maksudnya, beliaupun lalu memotongnya dengan pedangnya pada bagian leher dan kakinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 33: (Ia berkata, \"Bawalah kuda-kuda itu kembali kepadaku\") yaitu kuda-kuda yang ditampilkan tadi kemudian mereka membawanya kepada Nabi Sulaiman (lalu ia membabat kuda-kuda itu) dengan pedangnya (pada kaki-kakinya) lafal As-Suuq ini adalah bentuk jamak dari lafal Saaqun (dan pada lehernya) artinya Nabi Sulaiman menyembelih semua kuda-kuda itu kemudian memotong kakinya sebagai kurban untuk mendekatkan diri kepada Allah swt. Karena kuda-kuda itu ternyata membuatnya lalai dari salat; kemudian ia menyedekahkan daging-dagingnya. Akhirnya Allah menggantikan kudanya dengan kendaraan yang jauh lebih baik dan lebih cepat larinya, yaitu kendaraan angin; angin dapat diperintah untuk bertiup dengan membawanya ke mana saja yang ia kehendaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Al Hasan Al Bashri: Sulaiman berkata, “Tidak, demi Allah (kuda-kuda) ini tidak boleh membuatku lalai dari beribadah kepada Tuhanku. (Ini) adalah yang terakhir untukmu.” Maka Ia memerintahkan untuk disembelih.” Ini pula yang dikatakan Qatadah. As Suddiy berkata, “Ia potong leher dan kakinya dengan pedang.” Namun Ali bin Thalhah berkata: Dari Ibnu Abbas radhiyallahu 'anhuma ia berkata, “Beliau mengusap bagian atas kuda dan kakinya karena cinta kepadanya.” Pendapat ini dipilih oleh Ibnu Jarir, menurutnya, karena ia tidak mungkin menyiksa hewan dengan memotong kakinya dan membinasakan harta di antara hartanya tanpa sebab selain hanya karena sibuk melihatnya sampai lalai dari shalatnya, padahal kuda itu tidak bersalah.” Menurut Ibnu Katsir, bahwa apa yang dirajihkan Ibnu Jarir perlu ditinjau kembali, karena bisa saja dalam syariat mereka hal itu diperbolehkan, apalagi Beliau lakukan sebagai sikap marah karena Allah disebabkan Beliau sibuk dengan kuda-kuda itu sampai lewat waktu shalat. Oleh karena itu, ketika ia telah meninggalkan hal itu, Allah ‘Azza wa Jalla menggantinya dengan yang lebih baik darinya, yaitu angin yang berhembus dengan baik sesuai perintahnya, di mana perjalanannya di pagi hari sama seperti perjalanannya sebulan dan perjalanannya di sore hari sama seperti perjalanannya sebulan. Hal ini jelas lebih cepat dan lebih baik dari kuda. Imam Ahmad meriwayatkan dari Abu Qatadah dan Abuddahma’, di mana keduanya adalah orang yang sering bepergian menuju Baitullah. Keduanya berkata, “Kami mendatangi salah seorang penduduk Badui, lalu orang itu berkata, “Rasulullah shallallahu 'alaihi wa sallam pernah memegang tanganku dan mengajarkanku sebagian di antara ilmu yang Allah ajarkan kepadanya, dan Beliau bersabda, إِنَّكَ لَنْ تَدَعَ شَيْئًا اتِّقَاءَ اللَّهِ عَزَّ وَجَلَّ إِلَّا أَعْطَاكَ اللَّهُ خَيْرًا مِنْهُ “Sesungguhnya engkau tidaklah meninggalkan sesuatu karena takwa kepada Allah ‘Azza wa Jalla, kecuali Dia akan memberikan kepadamu yang lebih baik darinya.” (HR. Ahmad)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 33",
    "description": "Lalu nabi sulaiman berkata kepada pelatih kuda, 'bawalah semua kuda itu kembali kepadaku. ' lalu dia pun mengusap-usap kaki dan leher kuda itu sebagai wujud syukurnya kepada Allah. 34. Dan kami tidak hanya mencurahkan karunia kepada nabi sulaiman. Sungguh, kami pun telah menguji nabi sulaiman dengan penyakit yang menyebabkan hilangnya kekuatan yang dimilikinya, dan karena itu kami jadikan dia hanya mampu tergeletak di atas kursinya sebagai tubuh yang lemah tak berdaya, kemudian dia pun menyadari kelalaiannya dan bertobat kepada Allah."
  }
]