[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-36 Dan sungguh Kami telah menguji sulaiman dan Kami meletakan seperuh tubuh anaknya di atas singgasananya. Anak ini lahir setelah sulaiman bersumpah akan menggilir istri-istrinya, sehingga masing-masing dari mereka akan melahirkan seorang penunggang kuda yang handal yang berjihad di jalan Allah, namun ia tidak mengucapkan ‘insya Allah’ lalu sulaiman melakukan sumpahnya, tetapi tidak seorangpun dari mereka yang mengandung kecuali seorang istri yang akhirnya melahirkan separuh jasad bayi. Kemudian sulaiman kembali kepada tuhannya dan bertaubat dia berkata ”wahai tuhanku ampunilah dosaku, dan berikanlah kepadaku kerajaan yang besar yang tidak akan dimiliki oleh seorang pun sesudahku, sesungguhnya Engkau maha banyak berderma dan memberi” maka Kami mengabulkan permintaannya, Kami menundukan angin untuknya sehingga ia berhembus sesuai dengan keinginannya, ia taat kepada sulaiman sekalipun ia keras lagi kuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sungguh Kami telah menguji Sulaiman dan Kami meletakkan di atas singgasananya setan yang berbentuk manusia yang menguasai kerajaannya beberapa saat. Kemudian Sulaiman berhasil menguasai kerajaannya kembali dan mengalahkan para setan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Kami telah menguji Sulaiman dengan perkara besar, ketika Kami jadikan di atas singgasana kerajaannya seorang anak yang tidak sempurna, ketika dia bersumpah untuk mendatangi seratus istrinya dalam satu malam agar setiap istri itu dapat mendatangkan baginya satu anak yang akan menjadi pada mujahid, akan tetapi dia tidak mengucapkan ‘Insyaallah’. Setelah dia mendatangi seluruh istrinya, tidak ada dari mereka yang hamil kecuali satu istrinya saja, akan tetapi anak yang dilahirkannya tidak sempurna. Akhirnya Sulaiman mengetahui sebab hal ini, sehingga dia segera bertaubat kepada Allah, dan memohon ampunan dan pengabulan doa agar kerajaannya dapat tetap Berjaya serta menjadikan kerajaannya tidak mungkin ada orang setelahnya yang menandingi kerajaan tersebut. Sungguh Allah Maha Luas karunia dan pemberian-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَقَدْ فَتَنَّا سُلَيْمٰنَ(Dan sesungguhnya Kami telah menguji Sulaiman) Disebutkan dalam hadits shahih bahwa Sulaiman berkata: “sungguh aku akan menggilir sembilan puluh istriku pada malam ini, agar setiap istri dapat memberiku satu keturunan yang kelak menjadi pasukan yang berperang di jalan Allah.” Namun dia tidak mengatakan “InsyaAllah” sehingga hanya satu istrinya saja yang melahirkan dan melahirkan anak yang tidak sempurna. وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِۦ جَسَدًا(dan Kami jadikan (dia) tergeletak di atas kursinya sebagai tubuh (yang lemah karena sakit)) Makna (الجسد) yakni anak yang tidak sempurna yang dilahirkan istrinya. ثُمَّ أَنَابَ (kemudian ia bertaubat) Yakni Sulaiman bertaubat kepada Tuhannya dari dosanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Kami telah menguji Sulaiman dengan penyakit, Kami biarkan dia tergeletak di atas kursi kerajaannya dengan tubuh yang lemah layaknya jasad tanpa ruh. Kemudian dia bertaubat dan kembali kepada Allah sehingga dia kembali sehat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah menguji Sulaiman} Kami menguji sulaiman dengan merenggut kerajaannya {dan Kami meletakkan di atas kursinya tubuh} setan {kemudian dia bertaubat} kembali kepada Allah dengan bertaubat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Dan sesungguhnya Kami telah menguji Sulaiman.” Kami memberinya cobaan dan ujian dengan kehilangan kerajaannya dan terlepasnya kerajaan itu darinya disebabkan kesalahan-kesalahan yang terjadi akibat tabiat kemanusiaan, “dan Kami tempatkan di atas kursinya sebatang tubuh,” yakni, setan yang telah ditakdirkan Allah untuk duduk di atas kursi kerajaannya dan ia mengendalikan kerajaan pada masa ujian Sulaiman, “Kemudian ia kembali” kepada Allah dan bertaubat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 34: (Dan sesungguhnya Kami telah menguji Sulaiman) Kami telah mencobanya dengan suatu ujian, yaitu kerajaannya dirampas oleh orang lain. Demikian itu, karena ia pernah menikahi seorang perempuan yang ia sukai, hanya perempuan itu termasuk orang yang menyembah berhala, tanpa sepengetahuan Nabi Sulaiman. Dan tersebutlah bahwa kebesarannya itu terletak pada cincinnya kemudian pada suatu hari ketika ia bermaksud untuk pergi ke kamar mandi, ia melepaskan cincinnya itu. Lalu ia menitipkannya kepada salah seorang dari istrinya yang bernama Aminah, sebagaimana biasanya. Setelah ia pergi tiba-tiba datanglah makhluk jin yang menyerupai Nabi Sulaiman, kemudian jin itu mengambil cincin itu dari Aminah dan langsung memakainya (dan Kami dudukkan pada singgasananya sesosok jasad) yaitu jin tersebut, yang bernama Shakhr atau jin lainnya, kemudian jin itu menduduki singgasana Nabi Sulaiman. Ketika itu juga ia dikelilingi burung-burung dan lain-lainnya. Lalu muncullah Nabi Sulaiman dalam bentuk yang tidak seperti biasanya, yakni tanpa pakaian kebesaran, ia melihat bahwa di singgasananya telah duduk seseorang. Kemudian ia berkata kepada orang-orang yang ada di situ, \"Aku adalah Sulaiman.\" Akan tetapi orang-orang mengingkarinya (kemudian ia kembali) yakni kembali dapat merebut kebesarannya setelah selang beberapa hari; yaitu setelah ia berhasil merebut cincin kebesarannya, lalu memakainya dan duduk di atas singgasananya kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini juga bisa diartikan sebagai berikut, “Dan sungguh, Kami telah menguji Sulaiman dan Kami letakkan sebuah jasad di atas kursinya, kemudian dia bertobat.” Ibnu Katsir berkata, “Allah Subhaanahu wa Ta'aala tidak menerangkan hakikat jasad yang Dia letakkan di atas kursinya. Kita mengimani bahwa Allah menguji Beliau dengan meletakkan sebuah jasad di atas kursinya, dan kita tidak mengetahui tentang jasad itu? Semua perkataan yang membicarakan tentang hal itu berasal dari cerita Israiliyyat; kita tidak mengetahui benar dan dustanya, wallahu a’lam.” Sebahagian ahli tafsir ada mengatakan bahwa yang dimaksud dengan ujian ini ialah kehilangan kerajaan Sulaiman disebabkan aib yang biasa terjadi pada manusia sehingga orang lain duduk di atas singgasananya. Yakni setelah ujian itu, Beliau kembali kepada Allah Subhaanahu wa Ta'aala, berdoa dan meminta ampunan-Nya, serta meminta kerajaan yang tidak patut dimiliki seorang pun setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 34",
    "description": "Dan kami tidak hanya mencurahkan karunia kepada nabi sulaiman. Sungguh, kami pun telah menguji nabi sulaiman dengan penyakit yang menyebabkan hilangnya kekuatan yang dimilikinya, dan karena itu kami jadikan dia hanya mampu tergeletak di atas kursinya sebagai tubuh yang lemah tak berdaya, kemudian dia pun menyadari kelalaiannya dan bertobat kepada Allah. 35. Dalam tobatnya dia berkata, 'ya tuhanku, ampunilah aku dari dosa-dosaku yang menyebabkan engkau menimpakan cobaan ini kepadaku, dan anugerahkanlah kepadaku kerajaan agung yang tidak akan dimiliki oleh siapa pun setelahku. Sungguh, engkaulah yang maha pemberi lagi maha pemurah. '."
  }
]