[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-36 Dan sungguh Kami telah menguji sulaiman dan Kami meletakan seperuh tubuh anaknya di atas singgasananya. Anak ini lahir setelah sulaiman bersumpah akan menggilir istri-istrinya, sehingga masing-masing dari mereka akan melahirkan seorang penunggang kuda yang handal yang berjihad di jalan Allah, namun ia tidak mengucapkan ‘insya Allah’ lalu sulaiman melakukan sumpahnya, tetapi tidak seorangpun dari mereka yang mengandung kecuali seorang istri yang akhirnya melahirkan separuh jasad bayi. Kemudian sulaiman kembali kepada tuhannya dan bertaubat dia berkata ”wahai tuhanku ampunilah dosaku, dan berikanlah kepadaku kerajaan yang besar yang tidak akan dimiliki oleh seorang pun sesudahku, sesungguhnya Engkau maha banyak berderma dan memberi” maka Kami mengabulkan permintaannya, Kami menundukan angin untuknya sehingga ia berhembus sesuai dengan keinginannya, ia taat kepada sulaiman sekalipun ia keras lagi kuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Sulaiman berkata, “Wahai Rabbku! Ampunilah dosa-dosaku, dan berilah aku satu kerajaan yang spesial untuk diriku yang tidak bisa dimiliki oleh siapa pun sesudahku, sesungguhnya Engkau ya Rabbi pemilik karunia yang melimpah dan anugerah yang besar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. قَالَ رَبِّ اغْفِرْ لِى (Ia berkata: “Ya Tuhanku, ampunilah aku) Atas dosa yang aku perbuat yang Engkau uji aku dengannya. وَهَبْ لِى مُلْكًا لَّا يَنۢبَغِى لِأَحَدٍ مِّنۢ بَعْدِىٓ ۖ( dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh seorang juapun sesudahku) Yakni tidak ada seorangpun setelahku yang memiliki kerajaan seperti itu. إِنَّكَ أَنتَ الْوَهَّابُ(sesungguhnya Engkaulah Yang Maha Pemberi) Yakni sungguh Engkau banyak memberi pemberian yang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Nabi Sulaiman berkata: “Tuhan ampunilah aku atas dosa-dosa yang menjadi sebab datangnya bala’ ini padaku. Engkau telah menganugerahkan kerajaan yang tidak Engkau anugerahkan kepada selain aku. Sesungguhnya Engkau Dzat Yang Banyak Memberi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak patut} yang tidak dimiliki {oleh seorang pun sesudahku. Sesungguhnya Engkaulah Yang Maha Pemberi”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-39. “Ia berkata, ‘Ya Rabbku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak pantas dimiliki oleh seorang jua pun sesudahku, sesungguhnya Engkau-lah Yang Maha Pemberi’.” Allah pun mengabulkan doa beliau dan mengampuni beliau serta mengembalikan kerajaan kepadanya, dan bahkan Allah menambahkan untuknya kerajaan yang belum pernah terjadi bagi seorang pun sesudahnya, yaitu patuhnya setan-setan kepadanya, mereka membangun apa yang beliau kehendaki dan menyelam di dasar laut untuknya, mereka mengeluarkan mutiara-mutiara perhiasan. Dan siapa saja yang durhaka kepadanya di antara mereka, maka ia membelenggu dan mengikatnya dengan belenggu, dan Kami katakan kepadanya, “Inilah anugerah Kami” maka berbahagialah dengannya, “maka berikanlah” dari siapa saja yang kamu suka, “dengan tiada perhitungan.” Maksudnya, tidak ada dosa ataupun perhitungan bagimu dalam hal itu, karena Allah Maha Mengetahui kesempurnaan keadilannya dan kebaikan keputusan-keputusannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 35: (Ia berkata, \"Ya Rabbku! Ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak patut dimiliki) maksudnya, belum pernah dimiliki (oleh seorang jua pun sesudahku) artinya, yang tidak layak dimiliki oleh orang selainku. Pengertian ungkapan ini sama dengan makna yang terkandung di dalam firman-Nya yang lain, yaitu, 'Maka siapakah yang akan memberinya petunjuk sesudah Allah?' (Q.S. Al-Jatsiyah, 23) yakni selain Allah (sesungguhnya Engkaulah Yang Maha Pemberi.\")"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 35",
    "description": "Dalam tobatnya dia berkata, 'ya tuhanku, ampunilah aku dari dosa-dosaku yang menyebabkan engkau menimpakan cobaan ini kepadaku, dan anugerahkanlah kepadaku kerajaan agung yang tidak akan dimiliki oleh siapa pun setelahku. Sungguh, engkaulah yang maha pemberi lagi maha pemurah. '36-38. Allah menerima tobat dan doa nabi sulaiman, kemudian kami tundukkan kepadanya angin yang berembus dengan baik maupun dengan kencang menurut perintahnya, berembus ke mana saja yang dikehendakinya sehingga dia dapat menempuh perjalanan jauh hanya dalam sekejap. Dan kami tundukkan pula untuknya setan-setan dan jin-jin, semuanya ahli bangunan dan penyelam. Mereka ahli membangun istana, gedung megah, tempat peribadatan, bahkan hiasan dari keramik seperti patung, cawan, teko, dan sebagainya; serta ahli mengambil berbagai perhiasan dari dasar laut, seperti mutiara dan marjan. Mereka tekun bekerja (lihat pula: surah al-anbiy'/21: 81'82; saba'/34: 12'13), dan adapun setan yang lain yang tidak mematuhi perintahnya, mereka ter-ikat dalam belenggu sehingga tidak mengganggu mereka yang bekerja."
  }
]