[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-36 Dan sungguh Kami telah menguji sulaiman dan Kami meletakan seperuh tubuh anaknya di atas singgasananya. Anak ini lahir setelah sulaiman bersumpah akan menggilir istri-istrinya, sehingga masing-masing dari mereka akan melahirkan seorang penunggang kuda yang handal yang berjihad di jalan Allah, namun ia tidak mengucapkan ‘insya Allah’ lalu sulaiman melakukan sumpahnya, tetapi tidak seorangpun dari mereka yang mengandung kecuali seorang istri yang akhirnya melahirkan separuh jasad bayi. Kemudian sulaiman kembali kepada tuhannya dan bertaubat dia berkata ”wahai tuhanku ampunilah dosaku, dan berikanlah kepadaku kerajaan yang besar yang tidak akan dimiliki oleh seorang pun sesudahku, sesungguhnya Engkau maha banyak berderma dan memberi” maka Kami mengabulkan permintaannya, Kami menundukan angin untuknya sehingga ia berhembus sesuai dengan keinginannya, ia taat kepada sulaiman sekalipun ia keras lagi kuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Kami mengabulkan doanya. Dan Kami menundukkan angin untuknya sehingga ia mengikuti perintahnya, berhembus lembut, tidak ribut sekalipun ia kuat dan cepat, ia membawanya ke mana dia suka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Maka Allah mengabulkan doanya dengan menerima taubatnya dan memenuhi keinginannya, kemudian Allah menundukkan angin baginya sehingga dia dapat menghembuskan angin itu dengan lembut sesuai perintahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَسَخَّرْنَا لَهُ الرِّيحَ (Kemudian Kami tundukkan kepadanya angin) Yakni Kami jadikan angin itu mentaati perintahnya. تَجْرِى بِأَمْرِهِۦ رُخَآءً(yang berhembus ke mana saja yang dikehendakinya) Yakni itu adalah angin yang lembut yang tidak membuat kerusakan namun memiliki henbusan yang kuat dan cepat. حَيْثُ أَصَابَ (dengan baik) Yakni angin itu akan membawanya kepada kebaikan yang dia tuju. Lihat surat Saba’: 12."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Kemudian Kami jadikan angin tunduk kepadanya, angin yang lembut dan kuat yang patuh atas apa yang Sulaiman inginkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami menundukkan} Kami menundukkan {untuknya angin yang berembus dengan baik} dengan lembut dan tidak menyebabkan gangguan dalam hembusannya {menurut perintahnya ke mana saja yang dia kehendaki} sesuai keinginannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-39. “Ia berkata, ‘Ya Rabbku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak pantas dimiliki oleh seorang jua pun sesudahku, sesungguhnya Engkau-lah Yang Maha Pemberi’.” Allah pun mengabulkan doa beliau dan mengampuni beliau serta mengembalikan kerajaan kepadanya, dan bahkan Allah menambahkan untuknya kerajaan yang belum pernah terjadi bagi seorang pun sesudahnya, yaitu patuhnya setan-setan kepadanya, mereka membangun apa yang beliau kehendaki dan menyelam di dasar laut untuknya, mereka mengeluarkan mutiara-mutiara perhiasan. Dan siapa saja yang durhaka kepadanya di antara mereka, maka ia membelenggu dan mengikatnya dengan belenggu, dan Kami katakan kepadanya, “Inilah anugerah Kami” maka berbahagialah dengannya, “maka berikanlah” dari siapa saja yang kamu suka, “dengan tiada perhitungan.” Maksudnya, tidak ada dosa ataupun perhitungan bagimu dalam hal itu, karena Allah Maha Mengetahui kesempurnaan keadilannya dan kebaikan keputusan-keputusannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 36: (Kemudian Kami tundukkan kepadanya angin yang berembus dengan baik menurut perintahnya) yakni berembus dengan lembut (ke mana saja yang ia kehendaki) sesuai dengan keinginan Nabi Sulaiman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 36",
    "description": "36-38. Allah menerima tobat dan doa nabi sulaiman, kemudian kami tundukkan kepadanya angin yang berembus dengan baik maupun dengan kencang menurut perintahnya, berembus ke mana saja yang dikehendakinya sehingga dia dapat menempuh perjalanan jauh hanya dalam sekejap. Dan kami tundukkan pula untuknya setan-setan dan jin-jin, semuanya ahli bangunan dan penyelam. Mereka ahli membangun istana, gedung megah, tempat peribadatan, bahkan hiasan dari keramik seperti patung, cawan, teko, dan sebagainya; serta ahli mengambil berbagai perhiasan dari dasar laut, seperti mutiara dan marjan. Mereka tekun bekerja (lihat pula: surah al-anbiy'/21: 81'82; saba'/34: 12'13), dan adapun setan yang lain yang tidak mematuhi perintahnya, mereka ter-ikat dalam belenggu sehingga tidak mengganggu mereka yang bekerja"
  }
]