[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-39 dan Kami juga menundukan jin-jin untuknya untuk dia pekerjakan dalam berbagi bidamg, diantara mereka ada yang menjadi tukang bangunan, ada yang menyelam dalam lautan, ada pula setan-setan yang Bengal yang terbeleggu kakinya. Kerajaan itu dan penundukan khusus tersebut adalah pemberian dari Kami kepadamu, wahai sulaiman. Berilah siapa yang kamu inginkan dan tolaklah siapa yang kamu inginkan, tidak ada perhitungan keburukan atasmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Kami menundukkan setan-setan baginya, mereka bekerja sesuai perintahnya, ada yang membangun, ada yang menyelam di dasar lautan, lalu mengeluarkan mutiara darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-38. Dan Kami tundukkan setan-setan baginya agar dia dapat mempekerjakan mereka dengan berbagai pekerjaan. Sebagiannya bekerja membangun tempat tinggal, istana, dan benteng; sebagian lainnya menyelam ke dasar lautan untuk mengeluarkan mutiara dan marjan; dan sebagiannya lagi adalah setan-setan yang menentang dan tidak mau tunduk, maka mereka terbelengu agar tidak menyebarkan keburukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَالشَّيٰطِينَ (syaitan-syaitan) Yakni dan Kami tundukkan baginya setan-setan. كُلَّ بَنَّآءٍ وَغَوَّاصٍ(semuanya ahli bangunan dan penyelam) Yakni mereka membangun bangunan baginya sesuai yang dia kehendaki serta menyelam ke dalam lautan untuk mengeluarkan mutiara baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Juga Kami tundukkan para setan yang membangunkan untuknya bangunan-bangunan tinggi sesuai apa yang dia kehendaki. Juga yang menyelam ke dalam laut untuk mengambil mutiara-mutiara"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan setan-setan, semuanya ahli membuat bangunan dan menyelam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-39. “Ia berkata, ‘Ya Rabbku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak pantas dimiliki oleh seorang jua pun sesudahku, sesungguhnya Engkau-lah Yang Maha Pemberi’.” Allah pun mengabulkan doa beliau dan mengampuni beliau serta mengembalikan kerajaan kepadanya, dan bahkan Allah menambahkan untuknya kerajaan yang belum pernah terjadi bagi seorang pun sesudahnya, yaitu patuhnya setan-setan kepadanya, mereka membangun apa yang beliau kehendaki dan menyelam di dasar laut untuknya, mereka mengeluarkan mutiara-mutiara perhiasan. Dan siapa saja yang durhaka kepadanya di antara mereka, maka ia membelenggu dan mengikatnya dengan belenggu, dan Kami katakan kepadanya, “Inilah anugerah Kami” maka berbahagialah dengannya, “maka berikanlah” dari siapa saja yang kamu suka, “dengan tiada perhitungan.” Maksudnya, tidak ada dosa ataupun perhitungan bagimu dalam hal itu, karena Allah Maha Mengetahui kesempurnaan keadilannya dan kebaikan keputusan-keputusannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 37: (Dan Kami tundukkan pula kepadanya setan-setan, semuanya ahli bangunan) yakni pandai membuat bangunan-bangunan yang menakjubkan dan aneh (dan penyelam) ahli menyelam di dalam laut untuk mengambil mutiara-mutiara yang terkandung di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menyelam ke dalam laut mengambil perhiasannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 37",
    "description": "36-38. Allah menerima tobat dan doa nabi sulaiman, kemudian kami tundukkan kepadanya angin yang berembus dengan baik maupun dengan kencang menurut perintahnya, berembus ke mana saja yang dikehendakinya sehingga dia dapat menempuh perjalanan jauh hanya dalam sekejap. Dan kami tundukkan pula untuknya setan-setan dan jin-jin, semuanya ahli bangunan dan penyelam. Mereka ahli membangun istana, gedung megah, tempat peribadatan, bahkan hiasan dari keramik seperti patung, cawan, teko, dan sebagainya; serta ahli mengambil berbagai perhiasan dari dasar laut, seperti mutiara dan marjan. Mereka tekun bekerja (lihat pula: surah al-anbiy'/21: 81'82; saba'/34: 12'13), dan adapun setan yang lain yang tidak mematuhi perintahnya, mereka ter-ikat dalam belenggu sehingga tidak mengganggu mereka yang bekerja"
  }
]