[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-39 dan Kami juga menundukan jin-jin untuknya untuk dia pekerjakan dalam berbagi bidamg, diantara mereka ada yang menjadi tukang bangunan, ada yang menyelam dalam lautan, ada pula setan-setan yang Bengal yang terbeleggu kakinya. Kerajaan itu dan penundukan khusus tersebut adalah pemberian dari Kami kepadamu, wahai sulaiman. Berilah siapa yang kamu inginkan dan tolaklah siapa yang kamu inginkan, tidak ada perhitungan keburukan atasmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Di antara para setan itu ada setan -setan yang dibelenggu tunduk baginya, mereka terbelenggu tanpa bisa bergerak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَءَاخَرِينَ مُقَرَّنِينَ فِى الْأَصْفَادِ (dan syaitan yang lain yang terikat dalam belenggu) Mereka adalah setan-setan yang durhaka, mereka ditundukkan bagi Sulaiman agar dia membelenggunya dengan rantai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Juga Kami jadikan seten-setan yang lainnya yang terikat dan dirantai tangan mereka masing-masing diikatkan ke kepalanya dengan memakai belenggu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan yang lain yang terikat} yang terikat {dalam belenggu} belenggu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-39. “Ia berkata, ‘Ya Rabbku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak pantas dimiliki oleh seorang jua pun sesudahku, sesungguhnya Engkau-lah Yang Maha Pemberi’.” Allah pun mengabulkan doa beliau dan mengampuni beliau serta mengembalikan kerajaan kepadanya, dan bahkan Allah menambahkan untuknya kerajaan yang belum pernah terjadi bagi seorang pun sesudahnya, yaitu patuhnya setan-setan kepadanya, mereka membangun apa yang beliau kehendaki dan menyelam di dasar laut untuknya, mereka mengeluarkan mutiara-mutiara perhiasan. Dan siapa saja yang durhaka kepadanya di antara mereka, maka ia membelenggu dan mengikatnya dengan belenggu, dan Kami katakan kepadanya, “Inilah anugerah Kami” maka berbahagialah dengannya, “maka berikanlah” dari siapa saja yang kamu suka, “dengan tiada perhitungan.” Maksudnya, tidak ada dosa ataupun perhitungan bagimu dalam hal itu, karena Allah Maha Mengetahui kesempurnaan keadilannya dan kebaikan keputusan-keputusannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 38: (Dan setan yang lain) setan-setan yang lainnya (yang terikat) dirantai (dalam belenggu) yaitu, tangan mereka masingmasing diikatkan ke kepalanya dengan memakai belenggu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang durhaka kepadanya. Yaitu dengan disatukan tangan mereka dengan leher."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 38",
    "description": "36-38. Allah menerima tobat dan doa nabi sulaiman, kemudian kami tundukkan kepadanya angin yang berembus dengan baik maupun dengan kencang menurut perintahnya, berembus ke mana saja yang dikehendakinya sehingga dia dapat menempuh perjalanan jauh hanya dalam sekejap. Dan kami tundukkan pula untuknya setan-setan dan jin-jin, semuanya ahli bangunan dan penyelam. Mereka ahli membangun istana, gedung megah, tempat peribadatan, bahkan hiasan dari keramik seperti patung, cawan, teko, dan sebagainya; serta ahli mengambil berbagai perhiasan dari dasar laut, seperti mutiara dan marjan. Mereka tekun bekerja (lihat pula: surah al-anbiy'/21: 81'82; saba'/34: 12'13), dan adapun setan yang lain yang tidak mematuhi perintahnya, mereka ter-ikat dalam belenggu sehingga tidak mengganggu mereka yang bekerja. 39-40. Kami berikan kepada nabi sulaiman kerajaan, kekayaan, dan kekuasaan yang tidak kami berikan kepada siapa pun sesudahnya. Inilah anugerah kami yang agung kepadamu, wahai nabi sulaiman; maka berikanlah sebagian dari karunia itu kepada orang lain atau tahanlah untuk dirimu sendiri, tanpa perhitungan dan tuntutan atasmu sebagai aturan yang kami khususkan untukmu. Dan sungguh, Allah telah me-ngabulkan doanya dan memberi dia kemuliaan di dunia dengan mempunyai kedudukan yang dekat pada sisi kami dan tempat kembali yang baik, yaitu surga."
  }
]