[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5 orang-orang kafir itu merasa aneh terhadap pengutusan Allah terhadap seorang manusia seperti mereka untuk mengajak mereka menyembah Allah semata dan menakuti mereka terhadap azabNya, dan mereka berkata ”Dia bukan seorang rasul, akan tetapi seorang pembohong dalam perkataannya, penyihir terhadap kaumnya; bagaimana dia menjadikan tuhan-tuhan yang banyak jadi satu? sungguh apa yang dia bawa dan apa yang dia serukan, adalah sesuatu yang aneh”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Mereka heran ketika seorang Rasul dari kalangan mereka datang memperingatkan mereka dari azab Allah bila mereka terus bersikukuh di atas kekufuran. Ketika mereka melihat bukti-bukti kebenaran apa yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam-, orang-orang kafir berkata, “Laki-laki ini adalah penyihir yang menyihir manusia, pembohong terkait klaim diucapkannya bahwa dia adalah Rasulullah yang mendapatkan wahyu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Orang-orang kafir itu merasa heran terhadap seorang lelaki yang Allah utus untuk mengajak mereka kepada Allah dan memperingatkan mereka dari azab-Nya; sehingga mereka mengingkari dan mendustakannya. Mereka berkata: “Dia bukanlah seorang rasul, akan tetapi orang yang gemar berdusta dan seorang penyihir di kaumnya; karena bagaimana bisa dia menganggap tuhan-tuhan yang banyak itu sebagai Tuhan Yang Satu? Sungguh ketauhidan yang dia serukan itu merupakan hal yang mengherankan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَعَجِبُوٓا۟ أَن جَآءَهُم مُّنذِرٌ مِّنْهُمْ ۖ (Dan mereka heran karena mereka kedatangan seorang pemberi peringatan (rasul) dari kalangan mereka) Yakni seorang rasul yang memperingatkan mereka dari azab jika mereka tetap pada kekafiran. وَقَالَ الْكٰفِرُونَ هٰذَا سٰحِرٌ كَذَّابٌ (dan orang-orang kafir berkata: “Ini adalah seorang ahli sihir yang banyak berdusta”) Mereka mengatakan ini setelah menyaksikan mukjizat di luar kemampuan manusia didatangkan Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Orang musyrik Makkah heran dengan diutusnya rasul dari golongan mereka yaitu suku Arab. Yang memperingatkan mereka atas azab Allah yaitu azab neraka jika mereka tetap dalam kekufuran. Orang-orang kafir itu berkata: “Lelaki ini hanyalah seorang penyihir atas keterangan-keterangan yang dibawanya. Dia hanyalah seorang pendusta yang mengaku bahwa dia adalah utusan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka heran karena telah datang kepada mereka seorang pemberi peringatan dari kalangan mereka} dari jenis mereka {Orang-orang kafir berkata,“Orang ini adalah penyihir yang banyak berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan mereka heran karena mereka kedatangan seorang pemberi peringatan dari kalangan mereka.” Maksudnya, orang-orang yang mendustakan merasa heran terhadap suatu perkara yang tidak pantas untuk diherankan, yaitu karena datangnya seorang pemberi peringatan dari kalangan mereka sendiri supaya mereka bisa belajar kepadanya dan supaya mereka bisa mengenalnya dengan sebenar-benarnya, dan karena ia berasal dari kaum mereka sendiri, sehingga fanatisme kesukuan tidak bisa mencegah mereka untuk mengikutinya. Padahal perkara ini termasuk hal yang patut disyukuri dan dipatuhi sepenuhnya. Namun mereka malah sebaliknya, mereka sangat heran dengan kebenaran yang bermakna mengingkari, dan mereka berkata karena kekafiran dan kezhaliman mereka, “Ini adalah seorang ahli sihir yang banyak berdusta.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Shad ayat 4: Mereka yang mendustakan merasa heran terhadap sesuatu yang sebenarnya tidak mengherankan, yaitu karena datang kepada mereka seorang pemberi peringatan dari kalangan mereka sendiri (manusia). Padahal maksud diutus dari kalangan mereka adalah agar mereka dapat menimba langsung nasehat-nasehat dan peringatan dan agar mereka dapat mengikuti aktifitas kesehariannya yang diridhai oleh Allah Rabbul ‘aalamin, dan lagi Beliau berasal dari suku mereka sendiri, sehingga tidak ada penghalang kesukuan yang membuat mereka tidak mau mengikutinya. Hal ini seharusnya membuat mereka bersyukur dan tunduk secara sempurna. Akan tetapi sikap mereka malah kebalikannya, mereka merasa heran sekali terhadapnya dan mengingkarinya, serta mengatakan kata-kata yang muncul dari kekafiran dan kezaliman mereka, yaitu, “Orang ini adalah pesihir yang banyak berdusta.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 4",
    "description": "Kami utus nabi Muhammad kepada penduduk mekah dan mereka yang ingkar merasa heran karena mereka kedatangan seorang rasul pemberi peringatan yang tidak lain berasal dari kalangan mereka sendiri; dan karena keingkaran yang begitu dalam kepada rasulullah, orang-orang kafir berkata, 'orang ini adalah penyihir yang banyak berdusta. ' mereka berkata demikian karena apa yang disampaikan oleh nabi tidak sesuai dengan apa yang mereka inginkan. 5. Ketika nabi mengajak mereka menyembah dan mengesakan Allah, mereka menjawab dengan penuh keingkaran, 'apakah dia menjadikan tuhan-tuhan itu tuhan yang satu saja' sungguh, ini benar-benar sesuatu yang sangat mengherankan. Kami, kabilah-kabilah arab, mempunyai tuhan masing-masing. '."
  }
]