[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya sulaiman di sisi Kami di alam akhirat memiliki kedekatan dan tempat kembali yang baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya Sulaiman di sisi Kami termasuk orang-orang yang dekat, baginya tempat kembali yang baik, yaitu surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Dan bagi Sulaiman kedudukan yang dekat dan derajat yang tinggi di sisi Kami di akhirat kelak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَإِنَّ لَهُۥ عِندَنَا لَزُلْفَىٰ (Dan sesungguhnya dia mempunyai kedudukan yang dekat pada sisi Kami) Yakni kedekatan di akhirat. وَحُسْنَ مَـَٔابٍ (dan tempat kembali yang baik) Yakni tempat kembali yang baik berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sulaiman memiliki kedudukan yang dekat dan mulia di sisi Kami, dia akan kembali kepada sebaik-baik tempat yaitu surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya dia mempunyai kedudukan yang dekat di sisi Kami dan tempat kembali yang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Dan jangan sekali-kali Anda mengira bahwa itu semua hanya di dunia saja yang didapat Nabi Sulaiman, sedangkan di akhirat tidak! Bahkan di akhirat nanti beliau akan mendapatkan kebaikan yang sangat besar. Maka dari itu Allah berfirman, “Dan sesungguhnya dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik.” Artinya, beliau termasuk orang-orang yang didekatkan di sisi Allah dan dimuliakan dengan berbagai macam karamah oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 40: (Dan sesungguhnya dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik) penafsiran ayat ini sebagaimana yang telah lalu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jangan engkau kira bahwa kenikmatan itu diberikan kepada Sulaiman di dunia, bahkan di akhirat ia juga memperoleh kebaikan yang besar. Beliau termasuk orang-orang yang didekatkan dengan Allah Subhaanahu wa Ta'aala. Pelajaran yang dapat diambil dari kisah Nabi Dawud dan Nabi Sulaiman ‘alaihimas salam cukup banyak, di antaranya adalah sebagai berikut: 1. Allah Subhaanahu wa Ta'aala mengisahkan kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam berita orang-orang terdahulu agar hati Beliau kokoh dan tenteram, dan menyebutkan kepada Beliau ibadah mereka, kesabarannya dan kembalinya mereka, di mana hal tersebut membuat Beliau rindu berlomba dengan mereka, rindu mendekatkan diri kepada Allah sebagaimana yang mereka lakukan serta bersabar terhadap gangguan kaumnya. Oleh karena itu, di sini ketika Allah Subhaanahu wa Ta'aala menyebutkan tentang gangguan kaum Beliau terhadap Beliau, ucapan mereka terhadap Beliau, ucapan mereka terhadap yang Beliau bawa, maka Allah Subhaanahu wa Ta'aala menyuruh Beliau bersabar dan mengingat hamba-Nya Dawud ‘alaihiss salam agar Beliau merasa terhibur dengannya. 2. Allah Subhaanahu wa Ta'aala memuji dan mencintai orang yang kuat dalam menjalankan ketaatan kepada-Nya, yakni kuat hati dan badan, di mana daripadanya muncul atsar (pengaruh) dari ketaatan, kebaikannya dan banyaknya ketaatan yang tidak akan dihasilkan jika berasal dari kelemahan dan tidak adanya kekuatan, dan bahwa sepatutnya bagi seorang hamba mendatangi sebab-sebabnya, tidak memilih kemalasan dan santai yang merusak kekuatan dan melemahkan jiwa. 3. Kembali kepada Allah dalam segala urusan termasuk sifat-sifat para nabi dan manusia pilihan-Nya sebagaimana Allah memuji Nabi Dawud dan Sulaiman karena memiliki sifat itu. Oleh karena itu, hendaknya hal itu diikuti. Allah Subhaanahu wa Ta'aala berfirman, “Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah, Maka ikutilah petunjuk mereka.” (Terj. Al An’aam: 90) 4. Allah memberikan keistimewaan kepada Nabi-Nya Dawud ‘alaihis salam dengan suara yang bagus, di mana dengan sebabnya gunung-gunung dan burung-burung ikut bertasbih bersama Beliau di pagi dan petang. 5. Termasuk nikmat besar yang Allah karuniakan kepada hamba-Nya adalah Allah karuniakan kepadanya ilmu yang bermanfaat, mengetahui hukum dan dapat memutuskan masalah manusia dengan adil sebagaimana Allah Subhaanahu wa Ta'aala memberikan nikmat-Nya ini kepada hamba-Nya Dawud ‘alaihis salam. 6. Perhatian Allah Subhaanahu wa Ta'aala kepada para nabi dan manusia pilihan-Nya ketika terjadi sedikit ketergelinciran dari mereka dengan memberikan cobaan yang dengannya dapat tersingkir sesuatu yang dikhawatirkan, dan keadaan mereka menjadi lebih sempurna sebagaimana yang terjadi pada Nabi Dawud dan Nabi Sulaiman ‘alaihimas salam. 7. Para nabi ‘alaihimush shalaatu was salaam adalah orang-orang yang ma’shum (terpelihara) dari kesalahan dalam hal yang mereka sampaikan dari Allah Subhaanahu wa Ta'aala, karena maksud dari risalah tidaklah tecapai kecuali dengan cara seperti itu, dan bisa saja mereka tergelincir ke dalam maksiat karena terdorong oleh tabiat manusiawi dari mereka, akan tetapi Allah Subhaanahu wa Ta'aala dengan kelembutan-Nya segera menarik mereka. 8. Nabi Dawud ‘alaihis salam pada sebagian besar keadaannya senantiasa menetap di mihrabnya untuk berkhidmat kepada Tuhannya. Oleh karena itulah dua orang yang bertengkar itu menaiki dinding mihrab, karena ketika Beliau sedang menyendiri di mihrab, tidak ada seorang pun yang mendatanginya, bahkan Beliau tidak menjadikan semua waktunya untuk manusia meskipun banyak masalah-masalah yang datang kepadanya. Beliau menjadikan waktu khusus untuk menyendiri bersama Tuhannya, merasa tenang dengan beribadah kepada-Nya, sehingga membantunya untuk ikhlas dalam semua urusannya. 9. Sepatutnya ketika masuk menggunakan adab yang baik, karena ketika dua orang yang bertengkar masuk menemui Nabi Dawud ‘alaihis salam dengan cara yang tidak biasanya dan tidak melalui pintu masuk, membuat Beliau terkejut dan takut kepada mereka, demikian pula akan membuat tuan rumah lainnya takut dan berprasangka buruk kepadanya. 10. Sikap kurang sopan dari orang yang bermasalah tidak boleh menghalangi hakim memutuskan dengan hak (benar). 11. Sabarnya Nabi Dawud ‘alaihis salam, karena Beliau tidak segera marah ketika didatangi dua orang yang bertengkar yang masuk tanpa meminta izin, padahal Beliau raja. Beliau tidak membentaknya dan tidak memarahinya. 12. Bolehnya orang yang dizalimi berkata kepada orang yang menzaliminya, “Engkau telah menzalimiku.” 13. Orang yang dinasihati meskipun kedudukannya tinggi dan ilmunya banyak janganlah marah, bahkan hendaknya ia menyikapinya dengan menerima dan berterima kasih. 14. Persekutuan antara kerabat dan teman serta banyak terkait dengan masalah harta duniawi menyebabkan timbul permusuhan dan sikap zalim terhadap yang lain, dan tidak ada yang dapat menolak hal itu selain berpegang dengan takwa, bersabar di atas perkara yang benar dengan iman dan amal saleh, dan bahwa ini merupakan sesuatu yang paling sedikit dilakukan oleh manusia. 15. Istighfar dan ibadah, khususnya shalat termasuk penghapus dosa. 16. Pemuliaan dari Allah Subhaanahu wa Ta'aala kepada hamba-Nya Dawud dan Sulaiman dengan didekatkan kepada-Nya, memperoleh pahala yang baik, dan agar tidak ada yang menyangka bahwa yang terjadi pada keduanya mengurangi derajat keduanya di sisi Allah Subhaanahu wa Ta'aala. Inilah di antara sempurnanya kelembutan Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya yang ikhlas, yaitu apabila Dia telah mengampuni mereka dan menyingkirkan bekas dosa mereka, maka Dia singkirkan pula atsar (bekas) yang diakibatkan dari dosa itu sehingga tidak menempel di hati manusia. Karena apabila mereka mengetahui sebagian dosa mereka, maka akan terasa dalam hati mereka turunnya kedudukan orang-orang tersebut, maka Allah Subhaanahu wa Ta'aala singkirkan atsar ini, dan hal ini tidaklah sulit bagi Allah Subhaanahu wa Ta'aala Yang Maha Mulia dan Maha Pengampun. 17. Memutuskan hukum di antara manusia adalah kedudukan agama yang dilakukan para rasul Allah dan makhluk pilihan-Nya, dan bagi orang yang melakukannya wajib memutuskan dengan hak dan menjauhi hawa nafsu. Tentunya untuk memutuskan dengan hak dibutuhkan pengetahuan terhadap perkara syar’i, mengetahui gambaran masalah yang akan dihukumi, dan cara memasukkannya ke dalam hukum syar’i. Adapun orang yang tidak mengetahui salah satunya tidak cocok memutuskan dan tidak halal maju untuk memutuskannya. 18. Bagi hakim harus berhati-hati terhadap hawa nafsu, ia harus melawan nafsunya agar kebenaran menjadi tujuannya, serta membuang rasa cinta atau benci kepada salah satu pihak ketika memberikan keputusan. 19. Nabi Sulaiman ‘alaihis salam bagian dari keutamaan Nabi Dawud ‘alaihis salam, dan termasuk nikmat Allah Subhaanahu wa Ta'aala kepadanya adalah mengaruniakan Sulaiman kepada Nabi Dawud ‘alaihis salam, dan bahwa termasuk nikmat terbesar dari Allah kepada seorang hamba adalah dikaruniakan-Nya anak yang saleh, jika anak tersebut berilmu, maka berarti cahaya di atas cahaya. 20. Pujian Allah Subhaanahu wa Ta'aala kepada Nabi Sulaiman ‘alaihis salam. 21. Banyaknya kebaikan Allah kepada hamba-hamba-Nya, Dia mengaruniakan amal yang saleh dan akhlak yang mulia, kemudian memuji mereka, padahal Dialah yang memberikannya. 22. Nabi Sulaiman ‘alaihis salam mengutamakan kecintaan kepada Allah di atas kecintaan kepada segala sesuatu. 23. Segala sesuatu yang menyibukkan hamba dari mengingat Allah adalah hal yang tercela, maka hendaklah ia tinggalkan dan beralih kepada hal yang lebih bermanfaat baginya. 24. Termasuk kaidah penting yang perlu diingat adalah, bahwa barang siapa meninggalkan sesuatu karena Allah, maka Allah akan menggantinya dengan yang lebih baik darinya. Nabi Sulaiman alaihis salam sampai rela mengorbankan harta yang dicintainya, yaitu kuda jinak yang cepat larinya agar dapat beribadah kepada Allah Subhaanahu wa Ta'aala dan tidak disibukkan olehnya. 25. Penundukkan setan tidak bisa dilakukan oleh seorang pun setelah Nabi Sulaiman ‘alaihis salam. 26. Nabi Sulaiman ‘alaihis salam adalah seorang raja dan nabi, dia berhak berbuat apa saja yang dia inginkan, akan tetapi Beliau tidak menginginkan selain keadilan. Perbedaannya dengan Nabi Muhammad shallallahu 'alaihi wa sallam adalah, bahwa Beliau adalah seorang nabi dan seorang hamba, bukan raja, sehingga keinginan Beliau mengikuti perintah Allah, di mana Beliau tidaklah berbuat dan meninggalkan sesuatu kecuali dengan perintah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 40",
    "description": "39-40. Kami berikan kepada nabi sulaiman kerajaan, kekayaan, dan kekuasaan yang tidak kami berikan kepada siapa pun sesudahnya. Inilah anugerah kami yang agung kepadamu, wahai nabi sulaiman; maka berikanlah sebagian dari karunia itu kepada orang lain atau tahanlah untuk dirimu sendiri, tanpa perhitungan dan tuntutan atasmu sebagai aturan yang kami khususkan untukmu. Dan sungguh, Allah telah me-ngabulkan doanya dan memberi dia kemuliaan di dunia dengan mempunyai kedudukan yang dekat pada sisi kami dan tempat kembali yang baik, yaitu surga. 41. Cerita tentang nabi dawud dan sulaiman yang diberi berba-gai kenikmatan oleh Allah diikuti oleh kisah tentang nabi ayyub yang hidupnya penuh ujian dan cobaan. Dan ingatlah, wahai nabi Muhammad, akan kisah salah seorang hamba kami, yaitu nabi ayyub, yang sangat sabar dan taat kepada Allah. Dan ingatlah ketika dia mendapat ujian dan cobaan dari Allah, dia menyeru dan berdoa kepada tuhannya, 'sesungguhnya aku diganggu setan dengan penderitaan, sakit menahun, dan bencana yang besar dengan hilangnya harta kekayaan dan anak keturunanku. Aku mengadu kepada-Mu karena engkau maha penyayang. \" (lihat pula: surah al-anbiy'/21: 83)."
  }
]