[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah juga (wahai rasul) hamba Kami ayyub, saat dia berdasa kepada tuhannya, ”setan telah membuatku susah dan lelah. serta menyakiti badan, harta dan keluargaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Ingatlah -wahai Rasul- hamba Kami Ayyub ketika dia berdoa kepada Rabbnya, \"Sesungguhnya setan menimpakan kepadaku penyakit yang menyulitkan dan melelahkan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Hai Muhammad, ingatlah hamba Kami, Ayyub ketika dia berdoa kepada Tuhannya akibat penyakit yang menimpanya, dengan berkata: “Setan telah membuatku lelah, menderita, dan kesakitan pada badan, keluarga, dan hartaku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. بِنُصْبٍ وَعَذَابٍ (dengan kepayahan dan siksaan) Yakni dengan kebinasaan keluarga dan hartanya, serta dengan kederitaan dan penyakit. Hal ini dinisbahkan kepada setan karena dialah yang menyebabkan cobaan ini. Namun dikatakan juga bahwa penyebabnya adalah ketakjubannya terhadap hartanya yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Ingatlah hamba-Ku yang penyabar yaitu Ayyub bin Amus bin Arum wahai Nabi, ketika dia menyeru Tuhannya dengan berserah diri bahwa setan-setan telah mengganggunya dengan kepayahan, penyakit dan siksaan. Atau penyakit yang menimpa Ayyub itu dia nisbatkan kepada setan sebagai adab dan sopan santun kepada Allah, adapun jika tentang kebaikan dian sandarkan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah hamba Kami Ayyub ketika dia menyeru Tuhannya,“Sesungguhnya aku telah diganggu} aku telah diganggu {setan dengan penderitaan} kesusahan {dan siksaan} rasa sakit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Maksudnya, “dan ingatlah” di dalam kitab suci yang penuh pelajaran ini, “akan hamba Kami Ayyub,” dengan sebaik-baik mengingat, dan pujilah dia dengan sebaik-baik pujian, yaitu pada saat ia ditimpa penyakit, lalu ia sabar atas penyakit yang dideritanya; ia tidak mengeluh kepada selain Rabbnya dan tidak pula pernah kembali kecuali hanya kepadaNya. Maka “ia menyeru Rabbnya,” seraya berdoa kepadaNya, bukan kepada selainNYa ia mengadu, seraya mengatakan, Rabbku, “sesungguhnya aku diganggu setan dengan kepayahan dan siksaan.” Artinya, dengan penyakit yang sangat menyusahkan, melelahkan, lagi menyiksa. Setan berhasil menguasai jasadnya dan meniupnya hingga sekujur tubuhnya berkoreng lalu bernanah sesudah itu, dan keadaannya pun makin parah, dan keluarga serta hartanya ikut binasa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 41: (Dan ingatlah akan hamba Kami Ayub ketika ia menyeru Rabbnya, \"Sesungguhnya aku) bahwasanya aku (diganggu oleh setan dengan kepayahan) kemudaratan (dan siksaan\") yakni rasa sakit. Nabi Ayub menisbatkan atau mengaitkan hal tersebut kepada setan, sekalipun pada kenyataannya segala sesuatu itu berasal dari Allah swt. Dimaksud sebagai sopan santun Nabi Ayub terhadap Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan tentang hamba dan Rasul-Nya Ayyub ‘alaihis salam, cobaan-Nya kepadanya berupa musibah yang mengena kepada jasadnya, hartanya dan anaknya, bahkan mengena ke sekujur tubuhnya selain hatinya dan lisannya yang digunakan untuk berdzikr, dan tidak seorang pun yang membantu dan merawatnya ketika menderita sakit tersebut selain istrinya yang tetap menjaganya karena beriman kepada Allah dan Rasul-Nya, ia sampai rela bekerja kepada orang lain dengan mendapatkan upah untuk memberi makan suaminya dan tetap melayaninya selama kurang lebih 18 tahun, padahal sebelumnya Nabi Ayyub memiliki harta dan anak yang banyak, namun semuanya telah tiada sampai Beliau diletakan di tempat sampah di antara tempat sampah di negeri itu dalam waktu yang lama itu. Orang-orang menjauhinya baik orang dekatnya maupun orang yang jauh selain istrinya yang tetap menemaninya di pagi dan sore kecuali pada saat sedang bekerja, setelah itu istrinya segera kembali menemuinya. Setelah berlalu waktu yang cukup lama, keadaan semakin parah dan sudah mencapai puncaknya dan batas waktu yang telah ditetapkan sudah tiba, maka Nabi Ayyub dengan merendahkan diri berdoa kepada Allah Subhaanahu wa Ta'aala, “Sesungguhnya aku diganggu setan dengan penderitaan dan bencana.” Maka Allah memperkenankan doanya dan memerintahkan agar dia bangun dan menghentakkan kakinya ke bumi. Ayyub menaati perintah itu, maka keluarlah air dari bekas kakinya atas petunjuk Allah, Ayyub pun mandi dan minum dari air itu, sehingga sembuhlah badannya dari penyakitnya. Selanjutnya, Allah memerintahkan lagi untuk menghentakkan lagi kakinya ke bumi di bagian yang lain, maka memancarlah air lagi, lalu Allah memerintahkannya meminum airnya sehingga hilanglah penyakit yang menimpa badannya bagian dalam, dan Beliau pun dapat berkumpul kembali dengan keluarganya (menurut Al Hasan, Allah menghidupkan kembali anak-anaknya dan melipatgandakannya). Ibnu Jarir dan Ibnu Abi Hatim meriwayatkan dari Anas bin Malik radhiyallahu 'anhu ia berkata: Sesungguhnya Rasulullah shallallahu 'alaihi wa sallam bersabda, “Sungguhnya Nabi Allah Ayyub ‘alaihis salam menderita musibah selama 18 tahun, lalu orang yang dekat maupun yang jauh menjauhinya selain dua orang yang termasuk kawan dekatnya, di mana keduanya sering datang di pagi dan sore hari. Yang satu berkata kepada kawannya, “(Apakah) engkau tahu, demi Allah, sesungguhuhnya Ayyub telah melakukan dosa yang tidak pernah dilakukan oleh seorang di alam semesta?” Kawan yang satu lagi berkata, “Dosa apa itu?” Dia menjawab, “Sudah 18 tahun, Allah tidak menyayanginya sehingga menghilangkan deritanya.” Ketika keduanya datang di sore hari, maka salah seorang di antara mereka tidak sabar sampai menyampaikan ucapan itu kepadanya. Lalu Ayyub ‘alaihish shalatu was salam berkata, “Aku tidak mengetahui yang engkau ucapkan. Hanyasaja, Allah ‘Azza wa Jalla mengetahui, bahwa aku pernah melewati dua orang yang bertengkar lalu keduanya menyebut nama Allah Ta’ala, kemudian aku pulang ke rumahku dan menbus untuk keduanya (karena ucapan mereka itu) karena (aku) tidak suka jika nama Allah Ta’ala disebut kecuali jika di atas yang benar.” (Anas berkata lagi), “Beliau pernah keluar karena kebutuhannya. Setelah selesai, istrinya memegang tangannya hingga Ayyub sampai (ke tempat semula). Suatu hari, istrinya terlambat datang kepadanya, maka Allah Tabaaraka wa Ta'aala memberi wahyu kepada Ayyub ‘alaihish shalaatu was salam, “Hentakkanlah kakimu (ke bumi). Inilah air yang sejuk untuk mandi dan minum.” Lalu istrinya kembali lagi dengan terlambat untuk melihatnya, sedangkan Ayyub sedang mendatanginya dan Allah telah menghilangkan musibah yang menimpanya dan keadaannya menjadi sangat baik. Saat istrinya melihatnya, ia berkata, “Wahai, semoga Allah memberkahimu, apakah engkau melihat nabi Allah yang mendapat musibah ini. Demi Allah, aku tidak melihat seorang yang lebih mirip dengannya ketika sehat daripada engkau.” Ayyub menjawab, “Inilah saya.” (Anas berkata), “Ayyub memiliki dua tumpukan; baik tumpukan gandum maupun tumpukan sya’ir (sejenis gandum), maka Allah Subhaanahu wa Ta'aala mengirim dua awan. Ketika salah satunya berada di atas tumpukan gandum, maka awan itu mencurahkan emas sehingga melimpah ruah, demikian pula awan yang satu lagi mencurahkan (emas) di tumpukan sya’ir sehingga melimpah.” Imam Ahmad meriwayatkan dari Abu Hurairah radhiyallahu 'anhu ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda, “Ketika Ayyub sedang mandi dalam keadaan telanjang, maka jatuhlah kepadanya belalang dari emas, lalu Ayyub ‘alihish shalaatu was salam segera mengeruk dengan kainnya. Kemudian Tuhannya ‘Azza wa Jalla memanggilnya, “Wahai Ayyub! Bukankah Aku telah mencukupkanmu dari apa yang kamu lihat (sekarang). Dia (Ayyub) berkata, “Ya, benar wahai Tuhanku, akan tetapi aku tetap tidak cukup dengan keberkahan dari-Mu.” (Hadits ini diriwayatkan pula oleh Bukhari). Yakni ketika Beliau tertimpa musibah, lalu Beliau bersabar dan tidak mengadu selain kepada Allah Tuhannya dan tidak kembali selain kepada-Nya. Kepada Allah-lah Beliau mencurahkan isi hatinya. Yakni setan diberikan kekuasaan untuk menguasai jasadnya lalu ia (setan) meniupnya sehingga keluar bisul lalu bengkak dan bernanah, kemudian keadaannya pun semakin parah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 41",
    "description": "Cerita tentang nabi dawud dan sulaiman yang diberi berba-gai kenikmatan oleh Allah diikuti oleh kisah tentang nabi ayyub yang hidupnya penuh ujian dan cobaan. Dan ingatlah, wahai nabi Muhammad, akan kisah salah seorang hamba kami, yaitu nabi ayyub, yang sangat sabar dan taat kepada Allah. Dan ingatlah ketika dia mendapat ujian dan cobaan dari Allah, dia menyeru dan berdoa kepada tuhannya, 'sesungguhnya aku diganggu setan dengan penderitaan, sakit menahun, dan bencana yang besar dengan hilangnya harta kekayaan dan anak keturunanku. Aku mengadu kepada-Mu karena engkau maha penyayang. \" (lihat pula: surah al-anbiy'/21: 83). 42. Menjawab doa nabi ayyub, Allah berfirman, 'hentakkanlah kaki-Mu!' dia pun menuruti perintah tuhannya, lalu dari bawah telapak kakinya muncul sebuah mata air. Dikatakan kepadanya, 'inilah air yang sejuk untuk mandi dan untuk minum. Minum dan mandilah dengan airnya, niscaya Allah akan menghilangkan penderitaan dan bencana darimu. '."
  }
]