[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu Kami menghapus kesulitannya, Kami memuliakannya, mengembalikan keluarganya anak-anak dan istrinya, dan Kami juga melipatgandakan jumlah mereka dengan memberinya anak-anak dan cucu-cucu. Semua itu adalah rahmat Kami kepadanya, penghargaan ataas kesabarannya, pelajaran dan peringatan bagi para pemilik akal yang lurus, agar mereka mengetahui bahwa akibat dari kesabaran adalah kemudahan dan terangkatnya kesulitan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Kami mengabulkan doanya, Kami mengangkat penyakit yang menimpanya, Kami mengembalikan keluarganya. Kami menambah anak-anak dan cucu-cucu seperti yang hilang darinya sebagai rahmat dari Kami kepadanya dan balasan atas kesabarannya, serta agar para pemilik akal yang lurus mengambil pelajaran bahwa akhir dari kesabaran adalah kemudahan dan pahala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Dan Kami karuniakan kepadanya istri dan anak, dan Kami tambah dengan anak-anak yang lain dan cucu-cucu. Ini merupakan rahmat dari Kami, balasan atas kesabarannya, jawaban atas doanya, dan ibrah bagi orang-orang yang berakal sehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَوَهَبْنَا لَهُۥٓ أَهْلَهُۥ (Dan Kami anugerahi dia (dengan mengumpulkan kembali) keluarganya) Terdapat pendapat mengatakan bahwa Allah menghidupkan mereka kembali setelah kematian mereka. Dan pendapat lain mengatakan bahwa Allah mengumpulkan mereka setelah saling terpisah. وَمِثْلَهُم مَّعَهُمْ(dan (Kami tambahkan) kepada mereka sebanyak mereka pula) Yakni Allah menambah jumlah mereka sehingga jumlah mereka menjadi dua kali lipat dibandingkan jumlah mereka sebelum dia diberi cobaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. kami mengumpulkan kembali keluarganya (setelah bercerai berai), kami anugerahi mereka dengan keturunan yang banyak, sehingga mereka menjadi lemah sebelum Allah mengujinya, maka Kami akan merahmati mereka,dengan nasihat, mengingat pada diri mereka supaya mereka melihat kelapangan setelah kesabaran, bagi mereka orang-orang yang berfikir (mendalam)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menganugerahkan kepadanya keluarganya dan (Kami tambahkan) seperti (jumlah) mereka} dan kami menambahkan anak-anak dan cucu sejumlah mereka {sebagai rahmat dari Kami dan pelajaran} pengingat {bagi orang-orang yang berpikiran sehat} orang-orang yang berakal sehat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Dan Kami anugerahkan kepadanya keluarganya.” Menurut suatu pendapat, Allah menghidupkan kembali mereka, “dan (kami tambahkan) kepada mereka sebanyak mereka pula” di dunia, kemudian Allah menjadikannya kaya dan mengaruniakan harta yang berlimpah kepadanya, “sebagai rahmat dari Kami” kepada hamba Kami Ayyub, karena ia telah sabar, maka Kami tetapkan bagian dari rahmat Kami padanya sebagai pahala yang segera di dunia dan nanti di akhirat, “dan pelajaran bagi orang-orang yang mempunyai pikiran.” Maksudnya, dan agar orang-orang yang berakal mengambil pelajaran dan ibrah yang besar atas musibah, maka Allah akan membalasnya dengan pahala dunia dan akhirat, dan Allah kabulkan doanya apabila ia berdoa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 43: (Dan Kami anugerahi dia dengan mengumpulkan kembali keluarganya dan Kami tambahkan kepada mereka sebanyak mereka) maksudnya, Allah menghidupkan kembali anak-anaknya yang telah mati itu, dan menambah pula kepadanya anak lain sejumlah anak yang telah mati itu (sebagai rahmat) sebagai nikmat dan karunia (dari Kami dan pelajaran) nasihat (bagi orangorang yang mempunyai pikiran) yaitu bagi orang-orang yang berakal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni atas kesabarannya, keteguhannya, kembalinya kepada Allah, tawadhu’ dan penyerahan dirinya kepada Allah ‘Azza wa Jalla. Yakni agar mereka mengetahui, bahwa akhir dari kesabaran adalah kelonggaran dan jalan keluar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 43",
    "description": "Kami sembuhkan penyakit nabi ayyub dan setelah itu kami anu-gerahi dia kebahagiaan berkumpul kembali bersama keluarganya yang lama terpisah dan kami lipatgandakan jumlah mereka sehingga keluarga serta pengikutnya bertambah banyak. Kami anugerahkan hal itu se-bagai rahmat dari kami bagi orang yang berbuat baik dan sabar dalam menerima cobaan, dan sebagai pelajaran bagi orang-orang yang berpikir-an sehat serta meyakini kemurahan dan rahmat Allah. 44. Nabi ayyub pernah bersumpah akan memukul istrinya akibat kelalaiannya dalam merawat beliau. Allah mengizinkan beliau untuk melaksanakan sumpah itu tanpa mendatangkan rasa sakit berlebih kepada istrinya. Untuk itu Allah berfirman, 'dan ambillah seikat rumput dengan tanganmu, lalu pukullah istrimu sekali saja dengan itu dan janganlah engkau melanggar sumpah yang pernah kauucapkan. ' sesungguhnya kami dapati dia sebagi seorang yang sabar dan ikhlas dalam menghadapi cobaan. Dialah sebaik-baik hamba yang tidak pernah putus asa. Sungguh, dia sangat taat dalam melaksanakan perintah kami. Ujian dan cobaan bisa menimpa siapa saja. Jika hal itu dihadapi dengan sabar, tawakal, dan berusaha secara maksimal, niscaya Allah akan mengganti dengan imbalan lebih banyak, bahkan terkadang tidak terduga."
  }
]