[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami berfirman kepadanya ”ambilah seikat rumput dengan tanganmu atau yang semisal dengannya, pukullah istrimu dengannya untuk memenuhi sumpahmu, sehingga kamu tidak melanggar sumpah.” hal itu karena ayub bersupah akan memukul istrinya seratus kali bila Allah menyembuhkannya saat dia marah kepada istrinya gara-gara hal sepele saat dia sakit. Istri ayyub adalah wanita shalihah, maka Allah menyanyangi istrinya dan menyayanginya dengan keputusan tersebut. Sesungguhnya Kami mendapatkan ayyub sebagi seorang yang sabar menghadapi ujian, sebaik-baik hamba adalah dia, sesungguhnya dia gemar kembali menuju ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Ketika Ayyub marah kepada istrinya, dia bersumpah untuk memukulnya sebanyak seratus cambukan, Kami berfirman kepadanya, “Wahai Ayyub! Ambillah seikat lidi pelepah kurma dan pukullah istrimu dengannya untuk memenuhi sumpahmu dan agar kamu tidak melanggar sumpah yang telah kamu ucapkan.” Maka dia melakukannya. Sesungguhnya Kami mendapati Ayyub adalah orang yang sabar menghadapi apa yang Kami ujikan kepadanya. Sebaik-baik hamba adalah Ayyub. Sesungguhnya dia banyak kembali dan berpulang kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Dan Kami katakan kepadanya ketika Ayyub bersumpah untuk memukul istrinya: “Ambillah seikat ranting rerumputan dan sejenisnya, lalu pukullah dengan itu siapa yang kamu bersumpah untuk memukulnya, agar kamu tidak melanggar sumpahmu dan tidak pula menyakiti orang yang kamu cintai.” Kami mendapati Ayyub merupakan hamba yang sabar dalam menghadapi cobaan yang menimpanya; sungguh dia adalah sebaik-baik hamba yang bersabar dan taat kepada Tuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَخُذْ بِيَدِكَ ضِغْثًا (Dan ambillah dengan tanganmu seikat (rumput)) Makna (الضغث) yakni seikat besar ranting-ranting. فَاضْرِب بِّهِۦ وَلَا تَحْنَثْ ۗ( maka pukullah dengan itu dan janganlah kamu melanggar sumpah) Yakni pukullah dengan seikat ranting itu dan janganlah kamu melanggar sumpahmu. Ayyub telah bersumpah pada saat dia sedang sakit untuk memukul istrinya sebanyak seratus kali akibat kesalahan yang istrinya itu lakukan. Maka Allah memberinya jalan keluar untuk melaksanakan sumpahnya. Kemudian Allah memuji Ayyub dengan firman-Nya: إِنَّا وَجَدْنٰهُ صَابِرًا ۚ( Sesungguhnya Kami dapati dia (Ayyub) seorang yang sabar) Yakni bersabar atas cobaan yang Kami berikan kepadanya; dia diuji dengan penyakit yang parah pada tubuhnya dan dengan sirnanya harta, istri, dan anak-anaknya, namun dia tetap bersabar. نِّعْمَ الْعَبْدُ ۖ( Dialah sebaik-baik hamba) Yakni sebaik-baik hamba adalah Ayyub. إِنَّهُۥٓ أَوَّابٌ(Sesungguhnya dia amat taat (kepada Tuhan-nya)) Yakni yang senantiasa kembali kepada Allah dengan memohon ampun dan bertaubat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Dan ambillah seikat rumput dengan tanganmu, lalu pukullah istrimu dengan ikatan rumput tersebut, dan janganlah engkau melanggar sumpah. Pelanggaran: terjatuh dalam dosa disebabkan tidak melaksanakan sumpah. Dan Ayub telah bersumpah di dalam sakitnya, jika Allah memberikannya kesembuhan, maka ia akan memukul istrinya menggunakan ikatan tersebut sebanyak seratus kali pukulan, karena dosanya yang telah bertumpuk-tumpuk. Ayub merendahkan istrinya karena hajat, ketika Kami menguji Laki-laki yang bersabar atas suatu musibah, dialah sebaik-baik hamba, sesungguhnya Ayub telah banyak berserah diri pada Allah dengan bertaubat dan taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ambillah dengan tanganmu seikat} satu ikat dari ujung daun kurma {lalu pukullah dengan itu dan janganlah melanggar sumpah} dan janganlah mengabaikan sumpahmu {Sesungguhnya Kami mendapati dia seorang yang sabar. Dialah sebaik-baik hamba. Sesungguhnya dia selalu kembali} kembali taat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Dan ambillah dengan tanganmu seikat,” maksudnya, seikat rumput, “maka pukullah dengan itu dan janganlah kamu melanggar sumpah.” para ahli tafsir mengatakan, Ayyub dalam penderitaan dan sakitnya pernah marah terhadap istrinya karena beberapa persoalan, sehingga ia bersumpah kalau ia disembuhkan oleh Allah, niscaya ia akan mencambuk istrinya sebanyak 100 kali. Nah, setelah beliau disembuhkan oleh Allah, sedangkan istrinya sudah menjadi shalihah dan berbuat baik kepadanya –semoga Allah merahmati mereka berdoa-, lalu Allah memerintahkan kepadanya agar menderanya dengan seikat yang berisi seratus batang rumput satu kali deraan saja, sehingga dengan demikian ia berarti telah melaksanakan sumpahnya dengan baik. “SEsungguhnya kami dapati dia,” maksudnya, Ayyub “seorang yang sabar.” Yakni: Kami telah mengujinya dengan musibah besar, dan ia sabar karena mencari ridha Allah. “Dialah sebaik-baik hamba” yang telah menyempurnakan tingkatan-tingkatan ubidiyah pada saat kondisi senang dan susah, sulit dan lapang. “Sesungguhnya dia amat taat,” Maksudnya, orang yang selalu kembali kepada Allah dalam segala keperluan agama dan dunianya, banyak berdzikir, berdoa, mencintai dan mengabdikan diri kepada RabbNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 44: (Dan ambillah dengan tanganmu seikat rumput) yakni seikat rumput lalang atau seikat ranting-ranting (maka pukullah 292 dengan itu) istrimu, karena Nabi Ayub pernah bersumpah, bahwa ia sungguh akan memukul istrinya sebanyak seratus kali deraan, karena pada suatu hari ia pernah tidak menuruti perintahnya (dan janganlah kamu melanggar sumpah) dengan tidak memukulnya, lalu Nabi Ayub mengambil seratus tangkai kayu Idzkhir atau kayu lainnya, lalu ia memukulkannya sekali pukul kepada istrinya. (Sesungguhnya Kami dapati dia seorang yang sabar. Dialah sebaik-baik hamba) adalah Nabi Ayub. (Sesungguhnya dia amat taat) kepada Allah swt."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada suatu ketika Ayyub ingat terhadap sumpahnya, bahwa dia akan memukul isterinya seratus kali jika sakitnya sembuh disebabkan istrinya pernah lalai mengurusinya sewaktu dia masih sakit. Akan tetapi timbul dalam hatinya rasa kasihan dan sayang kepada isterinya yang salehah sehingga dia tidak dapat memenuhi sumpahnya. Oleh sebab itu turunlah perintah Allah seperti yang tercantum dalam ayat 44 di atas, agar dia memenuhi sumpahnya, namun dengan tidak menyakitkan istrinya, yaitu memukulnya dengan seikat rumput sekali pukul. Dengan begitu, Ayyub telah melaksanakan sumpahnya dan tidak melanggarnya. Ini merupakan jalan keluar bagi orang yang bertakwa kepada Allah Subhaanahu wa Ta'aala dan kembali kepada-Nya. Maksudnya, telah sempurna derajat kehambaannya baik ketika senang maupun susah, lapang maupun sempit. Ayat ini merupakan pujian Allah Subhaanahu wa Ta'aala kepada Nabi-Nya Ayyub alaihis salam atas kesabarannya. Yakni Beliau banyak kembali kepada Allah dalam mengatasi berbagai masalah baik yang terkait dengan agama maupun dunia, banyak berdzikr dan berdoa, mencintai-Nya dan beribadah kepada-Nya. Allahumma a’inna ‘alaa dzikrika wa syukrika wa husni ‘ibaadatika."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 44",
    "description": "Nabi ayyub pernah bersumpah akan memukul istrinya akibat kelalaiannya dalam merawat beliau. Allah mengizinkan beliau untuk melaksanakan sumpah itu tanpa mendatangkan rasa sakit berlebih kepada istrinya. Untuk itu Allah berfirman, 'dan ambillah seikat rumput dengan tanganmu, lalu pukullah istrimu sekali saja dengan itu dan janganlah engkau melanggar sumpah yang pernah kauucapkan. ' sesungguhnya kami dapati dia sebagi seorang yang sabar dan ikhlas dalam menghadapi cobaan. Dialah sebaik-baik hamba yang tidak pernah putus asa. Sungguh, dia sangat taat dalam melaksanakan perintah kami. Ujian dan cobaan bisa menimpa siapa saja. Jika hal itu dihadapi dengan sabar, tawakal, dan berusaha secara maksimal, niscaya Allah akan mengganti dengan imbalan lebih banyak, bahkan terkadang tidak terduga. 45. Demikianlah kisah nabi ayyub, salah satu nabi dari garis keturunan nabi ishak bin ibrahim. Seperti halnya nabi ayyub, ketabahan dan kesabaran juga ditunjukkan oleh leluhurnya. Dan ingatlah hamba-hamba kami yang taat melaksanakan perintah Allah, tabah menerima cobaan dan ujian, dan sabar menghadapi umatnya, yaitu nabi ibrahim, ishak, dan yakub. Mereka mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu agama. Dengan kekuatan mereka memimpin umat dan melaksanakan perintah-perintah Allah, dan dengan ilmu agama yang luas mereka membimbing orang lain."
  }
]