[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah pula wahai rasul, hamba-hamba Kami dan nagi-nabi Kami, yaitu Ibrahim, ishaq, dan ya’qub. sesungguhnya mereka adalah orang-orang yang kuat dalam menaati Allah, dan berilmu jelas dalam agama Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Ingatlah -wahai Rasul- hamba-hamba Kami yang telah Kami pilih dan para rasul Kami yang Kami utus; Ibrahim, Isḥāq dan Ya'qūb. Mereka adalah orang-orang yang kuat dalam menaati Allah dan mencari rida-Nya. Mereka adalah para pemilik ilmu yang jujur dalam kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Hai Rasulullah, ingatlah hamba-hamba dan para nabi Kami; Ibrahim, Ishaq, dan Ya’qub. Mereka adalah orang-orang yang sangat taat dan memiliki pemahaman agama yang kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Dan ingatlah hamba-hamba Kami, Ibrahim, Ishaq, Ya’qub, adalah golongan Nabi yang kuat dalam ketaatan kepada Allah, dan golongan yang dapat memiliki bashirah yang merupakan pengetahuan mengenai rahasia agama."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ingatlah hamba-hamba Kami: Ibrahim, Ishaq, dan Ya‘qub yang mempunyai kekuatan} yang mempunyai keteguhan untuk taat kepada Allah {dan penglihatan} memiliki penglihatan jernih dalam urusan agama dan pengetahuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah berfirman, “Dan ingatlah hamba-hamba Kami,” yang menuluskan ibadah kepada Kami, dengan ingatan yang baik, (yaitu) “Ibrahim” al-khalil, “dan” putranya “Ishaq” dan putranya, “Ya’qub yang mempunyai kekuatan,” makusdnya, kekuatan dalam beribadah kepada Allah, “dan ilmu-ilmu yang tinggi,” pemahaman yang benar tentang Agama Allah. Allah menyifati mereka dengan ilmu yang bermanfaat dan amal shalih yang banyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 45: (Dan ingatlah hamba-hamba Kami; Ibrahim, Ishak dan Yakub yang mempunyai kekuatan) dalam hal beribadah (dan pandangan) yang tajam dalam masalah agama. Menurut suatu qiraat lafal 'Ibaadanaa dibaca 'Abdanaa dalam bentuk Mufrad, sedangkan lafal Ibrahiim merupakan Athaf Bayan baginya, dan lafal-lafal yang sesudahnya diathafkan kepada lafal 'Abdanaa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang ikhlas dalam beribadah. Yakni kuat dalam menjalankan ibadah. Allah menyifati para nabi tersebut dengan memiliki ilmu yang bermanfaat dan amal saleh yang banyak (kuat beribadah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 45",
    "description": "Demikianlah kisah nabi ayyub, salah satu nabi dari garis keturunan nabi ishak bin ibrahim. Seperti halnya nabi ayyub, ketabahan dan kesabaran juga ditunjukkan oleh leluhurnya. Dan ingatlah hamba-hamba kami yang taat melaksanakan perintah Allah, tabah menerima cobaan dan ujian, dan sabar menghadapi umatnya, yaitu nabi ibrahim, ishak, dan yakub. Mereka mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu agama. Dengan kekuatan mereka memimpin umat dan melaksanakan perintah-perintah Allah, dan dengan ilmu agama yang luas mereka membimbing orang lain. 46-47. Sungguh, kami anugerahi mereka karunia yang besar itu karena kami telah menyucikan jiwa mereka dengan sifat-sifat terpuji dan akhlak yang tinggi kepadanya, yaitu selalu mengingatkan umatnya kepada negeri akhirat yang kekal dan penuh kenikmatan bagi hamba-hamba yang saleh. Dan sungguh, di sisi kami mereka termasuk orang-orang pilihan yang paling baik dan mulia di antara manusia lain, sehingga kami pilih me-reka sebagai nabi dan rasul."
  }
]