[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-47 Sesungguhnya Kami mengistimewakan mereka dengan keistimewaan besar, dimana Kami menjadikan alam akhirat terpatri dalam hati mereka, sehingga mereka beramal untuknya dengan menaati Kami, mengajak manusia kepadanya dan mengingatkan mereka tentangnya. Sesungguhnya mereka di sisi Kami termasuk orang-orang yang Kami pilih untuk menjadi pengemban risalah Kami, dan Kami memilih mereka untuk menaati Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Sesungguhnya Kami memberi mereka nikmat yang khusus bagi mereka, yaitu menghidupkan hati mereka dengan mengingat alam Akhirat dan mempersiapkan diri untuknya melalui amal saleh dan seruan kepada manusia untuk beramal demi alam Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-47. Kami istimewakan mereka dengan hal yang agung dan mulia; Kami jadikan kehidupan akhirat senantiasa mereka ingat dalam hati mereka, mereka sama sekali tidak lalai sehingga mereka senantiasa melakukan amal ketaatan untuk meraihnya, dan mengajak orang lain agar mengingat dan menyiapkan bekal akhirat. Mereka adalah orang-orang pilihan di sisi Kami, yang Kami pilih untuk mengemban risalah dan menjalankan ketaatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. إِنَّآ أَخْلَصْنٰهُم بِخَالِصَةٍ ذِكْرَى الدَّارِ (Sesungguhnya Kami telah mensucikan mereka dengan akhlak yang tinggi yaitu selalu mengingatkan (manusia) kepada negeri akhirat) Yakni Kami istimewakan dia dari orang lain pada zamannya untuk senantiasa mengingat hari akhir dan mengimaninya, dan ini merupakan sikap para nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. kami telah menyucikan mereka, dengan sikap (attitude) yang baik, yaitu Kami menghususkan mereka dengan keistimewaan dibanding yang lainnya: banyak mengingat akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah memberikan secara khusus kepada mereka} Kami telah mengkhususkan dan memilih mereka dengan sangat khusus {(yaitu) mengingat negeri akhirat} mengingat dan beramal untuk akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Sesungguhnya Kami telah menyucikan mereka dengan akhlak yang tinggi,” yang agung dan keunggulan yang besar, yaitu, “selalu mengingatkan kepada negeri akhirat.” Kami telah menjadikan ingat selalu kepada negeri akhirat terus ada dalam hati mereka dan beramal untuknya dalam kebanyakan waktu. Ikhlas dan selalu merasa diawasi Allah menjadi ciri mereka yang abadi. Dan Kami jadikan mereka sebagai peringatan akan negeri akhirat, kondisi dan perihal mereka dapat diambil pelajarannya oleh orang yang mau mengambil pelajaran, dan mereka dapat dijadikan sebagai ibrah (suri teladan) oleh orang-orang yang mau meneladani."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 46: (Sesungguhnya Kami telah menyucikan mereka dengan menganugerahkan kepada mereka akhlak yang tinggi) yaitu (selalu mengingatkan manusia kepada negeri akhirat) atau alam akhirat; maksudnya mengingatkan manusia kepada hari akhirat dan menganjurkan mereka untuk beramal baik sebagai bekal untuk menghadapinya. Menurut suatu qiraat dibaca Bikhaalishati Dzikrad Daar yaitu dengan dimudhafkan untuk menunjukkan makna Bayan, atau keterangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Demikian pula mengajak manusia beramal untuknya. Menurut Syaikh As Sa’diy rahimahullah bahwa maksudnya, “Kami jadikan mengingat akhirat berada dalam hati mereka, beramal untuknya adalah waktu pilihan mereka, ikhlas dan merasa diawasi Allah menjadi sifat mereka selalu, dan Kami jadikan mereka sebagai pengingat akhirat, di mana orang yang mengingat mengambil pelajaran dari keadaan mereka, orang yang mengambil pelajaran menjadikan mereka sebagai pelajaran dan mengingatnya dengan sebaik-baiknya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 46",
    "description": "46-47. Sungguh, kami anugerahi mereka karunia yang besar itu karena kami telah menyucikan jiwa mereka dengan sifat-sifat terpuji dan akhlak yang tinggi kepadanya, yaitu selalu mengingatkan umatnya kepada negeri akhirat yang kekal dan penuh kenikmatan bagi hamba-hamba yang saleh. Dan sungguh, di sisi kami mereka termasuk orang-orang pilihan yang paling baik dan mulia di antara manusia lain, sehingga kami pilih me-reka sebagai nabi dan rasul"
  }
]