[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-47 Sesungguhnya Kami mengistimewakan mereka dengan keistimewaan besar, dimana Kami menjadikan alam akhirat terpatri dalam hati mereka, sehingga mereka beramal untuknya dengan menaati Kami, mengajak manusia kepadanya dan mengingatkan mereka tentangnya. Sesungguhnya mereka di sisi Kami termasuk orang-orang yang Kami pilih untuk menjadi pengemban risalah Kami, dan Kami memilih mereka untuk menaati Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Sesungguhnya mereka di sisi Kami termasuk hamba-hamba yang Kami pilih untuk menaati Kami dan beribadah kepada Kami. Kami memilih mereka untuk mengemban risalah Kami dan menyampaikannya kepada manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَإِنَّهُمْ عِندَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ (Dan sesungguhnya mereka pada sisi Kami benar-benar termasuk orang-orang pilihan yang paling baik) Yakni mereka adalah orang-orang pilihan dari keturunan orang-orang yang terbaik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dan sungguh, di sisi Kami mereka merupakan orang-orang pilihan dari golongan para nabi yang bernasab mulia untuk para keturunan mereka, yang banyak melakukan kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka di sisi Kami benar-benar termasuk orang-orang terpilih} orang-orang terpilih untuk menyampaikan risalah Kami dan taat kepada Kami {yang terbaik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “Dan sesungguhnya mereka pada sisi Kami benar-benar termasuk orang-orang pilihan,” yaitu orang-orang yang dipilih oleh Allah dia ntara manusia-manusia pilihanNya, “yang baik,” yaitu yang memiliki segala sifat mulia dan amal yang istiqamah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 47: (Dan sesungguhnya mereka pada sisi Kami benar-benar termasuk orang-orang pilihan) yakni orang-orang yang terpilih (yang paling baik) lafal Al-Akhyaar ini adalah bentuk jamak dari lafal Khayyirun, artinya paling baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena mereka memiliki akhlak yang mulia dan amal yang istiqamah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 47",
    "description": "46-47. Sungguh, kami anugerahi mereka karunia yang besar itu karena kami telah menyucikan jiwa mereka dengan sifat-sifat terpuji dan akhlak yang tinggi kepadanya, yaitu selalu mengingatkan umatnya kepada negeri akhirat yang kekal dan penuh kenikmatan bagi hamba-hamba yang saleh. Dan sungguh, di sisi kami mereka termasuk orang-orang pilihan yang paling baik dan mulia di antara manusia lain, sehingga kami pilih me-reka sebagai nabi dan rasul. 48. Dan ingatlah, wahai nabi Muhammad, kisah moyang bangsa arab, yaitu nabi ismail bin ibrahim; nabi ilyasa' bin akhtub dan nabi zulkifli putra paman nabi ilyasa''nabi-nabi dari bani israil. Semuanya termasuk orang-orang yang paling baik yang dipilih Allah untuk membimbing kaumnya menuju ketaatan kepada Allah dan menjauhi kemusyrikan."
  }
]