[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah pula (wahai rasul) hamba-hamba Kami ismail, al-yasa , dan dzulkifli dengan sebutan yang baik. Sesungguhnya mereka semuanya terrmasuk orang-orang pilihan yang Allah pilih dari makhluk-mahklukNya, dan Allah memilih keadaan dan sifat yang paling sempurna untuk mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Ingatlah -wahai Nabi- Ismail bin Ibrahim, Al-Yasa' dan Żulkifli. Sanjunglah mereka dengan sanjungan terbaik, karena mereka memang laik mendapatkannya. Mereka semuanya termasuk orang-orang terpilih di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Hai Rasulullah, ingatlah hamba-hamba Kami; Ismail, Ilyasa, dan Dzulkifli. Mereka adalah para nabi dan orang-orang yang Allah pilih untuk mengemban kenabian, dan Allah mengistimewakan mereka dengan sifat-sifat yang utama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَالْيَسَعَ وَذَا الْكِفْلِ ۖ (Ilyasa’ dan Zulkifli) Pembahasan tentang Ilyasa telah disebutkan pada surat al-An’am: 86, sedangkan pembahasan tentang Zulkifli telah disebutkan pada surat al-Anbiya’: 85."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Dan ingatlah wahai, Isma’il bin Ibrahim yang menjadi moyang Arab, Ilyasa’ bin Akhthub, Dzulkifl bin Am’ Ilyasa’, mereka adalah para Nabi dari golongan Bani Israil, mereka adalah pilihan, Allah memilih mereka karena mereka banyak menanggung beban dalam berdakwah di jalan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ingatlah Ismail, Ilyasa, dan Dzulkifli. Semuanya termasuk orang-orang yang paling baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Maksudnya, ingatlah para nabi itu dengan sebaik-baik mengingat, dan pujilah mereka dengan sebaik-baik pujian, karena masing-masing mereka termasuk manusia-manusia pilihan, yang dalam al-Quran yang penuh dengan pelajaran ini, di mana kondisi dan perihal mereka dijadikan pelajaran oleh orang-orang yang mau mengambil pelajaran, dan meneladani sifat-sifat terpuji mereka dirindukan oleh orang-orang yang mau meneladaninya; dan dapat diketahui apa-apa yang Allah anugerahkan kepada mereka, seperti sifat-sifat yang mulia dan apa-apa yang tersebar luas di kalangan manusia, yaitu pujian. Ini semua adalah salah satu bentuk mengingat, yaitu mengingat ahlul khair (Para pelaku kebaikan)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 48: (Dan ingatlah akan Ismail, Ilyasa') Ilyasa' adalah Yasu', dia seorang nabi; Huruf Alif dan lamnya adalah Zaidah atau tambahan (dan Zulkifli) yang masih diperselisihkan kenabiannya. Menurut suatu pendapat dikatakan, bahwa ia pernah menjamin seratus orang nabi yang berlindung kepadanya untuk menghindari pembunuhan. (Semuanya) artinya, masing-masing dari kesemuanya (termasuk orang-orang yang paling baik) lafal Al-Akhyaar adalah bentuk jamak dari lafal Khayyirun, artinya orang yang paling baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ingatlah para nabi ini dengan sebaik-baiknya dan pujilah mereka dengan pujian yang baik. Karena mereka adalah orang-orang yang dipilih Allah, dan Allah telah memilihkan untuk mereka keadaan yang paling baik, yaitu amal yang saleh, akhlak yang mulia, sifat yang terpuji dan perilaku yang lurus. Dzulkifli jika melihat zhahir ayat di atas, yakni digandengkan dengan para nabi, menunjukkan bahwa ia adalah seorang nabi. Namun yang lain berpendapat, bahwa Beliau adalah seorang yang salih, raja dan hakim yang adil, namun Ibnu Jarir diam dalam masalah ini, wallahu a’lam. Ibnu Jarir dan Abu Najih meriwayatkan dari Mujahid bahwa ia (Dzulkifli) bukan seorang nabi, tetapi seorang yang saleh (lihat pula surah Al Anbiya’: 85)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 48",
    "description": "Dan ingatlah, wahai nabi Muhammad, kisah moyang bangsa arab, yaitu nabi ismail bin ibrahim; nabi ilyasa' bin akhtub dan nabi zulkifli putra paman nabi ilyasa''nabi-nabi dari bani israil. Semuanya termasuk orang-orang yang paling baik yang dipilih Allah untuk membimbing kaumnya menuju ketaatan kepada Allah dan menjauhi kemusyrikan. 49-52. Setelah menjelaskan kisah para nabi penyampai risalah, Allah beralih menguraikan imbalan bagi orang-orang yang mengikuti risalah mereka. Al-qur'an ini adalah kehormatan bagi mereka yang berharap petunjuk-Nya. Dan sungguh, Allah meyediakan bagi orang-orang yang bertakwa kepada-Nya tempat kembali yang terbaik di akhirat. Itulah surga 'adn, tempat tinggal yang kekal yang pintu-pintunya terbuka lebar bagi mereka, menyambut kedatangan mereka. Di dalamnya mereka bersandar di atas dipan-dipan sambil meminta suguhan berupa buah-buahan yang banyak dan minuman dengan berbagai jenis dan rasa. Dan di sam-ping mereka ada bidadari-bidadari cantik dan sopan yang redup pandang-annya, setia pada pasangannya, dan mereka semua sebaya umurnya."
  }
]