[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-51 Al-qur’an ini adalah dzkir dan kemuliaan bagimu (wahai rasul), dan bagi kaummu. dan sesungguhnya orang-orang yang bertakwa kepada Allah dan menaatiNya akan mendapatkan tempat kembali yang baik di sisi Kami, di surga-surga sebagai tempat tinggal mereka, pintu-pintunya terbuka untuk mereka, mereka bersandar di atas peraduan-peradauan yang berhias indah, dimana mereka mendapatkan apa yang mereka inginkan berupa buah-buahan yang bermacam-macam dan minuman, dari semua yang diinginkan oleh jiwa mereka dan dinikmati oleh mata mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Ini adalah sanjungan yang baik untuk mereka di dalam Al-Qur`ān. Sesungguhnya orang-orang yang bertakwa dengan melaksanakan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya mendapatkan tempat kembali yang baik di alam Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-51. Hai Rasulullah, al-Qur’an merupakan peringatan dan kemuliaan bagimu dan bagi kaummu. Dan orang-orang yang bertakwa akan memperoleh tempat kembali yang baik; mereka akan tinggal di surga-surga yang telah disiapkan, mereka akan disambut dengan pintu-pintu yang terbuka, disiapkan bagi mereka tempat-tempat duduk berupa dipan-dipan indah untuk mereka bersandar, mereka dapat meminta segala jenis buah-buahan dan minuman yang mereka sukai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Ini adalah kehormatan bagi mereka di dunia, sanjungan untuk mereka, dan bagi orang-orang yang bertaqwa yang takut akan adzab Allah untuk kembali di akhirat, mereka kembali kembali kepada Allah dengan penuh ampunan dan ridhaNya di surgaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ini adalah kehormatan. Sesungguhnya bagi orang-orang yang bertakwa benar-benar terdapat tempat kembali yang baik} tempat kembali di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Artinya, “Dan sesungguhnya bagi orang-orang yang bertakwa” kepada Rabbnya dengan cara mematuhi perintah-perintahNya dan menjauhi larangan-laranganNya dari setiap orang laki-laki dan perempuan yang beriman “benar-benar di sediakan sebaik-baik tempat kembali,” yakni tempat kembali yang sangat baik dan tempat pulang yang terindah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 49: (Ini adalah kehormatan) bagi mereka, yaitu mendapat pujian yang baik di sini. (Dan sesungguhnya bagi orang-orang yang bertakwa) antara lain adalah termasuk mereka (benar-benar disediakan tempat kembali yang baik) nanti di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan, bahwa ini adalah pengingat, yakni agar orang-orang yang sadar mengingat keadaan mereka dan rindu untuk mengikuti mereka karena sifat-sifatnya yang terpuji, demikian pula agar mereka mengetahui nikmat Allah kepada mereka berupa sifat-sifat yang bersih untuk mereka, dan diumumkan pujian dari-Nya untuk mereka di tengah-tengah manusia. Ini termasuk hal yang sangat penting, yakni mengingat orang-orang yang baik, yang mulia dan utama agar dapat mencontoh mereka. Termasuk hal yang perlu diingat pula adalah balasan yang akan diberikan kepada orang-orang yang berbuat baik dan orang-orang yang berbuat buruk sebagaimana diterangkan dalam ayat selanjutnya. Yang mengerjakan perintah Allah dan menjauhi larangan-Nya baik mukmin laki-laki maupun mukmin perempuan. Pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala menerangkan tempat kembali yang paling baik itu dan merincikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 49",
    "description": "49-52. Setelah menjelaskan kisah para nabi penyampai risalah, Allah beralih menguraikan imbalan bagi orang-orang yang mengikuti risalah mereka. Al-qur'an ini adalah kehormatan bagi mereka yang berharap petunjuk-Nya. Dan sungguh, Allah meyediakan bagi orang-orang yang bertakwa kepada-Nya tempat kembali yang terbaik di akhirat. Itulah surga 'adn, tempat tinggal yang kekal yang pintu-pintunya terbuka lebar bagi mereka, menyambut kedatangan mereka. Di dalamnya mereka bersandar di atas dipan-dipan sambil meminta suguhan berupa buah-buahan yang banyak dan minuman dengan berbagai jenis dan rasa. Dan di sam-ping mereka ada bidadari-bidadari cantik dan sopan yang redup pandang-annya, setia pada pasangannya, dan mereka semua sebaya umurnya"
  }
]