[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5 orang-orang kafir itu merasa aneh terhadap pengutusan Allah terhadap seorang manusia seperti mereka untuk mengajak mereka menyembah Allah semata dan menakuti mereka terhadap azabNya, dan mereka berkata ”Dia bukan seorang rasul, akan tetapi seorang pembohong dalam perkataannya, penyihir terhadap kaumnya; bagaimana dia menjadikan tuhan-tuhan yang banyak jadi satu? sungguh apa yang dia bawa dan apa yang dia serukan, adalah sesuatu yang aneh”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Apakah laki-laki ini menjadikan tuhan-tuhan yang banyak hanya menjadi satu Tuhan saja yang tidak ada tuhan selain-Nya? Perbuatannya itu sungguh mengherankan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. أَجَعَلَ الْاٰلِهَةَ إِلٰهًا وٰحِدًا ۖ (Mengapa ia menjadikan tuhan-tuhan itu Tuhan Yang Satu saja?) Apakah dia menjadikan tuhan hanya satu, dengan menjadikan sifat ketuhanan hanya milik Allah? إِنَّ هٰذَا لَشَىْءٌ عُجَابٌ(Sesungguhnya ini benar-benar suatu hal yang sangat mengherankan) Mereka merasa heran karena dahulu setiap kabilah memiliki tuhan sendiri. Dan mereka berkata bahwa kami menyembahnya agar dapat mendekatkan kami kepada Allah sedekat-dekatnya, sedangkan Allah adalah pemilik tuhan-tuhan itu, maka apa yang salah dari hal ini? Mereka menganggap aneh orang yang menolak tuhan-tuhan yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Bagaimana bisa tuhan-tuhan yang banyak itu dia jadikan hanya Tuhan Satu saja, bukankah ini suatu yang mengherankan? Padahal setiap suku mempunyai satu tuhan. Ayat ini turun ketika suku Qurays terheran atas ajaran Muhammad. Mereka berkata: “Tuhan Yang Maha Satu? Ini benar-benar mengherankan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja. Sesungguhnya ini benar-benar sesuatu yang sangat mengherankan”} perkara yang sangat mengherankan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Dosanya menurut mereka adalah karena dia “menjadikan sesembahan-sesembahan itu sesembahan Yang Satu saja.” Maksudnya, bagaimana dia melarang mengambil sekutu-sekutu dan tuhan-tuhan tandingan dan memerintahkan supaya menuluskan ibadah hanya kepada Allah saja?! “Sesungguhnya ini,” yang dibawanya ini “benar-benar suatu hal yang sangat mengherankan,” maksudnya, menimbulkan keheranan karena kepalsuan dan kerusakan (ketidakbenaran)nya, menurut mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 5: (Mengapa ia menjadikan tuhan-tuhan itu Tuhan yang satu saja?\") demikian itu karena Nabi saw. pernah bersabda kepada mereka, \"Katakanlah, 'Laa Ilaaha Illallaah', artinya tiada Tuhan selain Allah. Mereka menjawab, 'Mana mungkin makhluk yang sedemikian banyak itu, semuanya dapat ditangani oleh Tuhan Yang Satu itu.' (Sesungguhnya itu benar-benar suatu hal yang sangat mengherankan\") sangat aneh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kesalahan Beliau menurut mereka adalah karena Beliau menjadikan tuhan-tuhan itu Tuhan yang satu saja, yakni menurut mereka, mengapa ia (Nabi Muhammad shallallahu 'alaihi wa sallam) melarang mengadakan sekutu dan tandingan dan memerintahkan hanya beribadah kepada Allah Subhaanahu wa Ta'aala. Yakni –menurut mereka-, cukupkah satu tuhan untuk semua makhluk? Mereka tidak menyadari bahwa Dia satu-satunya Rabbul ‘alamin; yang sendiri menciptakan, menguasai, memberi rezeki dan mengatur alam semesta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 5",
    "description": "Ketika nabi mengajak mereka menyembah dan mengesakan Allah, mereka menjawab dengan penuh keingkaran, 'apakah dia menjadikan tuhan-tuhan itu tuhan yang satu saja' sungguh, ini benar-benar sesuatu yang sangat mengherankan. Kami, kabilah-kabilah arab, mempunyai tuhan masing-masing. '6. Mendengar ajakan nabi untuk beratuhid, lalu pergilah pemimpin-pemimpin mereka menghampiri kaum masing-masing seraya berkata, 'pergilah kamu dan tetaplah menyembah tuhan-tuhanmu sendiri. Sesungguhnya ajakan bertauhid ini benar-benar hanyalah suatu hal yang dikehendaki oleh Muhammad terhadap kita agar dia bisa menjadi pemimpin."
  }
]