[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-51 Al-qur’an ini adalah dzkir dan kemuliaan bagimu (wahai rasul), dan bagi kaummu. dan sesungguhnya orang-orang yang bertakwa kepada Allah dan menaatiNya akan mendapatkan tempat kembali yang baik di sisi Kami, di surga-surga sebagai tempat tinggal mereka, pintu-pintunya terbuka untuk mereka, mereka bersandar di atas peraduan-peradauan yang berhias indah, dimana mereka mendapatkan apa yang mereka inginkan berupa buah-buahan yang bermacam-macam dan minuman, dari semua yang diinginkan oleh jiwa mereka dan dinikmati oleh mata mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Tempat kembali yang baik itu adalah Surga kenikmatan yang mereka masuki pada hari Kiamat, pintu-pintunya telah terbuka untuk menyambut mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. مُّفَتَّحَةً لَّهُمُ الْأَبْوٰبُ (yang pintu-pintunya terbuka bagi mereka) Yakni para malaikat membukakan pintu-pintu surga bagi mereka agar mereka dapat memasukinya dengan penuh penghormatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. sesungguhnya tempat kemballi yang baik yaitu surga-surga yang telah ditetapkan oleh Allah, dan mereka kekal didalamnya, malaikat membukakan pintu-pintu surga agar mereka memasukinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Yaitu) surga ‘Adn} yang ditempati {yang pintu-pintunya terbuka bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. KEmudian Allah menjelaskan dan merincikannya, seraya berfirman, “Yaitu Surga ‘And,” yakni surge-surga tempat tinggal yang penghuninya sama sekali tidak mau diganti dengan apa pun karena kesempurnaannya dan kelengkapan nikmat-nikmatnya, dan mereka tidak akan pernah keluar darinya dan tidak pula dikeluarkan. “Yang pintu-pintunya terbuka bagi mereka.” Maksudnya, dibuka untuk mereka pintu-pintu setiap tingkatannya dan tempat-tempat tinggalnya, mereka sudah tidak perlu membukanya sendiri, melainkan mereka selalu dilayani. Ini juga adalah bukti atas keamanan mereka yang paripurna, dan bahwa di Surga ‘Adn itu tidak ada sesuatu pun yang mengharuskan pintu-pintunya ditutup."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 50: (Yaitu surga Adn) menjadi Badal atau 'Athaf Bayan bagi lafal Lahusna Ma-aab (yang pintu-pintunya terbuka bagi mereka) artinya, pintu-pintu surga itu terbuka lebar-lebar buat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu surga tempat menetap, di mana penghuninya tidak menginginkan lagi gantinya karena sudah sempurna kenikmatannya, dan lagi mereka tidak akan keluar dan tidak akan dikeluarkan darinya. Yakni mereka tidak perlu membukanya, bahkan mereka akan dilayani. Ini menunjukkan bahwa mereka memperoleh keamanan yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 50",
    "description": "49-52. Setelah menjelaskan kisah para nabi penyampai risalah, Allah beralih menguraikan imbalan bagi orang-orang yang mengikuti risalah mereka. Al-qur'an ini adalah kehormatan bagi mereka yang berharap petunjuk-Nya. Dan sungguh, Allah meyediakan bagi orang-orang yang bertakwa kepada-Nya tempat kembali yang terbaik di akhirat. Itulah surga 'adn, tempat tinggal yang kekal yang pintu-pintunya terbuka lebar bagi mereka, menyambut kedatangan mereka. Di dalamnya mereka bersandar di atas dipan-dipan sambil meminta suguhan berupa buah-buahan yang banyak dan minuman dengan berbagai jenis dan rasa. Dan di sam-ping mereka ada bidadari-bidadari cantik dan sopan yang redup pandang-annya, setia pada pasangannya, dan mereka semua sebaya umurnya"
  }
]