[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-51 Al-qur’an ini adalah dzkir dan kemuliaan bagimu (wahai rasul), dan bagi kaummu. dan sesungguhnya orang-orang yang bertakwa kepada Allah dan menaatiNya akan mendapatkan tempat kembali yang baik di sisi Kami, di surga-surga sebagai tempat tinggal mereka, pintu-pintunya terbuka untuk mereka, mereka bersandar di atas peraduan-peradauan yang berhias indah, dimana mereka mendapatkan apa yang mereka inginkan berupa buah-buahan yang bermacam-macam dan minuman, dari semua yang diinginkan oleh jiwa mereka dan dinikmati oleh mata mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Mereka duduk bersandar di atas ranjang-ranjang yang indah. Mereka meminta para pelayan untuk datang membawa apa yang mereka inginkan berupa buah-buahan yang banyak dan beraneka macam, dan minuman yang mereka inginkan berupa khamar dan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. يَدْعُونَ فِيهَا (sambil meminta di surga itu) Yakni mereka meminta sambil bersandar pada dipan-dipan yang ada di dalam surga بِفٰكِهَةٍ كَثِيرَةٍ(buah-buahan yang banyak) Dengan berbagai jenis buah-buahan. وَشَرَابٍ(dan minuman) Dan jenis minuman yang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Di dalamnya mereka bersandar (di atas papan-papan), sambil meminta buah-buahan yang bermacam-macam dan minum-minuman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersandar di dalamnya sambil meminta} meminta {buah-buahan dan minuman yang banyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Di dalamnya mereka bersandar” pada dipan-dipan yang berhias dan tempat-tempat duduk yang berukiran indah, “sambil meminta,” maksudnya, mereka menyuruh para pembantu untuk menghidangkan “buah-buahan yang banyak dan minuman di surge itu,” dari segala yang diinginkan oleh nafsu mereka dan yang lezat diapndang mata mereka. Ini menunjukkan pada kesempurnaan nikmat, kesempurnaan kesenangan dan ketenangan, serta kesempurnaan kelezatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 51: (Di dalamnya mereka bertelekan) di atas dipan-dipan (sambil meminta buah-buahan yang banyak dan minuman di surga itu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu di atas dipan-dipan yang diberi hiasan dan di atas tempat-tempat yang indah. Mereka menyuruh para pelayan untuk membawakan buah-buahan dan minuman yang mereka inginkan. Hal ini menunjukkan bahwa mereka memperoleh kenikmatan, istirahat, ketenteraman serta kelezatan secara sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 51",
    "description": "49-52. Setelah menjelaskan kisah para nabi penyampai risalah, Allah beralih menguraikan imbalan bagi orang-orang yang mengikuti risalah mereka. Al-qur'an ini adalah kehormatan bagi mereka yang berharap petunjuk-Nya. Dan sungguh, Allah meyediakan bagi orang-orang yang bertakwa kepada-Nya tempat kembali yang terbaik di akhirat. Itulah surga 'adn, tempat tinggal yang kekal yang pintu-pintunya terbuka lebar bagi mereka, menyambut kedatangan mereka. Di dalamnya mereka bersandar di atas dipan-dipan sambil meminta suguhan berupa buah-buahan yang banyak dan minuman dengan berbagai jenis dan rasa. Dan di sam-ping mereka ada bidadari-bidadari cantik dan sopan yang redup pandang-annya, setia pada pasangannya, dan mereka semua sebaya umurnya"
  }
]