[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Disisi mereka ada para bidadari yang pandangan mata mereka terbatas hanya kepada pasangan-pasangan mereka saja. umur-umur mereka sepantaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Di sisi mereka ada istri-istri yang pandangan mata mereka hanya terfokus pada suami-suami mereka, tidak menoleh kepada selain mereka, usia mereka sepadan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Di sisi mereka terdapat bidadari-bidadari yang memiliki usia yang sama, yang tidak memandang dan tidak mencintai melainkan kepada suami-suami mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَعِندَهُمْ قٰصِرٰتُ الطَّرْفِ أَتْرَابٌ (Dan pada sisi mereka (ada bidadari-bidadari) yang menjaga pandangannya dan sebaya umurnya) Yakni istri-istri mereka hanya memandang kepada suaminya. Makna (الأتراب) yakni sebaya umurnya atau setara dalam kecantikannya. Mujahid berpendapat maknanya adalah istri-istri yang taat dan tidak cepat marah dan cemburu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Dan di samping mereka (ada bidadari-bidadari) yang tidak mengalihkan pandangan dari suami-suaminya, yang cantik dan sebaya usianya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di samping mereka (bidadari-bidadari) yang pandangannya terbatas} perempuan-perempuan yang membatasi pandangan mereka untuk pasangan-pasangan mereka {lagi sebaya} sama umurnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “Dan pada sisi mereka” ada istri-istri mereka dari bidadari-bidadari “yang tidak liar,” pandangannya hanya tertuju kepada suami-suaminya saja, dan pandangan mata suami-suaminya pun tertuju pada mereka karena kecantikan mereka semua dan karena kecintaan masing-masing kepada pasangannya dan tidak ada hasrat kepadanya yang lain, dan sang suami tidak menghendaki wanita lain sebagai ganti dari istrinya “dan sebaya umurnya,” maksudnya, usianya sama, yaitu usia remaja matang, usia terindah dan paling nikmat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 52: (Dan pada sisi mereka ada bidadari-bidadari yang tidak liar pandangannya) yakni mereka hanya memandang kepada suaminya dan menundukkan pandangan mata dari yang lainnya (dan sebaya umurnya) umur mereka sebaya, yaitu sekitar tiga puluh tiga tahunan. Lafal Atraabun adalah bentuk jamak dari lafal Turbun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, pandangan mereka hanya terbatas kepada suaminya karena sudah menarik bagi mereka suami mereka, dan masing-masing mereka saling mencintai. Yaitu di usia muda yang sedang senang-senangnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 52",
    "description": "49-52. Setelah menjelaskan kisah para nabi penyampai risalah, Allah beralih menguraikan imbalan bagi orang-orang yang mengikuti risalah mereka. Al-qur'an ini adalah kehormatan bagi mereka yang berharap petunjuk-Nya. Dan sungguh, Allah meyediakan bagi orang-orang yang bertakwa kepada-Nya tempat kembali yang terbaik di akhirat. Itulah surga 'adn, tempat tinggal yang kekal yang pintu-pintunya terbuka lebar bagi mereka, menyambut kedatangan mereka. Di dalamnya mereka bersandar di atas dipan-dipan sambil meminta suguhan berupa buah-buahan yang banyak dan minuman dengan berbagai jenis dan rasa. Dan di sam-ping mereka ada bidadari-bidadari cantik dan sopan yang redup pandang-annya, setia pada pasangannya, dan mereka semua sebaya umurnya. 53-54. Inilah apa yang dijanjikan Allah kepadamu pada hari perhitungan, hari ketika manusia dibangkitkan dari kubur lalu diarak ke padang mahsyar dan diadili di hadapan Allah. Sungguh, karunia besar dan mulia inilah rezeki dari kami yang tidak ada habis-habisnya dan tidak pula berkurang. Kami berikan karunia itu kepada hamba-hamba yang taat dan berbakti."
  }
]