[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "53-54 Kenikmatan itulah yang dijanjikan kepada kalian (wahai orang-orang yang bertakwa) di hari kiamat, sesungguhnya ia adalah rizki Kami untuk kalian, tiada henti dan tiada terputus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Inilah yang dijanjikan kepada kalian -wahai orang-orang yang bertakwa- berupa balasan yang baik pada hari Kiamat atas amal saleh yang kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53-54. Hai orang-orang beriman yang bertakwa, inilah kenikmatan yang beraneka ragam yang disiapkan untuk kalian pada hari kiamat; ini semua adalah rezeki dari Kami bagi kalian, rezeki yang tidak akan habis dan terhenti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. هٰذَا ۚ (Beginilah) Yakni hal ini adalah sebagaimana disebutkan. وَإِنَّ لِلطّٰغِينَ لَشَرَّ مَـَٔابٍ (Dan sesungguhnya bagi orang-orang yang durhaka benar-benar (disediakan) tempat kembali yang buruk) Yakni orang-orang yang durhaka dan enggan taat kepada Allah serta mendustakan para rasul, bagi mereka adalah seburuk-buruk tempat kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. dikatakan pada mereka: ini adalah balasan yang dijanjikan pada kalian pada hari pembalasan, di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Inilah apa yang dijanjikan kepadamu pada hari perhitungan} pada hari penghisaban"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “Inilah apa yang dijanjikan kepadamu” wahai orang-orang yang bertakwa, “pada hari berhisab” sebagai balasan atas amal-amal shalih kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 53: (Inilah) hal-hal yang telah disebutkan itu (apa yang dijanjikan kepada kalian) dapat dibaca Yuu'aduuna atau Tuu'aduuna, kalau dibaca Tuu'aduna berarti Iltifat (pada hari berhisab) pada saat hari berhisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni wahai orang-orang yang bertakwa sebagai balasan terhadap amalmu yang saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 53",
    "description": "53-54. Inilah apa yang dijanjikan Allah kepadamu pada hari perhitungan, hari ketika manusia dibangkitkan dari kubur lalu diarak ke padang mahsyar dan diadili di hadapan Allah. Sungguh, karunia besar dan mulia inilah rezeki dari kami yang tidak ada habis-habisnya dan tidak pula berkurang. Kami berikan karunia itu kepada hamba-hamba yang taat dan berbakti"
  }
]