[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "53-54 Kenikmatan itulah yang dijanjikan kepada kalian (wahai orang-orang yang bertakwa) di hari kiamat, sesungguhnya ia adalah rizki Kami untuk kalian, tiada henti dan tiada terputus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Sesungguhnya balasan yang Kami jelaskan ini adalah rezeki dari Kami pada hari Kiamat, yang Kami limpahkan kepada orang-orang yang bertakwa. Ia adalah rezeki yang terus menerus, tidak berakhir dan tidak habis."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. sesungguhnya ini adalah nikmat dari Kami yang Kami berikan pada kalian, rizki yang tidak habi dan tidak fana’ (rusak), kekal selamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya ini adalah benar-benar rezeki Kami yang tidak habis-habisnya} lenyap dan terputus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Sesungguhnya ini adalah benar-benar rizki dari Kami” yang Kami anugerahkan kepada para penghuni negeri kenikmatan, “yang tiada habis-habisnya,” yakni, tidak pernah putus, melainkan ia selalu ada dan tersedia sepanjang waktu, dan selalu bertambah setiap saat. Dan hal seperti ini sama sekali tidak sulit bagi Rabb yang Mahamulia, Maha Pengasih lagi Mahakaya, Maha Terpuji lagi Mahalembut, Maha Pengasih Maharaja yang Merajai, Mahatinggi lagi Mahaindah lagi MahapEmberi, Pemilik karunia yang luar biasa, kemurahan yang berlimpah ruah, yang nikmat-nikmatNya tidak terhitung dan tidak bisa diketahui sebagian kebaikanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 54: (Sesungguhnya ini adalah benar-benar rezeki dari Kami yang tiada habis-habisnya) yang tak putus-putusnya; jumlah ayat ini menjadi Haal dari lafal Larizqunaa, atau sebagai Khabar kedua dari Inna, artinya selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang Kami berikan kepada penghuni surga. yakni tetap terus di setiap waktu, bahkan terus bertambah. Dan hal ini tidaklah berat bagi Allah Subhaanahu wa Ta'aala Yang Maha Mulia, Yang Maha Pengasih lagi Maha Penyayang, Yang Mahaluas pemberian-Nya lagi Maha Pemurah yang mempunyai karunia yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 54",
    "description": "53-54. Inilah apa yang dijanjikan Allah kepadamu pada hari perhitungan, hari ketika manusia dibangkitkan dari kubur lalu diarak ke padang mahsyar dan diadili di hadapan Allah. Sungguh, karunia besar dan mulia inilah rezeki dari kami yang tidak ada habis-habisnya dan tidak pula berkurang. Kami berikan karunia itu kepada hamba-hamba yang taat dan berbakti. 55-56. Bila Allah menyediakan surga beserta segala kenikmatan di dalamnya bagi orang yang taat, maka Allah menyediakan jahanam bagi orang yang durhaka terhadap risalah Allah. Beginilah karunia Allah kepada orang-orang yang bertakwa. Dan sungguh, bagi orang-orang yang durhaka terhadap perintah Allah dan rasul-Nya di dunia pasti di akhirat nanti disediakan tempat kembali yang buruk. Itulah neraka jahanam, tempat tinggal yang kelak akan mereka masuki; maka jahanam itulah seburuk-buruk tempat tinggal."
  }
]