[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55-56 Apa yang dijelaskan ini adalah untuk orang-orang yang bertakwa. Adapun orang-orang yang melampaui batas dalam kekafiran dan kemaksiatan, maka mereka akan mendapatkan tempat kembali terburuk dan terjelek, yaitu neraka di mana mereka disiksa di dalamnya, ia mengelilingi mereka dari segala penjuru, maka seburuk-bruk tempat tidur adalah tempat tidur mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Apa yang Kami sebutkan ini adalah balasan bagi orang-orang yang bertakwa. Sedangkan bagi orang-orang yang melampaui batasan-batasan Allah dengan kekufuran dan kemaksiatan balasan yang berbeda dari balasan bagi orang-orang yang bertakwa. Bagi mereka tempat kembali yang buruk pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55-56. Hal-hal yang telah disebutkan ini diperuntukkan bagi orang-orang bertakwa. Adapun orang-orang yang kafir dan zalim, maka mereka akan mendapatkan tempat kembali yang buruk. Disiapkan bagi mereka neraka sebagai tempat siksaan mereka; azab akan mengepung mereka dari segala penjuru seakan-akan itu adalah pembaringan sebagai tempat membolak-balikkan tubuh mereka. Itulah seburuk-buruk tempat pembaringan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. هٰذَا (Beginilah) Yakni hal ini adalah sebagaimana disebutkan. وَإِنَّ لِلطّٰغِينَ لَشَرَّ مَـَٔابٍ (Dan sesungguhnya bagi orang-orang yang durhaka benar-benar (disediakan) tempat kembali yang buruk) Yakni orang-orang yang durhaka dan enggan taat kepada Allah serta mendustakan para rasul, bagi mereka adalah seburuk-buruk tempat kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. balasan ini adalah bagi orang-orang yang bertaqwa dan bagi mereka yang durhaka untuk taat kepada Allah, israf dalam kemaksiatan dan kufur, maka bagi mereka seburuk-buruknya tempat kembali."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Inilah. Sesungguhnya bagi orang-orang yang melampaui batas} bagi orang-orang yang melampaui batas dalam bebuat kekufuran dan kemaksiatan {benar-benar terdapat tempat kembali yang buruk} benar-benar terdapat tempat kembali yang buruk di akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Beginilah” balasan bagi orang-orang yang bertakwa seperti yang telah Kami ungkapkan. “Dan sesungguhnya bagi orang-orang yang durhaka,” yakni, bagi orang-orang yang melampaui batas dalam kekafiran dan berbagai kemaksiatan “benar-benar tempat kembali yang buruk,” maksudnya, tempat kembali dan tempat tinggal yang paling buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 55: (Beginilah) keadaan yang dialami oleh orang-orang yang beriman. (Dan sesungguhnya bagi orang-orang yang durhaka) kalimat ayat ini merupakan jumlah Isti'naf atau kalimat baru (benar-benar disediakan tempat kembali yang paling buruk.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan balasan untuk orang-orang yang bertakwa, maka Dia menyebutkan balasan untuk orang-orang yang durhaka. Yang mengerjakan kekafiran dan kemaksiatan. Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan tempat kembali yang buruk itu dan merincikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 55",
    "description": "55-56. Bila Allah menyediakan surga beserta segala kenikmatan di dalamnya bagi orang yang taat, maka Allah menyediakan jahanam bagi orang yang durhaka terhadap risalah Allah. Beginilah karunia Allah kepada orang-orang yang bertakwa. Dan sungguh, bagi orang-orang yang durhaka terhadap perintah Allah dan rasul-Nya di dunia pasti di akhirat nanti disediakan tempat kembali yang buruk. Itulah neraka jahanam, tempat tinggal yang kelak akan mereka masuki; maka jahanam itulah seburuk-buruk tempat tinggal"
  }
]