[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "57-58 Siksaan berat tersebut berupa air panas, nanah yang mengalir dari jasad para penduduk neraka, maka silahkan mereka minum, dan mereka juga mendapatkan azab-azab lain yang beraneka ragam dan berwarna-warni namun juga (pedih) seperti itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Azab ini adalah air yang sangat panas, dan nanah meleleh dari tubuh para penghuni Neraka yang disiksa di dalamnya. Maka hendaklah mereka meminumnya. Itu adalah minuman mereka yang tidak menghilangkan dahaga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-58. Inilah azab bagi mereka. Sedangkan minuman bagi mereka adalah air yang sangat panas dan nanah yang keluar dari tubuh pada penghuni neraka, maka rasakanlah minuman itu. dan bagi mereka berbagai jenis azab yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. هٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ (Inilah (azab neraka), biarlah mereka merasakannya, (minuman mereka) air yang sangat panas dan air yang sangat dingin) Makna (الحميم) yakni air panas yang sampai pada puncak titik didihnya. Sedangkan (الغساق) yakni nanah yang mengalir dari kulit para penghuni neraka; namun mendapat lain mengatakan maknanya adalah sesuatu yang sangat dingin hingga dapat mematikan seseorang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. ini adzab dan agar mereka merasakannya: air yang begitu panas sekali, dan nanah yang mengalir dari tubuh para ahli neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Inilah. Biarkanlah mereka merasakannya. (Minumannya) Air mendidih} air yang sangan panas {dan cairan nanah} nanah yang mengalir dari tubuh penghuni neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “Inilah” tempat tinggal tersebut; inilah siksaan yang sangat dahsyat dan kehinaan, dipermalukan dan hukuman, “biarlah mereka merasakannya, air yang sangat panas,” air panas yang sudah memuncak panasnya, mereka meminumnya lalu terputus-putuslah isi perut mereka, “dan air yang sangat dingin,” ia merupakan minuman yang sangat tidak disukai yang terbuat dari nanah busuk dan darah, pahit rasanya dan sangat busuk baunya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 57: (Inilah) azab neraka; pengertian ini disimpulkan dari lafal sesudahnya (biarlah mereka merasakannya, minuman mereka air yang sangat panas) lagi membakar (dan nanah ahli neraka) dapat dibaca Ghassaaqun atau Ghasaaqun artinya nanah yang meleleh dari penghuni neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga membuat usus-usus mereka putus. Ada pula yang menafsirkan ghassaaq dengan nanah yang mengalir dari penghuni neraka, pahit rasanya dan bau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 57",
    "description": "57-58. Inilah azab yang Allah janjikan kepada para pendurhaka, maka biarlah mereka merasakannya dan mengetahui betapa pedih azab itu. Inilah air mendidih yang sangat panas dan membakar mulut, kerongkong-an, serta usus mereka, dan air yang sangat dingin, yaitu nanah busuk dingin yang mengalir dari tubuh-tubuh penghuni neraka, dan di sam-ping itu ada berbagai macam azab yang lain yang serupa pedihnya dengan azab itu"
  }
]