[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "57-58 Siksaan berat tersebut berupa air panas, nanah yang mengalir dari jasad para penduduk neraka, maka silahkan mereka minum, dan mereka juga mendapatkan azab-azab lain yang beraneka ragam dan berwarna-warni namun juga (pedih) seperti itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Bagi mereka azab yang lain dalam bentuk sepadan dengan azab ini. Bagi mereka berbagai bentuk azab yang dengannya mereka disiksa di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَءَاخَرُ مِن شَكْلِهِۦٓ أَزْوٰجٌ (Dan azab yang lain yang serupa itu berbagai macam) Yakni bagi para penghuni neraka air panas, nanah, dan azab-azab yang lain yang serupa dengan dua hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58 – 59 dan salah satu siksa akhirat adalah makanan yang jelek, berbagai macam siksaan. Dikatakan pada mereka: semua ini masuk kedalam neraka bersama dengan kalian, tidak ada kelapangan dan tidak ada kemuliaan, mereka masuk neraka dengan amal buruk mereka, dan tidak adanya kelapangan adalah perkataan pemimpin mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan (azab) lain} azab lain {yang serupa itu} serupa dengan air panas dan nanah {itu bermacam-macam} bermacam-macam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “Dan yang lain yang serupa itu,” maksudnya, yang sejenis dengan azab tersebut “berbagai macam,” artinya, ada berbagai bentuk azab-azab lainnya yang dengannya mereka disiksa dan dihinakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 58: (Dan azab yang lain) dapat dibaca dalam bentuk jamak sehingga menjadi Ukharu atau dapat pula dibaca dalam bentuk Mufrad sehingga bacaannya menjadi Aakharu (yang serupa itu) serupa dengan azab yang telah disebutkan tadi, yaitu air yang sangat panas dan cairan nanah (berbagai macam) beraneka ragam siksaan, maksudnya, azab mereka bermacam-macam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu yang serupa dengan air yang sangat panas dan ghassaq. Mereka akan diazab dengan berbagai siksaan yang serupa itu dan akan dihinakan dengannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 58",
    "description": "57-58. Inilah azab yang Allah janjikan kepada para pendurhaka, maka biarlah mereka merasakannya dan mengetahui betapa pedih azab itu. Inilah air mendidih yang sangat panas dan membakar mulut, kerongkong-an, serta usus mereka, dan air yang sangat dingin, yaitu nanah busuk dingin yang mengalir dari tubuh-tubuh penghuni neraka, dan di sam-ping itu ada berbagai macam azab yang lain yang serupa pedihnya dengan azab itu. 59. Saat segolongan penghuni neraka memasukinya, dikatakan kepada mereka yang telah masuk neraka lebih dulu, 'ini rombongan besar pengikut-pengikutmu yang dahulu mau mengikuti ajakanmu menuju kedurhakaan. Mereka akan masuk dan berdesak-desak bersama kamu di neraka. ' mereka yang masuk neraka lebih dulu berkata, 'tidak ada ucapan selamat datang apalagi penghormatan bagi mereka di neraka ini, karena sesungguhnya mereka akan masuk neraka dan disiksa bersama kami akibat perbuatan buruk yang mereka lakukan. ' (lihat pula: surah az-zumar/38: 71'72)."
  }
]