[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Saat orang-orang yang melampaui batas itu masuk ke dalam neraka, sebagian mencaci sebagian yang lain, ”ini adalah segerombolan orang dalam jumlah besar dari penduduk neraka yang masuk bersama kalian,’ lalu mereka menjawab “tidak ada selamat datang untuk mereka, tempat mereka di dalam neraka tidak lapang, mereka akan merasakan panasnya api neraka seperti kami merasakannya’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Bila penghuni-penghuni Neraka masuk Neraka, maka terjadilah di antara mereka apa yang terjadi di antara para seteru, mereka saling mencela. Sebagian dari mereka berlepas diri dari sebagian yang lain. Sebagian dari mereka berkata, “Ini sekelompok penghuni Neraka yang masuk Neraka bersama kalian.” Sebagian yang lain berkata, “Tidak ada ucapan selamat datang bagi mereka, sesungguhnya mereka merasakan azab sebagaimana yang kami rasakan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Ketika orang-orang musyrik mendatangi neraka, mereka saling berselisih dan saling menyalahkan, mereka berkata: “Inilah sekelompok pengikut yang datang kepada kalian dan akan masuk ke neraka bersama kalian.” Maka sebagian lain dari mereka berkata: “Tidak ada sambutan bagi mereka, yang akan mereka dapatkan adalah neraka yang akan mereka rasakan panasnya, sebagaimana yang kami rasakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. هٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ ۖ ((Dikatakan kepada mereka): “Ini adalah suatu rombongan (pengikut-pengikutmu) yang masuk berdesak-desak bersama kamu (ke neraka)”) Apabila para penghuni neraka memasuki neraka, maka para malaikat penjaga neraka akan berkata kepada para pemimpin penghuni neraka: ini adalah pengikut-pengikut kalian, mereka akan masuk neraka bersama kalian.” لَا مَرْحَبًۢا بِهِمْ ۚ( “Tiadalah ucapan selamat datang kepada mereka) Ini merupakan perkataan para pemimpin penghuni neraka. Yakni tidak ada penghormatan bagi mereka. Di sini Allah menjelaskan bahwa hubungan kasih sayang antara orang-orang kafir telah terputus, dan kasih sayang mereka telah menjadi permusuhan. إِنَّهُمْ صَالُوا۟ النَّارِ(karena sesungguhnya mereka akan masuk neraka”) Sebagaimana kami juga memasukinya, dan mereka berhak mendapatkannya sebagaimana kami juga berhak mendapatkannya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58 – 59 dan salah satu siksa akhirat adalah makanan yang jelek, berbagai macam siksaan. Dikatakan pada mereka: semua ini masuk kedalam neraka bersama dengan kalian, tidak ada kelapangan dan tidak ada kemuliaan, mereka masuk neraka dengan amal buruk mereka, dan tidak adanya kelapangan adalah perkataan pemimpin mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Ini adalah rombongan} inilah salah satu golongan penghuni surga {yang masuk berdesak-desakan bersama kalian} masuk ke dalam neraka bersama kalian {”Tidak ada penyambutan bagi mereka} neraka itu tidak lebar dan luas bagi mereka {karena sesungguhnya mereka akan masuk neraka} mereka memasukinya dan merasakan panasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59-60. Di saat mereka memasuki neraka, maka sebagian di antara mereka mencela sebagian yang lain, yang satu berkata kepada yang lainnya, “Ini adalah suatu rombongan yang masuk berdesak-desakkan bersama kamu,” untuk memasuki neraka. “Tiadalah ucapan selamat datang kepada mereka karena sesungguhnya mereka akan masuk neraka.” “Mereka menjawab,” maksudnya, rombongan yang datang yang saling berdesak-desakan tersebut, “Sebenarnya kamulah yang tiada ucapan selamat datang bagimu, karena kamulah yang mendatangkannya,” yakni azab ini “bagi kami” dengan seruan kalian kepada kami, bujukan dan penyesatan kalian terhadap kami, serta kalianlah yang menjadi sebabnya, “maka amat buruklah ia sebagai tempat menetap.” Tempat tinggal mereka semua adalah tempat tinggal yang sangat buruk dan jahat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 59: Dan dikatakan kepada mereka sewaktu mereka diseret ke dalam neraka bersama dengan para pengikutnya (\"Ini adalah suatu rombongan) suatu gelombang (yang masuk berdesak-desak) dijejalkan masuk (bersama kalian\") ke neraka. Kalimat itu dikatakan kepada mereka dengan nada yang keras; maka berkatalah pemimpin-pemimpin mereka yang durhaka, (\"Tiadalah ucapan selamat datang kepada mereka) artinya, tiada kelapangan buat mereka (karena sesungguhnya mereka akan masuk neraka.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka memasuki neraka, maka antara pemimpin dengan pengikut akan saling cela-mencela."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 59",
    "description": "Saat segolongan penghuni neraka memasukinya, dikatakan kepada mereka yang telah masuk neraka lebih dulu, 'ini rombongan besar pengikut-pengikutmu yang dahulu mau mengikuti ajakanmu menuju kedurhakaan. Mereka akan masuk dan berdesak-desak bersama kamu di neraka. ' mereka yang masuk neraka lebih dulu berkata, 'tidak ada ucapan selamat datang apalagi penghormatan bagi mereka di neraka ini, karena sesungguhnya mereka akan masuk neraka dan disiksa bersama kami akibat perbuatan buruk yang mereka lakukan. ' (lihat pula: surah az-zumar/38: 71'72). 60. Kelompok pengikut yang hendak masuk neraka itu menjawab 'sebenarnya kamulah yang lebih pantas untuk tidak menerima ucapan selamat datang dan penghormatan, karena kamulah yang menjerumuskan kami ke dalam azab neraka dengan mengajak kami berbuat dosa dan menghindari petunjuk Allah. ' maka neraka itulah seburuk-buruk tempat menetap dan tempat kembali mereka."
  }
]