[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7 lalu para tokoh dan para pembesar kaum berusaha mendorong mereka untuk mempertahankan kesyirikan dan memperjuangkan keragaman tuhan-tuhan. Mereka berkata” apa yang dibawa oleh rasul tersebut adalah sesuatu yang direncanakan dengan tujuan meraih kepemimpinan dan kedudukan. kami belum pernah dengar apa yang didakwahkan itu dari kalangan leluhur kami (orang-orang quraisy) dan dalam agama nasrani. Apa yang dia sampaikan hanyalah kedustaan dan kebohongan. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Maka para pembesar dan pemuka mereka mendatangi para pengikut mereka seraya berkata, “Teruskan apa yang selama ini kalian lakukan, jangan mengikuti agama Muhammad, pertahankanlah ibadah kepada tuhan-tuhan kalian. Sesungguhnya dakwah Muhammad kepada kalian untuk menyembah satu Tuhan hanyalah taktiknya saja, karena dia ingin merebut kepemimpinan dan pengikut dari tangan kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-7. Para pemuka kaum itu mendorong orang-orang agar tetap di dalam kesyirikan dan kekafiran: “Dakwah yang dilakukan lelaki ini merupakan siasat agar dia dapat meraih kekuasaan dan kepemimpinan. Kami tidak pernah mendengar hal yang seperti ini dalam agama kaum Quraisy tidak pula dalam agama Yahudi dan Nasrani. Tidak lain ini adalah kedustaan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَانطَلَقَ الْمَلَأُ مِنْهُمْ (Dan pergilah pemimpin-pemimpin mereka) Rasulullah meminta kepada mereka mengucapkan kalimat yang dapat menundukkan orang Arab dan lainnya pada mereka. Mereka bertanya: “kalimat apa itu?” Rasulullah menjawab: “kalimat laa ilaaha illaa Allah.” Mereka lalu berdiri terkaget sambil mengibas-ngibaskan pakaian mereka, mereka berkata: “apakah dia menjadikan tuhan-tuhan itu sebagai Tuhan yang satu saja?” أَنِ امْشُوا۟( (seraya berkata): “Pergilah kamu) Yakni lanjutkanlah apa yang telah kalian lakukan, dan janganlah kalian masuk ke dalam agamanya. Mereka mengatakan ini kepada para pengikut mereka. وَاصْبِرُوا۟ عَلَىٰٓ ءَالِهَتِكُمْ ۖ( dan tetaplah (menyembah) tuhan-tuhanmu) Yakni tetaplah menyembah mereka. إِنَّ هٰذَا لَشَىْءٌ يُرَادُ (sesungguhnya ini benar-benar suatu hal yang dikehendaki) Yakni ini adalah urusan Muhammad yang dia inginkan dari kita dan tuhan-tuhan kita, dan dia berharap dapat berhasil agar dapat berkuasa terhadap kita sehingga kita menjadi pengikutnya dan dia dapat mengatur kita sesuai kehendaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Para pembesar dan pemimpin kaum Qurays meninggalkan mereka dengan berkata kepada beberapa kaumnya: “Laksankanlah apa yang telah menjadi kewajiban kalian, jangan kalian berpaling dari tuhan-tuhan kalian. Tetap sembahlah mereka. Inilah yang diinginkan Muhammad terhadap kita dan sesembahan kita. Muhammad menyeru untuk mengesakan Tuhan, agar kita mau untuk menjadi pengikutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu pemimpin-pemimpin mereka} para pembesar dan pemuka {pergi (dengan berkata) “Pergilah} pergilah ke tempat kalian sebelumnya dan jangan masuk agamanya {dan tetaplah (menyembah) tuhan-tuhan kalian}dan tetaplah untuk menyembah tuhan-tuhan kalian {Sesungguhnya ini benar-benar sesuatu yang dikehendaki} benar-benar perkara yang direncanakan yang diinginkan oleh Muhammad dari kita dan tuhan-tuhan kita, supaya dia bisa lebih tinggi dari kita dan mengatur kita"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Dan pergilah pemimpin-pemimpin mereka.” Yang perkataan mereka diterima, dengan maksud menghimbau kaumnya supaya mereka tetap berpegang teguh kepada kesyirikan yang mereka anut, “Pergilah kamu dan bersabarlah terhadap sembahan-sembahanmu.” Maksudnya, teruslah kalian menyembahnya dan bersungguh-sungguhlah dalam mempertahankan dan menyembahnya, jangan sekali-kali ada apa pun yang mencegah kalian dan jangan pula ada seorang pun yang menghalang-halangi kalian, “sesungguhnya ini,” yang dibawa oleh Muhammad ini, yaitu larangan menyembah mereka, “benar-benar suatu hal yang dikehendaki,” yakni yang dimaksud. Artinya, Muhammad mempunyai niat dan tujuan yang tidak baik padanya. Ini adalah propaganda yang tidak akan pernah laku kecuali di kalangfan orang-orang yang dungu (tidak berakal). Sebab, sesungguhnya siapa saja yang mengajak kepada perkataan yang benar atau yang tidak benar, maka perkataannya tidak bisa ditolak dengan cara mencemoohkan niatnya, karena niat dan amalnya hanya orang yang bersangkutan yang tahu. Semestinya ia ditolak (ditanggapi) dengan cara menghadapinya dengan apa yang dapat membatalkan dan merusak argument-argumen dan hujjah-hujjah (dalil) nya; sedangkan tujuan mereka adalah bahwa Muhammad itu sebenarnya mengajak kalian kepada apa yang diserukannya hanyalah untuk (dapat) memimpin kalian dan supaya menjadi orang yang dihormati dan diikuti di kalangan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 6: (Dan pergilah pemimpin-pemimpin mereka) dari majelis tempat mereka berkumpul, yaitu tempat Abu Thalib; di tempat itulah mereka mendengar dari Nabi saw. yang mengatakan, \"Katakanlah oleh kalian, 'Laa Ilaaha Illallaah', artinya tiada Tuhan selain Allah (seraya mengatakan, 'Pergilah kalian') maksudnya, sebagian dari mereka berkata kepada sebagian yang lain 'pergilah kalian' (dan tetaplah menyembah tuhan-tuhan kalian) artinya bertahanlah kalian di dalam menyembah tuhan-tuhan kalian itu (sesungguhnya ini) ajaran tauhid yang disampaikan Nabi itu (benar-benar suatu hal yang dikehendaki\") olehnya supaya kita melakukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma ia berkata: Ketika Abu Thalib sakit, maka beberapa orang Quraisy yang di antaranya Abu Jahal masuk menemuinya, lalu mereka berkata, “Sesungguhnya putera saudaramu mencaci-maki sesembahan kami, berbuat ini dan itu serta berkata ini dan itu. Mengapa engkau tidak kirim orang untuk melarangnya? Lalu Abu Thalib mengirim orang kepada Beliau, kemudian Nabi shallallahu 'alaihi wa sallam datang, dan masuk ke dalam rumah tersebut, sedangkan jarak antara Beliau dengan Abu Thalib seukuran tempat duduk seseorang. Lalu Abu Jahal la’natullah ‘alaih merasa khawatir jika Beliau duduk di samping Abu Thalib nanti membuatnya simpati kepada Beliau, maka ia segera loncat dan duduk di majlis itu, dan ternyata Rasulullah shallallahu 'alaihi wa sallam tidak mendapatkan majlis yang dekat dengan pamannya, maka ia duduk di dekat pintu. Lalu Abu Thalib berkata kepada Beliau, “Wahai anak saudaraku, mengapa kaummu selalu mengeluhkan tentangmu dan mengatakan bahwa kamu mencaci-maki sesembahan mereka, dan berkata ini dan itu?” Lalu orang-orang di sana menambahkan lagi kata-katanya, dan mulailah Rasulullah shallallahu 'alaihi wa sallam berbicara, “Wahai paman, sesungguhnya aku menginginkan dari mereka satu kalimat yang mereka ucapkan, di mana bangsa Arab akan mengikutinya, dan nanti orang-orang di luar Arab akan membayar pajak untuk mereka.” Lalu mereka kaget dengan kalimat itu dan kepada perkataannya.” Maka orang-orang berkata, “Ya, satu kalimat, namun kami akan gantikan kalimat itu dengan sepuluh kalimat. Apa kalimat itu?” Abu Thalib juga berkata, “Kalimat apa itu wahai putera saudaraku?” Maka Rasulullah shallallahu 'alaihi wa sallam bersabda, “Laailaahaillallah (artinya: Tidak ada tuhan yang berhak disembah selain Allah).” Lalu mereka bangkit dalam keadaan kaget sambil mengibas kain mereka dan berkata, “Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sungguh, ini benar-benar sesuatu yang sangat mengherankan.” (HR. Ibnu Jarir, Ahmad, Nasa’i, dan Tirmidzi dari Ibnu Abbas radhiyallahu 'anhuma). Namun hadits ini didha'ifkan oleh Syaikh Al Albani dalam Dha’if At Tirmidzi no. 3232). Yakni tokoh-tokoh masyarakat yang ucapannya diterima sambil mendorong kaum mereka untuk tetap teguh berpegang dengan kesyirkkan yang selama ini mereka lakukan. Maksudnya, menurut orang-orang kafir bahwa menyembah tuhan-tuhan itulah yang sebenarnya dikehendaki oleh Allah. Mahasuci Allah dari anggapan mereka ini. Bisa juga maksud mereka adalah, bahwa yang dibawa oleh Nabi Muhammad shallallahu 'alaihi wa sallam berupa larangan berbuat syirk adalah sesuatu yang ada maksudnya, yakni Beliau memiliki niat tidak baik ketika melarang berbuat syirk. Ini merupakan syubhat yang biasanya laris di kalangan orang-orang yang bodoh, karena orang yang mengajak kepada yang hak (benar) atau tidak hak tidaklah dibantah perkataannya dengan mencela niatnya, karena niat dan amalnya adalah urusannya, jika ingin membantahnya, maka dengan menghadapinya menggunakan sesuatu yang dapat membatalkannya berupa hujjah dan bukti. Menurut persangkaan mereka juga, bahwa Beliau shallallahu 'alaihi wa sallam mengajak kepada Allah adalah agar Beliau menjadi pemimpin di tengah-tengah kaumnya, dimuliakan dan diikuti oleh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 6",
    "description": "Mendengar ajakan nabi untuk beratuhid, lalu pergilah pemimpin-pemimpin mereka menghampiri kaum masing-masing seraya berkata, 'pergilah kamu dan tetaplah menyembah tuhan-tuhanmu sendiri. Sesungguhnya ajakan bertauhid ini benar-benar hanyalah suatu hal yang dikehendaki oleh Muhammad terhadap kita agar dia bisa menjadi pemimpin. 7. Kami tidak pernah mendengar hal ini dalam agama yang terakhir, yaitu nasrani, yang meyakini ajaran trinitas. Ajaran tauhid ini tidak lain ha-Nyalah kedustaan yang diada-adakan oleh Muhammad."
  }
]