[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pengikut berkata kepada para pemimpin ”justru kalianlah yang tidak ada selamat datang untuk kalian, sebab kalian lah yang memberikan tempat tinggal di neraka ini untuk kami, karena kalianlah yang menyesatkan kami di dunia, dan jahanam adalah seburuk-buruk tempat tinggal. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Sekelompok orang dari para pengikut berkata kepada panutan yang mereka ikuti, “Wahai para tokoh yang diikuti, justru kalian tidak ada ucapan selamat datang bagi kalian. Kalianlah yang menjadi sebab kami mendapatkan azab ini, karena kalian yang menyesatkan kami dan membuat kami menyimpang dari kebenaran.” Ini adalah seburuk-buruk tempat, tempat mereka semuanya, Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60-61. Para pengikut itu berkata kepada para pemimpin mereka: “Kalianlah yang tidak mendapat sambutan, sebab kalian telah menyesatkan kami di dunia, sehingga neraka menjadi tempat tinggal kami, sungguh itulah seburuk-buruk tempat tinggal. Ya Tuhan kami, barangsiapa yang menyesatkan kami di dunia dari petunjuk dan menjadikan kami masuk neraka, maka lipatgandakanlah azabnya di neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. قَالُوا۟ (Pengikut-pengikut mereka menjawab) Yakni para pengikut itu berkata kepada para pemimpin mereka. بَلْ أَنتُمْ لَا مَرْحَبًۢا بِكُمْ ۖ (“Sebenarnya kamulah. Tiada ucapan selamat datang bagimu) Yakni tidak ada penghormatan bagi kalian. أَنتُمْ قَدَّمْتُمُوهُ لَنَا ۖ( karena kamulah yang menjerumuskan kami ke dalam azab) Yakni kalianlah yang menjerumuskan dan mengajak kami menuju azab akibat perkataan kalian dahulu kepada kami bahwa kalian berada dalam kebenaran dan para nabi itu berdusta dalam apa yang mereka bawa. فَبِئْسَ الْقَرَارُ (maka amat buruklah Jahannam itu sebagai tempat menetap”) Yakni seburuk-buruk tempat tinggal bagi kami dan kalian adalah neraka Jahannam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. para pengikut mereka menjawab: tetapi kamu tidak pantas menerima ucapan selamat datang dan tidak pantas dimuliakan, kamu sekalian adalah pengikut kafir kami, maka jahannam adalah tempat bagi kami dan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata} para pengikut itu berkata kepada petinggi-petingginya {“Sebenarnya kalianlah yang tidak menerima sambutan karena kalian yang meletakkan kami ke dalamnya} Kalian menyebabkan datangnya azab itu kepada kami, dengan seruan kalian kepada kami menuju kekufuran {Seburuk-buruk tempat menetap”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59-60. Di saat mereka memasuki neraka, maka sebagian di antara mereka mencela sebagian yang lain, yang satu berkata kepada yang lainnya, “Ini adalah suatu rombongan yang masuk berdesak-desakkan bersama kamu,” untuk memasuki neraka. “Tiadalah ucapan selamat datang kepada mereka karena sesungguhnya mereka akan masuk neraka.” “Mereka menjawab,” maksudnya, rombongan yang datang yang saling berdesak-desakan tersebut, “Sebenarnya kamulah yang tiada ucapan selamat datang bagimu, karena kamulah yang mendatangkannya,” yakni azab ini “bagi kami” dengan seruan kalian kepada kami, bujukan dan penyesatan kalian terhadap kami, serta kalianlah yang menjadi sebabnya, “maka amat buruklah ia sebagai tempat menetap.” Tempat tinggal mereka semua adalah tempat tinggal yang sangat buruk dan jahat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 60: (Pengikut-pengikut mereka berkata) atau mengatakan, (\"Sebenarnya kalianlah; tiada ucapan selamat datang bagi kalian, karena kalianlah yang menjerumuskan kami) ke dalam kekafiran (maka amat buruklah tempat tinggal\") bagi kami dan kalian, yaitu neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni rombongan yang baru datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 60",
    "description": "Kelompok pengikut yang hendak masuk neraka itu menjawab 'sebenarnya kamulah yang lebih pantas untuk tidak menerima ucapan selamat datang dan penghormatan, karena kamulah yang menjerumuskan kami ke dalam azab neraka dengan mengajak kami berbuat dosa dan menghindari petunjuk Allah. ' maka neraka itulah seburuk-buruk tempat menetap dan tempat kembali mereka. 61-64. Demikianlah sergahan kelompok pengikut. Mereka berkata lagi seraya memohon kepada Allah, 'ya tuhan kami, barang siapa mengajak kami memilih jalan kesesatan dan menjerumuskan kami ke dalam azab yang pedih dan berat ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka dan timpakanlah laknat yang besar atas mereka. \" (lihat pula: surah al-a'r'f/7: 38; al-a'z'b/33: 67'68). Para pendurhaka itu lalu berbicara dan saling bertanya-tanya seraya berkata, 'me-ngapa kami tidak melihat orang-orang yang di dunia dahulu kami anggap sebagai orang-orang yang jahat, hina, buruk, dan bodoh, seperti bilal, suhaib, dan ammar'' dahulu kami menjadikan mereka olok-olokan; apakah karena mereka tidak pantas menerima hinaan itu sehingga tidak masuk neraka bersama kami, ataukah karena penglihatan kami yang tidak melihat mereka di tempat ini lantaran mereka telah masuk lebih dulu'' sungguh, yang demikian itu benar-benar terjadi; itulah pertengkaran, saling mencaci, menyalahkan, dan menuduh di antara para penghuni neraka."
  }
]