[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kelompok pengikut berkata ”wahai tuhan kami, lipatgandakanlah siksaan atas orang-orang yang telah menyesatkan kami di dunia. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Para pengikut berkata, “Wahai Rabb kami! Orang yang menyesatkan kami dari kebenaran setelah kebenaran itu datang kepada kami, maka lipat gandakanlah azabnya di Neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. قَالُوا۟ رَبَّنَا مَن قَدَّمَ لَنَا هٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِى النَّارِ (Mereka berkata (lagi): “Ya Tuhan kami; barang siapa yang menjerumuskan kami ke dalam azab ini maka tambahkanlah azab kepadanya dengan berlipat ganda di dalam neraka”) Yakni azab karena kekafirannya dan azab karena ajakan mereka terhadap kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. mereka berkata lagi: ya Tuhan kami, barangsiapa menjerumuskan kami dalam siksa ini, maka tambahkanlah adzab dua kali lipat pada mereka di neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tempat menetap yaitu neraka Jahanam {Mereka berkata} para pengikut berkata {“Wahai Tuhan kami, siapa yang menjerumuskan kami ke dalam (azab) ini, maka tambahkanlah kepadanya azab yang berlipat ganda} yang berlipat ganda {di dalam neraka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Kemudian mereka mendoakan keburukan terhadap orang-orang yang telah menyesatkan mereka, “Mereka berkata lagi, ‘Ya Rabb kami; barangsiapa yang mendatangkan azab ini bagi kami, maka tambahkanlah azab kepadanya dengan berlipat ganda di dalam neraka’.” Dan dikatakan di dalam ayat yang lain sebagai berikut, “Masing-masing mendapat (siksaan), yang berlipat ganda, akan tetapi kamu tidak mengetahui\". (Al-A’raf:38)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 61: (Mereka berkata) lagi, (\"Ya Rabb kami! Barang siapa yang menjerumuskan kami ke dalam azab ini, maka tambahkanlah azab kepadanya dengan berlipat ganda) dua kali lipat azab yang diterimanya, sebagai balasan dari kekafirannya (di dalam neraka.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu para pengikut yang telah disesatkan. Dalam ayat lain Allah Subhaanahu wa Ta'aala berfirman menjawab doa mereka, \"Masing-masing mendapat (siksaan) yang berlipat ganda, akan tetapi kamu tidak mengetahui.” (Terj. Al A’raaf: 38)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 61",
    "description": "61-64. Demikianlah sergahan kelompok pengikut. Mereka berkata lagi seraya memohon kepada Allah, 'ya tuhan kami, barang siapa mengajak kami memilih jalan kesesatan dan menjerumuskan kami ke dalam azab yang pedih dan berat ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka dan timpakanlah laknat yang besar atas mereka. \" (lihat pula: surah al-a'r'f/7: 38; al-a'z'b/33: 67'68). Para pendurhaka itu lalu berbicara dan saling bertanya-tanya seraya berkata, 'me-ngapa kami tidak melihat orang-orang yang di dunia dahulu kami anggap sebagai orang-orang yang jahat, hina, buruk, dan bodoh, seperti bilal, suhaib, dan ammar'' dahulu kami menjadikan mereka olok-olokan; apakah karena mereka tidak pantas menerima hinaan itu sehingga tidak masuk neraka bersama kami, ataukah karena penglihatan kami yang tidak melihat mereka di tempat ini lantaran mereka telah masuk lebih dulu'' sungguh, yang demikian itu benar-benar terjadi; itulah pertengkaran, saling mencaci, menyalahkan, dan menuduh di antara para penghuni neraka"
  }
]