[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62-63 para pemimpin berkata “mengapa Kami tidak melihat di dalam neraka ini orang-orang yang dulu di dunia kami anggap sebagai orang-orang buruk lagi sengsara? apakah pelecehan kami dan penghinaan kami terhadap mereka salah? ataukah mereka berada di neraka hanya saja kami tidak melihat mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Orang-orang sombong yang melampaui batas itu berkata, “Mengapa di dalam neraka ini kami tidak melihat orang-orang yang semasa di dunia kami menganggap mereka termasuk orang-orang yang sengsara yang laik mendapatkan azab?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62-64. Para pemimpin itu berkata: “Mengapa di neraka kami tidak melihat segolongan orang yang menurut kami mereka di dunia termasuk orang-orang yang jahat? Apakah peremehan kami terhadap mereka ini merupakan hal yang keliru? Atau sebenarnya mereka berada di neraka namun kami tidak melihat mereka?” Pertengkaran dan perbincangan para penghuni neraka ini merupakan hal yang benar-benar terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَقَالُوا۟ مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُم مِّنَ الْأَشْرَارِ (Dan (orang-orang durhaka) berkata: “Mengapa kami tidak melihat orang-orang yang dahulu (di dunia) kami anggap sebagai orang-orang yang jahat) Yang mereka maksud adalah orang-orang beriman yang miskin seperti ‘Ammar bin Yasir, Khabbab bin Arats, Shuhaib ar-Rumi, Bilal bin Rabah, Salim Maula Hudzaifah, dan Salman al-Farisi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. dan pemimpin mereka yang durhaka, di neraka, berkata:mengapa kami tidak melihat orang-orang yang dahulu di dunia kami anggap sebagai orang-orang yang jahat (hina) yang tidak ada kebaikan pada mereka, yaitu mereka orang-orang mukmin yang fakir, lemah, yang dihinakan oleh para munafik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} para pembesar orang-orang musyrik di neraka itu berkata {“Mengapa kami tidak melihat orang-orang yang selalu kami anggap sebagai orang-orang yang jahat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Dan mereka berkata” sedangkan mereka di dalam neraka, “Mengapa kami tidak melihat orang-orang yang dahulu kami angkat sebagai orang-orang yang jahat,” yakni, yang kami dahulu menganggap mereka termasuk orang-orang jahat yang berhak mendapat siksa api neraka, padahal mereka adalah orang-orang Mukmin. Para penghuni neraka mencari-cari mereka. Semoga Allah menjelekkan para penghuni neraka itu. Apakah mereka bisa melihat (menjumpai) kaum beriman di dalam neraka?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 62: (Dan mereka berkata,) yakni orang-orang kafir Mekah, sedang mereka berada dalam neraka, (\"Mengapa kami tidak melihat orang-orang yang dahulu kami anggap) sewaktu di dunia (sebagai orang-orang yang hina.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka berada di neraka. Yang mereka maksud di sini adalah orang-orang mukmin, terutama golongan yang lemah dan fakir. Yakni kami menganggap mereka sebagai orang-orang yang jahat yang berhak masuk neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 62",
    "description": "61-64. Demikianlah sergahan kelompok pengikut. Mereka berkata lagi seraya memohon kepada Allah, 'ya tuhan kami, barang siapa mengajak kami memilih jalan kesesatan dan menjerumuskan kami ke dalam azab yang pedih dan berat ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka dan timpakanlah laknat yang besar atas mereka. \" (lihat pula: surah al-a'r'f/7: 38; al-a'z'b/33: 67'68). Para pendurhaka itu lalu berbicara dan saling bertanya-tanya seraya berkata, 'me-ngapa kami tidak melihat orang-orang yang di dunia dahulu kami anggap sebagai orang-orang yang jahat, hina, buruk, dan bodoh, seperti bilal, suhaib, dan ammar'' dahulu kami menjadikan mereka olok-olokan; apakah karena mereka tidak pantas menerima hinaan itu sehingga tidak masuk neraka bersama kami, ataukah karena penglihatan kami yang tidak melihat mereka di tempat ini lantaran mereka telah masuk lebih dulu'' sungguh, yang demikian itu benar-benar terjadi; itulah pertengkaran, saling mencaci, menyalahkan, dan menuduh di antara para penghuni neraka"
  }
]