[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62-63 para pemimpin berkata “mengapa Kami tidak melihat di dalam neraka ini orang-orang yang dulu di dunia kami anggap sebagai orang-orang buruk lagi sengsara? apakah pelecehan kami dan penghinaan kami terhadap mereka salah? ataukah mereka berada di neraka hanya saja kami tidak melihat mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Apakah pelecehan dan penghinaan kami kepada mereka salah alamat sehingga mereka tidak berhak mendapatkan azab ataukah tindakan kami itu benar dan mereka telah masuk neraka namun kami tidak melihat mereka?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أَتَّخَذْنٰهُمْ سِخْرِيًّا (Apakah kami dahulu menjadikan mereka olok-olokan) Yakni ketika di dunia. Padahal mereka adalah orang-orang terhormat; dan kami telah melakukan kesalahan. أَمْ زَاغَتْ عَنْهُمُ الْأَبْصٰرُ(ataukah karena mata kami tidak melihat mereka?”) Sehingga kami tidak mendapati tempat mereka di neraka? Imam al-Hasan berkata bahwa semua itu telah mereka lakukan, yaitu mereka telah mengolok-olok orang-orang beriman dan mata mereka tidak melihat mereka sebab mereka berada di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. apakah salah ketika kami mengolok-olok mereka di dunia? Mereka adalah ahli karamah, apakah mereka juga bersama kami di neraka? Tapi kami tidak melihat mereka, apakah penglihatan kami tertutup sehingga tidak melihat mereka?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} para pembesar orang-orang musyrik di neraka itu berkata {“Mengapa kami tidak melihat orang-orang yang selalu kami anggap sebagai orang-orang yang jahat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “Apakah kami dahulu menjadikan mereka olok-olokkan, ataukah karena mata kami tidak melihat mereka?” maksudnya, kami tidak melihat mereka adalah karena dua kemungkinan: Pertama, kami keliru dalam menggolongkan mereka termasuk orang-orang jahat, dan ternyata mereka adalah orang-orang baik, sedangkan ucapan-ucapan kami tidak lain hanyalah sebagai perolok-olokkan dan penghinaan terhadap mereka. Inilah realitanya, sebagaimana difirmankan oleh Allah kepada para penghuni neraka, “Sesungguhnya, ada segolongan dari hamba-hamba-Ku berdoa (di dunia): \"Ya Tuhan kami, kami telah beriman, maka ampunilah kami dan berilah kami rahmat dan Engkau adalah Pemberi rahmat Yang Paling Baik. Lalu kamu menjadikan mereka buah ejekan, sehingga (kesibukan) kamu mengejek mereka, menjadikan kamu lupa mengingat Aku, dan adalah kamu selalu menertawakan mereka.” (Al-Mu’minun:109-110). Kedua, kemungkinan pandangan mata kami luput dari melihat mereka karena sama-sama di dalam azab. Jadi, mereka sama-sama disiksa bersama kami akan tetapi pandangan mata kami luput dari mereka. Itu berarti keyakinan-keyakinan yang mereka yakini di dunia dan banyaknya apa yang mereka voniskan terhadap orang-orang beriman bahwa mereka pasti masuk neraka benar-benar telah mengakar di dalam hati mereka dan telah menjadi tabiatnya. Mereka masuk neraka sedangkan mereka seperti itu keadaannya, lalu di sanalah mereka mengatakan apa yang mereka katakana itu. Bisa jadi perkataan mereka ini adalah pengelabuan, sebagaimana mereka telah sering melakukan pengelabuan di dunia, hingga bahkan sampai di neraka. Maka dari itu para penghuni a’rof berkata kepada para penghuni neraka, \"Itukah orang-orang yang kamu telah bersumpah bahwa mereka tidak akan mendapat rahmat Allah?\" (Kepada orang mukmin itu dikatakan): \"Masuklah ke dalam surga, tidak ada kekhawatiran terhadapmu dan tidak (pula) kamu bersedih hati.” (Al-A’raf:49)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 63: (Apakah kami dahulu menjadikan mereka olok-olokan) lafal Sukhriyyan dapat pula dibaca Sikhriyyan, yakni kami dahulu sewaktu di dunia menghina mereka. Huruf Ya pada lafal Sukhriyyan adalah Nasab; maksudnya apakah mereka tidak ada (ataukah karena tidak melihat) yakni terhalang (mata kami dari melihat mereka) sehingga mata kami tidak dapat melihat mereka. Yang mereka maksud adalah kaum muslimin yang miskin, seperti Ammar, Bilal, Shuhaib, dan Salman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud mereka dengan kata-kata ini adalah bahwa tidak melihatnya mereka orang-orang yang mereka anggap jahat mengandung dua kemungkinan: (1) Bisa jadi karena salah menilai mereka, bahkan sebenarnya mereka adalah orang yang baik sehingga anggapan mereka itu merupakan olok-olokkan kepada orang-orang itu, dan inilah kenyataannya sebagaimana firman Allah Ta’ala kepada penghuni neraka, “Lalu kamu menjadikan mereka bahan ejekan, sehingga (kesibukan) kamu mengejek mereka, menjadikan kamu lupa mengingat Aku, dan kamu selalu mentertawakan mereka,-- Sesungguhnya Aku memberi balasan kepada mereka di hari ini, karena kesabaran mereka. Sesungguhnya mereka itulah orang-orang yang menang.\" (Terj. Al Mu’minun: 110-111), (2) Bisa jadi karena mereka tidak melihat orang-orang yang mereka anggap jahat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 63",
    "description": "61-64. Demikianlah sergahan kelompok pengikut. Mereka berkata lagi seraya memohon kepada Allah, 'ya tuhan kami, barang siapa mengajak kami memilih jalan kesesatan dan menjerumuskan kami ke dalam azab yang pedih dan berat ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka dan timpakanlah laknat yang besar atas mereka. \" (lihat pula: surah al-a'r'f/7: 38; al-a'z'b/33: 67'68). Para pendurhaka itu lalu berbicara dan saling bertanya-tanya seraya berkata, 'me-ngapa kami tidak melihat orang-orang yang di dunia dahulu kami anggap sebagai orang-orang yang jahat, hina, buruk, dan bodoh, seperti bilal, suhaib, dan ammar'' dahulu kami menjadikan mereka olok-olokan; apakah karena mereka tidak pantas menerima hinaan itu sehingga tidak masuk neraka bersama kami, ataukah karena penglihatan kami yang tidak melihat mereka di tempat ini lantaran mereka telah masuk lebih dulu'' sungguh, yang demikian itu benar-benar terjadi; itulah pertengkaran, saling mencaci, menyalahkan, dan menuduh di antara para penghuni neraka"
  }
]