[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya perdebatan diantara penduduk neraka adalah sesuatu yang akan benar-beanar terjadi yang tidak ada keraguan tentangnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Sesungguhnya apa yang Kami sebutkan kepadamu ini, yaitu berbantahan di antara orang-orang kafir adalah kebenaran yang tidak ada keraguan dan kebimbangan padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. إِنَّ ذٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ (Sesungguhnya yang demikian itu pasti terjadi, (yaitu) pertengkaran penghuni neraka) Yakni apa yang dikisahkan Allah tentang mereka adalah kesungguhan yang pasti akan mereka katakan seperti itu, yaitu pertengkaran yang terjadi antara penghuni neraka dan perkataan para pemimpin mereka kepada para pengikutnya begitu pula sebaliknya. Ini merupakan hal yang pasti terjadi pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. sesungguhnya yang demikian tersebut adalah pertengkaran ahli neraka dan itu adalah ketetapan yang haq yang terjadi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya yang demikian itu benar, (yaitu) perselisihan di antara penghuni neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Allah berfirman menegaskan apa yang diinformasikanNya, dan Dia adalah Yang Mahabenar perkataanNya, “Sesungguhnya yang demikian itu” yang Aku uraikan kepada kalian itu, “pasti terjadi,” tidak ada keraguan padanya, “yaitu pertengkaran para penghuni neraka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 64: (Sesungguhnya yang demikian itu pasti terjadi) sudah pasti terjadinya, yaitu (pertengkaran penghuni neraka) sebagaimana yang telah dijelaskan tadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menguatkan berita-Nya, dan Dia adalah yang paling benar ucapannya. Yakni tidak perlu diragukan lagi. Sebagaimana yang diterangkan dalam ayat sebelumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 64",
    "description": "61-64. Demikianlah sergahan kelompok pengikut. Mereka berkata lagi seraya memohon kepada Allah, 'ya tuhan kami, barang siapa mengajak kami memilih jalan kesesatan dan menjerumuskan kami ke dalam azab yang pedih dan berat ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka dan timpakanlah laknat yang besar atas mereka. \" (lihat pula: surah al-a'r'f/7: 38; al-a'z'b/33: 67'68). Para pendurhaka itu lalu berbicara dan saling bertanya-tanya seraya berkata, 'me-ngapa kami tidak melihat orang-orang yang di dunia dahulu kami anggap sebagai orang-orang yang jahat, hina, buruk, dan bodoh, seperti bilal, suhaib, dan ammar'' dahulu kami menjadikan mereka olok-olokan; apakah karena mereka tidak pantas menerima hinaan itu sehingga tidak masuk neraka bersama kami, ataukah karena penglihatan kami yang tidak melihat mereka di tempat ini lantaran mereka telah masuk lebih dulu'' sungguh, yang demikian itu benar-benar terjadi; itulah pertengkaran, saling mencaci, menyalahkan, dan menuduh di antara para penghuni neraka. 65. Sebetulnya para penghuni neraka itu di dunia dahulu telah menerima peringatan para rasul untuk mengesakan Allah dan menaati aturan-Nya. Katakanlah, wahai nabi Muhammad kepada kaum musyrik, 'se-sungguhnya aku hanya seorang pemberi peringatan. Adalah tugasku untuk menyampaikan kepadamu ancaman-Nya yang pedih bagi orang-orang yang mengingkari-Nya. Karena itu, yakinilah bahwa tidak ada tuhan yang berhak disembah selain Allah. Dialah yang maha esa dan tidak ada sekutu bagi-Nya, mahaperkasa sehingga dapat mengalahkan siapa pun yang menentang-Nya."
  }
]