[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah (wahai rasul) kepada kaummu, ”sesungguhnya aku hanyalah pemberi peringatan kepada kalian dari azab Allah jangan sapai ia menimpa kalian disebabkan karena kekafiran kalian terhadapnya. Tidak ada tuhan untuk berhak di sembah kecuali Allah semata. Dia lah yang maha esa dalam keagungan, nama-nama, sifat-sifat dan perbuatan-perbuatanNya, juga maha perkasa yang menundukan dan mengalahkan segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Katakanlah -wahai Muhammad- kepada orang-orang kafir dari kaummu, “Sesungguhnya aku hanyalah seorang pemberi peringatan kalian dari azab Allah yang bisa Dia timpakan kepada kalian karena kekufuran kalian kepada Allah dan pendustaan kalian kepada utusan-utusan-Nya. Tidak ada Tuhan yang berhak disembah kecuali Allah semata. Dia lah pemilik tunggal keagungan, sifat-sifat dan nama-nama-Nya. Dia lah yang Mahakuat yang mengalahkan segala sesuatu, segala sesuatu tunduk kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65-66. Hai Muhammad, katakanlah kepada kaummu: “Aku adalah rasul yang diutus Allah kepada kalian untuk memperingatkan kalian dari azab-Nya yang akan menimpa kalian akibat kekafiran dan pendustaan kalian, dan untuk menyampaikan kepada kalian bahwa tidak ada Tuhan yang berhak disembah dan ditaati melainkan Tuhan Yang Esa, yaitu Allah; Dia Maha Kuasa, Pemilik dan pengatur langit, bumi, dan seisinya; Dia Maha Perkasa dalam kerajaan-Nya dan dalam memberi balasan, Maha Mengampuni dosa hamba-Nya yang bertaubat.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. wahai Nabi, katakanlah pada kaum musyrikin: sesungguhnya aku telah memberikan peringatan kepada kalian tentang adzab Allah dan kalian tetap menyekutukan Allah, dan padahal tidak ada Tuhan yang berhak disembah kecuali Allah yang Maha Esa dan tidak ada sekutu bagiNya. Yang Maha Kuasa dari semua musuhNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya aku hanya seorang pemberi peringatan, tidak ada tuhan selain Allah Yang Maha Esa lagi Maha Mengalahkan} yang mengalahkan dan menaklukkan segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. “Katakanlah,” wahai rasul kepada mereka-mereka yang mendustakan, jika mereka meminta apa yang tidak kamu miliki wewenang padanya dan tidak pada kekuasaanmu, “SEsungguhnya aku hanya seorang pemberi peringatan.” Inilah segala apa yang aku miliki. Adapun semua wewenang urusan adalah milik Allah, sedangkan saya hanyalah menyuruh kalian, melarang kalian dari segala keburukan. Barangsiapa yang mau mengikutinya, maka keuntungannya kembali kepada dirinya sendiri, dan siapa saja yang sesat, maka kesesatannya menimpa dirinya sendiri. “Dan sekali-kali tidak ada sembahan yang haq melainkan Allah.” Maksudnya, tiada seorang pun yang berhak dipertuhankan dan disembah dengan haq kecuali Allah “Yang Maha Esa dan Maha Mengalahkan.” Ini adalah sebuah penegasan tentang ketuhananNya berdasarkan argument yang tak terbantahkan, yaitu keesaanNya dan keperkasaanNya atas segala sesuatu, sebab keperkasaan itu memastikan keesaan. Maka tidak akan ada dua yang tidak terkalahkan yang sama di dalam keperkasaannya selama-lamanya. Maka, yang mengalahkan sesuatu itu, Dialah Yang Esa, yang tidak ada tandinganNya, dan Dia-lah semata yang berhak disembah sebagaimana halnya hanya Dia yang Maha Mengalahkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 65: (Katakanlah) hai Muhammad kepada orang-orang kafir Mekah! (\"Sesungguhnya aku hanya seorang pemberi peringatan) seorang yang memperingatkan kalian dengan neraka (dan sekali-kali tidak ada Tuhan selain Allah Yang Maha Esa lagi Maha Mengalahkan) semua makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada orang-orang yang mendustakan ketika mereka menuntut dari Beliau sesuatu yang tidak Beliau miliki atau yang bukan urusannya. Yakni inilah yang aku miliki, adapun permintaanmu maka itu urusan Allah Azza wa Jalla, aku hanya bisa menyuruh dan melarang kamu, mendorong berbuat baik dan mentarhib (menakut-nakuti) terhadap perbuatan buruk, barang siapa yang mendapat petunjuk, maka itu untuk kebaikan dirinya dan barang siapa yang tersesat, maka madharatnya hanya menimpa dirinya. Ayat ini merupakan penguatan terhadap keberhakan Allah saja untuk diibadahi, yaitu karena Dia Maha Esa dan karena Dia Mahaperkasa; Dia berkuasa terhadap segala sesuatu dan mengalahkan segala sesuatu. Di samping itu, Dia juga Rabb (Pencipta, Pengatur, Pemberi rezeki dan Penguasa) langit, bumi dan apa saja yang ada di antara keduanya sebagaimana dalam ayat selanjutnya. Ini pun sama menunjukkan keberhakan Allah saja untuk diibadahi. Selain itu, Dia juga Al ‘Aziz, yaitu yang memiliki kekuatan, di mana dengan kekuatan-Nya Dia mampu menciptakan makhluk-makhluk yang besar. Dia juga Maha Pengampun, Dia mengampuni semua dosa yang besar maupun yang kecil bagi orang yang kembali kepada-Nya dan berhenti melakukan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 65",
    "description": "Sebetulnya para penghuni neraka itu di dunia dahulu telah menerima peringatan para rasul untuk mengesakan Allah dan menaati aturan-Nya. Katakanlah, wahai nabi Muhammad kepada kaum musyrik, 'se-sungguhnya aku hanya seorang pemberi peringatan. Adalah tugasku untuk menyampaikan kepadamu ancaman-Nya yang pedih bagi orang-orang yang mengingkari-Nya. Karena itu, yakinilah bahwa tidak ada tuhan yang berhak disembah selain Allah. Dialah yang maha esa dan tidak ada sekutu bagi-Nya, mahaperkasa sehingga dapat mengalahkan siapa pun yang menentang-Nya. 66. Dialah tuhan pencipta langit dan bumi dan apa yang ada di antara ke-duanya. Dia menciptakan, menguasai, mengatur, mengawasi, dan me-melihara kelangsungan ciptaan-Nya. Dialah yang mahaperkasa dalam mengatur kerajaan-Nya, maha pengampun atas dosa-dosa hamba yang memohon ampunan-Nya. '."
  }
]