[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "67-68 Katakanlah (wahai rasul) kepada kaummu ”sesungguhnya al-qur’an ini adalah kebaikan yang besar manfaatnya, tetapi kalian justru melalaikannya dan berpaling darinya, kalian tidak mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Katakanlah -wahai Rasul- kepada orang-orang yang mendustakan itu, “Sesungguhnya Al-Qur`ān adalah kitab yang memiliki urusan yang besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67-68. Hai Muhammad, katakanlah kepada kaummu: “Al-Qur’an ini merupakan berita yang membawa manfaat dan petunjuk, namun kalian lalai dan berpaling darinya, sehingga kalian tidak mengetahui kebaikannya dan tidak mengamalkannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. قُلْ هُوَ نَبَؤٌا۟ عَظِيمٌ (Katakanlah: “Berita itu adalah berita yang besar) Yakni siksaan yang telah aku peringatkan kepadamu dan keesaan Allah yang telah aku jelaskan kepada kalian merupakan berita yang sangat besar dan agung, oleh sebab itu hargailah berita itu dan jangan kalian anggap remeh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67 – 68 katakanlah wahai Nabi: ajaran Tauhid dan berilah peringatan adanya siksa. Adalah berita yang sangat penting. “Sedang kalian semua berpaling darinya”, itu adalah teguran bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “(Al-Qur’an) itu berita besar} Al-Qur’an itu adalah kabar yang besar manfaatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67-68. “Katakanlah” kepada mereka, seraya mempertakuti mewanti-wanti, membangkitkan dan memberikan peringatan kepada mereka, “Berita itu adalah berita yang besar.” Artinya, apa yang saya informasikan kepada kalian ini, seperti kebangkitan, dihidupkan kembali sesudah mati dan pemberian balasan atas amal-amal adalah merupakan berita yang sangat agung yang pantas diperhatikan dengan serius dan tidak boleh diabaikan. Akan tetapi “kamu berpaling darinya” hingga seakan-akan kalian tidak mempercayai bahwa di hadapan kalian ada hisab (perhitungan amal perbuatan), hukuman, ataupun pahala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 67: (Katakanlah) kepada mereka! (\"Berita itu adalah berita besar.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kepada mereka untuk menakut-nakuti dan menyadarkan mereka. Maksudnya apa yang diberitakan dalam Al Qur’an seperti kebangkitan dan pembalasan terhadap amal adalah berita yang besar yang harus diberikan perhatian besar dan tidak meremehkan atau melalaikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 67",
    "description": "67-68. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir, 'ajakanku mengesakan Allah dan peringatanku tentang siksa akhirat itu adalah berita besar yang selama ini kamu berpaling darinya, wahai orang-orang kafir. Berita dalam Al-Qur'an itu benar adanya, tetapi ba-Nyak manusia mengingkari. '67-68"
  }
]