[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "67-68 Katakanlah (wahai rasul) kepada kaummu ”sesungguhnya al-qur’an ini adalah kebaikan yang besar manfaatnya, tetapi kalian justru melalaikannya dan berpaling darinya, kalian tidak mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Namun kalian malah berpaling dari berita besar ini, kalian tidak sudi menoleh kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. أَنتُمْ عَنْهُ مُعْرِضُونَ(yang kamu berpaling daripadanya) Ini merupakan olokan bagi mereka karena mereka berpaling dari berita itu serta tidak memikirkannya agar mereka dapat mengetahui kebenarannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67 – 68 katakanlah wahai Nabi: ajaran Tauhid dan berilah peringatan adanya siksa. Adalah berita yang sangat penting. “Sedang kalian semua berpaling darinya”, itu adalah teguran bagi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67-68. “Katakanlah” kepada mereka, seraya mempertakuti mewanti-wanti, membangkitkan dan memberikan peringatan kepada mereka, “Berita itu adalah berita yang besar.” Artinya, apa yang saya informasikan kepada kalian ini, seperti kebangkitan, dihidupkan kembali sesudah mati dan pemberian balasan atas amal-amal adalah merupakan berita yang sangat agung yang pantas diperhatikan dengan serius dan tidak boleh diabaikan. Akan tetapi “kamu berpaling darinya” hingga seakan-akan kalian tidak mempercayai bahwa di hadapan kalian ada hisab (perhitungan amal perbuatan), hukuman, ataupun pahala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 68: (Yang kalian berpaling darinya) dari Alquran yang aku beritakan dan aku datangkan kepada kalian; di dalamnya terdapat hal-hal yang tidak dapat diketahui, melainkan hanya dengan jalan wahyu. Yang dimaksud dengan berita yang besar itu ialah:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, seakan-akan di hadapan kamu tidak ada hisab, tidak ada siksa dan pahala. Jika kamu meragukan ucapanku dan meragukan beritaku, maka sesungguhnya aku telah memberitahukan kamu berita-berita yang aku tidak memiliki ilmu terhadapnya dan aku tidak mempelajarinya dari kitab. Oleh karena itu, berita yang aku sampaikan tanpa ada tambahan dan tanpa dikurangi merupakan bukti yang besar yang menunjukkan kebenaranku dan sebagi dalil bahwa yang aku bawa adalah benar. Oleh karena itu, lanjutan ayatnya adalah, “Aku tidak mempunyai pengetahuan sedikit pun tentang Al Mala'ul A'la (malaikat) itu ketika mereka berbantah-bantahan.” Kalau bukan karena pengajaran dari Allah kepadaku dan wahyu yang diberikan-Nya kepadaku tentu aku tidak dapat memberitahukan hal itu. Oleh karena itu, ayat berikutnya lagi adalah, “Yang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 68",
    "description": "67-68. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir, 'ajakanku mengesakan Allah dan peringatanku tentang siksa akhirat itu adalah berita besar yang selama ini kamu berpaling darinya, wahai orang-orang kafir. Berita dalam Al-Qur'an itu benar adanya, tetapi ba-Nyak manusia mengingkari. '69-70. Katakanlah pula kepada mereka, 'aku tidak mempunyai pengetahuan sedikit pun tentang al-mala'ul a'l' itu, yaitu malaikat, ketika mereka berbantah-bantahan terhadap keputusan Allah terkait penciptaan nabi adam sebagai khalifah di bumi. Yang diwahyukan kepadaku hanyalah kepastian bahwa aku hanyalah seorang rasul pemberi peringatan dan petunjuk yang nyata tentang adanya siksa di akhirat bagi orang-orang yang mengingkari para utusan Allah. '."
  }
]