[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku tidak memiliki ilmu tentang perselisihan malaikat langit tentang urusan penciptaan adam, kalau sekiranya Allah tidak menyampaikannya, kepadaku dan mewahyukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Aku tidak mengetahui pembicaraan di antara para malaikat tentang urusan penciptaan Adam seandainya Allah tidak mewahyukan kepadaku dan memberitahuku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69-70. Aku tidak memiliki pengetahuan tentang perselisihan para malaikat yang ada di langit mengenai penciptaan Adam kalaulah bukan karena ilmu dari Allah yang disampaikan kepadaku melalui wahyu, agar aku memberi peringatan kepada kalian dari azab Allah dan menjelaskan kepada kalian syariat dan agama-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. مَا كَانَ لِىَ مِنْ عِلْمٍۭ بِالْمَلَإِ الْأَعْلَىٰٓ إِذْ يَخْتَصِمُونَ (Aku tiada mempunyai pengetahuan sedikitpun tentang al mala’ul a’la (malaikat) itu ketika mereka berbantah-bantahan) Yakni sebelum diwahyukan kepadaku, aku sama sekali tidak mengetahui apa yang diperselisihkan para malaikat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. aku tidak mengetahui sedikitpun tentang pengetahuan malaikat di langit ketika mereka berdebat tentang Adam AS, yang Allah khabarkan pada mereka akan menjadi khalifah (pemimpin) di bumi. (min) menunjukkan arti universal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak mempunyai pengetahuan sedikit pun tentang malaikat langit} malaikat langit {ketika mereka berbantah-bantahan} berdebat tentang perkara penciptaan Adam AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-70. Jika kalian ragu terhadap perkataanku dan kalian meragukan informasi dariku, maka sesungguhnya aku hanya menyampaikan informasi-informasi yang aku sendiri tidak mempunyai pengetahuannya dan tidak pula aku pelajari dari dari satu kitab mana pun. Jadi, penyampaian informasi yang aku sampaikan ini sebagaimana adanya, tanpa tambahan ataupun pengurangan, adalah merupakan saksi yang paling besar bagi kejujuranku dan bukti yang paling tepat atas kebenaran apa yang aku bawa kepada kalian ini. Maka dari itu Allah berfirman (memerintahkan RasulNya) “Aku tiada mempunyai pengetahuan sedikitpun tentang al-mala’ul’a’la itu,” maksudnya, para malaikat, “ketika mereka berbantah-bantahan,” kalau saja bukan karena Allah menginformasikannya dan mewahyukannya kepadaku. Dan karena itu ayat berikutnya mengatakan, “Tidak diwahyukan kepadaku, melainkan bahwa sesungguhnya aku hanyalah seorang pemberi peringatan yang nyata,” artinya, yang jelas lagi nyata peringatannya. Maka tidak ada pemberi peringatan yang lebih jelas daropada perintah yang disampaikan oleh Rasululah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 69: (Aku tiada mempunyai pengetahuan sedikit pun tentang Al-Mala'ul A'la) yakni para malaikat itu (ketika mereka berbantahbantahan) tentang perihal Nabi Adam, ketika Allah berfirman, 'Sesungguhnya Aku hendak menjadikan seorang khalifah di muka bumi...' (Q.S. Al-Baqarah, 30)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti tentang penciptaan Adam ‘alaihis salam, ketika Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya Aku hendak menjadikan seorang khalifah di bumi.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 69",
    "description": "69-70. Katakanlah pula kepada mereka, 'aku tidak mempunyai pengetahuan sedikit pun tentang al-mala'ul a'l' itu, yaitu malaikat, ketika mereka berbantah-bantahan terhadap keputusan Allah terkait penciptaan nabi adam sebagai khalifah di bumi. Yang diwahyukan kepadaku hanyalah kepastian bahwa aku hanyalah seorang rasul pemberi peringatan dan petunjuk yang nyata tentang adanya siksa di akhirat bagi orang-orang yang mengingkari para utusan Allah. '69-70"
  }
]