[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7 lalu para tokoh dan para pembesar kaum berusaha mendorong mereka untuk mempertahankan kesyirikan dan memperjuangkan keragaman tuhan-tuhan. Mereka berkata” apa yang dibawa oleh rasul tersebut adalah sesuatu yang direncanakan dengan tujuan meraih kepemimpinan dan kedudukan. kami belum pernah dengar apa yang didakwahkan itu dari kalangan leluhur kami (orang-orang quraisy) dan dalam agama nasrani. Apa yang dia sampaikan hanyalah kedustaan dan kebohongan. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Kami tidak mendengar apa yang didakwahkan oleh Muhammad tentang mentauhidkan Allah dalam ajaran nenek moyang kami, tidak pula dalam agama Isa -'alaihissalām-. Kami tidak mendengar darinya selain kebohongan dan bualan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. مَا سَمِعْنَا بِهٰذَا فِى الْمِلَّةِ الْاٰخِرَةِ (Kami tidak pernah mendengar hal ini dalam agama yang terakhir) Yakni agama Nasrani. إِنْ هٰذَآ إِلَّا اخْتِلٰقٌ(ini tidak lain hanyalah (dusta) yang diada-adakan) Yakni hanyalah kebohongan yang dibuat-buat Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Kami belum pernah mendengar ajaran pengesaan tuhan ini bahkan dari orang Nasrani, mereka berkata: Sesungguhnya Allah itu yang ketiga dari tiga tuhan. Sehingga pernyataan Muhammad hanyalah dusta semata."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak pernah mendengar hal ini dalam agama yang terakhir} agama Isa, Nasrani, yaitu agama paling akhir {ini tidak lain kecuali sesuatu yang dibuat-buat} dusta dan sesuatu yang dibuat-buat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Kami tidak pernah mendengar hal ini,” artinya paham yang dikatakannya dan agama yang diserukannya “dalam agama yang terakhir,” maksudnya, pada masa terakhir, kita tidak menjumpainya sebagai anutan bapak-bapak kita, dan tidak pula bapak-bapak kita menjumpainya dari nenek moyang mereka. Maka teruslah kalian berpegang kepada apa yang dianut oleh bapak-bapak kalian, sebab itulah yang haq. Sedangkan apa yang diserukan oleh Muhammad itu hanyalah perbuatan mengada-ada yang dilakukannya dan kedustaan yang direkayasanya! Itu juga syubhat (kerancuan) dan sejenis dengan syubhat mereka yang pertama, di mana mereka menolak kebenaran dengan sesuatu yang bukan argument untuk menolak pendapat yang sangat sederhana, yaitu pendapat yang berlawanan dengan paham yang dianut oleh bapak-bapak mereka yang sesat. Di mana yang bisa menunjukkan kepalsuannya?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 7: (Kami tidak pernah mendengar hal ini dalam agama yang terakhir) maksudnya, agama Nabi Isa. (Tiada lain) tidak lain (ini hanyalah dusta yang diada-adakan) hal yang dibuat-buat saja"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni seruan kepada tauhid. Yang dimaksud oleh orang-orang kafir Quraisy dengan agama yang terakhir ialah agama Nasrani yang menigakan tuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 7",
    "description": "Kami tidak pernah mendengar hal ini dalam agama yang terakhir, yaitu nasrani, yang meyakini ajaran trinitas. Ajaran tauhid ini tidak lain ha-Nyalah kedustaan yang diada-adakan oleh Muhammad. 8. Mengapa Al-Qur'an itu diturunkan kepada Muhammad padahal dia berasal dari kalangan jelata, bukan kepada orang terpandang di antara kita'' (lihat pula: surah az-zukhruf/43: 31). Allah menegaskan, 'sebenarnya mereka ragu-ragu terhadap Al-Qur'an yang turun dari sisi-ku karena kedengkian hati mereka, tetapi mereka belum merasakan azab-ku atas keingkaran mereka. Kelak mereka pasti akan merasakannya. \"."
  }
]