[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak mewahyukan kepadaku berupa ilmu yang sebelumnya belum aku ketahui karena aku adalah pemberi peringatan kepada kalian dari azabnya, juga penjelas syariatNya kepada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Allah mewahyukan kepadaku apa yang telah Dia berikan karena aku adalah pemberi peringatan kepada kalian dari azab-Nya dengan peringatan yang nyata.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. apa yang diwahyukan kepadaku, adalah bahwa aku hanyalah seorang pemberi peringatan adanya siksa (adzab), peringatan yang nyata."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak diwahyukan kepadaku, kecuali aku hanyalah seorang pemberi peringatan yang nyata”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69-70. Jika kalian ragu terhadap perkataanku dan kalian meragukan informasi dariku, maka sesungguhnya aku hanya menyampaikan informasi-informasi yang aku sendiri tidak mempunyai pengetahuannya dan tidak pula aku pelajari dari dari satu kitab mana pun. Jadi, penyampaian informasi yang aku sampaikan ini sebagaimana adanya, tanpa tambahan ataupun pengurangan, adalah merupakan saksi yang paling besar bagi kejujuranku dan bukti yang paling tepat atas kebenaran apa yang aku bawa kepada kalian ini. Maka dari itu Allah berfirman (memerintahkan RasulNya) “Aku tiada mempunyai pengetahuan sedikitpun tentang al-mala’ul’a’la itu,” maksudnya, para malaikat, “ketika mereka berbantah-bantahan,” kalau saja bukan karena Allah menginformasikannya dan mewahyukannya kepadaku. Dan karena itu ayat berikutnya mengatakan, “Tidak diwahyukan kepadaku, melainkan bahwa sesungguhnya aku hanyalah seorang pemberi peringatan yang nyata,” artinya, yang jelas lagi nyata peringatannya. Maka tidak ada pemberi peringatan yang lebih jelas daropada perintah yang disampaikan oleh Rasululah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 70: (Tidak) tiada (diwahyukan kepadaku, melainkan bahwa sesungguhnya aku) yakni aku ini (hanyalah seorang pemberi peringatan yang nyata\") artinya nyata peringatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, tidak ada peringatan yang lebih jelas melebihi peringata Beliau shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 70",
    "description": "69-70. Katakanlah pula kepada mereka, 'aku tidak mempunyai pengetahuan sedikit pun tentang al-mala'ul a'l' itu, yaitu malaikat, ketika mereka berbantah-bantahan terhadap keputusan Allah terkait penciptaan nabi adam sebagai khalifah di bumi. Yang diwahyukan kepadaku hanyalah kepastian bahwa aku hanyalah seorang rasul pemberi peringatan dan petunjuk yang nyata tentang adanya siksa di akhirat bagi orang-orang yang mengingkari para utusan Allah. '71-72. Usai menafikan pengetahuan rasulullah menyangkut al-mala'ul-a'la kecuali apa yang sudah diwahyukan oleh Allah, pada ayat berikut Allah lalu menguraikan sekelumit tentang al-mala'ul-a'la dan penciptaan nabi adam. Ingatlah ketika tuhanmu berfirman kepada malaikat, 'sesungguhnya aku akan menciptakan manusia adam sebagai khalifah di bumi. Aku menciptakannya dari tanah bercampur air. Kemudian, apabila telah aku sempurnakan kejadian fisik-Nya dengan anggota tubuh dan bentuk yang sempurna dan aku tiupkan roh ciptaan-ku kepadanya, maka tunduklah kamu semua dengan bersujud penuh hormat kepadanya, bukan sujud penghambaan dan pengagungan."
  }
]