[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "71-72 Katakanlah kepada mereka (wahai rasul), saat tuhanmu berfirman kepada malaikat “sesungguhnya Aku akan menciptakan manusia dari tanah basah. Kemudian apabila Aku telah menyempurnakan jasad dan bentuk penciptaanNya dan meniupkan arwah kepadanya, sehingga dia hidup maka sujudlah kepadanya,” sebagai penghormatan dan penghargaan, bukan sujud pengagungan dan ibadah, karena ibadah hanya untuk Allah semata. Dan Allah telah mengharamkan sujud demi menghormati dalam syariat islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Ingatlah manakala Rabbmu berfirman kepada para malaikat, “Sesungguhnya Aku akan menciptakan manusia dari tanah, yaitu Adam -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71-74. Hai Muhammad, sampaikanlah kepada kaummu kisah penciptaan Adam, ketika Tuhanmu berfirman kepada para malaikat: “Aku akan menciptakan manusia dari tanah, jika aku telah menyempurnakan penciptaannya, meniupkan ruh dari-Ku kepadanya, dan mulai hidup; maka bersujudlah kalian kepadanya sebagai penghormatan baginya, bukan sujud untuk menyembah.” Maka para malaikat bersujud seluruhnya kepadanya untuk mentaati perintah Allah; kecuali iblis yang enggan bersujud karena kesombongan dan keangkuhannya, dan pada ilmu Allah telah diketahui bahwa iblis termasuk orang-orang yang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. إِذْ قَالَ رَبُّكَ لِلْمَلٰٓئِكَةِ إِنِّى خٰلِقٌۢ بَشَرًا مِّن طِينٍ ((Ingatlah) ketika Tuhanmu berfirman kepada malaikat: “Sesungguhnya Aku akan menciptakan manusia dari tanah”) Ini merupakan perselisihan antar malaikat yang disebutkan secara umum sebelumnya, dan di sini Allah menyebutkannya dengan lebih terperinci. Yang dimaksud dengan manusia adalah Adam dan para keturunannya. Terdapat pendapat lain mengatakan bahwa perselisihan para malaikat ini tentang siapa yang akan menjadi khalifah di bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. ketika Tuhanmu berkata pada malaikat: aku akan menciptakan manusia, yaitu Adam dan keturunannya, dari tanah. Dialah yang menjelaskan percakapan di ‘arsy"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Tuhanmu berfirman kepada malaikat,“Sesungguhnya Aku akan menciptakan manusia dari tanah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-72. Kemudian Allah menjelaskan perbantahan para malaikat tersebut seraya berfirman, “Ketika Rabbmu berfirman kepada malaikat” sebagai informasi, “SEsungguhnya Aku akan menciptakan manusia dari tanah.” Maksudnya, materinya dari tanah liat, “Maka apabila telah Kusempurnakan,” maksudnya, menyempurnakan jasadnya dan telah terbentuk, “dan Kutiupkan kepadanya ruhKu, maka hendaklah kamu tersungkur dengan sujud kepadanya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 71: Ingatlah (ketika Rabbmu berfirman kepada malaikat, \"Sesungguhnya Aku akan menciptakan manusia dari tanah) yaitu Adam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan tentang perbantahan para malaikat, lihat pula surah Al Baqarah: 30. Yaitu Adam ‘alaihis salam bapak manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 71",
    "description": "71-72. Usai menafikan pengetahuan rasulullah menyangkut al-mala'ul-a'la kecuali apa yang sudah diwahyukan oleh Allah, pada ayat berikut Allah lalu menguraikan sekelumit tentang al-mala'ul-a'la dan penciptaan nabi adam. Ingatlah ketika tuhanmu berfirman kepada malaikat, 'sesungguhnya aku akan menciptakan manusia adam sebagai khalifah di bumi. Aku menciptakannya dari tanah bercampur air. Kemudian, apabila telah aku sempurnakan kejadian fisik-Nya dengan anggota tubuh dan bentuk yang sempurna dan aku tiupkan roh ciptaan-ku kepadanya, maka tunduklah kamu semua dengan bersujud penuh hormat kepadanya, bukan sujud penghambaan dan pengagungan"
  }
]