[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "71-72 Katakanlah kepada mereka (wahai rasul), saat tuhanmu berfirman kepada malaikat “sesungguhnya Aku akan menciptakan manusia dari tanah basah. Kemudian apabila Aku telah menyempurnakan jasad dan bentuk penciptaanNya dan meniupkan arwah kepadanya, sehingga dia hidup maka sujudlah kepadanya,” sebagai penghormatan dan penghargaan, bukan sujud pengagungan dan ibadah, karena ibadah hanya untuk Allah semata. Dan Allah telah mengharamkan sujud demi menghormati dalam syariat islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Bila Aku telah menyempurnakan penciptaannya dan membaguskan bentuknya, Aku meniupkan padanya dari ruh-Ku, maka sujudlah kalian kepadanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. فَإِذَا سَوَّيْتُهُۥ (Maka apabila telah Kusempurnakan kejadiannya) Yakni ketika Allah menciptakannya dengan bentuk manusia dan anggota badannya mulai sempurna. وَنَفَخْتُ فِيهِ مِن رُّوحِى (dan Kutiupkan kepadanya roh (ciptaan)Ku) Yakni dari ruh yang Aku miliki dan bukan milik selain-Ku. Kemudian Aku menjadikannya hidup yang sebelumnya hanya berupa sesuatu yang mati. فَقَعُوا۟ لَهُۥ سٰجِدِينَ (maka hendaklah kamu tersungkur dengan bersujud kepadanya”) Ini merupakan perintah untuk bersujud sebagai penghormatan dan bukan sebagai ibadah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. ketika Aku (Allah) telah menciptakannya dan menyempurnakannya, para malaikat bersujud kepada Adam dengan penuh penghormatan dan kemuliaan, dan wajib bersujud"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila Aku telah menyempurnakannya} menyempurnakan penciptaannya dan menyeimbangkan bentuknya {dan meniupkan ruh (ciptaan)Ku ke dalamnya, maka tunduklah kepadanya dalam keadaan bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-72. Kemudian Allah menjelaskan perbantahan para malaikat tersebut seraya berfirman, “Ketika Rabbmu berfirman kepada malaikat” sebagai informasi, “SEsungguhnya Aku akan menciptakan manusia dari tanah.” Maksudnya, materinya dari tanah liat, “Maka apabila telah Kusempurnakan,” maksudnya, menyempurnakan jasadnya dan telah terbentuk, “dan Kutiupkan kepadanya ruhKu, maka hendaklah kamu tersungkur dengan sujud kepadanya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 72: (Maka apabila telah Kusempurnakan kejadiannya) telah sempurna kejadiannya (dan Kutiupkan) Kualirkan (kepadanya roh ciptaan-Ku) sehingga ia menjadi hidup. Dimudhafkannya lafal ruh kepada Allah dimaksud untuk memuliakan Nabi Adam. Roh adalah tubuh yang lembut dan tidak kelihatan oleh mata, yang membuat manusia dapat hidup karena memasuki tubuhnya (maka hendaklah kalian bersungkur dengan sujud kepadanya\") sujud penghormatan dengan cara membungkukkan badan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga menjadi hidup. Disandarkan ruh kepada Allah Subhaanahu wa Ta'aala adalah sebagai pemuliaan kepada Adam alaihis salam, sebagaimana disandarkannya kata bait (rumah) kepada Allah sehingga menjadi Baitullah (rumah Allah), yang menunjukkan keistimewaan rumah tersebut. Yakni sujud penghormatan, bukan sujud ibadah. Maka para malaikat mempersiapkan diri mereka untuk itu karena mengikuti perintah Tuhan mereka dan sebagai penghormatan kepada Adam ‘alaihis salam. Ketika penciptaannya telah selesai baik badan maupun ruhnya dan Allah hendak menguji kepandaian Adam dan malaikat dalam hal ilmu, maka tampak jelaslah kepandaian Adam daripada malaikat, dan Allah Subhaanahu wa Ta'aala memerintahkan para malaikat untuk sujud."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 72",
    "description": "71-72. Usai menafikan pengetahuan rasulullah menyangkut al-mala'ul-a'la kecuali apa yang sudah diwahyukan oleh Allah, pada ayat berikut Allah lalu menguraikan sekelumit tentang al-mala'ul-a'la dan penciptaan nabi adam. Ingatlah ketika tuhanmu berfirman kepada malaikat, 'sesungguhnya aku akan menciptakan manusia adam sebagai khalifah di bumi. Aku menciptakannya dari tanah bercampur air. Kemudian, apabila telah aku sempurnakan kejadian fisik-Nya dengan anggota tubuh dan bentuk yang sempurna dan aku tiupkan roh ciptaan-ku kepadanya, maka tunduklah kamu semua dengan bersujud penuh hormat kepadanya, bukan sujud penghambaan dan pengagungan. 73-74. Sempurnalah kejadian adam, lalu dengan serta-merta para malaikat itu bersujud semuanya sebagai bentuk penghormatan kepadanya dan bukti ketaatan kepada perintah Allah. Mereka semua bersujud, kecuali iblis; ia enggan bersujud di hadapan adam karena menyombongkan diri dan enggan menaati kepada Allah, dan ia termasuk golongan yang kafir."
  }
]