[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "73-74 maka semua malaikat sujud kepadanya karena mereka tunduk dan taat kepada Allah, kecuali iblis, dia tidak sujud karena kesembongan dan ketinggian hatinya dan dia termasuk ke dalam golongan orang-orang yang kafir dalam ilmu Allah swt,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Kecuali Iblis, dia menyombongkan diri, menolak untuk sujud. Karena kesombongannya di depan perintah Rabbnya itu maka dia termasuk hamba-hamba yang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. إِلَّآ إِبْلِيسَ (kecuali iblis) Dia termasuk dalam jenis jin, akan tetapi dia ketika itu bersifat seperti sifat-sifat malaikat sehingga dia digolongkan bersama para malikat. اسْتَكْبَرَ(dia menyombongkan diri) Yakni dia enggan untuk bersujud karena kejahilannya bahwa perintah itu adalah ketaatan kepada Allah. وَكَانَ مِنَ الْكٰفِرِينَ (dan adalah dia termasuk orang-orang yang kafir) Kesombongannya adalah kesombongan yang menjerumuskan kepada kekafiran, oleh sebab itu dia menjadi termasuk orang-orang kafir dengan keengganannya menjalankan perintah Allah dan kesombongannya dari mentaati-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. kecuali iblis yang sombong dan menolak bersujud, karena dengan kesombongannya dan menolak perintah Allah, iblis tergolong kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali Iblis. Ia sombong dan termasuk golongan orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73-74. Maka para malaikat yang mulia itu menundukkan dirinya untuk hal tersebut, ketika penciptaan manusia itu telah sempurna dan telah ditiupkan ruh padanya, sebagai sikap patuh terhadap Rabb mereka dan sebagai sikap hormat kepada Adam. Setelah sempurna penciptaan jasad dan ruhnya dan setelah Allah menguji Adam dan para malaikat dalam ilmu pengetahuan, dan setelah tampak keunggulan Adam atas mereka, maka Allah memerintahkan mereka untuk sujud kepada Adam. Maka mereka pun sujud “semuanya, kecuali iblis,” ia tidak mau sujud, “dia menyombongkan diri” terhadap perintah Rabbnya, dan menyombongkan diri terhadap Nabi Adam, “dan dia termasuk orang-orang yang kafir” dalam ilmu Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 74: (Kecuali iblis) dia adalah bapaknya jin yang dahulunya campur bersama dengan malaikat (dia menyombongkan diri dan adalah dia termasuk orang-orang yang kafir) menurut ilmu Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap perintah Tuhannya dan terhadap Adam alaihis salam. Dalam ilmu Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 74",
    "description": "73-74. Sempurnalah kejadian adam, lalu dengan serta-merta para malaikat itu bersujud semuanya sebagai bentuk penghormatan kepadanya dan bukti ketaatan kepada perintah Allah. Mereka semua bersujud, kecuali iblis; ia enggan bersujud di hadapan adam karena menyombongkan diri dan enggan menaati kepada Allah, dan ia termasuk golongan yang kafir. 75-76. Mengetahui hal tersebut Allah bertanya, 'wahai iblis, apakah yang menghalangi kamu sujud dengan hormat kepada adam yang telah aku ciptakan dengan kekuasaan-ku dan aku muliakan' apakah kamu menyombongkan diri dengan mengabaikan perintah-ku atau kamu merasa termasuk golongan yang lebih tinggi dan terhormat daripada adam'' iblis berkata, 'aku lebih baik daripadanya, karena engkau ciptakan aku dari api, sedangkan dia engkau ciptakan dari tanah. ' iblis mengira api lebih baik daripada tanah karena api selalu membumbung sedangkan tanah selalu di bawah (lihat pula: surah al-a'r'f/7: 12)."
  }
]