[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada iblis “apa yang menghalangimu untuk bersujud kepada adam yang telah aku muliakan dengan menciptakannya dengan kedua tanganku? apakah kamu menyombongkan diri kepada adam atau kamu termasuk golongan yang menyombongkan diri di depan tuhanmu?” ayat ini menetapkan sifat ”dua tangan” bagi Allah swt sesuai dengan yang layak bagi keagunganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Allah berfirman, “Wahai Iblis! Apa yang menghalangimu untuk sujud kepada Adam yang Aku ciptakan dengan kedua tangan-Ku? Apakah kesombongan menghalangimu untuk sujud atau karena kamu sebelumnya memang menyombongkan diri terhadap Rabbmu?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Allah berkata kepada Iblis: “Apa yang membuatmu enggan bersujud kepada orang yang aku muliakan dengan menciptakannya dengan tangan-Ku dan aku tiupkan ruh dari-Ku? Apakah kamu berlaku sombong terhadapnya, atau kamu termasuk orang-orang yang angkut terhadap Tuhanmu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. قَالَ يٰٓإِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَىَّ ۖ (Allah berfirman: “Hai iblis, apakah yang menghalangi kamu sujud kepada yang telah Ku-ciptakan dengan kedua tangan-Ku) Yakni apakah yang memalingkan dan menghalangimu untuk bersujud kepada Adam, padahal Aku-lah yang menciptakannya dengan kedua tangan-Ku tanpa perantara. أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ(Apakah kamu menyombongkan diri ataukah kamu (merasa) termasuk orang-orang yang (lebih) tinggi?”) Yakni apakah kamu sekarang masih enggan untuk bersujud, atau tetap termasuk orang-orang yang angkuh untuk melakukan itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Allah berkata pada iblis: hai iblis, apa yang membuatmu menolak untuk bersujud terhadap apa yang telah Aku ciptakan dari tanganKU (kuasaKU) dengan tanpa perantara, apakah sekarang kamu sombong untuk bersujud? Sedang kamu tak memiliki hak? Ataukah kamu tinggi hati terhadap apa yang telah ditetapkan untuk taat kepada Allah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman} Allah berfirman {“Wahai Iblis, apakah yang menghalangimu} apa yang menghalangi dan mencegahmu {untuk bersujud kepada yang telah Aku ciptakan dengan tanganKu. Apakah kamu menyombongkan diri} Apakah kamu sekarang enggan bersujud kepada Adam {atau termasuk golongan yang tinggi”} ataukah kamu termasuk golongn yang sebelumnya meremehkan Tuhanmu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Maka Allah berkata kepadanya sebagai celaan, “Apakah yang menghalangimu sujud kepada yang telah Kuciptakan dengan kedua TanganKu?” maksudnya, yang Aku muliakan, Aku hargai dan Aku istimewakan dengan keistimewaan ini; yang dengannya ia menjadi istimewa daripada seluruh makhluk, dan hal itu seharusnya tidak menimbulkan sikap sombong terhadapnya. “Apakah kamu menyombongkan diri” dalam keenggananmu itu, “ataukah kamu termasuk orang-orang yang lebih tinggi?”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 75: (Allah berfirman, \"Hai iblis! Apakah yang menghalangi kamu sujud kepada yang telah Kuciptakan dengan kedua tangan kekuasaan-Ku?) maksudnya, yang telah Aku atur penciptaannya secara langsung; ungkapan ini dimaksud memuliakan kedudukan Nabi Adam, karena sesungguhnya setiap makhluk diciptakan oleh Allah secara langsung. (Apakah kamu menyombongkan diri) sekarang sehingga kamu tidak mau bersujud kepadanya; Istifham atau kata tanya di sini menunjukkan makna cemoohan (ataukah kamu merasa termasuk orang-orang yang lebih tinggi?\") merasa tinggi diri sehingga kamu bersikap takabur tidak mau bersujud."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mencela Iblis. Yani yang telah Aku muliakan dan istimewakan dengan menciptakannya dengan kedua Tangan-Ku, di mana hal ini mengharuskan kamu untuk tidak sombong terhadapnya. Ibnu Jarir meriwayatkan dengan sanadnya yang sampai kepada Mujahid, di mana ia menceritakan dari Ibnu Umar, bahwa ia berkata: خَلَقَ اللهُ أَرْبَعَةً بِيَدِهِ: الْعَرْشَ، وَعَدْنَ، وَالْقَلَمَ، وآدَمَ ثُمَّ قَالَ لِكُلِّ شَيْءٍ كُنْ فَكَانَ “Allah menciptakan empat makhluk dengan Tangan-Nya, yaitu: Arsy, surga ‘Adn, Qalam (pena), dan Adam. Kemudian Dia berfirman kepada segala sesuatu, “Jadilah!” Maka jadilah ia.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 75",
    "description": "75-76. Mengetahui hal tersebut Allah bertanya, 'wahai iblis, apakah yang menghalangi kamu sujud dengan hormat kepada adam yang telah aku ciptakan dengan kekuasaan-ku dan aku muliakan' apakah kamu menyombongkan diri dengan mengabaikan perintah-ku atau kamu merasa termasuk golongan yang lebih tinggi dan terhormat daripada adam'' iblis berkata, 'aku lebih baik daripadanya, karena engkau ciptakan aku dari api, sedangkan dia engkau ciptakan dari tanah. ' iblis mengira api lebih baik daripada tanah karena api selalu membumbung sedangkan tanah selalu di bawah (lihat pula: surah al-a'r'f/7: 12)"
  }
]