[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis berkata menentang tuhannya ”aku tidak sujud kepadanya karena aku lebih baik darinya, dimana Engkau menciptakanku dari api dan Engkau mencitakannya dari tanah liat, dan api lebih baik dari tanah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Iblis menjawab, “Aku lebih baik dibandingkan Adam, Engkau menciptakanku dari api dan Engkau menciptakannya dari tanah. Api lebih unggul daripada tanah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76-78. Iblis menjawab pertanyaan Tuhannya: “Aku tidak bersujud kepadanya karena aku lebih mulia darinya, Engkau telah menciptakanku dari api sedangkan Engkau menciptakannya dari tanah, sedangkan api lebih baik daripada tanah.” Maka Allah berfirman: “Keluarlah dari surga dalam keadaan terhina dan terlaknat hingga hari kiamat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. قَالَ أَنَا۠ خَيْرٌ مِّنْهُ ۖ (Iblis berkata: “Aku lebih baik daripadanya) Makhluk terkutuk ini mengaku bahwa dirinya lebih baik daripada Adam. خَلَقْتَنِى مِن نَّارٍ وَخَلَقْتَهُۥ مِن طِينٍ (karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah”.) Dan dalam pengakuannya bahwa unsur api lebih mulia daripada unsur tanah, padahal pengakuan itu terdapat berbagai kesalahan. Namun bagaimanapun Allah telah memuliakan Adam dengan kemuliaan-Nya yang tidak dapat ditandingi oleh unsur apapun, demikian ini karena Allah telah menciptakannya dengan kedua tangan-Nya, meniupkan kepadanya ruh dari-Nya, dan memberinya ilmu dan hikmah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. iblis menjawab: aku lebih baik dari adam, Engkau menciptakanku dari api, sedang adam Kau ciptakan dari tanah liat, unsur api lebih tinggi dan lebih mulia dibandingkan tanah liat yang berlumpur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Aku lebih baik dari dia, Engkau telah menciptakanku dari api, dan Engkau menciptakannya dari tanah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. “Berkata” iblis dengan sikap menentang dan melawan Rabbnya, “Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.” Menurut anggapannya bahwa unsur api itu lebih baik daripada unsur tanah. Ini termasuk analogi yang rusak, karena sesungguhnya unsur api itu adalah materi kejahatan, kerusakan, keangkuhan, kesombongan, dan kehinaan, sedangkan unsur tanah adalah materi kematangan, tawadhu’ (rendah diri) dan tempat tumbuhnya berbagai pohon dan tanaman. Ia bisa mengalahkan api dan memadamkannya. Dan api selalu membutuhkan benda untuk bisa hidup, sedangkan tanah bisa berdiri sendiri. Itulah analogi dedengkot makhluk jahat yang dengannya ia menentang perintah langsung dari Allah, sudah sangat jelas sekali kebatilan dan kesesatannya. Lalu bagaimana menurut anda dengan analogi-analogi para murid-muridnya (pengikutnya) yang menentang kebenaran dengan analogi-analogi yang mereka buat? Sesungguhnya analogi-anogi yang mereka gunakan itu adalah lebih batil dan lebih sesat lagi daripada analogi iblis ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 76: (Iblis berkata, \"Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menentang Tuhannya. Ia menyangka bahwa api lebih baik daripada tanah. Ini adalah qiyas yang fasid (rusak), karena api adalah materi yang buruk, rusak, tinggi, tidak terarah, dan ringan. Sedangkan tanah adalah materi yang tenang, tawadhu’, menumbuhkan tumbuhan, dan ia mengalahkan api dan memadamkannya, sedangkan api butuh kepada materi yang menegakkannya, adapun tanah berdiri sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 76",
    "description": "75-76. Mengetahui hal tersebut Allah bertanya, 'wahai iblis, apakah yang menghalangi kamu sujud dengan hormat kepada adam yang telah aku ciptakan dengan kekuasaan-ku dan aku muliakan' apakah kamu menyombongkan diri dengan mengabaikan perintah-ku atau kamu merasa termasuk golongan yang lebih tinggi dan terhormat daripada adam'' iblis berkata, 'aku lebih baik daripadanya, karena engkau ciptakan aku dari api, sedangkan dia engkau ciptakan dari tanah. ' iblis mengira api lebih baik daripada tanah karena api selalu membumbung sedangkan tanah selalu di bawah (lihat pula: surah al-a'r'f/7: 12). 77-79. Mengetahui kedurhakaan iblis, Allah mengusirnya seraya berfirman, 'kalau begitu, keluarlah kamu dari surga! sesungguhnya kamu adalah makhluk yang terkutuk, terusir dari rahmat-ku, dan terlarang dari surga-ku. Dan sungguh, kutukan-ku tetap berlaku atasmu sampai hari pembalas-an, hari ketika seluruh perbuatan diperhitungkan dan dibalas. ' iblis berkata seraya memohon, 'ya tuhanku, karena engkau telah menjadikan aku makhluk-Mu yang terlaknat, maka tangguhkanlah kematianku dan izinkanlah aku hidup sampai pada hari mereka dibangkitkan supaya aku bisa menggoda mereka sepanjang hayat. '."
  }
]