[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-78 Allah berfirman kepadanya, ”keluarlah dari surga, sesungguhnya kamu terlaknat dan terusir. sesungguhnya pengusiranKu terhadapmu dan penjauhanmu dari rahmatKu berlaku atasmu sampai hari pembalasan dan perhitungan amal kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Sesungguhnya kamu terusir dari surga hingga hari pembalasan, yaitu hari Kiamat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَإِنَّ عَلَيْكَ لَعْنَتِىٓ إِلَىٰ يَوْمِ الدِّينِ (Sesungguhnya kutukan-Ku tetap atasmu sampai hari pembalasan) Yakni laknat itu akan berlanjut selama dunia ini masih ada, kemudian di akhirat dia akan mendapat berbagai azab, siksaan, dan kemurkaan dari Allah yang layak baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. atasmu laknatKu, Aku menolakmu dari RahmatKu sampai tiba hari pembalasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya laknatKu} pengusiranKu dan pengasinganKu dari rahmatKu {tetap atasmu sampai hari pembalasan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77-78. Maka Allah berfirman kepadanya, “Maka keluarlah kamu darinya,” maksudnya dari langit dan tempat yang mulia, “sesungguhnya kamu adalah yang diusir,” artinya yang dijauhkan dan disingkirkan. “Sesungguhnya kutukanKu tetap atasmu,” maksudnya, sesungguhnya pengusiran dan pengucilanKu terhadapmu “sampai Hari Pembalasan,” yakni, selama-lamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 78: (Sesungguhnya kutukan-Ku tetap atasmu sampai hari pembalasan\") yakni hari Allah melakukan pembalasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 78",
    "description": "77-79. Mengetahui kedurhakaan iblis, Allah mengusirnya seraya berfirman, 'kalau begitu, keluarlah kamu dari surga! sesungguhnya kamu adalah makhluk yang terkutuk, terusir dari rahmat-ku, dan terlarang dari surga-ku. Dan sungguh, kutukan-ku tetap berlaku atasmu sampai hari pembalas-an, hari ketika seluruh perbuatan diperhitungkan dan dibalas. ' iblis berkata seraya memohon, 'ya tuhanku, karena engkau telah menjadikan aku makhluk-Mu yang terlaknat, maka tangguhkanlah kematianku dan izinkanlah aku hidup sampai pada hari mereka dibangkitkan supaya aku bisa menggoda mereka sepanjang hayat. '77-79"
  }
]