[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Iblis berkata “wahai tuhanku tundalah ajalku, jangan mematikanku sampai makhluk-makhluk di bangkitkan dari kubur mereka. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Iblis berkata, “Berilah aku tangguh, jangan mematikanku hingga hari Engkau membangkitkan hamba-hamba-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79-83. Iblis berkata kepada Tuhannya: “Ya Tuhanku, tundalah ajalku hingga datang waktu seluruh makhluk dibangkitkan dari kubur mereka.” Maka Allah mengabulkan permintaannya: “Kamu termasuk orang yang diakhirkan ajalnya hingga hari kematian seluruh makhluk, saat terjadi tiupan sangkakala pertama.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. قَالَ رَبِّ فَأَنظِرْنِىٓ إِلَىٰ يَوْمِ يُبْعَثُونَ (Iblis berkata: “Ya Tuhanku, beri tangguhlah aku sampai hari mereka dibangkitkan”) Yakni janganlah Engkau matikan aku sampai hari dibangkitkannya Adam dan keturunannya setelah kematian mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. iblis menjawab: tangguhkanlah aku, dan janganlah Engkau mencabut kepemimpinanku sampai tiba hari kebangkitan, dimana para keturunan dibangkitkan dari kematiannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Wahai Tuhanku, tangguhkanlah aku} tangguhkanlah aku {sampai hari mereka dibangkitkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. “Ia berkata, ‘Ya Rabbku, beri tangguhlah aku sampai hari mereka dibangkitkan’.” Ini disebabkan karena permusuhannya yang sangat berat terhadap Nabi Adam dan anak keturunannya agar ia bisa menyesatkan siapa saja yang telah di takdirkan Allah untuk disesatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 79: (Iblis berkata, \"Ya Rabbku! Berilah aku tenggang waktu sampai hari mereka dibangkitkan\") sampai manusia dibangkitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini karena kedengkiannya dan kerasnya permusuhannya kepada Adam dan keturunannya agar ia dapat menyesatkan manusia yang telah ditaqdirkan Allah akan sesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 79",
    "description": "77-79. Mengetahui kedurhakaan iblis, Allah mengusirnya seraya berfirman, 'kalau begitu, keluarlah kamu dari surga! sesungguhnya kamu adalah makhluk yang terkutuk, terusir dari rahmat-ku, dan terlarang dari surga-ku. Dan sungguh, kutukan-ku tetap berlaku atasmu sampai hari pembalas-an, hari ketika seluruh perbuatan diperhitungkan dan dibalas. ' iblis berkata seraya memohon, 'ya tuhanku, karena engkau telah menjadikan aku makhluk-Mu yang terlaknat, maka tangguhkanlah kematianku dan izinkanlah aku hidup sampai pada hari mereka dibangkitkan supaya aku bisa menggoda mereka sepanjang hayat. '80-81. Allah berfirman, 'maka sesungguhnya kamu, wahai iblis, termasuk golongan yang diberi penangguhan. Aku akan memanjangkan umurmu dan menunda kematianmu sampai pada hari yang telah ditentukan waktunya, yaitu hari kiamat. ' dengan penundaan ini Allah bermaksud memberi cobaan kepada hamba-Nya untuk menguji siapa yang menaati perintah Allah dan siapa yang mengikuti langkah iblis."
  }
]