[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mengapa Muhammad diberi al-qur’an dan bukan kami? justru mereka dalam kebimbangan terhadap wahyu-Ku kepadamu (wahai rasul) dan pengangkatanKu terhadapmu sebagai rasul, lalu mereka berkata demikian, karena mereka belum mencicipi azab Allah, sekiranya mereka telah merasakanna, niscaya mereka tidak akan berkata demikian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Apakah dibenarkan Al-Qur`ān turun kepadanya di antara kita secara khusus dan tidak diturunkan kepada kita, padahal kita adalah para pemuka dan pembesar.” Sebaliknya kaum musyrikin itu dalam keraguan terhadap wahyu yang turun kepadamu, dan karena mereka belum merasakan azab Allah, maka mereka tertipu oleh pembiaran-Nya. Seandainya mereka merasakannya, niscaya mereka tidak berani melakukan kekufuran dan kesyirikan kepada Allah serta meragukan apa yang diwahyukan kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. “Mengapa al-Qur’an diturunkan kepadanya, padahal dia bukan orang yang paling mulia, paling kaya, dan paling tinggi derajatnya di antara kita?” Sungguh penentangan dan keingkaran mereka ini bukan berlandaskan ilmu, akan tetapi berasal dari kedengkian, kesombongan, dan keraguan. dan mereka mengatakan hal itu karena mereka tidak mengagungkan Allah dengan sebenar-benarnya dan belum merasakan azab-Nya, seandainya mereka telah merasakan azab Allah niscaya mereka tidak akan melakukan hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. أَءُنزِلَ عَلَيْهِ الذِّكْرُ مِنۢ بَيْنِنَا ۚ (mengapa Al Quran itu diturunkan kepadanya di antara kita?”) Padahal kita adalah para pemimpin dan pemuka kaum yang lebih tua darinya dan lebih mulia. بَلْ هُمْ فِى شَكٍّ مِّن ذِكْرِى ۖ( Sebenarnya mereka ragu-ragu terhadap Al Quran-Ku) Yakni terhadap al-Qur’an atau wahyu. بَل لَّمَّا يَذُوقُوا۟ عَذَابِ(dan sebenarnya mereka belum merasakan azab-Ku) Sehingga mereka terlena dengan penangguhan bagi mereka yang lama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. “Mengapa Al-quran ini diturunkan kepada kami, padahal kami ini lebih senior dan lebih luhur daripada dia.” Namun sebenarnya mereka tidak meragukan kejujuran Muhammad, namun mereka ragu bahwa Alquran itu dari Allah. Mereka bahkan belum merasakan azab-Ku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mengapa Adz-Dzikr itu} Al-Qur’an itu {diturunkan kepada dia di antara kita” Sebenarnya mereka dalam keraguan terhadap kitabKu} wakyuKu {Tetapi mereka belum merasakan azabKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Mengapa al-Quran itu diturunkan kepadanya di antara kita?” maksudnya, apa yang telah membuatnya lebih utama daripada kita sehingga al-Quran diturunkan kepadanya, bukan kepada kita dan ia diistimewakan oleh Allah dengannya?! Ini juga adalah syubhat mereka. Mana dalil yang terdapat di dalam syubhat ini yang membuktikan penolakan terhadap apa yang ia katakan?! Tidakkah semua rasul itu melainkan demikian adanya?! Allah mengaruniakan kerasulan kepada mereka dan memerintah mereka mengajak manusia kepadaNya. Maka dari itu, tatkala perkataan-perkataan yang bersumber dari mereka tersebut tidak pantas sedikitpun (untuk dijadikan argument) untuk menolak apa yang dibawa oleh Rasul, maka Allah memberitahu darimana perkataan-perkataan seperti itu bersumber, dan sesungguhnya mereka “berada dalam keragu-raguan terhadap al-QuranKu.” Mereka sama sekali tidak mempunyai ilmu pengetahuan dan tidak pula bukti. Tatkala mereka sudah terjerumus dalam lembah keraguan dan puas dengannya, sedangkan kebenaran yang nyata telah datang kepada mereka, dan mereka pun sudah berbulat hati untuk terus berada dalam keraguan, maka mereka mengatakan perkataan-perkataan tersebut untuk menolak kebaenaran, tanpa satu bukti pun dari mereka, melainkan hanya bersumber dari kedustaan yang mereka lakukan. Sudah dimaklumi bahwasanya siapa saja yang berkarakter seperti itu, berbicara berdasarkan keraguan dan sikap keras kepala, maka perkataannya tidak bisa diterima, dan tak seorang pun yang dapat mencemarkan kebenaran; dan sesungguhnya orang yang seperti itu keadaannya mendapat celaan dan cacian akibat perkataannya. Maka dari itu Allah mengancam mereka dengan azab, seraya berfirman, “Dan sebenarnya mereka belum merasakan azabKu.” Maksudnya, mereka telah mengatakan perkataan-perkataan tersebut dan telah lancang melakukannya, di mana mereka bersenang-senang di dunia, tidak ditimpa azab Allah sedikit pun. Kalau saja mereka merasakan azabNya, tentu mereka tidak akan berani berbuat lancang seperti itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 8: (Mengapa telah diturunkan) dapat dibaca Tahqiq dapat pula dibaca Tas-hil (kepadanya) kepada Muhammad (peringatan) yakni kitab Alquran (di antara kita?) bukan diturunkan kepada orang yang tertua di antara kita atau orang yang paling terhormat di antara kita. Maksudnya, mengapa Alquran itu tidak diturunkan kepada orang yang paling tua atau orang yang paling terhormat di antara mereka. Lalu Allah berfirman, (\"Sebenarnya mereka ragu terhadap Alquran-Ku) atau ragu terhadap wahyuKu, yaitu Alquran, karena mereka mendustakan rasul yang mendatangkannya (dan sebenarnya belumlah) artinya, belum lagi (mereka merasakan azab-Ku\") seandainya mereka telah merasakannya niscaya mereka mau beriman kepada Nabi saw. tentang apa yang disampaikan olehnya dari sisi-Ku. Akan tetapi pada saat itu, yakni saat mereka merasakan azab-Ku, tidak ada gunanya lagi iman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni padahal dia bukanlah orang yang paling tua di antara kami dan bukan pula orang mulia (terhormat). Syubhat ini di dalamnya juga tidak terdapat hujjah untuk menolak Beliau, yakni alasan seperti ini bukanlah merupakan hujjah. Oleh karena ucapan mereka itu tidak pantas untuk membantah apa yang Beliau bawa, maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa ucapan itu muncul dari keraguan-raguan yang ada dalam hati mereka, bukan didasari ilmu apalagi bukti. Ketika mereka telah berada di dalam keragu-raguan dan mereka ridha dengannya, padahal kebenaran telah datang kepada mereka dengan jelasnya, tetapi mereka malah bertekad kuat untuk tetap di atas keragu-raguannya dan sikap membangkang, sehingga mereka mengatakan kata-kata yang maksudnya menolak yang hak, bukan berasal dari bukti tetapi berasal dari kedustaan mereka. Sudah menjadi maklum, bahwa orang yang seperti ini sifatnya, yang berbicara atas dasar keragu-raguan dan sikap membangkang, maka ucapannya tidaklah diterima, tidak dapat mencacatkan kebenaran meskipun sedikit, dan bahwa karena ucapan itu, celaan dan cercaan malah berbalik kepada mereka. Oleh karena itulah, Allah Subhaanahu wa Ta'aala mengancam mereka dengan firman-Nya, “Tetapi mereka belum merasakan azab-Ku.” Yakni mereka mengatakan kata-kata itu dan berani mengucapkannya adalah karena mereka mendapatkan kenikmatan di dunia dan belum merasakan azab Allah ‘Azza wa Jalla. Sekiranya mereka merasakan azab Allah, tentu mereka akan membenarkan Nabi shallallahu 'alaihi wa sallam dan tidak akan mengatakan kata-kata seperti itu, namun ketika mereka telah mendapatkan azab, maka keimanan tidak lagi bermanfaat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 8",
    "description": "Mengapa Al-Qur'an itu diturunkan kepada Muhammad padahal dia berasal dari kalangan jelata, bukan kepada orang terpandang di antara kita'' (lihat pula: surah az-zukhruf/43: 31). Allah menegaskan, 'sebenarnya mereka ragu-ragu terhadap Al-Qur'an yang turun dari sisi-ku karena kedengkian hati mereka, tetapi mereka belum merasakan azab-ku atas keingkaran mereka. Kelak mereka pasti akan merasakannya. \"9. \"atau apakah mereka yang kafir itu ingkar karena mempunyai perbendaharaan rahmat tuhanmu yang mahaperkasa lagi maha pemberi sehingga merasa punya kekuatan untuk ikut menentukan kehendak Allah'\" (lihat pula: surah al-an''m/6: 124)."
  }
]