[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "80-81 Allah menjawab “sesungguhnya kamu termasuk orang-orang yang ditangguhkan hingga hari yang sudah di tetapkan yaitu hari ditiupnya sangkakala pertama, saat semua makhluk akan mati."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Allah berfirman, “Sesungguhnya kamu termasuk golongan yang ditangguhkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80-81. إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ قَالَ فَإِنَّكَ مِنَ الْمُنظَرِينَ (Allah berfirman: “Sesungguhnya kamu termasuk orang-orang yang diberi tangguh sampai kepada hari yang telah ditentukan waktunya) Allah memberinya penangguhan, namun tidak sampai hari kebangkitan namun sampai hari ditiupnya sangkakala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Allah berkata: sesungguhnya kau termasuk golongan yang diberi penangguhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Sesungguhnya kamu termasuk golongan yang ditangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80-81. Maka Allah “berfirman” memenuhi permintaannya sesuai dengan tuntutan hikmah (kebijaksanaan) Nya, “Sesungguhnya kamu termasuk orang-orang yang diberi tangguh, sampai kepada hari yang telah ditentukan waktunya,” yakni, hingga seluruh anak keturunan Nabi Adam habis dan ujian telah usai."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 80: (Allah berfirman, \"Sesungguhnya kamu termasuk orang-orang yang diberi tangguh.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengabulkan permohonan-Nya karena sesuai dengan kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 80",
    "description": "80-81. Allah berfirman, 'maka sesungguhnya kamu, wahai iblis, termasuk golongan yang diberi penangguhan. Aku akan memanjangkan umurmu dan menunda kematianmu sampai pada hari yang telah ditentukan waktunya, yaitu hari kiamat. ' dengan penundaan ini Allah bermaksud memberi cobaan kepada hamba-Nya untuk menguji siapa yang menaati perintah Allah dan siapa yang mengikuti langkah iblis"
  }
]