[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "82-83 Iblis berkata ”demi keperkasaanMu wahai tuhanku dan keagunganMu, aku akan menyesatkan anak cucu adam semuanya, kecuali orang yang Engkau pilih dari mereka untuk beribadah kepadamu dan Engkau jaga sehingga aku tidak mampu menyesatkannya, karena Engkau tidak memberikan jalan untukku terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Iblis berkata, “Aku bersumpah dengan kodrat dan kekuatan-Mu, aku pasti akan menyesatkan anak Adam seluruhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ (Iblis menjawab: “Demi kekuasaan Engkau aku akan menyesatkan mereka semuanya) Iblis bersumpah dengan kekuasaan Allah, bahwa dia akan menyesatkan Bani Adam dengan menghiasi syahwat bagi mereka dan memasukkan syubhat dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. iblis berkata: aku bersumpah dengan kemuliaanMu Tuhan, aku tidak akan menyesatkan semua keturunan Adam, kedalam jurang kemaksiatan dan hawa nafsu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Demi kemuliaanMu} Aku bersumpah demi KekuasaanMu {aku benar-benar akan menyesatkan mereka} aku benar-benar akan menyesatkan anak cucu Adam {semuanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82-83. Setelah iblis mengetahui bahwa dirinya diberi tangguhan waktu, maka ia terang-terangan melawan Rabbnya dengan kebusukannya, dengan permusuhan yang sengit terhadap Rabbnya dan terhadap Adam dan anak-anak keturunannya, seraya berkata, ”Demi keperkasaanMu, aku akan menyesatkan mereka semuanya.” Huruf ba’ bermakna sumpah. Ini berarti ia bersumpah dengan keperkasaan Allah bahwa iblis benar-benar akan menyesatkan mereka semuanya, “kecuali hamba-hambaMu yang diberi keikhlasan di antara mereka.” Iblis mengetahui bahwa Allah akan melindungi mereka dari tipu dayanya. Dan bisa juga huruf ba’ itu bermakna isti’anah (permintaan pertolongan). Artinya, oleh karena iblis mengetahui bahwasanya dia lemah dari segala sisinya dan bahwa ia sama sekali tidak bisa menyesatkan seseorang kecuali dengan kehendak dari Allah, maka dia mencari pertolongan kepada keperkasaan Allah agar bisa menyesatkan anak keturunan Nabi Adam. Demikianlah, dan dia benar-benar musuh Allah yang sejati. Sedangkan kami, wahai Rabb, lemah tidak berdaya dan lalai, kami mengakui seluruh nikmat dariMu. Kami adalah anak cucu dari manusia yang telah Engkau muliakan dan Engkau hargai itu; maka kami memohon pertolongan dengan keperkasaanMu yang agung dan kekuasaanMu dan dengan rahmatMu yang luas yang meliputi segala sesuatu, rahmatMu yang dengannya Engkau telah mengantarkan kami kepada apa yang telah kami capai, yaitu berupa kenikmatan agama dan dunia, dan dengannya pula Engkau menjauhkan segala bentuk bencana dari kami; tolonglah kami untuk memeranginya, memusuhinya dan selamat dari kejahatan dan kesyirikannya. Dan kami berbaik sangka, bahwa Engkau pasti mengabulkan doa kami, dan kami beriman kepada janjiMu yang telah Engkau katakan kepada kami, “Dan Tuhanmu berfirman: \"Berdoalah kepada-Ku, niscaya akan Kuperkenankan bagimu: (Ghafir:60). Dan inilah kami, telah berdoa kepadaMu sebagaimana telah Engkau perintahkan kepada kami, maka kabulkanlah doa kami sebagaimana yang telah Engkau janjikan. “Sesungguhnya Engkau tidak menyalahi janji.\" (Ali Imran:194)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 82: (Iblis menjawab, \"Demi kekuasaan Engkau, aku akan menyesatkan mereka semuanya)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Iblis mengetahui bahwa dirinya diberi penangguhan, maka ia memperlihatkan sikapnya yang buruk kepada Tuhannya karena permusuhannya kepada Allah, kepada Adam dan kepada keturunannya. Huruf ba’ di ayat ini bisa berarti qasam (sumpah), yakni Iblis bersumpah dengan keperkasaan Allah untuk menyesatkan manusia. Bisa juga untuk istianah (minta bantuan), yakni karena Iblis mengetahui bahwa dirinya lemah dari berbagai sisi, dan bahwa dia tidak dapat menyesatkan seorang pun kecuali jika dikehendaki Allah Ta’ala, maka dia meminta bantuan dengan keperkasaan Allah Subhaanahu wa Ta'aala untuk menyesatkan keturunan Adam itu. Ya Allah, kami adalah keturunan Adam yang sedang dicari kesempatan oleh Iblis dan tentaranya agar dia dapat menyesatkan kami, kami meminta tolong dengan keperkasaan-Mu dan kekuasaan-Mu yang besar serta rahmat-Mu yang luas agar Engkau membantu kami memeranginya, selamat dari tipu dayanya, dan kami berbaik sangka kepada-Mu bahwa Engkau akan mengabulkan permohonan kami dan kami beriman kepada janji-Mu bahwa Engkau akan mengabulkan permohonan orang yang berdoa kepada-Mu, dan kami telah berdoa kepada-Mu sebagaimana Engkau memerintahkan kami, maka kabulkanlah permohonan kami, sesungguhnya Engkau tidak pernah mengingkari janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 82",
    "description": "82-83. Iblis menjawab dan memohon lagi, 'wahai tuhanku, demi keku-asan dan kemuliaan-Mu, berilah aku kesempatan menggoda manusia, pasti aku akan menyesatkan mereka semuanya dengan tipu dayaku sehingga mereka memandang baik perbuatan buruk. Akan aku tipu semua manusia, kecuali hamba-hamba-Mu yang terpilih di antara mereka, yaitu mereka yang kauberi taufik untuk menaati petunjuk dan perintah-Mu. Aku hanya akan mampu menggoda dan menyesatkan mereka yang kafir dan lemah imannya. '82-83"
  }
]