[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "84-85 Allah berfirman ”kebenaran itu adalah dariKu, Aku tidak berfirman kecuali kebenaran, sungguh Aku akan mengisi jahanam denganmu, dan juga keturunanmu serta orang-orang yang mengikutimu seluruhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Allah -Ta'ālā- berfirman, ”Kebenaran adalah dari-Ku, kebenaran adalah firman-Ku dan Aku tidak berfirman selain kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84-85. Kebenaran dari-Ku, dan Aku tidak berfirman kecuali kebenaran, bahwa Aku akan memenuhi neraka Jahannam dengan dirimu, para keturunanmu, dan para pengikutmu dari keturunan Adam yang mengikuti kesesatanmu dan berpaling dari hidayah-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84-85. قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ لَأَمْلَأَنَّ جَهَنَّمَ (Allah berfirman: “Maka yang benar (adalah sumpah-Ku) dan hanya kebenaran itulah yang Ku-katakan. Sesungguhnya Aku pasti akan memenuhi neraka Jahannam) Yakni hak-Ku adalah mengisi neraka Jahannam dengan Iblis dan para pengikutnya, dan yang Aku firmankan ini adalah kebenaran. Allah bersumpah kepada Iblis bahwa Dia akan memasukkannya ke dalam neraka bersama para pengikutnya sehingga neraka akan penuh dengan mereka. مِنكَ (dengan jenis kamu) Yakni setan-setan dari jenismu. وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ(dan dengan orang-orang yang mengikuti kamu di antara mereka kesemuanya) Yakni dari keturunan Adam, yaitu mereka yang mentaatimu saat kamu mengajaknya kepada kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Allah berkata: maka kebenaran datag dariKU, maka yang benar adalah sumpahKU dan hanya kebenaran itulah yang telah Aku katakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berfirman,“Maka yang benar. dan hanya kebenaran itulah yang Aku frimankan} Allah berfirman,”Maka kebenaran itu dariKu, dan kebenaran itulah yang Aku firmankan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. Allah “berfirman (kepada iblis),” “Maka yang benar dan hanya kebenaran itulah yang KUkatakan,” artinya, al-Haq (kebenaran)itu adalah sifatKu dan yang benar itu FirmanKu, “sesungguhnya Aku pasti akan memenuhi Neraka Jahanam dengan jenismu dan dengan orang-orang yang mengikutimu di antara mereka kesemuanya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 84: (Allah berfirman, \"Maka yang benar adalah sumpah-Ku dan hanya kebenaran itulah yang Kukatakan\") dapat dibaca Falhaqqa Wal Haqqa atau Falhaqqu Wal Haqqa; kalau dibaca Nashab berarti dinashabkan oleh Fi'il yang sesudahnya. Bila lafal pertama dinashabkan, menurut suatu pendapat dikatakan, bahwa dinashabkan oleh Fi'll yang telah disebutkan. Menurut pendapat yang lainnya lagi dinashabkan karena menjadi Mashdar, bentuk asalnya adalah Uhiqqal Haqqa. Menurut pendapat yang lainnya lagi karena huruf Qasamnya dicabut. Dibaca Rafa' atas dasar karena menjadi Mubtada yang dibuang Khabarnya, bentuk asalnya adalah Falhaqqu Minnii. Menurut pendapat yang lainnya lagi bentuk asalnya adalah, Falhaqqu Qasami, dan jawab Qasamnya ialah kalimat berikutnya, yaitu:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa’diy, bahwa maksud firman Allah itu adalah, bahwa kebenaran adalah sifat-Ku dan kebenaran adalah ucapan-Ku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 84",
    "description": "Allah mengabulkan permintaan iblis seraya berfirman, 'maka yang benar adalah sumpah-ku, dan janji-ku pasti benar. Hanya kebenaran itulah yang aku katakan. 85. Sungguh, aku akan memenuhi neraka jahanam dengan kamu dan keturunanmu, wahai iblis, dan dengan orang-orang yang mengikutimu dalam kesesatan di antara mereka semuanya, yakni anak cucu adam. '."
  }
]