[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "84-85 Allah berfirman ”kebenaran itu adalah dariKu, Aku tidak berfirman kecuali kebenaran, sungguh Aku akan mengisi jahanam denganmu, dan juga keturunanmu serta orang-orang yang mengikutimu seluruhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Pada hari Kiamat , Aku pasti akan memenuhi pada Jahanam denganmu dan anak keturunanmu wahai Iblis serta orang-orang yang mengikutimu dari kalangan manusia.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. sungguh Aku akan memenuhi neraka jahannam denganmu hai iblis dan dengan orang-orang yang mengikutimu dari keturunan Adam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Aku akan memenuhi neraka Jahanam denganmu dan orang yang mengikutimu di antara mereka semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. Allah “berfirman (kepada iblis),” “Maka yang benar dan hanya kebenaran itulah yang KUkatakan,” artinya, al-Haq (kebenaran)itu adalah sifatKu dan yang benar itu FirmanKu, “sesungguhnya Aku pasti akan memenuhi Neraka Jahanam dengan jenismu dan dengan orang-orang yang mengikutimu di antara mereka kesemuanya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 85: (Sesungguhnya Aku pasti akan memenuhi neraka Jahanam dengan jenis kamu) berikut keturunanmu (dan dengan orangorang yang mengikuti kamu di antara mereka) yakni umat manusia (semuanya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah jawabul qasam (jawaban dari sumpah di ayat sebelumnya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 85",
    "description": "Sungguh, aku akan memenuhi neraka jahanam dengan kamu dan keturunanmu, wahai iblis, dan dengan orang-orang yang mengikutimu dalam kesesatan di antara mereka semuanya, yakni anak cucu adam. '86. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir, 'aku diutus oleh Allah untuk mendakwahkan risalah dan aku tidak meminta imbalan atau upah sedikit pun kepadamu atasnya. Tugasku hanya-lah menyampaikan risalah dan Allah-lah yang akan memberiku upah atas tugas itu. Dan ketahuilah bahwa aku bukanlah termasuk orang yang mengada-ada dan suka membuat-buat."
  }
]