[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada orang-orang musyrik dari kaummu, ‘aku tidak meminta upah atau balasan dari kalian atas dakwahku dan upayaku dalam membingbing kalian. Aku tidak mengakui sesuatu yang bukan hakku sebaliknya aku hanya mengikuti apa yang diwahyukan ke padaku. Aku tidak memaksakan diri untuk mengira-ngira atau membuat kebohongan’."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Katakanlah -wahai Rasul- kepada orang-orang musyrikin, “Aku tidak meminta kepada kalian upah atas nasihat yang aku sampaikan kepada kalian, aku juga bukan termasuk orang-orang yang memaksakan diri dengan menambahi apa yang diperintahkan kepadaku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Hai Muhammad, katakanlah kepada orang-orang musyrik: “Aku tidak meminta upah dari kalian atas dakwah yang aku sampaikan, aku tidak mengaku apa yang tidak aku miliki dan berbohong, namun aku hanya mengikuti wahyu dari Tuhanku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. قُلْ مَآ أَسْـَٔلُكُمْ عَلَيْهِ مِنْ أَجْرٍ (Katakanlah (hai Muhammad): “Aku tidak meminta upah sedikitpun padamu atas dakwahku) Yakni aku tidak meminta dari kalian imbalan dari kalian atas seruanku kepada Allah dengan al-Qur’an dan wahyu lainnya. وَمَآ أَنَا۠ مِنَ الْمُتَكَلِّفِينَ(dan bukanlah aku termasuk orang-orang yang mengada-adakan) Sehingga aku mengatakan apa yang tidak aku ketahui, atau menyeru kalian kepada selain yang Allah perintahkan kepadaku. Makna (التكلف) adalah membuat-buat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. katakanlah kepada kaummu hai Muhammad! Aku tidak memintai mbalan sedikitpun kepadamu atas turunnyaAl-Qur;an dan dakwah lainnya yang kau ajarkan pada mereka dan Aku bukanlah orang yang mengatakan Al-Qur’an dari versiKU, atau mengada-ada dalam dakwan kenabian dan kalam yang benar adalah milik Allah dan aku tidak mengetahui apapun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku tidak meminta imbalan} balasan {sedikit pun kepada kalian atas hal itu dan aku bukanlah termasuk orang-orang yang mengada-ada} orang-orang yang mengada-ngada Al-Qur’an dari diriku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Setelah Rasulullah menjelaskan dalil kepada manusia dan menjelaskan kepada mereka jalan (yang lurus) ini, maka Allah berfirman, “Katakanlah, ‘Aku tidak meminta kepadamu atasnya’,” maksudnya, atas seruanku kepada kalian ini, “upah sedikit pun dan aku bukanlah termasuk orang-orang yang mengada-adakan,” di mana aku mengklaim suatu perkara yang bukan milikku dan mengikuti apa yang tidak aku miliki ilmunya, dan tidak pula aku mengikuti selain dari apa yang diwahyukan kepadaku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 86: (Katakanlah! \"Aku tidak meminta kepada kalian atas hal ini) atas penyampaian risalah ini (upah sedikit pun) persenan sedikit pun dari kalian (dan bukanlah aku termasuk orang-orang yang mengada-adakan) maksudnya, membuat-buat Alquran dari diriku sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Rasulullah shallallahu 'alaihi wa sallam menerangkan dalilnya dan menjelaskan jalan yang lurus kepada mereka, Allah Subhaanahu wa Ta'aala menyuruh Rasul-Nya untuk mengatakan seperti yang disebutkan dalam ayat di atas. Yakni aku bukanlah orang yang mengaku memiliki sesuatu yang tidak aku miliki, dan aku tidak mengatakan sesuatu yang tidak aku ketahui, demikian pula aku tidak mengikuti selain yang telah diwahyukan kepadaku. Masruq pernah berkata, “Kami datang kepada Abdullah bin Mas’ud, lalu ia berkata, “Wahai manusia, barang siapa yang mengetahui sesuatu maka katakanlah, namun barang siapa yang tidak mengetahui, ucapkanlah “Allahu a’lam” (Allah lebih mengetahui). Karena termasuk ilmu seseorang mengatakan terhadap sesuatu yang tidak diketahuinya, “Allahu a’lam”, Allah Azza wa Jalla berfirman kepada Nabi kalian, “Katakanlah (Muhammad), \"Aku tidak meminta upah sedikitpun padamu atas dakwahku dan bukanlah aku termasuk orang-orang yang takalluf (membebani diri).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 86",
    "description": "Wahai nabi Muhammad, katakanlah kepada orang-orang kafir, 'aku diutus oleh Allah untuk mendakwahkan risalah dan aku tidak meminta imbalan atau upah sedikit pun kepadamu atasnya. Tugasku hanya-lah menyampaikan risalah dan Allah-lah yang akan memberiku upah atas tugas itu. Dan ketahuilah bahwa aku bukanlah termasuk orang yang mengada-ada dan suka membuat-buat. 87-88. Al-qur'an ini tidak lain hanyalah peringatan dari Allah. Allah memenuhinya dengan petunjuk bagi seluruh alam, baik jin maupun manusia, menuju jalan yang lurus dan menjadikannya pembeda antara yang hak dan yang batil. Dan sungguh, wahai orang-orang kafir, kamu akan mengetahui kebenaran beritanya setelah beberapa waktu lagi. Tidak lama lagi, entah di dunia atau akhirat, kamu akan mendapati kebenar-an isi Al-Qur'an, seperti janji dan ancaman Allah, kejadian di masa depan, dan hari kebangkitan. []."
  }
]