[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-quran hanyalah peringatan bagi alam semesta, jin dan manusia, yang dengannya mereka mengetahui apa yang berguna bagi mereka terkait dengan kemaslahatan dunia dan agama mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Al-Qur`ān hanyalah peringatan kepada manusia dan jin yang dibebani kewajiban syariat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87-88. Al-Qur’an ini tidak lain adalah peringatan bagi seluruh jin dan manusia, agar mereka dapat mengingat apa yang bermanfaat bagi dalam agama mereka dan yang dapat memperbaiki keadaan urusan dunia mereka. Hai orang-orang beriman, kalian akan mengetahui kebenaran al-Qur’an saat Islam mendapat kemenangan dan manusia memeluk agama Islam secara berbondong-bondong, dan saat azab menimpa kalian dan kalian tidak dapat menyelamatkan diri ketika kalian telah melihat kabar-kabar al-Qur’an menjadi kenyataan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعٰلَمِينَ (Al Quran ini tidak lain hanyalah peringatan bagi semesta alam) Yakni tidaklah al-Qur’an ini atau apa yang aku serukan ini melainkan peringatan bagi seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Al Qur’an ini tidak lain adalahpengingat dan nasihat bagi semua makhluk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Al-Qur’an) ini tidak lain, kecuali peringatan} peringatan dan pelajaran {bagi alam semesta} bagi manusia dan jin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. “ia tidak lain,” maksudnya, wahyu dan al-Quran ini “hanyalah peringatan bagi semesta alam,” yang dengannya mereka dapat mempelajari apa-apa yang bermanfaat bagi mereka dari berbagai maslahat agama dan dunia mereka. Maka dengan demikian, al-Quran menjadi kemuliaan dan pengangkat derajat manusia semuanya dan sebagai penegakkan hujjah atas orang-orang yang membangkang. Dengan demikian, surat yang agung ini mengandung pelajaran yang sangat bijaksana, informasi yang agung, penegakkan hujjah dan argument terhadap orang-orang yang mendustakan al-Quran dan menentangnya, mendustakan nabi (Rasul) yang datang dengannya, informasi tentang hamba-hamba Allah yang tulus dan balasan bagi orang-orang yang bertakwa dan orang-orang melampaui batas. Maka dari itu Allah bersumpah pada awal surat ini bahwa al-Quran ini adalah pelajaran (peringatan) bagi semresta alam; dan di dalamnya Allah banyak sekali mengingatkan, seperti pada FirmanNya, “Dan ingatlah hamba Kami,” “dan ingatlah hamba-hamba Kami,” “sebagai rahmat dan peringatan dari Kami,” “ini adalah peringatan.” Ya Allah, ajarkan kepada kami darinya apa yang belum kami ketahui dan ingatlah kepada kami apa yang kami lupa darinya karena kelalaian, kelupaan, dan pengabaian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 87: (Tiada lain ini) Alquran ini (hanyalah peringatan) yakni nasihat dan peringatan (bagi semesta alam) maksudnya bagi jenis manusia, jin dan makhluk-makhluk yang berakal selain malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Al Qur’an merupakan pengingat terhadap sesuatu yang bermanfaat bagi mereka baik yang terkait dengan maslahat dunia maupun agama, sehingga Al Quran merupakan peninggi keadaan alam semesta dan sebagai hujjah bagi mereka yang tetap menentang padahal mengetahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 87",
    "description": "87-88. Al-qur'an ini tidak lain hanyalah peringatan dari Allah. Allah memenuhinya dengan petunjuk bagi seluruh alam, baik jin maupun manusia, menuju jalan yang lurus dan menjadikannya pembeda antara yang hak dan yang batil. Dan sungguh, wahai orang-orang kafir, kamu akan mengetahui kebenaran beritanya setelah beberapa waktu lagi. Tidak lama lagi, entah di dunia atau akhirat, kamu akan mendapati kebenar-an isi Al-Qur'an, seperti janji dan ancaman Allah, kejadian di masa depan, dan hari kebangkitan. []87-88"
  }
]