[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian (wahai orang-orang musyrik) benar-benar akan mengetahui berita dan kebenaran Al-quran ini saat islam menang dan manusia masuk ke dalam agama islam berbondong-bondong, demikkian pula saat azab menimpa kalian dan segala sebab keselamatan terputus dari kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Kalian pasti akan mengetahui kabar Al-Qur`ān ini, bahwa ia benar tidak lama lagi saat kalian mati.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَلَتَعْلَمُنَّ (Dan sesungguhnya kamu akan mengetahui) Hai orang-orang kafir. نَبَأَهُۥ بَعْدَ حِينٍۭ ((kebenaran) berita Al Quran setelah beberapa waktu lagi) Yakni sesaat lagi. Terdapat pendapat mengatakan yakni setelah kematian. Dan pendapat lain mengatakan bahwa siapa yang masih hidup saat Rasulullah telah meraih kemenangan akan mengetahui hal itu; dan barangsiapa yang mati sebelum itu maka ia akan mengetahuinya setelah kematiannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. dan agar kalian tahu wahai ahli Makkah dan selain Makkah bahwa adanya khabar yang benar, siksa, janji, hari kebangkitan dan semuanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh kamu akan mengetahui beritanya} berita tentang kebenaran Al-Qur’an {setelah beberapa waktu} setelah mati."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. “Dan sesungguhnya kamu akan mengetahui beritanya,” maksudnya, informasinya, “setelah beberapa waktu lagi,” yaitu ketika azab terjadi menimpa mereka dan segala bentuk hubungan terputus dari mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 88: (Dan sesungguhnya kalian akan mengetahui) hai orang-orang kafir Mekah (berita Alquran) yaitu berita kebenarannya (setelah beberapa waktu lagi\") yakni pada hari kiamat nanti. Lafal 'Alima bermakna 'Arafa yakni mengetahui. Huruf Lam sebelumnya adalah Lam Qasam bagi lafal yang diperkirakan, bentuk asalnya adalah, Wallaahi Lata'lamunna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kebenaran berita-berita Al Quran itu ada yang terlaksana di dunia dan ada pula yang terlaksana di akhirat; yang terlaksana di dunia seperti kebenaran janji Allah kepada orang-orang mukmin bahwa mereka akan menang dalam peperangan dengan kaum musyrikin, dan yang terlaksana di akhirat seperti kebenaran janji Allah tentang balasan atau perhitungan yang akan dilakukan terhadap manusia. Syaikh As Sa’diy berkata, “Surat yang agung ini mengandung peringatan yang bijaksana, berita yang besar, penegakkan hujjah dan dalil bagi orang-orang yang mendustakan Al Qur’an dan menentangnya, serta mendustakan orang yang membawanya, sekaligus pemberitahuan tentang hamba-hamba Allah yang mukhlas, balasan bagi orang-orang yang bertakwa dan orang-orang yang durhaka. Oleh karena itu Allah bersumpah di awalnya, bahwa ia mengandung peringatan dan di akhirnya Allah menyifatinya bahwa ia peringatan bagi alam semesta. Demikian pula Allah Subhaanahu wa Ta'aala memperbanyak peringatan di antara awal dan akhir surat, seperti firman-Nya, “Wadzkur ‘abdnaa”, “Wadz kur ibaadanaa”, “Rahmatan min indinaa wa dzikraa”, dan “Haadzaa dzikr.” Ya Allah, ajarilah kami darinya sesuatu yang tidak kami ketahui, ingatkanlah kami sesuatu yang kami lupa, baik lupa dalam arti lalai maupun meninggalkannya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 88",
    "description": "87-88. Al-qur'an ini tidak lain hanyalah peringatan dari Allah. Allah memenuhinya dengan petunjuk bagi seluruh alam, baik jin maupun manusia, menuju jalan yang lurus dan menjadikannya pembeda antara yang hak dan yang batil. Dan sungguh, wahai orang-orang kafir, kamu akan mengetahui kebenaran beritanya setelah beberapa waktu lagi. Tidak lama lagi, entah di dunia atau akhirat, kamu akan mendapati kebenar-an isi Al-Qur'an, seperti janji dan ancaman Allah, kejadian di masa depan, dan hari kebangkitan. []1. Menyambung topik pada bagian akhir surah s'd tentang posisi Al-Qur'an sebagai peringatan bagi seluruh alam, Allah mengawali surah az-zumar dengan penegasan bahwa Al-Qur'an turun dari sisi Allah. Sesungguhnya kitab Al-Qur'an ini diturunkan oleh Allah yang mahamulia, mahaperkasa dalam kerajaan-Nya, dan mahabijaksana dalam menciptakan sehingga tidak sedikit pun ciptaan-Nya yang sia-sia."
  }
]