[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah mereka memiliki kunci-kunci karunia tuhanmu yang maha perkasa dalam kekuasaanNya, maha memberi apa yang dikehendakiNya dari rizki dan karuniaNya kepada siapa yang dikehendakiNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Apakah kaum musyrikin yang mendustakan itu mempunyai perbendaharaan kekayaan Rabbmu yang Maha Perkasa yang tidak seorang pun bisa mengalahkan-Nya, yang memberi apa yang Dia kehendaki kepada siapa yang Dia kehendaki? Dan di antara perbendaharaan kekayaan-Nya adalah kenabian. Dia memberikannya kepada siapa yang Dia kehendaki. Kenabian bukan milik mereka sehingga mereka bisa memberikannya kepada siapa yang mereka kehendaki dan menghalanginya dari siapa yang mereka kehendaki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Kamu dipilih untuk menjadi seorang rasul merupakan rahmat dan karunia dari Tuhanmu. Apakah orang-orang yang ingkar itu memiliki perbendaharaan rahmat Tuhanmu -Yang Maha Perkasa dan Memberi karunia kepada siapa yang Dia kehendaki- sehingga mereka dapat berbuat semau mereka pada perbendaharaan rahmat itu?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَمْ عِندَهُمْ خَزَآئِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ (Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Maha Perkasa lagi Maha Pemberi?) Yakni apakah mereka memiliki kunci-kunci kenikmatan Tuhanmu sehingga mereka dapat memberi nikmat kenabian kepada siapa yang mereka kehendaki?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Ataukah mereka itu memiliki perbendaharaan nikmat Tuhanmu? Sehingga bebas menentukan/memberi gelar kenabian kepada orang yang mereka kehendaki?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Maha perkasa lagi Maha Pemberi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “Atau apakah mereka itu mempunyai perbendaharaan rahmat Rabbmu Yang Mahaperkasa lagi Maha Pemberi,” lalu mereka memberikan sebagian darinya kepada siapa yang mereka kehendaki, dimana dengan itumereka bisa mengatakan, “Mengapa al-Quran itu diturunkan kepadanya di antara kita,” maksudnya, ini adalah karunia dan rahmat Allah, dan hal itu bukan wewenang mereka sehingga mereka berbuat lancang terhadap Allah (dengan bertanya seperti itu)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Shad ayat 9: (Atau apakah mereka itu mempunyai perbendaharaan rahmat Rabbmu Yang Maha Perkasa) yakni Maha Menang (lagi Maha Pemberi?) termasuk derajat kenabian dan hal-hal lainnya, karenanya mereka dapat memberikannya kepada siapa yang mereka kehendaki."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka memberikan rahmat (seperti kenabian dan lainnya) dan mencegahnya kepada siapa yang mereka kehendaki sebagaimana perkataan mereka, “Mengapa Al Quran itu diturunkan kepada dia di antara kita?\" Padahal yang demikian adalah karunia Allah dan rahmat-Nya, dan hal itu bukan di tangan mereka sehingga mereka tidak bisa menghalangi pemberian Allah itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Shad Ayat 9",
    "description": "\"atau apakah mereka yang kafir itu ingkar karena mempunyai perbendaharaan rahmat tuhanmu yang mahaperkasa lagi maha pemberi sehingga merasa punya kekuatan untuk ikut menentukan kehendak Allah'\" (lihat pula: surah al-an''m/6: 124). 10. \"atau apakah mereka mendustakan nabi Muhammad karena merasa mempunyai kerajaan dan kekuasaan di langit dan bumi dan apa yang ada di antara keduanya' jika tidak, semestinya mereka tidak mencampuri urusan Allah dalam menentukan seseorang menjadi rasul karena dialah yang memiliki wewenang mutlak untuk itu. Jika tetap ingkar maka biarlah mereka menaiki tangga-tangga menuju langit guna menghalangi turunnya wahyu kami kepada rasulullah. \"."
  }
]