[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Tha Ha). Keterangan tentang huruf-huruf yang terpisah-pisah (seperti ini) telah berlalu di muka pada permulaan surat al- Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ṭā Hā. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. طه (Thaahaa) Penjelasan atas huruf-huruf muqattha’ah yang terdapat pada awal surat seperti pada awal surat thaha ini telah disebutkan pada awal surat al-Baqarah. Pendapat lain mengatakan bahwa huruf-huruf yang ada di awal surat ini bukan termasuk dari huruf-huruf muqattha’ah, dan maksud dari kata ini adalah: Hai Muhammad, duduklah di atas tanah. Ibnu al-Anbary berkata: perintah ini ditujukan kepada beliau ketika Rasulullah terus menahan beratnya shalat yang beliau kerjakan dengan sangat panjang sampai kaki beliau hampir-hampir bengkak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Qatadah mengatakan : demi Allah tidak, Ia tidak menjadikan susah, melainkan Ia menjedikannya rahmat dan dan cahaya serta petunjuk menuju surga-Nya. 2 ). Seorang mutadabbir bertutur : suatu ketika aku berada dalam kondisi jiwa dan sosial dan cukup buruk, lalu aku mendengar salah seorang ulama menjelaskan tafsir ayat : { طه , مَآ أَنزَلْنَا عَلَيْكَ ٱلْقُرْءَانَ لِتَشْقَىٰٓ } ; kemudian setelah keluar dari majlisnya, aku membuka mushaf, dan mulai membaca dan mencari kebahagiaan di dalamnya, dan demi Allah tidaklah aku menutup mushaf melainkan aku telah menemukan kebahagiaan itu, dan aku tahu bahwa selama ini kita telah melewatkan harta karun yang besar ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Penjelasan tentang keutamaannya akan dijelaskan di surah Al-Anbiya’ 1. Thaa, Haa, yaitu dua huruf untuk menarik perhatian dan memberi tantangan untuk melemahkan Al-Qur’an yang sepanjang isinya tersusun dari huruf-huruf yang digunakan dalam bahasa Arab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ṭā Hā"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-2. “Thaha,” termasuk dalam kategori huruf-huruf abjad yang terputus untuk membuka sejumlah surat (dalam al-Quran), kata ini bukanlah nama bagi Nabi. “Kami tidak menurunkan al-quran ini kepadamu agar kamu menjadi susah,” maksudnya bukanlah tujuan adanya wahyu dan diturunkannya al-Quran kepadamu serta penetapan syariat adalah agar engkau menjadi susah karenanya, sehingga dalam kandungan syariat terdapat pembebanan (taklif) yang memberatkan orang-orang mukallaf dan melemahkan kekuatan orang-orang yang mengamalkan, akan tetapi ini merupakan wahyu dari al-Quran serta syariat yang disyariatkan oleh Dzat ar-Rahim ar-Rahman dan dijadikan sebagai jembatan pengantar menuju kebahagiaan, kesuksesan, dan kemenangan. Dia benar-benar menyederhanakannya dan memudahkan setiap pintu dan jalan-jalan aksesnya. Dia menjadikannya sebagai nutrisi bagi hati, jiwa, dan pencipta ketenangan bagi badan. Fitrah-fitrah yang normal dan akal-akal yang lurus menyambutnya dengan tulus dan ketundukan. Karena ia mengetahui muatan kebaikan yang berada di dalamnya di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 1: Thaha termasuk huruf-huruf potongan yang biasa berada di awal surat seperti alif lam mim, alim laam raa, dsb. namun bukan nama bagi Nabi shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 1",
    "description": "Bila surah sebelumnya ditutup dengan berita kebinasaan umat terdahulu karena kedurhakaan mereka, surah ini diawali dengan penjelasan bahwa Al-Qur'an turun untuk kebaikan, bukan kesusahan, bagi umat. Taha. 2. Wahai nabi Muhammad, kami, yakni Allah melalui jibril, tidak menurunkan Al-Qur'an ini kepadamu agar engkau menjadi susah akibat ditolak dan dimusuhi kaummu atau dituntut untuk melaksanakan kewajiban di luar batas kemampuanmu."
  }
]