[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tatkala di kegelapan malam, dia melihat api yang menyala-nyala, maka dia berkata kepada istrinya, “Tunggulah di sini, aku melihat api. Mudah-mudahan aku bisa kembali membawa nyala api yang dapat kalian pergunakan untuk menghangatkan diri dan menghidupkan nyala api lain dengannya, atau mungkin aku menjumpai seorang penunjuk jalan yang mengarahkan arah jalan yang benar”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Tatkala dalam perjalanannya ia melihat api, lalu ia berkata kepada keluarganya, \"Tinggallah kalian di tempat ini, sesungguhnya aku melihat api, semoga aku dapat membawa sedikit nyala api kepada kalian, atau aku akan mendapati orang yang akan menunjukkanku suatu jalan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِذْ رَءَا نَارًا (Ketika ia melihat api) Hal ini terjadi pada suatu malam yang gelap gulita ketika dia pergi dari negeri Mad’yan menuju Mesir. فَقَالَ لِأَهْلِهِ امْكُثُوٓا۟( lalu berkatalah ia kepada keluarganya: “Tinggallah kamu (di sini)) Ketika dia melihat api itu, dia berkata kepada keluarganya “tetaplah kalian disini.” إِنِّىٓ ءَانَسْتُ نَارًا(sesungguhnya aku melihat api) Yakni aku melihatnya dari kejauhan. لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِقَبَسٍ(mudah-mudahan aku dapat membawa sedikit daripadanya kepadamu) Makna (القبس) adalah bara api yang diambil untuk menyalakan api pada kayu yang lain. أَوْ أَجِدُ عَلَى النَّارِ هُدًى(atau aku akan mendapat petunjuk di tempat api itu”) Yakni menemui orang yang dapat menunjukkanku jalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Tatkala Musa melihat api di tengah perjalanannya dari Madyan menuju Mesir, dan setelah salah jalan, dia berkata kepada keluarganya: “Tetaplah di sini, sesungguhnya aku melihat api, barangkali aku bisa membawakan kalian sedikit cahaya dari api tersebut, atau barangkali aku mendapatkan petunjuk jalan melalui api tersebut.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia melihat api, lalu berkata kepada keluarganya,“Tinggallah} diamlah di tempat kalian {Sesungguhnya aku melihat} aku melihat {api. Mudah-mudahan aku dapat membawa sedikit nyala api kepadamu} nyala api yang bisa kalian gunakan untuk menghangatkan diri {atau mendapat petunjuk di tempat api itu”} petunjuk yang menunjukkan kita kepada suatu jalan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah berfirman kepada NabiNya, Muhammad dalam bentuk pertanyaan yang bersifat penetapan dan pengagungan serta membesarkan kisah ini “Apakah telah sampai kepadamu kisah Musa?” mengenai keadaannya yang merupakan pangkal kebahagiaan dan tempat penetapan kenabiannya, beliau melihat api dari kejauhan. Sebelumnya beliau pernah tersesat dalam perjalannya, kemudian didera oleh hawa dingin, tanpa memiliki sesuatu pun yang dapat menghangatkan tubuhnya dalam perjalanan. Maka beliau berkata kepada istrinya, “Sesungguhnya aku melihat,” aku menyaksikan “api.” Peristiwa ini terjadi di bagian kanan gunung Thur. “Mudah-mudahan aku dapat membawa sedikit darinya kepadamu,” untuk menghangatkan diri dengannya “atau aku akan mendapat petunjuk di tempat api itu,” maksudnya orang yang menunjukkan jalan kepada kita. Yang beliau cari adalah cahaya yang bersifat inderawi dan petunjuk biasa. Akan tetapi, beliau menjumpai cahaya maknawi, cahaya wahyu yang akan membuat jiwa-jiwa dan hati bersinar karenanya, serta hidayah yang sejati. Yaitu petunjuk menuju shirath al-Mustaqim yang mengantarkan ke Surga Na’im. Terjadilah peristiwa yang tidak pernah beliau perhitungkan dan tak pernah terbetik di benak beliau."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 10: Saat itu, Musa ‘alaihis salam sedang berjalan dari Madyan menuju Mesir, namun Beliau salah jalan, Beliau merasakan kedinginan dan tidak memiliki sesuatu untuk menghangatkan badannya. Yakni istrinya. Yakni yang menunjukkan jalan kepada Beliau, di mana Beliau telah tersesat jalan karena gelapnya malam. Ketika itu yang Beliau cari adalah cahaya atau api hissiy (konkret) dan hidayah hissiy, yakni cahaya atau api dalam arti yang menghangatkan badan Beliau dan menerangi jalan dan yang akan mengarahkan jalan kepada Beliau, namun ternyata yang Beliau dapatkan adalah cahaya maknawi, yaitu cahaya wahyu yang dengannya ruh dan hati bersinar, hidayah hakiki, yakni hidayah kepada jalan yang lurus yang dapat menyampaikan ke surga. Beliau memperoleh sesuatu yang di luar perkiraannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 10",
    "description": "Ketika dalam perjalanan menuju mesir, dia melihat api yang menyala terang, lalu dia berkata kepada keluarganya yang menyertainya dalam perjalanan itu, 'tinggAllah kamu di sini sampai aku kembali. Sesungguhnya aku melihat api. Mudah-Mudahan aku dapat membawa sedikit nyala api kepadamu agar kita dapat menghangatkan badan pada malam yang dingin ini, atau aku akan mendapat petunjuk dari seseorang yang ada di sekitar tempat api itu. '11. Usai berpesan kepada keluarganya, maka musa berjalan mendekati api itu. Ketika dia mendatanginya, tiba-tiba dia dipanggil oleh suara yang berasal dari arah api itu, 'wahai musa!'."
  }
]