[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari malaikat meniup sangkakala untuk tiupan kebangkitan, dan Kami akan menggiring orang-orang kafir pada hari itu, dalam keadaan bermuka muram, telah berubah warna kulit mereka dan penglihatan mereka karena begitu dahsyatnya peristiwa-peristiwa dan kengerian-kengeriannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Yaitu pada hari Malaikat meniupkan sangkakala yang kedua kalinya agar semuanya dibangkitkan, dan pada hari itu Kami kumpulkan orang-orang kafir dengan wajah biru lagi muram karena berubahnya kulit dan mata mereka lantaran dahsyatnya keadaan hari Akhirat yang mereka lalui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102-103. Pada hari ketika malaikat meniup sangkakala tiupan yang kedua untuk membangkitkan seluruh makhluk, Kami akan mengumpulkan orang-orang yang melakukan dosa-dosa besar pada hari yang sulit itu; warna tubuh mereka berubah kebiru-biruan karena ketakutan yang mereka alami akibat melihat kengerian yang terjadi. Mereka berkata dengan berbisik karena ketakutan: “Tidaklah kalian hidup di dunia melainkan hanya sepuluh hari saja.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. يَوْمَ يُنفَخُ فِى الصُّورِ ۚ (di hari (yang di waktu itu) ditiup sangkakala) Yakni dimaksud adalah tiupan untuk membangkitkan seluruh makhluk. وَنَحْشُرُ الْمُجْرِمِينَ(dan Kami akan mengumpulkan pada hari itu orang-orang yang berdosa) Mereka adalah orang-orang musyrik dan pelaku kemaksiatan. زُرْقًا (dengan muka yang biru muram) Yakni mata yang membiru karena kehausan, sebab warna hitam pada mata akan berubah membiru pada saat kehausan. Dan mungkin yang dimaksud adalah badan yang membiru akibat amarah dan penyesalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Hari dimana Israfil meniup sangkakala (terompet sangkakala) pada tiupan kedua, yaitu tiupan kebangkitan agar (makhluk) dikumpulkan dan dihisab. Dan Kami kumpulkan orang-orang kafir dan orang-orang musyrik pada hari kiamat dalam keadaan badan dan mata mereka membiru karena sangat takut, marah, dan menyesal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari ketika sangkakala ditiup} sangkakala {Kami mengumpulkan} dan Kami menggiring {orang-orang yang durhaka pada hari itu dengan (wajah) pucat} matanya membiru dan wajahnya menghitam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-104. Maksudnya, jika sangkakala ditiup, dan orang-orang telah bangkit keluar dari kubur-kubur mereka, masing-masing sesuai dengan keadaannya. Orang-orang yang bertakwa dihimpun menuju Dzat Yang Maha Pemurah sebagai delegasi yang terhormat. Sedangkan orang-orang yang berbuat kedurhakaan, dikumpulkan dengan muka berwarna biru yang kusam karena dirundung ketakutan, kegundahan, dan dahaga. Mereka saling berbicara lirih dan berbisik-bisik mengenai betapa pendeknya masa kehidupan di dunia dan alangkah cepatnya akhirat datang. Sebagian mereka berkata, “TIdaklah kalian berdiam (di dunia) melainkan hanyalah sepuluh (hari).” Sebagian lagi menyebutkan bilangan lainnya. Allah Maha Mengetahui bisikan-bisikan mereka dan mendengar apa yang mereka katakana, “ketika orang yang paling lurus jalannya di antara mereka berkata,” yaitu orang yang paling adil dan paling dekat perkiraannya, “Kamu tidak berdiam (di dunia), melainkan hanya sehari saja.” Yang dimaksud disini adalah kemunculan penyesalan yang sangat besar. Bagaimana mereka menyia-nyiakan waktu yang pendek, menghabiskannya dalam keadaan lalai, bermain-main, berpaling dari perkara-perkara yang bermanfaat bagi mereka, condong kepada hal-hal yang membahayakan mereka. Inilah, sekarang telah datang wakttu pembalasan (amalan), ancaman telah pasti, tidak ada yang tersisa kecuali penyesalan, umpatan celaka dan kebinasaan. Sebagaimana Firman Allah, \"Allah bertanya: \"Berapa tahunkah lamanya kamu tinggal di bumi?\" Mereka menjawab: \"Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada orang-orang yang menghitung.\" Allah berfirman: \"Kamu tidak tinggal (di bumi) melainkan sebentar saja, kalau kamu sesungguhnya mengetahui.\" (Al-Mu’minun:112-114)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 102: Yaitu tiupan untuk membangkitkan manusia dari kuburnya atau menghidupkannya kembali. Mata mereka biru, sedangkan muka mereka hitam. Adapun orang-orang yang bertakwa dikumpulkan kepada Ar Rahman seperti kafilah yang terhormat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 102",
    "description": "102. Hari kiamat itu adalah hari ketika ditiup sangkakala yang kedua kali sebagai pertanda dibangkitkannya seluruh manusia dari kubur, dan selanjutnya kami akan mengumpulkan pada hari itu orang-orang yang berdosa dengan muka yang biru muram, menandakan kecemasan dan ketakutan mereka terhadap balasan atas keingkarannya. 103. Menunggu giliran untuk penimbangan amal perbuatan masingmasing, mereka saling berbisik-bisik di antara mereka untuk meringankan ketakutan dan kekalutan, 'kamu tidak berdiam di dunia melainkan hanyalah sepuluh hari, dan ini merupakan waktu yang sangat singkat. '."
  }
]