[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka saling berbisik-bisik di antara mereka, di mana sebagian dari mereka berkata kepada sebagian yang lain, “Kalian tidaklah hidup di kehidupan dunia kecuali hanya sepuluh hari saja.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Mereka saling berbisik satu sama lain dengan berkata, \"Kalian tidak akan tinggal di alam kubur setelah kematian kalian melainkan hanya 10 malam saja.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. يَتَخٰفَتُونَ بَيْنَهُمْ (mereka berbisik-bisik di antara mereka) Mereka saling berbisik. إِن لَّبِثْتُمْ إِلَّا عَشْرًا(Kamu tidak berdiam (di dunia) melainkan hanyalah sepuluh (hari)) Yakni kalian tidak tinggal di dunia melainkan hanya selama sepuluh hari. Mereka merasa usia mereka di dunia atau di alam kubur sangat pendek."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Mereka saling berbisik-bisik karena sangat panik dan takut: “Kalian tidak berdiam diri di dunia kecuali hanya sepuluh malam” Mereka merasa waktu mereka tinggal di dunia sangat pendek karena lenyapnya dunia itu sangat cepat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berbisik} mereka berbisik {satu sama lain,“kalian tidak tinggal} kalian tidak tinggal di dunia {kecuali sepuluh (hari)”} sepuluh malam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-104. Maksudnya, jika sangkakala ditiup, dan orang-orang telah bangkit keluar dari kubur-kubur mereka, masing-masing sesuai dengan keadaannya. Orang-orang yang bertakwa dihimpun menuju Dzat Yang Maha Pemurah sebagai delegasi yang terhormat. Sedangkan orang-orang yang berbuat kedurhakaan, dikumpulkan dengan muka berwarna biru yang kusam karena dirundung ketakutan, kegundahan, dan dahaga. Mereka saling berbicara lirih dan berbisik-bisik mengenai betapa pendeknya masa kehidupan di dunia dan alangkah cepatnya akhirat datang. Sebagian mereka berkata, “TIdaklah kalian berdiam (di dunia) melainkan hanyalah sepuluh (hari).” Sebagian lagi menyebutkan bilangan lainnya. Allah Maha Mengetahui bisikan-bisikan mereka dan mendengar apa yang mereka katakana, “ketika orang yang paling lurus jalannya di antara mereka berkata,” yaitu orang yang paling adil dan paling dekat perkiraannya, “Kamu tidak berdiam (di dunia), melainkan hanya sehari saja.” Yang dimaksud disini adalah kemunculan penyesalan yang sangat besar. Bagaimana mereka menyia-nyiakan waktu yang pendek, menghabiskannya dalam keadaan lalai, bermain-main, berpaling dari perkara-perkara yang bermanfaat bagi mereka, condong kepada hal-hal yang membahayakan mereka. Inilah, sekarang telah datang wakttu pembalasan (amalan), ancaman telah pasti, tidak ada yang tersisa kecuali penyesalan, umpatan celaka dan kebinasaan. Sebagaimana Firman Allah, \"Allah bertanya: \"Berapa tahunkah lamanya kamu tinggal di bumi?\" Mereka menjawab: \"Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada orang-orang yang menghitung.\" Allah berfirman: \"Kamu tidak tinggal (di bumi) melainkan sebentar saja, kalau kamu sesungguhnya mengetahui.\" (Al-Mu’minun:112-114)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 103",
    "description": "103. Menunggu giliran untuk penimbangan amal perbuatan masingmasing, mereka saling berbisik-bisik di antara mereka untuk meringankan ketakutan dan kekalutan, 'kamu tidak berdiam di dunia melainkan hanyalah sepuluh hari, dan ini merupakan waktu yang sangat singkat. '104. Allah maha mendengar perkataan makhluk-Nya. Kami lebih mengetahui dari siapa saja tentang apa yang mereka katakan, walaupun dengan cara berbisik. Demikian pula ketika orang yang paling lurus jalannya diantara mereka, yaitu mereka yang ucapannya paling mendekati kebenaran, berkata, 'kamu tidak hidup dan tinggal di dunia melainkan hanyalah sehari saja. '."
  }
]