[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami lebih mengetahui apa yang mereka katakan dan mereka bisik-bisikkan ketika orang paling tahu dan paling berakal dari mereka berkata, “Tidaklah kalian tinggal (di dunia) kecuali hanya sehari saja“, karena begitu cepatnya masa hidup di dunia pada diri mereka pada Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Kami lebih mengetahui apa yang mereka bisikkan itu, tidak ada sesuatu pun yang tersembunyi dari Kami ketika orang yang lebih berakal di antara mereka berkata, \"Kalian tidak akan tinggal di alam kubur kecuali hanya satu hari, tidak lebih.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Kami Maha Mengetahui apa yang mereka perbincankan ketika orang yang paling mengerti di antara mereka berkata: “Tidaklah kalian hidup di dunia melainkan hanya sehari saja.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. نَّحْنُ أَعْلَمُ بِمَا يَقُولُونَ إِذْ يَقُولُ أَمْثَلُهُمْ طَرِيقَةً (Kami lebih mengetahui apa yang mereka katakan, ketika berkata orang yang paling lurus jalannya di antara mereka) Yakni orang yang paling benar perkataannya, paling baik pendapatnya, dan paling mengetahui hakikat dirinya. إِن لَّبِثْتُمْ إِلَّا يَوْمًا(Kamu tidak berdiam (di dunia), melainkan hanyalah sehari saja) Yakni kalian tidak tinggal di dunia kecuali sehari saja. Allah menjadikan perkataan ini sebagai perkataan dari orang yang paling lurus diantara mereka karena perkataan ini lebih menggambarkan kengerian pada saat itu, dan bukan karena perkataan ini lebih mendekati kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Allah Maha mengetahui ucapan mereka terkait masa tinggal mereka, ketika orang yang paling adil pemikirannya dan paling bersih perkataannya berkata: “Kalian tidak tinggal (di dunia) kecuali hanya sehari.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami lebih mengetahui apa yang mereka katakan, ketika orang yang paling lurus di antara mereka jalannya mengatakan} orang yang paling berakal dan paling adil di antara mereka berkata {“Kalian tidak tinggal kecuali sehari saja”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102-104. Maksudnya, jika sangkakala ditiup, dan orang-orang telah bangkit keluar dari kubur-kubur mereka, masing-masing sesuai dengan keadaannya. Orang-orang yang bertakwa dihimpun menuju Dzat Yang Maha Pemurah sebagai delegasi yang terhormat. Sedangkan orang-orang yang berbuat kedurhakaan, dikumpulkan dengan muka berwarna biru yang kusam karena dirundung ketakutan, kegundahan, dan dahaga. Mereka saling berbicara lirih dan berbisik-bisik mengenai betapa pendeknya masa kehidupan di dunia dan alangkah cepatnya akhirat datang. Sebagian mereka berkata, “TIdaklah kalian berdiam (di dunia) melainkan hanyalah sepuluh (hari).” Sebagian lagi menyebutkan bilangan lainnya. Allah Maha Mengetahui bisikan-bisikan mereka dan mendengar apa yang mereka katakana, “ketika orang yang paling lurus jalannya di antara mereka berkata,” yaitu orang yang paling adil dan paling dekat perkiraannya, “Kamu tidak berdiam (di dunia), melainkan hanya sehari saja.” Yang dimaksud disini adalah kemunculan penyesalan yang sangat besar. Bagaimana mereka menyia-nyiakan waktu yang pendek, menghabiskannya dalam keadaan lalai, bermain-main, berpaling dari perkara-perkara yang bermanfaat bagi mereka, condong kepada hal-hal yang membahayakan mereka. Inilah, sekarang telah datang wakttu pembalasan (amalan), ancaman telah pasti, tidak ada yang tersisa kecuali penyesalan, umpatan celaka dan kebinasaan. Sebagaimana Firman Allah, \"Allah bertanya: \"Berapa tahunkah lamanya kamu tinggal di bumi?\" Mereka menjawab: \"Kami tinggal (di bumi) sehari atau setengah hari, maka tanyakanlah kepada orang-orang yang menghitung.\" Allah berfirman: \"Kamu tidak tinggal (di bumi) melainkan sebentar saja, kalau kamu sesungguhnya mengetahui.\" (Al-Mu’minun:112-114)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 104: Tentang hal tersebut, yakni tidak seperti yang mereka katakan. Yang dimaksud dengan lurus jalannya adalah orang yang agak lurus pikirannya atau amalannya di antara orang-orang yang berdosa itu. Syaikh As Sa’diy berkata, “Maksud daripadanya adalah penyesalan yang dalam, mereka menyia-nyiakan waktu yang singkat itu dan melewatinya dalam keadaan lupa dan lalai, berpaling dari hal yang bermanfaat bagi mereka, mendatangi hal yang membahayakan mereka. Sekarang tiba pembalasan dan telah terwujud ancaman, sehingga tidak ada lagi selain penyesalan, ucapan kecelakaan dan kebinasaan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 104",
    "description": "104. Allah maha mendengar perkataan makhluk-Nya. Kami lebih mengetahui dari siapa saja tentang apa yang mereka katakan, walaupun dengan cara berbisik. Demikian pula ketika orang yang paling lurus jalannya diantara mereka, yaitu mereka yang ucapannya paling mendekati kebenaran, berkata, 'kamu tidak hidup dan tinggal di dunia melainkan hanyalah sehari saja. '105. Orang-orang yang mengingkari hari kiamat menyatakan keraguan mereka dengan bertanya tentang gunung-gunung yang kukuh. Dan mereka bertanya kepadamu, wahai nabi Muhammad, tentang gunung- gunung di sekitar mereka. Maka katakanlah, 'tuhanku akan menghancurkannya sehancur-hancurnya di hari kiamat sehingga tidak ada satu pun yang masih utuh. '"
  }
]