[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kaummu bertanya kepadamu (wahai Rasul) tentang kesudahan gunung-gunung pada Hari Kiamat. Maka katakanlah kepada mereka, “Tuhanku akan melenyapkannya dari tempat-tempatnya dan menjadikannya debu-debu yang beterbangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Dan mereka bertanya kepadamu -wahai Rasul- tentang keadaan gunung-gunung di hari Kiamat kelak, maka katakanlah pada mereka, \"Gunung-gunung itu akan dicabut oleh Tuhanku dari akar-akarnya lalu menghancurkannya sehingga menjadi debu yang beterbangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105-107. Hai Nabi, mereka bertanya kepadamu tentang keadaan gunung-gunung pada hari kiamat, maka katakanlah kepada mereka: “Tuhanku akan menjadikannya hancur lebur seperti pasir, kemudian Allah akan mengirim angin yang menerpanya sehingga ia menjadi tanah lapang yang datar yang tidak memiliki tanaman dan bangunan di atasnya, di sana kamu tidak akan melihat tanahnya yang menurun atau meninggi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَيَسْـَٔلُونَكَ عَنِ الْجِبَالِ (Dan mereka bertanya kepadamu tentang gunung-gunung) Yakni keadaan gunung-gunung di hari kiamat. فَقُلْ يَنسِفُهَا رَبِّى نَسْفًا (maka katakanlah: “Tuhanku akan menghancurkannya (di hari kiamat) sehancur-hancurnya) Yakni Allah benar-benar mencabutnya dari akarnya, dan meledakkannya hingga berterbangan kesana kemari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Dan orang-orang musyrik dan lainnya bertanya kepadamu terkait keadaan gunung-gunung pada hari kiamat. Maka katakanlah kepada mereka: “Tuhanku mencabutnya dari tempatnya dan benar-benar menghancurkannya sampai remuk berkeping-keping dan menjadi seperti debu yang bertebaran lalu menerbangkannya seperti angin dan debu yang bertebaran pada hari terjadinya angin ribut.” Kaum Quraisy berkata: “Wahai Muhammad, apa yang akan dilakukan tuhanmu terhadap gunung-gunung ini pada hari kiamat?” kemudian turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang gunung-gunung} tentang keadaan gunung-gunung pada hari kiamat {maka katakanlah,“Tuhanku akan menghancurkannya sehancur-hancurnya} Tuhanku akan benar-benar mencabutnya dari akarnya dan menjadikannya debu yang bertaburan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105-107. Allah memberitahukan tentang prahara-prahara Hari Kiamat berserta peristiwa gempa-gempa dan goncangan-goncangan. Allah berfirman, “Dan mereka bertanya kepadamu tentang gunung-gunung,” yaitu apakah yang teerjadi padanya di Hari KIamat? Apakah utuh seperti semula atau tidak? “Maka katakanlah, ‘Rabbku akan menghancurkannya (di Hari Kiamat) sehancur-hancurnya’,” maksudnya, melenyapkan dan mencabutnya dari tempat-tempatnya, sehingga ibarat bulu dan pasir-pasir. Kemudian Allah menumbuknya dan menjadikannya sebagai debu-debu yang beterbangan, semakin lama semakin terkikis dan sirna serta diratakan dengan permukaan tanah. Allah menjadikan bumi “datar sama sekali,” rata “tidak ada sedikit pun kamu lihat padanya,” wahai orang yang melihat “tempat yang rendah,” ini bagian dari kesempurnaan datarnya bumi “dan yang tinggi-tinggi” maksudnya (tidak ada) lembah-lembah, tempat-tempat yang rendah, atau tinggi-tinggi. Maka permukaan bumi menjadi Nampak, dan (luasnya) memadai bagi seluruh umat manusia. Allah membentangkannya sejauh permukaannya. Maka mereka pun berada di satu tempat. Dapat didengar oleh orang yang menyeru dan terlihat oleh pandangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 105: Yakni bagaimanakah keadaannya pada hari kiamat? Atau, apa yang dilakukan Tuhanmu terhadapnya? Dia akan mencabut dari tempat-tempatnya, lalu dijadikan seperti bulu atau pasir, dihancurkan-Nya lalu dijadikan-Nya seperti debu yang berterbangan, dan menjadi rata dengan bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 105",
    "description": "105. Orang-orang yang mengingkari hari kiamat menyatakan keraguan mereka dengan bertanya tentang gunung-gunung yang kukuh. Dan mereka bertanya kepadamu, wahai nabi Muhammad, tentang gunung- gunung di sekitar mereka. Maka katakanlah, 'tuhanku akan menghancurkannya sehancur-hancurnya di hari kiamat sehingga tidak ada satu pun yang masih utuh. ' 106-107. Sesudah itu maka dia akan menjadikan area bekas gunung-gunung itu datar sama sekali sehingga kondisinya berbeda dari sebelumnya. Pada saat itu permukaan bumi menjadi rata; tidak ada sedikit pun kamu lihat padanya tempat yang rendah karena adanya lembah, dan tidak pula tempat yang tinggi-tinggi karena adanya perbukitan."
  }
]