[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "106-107. Maka Allah menjadikan permukaan bumi pada hari itu terhampar, datar, dan rata, tanpa ada tetumbuhan. Orang yang melihatnya tidak menyaksikan adanya kemiringan, tempat tinggi, maupun menurun karena begitu datarnya bumi itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Sehingga engkau -wahai yang akan melihatnya- tidak akan lagi menyaksikan adanya perbedaan antara tempat yang tinggi dan yang rendah karena betapa ratanya bumi itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. لَّا تَرَىٰ فِيهَا عِوَجًا (tidak ada sedikitpun kamu lihat padanya tempat yang rendah) Makna (العوج) permukaan tanah yang rendah, seperti lembah dan lain sebagainya. Makna (الأمت) adalah tempat yang tinggi, semisal bukit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106-107. Lalu menjadikannya sama rata dengan bumi. Tidak ada tumbuhan dan bangunan di sana. Kamu tidak akan melihat turunan dan tanjakan di sana"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu tidak akan melihat lagi di sana dataran rendah} cekungan {dan tidak pula dataran tinggi”} dan tidak pula dataran tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105-107. Allah memberitahukan tentang prahara-prahara Hari Kiamat berserta peristiwa gempa-gempa dan goncangan-goncangan. Allah berfirman, “Dan mereka bertanya kepadamu tentang gunung-gunung,” yaitu apakah yang teerjadi padanya di Hari KIamat? Apakah utuh seperti semula atau tidak? “Maka katakanlah, ‘Rabbku akan menghancurkannya (di Hari Kiamat) sehancur-hancurnya’,” maksudnya, melenyapkan dan mencabutnya dari tempat-tempatnya, sehingga ibarat bulu dan pasir-pasir. Kemudian Allah menumbuknya dan menjadikannya sebagai debu-debu yang beterbangan, semakin lama semakin terkikis dan sirna serta diratakan dengan permukaan tanah. Allah menjadikan bumi “datar sama sekali,” rata “tidak ada sedikit pun kamu lihat padanya,” wahai orang yang melihat “tempat yang rendah,” ini bagian dari kesempurnaan datarnya bumi “dan yang tinggi-tinggi” maksudnya (tidak ada) lembah-lembah, tempat-tempat yang rendah, atau tinggi-tinggi. Maka permukaan bumi menjadi Nampak, dan (luasnya) memadai bagi seluruh umat manusia. Allah membentangkannya sejauh permukaannya. Maka mereka pun berada di satu tempat. Dapat didengar oleh orang yang menyeru dan terlihat oleh pandangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 107: Oleh karena itu suara panggilan terdengar oleh mereka semua dan mereka semua terlihat tidak tertutupi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 107",
    "description": "106-107. Sesudah itu maka dia akan menjadikan area bekas gunung-gunung itu datar sama sekali sehingga kondisinya berbeda dari sebelumnya. Pada saat itu permukaan bumi menjadi rata; tidak ada sedikit pun kamu lihat padanya tempat yang rendah karena adanya lembah, dan tidak pula tempat yang tinggi-tinggi karena adanya perbukitan. 108. Pada hari kiamat itu seluruh manusia bergerak mengikuti penyeru yang menggiring mereka ke satu arah dengan lurus, tidak berbelok-belok; semua begitu tenang dan khusyuk, dan merendahlah semua suara yang mengagungkan dan memohon kepada tuhan yang maha pemurah, maka pada saat itu kamu tidak mendengar kecuali bisikan saja."
  }
]