[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari itu, manusia mengikuti suara penyeru menuju tempat berkumpul di Hari Kiamat, tidak ada yang membelok dari seruan penyeru. Karena hal itu merupakan kejadian yang haq dan kebenaran bagi seluruh makhluk. Suara-suara merendah sebagai bentuk ketundukan terhadap Tuhan Yang Maha Pengasih, maka kamu tidak mendengar, kecuali suara bisikan semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Pada hari itu manusia akan mengikuti panggilan yang menyeru mereka ke padang Mahsyar, mereka tidak bisa membantah agar tidak mengikutinya, dan semua suara pada hari itu tunduk merendah kepada Tuhan Yang Maha Pengasih karena rasa takut kepada-Nya, sehingga hari itu engkau tidak akan mendengar kecuali suara yang berbisik-bisik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108-110. Dan pada hari kiamat manusia akan mengikuti suara penyeru dari Allah yang menyeru mereka untuk menuju padang mahsyar dengan cepat, tidak akan ada seorangpun yang akan tertinggal. Pada hari itu seluruh makhluk akan terdiam karena ketakutan mereka dari Allah Yang Maha Pengasih, sehingga kamu tidak akan mendengar suara melainkan hanya suara yang samar atau suara langkah kaki yang berjalan menuju padang mahsyar. Dan pada hari itu tidak berguna syafaat seorangpun melainkan bagi orang yang telah mendapat izin dari Allah untuk memberi atau menerima syafaat. Allah Maha Mengetahui keadaan semua makhluk, tidak ada perkara dunia dan akhirat yang tersembunyi dari-Nya, sedangkan makhluk-Nya tidak dapat meliputi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. يَوْمَئِذٍ يَتَّبِعُونَ الدَّاعِىَ (Pada hari itu manusia mengikuti (menuju kepada suara) penyeru) Manusia mengikuti penyeru Allah menuju padang Mahsyar. لَا عِوَجَ لَهُۥ ۖ( dengan tidak berbelok-belok) Yakni mereka tidak dapat berbelok dari seruan itu, namun mereka akan segera menjawabnya. وَخَشَعَتِ الْأَصْوَاتُ لِلرَّحْمٰنِ(dan merendahlah semua suara kepada Tuhan Yang Maha Pemurah) Mereka diam karena rasa takut setelah mendengar firman Tuhan mereka. فَلَا تَسْمَعُ إِلَّا هَمْسًا(maka kamu tidak mendengar kecuali bisikan saja) Makna (الهمس) suara yang rendah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Pada hari kiamat dan setelah Kami mengangkat gunung-gunung dan membangkitkan manusia dari kubur, mereka akan mengikuti panggilan Allah menuju padang Mahsyar, tidak ada yang menolak panggilan itu, bahkan mereka bergegas mendatanginya. Suara-suara makhluk terhenti dan lirih karena takut dan tunduk kepada Allah, sehingga tidak terdengar sedikitpun orang yang berbicara kecuali dengan suara yang samar-samar/pelan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu mereka mengikuti penyeru} suara penyeru kepada Allah yang menyeru mereka menuju padang Mahsyar yaitu Israfil {tanpa berbelok-belok} tidak ada bantahan bagi mereka untuk mengikutinya {Semua suara tunduk} diam dan tunduk {kepada Tuhan Yang Maha Pengasih, sehingga yang kamu tidak mendengar melainkan hanya bisik-bisik} suara yang lirih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108-110. OLeh sebab itu, Allah berfirman, “Pada hari itu, manusia mengikuti (menuju kepada suara) penyeru.” Hal itu terjadi saat umat manusia dibangkitkan dari kubur-kubur mereka dan berdiri darinya. Lalu ada penyeru yang memanggil mereka untuk datang dan berkumpul di Mahsyar. Mereka mengikutinya dengan bergegas menuju kepadanya, tidak menoleh ke arah lain dan tidak berbelok ke kanan maupun ke kiri. Firman Allah “Dengan tidak berbelok-belok,” tidak memiringkan diri dari panggilan penyeru. Seruan (penyeru) itu betul-betul benar bagi seluruh makhluk, memperdengarkan (seruan) kepada semuanya dan berteriak kepada mereka semua. Mereka pun datang menuju tempat pengadilan KIamat, dengan suara yang merendah kepada Rabb Yang Maha Pemurah. “Maka kamu tidak mendengar kecuali bisikan saja,” selain suara pijakan kaki-kaki atau bisikan-bisikan dengan lirih dengan menggerakan dua bibirnya saja. Suasana hening, tenang, dan diam menguasai mereka untuk menunggu keputusan hukum Allah Yang Maha Pemurah bagi mereka. Wajah-wajah mereka menunduk maksudnya hina dan merunduk. Engkau menyaksikan di tempat pengadilan yang agung ini orang-orang kaya, orang-orang miskin, kaum lelaki, kaum wanita, orang-orang merdeka, budak-budak, raja-raja dan rakyat jelata dalam keadaan diam, tutup mulut, pandangan mereka merendah, leher-leher mereka menunduk dengan berlutut, dan wajah-wajah mereka hina. Mereka tidak mengetahui keputusan pasti yang mengenainya, tidak tahu apa yang akan diperbuat pada mereka. Setiap orang sibuk dengan diri dan urusannya sendiri, melupakan ayahnya, saudara kandungnya, kawan akrabnya, dan orang kecintannya. Masing-masing orang memiliki urusan yang menyibukkannya. [saat itulah] Dzat Yang Maha Memutuskan lagi Mahaadil Yang Maha memiliki Hari Kiamat menetapkan keputusan padanya dan membalasi orang yang berbuat baik dengan curahan kebaikan dariNya, dan orang yang berbuat buruk dengan menghalangi (nya dari rahmatNya). Harapan yang terpancang pada Rabb yang Mahamullia, Maha Pengasih lagi Maha Penyayang, adalah untuk memperlihatkan kepada para makhluk sebagian dari keutamaan, kebaikan, maaf, toleransi, dan ampunan yang tidak bisa diungkapkan oleh lisan-lisan dan tidak dapat dimajinasikan oleh akal pikiran. Semua makhluk ketika itu menunggu-nunggu rahmatNya, ketika menyaksikannya orang-orang yang beriman kepadaNya dan kepada para RasulNya mendapatkan rahmatNya secara khusus. Jika dikatakan, “Dari manakah kalian mendapatkan harapan ini?” jika engkau mau, katakanlah, “Dari manakah pengetahuan kalian tentang ini?” Maka kita katakan, “Karena kami mengetahuinya dari dominannya rahmat Allah daripada kemurkaanNYa, dan luasnya kemurahanNya yang merata pada semua makhluk, serta melalui apa yang kami saksikan pada diri-diri kami dan orang lain, berupa kenikmatan-kenikmatan yang melimpah di dunia ini. Terutama keutamaan yang ada di Hari Kiamat. Sesungguhnya Firman Allah, \"dan merendahlah semua suara kepada Tuhan Yang Maha Pemurah, maka kamu tidak mendengar kecuali bisikan saja.\" \"kecuali (syafaat) orang yang Allah Maha Pemurah telah memberi izin kepadanya\" dan firman-Nya \"Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah. Dan adalah (hari itu), satu hari yang penuh kesukaran bagi orang-orang kafir.\" (Al-Furqan:26). Begitupula sabda Nabi \"sesungguhnya Allah memiliki 100 rahmat yang diturunkan kepada hamba-hamba-Nya sebagai rahmat, denga itu mereka saling berkasih saying dan berlemah lembut, sampai bintang mengangkat cakarnya dari anaknya karena hawatir melukainya\" [Maksudnya] karena sifat sayang yang diletakkan di hatinya. Di Hari Kiamat, Allah menggabungkan rahmat ini dengan Sembilan puluh Sembilan rahmat. Dengan itu, Allah mencurahkan kasihNya pada para hambaNya. Bersama sabda nabi \"Allah memiliki kasih saying yang lebih kepada hamba-hamba-Nya dari orang tua kepada anaknya\" Maka, katakanlah terserah kamu, tentang berapa besarnya rahmat Allah. Sesungguhnya rahmatNya akan lebih besar dari apa yang engkau katakan. Dan imajinasikanlah rahmat Allah pada level yang lebih besar sekehendakmu. Sesungguhnya rahmat Allah lebih besar dari apa yang engkau sampaikan. Mahasuci Allah yang mencurahkan rahmatNya dalam sifat keadilan dan penerapan hukumanNya. Sebagaimana Dia merahmati dalam bentuk keutamaan, kebaikan dan pahalaNya. Dan Mahatinggi (Allah) Dzat yang rahmatNya melingkupi segala sesuatu, kemurahanNya merata pada setiap makhluk hidup, dan Dzat Yang Maha kaya tiada membutuhkan para hambaNya, Maha Penyayang kepada para hambaNya. Mereka itu membutuhkanNya selama-lamanya dalam seluruh kondisi mereka. Tidak mungkin mereka mengesampingkanNya dalam sekejap mata. FirmanNYa, “Pada hari itu tidak berguna syafaat, kecuali (syafaat) orang yang Allah Maha Pemurah telah memberi izin kepadanya, dan Dia telah meridhai perkataannya,” maksudnya seseorang tidak dapat memberikan syafaat di sisiNya kecuali orang yang sudah diberi izin untuk mengeluarkan syafaat. Dan Allah tidak mengeluarkan izin kecuali (diperuntukkan) bagi orang yang Dia ridhai ucapannya, maksudnya permohonan syafaatnya, dari kalangan para nabi, para rasul, hamba-hambaNya yang dekat, bagi orang yang diridhai ucapan dan tindakannya. Yaitu orang Mukmin yang ikhlas. Jika salah satu syarat ini tidak terpenuhi, maka tidak ada cara bagi siapa pun untuk meraih syafaat dari siapa saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 108: Yang dimaksud dengan penyeru di sini ialah malaikat yang memanggil manusia untuk menghadap ke hadirat Allah. Menurut As Suhailiy, dia adalah malaikat Israfil. Mereka tidak sanggup menolak atau tidak mengikuti. Menurut Syaikh As Sa’diy, hal itu adalah ketika mereka dibangkitkan dari kubur dan bangun darinya, lalu mereka dipanggil oleh penyeru untuk datang dan berkumpul ke padang mahsyar, lalu mereka semua mengikuti dengan segera dan tidak menoleh, tidak miring ke kanan maupun ke kiri. Yaitu suara pijakan kaki ketika menuju ke padang mahsyar. Mereka menunggu keputusan Ar Rahman, wajah-wajah mereka tertunduk. Ketika itu, engkau melihat orang kaya dan orang miskin, laki-laki dan wanita, orang merdeka dan budak, raja dan rakyatnya, semuanya terdiam, mereka tidak mengetahui apa yang akan terjadi pada mereka, dan masing-masing sibuk terhadap urusannya tidak peduli lagi terhadap bapak dan saudaranya, kawan dan kekasihnya. Ketika itu, Hakim Yang Maha Adil (Allah) memberikan keputusan, orang yang berbuat baik akan dibalas dengan ihsan-Nya dan orang yang berbuat buruk akan memperoleh kerugian dan kekecewaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 108",
    "description": "108. Pada hari kiamat itu seluruh manusia bergerak mengikuti penyeru yang menggiring mereka ke satu arah dengan lurus, tidak berbelok-belok; semua begitu tenang dan khusyuk, dan merendahlah semua suara yang mengagungkan dan memohon kepada tuhan yang maha pemurah, maka pada saat itu kamu tidak mendengar kecuali bisikan saja. 109. Pada hari itu juga tidak berguna syafaat dan pertolongan orang tua, anak, atau kerabat, kecuali syafaat dari orang yang dicintai dan telah diberi izin oleh tuhan yang maha pengasih, dan orang itu juga telah dia ridai perkataannya."
  }
]