[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari itu, syafa’at tidak bermanfaat bagi siapa pun dari semua makhluk, kecuali jika Tuhan Yang Maha Pengasih telah mengizinkan sang pemberi syafa’at dan meridhai orang yang menerima syafa’at. Dan tidaklah itu berlaku, kecuali bagi orang Mukmin yang ikhlas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Pada hari yang agung itu, pertolongan dari pemberi syafaat tidak lagi berguna kecuali dari pemberi syafaat yang diizinkan Allah untuk memberikan syafaat, dan Dia meridai perkataannya dalam syafaat itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. يَوْمَئِذٍ لَّا تَنفَعُ الشَّفٰعَةُ (Pada hari itu tidak berguna syafa’at) Dari siapapun itu. إِلَّا مَنْ أَذِنَ لَهُ الرَّحْمٰنُ (kecuali (syafa’at) orang yang Allah Maha Pemurah telah memberi izin kepadanya) Kecuali orang yang diizinkan Allah untuk memberi syafaat. وَرَضِىَ لَهُۥ قَوْلًا(dan Dia telah meridhai perkataannya) Yakni meridhai perkataannya dalam memberi syafaat. Atau meridhai perkataannya demi dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Pada hari kiamat, tidak berguna pertolongan seseorang kepada orang lain kecuali orang yang diberi ijin dan diridhai Allah melalui firmanNya untuk memberi pertolongan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu tidak berguna syafaat kecuali dari orang yang telah diberi izin oleh Yang Maha Pengasih dan yang diridhai perkataannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108-110. OLeh sebab itu, Allah berfirman, “Pada hari itu, manusia mengikuti (menuju kepada suara) penyeru.” Hal itu terjadi saat umat manusia dibangkitkan dari kubur-kubur mereka dan berdiri darinya. Lalu ada penyeru yang memanggil mereka untuk datang dan berkumpul di Mahsyar. Mereka mengikutinya dengan bergegas menuju kepadanya, tidak menoleh ke arah lain dan tidak berbelok ke kanan maupun ke kiri. Firman Allah “Dengan tidak berbelok-belok,” tidak memiringkan diri dari panggilan penyeru. Seruan (penyeru) itu betul-betul benar bagi seluruh makhluk, memperdengarkan (seruan) kepada semuanya dan berteriak kepada mereka semua. Mereka pun datang menuju tempat pengadilan KIamat, dengan suara yang merendah kepada Rabb Yang Maha Pemurah. “Maka kamu tidak mendengar kecuali bisikan saja,” selain suara pijakan kaki-kaki atau bisikan-bisikan dengan lirih dengan menggerakan dua bibirnya saja. Suasana hening, tenang, dan diam menguasai mereka untuk menunggu keputusan hukum Allah Yang Maha Pemurah bagi mereka. Wajah-wajah mereka menunduk maksudnya hina dan merunduk. Engkau menyaksikan di tempat pengadilan yang agung ini orang-orang kaya, orang-orang miskin, kaum lelaki, kaum wanita, orang-orang merdeka, budak-budak, raja-raja dan rakyat jelata dalam keadaan diam, tutup mulut, pandangan mereka merendah, leher-leher mereka menunduk dengan berlutut, dan wajah-wajah mereka hina. Mereka tidak mengetahui keputusan pasti yang mengenainya, tidak tahu apa yang akan diperbuat pada mereka. Setiap orang sibuk dengan diri dan urusannya sendiri, melupakan ayahnya, saudara kandungnya, kawan akrabnya, dan orang kecintannya. Masing-masing orang memiliki urusan yang menyibukkannya. [saat itulah] Dzat Yang Maha Memutuskan lagi Mahaadil Yang Maha memiliki Hari Kiamat menetapkan keputusan padanya dan membalasi orang yang berbuat baik dengan curahan kebaikan dariNya, dan orang yang berbuat buruk dengan menghalangi (nya dari rahmatNya). Harapan yang terpancang pada Rabb yang Mahamullia, Maha Pengasih lagi Maha Penyayang, adalah untuk memperlihatkan kepada para makhluk sebagian dari keutamaan, kebaikan, maaf, toleransi, dan ampunan yang tidak bisa diungkapkan oleh lisan-lisan dan tidak dapat dimajinasikan oleh akal pikiran. Semua makhluk ketika itu menunggu-nunggu rahmatNya, ketika menyaksikannya orang-orang yang beriman kepadaNya dan kepada para RasulNya mendapatkan rahmatNya secara khusus. Jika dikatakan, “Dari manakah kalian mendapatkan harapan ini?” jika engkau mau, katakanlah, “Dari manakah pengetahuan kalian tentang ini?” Maka kita katakan, “Karena kami mengetahuinya dari dominannya rahmat Allah daripada kemurkaanNYa, dan luasnya kemurahanNya yang merata pada semua makhluk, serta melalui apa yang kami saksikan pada diri-diri kami dan orang lain, berupa kenikmatan-kenikmatan yang melimpah di dunia ini. Terutama keutamaan yang ada di Hari Kiamat. Sesungguhnya Firman Allah, \"dan merendahlah semua suara kepada Tuhan Yang Maha Pemurah, maka kamu tidak mendengar kecuali bisikan saja.\" \"kecuali (syafaat) orang yang Allah Maha Pemurah telah memberi izin kepadanya\" dan firman-Nya \"Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah. Dan adalah (hari itu), satu hari yang penuh kesukaran bagi orang-orang kafir.\" (Al-Furqan:26). Begitupula sabda Nabi \"sesungguhnya Allah memiliki 100 rahmat yang diturunkan kepada hamba-hamba-Nya sebagai rahmat, denga itu mereka saling berkasih saying dan berlemah lembut, sampai bintang mengangkat cakarnya dari anaknya karena hawatir melukainya\" [Maksudnya] karena sifat sayang yang diletakkan di hatinya. Di Hari Kiamat, Allah menggabungkan rahmat ini dengan Sembilan puluh Sembilan rahmat. Dengan itu, Allah mencurahkan kasihNya pada para hambaNya. Bersama sabda nabi \"Allah memiliki kasih saying yang lebih kepada hamba-hamba-Nya dari orang tua kepada anaknya\" Maka, katakanlah terserah kamu, tentang berapa besarnya rahmat Allah. Sesungguhnya rahmatNya akan lebih besar dari apa yang engkau katakan. Dan imajinasikanlah rahmat Allah pada level yang lebih besar sekehendakmu. Sesungguhnya rahmat Allah lebih besar dari apa yang engkau sampaikan. Mahasuci Allah yang mencurahkan rahmatNya dalam sifat keadilan dan penerapan hukumanNya. Sebagaimana Dia merahmati dalam bentuk keutamaan, kebaikan dan pahalaNya. Dan Mahatinggi (Allah) Dzat yang rahmatNya melingkupi segala sesuatu, kemurahanNya merata pada setiap makhluk hidup, dan Dzat Yang Maha kaya tiada membutuhkan para hambaNya, Maha Penyayang kepada para hambaNya. Mereka itu membutuhkanNya selama-lamanya dalam seluruh kondisi mereka. Tidak mungkin mereka mengesampingkanNya dalam sekejap mata. FirmanNYa, “Pada hari itu tidak berguna syafaat, kecuali (syafaat) orang yang Allah Maha Pemurah telah memberi izin kepadanya, dan Dia telah meridhai perkataannya,” maksudnya seseorang tidak dapat memberikan syafaat di sisiNya kecuali orang yang sudah diberi izin untuk mengeluarkan syafaat. Dan Allah tidak mengeluarkan izin kecuali (diperuntukkan) bagi orang yang Dia ridhai ucapannya, maksudnya permohonan syafaatnya, dari kalangan para nabi, para rasul, hamba-hambaNya yang dekat, bagi orang yang diridhai ucapan dan tindakannya. Yaitu orang Mukmin yang ikhlas. Jika salah satu syarat ini tidak terpenuhi, maka tidak ada cara bagi siapa pun untuk meraih syafaat dari siapa saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 109: Syafaat adalah usaha perantaraan dalam memberikan suatu manfaat bagi orang lain atau menghindarkan suatu mudharat bagi orang lain. syafaat yang tidak diterima di sisi Allah adalah syafa'at bagi orang-orang kafir. Yakni diridhai syafaatnya, seperti para nabi dan rasul, hamba-hamba-Nya yang didekatkan yang perkataan dan amalnya diridhai Allah, yaitu orang mukmin yang ikhlas. Jika salah satu di antara perkara ini (yakni mendapat izin dan perkataannya diridhai) tidak ada, maka seseorang tidak bisa memberikan syafaat kepada yang lain. Ketika itu, manusia terbagi menjadi dua bagian: pertama, orang yang zalim karena perbuatan kufur dan maksiatnya, maka mereka hanya memperoleh kerugian dan kekecewaan, azab yang pedih di neraka Jahanam dan kemurkaan Allah. Kedua, orang yang mengimani apa saja yang diperintahkan untuk diimani serta mengerjakan amal saleh (yang wajib maupun yang sunat), maka ia tidak perlu khawatir akan perlakuan zalim (terhadapnya) dan tidak (pula) khawatir akan pengurangan haknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 109",
    "description": "109. Pada hari itu juga tidak berguna syafaat dan pertolongan orang tua, anak, atau kerabat, kecuali syafaat dari orang yang dicintai dan telah diberi izin oleh tuhan yang maha pengasih, dan orang itu juga telah dia ridai perkataannya. 110. Itulah tuhan yang maha pengasih. Dia mengetahui apa yang ada di hadapan mereka, yaitu kehidupan duniawi, dan apa yang ada di belakang mereka, yaitu kondisi mereka di akhirat. Dia juga mengetahui apa saja yang belum terjadi, sedang ilmu mereka sangat terbatas sehingga tidak dapat meliputi ilmu-Nya yang serba terinci."
  }
]