[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengetahui apa yang ada di hadapan semua manusia tentang kejadian-kejadian di Hari Kiamat dan apa yang ada di belakang mereka berupa perkara-perkara dunia. Sedangkan ilmu makhlukNya tidak meliputiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Allah sungguh mengetahui apa yang akan dihadapi oleh manusia berupa perkara hari Kiamat, dan mengetahui pula apa yang mereka tinggalkan di kehidupan dunia mereka, sedang pengetahuan semua hamba tidak meliputi tentang Żat dan Sifat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ (Dia mengetahui apa yang ada di hadapan mereka) Yakni tentang urusan mereka di hari kiamat. وَمَا خَلْفَهُمْ(dan apa yang ada di belakang mereka) Yakni tentang urusan mereka di dunia. وَلَا يُحِيطُونَ بِهِۦ عِلْمًا (sedang ilmu mereka tidak dapat meliputi ilmu-Nya) Yakni pengetahuan mereka tidak dapat meliputi Dzat, sifat, dan pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Allah SWT mengetahui setiap sesuatu yang ada di hadapanNya dan apa yang tertunda bagi mereka berupa urusan-urusan dunia dan akhirat. Dan ilmu mereka tidak bisa mencakup pengetahuanNya, tidak juga Dzat dan SifatNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia mengetahui apa yang di hadapan mereka} sesuatu yang akan mereka hadapi berupa perkara akhirat {dan apa yang di belakang mereka} dan yang telah berlalu dari mereka berupa perkara dunia {dan ilmu mereka tidak dapat meliputiNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108-110. OLeh sebab itu, Allah berfirman, “Pada hari itu, manusia mengikuti (menuju kepada suara) penyeru.” Hal itu terjadi saat umat manusia dibangkitkan dari kubur-kubur mereka dan berdiri darinya. Lalu ada penyeru yang memanggil mereka untuk datang dan berkumpul di Mahsyar. Mereka mengikutinya dengan bergegas menuju kepadanya, tidak menoleh ke arah lain dan tidak berbelok ke kanan maupun ke kiri. Firman Allah “Dengan tidak berbelok-belok,” tidak memiringkan diri dari panggilan penyeru. Seruan (penyeru) itu betul-betul benar bagi seluruh makhluk, memperdengarkan (seruan) kepada semuanya dan berteriak kepada mereka semua. Mereka pun datang menuju tempat pengadilan KIamat, dengan suara yang merendah kepada Rabb Yang Maha Pemurah. “Maka kamu tidak mendengar kecuali bisikan saja,” selain suara pijakan kaki-kaki atau bisikan-bisikan dengan lirih dengan menggerakan dua bibirnya saja. Suasana hening, tenang, dan diam menguasai mereka untuk menunggu keputusan hukum Allah Yang Maha Pemurah bagi mereka. Wajah-wajah mereka menunduk maksudnya hina dan merunduk. Engkau menyaksikan di tempat pengadilan yang agung ini orang-orang kaya, orang-orang miskin, kaum lelaki, kaum wanita, orang-orang merdeka, budak-budak, raja-raja dan rakyat jelata dalam keadaan diam, tutup mulut, pandangan mereka merendah, leher-leher mereka menunduk dengan berlutut, dan wajah-wajah mereka hina. Mereka tidak mengetahui keputusan pasti yang mengenainya, tidak tahu apa yang akan diperbuat pada mereka. Setiap orang sibuk dengan diri dan urusannya sendiri, melupakan ayahnya, saudara kandungnya, kawan akrabnya, dan orang kecintannya. Masing-masing orang memiliki urusan yang menyibukkannya. [saat itulah] Dzat Yang Maha Memutuskan lagi Mahaadil Yang Maha memiliki Hari Kiamat menetapkan keputusan padanya dan membalasi orang yang berbuat baik dengan curahan kebaikan dariNya, dan orang yang berbuat buruk dengan menghalangi (nya dari rahmatNya). Harapan yang terpancang pada Rabb yang Mahamullia, Maha Pengasih lagi Maha Penyayang, adalah untuk memperlihatkan kepada para makhluk sebagian dari keutamaan, kebaikan, maaf, toleransi, dan ampunan yang tidak bisa diungkapkan oleh lisan-lisan dan tidak dapat dimajinasikan oleh akal pikiran. Semua makhluk ketika itu menunggu-nunggu rahmatNya, ketika menyaksikannya orang-orang yang beriman kepadaNya dan kepada para RasulNya mendapatkan rahmatNya secara khusus. Jika dikatakan, “Dari manakah kalian mendapatkan harapan ini?” jika engkau mau, katakanlah, “Dari manakah pengetahuan kalian tentang ini?” Maka kita katakan, “Karena kami mengetahuinya dari dominannya rahmat Allah daripada kemurkaanNYa, dan luasnya kemurahanNya yang merata pada semua makhluk, serta melalui apa yang kami saksikan pada diri-diri kami dan orang lain, berupa kenikmatan-kenikmatan yang melimpah di dunia ini. Terutama keutamaan yang ada di Hari Kiamat. Sesungguhnya Firman Allah, \"dan merendahlah semua suara kepada Tuhan Yang Maha Pemurah, maka kamu tidak mendengar kecuali bisikan saja.\" \"kecuali (syafaat) orang yang Allah Maha Pemurah telah memberi izin kepadanya\" dan firman-Nya \"Kerajaan yang hak pada hari itu adalah kepunyaan Tuhan Yang Maha Pemurah. Dan adalah (hari itu), satu hari yang penuh kesukaran bagi orang-orang kafir.\" (Al-Furqan:26). Begitupula sabda Nabi \"sesungguhnya Allah memiliki 100 rahmat yang diturunkan kepada hamba-hamba-Nya sebagai rahmat, denga itu mereka saling berkasih saying dan berlemah lembut, sampai bintang mengangkat cakarnya dari anaknya karena hawatir melukainya\" [Maksudnya] karena sifat sayang yang diletakkan di hatinya. Di Hari Kiamat, Allah menggabungkan rahmat ini dengan Sembilan puluh Sembilan rahmat. Dengan itu, Allah mencurahkan kasihNya pada para hambaNya. Bersama sabda nabi \"Allah memiliki kasih saying yang lebih kepada hamba-hamba-Nya dari orang tua kepada anaknya\" Maka, katakanlah terserah kamu, tentang berapa besarnya rahmat Allah. Sesungguhnya rahmatNya akan lebih besar dari apa yang engkau katakan. Dan imajinasikanlah rahmat Allah pada level yang lebih besar sekehendakmu. Sesungguhnya rahmat Allah lebih besar dari apa yang engkau sampaikan. Mahasuci Allah yang mencurahkan rahmatNya dalam sifat keadilan dan penerapan hukumanNya. Sebagaimana Dia merahmati dalam bentuk keutamaan, kebaikan dan pahalaNya. Dan Mahatinggi (Allah) Dzat yang rahmatNya melingkupi segala sesuatu, kemurahanNya merata pada setiap makhluk hidup, dan Dzat Yang Maha kaya tiada membutuhkan para hambaNya, Maha Penyayang kepada para hambaNya. Mereka itu membutuhkanNya selama-lamanya dalam seluruh kondisi mereka. Tidak mungkin mereka mengesampingkanNya dalam sekejap mata. FirmanNYa, “Pada hari itu tidak berguna syafaat, kecuali (syafaat) orang yang Allah Maha Pemurah telah memberi izin kepadanya, dan Dia telah meridhai perkataannya,” maksudnya seseorang tidak dapat memberikan syafaat di sisiNya kecuali orang yang sudah diberi izin untuk mengeluarkan syafaat. Dan Allah tidak mengeluarkan izin kecuali (diperuntukkan) bagi orang yang Dia ridhai ucapannya, maksudnya permohonan syafaatnya, dari kalangan para nabi, para rasul, hamba-hambaNya yang dekat, bagi orang yang diridhai ucapan dan tindakannya. Yaitu orang Mukmin yang ikhlas. Jika salah satu syarat ini tidak terpenuhi, maka tidak ada cara bagi siapa pun untuk meraih syafaat dari siapa saja."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 110",
    "description": "110. Itulah tuhan yang maha pengasih. Dia mengetahui apa yang ada di hadapan mereka, yaitu kehidupan duniawi, dan apa yang ada di belakang mereka, yaitu kondisi mereka di akhirat. Dia juga mengetahui apa saja yang belum terjadi, sedang ilmu mereka sangat terbatas sehingga tidak dapat meliputi ilmu-Nya yang serba terinci. 111. Orang yang beriman mengakui keagungan Allah tersebut dan tunduklah semua muka dengan rendah diri kepada tuhan yang hidup kekal lagi berdiri sendiri dalam mengurus makhluk-Nya. Sesungguhnya telah merugilah orang yang melakukan kezaliman dengan mengingkari petunjuk Allah dan tuntunan rasul-Nya."
  }
]