[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wajah-wajah semua makhluk tertunduk dan merendah kepada Penciptanya yang Mahahidup Yang memiliki makna-makna hidup yang sempurna sebagaimana yang layak dengan keagunganNya, Yang tidak akan mati, Yang mengurus pengaturan seluruh urusan segala sesuatu. Yang Maha tidak membutuhkan selainNya, Dan sesungguhnya pada Hari Kiamat merugilah orang-orang yang menyekutukan seseorang dari makhluk dengan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Dan semua wajah hamba tertunduk hina di hadapan Tuhan Yang Maha Hidup dan tidak pernah mati, Tuhan Yang Berdiri Sendiri dalam mengurusi dan mengatur urusan hamba-hamba-Nya, dan sungguh betapa meruginya orang yang membawa beban dosa dengan membuang dirinya ke tempat kebinasaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111-112. Dan wajah seluruh makhluk tertunduk kepada Allah Yang Maha Hidup, Yang tidak pernah mati, Yang Maha Mengurus hamba-hamba-Nya. Sungguh telah merugi orang yang menyekutukan-Nya. Dan orang yang mengerjakan amalan-amalan shalih, sedangkan dia beriman kepada Tuhannya, maka dia tidak takut akan disiksa bukan karena dosanya, dan tidak takut akan dikurangi pahala kebaikannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَعَنَتِ الْوُجُوهُ لِلْحَىِّ الْقَيُّومِ ۖ (Dan tunduklah semua muka (dengan berendah diri) kepada Tuhan Yang Hidup Kekal lagi senantiasa mengurus (makhluk-Nya)) Yakni tunduk dan patuh. وَقَدْ خَابَ مَنْ حَمَلَ ظُلْمًا(Dan sesungguhnya telah merugilah orang yang melakukan kezaliman) Yakni merugilah orang yang menanggung sebuah dosa. Pendapat lain mengatakan yakni orang yang melakukan kesyirikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Dan sungguh tunduk dan merendah pandangan makhluk-makhluk terhadap Dzat Yang Maha Hidup yang berkuasa dalam mengatur dan membalas hamba-hambaNya, berkuasa atas kerajaanNya. Dan sungguh merugilah orang yang menanggung kezaliman seperti syirik dan perbuatan lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wajah-wajah tertunduk} merendah dan tertunduk {di hadapan Dzat Yang Maha hidup lagi Maha Mengurus} Mengurus segala perkara ciptaanNya dengan mengurus dan menjaganya {Sungguh rugi} rugi {orang yang membawa kezaliman} menambah keburukannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111-112. Di tempat Mahsyar, umat manusia tergolongkan menjadi dua kelompok; orang-orang yang telah berbuat aniaya disebabkan kekufuran dan kejelekan mereka. Orang-orang ini tidak menjumpai kecuali sesal, terhalangi dari rahmat dan siksa yang pedih di Jahanam, serta kemurkaan Allah, Dzat Yang Maha memiliki Hari KIamat. Kelompok kedua: Orang-orang yang beriman dengan keimanan yang diperintahkan dan mengamalkan amalan shalih, yang wajib maupun yang sunnah. “Maka dia tidak khawatir akan perlakuan yang tidak adil (terhadapnya),” yaitu penambahan pada kesalahan-kesalahannya “dan tidak (pula) akan pengurangan haknya,” pengurangan dari kebaikan-kebaikannya. Bahkan dosa-dosanya terampuni dan kekurangan-kekurangannya dibersihkan dan kebaikan-kebaikannya dilipatgandakan. \"dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya dan memberikan dari sisi-Nya pahala yang besar.\" (An’Nisa:40)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 111: Yakni kemusyrikan atau kekafiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 111",
    "description": "111. Orang yang beriman mengakui keagungan Allah tersebut dan tunduklah semua muka dengan rendah diri kepada tuhan yang hidup kekal lagi berdiri sendiri dalam mengurus makhluk-Nya. Sesungguhnya telah merugilah orang yang melakukan kezaliman dengan mengingkari petunjuk Allah dan tuntunan rasul-Nya. 112. Dan siapa saja mengerjakan amal-amal yang saleh dengan niat tulus dan ia dalam keadaan beriman, maka dia tidak akan merasa khawatir akan perlakuan yang tidak adil terhadapnya dan tidak pula dia akan merasa takut terhadap pengurangan haknya sesuai apa yang telah ditetapkan dan dilakukannya."
  }
]