[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana Kami mendorong orang-orang beriman untuk semangat beramal shalih dan Kami peringatkan orang-orang kafir agar tidak terus menerus berkubang dalam perbuatan maksiat dan kekafiran mereka terhadap ayat-ayat Kami, Kami juga menurunkan al-Qur’an ini dengan berbahasa arab agar mereka dapat memahaminya dan Kami telah merinci di dalamnya berbagai bentuk ancaman dengan harapan mereka akan takut kepada Tuhan mereka atau al-Qur’an itu akan menimbulkan peringatan bagi mereka lalu mereka mau menerima nasihat dan memetik pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Dan sebagaimana Kami turunkan kisah-kisah umat terdahulu, maka Kami juga menurunkan Al-Qur`ān ini dengan bahasa arab yang jelas, dan Kami telah menjelaskan berulang-ulang di dalamnya berbagai macam peringatan dan ancaman dengan harapan agar mereka takut kepada Allah, atau Al-Qur`ān ini menyebabkan mereka bisa mengambil pelajaran dan nasihat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Sebagaimana kisah-kisah yang telah disebutkan ini diturunkan, Kami menurunkan al-Qur’an ini dengan bahasa arab yang fasih, Kami jelaskan di dalamnya dengan berbagai macam cara untuk memberi peringatan agar mereka menjauhi kekafiran dan kemaksiatan; atau agar al-Qur’an ini dapat memberi pelajaran dan ibrah bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَكَذٰلِكَ أَنزَلْنٰهُ (Dan demikianlah Kami menurunkannya) Yakni al-Qur’an. قُرْءَانًا عَرَبِيًّا (Al Quran dalam bahasa Arab) Yakni dengan bahasa arab agar mereka memahaminya. وَصَرَّفْنَا فِيهِ مِنَ الْوَعِيدِ (dan Kami telah menerangkan dengan berulang kali, di dalamnya sebahagian dari ancaman) Yakni Kami jelaskan di dalamnya berbagai ancaman untuk memberi mereka rasa takut. لَعَلَّهُمْ يَتَّقُونَ (agar mereka bertakwa) Agar mereka takut kepada Allah sehingga mereka menjauhi kemaksiatan dan takut dari siksa-Nya. أَوْ يُحْدِثُ لَهُمْ ذِكْرًا (atau (agar) Al Quran itu menimbulkan pengajaran bagi mereka) Yakni agar pelajaran dan nasehat yang ada dalam al-Qur’an dapat menimbulkan pengajaran atau sifat wara’ dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Dan sebagaimana menurunkan kisah-kisah yang telah disebutkan itu, Kami menurunkan Al-Qur’an ini dengan bahasa Arab supaya mereka memahaminya. Dan Kami terangkan di dalamnya macam-macam janji sebagai peringatan dan ancaman supaya mereka takut kepada Allah, lalu menjauhi perbuatan syirik, kemaksiatan, dan mewaspadai hukuman atau Al-Qur’an itu menjadi nasehat dan pelajaran saat mereka mendengarkan ayat-ayatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah, Kami menurunkan} menurunkan kitab ini {Al-Qur’an dalam bahasa Arab dan Kami telah menjelaskan} Kami menjelaskan dan merincikan {di dalamnya sebagian dari ancaman agar mereka bertakwa atau agar itu menimbulkan} memunculkan {pengajaran bagi mereka} pelajaran dan teladan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113. Maksudnya, dan demikianlah, Kami menurunkan Kitab ini dengan Bahasa Arab yang kalian pahami dan mengerti. Tidak ada lafazh maupun maknanya yang kabur pada kalian. “Dan Kami telah menerangkan dengan berulang kali di dalamnya sebagian ancaman,” maksudnya, Kami memvariasikannya dengan jenis yang banyak sekali. Terkadang dengan menyebutkan Nama-nama Allah yang menunjukkan keadilan dan sifat membalas dendam. Suatu waktu, dengan menyebutkan malapetaka-malapetaka yang Allah timpakan kepada umat-umat terdahulu. Dan Dia memerintahkan agar umat-umat setelah mereka mengambilnya sebagai pelajaran. Kadang-kadang dengan mengemukakan pengaruh-pengaruh dosa dan kekurangan-kekurangan yang ditimbulkannya. Kadang, dengan menyebutkan kengerian-kengerian di Hari Kiamat beserta peristiwa-peristiwa yang menakutkan dan menggegerkan. Kadang-kadang dengan menceritakan tentang Jahanam beserta berbagai jenis hukuman dan beragam siksaan. Ini semua bukti rahmat Allah pada para hambaNYa. “Agar mereka bertakwa,” bertakwa kepada Allah. Mereka pun meninggalkan kejahatan, dan maksiat-maksiat yang membahayakan mereka. “Atau (agar) al-Quran itu mengadakan pengajaran bagi mereka,” maka kalian mengamalkan amalan-amalan shalih dalam ketaatan dan kebaikan, dan hal-hal yang berguna bagi kalian. Keadaan al-Quran yang berbahasa arab dan “mengulang-ngulang penyebutan ancaman” merupakan faktor yang paling dominan dan paling besar mendatangkan ketakwaan dan amalan shalih. Sekiranya, al-Quran tidak berbahasa arab atau tidak terulang-ulang, niscaya ia tidak memberikan pengaruh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 113: Yang kalian pahami, di mana lafaz dan maknanya tidak ada yang samar. Terkadang dengan menyebutkan nama-nama-Nya yang menunjukkan keadilan-Nya dan berkuasa menimpakan hukuman, terkadang menyebutkan hukuman yang ditimpakan-Nya kepada umat-umat terdahulu dan memerintahkan agar mengambil pelajaran dari mereka, terkadang dengan menyebutkan pengaruh dosa, terkadang dengan menyebutkan peristiwa dahsyat pada hari kiamat, terkadang dengan menyebutkan Jahanam dan berbagai siksa di dalamnya. Semua itu merupakan kasih sayang Allah kepada hamba-hamba-Nya agar mereka bertakwa kepada Allah dan meninggalkan maksiat dan keburukan yang sesungguhnya membahayakan mereka. Sehingga mereka sadar dan mau mengerjakan ketaatan dan kebaikan yang memang memberikan manfaat bagi mereka. Diulang-ulangnya ancaman dan menggunakan bahasa yang mereka pahami merupakan sebab terbesar agar mereka bertakwa dan beramal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 113",
    "description": "113. Al-qur'an mengandung ancaman bagi orang kafir dan tuntunan bagi semua manusia. Dan demikianlah kami menurunkan Al-Qur'an dalam bahasa arab sebagai pengingat, dan kami telah menerangkan pula dengan berulang kali di dalamnya sebagian dari ancaman yang telah disebutkan. Yang demikian ini dimaksudkan agar mereka bertakwa atau agar Al-Qur'an itu menimbulkan pengajaran bagi mereka yang membaca dan melaksanakan petunjuknya. 114. Dengan semua sifat itu, maka sesungguhnya mahatinggi Allah, raja yang sebenar-benarnya. Dan karena itu, janganlah kamu, wahai nabi Muhammad, tergesa-gesa membaca Al-Qur'an sebelum disempurnakan pewahyuannya kepadamu agar kamu tidak salah memahami dan mengajarkannya, dan katakanlah, 'ya tuhanku, tambahkanlah kepadaku ilmu pengetahuan yang bermanfaat. '."
  }
]