[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah maha bersih, tinggi dan suci dari semua kekurangan, Dia Raja Yang kekuasaaNya mengalahkan semua penguasa dan tirani, Yang mengendalikan segala sesuatu, Yang Mahabenar, janjiNya benar, ancamanNya benar, dan tiap-tiap sesuatu dariNya adalah kebenaran. Dan janganlah kamu teegesa-gesa (wahai Rasul) untuk mendahului Jibril dalam menerima al-Qur’an sebelim dia tuntas darinya. Dan katakanlah, “Wahai Tuhanku, tambahkanlah kepadaku ilmu disamping ilmu yang telah Engkau ajarkan kepadaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Maka Mahatinggi Allah lagi Mahasuci, Raja yang menguasai segala sesuatu, Raja yang sebenar-benarnya, dan firman-Nya adalah benar, Dia Maha Suci dari apa yang disandarkan orang-orang musyrik terhadap-Nya. Maka janganlah engkau tergesa-gesa -wahai Rasul- dalam membaca Al-Qur`ān bersama Jibril sebelum ia selesai diwahyukan kepadamu, dan katakanlah, \"Ya Tuhanku, tambahkanlah aku ilmu lain di samping ilmu yang telah Engkau ajarkan padaku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Maha Suci Allah, Raja Yang sebenar-benarnya; Dia berbuat terhadap makhluk-makhluk-Nya sesuai kehendak-Nya, perbuatan-Nya benar dan firman-Nya benar. Dan janganlah kamu terburu-buru membaca al-Qur’an ketika Jibril sedang membacakannya kepadamu, namun dengarkanlah baik-baik hingga Jibril selesai membacanya. Dan berdoalah kepada Allah: “Ya Tuhanku, tambahlah ilmuku atas ilmu yang telah Engkau ajarkan kepadaku.” Syeikh as-Syinqithi berkata: Firman Allah, وَلَا تَعْجَلْ بِٱلْقُرْءَانِ مِن قَبْلِ أَن يُقْضَىٰٓ إِلَيْكَ وَحْيُهُۥ ۖ وَقُل رَّبِّ زِدْنِى عِلْمًا Dahulu Rasulullah jika didatangi Jibril untuk menyampaikan wahyu, saat Jibril membaca satu ayat, Rasulullah langsung membacanya bersama Jibril karena begitu besar keinginannya untuk segera menghafal al-Qur’an itu. Maka dengan ayat ini Allah hendak memberinya petunjuk apa yang harus dia lakukan, Allah melarangnya terburu-buru dalam membaca al-Qur’an saat bersama Jibril; Allah memerintahkannya untuk mendengarkan bacaan Jibril sampai selesai, kemudian dia boleh membacanya setelah itu, sebab Allah telah memudahkan Rasulullah untuk menghafalnya. Maksud dari ayat ini Allah jelaskan dalam ayat lain, seperti dalam surat al-Qiyamah: لا تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ ثُمَّ إِنَّ عَلَيْنَا بَيَانَهُ “Jangan engkau (Muhammad) gerakkan lidahmu (untuk membaca Al Quran) karena hendak cepat-cepat (menguasai)nya. Sesungguhnya Kami yang akan mengumpulkannya (di dadamu) dan membacakannya. Apabila Kami telah selesai membacakannya maka ikutilah bacaannya itu. Kemudian sesungguhnya Kami yang akan menjelaskannya.” (al-Qiyamah: 16-19)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. فَتَعٰلَى اللهُ الْمَلِكُ الْحَقُّ ۗ (Maka Maha Tinggi Allah Raja Yang sebenar-benarnya) Maha Tinggi Allah dari keingkaran orang yang mengingkari-Nya dan dari ucapan orang-orang musyrik tentang sifat-Nya. Dia-lah Raja yang sebenarnya, di tangan-Nya lah pahala dan siksaan. وَلَا تَعْجَلْ بِالْقُرْءَانِ مِن قَبْلِ أَن يُقْضَىٰٓ إِلَيْكَ وَحْيُهُۥ ۖ( dan janganlah kamu tergesa-gesa membaca Al qur’an sebelum disempurnakan mewahyukannya kepadamu) Ketika itu Rasulullah mendahului Jibril, yakni beliau mulai membaca sebelum Jibril selesai membacakan wahyu karena beliau sangat perhatian kepada wahyu yang diturunkan, maka Allah melarang hal ini. وَقُل رَّبِّ زِدْنِى عِلْمًا (dan katakanlah: “Ya Tuhanku, tambahkanlah kepadaku ilmu pengetahuan”) Yakni mintalah Tuhanmu agar menambah ilmumu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Firman Allah : { وَلَا تَعْجَلْ بِٱلْقُرْءَانِ مِن قَبْلِ أَن يُقْضَىٰٓ إِلَيْكَ وَحْيُهُۥ ۖ وَقُل رَّبِّ زِدْنِى عِلْمًا } \"dan janganlah kamu tergesa-gesa membaca Al qur'an sebelum disempurnakan mewahyukannya kepadamu, dan katakanlah: \"Ya Tuhanku, tambahkanlah kepadaku ilmu pengetahuan\" adalah adab setiap penuntut ilmu, dan semestinya mereka selalu seksama dalam memahami ilmu yang dipelajari, tidak tergesa-gesa dalam menetapkan suatu keputusan, dan tidak pula merasa takjub pada dirinya sendiri, serta senantiasa memohon kepada tuhannya agar diberikan ilmu yang bermanfaat. 2 ). Ayat ini juga memberikan pemahaman penting bahwa : - Dalam mempelajari kitab Allah baik dengan membacanya, menghafalkan dan memahaminya, tidak dengan cara tergesa-gesa, melainkan dengan perlahan dan seksama. - Bahwasanya derajat ilmu dimulai dari menghafal dan memaham al-Qur'an, barulah kemudian masing-masing indifidu menambah dari ilmu ini dengan ilmu lainnya. 3 ). Mujahid berkata tentang ayat ini : janganlah kamu tergesa-gesa dalam membacakan apa yang diturunkan kepadamu untuk sahaba-sahabatmu, dan jangan pula kamu membacakannya kepada mereka sampai kamu benar-benar memahami dan meresapi maknanya. 4 ). { وَقُل رَّبِّ زِدْنِى عِلْمًا } \"Dan berdoalah kepada Allah: “Ya Tuhanku, tambahlah ilmuku atas ilmu yang telah Engkau ajarkan kepadaku\" { يَدُ ٱللَّهِ فَوْقَ أَيْدِيهِمْ } \"Tangan Allah di atas tangan mereka\" [ Al-Fath : 10 ], { وَفَوْقَ كُلِّ ذِى عِلْمٍ عَلِيمٌ } \"dan di atas tiap-tiap orang yang berpengetahuan itu ada lagi Yang Maha Mengetahui\" [ Yusuf : 76 ]; adab-adab ilahi semacam ini menjadikan diri setiap mukmin jauh dari kesombongan dan keangkuhan, sehingga tidak lagi kita melihat seorang mukmin merendahkan orang yang berharta, dan siapa saja yang mengamati kisah Rasulullah tatkala hendak memasuki Kota Makkah setelah menerima perlakuan buruk dari kaumnya sendiri, Rasulullah sedikitpun tidak meninggikan kepalanya, melanikan beliau memasuki Kota Makkah dengan segala kerendahan hati beliau, menghormati petinggi kaum itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Maha Agung Allah Dzat yang Maha Merajai, lagi Maha Benar Dzat dan SifatNya dari bentuk karakter para makhluk dan dari apa yang dikatakan orang-orang musyrik. Dan janganlah tergesa-gesa wahai Nabi dalam membaca Al-Qur’an ketika diturunkan sampai sempurna wahyu (yang diturunkan) itu, dan sampai Jibril telah selesai menyampaikannya kepadamu. Dan katakanlah: “Wahai Tuhanku, tambahkanlah ilmu sampai aku mendapatkan banyak ilmu sebagai ganti ketergesa-gesaanku.” As-Sadi berkata: “Suatu ketika Nabi SAW saat menerima Al-Qur’an dari Jibril, beliau kesulitan menghafalnya, sehingga itu menyulitkan dirinya, dan beliau takut Jibril segera naik (pergi), sedangkan beliau belum menghafalnya. Kemudian turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maha tinggi Allah} Maha suci, dan Maha tinggi dari setiap kekurangan {Raja yang sebenar-benarnya. Janganlah tergesa-gesa dengan Al-Qur’an} janganlah tergesa-gesa membaca Al-Qur’an {sebelum selesai} sempurna {pemberian wahyu kepadamu dan katakanlah,“Ya Tuhanku, tambahkanlah ilmu kepadaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114. Ketika Allah menyebutkan keputusan pembalasan-pembalasanNYa pada para hambaNya dan ketetapan perintah agamaNya yang Allah turunkan di dalam KItabNya, -realita ini termasuk bagian dari implikasi kekuasaanNya-, Allah berfirman, “Maka Maha Tinggi Allah,” maksudnya Mahabesar, berada di ketinggian, suci dari segala kekurangan dan kerusakan. “Raja”, yang kepemilikan kerajaan menjadi ciriNya, dan semua makhluk adalah budak-budakNya. Ketetapan hukum-hukum kekuasaan qadari maupun syar’iNya berlaku pada mereka. “Yang sebenar-benarnya,” maksudnya wujudNya, kerajaanNYa, dan kesempurnaanNYa benar-benar haq. Sifat-sifat kesempurnaan tidaklah hakiki kecuali bagi Dzat Yang Memiliki keagungan. Termasuk hal itu adalah kepemilikan kekuasaan. Sesungguhnya selainNYa dari kalangan makhluk, walaupun mempunyai kekuasaan pada waktu-waktu tertentu yang meliputi sebagian aspek, akan tetapi kekuasaannya adalah kekuasaan yang pendek, batil lagi akan sirna. Adapun (kekuasaaan) Allah, maka akan tersu eksis dan tidak musnah, karena Diia Raja, Yang Mahahidup, Maha menangani yang lain lagi Mahaagung. “Dan janganlah kamu tergesa-gesa membaca al-Quran sebelum wahyunya disampaikan (secara sempurna) kepadamu,” maksudnya janganlah engkau bersegera untuk menangkap al-Quran ketika Jibril sedang membacakannya kepadamu. Bersabarlah sampai dia menuntaskannya. Jika sudah selesai, maka bacalah. Sesungguhnya Allah telah menjamin pengumpulannya bagimu di dadamu dan dalam bacaan al-Quranmu. Seperti yang difirmankan Allah, \"Janganlah kamu gerakkan lidahmu untuk (membaca) Al Qur'an karena hendak cepat-cepat (menguasai) nya. Sesungguhnya atas tanggungan Kami-lah mengumpulkannya (di dadamu) dan (membuatmu pandai) membacanya. Apabila Kami telah selesai membacakannya maka ikutilah bacaannya itu. Kemudian, sesungguhnya atas tanggungan Kami-lah penjelasannya.\" (Al-Qiyamah:16-19). Ketika ketergesaan dan kesegeraan beliau untuk menerima wahyu menunjukkan kecintaan beliau yang utuh kepada ilmu dan keantusiasan untuk menguasainya, maka Allah memerintahkan beliau untuk meminta tambahan ilmu. Sesungguhnya ilmu itu baik, dan banyak kebaikan itu dituntut, kebaikan itu berasal dari Allah, dan jalan menuju ke sana adalah melalui ketekunan, kerinduan kepada ilmu, memohon dan meminta pertolongan kepadaNya serta duduk bersimpuh kepadaNya di setiap waktu. Bisa di ambil pelajaran dari ayat yang mulia ini, mengenai etika dalam menerima ilmu, bahwa orang yang mendengarkan ilmu seyogyanya perlahan-lahan dan bersabar, sampai pendikte dan pengajar selesai dari penjelasannya yang saling berkaitan. Jika ia sudah selesai darinya, pencari ilmu menanyakan (nya) bila dia punya pertanyaan. Janganlah dia bersegera bertanya dan memotong keterangan orang yang mengajar. Sesungguhnya sikap ini penyebab terhalangi (dari menguasai ilmu). Demikian juga orang yang ditanya, seharusnya ia meminta penjelasan lebih lanjut tentang pertanyaan penanya dan melacak maksudnya sebelum menjawab. Sesungguhnya sikap ini menjadi penyebab ketepatan dalam menjawab dengan benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 114: Setelah Allah menyebutkan hukum jaza’i(pembalasan)nya terhadap hamba-hamba-Nya, hukum syar’i-Nya yang ada dalam kitab-Nya, di mana hal ini termasuk kerajaan-Nya, Dia berfirman, “Maka Mahatinggi Allah Raja yang sebenar-benarnya.” Yakni dari apa yang dikatakan orang-orang musyrik atau dari segala kekurangan. Di mana kerajaan adalah sifat-Nya, semua makhluk adalah milik-Nya, hukum-hukum kerajaan, baik yang qadari (terhadap alam semesta) maupun yang syar’i berlaku pada mereka. Wujud-Nya hak (benar), kerajaan-Nya hak dan kesempurnaan-Nya hak. Sifat-sifat kesempurnaan tidak ada yang hakiki kecuali bagi Allah Yang Memiliki Keagungan. Contohnya adalah kerajaan, meskipun di antara makhluk-Nya ada yang menjadi raja pada sebagian waktu dan terhadap orang-orang tertentu, namun kerajaannya terbatas dan akan sirna, adapun Allah, maka Dia senantiasa sebagai Raja, Mahahidup, Maha Berdiri Sendiri lagi Maha Mulia. Maksudnya, Nabi Muhammad shallallahu 'alaihi wa sallam dilarang Allah menirukan bacaan Jibril ‘alaihis salam kalimat demi kalimat, sebelum Jibril ‘alaihis salam selesai membacakannya, karena Allah menjamin untuk mengumpulkan Al Qur’an di dalam dadanya dan membacakannya. Oleh karena tergesa-gesanya Beliau untuk segera menghapal wahyu itu menunjukkan kecintaan yang sempurna kepada ilmu, maka Allah memerintahkan kepadanya agar meminta kepada Allah tambahan ilmu, karena ilmu adalah kebaikan, dan banyaknya kebaikan perlu dicari, dan hal itu berasal dari Allah. Tentunya, cara untuk memperolehnya adalah dengan bersungguh-sungguh, rindu kepada ilmu, memintanya kepada Allah, meminta pertolongan-Nya serta butuh kepadanya di setiap waktu. Dari ayat ini dapat diambil kesimpulan tentang adab mencari ilmu, yaitu bahwa orang yang mendengarkan ilmu sepatutnya bersabar tidak langsung mencatat sampai pengajar atau pengimla’ (pendikte) menyelesaikan kata-katanya yang masih berkaitan. Jika telah selesai, ia boleh bertanya jika ia memiliki pertanyaan dan tidak segera bertanya dan memotong pembicaraan guru, karena hal itu merupakan sebab terhalangnya ilmu. Demikian pula orang yang ditanya, sebaiknya meminta dijabarkan pertanyaan dan mengetahui maksudnya terlebih dahulu sebelum menjawab, karena hal itu merupakan sebab agar menjawab benar. Dengan Al Qur’an. Oleh karena itu, setiap kali diturunkan ayat Al Qur’an, maka bertambahlah ilmu Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 114",
    "description": "114. Dengan semua sifat itu, maka sesungguhnya mahatinggi Allah, raja yang sebenar-benarnya. Dan karena itu, janganlah kamu, wahai nabi Muhammad, tergesa-gesa membaca Al-Qur'an sebelum disempurnakan pewahyuannya kepadamu agar kamu tidak salah memahami dan mengajarkannya, dan katakanlah, 'ya tuhanku, tambahkanlah kepadaku ilmu pengetahuan yang bermanfaat. '115. Ayat-ayat berikut mengisahkan peristiwa yang terjadi pada adam dan pembangkangan iblis terhadap perintah Allah. Kisah ini diawali dengan peringatan Allah atas tipu daya iblis. Dan sesungguhnya telah kami perintahkan kepada adam dahulu untuk menjauhi iblis yang selalu berusaha menyesatkannya. Tetapi karena iblis pandai merayu maka dia lupa akan perintah itu. Dia lalu mengikuti ajakan iblis dan terjerumus sehingga melanggar larangan Allah. Dan saat itu tidak kami dapati padanya kemauan yang kuat untuk menolak rayuan iblis. '."
  }
]