[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan sungguh Kami telah perintahkan kepada Adam sebelum dia memakan (sesuatu) dari pohon tersebut, agar dia jangan memakan darinya. Dan Kami telah firmankan kepadanya, “Sesungguhnya iblis adalah musuhmu dan musuh istrimu, maka jangan sampai dia mengeluarkan kalian berdua dari surga. Akibatnya, kamu dan istrimu akan celaka di dunia.” Lalu setan membisik-bisikkan kepadanya, hingga Adam menaatinya. Adam lupa pesan tersebut dan Kami tidak mendapatinya memiliki kekuatan tekad untuk menjaga apa yang di perintahkan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. \"Dan sungguh Kami telah wasiatkan kepada Adam dahulu kala agar tidak memakan buah dari pohon itu. Kami melarangnya dan menjelaskan akibat dari melanggar larangan tersebut, namun ia lupa akan wasiat Kami lalu memakan buah pohon itu dan tidak bisa bersabar dengannya. Dan Kami tidak lihat dari dirinya kemauan kuat untuk menjaga wasiat Kami tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "115. Sungguh Kami telah memerintahkan Adam untuk tidak memakan buah dari pohon terlarang; namun setan menggodanya sehingga dia lupa perintah Kami, dan Kami tidak mendapatinya bersabar atas perintah itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. وَلَقَدْ عَهِدْنَآ إِلَىٰٓ ءَادَمَ (Dan sesungguhnya telah Kami perintahkan kepada Adam dahulu) Yakni Kami telah perintahkan dan wasiatkan kepadanya, yaitu berupa larangan baginya untuk memakan buah terlarang. فَنَسِىَ (maka ia lupa) Yakni tidak menjalankan perintah yang ditujukan kepadanya dan melupakan perintah tersebut, kemudian dia memakan buah dari pohon yang terlarang itu. وَلَمْ نَجِدْ لَهُۥ عَزْمًا (dan tidak Kami dapati padanya kemauan yang kuat) Iblis menggodanya sampai menjadi goyah pendiriannya dan lemah kemauannya sehingga dia tidak sabar menahan keinginan untuk memakan buah dari pohon itu, sebagaimana yang akan disebutkan pada ayat-ayat selanjutnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan kesalahan pertama dari bapak manusia yang kemudian terus menurun kepada anak-anaknya karena ketidak tahuannya tentang sesuatu dan tidak adanya kemauan kuat, Allah berfirman : { وَلَقَدْ عَهِدْنَآ إِلَىٰٓ ءَادَمَ مِن قَبْلُ فَنَسِىَ وَلَمْ نَجِدْ لَهُۥ عَزْمًا } \"Dan sesungguhnya telah Kami perintahkan kepada Adam dahulu, maka ia lupa (akan perintah itu), dan tidak Kami dapati padanya kemauan yang kuat\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Dan sungguh Kami memerintahkan Adam dan kami wasiatkan kepadanya agar tidak memakan pohon itu. Namun dia melupakan janji itu dan tidak mengindahkannya. Kami tidak mendapatinya bersabar untuk menghindari sesuatu yang dilarang untuknya dan dia juga tidak bermaksud melakukan dosa. Sesungguhnya tekad dan kesadarannya melemah karena manusia memang lemah, sehingga dia melakukan kesalahan tanpa disadari."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah memerintahan kepada Adam} Kami telah memerintahkan dan mewasiatkan kepadanya {sebelumnya, lalu dia lupa dan Kami tidak mendapati padanya tekad yang kuat} menjaga sesuatu yang diperintahkan kepadanya dan bersabar untuk memenuhi janjinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115. Maksudnya, Kami sungguh telah berwasiat kepada Adam dan memerintahkannya serta mengikatnya dengan sebuah janji untuk dia laksanakan. Adam memeganginya, tunduk dan patuh, dan bertekad menjalankannya. Meskiun demikian, Adam lupa atas perintah yang terarah kepadanya. Tekad bajannya pun telah hilang. Maka terjadilah peristiwa itu, sehingga menjadi bahan pelajaran bagi keturunan-keturunannya. Dan tabiat-tabiat mereka pun menyerupai tabiat Adam. Beliau lupa, maka keturunannya pun mengalami hal yang sama. Beliau berbuat kekeliruan dan keturunannya juga melakukan kesalahan. Beliau tidak bertahan lama berada dalam ketekadan yang kuat, dan keturunannya pun demikian. Beliau bersegera untuk bertaubat dari kesalahannya, mengiyakan, dan mengakuinya, maka dosanya diampuni. Dan barangsiapa meniru ayahnya, niscaya dia tidak sedang berbuat aniaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 115: Pesan Allah ini tersebut dalam ayat 35 surat Al Baqarah, di mana pada pesan itu, Beliau (Adam) dilarang memakan sebuah pohon. Yakni ia meninggalkan pesan Allah. Yakni keteguhan hati dan kesabaran dari perkara yang Kami larang. Apa yang dialaminya menjadi pelajaran bagi keturunannya. Tabiat keturunannya sama seperti tabiat bapak mereka; Adam. Adam lupa, keturunannya pun lupa, Adam berbuat salah, keturunannya pun berbuat salah, Adam tidak teguh hatinya, anak keturunannya pun tidak teguh hatinya. Namun kemudian Adam segera bertobat dari kesalahannya, mengakui kesalahannya, lalu dosa-dosanya diampuni. Setelah disebutkan kisah Adam secara garis besar, maka di ayat selanjutnya disebutkan kisah Adam secara lebih rinci."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 115",
    "description": "115. Ayat-ayat berikut mengisahkan peristiwa yang terjadi pada adam dan pembangkangan iblis terhadap perintah Allah. Kisah ini diawali dengan peringatan Allah atas tipu daya iblis. Dan sesungguhnya telah kami perintahkan kepada adam dahulu untuk menjauhi iblis yang selalu berusaha menyesatkannya. Tetapi karena iblis pandai merayu maka dia lupa akan perintah itu. Dia lalu mengikuti ajakan iblis dan terjerumus sehingga melanggar larangan Allah. Dan saat itu tidak kami dapati padanya kemauan yang kuat untuk menolak rayuan iblis. '116. Allah menjelaskan awal peristiwa ini. Dan ingatlah ketika kami berkata kepada malaikat, 'sujudlah kamu kepada adam!' lalu mereka pun sujud sebagai bentuk ketaatan kepada-Nya, kecuali iblis. Dengan takabur dia menolak perintah Allah tersebut."
  }
]