[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai Rasul) ketika Kami berfirman kepada para malaikat, “Sujudlah kalian kepada Adam, sebagai salam penghormatan dan pemuliaan,” maka mereka pun taat dan bersujud. Akan tetapi, iblis menolak bersujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Dan ingatlah -wahai Rasul- ketika Kami berfirman kepada para Malaikat, \"Sujudlah kalian kepada Adam dengan sujud penghormatan,\" Maka mereka semua pun sujud kecuali Iblis -yang saat itu bersama mereka namun tidak berasal dari bangsa mereka-, ia menolak untuk sujud karena sombong dan angkuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Hai Rasulullah, ingatlah pemuliaan Allah terhadap Adam ketika Dia memerintahkan para malaikat untuk bersujud kepada Adam, maka mereka mentaati-Nya dan bersujud kepadanya, kecuali Iblis yang enggan bersujud."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. وَإِذْ قُلْنَا لِلْمَلٰٓئِكَةِ اسْجُدُوا۟ لِاٰدَمَ (Dan (ingatlah) ketika Kami berkata kepada malaikat: “Sujudlah kamu kepada Adam”) Tafsir dari ayat ini telah disebutkan pada surat al-Baqarah: 34."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116. Dan ingatlah wahai Nabi ketika Kami berkata kepada para Malaikat: “Sujudlah kepada Adam dengan sujud penghormatan, bukan sujud penyembahan” Kemudian mereka semua bersujud kecuali Iblis yang menolak untuk bersujud karena dengki dan takabur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika Kami berfirman kepada para malaikat,“Sujudlah kepada Adam” Lalu mereka bersujud kecuali Iblis. Dia menolak (116)} dia menolak dan meremehkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116. Usai Allah menyempurnakan penciptaan Adam dengan TanganNya, mengajarinya seluruh nama, mengutamakan dan memuliakannya, maka Dia memerintahkan para malaikat untuk bersujud kepadanya sebagai tanda pemuliaan dan pengagungan serta penghormatan baginya. Mereka bersegera sujud dalam keadaan taat. Di tengah mereka ada iblis. Ia menyombongkan diri terhadap perintah Rabbnya, enggan bersujud kepada Adam, Ia berkata, \"Saya lebih baik daripadanya: Engkau ciptakan saya dari api sedang dia Engkau ciptakan dari tanah\". (Al-A’raf:12)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 116: Setelah Allah menyempurnakan kejadian Adam dengan Tangan-Nya, mengajarkan nama-nama benda kepadanya, melebihkan dan memuliakannya, maka Allah memerintahkan kepada para malaikat untuk sujud memuliakan dan menghormati Adam, maka mereka pun sujud mengikuti perintah Allah. Ketika itu di tengah-tengah mereka ada Iblis, ia bersikap sombong terhadap perintah Allah dan enggan bersujud kepada Adam, dia berkata, “Aku lebih baik darinya. Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.” Ketika itu jelaslah permusuhannya kepada Adam dan istrinya, dan tampaklah hasadnya yang menjadi sebab permusuhan, maka Allah memperingatkan Adam dan istrinya terhadap gangguan Iblis sebagaimana diterangkan dalam ayat selanjutnya. Dia adalah nenek moyang jin, dia sebelumnya tinggal bersama malaikat dan beribadah kepada Allah bersama mereka. Dia menolak sujud kepada Adam dan berkata, “Saya lebih baik daripadanya.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 116",
    "description": "116. Allah menjelaskan awal peristiwa ini. Dan ingatlah ketika kami berkata kepada malaikat, 'sujudlah kamu kepada adam!' lalu mereka pun sujud sebagai bentuk ketaatan kepada-Nya, kecuali iblis. Dengan takabur dia menolak perintah Allah tersebut. 117. Untuk memperingatkan adam tentang penolakan iblis, kemudian kami berfirman, 'wahai adam! sungguh iblis ini adalah musuh nyata bagimu dan bagi istrimu. Maka, sekali-kali janganlah sampai dia berhasil menggelincirkan dan mengeluarkan kamu berdua dari surga. Ketahuilah, hal itulah yang menyebabkan kamu menjadi celaka."
  }
]