[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami berkata, “Wahai Adam, sesungguhnya iblis ini adalah musuh bagimu dan bagi istrimu, maka hendaklah kalian berdua waspada terhadapnya, dan janganlah kalian berdua menaatinya dengan mendurhakaiKu, sehingga ia akan mengeluarkan kalian berdua dari surga, dan kamu menjadi celaka bila dikeluarkan darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Kemudian Kami berfirman, \"Wahai Adam! Sesungguhnya Iblis itu musuh bagimu dan bagi istrimu, maka jangan sekali-kali ia mengeluarkan engkau dan istrimu dari Surga dengan cara mentaati apa yang ia bisikkan kepada kalian berdua, sehingga nanti engkau akan menanggung beban berat dan menyengsarakanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117-119. Dan Kami telah memperingatkan Adam: “Sesungguhnya Iblis sangat memusuhimu dan istrimu, Hawa; maka janganlah kalian mentaatinya sehingga itu menyebabkan kalian dikeluarkan dari surga, sehingga kamu akan menderita dalam mencari rezeki. Kamu di surga dapat makan sehingga tidak akan pernah merasa lapar, dan dapat berpakaian sehingga tidak akan telanjang, serta kamu tidak akan merasa haus dan tidak akan tersengat panas matahari.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. فَتَشْقَىٰٓ (yang menyebabkan kamu menjadi celaka) Yang menjadikanmu letih dalam kehidupanmu di bumi untuk mencari penghidupan seperti dalam Bertani atau berkebun."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَلَا يُخْرِجَنَّكُمَا مِنَ الْجَنَّةِ فَتَشْقَىٰ } \"maka sekali-kali janganlah sampai ia mengeluarkan kamu berdua dari surga, yang menyebabkan kamu menjadi celaka\" kata asy-Syaqo' dinisbatkan hanya kepada Adam karena dua alasan : - Bahwasanya kesusahan yang menimpa seorang laki-laki adalah merupakan kecelakaan bagi keluarganya pula, sebagaimana kebahagiaannya adalah kebahagiaan bagi keluarganya pula. - Diantara kesusahan adalah keletihan dalam mencari nafkah, dan itu merupakan kewajiban seorang laki-laki bukan bagi seorang perempuan; karena seorang laki-laki adalah pelindung bagi istrinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Lalu Kami berkata: “Wahai Adam, Sesungguhnya Iblis ini adalah musuhmu dan istrimu, Hawa. Maka jangan sampai dia menjadi sebab kalian dikeluarkan dari surga dengan bisikan-bisikannya, sehingga kamu terpikat dengan godaan dunia yang sangat banyak.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami berfirman,“Wahai Adam, sesungguhnya ini adalah musuh bagimu dan bagi istrimu. Maka jangan sekali-kali dia mengeluarkan kalian berdua dari surga. Kelak kamu akan menderita (117)} maka kamu akan menderita dan terkelabui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117-119. Saat itulah, menjadi jelas permusuhan iblis yang memuncak terhadap Adam dan istrinya, ketika dia menjadi musuh bagi Allah. Sudah terlihat kedengkiannya, yang memicu faktor permusuhannya. Maka Allah memperingatkan Adam dan istrinya dari (bahaya) iblis. Allah berfirman, “Jangan sampai dia, ‘mengeluarkan kamu berdua dari surge, yang menyebabkan kamu menjadi celaka’.” Yaitu jika setan (berhasil) mengeluarkanmu darinya, padahal di dalamnya kamu mendapatkan rizki yang menyenangkan dan kenyamanan yang sempurna. “Sesungguhnya kamu tidak akan kelaparan di dalamnya dan tidak akan telanjang. Dan bahwa kamu tidak akan merasa dahaga dan tidak (pula) akan ditimpa panas matahari di dalamnya,” maksudnya, matahari tidak mengenaimu dengan terik panasnya. Allah menjamin bagi beliau kontinuitas suplai makanan, minuman, sandang, air, tanpa kepayahan dan kecapaian. Akan tetapi, Allah melarangnya dari memakan (buah) pepohonan tertentu. Allah berfirman, \"dan janganlah kamu berdua mendekati pohon ini, lalu menjadilah kamu berdua termasuk orang-orang yang lalim\". (Al-A’raf:19)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 117: Karena di surga kamu memperoleh rezeki yang banyak dan nikmat tanpa susah payah serta istirahat yang sempurna. Yakni kamu akan kelelahan ketika keluar dari surga, di mana untuk makan, kamu harus menggarap tanah, menanaminya dengan tumbuhan, memetiknya, memasaknya dsb. Berbeda dengan di surga semua yang diinginkan ada di hadapan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 117",
    "description": "117. Untuk memperingatkan adam tentang penolakan iblis, kemudian kami berfirman, 'wahai adam! sungguh iblis ini adalah musuh nyata bagimu dan bagi istrimu. Maka, sekali-kali janganlah sampai dia berhasil menggelincirkan dan mengeluarkan kamu berdua dari surga. Ketahuilah, hal itulah yang menyebabkan kamu menjadi celaka. 118-119. Wahai adam, sungguh, ada jaminan untukmu di surga sana bahwa engkau tidak akan kelaparan di dalamnya. Allah telah menyediakan bagimu di sana buah-buahan dan makanan lain. Dan kamu di surga itu juga tidak akan telanjang karena Allah telah menyiapkan pakaian untukmu. Dan sungguh, di surga sana engkau tidak akan merasa dahaga karena ada mata air yang selalu memancarkan air yang jernih di sana. Dan di sana tidak pula kamu akan ditimpa panas matahari di dalamnya karena rimbunnya dedaunan dari beragam pepohonan di sana. '."
  }
]