[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kamu tidak akan merasa kehausan di dalam surga ini dan panas matahari tidak mengenaimu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Dan Dia akan memberimu minum hingga engkau tidak merasa dahaga, dan memberimu tempat teduh hingga engkau tidak di timpa panas matahari.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. وَأَنَّكَ لَا تَظْمَؤُا۟ فِيهَا وَلَا تَضْحَىٰ (dan sesungguhnya kamu tidak akan merasa dahaga dan tidak (pula) akan ditimpa panas matahari di dalamnya) Yakni kamu tidak akan merasa dahaga di surga dan tidak akan merasakan panas sinar matahari, tidak seperti penghuni bumi. Sumber-sumber keletihan di dunia adalah ketika mencari makan, minum, pakaian, dan tempat tinggal."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "118-119 { إِنَّ لَكَ أَلَّا تَجُوعَ فِيهَا وَلَا تَعْرَىٰ - وَأَنَّكَ لَا تَظْمَؤُا۟ فِيهَا وَلَا تَضْحَىٰ } \"Sesungguhnya kamu tidak akan kelaparan di dalamnya dan tidak akan telanjang - Dan sesungguhnya kamu tidak akan merasa dahaga dan tidak (pula) akan ditimpa panas matahari di dalamnya\" Diantara hal yang menakjubkan dari dua ayat ini (sekalipun ayatnya yang pendek) adalah keduanya mengumpulkan beberapa asas perekonomian, dan infrastruktur yang menopang kehidupan manusia hanya dalam satu baris, yaitu : makan, minum, pakaian dan tempat tinggal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119. Dan kamu tidak akan kehausan di dalamnya dan tidak akan mendapatkan sengatan matahari yang panas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu tidak merasa dahaga} kamu tidak kehausan {di sana dan tidak akan ditimpa terik matahari”} dan kamu tidak terkena matahari sehingga panasnya menyakitimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117-119. Saat itulah, menjadi jelas permusuhan iblis yang memuncak terhadap Adam dan istrinya, ketika dia menjadi musuh bagi Allah. Sudah terlihat kedengkiannya, yang memicu faktor permusuhannya. Maka Allah memperingatkan Adam dan istrinya dari (bahaya) iblis. Allah berfirman, “Jangan sampai dia, ‘mengeluarkan kamu berdua dari surge, yang menyebabkan kamu menjadi celaka’.” Yaitu jika setan (berhasil) mengeluarkanmu darinya, padahal di dalamnya kamu mendapatkan rizki yang menyenangkan dan kenyamanan yang sempurna. “Sesungguhnya kamu tidak akan kelaparan di dalamnya dan tidak akan telanjang. Dan bahwa kamu tidak akan merasa dahaga dan tidak (pula) akan ditimpa panas matahari di dalamnya,” maksudnya, matahari tidak mengenaimu dengan terik panasnya. Allah menjamin bagi beliau kontinuitas suplai makanan, minuman, sandang, air, tanpa kepayahan dan kecapaian. Akan tetapi, Allah melarangnya dari memakan (buah) pepohonan tertentu. Allah berfirman, \"dan janganlah kamu berdua mendekati pohon ini, lalu menjadilah kamu berdua termasuk orang-orang yang lalim\". (Al-A’raf:19)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 119",
    "description": "118-119. Wahai adam, sungguh, ada jaminan untukmu di surga sana bahwa engkau tidak akan kelaparan di dalamnya. Allah telah menyediakan bagimu di sana buah-buahan dan makanan lain. Dan kamu di surga itu juga tidak akan telanjang karena Allah telah menyiapkan pakaian untukmu. Dan sungguh, di surga sana engkau tidak akan merasa dahaga karena ada mata air yang selalu memancarkan air yang jernih di sana. Dan di sana tidak pula kamu akan ditimpa panas matahari di dalamnya karena rimbunnya dedaunan dari beragam pepohonan di sana. '120. Kemudian setan yang iri pada anugerah besar yang Allah berikan kepada nabi adam itu membisikkan pikiran jahat kepadanya dengan berkata, 'wahai adam, maukah aku tunjukkan kepadamu pohon keabadian yang bisa membuatmu hidup abadi di surga, dan kerajaan yang terus berada dalam genggamanmu sehingga tidak akan binasa''."
  }
]