[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12. Ketika Musa mendatangi api itu, Allah memanggilnya, “Wahai Musa Sesungguhnya Aku adalah Tuhanmu, maka lepaslah dua terompahmu. Sesungguhnya engkau sekarang ini berada di lembah Thuwa yang Aku berkahi.” Ini sebagai persiapan untuk bermunajat kepada Tuhannya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sesungguhnya Aku adalah Tuhanmu, maka lepaslah kedua terompahmu agar engkau siap berbicara dengan-Ku, karena sesungguhnya engkau berada di lembah yang suci yaitu Ṭuwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. إِنِّىٓ أَنَا۠ رَبُّكَ فَاخْلَعْ نَعْلَيْكَ ۖ (Sesungguhnya Aku inilah Tuhanmu, maka tanggalkanlah kedua terompahmu) Allah memerintahkannya agar melepas kedua alas kakinya, karena itu lebih mendekatkannya pada kerendahan hati serta lebih beradab dan menghormati. إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى (sesungguhnya kamu berada dilembah yang suci, bernama Thuwa) Makna (المقدس) yang disucikan. Dan (طوى) adalah nama dari lembah yang terletak di negeri Sina’."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sesungguhnya Aku adalah Allah, Tuhanmu. Maka lepaskanlah sendalmu supaya kamu lebih rendah hati dan beradab. Sesungguhnya kamu berada di lembah suci yang dimuliakan yang dinamakan Thuwa yang berada disamping bukit Thur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Aku adalah Tuhanmu. Lepaskanlah} lepaskanlah {kedua sendalmu karena sesungguhnya kamu berada di lembah yang suci} yang suci {yaitu Thuwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Sesungguhnya Aku ini adalah Rabbmu, maka tinggalkanlah kedua terompahmu, sesungguhnya kamu berada di lembah yang suci, Thuwa.” Allah mengabarkan kepada beliau bahwa Dia adalah Rabbnya, dan memerintahkan beliau untuk bersiap sedia melakukan munajat kepadaNya dan memperhatikannya. Beliau melepaskan kedua sandalnya, karena berada di lembah yang disucikan, bersih lagi diagungkan. Seandainya tidak ada (petunjuk) tentang (keharusan) menyucikan lembah itu kecuali (petunjuk) bahwa Allah memilihnya untuk tempat bermunajat dengan Musa, KalimNya, maka sudahlah cukup (sebagai tanda kesuciannya). Banyak ahli tafsir mengatakan, “sesungguhnya Allah memerintahkan beliau untuk melepaskan dua sandalnya. Karena keduanya terbuat dari kulit keledai.” Wallahu a’lam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 12: Allah memberitahukan kepadanya, bahwa Dia adalah Tuhannya, dan Dia memerintahkan Musa untuk bersiap-siap bermunajat dengan-Nya serta serius memperhatikannya dan melepas sandalnya karena sedang berada di lembah suci Thuwa. Kalau sekiranya tidak ada penyucian dari-Nya tetapi hanya sebagai tempat yang dipilih Allah untuk bermunajat dengan Musa, maka yang demikian cukup sebagai keutamaannya. Banyak para mufassir berkata, “Sesungguhnya Allah memerintahkan Musa melepas kedua sandalnya, karena keduanya terbuat dari kulit keledai.” Wallahu a’lam. Bisa juga diartikan “yang diberkahi.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 12",
    "description": "'sungguh, aku yang memanggilmu adalah tuhanmu yang memelihara dan membimbingmu. Maka, sebagai penghormatan, hendaknya engkau lepaskan kedua terompahmu karena saat ini sesungguhnya engkau berada di lembah yang suci, tuwa. '13. Begitu musa melepas terompahnya, Allah berfirman, 'dan ketahuilah, wahai musa, sesungguhnya aku telah memilih engkau sebagai nabi dan rasul untuk memberi peringatan kepada mereka yang ingkar. Maka, dengarkanlah apa yang akan diwahyukan kepadamu, lalu laksanakanlah untuk memberi pengajaran kepada kaummu."
  }
]