[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian setan membisik-bisikkan pikiran buruk kepada Adam, dan berkata kepadanya, “Maukah kamu aku tunjukkan suatu pohon yang bila kamu memakan dari buahnya, kamu akan hidup abadi, tidak akan mati, dan kamu akan memiliki kerajaan yang tidak akan pernah lenyap dan habis?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Kemudian setan membisikkan kepada Adam dan berkata kepadanya, \"Maukah aku tunjukkan kepadamu sebuah pohon yang apabila seseorang memakan buahnya maka ia tidak akan mati selamanya, tetapi ia akan terus menerus hidup kekal, dan akan memiliki kerajaan yang terus kekal dan tidak akan binasa lagi punah?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120-121. Ketika setan melihat penghormatan yang didapatkan Adam, maka dia mulai menggodanya: “Maukah aku tunjukkan sebuah pohon, jika seseorang memakan buahnya maka dia akan hidup kekal dan mendapat kerajaan yang tidak akan hancur?” Setan terus mengatakan hal ini dan bersumpah bahwa dia adalah pemberi nasehat yang dapat dipercaya, sehingga dia berhasil menipu mereka berdua. Adam dan Hawa memakan buah dari pohon yang dilarang Allah untuk memakannya, sehingga aurat mereka berdua tersingkap; hal ini membuat mereka malu, sehingga mereka mengambil beberapa daun dari pohon yang ada di surga untuk menutupi aurat mereka. Adam telah melanggar perintah Tuhannya, dan salah dalam mencari jalan kekekalan di dalam surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. فَوَسْوَسَ إِلَيْهِ الشَّيْطٰنُ (Kemudian syaitan membisikkan pikiran jahat kepadanya) Yakni Iblis berkata kepada keduanya dengan berbisik. شَجَرَةِ الْخُلْدِ (pohon khuldi) Yakni orang yang memakan buahnya akan menjadi bebas dari kematian. وَمُلْكٍ لَّا يَبْلَىٰ (dan kerajaan yang tidak akan binasa) Yakni yang tidak akan sirna dan tidak akan lenyap. Ini merupakan kebohongan Iblis agar dapat menggiring mereka berdua untuk melakukan kemaksiatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120. Lalu setan membisikinya melalui jiwanya dengan berkata: “Wahai Adam, Bolehkah aku menunjukkan kepadamu pohon keabadian. Barangsiapa memakan sebagian darinya maka dia tidak akan mati, dan aku akan menunjukkan cara menjadi malaikat yang tidak akan hilang dan lenyap.” Dan itu adalah kebohongan Iblis"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu setan membisikkan kepadanya} kepada Adam {Ia berkata,“Wahai Adam, maukah aku menunjukkan kepadamu pohon khuldi} pohon yang mana jika kamu memakannya, maka kamu akan abadi selamanya {dan kerajaan yang tidak akan binasa”} yang tidak akan hilang dan tidak berhenti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. Setan terus menerus membisikkan (pikiran jahat) keepada mereka berdua dan mempengaruhinya untuk memandang “makan dari pepohonan itu” sebagai hal yang baik. Setan berkata, “Hai Adam, maukah saya tunjukkan kepada kamu pohon khuldi,” yaitu [pohon], yang mana siapa saja yang memakan darinya, niscaya dia kekal abadi di surge, “dan kerajaan yang tidak akan binasa,” maksudnya yang tidak terputus, jika engkau mengkonsumsi (sesuatu) darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 120: Iblis datang kepada Adam sebagai seorang penasehat dan berbicara dengan lembut sehingga Adam dan istrinya (Hawa) tertipu, keduanya akhirnya memakan pohon yang terlarang itu dan keduanya pun menyesal, pakaiannya lepas dan tampaklah auratnya setelah sebelumnya tertutup, dan keduanya pun menutupi auratnya dengan daun-daun (yang ada di) surga dan merasa malu. Pohon itu dinamakan Syajaratulkhuldi (pohon keabadian), karena kata setan, orang yang memakan buahnya akan kekal di surga, tidak akan mati. Pohon yang dilarang Allah mendekatinya tidak dapat dipastikan apa namanya, sebab Al Quran dan Hadits tidak menerangkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 120",
    "description": "120. Kemudian setan yang iri pada anugerah besar yang Allah berikan kepada nabi adam itu membisikkan pikiran jahat kepadanya dengan berkata, 'wahai adam, maukah aku tunjukkan kepadamu pohon keabadian yang bisa membuatmu hidup abadi di surga, dan kerajaan yang terus berada dalam genggamanmu sehingga tidak akan binasa''121. Bujuk rayu iblis berhasil melenakan adam dan hawa. Lalu keduanya memakan buah-Nya. Begitu mereka memakannya, lalu tampaklah oleh keduanya aurat mereka dan ketika itu muncullah rasa malu sehingga mulailah keduanya menutupinya dengan daun-daun dari pepohonan surga. Dan akibat dari kelenaan ini telah durhakalah adam kepada tuhan dan sesatlah dia karenanya."
  }
]