[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Adam dan Hawwa’ memakan (buah) dari pohon itu yang Allah melarang mereka berdua darinya, maka terbukalah aurat mereka berdua, sedang sebelumnya tidak tampak oleh pandangan mata. Lalu mulailah mereka berdua memetik daun-daun dari pohon-pohon surga dan melekatkannya pada tubuh mereka untuk menutupi aurat mereka yang terbuka. Adam telah melanggar perintah Tuhannya. Maka dia menjadi orang yang bersalah dengan memakan dari pohon yang Allah telah melarangnya untuk mendekatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Maka Adam dan Hawa pun memakan buah pohon yang dilarang untuk dimakan tersebut, lalu tampaklah kedua aurat mereka setelah awalnya tertutup rapat, sehingga mereka pun segera memetik dedaunan pohon-pohon Surga dan menutupi aurat mereka dengannya. Adam telah menyelisihi perintah Tuhannya karena tidak mengindahkan perintah-Nya untuk tidak memakan dari buah pohon tersebut, sehingga ia pun melampaui batasan yang seharusnya tidak pantas dilakukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. فَأَكَلَا مِنْهَا فَبَدَتْ لَهُمَا سَوْءٰتُهُمَا (Maka keduanya memakan dari buah pohon itu, lalu nampaklah bagi keduanya aurat-auratnya) Tafsir dari potongan ayat ini dan setelahnya pada surat al-A’raf. وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ الْجَنَّةِ ۚ( dan mulailah keduanya menutupinya dengan daun-daun (yang ada di) surga) Yakni merangkai dedaunan untuk menutup uarat mereka. Terdapat pendapat mengatakan bahwa keduanya menutup auratnya dengan daun pohon tin. وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ( dan durhakalah Adam kepada Tuhan dan sesatlah ia) Yakni kemudian dia tersesat dari kebenaran. Pendapat lain mengatakan maknanya adalah kemudian kehidupannya menjadi sulit karena harus turun ke dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121. Lalu Adam dan Hawa memakan (buah) dari pohon yang dilarang itu. Kemudian tampaklah aurat keduanya. Dan secara tabiat keduanya menutupi auratnya menggunakan dedaunan surga. Dan Adam telah bermaksiat kepada Tuhannya dengan memakan buah dari pohon itu. Dia menolak hidayah dan memilih kesalahan daripada kebenaran, yang mana dia tertipu oleh ucapan musuhnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu mereka berdua memakannya} lalu Adam dan hawa memakan buah dari pohon itu {sehingga tampaklah bagi keduanya aurat mereka} lalu tersingkap bagi keduanya aurat mereka {dan keduanya mengambil} mengambil {daun-daun surga untuk menutupinya. Adam telah durhaka kepada Tuhannya dan dia berbuat salah} lalu dia menyimpang dari jalan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121. SEtan mendatanginya dalam rupa orang yang berniat baik, bertutur kata lembut, maka Adam memakannya. Lalu terjatuhlah sesuatu yang ada di tangannya, dan lenyaplah pakaian mereka, maksiat mereka pun menjadi jelas. Aurat masing-masing terlihat oleh yang lain, yang sebelumnya mereka dalam keadaan tertutup auratnya. Mulailah keduanya menutupinya dengan daun-daun pohon-pohon surge untuk menutupi diri dengannya. Mereka dirundung oleh malu yang hanya Allah saja mengetahui tingkat rasa malu mereka. “Dan durhakalah Adam Rabbnya, lalu sesatlah ia,” mereka berdua pun bersegera bertaubat dan kembali kepadaNya dengan berkata,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 121: Untuk menutupi auratnya. Yang dimaksud dengan durhaka di sini adalah melanggar larangan Allah karena lupa, dengan tidak sengaja, sebagaimana disebutkan dalam ayat 115 surat ini. Sedangkan yang dimaksud dengan sesat adalah mengikuti apa yang dibisikkan setan. kesalahan Adam ‘alaihis salam meskipun tidak begitu besar menurut ukuran manusia biasa sudah dinamakan durhaka dan sesat, karena tingginya martabat Adam ‘alaihis salam dan untuk menjadi teladan bagi orang besar dan pemimpin agar menjauhi perbuatan-perbuatan yang terlarang meskipun kecil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 121",
    "description": "121. Bujuk rayu iblis berhasil melenakan adam dan hawa. Lalu keduanya memakan buah-Nya. Begitu mereka memakannya, lalu tampaklah oleh keduanya aurat mereka dan ketika itu muncullah rasa malu sehingga mulailah keduanya menutupinya dengan daun-daun dari pepohonan surga. Dan akibat dari kelenaan ini telah durhakalah adam kepada tuhan dan sesatlah dia karenanya. 122. Allah maha pengasih kepada makhluk-Nya, tidak terkecuali kepada adam. Meski dia telah melakukan kesalahan karena terbujuk setan, namun kemudian tuhannya tetap memilih dia sebagai khalifah. Ketika dia bertobat dan memohon ampun, maka dia menerima tobatnya dan memberinya petunjuk."
  }
]