[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Allah memilih Adam, menjadikannya orang yang dekat (kepadaNya), menerima taubatnya, dan memberinya hidayah kepada jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Lalu Allah menjadikannya sebagai makhluk terpilih, menerima tobatnya, dan memberinya petunjuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122-123. Kemudian Adam mendapat pengajaran dari Allah tentang cara bertaubat, sehingga Allah menerima taubatnya; kemudian Allah memilihnya dan memberinya petunjuk menuju kebenaran. Lalu Allah kembali memperingatkan Adam dan Hawa dari Iblis: “Turunlah kalian berdua dari surga menuju bumi bersama Iblis; sebagian kalian akan memusuhi sebagian yang lain. Dan apabila datang dari-Ku kepada kalian kitab-kitab dan para rasul untuk memberi petunjuk kepada kalian, maka barangsiapa yang mengikuti petunjuk-Ku maka dia tidak akan tersesat di dunia dan tidak akan menderita di akhirat karena azab.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. ثُمَّ اجْتَبٰهُ رَبُّهُۥ (Kemudian Tuhannya memilihnya) Yakni Allah memilih dan mendekatkannya setelah Adam bertaubat dari kemaksiatan dan memohon ampun dari Tuhannya serta mengakui telah menzalimi dirinya sendiri. فَتَابَ عَلَيْهِ وَهَدَىٰ (maka Dia menerima taubatnya dan memberinya petunjuk) Menerima taubatnya dari kemaksiatannya dan Allah memberinya petunjuk untuk bertaubat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ ثُمَّ اجْتَبَاهُ رَبُّهُ فَتَابَ عَلَيْهِ وَهَدَىٰ } \"Kemudian Tuhannya memilihnya maka Dia menerima taubatnya dan memberinya petunjuk\" bertolak belakang dengan ayat : { وَعَصَىٰٓ ءَادَمُ رَبَّهُۥ فَغَوَىٰ } \"dan durhakalah Adam kepada Tuhan dan sesatlah ia\" [ Thaha : 121 ] dan dengan ayat : { ٱهْبِطَا مِنْهَا جَمِيعًۢا ۖ } \"Allah berfirman: \"Turunlah kamu berdua dari surga bersama-sama\" [ Thaha : 123 ], maka dijelaskan bahwa al-Ijtiba' dalam ayat ini menunjukkan kejadiannya setelah Adam dan istrinya Hawwa diberi sanksi keluar dari surga sebagaimana yang dijelaskan dalam surah al-Baqarah, dan perstiwa ini sesuai dengan aturan dikeluarkannya Adam dari surga karena kesalahannya bukan karena taubatnya, adapun faidah dari bertolak belakngnya ayat-ayat di atas sebagai berita tentang keinginan kuat Adam untuk kebaikan pada dirinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122. Kemudian Tuhan memilih Adam dan membuatnya lebih dekat denganNya setelah dia bertaubat dan meminta ampunan, lalu menerima taubatnya dan menolongnya agar tetap teguh dalam melakukan ketaatan dan menghindari sebab-sebab dari sesuatu yang merintanginya di dunia. Dan apa yang telah lewat darinya di surga merupakan pelajaran dan nasehat yang jelas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Tuhannya memilih dia} memilih dia {Lalu Dia menerima taubatnya dan memberinya petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122. \"Ya Tuhan kami, kami telah menganiaya diri kami sendiri, dan jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya pastilah kami termasuk orang-orang yang merugi\". (Al-A’raf:23) Kemudian Rabbnya mengistimewakan dan memilihnya serta memudahkan baginya untuk bertaubat. \"Maka Allah menerima taubatnya dan memberinya petunjuk.\" Pasca taubat, kondisi beliau lebih baik dari sebelumnya. Tipu daya musuh kembali ke pemiliknya, usaha makarnya tidak bertaji. Sementara itu, kenikmatan yang tercurahkan kepada Adam dan anak cucunya semakin lengkap. Kewajiban mereka adalah menggunakannya dengan baik dan mengakui (nikmat itu berasal dari Allah), serta selalu waspada terhadap musuh yang tetap mengintai lagi menunggu mereka siang dan malam. \"Hai anak Adam, janganlah sekali-kali kamu dapat ditipu oleh setan sebagaimana ia telah mengeluarkan kedua ibu bapamu dari surga, ia menanggalkan dari keduanya pakaiannya untuk memperlihatkan kepada keduanya 'auratnya. Sesungguhnya ia dan pengikut-pengikutnya melihat kamu dari suatu tempat yang kamu tidak bisa melihat mereka. Sesungguhnya Kami telah menjadikan setan-setan itu pemimpin-pemimpin bagi orang-orang yang tidak beriman.\" (Al-A’raf:27)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 122: Setelah itu Adam dan Hawa’ segera bertobat dan berdoa, “Ya Tuhan kami, kami telah menganiaya diri kami sendiri, dan jika Engkau tidak mengampuni kami dan memberi rahmat kepada kami, niscaya kami termasuk orang-orang yang rugi.” Maksudnya, Allah memilih Adam ‘alaihis salam untuk menjadi orang yang dekat kepada-Nya. Oleh karena itu, keadaannya setelah tobat menjadi lebih baik daripada sebelumnya, namun musuhnya kembali melakukan tipu daya terhadapnya, akan tetapi tipu dayanya kalah karena hidayah Allah kepadanya, maka sempurnalah nikmat untuk Adam dan keturunannya, mereka harus bersyukur terhadap nikmat itu, serta tetap waspada terhadap musuh yang senantiasa memantau dan mencari celah untuk menggelincirkan anak Adam di siang dan malam. Allah Subhaanahu wa Ta'aala berfirman, “Wahai anak Adam! Janganlah sekali-kali kamu dapat ditipu oleh setan sebagaimana ia telah mengeluarkan kedua ibu bapakmu dari surga, ia menanggalkan dari keduanya pakaiannya untuk memperlihatkan kepada keduanya auratnya. Sesungguhnya dia dan pengikut-pengikutnya melihat kamu dan suatu tempat yang kamu tidak bisa melihat mereka. Sesungguhnya Kami telah menjadikan setan-setan itu pemimpin-pemimpin bagi orang-orang yang tidak beriman.” (Al A’raaf: 27)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 122",
    "description": "122. Allah maha pengasih kepada makhluk-Nya, tidak terkecuali kepada adam. Meski dia telah melakukan kesalahan karena terbujuk setan, namun kemudian tuhannya tetap memilih dia sebagai khalifah. Ketika dia bertobat dan memohon ampun, maka dia menerima tobatnya dan memberinya petunjuk. 123. Allah berfirman, 'wahai adam dan hawa, turunlah kamu berdua dari surga bersama-sama. Ketahuilah, sebagian dari kamu akan menjadi musuh bagi sebagian yang lain. Maka, jika datang kepadamu petunjuk dari-ku untuk menjadi pedoman dalam kehidupanmu, lalu siapa saja yang mengikuti petunjuk-ku dan melaksanakan ajaran-ku, dia tidak akan sesat di dunia dan tidak akan pula celaka dalam kehidupan akhirat. '."
  }
]