[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada Adam dan Hawwa’, “Turunlah kalian berdua semuanya dari surga bersama dengan iblis. Kalian berdua dan iblis saling bermusuhan. Maka jika datang kepada kalian berdua petunjuk dan penjelasan dariKu, lalu barangsiapa mengikuti petunjuk dan penjelasan dariKu dan dia mengamalkannya, sesungguhnya dia telah lurus di dunia, dan memperoleh hidayah, serta tidak celaka di akhirat dengan tertimpa hukuman Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Allah berfirman kepada Adam dan Hawa, \"Turunlah kalian berdua beserta Iblis dari Surga. Iblis adalah musuh bagi kalian berdua, dan kalian berdua adalah musuh baginya. Maka apabila datang kepada kalian penjelasan tentang jalan agama-Ku, maka ketahuilah bahwa barangsiapa diantara kalian yang mengikuti jalan-Ku, beramal dengannya, dan tidak keluar darinya maka dia pasti tidak akan tersesat dari jalan kebenaran, dan tidak akan pula sengsara karena azab di Akhirat kelak, tetapi Allah akan memasukkannya ke dalam Surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. قَالَ اهْبِطَا مِنْهَا جَمِيعًۢا ۖ (Allah berfirman: “Turunlah kamu berdua dari surga bersama-sama) Yakni turunlah ke bumi. بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ ۖ( sebagian kamu menjadi musuh bagi sebagian yang lain) Yakni Wahai manusi, sebagian kalian akan menjadi musuh bagi sebagian lainnya di dunia dalam urusan penghidupan dan lainnya, sehingga hal itu akan menimbulkan peperangan dan permusuhan. فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى(Maka jika datang kepadamu petunjuk daripada-Ku, lalu barangsiapa yang mengikut petunjuk-Ku) Dengan para Rasul yang Aku utus dan kitab yang Aku turunkan. فَمَنِ اتَّبَعَ هُدَاىَ فَلَا يَضِلُّ (ia tidak akan sesat) Di dunia. وَلَا يَشْقَىٰ (dan tidak akan celaka) Di akhirat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Barangsiapa yang mengikuti petunjuk Allah niscaya tidak akan tersesat sebagaimana tersesatnya orang-orang yang disesatkan oleh Allah dan tidak pula mereka akan celaka seperti mereka yang dimurkai oleh Allah, Allah berfirman : { فَإِمَّا يَأْتِيَنَّكُم مِّنِّى هُدًى فَمَنِ ٱتَّبَعَ هُدَاىَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ } \"Maka jika datang kepadamu petunjuk daripada-Ku, lalu barangsiapa yang mengikut petunjuk-Ku, ia tidak akan sesat dan tidak akan celaka\". 2 ). Ibnu 'Abbas berkata : Sesungguhnya Allah menjaga hamba-Nya dari kesesatan di dunia dan celaka di akhirat, kemudian beliau membacakan ayat : { فَمَنِ ٱتَّبَعَ هُدَاىَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ } \" lalu barangsiapa yang mengikut petunjuk-Ku, ia tidak akan sesat dan tidak akan celaka\" Yakni tidak akan tersesat di dunia dan tidak celaka di akhirat. 3 ). Ibnu al-Jauzi dalam kitabnya mengatakan tentang ayat ini : aku memperhatikan firman Allah : { فَمَنِ ٱتَّبَعَ هُدَاىَ فَلَا يَضِلُّ وَلَا يَشْقَىٰ }, dan aku menemukan suatu hakikat; bahwa siapapun yang mengikuti al-Qur'an dan sunnah dan mengamalkan keduanya; sungguh ia telah selamat dari kesesatan tanpa diragukan sedikitpun, dan celaka yang tadinya akan menimpanya akan terangkat tanpa keraguan juga; ayat ini juga dijelaskan oleh ayat lain : { وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُۥ مَخْرَجًا } \"Barangsiapa bertakwa kepada Allah niscaya Dia akan mengadakan baginya jalan keluar\" [ Ath-Thalaq : 2 ]. 4 ). Sesungguhnya dampak jika sesorang berpaling dari al-Qur'an : jika ia meninggalkanya karena kesombongannya, maka balasannya adalah kebinasaan, atau jika ia meminta petunjuk selain daripadanya maka akan disesatkan oleh Allah, sebagaimana yang dikuatkan juga oleh hadits Ali : ( هُوَ الَّذِي مَنْ تَرَكَهُ مِنْ جَبَّارٍ قَصَمَهُ اللَّهُ وَمَنْ ابْتَغَى الْهُدَى فِي غَيْرِهِ أَضَلَّهُ اللَّهُ ) \"Ia adalah kitab yang jika ditinggalkan oleh orang-orang yang sombong, niscaya akan dibinasakan oleh Allah. Barangsiapa mencari petunjuk pada kitab selainnya, niscaya Allah akan menyesatkannya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123. Allah berfirman kepada Adam dan Hawa: “Turunlah kalian berdua dari surga menuju bumi. Wahai manusia, sebagian kalian akan menjadi musuh sebagian lainnya dengan saling bersaing dalam kehidupan. Dan jika datang kepada kalian hidayah dariKu dengan menurunkan kitab dan mengutus rasul, maka barangsiapa yang mengikuti hidayahKu dengan mengerjakan perintah-perintahKu, maka dia tidak tersesat di dunia dan tidak akan menderita di akhirat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Turunlah kalian berdua dari sana} turunlah kalian dari surga menuju bumi {Sebagian kalian menjadi musuh bagi yang lain. Jika datang kepada kalian petunjuk dariKu, Maka siapa saja yang mengikuti petunjukKu, maka dia tidak akan tersesat dan tidak akan celaka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123. Allah memberitahukan bahwasanya Dia memerintahkan Adam dan iblis untuk turun ke bumi, dan hendaknya mereka menganggap setan sebagai musuh bagi mereka dan mewaspadainya, mempersipkan kesiapan (menghadapinya) dan melawannya. Dan sesungguhnya Allah akan menurunkan kepada mereka kitab-kitab (Allah), dan mengutus para RasulNya untuk menjelaskan jalan yang lurus yang menghubungkan kepadaNya dan surgaNya. Para rasul itu akan memperingatkan mereka dari musuh yang nyata ini. Dan kapan saja petunjuk itu datang kepada mereka, yaitu kitab-kitab dan para rasul, maka sungguh barangsiapa yang mengikutinya, mengikuti perintahnya, dan menjauhi larangannya, maka sesungguhnya dia tidak akan tersesat di dunia dan akhirat serta tidak celaka di dua tempat itu. Bahkan dia dipandu menuju jalan yang lurus di dunia dan akhirat. Dia mendapatkan kebahagiaan dan rasa aman di akhirat kelak. Perasaan ketakutan dan kesedihan sudah dihapuskan darinya, tertuang dalam ayat yang lain, \"maka barang siapa yang mengikuti petunjuk-Ku, niscaya tidak ada kekhawatiran atas mereka, dan tidak (pula) mereka bersedih hati\". (Al-Baqarah:38). Mengikuti hidayah adalah dengan cara membenarkan berita wahyu tanpa mengcounternya dengan syubhat-syubhat. Dan menaati perintah adalah mellalui sikap tidak melawannya dengan nafsu syahwat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 123: Allah Subhaanahu wa Ta'aala memerintahkan kepada Adam, Hawa’ dan Iblis untuk turun ke bumi, dan agar Adam dan keturunannya menjadikan setan sebagai musuhnya, selalu bersikap waspada terhadapnya, dan bahwa Dia akan menurunkan kepada mereka kitab-kitab-Nya, dan akan mengutus kepada mereka para rasul untuk menerangkan jalan yang lurus yang menghubungkan ke kampung halaman mereka yang sesungguhnya (surga) dan memperingatkan mereka terhadap musuh yang satu ini (Iblis dan keturunannya atau setan). Yakni Adam dan Hawa atau Adam dan Iblis. Seperti melakukan kezaliman antara yang satu dengan yang lain, atau maksudnya, bahwa Adam dan keturunannya menjadi musuh bagi Iblis dan keturunannya. Yaitu dengan melaksanakan yang diperintahkan dan menjauhi yang dilarang. Dalam meniti hidup di dunia. Di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 123",
    "description": "123. Allah berfirman, 'wahai adam dan hawa, turunlah kamu berdua dari surga bersama-sama. Ketahuilah, sebagian dari kamu akan menjadi musuh bagi sebagian yang lain. Maka, jika datang kepadamu petunjuk dari-ku untuk menjadi pedoman dalam kehidupanmu, lalu siapa saja yang mengikuti petunjuk-ku dan melaksanakan ajaran-ku, dia tidak akan sesat di dunia dan tidak akan pula celaka dalam kehidupan akhirat. '124. Pada ayat ini Allah memberi peringatan dan ancaman bagi mereka yang berpaling dari petunjuk-Nya. Dan barang siapa yang berpaling dari peringatan-ku dan enggan mengikuti petunjuk-ku, maka sungguh dia akan mendapat balasan dengan menjalani kehidupan yang sempit sehingga selalu merasa kurang meski sudah memperoleh banyak rezeki di dunia, dan kami akan mengumpulkannya kelak pada hari kiamat dalam keadaan buta sehingga tidak dapat meniti jalan ke surga."
  }
]