[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Namun, barangsiapa yang berpaling dari peringatanKu yang dengannya Aku memperingatkannya, maka sesungguhnya baginya di dunia ini kehidupan sempit lagi sengsara, (walaupun tampaknya dia termasuk orang bermartabat dan berkemudahan) dan Kami akan menghimpunnya pada Hari Kiamat dalam keadaan buta dari hujjah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Dan barangsiapa yang berpaling dari peringatan-Ku, tidak menerima, dan mewujudkannya, maka sungguh baginya kehidupan yang sengsara lagi sempit di dunia ini dan di alam kubur, dan Kami akan menggiringnya di padang Mahsyar hari Kiamat kelak dalam keadaan buta; tidak bisa melihat dan tidak memiliki hujah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124-125. Dan barangsiapa yang berpaling dari petunjuk Allah, maka di dunia dia akan mendapat kehidupan yang menderita dan penuh kesulitan meski secara zahir dia mendapat kenikmatan; dan pada hari kiamat dia akan dibangkitkan dalam keadaan buta, sehingga dia akan bertanya: “Ya Tuhanku, mengapa Engkau membangkitkan aku dalam keadaan buta, padahal ketika di dunia aku dapat melihat?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. وَمَنْ أَعْرَضَ عَن ذِكْرِى (Dan barangsiapa berpaling dari peringatan-Ku) Yakni dari agama-Ku serta membaca kitab-Ku dan beramal dengan isi kandungannya. فَإِنَّ لَهُۥ مَعِيشَةً ضَنكًا (maka sesungguhnya baginya penghidupan yang sempit) Yakni kehidupan yang sulit. وَنَحْشُرُهُۥ يَوْمَ الْقِيٰمَةِ أَعْمَىٰ (dan Kami akan menghimpunkannya pada hari kiamat dalam keadaan buta”) Yakni dengan penglihatan yang dicabut. Pendapat lain mengatakan yang dimaksud adalah mereka buta dari hujjah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Al-Qur'an merupakan sebab yang paling jelas untuk meraih kebahagiaan, sebaliknya meninggalkan al-Qur'an adalah sebab utama datangnya kecelakaan : { وَمَنْ أَعْرَضَ عَن ذِكْرِى فَإِنَّ لَهُۥ مَعِيشَةً ضَنكًا } \"Dan barangsiapa berpaling dari peringatan-Ku, maka sesungguhnya baginya penghidupan yang sempit\". 2 ). Banyak surat kabar yang memberitakan tentang kasus bunuh diri setiap 40 detik! namun orang-orang yang dekat dengan al-Qur'an tidak akan kebingungan dan terkejut dengan kabar ini, karena mereka yakin dengan firman Allah : { وَمَنْ أَعْرَضَ عَن ذِكْرِى فَإِنَّ لَهُۥ مَعِيشَةً ضَنكًا } \"Dan barangsiapa berpaling dari peringatan-Ku, maka sesungguhnya baginya penghidupan yang sempit\" juga dalam ayat lain dapat difahami bahwa semua urusan kebahagiaan berada di tangan-Nya, Allah berfirman : { وَمَن يُرِدْ أَن يُضِلَّهُۥ يَجْعَلْ صَدْرَهُۥ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِى ٱلسَّمَآءِ } \"Dan barangsiapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki langit\" [ Al-An'am : 125 ]. 3 ). Diantara manusia ada yang belajar al-Qur'an tapi lalai dalam membacanya, dan ini sama halnya ia menjauh dari al-Qur'an dan mengahalangi diri sendiri dari pahala yang besar, dan menyebabkan lupa kepadanya, perkara ini juga masuk dalam kandungan ayat : { وَمَنْ أَعْرَضَ عَن ذِكْرِى } \"Dan barangsiapa berpaling dari peringatan-Ku\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124. Dan barangsiapa menolak setiap apa yang diingatkan Allah melalui Al-Qur’an dan kitab lainnya, maka baginya di dunia itu kehidupan yang sulit dan sempit serta penuh kegelisahan. Adapun orang yang beriman, maka dia adalah orang yang dirinya nyaman. dan Kami jadikan orang yang menolak itu buta pada hari kiamat karena kebingungan dan tersesat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berpaling dari peringatanKu, maka sesungguhnya baginya kehidupan yang sempit} sangat sempit {Kami akan mengumpulkannya pada hari kiamat dalam keadaan buta”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. “Dan barangsiapa yang berpaling dari peringatanKU,” yaitu dari kitabKu yang menjadi sumber pengingat seluruh cita-cita yang tinggi, membiarkannya dengan cara berpaling darinya atau dengan sikap lebih parah dari itu, dengan cara mengingkari atau mengkufurinya, “maka sesungguhnya diia mendapatkan penghidupan yang sempit,” maksudnya sesungguhnya balasannya adalah kami menjadikan penghidupannya sempit lagi susah. Dan tidaklah hal itu melainkan suatu siksaan. Penghidupan yang sempit juga ditafsirkan dengan siksa kubur. Kuburnya akan dipersempit, terkepung di dalamnya, dan tersiksa sebagai balasan atas sikapnya berpaling dari peringatan Rabbnya. Ini salah satu dalil dari ayat yang menunjukkan keberadaan siksa kubur. Ayat kedua Firman Allah \"Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim (berada) dalam tekanan-tekanan sakratulmaut, sedang para malaikat memukul dengan tangannya, (sambil berkata): \"Keluarkanlah nyawamu\". Di hari ini kamu dibalas dengan siksaan yang sangat menghinakan, karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayat-Nya.\" (Al-An’Am:93), ayat ketiga, FirmanNya Dan sesungguhnya \"Kami merasakan kepada mereka sebahagian azab yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat); mudah-mudahan mereka kembali (ke jalan yang benar).\" (As-Sajdah:21) ayat keempat, FirmanNYa tentang kelompok Fir’aun, \"Kepada mereka dinampakkan neraka pada pagi dan petang, dan pada hari terjadinya Kiamat. (Dikatakan kepada malaikat): \"Masukkanlah Firaun dan kaumnya ke dalam azab yang sangat keras\". (Al-Mu’Min:46). Menurut ulama Salaf yang menafsirkannya dengan siksa kubur saja dan membatasinya pada point itu semata –wallhu a’lam- bagian yang menentukan adalah penghujung ayat ini, dan bahwa Allah menyebutkan siksa Hari Kiamat di akhir ayat. Sebagian ahli tafsir memandang bahwa penghidupan yang sempit itu bersifat umum di dunia ini saja, semisal kesedihan, kegetiran dan hal-hal yang menyakitkan yang menimpa orang yang berpaling dari peringatan Rabbnya, yang merupakan siksaan yang disegerakan (di dunia ini), di alam Barzakh, dan di akhirat, lantaran lafazhnya mutlak tanpa diikat (dengan sesuatu pun). “Dan Kami akan menghimpunkannya,” orang yang berpaling dari peringatan Rabbnya “pada Hari KIamat dalam keadaan buta,” maskudnya buta indera matanya menurut pendapat yang shahih. Seperti Firman Allah, \"Dan Kami akan mengumpulkan mereka pada hari kiamat (diseret) atas muka mereka dalam keadaan buta, bisu dan pekak.\" (Al-Isra:97)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 124: Tidak mau mengamalkannya atau lebih parah dari itu, yaitu tidak beriman dan mendustakannya. Yakni Al Qur’an. Yakni hidupnya di dunia sempit, tidak tenang dan tenteram, dadanya tidak lapang, bahkan terasa sempit dan sesak karena kesesatannya meskipun keadaan luarnya memperoleh kenikmatan, memakai pakaian mewah, memakan makanan yang enak dan tinggal di mana saja yang ia kehendaki, namun hatinya jika tidak di atas keyakinan yang benar dan petunjuk, maka tetap dalam kegelisahan, keraguan dan kebimbangan. Hal ini termasuk ke dalam kehidupan yang sempit. Ibnu Abbas berkata tentang kehidupan yang sempit, yaitu kesengsaraan. Menurut Abu Sa’id, kehidupan yang sempit adalah disempitkan kuburnya sehingga tulang rusuknya bertabrakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 124",
    "description": "124. Pada ayat ini Allah memberi peringatan dan ancaman bagi mereka yang berpaling dari petunjuk-Nya. Dan barang siapa yang berpaling dari peringatan-ku dan enggan mengikuti petunjuk-ku, maka sungguh dia akan mendapat balasan dengan menjalani kehidupan yang sempit sehingga selalu merasa kurang meski sudah memperoleh banyak rezeki di dunia, dan kami akan mengumpulkannya kelak pada hari kiamat dalam keadaan buta sehingga tidak dapat meniti jalan ke surga. 125. Ketika orang yang ingkar itu merasakan balasan Allah, dia berkata, 'ya tuhanku, mengapa engkau kumpulkan aku dalam keadaan buta sehingga tidak dapat melihat, padahal di dunia dahulu aku dapat melihat''."
  }
]