[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah ta’ala berfirman kepadanya, “Aku menghimpunmu dalam keadaan buta, karena dahulu sesungguhnya telah datang kepadamu ayat-ayatKu yang nyata, lalu kamu berpaling darinya dan kamu tidak mengimaninya. Maka sebagaimana kamu mengabaikannya di dunia, demikian pula kamu hari ini di biarkan berada di dalam neraka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Allah lalu berfirman membantahnya, \"Hal seperti inilah yang dahulu engkau lakukan di dunia. Ayat-ayat Kami telah datang kepadamu namun engkau berpaling darinya dan mengabaikannya, jadi begitu pula hari ini engkau akan diabaikan dengan diberikan azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126-127. Allah menjawabnya: “Demikianlah yang kamu lakukan ketika bukti-bukti yang jelas dan mukjizat-mukjizat disampaikan kepadamu kemudian kamu berpaling, kamu telah menjadikan dirimu buta mata dan hatimu, dan kamu mendustakan ayat-ayat Tuhanmu. Dan sungguh azab akhirat lebih keras dan lebih kekal lagi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. قَالَ كَذٰلِكَ (Allah berfirman: “Demikianlah) Yakni demikianlah yang telah kamu lakukan. أَتَتْكَ ءَايٰتُنَا فَنَسِيتَهَا ۖ (telah datang kepadamu ayat-ayat Kami, maka kamu melupakannya) Yakni kamu berpaling dan meninggalkannya tanpa memandangnya. وَكَذٰلِكَ الْيَوْمَ تُنسَىٰ (dan begitu (pula) pada hari ini kamupun dilupakan) Kamu dibiarkan dalam kesulitan dan azab di neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126. Allah berfirman: “Seperti itulah, Aku menjadikanmu, yaitu bahwa telah datang ayat-ayat kami kepadamu dengan jelas, lalu kamu menolaknya, meninggalkannya dan tidak mengimaninya, maka pada hari itu juga kalian ditinggalkan dalam azab”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfriman} Allah SWT berfirman kepadanya {“Demikianlah} Seperti itulah perbuatanmu {Telah datang kepadamu ayat-ayat Kami, lalu kamu mengabaikannya} lalu kamu mengabaikannya dan berpaling darinya {Begitu pula pada hari ini kamu diabaikan”} kamu diabaikan di neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. “Allah berfirman, ‘Demikianlah, telah datang kepadamu ayat-ayat Kami, maka kamu melupakannya’,” dengan berpaling darinya “dan begitu (pula) pada hari ini pun kamu dilupakan,” maksudnya dibiarkan dalam kubangan siksaan. (Permintaannya) dijawab dengan jawaban bahwa itu merupakan (balasan) amalanmu. Bentuk balasan itu disebabkan jenis perbuatan itu sendiri. Sebagaimana engkau buta terhadap peringatan Rabbmu, tidak mau memandang dengan jelas dan melupakannya, dan melupakan bagian kewajibanmu darinya, maka Allah membutakan pandanganmu di akhirat. Engkau digiring ke neraka dalam keadaan buta, tuli, dan bisu. Dia berpaling darimu dan melupakan keberadaanmu dalam siksaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 126: Meninggalkannya dan tidak beriman kepadanya. Dibiarkan dalam azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 126",
    "description": "126. Menjawab aduan itu Allah berfirman, 'demikianlah yang terjadi. Dahulu telah datang kepadamu ayat-ayat kami untuk mengajakmu mengikuti petunjuk kami, maka kamu melupakannya dan enggan menaati perintah kami, dan sebagai balasannya, begitu pula pada hari ini kamu pun dilupakan. '127. Dan demikianlah, sebagai hukuman atas keengganan itu, kami membalas orang yang melampaui batas dan tidak menghiraukan petunjuk yang datang kepadanya dan tidak pula mau percaya kepada ayat-ayat tuhannya. Dan ketahuilah, sesungguhnya azab di akhirat itu lebih berat daripada hukuman di dunia dan selain itu, azab di akhirat juga lebih kekal."
  }
]