[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan demikianlah Kami menghukum orang-orang yang bertindak melampaui batas terhadap dirinya, lalu dia mendurhakai Tuhannya dan tidak mengimani ayat-ayatNya, dengan hukuman-hukuman di dunia. Dan siksaan akhirat yang disiapkan bagi mereka itu benar-benar lebih pedih, lebih kekal dan lebih pasti, karena tidak pernah putus dan tidak akan berhenti."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Dan dengan balasan inilah Kami akan memberikan balasan kepada orang yang tenggelam dalam hawa nafsu yang diharamkan, dan enggan beriman terhadap bukti-bukti kebenaran yang jelas dari Tuhannya. Sungguh azab Allah di Akhirat kelak lebih dahsyat, lebih kuat, dan lebih kekal dibandingkan dengan kehidupan yang sengsara di dunia dan di alam kubur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. وَكَذٰلِكَ نَجْزِى مَنْ أَسْرَفَ (Dan demikianlah Kami membalas orang yang melampaui batas) Yakni tenggelam dalam hawa nafsu yang diharamkan. وَلَعَذَابُ الْاٰخِرَةِ أَشَدُّ (dan tidak percaya kepada ayat-ayat Tuhannya. Dan sesungguhnya azab di akhirat itu lebih berat) Yakni lebih berat dari kehidupan yang sempit dan sulit. وَأَبْقَى (dan lebih kekal) Karena azab tersebut tidak ada habisnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Janganlah sampai tertipu seorang pemuda yang membawa dirinya di atas kelezatan dunia yang sementara ini, dan jangan pula merasa sedih seorang pemuda bertaqwa yang terlewatkan oleh semua kelezatan ini, karena sesungguhnya tidak ada kebaikan pada kelezatan yang sementara ini namun dibaliknya adalah azab dunia dengan penyakit dan azab akhirat dengan neraka { وَلَعَذَابُ ٱلْءَاخِرَةِ أَشَدُّ وَأَبْقَىٰٓ } \"Dan sesungguhnya azab di akhirat itu lebih berat dan lebih kekal\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "127. Dan sebagaimana balasan Kami bagi orang yang menolak mengingat Al-Qur’an, Kami juga membalas dan menghukum setiap orang yang terlalu asyik mengikuti syahwat, melebihi batas kekufuran dan kemaksiatan, dan tidak mengimani ayat-ayat Tuhannya, bahkan mendustakannya, maka sungguh azab akhirat itu lebih kejam dan menyakitkan daripada azab dunia, serta lebih abadi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah} seperti itulah balasan {Kami membalas orang yang melampaui batas} melampaui batas dengan asyik dengan hawa nafsunya {dan tidak percaya pada ayat-ayat Tuhannya. Sungguh azab di akhirat itu lebih berat} lebih mengerikan {dan lebih kekal} lebih kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127.”Dan demikianlah,” dengan balasan ini Kami membalas “orang yang melampaui batas,” melewati batas-batas dan melakukan perbuatan-perbuatan haram serta melampaui wilayah yang diperbolehkan baginya “dan tidak percaya terhadap ayat-ayat Rabbnya,” yang menunjukkan kepada seluruh tuntutan keimanan, dengan sejelas-jelasnya lagi tegas. Allah tidaklah menganiayanya dan tidak menjatuhkan hukuman bukan pada tempatnya. Akan tetapi, penyebabnya adalah tindakannya melampaui batas dan tidak beriman. “Dan sesungguhnya azab di akhirat itu lebih berat,” daripada siksa dunia dengan berlipat ganda “dan lebih kekal,” karena tidak pernah berhenti. Berbeda dengan siksa dunia, akan berhenti. Maka kewajiban kita adalah takut dan berwaspada dari siksa akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 127: Yakni melewati batasan yang ditetapkan, mengerjakan perbuatan yang diharamkan, seperti halnya yang dilakukan orang-orang kafir dan musyrik. Oleh karena itu, Allah tidaklah berbuat zalim dan tidak mungkin meletakkan hukuman yang bukan pada tempatnya. Yang demikian adalah disebabkan sikapnya yang melampaui batas dan tidak beriman kepada petunjuk yang diturunkan-Nya untuk kebaikan dirinya. Dari azab di dunia dan dari azab kubur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 127",
    "description": "127. Dan demikianlah, sebagai hukuman atas keengganan itu, kami membalas orang yang melampaui batas dan tidak menghiraukan petunjuk yang datang kepadanya dan tidak pula mau percaya kepada ayat-ayat tuhannya. Dan ketahuilah, sesungguhnya azab di akhirat itu lebih berat daripada hukuman di dunia dan selain itu, azab di akhirat juga lebih kekal. 128. Pada ayat-ayat berikut Allah menerangkan peringatan-Nya kepada orang kafir dan enggan mengikuti petunjuk-Nya. Sungguh, semua ancaman itu pasti terjadi, maka tidakkah apa yang terjadi pada kaum kafir terdahulu menjadi petunjuk bagi mereka yang musyrik itu; berapa banyaknya kami membinasakan umat-umat sebelum mereka. Sungguh mengherankan bila mereka tidak mengambil pelajaran dari peristiwa itu, padahal mereka telah berjalan di lokasi tersebut dan melihat bekas-bekas tempat tinggal umat-umat yang dibinasakan itu'"
  }
]