[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai rosul) belum menunjuki kaummu kepada jalan petunjuk, betapa banyaknya umat-umat yang mendustakan sebelum mereka yang telah Kami binasakan, sedang mereka berjalan-jalan di (bekas) perkampungan-perkampungan umat-umat itu, dan dapat menyaksikan bekas-bekas kehancuran mereka? Sesungguhnya pada kejadian banyaknya umat-umat tersebut dan bekas-bekas siksaan mereka benar-benar terdapat berbagai pelajaran dan nasihat bagi orang-orang yang berakal yang sadar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Maka apakah tidak jelas juga bagi orang-orang musyrik itu tentang banyaknya umat yang Kami binasakan sebelum mereka, padahal mereka melewati bekas-bekas tempat tinggal umat-umat yang binasa tersebut, dan menyaksikan jejak-jejak azab yang menimpa mereka? Sesungguhnya pada kebinasaan yang menimpa umat-umat tersebut terdapat pelajaran dan ibrah bagi orang-orang yang berakal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128-129. Allah mengingkari dan menegur orang-orang kafir: “Tidakkah jelas bagi orang-orang kafir Makkah dan orang-orang semisal mereka, betapa banyak umat-umat terdahulu yang mendustakan para rasul telah Kami binasakan, mereka berjalan di negeri mereka dan melihat kebinasaan mereka? Sungguh pada kebinasaan yang besar itu terdapat ibrah dan pelajaran bagi orang-orang yang berakal sehat. Kalaulah bukan karena ketetapan Allah yang mengakhirkan azab mereka hingga waktu tertentu yang Dia ketahui, niscaya mereka akan segera dibinasakan karena mereka berhak mendapatkan itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. أَفَلَمْ يَهْدِ لَهُمْ كَمْ أَهْلَكْنَا (Maka tidakkah menjadi petunjuk bagi mereka (kaum musyrikin) berapa banyaknya Kami membinasakan) Apakah belum jelas bagi penduduk Makkah kisah-kisah dari umat-umat sebelum mereka yang telah Kami binasakan. يَمْشُونَ فِى مَسٰكِنِهِمْ (padahal mereka berjalan (di bekas-bekas) tempat tinggal mereka) Yakni mereka hanya berjalan di rumah mereka sendiri. Atau mereka melalui tempat tinggal umat-umat terdahulu yang telah Kami binasakan itu; yaitu ketika mereka pergi untuk berdagang dan mencari penghidupan kemudian mereka melihat negeri umat-umat terdahulu yang telah hancur dan runtuh, seperti negeri Hijr, kaum Tsamud, negeri kaum Luth, dan lainnya. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ لِّأُو۟لِى النُّهَىٰ (Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi orang yang berakal) Yakni bagi pemilik akal yang melarangnya melakukan keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128. Apakah belum dijelaskan dalam Al-Qur’an kepada orang-orang kafir Mekah dan yang lainnya, berapa banyak umat-umat terdahulu yang telah Kami hancurkan karena telah mendustakan para rasul, sedangkan mereka (orang kafir Mekah) itu berjalan melewati reruntuhan rumah-rumah mereka (umat terdahulu). Sesungguhnya dalam hal itu ada pelajaran bagi orang-orang yang berakal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidakkah menjadi petunjuk} tidakkah jelas {bagi mereka tentang berapa banyak generasi sebelum mereka} umat-umat yang berdusta {yang telah Kami binasakan, padahal mereka melewati tempat tinggal mereka. Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi orang-orang yang berakal} orang-orang yang berakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128. Maksudnya, “Maka tidakkah menjadi petunjuk bagi mereka,” yaitu orang-orang yang mendustakan lagi berpaling, lalu mengarahkan mereka untuk melintasi jalan petunjuk dan menjauhi jalan kesesatan dan kerusakan, yaitu azab yang telah Allah timpakan kepada orang-orang yang mendustakan sebelum mereka dari generasi-generasi terdahulu dan bangsa-bangsa yang silih berganti yang mereka itu mengetahui sejarah-sejarah mereka dan menjadikannya bahan perbincangan mereka di malam hari, serta dapat menyaksikan (dengan mata kepala mereka) bekas-bekas tempat tinggal kaum yang mendustakan itu, semisal kaum Nabi HUd, Shalih, Luth, dan lain-lain. Mereka itu ketika mendustakan para rasul kami dan berbelok dari kitab-kitab Kami, niscaya Kami menjatuhkan siksa yang pedih pada mereka. Apakah yang membuat orang-orang itu merasa aman dari turunnya siksa yang mengenain kaum-kaum itu? \"Apakah orang-orang kafirmu (hai kaum musyrikin) lebih baik dari mereka itu, atau apakah kamu telah mempunyai jaminan kebebasan (dari azab) dalam Kitab-kitab yang dahulu?. Atau apakah mereka mengatakan: \"Kami adalah satu golongan yang bersatu yang pasti menang\". (Al-Qamar:43-44). Fakta ini sama sekali tidak ada pada mereka. Orang-orang kafir itu lebih baik daripada mereka (yang sudah dibinasakan) hingga siksaan (bisa) disingkirkan dari mereka dengan sebab kebaiikan yang mereka punya. Bahkan mereka itu lebih buruk dari kaum-kaum itu. Karena mereka mengingkari utusan Allah yang termulia dan kitab yang terbaik. Mereka pun tidak mempunyai (surat) bebas yang tertulis dan janji (selamat) dari Allah. Dan mereka bukanlah sebagaimana yang mereka ungkapkan, bahwa kesatuan mereka berguna bagi mereka dan sanggup menolak azab dari mereka. Bahkan mereka itu lebih hina dan nista dari itu. Permusuhan generasi-generasi manusia tempo dulu disesbabkan dosa-dosa mereka adalah termasuk salah satu penyebab datangnya hidayah, lantaran ia termasuk tanda-tanda kebesaran Allah yang menandakan kebenaran risalah para rasul yang membawanya kepada mereka dan kebatilan ajaran yang ada pada kaum kuffar. Akan tetapi, tidak setiap orang dapat meraih manfaat dengan tanda-tanda kebesaran Allah itu. Orang yang berhasil merengkuh manfaat dengannya, hanyalah orang-orang berakal, yaitu orang-orang yang mempunyai akal-akal sehat lagi fitrah-fitrah yang masih lurus. Sementara al-Albab adalah akal-akal yang mengekang pemiliknya dari hal-hal yang tidak sepantasnya diperbuat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 128: Yakni yang membuat mereka menempuh jalan yang lurus dan menjauhi kesesatan. Karena mendustakan rasul. Yakni ketika mereka bepergian ke Syam dan lainnya yang seharusnya mereka ambil pelajaran darinya. Ada pula yang menafsirkan, “Terdapat pelajaran-pelajaran” atau “Terdapat tanda-tanda yang menunjukkan kebenaran risalah para rasul dan batilnya sikap mereka selama ini, yaitu menolak seruan para rasul.” Karena hanya merekalah yang dapat mengambil manfaat dari peristiwa-peristiwa yang menimpa orang-orang terdahulu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 128",
    "description": "128. Pada ayat-ayat berikut Allah menerangkan peringatan-Nya kepada orang kafir dan enggan mengikuti petunjuk-Nya. Sungguh, semua ancaman itu pasti terjadi, maka tidakkah apa yang terjadi pada kaum kafir terdahulu menjadi petunjuk bagi mereka yang musyrik itu; berapa banyaknya kami membinasakan umat-umat sebelum mereka. Sungguh mengherankan bila mereka tidak mengambil pelajaran dari peristiwa itu, padahal mereka telah berjalan di lokasi tersebut dan melihat bekas-bekas tempat tinggal umat-umat yang dibinasakan itu' 129. Apa yang terjadi pada manusia merupakan akibat perbuatan mereka. Dan sekiranya tidak ada suatu ketetapan dari Allah yang telah diputuskan pada masa terdahulu, yaitu sebelum zaman rasulullah, atau tidak ada ajal dan batas akhir yang telah ditentukan oleh Allah, pasti azab yang serupa juga menimpa mereka yang kafir itu."
  }
]