[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya bukan karena telah ada ketetapan dari Tuhanmu dahulu dan ajal yang ditentukan dariNya, pastilah kebinasaan menimpa mereka dengan segera, karena mereka itu pantas mendapatkannya disebabkan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Dan seandainya tidak ada suatu ketetapan terdahulu dari Tuhanmu -wahai Rasul-, bahwa Dia tidak memberikan azab kepada seorang pun sebelum ditegakkannya hujah atasnya, serta seandainya tidak adanya batasan waktu yang telah ditakdirkan bagi mereka, niscaya Dia pasti menyegerakan azab itu bagi mereka karena mereka memang pantas untuk mendapatkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ (Dan sekiranya tidak ada suatu ketetapan dari Allah yang telah terdahulu) Yaitu janji Allah mengakhirkan azab umat ini sampai di kehidupan akhirat. لَكَانَ (niscaya) Azab dosa-dosa mereka. لِزَامًا(pasti (azab itu) menimpa mereka) Azab itu tidak terpisah dari mereka dalam keadaan apapun dan tidak akan diakhirkan. وَأَجَلٌ مُّسَمًّى(atau (juga) tidak ada ajal yang telah ditentukan) Yakni kalaulah bukan waktu yang telah Kami tentukan niscaya mereka akan segera di siksa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "129. Kalaulah tidak ada janji sebelumnya dari Allah untuk menangguhkan azab pembinasaan umat ini dan menangguhkan azab itu sampai akhirat, maka sungguh pembinasaan dan hukuman mereka itu pasti menimpa mereka di dunia dan tidak ditunda. Dan kalaupun tidak ada waktu yang ditentukan atau dikira-kirakan bagi umur mereka atau untuk mengazab mereka, maka sungguh hukuman itu pasti sudah dipercepat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya tidak ada suatu ketetapan yang terdahulu dari Tuhanmu serta tidak ada ajal yang telah ditentukan maka sungguh (azab) itu pasti menimpa mereka} jika tidak ada ketetapan sebelumnya dari Allah untuk tidak mengazab seseorang kecuali setelah datang dalil kepadanya, dan ajal tertentu yang diputuskan Allah sampai waktu tertentu, maka sungguh azab itu pasti menimpa mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129. Ini adalah hiburan hati bagi Rasulullah dan penahan diri bagi beliau untuk menyegerakan pemusnahan kaum yang mendustakan lagi berpaling, dan bahwa kekufuuran serta pendustaan yang mereka lakukan merupakan penyebab yang pantas mendatangkan siksaan dan kontinuitasnya pada mereka. Sebab, Allah menciptakan hukuman-hukuman itu memiliki pemicu dan timbul dari dosa-dosa serta melekat dengannya. Mereka itu sudah melakukan ulah yang menjadi penyebab turunnya siksa. Namun, faktor yang menunda azab dari mereka ialah ketetapan Rabbmu, itulah yang mengundurkan tibanya siksaan pada mereka sampai datanglah waktunya. Boleh jadi mereka kembali memikirkan perintah Allah, hingga Allah menerima taubat mereka dan menghilangkan hukuman dari mereka, jika ketetapan Allah tidak jadi mengenai mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 129: Ayat ini dan setelahnya merupakan hiburan bagi Nabi shallallahu 'alaihi wa sallam dan agar Beliau bersabar dari meminta disegerakan azab untuk orang-orang yang mendustakan, dan bahwa kekafiran serta pendustaan mereka merupakan sebab turunnya azab kepada mereka. Ditahannya azab adalah karena ketetapan Allah sampai tiba waktunya, dan agar mereka kembali dan bertobat sehingga azab itu diangkat dari mereka. Oleh karena itulah, Allah memerintahkan Rasul-Nya untuk bersabar terhadap ucapan mereka dan memerintahkan mengambil gantinya dan menjadikan sebagai pembantunya, yaitu bertasbih dengan memuji Tuhannya di waktu-waktu yang utama, yaitu sebelum matahari terbit dan sebelum terbenam, di penghujung siang, di waktu-waktu malam, agar dengan begitu Beliau menjadi ridha dengan pemberian Allah berupa pahala di dunia dan di akhirat, hati Beliau tenteram dan puas dengan beribadah kepada Allah serta merasa terhibur dari gangguan mereka sehingga bersabar terasa ringan bagi Beliau. Dengan ditundanya azab sampai tiba hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 129",
    "description": "129. Apa yang terjadi pada manusia merupakan akibat perbuatan mereka. Dan sekiranya tidak ada suatu ketetapan dari Allah yang telah diputuskan pada masa terdahulu, yaitu sebelum zaman rasulullah, atau tidak ada ajal dan batas akhir yang telah ditentukan oleh Allah, pasti azab yang serupa juga menimpa mereka yang kafir itu. 130. Wahai nabi Muhammad, bila orang kafir terus menentang dakwahmu maka sabarlah kamu atas apa yang mereka katakan. Untuk meneguhkan pendirianmu, berdoalah kepada Allah dan bertasbihlah dengan memuji tuhanmu. Lakukan itu sebelum terbit matahari dan sebelum terbenamnya, dan bertasbih pulalah pada waktu-waktu di malam hari dengan salat lail, dan pada waktu-waktu di siang hari. Yang demikian itu supaya kamu merasa senang dan hatimu tenteram."
  }
]