[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "“Dan sesungguhnya Aku telah memilihmu, wahai Musa, untuk mengemban risalahKU, maka dengarkanlah dengan baik apa yang akan diwahyukan kepadamu dariKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan Aku telah memilih engkau -wahai Musa- untuk menyampaikan risalah-Ku kepada manusia, maka dengarkanlah apa yang akan diwahyukan kepada-Mu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. “Hai Musa, Aku telah memilihmu sebagai rasul bagi kaummu, maka dengarkanlah apa yang akan Aku wahyukan kepadamu agar kamu dapat menyampaikannya kepada kaummu: Aku adalah Allah, Tidak ada Tuhan yang berhak disembah selain Aku, maka sembahlah Aku Semata dan senantiasa dirikanlah shalat agar kamu selalu mengingat-Ku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَأَنَا اخْتَرْتُكَ (Dan Aku telah memilih kamu) Untuk menjadi seorang rasul. فَاسْتَمِعْ لِمَا يُوحَىٰٓ (maka dengarkanlah apa yang akan diwahyukan (kepadamu)) Dengarkan dengan punuh persiapan dan pemahaman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu kebanggaan bagimu jika saja kamu menyadarinya! Dia tuhanmu yang maha Agung, dengan rahmat dan kasih sayang-Nya Ia berbicara kepadamu wahai manusia, Ia berbicara kepadamu melalui al-Qur'an, tidakkah kamu mengetahui apa yang kamu dengarkan? tuhan semesta alam berbica kepadamu : { فَٱسْتَمِعْ لِمَا يُوحَىٰٓ } \"maka dengarkanlah apa yang akan diwahyukan (kepadamu)!\" Adakah hati yang mentadabburi hakikat yang luar biasa ini, sehingga ia tidak sujud kepada penciptanya? tahukan dia bahwa bebatuan dan kerikil ini adalah makhluk yang paling takut kepada Allah? { لَوْ أَنزَلْنَا هَٰذَا ٱلْقُرْءَانَ عَلَىٰ جَبَلٍ لَّرَأَيْتَهُۥ خَٰشِعًا مُّتَصَدِّعًا مِّنْ خَشْيَةِ ٱللَّهِ ۚ } \"Kalau sekiranya Kami turunkan Al-Quran ini kepada sebuah gunung, pasti kamu akan melihatnya tunduk terpecah belah disebabkan ketakutannya kepada Allah\" [Al-Hasyr : 21]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Dan Aku memilihmu untuk menerima nubuwwah dan risalah, maka dengarkan dan terimalah wahyu itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku telah memilihmu} memilihmu dengan risalahKu {maka dengarkanlah apa yang akan diwahyukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “Dan Aku telah memilihmu,” ,maksudnya Aku telah memilih menyeleksimu dari orang-orang. Ini merupakan kenikmatan dan karunia paling besar yang Allah curahkan kepadanya, yang menuntut untuk disyukuri dengan semestinya. Oleh Karena itu, Allah berfirman, “Maka dengarkanlah apa yang akan diwahyukan (kepadamu),” maksudnya, arahkan pendengaranmu kepada wahyu yang disampaikan kepadamu. Sesungguhnya sikap itu sudah sepantasnya. Sebab, ia merupakan prinsip agama dan landasannnya, serta tiang dakwah Islamiyah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 13: Di antara kaummu. Hal ini merupakan nikmat besar yang diberikan Allah kepadanya yang menghendaki untuk disyukuri. Karena ia merupakan dasar agama dan penopang dakwah Islamiyyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 13",
    "description": "Begitu musa melepas terompahnya, Allah berfirman, 'dan ketahuilah, wahai musa, sesungguhnya aku telah memilih engkau sebagai nabi dan rasul untuk memberi peringatan kepada mereka yang ingkar. Maka, dengarkanlah apa yang akan diwahyukan kepadamu, lalu laksanakanlah untuk memberi pengajaran kepada kaummu. 14. Wahai musa, ketahuilah sesungguhnya aku ini adalah Allah, tuhanmu, dan sungguh tidak ada tuhan pencipta alam raya yang layak disembah selain aku, maka berimanlah kepada-ku, sembahlah aku, dan laksanakanlah salat untuk mengingat-ku dan bersyukur kepada-ku. ' inilah prinsip pertama akidah, yaitu keesaan tuhan."
  }
]