[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bersabarlah kamu (wahai Rasul) terhadap apa yang diucapkan oleh orang-orang yang mendustakanmu, berupa predikat-predikat (buruk) dan kebatilan-kebatilan, dan bertasbihlah dengan memuji Tuhanmu di dalam Shalat Shubuh sebelum terbitnya matahari, dan di Shalat Ashar sebelum matahari terbenam, serta di Shalat Isya di waktu-waktu malam, dan bertasbihlah dengan memuji Tuhanmu di ujung siang pada Shalat Dzuhur (karena waktunya diujung setengah pertama siang dan setengah kedua) dan Magrib pada waktu-waktu siang hari, supaya kamu memperoleh balasan kebajikan atas amalan-amalan tersebut yang menyebabkanmu puas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "130. Maka bersabarlah -wahai Rasul- atas perkataan orang-orang yang mendustakanmu berupa kata-kata yang batil, dan bertasbihlah dengan memuji Tuhanmu dalam salat fajar sebelum terbitnya matahari, dalam salat ashar sebelum terbenamnya matahari, juga dalam salat magrib dan isya di waktu malam, dalam salat zuhur di waktu condongnya matahari ke arah barat setelah berlalunya setengah hari, dan dalam salat magrib setelah berlalunya seluruh hari, dengan harapan agar engkau mendapatkan pahala yang memuaskanmu di sisi Tuhanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "130-131. Allah menyampaikan kepada Nabi Muhammad dan umatnya perintah-perintah dan kabar-kabar gembira pada tiga ayat yang akan disebutkan ini: Bersabarlah dalam menghadapi berbagai kedustaan yang dibuat orang-orang musyrik. Dan senantiasalah bertasbih dan bertahmid dalam shalat Subuh, Ashar, Isya’, Dhuhur, dan Maghrib, agar kamu mendapat keridhaan Allah. Janganlah kamu terus melihat dengan takjub perhiasan dunia dan harta yang ada di genggaman manusia, sebab pemberian ini merupakan ujian. Dan rezeki Tuhanmu di akhirat lebih baik dan lebih kekal dari itu semua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "130. فَاصْبِرْ عَلَىٰ مَا يَقُولُونَ (Maka sabarlah kamu atas apa yang mereka katakan) Seperti mengatakan kamu adalah tukang sihir dan pendusta serta tuduhan-tuduhan lainnya. Janganlah kamu pedulikan mereka karena azab mereka telah ditentukan waktunya, dan tidak akan disegerakan dari ketentuan itu. وَسَبِّحْ بِحَمْدِ رَبِّكَ (dan bertasbihlah dengan memuji Tuhanmu) Yang dimaksud adalah shalat lima waktu. قَبْلَ طُلُوعِ الشَّمْسِ(sebelum terbit matahari) Yakni shalat subuh. وَقَبْلَ غُرُوبِهَا ۖ( dan sebelum terbenamnya) Yakni shalat ashar. وَمِنْ ءَانَآئِ الَّيْلِ(dan pada waktu-waktu di malam hari) Yakni shalat isya. فَسَبِّحْ (bertasbih pulalah) Yakni maka dirikanlah shalat. وَأَطْرَافَ النَّهَارِ (begitu pula pada ujung-ujung siang hari) Yakni shalat maghrib dan dhuhur. Pendapat lain mengatakan yang menunjukkan shalat dhuhur adalah firman-Nya (وقبل غروبها) sebab shalat dhuhur dan shalat ashar dikerjakan sebelum terbenamnya matahari. Pendapat lain mengatakan yang dimaksud dalam ayat ini adalah shalat sunnah. Dan pendapat lain mengatakan yang dimaksud adalah perintah bertasbih pada waktu-waktu tersebut dengan mengatakan ‘subhanallah’. لَعَلَّكَ تَرْضَىٰ( supaya kamu merasa senang) Dengan harapan kamu akan mendapat di sisi Allah apa yang dapat dirimu ridhai."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kedudukan tertinggi orang-orang yang dekat dengan tuhannya adalah : keridhoan! dan jalan yang ditempuh mencapai kedudukan itu dengan dua hal : kesabara yang indah, dan dzikir yang banyak dn panjang : { فَٱصْبِرْ عَلَىٰ مَا يَقُولُونَ وَسَبِّحْ بِحَمْدِ رَبِّكَ قَبْلَ طُلُوعِ ٱلشَّمْسِ وَقَبْلَ غُرُوبِهَا ۖ وَمِنْ ءَانَآئِ ٱلَّيْلِ فَسَبِّحْ وَأَطْرَافَ ٱلنَّهَارِ لَعَلَّكَ تَرْضَىٰ } \"Maka sabarlah kamu atas apa yang mereka katakan, dan bertasbihlah dengan memuji Tuhanmu, sebelum terbit matahari dan sebelum terbenamnya dan bertasbih pulalah pada waktu-waktu di malam hari dan pada waktu-waktu di siang hari, supaya kamu merasa senang\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "130. Maka bersabarlah Wahai Nabi, atas apa yang dikatakan orang-orang Musyrik bahwa kamu adalah penyihir yang pendusta dan semacamnya. Tetaplah bertasbih, bertahmid dan melaksanakan shalat (shubuh) di setiap waktunya sebelum terbitnya matahari, yaitu shalat fajar, shalat sebelum tenggelamnya matahari, yaitu shalat ashar, shalat dari sebagian malam, yaitu shalat maghrib dan ‘isya’, dan shalat di pertengahan siang (antara dua sisi atau di pertengahan siang hari) ketika matahari cenderung kearah barat, yaitu shalat zhuhur, niscaya kamu akan mendapatkan apa yang ada di sisi Allah, yaitu sesuatu yang bisa menyenangkan dirimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka bersabarlah atas apa yang mereka katakan dan bertasbihlah dengan memuji Tuhanmu sebelum matahari terbit dan sebelum terbenam. Bertasbihlah pada waktu tengah} pada waktu-waktu {malam dan di ujung} dan di sebagian {siang agar kamu ridha} kamu menerima pahala dari sisi Allah yang kamu ridhai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "130. UNtuk itu, Allah memerintahkan RasulNya untuk bersabar menghadapi gangguan mereka yang berbentuk ucapan, dan memerintahkan beliau untuk menahan diri dari itu serta menolong diri dengan bertasbih “dengan memuji” Rabbnya di waktu-waktu yang utama ini “sebelum terbit matahari dan terbenamnya,” dan di ujung-ujung siang hari, yaitu pada permulaan dan akhir hari. Ini merupakan penyebutan keterangan yang umum setelah ungkapan khusus, dan waktu-waktu “di malam hari,” dan jam-jamnya. Jika engkau mengerjakannya, pasti engkau akan ridha dengan apa yang Allah berikan kepadamu berupa pahala yang segera dan yang diakhirkan. Hendaklah hatimu tentram, pandanganmu sejuk dengan beribadah kepada Rabbmu serta mencari hiburan hati dengannya dari gangguan-gangguan mereka. Ketika itulah, sikap sabar terasa ringan bagimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 130: Ada yang menafsirkan dengan shalat. Yaitu shalat Subuh. Yaitu shalat ‘Ashar. Yaitu dengan melakukan shalat Maghrib dan Isya. Yaitu shalat Zhuhur, karena ketika itu matahari sudah condong ke barat. Dengan pemberian Tuhanmu berupa pahala yang akan diberikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 130",
    "description": "130. Wahai nabi Muhammad, bila orang kafir terus menentang dakwahmu maka sabarlah kamu atas apa yang mereka katakan. Untuk meneguhkan pendirianmu, berdoalah kepada Allah dan bertasbihlah dengan memuji tuhanmu. Lakukan itu sebelum terbit matahari dan sebelum terbenamnya, dan bertasbih pulalah pada waktu-waktu di malam hari dengan salat lail, dan pada waktu-waktu di siang hari. Yang demikian itu supaya kamu merasa senang dan hatimu tenteram. 131. Banyak orang kafir yang mendapat rezeki dan kenikmatan duniawi berlimpah. Allah mengingatkan kaum mukmin untuk tergiur dengan hal tersebut. Wahai orang beriman, janganlah kamu terpesona oleh apa yang orang kafir itu peroleh dan janganlah pula kamu tujukan kedua matamu dengan antusias dan penuh harap kepada apa yang telah kami berikan, berupa kenikmatan duniawi, kepada golongan-golongan dari mereka. Sungguh, semua itu tidak lain sebagai bunga kehidupan dunia untuk kami uji mereka dengannya, dan ketahuilan bahwa karunia tuhan kamu adalah lebih baik dan lebih kekal dari segala sisinya."
  }
]