[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu memandang berbagai macam kesenangan yang telah Kami berikan kepada kaum Musyrikin dan orang-orang yang serupa dengan mereka, karena sesungguhnya itu hanya sekedar hiasan belaka yang akan sirna di kehidupan dunia ini. Kami memberikan kesenangan itu kepada mereka untuk menguji mereka dengannya. Dan rizki Tuhanmu dan pahalaNya lebih baik bagimu dari kesenangan yang Kami berikan kepada mereka dan lebih abadi, lantaran tidak ada waktu putus dan habisnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Dan janganlah engkau tujukan pandangan matamu kepada ragam kenikmatan yang telah Kami berikan kepada beberapa golongan orang-orang yang mendustakanmu itu sebagai bunga kehidupan dunia semata agar Kami menguji mereka dengan kenikmatan itu, karena sesungguhnya kenikmatan yang Kami berikan itu akan punah, sehingga pahala Tuhanmu yang dijanjikan padamu agar engkau merasa rida dengannya lebih baik dan lebih kekal dari segala kenikmatan fana yang mereka rasakan di dunia, sebab pahala Tuhanmu tidak akan pernah terputus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "131. وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوٰجًا مِّنْهُمْ (Dan janganlah kamu tujukan kedua matamu kepada apa yang telah Kami berikan kepada golongan-golongan dari mereka) Tafsir ayat ini telah disebutkan pada surat al-Hijr: 88. زَهْرَةَ الْحَيَوٰةِ الدُّنْيَا(sebagai bunga kehidupan dunia) Yakni perhiasan dan keindahan dunia seperti harta, bangunan, perabot, kendaraan, dan lain sebagainya. لِنَفْتِنَهُمْ فِيهِ ۚ( untuk Kami uji mereka dengannya) Yakni untuk Kami jadikan hal itu cobaan bagi mereka. وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ (Dan karunia Tuhan kamu adalah lebih baik dan lebih kekal) Yakni apa yang Allah mudahkan bagi kamu, berupa rezeki di dunia serta pahala Allah dan apa yang Allah simpan di akhirat yang lebih baik dari apa yang Allah rezekikan kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Umar bin al-Khattab kerab membangunkan penghuni rumahnya pada malam hari untuk mendirikan shalat sebagai bentuk ketaatan kepada ayat ini. 2 ). Ibnu Taimiyah mengatakan : barangsiapa yang melihat kepada seekor kuda dan kepada binatang-binatang ternak dengan pandangan baik terhadap dunia, kekuasaan dan kekayaan, maka sesungguhnya sikapnya itu tercela sebagaimana firman Allah : { وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ زَهْرَةَ ٱلْحَيَوٰةِ ٱلدُّنْيَا لِنَفْتِنَهُمْ فِيهِ } \"Dan janganlah kamu tujukan kedua matamu kepada apa yang telah Kami berikan kepada golongan-golongan dari mereka, sebagai bunga kehidupan dunia untuk Kami cobai mereka dengannya\", sedangkan jika melihat dengan wajah yang tidak mengurangi hak-hak agama, maka pandagangannya itu tidak lain hanya sebagai hiburan bagi dirinya saja, sebagaimana halnya ketika ia melihat kepada bunga-bunga, karena sesungguhnya perkara bathil ini kerap digunakan untuk meraih sesuatu yang haq. 3 ). Ibnu Rajab mengatakan : duduk bersama orang-orang miskin akan menghadirkan keridhoan bagi siapa yang duduk bersama mereka dengan segenap rezki yang Allah karuniakan kepadanya, dan berapapun nikmat Allah yang ada pada dirinya akan terlihat besar dibandingkan dunia ini, sebaliknya duduk bersama orang-orang kaya akan menyebabkan ketidak puasa terhadap nikmat Allah, dan menjadikan mata terus tertuju kepada kekayaan mereka, pada Allah dan rasul-Nya telah melarang, Allah berfirman : { وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوَٰجًا مِّنْهُمْ زَهْرَةَ ٱلْحَيَوٰةِ ٱلدُّنْيَا لِنَفْتِنَهُمْ فِيهِ }. 4 ). Ayat ini menjadi dalil bahwa semestinya ba siapa yang dikaruniai oleh Allah ketetapan dalam penghambaan untuk tidak melihat kepada perhiasan dunia ini dengan pandangan takjub, dan agar ia selalu merasa berkecukupan dengan rezeki yang Allah karuniakan kepadanya, dan agar ia mengganti hal-hal yang dilarang dengan memperbanyak bekal ketaatan dan ibadah kepada-Nya. 5 ). Diantara paling besar yang menumbuhkan sifat hasad pada diri seseorang adalah : kerapnya mata tertuju kepada apa yang Allah beri kenikmatan kepada hamba-hamba Nya dari kekayaan, anak-anak dan sebagainya, padahal perkara ini telah dilarang oleh Nabi -صلى الله عليه وسلم-, oleh karena itu ayat ini dapat menjadi obat dari penyakit hasad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "131. Dan jangan terlalu larut melihat dengan penuh angan dan harapan terhadap sesuatu yang dimiliki orang lain berupa kenikmatan kehidupan dunia, yaitu hiasan-hiasan dan kesenangannya seperti harta benda, bangunan, perkakas, dan kendaraan. Sungguh Kami menguji mereka dalam hal itu. Dan jadikanlah hasratmu itu hanya untuk sesuatu yang ada di sisi Allah. Dan apa yang dijaga oleh Allah dan dijanjikan Allah untukmu di akhirat itu lebih baik daripada apa yang Dia berikan kepada mereka di dunia serta lebih abadi dan tidak terputus-putus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah sekali-kali merngarahkan pandangan matamu} janganlah kamu memperpanjang pandangan matamu dengan pandangan berhasrat dan berminat {pada kenikmatan yang telah Kami anugerahkan kepada beberapa golongan dari mereka} beberapa golongan dari orang-orang musyrik {bunga} perhiasan {kehidupan dunia agar Kami menguji mereka} agar Kami menguji mereka {dengan itu. Karunia Tuhanmu lebih baik dan lebih kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "131.Maka janganlah engkau membelalakkan “kedua matamu,” dengan penuh keheranan dan janganlah engkau berulang-ulang memandang dengan simpatik ke pernak-pernik dunia dan orang-orang yang larut dalam kemewahan padanya, dalam makanan, minuman yang lezat, palaian yang mewah, hunian-hunian yang sarat dengan keindahan, dan wanita-wanita yang cantik-cantik. Semua itu merupakan kembang “kehidupan dunia,” makasudnya jiwa orang-orang yang terpedaya begitu riang dengannya, dan (kehidupan dunia) itu menarik kekaguman orang-orang yang berpaling (dari peringatan). Orang-orang zhalim menikmatinya tanpa menengok kondisi alam akhirat. Kemudian, kembang dunia itu pun hilang dengan begitu cepat dan berlalu semua, membunuhi para pecintanya dan perundungnya. Mereka akan menyesal di saat sesal tidak berguna lagi. Mereka mengetahui tindak tanduk mereka ketika memasuki Hari Kiamat. Allah hanyalah menjadikannya sebagai sumber fitnah dan ujian, supaya dapat dideteksi orang-orang yang diam dan terpukau dengannya dan orang-orang yang lebih baik amalannya. Sebagaimana Allah berfirman, \"Sesungguhnya Kami telah menjadikan apa yang ada di bumi sebagai perhiasan baginya, agar Kami menguji mereka siapakah di antara mereka yang terbaik perbuatannya. Dan sesungguhnya Kami benar-benar akan menjadikan (pula) apa yang di atasnya menjadi tanah rata lagi tandus.\" (Al-Kahfi:7-8). “Dan karunia Rabbmu,” yang segera (dapat diraih), berupa ilmu, iman, dan hakikat-hakikat amalan yang shalih. Dan karunia yang ditunda (di akhirat) berupa kenikmatan yang lestari dan kehidupan yang nyaman di sisi Rabb Yang Maha Penyayang “adalah lebih baik,” daripada sesuatu yang Kami limpahkan kepada kelompok-kelompok itu pada dzat dan sifat-sifatnya. “dan lebih kekal,” lantaran tidak pernah terputus. Buah-buahnya dan kesejukannya langgeng. Seperti Firman Allah, \"Tetapi kamu (orang-orang kafir) memilih kehidupan duniawi. Sedang kehidupan akhirat adalah lebih baik dan lebih kekal.\" (Al-A’la:16-17). Dalam ayat ini terselip sebuah isyarat bahwa seorang hamba jika menyaksikan pada dirinya terdapat kerakusan terhadap pesona dunia dan sorotan kepadanya, maka dia wajib mengingatkan dirinya dengan kenikmatan-kenikmatan yang ada di depannya (di akhirat) dari karunia Rabbnya, dan dia harus membandingkan antara ini dan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 131: Yakni merasa kagum. Seperti makanan dan minuman yang enak, pakaian yang indah, harta yang banyak, rumah yang besar, wanita yang cantik, dsb. Sesungguhnya semua itu bunga kehidupan dunia, di mana orang-orang yang tertipu bersenang-senang dengannya, demikian pula orang-orang zalim. Perhiasan itu akan hilang dan ditinggalkan, menyakitkan hati pencintanya dan mereka akan menyesal pada hari kiamat serta akan mereka ketahui bahwa Allah menjadikannya sebagai ujian dan cobaan agar Dia mengetahui siapa yang tergoda dan siapa yang tidak tergoda, yakni tetap baik perbuatannya. Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya Kami telah menjadikan apa yang di bumi sebagai perhiasan baginya, agar Kami menguji mereka siapakah di antara mereka yang terbaik perbuatannya.--Dan sesungguhnya Kami benar-benar akan menjadikan (pula) apa yang di atasnya menjadi tanah rata lagi tandus.” (Terj. Al Kahfi: 7-8) Sehingga mereka berbuat melampaui batas. Baik yang segera (di dunia) maupun yang ditunda (di akhirat). Rezeki yang segera berupa ilmu, iman dan hakikat-hakikat amal saleh, sedangkan rezeki yang ditunda berupa kenikmatan yang kekal dan kehidupan yang sejahtera di dekat Ar Rahman (yakni Surga). Ya Allah masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Ya Allah masukkanlah kami ke surga dan jauhkanlah kami dari neraka. Dari kenikmatan yang diberikan kepada mereka di dunia. Dalam ayat ini terdapat isyarat, bahwa seorang hamba apabila melihat dirinya tergiur oleh perhiasan dunia, maka hendaknya ia ingat kenikmatan akhirat dan membandingkan keduanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 131",
    "description": "131. Banyak orang kafir yang mendapat rezeki dan kenikmatan duniawi berlimpah. Allah mengingatkan kaum mukmin untuk tergiur dengan hal tersebut. Wahai orang beriman, janganlah kamu terpesona oleh apa yang orang kafir itu peroleh dan janganlah pula kamu tujukan kedua matamu dengan antusias dan penuh harap kepada apa yang telah kami berikan, berupa kenikmatan duniawi, kepada golongan-golongan dari mereka. Sungguh, semua itu tidak lain sebagai bunga kehidupan dunia untuk kami uji mereka dengannya, dan ketahuilan bahwa karunia tuhan kamu adalah lebih baik dan lebih kekal dari segala sisinya"
  }
]