[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan perintahkanlah (wahai Nabi) keluargamu untuk shalat dan bersabarlah kamu dalam menjalankannya. Kami tidak meminta harta kepadamu. Kami-lah Yang memberimu rizki dan memberimu karunia, dan kesudahan yang baik di dunia dan akhirat adalah bagi orang-orang yang bertakwa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "132. Dan perintahkanlah keluargamu -wahai Rasul- untuk mendirikan salat, dan bersabarlah engkau dalam menjalankannya, sungguh Kami tidak meminta rezeki kepadamu atau kepada selainmu, sebab Kami lah yang memberimu rezeki. Adapun akibat yang baik di dunia ini dan di Akhirat kelak hanyalah diperuntukkan bagi orang-orang bertakwa yang takut kepada Allah, sehingga mereka pun mengerjakan perintah dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "132. Perintahkanlah keluargamu untuk mendirikan shalat, dan bersabar dan beristiqamahlah dalam menjalankan perintah ini. Kami tidak membebanimu untuk memberi rezeki kepada dirimu dan keluargamu, namun Kami-lah yang memberi rezeki kepada kalian semua. Dan kesudahan yang baik di akhirat berupa surga hanya bagi orang-orang yang bertakwa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "132. وَأْمُرْ أَهْلَكَ بِالصَّلَوٰةِ (Dan perintahkanlah kepada keluargamu mendirikan shalat) Yang dimaksud adalah keluarganya, dan pendapat lain mengatakan yang dimaksud adalah seluruh umatnya. وَاصْطَبِرْ عَلَيْهَا ۖ( dan bersabarlah kamu dalam mengerjakannya) Yakni bersabarlah dalam menjalankan shalat. لَا نَسْـَٔلُكَ رِزْقًا (Kami tidak meminta rezeki kepadamu) Yakni Kami tidak memintamu untuk memberi dirimu dan keluargamu rezeki. نَّحْنُ نَرْزُقُكَ ۗ (Kamilah yang memberi rezeki kepadamu) Yakni Kami-lah yang memberi mereka rezeki. وَالْعٰقِبَةُ لِلتَّقْوَىٰ( Dan akibat (yang baik) itu adalah bagi orang yang bertakwa) Yakni kesudahan yang terpuji berupa surga adalah bagi orang yang bertakwa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara pintu pembuka rezeki adalah : tadabbur 'amaliyah Para salaf shalih dahulu jika musibah kelaparan menimpa keluarga mereka, mereka menyeru kepada keluarganya : dirikanlah shalat; karena ini adalah perintah Allah, kemudian membacakan ayat ini. 2 ). Menyibukkan diri dengan memperbanyak doa-doa wajib akan mendatangkan rezeki yang melimbah sekalipun kita tidak begitu sibuk mencarinya, Allah berfirman : { وَأْمُرْ أَهْلَكَ بِٱلصَّلَوٰةِ وَٱصْطَبِرْ عَلَيْهَا ۖ لَا نَسْـَٔلُكَ رِزْقًا ۖ نَّحْنُ نَرْزُقُكَ ۗ وَٱلْعَٰقِبَةُ لِلتَّقْوَىٰ } \"Dan perintahkanlah kepada keluargamu mendirikan shalat dan bersabarlah kamu dalam mengerjakannya. Kami tidak meminta rezeki kepadamu, Kamilah yang memberi rezeki kepadamu. Dan akibat (yang baik) itu adalah bagi orang yang bertakwa\". 3 ). Tatkala kamu merasa bosan disebabkan oleh banyaknya usahamu memerintahkan dan membangunkan keluarga untuk mendirikan shalat (khususnya shalt subuh) maka ingatlah firman Allah : { وَأْمُرْ أَهْلَكَ بِٱلصَّلَوٰةِ وَٱصْطَبِرْ عَلَيْهَا } \"Dan perintahkanlah kepada keluargamu mendirikan shalat dan bersabarlah kamu dalam mengerjakannya\" dengannya akan memperkuat kesabaran kita dalam meraih pahala, dan menghilangkan rasa bosan, dan ingatlah bahwa ada balasan yang akan segera menyertaimu : { لَا نَسْـَٔلُكَ رِزْقًا ۖ نَّحْنُ نَرْزُقُكَ ۗ وَٱلْعَٰقِبَةُ لِلتَّقْوَىٰ } \"Kami tidak meminta rezeki kepadamu, Kamilah yang memberi rezeki kepadamu. Dan akibat (yang baik) itu adalah bagi orang yang bertakwa\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "132. Dan perintahkanlah ahlu baitmu untuk menunaikan shalat. Bersabarlah dan tetaplah mengerjakan shalat. Kami tidak membebanimu untuk memberi rejeki dirimu dan keluargamu, namun Kamilah yang memberimu rejeki. Dan hasil yang baik itu ada di akhirat, yaitu surga bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perintahkanlah keluargamu untuk shalat dan berpegang teguh dalam mengerjakannya} dan terus melaksanakannya dengan sabar {Kami tidak meminta rezeki kepadamu} Kami tidak membebanimu untuk mencari rezeki untuk dirimu dan juga orang lain {Kamilah yang memberi rezeki kepadamu. Dan kesudahan itu bagi orang yang bertakwa} orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "132. Maksudnya himbaulah keluargamu untuk mendirikan sholat, doronglah mereka untuk shalat, baik yang wajib maupun sunnah. (Perintah kepada sesuatu, berarti memerintahkan segala sesuatu yang mana suatu yang wajib tidak akan sempurna kecuali dengannya). Maka ia juga menjadi perintah mengajari anggota keluarga tentang perkara-perkara yang memperbaiki shalat dan merusaknya serta yang menyempurnakannya “dan bersabarlah kamu dalam mengerjakannya,” yaitu mengerjakan shalat dengan menegakannya dengan menyempurnakan batasan-batasan aturannya, rukun-rukunnya, [adab-adabnya], dan unsur khusyu’nya. Sesungguhnya hal itu berat dirasakan oleh jiwa manusia. Akan tetapi, sepatutnya seseorang memaksakan diri dan berusaha keras untuk mengerjakannya dan selalu bersabar dengan ibadah ini. Sesungguhnhya seorang hamba, jika dia benar menegakkan shalatnya sesuai dengan yang diperintahkan, maka dengan urusan agama yang lainnya, niscaya dia akan lebih menjaga dan tekun mengerjakannya. Jika dia menyia-nyiakannya, maka dia akan lebih menyia-nyiakan perintah agama yang lainnya. Kemudian Allah (memberitahukan) tentang jaminan rizki bagi Rasululllah, agar perhatian kepadanya tidak menyibukkan beliau dari tugas menegakan agamaNYa. Allah berfirman, “Kami-lah yang memberi rizki kepadamu,” maksudnya rizkimu menjadi tanggungan Kami. Kami yang menanggung sebagaimana Kami bertanggung jawab atas rizki bagi semua makhluk. Bagaimana dengan orang yang melaksanakan perintah Kami dan sibuk dengan mengingat Kami?! (Sudah tentu Kami lebih menjaminnya). Curahan rizki Allah itu umum, merata bagi orang yang bertakwa dan tidak. Maka , seyogyanya diperhatikan hal-hal yang mendatangkan kebahagiaan yang abadi, yaitu ketakwaan. Oleh karena itu, Allah berfirman, “Dan akibat (yang baik),” di dunia dan akhirat “adalah bagi orang yang bertakwa,” yang hakikatnya yaitu melaksanakan perintah dan menjauhi larangan. Siapa saja yang merealisasikannya, niscaya dia mendapatkan kesudahan yang baik. Seperti FIrman Allah \"Dan kesudahan yang baik adalah bagi orang-orang yang bertakwa\" (Al-A’raf:128)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 132: Yang fardhu maupun yang sunat. Perintah kepada sesuatu, berarti perintah pula kepada semua yang menjadikan shalat sempurna. Termasuk juga perintah mengajarkan mereka (keluarga) tentang shalat, seperti yang wajib dalam shalat dan yang sunahnya, demikian pula yang membatalkan shalat dan yang makruh dalam shalat. Dengan menegakkannya, mengerjakan rukun-rukun, adab-adab dan khusyu’nya. Hal ini memang berat bagi jiwa, akan tetapi perlu dipaksa dan dikerahkan kemampuan sehingga terbiasa. Yang demikian karena apabila seseorang sudah mengerjakan shalat sesuai yang diperintahkan dan menjaganya, maka terhadap perintah-perintah agama yang lain, maka dia akan mampu menjaganya. Sebaliknya, jika shalatnya tidak diperhatikan bahkan ditinggalkan, maka perintah-perintah agama yang lain tentu akan ditinggalkan. Selanjutnya Allah Subhaanahu wa Ta'aala menjamin tentang masalah rezeki, yakni janganlah hal itu terlalu dipikirkan sampai kurang memberikan perhatian terhadap perintah-perintah agama. Yakni Kami tidak membebanimu agar engkau memberikan rezeki untuk dirimu dan untuk selainmu. Jika semua makhluk sudah ditanggung rezekinya, maka bagaimana dengan orang yang menegakkan perintah-perintah-Nya dan sibuk mengingat-Nya? Tentu Dia akan lebih menanggungnya. Rasulullah shallalllahu 'alaihi wa sallam bersabda: يَقُوْلُ رَبُّكُمْ يَا ابْنَ آدَمَ تَفَرَّغْ لِعِبَادَتِيْ أَمْلَأُ قَلْبَكَ غِنًى وَأَمْلَأُ يَدَكَ رِزْقًا يَا ابْنَ آدَمَ لَا تُبَاعِدْ مِنِّيْ أَمْلَأُ قَلْبَكَ فَقْرًا وَأَمْلَأُ يَدَكَ شُغْلاً Tuhanmu berfirman, “Wahai anak Adam! Sempatkanlah beribadah kepada-Ku, niscaya Aku akan penuhi hatimu dengan rasa cukup dan Aku akan memenuhi tanganmu dengan rezeki. Wahai anak Adam! Janganlah menjauh dari-Ku. Jika demikian, Aku akan memenuhi hatimu dengan kefakiran dan Aku akan memenuhi tangan-Mu dengan kesibukan.” (HR. Hakim, dan dishahihkan oleh Syaikh Al Albani dalam Shahihut Targhib wat Tarhib) Baik di dunia dan di akhirat. Rezeki Allah merata ke semua orang, baik yang bertakwa maupun yang tidak, oleh karena itu, perlu lebih memperhatikan sesuatu yang mendatangkan kebahagiaan abadi, yaitu takwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 132",
    "description": "131. Banyak orang kafir yang mendapat rezeki dan kenikmatan duniawi berlimpah. Allah mengingatkan kaum mukmin untuk tergiur dengan hal tersebut. Wahai orang beriman, janganlah kamu terpesona oleh apa yang orang kafir itu peroleh dan janganlah pula kamu tujukan kedua matamu dengan antusias dan penuh harap kepada apa yang telah kami berikan, berupa kenikmatan duniawi, kepada golongan-golongan dari mereka. Sungguh, semua itu tidak lain sebagai bunga kehidupan dunia untuk kami uji mereka dengannya, dan ketahuilan bahwa karunia tuhan kamu adalah lebih baik dan lebih kekal dari segala sisinya. 133. Ayat-ayat berikut berisi uraikan tentang tuntutan orang kafir dan peringatan yang Allah sampaikan kepada mereka melalui rasulullah. Orang kafir mengeluhkan hukuman yang mereka terima dan mereka berkata, 'mengapa dia, Muhammad, tidak membawa tanda bukti kepada kami dari tuhannya agar kami percaya dan menaati ajaran-Nya'' sungguh aneh perkataan mereka karena mereka telah diberi peringatan. Bukankan telah datang kepada mereka bukti nyata tentang azab yang Allah timpakan kepada umat-umat terdahulu yang ingkar, sebagaimana yang tersebut di dalam kitab-kitab yang dahulu, yakni taurat dan injil''."
  }
]