[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendustakanmu (wahai Rasul) berkata, “Mengapa kamu tidak membawakan kepada kami satu tanda dari Tuhanmu yang menunjukkan kebenaranmu?” bukankah telah datang kepada mereka al-Qur’an ini yang membenarkan kebenaran-kebenaran yang terdapat dalam kitab-kitab suci terdahulu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "133. Dan orang-orang kafir yang mendustakan Nabi -ṣallallāhu 'alaihi wa sallam- berkata, \"Mengapa Muhammad tidak mendatangkan kepada kami tanda bukti dari Tuhannya yang menunjukkan kebenaran dan kerasulannya?\". Bukankah telah datang kepada orang-orang yang mendustakan itu kitab Al-Qur`ān yang membenarkan kitab-kitab samawi yang sebelumnya?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "133. Orang-orang musyrik berkata: “Mengapa Muhammad tidak mendatangkan kepada kami mukjizat yang menjadi bukti atas kebenarannya?” Maka Allah mengingkari dan mengolok mereka: “Tidakkah mereka merasa cukup al-Qur’an sebagai mukjizat yang paling besar, yang membenarkan kebenaran yang ada dalam kitab-kitab terdahulu?” Allah telah menjelaskan bahwa yang dimaksud dengan kitab-kitab terdahulu adalah shuhuf Ibrahim dan Musa, sebagaimana disebutkan dalam akhir surat al-A’la, dalam surat ini Allah menjelaskan lebih terperinci tentang sebagian kandungan shuhuf Ibrahim dan Musa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "133. وَقَالُوا۟ لَوْلَا يَأْتِينَا بِـَٔايَةٍ مِّن رَّبِّهِۦٓ ۚ (Dan mereka berkata: “Mengapa ia tidak membawa bukti kepada kami dari Tuhannya?”) Sebagaimana para nabi sebelumnya datang dengan membawa bukti (mukjizat). Yakni mukjizat-mukjizat yang mereka usulkan kepadanya. أَوَلَمْ تَأْتِهِم بَيِّنَةُ مَا فِى الصُّحُفِ الْأُولَىٰ( Dan apakah belum datang kepada mereka bukti yang nyata dari apa yang tersebut di dalam kitab-kitab yang dahulu?) Yakni kitab Taurat dan Injil. Dalam kitab-kitab tersebut terdapat penjelasan tentang kenabiannya, dan mereka mengakui kebenaran kitab-kitab itu. Di dalamnya juga terdapat bantahan terhadap keingkaran mereka terhadap kenabiannya dan kebebalan mereka. Serta terdapat pula kisah bagaimana Kami binasakan umat-umat yang kafir dan orang-orang yang mengusulkan mukjizat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "133. Dan orang-orang musyrik itu berkata: “Ayolah datangkan kepada kami tanda-tanda mukjizat yang dapat dirasakan (oleh indera) dari Tuhan yang menunjukkan pada kebenaran risalahnya, sebagaimana ayat-ayat para nabi sebelumnya, seperti untanya Shalih, tongkatnya Musa, penyembuhan Isa terhadap orang buta dan orang yang terkena kusta.” Lalu Allah membalas mereka dengan berfirman: “Apakah belum sampai kepada mereka berita-berita dari shuhuf-shuhuf pertama seperti shuhuf Ibrahim, shuhuf Musa, kitab Taurat, dan kitab Injil yang di dalamnya dijelaskan tentang kenabiannya (Muhammad) dan penjelasan tentang keadaan umat-umat yang dihancurkan karena mendustakan para rasul, sedangkan mereka itu mengakui kebenarannya?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Mengapa dia tidak} mengapa tidak {membawa tanda kepada kami} tanda yang menunjukkan kepada kebenarannya {dari Tuhannya” Bukankah telah datang kepada mereka bukti nyata} penjelasan {yang ada di dalam kitab-kitab} kitab-kitab {terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133. Maksudnya, orang-orang yang mendustakan Rasulullah mengatakan, “Mengapa dia tidak membawa bukti kepada Kami dari Rabbnya?” Yang mereka maksudkan adalah tanda-tanda kebresaran yang sesuai dengan keinginan mereka. Semisal ucapan mereka, \"Dan mereka berkata: \"Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dari bumi untuk kami, atau kamu mempunyai sebuah kebun kurma dan anggur, lalu kamu alirkan sungai-sungai di celah kebun yang deras alirannya, atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan atau kamu datangkan Allah dan malaikat-malaikat berhadapan muka dengan kami.\" (Al-Isra:90-92). Ini (cerminan) sikap kepala batu dan penentangan serta kezhaliman dari mereka. Mereka dan Rasulullah itu (sama) dari kalangan manusia, hamba Allah. Tidak sepantasnya mereka melontarkan usulan menurut hawa nafsu mereka. Karena Dzat yang menurunkan dan memilih sekehendaknya sesuai dengan tuntutan hikmah hanyalah Allah semata. Lantaran ucapan mereka ini “Mengapa dia tidak membawa bukti kepada Kami dari Rabbnya?” memiliki konsekuensi makna bahwa Rasulullah belum membawakan kepada mereka tanda kebesaran Allah yang menunjukkan kejujuran beliau atau bukti nyata yang menandakan kepada kebenaran beliau, maka ungkapan ini hanya dusta dan mengada-ada saja. Sesungguhnya beliau sudah memperlihatkan mukjizat yang fantastis dan tanda-tanda kebesaran Allah yang melumppuhkan, yang sebagiannya saja sudah cukup mewakili substansinya. Oleh karena itu, Allah berfirman, “Dan apakah belum datang kepada mereka,” jika mereka mau jujur dalam perkataan mereka, bahwa mereka menginginkan kebenaran disertai dalilnya “bukti yang nyata dari apa yang tersebut di dalam kitab-kitab yang dahulu?” yaitu al-Quran yang agung, yang membenarkan berita-berita yang termuat pada lembaran-lembaran kitab tersahulu, berupa Taurat, Injil, dan kitab-kitab Allah sebelumnya, dan yang selaras dengannya, yang memberitahukan berita-berita yang disampaikan oleh kitab-kitab itu. (Bahkan) pembenaran al-Quran pun termaktub di dalamnya, memberi kabar gembira dengan kedatangan Rasulullah (Muhammad). Ini persis seperti Firman Allah, \"Dan apakah tidak cukup bagi mereka bahwasanya Kami telah menurunkan kepadamu Al Kitab (Al Qur'an) sedang dia dibacakan kepada mereka? Sesungguhnya dalam (Al Qur'an) itu terdapat rahmat yang besar dan pelajaran bagi orang-orang yang beriman.\" (Al-Ankabut:51). Ayat-ayat ini hanya bermanfaat bagi kaum Mukminin. Dengan itu, iman dan keyakinan mereka terdongkrak naik. Sementara itu, kaum yang berpaling darinya lagi menggerakkan perlawanan kepadanya, maka mereka tidak mengimaninya dan tidak bisa meraup faidah dengannya, \"Sesungguhnya orang-orang yang telah pasti terhadap mereka kalimat Tuhanmu, tidaklah akan beriman, meskipun datang kepada mereka segala macam keterangan, hingga mereka menyaksikan azab yang pedih.\" (Yunus:96-97)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 133: Yakni orang-orang musyrik atau orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam. Sesuai yang mereka usulkan (lihat surah 90-92). Usul mereka merupakan usul yang menyusahkan diri, pembangkangan dan kezaliman. Sesungguhnya Rasulullah shallallahu 'alaihi wa sallam adalah manusia seperti halnya mereka, tidak pantas diminta bukti sesuai hawa nafsu mereka, bahkan bukti kerasulannya sudah Allah turunkan dan Allah pilih sesuai hikmah (kebijaksanaan)-Nya. Di samping itu, perkataan mereka, \"Mengapa dia tidak membawa tanda (bukti) kepada Kami dari Tuhannya.” Menunjukkan bahwa Allah tidak menurunkan bukti kebenarannya. Hal ini adalah dusta, padahal Alah Subhaanahu wa Ta'aala telah mendatangkan mukjizat dan ayat-ayat yang tujuan tersebut sudah tercapai dengan sebagian ayat-ayat itu. Jika mereka benar ucapannya dan bahwa mereka mencari yang hak dengan dalilnya. Yaitu Al Qur’an. Al Quranul Karim membenarkan apa yang disebutkan dalam kitab-kitab terdahulu, seperti Taurat, Injil dan kitab-kitab dahulu lainnya serta sesuai dengannya, beritanya seperti yang diberitakan kitab-kitab terdahulu yang masih murni. Ayat ini seperti ayat yang berbunyi, “Dan apakah tidak cukup bagi mereka bahwa Kami telah menurunkan kepadamu Al kitab (Al Quran) sedang dia dibacakan kepada mereka? Sesungguhnya dalam (Al Quran) itu terdapat rahmat yang besar dan pelajaran bagi orang-orang yang beriman.” (Terj. Al ‘Ankabut: 51) Oleh karena itu, ayat-ayat Al Qur’an hanyalah bermanfaat bagi orang-orang mukmin, di mana dengannya keimanan dan keyakinan mereka bertambah. Adapun orang-orang yang berpaling darinya lagi menentangnya, maka mereka tidak beriman kepadanya dan tidak dapat mengambil manfaat darinya. Allah Subhaanahu wa Ta'aala berfirman, “Sesungguhnya orang-orang yang telah pasti terhadap mereka kalimat Tuhanmu, tidaklah akan beriman,--Meskipun datang kepada mereka segala macam keterangan, hingga mereka menyaksikan azab yang pedih.” (Terj. Yunus: 96-97) Bahkan disampaikan ayat-ayat itu kepada mereka faedahnya adalah untuk menegakkan hujjah dan agar mereka tidak mengatakan, “Ya Tuhan kami, mengapa tidak Engkau utus seorang rasul kepada kami, sehingga kami mengikuti ayat-ayat-Mu sebelum kami menjadi hina dan rendah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 133",
    "description": "133. Ayat-ayat berikut berisi uraikan tentang tuntutan orang kafir dan peringatan yang Allah sampaikan kepada mereka melalui rasulullah. Orang kafir mengeluhkan hukuman yang mereka terima dan mereka berkata, 'mengapa dia, Muhammad, tidak membawa tanda bukti kepada kami dari tuhannya agar kami percaya dan menaati ajaran-Nya'' sungguh aneh perkataan mereka karena mereka telah diberi peringatan. Bukankan telah datang kepada mereka bukti nyata tentang azab yang Allah timpakan kepada umat-umat terdahulu yang ingkar, sebagaimana yang tersebut di dalam kitab-kitab yang dahulu, yakni taurat dan injil''134. Demikianlah sikap orang kafir. Dan kalau mereka kami binasakan dengan suatu siksaan sebelumnya, yakni sebelum kami turunkan Al-Qur'an kepada nabi Muhammad, tentulah mereka di akhirat nanti berkata, 'ya tuhan kami, mengapa di dunia dulu tidak engkau utus seorang rasul kepada kami untuk mengingatkan kami sehingga kami mengikuti ayat-ayat-Mu sebelum kami menjadi hina akibat siksa ini dan rendah karena kedurhakaan kami''."
  }
]