[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya Kami sungguh-sungguh membinasakan orang-orang yang mendustakan itu dengan siksaan sebelum Kami mengutus kepada mereka seorang rasul dan menurunkan kepada mereka satu kitab, pastilah mereka akan berkata, “Wahai Tuhan kami, tidakkah Engkau utus kepada kami seorang rasul dari sisiMu sehingga kami kemudian beriman kepadanya dan mengikuti ayat-ayatMu dan ajaran syariatMu, sebelum kami hina dan nista karena siksaanMu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "134. Dan sekiranya Kami membinasakan orang-orang yang mendustakan Nabi -ṣallallāhu 'alaihi wa sallam- dengan menurunkan azab atas mereka lantaran kekafiran dan kedurhakaan mereka sebelum Kami mengutus rasul dan menurunkan kitab Al-Qur`ān kepada mereka, niscaya pada hari Kiamat kelak mereka akan berkata untuk mengemukakan alasan kekafiran mereka, \"Wahai Tuhan kami, mengapa engkau tidak mengutus kepada kami seorang Rasul ketika di dunia, sehingga kami bisa beriman kepadanya dan mengikuti petunjuk yang ia bawa berupa tanda-tanda kebesaran-Mu sebelum kami ditimpa kehinaan dan kebinasaan karena azabmu?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "134-135. Jika saja Kami membinasakan orang-orang kafir itu sebelum al-Qur’an diturunkan dan sebelum Muhammad di diutus, niscaya mereka akan berkata: “Ya Tuhan kami, mengapa Engkau tidak mengutus kepada kami seorang rasul agar kami dapat beriman kepadanya dan mengamalkan ayat-ayat-Mu dan hukum-hukum yang dikandungnya, sebelum kami terhinakan oleh siksaan di dunia berupa terbunuh, tertawan, dan siksaan lainnya.” Hai Nabi, katakanlah kepada mereka: “Kami dan kalian sama-sama menunggu kesudahannya, siapa yang akan mendapat kemenangan dan kesudahan yang baik? Sehingga kalian dapat mengetahui siapa yang lurus jalannya dan mendapat petunjuk menuju kebenaran?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "134. وَلَوْ أَنَّآ أَهْلَكْنٰهُم بِعَذَابٍ مِّن قَبْلِهِۦ (Dan sekiranya Kami binasakan mereka dengan suatu azab sebelumnya) Yakni sebelum diutusnya Muhammad. لَقَالُوا۟ (tentulah mereka berkata) Di hari kiamat. رَبَّنَا لَوْلَآ أَرْسَلْتَ إِلَيْنَا رَسُولًا (Ya Tuhan kami, mengapa tidak Engkau utus seorang rasul kepada kami) Yakni mengapa Engkau tidak mengurus kepada kami seorang Rasul di dunia. فَنَتَّبِعَ ءَايٰتِكَ(lalu kami mengikuti ayat-ayat Engkau) Yakni mengikuti Rasul yang membawa ayat-ayat tersebut. مِن قَبْلِ أَن نَّذِلَّ (sebelum kami menjadi hina) Akibat azab di dunia. وَنَخْزَىٰ (dan rendah) Akibat masuk neraka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Berpaling dari al-Qur'an adalah merupakan kehinaan di dunia, dan kerugian besar di akhirat : { فَنَتَّبِعَ ءَايَٰتِكَ مِن قَبْلِ أَن نَّذِلَّ وَنَخْزَىٰ } \"lalu kami mengikuti ayat-ayat Engkau sebelum kami menjadi hina dan rendah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "134. Dan kalaupun Kami binasakan orang-orang musyrik itu dengan azab sebelum diutusnya Muhammad SAW kepada mereka, maka pada hari kiamat mereka akan berkata: “Wahai Tuhan kami, tidakkah Engkau mengutus untuk kami seorang rasul di dunia. Maka kami akan mengikuti orang yang diutus dengan ayat-ayatMu berupa perintah dan larangan, sebelum kami hina oleh azab dunia, berupa pembunuhan dan penawanan, dan sebelum kami diperlihatkan masuk neraka di akhirat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Kami membinasakan mereka dengan suatu siksaan sebelumnya} sebelum dikirimkan seorang rasul dan diturunkan Al-Qur’an{pasti mereka berkata,“Ya Tuhan kami, mengapa tidak Engkau utus seorang rasul kepada kami sehingga kami mengikuti ayat-ayatMu sebelum kami menjadi hina dan rendah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "134. Faidah dari (tindakan) mengarahkan ayat-ayat kepada mereka dan mengajak bicara dengannya ialah unttuk tujuan penegakkan hujjah Allah atas mereka. Agar mereka tidak berkomentar ketika siksaan datang kepada mereka, “Mengapa tidak Engkau utus seorang rasul kepada kami, lalu kami mengikuti ayat-ayatMu sebelum kami menjadi hina dan rendah?” dengan sebab hukuman. Sekarang telah datang kepada kalian utusanKu, yang dibekali dengan ayat-ayat serta petunjuk-petunjuk dariKu. Jika kalian memang sesuai dengan perkataan kalian, maka percayailah dia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 134: Bisa juga diartikan, “Sebelum Nabi Muhammad shallallahu 'alaihi wa sallam diutus.” Pada hari kiamat. Di hari kiamat. Dengan masuk ke neraka Jahanam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 134",
    "description": "134. Demikianlah sikap orang kafir. Dan kalau mereka kami binasakan dengan suatu siksaan sebelumnya, yakni sebelum kami turunkan Al-Qur'an kepada nabi Muhammad, tentulah mereka di akhirat nanti berkata, 'ya tuhan kami, mengapa di dunia dulu tidak engkau utus seorang rasul kepada kami untuk mengingatkan kami sehingga kami mengikuti ayat-ayat-Mu sebelum kami menjadi hina akibat siksa ini dan rendah karena kedurhakaan kami''135. Wahai nabi Muhammad, tanda keengganan orang kafir mengikuti petunjuk Allah telah jelas. Karena itu, katakanlah kepada mereka, 'masing-masing dari kita, yaitu umat beriman di satu pihak dan kaum kafir di pihak lain, menanti apa yang akan dilakukan Allah kelak. Jika demikian, maka nantikanlah ketetapan Allah itu olehmu! dan kelak ketika keputusan-Nya datang, kamu akan mengetahui siapa di antara kita yang menempuh jalan yang lurus dan siapa yang telah terhindar dari kesesatan dengan mendapat petunjuk dari Allah yang mahabenar. '."
  }
]