[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul), kepada kaum yang menyekutukan Allah, “Masing-masing dari kami dan kalian itu akan menunggu pergantian masa, dan bagi siapa kelak kemenangan dan kejayaan. Maka tunggulah, kalian akan mengetahui siapakah orang-orang yang berada di atas jalan lurus dan memperoleh hidayah kepada kebenaran; kami atau kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "135. Maka katakanlah -wahai Rasul- kepada orang-orang yang mendustakanmu itu, \"Masing-masing dari kita menanti apa yang akan diperbuat oleh Allah, maka nantikanlah olehmu, dan kelak pasti kalian akan mengetahui siapakah yang menempuh jalan yang lurus dan mendapat petunjuk diantara kita; kami atau kalian?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "135. قُلْ كُلٌّ مُّتَرَبِّصٌ فَتَرَبَّصُوا۟ ۖ (Katakanlah: “Masing-masing (kita) menanti, maka nantikanlah oleh kamu sekalian!) Yakni Wahai Muhammad, katakanlah kepada mereka “aku dan kalian sama-sama menunggu kesudahan urusan ini, maka tunggulah!” فَسَتَعْلَمُونَ(Maka kamu kelak akan mengetahui) Sebentar lagi. مَنْ أَصْحٰبُ الصِّرٰطِ السَّوِىِّ(siapa yang menempuh jalan yang lurus) Yakni kalian akan mengetahui pada kesudahannya, siapakah yang berada pada kebenaran, aku atau kalian. وَمَنِ اهْتَدَىٰ (dan siapa yang telah mendapat petunjuk) Petunjuk dari kesesatan dan terlepas dari kegelapan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "135. Katakanlah kepada mereka wahai Nabi: “Masing-masing aku dan kalian itu menantikan perkara yang akan diterangkan di dunia, maka nantikanlah!. Kalian akan mengetahuinya, siapa orang yang berada di jalan yang lurus dengan mengikuiti Islam dan siapa yang diberi petunjuk dari kesesatan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Masing-masing menanti} menanti {maka menantilah} maka menantilah {Kalian akan mengetahui siapa yang berada di jalan yang lurus} yang lurus {dan siapa yang telah mendapat petunjuk”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "135. “Katakanlah,” wahai Muhammad, untuk menyampaikan pembicaraan kepada orang-orang yang mendustakan dirimu, yang mengatakan, “Kalian nantikanlah kematiannya.” “Katakanlah, ‘Masing-masing (kita) menanti’,” maka kalian nantikanlah kematianku, dan aku menantikan kalian diazab. \"Katakanlah: \"tidak ada yang kamu tunggu-tunggu bagi kami, kecuali salah satu dari dua kebaikan\" (At-Taubah:52). Yaitu kemenangan atau kematian syahid. Kami menunggu Allah menimpakan siksa dari sisiNya (kepada kalian) atau melalui tangan-tangan kami. “Maka kalian nantikanlah! Maka kamu kelak akan mengetahui, siapa yang menempuh jalan yang llurus,” jalan yang lurus dan benar “dan siapa yang telah membawa petunjuk,” dengan menempuhnya, sayakah atau kalian. Sesungguhnya pemilik jalan lurus itulah yang menang, mendapatkan petunjuk, selamat lagi beruntung. Dan siapa yang berbelok darinya, niscaya dia merugi, gagal lagi tersiksa. Dan sungguh telah diketahui bahwa Rasulullah itulah insan yang bersifat seperti itu. Sementara para musuh beliau, tidak demikian. Wallahu a’lam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 135: Kepada orang-orang yang mendustakanmu, yang berkata, “Kami tunggu-tunggu kecelakaan menimpanya\" (lihat Ath Thuur: 30) Yakni nantikanlah kematianku olehmu, dan aku menanti azab untukmu. Tidak ada yang kamu nantikan dariku selain dua kebaikan; kemenangan atau syahid. Sedangkan kami menantikan untukmu azab dari sisi Allah atau melalui tangan kami. Pada hari kiamat. Untuk menempuh jalan yang lurus itu, yakni aku atau kamu. Orang yang menempuhnya adalah orang yang berhasil, selamat dan beruntung, sedangkan orang yang menyimpang darinya akan rugi, kecewa dan tersiksa. Jelas, orang yang berada di atas jalan yang lurus adalah Rasulullah shallallahu 'alaihi wa sallam dan para pengikutnya, sedangkan musuh-musuhnya tidak berada di atasnya. Selesai tafsir surah Thaha dengan pertolongan Allah dan taufiq-Nya dan al hamdulillah di awal dan di akhirnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 135",
    "description": "135. Wahai nabi Muhammad, tanda keengganan orang kafir mengikuti petunjuk Allah telah jelas. Karena itu, katakanlah kepada mereka, 'masing-masing dari kita, yaitu umat beriman di satu pihak dan kaum kafir di pihak lain, menanti apa yang akan dilakukan Allah kelak. Jika demikian, maka nantikanlah ketetapan Allah itu olehmu! dan kelak ketika keputusan-Nya datang, kamu akan mengetahui siapa di antara kita yang menempuh jalan yang lurus dan siapa yang telah terhindar dari kesesatan dengan mendapat petunjuk dari Allah yang mahabenar. '1. Telah semakin dekat kepada manusia, yang kafir dan yang menyekutukan Allah, perhitungan amal mereka, pada hari kiamat tentang semua yang mereka kerjakan di dunia, sedang mereka dalam keadaan lalai tentang dahsyatnya hari kiamat, karena kesibukan mereka tentang dunia, mereka berpaling dari iman terhadap akhirat."
  }
]