[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Aku adalah Allah, tidak ada yang berhak diibadahi kecuali Aku, tiada sekutu bagiKu, maka sembahlah Aku saja, dan tegakkanlah shalat untuk mengingatKu di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sesungguhnya Aku ini adalah Allah, tiada tuhan yang berhak disembah selain-Ku, maka sembahlah Aku semata, dan dirikanlah salat secara sempurna agar engkau mengingat-Ku dengannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. إِنَّنِىٓ أَنَا اللهُ (Sesungguhnya Aku ini adalah Allah) Yakni yang memanggilmu adalah Allah. فَاعْبُدْنِى (maka sembahlah Aku) Karena sifat ketuhanan hanya ada pada diri-Nya maka peribadatan hanya bagi-Nya. وَأَقِمِ الصَّلَوٰةَ(dan dirikanlah shalat) Allah khusus menyebutkan ibadah shalat karena ia adalah ketaatan yang paling mulia dan ibadah yang paling baik. لِذِكْرِىٓ (untuk mengingat Aku) Yakni untuk mengingatku. Pendapat lain mengatakan maksudnya adalah dirikanlah shalat ketika kamu teringat bahwa terdapat suatu shalat yang harus kamu kerjakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Sesungguhnya Akulah yang menyerumu, Akulah Allah, maka menyembahlah kepadaKu, jangan menyembah tuhan lain bersamaKu, tunaikanlah shalat supaya kamu mengingatKu di dalamnya, dan selalu perhatikanlah shalatmu karena itu adalah semulia-mulia dan sebaik-baik ketaatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Aku adalah Allah, tidak ada tuhan selain Aku. Maka sembahlah Aku dan tegakkanlah shalat untuk mengingatKu} agar kamu mengingatku di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Kemudian Allah menjelaskan wahyu yang disampaikan kepadanya dengan FirmanNya, “Sesungguhnya Aku ini adalah Allah, tidak ada sesembahan (yang berhak disembah) kecuali Aku,” maksudnya Allah-lah yang berhak diibadahi, dan Dzat yang melekat padaNya sifat tersebut. Sebab, Dia yang Mahasempurna dalam nama-nama dan sifat-sifatNya, Esa dengan perbuatan-perbuatanNya, tidak ada sekutu bagiNya, tidak ada bandingan, padanan, dan dzat yang sama dengannya. “Maka sembahlah Aku,” dalam segala macam ibadah, yang zahir maupun yang batin, ibadah yang prinsip maupun yang bersifat sekunder. Selanjutnya, Allah menyebutkan shalat secara khusus, meskipun sudah termasuk dalam bingkai ibadah, karena keutamaan dan kemuliaannya serta muatannya yang mengandung penghambaan hati, lisan dan anggota tubuh lainnya. Firman Allah, “Dan dirikanlah shalat untuk mengingatKu,” huruf lam berfungsi sebagai ta’lil (penyebutan sebab). Maksudnya, tegakkanlah shalat untuk tujuan mengingatKu. Sebab mengingat nama Allah merupakan tujjuan yang paling agung. Dengan itulah hati menghambakan diri kepada Allah. Dengan itu pula, kebahagiaan tergapai. Hati yang kosong dari dzikir kepada Allah, niscaya akan menjadi kosong dari segala kebaikan. Ia benar-benar telah mengalami kerusakan yang parah, maka Allah menggariskan berbagai macam ibadah yang ditujukan untuk mengingatNya, terutama pada shalat. Allah berfirman, \"Bacalah apa yang telah diwahyukan kepadamu, yaitu Al Kitab (Al Qur'an) dan dirikanlah salat. Sesungguhnya salat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar. Dan sesungguhnya mengingat Allah (salat) adalah lebih besar (keutamaannya dari ibadah-ibadah yang lain). Dan Allah mengetahui apa yang kamu kerjakan.\" (Al-Ankabut:45). Maksudnya, kandungannya berupa dzikrullah lebih besar daripada (fungsinya) mencegah dari perbuatan keji dan kemungkaran. Jenis ini, disebut tauhid ilahiyah (uluhiyah) dan tauhid ibadah. Uluhiyah (hak disembah) merupakan sifat Allah. Sementara ubudiyah (menghambakan diri) merupakan sifat makhlukNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 14: Yakni dengan mengarahkan semua ibadah yang nampak maupun tersembunyi, yang dasar maupun yang cabang. Disebutkan shalat meskipun ia termasuk ke dalam ibadah, karena kelebihan dan keistimewaannya dan karena di dalamnya terdapat ibadah hati, lisan dan anggota badan. Yang demikian, karena tanpa mengingat-Nya, maka akan hilang semua kebaikan, maka Allah mensyariatkan berbagai ibadah yang tujuannya adalah untuk mengingat-Nya, terutama shalat. Allah Subhaanahu wa Ta'aala berfirman, “Bacalah apa yang telah diwahyukan kepadamu, yaitu Al Kitab (Al Quran) dan dirikanlah shalat. Sesungguhnya shalat itu mencegah dari (perbuatan-perbuatan) keji dan mungkar. Sesungguhnya mengingat Allah (shalat) adalah lebih besar (keutamaannya dari ibadat-ibadat yang lain). dan Allah mengetahui apa yang kamu kerjakan.” (Terj. Al ‘Ankabut: 45) Yakni shalat yang di sana terdapat dzikrullah itu lebih besar dari sekedar dapat mencegah dari perbuatan keji dan munkar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 14",
    "description": "Wahai musa, ketahuilah sesungguhnya aku ini adalah Allah, tuhanmu, dan sungguh tidak ada tuhan pencipta alam raya yang layak disembah selain aku, maka berimanlah kepada-ku, sembahlah aku, dan laksanakanlah salat untuk mengingat-ku dan bersyukur kepada-ku. ' inilah prinsip pertama akidah, yaitu keesaan tuhan. 15. Allah lalu menyusuli dengan prinsip berikutnya, yaitu keniscayaan kiamat. \"sungguh, hari kiamat itu akan datang tanpa ada keraguan sedikit pun tentangnya, namun aku merahasiakan waktu kedatangannya. Karena itu, siapkanlah dirimu untuk menghadapinya. Hari kiamat itu merupakan suatu keniscayaan agar setiap orang yang mukalaf dibalas sesuai dengan apa yang telah dia usahakan dalam kehidupannya di dunia ini. '."
  }
]