[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Hari Kiamat yang umat manusia akan dibangkitkan padanya akan tiba dan pasti akan datang waktu kejadiannya. Aku hampir merahasiakannya terhadap DiriKu, bagaimana mungkin ada seseorang dari kalangan makhluk yang mengetahuinya? Supaya tiap-tiap jiwa diberi balasan sesuai dengan apa yang diperbuatnya di dunia; perbuatan yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya hari Kiamat itu pasti datang, dan pasti terjadi, Aku merahasiakan waktunya sehingga tidak ada satu makhluk pun yang mengetahuinya, akan tetapi mereka mengetahui tanda-tanda akan terjadinya melalui kabar yang diberikan oleh Nabi kepada mereka; semua itu dengan tujuan agar setiap orang diberikan balasan sesuai dengan apa yang ia amalkan baik berupa amalan baik ataupun amalan buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15-16. “Hari kiamat pasti akan datang, tidak ada satu makhlukpun yang mengetahui waktu kejadiannya, Aku merahasiakan waktu kejadiannya agar setiap jiwa dibalas sesuai kebaikan atau keburukan yang dia lakukan di dunia. Hai Musa, maka janganlah memalingkanmu dari keimanan kepada hari kiamat orang-orang yang tidak beriman kepadanya dan mengikuti hawa nafsunya dalam mengingkarinya, agar kamu tidak ikut binasa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّ السَّاعَةَ ءَاتِيَةٌ (Segungguhnya hari kiamat itu akan datang) Maka kerjakanlah amal kebaikan dengan menjalankan shalat dan ibadah kepada Allah lainnya. أَكَادُ أُخْفِيهَا(Aku merahasiakan (waktunya)) Allah sangat merahasiakan waktu kedatangan kiamat sehingga Allah menggunakan ungkapan yang paling dalam yang dikenal oleh orang Arab. Pendapat lain mengatakan maknanya adalah Aku hampir menunjukkannya. لِتُجْزَىٰ كُلُّ نَفْسٍۭ بِمَا تَسْعَى(agar supaya tiap-tiap diri itu dibalas dengan apa yang ia usahakan) Yakni akan dibalas amalan-amalan yang telah mereka perbuat baik itu amal kebaikan maupun amal keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya kiamat itu pasti terjadi. Aku cenderung menyembunyikan (waktu)nya dan tidak menampakkannya kepada siapapun. Difirmankan juga: “Aku hampir menampakkannya, menghilangkan tabir yang menutupinya, dan mengakhiri alam dunia supaya setiap jiwa bisa dibalas sesuai apa yang dikerjakannya berupa kebaikan atau keburukan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya hari kiamat itu akan datang} itu pasti terjadi bukan mustahil {Aku hampir menyembunyikannya} menyembunyikannya, sehingga wajar bila makhluk tidak mengetahuinya {agar setiap jiwa dibalas sesuai dengan apa yang telah dia usahakan} dengan apa yang dia kerjakan berupa kebaikan dan keburukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “SEsungguhnya Hari Kiamat itu akan datang,” maksudnya pasti terjadi “(hampir saja) Aku merahasiakan (waktu) nya,” yaitu dari diriKu sendiri, sebagaimana termaktub pada salah satu versi qira’ah. Seperti Firman Allah, \" manusia bertanya kepadamu tentang kiamat, katakanlah sesungguhnya ilmunya ada di sisi Allah. Allah berfirman, \"dan di sisi Allah lah ilmu tentang kimat\" (Az-Zukhruf:85). Pengetahuan mengenai waktu terjadinya sudah Allah sembunyikan dari para makhuk semmuanya. Malaikat yang dekat dengan Alllah dari nabi yang diutus pun tidak mengetahuinya. Hikmah dihadirkannya Hari Kiamat “supaya tiap-tiap diri itu dibalas dengan amal yang dia usahakan,” yang baik ataupun yang buruk. Hari kiamat adalah pintu menuju akhirat, \"supaya Dia memberi balasan kepada orang-orang yang berbuat jahat terhadap apa yang telah mereka kerjakan dan memberi balasan kepada orang-orang yang berbuat baik dengan pahala yang lebih baik (surga).\" (An-Najm:31)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 15: Dia memberitahukan kedekatannya dan menunjukkan tanda-tandanya. Namun tidak ada yang mengetahui kapan terjadinya selain Dia, malaikat yang didekatkan dan nabi yang diutus tidaklah mengetahuinya. Hikmah adanya kiamat adalah agar amal manusia selama di dunia diberikan balasan dan agar keadilan tegak seperti yang dijelaskan pada lanjutan ayatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 15",
    "description": "Allah lalu menyusuli dengan prinsip berikutnya, yaitu keniscayaan kiamat. \"sungguh, hari kiamat itu akan datang tanpa ada keraguan sedikit pun tentangnya, namun aku merahasiakan waktu kedatangannya. Karena itu, siapkanlah dirimu untuk menghadapinya. Hari kiamat itu merupakan suatu keniscayaan agar setiap orang yang mukalaf dibalas sesuai dengan apa yang telah dia usahakan dalam kehidupannya di dunia ini. ' 16. Maka setelah engkau mengetahui keniscayaan kiamat, janganlah sekali-kali engkau dipalingkan dari-Nya oleh orang yang tidak beriman kepadanya dan oleh orang yang mengikuti keinginannya, sehingga engkau menjadi lengah dan tidak siap menghadapinya. Ketahuilah, jika engkau dipalingkan, hal itulah yang menyebabkan engkau binasa. '."
  }
]