[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka sekali-kali jangan sampai kamu dipalingkan (wahai musa) dari beriman kepadanya dan mempersiapkan diri untuk menyongsongnya, oleh orang-orang yang tidak beriman terhadap terjadinya dan tidak beramal untuk menyongsongnya dan mengikuti hawa nafsunya, lalu dia mendustakannya sehingga menjadi binasa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Maka janganlah engkau dipalingkan -dari membenarkan adanya kiamat itu dan dari menyiapkan diri untuk menghadapinya dengan amal saleh- oleh orang-orang kafir yang tidak beriman kepadanya, dan oleh orang yang hanya mengikuti hawa nafsunya untuk mengamalkan hal-hal yang haram, nanti mereka akan menyebabkan engkau binasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَلَا يَصُدَّنَّكَ عَنْهَا (Maka sekali-kali janganlah kamu dipalingkan daripadanya) Yakni janganlah kamu dipalingkan dari keimanan kepada hari kiamat. مَن لَّا يُؤْمِنُ بِهَا(oleh orang yang tidak beriman kepadanya) Yakni orang-orang kafir. وَاتَّبَعَ هَوَىٰهُ (dan oleh orang yang mengikuti hawa nafsunya) Dengan tenggelam dalam perbuatan haram berupa kenikmatan yang fana. فَتَرْدَىٰ (yang menyebabkan kamu jadi binasa) Sehingga kamu akan binasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Maka janganlah sekali-kali kamu dipalingkan dari keimanan tentang kiamat oleh orang yang tidak mengimaninya dan mengikuti hawa nafsunya untuk mengingkarinya, wahai Musa. Maka kamu akan binasa jika berpaling dari hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah dipalingkan darinya} jangan sampai kamu dipalingkan untuk mengimaninya dan mempersiapkan diri untuk kedatangannya {oleh orang yang tidak beriman padanya dan mengikuti hawa nafsunya sehingga kamu binasa} sehingga kamu binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Maksudnya, jangan sampai orang itu berhasil menghalang-halangi dan menyibukkan dirimu dari keimanan kepada Hari Kiamat, pembalasan, dan beramal untuk persiapan menyongsongnya, yaitu orang kafir yang mengingkarinya, tidak meyakini bakal terjadi, dan berusaha agar tetap ragu dan menciptakan keragu-raguan (bagi orang lain), yang menyanggahnya atas dasar kebatilan, melontarkan syubahat-syubhat (kerancuan berpikir) yang bisa dia lakukan dalam keadaan memperturuti bisikan hawa nafsunya dalam usahanya itu. Niatnya bukan untuk sampai kepada titik kebenaran. Akan tetapi, sasarannya ialah mengikuti hawa nafsu. Maka jangan sekali-kali engkau mencondongkan pendengaranmu kepada orang yang kondisinya semacam ini, atau menerima sebagian dari perkataan-perkataan dan perbuatan-perbuatannya yang mencegah (manusia) dari keimanan kepada Hari Kiamat dan persiapan diri untuk menyongsongnnya. Allah memperingatkan dari orang model ini, karena termasuk perkara yang sangat mengkhawatirkan yang (bisa) terjadi pada seorang Mukmin adalah (tergoda) melalui bisikan dan tipuannya, juga (lantaran) jiwa tercipta dengan pembawaan karakter suka meniru-niru dan mengikuti orang-orang yang berasal dari kalangannya sendiri. Dalam keterangan ini, terdapat catatan penting dan isyarat untuk memperingatkan dari segala pihak yang menyeru kepada kebatilan, menghalang-halangi dari keimanan yang wajib atau dari kesempurnaan iman, atau melemparkan syubhat ke dalam hati, serta (mengandung peringatan dari) melihat buku-buku yang memuat muatan seperti itu. Di sini, Allah menyebutkan keimanan kepadaNya, ibadah kepadaNya dan beriman kepada Hari Akhir. Sebab, tiga hal ini merupakan prinsip-prinsip keimanan dan rukun agama. Jika sudah sempurna, maka agama menjadi sempurna. Kekurangan atau hilangnya keimanan itu disebabkan oleh kurangnya atau hilangnya sebagian darinya. Ayat ini senada dengan Firman Allah yang berhubungan dengan pemberitahuan tentang tolok ukur kebahagiaan dan kecelakaan golongan-golongan yang menerima kitab, (Al-Maidah:69). FirmanNya, “Yang menyebabkan kamu binasa,” maksudnya hancur dan celaka, jika kamu menapaki jalan orang-orang yang menghalang-halangi manusia darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 16: Di mana ia berusaha menyebarkan keragu-raguan tentang kedatangan kiamat dan membantahnya dengan kebatilan, menegakkan syubhat semampunya, mengikuti hawa nafsunya dan tidak ada niat untuk mencari yang hak, bahkan harapan paling sedikitnya adalah mengikuti hawa nafsunya. Oleh karena itu, berhati-hatilah terhadap orang yang seperti ini keadaannya atau jangan sampai menerima sedikit pun perkataan dan perbuatannya yang memalingkan dari beriman kepada kiamat. Allah memperingatkan terhadap orang seperti ini, karena ia termasuk yang perlu diwaspadai bisikannya, mengingat jiwa manusia yang suka ikut-ikutan. Dalam ayat ini terdapat peringatan dan isyarat agar waspada terhadap semua penyeru kepada kebatilan, yang menghalangi dari beriman yang wajib atau menghalangi kesempurnaannya atau menaruh syubhat di hatinya, dan dari melihat buku-buku yang berisi seperti itu. Jika engkau mengikuti jalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 16",
    "description": "Maka setelah engkau mengetahui keniscayaan kiamat, janganlah sekali-kali engkau dipalingkan dari-Nya oleh orang yang tidak beriman kepadanya dan oleh orang yang mengikuti keinginannya, sehingga engkau menjadi lengah dan tidak siap menghadapinya. Ketahuilah, jika engkau dipalingkan, hal itulah yang menyebabkan engkau binasa. '17. Allah menunjukkan kuasa-Nya dengan memberi mukjizat kepada nabi musa. Dan apakah yang ada di tangan kananmu, wahai musa'."
  }
]