[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "“Apakah yang ada di tangan kananmu itu, wahai Musa?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan apakah yang ada di tangan kananmu itu wahai Musa?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-21. “Hai Musa, apa yang kamu bawa dengan tangan kananmu itu?” Musa menjawab-Nya dengan panjang lebar agar dapat memperpanjang percakapannya dengan Tuhannya: “Ini adalah tongkat yang aku pakai untuk bertumpu ketika berjalan dan aku gunakan untuk merontokkan daun-daun pepohonan sebagai makanan kambingku, dan tongkat ini juga memiliki kegunanan-kegunaan lainnya.” Kemudian Allah memerintahkannya untuk melempar tongkat itu. Maka Musa melemparnya, dan tiba-tiba tongkat itu menjadi ular hidup yang bergerak dengan cepat. Allah berfirman untuk menenangkannya: “Ambillah ular itu dan jangan takut, Kami akan mengembalikannya menjadi tongkat seperti semula.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَمَا تِلْكَ بِيَمِينِكَ يٰمُوسَىٰ (Apakah itu yang di tangan kananmu, hai Musa?) Pertanyaan tentang tongkat ini untuk menarik perhatian Musa kepada tongkat tersebut, agar mukjizat keluar dari tongkat tersebut setelah Musa memperhatikan dengan seksama bahwa itu memang benar-benar tongkat yang biasanya. Kalau bukan untuk tujuan ini masa sebenarnya Musa telah mengetahui apa yang ada di tangannya tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Dan apakah yang kamu bawa di tangan kananmu itu, wahai Musa? Yaitu tongkat yang digunakan untuk memberi perhatian bahwa sesungguhnya mukjizatNya ada di dalamnya. Dan pengulangan {Ya Musa} adalah untuk menekankan suatu keakraban dan perhatian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apa yang ada di tangan kananmu itu, wahai Musa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Usai menjelaskan prinsip keimanan kepada Musa, Allah ingin memaparkan dan memperlihatkan kepadanya tanda-tanda kekuasaanNya yang akan menyebabkan hatinya tenang dan pandangannya sejuk dengannya, dan keimanan menjadi kokoh dengan dukungan dari Allah baginya di hadapan musuh. Lalu Allah berfirman, “Apakah itu yang ditangan kananmu hal Musa,” pertanyaan ini (disampaikan), kendatipun Allah sudah mengetahuinya. Namun, agar lebih menarik perhatian pada momentum ini, pembicaraan dimulai melalui cara pertanyaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 17: Setelah Allah Subhaanahu wa Ta'aala menerangkan kepada Musa ashlul iman (dasar keimanan), Dia ingin memperlihatkan sebagian di antara ayat-ayat-Nya untuk menenangkan hatinya dan menyejukkan pandangannya serta menguatkan imannya dengan pengokohan Allah baginya ketika berhadapan dengan musuhnya. Pertanyaan ini sesungguhnya sudah diketahui Allah, akan tetapi agar perhatian Musa semakin bertambah di saat itu, maka disampaikan dengan cara pertanyaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 17",
    "description": "Allah menunjukkan kuasa-Nya dengan memberi mukjizat kepada nabi musa. Dan apakah yang ada di tangan kananmu, wahai musa'18. Dia berkata, 'ini adalah tongkatku. Aku bertumpu padanya saat letih atau ingin bersandar, dan aku merontokkan daun dari ranting-ranting pohon dengannya untuk pakan kambingku atau menghalaunya pergi dan pulang kandang. Dan selain itu, bagiku masih ada lagi manfaat yang lain dari tongkat ini. '."
  }
]