[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa menjawab, “Ia adalah tongkatku, aku bertumpu padanya saat berjalan dan aku gunakan memukul pepohonan agar kambing-kambingku memakan dari daun-daunnya yang berjatuhan, dan ada manfaat-manfaat lain bagiku padanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Musa -'alaihissalām- menjawab, \"Ini adalah tongkatku, aku bertumpu padanya ketika berjalan, dengannya aku merontokkan dedaunan pohon agar menjadi makanan kambingku, dan bagiku tongkat ini masih memiliki manfaat lain selain yang aku sebutkan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أَتَوَكَّؤُا۟ عَلَيْهَا (aku bertopang padanya) Yakni aku menggunakannya untuk menopang diriku saat berjalan ketika aku sedang dalam keadaan lemah. وَأَهُشُّ بِهَا عَلَىٰ غَنَمِى(dan aku pukul (daun) dengannya untuk kambingku) Dan aku gunakan untuk menggugurkan dedaunan sebagai makanan kambingku. Pendapat lain mengatakan yang dimaksud adalah untuk menggiring kambingku. وَلِىَ فِيهَا مَـَٔارِبُ أُخْرَىٰ( dan bagiku ada lagi keperluan yang lain padanya) Dan kegunaan tongkat sangat banyak yang sudah tidak asing lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Musa lalu menjawab: “Ini adalah tongkatku. Aku bersandar kepadanya saat lelah dalam berjalan, Aku juga menggunakannya untuk memukul-mukul pohon supaya daun-daunnya gugur untuk kambingku, sehingga dia bisa memakannya dan banyak lagi manfaat dan keperluan lain dalam tongkat ini, seperti untuk membawa perbekalan, kantong air dan mengusir serangga”. Musa AS sangat menikmati perbincangannya dengan Tuhan, sehingga dia bisa menjawab pertanyaan tambahan yang diberikan. Dan kalam terindah di akhir perbincangaan itu yaitu bahwa Tuhannya bertanya tentang kegunaan tongkat itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Itu adalah tongkatku. Aku bersandar padanya} Aku bersandar padanya ketika berjalan {dan merontokkan (daun-daun) dengannya untuk kambingku} Aku memukul pepohonan menggunakan itu agar daun-daunnya jatuh untuk menggembala kambingku {dan memiliki keperluan} keperluan dan manfaat {lain padanya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Musa berkata, “INi adalah tongkatku, aku bertelekan kepadanya, dan aku pukul (daun) dengannya untuk kambingku.” Beliau menyebutkan dua kegunaannnya. Satu manfaat bagi manusia, yaitu beliau bersandar padanya saat berdiri dan berjalan. Padanya terdapat bantuan dan manfaat bagi binatang-binatang ternak. Yaitu, saat belliau sedang menggembalakan kambing, jika sedang menggembalakannya di pepohonan Khabath (yang berdaun rimbun) atau pohon lain yang serupa, beliau mengerak-gerakannya. Maksudnya, beliau memukuli pohon itu, supaya daun-daunnya rontok. Kambing pun memakannya. Ini perilaku yang baik dari Musa yang di antara pengaruhnya, adalah kecakapan dalam menggembalakan binatang ternak dan bersikap baik kepadanya yang menandakan inayah (perhatian) Allah, pengistimewaan dan pengkhususan baginya yang dituntut oleh rahmat Allah dan hikmahNya (padanya). “Dan bagiku ada lagi keperluan padanya,” maksudnya fungsi-fungsi “yang lain,” selain dua kegunaan ini. Di antara etika Nabi Musa, bahwa Allah ketika bertanya kepadanya tentang apa yang ada di tangan kanannya dengan pertanyaan yang mungkin mengarah kepada tangan itu sendiri atau manfaatnya, maka beliau menjawab dengan keterangan tentang tangan itu sendiri dan manfaatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 18: Seperti ketika berdiri dan ketika berjalan. Inilah akhlak mulia Nabi Musa ‘alaihis salam, di mana di antara pengaruhnya adalah bagusnya Beliau dalam mengembala kambing. Ihsan Beliau terhadapnya menunjukkan perhatian Allah, pilihan-Nya dan pengkhususan-Nya. Dalam kalimat ini terdapat dalil yang menunjukkan tingginya budi pekerti Nabi Musa ‘alaihis salam, yaitu ketika Allah bertanya tentang apa yang ada di tangan kanannya, sedangkan pertanyaan itu mengandung kemungkinan berkaitan dengan bendanya atau manfaatnya, maka Beliau menerangkan benda itu dan manfaatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 18",
    "description": "Dia berkata, 'ini adalah tongkatku. Aku bertumpu padanya saat letih atau ingin bersandar, dan aku merontokkan daun dari ranting-ranting pohon dengannya untuk pakan kambingku atau menghalaunya pergi dan pulang kandang. Dan selain itu, bagiku masih ada lagi manfaat yang lain dari tongkat ini. '19. Dia berfirman, 'lemparkanlah ia, yaitu tongkatmu itu, wahai musa!'."
  }
]