[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa melemparkannya di atas permukaan tanah, maka dengan kehendak Allah tiba-tiba menjelma menjadi seekor ular hidup yang bergerak cepat. Musa menyaksikan suatu kejadian yang sangat aneh itu dan membalikkan badan untuk lari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Lalu Musa pun melemparkannya. Tiba-tiba saja ia berubah menjadi seekor ular yang merayap dengan cepat dan ringan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. فَأَلْقَىٰهَا (Lalu dilemparkannyalah tongkat itu) Musa melemparkannya ke atas tanah. فَإِذَا هِىَ حَيَةٌ تَسْعَىٰ (maka tiba-tiba ia menjadi seekor ular yang merayap dengan cepat) Yakni merayap dengan lincah dan cepat. Ketika Musa melihatnya demikian ia takut dan berlari kebelakang tanpa menoleh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Lalu Musa melemparkan tongkatnya di atas bumi. Seketika tongkat itu berubah menjadi ular yang berjalan dengan cepat dan lincah dengan penggambaran yang baik. Lalu Musa takut dan lari darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu dia melemparkannya. Tiba-tiba tongkat itu menjadi seekor ular yang merayap dengan cepat} merayap dengan cepat dan lincah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19-20. Allah berfirman kepadanya, “Lemparkanlah ia, hai Musa!” lalu dia melemparkan tongkat itu, maka tiba-tiba ia menjadi seekor ular yang merayap dengan cepat,” berubah dengan izin Allah menjadi seekor ular yang besar, maka, Musa berpaling melarikan diri (darinya) dengan rasa takut, tanpa menoleh ke belakang lagi. Penyebutan sifat ia (ular itu) merayap cepat untuk menangkis prasangka yang mungkin muncul. Yakni, prasangka bahwa kejadian itu merupakan takhyil (penipuan mata saja) tidak ada kenyataannya. Jadi, sifatnya “merayap dengan cepat” dapat menepis prasangka itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 20: Kemudian Musa ‘alaihis salam lari karena takut dan tidak menoleh. Disebutkan sifat ular tersebut, yakni merayap dengan cepat untuk menghilangkan persangkaan yang mungkin timbul, yaitu bahwa ular itu hanya sebatas khayalan tidak ada hakikatnya, maka ketika disebutkan perkataan “merayap dengan cepat” hilanglah sangkaan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 20",
    "description": "Tanpa menunggu lama, selanjutnya nabi musa segera melemparkan tongkat itu ke tanah, maka tiba-tiba ia menjadi seekor ular yang merayap ke sana ke mari dengan cepat. 21. Melihat perubahan wujud tongkatnya menjadi ular, nabi musa merasa takut. Dia berfirman untuk menenangkan hati nabi musa, 'wahai musa, peganglah ia. Ambillah ular itu dan jangan takut. Kami akan mengembalikan wujud-Nya kepada keadaannya semula, dari ular menjadi tongkat kembali. '."
  }
]