[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Allah berfirman kepada Musa, “Ambillah ular itu dan jangan takut kepadanya. Kami akan mengembalikkan wujudnya menjadi tongkat lagi, sebagaimana keadannya semula. Dan kepitlah tanganmu ke arah sisi tubuhmu (ketiak) di bawah lengan atasmu, maka akan keluar menjadi berwarna putih seperti salju, bukan karena penyakit kusta, untuk menjadi tanda lain kebenaran kenabianmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Allah lalu berfirman kepada Musa -'alaihissalām-, \"Peganglah tongkat itu dan jangan takut karena telah berubah menjadi ular, sebab bila engkau memegangnya Kami, akan mengembalikannya kepada keadaannya yang semula."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. قَالَ (Allah berfirman) Allah berfirman. خُذْهَا وَلَا تَخَفْ ۖ سَنُعِيدُهَا سِيرَتَهَا الْأُولَىٰ (Peganglah ia dan jangan takut, Kami akan mengembalikannya kepada keadaannya semula) Yakni setelah kamu mengambilnya Kami akan mengembalikannya ke bentuk semula."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Allah berfirman kepadaNya: “Ambillah ular itu menggunakan tangan kananmu dan jangan takut dengannya, Kami akan mengembalikannya kepada bentuk semula, yaitu tongkat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berfirman,“Ambillah dan jangan takut. Kami akan mengembalikannya pada keadaannya} keadaannya dan kondisinya {semula"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Allah berkata kepada Musa, “Peganglah ia dan jangan takut,” tidak ada bahaya bagimu pada ular itu “Kami akan mengembalikannya kepada keadaannya semula,” yaitu bentuk dan sifat (aslinya). Sebab, sebelumnya adalah tongkat. Maka Musa menaati perintah Allah sebagai (cermin) keimanan dan penyerahan diri beliau kepadaNya. Lalu beliau mengambilnya. Tongkatnya kembali seperti semula yang ia kenal. Ini salah satu tanda kekuasaan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 21: Yakni tidak akan terjadi apa-apa denganmu. Maka Nabi Musa ‘alaihis salam mengikuti perintah Allah karena iman dan berserah diri kepada-Nya, Beliau pun memegangnya, maka tongkat itu pun kembali seperti sedia kala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 21",
    "description": "Melihat perubahan wujud tongkatnya menjadi ular, nabi musa merasa takut. Dia berfirman untuk menenangkan hati nabi musa, 'wahai musa, peganglah ia. Ambillah ular itu dan jangan takut. Kami akan mengembalikan wujud-Nya kepada keadaannya semula, dari ular menjadi tongkat kembali. '22. Allah juga memberi nabi musa mukjizat yang lain. Dia berfirman, 'dan kepitlah tangan kanan-Mu melalui leher bajumu ke ketiak kiri-Mu, kemudian tariklah keluar, niscaya ia keluar menjadi putih cemerlang dan bercahaya tanpa cacat, bagai sinar matahari yang benderang. Kami berikan itu kepadamu sebagai mukjizat yang lain, selain tongkat yang berubah menjadi ular."
  }
]