[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "21-22. Allah berfirman kepada Musa, “Ambillah ular itu dan jangan takut kepadanya. Kami akan mengembalikkan wujudnya menjadi tongkat lagi, sebagaimana keadannya semula. Dan kepitlah tanganmu ke arah sisi tubuhmu (ketiak) di bawah lengan atasmu, maka akan keluar menjadi berwarna putih seperti salju, bukan karena penyakit kusta, untuk menjadi tanda lain kebenaran kenabianmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan kepitlah tanganmu ke ketiakmu niscaya ia akan keluar dalam keadaan putih bercahaya bukan karena cacat kulit, tetapi sebagai mukjizat yang kedua."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-24. Dan dekatkanlah tanganmu ke bawah lenganmu kemudian keluarkanlah, maka tanganmu akan menjadi putih bersinar bukan karena penyakit, agar ini menjadi bukti lain atas kebenaranmu. Mukjizat-mukjizat ini merupakan permulaan bagi pengutusan Musa kepada Fir’aun; Allah memerintahkannya untuk mendakwahi Fir’aun: “Pergilah dengan mukjizat-mukjizat ini sebagai utusan kepada Fir’aun, karena dia telah berlaku angguh dan semena-mena hingga dia mengaku sebagai Tuhan. Serulah dia agar mengesakan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَاضْمُمْ يَدَكَ إِلَىٰ جَنَاحِكَ (dan kepitkanlah tanganmu ke ketiakmu) Yakni bagian tubuh yang ada di balik lengan. تَخْرُجْ بَيْضَآءَ(niscaya ia ke luar menjadi putih cemerlang) Padahal kulit Musa berwarna kecoklatan. مِنْ غَيْرِ سُوٓءٍ(tanpa cacat) Yakni bukan karena aib, yakni sebagai kiasan dari penyakit kusta. ءَايَةً أُخْرَىٰ (sebagai mukjizat yang lain) Yakni mukjizat selain tongkat itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Dan masukkanlah telapak tangan kananmu ke sela-sela ketiak kiri yang ada di bawah lenganmu, lalu keluarkanlah. Lalu telapak tangan itu mengeluarkan sesuatu lain dari warna coklat yang bersinar terang seperti cahaya matahari tanpa memberikan suatu penyakit, seperti penyakit penglihatan, sebagai mukjizat lain selain tongkat untuk meneguhkan kebenaran risalahmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jepitlah tanganmu ke ketiakmu} celah di bawah lenganmu {niscaya itu akan keluar dalam keadaan putih tanpa cacat} berpenyakit {sebagai mukjizat yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Kemudian Allah menyebutkan tanda kekuasaanNya yang lain. Allah berfirman, “Dan kempitkanlah tanganmu ke ketiakmu,” maksudnya masukkanlah tanganmu ke ketiakmu. Dan kempitkanlah tanganmu yang merupakan sisi (sayap) pada manusia, “niscaya ia keluar menjadi putih cemerlang tanpa cacat,,” yaitu berwarna putih mengkilap tanpa cacat maupun sopak “sebagai mukjizat lain.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 22: Yakni masukkanlah telapak tanganmu yang kanan ke dalam leher bajumu lalu kepitlah. Dalam ayat lain Allah Ta’ala berfrman, “Maka yang demikian itu adalah dua mukjizat dari Tuhanmu (yang akan kamu hadapkan kepada Fir'aun dan pembesar-pembesarnya). Sesungguhnya mereka adalah orang-orang yang fasik\". (Terj. Al Qashas: 32)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 22",
    "description": "Allah juga memberi nabi musa mukjizat yang lain. Dia berfirman, 'dan kepitlah tangan kanan-Mu melalui leher bajumu ke ketiak kiri-Mu, kemudian tariklah keluar, niscaya ia keluar menjadi putih cemerlang dan bercahaya tanpa cacat, bagai sinar matahari yang benderang. Kami berikan itu kepadamu sebagai mukjizat yang lain, selain tongkat yang berubah menjadi ular. 23. Wahai nabi musa, kedua mukjizat kami anugerahkan untuk kami perlihatkan kepadamu sebagian dari tanda-tanda kebesaran kami yang sangat besar. Kami juga menjadikan keduanya sebagai penguat hatimu dalam berdakwah. '."
  }
]