[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami lakukan itu, supaya Kami dapat memperlihatkan kepadamu (wahai Musa) sebagian dari bukti-bukti besar yang menunjukkan Kuasa Kami, dan kebesaran kekuasaan Kami serta kebenaran risalahmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kami telah memperlihatkan padamu dua mukjizat ini -wahai Musa- agar Kami tunjukkan padamu sebagian dari tanda-tanda kebesaran Kami yang sangat besar, yang menunjukkan besarnya kekuasaan Kami, dan bahwasanya engkau adalah seorang Rasul yang diutus dari sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. لِنُرِيَكَ مِنْ ءَايٰتِنَا الْكُبْرَى (untuk Kami perlihatkan kepadamu sebahagian dari tanda-tanda kekuasaan Kami yang sangat besar) Yakni agar Kami memperlihatkan dengan dua mukjizat ini sebagian bukti dari kekuasaan Kami dalam melakukan segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sungguh Kami akan menunjukkan kepadamu betapa menakjubkannya dua dari sekian banyaknya ayat-ayat agung Kami yang menunjukkan kepada kekuasaan Kami atas risalahmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar Kami memperlihatkan kepadamu sebagian tanda-tanda kebesaran Kami yang terbesar} yang paling agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Allah berfirman, \"maka yang demikian itu adalah dua mukjizat dari Tuhanmu (yang akan kamu hadapkan kepada Firaun dan pembesar-pembesarnya). Sesungguhnya mereka adalah orang-orang yang fasik\". (Al-Qashash:32), “Untuk Kami perlihatkan kepadamu sebagian dari tanda-tanda kekuasaan Kami yang sangat besar,” maksudnya Kami melakukan apa yang telah Kami sebutkan, berupa perubahan tongkat menjelma seekor ular yang merayap cepat, keluarnya tangan berwarna putih pada pandangan orang-orang yang melihatnya, bertujuan agar Kami memperlihatkan tanda-tanda kekuasaan Kami yang besar yang menunjukkan kebenaran risalahmu dan hakikat ajaran yang engkau bawa. Sehingga kalbumu menjadi tenang, ilmumu bertambah dan engkau percaya kepada janji Allah kepadamu berupa pemeliharaan dan pertolongan. Dan supaya menjadi hujjah dan bukti bagi kaum yang mana engkau diutus kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 23: Yakni Kami lakukan semua itu, seperti berubahnya tongkat menjadi ular dan keluarnya cahaya putih dari tanganmu adalah untuk memperlihatkan kepadamu sebagian di antara tanda-tanda kekuasaan Kami yang menunjukkan kebenaran risalahmu dan kebenaran yang engkau bawa sehingga hatimu tenang dan pengetahuanmu bertambah, dan kamu pun semakin percaya kepada pertolongan Allah dan penjagaan-Nya, demikian pula sebagai hujjah dan bukti terhadap orang-orang yang akan engkau datangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 23",
    "description": "Wahai nabi musa, kedua mukjizat kami anugerahkan untuk kami perlihatkan kepadamu sebagian dari tanda-tanda kebesaran kami yang sangat besar. Kami juga menjadikan keduanya sebagai penguat hatimu dalam berdakwah. '24. Usai membekali nabi musa dengan dua mukjizat, Allah memerintahnya untuk berdakwah. Wahai nabi musa, pergilah kepada fir'aun. Sesungguhnya dia benar-benar telah melampaui batas dalam kedurhakaannya kepada-ku dan kesewenangan terhadap sesama manusia. '."
  }
]