[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pergilah engkau (wahai Musa) kepada Fir’aun, sesungguhnya dia telah berbuat melampaui batas kewajaran sebagai manusia dan membangkang terhadap Tuhannya. Maka serulah dia untuk mentauhidkan Allah dan beribadah kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka pergilah engkau -wahai Musa- kepada Fir'aun, sesungguhnya dia benar-benar telah melampaui batas dalam kekafiran dan kedurhakaan terhadap Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. اذْهَبْ إِلَىٰ فِرْعَوْنَ إِنَّهُۥ طَغَىٰ (Pergilah kepada Fir’aun; sesungguhnya ia telah melampaui batas) Yakni kafir dan melampaui batas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Pergilah kepada Fir’aun sebagai seorang rasul, wahai Musa! Sesungguhnya dia itu telah melampaui batas kekufuran, keangkuhan dan kesombongan sampai menganggap diri sebagai Tuhan. Ajaklah dia untuk mengesakan dan menaati Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pergilah kepada Fir‘aun. Sesungguhnya dia telah melampaui batas”} melampaui batas dalam berbuaat kemaksiatan dan kedurhakaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Setelah mengirimkan wahyu kepada Musa dan menetapkan kenabiannya serta memperlihatkan kepadanya tanda-tanda kekkuasaanNya yang mencengangkan pandangan, Allah mengutusnya ke Firaun, raja Mesir. Allah berfirman, “Pergilah kepada Fir’aun; sesungguhnya dia telah melampaui batas,” maksudnya keras kepala dan melampaui batas dalam kekufuran, kemaksiatan, dan kecongkakan di bumi serta tindakan kkediktatoran terhadap kaum yang lemah. Bahkan sampai mengklaim sifat rububiyah dan uluhiyah. Semoga Allah memburukkan kondisinya. Artinya, tindakannya yang melampaui batas menjadi penyebab kebinasaannya. Akan tetapi, termasuk (cermin) rahmat Allah, hikmah, dan keadilanNya, Dia tidak menyiksa siapapun kecuali setelah tegaknya hujjah kepada mereka melalui pengiriman para rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 24: Dalam kekafiran, membuat kerusakan dan dalam kesombongan serta dalam menindas kaum lemah. Melampaui batas dalam kekafiran adalah sikapnya sampai mengaku sebagai tuhan. Sikap melampaui batas inilah yang menyebabkan Fir’aun binasa, akan tetapi termasuk rahmat Allah, kebijaksanaan dan keadilan-Nya adalah Dia tidak mengazab seorang pun kecuali setelah hujjah tegak dengan dikirimkan rasul. Ketika itu, Musa ‘alaihis salam mengetahui bahwa tugasnya itu sungguh berat karena diutus kepada orang yang angkuh dan sombong ini, di mana tidak ada seorang pun di Mesir yang berani menentangnya, sedangkan Musa ‘alaihis salam hanya seorang diri dan dahulu Beliau telah melakukan perbuatan yang telah dilakukannya, yaitu membunuh tanpa sengaja, di mana hal ini menambah berat lagi bebannya, maka Nabi Musa ‘alaihis salam mengikuti perintah Allah dan menerimanya dengan dada yang lapang, Beliau pun meminta kepada Allah pertolongan-Nya serta agar dimudahkan semua sebab yang menjadi sempurnanya dakwah sebagaimana disebutkan permintaannya di ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 24",
    "description": "Usai membekali nabi musa dengan dua mukjizat, Allah memerintahnya untuk berdakwah. Wahai nabi musa, pergilah kepada fir'aun. Sesungguhnya dia benar-benar telah melampaui batas dalam kedurhakaannya kepada-ku dan kesewenangan terhadap sesama manusia. '25-28. Nabi musa menyadari betapa berat tugas yang Allah amanahkan kepadanya. Dia memohon kepada-Nya seraya berkata, 'ya tuhanku, lapangkanlah dadaku sehingga jiwaku mampu menanggung tantangan tugasku, dan mudahkanlah untukku urusanku sehingga dakwahku tidak menemui kesulitan, dan lepaskanlah kekakuan dari lidahku yang menghalangi kelancaranku dalam menyampaikan pesan-Mu agar mereka mengerti perkataanku dengan baik. '."
  }
]