[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-35. Musa berkata, “Wahai Tuhanku, luaskanlah untukku dadaku, permudahlah bagiku urusanku, Lepaskanlah kekeluan pada lidahku dengan tutur kata yang lancar, Agar mereka memahami perkataanku, Dan adakanlah penolong bagiku dari keluargaku, Yaitu Harun saudaraku, Kuatkanlah aku dengannya dan teguhkanlah kekuatanku dengannya, Dan jadikanlah dia partner bersamaku dalam kenabian dan penyampaian risalah (Mu), Agar kami bisa menyucikanMu dengan bertasbih banyak-banyak, Dan kami banyak mengingatMu, dan kemudian kami memujiMu. Sesungguhnya Engkau Maha Melihat kami, tidak ada sesuatu pun yang tersembunyi bagiMu dari perbuatan-perbuatan kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Musa -'alaihissalām- berkata, \"Wahai Tuhanku, lapangkanlah dadaku agar aku bersabar dalam mendapatkan berbagai rintangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-36. Musa mentaati perintah Allah itu dan memohon pertolongan kepada-Nya: “Ya Tuhanku, lapangkanlah dadaku, lancarkanlah urusan yang Engkau perintahkan kepadaku, fasihkanlah lisanku agar orang-orang memahami perkataanku, dan jadikanlah dari keluargaku orang yang dapat membantuku yaitu Harun, kuatkanlah aku dengannya dan jadikanlah dia nabi untuk menyampaikan risalah bersamaku agar kami dapat banyak bertasbih dan berzikir kepada-Mu. Sungguh Engkau Maha Melihat keadaan kami.” Maka Allah mengabulkan permintaannya: “Hai Musa, Aku telah mengabulkan seluruh permintaanmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. قَالَ رَبِّ اشْرَحْ لِى صَدْرِى (Berkata Musa: “Ya Tuhanku, lapangkanlah untukku dadaku) Allah melapangkan dadanya agar mampu bersabar dari kejahatan orang lain yang ditujukan kepadanya dan mampu memikul risalah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "25-33 1 ). Seorang pendakwah sangat membutuhkan dalam dirinya kelapangan hati, agar memudahkan baginya menyampaikan risalah, agar ia terlihat lebih bahagia dihadapan siapapn yang mendengarkan dakwahnya, sehingga ruh-ruh islam dapat sampai dengan baik kepada ummat, maka akan terwujud kebhagiaan dalam dirisetiap manusia, yang merupakan tujuan utama dari dakwah itu, namun jika seorang pendakwah berhati gelisah dan terasa sempit, juga kesabarannya berkurang, maka dapat dipungkiri bahwa tugasnya yang besar ini akan terbengkalai. 2 ). Salah satu Impian baik seseorang dalam doanya : { وَيَسِّرْ لِىٓ أَمْرِى } \"Dan mudahkanlah untukku urusanku\" jadilah kalian orang yang ambisius dalam berdoa, sebagaimana Musa yang tidak hanya meminta kemudahan dalam dakwahnya kepada Fir'aun, melainka ia juga meminta untuk kebaikan dan kemudahan dalam hidupnya sendiri. 3 ). { وَٱحْلُلْ عُقْدَةً مِّن لِّسَانِى , يَفْقَهُوا۟ قَوْلِى } \"Dan lepaskanlah kekakuan dari lidahku , Supaya mereka mengerti perkataanku\" dua ayat ini mengajarkan kita bahwa baik dan fasihnya lisan seorang pendakwah dalam berbicara membantu pendengar untuk memahami pembicaraan sang pendakwah. 4 ). Meminta pertolongan kepada oran-orang terdekat dari tali keluarga, atau persaudaraan dalam pendidikan, atau bahkan kepada sahabat sendiri menjadikan pertolongan itu lebih sempurna, karena adanya kesamaan dalam sosial, dan dengan itu pula permasalahan akan lebih muda terselesaikan, sebagaimana dalam firman Allah : { وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي , هَٰرُونَ أَخِى , وَأَشْرِكْهُ فِىٓ أَمْرِى } \"Dan jadikanlah untukku seorang pembantu dari keluargaku , (yaitu) Harun, saudaraku , Teguhkanlah dengan dia kekuatanku , Dan jadikankanlah dia sekutu dalam urusanku\" 5 ). Pada firman Allah : { قَالَ رَبِّ ٱشْرَحْ لِى صَدْرِى } sampai pada ayat { كي نسبحك كثيرا } adalah merupakan adab dalam berdoa, yaitu tujuan yang istimewa dan mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Musa berkata: “Wahai Tuhanku, lapangkanlah dadaku agar bisa menanggung beban risalah, dan bersabar atas kesukaran dalam menanggungnya dan atas fitnah manusia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa bekata {“Wahai Tuhanku lapangkanlah} lapangkanlah {dadaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Saat itulah Musa mengetahui bahwa dia telah mengemban beban yang sangat berat sekali, diutus ke penguasa yang bertangan besi lagi keras kepala ini, yang tidak mempunyai tandingan di Mesir. Sementara Musa hanya seorang diri saja, dan pernah menjadi penyebab kematian (seseorang di sana). Kemudian beliau menyambut perintah Rabbnya dan menerimanya dengan hati terbuka dan tulus. Beliau memohon pertolongan kepadaNya dan kemudahan sebab kausalitas yang menjadi kesempurnaan dakwahnya. Beliau berkata, “Ya Rabbku, lapangkanlah untukku dadaku,” maksudnya luaskan dan lapangkanlah dadaku untuk menanggung beban perkataan dan tindakan yang tidak baik dan hatiku tidak menjadi kacau karenanya serta tidak merasa sempit. Sesungguhnya hati bila telah menyempit, niscaya pemiliknya tidak pantas mengemban misi memberi petunjuk dan mendakwahi manusia. Allah berfirman kepada NabiNya Muhammaad, \"Maka disebabkan rahmat dari Allah-lah kamu berlaku lemah-lembut terhadap mereka. Sekiranya kamu bersikap keras lagi berhati kasar, tentulah mereka menjauhkan diri dari sekelilingmu. Karena itu maafkanlah mereka, mohonkanlah ampun bagi mereka, dan bermusyawarahlah dengan mereka dalam urusan itu. Kemudian apabila kamu telah membulatkan tekad, maka bertawakallah kepada Allah. Sesungguhnya Allah menyukai orang-orang yang bertawakal kepada-Nya\" (Ali Imran: 159). Semoga manusia menerima kebenaran melalui kelembutan sikap dan kelapangan dada serta keterbukaannya bersama mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 25: Agar Beliau siap menerima gangguan baik berupa ucapan maupun perbuatan dan agar dadanya tidak sempit, karena jika dada sempit, maka ia tidak bisa menujuki manusia dan mendakwahkan mereka. Manusia biasanya akan menerima dakwah ketika hati da’i lunak dan dadanya lapang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 25",
    "description": "25-28. Nabi musa menyadari betapa berat tugas yang Allah amanahkan kepadanya. Dia memohon kepada-Nya seraya berkata, 'ya tuhanku, lapangkanlah dadaku sehingga jiwaku mampu menanggung tantangan tugasku, dan mudahkanlah untukku urusanku sehingga dakwahku tidak menemui kesulitan, dan lepaskanlah kekakuan dari lidahku yang menghalangi kelancaranku dalam menyampaikan pesan-Mu agar mereka mengerti perkataanku dengan baik. '25-28"
  }
]