[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-35. Musa berkata, “Wahai Tuhanku, luaskanlah untukku dadaku, permudahlah bagiku urusanku, Lepaskanlah kekeluan pada lidahku dengan tutur kata yang lancar, Agar mereka memahami perkataanku, Dan adakanlah penolong bagiku dari keluargaku, Yaitu Harun saudaraku, Kuatkanlah aku dengannya dan teguhkanlah kekuatanku dengannya, Dan jadikanlah dia partner bersamaku dalam kenabian dan penyampaian risalah (Mu), Agar kami bisa menyucikanMu dengan bertasbih banyak-banyak, Dan kami banyak mengingatMu, dan kemudian kami memujiMu. Sesungguhnya Engkau Maha Melihat kami, tidak ada sesuatu pun yang tersembunyi bagiMu dari perbuatan-perbuatan kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dan mudahkanlah untukku urusanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Dan mudahkanlah aku dalam apa yang Engaku perintahkan kepadaku berupa penyampaian risalah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mudahkanlah} mudahkanlah {untukku urusanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Dan mudahkanlah untukku urusanku,” maksudnya, mudahkanlah bagiku segala urusan yang aku kerjakan dan setiap cara yang aku tempuh dalam misiku. Dan ringankanlah kesulitan-kesulitan yang ada di hadapanku. Di antara bentuk kemudahan dari Allah adalah Dia memudahkan bagi seorang da’I untuk mengerjakan segala sesuatu sesuai dengan caranya yang benar, mengajak mendakwahi mereka dengan cara yang paling efektif mengantarkan pada sikap menerima perkataannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 26: Yakni mudahkanlah semua urusan yang aku lakukan dan semua jalan yang aku tempuh di jalan-Mu, serta mudahkanlah semua kesulitan di hadapanku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 26",
    "description": "25-28. Nabi musa menyadari betapa berat tugas yang Allah amanahkan kepadanya. Dia memohon kepada-Nya seraya berkata, 'ya tuhanku, lapangkanlah dadaku sehingga jiwaku mampu menanggung tantangan tugasku, dan mudahkanlah untukku urusanku sehingga dakwahku tidak menemui kesulitan, dan lepaskanlah kekakuan dari lidahku yang menghalangi kelancaranku dalam menyampaikan pesan-Mu agar mereka mengerti perkataanku dengan baik. '25-28"
  }
]