[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, Kami menurunkannya sebagai nasihat (pelajaran) agar dapat mengambil pelajaran dengannya orang-orang yang takut kepada siksaan Allah, lalu dia menghindarinya dengan menjalankan kewajiban-kewajiban dan menjauhi apa-apa yang diharamkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Kami tidaklah menurunkannya melainkan sebagai peringatan bagi orang yang diberikan petunjuk oleh Allah agar merasa takut kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِلَّا تَذْكِرَةً لِّمَن يَخْشَىٰ (tetapi sebagai peringatan bagi orang yang takut (kepada Allah)) Yakni al-Qur’an yang Kami turunkan kepadamu adalah sebagai peringatan bagi orang yang diberi taufik oleh Allah untuk takut kepada-Nya, dan kamu tidak diperintahkan untuk memaksa mereka agar beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Kami tidak menurunkannya kecuali sebagai pengingat dan pelajaran bagi orang yang takut kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kecuali sebagai peringatan} melainkan Kami menurunkannya sebagai pelajaran dan pengingat {bagi orang yang takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. OLeh karenanya, Allah berfirman, “Tetapi sebagai peringatan bagi orang yang takut (kepada Allah),” melainkan supaya orang-orang yang takut kepada Allah mengingat-ingat (hakikat kehidupan) sedangkan dia pun mengerti kandungannya berupa himbauan untuk menggapai kebaikan-kebaikan lalu mengamalkannya, dan mengetahui peringatan dari kecelakaan dan kerugian sehingga dia pun menjauhkan diri darinya. Dengan al-Quran dia bisa mengenal hukum-hukum yang baik, yang ditetapkan oleh syariat secara detail yang sisi keindahannya sudah mapan di akalnya secara global. Maka, penjabaran hukum—hukum sejalan dengan apa yang dijumpainya dalam fitrah dan akal sehatnya. Oleh sebab itu, Allah menamakan al-Quran sebagai tadzkirah (pengingat). Sebagai pengingat sesuatu yang sudah ada sebelumnya. Hanya saja pemiliknya melalaikannya, atau tidak mengingat-ingat penjelasannya. Allah mengkhususkan peringatan ini bagi orang-orang yang takut (khasyyah) kepadaNya, pasalnya selain mereka tidak mau memanfaatkannya. Bagaimana mungkin orang yang tidak beriman kepada surga dan neraka, serta tidak ada unsur ketakutan kepada Allah di hatinya sekecil biji sawi pun dapat memperoleh manfaat dengannya?! Ini tidak mungkin terjadi. \"orang yang takut (kepada Allah) akan mendapat pelajaran, orang-orang yang celaka (kafir) akan menjauhinya. (Yaitu) orang yang akan memasuki api yang besar (neraka).\" (Al-A’la:10-12)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 3: Yakni agar orang yang takut kepada Allah ingat dan sadar, di mana dengan mengingat targhib (dorongan) yang disebutkan di dalamnya ia dapat mencapai harapan yang utama, dan dengan mengingat tarhib (ancaman kerugian dan kesengsaraan) ia dapat menjauhinya, dan ia pun ingat hukum-hukum syar’i secara rinci yang sebelumnya tergambar secara garis besar di akalnya, lalu sesuailah hukum-hukum yang disebutkan secara rinci itu dengan apa yang diperolehnya dalam fitrah dan akalnya. Oleh karena itu, Allah menamai Al Qur’an dengan tadzkirah (pengingat), di mana ia merupakan pengingat hal yang telah ada, hanyasaja kebanyakan manusia lalai darinya. Namun pengingat ini dikhususkan bagi orang-orang yang takut kepada Allah, karena selain mereka tidak dapat mengambil manfaat darinya, dan bagaimana mungkin orang yang tidak beriman kepada surga dan neraka dapat mengambil manfaat darinya, demikian pula orang yang di hatinya tidak ada rasa takut kepada Allah?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 3",
    "description": "Kami tidak menurunkan Al-Qur'an kepadamu melainkan sebagai peringatan bagi orang yang takut kepada Allah dan ikhlas menaati ajaran dan perintah-Nya. 4. Wahai nabi, Al-Qur'an ini diturunkan kepadamu dari Allah yang mahaagung yang menciptakan bumi dan langit yang tinggi. Kandungannya merupakan petunjuk bagi mereka yang mau meyakini."
  }
]