[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-35. Musa berkata, “Wahai Tuhanku, luaskanlah untukku dadaku, permudahlah bagiku urusanku, Lepaskanlah kekeluan pada lidahku dengan tutur kata yang lancar, Agar mereka memahami perkataanku, Dan adakanlah penolong bagiku dari keluargaku, Yaitu Harun saudaraku, Kuatkanlah aku dengannya dan teguhkanlah kekuatanku dengannya, Dan jadikanlah dia partner bersamaku dalam kenabian dan penyampaian risalah (Mu), Agar kami bisa menyucikanMu dengan bertasbih banyak-banyak, Dan kami banyak mengingatMu, dan kemudian kami memujiMu. Sesungguhnya Engkau Maha Melihat kami, tidak ada sesuatu pun yang tersembunyi bagiMu dari perbuatan-perbuatan kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan jadikanlah dia sebagai mitraku dalam mengemban risalah ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَأَشْرِكْهُ فِىٓ أَمْرِى (dan jadikankanlah dia sekutu dalam urusanku) Yakni dan jadikanlah dia bersamaku dalam memikul risalah. Nabi Musa merekomendasikan Harun agar menjadi seorang nabi sepertinya agar dapat membantunya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "25-33 1 ). Seorang pendakwah sangat membutuhkan dalam dirinya kelapangan hati, agar memudahkan baginya menyampaikan risalah, agar ia terlihat lebih bahagia dihadapan siapapn yang mendengarkan dakwahnya, sehingga ruh-ruh islam dapat sampai dengan baik kepada ummat, maka akan terwujud kebhagiaan dalam dirisetiap manusia, yang merupakan tujuan utama dari dakwah itu, namun jika seorang pendakwah berhati gelisah dan terasa sempit, juga kesabarannya berkurang, maka dapat dipungkiri bahwa tugasnya yang besar ini akan terbengkalai. 2 ). Salah satu Impian baik seseorang dalam doanya : { وَيَسِّرْ لِىٓ أَمْرِى } \"Dan mudahkanlah untukku urusanku\" jadilah kalian orang yang ambisius dalam berdoa, sebagaimana Musa yang tidak hanya meminta kemudahan dalam dakwahnya kepada Fir'aun, melainka ia juga meminta untuk kebaikan dan kemudahan dalam hidupnya sendiri. 3 ). { وَٱحْلُلْ عُقْدَةً مِّن لِّسَانِى , يَفْقَهُوا۟ قَوْلِى } \"Dan lepaskanlah kekakuan dari lidahku , Supaya mereka mengerti perkataanku\" dua ayat ini mengajarkan kita bahwa baik dan fasihnya lisan seorang pendakwah dalam berbicara membantu pendengar untuk memahami pembicaraan sang pendakwah. 4 ). Meminta pertolongan kepada oran-orang terdekat dari tali keluarga, atau persaudaraan dalam pendidikan, atau bahkan kepada sahabat sendiri menjadikan pertolongan itu lebih sempurna, karena adanya kesamaan dalam sosial, dan dengan itu pula permasalahan akan lebih muda terselesaikan, sebagaimana dalam firman Allah : { وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي , هَٰرُونَ أَخِى , وَأَشْرِكْهُ فِىٓ أَمْرِى } \"Dan jadikanlah untukku seorang pembantu dari keluargaku , (yaitu) Harun, saudaraku , Teguhkanlah dengan dia kekuatanku , Dan jadikankanlah dia sekutu dalam urusanku\" 5 ). Pada firman Allah : { قَالَ رَبِّ ٱشْرَحْ لِى صَدْرِى } sampai pada ayat { كي نسبحك كثيرا } adalah merupakan adab dalam berdoa, yaitu tujuan yang istimewa dan mulia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dan jadikanlah dia sekutu bagiku dalam urusan risalah. Musa memohon dan meminta supaya Harun dijadikan Nabi seperti dia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan sertakan dia dalam urusanku} dan jadikanlah dia rekanku dalam urusan kenabian dan menyampaikan risalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31-32. “Teguhkanlah dengannya kekuatanku,” maksudnya kuatkanlah aku dengannya dan kokohkan punggungku dengannya, Allah berfirman, \"Kami akan membantumu dengan saudaramu, dan Kami berikan kepadamu berdua kekuasaan yang besar,\" (Al-Qashash:35), “dan jadikanlah dia sekutu dalam urusanku,” maksudnya dalam kenabian, dengan cara Engkau mengangkatnya sebagai nabi lagi rasul, sebagaimana Engkau telah menjadikanku demikian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 32: Yakni sebagai rasul pula di samping Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 32",
    "description": "29-32. Sesudah memohon penyempurnaan dirinya, nabi musa memohon pengukuhan diri melalui keluarganya. Dia berkata, 'wahai tuhanku, dan jadikanlah untukku seorang pembantu dari keluargaku guna meringankan tugasku menyampaikan risalah-Mu. Aku berharap engkau mengangkat harun, saudaraku, sebagai penyokongku. Teguhkanlah kekuatanku dalam berdakwah dengan adanya dia di sampingku, dan jadikanlah dia teman dalam urusanku menyampaikan risalah kepada fir'aun dan kaumnya. 33-35. Ya Allah, aku ajukan permohonan itu kepada-Mu agar kami banyak bertasbih kepada-Mu, menyucikan-Mu dari segala hal yang tidak layak bagi-Mu, dan banyak mengingat-Mu atas anugerah dan nikmat yang engkau limpahkan kepada kami. Sesungguhnya engkau maha melihat dan mengetahui keadaan kami. '."
  }
]