[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-35. Musa berkata, “Wahai Tuhanku, luaskanlah untukku dadaku, permudahlah bagiku urusanku, Lepaskanlah kekeluan pada lidahku dengan tutur kata yang lancar, Agar mereka memahami perkataanku, Dan adakanlah penolong bagiku dari keluargaku, Yaitu Harun saudaraku, Kuatkanlah aku dengannya dan teguhkanlah kekuatanku dengannya, Dan jadikanlah dia partner bersamaku dalam kenabian dan penyampaian risalah (Mu), Agar kami bisa menyucikanMu dengan bertasbih banyak-banyak, Dan kami banyak mengingatMu, dan kemudian kami memujiMu. Sesungguhnya Engkau Maha Melihat kami, tidak ada sesuatu pun yang tersembunyi bagiMu dari perbuatan-perbuatan kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Agar kami bertasbih memuji-Mu dengan sebanyak-banyaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33-34. Supaya kami bisa selalu mensucikanMu atau shalat kepadaMu secara bersamaan dan supaya kami bisa memperbanyak dzikir kepadaMu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar kami banyak bertasbih kepadaMu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. Kemudian Allah menyampaikan faidah berkaitan dengan itu. Allah berfirman, “Supaya kami banyak bertasbih kepadaMu, dan banyak mengingatMu.” Beliau mengetahui bahwa intisari dari semua ibadah dan agama adalah untuk dzikrullah (mengingat Allah). Beliau meminta Allah untuk menjadikan saudaranya bersama beliau, agar dapat saling bekerja sama dan menolong dalam kebaikan dan ketakwaan. Hasilnya, akan semakin banyak lantunan dzikrullah dari mereka berdua, berupa tasbih, tahlil, dan ibadah-ibadah lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 33",
    "description": "33-35. Ya Allah, aku ajukan permohonan itu kepada-Mu agar kami banyak bertasbih kepada-Mu, menyucikan-Mu dari segala hal yang tidak layak bagi-Mu, dan banyak mengingat-Mu atas anugerah dan nikmat yang engkau limpahkan kepada kami. Sesungguhnya engkau maha melihat dan mengetahui keadaan kami. '33-35"
  }
]