[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-35. Musa berkata, “Wahai Tuhanku, luaskanlah untukku dadaku, permudahlah bagiku urusanku, Lepaskanlah kekeluan pada lidahku dengan tutur kata yang lancar, Agar mereka memahami perkataanku, Dan adakanlah penolong bagiku dari keluargaku, Yaitu Harun saudaraku, Kuatkanlah aku dengannya dan teguhkanlah kekuatanku dengannya, Dan jadikanlah dia partner bersamaku dalam kenabian dan penyampaian risalah (Mu), Agar kami bisa menyucikanMu dengan bertasbih banyak-banyak, Dan kami banyak mengingatMu, dan kemudian kami memujiMu. Sesungguhnya Engkau Maha Melihat kami, tidak ada sesuatu pun yang tersembunyi bagiMu dari perbuatan-perbuatan kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Sesungguhnya Engkau Maha Melihat keadaan kami, tidak ada satu pun urusan kami yang tersembunyi dari-Mu.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Sesungguhnya Engkau Maha Mengetahui keadaan Kami dan Kami menginginkan ridhaMu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Engkau Maha Melihat kami”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “Sesungguhnya Engkau adalah Maha Melihat (keadaan) kami.” Engkau mengetahui keadaan, kelemahan, dan ketidakberdayaan kami, serta kebutuhan kami pada (pertolongan) Mu dalam setiap urusan. Engkau lebih memahami dan lebih mengasihi kami daripada diri kami sendiri. Maka, curahkanlah kepada kami karunia yang kami panjatkan kepadaMu dan kabulkanlah untuk kami segala sesuatu yang kami panjatkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 35: Yakni sesungguhnya Engkau mengetahui keadaan kami, kelemahan kami, dan rasa butuhnya kami kepada Engkau dalam semua urusan, dan Engkau lebih mengetahui keadaan kami dan lebih sayang kepada kami daripada diri kami sendiri, oleh karena itu karuniakanlah kepada kami permintaan kami dan kabulkanlah doa kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 35",
    "description": "33-35. Ya Allah, aku ajukan permohonan itu kepada-Mu agar kami banyak bertasbih kepada-Mu, menyucikan-Mu dari segala hal yang tidak layak bagi-Mu, dan banyak mengingat-Mu atas anugerah dan nikmat yang engkau limpahkan kepada kami. Sesungguhnya engkau maha melihat dan mengetahui keadaan kami. '36. Mengabulkan permohonan nabi musa, dia berfirman, 'sungguh, telah diperkenankan semua permintaanmu itu, wahai musa. Terimalah anugerah besar kami itu kepadamu."
  }
]