[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman, “Sungguh Kami telah mengabulkan apa saja yang kamu minta, wahai Musa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Allah berfirman, \"Sungguh Kami telah mengabulkan apa yang engkau minta wahai Musa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يٰمُوسَىٰ (Allah berfirman: “Sesungguhnya telah diperkenankan permintaanmu, hai Musa”) Yakni Aku akan memberikan apa yang kamu minta berupa kelapangan dada, kemudahan urusan, terlepasnya kekakuan pada lisannya, dan kenabian Harun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Allah berfirman, mengabulkan (permintaan) Musa: “Sungguh Aku memberi setiap permintaanmu, Wahai Musa.” Yang dimaksud dengan As-Su’an adalah permintaan dan permohonan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman} Allah SWT berfirman {“Sungguh, telah diperkenankan permintaanmu} telah diberikan setiap permintaanmu {wahai Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah berfirman, “Sungguh telah diperkenankan permintaanmu, hai Musa,” maksudnya engkau telah diberi segala yang engkau minta. Kami akan melapangkan dadamu, memudahkan urusanmu dan melepaskan kekakuan pada lidahmu, sehingga mereka akan memahami apa yang engkau kemukakan. Dan Kami akan meneguhkan, \"dan Kami berikan kepadamu berdua kekuasaan yang besar, maka mereka tidak dapat mencapaimu; (berangkatlah kamu berdua) dengan membawa mukjizat Kami, kamu berdua dan orang yang mengikuti kamulah yang menang\". (Al-Qashash:35). Permohonan dari Musa ini menunjukkan kesempurnaan ma’riifah beliau terhadap Allah, kesempurnaan kecerdikan dan penguasaan beliau terhadap urusan-urusan dan kesempurnaan ketulusannya. Hal tersebut karena; seorang juru dakwah yang menyeru kepada Allah, yang menunjukkan jalan bagi manusia yang lain, terutama bila obyek dakwah dari kalangan orang-orang yang suka menentang, sombong dan berbuat melampaui batas, maka dia membutuhkan lapangnya dada, dan kelembutan yang penuh untuk menghadapi gangguan yang akan menimpanya, serta lisan yang fasih, yang sanggup mengungkapkan dengannya apa yang diinginkan dan dimaksud. Bahkan kelincahan berbicara dan pengunaan gaya bahasa yang menarik termasuk perkara yang sangat dituntut, karena banyaknya terjadi pertukaran pandangan dan saling mendebat serta karena unsur kebutuhannya terhadap (kemampuan) untuk memperindah potret kebenaran dan menghiasinya sesuai dengan tingkat kemampuannya. Gunanya, biar dapat menyulap jiwa-jiwa mereka untuk bersimmpati, juga untuk memperburuk gambaran kebatilan dan mencoreng-corengnya supaya lari darinya. Selain itu, seorang da’I berepentingan agar urusannya menjadi mudah, maka dia memasuki rumah melalui pintu-pintunya (menjalankan urusan melalui jalur yang tepat), mendakwahi dengan cara hikmah, nasihat yang baik dan mujadalah (adu argumentasi) dengan cara yang terbaik, berinteraksi dengan orang-orang yang sesuai dengan kondisinya. Lebih sempurna lagi, orang yang stastusnya demikian seharusnya mempunyai pendukung-pendukung dan pembantu-pembantu yanga akan meringannkannya menjalankan misinya. Pasalnya, suara-suara bila berjumlah banyak akan berpengaruh. Karena itu, beliau memohon hal-hal ini, lalu Allah langsung memberinya. Kalau anda memperhatikan kondisi para nabi yang diutus kepada umat manusia, maka anda akan menyaksikan mereka berkarakter demikian sesuai dengan kondisinya, terutama nabi penutup mereka dan yang paling mulia, Muhammad. Sesungguhnya beliau berada di puncak tertinggi di setiap sifat kesempurnaan. Beliau mempunyai kelapangandada, kemudahan urusan-urusan, kemampuan bicara yang bagus, keindahan pengungkapan dan tutur kata, serta memiliki para pendukung atas kebenaran dari kalangan sahabat dan orang-orang setelah mereka, yang tidak dimiliki oleh nabi lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 36: Permintaan Musa ‘alaihis salam ini menunjukkan sempurnanya ma’rifatnya kepada Allah, kecerdasannya dan pengalamannya serta sempurnanya sifat nushnya (rasa tulus kepada orang lain), yang demikian karena seorang da’i yang mengajak kepada Allah, yang membimbing makhluk apabila orang yang didakwahi adalah orang-orang yang sombong dan keras serta melampaui batas (keterlaluan), maka dibutuhkan dada yang lapang, kesabaran yang sempurna terhadap gangguan yang akan menimpanya, lisan yang fasih agar dapat mengungkapkan maksudnya, bahkan kefasihan dalam keadaan seperti ini sangat dibutuhkan sekali agar dapat mengajak mereka dengan baik dan karena perlunya memperindah kebenaran dan menghias semampunya agar dicintai oleh manusia dan agar kebatilan semakin buruk sehingga dijauhi. Di samping itu, seorang da’i juga perlu dimudahkan urusannya, sehingga ia mendatangi rumah-rumah dari pintunya, berdakwah dengan hikmah, nasehat yang baik, dan berdebat dengan cara yang baik, dan lebih sempurna lagi jika Beliau memiliki pembantu yang membantu apa yang diharapkannya, hal itu karena suara jika banyak tentu akan berpengaruh berbeda jika hanya seorang diri. Oleh karena itulah Nabi Musa ‘alaihis salam meminta semua itu dan kemudian permintaan Beliau dikabulkan. Ayat ini menunjukkan perlunya ada kesiapan dalam berdakwah serta segala sebab yang dapat memperlancar dakwah, dan untuk memperolehnya adalah dengan meminta kepada Allah kemudian berusaha untuk memilikinya. Jika kita memperhatikan kepada para nabi dan rasul, tentu kita akan menemukan kesamaan hanya sesuai kondisi ketika itu, misalnya adalah Nabi Muhammad shallallahu 'alaihi wa sallam, sifat–sifat Beliau sungguh utama dan mulia, dada Beliau lapang, lisannya fasih, bagus dalam menerangkan serta memiliki pembantu-pembantu dalam menegakkan kebenaran, yaitu para sahabat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 36",
    "description": "Mengabulkan permohonan nabi musa, dia berfirman, 'sungguh, telah diperkenankan semua permintaanmu itu, wahai musa. Terimalah anugerah besar kami itu kepadamu. 37-38. Dan wahai musa, ketahuilah bahwa sesungguhnya tanpa engkau minta pun, kami telah memberi nikmat kepadamu pada kesempatan yang lain sebelum ini, yaitu ketika kami mengilhamkan kepada ibumu sesudah kelahiranmu sesuatu yang diilhamkan, yaitu cara menyelamatkanmu dari rencana keji fir'aun."
  }
]