[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah melimpahkan kepadamu (wahai Musa) sebelum nikmat ini berupa nikmat lain, yaitu ketika kamu masih menyusu, lalu Kami selamatkan kamu dari kekejaman Fir’aun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan sungguh Kami telah memberimu nikmat sekali lagi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-39. Hai Musa, sungguh Kami telah memberi banyak kenikmatan yang lain sebelum kenikmatan ini sejak kamu dilahirkan; ketika Kami memberi ilham kepada ibumu agar memperhatikanmu: “Letakkanlah anakmu, Musa, di sebuah tempat kemudian hanyutkanlah tempat itu di sungai Nil, karena aliran air sungai akan menghanyutkannya ke tepi dan dia akan diambil Fir’aun, si musuh Allah dan musuh Musa.” Hai Musa, dan aku telah menjadikan rasa cinta terhadapmu dalam hati manusia agar kamu tumbuh dalam pengawasan dan perhatian-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَلَقَدْ مَنَنَّا عَلَيْكَ مَرَّةً أُخْرَىٰٓ (Dan sesungguhnya Kami telah memberi nikmat kepadamu pada kali yang lain) Ini merupakan kalimat baru yang mengingatkan Nabi Musa akan kenikmatan-kenikmatan Allah yang telah diberikan kepadanya. Makna (المن) adalah pemberian karunia dan kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Dan sungguh Kami telah memberikan kepadamu nikmat lain yang banyak. Al-Munnu adalah kebaikan dan keutamaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah memberikan nikmat} memberikan nikmat {kepadamu pada kesempatan yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37-39. Setelah menyebutkan karuniaNya yang tercurahkan kepada hamba dan RasulNya, Musa bin Imran dalam bentuk penguasaan agama, menerima wahyu dan risalah serta menjawab permohonannya, Allah mengingatkan kenikmatanNya yang terlimpahkan kepadanya pada masa pertumbuhan fisik dan perkembangan tahapan-tahapannya. Allah berfirman, “Dan sesungguhnya Kami telah memberi nikmat kepadamu pada kali yang lain,” saat itu Kami mengilhamkan ibumu untuk meletakkanmu ke dalam sebuah peti (untuk dihanyutkan ke sungai) pada saat engkau masih berada di masa penyusuan lantaran takut kepada Fir’aun. Karena ia (Fir’aun) menitahkan penyembelihan anak laki-laki Bani Israil. Maka si ibu menyembunyikannya, dan benar-benar mengkhawatirkan (keadaan) nya. Ia pun meletakannya di peti itu, selanjutnya, mengapungkannya di sungai, yaitu sisi sungai Nil Mesir. Allah memerintahkan sungai itu agar melontarkannya ke tepian dan mengondisikannya agar di ambil oleh orang yang paling bengis permusuhannya kepada Allah dan Musa. Ia (Musa) tumbuh berkembang di tengah anak-anaknya. Menjadi buah hati bagi orang yang melihatnya. Karena itu, Allah berfirman, “dan Aku telah mellimpahkan kepadamu kasih sayang yang datang dariKu.” Setiap orang yang melihat beliau, langsung menyukainya. “Dan supaya kamu diasuh di bawah (pengawasan) MataKu,” maksudnya engkau tumbuh di bawah pengawasan dan jaminan yang lebih agung dan lebih sempurna daripada perlindungan Dzat Yang Mahabaik, Maha Penyayang dan Mahakuasa untuk mendistribusikan kemaslahatan-kemaslahatan bagi hambaNya dan menyingkirkan bahaya-bahaya dariNya? Tidaklah beliau melewati satu kondisi ke kondisi berikutnya melainkan pasti Allah-lah yang mengatur semua urusan itu untuk kebaikan Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 37: Setelah Allah Subhaanahu wa Ta'aala menyebutkan nikmat-nikmat yang diberikan kepada Musa bin Imran berupa nikmat agama, wahyu, kerasulan dan pengabulan doa, Allah menyebutkan pula nikmat-Nya saat Beliau masih kecil dan dalam masa perkembangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 37",
    "description": "37-38. Dan wahai musa, ketahuilah bahwa sesungguhnya tanpa engkau minta pun, kami telah memberi nikmat kepadamu pada kesempatan yang lain sebelum ini, yaitu ketika kami mengilhamkan kepada ibumu sesudah kelahiranmu sesuatu yang diilhamkan, yaitu cara menyelamatkanmu dari rencana keji fir'aun"
  }
]