[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu ketika Kami memberikan ilham kepada ibumu,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Yaitu tatkala Kami mengilhamkan kepada ibumu sesuatu yang diilhamkan yang menjadi sebab Allah melindungimu dari makar Fir'aun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. إِذْ أَوْحَيْنَآ إِلَىٰٓ أُمِّكَ (yaitu ketika Kami mengilhamkan kepada ibumu) Yakni Kami ilhamkan kepadanya. مَا يُوحَىٰٓ (suatu yang diilhamkan) Suatu ilham."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Saat Kami memberikan ilham kepada ibumu untuk menjagamu. Dan terkadang wahyu itu digunakan untuk menyebut makna ilham seperti memberi ilham lebah untuk membuat sarang. Dan terkadang digunakan untuk memberikan contoh kepemilikan dalam ranah manusia sebagaimana yang terjadi kepada Maryam ketika bajunya tertiup."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami mengilhamkan} menghilhamkan {kepada ibumu sesuatu yang diilhamkan} sesuatu yang diilhamkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37-39. Setelah menyebutkan karuniaNya yang tercurahkan kepada hamba dan RasulNya, Musa bin Imran dalam bentuk penguasaan agama, menerima wahyu dan risalah serta menjawab permohonannya, Allah mengingatkan kenikmatanNya yang terlimpahkan kepadanya pada masa pertumbuhan fisik dan perkembangan tahapan-tahapannya. Allah berfirman, “Dan sesungguhnya Kami telah memberi nikmat kepadamu pada kali yang lain,” saat itu Kami mengilhamkan ibumu untuk meletakkanmu ke dalam sebuah peti (untuk dihanyutkan ke sungai) pada saat engkau masih berada di masa penyusuan lantaran takut kepada Fir’aun. Karena ia (Fir’aun) menitahkan penyembelihan anak laki-laki Bani Israil. Maka si ibu menyembunyikannya, dan benar-benar mengkhawatirkan (keadaan) nya. Ia pun meletakannya di peti itu, selanjutnya, mengapungkannya di sungai, yaitu sisi sungai Nil Mesir. Allah memerintahkan sungai itu agar melontarkannya ke tepian dan mengondisikannya agar di ambil oleh orang yang paling bengis permusuhannya kepada Allah dan Musa. Ia (Musa) tumbuh berkembang di tengah anak-anaknya. Menjadi buah hati bagi orang yang melihatnya. Karena itu, Allah berfirman, “dan Aku telah mellimpahkan kepadamu kasih sayang yang datang dariKu.” Setiap orang yang melihat beliau, langsung menyukainya. “Dan supaya kamu diasuh di bawah (pengawasan) MataKu,” maksudnya engkau tumbuh di bawah pengawasan dan jaminan yang lebih agung dan lebih sempurna daripada perlindungan Dzat Yang Mahabaik, Maha Penyayang dan Mahakuasa untuk mendistribusikan kemaslahatan-kemaslahatan bagi hambaNya dan menyingkirkan bahaya-bahaya dariNya? Tidaklah beliau melewati satu kondisi ke kondisi berikutnya melainkan pasti Allah-lah yang mengatur semua urusan itu untuk kebaikan Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 38: Dalam bentuk mimpi atau ilham ketika ibumu melahirkan kamu dan ia khawatir kalau Fir’aun sampai membunuhmu, karena ketika itu dia memerintahkan agar bayi Bani Israil yang lahir disembelih. Ada yang mengatakan bahwa sebab Fir’aun membunuh anak laki-laki dari kalangan Bani Isra’il adalah karena berita yang sampai kepadanya dari orang-orang Qibth (Mesir), di mana mereka mendengar cerita dari kaum Bani Isra’il yang mereka warisi dari Nabi Ibrahim ‘alaihissalam, bahwa akan keluar dari keturunannya seorang anak yang akan menggulingkan kekuasaan raja Mesir. Sedangkan menurut As Suddiy yang bersumber dari Ibnu Abbas atau dari Ibnu Mas’ud dan para sahabat yang lain bahwa sebabnya adalah karena Fir’aun bermimpi ada sebuah api yang datang dari arah Baitul Maqdis membakar rumah-rumah di Mesir beserta orang-orang Qibthi, namun orang-orang bani Isra’il tidak kena. Ketika Fir’aun bangun, ia pun kaget, segeralah dikumpulkannya para penyihir, para dukun dan para peramal, ia bertanya kepada mereka, mereka pun menjawab, “Ini adalah anak laki-laki dari kalangan mereka (bani Isra’il) yang akan menjadi sebab hancurnya penduduk Mesir melalui tangannya.” Wallahu Ta’aala a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 38",
    "description": "37-38. Dan wahai musa, ketahuilah bahwa sesungguhnya tanpa engkau minta pun, kami telah memberi nikmat kepadamu pada kesempatan yang lain sebelum ini, yaitu ketika kami mengilhamkan kepada ibumu sesudah kelahiranmu sesuatu yang diilhamkan, yaitu cara menyelamatkanmu dari rencana keji fir'aun. 39. Kami ilhamkan kepada ibumu, 'letakkanlah dia, yaitu bayi musa, di dalam peti, kemudian hanyutkanlah dia ke sungai nil yang mengalir tidak begitu deras. Ketika arus menghanyutkannya, maka biarlah aliran air sungai itu membawanya ke tepi sungai yang melewati istana fir'aun. Ketika saat itu tiba, dia akan diambil oleh fir'aun, penguasa mesir yang merupakan musuh-ku dan musuhnya. ' wahai nabi musa, ketahuilah bahwa aku telah melimpahkan kepadamu begitu banyak kasih sayang yang datang dari-ku sehingga siapa saja yang memandangmu akan tertarik dan menyayangimu. Kami anugerahkan itu semua kepadamu untuk kebaikanmu dan agar engkau diasuh dengan cara terhormat di bawah pengawasan-ku."
  }
]