[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Letakkanlah putramu, Musa, setelah kelahirannya, di dalam peti, lalu hanyutkanlah dia ke sungai Nil. Maka (aliran) sungai Nil akan mendamparkannya ke tepian sungai, sehingga nantinya akan diambil oleh Fir’aun, musuhKu dan musuhnya.’ Dan Aku telah menurunkan kasih sayang dariKu padamu sehingga kamu menjadi orang yang dicintai diantara hamba-hamba dan agar kamu diasuh di bawah pengawasan mataKu dan dalam penjagaanKu.” Dalam ayat ini terdapat penetapan sifat “Mata” bagi Allah, yang sesuai dengan keagungan dan kesempurnaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Kami telah memerintahkan dia ketika mengilhamkan kepadanya, setelah melahirkannya, letakkanlah Musa dalam peti, lalu hanyutkanlah peti itu ke lautan, niscaya arus laut itu akan membawanya ke tepi atas perintah Kami, lalu ia akan diambil oleh musuh-Ku dan musuhnya yaitu Fir'aun. Aku telah melimpahkan kepadamu kasih sayang yang akan datang dari-Ku sehingga manusia yang melihatmu pun menyayangimu, dan agar engkau diasuh dalam pengawasan dan penjagaan-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. أَنِ اقْذِفِيهِ فِى التَّابُوتِ (Yaitu: “Letakkanlah ia (Musa) didalam peti) Yakni letakkanlah dia di dalamnya. Makna (التابوت) adalah kotak yang terbuat dari kayu atau lainnya yang dapat mengapung di atas air. فَاقْذِفِيهِ فِى الْيَمِّ (kemudian lemparkanlah ia ke sungai) Makna (اليم) adalah laut atau sungai besar. Dan yang dimaksud dalam ayat ini adalah sungi Nil. فَلْيُلْقِهِ الْيَمُّ بِالسَّاحِلِ (maka pasti sungai itu membawanya ke tepi) Allah memerintahkan sungai Nil agar menghanyutkan Musa sampai di tepi sungai yang ada di belakang istana Fir’aun. يَأْخُذْهُ عَدُوٌّ لِّى وَعَدُوٌّ لَّهُۥ ۚ( supaya diambil oleh (Fir’aun) musuh-Ku dan musuhnya) Maka Fir’aun mengambilnya. وَأَلْقَيْتُ عَلَيْكَ مَحَبَّةً مِّنِّى(Dan Aku telah melimpahkan kepadamu kasih sayang yang datang dari-Ku) Yakni Allah menjadikan rasa cinta bagi Musa dalam hati para hamba-hamba-Nya sehingga tidak ada yang melihat Musa melainkan ia akan mencintainya. Pendapat lain mengatakan bahwa Musa dicintai Allah sehingga manusia jadi mencintainya. وَلِتُصْنَعَ عَلَىٰ عَيْنِىٓ( dan supaya kamu diasuh di bawah pengawasan-Ku) Yakni agar kamu diasuh dengan pengawasan-Ku dan pengasuhan yang khusus bagimu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Air merupakan salah satu ciptaan Allah, Ia memerintahkannya untuk menyelamatkan Musa : { فَلْيُلْقِهِ ٱلْيَمُّ بِٱلسَّاحِلِ } \"maka pasti sungai itu membawanya ke tepi\" dan Ia juga memerintahkannya untuk menenggelamkan musuh-Nya yaitu Fir'aun : { فَأَغْرَقْنَٰهُمْ فِى ٱلْيَمِّ } \"maka Kami tenggelamkan mereka di laut\" [ Al-A'raf : 136 ] semua itu tentunya berjalan sesuai penyebabnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Kami memberinya ilham untuk menaruh Musa ke dalam peti kayu, lalu membuangnya ke aliran sungai Nil, kemudian Kami memerintahkan sungai tersebut agar mengalirkan Musa ke tepian. Lalu musuh Allah dan Musa, yaitu Fir’aun mengambil peti tersebut. Lalu Kami limpahkan kepadamu kasih sayang dari Kami dalam hati manusia, sehingga tidak ada satupun yang melihatmu kecuali dia mengasihimu, dan supaya kamu diasuh dengan pemeliharaan dan penjagaanKu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yaitu letakkanlah dia} taruhlah dia {di dalam peti} di dalam peti {kemudian hanyutkanlah ke sungai. Maka biarlah (arus) sungai itu} laut itu {membawanya ke tepi. Dia akan diambil oleh musuhKu dan musuhnya. Aku telah melimpahkan} aku telah memberikan {kepadamu kasih sayang dariKu dan agar kamu diasuh} agar kamu diasuh {di bawah pengawasanKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37-39. Setelah menyebutkan karuniaNya yang tercurahkan kepada hamba dan RasulNya, Musa bin Imran dalam bentuk penguasaan agama, menerima wahyu dan risalah serta menjawab permohonannya, Allah mengingatkan kenikmatanNya yang terlimpahkan kepadanya pada masa pertumbuhan fisik dan perkembangan tahapan-tahapannya. Allah berfirman, “Dan sesungguhnya Kami telah memberi nikmat kepadamu pada kali yang lain,” saat itu Kami mengilhamkan ibumu untuk meletakkanmu ke dalam sebuah peti (untuk dihanyutkan ke sungai) pada saat engkau masih berada di masa penyusuan lantaran takut kepada Fir’aun. Karena ia (Fir’aun) menitahkan penyembelihan anak laki-laki Bani Israil. Maka si ibu menyembunyikannya, dan benar-benar mengkhawatirkan (keadaan) nya. Ia pun meletakannya di peti itu, selanjutnya, mengapungkannya di sungai, yaitu sisi sungai Nil Mesir. Allah memerintahkan sungai itu agar melontarkannya ke tepian dan mengondisikannya agar di ambil oleh orang yang paling bengis permusuhannya kepada Allah dan Musa. Ia (Musa) tumbuh berkembang di tengah anak-anaknya. Menjadi buah hati bagi orang yang melihatnya. Karena itu, Allah berfirman, “dan Aku telah mellimpahkan kepadamu kasih sayang yang datang dariKu.” Setiap orang yang melihat beliau, langsung menyukainya. “Dan supaya kamu diasuh di bawah (pengawasan) MataKu,” maksudnya engkau tumbuh di bawah pengawasan dan jaminan yang lebih agung dan lebih sempurna daripada perlindungan Dzat Yang Mahabaik, Maha Penyayang dan Mahakuasa untuk mendistribusikan kemaslahatan-kemaslahatan bagi hambaNya dan menyingkirkan bahaya-bahaya dariNya? Tidaklah beliau melewati satu kondisi ke kondisi berikutnya melainkan pasti Allah-lah yang mengatur semua urusan itu untuk kebaikan Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 39: Maksudnya, setiap orang yang memandang Nabi Musa ‘alaihis salam akan merasa sayang kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 39",
    "description": "Kami ilhamkan kepada ibumu, 'letakkanlah dia, yaitu bayi musa, di dalam peti, kemudian hanyutkanlah dia ke sungai nil yang mengalir tidak begitu deras. Ketika arus menghanyutkannya, maka biarlah aliran air sungai itu membawanya ke tepi sungai yang melewati istana fir'aun. Ketika saat itu tiba, dia akan diambil oleh fir'aun, penguasa mesir yang merupakan musuh-ku dan musuhnya. ' wahai nabi musa, ketahuilah bahwa aku telah melimpahkan kepadamu begitu banyak kasih sayang yang datang dari-ku sehingga siapa saja yang memandangmu akan tertarik dan menyayangimu. Kami anugerahkan itu semua kepadamu untuk kebaikanmu dan agar engkau diasuh dengan cara terhormat di bawah pengawasan-ku. 40. Wahai nabi musa, ingatlah ketika saudara perempuanmu berjalan di sekitar istana tempat engkau berada setelah dipungut dari sungai, untuk mencari berita tentang dirimu. Ketika ia tahu engkau enggan menyusu, lalu dia berkata kepada keluarga fir'aun, 'bolehkah saya menunjukkan kepadamu orang yang akan menyusui dan memeliharanya'' mereka setuju, lalu saudaramu mengajak ibumu untuk menyusuimu. Maka, kami mengembalikanmu kepada ibumu agar senang hatinya karena dapat memeliharamu dan tidak bersedih hati karena jauh darimu. Dan ingatlah wahai nabi musa pada anugerah kami yang lain, yaitu ketika engkau setelah menginjak dewasa pernah membunuh seseorang dari penduduk mesir, lalu kami selamatkan engkau dari kesulitan yang menimpamu akibat pembunuhan itu. Kami keluarkan engkau dari mesir dan kami telah mencobamu dengan beberapa cobaan yang berat di tempat tinggalmu yang baru. Dengan rahmat kami engkau berhasil mengatasinya, lalu engkau tinggal beberapa tahun di antara penduduk madyan dan menjadi menantu nabi syuaib. Kemudian saat ini engkau, wahai nabi musa, datang ke tempat ini menurut waktu yang telah ditetapkan oleh Allah."
  }
]