[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Al-Qur’an ini diturunkan dari Allah yang telah menciptakan bumi dan langit yang tinggi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Ia diturunkan oleh Allah yang menciptakan bumi ini, dan menciptakan langit-langit yang tinggi, itulah Al-Qur`ān yang agung karena diturunkan dari sisi Tuhan Yang Maha Agung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Al-Qur’an telah turun kepadamu dari Allah Yang Maha Agung yang telah menciptakan tujuh bumi dan tujuh langit yang tinggi, Dia Yang Maha Pengasih bagi seluruh makhluk-Nya bersemayam sesuai dengan kebesaran dan keagungan-Nya di atas ‘arsy yang merupakan makhluk yang paling besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. تَنزِيلًا مِّمَّنْ خَلَقَ الْأَرْضَ وَالسَّمٰوٰتِ الْعُلَى (yaitu diturunkan dari Allah yang menciptakan bumi dan langit yang tinggi) Ini merupakan penjelasan tentang kesempurnaan kebesaran Allah yang menurunkan al-Qur’an agar mereka menghargainya dengan sepatutnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman : { تَنزِيلًا مِّمَّنْ خَلَقَ ٱلْأَرْضَ وَٱلسَّمَٰوَٰتِ ٱلْعُلَى } ini merupakan pengagungan al-Qur'an, dan Allah mengagungkan al-Qur'an agar kita condong untuk mentadabburinya dan cermat pada makna dan hakikat yang terkandung di dalamnya; karena keagungan sesuatu tergantung siapa yang mendatangkannya, sehingga ia memiliki daya tarik untuk didekati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kami menurunkannya dari sisi Sang Pencipta Bumi dan Langit yang tinggi. Maksudnya yaitu untuk memberitahukan tentang keagungan turunnya Al-Qur’an."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diturunkan dari Dzat yang telah menciptakan bumi dan langit yang tinggi} yang tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Selanjutnya, Allah menyebutkan kebesaran al-Quran yang agung ini. Ini merupakan wahyu yang diturunkan Pencipta bumi dan langit, yang mengatur semua makhluk. Maksudnya, terimalah wahyu yang diturunkan ini dengan sikap ketundukan yang penuh, kecintaan, dan penerimaan yang total. Agungkanlah wahyu itu dengan sebaik-baiknya. Acapkali Allah menyatukan antara sifat al-Khalqu (penciptaan) dan al-Amru (penetapan syariat). Sebagaimana tertuang di dalam ayat ini. Juga seperti dalam FirmanNya, \"Ingatlah, menciptakan dan memerintah hanyalah hak Allah. Maha Suci Allah, Tuhan semesta alam.\" (Al-A’raf:54), juga dalam FirmanNya, \"Allah-lah yang menciptakan tujuh langit dan seperti itu pula bumi. Perintah Allah berlaku padanya, agar kamu mengetahui bahwasanya Allah Maha Kuasa atas segala sesuatu, dan sesungguhnya Allah, ilmu-Nya benar-benar meliputi segala sesuatu.\" (Ath-Thalaq:12). Demikian ini, karena Allah adalah Dzat yang menciptakan, yang menetapkan perintah dan larangan. Sebagaimana tidak ada pencipta selain Allah, maka tidak ada kewajiban, perintah, dan larangan yang harus dilaksanakan oleh makhluk kecuali dari Pencipta mereka. Begitu pula bahwa penciptaan yang Allah lakukan terhadap makhlukNya di dalamnya termasuk pengaturan takdir kauni (yang tidak berkaitan dengan mahabbah Allah dan mesti terjadi). Sedangkan penetapan perintah di dalamnya mengandung pengaturan takdir syar’I (yang berkaitan dengan mahabbah Allah, tapi tidak mesti terjadi). Sebagaimana penciptaan makhluk tidak akan terlepas dari hikmah, maka Allah tidak menciptakan mereka untuk tujuan yang mengada-ada, begitu pula, Allah tidak memerintahkan dan tidak melarang kecuali pasti dengan sebab yang mana ia merupakan sebuah keadilan, hikmah , dan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 4: Allah Subhaanahu wa Ta'aala menyebutkan keagungan Al Qur’an, bahwa ia turun dari Pencipta langit dan bumi yang mengatur semua makhluk. Oleh karena itu, sudah seharusnya diterima, dicintai, dan diikuti serta dimuliakan dengan sebenar-benarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 4",
    "description": "Wahai nabi, Al-Qur'an ini diturunkan kepadamu dari Allah yang mahaagung yang menciptakan bumi dan langit yang tinggi. Kandungannya merupakan petunjuk bagi mereka yang mau meyakini. 5. Tuhan yang menurunkan Al-Qur'an ini adalah yang maha pengasih terhadap semua makhuk tanpa terkecuali; yang bersemayam di atas 'arsy untuk mengatur semua urusan makhluk-Nya."
  }
]