[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami telah melimpahkan kepadamu kenikmatan, yaitu ketika saudarimu berjalan mengikutimu, kemudian berkata kepada orang-orang yang memungutmu (dari sungai), “Apakah kalian mau aku tunjukkan kepada orang (wanita) yang akan memeliharanya dan menyusuinya bagi kalian?’ Maka Kami mengembalikanmu kepada ibumu setelah engkau berada di tangan Fir’aun; agar jiwa ibumu menjadi tenang karena engkau selamat dari tenggelam dan dibunuh, dan agar dia tidak bersedih hati lantaran kehilangan dirimu. Dan kamu pernah membunuh seseorang lelaki dari suku Qibthi (mesir) tanpa kesengajaan, lalu Kami menyelamatkanmu dari kegundahan akibat perbuatanmu tersebut dan rasa takut dibunuh. Dan Kami telah mengujimu dengan suatu cobaan. Maka kamu pun keluar dalam keadaan takut menuju negeri Madyan. Maka kamu tinggal beberapa tahun bersama mereka. Kemudian kamu datang dari Madyan pada waktu yang sudah Kami tentukan untuk mengangkatmu sebagai Rasul dengan kedatangan yang sesuai dengan takdir Allah dan kehendakNya. Dan semua perkara semuanya merupakan milik Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Yaitu tatkala saudarimu berjalan membuntuti arah hanyutnya peti itu, lalu ia berkata kepada orang yang mengambilnya, \"Bolehkah aku menunjukkan kepada kalian orang yang akan memelihara, menyusui, dan mengasuhnya?\", Maka Kami pun memberikan nikmat kepadamu dengan mengembalikan dirimu kepada ibumu agar ia gembira dengan kepulanganmu dan tidak bersedih karena kehilanganmu. Juga engkau pernah membunuh seorang Qibti dengan pukulan tanganmu, lalu Kami memberimu nikmat dengan menyelamatkanmu dari hukuman, dan menyelamatkanmu berkali-kali dari berbagai cobaan yang menimpamu, lalu engkau pun keluar dari Mesir dan tinggal beberapa tahun di tengah penduduk Madyan, kemudian engkau datang pada waktu yang telah ditakdirkan agar Aku berbicara denganmu wahai Musa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40-41. Ketika saudarimu mencari kabar tentangmu dan mengetahui bahwa istri Fir’aun membutuhkan orang yang dapat menyusuimu, maka dia datang dan berkata kepada mereka: “Apakah kalian mau aku tunjukkan kepada orang yang dapat menyusui dan mengasuh Musa?” Sehingga dengan itu Kami mengembalikanmu kepada ibumu agar hatinya menjadi bahagia dan dipenuhi keridhaan serta tidak bersedih lagi atas perpisahannya denganmu. Dan Kami telah memberimu kenikmatan ketika kamu masih muda saat kamu di Mesir, ketika kamu membunuh orang qibthi secara tidak sengaja saat seorang Bani Israil meminta pertolongan darimu; kemudian Kami memberimu rasa aman dan menyelamatkanmu dari pembunuhan, dan Kami telah mengujimu dan Kami mendapatimu orang yang beristiqamah sehingga Kami menyelamatkanmu dari setiap ujian. Akibat pembunuhan itu kamu tinggal selama sepuluh tahun di negeri Madyan bersama Nabi Syuaib, kemudian kamu pergi ke gunung Thur pada saat yang telah Kami tetapkan untuk mengutusmu. Aku telah memberimu banyak kenimatan-Ku dan pengawasan-Ku, dan Aku memilihmu untuk menyampaikan risalah-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِذْ تَمْشِىٓ أُخْتُكَ (ketika saudaramu yang perempuan berjalan) Ia berjalan menyusuri tepi sungai mengiringi peti yang hanyut, ia mengikutinya agar dapat mengetahui dimana peti itu akan terdampar. Kemudian ia mendapati Fir’aun dan istrinya mencari orang yang dapat menyusui Musa; maka saudara perempuan Musa berkata kepada mereka berdua “Bolehkah saya menunjukkan kepadamu orang yang akan memeliharanya?” هَلْ أَدُلُّكُمْ عَلَىٰ مَن يَكْفُلُهُۥ ۖ (Bolehkah saya menunjukkan kepadamu orang yang akan memeliharanya?) Yakni orang yang akan mengasuhnya. Maka ibu Musa datang dan Musa mau menyusu padanya, padahal sebelumnya tidak mau menyusu pada orang lainnya. فَرَجَعْنٰكَ إِلَىٰٓ أُمِّكَ كَىْ تَقَرَّ عَيْنُهَا(Maka Kami mengembalikanmu kepada ibumu, agar senang hatinya) Makna (تقر عينها) adalah kegembiraan dengan kembalinya Musa kepadanya setelah dihanyutkan di sungai dan setelah kesedihan akibat berpisah dengannya. وَلَا تَحْزَنَ ۚ( dan tidak berduka cita) Karena suatu sebab yang mungkin akan terjadi. وَقَتَلْتَ نَفْسًا(Dan kamu pernah membunuh seorang manusia) Yakni orang Qibty yang dipukul Musa sampai meninggal. فَنَجَّيْنٰكَ مِنَ الْغَمِّ(lalu Kami selamatkan kamu dari kesusahan) Yakni rasa susah akibat pembunuhan yang kamu lakukan karena takut di siksa. وَفَتَنّٰكَ فُتُونًا ۚ( dan Kami telah mencobamu dengan beberapa cobaan) Yakni Kami telah membebaskanmu berkali-kali dari berbagai cobaan yang telah disebutkan sebelumnya yang terjadi sebelum Allah mengangkatnya sebagai seorang Rasul. Pendapat lain mengatakan maknanya adalah Kami telah mengujimu dengan beberapa ujian. Dan hadits yang menyebutkan ujian ini sangat panjang, yang dikeluarkan oleh Imam Nasa’i dalam tafsir pada kitab sunannya yang diriwayatkan dari Ibnu Abbas. Silakan merujuk pada kitab tersebut. فَلَبِثْتَ سِنِينَ فِىٓ أَهْلِ مَدْيَنَ(maka kamu tinggal beberapa tahun diantara penduduk Madyan) Kemudian kamu pergi ke negeri Mad’yan dan tinggal di sana beberapa tahun. Degeri madyan terletak di tanah Arab, sejauh 8 marhalah dari Mesir (1 marhalah 89 km). nabi Musa pergi dan tinggal di sana selama 10 tahun sebagai mahar pernikahannya. ثُمَّ جِئْتَ عَلَىٰ قَدَرٍ يٰمُوسَىٰ( kemudian kamu datang menurut waktu yang ditetapkan hai Musa) Yakni pada waktu yang telah Aku tetapkan dan takdirkan untuk Aku bicara kepadamu dan agar Aku menjadikanmu sebagai nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Ketika saudarimu berjalan di tepian mengikuti peti itu supaya bisa melihat tempat berhentinya, lalu Fir’aun dan istrinya mengambilnya, maka dia tahu bahwa keduanya mencari seorang ibu susuan untukmu, karena kamu tidak menerima susuan wanita selain ibumu, lalu dia berkata kepada keduanya: “Bolehkan aku mencarikan untuk kalian ibu susuan yang mau bersusah payah menyusui dan mengasuhnya” Lalu Kami kembalikan dirimu kepada ibumu, supaya dia senang dan bahagia atas kembalinya puteranya serta tidak bersedih lagi karena terpisah denganmu. Lalu kamu berbuat kesalahan dengan membunuh seorang suku Qubthy di Mesir saat seorang Bani Israil meminta pertolongan kepadamu. Lalu Kami amankan dirimu dari ketakutan dan Kami selamatkan dirimu dari kegundahan karena pembunuhan itu. Dan Kami bebaskan dirimu dari musibah dan penderitaan untuk sekian kalianya sebelum mendapatkan nubuwwah, seperti perjalanan dari Mesir menuju Madyan dengan jalan kaki, meninggalkan tanah air dan sahabat-sahabat di Mesir, kehabisan bekal dan memelihara kambing milik Syu’aib sehingga kamu menetap bersama penduduk Madyan selama 10 tahun dan Itu melalui 8 tahapan dari Mesir di selatan Palestina, sebelah timur laut bukit Thur di sisi teluk ‘Uqbah, kemudian kamu datang di bukit Thur di waktu tertentu sesuai ketentuan dan takdirKu yang azali untuk menyempurnakan dan menjadikanmu nabi, Wahai Musa. Maksudnya yaitu kamu datang di waktu yang sesuai dengan takdirKu untuk menerima risalah. Dan pengulangan {Ya Musa} adalah untuk memberi perhatian atas tujuan cerita tersebut yaitu, suatu perbincangan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika saudara perempuanmu berjalan, dia berkata “Bolehkah saya menunjukkan kepada kalian} menunjukkan kepada kalian {orang yang akan memeliharanya} mengasuh, menyusui dan menjaganya {Maka Kami mengembalikanmu} Kami mengembalikanmu {kepada ibumu agar senang hatinya} agar tenang hatinya dengan melihatmu {dan tidak bersedih. Kamu pernah membunuh seseorang lalu Kami menyelamatkanmu dari kesulitan} ketakutan dan kematian {dan Kami telah mencobamu dengan beberapa cobaan} Kami telah mencobamu dengan sungguh-sungguh, yaitu dengan meletakkanmu pada beberapa ujian dan membebaskanmu darinya {Lalu kamu tinggal} lalu kamu tinggal {beberapa tahun di antara penduduk Madyan, kemudian kamu datang} kamu datang {menurut ketetapan} sesuai janji yang telah Aku takdirkan untuk berfirman kepadamu dan mengutusmu {wahai Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Di antara bukti baiknya pengaturan Allah, adalah bahwa Musa ketika terjatuh di tangan musuhnya, maka ibu beliau sangat mengalami kegundahan. Hatinya kosong. Hampir saja berbicara tentangnya, seandainya Allah tidak meneguhkan sang ibu dan memantapkan hatinya. Dalam kondisi ini, Allah menghalang-halangi wanita-wanita yang ingin menyusui Musa. Ia tidak mau menerima susuan wanita mana pun, supaya tempat kembalinya adalah ibunya (sendiri) sehingga dia bisa menyusuinya. Ia pun berada di sisi sang ibu, hingga (ibunya) menjadi tenag, tentram dan suka cita. Mereka mulai menawarkan beberapa wanita yang ingin menyusui Musa. Akan tetapi dia tidak mau menerima (susuan) satu tetek pun. Kemudian saudara perempuan Musa datang menawarkan, “Bolehkan saya menunjukkan kepadamu orang yang akan memeliharanya,” kepada sebuah keluarga yang akan menanganinya unttuk menggantikan kalian, mereka sungguh-sungguh akan memperhatikannya. “Maka Kami mengembalikanmu kepada ibumu, agar senang hatinya dan tidak berduka cita. Dan kamu pernah membunuh seorang manusia,” yaitu orang Qibthi. Ketika beliau memasuki perkotaan pada waaktu orang-orang terlena, beliau menjumpai dua orang lelaki bertikai. Salah satunya berasal dari sukunya. Sementara itu, yang lain berasal dari suku yang memusuhi, suku Qibthi, maka lelaki yang berasal dari kaumnya meminta pertolongan untuk menghadapi lawannya. Musa memukulnya, dan seketika itu langsung menewaskannya. Beliau berdoa kepada Allah dan memohon ampunan (dari tindakan tadi). Maka Allah mengampuninya. Setelah itu, beliau elarikan diri, tatkala menerima berita bahwa orang-orang mencarinya untuk membunuhnya. “Kami selamatkan kamu dari kesusahan,” dari hukuman dan dosa pemunuhan. “Dan Kami telah mencobamu dengan beberapa cobaan,” Kami telah menguji dan menderamu dengan musibah. Lalu kami melihatmu dalam keadaan istiqamah (konsisten) di seluruh keadaan. Atau Kami telah memindah-mindahkan diriku dalam seluruh kondisi dan tahapan hidup sampai engkau meraih keberhasilan. “Maka kamu tinggal beberapa tahun di antara penduduk Madyan,” saat melarikan diri dari kejaran Fira’un dan pasukannya, yang berupaya membunuhmu. Setellah itu, engkau berjalan menuju Madyan dan sampai ke tempat itu dan menikah (dengan wanita) di sana. Engkau menetap di sana selama sepuluh tahun atau delapan tahun. “Kemudian kamu datang menurut waktu yang ditetapkan hai Musa,” maksudnya kemudian engkau tiba dengan kedatangan yang bukan kebetulan terjadi, tanpa disengaja atau pengaturan (dari Kami). Bahkan kehadiranmu itu bermula dari ketentuan takdir dan kelembutan Kami. Hal ini menunjukkan kesempurnaan perhatian Allah terhadap KalimNya (orang yang diajak bicara secara langsung), Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 40: Agar ia dapat mengetahui keadaan Musa. Ketika itu, para ibu yang siap menyusukan dihadirkan, namun Musa menolak menyusu kepada salah seorang di antara mereka, lalu saudara perempuannya berkata sebagaimana yang disebutkan dalam ayat di atas. Yang dibunuh Musa ‘alaihis salam ini ialah seorang bangsa Qibthi yang sedang berkelahi dengan seorang Bani Israil, sebagaimana yang dikisahkan dalam surah Al Qashash ayat 15. Setelah itu Musa ‘alaihis salam berdoa dan meminta ampunan kepada Allah, maka Allah mengampuninya, lalu Musa pergi menyelamatkan diri ketika mendengar bahwa para pembesar negeri hendak menangkapnya untuk dibunuh, maka Allah Subhaanahu wa Ta'aala menyelamatkan Beliau dari kemalangan akibat membunuh dan dari pembunuhan yang direncanakan ole para pembesar negeri. Yakni ternyata engkau tetap istiqamah di atas keadaanmu yang baik. Nabi Musa ‘alaihis salam datang ke negeri Mad-yan untuk menyelamatkan diri, di sana Beliau dikawinkan oleh seorang hamba yang saleh (menurut sebagian ahli sejarah, bahwa ia adalah Nabi Syu’aib, namun yang lain tidak berpendapat demikian) dengan salah seorang puterinya dan menetap sepuluh tahun di sana. Yakni ditetapkan dalam ilmu-Nya untuk datang ke lembah Thuwa menerima wahyu dan kerasulan, yaitu pada saat usia Beliau 40 tahun. Hal ini menunjukkan perhatian Allah kepada Nabi Musa ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 40",
    "description": "Wahai nabi musa, ingatlah ketika saudara perempuanmu berjalan di sekitar istana tempat engkau berada setelah dipungut dari sungai, untuk mencari berita tentang dirimu. Ketika ia tahu engkau enggan menyusu, lalu dia berkata kepada keluarga fir'aun, 'bolehkah saya menunjukkan kepadamu orang yang akan menyusui dan memeliharanya'' mereka setuju, lalu saudaramu mengajak ibumu untuk menyusuimu. Maka, kami mengembalikanmu kepada ibumu agar senang hatinya karena dapat memeliharamu dan tidak bersedih hati karena jauh darimu. Dan ingatlah wahai nabi musa pada anugerah kami yang lain, yaitu ketika engkau setelah menginjak dewasa pernah membunuh seseorang dari penduduk mesir, lalu kami selamatkan engkau dari kesulitan yang menimpamu akibat pembunuhan itu. Kami keluarkan engkau dari mesir dan kami telah mencobamu dengan beberapa cobaan yang berat di tempat tinggalmu yang baru. Dengan rahmat kami engkau berhasil mengatasinya, lalu engkau tinggal beberapa tahun di antara penduduk madyan dan menjadi menantu nabi syuaib. Kemudian saat ini engkau, wahai nabi musa, datang ke tempat ini menurut waktu yang telah ditetapkan oleh Allah. 41. Dan ketahuilah, wahai nabi musa, sungguh aku telah memilihmu, memeliharamu, dan mempersiapkanmu untuk diri-ku. Aku jadikan engkau nabi dan rasul-ku untuk menyampaikan risalah-ku kepada umatmu. '."
  }
]