[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Aku telah menganugrahkan kepadamu (wahai Musa), nikmat-nikmat ini sebagai pilihan dariKu terhadap dirimu dan sebagai pilihan untuk mengemban risalahKu dan menyampaikan ajaran dariKu, serta melaksanakan perintah dan laranganKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Dan Aku telah memilihmu menjadi seorang Rasul-Ku, untuk menyampaikan kepada manusia apa yang Aku wahyukan kepadamu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَاصْطَنَعْتُكَ لِنَفْسِى (dan Aku telah memilihmu untuk diri-Ku) Yakni Aku memilihmu untuk menegakkan hujjah dan Aku menjadikanmu perantara antara Aku dan hamba-hamba-Ku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Dan Aku jadikan dirimu sebagai seorang yang terpilih untuk menanggung dan menyampaikan risalahku kepada manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku telah memilihmu untukKu} Aku telah memilihmu untuk menyampaikan risalah dariKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Oleh karena itu Allah berfirman, “Dan Aku telah memilihmu untuk diriKu,” maksudnya Aku telah mencurahkan segala perbuatan, kenikmatan, kebaikan fasilitas dan pemeliharaanKu kepadamu. Tujuannya, agar engkau menjadi insan yang tercinta dan istimewa bagiKU, mencapai tingkatan dalam anugerah ini, yang tidak dapat digapai oleh orang lain dari makhlukKu kecuali sedikit dari mereka. Apabila ada orang yang mencintai, ingin mengistimewakan kekasihnya dari kalangan manusia, menginginkannya meraih kesempurnaan setinggi-tingginya, maka dia rela mengerahkan segenap kemampuan yang dimiliki dan mengusahakan semaksimal mungkin untuk merealisasikan kehendak tersebut, lalu bagaimana pandanganmu tentang usaha-usaha Rabb yang Mahakuasa (atas segala sesuatu) lagi Mahamulia?! Apa yang di benakmu tentang (tindakan-tindakan) Dzat yang menginginkan seseorang (untuk di pilih) bagi diriNya sendiri dan memilihnya dari makhluk-makhlukNya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 41: Allah Subhaanahu wa Ta'aala mengatur dan mengurus Musa ‘alaihis salam agar menjadi orang yang dicintai-Nya dan mencapat derajat yang tidak dicapai oleh makhluk-makhluk-Nya yang lain kecuali sedikit di antara mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 41",
    "description": "Dan ketahuilah, wahai nabi musa, sungguh aku telah memilihmu, memeliharamu, dan mempersiapkanmu untuk diri-ku. Aku jadikan engkau nabi dan rasul-ku untuk menyampaikan risalah-ku kepada umatmu. '42. Allah melanjutkan perintah-Nya kepada nabi musa, 'wahai nabi musa, pergilah engkau beserta saudaramu, harun, dengan membawa tanda-tanda kekuasaan dan kebesaran-ku, yaitu mukjizat yang pernah engkau saksikan, dan janganlah kamu berdua lalai, bosan, dan enggan mengingat- ku, baik dalam perjalanan atau saat berada di mesir."
  }
]