[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-44. Pergilah (wahai Musa) engkau bersama saudaramu, Harun, dengan membawa ayat-ayatKu yang menunjukkan keesaanKu dan kesempurnaan kuasaKu, serta kebenaran risalahmu, dan janganlah kalian berdua menjadi lemah untuk senantiasa mengingatKU. Pergilah kalian berdua bersama-sama kepada Fir’aun. Sesungguhnya dia telah berbuat melampaui batas dalam kekafiran dan kezhaliman. Dan katakanlah oleh kalian berdua kepadanya ucapan yang lembut; mudah-mudahan dia ingat atau takut kepada Tuhannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Maka pergilah engkau -wahai Musa- beserta saudaramu, Harun, dengan membawa tanda-tanda dan mukjizat yang menunjukkan kekuasaan dan keesaan-Ku, dan jangan sekali-kali kalian berdua lemah dalam berdakwah ke jalan-Ku, dan lalai dari mengingat-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42-44. Setelah Allah mengabulkan doa Musa agar menjadikan Harun sebagai orang yang membantunya, kemudian Allah memerintahkan mereka berdua untuk menuju Fir’aun dengan membawa berbagai mukjizat yang menjadi bukti keesaan Allah dan kebenaran risalah mereka. Dan Allah memerintahkan mereka agar tidak pernah lelah dalam berzikir kepada-Nya dan dalam menyampaikan risalah-Nya, dan agar berkata kepada Fir’aun dengan perkataan yang halus, dengan harapan dia berkenan mengambil pelajaran dan takut kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَلَا تَنِيَا فِى ذِكْرِى (dan janganlah kamu berdua lalai dalam mengingat-Ku) Yakni janganlah kalian lelah dalam berzikir kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Pergilah kamu dan saudaramu, Harun dengan membawa mukjizatKu, yaitu Sembilan ayat seperti belalang, banjir bandang, dan katak. Dan janganlah kalian kendur dan kurang dalam mengingat, mensucikan dan beribadah kepada Allah, serta menyampaikan risalahNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pergilah kamu beserta saudaramu dengan (membawa) ayat-ayatKu dan janganlah lalai} janganlah kalian lengah {dalam mengingatKu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Ketika Allah menceritakan mengenai kenikmatan yang dilimpahkan kepada Musa, yang bersifat agamis maupun duniawi, Allah berfirman kepadanya, “Pergilah kamu beserta saudaramu,” yaitu Harun “dengan membawa ayat-ayatKu,” yaitu tanda-tanda kebesaran yang berasal dariKu yang mengindikasikan kepada al-haq, dan keindahannya, serta (mengindiksikan) buruknya rupa kebatilan, seperti tipu daya, tongkat dan lainnya, sejumlah Sembilan tanda-tanda kekuasaan menuju Fir’aun dan pembesar-pembesarnya. “Dan janganlah kalian berdua lalai dalam mengingatKU,” maksudnya janganlah kalian kendor semangat dan jangan malas untuk senantiasa berdzikir kepadaKu dengan cara menjaga kontinuitasnya. Pegangi hal ini terus, sebagaimana janji kalian berdua untuk selalu melakukannya, “supaya kami banyak bertasbih kepadaMu dan banyak mengingatMu.” Sesungguhnya dzikir kepada Allah mendatangkan kemudahan dalam menangani segala urusan, menggampangkan urusan dan meringankan beban tanggungan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 42: Seperti tangan, tongkat dan mukjizat lainnya yang Allah berikan. Yang demikian adalah karena dzikrullah membantu semua urusan, memudahkannya dan meringankannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 42",
    "description": "Allah melanjutkan perintah-Nya kepada nabi musa, 'wahai nabi musa, pergilah engkau beserta saudaramu, harun, dengan membawa tanda-tanda kekuasaan dan kebesaran-ku, yaitu mukjizat yang pernah engkau saksikan, dan janganlah kamu berdua lalai, bosan, dan enggan mengingat- ku, baik dalam perjalanan atau saat berada di mesir. 43-44. Wahai nabi musa dan harun, pergilah kamu berdua kepada fir'aun yang sombong itu dengan bekal mukjizat dari-ku karena dia benar-benar telah melampaui batas dalam kedurhakannya. Begitu berhadapan dengannya, maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut. Ajaklah dia beriman kepada Allah dan serulah pada kebenaran dengan cara yang baik. Mudah-Mudahan dengan cara demikian dia menjadi sadar atau takut pada azab Allah bila terus durhaka. '."
  }
]