[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "42-44. Pergilah (wahai Musa) engkau bersama saudaramu, Harun, dengan membawa ayat-ayatKu yang menunjukkan keesaanKu dan kesempurnaan kuasaKu, serta kebenaran risalahmu, dan janganlah kalian berdua menjadi lemah untuk senantiasa mengingatKU. Pergilah kalian berdua bersama-sama kepada Fir’aun. Sesungguhnya dia telah berbuat melampaui batas dalam kekafiran dan kezhaliman. Dan katakanlah oleh kalian berdua kepadanya ucapan yang lembut; mudah-mudahan dia ingat atau takut kepada Tuhannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Maka ucapkanlah kepadanya perkataan yang lembut, tidak kasar dan keras, dengan harapan agar ia sadar dan takut kepada Allah, lalu bertobat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا (maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut) Yakni mereka berdua tidak berlaku keras seperti perkataan mereka kepada Fir’aun: هل لك إلى أن تزكى \"Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)\". (An-Nazi’at:18) لَّعَلَّهُۥ يَتَذَكَّرُ أَوْ يَخْشَىٰ (mudah-mudahan ia ingat atau takut) Yakni berbicaralah kepadanya dengan kata-kata yang lembut, sebab itu menjadikannya lebih mudah untuk memperhatikan apa yang kalian berdua sampaikan kepadanya dan takut kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seseorang membaca disisi Yahya bin Mu'adz ayat ini : { فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا } \"Maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut\" seketika Yahya menangis, dan berkata : Ya tuhanku inikah kelemah lebutanmu kepada siapa yang mengatakan saya lah tuhan! lalu bagaimana dengan hambamu yang mengatakan engkaulah tuhan!? 2 ). Jika pada suatu kaum kita diminta untuk menyampaikan dakwah, maka semestinya kita melakukan dan mengajarkan mereka usul dan uslubnya; sehingga mereka tidak melontarkan keburukan kepadanya, dan Allah mengirimkan qudwah untuk kita ketahui dan ikuti, tatkala mmerintahkan Musa untuk berdakwah kepada mereka { فَقُولَا لَهُۥ قَوْلًا لَّيِّنًا لَّعَلَّهُۥ يَتَذَكَّرُ أَوْ يَخْشَىٰ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Dan berucaplah kalian berdua dengan ucapan yang tidak kasar, dengan mengajaknya untuk beriman secara ramah bukan secara keras, barangkali dia mau mengambil pelajaran dan merenung, lalu beriman atau takut dengan azab Allah, lalu menghentikan kesewenang-wenangannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berkatalah kepadanya dengan perkataan yang lemah lembut} lemah lembut tanpa ada kekerasa di dalamnya {mudah-mudahan dia mengambil pelajaran} mengambil pelajaran {atau takut”} takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut,” yaitu perkataan yang enak (didengar), lunak, dengan kelembutan, persuasive, etika dalam tutur kata, tanpa unsur kekejian, pamer kekuatan dan kekerasan dalam perkataan, serta sikap kasar dalam tindakan. “Mudah-mudahan,” melalui perkataan yang lembut “dia ingat,” tentang perkara-perkara yang bermanfaat bagi dirinya hingga tergugah untuk mengerjakannya “atau takut,” akan segala sesuatu yang membahayakan dirinya sehingga meninggalkannya. Sesungguhnya tutur kata yang lembut akan mengundang perubahan itu, dan omongan yang kasar akan melahirkan antipasti pada dirinya. Tutur kata yang lunak ini diperjelas dalam Firman Allah, \"dan katakanlah (kepada Firaun): \"Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)\" Dan kamu akan kupimpin ke jalan Tuhanmu agar supaya kamu takut kepada-Nya?\" (An-Naziat:18-19) Sesungguuhnya ungkapan di atas memuat sisi kelembutan dan kemudahan tanpa ada unsur keburukan yang sangat jelas sekali bagi orang yang merenunginya. Beliau memulai dengan kata “Apakah,” yang menandakan tawaran dan ajakan diskusi, yang tiada seorang pun membencinya. Beliau mengajaknya untuk menyucikan dan membersihkan diri dari kotoran-kotoran (maknawi), yang intinya adalah membersihkan diri dari kesyirikan yang bisa disambut oleh setiap akal yang sehat. Beliau tidak mengatakan, “Aku akan membersihkan dirimu.” Akan tetapi berkata, “engkau me.” Akan tetapi berkata, “engkau membersihkan diri,” engkaulah orang yang menjalankannya. Selanjutnya, beliau mengajaknya menuju jalan Rabbnya yang telah merawat dan mencurahkan kenikmatan padanya dengan kenikmatan lahiriah dan batiniah, yang sudah sepantasnya timbal baliknya yaitu rasa syukur dan mengingat nikmat-nikmat itu. Allah berfirman, “Dan kamu akan kupimpin ke jalan Rabbmu agar kamu takut kepadaNya.” Ketika dia tidak mau menerima perkataan yang lembut yang keindahannya sanggup memikat hati, maka dapat diketahui bahwa peringatan sudah tidak mempan lagi baginya. Allah pun menyiksanya dengan siksaan Dzat Yang Mahaperkasa lagi Mahakuasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 44: Yakni dengan lembut dan beradab, tidak membual (mengada-ada), tidak keras ucapannya dan tidak kasar sikapnya. Ucapan yang lembut dapat membuat orang lain menerima, sedangkan ucapan yang keras dapat membuat orang lain menjauh. Nabi Musa ‘alaihs salam kemudian mengikuti perintah Allah tersebut, dan ketika sampai kepada Fir’aun dengan lembut Musa berkata sesuai perintah Allah, “Adakah keinginanmu untuk membersihkan diri, dan engkau akan kuarahkan ke jalan Tuhanmu agar Engkau takut kepada-Nya?” (lihat surah An Naazi’at: 18-19) sepeti inilah cara yang perlu dilakukan da’i, yakni perkataannya tidak menunjukkan paksaan, tetapi menunjukkan pilihan dan penawaran seperti dengan kata-kata, “Maukah? Mungkin? Barang kali?” dsb. Karena hal ini lebih bisa diterima daripada perkataan yang terkesan memaksa atau mengajari, terlebih kepada orang yang lebih tua. Perhatikanlah kalimat tersebut, “Adakah keinginanmu untuk membersihkan diri…dst.” Kalimatnya tidak “Agar aku bersihkan dirimu?” tetapi “membersihkan diri?” yang menunjukkan biarlah ia memberihkan dirinya sendiri setelah mengingatkan sesuatu yang membuatnya berpikir. Kemudian Musa ‘alaihis salam mengajaknya kepada jalan Tuhannya yang telah mengaruniakan berbagai nikmat yang nampak maupun yang tersembunyi, di mana nikmat-nikmat itu sepatutnya disyukuri dengan mengikuti perintah-perintah-Nya. Namun ternyata Fir’aun tidak menerima nasehat yang lembut itu, maka semakin jelaslah, bahwa peringatan tidak bermanfaat baginya, sehingga pantas jika Allah menghukumnya. Kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 44",
    "description": "43-44. Wahai nabi musa dan harun, pergilah kamu berdua kepada fir'aun yang sombong itu dengan bekal mukjizat dari-ku karena dia benar-benar telah melampaui batas dalam kedurhakannya. Begitu berhadapan dengannya, maka berbicaralah kamu berdua kepadanya dengan kata-kata yang lemah lembut. Ajaklah dia beriman kepada Allah dan serulah pada kebenaran dengan cara yang baik. Mudah-Mudahan dengan cara demikian dia menjadi sadar atau takut pada azab Allah bila terus durhaka. '45. Nabi musa dan harun tahu benar kekejaman dan kesombongan fir'aun. Karena itu, setelah mendengar perintah ini keduanya berkata, 'ya tuhan kami, sesungguhnya kami khawatir dia akan segera menyiksa kami sebelum kami selesai mengajaknya beriman kepada-Mu, atau dia justru akan bertambah melampaui batas, melebihi kedurhakaannya selama ini. '."
  }
]