[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa dan Harun berkata, “Wahai Tuhan kami, sesungguhnya kami khawatir dia akan segera melancarkan siksaan kepada kami atau justru bertambah membangkang terhadap kebenaran, sehingga tidak akan menerimanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Lalu Musa dan Harun -'alaihimassalām- berkata, \"Sesungguhnya kami khawatir dia akan menyiksa kami sebelum mendakwahinya secara sempurna, atau semakin zalim terhadap kami dengan pembunuhan atau selainnya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Maka mereka berdua mentaati perintah mulia ini, namun mereka merasa takut dalam menghadapi kekejaman Fir’aun, sehingga mereka berkata: “Ya Tuhan kami, kami takut Fir’aun akan segera menyiksa kami, atau berpaling dari kami dan dari risalah kami.” Maka Allah menenangkan mereka berdua dan berjanji akan menolong mereka: “Janganlah kalian takut dari kekejaman Fir’aun, sebab Aku bersama kalian, Aku akan menjaga kalian dan mendengar perkataan kalian serta melihat segala yang terjadi dengan kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. قَالَا رَبَّنَآ إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَآ (Berkatalah mereka berdua: “Ya Tuhan kami, sesungguhnya kami khawatir bahwa ia segera menyiksa kami) Yakni bersegera dalam menyiksa dan menyakiti kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Keduanya berkata: “Sesungguhnya Kami khawatir kalau dia akan menghukum dan membunuh kami atau melampaui batas dalam menyakiti kami dan bertambah sombong”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Keduanya berkata} Musa dan Harun berkata {“Wahai Tuhan kami, sesungguhnya kami khawatir dia akan segera menyiksa kami} dia akan segera menyiksa dan menghukum kami {atau semakin melampaui batas”} melampaui batas dengan berkata hal yang tidak sepatutnya tentang Engkau"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “Berkatalah mereka berdua, ‘Ya Rabb kami, sesungguhnya kami khawatir bahwa dia segera menyiksa kami’,” maksudnya menyegerakan siksaan dan menimpakannya pada kami sebelum kami menyampaikan risalah-risalahMu kepadanya dan menegakkan hujjah atas dirinya. “Atau akan bertambah melampaui batas,” maksudnya semakin angkuh terhadap kebenaran dan melampaui batas dengan kerajaan, kekuasaan, pasukan, dan para pendukungnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 45: Yakni sebelum risalah-Mu sampai dan sebelum kami menegakkan hujjah kepadanya. Terhadap kami dengan bersikap sombong."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 45",
    "description": "Nabi musa dan harun tahu benar kekejaman dan kesombongan fir'aun. Karena itu, setelah mendengar perintah ini keduanya berkata, 'ya tuhan kami, sesungguhnya kami khawatir dia akan segera menyiksa kami sebelum kami selesai mengajaknya beriman kepada-Mu, atau dia justru akan bertambah melampaui batas, melebihi kedurhakaannya selama ini. '46. Menenangkan nabi musa dan harun, dia berfirman, 'janganlah kamu berdua khawatir menghadapi fir'aun dan para pengikutnya. Sesungguhnya aku selalu bersama kamu berdua. Aku akan melindungimu dan menolongmu. Aku mendengar ucapan dan ajakanmu serta mendengar pula apa pun yang dikatakan fir'aun. Dan aku juga melihat apa yang kamu lakukan untuk menjalankan perintah-ku serta melihat apa yang diperbuat oleh fir'aun."
  }
]