[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-48. Allah berfirman kepada Musa dan Harun, “Janganlah kalian berdua takut kepada Fir’aun. Sesungguhnya Aku bersama kalian berdua, mendengar ucapan kalian berdua dan melihat tindakan-tindakan kalian berdua. Maka tetaplah pergi kepadanya dan katakanlah kepadanya, ‘Sesungguhnya kami berdua adalah utusan kepadamu dari Tuhanmu, agar kamu membebaskan orang-orang Bani Israil, dan janganlah membebani mereka pekerjaan-pekerjaan yang tidak dapat mereka pikul. Sesungguhnya kami telah datang kepadamu dengan membawa bukti mukjizat yang amat luar biasa dari Tuhanmu yang menunjukkan kebenaran kami dalam dakwah kami ini. Dan keselamatan dari siksaan Allah tercurah bagi orang yang mengikuti petunjukNya.’ Sesungguhnya Tuhanmu telah mewahyukan kepada kami bahwa siksaanNYa itu ditimpakan atas orang-orang yang mendustakan dan berpaling dari dakwah dan ajaran syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Allah berfirman kepada keduanya, \"Janganlah kalian berdua khawatir, sesungguhnya Aku bersama kalian untuk menolong dan melindungi kalian, dan Aku mendengar dan melihat apa yang akan terjadi antara kalian dan dia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. قَالَ لَا تَخَافَآ ۖ إِنَّنِى مَعَكُمَآ (Allah berfirman: “Janganlah kamu berdua khawatir, sesungguhnya Aku beserta kamu berdua) Dengan pertolongan-Ku bagi kalian dalam melawan Fir’aun. أَسْمَعُ وَأَرَىٰ (Aku mendengar dan melihat) Apa yang terjadi antara kalian dengan Fir’aun, dan Aku tidak akan lalai dari kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kselematan dan kemenangan diantara lafadz { لَا } dan { كَلّا } : tatkala Musa takut dari musuh-mushnya dan yang membangkang, Allah berforman kepadanya : { لَا تَخَافَآ ۖ إِنَّنِى مَعَكُمَآ } \"Janganlah kamu berdua khawatir, sesungguhnya Aku beserta kamu berdua\", dan tatkala sebagian pengikut Musa berkata : { إِنَّا لَمُدْرَكُوْنَ } \"Sesungguhnya kita benar-benar akan tersusul\" Musa kemudian merespon : { قَالَ كَلَّآ ۖ إِنَّ مَعِىَ رَبِّى سَيَهْدِينِ } \"Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku\" maka dari ayat-ayat ini sudah jelas kepada kita bahwasanya tidak ada kemenangan dan keselamatan melainkan dengan lafadz { لَا } kepada musuh, dan dengan lafadz { كَالّا } kepada siapa yang lemah imannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Allah SWT berfirman kepada keduanya: “Janganlah kalian berdua takut, sesungguhnya aku bersama kalian berdua untuk memberi pertolongan, bantuan dan penjagaan. Aku mendengar dan melihat apa yang terjadi di antara kalian berdua dengan Fir’aun”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berfirman, “Janganlah khawatir. Sesungguhnya Aku bersama kalian berdua. Aku mendengar dan melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Allah berfirman, ‘Jangan kamu berdua khawatir’,” dia akan menyegerakan siksaan pada kalian berdua, (karena) “sesungguhnya Aku beserta kamu berdua, Aku mendengar dan melihat,” maksudnya kalian berdua di bawah perlindungan dan perhatianKu dari (kejahatan) nya. Aku mendengar perkataan kalian berdua, dan melihat semua kondisi kalian berdua, maka janganlah kalian takut. Maka rasa takut sirna dari mereka dan hati mereka menjadi tentram dengan janji Rabb mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 46: Dengan memberikan pertolongan. Apa yang diucapkannya. Apa yang dilakukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 46",
    "description": "Menenangkan nabi musa dan harun, dia berfirman, 'janganlah kamu berdua khawatir menghadapi fir'aun dan para pengikutnya. Sesungguhnya aku selalu bersama kamu berdua. Aku akan melindungimu dan menolongmu. Aku mendengar ucapan dan ajakanmu serta mendengar pula apa pun yang dikatakan fir'aun. Dan aku juga melihat apa yang kamu lakukan untuk menjalankan perintah-ku serta melihat apa yang diperbuat oleh fir'aun47. Kamu berdua ada dalam lindungan-ku, maka janganlah takut. Pergilah kamu berdua kepadanya dan katakanlah, 'sesungguhnya kami berdua adalah utusan tuhanmu yang telah menganugerahkan beragam nikmat kepadamu, wahai fir'aun. Dia juga tuhan kami dan bani israil. Kami mengajakmu beriman kepada-Nya, maka lepaskanlah bani israil bersama kami agar kita semua menyembah Allah dan tidak mempersekutukan-Nya, dan janganlah engkau menyiksa mereka seperti yang selama ini kaulakukan. Sesungguhnya kami datang kepadamu dengan membawa bukti nyata tentang risalah kami dari tuhanmu, yakni berupa tongkat yang dapat berubah wujud menjadi ular dan tangan yang bersinar. Dan ketahuilah, wahai fir'aun, keselamatan itu akan dilimpahkan kepada orang yang mengikuti petunjuk Allah yang disampaikan oleh rasul-Nya."
  }
]