[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-48. Allah berfirman kepada Musa dan Harun, “Janganlah kalian berdua takut kepada Fir’aun. Sesungguhnya Aku bersama kalian berdua, mendengar ucapan kalian berdua dan melihat tindakan-tindakan kalian berdua. Maka tetaplah pergi kepadanya dan katakanlah kepadanya, ‘Sesungguhnya kami berdua adalah utusan kepadamu dari Tuhanmu, agar kamu membebaskan orang-orang Bani Israil, dan janganlah membebani mereka pekerjaan-pekerjaan yang tidak dapat mereka pikul. Sesungguhnya kami telah datang kepadamu dengan membawa bukti mukjizat yang amat luar biasa dari Tuhanmu yang menunjukkan kebenaran kami dalam dakwah kami ini. Dan keselamatan dari siksaan Allah tercurah bagi orang yang mengikuti petunjukNya.’ Sesungguhnya Tuhanmu telah mewahyukan kepada kami bahwa siksaanNYa itu ditimpakan atas orang-orang yang mendustakan dan berpaling dari dakwah dan ajaran syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Maka datangilah ia, dan katakan kepadanya, \"Wahai Fir'aun, sesungguhnya kami berdua adalah utusan Tuhanmu, maka lepaskanlah Bani Israil bersama kami, dan janganlah engkau menyiksa mereka dengan membunuh anak laki-laki mereka, dan membiarkan hidup anak-anak perempuan mereka. Sungguh kami datang kepadamu dengan membawa bukti dari Tuhanmu atas kejujuran kami, dan keselamatan dari azab Allah bagi orang yang beriman, lagi mengikuti petunjuk Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Maka mereka berdua pergi menuju Fir’aun dan berkata kepadanya: “Kami adalah utusan dari Tuhanmu, maka bebaskanlah Bani Israil dan janganlah kamu menyiksa mereka dengan membunuh, menawan, dan menindas mereka. Kami datang dari Tuhanmu dengan membawa berbagai mukjizat yang menjadi bukti kebenaran kenabian kami, yaitu mukjizat tongkat dan tangan. Dan keselamatan dari azab di dunia dan di akhirat bagi orang yang beriman kepada ayat-ayat Allah; sungguh Allah telah mewahyukan kepada kami bahwa kebinasaan adalah bagi orang yang mendustakan ayat-ayat Allah dan berpaling dari kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. فَقُولَآ إِنَّا رَسُولَا رَبِّكَ (dan katakanlah: “Sesungguhnya kami berdua adalah utusan Tuhanmu) Kami diutus Allah kepadamu. فَأَرْسِلْ مَعَنَا بَنِىٓ إِسْرٰٓءِيلَ(maka lepaskanlah Bani Israil bersama kami) Yakni bebaskanlah mereka dari tawananmu. وَلَا تُعَذِّبْهُمْ ۖ( dan janganlah kamu menyiksa mereka) Dahulu mereka dalam siksaan yang berat dari Fir’aun; dia menyembelih anak laki-laki mereka dan membiarkan anak perempuan mereka tetap hidup, serta memaksa mereka pekerjaan yang tidak mampu mereka kerjakan. قَدْ جِئْنٰكَ بِـَٔايَةٍ مِّن رَّبِّكَ ۖ (Sesungguhnya kami telah datang kepadamu dengan membawa bukti (atas kerasulan kami) dari Tuhanmu) Yakni dengan tongkat yang dapat berubah jadi ular dan tangan yang bersinar. وَالسَّلٰمُ عَلَىٰ مَنِ اتَّبَعَ الْهُدَىٰٓ (Dan keselamatan itu dilimpahkan kepada orang yang mengikuti petunjuk) Yakni orang yang mengikuti hidayah akan selamat dari kemurkaan dan azab Allah. Atau maksudnya adalah semoga keselamatan dilimpahkan kepadamu jika kamu mengikuti hidayah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Maka berangkatlah kalian berdua kepadanya dan berkata: “Sesungguhnya Kami diutus kepadamu oleh Tuhanmu untuk menyampaikan risalah untukmu dan agar kamu mau berikrar mengesakan Allah. Lalu bebaskanlah Bani Israil dari penawananmu. Dan janganlah siksa mereka dengan menyembelih putera-putera mereka dan memanfaatkan puteri-puteri mereka untuk memberikan pelayanan dan menanggung beban dengan bekerja keras. Kami datang kepadamu dengan membawa tanda-tanda dari Tuhanmu supaya kamu mau bersaksi atas kenabian kami, yaitu tongkat dan tangan. Dan keselamatan di dunia dan akhirat bagi orang yang beriman kepada ayat-ayat Allah SWT.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka datanglah kepadanya dan katakanlah,‘Sesungguhnya kami adalah utusan Tuhanmu. Lepaskanlah Bani Israil bersama kami dan janganlah menyiksa mereka. Sungguh kami datang kepadamu dengan membawa bukti dari Tuhanmu. Keselamatan itu} keselamatan dari azab {dilimpahkan kepada orang yang mengikuti petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Maka datanglah kalian berdua kepadanya dengan dua misi berikut: menyerunya kepada Islam dan menbebaskan bangsa mulia ini, Bani Israil dari jeratan dan perbudakan kepada Firaun. Agar mereka lepas dan dapat mengatur diri mereka sendiri, serta Musa berkesempatan menegakkan syariat Allah dan agamaNya di tengah mereka. “Sesungguhnya kami telah datang kepadamu dengan membawa bukti (atas kerasulan Kami),” yang menunjukkan kebenaran kami. Maka Musa melemparkan tongkatnya. Seketika itu, berubah menjadi ular yang nyata. Beliau lantas menarik tangannya (dari kempitan ketiaknya), tiba-tiba menjadi putih cemerlang pada pandangan orang-orang… sampai akhir cerita yang disebutkan oleh Allah tentang mereka berdua. “Dan keselamatan itu dilimpahkan kepada orang yang mengikuti petunjuk,” yaitu orang-orang yang mengikuti jalan yang lurus dan mendapatkan petunjuk dengan syariat yang jelas ini, maka dia mendapatkan hidayah di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 47: Yakni dari jeratanmu dan perbudakanmu wahai Fir’aun agar mereka dapat hidup merdeka dan berkuasa terhadap urusan mereka serta agar Musa dapat menegakkan syari’at Allah dan agama-Nya di tengah-tengah mereka. Pergi ke Syam. Bani Israil ketika berada di Mesir di bawah perbudakan Fir'aun. Mereka dipekerjakan untuk mendirikan Bangunan-bangunan yang besar dan kota-kota dengan kerja paksa. Maka Nabi Musa ‘alaihis salam meminta kepada Fir'aun agar mereka dibebaskan. Yakni dari azab di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 47",
    "description": "Kamu berdua ada dalam lindungan-ku, maka janganlah takut. Pergilah kamu berdua kepadanya dan katakanlah, 'sesungguhnya kami berdua adalah utusan tuhanmu yang telah menganugerahkan beragam nikmat kepadamu, wahai fir'aun. Dia juga tuhan kami dan bani israil. Kami mengajakmu beriman kepada-Nya, maka lepaskanlah bani israil bersama kami agar kita semua menyembah Allah dan tidak mempersekutukan-Nya, dan janganlah engkau menyiksa mereka seperti yang selama ini kaulakukan. Sesungguhnya kami datang kepadamu dengan membawa bukti nyata tentang risalah kami dari tuhanmu, yakni berupa tongkat yang dapat berubah wujud menjadi ular dan tangan yang bersinar. Dan ketahuilah, wahai fir'aun, keselamatan itu akan dilimpahkan kepada orang yang mengikuti petunjuk Allah yang disampaikan oleh rasul-Nya. 48. Kami tidak berdusta. Sesungguhnya telah diwahyukan kepada kami bahwa siksa Allah itu akan ditimpakan kepada siapa pun yang tidak beriman pada-Nya, mendustakan ajaran yang kami bawa, dan berpaling darinya serta enggan melaksanakannya. ''."
  }
]