[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-48. Allah berfirman kepada Musa dan Harun, “Janganlah kalian berdua takut kepada Fir’aun. Sesungguhnya Aku bersama kalian berdua, mendengar ucapan kalian berdua dan melihat tindakan-tindakan kalian berdua. Maka tetaplah pergi kepadanya dan katakanlah kepadanya, ‘Sesungguhnya kami berdua adalah utusan kepadamu dari Tuhanmu, agar kamu membebaskan orang-orang Bani Israil, dan janganlah membebani mereka pekerjaan-pekerjaan yang tidak dapat mereka pikul. Sesungguhnya kami telah datang kepadamu dengan membawa bukti mukjizat yang amat luar biasa dari Tuhanmu yang menunjukkan kebenaran kami dalam dakwah kami ini. Dan keselamatan dari siksaan Allah tercurah bagi orang yang mengikuti petunjukNya.’ Sesungguhnya Tuhanmu telah mewahyukan kepada kami bahwa siksaanNYa itu ditimpakan atas orang-orang yang mendustakan dan berpaling dari dakwah dan ajaran syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Sesungguhnya Allah telah mewahyukan kepada kami bahwa azab yang ada di dunia dan di akhirat itu ditimpakan kepada siapapun yang mendustakan ayat-ayat Allah, dan berpaling dari risalah yang dibawa oleh para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. إِنَّا قَدْ أُوحِىَ إِلَيْنَآ (Sesungguhnya telah diwahyukan kepada kami) Yakni wahyu dari Allah. أَنَّ الْعَذَابَ عَلَىٰ مَن كَذَّبَ وَتَوَلَّىٰ( bahwa siksa itu (ditimpakan) atas orang-orang yang mendustakan dan berpaling) Yakni kehancuran dan kebinasaan di dunia dan siksa yang kekal di neraka sebagai balasan atas pendustaan mereka terhadap ayat-ayat Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Sungguh Allah memberi wahyu kepada kami bahwa kehancuran itu ada di dunia dan keabadian itu ada di neraka akibat pendustaan terhadap ayat-ayat Allah dan rasul-rasulNya, dan menolak untuk beriman dan berikrar mengesakan Allah SWT. Perlu diperhatikan bahwa Allah SWT itu memberikan kabar gembira tentang kesejahteraan untuk menyenangkan, lalu mengumumkan hukuman untuk memberikan ancaman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya telah diwahyukan kepada kami bahwa siksa itu (ditimpakan) kepada siapa saja yang mendustakan dan berpaling} berpaling dari keimanan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Sesungguhnya telah diwahyukan kepada kami,” maksudnya berita (yang kami bawa) berasal dari Allah bukan dari saku kami sendiri. “bahwa siksa itu (ditimpakan) atas orang-orang yang mendustakan dan berpaling,” yaitu orang-orang yang mendustakan berita-berita (wahyu-wahyu) Allah dan kabar-kabar dari RasulNya, memalingkan mukanya dari kepatuhan dan mengikuti para rasul. Dalam ayat ini terdapat bujukan kepada Firaun untuk mau beriman dan membenarkan serta mengikuti mereka berdua (Musa dan Harun), (juga) peringatan dari sikap yang berlawanan dengannya. Akan tetapi, nasihat dan peringatan ini tidak membekaskan manfaat padanya. Fir’aun malah mengingkari Rabbnya dan mengkufuri serta mengajak debat dalam masalah ini sebagai (cerminan) sifat kezhaliman dan penentangannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 48: Atau mendustakan berita-berita Allah dan Rasul-Nya. Maksudnya, tidak mempedulikan dan tidak mengikuti ajaran dan petunjuk rasul. Nabi Musa ‘alaihis salam mentarghib (mendorong) Fir’aun untuk beriman dan mengikutinya serta mentarhib(menakut-nakuti)nya jika tidak mau beriman dan mengikuti. Akan tetapi nasehat itu tidak dipedulikannya, ia tetap ingkar dan kafir kepada Tuhannya dan membantahnya karena kezaliman dan kedurhakaannya seperti yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 48",
    "description": "Kami tidak berdusta. Sesungguhnya telah diwahyukan kepada kami bahwa siksa Allah itu akan ditimpakan kepada siapa pun yang tidak beriman pada-Nya, mendustakan ajaran yang kami bawa, dan berpaling darinya serta enggan melaksanakannya. ''49. Fir'aun ingin mendapat kejelasan tentang Allah, tuhan yang mahakuasa tersebut. Dia berkata, 'siapakah tuhanmu berdua yang mengutusmu untuk menyampaikan dakwah itu, wahai musa''"
  }
]