[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada mereka berdua (sebagai bentuk pengingkaran), “Siapakah gerangan Tuhan kalian berdua,wahai Musa?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Fir'aun berkata sembari mengingkari risalah yang mereka bawa, \"Siapakah Tuhan kalian berdua yang kalian klaim bahwa Dia mengutus kalian kepadaku, wahai Musa?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-51. Fir’aun menjawab dengan angkuh: “Memang siapa Tuhan kalian hai Musa?” Musa menjawab dengan penuh keyakinan: “Tuhan kami adalah yang telah menciptakan seluruh makhluk dengan penciptaan yang layak kemudian memberi petunjuk bagi setiap makhluk untuk memanfaatkan apa yang telah Allah ciptakan baginya.” Fir’aun tetap berpegang pada kesesatannya dan berkata: “Lalu bagaimana nasib umat-umat terdahulu yang kafir?” Ibnu ‘Asyur berkata: “Musa menjawab dengan menegaskan ketuhanan Allah atas seluruh makhluk, dengan menerapkan kaidah berdalil dengan sesuatu yang umum atas sesuatu yang khusus, karena dengan demikian dapat berlaku qiyas dari keduanya. Fir’aun adalah bagian dari sesuatu yang umum sehingga dia masuk dalam kalimat (كل شيء) ‘setiap sesuatu’. (at-Tahrir wa at-Tanwir)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قَالَ فَمَن رَّبُّكُمَا يٰمُوسَىٰ (Berkata Fir’aun: “Maka siapakah Tuhanmu berdua, hai Musa?) Fir’aun mengatakan ‘tuhan kalian berdua’ dan tidak mengatakan ‘tuhanku’ karena dia tidak meyakini Musa dan Harun dan tidak mempercayai sifat ketuhanan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Fir’aun berkata: “Lalu siapakah Tuhan kalian, wahai Musa?” Dia berbicara kepada dua orang lalu mengkhususkan pembicaraan itu untuk Musa karena dialah sumbernya dan Harun hanya pendampingnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Fir’aun berkata {“Siapakah Tuhan kalian berdua, wahai Musa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Maksudnya, Fir’aun berkata kepada Musa dengan nada pengingkaran, “Maka siapakah Rabbmu berdua, hai Musa?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 49",
    "description": "Fir'aun ingin mendapat kejelasan tentang Allah, tuhan yang mahakuasa tersebut. Dia berkata, 'siapakah tuhanmu berdua yang mengutusmu untuk menyampaikan dakwah itu, wahai musa'' 50. Nabi musa menjawab, 'tuhan kita semua ialah tuhan yang telah menciptakan semua makhluk dan memberikan bentuk kejadian kepada segala sesuatu di alam semesta ini, kemudian memberinya petunjuk dan potensi untuk dapat melakukan segala sesuatu sesuai fungsinya. '."
  }
]