[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepadanya, “Tuhan kami, ialah Yang telah memberikan segala sesuatu kepada makhluknya bentuk ciptaan yang sesuai dengannya yang menjadi petunjuk keindahan ciptaanNya dan kemudian memberi petunjuk kepada tiap-tiap makhluk untuk mengetahui cara memanfaatkan semua yang telah diciptakan Allah baginya. “"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Musa menjawab, \"Tuhan kami adalah Tuhan yang telah memberikan rupa dan bentuk segala sesuatu dengan serasi, lalu memberikan petunjuk kepada semua makhluk itu untuk apa Dia menciptakan mereka.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. قَالَ رَبُّنَا الَّذِىٓ أَعْطَىٰ كُلَّ شَىْءٍ خَلْقَهُۥ (Musa berkata: “Tuhan kami ialah (Tuhan) yang telah memberikan kepada tiap-tiap sesuatu bentuk kejadiannya) Yakni menjadikan bentuk dan rupanya dari anggota tubuh yang sesuai dengan manfaat yang berhubungan dengan anggota tubuh tersebut seperti tangan untuk memegang, kaki untuk berjalan, lidah untuk berbicara, mata untuk melihat, dan telinga untuk mendengar. Pendapat lain mengatakan maknanya adalah Allah memberi makhluk-Nya segala yang dibutuhkannya. ثُمَّ هَدَىٰ( kemudian memberinya petunjuk) Yakni memberikan mereka petunjuk tentang cara memanfaatkan apa yang telah Allah berikan kepada mereka, sehingga mereka benar-benar mendapatkan menfaat darinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Semut-semut kecil ketika mereka menyimpan bijian terlebih dahulu mereka pecahkan menjadi dua bagian, karena mereka tahu jika bijian itu tidak dipecahkan akan tumbuh dengan sendirinya, begitulah Allah memberi petunjuk kepada siapa saja yang ada di muka bumi ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Musa berkata: “Tuhan Kami adalah Dzat yang menentukan sususan dan bentuk yang sesuai pilihanNya bagi setiap makhluk, lalu membimbingnya untuk mengerjakan tugasnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjawab} Musa menjawab {“Tuhan kami adalah Dzat yang telah menganugerahkan kepada segala sesuatu bentuk kejadiannya} bentuk dan wujudnya yang sesuai {kemudian memberinya petunjuk”} memperkenalkannya kepada seluruh manfaatnya agar dia bisa mengusahakannya, dan mudharat-mudharatnya agar dia bisa mewaspadainya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Maka Musa menjawab (pertanyaan pengingkaran itu) dengan jawaban yang sempurna, memadai lagi jelas. Dia berkata, “Rabb kami adalah (Rabb) yang telah memberikan kepada tiap-tiap sesuatu bentuk kejadiannya, kemudian memberinya petunjuk.” Maksudnya Rab kami, adalah Dzat yang menciptakan seluruh makhluk dan memasang bentuk penciptaan pada setiap makhluk sesuai dengan modelnya yang cocok [yang menunjukkan] keelokan buatan Dzat yang menciptanya, baik yang berukuran besar, kecil, dan sedang, serta karakteristiknya secara keseluruhan. Lantas Allah memberikan hidayah setiap makhluk pada tujuan penciptaannya. Inilah hidayah sempurna yang dapat disaksikan pada segenap makhluk. Kamu mendapat masing-masing makhluk bergerak melaju pada skenario tujuan penciptaannya, berupa kemanfaatan-kemanfaatan dan menyingkirkan bahaya-bahaya. Bahkan Allah memberi hewan (yang tidak bisa berkomunikasi) sebagai kemampuan akal yang bisa membantunya untuk menjalankan misi. Ini serupa dengan Firman Allah, \"Yang membuat segala sesuatu yang Dia ciptakan sebaik-baiknya\" (As-Sajdah:7) Dzat yang menciptakan seluruh makhluk dan memberinya bentuk ciptaan yang indah, yang mana akal-akal pun tidak mampu mengagas rupa yang lebih baik, Dia memberinya hidayah (ilham) kepadanya untuk mencapai kemaslahatan-kemaslahatannya, Dia-lah Rabb yang sebenarnya. Maka pengingkaran Fir’aun, berarti pengingkaran terhadap wujud yang paling agung. Dan itu merupakan bentuk kesombongan dan dusta yang terang-terangan. Bila ditakdirkan ada seseorang mengingkari sebuah fakta yang sudah di ketahui (khalayak), niscaya dia tidak akan menginngkarinya, maka pengingkarannya kepada Rabb semesta alam tentulah lebih parah lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 50: Yakni Dia yang menciptakan semua makhluk dan memberikan kepada setiap makhluk ciptaan yang cocok baginya, di mana hal itu menunjukkan bagusnya ciptaan-Nya, ada yang berbadan besar dan ada yang kecil dan ada pula yang pertengahan, dan Dia memberikan pula sifatnya. Maksudnya, memberikan akal, instink (naluri) dan kodrat alamiyah untuk kelanjutan hidupnya masing-masing. Oleh karena itu, kita dapat menyaksikan semua makhluk berusaha untuk memperoleh manfaat dan terhindar dari bahaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 50",
    "description": "Nabi musa menjawab, 'tuhan kita semua ialah tuhan yang telah menciptakan semua makhluk dan memberikan bentuk kejadian kepada segala sesuatu di alam semesta ini, kemudian memberinya petunjuk dan potensi untuk dapat melakukan segala sesuatu sesuai fungsinya. '51. Mendengar jawaban nabi musa tentang kekuasaan Allah, fir'aun berkata, 'jadi, bagaimana keadaan umat-umat yang dahulu yang telah meninggal dunia, seperti kaum nabi nuh, hud, dan saleh, yang lebih dulu ingkar''."
  }
]