[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada Musa (sebagai bentuk mencari-cari kesalahan dan memprovokasi emosi), “Bagaimanakah nasib umat-umat manusia terdahulu? Sesungguhnya berita (penduduk) pada masa-masa yang telah berlalu? Sesungguhnya mereka telah mendahului kami dengan sikap pengingkaran dan kekufuran.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Fir'aun berkata, \"Jadi bagaimana keadaan umat-umat terdahulu yang hidup di atas kekafiran?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. قَالَ فَمَا بَالُ الْقُرُونِ الْأُولَىٰ (Berkata Fir’aun: “Maka bagaimanakah keadaan umat-umat yang dahulu?”) Umat-umat tersebut tidak mengakui Tuhan yang diserukan oleh Musa, dan mereka menyembah berhala-berhala dan sebagainya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Fir’aun berkata: “Lalu bagaimana keadaan umat-umat terdahulu yang tidak berikrar untuk Allah dan tidak menerima keesaanNya, yaitu Tuhan yang kamu serukan, wahai Musa? yang menyembah berhala dan sesuatu yang serupa.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Fir’aun berkata {“Bagaimana keadaan generasi terdahulu”} lalu bagaimana keadaan umat-umat yang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Untuk itu, lantaran Fir’aun tidak mungkin menentang dalil yang pasti ini, maka dia beralih kepada keributan dan berpaling dari focus semula. Ia berkata kepada Musa, “Maka bagaimanakah keadaan umat-umat yang dahulu?” maksudnya, bagaimana kondisi mereka? Bagaimana berita tentang mereka? Bagaimanakah kesudahan mereka, padahal mereka itu telah mendahului kami dengan sikap pengingkaran, kekufuran, kezhaliman, dan pertentangan. Dan kami hanyalah mengikuti mereka saja?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 51: Oleh karena dalil yang disampaikan Musa adalah benar, maka untuk menolaknya Fir’aun beralih kepada masalah lain dan menyimpang dari maksud dan tujuan. Seperti kaum Nuh, kaum Hud, kaum Luth, dan kaum Shalih, di mana mereka telah mendahului kami mengingkari-Nya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 51",
    "description": "Mendengar jawaban nabi musa tentang kekuasaan Allah, fir'aun berkata, 'jadi, bagaimana keadaan umat-umat yang dahulu yang telah meninggal dunia, seperti kaum nabi nuh, hud, dan saleh, yang lebih dulu ingkar''52. Nabi musa menjawab pertanyaan fir'aun, 'pengetahuan tentang itu secara rinci hanya ada pada tuhanku. Hanya dia yang mengetahuinya. Semua hal yang berkaitan dengan makhluk tercatat di dalam sebuah kitab, yaitu lauh mahfuz. Tuhanku tidak akan pernah salah ataupun lupa pada apa pun yang terjadi di alam semesta ini."
  }
]