[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada Fir’aun, “apa yang kamu tanyakan bukanlah termasuk dari apa yang kami mengetahuinya, karena sesungguhnya Pengetahuan mengenai umat-umat di masa itu terkait apa yang mereka perbuat dari kekafiran mereka itu ada di sisi Tuhanku di Lauhul Mahfuzh. Sedang aku tidak punya pengetahuan tentang itu sama sekali. Tuhanku tidaklah akan salah dalam perbuatan-perbuatan dan ketetapan hukum-hukumNya, dan Dia tidak lupa akan sesuatu yang telah Dia ketahui darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Musa berkata kepada Fir'aun, \"Pengetahuan tentang umat-umat tersebut ada pada Tuhanku, tertulis dalam Lauḥ Maḥfuẓ, dan Tuhanku tidak akan salah pengetahuan-Nya, dan tidak pula lupa dengan apa yang Dia ketahui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52-53. Musa menjawab dengan jawaban yang berhubungan dengan tauhid rububiyah: “Ilmu umat-umat tersebut ada di sisi Tuhanku Semata yang tercantum dalam lauhul mahfuhz. Tuhanku sama sekali tidak tersalah atau lupa, Dialah yang menghamparkan bumi bagi kalian, dan menciptakan padanya jalan-jalan yang dapat kalian lalui, serta menurunkan hujan yang bermanfaat dari awan kemudian dengan air hujan itu Dia menumbuhkan tumbuh-tumbuhan yang memiliki berbagai macam manfaat dan mempunyai keindahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. قَالَ عِلْمُهَا عِندَ رَبِّى (Musa menjawab: “Pengetahuan tentang itu ada di sisi Tuhanku) Yakni segala amalan mereka tersimpan di sisi Allah dan tercantum dalam lauhul mahfuzh, dan Allah akan membalas amalan mereka itu. لَّا يَضِلُّ رَبِّى وَلَا يَنسَى (Tuhan kami tidak akan salah dan tidak (pula) lupa) Yakni Allah tidak salah dalam pengetahuannya tentang sesuatu dan tidak lupa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Musa berkata: “Dia mengatahui kondisi-kondisi umat-umat terdahulu dan amal-amal mereka yang dicatat oleh Tuhanku di Lauhil Mahfudz. Tuhanku tidak mungkin salah dalam mengetahui sesuatu dan tidak akan melupakan apa yang diketahui olehNya.” Maksudnya adalah untuk meneguhkan kesempurnaan ilmu Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menjawab} Musa berkata {“Pengetahuan tentang itu di sisi Tuhanku di dalam kitab} di Lauhil Mahfuz {Tuhanku tidak akan salah} Tuhanku pengetahuanNya tentang itu tidak akan salah {dan tidak pula lupa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Musa menjawab, “Pengetahuan tentang itu ada di sisi Rabbku, di dalam sebuah kitab. Rabb kami tidak akan salah dan tidak (pula) lupa,” maksudnya Allah telah menghitung amalan mereka, baik atau buruk dan membukukannya dalam KitabNya, Lauhul Mahfuzh. Ilmu dan pengetahuan Allah meliputi isinya. Dia tidak akan salah tentangnya dan (juga) tidak lupa atas perkara yang telah diketahuiNya. Inti dari semua itu, bahwa mereka melakukan sesuatu yang dahulu dilakukan oleh (nenek moyang) mereka dan menjumpai amalan-amalan mereka serta menerima balasan atas dasar itu. Tidak ada artinya pertanyaan dan keingintahuanmu tentang mereka, wahai Fir’aun. Mereka merupakan umat yang sudah berlalu. Bagi mereka apa yang mereka perbuat dan bagi kalian amalan-amalan yang kalian lakukan. Jika dalil yang sudah kami kemukakan di hadapanmu, dan ayat-ayat (tanda-tanda kebesaran Allah) yang sudah kami pertontonkan kepadamu, telah membuktikan kebenaran dan kepastiannya, dan itulah faktanya, maka tunduk patuhlah kepada al-haq. Singkirkanlah kekufuran, tindak kezhaliman, perdebatan dengan dasar kebatilan dari dirimu. Apabila engkau masih meragukannya atau engkau menyaksikannya tidak lurus, maka pintu tetap terbuka, dan kesempatan untuk menelitinya belum ditutup. Maka, bantahlah dalil dengan dalil pula, petunjuk dengan petunjuk juga. Engkau tidak akan menemukan cara itu, selama siang dan malam (masih sislih berganti). Bagaimana bisa (dia tetap kufur), padahal Allah telah memberitahukan tentangnya, dia mengingkarinya meski hati meyakini kebenarannya. Seperti Firman Allah, \"Dan mereka mengingkarinya karena kelaliman dan kesombongan (mereka)\" (An-Naml:14). Musa berkata, \"\"Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mukjizat-mukjizat itu kecuali Tuhan Yang memelihara langit dan bumi sebagai bukti-bukti yang nyata\" (Al-Isra:102). Maka dapat diketahui bahwa dia telah berbuat zhalim saat mengajak berdebat. Niatannya hanyalah untuk meraih ketinggian derajat di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 52: Maksudnya, Lauh Mahfuzh. Dia menghitung secara teliti amal mereka, baik atau buruk dan mencatatnya dalam Lauh Mahfuzh yang kemudian akan diberi-Nya balasan pada hari kiamat. Maksud jawaban Musa ini adalah, bahwa umat-umat terdahulu itu sudah mengerjakan yang telah mereka kerjakan dan mereka tinggal menunggu pembalasan, oleh karena itu tidak ada gunanya kamu bertanya tentang mereka wahai Fir’aun! Mereka adalah umat yang telah berlalu, balasan untuknya sesuai apa yang dia kerjakan dan dosanya akan mereka tangung. Jika dalil yang kami kemukakan dan ayat yang kami perlihatkan itu sudah membuktikan kebenaran kami dan seperti itulah kenyataannya, maka tunduklah kepada kebenaran dan tinggalkanlah kekafiran dan kezaliman serta terlalu banyak membantah dengan kebatilan. Jika engkau masih meragukannya, maka pintu untuk mengkajinya tidaklah tertutup dan jalannya terbuka, inilah maksud jawaban Musa ‘alaihis salam, wallahu a’lam. Kemudian Nabi Musa ‘alaihis salam melanjutkan dengan menyebutkan nikmat-nikmat yang diberikan Allah dan ihsan-Nya sebagaimana dijelaskan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 52",
    "description": "Nabi musa menjawab pertanyaan fir'aun, 'pengetahuan tentang itu secara rinci hanya ada pada tuhanku. Hanya dia yang mengetahuinya. Semua hal yang berkaitan dengan makhluk tercatat di dalam sebuah kitab, yaitu lauh mahfuz. Tuhanku tidak akan pernah salah ataupun lupa pada apa pun yang terjadi di alam semesta ini. 53. Wahai fir'aun, Allah adalah tuhan yang telah menjadikan bumi sebagai hamparan bagimu, juga bagi seluruh manusia, dan menjadikan jalanjalan yang rata dan lebar di atasnya bagimu agar kamu mudah bepergian, dan dia pula yang menurunkan air hujan dari langit untuk menyuburkan tanah di sekitarmu. ' Allah beralih menggunakan kalimat langsung dari- nya, 'kemudian, kami tumbuhkan dengannya, yakni dengan air hujan itu, berjenis-jenis tumbuh-tumbuhan dengan beragam bentuk, rasa, dan kegunaan."
  }
]