[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia-lah yang menjadikan bagi kalian bumi yang mudah dimanfaatkan oleh kalian. Dan Dia menjadikan di dalamnya jalan-jalan yang banyak, dan menurunkan air hujan dari langit. Kemudian Dia mengeluarkan dengan air hujan itu berbagai macam tumbuhan yang berbeda-beda."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Tuhan yang telah menjadikan bumi sebagai hamparan agar kalian bisa hidup di atasnya, dan menjadikan jalan-jalan yang pantas dilalui agar kalian bisa berjalan di atasnya, dan menurunkan air hujan dari langit.\" Lalu dengan air itu Kami tumbuhkan berbagai jenis aneka tumbuh-tumbuhan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. الَّذِى جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا (Yang telah menjadikan bagimu bumi sebagai hamparan) Seperti Kasur yang dihamparkan sehingga kalian dapat hidup di atasnya dengan penuh kemudahan. وَسَلَكَ لَكُمْ فِيهَا سُبُلًا(dan Yang telah menjadikan bagimu di bumi itu jalan-ja]an) Yakni jalan-jalan yang dimudahkan untuk kalian lalui. وَأَنزَلَ مِنَ السَّمَآءِ مَآءً(menurunkan dari langit air hujan) Yakni air hujan. فَأَخْرَجْنَا بِهِۦٓ أَزْوٰجًا مِّن نَّبَاتٍ شَتَّىٰ( Maka Kami tumbuhkan dengan air hujan itu berjenis-jenis dari tumbuh-tumbuhan yang bermacam-macam) Yakni berbagai jenis tumbuhan yang berbeda-beda."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Dzat yang menciptakan untuk kalian bumi yang terhampar layaknya kasur supaya bisa hidup di atasnya dengan mudah, dan memudahkan untuk kalian jalan yang bisa kalian lewati dari satu tanah menuju tanah lainnya supaya kalian bisa mendapatkan manfaatnya. Serta menurunkan hujan dari langit (awan), lalu dengan hujan itu Kami menumbuhkan berbagai jenis tumbuhan yang berbeda-beda warna, rasa dan aromanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang telah menjadikan bumi untuk kalian sebagai hamparan} hamparan yang bisa kalian gunakan untuk tinggal {dan meratakan} dan menjadikan {di atasnya bagimu jalan-jalan} jalan-jalan yang bisa kalian lewati {serta menurunkan air dari langit” Kemudian Kami menumbuhkan dengannya bermacam-macam} bermacam-macam {tumbuh-tumbuhan yang berbeda} yang berbeda dalam segi rasa, warna, aroma, bentuk, dan manfaatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Selanjutnya, Allah mengalihkan tentang dalil yang absolut, dengan menyebutkan kenikmatan dan curahan kebaikanNya yang sangat urgen. Allah berfirman, “(Allah) Yang telah menjadikan bagimu bumi sebagai hamparan,” yaitu sebagai tempat pijakan yang kalian dapat beristirahat padanya, bertempat tinggal, membangun, menanam, dan membajak tanah untuk lahan pertanian dan fungsi lainnya. Dia telah menundukkan bumi bagi kalian, dan tidak menjadikannya menolak salah satu dari kemaslahatan kalian. “Dan yang telah menjadikan bagimu di bumi itu jalan-jalan,” maksudnya membuka jalur-jalur yang menghubungkan antara satu daerah menuju daerah lain, dari satu wilayah ke wilayah lain. Akhirnya, orang-orang sanggup mencapai seluruh (penjuru) bumi dengan cara yang termudah. Mereka berhasil mendapatkan manfaat-manfaat yang lebih banyak melalui perjalanan jauh (yang mereka tempuh) ketimbang manfaat yang mereka raih saat berasa di daerah sendiri. “Dan menurunkan dari langit air hujan. Maka Kami tumbuhkan dengan air hujan itu berjenis-jenis tumbuh-tummbuhan yang bermacam-macam,” maksudnya Dia menurunkan air hujan, kemudian menghidupkan bumi setelah kegersangannya. Dengan air itu, DIa menumbuhkan seluruh jenis tetumbuhan dengan berbagai perbedaan ragamnya, bentuk yang bermacam-macam dan perbedaan karakternya. Dia mendatangkan, menetapkan, dan memudahkannya sebagai rizki bagi kita sekalian dan bagi hewan-hewan piaraan kita. Sekiranya tidak ada air hujan, tentulah para penghuni permukaan bumi akan binasa, baik dari kalangan manusia maupun hewan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 53: Sehingga meskipun bulat, kamu dapat tinggal dan menetap di sana, mendirikan bangunan dan menggarap tanahnya. Dari tempat yang satu ke tempat yang lain, dari daerah yang satu ke daerah yang lain, dsb. Sehingga mereka dapat pergi ke daerah yang jauh dengan mudah. Sebagai rezeki untuk kita dan hewan ternak kita. Jika tidak ada tumbuhan, tentu manusia dan hewan tidak dapat makan dan akan binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 53",
    "description": "Wahai fir'aun, Allah adalah tuhan yang telah menjadikan bumi sebagai hamparan bagimu, juga bagi seluruh manusia, dan menjadikan jalanjalan yang rata dan lebar di atasnya bagimu agar kamu mudah bepergian, dan dia pula yang menurunkan air hujan dari langit untuk menyuburkan tanah di sekitarmu. ' Allah beralih menggunakan kalimat langsung dari- nya, 'kemudian, kami tumbuhkan dengannya, yakni dengan air hujan itu, berjenis-jenis tumbuh-tumbuhan dengan beragam bentuk, rasa, dan kegunaan. 54. Kami telah menganugerahkan kepadamu berjenis-jenis tetumbuhan, maka makanlah dan gembalakanlah hewan-hewanmu. Sesungguhnya pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang yang berakal."
  }
]