[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan makanlah (wahai sekalian manusia) dari apa-apa yang baik-baik yang telah Kami tumbuhkan bagi kalian, dan gembalakanlah hewan-hewan dan ternak-ternak kalian. Sesungguhnya pada hal-hal yang disebutkan itu benar-benar terdapat tanda-tanda yang menunjukkan Kuasa Allah dan seruan untuk mengesakan Allah (dalam Dzat dan SifatNya) dan mengesakanNya dengan ibadah bagi orang yang memiliki akal yang selamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Makanlah -wahai manusia- dari makanan yang baik yang Kami berikan kepadamu, dan gembalakanlah hewan ternak kalian, karena sungguh pada aneka nikmat yang Kami sebutkan itu pasti terdapat tanda-tanda kekuasaan dan keesaan Allah bagi orang-orang yang berakal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-55. Hai Manusia, makanlah buah-buahan ini dan gembalakanlah hewan ternak kalian agar dapat memakan rerumputannya. Sungguh dalam karunia yang besar ini terdapat tanda-tanda yang jelas atas keesaan dan keagungan Allah bagi orang-orang yang berakal sehat. Kami telah menciptakan Adam dan keturunannya dari tanah, dan mereka akan kembali ke tanah setelah kematian mereka, kemudian Kami akan mengeluarkan mereka darinya sekali lagi dalam keadaan hidup untuk menjalani hari kebangkitan dan perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. كُلُوا۟ وَارْعَوْا۟ أَنْعٰمَكُمْ ۗ (Makanlah dan gembalakanlah binatang-binatangmu) Allah memberi karunia-Nya dengan menciptakan tumbuh-tumbuhan dengan berbagai jenisnya yang baik bagi manusia dan binatang ternak. إِنَّ فِى ذٰلِكَ لَاٰيٰتٍ لِّأُو۟لِى النُّهَىٰ( Sesungguhnya pada yang demikian itu, terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang berakal) Yakni orang-orang yang memiliki akal yang sehat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Makanlah kalian dari tumbuhan-tumbuhan itu dan peliharalah hewan-hewan ternak kalian dengannya. Sesungguhnya dalam sesuatu yang disebutkan disini menunjukkan kepada keesaan Allah dan kekuasaanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Makanlah dan peliharalah hewan-hewan ternak kalian, Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi orang-orang yang berakal} orang-orang yang berakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Karena itu, Allah berfirman, “Makanlah dan gembalakanlah binatang-binatangmu.” Allah mengemukakan perintah ini dalam bentuk penyebutan nikmat-nikmatNya, agar hal tersebut menunjukkan bahwa hukum asal pada segala tanaman adalah ibahah (boleh), sehingga tidaklah haram darinya kecuali hal-hal yang berbahaya, semisal racun dan lainnya. “Sesungguhnya pada yang demikian itu, terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang berakal,” maksudnya, bagi orang yang memiliki akal-akal yang matang, dan pikiran-pikiran yang lurus, terdapat tanda-tanda keutamaan, limpahan kebaikan, rahmat, luasnya kedermawananNya dan kesempurnaan perhatianNya. (JUga menunjukkan bahwa) Dia-lah Dzat yang menguasai yang berhak disembah, memiliki lagi Terpuji, yang tiada satu Dzat pun yang berhak meneriima ibadah selainNYa. Juga tidak berhak dengan pujian, sanjungan, dan kekaguman kecuali Dzat yang telah mencurahkan nikmat-nikmat ini. (Dan menunjukkan pula bahwa) Dia Mahakuasa atas segala sesuatu, sebagaimana DIa Dzat Yang Menghidupkan bumi setelah kondisi gersangnya. Sesungguhnya Dzat tersebut benar-benar berkuasa menghidupkan orang-orang yang berakal dengan hal itu, karena merekalah orang-orang yang berhasil meraup kemanfaatan darinya, yang memandangnya dengan pandangan serius. Sementara itu, orang-orang selain mereka, maka mereka berada pada level binatang-binatang ternak yang lepas dan hewan-hewan piaraan yang dilepas di tempat gembalaan. Mereka tidak menyaksikannya dengan pandangan orang yang mau berpikir. Hati nurani mereka tidak menembus inti maksudnya. Ciri mereka serupa dengan hewan-hewan ternak;makan, minum (dan sebagainya), akan tetapi hati mereka lalai dan fisik-fisik mereka berpaling, \"Dan banyak sekali tanda-tanda (kekuasaan Allah) di langit dan di bumi yang mereka melaluinya, sedang mereka berpaling daripadanya.\" (Yusuf:105)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 54: Susunan ayat ini nampaknya menunjukkan karunia-Nya kepada manusia. Ayat ini menunjukkan bahwa hukum asal semua tumbuhan adalah mubah, sehingga tidak ada yang haram selain yang membahayakan seperti racun, ganja, dsb. Demikian pula menunjukkan karunia Allah, ihsan-Nya, rahmat-Nya, luasnya kepemurahan-Nya, perhatian-Nya, dan menunjukkan bahwa hanya Allah-lah Tuhan yang berhak disembah satu-satunya, dan yang berhak mendapat pujian dan sanjungan, dan bahwa Dia Mahakuasa atas segala sesuatu. Di samping itu, dihidupkan-Nya tanah yang sebelumnya mati menunjukkan bahwa Dia mampu menghidupkan orang-orang yang telah mati. Akal disebut “nuha” karena ia melarang pemiliknya dari mengerjakan perbuatan buruk. Dikhususkan kepada orang-orang yang berakal, karena hanya mereka yang dapat mengambil manfaat dan pelajaran darinya, di mana mereka memandangnya dengan pandangan yang disertai pengambilan pelajaran. Adapun selain mereka, maka tidak ubahnya seperti hewan ternak, melihat tanpa mengambil pelajaran, pandangan mereka tidak sampai mengetahui maksud daripadanya, bahkan yang mereka peroleh sebagaimana yang diperoleh binatang ternak yaitu bersenang-senang semata; hanya makan dan minum, sedangkan hati mereka lalai dan badan mereka berpaling. Allah Subhaanahu wa Ta'aala berfirman, ”Dan banyak sekali tanda-tanda (kekuasaan Allah) di langit dan di bumi yang mereka lalui, sedang mereka berpaling daripadanya.” (Terj. Yusuf: 105)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 54",
    "description": "Kami telah menganugerahkan kepadamu berjenis-jenis tetumbuhan, maka makanlah dan gembalakanlah hewan-hewanmu. Sesungguhnya pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang yang berakal. 55. Kami hamparkan tanah untuk kamu. Sesungguhnya darinya kami menciptakan kamu, wahai fir'aun dan seluruh manusia, dan kepadanyalah kami akan mengembalikan kamu setelah mati, dan dari sanalah pula kami akan mengeluarkan kamu pada waktu yang lain, yaitu pada hari kebangkitan. '."
  }
]