[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dari bumi Kami menciptakan kalian (wahai sekalian manusia) dan kedalamnya Kami akan mengembalikan kalian setelah kematian kalian, dan dari dalam bumi, Kami akan mengeluarkan kalian hidup-hidup dalam kehidupan yang lain lagi untuk menghadapi proses perhitungan amal perbuatan dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dari tanah bumi inilah Kami menciptakan nenek moyang kalian yaitu Adam -'alaihissalām-, dan kepada tanah itulah Kami akan mengembalikan kalian ketika kalian mati, dan darinyalah Kami akan mengeluarkan kalian pada kali yang lain untuk dibangkitkan pada hari Kiamat kelak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. مِنْهَا خَلَقْنٰكُمْ (Dari bumi (tanah) itulah Kami menjadikan kamu) Yakni dari tanah Kami ciptakan kalian dalam lingkup penciptaan Adam. وَفِيهَا (dan kepadanya) Yakni pada tanah itu. نُعِيدُكُمْ (Kami akan mengembalikan kamu) Setelah kematian kalian akan dikubur di dalamnya, kemudian tubuh kalian akan hancur sampai menjadi bagian dari tanah. وَمِنْهَا (dan daripadanya) Yakni dari tanah. نُخْرِجُكُمْ تَارَةً أُخْرَىٰ (Kami akan mengeluarkan kamu pada kali yang lain) Yang membangkitkan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Pada dasarnya Kami menciptakan kalian dari tanah, karena sesungguhnya tanah adalah asal mula penciptaan Adam. Dan ke dalam tanah pula Kami mengembalikan kalian setelah mati dengan dikuburkan di dalamnya. Serta dari bumi juga Kami membangkitkan kalian untuk kesekian kalianya untuk dihisab dan dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Darinya} dari tanah itu {Kami menciptakan kalian, dan kepadanyalah Kami akan mengembalikan kalian} dan Kami akan mengembalikan kalian dengan dikubur ketika mati {dan dari sanalah Kami akan mengeluarkanmu pada waktu} pada kali {yang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Sesudah Allah menceritakan kemuliaan bumi dan bagusnya cara syukurnya, karena Allah telah mencurahkan air hujan di atas permukaannya dan bahwa ia dengan izin Rabbnya mampu mengeluarkan tumbuh-tumbuhan yang beragam jenisnya, maka (dalam ayat ini) Dia memberitahukan bahwa Dia-lah yang menciptakan kita berasal dari tanah, di situ pula, Allah mengembalikan (penciptaan) kita setelah kita meninggal dunia dan dikuburkan di dalamnya. Dari sanalah Allah membangkitkan kita “pada kali yang lain,” sebagaimana Dia telah mengadakan keberadaan kita dari tanah dari ketiadaan wujud (sebelumnya), dan kita sudah mengetahui dan membuktikannya, Dia akan mengembalikan kita (lagi) dengan membangkitkan kita darinya pasca kematian kita. Guna memberikan balasan kepada kita berdasarkan amalan-amalan yang kita kerjakan di atas permukaan bumi. Inilah dua dalil logis bagi datangnya saat pengembalian (penciptaan manusia setelah mati) : Yaitu Allah mengeluarkan tanaman dari bumi setelah kegersangannya dan mengeluarkan orang-orang mukallaf dari tanah saat menciptakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 55: Dengan dikubur dalam tanah setelah mati. Untuk dibangkitkan. Ayat 53 dan 55 menunjukkan Allah Mahakuasa menghidupkan kembali, sebagaimana Dia berkuasa menghidupkan tanah yang mati dan menciptakan mereka darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 55",
    "description": "Kami hamparkan tanah untuk kamu. Sesungguhnya darinya kami menciptakan kamu, wahai fir'aun dan seluruh manusia, dan kepadanyalah kami akan mengembalikan kamu setelah mati, dan dari sanalah pula kami akan mengeluarkan kamu pada waktu yang lain, yaitu pada hari kebangkitan. '56. Meski mendapat bukti nyata yang menguatkan dakwah nabi musa, fir'aun tetap enggan beriman. Dan sungguh, kami telah memperlihatkan kepadanya tanda-tanda kebesaran dan kekuasaan kami semuanya. Namun, ternyata dia keras kepala dan terus mendustakan dan enggan menerima kebenaran. Ia pun tidak mau patuh pada risalah yang disampaikan kepadanya."
  }
]