[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami telah mempertontonkan kepada Fir’aun bukti-bukti dan hujjah-hujjah Kami seluruhnya yang menunjukkan uluhiyah dan Kuasa Kami serta kebenaran risalah Musa. Tapi dia mendustakannya dan menolak untuk menerima kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan sungguh Kami telah perlihatkan kepada Fir'aun sembilan tanda-tanda kebesaran Kami, dan ia pun menyaksikannya namun ternyata ia mendustakannya dan enggan untuk menerima ajakan beriman kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Dengan keagungan dan kebesaran Kami, Kami memperlihatkan Fir’aun dengan jelas segala ayat dan mukjizat Kami yang dibawa oleh Musa, namun dia mendustakan semuanya dan enggan menerima dakwah Musa; dia mengingkarinya dan menuduhnya sebagai tukang sihir. Dia berkata: “Apakah kamu mendatangi kami agar dapat mengusir kami dari negeri Mesir dengan sihirmu sehingga Mesir dapat menjadi kerajaanmu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَلَقَدْ أَرَيْنٰهُ ءَايٰتِنَا كُلَّهَا (Dan sesungguhnya Kami telah perlihatkan kepadanya (Fir’aun) tanda-tanda kekuasaan Kami semuanya) Yakni Sembilan mukjizat yang telah disebutkan. فَكَذَّبَ وَأَبَىٰ (maka ia mendustakan dan enggan) Yakni enggan menerima seruan Musa menuju keimanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Dan sungguh Kami telah memperlihatkan kepada Fir’aun semua ayat yang jumlahnya sembilan itu yang menunjukkan kepada kenabian Musa. Lalu Fir’aun mendustakannya dan enggan untuk beriman dan menaati Allah karena keangkuhan dan kekerasannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah memperlihatkan kepadanya} Kami telah memperlihatkan kepada Fir‘aun {tanda-tanda Kami semuanya. Lalu dia mendustakan dan enggan} menolak untuk beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Allah memberitahukan bahwa Dia telah mempertontonkan kepada Fir’aun seluruh jenis ayat-ayat (tanda-tanda kebesaran Allah) dan pelajaran-pelajaran serta petunjuk-petunjuk yang sangat akkurat yang bersifat jasmani, rohani, dan astrologis, (tapi) dia tidak memperbaiki diri dan tidak jera, justru mendustakan dan berpaling. Mendustakan berita wahyu dan memalingkan diri dari perintah Allah, menyulap kebenaran menjadi kebatilan dan kebatilan menjadi kebenaran, melancarkan perdebatan untuk menyesatkan umat manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 56: Tanda-tanda tersebut menunjukkan kenabian Musa ‘alaihis salam. Allah memperlihatkan sembilan tanda kepada Fir’aun sebagaimana di surah Al Isra': 101. Pada pertemuan pertama antara Nabi Musa ‘alaihis salam dengan Fir'aun, yang diperlihatkan hanya dua, yaitu tongkat Nabi Musa ‘alaihis salam menjadi ular dan tangannya menjadi putih cemerlang. Di ayat ini, Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia telah menunjukkan kepada Fir’aun ayat-ayat-Nya, sesuatu yang dapat diambil ibrah (pelajaran) dan berbagai bukti, akan tetapi Fir’aun mendustakan dan berpaling, menjadikan yang hak sebagai yang batil, dan yang batil sebagai yang hak serta membantah kebenaran dengan kebatilan untuk menyesatkan manusia. Yakni mendustakan ayat-ayat itu dan menganggapnya sebagai sihir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 56",
    "description": "Meski mendapat bukti nyata yang menguatkan dakwah nabi musa, fir'aun tetap enggan beriman. Dan sungguh, kami telah memperlihatkan kepadanya tanda-tanda kebesaran dan kekuasaan kami semuanya. Namun, ternyata dia keras kepala dan terus mendustakan dan enggan menerima kebenaran. Ia pun tidak mau patuh pada risalah yang disampaikan kepadanya. 57. Kesombongan telah mendorong fir'aun mengabaikan peringatan nabi musa. Dia berkata, 'apakah engkau datang kepada kami untuk mengusir kami dari negeri kelahiran kami sendiri, yaitu mesir, dengan sihirmu itu, wahai musa'."
  }
]