[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata, “Apakah kamu datang kepada kami (wahai Musa) untuk mengusir kami dari negeri-negeri kami dengan sihirmu ini?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Fir'aun berkata, \"Apakah engkau datang kepada kami dengan tujuan mengusir kami dari negeri Mesir dengan perantaraan sihirmu itu -wahai Musa- agar kerajaan Mesir itu menjadi milikmu sendiri?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. قَالَ أَجِئْتَنَا لِتُخْرِجَنَا مِنْ أَرْضِنَا بِسِحْرِكَ يٰمُوسَىٰ (Berkata Fir’aun: “Adakah kamu datang kepada kami untuk mengusir kami dari negeri kami (ini) dengan sihirmu, hai Musa?) Yakni Wahai Musa kamu datang membawa tongkat yang dapat berubah menjadi ular, dan ini adalah bagian dari sihir, sehingga orang-orang mengira kamu adalah nabi yang harus diikuti, dengan begitu kamu dapat menguasai negeri kami dan mengusir kami darinya. Fir’aun yang terlaknat itu menyebutkan pengusiran dari negeri agar menjauhkan kaumnya supaya tidak mengikuti Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Fir’aun berkata: “Apakah Kamu datang kepada kami dengan mengubah tongkat menjadi ular dan tangan yang bersinar yang merupakan jenis sihir supaya kamu berkuasa atas tanah kami, Mesir dan mengusir kami darinya lalu menjadi raja di dalamnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Fir’aun berkata {“Apakah kamu datang kepada kami untuk mengusir kami dari negeri kami dengan sihirmu, wahai Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Dia berkata, “Adakah kamu datang kepada kami untuk mengusir kami dari negeri kami (ini) dengan sihirmu,” dia mengklaim bahwa tanda-tanda kebesaran Allah (mukjizat-mukjizat itu) yang diperlihatkan Musa kepadanya merupakan bentuk sihir dan kepalsuan belaka, yang ditujukan untuk mengusir merekka dari tanah mereka dan menguasai (tanah) nya, agar perkataannya menorehkan pengaruh di hati orang-orang. Sesungguhnya tabiat manusia condong menyukai tanah kelahirannya, sulit untuk keluar meninggallkannya. Lalu Fir’aun memberitahukan kepada mereka bahwa Musa hendak mewujudkannya, agar mereka membenci Musa dan menyiapkan usaha untuk melawannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 57: Yaitu Mesir, sehingga kerajaan beralih untukmu. Ucapan Fir’aun ini adalah untuk mengelabui rakyatnya, agar ia mendapat dukungan kuat dari mereka sehingga Musa dimusuhi dan dibenci oleh semua rakyatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 57",
    "description": "Kesombongan telah mendorong fir'aun mengabaikan peringatan nabi musa. Dia berkata, 'apakah engkau datang kepada kami untuk mengusir kami dari negeri kelahiran kami sendiri, yaitu mesir, dengan sihirmu itu, wahai musa'58. Bila itu tujuanmu, maka kami pun pasti akan mendatangkan sihir semacam itu kepadamu. Kami akan mengumpulkan para penyihir andal untuk mengalahkanmu. Maka, wahai musa, buatlah suatu perjanjian untuk pertemuan antara kami dan engkau. Tentukanlah waktu dan tempat pertemuan itu. Mari kita buat kesepakatan yang kami tidak akan menyalahinya dan tidak pula engkau. Adakanlah pertemuan itu di suatu tempat yang terbuka sehingga tidak menyulitkan salah satu pihak dari kita atau orang-orang yang ingin menonton. '."
  }
]