[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami akan mendatangkan kepadamu sihir yan serupa dengan sihirmu. Maka buatkanlah waktu pertemuan yang ditentukan antara kami dan kamu, yang tidak kami pungkiri dan tidak kamu ingkari di satu tempat yang lapang lagi netral antara kami dan kamu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Maka kami pasti akan mendatangkan kepadamu -wahai Musa- suatu sihir seperti sihirmu, maka buatlah suatu perjanjian untuk pertemuan antara kami dan engkau dengan waktu dan tempat yang ditentukan, yang mana kami tidak akan menyalahinya dan engkau pun tidak menyalahinya, dan hendaknya tempat itu merupakan tempat terbuka lagi pertengahan antara dua kelompok.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58-59. Kemudian Fir’aun menegaskan ancamannya dengan penuh keangkuhan: “Sungguh kami akan mendatangkan sihir kepadamu yang serupa dengan sihirmu, maka tetapkanlah waktu dan tempat tertentu yang dapat kita sepakati untuk bertemu.” Maka Musa memilih hari berkumpulnya orang-orang agar dia dapat menunjukkan kebenaran kepada mereka, dia berkata: “Waktu pertemuan kita adalah pada hari raya yang kalian gunakan untuk berkumpul dan berhias, dan hendaklah orang-orang berkumpul setelah matahari mulai tinggi agar mereka dapat menyaksikan dengan jelas.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. فَلَنَأْتِيَنَّكَ بِسِحْرٍ مِّثْلِهِۦ (Dan kamipun pasti akan mendatangkan (pula) kepadamu sihir semacam itu) Yakni kami akan melawanmu dengan sihir seperti yang kamu bawa. فَاجْعَلْ بَيْنَنَا وَبَيْنَكَ مَوْعِدًا(maka buatlah suatu waktu untuk pertemuan antara kami dan kamu) Yakni di waktu dan tempat yang ditentukan. لَّا نُخْلِفُهُۥ (yang kami tidak akan menyalahinya) Yakni kami tidak akan menyalahi pentemuan itu. نَحْنُ وَلَآ أَنتَ (dan tidak (pula) kamu) Fir’aun membiarkan Musa yang menentukan waktu dan tempat pertemuan itu untuk menunjukkan kesempurnaan kuasanya. مَكَانًا سُوًى (di suatu tempat yang pertengahan) Yakni tempat yang tinggi dan rata agar kebenaran dapat terlihat dengan jelas. Pendapat lain mengatakan maknanya adalah tempat yang berada di pertengahan antara tempat Musa dan Fir’aun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Maka sungguh kami akan datangkan kepadamu sihir serupa untuk melawanmu. Maka tentukanlah hari dan tempat tertentu di antara kita, yaitu hari pertemuan. Kami tidak akan mengingkari janji itu, tidak juga kamu, di tengah-tengah antara dua kelompok, atau di tempat datar yang disaksikan oleh seluruh orang yang hadir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kami juga akan mendatangkan sihir semacam itu kepadamu. Buatlah antara kami dan kamu suatu perjanjian} waktu yang ditentukan dan perjanjian {yang tidak akan dilanggar oleh kami dan dirimu di suatu tempat pertengahan} tempat yang seimbang di tengah-tengah antara kami dan kamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “Dan kami pun pasti akan mendatangkan (pula) kepadamu sihir semacam itu,” serupa dengan sihirmu. Berilah kami kesempatan dan tentukanlah untukku, “suatu waktu untuk pertemuan antara kami dan kamu, yang kami tidak akan menyalahinya dan tidak pula kamu di suatu tempat yang pertengahan (letaknya),” tempat yang netral, pengetahuan kami dan pengetahuanmu sama tentangnya. Atau tempat yang datar lagi rata, supaya kita dapat menyaksikan apa saja yang ada di sana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 58: Untuk menandinginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 58",
    "description": "Bila itu tujuanmu, maka kami pun pasti akan mendatangkan sihir semacam itu kepadamu. Kami akan mengumpulkan para penyihir andal untuk mengalahkanmu. Maka, wahai musa, buatlah suatu perjanjian untuk pertemuan antara kami dan engkau. Tentukanlah waktu dan tempat pertemuan itu. Mari kita buat kesepakatan yang kami tidak akan menyalahinya dan tidak pula engkau. Adakanlah pertemuan itu di suatu tempat yang terbuka sehingga tidak menyulitkan salah satu pihak dari kita atau orang-orang yang ingin menonton. '59. Nabi musa tidak gentar menghadapi tantangan fir'aun. Dia berkata, 'kesepakatan yang menyangkut waktu untuk pertemuan kami dengan para penyihirmu itu ialah pada hari raya, di tempat kamu dan rakyatmu biasa berkumpul, dan hendaklah orang-orang dikumpulkan pada pagi hari supaya mereka dapat menyaksikan sejak awal. '."
  }
]