[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada Fir’aun, “Waktu pertemuan kalian (dengan kami) adalah pada hari raya, ketika orang-orang berdandan menghiasi diri dan kemudian mereka berkumpul dari seluruh penjuru dan sudut kota pada waktu Dhuha.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Musa -'alaihissalām- berkata kepada Fir'aun, \"Perjanjian waktu untuk pertemuan kami dengan kalian ialah pada hari raya tatkala manusia berkumpul untuk melakukan pesta hari raya mereka pada waktu duha (pagi hari).\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. قَالَ مَوْعِدُكُمْ يَوْمُ الزِّينَةِ (Berkata Musa: “Waktu untuk pertemuan (kami dengan) kamu itu ialah di hari raya) Pertemuan itu diadakan pada hari raya, hari saat mereka berhias, sehingga mereka berkumpul semuanya, agar seruan Musa dapat diketahui. وَأَن يُحْشَرَ النَّاسُ ضُحًى(dan hendaklah dikumpulkan manusia pada waktu dhuha) Agar cahaya bersinar terang sehingga mereka tidak meragukan mukjizatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Musa berkata: “Janji pertemuan itu adalah pada hari raya yang masyhur yang mana kalian menghias diri saat itu.” Musa menentukan hari itu karena merupakan waktu senggang manusia dan merupakan waktu berkumpulnya mereka semua, dan agar mereka dikumpulkan di waktu dhuha, yaitu setelah terbit dan meningginya matahari, supaya bisa melihat dengan jelas dan mereka tidak meragukan mukjizat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa berkata kepada mereka {“Waktu kalian adalah hari raya} hari raya {dan hendaklah orang-orang dikumpulkan} dikumpulkan {pada waktu dhuha”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Musa berkata, “Waktu untuk pertemuan (kami dengan) kamu itu ialah di hari raya,” hari perayaan mereka yang mereka sedang kosong tanpa pekerjaan dan menghentikan kesibukan-kesibukan mereka padanya “dan hendaklah dikumpulkan manusia pada waktu matahari sepenggalahan naik,” maksudnya mereka semua dihimppun jadi satu di waktu dhuha. Musa memilh hari raya dan waktu pagi hari, karena banyaknya kerumunan orang dan penglihatan terhadap segala sesuatu sesuai dengan aslinya, yang tidak terpenuhi pada waktu lainnya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 59: Di mana ketika itu mereka berhias dan berkumpul serta berlibur dari kesibukan mereka. Yakni penduduk Mesir. Untuk menyaksikan apa yang akan terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 59",
    "description": "Nabi musa tidak gentar menghadapi tantangan fir'aun. Dia berkata, 'kesepakatan yang menyangkut waktu untuk pertemuan kami dengan para penyihirmu itu ialah pada hari raya, di tempat kamu dan rakyatmu biasa berkumpul, dan hendaklah orang-orang dikumpulkan pada pagi hari supaya mereka dapat menyaksikan sejak awal. '60. Kesepakatan untuk mengadu mukjizat musa dengan sihir para penyihir fir'aun terjalin. Maka fir'aun meninggalkan tempat pertemuan itu, lalu dengan segera dia mengatur tipu dayanya untuk mengalahkan nabi musa. Setelah waktu yang disepakati tiba, kemudian dia datang kembali bersama para penyihir dan orang-orang yang akan menyaksikan peristiwa tersebut."
  }
]