[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "BagiNya semua yang ada di langit, segala yang ada di bumi dan dan apa-apa yang ada di antara keduanya serta semua yang ada di bawah bumi, sebagai ciptaan, kepunyaan dan di bawah pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Milik-Nya lah segala apa yang ada di langit, yang ada di bumi, dan yang ada di bawah tanah berupa makhluk-makhluk, Dia lah yang menciptakan, menguasai dan mengatur urusan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Milik-Nya kerajaan tujuh langit dan apa yang ada di tujuh bumi dan apa yang ada di antara keduanya, serta apa yang ada di bawah tanah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَمَا تَحْتَ الثَّرَىٰ (dan semua yang di bawah tanah) Yakni segala yang ada di bawah tanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sang Maha Pengasih yang merajai dan mengatur setiap sesuatu yang ada di langit, bumi dan makhluk-makhluk yang ada di antara keduanya, serta apa yang ada di dalam perut bumi berupa mineral dan makhluk-makhluk lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah apa yang ada di langit, apa yang ada di bumi, apa yang ada di antara keduanya, dan apa yang ada di bawah tanah} tanah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “KepunyaanNya-lah semua yang ada di langit, semua yang di bumi, dan semua yang di antara keduanya,” berupa malaikat, manusia, jin, binatang, benda-benda mati, tanaman “dan apa yang berada di bawah tanah,” di bawah bumi, semuanya milik Allah, sebagai hamba yang diatur tunduk di bawah keputusan dan aturanNya. Tidak ada secuil pun hak kepemilikan bagi mereka. Mereka tidak mempunyai daya untuk menciptakan kebaikan, bahaya, kematian, kehidupan, dan kebangkitan bagi diri mereka sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 6: Seperti malaikat, manusia, jin, hewan, benda mati, dan tumbuhan. Semuanya milik Allah Ta’ala, hamba-Nya yang diatur dan ditundukkan di bawah qadha’ dan tadbir(pengurusan)-Nya. Mereka tidak memiliki kerajaan sedikit pun, tidak berkuasa menarik manfaat, menimpakan bahaya, tidak mampu mematikan, menghidupkan dan tidak mampu membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 6",
    "description": "Allah adalah pencipta semua yang ada, karena itu milik-Nya lah apa saja yang ada di langit seperti matahari, bulan, dan planet, serta apa saja yang ada di bumi seperti tumbuhan, hewan, dan manusia, apa saja yang ada di antara keduanya seperti awan, dan apa saja yang ada di bawah tanah, seperti bahan tambang dan sumber mineral. 7. Dia mengetahui apa saja yang terjadi di alam semesta. Dan jika engkau mengeraskan ucapanmu saat menyampaikan sesuatu, sungguh dia mengetahui apa yang engkau ucapkan. Dia juga mengetahui apa saja yang rahasia atau yang sengaja kausembunyikan dalam hatimu, dan apa saja yang lebih tersembunyi, yang tidak kausadari dan tidak kauketahui lagi setelah lama mengendap di dasar hatimu."
  }
]