[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Fir’aun berpaling mengabaikan ajakan yang dibawa Musa kepadanya berupa kebenaran. Lalu dia mengumpulkan tukang-tukang sihirnya dan setelah itu dia datang pada waktu pertemuan (yang telah disepakati)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Maka Fir'aun meninggalkan tempat itu lalu mengatur dan mengumpulkan makar dan tipu dayanya. Kemudian ia datang pada waktu dan tempat yang telah ditentukan sebelumnya untuk mengadu kekuatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Kemudian Fir’aun berpaling dari Musa dengan penuh kemurkaan, lalu dia mulai mengundang para penyihir untuk menguatkan perlawanannya, dan dia mendatangkan mereka pada waktu yang telah ditentukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. فَجَمَعَ كَيْدَهُۥ (lalu mengatur tipu dayanya) Yakni Fir’aun mengatur sihir dan tipu daya serta mengumpulkan para tukang sihir. ثُمَّ أَتَىٰ( kemudian dia datang) Yakni datang ke pertemuan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Lalu Fir’aun membubarkan diri dari pertemuan itu dan mengumpulkan sesuatu yang hampir serupa dengannya, yaitu para penyihir dan alat perlengkapan mereka, kemudian memberikan janji untuk mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Fir‘aun berpaling} pergi {dan mengatur tipu dayanya} tipu daya dan muslihatnya {Kemudian dia datang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. “Maka Fir’aun meninggalkan (tempat itu), lalu mengatur tipu dayanya” maksudnya seluruh upaya yang dapat dia tempuh untuk memperdayai Musa dengannya. Maka dia mengutus orang di seluruh kota untuk mengumpulkan tukang-tukang sihir yang piawai dalam keahlian sihirnya. Pada waktu itu, praktik sihir begitu merata, dan pendalamannya sangat diminati. Ia pun berhasil mendatangkan tukang sihir dalam jumlah besar. Kemudian masing-masing dari mereka datang pada waktu yang sudah ditentukan. Pertemuan itu begitu padat, dihadari oleh kaum lelaki dan wanita., para petinggi, orang-orang bangsawan,rakyat awam, anak-anak kecil dan orang-orang tua. Mereka menghimbau orang-orang untuk ikut serta berkumpul. Dan mereka berkata, \"dan dikatakan kepada orang banyak: \"Berkumpullah kamu sekalian. semoga kita mengikuti ahli-ahli sihir jika mereka adalah orang-orang yang menang\" (Asy-Syuara: 39-40)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 60: Yang ia sanggupi, dan ia mengirimkan orang yang akan mengumpulkan para penyihir yang ahli di berbagai kota. Ketika itu, sihir sedang marak dan ilmu sihir disukai oleh manusia, maka terkumpullah para penyihir dalam jumlah banyak dan mereka pun hadir pada hari yang ditentukan. Pada hari itu, lapangan penuh dihadiri oleh kaum laki-laki dan wanita, para pembesar dan orang-orang terhormat, orang-orang awam, orang dewasa dan anak-anak. Setelah Fir'aun mengatur tipu dayanya, maka Fir'aun bersama pengikut-pengikutnya datang ke tempat yang ditentukan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 60",
    "description": "Kesepakatan untuk mengadu mukjizat musa dengan sihir para penyihir fir'aun terjalin. Maka fir'aun meninggalkan tempat pertemuan itu, lalu dengan segera dia mengatur tipu dayanya untuk mengalahkan nabi musa. Setelah waktu yang disepakati tiba, kemudian dia datang kembali bersama para penyihir dan orang-orang yang akan menyaksikan peristiwa tersebut. 61. Setelah berhadapan dengan para penyihir itu, nabi musa berkata kepada mereka, 'wahai para penyihir, celakalah kamu! janganlah kamu mengada-adakan kedustaan terhadap Allah, seperti menuhankan fir'aun, meremehkan rasul Allah, dan menganggap mukjizatku sebagai sihir. Ingatlah, nanti dia akan membinasakan kamu dengan azab yang sangat pedih. ' dan sungguh, akan rugi orang yang mengada-adakan kedustaan terhadap Allah."
  }
]