[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada para tukang sihir Fir’aun untuk menasihati mereka, “Waspadalah kalian. Janganlah kalian membuat-buat kedustaan atas Nama Allah, niscaya Dia akan memusnahkan dan membinasakan kalian sampai habis dengan siksaan yang berasal dariNya. Sesungguhnya amat merugi orang yang mengadakan kedustaan atas Nama Allah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Musa berkata menasihati para penyihir Fir'aun, \"Celakalah kalian, janganlah kalian mengada-adakan dusta terhadap Allah dengan menipu manusia lewat sihir kalian, sehingga nanti Dia akan membinasakan kalian dengan azab dari sisi-Nya, dan sungguh sangat merugi orang yang mengada-adakan kedustaan terhadap Allah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61-62. Setelah Musa berkumpul dengan mereka, dia mulai mengingatkan mereka kepada Allah dan memperingatkan mereka dari kebinasaan serta melarang mereka melakukan sihir dan kedustaan terhadap Allah karena dapat mendatangkan azab yang membinasakan mereka semua dan menjadikan mereka merugi di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. قَالَ لَهُم مُّوسَىٰ وَيْلَكُمْ لَا تَفْتَرُوا۟ عَلَى اللهِ كَذِبًا (Berkata Musa kepada mereka: “Celakalah kamu, janganlah kamu mengada-adakan kedustaan terhadap Allah) Yakni Musa berkata kepada Fir’aun dan para pengikutnya: “janganlah kalian membuat kebohongan dengan mengakui Fir’aun sebagai tuhan dan janganlah kalian menyekutukan Allah. فَيُسْحِتَكُم بِعَذَابٍ ۖ( maka Dia membinasakan kamu dengan siksa) Yakni menghabisi kalian semua dengan azab. وَقَدْ خَابَ مَنِ افْتَرَىٰ( Dan sesungguhnya telah merugi orang yang mengada-adakan kedustaan) Yakni celaka dan binasa orang yang berdusta terhadap Allah dengan kedustaan apapun itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَقَدْ خَابَ مَنِ ٱفْتَرَىٰ } \"Dan sesungguhnya telah merugi orang yang mengada-adakan kedustaan\" { وَكَذَٰلِكَ نَجْزِى ٱلْمُفْتَرِينَ } \"Demikianlah Kami memberi balasan kepada orang-orang yang membuat-buat kebohongan\" [ AL-A'raf : 12 ], inilah janji Allah untuk para pendusta dan sesungguhnya mereka benar-benar merugi, dan merupakan busyro bagi mereka yang terzhalimi dengan kedustaan para pendusta bahwasanya Allah menjadi penolong mereka selamanya; maka janganlah berputus asa, karena tidaklah berputus asa kecuali orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Musa berkata kepada para penyihir itu: “Celakalah kalian, yaitu Allah akan membinasakan kalian. Janganlah kalian mengarang kebohongan terhadap Allah dengan menganggap bahwa mukjizat pada tangan rasul adalah sihir, maka dia akan menumbangkan kalian dengan azab. Dan sungguh merugilah dan celakalah orang yang mereka-reka atau mendustakan Allah SWT”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata kepada mereka} Musa berkata kepada Fir’aun dan para penyihir {“Celakalah kalian. Janganlah mengada-adakan} membuat-buat {kebohongan terhadap Allah. Dia akan membinasakan kalian} Dia akan menumbangkan kalian {dengan azab. Sungguh rugi} merugi dan celaka {orang yang mengada-adakan} kebohongan terhadap Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61.Setelah tukang-tukang sihir berkumpul dari segenap wilayah, Musa menyampaikan nasihat kepada mereka dan menegakkan hujjah di hadapan mereka. Beliau mengatakan, “Celakalah kamu, janganlah kamu mengadakan kedustaan terhadap Allah, maka Dia membinasakan kamu dengan siksa,” maksudnya janganlah kalian mendukung kebatilan (yang kalian pegangi) dengan praktik sihir kalian dan berencana mempecundangi kebenaran, membuat kedustaan atas nama Allah. Akibatnya Allah akan menghabisi kalian sampai tak tersisa dengan siksa dari sisiNya, dan mengagalkan usaha dan kedustaan kalian. Akhirnya, kalian tidak dapat menggapai sesuatu yang kalian kehendaki berupa kemenangan dan jabatan di sisi Fir’aun dan para pembesarnya, serta kalian tidak lolos dari siksa Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 61: Ketika mereka semua berkumpul dari berbagai negeri untuk menyaksikan pertunjukan itu, maka Nabi Musa 'alaihis salam menasehati seperti yang disebutkan dalam ayat di atas dan menegakkan hujjah atas mereka. Yakni kepada para tukang sihir. Bisa maksudnya mengadakan sekutu bagi Allah, atau maksudnya membayangkan kepada manusia bahwa kalian dapat merubah sesuatu padahal sesungguhnya tidak, sehingga kamu sama saja berdusta terhadap Allah, atau maksudnya adalah, jangan menolong kebatilan dengan sihirmu untuk mengalahkan yang benar dan kamu sama saja berdusta terhadap Allah, sehingga Dia akan membinasakan kamu dengan azab dari sisi-Nya. Yakni harapanmu agar dapat menang dan memperoleh kedudukan di hadapan Fir’aun tidak akan kamu peroleh dan kamu pun tidak mendapatkan keselamatan dari azab Allah, sehingga kamu merugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 61",
    "description": "Setelah berhadapan dengan para penyihir itu, nabi musa berkata kepada mereka, 'wahai para penyihir, celakalah kamu! janganlah kamu mengada-adakan kedustaan terhadap Allah, seperti menuhankan fir'aun, meremehkan rasul Allah, dan menganggap mukjizatku sebagai sihir. Ingatlah, nanti dia akan membinasakan kamu dengan azab yang sangat pedih. ' dan sungguh, akan rugi orang yang mengada-adakan kedustaan terhadap Allah. 62. Peringatan nabi musa membuat sebagian penyihir ketakutan, sementara sebagian yang lain tetap tidak acuh. Maka mereka pun berbantah- bantahan tentang urusan mereka. Masing-masing mengemukakan pendapatnya terkait peringatan nabi musa dan cara menghadapinya, dan mereka merahasiakan percakapan mereka agar fir'aun dan para pembesarnya tidak mendengarnya."
  }
]