[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62-64. Maka para tukang sihir itu saling tarik menarik dalam urusan mereka dan berbicara dengan percakapan rahasia. Mereka berkata, “Sesungguhnya Musa dan Harun adalah tukang sihir yang ingin mengusir kalian dari negeri kalian melalui keahlian sihir mereka dan menyingkirkan keahlian sihir besar yang ada pada kalian. Maka matangkanlah strategi tipu daya kalian dan kuatkanlah tekad kalian untuk tujuan tersebut tanpa ada silang pendapat diantara kalian dan kemudian datanglah kalian dengan berbaris satu barisan, dan lemparkanlah apa yang ada di tangan kalian dengan serentak, agar kalian bisa membelalakkan mata semua manusia dan mengalahkan sihir Musa dan saudaranya (Harun). Sesungguhnya hari ini telah memenangkan keinginannya orang yang berada di atas lawannya, sehingga dapat mengalahkan dan mempercundanginya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Maka ketika para penyihir itu mendengar ucapan Musa -'alaihissalām-, mereka pun saling berbantah-bantahan dan berdebat secara sembunyi-sembunyi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. فَتَنٰزَعُوٓا۟ أَمْرَهُم بَيْنَهُمْ (aka mereka berbantah-bantahan tentang urusan mereka di antara mereka) Yakni para tukang sihir saling berselisih setelah mendengar perkataan Musa. وَأَسَرُّوا۟ النَّجْوَىٰ( dan mereka merahasiakan percakapan) Yakni mereka saling berbisik dan merahasiakannya dari Musa dengan perkataan mereka yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Kemudian para penyihir itu berdiskusi dan saling melihat satu sama lain serta saling berdebat terkait perkara Musa yang mereka dengarkan. Mereka saling berbisik dalam samar-samar terkait apa yang akan mereka lakukan terhadap Musa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berbantah-bantahan tentang urusan di antara mereka} lalu para penyihir saling melihat di antara mereka tentang perkara Musa {dan merahasiakan percakapannya} saling berbantah-bantahan dalam percakapan secara rahasia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Perkataan yang benar pasti memiliki pengaruh pada hati. Tak ayal lagi, timbullah keributan dan pertentangan di tengah tukang-tukang sihir, manakala mereka mendengarkan perkataan Musa dan terjadilah kegaduhan. Boleh jadi, muara pertentangan (pada mereka) adalah rancunya jati diri Musa, apakah ia berada di atas (rel) kebenaran atau tidak? Akan tetapi, sampai di sini, polemic mereka belum menemui titik terang. Agar Allah menentukan perkara yang mesti dilaksanakan, yaitu agar binasalah orang yang hidup dengan keterangan yang nyata dan agar hiduplah orang yang hidup dengan keterangan yang nyata. Saat itulah, mereka saling berbisik-bisik di antara mereka dan bahwa mereka telah menyepakati sebuah pernyataan agar mereka selamat dalam ucapan dan tindakan mereka serta agar orang-orang memegangi doktrin Fir’aun dan orang-orangnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 62: Perkataan yang hak biasanya ada bekas di hati. Oleh karena itulah, ketika Musa ‘alaihis salam mengucapkan kata-kata di atas, para pesihir menjadi bingung dan ketika itulah mereka berbisik-bisik, lalu mereka sepakat terhadap suatu tindakan, yaitu seperti yang disebutkan pada ayat selanjutnya. Tentang Musa dan Harun ‘alaihimas salam, apakah mereka di atas kebenaran atau tidak? Sebagian mereka berkata, “Ini bukanlah perkataan pesihir, tetapi perkataan seorang nabi.” Yang lain mengatakan, “Bahkan dia penyihir.” Ada pula yang berpendapat lain tentang apa yang diucapkan sebagian pesihir, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 62",
    "description": "Peringatan nabi musa membuat sebagian penyihir ketakutan, sementara sebagian yang lain tetap tidak acuh. Maka mereka pun berbantah- bantahan tentang urusan mereka. Masing-masing mengemukakan pendapatnya terkait peringatan nabi musa dan cara menghadapinya, dan mereka merahasiakan percakapan mereka agar fir'aun dan para pembesarnya tidak mendengarnya. 63. Sebagian dari mereka berkata, 'wahai penduduk mesir, sesungguhnya dua orang ini, yaitu nabi musa dan harun, adalah penyihir yang hendak mengusirmu dari mesir, dari negerimu dan tanah kelahiranmu, dengan menampilkan sihir mereka berdua, dan mereka juga hendak melenyapkan adat kebiasaanmu yang utama dan kamu yakini, yaitu kepercayaan yang kamu anut dan kedudukan yang kamu nikmati."
  }
]