[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62-64. Maka para tukang sihir itu saling tarik menarik dalam urusan mereka dan berbicara dengan percakapan rahasia. Mereka berkata, “Sesungguhnya Musa dan Harun adalah tukang sihir yang ingin mengusir kalian dari negeri kalian melalui keahlian sihir mereka dan menyingkirkan keahlian sihir besar yang ada pada kalian. Maka matangkanlah strategi tipu daya kalian dan kuatkanlah tekad kalian untuk tujuan tersebut tanpa ada silang pendapat diantara kalian dan kemudian datanglah kalian dengan berbaris satu barisan, dan lemparkanlah apa yang ada di tangan kalian dengan serentak, agar kalian bisa membelalakkan mata semua manusia dan mengalahkan sihir Musa dan saudaranya (Harun). Sesungguhnya hari ini telah memenangkan keinginannya orang yang berada di atas lawannya, sehingga dapat mengalahkan dan mempercundanginya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Sebagian penyihir itu berkata kepada sebagian lainnya secara berbisik-bisik, \"Sesungguhnya Musa dan Harun adalah dua orang penyihir, mereka berdua ingin mengeluarkan kalian dari negeri Mesir dengan perantaraan sihir yang mereka datangkan, dan mereka hendak melenyapkan adat kebiasaanmu yang utama dan tinggi di kehidupan ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Mereka menjadi takut dengan peringatan ini dan mulai saling berunding secara sembunyi-sembunyi, akan tetapi kekejaman Fir’aun dan godaannya membuat mereka terus menyebarkan tuduhan Fir’aun terhadap Musa, mereka berkata: “Dua orang ini -Musa dan Harun- adalah tukang sihir yang hendak mengusir kalian dari negeri Mesir agar mereka dapat mengusainya dengan sihir itu, dan mereka ingin mengalahkan sihir terbaik kalian. Hai para penyihir yang hebat, sempurnakanlah makar kalian dan aturlah rencana kalian, kemudian susunlah susunan kalian dengan barisan yang rapi agar kalian tampak lebih berwibawa dan dapat mengundang kekaguman; sungguh hari ini akan berjaya orang yang dapat mengalahkan musuhnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. إِنْ هٰذٰنِ لَسٰحِرٰنِ (Sesungguhnya dua orang ini adalah benar-benar ahli sihir) Yakni keduanya adalah tukang sihir. يُرِيدَانِ أَن يُخْرِجَاكُم مِّنْ أَرْضِكُم(yang hendak mengusir kamu dari negeri kamu) Mereka mengatakan ini karena terpengaruh oleh perkataan Fir’aun, mereka mengulang-ulanginya agar perkataan ini tersebar. Dan yang dimaksud adalah negeri Mesir. بِسِحْرِهِمَا(dengan sihirnya) Yang ditunjukkan oleh keduanya. وَيَذْهَبَا بِطَرِيقَتِكُمُ الْمُثْلَىٰ (dan hendak melenyapkan kedudukan kamu yang utama) Yakni mereka berdua hendak menyudahi kehidupan kalian yang terbaik dan termaju daripada kehidupan umat-umat lain. Mereka mengatakan ini hanya dengan pengakuan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Mereka berkata kepada diri sendiri: “Dua orang ini tidak lain hanyalah penyihir, yaitu Musa dan Harun. Mereka ingin mengusir kalian dari tanah Mesir menggunakan sihirnya, atau merusak kepercayaan kalian yang utama dalam hal sihir,” karena sesungguhnya para penyihir itu adalah orang-orang besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata} Mereka berkata satu sama lain {“Sesungguhnya dua orang ini} sesungguhnya dua orang ini {benar-benar penyihir yang hendak mengusir kalian dari negeri kalian dengan sihir mereka berdua dan melenyapkan tata cara kalian yang utama (63)} agama dan kepercayaan kalian yang merupakan kepercayaan paling utama dengan menunjukkan dan meninggikan kepercayaan dan agama mereka berdua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Perbincangan yang mereka rahasiakan, dijelaskan oleh Firman Allah, “Sesungguhnya dua orang ini adalah benar-benar ahli sihir yang hendak mengusir kamu dari negeri kamu dengan sihirnya,” persis seperti pernyataan Fir’aun sebelumnya, baik ini terjadi secara kebetulan atas pernyataan ini dari para tukang sihir dan Firaun tanpa kesengajaan ataupun merupakan pendiktean dari Fir’aun di hadapan orang-orang. Para tukang sihir itu mengimbuhi lontaran Fir’aun dengan ungkapan, “Dan hendak melenyapkan kedudukan kamu yang utama,” yaitu praktik sihir. Ia iri dengki terhadap kalian atas (kedudukan) itu dan berminat untuk mengungguli kalian, agar dia dapat menggenggam kebanggaan, ketenaran, dan popularitas. Itulah sasaran Musa dengan ilmu (sihir) ini, yang mana kalian teah menghabiskan waktu-waktu kalian makan dariinya dan menghilangkan hal-hal yang mengikutinya berupa jabatan-jabatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 63: Mereka saling mendorong antara sesama mereka dengan kata-kata yang isinya sama seperti yang diucapkan oleh Fir’aun sebelum ini. Maksudnya, kedatangan Musa ‘alaihis salam dan Harun ‘alaihis salam ke Mesir itu adalah untuk menggantikan kamu sebagai penguasa di Mesir. Sebagian ahli tafsir mengartikan thariqah di sini dengan keyakinan (agama)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 63",
    "description": "Sebagian dari mereka berkata, 'wahai penduduk mesir, sesungguhnya dua orang ini, yaitu nabi musa dan harun, adalah penyihir yang hendak mengusirmu dari mesir, dari negerimu dan tanah kelahiranmu, dengan menampilkan sihir mereka berdua, dan mereka juga hendak melenyapkan adat kebiasaanmu yang utama dan kamu yakini, yaitu kepercayaan yang kamu anut dan kedudukan yang kamu nikmati. 64. Karena itu, maka bersatulah menghadapi kedua orang itu. Kumpulkanlah segala tipu daya kamu, baik berupa sihir maupun yang lain, kemudian datanglah kamu semua dengan berbaris rapi dan kompak agar kita dapat mengalahkan mereka berdua, dan sesungguhnya beruntung orang yang menang pada hari ini, yaitu hari ketika kita dan mereka berdua unjuk keahlian masing-masing. '."
  }
]