[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "62-64. Maka para tukang sihir itu saling tarik menarik dalam urusan mereka dan berbicara dengan percakapan rahasia. Mereka berkata, “Sesungguhnya Musa dan Harun adalah tukang sihir yang ingin mengusir kalian dari negeri kalian melalui keahlian sihir mereka dan menyingkirkan keahlian sihir besar yang ada pada kalian. Maka matangkanlah strategi tipu daya kalian dan kuatkanlah tekad kalian untuk tujuan tersebut tanpa ada silang pendapat diantara kalian dan kemudian datanglah kalian dengan berbaris satu barisan, dan lemparkanlah apa yang ada di tangan kalian dengan serentak, agar kalian bisa membelalakkan mata semua manusia dan mengalahkan sihir Musa dan saudaranya (Harun). Sesungguhnya hari ini telah memenangkan keinginannya orang yang berada di atas lawannya, sehingga dapat mengalahkan dan mempercundanginya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Maka kuatkan dan kumpulkanlah segala tipu daya kalian dan jangan sekali-kali kalian berselisih, lalu datanglah kalian dengan berbaris, dan lemparkan sihir yang kalian miliki secara serempak, dan sungguh beruntunglah orang yang mengalahkan lawannya pada hari ini.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. فَأَجْمِعُوا۟ كَيْدَكُمْ (Maka himpunkanlah segala daya (sihir) kamu sekalian) Yakni jadikanlah tujuan kalian semua adalah membuat tipu daya baginya. ثُمَّ ائْتُوا۟ صَفًّا ۚ( kemudian datanglah dengan berbaris) Yakni dengan berbaris dan bersatu agar kalian lebih teratur dan lebih menakutkan. وَقَدْ أَفْلَحَ الْيَوْمَ مَنِ اسْتَعْلَىٰ (dan sesungguhnya beruntunglah oran yang menang pada hari ini) Ini semua adalah perkataan para tukang sihir kepada sesama mereka. Pendapat lain mengatakan ini merupakan perkataan Fir’aun kepada para tukang sihir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Para penyihir mengetahui bahwa dengan berhimpun mereka akan menang, maka mereka pun melakukannya; justru para muslihun lebih memahami dan menyadari betapa pentingnya berhimpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Tentukanlah strategi rahasia kalian dan putuskanlah keputusan yang menguatkan pada satu tujuan, kemudian majulah kalian dalam satu barisan untuk membuat takjub pandangan. Dan sungguh beruntunglah orang yang unggul pada hari ini. Ini merupakan perkataan para penyihir kepada sebagian mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kumpulkanlah segala tipu daya kalian} kuatkanlah tipu daya kalian dengan dikumpulkan untuknya {kemudian datanglah dalam satu barisan} dan majulah dengan berbaris {Sungguh beruntung} kemenangan yang diinginkan {orang yang menang} menaklukkan musuhnya {pada hari ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. INi adalah himbauan dari sebagian mereka kepada kelomppoknya untuk berusaha keras dalam menumbangkan Musa. Oleh karena itu, mereka berkata, “Maka himpunlah segala daya (sihir) kamu sekalian,” maksudnya tunjukkanlah (kemampuan kalian) sekaligus dengan cara bahu-membahu, saling mendukung, dan menolong dalam keadaan perkataan dan hati kalian bersatu. “Kemudian datanglah dengan berbaris,” agar kalian lebih leluasa menjalankan pekerjaan kalian dan lebih disegani dalam hati. Dan supaya sebagian kalian tidak menyisihkan kemampuannya ketahuilah, siapa saja yang beruntung hari ini, sukses dan berhasil mengalahkan yang lain, maka sesungguhnya dia menjadi seorang yang beruntung lagi menang. Inilah hari keberuntungan baginya, tiada hari setelah ini. Alangkah teguhnya mereka dalam kebatilan dan betapa dahsyatnya mereka berada di dalamnya! Pasalnya, mereka mengusahakan setiap cara, piranti, dan tipu daya untuk melancarkan makar kepada al-Haq."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 64: Agar kamu lebih kuat berbuat dan lebih ditakuti. Maksud hari ini ialah hari berlangsungnya pertandingan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 64",
    "description": "Karena itu, maka bersatulah menghadapi kedua orang itu. Kumpulkanlah segala tipu daya kamu, baik berupa sihir maupun yang lain, kemudian datanglah kamu semua dengan berbaris rapi dan kompak agar kita dapat mengalahkan mereka berdua, dan sesungguhnya beruntung orang yang menang pada hari ini, yaitu hari ketika kita dan mereka berdua unjuk keahlian masing-masing. '65. Begitu para penyihir berhadapan dengan nabi musa, mereka berkata, 'wahai musa! apakah engkau yang melemparkan lebih dulu untuk menun-jukkan kemampuanmu, atau kami yang lebih dahulu melemparkan''."
  }
]