[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para tukang sihir berkata, “Wahai Musa, lemparkanlah tongkatmu dahulu atau kami yang memulai untuk melemparkan apa yang kami miliki?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Para penyihir itu berkata kepada Musa -'alaihissalām-, \"Wahai Musa, pilihlah salah satu; apakah engkau yang memulai dahulu dengan mengeluarkan sihirmu ataukah kami yang akan mulai melakukannya?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Para penyihir berkata kepada Musa dengan penuh kesombongan: “Pilihlah sesukamu, apakah kamu yang akan melemparkan tongkatmu terlebih dahulu, atau kami yang akan melemparnya dahulu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. قَالُوا۟ يٰمُوسَىٰٓ إِمَّآ أَن تُلْقِىَ (mereka berkata: “Hai Musa (pilihlah), apakah kamu yang melemparkan) Kamu yang pertama melempar. وَإِمَّآ أَن نَّكُونَ (atau kamikah) Atau kami. أَوَّلَ مَنْ أَلْقَىٰ (yang mula-mula melemparkan) Yang akan melemparnya terlebih dahulu. Yang dimaksud adalah melempar tongkat ke atas tanah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "65-66 Diantara hikmah dari kisah ini adalah (والله أعلم) agar manusia memikirkan perbuatan mereka, maka ketika mereka selesai dari kesibukan berbenah diri, kebenaran yang jelas datang setelah mereka minta, dan penantian yang panjang, sehingga mereka menjadi orang yang senantiasa menjaga diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Para penyihir berkata di awal kompetisi: “Wahai Musa, kamulah yang memilih antara kamu yang pertama melempar tongkat ke tanah atau kami yang pertama melempar tongkat.” Dalam hal itu terdapat adab yang tinggi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} para penyihir berkata {“Wahai Musa, apakah kamu yang melemparkan atau kami yang pertama melempar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Dan Allah enggan kecuali (hanya) hendak menyempurnakan cahayaNya dan mengunggulkan al-haq di atas kebatilan. Setelah tipu daya mereka komplit, dan motivasi mereka telah mengerucut, serta tidak ada yang tertinggal melainkan pelaksanaannya saja “mereka berkata,” kepada Musa “(pilihlah), apakah kamu yang melemparkan (dahulu),” tongkatmu “atau kamikah orang yang mula-mula melemparkan?” mereka mengajukan alternative pilihan disertai dengan prasangka bahwa mereka pasti akan menang melawan Musa dalam kondisi apa pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 65",
    "description": "Begitu para penyihir berhadapan dengan nabi musa, mereka berkata, 'wahai musa! apakah engkau yang melemparkan lebih dulu untuk menun-jukkan kemampuanmu, atau kami yang lebih dahulu melemparkan''66. Dia berkata, 'silakan kamu melemparkan lebih dulu!' para penyihir itu lantas melemparkan alat sihir mereka ke tengah arena, maka tiba tiba tali-tali dan tongkat-tongkat mereka terbayang olehnya seakan-akan menjadi ular yang merayap dengan cepat, karena sihir mereka."
  }
]