[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada Musa ketika itu, “Janganlah kamu takut kepada sesuatu pun, karena sesungguhnya kamulah yang lebih unggul di atas para tukang sihir itu dan di atas Fir’aun serta para tentaranya, dan kamu akan mengalahkan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Allah lalu berfirman kepada Musa -'alaihissalām- untuk menenangkannya, \"Janganlah engkau takut dengan apa yang terbayang olehmu, sesungguhnya engkaulah -wahai Musa- yang akan mengalahkan mereka dengan mendapatkan kemenangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68-69. Maka Allah mewahyukan kepada Musa untuk menenangkannya: “Janganlah kamu takut dari sihir ini, karena kamu pasti akan mengalahkan mereka. Lemparlah tongkat yang ada di tangan kananmu, niscaya akan menelan semua tongkat dan tali-tali mereka. Apa yang mereka lakukan itu adalah tipu daya penyihir, dan penyihir tidak akan meraih kemenangan dengan sihirnya bagaimanapun tipuannya; dan bagaimana tidak, sedangkan dia telah merugi di dunia dan di akhirat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. قُلْنَا لَا تَخَفْ إِنَّكَ أَنتَ الْأَعْلَىٰ (Kami berkata: “janganlah kamu takut, sesungguhnya kamulah yang paling unggul) Yakni kamu akan mengungguli mereka dengan kemenangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Saat itu Kami berfirman kepada Musa: “Janganlah takut, sesungguhnya kamu lebih unggul atas mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami berfirman,“Jangan takut. Sesungguhnya kamu yang lebih unggul} yang lebih diungguhlkan atas mereka dengan kemenangan dan keunggulan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “Kami berkata,” untuk meneguhkan dan menenangkan hati, “Janganlah kamu takut, sesungguhnya kamulah yang paling unggul (menang),” atas mereka. Maksudnya engkau akan mengungguli mereka dan mengalahkan mereka hingga mereka patuh dan tunduk di hadapanmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 68: Untuk menguatkan dan menenangkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 68",
    "description": "Menenangkan hati nabi musa, kami berfirman, 'wahai nabi musa, jangan takut pada ular-ular itu! sungguh, engkaulah yang unggul dan akan menang dalam pertandingan ini. 69. Dan lemparkan apa yang ada di tangan kananmu, yaitu tongkat yang biasa engkau pakai untuk menggembala kambing, niscaya ia akan menelan apa yang mereka buat, yakni ular-ular yang berasal dari sihir mereka. Ketahuilah, apa yang mereka buat itu hanyalah tipu daya penyihir belaka, dan tidak akan menang penyihir itu, dari mana pun ia datang. '."
  }
]