[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lemparkanlah tongkatmu yang ada di tangan kananmu, niscaya akan menelan tali-tali dan tongkat-tongkat mereka. Apa yang mereka perbuat di hadapanmu tiada lain sekedar tipu daya seorang tukang sihir dan ilusi pengaruh sihir semata. Dan tidaklah tukang sihir itu akan menang di mana pun ia berada.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Dan lemparkanlah tongkat yang ada di tangan kananmu, niscaya ia akan menjelma menjadi ular besar yang akan menelan sihir yang mereka buat. Apa yang mereka perbuat itu hanyalah tipu daya sihir belaka, dan sungguh para pesihir itu tidak akan mendapatkan kemenangan di manapun berada.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَأَلْقِ مَا فِى يَمِينِكَ (Dan lemparkanlah apa yang ada ditangan kananmu) Yakni tongkat yang dia pegang. تَلْقَفْ مَا صَنَعُوٓا۟ ۖ( niscaya ia akan menelan apa yang mereka perbuat) Yakni menelan semua tali dan tongkat yang menjadi sihir mereka. إِنَّمَا صَنَعُوا۟ كَيْدُ سٰحِرٍ ۖ( Sesungguhnya apa yang mereka perbuat itu adalah tipu daya tukang sihir) Yakni mereka hanya membuat khayalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Dan lemparkanlah tongkat yang ada di tangan kananmu, seketika tongkat itu menelan dengan kuat dan cepat seluruh sihir yang mereka ciptakan dari tali dan tongkat. Sesungguhnya sihir yang mereka ciptakan itu hanyalah tipu muslihat yang sudah diatur dan tipu daya sihir yang tidak nyata. Dan penyihir itu tidak akan menang dimanapun dia berada dan datang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lemparkan apa yang ada di tangan kananmu, niscaya itu akan menelan} memakan dan menelan {apa yang mereka buat. Sesungguhnya apa yang mereka buat} sesungguhnya sesuatu yang mereka buat {itu tipu daya} tipu muslihat {penyihir. Tidak akan menang penyihir itu, bagaimana pun ia datang”} keadaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. “Dan lemparkkanlah apa yang ada di tangan kananmu,” yaitu tongkatmu “niscaya ia akan menelan sesuatu yang mereka buat. Sesungguhnya sesuatu yang mereka buat itu adalah tipu daya tukang sihir (belaka). Dan tida akan menang tukang sihir itu, dari mana saja ia datang,” maksudnya tipu daya dan makar mereka tidak membuahkan hasil bagi diri mereka, lagi tidak sukses. Ia sekedar tipu daya dari para tukang sihir yang mengelabui (pandangan) khalayak dan mengaburkan (potret) kebatilan serta mengopinikan bahwa mereka berada di atas kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 69: Yakni tongkatnya. Yang hendak mengelabui manusia semata dan membayangkan seakan-akan benar. Dengan membawa sihirnya. Lalu Musa melempar tongkatnya, maka tongkatnya pun berubah menjadi ular dan menelan semua buatan para pesihir. Ketika itu, para pesihir mengetahui dengan yakin, bahwa apa yang dibawa Musa bukanlah sihir, bahkan berasal dari Allah, maka mereka pun segera beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 69",
    "description": "Dan lemparkan apa yang ada di tangan kananmu, yaitu tongkat yang biasa engkau pakai untuk menggembala kambing, niscaya ia akan menelan apa yang mereka buat, yakni ular-ular yang berasal dari sihir mereka. Ketahuilah, apa yang mereka buat itu hanyalah tipu daya penyihir belaka, dan tidak akan menang penyihir itu, dari mana pun ia datang. '70. Setelah melihat ular-ular hasil sihir mereka ditelan oleh ular yang berasal dari tongkat nabi musa, lalu para penyihir itu ditiarapkan oleh rasa takut pada Allah dan kagum pada kehebatan mukjizat nabi musa. Mereka segera merunduk bersujud kepada tuhan yang maha esa seraya berkata, 'kami telah percaya dan beriman kepada tuhan harun dan musa. '."
  }
]