[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila engkau mengeraskan ucapanmu (wahai Rasul) sehingga menampakannya atau menyembunyikannya, sesungguhnya tidak ada sesuatu pun yang tersembunyi bagiNya sama sekali. Dia mengetahui sesuatu yang dirahasiakan dan apa yang lebih tersembunyi dari itu yang dibisikkan hatimu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan jika engkau mengeraskan ucapanmu -wahai Rasul- atau membisikkannya, maka sungguh Dia mengetahui semua itu, sebab Dialah yang mengetahui segala rahasia, dan apa yang lebih tersembunyi darinya berupa sesuatu yang terbetik dalam hati, dan sama sekali tidak ada sesuatupun yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Allah meliputi segala sesuatu dengan ilmu-Nya. Hai Rasulullah, sama saja bagimu mengeraskan suaramu atau merahasiakannya, karena Allah mengetahuinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَإِن تَجْهَرْ بِالْقَوْلِ فَإِنَّهُۥ يَعْلَمُ السِّرَّ وَأَخْفَى (Dan jika kamu mengeraskan ucapanmu, maka sesungguhnya Dia mengetahui rahasia dan yang lebih tersembunyi) Makna (السر) adalah perkataan seseorang pada orang lain secara rahasia. Makna (الأخفى) adalah ucapan seseorang pada dirinya sendiri atau apa yang terbesit dalam fikirannya. Maksud dari ayat ini adalah jika kamu mengeraskan zikir dan doamu kepada Allah maka ketahuilah bahwa Allah tidak membutuhkan yang demikian, sebab Allah mengetahui ucapan yang dibisikkan atau yang lebih tersembunyi daripada itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ يَعْلَمُ ٱلسِّرَّ وَأَخْفَى } \"Dia mengetahui rahasia dan yang lebih tersembunyi\" Ibu 'Abbas dalam tafsirnya berkata : Rahasia yang disimpan oleh anak Adab dalam dirinya, dan sesuatu yang tersembunyi itu adalah : apa yang tersembunyi dari penglihatan anak Adam yang sebenarnya ia akan melakukannya namun ia belum mengetahuinya, dan Allah lebih dahulu mengetahuinya. Maka perhatikanlah kalian wahai anak Adam betapa ilmu sangat luas dari yang kamu miliki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dan jika kamu meninggikan suaramu dalam berdzikir atau berdoa, maka ketahuilah bahwa Allah tidak membutuhkan hal itu, karena sesungguhnya Dia mengetahui rahasia yang kamu sembunyikan dan sesuatu yang paling rahasia seperti suatu kemauan, perasaan was-was, dan gejolak jiwa yang tak terucap."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kamu mengeraskan} mengeraskan {ucapanmu, sesungguhnya Dia mengetahui yang rahasia} sesuatu yang kamu rahasiakan dalam dirimu {dan yang lebih tersembunyi} dan lebih rahasia dari rahasia, yaitu sesuatu yang belum ada dan akan dibicarakan oleh dirimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Dan jika kamu mengeraskan ucapanmu, maka sesungguhnya Dia mengetahui rahasia,” maksudnya perkataan yang lirih “dan yang tersembunyi,” dari sesuatu yang rahasia, yang bermakna rahasia yang berada di hati, dan belum diucapkan. Atau ‘Assirru’ ialah segala sesuatu yang terbetik di hati. Sedangkan ‘akhfaa’ merupakan segala sesuatu yang belum muncuul di benak. Allah Maha mengetahui segala sesuatu yang terbetik pada waktunya dan segala bentuknya. Maksudnya, ilmu Alah meliputi segala sesuatu, yang samar maupun yang jelas, yang tersembunyi ataupun yang terlihat, sama saja, baik engkau mengeraskan suara atau melirihkannya. Semuanya menurut ilmu Allah sama saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 7: Maksud ayat ini adalah tidak perlu mengeraskan suara dalam berdoa dan berdzikr, karena Allah mendengar semua doa itu meskipun diucapkan dengan suara pelan. Sedangkan maksud “Yang lebih tersembunyi” adalah seperti yang terlintas di hati. Dengan demikian, pengetahuan Allah meliputi segala sesuatu, yang kecil maupun yang besar, yang samar maupun yang nampak, sama saja kamu keraskan suaramu atau kamu pelankan, Dia mendengar dan mengetahuinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 7",
    "description": "Dia mengetahui apa saja yang terjadi di alam semesta. Dan jika engkau mengeraskan ucapanmu saat menyampaikan sesuatu, sungguh dia mengetahui apa yang engkau ucapkan. Dia juga mengetahui apa saja yang rahasia atau yang sengaja kausembunyikan dalam hatimu, dan apa saja yang lebih tersembunyi, yang tidak kausadari dan tidak kauketahui lagi setelah lama mengendap di dasar hatimu. 8. Dialah Allah yang tidak ada tuhan penguasa alam semesta yang patut disembah selain dia. Hanya dia pula yang mempunyai nama-nama yang terbaik."
  }
]