[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu Musa melemparkan tongkatnya dan kemudian menelan apa yang mereka ada-adakan. Maka tampak nyatalah kebenaran dan hujjah menjadi tegak di hadapan mereka. Lalu tukang-tukang sihir itu menyungkurkan diri mereka di atas permukaan tanah dalam keadaan bersujud dan berkata, “Kami beriman kepada Tuhan Harun dan Musa, sebab kalau itu sihir, niscaya kami tidak akan kalah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Maka Musa melemparkan tongkatnya yang kemudian menjelma menjadi ular besar, lalu menelan sihir yang mereka perbuat, lalu seketika bersujudlah para tukang sihir itu kepada Allah karena mengetahui bahwa apa yang dilakukan oleh Musa bukanlah sihir, akan tetapi mukjizat yang datangnya dari sisi Allah, mereka berkata, \"Kami telah beriman kepada Tuhan Musa dan Harun, yaitu Tuhan segala makhluk.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Setalah para penyihir itu mengetahui mukjizat ini adalah benar, maka mereka kemudian sujud tersungkur kepada Allah dan menyatakan kepada orang-orang keimanan mereka dengan berkata: “Kami telah beriman kepada Tuhan semesta alam, yaitu Tuhannya Harun dan Musa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. فَأُلْقِىَ السَّحَرَةُ سُجَّدًا (Lalu tukang-tukang sihir itu tersungkur dengan bersujud) Yakni ketika Musa melempar tongkatnya dan mulai menelan tongkat dan tali mereka sehingga tidak dapat kembali pada mereka, maka mereka mengetahui bahwa apa yang dilakukan Musa bukan termasuk sihir, namun itu adalah suatu kuasa Allah yang mampu melakukan segala sesuatu; oleh sebab itu mereka bersujud kepada Allah dan beriman kepada risalah Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Lalu para penyihir itu menyadari bahwa apa yang dilakukan Musa itu bukan sihir, namun dari Allah, lalu mereka tersungkur bersujud dan tunduk kepada Allah, lalu berkata: “Kami beriman kepada Tuhannya Harun dan Musa”. Maksudnya yaitu bahwa Pengetahuan mereka tentang kebenaran membuat mereka tunduk kepada Allah lalu bersujud kepadaNya dan beriman kepada Musa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu para penyihir itu tersungkur bersujud lalu berkata,“Kami telah percaya kepada Tuhannya Harun dan Musa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Lalu, Musa melemparkan tongkatnya, maka ia menelan segala sesuatu (ular jelmaan) yang mereka buat dan memangsanya. Sementara itu, orang-orang memperhatikan kejadian tersebut. Para tukang sihir pun sadar dengan yakin bahwa itu bukanlah sihir, akan tetapi dari Allah. Maka mereka pun bersegera untuk beriman. “Lalu tukang-tukang sihir itu tersungkur,” dengan bersujud, \"Dan ahli-ahli sihir itu serta merta meniarapkan diri dengan bersujud. Mereka berkata: \"Kami beriman kepada Tuhan semesta alam, \"(yaitu) Tuhan Musa dan Harun\". (Al-A’raf:120-122). Kebenaran pun terkuak, Nampak dan mencuat. Sedangkan praktik sihir, tipu daya, dan makar (mereka) tertolak pada tempat perkumpulan yang ramai itu. Jadilah momentum itu sebagai bukti nyata dan rahmat bagi kaum Mukminin serta menjadi hujjah atas orang-orang yang menentang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 70",
    "description": "Setelah melihat ular-ular hasil sihir mereka ditelan oleh ular yang berasal dari tongkat nabi musa, lalu para penyihir itu ditiarapkan oleh rasa takut pada Allah dan kagum pada kehebatan mukjizat nabi musa. Mereka segera merunduk bersujud kepada tuhan yang maha esa seraya berkata, 'kami telah percaya dan beriman kepada tuhan harun dan musa. '71. Fir'aun murka melihat kekalahan dan keimanan para penyihirnya. Dia berkata, 'wahai para penyihir, apakah kamu telah beriman kepadanya, yaitu kepada nabi musa, sebelum aku memberi izin kepadamu' sesungguhnya dia itu pemimpinmu. Dia tidak lebih dari sekadar penyihir pandai yang mengajarkan sihir kepadamu. Dengan beriman, kamu telah melakukan makar dan melanggar janji setiamu kepadaku, maka sungguh, aku akan memotong tangan kanan dan kaki kiri kamu secara bersilang, dan sungguh akan aku salib kamu pada pangkal pohon kurma. Akan aku gantung tubuh-tubuhmu dan aku ikat kaki dan tanganmu di sana agar orang-orang tahu hukuman bagi orang yang melanggar perintahku. Dan sungguh, kamu pasti akan mengetahui siapa di antara kita, di antara aku dan tuhan nabi musa, yang lebih pedih dan lebih kekal siksaannya. '."
  }
]