[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun berkata kepada para tukang sihir, “Apakah kalian telah beriman kepada musa dan mengikutinya serta mengakuinya sebelum aku mengizinkan kalian untuk itu? Sesungguhnya musa adalah pembesar kalian yang telah mengajarkan sihir kepada kalian, karena itu kalian mengikutinya. Maka sesungguhnya aku akan benar-benar memotong-motong tangan-tangan dan kaki-kaki kalian dengan bersilangan, tangan di potong pada satu sisi dan kaki di potong pada bagian sisi tubuh yang lain, dan aku akan benar-benar menyalib kalian (dengan mengikat jasad-jasad kalian) pada pangkal pohon kurma, dan kalian akan sungguh-sungguh tahu, wahai para tukang sihir, siapakah dari kami; aku atau Tuhan Musa yang lebih pedih siksaannya daripada siksaan pihak lain dan lebih kekal baginya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Fir'aun lalu berkata dengan menampakkan pengingkaran terhadap keimanan para tukang sihir itu dan memberikan mereka ancaman, \"Apakah kalian beriman kepada Musa sebelum aku mengizinkan kalian melakukannya? Sesungguhnya Musa ini adalah pembesar kalian yang mengajarkan kalian sihir -wahai para tukang sihir-, maka sungguh akan kupotong tangan dan kaki setiap dari kalian secara bersilang, dan akan aku salib jasad-jasad kalian pada pangkal-pangkal pohon kurma sampai mati, sehingga akan menjadi pelajaran bagi selain kalian, dan pada saat itu juga kalian pasti akan mengetahui siapa diantara kita yang paling pedih dan paling kekal siksanya; aku ataukah Tuhan Musa?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. pernyataan mereka ini menggoncang istana Fir’aun, sehingga dia murka dan mengancam mereka: “Apakah kalian akan beriman kepada Musa padahal aku belum mengizinkan kalian?” Kemudian dia membuat kedustaan bahwa ini merupakan rencana yang telah disusun sebelumnya oleh Musa dan para penyihir itu, dan Musa adalah orang yang mengajari mereka ilmu sihir. Lalu dia menampakkan kekejamannya untuk menakut-nakuti mereka: “Sungguh aku pasti akan memotong tangan dan kaki kalian semua secara menyilang -dengan memotong tangan kanan dan kaki kiri atau sebaliknya-, kemudian aku akan menggantung kalian di batang pohon kurma dalam keadaan tersalib; dan sungguh hai para penyihir, kalian akan mengetahui siapa yang lebih keras dan lebih lama dalam mengazab, apakah aku atau Tuhan semesta alam?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. قَالَ ءَامَنتُمْ لَهُۥ قَبْلَ أَنْ ءَاذَنَ لَكُمْ ۖ (Berkata Fir’aun: “Apakah kamu telah beriman kepadanya (Musa) sebelum aku memberi izin kepadamu sekalian) Yakni apakah kalian mempercayai ucapannya dan mengikuti agamanya tanpa seizinku? إِنَّهُۥ لَكَبِيرُكُمُ الَّذِى عَلَّمَكُمُ السِّحْرَ ۖ( Sesungguhnya ia adalah pemimpinmu yang mengajarkan sihir kepadamu sekalian) Yakni dia lebih mahir dan lebih tinggi kekuatannya dalam melakukan sihir, atau orang yang mengajari kalian sihir. Dengan perkataan ini Fir’aun hendak menyebarkan syubhat pada orang-orang agar mereka tidak beriman, sebab Fir’aun telah mengetahui bahwa para tukang sihir itu tidak pernah belajar sihir dari Musa, bukan pula pemimpin mereka, serta antara mereka dan Musa tidak ada hubungan sebelumnya. فَلَأُقَطِّعَنَّ أَيْدِيَكُمْ وَأَرْجُلَكُم مِّنْ خِلٰفٍ(Maka sesungguhnya aku akan memotong tangan dan kaki kamu sekalian dengan bersilang secara bertimbal balik) Yakni dengan memotong tangan kanan dan kaki kiri atau sebaliknya. وَلَأُصَلِّبَنَّكُمْ فِى جُذُوعِ النَّخْلِ (dan sesungguhnya aku akan menyalib kamu sekalian pada pangkal pohon kurma) Dia memilih pangkal pohon kurma karena sangat kasar dan dapat melukai. وَلَتَعْلَمُنَّ أَيُّنَآ أَشَدُّ عَذَابًا وَأَبْقَىٰ (dan sesungguhnya kamu akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksanya) Yakni agar kalian tahu apakah aku yang lebih kejam siksanya ataukah Tuhan Musa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ إِنَّهُۥ لَكَبِيرُكُمُ ٱلَّذِى عَلَّمَكُمُ ٱلسِّحْرَ } \"Sesungguhnya ia adalah pemimpinmu yang mengajarkan sihir kepadamu sekalian\" tidaklah Fir'aun mengatakan demikian melainkan untuk menutupi rakyatnya yang jelata dan menutupi kebodohan mereka sendiri, sebagaimana yang juga dikatakan : { فَٱسْتَخَفَّ قَوْمَهُۥ فَأَطَاعُوهُ } \"Maka Fir'aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya\" [ Az-Zukhruf : 54 ]"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Fir’aun berkata kepada para penyihir itu: “Bagaimana bisa kalian beriman kepada Musa dan mengikuti agamanya sebelum aku beri ijin kalian. Sesungguhnya Musa adalah guru agung kalian yang mengajari kalian sihir. Dan sungguh kalian telah berkomplot atas apa yang kalian kerjakan dengan maksud menyelipkan sesuatu yang samar-samar kepada manusia sehingga mereka tidak beriman. Sungguh aku akan memotong tangan dan kaki kalian melalui dua sisi yang berbeda (yaitu tangan kanan dengan kaki kiri), lalu aku akan menyalib kalian di atas batang kurma (batang itu dipilih karena keras dan menyakitkan), dan sungguh kalian akan mengetahui apakah aku yang lebih keras dan abadi siksaannya atau Tuhannya Musa?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Fir’aun berkata {“Apakah kalian beriman kepadanya sebelum aku memberi izin kepada kalian. Sesungguhnya dia itu pemimpin kalian} pemimpin kalian {yang mengajari kalian sihir. Sungguh aku akan memotong tangan-tangan dan kaki-kaki kalian secara bersilang} dari sisi yang berbeda {dan sungguh aku akan menyalib kalian pada pangkal pohon kurma} batang pohon kurma {Sungguh kalian benar-benar akan mengetahui siapa di antara kita yang lebih keras dan lebih kekal siksanya”} dan lebih kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Fir’aun berkata kepada para tukang sihir, “apakah kamu telah beriman kepadanya (Musa) sebelum aku memberi izin kepadamu sekalian,” maksudnya, bagimana bisa kalian lancang beriman tanpa konsultasi dan izin denganku. Fir’aun begitu terheran-heran mengapa sikap ini muncul dari mereka lantaran tata karma mereka kepada dirinya, sikap menghinakan diri dan ketundukan mereka kepadanya pada setiap urusan mereka. Dia ingin agar masalah keimanan para tukang sihir ini termasuk bagian dari prilaku mereka sebelumnya (untuk selalu taat kepadanya). Kemudian Fir’aun semakin membabi-buta dalam kekufuran dan sikapnya melampaui batas setelah adanya petunjuk kebenaran ini. Dia mengolok-olok kaumnya melalui perkataannya dan menampakkan kepada mereka bahwa keunggulan Musa atas para tukang sihir itu, bukan karena syariat yang dibawanya merupakan kebenaran. Justru (yang terjadi) dia telah menjalin kerja sama dengan para tukang sihir, menyusun tipu daya dan mengatur scenario untuk mengusir Fir’aun dan kaumnya dari negeri mereka. Kaumnya pun mengiyakan rekayasa jahat ini darinya dan menyangkanya sebagai kebenaran. \"Maka Firaun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya. Karena sesungguhnya mereka adalah kaum yang fasik\" (Az-Zukhruf:54), padahal pernyataan yang dilontarkan oleh Fir’aun ini tidak bisa menembus akal orang yang mempunyai kecerdasan dan pengetahuan tentang fakta dalam level terendah sekalipun. Karena Musa datang dari Madyan seorang diri. Saat tiba, dia tidak berinteraksi dengan salah satu dari para tukang sihir atau siapapun selain mereka. Bahkan yang beliau tempuh, lansung menyerukan dakwah kepada Fir’aun dan kaumnya. Beliau memperlihatkan tanda-tanda kebesaran Allah kepada mereka. Kemudian Fir’aun ingin melawan misi yang dibawa oleh Musa. Dia pun berusaha semaksimal mungkin. Mengutus seseorang di seluruh pelosok negeri untuk mendatangkan setiap tukang sihir yang piawai. Mereka pun berdatangan kepadanya. Fir’aun menjanjikan upah dan kedudukan manakala kemenangan berhasil direngkuh. Para tukang sihir itu bbegitu antusias dan menyusun tipu daya yang jitu untuk menang atas Musa. Setelah itu, terjadilah pada mereka, peristiwa keimanan kepada Musa. Apakah (dengan fakta-fakta ini semua), mungkin dibayangakan bahwa para tukang sihir itu dan Musa telah mengatur kondisi dan menjalin kesepakatan atas peristiwa yang muncul? Ini termasuk kejadian yang paling mustahil. Selanjutnya, Fir’aun menebar ancaman kepada para tukang sihir dengan berkata, “Maka sungguh aku akan memotong tangan dan kaki kamu sekalian dengan bersilang secara bertimbal balik.” Sebagaimana hukuman yang diperlakukan bagi pemberontak yang selallu menimbullkan kerusakan, tangan kanan dan kaki kirinya dipotong. “Dan sungguh aku akan menyalib kamu sekalian pada pangkal pohon kurma,” agar kalian dapat disaksikan orang banyak dan merasakan kehinaan. “Dan sungguh kamu akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksanya,” tentu atas dasar persangkaannya dan persangkaan pengikutnya bahwa dia adalah orang yang paling dahsyat siksaannya daripada Allah dan lebih kekal, untuk memutarnalikkan fakta dan mengintimidasi orang yang mudah dibodohi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 71: Setelah bukti yang jelas itu, ternyata Fir’aun malah bertambah kekafirannya, maka ia mempengaruhi akal kaumnya dan memberitahukan kepada mereka, bahwa menangnya Musa melawan para pesihir bukanlah karena kebenarannya, bahkan karena sebelumnya Musa ‘alaihis salam dengan para pesihir telah mengadakan kesepakatan untuk mengeluarkan Fir’aun dan kaumnya dari negerinya. Ketika kaumnya mendengar kata-kata Fir’aun itu, mereka pun menerimanya dan menyangka bahwa perkataan Fir’aun itu benar, dan memang kaumnya adalah orang-orang fasik. Maksudnya, tangan kanan dan kaki kiri atau sebaliknya. Yakni dengan persangkaannya antara dia (Fir’aun) dengan Allah ‘Azza wa Jalla; siapa yang lebih pedih dan lebih kekal siksanya. Fir’aun merubah hakikat yang sebenarnya dan menakut-nakuti orang-orang yang tidak berakal. Oleh karena itu, ketika para pesihir mengetahui yang hak, dan Allah mengaruniakan kepada mereka akal yang dengannya mereka dapat mengetahui hakikat yang sebenarnya, maka mereka menjawab ancaman Fir’aun dengan berkata, “Kami tidak akan memilih tunduk kepadamu atas bukti-bukti nyata (mukjizat), yang telah datang kepada kami dan atas Allah yang telah menciptakan kami. Maka putuskanlah yang hendak engkau putuskan. Sesungguhnya engkau hanya dapat memutuskan pada kehidupan di dunia ini.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 71",
    "description": "Fir'aun murka melihat kekalahan dan keimanan para penyihirnya. Dia berkata, 'wahai para penyihir, apakah kamu telah beriman kepadanya, yaitu kepada nabi musa, sebelum aku memberi izin kepadamu' sesungguhnya dia itu pemimpinmu. Dia tidak lebih dari sekadar penyihir pandai yang mengajarkan sihir kepadamu. Dengan beriman, kamu telah melakukan makar dan melanggar janji setiamu kepadaku, maka sungguh, aku akan memotong tangan kanan dan kaki kiri kamu secara bersilang, dan sungguh akan aku salib kamu pada pangkal pohon kurma. Akan aku gantung tubuh-tubuhmu dan aku ikat kaki dan tanganmu di sana agar orang-orang tahu hukuman bagi orang yang melanggar perintahku. Dan sungguh, kamu pasti akan mengetahui siapa di antara kita, di antara aku dan tuhan nabi musa, yang lebih pedih dan lebih kekal siksaannya. ' 72. Para penyihir tidak takut pada ancaman fir'aun. Mereka berkata, 'wahai fir'aun, kami tidak akan memilih untuk lebih tunduk kepadamu daripada sebagian bukti-bukti nyata atau mukjizat yang telah datang kepada kami melalui nabi musa. Dan kami juga tidak akan mengutamakanmu sebagai sesembahan atas Allah yang telah menciptakan kami. Maka, putuskanlah yang hendak engkau putuskan dan lakukanlah apa saja yang ingin kaulakukan terhadap kami. Sesungguhnya engkau hanya dapat memutuskan pada kehidupan di dunia ini. Kekuasaanmu tidak akan berlanjut hingga akhirat nanti."
  }
]