[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para tukang sihir berkata pada Fir’aun, “Kami tidak akan mengutamakan dirimu hingga kami lebih taat kepadamu dan mengikuti keyakinanmu daripada apa yang telah di bawa oleh Musa berupa bukti-bukti nyata yang menunjukkan kebenarannya dan kewajiban menaatinya serta taat kepada Tuhannya. Dan kami tidak akan mengutamakan ketuhananmu yang palsu di atas ketuhanan Allah yang telah menciptakan kami. Lakukanlah apa saja yang engkau mau lancarkan kepada kami. Sesungguhnya kekuasaanmu atas kami hanya di kehidupan dunia ini, dan apa yang kamu perbuat pada kami tiada lain hanyalah siksaan yang akan selesai dengan sirnanya dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Para tukang sihir itu berkata kepada Fir'aun, \"Kami tidak akan pernah mengutamakan rasa tunduk dan taat kepadamu dari pada ketundukan terhadap bukti-bukti nyata/mukjizat yang datang kepada kami. Kami tidak akan pernah mengutamakanmu dari Allah yang telah menciptakan Kami, maka lakukanlah apa yang ingin engkau lakukan pada kami sekehendakmu, sesungguhnya engkau tidak memiliki kekuasaan atas kami kecuali hanya dalam kehidupan dunia ini, dan kekuasaanmu itu pasti akan sirna."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72-73. Para penyihir yang telah bertaubat itu membalas perkataan Fir’aun dengan penuh keyakinan yang mengandung nasehat yang mulia, sebagaimana yang dalam lima ayat yang akan disebutkan: “Sungguh demi Allah yang telah menciptakan kami, kami tidak akan memilihmu dan menukar hidayah dan keimanan yang telah Allah datangkan kepada kami melalui Musa meskipun taruhannya adalah nyawa kami. Lakukanlah apa yang kamu mau, karena perintahmu itu hanya berlaku di dunia yang fana ini. Kami telah beriman kepada Allah agar Dia mengampuni dosa-dosa kami dan kejahatan perbuatan sihir yang telah kami lakukan. Hai Fir’aun, pahala Allah lebih baik daripadamu bagi orang yang mentaati-Nya, dan Dia lebih kekal azab-Nya bagi orang yang menyelisihi-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. قَالُوا۟ لَن نُّؤْثِرَكَ عَلَىٰ مَا جَآءَنَا مِنَ الْبَيِّنٰتِ (Mereka berkata: “Kami sekali-kali tidak akan mengutamakan kamu daripada bukti-bukti yang nyata) Yakni kami tidak akan memilihmu dan meninggalkan mukjizat yang dibawa oleh Musa dari sisi Allah. وَالَّذِى فَطَرَنَا ۖ( dan daripada Tuhan yang telah menciptakan kami) Mereka bersumpah dengan nama Allah yang mereka Imani atas apa yang mereka ucapkan itu. فَاقْضِ مَآ أَنتَ قَاضٍ ۖ( maka putuskanlah apa yang hendak kamu putuskan) Yakni lakukanlah apa yang ingin kamu lakukan. إِنَّمَا تَقْضِى هٰذِهِ الْحَيَوٰةَ الدُّنْيَآ(Sesungguhnya kamu hanya akan dapat memutuskan pada kehidupan di dunia ini saja) Yakni kekuasaanmu atas kami hanyalah di dunia ini dengan membunuh kami, namun setelah itu kamu tidak lagi memiliki kekuasaan atas kami."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Syaithon manusia bisa saja menguasaimu dan siapa saja yang berada disekitarmu kecuali satu hal, yaitu hatimu yang senantiasa bersambung kepada Allah, lihatlah bagaimana Asia istri Fir'aun dalam kisah mereka, dan perhatikan perkataan para tukang sihir itu tatkala mereka memutuskan untuk beriman kepada Allah : { قَالُوا۟ لَن نُّؤْثِرَكَ عَلَىٰ مَا جَآءَنَا مِنَ ٱلْبَيِّنَٰتِ وَٱلَّذِى فَطَرَنَا ۖ فَٱقْضِ مَآ أَنتَ قَاضٍ ۖ إِنَّمَا تَقْضِى هَٰذِهِ ٱلْحَيَوٰةَ ٱلدُّنْيَآ } \"Mereka berkata: \"Kami sekali-kali tidak akan mengutamakan kamu daripada bukti-bukti yang nyata (mukjizat), yang telah datang kepada kami dan daripada Tuhan yang telah menciptakan kami; maka putuskanlah apa yang hendak kamu putuskan. Sesungguhnya kamu hanya akan dapat memutuskan pada kehidupan di dunia ini saja\". 2 ). Para penyihir Fir'aun merupakan salah contoh kuatnya keyakinan seorang hamba kepada kebenaran dan keikhlasan yang tinggi yaitu tatkala mereka menolak tunduk kepada penguasa kafir, merendahkan ketuhanan yang palsu, bahkan sampai menolak dengan muthlaq tawaran harta berlimpah, dan para penyihir itu berkata : { فَٱقْضِ مَآ أَنتَ قَاضٍ ۖ إِنَّمَا تَقْضِى هَٰذِهِ ٱلْحَيَوٰةَ ٱلدُّنْيَآ } \"maka putuskanlah apa yang hendak kamu putuskan. Sesungguhnya kamu hanya akan dapat memutuskan pada kehidupan di dunia ini saja\", dan perbedaan yang sangat antara mereka yang merendahkan kehidupan dunia ini demi keridhoan Allah, dan antara mereka yang menjelekkan agama ini demi mendapat perhatian dari orang besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Para penyihir itu berkata kepada Fir’aun: “Kami tidak akan mengunggulkanmu atas apa yang telah dibawakan Musa untuk kami berupa mukjizat nyata yang menunjukkan atas kebenarannya. Kami juga tidak akan mengunggulkanmu atas Allah yang telah menciptakan Kami. Maka lakukanlah sesuatu yang memang sudah kau rencanakan, yaitu ancamanmu kepada kami. Sesungguhnya kekuasaan dan ketentuanmu itu hanya terbatas di kehidupan dunia ini saja”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata} Para penyihir itu berkata kepada Fir’aun {“Kami tidak akan mengutamakanmu} Kami tidak akan memilihmu {melebihi bukti-bukti nyata yang telah datang kepada kami dan Dzat yang telah menciptakan kami} menciptakan kami {Putuskanlah} Buatlah {apa yang hendak kamu putuskan} kamu buat {Sesungguhnya kamu hanya memutuskan dalam kehidupan dunia ini} sesungguhnya perbuatan yang kamu inginkan terhadap kami itu hanya di dunia ini, dan tidak ada jalan bagimu terhadap kami di kehidupan setelahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. OLeh sebab itu, tatkala para tukang sihir itu mengetahui kebenaran yang nyata, dan Allah telah mencurahkan kemampuan berpikir pada mereka untuk dapat melacak fakta-fakta sesungguhnya, mereka pun merespon (ancaman Fir’aun) dengan berkata, “Kami sekali-kali tidak mengutamakan kamu daripada bukti-bukti yang nyata (mukjizat), yang telah datang kepada kami,” [maksudnya kami tidak akan mengutamakan engkau dan apa yang engkau janjikan kepada kami berupa upah dan kedekatan posisi denganmu daripada apa yang telah Allah perlihatkan kepada kami yang berupa ayat-ayat yang jelas] : yang menunjukkan bahwa Allah-lah Rabb yang patut disembah, satu-satunya, yang diagungkan dan dihormati, dan bahwa selain Allah merupakan kebatilan, dan kami (tidak akan) mengutamakan dirimu daripada Dzat yang telah menciptakan kami dan mengadakan kami, ini tidak akan terjadi. “Maka putuskanlah apa yang hendak kamu putuskan,” dari sesuatu yang telah engkau ancamkan kepada kami, berupa potong tangan dan kaki, penyaliban jasad kami dan siksaan. “Sesungguhnya kamu hanya akan dapat memutuskan pada kehidupan di dunia saja,” maksudnya apa yang kamu ancamkan kepada kami, paling maksimal hanya terjadi di kehidupan dunia ini saja, nanti akan selesai, hilang, dan tidak membahayakan kami (di akhirat kelak). Berbeda halnya dengan azab Allah bagi orang yang tetap berada di atas kekufuran, azab itu kontinyu, lagi dahsyat. Sepertinya inilah jawaban dari mereka terhadap perkataan Fir’aun, “Dan sungguh kamu akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksaannya.” (Thaha:71). Dalam pembicaraan para tukang sihir ini terdapat petunjuk bahwa seorang yang berakal hendaklah menimbang antara kenikmatan duia dan kenikmatan akhirat dengan azab dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 72: Dengan mendapat upah dan didekatkan denganmu. Wallahu a’lam, apakah Fir’aun memberlakukan hukuman itu kepada para pesihir atau tidak? Akan tetapi ancamannya kepada mereka dan ia (Fira’un) mampu melakukannya menunjukkan bahwa hal itu terjadi, karena jika tidak terjadi, tentu Allah akan menyebutkannya dan lagi para penukil sejarah pun sepakat seperti itu. Yang sementara, berbeda dengan azab di akhirat yang kekal abadi. Ucapan para pesihir ini seakan-akan bantahan terhadap ucapan Fir’aun, “Kamu pasti akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksaannya.” Dalam ucapan para pesihir tersebut terdapat dalil, bahwa sepatutnya bagi orang yang berakal menimbang antara kenikmatan dunia dengan kenikmatan akhirat, dan antara azab dunia dengan azab akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 72",
    "description": "Para penyihir tidak takut pada ancaman fir'aun. Mereka berkata, 'wahai fir'aun, kami tidak akan memilih untuk lebih tunduk kepadamu daripada sebagian bukti-bukti nyata atau mukjizat yang telah datang kepada kami melalui nabi musa. Dan kami juga tidak akan mengutamakanmu sebagai sesembahan atas Allah yang telah menciptakan kami. Maka, putuskanlah yang hendak engkau putuskan dan lakukanlah apa saja yang ingin kaulakukan terhadap kami. Sesungguhnya engkau hanya dapat memutuskan pada kehidupan di dunia ini. Kekuasaanmu tidak akan berlanjut hingga akhirat nanti. 73. Wahai fir'aun, kami benar-benar telah beriman dan akan memegang teguh kepercayaan kami kepada tuhan pencipta kami yang selama ini kami durhakai dan ingkari. Kami beriman dengan harapan agar dia mengampuni kesalahan-kesalahan kami yang telah mempersekutukan-Nya dan mengampuni dosa kami karena telah mempelajari dan mempraktikkan sihir yang telah engkau paksakan kepada kami. Dan Allah lebih baik pahala-Nya kepada orang yang taat daripada balasanmu kepada kami, dan dia lebih kekal kekuasaan serta azab-Nya bagi pendurhaka dibanding siksamu."
  }
]