[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami telah beriman kepada Tuhan kami dan mengimani RasulNya, dan kami akan melaksanakan apa dia datang detang membawanya, agar Tuhan kami berkenan mengampuni dosa-dosa kami dan apa yang telah kamu paksakan kepada kami untuk mempelajari sihir untuk melawan Musa. Dan Allah lebih baik bagi kami daripada kamu (wahai Fir’aun) dari segi balasan bagi orang-orang yang menaatiNya, dan lebih kekal siksaanNya atas orang yang bermaksiat kepadaNya dan melanggar perintahNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Sesungguhnya kami benar-benar telah beriman kepada Tuhan kami, dengan harapan agar Dia mengampuni amalan-amalan maksiat kami terdahulu berupa kekafiran atau lainnya, serta menghapus dosa-dosa sihir yang engkau paksa kami untuk mempelajarinya, mempraktekkannya, dan mengalahkan Musa dengannya, sungguh Allah lebih baik pahala-Nya dibandingkan balasan yang engkau janjikan kepada kami, dan Dia lebih kekal azab-Nya dibandingkan azab yang engkau ancamkan kepada kami.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. إِنَّآ ءَامَنَّا بِرَبِّنَا لِيَغْفِرَ لَنَا خَطٰيٰنَا (Sesungguhnya kami telah beriman kepada Tuhan kami, agar Dia mengampuni kesalahan-kesalahan kami) Yakni dosa-dosa yang telah kami lakukan seperti kekafiran dan lainnya. وَمَآ أَكْرَهْتَنَا عَلَيْهِ مِنَ السِّحْرِ ۗ( dan sihir yang telah kamu paksakan kepada kami melakukannya) Dan agar mengampuni dosa dari sihir yang kami lakukan karena paksaanmu untuk menakut-nakuti rakyat. وَاللهُ خَيْرٌ وَأَبْقَىٰٓ( Dan Allah lebih baik (pahala-Nya) dan lebih kekal) Yakni lebih baik pahala-Nya dan lebih kekal siksaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Sesungguhnya Kami beriman kepada Tuhan Kami yang Maha Pencipta supaya mengampuni dosa-dosa kami yang terdahulu berupa kekufuran dan dosa lainnya, dan mengampuni kegiatan sihir yang kau paksakan kepada kami (hal ini menunjukkan bahwa mereka mengetahui bahwa sihir itu menyesatkan dan tipu daya). Allah itu lebih baik pahalanya daripada kamu ketika ditaati dan lebih abadi azabnya ketika didurhakai"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kami telah beriman kepada Tuhan kami agar Dia mengampuni semua kesalahan kami dan sihir yang telah kamu paksa kepada kami. Allah lebih baik dan lebih kekal”} Allah lebih baik darimu pahalanya jika ditaati, dan lebih kekal azabnya darimu jika didurhakai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. “Sesungguhnya kami telah beriman kepada Rabb kami, agar Dia mengampuni kesalahan-kesalahan kami,” yaitu kekufuran dan maksiat-maksiat kami. Sesungguhnya keimanan menghapuskan kesalahan-kesalahan, dan taubat menutup dosa silam. Perkataan mereka, “Dan sihir yang telah kamu paksakan kepada kami untuk melakukannya,” yang kami gunakan untuk melawan kebenaran. Ini merupakan dalil bahwa mereka tidak berkehendak sendiri dalam perbuatan mereka tadi. Fir’aun lah yang memaksa mereka dengan sekuat tenaga. Secara eksplesit Nampak –wallahu a’lam- bahwasanya ketika Musa menyampaikan nasihat kepada mereka sebagaimana tertuang dalam Firman Allah, “Celakalah kamu, janganlah kamu mengadakan kedustaan terhadap Allah, maka Dia membinasakan kamu dengan siksa.” (Thaha:61), ternyata telah mempengaruhi mereka dan membekas pada diri mereka dengan kuat. Oleh karena itu, mereka saling berbantahan usai mendengarkan perkataan dan nasihat Musa. Kemudian Fir’aun menuntut dan memaksa mereka untuk melakukan makar yang telah mereka perbuat. Karena itu, para tukang sihir itu mengemukakan pernyataan Fir’aun tadi sebelum dia mendatangi mereka, di mana mereka mengatakan, “Sesungguhnya dua orang ini adalah benar-benar ahli sihir yang hendak mengusir kamu dari negeri kamu dengan sihirnya,” (Thaha:63), jadi mereka berbuat sesuai dengan cara yang sudah digasirkan Fir’aun dan dipaksakannya. Boleh jadi goresan yang mengendap di hati-hati mereka ini adalah disebabkan kebencian mereka untuk melawan kebenaran dengan kebatilan dan tindakan-tindakan yang telah mereka kerjakan dengan menutup mata. Itulah yang berpengaruh positif pada mereka, dan Allah merahmati mereka dengan itu dan mencurahkan taufik kepada mereka untuk beriman dan bertaubat. “Dan Allah lebih baik (pahalanya),” dari apa yang engkau janjikan berupa upah, kedudukan, dan jabatan “dan lebih kekal,” hanjaran dan kebaikanNya, tidak seperti yang diomongkan oleh Fir’aun, “dan sesungguhnya kamu akan mengetahui siapa di antara kita yang lebih pedih dan lebih kekal siksaannya.” (Thaha:71), dia bermaksud bahwa dirinya lebih pedih dan kekal siksaannya. Seluruh yang dikemukakan tentang kisah Musa dan Fir’aun telah disebutkan oleh Allah di dalamnya, yaitu apabila datang berdasarkan kisah para tukang sihir bahwasanya Fir’aun telah mengancam mereka dengan hukuman potong anggota badan dan penyaliban. Namun Allah tidak menyebutkan tentang pelaksanaannya. Begitu pula tidak ada hadits shahih yang menyinggungnya. Kepastian tejadi atau tidaknya tergantung pada keberadaan dalil. Allah –lah Yang Mahatahu tentang kejadian itu dan kejadian lainnya. [Akan tetapi, ancaman Fir’aun kepada para tukang sihir dengan hukuman itu bersamaan dengan kemampuannya untuk melakukannya adalah menjadi bukti peristiwa itu terjadi. Pasalnya, bila tidak berlangsung sudah pasti Allah menyebutkannya dan para ulama yang menyampaikan ilmu pun tentu akan menyepakatinya]."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 73: Untuk melawan Musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 73",
    "description": "Wahai fir'aun, kami benar-benar telah beriman dan akan memegang teguh kepercayaan kami kepada tuhan pencipta kami yang selama ini kami durhakai dan ingkari. Kami beriman dengan harapan agar dia mengampuni kesalahan-kesalahan kami yang telah mempersekutukan-Nya dan mengampuni dosa kami karena telah mempelajari dan mempraktikkan sihir yang telah engkau paksakan kepada kami. Dan Allah lebih baik pahala-Nya kepada orang yang taat daripada balasanmu kepada kami, dan dia lebih kekal kekuasaan serta azab-Nya bagi pendurhaka dibanding siksamu. 74. Sesungguhnya barang siapa meninggal dunia dan datang kepada tuhannya dalam keadaan berdosa dan tidak bertobat, maka sungguh, baginya adalah neraka jahanam. Dia tidak mati di dalamnya sehingga akan terus merasakan azab, dan tidak pula hidup dengan nyaman. ' demikianlah kondisi orang yang durhaka dan kafir."
  }
]