[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya barangsiapa yang datang (menghadap) kepada Tuhannya dalam keadaan kafir kepadaNya, maka baginya Neraka Jahanam. Dia akan disiksa dengannya. Dia tidak akan mati didalamnya sehingga bisa bebas darinya dan tidak (pula) hidup dengan kehidupan yang dapat dinikmatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Kesimpulannya adalah bahwa barangsiapa yang datang kepada Tuhannya hari Kiamat dalam keadaan kafir kepada-Nya, maka baginya adalah Neraka Jahanam, ia akan masuk tinggal di dalamnya kekal selama-lamanya, ia tidak akan mati agar berhenti merasakan azabnya, dan tidak pula merasakan hidup yang baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74-76. Kemudian mereka menyebutkan alasan keputusan mereka itu dengan berkata: “Barangsiapa yang menghadap Allah pada hari kiamat dalam keadaan bermaksiat dengan kejahatan-kejahatan yang dia perbuat dan dia mati dalam keadaan kafir, maka balasan baginya adalah neraka Jahannam, dia akan diazab di dalamnya dan tidak dapat mati agar bisa beristirahat dari azab dan tidak pula dapat hidup dengan kehidupan yang tenang. Dan barangsiapa yang menghadap Allah dalam keadaan beriman kepada-Nya dan telah mengerjakan amalan-amalan shalih, maka dia akan mendapat derajat yang tinggi di surga dan mereka akan kekal di dalamnya, di sana terdapat sungai-sungai yang mengalir di bawah istana-istana dan pepohonannya. Kedudukan yang agung ini merupakan balasan bagi orang yang menyucikan diri dari kotoran dosa dan kesyirikan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. لَا يَمُوتُ فِيهَا وَلَا يَحْيَىٰ (Ia tidak mati di dalamnya dan tidak (pula) hidup) Yakni tidak mati dengan kematian yang tenang, tidak pula hidup dengan hidup yang nyaman, ia merasakan sakit seperti orang hidup yang merasakan kematian dengan kematian yang buruk, dan kepekaannya terhadap rasa sakit tidak dapat hilang. Imam Ahmad dan Imam Muslim mengeluarkan hadits dari Abu Sa’id bahwa Rasulullah suatu hari sedang berkhutbah dan sampai pada ayat ini, kemudian beliau bersabda: “Adapun penghuni neraka yang sesungguhnya maka mereka tidak dalam keadaan mati dan tidak pula hidup, sedangkan orang-orang yang masuk neraka namun bukan merupakan penghuni neraka yang sesungguhnya maka api neraka akan mematikan mereka, kemudian para pemberi syafaat akan memberinya syafaat, maka sekelompok mereka akan dibawa ke suatu sungai yang disebut dengan sungai kehidupan, sehingga mereka akan tumbuh seakan-akan buih yang tumbuh pada aliran air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Sesungguhnya orang yang menemui Tuhannya dengan mati dalam keadaan kafir dan bermaksiat, maka baginya itu neraka Jahanam. Dia tidak mati sehingga bisa beristirahat di dalamnya, dan tidak hidup bahagia sehingga bisa menikmatinya (neraka)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya siapa saja yang datang kepada Tuhannya dalam keadaan berdosa} kafir {maka baginya neraka Jahanam. Dia tidak mati di dalamnya dan tidak pula hidup} dia tidak mati di dalamnya sehingga bisa beristirahat dari siksaan, dan tidak hidup dengan kehidupan yang baik dan tenang di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Allah memberitahukan bahwa orang yang mendatangiNya dan menghadapNya dalam keadaan berdosa, -sifat kejahatan menjadi cirinya dari setiap aspek, dan itu bisa menyebabkan kekufuran dan tetap menjalankannya sampai dia mati-, maka dia mendapatkan Neraka Jahanam yang pedih siksanya, yang besar rantai-rantainya, yang dasarnya sangat dalam, yang hawa panasnya sangat menyakitkan, yang berisi hukuman yang sanggup melumerkan hati dan jantung. Di antara bukti kedahsyatannya, orang yang tersiksa di dalamnya tidak mati juga tidak hidup. Ia tidak mati hingga dapat terbebas (dari deraan siksaan) dan tiidak juga menikmati hidup yang enak. Kehidupannya hanya sarat dengan siksaan yang mengenai hati, jiwa dan raganya, yang tidak dapat dikukur kadarnya dan tidak pernah mengendor sekejap saja. Ia berteriak minta tolong, tapi tidak ditolong. Dia memohon, akan tetapi tidak disambut permintaannya. Memang benar (ada pertolongan) bila dia meminta pertolongan. Dia ditolong dengan cairan semisal nanah yang membakar wajah-wajah mereka. Dan jika memohon, niscaya dijawab (pula dengan perkataan), “Celakalah kamu di dalamnya, janganlah kamu mengajakKu bicara.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 74: Yakni dalam keadaan kafir dan tetap di atasnya sampai mati. Yang keras siksanya, yang besar belenggunya, yang dalam dasarnya, dan yang panas apinya. Sehingga dapat beristirahat, yakni dia selalu merasakan azab. Hidupnya dipenuhi azab, baik yang menimpa hati, ruh maupun badan. Saat ia meminta pertolongan, ia tidak diberi, dan saat berdoa, ia tidak dikabulkan, bahkan Allah akan berfirman kepadanya, “Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan-Ku.” Lebih dari itu, ketika mereka kehausan, maka mereka akan diberi air seperti besi yang mendidih yang menghanguskan wajah. Yakni tidak bisa hidup untuk bersenang-senang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 74",
    "description": "Sesungguhnya barang siapa meninggal dunia dan datang kepada tuhannya dalam keadaan berdosa dan tidak bertobat, maka sungguh, baginya adalah neraka jahanam. Dia tidak mati di dalamnya sehingga akan terus merasakan azab, dan tidak pula hidup dengan nyaman. ' demikianlah kondisi orang yang durhaka dan kafir. 75-76. Tetapi, sebaliknya, barang siapa meninggal dunia dan datang kepada-Nya dalam keadaan beriman dan telah mengerjakan kebajikan sesuai tuntunan Allah dan rasul-Nya, maka mereka itulah orang yang memperoleh derajat yang tinggi dan mulia. Mereka akan mendapatkan surga-surga 'adn yang mengalir di bawahnya, yaitu di antara pepohonannya, sungai-sungai. Mereka kekal selama-lamanya di dalamnya. Itulah balasan bagi orang yang menyucikan dan menjauhkan diri dari kekafiran dan kemungkaran."
  }
]