[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-76. Dan barangsiapa datang kepada Tuhannya dalam keadaan beriman, lagi benar-benar telah melakukan amal-amal shalih, maka baginya tempat-tempat hunian yang tinggi di surga, tempat tinggal yang abadi, sungai-sungai yang mengalir di bawah istana-istana dan pohon-pohonnya. Mereka hidup kekal abadi di dalamnya. Kenikmatan abadi tersebut merupakan balasan pahala dari Allah bagi siapa saja yang telah membersihkan dirinya dari noda, kotoran, dan kesyirikan, serta dia hanya beribadah kepada Allah semata, taat kepadaNya, dan menjauhi maksiat-maksiat kepadaNya, serta menghadap kepada Tuhannya, dalam keadaan dia tidak menyekutukan seorang pun dari makhluknya denganNYa dalam beribadah kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Dan barangsiapa datang kepada Tuhannya pada hari Kiamat dalam keadaan beriman kepada-Nya, dan ia telah mengerjakan amal saleh, maka mereka yang memiliki kriteria seperti ini sungguh akan mendapatkan kedudukan tinggi dan derajat yang mulia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. ومن يأته مؤمنا قد عمل الصالحات (etapi barang siapa datang kepada-Nya dalam keadaan beriman, dan telah mengerjakan kebajikan) Yakni percaya kepada-Nya dan telah melakukan amal ketaatan. فَأُو۟لٰٓئِكَ لَهُمُ الدَّرَجٰتُ الْعُلَىٰ (maka mereka itulah orang-orang yang memperoleh tempat-tempat yang tinggi (mulia)) Yakni derajat-derajat yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Dan barangsiapa menemui Allah dengan mati dalam keadaan beriman tanpa menyekutukanNya dengan siapapun, dan mengerjakan apa yang diperintahkan olehNya berupa kefardhuan dan kesunnahan, maka bagi mereka itu tempat tinggi di sisi Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang datang kepadaNya dalam keadaan beriman dan telah beramal shalih, maka mereka itu adalah orang-orang yang memperoleh derajat yang tinggi} tinggi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75-76. Barangsiapa yang mendatangi Rabbnya dalam keadaan beriman, membenarkan para RasulNya, mengikuti kitab-kitabNYa, dan telah beramal shalih yang wajib maupun yang sunnah “maka mereka itulah orang-orang yang memperoleh tempat-tempat yang tinggi (mulia),” yaitu tempat-tempat yang tinggi di kamar-kamar yang penuh dengan hiasan, kenikmatan-kenikmatan yang berlangsung terus menerus, sungai-sungai yang mengalir, keabadian yang langgeng, keceriaan yang mendalam, yang tidak pernah tersaksikan oleh mata, didengar oleh telinga, dan tidak terbetik di hati seorang pun. “Dan itu,” pahala “adalah balasan bagi orang yang bersih,” yaitu bersih dari syirik, kekufuran, kefasikan, dan kedurhakaan, baik dengan cara tidak pernah menjamahnya secara keseluruhan atau telah bertaubat dari apa yang telah dia kerjakan. Dia pun membersihkan jiwanya, dan m emupuknya dengan keimanan dan amal shalih. Sesungguhnya proses tazkiyah memuat dua makna: membersihkan dan menghilangkan keburukan serta menambah raihan kebaikan. Kata “zakat” disebut dengan zakat atas dasar dua hal ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 75: Yang wajib maupun yang sunat. Mereka berada di tempat-tempat yang tinggi, ruangan-ruangan yang indah, kenikmatan yang kekal, dan dalam kebahagiaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 75",
    "description": "75-76. Tetapi, sebaliknya, barang siapa meninggal dunia dan datang kepada-Nya dalam keadaan beriman dan telah mengerjakan kebajikan sesuai tuntunan Allah dan rasul-Nya, maka mereka itulah orang yang memperoleh derajat yang tinggi dan mulia. Mereka akan mendapatkan surga-surga 'adn yang mengalir di bawahnya, yaitu di antara pepohonannya, sungai-sungai. Mereka kekal selama-lamanya di dalamnya. Itulah balasan bagi orang yang menyucikan dan menjauhkan diri dari kekafiran dan kemungkaran"
  }
]