[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah mewahyukan kepada Musa, “Keluarlah kamu di malam hari bersama hamba-hambaKu dari Bani Israil dari Mesir. Dan ambillah jalan yang kering bagi mereka di tengah laut . Jangan kamu khawatir terhadap Fir’aun dan tentaranya akan dapat mengejar kalian sehingga bisa menyusul kalian, dan kamu tidak usah takut akan tenggelam di dalam laut. “"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Dan sungguh telah Kami wahyukan kepada Musa, \"Pergilah bersama hamba-hamba-Ku dari negeri Mesir pada malam hari agar tidak diketahui oleh seorang pun, dan buatkanlah bagi mereka jalanan yang kering di lautan dengan memukulkan tongkatmu pada laut itu, engkau tidak perlu khawatir akan disusul oleh Fir'aun dan bala tentaranya, dan tidak perlu khawatir akan tenggelam ke dasar laut.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74-76. Kemudian mereka menyebutkan alasan keputusan mereka itu dengan berkata: “Barangsiapa yang menghadap Allah pada hari kiamat dalam keadaan bermaksiat dengan kejahatan-kejahatan yang dia perbuat dan dia mati dalam keadaan kafir, maka balasan baginya adalah neraka Jahannam, dia akan diazab di dalamnya dan tidak dapat mati agar bisa beristirahat dari azab dan tidak pula dapat hidup dengan kehidupan yang tenang. Dan barangsiapa yang menghadap Allah dalam keadaan beriman kepada-Nya dan telah mengerjakan amalan-amalan shalih, maka dia akan mendapat derajat yang tinggi di surga dan mereka akan kekal di dalamnya, di sana terdapat sungai-sungai yang mengalir di bawah istana-istana dan pepohonannya. Kedudukan yang agung ini merupakan balasan bagi orang yang menyucikan diri dari kotoran dosa dan kesyirikan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. أَنْ أَسْرِ بِعِبَادِى(Pergilah kamu dengan hamba-hamba-Ku) Yakni berjalanlah dengan mereka pada malam hari tanpa diketahui oleh orang lain. فَاضْرِبْ لَهُمْ طَرِيقًا فِى الْبَحْرِ يَبَسًا(maka buatlah untuk mereka jalan yang kering dilaut itu) Yakni buatlah jalan bagi mereka di tengah lautan yang telah menjadi kering; yang dimaksud adalah laut merah (Suez). Hal ini karena Allah mengeringkannya bagi mereka sebagai jalan sampai tidak ada air atau tanah basah sedikitpun. لَّا تَخٰفُ دَرَكًا(kamu tak usah khawatir akan tersusul) Yakni kamu aman dari kejaran musuh. وَلَا تَخْشَىٰ( dan tidak usah takut) Dari Fir’aun atau dari air laut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Dam sungguh Kami memerintah Musa: \"Tinggalkanlah Mesir bersama hamba-hambaKu Bani Israil pada malam hari. Lalu buatkanlah jalan yang kering dengan tongkatmu yang dipukulkan kepada laut, yaitu laut Suez supaya aman dari kejaran siapapun. Janganlah takut dengan jangkauan dan kejaran musuh, yaitu Fir’aun, dan janganlah takut tenggelam dalam laut ataupun dari Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah mewahyukan kepada Musa,“Berjalanlah bersama hamba-hambaKu} berjalanlah bersama hamba-hambaKu dari negeri Mesir pada malam hari {dan pukullah} dan jadikanlah {bagi mereka lautan itu sebagai jalan yang kering} yang kering {kamu tidak usah takut tersusul} tersusul oleh Fir’aun dan tentaranya {dan tidak usah khawatir (77)} tidak usah khawatir akan tenggelam di dalam laut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77-79. Setelah Musa unggul dengan bukti-bukti kebenarannya atas Fir’aun dan kaumnya, maka beliau menetap di MEsir guna menyeru mereka ke pangkuan Islam, mengusahakan penyelamatan Bani Israil dan Fir’aun dan siksanya. Sementara itu, Fir’aun masih dalam penentangan dan antipatinya. Sepak terjangnya memberatkan Bani Israil. Allah telah memperlihatkan kepada Musa tanda-tanda kebesaranNya dan pelajaran-pelajaran penting yang telah Allah ceritakan kepada kita sekalian dalam al-Quran. Adapun Bani Israil tidak berdaya untuk memperlihatkan keimanan mereka dan memproklamirkannya. Mereka menjadikan rumah-rumah mereka sebagai tempat ibadah, menahan kesabaran dari bahaya Fir’aun dan gangguannya. Maka, Allah berkehendak menyelamatkan mereka dari musuh mereka dan menempatkan mereka di dunia ini sebagai penguasa. Tujuannya, supaya mereka menyembahNya dengan terang-terangan dan menegakkan perintahNya. Maka Allah mewahyukan kepada nabiNya, Musa agar membuat janji kepada Bani Israil secara rahasia dan berjalan di awal malam hingga mereka dapat menempuh jarak yang jauh di bumi. Allah (juga) mengabarkan bahwa Fir’aun dan kaumnya akan mengejarnya. Maka mereka pun keluar di permulaan malam, semua orang dari kalangan Bani Israil (kaum lelaki), [mereka] dan wanita-wanita serta keturunan-keturunan mereka. Pada pagi harinya, para penduduk Mesir tidak menjumpai di tenga mereka ada orang yang menyeru dan orang yang menjawab dari kalangan Bani Israil. Geramlah musuh mereka, Fir’aun. Maka dia mengutus utusan di Mada’in untuk mengumpulkan orang-orang dan memprovokasi mereka untuk mau mengejar Bani Israil, [untuk menimpakan (hukuman) pada Bani Israil dan melampiaskan kemurkaannya. Namun, Allah mengalahkan ambisinya. Terkumpullah pasuikan Fir’aun. Maka Fir’aun merangsek berjalan bersama mereka untuk membuntuti Bani Israil]. \"Mereka berhasil menyusul Bani Israil di waktu matahari terbit. Ketika dua kelompok sudah dapat saling menyaksikan kelompok lainnya, para pengikut Musa berkata, “SEsungguhnya kita benar-benar akan tersusul.” Mereka pun dilanda kegelisahan dan ketakutan. Sementara itu, lautanlah yang ada di hadapan mereka, sedangkan Fir’aun (bersama pasukannya) berada di belakang mereka, dengan penuh marah dan murka kepada mereka. Adapun Musa, maka beliau dalam keadaan hati yang tenang, pikiran yang tentram, percaya dengan janji Rabbnya. Beliau berkata, \"\"Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku\". (ASy-Syuara:62). Kemudian Allah mewahyukan kepada beliau untuk memukulkan tongkatnya ke lautan. Beliaupun melakukannya. Maka terbelahlah dua belas jalan, air terlihat bagaikan gunung-gunung yang tinggi di sisi kanan dan kiri jalan. Allah mengeringkan jalan-jalan mereka yang mana air laut menyingkir darinya. Allah memerintahkan mereka agar tidak merasa khawatir akan kejaran Fir’aun dan agar tidak takut tenggelam di laut. Kemudian mereka melintasi jalan-jalan itu. Fir’aun dan pasukannya tiba lalu mengikuti di belakang mereka. Sampai akhirnya, seluruh kaum Musa telah berhasil keluar dari laut, sedangkan para pengikut Fir’aun masih berada di dalamnya. (Saat itulah) Allah memerintahkan lautan untuk menyatu hingga melumat mereka. Lalu mereka ditutup oleh laut yang menenggelamkan mereka. Semuanya tenggelam. Tidak ada seorang pun yang selamat. Bani Israil menyaksikan (kehancuran) musuh mereka. Allah telah menyejukan pandangan mereka dengan (melihat) kehancuran musuh. Inilah kesudahan kekufuran, kesesatan, dan keengganan memegangi hidayah Allah. Karena itu, Allah berfirman, “Dan Fir’aun telah menyesatkan kaumnya,” dengan cara mempercantik gambaran kekufuran pada mereka dan mencoreng syariat yang dibawa oleh Musa serta pelecehannya terhadap mereka. Fir’aun tidak memberikan hidayah kepada mereka dalam kesempatan apapun. Akibatnya, dia menjerumuskan mereka di lembah-lembah kekeliruan dan kesesatan, lantas menjebloskan mereka ke tempat siksa dan hukumannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 77: Ketika Musa telah menunjukkan bukti-bukti kebenarannya kepada Fir’aun dan kaumnya, Beliau tinggal di Mesir mengajak mereka masuk Islam dan berusaha melepaskan bani Israil dari cengkraman Fir’aun dan penyiksaannya, sedangkan Fir’aun di atas sikap melampaui batas dan menjauh dari kebenaran, tugas yang diberikannya kepada bani Israil begitu berat. Allah memperlihatkan kepadanya ayat-ayat-Nya dan sesuatu yang dapat diambil pelajaran sebagaimana yang disebutkan dalam banyak ayat di dalam Al Qur’an. Ketika itu, bani Israil tidak mampu menampakkan keimanannya, oleh karenanya mereka menjadikan rumah mereka sebagai masjid atau tempat shalat, dan mereka tetap bersabar terhadap Fir’aun dan gangguannya. Allah hendak menyelamatkan mereka dari musuh mereka, memberikan tempat kepada mereka di bumi dan agar mereka dapat beribadah kepada-Nya secara terang-terangan serta melaksanakan perintah-Nya, maka Allah mewahyukan kepada Nabi-Nya Musa ‘alaihis salam untuk membawa pergi bani Israil di malam hari dan memberitahukan kepadanya bahwa Fir’aun dan kaumnya akan menyusul mereka. Berangkatlah bani Israil di awal malam, baik laki-laki, wanita maupun anak-anak. Ketika pagi harinya, ternyata di sana sudah tidak ada lagi yang memanggil dan memenuhi panggilan (agak sepi), maka Fir’aun marah dan mengirimkan orang-orangnya untuk mengumpulkan kaumnya mendorong mereka untuk keluar mengejar bani Israil demi melampiaskan kemarahaannya, namun Allah berkuasa terhadap urusannya, akan tetapi kebanyakan manusia tidak mengetahui. Ketika itu berkumpullah semua tentara Fir’aun lalu mereka pergi bersama Fir’aun mendatangi bani Israil, dan mereka pun dapat menyusulnya di pagi hari. Saat bani Israil melihat pasukan Fir’aun, mereka pun kebingungan dan gelisah; Fir’aun di belakang mereka sedangkan laut di depan mereka, namun Musa tetap tenang dan yakin terhadap janji Tuhannya, dia berkata, “Sekali-kali kita tidak akan tersusul! Sesungguhnya Tuhanku bersamaku, Dia akan memberi petunjuk kepadaku.” Maka Allah mewahyukan kepadanya untuki memukul laut dengan tongkatnya, lalu Musa memukulnya dan terbukalah 12 jalan, dan ketika itu air laut seperti gunung yang tinggi; di kanan dan di kiri jalan, Allah juga mengeringkan jalan yang mereka lalui, maka bani Israil menempuh jalan-jalan itu, lalu Fir’aun dan tentaranya mengikuti jalan itu. Ketika kaum Musa telah keluar dari laut itu seluruhnya, sedangkan Fir’aun dan tentaranya masih berada di jalan-jalan tersebut, maka Allah memerintahkan laut untuk menyatu dan tenggelamlah mereka dalam laut itu tanpa ada yang selamat, sedangkan bani Israil menyaksikan musuh mereka tenggelam sehingga hati mereka pun puas, inilah akibat dari kekafiran dan kesesatan, serta tidak menggunakan petunjuk Allah Subhaanahu wa Ta'aala. Membuat jalan yang kering di dalam laut itu ialah dengan memukul laut itu dengan tongkat. Lihat ayat 63 surat Asy Syu'araa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 77",
    "description": "Nabi musa berhasil mengalahkan para penyihir itu dan mengajak mereka beriman. Dan sungguh, telah kami wahyukan kepada musa suatu pesan berisi, 'tinggalkanlah mesir. Pergilah bersama hamba-hamba-ku, yaitu bani israil, pada malam hari, dan pukullah tongkatmu untuk menyediakan bagi mereka jalan yang kering di laut. Dengan kuasa Allah, terbentanglah jalan yang kering di laut sehingga engkau tidak perlu takut akan tersusul oleh fir'aun dan tentaranya, dan juga tidak perlu khawatir akan tenggelam di laut itu. '78. Mengetahui nabi musa dan bani israil meninggalkan mesir, kemudian fir'aun dengan bala tentaranya mengejar mereka melalui jalan kering di laut itu, tetapi sebelum berhasil menyusul nabi musa dan bani israil, mereka digulung ombak laut yang datang tiba-tiba dan kemudian menenggelamkan mereka. Itulah balasan bagi orang yang sesat dan durhaka kepada tuhan."
  }
]