[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa berjalan di malam hari bersama orang-orang Bani Israil, dan menyebrangi jalan bersama mereka di tengah laut. Fir’aun dan bala tentaranya membuntuti mereka. Maka Allah mengepung mereka dengan air yang tidak ada yang mengetahui kadar jumlahnya kecuali Allah, sehingga mereka semua tenggelam, sedang Musa dan kaumnya selamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Maka Fir'aun beserta bala tentaranya pun mengejar mereka, akan tetapi ia dan bala tentaranya tersebut digulung oleh ombak lautan yang hakikatnya tidak diketahui kecuali oleh Allah. Mereka semua pun tenggelam dan binasa, sedangkan Musa dan orang-orang yang bersamanya selamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78-79. Ketika Musa melaksanakan itu, Fir’aun dan bala tentaranya mengejar mereka agar dapat membunuh mereka, akan tetapi ombak lautan menggulung Fir’aun dan bala tentaranya sehingga mereka tenggelam sebelum mereka dapat menangkap Musa dan orang-orang yang bersamanya. Fir’aun telah menyesatkan kaumnya dari kebenaran dan dia tidak memberi mereka petunjuk kepada kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. فَأَتْبَعَهُمْ فِرْعَوْنُ بِجُنُودِهِۦ (Maka Fir’aun dengan bala tentaranya mengejar mereka) Yakni Fir’aun bersama bala tentaranya mengejar mereka. فَغَشِيَهُم مِّنَ الْيَمِّ مَا غَشِيَهُمْ (lalu mereka ditutup oleh laut yang menenggelamkan mereka) Pengulangan kata (غشيهم) untuk menunjukkan betapa besar dan mengerikan kejadian tersebut. Pendapat lain mengatakan makna (غشيهم) adalah mereka tenggelam dalam kisah yang mereka dengar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Lalu Fir’aun dan pasukannya mengikuti mereka. Kemudian mereka dilanda dan ditimpa air laut yang menenggelamkan mereka. (Dan pengulangan {Ghasyiyahum} yang bermakna melanda mereka itu untuk memberi kesan hiperbola dan ancaman) yaitu mereka diterpa air dan ditenggelamkan semua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Fir‘aun dengan tentaranya mengejar mereka} mengikuti mereka {lalu mereka digulung} ditenggelamkan {lautan} lautan {sehingga menenggelamkan mereka} apa yang menggulung mereka kemudian menenggelamkan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77-79. Setelah Musa unggul dengan bukti-bukti kebenarannya atas Fir’aun dan kaumnya, maka beliau menetap di MEsir guna menyeru mereka ke pangkuan Islam, mengusahakan penyelamatan Bani Israil dan Fir’aun dan siksanya. Sementara itu, Fir’aun masih dalam penentangan dan antipatinya. Sepak terjangnya memberatkan Bani Israil. Allah telah memperlihatkan kepada Musa tanda-tanda kebesaranNya dan pelajaran-pelajaran penting yang telah Allah ceritakan kepada kita sekalian dalam al-Quran. Adapun Bani Israil tidak berdaya untuk memperlihatkan keimanan mereka dan memproklamirkannya. Mereka menjadikan rumah-rumah mereka sebagai tempat ibadah, menahan kesabaran dari bahaya Fir’aun dan gangguannya. Maka, Allah berkehendak menyelamatkan mereka dari musuh mereka dan menempatkan mereka di dunia ini sebagai penguasa. Tujuannya, supaya mereka menyembahNya dengan terang-terangan dan menegakkan perintahNya. Maka Allah mewahyukan kepada nabiNya, Musa agar membuat janji kepada Bani Israil secara rahasia dan berjalan di awal malam hingga mereka dapat menempuh jarak yang jauh di bumi. Allah (juga) mengabarkan bahwa Fir’aun dan kaumnya akan mengejarnya. Maka mereka pun keluar di permulaan malam, semua orang dari kalangan Bani Israil (kaum lelaki), [mereka] dan wanita-wanita serta keturunan-keturunan mereka. Pada pagi harinya, para penduduk Mesir tidak menjumpai di tenga mereka ada orang yang menyeru dan orang yang menjawab dari kalangan Bani Israil. Geramlah musuh mereka, Fir’aun. Maka dia mengutus utusan di Mada’in untuk mengumpulkan orang-orang dan memprovokasi mereka untuk mau mengejar Bani Israil, [untuk menimpakan (hukuman) pada Bani Israil dan melampiaskan kemurkaannya. Namun, Allah mengalahkan ambisinya. Terkumpullah pasuikan Fir’aun. Maka Fir’aun merangsek berjalan bersama mereka untuk membuntuti Bani Israil]. \"Mereka berhasil menyusul Bani Israil di waktu matahari terbit. Ketika dua kelompok sudah dapat saling menyaksikan kelompok lainnya, para pengikut Musa berkata, “SEsungguhnya kita benar-benar akan tersusul.” Mereka pun dilanda kegelisahan dan ketakutan. Sementara itu, lautanlah yang ada di hadapan mereka, sedangkan Fir’aun (bersama pasukannya) berada di belakang mereka, dengan penuh marah dan murka kepada mereka. Adapun Musa, maka beliau dalam keadaan hati yang tenang, pikiran yang tentram, percaya dengan janji Rabbnya. Beliau berkata, \"\"Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku\". (ASy-Syuara:62). Kemudian Allah mewahyukan kepada beliau untuk memukulkan tongkatnya ke lautan. Beliaupun melakukannya. Maka terbelahlah dua belas jalan, air terlihat bagaikan gunung-gunung yang tinggi di sisi kanan dan kiri jalan. Allah mengeringkan jalan-jalan mereka yang mana air laut menyingkir darinya. Allah memerintahkan mereka agar tidak merasa khawatir akan kejaran Fir’aun dan agar tidak takut tenggelam di laut. Kemudian mereka melintasi jalan-jalan itu. Fir’aun dan pasukannya tiba lalu mengikuti di belakang mereka. Sampai akhirnya, seluruh kaum Musa telah berhasil keluar dari laut, sedangkan para pengikut Fir’aun masih berada di dalamnya. (Saat itulah) Allah memerintahkan lautan untuk menyatu hingga melumat mereka. Lalu mereka ditutup oleh laut yang menenggelamkan mereka. Semuanya tenggelam. Tidak ada seorang pun yang selamat. Bani Israil menyaksikan (kehancuran) musuh mereka. Allah telah menyejukan pandangan mereka dengan (melihat) kehancuran musuh. Inilah kesudahan kekufuran, kesesatan, dan keengganan memegangi hidayah Allah. Karena itu, Allah berfirman, “Dan Fir’aun telah menyesatkan kaumnya,” dengan cara mempercantik gambaran kekufuran pada mereka dan mencoreng syariat yang dibawa oleh Musa serta pelecehannya terhadap mereka. Fir’aun tidak memberikan hidayah kepada mereka dalam kesempatan apapun. Akibatnya, dia menjerumuskan mereka di lembah-lembah kekeliruan dan kesesatan, lantas menjebloskan mereka ke tempat siksa dan hukumannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 78",
    "description": "Mengetahui nabi musa dan bani israil meninggalkan mesir, kemudian fir'aun dengan bala tentaranya mengejar mereka melalui jalan kering di laut itu, tetapi sebelum berhasil menyusul nabi musa dan bani israil, mereka digulung ombak laut yang datang tiba-tiba dan kemudian menenggelamkan mereka. Itulah balasan bagi orang yang sesat dan durhaka kepada tuhan. 79. Dan sejak dulu sampai meninggalnya fir'aun memang telah menyesatkan kaumnya dan tidak pernah memberi petunjuk ke jalan yang benar."
  }
]