[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Fir’aun telah menyesatkan kaumnya dengan apa yang telah dia tampakkan indah pada mata mereka berupa kekafiran dan pendustaan dan tidaklah dia memandu mereka menuju jalan hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Dan Fir'aun telah menyesatkan kaumnya dengan memperindah kekafiran kepada mereka, menipu mereka dengan berbagai kebatilan, dan tidak menunjukkan mereka jalan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. وَأَضَلَّ فِرْعَوْنُ قَوْمَهُۥ (Dan Fir’aun telah menyesatkan kaumnya) Menyesatkan mereka dari petunjuk, dan dia tidak menuntun mereka ke jalan keselamatan ketika dia berjalan bersama mereka pada jalan yang ditempuh oleh Bani Israil di tengah lautan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Fir’aun menyesatkan kaumnya dari petunjuk dalam agama dan apa yang menunjukkan mereka kepada kebaikan dengan menyeru mereka untuk menuhankan dan menyembahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Fir‘aun telah menyesatkan kaumnya dan tidak memberi petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77-79. Setelah Musa unggul dengan bukti-bukti kebenarannya atas Fir’aun dan kaumnya, maka beliau menetap di MEsir guna menyeru mereka ke pangkuan Islam, mengusahakan penyelamatan Bani Israil dan Fir’aun dan siksanya. Sementara itu, Fir’aun masih dalam penentangan dan antipatinya. Sepak terjangnya memberatkan Bani Israil. Allah telah memperlihatkan kepada Musa tanda-tanda kebesaranNya dan pelajaran-pelajaran penting yang telah Allah ceritakan kepada kita sekalian dalam al-Quran. Adapun Bani Israil tidak berdaya untuk memperlihatkan keimanan mereka dan memproklamirkannya. Mereka menjadikan rumah-rumah mereka sebagai tempat ibadah, menahan kesabaran dari bahaya Fir’aun dan gangguannya. Maka, Allah berkehendak menyelamatkan mereka dari musuh mereka dan menempatkan mereka di dunia ini sebagai penguasa. Tujuannya, supaya mereka menyembahNya dengan terang-terangan dan menegakkan perintahNya. Maka Allah mewahyukan kepada nabiNya, Musa agar membuat janji kepada Bani Israil secara rahasia dan berjalan di awal malam hingga mereka dapat menempuh jarak yang jauh di bumi. Allah (juga) mengabarkan bahwa Fir’aun dan kaumnya akan mengejarnya. Maka mereka pun keluar di permulaan malam, semua orang dari kalangan Bani Israil (kaum lelaki), [mereka] dan wanita-wanita serta keturunan-keturunan mereka. Pada pagi harinya, para penduduk Mesir tidak menjumpai di tenga mereka ada orang yang menyeru dan orang yang menjawab dari kalangan Bani Israil. Geramlah musuh mereka, Fir’aun. Maka dia mengutus utusan di Mada’in untuk mengumpulkan orang-orang dan memprovokasi mereka untuk mau mengejar Bani Israil, [untuk menimpakan (hukuman) pada Bani Israil dan melampiaskan kemurkaannya. Namun, Allah mengalahkan ambisinya. Terkumpullah pasuikan Fir’aun. Maka Fir’aun merangsek berjalan bersama mereka untuk membuntuti Bani Israil]. \"Mereka berhasil menyusul Bani Israil di waktu matahari terbit. Ketika dua kelompok sudah dapat saling menyaksikan kelompok lainnya, para pengikut Musa berkata, “SEsungguhnya kita benar-benar akan tersusul.” Mereka pun dilanda kegelisahan dan ketakutan. Sementara itu, lautanlah yang ada di hadapan mereka, sedangkan Fir’aun (bersama pasukannya) berada di belakang mereka, dengan penuh marah dan murka kepada mereka. Adapun Musa, maka beliau dalam keadaan hati yang tenang, pikiran yang tentram, percaya dengan janji Rabbnya. Beliau berkata, \"\"Sekali-kali tidak akan tersusul; sesungguhnya Tuhanku besertaku, kelak Dia akan memberi petunjuk kepadaku\". (ASy-Syuara:62). Kemudian Allah mewahyukan kepada beliau untuk memukulkan tongkatnya ke lautan. Beliaupun melakukannya. Maka terbelahlah dua belas jalan, air terlihat bagaikan gunung-gunung yang tinggi di sisi kanan dan kiri jalan. Allah mengeringkan jalan-jalan mereka yang mana air laut menyingkir darinya. Allah memerintahkan mereka agar tidak merasa khawatir akan kejaran Fir’aun dan agar tidak takut tenggelam di laut. Kemudian mereka melintasi jalan-jalan itu. Fir’aun dan pasukannya tiba lalu mengikuti di belakang mereka. Sampai akhirnya, seluruh kaum Musa telah berhasil keluar dari laut, sedangkan para pengikut Fir’aun masih berada di dalamnya. (Saat itulah) Allah memerintahkan lautan untuk menyatu hingga melumat mereka. Lalu mereka ditutup oleh laut yang menenggelamkan mereka. Semuanya tenggelam. Tidak ada seorang pun yang selamat. Bani Israil menyaksikan (kehancuran) musuh mereka. Allah telah menyejukan pandangan mereka dengan (melihat) kehancuran musuh. Inilah kesudahan kekufuran, kesesatan, dan keengganan memegangi hidayah Allah. Karena itu, Allah berfirman, “Dan Fir’aun telah menyesatkan kaumnya,” dengan cara mempercantik gambaran kekufuran pada mereka dan mencoreng syariat yang dibawa oleh Musa serta pelecehannya terhadap mereka. Fir’aun tidak memberikan hidayah kepada mereka dalam kesempatan apapun. Akibatnya, dia menjerumuskan mereka di lembah-lembah kekeliruan dan kesesatan, lantas menjebloskan mereka ke tempat siksa dan hukumannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 79: Karena mengajak mereka menyembahnya. Demikian juga karena ia menghiasi kekufuran di hadapan kaumnya, memperburuk apa yang dibawa Nabi Musa ‘alaihis salam dan mempengaruhi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 79",
    "description": "Dan sejak dulu sampai meninggalnya fir'aun memang telah menyesatkan kaumnya dan tidak pernah memberi petunjuk ke jalan yang benar. 80. Mengingatkan betapa besar nikmat-Nya kepada bani israil, Allah berfirman, 'wahai bani israil! sungguh, kami telah menyelamatkan kamu dari musuhmu, yaitu fir'aun dan tentaranya, dan kami telah mengadakan perjanjian dengan kamu melalui nabi musa untuk bermunajat dan berada di tempat yang telah ditetapkan, yaitu di sebelah kanan gunung sinai, dan kami telah menurunkan kepada kamu mann dan salwa sebagai bahan akanan untuk kelangsungan hidupmu."
  }
]