[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah, Dia-lah yang tidak ada sesembahan yang berhak diibadahi kecuali Dia. bagiNya Nama-nama yang sempurna dalam keindahannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dia lah Allah, tiada tuhan yang berhak disembah selain-Nya, Dia sendirilah yang memiliki kesempurnaan nama yang paling indah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Bagi Allah segala bentuk penyembahan, tidak ada yang berhak disembah selain Dia, hanya milik-Nya nama-nama yang sempurna kebaikannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. لَهُ الْأَسْمَآءُ الْحُسْنَىٰ (Dia mempunyai al asmaaul husna) Yakni nama-nama terbaik yang menunjukkan segala kesempurnaan dan keagungan yang berjumlah 99 nama yang disebutkan dalam hadits shahih. Penjelasan tentang asma’ul husna telah disebutkan dalam surat al-A’raf: 180."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dialah Allah yang Maha Esa, Tiada Tuhan yang layak disembah selain Dia. MilikNya itu sebagik-baik nama yang menunjukkan pada kesempurnaan yang jumlahnya 99. Hal itu dikuatkan oleh hadits shahih."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah, tidak ada tuhan selain Dia. MilikNyalah nama-nama yang terbaik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Sesudah menetapkan kesempurnaanNya yang mutlak dengan keumuman penciptaanNya, dan ketetapan perintah dan laranganNya yang umum (Bagi semua makhluk), keumuman rahmatNya, besarnya keagunganNya, keberadaanNya yang tinggi di atas ‘Arasy, luasnya wilayah kekuasaan dan ilmuNya, dapat diambil kesimpulan bahwa DIa-lah yang berhak untuk diibadahi, peribadahan kepadaNya ialah yang benar, yang sejalan oleh aturan syariat, nalar, dan fitrah. Sementara menyembah selainNya merupakan kebatilan. Allah berfirman, “Dia-lah Allah, tidak ada sesembahan (yang berhak disembah) kecuali Dia,” maksudnya tidak ada sesembahan dan tuhan yang berhak disembah dengan penuh kecintaan dan menghinakan diri, rasa takut, pengharapan, mahabbah, inabah, dan doa kecuali Dia. “Dia mempunyai Asma’ al-HUsna (nama-nama yang paling baik),” Allah mempunyai nama-nama yang banyak yang sempurna lagi paling baik. Di antara sisi keindahannya, semua nama itu merupakan nama-nama yang menunjukkan pujian. Tidak ada nama yang menunjukkan puian dan sanjungan. Sebagian dari sisi keindahannya, bahwa nama-nama itu bukan sekedar nama-nama semata, akan tetapi nama-nama dan sekaligus (menunjukkan) sifat-sifat yang terkandung di dalamnya. Aspek keindahan lainnya, nama-nama itu menunjukkan sifat-sifat yang sempurna. Dan pada sifat-sifat itu bila dibandingkan dengan sifat lainnya menempati tingkatan yang paling sempurna, umum lagi agung. Aspek keelokannya, Allah memerintahkan para hambaNya untuk berdoa kepadaNya dengannya. Karena nama-nama itu termasuk (piranti) untuk bertawasul yang mendekatkan diri kepada Allah. Allah mencitainya (nama-nama itu), dan para pencintanya juga menyukainya dan menhafalnya. Dan Allah mencintai orang-orang yang mendalami makna-maknanya dan menghambakan diri kepada Allah dengannya. Allah berfirman, \"Hanya milik Allah asmaulhusna, maka bermohonlah kepada-Nya dengan menyebut asmaaulhusna\" (Al-A’raf:180)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 8: Setelah Allah Subhaanahu wa Ta'aala menetapkan kesempurnaan-Nya yang mutlak dengan meratanya ciptaan-Nya, meratanya perintah dan larangan-Nya, meratanya rahmat-Nya, besarnya keagungan-Nya, tingginya Dia di atas ‘arsy-Nya. Meratanya kerajaan-Nya, dan merata pula ilmu-Nya kepada segala sesuatu, maka yang demikian menghasilkan kesimpulan, bahwa Dialah yang berhak untuk diibadahi, dan bahwa beribadah kepada-Nya adalah hak (benar) yang sesuai dengan syara’, akal, dan fitrah, sedangkan beribadah kepada selain-Nya adalah batil. Saking indahnya, nama-nama tersebut seluruhnya menunjukkan pantasnya Dia mendapat pujian, di mana tidak ada satu pun nama kecuali menunjukkan keberhakan-Nya dipuji. Demikian pula saking indahnya, nama-nama tersebut tidak hanya sekedar nama, tetapi nama sekaligus sifat-Nya. Saking indahnya pula, nama-nama tersebut menunjukkan sifat-sifat yang sempurna, dan bahwa dari setiap sifat, Dia memiliki sifat yang paling sempurna, paling merata dan paling agung. Saking indahnya pula, Dia menyuruh hamba-hamba-Nya berdoa dengannya, di mana ia termasuk sarana yang dapat mendekatkan diri kepadanya lagi dicintai-Nya, Dia mencintai orang-orang yang mencintai nama-nama itu, mencintai orang yang menghapalnya, mencintai orang yang menggali kandungannya dan beribadah kepada-Nya dengan nama-nama itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 8",
    "description": "Dialah Allah yang tidak ada tuhan penguasa alam semesta yang patut disembah selain dia. Hanya dia pula yang mempunyai nama-nama yang terbaik. 9. Usai menjelaskan keagungan Al-Qur'an dan tugas berat yang diamanahkan kepada rasulullah, pada ayat-ayat berikut Allah menguraikan kisah nabi musa yang juga diberi amanah berat, yaitu berdakwah kepada fir'aun yang sangat ingkar. Kisah ini dimaksudkan untuk menguatkan nabi Muhammad dalam berdakwah. Dan apakah telah sampai kepadamu, wahai nabi Muhammad, kisah musa saat akan menerima tugas kerasulan'."
  }
]