[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Bani Israil, ingat-ingatlah ketika Kami menyelamatkan kalian dari musuh kalian, Fir’aun, dan Kami adakan perjanjian bagi kalian di sisi kanan gunung Thursina (Sinai) untuk menurunkan Taurat kepada kalian, serta Kami telah menurunkan pada kalian saat kalian tersesat arah apa yang dapat kalian makan yang menyerupai madu dalam hal rasa dan burung yang menyerupai burung puyuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Lalu Kami katakan kepada Bani Israil setelah Kami selamatkan mereka dari Fir'aun dan bala tentaranya, \"Wahai Bani Israil, Kami telah menyelamatkan kalian dari musuh kalian, Kami telah menjanjikan kalian agar Kami berbicara dengan Musa di sebelah kanan lembah yang terletak di samping Bukit Ṭur, dan Kami telah menurunkan kepada kalian dalam masa pengembaraan kalian sebagian dari nikmat Kami berupa minuman manis seperti madu, dan burung kecil yang memiliki daging enak seperti puyuh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80-82. Setelah pertempuran singkat ini, Allah menyampaikan kepada golongan yang menang: “Hai para keturunan Ya’qub, Kami telah menolong kalian dari kekejaman musuh ini, dan Kami telah menjanjikan rasul kalian, Musa, untuk berbicara dengannya tentang kerasulan di sisi gunung Thur di padang pasir Sina pada sisi kanan Musa yang mengarah dari Madyan yang ada di Syam menuju Mesir. Dan di padang pasir Sina, Kami telah menurunkan bagi kalian berbagai kenikmatan seperti makanan yang manis dan daging burung yang lezat. Makanlah makanan halal yang lezat yang telah Kami rezekikan kepada kalian dan janganlah kalian menyelisihi perintah-Ku dan melanggar larangan-larangan-Ku sehingga kalian dapat tertimpa kemurkaan dan kemarahan-Ku; dan barangsiapa yang tertimpa kemurkaan-Ku maka dia pasti akan binasa. Sungguh Aku memiliki ampunan yang besar bagi orang yang bertaubat dan beriman kepada-Ku serta menjalankan amalan-amalan shalih kemudian beristiqamah dalam menjalankannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. يٰبَنِىٓ إِسْرٰٓءِيلَ (Hai Bani Israil) Yakni Kami berfirman setelah menyelamatkan mereka “Hai Bani Israil. قَدْ أَنجَيْنٰكُم مِّنْ عَدُوِّكُمْ وَوٰعَدْنٰكُمْ جَانِبَ الطُّورِ الْأَيْمَنَ(sesungguhnya Kami telah menyelamatkan kamu sekalian dari musuhmu, dan Kami telah mengadakan perjanjian dengan kamu sekalian (untuk munajat) di sebelah kanan gunung itu) Kami memerintahkan Musa untuk pergi bersama kalian agar Kami dapat berbicara kepadanya dengan kehadiran kalian, sehingga kalian dapat mendengarkan kalam yang difirmankan Allah kepada Musa. Yakni Allah membuat perjanjian dengan Musa agar dia pergi bersama sekelompok kaumnya yang terpilih. Dan tempat perjanjian itu di sisi kanan gunung Thur yang terletak di Sina. وَنَزَّلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَىٰ( dan Kami telah menurunkan kepada kamu sekalian manna dan salwa) Tafsir dari mann dan salwa telah disebutkan dalam surat al-Baqarah: 57."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Hal itu dihubungkan dengan sejumlah kenikmatan atas Bani Israil. Wahai Bani Israil, sungguh Kami telah menyelamatkan kalian dari musuh kalian, yaitu Fir’aun dan kaumnya, dengan menenggelamkan mereka. Kami juga telah menjanjikan rasul kalian, Musa untuk menerima kitab Taurat di sisi bukit Thur di Sinai di sisi sebelah kanan Musa, yaitu ketika dia berjalan dari Madyan menuju Mesir. Dan Kami telah menurunkan kepada kalian itu Manna, yaitu jenis manisan yang terkumpul di atas dedaunan pohon, dan Salwa, yaitu burung yang enak dagingnya, yaitu burung puyuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Bani Israil, sungguh Kami telah menyelamatkan kalian dari musuh kalian, mengadakan perjanjian dengan kalian di sebelah kanan gunung Thur dan menurunkan kepada kalian manna dan salwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Allah mengingatkan Bani Israil tentang kenikmatan besar yang tercurahkan pada mereka berupa pembinasaan musuh mereka dan penyelenggaraan dengan Musa di sisi kanan gunung Thursina untuk Kami turunkan kitab kepadanya, yang berisi hukum-hukum yang agung dan berita-berita yang baik. Maka lengkaplah kenikmatan agama pada mereka usai pelimpahan nikmat duniawi. Dia juga mengingatkan kenikmatanNya pada mereka saat mereka berada dalam suasana tersesat jalan dengan menurunkan manna dan salwa, serta rizki yang lapang lagi menyenangkan, yang hadir pada mereka tanpa perlu susah payah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 80: Allah Subhaanahu wa Ta'aala mengingatkan kepada bani Israil nikmat-Nya yang besar yang diberikan kepada mereka, yaitu dibinasakan-Nya musuh mereka dan diturunkan-Nya kitab Taurat yang di sana terdapat hukum-hukum yang agung dan berita-berita yang besar, sehingga sempurnalah nikmat agama yang mereka peroleh setelah nikmat dunia. Demikian pula nikmat-Nya yang diberikan kepada mereka di saat mereka tersesat di padang sahara, yaitu Manna dan Salwa serta rezeki yang lapang tanpa susah payah. Bani Israil yang dipanggil ini adalah orang-orang Yahudi pada zaman Nabi Muhammad shallallahu 'alaihi wa sallam, dan mereka diseru dengan menyebutkan nikmat-nikmat Allah yang diberikan-Nya kepada nenek-moyang mereka pada zaman Nabi Musa ‘alaihis salam agar mereka siap menerima firman Allah Ta’ala yang ditujukan kepada mereka. Yaitu Fir’aun dengan menenggelamkannya. Yang bermunajat dengan Allah ialah Nabi Musa ‘alaihis salam tetapi di sini disebut kamu sekalian karena manfaat munajat itu kembali kepada Nabi Musa ‘alaihis salam dan bani Israil semuanya. Perjanjian yang dijanjikan itu adalah untuk bermunajat dan menerima Taurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 80",
    "description": "Mengingatkan betapa besar nikmat-Nya kepada bani israil, Allah berfirman, 'wahai bani israil! sungguh, kami telah menyelamatkan kamu dari musuhmu, yaitu fir'aun dan tentaranya, dan kami telah mengadakan perjanjian dengan kamu melalui nabi musa untuk bermunajat dan berada di tempat yang telah ditetapkan, yaitu di sebelah kanan gunung sinai, dan kami telah menurunkan kepada kamu mann dan salwa sebagai bahan akanan untuk kelangsungan hidupmu. 81. Dengan semua anugerah itu, makanlah dari rezeki yang baik-baik yang telah kami berikan kepadamu, yaitu mann dan salwa, dan janganlah melampaui batas. Jangan langgar tuntunan-ku yang pada akhirnya menyebabkan kemurkaan-ku akan menimpamu. Ketahuilah, barang siapa ditimpa kemurkaan-ku, maka sungguh binasalah dia akibat siksa itu."
  }
]