[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Makanlah dari rizki Kami yang baik-baik, dan janganlah kalian melampaui batas padanya dengan cara sebagian kalian menzhalimi sebagian yang lain, akibatnya kemurkaanKu akan menimpa kalian. Dan siapa saja yang ditimpa kemurkaanKu, sungguh dia akan binasa dan merugi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Maka makanlah makanan halal yang lezat dari rezeki yang Kami berikan kepada kalian, dan janganlah melampaui batasan yang kami bolehkan dengan memakan yang haram, yang menyebabkan turunnya kemurkaan-Ku atas kalian, dan barangsiapa ditimpa kemurkaan-Ku maka sungguh binasa dan sengsaralah ia di dunia dan di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. كُلُوا۟ مِن طَيِّبٰتِ مَا رَزَقْنٰكُمْ (Makanlah di antara rezeki yang baik yang telah Kami berikan kepadamu) Yang dimaksud dengan (الطيبات) adalah makanan-makanan halal yang lezat. وَلَا تَطْغَوْا۟ فِيهِ(dan janganlah melampaui batas padanya) Jangan kalian melampaui rezeki yang halal menuju yang tidak halal. Pendapat lain mengatakan maknanya adalah janganlah kalian mengingkari nikmat Allah sehingga kalian akan menjadi orang-orang yang melampaui batas. فَيَحِلَّ عَلَيْكُمْ غَضَبِى ۖ( yang menyebabkan kemurkaan-Ku menimpamu) Yakni turun kepada kalian. وَمَن يَحْلِلْ عَلَيْهِ غَضَبِى فَقَدْ هَوَىٰ (Dan barangsiapa ditimpa oleh kemurkaan-Ku, maka sesungguhnya binasalah ia) Yakni maka ia akan masuk ke neraka yang paling dalam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Wahai Bani Israil, makanlah kenikmatan makanan-makanan halal yang telah kami limpahkan kepada kalian. Dan janganlah kalian melampaui hal yang mubah menuju hal yang haram dengan berbuat angkuh, sewenang-wenang, menolak kebenaran, kufur atas nikmat dan tidak bersyukur, niscaya amarahKu dan hukumanKu akan menimpa kalian. Dan barangsiapa yang mendapatkan amarahKu maka dia akan jatuh dan binasa dalam neraka Hawiyah yaitu dasar neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Makanlah sebagian yang baik-baik dari rezeki yang telah Kami anugerahkan kepada kalian. Dan janganlah melampaui batas} janganlah melampaui batas dalam apa yang Kami anugerahkan kepada kalian dengan tidak mau mensyukurinya dan melampaui batas Allah bagi kalian {lalu menyebabkan} lalu turunlah {kemurkaanKu menimpa kalian dan siapa saja yang ditimpa} turun {kepadanya kemurkaanKu, maka sungguh binasalah dia} celaka dan binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. Dan Dia berkata kepada mereka, “Makanlah di antara rizki yang baik yang telah Kami berikan kepadamu,” maksudnya dan syukurilah apa yang telah Allah curahkan kepada kalian dalam bentuk kenikmatan-kenikmatan. “Dan janganlah kalian melampaui batas padanya,” yaitu dalam menyikapi rizkiNYa, dengan mempergunakannya untuk bermaksiat dan menolak kenikmatan. Jika kalian melakukannya, niscaya datang kepada kalian kemurkaanKu. Artinya Aku marah kepada kalian kemudian menyiksa kalian. “Dan barangsiapa ditimpa oleh kemurkaanKu, maka sesungguhnya binasalah dia,” maksudnya hancur, binasa, menyesal lagi merugi. Lantaran dia tidak memperoleh ridha dan kebaikanNya, ditimpa kemurkaan dan kerugian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 81: Yakni dengan kufur kepada nikmat-nikmat Allah tersebut, misalnya menggunakan rezeki tersebut untuk bermaksiat kepada-Nya. Bisa juga diartikan dengan, “Jatuh ke neraka.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 81",
    "description": "Dengan semua anugerah itu, makanlah dari rezeki yang baik-baik yang telah kami berikan kepadamu, yaitu mann dan salwa, dan janganlah melampaui batas. Jangan langgar tuntunan-ku yang pada akhirnya menyebabkan kemurkaan-ku akan menimpamu. Ketahuilah, barang siapa ditimpa kemurkaan-ku, maka sungguh binasalah dia akibat siksa itu. 82. Dan sungguh, aku maha pengampun bagi siapa saja yang bertobat dari kekafiran yang dilakukannya, dan beriman kepada-ku serta selalu berbuat kebajikan sesuai tuntunan-ku dan rasul-ku, kemudian tetap konsisten dalam petunjuk dan teguh melaksanakannya. '."
  }
]