[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Aku itu Maha Pengampun bagi siapa saja yang bertaubat dari dosa dan kekafirannya dan beriman kepadaKu serta beramal shalih, kemudian meraih hidayah menuju kebenaran dan tetap berada di atasnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Dan sungguh, Aku memiliki banyak ampunan dan maaf kepada orang yang bertobat dan beriman kepada-Ku, dan mengerjakan amalan saleh, lalu tetap istikamah di atas kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "JIka diperhatikan dari luarnya ayat ini menunjukkan sebuah harapan namun hakikatnya ia bermaksud untuk menmbulkan rasa takut dalam diri seorang hamba, firman Allah : { وَإِنِّى لَغَفَّارٌ لِّمَن تَابَ وَءَامَنَ وَعَمِلَ صَٰلِحًا ثُمَّ ٱهْتَدَىٰ } \"Dan sesungguhnya Aku Maha Pengampun bagi orang yang bertaubat, beriman, beramal saleh, kemudian tetap di jalan yang benar\" ; karena ampunan pada ayat ini disandarkan kepada empat syarat yang sulit untuk ditegakkan oleh mereka yang tidak bersungguh-sungguh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Sesungguhnya Aku Maha Pengampun dan menutup dosa-dosa orang yang mau bertaubat dari kesyirikan, beriman hanya kepada Allah dan sesuatu yang wajib diimani berupa Malaikat, kitab-kitab, para rasul dan hari kiamat, serta mengerjakan amal shalih yang diperintahkan oleh syari’at, lalu beristiqamah melakukannya sampai mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Aku Maha Pengampun bagi yang bertaubat, beriman, dan beramal shalih, kemudian tetap dalam petunjuk} tetap dan teguh atas kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Walaupun demikian, kesempatan bertaubat masih ditawarkan, meskipun seseorang telah berbuat maksiat. Oleh karena itu, Allah berfirman, “Dan sesungguhnya Aku Maha Pengampun,” maksudnya, yang banyak ampunan dan rahmatNya “bagi orang yang bertaubat,” dari kekufuran, bid’ah, dan tindakan fasik, “dan beriman,” kepada Allah, para malaikatNya, kitab-kitabNya, para rasulNya dan Hari Akhir “dan beramal shalih,” dari amalan-amalan hati, jasmani dan ucapan-ucapan lisan, “Kemudian tetap di jalan yang benar,” maksudnya dia menempuh jalan yang lurus, mengikuti Rasulullah yang mulia dan mengikuti ajaran agama yang lurus. Orang ini, Allah mengampuni kesalahan-kesalahannya dan memafkan dosa-dosa dan kenakalannya yang silam. Pasalnya, dia telah memenuhi syarat terpenting untuk meraih ampunan dan rahmatNya. Bahkan semua sebab-sebabnya terfokuskan pada perkara-perkara ini. Sesungguhnya taubat menutup kesalahan sebelumnya. Iman dan Islam menghancurkan dosa-dosa silam. Dan amalan shalih yang merupakan rangkaian kebaikan (dapat) melenyapkan kesalahan-kesalahan. Menempuh jalan-jalan hidayah dengan berbagai macamnya, berupa belajar ilmu agama, merenungi ayat atau hadits hingga maknanya jelas baginya adalah dapat memberikan hidayah. Seruan kepada agama yang benar, penolakan bid’ah, kekufuran atau kesesatan dan melaksanakan jihad, hijrah dan lain-lain, yang termasuk bagian terperinci dari hidayah. Semua itu akan menghapuskan dosa-dosa dan memmbuahkan tujuan yang ingin dicapai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 82: Meskipun demikian, yakni seseorang sampai mengerjakan berbagai kemaksiatan, tetapi pintu tobat tetap terbuka selama ajal belum tiba. Dari syirk, bid’ah dan kefasikan. Yakni mentauhidkan Allah, atau beriman kepada rukun iman yang enam. Sampai akhir hayat. Orang yang seperti ini, yakni bertobat, beriman, beramal saleh dan istiqamah di atas petunjuk akan Allah ampuni dosa-dosanya, karena ia telah mengerjakan sebab terbesar untuk diampuni dosa dan diberi rahmat. Bahkan sebab-sebab diampuni dosa terletak pada semua ini; tobat menghapuskan kesalahan yang telah lalu, Islam dan Iman menghilangkan perbuatan buruk yang telah berlalu, amal saleh yang merupakan kebaikan dapat menghilangkan keburukan, dan menempuh jalan hidayah dengan segala macamnya (seperti belajar, mentadabburi ayat dan hadits sehingga paham maksudnya, mengajak manusia kepada Allah, membantah kekafiran, kebid’ahan, dan kesesatan, berjihad, berhijrah dsb. yang termasuk bagian hidayah) semuanya menghapuskan dosa-dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 82",
    "description": "Dan sungguh, aku maha pengampun bagi siapa saja yang bertobat dari kekafiran yang dilakukannya, dan beriman kepada-ku serta selalu berbuat kebajikan sesuai tuntunan-ku dan rasul-ku, kemudian tetap konsisten dalam petunjuk dan teguh melaksanakannya. '83. Allah menegur nabi musa karena tergesa-gesa meninggalkan kaumnya. Mendapat janji Allah yang sangat menggembirakan itu, nabi musa bergegas menuju tempat yang ditetapkan sehingga Allah menegurnya, 'dan mengapa engkau datang lebih cepat daripada kaummu, wahai musa' bukanlah akan lebih baik bila engkau datang bersama mereka''."
  }
]