[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia berkata, “Sesungguhnya mereka ada di belakangku dan akan menyusulku. Dan aku mendahului mereka kepadaMu (wahai Tuhanku) agar Engkau semakin ridha kepadaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Musa -'alaihissalām- menjawab, \"Itulah mereka berada di belakangku, dan sedang menyusul aku, dan aku bersegera kepada-Mu dengan mendahului kaumku agar Engkau meridai-Ku lantaran kesegeraan-Ku berjumpa dengan-Mu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. قَالَ هُمْ أُو۟لَآءِ عَلَىٰٓ أَثَرِى (Berkata, Musa: “Itulah mereka sedang menyusuli aku) Yakni mereka tidak jauh di belakangku, dan mereka akan sampai setelaku. وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ( dan aku bersegera kepada-Mu. Ya Tuhanku, agar supaya Engkau ridha (kepadaku)”) Yakni agar Engkau ridha kepadaku karena aku bersegera dalam menuju tempat perjanjian ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnu Qayyim berkata : Secara zhahir ayat ini menunjukkan bahwa yang membawa Musa untuk bersegera adalah harapannya akan keridhoan tuhannya. Dan bahwasanya kerdhoan Allah akan diraih dengan bersegera menyambut perintah-perintah Nya; oleh karena itu sebagian salaf berhujjah dengan ayat ini bahwa shalt di awal waktu lebih baik. 2 ). Orang yang bergegas bertemu tuhannya akan mendapat keberuntungan dengan keridhoan-Nya, dalam ayat dikatakan : { وَعَجِلْتُ إِلَيْكَ رَبِّ لِتَرْضَىٰ } \"dan aku bersegera kepada-Mu. Ya Tuhanku, agar supaya Engkau ridha (kepadaku)\" sebagaimana yang juga dikatakan dalam shahih : (( سَبَقَ المُفَرِّدُونَ )) \"Telah mendahului al-mufarridun (orang-orang yang menyendiri dalam ibadah)\" [ HR. Muslim ] kemudian Rasululla menjelaskan kepada shabatnya bahwa mereka adalah \"Laki-laki dan perempuan yang banyak berdzikir kepada Allah\" dari penjelasan ini kita memahami bahwa orang yang paling dahulu dalam kebaikan dan keridhoan Allah adalah mereka yang senantiasa merutinkan dzikir kepada kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Musa berkata: “Mereka sebentar lagi menyusulku. Dan aku bergegas kepadaMu supaya bertambah keridhaanMu kepadaku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Musa berkata menjawab Allah SWT {“Mereka itu} mereka itu {sedang menyusulku} mengukutiku dan akan menyusulku {dan aku bersegera kepadaMu, ya Tuhanku, agar Engkau ridha”} agar Engkau bertambah ridha"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. “Musa berkata, ‘Itulah mereka telah menyusulku’,” maksudnya sudah dekat denganku. Mereka akan menyusul dibelakangku. Perkara yang mendorongku wahai Rabbku adalah keinginan untuk dekat denganMu dan bersegera untuk meraih ridhaMu dan kerinduan kepadaMu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 84: Yakni yang membuatku pergi mendahului mereka adalah karena ingin dekat dengan-Mu, mengharapkan ridha-Mu dan karena rindu kepada-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 84",
    "description": "Nabi musa menduga bani israil mengikutinya di belakang. Dia berkata, 'itu mereka sedang menyusul aku. Tidak lama lagi mereka akan tiba. Dan aku bersegera datang kepada-Mu, ya tuhanku, agar engkau rida dan memberiku restu-Mu. '85. Dia berfirman, 'begitu engkau pergi mendahului mereka, sungguh, kami telah menguji kaummu setelah engkau tinggalkan mereka. Mereka gagal melalui ujian-ku sehingga terjerumus dalam kesesatan dengan menyembah patung anak sapi. Dan mereka menjadi kafir karena telah disesatkan oleh samiri. '."
  }
]