[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada Musa, “Sesungguhnya Kami telah menguji kaummu sesudah kamu tinggalkan mereka dengan penyembahan terhadap anak sapi. Dan sesungguhnya Samiri telah menyesatkan mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Allah berfirman, \"Sesungguhnya Kami telah menguji kaummu setelah engkau tinggalkan dengan penyembahan patung anak sapi, mereka telah diseru oleh Samiri untuk menyembahnya, sehingga iapun menyesatkan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Allah berfirman kepada Musa: “Kami telah menguji kaummu dengan orang yang sesat bernama Samiri, dia menggoda mereka untuk menyembah patung emas berbentuk anak sapi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. قَالَ فَإِنَّا قَدْ فَتَنَّا قَوْمَكَ مِنۢ بَعْدِكَ (Allah berfirman: “Maka sesungguhnya Kami telah menguji kaummu sesudah kamu tinggalkan) Yakni Kami telah menguji dan menurunkan kepada mereka cobaan. وَأَضَلَّهُمُ السَّامِرِىُّ(dan mereka telah disesatkan oleh Samiri) Yakni dia menjadikan mereka sesat dari kebenaran karena dia telah menjerumuskan mereka ke dalam penyembahan patung anak sapi yang terbuat dari emas. Dalam Bani Israil terdapat kabilah bernama Samirah, salah satu dari kabilah ini adalah Samiri, dia berkata kepada Bani Israil yang bersamanya: “Sesungguhnya Musa menyalahi perjanjian dengan kalian karena kalian membawa perhiasan yang diharamkan bagi kalian” kemudian Samiri memerintahkan agar mereka melempar perhiasan itu ke dalam api, dan emas itu dijadikan patung berbentuk anak sapi dan terjadilah kisah mereka dengan patung tersebut seperti yang telah disebutkan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Takala dikatakan kepada Musa : { قَدْ فَتَنَّا قَوْمَكَ مِنۢ بَعْدِكَ } \"Maka sesungguhnya Kami telah menguji kaummu sesudah kamu tinggalkan\" ia kemudian pergi kepada : - Kaumnya terlebih dahulu : { يَٰقَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا } \"Hai kaumku, bukankah Tuhanmu telah menjanjikan kepadamu suatu janji yang baik?\" - Kemudian kepada wakilnya yang sedang tidak menyerukan kaumnya kepada kebenaran : { يَٰهَٰرُونُ مَا مَنَعَكَ إِذْ رَأَيْتَهُمْ ضَلُّوٓا۟ } \"Hai Harun, apa yang menghalangi kamu ketika kamu melihat mereka telah sesat?\" - Kemudian kepada orang yang kerap menyampaikan fitnah di tengah kaum : { قَالَ فَمَا خَطْبُكَ يَٰسَٰمِرِىُّ } \"Berkata Musa: \"Apakah yang mendorongmu (berbuat demikian) hai Samiri?\" Cara Musa memulai teguran kepada mereka ; karena pada dasarnya seorang baligh dan berakal bertanggung jawab atas dirinya sendiri, dan tidaklah kuatnya godaan menjadi alasan baginya untuk mundur dari tugas mulia ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Allah SWT berfirman: “Sesungguhnya Kami telah menguji kaummu dengan menyembah anak sapi setelah mereka terpisah darimu” Dan sungguh Musa As-Samiry yang munafik telah menyesatkan mereka dengan membuat anak sapi dan mengajak mereka untuk menyembahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berfirman,“Sesungguhnya Kami benar-benar telah menguji} Kami telah menguji {kaummu setelah kamu} setelah kamu berpisah dari mereka {lalu Samiri telah menyesatkan mereka”} dan Samiri mengajak mereka untuk menyembah anak sapi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Allah berfirman kepada beliau, “Maka sesungguhnya Kami telah menguji kaummu sesudah kamu tinggalkan,” yaitu dengan penyembahan kepada anak sapi. Kami mencoba dan menguji mereka, lalu mereka tidak mampu bersabar. Ketika ujian menghampiri, mereka justru berbuat kekufuran “dan mereka telah disesatkan oleh Samiri,” dia telah menyodorkan sebuah patung anak sapid an membentuknya hingga memiliki suara. Dia berkata kepada Bani Israil, “Inilah tuhan kalian tuhan Musa. Musa telah melupakannya.” Bani Israil tergoda dengannya. Mereka pun menyembahnya. Harun telah menghalang-halangi mereka, tapi mereka tidak menghentikan diri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 85: Ternyata mereka tidak sabar ketika diuji, mereka malah kufur dengan menyembah anak sapi. Muhammad bin Ishaq meriwayatkan dari Ibnu Abbas, ia berkata, “Samiri adalah seorang penduduk Bajarma, di mana mereka biasa menyembah sapi. Kecintaan menyembah sapi ada dalam diri Samiri. Ketika itu ia menampakkan masuk Islam bersama bani Israil. Nama Samiri adalah Musa bin Zhufr. Qatadah berkata, “Ia berasal dari kampung Samira.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 85",
    "description": "Dia berfirman, 'begitu engkau pergi mendahului mereka, sungguh, kami telah menguji kaummu setelah engkau tinggalkan mereka. Mereka gagal melalui ujian-ku sehingga terjerumus dalam kesesatan dengan menyembah patung anak sapi. Dan mereka menjadi kafir karena telah disesatkan oleh samiri. '86. Kemudian nabi musa kembali kepada kaumnya dengan marah karena menyaksikan mereka menyembah patung anak sapi. Dia marah dan bersedih hati karena kekafiran mereka setelah dia berusaha memberi mereka petunjuk. Dia berkata, 'wahai kaumku! bukankah tuhanmu telah menjanjikan kepadamu suatu janji yang baik bila kamu beriman, yaitu dengan menjamin keselamatanmu di dunia dan kebahagiaanmu di akhirat' apakah terlalu lama masa perjanjian itu bagimu sehingga kamu tidak sabar dan akhirnya menyembah patung anak sapi ini, atau kamu memang sengaja menghendaki agar kemurkaan tuhan menimpamu' mengapa kamu melanggar perjanjianmu dengan aku yang telah kamu teguhkan sebelumnya''."
  }
]