[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa kembali kepada kaumnya dalam keadaan murka dan prihatin kepada mereka. Dan dia berkata kepada mereka, “Bukankah Tuhan kalian telah menjanjikan kepada kalian suatu janji yang baik untuk menurunkan Taurat? Apakah sudah terasa terlalu lama masa yang berlalu bagi kalian dan kalian menganggap janji itu tidak kunjung datang ataukah kalian memang ingin berbuat suatu tindakan yang menyebabkan kemurkaan Allah akan menimpa kalian karenanya dan kalian melanggar perjanjian denganku dan kalian sembah anak sapi serta kalian tinggalkan komitmen dengan perintah-perintahku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Kemudian Musa kembali kepada kaumnya dalam keadaan marah dan bersedih karena penyembahan mereka terhadap patung anak sapi itu. Musa lalu berkata, \"Wahai kaumku! Bukankah Tuhan kalian telah menjanjikan suatu janji yang baik dengan menurunkan kepada kalian kitab Taurat, dan memasukkan kalian ke dalam Surga? Apakah sudah terlalu lama masa perjanjian itu sehingga kalian melupakannya? Atau apakah dengan perbuatan ini kalian menghendaki agar kemurkaan Tuhan menimpa kalian semua dan kalian ditimpa azab-Nya? Sehingga kalian pun melanggar perjanjian denganku agar tetap teguh di atas ketaatan sampai aku kembali kepada kalian?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Maka Musa kembali dari Gunung Thur dalam keadaan marah bercampur sedih, dia berkata mereka: “Hai kamuku, bukankah Allah telah menjanjikan kalian akan menurunkan Taurat yang mengandung hidayah? Apakah waktunya sudah terlalu lama sehingga kalian melupakannya? Atau dengan perbuatan ini kalian ingin ditimpa kemurkaan Tuhan kalian, sehingga kalian melanggar janji kepadaku untuk menjaga hidayah yang diberikan kepada kalian?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. فَرَجَعَ مُوسَىٰٓ إِلَىٰ قَوْمِهِۦ غَضْبٰنَ أَسِفًا ۚ (Kemudian Musa kembali kepada kaumnya dengan marah dan bersedih hati) Makna (الأسف) yakni kemarahan besar. قَالَ يٰقَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا ۚ( Berkata Musa: “Hai kaumku, bukankah Tuhanmu telah menjanjikan kepadamu suatu janji yang baik?) Alla menjanjikan mereka surga jika mereka menjalankan ketaatan kepada-Nya serta menjanjikan mereka untuk dapat mendengar firman-Nya dalam Taurat melalui lisan Musa agar mereka menjalankan kandungan Taurat tersebut sehingga mereka berhak mendapat pahala dari amal perbuatan mereka. أَفَطَالَ عَلَيْكُمُ الْعَهْدُ(Maka apakah terasa lama masa yang berlalu itu bagimu) Yakni Apakah waktu telah berlalu begitu lama sehingga kalian melupakannya? Padahal itu baru satu bulan dan beberapa hari. أَمْ أَرَدتُّمْ أَن يَحِلَّ عَلَيْكُمْ غَضَبٌ مِّن رَّبِّكُمْ(atau kamu menghendaki agar kemurkaan dari Tuhanmu menimpamu) Yakni menurunkan kepada kalian hukuman dan siksaan. فَأَخْلَفْتُم مَّوْعِدِى (dan kamu melanggar perjanjianmu dengan aku?”) Mereka berjanji kepadanya agar menjalankan ketaatan kepada Allah sampai dia kembali kepada mereka dari gunung Tsur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Lalu Musa kembali kepada kaumnya dengan keadaan marah karena menyesal dan bersedih atas apa yang telah dibuat kaumnya. Dia berkata: “Wahai kaumku, bukankah tuhan kalian telah memberi kalian janji yang baik dengan memberikan Taurat yang di dalamnya mengandung petunjuk dan cahaya. Apakah waktu perpisahan itu terlalu lama bagi kalian, yaitu satu bulan dan beberapa hari, sehingga kalian melupakan janji dan keteguan atas keimanan, ataukah kalian ingin mendapatkan hukuman dan amarah Tuhan kalian? Sehingga kalian melanggar janji yang telah kalian kepadaku untuk teguh dalam beriman dan menaati Allah SWT sampai aku kembali dari bukit Thur.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Musa kembali kepada kaumnya dalam keadaan marah lagi sedih} sedih {Dia berkata,“Wahai kaumku, bukankah Tuhan kalian telah menjanjikan kepada kalian suatu janji yang baik} dengan menurunkan Taurat, menyelamatkan dari musuh, dan memasukkan ke surge {Apakah terlalu lama bagi kalian waktu perjanjian itu} waktunya {atau kalian menghendaki agar kemurkaan Tuhan menimpa kalian sehingga kalian melanggar perjanjian kalian denganku”} janjiku untuk tetap beriman kepada Allah, dan melaksanakan apa yang telah diperintahkan kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Ketika Musa kembali pulang ke kaumnya dalam keadaan murka dan prihatin, maksudnya hatinya penuh dengan amarah, murka, dan kesedihan, beliau mengeluarkan pernyataannya untuk memburuk-burukkan dan menjelek-jelekkan ulah mereka, “Hai kaumku, bukankah Rabbmu telah menjanjikan kepadamu suatu janji yang baik,” yaitu dengan menurunkan Taurat kepada kalian, “maka apakah terasa lama masa yang berlalu bagimu itu,” yaitu jarak waktu (perjanjian), maka apakah kalian menilai kepergianku terlalu lama, padahal merupakan masa yang pendek saja?! Ini adalah keterangan mayoritas ulama tafsir. Kandungan ayat ini juga bisa diarahkan ke pengertian: apakah sudah lama masa kenabian dan kerasulan dari kalian, sehingga kalian tidak mengetahui apa-apa tentang kenabian dan pengaruhnya, sudah lenyap bukti-buktinya dan kalian tidak menjumpai berita apa pun tentangnya. Bekas-bekasnya pun hilang karena panjangnya kurun waktu darinya, sehingga kalian menyembah selain Allah karena dominannya kebodohanmu dan tiadanya ilmu mengenai pengaruh-pengaruh kerasulan? Perkaranya tidak demikian. Bahkan kenabian itu di belakang kalian, sedangkan ilmu itu ada, dan udzur tidak bisa diterima. “Atau kamu meghendaki,” dengan tindakan kalian “agar kemurkaan dari Rabbmu menimpamu,” kalian telah melakukan penyebab-penyebab yang mendatangkan kemurkaanNYa dan kalian menerobos pemicu siksaNYa. Inilah realitanya. “Lalu kamu melanggar perjanjimu denganku.” Tatkala aku memerintahkan kepada kalian untuk beristiqamah, dan berpesan kepada Harun untuk mengawasi kalian. Tapi kalian tidak mau menunggu yang sedang pergi dan tidak menghormati orang yang ada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 86: Yakni Dia akan memberikan kitab Taurat. Yakni masa berpisahku dengan kamu, atau maksudnya, apakah masa kenabian dan kerasulan telah lama berlalu atasmu, sehingga kamu tidak memiliki ilmu tentang kenabian dan sisa peninggalannya, dan jejak-jejaknya telah hilang sehingga kamu menyembah selain Allah karena merebaknya kebodohan dan tidak memiliki ilmu tentang peninggalan rasul? Bukankah tidak demikian? Bahkan kenabian ada di tengah-tengah kamu, ilmu ada, sehingga uzur tidak diterima. Ataukah maksudmu, agar kemurkaan Tuhanmu turun menimpamu. Dengan menyembah anak sapi. Yakni janji untuk datang setelahku, atau ketika aku memerintahkan kamu beristiqamah dan mengangkat Harun untuk menggantikanku untukmu, tetapi kamu tidak menghormatinya dan mendengarkan kata-katanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 86",
    "description": "Kemudian nabi musa kembali kepada kaumnya dengan marah karena menyaksikan mereka menyembah patung anak sapi. Dia marah dan bersedih hati karena kekafiran mereka setelah dia berusaha memberi mereka petunjuk. Dia berkata, 'wahai kaumku! bukankah tuhanmu telah menjanjikan kepadamu suatu janji yang baik bila kamu beriman, yaitu dengan menjamin keselamatanmu di dunia dan kebahagiaanmu di akhirat' apakah terlalu lama masa perjanjian itu bagimu sehingga kamu tidak sabar dan akhirnya menyembah patung anak sapi ini, atau kamu memang sengaja menghendaki agar kemurkaan tuhan menimpamu' mengapa kamu melanggar perjanjianmu dengan aku yang telah kamu teguhkan sebelumnya''87. Dengan penuh penyesalan mereka berkata, 'wahai nabi musa, kami memang bersalah, namun kami tidak melanggar perjanjianmu dengan kemauan kami sendiri, tetapi kami harus membawa beban berat ketika meninggalkan mesir yang terdiri dari perhiasan kaum itu, yaitu orang-orang mesir, kemudian kami melemparkannya ke dalam api, dan demikian pula samiri melemparkannya ke api itu. '."
  }
]