[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, “Wahai Musa, kami tidak melanggar perjanjian denganmu atas kemauan sendiri. Akan tetapi, kami diperintah memikul beban-beban dari perhiasan kaum Fir’aun. Maka kami lemparkan barang-barang itu di dalam satu lubang yang di dalamnya terdapat api sesuai perintah Samiri.” Demikian juga Samiri melemparkan apa saja yang dia bawa, yaitu debu bekas pijakan telapak kaki kuda Jibril."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Kaum Musa menjawab, \"Kami tidaklah melanggar perjanjian denganmu -wahai Musa- karena kemauan kami sendiri, akan tetapi karena keterpaksaan. Kami telah membawa beban berat dari perhiasan kaum Fir'aun, kemudian kami melemparkannya ke dalam lobang agar kami tidak dibebani olehnya. Maka sebagaimana kami melemparnya ke dalam lobang, ternyata Samiri melempar ke dalamnya tanah dari bekas jejak kaki kuda Malaikat Jibril -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Mereka mengemukakan alasan: “Tidaklah kami melanggar perjanjianmu dengan memilih kami, namun kami terpaksa melakukannya; kami menanggung dosa-dosa dari perhiasan-perhiasan kaum Fir’aun yang ada di Mesir karena kami meminjamnya dari mereka, maka kami melempar perhiasan-perhiasan itu agar terbebas dari dosa hingga Musa dapat menetapkan hukum pada perhiasan-perhiasan tersebut.” Begitu juga Samiri melemparnya untuk dapat menyesatkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. قَالُوا۟ مَآ أَخْلَفْنَا مَوْعِدَكَ (Mereka berkata: “Kami sekali-kali tidak melanggar perjanjianmu) Yang kami janjikan kepadamu. بِمَلْكِنَا (dengan kemauan kami sendiri) Namun kami terpaksa untuk menyalahi janji itu. وَلٰكِنَّا حُمِّلْنَآ أَوْزَارًا مِّن زِينَةِ الْقَوْمِ (tetapi kami disuruh membawa beban-beban dari perhiasan kaum itu) Mereka meminjam perhiasan emas dari penduduk Mesir ketika mereka hendak pergi bersama Musa, mereka mengelabuhi penduduk Mesir bahwa mereka hendak berhias untuk hari raya mereka atau untuk walimah. Perhiasan ini disebut sebagai (أوزارا) yang berarti dosa-dosa, karena perhiasan itu haram mereka ambil. فَقَذَفْنٰهَا(maka kami telah melemparkannya) Yakni kami melemparnya ke dalam api dengan harapan kami dapat terbebas dari dosanya; dan demikian pula Samiri melemparkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Mereka berkata kepada Musa: “Kami tidak melanggar janjimu sesuai keinginan kami, melainkan karena terpaksa. Sesungguhya kami masih menanggung dosa-dosa berupa perhiasan kaum Fir’aun di Mesir ketika istri-istri kami meminjamnya saat ingin keluar dari Mesir untuk digunakan pada saat hari raya atau acara penjamuan. Lalu kami lemparkan perhiasan itu ke dalam api sesuai perintah Samiry untuk menghapus dosanya. Seperti halnya kami melemparkan perhiasan itu, Samiry juga melemparkan perhiasan yang ada bersamanya ke dalam api, kemudian dia melemparkan segenggam tanah bekas pijakan seorang utusan, yaitu Jibril”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Kami tidak melanggar perjanjianmu atas kemauan kami} dengan pilihan dan kemampuan kami {Akan tetapi kami harus membawa beban berat} beban berat {berupa perhiasan kaum itu} perhiasan kaum Fir’aun {Lalu kami melemparkannya} Lalu kami melemparkan perhiasan itu ke dalam jurang {dan demikian pula Samiri melemparkannya} sebagaimana kami melemparnya di dalam jurang, Samiri juga melempar sesuatu yang ada bersamanya berupa tanah bekas kuda Jibril AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87-88. Maknanya, mereka berkata kepada Musa, “Tidaklah kami berbuat sesuatu yang telah kami lakukan dengan kesengajaan dan kemauan sendiri. Akan tetapi, penyebab yang mendorong kami melakukannya ialah kami sudah berbuat dosa disebabkan perhiasan-perhiasan kaum itu yang berada pada kami. Mereka itu, menurut keterangan mereka telah meminjam perhiasan yang banyak dari seorang suku Qibthi. Mereka pergi bersamanya, membuangnya (ke dalam lubang api. Ed) dan mengumpulkannya (kembali) ketika Musa pergi untuk mempertanyakan kepadanya bila beliau sudah kembali. Sementara itu, Samiri telah mengetahui peristiwa tenggelamnya (Fir’aun dan para pengikutnyaa) melalui jejak Rasul. Maka jiwanya memandang baik untuk mengambil satu genggam dari bekas jejak Rasul. Dan bila dia lemparkan pada suatu obyek, niscaya akan menjadi hidup, sebagai bahan fitnah dan ujian. Ia pun melemparkannya pada (patung anak sapi itu yang telah dia buat dalam bentuk patung) anak sapi. Anak sapi itu pun bergerak-gerak dan memiliki suara dan bunyi. Mereka berkata, “SEsungguhnya Musa sedang mencari Rabbnya, padahal Dia di sini. Tetapi Musa telah melupakannya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 87: Yang pernah mereka pinjam dari kaum Fir’aun (orang-orang Qibth). Saat mereka keluar dari Mesir, perhiasan itu ada pada mereka, lalu mereka taruh. Kemudian mereka mengumpulkan kembali ketika Musa pergi untuk meminta pendapat Beliau tentang perhiasan tersebut setelah pulang bermunajat. Dengan perintah Samiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 87",
    "description": "Dengan penuh penyesalan mereka berkata, 'wahai nabi musa, kami memang bersalah, namun kami tidak melanggar perjanjianmu dengan kemauan kami sendiri, tetapi kami harus membawa beban berat ketika meninggalkan mesir yang terdiri dari perhiasan kaum itu, yaitu orang-orang mesir, kemudian kami melemparkannya ke dalam api, dan demikian pula samiri melemparkannya ke api itu. '88. Kemudian dia, yaitu samiri, mengeluarkan dan menciptakan patung anak sapi yang bertubuh dan bersuara dari perhiasan itu untuk mereka, maka mereka berkata sambil menunjuk ke arah patung anak sapi itu, 'inilah tuhanmu dan tuhan musa, tetapi dia pergi dan telah lupa bila tuhannya ada di sini. '."
  }
]