[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Samiri membuatkan bagi orang-orang Bani Israil patung anak sapi dari emas yang mengeluarkan suara layaknya suara sapi. Orang-orang yang terperdaya dengannya dari kalangan mereka berkata kepada orang-orang lainnya, “Ini adalah tuhan kalian dan tuhan Musa, dia lupa dan lalai darinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Kemudian dari perhiasan yang terkumpul dalam lobang itu, Samiri mengeluarkan untuk mereka patung anak sapi yang tidak memiliki ruh namun memiliki suara seperti suara sapi, maka orang-orang yang tertipu dengan perbuatan Samiri ini berkata, \"Inilah Tuhan kalian dan Tuhan Musa, namun ia melupakannya dan meninggalkannya di sini.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Kemudian Samiri membentuk sebuah patung anak sapi dari perhiasan-perhiasan itu; patung itu tidak memiliki ruh, namun Samiri membuat lubang di dari depan hingga belakangnya agar dapat dilewati angin sehingga dapat mengeluarkan suara seperti sapi. Namun sebagian mereka tertipu dan berkata sebagaimana yang telah dikatakan Samiri kepada mereka: “Anak sapi ini adalah tuhan kalian dan tuhan Musa yang dia lupakan, sehingga Musa tidak menyebutkannya kepada kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. فَأَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَّهُۥ خُوَارٌ (kemudian Samiri mengeluarkan untuk mereka (dari lobang itu) anak lembu yang bertubuh dan bersuara) Yakni bersuara seperti anak sapi yang sesungguhnya. Makna (الخوار) adalah suara sapi. Terdapat pendapat mengatakan suara dari patung tersebut berasal dari hembusan angin, sebab Samiri membuat lubang-lubang pada patung tersebut, sehingga jika terdapat angin yang masuk ke lubang tersebut maka akan menimbulkan suara seperti anak sapi; dan bukan berarti patung tersebut hidup dan dapat bersuara. فَقَالُوا۟ هٰذَآ إِلٰهُكُمْ وَإِلٰهُ مُوسَىٰ (maka mereka berkata: “Inilah Tuhanmu dan Tuhan Musa,) Yakni Samiri dan orang yang sependapat dengannya mengatakan perkataan ini. فَنَسِىَ (tetapi Musa telah lupa”) Yakni Musa tersesat dan tidak mengetahui dimana Tuhannya itu, maka ia mencarinya di gunung Thur. Pendapat lain mengatakan maknanya adalah Musa lupa menyebutkan kepada kalian bahwa ini adalah Tuhannya dan Tuhan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Kemudian dari perhiasan yang leleh itu dia membentuk patung anak sapi yang hanya memiliki tubuh saja tanpa adanya ruh di dalamnya. Namun dia bisa mengeluarkan suara yang menyerupai suara sapi. Lalu Samiry dan orang-orang yang sepakat dengannya berkata: “Inilah tuhan kalian dan tuhan Musa. Musa lupa bahwa tuhannya ada disini dan pergi mencarinya di bukit Thur” Pembuatan patung anak sapi adalah pekerjaan yang dilakukan oleh Bani Israil dari golongan orang-orang Mesir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia mengeluarkan untuk mereka patung anak sapi} bentuk yang tidak memiliki ruh {yang bersuara} suara seperti suara sapi {Mereka lalu berkata,“Inilah Tuhan kalian dan Tuhan Musa, tetapi dia telah lupa”} lalu dia melupakannya, dan pergi mencarinya di gunung Thur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87-88. Maknanya, mereka berkata kepada Musa, “Tidaklah kami berbuat sesuatu yang telah kami lakukan dengan kesengajaan dan kemauan sendiri. Akan tetapi, penyebab yang mendorong kami melakukannya ialah kami sudah berbuat dosa disebabkan perhiasan-perhiasan kaum itu yang berada pada kami. Mereka itu, menurut keterangan mereka telah meminjam perhiasan yang banyak dari seorang suku Qibthi. Mereka pergi bersamanya, membuangnya (ke dalam lubang api. Ed) dan mengumpulkannya (kembali) ketika Musa pergi untuk mempertanyakan kepadanya bila beliau sudah kembali. Sementara itu, Samiri telah mengetahui peristiwa tenggelamnya (Fir’aun dan para pengikutnyaa) melalui jejak Rasul. Maka jiwanya memandang baik untuk mengambil satu genggam dari bekas jejak Rasul. Dan bila dia lemparkan pada suatu obyek, niscaya akan menjadi hidup, sebagai bahan fitnah dan ujian. Ia pun melemparkannya pada (patung anak sapi itu yang telah dia buat dalam bentuk patung) anak sapi. Anak sapi itu pun bergerak-gerak dan memiliki suara dan bunyi. Mereka berkata, “SEsungguhnya Musa sedang mencari Rabbnya, padahal Dia di sini. Tetapi Musa telah melupakannya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 88: Dan membentuk. Mereka membuat patung anak sapi dari emas. Para mufassir berpendapat bahwa patung itu tetap patung tidak bernyawa, dan suara yang seperti sapi itu hanyalah disebabkan oleh angin yang masuk ke dalam rongga patung itu dengan tekhnik yang dikenal oleh Samiri waktu itu dan sebagian mufassir ada yang menafsirkan bahwa patung yang dibuat dari emas itu kemudian menjadi tubuh yang bernyawa dan mempunyai suara sapi sebagai cobaan bagi bani Israil. Mereka terfitnah oleh patung anak sapi itu sehingga menyembahnya. Hal ini karena kebodohan mereka dan lemahnya akal mereka, saat mereka menyaksikan sesuatu yang aneh, di mana benda yang awalnya diam menjadi bersuara. Ketika Harun melarang, mereka tidak mau berhenti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 88",
    "description": "Kemudian dia, yaitu samiri, mengeluarkan dan menciptakan patung anak sapi yang bertubuh dan bersuara dari perhiasan itu untuk mereka, maka mereka berkata sambil menunjuk ke arah patung anak sapi itu, 'inilah tuhanmu dan tuhan musa, tetapi dia pergi dan telah lupa bila tuhannya ada di sini. '89. Sikap mereka itu sungguh sangat buruk. Maka tidakkah mereka memperhatikan bahwa patung anak sapi itu tidak dapat memberi jawaban kepada mereka atas pertanyaan yang mereka ajukan dan tidak pula kuasa menolak mudarat yang menimpa mereka maupun mendatangkan manfaat yang diinginkan kepada mereka'."
  }
]