[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang menyembah patung anak sapi itu tidak melihat bahwa ia pada asalnya tidak bisa berbicara dengan mereka, tidak dapat menjawab mereka, tidak dapat menolak mara bahaya dari mereka dan tidak dapat mendatangkan manfaat bagi mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Maka tidakkah orang-orang yang tertipu dengan patung anak sapi itu dan menyembahnya melihat bahwa ia tidak dapat berbicara dan memberikan jawaban, tidak pula kuasa menolak adanya mudarat bagi mereka atau selain mereka, atau mendatangkan manfaat bagi mereka dan selain mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Allah menegur dan mengingkari orang-orang yang tertipu tersebut: “Tidakkah mereka mengetahui bahwa anak sapi itu tidak dapat membalas pertanyaan mereka, dan tidak dapat menolak kemudharatan atau mendatangkan manfaat bagi mereka, lalu bagaimana ia dapat menjadi tuhan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. فَأَخْرَجَ لَهُمْ عِجْلًا جَسَدًا لَّهُۥ خُوَارٌ (kemudian Samiri mengeluarkan untuk mereka (dari lobang itu) anak lembu yang bertubuh dan bersuara) Yakni bersuara seperti anak sapi yang sesungguhnya. Makna (الخوار) adalah suara sapi. Terdapat pendapat mengatakan suara dari patung tersebut berasal dari hembusan angin, sebab Samiri membuat lubang-lubang pada patung tersebut, sehingga jika terdapat angin yang masuk ke lubang tersebut maka akan menimbulkan suara seperti anak sapi; dan bukan berarti patung tersebut hidup dan dapat bersuara. فَقَالُوا۟ هٰذَآ إِلٰهُكُمْ وَإِلٰهُ مُوسَىٰ (maka mereka berkata: “Inilah Tuhanmu dan Tuhan Musa,) Yakni Samiri dan orang yang sependapat dengannya mengatakan perkataan ini. فَنَسِىَ (tetapi Musa telah lupa”) Yakni Musa tersesat dan tidak mengetahui dimana Tuhannya itu, maka ia mencarinya di gunung Thur. Pendapat lain mengatakan maknanya adalah Musa lupa menyebutkan kepada kalian bahwa ini adalah Tuhannya dan Tuhan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Apakah mereka tidak berpikir bahwa anak sapi ini tidak memberikan jawaban saat mereka tanyai, dan tidak mampu melindungi mereka dari kemahdharatan atau memberi mereka manfaat, lalu bagaimana bisa anak sapi itu menjadi Tuhan?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak memperhatikan bahwa itu tidak dapat menyauti satupun perkataan} sesungguhnya patung anak sapi itu tidak berbicara dan menyauti perkataan mereka {mereka dan tidak kuasa menolak mudharat maupun mendatangkan manfaat bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. INi termasuk gambaran kedunguan dan kedangkalan akal mereka. (Yaitu) mereka telah menyaksikan benda asing yang menjelma bersuara, padahal sebelumnya merupakan benda mati. Mereka pun menyangka bahwa ia adalah sesembahan yang berhak disembah di bumi dan langit. Apakah mereka tidak memperhatikan bahwa patung anak lembu itu “tidak dapat memberi jawaban kepada mereka,” maksudnya tidak bisa berbicara, yang bisa menjawab mereka, dan mereka pun bisa berkomunikasi dengannya “dan tidak dapat memberi kemudaratan kepada mereka, dan tidak (pula) kemanfaatan,” barang yang kosong dari aspek kesempurnaan, kemampuan berbicara dan berbuat tidaklah berhak untuk disembah. Tingkatannya lebih rendah daripada para penyembahnya. Mereka dapat berkomunikasi, mampu melakukan banyak hal, berupa mendatangakan kemanfaatan dan menolak bahaya (dari diri mereka) dengan takdir Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 89: Padahal para penyembahnya lebih baik keadaannya daripada yang disembah (patung itu). Para penyembahnya mampu berbicara, sedangkan patung tersebut tidak dapat berbicara. Para penyembahnya mampu berbuat ini dan itu, sedangkan patung tersebut tidak mampu berbuat apa-apa. Lalu mengapa sampai dituhankan?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 89",
    "description": "Sikap mereka itu sungguh sangat buruk. Maka tidakkah mereka memperhatikan bahwa patung anak sapi itu tidak dapat memberi jawaban kepada mereka atas pertanyaan yang mereka ajukan dan tidak pula kuasa menolak mudarat yang menimpa mereka maupun mendatangkan manfaat yang diinginkan kepada mereka'90. Dan sungguh, sebelumnya, yaitu sebelum kepulangan nabi musa, nabi harun telah mengingatkan dan berkata kepada mereka yang menyembah patung anak sapi itu, 'wahai kaumku! sesungguhnya kamu hanya sekadar diberi cobaan dengan patung anak sapi itu. Dan sungguh tuhanmu yang hakiki ialah Allah yang maha pengasih, maka ikutilah dengan sungguh-sungguh nasihat dan peringatan yang aku berikan kepadamu dan taatilah perintahku untuk beriman dan beribadah hanya kepada tuhan yang maha esa. '."
  }
]