[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apakah telah sampai kepadamu, (wahai Rasul) berita tentang Musa bin Imran? Dan dia datang dari Negri Madyan menuju ke Mesir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. \"Wahai Rasul! Sungguh telah sampai kepadamu kisah Musa bin Imran -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-12. Hai Nabi, apakah telah datang kepadamu kisah agung tentang Musa, ketika dia melihat api saat dia tersesat di padang pasir Sina ketika akan menuju Mesir. Maka dia berkata kepada istrinya: “Tunggulah, karena aku melihat api, semoga aku dapat mendatangkan sesuluh api agar kalian dapat menghangatkan diri, atau aku bisa menemui orang yang dapat menunjukkan kepada kita jalan menuju Mesir.” Ketika Musa mendatangi api itu, Allah menyerunya dari arah gunung Thur yang ada di sisi kanan Musa yang akan menuju Mesir: “Hai Musa, Aku adalah Tuhanmu, lepaskanlah alas kakimu karena kamu sekarang berada di lembah yang diberkati yang bernama Thuwa”."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَهَلْ أَتَىٰكَ حَدِيثُ مُوسَىٰٓ (Apakah telah sampai kepadamu kisah Musa?) Yakni kisah Nabi Musa dalam melawan Fir’aun dan pengikutnya. Dalam kisah ini terdapat pelipur lara bagi Rasulullah atas kesulitan yang beliau temui dalam menjalankan kenabian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Apakah telah sampai kepadamu kabar dan kisah tentang Musa dengan Fir’aun dan pengikutnya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah} sungguh {telah sampai kepadamu kisah} berita {Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah berfirman kepada NabiNya, Muhammad dalam bentuk pertanyaan yang bersifat penetapan dan pengagungan serta membesarkan kisah ini “Apakah telah sampai kepadamu kisah Musa?” mengenai keadaannya yang merupakan pangkal kebahagiaan dan tempat penetapan kenabiannya, beliau melihat api dari kejauhan. Sebelumnya beliau pernah tersesat dalam perjalannya, kemudian didera oleh hawa dingin, tanpa memiliki sesuatu pun yang dapat menghangatkan tubuhnya dalam perjalanan. Maka beliau berkata kepada istrinya, “Sesungguhnya aku melihat,” aku menyaksikan “api.” Peristiwa ini terjadi di bagian kanan gunung Thur. “Mudah-mudahan aku dapat membawa sedikit darinya kepadamu,” untuk menghangatkan diri dengannya “atau aku akan mendapat petunjuk di tempat api itu,” maksudnya orang yang menunjukkan jalan kepada kita. Yang beliau cari adalah cahaya yang bersifat inderawi dan petunjuk biasa. Akan tetapi, beliau menjumpai cahaya maknawi, cahaya wahyu yang akan membuat jiwa-jiwa dan hati bersinar karenanya, serta hidayah yang sejati. Yaitu petunjuk menuju shirath al-Mustaqim yang mengantarkan ke Surga Na’im. Terjadilah peristiwa yang tidak pernah beliau perhitungkan dan tak pernah terbetik di benak beliau."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 9: Allah Ta’ala berfirman kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam dengan pertanyaan sebagai taqrir (penetapan) dan ta’zhim (pengagungan) terhadap kisah itu. Yakni pada awal kebahagiaannya dan awal kenabiannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 9",
    "description": "Usai menjelaskan keagungan Al-Qur'an dan tugas berat yang diamanahkan kepada rasulullah, pada ayat-ayat berikut Allah menguraikan kisah nabi musa yang juga diberi amanah berat, yaitu berdakwah kepada fir'aun yang sangat ingkar. Kisah ini dimaksudkan untuk menguatkan nabi Muhammad dalam berdakwah. Dan apakah telah sampai kepadamu, wahai nabi Muhammad, kisah musa saat akan menerima tugas kerasulan'10. Ketika dalam perjalanan menuju mesir, dia melihat api yang menyala terang, lalu dia berkata kepada keluarganya yang menyertainya dalam perjalanan itu, 'tinggAllah kamu di sini sampai aku kembali. Sesungguhnya aku melihat api. Mudah-Mudahan aku dapat membawa sedikit nyala api kepadamu agar kita dapat menghangatkan badan pada malam yang dingin ini, atau aku akan mendapat petunjuk dari seseorang yang ada di sekitar tempat api itu. '."
  }
]