[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Harun telah berkata kepada Bani Israil sebelum kembalinya Musa kepada mereka, “Wahai kaumku, sesungguhnya kalian itu sedang diuji dengan keberadaan patung anak sapi ini, agar menjadi tampak jelas orang yang beriman dari kalian dan orang yang kafir. Dan sesungguhnya Tuhan kalian adalah ar-Rahman, tiada tuhan sembahan selainNya. Maka ikutilah aku dalam perkara yang aku seru kalian kepadanya, yaitu beribadah hanya kepada Allah, dan taatilah perintahku untuk mengikuti syariatNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Dan sungguh sebelum kepulangan Musa kepada mereka, Harun telah berkata memperingatkan kaumnya, \"Dalam pembuatan patung anak sapi yang terbuat dari emas dan suaranya ini hanyalah sebagai cobaan bagi kalian agar nampak siapa di antara kalian yang mukmin dan siapa yang kafir, dan sesungguhnya Tuhan kalian -wahai kaumku- ialah Tuhan yang memiliki anugerah rahmat, bukan sesuatu yang tidak kuasa menolak adanya mudarat atau mendatangkan manfaat, apalagi kuasa untuk mencurahkan rahmat pada kalian, maka ikutilah aku dalam beribadah hanya kepada-Nya semata, dan taatilah perintahku untuk meninggalkan ibadah kepada selainnya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Demi Allah, Harun telah memperingatkan mereka sebelum Musa datang dari gunung Thur: “Hai kaumku, sesungguhnya keimanan kalian telah diuji dengan patung anak sapi ini, agar jelas siapa yang beriman dan siapa yang kafir. Dan Tuhan kalian hanyalah Allah Yang Maha Pengasih, tidak ada Tuhan selain-Nya; maka ikutilah aku dalam beribadah dan taatilah perintahku dalam kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. وَلَقَدْ قَالَ لَهُمْ هٰرُونُ مِن قَبْلُ (Dan sesungguhnya Harun telah berkata kepada mereka sebelumnya) Yakni sebelum Musa kembali kepada mereka. يٰقَوْمِ إِنَّمَا فُتِنتُم بِهِۦ ۖ( Hai kaumku, sesungguhnya kamu hanya diberi cobaan dengan anak lembu) Yakni kalian telah terjerumus dalam musibah akibat patung anak sapi itu, dan kalian telah tersesat dari jalan kebenaran karenanya. وَإِنَّ رَبَّكُمُ الرَّحْمٰنُ فَاتَّبِعُونِى وَأَطِيعُوٓا۟ أَمْرِى(dan sesungguhnya Tuhanmu ialah (Tuhan) Yang Maha Pemurah, maka ikutilah aku dan taatilah perintahku”) Yakni Tuhanmu adalah Allah ar-Rahman dan bukan patung anak sapi itu, maka ikutilah aku dalam menyembah Allah dan jangan kalian Samiri yang memerintahkan kalian untuk menyembah patung itu, taatilah perintahku dan jangan kalian taati perintah Samiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Sungguh sebelum Musa kembali dari bukit Thur, Harun telah berkata kepada mereka: “Sesungguhnya keimanan kalian telah diuji dan dicoba dengan adanya anak sapi ini, sehingga kalian menyembahnya. Sesungguhnya Allah yang Maha Pengasih adalah Tuhan kalian, maka ikutlah peribadatanku dan tetap berpegang teguh pada kebenaran. Janganlah kalian mengikuti Samiry dan taatlah kepadaku dalam melaksanakan ibadah, bukan kepadanya!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Harun telah berkata kepada mereka sebelumnya} sebelum kembalinya Musa kepada mereka {“Wahai kaumku, sesungguhnya kalian diberi cobaan dengannya} kalian diberi cobaan dengan patung anak sapi itu {dan sesungguhnya Tuhan kalian ialah Dzat Yang Maha Pengasih. Maka ikutilah aku dan taatilah perintahku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90-91. Maksudnya: dengan beribadah kepada anak sapi, mereka itu bukanlah orang yang bisa diberi (toleransi) udzur. Sesungguhnya mereka meskipun ada syubhat yang muncul pada mereka tentang penyembahannya, akan tetapi Harun telah melarang mereka dari tindakan tersebut, memberitahu mereka bahwa ia merupakan fitnah, dan Rabb mereka ialah (Rabb) Yang Maha Pemurah. DariNya bersumber kenikmatan-kenikmatan yang lahiriah maupun batiniah, Dzat Yang Berkuasa untuk menyingkirkan malapetaka. Harun memerintahkan mereka untuk mengikuti dirinya dan meninggalkan anak sapi, namun mereka enggan sembari mengatakan, “Kami akan tetap menyembah patung anak lembu ini, hingga Musa kembali kepada kami.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 90: Dengan demikian alasan mereka tidak diterima, karena Harun telah melarang mereka dan memberitahukan, bahwa hal itu merupakan fitnah (cobaan). Namun ternyata, mereka tidak menghiraukan kata-kata Harun dan tetap menyembahnya sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 90",
    "description": "Dan sungguh, sebelumnya, yaitu sebelum kepulangan nabi musa, nabi harun telah mengingatkan dan berkata kepada mereka yang menyembah patung anak sapi itu, 'wahai kaumku! sesungguhnya kamu hanya sekadar diberi cobaan dengan patung anak sapi itu. Dan sungguh tuhanmu yang hakiki ialah Allah yang maha pengasih, maka ikutilah dengan sungguh-sungguh nasihat dan peringatan yang aku berikan kepadamu dan taatilah perintahku untuk beriman dan beribadah hanya kepada tuhan yang maha esa. '91. Mereka tidak menghiraukan nasihat nabi harun seraya menjawab, 'sungguh, kami tidak akan meninggalkannya, yaitu patung anak sapi itu. Kami tetap akan menyembahnya sampai musa kembali kepada kami. '."
  }
]