[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "92-93. Musa berkata saudaranya, Harun, “Apa yang menahanmu untuk menjumpaiku ketika engkau melihat mereka telah tersesat dari agama mereka, kenapa kamu tidak mengikutiku dan kemudian kamu menyusulku dan meninggalkan mereka? Apakah kamu memang mau mendurhakai perintahku yang telah aku perintahkan kepadamu untuk menjadi penggantiku dan memperbaiki mereka sepeninggalku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. untuk meninggalkan mereka dan menyusulku?! Apakah engkau sengaja melanggar perintahku ketika menjadikanmu sebagai penggantiku untuk memimpin mereka?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. أَلَّا تَتَّبِعَنِ ۖ (kamu tidak mengikuti aku?) Yakni apa yang menghalangimu untuk mengikutiku dan menyusulku ketika mereka terjerumus kedalam kesesatan dan musibah ini. أَفَعَصَيْتَ أَمْرِى(Maka apakah kamu telah (sengaja) mendurhakai perintahku?) Bagaimana kamu melanggar perintahku agar menyembah Allah dan menjauhi orang yang menyalahi agama-Nya dan mengapa kamu tetap tinggal bersama orang-orang yang menjadikan patung anak sapi itu sebagai tuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92-93. Setelah kembali, Musa berkata: “Wahai Harun, apa yang menghalangimu saat terjadi kebathilan dan kekufuran terhadap Allah, bukankah kamu mengikutiku dalam berpegang teguh dalam membedakan kebenaran dan sesuatu yang dibenci oleh Allah. apakah kamu mengingkari perintah yang telah kuberikan kepadamu untuk menegakkan agama dan melindunginya, saat kamu melihat mereka tersesat menyembah berhala, lalu kamu bisa berdiri di antara kaum yang tidak menyembah Allah SWT?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga kamu mengikutiku} menyusulku {Apakah kamu melanggar} apakah kamu menentang {perintahku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92-93. Musa mendatangi saudaranya, Harun dengan mencelanya. Beliau berkata, “Hai Harun, apa yang menghalangimu ketika kamu melihat mereka telah sesat, (sehingga) kamu tidak mengikuti aku?” untuk memberitahuku hingga aku pun bersegera untuk kembali menemui mereka, “maka apakah kamu telah (sengaja) mendurhakai perintahku,” yaitu mengenai ucapanku, \"\"Gantikanlah aku dalam (memimpin) kaumku, dan perbaikilah, dan janganlah kamu mengikuti jalan orang-orang yang membuat kerusakan.\" (al-A’raf: 142). Maka Musa memegang kepala dan janggut Harun, menariknya lantaran marah dan mencelanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 93: Yaitu perintah Musa ‘alaihis salam kepadanya, “Gantikanlah aku dalam (memimpin) kaumku, perbaikilah, dan janganlah kamu mengikuti jalan orang-orang yang membuat kerusakan.\" (lihat Al A’raaf: 142)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 93",
    "description": "92-93. Melihat kesesatan kaumnya, nabi musa marah dan menegur nabi harun karena dianggap tidak mampu memimpin bani israil dengan baik. Sambil memegang kepala dan janggut saudaranya itu, dia berkata, 'wahai harun! Allah mengutusmu untuk membantuku. Apa yang menghalangimu untuk menegur ketika engkau melihat mereka telah sesat dengan menyembah patung anak sapi' apa yang menyebabkan engkau tidak mengikuti aku dalam berdakwah dan mengajak mereka untuk mengesakan Allah' apakah engkau telah sengaja melanggar perintahku sehingga engkau membiarkan mereka sesat''94. Menghadapi kemarahan nabi musa, dia dengan lembut menjawab, 'wahai putra ibuku! jangan marah kepadaku. Janganlah engkau pegang janggutku dan jangan pula engkau tarik kepalaku. Aku sungguh khawatir bila bersikap keras kepada para penyembah patung anak sapi itu, akan terjadi pertumpahan darah di antara mereka. Ketika itu terjadi, pasti engkau akan berkata kepadaku, 'wahai harun, engkau telah memecah belah antara bani israil dan engkau tidak memelihara amanatku untuk menggantikanku memimpin bani israil dan menjaga mereka dari kesesatan. ''."
  }
]