[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Musa memegang jenggot dan kepala Harun serta menariknya ke arahnya,. Maka Harun berkata kepadanya, “Wahai putra ibuku, janganlah kamu pegangi jenggotku dan juga rambut kepalaku. Sesungguhnya aku khawatir (jika aku tinggalkan mereka dan aku menyusulmu), kamu akan mengatakan (kepadaku), ‘Kamu telah memecah belah antara Bani Israil, kamu tidak memelihara wasiatku untuk mengurus mereka dengan baik’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Ketika Musa memegang jenggot dan kepala saudaranya dan menariknya sebagai bentuk pengingkaran perbuatannya, Harun lalu berkata kepadanya untuk menenangkannya, \"Janganlah engkau memegang jenggot dan juga rambutku, karena aku memiliki alasan kenapa aku tetap bersama mereka, aku sungguh khawatir bila meninggalkan mereka, mereka akan berpecah belah, sehingga engkau akan mengatakan padaku bahwa aku telah memecah belah mereka dan tidak menjaga wasiat yang engkau berikan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Harun menjawab dengan lembut: “Wahai anak ibuku, janganlah kamu menggenggam jenggot dan rambutku karena kemarahanmu, sungguh aku tidak menyelisihi perintahmu. Aku khawatir jika aku mencegah mereka maka akan terjadi peperangan di antara mereka sehingga kamu akan mengolokku dengan mengatakan: “Mengapa kamu tidak menunggu keputusanku terhadap mereka?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. قَالَ يَبْنَؤُمَّ لَا تَأْخُذْ بِلِحْيَتِى وَلَا بِرَأْسِىٓ ۖ (Harun menjawab’ “Hai putera ibuku, janganlah kamu pegang janggutku dan jangan (pula) kepalaku) Yakni janganlah kamu perlakukan aku seperti ini untuk menghukumku –ketika itu Musa telah menarik kepala Harun ke arahnya— karena aku memiliki alasan atas apa yang telah aku lakukan. إِنِّى خَشِيتُ أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِىٓ إِسْرٰٓءِيلَ(sesungguhnya aku khawatir bahwa kamu akan berkata (kepadaku): “Kamu telah memecah antara Bani Israil) Aku khawatir jika aku meninggalkan mereka maka mereka akan terpecah belah, sehingga nantinya kamu akan berkata kepadaku bahwa aku telah memecah belah mereka. Hal ini karena jika Harun meninggalkan mereka maka sebagian Bani Israil akan mengikutinya sedangkan Samiri dan sebagian lainnya akan tetap berada di patung anak sapi itu; dan bisa jadi itu akan mengakibatkan peperangan diantara mereka. وَلَمْ تَرْقُبْ قَوْلِى(dan kamu tidak memelihara amanatku) Dan kamu tidak menjalankan dan menjaga wasiatku kepadamu dalam urusan mereka; yaitu ucapan Musa kepada Harun اخلفني في قومي وأصلح (Gantikanlah aku dalam (memimpin) kaumku, dan perbaikilah(al-A’raf: 142)) namun Harun juga meminta uzur dari hal ini dengan ucapannya yang disebutkan dalam surat al-A’raf ayat 105 إن القوم استضعفوني وكادوا يقتلونني (Kaum ini telah menganggapku lemah dan hampir saja mereka membunuhku (al-A’raf: 150)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman menceritakan tentang Harun : { قَالَ يَا ابْنَ أُمَّ لَا تَأْخُذْ بِلِحْيَتِي وَلَا بِرَأْسِي ۖ } \"Harun menjawab’ “Hai putera ibuku, janganlah kamu pegang janggutku dan jangan (pula) kepalaku\" jika ayat ini digabungkan dengan ayat (dimana Allah menyebutkan di dalamnya beberapa nabi dan diantaranya ada Harun) : { أُو۟لَٰٓئِكَ ٱلَّذِينَ هَدَى ٱللَّهُ ۖ فَبِهُدَىٰهُمُ ٱقْتَدِهْ } \"Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka\" [ Al-An'am : 90 ]; akan jelas bahwa diharuskannya memelihara jenggot tanpa memotongnya, karena Nabi Harun adalah termasuk diantara para Nabi yang diperintahkan kepada Nabi Muhammad untuk mengikuti petunjuk mereka, dan perintah itu juga berlaku bagi kita sebagai pengikut beliau."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Harun berkata: “Wahai saudaraku, anak dari Ibuku (sang ibu disinggung untuk melunakkan hati Musa), janganlah kamu genggam jenggot dan rambutku karena ingin menghukum dan marah kepadaku. Sesungguhnya aku tidak mengingkari perintahmu. Alasanku karena aku khawatir jika mengikuti kebulatan tekadmu, para penentang dari golongan mereka akan berkata kepadaku: “Kamu telah memisahkan golongan mereka dan menjadikan mereka menjdai dua golongan, yaitu antara golongan pendukung dan penentang”. Dan kamu juga belum mengerjakan nasehatku untukmu agar tetap menemani mereka dan menjaga mereka” sebagaimana dalam firmanNya SWT: {Ukhlunii fii qaumii wa ashlih} [QS Al-A’raf 7/142]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjawab,“Wahai putra ibuku, janganlah kamu menarik janggutku dan jangan pula kepalaku} dan tidak pula dengan kepalaku {Sesungguhnya aku khawatir kamu akan berkata,”Kamu telah memecah belah antara Bani Israil dan kamu tidak memelihara perkataanku”} dan kamu tidak menjaga wasiatku dan tidak mengerjakannya ketika aku berkata kepadamu,”jadilah penggantiku untuk kaumku, dan perbaikilah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Harun menjawab, “Hai putra ibuku,” untuk melunakkan hatinya, namun walaupun bukan demikian (tujuannya), dia memang saudara kandungnya. “Janganlah kamu pegang janggutku dan jangan (pula) kepalaku. Sesungguhnya aku khawatir bahwa kamu akan berkata (kepadaku), ‘Kamu telah memecah belah antara Bani Israil, dan kamu tidak memelihara amanatku’.” Sesungguhnya engkau memerintahkanku untuk menggantikanmu (memimpin mereka). Jika aku menyusulmu (untuk memberitahukan kejadian tersebut), berarti aku telah meninggalkan apa yang engkau perintahkan kepadaku agar tetap dikonsisteni. (Dengan itu) aku khawatir makianmu (kepadaku) dan komentarmu, “Engkau telah memecah belah antara Bani Israil lantaran engkau tinggalkan mereka tanpa pembimbing dan pengganti.” Sesungguhnya hal ini telah memecah dan menceari-beraikan keutuhan mereka. Maka, janganlah engkau mengkategorikanku ke dalam orang-orang yang berbuat aniaya. Dan janganlah menjadikan para musuh menertawakan kita. Musa pun menyesal atas tindakannya kepada saudaranya, padahal dia tidak berhak menerima perlakuan itu. Beliau berkata, \"Ya Tuhanku, ampunilah aku dan saudaraku dan masukkanlah kami ke dalam rahmat Engkau, dan Engkau adalah Maha Penyayang di antara para penyayang\". (Al-A’raf:151). Kemudian Musa berpaling kepada Samiri,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 94: Musa ‘alaihis salam memegang janggut Harun dengan tangan kirinya, dan memegang rambut kepalanya dengan tangan kanannya karena marah. Yakni engkau telah memerintahkan kepadaku agar aku menggantikanmu memimpin bani Israil. Jika aku mengikuti(menyusul)mu, tentu aku meninggalkan perintahmu untuk tetap bersama bani Israil. Karena meninggalkan mereka, sehingga mereka tidak memiliki pemimpin, di mana hal itu dapat memecah belah mereka. Maka Musa menyesal terhadap tindakannya kepada saudaranya, padahal saudaranya tidak patut dicela, ia pun berdoa, “Ya Tuhanku, ampunilah aku dan saudaraku dan masukkanlah kami ke dalam rahmat Engkau, dan Engkau adalah Maha Penyayang di antara para penyayang.” (Lihat Al A’raaf: 151) setelah itu Nabi Musa ‘alaihis salam mendatangi Samiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 94",
    "description": "Menghadapi kemarahan nabi musa, dia dengan lembut menjawab, 'wahai putra ibuku! jangan marah kepadaku. Janganlah engkau pegang janggutku dan jangan pula engkau tarik kepalaku. Aku sungguh khawatir bila bersikap keras kepada para penyembah patung anak sapi itu, akan terjadi pertumpahan darah di antara mereka. Ketika itu terjadi, pasti engkau akan berkata kepadaku, 'wahai harun, engkau telah memecah belah antara bani israil dan engkau tidak memelihara amanatku untuk menggantikanku memimpin bani israil dan menjaga mereka dari kesesatan. ''95. Usai menegur nabi harun, nabi musa meluapkan kemarahannya kepada samiri yang telah menyesatkan bani israil. Dia berkata, 'apakah yang mendorongmu menyesatkan bani israil dengan membuat patung anak sapi untuk disembah, wahai samiri''."
  }
]