[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada Samiri, “Ada apa denganmu, wahai Samiri? Apa yang mendorongmu melakukan apa yang telah kamu perbuat ini?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Musa lalu berkata kepada Samiri, \"Apa tujuanmu wahai Samiri? Apa yang mendorongmu untuk melakukan yang demikian ini?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95-96. Kemudian Musa menuju Samiri untuk mengolok dan mencegahnya: “Mengapa kamu melakukan perbuatan buruk ini?” Samiri mengakui dosanya dan berkata: “Aku melihat apa yang tidak mereka lihat, kemudian aku mengambil segenggam jejak malaikat dan lemparnya bersama perhiasan-perhiasan itu untuk membuat patung anak sapi; demikianlah hawa nafsuku menghiasi perbuatan ini.” Samiri telah berdusta telah melihat malaikat Jibril, karena Samiri adalah orang sesat dan menyesatkan. Tidak disebutkan bahwa dia telah bertaubat, namun tempat kembalinya adalah azab di dunia dan di akhirat sebagaimana yang akan disebutkan pada ayat selanjutnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. قَالَ فَمَا خَطْبُكَ يٰسٰمِرِىُّ (Berkata Musa: “Apakah yang mendorongmu (berbuat demikian) hai Samiri?”) Yakni apa yang membuatmu melakukan hal itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Lalu Musa berkata kepada orang yang berbuat munkar: “Apa yang membuatmu melakukan perkara yang berbahaya ini?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa berkata {“Apa yang mendorongmu} apa yang masalah dan perkaramu {wahai Samiri”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95-96. Ada apa denganmu wahai Samiri hingga berbuat apa yang telah engkau lakukan? DIa menjawab, “Aku mengetahui segala sesuatu yang mereka tidak mengetahuinya,” yaitu Jibril yang menunggang kuda. Ia sempat menyaksikan Jibril ketika mereka keluar dari laut dan tenggelamnya Fir’aun dan pasukannya, berdasarkan pada penjelasan para ulama tafsir. “Maka aku ambil segenggam dari jejak,” telapak kaki kudanya. Lalu Aku melemparkan genggaman itu pada anak sapi. “Dan demikianlah nafsuku membujukku,” agar aku menggengamnya dan menyebarkannya. Maka jadilah apa yang telah terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 95",
    "description": "Usai menegur nabi harun, nabi musa meluapkan kemarahannya kepada samiri yang telah menyesatkan bani israil. Dia berkata, 'apakah yang mendorongmu menyesatkan bani israil dengan membuat patung anak sapi untuk disembah, wahai samiri''96. Mendapat pertanyaan dari nabi musa, dia menjawab, 'aku melihat dan mengetahui sesuatu yang tidak mereka ketahui. Aku melihat jibril menunggang kuda ketika bani israil keluar dari laut dan fir'aun tenggelam. Jadi, aku ambil segenggam tanah dari jejak tapal kuda rasul itu, lalu aku melemparkannya ke arah perhiasan-perhiasan yang aku jadikan bahan membuat patung anak sapi itu hingga patung itu mampu mengeluarkan suara. Aku tahu mereka pernah memintamu untuk membuat tuhan yang berjasad untuk mereka sembah, maka demikianlah nafsuku membujukku untuk menciptakan patung anak sapi ini sebagai tuhan mereka. '."
  }
]