[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Samiri menjawab, “Aku telah melihat apa yang tidak mereka lihat, (yaitu Jibril) dia berada di atas kuda ketika mereka keluar dari laut dan tenggelamnya Fir’aun dan bala tentaranya. Maka aku ambil tanah bekas kuda Jibril dengan telapak tanganku. Lalu aku lemparkan ke perhiasan-perhiasan yang aku buat patung anak sapi darinya. Tiba-tiba muncul patung anak sapi yang memiliki bentuk tubuh, sebagai cobaan dan fitnah. Demikian pula nafsuku yang memerintahkan kepada keburukan telah mendorongku melakukannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Samiri berkata kepada Musa -'alaihissalām-, \"Aku melihat sesuatu yang mereka tidak melihatnya, sungguh aku telah melihat Malaikat Jibril berada di atas seekor kuda, lalu aku mengambil segenggam tanah dari jejak kaki kudanya, kemudian melemparkannya ke dalam perhiasan-perhiasan yang terbentuk dalam rupa patung anak sapi sehingga membuatnya menjadi satu patung berjasad dan mengeluarkan suara. Demikianlah hawa nafsuku menganggap baik apa yang aku lakukan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوا۟ بِهِۦ (Samiri menjawab: “Aku mengetahui sesuatu yang mereka tidak mengetahuinya) Terdapat pendapat mengatakan Samiri mengaku telah melihat malaikat Jibril yang menunggangi kuda, kemudian diwahyukan kepadanya agar dia menggenggam bekas telapak kaki kuda tersebut, dan apabila bekas itu diletakkan pada benda mati maka benda itu pasti akan menjadi hidup. فَنَبَذْتُهَا (lalu aku melemparkannya) Maka aku melemparkan bekas itu pada emas yang telah dicetak dengan bentuk anak sapi. وَكَذٰلِكَ سَوَّلَتْ لِى نَفْسِى (dan demikianlah nafsuku membujukku”) Yakni menghiasi perbuatanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Samiriy berkata: “Aku mengetahui sesuatu yang belum pernah mereka ketahui. Aku mengambil segenggam tanah dari sisa pijakan kuda Jibril saat datang untuk menghancurkan Fir’aun, lalu aku melemparkannya ke dalam logam leleh yang sudah dibentuk anak sapi. Seperti itulah nafsuku mengiasi diriku” Penafsiran ini membutuhkan penegasan dan perenungan. Abu Muslim Al-Ashfahani menafsirkannya: “Aku mengetahui cara menciptakan sesuatu yang tidak mereka ketahui. Lalu mengambil beberapa pengetahuan rasul yaitu kamu wahai Musa, lalu aku gunakan untuk melakukan perbuatan yang dihiasi oleh hawa nafsuku ini yang mana menganggap bahwa anak sapi ini adalah tuhannya Bani Israil.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjawab} Samiri berkata {“Aku melihat sesuatu yang tidak mereka lihat} Aku telah melihat sesuatu yang tidak dilihat Bani Israil, Aku melihat Jibril menunggangi kuda {Kemudian aku mengambil segenggam} lalu aku mengambil segenggam tanah {dari bekas jejak utusan} dari jejak kuda Jibril {lalu aku melemparkannya} lalu aku melemparkannya kepada perhiasan yang dilelehkan itu {Demikianlah nafsuku membujukku”} menggoda dan membujuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95-96. Ada apa denganmu wahai Samiri hingga berbuat apa yang telah engkau lakukan? DIa menjawab, “Aku mengetahui segala sesuatu yang mereka tidak mengetahuinya,” yaitu Jibril yang menunggang kuda. Ia sempat menyaksikan Jibril ketika mereka keluar dari laut dan tenggelamnya Fir’aun dan pasukannya, berdasarkan pada penjelasan para ulama tafsir. “Maka aku ambil segenggam dari jejak,” telapak kaki kudanya. Lalu Aku melemparkan genggaman itu pada anak sapi. “Dan demikianlah nafsuku membujukku,” agar aku menggengamnya dan menyebarkannya. Maka jadilah apa yang telah terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 96: Yakni aku melihat Jibril ketika datang untuk membinasakan Fir’aun yang tidak mereka (bani Israil) lihat. Yang dimaksud dengan jejak rasul menurut mayoritas mufassir ialah jejak telapak kuda Jibril ‘alaihis salam, artinya Samiri mengambil segumpal tanah dari jejak itu lalu ia lemparkan ke dalam logam yang sedang dihancurkan sehingga logam itu berbentuk anak sapi yang mengeluarkan suara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 96",
    "description": "Mendapat pertanyaan dari nabi musa, dia menjawab, 'aku melihat dan mengetahui sesuatu yang tidak mereka ketahui. Aku melihat jibril menunggang kuda ketika bani israil keluar dari laut dan fir'aun tenggelam. Jadi, aku ambil segenggam tanah dari jejak tapal kuda rasul itu, lalu aku melemparkannya ke arah perhiasan-perhiasan yang aku jadikan bahan membuat patung anak sapi itu hingga patung itu mampu mengeluarkan suara. Aku tahu mereka pernah memintamu untuk membuat tuhan yang berjasad untuk mereka sembah, maka demikianlah nafsuku membujukku untuk menciptakan patung anak sapi ini sebagai tuhan mereka. '97. Nabi musa semakin marah usai mendengar jawaban samiri. Dia berkata, 'wahai samiri, pergilah kau! maka sebagai hukuman atas perbuatanmu, sesungguhnya engkau akan dikucilkan di dalam kehidupan ini sehingga engkau akan selalu mengatakan kepada orang lain, 'janganlah menyentuh atau mendekatiku, sebagaimana aku tidak akan menyentuh atau mendekatimu. ' dan selain itu engkau pasti akan mendapat hukuman di akhirat yang telah dijanjikan, yang tidak akan dapat engkau hindari. Dan lihatlah tuhanmu itu yang beberapa saat lalu engkau tetap bersikeras menyembahnya. Kami pasti akan membakarnya, kemudian sungguh kami akan menghamburkannya, yaitu abu sisa pembakarannya, ke dalam laut hingga bertebaran dan berserakan. '."
  }
]