[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepada Samiri, “Pergilah kamu. Sesungguhnya hukuman bagimu di dalam dunia ini, engkau akan hidup terbuang, kamu hanya mengatakan kepada siapa saja, ‘Aku tidak menyentuh dan aku tidak di sentuh.’ Dan sesungguhnya kamu punya masa untuk mendapatkan siksaan dan hukumanmu. Allah tidak akan memungkirinya bagimu dan kamu akan menemuinya. Dan lihatlah sesembahanmu yang kamu setia menyembahnya, kami benar-benar akan membakarnya dengan api, kemudian kami benar-benar akan menyebarkan (abu) nya di dalam laut, agar diterbangkan oleh angina hingga tidak ada bekas yang tersisa darinya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Musa berkata kepada Samiri, \"Pergilah engkau! Sungguh dalam kehidupan ini engkau hanya dapat mengatakan, \"aku tidak akan menyentuh dan tidaklah disentuh.\" Agar engkau hidup terasing, dan engkau pasti mendapatkan apa yang telah dijanjikan pada hari Kiamat kelak untuk dihisab dan diberikan hukuman, dan Allah tidak akan menyelisihi janji itu. Dan lihatlah patung anak sapi yang engkau jadikan tuhanmu itu, dan terus menyembahnya sebagai tuhan selain Allah, kami pasti akan membakarnya dengan api hingga hancur dan menjadi abu, lalu menghamburkan abunya ke dalam lautan secara berserakan agar ia tidak memiliki jejak apapun.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Maka Musa mengasingkan Samiri: “Pergilah, sesungguhnya balasan bagimu di dunia adalah diasingkan orang-orang dan dibiarkan hidup sendiri sehingga kamu akan berkata: “Aku tidak menyentuh seorangpun dan tidak ada seorangpun yang menyentuhku”; dan azab di akhirat telah dijanjikan bagimu, Allah tidak akan mengingkarinya. Lihatlah kepada sesembahan yang selalu kamu sembah itu, Demi Allah kami akan membakarnya dan menghamburkan abunya di lautan agar tidak tersisa sedikitpun.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. قَالَ فَاذْهَبْ (Berkata Musa: “Pergilah kamu) Yakni keluar dan pergilah dari kami, dan selama kamu hidup kamu hanya bisa mengatakan “Janganlah menyentuhku (berinteraksi denganku)” أَن تَقُولَ لَا مِسَاسَ ۖ (kamu (hanya dapat) mengatakan: Janganlah menyentuh (aku)) Yakni tidak ada yang akan menyemtuhmu dan kamu tidak akan menyentuh orang lain. Yakni Nabi Musa memerintahkan untuk mengusir Samiri dari kaumnya, dan memerintahkan Bani Israil agar tidak mendekati, berbicara, dan berinteraksi dengannya, sebagai hukuman baginya. وَإِنَّ لَكَ مَوْعِدًا لَّن تُخْلَفَهُۥ ۖ( Dan sesungguhnya bagimu hukuman (di akhirat) yang kamu sekali-kali tidak dapat menghindarinya) Yakni Allah tidak akan menyalahi perjanjiannya denganmu, yaitu di hari kiamat. وَانظُرْ إِلَىٰٓ إِلٰهِكَ الَّذِى ظَلْتَ عَلَيْهِ عَاكِفًا ۖ( dan lihatlah tuhanmu itu yang kamu tetap menyembahnya) Yakni yang tetap kamu sembah. لَّنُحَرِّقَنَّهُۥ (Sesungguhnya kami akan membakarnya) Dengan api. ثُمَّ لَنَنسِفَنَّهُۥ فِى الْيَمِّ نَسْفًا (kemudian kami sungguh-sungguh akan menghamburkannya ke dalam laut) Dan kami akan menghamburkan abunya di lautan agar terbawa hembusan angin."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَالَ فَٱذْهَبْ فَإِنَّ لَكَ فِى ٱلْحَيَوٰةِ أَن تَقُولَ لَا مِسَاسَ ۖ } \"Berkata Musa: \"Pergilah kamu, maka sesungguhnya bagimu di dalam kehidupan di dunia ini (hanya dapat) mengatakan: \"Janganlah menyentuh (aku)\" ayat ini hakikatnya ingin menafikan ahli bid'ah dan ahli maksiat agar tidak bercampur bersama mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Musa berkata kepadanya: “Tinggalkanlah kami! Maka akibat perbuatanmu, di sepanjang hidupmu kamu akan hanya berkata kepada orang yang kamu lihat: “Jangan dekati aku dan jangan bergaul denganku” (maksudnya yaitu hidup terasing, menyendiri, dibenci, dan terbuang). Dan bagimu sebuah janji di akhirat terkait hisab dan azabmu. Janji itu tidak akan diingkari dan pasti akan didatangkan oleh Allah. Dan perhatikanlah tuhan anak sapimu yang mana kamu tekun dalam menyembahnya, sungguh kami akan membakarnya dengan api lalu kami tenggelamkan ke dalam lautan sehingga tidak tersisa apapun darinya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa berkata {“Pergilah. Sesungguhnya bagimu di kehidupan ini mengatakan,”Jangan sentuh”} Aku tidak menyentuh dan tidak di sentuh selama hidup {sesungguhnya bagimu janji yang tidak akan dapat kamu hindari} Allah tidak akan mengingkari janji itu darimu, yaitu hari kiamat {Lihatlah tuhanmu itu yang tetap kamu sembah} yang masih tetap kamu sembah {Sungguh Kami akan membakarnya, kemudian sungguh kami akan menghamburkannya ke laut”} memisah-misahkan bagian-bagiannya ke laut sehingga tidak tersisa wujud dan jejaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. Musa berkata, “Pergilah kamu.” Maksudnya, menjauhlah dariku dan menghindarlah dariku, “maka sesungguhnya bagimu di dalam kehidupan di dunia ini (hanya dapat) mengatakan, ‘Janganlah menyentuh (ku),” maksudnya, engkau dikenai hukuman di dunia, berupa tidak boleh ada seorang pun yang mendekatimu atau menyentuhmu, bahkan (jika ada) orang yang ingin mendekatimu, niscaya kami mengatakan kepadanya, “Janganlah menyentuh dan mendekat kepadaku.” Sebagai sanksi atas tindakannya, di mana dia menyentuh sesuatu yang tidak disentuh oleh selainnya dan mengadakan sesuatu yang tidak diadakan oleh orang lain. “Dan sesungguhnya bagimu hukuman (di akhirat) yang kamu sekali-kali tidak dapat menghindarinya.” Engkau diberi balasan atas amalanmu, yang baik dan yang buruk. “Dan lihatlah tuhanmu itu yang kamu tetap menyembahnya,” yaitu anak sapi, “sesungguhnya kami akan membakarnya, kemudian kami sungguh-sungguh akan menghamburkannya ke dalam laut (berupa abu yang berserakan).” Musa pun melakukannya. Sekiranya ia benar-benar tuhan, ia pasti dapat membela diri dari orang yang akan berniat mengganggunya dan berusaha menghancurkannya. Sungguh (kecintaan menyembah) anak sapi telah meresap pada hati Bani Israil. Maka Musa ingin memusnahkannya dalam keadaan mereka menyakksikannya dengan cara yang membuatnya tidak mungkin lagi kembali ke wujudnya semula, yaitu dengan membakar dan menyebarkannya ke dalam laut dan menghamburkannya. Supaya cinta yang melekat pada hati mereka lenyap, sebagaimana wujud asinya pun hilang. Sebab, membiarkannya tetap utuh akan menimbulkan fitnah. Pasalnya, di dalam jiwa terdapat bisikan kuat yang menyeru kepada kebatilan. Manakala sudah menjadi jelas kebatilannya bagi mereka, maka Musa memberitahukan kepada mereka tentang Dzat yang berhak disembah satu-satunya, tiada sekutu bagiNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 97: Maksudnya, agar Samiri hidup terpencil sendiri sebagai hukuman di dunia, sehingga tidak ada yang mendekatinya, bahkan jika ada orang yang mendekatinya, ia (Samiri) akan berkata kepadanya, “Janganlah engkau menyentuhku dan mendekat kepadaku.” Adapun sebagai hukuman di akhirat, ia akan ditempatkan di dalam neraka. Maka Musa melakukan hal itu, jika seandainya patung itu pantas disembah tentu dia akan melawan Musa dan mengalahkannya, namun ternyata ia tidak berbuat apa-apa. Ketika itu kecintaan menyembah patug sudah meresap di hati bani Israil, maka Musa menghancurkannya di hadapan mereka, dengan dibakar dan dihambur-hamburkan ke lautan agar rasa cinta mereka kepada patung hilang. Di samping itu, membiarkannya dapat membuat mereka terfitnah, karena dalam jiwa manusia terdapat pendorong kepada kebatilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 97",
    "description": "Nabi musa semakin marah usai mendengar jawaban samiri. Dia berkata, 'wahai samiri, pergilah kau! maka sebagai hukuman atas perbuatanmu, sesungguhnya engkau akan dikucilkan di dalam kehidupan ini sehingga engkau akan selalu mengatakan kepada orang lain, 'janganlah menyentuh atau mendekatiku, sebagaimana aku tidak akan menyentuh atau mendekatimu. ' dan selain itu engkau pasti akan mendapat hukuman di akhirat yang telah dijanjikan, yang tidak akan dapat engkau hindari. Dan lihatlah tuhanmu itu yang beberapa saat lalu engkau tetap bersikeras menyembahnya. Kami pasti akan membakarnya, kemudian sungguh kami akan menghamburkannya, yaitu abu sisa pembakarannya, ke dalam laut hingga bertebaran dan berserakan. '98. Setelah memutuskan untuk membakar patung anak sapi itu, nabi musa berpidato di depan kaumnya, 'sungguh, tuhanmu yang layak disembah itu hanyalah Allah yang esa. Tidak ada tuhan pencipta dan pengatur alam semesta selain dia. Pengetahuan-Nya meliputi segala sesuatu yang ada di alam ini. '."
  }
]