[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Tuhan kalian, (wahai sekalian manusia), adalah Allah, Yang tiada sesembahan yang berhak diibadahi kecuali Dia, pengetahuanNya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Sungguh, Tuhan kalian yang berhak disembah -wahai manusia- hanyalah Allah yang tiada tuhan yang berhak disembah selain-Nya, pengetahuan-Nya meliputi segala sesuatu, tidak ada satu pengetahuan pun yang Dia tidak ketahui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Kemudian Musa berkata kepada kaumnya: “Tuhan kalian adalah Allah yang tidak ada Tuhan yang berhak disembah selain Dia, ilmu-Nya meliputi segala sesuatu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. إِنَّمَآ إِلٰهُكُمُ اللهُ الَّذِى لَآ إِلٰهَ إِلَّا هُوَ (Sesungguhnya Tuhanmu hanyalah Allah, yang tidak ada Tuhan selain Dia) Bukan patung anak sapi yang digunakan Samiri untuk menyesatkan kalian. وَسِعَ كُلَّ شَىْءٍ عِلْمًا(Pengetahuan-Nya meliputi segala sesuatu) Ilmu-Nya meliputi segalanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Lalu Musa berkata kepada kaumnya: “Sesungguhnya Tuhan kalian yang layak disembah hanyalah Allah yang mana tiada Tuhan yang layak disembah selain Dia. Ilmunya meliputi segala sesuatu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmu hanyalah Allah yang tidak ada tuhan selain Dia. IlmuNya meliputi segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Maksudnya, tidak ada sesembahan (yang berhak disembah) kecuali WajahNya Yang MUlia. Tidak boleh disembah, dicintai, ditakuti, diseur kecuali Dia. Dia-lah Dxat yang sempurna yang mempunyai nama-nama yang tinggi, yang ilmuNya meliputi segala sesuatu, yang tidak ada satu pun kenimatan pada manusia melainkan (pasti) bersumber dariNya, tidak sanggup menyingkirkan kejelekan kecuali Dia. Tidak ada tuhan yang berhak disembah kecuali Dia, dan tidak ada sesembahan yang berhak disembah selainNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 98: Setelah jelas kebatilan menyembah patung, maka Musa memberitahukan kepada mereka siapa yang sesungguhnya berhak diibadahi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 98",
    "description": "Setelah memutuskan untuk membakar patung anak sapi itu, nabi musa berpidato di depan kaumnya, 'sungguh, tuhanmu yang layak disembah itu hanyalah Allah yang esa. Tidak ada tuhan pencipta dan pengatur alam semesta selain dia. Pengetahuan-Nya meliputi segala sesuatu yang ada di alam ini. '99. Wahai nabi Muhammad, demikianlah kami kisahkan kepadamu sebagian kisah umat yang telah lalu agar menjadi ibrah dan pelajaran bagi umatmu. Dan selain itu, sesungguhnya telah kami berikan pula kepadamu dari sisi kami suatu peringatan, yaitu Al-Qur'an, sebagai tuntunan dan petunjuk menuju kesejahteraan hidup mereka di dunia dan akhirat."
  }
]