[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana Kami telah mengisahkan kepadamu (wahai Rasul) cerita tentang Musa dan Fir’aun serta kaum mereka, Kami juga memberitahukan kepadamu kisah-kisah para nabi terdahulu. Dan sesungguhnya Kami telah memberikan kepadamu dari sisi Kami al-Qur’an ini sebagai peringatan bagi orang-orang yang mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Sebagaimana yang Kami ceritakan kepadamu -wahai Rasul- tentang kisah Musa, Fir'aun, dan kisah kedua kaumnya, maka Kami menceritakan pula kepadamu kisah-kisah-kisah para Nabi dan umat-umat terdahulu agar menjadi penghibur dan penenang hatimu, dan Kami telah berikan kepadamu dari sisi Kami Al-Qur`ān sebagai peringatan bagi orang yang mau menerima peringatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99-100. Hai Nabi, Demikianlah Kami ceritakan kepadamu kisah Musa dan Fir’aun; Kami menceritakan kepadamu kisah-kisah agung dari umat-umat terdahulu, dan Kami telah menurunkan al-Qur’an kepadamu sebagai peringatan bagi orang yang mau mengingat. Dan barangsiapa yang berpaling darinya dan tidak beriman kepadanya maka pada hari kiamat dia akan menanggung dosa yang besar, mereka akan kekal di neraka Jahannam sebagai balasan atas dosa tersebut. Betapa buruknya dosa besar yang menjadikan mereka mendapat azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. كَذٰلِكَ نَقُصُّ عَلَيْكَ (Demikianlah kami kisahkan kepadamu) Yakni sebagaimana Kami menceritakan kisah Musa kepadamu, Kami juga menceritakan sebagian kisah umat terdahulu kepadamu. مِنْ أَنۢبَآءِ مَا قَدْ سَبَقَ ۚ (sebagian kisah umat yang telah lalu) Yakni kisah-kisah kejadian masa lalu yang terjadi pada umat-umat terdahulu sebagai penghibur hatimu dan sebagai bukti kebenaranmu. وَقَدْ ءَاتَيْنٰكَ مِن لَّدُنَّا ذِكْرًا (dan sesungguhnya telah Kami berikan kepadamu dari sisi Kami suatu peringatan) Yang dimaksud dengan (الذكر) adalah al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Wahai Nabi, sebagaimana menceritakan kisah Musa dan Samiri ini, Kami juga akan menceritakan kepadamu berita tentang umat-umat terdahulu yang tidak mengenalmu, namun berpegang teguh untuk mengimanimu. Dan sungguh Kami telah menurunkan kepadamu Al-Qur’an yang memberikan keterangan dari sisi Kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami mengisahkan kepadamu sebagian kisah} kabar {umat yang terdahulu dan sungguh, Kami telah menganugerahkan kepadamu dari sisi Kami} dari sisi Kami {suatu peringatan} Al-Qur’an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Allah mengabarkan kenikmatan yang dilimpahkan kepada NabiNYa (Muhammad) dengan kisah-kisah yang DIa kisahkan kepada beliau tentang berita-berita orang-orang terdahulu dan kabar-kabar orang-orang di masa silam, semisal kisah yang agung ini, yang memuat hukum-hukum dan kandungan lainnya yang tidak diingkari oleh seorang pun dari kalangan Ahli KItab. Padahal engkau (Muhammad) tidak pernah mempelajari cerita-cerita orang-orang dahulu dan belum pernah mengkaji dari orang yang mengetahuinya. Maka keteranganmu (dengan kebenaran yang yakin) mengenai kisah-kisah mereka itu menjadi dalil bahwa engkau adalah seorang utusan Allah yang sebenarnya dan risalah yang engkau bawa adalah benar. Untuk itu, Allah berfirman, “Dan sesungguhnya telah Kami berikan kepadamu dari sisi Kami,” yaitu anugerah yang berharga, karunia yang agung dari sisi Kami, “suatu peringatan, yaitu al-quran yang mulia ini. Ia berisi kabar-kabar yang telah berlalu dan akan datang, ia merupakan pengingat nama dan sifat Allah yang sempurna, dan merupakan pengingat yang berguna untuk mengingat perintah, larangan, dan hukum-hukum pembalasan. Ini menjadi indicator bahwa al-quran mencakup hukum yang terbaik yang telah diakui oleh akal-akal (sehat) dan fitrah-fitrah (yang lurus), dan diakui keindahan dan kesempurnaannya. Al-quran ini juga (juga) menyebutkan kemampuan yang mana Allah memasukkannya padanya. Apabila al-quran berfungsi sebagai peringatan bagi Rasul dan umatnya; maka ia wajib diterima dengan tulus dan pasrah, patuh dan pengagungan, dan dijadikan petunjuk dengan (pedoman) cahayanya menuju jalan yang lurus, serta menyikapinya dengan belajar dan mengajarkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Thaha ayat 99: Yakni sebagaimana Kami kisahkan kepadamu kisah ini, wahai Muhammad. Allah Subhaanahu wa Ta'aala memberikan nikmat kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam dengan mengisahkan berita orang-orang terdahulu, seperti kisah yang sebelumnya disebutkan. Beliau shallallahu 'alaihi wa sallam sama sekali tidak belajar dari orang-orang yang mengetahui kisah itu dan tidak belajar kepada Ahli Kitab, oleh karenanya hal ini menunjukkan bahwa Beliau adalah utusan Allah dan apa yang Beliau bawa adalah hak (benar). Al Qur’an disebut dzikr (peringatan atau pengingat), karena Al Qur’an mengingatkan berita-berita yang terdahulu, mengingatkan nama-nama dan sifat Allah yang sempurna, mengingatkan hukum-hukum berupa perintah dan larangan, mengingatkan hukum-hukum jaza’i (pembalasan), dsb. Oleh karena itu, Al Qur’an wajib diterima, diikuti, dimuliakan, diambil cahayanya yang menunjuki ke jalan yang lurus, didatangi dengan dipelajari, diamalkan dan diajarkan. Adapun jika menyikapinya dengan berpaling darinya atau bersikap yang lebih parah dari itu, seperti mengingkari dan mendustakan, maka sama saja kufur kepada nikmat itu, dan barang siapa yang melakukan demikian maka ia pantas menerima hukuman sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Thaha Ayat 99",
    "description": "Wahai nabi Muhammad, demikianlah kami kisahkan kepadamu sebagian kisah umat yang telah lalu agar menjadi ibrah dan pelajaran bagi umatmu. Dan selain itu, sesungguhnya telah kami berikan pula kepadamu dari sisi kami suatu peringatan, yaitu Al-Qur'an, sebagai tuntunan dan petunjuk menuju kesejahteraan hidup mereka di dunia dan akhirat. 100. Allah menegaskan bahwa Al-Qur'an merupakan tuntunan dan petunjuk bagi mereka yang menginginkan kebaikan dunia dan akhirat. Tuntunan dan petunjuk itu harus mereka ikuti dan pegang teguh. Barang siapa berpaling dari tuntunan dan petunjuk Al-Qur'an, maka sesungguhnya dia akan memikul dosa yang besar di hari kiamat yang akan menyebabkannya menerima azab."
  }
]