[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah wahai rasul, \"aku berlindung dan bernaung kepada tuhannya manusia yang mahakuasa satu-satunya untuk menolak keburukan was-was.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Katakanlah wahai Rasul, “Aku berpegang teguh pada Rabb manusia dan berlindung kepada-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah menyampaikan kepada Rasulullah dan umatnya untuk berlindung kepada-Nya dari keburukan yang dihembuskan setan ke dalam hati manusia, seihngga mereka dapat tersesat dan menyesatkan. Allah adalah Raja, Maha Kaya yang tidak membutuhkan makhluk, Yang berhak disembah, tidak ada Tuhan yang berhak disembah selain Dia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قُلْ أَعُوْذُ بِرَبِّ النَّاسِ (Katakanlah: “Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia) Tuhan manusia yakni Dzat yang menciptakan mereka, mengatur urusan mereka, dan memperbaiki keadaan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagaimana yang diketahui bahwasanya Allah ta'ala Dialah tuhan seluruh alam, adapun maksud dari ayat ini yang mengatakan Dialah tuhan seluruh manusia padahal Dia tuhan seluruh alam; yaitu sebagai isyarat akan kemuliaan manusia diantara seluruh makhluk, dan peran isti'adzah yang menjadi pelindung ketika syaithon-syaithon membisikkan ke dalam dada manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Katakanlah wahai Nabi: Aku berlindung dan meminta perlindungan kepada Allah yaitu Dzat yang Maha Menciptakan, membimbing dan mengurus urusan-urusan manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku berlindung kepada Tuhan manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Surat ini mencakup perlindungan diri kepada Rabb manusia, Penguasa dan Sesembahan mereka, dari setan yang merupakan pangkal dan materi dasar segala kejahatan. Di antara fitnah dan kejahatannya adalah bisikan dalam dada manusia. Keburukan dibuat seolah-olah baik untuk mereka dan diperlihatkan dalam bentuk yang indah, menggerakan keinginan mereka agar melakukannya, menghalangi mereka dari kebaikan dan kebaikan di perlihatkan pada mereka dengan wujud lain. Setan selalu berada dalam kondisi seperti itu, membisiki kemudian menunda bisikan bila manusia mengingat Rabbnya dan meminta pertolongan kepadaNya untuk menangkal bisikan tersebut. Maka manusia selayaknya meminta pertolongan dan perlindungan serta berpegangan pada pemeliharaan Allah, karena semua makhluk berada di bawah uluhiyah dan kekuasaanNya, semua ubun-ubun makhluk yang melata berada dalam genggaman Allah, dan di bawah uluhiyahNya yang menjadi tujuan penciptaan makhluk. Karena itu, tidaklah tujuan itu sempurna untuk manusia tanpa menangkal kejahatan musuh mereka yang ingin memutuskan mereka dan menghalangi mereka darinya dan ingin menjadikan mereka sebagai golongannya, agar mereka menjadi penghuni Neraka Sa’ir. Bisikan, sebagaimana berasal dari setan juga bisa berasal dari manusia, karena itu Allah berfirman, “Dari jin dan manusia.” Segala puji bagi Allah semata, Rabb semesta alam, secara permulaan, penutup, lahir dan batin. Kita memohon semoga Allah menyempurnakan nikmatNya, memaafkan dosa-dosa kita yang menghalangi kita dari berbagai berkahNya, semoga Allah mengampuni kesalahan dan keinginan hawa nafsu kita yang melenyapkan renungan ayat-ayat Allah dari hati kita. Kita berharap kepadaNya semoga tidak menghalangi kita dari kebaikan yang ada di sisiNya karena keburukan yang ada pada diri kita, karena sesungguhnya hanya kaum kafir dan orang-orang yang sesatlah yang berputus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ قُلْ } Katakanlah wahai Muhammad { أَعُوذُ } \"aku berlindung dan memohon pertolongan\" { بِرَبِّ النَّاسِ } kepada Tuhan manusia, yakni kepada pemilik penciptaan seluruh alam dan yang mengaturnya, kata ( Rabb ) berarti yang mengatur dan menentetukan keadaan dan nasib ciptaannyya, Dia ﷻ yang membimbing mereka dengan wahyu dan segala ilmu yang bermanfaat, \"Rabb\" adalah pemilik mereka, yang membina dengan kenikmatan-kenikmatannya zhahir maupun batin. { بِرَبِّ النَّاسِ } Tuhan seluruh manusia, anak-anak adam seluruhnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ “Katakanlah: \"Aku berlindung kepada Tuhan (yang memelihara dan menguasai) manusia.” Dialah Allah ‘Azza Wa Jalla, Dialah Rab manusia dan yang lain, Tuhan manusia, Tuhan malaikat, Tuhan jin, Tuhan langit, bumi, matahari, bulan dan Tuhan segala sesuatu, dikhususkan manusia di sini, karena sesuai dengan suratnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nas ayat 1: Allah memerintahkan Nabi-Nya ﷺ agar berkata kepada manusia : Aku berlindung kepada Allah dan berpegang teguh kepada Pencipta manusia dan yang membimbing mereka, karena Ia Maha Esa, Yang Maha Mampu membalas tipu daya orang-orang yang berbuat makar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surah yang mulia ini mengandung permintaan perlindungan kepada Allah Tuhan manusia, Penguasa mereka dan Sembahan mereka dari setan yang merupakan sumber keburukan, dimana di antara fitnah dan keburukannya adalah suka membisikkan kejahatan dalam diri manusia, ia perbagus sesuatu yang buruk kepada manusia, dan memperburuk sesuatu yang sebenarnya baik, ia mendorong manusia mengerjakan keburukan dan melemahkan manusia mengerjakan kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nas Ayat 1",
    "description": "Wahai nabi Muhammad, katakanlah kepada umatmu, 'aku berlindung kepada tuhan yang menciptakan, memelihara, dan mengurus manusia. 2. Raja manusia, yang mengatur semua urusan mereka, dan dia mahakaya sehingga tidak membutuhkan mereka."
  }
]