[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tuhan semabahan manusia yang tidak ada sesembahan yang haq kecuali Dia"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesembahan mereka yang benar, tidak ada sesembahan lain yang benar bagi manusia selain Dia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِلٰهِ النَّاسِ (Sembahan manusia) Yakni sesembahan manusia; sebab raja belum tentu menjadi sesembahan, maka Allah menjelaskan di sini bahwa hanya Dia-lah sesembahan manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dzat yang disembah manusia dengan sebenar-benarnya, dan nama Tuhan itu hanya dikhususkan untuk Allah SWT, dan tidak ada satupun sekutu bagiNya. Ini adalah tiga sifat Allah, yaitu Rububiyyah, Malik, dan Uluhiyyah (Mendidik, Merajai dan Menjadi Tuhan)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sembahan manusia} sesembahan manusia yang sebenarnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Surat ini mencakup perlindungan diri kepada Rabb manusia, Penguasa dan Sesembahan mereka, dari setan yang merupakan pangkal dan materi dasar segala kejahatan. Di antara fitnah dan kejahatannya adalah bisikan dalam dada manusia. Keburukan dibuat seolah-olah baik untuk mereka dan diperlihatkan dalam bentuk yang indah, menggerakan keinginan mereka agar melakukannya, menghalangi mereka dari kebaikan dan kebaikan di perlihatkan pada mereka dengan wujud lain. Setan selalu berada dalam kondisi seperti itu, membisiki kemudian menunda bisikan bila manusia mengingat Rabbnya dan meminta pertolongan kepadaNya untuk menangkal bisikan tersebut. Maka manusia selayaknya meminta pertolongan dan perlindungan serta berpegangan pada pemeliharaan Allah, karena semua makhluk berada di bawah uluhiyah dan kekuasaanNya, semua ubun-ubun makhluk yang melata berada dalam genggaman Allah, dan di bawah uluhiyahNya yang menjadi tujuan penciptaan makhluk. Karena itu, tidaklah tujuan itu sempurna untuk manusia tanpa menangkal kejahatan musuh mereka yang ingin memutuskan mereka dan menghalangi mereka darinya dan ingin menjadikan mereka sebagai golongannya, agar mereka menjadi penghuni Neraka Sa’ir. Bisikan, sebagaimana berasal dari setan juga bisa berasal dari manusia, karena itu Allah berfirman, “Dari jin dan manusia.” Segala puji bagi Allah semata, Rabb semesta alam, secara permulaan, penutup, lahir dan batin. Kita memohon semoga Allah menyempurnakan nikmatNya, memaafkan dosa-dosa kita yang menghalangi kita dari berbagai berkahNya, semoga Allah mengampuni kesalahan dan keinginan hawa nafsu kita yang melenyapkan renungan ayat-ayat Allah dari hati kita. Kita berharap kepadaNya semoga tidak menghalangi kita dari kebaikan yang ada di sisiNya karena keburukan yang ada pada diri kita, karena sesungguhnya hanya kaum kafir dan orang-orang yang sesatlah yang berputus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ إِلَٰهِ النَّاسِ } Inil adalah sifat ketiga yang disebutkan dalam surah ini, \"Al-Ilah\" berarti : \"Al-Ma'bud\" yang disembah, dan \"Al-Ma'bud\" terbagi menjadi dua bagian : - Sembahan yang haq, dan ini hanyalah milik Allah - عز وجل - semata. - Sembahan yang bathil, yaitu sembahan selain Allah - عز وجل - dari sembahan-sembahan kaum musyrikin, dan mereka juga berasal dari manusia atau benda-benda mati tak bernyawa. Jadi dalam surah ini disimpulkan ada tidak macam dari pembagian tauhid : \"Rabb\" dan \"Al-Malik\" dan \"Al-Ilah\"."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِلَهِ النَّاسِ “Sembahan manusia.” Maknanya: sesembahan dan yang diibadahi oleh mereka. Sesembahan yang sebenarnya, yang disembah, dicintai dan diagungkan Dialah Allah ‘Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nas ayat 3: Aku berlindung dengan Tuhan manusia dan sesembahan mereka yang benar, yang memalingkan keburukan sihir dan ‘ain, serta keburukan setan dari kalangan manusia dan jin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nas Ayat 3",
    "description": "Sembahan manusia, tuhan yang tidak ada sekutu bagi-Nya. Itulah tuhan yang patut disembah dan dimintai perlindungan. 4-6. Aku berlindung kepada-Nya dari kejahatan bisikan setan yang bersembunyi pada diri manusia dan selalu bersamanya layaknya darah yang mengalir di dalam tubuhnya, yang membisikkan kejahatan dan kesesatan ke dalam dada manusia dengan cara yang halus, lihai, licik, dan menjanjikan secara terus-menerus. Aku berlindung kepada-Nya dari setan pembisik kejahatan dan kesesatan yang berasal dari golongan jin, yakni makhluk halus yang tercipta dari api, dan juga dari golongan manusia yang telah menjadi budak setan."
  }
]