[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dari gangguan setan yang berbisik saat lalai dan bersembunyi saat berdzkir kepada Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dari kejahatan setan yang menimpakan bisikannya kepada manusia tatkala ia lalai dari zikir kepada Allah, dan yang lari dari manusia jika ia mengingat Allah-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Memohon perlindungan kepada Allah ini adalah dari gangguan setan yang dibisikkan ketika seseorang dalam keadaan lalai, dan fikiran buruk yang terlintas dalam jiwa seseorang. Waswas meliputi segala bisikan dari manusia yang suka membuat makar yang menghendaki keburukan bagi orang lain, dan menggunakannya untuk menggoda mereka. Dan setan yang hendak dijauhi ini akan lenyap dan menghilang ketika seseorang berzikir kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. مِنْ شَرِّ الْوَسْوَاسِ (Dari kejahatan (bisikan)) Yakni setan. الْخَنَّاسِ(syaitan yang biasa bersembunyi) Jika nama Allah disebut maka setan akan bersembunyi dan mengecil, namun jika tidak disebut nama Allah maka ia akan membesar dan melakukan bisikannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-6 1 ). Qotadah nerkata : Susungguhnya dari golongan manusia ada juga yang menjadi syaithon, maka hendaklah kita memohon perlindungan dari syaitjon manusia dan syaithon jin. 2 ). Ibnu Badis berkata : dan sebab dari penggunaan kata ( صدور الناس ) \"dada manusia\" sebagai ganti dari kata ( قلوب الناس ) \"hati manusia\" karena hati adalah tempat akal manusia, dan tempatnya iman, dan bisa juga sebagai bentengnya iman, maka bisikan itu tidak dapat menampakkannya, dan tidak pula ia mampu melobanginya. 3 ). { الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ , مِنَ الْجِنَّةِ وَالنَّاسِ } Allah ta'ala menjelaskan macam-macam dari bisikan, bahwasanya bisikan itu ada yang datang dari jin dan manusia; karena sesungguhnya tanpa disadari manusia selalu menyangka bahwa bisikan buruk itu dari syaithon, tetapi hakikatnya itu dari manusia, bahkan dampaknya bisa menjadi perkara yang lebih berbahaya, maka pantaslah manusia memohon perlindungan dari bisiskan-bisikan itu, karena mereka saling berdekatan tetapi dapat membahayak satu sama lain, dan bahwasanya mereka kepada pintuk kesesatan lebih dekat dan lebih mungkin. 4 ). Dalam ayat ini kata \"bisikan\" digantungkan kepada \"dada\", yang merupakan tempatnya hati, yaitu tempatnya akal dan ketaqwaan dan kebaikan dan keburukan, maka beruntunglah setiap hamba yang mampu mensucikan hatinya, yaitu dengan dzikir kepada Allah, dan mentadabburi ayat-ayat Nya, juga ikhlas beribadaha hanya kepada-Nya, serta taubat yang senantiasa diperbaharui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Aku berlindung kepada Allah SWT dari kejahatan makhluk yang selalu memberikan kegelisahan. Dia menyalurkan dalam diri manusia pesan-pesan jahat dan buruk. Makhluk yang biasa bersembunyi. Makhluk yang bersembunyi dan pergi ketika melihat sesuatu yang mencegahnya yaitu dzikrullah SWT. Makhluk yang memberikan sesuatu yang menyesatkan dan membahayakan dalam hati manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dari kejahatan pembisik} setan yang memberi bisikan agar lalai {yang bersembunyi} bersembunyi ketika manusia mengingat Tuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Surat ini mencakup perlindungan diri kepada Rabb manusia, Penguasa dan Sesembahan mereka, dari setan yang merupakan pangkal dan materi dasar segala kejahatan. Di antara fitnah dan kejahatannya adalah bisikan dalam dada manusia. Keburukan dibuat seolah-olah baik untuk mereka dan diperlihatkan dalam bentuk yang indah, menggerakan keinginan mereka agar melakukannya, menghalangi mereka dari kebaikan dan kebaikan di perlihatkan pada mereka dengan wujud lain. Setan selalu berada dalam kondisi seperti itu, membisiki kemudian menunda bisikan bila manusia mengingat Rabbnya dan meminta pertolongan kepadaNya untuk menangkal bisikan tersebut. Maka manusia selayaknya meminta pertolongan dan perlindungan serta berpegangan pada pemeliharaan Allah, karena semua makhluk berada di bawah uluhiyah dan kekuasaanNya, semua ubun-ubun makhluk yang melata berada dalam genggaman Allah, dan di bawah uluhiyahNya yang menjadi tujuan penciptaan makhluk. Karena itu, tidaklah tujuan itu sempurna untuk manusia tanpa menangkal kejahatan musuh mereka yang ingin memutuskan mereka dan menghalangi mereka darinya dan ingin menjadikan mereka sebagai golongannya, agar mereka menjadi penghuni Neraka Sa’ir. Bisikan, sebagaimana berasal dari setan juga bisa berasal dari manusia, karena itu Allah berfirman, “Dari jin dan manusia.” Segala puji bagi Allah semata, Rabb semesta alam, secara permulaan, penutup, lahir dan batin. Kita memohon semoga Allah menyempurnakan nikmatNya, memaafkan dosa-dosa kita yang menghalangi kita dari berbagai berkahNya, semoga Allah mengampuni kesalahan dan keinginan hawa nafsu kita yang melenyapkan renungan ayat-ayat Allah dari hati kita. Kita berharap kepadaNya semoga tidak menghalangi kita dari kebaikan yang ada di sisiNya karena keburukan yang ada pada diri kita, karena sesungguhnya hanya kaum kafir dan orang-orang yang sesatlah yang berputus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ Dari } kejahatan (bisikan) syaitan yang biasa bersembunyi,} { الْوَسْوَاسِ } \"Waswaas\" Dengan baris fathah pada huruf \"و\" pertama, yakni syaithon yang membisikkan, sedangkan kata \"الْوِسْوَاسِ\" dengan baris kasroh pada huruf \"و\" pertama adalah bisikan/keraguan dalam hati. { الْخَنَّاسِ } Yang menghindar atau terlambat, syaithon jika disebut nama Allah dia akan menghindar dan menjauh, dan jika nama Allah tidak disebutkan maka dia akan datang membisikkan dihati-hati manusia, syaithon membiskkan kejahatan ditelinga dan hati manusia agar mereka menjauh dari dzikir kepada Allah - عز وجل - ,"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "4-5 الْوَسْوَاسِ “bisikan jahat” Para ulama mengatakan: kata ini adalah mashdar yang bermakna isim fail. Bermakna: Yang membisikan. Bisikan adalah apa-apa terlintas di dalam hati berupa pikiran-pikiran, karaguan-keraguan dan khayalan-khayalan yang tidak ada hakikatnya. الْخَنَّاسِ al-Khannas adalah yang bersembunyi, memperdaya, menghindar, dan mengawasi saat dzikir kepada Allah ‘Azza Wa Jalla, dia adalah setan. Oleh karenanya, jika adzan dikumandangkan, setan lari menjauh terkentut-kentut hingga ia tidak mendengar adzan. Dan ketika adzan selesai, ia datang kembali hingga iqimah dikumandangkan ia lari lagi. Dan ketika iqomah selesai dia datang sehingga dia mengganggu pikiran seseorang, ia mengatakan: Ingatlah ini, ingatlah ini, ketika ia tidak sadar, ia pun akhirnya tidak ingat berapa rakaat ia shalat. Oleh karenanya telah datang dalam atsar: إِذَا تَغَوَّلَتْ الْغِيْلَاتُ فَبَادِرُوا بِالأَذَانِ “Apabila ghul-ghul beraksi maka segeralah kumandangkan”(1) Ghul-Ghul adalah setan-setan yang terlintas dipandangan orang yang safar saat ia safar, mereka menmpakkan wujud yang seram, atau sebagai musuh atau yang lainnya. Jika seseorang insan mengucapkan takbir mereka akan pergi. (1) Dikeluarkan Ahmad (13865) dan Nasai dalam as-Sunan al-Kubra (10791) dari hadits Jabir Bin Abdullah radhiyallaahu ‘anhuma dan dinyatakan dha’if olej al-Albaniy dalam dha’iiful Jaami’ (545)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nas ayat 4: Kemudian Allah menjelaskan bahwa orang yang berlindung darinya, darinya disini maksudnya adalah keburukan setan yang terlaknat yang ia membisikkan, mempedaya dan memalingkan dari menyebut nama Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setan disebut Khannas, karena ia menjauh dari hati manusia ketika manusia ingat kepada Allah Subhaanahu wa Ta'aala dan meminta perlindungan kepada-Nya agar dihindarkan darinya. Sebaliknya, ketika manusia lupa mengingat Allah, maka setan akan mendatanginya dan membisikkan hatinya. Oleh karena itu, sudah sepatutnya, manusia meminta pertolongan dan perlindungan kepada Allah Tuhan yang mengurus dan mengatur manusia, dimana semua makhluk berada di bawah pengurusan-Nya dan kepemilikan-Nya, dan tidak ada satu pun makhluk kecuali Dia yang memegang ubun-ubunnya dan berkuasa terhadapnya. Demikian pula agar ibadah sempurna, maka sangat diperlukan perlindungan Allah Subhaanahu wa Ta'aala dari kejahatan musuh manusia, yaitu setan yang berusaha menghalangi manusia dari beribadah dan hendak menjadikan mereka sebagai pengikutnya agar sama-sama menjadi penghuni neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nas Ayat 4",
    "description": "4-6. Aku berlindung kepada-Nya dari kejahatan bisikan setan yang bersembunyi pada diri manusia dan selalu bersamanya layaknya darah yang mengalir di dalam tubuhnya, yang membisikkan kejahatan dan kesesatan ke dalam dada manusia dengan cara yang halus, lihai, licik, dan menjanjikan secara terus-menerus. Aku berlindung kepada-Nya dari setan pembisik kejahatan dan kesesatan yang berasal dari golongan jin, yakni makhluk halus yang tercipta dari api, dan juga dari golongan manusia yang telah menjadi budak setan"
  }
]