[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang meniupkan keburukan dan keraguan keraguan dalam jiwa manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Setan itu menyusupkan bisikannya ke dalam hati manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Yang menyebarkan bisikan dan keraguan ke dalam dada manusia, agar dapat membelokkan mereka dari akidah yang kuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. الَّذِى يُوَسْوِسُ فِى صُدُوْرِ النَّاسِ (yang membisikkan (kejahatan) ke dalam dada manusia) Bisikannya adalah ajakannya agar diataati dengan suara tersembunyi yang disampaikan ke hati tanpa terdengar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-6 1 ). Qotadah nerkata : Susungguhnya dari golongan manusia ada juga yang menjadi syaithon, maka hendaklah kita memohon perlindungan dari syaitjon manusia dan syaithon jin. 2 ). Ibnu Badis berkata : dan sebab dari penggunaan kata ( صدور الناس ) \"dada manusia\" sebagai ganti dari kata ( قلوب الناس ) \"hati manusia\" karena hati adalah tempat akal manusia, dan tempatnya iman, dan bisa juga sebagai bentengnya iman, maka bisikan itu tidak dapat menampakkannya, dan tidak pula ia mampu melobanginya. 3 ). { الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ , مِنَ الْجِنَّةِ وَالنَّاسِ } Allah ta'ala menjelaskan macam-macam dari bisikan, bahwasanya bisikan itu ada yang datang dari jin dan manusia; karena sesungguhnya tanpa disadari manusia selalu menyangka bahwa bisikan buruk itu dari syaithon, tetapi hakikatnya itu dari manusia, bahkan dampaknya bisa menjadi perkara yang lebih berbahaya, maka pantaslah manusia memohon perlindungan dari bisiskan-bisikan itu, karena mereka saling berdekatan tetapi dapat membahayak satu sama lain, dan bahwasanya mereka kepada pintuk kesesatan lebih dekat dan lebih mungkin. 4 ). Dalam ayat ini kata \"bisikan\" digantungkan kepada \"dada\", yang merupakan tempatnya hati, yaitu tempatnya akal dan ketaqwaan dan kebaikan dan keburukan, maka beruntunglah setiap hamba yang mampu mensucikan hatinya, yaitu dengan dzikir kepada Allah, dan mentadabburi ayat-ayat Nya, juga ikhlas beribadaha hanya kepada-Nya, serta taubat yang senantiasa diperbaharui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4-5. Aku berlindung kepada Allah SWT dari kejahatan makhluk yang selalu memberikan kegelisahan. Dia menyalurkan dalam diri manusia pesan-pesan jahat dan buruk. Makhluk yang biasa bersembunyi. Makhluk yang bersembunyi dan pergi ketika melihat sesuatu yang mencegahnya yaitu dzikrullah SWT. Makhluk yang memberikan sesuatu yang menyesatkan dan membahayakan dalam hati manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang membisikkan ke dalam dada manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Surat ini mencakup perlindungan diri kepada Rabb manusia, Penguasa dan Sesembahan mereka, dari setan yang merupakan pangkal dan materi dasar segala kejahatan. Di antara fitnah dan kejahatannya adalah bisikan dalam dada manusia. Keburukan dibuat seolah-olah baik untuk mereka dan diperlihatkan dalam bentuk yang indah, menggerakan keinginan mereka agar melakukannya, menghalangi mereka dari kebaikan dan kebaikan di perlihatkan pada mereka dengan wujud lain. Setan selalu berada dalam kondisi seperti itu, membisiki kemudian menunda bisikan bila manusia mengingat Rabbnya dan meminta pertolongan kepadaNya untuk menangkal bisikan tersebut. Maka manusia selayaknya meminta pertolongan dan perlindungan serta berpegangan pada pemeliharaan Allah, karena semua makhluk berada di bawah uluhiyah dan kekuasaanNya, semua ubun-ubun makhluk yang melata berada dalam genggaman Allah, dan di bawah uluhiyahNya yang menjadi tujuan penciptaan makhluk. Karena itu, tidaklah tujuan itu sempurna untuk manusia tanpa menangkal kejahatan musuh mereka yang ingin memutuskan mereka dan menghalangi mereka darinya dan ingin menjadikan mereka sebagai golongannya, agar mereka menjadi penghuni Neraka Sa’ir. Bisikan, sebagaimana berasal dari setan juga bisa berasal dari manusia, karena itu Allah berfirman, “Dari jin dan manusia.” Segala puji bagi Allah semata, Rabb semesta alam, secara permulaan, penutup, lahir dan batin. Kita memohon semoga Allah menyempurnakan nikmatNya, memaafkan dosa-dosa kita yang menghalangi kita dari berbagai berkahNya, semoga Allah mengampuni kesalahan dan keinginan hawa nafsu kita yang melenyapkan renungan ayat-ayat Allah dari hati kita. Kita berharap kepadaNya semoga tidak menghalangi kita dari kebaikan yang ada di sisiNya karena keburukan yang ada pada diri kita, karena sesungguhnya hanya kaum kafir dan orang-orang yang sesatlah yang berputus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian ayat sebelumnya ditafsirkan dengan ayat ini : { الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ } Yaitu syaithon yang membisikkan ke dalam dada manusia dan hati mereka, maka barangsiapa yang merasa waswas hendaklah bersegera untuk beristigfar kepada Allah - عز وجل - , dengan istigfar rasa waswas dan gelisah itu akan hilang dengan izin Allah . Setiap orang dapat tertimpa oleh rasa was-was ini, cemas ketika melakukan suatu ibadah apakah ibadah yang dia lakukan telah selesai atau belum, atau dia cemas dengan wudhunya ketika sedang melaksanakan shalat, bahkan sahabat Nabi ﷺ pun terkadang merasakan hal yang sama, dalam hadits di ceritakan : جَاءَ نَاسٌ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَسَأَلُوهُ: إِنَّا نَجِدُ فِي أَنْفُسِنَا مَا يَتَعَاظَمُ أَحَدُنَا أَنْ يَتَكَلَّمَ بِهِ. قَالَ: وَقَدْ وَجَدْتُمُوهُ؟ قَالُوا: نَعَمْ. قَالَ: ذَلِكَ صَرِيحُ الْإِيمَانِ : \"Beberapa sahabat Rasul datang dan bertanya kepada beliau, “Sungguh, kami mendapatkan dalam diri kami ( bisikan setan ) yang kami merasa berat untuk mengucapkannya.” Rasulullah shallallahu ‘alaihi wa sallam berkata : “Apakah kalian telah mendapatkan bisikan tersebut?” , Para sahabat menjawab, “Ya.”, Rasulullah shallallahu ‘alaihi wa sallam menjawab, “Itulah tanda keimanan yang jelas.” ( HR. Muslim) Sahabat Nabi ﷺ pun pernah merasakan cemas bagaimana dengan kita yang hidup jauh dari zaman Rasulullah ﷺ , oleh karena itu cara yang baik untuk menghilangkan rasa was-was dan cemas yaitu dengan : bersitigfar dan meminta perlindungan dari Allah - عز وجل , dan tidak menceritakan dan melakukan keraguan yang terbetik dalam hatinya, tetapi menolak perasaan itu dan membantahnya, dengan izin Allah - عز وجل - rasa was-was itu akan hilang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "4-5 الْوَسْوَاسِ “bisikan jahat” Para ulama mengatakan: kata ini adalah mashdar yang bermakna isim fail. Bermakna: Yang membisikan. Bisikan adalah apa-apa terlintas di dalam hati berupa pikiran-pikiran, karaguan-keraguan dan khayalan-khayalan yang tidak ada hakikatnya. الْخَنَّاسِ al-Khannas adalah yang bersembunyi, memperdaya, menghindar, dan mengawasi saat dzikir kepada Allah ‘Azza Wa Jalla, dia adalah setan. Oleh karenanya, jika adzan dikumandangkan, setan lari menjauh terkentut-kentut hingga ia tidak mendengar adzan. Dan ketika adzan selesai, ia datang kembali hingga iqimah dikumandangkan ia lari lagi. Dan ketika iqomah selesai dia datang sehingga dia mengganggu pikiran seseorang, ia mengatakan: Ingatlah ini, ingatlah ini, ketika ia tidak sadar, ia pun akhirnya tidak ingat berapa rakaat ia shalat. Oleh karenanya telah datang dalam atsar: إِذَا تَغَوَّلَتْ الْغِيْلَاتُ فَبَادِرُوا بِالأَذَانِ “Apabila ghul-ghul beraksi maka segeralah kumandangkan”(1) Ghul-Ghul adalah setan-setan yang terlintas dipandangan orang yang safar saat ia safar, mereka menmpakkan wujud yang seram, atau sebagai musuh atau yang lainnya. Jika seseorang insan mengucapkan takbir mereka akan pergi. (1) Dikeluarkan Ahmad (13865) dan Nasai dalam as-Sunan al-Kubra (10791) dari hadits Jabir Bin Abdullah radhiyallaahu ‘anhuma dan dinyatakan dha’if olej al-Albaniy dalam dha’iiful Jaami’ (545)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nas ayat 5: Allah menjelaskan bahwa sebab memohon perlindungan adalah bahwa setan membisikkan dalam dada-dada manusia; Membuat manusia menjadi kufur dan bermaksiat sampai manusia mau melakukannya. Agar lolos dari bisikan setan maka wajib untuk meminta perlindungan (kepada Allah) darinya. Sebab jika manusia tidak meminta perlindungan kepada Allah, maka setan berkuasa dalam hatinya dan melemparkan di dalamnya was-was, entah bisikan dalam masalah aqidah, rencana agar melakukan kejahatan, dan lain sebagainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nas Ayat 5",
    "description": "4-6. Aku berlindung kepada-Nya dari kejahatan bisikan setan yang bersembunyi pada diri manusia dan selalu bersamanya layaknya darah yang mengalir di dalam tubuhnya, yang membisikkan kejahatan dan kesesatan ke dalam dada manusia dengan cara yang halus, lihai, licik, dan menjanjikan secara terus-menerus. Aku berlindung kepada-Nya dari setan pembisik kejahatan dan kesesatan yang berasal dari golongan jin, yakni makhluk halus yang tercipta dari api, dan juga dari golongan manusia yang telah menjadi budak setan"
  }
]