[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dari setan-setan jin dan manusia"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Setan itu dari golongan jin juga dari golongan manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan aku berlindung kepada Allah dari keburukan jin dan keburukan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "Kemudian Allah menjelaskan bahwa yang membisikkan itu berasal dari dua jenis; jenis manusia dan jenis jin. Dia berfirman: 6. مِنَ الْجِنَّةِ وَالنَّاسِ (dari (golongan) jin dan manusia) Setan dari jenis jin membisikkan ke dada manusia, sebagaimana telah dijelaskan; sedangkan setan dari jenis manusia, maka ia membisikkan ke dada manusia dengan menampakkan diri sebagai orang yang menasehati dan mengasihinya, sehingga perkataannya dapat masuk ke dalam hati. Dikatakan bahwa Iblis juga membisikkan godaannya ke dalam dada manusia. Ibnu Abbas berkata: tidaklah seseorang dilahirkan melainkan dalam hatinya terdapat setan; jika ia berzikir kepada Allah maka setan itu akan bersembunyi, namun jika ia lalai dari zikir maka ia akan kembali membisikkan.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-6 1 ). Qotadah nerkata : Susungguhnya dari golongan manusia ada juga yang menjadi syaithon, maka hendaklah kita memohon perlindungan dari syaitjon manusia dan syaithon jin. 2 ). Ibnu Badis berkata : dan sebab dari penggunaan kata ( صدور الناس ) \"dada manusia\" sebagai ganti dari kata ( قلوب الناس ) \"hati manusia\" karena hati adalah tempat akal manusia, dan tempatnya iman, dan bisa juga sebagai bentengnya iman, maka bisikan itu tidak dapat menampakkannya, dan tidak pula ia mampu melobanginya. 3 ). { الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ , مِنَ الْجِنَّةِ وَالنَّاسِ } Allah ta'ala menjelaskan macam-macam dari bisikan, bahwasanya bisikan itu ada yang datang dari jin dan manusia; karena sesungguhnya tanpa disadari manusia selalu menyangka bahwa bisikan buruk itu dari syaithon, tetapi hakikatnya itu dari manusia, bahkan dampaknya bisa menjadi perkara yang lebih berbahaya, maka pantaslah manusia memohon perlindungan dari bisiskan-bisikan itu, karena mereka saling berdekatan tetapi dapat membahayak satu sama lain, dan bahwasanya mereka kepada pintuk kesesatan lebih dekat dan lebih mungkin. 4 ). Dalam ayat ini kata \"bisikan\" digantungkan kepada \"dada\", yang merupakan tempatnya hati, yaitu tempatnya akal dan ketaqwaan dan kebaikan dan keburukan, maka beruntunglah setiap hamba yang mampu mensucikan hatinya, yaitu dengan dzikir kepada Allah, dan mentadabburi ayat-ayat Nya, juga ikhlas beribadaha hanya kepada-Nya, serta taubat yang senantiasa diperbaharui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Makhluk yang memberikan kegelisahan itu ada yang berasal dari golongan jin: mereka adalah makhluk yang tersembunyi dan tidak dapat diketahui kecuali oleh Allah SWT. Adapun Setan yang berasal dari golongan jin adalah jin yang jahat. Dia membuat gelisah hati manusia. Makhluk itu juga ada yang berasal dari golongan manusia yang selalu memberi kegelisahan dengan (menyampaikan) hal buruk. Setan yang berasal dari golongan manusia adalah orang yang memamerkan bahwa dirinya adalah penasehat, kemudian dia menyelipkan dalam perkataannya sesuatu yang buruk. Kata “min” bayaniyyah fungsinya untuk menjelaskan makhluk yang menggelisahkan itu, yaitu sesuatu yang tidak dapat dilihat oleh mata."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dari golongan jin dan manusia.”} pembisik itu dari golongan jin dan manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-6. Surat ini mencakup perlindungan diri kepada Rabb manusia, Penguasa dan Sesembahan mereka, dari setan yang merupakan pangkal dan materi dasar segala kejahatan. Di antara fitnah dan kejahatannya adalah bisikan dalam dada manusia. Keburukan dibuat seolah-olah baik untuk mereka dan diperlihatkan dalam bentuk yang indah, menggerakan keinginan mereka agar melakukannya, menghalangi mereka dari kebaikan dan kebaikan di perlihatkan pada mereka dengan wujud lain. Setan selalu berada dalam kondisi seperti itu, membisiki kemudian menunda bisikan bila manusia mengingat Rabbnya dan meminta pertolongan kepadaNya untuk menangkal bisikan tersebut. Maka manusia selayaknya meminta pertolongan dan perlindungan serta berpegangan pada pemeliharaan Allah, karena semua makhluk berada di bawah uluhiyah dan kekuasaanNya, semua ubun-ubun makhluk yang melata berada dalam genggaman Allah, dan di bawah uluhiyahNya yang menjadi tujuan penciptaan makhluk. Karena itu, tidaklah tujuan itu sempurna untuk manusia tanpa menangkal kejahatan musuh mereka yang ingin memutuskan mereka dan menghalangi mereka darinya dan ingin menjadikan mereka sebagai golongannya, agar mereka menjadi penghuni Neraka Sa’ir. Bisikan, sebagaimana berasal dari setan juga bisa berasal dari manusia, karena itu Allah berfirman, “Dari jin dan manusia.” Segala puji bagi Allah semata, Rabb semesta alam, secara permulaan, penutup, lahir dan batin. Kita memohon semoga Allah menyempurnakan nikmatNya, memaafkan dosa-dosa kita yang menghalangi kita dari berbagai berkahNya, semoga Allah mengampuni kesalahan dan keinginan hawa nafsu kita yang melenyapkan renungan ayat-ayat Allah dari hati kita. Kita berharap kepadaNya semoga tidak menghalangi kita dari kebaikan yang ada di sisiNya karena keburukan yang ada pada diri kita, karena sesungguhnya hanya kaum kafir dan orang-orang yang sesatlah yang berputus asa dari rahmat Allah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kegelisahan dan kecemasan yang dirasakan oleh manusia adalah disebabkan oleh syaithon-syaithon jin dan manusia, yakni syaithon-syaithon itu terdiri dari golongan jin yang mereka adalah keturunan iblis dan dari golongan manusia, syaithon manusia. Maka hendaknya setiap orang meminta perlindungan kepada Allah ﷻ dari kejahatan syaithon jin dan syaithon manusia, syaithon-syaithon yang membisikan kejahatan kedalam dada dan hati manusia. Dalam riwayat lain dikatakan : bahwasanya syaithon membisikkan kepada jin dan manusia, karena jin juga dibebankan oleh Allah ﷻ untuk menyembah dan beribadah kepada-Nya, diantara mereka ada yang beriman dan menjalankan perintah Allah ﷻ , dan diantara mereka juga ada yang kafir, juga ada yang fasik, syaithon. Kedua makna dpat dibenarkan, akan tetapi jika ditafsirkan bahwasanya syaithon membisikkan kepada jin, maka makna yang pertama tidak digunakan untuk penafsiran ayat ini, yaitu syaithon dari golongan jin. Tiga surah yang agung ini dan surah Al-fatihah disunnahkan untuk dibaca ketika sesorang melakukan ruqyah untuk mengobati penyakit jin, dan disunnahkan pula dibaca untuk mengobati penyakit 'ain, pada surah Al-Falaq terdapat doa sebagai pelindung dari kejahatan orang-orang yang dengki, dan doa sebagai pelindung dan obat untuk penyakit ain, dan di surah An-Nas terdapat doa sebagai pelindung dari kejahatan bisikan syaithon dan dari kegelisahan yang melalaikan manusia. Oleh karena itu ketika Nabi Muhammad ﷺ ditimba musibah berupa sihir, sihir yang dilakukan oleh seorang yahudi bernama Labid bin Al-A'shom dengan meletakan suatu benda di tempat tertentu, dan dari benda sihir itu berdampak kepada Rasulullah ﷺ , Nabi ﷺ terkena sihir karena sesungguhnya beliu juga manusia yang tertimpa musibah seperti halnya manusia lain, seprti rasa lapar dan sakit, gelisah dan sedih, beliau adalah manusia biasa ﷺ , tatkala Rasulullah ﷺ diketahui terkena sihir dua Malaikat kemudian datang menghampirinya dari langit, dua Malaikat yang diutus oleh Allah - عز وجل - , kedua Malaikat itu membacakan surah Al-Fatihan dan tiga surah ini, dan Rasulullah ﷺ pun sembuh atas izin Allah ﷻ , kemudian kedua Malaikat itu membawa Rasulullah ﷺ ketempat benda sihit tersebut, kemudian Rasulullah ﷺ memusnahkan benda tersebut. Untuk mengobti sihir ada tiga cara yang dapat dilakukan oleh setiap muslim : 1. Dengan ruqyah, dan cara ini adalah yang paling ampuh. 2. Menghilangkan benda yang digunakan penyihir, yaitu dengan cara dibakar atau dimusnahkan. 3. Istigsal atau mandi besar. Tiga hal diatas adalah cara untuk mengobati sihir : Bacaan ruqyah dengan Al-Quran , memusnahkan benda sihir, Istigsal ( Mandi besar ) , dalam hadits Rasulullah ﷺ bersabda : { عَنْ ابْنِ عَبَّاسٍعَنْ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ الْعَيْنُ حَقٌّ وَلَوْ كَانَ شَيْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا } Dari Ibnu Abbas rodhiyallohu anhu, Nabi shollallohu alaihi wa sallam bersabda : “Ain (mata jahat) itu benar-benar adanya, jika seandainya ada sesuatu yang mendahului qodar,maka akan didahului oleh ain.Apabila kamu diminta untuk mandi maka mandilah. (hadist riwayat Muslim) ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مِنَ الْجِنَّةِ وَالنَّاسِ “dari (golongan) jin dan manusia.” Maknanya: Bisikan ini bisa berasal dari jin bisa juga dari anak adam, sedangkan bisikan jin maka ini jelas karena dia mengalir pada anak adam pada aliran darah. Sedangkan bisikan anak ada, maka betapa banyaknya orang-orang yang mendatangi manusia mengajaknya untuk berbuak kejelekkan, mereka menghiasi keburukan itu di dalam hatinya, sampai bisikan itu berdiam di ingatannya lalu ia memikirkannya. Tiga surat terkhir ini: al-Ikhlas, al-Falaq dan an-Nas, apabila Nabi shallallaahu ‘alaihi wa sallam hendak berbaring di tempat tidurnya, beliau meniupkan di telapak tangannya dan mengusap dengannya wajahnya dan anggato tubuhnya yang terjangkau(1), dan juga terkadang beliau membacanya saat sholat lima waktu, maka hendaknya kita berusaha mempraktekkan sunnah dalam membacanya sesuai pada tempatnya, sebagaimana datang dari Nabi shallallaahu ‘alaihi wa sallam. Dengan ini, kita menutup juz terakhir dalam al-Quran, yaitu Juz An-Naba, wallaahu a’lam. Wa shallallaahu ‘alaa nabiyyinaa muhammadin wa ‘alaa aalihi wa shahbihi ajma’iin. (1) Dikeluarkan Bukhari (5018) dari hadits ‘Aisyah radhiyallaahu ‘anha. (2) Dikeluarkan Abu Dawud (1523) dari hadits Uqbah Bin ‘Amir radhiyallaahu ‘anhu, dan dinyatakan shahih oleh Al-Albaniy dalam al-Misykaat (969)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nas ayat 6: Allah menjelaskan bahwa bisikan, banyak yang bersumber dari jin, dan terkadang dari manusia. Dan setan memiliki gaya bahasa yang menakjubkan dalam membisikkan, terkadang datang dengan membisikkan angan-angan atas sesuatu, terkadang datang dengan seolah-olah menasihati / menjadi penasihat. Dan setan akan mendekati manusia dengan segala jalan yang mengantarkannya kepada keberhasilan atas apa yang ia bisikkan. Maka kami berlindung kepada Allah darinya dan dari segala keburukan / pembawa keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisikan jahat yang biasanya sumbernya dari jin, bisa juga dari manusia yang telah menjadi walinya. Selesai tafsir surah An Naas dengan pertolongan Allah, taufiq-Nya dan kemudahan-Nya, wal hamdulillahilladzii bini’matihii tatimmush shaalihaat. Kami berharap kepada Allah agar Dia tidak menghalangi kebaikan yang ada di sisi-Nya karena keburukan yang ada pada diri kami, karena tidak ada yang berputus asa dari rahmat-Nya kecuali orang-orang yang zalim, dan semoga shalawat dan salam terlimpah kepada Nabi Muhammad shallallahu 'alaihi wa sallam, kepada keluarganya dan para sahabatnya semua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nas Ayat 6",
    "description": "4-6. Aku berlindung kepada-Nya dari kejahatan bisikan setan yang bersembunyi pada diri manusia dan selalu bersamanya layaknya darah yang mengalir di dalam tubuhnya, yang membisikkan kejahatan dan kesesatan ke dalam dada manusia dengan cara yang halus, lihai, licik, dan menjanjikan secara terus-menerus. Aku berlindung kepada-Nya dari setan pembisik kejahatan dan kesesatan yang berasal dari golongan jin, yakni makhluk halus yang tercipta dari api, dan juga dari golongan manusia yang telah menjadi budak setan."
  }
]