[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. Allah bersumpah dengan waktu dhuha,dan maksudnya adalah seluruh siang, Allah bersumpah Juga dengan malam yang membuat makhluk tenang dan kegelapannya pekat. Allah bersumpah dengan makhluk yang Dia kehendaki. sedangkan makhluk tidak boleh bersumpah dengan selain khaliknya,karena sumpah dengan selain Allah adalah syirik. Tuhanmu (wahai nabi),tidak meninggalkanmu dan tidak marah kepadamu hanya karena menahan wahyu darimu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah bersumpah dengan permulaan siang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Demi waktu dhuha, yaitu ketika matahari telah meninggi; dan yang dimaksud adalah waktu siang seluruhnya karena Allah menyandingkan waktu dhuha dengan waktu malam dalam ayat 2 (والليل إذا سجى). Kemudian Allah menegaskan sumpah-Nya dengan waktu malam ketika telah datang dan kegelapannya telah menyeluruh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. وَالضُّحَىٰ (Demi waktu matahari sepenggalahan naik) Dhuha adalah sebutan bagi waktu saat matahari mulai naik."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2. Telah turun kepada Nabi cahaya dan ketentraman... Yaitu shalat dhuha dan shalat lail yang keduanya membawa kepada kebahagiaan dan ketentraman di dunia maupun di akhirat, dan keduanya adalah sebaik-baiknya obat untuk menghilangkan kegelisahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Imam Syafi’I RA mengeraskan pengucapan takbir. Sesungguhnya dia mengucapkan (Allahu Akbar) saat membaca surah {Adh-Dhuha} dan akhir setiap surah setelahnya. 1-2. Aku bersumpah demi waktu meningginya matahari di permulaan siang. Sa’id bin Manshur Al-Faryabiy mengatakan dari Jundub yang berkata: “Jibril telah melambatkan Nabi SAW, kemudian orang-orang musyrik berkata:”Sungguh Muhammad telah ditinggalkan”. Dan demi malam yang ditempati manusia untuk istirahat, dan menutupi segala sesuatu dengan kegelapannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi waktu dhuha} Aku bersumpah permulaan siang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah bersumpah dengan siang bila cahayanya mulai tersebar, yaitu waktu dhuha, dan juga dengan malam, “apabila telah sunyi,” dan gelap gulita, atas perhatian Allah terhadap RasulNya seraya berfirman, “Rabbmu tiada meninggalkan kamu,” yakni tidak meninggalkanmu sejak Dia memperhatikanmu dan tidak menelantarkanmu sejak memelihara dan merawatmu, tapi Dia senantiasa mendidikmu dengan pendidikan yang paling sempurna dan mengangkatmu satu derajat demi satu derajat, “dan tiada (pula) benci kepadamu,”maksudnya Allah tidaklah membencimu, sejak Dia mencintaimu, karena menafikan kebaikan sesuatu menunjukkan penegasan atas kebalikannya. Penafian semata bukanlah pujian kecuali bila penafian tersebut mengandung penegasan kesempurnaan. Inilah keadaan Rasulullah sebelum dan sesudahnya, yaitu kondisi yang paling sempurna. Kecintaan Allah padanya serta terus berlalunya cinta itu, senantiasa naiknya derajat kesempurnaan Rasulullah dan perhatian Allah pada beliau."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dalam surah ini Allah ﷻ menjelaskan bagaimana Dia menganugerahkan kepada Nabi-Nya ﷺ begitu banyak pemberian, pemberian yang merupakan kebaikan-kebaikan didunia dan kebaikan yang berlipat banyaknya di akhirat, karena beliau ﷺ adalah ciptaan Allah ﷻ yang paling mulia, dan dialah tuannya para anak adam pada hari kiamat, sebagaimana yang beliau sabdakan dalam sebuah hadits : (( أنا سيد ولد آدم يوم القيامة وأول من ينشق عنه القبر وأول شافع وأول مشفع )) “Aku adalah penghulu ( pemimpin ) anak Adam pada hari kiamat, yang pertama dibangkitan dari kubur, yang pertama memberi syafa’at dan yang pertama diterima syafa’atnya.” [ Diriwayatkan oleh Imam Muslim : 2278 , dari hadits Abu Hurairah -Radhiyallahu 'anhu- ] , dengan kemuliaan yang dimiliki oleh beliau Allah ﷻ bersumpah dengan : { وَالضُّحَىٰ , وَاللَّيْلِ إِذَا سَجَىٰ } , walaupun sebenarnya tanpa adanya sumpah yang dikhusus untuk Nabi ﷺ kemuliaan beliau tetaplah yang paling tinggi diantara makhluk lainnya, akan tetapi wujud sumpah ini untuk lebih meninggikan derajat kemuliaan Nabi ﷺ . Allah ﷻ berfirman : { وَالضُّحَىٰ } Demi waktu dhuha Dan maksudnya adalah cahaya yang muncul pada siang hari."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَالضُّحَى \"Demi waktu dhuha\" Adh-Dhuha adalah waktu awal siang hari, pada waktu tersebut ada sinar dan cahaya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 1: 1-2. Allah memulai surat ini dengan masalah keimanan. Allah berkata : Bersumpahlah wahai Nabi Allah dengan waktu dhuha dan ia adalah awal waktu siang, ketika naik matahari, dan dengan malam jika telah gelap gulita malamnya dan tertutupi segala sesuatu yang nampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Jundub bin Sufyan ia berkata: Rasulullah shallallahu 'alaihi wa sallam pernah sakit sehingga tidak bangun selama dua atau tiga malam, lalu ada seorang wanita yang datang berkata, “Wahai Muhammad, sesungguhnya aku berharap setanmu telah meninggalkanmu, karena aku tidak melihat dia mendekatimu sejak dua atau tiga malam.” Maka Allah ‘Azza wa Jalla berfirman, “Wadh dhuhaa—Wallaili idzaa sajaa—Maa wadda’aka Rabbuka wamaa qalaa.” (Hadits ini diriwayatkan pula oleh Muslim, Tirmidzi, dan ia berkata, “Hadits ini hasan shahih,” Ahmad, Thayalisi, Ibnu Jarir, Al Humaidiy, dan Al Khathiib dalam Muwadhdhih Awhaamil Jam’i wat Tafriiq juz 2 hal. 22). Allah Subhaanahu wa Ta'aala bersumpah dengan waktu dhuha dan waktu malam ketika telah sunyi untuk menerangkan perhatian Dia kepada Rasul-Nya shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 1",
    "description": "Demi waktu duha ketika matahari naik sepenggalah, atau demi waktu siang seluruhnya. Penyebutan waktu duha mengisyaratkan bahwa tenggang waktu ketika nabi tidak menerima wahyu beberapa lama bagaikan malam yang gelap, sedangkan turunnya surah ini setelah itu bagaikan fajar yang menyingsing. 2. Dan demi malam apabila telah sunyi dan gelap. Ketika matahari bergeser ke tempat lain, belahan bumi yang ditinggalkannya beranjak tenang dan gelap, menjadi waktu yang tepat untuk istirahat."
  }
]