[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-11. Jangan memperlakukan anak yatim dengan buruk. Jangan menghardik orang yang meminta-minta, sebaliknya berilah dia makan, dan penuhilah hajatnya. Untuk nikmat tuhanmu yang telah Dia limpahkan kepadamu,maka bicarakanlah hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan janganlah engkau menghardik orang butuh yang meminta kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Dan terhadap orang yang meminta bantuan dan sedekah, janganlah kamu mencacinya; namun berilah dia bantuan atau tolaklah dia dengan lembut dan sopan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَأَمَّا السَّآئِلَ فَلَا تَنْهَرْ (Dan terhadap orang yang minta-minta, janganlah kamu menghardiknya) Yakni janganlah kamu mengusirnya jika ia meminta kepadamu, karena kamu dulunya juga orang yang miskin. Berilah ia, atau tolaklah dengan halus."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Seorang pengemis merasa hatinya telah hancur dengan kemiskinan yang ia alami dan rendahnya perilaku meminta-minta, maka jika engkau menghadapinya dengan sikap dan muamalat yang buruk, perasaan yang ia alami akan semakin memburuk, oleh karena itu sekalipun Anda tidak dapat memberikan sesuatu dari harta yang anda miliki, maka setidaknya anda dapat menerima mereka dengan sikap yang indah. 2 ) . Berapa banyak kebaikan yang kita lewatkan ketika makna suatu kalimat kita khususkan hanya kepada satu titik saja, salah satu contohnya adalah ayat ini yang berbicara tentang peminta-minta, jikalau makna peminta-minta disini hanya di tujukan kepada mereka yang meminta-minta harta, sedangkan makna lain dari kata itu akan jauh lebih besar dan lebih mencakup, dan makna yang paling besar dari kata meminta-minta itu adalah dalam ilmu dan permasalahan agama, maka apakah para mufti dan mu'alim memahami bahwasanya ayat ini bertuju kepada mereka ? oleh karena itu hendaklah mereka bersikap ramah kepada para peminta-minta, dengan maksud ketaatan kepada perintah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Sejak Allah memberikan kepadamu (Muhammad) kenikmatan-kenikmatan ini, Dia memberimu wasiat-wasiat berikut: “Adapun kepada anak yatim maka jangan merendahkan dan melemahkannya dengan mengambil hartanya atau merugikannya dan hal-hal lain yang serupa, namun berilah dia haknya sebagai pengingat keyatimanmu. Adapun kepada orang yang meminta harta benda atau keilmuan, maka berilah dia atau ajarilah dia dan janganlah mencacinya karena kefakirannya, sesungguhnya dulu nengkau juga dalam keadaan fakir, maka berilah dia makan dan sambutlah dia dengan sambutan yang indah”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Terhadap orang yang meminta-minta, janganlah menghardik} janganlah mencaci"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-11. Karena itu Allah berfirman, “Adapun terhadap anak yatim, maka janganlah kamu berlaku sewenang-wenang,” yakni, jangan memperlakukan anak yatim dengan buruk, jangan merasa tertekan karenanya dan jangan membentaknya tapi muliakanlah, berikan semampumu dan perlakukanlah dia sebagaimana kau ingin anakmu diperlakukan serupa sepeninggalmu. “Dan terhadap orang yang meminta-minta, maka janganlah kamu menghardiknya,” yakni jangan sampai kau mengeluarkan kata untuk menolak permintaan orang yang meminta-minta berupa hardikan dan perangai buruk. Tapi berikanlah semampumu atau tolaklah dengan cara yang baik. Termasuk dalam hal ini adalah orang yang meminta-minta uang dan ilmu. Karena itu, seorang guru diperintahkan untuk berakhlak baik terhadap murid, memperlakukan murid dengan memuliakan dan sayang, karena hal itu bisa menjadi penolong bagi murid untuk mencapai maksudnya dan sebagai tindakan memuliakan bagi orang yang ingin memberi manfaat pada sesama manusia dan negara. “Dan terhadap nikmat Rabbmu maka hendaklah kamu menyebut-nyebutnya (dengan bersyukur),” ini mencakup nikmat-nikmat agama dan dunia. Yaitu pujilah Allah karena nikmat-nikmat itu dan sebutlah secara khusus jika memang hal itu ada maslahatnya. Bila tidak, sebutkan nikmat Allah secara mutlak (umum) karena menyebut-nyebut nikmat Allah bisa mendorong seseorang untuk mensyukurinya dan menimbulkan kesenangan bagi Yang memberi nikmat; karena hati memiliki tabiat mencintai orang yang berbuat baik padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَأَمَّا السَّائِلَ } Dan kepada orang yang meminta kepadamu kebutuhan hidupnya karena kemisikinan { فَلَا تَنْهَرْ } janganlah kamu menghardiknya, tapi berbuat baiklah kepadanya, karena sesungguhnya pada hartamu itu ada hak untuk mereka yang membutuhkan sekalipun ia datang dengan menunggang kuda, sebagaimana yang disabdakan dalam sebuah hadits : (( للسائل حق وإن جاء على فرس )) \" Bagi orang yang meminta ada hak walau dia datang dgn menunggang kuda. \" [ Hadits lemah Diriwayatkan oleh Abu Dawud : 1665 , dari hadits Husain bin Ali ] , dan Allah juga berfirman : { وَفِي أَمْوَالِهِمْ حَقٌّ لِلسَّائِلِ وَالْمَحْرُومِ } ( Dan pada harta-harta mereka ada hak untuk orang miskin yang meminta dan orang miskin yang tidak mendapat bagian. ) [ Az-Zariyat : 19 ] , dan apabila sesorang tidak mampu untuk memberikan sesuatu maka perkataan baik dan lemah lembut cukup baginya, bukan justru mencela perbuatan orang tersebut, Dalam riwayat lain dikatan : bahwa yang yang dimaksud dengan orang yang meminta di ayat ini adalah orang yang meminta ilmu, oran yang bertanya kepada Rasulullah tentang perkara-perkara yang membingungkannya, dan ayat ini menunjukkan keumuman makna, dan dapat diartikan dengan kedua makna diatas."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ \" Dan terhadap orang yang bertanya-tanya maka janganlah kamu menghardiknya.\" Ini adalah timbal bailik dari وَوَجَدَكَ ضَالًّا فَهَدَى \" Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.\" وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ \" Dan terhadap orang yang bertanya-tanya maka janganlah kamu menghardiknya.\" Yang paling pertama masuk dalam golongan yang bertanya, adalah yang bertanya tentang syari'at, tentang ilmu, jangan engkau menghardiknya, karena jika ia bertanya, dia ingin mendapatkan penjelasan tentang syari'at darimu, wajib bagimu menjelaskannya, sebagaiman dalam firman Allah Tabaaraka Wa Ta'ala: وَإِذْ أَخَذَ اللَّهُ مِيثَاقَ الَّذِينَ أُوتُوا الْكِتَابَ لَتُبَيِّنُنَّهُ لِلنَّاسِ وَلَا تَكْتُمُونَهُ \" Dan (ingatlah), ketika Allah mengambil janji dari orang-orang yang telah diberi kitab (yaitu): \"Hendaklah kamu menerangkan isi kitab itu kepada manusia, dan jangan kamu menyembunyikannya. \"(Ali Imran: 187) Jangan engkau menhardiknya karena hardikan akan membuatnya lari, kemudian jika engkau menghardiknya sedangkan dia meyakini engkau lebih mulia darinya, karena tidak ada orang yang benar-benar bertanya kecuali ia meyakini bahwa yang ditanya lebih tinggi, jika engkau menhardiknya sedangkan ia meresa engkau lebih tinggi dari mu ia akan merasa takut, dan perasaannya akan berubah, bahkan dia tidak paham pertanyaannya sendiri dan dia tidak paham terhadap jawaban dari mu. Berkacalah kepada dirimu, jika anda berbicara dengan orang yang lebih besar kedudukannya dari mu, kemudian ia menghardikmu, pasti perasaanmu akan hilang, anda tidak akan mampu menata fikiran dan akalmu, oleh karenanya janganlah menghardik yang bertanya. Bisa dimasukkan juga orang yang meminta harta, yakni jika ada ada orang yang datang kepadamu meminta harta maka janganlah hardik dia, ini adalah umum yang masuk dalam pengkhususan: Jika anda tahu bahwa sang penanya tentang ilmu bermaksud ta'annut (memojokkan), mengambil pendapat mu dan mengambil pendapat fulan dan fulan, sehingga membenturkan pendapat-pendapat para ulama, jika anda tahu demikian maka anda berhak menghardiknya, karena hardikan disini adalah sebagai teguran baginya. Begitu juga yang meminta-minta harta jika anda tahu bahwa dia adalah orang kaya, anda boleh menghardiknya, anda berhak juga mencela perbuatannya, sedangkan dia adalah orang kaya, dengan begitu keumuman ayat ini السَّائِلَ فَلَا تَنْهَرْ \" dapat dikhususkan (dikecualikan) jika ada kemaslahatan dalam menghardik, ini tidak mengapa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 10: Janganlah engkau menghardik orang yang meminta-minta (pengemis) yang meminta karena butuh dan faqir. Berkata Syaikh Ibnu Utsaimin pada pelajaran subuh tanggal 28/3/1418 : Orang yang meminta pada firman Allah وَأَمَّا ٱلسَّآئِلَ فَلَا تَنْهَر mengandung makna orang yang meminta dalam kondisi faqir dan orang yang meminta dalam masalah keilmuan dan orang yang meminta karena sebab meminjam, kemudian beliau berkata : Makna (dalam ayat ini) dibawa kepada makna secara keseluruhan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jangan sampai keluar dari mulutmu ucapan yang mengandung penolakan terhadap permintaannya dengan bentakan dan sikap yang buruk, bahkan berikanlah kepadanya apa yang mudah bagimu atau tolaklah dengan cara yang baik dan ihsan. Kata saa’il (meminta) di sini menurut Syaikh As Sa’diy, termasuk pula yang meminta harta dan yang meminta ilmu. Oleh karena itu, pengajar diperintahkan berakhlak mulia kepada penuntut ilmu, memuliakannya dan menaruh rasa kasihan kepadanya, karena yang demikian dapat membantu maksudnya serta memuliakan orang yang berniat menyebarkan manfaat bagi hamba dan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 10",
    "description": "Dan berbuat baiklah terhadap orang yang meminta-minta, baik meminta ilmu pengetahuan atau harta, dan janganlah engkau menghardiknya. Berilah mereka apa yang engkau mampu atau tolaklah dengan halus dan ramah. 11. Dan terhadap nikmat tuhanmu hendaklah engkau nyatakan dengan dibarengi rasa bersyukur. Allah telah memberimu nikmat yang tiada tara, seperti nikmat kenabian dan turunnya Al-Qur'an kepadamu. Sampaikan dan perlihatkanlah nikmat-nikmat Allah itu kepada orang lain sebagai bentuk rasa syukurmu kepada-Nya."
  }
]