[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-11. Jangan memperlakukan anak yatim dengan buruk. Jangan menghardik orang yang meminta-minta, sebaliknya berilah dia makan, dan penuhilah hajatnya. Untuk nikmat tuhanmu yang telah Dia limpahkan kepadamu,maka bicarakanlah hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Syukurilah nikmat-nikmat Allah yang diberikan kepadamu dan bicarakan tentang hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah memerintahkan Nabi-Nya untuk menampakkan dan menyampaikan kenikmatan-kenikmatan Allah baginya kepada orang lain. Kenikmatan-kenikmatan ini sangat banyak; di antaranya kemuliaan kenabian dan menjadi Rasul yang wajib ditaati dan wajib disyukuri. Dan perintah dari Allah ini ditujukan bagi Nabi Muhammad dan umatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ (Dan terhadap nikmat Tuhanmu, maka hendaklah kamu siarkan) Allah memerintahkan untuk menceritakan kepada orang lain kenikmatan-kenikmatan yang dia dapatkan dari Allah, dan ini adalah salah satu bentuk rasa syukur. Pendapat lain mengatakan: yang dimaksud dengan kenikmatan di sini adalah al-Qur’an, sehingga Allah memerintahkannya untuk membacakan dan menyampaikannya kepada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Adapun terhadap nikmat Tuhanmu yang berupa risalah kenabian dan lain-lain, maka kabarkanlah itu kepada manusia dan bersyukurlah kepada Allah atas hal itu, karena memperbincangkan nikmat Allah adalah bentuk syukur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Terhadap nikmat Tuhanmu, maka nyatakanlah}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-11. Karena itu Allah berfirman, “Adapun terhadap anak yatim, maka janganlah kamu berlaku sewenang-wenang,” yakni, jangan memperlakukan anak yatim dengan buruk, jangan merasa tertekan karenanya dan jangan membentaknya tapi muliakanlah, berikan semampumu dan perlakukanlah dia sebagaimana kau ingin anakmu diperlakukan serupa sepeninggalmu. “Dan terhadap orang yang meminta-minta, maka janganlah kamu menghardiknya,” yakni jangan sampai kau mengeluarkan kata untuk menolak permintaan orang yang meminta-minta berupa hardikan dan perangai buruk. Tapi berikanlah semampumu atau tolaklah dengan cara yang baik. Termasuk dalam hal ini adalah orang yang meminta-minta uang dan ilmu. Karena itu, seorang guru diperintahkan untuk berakhlak baik terhadap murid, memperlakukan murid dengan memuliakan dan sayang, karena hal itu bisa menjadi penolong bagi murid untuk mencapai maksudnya dan sebagai tindakan memuliakan bagi orang yang ingin memberi manfaat pada sesama manusia dan negara. “Dan terhadap nikmat Rabbmu maka hendaklah kamu menyebut-nyebutnya (dengan bersyukur),” ini mencakup nikmat-nikmat agama dan dunia. Yaitu pujilah Allah karena nikmat-nikmat itu dan sebutlah secara khusus jika memang hal itu ada maslahatnya. Bila tidak, sebutkan nikmat Allah secara mutlak (umum) karena menyebut-nyebut nikmat Allah bisa mendorong seseorang untuk mensyukurinya dan menimbulkan kesenangan bagi Yang memberi nikmat; karena hati memiliki tabiat mencintai orang yang berbuat baik padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَأَمَّا بِنِعْمَةِ رَبِّكَ } Dan dengan nikmat tuhanmu itu { فَحَدِّثْ } berbicaralah dengan lisanmu tentangnya, karena hal itu merupakan bentuk rasa syukur kepada Allah ﷻ atas nikmat-Nya, dan diantara cara mensyukuri nikmat Allah ﷻ dengan pengakuan dalam hati serta menginfakkan sebagian dari harta tersebut pada kebaikan dan ketaatan kepada Allah ﷻ . Dan rukun syukur itu ada tiga : Rukun pertama : Membicarakannya secara terang-terangan. Rukun kedua : pengakuan dalam hati. Rukun ketiga : menginfakkannya untuk ketaatan kepada Allah ﷻ. Itulah tiga rukun syukur yang perlu bagi setiap muslim untuk menunaikannya, jika semuanya dapat dilakukan maka syukur itu telah terwujudkan, akan tetapi jika ada rukun yang belum ditunaikan maka rasa syukur itu kurang, oleh karena itu perlu adanya perhatian penuh dalam mensyukuri nikmat Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَمَّا بِنِعْمَةِ رَبِّكَ فَحَدِّثْ \" Dan terhadap nikmat Tuhanmu maka hendaklah kamu menyebut-nyebutnya (dengan bersyukur).\"kenikmatan dari Allah Ta'ala kepada Rasul shallallaahu 'alaihi wa salla yang disebutkan pada ayat-ayat ini ada tiga وَوَجَدَكَ عَائِلًا فَأَغْنَى (8) فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ (9) وَأَمَّا السَّائِلَ فَلَا تَنْهَرْ \" Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu. Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.. Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan.\" Dengan tiga hal ini, kenikmatan-kenikmatan sempurna, ungkapkanlah nikmat Allah, katakanlah: dahulu aku yatim kemudian Allah melindungiku, dulu aku sesat lau Allah memberiku petunjuk, dulu aku miskin sekarang Allah memberi kecukupan, tetapi ungkapkalah dalam rangka menampaknya nikmat dari Allah dan bersyukur kepada-Nya, tidak bermaksud berbangga-bangga di hadapan manusia, karena jika ini dilakukan dalam rangka berbangga di hadapan orang-orang ini adalah perbuatan tercela, namun jika anda mengungkapkannya dalam rangka mengungkapkan dan mensyukuri nikmat-nikmat dari Allah, maka ini adalah di antara perkara yang diperintahkan Allah. Demikianlah kata-kata singkat tentang surat yang agung ini, dan apa apa yang kita katakan juga yang dikatakan oleh ulama lainnya tidak bisa meliputi seluruh makna-makan yang agung yang ditunjukkan oleh al-Quran. Kita memohon kepada Allah agar diberikan pemahaman terhadap agama Allah, dan amalan dari yang telah kita ketahui, Sesungguhnya Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 11: Kemudian Allah memerintahkan untuk menampakkan kenikmatan yang diberikan oleh Allah dan menyebarkannya kepada manusia dan menyiarkan diantara mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik nikmat agama maupun nikmat dunia. Yakni pujilah Allah terhadapnya dan sebutlah nikmat itu jika ada maslahatnya. Hal itu, karena menyebut-nyebut nikmat Allah dapat membantu untuk bersyukur, membuat hati mencintai yang memberikannya, yaitu Allah Subhaanahu wa Ta'aala, karena hati itu dijadikan cinta kepada yang berbuat baik kepadanya. Rasulullah shallallahu 'alaihi wa sallam bersabda: اَلتَّحَدُّثُ بِنِعْمَةِ اللهِ شُكْرٌ وَ تَرْكُهَا كُفْرٌ وَ مَنْ لاَ يَشْكُرُ الْقَلِيْلَ لاَ يَشْكُرُ الْكَثِيْرَ وَ مَنْ لاَ يَشْكُرُ النَّاسَ لاَ يَشْكُرُ اللهَ وَ الْجَمَاعَةُ بَرَكَةٌ وَ الْفُرْقَةُ عَذَابٌ “Menyebut-nyebut nikmat Allah adalah bersyukur, meninggalkannya adalah kufur. Barang siapa tidak bersyukur terhadap yang sedikit, maka dia tidak akan bersyukur kepada yang banyak. Barang siapa yang tidak bersyukur kepada manusia, maka dia tidak akan bersyukur kepada Allah. Berjamaah adalah berkah, sedangkan berpecah adalah azab.” (HR. Baihaqi dalam Asy Syu’ab, dihasankan oleh Syaikh Al Albani dalam Shahihul Jaami’ no. 3014)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 11",
    "description": "Dan terhadap nikmat tuhanmu hendaklah engkau nyatakan dengan dibarengi rasa bersyukur. Allah telah memberimu nikmat yang tiada tara, seperti nikmat kenabian dan turunnya Al-Qur'an kepadamu. Sampaikan dan perlihatkanlah nikmat-nikmat Allah itu kepada orang lain sebagai bentuk rasa syukurmu kepada-Nya. 1-4. Wahai nabi, bukankah kami telah melapangkan dadamu' kami telah menjadikanmu seorang nabi yang menerima syariat agama, berakhlak mulia, berwawasan luas, santun, dan sabar dalam menghadapi kepahitan hidup. Dan kami pun telah menurunkan bebanmu darimu, yang memberatkan punggungmu' kami jadikan tugasmu yang sejatinya berat, seperti menyampaikan risalah dan mendakwahkan syariat, terasa ringan. Dan kami pun telah tinggikan sebutan namamu bagimu. Kami sebut namamu secara berurutan dengan nama-ku, seperti dalam syahadat, azan, tasyahud, dan sebagainya. Itu adalah kemu'liaan tersendiri yang tidak kami berikan kepada nabi-nabi yang lain."
  }
]