[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. Allah bersumpah dengan waktu dhuha,dan maksudnya adalah seluruh siang, Allah bersumpah Juga dengan malam yang membuat makhluk tenang dan kegelapannya pekat. Allah bersumpah dengan makhluk yang Dia kehendaki. sedangkan makhluk tidak boleh bersumpah dengan selain khaliknya,karena sumpah dengan selain Allah adalah syirik. Tuhanmu (wahai nabi),tidak meninggalkanmu dan tidak marah kepadamu hanya karena menahan wahyu darimu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan bersumpah dengan malam hari apabila telah gelap dan manusia mulai tenang pada malam itu dari segala aktivitas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَالَّيْلِ إِذَا سَجَىٰ (dan demi malam apabila telah sunyi (gelap)) Al-Ashma’i mengatakan: makna (سجو الليل) yakni jika malam telah menutupi siang; seperti seseorang yang ditutupi pakaian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2. Telah turun kepada Nabi cahaya dan ketentraman... Yaitu shalat dhuha dan shalat lail yang keduanya membawa kepada kebahagiaan dan ketentraman di dunia maupun di akhirat, dan keduanya adalah sebaik-baiknya obat untuk menghilangkan kegelisahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1-2. Aku bersumpah demi waktu meningginya matahari di permulaan siang. Sa’id bin Manshur Al-Faryabiy mengatakan dari Jundub yang berkata: “Jibril telah melambatkan Nabi SAW, kemudian orang-orang musyrik berkata:”Sungguh Muhammad telah ditinggalkan”. Dan demi malam yang ditempati manusia untuk istirahat, dan menutupi segala sesuatu dengan kegelapannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan demi waktu malam apabila telah sunyi} dan demi waktu malam apabila ciptaan berada padanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah bersumpah dengan siang bila cahayanya mulai tersebar, yaitu waktu dhuha, dan juga dengan malam, “apabila telah sunyi,” dan gelap gulita, atas perhatian Allah terhadap RasulNya seraya berfirman, “Rabbmu tiada meninggalkan kamu,” yakni tidak meninggalkanmu sejak Dia memperhatikanmu dan tidak menelantarkanmu sejak memelihara dan merawatmu, tapi Dia senantiasa mendidikmu dengan pendidikan yang paling sempurna dan mengangkatmu satu derajat demi satu derajat, “dan tiada (pula) benci kepadamu,”maksudnya Allah tidaklah membencimu, sejak Dia mencintaimu, karena menafikan kebaikan sesuatu menunjukkan penegasan atas kebalikannya. Penafian semata bukanlah pujian kecuali bila penafian tersebut mengandung penegasan kesempurnaan. Inilah keadaan Rasulullah sebelum dan sesudahnya, yaitu kondisi yang paling sempurna. Kecintaan Allah padanya serta terus berlalunya cinta itu, senantiasa naiknya derajat kesempurnaan Rasulullah dan perhatian Allah pada beliau."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَاللَّيْلِ } Dan demi malam { إِذَا سَجَىٰ } yang ketika ia tiba tenanglah segala sesuatu didalamnya, Allah menjadikan malam sebagai waktu kembali semua makhluk kepada tempat istirahatnya. Dan dikatakan bahwa { إِذَا سَجَىٰ } : ketika malam menjadi gelap dan menutupi segala sesuatu dengan kegelapannya itu, dua kejaiban ini adalah ayat-ayat Allah ﷻ : cahaya disiang hari. dan kegelapan dimalam hari Allah ﷻ ciptakan untuk kemaslahatan hamba-Nya, agar mereka menjadi tenang dimalam hari, dan berusaha disian hai dengan kewajibannya masing-masing dalam mencari nafkah, itulah salah satu nikmat Allah ﷻ yang paling besar, Dia ﷻ menjadikan malam itu terus berkepanjangan, dan tidak pula Ia menjadikan siang itu berkepanjangan, tetapi Allah ﷻ dengan segala kuasa-Nya menjadikan siang dan malam muncul secara bergantian, sepanjang kehidupan didunia berjalan. Dan diantara keistimewaan malam hari adalah sebagai tempat dan waktu yang dikhususkan bagi orang-orang beriman untuk menghidupkan malam dengan memperbanyak shalat tahajjud."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَاللَّيْلِ إِذَا سَجَى \" dan demi malam apabila telah sunyi, \" Maknanya: Apabila malam telah menutupi bumi dan meliputinya dengan kegelapannya, Allah bersumpah dengan dua perkata yang bertolak belakan, pertama: dengan waktu dhuha, apabila telah menyebar dan memenuhi bumi dengan sinar dan cahaya, yang kedua: dengan malam apabila telah meliputinya dengan kegelapan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 2: 1-2. Allah memulai surat ini dengan masalah keimanan. Allah berkata : Bersumpahlah wahai Nabi Allah dengan waktu dhuha dan ia adalah awal waktu siang, ketika naik matahari, dan dengan malam jika telah gelap gulita malamnya dan tertutupi segala sesuatu yang nampak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 2",
    "description": "Dan demi malam apabila telah sunyi dan gelap. Ketika matahari bergeser ke tempat lain, belahan bumi yang ditinggalkannya beranjak tenang dan gelap, menjadi waktu yang tepat untuk istirahat. 3. Wahai nabi, tidak adanya wahyu yang turun kepadamu dalam beberapa hari ini bukan karena Allah membencimu. Tuhanmu yang telah memilihmu sebagai nabi dan rasul tidak akan meninggalkan engkau sendirian dalam menyampaikan risalah dan tidak pula membencimu."
  }
]