[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-3. Allah bersumpah dengan waktu dhuha,dan maksudnya adalah seluruh siang, Allah bersumpah Juga dengan malam yang membuat makhluk tenang dan kegelapannya pekat. Allah bersumpah dengan makhluk yang Dia kehendaki. sedangkan makhluk tidak boleh bersumpah dengan selain khaliknya,karena sumpah dengan selain Allah adalah syirik. Tuhanmu (wahai nabi),tidak meninggalkanmu dan tidak marah kepadamu hanya karena menahan wahyu darimu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Rabbmu -wahai Rasul- tidak akan meninggalkanmu dan tidak pula memurkaimu sebagaimana ucapan orang-orang musyrik tatkala wahyu terputus darimu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Kemudian disebutkan isi dari sumpah bahwa wahyu yang diturunkan kepadamu tidak terhenti hai Rasulullah; dan Allah belum menghentikan penurunan ayat-ayat-Nya kepadamu. Dan Tuhanmu tidaklah sedang murka kepadamu ketika wahyu tidak turun beberapa waktu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. مَا وَدَّعَكَ رَبُّكَ (Tuhanmu tiada meninggalkan kamu) Yakni tidak memutus hubungan denganmu, dan wahyu juga belum terputus darimu. وَمَا قَلَىٰ( dan tiada (pula) benci kepadamu) Yakni tidak murka terhadapmu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pada suatu ketika nabi bersedih disebabkan wahyu terhenti turun kepadanya selama dua atau tiga hari, karena sesungguhnya al-Qur'an adalah bekal bagi nabi disetiap perjalanan panjangnya, dan cahaya baginya di segala kegelapan, kemudian Allah segera menurunkan wahyu untuk menenangkan kesedihan beliau : { مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ } , maka sungguh menakjubkan orang yang meninggalkan al-Qur'an dan menjauh darinya selama berhari-hari dengan alasan sibuk dengan pekerjaan ! begitu penting kah pekerjaanmu sehingga engkau tidak memberi ruang bagi dirimu bersama al-Qur'an ?!!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dan Tuhanmu tidak meninggalkanmu, tidak memotong hubungan denganmu, tidak mengabaikanmu dan tidak murka denganmu. Itu adalah jawaban dari qasam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhanmu tidak meninggalkanmu} tidak meninggalkanmu {dan tidak pula membencimu} tidak murka kepadamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. Allah bersumpah dengan siang bila cahayanya mulai tersebar, yaitu waktu dhuha, dan juga dengan malam, “apabila telah sunyi,” dan gelap gulita, atas perhatian Allah terhadap RasulNya seraya berfirman, “Rabbmu tiada meninggalkan kamu,” yakni tidak meninggalkanmu sejak Dia memperhatikanmu dan tidak menelantarkanmu sejak memelihara dan merawatmu, tapi Dia senantiasa mendidikmu dengan pendidikan yang paling sempurna dan mengangkatmu satu derajat demi satu derajat, “dan tiada (pula) benci kepadamu,”maksudnya Allah tidaklah membencimu, sejak Dia mencintaimu, karena menafikan kebaikan sesuatu menunjukkan penegasan atas kebalikannya. Penafian semata bukanlah pujian kecuali bila penafian tersebut mengandung penegasan kesempurnaan. Inilah keadaan Rasulullah sebelum dan sesudahnya, yaitu kondisi yang paling sempurna. Kecintaan Allah padanya serta terus berlalunya cinta itu, senantiasa naiknya derajat kesempurnaan Rasulullah dan perhatian Allah pada beliau."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ مَا وَدَّعَكَ رَبُّكَ } Tuhanmu tidak meninggalkanmu wahai Muhammad, { وَمَا قَلَىٰ } dan tidak pula benci kepadamu, ayat ini turun ketika wahyu dari Allah terhenti untuk beberapa saat kepada Rasulullah ﷺ , dan Jibril juga tak kunjung datang menghamiri beliau sampai akhirnya Rasulullah ﷺ merasa gundah dengan keadaan yang beliau hadapi saat itu, dan saat itulah para kaum kuffar berkata kepada Rasulullah ﷺ : wahai Muhammad sesungguhnya tuhanmu telah berhenti memperhatikanmu dan menyayangimu, bahkan sebagian dari merka ada yang mengatakan : kami tidak melihat syaithonmu melainkan telah meninggalkanmu wahai Muhammad, mereka menyebut apa yang datang kepada Nabi Muhammad ﷻ dari wahyu adalah syaithon, maka Rasulullah ﷺ pun merasa sempit hatinya dan galau, yang diragukan oleh beliau bukanlah Tuhanya melainkan perkataan para kaum Kuffar lah yang membuatnya gelisah. Hingga akhirnya Allah ﷻ menyemangati Rasul-Nya dengan menurunkan ayat ini { مَا وَدَّعَكَ رَبُّكَ } Tuhanmu tidak meninggalanmu wahai Muhammad, seperti yang dikatakan oleh orang-orang kafir { وَمَا قَلَىٰ } dan tidak pula membencimu, ayat ini turun sebagai pembantah terhadap perkataan kaum kuffar kepada Nabi Muhammad ﷺ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مَا وَدَّعَكَ رَبُّكَ \" Tuhanmu tiada meninggalkan kamu \" Maknanya: Tidak membiarkan dan meneantarkanmu وَمَا قَلَى \" dan tiada (pula) benci kepadamu,\" Makanya: Tidak memurkaimu, bahkan belia adalah makhluk yang paling Allah cintai (sebatas pengetahuan kita), Muhammad shallallahu 'alaihi wa sallam. Oleh karenya Allah memilihnya untuk mengemban risalah terbesar, kepada umat terbaik, dan menjadikannya penutup para nabi. Maka tidak ada nabi setelahnya shallallaahu 'alaihi wa sallam. Rasulullaah shallallahu a'alaihi wa sallam adalah salah satu dari dua Khalil (kekasih)-Nya yang mendapatkan keistimewaan dengan kriteria ini yaitu khullah (kakasih), khullah adalah tingkat kecintaan tertinggi, dan tidak ada pada hamba-hamba Allah sebatas pengetahuan kami yang menjadi Khalil Allah selain Ibrahim dan Muhammad 'alaihimassholatu wassalaam, sebagaimana Nabi shallallaahu 'alaihi wa sallam bersabda: إِنَّ الله اتَّخَنِي خَلِيْلًا كَماَ اتَّخَذَ إِبْرَاهِيْمَ خَلِيْلًا \"Sesungguhnya Allah telah menjadikanku kekasih sebagaimana Ibrahim pun telah dijadikan kekasih\" (1) Allah 'Azza Wajalla berkata kepada Nabi-Nya shallallaahu 'alaihi wa sallam: وَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا \" Dan bersabarlah dalam menunggu ketetapan Tuhanmu, maka sesungguhnya kamu berada dalam penglihatan (mata) Kami, \"(Ath-Thur: 48) Mata Allah Ta'ala melindung, mengawasi dan menjaganya, dialah yang Allah berkata kedanya shallallaahu 'alaihi wa sallam : الَّذِي يَرَاكَ حِينَ تَقُومُ (218) وَتَقَلُّبَكَ فِي السَّاجِدِينَ \" Yang melihat kamu ketika kamu berdiri (untuk sembahyang), dan (melihat pula) perubahan gerak badanmu di antara orang-orang yang sujud. \"(QS. Asy-Syu'ara: 218-219) Allah 'Azza wa Jalla tidak membiarkan rasulullah shallallahu 'alaihi wa sallam, tetapi Allah meliputinya dengan ilmu, kasih saying dan perhatian-Nya dan lainnya yang menunjukkan tingginya kedudukan beliau di dunia dan akhirat, sebagaimana Allah berfirman dalam surat setelahnya: وَرَفَعْنَا لَكَ ذِكْرَكَ \" Dan Kami tinggikan bagimu sebutan (nama)mu. \"(Asy-Syarh: 4) (1) Dikeluarkan Muslim (532) dari hadits Jundub Bin Abdillah al-Bajaliy radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 3: Kemudian datang jawaban atas sumpah, Allah berkata : Sungguh Allah tidaklah meninggalkanmu wahai Nabi, semenjak Ia memilih engkau untuk menyampaikan risalah-Nya dan tidak juga engkau diabaikan, serta marah kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, ketika turunnya wahyu kepada Nabi Muhammad shallallahu 'alaihi wa sallam terhenti untuk sementara waktu, orang-orang musyrik berkata, \"Tuhannya (Muhammad) telah meninggalkannya dan benci kepadanya.” Maka turunlah ayat di atas untuk membantah perkataan orang-orang musyrik itu, yaitu, “Tuhanmu tidak meninggalkan engkau (Muhammad) dan tidak (pula) membencimu,” yakni Allah Subhaanahu wa Ta'aala tidaklah meninggalkan Beliau dan membiarkannya sejak Dia mengurus dan mendidik Beliau, bahkan Dia senantiasa mengurus dan mendidik Beliau dengan pendidikan yang sebaik-baiknya serta meninggikan Beliau sederajat demi sederajat. Yakni Dia tidak membencimu sejak Dia mencintaimu. Inilah keadaan Rasulullah shallallahu 'alaihi wa sallam yang dahulu dan yang sekarang; yakni keadaan yang paling sempurna; kecintaan Allah untuk Beliau dan tetap terus seperti itu serta diangkatnya Beliau kepada kesempurnaan, dan tetap terusnya mendapatkan perhatian dari Allah Subhaanahu wa Ta'aala. Adapun keadaan Beliau pada masa mendatang, maka sebagaimana firman-Nya, “Dan sungguh, yang kemudian itu lebih baik bagimu daripada yang permulaan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 3",
    "description": "Wahai nabi, tidak adanya wahyu yang turun kepadamu dalam beberapa hari ini bukan karena Allah membencimu. Tuhanmu yang telah memilihmu sebagai nabi dan rasul tidak akan meninggalkan engkau sendirian dalam menyampaikan risalah dan tidak pula membencimu. 4. Dan sungguh, yang kemudian itu lebih baik bagimu dari yang permulaan. Akhirat beserta pahala yang Allah sediakan untukmu itu lebih baik daripada dunia ini. Kenikmatan akhirat bersifat abadi, sedangkan kehidupan dunia hanya sementara."
  }
]