[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Kehidupan akhirat lebih baik bagimu daripada kehidupan dunia. Dan tuhanmu akan memberimu (wahai nabi) ,berbagai macam kenikmatan di akhirat,maka kamu akan ridha dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan sungguh kehidupan Akhirat lebih baik bagimu daripada kehidupan dunia, karena kenikmatan abadi yang tidak terputus di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Sungguh surga yang ada di kehidupan akhirat lebih baik bagimu daripada dunia, meskipun di dunia Allah telah memberinya kemuliaan kenabian yang melampaui segala kemuliaan. Dan karena dunia seperti bayangan yang akan sirna dan hanya tempat perantara, maka ia sama sekali tidak dapat dibandingkan dengan kehidupan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَلَلْءَاخِرَةُ خَيْرٌ لَّكَ مِنَ الْأُولَىٰ (Dan sesungguhnya hari kemudian itu lebih baik bagimu daripada yang sekarang) Yakni surga lebih baik bagimu daripada dunia. Padahal di dunia beliau telah dimuliakan dengan kenabian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Akhirat yang kekal abadi dan apa yang ada di dalamnya berupa surga dan kemuliaan itu lebih baik daripada dunia fana yang tercampur dengan kerusakan. Ath-Thabrani mengatakan di pertengahan (ucapan) Ibnu Abbas yang berkata: Rasulallah SAW bersabda: “Telah tampak bagiku rahasia yang terbuka, yaitu umatku setelah (masa)ku, dan hal itu membuatku senang” kemudian Allah menurunkan ayat {Wa lal aakhiratu khairul laka minal uulaa} dan sanadnya hasan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh akhirat itu lebih baik bagimu daripada yang permulaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Sedangkan kondisi Rasulullah selanjutnya, maka Allah berfirman, “Dan sesungguhnya akhir itu lebih baik bagimu dari permulaan,” yakni setiap kondisi terakhirmu lebih baik dari kondisi sebelumnya dan beliau terus menapaki derajat tinggi, Allah mengukuhkan AgamaNya bagi beliau, menolongnya dari musuh-musuhnya dan meluruskan kondisi-kondisinya, hingga tatkala wafat, beliau mencapai kondisi yang tidak bisa dicapai oleh orang-orang terdahulu dan yang terakhir, berupa kemuliaan, nikmat, penyejuk mata, dan kebahagiaan hati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ mengabarkan kepada Nabi-Nya bahwasanya apa yang Allah ﷻ siapkan untuknya di akhirat adalah lebih baik daripada dunia dan seisinya. Allah ﷻ tidak akan meninggalkanmu didunia wahai Muhammad, akan tetapi apa yang Tuhanmu siapkan di akhirat adalah kenikmatan yang jauh lebih baik dan tidak akan musnah. { وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَىٰ } Surga yang Allah ﷻ siapkan untuk NAbi-Nya adalah lebih baik daripada apa yang telah Dia ﷻ berikan kepadanya didunia, oleh karena itu harta dan kekuasaan dunia tidak pernah manguasai Nabi Muhammad ﷺ , sebagaimana para Raja-raja dan penguasa lainnya tunduk dan menjadi hamba harta dunia, karena sesungguhnya dunia akan musnah dan hancur, dan tidak akan ada lagi kehidupan didalamya, maka Allah ﷻ memberikan kekayaan dunia ini kepada Nabi-Nya secukupnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى \" dan sesungguhnya akhir itu lebih baik bagimu dari permulaan.\"Kalimat ini diberi penegasan dengan huruf lam –lamul ibtida (pemulai kalimat)-. Akhirat adalah hari dibangkitkannya manusia, mereka akan menuju ke tempat akhir mereka, baik surge atau neraka, maka Allah mengatakan kepada Nabi-Nya shallallaahu 'alaihi wa sallam وَلَلْآخِرَةُ خَيْرٌ لَكَ مِنَ الْأُولَى \" dan sesungguhnya akhir itu lebih baik bagimu dari permulaan.\" Maknanya: Dari dunia, itu dikarenakan di akhirat terdapat kenikmatan yang tidak pernah dipandang mata, terdengar telinga dan terbetik di benak hati manusia (1) dan tempat cemeti salah seorang dari kita di surge lebih baik dari dunia dan segala isinya, sebagaimana berita ini datang dari Rasulullah shallallaahu 'alaihi wa sallam. (2) Oleh karenanya, ketika Allah memberikan pilihan kepada Nabi-Nya shallallaahu 'alaihi wa sallam saat beliau sakit antara hidup di dunia dan dengan apa-apa yang ada di sini Allah, beliau memilih yang ada di sisi Allah, sebagaimana beliau mengumumkannya di atas mimbar dalam khutbahnya, beliau menuturkannya di atas mimbar: إِنَّ عَبْداً مِنْ عِبَادِ الله خَيَّرَهُ اللهُ بَيْنَ أَنْ يَعِيْشَ فيِ الدُّنْيَا مَا شَاءَ اللهُ أَنْ يَعِيْشُ وَبَيْنَ مَا عِنْدَه فَاخْتَارَ مَا عِنْدَهُ \"Sesungguhnya seorang hambna di antara hamba-hamba Allah, diberikan pilihan oleh Allah antara hidup di dunia hingga kehidupan yang dihendaki Allah dengan apa-apa yang ada di sisi Allah, maka ia memilih apa-apa yang ada di sisi Allah\" Maka Abu Bakar radhiyallaahu 'anhu menangis seketika, para sahabat yang lain keheranan mengapa ia menangis dari penuturan Rasulullah tersebut. Tetapi ia radhiyallaahu 'anhu adalah orang yang paling memahami Rasulullah shallallaahu 'alaihi wa sallam, beliau paham bahwa yang diberitakan dalam penuturannya itu adalah Rasul shallallaahu 'alaihi wa sallam, dan beliau memilih apa-apa yang ada di sisi Allah yaitu akhirat, dan ini adalah pemberitahuan akan dekatnya ajal beliau (3) (1) Dikeluarkan Bukhari (3244) dan Muslim (2824) dari hadits Abu Hurairah Radhiyallaahu 'anhu (2) Dikeluarkan Bukhari (6451) dari hadits Sahl Bin Sa'd radhiyallaahu 'anhu. (3) Dikeluarkan Bukhari (466) dan Muslim (2382) dari hadits Abu Sa'id al-Khudriy radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 4: Allah mengabarkan dengan kabar gembira kepada Nabi-Nya ﷺ, bahwa surga lebih baik baginya dari dunia yang fana ini. Berkata Syaikh Ibnu Utsaimin pada pelajarannya di masjid Al Haram (Mekkah) saat subuh tanggal 28/3/1418 H : Dan firman-Nya وَلَلْءَاخِرَةُ خَيْرٌۭ لَّكَ مِنَ ٱلْأُولَىٰ ayat ini khusus bagi Nabi ﷺ, adapun bagi seluruh manusia maka Allah berfirman وَٱلْءَاخِرَةُ عِندَ رَبِّكَ لِلْمُتَّقِينَ yang artinya : dan kehidupan akhirat itu di sisi Tuhanmu adalah bagi orang-orang yang bertakwa, {Az Zukhruf : 35}, dan tidaklah disyaratkan taqwa bagi Nabi ﷺ, karena Nabi adalah imam bagi orang-orang yang bertakwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bahwa akhir perjuangan Nabi Muhammad shallallahu 'alaihi wa sallam itu akan menjumpai kemenangan-kemenangan meskipun permulaannya penuh dengan kesulitan-kesulitan. Allah Subhaanahu wa Ta'aala menguatkan agama Beliau, memenangkan Beliau terhadap musuh-musuhnya serta memperbaiki kondisi Beliau sehingga Beliau mencapai keadaan yang tidak dapat dicapai oleh orang-orang terdahulu maupun yang datang kemudian, baik dalam hal keutamaan, kebanggaan maupun kegembiraan. Sedangkan di akhirat, maka tidak perlu ditanya tentang keadaan Beliau; keadaan Beliau penuh dengan berbagai kemuliaan dan kenikmatan. Oleh karena itu, Allah Subhaanahu wa Ta'aala berfirman, “Dan sungguh, kelak Tuhanmu pasti memberikan karunia-Nya kepadamu, sehingga engkau menjadi puas.” Pemberian-Nya yang besar tidak mungkin diungkapkan selain dengan kata-kata itu. Di antara mufassir ada yang menafsirkan ‘akhirat’ dengan kehidupan akhirat beserta segala kenikmatannya, dan ‘ula’ dengan kehidupan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 4",
    "description": "Dan sungguh, yang kemudian itu lebih baik bagimu dari yang permulaan. Akhirat beserta pahala yang Allah sediakan untukmu itu lebih baik daripada dunia ini. Kenikmatan akhirat bersifat abadi, sedangkan kehidupan dunia hanya sementara. 5. Dan sungguh, kelak tuhanmu pasti memberikan karunia-Nya yang berlimpah kepadamu, baik dalam urusan dunia seperti kesuksesan menyampaikan risalah, maupun di akhirat dengan pahala, hak memberi syafaat, dan sebagainya. Dia akan mencurahkan karunia kepadamu sehingga engkau menjadi puas karenanya."
  }
]