[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Kehidupan akhirat lebih baik bagimu daripada kehidupan dunia. Dan tuhanmu akan memberimu (wahai nabi) ,berbagai macam kenikmatan di akhirat,maka kamu akan ridha dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan niscaya Rabbmu memberi pahala yang banyak bagimu dan umatmu hingga engkau puas dengan apa yang diberikan Allah kepadamu dan kepada umatmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-8. Allah berjanji akan memberi Nabi Muhammad karunia yang tidak terbatas; Allah akan memberinya kemenangan dan kejayaan di dunia, dan derajat yang tinggi di akhirat; sehingga kerunia yang luas itu dapat membuatnya ridha dan puas, baik itu berupa kebaikan yang diberikan bagi dirinya sendiri maupun umatnya. Kemudian Allah menyebutkan kenikmatan-kenikmatan yang telah Dia berikan kepada Nabi Muhammad, berupa kenikmatan sejak dia masih kecil dan kelembutan-Nya ketika menghadapi berbagai kesulitan. Allah menyampaikannya dengan ungkapan pertanyaan yang bertujuan untuk menegaskan. Allah mendapatimu dalam keadaan yatim, kemudian menyediakan bagimu tempat berlindung dan pengasuhan yang sesuai denganmu, sehingga dapat tumbuh dalam perhatian penuh. Dan dahulu kamu tidak mengerti apapun tentang perkara kenabian, dan tentang wahyu dan syariat; dan kamu tidak mengetahui kebenaran yang harus kamu ikuti; maka Allah mengajarkan kepadamu apa yang sebelumnya tidak kamu ketahui. Dan Allah mendapatimu dalam keadaan miskin, kemudian Allah membuatmu kaya dengan karunia dan kemurahan dari-Nya; serta menjadikanmu puas atas rezeki yang Allah berikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَلَسَوْفَ يُعْطِيكَ رَبُّكَ (Dan kelak Tuhanmu pasti memberikan karunia-Nya kepadamu) Dengan kemenangan agamanya, pahala, telaga di surga, dan syafaat bagi umatnya di akhirat. فَتَرْضَىٰٓ( lalu (hati) kamu menjadi puas)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Tuhanmu akan memberimu kebaikan dan telaga di akhirat. Imam Hakim dan Al-Baihaqi dalam dalil-dalilnya dan Ath-Thabrani serta lainnya dari Ibnu Abbas berkata: “Telah tampak kepada Rasulallah SAW rahasia yang dibuka tentang umatnya, kafar kafar, yaitu desa-desa kecil, lalu beliau senang dengan hal itu, kemudian Allah menurunkan ayat {wa la saufa yu’thiika rabbuka fa tardhaa}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kelak Tuhanmu pasti memberi kamu sehingga kamu ridha"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Kemudian setelah itu, jangan anda tanyakan tentang kondisi beliau di akhirat berupa berbagai macam kemuliaan dan nikmat. Karena itu Allah berfirman, “Dan kelak pasti Rabbmu memberikan karuniaNya kepadamu, lalu (hati) kamu menjadi puas.” Ini tidak mungkin bisa diungkapkan kecuali dengan kata-kata menyeluruh ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَلَسَوْفَ يُعْطِيكَ رَبُّكَ } Dan tuhanmu akan memberikan kenikmatan yang jauh lebih baik kepadamu Muhammad di akhirat { فَتَرْضَىٰ } maka kamu akan ridho dengan-Nya, sebagaimana Dia pun memberikan pertolongan ketika kamu didunia, Allah ﷻ menolong Nabi-Nya dengan mengirimkan orang-orang baik untuknya dalam menyebarkan risalah islam di muka bumi. Seperti itulah kebaikan dan kenikmatan yang Allah ﷻ anugerahkan kepada Nabi-Nya didunia, dan juga berbagai mukjizat yang kepada Nabi-nabi selainnya Allah ﷻ belum karuniakan kepada mereka, dan mukjizat terbesar yang Allah ﷻ berikan kepada Nabi Muhammad ﷺ adalah Al-Qur'an, yaitu mukjizat yang Allah ﷻ menantang jin dan manusia agar mereka mendatangkan hal serupa yang mirip dengan Al-Qur'an, atau sebagian dari Al-Qur'an, atau satu surah dari Al-Qur'an, akan tetapi mereka tidak mampu membuat satu surah pun seperti Al-Qur'an, inilah nikmat Allah ﷻ yang paling besar, dan bukti yang paling akurat akan kebenaran risalah yang dibawa oleh Rasulullah ﷺ dan kebenaran akan kenabiannya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَلَسَوْفَ يُعْطِيكَ رَبُّكَ فَتَرْضَى \" Dan kelak Tuhanmu pasti memberikan karunia-Nya kepadamu, lalu (hati) kamu menjadi puas.\" وَلَسَوْفَ Huruf lam di sini adalah sebagai penegasan, ia disematkan untuk menguatkan sumpah, dan سَوْف [Saufa] menunjukkan kepastian terwujudnya sesuatu tetapi setelah beberapa saat dan waktu يُعْطِيكَ رَبُّكَ Maknanya: Memberikan karunia-Nya lalu engkau ridha dengan itu. Allah telah memberikan kenikmata-kenikmatan yang membuat beliau shallallaahu 'alaihi wasallam puas. Sesungguhnya Allah Ta'ala akan membangkitkannya di maqom mahmud (kedudukan yang terpuji), yang akan dipuji oleh orang-orang terdahulu dan orang-orang terakhir, hingga para nabi, dan ulul'Azmi dari para rasul tidak akan mampu mencapai kedudukan tersebut. Ketika hari kiamat tiba, rasa gundah dan himpitan besar akan meliputi semua makhluk, mereka akan tertekan dengan urusan-urusan mereka, mereka saling meminta satu sama lain, orang yang akan memberikan syafaat untuknya kepada Allah 'Azza Wa Jalla, mereka akan datang kepada Adam, kemudian kepada Nuh, kemudian Ibrahim, Musa, 'Isa, lima nabi, yang pertama adalah bapaknya seluruh manusia, dan empat nabi lainnya adalah ulul'azmi, mereka semua tidak mampu memberi safa'at dengan alasan masing-masing, hingga sampai kepada Nabi shallallaahu 'alaihi wa sallam, maka beliau akan berdiri dan memberikan syafa'at (1). Tidak diragukan lagi bahwa ini adalah pemberian yang agung, yang tidak diperoleh oleh siapa pun. (1) Dikeluarkan Bukhari (3340) dan Muslim (194) dari hadits Abu Hurairah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 5: Allah memberikan kabar gembira bahwa Ia akan memberikan kenikmatan-kenikmatan di dunia dan akhirat yang membuat engkau ridha dengannya dan yang menyenangkan pandanganmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Al Hafizh Ibnu Katsir berkata: Imam Abu ‘Amr Al Auza’i berkata (meriwayatkan) dari Isma’il bin Ubaidullah bin Abul Muhajir Al Makhzumiy dari Ali bin Abdullah bin Abbas dari bapaknya ia berkata: Ditunjukkan kepada Rasulullah shallallahu 'alaihi wa sallam segala sesuatu dari perbendaharaan yang akan ditaklukkan untuk umatnya satu persatu, Beliau pun bergembira dengannya, maka Allah menurunkan ayat, “Dan sungguh, kelak Tuhanmu pasti memberikan karunia-Nya kepadamu, sehingga engkau menjadi puas.” Oleh karena itu, Allah Subhaanahu wa Ta'aala akan memberikan kepada Beliau di surga sejuta istana, dimana masing-masing istana ada istri-istri dan pelayan-pelayan yang layak untuk Beliau.” (Diriwayatkan oleh Ibnu Jarir dan Ibnu Abi Hatim dari jalannya, dan ini adalah isnad yang shahih sampai kepada Ibnu Abbas). Syaikh Muqbil berkata, “Hadits tersebut diriwayatkan oleh Ibnu Jarir sebagaimana dikatakan Al Haafizh Ibnu Katsir juz 30 hal. 232 dari dua jalan dari Al Auza’iy, dimana pada salah satunya ada ‘Amr bin Hasyim Al Bairutiy rawi yang meriwayatkan dari Al Auza’iy, dan dia dha’if, sedangkan pada jalan yang lain ada Rawwad bin Al Jarrah yang diperselisihkan. Saya kira, orang yang mentsiqahkannya adalah karena kejujurannya dan agamanya, sedangkan orang yang mencacatkannya karena ia adalah seorang yang mukhtalith (bercampur hapalannya). Hadits tersebut juga diriwayatkan oleh Hakim dan ia menshahihkannya juz 2 hal. 526, dan Adz Dzahabiy mengomentarinya dengan berkata, “’Isham bin Rawwad menyendiri dengan hadits itu dari bapaknya, sedangkan ia didhaifkan.” Thabrani juga meriwayatkan dalam Al Kabir dan Al Awsath, Al Haitsami berkata, “Sedangkan dalam riwayat di Al Awsath disebutkan: Rasulullah shallallahu 'alaihi wa sallam bersabda, “Ditunjukkan kepadaku segala sesuatu yang akan ditaklukkan untuk umatku setelahku sehingga membuatku senang.” Maka Allah menurunkan ayat, “Dan sungguh, yang kemudian itu lebih baik bagimu daripada yang permulaan.” Lalu disebutkan sama seperti dalam hadits sebelumnya, namun di sana terdapat Mu’awiyah bin Abul ‘Abbas yang aku (Haitsami) tidak mengenalnya, sedangkan para perawi yang lain adalah tsiqah, dan isnad dalam Al Kabir adalah hasan.” Syaikh Muqbil juga berkata, “Abu Nu’aim juga meriwayatkan dalam Al Hilyah juz 3 hal. 212 dari Thabrani dan di sana terdapat ‘Amr bin Hasyim Al Bairutiy, selanjutnya ia berkata, “Hadits ini gharib dari hadits Ali bin Abdullah bin ‘Abbas, dimana tidak ada yang meriwayatkan darinya kecuali Isma’il. Dan Sufyan ats Tsauriy meriwayatkan hadits itu dari Al Auza’i dari Ismail seperti itu.” (lihat Ash Shahihul Musnad karya Syaikh Muqbil hal. 267-268)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 5",
    "description": "Dan sungguh, kelak tuhanmu pasti memberikan karunia-Nya yang berlimpah kepadamu, baik dalam urusan dunia seperti kesuksesan menyampaikan risalah, maupun di akhirat dengan pahala, hak memberi syafaat, dan sebagainya. Dia akan mencurahkan karunia kepadamu sehingga engkau menjadi puas karenanya. 6. Bukankah dia mendapatimu sebagai seorang yatim ketika kedua orang tuamu wafat, lalu dia melindungimu dalam asuhan kakek dan pamanmu' ayah nabi wafat ketika beliau dalam kandungan dan ibunya wafat ketika beliau berumur 6 tahun. Allah melindungi nabi dalam asuhan kakeknya, 'abdul muttalib, sampai usia 8 tahun, dilanjutkan oleh pamannya, ab' t'lib, hingga sang paman wafat."
  }
]