[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Bukankah tuhanmu mendapatimu sebagai anak yatim yang bapakmu wafat saat kamu masih dalam Rahim ibumu lalu tuhanmu menjaga dan melindungimu? Tuhanmu mendapatimu tidak mengetahui apa itu al-qur’an dan apa itu iman, lalu dia mengajarimu apa yang kamu tidak ketahui dan membingbingmu kepada amal terbaik? Tuhanmu juga mendapatimu miskin, lalu Dia menggiring rizki NYa kepadamu,membuatmu merasa berkecukupan dengan qana’ah dan kesabaran?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan Dia telah mendapatimu tatkala engkau masih kecil, ditinggal mati ayahmu, lalu Dia memberikan perlindungan kepadamu melalui kakekmu Abdul Muṭṭalib yang menyayangimu, kemudian pamanmu Abu Ṭālib."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. أَلَمْ يَجِدْكَ يَتِيمًا فَـَٔاوَىٰ (Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu?) Yakni mendapatimu yatim tanpa bapak, kemudian Allah memberimu tempat berlindung."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ) . { وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ } Dan sungguh Allah telah memberikan kepada Nabi-Nya dua macam kecukupan : yang paling besar adalah kecukupan hati yang dengannya beliau mengurangi perhatiannya kepada dunia, yang kedua adalah kecukupan harta, yaitu ketika Khadijah merekomendasikan Muhammad untuk ikut bersamanya dalam perjalanan dagang. 2 ) . Perhatikanlah dengan baik keagungan al-Qur'an yang engkau baca ini, dan sesungguhnya tidak akan kehidupan dalam hati sesorang, dan tidak pula akan mendapatkan cahaya, dan juga tidak akan terpecahkan permasalahan dan kegelisahannya, serta tidak akan mendapatkan petunjuk kecuali dengan kitab ini, maka sesorang tanpa al-Qur'an adalah mayat, buta, jahil, dan sesat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sungguh Tuhanmu menemukanmu (Muhammad) dalam keadaan yatim yang kehilangan ayah, kemudian Tuhan memberimu tempat dan memberimu orang yang melindungimu yaitu pamanmu Abu Thalib. Istifham dalam potongan ayat {Alam yajidka} fungsinya adalah untuk menginformasikan sesuatu setelahnya, yaitu makna dari (menemukanmu) adalah (mengetahui kamu)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungi} memberikan untukmu suatu tempat untuk ditinggali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-8. Selanjutnya Allah menganugerahkan kondisi-kondisi khusus yang Dia ketahui seraya berfirman, “Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu,” yakni, Allah mendapatimu tidak beribu dan tidak berayah, bahkan ayah dan ibu beliau telah meninggal dunia sedangkan ia sendiri belum bisa mengurus dirinya sendiri, lalu Allah memberinya perlindungan, ia dirawat oleh kakeknya, Abu Thalib, hingga Allah menguatkan dengan pertolonganNya dan dengan kaum Mukminin. “Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.” Artinya, Allah mendapatimu dalam kondisi engkau tidak mengetahui apa itu al-Quran dan apa itu iman, lalu Dia mengajarkanmu apa yang tidak kau ketahui dan memberimu pertolongan untuk amal dan akhlak yang baik. “Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan,” yakni fakir lalu Allah memberimu kecukupan berupa penaklukan berbagai negeri untukmu berupa pemungutan harta dan upeti. Rabb yang menghilangkan berbagai kekurangan darimu ini akan menghilangkan semua kekurangan darimu. Dan Rabb yang menyampaikanmu pada kecukupan, memberimu perlindungan, menolong serta memberimu petunjuk, maka balaslah nikmatNya dengan rasa syukur."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada beberapa ayat setelahnya Allah ﷻ kemudian menyebutkan kembali nikmat-Nya yang Ia anugerahkan kepada Nabi-Nya untuk meyakinkan Rasulullah akan janji-Nya yang mulia itu, Allah ﷻ berfirman : { أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ , وَوَجَدَكَ ضَالًّا فَهَدَىٰ , وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ } beberapa nikmat yang Allah ﷻ berikan kepada Nabi-Nya, maka yang memberikan kenikmatan ini didunia tentu akan memberikan yang lebih baik bagi Rasulullah dinakhirat nanti. { أَلَمْ يَجِدْكَ يَتِيمًا فَآوَىٰ } Sebelum lahirnya Rasulullah ﷺ kedunia dia telah menjadi anak yatim dengan wafatnya sang ayah, kemudian setelah beberapa tahun hidup bersama sang ibu, atas taqdir Allah ibu Rasulullah ﷺ meninggal dunia saat beliau masih berusia 6 tahun, dan kepengasuhan beralih kepada kakeknya Abdul Muththolib, ketika kakek beliau wafat pamannya Abu Thalib pun mengambil Rasulullah untuk diasuh, Rasulullah ﷺ kemudian diasuh oleh pamannya sejak kecil, hingga beliau ﷺ diangkat oleh Allah menjadi Rasul dan pamanya kerap mendukung dan membela beliau dalam berdakwah, bahkan pamannya yang belum bersyahadat itu pun sering melindungi beliau dari kejailan kaum kafir, dan apa yang dilakukan oleh pamannya adalah bentuk kasih sayang Allah kepada Rasul-Nya dengan menjadikan pamannya tunduk dan menjaganya dengan penuh kasih sayang, Abu Thalib yang sampai akhir hayatnya belum beriman kepada Allah ﷻ , adalah orang yang terhormat dan ditaati di kaumnya, Allah menjdikannya sebagai pelindung bagi Rasul-Nya dari keburukan kaumnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah subhanahu wa Ta'ala menjelaskan kenikmatan-kenikmatan sebelumnya yang telah diberikan sebagai argumentasi atas kenikmatan-kenikmatan yang akan beliau peroleh, Allah berfirman أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى \" Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu.\" Pertanyaan di sini bertujuan untuk penetapan, maksudnya: Sungguh Allah Ta'ala telah mendapatimu dalam keadaan yatim kemudian Allah melindungimu, anak yatim yang ditinggal mati bapaknya, kemudian ibunya. Bapaknya meninggal sebelum beliau lahir, ibunya lahir sebelum beliau sempurna menyusui, tetapi Allah ta'ala mengurus beliau, dan memudahkan untuknya sehingga ada orang yang merawatnya dan membelanya, hingga sampai kepada tujuan yang Allah'Azza Wa Jalla inginkan. Dan Firman-Nya: أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى \"\" Ungkapan datang dengan فَآوَى disebabkan (menyesuaikan) lafadz dan disebabkan maknawi. Adapun sebab lafadz: Maka tujuannya adalah agar ujung-ujung setiap ayat sesuai (serasi) dari mulai awal surat. Sedangkan sebab maknawi: Maka sungguh kalau saja didiganti dengan فَآوَاكَ \"Melindungimu\" maka perlindungan akan menjadi khusus abgi beliau shallallaahu 'alaihi wa sallam, tatapi perkaranya lebih luas dari itu. Karena Allah Ta'ala pun melindungi beliau, dan melinding melalui perantara beliau, melindungi orang-orang mukmin melalui perantara beliau, sehingga Allah menolong dan mendukung mereka, dan melindungi dan membela mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 6: Allah menyebutkan sebagian nikmat atas Nabi ﷺ dengan berkata : Bukankah Ia mendapatimu tumbuh dalam keadaan yatim lalu Ia melindungi dan membimbingmu ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Apa yang disebutkan dalam ayat ini dan setelahnya merupakan bukti perhatian Allah Subhaanahu wa Ta'aala kepada Beliau. Allah Subhaanahu wa Ta'aala mendapati Beliau dalam keadaan yatim-piatu; Beliau ditinggal wafat ibu dan bapaknya ketika Beliau tidak bisa mengurus diri Beliau, maka Allah Subhaanahu wa Ta'aala melindunginya, menyerahkan kepada kakeknya Abdul Muththalib, dan setelah kakeknya wafat Dia menyerahkan kepada pamannya Abu Thalib sampai kemudian Allah Subhaanahu wa Ta'aala membantu Beliau dengan pertolongan-Nya kemudian dengan kaum mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 6",
    "description": "Bukankah dia mendapatimu sebagai seorang yatim ketika kedua orang tuamu wafat, lalu dia melindungimu dalam asuhan kakek dan pamanmu' ayah nabi wafat ketika beliau dalam kandungan dan ibunya wafat ketika beliau berumur 6 tahun. Allah melindungi nabi dalam asuhan kakeknya, 'abdul muttalib, sampai usia 8 tahun, dilanjutkan oleh pamannya, ab' t'lib, hingga sang paman wafat. 7. Dan bukankah dia juga mendapatimu sebelum menjadi nabi sebagai seorang yang bingung karena belum mengetahui akidah dan hukum yang benar, lalu dia memberikan petunjuk melalui wahyu dan membimbingmu sampai akhir hayatmu'."
  }
]