[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Bukankah tuhanmu mendapatimu sebagai anak yatim yang bapakmu wafat saat kamu masih dalam Rahim ibumu lalu tuhanmu menjaga dan melindungimu? Tuhanmu mendapatimu tidak mengetahui apa itu al-qur’an dan apa itu iman, lalu dia mengajarimu apa yang kamu tidak ketahui dan membingbingmu kepada amal terbaik? Tuhanmu juga mendapatimu miskin, lalu Dia menggiring rizki NYa kepadamu,membuatmu merasa berkecukupan dengan qana’ah dan kesabaran?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan mendapatimu tidak mengerti tentang kitab dan iman, lalu Dia mengajarimu apa yang tidak kamu ketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَوَجَدَكَ ضَآلًّا فَهَدَىٰ (Dan Dia mendapatimu sebagai seorang yang tidak berilmu, lalu Dia memberikan petunjuk) Yakni tidak mengetahui tentang al-Qur’an dan syariat-syariat, kemudian Allah mengajarkanmu tentang itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ) . { وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ } Dan sungguh Allah telah memberikan kepada Nabi-Nya dua macam kecukupan : yang paling besar adalah kecukupan hati yang dengannya beliau mengurangi perhatiannya kepada dunia, yang kedua adalah kecukupan harta, yaitu ketika Khadijah merekomendasikan Muhammad untuk ikut bersamanya dalam perjalanan dagang. 2 ) . Perhatikanlah dengan baik keagungan al-Qur'an yang engkau baca ini, dan sesungguhnya tidak akan kehidupan dalam hati sesorang, dan tidak pula akan mendapatkan cahaya, dan juga tidak akan terpecahkan permasalahan dan kegelisahannya, serta tidak akan mendapatkan petunjuk kecuali dengan kitab ini, maka sesorang tanpa al-Qur'an adalah mayat, buta, jahil, dan sesat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Allah menemukanmu salah dalam memahami hukum-hukum syariat dan Al-Qur’an lalu Allah menunjukkan kamu kepada jalan syariat dan tata caranya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{mendapatimu sebagai seorang yang tidak tahu} lupa dari apa yang ditujukan kepadamu berupa kenabian {lalu Dia memberimu petunjuk} membimbing dan mengajarimu sesuatu yang belum kamu ketahui dengan wahyu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-8. Selanjutnya Allah menganugerahkan kondisi-kondisi khusus yang Dia ketahui seraya berfirman, “Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu,” yakni, Allah mendapatimu tidak beribu dan tidak berayah, bahkan ayah dan ibu beliau telah meninggal dunia sedangkan ia sendiri belum bisa mengurus dirinya sendiri, lalu Allah memberinya perlindungan, ia dirawat oleh kakeknya, Abu Thalib, hingga Allah menguatkan dengan pertolonganNya dan dengan kaum Mukminin. “Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.” Artinya, Allah mendapatimu dalam kondisi engkau tidak mengetahui apa itu al-Quran dan apa itu iman, lalu Dia mengajarkanmu apa yang tidak kau ketahui dan memberimu pertolongan untuk amal dan akhlak yang baik. “Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan,” yakni fakir lalu Allah memberimu kecukupan berupa penaklukan berbagai negeri untukmu berupa pemungutan harta dan upeti. Rabb yang menghilangkan berbagai kekurangan darimu ini akan menghilangkan semua kekurangan darimu. Dan Rabb yang menyampaikanmu pada kecukupan, memberimu perlindungan, menolong serta memberimu petunjuk, maka balaslah nikmatNya dengan rasa syukur."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَوَجَدَكَ ضَالًّا } Dan dia ( Tuhanmu ) mendapati dirimu tidak mengetahui apapun tentang wahyu ini, Allah ﷻ berfirman : { وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِنْ أَمْرِنَا ۚ مَا كُنْتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ } ( Dan demikianlah Kami wahyukan kepadamu wahyu (Al Quran) dengan perintah Kami. Sebelumnya kamu tidaklah mengetahui apakah Al Kitab (Al Quran) dan tidak pula mengetahui apakah iman itu ) [ Asy Syura : 52 ] . Dan bukan maksud dari kata { ضَالًّا } adalah sesat kekafiran, akan tetapi maksud dari kata itu adalah ketidak tahuan Rasulullah tentang syariat islam dan wahyu, Allah ﷻ berfirman : { وَمَا كُنْتَ تَتْلُو مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ ۖ إِذًا لَارْتَابَ الْمُبْطِلُونَ } ( Dan kamu tidak pernah membaca sebelumnya (Al Quran) sesuatu Kitabpun dan kamu tidak (pernah) menulis suatu Kitab dengan tangan kananmu; andaikata (kamu pernah membaca dan menulis), benar-benar ragulah orang yang mengingkari(mu). ) [ Al-Ankabut : 48 ] , dan Allah juga berkata : { وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ ۚ وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا } ( dan telah mengajarkan kepadamu apa yang belum kamu ketahui. Dan adalah karunia Allah sangat besar atasmu ) Annisa : 113 ] . { فَهَدَىٰ } Kemudian Allah ﷻ mengajarkan kepada Nabi-Nya dan membimbingnya dengan hidayah-Nya menuju jalan yang benar, Dia ﷻ memperlihatkan Rasul-Nya jalan yang jauh dari kesesatan, semua ini adalah salah satu nikmat Allah ﷻ yang paling besar yang Dia karuniakan kepada Nabi dan ummatnya ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَوَجَدَكَ ضَالًّا فَهَدَى \" Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.\" وَوَجَدَكَ ضَالًّا Maknanya: (engkau) tidak tahu, karena Nabi shallallaahu 'alaihi wa sallam tidak tahu apa-apa sebelum diturunkan wahyu kepada beliau, sebagaimana Allah Ta'ala berfirman وَعَلَّمَكَ مَا لَمْ تَكُنْ تَعْلَمُ \" dan telah mengajarkan kepadamu apa yang belum kamu ketahui. \"(An-Nisa: 113) Allah juga berfirman: وَمَا كُنْتَ تَتْلُو مِنْ قَبْلِهِ مِنْ كِتَابٍ وَلَا تَخُطُّهُ بِيَمِينِكَ \" Dan kamu tidak pernah membaca sebelumnya (Al Qur'an) sesuatu Kitab pun dan kamu tidak (pernah) menulis suatu kitab dengan tangan kananmu \"(Al-Ankabut: 48) Dialah Rasulullah shallallaahu 'alaihi wa sallam, yang sebelumnya tidak tahu apa-apa bahkan beliau termasuk orang yang buta huruf هُوَ الَّذِي بَعَثَ فِي الْأُمِّيِّينَ رَسُولًا مِنْهُمْ \" Dia-lah yang mengutus kepada kaum yang buta huruf seorang Rasul di antara mereka, \"(Al-Jum'ah: 2) tidak bisa membaca dan dan menulis, tapi beliau mencapai kedudukan tersebut karena wahyu yang Allah turunkan kepadanya, maka beliau jadi tahu dan mengajarkan, di sini Allah berfirman فَهَدَى \"Memberi petunjuk\" Ungkapannya tidak menggunakan فَهَدَاكَ [fahadaaka] -wallaahu a'lam- agar kandungan maknanya lebih luas. Beliau telah mendapat petunjuk, dan Allah memberikan petunjuk melalui perantara beliau, beliau adalah pemberi petunjuk yang mendapat petunjuk 'alaihissholaatu wassalaam, maka makna فَهَدَى adalah \"Maka Allah memberimu petunjuk dan memberi petunjuk (yang lain) dengan perantaramu\""
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 7: Dan Allah dapati engkau salah arah, tidak mengetahui apa itu iman, Al Qur’an dan syariat kemudian Ia menunjukimu ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan bingung di sini ialah kebingungan untuk mendapatkan kebenaran yang tidak bisa dicapai oleh akal; Beliau tidak tahu apa itu kitab dan apa itu iman, lalu Allah Subhaanahu wa Ta'aala mengajarkan kepada Beliau apa yang Beliau tidak ketahui; menurunkan wahyu kepada Beliau dan memberikan Beliau taufiq kepada amal dan akhlak yang paling baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 7",
    "description": "Dan bukankah dia juga mendapatimu sebelum menjadi nabi sebagai seorang yang bingung karena belum mengetahui akidah dan hukum yang benar, lalu dia memberikan petunjuk melalui wahyu dan membimbingmu sampai akhir hayatmu'8. Dan bukankah dia juga mendapatimu sebagai seorang yang kekurangan, lalu dia memberikan kecukupan kepadamu dengan mengelola dagangan khadijah dan dengan harta lainnya, seperti ganimah, serta membekalimu dengan sifat kanaah dan kesabaran atas pemberian-Nya'."
  }
]