[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Bukankah tuhanmu mendapatimu sebagai anak yatim yang bapakmu wafat saat kamu masih dalam Rahim ibumu lalu tuhanmu menjaga dan melindungimu? Tuhanmu mendapatimu tidak mengetahui apa itu al-qur’an dan apa itu iman, lalu dia mengajarimu apa yang kamu tidak ketahui dan membingbingmu kepada amal terbaik? Tuhanmu juga mendapatimu miskin, lalu Dia menggiring rizki NYa kepadamu,membuatmu merasa berkecukupan dengan qana’ah dan kesabaran?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan mendapatimu dalam keadaan fakir, lalu Dia mencukupimu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَوَجَدَكَ عَآئِلًا فَأَغْنَىٰ (Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan) Yakni Allah mendapatimu miskin namun memiliki tanggungan keluarga yang banyak, kemudian Allah menjadikanmu kaya dengan rezeki yang Dia berikan kepadamu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-8 1 ) . { وَوَجَدَكَ عَائِلًا فَأَغْنَىٰ } Dan sungguh Allah telah memberikan kepada Nabi-Nya dua macam kecukupan : yang paling besar adalah kecukupan hati yang dengannya beliau mengurangi perhatiannya kepada dunia, yang kedua adalah kecukupan harta, yaitu ketika Khadijah merekomendasikan Muhammad untuk ikut bersamanya dalam perjalanan dagang. 2 ) . Perhatikanlah dengan baik keagungan al-Qur'an yang engkau baca ini, dan sesungguhnya tidak akan kehidupan dalam hati sesorang, dan tidak pula akan mendapatkan cahaya, dan juga tidak akan terpecahkan permasalahan dan kegelisahannya, serta tidak akan mendapatkan petunjuk kecuali dengan kitab ini, maka sesorang tanpa al-Qur'an adalah mayat, buta, jahil, dan sesat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Allah menemukanmu dalam keadaan fakir yang memiliki banyak keluarga maka Allah membuatmu kaya dengan anugerahNya berupa perniagaan dengan menggunakan harta benda Khadijah dan rampasan perang di kemenangan-kemenanganmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan mendapatimu sebagai seorang yang fakir} yang fakir {lalu Dia memberimu kecukupan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-8. Selanjutnya Allah menganugerahkan kondisi-kondisi khusus yang Dia ketahui seraya berfirman, “Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu,” yakni, Allah mendapatimu tidak beribu dan tidak berayah, bahkan ayah dan ibu beliau telah meninggal dunia sedangkan ia sendiri belum bisa mengurus dirinya sendiri, lalu Allah memberinya perlindungan, ia dirawat oleh kakeknya, Abu Thalib, hingga Allah menguatkan dengan pertolonganNya dan dengan kaum Mukminin. “Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk.” Artinya, Allah mendapatimu dalam kondisi engkau tidak mengetahui apa itu al-Quran dan apa itu iman, lalu Dia mengajarkanmu apa yang tidak kau ketahui dan memberimu pertolongan untuk amal dan akhlak yang baik. “Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan,” yakni fakir lalu Allah memberimu kecukupan berupa penaklukan berbagai negeri untukmu berupa pemungutan harta dan upeti. Rabb yang menghilangkan berbagai kekurangan darimu ini akan menghilangkan semua kekurangan darimu. Dan Rabb yang menyampaikanmu pada kecukupan, memberimu perlindungan, menolong serta memberimu petunjuk, maka balaslah nikmatNya dengan rasa syukur."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَوَجَدَكَ عَائِلًا } Dan dia (Tuhanmu) juga mendapatimu dalam keadaan msikin tidak memiliki apa-apa, { فَأَغْنَىٰ } kemudian Dia ﷻ menjadikanmu wahai Muhammad sebagai orang yang memiliki harta, harta yang Rasulullah dapatkan dari perjuangan beliau bersama sahabatnya dalam beberapa penaklukan, kemudian harta-harta itu beliau jadikan sebagai modal dalam menyebarkan dakwah islam, dan untuk keperluan dan kemaslahatan kaum muslimin, sebagaimana yang dikatakan bahwa harta adalah modal untuk kebrlangsungan hidup, dan Allah ﷻ telah melimpahkan kepada Nabi-Nya harta yang dengannya beliau dapat mendakwahkan risalah islam ini dengan mudah, dan dari harta itu beliau menginfakkannya dijalan Allah, Rasulullah ﷺ yang sebelumnya adalah orang yang tidak memiliki sesuatu apapun dari harta, maka Allah ﷻ pun menghadirkan kehadapannya sejumlah harta yang didapatkan dari penaklukan-penaklukan dan rampasan perang, dan harta itulah yang menjadikan beliau mudah dalam menjalankan ibadah dan ketaatan kepada Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَوَجَدَكَ عَائِلًا فَأَغْنَى \" Dan Dia mendapatimu sebagai seorang yang kekurangan, lalu Dia memberikan kecukupan.\" Maknanya: Allah mendapatimu dalam keadaan fakir tidak mempunyai apa-apa فَأَغْنَى , Maknanya: Menjadikanmu berkecukupan, dan menyukupkan yang lainnya dengan perantaramu, Allah Ta'ala berfirman: وَعَدَكُمُ اللَّهُ مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا \" Allah menjanjikan kepada kamu harta rampasan yang banyak yang dapat kamu ambil, \"(Al-Fath: 20) dan betapa banyak harta rampasan perang yang diperoleh kaum muslimin dari orang-orang kafir dibawah naungan pedang, harta-rampasan perang yang banyak melimpah disebabkan kehadiran Rasulullah shallallaahu 'alaihi wa sallam, ketika mereka mengikuti petunjuknya, dan mengikuti sunnahnya, Allah menolong mereka dan mereka memperoleh harta rampasan perang dari bumi bagian timur dan barat. Andai saja umat islam kembali kepada pedoman yang dipegang oleh para salaf saleh (pendahulu mereka yang saleh) maka kemenangan, kekayaan, kemulian dan kekuatan akan kembali kepada mereka, tapi sayang, umat islam saat ini, setiap mereka melihat kepada perolehan untuk masing masing, tanpa memperhatikan apa-apa yang akan menolong aga islam atau kehinaan islam. Tidak asing lagi bagi siapa saja yang memperhatikan kasus-kasus yang terjadi di akhir-akhir ini, itu semua hakikatnya merendahkan kaum muslimin, dan itu penyebab timbulnya keburukan yang besar yang diiringi dari apa yang telah terjadi. Terlebih penyebabnya dari orang-orang yahudi dan nasrani, mereka saling bekerja sama satu sama lain, sebagaimana Allah Ta'ala berfirman: يَا أَيُّهَا الَّذِينَ آمَنُوا لَا تَتَّخِذُوا الْيَهُودَ وَالنَّصَارَى أَوْلِيَاءَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ \" Hai orang-orang yang beriman, janganlah kamu mengambil orang-orang Yahudi dan Nasrani menjadi pemimpin-pemimpin (mu); sebahagian mereka adalah pemimpin bagi sebahagian yang lain. Barang siapa di antara kamu mengambil mereka menjadi pemimpin, \"(Al-Maidah: 51) Maksudnya: Orang-orang yahudi dan nasrani bersepakat memusuhi kaum muslimin, semuanya tidak ingin islam, semuanya tidak ingin orang islam, tidak ingin kejayaan islam, tatapi Allah Ta'ala Akan menolong agama-Nya bagaimana pun juga kondisinya. Allah pasti akan menolong agama-Nya dan kitab-Nya, bagaimana pun kaum muslimin tertimpa yang tidak diharapkan, Allah Ta'ala berfirman: وَتِلْكَ الْأَيَّامُ نُدَاوِلُهَا بَيْنَ النَّاسِ \" Dan masa (kejayaan dan kehancuran) itu, Kami pergilirkan di antara manusia \"(Ali Imran: 140) dan akan datang ahri di mana kaum muslimin akan memerangi yahudi dan nasrani, orang yahudi akan bersembunyi di balik pohon, pohon tersebut akann mengatakan: wahai orang muslim, wahai hamba Allah ini ada yahudi di belakan saya, maka orang muslim akan mendatangi dan membunuhnya, itu semua bagi Allah tidaklah sukar. Tetapi kaum muslimin membutuhkan komandi yang bijaksana terbebimbing dengan ilmu bersumber dari hukum-hukum syari'at sebelumnya segala sesuatu. Karena komando tanpa bimbingan cahaya syari'at islam, akan berakibat berbahaya, walau pun semakin tinggi hingga di puncaknya tertinggi, ia akan merosot turun ke jurang paling dalam, (hakikat) petunjuk adalah dari islam, dengan cahaya islam, bukan dengan nasionalisme, fanatik golongan dan negara, tidak dengan yang lainnya. Kejayaan hanya dengan islam saja. Islam sendiri yang menjadi penanggung kejayaan umat islam, tapi membutuhkan komando yang bijaksana yang menempatkan segala sesuatu pada tempatnya, tidak tergesa-gesa dalam memutuskan perkara-perkara, tidak mungkin manusia membaik antara malam dan siangnya. Siapa saja yang menginginkan tanpa islam maka ia ingin merubah ketentuan Allah sedangkan Allah subhaanahu wa Ta'ala tidak akan merubah ketentuannya. Inilah Nabi Allah 'alaihissholaatu wassalaam menetap di mekkah selama 13 tahun, turun wahyu kepadanya, berdakwah kepada Allah dengan cara terbaik, walau pun demikian beliau keluar dari mekkah dengan ketakutan, bersembunyi, dakwa beliau tidak sempurna di mekkah, maka mengapa kita ingin merubah umat yang sudah melalui waktu berabad-abad dalam kondisi lali, tertidur antara waktu malam dan siang, ini adalah kebodohan tidak masuk akan, dan kesesatan dalam agama. Umat islam membutuhkan penyembuhan yang santun juga tenang, dan dakwan dengan cara yang tebaik, setelah umat islam memahami agama Allah dan bijak dalam berdakwah, mereka membutuhkan pengetahuan terhadap realita dan pengalaman, dan mencermati perkara-perkaranya dengan sudut pandang yang jauh, karena hasil-hasilnya terkadang terlihat setelah satu bulan, atau dua bulan, setahun atau dua tahun, tetapi orang yang berakal akan sabar, memperhatikan sampai memahaminya. Dan urusan-urusannya pun membutuhkan tekad dan kesungguhan yang kuat disertai kesabaran, karena itu semua dibutuhkan, harus memiliki tekad kuat yang mendorong seorang insan, dan harus memiliki kesabaran yang meneguhkan seorang insan, jika tidak urusan-urusannya akan hilang seluruhnya atau sebagian besarnya Allahul Musta'aan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 8: Allah dapati engkau seorang faqir kemudian Allah menjadikanmu kaya ? Berkata Ibnu Utsaimin dalam pelajaran subuhnya di masjid Al Haram pada tanggal 28/3/1418 : Perkataan Allah أَلَمْ يَجِدْكَ يَتِيمًۭا فَـَٔاوَى, وَوَجَدَكَ ضَآلًّۭا فَهَدَىٰ, وَوَجَدَكَ عَآئِلًۭا فَأَغْنَىٰ, Allah tidak berkata : Allah yang melindungimu, menunjukimu, mengayakanmu, akan tetapi Allah berkata dengan lafadz umum. Sebab Allah yang memberi petunjuk kepadamu dan kepadanya, Allah yang melindungimu dan melindunginya, Allah yang mengayakanmu dan mengayakannya, Allah tidaklah mencegah dari seseorangpun (memberikan kepada siapa saja), karena lafadznya umum."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni membuatmu qana’ah (puas dan menerima apa adanya). Rasulullah shallallahu 'alaihi wa sallam bersabda: « لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ » . “Kaya itu bukanlah dengan banyaknya harta. Akan tetapi, kaya itu dengan kecukupan (kepuasan) jiwa.” (HR. Muslim) Atau maksudnya, Allah Subhaanahu wa Ta'aala mencukupkan Beliau dengan menaklukkan berbagai negeri untuk Beliau, dimana harta dan hasilnya diperuntukkan kepada Beliau. Oleh karena Dia (Allah) telah melimpahkan berbagai kenikmatan itu, maka hadapilah nikmat-Nya itu dengan disyukuri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 8",
    "description": "Dan bukankah dia juga mendapatimu sebagai seorang yang kekurangan, lalu dia memberikan kecukupan kepadamu dengan mengelola dagangan khadijah dan dengan harta lainnya, seperti ganimah, serta membekalimu dengan sifat kanaah dan kesabaran atas pemberian-Nya'9. Dengan karunia Allah yang demikian agung itu, maka berbuat baiklah terhadap anak yatim dan janganlah engkau berlaku sewenang-wenang kepadanya, seperti mengambil hartanya, menghardiknya, dan menyakiti hatinya."
  }
]