[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-11. Jangan memperlakukan anak yatim dengan buruk. Jangan menghardik orang yang meminta-minta, sebaliknya berilah dia makan, dan penuhilah hajatnya. Untuk nikmat tuhanmu yang telah Dia limpahkan kepadamu,maka bicarakanlah hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Maka janganlah engkau berbuat buruk terhadap anak yang ditinggal mati ayahnya ketika kecil dan janganlah engkau rendahkan dia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Kemudian Allah memberi petunjuk kepada Rasulullah dan umatnya dalam berinteraksi dengan anak yatim, janganlah kamu memperlakukannya dengan kasar dan merendahkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ (Sebab itu, terhadap anak yatim janganlah kamu berlaku sewenang-wenang) Yakni janganlah kamu berlaku zalim karena kelemahannya, namun berikanlah haknya dan ingatlah keadaanmu ketika kamu yatim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Sejak Allah memberikan kepadamu (Muhammad) kenikmatan-kenikmatan ini, Dia memberimu wasiat-wasiat berikut: “Adapun kepada anak yatim maka jangan merendahkan dan melemahkannya dengan mengambil hartanya atau merugikannya dan hal-hal lain yang serupa, namun berilah dia haknya sebagai pengingat keyatimanmu. Adapun kepada orang yang meminta harta benda atau keilmuan, maka berilah dia atau ajarilah dia dan janganlah mencacinya karena kefakirannya, sesungguhnya dulu nengkau juga dalam keadaan fakir, maka berilah dia makan dan sambutlah dia dengan sambutan yang indah”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terhadap anak yatim, janganlah berlaku sewenang-wenang} janganlah merendahkan dan mengambil hartanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-11. Karena itu Allah berfirman, “Adapun terhadap anak yatim, maka janganlah kamu berlaku sewenang-wenang,” yakni, jangan memperlakukan anak yatim dengan buruk, jangan merasa tertekan karenanya dan jangan membentaknya tapi muliakanlah, berikan semampumu dan perlakukanlah dia sebagaimana kau ingin anakmu diperlakukan serupa sepeninggalmu. “Dan terhadap orang yang meminta-minta, maka janganlah kamu menghardiknya,” yakni jangan sampai kau mengeluarkan kata untuk menolak permintaan orang yang meminta-minta berupa hardikan dan perangai buruk. Tapi berikanlah semampumu atau tolaklah dengan cara yang baik. Termasuk dalam hal ini adalah orang yang meminta-minta uang dan ilmu. Karena itu, seorang guru diperintahkan untuk berakhlak baik terhadap murid, memperlakukan murid dengan memuliakan dan sayang, karena hal itu bisa menjadi penolong bagi murid untuk mencapai maksudnya dan sebagai tindakan memuliakan bagi orang yang ingin memberi manfaat pada sesama manusia dan negara. “Dan terhadap nikmat Rabbmu maka hendaklah kamu menyebut-nyebutnya (dengan bersyukur),” ini mencakup nikmat-nikmat agama dan dunia. Yaitu pujilah Allah karena nikmat-nikmat itu dan sebutlah secara khusus jika memang hal itu ada maslahatnya. Bila tidak, sebutkan nikmat Allah secara mutlak (umum) karena menyebut-nyebut nikmat Allah bisa mendorong seseorang untuk mensyukurinya dan menimbulkan kesenangan bagi Yang memberi nikmat; karena hati memiliki tabiat mencintai orang yang berbuat baik padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ mengingatkan kepada Nabi-Nya agar tidak lupa dengan nikmat itu, dan tidak berlaku sewenang-wenang terhadap anak yatim, dan kepada orang-orang yang meminta. { فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ } Kamu wahai Muhammad yang dulunya adalah anak yatim, kemudian Allah ﷻ mendatangkan begitu banyak kebaikan dan kecukupan harta, maka berbuatlah hal yang serupa kepada anak-anak yatim selainmu, oleh karena itu wajib bagi siapapun untuk memulikan anak yatim, dan berinfak kepadanya. Dan pengertian yatim untuk anak Adam adalah : anak yang meninggal bapaknya dan belum mencapai usia baligh, dan ketika anak itu mencapai usia baligh maka status yatim itu terkepas darinya, sebagaimana yang disabdakan oleh Rasulullah : (( لا يُتْمَ بعد احتلام )) \" Tidak disebut yatim setelah baligh \" [ Hadits Shahih Diriwayatkan oleh Abu Dawud : 2873 ] . { فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ } janganlah kamu berbuat buruk dan mrendahkan anak yatim, akan tetapi muliakanlah dia dan lemah lembutlah kepadanya, dan ingatlah bagaimana keadaan kamu sebelumnya, ketika kamu berstatus sebagai anak yatim kemudian Alllah ﷻ menolongmu dengan hadirnya kerabat yang baik dan lembut dalam mengasuhmu sampai akhirnya kamu menjadi orang yang paling mulia di muka bumi atas izin Allah ﷻ . Salah satu cara untuk berbuat baik kepda anak yatim adalah dengan menjaga hartanya jika ada harta yang ia miliki, kemudian harta itu diserahkan kembali kepadanya ketika umurnya mencapi usia baligh dan dapat membedakan yang baik dan yang buruk."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah 'Azza Wa Jalla berfirman: فَأَمَّا الْيَتِيمَ فَلَا تَقْهَرْ \" Adapun terhadap anak yatim maka janganlah kamu berlaku sewenang-wenang.\" Ayat ini timbal balik dari أَلَمْ يَجِدْكَ يَتِيمًا فَآوَى \" Bukankah Dia mendapatimu sebagai seorang yatim, lalu Dia melindungimu.\" Jika Allah telah melindungimu saat kamu yatim maka janganlah engkau menindas anak yatim, kecuali menngaturnya untuk kebaikan bagi dia, ini bukanlah menindas sebenarnya walau pun nampakknya seperti menindas, tetapi tujuannya untuk kebaikan bagi anak yatim, maka janganlah menindas anak yatim, tapi muliakanlah anak yatim. Berbuat baik dan memuliakan kepada anak yatim, adalah di antara perintah-perintah dan kebaikan-kebaikan syari'at, karena anak yatim yang ditinggal wafat oleh bapaknya, perasaannya terpecah, memebutuhkan penyemangat, membutuhkan orang yang menghiburnya, membutuhkan orang yang memasukkan kebahagiaan kepadanya, terlebih jika dia sudah mencapai usia yang bisa berfikir, seperti usia tujuh dan sepuluh tahun, dan yang sebaya dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Ad-Dhuha ayat 9: Setelah Allah menyebutkan sebagian nikmat ini kepada Nabi ﷺ, Allah memerintahkan untuk tidak sewenang-wenang dan merendahkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni jangan bergaul secara buruk terhadapnya, janganlah dadamu merasa sempit terhadapnya dan janganlah membentaknya, bahkan muliakanlah, berikanlah kemudahan untuknya, dan berbuatlah terhadapnya sesuatu yang engkau suka jika anakmu diperlakukan seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Ad-Dhuha Ayat 9",
    "description": "Dengan karunia Allah yang demikian agung itu, maka berbuat baiklah terhadap anak yatim dan janganlah engkau berlaku sewenang-wenang kepadanya, seperti mengambil hartanya, menghardiknya, dan menyakiti hatinya. 10. Dan berbuat baiklah terhadap orang yang meminta-minta, baik meminta ilmu pengetahuan atau harta, dan janganlah engkau menghardiknya. Berilah mereka apa yang engkau mampu atau tolaklah dengan halus dan ramah."
  }
]