[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seluruh pujian hanya untuk Allah karena segala sifat-sifatNya yang semuanya merupakan sifat-sifat kesempurnaan, dan juga karena nikmat-nikmatNya yang zahir dan yang batin, nikmat-nikmat agama maupun dunia, yang telah mengadakan langit dan bumi dan semua makhluk yang berada di dalamnya, dan telah menciptakan kegelapan-kegelapan dan cahaya, yaitu, dengan silih bergantinya kedatangan malam dan siang. Dan dalam kejadian tersebut, terdapat bukti petunjuk akan keagungan Allah dan keberhakan Allah semata untuk diibadahi. Maka tidak boleh bagi siapa saja untuk menyekutukan sesuatu denganNya. Dan meskipun hal ini sudah tampak jelas sekali, akan tetapi orang-orang kafir menyamakan Allah dengan selainNya dan mereka nyekutukanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sifat kesempurnaan yang mutlak (absolut) dan pujian dengan kebaikan-kebaikan tertinggi disertai rasa cinta adalah milik Allah yang telah menciptakan langit dan bumi tanpa ada contoh sebelumnya. Dan Dia juga menciptakan malam dan siang yang silih-berganti. Dia menciptakan malam untuk kegelapan dan menciptakan siang untuk cahaya yang terang. Namun demikian orang-orang kafir menyamakan Żāt-Nya dengan selain-Nya dan membuat sekutu bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Dalam kalimat (الحمد لله) mengandung pengkhususan, yakni segala puja, puji, dan rasa syukur adalah bagi Allah. Maka Pujilah Allah yang menciptakan langit dan bumi, dan menciptakan kegelapan dan cahaya melalui pergantian siang dan malam yang merupakan tenda yang besar atas kekuasaan Allah dan kelayakan-Nya untuk disembah. Dalam ayat ini Allah menggunakan bentuk jamak dalam kata 'الظلمات' (kegelapan) dan menggunakan bentuk Mufrad pada kata 'النور' (cahaya), karena adanya kegelapan memiliki banyak sebab, sedangkan adanya cahaya hanya memiliki satu sebab. Dan penyebutan kata kegelapan didahulukan atas cahaya karena kegelapan lebih dahulu diciptakan. Ayat ini menegaskan hakikat penciptaan alam semesta yang harus manusia syukuri. Oleh sebab itu Allah mengingatkan pada awal ayat agar manusia bersyukur kepada-Nya. Dengan penjelasan yang jelas dan sifat-sifat agung Allah yang tiada batas, tetap saja orang-orang yang kafir terhadap Allah menyamakan-Nya dengan makhluk-Nya, dan menyandingkan bersama-Nya sekutu yang penuh dengan sifat kekurangan. Maha Tinggi Allah dari segala yang mereka katakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الْحَمْدُ لِلّٰهِ (Segala puji bagi Allah) Allah memulai surat ini dengan ‘Alhamdulillah’ sebagai dalil bahwa segala pujian adalah kepunyaan-Nya, dan sebagai hujjah atas orang-orang yang menyekutukan Tuhan mereka. الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ (Yang telah menciptakan langit dan bumi) Ini merupakan pemberitahuan tentang kekuasaan Allah yang sempurna yang menjadikan-Nya berhak mendapatkan segala pujian. وَجَعَلَ الظُّلُمٰتِ وَالنُّورَ ۖ (dan mengadakan gelap dan terang) Yakni kegelapan malam dan terangnya siang, serta kegelapan kekafiran dan cahaya keimanan. ثُمَّ الَّذِينَ كَفَرُوا۟ بِرَبِّهِمْ يَعْدِلُونَ (namun orang-orang yang kafir mempersekutukan (sesuatu) dengan Tuhan mereka) Yakni setelah mereka mengetahui penciptaan yang agung ini mereka masih saja mempersekutukan-Nya dan menyamakannya dengan sesuatu yang tidak memiliki kekuasaan apapun. Dan ini merupakan kebodohan yang paling dalam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Surah ini adalah surah Makkiyah kecuali 6 ayat. Surah ini turun dalam satu jumlah. Ibnu Abbas berkata: “Surah Al-An’am turun di Mekkah pada malam hari dalam satu jumlah. Surah itu dikelilingi 70 ribu malaikat yang bertasbih. Malaikat pertama memulai bertasbih dan bertahmid” 1. Pujian dan rasa syukur atas kuasa Allah yang baik. Semuanya dimulai dengan pujian, karena seluruh pujian itu hanya milik Allah, dan untuk menjawab orang-orang yang membuat tuhan (sekutu) lain bersamaNya. Dialah Pencipta langit dan bumi dengan kuasa dan hikmahNya, yang mana tidak ada perumpamaan seperti itu sebelumnya. Dialah dzat yang menciptakan kegelapan malam dan cahaya siang, walaupun dengan adanya penciptaan ini, kamu masih bisa melihat orang-orang kafir yang membuat sekutu bagiNya untuk disembah. Al-Ja’lu adalah mengadakan sesuatu yang masih berhubungan dengan sesuatu lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala puji bagi Allah yang telah menciptakan langit dan bumi, dan menciptakan kegelapan dan cahaya} menciptakan malam dan siang {Kemudaian orang-orang kafir mempersamakan tuhan mereka} mereka menyamakan Dia dengan yang lain untuk disembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini adalah pemberitahuan tentang pujian dan sanjungan kepadaNya dengan sifat-sifat kesempurnaan, keagungan, dan kemuliaan, khususnya sifat-sifat yang disebut didalamnya. Allah memuji DiriNya atas penciptaanNya terhadap langit dan bumi yang membuktikan kesempurnaan kemampuanNya, keluasan ilmu dan rahmatNya, keumuman hikmahNya dan kesendirianNya dalam penciptaan dan pengaturan, dan Dia juga memuji DiriNya atas penciptaanNya terhadap kegelapan dan cahaya. Itu meliputi hal yang kongkret seperti malam dan siang, matahari dan rembulan, juga meliputi yang abstrak seperti kegelapan kebodohan, keraguan, kesyirikan, kemaksiatan, kelalaian, dan ketaatan. Semua ini menunjukkan dengan penunjukkan yang pasti bahwa Allah berhak atas ibadah dan pengikhlasan yang nyata, “kemudian (sekalipun demikian) orang-orang yang kafir mempersekutukan (sesuatu) dengan Tuhan mereka.” Maksudnya, mereka menyamakan yang lain denganNya dalam ibadah dan pengagungan, padahal mereka yang disamakan dengan Allah itu tidak menandingi Allah dalam sifat-sifat kesempurnaan sedikit pun. Mereka itu miskin, lemah, dan kurang dalam segala segi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 1: Ayat ini sebagai pemberitahuan tentang terpuji-Nya Dia serta pujian terhadap-Nya karena sifat-sifat-Nya yang sempurna dan agung secara umum, dan lebih khusus lagi karena apa yang disebutkan pada ayat-ayat setelahnya. Allah memuji Diri-Nya karena Dia menciptakan langit dan bumi di mana hal itu menunjukkan sempurnanya kekuasaan-Nya, luasnya ilmu dan rahmat-Nya serta meratanya kebijaksanaan-Nya. Dia yang sendiri menciptakan, mengatur, mengadakan gelap dan terang; baik yang dirasakan seperti malam dan siang, matahari dan bulan, maupun yang maknawi seperti gelapnya kebodohan, keraguan, kemusyrikan, kemaksiatan, kelalaian, dan terangnya ilmu, iman, yakin, dan taat. Ini semua menunjukkan bahwa Allah Ta'ala berhak diibadati dan ditujukan keikhlasan dalam beribadah. Meskipun dalil dan bukti ini begitu jelas, namun orang-orang kafir masih saja menyamakan makhluk dengan Allah dalam hal ibadah dan ta'zhim (pengagungan), padahal makhluk-makhluk tersebut tidak sama sedikit pun dengan Allah dalam hal kesempurnaan; makhluk fakir lagi lemah, sedangkan Allah Maha Kaya lagi Maha Kuasa. Disebutkan hanya \"Langit dan bumi\" karena keduanya merupakan makhluk terbesar bagi orang-orang yang melihatnya. Disebutkan dengan bentuk jama' kata \"zhulumat\" (kegelapan-kegelapan) karena banyak bentuk kegelapan dan bermacam-macam jalannya, dan disebutkan secara mufrad (tunggal) kata \"nuur\" (cahaya) karena jalan yang mengantarkan kepada Allah hanya satu, yaitu jalan Rasulullah shallallahu 'alaihi wa sallam; berupa mengetahui kebenaran dan mengamalkannya, sebagaimana firman Allah Ta'ala, \"Dan bahwa (yang Kami perintahkan ini) adalah jalan-Ku yang lurus, maka ikutilah dia, dan janganlah kamu mengikuti jalan-jalan (yang lain), karena jalan-jalan itu mencerai beraikan kamu dari jalan-Nya. yang demikian itu diperintahkan Allah agar kamu bertakwa.\" (Terj. Al An'aam: 153)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 1",
    "description": "Pada akhir surah al-ma'idah Allah menjelaskan bahwa nabi isa dan ibunya bukanlah tuhan sebagaimana anggapan orang nasrani. Nabi isa adalah rasul atau utusan Allah yang bertugas mengajak bani israil untuk mengesakan Allah. Pada awal surah ini dijelaskan bahwa Allah yang menciptakan langit dan bumi serta menunjukkan manusia kepada jalan yang terang agar manusia meninggalkan jalan yang gelap, namun kebanyakan manusia menyimpang dari ajaran Allah yang lurus. Segala puji bagi Allah, yang berhak atas segala kesempurnaan, dan jauh dari segala kekurangan; yang telah menciptakan langit dan bumi, atas dasar cinta dan kasih sayang kepada makhluk-Nya; dan Allah telah menjadikan gelap dan terang, malam dan siang, salah dan benar, kufur dan iman; namun demikian orang-orang kafir, yaitu orang-orang yang menutup pikiran dan hati nurani mereka dari cahaya Allah menghindar dari ajaran tuhan mereka dengan menyekutukan Allah dengan sesuatu yang lebih rendah dari dirinya sebagai manusia. Dialah Allah, yang menciptakan kamu dan nenek moyangmu, nabi adam, langsung dari tanah, dan menciptakan kamu, anak keturunan adam dari saripati tanah; kemudian dia menetapkan ajal, saat kematianmu; sedangkan batas akhir hidupmu di dunia bersifat rahasia, hanya diketahui oleh-Nya semata-mata; namun demikian, kamu, manusia yang kafir masih saja meragukannya, yakni meragukan keberadaan Allah beserta kekuasaan, kebesaran, dan kasih sayang-Nya."
  }
]