[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan karena permintaan mereka untuk diturunkannya malaikat dengan tujuan untuk memperolok Muhammad , Allah menjelasakan kepada beliau bahwa olokan terhadap para rasul bukanlah perkara baru, akan tetapi hal itu telah muncul dari orang-orang kafir sebelumnya terhadap para nabi mereka. Maka siksaan aka menimpa kepada mereka yang mengolok-oloknya dan ingkari kedatangannya menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Jika orang-orang itu mengolok-olok dirimu dengan menuntut diturunkannya seorang malaikat bersamamu, sesungguhnya umat-umat sebelum mereka telah mengolok-olok rasul-rasul mereka, kemudian mereka terkepung oleh azab yang tadinya mereka ingkari dan olok-olok ketika mereka diperingatkan akan hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Karena permintaan mereka untuk diturunkan seorang malaikat merupakan olokan dan hinaan terhadap Nabi Muhammad, maka sebenarnya hinaan itu bukanlah sesuatu yang baru, karena orang-orang kafir dan musyrik sebelumnya telah menghina rasul-rasul mereka; Maka Allah menurunkan azab sebagai balasan atas perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَحَاقَ بِالَّذِينَ سَخِرُوا۟ مِنْهُم مَّا كَانُوا۟ بِهِۦ يَسْتَهْزِءُونَ (maka turunlah kepada orang-orang yang mencemoohkan di antara mereka balasan (azab) olok-olokan mereka) Maka turun kepada mereka apa yang mereka hina berupa kebenaran yang mereka dibinasakan karena menghinanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sungguh orang-orang telah mengolok-olok para rasul terdahulu sebagaimana kaummu mengolok-olok dirimu, wahai rasulullah. Lalu azab akibat olok-olokan itu turun atas orang-orang itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh rasul-rasul sebelummu benar-benar telah diperolok-olokkan, maka turunlah} meliputi {kepada orang-orang yang mencemooh mereka itu apa yang selalu mereka perolok-olokkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah menghibur dan menyabarkan RasulNya, serta mengancam musuh-musuhnya, “ Dan sungguh beberapa Rasul sebelum kami telah di olok-olok,” ketika mereka datang kepada umat-umat mereka dengan keterangan-ketarangan, mereka mendustakan rasul-rasul itu itu dan menghina mereka serta syriat yang mereka bawa, maka Allah membinasakan mereka dengan azab yang setimpal. “ maka turunlah kepada orang-orang yang mencemooh di antara mereka.” Waspdalah wahai para pendusta, jangan terus menerus di atas pendustaanmu, maka kamupun tertimpa apa yang menimpa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 10: Dalam ayat ini terdapat hiburan bagi Nabi shallallahu 'alaihi wa sallam. Demikian pula akan turun azab kepada orang-orang yang mencemoohkan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 10",
    "description": "Allah menjelaskan bahwa ajaran para rasul cenderung ditolak dan rasulnya dicemoohkan oleh manusia yang sombong. Dan sungguh, beberapa rasul sebelum engkau, Muhammad, telah diperolok-olokkan, oleh kaumnya yang sombong dan keras kepala, sehingga turunlah azab berupa bencana alam dan kejadian luar biasa kepada orang-orang yang mencemoohkan itu, supaya mereka menyadari kesalahannya dan mengubah sikapnya. Azab itu ditimpakan sebagai balasan atas olok-olokan mereka terhadap para rasul yang mengajak mereka kepada jalan Allah. Orang-orang kafir lalu diminta untuk mengamati nasib umat manusia sebelumnya yang mendustakan ajaran Allah. Katakanlah, wahai nabi Muhammad, kepada orang-orang kafir yang menolak ajakan beriman kepada Allah, jelajahilah bumi, dengan mengunjungi jejak para nabi dan menelaah kisah umat-umat terdahulu, kemudian perhatikanlah dengan cermat melalui pikiran yang jernih dan hati yang bersih, bagaimana kesudahan, perjalanan hidup dan nasib orang-orang yang mendustakan ajaran rasulullah itu di dunia'"
  }
]