[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik menjadikan jin sebagai sekutu bagi Allah dalam penyembahan , terdorong keyakinan dari mereka bahwa jin-jin dapat memberikan manfaat atau menimpakan mudarat, padahal Allah lah yang menciptakan mereka dan semua yang mereka sembah dari sesuatu yang sebelumnya tidak ada. Dia sendiri yang menciptakan, maka sudah sepantasnya hanya Dia yang berhak disembah, tanpa sekutu bagiNya di dalamnya. Dan sungguh kaum musyrikin telah mengadakan kedustaan atas nama Allah ketika mereka menisbatkan anak-anak lelaki dan anak-anak perempuan kepadaNya, lantaran kebodohan mereka terhadap sifat-sifat kesempurnaan yang wajib bagi Allah. Dia Maha suci lagi maha tinggi dari penisbatan kaum musyrikin kepadaNya yang berupa kedustaan dan kebohongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Orang-orang musyrik menjadikan jin sebagai sekutu Allah dalam ibadah tatkala mereka beranggapan bahwa jin dapat mendatangkan manfaat dan menghindarkan mereka dari mara bahaya. Padahal Allahlah yang menciptakan mereka, bukan yang lain. Maka Allah-lah yang paling berhak mereka sembah. Bahkan mereka secara semena-mena menyatakan bahwa Allah mempunyai anak laki-laki, seperti yang dilakukan oleh orang-orang Yahudi dengan Uzair dan orang-orang Nasrani dengan Isa. Atau menyatakan bahwa Dia mempunyai anak perempuan, seperti yang dilakukan oleh orang-orang musyrik dengan malaikat. Mahasuci Allah dari apa yang dikemukakan oleh orang-orang yang batil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Mereka menjadikan jin sebagai sekutu-sekutu Allah dalam ibadah, yaitu dengan menyembah mereka dan mentaati bisikan mereka agar menyembah berhala-berhala. Mengapa mereka menyekutukan Allah padahal dia telah menciptakan mereka yang menyembah atau yang disembah? Dan bagian dari kesesatan dan kebodohan mereka adalah membuat kebohongan bahwa Allah memiliki anak-anak laki-laki dan perempuan; Maha Suci Allah dari kebohongan dan kedustaan yang mereka buat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. وَجَعَلُوا۟ لِلّٰهِ شُرَكَآءَ الْجِنَّ (Dan mereka (orang-orang musyrik) menjadikan jin itu sekutu bagi Allah) Yakni mereka menjadikan jin sebagai sukutu-sukutu bagi Allah, sehingga mereka menyembah sekutu-sekutu tersebut dan mengagungkannya sebagaimana mereka menyembah dan mengagungkan Allah. وَخَلَقَهُمْ ۖ (padahal Allah-lah yang menciptakan jin-jin itu) Yakni mereka telah mengetahui bahwa Allah yang menciptakan jin. Atau maksudnya adalah Allah telah menciptakan apa yang mereka jadikan sebagai sekutu bagi Allah. وَخَرَقُوا۟ لَهُۥ بَنِينَ وَبَنٰتٍۭ( dan mereka membohong (dengan mengatakan): “Bahwasanya Allah mempunyai anak laki-laki dan perempuan”) Yakni membual dan mengada-ada. Orang-orang musyrik mengatakan bahwa para malaikat adalah putri-putri Allah. Dan orang-orang Nasrani mengatakan bahwa Nabi Isa adalah anak Allah. بِغَيْرِ عِلْمٍ ۚ (tanpa (berdasar) ilmu pengetahuan) Yakni berdasarkan kebodohan sesungguhnya. سُبْحٰنَهُۥ (Maha Suci Allah) Yakni penyucian bagi-Nya وَتَعٰلَىٰ (dan Maha Tinggi) Yakni Maha Tinggi dari perkataan bathil mereka dengan sifat yang mereka berikan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Dan sebagian orang-orang musyrik itu menjadikan jin sebagai sekutu Allah, lalu mereka menyembah dan mengagungkannya, sedangkan Allah adalah Dzat yang menciptakan mereka (jin), dan mereka (orang musyrik) mengetahui hal itu. Lalu bagaimana bisa makhluk menjadi sekutu Dzat yang menciptakannya? Mereka membuat-buat kebohongan dan membuatkan anak-anak laki-laki bagiNya seperti Uzair dan Isa, dan anak-anak perempuan seperti malaikat, ketika mereka beranggapan bahwa malaikat itu adalah anak-anak perempuan Allah, karena kebodohan mereka tentang Allah dan keagunganNya. Maha suci Allah, dan jauh dari apa yang digambarkan orang-orang itu, yaitu kebohongan dan kebathilan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjadikan jin sekutu-sekutu bagi Allah, padahal Dia yang menciptakannya} Sungguh Dia telah menciptakan jin {Mereka berbohong} mengada-ngada {bahwa Dia memiliki anak laki-laki dan anak perempuan, tanpa pengetahuan. Maha suci dan Maha tinggi Allah } Maha Suci {dari sifat-sifat yang mereka gambarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. Allah memberitakan walaupun Allah telah memberikan kebaikan kepada hamba-hambaNya, menjelaskan kepada mereka dengan ayat-ayat yang jelas dan hujjah yang nyata bahwa orang-orang musyirik dari kalangan Quraisy dan lain-lain mengangkat tandingan untukNya. Mereka berdoa dan beribadah kepada makhluk dari kalangan jin dan malaikat, di mana mereka dalah makhluk Allah yang tidak sedikit pun memiliki keistimewaan rububiyah dan uluhiyah. Mereka menjadikannya sebagai tandingan bagi pemilik hak penciptaan dan pemberi perintah, pemberi seluruh nikmat yang bermacam-macam, dan penolak seluruh kesulitan. Begitilah orang-orang musyirik membuat kebohongan dan kedustaan dari diri mereka bahwa Allah mempunyai anak-anak laki-laki dan perempuan tanpa dasar ilmu samal sekali. Siapkah orang-orang yanhg lebih zhalim daripada orang yanhg berkata atas Nama Allah tanpa ilmu, dan berdusta atasNya dengan menisbatkan kekurangan paling buruk di mana Allah wajib di sucikan darinya? Oleh karena itu, Allah menyucikan diriNya dari kedustaan orang-orang musyirik Dia berfirman, “Mahasuci Allah dan Maha Tinggi dari sifat-sifat yang mereka berikan.” Karena Dia adalah Allah, Dzat yang memiliki seluruh kesempurnaan yang disucikan dari segala aib, cacat, dan kekurangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 100: Dengan berdoa dan menyembah mereka. Mereka mengatakan bahwa Allah mempunyai anak seperti orang Yahudi mengatakan Uzair putera Allah dan orang musyrikin mengatakan bahwa malaikat putra-putra Allah. Mereka mengatakan demikian karena kebodohannya. Padahal siapakah yang lebih zalim daripada orang yang berkata tentang Allah tanpa ilmu dan mengadakan kedustaan terhadap-Nya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 100",
    "description": "Aneka macam bukti yang dipaparkan seperti yang disebut pada beberapa ayat di atas, agaknya belum menjadikan kaum musyrik sadar akan keyakinannya yang keliru. Salah satu bentuk keyakinan yang sesat itu diurai pada ayat ini. Dan mereka, orang-orang musyrik, menjadikan jin sekutu-sekutu Allah, padahal dia yang menciptakannya, yakni jin-jin itu, dan mereka berbohong dengan mengatakan, Allah mempunyai anak laki-laki dan anak perempuan, yaitu para malaikat. Itu mereka yakini dan ucapkan tanpa dasar ilmu pengetahuan sedikit pun. Mahasuci Allah dari segala apa yang mereka ucapkan dan yakini, dan mahatinggi dia dari sifat-sifat yang mereka gambarkan. Untuk membantah pandangan sesat di atas, ayat ini menegaskan bahwa dia, yakni Allah, pencipta langit dan bumi tanpa contoh acuan yang ditiru-Nya. Bagaimana mungkin dan atas dasar apa yang dapat dijadikan alasan dia mempunyai anak, padahal dia tidak mempunyai istri. Dalam logika kalian, hai manusia, seorang anak pastilah lahir dari seorang ibu' cobalah kalian camkan dan yakini bahwa dia menciptakan segala sesuatu dan dia juga mengetahui segala sesuatu."
  }
]