[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah Dia lah yang mengadakan langit dan bumi dan seisinya tanpa ada contoh sebelumnya. Maka bagaimana mungkin Dia mempunyai anak, padahal tidak memiliki istri? Maha tinggi Allah dari apa yang diucapkan kaum musyrikin setinggi-tingginya. Dan Dia lah Dzat yang menciptakan segala sesuatu dari ketiadaan. Tidak ada yang tersembunyi bagiNya dari perkara-perkara makhlukNya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Dia -Subḥānahu wa Ta'ālā- adalah pencipta langit dan pencipta bumi tanpa contoh sebelumnya, bagaimana mungkin Dia mempunyai anak, sementara Dia tidak mempunyai istri? Sedangkan Dia telah menciptakan segala sesuatu, dan Dia Maha Mengetahui segala sesuatu, tidak ada sesuatu pun yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Allah menciptakan langit dan bumi tanpa ada misal sebelumnya. Dan bagaimana Allah memiliki anak sedangkan Dia tidak memiliki pasangan? Allah Maha Esa, tidak ada yang serupa dengan-Nya. Dia menciptakan segala sesuatu dari ketidakadaan. tidak ada yang tersembunyi dari-Nya apa yang di langit dan di bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. بَدِيعُ السَّمٰوٰتِ وَالْأَرْضِ ۖ (Dia Pencipta langit dan bumi) Yakni yang menciptakan keduanya tanpa ada yang seperti keduanya sebelumnya, dengan pengaturan yang begitu detail. أَنَّىٰ يَكُونُ لَهُۥ وَلَدٌ (Bagaimana Dia mempunyai anak) Yakni barangsiapa yang memiliki sifat seperti ini, yang menciptakan langit, bumi, dan seisinya, bagaimana memiliki anak? Dan bagaimana menjadikan apa yang diciptakan-Nya sebagai anak. وَلَمْ تَكُن لَّهُۥ صٰحِبَةٌ ۖ (padahal Dia tidak mempunyai isteri) Dan apabila tidak mempunyai istri maka tidak mungkin memiliki anak. وَخَلَقَ كُلَّ شَىْءٍ ۖ (Dia menciptakan segala sesuatu) Dan termasuk diantaranya adalah para malaikat, nabi Isa, dan Uzair."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Allah adalah Pencipta dan Pengatur langit dan bumi dari ketiadaan yang tidak ada contohnya sebelumnya, lalu bagaimana Sang Pencipta ini memiliki orang tua, dan bagaimana bisa Dia mengambil anak dari ciptaanNya, sedangkan dia tidak bisa memiliki istri yang melahirkan anak? Dia menciptakan setiap sesuatu, termasuk malaikat, Isa Al-Masih, dan Uzair, dan Dia tidak membutuhkan apapun dan Maha Mengetahui segala sesuatu, tidak ada yang luput dariNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pencipta langit dan bumi} Pencipta langit dan bumi, tidak ada yang menyerupai sebelumnya {Bagaimana} Bagaimana {Dia mempunyai anak, padahal Dia tidak mempunyai istri} istri {Dia menciptakan segala sesuatu dan Dia Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. “Dia pencipta langit dan bumi.” Maksudnya, pencipta keduanya dengan sangat baik dan kokoh dengan penciptaan terbaik, pengaturan dan kemegahan tanpa contoh sebelumnya, dimana akal orang-orang yang berakal tidak dapat mengusulkan sepertinya. Dan Dia tidak mempunyai rekan dalam menciptakan keduanya. “Bagaimana Dia mempunyai anak padahal Dia tidak punya istri.” Maksudnya, bagaimana Dia mempunyai anak sedangkan Dia adalah Tuhan, pemilik dan tempat bergantung bagi seluruh mahkluk yang tidak beristri? Dia Mahakaya dari makhluk-makhlukNya, sementara makhluk-makhlukNya membutuhkan dan memerlukanNya, dan aank harus berasal dari jenis orang tuanya, sedangkan Allah adalah segala pencipta sesuatu dan tiada suatu makhluk pun yang menyerupai Allah dari segi manapun. Manakala Dia menyebutkan penciptaanNya yang menyeluruh terhadap seluruh makhluk, Dia menyebutkan keluasan ilmuNya terhadap makhlukNya. Dia berfirman, “Dia mengetahui segala sesuatu.” Dalam penyebutan ilmu setelah penciptaan mengandung isyarat ke dalam dalil aqli tentang ketetapan ilmuNya, yaitu makhluk-makhluk ini dengan keserasianya yang sempurna dan peciptaan yang mengagumkan hal ini benar-benar mengandung bukti atas keluasan ilmu sang pencipta dan kesempurnaan hikmahNya sebagaimana Alalh berfirman, “Apakah Allah Yang menciptakan itu tidak mengetahui (yang kamu lahirkan atau rahasiakan); dan Dia Maha Halus lagi Maha Mengetahui?” (Al-Mulk:14). Dan sebagaimana Allah berfirman, “Dan tidaklah Tuhan yang menciptakan langit dan bumi itu berkuasa menciptakan yang serupa dengan itu? Benar, Dia berkuasa. Dan Dialah Maha Pencipta lagi Maha Mengetahui.” (Yasin:81)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 101: Tanpa ada contoh sebelumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 101",
    "description": "Untuk membantah pandangan sesat di atas, ayat ini menegaskan bahwa dia, yakni Allah, pencipta langit dan bumi tanpa contoh acuan yang ditiru-Nya. Bagaimana mungkin dan atas dasar apa yang dapat dijadikan alasan dia mempunyai anak, padahal dia tidak mempunyai istri. Dalam logika kalian, hai manusia, seorang anak pastilah lahir dari seorang ibu' cobalah kalian camkan dan yakini bahwa dia menciptakan segala sesuatu dan dia juga mengetahui segala sesuatu. Setelah terbukti bahwa keyakinan mereka itu salah dan sesat, ayat ini sampai kepada kesimpulan bahwa yang memiliki sifat-sifat yang demikian mulia itulah Allah yang maha esa, tuhan pemelihara kamu; tidak ada tuhan yang berhak disembah selain dia; pencipta segala sesuatu, karena itu maka sembahlah dia; dialah pemelihara segala sesuatu."
  }
]