[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang memiliki sifat demikian itu (wahai kaum musyrikin), adalah tuhan kalian yang Maha agung lagi Maha tinggi , tiada sesembahan yang berhak dibadahi selainNya. Dia sang pencipta segala sesuatu, maka tunduklah kepadaNya dengan ketaatan dan ibadah kepadaNya. Dia Maha pemelihara lagi penjaga segala sesuatu, mengatur urusan-urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Żāt yang memiliki sifat-sifat seperti demikian itulah Rabb kalian, wahai manusia. Maka tidak ada tuhan lain selain Dia. Dan tidak ada sembahan yang benar selain Dia. Karena Dia lah Pencipta segala sesuatu, maka sembahlah Dia saja. Karena hanya Dia lah yang berhak disembah. Dan Dia Maha Menjaga segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Itulah Allah yang menciptakan langit dan bumi. Dan yang menciptakan segala sesuatu adalah Tuhan kalian, maka sembahlah Dia karena Dia berhak disembah. Dia adalah pemelihara dan penjaga segala sesuatu; Dia mengatur sendiri seluruh alam semesta tanpa memerlukan bantuan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. ذٰلِكُمُ اللهُ رَبُّكُمْ ۖ (demikian itu ialah Allah Tuhan kamu) Yakni yang memiliki sifat-sifat yang mulia seperti disebutkan sebelumnya adalah Tuhan kalian, tidak ada Tuhan bagi kalian selain-Nya, baik itu patung-patung atau berhala-berhala. فَاعْبُدُوهُ ۚ (maka sembahlah Dia) Yakni maka Dia berhak untuk disembah, dan janganlah menyembah selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Sesungguhnya yang disifati menggunakan sifat-sifat sebelumnya itu adalah Allah, Tuhan kalian yang merupakan satu-satunya Tuhan yang Esa, tiada Tuhan bagi kalian selain Dia. Dialah Dzat yang Maha Menciptakan setiap sesuatu. Jadi Dialah yang berhak untuk disembah, maka sembalah Dia. Dan Dia itu Maha Mengawasi segala sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah Allah Tuhan kalian. Tidak ada tuhan selain Dia, pencipta segala sesuatu. Maka sembahlah Dia. Dialah pemelihara segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Dzat yang menciptakan apa yang diciptakan dan mementukan apa yang dietntukan, “Dia-lah Allah Tuhanmu,” maksudnya, Dzat yang dipertuhankan dan disembah, yang berhak mendapatkan ketundukan dan kecintaan sempurna. Tuhan yang mengurusi seluruh makhluk dengan melimpahkan nikmat-nikmatNya dan menolak seluruh kesuliatn dari mereka. Dia adalah pencipta segala sesuatu yang tidak ada Tuhan yang berhak disembah selain Dia. “Maka sembahlah Dia.” Maksdunya, jika telah terbukti dengan meyakinkan bahwa tiada Tuhan yang berhak disembah kecuali Dia, maka berikan kepadaNya segala bentuk ibadah, ihklaskan ia untukNya, dan maksudkanlah untuk wajahNya, karena ini maksud dari pencipataan manusia, “Dan aku tidak menciptakan jin dan manusia melainkan supaya mereka mengabdi kepada-Ku.” (Adz-Dzariyat:56). “Dan Dia adalah pemelihara segala sesuatu .” maksudnya, segala sesuatu dibawah pemeliharaan dan pengawasan Allah, baik dari segi penciptaan, panataan, dan pengaturan. Sudah diketahui bahwa perkara yang diatur, kesempurnaanNya kelengkapan dan keserasianNya tergantung kepada keadaan pemeliharanya, dan pemeliharaan Allah terhadap sesuatu tidak seperti pemeliharaan makhluk, karena pemeliharan akhluk adalah pemeliharaan yang bersifat penggantian, dan pelaksanaanNya hanya menginduk kepada pemberi hak pemeliharaan tersebut. Lain halnya dengan Allah Yang Maha Pencipta, pemeliharaNya adalah berasal dari DiriNya sendiri untuk DiriNya, yang mencakup kesempurnaan ilmu, kebaikan pengurusan dan adil. Maka tidak seorang pun yang mungkin mengritik Allah dan tidak mungkin melihat kekurangan tidak juga kelemahan pada makhluk pencitanNya dan tidak pulah ketimpang cacat pada pengaturanNya. Di antara pemeliharan Allah adalah bahwa dia menjelaskan agamanNya dan menjaganya dari perkara-perkara yang bisa menghapus dan merubahnya, dan bahwa Dia-lah yang menjaga orang-orang Mukmin dan memelihara mereka dari perkara-perkara yang merusak iman dan akidahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 102: Pencipta, Pemberi rezki dan Pengatur alam semesta. Oleh karena itu, arahkanlah ibadah hanya kepada-Nya. Segala sesuatu di bawah pemeliharaan Allah dan pengaturan-Nya, termasuk pemeliharaan-Nya adalah dengan menerangkan agama-Nya, menjaganya dari semua yang dapat menhilangkan dan merubah agama itu, demikian juga Dia memelihara kaum mukmin dari segala yang dapat menyingkirkan iman dan agama mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 102",
    "description": "Setelah terbukti bahwa keyakinan mereka itu salah dan sesat, ayat ini sampai kepada kesimpulan bahwa yang memiliki sifat-sifat yang demikian mulia itulah Allah yang maha esa, tuhan pemelihara kamu; tidak ada tuhan yang berhak disembah selain dia; pencipta segala sesuatu, karena itu maka sembahlah dia; dialah pemelihara segala sesuatu. Untuk lebih menguatkan uraian sifat-sifat Allah seperti yang disebut sebelumnya, Allah lalu menyatakan bahwa dia tidak dapat dicapai dalam bentuk apa pun oleh penglihatan mata, sedang dia dapat menjangkau dan melihat dengan sejelas-jelasnya segala penglihatan itu, dan dialah yang mahahalus sehingga tidak dapat dilihat oleh makhluk, lagi mahateliti sehingga dapat melihat segala sesuatu."
  }
]