[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kamu tidak dapat melihat Allah oleh penglihatan mata di dunia(ini). Adapun di akhirat, sesungguhnya kaum mukminin akan dapat melihat tuhan mereka tanpa ada dinding penghalang, sedang Dia dapat melihat semua penglihatan dan meliputinya, serta mengetahuinya sesuai dengan apa adanya. Dan Dia maha lembut terhadap para kekasihNya, lagi maha teliti yang Maha mengetahui perkara-perkara yang samar dan detail."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Dia tidak dapat diliputi (diketahui secara menyeluruh) oleh penglihatan mata, sedangkan Dia -Subḥānahu- dapat menangkap dan meliputi penglihatan mata. Dan Dia Mahalembut terhadap hamba-hamba-Nya yang saleh lagi Maha Mengetahui perihal mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Allah tidak menyerupai sesuatupun yang ada di alam semesta, sehingga penglihatan di dunia tidak dapat meliputi-Nya, karena Dia tidak dapat diliputi waktu dan tempat. Adapun di akhirat orang-orang beriman akan melihat Tuhan mereka sebagaimana dalam firman Allah: وجوه يومئذ ناضرة. إلى ربها ناظرة “wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri, kepada Tuhannyalah mereka melihat” Allah Maha lembut kepada hamba-hamba-Nya dan Maha Mengetahui amal perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. لَّا تُدْرِكُهُ الْأَبْصٰرُ (Dia tidak dapat dicapai oleh penglihatan mata) Yakni Dia tidak dilihat seorangpun di dunia ini, tidak dapat dicapai hakikat diri-Nya dengan penglihatan. Dan Dia dapat dilihat oleh orang-orang beriman di akhirat namun tidak dapat meliputi seluruh Dzat-Nya, sebagaimana firman-Nya: وجوه يومئذ ناضرة إلى ربها ناظرة “Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri. Kepada Tuhannyalah mereka melihat”. Dan kemungkinan penglihatan orang mukmin kepada Allah di akhirat telah termaktub dalam hadist-hadist yang diriwayatkan secara mutawattir sehingga tidak ada keraguan dan syubhat dalam kebenarannya. وَهُوَ يُدْرِكُ الْأَبْصٰرَ ۖ( sedang Dia dapat melihat segala yang kelihatan) Yakni meliputinya dan mencapai hakikatnya. Tidak ada yang tersembunyi bagi-Nya hal yang tersembunyi. وَهُوَ اللَّطِيفُ (dan Dialah Yang Maha Halus) Yakni lemah lembut terhadap hamba-hamba-Nya. Pendapat lain mengatakan makna (اللطيف) yakni mengetahui segala rahasia dengan mudah. الْخَبِيرُ (lagi Maha Mengetahui) Yakni yang meliputi segala sesuatu dengan mengetahui segala yang lahir dan yang batin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Dia (Allah) tidak bisa dilihat dengan penglihatan di dunia, tidak pula mereka bisa mengawasinya di akhirat. Dan orang-orang mukmin itu mampu melihatNya karena firmanNya: {Wujuuhun yaumaidzin naadhirah, Ilaa rabbihaa nazhirah} [Surah Al-Qiyamah, 75/22-23] dan (riwayat) penglihatan itu dikuatkan dengan hadits-hadits mutawatir. Hanya Allahlah yang mampu mengawasi dengan penglihatanNya. Dialah Dzat yang mengawasi hamba-hambaNya dan Maha Memberitahu tentang perkara-perkaraa ciptaanNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia tidak dapat dijangkau oleh penglihatan mata} Dia tidak bisa dijangkau oleh penglihatan {sedangkan Dia dapat menjangkau segala penglihatan itu} Dia menjangkau dan meliputi pengelihatan dengan ilmuNya {Dialah Yang Maha Lembut lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. “Dia tidak dapat di capai oleh penglihatan mata,” karena kebesaran, keagungan dan kesempurnaanNya, maksudnya, mata penglihatan tidak bisa mengetahuiNya dari segala segi walaupun mata bisa melihatNya, dan bergembira melihat kepada wajahNya yang mulia. Penafian terhadap pengetahua tidak berarti manafikan penglihatan, justru ia menetapkanNya dengan cara pemahaman (mafhum), karena ketika ayat tersebut manfikan “pengetahuan” (idrak) yang mana ia merupakan sifat penglihatan (Ru’yah) yang paling khusus, maka hal itu menunjukan bahwa penglihatan adalah tetap (tsabit) dan tidak dinafikan. Seandanyai ayat ini hendak menafikan penglihatan niscaya ia akan mengatakan, “Tidak dilihat oleh mata,” atau ucapan lain yang sejenis. Dari sini di ketahui bahwa ayat ini tidak terdapat dalil yang mendukung pendapat para pengingkar sifat Allah yang meniadakan kemungkinan melihat Allah di Akhirat. Justru ayat ini mengandung bantahan terhadap pendapat tersebut. “Sedang Dia dapat melihat penglihatan itu.” Maksudnya, Dia-lah yang ilmuNya meliputi lahir dan batin. pendengaranNya meliputi seluruh suara yang samar dan yang jelas, dan penglihatanNya meliputi segala yang terlihat, baik kecil maupun yang besar. Oleh karenya, Dia befirman, “Dan Dia-lah Yang Mahaluas dan Maha Mengetahui.” Maksudnya,ilmu dan pengetahuannya cermat dan teliti sehingga Dia mengetahui sesuatu yang rahasia, yang samar, yang tersembunyi dan yang tersimpan. Dan diantara kelembutan Allah adalah bahwa dia membimbing hamba-hambaNya kepada kemaslahatan agamaNya, mengantarkannya dengan cara dimana hamba itu tidak merasa dan tidak berusaha padanya. Dia mengantarkannya pada kebahagiaan abadi dan keberuntungan yang kekal dari arah yang tidak terduga, bahkan dia mentakdirkan perkara-perkara yang tidak disukai dan tidak di rasa oleh hamba sehingga dia memohon kepadanya agar menyembuhkanNya. Hal tersebut bahwa dia mengetahui agamanNya, lebih baik dan bahwa kesempurnaan agamanya bergantung kepada ujian tersebut. Mahasuci Allah Yang Mahalembut kepada apa yang Dia kehendaki, Maha Penyayang kepada orang-orang Mukmin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 103: Tidak ada seorang pun yang dapat melihat Allah di dunia. Adapun di akhirat, maka kaum mukmin akan melihat Allah Subhaanahu wa Ta'aala. Rasulullah shallallahu 'alaihi wa sallam bersabda: « إِنَّكُمْ سَتَرَوْنَ رَبَّكُمْ كَمَا تَرَوْنَ هَذَا الْقَمَرَ لاَ تُضَامُّونَ فِى رُؤْيَتِهِ ، “Sesungguhnya kamu akan melihat Tuhan kamu sebagaimana kamu melihat bulan (purnama) ini, kamu tidak berdesakan dalam melihat-Nya.” (HR. Bukhari-Muslim) Ilmu-Nya meliputi segala yang nampak maupun yang tersembunyi, pendengaran-Nya mendengar semua suara yang keras maupun yang rahasia, dan penglihatan-Nya melihat semua yang terlihat, besar maupun kecil. Oleh karenanya Dia Mahahalus lagi Mahateliti sehingga segala yang tersembunyi atau samar bagi manusia, tidak samar dan tidak tersembunyi bagi-Nya. Di antara kelembutan-Nya adalah Dia mengarahkan hamba-Nya kepada hal yang bermaslahat bagi agamanya, menyampaikannya dengan cara-cara yang tidak disadari hamba, mengarahkannya kepada kebahagiaan abadi dari arah yang tidak diperkirakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 103",
    "description": "Untuk lebih menguatkan uraian sifat-sifat Allah seperti yang disebut sebelumnya, Allah lalu menyatakan bahwa dia tidak dapat dicapai dalam bentuk apa pun oleh penglihatan mata, sedang dia dapat menjangkau dan melihat dengan sejelas-jelasnya segala penglihatan itu, dan dialah yang mahahalus sehingga tidak dapat dilihat oleh makhluk, lagi mahateliti sehingga dapat melihat segala sesuatukemampuan penglihatan manusia amat terbatas seperti diisyaratkan oleh ayat sebelum ini. Namun demikian, manusia dianugerahi oleh Allah dengan mata batin. Ayat ini menegaskan bahwa sungguh, bukti-bukti yang nyata dan sangat jelas telah datang dari tuhanmu yang disampaikan melalui wahyu. Barang siapa melihat kebenaran itu dengan mata hatinya, maka manfaatnya bagi dirinya sendiri, bukan untuk orang lain, dan barang siapa buta mata batinnya dan tidak melihat kebenaran itu, maka dia sendiri-lah yang akan rugi, bukan orang lain. Dan aku, yakni nabi Muhammad, bukanlah penjaga-Mu, tetapi aku hanya sekadar menyampaikan nasihat."
  }
]