[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”sungguh telah datang kepada kalian bukti-bukti nyata yang kalian dapat melihat dengannya petunjuk dari kesesatan, termuat dalam al-qur’an, dan Rasulullah telah membawanya. Maka barangsiapa yang dapat melihatnya dengan jelas dan mengimani kandungan petunjuknya, maka manfaat nya kembali kepada dirinya. Dan barangsiapa tidak melihat hidayah setelah muncul dengan jelas di hadapannya, maka dia telah berbuat jahat terhadap dirinya. Dan aku bukanlah seorang pemelihara atas kalian, yang menghitung amal perbuatan kalian. Aku hanyalah penyampai risalah semata, dan Allah lah yang memberikan hidayah kepada siapa saja yang dikehendakiNya dan menyesatkan siapa saja yang dikehendakiNya, berdasarkan ilmu dan hikmahNya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Sungguh telah datang kepada kalian -wahai manusia- hujah-hujah yang jelas dan bukti-bukti yang nyata dari Rabb kalian. Siapa yang mau memahaminya dan mendengarkannya dengan seksama, maka manfaatnya akan kembali kepada dirinya. Dan siapa yang menutup mata terhadapnya, tidak mau memahaminya dan tidak mau mendengarkannya dengan seksama, maka dampak buruknya akan kembali pada dirinya saja. Dan aku bukanlah pengawas bagi kalian yang bertugas menghitung amal perbuatan kalian. Sesungguhnya aku hanyalah seorang utusan dari Tuhanku. Dia lah yang menjadi pengawas bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Hai manusia, telah datang kepada kalian bukti-bukti dan hujjah-hujjah yang jelas; barangsiapa yang mengambil manfaat dan memperoleh hidayah darinya maka kebaikannya bagi diri sendiri; dan barangsiapa yang berpaling dan enggan mengambil hidayah darinya maka akibat buruknya akan kembali kepada dirinya sendiri. Dan aku bukanlah pengawas yang menghitung amal perbuatan kalian, namun aku hanyalah seorang rasul yang diutus untuk menyampaikan risalah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. قَدْ جَآءَكُم بَصَآئِرُ مِن رَّبِّكُمْ ۖ (Sesungguhnya telah datang dari Tuhanmu bukti-bukti yang terang) Yakni hujjah-hujjah dan bukti-bukti yang jelas, siapa yang mau memahaminya niscaya dia akan melihat kebenaran. Dan bukti-bukti ini terdapat dalam al-qur’an di surat ini dan surat lainnya. فَمَنْ أَبْصَرَ فَلِنَفْسِهِۦ ۖ (maka barangsiapa melihat (kebenaran itu), maka (manfaatnya) bagi dirinya sendiri) Barangsiapa yang mau memahami hujjah dan mematuhinya niscaya manfaatnya bagi dirinya. وَمَنْ عَمِىَ (dan barangsiapa buta) Yakni buta terhadap hujjah dan tidak mau memahami dan mematuhinya maka mudharatnya akan kembali kepadanya. وَمَآ أَنَا۠ عَلَيْكُم بِحَفِيظٍ (Dan aku (Muhammad) sekali-kali bukanlah pemelihara(mu)) Yakni mengawasi kalian dan menghitung amalan-amalan kalian. Namun aku hanya seorang rasul yang menyampaikan risalah tuhanku dan Dia-lah yang mengawasi kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَدْ جَاءَكُمْ بَصَائِرُ مِنْ رَبِّكُمْ ۖ فَمَنْ أَبْصَرَ فَلِنَفْسِهِ ۖ وَمَنْ عَمِيَ فَعَلَيْهَا } \"Sesungguhnya telah datang dari Tuhanmu bukti-bukti yang terang; maka barangsiapa melihat (kebenaran itu), maka (manfaatnya) bagi dirinya sendiri; dan barangsiapa buta (tidak melihat kebenaran itu), maka kemudharatannya kembali kepadanya\" { فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ } \"Maka ambillah (kejadian itu) untuk menjadi pelajaran, hai orang-orang yang mempunyai wawasan\" Hendaknya setiap muslim ketika membaca al-qur'an senantisa mengambil pelajaran dari tiap-tiap ayat yang ia baca, dengan tadabbur ayat ia akan mendapat suatu kebaikan yang belum ia dapatkan sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Wahai manusia, sungguh telah datang kepada kalian bukti-bukti nyata dari Tuhan kalian yang menunjukkan pada tuhanan dan keesaahNya, dan itu terkandung dalam Al-Qur’an. Barangsiapa memikirkannya, maka dia akan mengenali kebenaran, dan barangsiapa melihat kebenaran, memikirkan tentang hujjahnya, dan beriman, maka sungguh kebaikan telah diberikan kepadanya, dan barangsiapa menutup mata dari hujjah itu dan tidak mau memikirkannya, maka sungguh kemudharatan akan menimpa dirinya. Dan aku sebagai seorang rasul tidaklah pengawas yang menghitung amal perbuatan kalian, melainkan hanya memberi peringatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh telah datang kepada kalian bukti-bukti nyata} dalil-dalil yang dapat dilihat {dari Tuhan kalian. Siapa saja yang melihat} memikirkan dan mematuhi dalil-dalil itu {maka itu bagi dirinya sendiri} maka bermanfaat bagi dirinya {dan siapa saja yang buta} siapa aja yang tidak memikirkan dan mematuhinya {maka bagi dirinya sendiri} maka akibat buruknya bagi dirinya sendiri {dan aku bukanlah pengawas kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. “Sungguh bukti-bukti yang terang telah datang dari Rabbmu, maka barangsiapa yang melihat kebenaran itu, maka manfaatnya bagi dirinya sendiri, dan barangsiapa yang tidak melihat kebenaran itu, maka kemudaratannya kembali kepadanya. Dan aku (maksudnya Muhammad) sekali-kali bukanlah pemeliharamu,” manakala Allah menejaskan ayat-ayat yang jelas dan bukti-bukti yang nyat yang jelas yang menunjukan dalam kebenaran dalam tuntunan dan tujuan, maka dia mengingatkan hamba-hambaNya terhadapnya dan Dia menyatakan bahwa petunjuk dan kesesatan mereka adalah untuk mereka sendiri. Dia berfirman, “Sungguh telah datang dari Tuhanmu bukti-bukti yang terang.” Masudnya, ayat-ayat yang menjelaskan kebenaran dan menjadikannya di dalam hati seperti matahari bagi mata karena sesuatu yang dikandunnya, berupa kefasihan dan kegamblangan di tambah dengan kesesuainnya dengan makna-makna yang mulia dan hakikat yang indah karena ia datang dari tuhan yang mengatur makhluk dengan seluruh nikmatNya, lahir dan batin dimana yang -paling utama dan paling berharga adalah penjelasan ayat-ayat dan keterangan tentang persoalan-persoalan yang dibutuhkan. “Maka barangsiapa melihat kebenaran itu,” maksudnya dengan ayat-ayat itu tempat-tempat pelajaran dan beramal dengan sesuatu yang ditunjukan, “maka manfaatnya bagi dirinya sendiri.” Karena Allah adalah Dzat yang Mahakaya lagi Maha terpuji. Dan barangsiapa buta, dia di tunjukan, akan tetapi ia tidak membuka matanya, di peringatkan tetapi tidak mengindahkan, dijelaskan kebenaran kepadanya tetapi dia menolak tunduk dan mengikutinya, maka mudarat kebutaan itu akan menimpa diri sendiri. Katakanlah wahai Rasul, “Dan aku bukanlah,” maksudnya, yakni, Rasululoh “pemeliharamu.” Maksudnya, memelihara dan mengawasi amalmu secara terus menerus. Akan tetapi tugasku hanyalah menyampaikan dengan jelas, dan aku telah melaksanakannya dan menyampaikan apa yang Allah turunkan kepadaku. Inilah tugasku dan yang selain itu bukanlah urusanku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 104: Ketika Allah Ta’ala telah menunjukkan bukti-bukti yang nyata dan dalil-dalil yang jelas yang menunjukkan kebenarannya, maka dalam ayat ini Alah menerangkan bahwa hidayah atau kesesatan yang diperoleh adalah untuk dirinya sendiri. Bukti-bukti tersebut saking jelasnya seperti matahari di siang hari. Maksudnya barang siapa mengetahui kebenaran lalu mengamalkannya dengan beriman dan beramal saleh, serta mengikuti petunjuk, maka dia telah mencapai puncak kebahagiaan. Aku hanyalah pemberi peringatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 104",
    "description": "Kemampuan penglihatan manusia amat terbatas seperti diisyaratkan oleh ayat sebelum ini. Namun demikian, manusia dianugerahi oleh Allah dengan mata batin. Ayat ini menegaskan bahwa sungguh, bukti-bukti yang nyata dan sangat jelas telah datang dari tuhanmu yang disampaikan melalui wahyu. Barang siapa melihat kebenaran itu dengan mata hatinya, maka manfaatnya bagi dirinya sendiri, bukan untuk orang lain, dan barang siapa buta mata batinnya dan tidak melihat kebenaran itu, maka dia sendiri-lah yang akan rugi, bukan orang lain. Dan aku, yakni nabi Muhammad, bukanlah penjaga-Mu, tetapi aku hanya sekadar menyampaikan nasihat. Setelah mengingatkan tugas nabi Muhammad, kelompok ayat ini ditutup dengan pernyataan Allah sebagai berikut. Dan demikianlah kami menjelaskan berulang-ulang ayat-ayat sebagai bukti-bukti kekuasaan kami, baik berupa fenomena yang tergelar di alam semesta maupun yang tertulis di dalam Al-Qur'an, agar orang beriman dapat meraih petunjuk. Hal tersebut mengakibatkan orang-orang musyrik mengatakan, engkau telah mempelajari ayat-ayat itu dari ahli kitab atau siapa pun. Dan hal itu juga bertujuan agar kami menjelaskan Al-Qur'an itu kepada orang-orang yang mengetahui."
  }
]