[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagiamana dalam al-qur’an ini kami telah menjelaskan kepada kaum musyrikin bukti-bukti nyata dalam perkara tauhid, kenabian dan tempat kembali (akhirat), kami (juga) menerangkan bukti-bukti kepada mereka tentang segala yang tidak mereka ketahui, tetapi mereka justru mengatakan dengan berdusta , ”Engkau telah belajar dari ahli kitab” Dan agar kami menjelaskan kebenaran melalui pengulangan ayat-ayat yang kami lakukan, kepada kaum yang mengetahuinya, kemudian mereka terima dan ikuti. Mereka itu adalah orang-orang yang beriman kepada Rasulullah, Muhammad dan wahyu yang diturunkan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Di samping memberikan beragam dalil dan bukti yang menunjukkan kekuasaan Allah, Kami juga memberikan beragam ayat yang berisi janji, ancaman, serta peringatan. Dan orang-orang musyrik akan mengatakan, “Ini bukan wahyu, tetapi kamu mempelajarinya dari kitab yang ada sebelumnya.” Dan Kami hendak menjelaskan fakta yang benar kepada umat manusia melalui beragam ayat yang Kami berikan kepada orang-orang mukmin dari kalangan umat Muhammad -ṣallallāhu 'alaihi wa sallam-. Karena merekalah yang bisa menerima dan mengikuti kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Demikianlah Kami mengulang-ulang ayat-ayat al-Qur'an sebagai petunjuk bagi manusia yang mencari petunjuk dan jalan yang lurus. Adapun orang-orang yang telah buta hati mereka dan tidak mendapat manfaat dari ayat-ayat tersebut maka mereka akan berkata: \"Hai Muhammad, Sebenarnya kamu mempelajari ayat-ayat ini dari ahli kitab.\" Dan dengan pengulangan ayat-ayat ini kami menjelaskan petunjuk dan kebenaran bagi orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. وَكَذٰلِكَ نُصَرِّفُ الْءَايٰتِ (Demikianlah Kami mengulang-ulangi ayat-ayat Kami) Dengan janji pemberian balasan dan ancaman, pengajaran dan peringatan. وَلِيَقُولُوا۟ دَرَسْتَ(dan supaya orang-orang musyrik mengatakan: “Kamu telah mempelajari ayat-ayat itu (dari Ahli Kitab)”) Dan orang-orang musyrik apabila mendengar penjelasan ini akan mengatakan bahwa kamu hai Muhammad tidak mendatangkan hal ini (dari Tuhanmu), namun kamu mempelajari ilmu ahli kitab dan belajar dari mereka. وَلِنُبَيِّنَهُۥ (dan supaya Kami menjelaskannya) Yakni menjelaskan al-qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Seperti halnya penjelasan yang telah disebutkan itu, Kami akan menerangkan ayat-ayat itu (lagi) dengan cara yang berbeda-beda sesuai janji dan peringatan itu supaya mereka belajar. Dan sungguh akibat perkara tersebut, orang-orang kafir akan berkata: “Wahai Muhammad, sesungguhnya kamu telah mempelajari ilmu-ilmu ahli kitab, sehingga kamu (bisa membawa Al-Qur’an ini” dan supaya Kami akan menjelaskan Al-Qur’an bagi kaum yang mengerti tentang kebenaran lalu mengikutinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pengawas yang menghitung amal kalian {Demikianlah Kami menjelaskan} merincikan {ayat-ayat Kami dan agar mereka mengatakan,“Kamu telah mempelajari} kamu telah mempelajari orang-orang sebelummu yaitu Ahlul kitab dan telah mengambil pelajaran dari mereka {dan agar Kami menjelaskannya} supaya Kami menjelaskan kebenaran {kepada kaum yang mengetahui"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 105",
    "description": "Setelah mengingatkan tugas nabi Muhammad, kelompok ayat ini ditutup dengan pernyataan Allah sebagai berikut. Dan demikianlah kami menjelaskan berulang-ulang ayat-ayat sebagai bukti-bukti kekuasaan kami, baik berupa fenomena yang tergelar di alam semesta maupun yang tertulis di dalam Al-Qur'an, agar orang beriman dapat meraih petunjuk. Hal tersebut mengakibatkan orang-orang musyrik mengatakan, engkau telah mempelajari ayat-ayat itu dari ahli kitab atau siapa pun. Dan hal itu juga bertujuan agar kami menjelaskan Al-Qur'an itu kepada orang-orang yang mengetahui. Sungguh luar biasa wahyu dari Allah, sehingga kaum musyrik pun menuduh nabi mengambilnya dari sumber lain. Maka wajar kalau Allah memerintahkan kepada nabi dan kaum mukmin untuk mengikuti wahyu-Nya. Ikutilah apa yang telah diwahyukan tuhanmu kepadamu, wahai nabi Muhammad, tidak ada tuhan yang berhak disembah selain dia; dan berpalinglah dari orang-orang musyrik, yakni dengan cara tidak mempedulikan gangguan dari mereka."
  }
]