[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ikutilah (Wahai rasul), apa yang kami wahyukan kepadamu berupa perintah-perintah dan larangan-larangan dimana yang paling agung ialah mentauhidkan Allah dan mendakwahkannya. Dan jangan pedulikan penentangan keras kaum usyrikin dan klaim batil mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Ikutilah -wahai Rasul- kebenaran yang diwahyukan Rabb-mu kepadamu. Karena Dia lah satu-satunya Rabb yang berhak disembah. Dan jangan menyibukkan hatimu dengan penolakan yang ditunjukkan orang-orang kafir. Serahkanlah urusan mereka kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Hai Muhammad, Ikutilah wahyu yang datang dari Tuhanmu berupa al-Qur'an. Dia yang mengatur alam semesta tanpa ada sekutu bagi-Nya. Dan janganlah kamu menyibukkan hati dan pikiranmu untuk memikirkan mereka, namun sibukkanlah diri untuk beribadah dan berzikir kepada-Nya. Dan berpalinglah dari orang-orang musyrik dan perkataan-perkataan mereka yang penuh dengan kebatilan dan kedustaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. اتَّبِعْ مَآ أُوحِىَ إِلَيْكَ مِن رَّبِّكَ ۖ (Ikutilah apa yang telah diwahyukan kepadamu dari Tuhanmu) Allah memerintahkan Rasulullah agar tidak menyibukkan pikirannya dengan urusan mereka, namun menyibukkan diri dalam mengikuti apa yang telah diperintahkan Allahkepadanya. وَأَعْرِضْ عَنِ الْمُشْرِكِينَ (dan berpalinglah dari orang-orang musyrik) Dan hukum ini berlaku sebelum diturunkannya ayat yang mewajibkan memerangi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Wahai Nabi, ikutilah apa yang diwahyukan Allah kepadamu, dan bersaksilah bahwa tiada Tuhan selain Dia, dan hindarilah perdebatan dan permusuhan dengan orang-orang musyrik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ikutilah apa yang telah diwahyukan dari Tuhanmu kepadamu. Tidak ada tuhan selain Dia. dan berpalinglah dari orang-orang musyrik"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 106",
    "description": "Sungguh luar biasa wahyu dari Allah, sehingga kaum musyrik pun menuduh nabi mengambilnya dari sumber lain. Maka wajar kalau Allah memerintahkan kepada nabi dan kaum mukmin untuk mengikuti wahyu-Nya. Ikutilah apa yang telah diwahyukan tuhanmu kepadamu, wahai nabi Muhammad, tidak ada tuhan yang berhak disembah selain dia; dan berpalinglah dari orang-orang musyrik, yakni dengan cara tidak mempedulikan gangguan dari mereka. Sikap kaum musyrik yang menolak dakwah nabi Muhammad menjadikan beliau bersedih. Ayat ini dimaksudkan untuk menghibur nabi Muhammad. Dan sekiranya Allah menghendaki, niscaya mereka tidak mempersekutukan-Nya, dan itu mudah bagi-Nya. Namun Allah tidak menghendaki manusia beriman karena dipaksa, melainkan memberikan pilihan agar manusia beriman karena kesadarannya. Dan Allah kemudian menegaskan kembali dengan berfirman, kami tidak menjadikan engkau penjaga mereka karena kamilah yang mengawasi mereka; dan engkau bukan pula pemelihara mereka."
  }
]