[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya Allah menghendaki kaum musyrikin tidak bertaubat syirik, niscaya mereka tidak akan menyekutukan Allah. Akan tetapi, Allah maha mengetahui apa yang terjadi kepada mereka, berupa buruknya pilihan yang mereka tentukan dan keinginan-keinginan yang menyimpang yang mereka perturutkan. Dan kami tidak menjadikan engkau (wahai rasul), sebagai pemelihara amal perbuatan mereka, dan kamu bukan penanggung jawab atas mereka yang mengurusi pengaturan kemaslahatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Sekiranya Allah berkehendak membuat mereka tidak menyekutukan-Nya dengan siapa pun, niscaya mereka tidak akan menyekutukan-Nya dengan siapa pun. Dan Kami tidak menjadikanmu -wahai Rasul- sebagai pengawas yang bertugas menghitung amal perbuatan mereka. Dan kamu bukanlah penilai bagi mereka. Sesungguhnya kamu hanyalah seorang rasul, tugasmu hanyalah menyampaikan pesan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Allah memiliki hikmah dalam kehendak dan pilihan-Nya. Dia tidak ditanya tentang apa yang Dia lakukan namun merekalah yang akan ditanya tentang apa yang telah mereka lakukan. Allah memiliki hikmah saat membiarkan mereka dalam kesesatan. Hai Muhammad, seandainya Allah menghendaki agar mereka tidak berbuat syirik niscaya Allah akan menciptakan seluruh manusia menjadi orang-orang beriman seperti malaikat. Namun Allah menghendaki untuk menciptakan mereka dengan kesanggupan beriman atau kafir dan berbuat ketaatan atau kefasikan, karena manusia telah diberi Allah kemampuan untuk memilih, sehingga orang kafir melakukan segala perbuatannya dengan pilihannya sendiri dan bukan karena terpaksa. Kamu tidak akan mampu untuk menjaga mereka dari azab Allah dan kamu bukanlah orang yang menilai urusan dan maslahat mereka, namun kamu hanyalah orang yang menyampaikan risalah dari Tuhanmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. وَلَوْ شَآءَ اللهُ مَآ أَشْرَكُوا۟ ۗ (Dan kalau Allah menghendaki, niscaya mereka tidak memperkutukan(Nya)) Yakni Allah berkuasa untuk menjadikan mereka semuanya beriman dan tak menyekutukan-Nya, karena hal itu berada di tangan-Nya; maka janganlah memperhatikan mereka dengan perhatian penuh. Dalam ayat ini terkandung bahwa kesyirikan merupakan bagian dari kehendak Allah. وَمَا جَعَلْنٰكَ عَلَيْهِمْ حَفِيظًا ۖ (Dan Kami tidak menjadikan kamu pemelihara bagi mereka) Yakni pengawas. وَمَآ أَنتَ عَلَيْهِم بِوَكِيلٍ(dan kamu sekali-kali bukanlah pemelihara bagi mereka) Yakni kamu bukanlah penilai apa yang bermanfaat untuk kamu berikan kepada mereka. Tugasmu hanyalah menyampaikan risalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Sesungguhnya Allah mampu menjadikan seluruh manusia mukmin, tidak musyrik. Jadi jika Dia berkehendak untuk memberi petunjuk orang-orang musyrik, maka mereka tidak akan menyekutukanNya dengan siapapun dalam beribadah. Dan Kami tidak menjadikanmu sebagai pengawas mereka wahai Nabi, sehingga kamu bisa membalas perbuatan mereka. Dan kamu itu bukanlah orang yang bertanggung jawab atas perkara mereka, sehingga kamu harus membuat mereka beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menghendaki, niscaya mereka tidak berbuat syirik. Kami tidak menjadikanmu pengawas mereka} pengawas {dan bukan penanggung jawab mereka} pemberi nilai"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 107: Sehingga kamu harus memaksa mereka beriman. Hal ini menurut pengarang Tafsir Al Jalaalain, adalah sebelum ada perintah memerangi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 107",
    "description": "Sikap kaum musyrik yang menolak dakwah nabi Muhammad menjadikan beliau bersedih. Ayat ini dimaksudkan untuk menghibur nabi Muhammad. Dan sekiranya Allah menghendaki, niscaya mereka tidak mempersekutukan-Nya, dan itu mudah bagi-Nya. Namun Allah tidak menghendaki manusia beriman karena dipaksa, melainkan memberikan pilihan agar manusia beriman karena kesadarannya. Dan Allah kemudian menegaskan kembali dengan berfirman, kami tidak menjadikan engkau penjaga mereka karena kamilah yang mengawasi mereka; dan engkau bukan pula pemelihara mereka ayat ini secara khusus ditujukan kepada kaum muslim tentang bagaimana seharusnya bersikap menghadapi sesembahan kaum musyrik. Dan janganlah kamu, wahai kaum muslim, memaki sesembahan seperti berhala-berhala dan lainnya yang mereka sembah selain Allah, karena jika kamu memakinya, maka akibatnya mereka nanti akan memaki Allah dengan melampaui batas atau tanpa berpikir dan tanpa dasar pengetahuan. Demikianlah, sudah menjadi sebuah ketentuan yang berlaku sepanjang masa bahwa kami jadikan setiap umat menganggap baik pekerjaan mereka. Mereka harus mempertanggungjawabkan perbuatan mereka. Kemudian pada saat yang telah ditentukan, kepada tuhan tempat kembali mereka, lalu dia akan memberitahukan kepada mereka apa yang telah mereka kerjakan untuk mendapatkan balasan yang setimpal."
  }
]