[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian (wahai kaum muslimin), mencaci maki berhala-berhala yang disembah kaum musyrikin (sebagai bentuk antisipasi) sehingga tidak menyebabkan mereka memaki-maki Allah atas dasar kebodohan dan permusuhan mereka tanpa pengetahuan. Sebagaimana kami menjadikan mereka memandang baik perbuatan-perbuatan buruk mereka sebagai hukuman atas buruknya pilihan mereka, kami pun menjadikan tiap-tiap umat manusia memandang baik perbuatan mereka. Kemudian kepada tuhan mereka, tempat kembali mereka semua. Maka Allah memberitahukan kepada mereka tentang perbuatan-perbuatan mereka yang dahulu mereka perbuat di dunia. kemudian Allah membalas mereka atas perbuatan-perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Janganlah kalian -wahai orang-orang mukmin- mencaci-maki berhala-berhala yang disembah oleh orang-orang musyrik bersama Allah. Walaupun berhala-berhala itu adalah sesuatu yang paling hina dan paling pantas dicaci-maki. Supaya orang-orang musyrik itu tidak mencaci-maki Allah secara semena-mena dan tidak mengetahui apa yang patut bagi-Nya -Subḥānahu-. Sebagaimana mereka yang memandang baik kesesatan yang mereka anut, Kami pun membuat tiap-tiap umat memandang baik perbuatannya masing-masing, baik perbuatan itu sebenarnya baik maupun buruk. Maka mereka pun melakukan perbuatan yang mereka pandang baik itu, kemudian mereka akan dikembalikan kepada Rabb mereka kelak di hari Kiamat. Lalu Rabb mereka akan memberitahu mereka perihal apa yang telah mereka perbuat di dunia dan memberi kepada mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Allah menjelaskan jalan yang penuh hikmah dalam berdakwah kepada Allah, yaitu dengan berpaling dari orang-orang musyrik dengan penuh adab dan sopan santun yang sesuai dengan sifat orang-orang beriman. Mereka dilarang untuk menghina tuhan-tuhan milik orang-orang musyrik agar hinaan ini tidak mengakibatkan mereka membalas dengan menghina Allah dengan zalim dan tanpa pengetahuan. Sehingga hinaan orang-orang beriman kepada tuhan-tuhan mereka menjadi sebab penghinaan terhadap Allah Yang Maha Agung. Ini sudah menjadi sunatullah bagi makhluk-makhluk-Nya bahwa manusia jika mencintai sesuatu maka dia akan membelanya meskipun itu adalah sesuatu yang buruk. Oleh sebab itu orang-orang musyrik tidak rela jika tuhan-tuhan mereka dihina sehingga mereka menampakkan pembelaan. Allah menjadikan ketaatan indah di mata orang-orang yang taat dan kekafiran indah di mata orang-orang kafir. Mereka semua akan dikembalikan kepada Allah kemudian Allah akan memberitahukan amal perbuatan yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. وَلَا تَسُبُّوا۟ الَّذِينَ يَدْعُونَ مِن دُونِ اللهِ فَيَسُبُّوا۟ اللهَ عَدْوًۢا بِغَيْرِ عِلْمٍ ۗ (Dan janganlah kamu memaki sembahan-sembahan yang mereka sembah selain Allah, karena mereka nanti akan memaki Allah dengan melampaui batas tanpa pengetahuan) Yakni janganlah kalian menghina tuhan-tuhan dan sesembahan orang-orang musyrik meskipun itu merupakan seseuatu yang paling hina dan paling berhak mendapat hinaan; agar mereka tidak berbalik menghina Allah secara berlebihan dan melampaui batas kebenaran serta dengan kebodohan mereka atas kewajiban untuk mensucikan Allah. كَذٰلِكَ زَيَّنَّا لِكُلِّ أُمَّةٍ عَمَلَهُمْ(Demikianlah Kami jadikan setiap umat menganggap baik pekerjaan mereka) Yakni berapa buruknya orang yang menganggap baik perbuatan menghina Tuhannya yang Maha Tinggi dan Maha Suci demi membela sebuah patung dan thaghut. Dalam hadist shahih disebutkan bahwa Rasulullah bersabda: “terlaknatlah orang yang menghina kedua orangtuanya”. Para sahabat bertanya: Wahai Rasulullah, bagaimana seseorang bisa menghina orangtuanya? Ia menjawab: “yakni dengan menghina bapak orang lain maka orang itu membalas dengan menghina bapaknya, dan ia menghina ibu orang lain maka orang itu membalas dengan menghina ibunya”. Lalu bagaimana dengan orang yang menyebabkan Allah dihina?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dapat difahami bagaimana akal orang-orang musyrik sampai kepada mereka sikap fanatisme yang tinggi dan buta kepada makhluq sampai mereka menghinakan sang pencipta ? dan sama halnya dengan orang-orang zaman sekarang dengan perbuatan menyimpang mereka dari syari'at sehingga terlampau mengagungkan idola mereka. { أَتَوَاصَوْا بِهِ ۚ بَلْ هُمْ قَوْمٌ طَاغُونَ } \"Apakah mereka saling berpesan tentang apa yang dikatakan itu. Sebenarnya mereka adalah kaum yang melampaui batas\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Wahai orang-orang mukmin, janganlah kalian mengutuk tuhan-tuhan (berhala-berhala) orang-orang musyrik supaya mereka tidak mengutuk Allah dengan kebencian dan sewenang-wenang serta tanpa tahu tentang Allah, dan hal yang wajib ditujukan kepadaNya berupa sikap ta’zim dan tasbih. Sebagaimana menghiasi kepercayaan orang-orang musyrik tersebut, yaitu penyembahan berhala, Kami juga menghiasai amal perbuatan setiap umat yaitu amal baik dan buruk, lalu mereka mengerjakannya. Kemudian tempat kembali mereka semua di akhirat hanyalah kepada Allah. lalu Dia memberitahu perbuatan mereka di dunia, dan membalas mereka sesuai amal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah memaki yang mereka sembah selain Allah sehingga mereka akan memaki Allah dengan melampaui batas} melampaui batas dan zalim {tanpa pengetahuan. Demikianlah, Kami jadikan memperindah} membuat bagus {pekerjaan bagi setiap umat. Kemudian kepada Tuhan merekalah tempat kembali mereka, lalu Dia akan memberitahu mereka apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Allah melarang orang-orang Mukmin dari satu perkara yang pada dasarnya di bolehkan bahkan dianjurkan, yaitu mencela tuhan-tuhan milik orang-orang musyrik yang di sembah dan dipertuhankan dengan Allah, dimana menghina dan mecelanya mendekatkan kepada Allah. Akan tetapi celaan terhadap mereka merupakan jalan bagi mereka untuk mencela Allah, Rabbul Alalmin, yang mana ia harus di sucikan dari segala aib, cacat, celaan, dan hinaan, maka Allah melarang mencela tuhan-tuhan kaum Musyrikin, karena mereka membela dan fanatic kepada agamaNya. Karena Allah menghiasi segala amal setiap umat, maka mereka memandangnya baik, membelanya, dan memperjuangkanNya dengan berbagia cara bahkan mereka mencela Allah, dimana keagungannya telah terpatri di hati orang-orang baik dan durhaka apabila kaum Muslimin mencelanya. Akan tetapi tempat kembali manusia adalah Hari Kiamat adalah kepada Allah. Mereka akan menghadap kepadanya, amal-amal mereka akn disodorkan lalu Dia akan menjelaskan kepada mereka kebaikan dan keburukan apa yang mereka lakukan. Ayat yang mulia ini adalah dalil bagi kaidah syar’I yaitu bahwa sarana di timbang dengan tujuannya, sarana kedapa yang haram walaupun pada dasarnya dibolehkan adalah haram jika menyeret kepada keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 108: Dalam ayat ini, Allah Subhaanahu wa Ta'aala melarang kaum mukmin terhadap perkara yang hukumnya boleh, bahkan pada asalnya disyari’atkan, yaitu memaki sesembahan kaum musyrik. Akan tetapi karena “memaki” menjadi sebab kaum musyrik memaki Allah Rabbul ‘alamin, maka Allah melarang mereka. Dari ayat ini diambil kaidah, bahwa hukum wasilah (sarana) tergantung ujungnya ke mana; jika mengarah kepada perbuatan haram, maka sarana itu haram meskipun hukum salnya boleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 108",
    "description": "Ayat ini secara khusus ditujukan kepada kaum muslim tentang bagaimana seharusnya bersikap menghadapi sesembahan kaum musyrik. Dan janganlah kamu, wahai kaum muslim, memaki sesembahan seperti berhala-berhala dan lainnya yang mereka sembah selain Allah, karena jika kamu memakinya, maka akibatnya mereka nanti akan memaki Allah dengan melampaui batas atau tanpa berpikir dan tanpa dasar pengetahuan. Demikianlah, sudah menjadi sebuah ketentuan yang berlaku sepanjang masa bahwa kami jadikan setiap umat menganggap baik pekerjaan mereka. Mereka harus mempertanggungjawabkan perbuatan mereka. Kemudian pada saat yang telah ditentukan, kepada tuhan tempat kembali mereka, lalu dia akan memberitahukan kepada mereka apa yang telah mereka kerjakan untuk mendapatkan balasan yang setimpal. Belum jera juga kaum musyrik untuk menampilkan argumen penolakan, bahkan mereka mengukuhkan penolakan dengan sumpah. Dan mereka, yakni kaum musyrik, bersumpah mengukuhkan ucapan mereka dengan menggunakan nama Allah dengan segala kesungguhan, bahwa demi Allah, sungguh jika datang suatu mukjizat, yakni mukjizat apa saja yang mereka usulkan selama ini, kepada mereka, pastilah mereka akan beriman kepadanya. Katakanlah kepada mereka, wahai nabi Muhammad, sungguh mukjizat-Mukjizat itu hanya ada pada sisi Allah atau berdasar kuasa-Nya. Jika dia berkehendak, dia akan menurunkannya kepada kalian, dan jika dia tidak berkehendak, maka mukjizat itu tidak akan turun. Dan tahukah kamu, yakni siapa yang memberitahukan kepada kalian, wahai kaum mukmin, bahwa apabila mukjizat datang mereka akan beriman' kenyataannya mereka tidak juga akan beriman."
  }
]