[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah bersumpah Orang-orang musyrik itu dengan sumpah-sumpah yang dikukuhkan, ”jika Muhammad datang membawa tanda yang luar biasa (mukjizat) , pastilah kami akan beriman kepada risalah yang dibawanya.” katakanlah (wahai rasul), ”sesungguhnya kemunculan mukjizat yang luar biasa itu berasal dari Allah . Dia maha kuasa mendatangkan mukjizat bila Dia menghendakinya. ”Dan tahukah kalian (wahai kaum mukminin), bahwa apabila mukjizat itu datang, mungkin saja kaum musyrikin itu tidak juga mengimaninya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Orang-orang musyrik itu bersumpah demi Allah dengan sekeras-kerasnya, bahwa jika suatu ketika Muhammad datang kepada mereka dengan membawa tanda-tanda (mukjizat) yang mereka usulkan niscaya mereka benar-benar akan percaya kepadanya. Katakanlah -wahai Rasul- kepada mereka, “Mukjizat itu bukanlah wewenangku sehingga bisa kuturunkan sesuka hatiku. Sesungguhnya mukjizat itu adalah wewenang Allah. Dia lah yang bisa menurunkannya menurut kehendak-Nya.” Tahukah kalian -wahai orang-orang mukmin- bahwa apabila mukjizat-mukjizat itu datang kepada mereka seperti yang mereka usulkan, mereka tidak akan beriman? Mereka akan tetap ingkar dan membangkang karena mereka tidak menginginkan hidayah (petunjuk ke jalan yang benar)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Orang-orang musyrik bersumpah dengan nama Allah dengan sumpah yang paling kuat, bahwa jika datang suatu mukjizat kepada mereka seperti perubahan bukit shofa menjadi bukit emas, niscaya mereka semua akan beriman kepada kenabian dan risalah Nabi Muhammad. Maka Allah membalas perkataan mereka dengan berfirman: Hai Muhammad, Katakanlah sesungguhnya mukjizat-mukjizat itu dari Tuhanku, Dialah yang dapat mendatangkannya. Dan bagaimana jika Allah mendatangkan mukjizat itu namun orang-orang musyrik tidak juga beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. وَأَقْسَمُوا۟ بِاللهِ جَهْدَ أَيْمٰنِهِمْ لَئِن جَآءَتْهُمْ ءَايَةٌ لَّيُؤْمِنُنَّ بِهَا ۚ (Mereka bersumpah dengan nama Allah dengan segala kesungguhan, bahwa sungguh jika datang kepada mereka sesuatu mu jizat, pastilah mereka beriman kepada-Nya) Yakni mereka bersumpah dengan segenap kemampuan mereka, bahwa jika Nabi Muhammad telah datang dengan satu mukjizat maka mereka akan beriman kepadanya. Dan dahulu mereka meyakini bahwa Allah adalah Tuhan yang paling Agung, maka dari itu mereka bersumpah dengan nama-Nya. قُلْ إِنَّمَا الْءَايٰتُ عِندَ اللهِ ۖ (Katakanlah: “Sesungguhnya mukjizat-mukjizat itu hanya berada di sisi Allah”) Yakni mukjizat-mukjizat yang kalian usulkan ini tidak berada bawah kekuasaanku sama sekali, dan Allah jika berkehendak untuk menurunkannya niscaya Dia akan menurunkannya, dan jika berkehendak untuk tidak menurunkannya niscaya Dia tidak akan menurunkannya. وَمَا يُشْعِرُكُمْ أَنَّهَآ إِذَا جَآءَتْ لَا يُؤْمِنُونَ(Dan apakah yang memberitahukan kepadamu bahwa apabila mukjizat datang mereka tidak akan beriman) Yakni apa yang menjadikan kalian tahu hai orang-orang yang beriman, bahwa jika mukjizat itu datang maka mereka akan beriman? Mereka sekali-kali tidak akan beriman, inilah kenyataan yang Aku beritahukan kepada kalian, maka janganlah kalian terlalu memperhatikan mereka. Muhammad bin Ka’b al-Quradhy mengatakan: Rasulullah berbicara kepada kaum Quraisy, lalu mereka menjawab: “hai Muhammad, kamu telah memberitahu kami bahwa Musa memiliki tongkat untuk memukul batu (maka keluar air darinya), dan Isa dahulu dapat menghidupkan orang mati, sedangkan kaum Tsamud memiliki (mukjizat) berupa unta; maka datangkanlah bagi kami mukjizat-mukjizat sehingga kami beriman kepadamu”. Maka Rasulullah bertanya kepada mereka: “apa yang kalian inginkan untuk aku datangkan kepada kalian?” mereka menjawab: “ubahah bagi kami bukit as-Shofa menjadi emas”. Rasulullah berkata: “jika aku melakukan hal itu apakah kalian akan beriman kepadaku?” mereka menjawab: “iya demi Allah, jika kamu melakukannya sungguh pasti kami semua akan menjadi pengikutmu. Maka Rasulullah berdiri seraya berdo’a. Kemudian datanglah malaikat Jibril, lalu berkata kepadanya: “apabila kamu menghendaki niscaya bukit itu akan menjadi bukit emas, namun jika mereka tetap tidak beriman setelah itu maka Kami sungguh akan mengazab mereka; dan apabila kamu menghendaki, maka biarkanlah mereka sampai bertaubat orang yang mau bertaubat diantara mereka. Maka Rasulullah berkata: “kalau begitu akan aku biarkan mereka sampai bertaubat orang yang mau bertaubat diantara mereka. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Orang-orang kafir Mekah bersumpah dengan sebenar-benar dan sesungguh-sungguhnya iman, jika telah datang kepada mereka suatu mukjizat yang mereka usulkan (yang terkandung) dalam surah An-Nahl, ayat 90 dan ayat selanjutnya, bahwa mereka akan mempercayainya dan mengakui bahwa kamu adalah rasul Allah. Maka katakanlah kepada mereka wahai Nabi: “Sesungguhnya ayat-ayat (mukjizat) ini hanya di sisi Allah. Dialah Dzat yang Berkuasa atas mukjizat itu, jika berkehendak, maka Dia akan mendatangkannya untuk kalian, dan jika berkehendak Dia juga tidak akan menurunkannya. Dan kalian tidak akan mengetahui bahwa mereka akan benar-benar beriman jika mukjizat itu datang kepada mereka. Sesungguhnya mereka tidak akan pernah beriman”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bersumpah dengan (nama) Allah dengan sebenar-benarnya sumpah} Mereka bersumpah dengan nama Allah dengan sebenar-benarnya sumpah {sungguh jika datang kepada mereka suatu bukti, pastilah mereka akan beriman kepadanya. Katakanlah,“Sesungguhnya bukti-bukti itu hanya ada di sisi Allah.” Kalian tidak akan mengira} tidak menyadari {bahwa jika bukti itu datang, mereka tidak akan beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. Orang-orang musyrik yang mendustakan rasul Muhammad bersumpah “dengan Nama Allah dengan segala kesungguhan.’ Maksudnya, sumpah yang mereka tegaskan dan mereka tekankan, “Sungguh jika datang kepada mereka suatu mukjizat,” yang menunjukan kebenaran Muhammad, “pastilah mereka beriman kepadaNya.” Ucapan yang mereka katakan ini tidak bertujuan baik akan tetapi tujuannya hanya meyangkal bantahan yang di tujukan kepada mereka dan menolak apa yang dibawa oleh Rasul dengan pasti, Allah telah mendukung RasulNya dengan mukjizat-mukjizat yang jelas dan dalil yang kuat dimana jika ia dilihat, maka tidak tersisa sedikitpun syubhat dan persoalan tetang kebenaran sesuatu yang dibawanya. Permintaan mereka terhadap mukjizat setelah itu hanyalah permintaan yang menyusahkan yang tidak perlu dipenuhi. Bahkan pelarangan untuk menjawab pertanyaan mereka adalah lebih banyak kemaslahatannya bagimu karena sunnatullah yang berlaku pada manusia adalah bahwa orang-orang yang menuntut turunya kepada rasul-rasul mereka, apabila ia diturunkan dan tidak beriman kepadanya, maka Allah menyegerakan azab kepada mereka. Oleh karena itu Allah berfirman, “Katakanlah, ‘Sesungguhnya mukjizat-mukjizat itu hanyalah berada di sisi Allah’.’ Maksudnya Allah-lah yang menurunkannya jika dia berkehendak, dan menahannya jika Dia berkehendak. Urusannya sedikitpun bukanlah ditanganku, tuntunanmu terhadap mukjizat bukanlah pada tempatnya. Tuntunan terhadap apa yang tidak aku miliki. Seharusnya tuntunan tersebut ditujukan untuk meminta penjelasan ayat apa yang aku sampaikan kepadamu dan tuntunan penjelasan tetang pembenarannya. Itu telah ia terima. Walaupun begitu tidak bisa dipastikan bahwa Seandainya mukjizat itu turun, mereka akan beriman dan mempercayainya. Justru orang yang keadaanya begini malah tidak beriman. Oleh karena itu, Dia berfirman, “dan apakah yang memberitahukan kepadamu bahwa apabila mukjizat datang mereka akan beriman?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 109: Yakni kaum musyrik Mekah. Yang menunjukkan kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam. Kata-kata ini sebenarnya sebagai penolakan mereka terhadap apa yang dibawa Rasulullah shallallahu 'alaihi wa sallam, karena sesungguhnya Allah telah menguatkan Beliau dengan ayat-ayat yang jelas dan dalil-dalil yang terang, yang jika seseorang menoleh kepadanya tentu akan diketahui benarnya apa yang Beliau bawa. Oleh karena itu, permintaan mereka untuk didatangkan mukjizat termasuk sikap ta’annut (menyusahkan diri) yang tidak mesti dikabulkan, bahkan tidak dipenuhi permintaan mereka sebenarnya lebih baik bagi mereka, karena Sunnatullah berjalan kepada mereka yang mengusulkan didatangkan mukjizat, bahwa jika mereka tidak beriman kepadanya, maka mereka akan dibinasakan. Dia menurunkannya sebagaimana yang Dia kehendaki, sedangkan saya hanyalah memberi peringatan. Oleh karena itu, permintaan kamu kepadaku agar didatangkan mukjizat mrupakan sebuah kezaliman, meminta kepada saya sesuatu yang saya tidak memilikinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 109",
    "description": "Belum jera juga kaum musyrik untuk menampilkan argumen penolakan, bahkan mereka mengukuhkan penolakan dengan sumpah. Dan mereka, yakni kaum musyrik, bersumpah mengukuhkan ucapan mereka dengan menggunakan nama Allah dengan segala kesungguhan, bahwa demi Allah, sungguh jika datang suatu mukjizat, yakni mukjizat apa saja yang mereka usulkan selama ini, kepada mereka, pastilah mereka akan beriman kepadanya. Katakanlah kepada mereka, wahai nabi Muhammad, sungguh mukjizat-Mukjizat itu hanya ada pada sisi Allah atau berdasar kuasa-Nya. Jika dia berkehendak, dia akan menurunkannya kepada kalian, dan jika dia tidak berkehendak, maka mukjizat itu tidak akan turun. Dan tahukah kamu, yakni siapa yang memberitahukan kepada kalian, wahai kaum mukmin, bahwa apabila mukjizat datang mereka akan beriman' kenyataannya mereka tidak juga akan beriman setelah pada ayat 108 dinyatakan bahwa Allah menjadikan setiap umat menganggap baik perbuatan mereka, maka pada ayat ini Allah menyatakan, dan begitu pula kami memalingkan hati dan penglihatan mereka kepada kebatilan jika mukjizat itu datang kepada mereka seperti keadaan mereka ketika pertama kali mendengar dan mengetahui mukjizat tersebut, mereka tidak beriman kepadanya, yakni Al-Qur'an, dan kami biarkan mereka bingung dalam kesesatan karena keengganan mereka mengikuti petunjuk."
  }
]