[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rasul), ”berjalanlah kalian di muka bumi, dan kemudian perhatikanlah bagaimana Allah menimpakkan kebinasaan dan kehinaan bagi orang-orang yang mendustakan? maka hindarilah oleh kalian cara-cara kematian yang sama dengan mereka. Dan takutlah kalian akan datangnya (siksaan) yang serupa dengan apa yang telah menimpa mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Katakanlah -wahai Rasul- kepada orang-orang yang telah mendustakan dan mengolok-olok itu, “Berjalanlah kalian di muka bumi. Kemudian pikirkanlah bagaimana akhir dari perjalanan orang-orang yang dahulu mendustakan para utusan Allah. Mereka benar-benar ditimpa hukuman dari Allah setelah sebelumnya mereka memiliki kekuatan dan ketahanan yang luar biasa.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Ini merupakan anjuran Allah yang bermakna: Berjalanlah untuk mengambil ibrah dan pelajaran dari setiap kejadian dan peristiwa, dan dari keadaan umat-umat terdahulu. Lihatlah bagaimana Allah menimpakan kehinaan kepada orang-orang yang mendustakan? Maka berhati-hatilah agar kalian tidak tertimpa apa yang telah menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. قُلْ سِيرُوا۟ فِى الْأَرْضِ (Katakanlah: “Berjalanlah di muka bumi) Yakni lakukanlah perjalanan diatas bumi, dan lihatlah bagaimana sisa-sisa yang ditinggalkan oleh orang-orang sebelum kalian. Agar kalian mengetahui balasan yang diturun kepada mereka, setelah sebelumnya mereka berada dalam kenikmatan yang luas. Dan kalian akan menyusul mereka dalam kebinasaan apabila kalian menapaki jalan mereka dalam mendustakan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Wahai rasulullah, katakanlah kepada orang-orang yang mengolok-olok itu: “Berpergianlah kalian di bumi, dan lihatlah jejak-jejak umat terdahulu supaya kalian menyadari hukuman yang menimpa mereka, dan lihatlah bagaimana takdir orang-orang yang mendustakan rasul mereka. Kalian akan dibinasakan seperti mereka jika kalian berdusta seperti mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Berjalanlah di bumi, kemudian perhatikanlah} pikirkanlah {bagaimana hukuman orang-orang yang mendustakan itu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Jika kamu bimbang atau ragu dalam perkara ini, maka “berjalanlah di muka bumi, kemudian perhatikan bagaimana kesudahan orang-orang yang mendustakan itu.” Kamu tidak mendapatkan kecuali kaum yang dibinasakan dan umat yang bergelimpangan di terpa azab , derita dan dalam keadaan rusak. Negeri-negeri sepi, daerah-daerah itu pun lenggan, seluruh penikmat kebahagiaan luruh, Maharaja yang berkuasa membinasakan mereka berita mereka menjadi pelajaran bagi ulil abshar. Perjalanan yang di perintahkan ini perjalanan dan badan yang mengahsilkan pembelajaran. Adapun sekedar melihat tanpa mengambil pelajaran, maka ia sama sekali tidak berguna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 11: Yakni jika kamu masih meragukannya, maka jelajahilah bumi…dst. di mana sebagian bangunan mereka yang dibinasakan masih tersisa sehingga dapat diambil pelajaran. Perintah mengadakan perjalanan ini merupakan perjalanan yang menggabung antara hati dengan badan, di mana dengannya seseorang dapat mengambil pelajaran. Adapun jika melihat-lihat tanpa mengambil pelajaran, maka tidak ada faedahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 11",
    "description": "Orang-orang kafir lalu diminta untuk mengamati nasib umat manusia sebelumnya yang mendustakan ajaran Allah. Katakanlah, wahai nabi Muhammad, kepada orang-orang kafir yang menolak ajakan beriman kepada Allah, jelajahilah bumi, dengan mengunjungi jejak para nabi dan menelaah kisah umat-umat terdahulu, kemudian perhatikanlah dengan cermat melalui pikiran yang jernih dan hati yang bersih, bagaimana kesudahan, perjalanan hidup dan nasib orang-orang yang mendustakan ajaran rasulullah itu di dunia' katakan juga, wahai nabi Muhammad, kepada orang-orang kafir yang sombong dan keras kepala itu, milik siapakah apa yang ada di langit dan di bumi' katakanlah, semua makhluk yang ada di langit dan bumi ini adalah milik Allah. Dia telah menetapkan dan memilih sifat kasih sayang dengan berjanji pada diri-Nya untuk mendahulukan kasih sayang kepada hamba-hamba-Nya daripada murka. Dia sungguh akan mengumpulkan kamu, seluruh manusia sejak nabi adam hingga manusia akhir zaman, pada hari kiamat, dalam kehidupan sesudah mati. Pengumpulan seluruh umat manusia ini tidak mungkin diragukan lagi kejadiannya. Dalam pertemuan itu, ada yang beruntung dan ada yang rugi. Orang-orang yang merugikan dirinya, mereka itu orang-orang yang tidak beriman, sedangkan yang beruntung adalah mereka yang beriman dan beramal saleh dengan ikhlas."
  }
]