[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami membalikan hati dan pandangan mereka, lalu kami menghalanginya untuk dapat mengambil manfaat dari ayat-ayat Allah , sehingga mereka tidak beriman kepadanya, sebagaimana mereka tidak beriman kepada ayat-ayat Al –qur’an ketika diturunkan pertama kali. dan kami biarkan mereka dalam pembangkangan mereka kepada Allah dalam keadaan kebingungan, tidak memperoleh petunjuk menuju yang haq dan jalan yang benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Kami bolak-balik hati dan mata mereka dengan menghalanginya dari jalan yang benar, sebagaimana Kami menghalangi mereka dari iman kepada Al-Qur`ān sejak awal akibat penolakan mereka. Dan Kami biarkan mereka berada di dalam kesesatan dan pembangkangan mereka kepada Rabb mereka, sehingga mereka kebingungan dan berjalan sempoyongan"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Allah telah memalingkan hati dan penglihatan mereka dari petunjuk dan keimanan, sehingga mereka tidak beriman kepada kenabian Nabi Muhammad sebagaimana mereka tidak beriman kepada al-Qur'an ketika ayatnya turun pertama kali. Oleh sebab itu Allah membiarkan mereka dalam kesesatan sehingga mereka tidak mendapat petunjuk menuju jalan yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. وَنُقَلِّبُ أَفْـِٔدَتَهُمْ وَأَبْصٰرَهُمْ (Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka) Yakni hati dan penglihatan mereka akan dibolak-balikkan di hari kiamat diatas kobaran api neraka dan batu yang panas. Ibnu Abbas berkata: ketika mereka mengingkari apa yang diturunkan Allah maka hati mereka tidak pernah menentu dalam suatu keadaan dan ditolak dari setiap perkara. كَمَا لَمْ يُؤْمِنُوا۟ بِهِۦٓ أَوَّلَ مَرَّةٍ (seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya) Sehingga mereka terombang-ambing dalam pendapat mereka tentang al-qur’an dan mereka berbicara tentangnya dengan perkataan yang berbeda-beda. وَنَذَرُهُمْ فِى طُغْيٰنِهِمْ يَعْمَهُونَ(dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat) Yakni di dunia. Yakni membiarkan mereka kebingungan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kedua mata hakikatnya adalah mata hati dalam diri manusia, dan tidaklah dalam anggota tubuh manusia yang lebih kuat ikatannya kepada hati selain dari kedua mata, untuk itu Allah menggabungkan keduanya dalam ayat-Nya : { وَنُقَلِّبُ أَفْئِدَتَهُمْ وَأَبْصَارَهُمْ } \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka\". { يَخَافُونَ يَوْمًا تَتَقَلَّبُ فِيهِ الْقُلُوبُ وَالْأَبْصَارُ } \"suatu hari yang (di hari itu) hati dan penglihatan menjadi goncang\" [ An-Nur : 37 ]. { وَإِذْ زَاغَتِ الْأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ } \"dan ketika tidak tetap lagi penglihatan(mu) dan hatimu naik menyesak sampai ke tenggorokan\" [ Al-Ahzab : 10 ]. { قُلُوبٌ يَوْمَئِذٍ وَاجِفَةٌ (8) أَبْصَارُهَا خَاشِعَةٌ (9 } \"Hati manusia pada waktu itu sangat takut ( 8 ) Pandangannya tunduk ( 9 )\". 2 ). Siapapun yang ditawarkan kepadanya suatu kebenaran lalu ia menolaknya, dan tidak mau menerimanya; sungguh kerusakan hati, akal, dan pandangan telah menimpanya. 3 ). Barangsiapa yang menyalahi suatu kebenaran pada permulaan, tanpa ia sadar akan terbayang terus olehnya kebenaran lainnya adalah bagaikan racun"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Kalian juga tidak akan bisa merasakan bahwa mukjizat itu telah datang (kepada mereka) karena Kami akan membolak-balik hati mereka dengan pemikiran-pemikiran yang sia-sia, dan mengalihkan penglihatan mereka dengan khayalan, sehingga mereka tidak mengimani mukjizat itu sebagaimana mereka tidak mengimani Al-Qur’an ketika rasulullah mengajak mereka untuk mengimaninya. Dan kami membiarkan mereka dalam kesesatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami akan memalingkan hati dan penglihatan mereka} Kami memalingkan hati dan penglihatan mereka dari kebenaran {seperti pertama kali mereka tidak beriman kepadanya serta Kami membiarkan mereka} membiarkan mereka {dalam kesesatan} dalam kesesatan {merasa bingung} Ragu karena bingung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. ”Dan begitu pula kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya pada permulaanNya, dan kami biarkan mereka bergemilang dalam kesesatannya yang sangat.” Kami menghukum mereka jika mereka tidak beriman pertama kali, pada saat itu penyeru mendatangi mereka dengan hujah pun telah tegak atas mereka dengan memalingkan hati mereka, menghalangi mereka dari keimanan, dan tidak memberi kepada mereka taufik kepada jalan yang lurus. Ini adalah keadilan Allah dan hikmahNya, kepada hamba-hambaNya karena diri merekalah yang mananam untuk diri mereka, pintu telah dibuka didepan mereka tetapi mereka tidak memasukinya. Jalan telah dijelaskan tetapi mereka tidak melewatinya. Jika setelah itu mereka gagal mendapatkan taufik, maka itu sudah sesuai dengan kondisi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 110: Sehingga mereka tidak dapat memahami Al Qur’an. Sehingga mereka tidak dapat melihat kebenaran itu dan tidak pula beriman. Hal ini termasuk keadilan Allah dan kebijaksanaan-Nya terhadap hamba-hamba-Nya, karena mereka menganiaya diri mereka sendiri, saat dibukakan pintu bagi mereka, namun mereka tidak mau masuk, saat diterangkan jalan kepada mereka, namun mereka tidak mau menempuhnya. Oleh karena itu, ketika mereka dihalangi memperoleh taufiq merupakan hal yang sesuai bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 110",
    "description": "Setelah pada ayat 108 dinyatakan bahwa Allah menjadikan setiap umat menganggap baik perbuatan mereka, maka pada ayat ini Allah menyatakan, dan begitu pula kami memalingkan hati dan penglihatan mereka kepada kebatilan jika mukjizat itu datang kepada mereka seperti keadaan mereka ketika pertama kali mendengar dan mengetahui mukjizat tersebut, mereka tidak beriman kepadanya, yakni Al-Qur'an, dan kami biarkan mereka bingung dalam kesesatan karena keengganan mereka mengikuti petunjuk. Kaum musyrik berjanji akan beriman kepada Allah jika diturunkan kepada mereka tanda-tanda fisik yang mereka minta. Pada ayat ini dijelaskan bahwa janji tersebut hanya bohong belaka. Dan sekalipun kami benar-benar menurunkan malaikat kepada mereka, sehingga mereka bisa melihat malaikat dalam wujudnya yang asli dan orang yang telah mati berbicara dengan mereka menceritakan apa yang mereka rasakan di alam kubur dan kami kumpulkan pula di hadapan mereka segala sesuatu yang mereka inginkan, dan menjelaskan tentang sesuatu yang hak mereka tidak juga akan beriman, kecuali jika Allah menghendaki. Tapi kebanyakan mereka tidak mengetahui arti kebenaran. Hati mereka tertutup oleh kekufuran, kesombongan, dan keangkuhan."
  }
]