[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya kami mengabulkan permintaan orang-orang musyrik itu, lalu kami menurunkan malaikat dari langit, dan Kami hidupkan orang-orang mati agar berbicara kepada mereka, serta kami kumpulkan semua yang mereka minta sehingga mereka dapat menyaksikannya dengan mata kepala mereka di hadapan mereka, mereka tetap tidak akan beriman terhadap dakwah yang engkau serukan kepada mereka (wahai rasul), dan mereka tidak akan mengamalkannya, kecuali orang yang Allah kehendaki memperoleh hidayah. Akan tetapi kebanyakan orang-orang kafir itu jahil terhadap kebenaran yang engkau bawa dari sisi Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Seandainya Kami benar-benar mengabulkan keinginan mereka, lalu Kami turunkan kepada mereka sejumlah malaikat yang mereka saksikan secara nyata, dan sejumlah orang mati berbicara dan memberitahu mereka perihal kebenaran agama yang kamu bawa, serta Kami penuhi semua usulan mereka secara nyata, pasti mereka tidak akan beriman kepada agama yang kamu bawa, kecuali orang-orang yang Allah kehendaki untuk diberi-Nya hidayah. Tetapi kebanyakan dari mereka tidak mengetahui hal itu, sehingga mereka tidak pernah mengadu kepada Allah untuk mendapatkan hidayah-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Seandainya dengan keagungan dan kekuasaan Kami yang sempurna, Kami mendatangkan kepada mereka mukjizat yang luar biasa, yaitu dengan menurunkan malaikat sehingga mereka dapat melihatnya secara kasat mata; kami hidupkan orang-orang mati sehingga dapat berbicara dengan mereka; dan kami datangkan bagi mereka segala yang mereka minta baik itu berupa mukjizat maupun yang lainnya, sehingga mereka benar-benar dapat melihatnya; niscaya mereka tidak akan beriman kecuali dengan kehendak Allah. Akan tetapi kebanyakan orang-orang musyrik tersebut tidak mengetahui jalan yang benar agar dapat mengikuti kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَلَوْ أَنَّنَا نَزَّلْنَآ إِلَيْهِمُ الْمَلٰٓئِكَةَ (Kalau sekiranya Kami turunkan malaikat kepada mereka) Sehingga mereka dapat melihat para malaikat secara langsung agar para malaikat tersebut dapat berbicara dan memberitahu mereka tentang kebenaranmu; sebagaimana yang mereka usulkan. وَكَلَّمَهُمُ الْمَوْتَىٰ(dan orang-orang yang telah mati berbicara dengan mereka) Yakini orang-orang yang setelah Kami hidupkan mereka kembali untuk memberitahu orang-orang kafir dengan mengatakan kepada mereka: sesungguhnya Nabi ini benar-benar diutus oleh Allah maka berimanlah kalian kepada mereka. وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَىْءٍ(dan Kami kumpulkan (pula) segala sesuatu) Yakni berupa mukjizat-mukjizat yang mereka minta. قُبُلًا(ke hadapan mereka) Yakni saling berhadapan. Atau datang berkelompok-kelompok. مَّا كَانُوا۟ لِيُؤْمِنُوٓا۟ إِلَّآ أَن يَشَآءَ اللهُ (niscaya mereka tidak (juga) akan beriman, kecuali jika Allah menghendaki) Maka janganlah kamu bersedih karena mereka beriman, namun sampaikanlah saja apa yang diperintahkan kepadamu. وَلٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ (tetapi kebanyakan mereka tidak mengetahui) Yakni tidak mengetahui kenyataan itu, sehingga mereka tidak mendatangi Rasulullah untuk mencari hidayah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111 Kalau sekiranya Kami turunkan malaikat kepada mereka, maka mereka akan melihat para malaikat dengan mata kepala mereka sendiri dan bersaksi akan kebenaran risalahmu. Kami hidupkan orang-orang yang telah mati dan mereka akan bersaksi bahwa engkau adalah benar-benar Nabi yang diutus oleh Allah. Juga Kami kumpulkan dan Kami tampakkan segala mukjizat ke hadapan mereka. Tidak akan beriman kecuali yang hanya dikehendaki oleh Allah dengan sukarela tanpa paksaan. Maka jangan engkau terlalu risau jika mereka tidak beriman. Kebanyakan orang musyrik tidak mengetahui bahwa iman dan kufur adalah atas kehendak mereka sendiri. Ibnu Abbas menyebutkan bahwa sekelompok kafir Makkah dan para pembesarnya berkata kepada Nabi: Perlihatkan kepada kami para malaikat yang bersaksi bahwa engkau adalah utusan Allah, atau bangkitkanlah para pendahulu kami sehingga kami bisa menanyai mereka, apakah perkataanmu itu benar atau salah. Atau datangkanlah kepada kami penjamin dari Alllah dan malaikat. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Kami benar-benar menurunkan malaikat kepada mereka, orang yang telah mati pun berbicara dengan mereka, dan Kami kumpulkan untuk mereka segala sesuatu} Kami mengumpulkan bagi mereka setiap tanda yang mereka minta {di hadapan mereka} diarahkan dan dihadapkan {Mereka tidak akan beriman, kecuali jika Allah menghendaki. Namun kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. Begitu pula mereka menggantungkan iman kepada keinginan kehendak mereka semata tanpa bersandar kepada Allah, itu adalah kesalahan besar. Jika mukjizat-mukjizat datang kepada mereka seperti turunnya para malaikat kepada mereka, mereka memberi kesaksian kepada Rasulullah tentang risalah yang dibawanya, dialog mereka dengan orang-orang mati dan kebangkitan mereka setelah mereka mati, dan kami kumpulkan segala mukjizat dihadapan mereka sehingga ia mereka berbicara kepada mereka berhadap-hadapan, melihat langsung tentang kebenaran sesuatu yang dibawa oleh Rasul, semua itu tidak membuat mereka beriman jika Allah tidak menghendaki mereka beriman. Akan tetapi kebanyakan dari mereka tidak mengetahui, oleh karena itu, mereka hanya menggantungkan iman mereka kepada turunnya mukjizat, padahal sesuai dengan tuntunan akal dan ilmu, hendaknya tujuan seorang hamba adalah ketundukan kepada kebenaran, hendaknya dia mencarinya dengan cara yang telah dijelaskan oleh Allah lalu mengamalkannya dan memohon pertolongan kepada Tuhannya dalam mengikutinya, bukan bersandar kepada dirinya, kepada daya dan kekuatannya serta tidak menuntut turunya mukjizat-mukjizat yang justru tidak ada manfaat padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 111: Sebagaimana yang mereka usulkan. Untuk menjadi saksi bahwa Muhammad adalah Rasulullah. Karena Allah telah lebih dulu mengetahui."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 111",
    "description": "Kaum musyrik berjanji akan beriman kepada Allah jika diturunkan kepada mereka tanda-tanda fisik yang mereka minta. Pada ayat ini dijelaskan bahwa janji tersebut hanya bohong belaka. Dan sekalipun kami benar-benar menurunkan malaikat kepada mereka, sehingga mereka bisa melihat malaikat dalam wujudnya yang asli dan orang yang telah mati berbicara dengan mereka menceritakan apa yang mereka rasakan di alam kubur dan kami kumpulkan pula di hadapan mereka segala sesuatu yang mereka inginkan, dan menjelaskan tentang sesuatu yang hak mereka tidak juga akan beriman, kecuali jika Allah menghendaki. Tapi kebanyakan mereka tidak mengetahui arti kebenaran. Hati mereka tertutup oleh kekufuran, kesombongan, dan keangkuhan. Untuk menenangkan hati nabi Muhammad, Allah menjelaskan bahwa adanya penentangan dari berbagai pihak adalah sesuatu yang biasa dihadapi dahulu oleh para nabi dan pembawa kebenaran. Dan demikianlah untuk setiap nabi kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin, manusia jika sudah dikuasai oleh setan, maka itulah setan yang berwujud manusia, sebagian mereka membisikkan kepada sebagian yang lain perkataan yang indah sebagai tipuan agar manusia tertarik oleh rayuannya, padahal hal itu akan menjerumuskan orang yang mengikuti ajakannya. Setiap nabi pasti mempunyai musuh. Itu adalah kehendak Allah, sesuai dengan hikmah-Nya. Untuk itu, kalau tuhanmu menghendaki, niscaya mereka tidak akan melakukannya, yaitu tidak akan memusuhi para nabi, dan tidak akan melakukan kebohongan itu, karena semua itu berada dalam kekuasaan Allah. Maka biarkanlah mereka bersama apa, yakni kebohongan, yang mereka adaadakan. Dengan demikian, Allah bisa melihat siapa di antara mereka yang taat dan siapa yang durhaka. Mereka yang ikut bisikan setan pasti akan tahu akibat dari perbuatan mereka. Kemudian Allah menjelaskan lagi tentang hikmah di balik semua itu melalui tiga hal, yaitu tertarik kepada kebatilan yang diembuskan kepada mereka, menyenanginya, dan melakukannya, seperti dijelaskan pada ayat berikut."
  }
]