[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana kami uji engkau (wahai rasul), dengan musuh-musuhmu dari kalangan kaum musyrikin, kami juga telah menguji seluruh nabi dengan para musuh dan para penentang dari kaum mereka dan musuh-musuh dari para penentang dari kalangan jin, sebagian dari mereka membisikkan kepada sebagian yang lain perkataan yang telah mereka hiasi dengan kebatilan, supaya teperdaya dengan itu orang yang mendengarnya, sehingga tersesat dari jalan Allah. seandainya tuhanmu Allah berkehendak, pastilah Dia akan menghalangi antara mereka dengan sikap permusuhan tersebut. Akan tetapi, hal itu adalah cobaan dari Allah. Maka tinggalkanlah mereka dan apa yang mereka ada-adakan yang berupa kedustaan dan kebohongan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Sebagaimana Kami mengujimu dengan sikap permusuhan dari orang-orang musyrik, Kami juga menguji setiap nabi sebelummu. Maka setiap nabi Kami beri musuh-musuh yang durhaka dari bangsa manusia dan bangsa jin yang saling membisiki satu sama lain, sehingga mereka menjadikan kebatilan tampak baik di mata para nabi itu untuk memperdaya mereka. Seandainya Allah berkehendak untuk tidak melakukan hal itu, niscaya Dia tidak akan melakukannya. Maka biarkanlah mereka bergelimang dengan kekafiran dan kebatilan yang mereka buat-buat sendiri, dan jangan hiraukan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112-113. Sebagaimana Kami telah mengujimu dengan musuh-musuh dari golongan orang-orang musyrik, Kami juga telah menguji setiap Nabi sebelummu dengan musuh-musuh dari golongan setan manusia berupa para penyihir dan pemimpin orang-orang kafir, dan dari golongan setan jin yang saling membisikkan perkataan untuk menghiasi sesuatu yang batil agar orang yang mendengarnya dapat tertipu sehingga dapat meninggalkan keimanannya kepada Allah. Seandainya Allah menghendaki niscaya mereka tidak akan melakukan hal itu, maka tinggalkanlah mereka dan apa yang mereka dustakan agar hati orang-orang kafir condong kepada kedustaan dan terbiasa dengan kebatilan tersebut, serta agar mereka terus menambah kejahatan dan dosa-dosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. وَكَذٰلِكَ جَعَلْنَا لِكُلِّ نَبِىٍّ عَدُوًّا (Dan demikianlah Kami jadikan bagi tiap-tiap nabi itu musuh) Maksudnya adalah, Kami telah menguji kamu dengan mereka sebagaimana Kami juga telah menguji para nabi sebelummu, Kami jadikan bagi setiap mereka musuh dari golongan orang-orang kafir disetiap zaman mereka. شَيٰطِينَ الْإِنسِ (yaitu syaitan-syaitan (dari jenis) manusia) Meliputi para dukun, penyihir, dan pemimpin-pemimpin orang kafir yang tidak takut kepada Allah. وَالْجِنِّ (dan (dan jenis) jin) Yakni setan-setan dari keturunan iblis, mereka menyesatkan jin yang lain dan menyesatkan manusia. يُوحِى بَعْضُهُمْ إِلَىٰ بَعْضٍ (ebahagian mereka membisikkan kepada sebahagian yang lain) Yakni menggoda sebagian mereka kepada sebagian yang lain secara tersembunyi; زُخْرُفَ الْقَوْلِ(perkataan-perkataan yang indah-indah) Allah juga menjadikan bisikan-bisikan mereka dengan perkataan-perkataan yang indah untuk menghiasinya. غُرُورًا ۚ (untuk menipu) Yakni agar sebagian mereka dapat menggunakannya untuk menipu sebagian yang lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika seorang 'alim berusaha menjadi pewaris risalah Rasulullah, maka mesti ia juga mewarisi musuh-musuh Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112 Sebagaimana Kami jadikan musuh-musuh yang melawanmu wahai Nabi, Kami juga menjadikan musuh dari golongan syetan dari golongan manusia seperti para pendeta, penyihir dan para pembesar orang kafir. Juga syetan dari golongan jin keturunan iblis yang telah menyesatkan jin dan manusia serta membisikkan kejahatan kepada selain mereka dengan perkataan-perkataan yang kelihatan indah-indah namun hakikatnya rusak, hanya untuk menghias kebatilan. Itu bertujuan untuk menipu manusia dari kebenaran. Jikalau Tuhanmu menghendaki, niscaya mereka tidak melakukan bisikan-bisikan itu, maka tinggalkanlah mereka dan apa yang mereka ada-adakan dan dustakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami telah menjadikan bagi setiap nabi musuh} musuh {yaitu setan-setan} makhluk yang menolak {manusia dan jin. Sebagian mereka membisikkan} membisikkan {kepada sebagian yang lain perkataan yang indah} perkataan yang dihiasi dan disamarkan dengan kebathilan yang mereka {sebagai tipuan} agar mereka tertipu dengan itu {Seandainya Tuhanmu menghendaki, niscaya mereka tidak akan melakukannya. Maka tinggalkan mereka bersama apa yang mereka ada-adakan} mereka buat-buat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. Allah menghibur RasulNya Muhammad dengan mengatakan, “Kami jadikan untukmu musuh-musuh yang menolak dakwahmu, memerangi dan memusuhimu dan hasud kepadamu,” karena ia adalah Sunnah Kami di mana setiap Nabi yang kami utus kepada manusia pasti memiliki musuh-musuh dari kalangan jin dan manusia yang melawan kepada ajaran yang di bawa oleh para Rasul, “Sebagian mereka membisikan kepada sebagian yang lain perkataan-perkataan yang indah untuk menipu manusia.” Maksudnya, sebagian mereka menghiasi kebathilan yang mereka serukan kepada kebaikan kepada sebagian yang lain, dan memperindah kata-kata sehingga kereka menyulapnya dalam bentuk yang paling baik untuk mengelabui orang-orang bodoh dan orang-orang dungu yang tidak memahami hakikat yang sebenarnya dan tidak mengerti makna yang sesungguhnya. Mereka terkagum-kagum oleh kata-kata indah dan ungkapan yang mempesona, lalu mereka meyakini kebenaran sebagai kebatilan dan kebatilan sebagai kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 112: Dalam ayat ini, Allah Subhaanahu wa Ta'aala menghibur Rasul-Nya Muhammad shallallahu 'alaihi wa sallam. Hikmah Allah Ta’ala menjadikan untuk para nabi musuh-musuh mereka dan adanya pembela-pembela kebatilan adalah agar terjadi ujian bagi manusia, di mana dari sana diketahui orang yang jujur dengan orang yang berdusta, orang yang berakal dengan orang yang jahil (bodoh), dan orang yang melihat dengan orang yang buta. Hikmah lainnya adalah untuk menerangkan yang hak dan memperjelasnya, karena kebenaran akan semakin nampak dan jelas ketika dihadapkan dengan yang batil, sebagaimana terangnya siang hari dapat diketahui dengan adanya malam hari. Maksudnya setan-setan jenis jin dan manusia berupaya menipu manusia agar tidak beriman kepada Nabi shallallahu 'alaihi wa sallam dengan perkataan yang terkesan indah, sehingga mereka melihat kebenaran sebagai kebatilan dan kebatilan sebagai kebenaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 112",
    "description": "Untuk menenangkan hati nabi Muhammad, Allah menjelaskan bahwa adanya penentangan dari berbagai pihak adalah sesuatu yang biasa dihadapi dahulu oleh para nabi dan pembawa kebenaran. Dan demikianlah untuk setiap nabi kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin, manusia jika sudah dikuasai oleh setan, maka itulah setan yang berwujud manusia, sebagian mereka membisikkan kepada sebagian yang lain perkataan yang indah sebagai tipuan agar manusia tertarik oleh rayuannya, padahal hal itu akan menjerumuskan orang yang mengikuti ajakannya. Setiap nabi pasti mempunyai musuh. Itu adalah kehendak Allah, sesuai dengan hikmah-Nya. Untuk itu, kalau tuhanmu menghendaki, niscaya mereka tidak akan melakukannya, yaitu tidak akan memusuhi para nabi, dan tidak akan melakukan kebohongan itu, karena semua itu berada dalam kekuasaan Allah. Maka biarkanlah mereka bersama apa, yakni kebohongan, yang mereka adaadakan. Dengan demikian, Allah bisa melihat siapa di antara mereka yang taat dan siapa yang durhaka. Mereka yang ikut bisikan setan pasti akan tahu akibat dari perbuatan mereka. Kemudian Allah menjelaskan lagi tentang hikmah di balik semua itu melalui tiga hal, yaitu tertarik kepada kebatilan yang diembuskan kepada mereka, menyenanginya, dan melakukannya, seperti dijelaskan pada ayat berikut. Dan agar hati kecil orang-orang yang tidak beriman kepada akhirat, tertarik kepada bisikan itu, karena kerapuhan iman mereka, dan bukan cuma tertarik, tetapi juga menyenanginya, mereka rela dan senang terhadap apa yang mereka dengar, dan agar mereka melakukan apa yang biasa mereka lakukan. Keimanan kepada hari akhir adalah benteng yang bisa menjaga manusia dari godaan setan. Jika tidak, manusia bisa melakukan apa saja, mengikuti hawa nafsunya sendiri. Dia tidak merasa harus bertanggung jawab terhadap perbuatannya itu di akhirat kelak."
  }
]