[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan agar lebih condong kepada bisikan itu hati orang-orang kafir yang tidak mempercayai kehidupan akhirat dan tidak beramal untuk akhirat mereka,dan supaya jiwa-jiwa mereka menyukainya serta supaya mereka mengusahakan perbuatan buruk yang mereka perbuat. Disini terkandung satu ancaman keras terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Supaya hati orang-orang yang tidak percaya kepada akhirat cenderung kepada bisikan-bisikan mereka dan agar mereka menerimanya dengan lapang dada untuk diri mereka. Dan juga supaya mereka melakukan perbuatan-perbuatan maksiat serta dosa yang biasa dilakukan para musuh tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": ""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَلِتَصْغَىٰٓ إِلَيْهِ أَفْـِٔدَةُ الَّذِينَ لَا يُؤْمِنُونَ بِالْءَاخِرَةِ (Dan (juga) agar hati kecil orang-orang yang tidak beriman kepada kehidupan akhirat cenderung kepada bisikan itu) Yakni agar hati para pelaku kebathilan dan pecinta dunia condong kepada kebathilan dan kepada bisikan-bisikan indah para setan dari golongan jin dan manusia. وَلِيَرْضَوْهُ (mereka merasa senang kepadanya) Yakni ridha untuk diri mereka hal tersebut setelah mereka mendengarkan bisikan-bisikan itu. وَلِيَقْتَرِفُوا۟ مَا هُم مُّقْتَرِفُونَ(dan supaya mereka mengerjakan apa yang mereka (syaitan) kerjakan) Berupa dosa-dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113 Syetan-syetan itu membisikkan kepada lain mereka dengan perkataan yang menipu untuk mengubah iman mereka. Juga agar hati kecil orang-orang yang tidak beriman kepada kehidupan akhirat cenderung kepada bisikan buruk itu juga hanya kepada dunia. Yang tidak beriman kepada hari akhirat agar mereka merasa senang kepada diri mereka dan supaya mereka mengerjakan apa yang syetan kerjakan berupa dosa dan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar tertarik pada bisikan itu} agar condong kepada perkataan yang bathil itu {hati kecil orang-orang yang tidak beriman pada akhirat serta menyukaiinya, dan agar mereka melakukan} mengerjakan {apa yang biasa mereka lakukan} dosa-dosa yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113. Oleh karena itu, Allah berfirman, “Agar cenderung kepada bisikan itu,” maksdunya, condong kepada ungkapan tersebut “hati kecil orang-orang yang tidak beriman kepada kehidupan akhirat.” Karena ketidak imanan mereka kepada Hari Akhir dan ketiaadan akal mereka yang berguna yang telah membawa mereka kepada hal tersebut. “Agar mereka merasa senang kepadanya,” setalah mereka cendarung kepadanya. Mereka cenderung kepadanya lebih dahulu, lalu apabila mereka condong kepadanya dan melihat kata-kata indah itu, maka mereka rela menerimanya, dan ia dihiasi kesesatan dalam hati mereka lalu menjadi keyakinan yang terpatri dan sifat yang tidak terpisahkan, kemudian akibat dari itu adalah munculnya perbuatan-perbuatan dan perkataan yang telah diperbuat oleh setan yakni mereka mendatangkan ucapan dan perbuatan dusta yang merupakan konsekuensi dari keyakinan-keyakinan buruk ini. Inilah keadaan orang-orang yang berdusta, setan-setan manusia dan jin yang menjawab ajakan mereka. Adapun orang-orang yang beriman kepada Hari Akhir, para pemilik akal yang sempurna, dan pemikiran yang terukur, maka mereka tidak tertipu oleh kata-kata tersebut, mereka tidak terjerat oleh jebakan-jebakan tersebut, justru semangat mereka diarahkan untuk mengetahui hakikat-hakikat keimanan kepada Hari Akhir, mereka menelaah kata-kata yang dilontarkan oleh para penyeru, jika benar maka mereka menerimanya dan tunduk kepadanya meskipun dibungkus dengan kata-kata yang kurang dan ungkapan-ungkapan yang tidak memadai, dan jika mereka batil maka mereka akan mengambalikannya kepada pengusungnya, siapa pun dia, meskipun ia dibungkus dengan kata-kata yang indah yang labih lembut dari surta. Di antara hikmah Allah menjadikan musuh-musuh bagi para Nabi dan peyongkong bagi kebatilan adalah sebagai realisasi adalah ujian kepada manusia agar orang yang benar dan orang yang dusta, orang yanh berkalan dengan orang bodoh, orang yang melihat dengan orang yang buta menjadi terbedakan. Dan di antara hikamNya adalah hal itu , mengandung penjelasan dan keterangan terhadap kebenaran karena kebenaran menjadi bercahaya dan bersinar jika kebatilan berdiri melawan dan memusuhinya, dalam kondisi itu dalil-dalil dan bukti-bukti kebenaran menjadi nyata yang menunjukan kepada kebenaran dan hakikatnya, begitupula keburukan dan kerusakan kebatilan akan terlihat secara nyata yang mana itu termasuk target besar, yang dicari-cari oleh orang-orang yang berlomba-lomba mencarinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 113: Berupa dosa-dosa, sehingga mereka akan diberi hukuman. Adapun orang-orang yang beriman kepada kehidupan akhirat; pemilik akal yang sehat, mereka tidak tertipu oleh kata-kata indah itu, bahkan yang mereka perhatikan adalah hakikat yang sebenarnya, mereka melihat makna yang terkandung dari kata-kata itu, jika benar maka mereka menerima dan tunduk kepadanya meskipun dibungkus dengan kata-kata yang kurang indah, namun jika batil, maka mereka menolaknya meskipun dibungkus dengan kata-kata yang indah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 113",
    "description": "Dan agar hati kecil orang-orang yang tidak beriman kepada akhirat, tertarik kepada bisikan itu, karena kerapuhan iman mereka, dan bukan cuma tertarik, tetapi juga menyenanginya, mereka rela dan senang terhadap apa yang mereka dengar, dan agar mereka melakukan apa yang biasa mereka lakukan. Keimanan kepada hari akhir adalah benteng yang bisa menjaga manusia dari godaan setan. Jika tidak, manusia bisa melakukan apa saja, mengikuti hawa nafsunya sendiri. Dia tidak merasa harus bertanggung jawab terhadap perbuatannya itu di akhirat kelakkemudian nabi Muhammad diperintahkan untuk berkata kepada kaum musyrik tentang siapa yang pantas untuk menjadi hakim yang menentukan benar atau salahnya suatu persoalan. Pantaskah aku mencari hakim selain Allah untuk memutuskan siapa di antara kita yang benar, padahal dialah yang menurunkan kitab Al-Qur'an kepadamu secara rinci tentang sesuatu yang hak dan yang batil, yang bagus dan yang buruk, yang halal dan yang haram' orang-orang yang telah kami beri kitab seperti orang yahudi dan nasrani mengetahui benar melalui kitab-kitab yang diturunkan kepada mereka dan apa yang diceritakan oleh nabi-nabi mereka, bahwa Al-Qur'an itu diturunkan dari tuhanmu dengan benar. Maka janganlah kamu termasuk orang-orang yang ragu terhadap apa yang diwahyukan Allah kepadamu, wahai rasul. Ungkapan ini ditujukan kepada pengikutnya, karena sesungguhnya rasulullah sama sekali tidak ragu terhadap wahyu Allah dan kebenaran agama islam."
  }
]