[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”Apakah kepada selain Allah yang merupakan tuhanku dan tuhan kalian, aku harus mencari hakim pemutus ketetapan hukum antara aku dan kalian? Padahal Dia lah yang telah menurunkan al-qur’an dengan menjelaskan di dalamnya tentang hukum dalam persoalan yang kalian pertentangkan di dalamnya tentang urusanku dan urusan kalian?” Dan bani israil yang diberi taurat dan injil oleh Allah, mereka mengetahui dengan seyakin-yakinnya bahwa sesungguhnya al-qur’an ini diturunkan kepadamu (wahai rasul), dari tuhanmu dengan haq. maka janganlah sekali-kali engkau termasuk orang yang ragu-ragu terhadap apa yang kami wahyukan kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang menyembah tuhan lain selain Allah itu, “Apakah masuk akal bila aku menerima selain Allah sebagai hakim antara aku dan kalian?” Sedangkan Allah adalah Rabb yang menurunkan kitab suci Al-Qur`ān kepada kalian untuk memberikan penjelasan yang cukup tentang segala sesuatu. Sementara orang-orang Yahudi yang Kami beri kitab suci Taurat dan orang-orang Nasrani yang Kami beri kitab suci Injil pun tahu bahwa kitab suci Al-Qur`ān diturunkan kepadamu yang mengandung kebenaran. Hal itu karena mereka menemukan penjelasan tentang hal itu di dalam kitab suci mereka masing-masing. Jadi jangan sekali-kali kamu merasa bimbang terhadap apa yang Kami wahyukan kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Hai Rasulallah, katakanlah: \"Apakah aku layak mencari hakim selain Allah untuk memberi keputusan antara aku dengan kalian, sedangkan Dia telah menurunkan kepada kalian al-Qur'an yang mengandung kebenaran dan penjelasan tentang hidayah dan kesesatan? Dan orang-orang yang telah kami beri mereka Taurat dan Injil mengetahui dengan pasti bahwa al-Qur'an diturunkan kepadamu dengan sebenar-benarnya, maka janganlah kamu termasuk orang-orang yang ragu bahwa mereka tidak mengetahui kebenaran tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. أَفَغَيْرَ اللهِ أَبْتَغِى حَكَمًا (Maka patutkah aku mencari hakim selain daripada Allah) Allah memerintahkan Rasulullah agar mengingkari apa yang mereka minta kepada dirinya, yakni untuk mengambil seorang hakim yang memutuskan perselisihan diantara mereka dan dirinya. Dan Allah adalah Hakim yang Maha Adil bagi meraka. وَهُوَ الَّذِىٓ أَنزَلَ إِلَيْكُمُ الْكِتٰبَ مُفَصَّلًا ۚ( padahal Dialah yang telah menurunkan kitab (Al Quran) kepadamu dengan terperinci?) Yakni kitab yang jelas, terang, dan mengandung segala perkara secara terperinci. وَالَّذِينَ ءَاتَيْنٰهُمُ الْكِتٰبَ (Orang-orang yang telah Kami datangkan kitab kepada mereka) Meskipun mereka menunjukkan keingkaran dan kecongkakan namun mereka mengetahui bahwa Al Quran itu diturunkan dari Tuhanmu dengan sebenarnya. يَعْلَمُونَ أَنَّهُۥ مُنَزَّلٌ مِّن رَّبِّكَ بِالْحَقِّ ۖ (mereka mengetahui bahwa Al Quran itu diturunkan dari Tuhanmu dengan sebenarnya) Yakni mengetahui bahwa al-qur’an diturunkan dari sisi Allah sebagaimana ditunjukkan oleh kitab-kitab Allah yang diturunkan-Nya seperti Taurat dan Injil. فَلَا تَكُونَنَّ مِنَ الْمُمْتَرِينَ (Maka janganlah kamu sekali-kali termasuk orang yang ragu-ragu) Yakni janganlah keraguan masuk kedalam dadamu disebabkan usulan mereka dan tidak turunnya mukjizat-mukjizat sesuai permintaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114 Wahai orang-orang musyrik, patutkah aku mencari hakim antar aku dan engkau yang lebih adil selain Allah? Demi Allah, Dia lah Yang telah menurunkan Al Quran kepadamu dengan terperinci dan jelas? Kitab yang menjelaskan benar dan buruk. Ulama-ulama ahli kitab, mereka mengetahui bahwa Al Quran itu diturunkan dari Tuhanmu dengan sebenarnya tanpa ada keraguan, seperti Taurat dan Injil. Maka janganlah kamu sekali-kali termasuk orang yang ragu-ragu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka apakah kepada selain Allah aku mencari} mencari {seorang hakim} hakim di antara aku dan kalian {padahal Dialah yang menurunkan Kitab kepada kalian secara terperinci} menjelaskan dan mengumpulkan setiap sesuatu {dan orang-orang yang telah Kami anugerahi Kitab mengetahui sesungguhnya itu diturunkan dari Tuhanmu dengan benar. Maka janganlah sekali-kali kamu termasuk orang-orang yang ragu} orang-orang yang ragu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114. Katakan wahai Rasul, “Maka patutkah aku mencari hakim selain dari Allah?” aku beehukum dan berpengang kepada perintah-perintahNya dan larangan-laranganNya, karena selain Allah adalah objek hukum bukan peletak hukum. Semua pengaturan dan hukum manusia pasti mengadung cacat, kekurangan dan kezhaliman. Yang semestinya dijadikan sebagai hakim adalah Allah semata, tidak ada sekutu bagiNya, yang memilki hak mencipta dan memerintah. “Padahal Dia-lah yang menurunkan kitab (Al-Qur’an) kepadamu dengan terperinci?” maksudnya, di dalamnya di jelaskan halal haram, hukum-huum syar’I, pokok-pokok dan cabang-cabang agama yang tidak ada penjelasan di atas penjelasanNya, tidak ada bukti yang lebih jelas daripada buktiNya, tidak ada yang lebih baik hukumnya dibandingkan Dia, karena hukum-hukumNya mengandung hikmah dan rahmat, dan ahli kitab; orang-orang Yahudi dan Nasrani dahulu mengakui itu. “Mereka mengatahui bahwa Al-Qur’an itu diturunkan dari Tuhanmu dengan sebenarnya.” Oleh karena itu, berita-berita tentangnya berkesesuaiannya, “maka janganlah sekali-kali kamu termasuk orang-orang yang ragu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 114: Ayat ini turun ketika orang-orang kafir meminta diadakan hakim antara Beliau dengan mereka. Padahal selain Alah adalah mahkum ‘alaih (yang dihukumi); bukan hakim. Dan lagi setiap keputusan makhluk mengandung kekurangan, cacat dan kezaliman, bahkan yang wajib dijadikan hakim adalah Alah saja, tidak ada sekutu bagi-Nya, di mana Dia yang menciptakan dan memerintah. Dalam Al Qur’an diterangkan secara rinci yang halal dan yang haram, hukum-hukum syar’i, pokok-pokok agama dan cabang-cabangnya, di mana tidak ada penjelasan yang melebihi penjelasannya, tidak ada bukti yang melebihi buktinya, dan tidak ada yang lebih baik hukumnya daripadanya, serta tidak ada yang lebih lurus perkataannya daripadanya, karena hukum-hukumnya mengandung hikmah dan rahmat. Seperti Abdullah bin Salam dan kawan-kawannya atau Ahli Kitab terdahulu dari kalangan Yaudi dan Nasrani. Ayat ini merupakan taqrir (pernyataan) kebenaran Al Qur’an kepada orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 114",
    "description": "Kemudian nabi Muhammad diperintahkan untuk berkata kepada kaum musyrik tentang siapa yang pantas untuk menjadi hakim yang menentukan benar atau salahnya suatu persoalan. Pantaskah aku mencari hakim selain Allah untuk memutuskan siapa di antara kita yang benar, padahal dialah yang menurunkan kitab Al-Qur'an kepadamu secara rinci tentang sesuatu yang hak dan yang batil, yang bagus dan yang buruk, yang halal dan yang haram' orang-orang yang telah kami beri kitab seperti orang yahudi dan nasrani mengetahui benar melalui kitab-kitab yang diturunkan kepada mereka dan apa yang diceritakan oleh nabi-nabi mereka, bahwa Al-Qur'an itu diturunkan dari tuhanmu dengan benar. Maka janganlah kamu termasuk orang-orang yang ragu terhadap apa yang diwahyukan Allah kepadamu, wahai rasul. Ungkapan ini ditujukan kepada pengikutnya, karena sesungguhnya rasulullah sama sekali tidak ragu terhadap wahyu Allah dan kebenaran agama islampada ayat ini Allah menandaskan kesempurnaan Al-Qur'an dari segi isinya. Dan telah sempurna firman tuhanmu, yakni Al-Qur'an, dengan benar dari segi pemberitaannya dan adil dari segi hukumnya. Dengan kata lain, ketetapan Allah dalam menolong rasul dan kaum mukmin dan menghinakan orang kafir telah bulat. Tidak ada yang dapat mengubah firman-Nya karena semua yang ada di dalam Al-Qur'an sudah benar-benar kukuh, tidak perlu ada perubahan. Inilah janji Allah untuk menjaga kemurnian Al-Qur'an. Dan dia maha mendengar terhadap segala ucapan-ucapan yang menipu, maha mengetahui apa yang ada di dalam hati seperti niat dan keinginan-keinginan."
  }
]