[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah sempurnalah kalimat tuhanmu, (yaitu al-qur’an) kalimat yang benar dalam berita-berita dan pernyataan-pernyataannya, dan adil dalam hukum-hukumnya. Tidak ada seorangpun yang mampu mengganti kalimat-kaliamatNya yang sempurna. Dan Allah Dialah yang maha mendengar semua apa yang diucapkan oleh para hambaNya, juga maha mengetahui urusan batin mereka dan urusan lahir mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Dan Al-Qur`ān sebagai kitab yang paling benar dalam kata-katanya dan beritanya. Tidak ada yang dapat mengubah kalimat-kalimatnya. Dan Dia lah Rabb Yang Maha Mendengar ucapan hamba-hamba-Nya lagi Maha Mengetahuinya, sehingga tidak ada sesuatu pun yang luput dari pengetahuan Nya. Dan Dia akan memberi mereka balasan bagi yang berusaha mengubah kalimat-kalimat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "115. Dan kalimat Allah telah menjadi kenyataan tentang apa yang dikabarkannya karena ia benar, dan telah sempurna hukum-hukum yang diperintahkan di dalamnya karena ia adil. Dan tidak ada seorangpun yang mampu mengubah kalimat dan hukum-hukum-Nya. Dia Maha Mendengar segala perkataan dan Maha Mengetahui segala perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. وَتَمَّتْ كَلِمَتُ رَبِّكَ (Telah sempurnalah kalimat Tuhanmu (Al-Quran)) Yakni Allah telah menyempurnakan janji dan ancaman-Nya serta telah menurunkan syariat-Nya sehingga jelaslah kebenaran dan sirnalah kebathilan. صِدْقًا وَعَدْلًا ۚ (sebagai kalimat yang benar dan adil) Yakni benar dalam berita-beritanya dan adil dalam perintah-perintah dan hukum-hukum-Nya. لَّا مُبَدِّلَ لِكَلِمٰتِهِۦ ۚ (Tidak ada yang dapat merubah rubah kalimat-kalimat-Nya) Tidak ada penganti dan perubah atas hukum yang ditetapkan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115 Kalimat Tuhanmu (Al-Quran) telah sempurna, syariat yang sempurna. Juga telah sempurna janji pertolongan Allah kepada Nabi-Nya, benar dalam khabar dan sebagai perintah dan hukum yang benar dan adil. Tidak ada yang dapat merubah rubah kalimat-kalimat-Nya dan Dialah yang Maha Mendengar kepada perkataan hamba-Nya lagi Maha Mengetahui atas kondisi hamba-Nya, serta Maha Memberi balasan atas segala amal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Telah sempurna kalam Tuhanmu} telh selesai firman Tuhanmu {dengan kebenaran dan keadilan. Tidak ada yang dapat mengubah kalam-kalamNya} tidak ada yang bisa mengubah hukum-hukumNya dan tidak ada yang bisa membatalkan janjiNya {Dia Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115. Kemudian Allah menjelaskan perincianNya, Dia berfirman, “telah empurnh kalimat Tuhanmu sebagai kalimat yang benar dan adil.” Maksudnya benar dalam berita yang adil dalam perintah dan larangan. Tidak ada yang lebih benar daripada berita-berita Allah yang dimuat di dalam berita yang mulia ini, tidak ada yang lebih adil daripada perintah-perintah dan laranganNya. “ dengan bentuk kebenaran tertinggi dan dengan kebenaran paling mulia, maka tidak mungkin merubahnya dan tidak ada perdapat yang diusulkan yang lebih baik darinya. “Dan Dia-lah yang Maha Mendengar” seluruh suara dengan bahasa yang berbeda-beda dan kepentingan yang bermacam-macam. “Lagi Maha Mengetahui,” Dzat Yang ilmuNya meliputi yang lahir, yang batin, yang lampau dan yang akan datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 115: Dengan hukum-hukum dan janji-janji. Berita-beritanya benar. Perintah dan larangannya adil. Terhadap semua perkataan. Terhadap semua yang nampak maupun yang tersembunyi, yang lalu maupun yang akan datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 115",
    "description": "Pada ayat ini Allah menandaskan kesempurnaan Al-Qur'an dari segi isinya. Dan telah sempurna firman tuhanmu, yakni Al-Qur'an, dengan benar dari segi pemberitaannya dan adil dari segi hukumnya. Dengan kata lain, ketetapan Allah dalam menolong rasul dan kaum mukmin dan menghinakan orang kafir telah bulat. Tidak ada yang dapat mengubah firman-Nya karena semua yang ada di dalam Al-Qur'an sudah benar-benar kukuh, tidak perlu ada perubahan. Inilah janji Allah untuk menjaga kemurnian Al-Qur'an. Dan dia maha mendengar terhadap segala ucapan-ucapan yang menipu, maha mengetahui apa yang ada di dalam hati seperti niat dan keinginan-keinginan. Setelah menjelaskan tentang kebenaran nabi Muhammad, Allah melarangnya untuk menghiraukan musuh-Musuhnya yang tidak mau tergerak untuk mengikuti petunjuk Allah. Dan jika kamu mengikuti kebanyakan orang di bumi ini yang memilih kesesatan daripada hidayah, niscaya mereka akan menyesatkanmu dari jalan Allah. Yang mereka ikuti hanya persangkaan belaka yang tidak memiliki landasan yang kuat, hanya karena mengikuti hawa nafsu belaka yang terus membuai mereka, dan mereka hanyalah membuat kebohongan yang tidak sesuai dengan kenyataan."
  }
]