[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya ditetapkan (wahai rasul), bahwasanya engkau menuruti kebanyakan orang-orang yang berada di muka bumi, niscaya mereka akan menyesatkanmu dari agama Allah. Mereka tidaklah berjalan kecuali di atas jalur yang mereka sangka-sangka sebagai kebenaran berdasarkan taklid mereka terhadap para pendahulu (nenek moyang) mereka. Dan tidaklah mereka berbuat kecuali sekedar berprasangka belaka dan berdusta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Jika seumpama kamu -wahai Rasul- mengikuti kebanyakan manusia yang ada di muka bumi, niscaya mereka akan menyesatkanmu dari agama Allah. Karena sunatullah yang berlaku menunjukkan bahwa kebenaran selalu minoritas. Karena sebagian besar manusia hanya mengikuti prasangka yang tidak berdasar. Mereka menyangka bahwa berhala-berhala yang mereka sembah itu dapat mendekatkan mereka kepada Allah, padahal mereka berdusta tentang hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Dan jika kamu mentaati kebanyakan manusia dan jin niscaya mereka akan menyesatkanmu dari agama Allah. Apa yang mereka ikuti dalam perkara agama hanyalah prasangka batil yang mereka dapatkan dari mengikuti nenek moyang; mereka tidak lain hanyalah orang-orang yang berdusta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. وَإِن تُطِعْ أَكْثَرَ مَن فِى الْأَرْضِ يُضِلُّوكَ عَن سَبِيلِ اللهِ ۚ (Dan jika kamu menuruti kebanyakan orang-orang yang di muka bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah) Kerena sunnatullah telah berlaku bagi para makhluk-Nya bahwa kebenaran hanya akan berada dipihak minoritas, adapun yang mayoritasnya mengikuti hawa nafsu dalam urusan agama mereka. إِن يَتَّبِعُونَ إِلَّا الظَّنَّ(Mereka tidak lain hanyalah mengikuti persangkaan belaka) Yakni prasangka yang tidak berdasar, yaitu prasangka mereka bahwa sesembahan-sesembahan mereka berhak untuk diibadahi dan dapat mendekatkan mereka kepada Allah. وَإِنْ هُمْ إِلَّا يَخْرُصُونَ(dan mereka tidak lain hanyalah berdusta (terhadap Allah)) Yakni hanya menerka-nerka dan mengira-ngira."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jadikanlah agama ini sebagai ukuran, maka jika kamu melihat umat manusia berjalan di atas kebathilan maka jauhilah dan janganlah kamu berjalan bersama mereka, dan jangan pula kamu berdalih dengan banyaknya jumlah manusia yang berada di jalan tersebut, karena jumlah yang banyak sebagian besar mereka berada di ats kesesatan, Allah telah berfirman : { وَإِنْ تُطِعْ أَكْثَرَ مَنْ فِي الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ اللَّهِ ۚ} \"Dan jika kamu menuruti kebanyakan orang-orang yang di muka bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah\" { وَمَا أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ } \"Dan sebahagian besar manusia tidak akan beriman — walaupun kamu sangat menginginkannya\". [ Yusuf : 103 ] 2 ). Diantara sebab terbesar runtuhnya beberapa da'i dari jalan dakwah yang mereka tempuh, adalah mereka menjadikan banyaknya jumlah pengikut sebagai ukuran keberhasilan suatu dawah; dan hakikatnya ittiba' kepada syaiton itu jumlahnya lebih banyak daripada ittiba' kepada Rasulullah, perhatikan firman Allah : { وَإِنْ تُطِعْ أَكْثَرَ مَنْ فِي الْأَرْضِ يُضِلُّوكَ عَنْ سَبِيلِ اللَّهِ ۚ} \"Dan jika kamu menuruti kebanyakan orang-orang yang di muka bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah\" Karena siapapun yang bersandar kepada jumlah yang banyak, dan menganggapnya sebagai timbangan, maka tidak diragukan lagi ke ikut sertaannya dalam kelompok yang banyak itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116 Dan jika kamu wahai Nabi menuruti kebanyakan manusia di muka bumi ini yaitu orang kafir, niscaya mereka akan menyesatkanmu dan menjauhkanmu dari dari jalan Allah yang benar. Mereka tidak lain hanyalah mengikuti persangkaan belaka atas agama mereka yang tidak ada dasarnya, dan mereka tidak lain hanyalah berdusta terhadap Allah tanpa ilmu dan petunjuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu mengikuti kebanyakan orang di bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah} agama Allah {Mereka hanya mengikuti persangkaan belaka dan mereka hanyalah membuat kebohongan} berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116. Allah memperingatkan NabiNya agar tidak menuruti mayoritas manusia. Dia berfirman, “Dan jika kamu menuruti kebanyakan orang-orang yang di muka bumi ini, niscaya mereka akan menyesatkanmu dari jalan Allah.” Karena kebanyakan manusia telah menyimpang dalam agama, amal, dan ilmuNya. Agama mereka rusak, amal mereka memperturutkan hawa nafsu, ilmu mereka serabutan, tak bisa mengantarkan ke jalan yang lurus, hanya sebatas mengikuti praduga yang tidak berguna sedikitpun bagi kebenararan dan berspekulasi dalam memberikan pernyataan atas Nama Allah tanpa landasan ilmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 116: Dalam ayat ini, Allah Ta’ala mengingatkan nabi-Nya agar tidak mengikuti kebanyakan manusia, karena yang mereka ikuti hanyalah persangkaan belaka. Hal itu, karena agama mereka telah menyimpang, sebagaimana amal dan ilmu mereka pun telah menyimpag. Ayat ini menunjukkan bahwa banyaknya orang yang melakukan sesuatu bukanlah menjadi tolok ukur terhadap suatu kebenaran, dan menunjukkan bahwa sedikitnya orang yang menempuh tidaklah menunjukkan tidak berada di atas kebenaran, oleh karenanya para pengikut kebenaran adalah orang yang paling sedikit jumlahnya, namun paling tinggi kedudukan dan pahalanya di sisi Allah. Seperti dalam perdebatan mereka denganmu tentang masalah bangkai, mereka berkata untuk menghalalkan bangkai, “Apa yang Allah matikan (bangkai) lebih berhak kamu makan daripada yang kamu matikan.” Seperti menghalalkan memakan apa yang telah diharamkan Allah dan mengharamkan apa yang telah dihalalkan Allah, menyatakan bahwa Allah mempunyai anak, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 116",
    "description": "Setelah menjelaskan tentang kebenaran nabi Muhammad, Allah melarangnya untuk menghiraukan musuh-Musuhnya yang tidak mau tergerak untuk mengikuti petunjuk Allah. Dan jika kamu mengikuti kebanyakan orang di bumi ini yang memilih kesesatan daripada hidayah, niscaya mereka akan menyesatkanmu dari jalan Allah. Yang mereka ikuti hanya persangkaan belaka yang tidak memiliki landasan yang kuat, hanya karena mengikuti hawa nafsu belaka yang terus membuai mereka, dan mereka hanyalah membuat kebohongan yang tidak sesuai dengan kenyataan pernyataan di atas menjadi bukti kemukjizatan Al-Qur'an, karena ternyata banyak sekali manusia yang jauh dari petunjuk Allah, baik dari kalangan ahli kitab maupun lainnya. Hanya Allah yang mengetahui keadaan makhluk-Nya. Siapa di antara mereka yang sesat dan siapa di antara mereka yang mendapat petunjuk. Sesungguhnya tuhanmu, dialah yang lebih mengetahui siapa yang tersesat dari jalan-Nya, dan dia lebih mengetahui orang-orang yang mendapat petunjuk. Semuanya akan mendapatkan balasan dari Allah di hari akhir kelak. Siapa yang mendapat petunjuk akan masuk surga, dan yang menolak kebenaran akan masuk neraka."
  }
]