[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tuhanmu, Dia lebih mengetahui tentang orang-orang yang istiqamah dan berada di atas jalan lurus.dan Dia lebih mengetahui siapa dianatara kalian dan diantara mereka siapa saja yang berada di jalan istiqomah dan kebenaran. Tidak ada yang samar bagiNya seorangpun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Sesungguhnya Rabbmu -wahai Rasul- lebih tahu tentang orang yang tersesat dari jalan-Nya dan lebih tahu tentang orang yang mengikuti jalan-Nya. Tidak ada sesuatu pun terkait hal itu yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Sesungguhnya Penciptamu lebih mengetahui siapa orang yang tersesat dari jalan hidayah dan lebih mengetahui siapa yang mendapat petunjuk menuju agama Allah yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117 Sesungguhnya Tuhanmu wahai nabi, Dialah yang lebih mengetahui tentang orang yang tersesat dari jalan-Nya dan Dia lebih mengetahui tentang orang orang yang istiqamah dan mendapat petunjuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmu, Dialah yang lebih mengetahui siapa yang tersesat dari jalanNya dan Dia yang lebih mengetahui orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117. Orang-orang yang seperti inilah yang layak Allah memperingatkan hamba-hambaNya dariNya dan menjelaskan keadaannya pada mereka. Karena ini, walaupun ia di tujukan kepada nabi akan tetapi umatnya mengikutinya dalam hukum-hukum lainya yang bukan kekhususannya. Perkataan dan perbicaraan Allah adalah yang paling benar dan “Dan Dia-lah yang lebih mengetahui tentang orang yang tersesat dari jalanNya.” Dan Dia lebih mengetahui tentang orang-orang yang mendapat petunjuk dan memberi petunjuk, maka wajib atasmu wahai orang-orang Mukmin untuk mengetahui nasihat-nasihat, perintah-perintah, dan larangan-laranganNya, karena Dia lebih mengetahui kemaslahatanmu dan lebih menyayangimu daripada dirimu sendiri. Ayat ini menunjukan bahwa kebenaran tidak dibuktikan dengan banyaknya pendukung, dan minimnya pendukung dalam salah satu perkara tidak menunjukan bahwa itu di atas kebenaran, tetapi yang tealistis adalah kebalikan dari itu, para pengikut kebenaran lebih minim jumlahNya, akan tetapi kedudukan dan pahala mereka lebih besar di sisi Allah. Yang wajib adalah mencari dalil kebenaran dan kebatilan dengan jalan yang mengantarkan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 117: Oleh karena itu, kamu wahai kaum mukmin wajib mengikuti nasehat-Nya, melaksanakan perintah-Nya dan menjauhi larangan-Nya, karena Dia lebih mengetahui hal yang lebih bermaslahat bagi kamu dan lebih sayang kepada dirimu daripada dirimu sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 117",
    "description": "Pernyataan di atas menjadi bukti kemukjizatan Al-Qur'an, karena ternyata banyak sekali manusia yang jauh dari petunjuk Allah, baik dari kalangan ahli kitab maupun lainnya. Hanya Allah yang mengetahui keadaan makhluk-Nya. Siapa di antara mereka yang sesat dan siapa di antara mereka yang mendapat petunjuk. Sesungguhnya tuhanmu, dialah yang lebih mengetahui siapa yang tersesat dari jalan-Nya, dan dia lebih mengetahui orang-orang yang mendapat petunjuk. Semuanya akan mendapatkan balasan dari Allah di hari akhir kelak. Siapa yang mendapat petunjuk akan masuk surga, dan yang menolak kebenaran akan masuk neraka. Pada ayat ini dijelaskan tentang persoalan makanan yang banyak diperdebatkan oleh orang-orang musyrik. Abu da'wud meriwayatkan dari ibnu 'abba's bahwa seseorang bertanya kepada rasulullah, mengapa kami boleh memakan daging hewan yang kami sembelih sendiri dan tidak boleh memakan hewan yang dimatikan oleh Allah (yakni: bangkai)' turunlah ayat ini, maka makanlah dari apa, yaitu daging hewan, yang ketika disembelih disebut nama Allah, jika kamu beriman kepada ayat-ayat-Nya. Itu karena keimanan akan mendorong seseorang memakan apa yang dihalalkan dan menjauhi apa yang diharamkan."
  }
]