[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka makanlah sembelihan-sembelihan yang telah disebut nama Allah ketika menyembelihnya, jika kalian beriman kepada petunjuk-petunjuk Allah yang jelas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Makanlah -wahai manusia- binatang yang disembelih dengan menyebut nama Allah, jika kalian benar-benar percaya akan bukti-bukti yang nyata dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Hai orang-orang yang beriman, makanlah hewan sembelihan yang telah disebutkan nama Allah pada saat proses penyembelihannya jika kalian termasuk orang-orang yang beriman kepada hukum-hukum Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. فَكُلُوا۟ مِمَّا ذُكِرَ اسْمُ اللهِ عَلَيْهِ إِن كُنتُم بِـَٔايٰتِهِۦ مُؤْمِنِينَ (Maka makanlah binatang-binatang (yang halal) yang disebut nama Allah ketika menyembelihnya, jika kamu beriman kepada ayat-ayat-Nya) Yakni janganlah kalian mengharamkannya atas diri kalian dan enggan memakannya dengan anggapan bahwa itu adalah perintah agama, karena semua sembelihan yang disembelih dengan menyebut nama Allah maka ia halal jika termasuk hewan yang dihalalkan Allah. إن كنتم بآياته مؤمنين (jika kamu beriman kepada ayat-ayat-Nya) Yakni beriman kepada hukum-hukum-Nya, baik itu perintah-perintah atau larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118 Maka makanlah binatang-binatang yang halal wahai orang-orang mukmin, yang disembelih dengan menyebut nama Allah jika kamu memang beriman kepada ayat-ayat-Nya. Ayat ini turun ketika seseorang berkata kepada Nabi: Wahai Rasulullah mengapa kita boleh memakan apa yang kita bunuh namun tidak boleh memakan apa yang telah Allah bunuh? Sehingga Allah menurunkan ayat (Fa kuluu mimma dzukira...)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Makanlah dari apa yang disebut nama Allah padanya} ketika disembelih {jika kalian beriman pada ayat-ayatNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118-119. Allah memerintahkan orang-orang beriman dengan tuntunan iman, bahwa jika mereka adalah orang-orang yang beriman maka hendaknya mereka memakan daging yang disembelih dengan menyebut Nama Allah dari binatang ternak dan binatang-binatang lain yang dihalalkan yang meyakini kehalalannya. Janganlah mereka melakukan apa yang di lakukan oleh orang-orang Jahiliyah yaitu mengharamkan apa-apa yang dihalalkan dalam jumlah banyak dan itu mereka adakan dalam diri mereka sendiri, dan penyesatan dari setan-setan mereka. Maka Allah menjelaskan tanda seorang Mukmin adalah diaa menyelisihi orang-orang Jahiliyah pada kebiasan orang-orang tercela ini yang mengandung penyimpangan pada syariat Allah. Apa gerangan yang menghalangi mereka untuk memakan sesuatu yang telah disebutkan Nama Allah telah menjelaskan dan memaparkan sembelihnya sementara Allah telah menjelaskan dan memaparkan secara terperinci apa-apa yang diharamkan atas mereka? Tidak ada lagi syubhat dan persoalan yang meharuskan mereka menolak makan sebagian yang hala karena takut terjatuh pada yang haram. Ayat yang mulia ini menujukan bahwa pada dasarnya segala sesuatu yang dimakan itu adalah mubah, dan bahwa pada dasarnya segala sesuatu jika tidak ada dalil syari’at yang mengharamkan sesuatu darinya, maka ia tetap berada di atas kehalalannya. Sesuatu yang Alah tidak bahas adalah halal, karena Dia telah merinci yang haram, maka sesuatu yang tidak Dia rinci berarti tidak haram, walaupun begitu dalam keadaan terpaksa dan kelaparan sesuatu yang haram telah dijelaskan oleh Allah secara rinci adalah halal, sebagaimanan firmanNYa, Diharamkan bagimu (memakan) bangkai, darah, daging babi, (daging hewan) yang disembelih atas nama selain Allah, yang tercekik, yang terpukul, yang jatuh, yang ditanduk, dan diterkam binatang buas, kecuali yang sempat kamu menyembelihnya, dan (diharamkan bagimu) yang disembelih untuk berhala. Dan (diharamkan juga) mengundi nasib dengan anak panah, (mengundi nasib dengan anak panah itu) adalah kefasikan. Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu, sebab itu janganlah kamu takut kepada mereka dan takutlah kepada-Ku. Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu. Maka barang siapa terpaksa karena kelaparan tanpa sengaja berbuat dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang. (Al-Maidah:3). Kemudian Allah memperingatkan kebanyakan manusia, Dia berfirman, “Dan sesunggguhnya kebanyakan dari manusia benar-benar hendak menyesatkan orang lain dengan hawa nafsu mereka.” Maksdunya, hanya dengan memperturutkan apa yang diinginkan oleh diri mereka “tanpa pengetahuan,” dan tanpa hujjah. Maka hendaknya hamba-hamba Allah berhati-hati dengan orang-orang yang seperti mereka . Tanda-tanda mereka seperti yang dujelaskan oleh Allah adalah bahwa ajakan mereka tidak dilandasi dengan bukti dan mereka tidak memiliki dalil syar’I, orang yang telah membuat pelanggaran kepada syriat Allah dan terhadap hamba-hambaNya, dan Allah tidak menyukai orang-orang yang malanggar. Lain halnya dengan orang-orang yang mendapatkan petunjuk dan memberi petunjuk, mereka menyeru kepada petunjuk dan kebenaran. Dan dalam dakwah, mereka hany mengikuti dan mencari ridha serta kedekatan kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 118: Dalam ayat ini, Allah Ta’ala memerintahkan hamba-hamba-Nya yang mukmin sebagai konsekwensi iman mereka agar mereka memakan daging hewan ternak maupun hewan halal lainnya yang disebut nama Allah ketika menyembelihnya dan agar mereka meyakini kehalalannya serta tidak melakukan seperti yang dilakukan kaum Jahiliyyah yang mengharamkan banyak yang halal. Allah menyebutkan, bahwa ciri orang mukmin adalah menyelisihi kaum Jahiliyyah dalam adat yang tercela ini yang isinya merubah syari’at Allah. Ayat yang mulia di atas juga menunjukkan bahwa hukum asal pada sesuatu dan pada makanan adalah mubah, dan bahwa jika tidak ada larangan dari syara’, maka tetap mubah, oleh karena itu apa yang didiamkan Allah adalah halal, karena perkara haram telah dirincikan Alah, sehingga jika tidak disebutkan, maka hukumnya halal. Meskipun yang haram telah dijelaskan secara rinci oleh Allah, namun Dia membolehkan untuk mengkonsumsinya ketika terpaksa dan ketika kelaparan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 118",
    "description": "Pada ayat ini dijelaskan tentang persoalan makanan yang banyak diperdebatkan oleh orang-orang musyrik. Abu da'wud meriwayatkan dari ibnu 'abba's bahwa seseorang bertanya kepada rasulullah, mengapa kami boleh memakan daging hewan yang kami sembelih sendiri dan tidak boleh memakan hewan yang dimatikan oleh Allah (yakni: bangkai)' turunlah ayat ini, maka makanlah dari apa, yaitu daging hewan, yang ketika disembelih disebut nama Allah, jika kamu beriman kepada ayat-ayat-Nya. Itu karena keimanan akan mendorong seseorang memakan apa yang dihalalkan dan menjauhi apa yang diharamkan. Terhadap mereka yang masih ragu-ragu, Allah menjelaskan sebagai berikut. Dan mengapa kamu tidak mau memakan dari apa, yakni daging hewan, yang ketika disembelih disebut nama Allah'seperti dengan membaca bismilla'h atau bismilla'h, alla'hu akbar'padahal Allah telah menjelaskan kepadamu apa yang diharamkan-Nya kepadamu seperti mengonsumsi bangkai, darah yang mengalir, daging babi, dan apa yang disembelih bukan atas nama Allah (lihat: surah al-an'a'm/6: 145) kecuali jika kamu dalam keadaan terpaksa seperti dalam keadaan sangat lapar yang jika dibiarkan akan berakibat kematian' dalam keadaan terpaksa, seseorang boleh memakan apa yang sebelumnya diharamkan, tetapi sekadar untuk mempertahankan hidup, tidak melewati batas, tidak bersenang-senang, dan sebenarnya dia tidak menginginkan '"
  }
]