[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa saja yang menghalangi kalian (wahai kaum muslimin), untuk memakan sembelihan yang disebut nama Allah ketika menyembelihnya, padahal sesungguhnya Allah telah menerangkan kepada kalian seluruh makanan yang diharamkannya atas kalian? Akan tetapi, dalam kondisi darurat yang disebabkan oleh kelaparan, dari barang-barang yang diharamkan atas kalian seperti bangkai, sesungguhnya menjadi boleh dimakan bagi kalian. Dan sesungguhnya kebanyakan orang-orang sesat pasti akan menyesatkan para pengikut mereka dari jalan Allah dalam urusan penghalalan barang-barang yang diharamkan dan pengharaman barang-barang halal dengan dorongan hawa nafsu mereka lantaran kebodohan mereka. Sesungguhnya tuhanmu (wahai rasul), lebih mengetahui orang yang melampaui batas dalam perkara tersebut. Dan Dia lah yang akan menangani perhitungan perbuatan orang itu dan balasan baginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Apa yang mencegah kalian -wahai orang-orang mukmin- untuk memakan binatang yang disembelih dengan menyebut nama Allah? Padahal Allah telah menjelaskan kepada kalian apa-apa yang diharamkan bagi kalian sehingga harus kalian tinggalkan, kecuali dalam kondisi darurat. Karena kondisi darurat membuat yang terlarang menjadi boleh. Dan banyak orang-orang musyrik yang tersesat berusaha menyesatkan para pengikut mereka dengan pendapat-pendapat mereka yang salah lantaran kebodohan mereka. Mereka menghalalkan apa-apa yang telah Allah haramkan bagi mereka, seperti bangkai dan lain-lain, dan mengharamkan apa-apa yang Allah halalkan bagi mereka, seperti binatang-binatang baḥīrah, waṣīlah, ḥāmī dan lain-lain. Sesungguhnya Rabbmu -wahai Rasul- lebih tahu tentang orang-orang yang melampaui batas-batas Allah. Dan Dia akan memberi mereka balasan yang setimpal atas perbuatan mereka yang melampaui batas-batas-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Dan apa yang menghalangi kalian untuk memakan sembelihan yang disembelih dengan nama Allah, padahal Dia telah menjelaskan kepada kalian apa yang diharamkan bagi kalian, kecuali ketika dalam keadaan darurat? -sebagaimana yang telah dijelaskan pada awal surat Al-Maidah-. Dan orang-orang kafir tersesat dari kebenaran karena mereka mengikuti godaan-godaan setan tanpa memiliki hujjah atau dalil. Hai Rasulallah, sungguh Tuhanmu Maha Mengetahui orang-orang yang melampaui batas dan melanggar hukum."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. وَمَا لَكُمْ أَلَّا تَأْكُلُوا۟ مِمَّا ذُكِرَ اسْمُ اللهِ عَلَيْهِ (Mengapa kamu tidak mau memakan (binatang-binatang yang halal) yang disebut nama Allah ketika menyembelihnya) Yakni apa yang menghalangi kalian dari memakan sembelihan yang telah kalian sebut nama Allah ketika menyembelihnya padahal Allah telah mengizinkan kalian memakannya? وَقَدْ فَصَّلَ لَكُم مَّا حَرَّمَ عَلَيْكُمْ (padahal sesungguhnya Allah telah menjelaskan kepada kamu apa yang diharamkan-Nya atasmu) Yakni Allah telah menjelaskan bagi kalian makanan-makanan yang diharamkan dengan penjelasan yang terperinci tanpa ada keraguan didalamnya dan yang menjauhkan syubhat dengan firman-Nya: (إنما حرم عليكم الميتة....) “sesungguhnya Allah telah mengharamkan atas kalian bangkai…..—sampai akhir ayat –“. إِلَّا مَا اضْطُرِرْتُمْ إِلَيْهِ ۗ (kecuali apa yang terpaksa kamu memakannya) Yakni dari segala yang diharamkan atas kalian, karena keadaan darurat dapat menjadikan hukum yang haram menjadi boleh. وَإِنَّ كَثِيرًا لَّيُضِلُّونَ بِأَهْوَآئِهِم بِغَيْرِ عِلْمٍ (Dan sesungguhnya kebanyakan (dari manusia) benar benar hendak menyesatkan (orang lain) dengan hawa nafsu mereka tanpa pengetahuan) Mereka adalah pemuka-pemuka orang kafir yang mengharamkan bahiirah, saa’ibah, dan yang lainnya; mereka berusaha menyesatkan manusia, namun manusia mengikuti mereka dan dan tidak tahu bahwa itu merupakan kebodohan dan kesesatan; begitu pula yang terjadi pada bangsa-bangsa lain yang mengharamkan sesuatu karena hawa nafsu dan kebodohan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119 Mengapa kamu tidak mau memakan binatang-binatang yang halal dan yang disebut nama Allah ketika menyembelihnya? Padahal sesungguhnya Allah telah menjelaskan kepada kamu apa yang diharamkan-Nya kepadamu dengan penjelasan yang jelas pada surat Al maidah ayat ketiga, kecuali sesuatu yang haram dan kamu terpaksa memakannya. Sebab keadaan mendesak bisa jadi sebab halalnya sesuatu yang diharamkan. Dan sesungguhnya kebanyakan manusia yaitu orang-orang kafir benar benar hendak menyesatkan orang lain dengan hawa nafsu mereka tanpa pengetahuan dan dasar. Sesungguhnya Tuhanmu, Dialah yang lebih Mengetahui orang-orang yang melampaui batas. sehingga mereka menghalalkan yang haram dan mengharamkan yang halal. Seperti orang Jahiliyyah yang menghalalkan bangkai. dan mengharamkan unta bakhirah dan sahibah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian tidak memakan} apa yang mencegah kalian untuk memakan {sesuatu yang disebutkan nama Allah pada sesuatu itu. Sungguh Allah telah merincikan} menjelaskan {kepada kalian sesuatu yang Dia haramkan kepada kalian, kecuali jika kalian dalam keadaan terpaksa. Sesungguhnya banyak yang menyesatkan dengan mengikuti hawa nafsunya tanpa dasar pengetahuan. Sesungguhnya Tuhanmu lebih mengetahui orang-orang yang melampaui batas} orang-orang yang melampaui batasNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118-119. Allah memerintahkan orang-orang beriman dengan tuntunan iman, bahwa jika mereka adalah orang-orang yang beriman maka hendaknya mereka memakan daging yang disembelih dengan menyebut Nama Allah dari binatang ternak dan binatang-binatang lain yang dihalalkan yang meyakini kehalalannya. Janganlah mereka melakukan apa yang di lakukan oleh orang-orang Jahiliyah yaitu mengharamkan apa-apa yang dihalalkan dalam jumlah banyak dan itu mereka adakan dalam diri mereka sendiri, dan penyesatan dari setan-setan mereka. Maka Allah menjelaskan tanda seorang Mukmin adalah diaa menyelisihi orang-orang Jahiliyah pada kebiasan orang-orang tercela ini yang mengandung penyimpangan pada syariat Allah. Apa gerangan yang menghalangi mereka untuk memakan sesuatu yang telah disebutkan Nama Allah telah menjelaskan dan memaparkan sembelihnya sementara Allah telah menjelaskan dan memaparkan secara terperinci apa-apa yang diharamkan atas mereka? Tidak ada lagi syubhat dan persoalan yang meharuskan mereka menolak makan sebagian yang hala karena takut terjatuh pada yang haram. Ayat yang mulia ini menujukan bahwa pada dasarnya segala sesuatu yang dimakan itu adalah mubah, dan bahwa pada dasarnya segala sesuatu jika tidak ada dalil syari’at yang mengharamkan sesuatu darinya, maka ia tetap berada di atas kehalalannya. Sesuatu yang Alah tidak bahas adalah halal, karena Dia telah merinci yang haram, maka sesuatu yang tidak Dia rinci berarti tidak haram, walaupun begitu dalam keadaan terpaksa dan kelaparan sesuatu yang haram telah dijelaskan oleh Allah secara rinci adalah halal, sebagaimanan firmanNYa, Diharamkan bagimu (memakan) bangkai, darah, daging babi, (daging hewan) yang disembelih atas nama selain Allah, yang tercekik, yang terpukul, yang jatuh, yang ditanduk, dan diterkam binatang buas, kecuali yang sempat kamu menyembelihnya, dan (diharamkan bagimu) yang disembelih untuk berhala. Dan (diharamkan juga) mengundi nasib dengan anak panah, (mengundi nasib dengan anak panah itu) adalah kefasikan. Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu, sebab itu janganlah kamu takut kepada mereka dan takutlah kepada-Ku. Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu. Maka barang siapa terpaksa karena kelaparan tanpa sengaja berbuat dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang. (Al-Maidah:3). Kemudian Allah memperingatkan kebanyakan manusia, Dia berfirman, “Dan sesunggguhnya kebanyakan dari manusia benar-benar hendak menyesatkan orang lain dengan hawa nafsu mereka.” Maksdunya, hanya dengan memperturutkan apa yang diinginkan oleh diri mereka “tanpa pengetahuan,” dan tanpa hujjah. Maka hendaknya hamba-hamba Allah berhati-hati dengan orang-orang yang seperti mereka . Tanda-tanda mereka seperti yang dujelaskan oleh Allah adalah bahwa ajakan mereka tidak dilandasi dengan bukti dan mereka tidak memiliki dalil syar’I, orang yang telah membuat pelanggaran kepada syriat Allah dan terhadap hamba-hambaNya, dan Allah tidak menyukai orang-orang yang malanggar. Lain halnya dengan orang-orang yang mendapatkan petunjuk dan memberi petunjuk, mereka menyeru kepada petunjuk dan kebenaran. Dan dalam dakwah, mereka hany mengikuti dan mencari ridha serta kedekatan kepadaNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 119: Seperti di Surah Al Maa’idah ayat 3. Seperti menghalalkan bangkai, dsb. Dan tanpa hujjah. Oleh karena itu, hendaknya seorang hamba waspada terhapa ajakan mereka, di mana ciri mereka adalah mengajak dengan tanpa dalil dan tanpa hujjah syar’i, yang ada hanyalah syubhat sesuai hawa nafsu mereka yang rusak dan pandangan mereka yang pendek. Berbeda dengan mereka yang menunjukkan orang lain lagi mendapat petunjuk; di mana mereka mengajak kepada kebenaran dan petunjuk, menguatkan dakwah mereka dengan hujjah ‘aqli maupun syar’i, dan tidak ada yang mereka cari dari dakwah mereka selain ridha Tuhan mereka dan agar dapat dekat dengan-Nya. Dari yang halal kepada yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 119",
    "description": "Terhadap mereka yang masih ragu-ragu, Allah menjelaskan sebagai berikut. Dan mengapa kamu tidak mau memakan dari apa, yakni daging hewan, yang ketika disembelih disebut nama Allah'seperti dengan membaca bismilla'h atau bismilla'h, alla'hu akbar'padahal Allah telah menjelaskan kepadamu apa yang diharamkan-Nya kepadamu seperti mengonsumsi bangkai, darah yang mengalir, daging babi, dan apa yang disembelih bukan atas nama Allah (lihat: surah al-an'a'm/6: 145) kecuali jika kamu dalam keadaan terpaksa seperti dalam keadaan sangat lapar yang jika dibiarkan akan berakibat kematian' dalam keadaan terpaksa, seseorang boleh memakan apa yang sebelumnya diharamkan, tetapi sekadar untuk mempertahankan hidup, tidak melewati batas, tidak bersenang-senang, dan sebenarnya dia tidak menginginkan ' -."
  }
]