[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”kepunyaan siapakah kerajaan langit dan bumi, serta apa yang ada di dalamnya?” katakanlah, ”itu kepunyaan Allah” seperti yang sudah kalian akui hal itu dan kalian ketahui bersama. Maka sembahlah Dia semata. Allah telah menetapkan pada diriNya sifat kasih sayang, sehingga Dia tidak menyegerakan siksaan pada para hambaNYa. Sungguh Dia akan menghimpun kalian pada hari kiamat yang tidak ada keraguan tentangnya untuk perhitungan dan pembalasan. Orang-orang yang menyekutukan Allah, mereka membinasakan diri mereka sendiri. Mereka tidak mengesakan Allah, dan tidak mempercayai janji dan ancamanNya, serta tidak mengakui kenabian Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Katakanlah -wahai Rasul- kepada mereka, “Siapakah pemilik langit dan bumi beserta isinya?” Katakanlah, “Semuanya milik Allah.” Dia telah menetapkan kasih sayang atas diri-Nya sebagai wujud kemurahan-Nya kepada hamba-hamba-Nya. Maka Dia tidak tergesa-gesa menimpakan hukuman kepada mereka. Sekalipun mereka tidak bertobat Dia akan mengumpulkan mereka semua di hari Kiamat yang tidak ada keraguan terhadapnya. Orang-orang yang merugikan dirinya sendiri dengan bersikap ingkar kepada Allah serta tidak mau beriman, sehingga mereka tidak bisa menyelamatkan diri mereka dari kerugian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah mengajarkan rasul-Nya tanya jawab untuk menjelaskan hujjah atas orang-orang musyrik yang membangkang. Dia berfirman, Katakanlah hai Muhammad kepada orang-orang musyrik: \"Milik siapakah kerajaan langit dan bumi?\" Kemudian katakanlah: \"milik Allah\"; agar mereka kembali dengan Tauhid ubudiyah, karena mereka meskipun telah berusaha sekuat tenaga untuk mencari niscaya mereka tidak akan mendapatkan penguasa alam semesta kecuali Allah. Maka Ikutilah jalan-Nya dan sembahlah Dia, dan janganlah menyekutukan-Nya dengan sesuatu apapun. Dia telah menetapkan kasih sayang atas dirinya, sehingga Dia tidak segera menyiksa orang yang yang menyelisihi-Nya, karena rahmat-Nya melampaui kemurkaan-Nya. Dia akan mengumpulkan seluruh makhluk pada hari kiamat yang tidak diragukan kedatangannya, untuk melakukan hisab. Dan orang-orang yang tidak beriman kepada Allah telah Merugikan diri mereka sendiri di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. قُل لِّمَن مَّا فِى السَّمٰوٰتِ وَالْأَرْضِ ۖ قُل لِّلّٰهِ ۚ (Katakanlah: “Kepunyaan siapakah apa yang ada di langit dan di bumi”. Katakanlah: “Kepunyaan Allah”) Yakni katakanlah kepada mereka pertanyaan ini, dan jika mereka balik bertanya “punya siapa semua ini?” maka jawablah: “ ini semua kepunyaan Allah”, baik mereka mengakuinya atau akan menjadi hujjah atas mereka. Dan maksud ayat ini adalah maka Allah berkuasa untuk mempercepat siksaan bagi kalian, akan tetapi Dia telah menetapkan atas Diri-Nya kasih sayang sehingga tidak menyegerakan siksaan itu, namun Dia menerima taubat dari mereka. Dan termasuk dari kasih sayang-Nya, ia mengutus kepada mereka para rasul, menurunkan kitab, dan menegakkan bukti-bukti. Abu Hurairah berkata, Rasulullah bersabda: “setelah Allah selesai menciptakan makhluk-makhluk-Nya, Dia menulis ketetapan yang Dia taruh di sis-Nya diatas ‘Arsy yang berisi “sesungguhnya kasih sayang-Ku mendahului kemurkaan-Ku”. لَيَجْمَعَنَّكُمْ إِلَىٰ يَوْمِ الْقِيٰمَةِ(Dia sungguh akan menghimpun kamu pada hari kiamat) Yakni Dia sungguh akan mengakhirkan penghimpunan kalian di alam kubur ke hari yang kalian ingkari keberadaannya. الَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ فَهُمْ لَا يُؤْمِنُونَ(Orang-orang yang meragukan dirinya mereka itu tidak beriman) Yakni sesungguhnya orang-orang yang tidak beriman kepada hal tersebut akan merasa jelas ketika hari kebangkitan itu terjadi bahwa mereka telah telah merugi dengan apa yang telah mereka perbuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Tanyailah mereka: “Siapakah yang merajai langit dan bumi serta memiliki hak untuk mengatur sesuatu yang ada di dalamnya” dan katakanlah: “Semua itu hanya milik Allah,” Sama saja, mereka mengakuinya atau hujjah itu telah telah disampaikan kepada mereka, Allah tetap berkuasa untuk menghukum mereka, namun Dia telah menetapkan pada DiriNya (DzatNya) suatu rahmat, sehingga Dia tidak mempercepat hukuman mereka, bahkan menerima taubat dari mereka. Kemudian aku bersumpa demi Allah bahwa sungguh Dia akan mengumpulkan manusia dari kubur pada hari kiamat yang mana kedatangannya tidak diragukan lagi. Dan orang-orang yang kufur terhadap Allah, dan tidak beriman dengan rasulNya itu adalah orang-orang yang merugi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Milik siapakah apa yang di langit dan di bumi” Katakanlah,“Milik Allah.” Dia telah menetapkan kasih sayang pada diriNya. Sungguh Dia benar-benar akan mengumpulkan kalian pada hari kiamat yang tidak ada keraguan di dalamnya} tidak ada keraguan di dalamnya {Orang-orang yang merugikan dirinya, mereka itu tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman kepada NabiNya, “Katakanlah” kepada orang-orang yang musyrik kepada Allah, demi menetapkan dan mewajibkan tauhid atas mereka, “Kepunyaan siapakah sesuatu yang ada di langit dan di bumi?” maksudnya, siapa pencipta, pemilik, dan pengaturnya? “katakanlah” kepada mereka, “Kepunyaan Allah.” Mereka mengakui dan tidak mengingkari hal itu. Mengapa setelah mereka mengakui bahwa Allah pencipta dan pengatur tanpa sekutu, mereka tidak mengakui keikhlasan dan tauhid untukNya? FirmanNya, “Dia telah menetapkan atas diriNya kasih sayang.” Maksudnya, alam atas dan alam bawah berada di bawah kekuasaan dan pengaturanNYa. Allah telah membentangkan rahmat dan nikmatNya, Dia telah menetapkan untuk diriNya, “Bahwa rahmat-rahmatNya mengalahkan kemarahanNya, memberi adalah lebih Dia cintai daripada tidak memberi, bahwa Allah telah membuka pintu-pintu rahmat untuk seluruh hamba jika mereka tidak menutupnya atas diri mereka dengan dosa-dosa mereka. Dia pun telah menyeru mereka kepadanya jika mencarinya tidak terhalang oleh kesalahan dan kemaksiatan mereka.” FirmanNya, “Dia sungguh-sungguh akan menghimpun kamu pada Hari Kiamat yang tidak ada keraguan terhadapnya.” Ini adalah sumpah dari Allah, dan Dia adalah pemberi kabar terjujur, Dia telah menegakkan bukti-bukti dan argumentasi-argumentasi yang mencapai tingkatan haq al-yaqin, akan tetapi orang-orang zhalim hanya mengingkari, mereka mengingkari kekuasaan Allah dalam membangkitkan para makhluk, mereka tenggelam ke dalam kemaksiatan, dan berani kafir kepadaNya, maka mereka merugi dunia dan akhirat. Oleh karena itu, Allah berfirman, “Orang-orang yang merugikan dirinya, mereka itu tidak beriman.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 12: Kepada orang-orang musyrik agar mereka mengakui dan mau mentauhidkan Allah. Yakni siapakah yang menciptakannya, memilikinya dan mengaturnya? Tidak ada lagi jawaban selain ini. Jika mereka mengakui bahwa Allah yang memiliki dan mengaturnya, lalu mengapa mereka tidak berbuat ikhlas kepada-Nya dan mentauhidkan-Nya. Alam semesta adalah milik-Nya, Dia telah membuka lebar rahmat-Nya dan ihsan-Nya, melimpahkan rahmat dan nikmat-Nya kepada mereka, Dia menetapkan sifat rahmat pada diri-Nya, dan bahwa rahmat-Nya mengalahkan kemurkaan-Nya, pemberian lebih dicintai-Nya daripada menghalangi, Dia telah membuka pintu-pintu rahmat-Nya kepada semua hamba jika mereka tidak mengunci pintu-pintunya dengan dosa-dosa, dan Dia mengajak mereka kepada rahmat-Nya, namun mereka tidak memintanya karena dihalangi oleh maksiat dan dosa mereka. Berita yang dikabarkannya adalah berita yang paling benar, Dia telah menegakkan hujjah dan bukti terhadapnya, namun orang-orang yang zalim tidak menghendaki selain mengingkari, mereka mengingkari bahwa Allah mampu membangkitkan makhluk yang telah mati, mereka pun tetap bermaksiat dan berani kafir kepada-Nya, sehingga mereka rugi di dunia dan akhirat. Yakni orang-orang yang tidak mau menggunakan akal fikirannya, tidak mau beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 12",
    "description": "Katakan juga, wahai nabi Muhammad, kepada orang-orang kafir yang sombong dan keras kepala itu, milik siapakah apa yang ada di langit dan di bumi' katakanlah, semua makhluk yang ada di langit dan bumi ini adalah milik Allah. Dia telah menetapkan dan memilih sifat kasih sayang dengan berjanji pada diri-Nya untuk mendahulukan kasih sayang kepada hamba-hamba-Nya daripada murka. Dia sungguh akan mengumpulkan kamu, seluruh manusia sejak nabi adam hingga manusia akhir zaman, pada hari kiamat, dalam kehidupan sesudah mati. Pengumpulan seluruh umat manusia ini tidak mungkin diragukan lagi kejadiannya. Dalam pertemuan itu, ada yang beruntung dan ada yang rugi. Orang-orang yang merugikan dirinya, mereka itu orang-orang yang tidak beriman, sedangkan yang beruntung adalah mereka yang beriman dan beramal saleh dengan ikhlas. Allah sebagai pemilik langit dan bumi menegaskan bahwa seluruh makhluk berada dalam pengaturan-Nya. Dan milik-Nyalah, segala apa yang ada pada malam dan siang hari, yang bergerak maupun yang diam, yang terlihat maupun yang tersembunyi karena dia yang menciptakan dan mengatur semuanya. Dan dialah yang maha mendengar ucapan hamba-hamba-Nya, dan maha mengetahui apa yang ada pada seluruh hambanya, baik yang dinyatakan secara terbuka maupun yang tersembunyi di dalam lubuk hati."
  }
]