[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tinggalkanlah oleh kalian (Wahai sekalain manusia) seluruh jenis maksiat, baik yang tampak maupun yang tersembunyi. Sesungguhnya orang-orang yang berbuat maksiat, akan dihukum oleh tuhan mereka akibat apa yang mereka lakukan dari perbuatan-perbuatan buruk tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Tinggalkanlah -wahai manusia- perbuatan-perbuatan maksiat, baik secara terang-terangan maupun sembunyi-sembunyi. Sesungguhnya orang-orang yang berbuat maksiat di kala sepi maupun terang-terangan pasti akan dibalas oleh Allah dengan balasan yang setimpal dengan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120. Hai manusia, Tinggalkanlah segala dosa yang nampak yang dilakukan oleh anggota tubuh, dan yang tidak nampak yang dilakukan oleh hati. Sungguh orang-orang yang terjerumus ke dalam kemaksiatan akan mendapat siksaan akibat amal-amal perbuatan mereka yang buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. وَذَرُوا۟ ظٰهِرَ الْإِثْمِ وَبَاطِنَهُۥٓ ۚ (Dan tinggalkanlah dosa yang nampak dan yang tersembunyi) Yang nampak, seperti perbuatan-perbuatan yang dilakukan anggota tubuh; dan yang tersembunyi seperti amalan-amalan hati. Pendapat lain mengatakan yakni apa yang kalian tampakkan kepada manusia dan apa yang kalian rahasiakan. Dan pendapat lain mengatakan yakni perbuatan zina yang nampak dan perbuatan zina yang tersembunyi. إِنَّ الَّذِينَ يَكْسِبُونَ الْإِثْمَ سَيُجْزَوْنَ بِمَا كَانُوا۟ يَقْتَرِفُونَ(Sesungguhnya orang yang mengerjakan dosa, kelak akan diberi pembalasan (pada hari kiamat), disebabkan apa yang mereka telah kerjakan) Yakni Allah mengancam orang-orang yang mengerjakan dosa dan melanggar hal-hal yang diharamkan dengan azab sebagai balasan atas perbuatan mereka yang menentang Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120 Kemudian Allah memerintahkan untuk meninggalkan semua dosa dan maksiat baik yang nampak seperti memukul, mengutuk, mencuri dan zina. Atau yang dosa yang tidak nampak seperti hasud, dendam dan kebencian.. Sesungguhnya orang yang mengerjakan dosa di dunia, kelak akan diberi pembalasan pada hari kiamat, sesuai dosa yang mereka telah kerjakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tinggalkanlah} tinggalkanlah {dosa yang terlihat dan yang tersembunyi} dosa-dosa yang terlihat dan tersembunyi {Sesungguhnya orang-orang yang mengerjakan dosa akan dibalas karena apa yang mereka kerjakan} mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. yang dimaksud dengan dosa adalah kemaksiatan yang membuat peakunya berdosa yakni terjerumus ke dalam dosa dan kesengsaraan dalam perkara-perkara yang berkaitan dengan hak-hak Allah dan hak-hak hambaNya. Allah melarang hamba-hambaNya melakukan dosa yang lahir dan batin kecuali setelah dia mengetahui dan mencarinya, maka mengetahui dan mencari kemaksiatan hati dan badan adalah sesuatu yang wajib atas setiap mukallaf. Banyak orang tidak mengenal banyak kemaksitan, lebih-lebih kemaksiatan hati seperti kufur, ujub, riya dan sebagiannya sehingg banyak orang tertimpa olrhnya sementara dia tidak menyadari dan merasa dan ini termasuk berpaling dari ilmu dan tidak adanya bashirah. Kemudian Allah menjelaskan bahwa orang-orang yang melakukan dosa batin dan lahir akan dibalas sesuai dengan hasil perbuatanya dan sesuai kadar dosanya sedikit atau banyak.balasan ini akan hadir di Akhirat, dan bisa jadi seorang hamba di hukum di dunia, maka hal itu mengurangi keburukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 120: Yakni semua maksiat baik yang nampak maupun yang tersembunyi, yang terkait dengan hak Allah maupun yang terkait dengan hak hamba, yang terkait dengan lisan dan anggota badan maupun yang terkait dengan hati, dan seorang hamba tidak dapat secara sempurna meninggalkan maksiat yang nampak maupun yang tersembunyi kecuali setelah mengenali dan mengkajinya. Oleh karena itu, mengetahui maksiat anggota badan dan hati merupakan perkara yang wajib bagi setiap mukallaf (orang yang sudah mendapat beban agama, yakni yang baligh dan berakal), dan banyak manusia yang masih samar baginya kebanyakan maksiat, khususnya maksiat yang terkait dengan hati, seperti sombong, ‘ujub (bangga diri), riya’ bahkan seseorang terkadang banyak tertimpa hal itu namun ia tidak menyadari, hal ini tidak lain karena berpaling dari ilmu dan tidak adanya bashirah (mata hati). Balasan ini dilakukan di akhirat, dan bisa juga di dunia sehingga seseorang dihukum untuk meringankan keburukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 120",
    "description": "- setelah Allah menjelaskan tentang daging hewan yang boleh dimakan, pada ayat ini Allah menjelaskan tentang daging yang tidak boleh dimakan. Dan janganlah kamu memakan dari apa'daging hewan'yang ketika disembelih tidak disebut nama Allah, perbuatan itu benar-benar suatu kefasikan, keluar dari ketentuan ajaran islam dan ketaatan kepada Allah. Lalu Allah menjelaskan tentang sumber timbulnya kefasikan. Sesungguhnya setan-setan akan membisikkan, dengan bisikan yang menyesatkan, kepada kawan-kawannya dan memberikan masukan kepada mereka agar mereka membantah kamu, seperti menghalalkan sesuatu yang haram dan sebaliknya, dengan alasan yang dibuat-buat. Dan jika kamu menuruti mereka, tentu kamu telah menjadi orang musyrik karena sengaja beralih dari aturan Allah kepada aturan lainnya."
  }
]