[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah kalian makan (wahai kaum muslimin) sembelihan-sembelihan yang tidak disebut nama Allah sewaktu menyembelihnya, seperti bangkai dan binatang yang disembelih untuk berhala-berhala, jin dan makhluk lainnya. Sesungguhnya makan sembelihan-sembelihan tersebut merupakan tindakan keluar dari ketaatan kepada Allah Dan sesungguhnya jin-jin yang jahat membisikan syubhat-syubhat tentang pengharaman bangkai terhadap kawan-kawan mereka, setan-setan dari kalangan manusia. Mereka memerintahkan setan-setan dari kalangan manusia untuk berkata kepada kaum muslimin dalam adu argumentasi dengan meereka. ”sesungguhnya kalian dengan tidak mau memakan bangkai berarti tidak mau memakan hasil sembelihan Allah, padahal kalian memakan apa yang merupakan hasil sembelihan kalian sendiri.” jika kalian kaum muslimin, menuruti penghalalan bangkai, maka kalian dan mereka sama saja dalam kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Dan janganlah kamu -wahai orang-orang muslim- memakan binatang yang disembelih tanpa menyebut nama Allah, baik disebut nama yang lain maupun tidak. Sesungguhnya memakan binatang semacam itu berarti keluar dari ketaatan kepada Allah menuju kedurhakaan kepada-Nya. Dan sesungguhnya setan-setan senantiasa menggoda teman-temannya dengan memberikan syubhat-syubhat untuk mendebat kalian perihal hukum memakan bangkai. Dan jika kalian -wahai orang-orang muslim- mengikuti godaan setan-setan yang berusaha menghalalkan bangkai itu niscaya kalian akan sama dengan mereka dalam hal kemusyrikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121. Hai orang-orang yang beriman, janganlah kalian memakan hewan sembelihan yang disembelih untuk selain Allah atau yang tidak disebutkan nama Allah ketika proses penyembelihannya. Barangsiapa yang melanggar hal ini, maka dia termasuk orang yang tidak mentaati Allah. Sesungguhnya setan-setan dari golongan manusia dan jin akan senantiasa menggoda bala tentara mereka agar mendebat kalian dalam perkara pembolehan memakan bangkai. Dan jika kalian mentaati mereka dalam kepercayaan dibolehkannya memakan bangkai maka sungguh kalian telah terjerumus ke dalam kesyirikan yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. وَلَا تَأْكُلُوا۟ مِمَّا لَمْ يُذْكَرِ اسْمُ اللهِ عَلَيْهِ (Dan janganlah kamu memakan binatang-binatang yang tidak disebut nama Allah ketika menyembelihnya) Seperti bangkai dan sembelihan yang disembelih dengan menyebut nama selain Allah. Adapun sembelihan yang dilakukan oleh orang Islam yang sengaja tidak mengucapkan basmalah maka sembelihan itu haram menurut jumhur ulama, namun apabila ia tidak mengucapkannya karena lupa maka sembelihan itu tetap halal. Imam Syafi’I dan lainnya berpendapat: hukum membaca basmalah ketika menyembelih adalah sunnah dan bukan wajib, apabila seorang muslim tidak mengucapakan basmalah ketika menyembelih maka itu tidak menjadikan sembelihannya haram, karena nama Allah terdapat pada setiap orang Islam. Pendapat lain mengatakan, sebenarnya ayat ini membahas tentang bangkai yang tidak disembelih dan yang disembelih untuk sesembahan selain Allah. وَإِنَّهُۥ لَفِسْقٌ ۗ (Sesungguhnya perbuatan yang semacam itu adalah suatu kefasikan) Yakni semua yang disembelih dengan menyebut nama selain Allah, memakan bangkai dan lainnya adalah tindakan keluar dari ketaatan kepada Allah dan hukum-Nya. وَإِنَّ الشَّيٰطِينَ لَيُوحُونَ إِلَىٰٓ أَوْلِيَآئِهِمْ (Sesungguhnya syaitan itu membisikkan kepada kawan-kawannya) Menggoda mereka dengan syubhat-syubhat yang digunakan sebagai landasan saat mendebat kalian, seperti perkataan mereka: “kalian tidak mau memakan apa yang dimatikan Allah, namun kalian malah memakan apa kalian matikan”. وَإِنْ أَطَعْتُمُوهُمْ (dan jika kamu menuruti mereka) Dalam apa yang mereka perintahkan dan larang kepada kalian. إِنَّكُمْ لَمُشْرِكُونَ (sesungguhnya kamu tentulah menjadi orang-orang yang musyrik) Yakni musyrik seperti mereka. Dan barangsiapa meyakini halalnya sesuatu yang telah diharamkan Allah dengan jelas maka ia telah kafir. Ketika turun ayat وَلَا تَأْكُلُوا۟ مِمَّا لَمْ يُذْكَرِ اسْمُ اللهِ عَلَيْهِ (Dan janganlah kamu memakan binatang-binatang yang tidak disebut nama Allah ketika menyembelihnya) Ibnu Abbas berkata: negeri Persia mengirim risalah kepada kaum Quraisy yang berisi debatlah Muhammad dengan mengatakan: apa yang kamu sembelih dengan tanganmu menggunakan pisau maka sembelihan itu halal, dan apa yang disembelih Allah menggunakan alat dari emas (bangkai) maka iatu haram. Lalu turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121 Dan janganlah kamu memakan binatang-binatang yang disembelih dengan tidak menyebut nama Allah sebab sesungguhnya perbuatan yang semacam itu adalah suatu kefasikan dan di luar ketaatan kepada Allah. Adapun bagi muslim jika tidak menyebut nama Allah ketika menyembelih maka pendapat jumhur ulama adalah haram untuk memakan daging tersebut, namun kalangan Syafi’i membolehkannya. Sesungguhnya syaitan itu membisikkan kepada kawan-kawan orang musyrik agar mereka membantah kamu dalam hal memakan bangkai; sebagaimana telah disebutkan pada sebab turunnya ayat 118. Dan jika kamu menuruti mereka, sesungguhnya kamu tentulah menjadi orang-orang yang musyrik. Orang-orang musyrik berkata: wahai Muhammad engkau mengklaim bahwa apa yang kalian sembelih itu halal, dan apa yang dibunuh oleh anjing atau elang/rajawali itu juga halal namun mengapa apa yang Allah bunuh itu haram? Lalu turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah memakan sesuatu dari sesuatu yang tidak disebut nama Allah padanya. Perbuatan itu benar-benar suatu kefasikan} keluar dari ketaatan kepada Allah dan menuju kepada perbuatan maksiat kepadaNya {Sesungguhnya setan benar-benar membisikkan} membisikkan {kepada kawan-kawannya agar mereka membantah kalian. Jika kalian menuruti mereka} dalam menghalalkan bangkai {sesungguhnya kalian benar-benar musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121. Termasuk dalam larangan ini adalah binatang yang disembelih dengan menyebut nama selain Allah seperti yang disembelih untuk berhala dan tuhan-tuhan orang-orang musrik, karena ini termasuk ke dalam ketegori yang disembelih bukan karena Allah yang secara khsusus di haramkan oleh dalil. Termasuk dalam larangan ini adalah binatang yang disembelih tanpa menyebut nama Allah yang disembelih karena Allah seperti dhahaya (sembelihan kurban) dan hadyu (sembelihan untuk dam haji) atau untuk sekedar di makan dagingnya, jika penyembelihnya sengaja meninggalkan basmalah menurut pendapat mayoritas ulama. Dan tidak termasuk ke dalam keumuman ini adalah orang yang lupa dengan adanya dalil lain yang menunjukan diampuninya dosa darinya. Termasuk ke dalam ayat ini adalah bangkai yang mati tanpa disembelih, ia termasuk yang tidak disebut Nama Allah padanya dan Allah secara khusus menyatakan di dalam firmanNya Diharamkan bagimu (memakan) bangkai, darah, daging babi, (daging hewan) yang disembelih atas nama selain Allah, yang tercekik, yang terpukul, yang jatuh, yang ditanduk, dan diterkam binatang buas, kecuali yang sempat kamu menyembelihnya, dan (diharamkan bagimu) yang disembelih untuk berhala. Dan (diharamkan juga) mengundi nasib dengan anak panah, (mengundi nasib dengan anak panah itu) adalah kefasikan. Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu, sebab itu janganlah kamu takut kepada mereka dan takutlah kepada-Ku. Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu. Maka barang siapa terpaksa karena kelaparan tanpa sengaja berbuat dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.(Al-Maidah:3). Dan bisa jadi ia adalah sebab turunnya ayat ini berdasarkan firmanNya, “Sesungguhnya setan itu membisikan kepada kawan-kawannya agar mereka membantah kamu” tanpa ilmu, karena manakala orang-orang musrik mendengar pengharaman Allah terhadap bangkai dan penghalalnya terhadap binatang sembelih sementara mereka menghalalkan memakan bangkai, maka mereka menentang dan mendebat Allah dan RasulNya tanpa ilmu dan bukti,” apakah kamu akan memakan binatang yang kamu bunuh sementara kamu tidak memakan binatang yang dibunuh oleh Allah.” Maksudnya, binatang yang dibunuh oleh Allah adalah bangkai, ini adalah akal yang rusak yang tak terpijak kepada hujjah dan dalil, akan tetapi hanya berpijak apa akal mereka yang ruakk dimana ia seandainya kebenaran itu mengikutinya, niscaya bumi, langit dan apa yang ada padanya akan rusak. Maka celakalah orang yang mendahului akal rusak seperti ini daripada syariat dan hukum Allah yang sesuai dengan kemaslahtan umum dan manfaat khusus. Ini tidaklah mengherankan, karena akal-akal seperti ini adalah hasil bisikan setan yang merupakan wali mereka, dimana mereka berkeinginan untuk menyesatkan manusia dari agamanya dan mengajak mereka agar menjadi penduduk neraka. “Dan jika kamu menuruti mereka” dalam kesyirikan mereka, penghalalan yang haram dan pengharaman yang halal, “Sesungguhnya kamu tentulah menjadi orang-orang yang musrik.” Karena kamu telah mengangkat mereka sebagai wali-walimu selain dari Allah, dan kamu menyetujui perbuatan mereka yang menyelisihi kaum MUslimin, maka jalanmu sama dengan mereka. Ayat yang mulia ini menunjukan bahwa ilham-ilham dan kasyap apa yang terjadi di dalam hati yang banyak di klaim orang orang-orang sufi dan semisalnya tidak menunjukan dengan sendirinya bahwa ia adalah benar. Ia tidak dibenarkan sebelum ditimbang dengan Kitabullah dan Sunnah RasulNya. Jika keduanya menerimannya, maka ia diterima dan jika tidak, maka ia ditolak. Jika salah satunya tidak diketahui, maka ia belum bisa disikapi, tidak dibenarkan dan tidak didustakan, karena bisikan dan ilham bisa berasal dari Allah bisa pula dari setan, maka harus dilakukan pembedaan antara keduanya, karena kesalahan dan kesesatan yang hanya diketahui oleh Allah akan terjadi jika tidak dilakukan perbedaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 121: Abu Dawud meriwayatkan dari Ibnu Abbas tentang firman Allah Ta’ala, “Sesungguhnya setan-setan akan membisikkan kepada kawan-kawannya…dst. (lih. Ayat di atas).” Mereka berkata, “Apa yang disembelih Allah, janganlah kamu makan, dan apa yang kamu sembelih (tanpa menyebut nama Allah), maka makanlah, “Wa laa ta’kuluu mimmaa lam yudzkarismullahi ‘alaih.” (Hadits ini para perawinya adalah para perawi kitab shahih, Al Haafizh Ibnu Katsir berkata dalam tafsirnya, “Ini isnad yang shahih.” Hadits ini diriwayatkan pula oleh Ibnu Majah, Ibnu Jarir dan Hakim dan ia berkata, “Shahih sesuai syarat Muslim.” Adz Dzahabi mendiamkannya. Syaikh Muqbil berkata, “Hadits ini dari riwayat Simak dari Ikrimah, ia adalah mudhtharib. Oleh karena itu, hadits tersebut dha’if dengan sanad ini, akan tetapi hadits ini memiliki syahid (penguat) yang menjadikannya bisa dipakai hujjah, di antaranya hadits yang diriwayatkan oleh Nasa’i dalam At Tafsir (1/hal. 479), dan Abu Dawud (3/246)). Termasuk ke dalam hal ini adalah: - Binatang yang disembelih dengan nama selain Allah, seperti yang disembelih untuk patung dan berhala. - Binatang yang ketika disembelih tidak disebut nama Allah dengan sengaja (tidak lupa), menurut mayoritas ulama. - Binatang yang mati tanpa disembelih (bangkai), karena ia termasuk yang tidak disebut nama Allah padanya. Keluar dari kehalalan. Ayat ini menunjukkan bahwa ilham yang diterima seseorang atau yang biasa terjadi pada diri orang-orang sufi –menurut orang-orang Sufi- tidaklah menunjukkan bahwa ia adalah benar, bahkan harus disodorkan kepada kitab Allah dan Sunnah Rasul-Nya shallallahu 'alaihi wa sallam, jika keduanya menunjukkan demikian, maka ilham itu diterima, jika bertentangan dengan keduanya, maka wajib ditolak, karena ilham itu bisa berasal dari Allah dan bisa berasal dari setan. Dalam menghalalkan bangkai dengan tanpa ilmu, di mana kaum musyrik ketika mendengar pengharaman bangkai oleh Allah dan Rasul-Nya, dan penghalalan binatang yang disembelih, mereka berkata –untuk menghalalkan bangkai-, “Mengapa kamu memakan binatang yang kamu bunuh dan tidak memakan binatang yang dibunuh Allah (dimatikan Alah tanpa disembelih)?” Yang mereka maksud adalah bangkai. Allah menerangkan di ayat ini, bahwa syubhat yang mereka kemukakan berasal dari wali mereka dari kalangan setan yang ingin menyesatkan manusia dari jalan yang lurus dan mengajak mereka agar sama-sama menjadi penghuni neraka. Dalam kesyirkkan dan dalam penghalalan yang haram serta mengharamkan yang halal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 121",
    "description": "Setelah Allah menjelaskan tentang daging hewan yang boleh dimakan, pada ayat ini Allah menjelaskan tentang daging yang tidak boleh dimakan. Dan janganlah kamu memakan dari apa'daging hewan'yang ketika disembelih tidak disebut nama Allah, perbuatan itu benar-benar suatu kefasikan, keluar dari ketentuan ajaran islam dan ketaatan kepada Allah. Lalu Allah menjelaskan tentang sumber timbulnya kefasikan. Sesungguhnya setan-setan akan membisikkan, dengan bisikan yang menyesatkan, kepada kawan-kawannya dan memberikan masukan kepada mereka agar mereka membantah kamu, seperti menghalalkan sesuatu yang haram dan sebaliknya, dengan alasan yang dibuat-buat. Dan jika kamu menuruti mereka, tentu kamu telah menjadi orang musyrik karena sengaja beralih dari aturan Allah kepada aturan lainnya. Kemudian Allah menjelaskan tentang perbedaan yang mencolok antara orang muslim dan orang musyrik atau kafir dalam bentuk pertanyaan agar pembaca merenung dan menemukan sendiri jawabannya. Dan apakah orang yang sudah mati yaitu orang kafir lalu kami hidupkan dan kami beri dia cahaya yang berupa hidayah, berupa Al-Qur'an atau islam, yang membuatnya dapat berjalan menuju ke arah yang benar di tengah-tengah orang banyak, sama dengan orang yang berada dalam kegelapan, yaitu kekufuran, kebutaan mata hati, dan kebodohan sehingga dia tidak dapat keluar dari sana' dia selalu bimbang dan ragu dalam"
  }
]