[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang hatinya sudah mati dan binasa lagi dilanda dengan kebingungan, lalu Kami hidupkan hatinya dengan iman dan kami berikan kepadanya cahaya-cahaya hidayah, dan kKami beri taufik untuk mengikuti rosul-rosul Kami, maka mereka menjadi hidup dalam cahaya-cahaya hidayah, sama seperti orang-orang yang hanyut dalam berbagai kejahilan (kebodohan), jeratan hawa nafsu dan gulungan keseatan yang bermacam-macam tidak tahu jalan menuju keselamatan dan jalan kebebasan dari kondisinya?. Mereka tidak sama. Dan sebagimana aku acuhkan orang kafir ini,yang mendebat kalian (wahai kaum mukminin) dan aku hiasi perbuatan buruknya, sehingga memandangnya baik, begitupula aku jadikan perbuatan-perbuatan buruk orang-orang yang terlihat bagus menurut mereka, agar dengan itu mereka pantas menerima azab."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Apakah orang yang tadinya seolah telah mati sebelum mendapatkan hidayah dari Allah -karena ia menyimpan kekafiran, kebodohan, dan kedurhakaan- kemudian Kami hidupkan dengan memberinya petunjuk kepada keimanan, ilmu pengetahuan, dan ketaatan itu sama dengan orang yang berada di dalam gelapnya kekafiran, kebodohan, dan kedurhakaan sehingga tidak dapat keluar darinya karena kebingungan mencari jalan keluar dan tidak mengetahui jalan yang benar? Sebagaimana orang-orang musyrik itu memandang baik perbuatan mereka menyekutukan Allah, memakan bangkai, dan berdebat dengan cara yang batil, mereka kaum kafir juga memandang baik perbuatan-perbuatan maksiat yang mereka lakukan untuk mendapatkan azab yang sangat pedih sebagai balasannya kelak di hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122. Apakah orang yang belum mendapat hidayah Allah yang seperti mayat, yang berada dalam kegelapan kekafiran, kemudian Kami menghidupkannya dengan cahaya ilmu dan hidayah sehingga jalannya menjadi terang, seperti orang yang tenggelam dalam gelapnya kekafiran namun tidak mampu keluar darinya? Dan sebagaimana terperangkapnya orang kafir ini, kami indahkan dalam pandangan orang-orang yang ingkar dosa-dosa yang mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. أَوَمَن كَانَ مَيْتًا فَأَحْيَيْنٰهُ (Dan apakah orang yang sudah mati kemudian dia Kami hidupkan) Dahulunya kafir kemudian Kami memberinya hidayah untuk memeluk Islam. وَجَعَلْنَا لَهُۥ نُورًا يَمْشِى بِهِۦ فِى النَّاسِ (dan Kami berikan kepadanya cahaya yang terang, yang dengan cahaya itu dia dapat berjalan di tengah-tengah masyarakat manusia) Cahaya disini sebagai ibarat dari hidayah dan keimanan. Pendapat lain mengatakan yakni al-qur’an, dan pendapat lain mengatakan yakni hikmah. Karena orang yang memiliki al-qur’an dan hikmah berjalan diantara manusia dalam urusan kehidupannya dengan petunjuk dari Tuhannya. كَمَن مَّثَلُهُۥ فِى الظُّلُمٰتِ(serupa dengan orang yang keadaannya berada dalam gelap gulita) Yakni gelapnya kekafiran dan kesesatan. لَيْسَ بِخَارِجٍ مِّنْهَا ۚ( yang sekali-kali tidak dapat keluar dari padanya?) Yakni tidak akan bisa terbebas dari kekafiran dan kesesatan. Zaid bin Aslam dalam tafsiran tentang ayat ini mengatakan: ayat ini turun untuk Umar bin Khattab dan Abu Jahal bin Hisyam; dahulu keduanya masih ‘mati’ dalam kesesatan mereka berdua, lalu Allah ‘menghidupkan’ Umar dengan Islam dan memuliakannya, dan membiarkan Abu Jahal tetap pada kesesatan dan ‘kematiannya’. Hal ini karena Rasulullah pernah berdoa: “Ya Allah muliakanlah Islam dengan Abu Jahal bin Hisyam atau Umar bin Khattab”. Maka Allah mengabulkan doa itu dengan masuknya Umar ke dalam agama Islam. كَذٰلِكَ زُيِّنَ لِلْكٰفِرِينَ مَا كَانُوا۟ يَعْمَلُونَ(Demikianlah Kami jadikan orang yang kafir itu memandang baik apa yang telah mereka kerjakan) Yakni setan menghiasi dan menjadikan indah perbuatan yang dilakukan orang-orang kafir berupa peribadatan kepada patung-patung dan memakan bangkai serta berbuat kemungkaran-kemungkaran, padahal perbuatan mereka adalah perbuatan yang paling buruk seandainya mereka mau berfikir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Imam Ahmad mengatakan tentang ulama : \"Dengan kitab Allah mereka menghidupkan yang mati, dan dengan cahaya Allah mereka menjadikan orang buta dapat melihat, karena dengan hidupnya ayat-ayat Allah mereka keluar dari garis kematian, dan dengan cahaya Allah mereka terbebas dari gelapnya kebodohan. 2 ). { أَوَمَنْ كَانَ مَيْتًا فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُورًا } \"Dan apakah orang yang sudah mati kemudian dia Kami hidupkan dan Kami berikan kepadanya cahaya yang terang\", sebagaimana yang kita ketahui betapa berharganya cahaya dan kedudukannya sangat mahal, lalu bagaimana jika cahaya itu menerangi seluas-luasnya kawasan! { نُورًا يَمْشِي بِهِ فِي النَّاسِ } \"yang dengan cahaya itu dia dapat berjalan di tengah-tengah masyarakat manusia\", sungguh kebutuhan manusia kepada penerang itu sangat besar. 3 ). Sebagian besar kaum muslimin hanya mengetahui bahwa al-qur'an ini hanya untuk orang-orang mati, lalu apakah mereka tahu bahwa al-qur'an itu juga teruntuk bagi orang-orang hidup ? apakah mereka tahu bahwa al-qur'an ini adalah sumber kehidupan ? Sesungguhnya al-qur'an ini untuk orang yang hidup dan untuk kehidupan, bahkan kebutuhan orang yang masih hidup kepada al-qur'an lebih besar daripada orang yang telah mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122 Kemudian Allah menunjukkan permisalan untuk orang mukmin dan kafir, yaitu: Apakah orang yang sudah mati dalam keadaan kafir dan tidak berilmu kemudian dia Kami hidupkan dengan iman, dan apakah juga akan Kami berikan kepadanya cahaya petunjuk, yang mana dengan cahaya itu dia dapat berjalan dan menerangi jalannya di tengah-tengah manusia, yaitu cahaya petunjuk. Serupa dengan orang yang berada dalam kegelapan yaitu orang-orang kafir yang sekali-kali tidak dapat keluar dari kegelapan itu? Sebagaimana Kami telah hiasi orang mukmin dengan iman, maka Kami jadikan pula orang yang kafir itu memandang baik berbagai perbuatan buruk yang telah mereka kerjakan. Ayat ini turun tentang Umar bin Khattab dan Abu Jahal bin Hisyam. Keduanya mati dalam keadaan sesat, lalu Allah menghidupkan Umar dengan Islam dan membiarkan Abu Jahal dalam kesesatannya. Ibnu Abbas berkata: “Yang dimaksud dalam Hamzah bin Abdul Muthallib dan Abu Jahal”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang yang sudah mati} kafir {lalu Kami hidupkan dia} Kami beri dia petunjuk {dan Kami beri dia cahaya} keimanan {yang membuatnya dapat berjalan di tengah-tengah manusia, seperti orang yang berada dalam kegelapan sehingga dia tidak dapat keluar dari sana. Demikianlah dijadikan indah bagi orang-orang kafir apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122. Allah berfirman, “Dan apakah orang” yang belum diberi hidayah oleh Allah “yang sudah mati,” dalam kegelapan, kekufuran, kebodohan, dan kemasiatan, “kemudian Kami dihidupkan” dengan cahaya ilmu, iman, dan ketaatan, lalu dia berjalan dengan cahaya di antara manusia, dan mengutamakan kebaikan bersungguh-sungguh dalam menerapkannya pada dirinya dan orang lain, mengetahui keburukan, kebenciannya, bersungguh-sungguh meninggalkannya dan menghilangkannya dari diri dan orang lain, apakah orang ini sama dengan orang yang ada dalam kegelapan, baik kegelapan kebodohan, kesesatan, kekufuran dan kemaksiatan? “Yang sekali-kali tidak dapat keluar darinya.” Jalan-jalan menjadi rancu, dan rambu-rambu menjadi gelap, maka kesedihan, kegalauan, dan kesengsaraan menghadirinya. Lalau Allah mengingatkan akal dengan apa yang ia kenal dan ia ketahui bahwa ini tidaklah sama dengan itu sebagaimana malam tidaklah sama dengan siang, keterang-benderangan tidaklah sama dengan kegelapan, orang hidup tidaklah sama dengan orang yang mati, seolah-olah dikatakan, “bagaimana orang yang mempunyai sedikit akal rela dalam keadaan seperti ini, dalam kegelapan-kegelapan kebingungan?” maka dia menjawab bahwa “dijadikan terasa indah bagi orang-orang kafir itu apa yang tidak mereka kerjakan.” Setan terus menjadikan amal mereka sehingga mereka bagus dan menghiasinya dalam hati mereka sehingga mereka mamandang baik dan benar, maka iapun menjadi akidah di dalam hati mereka dan sifat yang terpatri yang selalu mengiringi mereka, oleh karena itu mereka rela dengan keburukan dan kejahatan yang mereka alami."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 122: Maksudnya adalah orang yang telah mati hatinya dalam kegelapan kekafiran, kejahilan dan kemaksiatan, yakni orang-orang kafir. Cahaya iman, ilmu dan ketaatan (hidayah). Di mana dia dapat melihat perkara yang sebenarnya, memperoleh petunjuk jalan, mengetahui kebaikan lagi mengutamakannya, bersungguh-sungguh mewujudkannya dalam diri dan orang lain, mengetahui keburukan lagi membencinya, serta berusaha meninggalkannya dan menyingkirkannya dari diri dan orang lain. Kegelapan kebodohan, kekufuran dan kemaksiatan. Tentu tidak sama, sebagaimana tidak sama antara malam dan siang, cahaya dan kegelapan, dan orang-orang yang hidup dengan orang-orang yang mati. Mungkin seseorang merasa heran, mengapa orang tersebut tetap memilih kesesatan dan kegelapan, padahal di hadapannya ada petunjuk dan cahaya? Jawabnya adalah karena telah dijadikan indah bagi orang-orang kafir perbuatan yang mereka lakukan. Oleh karena itu, setan senantiasa menghias perbuatan buruk mereka sehingga mereka menganggapnya baik dan memandangnya sebagai sebuah kewajaran, bahkan sebagai kebenaran, akhirnya mereka senang di atas perbuatan-perbuatan buruk dan biasa melakukannya. Berupa kekafiran dan kemaksiatan, sebagaimana keimanan dan amal saleh dijadikan indah oleh Allah bagi orang-orang yang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 122",
    "description": "Kemudian Allah menjelaskan tentang perbedaan yang mencolok antara orang muslim dan orang musyrik atau kafir dalam bentuk pertanyaan agar pembaca merenung dan menemukan sendiri jawabannya. Dan apakah orang yang sudah mati yaitu orang kafir lalu kami hidupkan dan kami beri dia cahaya yang berupa hidayah, berupa Al-Qur'an atau islam, yang membuatnya dapat berjalan menuju ke arah yang benar di tengah-tengah orang banyak, sama dengan orang yang berada dalam kegelapan, yaitu kekufuran, kebutaan mata hati, dan kebodohan sehingga dia tidak dapat keluar dari sana' dia selalu bimbang dan ragu dalam Allah lalu menenangkan hati nabi Muhammad dengan menjelaskan bahwa para pembesar yang jahat tidak hanya terdapat di mekah saja, tetapi juga di setiap negeri. Dan demikianlah pada setiap negeri kami jadikan pembesar-pembesar yang jahat agar melakukan tipu daya di negeri itu karena mereka lebih mampu menipu daya bawahannya, dan dalam kebiasaan, masyarakat akan mengikuti atasannya apakah dalam hal kebaikan atau keburukan. Tapi mereka hanya menipu diri sendiri tanpa menyadarinya, akibat dari perbuatan mereka akan mengenai mereka sendiri."
  }
]