[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana ini terjadi dari para pemuka orang-orang kafir Makkah berupa tindakan menghalangi dari agama Allah, maka kami jadikan di tiap-tiap negeri itu penjahat-penjahat beasr yang dipimpin oleh tokoh mereka, agar mereka melakukan tipu daya demi menghalangi manusia dari jalan Allah. Dan tidaklah mereka melancarakan tipu daya kecuali terhadap diri mereka sendiri, sedang mereka tidaklah menyadari hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Seperti halnya yang terjadi pada para pembesar orang-orang musyrik di Makkah yang senantiasa menghalang-halangi manusia dari jalan Allah, Kami juga menjadikan pemuka-pemuka dan pembesar-pembesar di setiap negeri yang senantiasa berjuang dan berupaya untuk mengajak manusia ke jalan setan dan memerangi para rasul beserta pengikut-pengikutnya. Tetapi kenyataannya, bahwa upaya dan tipu daya yang mereka lakukan itu sebenarnya kembali kepada diri mereka sendiri. Hanya saja mereka tidak merasakannya. Hal itu karena kebodohan mereka dan kesenangan mereka memperturutkan hawa nafsu mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123. Dan sebagaimana Kami jadikan para pemimpin kekafiran menghalangi manusia dari Islam, demikian pula Kami jadikan pada setiap negeri para pemimpin orang-orang pendosa untuk berbuat kerusakan dalam negeri tersebut, dengan menghalangi manusia dari keimanan dan selalu melakukan kemaksiatan; namun makar dan tipu daya mereka hanya merugikan diri mereka sendiri sedangkan mereka tidak mengetahui hal tersebut. Ibnu 'Asyur berkata: \"Ayat ini disebutkan dengan ringkas karena nabi tidak mendapat marabahaya atas usaha mereka menghalangi orang lain dari mengikutinya. Dan marabahaya itu hanya menimpa orang-orang yang membuat makar, baik itu di dunia dengan terbunuh atau tertawan, maupun di akhirat dengan azab neraka. (at-tahrir wa at-tanwir: 7/39)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. وَكَذٰلِكَ جَعَلْنَا فِى كُلِّ قَرْيَةٍ أَكٰبِرَ مُجْرِمِيهَا (Dan demikianlah Kami adakan pada tiap-tiap negeri penjahat-penjahat yang terbesar) Mereka adalah para pemimpin dan pembesar, Allah mengkhususkan penyebutannya karena mereka lebih leluasa untuk berbuat kerusakan. لِيَمْكُرُوا۟ فِيهَا ۖ( agar mereka melakukan tipu daya dalam negeri itu) Makna (المكر) yakni tipu daya untuk melanggar ketaatan. وَمَا يَمْكُرُونَ إِلَّا بِأَنفُسِهِمْ (Dan mereka tidak memperdayakan melainkan dirinya sendiri) Yakni akibat dari tipu daya mereka menimpa mereka sendiri. وَمَا يَشْعُرُونَ (sedang mereka tidak menyadarinya) Yakni tidak menyadari akibat itu disebabkan kebodohan mereka yang berlebihan dan perbuatan mereka yang mengikuti hawa nafsu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sejenak kita melihat kepada keadaan alam ini, sunnah kauniyah yang menjadi ketetapan yang pasti akan diterima oleh setiap penduduk bumi, dan lihatlah bagaimana balasan yang ditimpakan kepada orang-orang yang kerap berlaku jahat : { وَمَا يَمْكُرُونَ إِلَّا بِأَنْفُسِهِمْ وَمَا يَشْعُرُونَ } \"Dan mereka tidak memperdayakan melainkan dirinya sendiri, sedang mereka tidak menyadarinya\", tetapi buruknya kejahatan membuat mereka buta akan tempat kembali mereka di akhirat, tapi sesunguhnya balasan atas kejahatan itu tidak akan terlepas : { سَيُصِيبُ الَّذِينَ أَجْرَمُوا صَغَارٌ عِنْدَ اللَّهِ وَعَذَابٌ شَدِيدٌ بِمَا كَانُوا يَمْكُرُونَ } \"Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah dan siksa yang keras disebabkan mereka selalu membuat tipu daya\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123 Sebagaimana Kami jadikan orang-orang fasik Makkah beserta para pembesarnya sebagai pemerang atas dakwahmu, maka Kami jadikan pula pada tiap-tiap negeri ada penjahat-penjahat yang besar, agar mereka melakukan tipu daya dalam negeri itu dari keimanan. Mereka akan sibuk dalam kemaksiatan dan keluar dari jalan keistiqamahan Dan mereka tidak memperdayakan keburukan melainkan pada dirinya sendiri, sedang mereka tidak menyadari akibat kebodohan dan menuruti hawa nafsu mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian pula Kami jadikan pada setiap negeri orang-orang jahatnya sebagai pembesar} orang-orang yang berbuat dosa adalah para pembesarnya {agar melakukan tipu daya di sana} agar mereka memalingkan manusia di sana dari keimanan dengan memperindah perkataan dan perbuatan {Padahal mereka hanya menipu diri sendiri dan tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123. Orang-orang yang kebingungan dalam kegelapan dan buta di dalam kebatilan serta yang berada di dalam keadaan bimbang tidaklah sama. Di antara mereka adalah pemimpin, para kepala dan figure publik, serta ada pula pengikut yang dipimpin. Yang pertamalah yang beruntung mendapatkan keadaan paling sengsara. Oleh karena itu berfirman, “Dan demikian lah kami adakan pada tiap-tiap negeri penjahat-penjahat yang besar.” Maksudnya, para pemimpin dimana kejahatannya besar dan pembangkangannya sangat parah. “Agar mereka melakukan tipu daya dalam negeri itu,” dengan tipuan dan seruan ke jalan setan, memusuhi para Rasul, dan pengikutnya dengan ucapan dan perbuatan. Hanya saja tipu daya dan makar mereka justru kembali kepada diri mereka sendiri karena mereka mebuat makar sementara Alalh juga membuat makar dan Dia adalah sebaik-baik pembuat makar. Begitu juga Allah menjadikan imam-imam besar dalam hidayah dan orang-orang mulia yang melawan para penjahat itu, yang membantah pendapat-pendapat mereka, yang berjihad di jalan Allah melawan mereka, dan meniti jalan-jalan yang mengantarkan kepadanya. Allah membantu mereka, meluruskan pendapat mereka dan meneguhkan kaki mereka. Allah menjadikan hari-hari silih berganti di antara mereka dengan musuh-musuh mereka sehingga akhir perkaranya adalah kemenangan dan keunggulan mereka, dan akibat baik adalah bagi orang-orang yang bertakwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 123: Seperti yang terjadi di Mekah dahulu, di mana orang-orang fasiknya menjadi pembesar-pembesar atau tokoh-tokoh penduduk Mekah. Dengan menghalangi manusa dari jalan Allah. Karena akibatnya hanya kembali kepada diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 123",
    "description": "Allah lalu menenangkan hati nabi Muhammad dengan menjelaskan bahwa para pembesar yang jahat tidak hanya terdapat di mekah saja, tetapi juga di setiap negeri. Dan demikianlah pada setiap negeri kami jadikan pembesar-pembesar yang jahat agar melakukan tipu daya di negeri itu karena mereka lebih mampu menipu daya bawahannya, dan dalam kebiasaan, masyarakat akan mengikuti atasannya apakah dalam hal kebaikan atau keburukan. Tapi mereka hanya menipu diri sendiri tanpa menyadarinya, akibat dari perbuatan mereka akan mengenai mereka sendiri. Kemudian Allah menjelaskan tentang salah satu bentuk tipuan pemuka quraisy agar penduduk mekah tidak mengikuti rasulullah. Dan apabila datang suatu ayat kepada mereka yang menjelaskan tentang kebenaran nabi Muhammad, mereka berkata, kami tidak akan percaya, yakni beriman, sebelum diberikan kepada kami seperti apa yang diberikan kepada rasul-rasul Allah, yaitu wahyu yang dengan itu mereka menjadi nabi, sehingga menjadi orang yang diikuti, bukan yang mengikuti. Mereka dengki kepada kenabian nabi Muhammad. Allah lebih mengetahui di mana dia menempatkan tugas kerasulan-Nya. Penunjukan seseorang menjadi nabi adalah hak Allah semata sebagai anugerah dari-Nya terhadap orang tersebut, bukan sesuatu yang diminta, bukan karena keturunan, kecerdasan, dan banyaknya harta. Kemudian Allah menjelaskan tentang nasib mereka yang berdosa, seperti pemuka quraisy. Orang-orang yang berdosa nanti akan ditimpa kehinaan di sisi Allah dan azab yang keras karena tipu daya yang mereka lakukan. Mereka menghalangi masyarakat untuk beriman kepada nabi Muhammad."
  }
]