[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila datang kepada orang-orang musyrik dari penduduk Mekah itu hujjah yang terang tentang kenabian Muhammad , maka sebagian pemuka mereka berkata, ”Kami tidak akan pernah mengimani kenabiannya sampai Allah mau memberikan kepada kami sebagian dari (bukti) kenabian dan mukjizat, seperti yang telah diberikan kepada rasul terdahulu.” maka Allah membantah pernyatan mereka,dengan firman-Nya ”Allah lebih tahu dimana Dia akan meletakkan tugas kerasulan,” maksudnya tentang orang-orang yang pantas mengemban risalahnya dan menyampaikannya kepada manusia. Para penentang tersebut akan dilanda kehinaan, dan bagi mereka siksaan yang pedih di neraka jahanam disebabkan tipu daya mereka terhadap islam dan kaum muslimin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Apabila ayat-ayat Allah yang diturunkan kepada nabi-Nya ditunjukkan kepada para pembesar kaum kafir, maka mereka akan berkata, “Kami tidak akan percaya sebelum Allah memberi kami derajat kenabian dan kerasulan seperti yang Dia berikan kepada para Nabi dan Rasul.” Kemudian Allah menjawab ucapan mereka itu dengan menyatakan bahwa Allah lebih mengetahui siapa yang pantas menjadi rasul dan siapa yang mampu mengemban tugas itu, kemudian memberikan derajat kenabian dan kerasulan itu kepadanya. Para pembangkang yang jahat itu akan mendapatkan kehinaan dan kenistaan akibat kesombongan mereka untuk menerima kebenaran. Dan mereka akan ditimpa azab yang sangat pedih akibat tipu daya yang mereka buat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Para pemimpin kekafiran terus-menerus melakukan pembangkangan; dan apabila datang kepada mereka hujjah yang menunjukkan kebenaran Rasulullah, mereka berpaling dan menolaknya, dengan berkata dengan penuh kesombongan: \"Kami tidak akan mempercayai risalahmu sampai Allah memberikan kita kenabian dan mukjizat sebagaimana para rasul yang lain. Maka Allah membalas perkataan mereka dengan penuh ancaman dan olokan: \"Allah Maha Mengetahui siapa yang layak mendapat risalah. Orang-orang yang sombong itu akan mendapat kehinaan dan azab yang pedih akibat tipu daya yang selalu mereka lakukan untuk menghalangi dakwah kepada Allah.\" Syeikh as-Syinqithi berkata, firman Allah: وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله Dan apabila datang suatu ayat kepada mereka, mereka berkata, “Kami tidak akan percaya (beriman) sebelum diberikan kepada kami seperti apa yang diberikan kepada rasul-rasul Allah.” Yakni mereka tidak akan beriman hingga para malaikat mendatangi mereka dengan membawa Risalah sebagaimana Iya mendatangi para rasul, hari ini seperti firman Allah dalam ayat yang lain: وقال اللذين لا يرجون لقاءنا لولا أنزل علينا الملائكة أو نرى ربنا Dan orang-orang yang tidak mengharapkan pertemuan dengan Kami (di akhirat) berkata, “Mengapa bukan para malaikat yang diturunkan kepada kita atau (mengapa) kita (tidak) melihat Tuhan kita?” Dan firman Allah: أو تأتي بالله والملائكة قبيلا atau (sebelum) engkau datangkan Allah dan para malaikat berhadapan muka dengan kami, Ibnu kasur berkata: ayat ini menunjukkan bahwa Rasul diciptakan dengan penciptaan yang sesuai untuk menjalankan tugas Risalah dan Allah ketika menciptakan nya telah mengetahui bahwa dia akan mengutusnya. (at-Tahrir wa at-Tanwir: 7/42)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. وَإِذَا جَآءَتْهُمْ ءَايَةٌ (Apabila datang sesuatu ayat kepada mereka) Yakni jika kamu memberitahu pemimpin dan pembesar kaum quraisy tentang ayat-ayat yang diturunkan Allah kepadamu. قَالُوا۟ لَن نُّؤْمِنَ حَتَّىٰ نُؤْتَىٰ مِثْلَ مَآ أُوتِىَ رُسُلُ اللهِ ۘ (mereka berkata: “Kami tidak akan beriman sehingga diberikan kepada kami yang serupa dengan apa yang telah diberikan kepada utusan-utusan Allah”) Mereka berharap bahwa mereka tidak akan beriman kecuali jika mereka juga menjadi nabi. اللهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُۥ ۗ (Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan) Dan Allah telah memilih kerasulan ini untuk Muhammad pilihan dan kekasih-Nya. Maksud dari ayat ini adalah, maka janganlah kalian meminta apa yang bukan urusan kalian. سَيُصِيبُ الَّذِينَ أَجْرَمُوا۟ صَغَارٌ (Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah) Yakni kerendahan dan kehinaan. Para pembesar itu tidak mengatakan perkataan mereka tersebut kecuali karena kesombongan dalam hati mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ اللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ } \"Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan\" Allah -تعالى- sang khaliq yang memiliki ketetapan yang tinggi berhak memilih siapapun dari seorang arab untuk mengemban amanah sebagai pembawa risalah yang agung ini, maka ketika Allah memilih seorang Rasul dari bangsa arab dengan lisan arabnya yang fasih, maka dari tempat itulah syari'at islam ini dimulai dan itu menjadi ketetapan Allah yang terbaik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124 Apabila datang suatu ayat yang menunjukkan tentang kebenaran risalah Nabi Muhammad kepada mereka para penduduk Makkah dan para pembesarnya, mereka berkata: “Kami tidak akan beriman sehingga kami melihat yang serupa dengan berbagai mukjizat yang telah diberikan kepada para nabi Allah sebelummu”. Kemudian Allah menjawab mereka: Allah lebih Mengetahui kepada siapa Dia menempatkan tugas kerasulan. Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah dan siksa yang keras pada hari kiamat disebabkan mereka selalu membuat tipu daya. Ayat ini turun untuk Walid bin Mughirah yang berkata: Kalaupun kenabian ini benar, maka pasti aku akan lebih awal menjadi nabi dari pada Muhammad, sebab aku lebih tua, lebih kaya dan banyak anak.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila datang suatu ayat kepada mereka, mereka berkata,“Kami tidak akan beriman hingga diberikan} diberikan {kepada kami seperti apa yang diberikan} diberikan {kepada rasul-rasul Allah.” Allah lebih mengetahui di mana Dia menempatkan risalahNya. Orang-orang yang berdosa akan ditimpa kehinaan} kerendahan dan kehinaan {di sisi Allah} dari sisi Allah {dan azab yang keras karena tipu daya yang mereka lakukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. Para penjahat besar itu kukuh di atas kebatilannya dan menolak kebenaran yang dibawa oleh para Rasul karena hasad dan dengki, mereka berkata, “Kami tidak akan beriman sehingga diberikan kepada kami yang serupa dengan apa yang telah diberikan kepada utusan-utusan Allah,” berupa kenabian dan kerasulan. Ini mengandung penentangan mereka kepada Allah, bangga terhadap diri mereka, sombong terhadap kebenaran yang Dia turunkan melalui para rasul, dan penolakan terhadap keutamaan dan kebaikan Allah, maka Allah menjawab tantangan mereka yang rusak. Dia menyatakan bahwa mereka tidak layak mendapatkan kebaikan. Pada mereka tidak terdapat sesuatu yang bisa membuat mereka menjadi hamba-hamba Allah yang shalih. Apalagi menjadi nabi dan rasul. Allah berfirman, “Allah lebih mengetahui dimana Dia menempatkan tugas kerasulan.” Barangsiapa yang Allah mengetahuinya layak mendapatkannya, mampu menunaikan tanggung jawabnya, mempunyai segala sifat yang baik, dan terbebas dari segala akhlak yang tercela, maka Allah memberinya apa yang menjadi tuntutan hikmahNya, baik secara independen maupun menginduk, dan barangsiapa yang tidak demikian, maka Dia tidak akan meletakkan pemberianNya yang paling utama pada orang yang tidak kapabel dan tidak suci di sisiNya. Ayat ini mengandung dalil kesempurnaan hikmah Allah, karena walaupun Dia Maha Pengasih, Maha Pemurah, Mahaluas KarunaiNya, namun Dia adalah Mahabijaksana, tidak meletakkan karuniaNya kecuali pada orang yang layak. Kemudian Allah mengancam orang-orang yang berbuat kejahatan. Dia berfirman, “Orang-orang yang berdosa, nanti akan ditimpa kehinaan di sisi Allah.” Yakni kehinaan dan kenistaan, Allah menghinakan mereka akibat kesombongan mereka terhadap kebenaran. “Dan siksa yang keras itu disebabkan mereka selalu membuat tipu daya.” Maksudnya, disebabkan makar mereka, bukan karena Allah menzhalimi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 124: Yang menunjukkan kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam. Sedangkan mereka tidak cocok mendapatkan tugas kerasulan. Dalam ayat ini terdapat dalil sempurnanya kebijaksanaan Allah, hal itu karena meskipun Allah Maha Penyayang, Mahaluas kepemurahan-Nya lagi banyak ihsan-Nya, namun Dia Mahabijaksana, tidak meletakkan kepemurahan-Nya kecuali kepada orang yang berhak. Karena kesombongan mereka terhadap kebenaran. Bukan karena Allah berbuat zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 124",
    "description": "Kemudian Allah menjelaskan tentang salah satu bentuk tipuan pemuka quraisy agar penduduk mekah tidak mengikuti rasulullah. Dan apabila datang suatu ayat kepada mereka yang menjelaskan tentang kebenaran nabi Muhammad, mereka berkata, kami tidak akan percaya, yakni beriman, sebelum diberikan kepada kami seperti apa yang diberikan kepada rasul-rasul Allah, yaitu wahyu yang dengan itu mereka menjadi nabi, sehingga menjadi orang yang diikuti, bukan yang mengikuti. Mereka dengki kepada kenabian nabi Muhammad. Allah lebih mengetahui di mana dia menempatkan tugas kerasulan-Nya. Penunjukan seseorang menjadi nabi adalah hak Allah semata sebagai anugerah dari-Nya terhadap orang tersebut, bukan sesuatu yang diminta, bukan karena keturunan, kecerdasan, dan banyaknya harta. Kemudian Allah menjelaskan tentang nasib mereka yang berdosa, seperti pemuka quraisy. Orang-orang yang berdosa nanti akan ditimpa kehinaan di sisi Allah dan azab yang keras karena tipu daya yang mereka lakukan. Mereka menghalangi masyarakat untuk beriman kepada nabi Muhammad. Tugas para nabi adalah menyampaikan pesan-pesan Allah kepada masyarakat. Di antara masyarakat itu ada yang mendapatkan hidayah dan ada pula yang memilih kekufuran. Hidayah dan kekufuran adalah hak Allah sebagaimana juga risalah. Bedanya kalau hidayah itu harus diminta, sementara risalah adalah anugerah dan pemberian Allah semata kepada seseorang yang dipilih-Nya. Barang siapa dikehendaki Allah akan mendapat hidayah atau petunjuk, dia akan membukakan dadanya untuk menerima islam, yaitu pintu hatinya terbuka untuk menerima islam atau cahaya yang datang dari Allah yang dengannya seseorang bisa melihat kebenaran, kemudian mengikuti kebenaran itu dengan memeluk islam. Dan barang siapa dikehendaki-Nya menjadi sesat, dengan kesadarannya sendiri dia memilih kekafiran dan meninggalkan kebenaran, maka dia jadikan dadanya sempit dan sesak sehingga tidak ada celah sedikit pun untuk masuknya kebenaran di hatinya, seakan-akan dia sedang mendaki ke langit. Demikianlah Allah menimpakan siksa kepada orang-orang yang tidak beriman. Namun demikian, Allah tidak akan menyiksa satu kaum kecuali setelah diperlihatkan kepada mereka tandatanda kebenaran, tetapi mereka secara sadar enggan menerimanya."
  }
]