[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka barangsiapa yang Allah berkehendak memberinya taufik untuk menerima kebenaran, niscaya Allah akan melapangkan dadanya untuk bertauhid dan beriman. Dan barangsiapa Allah berkehendak menyesatkannya maka Dia akan menjadikan dadanya dalam kondisi sangat keras dan tertutup dari menerima hidayah, seperti keadaan orang yang menaiki lapisan-lapisan udara yang tinggi, maka ia akan mengalami sesak yang parah dalam bernafas. Dan sebagaimana Allah menjadikan hati orang-orang kafir sangat sesak dan tertutup , dan begitu juga Dia menimpakan siksaan kepada orang-orang yang tidak beriman kepadaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "125. Barangsiapa yang dikehendaki oleh Allah untuk dibimbing ke jalan yang benar maka dilapangkan dadanya untuk menerima agama Islam dengan sukarela. Dan barangsiapa yang dikehendaki oleh Allah untuk diabaikan dan tidak dibimbing ke jalan yang benar maka disempitkan dadanya sehingga tidak bisa menerima kebenaran. Keadaannya seperti orang yang naik ke langit yang tinggi hingga susah bernafas. Dan sebagaimana Allah memberikan kondisi yang sangat sempit itu kepada orang yang tersesat, Dia juga memberikan azab yang berat kepada orang-orang yang tidak beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "125. Barangsiapa yang Allah kehendaki baginya taufik menuju keimanan maka Allah akan menjadikan dadanya lapang untuk menerima Islam. Dan barangsiapa yang Allah kehendaki untuk berada dalam kesesatan, maka Allah akan jadikan dadanya sempit dan tertutup, seperti orang yang menaiki langit yang semakin sulit bernafas ketika ia naik semakin tinggi, sehingga dadanya sesak dan nafasnya habis. Sebagaimana Allah menjadikan dada orang-orang kafir dalam keadaan yang buruk seperti itu, maka demikianlah Allah akan menimpakan azab yang sangat berat bagi orang-orang yang tidak beriman kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "125. فَمَن يُرِدِ اللهُ أَن يَهْدِيَهُۥ يَشْرَحْ صَدْرَهُۥ لِلْإِسْلٰمِ ۖ (Barangsiapa yang Allah menghendaki akan memberikan kepadanya petunjuk, niscaya Dia melapangkan dadanya untuk (memeluk agama) Islam) Yakni meluaskan dadanya agar dadanya lapang dalam menerima Islam. Abu Ja’far al-Mada’iny berkata: Rasulullah ditannya tentang ayat ini oleh para sahabat: Ya Rasulullah, bagaimana bisa dadanya menjadi lapang? Ia menjawab: “karena cahaya yang dimasukkan kedalam dadanya sehingga terasa luas dan lapang baginya”. Mereka berkata: “apakah hal itu ada tandanya sehigga bisa diketahui?”. Ia menjawab: “yakni dengan mendekatkan diri pada negeri yang kekal (akhirat), menjauhi negeri yang penuh tipu daya (dunia), dan menyiapkan kematian sebelum kedatangannya”. Hadist ini dikeluarkan oleh Abdurrazaq, Ibnu Jarir dan yang lainnya; ini adalah hadist yang dhaif karena termasuk hadist mursal, namun memiliki beberapa penguat. وَمَن يُرِدْ أَن يُضِلَّهُۥ يَجْعَلْ صَدْرَهُۥ ضَيِّقًا (Dan barangsiapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak) Tidak ada tempat bagi keimanan dan hidayah didalamnya. حَرَجًا (lagi sempit) Al-Zajjaj berkata: makna (الحرج) adalah sesuatu yang sangat-sangat sempit. كَأَنَّمَا يَصَّعَّدُ فِى السَّمَآءِ ۚ (seolah-olah ia sedang mendaki langit) Yakni jika ia mencoba untuk beriman maka seakan-akan ia mencoba untuk naik ke langit. Tafsiran yang benar dari ayat ini adalah bahwa siapa yang naik ke langit maka ia akan merasakan kesempitan yang luar biasa di dadanya dan serasa tercekik karena kekurangan udara; perumpamaan ini merupakan salah satu mukjizat al-Qur’an, dan makna ayat ini belum tersingkap sesuai kebenaran kecuali pada akhir-akhir ini. Seperti ini pula keadaan orang yang diajak untuk memeluk agama Islam namun Allah telah mentakdirkannya dalam kesesatan maka ia akan meresakan kesempitan yang luar biasa. كَذٰلِكَ يَجْعَلُ اللهُ الرِّجْسَ (Begitulah Allah menimpakan siksa) Makna (الرجس) yakni busuk. Pendapat lain mengatakan yakni azab."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Suatu ketika Umar -رضي الله عنه- bertanya kepada seorang a'robi : apa yang kamu ketahui tentang \"al-harojah\" ? dia pun berkata : \"al-harojah\" dalam isitilah kami adalah pohon yang tumbuh diantara pepohonan yang rindang namun tidak dapat diraih oleh pengembala atau binatang apapun, Umar kemudian berkata : seperti itulah hati yang munafiq segala kebaikan tidak akan sampai kepadanya. 2 ). Sesungguhnya iman kepada kehidupan akhirat menjadikan seorang hamba akan merasakan bahwa kematian adalah jalan untuk sampai kepada kehidupan akhirat, sehingga ia hidup di dunia dengan tujuan untuk hidup di alam akhirat, dia mengisi hidupnya dengan segala amal kebaikan dan senatiasa berharap kepada tuhannya, dan sungguh buruk usia seseorang jika ia menganggap bahwa kematian adalah akhir dari segalanya, perhatikanlah ayat yang agung ini mengabarkan betapa burukanya hidup pendusta dan pengingkar hari pembalasan : { فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ ۖ وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ ۚ كَذَٰلِكَ يَجْعَلُ اللَّهُ الرِّجْسَ عَلَى الَّذِينَ لَا يُؤْمِنُونَ } \"Barangsiapa yang Allah menghendaki akan memberikan kepadanya petunjuk, niscaya Dia melapangkan dadanya untuk (memeluk agama) Islam. Dan barangsiapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki langit. Begitulah Allah menimpakan siksa kepada orang-orang yang tidak beriman\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "125 Barangsiapa yang Allah kehendaki akan diberi petunjuk, niscaya Dia melapangkan dadanya untuk memeluk agama Islam, menyinari hatinya sehingga dia menerima Islam. Adapun barangsiapa yang dikehendaki Allah dalam kesesatan, niscaya Allah akan menjadikan dadanya sesak dan sangat sempit, seolah-olah ia sedang mendaki langit namun tidak bisa, dan tidak bisa memasukkan iman ke dalam hatinya. Begitulah Allah menimpakan siksa kepada orang-orang yang tidak beriman sebab pembangkangan mereka dalam kekufuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka siapa saja yang Allah kehendaki untuk mendapat hidayah} Dia akan menuntunnya kepada kebenaran {Dia akan melapangkan} meluaskan dan melapangkan {dadanya untuk menerima Islam. Siapa saja yang Dia kehendaki tersesat} menyesatkannya {Dia akan menjadikan dadanya sempit lagi sesak} sesak {seakan-akan dia sedang mendaki ke langit} terbebani oleh sesuatu yang dipikul berupa menaiki langit {Begitulah Allah menimpakan siksa} azab {kepada orang-orang yang tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "125. Allah menjelaskan kepada hamba-hambaNya tanda-tanda kebahagiaan, hidayah, orang kesengasaraan, dan kesesatan seorang hamba, “Sesungguhnya orang yang dadanya terbuka untuk Islam dan disinari cahaya iman, ia hidup dengan sinar yakin, maka jiwanya tentram, mencintai kebaikan, melakukannya dengan jiwa yang rela, merasakan kenikmatan tanpa merasa berat; ini adalah tanda bahwa Allah telah memberinya petunjuk, menganugerahkan taufik kepadanya sehingga dia mampu meniti jalan lurus. Dan bahwa tanda orang yang Allah ingin “menyesatkannya” adalah, “Allah menjadikan dadanya sesak lagi sempit.” Maksudnya, dadanya sangat sempit dari iman, ilmu, dan yakin. Hatinya telah terbenam di dalam syubhat dan syahwat sehingga tidak ada kebaikan yang masuk ke dalamnya, dan hatinya tidak lapang dalam melakukan kebaikan, saking sempit dan sesaknya, seolah-olah “ia sedang mendaki ke langit.” Maksudnya, seolah-olah dia dipaksa naik ke langit di mana dia tidak mempunyai cara untuk menghindarinya. Penyebabnya adalah ketidakimanan mereka. Ketidakimanan merekalah yang menyebabkan Allah menimpakan siksa kepada mereka, karena mereka sendirilah yang menutup pintu rahmat dan kebaikan dari diri mereka. Ini adalah parameter yang adil dan jalan yang tidak berubah. Barangsiapa yang memberi, bertakwa dan membenarkan kebaikan, maka Allah memudahkannya kepada kebaikan. Dan barangsiapa yang kikir, merasa kaya dan mendustakan kebaikan, maka Allah akan memudahkannya kepada kesulitan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 125: Ayat ini menerangkan tanda orang yang mendapat hidayah dan tanda orang yang tersesat. Disesatkan Allah karena sikapnya; berupa keingkarannya dan tidak mau memahami petunjuk-petunjuk Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 125",
    "description": "Tugas para nabi adalah menyampaikan pesan-pesan Allah kepada masyarakat. Di antara masyarakat itu ada yang mendapatkan hidayah dan ada pula yang memilih kekufuran. Hidayah dan kekufuran adalah hak Allah sebagaimana juga risalah. Bedanya kalau hidayah itu harus diminta, sementara risalah adalah anugerah dan pemberian Allah semata kepada seseorang yang dipilih-Nya. Barang siapa dikehendaki Allah akan mendapat hidayah atau petunjuk, dia akan membukakan dadanya untuk menerima islam, yaitu pintu hatinya terbuka untuk menerima islam atau cahaya yang datang dari Allah yang dengannya seseorang bisa melihat kebenaran, kemudian mengikuti kebenaran itu dengan memeluk islam. Dan barang siapa dikehendaki-Nya menjadi sesat, dengan kesadarannya sendiri dia memilih kekafiran dan meninggalkan kebenaran, maka dia jadikan dadanya sempit dan sesak sehingga tidak ada celah sedikit pun untuk masuknya kebenaran di hatinya, seakan-akan dia sedang mendaki ke langit. Demikianlah Allah menimpakan siksa kepada orang-orang yang tidak beriman. Namun demikian, Allah tidak akan menyiksa satu kaum kecuali setelah diperlihatkan kepada mereka tandatanda kebenaran, tetapi mereka secara sadar enggan menerimanya. Kemudian Allah menjelaskan tentang jalan kehidupan yang benar. Dan inilah jalan tuhanmu yang lurus, yaitu agama islam yang diridai Allah. Sungguh kami telah menjelaskan ayat-ayat kami yang ada di dalam Al-Qur'an, berupa janji dan ancaman, halal dan haram, pahala dan siksa, dan lain-lainnya kepada orang-orang yang menerima peringatan."
  }
]