[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "126 Apa yang kami jelaskan kepadamu ini (wahai rasul), itulah jalan yang mengantarkan menuju keridhaan tuhanmu dan surgaNYa. Sungguh kami telah menerangkan berbagai bukti petunjuk bagi siapa saja yang mau mengambil pelajaran dari orang-orang yang memiliki akal yang kuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Agama yang telah Kami syariatkan untukmu -wahai Rasul- adalah jalan Allah yang lurus, tidak bengkok sedikitpun. Kami telah menjelaskan banyak ayat kepada orang yang memiliki kemampuan untuk mengerti dan memahami pelajaran dari Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126-127. Hai Muhammad, agama yang kamu peluk ini merupakan agama yang agung dari Tuhanmu. Kami telah menjelaskan ayat-ayat dan tanda-tanda kekuasaan Allah yang dapat didengar maupun dilihat bagi orang yang mau mengambil pelajaran dan manfaat darinya; balasan bagi mereka adalah surga dari Tuhan mereka yang senantiasa mengatur urusan mereka dengan memberi balasan yang mulia atas amal kebaikan yang mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126 Jalan ini adalah jalan Tuhanmu yang harus ditempuh oleh Nabi dan orang-orang mukmin; ini adalah jalan yang lurus tanpa belokan. Sesungguhnya Kami telah menjelaskan ayat-ayat Kami kepada orang-orang yang mau mengingat, berfikir, mengambil pelajaran dan mengambil manfaat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Inilah jalan} jalan {yang lurus dari Tuhanmu. Sungguh Kami telah merincikan} menjelaskan {ayat-ayat kepada orang-orang yang mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. Maksudnya, jalan yang seimbang dan mengantarkan kepada Allah dan kepada rumah kemuliaanNya. Hukum-hukumNya telah dijelaskan, syariat-syariatNya telah terperinci, kebaikan dan keburukan telah dibedakan, akan tetapi perincian dan penjelasan keburukan telah dibedakan, akan tetapi perincian dan penjelasan ini bukan untuk setiap orang, ia hanya untuk “orang-orang yang mengambil pelajaran.” Karena merekalah orang-orang yang mengetahui dan mengambil manfaat dari ilmunya, dan Allah menyiapkan untuk mereka balasan yang besar dan pahala yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 126: Yang menghubungkan kepada Allah dan ke surga-Nya. Jalan tersebut telah dijelaskan, dirincikan, dan dipisahkan dari yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 126",
    "description": "Kemudian Allah menjelaskan tentang jalan kehidupan yang benar. Dan inilah jalan tuhanmu yang lurus, yaitu agama islam yang diridai Allah. Sungguh kami telah menjelaskan ayat-ayat kami yang ada di dalam Al-Qur'an, berupa janji dan ancaman, halal dan haram, pahala dan siksa, dan lain-lainnya kepada orang-orang yang menerima peringatan. Bagi mereka ada beberapa penghargaan yang agung dari Allah. Pertama, disediakan tempat yang damai, yaitu surga yang tidak ada kesulitan apa pun di dalamnya. Kedua, mereka berada di suatu tempat yang sangat terhormat yaitu di sisi tuhannya yang telah membimbing mereka. Dan, ketiga, dialah pelindung mereka yang selalu mengasihi dan menyertai mereka dalam segala suasana. Hal itu semua disebabkan karena amal kebajikan yang mereka kerjakan."
  }
]