[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi orang-orang yang mau mengambil pelajaran disisi tuhan mereka pada hari kiamat ada tempat tinggal yang penuh keselamatan dan aman dari segala hal yang tidak disukai, yaitu surga; dan Dia adalah penolong dan pelindung mereka, sebagai balasan bagi mereka atas amal-amal mereka yang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "127. Mereka akan mendapatkan Surga, di dalamnya mereka akan selamat dari segala hal yang tidak menyenangkan. Dan Allah lah yang akan menjadi penolong dan pendukung mereka sebagai balasan atas kebajikan yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "127. لَهُمْ دَارُ السَّلٰمِ عِندَ رَبِّهِمْ ۖ (Bagi mereka (disediakan) darussalam pada sisi Tuhannya) Yakni surga, karena ia merupakan negeri keselamatan dari segala keburukan. وَهُوَ وَلِيُّهُم (dan Dialah Pelindung mereka) Yakni penolong mereka dan pengatur perihal mereka hingga mereka memasuki surga dengan penuh rasa aman dari segala kezaliman dan keburukan. بِمَا كَانُوا۟ يَعْمَلُونَ (disebabkan amal-amal yang selalu mereka kerjakan) Yakni karena amalan-amalan baik mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "127 Bagi mereka yang senantiasa mengingat dan mengambil pelajaran disediakan surga Darussalam tempat tinggal yang penuh kedamaian dari segala ketidaknyamanan. Pada hari kiamat Allah lah penguasa segala urusan mereka, sekaligus penolong mereka disebabkan amal-amal saleh yang selalu mereka kerjakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi mereka tempat yang damai} tempat yang damai dari setiap kesusahan yaitu surga {di sisi Tuhannya. Dialah pelindung mereka} penolong dan pelindung mereka {karena apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "127. Oleh karena itu DIa berfirman, “Bagi mereka (disediakan) Darussalam (surga).” Surga dinamakan Darussalam karena keselamatannya dari segala kekurangan, cacat, kerusuhan, kesedihan, kecemasan, dan penganggu-pengganggu lainnya. Hal itu secara otomatis menunjukkan bahwa nikmatnya benar-benar sempurna dan benar-benar lengkap di mana orang yang ingin menjelaskannya tidak mampu untuk menjelaskannya. Para pengkhayal tidak akan berkhayal melebihi hakikatnya, berupa nikmat rohani, hati, dan badan. Mereka mendapatkan sesuatu yang diinginkan oleh jiwa dan dinikmati oleh mta, dan mereka kekal di dalamnya. “Dan Dia-lah Pelindung mereka,” Yang mengatur dan mendidik mereka, menyayangi mereka dalam segala perkara mereka, membantu mereka untuk menaatiNya, memudahkan untuk mereka segala sebab yang mengantarkan kepada kecintaanNya. Dia melindungi mereka karena amal baik mereka dan persembahan mereka di mana tujuan mereka adalah ridha Allah, lain halnya dengan orang yang berpaling dari pelindungNya dan mengikuti hawa nafsunya, dia dikuasai oleh setan, maka setanlah yang mengusirnya sehingga ia merusak agama dan dunianya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 127: Pengurus dan Pembimbing mereka. Di mana yang mereka cari adalah ridha Tuhan mereka. Berbeda dengan orang yang berpaling dari Tuhannya dan mengikuti hawa nafsunya, maka setan yang menguasainya, dan dia akan merusak agama dan dunianya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 127",
    "description": "Bagi mereka ada beberapa penghargaan yang agung dari Allah. Pertama, disediakan tempat yang damai, yaitu surga yang tidak ada kesulitan apa pun di dalamnya. Kedua, mereka berada di suatu tempat yang sangat terhormat yaitu di sisi tuhannya yang telah membimbing mereka. Dan, ketiga, dialah pelindung mereka yang selalu mengasihi dan menyertai mereka dalam segala suasana. Hal itu semua disebabkan karena amal kebajikan yang mereka kerjakan. Allah menjelaskan sebagian dari ihwal orang-orang yang zalim pada hari kiamat di hadapan Allah. Dan ingatlah pada hari ketika dia mengumpulkan mereka semua, yaitu orang-orang yang sesat dan menyesatkan dari kelompok jin atau setan dan manusia, dan Allah berfirman kepada segolongan jin (setan), karena merekalah yang menjadi asal mula adanya kesesatan pada manusia, wahai golongan jin! kamu telah banyak menyesatkan manusia dengan membujuk mereka untuk melakukan kemusyrikan, kekafiran, dan kemaksiatan. Dan kawan-kawan mereka dari golongan manusia berkata, mengadu dengan memberikan pengakuan kepada Allah terhadap apa yang terjadi, ya tuhan, kami telah saling mendapatkan kesenangan. Manusia memanfaatkan jin melalui perbuatan sihir, tenung, dan juga tergoda untuk melakukan kemaksiatan dan lainnya, dan jin merasa bangga bahwa mereka dijadikan panutan, penguasa, dan pengayom oleh manusia. Dan sekarang waktu yang telah engkau tentukan buat kami telah datang. Setelah mendengarkan pengakuan dari kedua belah pihak, Allah berfirman untuk memberikan putusan akhir, nerakalah tempat kamu selama-lamanya, kecuali jika Allah menghendaki lain. Allah mempunyai kekuasaan yang tidak terbatas dalam segala hal. Sungguh, tuhanmu mahabijaksana yang meletakkan sesuatu pada tempatnya, menyiksa orang yang berdosa dengan keadilan-Nya, dan memasukkan orang yang bertakwa ke dalam surga dengan anugerah-Nya. Dia maha mengetahui siapa yang berbuat baik dan siapa yang berbuat buruk."
  }
]