[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), hari ketika Allah akan menghimpun orang-orang kafir dan para pembela mereka dari kalangan setan-setan dari bangsa jin, lalu Dia berfirman, ”wahai golongan jin, sungguh kalian telah menyesatkan banyak manusia.” maka kawan-kawan mereka dari orang-orang kafir berkata, ”wahai tuhan kami, sungguh sebagian kami telah mendapatkan manfaat dari sebagian yang lain dan kami telah sampai kepada waktu yang Engkau tentukan atas kami dengan berakhirnya kehidupan dunia.” Allah berfirman kepada mereka, ”neraka adalah tempat berdiam kalian.” Maksudnya menjadi tempat tinggal kalian secara abadi di dalamnya, kecuali orang yang Allah kehendaki tidak kekal berada di sana dari para pelaku maksiat yang bertauhid kepada Allah. Sesungguhnya tuhanmu Maha bijaksana dalam pengaturan dan penciptaNya, maha mengetahui seluruh urusan hamba-hambaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Dan ingatlah -wahai Rasul- tatkala Allah mengumpulkan dua golongan makhluk-Nya; jin dan manusia, kemudian Allah berfirman, “Wahai sekalian jin! Kalian telah banyak menyesatkan manusia dan menghalang-halangi mereka dari jalan Allah.” Lalu para pengikutnya dari golongan manusia menjawab Rabb mereka, “Kami sama-sama mendapatkan kesenangan dari yang lain. Bangsa jin mendapatkan kesenangan dengan kepatuhan bangsa manusia kepadanya. Sedangkan bangsa manusia mendapatkan kesenangan dengan tercapainya keinginannya. Dan kami telah sampai pada ajal yang telah Engkau tetapkan bagi kami. Maka hari ini adalah hari Kiamat.” Allah berfirman, “Neraka adalah tempat tinggal kalian untuk selama-lamanya. Kecuali orang yang Allah kehendaki masa tertentu yakni sejak mereka dibangkitkan dari kubur hingga kesudahan mereka di Neraka Jahanam, itulah masa yang Allah kecualikan bagi yang tidak masuk ke neraka secara abadi.” Sesungguhnya Rabbmu -wahai Rasul- Maha Bijaksana dalam menetapkan dan mengatur segala sesuatu, lagi Maha Mengetahui perihal hamba-hamba-Nya dan siapa saja yang berhak mendapatkan azab-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128. Allah menyebutkan kisah percakapan-Nya pada hari kiamat ketika mengumpulkan manusia dan jin; Dia berfirman kepada para jin: \"Kalian telah berhasil mencapai tujuan kalian untuk menyesatkan begitu banyak manusia.\" Dan para bala tentara mereka dari golongan manusia mengajukan alasan kepada Allah: \"Ya Tuhan kami, kami telah saling mendapat manfaat dengan syahwat dunia, dan kami telah mencapai ajal yang telah engkau tetapkan bagi kami untuk hidup di dunia, kemudian datanglah hari perhitungan ini.\" Maka Allah membalas alasan mereka yang telah terlambat itu: \"Tempat kalian adalah neraka jahanam, kalian akan kekal di dalamnya selamanya, kecuali bagi orang yang dikehendaki Allah untuk mendapat rahmat-Nya dengan tidak dikekalkan di dalam neraka, yaitu orang-orang bertauhid yang melakukan kemaksiatan. Sesungguhnya Allah adalah Tuhanmu yang Maha Bijaksana dalam mengatur makhluk-Nya dan Maha Mengetahui segala urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. وَيَوْمَ يَحْشُرُهُمْ جَمِيعًا (Dan (ingatlah) hari diwaktu Allah menghimpunkan mereka semuanya) Yakni dikumpulkannya manusia dan jin seluruhnya. يٰمَعْشَرَ الْجِنِّ((dan Allah berfirman): “Hai golongan jin) Yakni pada hari mereka dikumpulkan, Allah berfirman kepada mereka: “hai golongan jin” قَدِ اسْتَكْثَرْتُم مِّنَ الْإِنسِ ۖ (sesungguhnya kamu telah banyak menyesatkan manusia”) Dengan godaan dan penyesatan kalian sehingga mereka menjadi pengikut kalian, maka Kami mengumpulkan mereka dengan kalian. Terdapat pendapat mengatakan makna (الاستمتاع) yakni kenikmatan yang dirasakan oleh para jin karena ketaatan manusia kepada mereka, dan manusia mau melakukan apa yang jin inginkan. وَقَالَ أَوْلِيَآؤُهُم مِّنَ الْإِنسِ رَبَّنَا اسْتَمْتَعَ بَعْضُنَا بِبَعْضٍ (lalu berkatalah kawan-kawan meraka dari golongan manusia: “Ya Tuhan kami, sesungguhnya sebahagian daripada kami telah dapat kesenangan dari sebahagian (yang lain)) Kenikmatan yang dirasakan manusia dari jin adalah karena mereka menuruti kemaksiatan yang telah dihiasi para jin sehingga mereka mengerjakan dan menikmatiinya. Dan juga para dukun dan yang semisalnya pada zaman jahiliyah membenarkan bisikan yang dibisikkan kepada mereka, dan mereka merasakan kenikmatan dalam hal itu dan mendapatkan sebagian harta dunia. وَبَلَغْنَآ أَجَلَنَا الَّذِىٓ أَجَّلْتَ لَنَا ۚ (dan kami telah sampai kepada waktu yang telah Engkau tentukan bagi kami”) Yakni di hari kiamat mereka mengakui janji Allah yang telah sampai kepada mereka yang dahulu mereka dustakan. قَالَ النَّارُ مَثْوَىٰكُمْ (Allah berfirman: “Neraka itulah tempat diam kamu) Yakni tempat tinggal kalian. خٰلِدِينَ فِيهَآ إِلَّا مَا شَآءَ اللهُ ۗ (sedang kamu kekal di dalamnya, kecuali kalau Allah menghendaki (yang lain)”) Yakni kecuali saat Allah berkehendak untuk tidak kekal didalam neraka. Tentang ayat ini Ibnu Abbas mengatakan: tidak boleh bagi seseorang untuk mendahului Allah dalam putusan-Nya atas makhluk-Nya, tidak boleh mencap seseorang adalah Ahli surga atau neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128 Ingatlah wahai Nabi apa yang terjadi kelak di hari kiamat, hari ketika Allah menghimpunkan manusia dan jin semuanya, dan Allah berfirman: “Hai golongan jin, sesungguhnya kalian telah banyak menyesatkan manusia, sampai mereka menjadi pengikut kalian, maka Kami kumpulkan mereka bersama kalian”. Lalu kawan-kawan meraka dari golongan manusia berkata: “Ya Tuhan kami, sesungguhnya sebagian dari kami telah mendapat kesenangan dari sebagian yang lain sebab taat dan mengikuti mereka. Manusia telah mendapat kesenangan dari para syaitan karena telah ditunjukkan kepada berbagai syahwat dan dihiasi oleh berbagai perkara haram. Para pendeta juga menggunakan pengetahuan dari para jin. Dan kami telah sampai kepada waktu yang telah Engkau tentukan bagi kami yaitu kematian dan hari kiamat. Kami juga telah melihat apa yang telah Engkau janjikan kepada kami, dan juga melihat apa yang kami dulu dustakan di dunia”. Allah berfirman: “Neraka itulah tempat tinggal kalian, kalian kekal di dalamnya, kecuali kalau Allah menghendaki untuk bisa keluar darinya. Kalian akan diberi minum dari air yang sangat panas yang bisa memutuskankan usus”. Sesungguhnya Tuhanmu Maha Bijaksana dalam segala perbuatan dan pembalasan-Nya lagi Maha Mengetahui atas segala yang menjadi hak setiap kelompok. Ibnu Abbas berkata: dalam ayat ini dijelaskan bahwa tidak ada seorangpun yang bisa menghukumi ciptaan Allah, baik tentang tempat tinggalnya kelak surga ataupun neraka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) pada hari ketika Dia mengumpulkan mereka semua (dan berfirman), \"Wahai golongan jin, sungguh kalian sering kali (menyesatkan) manusia”} kalian sering menyesatkan manusia dan membelokkan mereka dari jalan Allah {Kawan-kawan mereka} kawan-kawan setan yang menaati mereka yang lurus {dari golongan manusia berkata,“Ya Tuhan kami, telah mendapat kesenangan} mengambil manfaat {sebagian kami dari sebagian lain, dan kami telah sampai pada waktu kami yang telah Engkau tentukan untuk kami” Allah berfirman, “Neraka adalah tempat kalian selama-lamanya, kecuali jika Allah menghendaki lain”} kecuali lama waktu antara kebangkitannya sampai masuk ke dalam neraka {Sesungguhnya Tuhanmu Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128. Allah berfirman, “dan (ingatlah) hari di waktu Allah menghimpun mereka semuanya.” Yakni seluruh manusia dan jin, baik yang sesat di antara mereka dan menyesatkan yang lain. Dia berfirman, mencela jin yang menyesatkan manusia, menghiasi keburukan bagi mereka, dan mendorong mereka kepada kemaksiatan, “Hai golongan jin (setan), sungguh kamu telah banyak (menyesatkan) manusia.” Maksudnya, kamu banyak menyesatkan dan menghalangi manusia dari jalan Allah, bagaimana kamu berani melanggar batasan-batasanKu, kamu berani menentang rasul-rasulKu, kamu berperan memerangi Allah, berusaha menghalang-halangi hamba-hamba Allah dari jalan Allah kepada jalan neraka? Pada hari ini laknatKu menimpamu, murka-Ku adalah balasanmu, dan Kami akan menambah azabmu berdasarkan kekufuran dan penyesatanmu kepada orang lain. Kamu tidak mempunyai dalih yang bisa kamu sodorkan sebagai alasan, tidak ada tempat berlindung bagimu, tidak ada pemberi syafaat dan tidak ada permohonan yang didengarkan, pada hari ini kamu jangan bertanya tentang azab, siksa, dan kehinaan yang menimpa mereka. Oleh karena itu, Allah tidak menyebutkan alasan untuk mereka. Adapun teman-teman mereka dari kalangan manusia, maka mereka menyodorkan alasan yang mengada-ada. Mereka berkata, “Ya Tuhan kami, sebagian dari kami telah mendapat kesenangan dari sebagian (yang lain).” Maksudnya, masing-masing dari jin dan manusia mendapatkan kesenangan dan manfaat dari yang lain. Jin merasa senang dengan ketaatan manusia kepadanya, dia menikmati ibadah, penghormatan, dan permohonan perlindungan manusia kepadanya, sementara manusia mendapatkan kesenangan dengan mendapatkan apa yang diinginkan dan diimpikan dengan pelayanan yang dilakukan oleh jin untuknya dalam sebagian ambisinya. Manusia menyembah jin lalu jin menjadi khadamnya dengan mewujudkan keperluan-keperluan dunia untuknya. Maksudnya, mewujudkan keperluan-keperluan dunia untuknya. Maksudnya, mewujudkan dosa-dosa kami yang telah terjadi, dan hal tersebut tidak mungkin ditolak. “Dan kami telah sampai kepada waktu yang Engkau tentukan bagi kami.” Maksudnya, kami telah sampai di tempat yang mana amalan-amalan akan dibalas, maka lakukanlah apa yang Engkau kehendaki pada kami, hujjah kami telah habis, kami sudah tidak memiliki alasan lagi. Perkaranya adalah perkaraMu dan hukumnya adalah hukumMu. Seakan-akan ucapan yang mereka katakan ini mengandung kerendahan dan kepasrahan, namun dilakukan bukan pada waktunya (yang tepat). Oleh karena itu, Allah memutuskan dengan keputusanNya yang adil yang tidak ada kezhaliman padanya. Dia berfirman, “Neraka itulah tempat diammu sedang kamu kekal di dalamnya,” karena keputusan ini berasal tuntutan hikmah dan ilmunya, maka Dia menutup ayat dengan FirmanNya, “Sesungguhnya Tuhanmu Mahabijaksana lagi Maha Mengetahui.” Sebagaimana ilmuNya meliputi dan mencakup segala sesuatu, maka hikmah tujuanNya juga meliputi dan mencakup segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 128: Maksudnya manusia telah mendapat hasil kelezatan-kelezatan duniawi karena syahwat yang dijadikan indah oleh setan atau karena pelayanan jin kepada mereka seperti ditunjukkan hal-hal yang luar biasa, sedangkan jin telah memperoleh kenikmatan karena ketundukan manusia kepadanya. Yakni hari kiamat, dan ini merupakan penyesalan mereka, namun penyesalan ketika itu tidak berguna lagi. Ini merupakan keadilan Allah Subhaanahu wa Ta'aala, karena kesalahan adalah kesalahan yang berhak diberi hukuman, terlebih setelah sebelumnya mereka diberi peringatan dengan diutusnya para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 128",
    "description": "Allah menjelaskan sebagian dari ihwal orang-orang yang zalim pada hari kiamat di hadapan Allah. Dan ingatlah pada hari ketika dia mengumpulkan mereka semua, yaitu orang-orang yang sesat dan menyesatkan dari kelompok jin atau setan dan manusia, dan Allah berfirman kepada segolongan jin (setan), karena merekalah yang menjadi asal mula adanya kesesatan pada manusia, wahai golongan jin! kamu telah banyak menyesatkan manusia dengan membujuk mereka untuk melakukan kemusyrikan, kekafiran, dan kemaksiatan. Dan kawan-kawan mereka dari golongan manusia berkata, mengadu dengan memberikan pengakuan kepada Allah terhadap apa yang terjadi, ya tuhan, kami telah saling mendapatkan kesenangan. Manusia memanfaatkan jin melalui perbuatan sihir, tenung, dan juga tergoda untuk melakukan kemaksiatan dan lainnya, dan jin merasa bangga bahwa mereka dijadikan panutan, penguasa, dan pengayom oleh manusia. Dan sekarang waktu yang telah engkau tentukan buat kami telah datang. Setelah mendengarkan pengakuan dari kedua belah pihak, Allah berfirman untuk memberikan putusan akhir, nerakalah tempat kamu selama-lamanya, kecuali jika Allah menghendaki lain. Allah mempunyai kekuasaan yang tidak terbatas dalam segala hal. Sungguh, tuhanmu mahabijaksana yang meletakkan sesuatu pada tempatnya, menyiksa orang yang berdosa dengan keadilan-Nya, dan memasukkan orang yang bertakwa ke dalam surga dengan anugerah-Nya. Dia maha mengetahui siapa yang berbuat baik dan siapa yang berbuat buruk. Jika pada ayat sebelumnya diinformasikan bahwa antara jin dan manusia terdapat hubungan saling memanfaatkan, maka pada ayat ini dijelaskan hubungan antara orang-orang yang berbuat zalim. Dan demikianlah kami jadikan sebagian orang-orang zalim berteman dengan sesamanya, karena seseorang akan mencari teman sesama yang sejiwa dan seirama dalam hidup, atau orang yang zalim akan dikuasai oleh pelaku kezaliman lainnya, sesuai dengan apa yang mereka kerjakan yaitu kekafiran dan kemaksiatan."
  }
]