[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana kami telah jadikan setan-setan dari jin menguasai manusia-manusia kafir, maka setan-setan itu menjadi kawan-kawan mereka, begitu pula kami jadikan manusia-manusia zhalim saling menguasai satu sama lain di dunia disebabkan apa yang telah mereka perbuat dari kemaksiatan-kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Dan sebagaimana Kami telah memberikan kuasa kepada jin yang durhaka agar menyesatkan sebagian manusia, Kami juga memberikan kuasa kepada orang yang zalim agar mendorong orang yang zalim lainnya untuk berbuat jahat, menghalang-halanginya serta menjauhkannya supaya tidak berbuat baik, sebagai balasan atas perbuatan maksiat yang telah mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "129. Sebagaimana orang-orang fasik dari golongan jin dan manusia yang saling bertukar kenikmatan, demikian pula Kami menjadikan orang-orang zalim dari golongan jin dan manusia saling menguasai ketika di dunia sebagai hukuman yang disegerakan bagi mereka akibat dosa-dosa yang telah mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. وَكَذٰلِكَ نُوَلِّى بَعْضَ الظّٰلِمِينَ بَعْضًۢا (Dan demikianlah Kami jadikan sebahagian orang-orang yang zalim itu menjadi teman bagi sebahagian yang lain) Yakni Kami menjadikan jin-jin yang zalim menguasai manusia yang zalim dan menjadikan sebagaian orang zalim menguasai orang zalim lainnya agar mereka binasa dan terhina. Al-A’masy berkata: aku mendengar orang-orang berkata: jika zaman telah rusak maka orang-orang jahat akan dijadikan penguasa atas penghuni zaman tersebut. Dan Fudhail bin ‘Iyadh berkata: jika kamu melihat orang zalim bertengkar dengan orang zalim lainnya maka berhenti dan lihatlah mereka dengan penuh rasa heran. بِمَا كَانُوا۟ يَكْسِبُونَ (disebabkan apa yang mereka usahakan) Karena perbuatan dosa-dosa mereka maka Kami menjadikan sebagian mereka menguasai sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "129 Sebagaimana Kami jadikan manusia dan jin itu saling membantu dalam hal kemaksiatan, maka Kami limpahkan juga kegelapan para jin kepada kegelapan manusia, kegelapan satu saling menutupi kegelapan yang lain sehingga membinasakan mereka. Itu semua sebagai balasan bagi mereka disebabkan apa dosa, kekufuran dan maksiat yang mereka kerjakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami memalingkan sebagian orang-orang zalim kepada sebagian lainnya} Kami memberi kuasa sebagian orang-orang zalim atas sebagian lainnya {sebagai balasan atas apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129. “Dan demikianlah Kami jadikan sebagian orang-orang yang zhalim itu menjadi teman bagi sebagian yang lain disebabkan apa yang mereka usahakan.” Maksudnya, sebagaimana Kami jadikan jin yang Bengal sebagai wali dan berkuasa menyesatkan teman-temannya dari kalangan manusia, Kami hubungkan juga mereka dengan jalinan pertemanan dan kesesuaian disebabkan oleh usaha dan jerih payah mereka, maka termasuk Sunnah Kami adalah menjadikan orang zhalim yang lain yang mendorong dan menghasudnya kepada keburukan, menjauhkan dan menghindarkannya dari kebaikan. Hal itu termasuk hukuman Allah yang keras, yang buruk pengaruhnya, yang mendalam bahayanya, dan yang menanggung dosa adalah orang yang zhalim, dialah yang mengundang dan memetik mudarat bagi dirinya sendiri, dan Tuhanmu tidaklah menzhalimi hamba-hambaNya. Termasuk dalam hal ini adalah jika kezhaliman manusia, kerusakan dan penolakan manusia untuk menunaikan hak-hak yang wajib telah memuncak, maka Allah akan memunculkan orang zhalim yang menguasai mereka dan menimpakan azab yang buruk kepada mereka. Dia kan memerintah mereka dengan kezhaliman dan kesewenang-wenangan yang jauh lebih besar daripada hak-hak Allah dan hamba-hambaNya yang tidak mereka tunaikan dengan tidak diberi balasan dan pahala padanya, sebagaimana jika manusia baik dan lurus, maka Allah memperbaiki pemimpin mereka, menjadikan mereka sebagai pemimpin-pemimpin yang adil dan bukan pemimpin zhalim lagi lalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 129: Sebagaimana Allah jadikan pelaku maksiat dari kalangan jin dan manusia saling bersenang-senang dengan yang lain. Yang mendorongnya untuk tetap terus berbuat maksiat. Oleh karena itu, manusia apabila banyak melakukan kezaliman dan kerusakan dan tidak mengerjakan kewajiban, maka akan diangkat orang-orang zalim sebagai penguasa mereka, ia akan menimpakan kepada mereka siksaan yang buruk, menzalimi mereka akibat mereka tidak memenuhi hak Allah dan hak hamba-hamba Allah. Sebaliknya, jika manusia (baca: rakyat) baik dan istiqamah, maka Allah akan memperbaiki keadaan mereka, Allah angkat untuk mereka pemimpin-pemimpin yang adil; tidak zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 129",
    "description": "Jika pada ayat sebelumnya diinformasikan bahwa antara jin dan manusia terdapat hubungan saling memanfaatkan, maka pada ayat ini dijelaskan hubungan antara orang-orang yang berbuat zalim. Dan demikianlah kami jadikan sebagian orang-orang zalim berteman dengan sesamanya, karena seseorang akan mencari teman sesama yang sejiwa dan seirama dalam hidup, atau orang yang zalim akan dikuasai oleh pelaku kezaliman lainnya, sesuai dengan apa yang mereka kerjakan yaitu kekafiran dan kemaksiatan. Pada ayat ini kembali dibicarakan hubungan antara jin dan manusia. Pada hari kiamat nanti, sekelompok jin dan manusia yang kafir akan ditanya tentang masa lalu mereka di dunia dengan hardikan yang keras. Wahai golongan jin dan manusia! bukankah sudah datang kepadamu rasul-rasul dari kalanganmu sendiri, yaitu teman-temanmu yang mendapatkan pesan dari rasul manusia, mereka menyampaikan ayatayat-ku kepadamu dan memperingatkanmu tentang pertemuan pada hari ini' mereka menjawab dengan terus terang dan pengakuan yang tulus, ya, kami menjadi saksi atas diri kami sendiri bahwa rasul-rasul itu telah datang kepada kami dan menyampaikan peringatan-peringatan kepada kami. Akan tetapi, mereka tertipu oleh kehidupan dunia berupa harta benda, jabatan, dan hawa nafsu. Dan mereka telah menjadi saksi atas diri mereka sendiri bahwa mereka adalah orang-orang kafir."
  }
]