[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepunyaan Allah segala sesuatu yang ada di langit dan di bumi, yang diam maupun yang bergerak, yang tersembunyi maupun yang tampak. Semua adalah hamba dan makhlikNya, serta berada di bawah kekuasaan, kendali, dan pengaturanNya. Dan Dia maha mendengar seluruh ucapan para hambaNya lagi maha Mengetahui segala rahasia-rahasia dan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah adalah satu-satunya pemilik segala sesuatu, baik yang diam di malam hari maupun di siang hari. Dia lah Yang Maha Mendengar ucapan-ucapan mereka lagi Maha Mengetahui perbuatan-perbuatan mereka, dan akan memberikan balasan yang setimpal kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Allah adalah penguasa langit dan bumi dan segala yang ada di dalamnya. Milik-Nya segala yang diam atau bergerak di malam dan siang hari; segala sesuatu di bawah kehendak dan kuasa-Nya. Tidak ada satu makhlukpun yang keluar dari kekuasaan-Nya; Dia Maha Mendengar perkataan mereka dan Maha Mengetahui gerak-gerik mereka. Tiidak ada sesuatupun yang tersembunyi dari-Nya. Pada ayat sebelumnya: قل لمن ما في السماوات والأرض قل لله... Berhubungan dengan seluruh makhluk dari sisi tempat, sedangkan ayat ini berhubungan dengan seluruh makhluk dari sisi zaman. Dan Allah mendahulukan tempat karena lebih mudah dipahami oleh akal dari pada zaman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَلَهُۥ مَا سَكَنَ فِى الَّيْلِ وَالنَّهَارِ ۚ (Dan kepunyaan Allah-lah apa yang ada pada malam dan siang) Yakni segala sesuatu adalah milik Allah. Dan sebagian dari segala susuatu tersebut berdiam diri baik di malam hari maupun siang hari, yaitu benda-benda mati. Sabagian lainnya berdiam diri di malam hari, yaitu hewan-hewan kebanyakan, dan sebagain lainnya berdiam diri di siang hari, seperti beberapa burung, serangga, dan hewan buas. Dan pendapat lain mengatakan yang dimaksud adalah segala sesuatu yang tidak dapat bergerak baik di siang hari maupun malam hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Kerajaan Allah meliputi segala sesuatu yang diam maupun yang bergerak. Di ayat sebelumnya Allah menerangkan bahwa Dia merajai setiap sesuatu di seluruh tempat di langit dan bumi. Dan disini dijelaskan bahwa Dia merajai segala sesuatu di seluruh zaman. Sesuatu yang diam meliputi benda-benda mati, dan hewan-hewan yang tinggal di malam atau siang hari. Dan Allah itu Maha Mendengar seluruh perkataan, dan Maha Mengetahui setiap sesuatu yang disembunyikan jiwa. Ayat ini turun ketika orang-orang kafir Mekah menawarkan sebagian harta mereka kepada nabi SAW sehingga dia menjadi lelaki terkaya dan tidak melakukan dakwah lagi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "MilikNyalah segala sesuatu yang ada} sesuatu yang ada {pada malam dan siang hari. Dialah Yang Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ketahuilah bahwa surat ini mengandung penetapan tauhid dengan segala dalil aqli dan naqli bahkan hampir seluruhnya tentang tauhid yang membantah orang-orang musyrik yang mendustakan RasulNya. Dalam ayat-ayat ini Allah menjelaskan sesuatu yang dengannya petunjuk menjadi jelas dan syirik pun terbabat. 13. Allah menyebutkan bahwa “kepunyaan Allah-lah, “ segala yang ada pada malam dan siang hari.” Itu adalah seluruh makhluk, yang terdiri dari manusia, jin, malaikat, hewan, dan benda-benda mati. Semuanya adalah makhluk yang diatur, hamba yang tunduk kepada Tuhannya Yang Mahaagung, Maha Berkuasa dan Maha Memiliki. Apakah sah menurut dalil aqli dan naqli jika para hamba yang tidak memiliki manfaat dan mudarat disembah sementara keikhlasan kepada pencipta, pengatur, pemilik, yang memiliki manfaat dan mudarat ditinggalkan? Ataukah justru akal yang sehat dan fitrah yang lurus mengajak kepada pengikhlasan ibadah, kecintaan, takut, dan harapan kepada Allah Rabbul alamin? “Dia-lah Yang Maha Mendengar” semua suara dengan berbagai Bahasa dan bermacam-macam kepentingan. “Lagi Maha Mengetahui apa yang telah terjadi, apa yang sedang terjadi dana pa yang akan terjadi jika ia telah terjadi, maka bagaimanapun keadaannya pasti terjadi, Yang mengetahui lahir dan batin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 13: Beberapa ayat di atas dan setelahnya merupakan pengokohan tauhid dengan menyebutkan semua dalil, baik yang 'aqli (akal) maupun naqli (wahyu) sekaligus sebagai bantahan terhadap orang-orang musyrik. Yakni Dia Pengaturnya, Penciptanya dan Pemiliknya. Mencakup semua makhluk, baik manusia maupun jin, malaikat, makhluk hidup maupun benda mati. Semuanya adalah makhluk yang diatur, maka pantaskah secara akal makhluk-makhluk itu disembah, sedangkan yang menciptanya lagi yang memilikinya ditinggalkan? Semua suara dengan berbagai bahasa dan bermacam-macam kebutuhan. Terhadap yang telah terjadi dan akan terjadi serta yang tidak terjadi, Dia mengetahui yang nampak maupun yang tersembunyi. Dia Maha Mengetahui segalanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 13",
    "description": "Allah sebagai pemilik langit dan bumi menegaskan bahwa seluruh makhluk berada dalam pengaturan-Nya. Dan milik-Nyalah, segala apa yang ada pada malam dan siang hari, yang bergerak maupun yang diam, yang terlihat maupun yang tersembunyi karena dia yang menciptakan dan mengatur semuanya. Dan dialah yang maha mendengar ucapan hamba-hamba-Nya, dan maha mengetahui apa yang ada pada seluruh hambanya, baik yang dinyatakan secara terbuka maupun yang tersembunyi di dalam lubuk hati. Katakanlah, wahai rasulullah, kepada orang-orang yang menyekutukan Allah, apakah aku akan menjadikan sesuatu selain Allah sebagai pelindung dan penolong, padahal Allah yang menjadikan langit dan bumi untuk kepentingan manusia; dia yang memberi makan seluruh makhluk hidup dengan menjamin rezeki dan mengaturnya dengan merata, dan tidak diberi makan dengan segala bentuk sesajian karena Allah tidak membutuhkannya' katakanlah kepada mereka, wahai rasulullah, sesungguhnya aku diperintahkan oleh Allah agar aku menjadi orang yang pertama berserah diri kepada-Nya dengan rukuk dan sujud, serta dengan menyerahkan seluruh jiwa raga, hidup, dan mati kepada-Nya. Dan jangan sekali-kali kamu, wahai rasulullah bersama orang-orang beriman yang mengikutimu, termasuk golongan orang-orang musyrik, yang menyekutukan Allah, baik dengan perbuatan maupun ucapan, baik terbuka maupun tersembunyi."
  }
]