[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaum musyrikin dari kalangan jin dan manusia, belumkah datang kepada kalian rasul-rasul dari golongan kalian sendiri (dzohir nash ini menunjukan bahwa sesungguhnya rosul itu dari golongan manusia saja) yang memberitahukan kepada kalian ayat-ayatKu yang jelas lagi memuat penjelasan tentang perintah, larangan, kebaikan dan keburukan dan memperingatkan kalian terhadap pertemuan (kalian) dengan siksaKu pada hari kiamat? kaum musyrikin dari golongan manusia dan jin menjawab “kami bersaksi terhadap diri kami bahwa rasul-rasulMu telah menyampaikan ayat-ayatMu kepada kami dan memperingatkan kami terhadap pertemuan kami pada hari ini, namun kemudian kami mendustakan mereka.” Dan telah memperdayai kaum musyrikin itu Gemerlap kehidupan dunia. Mereka menjadi saksi bagi diri mereka sendiri bahwa mereka adalah orang-orang yang mengingkari keesaan Allah dan mendustakan rasul-rasulNya ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "130. Kami akan berfirman pada hari Kiamat, “Wahai sekalian jin dan manusia! Bukankah telah datang kepada kalian rasul-rasul dari bangsa kalian -yakni dari bangsa manusia- yang membacakan kepada kalian wahyu yang Allah turunkan kepada mereka, dan memperingatkan mereka akan adanya perjumpaan (dengan Allah) di hari Kiamat ini?” Mereka menjawab, “Ya, benar. Hari ini kami mengakui bahwa rasul-rasul-Mu telah datang kepada kami. Dan kami juga mengakui adanya perjumpaan (dengan-Mu) di hari ini. Akan tetapi kami dahulu tidak percaya kepada rasul-rasul-Mu dan tidak percaya akan adanya perjumpaan (dengan-Mu) di hari ini.” Mereka tertipu oleh kemegahan dan kenikmatan semu yang ada di dalam kehidupan dunia. Dan mereka mengakui bahwa selama di dunia mereka ingkar kepada Allah dan rasul-rasul-Nya. Namun pengakuan dan keimanan itu tidak ada gunanya bagi mereka, karena sudah terlambat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "130. Allah memperingatkan orang-orang kafir dari golongan jin dan manusia dari azab hari kiamat: \"Bukankah telah datang kepada kalian para rasul dari golongan manusia dan para da'i dari golongan jin yang membacakan ayat-ayat-Ku dan memperingatkan kalian dari azab pada hari pembalasan?\" Mereka menjawab dengan penuh pengakuan: \"Benar, kami mengakui bahwa para rasul telah menyampaikan risalah-Mu kepada kami.\" Namun gemerlap dan syahwat dunia telah menipu mereka, dan mereka mengakui telah mendustakan para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "130. يٰمَعْشَرَ الْجِنِّ وَالْإِنسِ (Hai golongan jin dan manusia) Yakni dihari ketika Kami mengumpulkan mereka: apakah belum datang kepadamu rasul-rasul dari golongan kamu sendiri? أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنكُمْ (apakah belum datang kepadamu rasul-rasul dari golongan kamu sendiri) Yakni dari golongan manusia yang membacakan kitab Allah kepada manusia dan jin. يَقُصُّونَ عَلَيْكُمْ ءَايٰتِى (yang menyampaikan kepadamu ayat-ayat-Ku) Yakni membacakan kepada mereka ayat-ayat tersebut. قَالُوا۟ شَهِدْنَا عَلَىٰٓ أَنفُسِنَا ۖ (Mereka berkata: “Kami menjadi saksi atas diri kami sendiri”) Ini merupakan pengakuan mereka bahwa hujjah Allah telah ditegakkan atas mereka dengan pengutusan para Rasul kepada mereka. وَغَرَّتْهُمُ الْحَيَوٰةُ الدُّنْيَا (kehidupan dunia telah menipu mereka) Sehingga membelokkan mereka dari keimanan kepada para Rasul; melalaikan mereka dengan perhiasan dunia sehingga hati mereka condong terhadapnya, dan hal itu mendorong mereka untuk mendustakan para Rasul. وَشَهِدُوا۟ عَلَىٰٓ أَنفُسِهِمْ (dan mereka menjadi saksi atas diri mereka sendiri) Yakni kesaksian lainnya atas diri mereka bahwa mereka adalah orang-orang yang kafir di dunia terhadap para Rasul yang diutus kepada mereka serta terhadap ayat-ayat yang mereka datangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "130 Pada hari Mahsyar kelak Allah akan berfirman: Hai golongan jin dan manusia, apakah belum datang kepadamu rasul-rasul dari golongan kamu sendiri yang mengajak kalian kepada keimanan, sebab semua rasul dari bani Adam menyampaikan ayat-Ku untuk kalian dan memberi peringatan kepadamu atas datangnya azab hari kiamat?” Mereka berkata: “Kami menjadi saksi atas diri kami sendiri bahwa para rasul telah datang dan menyampaikan risalah kepada kami, memberi peringatan kepada kami. Hari ini adalah hari yang tidak ada kergauan sama sekali”, namun kehidupan dunia dengan berbagai hiasan dan syahwatnya telah menipu mereka, sehingga mereka menyimpang dari iman dan para rasul juga membuat mereka lupa atas hari perhitungan dan pembalasan. Mereka menjadi saksi atas diri mereka sendiri, bahwa mereka adalah orang-orang yang kafir kepada Allah di dunia, juga kafir kepada para rasul, kitab dan ayat-ayat-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai golongan jin dan manusia, tidakkah sudah datang kepada kalian rasul-rasul dari golongan kalian yang menceritakan} membacakan {kepada kalian ayat-ayatKu dan memperingatkan kalian} memperingatkan kalian {tentang pertemuan pada hari ini. Mereka menjawab, “kami menjadi saksi} kami berikrar {atas diri kami” Tapi mereka tertipu} tertipu {oleh kehidupan dunia. Mereka telah menjadi saksi} berikrar {atas diri mereka bahwa mereka adalah orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "130. Kemudian Allah mencela semua orang yang berpaling dari kebenaran dan menolaknya, baik yang berasal dari kalangan jin dan manusia. Dia menjelaskan kesalahan mereka, maka mereka mengakui itu. Dia berfirman, “Hai golongan jin dan manusia, apakah belum datang kepadamu rasul-rasul dari golongan kamu sendiri, yang menyampaikan kepadamu ayat-ayatKu” yang jelas dan terang yang terdapat padanya perincian perintah, larangan, kebaikan, keburukan, janji pahala, dan ancaman siksa, “dan memberi peringatan kepadamu terhadap pertemuanmu dengan hari ini?” Dan mengajarkan kepadamu bahwa keselamatan dan keberuntungan hanya didapat dengan menaati perintah-perintah Allah dan menjauhi larangan-laranganNya, dan bahwa kesengsaraan dan kerugian terletak pada penyia-nyiaan semua itu? Maka mereka mengakui itu. Mereka berkata, “Benar, ‘Kami menjadi saksi atas diri kami sendiri’, namun kehidupan dunia telah menipu mereka,” dengan perhiasan, keindahan dan kenikmatannya, maka mereka condong kepadanya dan menerimanya, dan itu melalaikan mereka dari Akhirat. “Dan mereka menjadi saksi atas diri mereka sendiri, bahwa mereka adalah orang-orang yang kafir.” Maka hujjah Allah pun tegak atas mereka, dan pada saat itu, semua orang mengetahui bahkan diri mereka sendiri mengetahui keadilan Allah pada mereka. (Maka Allah menyatakan hukumNya atas mereka dengan azab yang pedih, “Masuklah kamu ke dalam deretan umat-umat yang telah berlalu sebelummu dari kalangan jin dan manusia di mana mereka melakukan seperti yang kamu lakukan. Mereka bersenang-senang dengan kekayaan mereka seperti kamu pun bersenang-senang. Mereka terjun ke dalam kebatilan sepertimu. Mereka adalah orang-orang yang merugi, yakni orang-orang yang terdahulu dan yang terakhir dari mereka. Adakah kerugian yang lebih besar daripada kerugian surga kenikmatan dan lenyapnya perlindungan dari Allah Yang Maha Pemurah?)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 130: Pada hari kiamat, Allah mencela mereka (baik dari golongan jin maupun manusia) yang berpaling dari kebenaran dan menolaknya, menerangkan kesalahan mereka, sehingga mereka mengakuinya. Yang menerangkan bahwa keberuntungan terletak dalam menjalankan perintah Allah dan menjauhi larangan-Nya, dan bahwa kerugian terletak jika melakukan sebaliknya. Oleh keindahannya, kenikmatannya, merasa tentram dan ridha dengannya, yang membuat mereka tidak beriman dan tidak beramal saleh. Sehingga tegaklah hujjah Allah terhadap mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 130",
    "description": "Pada ayat ini kembali dibicarakan hubungan antara jin dan manusia. Pada hari kiamat nanti, sekelompok jin dan manusia yang kafir akan ditanya tentang masa lalu mereka di dunia dengan hardikan yang keras. Wahai golongan jin dan manusia! bukankah sudah datang kepadamu rasul-rasul dari kalanganmu sendiri, yaitu teman-temanmu yang mendapatkan pesan dari rasul manusia, mereka menyampaikan ayatayat-ku kepadamu dan memperingatkanmu tentang pertemuan pada hari ini' mereka menjawab dengan terus terang dan pengakuan yang tulus, ya, kami menjadi saksi atas diri kami sendiri bahwa rasul-rasul itu telah datang kepada kami dan menyampaikan peringatan-peringatan kepada kami. Akan tetapi, mereka tertipu oleh kehidupan dunia berupa harta benda, jabatan, dan hawa nafsu. Dan mereka telah menjadi saksi atas diri mereka sendiri bahwa mereka adalah orang-orang kafir. Setelah menghardik jin dan manusia tentang sikap mereka terhadap rasul yang diutus kepada mereka, ayat ini menjelaskan hikmah diutusnya rasul. Demikianlah, para rasul diutus karena tuhanmu tidak akan membinasakan penduduk suatu negeri secara zalim, sedang penduduknya dalam keadaan lengah atau belum tahu. Allah terlebih dahulu mengutus rasul yang mengingatkan kepada mereka, tetapi mereka tetap membangkang. Inilah hakikat keadilan."
  }
]