[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami telah mengemukakan hujjah-hujjah kepada dua jenis makhluk (manusia dan jin) dengan mengutus para rasul dan menurunkan kitab-kitab, agar tidak ada seorangpun yang di siksa akibat perbuatan zhalimnya, sedang dakwah belum sampai kepadanya. Akan tetapi, kami telah menerangkan hujjah-hujjah kepada umat-umat manusia, dan tidaklah kami menyiksa seorangpun kecuali setelah mengutus para rasul kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Alasan-alasan yang diwujudkan dalam bentuk mengutus para rasul kepada manusia dan jin itu dimaksudkan supaya tidak ada seorang pun yang dihukum atas perbuatannya sementara belum ada rasul yang diutus kepadanya dan belum ada dakwah yang sampai kepadanya. Karena Kami tidak akan menjatuhkan hukuman kepada umat mana pun kecuali Kami telah mengutus para rasul kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "131. Pengutusan para rasul tersebut agar tidak ada seorangpun yang tidak sampai padanya seruan Allah dan agar suatu negeri tidak dihancurkan tanpa adanya peringatan sebelumnya dengan rasul-rasul, ayat-ayat, dan nasehat-nasehat. Syekh asy-Syinqity berkata, firman Allah: ذلك إن لم يكن ربك مهلك القرى بظلم وأهلها غافلون Penafian dalam ayat ini berhubungan dengan jumlah hadiah. Yakni Allah tidak akan membinasakan suatu kaum tanpa diperingatkan terlebih dahulu kau bahkan tidak membinasakan satu orang kecuali setelah orang itu mendapat peringatan dari lisan para rasul. Hal ini sebagaimana dijelaskan dalam firman Allah yang lain: وما كنا معذبين حتى نبعث رسولا dan Kami tidak akan mengazab sebelum Kami mengutus seorang rasul. Dan firman Allah: رسلا مبشرين ومنذرين لئلا يكون للناس حجة بعد الرسل Rasul-rasul itu adalah sebagai pembawa berita gembira dan pemberi peringatan, agar tidak ada alasan bagi manusia untuk membantah Allah setelah rasul-rasul itu diutus. Dan firman Allah: وإن من أمة إلا خلا فيها نذير Dan tidak ada suatu umatpun melainkan telah ada padanya seorang pemberi peringatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "131. ذٰلِكَ أَن لَّمْ يَكُن رَّبُّكَ مُهْلِكَ الْقُرَىٰ بِظُلْمٍ (Yang demikian itu adalah karena Tuhanmu tidaklah membinasakan kota-kota secara aniaya) Allah tidak pernah membinasakan penduduk suatu negeri karena kezaliman-Nya, karena Dia Maha Tinggi dari perbuatan zalim, akan tetapi Dia membinasakan mereka setelah mereka berhak mendapat azab tersebut, dan setelah kelalaian telah diangkat dari mereka dengan pengutusan para Rasul yang membawa kabar gembira dan memberi peringatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "131 Pengutusan para rasul dan penurunan kitab itu adalah karena Tuhanmu tidak membinasakan penduduk negeri dan kota-kota itu secara aniaya, sedang penduduknya dalam keadaan lengah. Maksudnya bahwa Allah tidak mengutus seorang rasul untuk memberi penjelasan kepada mereka, sehingga kelengahan mereka dengan pengutusan para nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu karena Tuhan kalian tidak membinasakan suatu negeri karena kezaliman, sedangkan penduduknya dalam keadaan belum tahu"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 131: Maksudnya penduduk suatu negeri tidak akan diazab, sebelum diutus seorang Rasul yang akan memberi peringatan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 131",
    "description": "Setelah menghardik jin dan manusia tentang sikap mereka terhadap rasul yang diutus kepada mereka, ayat ini menjelaskan hikmah diutusnya rasul. Demikianlah, para rasul diutus karena tuhanmu tidak akan membinasakan penduduk suatu negeri secara zalim, sedang penduduknya dalam keadaan lengah atau belum tahu. Allah terlebih dahulu mengutus rasul yang mengingatkan kepada mereka, tetapi mereka tetap membangkang. Inilah hakikat keadilan. Dan masing-masing orang ada yang beramal untuk ketaatan dan ada pula yang senantiasa bermaksiat kepada Allah, mereka akan memperoleh balasan sesuai dengan tingkatannya, yaitu sesuai dengan apa yang mereka kerjakan. Dan tuhanmu, wahai nabi Muhammad tidak lengah terhadap apa yang mereka, yakni hamba-hamba-Nya, kerjakan."
  }
]