[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), “wahai kaumku, berbuatlah sesuka hati kalian, sesungguhnya aku akan berbuat sesuai dengan ajaranku yang telah di syariatkan kepadaku oleh tuhanku . Kelak kalian akan mengetahui, (ketika siksaan menimpa kalian) siapakah (diantara kita) yang akan memperoleh akibat yang baik?. Sesungguhnya tiidak akan menggapai ridha Allah dan surgaNya orang yang berbuat melampaui batas dan melakukan tindakan aniaya dengan menyekutukan Allah dengan sesembahan yang lain.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "135. Katakanlah -wahai Rasul-, “Wahai kaumku! Tetaplah kalian dengan perilaku kalian dan pertahankanlah kekafiran serta kesesatan kalian. Karena aku telah membantah alasan kalian dan menegakkan dalil yang menjelaskan kesalahan kalian dengan sejelas-jelasnya. Maka aku tidak peduli dengan kekafiran dan kesesatan kalian. Aku akan mempertahankan kebenaran yang aku yakini. Maka kalian akan tahu siapa yang akan mendapat kemenangan di dunia, siapa yang akan mewarisi bumi, dan siapa yang akan mendapatkan kebahagiaan hidup di Akhirat. Sesungguhnya orang-orang musyrik tidak akan mendapatkan kemenangan di dunia maupun di Akhirat. Bahkan nasib mereka akan berakhir dengan kerugian, walaupun mereka bisa menikmati kesenangan yang mereka sukai di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "135. Hai Nabi, katakanlah kepada orang-orang kafir Quraisy untuk memberi ancaman kepada mereka: hai kaumku, tetaplah diatas kekafiran karena aku juga akan tetap menjalankan dakwah ku sebagaimana aku diperintahkan oleh Tuhanku; dan kebebalan kalian di atas kekafiran tidak akan mendatangkan mudharat kepadaku. Ketika siksaan telah turun kepada kalian, kalian akan mengetahui bagi siapa kesudahan yang baik di akhirat nanti, Apakah bagi kami atau kalian? Orang-orang yang zalim dengan penderitaan dan kesulitan mereka tidak akan mendapat keberuntungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "135. قُلْ يٰقَوْمِ اعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ (Katakanlah: “Hai kaumku, berbuatlah sepenuh kemampuanmu) Yakni tetaplah pada keadaan kalian ini, karena aku tidak peduli lagi kepada kalian dan tidak bersedih atas kekafiran kalian, dan aku akan tetap pada apa yang aku lakukan sekarang. فَسَوْفَ تَعْلَمُونَ مَن تَكُونُ لَهُۥ عٰقِبَةُ الدَّارِ ۗ (Kelak kamu akan mengetahui, siapakah (di antara kita) yang akan memperoleh hasil yang baik di dunia ini) Yakni kemenangan di kehidupan dunia dan mewarisi bumi ini serta yang mendapatkan kehidupan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "135 Katakanlah wahai Nabi: “Hai kaumku, berbuatlah sepenuh kemampuanmu dalam jalan yang telah kalian pilih baik dalam jalan kebenaran atau kekafiran, juga dalam segala yang mungkin dapat kalian lakukan. Karena sesungguhnya aku tidak ada urusan dengan kalian, dan akupun juga berbuat sesuai jalan dakwah dan agama Islamku. Kelak kalian akan mengetahui, siapakah di antara kita yang akan memperoleh hasil yang baik kelak di akhirat, dan hasil yang baik di dunia berupa pertolongan dan hasil bumi beserta segala yang baik dari alam. Sesungguhnya orang-orang yang zalim itu tidak akan mendapatkan keberuntungan sebab ingkar mereka kepada Allah dan anugerah nikmat-Nya, dan mereka telah mempersekutukan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Wahai kaumku, berbuatlah sesuai kedudukan kalian} sesuai posisi kalian {aku pun berbuat (demikian). Kelak kalian akan mengetahui siapa saja yang akan memperoleh balasan di akhirat} harta yang baik di dunia dan akhirat {Sesungguhnya orang-orang yang zalim tidak akan beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "135. “Katakanlah,” wahai Rasul kepada kaummu jika kamu mengajak mereka kepada Allah, jelaskanlah tempat kembali mereka kepada mereka dan hak-hakNya yang wajib atas mereka lalu mereka menolak tunduk kepada perintahNya, mengikuti hawa nafsu mereka dan terus berjalan di atas kesyirikan, “Hai kaumku, berbuatlah sepenuh kemampuanmu pada tempat berpijakmu.” Maksudnya berbuatlah pada tempat berpijakmu di mana kamu berada di atasnya dan kamu merelakannya untuk dirimu. “Sesungguhnya aku pun berbuat (pula),” dengan berpedoman pada perintah dari Allah dan mengikuti ridha Allah. “Kelak kamu akan mengetahui, siapakah (di antara kita) yang akan memperoleh hasil yang baik dari dunia ini.” Akau atau kamu. Ini termasuk obyektifitas dengan nilai tinggi di mana Dia menjelaskan amal perbuatan dan pelakunya, menjadikan balasan terkait dengan pandangan orang yang mengetahui, memaparkannya dengan terbuka dan jelas sehingga tidak memerlukan isyarat. Telah diketahui bahwa akibat yang baik di dunia dan akhirat adalah milik orang-orang yang bertakwa, bahwa orang-orang Mukmin adalah pemilik hasil yang baik dari dunia ini, dan bahwa setiap orang yang berpaling dari sesuatu yang dibawa oleh para Rasul, akibatnya adalah akibat buruk. Oleh karena itu Allah berfirman, “Sesungguhnya orang-orang yang zhalim itu tidak akan mendapatkan keberuntungan.” Semua orang yang zhalim walaupun dia menikmati dunia dengan kenikmatannya, tetap saja akhirnya adalah ketiadaan dan kebinasaan. Sesungguhnya Allah mendikte orang zhalim sehingga manakala Dia mengambilnya, maka dia tidak akan lolos."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 135: Yakni katakanlah wahai Rasul kepada kaummu, ketika kamu mengajak mereka kepada Allah, menerangkan hak dan kewajiban mereka, lalu mereka tidak mau mengikutimu. Yakni keadaan yang kamu pilih dan kamu ridhai untuk dirimu. Tetap di atas pendirianku, yaitu mengikuti perintah Allah dan mencari keridhaan-Nya. Saya atau kamu, dan sudah maklum bahwa kesudahan yang baik di dunia dan di akhirat diperoleh oleh orang-orang yang bertakwa, dan bahwa orang-orang yang berpaling dari apa yang dibawa rasul akan memperoleh kesudahan yang buruk. Maksudnya orang-orang kafir. Oleh karena itu, setiap orang yang zalim meskipun ia merasakan kenikmatan di dunia, namun akhirnya adalah kebinasaan. Rasulullah shallallahu 'alaihi wa sallam bersabda: إِنَّ اللهَ تَعَالَى لَيُمْلِي لِلظَّالِمِ حَتىَّ إِذَا أَخَذَهُ لَمْ يُفْلِتْهُ “Sesungguhnya Allah memberi tangguh orang zalim, sehingga ketika tiba (waktu) Allah menghukumnya, maka Allah tidak akan meloloskannya.” (HR. Bukhari, Muslim, Tirmizi dan Ibnu Majah, Shahihul Jaami’ no. 1822)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 135",
    "description": "Katakanlah kepada kaummu, wahai nabi Muhammad sebagai ancaman kepada mereka, wahai kaumku! jika kalian menganggap bahwa kalian berada di atas petunjuk maka berbuatlah menurut kedudukanmu, dan tetaplah berada di atas jalan kalian yang penuh kekufuran dan kesyirikan itu. Aku pun berbuat demikian, yaitu berada di atas jalanku yang penuh dengan bimbingan Allah. Kelak kamu akan mengetahui siapa yang akan memperoleh tempat terbaik di akhirat nanti, apakah kalian yang senantiasa berbuat kekufuran ataukah aku dan kaumku yang beriman dan tunduk kepada ajaran Allah. Sesungguhnya orang-orang yang zalim itu, yang senantiasa berbuat kesyirikan kepada Allah, tidak akan beruntung. Jika pada ayat-ayat yang lalu diterangkan berbagai kesesatan kaum musyrik dan para pengikut mereka yang memberikan alasan-alasan tentang kepercayaan yang mereka anut, padahal tidak berdasarkan kebenaran dan tidak dapat diterima oleh akal sehat. Maka pada ayat berikut ini diterangkan sebagian dari cara-cara mereka dalam mendekatkan diri kepada Allah melalui berhala-berhala yang mereka anggap sebagai sekutu-Nya. Dan mereka menyediakan dan membagi apa yang mereka dapat dari hasil tanaman dan hewan ternak kepada dua bagian. Sebagian hasil tanaman dan hewan mereka persembahkan untuk Allah, yakni digunakan untuk memberi makan tamu-tamu, anak-anak, dan orang-orang miskin. Sementara bagian yang kedua diperuntukkan untuk berhala-berhala mereka sehingga dikuasai sepenuhnya untuk para penjaga dan pemelihara berhala tersebut. Mereka melakukan ini sambil berkata menurut persangkaan mereka, ini untuk Allah. Silakan dipergunakan untuk para fakir miskin, namun jika kami butuh, kami berhak menggunakannya untuk berhala kami juga. Dan bagian yang ini khusus untuk berhalaberhala kami. Tidak boleh seorang pun menyentuhnya kecuali para penjaga dan pemelihara, karena ini sebagai bentuk peribadatan kami kepada mereka. Bagian yang untuk berhala-berhala mereka tidak akan sampai kepada Allah, dan bagian yang untuk Allah akan sampai kepada berhala-berhala mereka. Sangat buruk ketetapan mereka itu."
  }
]