[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kaum musyrikin menjadikan bagi Allah satu bagian dari apa yang diciptakanNya berupa tanaman, buah-buahan dan hewan ternak dengan menghidangkannya bagi para tamu dan orang-orang miskin, dan juga memperuntukan bagian yang lain dari barang-barang tersebut bagi sekutu-sekutu mereka dari berhala-berhala dan patung-patung. Persembahan yang mereka khususkan bagi sesmbahan-sesembahan mereka hanya akan sampai kepada sesembahan-sesembahan tersebut saja, tidak sampai kepada Allah , dana pa yang dikhususkan untuk Allah sesungguhnya ia sampai kepada sesembahan-sesembahan mereka. Alangkah buruk ketetapan dan pembagian mereka tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Orang-orang yang menyekutukan Allah mempersembahkan kepada Allah satu bagian dari apa yang Dia ciptakan dari tanam-tanaman dan binatang ternak, lalu mereka mengaku bahwa bagian itu adalah milik Allah. Dan mereka mempersembahkan satu bagian lain kepada berhala-berhala mereka. Lalu (mereka mengaku bahwa) bagian yang mereka peruntukan bagi berhala-berhala mereka tidak akan sampai kepada orang-orang yang ditetapkan oleh Allah sebagai penerima zakat, seperti orang-orang fakir dan orang-orang miskin. Tetapi bagian yang mereka peruntukan bagi Allah akan sampai kepada berhala-berhala mereka dan akan dipergunakan untuk kepentingan berhala-berhala itu. Sungguh buruk keputusan dan pembagian yang mereka buat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Allah mengabarkan tentang dosa-dosa orang kafir akibat mengharamkan apa yang dihalalkan oleh Allah: mereka menyisihkan sebagian buah-buahan dan hewan ternak untuk mereka infakkan di jalan Allah dengan membagikannya kepada orang-orang fakir dan miskin; dan mereka juga menyisihkan sebagian lain bagi berhala-berhala mereka untuk mereka berikan kepada para penjaga dan pelayan berhala-berhala tersebut dan sebagai sesajen baginya. Bagian yang diberikan untuk berhala-berhala tidak mereka berikan untuk hal-hal yang disyariatkan Allah; sedangkan bagian yang diberikan untuk Allah, mereka berikan untuk berhala-berhala mereka. Betapa buruk ketetapan dan pembagian ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. وَجَعَلُوا۟ لِلّٰهِ مِمَّا ذَرَأَ مِنَ الْحَرْثِ وَالْأَنْعٰمِ نَصِيبًا (Dan mereka memperuntukkan bagi Allah satu bagian dari tanaman dan ternak yang telah diciptakan Allah) Kalimat ini ditujukan bagi orang-orang kafir dari bangsa Arab. Yakni mereka memberikan Allah bagian dari penciptaan-Nya berupa tanaman dan buah-buahan serta hasil dari hewan ternak mereka; dan mereka juga memberi bagian bagi sesembahan-sesembahan mereka dari hal-hal tersebut, yang mereka bagikan kepada penjaga dan pelayan sesembahan-sesembahan tersebut. Dan apabila telah habis bagian bagi sesembahan-sesembahan mereka dengan membagikannya kepada orang-orang tersebut maka mereka menggantinya dengan bagian yang disisihkan untuk Allah dengan mengatakan “Allah tidak butuh terhadap barang-barang ini”. فَمَا كَانَ لِشُرَكَآئِهِمْ فَلَا يَصِلُ إِلَى اللهِ ۖ (Maka saji-sajian yang diperuntukkan bagi berhala-berhala mereka tidak sampai kepada Allah) Yakni tidak sampai kepada golongan orang-orang yang telah ditetapkan Allah untuk diberi bagian kepada mereka, seperti untuk sedekah, silaturrahim, dan menjamu tamu. وَمَا كَانَ لِلّٰهِ فَهُوَ يَصِلُ إِلَىٰ شُرَكَآئِهِمْ ۗ (dan saji-sajian yang diperuntukkan bagi Allah, maka sajian itu sampai kepada berhala-berhala mereka) Yakni menjadikannya untuk sesembahan-sesembahan mereka dan mengeluarkan harta itu untuk kemaslahatannya. سَآءَ مَا يَحْكُمُونَ (Amat buruklah ketetapan mereka itu) Yakni dalam pilihan mereka yang lebih memihak kepada sesembahan-sesembahan mereka dibandingkan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "136 Mereka para kafir Makkah, pada zaman Jahiliyyah memperuntukkan persembahan untuk Allah, yang diberikan kepada tamu mereka beserta fakir miskin berupa hasil perkebunan, buah-buahan dan binatang ternak (unta, sapi dan kambing) yang telah diciptakan Allah. Lalu mereka berkata sesuai dengan persangkaan mereka: “Ini untuk Allah dan hewan ternak ini untuk sekutu Allah yaitu berhala-berhala kami”. Maka saji-sajian yang diperuntukkan bagi berhala-berhala mereka tidak sampai kepada Allah seperti silaturrahim, menjamu tamu dan sedekah kepada fakir miskin bahkan sembelihan mereka yang mereka berikan kepada kerabat. Dan saji-sajian yang mereka peruntukkan bagi Allah, maka sajian itu mereka jadikan untuk berhala-berhala mereka, bukan untuk fakir miskin. Mereka berkata: sesungguhnya Allah itu Maha Kaya, sungguh buruk dan jelek apa yang telah mereka sandarkan kepada sesembahan mereka yang tidak bisa berbuat apa-apa, Allah Maha Kuasa untuk menciptakan segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyediakan untuk Allah dari sesuatu yang Dia ciptakan} ciptakan {yaitu hasil tanaman} tanaman {dan hewan ternak suatu bagian untuk} suatu bagian {sambil berkata dengan sangkaan mereka “Ini untuk Allah dan yang ini untuk berhala-berhala kami” Bagian yang untuk berhala-berhala mereka tidak akan sampai kepada Allah, dan bagian yang untuk Allah akan sampai pada berhala-berhala mereka. Sangat buruk} sangat buruk {apa yang mereka tetapkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136. Allah menyampaikan kebodohan akal, kerancuan pemikiran dan kebodohan yang mendalam yang dimiliki oleh orang-orang musyrik yang mendustakan Nabi. Allah membongkar sedikit khurafat mereka untuk memperingatkan kesesatan mereka, dan agar diwaspadai, dan bahwa penetangan dari orang-orang yang semisal mereka terhadap kebenaran yang dibawa oleh rasul sama sekali tidak menodainya, karena mereka tidak layak untuk menghadapi kebenaran. Allah menjelaskan sebagian dari itu, bahwa mereka “memperturutkan bagi Allah satu bagian dari tanaman dan ternak yang telah diciptakan Allah.” Sementara sesembahan mereka juga mendapatkan satu bagian, padahal yang sebenarnya Allah yang menciptakan dan mengadakan rizki untuk hambaNya, maka mereka menggagbungkan antara dua perkara dosa yang dikhawatirkan bahkan tiga: Pertama, jasa mereka kepada Allah dengan memberikan memberikan bagian untukNya meskipun mereka meyakini bahwa itu adalah sukarela dari mereka. Kedua, menyamakan sesembahan itu dengan Allah padahal sesmbahan itu tidak memberi mereka rizki dan tidak menciptakan sedikitpun darinya. Ketiga, keputusan mereka yang tidak adil bahwa mereka tidak mempedulikan dan tidak memperhatikan sesuatu yang diberikan kepada Allah walaupun ia sampai kepada sesembahan-sesembahan mereka. Sebaliknya yang diberikan kepada sesembahan-sesembahan, maka mereka menjaga dan memperhatikannya, dan tidak sedikitpun yang sampai kepada Allah darinya. Hal itu jika mereka mendapatkan rizki dari tanaman, buah-buahan, dan ternak mereka, maka mereka membaginya menjadi dua bagian. Satu bagian mereka katakan, “Ini untuk Allah,” menurut klaim mereka, karena jika tidak, maka Allah tidak menerima kecuali apa yang diikhlaskan demi wajahNya. Dia tidak menerima amal orang yang menyekutukanNya, sedangkan bagian lain mereka menjadikannya sebagai bagian untuk sesembahan-sesembahan mereka dalam bentuk berhala dan tandingan-tandingan. Mereka tidak memperdulikan jika sesuatu yang mereka peruntukan untuk Allah sampai dan bercampur dengan sesuatu yang mereka peruntukan selainNya. Mereka berkata, “Allah tidak membutuhkannya.” Maka mereka tidak mengembalikannya kepada Allah. Sebaliknya jika sesuatu yang mereka peruntukan bagi sesembahan-sesembahan bercampur dengan sesuatu yang meereka peruntukan bagi Allah, maka mereka memisahkannya, maka mereka berkata, “Ia miskin, bagiannya harus dikembalikan.” Adakah hukum yang lebih zhalim dan lebih buruk daripada ini, di mana mereka bersungguh-sungguh, menjaga dan mengiklaskan diri untuk sesuatu yang di berikan kepada makhluk sementara sebaliknya pada hak Allah? Ayat yang mulia ini bisa pula di tafsirkan dengan hadist yang ada dalam ash-shahih dari Nabi bahwa Nabi bersabda, “Allah berfirman, ‘Aku adalah sekutu (maksudnya dalam anggapan mereka) yang tidak membutuhkan sekutu. Barangsiapa menyekutukanKu dengan sesuatu, maka aku meninggalkannya dengan sekutunya’.” Jadi makna ayat ini adalah, bahwa sesuatu yang mereka peruntukan dan persembahkan untuk berhala-berhala adalah ibadah yang murni kepada selain Allah. Allah tidak mendapatkan sedikitpun darinya. Apa yang menurut mereka diperuntukan bagi Allah, maka ia tetap tidak sampai kepadaNya karena itu adalah kesyirikan ia adalah bagian dari sesembahan dan tandingan-tandingan itu, karena Allah tidak memerlukannya, dan Dia tidak menerima amal yang padanya terdapat unsur syirik dengan salah satu makhluknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 136: Allah Subhaanahu wa Ta'aala memberitakan keadaan kaum musyrik yang mendustakan Nabi shallallahu 'alaihi wa sallam, yang menunjukkan akal mereka yang kurang dan kebodohan mereka yang begitu dalam, serta menyebutkan sedikit khurafat mereka untuk mengingatkan kesesatan mereka, berhati-hati terhadap mereka, dan bahwa perlawanan mereka terhadap kebenaran yang dibawa rasul tidaklah mencacatkan sama sekali, karena mereka tidak layak membantah kebenaran. Menurut riwayat bahwa hasil tanaman dan binatang ternak yang mereka peruntukkan bagi Allah, mereka pergunakan untuk memberi makanan orang-orang fakir, orang-orang miskin, dan berbagai amal sosial, dan yang diperuntukkan bagi berhala-berhala diberikan kepada penjaga berhala itu. Apa yang disediakan untuk berhala-berhala tidak dapat diberikan kepada fakir miskin dan amal sosial, sedangkan sebagian yang disediakan untuk Allah (fakir miskin dan amal sosial) dapat diberikan kepada berhala-berhala itu. Perhatian dan penghormatan mereka begitu dalam kepada berhala, sampai-sampai apa yang diperuntukkan untuk berhala tidak diberikan kepada untuk fakir miskin dan untuk amal sosial, sedangkan apa yang diperuntukkan bagi Allah, mereka kurang peduli. Adat seperti ini dikutuk oleh Allah. Maksud ayat ini bisa juga seperti yang disebutkan dalam hadits berikut, bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: « قَالَ اللَّهُ تَبَارَكَ وَتَعَالَى أَنَا أَغْنَى الشُّرَكَاءِ عَنِ الشِّرْكِ مَنْ عَمِلَ عَمَلاً أَشْرَكَ فِيهِ مَعِى غَيْرِى تَرَكْتُهُ وَشِرْكَهُ » . Allah Tabaaraka wa Ta'aala berfirman, “Aku paling tidak butuh kepada sekutu. Barang siapa beramal suatu amalan yang di sana ia menyekutukan sesuatu dengan-Ku, maka Aku akan tinggalkan Dia dan syirknya.” (HR. Muslim) Sehingga maksud ayat di atas adalah, bahwa apa yang mereka peruntukkan kepada sesembahan selain Allah merupakan taqarrub (pendekatan) murni untuk selain Allah; tidak ada sedikit pun untuk Allah di sana. Demikian pula apa yang mereka peruntukkan untuk Allah –menurut persangkaan mereka- maka tidak akan sampai kepada-Nya karena hal tersebut mengandung syirk, bahkan ditujukan murni kepada sekutu dan tandingan tersebut. Allah Mahakaya, tidak menerima amal yang diikutsertakan yang lain di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 136",
    "description": "Dan mereka menyediakan dan membagi apa yang mereka dapat dari hasil tanaman dan hewan ternak kepada dua bagian. Sebagian hasil tanaman dan hewan mereka persembahkan untuk Allah, yakni digunakan untuk memberi makan tamu-tamu, anak-anak, dan orang-orang miskin. Sementara bagian yang kedua diperuntukkan untuk berhala-berhala mereka sehingga dikuasai sepenuhnya untuk para penjaga dan pemelihara berhala tersebut. Mereka melakukan ini sambil berkata menurut persangkaan mereka, ini untuk Allah. Silakan dipergunakan untuk para fakir miskin, namun jika kami butuh, kami berhak menggunakannya untuk berhala kami juga. Dan bagian yang ini khusus untuk berhalaberhala kami. Tidak boleh seorang pun menyentuhnya kecuali para penjaga dan pemelihara, karena ini sebagai bentuk peribadatan kami kepada mereka. Bagian yang untuk berhala-berhala mereka tidak akan sampai kepada Allah, dan bagian yang untuk Allah akan sampai kepada berhala-berhala mereka. Sangat buruk ketetapan mereka itu. Dan demikianlah berhala-berhala itu membuat sesat kaum musyrik. Selain kesyirikan, berhala-berhala mereka, yaitu setan, baik dari kalangan jin maupun golongan manusia, juga menjadikan terasa indah, maksudnya adalah menganggap baik, bagi banyak orang-orang musyrik membunuh anak-anak mereka dengan dalih berkurban sebagaimana yang telah dilakukan oleh ibrahim kepada ismail. Padahal, sesungguhnya alasan mereka yang sebenarnya hanyalah karena takut miskin. Hal ini mereka lakukan untuk membinasakan anak-anak mereka dan mengacaukan agama mereka sendiri. Dan kalau Allah menghendaki agar mereka tidak mengerjakan perbuatan itu, niscaya mereka tidak akan mengerjakannya. Namun kehendak, ketetapan, dan hikmah-Nya telah menjadikan mereka seba-gai contoh bagi setiap kaum yang memiliki pola pikir buruk seperti mereka. Biarkanlah mereka, wahai nabi Muhammad, bersama apa, yaitu kebohongan, yang mereka ada-adakan."
  }
]