[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik itu mengatakan, ”unta dan tanaman ini haram,” tidak boleh memakannya kecuali orang-orang yang mereka izinkan saja, (sesuai dengan prasangka mereka), seperti para penjaga berhala-berhala dan orang-orang lainnya.” unta ini diharamkan pemanfaatan punggungnya, maka tidak boleh ditunggangi dan membawa barang bawaan dalam kondisi apapun.” Dan unta yang lain tidak mereka sebut Nama Allah ketika menyembelihnya dalam keadaan apapun. Mereka melakukan semua itu dengan dasar kebohongan atas nama Alllah. Allah akan membalasan kepada mereka disebabkan perbuatan yang mereka ada-adakan dalam bentuk kedustaan terhadapNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "138. Orang-orang musyrik berkata, “Jenis-jenis hewan ternak dan tanam-tanaman ini terlarang.” Tidak ada yang boleh memakannya selain orang-orang yang mereka kehendaki menurut anggapan mereka secara dusta. Mereka adalah para pelayan berhala dan lain-lain. Ini adalah hewan-hewan ternak yang diharamkan punggungnya. Sehingga tidak boleh dinaiki dan tidak boleh diberi muatan. Yaitu hewan-hewan yang disebut dengan baḥīrah, sā`ibah, dan ḥāmī. Dan ini adalah hewan-hewan yang mereka sembelih tanpa menyebut nama Allah. Mereka menyembelihnya dengan menyebut nama berhala-berhala mereka. Mereka melakukan semua itu berdasarkan kebohongan yang mereka buat atas nama Allah bahwa hal itu berasal dari sisi-Nya. Allah akan membalas perbuatan mereka dengan azab-Nya disebabkan kebohongan yang mereka buat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "138. Orang-orang musyrik itu mengatakan perkataan yang penuh kesombongan dan kejahilan: Hewan-hewan ternak dan tanaman ini haram dan tidak boleh dimakan kecuali bagi para pelayan berhala-berhala. Ini merupakan perkataan batil yang tidak didasari hujjah. Mereka juga mengharamkan hewan-hewan ternak tertentu untuk ditunggangi atau dimuati beban dan hewan-hewan ternak yang tidak boleh disebutkan nama Allah ketika penyembelihannya. Itu semua merupakan kedustaan terhadap Allah, Dia akan menyiksa mereka akibat kedustaan ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "138. وَقَالُوا۟ هٰذِهِۦٓ أَنْعٰمٌ وَحَرْثٌ حِجْرٌ (Dan mereka mengatakan: “Inilah hewan ternak dan tanaman yang dilarang) Yakni haram dan terlarang. Mereka bermaksud menjadikannya untuk berhala-berhala mereka; tidak ada seorangpun yang boleh memakannya kecuali orang-orang yang mereka kehendaki sesuai klaim mereka. Dan mereka adalah para pelayan berhala-berhala, sebagaimana anggapan mereka bahwa hal ini merupakan bagian dari agama mereka. وَأَنْعٰمٌ حُرِّمَتْ ظُهُورُهَا (dan ada binatang ternak yang diharamkan menungganginya) Yakni unta bahiirah, saaibah, dan haam, dengan kebodohan mereka unta-unta ini mereka haramkan untuk ditunggangi atau diberi muatan. وَأَنْعٰمٌ لَّا يَذْكُرُونَ اسْمَ اللهِ عَلَيْهَا (dan ada binatang ternak yang mereka tidak menyebut nama Allah waktu menyembelihnya) Yakni hewan-hewan ternak yang disembelih untuk sesembahan-sesembahan mereka. Mereka menyembelihnya dengan menyebut nama patung-patung mereka dan tidak dengan nama Allah. Pendapat lain mengatakan yang dimaksud adalah mereka tidak pergi berhaji dengan menaiki hewan-hewan tersebut. افْتِرَآءً عَلَيْهِ ۚ (semata-mata membuat-buat kedustaan terhadap Allah) Yakni berdusta dengan anggapan mereka bahwa ini merupakan bagian dari agama Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "138 Orang-orang musyrik mengatakan: “Semua hasil bumi dan hewan ternak yang kami peruntukkan untuk sesembahan kami ini tidak boleh dimakan, atau tidak boleh diambil manfaatnya, kecuali orang yang kami kehendaki yaitu untuk para sesembahan dan berhala. Tidak ada yang boleh memakannya kecuali mereka yang kami kehendaki yaitu para penghulu berhala kami, dan para lelaki saja, bukan perempuan”. Menurut anggapan mereka, bahwa Allah telah mengizinkan itu untuk mereka. Padahal binatang ternak itu jelas haram atau tidak diperbolehkan menunggangi atau membawa beban di atasnya yaitu unta saibah, keledai dan rajawali. Dan ada binatang ternak yang ketika menyembelihnya mereka tidak menyebut nama Allah, akan tetapi mereka menyebut nama sesembahan mereka, semata-mata membuat kedustaan terhadap Allah, dengan berkata: “Sesungguhnya Allah telah memberi izin atas ini semua.” Kelak Allah akan membalas mereka terhadap apa yang selalu mereka ada-adakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata menurut sangkaan mereka,“Inilah hewan ternak dan hasil tanaman} tanaman {yang dilarang} yang diharamkan dan dilarang {tidak boleh dimakan} tidak dimakan {kecuali oleh orang yang kami kehendaki. dan hewan yang diharamkan punggungnya} dilarang punggungnya, maka janganlah ditunggangi dan digunakan untuk membawa barang {dan ada hewan ternak yang mana mereka tidak menyebut nama Allah padanya” sebagai kebohongan terhadapNya} kepada Allah {Allah akan membalas mereka atas apa yang mereka ada-adakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "138. Di antara bentuk kebodohon adalah , bahwa binatang ternak yang secara umum telah dihalalkan oleh Allah, dan dijadikan sebagai rizki dan rahmat di mana mereka menikmatinya dan mengambil manfaatnya, namun mereka mengada-adakan keyakinan dan ucapan dari diri mereka sendiri, mereka memilii istilah sendiri pada sebagian ternak dan tanaman, mereka mengatakan, “inilah binatang ternak dan tanaman yang dilarang.” Maksdunya, yang diharamkan, tidak ada yang memakannya kecuali orang yang kami inginkan atau dia memiliki kriteria khusus menurut kami. Semua ini hanyalah sebuah klaim mereka tanpa pijakan dan hujjah kecuali hawa nafsu dan akal yang rusak. Adapula binatang ternak yang tidak tidak diharamkan dari segala segi, hanya punggungnya saja yang diharamkan, maksudnya, mereka dilarang mengendarai dan memberi beban kepadanya, mereka melingdungi punggungnya, dan mereka menamakannya Ham. Adapula binatang ternak di mana mereka tidak menyebut nama Allah saat menyembalihanya, akan tetapi mereka menyebut nama berhala-berhala dan sesembahan-sesembahan yang mereka yang mereka sembah selain Allah, merekam menyandarkan perbuatan itu kepada Allah maka mereka semua adalah orang fajir lagi pendusta. “kelak Allah akan membalas mereka atas apa yang selalu mereka ada-adakan” atas nama Allah dalam bentuk penghalalan syirik, pengharaman halal dan manfaat yang halal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 138: Ini pun termasuk contoh kebodohan mereka. Dengan tanpa hujjah sama sekali, selain berdasar kepada hawa nafsu dan pendapat mereka semata. Mereka biasa menentukan binatang-binatang untuk pujaan dan binatang-binatang tersebut hanya boleh dimakan oleh orang-orang tertentu saja, seperti kepada para pelayan berhala, dsb. Seperti Saa’ibah dan ham (lihat tafsir Surah Al Maa’idah: 103). Padahal binatang ternak itu tidak haram dari berbagai sisi (halal dimakan, diambil susunya, diangkutkan barang di atasnya, dan halal ditunggangi). Yang mereka sebut adalah nama patung dan apa yang mereka sembah selain Allah, bahkan tidak hanya itu mereka menisbatkan perbuatan itu kepada Allah. Terhadap Allah, padahal sesungguhnya mereka dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 138",
    "description": "Orang-orang musyrik itu juga membagi hasil pertanian dan peternakan mereka menjadi tiga macam. Mereka berkata sesuai anggapan mereka, pertama, inilah hewan ternak dan hasil bumi yang dilarang untuk disentuh oleh siapa pun, tidak boleh dimakan oleh siapa pun, kecuali oleh orang yang kami kehendaki, karena hewan dan hasil bumi ini kami persembahkan untuk berhala-berhala kami. Kedua, dan ada pula hewan yang diharamkan atau tidak boleh ditunggangi seperti bahirah, sa'ibah, washilah, dan ha'm (lihat: surah al-ma'idah/5: 103), dan yang ketiga, ada hewan ternak yang ketika disembelih boleh tidak menyebut nama Allah, tetapi menyebut nama tuhan-tuhan mereka. Perbuatan mereka membagi hasil bumi dan ternak dengan ragam di atas itu sebagai kebohongan terhadap Allah karena mereka telah menisbatkan hal ini kepada-Nya. Padahal, Allah berlepas diri dari perbuatan mereka tersebut. Kelak Allah akan membalas semua yang mereka ada-adakan. Dan mereka berkata pula, apa yang ada di dalam perut hewan ternak ini, yaitu susunya, khusus untuk kaum laki-laki kami, haram bagi istriistri, yakni kaum wanita, kami. Dan jika binatang itu melahirkan anak jantan, maka anaknya itu hanya boleh dimakan oleh laki-laki saja, namun jika yang dalam perut itu dilahirkan mati, maka semuanya baik lakilaki maupun perempuan boleh memakannya. Kelak Allah akan membalas atas ketetapan mereka yang sewenang-wenang itu. Sesungguhnya Allah mahabijaksana, maha mengetahui segala perbuatan hamba-Nya."
  }
]