[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik berkata, ”Apa yang ada di dalam perut binatang-binatang ternak yang berupa janin-janin, hukumnya mubah bagi para laki-laki dari kami, namun haram bagi para wanita kami, jika dilahirkan dalam keadaan hidup.” Dan mereka saling berbagi bila dilahirkan dalam keadaan mati. Allah akan menghukum mereka, karena mereka menetapkan aturan syariat bagi diri mereka, baik berupa pengahalalan, maupun pengharaman yang tidak pernah diizinkan oleh Allah . Sesungguhnya Allah maha bijaksana dalam pengaturan urusan-urusan makhlukNya, lagi maha mengetahui mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Dan mereka berkata, “Janin yang ada di dalam perut hewan sā`ibah dan baḥīrah, jika lahir dalam keadaan hidup maka janin itu halal bagi laki-laki kami, namun haram bagi wanita kami. Dan jika janin yang ada di perutnya lahir dalam keadaan mati maka laki-laki dan wanita sama-sama boleh memakannya. Kelak Allah akan membalas perbuatan mereka akibat ucapan mereka itu. Sesungguhnya Allah -Ta'ālā- Maha Bijaksana dalam menetapkan syariat-Nya dan mengatur urusan makhluk-Nya, lagi Maha Mengetahui perihal mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139. Mereka juga berdusta dengan berkata: Apa yang ada dalam perut bahirah -yaitu unta betina yang telah dirobek telinganya yang diharamkan untuk ditunggangi- dan saibah, baik itu berupa janin atau susunya adalah milik berhala-berhala mereka, itu halal bagi kaum lelaki dan haram bagi kaum perempuan yang telah menikah. Hal ini Jika janin itu dilahirkan dalam keadaan hidup; adapun jika dilahirkan dalam keadaan mati maka ia halal bagi semua orang. Allah akan menyiksa mereka atas hukum-hukum zalim yang mereka buat. Dia Maha Bijaksana dalam menetapkan hukum-hukum-Nya dan Maha Mengetahui makhluk-makhluk-Nya"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "139. وَقَالُوا۟ مَا فِى بُطُونِ هٰذِهِ الْأَنْعٰمِ (Dan mereka mengatakan: “Apa yang ada dalam perut binatang ternak ini) Yang mereka maksud adalah hewan-hewan ternak bahiirah dan saaibah yang mengandung janin. Ibnu Abbas berkata: apabila ada domba yang melahirkan anak jantan maka mereka menyembelih anak domba tersebut untuk para diberikan kepada kaum laki-laki mereka dan tidak diberikan kepada kaum perempuan, dan apabila melahirkan anak betina maka tidak disembelih, kemudian apabila anak domba tersebut mati maka itu untuk dibagikan kepada kaum laki-laki dan kaum perempuan. خَالِصَةٌ لِّذُكُورِنَا(khusus untuk pria kami) Yakni halal bagi mereka, kaum pria. وَمُحَرَّمٌ عَلَىٰٓ أَزْوٰجِنَا ۖ( dan diharamkan atas wanita kami) Yakni para perempuan, dan masuk diantaranya anak perempuan, saudara perempuan, dan lainnya. Pendapat lain mengatakan ayat ini berbicara tentang susu perah yang mereka halalkan bagi kaum laki-laki dan mereka haramkan bagi para perempuan. وَإِن يَكُن مَّيْتَةً (dan jika itu mati) Yakni apabila janin yang ada didalam perut hewan ternak tersebut mati. فَهُمْ فِيهِ (maka pria dan wanita dalam hal ini) Yakni dalam urusan janin yang mati ini. شُرَكَآءُ (sama-sama boleh memakannya) Laki-laki dan perempuan boleh memakannya. سَيَجْزِيهِمْ وَصْفَهُمْ ۚ (Kelak Allah akan membalas mereka terhadap ketetapan mereka) Yakni Allah akan membalas mereka karena pernyataan mereka ini sesuai dengan balasan yang pantas bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "139 Mereka orang-orang musyrik juga mengatakan: “Apa yang ada dalam perut binatang ternak ini yaitu keledai dan unta saibah adalah khusus untuk sesembahan dan lelaki kami dan diharamkan atas wanita kami, baik anak perempuan maupun saudara perempuan dan lainnya,” Jika yang dalam perut itu dilahirkan mati, maka pria dan wanita sama-sama boleh memakannya. Kelak Allah akan membalas mereka atas ketetapan untuk mereka, atas perkataan dusta terang-terangandan dan fitnah yang mereka lakukan dengan mengharamkan apa yang tidak diharamkan Allah. Sesungguhnya Allah Maha Bijaksana dalam segala perbuatan dan syariat-Nya lagi Maha Mengetahui atas segala kondisi hamba-Nya. Ibnu Abbas berkata: Jika seekor domba melahirkan domba jantan maka mereka menyembelihnya, untuk dimakan khusus para laki-laki dan haram untuk perempuan. Namun bila melahirkan domba betina maka mereka tidak menyembelihnya, namun jika melahirkan domba mati/sudah menjadi bangkai maka mereka memakannya bersama (laki-laki dan perempuan)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka juga berkata,“Apa yang ada di dalam perut hewan ternak ini khusus} halal {untuk kaum laki-laki kami dan haram bagi istri-istri kami} istri-istri kami {Jika mati, maka semua boleh ikut serta} maka laki-laki dan perempuan sama dalam memakannya {Kelak Allah akan membalas penjelasan mereka} penjelasan mereka tentang kebohongan kepada Allah {Sesungguhnya Dia Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "139. Di antara keyakinan mereka yang buruk adalah mereka menentukan sebagian binatang ternak, lalu mereka menentukan janin yang ada di perutnya sebagai manusia yang haram untuk wanita dan tidak laki-laki. Mereka berkata, “janin yang ada di dalam perut binatang ternak ini adalah khusus untuk pria kami.” Maksudnya, hanya halal untuk kaum laki-laki saja, dan tidak halal untuk wanita. “Dan haram atas wanita.” Ini jika janin itu lahir dalam keadaan mati, maka ia halal untuk semuanya, yakni halal untuk wanita dan laki-laki. “kelak Allah akan membalas mereka terhadap ketetapan mereka,” dimana mereka menetapkan sesuatu yang dihalalkan oleh Allah sebagai sesuatu yang haram, dan menetapkan yang haram menjadi halal, maka mereka menetang dan menyelisihi sayariat Allah dan mereka menisbatkannya kepada Allah. “Sesungguhnya Allah Mahabijaksana,” dimana Dia menunda mereka dan menenpatkan mereka dalam kesesatan yang mereka alami. “Lagi Maha Mengetahui,” keadaan mereka, tidak ada yang samar bagiNya. Dia mengetahui mereka, mengetahui apa yang mereka katakan dan nisbatkan secara dusta kepadaNya sementara Dia terus memberi mereka rizki dan keselamatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 139: Maksudnya adalah binatang-binatang ternak yang tidak boleh ditunggangi seperti Bahiirah dan Saaibah. Dengan menghalalkan dan mengharamkan menurut hawa nafsu mereka. Hal ini sama persis dengan adat yang terjadi di beberapa daerah di negeri kita Indonesia, di mana kepala adat dan masyarakatnya membuat ketetapan-ketetapan yang isinya menghalalkan apa yang Allah haramkan atau mengharamkan apa yang Allah halalkan, padahal tasyri’ (menetapkan sesuatu) adalah hak Allah. Mereka juga mengadakan persembahan (baca: sesaji) kepada selain Allah, di mana perbuatan tersebut adalah perbuatan syirk akbar yang dapat mengeluarkan mereka dari Islam. Mereka sebut sesaji dan kurban tersebut dengan nama sedekah, ada yang disebut sedekah gunung, sedekah laut, dll."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 139",
    "description": "Dan mereka berkata pula, apa yang ada di dalam perut hewan ternak ini, yaitu susunya, khusus untuk kaum laki-laki kami, haram bagi istriistri, yakni kaum wanita, kami. Dan jika binatang itu melahirkan anak jantan, maka anaknya itu hanya boleh dimakan oleh laki-laki saja, namun jika yang dalam perut itu dilahirkan mati, maka semuanya baik lakilaki maupun perempuan boleh memakannya. Kelak Allah akan membalas atas ketetapan mereka yang sewenang-wenang itu. Sesungguhnya Allah mahabijaksana, maha mengetahui segala perbuatan hamba-Nya. Sungguh rugi dan celaka mereka yang membunuh anak-anaknya karena kebodohan tanpa pengetahuan, serta menghalalkan apa yang diharamkan Allah dan mengharamkan rezeki yang dikaruniakan Allah kepada mereka dengan semata-mata membuat-buat kebohongan terhadap Allah. Sungguh, mereka telah sesat dan tidak mendapat petunjuk. Halal dan haram hanyalah hak Allah semata, tidak seorang pun berhak menentukan kehalalan dan keharaman sesuatu kecuali dengan petunjuk Allah."
  }
]