[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada orang-orang yang menyekutukan sesuatu dengan Allah , ”apakah selain Allah yang aku jadikan pelindung dan penolong, sedang Dia lah pencipta langit dan bumi dan seisinya, dan Dia lah yang memberi rizki kepadanya?” katakanlah (wahai rasul), ”sesungguhnya aku diperintahkan untuk menjadi orang yang pertama kali tunduk dan patuh kepadaNya dengan melakukan ubudiyah (ibadah) kepadNya dari umat ini, dan aku dilarang menjadi orang yang menyekutukan sesuatu bersamaNya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang menyembah Allah bersama sembahan lain, entah itu berupa berhala maupun lainnya, “Apakah masuk akal bila aku menjadikan selain Allah sebagai pelindung dan penolong? Sedangkan Dia adalah Pencipta langit dan bumi tanpa ada contoh sebelumnya. Sehingga tidak ada yang mendahului-Nya menciptakan langit dan bumi. Dia lah yang memberikan rezeki kepada siapa saja di antara hamba-hamba-Nya yang dikehendaki-Nya. Dan tidak ada seorang pun dari hamba-hamba-Nya yang memberikan rezeki kepada-Nya. Dia Mahakaya, tidak membutuhkan bantuan hamba-hamba-Nya. Sedangkan hamba-hamba-Nya membutuhkan pertolongan-Nya.” Katakanlah -wahai Rasul-, “Sesungguhnya aku diperintahkan oleh Rabbku -Subḥānahu- agar aku menjadi orang pertama di antara umat ini yang tunduk dan patuh kepada Allah. Dan Dia melarang diriku menjadi bagian dari orang-orang yang menyekutukan-Nya dengan sesuatu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. ini merupakan pertanyaan untuk mengolok-olok orang-orang musyrik. Allah berfirman kepada Nabi Muhammad ketika orang-orang musyrik menjadikan berhala-berhala sebagai tuhan-tuhan selain Allah; maka Allah mengolok dan mengingkari mereka. Rasulullah berkata kepada mereka: \"Apakah aku akan menjadikan selain Allah sebagai penolong, padahal Allah adalah Pencipta langit dan bumi, Dia menghidupkan dan mematikan, dan menahan dan memberi rezeki kepada seseorang. Maka bagaimana aku akan menjadikan selain-Nya sebagai Tuhan? Maha suci Allah dari apa yang mereka sekutukan.\" Hai Rasulallah, Katakanlah: \"Sesungguhnya aku diperintahkan untuk menjadi orang yang pertama-tama tunduk dan patuh kepada Allah dan aku dilarang menjadi termasuk orang-orang yang musyrik.\" Kalimat ini merupakan larangan Allah bagi rasulnya yang dimaksudkan untuk menegaskan perintah pegang kepada agama Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. قُلْ أَغَيْرَ اللهِ أَتَّخِذُ وَلِيًّا (Katakanlah: “Apakah akan aku jadikan pelindung selain dari Allah) Rasulullah mengatakan ini kepada mereka setelah mereka mengajaknya untuk beribadah kepada patung-patung. Yakni mengapa aku menjadikan selain Allah sebagai sesembahan? فَاطِرِ السَّمٰوٰتِ وَالْأَرْضِ (yang menjadikan langit dan bumi) Sedangkan Dialah yang menciptakan keduanya dari yang sebelumnya tidak ada. وَهُوَ يُطْعِمُ وَلَا يُطْعَمُ ۗ (padahal Dia memberi makan dan tidak diberi makan) Yakni Dia memberi rezeki kepada manusia apa yang mereka makan, sedangkan Dia tidak membutuhkan makanan sehingga tidak perlu orang yang memberinya makan. قُلْ إِنِّىٓ أُمِرْتُ أَنْ أَكُونَ أَوَّلَ مَنْ أَسْلَمَ ۖ (Katakanlah: “Sesungguhnya aku diperintah supaya aku menjadi orang yang pertama kali menyerah diri) Setelah Allah memerintahkan Rasulullah untuk mengingkari ajakan mereka untuk menyembah selain Allah, kemudian Allah memerintahkannya untuk menjadi orang yang pertama menyerahkan diri kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Wahai rasul katakanlah kepada penduduk Mekah yang mengajakmu untuk menyembah berhala: “Bagaimana bisa aku mengambil penolong dan sesembahan selain Allah, sedangkan Dialah pencipta langit dan bumi. Dialah yang memberi manusia apa yang mereka butuhkan, dan tidak ada satupun yang bisa memberi rejeki (selain Dia). Dia tidak butuh manusia, makanan dan hal lainnya” Katakanlah: “Sesungguhnya aku diperintahkan untuk menjadi orang pertama yang tunduk kepada Tuhan dengan beribadah dan dikatakan kepadaku: “Jangan sampai kamu termasuk orang-orang musyrik yang menyekutukan Allah dengan ciptaanNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah ada selain Allah, yang akan aku jadikan pelindung} penolong dan pemberi bantuan {Pencipta} pencipta {langit dan bumi serta memberi makan dan tidak diberi makan} Dia memberi rejeki dan tidak diberi rejeki {Katakanlah,“Sesungguhnya aku diperintahkan agar aku menjadi orang pertama yang berserah diri} tunduk dan berserah diri kepada Allah dari umat ini, dan dikatakan kepadaku {dan jangan sekali-kali kamu masuk golongan orang-orang musyrik.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “Katakanlah” kepada orang-orang yang menyekutukan Allah dengan sesuatu, “Apakah akan aku jadikan pelindung selain dari Allah,” dari kalangan para makhluk yang lemah yang akan menolong dan melindungiku. Aku tidak menjadikan selain Allah sebagai penolong, karena Dia adalah, “Yang menjadikan langit dan bumi,” pengatur keduanya. “padahal dia yang memberi makan dan tidak di beri makan.” Maksudnya, Dialah pemberi rezeki seluruh mahkluk tanpa ada kepentingan dariNya kepada mereka. Bagaimana layak bagiku menjadi penolong selain Allah sang pencipta, pemberi rezeki, yang kaya lagi terpuji? “ katakanlah, sesunguhnya aku di perintah supaya aku menjadi yang pertama kali menyelamatkan diri” kepada Allah dengan tauhid dan pasrah kepadaNya dengan ketaatan, karena aku lebih berhak daripada orang lain untuk enaati perintah-perintah Allah. “Dan jangan sekali-kali kamu termasuk golongan orang-orang musrik.” Maksdunya, aku juga di larang masuk ke dalam golongan orang musrik, tidak pada kaidah mereka, tidak bergaul dan tidak berkumpul dengan mereka. Ini adalah kewajiban paling kuat dan paling wajib atasku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 14: Dari kalangan makhluk, padahal makhluk dicipta, diberi rezki, lemah, fakir, dsb. sedangkan Allah Maha Pencipta, Maha Pemberi rezki, Maha Kuasa, Maha Kaya lagi Maha Terpuji. Dikatakan kepadaku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 14",
    "description": "Katakanlah, wahai rasulullah, kepada orang-orang yang menyekutukan Allah, apakah aku akan menjadikan sesuatu selain Allah sebagai pelindung dan penolong, padahal Allah yang menjadikan langit dan bumi untuk kepentingan manusia; dia yang memberi makan seluruh makhluk hidup dengan menjamin rezeki dan mengaturnya dengan merata, dan tidak diberi makan dengan segala bentuk sesajian karena Allah tidak membutuhkannya' katakanlah kepada mereka, wahai rasulullah, sesungguhnya aku diperintahkan oleh Allah agar aku menjadi orang yang pertama berserah diri kepada-Nya dengan rukuk dan sujud, serta dengan menyerahkan seluruh jiwa raga, hidup, dan mati kepada-Nya. Dan jangan sekali-kali kamu, wahai rasulullah bersama orang-orang beriman yang mengikutimu, termasuk golongan orang-orang musyrik, yang menyekutukan Allah, baik dengan perbuatan maupun ucapan, baik terbuka maupun tersembunyikatakanlah, wahai rasulullah, kepada orang-orang musyrik, aku benar-benar takut akan azab hari yang besar, hari kiamat, jika aku mendurhakai tuhanku dengan menyalahi perintah-Nya, lebih-lebih menyekutukan-Nya. Karena itu, aku tidak akan pernah berkompromi dengan segala bentuk kemusyrikan."
  }
]