[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh benar-benar merugi dan binasa orang-orang yang membunuh anak-anak mereka karena kedangkalan akal pikiran dan kebodohan mereka, dan mereka mengharamkan apa yang Allah karuniakan kepada mereka dengan dasar kebohongan atas nama Allah. Sungguh mereka telah amat jauh dari kebenaran, dan mereka bukanlah orang-orang yang memperoleh hidayah dan berada di jalan yang lurus. Penetapan hukum halal dan haram menjadi salah satu hak khusus Allah dalam penetapan aturan hukum syariat. Perkara halal adalah yang dihalalkan oleh Allah dan perkara haram adalah yang diharamkan oleh Allah. Tidak ada hak bagi seorang pun dari hambaNYa, entah itu seorang individu atau golongan untuk mensyariatkan kepada hamba-hamba Allah sesuatu ajaran yang tidak diizinkan dengan itu oleh Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "140. Sungguh celaka orang-orang yang membunuh anak-anaknya karena kebodohan dan kepandiran mereka dan mengharamkan hewan-hewan ternak yang Allah berikan kepada mereka secara mengada-ada atas nama Allah. Mereka benar-benar tersesat dari jalan yang lurus dan tidak mengetahui jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "140. Allah menegaskan bahwa orang-orang musyrik itu telah merugi atas agama dan anak-anak mereka karena telah membunuh anak-anak tersebut akibat keyakinan jahil yang tidak bersandar pada hujjah. Mereka juga merugi ketika mengharamkan makanan-makanan baik yang telah Allah rezekikan bagi mereka, akibat kedustaan mereka terhadap Allah. Mereka sungguh telah berpaling jauh dari kebenaran dan tidak mendapat hidayah dan taufik kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "140. قَدْ خَسِرَ الَّذِينَ قَتَلُوٓا۟ أَوْلٰدَهُمْ سَفَهًۢا (esungguhnya rugilah orang yang membunuh anak-anak mereka, karena kebodohan) Yakni mereka membunuh anak-anak perempuan mereka dengan membunuhnya hidup-hidup, yang mereka lakukan karena kebodohan mereka dan bukan berdasarkan akal sehat maupun syari’at. وَحَرَّمُوا۟ مَا رَزَقَهُمُ اللهُ (dan mereka mengharamkan apa yang Allah telah rezeki-kan pada mereka) Yakni berupa hewan-hewan ternak yang mereka sebut dengan bahiirah dan saaibah. افْتِرَآءً عَلَى اللهِ ۚ( semata-mata mengada-adakan terhadap Allah) Yakni kedustaan terhadap Allah. Karena Allah tidak mengharamkan sesuatu pun hal ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "140 Sesungguhnya orang yang telah membunuh anak-anak mereka benar-benar rugi, sebab mereka takut menjadi miskin. karena kebodohan mereka sendiri tanpa ada dasar yang jelas. Mereka telah mengharamkan apa yang Allah telah rezeki-kan pada mereka berupa hewan ternak dan segala yang baik dengan semata-mata mengada-adakan dusta terhadap Allah. Sesungguhnya Allah tidak pernah mengharamkan itu semua. Sesungguhnya mereka telah sesat dari jalan kebenaran dan kebaikan, dan tidaklah mereka mendapat petunjuk dan syariat. Atau mereka tidak sedikitpun mendapat petunjuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh rugi orang-orang yang membunuh anak-anak mereka karena kebodohan} kelalaian dan kebodohan {tanpa pengetahuan dan mengharamkan rezeki yang dikaruniakan Allah kepada mereka dengan membuat-buat} kebohongan {terhadap Allah. Sungguh mereka telah tersesat} menyimpang dari jalan yang lurus {dan mereka tidak mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "140. Kemudian Allah menejalaskan kerugian dan kebodohan akal mereka. Dia berifrman, “ Sungguh rugilah orang yang membunuh ana-anak mereka karena kebodohan lagi tidak mengetahui.” Maksudnya, mereka rugi agama, anak, dan akal. Ciri mereka berubah dari pemilik akal yang baik menjadi pemilik kedunguan dan kesesatan yang buruk. “Dan mereka mengharamkan sesuatu yang telah Allah rizkikan kepada mereka.” Maksudnya, mereka mengharamkan sesuatu yang Allah jadikan sebagai rahmat bagi mereka dan sesuatu yang Dia limpahkan sebagai rizki bagi mereka. Mereka menolak karunia tuhan mereka, tidak sebatas itu saja bahkan mereka menyatakannya haram. Padahal sebenarnya ia termasuk yang paling halal, semua itu adalah “semata-mata mengada-adakan kepada Allah.” Maksudnya, kedustaan yang dilancarkan oleh setiap kafir yang menentang. “Sungguh mereka telah sesat dan tidaklah mereka mendapat petunjuk.” Maksudnya, mereka tersesat dengan kesesatan yang jauh dan tidak mendapatkan petunjuk sedikitpun dalam urusan-urusan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 140: Karena rahmat-Nya dan sebagai rezki untuk mereka. Namun mereka menolak pemberian Tuhan mereka, bahkan mengatakan haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 140",
    "description": "Sungguh rugi dan celaka mereka yang membunuh anak-anaknya karena kebodohan tanpa pengetahuan, serta menghalalkan apa yang diharamkan Allah dan mengharamkan rezeki yang dikaruniakan Allah kepada mereka dengan semata-mata membuat-buat kebohongan terhadap Allah. Sungguh, mereka telah sesat dan tidak mendapat petunjuk. Halal dan haram hanyalah hak Allah semata, tidak seorang pun berhak menentukan kehalalan dan keharaman sesuatu kecuali dengan petunjuk Allah pada ayat-ayat yang lalu diterangkan bagaimana kaum musyrik mekah telah membuat ketetapan dan peraturan yang hanya berdasarkan pada keinginan hawa nafsu sendiri, bahkan mereka mengklaim bahwa peraturan itu berasal dari Allah. Pada ayat-ayat ini Allah menjelaskan lagi nikmat dan karunia-Nya yang diberikan kepada hambanya. Dan dialah, Allah, yang menjadikan dua jenis tanaman, yaitu tanaman-tanaman yang merambat dan yang tidak merambat. Allah pun menciptakan untuk manusia berbagai macam pepohonan seperti pohon kurma, tanaman yang beraneka ragam rasanya, zaitun dan delima yang serupa (bentuk dan warnanya) dan tidak serupa (rasanya). Wahai manusia! makanlah buahnya apabila ia berbuah dan jangan lupa berikanlah haknya, berupa zakat, pada waktu memetik hasilnya, tapi janganlah berlebihlebihan, dalam arti tidak terlalu pelit dan tidak terlalu boros, tetapi berada di antara keduanya. Sesungguhnya Allah tidak menyukai orang-orang yang berlebihan, yaitu dengan mengeluarkan harta bukan pada tempatnya."
  }
]