[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah Dia lah yang menciptakan bagi kalian kebun-kebun, yang diantaranya ada kebun yang batangnya tidak menyentuh permukaan tanah seperti pohon anggur, dan diantaranya ada kebun yang tidak menjalar tinggi di atas permukaan tanah, akan tetapi berdiri tegak di atas batang pokoknya, seperti pohon kurma dan tanam-tanaman lain yang memiliki cita-rasa yang berbeda-beda, dan pohon zaitun dan pohon delima yang saling serupa bentuk fisiknya, namun berbeda buah dan rasanya. Wahai manusia, makanlah dari hasil buahnya bila telah berbuah, dan serahkanlah zakatnya yang wajib atas kalian pada hari dipetik dan dipanennya. Dan janganlah kalian melewati batas-batas keseimbangan dalam urusan pengeluaran harta, memakan makanan dan yang lainnya. Sesungguhnya Allah tidak menyukai orang-orang yang melampaui batas-batasNya, dengan cara menginfakan harta tidak sesuai aturannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Dan Allah yang menciptakan kebun-kebun yang terhampar di muka bumi, baik berupa tanaman-tanaman yang tidak mempuyai batang maupun pepohonan yang memiliki batang. Dia lah yang menciptakan pohon kurma dan menciptakan tanaman-tanaman yang beraneka ragam buahnya dari segi bentuk dan cita rasanya. Dan Dia lah yang menciptakan buah zaitun dan buah delima yang daunnya serupa tetapi rasanya (buahnya) berbeda. Makanlah -wahai manusia- dari buahnya apabila tanaman itu berbuah, dan tunaikanlah zakatnya pada waktu panen. Dan janganlah kalian melampaui batas-batas yang telah ditetapkan oleh syariat ketika memakannya dan membelanjakannya. Karena Allah tidak menyukai orang-orang yang melampaui batas dalam masalah tersebut maupun masalah lainnya. Bahkan Dia murka kepada orang-orang semacam itu. Sesungguhnya Allah menciptakan semua hal yang dihalalkan itu untuk hamba-hamba-Nya. Maka orang-orang musyrik tidak berhak mengharamkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141. Allah-lah yang menciptakan kebun-kebun yang terdapat di dalamnya pohon-pohon yang menjalar di atas junjung dan pohon-pohon yang batangnya meninggi semisal pohon apel. Dan Allah menciptakan pohon kurma dan tanaman-tanaman yang memiliki rasa, warna, dan aroma yang berbeda-beda; dan menciptakan pohon zaitun dan delima yang masing-masing jenisnya memiliki bentuk yang serupa namun rasanya berbeda-beda, ada yang manis dan ada yang masam. Makanlah buahnya jika telah matang, dan keluarkanlah zakat yang telah diwajibkan pada masa panennya. Dan janganlah kalian berlebih-lebihan dalam membelanjakan harta, karena Allah tidak menyukai orang yang berlebih-lebihan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "141. وَهُوَ الَّذِىٓ أَنشَأَ جَنّٰتٍ (Dan Dialah yang menjadikan kebun-kebun) Yakni yang menciptakan kebun-kebun. مَّعْرُوشٰتٍ(yang berjunjung) Yakni yang terangkat diatas tiang-tiang. وَغَيْرَ مَعْرُوشٰتٍ (dan yang tidak berjunjung) Yakni dan Dia menciptakan kebun-kebun lain yang tidak memiliki tiang-tiang yang menjunjungnya. Terdapat pendapat mengatakan yang dimaksud dengan (المعروشات) yakni tanaman yang menjalar di tanah seperti anggur, dan semangka. Dan (غير المعروشات) yakni yang tumbuh dengan batang pohon seperti kurma dan pohon-pohon yang lain. مُخْتَلِفًا أُكُلُهُۥ (yang bermacam-macam buahnya) Yakni dalam hal rasanya. Atau berbeda-beda buahnya dan bagian yang dimakan seperti daun atau biji. Allah memberi kenikmatan berupa perbedaan rasa-rasa tersebut sebagai bentuk kelembutan-Nya kepada para hamba-Nya. وَالزَّيْتُونَ وَالرُّمَّانَ (zaitun dan delima) Yakni juga menciptakan zaitun dan delima. مُتَشٰبِهًا وَغَيْرَ مُتَشٰبِهٍ ۚ (yang serupa (bentuk dan warnanya) dan tidak sama (rasanya)) Ayat ini telah dijelaskan tafsirannya sebelumnya pada ayat 99 dalam surat ini. إِذَآ أَثْمَرَ(bila dia berbuah) Meskipun belum dipanen. وَءَاتُوا۟ حَقَّهُۥ يَوْمَ حَصَادِهِۦ ۖ (dan tunaikanlah haknya di hari memetik hasilnya) Ada pendapat mengatakan yang dimaksud adalah zakat biji-bijian dan buah-buahan. Pendapat lain mengatakan bahwa pemilik kebun wajib memberi orang yang hadir di waktu panen dari orang-orang miskin dengan ukuran satu genggam atau satu ikat atau ukuran lainnya. وَلَا تُسْرِفُوٓا۟ ۚ (dan janganlah kamu berlebih-lebihan) Yakni ketika makan atau ketika bersedekah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "141 Dialah Allah Yang telah menjadikan kebun-kebun dan pepohonan yang tinggi dan rimbun juga pepohonan yang tidak tinggi tanpa daun yang rimbun. Juga Dia telah menjadikan pohon korma, tanam-tanaman yang bermacam-macam buah dengan berbagai macam rasa dan aroma. Juga menjadikan zaitun dan delima yang serupa bentuk dan warnanya dan tidak sama rasanya, padahal dalam tanah yang sama dan air yang sama. Makanlah buahnya yang bermacam-macam itu bila dia berbuah meskipun belum masak, dan tunaikanlah zakatnya di hari memetik hasilnya dengan disedekahkan kepada fakir miskin. Janganlah kamu berlebih-lebihan dalam memakannya atau dalam menyedekahkannya. Sesungguhnya Allah tidak menyukai orang yang berlebih-lebihan dan melampaui batas syariat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menumbuhkan} menciptakan {tanaman-tanaman} kebun-kebun {yang merambat} menjalar di atas tanah seperti semangka {dan yang tidak merambat} menjulang tinggi di atas akarnya seperti pohon kurma {pohon kurma, tanaman yang beraneka ragam rasanya} buahnya {serta zaitun dan delima yang serupa dan tidak serupa. Makanlah buahnya apabila telah berbuah dan berikanlah haknya} tunaikanlah zakatnya {pada waktu memanennya. Dan janganlah berlebih-lebihan} Janganlah melampaui batas dalam memakan dan menginfakkannya {Sesungguhnya Allah tidak menyukai orang-orang yang berlebih-lebihan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141. Manakala Allah menjelaskan tindakan orang-orang musrik terhadap banyak tanaman dan binatang ternak yang dihalalkan oleh Allah untuk mereka, maka Allah menjelaskan nikmatNya kepada mereka dengan itu dan tugas mereka yang semestinya mereka lakukan pada tanaman dan binatang ternak, Dia berfirman, “dan Dia-lah yang menjadikan kebun-kebun,” maksdunya, kebun-kebun yang di dalamnya terdapat berbagai macam pohon dan tanaman yang berbeda-beda, “yang berjungjung dan tidak berjungjung.” Maksdunya, sebagian dari kebun itu memiliki penyangga-penyangga, dimana tanaman merambat melaluinya sehingga ia terangkat, dari bumi, dan sebagian lain tidak memiliki penyangga maka ia tumbuh melata di permukaan bumi. Ini mengandung isyarat banyaknya manfaat dan kebaikannya. Dan bahwa Allah mengajarkan kepada manusia bagaimana mereka menjungjung kebun-kebun itu dan menumbuhkannya. Dan Alah menumbuhkan “pohon kurma, tanam-tanaman yang bermacam-macam buahnya.” Maksdunya, semuanya disatu tempat, dan disiram dengan air yang sama, namun Allah membedakan rasa ini dan yang itu. Allah mengkuhsuskan pohon kurma dan tanaman pangan dengan berbagai bentuknmya dan manfaatnya yang banyak dan ia adalah sumber makanan manusia. Dan Allah menumbuhkan “zaitun dan delima yang serupa” pohonya, “namun tidak sama,” buah dan rasanya. seolah-olah ada yang bertanya, “ untuk apa Allah menunbuhkan kebun-kebun ini dan buah-buahan yang disebutkan sesudahnya?” maka Allah menjelaskan bahwa Allah menumbuhkannya untuk kebaikan manusia. Dia berfirman, “Makanlah dari buahnya.” Yakni kurma dan tanaman pangan “apabila dia berbuah dan tunaikanlah haknya di hari memetik hasilnya.” Maksdunya, tunaikanlah hak tanaman pangan yaitu zakat dengan nisab-nisab yang telah ditentukan dalam agama. Allah memerintahkan mereka membayarnya pada waktu panen, karena masa penen tanaman pangan ibarat perubahan masa, karena ia adalah waktu dimana hati orang-orang miskin menunggunya, maka pada saat itu membayarnya adalah mudah bagi para pemilik tanaman pangan, dan perkaranya pun jelas bagi yang membayarnya, sehingga menjadi jelaslah siapa yang membayar zakat dan siapa yang tidak membayarnya. FirmanNya, “Dan janganlah kamu berlebih-lebihan.” Ini meliputi larangan berlebih-lebihan dalam makan, yaitu yang melebihi batas dan kebiasaan. Ini juga termasuk larangan bagi pemilik tanaman untuk memakan dari tanamannya sampai pada batas merugikan zakat. Termasuk pula berlebih-lebihan dalam mengeluarkan hak tanaman di mana dia mengeluarkannya melebihi kewajiban atau merugikan diri atau keluarganya atau orang-orang yang memiliki hutang atasnya. Semua itu termasuk berlebih-lebihan yang dilarang, dibenci, tidak disukai bahkan dimurkai oleh Allah. Ayat ini mengandung dalil atas kewajiban zakit hasil buah-buahan dan bahwa ia tidak perlu haul (melewati masa satu tahun). Akan tetapi akan tetapi haulnya adalah saat panen pada tanaman pangan dan petikan kurma, dan bahwa zakatnya tidak berulang-ulang walaupun ia dimiliki oleh seseorang dalam waktu bertahun-tahun, jika bukan untuk perniagaan, karena Allah tidak memerintahkan untuk mengeluarkan zakatnya kecuali saat panen, bahwa jika ia terkenal musibah tanpa adanya unsur kelalaian dari pemiliknya maka dia harus menggantinya. Dia boleh makan dari tanaman dan kurma sebelum ia dizakati dan bahwa yang dimakan itu tidak dihitung ke dalam zakat, akan tetapi yang dizakati adalah harta yang biasa. Rasulullah pernah mengutus juru taksir untuk menaksir hasil kebun milik kaum Muslimin, dan Rasulullah memerintahkannya agar membiarkan untuk pemiliknya sepertiga atau seperempat menurut kebiasaan yang dimakan oleh pemiliknya dan selainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 141: Setelah Allah Ta'ala menyebutkan tindakan kaum musyrik terhadap apa yang Allah halalkan kepada mereka berupa tanaman dan hewan ternak, Allah Tabaaraka wa Ta'aala menyebutkan nikmat-Nya kepada mereka dan kewajiban mereka dalam hal tanaman berupa zakat. Seperti semangka. Yang tinggi berbatang seperti pohon kelapa. Padahal tempatnya sama dan air yang diserap sama Allah menciptakan semua itu untuk manfaat manusia. Yaitu 1/10 jika diairi dengan air hujan, aliran sungai dsb. atau 1/20 jika diairi dengan tenaga atau biaya. Dalam ayat ini terdapat dalil bahwa zakat pada tanaman dan buah-buahan tidak memakai haul, bahkan dikeluarkan ketika memetik hasilnya. Demikian juga menunjukkan bahwa jika tanaman itu tertimpa musibah sebelumnya tanpa ada sikap tafrith (meremehkan) dari pemilik tanaman dan buah, maka ia tidak menanggungnya, dan menunjukkan bolehnya memakan hasil tanaman atau buah sebelum dikeluarkan zakat, dan apa yang dimakan tersebut tidak dihitung ke dalam zakat, bahkan ia zakatkan tanaman atau buah-buahan yang masih ada. Di zaman Nabi shallallahu 'alaihi wa sallam, Beliau mengirim seorang yang menaksir (memperkirakan jumlah buah), caranya adalah seorang ahli taksir (khaarish) memperhatikan pohon dan seluruh buah yang kena zakat itu, setelah itu ia menyimpulkan, “Saya kira jumlah buahnya ada sekian dan telah mencapai nishab, maka kamu harus keluarkan dari pohon ini zakatnya sejumlah sekian.” Pengiriman seorang ahli taksir adalah untuk mengetahui amanah tidaknya pemilik tanaman atau buah. Sebagian ulama berpendapat bahwa mengirim ahli taksir hukumnya wajib, sedangkan yang lain berpendapat bahwa hukumnya sunat. Dianjurkan bagi ahli taksir yang mengambil zakat untuk menyisakan buat si pemilik buah 1/3 atau ¼ (1/3 jika jumlah buahnya banyak dan ¼ jika jumlah buahnya sedikit). Ada yang mengatakan, bahwa menyisakannya dari 1/10, ada juga yang mengatakan dari seluruh buah sebelum dikeluarkan 1/10-nya. Dengan memberikan semuanya atau melebihi kewajiban tanpa menyisakan untuk diri, keluarga dan para piutang. Termasuk pula memakannya secara berlebihan; melewati batas kewajaran atau memakannya secara berlebihan sehingga merugikan zakat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 141",
    "description": "Pada ayat-ayat yang lalu diterangkan bagaimana kaum musyrik mekah telah membuat ketetapan dan peraturan yang hanya berdasarkan pada keinginan hawa nafsu sendiri, bahkan mereka mengklaim bahwa peraturan itu berasal dari Allah. Pada ayat-ayat ini Allah menjelaskan lagi nikmat dan karunia-Nya yang diberikan kepada hambanya. Dan dialah, Allah, yang menjadikan dua jenis tanaman, yaitu tanaman-tanaman yang merambat dan yang tidak merambat. Allah pun menciptakan untuk manusia berbagai macam pepohonan seperti pohon kurma, tanaman yang beraneka ragam rasanya, zaitun dan delima yang serupa (bentuk dan warnanya) dan tidak serupa (rasanya). Wahai manusia! makanlah buahnya apabila ia berbuah dan jangan lupa berikanlah haknya, berupa zakat, pada waktu memetik hasilnya, tapi janganlah berlebihlebihan, dalam arti tidak terlalu pelit dan tidak terlalu boros, tetapi berada di antara keduanya. Sesungguhnya Allah tidak menyukai orang-orang yang berlebihan, yaitu dengan mengeluarkan harta bukan pada tempatnya. Allah pun menciptakan hewan ternak untuk kepentingan manusia. Dan di antara hewan-hewan ternak yang diciptakan Allah itu ada yang dijadikan pengangkut beban seperti unta, keledai, dan kuda dan ada pula yang untuk disembelih seperti kambing dan sapi. Wahai manusia, makanlah rezeki yang diberikan Allah kepadamu, yaitu yang Allah halalkan untukmu, dan janganlah kamu mengikuti langkah-langkah setan sebagaimana kaum musyrik yang menghalalkan apa yang diharamkan Allah dan mengharamkan apa yang dihalalkan Allah. Sesungguhnya setan itu musuh yang nyata bagimu."
  }
]