[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah menciptakan dari binatang-binatang ternak hewan yang diperuntukan guna mengangkut beban karena bentu fisiknya yang besar karena ukuran tubuhnya yang tinggi, seperti unta. Dan ada pula dari binatang-binatang ternak yang di peruntukan bukan untuk mengangkut beban, karena fisiknya yang kecil dan kedekatan habitatnya dengan tanah seperti sapi dan kambing. Makanlah dari apa-apa yang diperbolehkan oleh Allah bagi kalian dan yang diberikannya kepada kalian dari binatang-binatang ternak tersebut. Dan janganlah kalian mengharamkan apa yang Allah halalkan darinya, demi mengikuti jalan-jalan bisikan setan, sebagaimana diperbuat oleh kaum musyrikin. Sesungguhhya setan itu bagi kalian adalah musuh yang sangat tampak permusuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "142. Dan Dia lah yang menciptakan untuk kalian hewan-hewan ternak yang layak digunakan sebagai pengangkut barang, seperti unta yang sudah besar, dan hewan-hewan yang tidak layak digunakan sebagai pengangkut barang, seperti unta yang masih kecil atau kambing. Makanlah -wahai manusia- rezeki yang Allah berikan kepada kalian di antara hewan-hewan yang halal dikonsumsi. Dan janganlah kalian mengikuti langkah-langkah setan dalam menghalalkan apa yang Allah haramkan dan mengharamkan apa yang Allah, seperti yang dilakukan oleh orang-orang musyrik. Sesungguhnya setan itu bagi kalian -wahai manusia- adalah musuh yang nyata permusuhannya. Setan menginginkan agar kalian senantiasa durhaka kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "142. Allah menciptakan bagi kalian unta, sapi, kambing, dan domba; sebagian dapat digunakan sebagai tunggangan, sebagian sebagai pengangkut barang, dan sebagian lain untuk dimanfaatkan rambut dan bulunya sebagai karpet yang indah. Makanlah sebagian hewan ternak yang telah Allah berikan kepada kalian, dan janganlah kalian mengikuti jalan-jalan setan yang telah menghiasi bagi kalian perbuatan mengharamkan apa yang dihalalkan oleh Allah, karena dia merupakan musuh yang nyata bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "142. وَمِنَ الْأَنْعٰمِ حَمُولَةً وَفَرْشًا ۚ (Dan di antara hewan ternak itu ada yang dijadikan untuk pengangkutan dan ada yang untuk disembelih) Yakni Dia juga menciptakan bagi kalian hewan-hewan ternak, yaitu delapan jenis hewan yang telah disebutkan sebagai angkutan dan tikar. Makna (الحمولة) yakni hewan yang dipakai untuk memuat sesuatu diatasnya, yaitu unta. Dan makna (الفرش) yakni hewan yang diambil bulu dan rambutnya untuk dijadikan tikar yang dipakai manusia. Pendapat lain mengatakan (الحمولة) yakni unta dan (الفرش) yakni kambing. Dan pendapat lain mengatakan (الحمولة) yakni unta dewasa dan (الفرش) yakni unta yang masih kecil yang tidak dipakai untuk memuat barang. كُلُوا۟ مِمَّا رَزَقَكُمُ اللهُ (Makanlah dari rezeki yang telah diberikan Allah kepadamu) Yakni dari hewan-hewan ini. وَلَا تَتَّبِعُوا۟ خُطُوٰتِ الشَّيْطٰنِ ۚ (dan janganlah kamu mengikuti langkah-langkah syaitan) Sebagaimana yang dilakukan orang-orang musyrik yang mengharamkan apa yang tidak diharamkan Allah, dan menghalalkan apa yang tidak Dia halalkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "142 Allah telah menciptakan macam-macam hewan ternak sebagai alat angkut seperti unta dan kuda, maksudnya dijadikan manusia untuk membawa barang dalam jangka tertentu. Makanlah dari rezeki yang telah diberikan Allah kepadamu, yang Allah halalkan daging dan susunya dan janganlah kamu mengikuti langkah-langkah syaitan untuk mengharamkan dan menghalalkan semau mereka. Sesungguhnya syaitan itu musuh yang nyata bagimu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara hewan-hewan ternak itu ada yang dijadikan pengangkut beban} khusus untuk mengangkut seperti unta dan unta yang sudah besar{dan ada yang untuk disembelih} hewan kecil yang tidak digunakan untuk mengangkut seperti kambing {Makanlah dari apa yang diberikan Allah kepada kalian. Janganlah kalian mengikuti langkah-langkah} jalan {setan. Sesungguhnya dia adalah musuh yang nyata bagi kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "142. “Dan” Dia menciptakan dan menumbuhkan “diantara binatang ternak itu ada yang dijadikan untuk pengangkutan dan ada yang bukan untuk pengangkutan.” Maksudnya, sebagian kamu tunggangi dan kamu beri beban pada punggungnya. Sebagian lain tidak layak untuk ditunggangi dan dibebani karena belum cukup umur seperti anak unta dan sebagainya dan inilah yang disebut al-Farsy. Jadi binatang ternak dilihat dari sisi ia ditunggangi dan dibebani terbagi menjadi dua bagian ini. Adapun dari segi konsumsi dan manfaat yang lain maka semuanya dimakan dan diambil manfaatnya. Oleh karena itu Dia berfirman, “Makanlah dari rizki yang telah diberikan Allah kepadamu, dan janganlah kamu mengikuti langkah-langkah setan.” Yakni jalan-jalannya dan amal perbuatannya di mana di antaranya adalah pengharaman terhadap sebagian yang dirizkikan oleh Allah kepadamu. “Sesungguhnya setan itu musuh yang nyata bagimu.” Dia hanya memerintahkanmu kepada kerugian dan kesengsaraan abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 142: Seperti unta-unta yang besar. Adapula yang mengartikan “farsyaa” dengan unta-unta kecil atau kambing, karena seperti hamparan, di mana badannya tidak tinggi; dekat dengan bumi. Sehingga dari sisi bisa dipakai untuk pengangkutan dan bisa dinaiki terbagi dua; hamuulah (bisa dipakai untuk pengangkutan) dan farsyaa (tidak bisa dipakai pengangkutan). Yakni jalan dan amalan setan, yang di antaranya adalah mengharamkan sebagian rezki yang Allah berikan. Oleh karena itu perintahnya mengandung hal yang merugikan dan mencelakakan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 142",
    "description": "Allah pun menciptakan hewan ternak untuk kepentingan manusia. Dan di antara hewan-hewan ternak yang diciptakan Allah itu ada yang dijadikan pengangkut beban seperti unta, keledai, dan kuda dan ada pula yang untuk disembelih seperti kambing dan sapi. Wahai manusia, makanlah rezeki yang diberikan Allah kepadamu, yaitu yang Allah halalkan untukmu, dan janganlah kamu mengikuti langkah-langkah setan sebagaimana kaum musyrik yang menghalalkan apa yang diharamkan Allah dan mengharamkan apa yang dihalalkan Allah. Sesungguhnya setan itu musuh yang nyata bagimu. Allah lalu menjelaskan bahwa ada delapan ekor hewan ternak yang berpasangan, atau empat pasang hewan ternak; sepasang domba dan sepasang kambing. Katakanlah, wahai nabi Muhammad kepada kaum musyrik, sebagai kritikan kepada mereka, manakah yang diharamkan Allah di antara binatang itu' apakah yang diharamkan Allah dua yang jantan atau dua yang betina atau yang ada dalam kandungan kedua betinanya' terangkanlah kepadaku berdasar pengetahuan, yaitu suatu bukti dan keterangan dari kitab Allah atau keterangan dari para nabi-Nya bahwa Allah mengharamkan yang demikian jika kamu orang yang benar dan bukan membuat-buat ketetapan itu. \"."
  }
]