[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Binatang-binatang ternak tersebut yang dikaruniakan Allah kepada para hambaNya yang berupa unta, sapi dan kambing berjumlah delapan jenis binatang. Empat diantaranya dari jenis kambing, yaitu domba jantan dan betina, dan dari jenis kambing yang jantan dan bentina. Katakanlah (wahai rasul) kepada kaum musyrikin, ”apakah Allah yang mengharamkan jenis jantan dari dua jenis kambing tersebut?” apabila mereka mengatakan , ”betul”, sungguh mereka telah berbohong dalam ucapan mereka itu, Sebab mereka tidak mengharamkan seluruh jenis jantan dari domba dan kambing. Dan katakanlah kepada mereka, ”apakah Allah mengharamkan betina dari dua jenis domba tersebut?” apabila mereka mengatakan “ya” maka mereka juga telah berdusta. sebab mereka tidak mengharamkan seluruh betina dari Peranakan domba dan kambing. Dan katakanlah kepada mereka , ”dan apakah Allah mengharamkan apa yang ada di dalam kandungan dua betina dari jenis domba dan kambing?” apabila mereka berkata “betul”, maka mereka telah berdusta juga, karena mereka itu tidak mengharamkan seluruh isi kandungannya. Beritahukanlah kepadaku dengan satu bukti yang menunjukan kebenaran pendapat kalian tersebut, jika memang kalian berkata benar dalam perkara yang kalian nisbatkan kepada tuhan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "143. Allah menciptakan bagi kalian delapan jenis hewan; sepasang domba jantan-betina dan sepasang kambing. Tanyakanlah -wahai Rasul- kepada orang-orang musyrik, “Apakah Allah -Ta'ālā- mengharamkan domba dan kambing jantan karena jenisnya jantan?” Jika mereka menjawab, “Ya,” tanyakanlah kepada mereka, \"Lantas mengapa kalian mengharamkan domba dan kambing betina? Atau apakah Allah mengharamkannya karena jenisnya betina?” Jika mereka menjawab, “Ya,” tanyakanlah kepada mereka, “Lantas mengapa kalian mengharamkan domba dan kambing jantan? Ataukah Allah mengharamkan janin yang terkandung di dalam rahim domba dan kambing betina karena keberadaannya di dalam rahim?” Jika mereka menjawab, “Ya” tanyakanlah kepada mereka, “Lantas mengapa kalian membedakan antara janin yang terkandung di dalam rahim; terkadang mengharamkan jantannya dan sesekali mengharamkan betinanya? Jelaskanlah padaku -wahai orang-orang musyrik- apa landasan ilmu sahih yang kalian gunakan jika kalian sungguh-sungguh dengan klaim kalian bahwa pengharaman itu berasal dari Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "143. Alah mengingkari perbuatan orang-orang musyrik yang mengharamkan apa yang telah dihalalkan bagi mereka, untuk mengolok dan menjelaskan kebodohan mereka. Allah telah menciptakan delapan jenis hewan ternak berpasangan; dua jenis domba, jantan dan betina; dan dua jenis kambing, jantan dan betina. Hai Rasulallah, katakanlah kepada mereka: Apakah Allah mengharamkan dua hewan jantan dari dua jenis tersebut? Atau mengharamkan dua hewan betina dari dua jenis tersebut? Atau mengharamkan janin-janin yang ada di perutnya? Semua itu tidak Allah haramkan. sampaikan kepadaku hujjah dan Dalil atas perkataan kalian jika kalian adalah orang-orang yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "143. ثَمٰنِيَةَ أَزْوٰجٍ ۖ ((yaitu) delapan binatang yang berpasangan) Yakni delapan ekor binatang, setiap ekornya dari jantan dan betina memiliki pasangan masing-masing dan disebut juga dengan sepasang. مِّنَ الضَّأْنِ اثْنَيْنِ (sepasang domba) Yakni jantan dan betina. Dan domba adalah jenis kambing yang berbulu. وَمِنَ الْمَعْزِ اثْنَيْنِ ۗ( sepasang dari kambing) Yakni jenis kambing yang memiliki rambut dan memiliki ekor yang pendek. قُلْ ءَآلذَّكَرَيْنِ حَرَّمَ أَمِ الْأُنثَيَيْنِ (Katakanlah: “Apakah dua yang jantan yang diharamkan Allah ataukah dua yang betina) Yang dimaksud dengan dua yang jantan adalah satu pejantan domba dan satu pejantan kambing. Dan yang dimaksud dengan dua yang betina adalah satu domba betina dan satu kambing betina. Dan maksud dari ayat ini adalah sebagai bentuk pengingkaran kepada orang-orang musyrik terhadap apa yang mereka haramkan dari hewan-hewan ini. نَبِّـُٔونِى بِعِلْمٍ (rangkanlah kepadaku dengan berdasar pengetahuan) Yakni dengan ilmu yang berdasarkan kabar yang disampaikan oleh orang yang jujur dan benar. إِن كُنتُمْ صٰدِقِينَ (jika kamu memang orang-orang yang benar) Yakni jika kalian adalah orang-orang yang benar maka datangkanlah dalil dari kalamullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "143 Allah telah menciptakan delapan macam hewan ternak yang berpasangan, sepasang domba, jantan dan betina, dan juga sepasang kambing. Katakanlah wahai Nabi kepada mereka yang kadang mengharamkan hewan ternak jantan dan kadang juga yang betina, mereka sangka itu dari Allah: “Apakah dua yang jantan yang diharamkan Allah ataukah dua yang betina baik dari domba maupun kambing?, ataukah yang ada dalam kandungan dua betinanya?” Terangkanlah kepadaku dengan berdasar pengetahuan yang kau jadikan dalil atas pengharaman itu jika kamu memang orang-orang yang benar. Bagaimana jadinya itu bisa haram? Jika memang yang jantan itu haram, pasti semua jantan adalah haram. Begitu juga jika betina adalah haram maka semua yang betina adalah haram. Dan janin dalam hewan ternak itupun juga ada jantan juga bisa betina, lalu darimana jadinya bisa ada pengkhususan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ada delapan hewan ternak yang berpasangan} golongan {dari domba satu pasang} pasangan jantan dan betina {dan kambing satu pasang. Katakanlah,“Apakah yang Dia haramkan itu dua yang jantan, dua yang betina, atau yang ada dalam kandungan kedua betinanya. Terangkanlah kepadaku} beritahulah aku {berdasarkan pengetahuan jika kalian adalah orang yang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "143. Allah merinci binatang ternak yang Allah berikan sebagai nikmat bagi hamba-hambaNya, dan dijadikan halal serta baik, “(yaitu) delapan binatang yang berpasangan, sepasang dari domba,” jantan dan betina, “dan sepasang dari kambing,” jantan dan betina. Ini berarti empat. Semuanya termasuk yang Allah halalkan, tidak ada perbedaan antara yang satu dengan yang lainnya. Maka katakanlah kepada orang-orang yang memaksakan diri dengan mengharamkan sebagian darinya dan menghalalkan sebagian yang lain, atau mengharamkannya khusus buat kaum wanita, dan bukan kaum laki-laki dengan menekankan kepada mereka bahwa tidak ada perbedaan antara apa yang mereka haramkan dengan apa yang mereka halalkan. “Apakah dua yang jantan,” yakni dari domba dan kambing “yang diharamkan” oleh Allah? Lalu kamu tidak mengatakan itu dan kamu menolaknya? “Ataukah dua yang betina?” “Allah mengharamkan dari kambing dan domba,” juga bukan ucapanmu? Tidak pengharaman jantan saja dan tidak pula pengharaman betina saja dari kedua jenis tersebut. Maka (kemungkinan) yang tersisa adalah, jika Rahim mengandung jantan dan betina sekaligus atau yang tidak diketahui. Dia berfirman, “Ataukah,” kamu mengharamkan “janin yang ada dalam kandungan dua betinanya?” yakni betina domba dan betina kambing tanpa pembedaan antara janin jantan dan betina. Kamu pun tidak berpendapat demikian. Jika kamu tidak memilih satu dari tiga kemungkinan ini padahal tidak ada yang keempat, lalu ke mana arah pendapatmu? “Terangkanlah kepadaku dengan berdasar pengetahuan, jika kamu memang orang-orang yang benar” dalam ucapan dan klaimmu. Jelas sekali bahwa mereka tidak mungkin mengucapkan pendapat yang masuk akal kecuali satu dari tiga kemungkinan tersebut, padahal mereka tidak menyatakan satu pun darinya. Mereka hanya menyatakan bahwa sebagian binatang ternak yang mereka beri istilah tersendiri oleh mereka sendiri adalah haram untuk wanita bukan laki-laki atau diharamkan dalam kondisi tertentu saja atau ucapan yang sepertinya, yang diketahui tanpa ragu bahwa sumbernya adalah kebodohan rangkap, akal yang rusak dan pendapat yang miring, dan bahwa Allah tidak menurunkan ilmu terkait dengan apa yang mereka katakan. Mereka juga tidak memiliki hujjah dan bukti atas hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 143: Arti empat pasang, yaitu sepasang biri-biri (domba), sepasang kambing, sepasang unta dan sepasang sapi. Ini adalah hewan ternak yang diciptakan Allah untuk hamba-hamba-Nya, dan menjadikannya halalan thayyiban (halal lagi baik). Maksudnya domba jantan dan betina Maksudnya kambing jantan dan betina Yakni katakanlah wahai Muhammad kepada orang yang mengharamkan sesuatu saja tidak yang lain, atau mengharamkan sebagiannya bagi wanita tidak bagi laki-laki tanpa membedakan yang mana yang mereka halalkan dan yang mereka haramkan. Tentu kamu tidak berkata begitu; kamu tidak mengharamkan yang jantan murni dan yang betina murni. Kamu juga tidak berkata begitu. Jika kamu tidak mengatakan salah satu di antara ketiga macam ini, maka yang manakah yang kamu pilih? Dalam berkata dan dalam dakwa. Sudah maklum, bahwa mereka tidak mungkin mengatakan kata-kata yang diterima akal kecuali jika mereka memilih salah satu dari ketiga macam itu, namun ternyata mereka tidak memilih satu pun daripadanya. Mereka hanyalah mengatakan, bahwa sebagian ternak yang mereka beri istilah menurut hawa nafsu mereka adalah haram bagi wanita tidak bagi laki-laki atau haram pada waktu tertentu, dsb. Hal ini menunjukkan bahwa sumber aturan itu adalah kebodohan, akal yang kurang, dan pandangan yang rusak, dan bahwa Allah sama sekali tidak menerangkan keterangan terhadap ketetapan mereka itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 143",
    "description": "Allah lalu menjelaskan bahwa ada delapan ekor hewan ternak yang berpasangan, atau empat pasang hewan ternak; sepasang domba dan sepasang kambing. Katakanlah, wahai nabi Muhammad kepada kaum musyrik, sebagai kritikan kepada mereka, manakah yang diharamkan Allah di antara binatang itu' apakah yang diharamkan Allah dua yang jantan atau dua yang betina atau yang ada dalam kandungan kedua betinanya' terangkanlah kepadaku berdasar pengetahuan, yaitu suatu bukti dan keterangan dari kitab Allah atau keterangan dari para nabi-Nya bahwa Allah mengharamkan yang demikian jika kamu orang yang benar dan bukan membuat-buat ketetapan itu. \"dan dua pasang hewan lainnya adalah dari sepasang unta jantan dan betina dan sepasang sapi jantan dan betina. Katakanlah kepada kaum musyrik itu, manakah yang diharamkan Allah' apakah yang diharamkan dua unta atau sapi yang jantan atau dua unta atau sapi yang betina, atau yang ada dalam kandungan kedua betinanya' apakah kamu menjadi saksi ketika Allah menetapkan keharaman hewan-hewan ini bagimu' siapakah yang lebih zalim, yakni tidak ada yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah untuk menyesatkan orang-orang tanpa pengetahuan' sesungguhnya Allah tidak akan memberi petunjuk kepada orang-orang yang zalim."
  }
]