[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan empat Jenis-jenis hewan ternak lainnya ialah dua dari jenis unta, jantan dan betina, dan dua jenis dari sapi, jantan dan betina. Katakanlah (wahai rasul), ”apakah Allah mengharamkan dua jenis jantan atau dua jenis betina ataukah mengharamkan apa yang dikandung oleh dua betina baik jantan maupun betina? apakah kalian wahai kaum musyrikin, menyaksikan ketika Allah berpesan menetapkan pada kalian pengharaman binatang-binatang ternak tersebut? maka tidak ada orang yang lebih parah kezhalimannya daripada orang yang mengada-adakan kedustaan atas nama Allah untuk memalingkan manusia atas kebodohannya dari jalan petunjuk.” sesungguhnya Allah tidak memberikan taufik menuju jalan lurus bagi orang-orang yang berbuat melampaui batas, lalu berdusta atas nama Allah dan menyesatkan manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "144. Jenis delapan hewan lainnya ialah sepasang unta dan sepasang sapi. Tanyakanlah -wahai Rasul- kepada orang-orang musyrik, “Apakah Allah mengharamkan hewan itu karena berjenis jantan atau berjenis betina, atau sebab keberadaannya di dalam rahim? Ataukah kalian -wahai orang-orang musyrik- mengaku bahwa kalian hadir ketika Allah memerintahkan agar kalian mengharamkan jenis-jenis tertentu dari hewan-hewan tersebut? Maka tidak ada yang lebih besar kezalimannya dan tidak ada yang lebih besar dosanya daripada orang yang berbohong atas nama Allah dengan mengaku bahwa Allah telah mengharamkan sesuatu yang tidak pernah Dia haramkan, dengan tujuan untuk menyesatkan manusia dari jalan yang benar tanpa dilandasi ilmu yang benar. Sesungguhnya Allah tidak akan memberikan petunjuk kepada orang-orang zalim yang telah berdusta atas nama Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "144. Dan Allah menciptakan dua jenis domba, jantan dan betina; dan dua jenis sapi jantan dan betina. katakanlah kepada mereka: Apakah Allah mengharamkan dua hewan jantan dari dua jenis tersebut? Atau mengharamkan dua hewan betina dari dua jenis tersebut? Atau mengharamkan janin-janin yang ada di perutnya? Apakah kalian hadir dan menyaksikan perintah pengharaman yang dusta ini? Adakah orang yang lebih zalim daripada orang yang membuat kedustaan terhadap Allah tanpa memiliki hujjah agar dapat menyesatkan manusia dari syariat-Nya? Sesungguhnya Allah tidak akan memberi taufik kepada orang-orang yang melanggar larangan-larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "144. أَمْ كُنتُمْ شُهَدَآءَ إِذْ وَصَّىٰكُمُ اللهُ بِهٰذَا ۚ (Apakah kamu menyaksikan di waktu Allah menetapkan ini bagimu?) Yakni jika tidak ada dasar pengetahuan ditangan kalian maka apakah kalian dahulu hadir dan menyaksikan bahwa Allah menetapkan pengharaman ini? فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللهِ كَذِبًا(Maka siapakah yang lebih zalim daripada orang-orang yang membuat-buat dusta terhadap Allah) Yakni tidak ada orang yang lebih zalim dari orang yang berdusta terhadap Allah, yang mengharamkan sesuatu yang tidak diharamkan-Nya kemudian ia menisbatkannya kepada Allah sebagai bentuk kedustaan terhadap-Nya sebagaimana yang dilakukan oleh pembesar-pembesar orang-orang musyrik. Dalam ayat ini terdapat penjelasan tentang besarnya dosa orang yang mengharamkan seseuatu yang telah diciptakan-Nya tanpa landasan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "144 Allah telah menciptakan sepasang unta: yaitu unta jantan dan betina, juga sepasang lembu, jantan dan betina. Katakanlah wahai Nabi: “Apakah Allah mengharamkan unta jantan atau sapi jantan saja ataukah mengharamkan keduanya yang betina? Jika kalian memang tidak punya dasar atas pengharaman dan penghalalan ini, apakah kalian menyaksikan sendiri di waktu Allah menetapkan pengharaman ini bagimu? Maka siapakah yang lebih zalim daripada orang-orang yang membuat-buat dusta terhadap Allah, sehingga mereka menjadi sesuatu yang tidak jelas sebagai dasar hukum sebagaimana yang telah dilakukan orang-orang musyrik? Untuk menyesatkan manusia dari agama dan kebenaran tanpa dasar dan pengetahuan, namun hanya dengan kebodohan?” Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim kepada diri mereka sendiri, dan tidak memberi petunjuk atas kebenaran dan keadilan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Unta satu pasang dan sapi satu pasang. Katakanlah, “Apakah yang Dia haramkan dua yang jantan, dua yang betina, atau yang ada dalam kandungan kedua betinanya. Apakah kalian menjadi saksi} hadir {ketika Allah menetapkan bagi kalian} ketika menetapkan kepada kalian {hal ini. Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah untuk menyesatkan orang-orang tanpa pengetahuan” Sesungguhnya Allah tidak akan memberi petunjuk kepada orang-orang yang zalim."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "144. Kemudian Allah menjelaskan tentang unta dan sapi dengan penjelasan yang sama. Manakala Allah menjelaskan kebatilan dan kerusakan ucapan mereka, maka Allah berfirman kepada mereka dengan perkataan yang membuat mereka tidak mampu lolos dari konsekuensinya kecuali hanya dengan mengikuti syariat, “Apakah kamu menyaksikan di waktu Allah menetapkan ini bagimu?” maksudnya, yang tersisa padamu hanyalah sekedar klaim di mana kamu tidak mampu membuktikan kebenarannya. Yaitu hendaknya kamu berkata, “Sesungguhnya Allah menetapkan itu kepada kami dan mewahyukan sebagaimana Dia mewahyukan kepada rasul-rasulNya, bahkan Allah mewahyukan kepada kami dengan wahyu yang menyelisihi wahyu para Rasul dan yang disampaikan oleh kiab-kitab.” Ini adalah kedustaan yang diketahui oleh semua orang. Oleh karena itu Allah berfirman, “Maka siapakah yang lebih zhalim daripada orang-orang yang membuat-buat dusta terhadap Allah untuk menyesatkan manusia tanpa pengetahuan?” maksudnya, ditambah dengan kedustaan dan kebohongan atas nama Allah dengan maksud menyesatkan hamba-hamba Allah dari jalan Allah tanpa bukti, argument, akal dan dalil. “Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zhalim,” yang tidak memiliki kemauan selain menzhalimi, berlaku sewenang-wenang dan berdusta atas Nama allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 144",
    "description": "Dan dua pasang hewan lainnya adalah dari sepasang unta jantan dan betina dan sepasang sapi jantan dan betina. Katakanlah kepada kaum musyrik itu, manakah yang diharamkan Allah' apakah yang diharamkan dua unta atau sapi yang jantan atau dua unta atau sapi yang betina, atau yang ada dalam kandungan kedua betinanya' apakah kamu menjadi saksi ketika Allah menetapkan keharaman hewan-hewan ini bagimu' siapakah yang lebih zalim, yakni tidak ada yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah untuk menyesatkan orang-orang tanpa pengetahuan' sesungguhnya Allah tidak akan memberi petunjuk kepada orang-orang yang zalim. Pada ayat-ayat yang lalu kaum musyrik dikritik dengan celaan yang tajam karena mereka mengharamkan sebagian dari hewan ternak tan-pa ada larangan dari Allah atau petunjuk dari nabi-nabi mereka, pada ayat ini dijelaskan berbagai makanan yang diharamkan untuk kaum muslim dan kaum yahudi. Katakanlah kepada kaum musyrik yang membuat-buat aturan sendiri dan telah berdusta terhadap Allah, tidak kudapati di dalam apa yang diwahyukan kepadaku, sesuatu yang diharamkan memakannya bagi yang ingin memakannya, kecuali empat jenis saja, yaitu (1) daging hewan yang mati dengan sendirinya atau sebab alamiah, biasa disebut dengan bangkai, (2) darah yang mengalir, (3) daging babi'karena semua itu kotor'atau (4) hewan yang disembelih bukan atas nama Allah. Akan tetapi, barang siapa yang terpaksa memakannya bukan karena menginginkan dan tidak mele-bihi batas darurat, melainkan hanya sekadar untuk bisa bertahan dari kelaparan yang mengancam keselamatan jiwa, maka sungguh, tuhanmu maha pengampun, maha penyayang."
  }
]