[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), ”sesungguhnya aku tidak mendapati dalam wahyu yang diwahyukan oleh Allah kepadaku sesuatu yang haram atas orang yang hendak memakannya dari ternak-ternak yang kalian sebut haram, kecuali kalau bintang itu telah mati tanpa disembelih dahulu, atau darah yang mengalir atau daging babi, karena sesungguhnya semua itu najis. Atau binatang yang cara penyembelihannya keluar dari ketaatan kepada Allah , sebagimana yang terjadi pada sembelihan yang disebut nama selain Allah ketika disembelih. Barangsiapa yang terpaksa memakan barang-barang yang diharamkan ini disebabkan kelaparan yang melilit, sedang ia tidak ingin memakannya untuk menikmatinya dan tidak melewati batas ketentuan darurat, sesungguhnya Allah maha pengampun dan maha penyayang terhadapnya. Dan sungguh telah ditetapkan dalam Sunnah pengharaman semua binatang liar yang memiliki gigi taring, burung yang bercakar tajam, keledai yang di ternakan dan anjing."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Katakanlah -wahai Rasul-, “Aku tidak menemukan di dalam kitab suci yang Allah wahyukan kepadaku sesuatu yang diharamkan kecuali hewan yang mati tanpa disembelih, atau darah yang mengalir, atau daging babi karena statusnya najis dan haram, atau hewan yang disembelih atas nama selain Allah, seperti hewan yang disembelih sebagai persembahan untuk berhala mereka. Namun barangsiapa yang berada dalam kondisi darurat yang membuatnya terpaksa mengonsumsi makanan yang haram karena didera rasa lapar yang sangat, bukan sengaja ingin merasakan kelezatannya dan tidak melampaui batasan darurat, maka tidak ada dosa baginya untuk mengonsumsinya. Sesungguhnya Tuhanmu -wahai Rasul- Maha Pengampun lagi Maha Penyayang bagi orang yang terpaksa mengkonsumsi makanan yang haram itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "145. Allah memerintahkan Rasulullah untuk menjelaskan banyak hal yang dihalalkan Allah bagi hamba-hamba-Nya, dan beberapa hal yang diharamkan, serta menjelaskan bahwa hukum halal dan haram berasal dari Allah. Katakanlah kepada manusia: Aku tidak mendapati dalam al-Qur'an yang diwahyukan kepadaku makanan atau minuman yang diharamkan bagi seseorang kecuali hanya bangkai yang tidak melalui proses penyembelihan, darah yang mengucur, daging babi karena najis dan menjijikan, dan hewan yang disembelih untuk selain Allah. Dan barangsiapa berada dalam keadaan darurat yang dapat menyebabkannya binasa, maka tidak mengapa baginya memakan sedikit dari makanan-makanan yang diharamkan tersebut, tanpa ada niatan untuk memakan makanan haram, atau berlebihan dalam memakannya melebihi batas darurat yang dapat menghindarkannya dari kebinasaan. Sesungguhnya Allah Maha Mengampuni dan Maha Menyayanginya. Dan dalam sunnah Rasulullah dijelaskan pengharaman hewan buas yang bertaring dan burung yang bercakar (yang berburu mangsa dengan taring dan cakarnya), keledai, dan anjing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "145. قُل لَّآ أَجِدُ فِى مَآ أُوحِىَ إِلَىَّ مُحَرَّمًا (Katakanlah: “Tiadalah aku peroleh dalam wahyu yang diwahyukan kepadaku, sesuatu yang diharamkan) Ayat ini menunjukkan bahwa hal-hal yang haram hanya sebatas apa yang disebutkan didalamnya seandainya ayat ini bukan termasuk ayat makkiyah, dan telah turun ayat lain pada surat al-Maidah di Madinah yang menambah hal-hal yang diharamkan ini seperti, hewan yang mati kerena tercekik, terkena pukulan, terjatuh, tertanduk, yang dimakan hewan buas, dan khamr. Dan Rasulullah juga mengharamkan semua burung yang berburu dengan cakarnya, serta keledai piaraan. Namun terdapat riwayat dari Ibnu Abbas dan Aisyah bahwa tidak ada makanan lain yang diharamkan kecuali apa yang telah disebutkan Allah dalam ayat ini. عَلَىٰ طَاعِمٍ يَطْعَمُهُۥٓ (bagi orang yang hendak memakannya) Yakni baik itu makanan maupun minuman. إِلَّآ أَن يَكُونَ مَيْتَةً (ecuali kalau makanan itu bangkai) Yakni yang tidak disembelih. أَوْ دَمًا مَّسْفُوحًا(atau darah yang mengalir) Adapun darah yang tidak mengalir maka ia termaklumi semisal darah yang ada pada saluran darah setelah disembelih, dan termasuk juga daging yang terkena cipratan darah ketika proses penyembelihan. أَوْ لَحْمَ خِنزِيرٍ فَإِنَّهُۥ (atau daging babi — karena sesungguhnya) Yakni sesungguhnya babi itu. رِجْسٌ (kotor) Yakni najis. أَوْ فِسْقًا أُهِلَّ لِغَيْرِ اللهِ بِهِۦ ۚ( atau binatang yang disembelih atas nama selain Allah) Yakni yang disembelih untuk berhala-berhala. فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلَا عَادٍ(Barangsiapa yang dalam keadaan terpaksa, sedang dia tidak menginginkannya dan tidak (pula) melampaui batas) Tasfir dari ayat ini telah disebutkan pada surat al-Baqarah:173. Ibnu Abbas berkata: dahulu orang-orang jahiliyah memakan banyak jenis makanan dan enggan memakan banyak jenis makanan lainnya karena rasa jijik. Kemudian Allah mengutus Rasul-Nya, menurunkan kitab-Nya, dan menghalalkan apa yang dihalalkan dan mengharamkan apa yang diharamkan; maka apa yang telah diharamkan maka ia haram dan apa yang telah dihalalkan maka ia halal, dan apa yang dibiarkan dan tidak dijelaskan status keharamannya maka ia boleh dimakan. Kemudian Ibnu Abbas membacakan ayat ini. فَإِنَّ رَبَّكَ غَفُورٌ رَّحِيمٌ(maka sesungguhnya Tuhanmu Maha Pengampun lagi Maha Penyayang) Yakni bagi orang yang terpaksa untuk memakannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Belum disebutkan di dalam al-qur'an pengaraman daging hewan apapun yang disebutkan langsung namaya kecuali hewan babi, padahal waktu diturunkannya ayat ini jumlah babi di tanah Arab waktu belum terlampau banyak, bukan kah ini sesuatu yang aneh ? tapi hari ini kita telah megetahui bahwa daging babi adalah diantara daging hewan yang paling banyak sebarannya di penjuru dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145 Katakanlah wahai Nabi: “Aku tidak menemukan dalam Alquran yang diwahyukan kepadaku, sesuatu yang diharamkan bagi orang yang hendak memakannya, kecuali kalau makanan itu bangkai, atau darah yang mengalir atau daging babi karena sesungguhnya itu najis, atau binatang yang disembelih atas nama selain Allah sehingga disebut kefasikan. Sebab disebut fasik adalah keluar dari ketaatan dengan menyembelih tanpa menyebut asma Allah. Barangsiapa dalam keadaan terpaksa memakan sesuatu yang telah diharamkan karena situasi mendesak berupa lapar dan haus yang sangat, sedang dia tidak menginginkan makan yang haram dan tidak pula melampaui batas keterdesakan, maka sesungguhnya Tuhanmu Maha Pengampun atas yang engkau makan lagi Maha Penyayang.” Tidak akan menghukum perbuatan mereka sebab kondisi terdesak. Tidak ada pertentangan antara ayat ini dan Al-maidah ayat ketiga, sebab segala sesuatu yang mati tercekik, dipukul, yang jatuh, atau yang tertanduk atau yang diterkam binatang buas semua itu adalah bangkai. Thawus berkata: sesungguhnya masyarakat Jahiliyyah itu mengharamkan banyak hal dan menghalalkan banyak hal, sehingga turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah, “Aku tidak mendapati di dalam apa yang diwahyukan kepadaku sesuatu yang diharamkan} sesuatu yang diharamkan {bagi yang ingin memakannya} orang yang ingin memakannya {kecuali bangkai, darah yang mengalir} tumpah dan mengalir {daging babi karena ia najis} najis yang haram {atau yang disembelih secara fasik} tidak menaati aturan (penyembelihan {disembelih dengan menyebut selain Allah. Siapa pun yang terpaksa bukan karena menginginkannya} tanpa ingin mencari kenikmatan untuk memakannya {dan tidak melebihi} tidak melebihi batas darurat {maka sesungguhnya Tuhanmu Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145. Manakala Allah mencela orang-orang musyrik atas tindakan mereka yang mengharamkan yang halal, lalu mereka menisbatkan itu kepada Allah, dan Allah membatalkan ucapan mereka, maka Allah memerintahkan RasulNya untuk menerangkan sesuatu yang diharamkan oleh Allah kepada mereka agar mereka mengetahui bahwa sesuatu yang selain itu adalah halal. Siapa yang menisbatkan pengharamannya kepada Allah, maka dia adalah pendusta dan pembual, karena pengharaman tidak akan terjadi kecuali berasal dari sisi Allah melalui lisan RasulNya, dan Dia telah berfirman kepada RasulNya, “katakanlah, ‘Tiadalah aku peroleh dalam wahyu yang diwahyukan kepadaku, sesuatu yang diharamkan bagi orang yang hendak memakannya’. “ maksudnya, diharamkan “memakannya” tanpa melihat kepada diharamkan atau tidak diharamkan “pemanfaatan lain selain memakannya.” “Kecuali kalau makanan itu bangkai.” Bangkai adalah binatang yang mati tanpa disembelih secara syari, sesungguhnya ia tidak halal sebagaimana Firman Allah, Diharamkan bagimu (memakan) bangkai, darah (Al-Maidah:3). “Atau darah yang mengalir.” Yaitu darah yang mengalir dari hewan sembelihan pada wakutu ia disembelih. Ia adalah darah yang jika tertahan di dalam tubuh, maka ia membahayakan jika ia keluar maka bahaya “maka dagingnya” telah lenyap Mahfum lafadz ini adalah bahwa darah yang tersisa di dalam daging atau urat setelah penyembelihan adalah halal lagi suci. “Atau daging babi, karena sesungguhnya semua itu kotor.” Maksudnya, tiga perkara ini kootr yakni buruk, najis lagi membahayakan. Allah mengharmkan karena kasih sayangnya kepadamu dan kesucianmu dari perbuatan kotor. “Atau” binatang itu adalah “ binatang yang disembelih atas nama selain Allah.” Maksudnya, jika disembelih itu disembelih untuk untuk selain Allah berhala-berhala dan sesembahan-sesembahan yang di puja oleh orang-orang musrik, karena ia temasuk kefasikan yang merupakan penyimpangan dari ketaatan kepada Allah kepada kemaksiatan kepadaNya. Perkara-perkara yang di haramkan ini walaupun ia diharamkan akan tetapi bagi siapa yang dalam kondisi terpaksa, maksudnya, keterpaksaan dan kebutuhan mendesaknya untuk makan sesuatu darinya yang mana tidak lagi memiliki sesuatu yang halal, dan dia khawatir mati, “sedang dia tidak menginginkannya dan tidak pula melampuia batas.” Maksudnya, dia tidak ingin memakannya jika tidak dalam kondisi darurat atau tidak pula melebihi batas dengan makan melampui batas apa yang diperlukan, “maka sesungguhnya Tuhanmu Maha Pengampun lagi maha penyayang.” Maksudnya, Allah memaafkan kondisi orang tersebut. Para ulama berbeda pendapat tentang pembatasan yang diasebutkan dalam ayat ini meskipun ada perkara-perkara lain selainnya yang diharamkan dan tidak disebutkan padanya seperti binatang buas, burung pemilik cakar dan sebagiannya. Sebagian ulama menyatakan bahwa ayat ini turun sebeblum pengharaman selainnya yang lebih dari itu, maka pembatasan yang disebutkan dalam ayat ini tidak menafikan pengharaman yang hadir setelah itu, karena ia belum ada dalam sesuatu yang diwahyukan kapadanya pada waktu itu. Yang lain berpendapat bahwa ayat ini mencakup seluruh perkara-perkara yang diharamkan, sebagian darinya disebutkan secara jelas sedangkan yang lain di ambil dari makna dan keumuman illat, karena Firman Allah menjelaskan illat bangkai, darah dan daging babi atau yang terakhir saja, adalah “karena sesungguhnya semua itu kotor.” Ini adalah kriteria yang mencakup segala yang diharamkan karena semua perkara yang diharamkan adalah kootor lagi buruk. Ia termasuk perkara-perkara yang kotor lagi buruk yang diharamkan atas hamba-hambaNya demi melindungi mereka dan memuliakan mereka agar tidak berinteraksi dengan sesuatu yang buruk lagi kotor, dan perincian yang kotor yang diharamkan adalah diambil dari Sunnah, karena ia menafsirkan Al-Qur’an dan menjelaskan maksud darinya. Jika Allah tidak mengharamkan sesuatu makanan kecuali sesuatu yang telah disebutkan, dan pengharaman hanya bersumber kepada syariat Allah, maka hal itu menunjukan bahwa orang-orang musrik yang mengharamkan yang Allah rizkikan kepada mereka adalah pelaku kebohongan atas nama Allah dan menisbatkan sesuatu kepada secara dusta. Ayat ini mengadung beberapa kemungkinan kuat jika Allah tidak menyebutkan babi di dalamnya, hal tersebut disebabkan bahwa kontesnya adalah bantahan pendapat orang-orang yang telah disinggung di atas dimana mereka mengharamkan apa yang dihalalkan oleh Allah dan kelancangan mereka dalam memasuki pembahasan itu sesuai dengan godaan hawa nafsu mereka, dan itu pada binatang ternak secara khusus, yang mana dari binatang ternak itu tidak ada yang haram kecuali apa yang disebutkan di dalam ayat yaitu bangkai dan apa yang disembelih bukan karena Allah. Maka selain itu maka ia adalah halal. Mungkin disinggugnya babi disini berdasarkan kemungkinan ini, bahwa sebagian orang-orang bodoh mungkin memasukannya ke dalam binatang ternak, bahwa ia adalah salah satu jenis kambing sebagaimana hal itu dikira oleh sebagian orang-orang Nasrani dan orang-orang yang seperti mereka, lalau mereka mengembangkannya sebagaiamana menernakan binatang ternak, menghalalkannya dan tidak membedakannya dengan ternak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 145: Setelah Allah Ta’ala menyebutkan celaan terhadap kaum musyrik atas pengharaman mereka terhadap apa yang Allah halalkan dan penisbatan mereka kepada Allah, maka Allah Ta’ala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam untuk menerangkan kepada manusia apa yang diharamkan Allah agar mereka mengetahui mana yang halal dan mana yang haram. Para ulama berbeda pendapat dalam pembatasan yang disebutkan dalam ayat di atas karena makanan yang diharamkan Allah tidak hanya itu, seperti binatang buas yang bertaring dan burung yang bercakar pun haram dimakan. Di antara pendapat mereka tentang pembatasan di ayat tersebut adalah: - Ayat ini turun sebelum datang pengharaman yang selanjutnya, sehingga pembatasan ini tidaklah menafikan apa yang diharamkan setelahnya, karena Beliau tidak mendapatkan dalam wahyu yang diterima pada waktu itu pengharaman makanan selain yang disebutkan dalam ayat di atas. - Dalam ayat ini tercakup pula semua yang diharamkan, di mana sebagiannya berdasarkan dalil yang tegas, sedangkan sebagian lagi berdasarkan makna dan keumuman illat (sebab). Karena haramnya bangkai, darah yang mengalir, dan daging babi, adalah karena kotornya. Termasuk pula binatang kotor lainnya yang disebutkan dalam As Sunnah. - Sebagai bantahan terhadap orang-orang musyrik yang mengharamkan apa yang Allah halalkan atau menghalalkan apa yang Allah haramkan seenaknya saja, sehingga pembatasan tersebut tidak menafikan makanan haram lainya yang disebutkan dalam As Sunnah. Yakni darah yang keluar dari hewan ketika disembelih. Mafhum lafaz ini adalah bahwa darah yang menempel pada daging dan urat setelah disembelih adalah halal. Sebagian orang-orang bodoh dari kalangan Nasrani menganggap bahwa babi termasuk binatang ternak, sehingga mereka mengembangbiakkannya, menernaknya sebagaimana binatang ternak (unta, sapi, kambing dan domba), dan menganggapnya halal. Padahal babi bukan hewan ternak, dan ia adalah kotor. Kotor lagi berbahaya, di mana Allah mengharamkannya karena sayang kepada manusia sekaligus untuk membersihkan mereka dari hal yang kotor."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 145",
    "description": "Pada ayat-ayat yang lalu kaum musyrik dikritik dengan celaan yang tajam karena mereka mengharamkan sebagian dari hewan ternak tan-pa ada larangan dari Allah atau petunjuk dari nabi-nabi mereka, pada ayat ini dijelaskan berbagai makanan yang diharamkan untuk kaum muslim dan kaum yahudi. Katakanlah kepada kaum musyrik yang membuat-buat aturan sendiri dan telah berdusta terhadap Allah, tidak kudapati di dalam apa yang diwahyukan kepadaku, sesuatu yang diharamkan memakannya bagi yang ingin memakannya, kecuali empat jenis saja, yaitu (1) daging hewan yang mati dengan sendirinya atau sebab alamiah, biasa disebut dengan bangkai, (2) darah yang mengalir, (3) daging babi'karena semua itu kotor'atau (4) hewan yang disembelih bukan atas nama Allah. Akan tetapi, barang siapa yang terpaksa memakannya bukan karena menginginkan dan tidak mele-bihi batas darurat, melainkan hanya sekadar untuk bisa bertahan dari kelaparan yang mengancam keselamatan jiwa, maka sungguh, tuhanmu maha pengampun, maha penyayang. Dan khusus kepada orang-orang yahudi, kami haramkan semua hewan yang berkuku, yaitu ialah hewan-hewan yang jari-jarinya tidak terpisah antara yang satu dengan yang lain, seperti: unta, itik, angsa, dan lain-lain. Dan kami haramkan juga kepada mereka lemak sapi dan domba, kecuali yang melekat di punggungnya, atau yang dalam isi perutnya, yakni usus, dan lemak yang bercampur dengan tulang. Demikianlah kami menghukum mereka karena kedurhakaannya, bukan karena makanan itu haram zatnya seperti haramnya babi dan bangkai. Dan sungguh, kami mahabenar."
  }
]