[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sampaikanlah (wahai rasul), kepada kaum musyrikin, apa-apa yang kami haramkan atas kaum yahudi dari jenis binatang ternak dan burung, yaitu setiap binatang ternak yang jari-jari kakinya tidak teerpisah seperti unta, burung unta, lemak sapi dan kambing, kecuali lemak yang melekat pada punggung dan usus-usus atau yang bercampur dengan tulang belakang dan rusuk, dan lainnya. Pengharaman hal-hal tersebut atas kaum yahudi merupakan hukuman dari kami bagi mereka karena perbuatan-perbuatan buruk mereka.Dan kami maha benar dalam perkara yang kami berutahukan tentang mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "146. \"Dan Kami haramkan bagi orang-orang Yahudi hewan-hewan yang jari-jari kakinya tidak terpisah-pisah, seperti unta dan burung unta. Dan Kami haramkan bagi mereka lemak sapi dan kambing, kecuali yang menempel di punggungnya, yang ada di dalam usus, atau yang bercampur dengan tulang pantat dan pinggang. Kami telah membalas kezaliman mereka dengan mengharamkan hal-hal tersebut bagi mereka. Dan Kami benar-benar serius dengan semua hal yang Kami sampaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "146. Allah menyebutkan apa yang Dia haramkan bagi orang-orang Yahudi, yaitu hewan yang memiliki kuku yang jarinya tidak dapat terbuka seperti unta, burung unta, dan bebek; dan lemak sapi dan kambing kecuali yang menempel pada punggung dan usus atau yang bercampur dengan tulang. Pengharaman ini merupakan siksaan bagi mereka karena telah berlebih-lebihan dalam beragama dan melampaui batas. Kemudian Allah menegaskan kebenaran-Nya dalam menetapkan hukum-hukum dan menyampaikan berita-berita."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "146. وَعَلَى الَّذِينَ هَادُوا۟ (Dan kepada orang-orang Yahudi) Yakni Kami telah mengharamkan jenis-jenis makanan dalam Taurat adalah apa yang akan disebutkan ini, lalu dari mana orang-orang Jahiliyah mengharamkan sesuatu yang tidak disebutkan dalam Taurat maupun al-Qur’an. حَرَّمْنَا كُلَّ ذِى ظُفُرٍ ۖ (Kami haramkan segala binatang yang berkuku) Mujahid berkata: yang dimaksud adalah segala jenis hewan yang dapat terbuka jari-jari kakinya, dan hewan yang memiliki jari-jari kaki yang dapat terbuka maka orang-orang Yahudi boleh memakannya. Jari-jari ayam dan burung pipit dapat terbuka maka orang-orang Yahudi boleh memakannya, adapun hewan seperti unta, burung unta, dan angsa yang tidak memiliki jari-jari kaki yang terbuka maka orang-orang Yahudi tidak memakannya. وَمِنَ الْبَقَرِ وَالْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَآ(dan dari sapi dan domba, Kami haramkan atas mereka lemak) Yakni lemak yang terdapat pada ginjal dan lemak tipis yang ada pada lambung. Dan Allah mengecualikan lemak yang ada dipunggung, lemak ini tidak diharamkan atas mereka. أَوِ الْحَوَايَآ (atau yang di usus) Yakni saluran pada alat pencernaan tempat berkumpulnya kotoran hewan, maka jika terdapat lemak yang menempel pada bagian ini maka lemak tersebut tidak haram atas mereka. أَوْ مَا اخْتَلَطَ بِعَظْمٍ ۚ (atau yang bercampur dengan tulang) Yakni semua lemak yang menempel pada tulang pada bagian tubuh manapun, salah satunya adalah lemak yang ada pada ekor hewan karena ia menempel pada tulang ekor. ذٰلِكَ (Demikianlah) Yakni pengharaman itu. جَزَيْنٰهُم بِبَغْيِهِمْ ۖ (Kami hukum mereka disebabkan kedurhakaan mereka) Yakni kezaliman mereka. Dan hal-hal yang diharamkan atas orang-orang Yahudi ini tidak diharamkan dalam al- qur’an, maka ia termasuk makanan yang halal dan baik, namun diharamkan atas mereka sebagai hukuman atas kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "146 Pengharaman yang mereka haramkan itu bukan untuk orang-orang Jahiliyyah, itu semua tidak ada dalam Taurat dan Alquran. Namun Kami mengharamkan itu untuk orang-orang Yahudi di dalam Taurat segala binatang yang berkuku atau yang kuku mereka lunak seperti sapi dan domba, atau bebek dan angsa. Kami halalkan hewan yang jari-jarinya terbuka seperti ayam dan burung, dan Kami haramkan atas mereka lemak dari kedua binatang itu, selain lemak yang melekat di punggung keduanya atau yang di perut besar dan usus atau yang bercampur dengan tulang. Demikianlah Kami hukum mereka disebabkan kedurhakaan mereka; dan sesungguhnya Kami adalah Maha Benar dalam janji"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atas orang-orang Yahudi} orang-orang Yahudi {Kami mengharamkan semua yang berkuku} setiap sesuatu yang tidak terpisah jari-jarinya seperti unta dan burung unta {Kami mengharamkan juga atas mereka lemak sapi dan domba, kecuali yang melekat di punggungnya} lemak yang melekat pada punggungnya {yang ada dalam isi perutnya} lemak yang ada dalam usus {atau yang bercampur dengan tulang} lemak yang melekat pada tulang {Demikianlah Kami menghukum mereka karena kedurhakaan mereka} karena kezaliman mereka {Sesungguhnya Kami Maha benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "146. Semua yang diharamkan atas umat ini adalah sebagai penjaga dan perlindungan. Adapun apa yang dihramkan atas Ahli Kitab, maka sebagian lainya adalah baik, akan tetapi ia diharamkan atas mereka sebagai hukuman atas mereka. Oleh kkarena itu Dia berfirman, “Dan kepada orang-orang Yahudi, kami haramkan semua binatang yang berkuku.” Hal itu seperti unta dan sejenisnya, dan kami haramkan dari sebagian sapi dan kambing yaitu lemaknya, walaupun bukan seluruh lemak, akan tetapi lemak bokong dengan lemak tipis yang ada di usus. Oleh karena itu, ada pengecualian lemak yang halal darinya. FirmanNYa, “selain lemak yang melekat di punggung keduanya atau yang di perut besar.” Maksdunya, lemak yang melilit usus, “atau yang bercampur dengan tulang. Demikianlah” pengharaman atas orang-orang Yahudi. “kami hukum mereka tas kedurhakaan mereka.” Maksdunya, karena kezhaliman terhadap hak-hak Allah dan hak-hak hamba-hambaNya, maka Allah mengharamkan semua ini sebagai balasan dan hukuman atas mereka. “Dan sesungguhnya Kami adalah Mahabenar” dalam segala yang kami katakan, kami perbaut dan kami putuskan. Siapakah yang lebih benar pembicaraannya daripada Allah? Siapakhn yang lebih baik hukumnya daripada hukum Allah bagi orang-orang yang yakin?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 146: Yang dimaksud dengan binatang berkuku di sini ialah binatang-binatang yang jari-jarinya tidak terpisah antara satu dengan yang lain, seperti unta, itik, angsa dan lain-lain. sebahagian ahli tafsir mengartikan dengan hewan yang berkuku satu seperti kuda, keledai dan lain-lain. Yakni lemak bagian bokong dan tsarb (lemak tipis yang menutupi perut besar dan usus). Baik yang terkait dengan hak Allah maupun hak hamba Allah. Baik dalam berita maupun janji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 146",
    "description": "Dan khusus kepada orang-orang yahudi, kami haramkan semua hewan yang berkuku, yaitu ialah hewan-hewan yang jari-jarinya tidak terpisah antara yang satu dengan yang lain, seperti: unta, itik, angsa, dan lain-lain. Dan kami haramkan juga kepada mereka lemak sapi dan domba, kecuali yang melekat di punggungnya, atau yang dalam isi perutnya, yakni usus, dan lemak yang bercampur dengan tulang. Demikianlah kami menghukum mereka karena kedurhakaannya, bukan karena makanan itu haram zatnya seperti haramnya babi dan bangkai. Dan sungguh, kami mahabenar. Maka jika mereka mendustakan kebenaran mengenai makanan yang halal dan haram yang telah kamu jelaskan, wahai nabi Muhammad, katakanlah, demikianlah ketetapan tuhanmu yang mempunyai rahmat yang luas. Dan siksa yang dijatuhkan atau diberikan-Nya kepada orangorang yang berdosa tidak dapat dielakkan."
  }
]