[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jika mendustakan engkau (wahai rasul) para penentangmu dari kaum musyrikin, kaum yahudi, dan golongan lainnya, maka katakanlah kepada mereka, ”tuhan kalian memiliki rahmat yang luas. Dan tidak dapat disingkirkan siksaanNya dari kaum yang berbuat jahat dan melakukan perbuatan-perbuatan dosa, serta berbuat kesalahan-kesalahan”, Disini terdapat ancaman bagi mereka atas penentangan mereka terhadap rasul ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "147. Jika mereka mendustakanmu -wahai Rasul- dan tidak percaya kepada apa yang kamu bawa dari Rabbmu katakanlah sebagai dorongan bagi mereka, “Rabb kalian mempunyai kasih sayang yang luas. Dan salah satu bentuk kasih sayang-Nya kepada kalian ialah memberikan tenggang waktu kepada kalian dan tidak tergesa-gesa menimpakan azab-Nya kepada kalian.” Dan peringatkanlah mereka dengan mengatakan, “Sesungguhnya azab-Nya tidak dapat ditolak dari orang-orang yang berbuat maksiat dan dosa.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "147. Hai Nabi, jika orang-orang Yahudi dan orang-orang musyrik mendustakanmu tentang apa yang diwahyukan kepadamu maka katakanlah kepada mereka: Sesungguhnya Pencipta kalian memiliki rahmat yang luas; karena Dia tidak segera menyiksa kalian, namun tidak ada seorangpun yang dapat menjauhkan azab-Nya dari orang-orang yang melakukan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "147. فَإِن كَذَّبُوكَ (Maka jika mereka mendustakan kamu) Yakni jika orang-orang Yahudi mendustakan kamu. Pendapat lain mengatakan yang dimaksud adalah jika orang-orang musyrik yang membagi-bagi hewan ternak menjadi beberapa kelompok tersebut dan mengharamkan sebagiannya serta menghalalkan sebagian lainnya mendustakan kamu. فَقُل رَّبُّكُمْ ذُو رَحْمَةٍ وٰسِعَةٍ (katakanlah: “Tuhanmu mempunyai rahmat yang luas) Dan termasuk bagian dari rahmat-Nya adalah kelembutan-Nya kepada kalian sehingga tidak mempercepat hukuman untuk kalian. وَلَا يُرَدُّ بَأْسُهُۥ عَنِ الْقَوْمِ الْمُجْرِمِينَ (dan siksa-Nya tidak dapat ditolak dari kaum yang berdosa) Apabila Dia menurunkan siksa-Nya kepada mereka yang berhak dipercepat hukumannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagian ulama mengatakan : dapat difahami dari pemberian rahmat kepada orang yang sedang tertimpa satu hal yang buruk adalah bahwasanya harapan lebih kuat dibanding takut yang dimiliki oleh seorang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "147 Maka jika mereka orang-orang Yahudi dan musyrik mendustakan apa yang telah Kami wahyukan kepadamu wahai Nabi, maka katakanlah: “Tuhanmu mempunyai rahmat yang luas, Dia tidak segera mengazab dan lembut kepada kalian. Itu adalah kelembutan dalam mengajak mereka dalam keimanan dan mengambil hati mereka dan siksa-Nya tidak dapat ditolak dari kaum-kaum yang berdosa”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka jika mereka mendustakanmu, katakanlah, “Tuhan kalian mempunyai rahmat yang luas dan tidak dapat dihindari siksaNya} azabNya {dari kaum yang berdosa.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "147. Jika orang-orang musrik itu mendustakanmu, maka teruslah dakwah dengan targhib dan tarhib (anjuran dan ancaman). Katakan kepada mereka bahwa Allah, “mempunyai rahmat yang luas,” yakni, umum, yang meliputi seluruh makhluk, maka bersegeralah kepada rahmatNya dengan sebab-sebabnya dimana terpenting dan yang menjadi pijakannya adalah membenarkan syariat yang dibawa oleh Muhammad. “Dan siksaNya tidak dapat ditolak dari kaum yang berdosa,” yakni, orang-orang dengan dosa dan kejahatan yang manunpuk. Waspadalah terhadap dosa-dosa yang mengantarkan kepada azab Allah, dimana dosa paling besar dan yang menjadi kepada azab Allah, di mana dosa paling besar yang menjadi kepalanya adalah mendustakan Muhammad sholallohu alaihi wasallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 147: Yakni mendustakan apa yang kamu bawa, maka tetap teruslah berdakwah, menyampaikan targhib (dorongan) dan tarhib (ancaman). Kepada mereka. Dia tidak segera menyiksa mereka, bahkan mengajak mereka untuk beriman. Oleh karena itu capailah rahmat-Nya dengan mengerjakan sebab-sebabnya, terutama dengan beriman kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Ketika datang. Yakni yang banyak melakukan dosa. Oleh karena itu, berhati-hatilah terhadap dosa dan kemaksiatan karena akan mendatangkan azab Allah, terutama sekali adalah ketika mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 147",
    "description": "Maka jika mereka mendustakan kebenaran mengenai makanan yang halal dan haram yang telah kamu jelaskan, wahai nabi Muhammad, katakanlah, demikianlah ketetapan tuhanmu yang mempunyai rahmat yang luas. Dan siksa yang dijatuhkan atau diberikan-Nya kepada orangorang yang berdosa tidak dapat dielakkan. Orang-orang musyrik akan berkata kepada nabi Muhammad, jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya dengan yang lain, begitu pula nenek moyang kami, dan kami tidak akan mengharamkan apa pun yang dihalalkan Allah untuk kami. Demikian pula orang-orang sebelum mereka yang telah mendustakan para rasul dan mengharamkan apa yang dihalalkan Allah sampai mereka merasakan azab kami. Katakanlah, wahai nabi Muhammad, apakah kamu mempunyai pengetahuan yang dapat kamu kemukakan kepada kami' yang kamu ikuti hanya persangkaan belaka, dan kamu hanya mengira."
  }
]