[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang menyekutukan Allah berkata, ”seandainya Allah menghendaki kami dan bapak-bapak kami tidak mempersekutukannNya dan tidak mengharamkan sesuatu tanpa petunjuk dariNYa, niscaya kami tidak akan melakukannya.” Maka Allah membantah pernyataaan mereka dengan menjelaskan bahwa syubhat ini telah didengung-dengungkan oleh orang-orang kafir sebelum mereka dan mereka mendustakan dakwah para rasul dengan alasan itu, serta hal itu tetap mereka pegangi terus-menerus hingga akhirnya datanglah siksaan Allah menimpa mereka. Katakanlah (wahai rasul) kepada mereka, ”apakah (dalam pengharaman unta dan tanaman-tanaman yang kalian haramkan dan anggapan kalian bahwa Allah telah menghendaki kekafiran pada diri kalian, meridhainya dari kalian serta menyukainya dari kalian) kalian mempunyai pengetahuan yang benar yang dapat kalian perlihatkan kepada kami? kalian tidaklah mengikuti perkara-perkara agama, kecuali sekedar mengikuti prasangka belaka, dan tidaklah kalian kecuali hanya berdusta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "148. Orang-orang musyrik akan menjadikan kehendak dan ketentuan Allah sebagai alasan untuk membenarkan kemusyrikan mereka dengan mengatakan, “Seandainya Allah menghendaki kami dan para leluhur kami untuk tidak menyekutukan Allah dengan sesuatu, tentu kami tidak akan menyekutukan-Nya dengan apa pun. Dan seandainya Allah tidak menghendaki kami mengharamkan apa yang kami haramkan bagi diri kami tentu kami tidak akan mengharamkannya.” Dan alasan batil semacam itulah yang digunakan oleh orang-orang sebelum mereka yang mendustakan rasul-rasul mereka dengan mengatakan, “Seandainya Allah menghendaki kami untuk tidak mendustakan mereka (para Rasul) tentu kami tidak akan mendustakan mereka.” Mereka terus mendustakan para rasul mereka sampai mereka merasakan azab yang Kami timpakan kepada mereka.” Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, “Apakah kalian mempunyai dalil yang menunjukkan bahwa Allah merestui untuk kalian menyekutukan-Nya dengan sesuatu dan untuk menghalalkan apa yang diharamkan-Nya atau mengharamkan apa yang dihalalkan-Nya? Terjadinya tindakan itu dari kalian tidak serta merta menunjukkan bahwa Dia merestui perbuatan kalian. Sesungguhnya dalam masalah itu kalian hanya mengikuti prasangka saja. Sedangkan prasangka itu tidak dapat memberikan kebenaran sedikit pun, dan kalian hanya berbohong belaka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "148. Allah mengabarkan kepada Rasulullah syubhat-syubhat yang akan dikatakan oleh orang-orang musyrik dan mengingkari apa yang mereka katakan tersebut: Orang-orang musyrik itu akan berkata: Seandainya Allah menghendaki niscaya kami dan nenek moyang kami tidak akan berbuat kekafiran dan kesyirikan, atau mengharamkan sesuatu. Mereka beralasan dengan takdir, akan tetapi itu bukanlah alasan bagi mereka karena mereka telah diperintahkan untuk melakukan ketaatan. Allah mengolok mereka dengan berkata: Sebagaimana orang-orang musyrik itu mendustakan, demikian pula orang-orang kafir sebelum mereka mendustakan dan terus-menerus melakukan itu hingga turun kepada mereka azab yang pedih. Hai Rasulullah, katakanlah kepada mereka: \"Apakah kalian memiliki bukti atas pengharaman hewan ternak yang kalian lakukan agar kalian dapat menunjukkannya kepada kami? Landasan kedustaan kalian itu hanyalah prasangka yang bersandar pada kebodohan; tidak lain kalian hanyalah orang-orang yang berdusta terhadap Allah.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "148. سَيَقُولُ الَّذِينَ أَشْرَكُوا۟ (Orang-orang yang mempersekutukan Tuhan, akan mengatakan) Yakni dari orang-orang musyrik Quraisy dan lainnya. Yang mereka maksudkan adalah mereka ingin menunjukkan bahwa apa yang mereka lakukan adalah benar, karena seandainya tidak benar maka Allah pasti akan mengutus Rasul-Rasul-Nya kepada para nenek moyang mereka untuk menyuruh mereka meninggalkan kesyirikan, perbuatan mengharamkan apa yang tidak diharamkan Allah, dan menghalalkan apa yang diharamkan-Nya. كَذٰلِكَ كَذَّبَ الَّذِينَ مِن قَبْلِهِمْ (Demikian pulalah orang-orang sebelum mereka telah mendustakan (para rasul)) Yakni dengan hujjah seperti ini pula orang-orang sebelum mereka mendustakan para Rasul yang diutus kepada mereka. حَتَّىٰ ذَاقُوا۟ بَأْسَنَا ۗ (sampai mereka merasakan siksaan Kami) Yakni merasakan azab yang Kami turunkan kepada mereka. قُلْ هَلْ عِندَكُم مِّنْ عِلْمٍ (Katakanlah: “Adakah kamu mempunyai sesuatu pengetahuan) Yakni suatu bukti yang menunjukkan bahwa Allah meridhai kalian untuk menyekutukan-Nya serta menghalalkan dan mengharamkan sesuatu yang tidak Dia lakukan. Adapun hanya sekedar keburukan kalian yang terus berlangsung maka itu bukanlah bukti yang menandakan keridhaan-Nya. إِن تَتَّبِعُونَ إِلَّا الظَّنَّ (Kamu tidak mengikuti kecuali persangkaan belaka) Yakni mereka tidak mengikuti kecuali prasangka belaka yang merupakan asal dari kesalahan dan kebodohan. وَإِنْ أَنتُمْ إِلَّا تَخْرُصُونَ (dan kamu tidak lain hanyalah berdusta) Yakni kalian hanyalah berkhayal saja."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ لَوْ شَاءَ اللَّهُ مَا أَشْرَكْنَا وَلَا آبَاؤُنَا وَلَا حَرَّمْنَا مِنْ شَيْءٍ } \"Jika Allah menghendaki, niscaya kami dan bapak-bapak kami tidak mempersekutukan-Nya dan tidak (pula) kami mengharamkan barang sesuatu apapun\" Maka barangsiapa yang berdalil dengan taqdir atas dosa yang ia perbuat, lantas ia meninggalkan segala perintah Allah, dari taubat dan memohon ampunan kepada-Nya, dan memohon pertolongan kepada-Nya, dan memohon perlindungan kepada-Nya, serta memohon petunjuk kepada-Nya, maka sungguh dia adalah orang yang paling rugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "148 Orang-orang suku Qurays yang mempersekutukan Tuhan dan lainnya, akan mengatakan: “Jika Allah menghendaki, niscaya kami dan bapak-bapak kami tidak mempersekutukan-Nya dan tidak pula kami mengharamkan sesuatu apapun, dan Dia ridha kepada kami”. Mereka menawar takdir, dan mengklaim bahwa apa yang telah mereka lakukan adalah benar, padahal ini semua adalah dusta dan penyesatan mereka. Sebagaimana orang-orang muysrik itu berdusta maka demikian pulalah orang-orang sebelum mereka telah mendustakan para rasul sampai mereka merasakan siksaan Kami. Katakanlah kepada mereka wahai Nabi: “Apakah kamu mempunyai suatu bukti dalil atau pengetahuan yang menunjukkan bahwa Allah ridha atas apa yang kalian persekutukan, kalian halalkan dan kalian haramkan sehingga dapat mengemukakannya kepada Kami?” Maksudnya bahwa kalian tidak mempunyai pengetahuan apapun, dan cukup azab untuk kalian itu sebagai bukti bahwa Allah tidak ridho atas kalian. Kamu tidak mengikuti kecuali persangkaan belaka, dan kamu tidak lain hanyalah berdusta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang musyrik akan berkata,“Jika Allah menghendaki, tentu kami tidak akan menyekutukanNya, begitu pula nenek moyang kami, dan kami tidak akan mengharamkan apa pun.” Seperti itulah orang-orang sebelum mereka telah mendustakan sampai mereka merasakan siksa Kami} azab Kami {Katakanlah,“Apakah kalian mempunyai pengetahuan yang dapat kalian sampaikan} kalian kemukakan {kepada kami. Yang kalian ikuti hanya prasangka belaka dan kalian hanya mengira-ngira.”} berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "148. Ini adalah pemberitahuan dari Allah bahwa orang-orang musrik akan berdalil kepada Qadha dan Qadar atas kesyirikan mereka dan pengharaman terhadap seuatu yang dihalalkan oleh Allah, mereka menjadikan kehendak Allah yang meliputi segala sesuatu, baik yang baik maupun yang buruk sebagai dalil bagi mereka untuk menepis celaan yang mengarah kepada mereka, mereka telah mengatakan sesuatu yang Allah menyatakan bahwa mereka akan mengatakannya sebagai FirmanNYa dalam ayat lain, Dan berkatalah orang-orang musyrik: “Jika Allah menghendaki, niscaya kami tidak akan menyembah sesuatu apapun selain Dia,(An-Nahl:35). Allah memberitahukan bahwa dalil ini selalu digunakan oleh umat-umat yang mendustakan para Rasul untuk dakwah mereka, padahal dalil ini sama sekali tidak menolong dan membantu mereka. Begitulah mereka, sampai akhirnya Allah membinasakan mereka dan menimpakan azabNya, karena azabNya hanya akan menimpa orang-orang yang berhak menerimanya. Dari sini diketahui bahwa berdalil kepada Qadha dan Qadar atas kekufuran dan kemaksiatan adalah dalil yang rusak dan syubhat yang tidak laku ditinjau dari berbagai segi. Di antaranya: Dalil itu haruslah dalil yang berpijak kepada ilmu dan bukti. Adapun jika ia hanya berpijak kepada dugaan dan prasangka belaka yang tidak berguna sedikit pun di hadapan kebenaran, maka ia adalah dalil yang batil. Oleh karenanya, Dia berfirman, “Adakah kamu memiliki suatu pengetahuan sehingga kamu dapat mengemukakannya kepada kami.” Jika mereka memiliki ilmu –sementara mereka adalah musuh yang keras- niscaya mereka akan mengeluarkannya. Kenyataannya mereka tidak memiliki ilmu. “Kamu tidak mengikuti kecuali persangkaan belaka, dan kamu tidak lain hanya berdusta.” Siapa yang melandaskan dalil-dalilnya diatas dugaan dan prasangka, maka dia adalah orang yang mengada-ada lagi merugi. Bagaimana jika dia melandaskannya kepada kedengkian, kebencian, pengingkaran, dan kerusakan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 148: Ayat ini merupakan berita dari Allah, bahwa kaum musyrik akan beralasan dengan qadar terhadap syirk mereka agar mereka tidak disalahkan dan ternyata mereka mengatakannya. Di ayat ini, Allah memberitahukan bahwa alasan tersebut juga dipakai oleh umat-umat terdahulu yang sama mendustakan, namun hal itu tidaklah bermanfaat dan berguna bagi mereka. Yang demikian adalah karena kalau memang alasan mereka benar tentu dapat menghindarkan siksa dari mereka, dan Allah tidak akan menimpakan siksa kepada mereka. Dari sini diketahui bahwa alasan tersebut adalah batil. Di samping itu, batilnya beralasan dengan qadar adalah karena beberapa alasan berikut: - Alasan harus bersandar kepada ilmu dan bukti, bukan kepada persangkaan atau perkiraan. Jika bersandar kepada perkiraan yang sesungguhnya tidak membuahkan kebenaran, maka alasan tersebut batil. - Alasan yang kuat hanya pada Allah, di mana alasan-Nya disepakati oleh semua nabi dan rasul, semua kitab yang diurunkan, riwayat-riwayat dari Nabi, akal yang sehat, dan fitrah yang lurus. - Allah Ta’ala telah memberikan kepada setiap makhluk kemampuan dan kehendak yang dengannya ia dapat melakukan perbuatan yang dibebankan. Allah tidaklah mewajibkan di luar kemampuannya dan tidaklah mengharamkan sesuatu yang tidak bisa ditinggalkan. Oleh karena itu, beralasan dengan qadar ketika bermaksiat merupakan kezaliman murni. - Allah Ta’ala telah memerintah dan melarang manusia serta tidak membebani-Nya kecuali sesuai kesanggupannya, kalau sekiranya manusia dipaksa dalam mengerjakan sesuatu tentu ia tidak bisa berbuat apa-apa atau tidak bisa menolaknya, karena orang yang dipaksa tidak mampu melepaskan diri darinya dan hal ini jelas batil, oleh karena itu dalam Islam bila terjadi maksiat karena ketidaktahuan, lupa atau dipaksa maka ia tidak berdosa. - Allah tidaklah memaksa hamba, bahkan Dia menjadikan perbuatan mereka mengikuti pilihan mereka. Hal ini merupakan perkara yang sudah maklum dan dapat dirasakan, karena seseorang dapat membedakan antara perbuatan yang terjadi dengan pilihannya seperti berjalan, bekerja, dsb. dengan perbatan yang terjadi bukan atas pilihannya, seperti gemetar, terjatuh, dsb. meskipun semuanya terjadi atas kehendak Allah dan iradah-Nya. Jika Dia kehendaki akan terjadi, dan jika tidak maka tidak akan terjadi. Namun yang demikian bukanlah menunjukkan bahwa Alah ridha dengan perbuatan tersebut. Dan Allah hanyalah membalas perbuatan yang terjadi atas dasar pilihannya, dan tidak menghukum perbuatan yang terjadi bukan karena pilihan dan kehendaknya. - Jika sekiranya ada orang yang memukul mereka (orang yang beralasan dengan qadar ketika maksiat) atau mengambil hartanya, lalu orang yang memukul dan mengambil hartanya beralasan dengan qadar, tentu mereka akan menolaknya dan tidak akan menerima alasan itu. Berdasarkan keterangan di atas, maka alasan mereka dengan qadar sebenarnya telah mereka ketahui bukan sebagai alasan. Mereka beralasan dengannya hanyalah untuk menolak kebenaran. Yang menunjukkan bahwa Allah ridha dengan perbuatan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 148",
    "description": "Orang-orang musyrik akan berkata kepada nabi Muhammad, jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya dengan yang lain, begitu pula nenek moyang kami, dan kami tidak akan mengharamkan apa pun yang dihalalkan Allah untuk kami. Demikian pula orang-orang sebelum mereka yang telah mendustakan para rasul dan mengharamkan apa yang dihalalkan Allah sampai mereka merasakan azab kami. Katakanlah, wahai nabi Muhammad, apakah kamu mempunyai pengetahuan yang dapat kamu kemukakan kepada kami' yang kamu ikuti hanya persangkaan belaka, dan kamu hanya mengira. Katakanlah kepada mereka wahai nabi Muhammad, alasan yang kuat hanya pada Allah, yaitu alasan yang dapat mematahkan sangkaansangkaan buruk kalian. Dia-lah yang berhak memberi petunjuk bagi siapa saja yang dikehendaki-Nya. Maka kalau dia menghendaki, niscaya kamu semua mendapat petunjuk."
  }
]