[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada mereka, ”maka milik Allah lah hujjah-hujjah yang kuat yang mematahkan prasangka-prasangka kalian. Sekiranya Allah berkehendak, niscaya Dia akan memberikan taufik kepada kalian semua menuju jalan yang lurus.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "149. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, “Jika kalian tidak mempunyai dalil selain argumen-argumen yang lemah itu, sesungguhnya Allah mempunyai argumen yang kuat dan tidak terbantahkan, sehingga alasan-alasan yang kalian kemukakan akan dipatahkan dan syubhat-syubhat yang kalian jadikan sebagai pegangan akan terbantahkan. Dan sekiranya Allah berkehendak membimbing kalian semua -wahai orang-orang musyrik- ke jalan yang benar tentu Dia akan membimbing kalian semua ke jalan yang benar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "149. Katakanlah kepada mereka: \"Hanya milik Allah yang Maha Agung hujjah yang paling jelas dan paling kuat. Seandainya Dia menghendaki untuk memberikan kalian semua petunjuk menuju kebenaran niscaya Dia akan melakukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "149. قُلْ فَلِلّٰهِ الْحُجَّةُ الْبٰلِغَةُ ۖ (Katakanlah: “Allah mempunyai hujjah yang jelas lagi kuat) Di sisi-Nya akan terbantah segala alasan dan tertolak semua prasangka, syubhatm dan khayalan mereka. فَلَوْ شَآءَ (maka jika Dia menghendaki) Yakni menghendaki hidayah bagi kalian semua. لَهَدَىٰكُمْ أَجْمَعِينَ (pasti Dia memberi petunjuk kepada kamu semuanya)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "149 Katakanlah: “Allah mempunyai hujjah yang jelas lagi kuat, atau bukti yang kuat untuk menjelaskan kebenaran dengan mengutus para rasul untuk menyampaikan petunjuk kepada manusia, membenarkan keyakinan, dan menjelaskan hukum. Maka jika Dia menghendaki memberi hidayah kepada kalian maka pasti Dia memberi petunjuk kepada kamu semuanya”. Maka kalian tidak bisa memaksakan kehendak atau pilihan kalian, dan semua bantahan kalian juga atas kehendak Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Hanya milik Allahlah dalil yang kuat} yang sempurna dan mengena {kalau Dia menghendaki, niscaya Dia akan memberi petunjuk semua”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "149. Di antaranya adalah bahwa hujjah yang jeals lagi kuat adalah milik Allah yang tidak memberi peluang bagi siapa pun untuk beralasan, di mana para Nabi, para Rasul, kitab-kitab ilahiyah, hadits-hadits nabi, akal yang benar, fitrah yang lurus dan akhlak yang terpuji bersepakat di atasnya. Dari sini diketahui bahwa semua yang menyelisihi ayat yang tegas ini adalah batil karena lawan kebenaran tidak lain adalah kebatilan. Di antaranya adalah bahwa Allah memberi makhluk kemapuan dan keinginan yang dengannya dia mampu melakukan kewajiban yang dibebankan kepadanya. Allah tidak mewajibkan sesuatu kepada seseorang yang tidak mampu dia tunaikan, dan Allah juga tidak mengharamkan sesuatu yang tidak mampu dia tinggalkan. Maka setelah ini berdalil kepada Qadha dan Qadar adalah kezhaliman murni dan pengingkaran asal. Di antaranya adalah bahwa Allah tidak memaksa hamba-hamba atas perbuatannya (jabariyah), akan tetapi Dia menjadikan perbuatannya mengikuti keinginannya. Jika mereka mau maka mereka lakukan, jika mereka mau, maka mereka tinggalkan. Ini adalah perkara nyata, yang mengingkarinya hanyalah orang yang sombong yang mengingkari sesuatu yang nyata. Semua orang membedakan antara gerakan suka rela dengan gerakan terpaksa meskipun semuanya termasuk dalam kehendak dan keinginan Allah. Di antaranya adalah bahwa orang-orang yang berhujjah dengan Qadha dan Qadar atas perbuatan maksiat, maka mereka sendiri memiliki kontradiksi. Mereka tidak mungkin menetapkan hujjah mereka untuk seluruh kondisi. Seandainya ada orang yang berbuat buruk kepadanya dengan memukulnya atau mengambil hartanya lalu dia berdalil kepada Qadha dan Qadar, niscaya mereka tidak akan menerimanya, dan mereka akan marah besar. Benar-benar aneh, bagaimana mungkin dalam bermaksiat kepada Allah mereka berdalil kepada sesuatu yang membuat mereka marah, maka mereka tidak menerimanya? Di antaranya adalah bahwa berdalil kepada Qadha dan Qadar bukanlah target, mereka mengetahui bahwa ia bukanlah dalil, yang mereka targetkan adalah penolakan terhadap kebenaran. Mereka memandang kebenaran sebagai penyerang berbahaya, maka mereka harus membendungnya dengan segala sesuatu yang terlintas di benak mereka (walaupun mereka mengetaahui bahwa ia adalah salah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 149",
    "description": "Katakanlah kepada mereka wahai nabi Muhammad, alasan yang kuat hanya pada Allah, yaitu alasan yang dapat mematahkan sangkaansangkaan buruk kalian. Dia-lah yang berhak memberi petunjuk bagi siapa saja yang dikehendaki-Nya. Maka kalau dia menghendaki, niscaya kamu semua mendapat petunjuk. Katakanlah kepada orang-orang musyrik itu, wahai rasulullah, bawalah saksi-saksimu yang dapat membuktikan dan berani mengakui bahwa Allah mengharamkan beberapa binatang ternak ini seperti sa'ibah dan bahirah. Jika mereka memberikan kesaksian, yaitu kesaksian dusta, engkau jangan ikut pula memberikan kesaksian bersama mereka dan jangan membenarkan persaksian mereka. Jangan engkau ikuti keinginan orangorang yang mendustakan ayat-ayat kami dan orang-orang yang tidak beriman kepada akhirat, dan mereka mempersekutukan tuhan."
  }
]