[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum yang menyekutukan Allah dengan salainnya, ”sesungguhnya aku takut, jika aku mendurhakai tuhanku sehingga aku melanggar perintahNya dan aku sekutukan denganNya dalam ibadah, akan turun kepadaku siksaan besar pada hari kiamat. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Katakanlah -wahai Rasul-, “Sesungguhnya aku takut bila aku durhaka kepada Allah dengan melakukan apa yang diharamkan bagiku, seperti menyekutukan Allah dan lain-lain, atau meninggalkan apa yang diperintahkan kepadaku, seperti beriman kepada Allah dan ibadah-ibadah lainnya, maka Allah akan menyiksaku dengan azab yang sangat besar di hari Kiamat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Hai Rasulallah, Katakanlah kepada orang-orang yang menyekutukan Allah: Sesungguhnya jika aku bermaksiat kepada-Nya dengan menyembah selaincNya atau menyelisihi perintah dan larangan-Nya, aku takut Dia akan menurunkan azab dan kemurkaan-Nya kepadaku di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Katakanlah kepada mereka: “Sesungguhnya aku takut terhadap azabnya hari yang mengerikan yaitu hari kiamat, jika bermaksiat kepada Tuhanku dengan menyembah kepada selainNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah “Sesungguhnya aku takut azab pada hari yang besar jika aku durhaka kepada Tuhanku.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. “ katakanlah, ‘sesungguhnya aku takut azab yang besar (Hari kiamat), jika aku mendurhakai Tuhanku’.” Karena kamaksiatan dalam bentuk syirik mengharuskan kekekalan dalam neraka dan murka Allah yang Maha Perkasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 15: Di mana perbuatan syirk dapat menyebabkan pelakunya disiksa di neraka selama-lamanya dan mendapatkan kemurkaan Allah. Sebaliknya, orang yang dijauhkan dari azab pada hari itu, maka dialah orang yang diberi rahmat dan sebagai orang yang beruntung. Karena beribadah kepada selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 15",
    "description": "Katakanlah, wahai rasulullah, kepada orang-orang musyrik, aku benar-benar takut akan azab hari yang besar, hari kiamat, jika aku mendurhakai tuhanku dengan menyalahi perintah-Nya, lebih-lebih menyekutukan-Nya. Karena itu, aku tidak akan pernah berkompromi dengan segala bentuk kemusyrikan. Allah menjelaskan bahwa orang-orang yang dijauhkan dari azab Allah pada hari kiamat adalah orang-orang yang beruntung. Barang siapa di antara orang-orang beriman yang pada hari itu, hari kiamat, dirinya dijauhkan dari azab Allah dengan mendapat keridaan Allah dan keselamatan di akhirat, maka sungguh, Allah telah memberikan rahmat kepadanya, karena rahmat Allah merupakan pangkal keselamatan dunia akhirat. Dan itulah kemenangan sejatinya dalam hidup ini yang nyata pentingnya dan perlunya bagi manusia."
  }
]