[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”bawalah kemari para saksi kalian yang menyaksiakan bahwa sesungguhnya Allah Dia lah yang mengharamkan tanaman dan binatang yang kalian haramkan itu.” apabila mereka menyampaikan persaksian mereka (dengan cara berdusta dan curang) maka janganlah kalian mempercayai mereka. Dan janganlah engkau menuruti orang-orang yang memperuntukan hawa nafsu mereka lalu mendustakan ayat-ayat Allah dengan apa yang mereka katakana berupa pengharaman apa yang Allah halalkan dan menghalalkan apa yang Allah haramakan. Dan janganlah engkau mengikuti orang orang yang tidak mempercayai kehidupan akhirat dan tidak beramal untuknya, dan orang-orang yang menyekutukan tuhan mereka dengan menyembah yang lain bersamaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "150. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mengharamkan apa yang Allah halalkan dan mengklaim bahwa Allah-lah yang mengharamkannya, “Hadirkanlah saksi-saksi kalian yang menyaksikan bahwa Allah telah mengharamkan apa-apa yang kalian haramkan itu.” Jika mereka bersaksi tanpa dilandasi ilmu yang menyatakan bahwa Allah telah mengharamkannya, janganlah kamu -wahai Rasul- percaya pada kesaksian mereka, karena kesaksian mereka itu adalah kesaksian palsu. Dan janganlah kamu mengikuti orang-orang yang menjadikan hawa nafsu mereka sebagai sumber hukum. Mereka telah mendustakan ayat-ayat Kami ketika mereka mengharamkan apa yang Allah halalkan bagi mereka. Dan janganlah kamu mengikuti orang-orang yang tidak beriman kepada hari Akhir dan menyekutukan tuhan mereka serta menyetarakan-Nya dengan yang lain. Bagaimana mungkin orang yang berperilaku seperti itu kepada tuhannya bisa dijadikan sebagai panutan?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "150. Katakanlah kepada mereka: \"Datangkanlah kepadaku saksi bahwa Allah telah mengharamkan hewan-hewan ternak dan tanaman-tanaman yang kalian haramkan itu.\" Jika mereka mendatangkan saksi-saksi maka janganlah kamu mempercayai mereka, dan janganlah kamu mengikuti kepercayaan orang-orang yang mengingkari ayat-ayat dan tanda-tanda kebesaran Kami yang dapat didengar dan disaksikan itu, dan jangan mengikuti orang-orang yang mendustakan ayat dan menyekutukan Allah serta terus menerus dalam kesyirikan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "150. قُلْ هَلُمَّ شُهَدَآءَكُمُ (Katakanlah: “Bawalah kemari saksi-saksi kamu) Yakni bawa dan datangkanlah mereka. Allah memerintahkan mereka untuk mendatangkan saksi-saksi yang menyatakan bahwa Allah telah mengharamkan hal-hal tersebut. فَإِن شَهِدُوا۟ (Jika mereka mempersaksikan) Yakni bersaksi tanpa dasar ilmu, namun hanya berdasarkan spekulasi dan fanatisme. فَلَا تَشْهَدْ مَعَهُمْ ۚ (maka janganlah kamu ikut pula menjadi saksi bersama mereka) Yakni janganlah kamu mempercayai dan mengalah kepada mereka. وَلَا تَتَّبِعْ أَهْوَآءَ الَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَا (dan janganlah kamu mengikuti hawa nafsu orang-orang yang mendustakan ayat-ayat Kami) Yakni janganlah kamu mengikuti hawa nafsu mereka karena mereka adalah para pemimpin para pendusta ayat-ayat Kami, dan mereka juga kafir terhadap akhirat. وَهُم بِرَبِّهِمْ يَعْدِلُونَ (sedang mereka mempersekutukan Tuhan mereka) Yakni mereka menjadikan Tuhan memiliki tandingan dari makhluk-makhluk-Nya semisal berhala-berhala, lalu bagaimana kamu akan mengikuti orang-orang dengan pemahaman yang seperti itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "150 Katakanlah kepada mereka: “Bawa dan hadirkanlah kemari saksi-saksi yang kamu miliki yang dapat mempersaksikan bahwa Allah telah mengharamkan makanan yang kamu haramkan ini seperti keledai, unta saibah dan lainnya” Jika mereka mempersaksikan, maka janganlah kamu ikut pula menjadi saksi bersama mereka wahai nabi sebab itu hanyalah perkataan cela mereka. Dan janganlah kamu mengikuti hawa nafsu orang-orang yang mendustakan ayat-ayat Kami dan orang-orang yang tidak beriman kepada kehidupan akhirat, sedang mereka mempersekutukan Tuhan mereka dengan sesembahan lain atau menyeru kepada makhluk seperti berhala, kemudian mereka menyembah dan menyekutukannya dengan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Bawalah} hadirkanlah {saksi-saksi kalian} saksi-saksi kalian {yang dapat membuktikan bahwa Allah mengharamkan ini.” Jika mereka memberi kesaksian, kamu jangan memberi kesaksian bersama mereka. Janganlah mengikuti keinginan orang-orang yang mendustakan ayat-ayat Kami dan orang-orang yang tidak beriman kepada akhirat. Dan mereka kepada Tuhan mereka itu mempersekutukan} menyekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "150. Katakanlah kepada orang-orang yang mengharamkan apa yang dihalalkan oleh Allah dan menisbatkannya kepada Allah, “Datangkanlah saksi-saksimu yang memberi kesaksian bahwa Allah mengharamkan ini?” jika ucapan ini disodorkan kepada mereka maka mereka berada di antara dua perkara: bisa jadi mereka tidak menghadirkan seorang pun yang bersaksi atas itu. Sehingga klaim mereka adalah batil yang tak didukung dengan saksi dan bukti. Bisa jadi mereka mendatangkan saksi yang bersaksi untuk mereka dalam perkara ini, dan tidak mungkin ada yang memberi kesaksian dalam hal ini kecuali pendusta lagi pendosa yang kesaksiannya tidak diterima. Perkara ini bukan termasuk perkara yang mungkin ditetapkan dengan kesaksian orang yang adil. Oleh Karena itu, Allah melarang Nabinya dan para pengikutnya dari kesaksian ini. Dia berfirman, “JIka mereka mempersiapkan, maka janganlah kamu ikut (pula) menjasi saksi bersama mereka, dan janganlah kamu mengikuti hawa nafsu orang-orang yang mendustakan ayat-ayat Kami dan orang-orang yang tidak beriman kepada kehidupan akhirat, sedang mereka mempersekutukan Tuhan mereka.” Maksudnya, mereka menyamakan Allah dengan selainNya dari sesembahan-sesembahan dan sekutu-sekutu. Jika mereka tidak beriman kepada Hari Akhir, tidak bertauhid kepada Allah, maka keinginan mereka pun akan sama dengan akidah mereka, ia berkisar di antara kesyirikan dan pendustaan terhadap kebenaran. Maka sudah selayaknya kalau Allah melarang makhlukNya yang terpilih untuk mengikuti hawa nafsu seperti ini dan memberi kesaksian bersama para pendukungnya. Dari sini diketahui bahwa pengharaman mereka terhadap apa yang dihalalkan oleh Allah adalah berasal dari hawa nafsu yang menyesatkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 150: Kepada mereka yang mengharamkan apa yang Allah halalkan dan menisbatkannya kepada Allah. Karena mereka sudah keterlaluan. Karena keinginan mereka tidak jauh dari ‘aqidah mereka; tidak jauh dari syirk dan mendustakan Nabi Muhammad shallallahu 'alaihi wa sallam. Dari sini diketahui, bahwa pengharaman mereka terhadap apa yang Allah halalkan muncul dari hawa nafsu yang menyesatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 150",
    "description": "Katakanlah kepada orang-orang musyrik itu, wahai rasulullah, bawalah saksi-saksimu yang dapat membuktikan dan berani mengakui bahwa Allah mengharamkan beberapa binatang ternak ini seperti sa'ibah dan bahirah. Jika mereka memberikan kesaksian, yaitu kesaksian dusta, engkau jangan ikut pula memberikan kesaksian bersama mereka dan jangan membenarkan persaksian mereka. Jangan engkau ikuti keinginan orangorang yang mendustakan ayat-ayat kami dan orang-orang yang tidak beriman kepada akhirat, dan mereka mempersekutukan tuhan. Katakanlah, wahai nabi Muhammad kepada mereka yang menetapkan hukum sekehendak nafsunya, marilah aku bacakan apa yang diharamkan tuhan kepadamu, yaitu pertama, jangan mempersekutukan-Nya dengan apa pun dalam segala aspek kehidupanmu, baik dalam keyakinan di hati, perkataan, ataupun perbuatan. Kedua, berbuat baik-lah kepada ibu bapak-Mu, dan ketiga, janganlah membunuh anak-anakmu karena miskin. Kamilah yang memberi rezeki kepadamu dan kepada mereka. Keempat, janganlah kamu mendekati perbuatan yang keji, baik yang terlihat oleh orang lain atau yang dilakukan oleh anggota tubuhmu, ataupun yang tersembunyi di dalam hatimu atau tidak terlihat orang lain. Selanjutnya kelima, janganlah kamu membunuh orang yang diharamkan Allah kecuali dengan alasan yang benar, yaitu yang dibenarkan oleh syariat seperti qisha'sh, membunuh orang murtad, rajam, dan sebagainya. Demikianlah dia memerintahkan kepadamu agar kamu mengerti."
  }
]