[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada mereka, ”kemarilah, akau akan bacakan apa yang diharamkan tuhan kalian kepada kalian, yaitu; janganlah kalian menyekutukan sesuatupun dengan Allah dari makhluk-makhlukNya dalam beribadah kepadaNya, akan tetapi arahkanlah seluruh jenis ibadah kepadaNya semata, seperti khauf (rasa takut), pengharapan, do’ a dan jenis ibadah lainnya, dan hendaknya kalain berbuat baik kepada kedua orangtua kalian dengan berbakti dan doa serta jenis kebaikan lainnya. Dan janganlah kalian membunuh anak-anak kalian dikarenakan kefakiran yang kalian alami. Sesungguhnya Allah lah yang memberikan rizki kepada kalian dan kepada mereka. Dan janganlah kalian mendekati dosa-dosa besar yang tampak dan tersembunyi. Dan janganlah kalian membunuh jiwa yang diharamkan Allah untuk di bunuh, kecuali dengan sebab yang dibenarkan seperti dalam kondisi menuntut hukum qishash dari pembunuh, perzinaan yang dilakukan orang yang telah menikah, atau karena murtad dari islam. Hal-hal yang disebutkan termasuk perkara yang Allah melarang kalian darinya dan menuntut janji dari kalian untuk menjauhinya, serta perkara yang Allah memerintahkan dan berpesan kepada kalian dengannya, semoga kalian memahami perintah-perintah dan larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "151. Katakanlah -wahai Rasul- kepada manusia, “Kemarilah! Aku akan membacakan untuk kalian apa yang telah Allah haramkan. Dia telah mengharamkan kalian menyekutukan-Nya dengan makhluk-Nya; durhaka kepada orangtua kalian, justru kalian wajib berbakti kepadanya; dan membunuh anak-anak kalian karena takut miskin seperti yang dilakukan oleh orang-orang jahiliah. Karena Kami-lah yang memberikan rezeki kepada kalian dan kepada mereka. Allah juga mengharamkan kalian melakukan perbuatan keji, baik secara terang-terangan maupun tersembunyi. Dan Allah pun telah mengharamkan kalian membunuh orang yang nyawanya dilindungi oleh Allah, kecuali ada alasan yang dibenarkan, seperti orang yang berzina dan statusnya telah menikah atau orang yang murtad sesudah memeluk Islam. Hal-hal tersebut adalah wasiat Allah kepada kalian agar kalian mengerti perintah-perintah dan larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "151. Allah memerintahkan rasul-Nya untuk menyeru orang-orang musyrik menuju kebenaran dan membacakan kepada mereka apa yang telah Allah haramkan: \"Janganlah kalian menyekutukan Allah dengan makhluk-Nya; berbuat baiklah kepada kedua orang tua dalam perkataan dan perbuatan kalian; janganlah kalian bunuh anak-anak kalian karena takut mendapat kemiskinan atau aib dengan mengubur anak-anak perempuan kalian; jauhilah dosa-dosa besar, baik ketika kalian sedang sendiri maupun ketika di keramaian; dan janganlah kalian membunuh jiwa seseorang yang diharamkan Allah untuk dibunuh, kecuali membunuh dengan alasan yang benar seperti ketika menegakkan qishash; itulah hal-hal besar yang diharamkan, Allah memerintahkan kalian untuk menjalankannya dan menegaskan pengharamannya agar kalian mengerti dan memahami hukum-hukum tersebut. Dari Abdullah bin Mas'ud ia berkata, Rasulullah bersabda: \"Tidak halal menumpahkan darah seorang muslim kecuali (karena ia) melakukan salah satu dari tiga hal: membunuh orang, orang yang telah menikah namun berzina, dan keluar dari agama lagi memisahkan diri dari jamaah.\" (Shahih Bukhari 12/209, no.2878 -kitab diat, bab firman Allah: (أن النفس بالنفس), dan Shahih Muslim 3/1302 no.1676 -kitab qosamah, bab apa yang menjadi sebab dihalalkannya darah seorang muslim)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "151. قُلْ تَعَالَوْا۟ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمَ (Katakanlah: “Marilah kubacakan apa yang diharamkan atas kamu oleh Tuhanmu) Yakni aku akan membacakan untuk kalian ayat-ayat yang mengandung apa-apa saja yang diharamkan atas kalian. ألَّا تُشْرِكُوا۟ (janganlah kamu berbuat syirik) Yakni aku mengharuskan dan menghimbau kepada kalian untuk tidak mempersekutukan-Nya. وَبِالْوٰلِدَيْنِ إِحْسٰنًا ۖ (berbuat baiklah terhadap kedua orang ibu bapa) Yakni dengan berbakti kepada keduanya, dan menjalankan perintah dan larangannya. Dalam potongan ayat ini juga terdapat larangan untuk mendurhakai keduanya. وَلَا تَقْتُلُوٓا۟ أَوْلٰدَكُم مِّنْ إِمْلٰقٍ ۖ (dan janganlah kamu membunuh anak-anak kamu karena takut kemiskinan) Makna (الإملاق) yakni kemiskinan. Dahulu orang-orang jahiliyah membunuh anak laki-laki dan perempuan mereka karena takut akan jatuh miskin, dan mereka juga membunuh anak perempuan karena takut aib. وَلَا تَقْرَبُوا۟ الْفَوٰحِشَ (dan janganlah kamu mendekati perbuatan-perbuatan yang keji) Yakni perbuatan maksiat, diantaranya zina. مَا ظَهَرَ(baik yang nampak) Yakni yang terang-terangan. وَمَا بَطَنَ ۖ (maupun yang tersembunyi) Yang dilakukan secara rahasia. وَلَا تَقْتُلُوا۟ النَّفْسَ الَّتِى حَرَّمَ اللهُ إِلَّا بِالْحَقِّ ۚ (dan janganlah kamu membunuh jiwa yang diharamkan Allah (membunuhnya) melainkan dengan sesuatu (sebab) yang benar”) Dan sebab-sebab yang benar seperti membunuhnya untuk menegakkan qishash, atau hukuman bagi pelaku zina yang telah menikah sebelumnya, atau hukuman bagi orang yang murtad; sebab-sebab ini adalah sebab-sebab yang diizinkan oleh syariat. ذٰلِكُمْ وَصَّىٰكُم بِهِۦ (Demikian itu yang diperintahkan kepadamu) Yakni yang Allah perintahkan dan wajibkan atas kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَلَا تَقْتُلُوا أَوْلَادَكُمْ مِنْ إِمْلَاقٍ ۖ نَحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ } Ibnu Abbas, Qatadah. dan As-Saddi serta lain-lainnya mengatakan bahwa imlaq artinya kemiskinan. Dengan kata lain, janganlah kalian membunuh anak-anak kalian karena kemiskinan yang kalian alami. Dalam surat Al-Isra disebutkan oleh firman Allah Swt.: {وَلا تَقْتُلُوا أَوْلادَكُمْ خَشْيَةَ إِمْلاقٍ} \"Dan janganlah kalian membunuh anak-anak kalian karena takut kemiskinan\". [Al-Isra: 31] Artinya, janganlah kalian membunuh mereka karena takut jatuh miskin di masa mendatang. Karena itulah dalam firman selanjutnya disebutkan: {نَحْنُ نَرْزُقُهُمْ وَإِيَّاكُمْ} \"Kamilah yang akan memberi rezeki kepada mereka dan juga kepada kalian\" [ Al-Isra: 31 ] Dalam surat Al-Isra ini Allah mulai menyebutkan jaminan rezeki buat anak-anak mereka, karena itulah yang menjadi pokok permasalahannya. Dengan kata lain, janganlah kalian takut jatuh miskin karena memberi mereka makan; sesungguhnya rezeki mereka ditanggung oleh Allah. Adapun dalam surat Al-An'am ini, mengingat kemiskinan telah ada, maka yang disebutkan adalah seperti berikut: {نَحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ} \"Kami akan memberi rezeki kepada kalian dan kepada mereka\" [ Al-An’am: 151 ] Disebutkan demikian karena yang diprioritaskan adalah para orang tua. 2 ). { وَلَا تَقْتُلُوا النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلَّا بِالْحَقِّ ۚ ذَٰلِكُمْ وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَعْقِلُونَ } Ayat ini mengajarkan bahwa sesuai dengan akal seorang hamba dia dapat mendirikan segala perintah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "151 Katakanlah wahai Nabi kepada orang-orang musyrik dan lainnya: “Marilah kubacakan apa yang diharamkan atas kamu oleh Tuhanmu dengan benar yaitu: janganlah kamu mempersekutukan sesuatu dengan Dia dalam penyembahan, berbuat baiklah terhadap kedua orang tua ibu dan bapak kalian, dengan membaiki mereka dan mentaati mereka. Dan janganlah kamu membunuh anak-anak laki-laki kamu karena takut akan menjadi miskin. Dan takut terhina sehingga kalian mengubur hidup-hidup anak perempuan kalian sebagaimana yang telah dilakukan orang-orang Jahiliyyah, juga jangan kalian melakukan perbuatan keji. Kami akan memberi rezeki kepadamu dan kepada mereka, dan janganlah kamu mendekati perbuatan-perbuatan yang keji, yaitu dosa-dosa besar dan maksiat besar seperti zina, baik yang nampak maupun yang tersembunyi. Janganlah kamu membunuh jiwa yang Allah haramkan untuk membunuhnya melainkan dengan sesuatu sebab yang benar”. Seperti membunuh sebagai qishash merajam pelaku zina muhson, atau membunuh orang yang murtad. Yang telah disebutkan itu adalah yang telah diperintahkan dan diwajibkan kepadamu supaya kamu memahami perintah dan larangan Allah yang menuntun kepada kebaikan dan menghilangkan keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Kemarilah. Aku akan membacakan} membacakan {apa yang diharamkan Tuhan kalian kepada kalian, yaitu janganlah kalian menyekutukanNya dengan apa pun, berbuat baik kepada kedua orang tua, dan janganlah membunuh anak-anak kalian karena kemiskinan} kefakiran. Kami memberi rezeki kepada kalian dan kepada mereka. Janganlah mendekati perbuatan keji, baik yang terlihat maupun yang tersembunyi. Janganlah membunuh orang yang diharamkan Allah, kecuali dengan alasan yang benar. Demikian itu Dia memerintahkan kepada kalian agar kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151. Allah berfirman kepada NabiNya, “katakanlah,” kepada orang-orang yang mengharamkan sesuatu yang dihalalkan oleh Allah, “Marilah kubacakan sesuatu yang diharamkan atas kamu oleh Tuhanmu.” Dengan pengharaman yang bersifat umum, menyeluruh untuk semua orang, mencakup seluruh yang diharamkan, baik itu makanan, minuman, ucapan, dan perbuatan. “Janganlah kamu mempersekutukan sesuatu.” Tidak banyak, tidak pula sedikit. Hakikat syirik kepada Allah adalah disembahnya makhluk sebagaimana Allah disembah atau dia diagungkan atau dia diberi sebagian dari keistimewaan rububiyah dan uluhiyah. Jika seorang hamba meninggalkan seluruh kesyirikan, maka dia menjadi orang yang bertauhid dan ikhlas kepada Allah dalam seluruh kondisinya. Ini adalah hak Allah atas hamba-hambaNya yaitu hendaknya mereka menyembahNya dan tidak menyekutukanNya dengan sesuatu pun. Kemudian Allah memulai dengan hak paling kuat setelah hakNya. Dia berfirman, “Berbuat baiklah terhadap kedua orang ibu bapak,” dengan ucapan-ucapan yang baik dan perbuatan-perbuatan yang mulia. Semua perkataan dan perbuatan yang bermanfaat dan membahagiakan kedua orang tua, maka ia termasuk berbuat baik kepada keduanya. Jika ada perbuatan baik, maka hilanglah kedurhakaan. “Dan janganlah kamu membunuh anak-anak kamu.” Laki-laki dan perempuan “karena takut kemiskinan.” Maksudnya, disebabkan oleh kesulitan hidup dan kesempitan rizki sebagaimana hal itu terdapat pada masa jahiliyah yang keras lagi zhalim. Jika mereka dilarang membunuhnya dalam kondisi tersebut, sementara mereka adalah anaknya, maka membunuh mereka tanpa alasan atau membunuh anak orang lain adalah lebih layak dan lebih pantas untuk dilarang. “Kami akan memberi rizki kepadamu dan kepada mereka.” Maksudnya, Kami menjamin semua rizki. Bukan kamu yang memberi rizki kepada anakmu bahkan bukan kamu yang memberi rizki kepada dirimu. Mereka tidak membawamu kepada kesulitan. “Dan janganlah kamu mendekati perbuatan-perbuatan yang keji,” karena ia meliputi yaitu, dosa-dosa besar yang buruk, “baik yang Nampak diantaranya maupun yang tersembunyi.” Maksudnya, janganlah kamu mendekati yang Nampak darinya dan yang samar maupun yang berkaitan yang lahit dan yang batin. Larangan mendekati perbuatan keji adalah lebih mendalam daripada melakukannya karena ia meliputi larangan terhadap pengantarnya dan sarananya yang menjadi jembatan kepadanya. “Dan janganlah membunuh jiwa yang diharamkan oleh Allah.” Yaitu, jiwa yang islam, laki-laki dan wanita, besar dan kecil, orang baik dan orang fasik, dan jiwa orang kafir yang mendapatkan suaka perjanjian dan perdamaian. “melainkan dengan suatu sebab yang benar.” Seperti pezina muhshan, pembunuh jiwa dengan segaja dan orang yang murtad yang menyelisihi jamaah. “Demikian itu” yakni yang disebutkan, “yang diperintahkan oleh Tuhanmu kepadamu supaya kamu memahaminya.” Maksudnya, kamu memahami wasiat dari Allah kemudian kamu menjaganya, memelliharanya, dan melakukannya. Ayat ini menunjukan bahwa pemahaman seorang hamba bergantung kepada pelaksanaannya terhadap perintah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 151: Syirk adalah mengadakan tandingan bagi Allah, di mana ia beribadah dan mengagungkan selain Allah itu sebagaimana dia beribadah dan mengagungkan Allah, atau mengarahkan ibadah kepada selain Allah atau meyakini bahwa di samping Allah ada pula yang mengatur alam semesta. Baik dengan ucapan maupun dengan perbuatan. Oleh karena itu, setiap perkataan atau perbuatan yang memberi manfaat bagi orang tua atau menyenangkan keduanya, maka yang demikian termasuk berbuat baik. Yakni dosa-dosa besar yang dianggap keji, seperti zina, liwath (homoseks), dsb. Ada pula yang mengartikan, baik yang terkait dengan zhahir (nampak di luar) maupun yang terkait dengan hati dan batin. Larangan mendekati perbuatan keji lebih dalam daripada larangan melakukan perbuatan itu sendiri, karena larangan mendekati, berarti larangan mengerjakan pengantarnya dan wasilah (sarana) yang mengarah ke sana. Yakni orang muslim, laki-laki maupun wanita, anak-anak atau orang dewasa. Demikian juga orang kafir yang terikat dengan perjanjian. Maksudnya yang dibenarkan oleh syara' seperti qishash, membunuh orang murtad, dan rajam kepada pezina yang sudah menikah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 151",
    "description": "Katakanlah, wahai nabi Muhammad kepada mereka yang menetapkan hukum sekehendak nafsunya, marilah aku bacakan apa yang diharamkan tuhan kepadamu, yaitu pertama, jangan mempersekutukan-Nya dengan apa pun dalam segala aspek kehidupanmu, baik dalam keyakinan di hati, perkataan, ataupun perbuatan. Kedua, berbuat baik-lah kepada ibu bapak-Mu, dan ketiga, janganlah membunuh anak-anakmu karena miskin. Kamilah yang memberi rezeki kepadamu dan kepada mereka. Keempat, janganlah kamu mendekati perbuatan yang keji, baik yang terlihat oleh orang lain atau yang dilakukan oleh anggota tubuhmu, ataupun yang tersembunyi di dalam hatimu atau tidak terlihat orang lain. Selanjutnya kelima, janganlah kamu membunuh orang yang diharamkan Allah kecuali dengan alasan yang benar, yaitu yang dibenarkan oleh syariat seperti qisha'sh, membunuh orang murtad, rajam, dan sebagainya. Demikianlah dia memerintahkan kepadamu agar kamu mengertikeenam, dan janganlah kamu mendekati harta anak yatim'seperti melakukan hal-hal yang mengarah kepada pengambilan hartanya dengan alasan yang dibuat-buat'kecuali dengan cara yang lebih bermanfaat dan lebih menguntungkan'seperti menginvestasikannya agar berkembang, atau menjaga agar keutuhannya terjamin, termasuk juga membayar zakatnya jika telah mencapai satu nisab'sampai dia mencapai usia dewasa. Usia dewasa ditandai ketika anak yatim telah mampu mengelola hartanya sendiri dengan baik, dengan cara mengujinya terlebih dahulu. Pada saat inilah seorang pengelola harta anak yatim diperintahkan untuk menyerahkan hartanya itu. Pada saat penyerahan, perlu disaksikan oleh saksi yang adil sebagai pertanggungjawaban administrasi. Segala benih kecenderungan untuk mengambil harta anak yatim harus dicegah sejak awal kemunculannya. Wasiat berikutnya, ketujuh, dan sempurnakanlah takaran dan timbangan dengan adil. Tidak boleh merekayasa untuk mengurangi takaran atau timbangan dalam bentuk apa pun. Namun demikian, karena untuk tepat 100 % dalam menimbang adalah sesuatu yang sukar, maka kami tidak membebani seseorang melainkan menurut kesanggupannya, agar jangan sampai hal itu menyusahkan kedua belah pihak: pembeli dan penjual. Penjual tidak diharuskan untuk menambahkan barang yang dijual, melebihi dari kewajibannya, pembeli juga perlu berlega hati jika ada sedikit kekurangan dalam timbangan karena tidak disengaja. Ayat ini menunjukkan bahwa agama islam tidak ingin memberatkan pemeluknya. Wasiat kedelapan, apabila kamu berbicara, seperti pada saat bersaksi atau memutuskan hukum terhadap seseorang, bicaralah sejujurnya. Sebab, kejujuran dan keadilan adalah inti persoalan hukum. Kejujuran dan keadilan harus tetap dapat kamu tegakkan sekalipun dia, yang akan menerima akibat dari hukuman tersebut, adalah kerabat-Mu sendiri. Keadilan hukum dan kebenaran adalah di atas segalanya. Jangan sampai keadilan hukum terpengaruh oleh rasa kasih sayang terhadap keluarga. Semua itu bertujuan agar masyarakat bisa hidup damai, tenang, dan tenteram. Wasiat kesembilan, dan penuhilah janji Allah, yaitu janji untuk mematuhi ketentuan yang digariskan oleh-Nya, baik dalam bidang ibadah, muamalah, maupun lainnya. Memenuhi janji ini akan mendatangkan kebaikan bagi manusia. Demikianlah dia meme-rintahkan kepadamu agar kamu ingat dengan melakukan apa yang diperintahkan dan menghindari segala larangan, atau agar kamu sekalian saling mengingatkan."
  }
]