[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian mendekati wahai para penerima wasiat, harta anak yatim yang meningggal bapaknya sedangkan dia masih kecil kecuali dengan cara yang menyebabkan hartanya menjadi lebih baik dan dapat dia manfaatkan, sampai dia mencapai usia baligh dan berakala matang. Ketika dia telah mencapainya, maka serahkanlah hartanya kepadanya. Dan sempurnakanlah takaran dan timbangan dengan adil hingga sempurna dan penuh. Apabila kalian telah mengerahkan usaha-usaha kalian, maka tidak masalah bagi kalian dalam hal yang mungkin masih terjadi kekurangan padanya. Kami tidak membebani seseorang, melainkan sekedar kesanggupannya. Jika kalian berkata, maka usahakanlah sekuat tenaga untuk berbuat adil dalam berucap tanpa condong dari kebenaran, baik dalam menyampaikan berita, persaksian dan pemutusan hukum serta pemberian pembelaan. Walaupun obyek yang terkait dengan ucapan tersebut merupakan kaum kerabat dari kalian. Maka janganlah kalian condong kepadanya tanpa alasan yang benar. Dan penuhilah janji Allah yang mengikat kalian untuk komitmen dengan syariatNya. Hal-hal yang dibacakan kepada kalian ini yang berupa hukum-hukum, Allah memerintahkan kalian untuk melaksanakannya dengan harapan kalian mau mengingat-ngingat nasib kalian kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "152. Dan diharamkan bagi kalian mengusik harta anak yatim (yaitu anak yang ayahnya meninggal sebelum ia akil balig) kecuali dengan tujuan mengurus dan mengembangkan hartanya hingga ia balig dan benar-benar dewasa. Allah juga mengharamkan kalian mengurangi takaran dan timbangan. Kalian harus berlaku adil dalam mengambil dan menyerahkan barang dalam transaksi jual-beli. Kami tidak pernah memberikan beban kepada seseorang melainkan sebatas kemampuannya. Maka tambahan atau kekurangan yang sulit dihindari dalam urusan penakaran dan lain-lain tidak dikenakan sanksi apa pun. Allah juga mengharamkan kalian mengucapkan kata-kata yang tidak benar, baik dalam memberikan informasi maupun kesaksian, tanpa keberpihakan kepada kerabat atau teman. Dan Allah juga mengharamkan kalian melanggar perjanjian dengan Allah, jika kalian berjanji kepada Allah atau berjanji atas nama Allah. Hal-hal tersebut; Allah perintahkan kepada kalian dengan perintah yang kuat dengan harapan kalian mengingat akibat yang akan diterima di kemudian hari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "152. Hai para wali anak yatim, janganlah menggunakan harta anak-anak yatim kecuali untuk kebaikan dan mengembangkan harta mereka, hingga mereka sampai pada umur dewasa. Dan sempurnakanlah takaran dan timbangan dengan adil. Kami sekali-kali tidak membebankan kepada seseorang kecuali sesuai dengan kadar kemampuannya dalam setiap perintah dan larangan Kami. Dan jika kalian mengatakan suatu perkataan untuk memberi keputusan dalam urusan manusia atau menyampaikan kesaksian, kabar berita, atau syafaat, maka berbuat adillah dalam menjalankannya, meskipun orang yang tertuduh adalah kerabat kalian. Dan tunaikanlah setiap janji yang telah Allah perintahkan. Itulah perkara besar yang Allah perintahkan dan tegaskan kepada kalian, agar kalian mengambil pelajaran darinya. Ibnu 'Asyur berkata tentang firman Allah: Ayat ini meliputi segala muamalat dan interaksi antara manusia yang dilakukan dengan perantara perkataan, seperti kesaksian, pemberian keputusan, pemberian rekomendasi, penyampaian tuduhan, musyawarah, perdamaian diantara manusia, dan penyampaian keadaan barang-barang dalam suatu muamalat seperti keadaan barang jualan, barang sewaan, dan kekurangan-kekurangannya; dan dalam hal perjanjian, wasiat, sumpah, serta segala pujian dan cacian; semua ini termasuk sesuatu yang berlandaskan perkataan. (at-Tahrir wa at-Tanwir: 7/124)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "152. وَلَا تَقْرَبُوا۟ مَالَ الْيَتِيمِ (Dan janganlah kamu dekati harta anak yatim) Yakni janganlah kalian mencari-cari celah untuk mengambil harta anak yatim dengan cara apapun kecuali dengan cara yang lebih bermanfaat dari yang lainnya untuk menjaga harta tersebut. إِلَّا بِالَّتِى هِىَ أَحْسَنُ (kecuali dengan cara yang lebih bermanfaat) Yakni yang terdapat kebaikan dan manfaat bagi anak yatim itu dan dapat menambah harta tersebut. حَتَّىٰ يَبْلُغَ أَشُدَّهُۥ ۖ( hingga sampai ia dewasa) Yakni mencapai usia baligh dan berakal. Dan ini diketahui dari perilakunya dalam bermualamah dengan hartanya sesuai dengan perilaku yang ditunjukkan oleh orang yang berakal, bukan seperti ayng ditunjukkan oleh orang yang kurang akal dan suka berbuat mubadzir. وَأَوْفُوا۟ الْكَيْلَ وَالْمِيزَانَ بِالْقِسْطِ ۖ (Dan sempurnakanlah takaran dan timbangan dengan adil) Yakni adil ketika mengambil atau menerima saat transaksi jual beli. لَا نُكَلِّفُ نَفْسًا إِلَّا وُسْعَهَا ۖ (Kami tidak memikulkan beban kepada sesorang melainkan sekedar kesanggupannya) Yakni sesuai dengan kemampuan diri dalam menjalakankan setiap beban yang dibebankan, seperti beban untuk menyempurnakan takaran dan timbangan yang mungkin dilakukan tanpa ada kelebihan atau kekurangan. وَإِذَا قُلْتُمْ فَاعْدِلُوا۟ (Dan apabila kamu berkata, maka hendaklah kamu berlaku adil) Yakni dalam menyampaikan kabar berita, persaksian, penilaian terhadap seseorang maka hendaklah kalian berlaku adil didalamnya dan selalu berusaha untuk berlaku benar, dan janganlah berfanatik dalam masalah-masalah ini untuk orang yang dekat pada kalian atas orang yang jauh, dan condong kepada teman atas musuh, namun samaratakanlah perlakuan kalian kepada semua orang. وَلَوْ كَانَ(kendatipun ia) Yakni orang mendapat keuntungan dengan pernyataan kalian atau yang mendapat kerugian. ذَا قُرْبَىٰ ۖ (adalah kerabat(mu)) Yakni mempunyai hubungan kedekatan dengan kalian. وَبِعَهْدِ اللهِ أَوْفُوا۟ ۚ (dan penuhilah janji Allah) Yakni jika kalian membuat janji dengan Allah atau berjanji dengan orang lain atas nama Allah maka penuhilah janji itu. Dan barangsiapa yang memeluk Islam maka ia telah berjanji kepada Allah untuk mentaati-Nya. ذٰلِكُمْ (Yang demikian itu) Yakni hal yang telah disebutkan itu. وَصَّىٰكُم بِهِۦ (diperintahkan Allah kepadamu) Allah memerintahkan kalian dengan perintah yang kuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "152 Janganlah kamu mendekati harta anak yatim dengan mengambil atau menyia-nyiakan ataupun lainnya, kecuali dengan cara yang lebih bermanfaat berupa menginvestasikannya, atau membelanjakannya dalam kemanfaatan anak yatim itu sendiri sesuai keperluan, hingga sampai ia dewasa. Larangan untuk mendekati sesuatu lebih mencakup daripada mendekati barang itu sendiri. Lanjutkanlah mengurus harta anak yatim sampai dia dewasa, yaitu hingga dia bisa mempergunakan hartanya dengan benar. Sempurnakanlah takaran dan timbangan dengan adil baik dalam hal mengambil ataupun memberi, tanpa pengurangan maupun tambahan. Allah tidak memikulkan beban kepada sesorang melainkan sekedar kesanggupannya dalam mengemban beban itu. Dan apabila kamu berkata ataupun menghukumi sesuatu, maka hendaklah kamu berlaku adil, kendatipun ia adalah kerabatmu. Apabila kalian berjanji kepada Allah ataupun manusia maka penuhilah janji itu. Yang demikian itu diperintahkan Allah kepadamu agar kamu ingat dan mengambil pelajaran dari sebelum ini. Juga agar kalian menjalankan perintah Allah dan hati-hati dengan azab-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah mendekati} berurusan dengan {harta anak yatim, kecuali dengan cara yang lebih baik} dengan cara yang dapat memperbaiki dan mengembangkannya {sampai dia mencapai dewasa} masa balighnya {Sempurnakanlah takaran dan timbangan dengan adil} dengan adil {Kami tidak membebani seseorang melainkan sesuai kesanggupannya} kemampuannya {Ketika kalian berbicara, maka adillah} maka jujurlah {sekalipun dia kerabat. Penuhilah janji Allah. Demikian itu Dia memerintahkan kepada kalian agar kalian mengambil pelajaran.”} mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "152. “Dan janganlah kamu mendekati harta anak yatim,” dengan memakannnya atau menukarnya dengan landasan berat sebelah atau mengambil tanpa alasan, “kecuali dengan cara yang lebih bermanfaat.” Maksudnya, dengan cara yang denganya harta anak yatim menjadi baik dan mereka mengambil manfaat darinya. Ini menunjukan tidak bolehnya mendekati dan mengambil tindakan padanya dengan cara merugikan anak yatim atau dengan cara yang tidak merugikan dan tidak menguntungkan. “Hingga ia sampai,” maksudnya, anak yatim sampai, “dewasa.” Yakni, sampai ia dewasa, mengerti, dan mengetahui tindakan yang baik. Jika ia sudah menyampai usia dewasa, maka pada saat itu hartanya diserahkan kepadanya, dan dia sendirilah yang bertindak menurut pertimbangannya. Ayat ini mengandung petunjuk bahwa anak yatim tidak boleh bertindak sendiri pada hartanya, dan bahwa walinyalah yang mengurus hartanya dengan cara yang lebih baik, dan bahwa ketentuan ini berlaku sampai dia mencapai usia dewasa. “Dan sempurnakanlah takaran dan timbangan denag adil,” dengan amanat yang senpurna. Jika kamu telah bersungguh-sungguh, maka “Kami tidak akan memikul beban kepada seseorangpun melainkan sekedar kesanggupannya.” Maksudnya, berdasarkan kemampuannya tanpa menyulitkannya. Barangsiapa telah bersungguh-sungguh dalam memenuhi takaran dan timbangan kemudian dia kekurangan tanpa disegaja dan tanpa diketahuinya, maka Allah Maha Pengampun Lagi Maha Penyayang. Dengan ayat yang seperti ini dan ayat yang sepertinya para ulama ushul fiqih berdalil bahwa Allah tidak membebani sesuatu kepada seseorang melainkan kesanggupannya, dan barangsiapa yang bertakwa kepada Allah dan perintahNya dan melakukan sesuatu yang tidak mampu dilakukannya, maka tiada dosa atasnya pada selain itu. “Dan apabila kamu berkata” suatu perkataan yang dengannya kamu menilai manusia dan memutuskan perkara mereka serta kamu mengkritik pendapat dan keadaan, “maka hendakalah kamu berlaku adil” pada ucapanmu dengan menjungjung kejujuran kepada orang yang kamu cintai dan kepada orang yang kamu benci, obyektip tidak menyembunyikan apa yang semestinya dijelaskan, karena kecenderungan negatip terhadap orang yang kamu benci dalam pembicaraan atau pendapatnya adalah termasuk kezhaliman yang terlarang. Akan tetapi jika seorang ulama berbicara tentang pendapat ahli bid’ah, yang wajib atasnya adalah memberikan hak yang berhak. Hendaknya dia menjelaskan kebenaran dan kebathilan yang ada padanya dan menimbang kedekatan dan kejauhannya kepada kebenaran. Para puqaha menyebutkan bahwa hakim wajib berlaku adil kepada dua orang yang berseteru kepada perhatian dan perkataanya. “Dan penuhilah janji Allah.” Ini meliputi pernjanjian yang dia ambil atas hamba-hambaNya dalam bentuk menunaikan hak-hakNya dengan sebaik-baiknya, dan meliputi perjanjian yang disepakati antara manusia. Semuanya wajib dipenuhi dan haram membatalkan serta menelantarkannya. “Yang demikian itu,” yakni hukum-hukum di atas “diperintahkan Allah kepadamu agar kamu ingat” hukum-hukum yang telah dijelaskan kepadamu dengan sebaik-baiknya dan kamu mengetahui hikmah-hikmah dan hukum –hukum yang ada padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 152: Yakni memakannya atau menukarnya dengan maksud memperoleh keuntungan pribadi atau mengambil tanpa sebab. Yang memberikan maslahat baginya. Ayat ini menunjukkan tidak bolehnya mendekati harta aak yatim atau mengolahnya dengan pengolahan yang merugikan anak yatim. Dan menjadi cerdas. Ayat ini menunjukkan bahwa anak yatim sebelum dewasa dicegah melakukan tindakan terhadap hartanya, dan walinyalah yang mengelola hartanya dengan pengelolaan yang menguntungkan, dan bahwa pencegahan tindakan anak yatim terhadap hartanya berlaku sampai dewasa. Dan dengan tidak mengurangi. Oleh karena itu, jika seseorang berusaha memenuhi takaran dan timbangan, namun terjadi kekurangan tanpa ada sikap remeh darinya, maka sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun. Maksudnya tetap mengatakan yang sebenarnya meskipun merugikan kerabat sendiri. Maksudnya penuhilah segala janji yang diadakan antara kamu dengan-Nya berupa mengerjakan hak-haknya dan memenuhinya, demikian juga perjanjian yang diadakan antara kamu dengan orang lain. Semua perjanjian wajib dipenuhi dan haram dibatalkan atau diremehkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 152",
    "description": "Keenam, dan janganlah kamu mendekati harta anak yatim'seperti melakukan hal-hal yang mengarah kepada pengambilan hartanya dengan alasan yang dibuat-buat'kecuali dengan cara yang lebih bermanfaat dan lebih menguntungkan'seperti menginvestasikannya agar berkembang, atau menjaga agar keutuhannya terjamin, termasuk juga membayar zakatnya jika telah mencapai satu nisab'sampai dia mencapai usia dewasa. Usia dewasa ditandai ketika anak yatim telah mampu mengelola hartanya sendiri dengan baik, dengan cara mengujinya terlebih dahulu. Pada saat inilah seorang pengelola harta anak yatim diperintahkan untuk menyerahkan hartanya itu. Pada saat penyerahan, perlu disaksikan oleh saksi yang adil sebagai pertanggungjawaban administrasi. Segala benih kecenderungan untuk mengambil harta anak yatim harus dicegah sejak awal kemunculannya. Wasiat berikutnya, ketujuh, dan sempurnakanlah takaran dan timbangan dengan adil. Tidak boleh merekayasa untuk mengurangi takaran atau timbangan dalam bentuk apa pun. Namun demikian, karena untuk tepat 100 % dalam menimbang adalah sesuatu yang sukar, maka kami tidak membebani seseorang melainkan menurut kesanggupannya, agar jangan sampai hal itu menyusahkan kedua belah pihak: pembeli dan penjual. Penjual tidak diharuskan untuk menambahkan barang yang dijual, melebihi dari kewajibannya, pembeli juga perlu berlega hati jika ada sedikit kekurangan dalam timbangan karena tidak disengaja. Ayat ini menunjukkan bahwa agama islam tidak ingin memberatkan pemeluknya. Wasiat kedelapan, apabila kamu berbicara, seperti pada saat bersaksi atau memutuskan hukum terhadap seseorang, bicaralah sejujurnya. Sebab, kejujuran dan keadilan adalah inti persoalan hukum. Kejujuran dan keadilan harus tetap dapat kamu tegakkan sekalipun dia, yang akan menerima akibat dari hukuman tersebut, adalah kerabat-Mu sendiri. Keadilan hukum dan kebenaran adalah di atas segalanya. Jangan sampai keadilan hukum terpengaruh oleh rasa kasih sayang terhadap keluarga. Semua itu bertujuan agar masyarakat bisa hidup damai, tenang, dan tenteram. Wasiat kesembilan, dan penuhilah janji Allah, yaitu janji untuk mematuhi ketentuan yang digariskan oleh-Nya, baik dalam bidang ibadah, muamalah, maupun lainnya. Memenuhi janji ini akan mendatangkan kebaikan bagi manusia. Demikianlah dia meme-rintahkan kepadamu agar kamu ingat dengan melakukan apa yang diperintahkan dan menghindari segala larangan, atau agar kamu sekalian saling mengingatkan. Allah menjelaskan bahwa semua perintah dan larangan yang telah disebut dua ayat sebelum ini adalah jalan kebenaran yang harus diikuti. Jika tidak, maka akan menimbulkan petaka dalam kehidupan. Inilah wasiat yang kesepuluh: dan sungguh, inilah jalan-ku yang lurus, yaitu agama islam yang diridai Allah dengan semua kelengkapan ajarannya, mulai dari akidah, kekeluargaan, dan kemasyarakatan. Maka ikutilah jalan ini, karena inilah jalan yang benar yang bisa memberikan jaminan kebahagiaan dan ketenteraman hidup di dunia dan di akhirat. Jangan kamu ikuti jalan-jalan yang lain seperti agama-agama selain islam, kelompok-kelompok yang mengajarkan ajaran yang menyimpang dan sesat yang akan mencerai-beraikan kamu dari jalan-Nya. Setan terus berusaha untuk membelokkan manusia dari jalan lurus ini dengan segala cara. Demikianlah dia memerintahkan kepadamu agar kamu bertakwa dengan selalu menjaga diri agar jangan sampai celaka, yaitu dengan melaksanakan ajaran islam dengan baik dan benar, baik itu kewajiban atau larangan. Inilah bentuk kasih sayang Allah kepada manusia agar mereka bahagia."
  }
]