[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara perintah Allah kepada kalian, bahwa islam adalah jalan Allah yang lurus, maka tempuhlah jalan itu, janganlah kalian menempuh jalan-jalan kesesatan yang akan mencerai-beraikan kalian dan menjauhkan kalian dari jalan Allah yang lurus. Berjalan mengarah ke jalan yang lurus itulah yang diperintahkan Allah kepada kalian, supaya kalian dapat melindungi diri dari siksaanNYa dengan melaksanakan perintah-perintahNya dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "153. Dan Allah mengharamkan kalian mengikuti jalan-jalan kesesatan. Kalian harus mengikuti jalan Allah yang lurus dan tidak bengkok. Karena jalan-jalan kesesatan akan membawa kalian kepada perpecahan dan menjauh dari jalan yang benar. Perintah mengikuti jalan Allah yang lurus itu adalah wasiat dari Allah agar kalian takut kepada-Nya dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "153. Dan Allah mewasiatkan syariat Islam. Ia adalah agama yang diridhai oleh Allah, maka peganglah ia sekuat tenaga, dan janganlah mengikuti jalan-jalan yang menyelisihi Islam, karena itu akan menyesatkan kalian dan menjadikan kalian selalu terpecah belah. Itu adalah agama agung yang Allah perintahkan kepada kalian agar kalian dapat menjauhi azab. Dari Hamad, dari 'Asim, dari Abu wa'il ia berkata, Abdullah Bin Mas'ud berkata: Suatu hari Rasulullah membuat sebuah garis lurus bagi kami, lalu bersabda, ‘Ini adalah jalan Allah’. Dan 'Ashim meniru beliau dengan membuat garis lurus seraya berkata, ‘Ini adalah jalan Allah’. Kemudian beliau membuat garis lain pada sisi kiri dan kanan garis tersebut, lalu bersabda, ‘Ini adalah jalan-jalan (yang banyak), pada setiap jalan terdapat setan yang mengajak kepada jalan itu,’ kemudian beliau membaca ayat وَأَنَّ هَذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ) yakni: garis yang pertama; (وَلاَتَتَّبِعُوا السُّبُلَ), yakni garis-garis yang lain; (فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ ذلكم وصاكم به لعلكم تتقون) (diriwayatkan oleh Imam an-Nasa'i dalam tafsirnya 1/ 385 no.194; Imam Ahmad dalam musnadnya 1/435,465; Imam Ad-Darimi dalam sunannya 1/67-68, bab dibencinya mendahulukan pendapat akal; Imam Ibnu Hibban dalam shahihnya (Al-Ihsan 1/181 no.7); Imam Al-Hakim dalam mustadrak 2/318 dari banyak jalur dari hammad bin Zaid. Imam Hakim berkata tentang hadis ini: Sanadnya shahih namun Imam Bukhari dan Muslim tidak meriwayatkannya. Dan Syekh al-Albani menghasankan sanadnya dalam kitab dzilal al-Jannah 1/13)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "153. وَأَنَّ هٰذَا صِرٰطِى مُسْتَقِيمًا (dan bahwa (yang Kami perintahkan ini) adalah jalan-Ku yang lurus) Yakni jalan yang mengantarkan kepada keridhaan-Ku, yaitu agama Allah. Kemudian Allah memerintahkan mereka untuk mengikuti jalan tersebut dan melarang mereka mengikuti jalan yang lain. السُّبُلَ (jalan-jalan (yang lain)) Yakni agama-agama lain dengan jalannya yang bermacam-macam. فَتَفَرَّقَ بِكُمْ (karena jalan-jalan itu mencerai beraikan kamu) Yakni yang membelokkan kalian. عَن سَبِيلِهِۦ ۚ (dari jalan-Nya) Yakni dari jalan Allah yang lurus yaitu agama Islam. Adapun jalan-jalan yang lain meliputi agama Yahudi, Nasrani, Majusi, dan agama-agama lainnya, serta segala bid’ah dan kesesatan yang berlandaskan hawa nafsu. Ibnu Mas’ud berkata: “Rasulullah pernah membuat sebuah garis dengan tangannya, kemudian ia bersabda: “ini merupakan jalan Allah yang lurus”, lalu ia membuat garis-garis yang lain di sisi kanan dan sisi kiri garis pertama tersebut, kemudian bersabda: “dan tidaklah satu dari garis-garis ini kecuali terdapat setan yang menyeru kepadanya”, lalu ia membaca ayat (وأن هذا صراطي مستقيما)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnu Mas’ud Radhiyallahu anhu pernah ditanya, “Apa itu as-shirât al-mustaqîm?” Beliau radhiyallahu anhu menjawab, “Yaitu jalan yang kami ditinggalkan oleh Nabi Shallallahu ‘alaihi wa sallam dipangkalnya dan jalan tersebut berujung di surga, disamping kiri dan kanan jalan tersebut terdapat banyak jalan-jalan kecil. Nabi Shallallahu ‘alaihi wa sallam telah menjelaskan jalan ini kepada para Shahabatnya dengan menggambarkan garis satu garis lalu Beliau Shallallahu ‘alaihi wa sallam menggambar dua buah garis dari arah sebelah kanan (garis yang pertama) dan menggambara dua garis lainnya dari arah sebelah kiri (garis yang pertama) Kemudian setelah itu, Rasûlullâh Shallallahu ‘alaihi wa sallam meletakkan tangan Beliau Shallallahu ‘alaihi wa sallam di atas garis hitam yang pertama dan mengatakan, “Ini adalah jalan Allâh Azza wa Jalla .” Lalu Beliau Shallallahu ‘alaihi wa sallam membaca ayat berikut: { وَأَنَّ هَٰذَا صِرَاطِي مُسْتَقِيمًا فَاتَّبِعُوهُ ۖ وَلَا تَتَّبِعُوا السُّبُلَ فَتَفَرَّقَ بِكُمْ عَنْ سَبِيلِهِ } \"Dan bahwa (yang kami perintahkan ini) adalah jalan-Ku yang lurus, maka ikutilah Dia! Dan janganlah kamu mengikuti jalan-jalan (yang lain), karena jalan-jalan itu mencerai beraikan kamu dari jalannya\". [ Al-An’am : 153 ] 2 ). Sesunguhnya kita semua adalah pekerja keras untuk menghadap kepada Allah, tiada pilihan lain bagi manusia selamanya! adapun wasiat Allah yang menjelaskan tentang shirat al-mustaqim dalam ayat ini adalah sebagai petunjuk bagi semesta alam, agar kerja keras yang mereka lakukan berjalan dalam rangka menggapai ridho Allah, dan bukan menuju aazab-Nya yang amat sangat pedih. 3 ). Sungguh menakjubkan penjelasan al-qur'an dan mukjizat maknanya, al-qur'an menyuruh kita untuk bertadabbur dengan menggunakan indra dan perasaan yang zhahir maupun bathin sebelum menyuruh kita untuk berittiba', agar perasaan kita menjadi tenang dan kita memahami bahwa apa yang diperintahkan kepada kita adalah suatu hal yang baik dan penuh dengan rahmat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "153 Bahwa yang Kami perintahkan ini adalah sepuluh wasiat: yaitu agama-Ku yang lurus yang Aku ridhai untuk para hamba-Ku, tidak ada kebengkokan di dalamnya. Maka ikutilah jalan itu, dan janganlah kamu mengikuti jalan-jalan yang bertentangan dengannya, sehingga kalian lebih condong untuk menyeleweng dari jalan yang lurus yaitu agama yang Dia ridhai untuk kalian. Itulah yang diperintahkan oleh Tuhan kalian, agar kalian bertakwa kepada Allah, kemudian senantiasa menjalankan apa yang diperintahkan Allah dan menjauhi larangan-Nya serta hati-hati dengan azab-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya inilah jalanKu} jalan dan agamaKu {yang lurus} lurus dan tidak ada belokan di dalamnya {maka ikutilah. Janganlah mengikuti jalan-jalan} jalan-jalan yang terpisah, bukan lurus {sehingga mencerai-beraikan} membelokkan {kalian dari jalanNya} jalan dan agamaNya {Demikian itu Dia memerintahkan kepada kalian agar kalian bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153. Manakala Allah menjelaskan perintah-perintah besar dan syriat yang penting maka Dia memberi isyarat kepadanya dan kepada yang lebih umum darinya. Dia berfirman, “Dan bahwa yang kami perintahkan ini adalah jalanKu yang lurus.” Maksdunya, hukum-hukum ini dan yang sejenis dengannya yang dijelaskan oleh Allah di dalam kitabNya dan Dia menerangkan kepada hamba-hambaNy adalah jalan Allah mengantarkan kepadaNya dan kepada rumah kemulianNya, dan jalan yang seimbang, mudah lagi singkat. “Maka ikutilah ia,”agar kamu beruntung dan menang, dan meraih impian dan kebahagiaan. “Dan jangnalah kamu mengikuti jalan-jaln yang lain,” yaitu jalan-jalan yang menyimpang dari jalan ini. “karena jalan itu mencerai-beraikan kamu dari jalanNya.” Maksdunya, menyesatkan kamu darinya dan memecahkan kamu ke kanan dan ke kiri. Jika kamu telah tersesat dari jalan yang lurus, maka yang ada hanya jalan menuju Neraka Jahim. “Yang demikian itu diperintahkan kepadamu agar kamu bertakwa.” Karena jika kamu menunaikan sesuatu yang telah dijelaskan oleh Allah kepadamu, baik dari sisi ilmu atau dari sisi amal, maka kamu termasuk orang-orang yang bertakwa dan hamba Allah yang beruntung. Kata “jalan” disebutkan dengan kata tunggal dan dinisbatkan kepada Allah karena ia adalah “jalan” yang satu, yang mengatarkan kepadaNya. Dan Allah adalah penolong bagi para peniti untuk menitinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 153: Yakni perintah yang disebutkan dalam ayat 151-152 dan yang semisalnya. Jalan yang menghubungkan kepada Allah dan kepada surga-Nya, jalan yang lurus, mudah dan ringan. Agar kamu memperoleh keberuntungan dan memperoleh apa yang kamu harapkan. Yakni jalan-jalan yang menyelisihinya. Menyimpangkan kamu dari jalan-Nya yang lurus. Jika kamu sudah keluar dari jalan yang lurus, maka di sana tidak ada lagi jalan selain jalan yang mengarah kepada neraka. Kita meminta kepada Allah agar Dia membimbing kita menempuh jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 153",
    "description": "Allah menjelaskan bahwa semua perintah dan larangan yang telah disebut dua ayat sebelum ini adalah jalan kebenaran yang harus diikuti. Jika tidak, maka akan menimbulkan petaka dalam kehidupan. Inilah wasiat yang kesepuluh: dan sungguh, inilah jalan-ku yang lurus, yaitu agama islam yang diridai Allah dengan semua kelengkapan ajarannya, mulai dari akidah, kekeluargaan, dan kemasyarakatan. Maka ikutilah jalan ini, karena inilah jalan yang benar yang bisa memberikan jaminan kebahagiaan dan ketenteraman hidup di dunia dan di akhirat. Jangan kamu ikuti jalan-jalan yang lain seperti agama-agama selain islam, kelompok-kelompok yang mengajarkan ajaran yang menyimpang dan sesat yang akan mencerai-beraikan kamu dari jalan-Nya. Setan terus berusaha untuk membelokkan manusia dari jalan lurus ini dengan segala cara. Demikianlah dia memerintahkan kepadamu agar kamu bertakwa dengan selalu menjaga diri agar jangan sampai celaka, yaitu dengan melaksanakan ajaran islam dengan baik dan benar, baik itu kewajiban atau larangan. Inilah bentuk kasih sayang Allah kepada manusia agar mereka bahagia. Selanjutnya Allah menjelaskan bahwa islam sebagai jalan kebenaran yang harus diikuti bukanlah sesuatu yang baru, tetapi telah dibawa oleh para nabi terdahulu, antara lain adalah nabi musa. Kemudian kami telah memberikan kepada nabi musa kitab taurat sebagai anugerah dari Allah. Manusia tanpa wahyu pasti akan sesat karena mereka akan memilih jalan sendiri-sendiri atas dasar kepentingan masing-masing. Pemberian kitab suci itu adalah untuk menyempurnakan nikmat kami kepada orang yang berbuat kebaikan karena ketaatannya kepada Allah dalam menyampaikan pesan-pesan-Nya. Hal ini menunjukkan bahwa orang yang berbuat baik karena Allah akan diberi tambahan nikmat-Nya untuk menjelaskan segala sesuatu yang dibutuhkan oleh kaumnya, baik urusan agama maupun urusan dunia. Dan juga sebagai petunjuk ke jalan yang benar dan sebagai rahmat bagi mereka yang mengamalkannya agar mereka beriman akan adanya pertemuan dengan tuhannya untuk mendapatkan balasan dari semua amal yang dilakukan di dunia. Keimanan terhadap hari akhir menjadikan manusia lebih berhati-hati dalam bertindak dan banyak melakukan amal saleh."
  }
]