[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian katakanlah (wahai rasul), kepada kaum musyrikin, ”sesungguhnya Allah , Dia lah yang memberi musa kitab taurat sebagai penyempurna nikmatNya bagi orang-orang yang berbuat baik dari para pengikut ajaran agamanya dan untuk menjelaskan segala sesuatu terkait perkara-perkara agama mereka, serta sebagai petunjuk dan panduan menuju jalan yang lurus dan menjadi rahmat bagi mereka. Harapannya, mereka mengimani hari kebangkitan setelah kematian, hisab dan balasan amal perbuatan dan kemudian beramal untuk menyiapkannya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "154. Setelah memberitahukan hal-hal tersebut di atas, Kami beritahukan bahwa Kami telah memberikan kitab suci Taurat kepada Musa untuk menyempurnakan nikmat yang Kami berikan sebagai balasan atas amal baiknya. Juga untuk menjelaskan segala hal yang dibutuhkannya dalam masalah agama. Dan juga untuk menunjukkan kebenaran serta sebagai wujud kasih sayang-Nya supaya mereka percaya akan perjumpaan dengan Rabb mereka di hari Kiamat. Dengan demikian mereka akan bersiap-siap untuk menyambut hari itu dengan melakukan amal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "154. Hai Muhammad, kemudian setelah itu katakanlah, Allah memberitahukan kenikmatan besar yang telah diberikan kepada Bani Israil: Dengan keagungan dan kekuasaan Kami yang sempurna, Kami berikan Taurat kepada Musa sebagai penyempurna karunia dan kenikmatan bagi orang yang telah berbuat baik, dan sebagai penjelasan agama yang dibutuhkan oleh Bani Israil, serta sebagai petunjuk dan rahmat bagi mereka di dunia dan di akhirat, agar mereka mempercayai hari kebangkitan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "154. ثُمَّ ءَاتَيْنَا مُوسَى الْكِتٰبَ (Kemudian Kami telah memberikan Al Kitab (Taurat) kepada Musa) Yakni kemudian Kami memberikan al-kitab kepada Musa sebelum diturunkannya al-qur’an kepada Muhammad. تَمَامًا عَلَى الَّذِىٓ أَحْسَنَ (untuk menyempurnakan (nikmat Kami) kepada orang yang berbuat kebaikan) Yakni Kami sempurnakan kitab itu dalam keadaan yang paling sempurna. Pendapat lain mengatakan, maknanya adalah penyempurna kenikmatan sebagai balasan atas kebaikan Nabi Musa dengan ketaatannya kepada Allah. وَتَفْصِيلًا لِّكُلِّ شَىْءٍ (dan untuk menjelaskan segala sesuatu) Yakni untuk memutuskan segala hukum. 155. وَهٰذَا كِتٰبٌ أَنزَلْنٰهُ مُبَارَكٌ (Dan Al-Quran itu adalah kitab yang Kami turunkan yang diberkati) Ayat ini diisyaratkan kepada al-qur’an. Makna dari (المبارك) yakni memiliki banyak keberkahan, karena ia mengandung berbagai manfaat kedunia andan keagamaan. وَاتَّقُوا۟ (dan bertakwalah) Yakni jauhkanlah diri kalian dari menyelisihinya dan mendustakan isinya. لَعَلَّكُمْ تُرْحَمُونَ (agar kamu diberi rahmat) Yakni jika kalian menerimanya dan tidak menyelisihinya semoga kalian mendapatkan rahmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "154 Kemudian katakanlah: Kami telah memberikan Taurat kepada Musa as sebelum turunnya Al-quran kepada Muhammad saw untuk menyempurnakan nikmat Kami kepada orang yang berbuat kebaikan dan senantiasa berpegang teguh padanya. Dia adalah Musa dan semua orang yang baik perbuatannya. Juga untuk menjelaskan segala sesuatu pada zamannya. Sehingga Taurat dan Al-quran adalah sebagai dasar hujjah kuat dan meyakinkan atas orang-orang musyrik yang telah berkata bahwa: Al-quran bukanlah diturunkan dari Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Kami telah menganugerahkan} memberikan {kepada Musa kitab} Taurat {untuk menyempurnakan (nikmat) kepada orang yang berbuat kebaikan, merincikan} menjelaskan {setiap sesuatu, dan memberi petunjuk dan rahmat agar mereka beriman kepada pertemuan dengan Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "154. “Kemudian” di sini tidak menunjukan urutan waktu, karena waktu Musa mendahului waktu pembacaan Rasululoh , Muhammad terhadap kitab ini, akan tetapi yang maksud adalah urutan pemberitahuan. Allah memberi tahukan bahwa Dia telah memberi “Al-Kitab kepada Musa,” yaitu Taurat, “ untuk menyempurnakan” nikmatNya dan pelengkap kebaikanNya “kepada orang-orang yang berbuat kebaikan,” dari kalangan umat Musa. Karena Allah telah memberi nikmat terhadap orang-orang yang berbuat baik diantara mereka dengan nikmat-nikmat yang tidak terhitung, dimana salah satu dari kesempurnaanya adalah di turunkannya Taurat kepada mereka, maka sempurnalah nikmat Allah kepada mereka dan mereka wajib mensyukurinya. “dan untuk menjelaskan segala sesuatu,” berupa halal, haram, larangan, perintah, akidah dan lain-lain, yang perinciannya diperlukan oleh mereka, “Dan sebagai petunjuk.” Maksudnya, memberi mereka petunjuk kepada kabaikan dan mengenalkan keburukan kepada mereka dalam perkara-perkara dasar dan cabang. “Dan sebagai rahmat,” dengannya mereka mendapatkan kebahagiaan, rahmat dan kebaikan yang banyak. “Agar mereka,” karena ia meliputi dalil-dalil yang pasti tentang balasan amal dan kebangkitan, Allah mengharuskan mereka beriman pada pertemuan dengan Allah dan bersiap diri karenanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 154: Di antara umat Nabi Musa ‘alaihis salam, karena sesungguhnya Allah telah memberikan nikmat yang banyak kepada mereka yang berbuat baik, yang di antaranya sekaligus sebagai penyempurnanya adalah kitab Taurat. Yang dibutuhkan dalam agama, seperti yang halal dan yang haram, perintah dan larangan, ‘Aqidah, dan lainnya. Yang menunjukkan mereka kepada kebaikan dan mengenalkan mereka keburukan. Baik terkait dengan masalah ushul (dasar-dasar agama) maupun furu’ (cabang) Di mana dengannya mereka memperoleh kebahagiaan, rahmat dan kebaikan yang banyak. Bani Israil. Karena di dalamnya mengandung dalil pasti yang menunjukkan adanya kebangkitan dan pembalasan terhadap amal, di mana hal itu mengharuskan mereka beriman kepada pertemuan dengan Tuhan mereka serta mempersiapkan diri untuk menghadapinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 154",
    "description": "Selanjutnya Allah menjelaskan bahwa islam sebagai jalan kebenaran yang harus diikuti bukanlah sesuatu yang baru, tetapi telah dibawa oleh para nabi terdahulu, antara lain adalah nabi musa. Kemudian kami telah memberikan kepada nabi musa kitab taurat sebagai anugerah dari Allah. Manusia tanpa wahyu pasti akan sesat karena mereka akan memilih jalan sendiri-sendiri atas dasar kepentingan masing-masing. Pemberian kitab suci itu adalah untuk menyempurnakan nikmat kami kepada orang yang berbuat kebaikan karena ketaatannya kepada Allah dalam menyampaikan pesan-pesan-Nya. Hal ini menunjukkan bahwa orang yang berbuat baik karena Allah akan diberi tambahan nikmat-Nya untuk menjelaskan segala sesuatu yang dibutuhkan oleh kaumnya, baik urusan agama maupun urusan dunia. Dan juga sebagai petunjuk ke jalan yang benar dan sebagai rahmat bagi mereka yang mengamalkannya agar mereka beriman akan adanya pertemuan dengan tuhannya untuk mendapatkan balasan dari semua amal yang dilakukan di dunia. Keimanan terhadap hari akhir menjadikan manusia lebih berhati-hati dalam bertindak dan banyak melakukan amal saleh. Ayat ini menjelaskan peranan Al-Qur'an bagi manusia. Dan ini adalah kitab Al-Qur'an yang kami turunkan melalui malaikat jibril dengan penuh berkah, yakni segala macam kebaikan, baik lahir maupun batin, yang sangat berguna bagi kehidupan manusia di dunia maupun di akhirat. Ikutilah apa yang ada di dalamnya, amalkanlah isinya, dan bertakwalah, jagalah dirimu dari api neraka, waspadalah, dan taatilah ketentuan yang ada di dalam kitab itu. Itu semua agar kamu mendapat rahmat kasih sayang dari Allah. Orang yang diberi kasih sayang dari Allah akan men-dapatkan kebahagiaan di dunia dan di akhirat."
  }
]