[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kitab al-qur’an ini adalah kitab yang kami turunkan kepada Nabi kami, Muhammad kebaikannya amatlah banyak, maka ikutilah kitab tersebut dalam perkara yang diperintahkan dan dilarangnya. Dan takutlah kepada Allah dari melanggar perintahNya, dengan harapan kalian dinaungi rahmatNya sehingga selamat dari siksaanNYa dan beruntung mendapatkan pahalaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "155. Sedangkan Al-Qur`ān ini adalah kitab suci yang Kami turunkan dengan limpahan berkah yang banyak. Karena Al-Qur`ān ini berisi banyak hal yang bermanfaat terkait masalah agama dan dunia. Maka ikutilah apa yang diturunkan di dalamnya dan jangan melanggarnya agar kalian mendapatkan kasih sayang-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "155. Dan al-Qur'an yang mulia ini Kami turunkan kepada Nabi Muhammad, yang manfaat dan kebaikannya sangat banyak bagi kehidupan di dunia dan di akhirat; maka taatilah hukum-hukum dan perintah-perintahnya, dan takutlah kepada Allah dengan menjalankan segala perintah dan menjauhi segala larangan-Nya, agar kalian senantiasa dapat meraih rahmat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "155. وَهٰذَا كِتٰبٌ أَنزَلْنٰهُ مُبَارَكٌ (Dan Al-Quran itu adalah kitab yang Kami turunkan yang diberkati) Ayat ini diisyaratkan kepada al-qur’an. Makna dari (المبارك) yakni memiliki banyak keberkahan, karena ia mengandung berbagai manfaat kedunia andan keagamaan. وَاتَّقُوا۟ (dan bertakwalah) Yakni jauhkanlah diri kalian dari menyelisihinya dan mendustakan isinya. لَعَلَّكُمْ تُرْحَمُونَ (agar kamu diberi rahmat) Yakni jika kalian menerimanya dan tidak menyelisihinya semoga kalian mendapatkan rahmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "155 Al-quran ini terdapat banyak keberkahan dan kemanfaatan, dan Al-quran ini membawa risalah agung, sebab Al-quran mengandung kemanfaatan agama dan dunia, maka ikutilah Al-quran dan takutlah kalian dari membangkang dan mendustakannya agar kamu diberi rahmat, ridha dan surga Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ini adalah kitab yang Kami turunkan lagi diberkahi. Maka ikutilah dan bertakwalah agar kalian dirahmati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "155. “Dan Al-Qur’an itu,” adalah al-Qur’an yang agung dan dzikir yang bijak “adalah kitab yang kami turunkan yang diberkati,” maksudnya, di dalamnya terdapat kebaikan yang banyak dan ilmu yang melimpah. darinya seluruh ilmu bersumber dan darinyalan seluruh keberkahan dikeluarkan. Tidak ada kebaikan kecuali Al-Qur’an telah menyerukan dan mendorong kepadanya. Ia menyebutkan hikmah-hikmah dan kemaslahatan yang mendorong kepadanya. Tidak ada keburukan kecuali ia telah melarangnya, memperingatkannya dan menjelaskan sebab-sebab yang menghindarkannya dari melakukannya dan akibat buruknya. “Maka ikutilah ia,” pada apa yang diperintahan dan dilarang, bangunlah perkara-perkara agamamu, baik yang usul maupun yang furu di atasnya. “Dan bertakwalah,” kepada Allah dan janganlah menyelisihi perintahNya. “Agar kamu,” jika mengikutinya “ diberi rahmat.” Penyebab terbesar mendapatkan rahmat Allah adalah mengikuti kitab ini dari segi ilmu dan pengamalan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 155: Di dalamnya terdapat kebaikan yang banyak, dari sana semua ilmu diambil dan dari sana berbagai keberkahan digali. Tidak ada satu kebaikan kecuali diserukan dan didorongnya, disebutkan pula di sana hikmah dan maslahatnya. Dan tidak ada satu keburukan pun kecuali dilarangnya, diperingatkannya dan disebutkan berbagai sebab yang menjauhkan seseorang dari mengerjakannya serta akibatnya. Ikutilah perintahnya dan jauhilah larangannya, serta bangunlah dasar agama kamu dan cabangnya di atasnya. Jangan menyelisihi perintah-Nya. Oleh karena itu, sebab terbesar untuk menggapai rahmat Alah adalah dengan mengikuti Al Qur’an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 155",
    "description": "Ayat ini menjelaskan peranan Al-Qur'an bagi manusia. Dan ini adalah kitab Al-Qur'an yang kami turunkan melalui malaikat jibril dengan penuh berkah, yakni segala macam kebaikan, baik lahir maupun batin, yang sangat berguna bagi kehidupan manusia di dunia maupun di akhirat. Ikutilah apa yang ada di dalamnya, amalkanlah isinya, dan bertakwalah, jagalah dirimu dari api neraka, waspadalah, dan taatilah ketentuan yang ada di dalam kitab itu. Itu semua agar kamu mendapat rahmat kasih sayang dari Allah. Orang yang diberi kasih sayang dari Allah akan men-dapatkan kebahagiaan di dunia dan di akhirat. Kemudian, pada ayat ini Allah menjelaskan tentang turunnya alqur'an kepada orang musyrik mekah agar mereka pada hari kiamat kelak tidak membuat-buat alasan mengenai sikap kemusyrikan dan kemaksiatan mereka. Kami turunkan Al-Qur'an yang berisi hal-hal yang menyangkut semua aspek kehidupan itu agar kamu tidak mengatakan dan membuat-buat alasan pada hari kiamat nanti bahwa kamu tidak mendapatkan kitab petunjuk dari langit, kitab itu, yaitu taurat dan injil, hanya diturunkan kepada dua golongan sebelum kami, yahudi dan nasrani, dan sungguh, kami tidak memperhatikan apa yang mereka baca. Kami tidak mengerti apa yang ada di dalam kedua kitab tersebut karena menggunakan bahasa yang bukan bahasa kami."
  }
]