[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan agar kalian (wahai kaum musyrikin) tidak berkarta, ”seandainya diturunkan kitab kepada kami dari langit, sebagaimana diturunkan kepada yahudi dan nasrani, pastilah kami akan lebih istiqomah berada di atas jalan kebenaran daripada mereka. ” sungguh telah datang kepada kalian kitab dengan berbahasa lisan kalian yaitu Bahasa arab yang nyata dari langit dengan Bahasa ibu kalian, dan itu adalah hujjah yang jelas dari tuhan kalian dan petunjuk menuju jalan kebenaran dan rahmat bagi umat ini. Maka tidak ada orang yang lebih aniaya dan lebih besar permusuhannya dari orang yang mendustakan hujjjah-hujjah Allah dan kemudian dia berpaling darinya! orang-orang yang berpaling tersebut, akan kami hukum dengan siksaan yang keras di dalam neraka jahanam, disebabkan mereka berpaling dari ayat-ayat Kami dan menghalangi (orang lain) dari jalan Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "157. Dan supaya kalian -wahai orang-orang musyrik- tidak berkata, “Sekiranya Allah menurunkan kitab suci kepada kami seperti yang diturunkan-Nya kepada orang-orang Yahudi dan orang-orang Nasrani, niscaya kami akan lebih baik dari mereka.” Padahal kalian telah didatangi kitab suci yang Allah turunkan kepada Nabi kalian, Muhammad -ṣallallāhu 'alaihi wa sallam- dengan menggunakan bahasa kalian. Dan Kitab Suci itu adalah hujah yang jelas, petunjuk ke jalan yang benar dan rahmat bagi umat. Maka janganlah kalian mengajukan alasan-alasan yang lemah dan dalih-dalih yang batil. Tidak ada orang yang lebih zalim dari orang yang mendustakan ayat-ayat Allah dan berpaling darinya. Kelak Kami akan menghukum orang-orang yang berpaling dari ayat-ayat Kami dengan hukuman yang sangat keras. Kami akan memasukkan mereka ke dalam Neraka Jahanam sebagai balasan atas tindakan mereka yang telah berpaling dari ayat-ayat Kami dan mengabaikannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "157. أَوْ تَقُولُوا۟ لَوْ أَنَّآ أُنزِلَ عَلَيْنَا الْكِتٰبُ (Atau agar kamu (tidak) mengatakan: “Sesungguhnya jikalau kitab ini diturunkan kepada kami) Sebagaimana yang diturunkan kepada dua kaum sebelum kami. لَكُنَّآ أَهْدَىٰ مِنْهُمْ ۚ (tentulah kami lebih mendapat petunjuk dari mereka”) Ucapan dan alasan dari mereka ini terbantah dengan diutusnya Nabi Muhammad dan diturunkannya al-qur’an. فَقَدْ جَآءَكُم بَيِّنَةٌ مِّن رَّبِّكُمْ (Sesungguhnya telah datang kepada kamu keterangan yang nyata dari Tuhanmu) Yakni kitab yang diturunkan Allah kepada nabi yang berasal dari kaum kalian wahai orang-orang Arab, maka janganlah kalian mengajukan uzur-uzur yang bathil dan beralasan dengan alasan-alasan yang tidak berdasar. فَمَنْ أَظْلَمُ مِمَّن كَذَّبَ بِـَٔايٰتِ اللهِ (Maka siapakah yang lebih zalim daripada orang yang mendustakan ayat-ayat Allah) Padahal ia merupakan rahmat dan petunjuk bagi manusia. وَصَدَفَ عَنْهَا ۗ( dan berpaling daripadanya) Yakni tersesat karena berpaling darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "157 Atau agar kamu juga tidak mengatakan: “Sesungguhnya jikalau kitab ini diturunkan kepada kami, seperti yang telah diturunkan kepada orang-orang Yahudi dan Nasrani sebelum kami tentulah kami lebih bisa mendapat petunjuk kepada kebenaran dari mereka. Sebab kami lebih pandai dan cerdas untuk memahaminya”. Kemudian Allah menjawabnya bahwa telah datang kepada mereka dasar hujjah yang jelas dan kuat yaitu Al-quran yang telah diturunkan kepada Nabi kalian dari golongan kalian. Sebagai petunjuk dari kesesatan dan rahmat bagi mereka yang mengikutinya. Tidak ada yang lebih zalim daripada orang yang mendustakan ayat-ayat Allah dan berpaling daripadanya? Kelak Kami akan memberi balasan kepada orang-orang yang berpaling dari ayat-ayat Kami dengan siksa yang buruk, disebabkan mereka selalu berpaling dan mendustakannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau supaya kalian (tidak) mengatakan,“Sesungguhnya jikalau kitab itu diturunkan kepada kami, sungguh kami lebih mendapat petunjuk daripada mereka.” Sungguh telah datang kepada kalian penjelasan yang nyata} dalil yang jelas {dari Tuhan kalian dan petunjuk} penjelasan {serta rahmat. Maka siapakah yang lebih zalim daripada orang yang mendustakan ayat-ayat Allah dan berpaling} berpaling {darinya. Kami akan memberi balasan kepada orang-orang yang berpaling} berpaling {dari ayat-ayat Kami dengan seburuk-buruknya} sekeras-kerasnya {azab karena mereka selalu berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "157. “Atau agar kamu tidak mengatakan, ‘sesungguhnya jikalau kitab itu di turunkan kepada kami, tentulah kami lebih mendapat petunjuk dari mereka’.” Bisa jadi kamu berasalan tidak sampainya dasar petunjuk kepadamu dan bisa pula kamu beralasan bahwa petunjuk itu tidak lengkap dan tidak sempurna, maka dengan kitabmu ini terpenuhilah dasar petunjuk da kesempurnaanya. Oleh karena itu, Dia berfirman, “Sungguh telah datang kepadamu ketarangan yang nyata dari Tuhanmu.” Ini adalah kata benda yang meliputi segala jenis, maka segala sesuatu yang menjelaskan kebenaran termasuk didalamnya. “Dan petunjuk,” dari kesesatan “dan rahmat” maksudnya kebahagiaanmu dalam agama dan duniamu. Ini mewajibkanmu tunduk kepada hukum-hukumnya dan beriman kepada berita-beritanya, bahwa bahwa barangsiapa yang tidak mengangkat kepalannya dengannya dan medustakannya, maka dia adalah orang yang paling zhalim. Oleh karena itu Dia berfirman, “Maka siapakah orang yang lebih zhalim daripada orang yang mendustakan ayat-ayat Allah dan berpaling darinya?” maksudnya, berpaling dan menyingkir darinya. “ kelak kami akan memberi balasan kepada orang-orang yang berpaling dari ayat-ayat kami dengan siksaan yang buruk.” Maksudnya, azab yang memperburuk orang yang tertimpa olehnya dan memberatkannya. “Disebabkan mereka selalu berpaling ,” untuk diri mereka dan untuk selain mereka, sebagai balasan kepa mereka , atas perbauatan mereka, dan Tuhanmu tiada sedikitpun menzhalimi hamba-hambaNya. Ayat-ayat ini menngandung dalil bahwa ilmuAl-Qur’an adala ilmu yang paling mulia, paling berkah, dan paling luas. Dengannya diraih petunjuk kepada jalan-jalan yang lurus secara sempurna, dimana bersamanya tidak lagi memerlukan bualan pakar ilmu kalam (mutakallim), pemikiran ahli filsafat dan tidak pula selain itu dari ilmu orang-orang terdahulu dan yang terakhir. Sudah dikenal bahwa kitab tidak diturunkan kecuali kepada dua golongan: Yahudi dan Nasrani. Mereka itulah Ahli Kitab secara mutlak. Kelompok-kelompok lain tidak termasuk kepadanya, tidak orang-orang Majusi dan tidak pula selainnya. Di dalamnya terdapat keterangan tentang apa yang merajalela di masa jahiliyah sebelum al-Quran turun, yaitu kebodohan besar dan ketidaktahuan terhadap ilmu yang dimiliki oleh Ahli Kitab serta kelalaian mereka mempelajari kitab mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 157: Bagi orang yang mengikutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 157",
    "description": "Atau agar kamu tidak mengatakan, jikalau kitab yang berisi tentang berbagai petunjuk dalam kehidupan itu diturunkan kepada kami, tentulah kami lebih mendapat petunjuk daripada mereka, karena kami lebih bersemangat dalam melaksanakan ajaran agama dan lebih cerdas daripada mereka. Kami banyak tahu tentang syair, kisah-kisah masa lalu, padahal kami adalah bangsa yang buta huruf. Sungguh, telah datang kepadamu penjelasan yang nyata, yaitu kitab Al-Qur'an ini dan rasul yang membawanya, petunjuk bagi yang menghayati kandungannya, dan rahmat bagi semesta alam dari tuhanmu. Siapakah yang lebih zalim, maksudnya tidak ada yang lebih zalim, daripada orang yang mendustakan ayat-ayat Allah seperti perkataan mereka bahwa Al-Qur'an adalah cerita bohong dari masa lalu, dan bahwa nabi Muhammad adalah pesihir, orang gila, dan lain sebagainya, dan orang yang berpaling daripadanya, bahkan melarang orang lain untuk mendengarkan dan mempelajarinya' kelak, kami akan memberi balasan kepada orang-orang yang berpaling dari ayat-ayat kami dengan azab yang keras, karena mereka selalu berpaling. Mereka tahu dan memahami dengan jelas tentang kebenaran dari ayat-ayat Allah, tetapi mereka dengan sengaja memilih kekafiran dan menghalang-halangi orang lain untuk masuk islam. Setelah itu Allah mengingatkan mereka lebih keras lagi tentang apa yang terjadi pada diri mereka ketika hari kiamat datang. Yang mereka nanti-nantikan hanyalah kedatangan malaikat kepada mereka untuk mencabut nyawa atau mengazab mereka, atau kedatangan tuhanmu dengan cara yang tidak diketahui secara pasti untuk memutuskan urusan makhluk-Nya, atau kedatangan janji Allah berupa pahala bagi orang mukmin dan siksaan bagi yang kafir, atau sebagian tanda-tanda dari tuhanmu yaitu tanda kedatangan hari kiamat seperti kemunculan dajjal, matahari terbit dari sebelah barat, nabi isa turun kembali ke dunia, keluarnya yakjuj dan makjuj, dan lainnya. Pada hari datangnya sebagian tanda-tanda tuhanmu tidak berguna lagi iman seseorang yang belum beriman sebelum itu, karena pintu untuk beriman sudah tertutup, atau belum berusaha berbuat kebajikan dengan imannya itu karena pada saat itu sedang terjadi proses menuju hari penghitungan amal, bukan lagi waktu untuk mencatat amal saleh, bahkan bagi orang yang sudah beriman sekali pun. Pintu tobat juga sudah tertutup. Kemudian Allah, dengan nada yang keras, memperingatkan mereka, katakanlah wa-hai nabi Muhammad, 'tunggulah kedatangan tiga hal tersebut, yaitu malaikat, Allah, dan sebagian tanda-tanda hari kiamat. Kami pun menunggu datangnya siksaan Allah terhadap kalian."
  }
]