[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah yang ditunggu oleh orang-orang yang berpaling dan menghalangi (Orang) dari jalan Allah hanyalah kedatangan malaikat kematian dan para pendampingnya kepada mereka untuk mencabut nyawa mereka, atau kedatanagn tuhanmu (wahai rasul) untuk memutuskan nasib diantara para hambaNYa pada hari kiamat, atau munculnya dari sebagian tanda dan gejala hari kiamat yang menunjukan kedatangan hari tersebut yaitu, terbitnya matahari dari arah barat? Ketika itu terjadi maka tidaklah bermanfaat keimanan sesorang bagi dirinya, jika dia belum beriman sebelumnya, dan tidak di terima amal perbuatan yang baik darinya kalau dia sudah beriman, jika dia belum mengusahakannya sebelum itu. Katakanlah kepada mereka (wahai rasul), ”tunggulah kedatangannya agar kalian mengetahui siapa yang benar dan siapa yang berada di atas kebatilan, siapa orang yang berbuat buruk dan siapa orang yang baik. Sesungguhnya kamipun juga menunggunya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "158. Orang-orang kafir itu hanya menunggu kedatangan Malaikat maut dan para pembantunya untuk mencabut nyawa mereka di dunia. Atau menunggu kedatangan Rabbmu -wahai Rasul- di Akhirat untuk menjatuhkan keputusan yang tegas kepada mereka. Atau menunggu datangnya sebagian tanda-tanda dari Rabbmu yang menunjukkan akan datangnya hari Kiamat. Dan pada hari datangnya sebagian tanda-tanda dari Rabbmu -seperti terbitnya matahari dari barat- imannya orang yang kafir tidak akan berguna baginya, dan amal baik seorang mukmin tidak akan berguna baginya apabila ia belum pernah berbuat baik sedikit pun sebelumnya. Katakanlah -wahai Rasul- kepada orang-orang yang musyrik serta mendustakanmu itu, “Tunggulah salah satu dari hal-hal tersebut. Sesungguhnya Kami pun sedang menunggunya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "158. Tidak ada yang ditunggu oleh orang-orang yang mendustakan itu kecuali datangnya permulaan azab, dengan kedatangan malaikat yang akan mencabut roh mereka, datangnya azab dari Tuhanmu, datangnya ketetapan di antara para hamba pada hari kiamat, atau datangnya sebagian tanda hari kiamat. Jika itu telah terjadi maka tidak akan bermanfaat keimanan seseorang jika orang itu tidak beriman sebelumnya, atau telah beriman namun tidak melakukan amal kebaikan. Allah memerintahkan rasul-Nya untuk mengancam mereka, katakanlah: \"Tunggulah apa yang akan menimpa kalian karena kami juga menunggu kenikmatan yang kekal yang telah Allah janjikan kepada kami.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "158. هَلْ يَنظُرُونَ (Yang mereka nanti-nanti) Yakni mereka tidaklah menunggu. إِلَّآ أَن تَأْتِيَهُمُ الْمَلٰٓئِكَةُ (kecuali kedatangan malaikat kepada mereka ) Yakni malaikat maut untuk mencabut nyawa mereka. أوْ يَأْتِىَ رَبُّكَ (atau kedatangan Tuhanmu) Yakni kedatangan hari kiamat untuk memutuskan perkara diantara mereka. أَوْ يَأْتِىَ بَعْضُ ءَايٰتِ رَبِّكَ ۗ( atau kedatangan beberapa ayat Tuhanmu) Yakni tanda-tanda hari kiamat yang menunjukkan kedatangannya. يَوْمَ يَأْتِى بَعْضُ ءَايٰتِ رَبِّكَ(Pada hari datangnya ayat dari Tuhanmu) Yakni ayat yang mereka minta, yang memaksa mereka untuk beriman seperti terbitnya matahari dari barat dan munculnya hewan melata (daabbah) yang berbicara kepada mereka. لَا يَنفَعُ نَفْسًا إِيمٰنُهَا (tidaklah bermanfaat lagi iman seseorang kepada dirinya sendiri) Karena beban Syariah telah diangkat dari mereka, sebab semua telah melihat kebenaran dengan mata telanjang mereka sehingga mereka semua beriman, namun keimanan mereka tidak berguna ketika itu. لَمْ تَكُنْ ءَامَنَتْ مِن قَبْلُ (yang belum beriman sebelum itu) Yakni sebelum datangnya sebagian ayat Allah. Adapun orang yang telah beriman sebelum datangnya ayat itu maka keimanannya bermanfaat baginya. أَوْ كَسَبَتْ فِىٓ إِيمٰنِهَا خَيْرًا ۗ (atau dia (belum) mengusahakan kebaikan dalam masa imannya) Dengan amal shaleh yang ia kerjakan. Maka barangsiapa yang beriman saja dan belum melakukan suatu kebaikan setelah keimanannya atau telah melakukan kebaikan namun belum beriman maka hal itu tidak memberinya manfaat. Rasulullah bersabda: “tidak akan datang hari kiamat sampai matahari terbit dari barat, apabila itu terjadi dan manusia telah melihatnya maka mereka akan beriman semuanya, ketika itu tidak bermanfaat keimanan seseorang untuk dirinya”. Kemudian Rasulullah membaca ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "158 Yang mereka nanti-nanti yaitu para pendusta itu tidak lain hanyalah kedatangan malaikat kepada mereka untuk mencabut nyawa mereka atau kedatangan mereka dengan membawa siksa Tuhanmu untuk mereka. Atau kedatangan beberapa tanda-tanda terjadinya hari kiamat. Pada hari datangnya tanda dari Tuhanmu itu, seperti matahari terbit dari barat dan kedatangan dajjal maka iman seseorang tidak lagi bermanfaat bahkan kepada dirinya sendiri yang belum beriman sebelum itu. Sebab keimanan pada hari itu adalah keimanan yang terpaksa, dan hanya untuk meringankan beban mereka jika kamu belum beriman sebelumnya. Tempat pemberian tanggung jawab adalah di dunia. Atau bahkan dia sudah beriman namun belum mengusahakan kebaikan dan amal saleh dalam masa imannya, atau juga berbuat baik namun tidak mempunyai iman. Maka keimanannya, taubatnya, dan amal baiknya tidak bisa memberi manfaat apapun kepadanya pada hari itu dari azab. Maka katakanlah wahai Nabi: “Tunggulah azab dadri Tuhanmu, sesungguhnya Kamipun juga menunggu anugerah dan pertolongan Tuhan kami dari musuh-musuh kami”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa yang mereka nantikan} mereka tunggu {hanyalah kedatangan malaikat kepada mereka} malaikat maut untuk mengambil ruh mereka {kedatangan Tuhanmu, atau sebagian tanda-tanda dari Tuhanmu. Pada hari datangnya sebagian tanda-tanda Tuhanmu. tidak bermanfaat lagi iman seseorang yang belum beriman sebelumnya atau berusaha berbuat kebaikan dalam masa imannya itu. Katakanlah,“Tunggulah! Sesungguhnya Kami juga menunggu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "158. Allah berfirman, “Tiada yang mereka nanti-nantikan di atas kezhaliman dan pengingkaran mereka hanya “kedatangan” mukadimah azab dan mukadimah akhirat kepada mereka dengan datangnya “malaikat” kepada mereka untuk mencabut nyawa mereka. Jika mereka telah sampai pada keadaan ini maka iman dana mal shalih tidaklah berguna bagi mereka. “Atau kedatangan Tuhanmu,” untuk memberikan keputusan di antara manusia dan memberikan balasan kepada orang-orang yang berbuat baik dan orang-orang yang berbuat buruk. “Atau kedatangan sebagian tanda-tanda Tuhanmu,” yang menunjukkan dekatnya Kiamat. “Pada hari datangnya sebagian tanda-tanda Tuhanmu,” yang luar biasa yang dengannya diketahui bahwa Kiamat telah dekat dan bahawa Kiamat sudah di ambang pintu. “Iman seseorang tidaklah bermanfaat lagi bagi dirinya sendiri yang belum beriman sebelum itu, atau dia (belum) mengusahakan kebaikan dalam masa imannya.” Maksudnya, jika sebagian tanda-tanda Allah telah muncul, maka iman orang kafir tidak berguna jika dia beriman, begitu pula orang-orang Mukmin yang lalai, tidak berguna lagi penambahan kebaikannya sesudah itu. Yang berguna baginya adalah imannya yang telah dia miliki sebelum itu, dan kebaikan yang dia laksanakan sebelum munculnya sebagian tanda-tanda tersebut. Hikmah masalah ini sangat jelas. Iman berguna bagi seorang hamba jika ia merupakan iman kepada yang ghaib dan dilakukan atas dasar kemauan seorang hamba. Adapun jika tanda-tanda Kiamat telah datang, perkaranya bisa dilihat oleh mata, maka iman tiada lagi berguna, karena ia sama dengan iman terpaksa seperti imannya orang yang tenggelam, imannya orang yang terbakar dan yang sepertinya yang melihat kematian di depan mata, maka dia pun meninggalkan kemaksiatan yang dahulu dilakukannya sebagaimana Firman Allah, Maka tatkala mereka melihat azab Kami, mereka berkata: \"Kami beriman hanya kepada Allah saja, dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah\". Maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa Kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan di waktu itu binasalah orang-orang kafir. (Al-Mu’min: 84-85). Banyak hadits-hadits shahih dari Nabi yang menjelaskan bahwa yang dimaksud dengan “ayat” (sebagian tanda Allah) adalah terbitnya matahari dari barat. Bahwa jika manusia telah melihatnya, niscaya mereka semuanya beriman, tetapi iman mereka tidak lagi berguna pada hari itu, dan pintu taubat dituttup. Manakala ini adalah ancaman bagi orang-orang yang mendustakan Rasulullah yang ditunggu-tunggu sementara mereka juga menunggu Nabi dan para pengikutnya tertimpa kesulitan dan musibah kehidupan, maka Allah berirmana, “katakanlah, ‘Tunggulah olehmu, sesungguhnya Kami pun menunggu (pula)’. “ maka kamu akan mengetahui siapa yang berada di atas kebenaran. Ayat ini mengandung dalil bagi madzhab Ahlus Sunnah wal Jama’ah dalam menetapkan perbuatan sukarela (ikhtiyariyah) bagi Allah seperti istiwa’ (bersemayam), nuzul (turun) dan ityan (datang) bagi Allah tanpa menyamakannya dengan sifat makhluk. Dan dalil seperti ini sangat banyak di dalam al-Quran dan as-Sunnah. Ayat ini mengandung penjelasan bahwa sebagian tanda-tanda Kiamat adalah terbitnya matahari dari barat. Bahwasanya Allah Mahabijaksana, dan sunnatullah itu berlaku, bahwa iman itu berguna selama ia dilakukan secara sukarela bukan terpaksa seperti yang telah dijelaskan, bahwa manusia mendapatkan kebaikan dengan imannya. Ketaatan, kebaikan dan ketakwaan hanyalah berguna dan berkembang jika seorang hamba memiliki iman. Jika hati kosong dari iman, maka semua itu sedikit pun tidaklah berguna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 158: Yakni orang-orang musyrik. Untuk mencabut ruh mereka. Untuk memberikan keputusan kepada manusia di padang mahsyar. Maksudnya tanda-tanda yang menunjukkan telah dekatnya kiamat. Yaitu terbitnya matahari dari barat. Ketika itu, manusia semua beriman, namun beriman ketika itu tidak bermanfaat dan pintu tobat pun ditutup. Hikmahnya adalah karena iman hanyalah bermanfaat ketika beriman kepada yang ghaib dan seseorang melakukannya dengan pilihannya, adapun apabila sebagian tanda besar hari kiamat tiba, yaitu terbitnya matahari dari barat, maka masalahnya menjadi nyata, sehingga tidak ada faedahnya lagi iman, karena hal itu seperti keimanan karena terpaksa, seperti imannya orang yang akan tenggelam atau terbakar ketika dirinya menyaksikan kematian dsb. Allah Subhaanahu wa Ta'aala berfirman: “Maka ketika mereka melihat azab Kami, mereka berkata, \"Kami beriman hanya kepada Allah saja, dan Kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah\".--“Maka iman mereka tidak berguna bagi mereka ketika mereka telah melihat siksa kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. Dan di waktu itu binasalah orang-orang kafir. (Terj. Al Mu’min: 84-85) Salah satu dari ketiga hal itu. Kelak kamu akan mengetahui siapakah di antara kita yang lebih berhak memperoleh keamanan?!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 158",
    "description": "Setelah itu Allah mengingatkan mereka lebih keras lagi tentang apa yang terjadi pada diri mereka ketika hari kiamat datang. Yang mereka nanti-nantikan hanyalah kedatangan malaikat kepada mereka untuk mencabut nyawa atau mengazab mereka, atau kedatangan tuhanmu dengan cara yang tidak diketahui secara pasti untuk memutuskan urusan makhluk-Nya, atau kedatangan janji Allah berupa pahala bagi orang mukmin dan siksaan bagi yang kafir, atau sebagian tanda-tanda dari tuhanmu yaitu tanda kedatangan hari kiamat seperti kemunculan dajjal, matahari terbit dari sebelah barat, nabi isa turun kembali ke dunia, keluarnya yakjuj dan makjuj, dan lainnya. Pada hari datangnya sebagian tanda-tanda tuhanmu tidak berguna lagi iman seseorang yang belum beriman sebelum itu, karena pintu untuk beriman sudah tertutup, atau belum berusaha berbuat kebajikan dengan imannya itu karena pada saat itu sedang terjadi proses menuju hari penghitungan amal, bukan lagi waktu untuk mencatat amal saleh, bahkan bagi orang yang sudah beriman sekali pun. Pintu tobat juga sudah tertutup. Kemudian Allah, dengan nada yang keras, memperingatkan mereka, katakanlah wa-hai nabi Muhammad, 'tunggulah kedatangan tiga hal tersebut, yaitu malaikat, Allah, dan sebagian tanda-tanda hari kiamat. Kami pun menunggu datangnya siksaan Allah terhadap kalian. Penjelasan tentang nasib orang kafir pada hari kiamat yang terdapat pada ayat di atas dilanjutkan dengan penjelasan tentang ada kelompokkelompok sesat pada ayat ini. Sesungguhnya orang-orang yang memecah belah agamanya'padahal agama pada awalnya hanya satu, yaitu agama tauhid, sebagaimana sabda nabi , kami, para nabi, bagaikan anakanak satu ayah dari ibu yang berbeda, agama kami satu. 'dan mereka menjadi terpecah dalam golongan-golongan dengan mengikuti hawa nafsunya sendiri-sendiri, sesuai dengan kepentingan masing-masing di mana setiap golongan berbangga dengan golongannya sendiri, sedikit pun bukan tanggung jawabmu, wahai nabi Muhammad, atas mereka. Kamu telah melaksanakan tugas kerasulanmu, sementara mereka memilih jalan kekafiran. Hati mereka telah terkunci untuk menerima kebenaran. Sesungguhnya urusan mereka terserah kepada Allah. Allah yang akan memutuskan nasib mereka, maka janganlah kamu bersedih atas kekafiran mereka. Kemudian dia akan memberitahukan kepada mereka apa yang telah mereka perbuat. Tentang dosa-dosa mereka dan balasan terhadap mereka pada hari kiamat nanti."
  }
]