[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang memecah belah agama mereka setelah sebelumnya berkumpul diatas tauhidullah dan mengamalkan syariatNya, lalu mereka berbagi-bagi ke dalam golongan-golongan dan kelompok-kelompok, sesungguhnya engkau (wahai rasul) berlepas diri dari mereka. Urusan mereka hanyalah tergantung pada Allah , kemudian Dia akan memberitahukan kepada mereka tentang perbuatan-perbuatan yang telah mereka perbuat lalu memberikan balasan orang-orang yang bertaubat diantara mereka dan berbuat baik atas kebaikan mereka dan menghukum orang-orang yang berbuat buruk atas keburukan-keburukan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "159. Sesungguhnya orang-orang yang membuat agama mereka terpecah belah, yaitu orang-orang Yahudi dan orang-orang Nasrani yang mengambil sebagian agamanya dan mengabaikan sebagian yang lain, dan mereka terpecah belah menjadi kelompok-kelompok yang berselisih paham itu sama sekali bukan golonganmu, wahai Rasul. Kamu sama sekali tidak bertanggung jawab atas kesesatan mereka. Tugasmu hanyalah memberikan peringatan kepada mereka. Maka urusan mereka diserahkan kepada Allah. Kemudian pada hari Kiamat kelak Allah akan memberitahukan kepada mereka perihal apa yang telah mereka perbuat di dunia. Lalu Dia akan memberikan balasan yang setimpal kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "159. Allah mengancam orang-orang yang membuat perpecahan dan perselisihan dalam agama, dan memerintahkan nabi untuk berlepas diri dari mereka dan dari amal perbuatan mereka, serta menekankan bahwa Dia yang akan memberi balasan dan siksaan bagi mereka. Kemudian Allah menyampaikan kepada mereka kemaksiatan kemaksiatan yang telah mereka lakukan. Ibnu 'Asyur berkata: ketika terdapat perintah untuk berlepas diri dari mereka, maka ini akan menimbulkan pertanyaan dari seseorang: \"Apakah Rasulullah harus bertanggung jawab untuk membalas mereka atas amal buruk yang telah mereka lakukan?\" Oleh sebab itu ayat ini dilanjutkan dengan firman-Nya: (at-Tahrir wa at-Tanwir: 7/143)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "159. إِنَّ الَّذِينَ فَرَّقُوا۟ دِينَهُمْ (Sesungguhnya orang-orang yang memecah belah agama-Nya) Yakni menjadikan agama mereka terbagi-bagi dengan menerima sebagiannya dan menolak sebagian lainnya. Dan yang dimaksud adalah orang-orang Yahudi, Nasrani, dan musyrikin; sebagian mereka menyembah berhala dan sebagian lainnya menyembah malaikat, dan termasuk juga dalam ayat ini orang-orang yang membuat bid’ah dan mendatangkan apa yang tidak diperintahkan Allah. شِيَعًا (dan mereka menjadi bergolongan) Yakni menjadi kelompok-kelompok dan golongan-golongan. Dan ini berlaku bagi setiap kaum yang dulunya bersatu padu dalam urusan agama mereka, kemudian setiap kelompok dari mereka mengikuti pendapat dari pembesar mereka yang menyelisihi dan menjauhi kebenaran. لَّسْتَ مِنْهُمْ فِى شَىْءٍ ۚ( tidak ada sedikitpun tanggung jawabmu kepada mereka) Yakni kamu tidak bertanggungjawab atas bid’ah dan perpecahan mereka, karena tugasmu hanyalah menyampaikan. إِنَّمَآ أَمْرُهُمْ إِلَى اللهِ(Sesungguhnya urusan mereka hanyalah terserah kepada Allah) Allah akan membalas mereka dengan apa yang Dia kehendaki. ثُمَّ (kemudian) Yakni di hari kiamat nanti. يُنَبِّئُهُم (Allah akan memberitahukan kepada mereka) Yakni mengabarkan kepada mereka. بِمَا كَانُوا۟ يَفْعَلُونَ (apa yang telah mereka perbuat) Yakni perbuatan-perbuatan mereka yang melanggar apa yang disyariatkan Allah dan diwajibkan-Nya atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "159 Sesungguhnya orang-orang yang memecah belah agama-Nya dan mereka menjadi bergolongan. Mereka mengambil teman sebagian orang dan meninggalkan yang lain, mereka adalah Yahudi dan Nasrani, serta orang-orang musyrik dan orang-orang yang membuat pembaruan dalam hal agama. Mereka menjadi berkelompok-kelompok. Jangan pedulikan mereka, engkau tidak ada tanggung jawab kepada mereka. Sesungguhnya perhitungan dan pembalasan atas perbuatan mereka adalah mutlak dari Allah. kemudian Allah akan memberitahukan kepada mereka apa yang telah mereka perbuat di dunia, kemudian Allah memberi balasan atas perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang memecah belah agama mereka} menjadikan agama mereka terpecah belah, sehingga mereka mendekati sebagian dan meninggalkan sebagian lainnya {dan mereka menjadi dalam golongan-golongan} dalam golongan-golongan yang berbeda {sedikit pun kamu tidak bertanggung jawab terhadap mereka. Sesungguhnya urusan mereka hanya kepada Allah. Kemudian Dia akan memberitahukan kepada mereka apa yang telah mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "159. Allah mengancam orang-orang yang memecah-belah agamanya sehingga mereka telah terpecah belah di dalamnya, masing-masing orang mengambil nama yang tidak berguna baginya dalam agamanya seperti Yahudi, Nasrani, dan Majusi, atau imannya tidak sempurna dengannya seperti dengan cara mengambil sesuatu dari syariat dan menjadikannya sebagai agamanya dan meninggalkan yang semisal dengannya atau yang lebih utama darinya sebagaimana yang dilakukan oleh pemecah-belah umat dari kalangan ahli bid’ah dan kesesatan yang memecah belah belah umat. Ayat yang mulia ini menunjukkan bahwa agama memerintahkan kepada kesatuan dan persatuan, dan melarang perpecahan dan perselisihan dalam agama dan persoalan-persoalan prinsip maupun cabang. Agama memerintahkan untuk melepaskan diri dari orang-orang yang memecah-belah umatnya. Dia berfirman, “Tidak ada sedikit pun tanggung jawabmu terhadap mereka.” Maksudnya, kamu tidak termasuk mereka dan mereka tidak termasuk kamu, karena mereka menyelisihi dan menentangmu. “Sesungguhnya urusan mereka hanyalah (terserah) kepada Allah.” Mereka kembali kepadaNya dan Dia membalas mereka sesuai dengan amal mereka. “Kemudian Allah akan memberitahukan kepada mereka apa yang telah mereka perbuat.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 159: Dengan berselisih di dalamnya, di mana masing-masing mengambil nama-nama yang sesungguhnya tidak bermanfaat apa-apa bagi agamanya seperti Yahudi, Nasrani dan Majusi, atau tidak menyempurnakan imannya, seperti mengambil sesuatu dari syari’at dan menjadikan agamanya, namun dia tinggalkan yang lain yang semisalnya atau yang lebih tinggi daripadanya dalam syari’at ini sebagaimana keadaan Ahli bid’ah. Ayat ini menunjukkan bahwa agama memerintahkan bersatu padu dan melarang berpecah belah dalam agama, baik dalam masalah ushul (dasar agama) maupun furu’ (cabang). Yakni golongan yang amat fanatik kepada pemimpin-pemimpinnya. Dalam sebuah qira’at dibaca “Faaraquu” yakni meninggalkan agama yang mereka diperintahkan untuk menjalankannya, seperti orang-orang Yahudi dan Nasrani. Dalam ayat ini, Allah memerintahkan Rasul-Nya untuk berlepas diri dari orang-orang yang memecah belah agamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 159",
    "description": "Penjelasan tentang nasib orang kafir pada hari kiamat yang terdapat pada ayat di atas dilanjutkan dengan penjelasan tentang ada kelompokkelompok sesat pada ayat ini. Sesungguhnya orang-orang yang memecah belah agamanya'padahal agama pada awalnya hanya satu, yaitu agama tauhid, sebagaimana sabda nabi , kami, para nabi, bagaikan anakanak satu ayah dari ibu yang berbeda, agama kami satu. 'dan mereka menjadi terpecah dalam golongan-golongan dengan mengikuti hawa nafsunya sendiri-sendiri, sesuai dengan kepentingan masing-masing di mana setiap golongan berbangga dengan golongannya sendiri, sedikit pun bukan tanggung jawabmu, wahai nabi Muhammad, atas mereka. Kamu telah melaksanakan tugas kerasulanmu, sementara mereka memilih jalan kekafiran. Hati mereka telah terkunci untuk menerima kebenaran. Sesungguhnya urusan mereka terserah kepada Allah. Allah yang akan memutuskan nasib mereka, maka janganlah kamu bersedih atas kekafiran mereka. Kemudian dia akan memberitahukan kepada mereka apa yang telah mereka perbuat. Tentang dosa-dosa mereka dan balasan terhadap mereka pada hari kiamat nanti. Berkaitan dengan hari pembalasan, Allah menjelaskan tentang anugerah-Nya yang agung terhadap orang mukmin yang berbuat baik. Barang siapa berbuat kebaikan, walaupun sedikit, akan men-dapat balasan sepuluh kali lipat, bahkan bisa lebih dari itu sampai tujuh ratus kali lipat dari amalnya, karena Allah mahakaya. Hal itu jika amal baik tersebut disertai dengan keikhlasan dan sesuai dengan aturan agama islam. Dan barang siapa berbuat kejahatan dibalas seimbang dengan kejahatannya sebagai bentuk keadilan Allah. Mereka sedikit pun tidak dirugikan atau dizalimi. Allah tidak akan berbuat zalim sedikit pun terhadap hambahamba-Nya, seperti mengurangi pahala atau menambahkan dosa yang tidak diperbuat. Dialah yang maha pemurah, maha penyayang."
  }
]