[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barang siapa bertemu dengan tuhannya pada hari kiamat dengan amal kebaikan dari amal-amal yang shalih, maka baginya sepuluh kali lipat (pahala) dari kebaikannya itu. Dan barangsiapa bertemu dengan tuhannya dengan dosa, maka dia tidak dikenai hukuman, melainkan dengan yang sebanding dengan kesalahannya. Dan mereka tidaklah terzhalimi meski sebesar dzarrah sekalipun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Orang mukmin yang datang pada hari Kiamat dengan membawa kebajikan akan dilipatgandakan (pahalanya) oleh Allah sebanyak sepuluh kali lipat. Sedangkan orang yang datang dengan membawa keburukan hanya akan dihukum berdasarkan besar atau kecilnya keburukan tersebut, tidak akan dilebihkan dari itu. Dan pada hari Kiamat nanti mereka tidak akan dizalimi dengan cara dikurangi (pahala) kebajikannya maupun ditambah hukuman keburukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "160. Allah memberi dorongan untuk melakukan amal shalih bahwa orang yang datang pada hari kiamat dengan membawa amal kebaikan maka dia akan dibalas dengan kebaikan 10 kali lipat, sebagai bentuk karunia dari-Nya. Dan barangsiapa yang melakukan amal buruk maka dia akan dibalas dengan keburukan semisalnya, dan pahala mereka tidak akan dikurangi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "160. مَن جَآءَ بِالْحَسَنَةِ فَلَهُۥ عَشْرُ أَمْثَالِهَا ۖ (Barangsiapa membawa amal yang baik, maka baginya (pahala) sepuluh kali lipat amalnya) Dan ini merupakan ketentuan Allah yang telah Dia tetapkan pada diri-Nya. Dan mungkin saja Dia akan membalas dengan balasan yang lebih banyak, seperti biji yang menumbuhkan tujuh tangkai, dan terdapat beberapa kebaikan yang mana pelakunya akan dibalas dengan balasan tanpa batas. وَمَن جَآءَ بِالسَّيِّئَةِ(dan barangsiapa yang membawa perbuatan jahat) Yakni perbuatan-perbuatan buruk. فَلَا يُجْزَىٰٓ إِلَّا مِثْلَهَا(maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya) Tidak lebih dari itu, sesuai dengan besar dan kecilnya keburukan tersebut. Perbuatan syirik akan dibalas dengan siksa yang kekal di neraka, dan orang beriman yang berbuat maksiat akan dibalas dengan balasan setimpal sesuai dengan siksaan yang telah dijelaskan ukurannya, dan ini apabila ia tidak bertaubat; adapun bagi orang yang telah bertaubat dan amalan kebaikannya mengalahkan amal keburukannya atau Allah memberikan rahmat dan karunia ampunan-Nya kepadanya maka ia tidak akan disiksa. وَهُمْ(sedang mereka) Yakni orang yang datang dengan amal kebaikan dan orang yang datang dengan amal keburukan. لَا يُظْلَمُونَ(tidak dianiaya) Baik itu dengan mengurangi pahala kebaikan orang yang berbuat baik atau dengan menambah siksaan bagi orang yang berbuat keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "160 Aturan umum untuk orang-orang yang beriman adalah bahwa: Barangsiapa membawa amal yang baik, maka baginya pahala sepuluh kali lipat amalnya; dan kadang ditambah hingga tujuh ratus kali lipat. Dan terkadang juga diberi balasan tanpa perhitungan. Dan barangsiapa yang membawa perbuatan jahat maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya, tanpa ada tambahan. Pembuat amal saleh tidak dizalimi dengan pengurangan pahala, begitu juga para pembuat keburukan tidak dizalimi dengan tambahan siksa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berbuat kebaikan, dia akan mendapat balasan sepuluh kali lipatnya. Siapa saja yang berbuat keburukan, dia tidak akan diberi balasan melainkan yang seimbang dengannya. Mereka tidak dizalimi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160. Kemudian Allah menyebutkan sifat balasan. Dia berfirman, “Barangsiapa membawa amal baik,” perkataan dan perbuatan, lahir dan batin yang terkait dengan hak Allah dan hak hamba-hambaNya, “maka baginya (pahala) sepuluh kali lipat amalnya.” Ini adalah pelipatgandaan minimal. “Dan barangsiapa yang membawa perbuatan yang jahat, maka dia tidak diberi pembalasan melainkan yang seimbang dengan kejahatannya.” Ini adalah keadilan dan kebaikan Allah yang sempurna dan bahwa Dia tidak berlaku dzalim sedikit pun. Oleh karena itu dia berfirman, “Sedang mereka sedikit pun tidak dianiaya (dirugikan).”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 160: Ini merupakan balasan paling sedikitnya, dan bisa menjadi banyak tergantung niatnya. Ini merupakan bukti keadilan Allah dan ihsan-Nya, dan bahwa Dia tidak menzalimi meskipun seberat dzarrah pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 160",
    "description": "Berkaitan dengan hari pembalasan, Allah menjelaskan tentang anugerah-Nya yang agung terhadap orang mukmin yang berbuat baik. Barang siapa berbuat kebaikan, walaupun sedikit, akan men-dapat balasan sepuluh kali lipat, bahkan bisa lebih dari itu sampai tujuh ratus kali lipat dari amalnya, karena Allah mahakaya. Hal itu jika amal baik tersebut disertai dengan keikhlasan dan sesuai dengan aturan agama islam. Dan barang siapa berbuat kejahatan dibalas seimbang dengan kejahatannya sebagai bentuk keadilan Allah. Mereka sedikit pun tidak dirugikan atau dizalimi. Allah tidak akan berbuat zalim sedikit pun terhadap hambahamba-Nya, seperti mengurangi pahala atau menambahkan dosa yang tidak diperbuat. Dialah yang maha pemurah, maha penyayang pada akhir surah ini Allah memberi arahan kepada nabi mengenai berbagai soal yang penting. Katakanlah, wahai nabi Muhammad, sesungguhnya tuhanku yang memilikiku, memeliharaku, dan mendidikku, telah memberiku petunjuk ke jalan yang lurus, agama yang benar, agama nabi ibrahim yang lurus yang condong kepada kebenaran. Dia, nabi ibrahim, tidak termasuk orang-orang musyrik, bahkan menjadi bapak orang-orang yang bertauhid, menjadi teladan dan contoh yang baik bagi kaum muslim. Ayat ini menandaskan kebenaran agama islam sebagai agama yang lurus, pelanjut dari agama yang dibawa oleh para nabi terdahulu."
  }
]