[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”sesungguhnya aku telah diberi petunjuk oleh tuhanku menuju jalan lurus yang mengantarkan ke surgaNYa, yaitu agama islam yang mengatur urusan dunia dan akhirat. Dan Itu adalah agama tauhid, agama Ibrahim dan Ibrahim bukanlah termasuk orang-orang yang menyekutukan Allah bersama sesuatu yang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "161. Katakanlah -wahai Rasul- kepada orang-orang yang musyrik dan mendustakanmu itu, “Sesungguhnya aku dibimbing oleh Rabbku menuju jalan yang lurus. Yaitu jalan agama yang menegakkan kemaslahatan dunia dan Akhirat. Agama itu adalah agama Ibrahim yang senantiasa cenderung kepada kebenaran dan sama sekali tidak termasuk golongan orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "161. Allah memerintahkan Rasulullah untuk menyampaikan: Allah telah mengaruniakan kepadaku petunjuk menuju agama Islam, dengan mengajarkanku agama yang lurus, yaitu agama ayah kami, Ibrahim; itu merupakan agama yang lurus dan teguh di atas ketauhidan. Dan Ibrahim bukanlah termasuk orang-orang yang menyekutukan Allah dengan selain-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "161. إِلَىٰ صِرٰطٍ مُّسْتَقِيمٍ (kepada jalan yang lurus) Yakni agama Nabi Ibramih. دِينًا قِيَمًا(agama yang benar) Yakni agama yang lurus yang tidak ada kebengkokan didalamnya. حَنِيفًا ۚ (yang lurus) Yakni yang mengarah kepada kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "161 Katakanlah wahai Nabi: “Sesungguhnya aku telah diberi petunjuk oleh Tuhanku kepada jalan yang lurus, yaitu agama yang benar, agama Ibrahim yang lurus tanpa ada kebengkokan. Ibrahim itu bukanlah termasuk musyrik yang condong kepada agama yang keliru dan menyimpang dari agama yang benar yaitu agama Islam, juga bukan orang-orang musyrik yang menyekutukan Allah dengan sesembahan lain”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya Tuhanku telah membimbingku ke jalan yang lurus, agama yang benar} menegakkan kebaikan dunia dan akhirat {agama Ibrahim yang lurus} mengarah pada kebenaran {dan Ibrahim tidak termasuk orang-orang musyrik.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "161. Allah memerintahkan NabiNya agar berkata dan mengumumkan sesuatu yang dipijaknya dalam bentuk hidayah kepada jalan yang lurus, agama yang seimbang yang mengandung akidah-akidah yang berguna, amal yang shalih, perintah kepada semua yang baik, melarang dari segala yang buruk, yang dianut oleh para Nabi dan Rasul Allah, khususnya iman orang-orang yang bertauhid. Bapak para Nabi yang diutus sesudahnya, Khalil ar-Rahman, Ibrahim. Yaitu agama yang lurus yang condong dari semua agama yang tidak lurus yang dianut oleh para penyimpang seperti Yahudi, Nasrani, dan orang-orang musyrik. Ini umum."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 161: Agama yang lurus, yang mengandung aqidah yang bermanfaat, amal yang saleh, memerintahkan semua kebaikan dan melarang semua keburukan, agama yang dipegang para nabi dan rasul, khususnya imamul hunafa’ Ibrahim ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 161",
    "description": "Pada akhir surah ini Allah memberi arahan kepada nabi mengenai berbagai soal yang penting. Katakanlah, wahai nabi Muhammad, sesungguhnya tuhanku yang memilikiku, memeliharaku, dan mendidikku, telah memberiku petunjuk ke jalan yang lurus, agama yang benar, agama nabi ibrahim yang lurus yang condong kepada kebenaran. Dia, nabi ibrahim, tidak termasuk orang-orang musyrik, bahkan menjadi bapak orang-orang yang bertauhid, menjadi teladan dan contoh yang baik bagi kaum muslim. Ayat ini menandaskan kebenaran agama islam sebagai agama yang lurus, pelanjut dari agama yang dibawa oleh para nabi terdahulu. Katakanlah, wahai nabi Muhammad, sesungguhnya salatku yang aku kerjakan selama hidupku, ibadahku atau kurbanku, hidupku dengan berbagai amalan yang aku kerjakan selama itu, dan matiku dengan membawa iman dan amal saleh, hanyalah untuk Allah, tuhan seluruh alam, bukan untuk lain-Nya. Ayat ini menegaskan tentang keharusan manusia untuk mengabdi hanya kepada Allah, baik dalam bentuk ibadah ritual atau lainnya, semenjak hidup sampai mati."
  }
]