[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada kaum musyrikin, ”sesungguhnya shalatku dan ‘nusuk’ ku, maksudnya sembelihanku, hanya bagi Allah semata, bukan untuk berhala-berhala, juga bukan untuk orang-orang mati dan jin, dan bukan selain itu semua dari yang kalian menyembelih sembelihan untuk selain Allah, dan bukan dengan nama selain Allah sebagaimana yang kalian lakukan. Dan hidupku dan matiku hanyalah untuk Allah, tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "162. Katakanlah -wahai Rasul-, “Sesungguhnya salatku, sembelihan yang aku persembahkan untuk Allah dan dengan menyebut nama Allah bukan nama yang lain, serta hidup dan matiku, semuanya untuk Allah, satu-satunya Tuhan yang menguasai segenap makhluk, tidak ada Tuhan lain yang memiliki bagian di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "162-163. Hai Muhammad, Katakanlah: \"Sesungguhnya shalatku yang aku persembahkan untuk Tuhanku, ibadahku, kebaikan yang aku lakukan dalam hidupku, dan kematian yang telah Allah tetapkan bagiku, semua itu hanya aku persembahkan bagi Allah sebagai Tuhan yang berhak disembah, Tuhan bagi seluruh makhluk, tidak ada sekutu bagi-Nya. Dengan ketauhidan yang sempurna ini, aku diperintahkan oleh Tuhanku, dan aku adalah orang yang pertama kali dalam umat ini, yang tunduk kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "162 قُلْ إِنَّ صَلَاتِى وَنُسُكِى (Katakanlah: sesungguhnya sembahyangku, ibadatku) Kata (النسك) adalah bentuk jamak dari kata (النسيكة) yang berarti sembelihan. Dan pendapat lain mengatakan maknanya adalah ibadah. وَمَحْيَاىَ وَمَمَاتِى (hidupku dan matiku) Yakni amal-amal kebaikan yang aku kerjakan dalam hidupku. Adapun yang termasuk dari amal kebaikan setelah kematian seperti berwasiat untuk bersedekah dan melakukan berbagai kebaikan yang mendekatkan kepada Allah. Dan pendapat lain mengatakan yang dimaksud adalah kehidupan dan kematian itu sendiri. لِلّٰهِ رَبِّ الْعٰلَمِينَ (hanyalah untuk Allah, Tuhan semesta alam) Yakni ikhlas hanya untuk-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Apa yang disampaikan oleh Nabi -صلى الله عليه وسلم- dari ayat ini, adalah apa yang wajib dicontoh oleh setiap mukmin sehingga mereka senantiasa melakukan amalan dengan tujuan menggapai ridho Allah. 2 ). Sesungguhnya perilaku yang mesti dimiliki oleh setiap mukmin adalah keseimbangan dirinya dalam aqidah dan ibadah, dan perilaku seseorang yang selalu menggambarkan akhlaq yang mulia, baik dia sedang berada di dalam rumahnya, atau sedang di tempat kerja, dan dimanapun ia berada : { إِنَّ صَلَاتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ الْعَالَمِينَ } \"Katakanlah: sesungguhnya sembahyangku, ibadatku, hidupku dan matiku hanyalah untuk Allah, Tuhan semesta alam.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "162 Katakanlah wahai Rasul: sesungguhnya sembahyangku beserta segala macamnya, ibadatku dan taqarrubku, hidupku dan berbagai kebaikan dan ketaatan di dalamnya, juga beserta matiku dalam keimanan dan amal saleh, semua itu adalah murni hanya untuk Allah Tuhan semesta alam dan Tuhan para jin dan manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya shalatku, ibadahku} kurbanku {hidupku dan matiku} hidupku dan matiku {hanyalah untuk Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "162. Kemudian Dia mengkhususkan dari itu ibadah yang paling mulia. Dia berfirman, “Katakanlah, ‘Sesungguhnya shalatku, sembelihanku,.” maksudnya, penyembelihanku. Hal itu karena kemuliaan dua ibadah ini serta keutamaannya, dan keduanya merupakan petunjuk kecintaan kepada Allah, pengikhlasan agama untukNya, mendekatkan diri kepadaNya dengan hati dan lisan serta anggota badan. Dan dengan penyembelihan yang merupakan pengorbanan harta yang dicintai oleh jiwa demi yang lebih dia cintai, yaitu Allah. Dan barangsiapa ikhlas dalam shalat dan penyembelihannya, maka secara otomatis dia akan ikhlas pada amal-amalnya yang lain. firmanNya, “Hidupku dan matiku,” yakni apa yang diberikan kepadaku dalam hidupku, apa yang Allah titipkan kepadaku dana pa yang ditakdirkan atasku pada waktu matiku. Semua itu “hanyalah untuk Allah, Tuhan semesta alam.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 162: Ayat sebelumnya masih umum, dan ayat ini lebih khusus, dengan menyebutkan ibadah yang utama. Ada yang mengartikan “nusuk” di ayat ini dengan “sembelihanku”. Disebutkan shalat dan kurban adalah karena keutamaan kedua ibadah ini, di mana hal itu menunjukkan cinta kepada Allah Ta’ala, mengikhlaskan ibadah kepada-Nya, dan menunjukkan pendekatan diri kepada Allah baik dengan hati, lisan, anggota badan maupun dengan harta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 162",
    "description": "Katakanlah, wahai nabi Muhammad, sesungguhnya salatku yang aku kerjakan selama hidupku, ibadahku atau kurbanku, hidupku dengan berbagai amalan yang aku kerjakan selama itu, dan matiku dengan membawa iman dan amal saleh, hanyalah untuk Allah, tuhan seluruh alam, bukan untuk lain-Nya. Ayat ini menegaskan tentang keharusan manusia untuk mengabdi hanya kepada Allah, baik dalam bentuk ibadah ritual atau lainnya, semenjak hidup sampai mati. Tidak ada sekutu bagi-Nya dalam bentuk apa pun, karena hal itu mustahil bagi Allah. Dan demikianlah yang diperintahkan kepadaku, karena inti dari ajaran islam, yaitu ajaran yang dibawa oleh nabi-nabi terdahulu, adalah ketauhidan. Dan aku adalah orang yang pertama-tama berserah diri atau muslim. Sebagai nabi, beliaulah yang harus mengawal ketauhidan ini sebelum umatnya."
  }
]