[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada sekutu bagiNya dalam uluhiyah, rububiyah, dan asma’dan sifatNya. Dan dengan tauhid yang murni itu, Allah memeintahkan aku orang yang pertama kali mengakui dan patuh kepada Allah dari umat ini. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "163. Dia lah -Subḥānahu- satu-satunya Tuhan yang tidak ada sekutu bagi-Nya dan tidak ada tuhan yang berhak disembah selain Dia. Akidah tauhid yang bersih dari unsur syirik inilah yang Allah perintahkan kepadaku. Dan aku orang pertama di antara umat ini yang mendekatkan diri kepada-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "163. لَا شَرِيكَ لَهُۥ ۖ (Tiada sekutu bagi-Nya) Yakni aku tidak mempersekutukan-Nya dalam sholat, berkurban, hidup, dan mati dengan sesembahan yang lain. وَأَنَا۠ أَوَّلُ الْمُسْلِمِينَ (dan aku adalah orang yang pertama-tama menyerahkan diri) Yakni orang Islam yang pertama dalam umatnya. Ali bin Abi Thalib berkata: bahwa Rasulullah apabila berdiri untuk mengerjakan shalat mengatakan “(وجهت وجهي للذي فطر السماوات والأرض) (aku menghadapkan wajahku kepada pencipta langit dan bumi) sampai kalimat (وأنا أول المسلمين) (dan aku adalah orang yang pertama-tama menyerahkan diri)”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "163 Tidak ada sekutu bagi Allah dalam ibadah dan segala perbuatanku. Tuhanku telah memerintahkan kepadaku untuk itu dan aku mentaati-Nya. Aku adalah orang pertama dari umatku yang menyerahkan diri kepada Allah ”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada sekutu bagiNya. Itulah yang diperintahkan kepadaku. Aku adalah orang pertama dari golonga orang muslim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "163. “Tiada sekutu bagiNya” dalam ibadah, sebagaimana Dia tidak memiliki sekutu dalam hak kepemilikan dan pengaturan. Keikhlasan kepada Allah ini bukanlah sesuatu yang baru dariku, tidak pula sesuatu yang aku ada-adakan dari diriku sendiri. Akan tetapi “itulah yang diperintahkan kepadaku,” secara pasti, di mana aku tidak keluar dari tanggung jawab kecuali dengan menaatinya. “Dan aku adalah orang yang pertama menyerahkan diri (kepada Allah),” dari umat ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 163: Di antara umat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 163",
    "description": "Tidak ada sekutu bagi-Nya dalam bentuk apa pun, karena hal itu mustahil bagi Allah. Dan demikianlah yang diperintahkan kepadaku, karena inti dari ajaran islam, yaitu ajaran yang dibawa oleh nabi-nabi terdahulu, adalah ketauhidan. Dan aku adalah orang yang pertama-tama berserah diri atau muslim. Sebagai nabi, beliaulah yang harus mengawal ketauhidan ini sebelum umatnya. Katakanlah, wahai nabi Muhammad, dengan penuh keheranan, apakah patut aku mencari tuhan selain Allah, padahal dialah tuhan bagi segala sesuatu, pencipta jagat raya dan seisinya, pengatur, dan pemelihara bagi semua makhluk-Nya. Karena segala sesuatu selain Allah tidak mempunyai kekuasaan apa-apa, maka tidak patut untuk disembah. Setiap perbuatan dosa seseorang, pelanggaran ketentuan agama, baik besar maupun kecil, dirinya sendiri yang bertanggung jawab di hadapan Allah pada hari kiamat nanti. Dan seseorang tidak akan memikul beban dosa orang lain, kecuali jika orang itu mengajak orang lain berbuat dosa. Kemudian kepada tuhanmulah kamu kembali, karena semua makhluk adalah milik Allah, Allah-lah pewaris makhluk-Nya pada hari kiamat. Dan, akan diberitahukan-Nya kepadamu apa yang dahulu kamu perselisihkan, dengan menjelaskan mana yang benar dan mana yang salah. Setiap orang akan dibalas sesuai dengan perbuatannya."
  }
]