[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), ”apakah selain Allah aku akan mencari tuhan, padahal Dia dalah pencipta segala sesuatu, pemilik dan pengaturnya? Dan tidaklah manusia melakukan hal yang buruk kecuali dosanya akan menjadi tanggungannya. Dan sesorang tidak akan memikul dosa orang lain. Kemudian kepada tuhan kalian tempat kembali kalian pada hari kiamat, lalu Dia memberitahukan kepada kalian apa yang kalian perselisihkan dalam perkara agama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "164. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, “Apakah aku akan mencari tuhan lain selain Allah, sedangkan Dia -Subḥānahu wa Ta'ālā- Rabb bagi segala sesuatu? Dia Rabb bagi tuhan-tuhan yang kalian sembah selain Dia. Dan orang yang tidak bersalah tidak akan menanggung dosa orang lain. Kemudian hanya kepada Allah-lah kalian akan dikembalikan di hari Kiamat. Lalu Dia akan memberitahu kalian perihal urusan agama yang kalian perselisihkan di dunia.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "164. Allah menegaskan bagi nabi-Nya keikhlasan ibadahnya dan mengungkapkan olokan-Nya bagi orang-orang musyrik. Katakanlah kepada mereka: \"Apakah aku akan mencari Tuhan selain Allah? Sedangkan Dia telah menciptakan seluruh makhluk dan mengatur segala urusan mereka. Dan tidaklah seseorang melakukan kemaksiatan melainkan dialah yang akan menanggung dosanya; dan orang yang tidak berdosa tidak akan menanggung dosa orang lain. Dan seseorang tidak akan disiksa akibat kejahatan orang lain. Kemudian kalian akan dikumpulkan menuju Pencipta kalian pada hari kiamat, kemudian Dia akan mengabarkan dengan kabar yang jelas, tentang perkara-perkara agama yang dulu kalian perselisihkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "164. قُلْ أَغَيْرَ اللهِ أَبْغِى رَبًّا (Katakanlah: “Apakah aku akan mencari Tuhan selain Allah) Yakni bagaimana aku akan mencari Tuhan selain Allah dan meninggalkan peribadatan kepada-Nya, atau bagaimana aku akan mencari sekutu bagi Allah untuk aku sembah keduanya, padalah Dia adalah Tuhan bagi segala sesuatu, dan apa yang kalian ajak aku untuk menyembahnya merupakan makhluk dan ciptaan-Nya seperti aku, tidak mampu memberi manfaat dan madharat. وَلَا تَكْسِبُ كُلُّ نَفْسٍ إِلَّا عَلَيْهَا ۚ (Dan tidaklah seorang membuat dosa melainkan kemudharatannya kembali kepada dirinya sendiri) Maka tidak ada orang yang bisa memberi dosa kepada orang lain. وَلَا تَزِرُ وَازِرَةٌ وِزْرَ أُخْرَىٰ ۚ( dan seorang yang berdosa tidak akan memikul dosa orang lain) Maka orang yang tidak berdosa tidak akan menanggung dosa orang yang berdosa. Dan dalam ayat ini terdapat bantahan atas apa yang orang-orang jahiliyah lakukan, yang menghukum seseorang karena dosa yang dilakukan kerabatnya, atau menghukum suatu kabilah karena dosa yang dilakukan kabilah lain. Dan dalam ayat lain disebutkan: ليحملوا أوزارهم كاملة يوم القيامة ومن أوزار الذين يضلونهم بغير علم “agar mereka memikul dosa-dosanya dengan sepenuh-penuhnya pada hari kiamat dan sebahagian dosa-dosa orang yang mereka sesatkan yang tidak mengetahui sedikitpun (bahwa mereka disesatkan”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "164 Katakanlah sebagai jawaban kepada orang-orang yang musyrik dan mengajak menyembah berhala itu wahai Nabi: “Apakah aku akan mencari Tuhan selain Allah, bagaimana bisa aku menyembah selain Allah dan meninggalkan untuk menyembah Allah? Padahal Dia adalah Tuhan dan Penguasa atas segala sesuatu. Tidak ada seorang pun yang berbuat dosa melainkan kemudharatannya berupa siksa dan akibatnya kembali kepada dirinya sendiri; dan seorang yang berdosa tidak akan memikul dosa orang lain. Tidak ada orang yang disiksa sebab kesalahan orang lain. Kemudian kepada Tuhanmulah kamu kembali pada hari kiamat, dan akan Allah beritakan kepadamu apa yang kamu perselisihkan dalam hal keyakinan dan amal, kemudian kalian akan diberi balasan atas perbuatan kalian.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Apakah kepada selain Allah, aku mencari} mencari {tuhan, padahal Dialah Tuhan bagi segala sesuatu. Setiap orang tidaklah berbuat dosa, kecuali dia bertanggung jawab atas dirinya sendiri. Seseorang tidak akan memikul beban dosa orang lain} seseorang tidak akan dibebani dosa orang lain {Kemudian kepada Tuhan kalianlah, tempat kembali kalian, lalu Dia akan memberitahukan kepada kalian} memberi kabar kepada kalian {tentang apa yang dahulu kalian perselisihkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "164. “Katakanlah, ‘Apakah aku akan mencari tuhan selain Allah’. “ maksudnya, apakah aku akan mencari tuhan selain Allah dari kalangan makhluk. Layakkah itu bagiku. Baikkah itu bagiku kalau aku menjadikan selainNYa sebagai pendidik dan pengaturku sementara Dia adalah Tuhan segala sesuatu? Semua makhluk berada di bawah rububiyahNya dan tunduk kepada perintahNya, maka wajib atasku dan atas selainku menjadikan Allah sebagai TUhan, ridha kepadaNya dan agar tidak bergantung kepada para makhluk yang miskin lagi lemah. Kemudian Allah mendorong dan memperingatkan kita dengan balasan itu. Dia berfirman, “Dan tidaklah seseorang membuat sesuatu,” yang baik dan yang buruk “melainkan kemudaratannya kembali kepada dirinya sendiri.” Sebagaimana Firman Allah, Barangsiapa yang mengerjakan amal yang saleh maka (pahalanya) untuk dirinya sendiri dan barangsiapa mengerjakan perbuatan jahat, maka (dosanya) untuk dirinya sendiri (Fushilat: 46). “Dan seorang yang berdoosa tidak akan memikul dosa orang lain.” Akan tetapi masing-masing memikul dosanya sendiri-sendiri. Jika seseorang menjadi penyebab kesesatan dan dosa orang lain, maka dia memikul dosa sebagai penyebab tanpa mengurangi dosa pelaku sedikit pun. “Kemudian kepada Tuhanmulah kamu kembali,” pada Hari Kiamat. “Dan akan diberitakanNya kepadamu apa yang kamu persilahkan.” Baik dan buruk, dan membalasmu dengan itu dengan sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 164: Maksudnya masing-masing orang memikul dosanya sendiri-sendiri. Kemudian Dia akan memberikan balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 164",
    "description": "Katakanlah, wahai nabi Muhammad, dengan penuh keheranan, apakah patut aku mencari tuhan selain Allah, padahal dialah tuhan bagi segala sesuatu, pencipta jagat raya dan seisinya, pengatur, dan pemelihara bagi semua makhluk-Nya. Karena segala sesuatu selain Allah tidak mempunyai kekuasaan apa-apa, maka tidak patut untuk disembah. Setiap perbuatan dosa seseorang, pelanggaran ketentuan agama, baik besar maupun kecil, dirinya sendiri yang bertanggung jawab di hadapan Allah pada hari kiamat nanti. Dan seseorang tidak akan memikul beban dosa orang lain, kecuali jika orang itu mengajak orang lain berbuat dosa. Kemudian kepada tuhanmulah kamu kembali, karena semua makhluk adalah milik Allah, Allah-lah pewaris makhluk-Nya pada hari kiamat. Dan, akan diberitahukan-Nya kepadamu apa yang dahulu kamu perselisihkan, dengan menjelaskan mana yang benar dan mana yang salah. Setiap orang akan dibalas sesuai dengan perbuatannya. Pada akhir surah ini dijelaskan bahwa hidup adalah cobaan dari Allah. Dan dialah yang menjadikan kamu sebagai khalifah-khalifah di bumi, setiap generasi digantikan oleh generasi berikutnya sampai hari kiamat, untuk meramaikan bumi di atas dasar nilai-nilai ilahi. Dan dia mengangkat derajat sebagian kamu di atas yang lain'ada yang kaya, miskin, lemah, kuat, sehat, sakit, dan sebagainya'untuk menguji kesyukuranmu atas karunia yang diberikan-Nya kepadamu. Sesungguhnya tuhanmu sangat cepat memberi hukuman bagi mereka yang durhaka dan sungguh, dia maha pengampun bagi yang taat dan bertobat dari dosadosanya, maha penyayang kepada makhluk-Nya."
  }
]