[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah lah yang menjadikan kalian penguasa-penguasa di muka bumi yang menggantikan umat manusia sebelum kalian, setelah Allah memusnahkan mereka dan menjadikan kalian pengganti mereka di muka bumi, untuk memamkmurkannya sepeninggal mereka dengan ketaatan kepada tuhan kalian, dan Dia meninggikan sebagian dari kalian dalam soal rizki dan kekuatan diatas sebagian yang lain beberapa derajat, untuk menguji kalian terkait karunia-karunia yang diberikan kepada kalian, sehingga akan tampak dalam pandangan manusia siapa orang yang bersyukur dan yang tidak. Sesungguhnya tuhanmu amat cepat siksaanNya terhadap orang-orang yang kafir dan bermaksiat kepadaNya. Dan sesungguhnya Dia maha pengampun bagi orang yang beriman kepadaNya dan beramal shalih serta bertaubat dari dosa-dosa besar, lagi maha penyayang terhadapnya. Alghafur dan Arrahim adalah dua nama yang mulia dari nama-nama Allah yang bagus (asmaul husna)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165. Dan Allah-lah yang menjadikan kalian sebagai penerus umat-umat sebelum kalian untuk memakmurkan bumi dan meninggikan derajat sebagian dari kalian dari segi fisik, rezeki, dan lain-lain di atas sebagian yang lain, untuk menguji kalian di dalam karunia yang Dia berikan kepada kalian. Sesungguhnya Rabbmu -wahai Rasul- Mahacepat hukuman-Nya. Segala sesuatu yang akan datang adalah dekat bagi-Nya. Dan Dia Maha Menerima tobat lagi Maha Penyayang bagi hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "165. Dengan keagungan dan kekuasaan Allah, Dia menjadikan kalian sebagai khalifah untuk memakmurkan bumi, sebagian kalian akan menggantikan sebagian lainnya. Allah mengangkat sebagian kalian di atas sebagian lainnya dengan ilmu, rezeki, dan kekuatan untuk menguji kalian dalam apa yang telah Dia karuniakan. Sesungguhnya Pencipta kalian sangat cepat balasan-Nya bagi orang yang bermaksiat, dan Maha mengampuni dosa hamba-hamba-Nya yang bertaubat serta Maha mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "165. وَهُوَ الَّذِى جَعَلَكُمْ خَلٰٓئِفَ الْأَرْضِ(Dan Dialah yang menjadikan kamu penguasa-penguasa di bumi) Yakni menjadikan kalian penguasa-penguasa sebagai pengganti dari penguasa-penguasa umat-umat terdahulu. Kalian mengganti mereka dalam memakmurkan bumi. Pendapat lain mengatakan yang dimaksud adalah bahwa orang-orang tersebut merupakan khalifah Allah di bumi. وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ(dan Dia meninggikan sebahagian kamu atas sebahagian (yang lain) beberapa derajat) Yakni dalam hal rupa, rezeki, kekuatan, kemuliaan, dan ilmu, Allah menjadikan kalian dalam derajat yang berbeda-beda. لِّيَبْلُوَكُمْ فِى مَآ ءَاتَىٰكُمْ ۗ (untuk mengujimu tentang apa yang diberikan-Nya kepadamu) Yakni untuk menguji kalian dalam hal-hal tersebut yang telah diberikan kepada kalian. إِنَّ رَبَّكَ سَرِيعُ الْعِقَابِ (Sesungguhnya Tuhanmu amat cepat siksaan-Nya) Dan meskipun siksaan itu berada di akhirat namun ia pasti akan datang, dan setiap yang akan datang itu dekat waktunya. وَإِنَّهُۥ لَغَفُورٌ رَّحِيمٌۢ (dan sesungguhnya Dia Maha Pengampun lagi Maha Penyayang) Yakni memiliki ampunan dan rahmat yang banyak bagi orang yang beriman kepada Allah, Rasul-Rasul-Nya, kitab-kitab-Nya. Serta mengikuti petunjuk yang Dia turunkan. Dalam hal ini Allah memberi penekanan dalam hakikat sifat-Nya ‘pemberi ampun’ dengan penekanan yang lebih daripada penekanan dalam sifat ‘cepat dalam siksa-Nya’, dan hal ini menjelaskan bahwa rahmat Allah lebih besar daripada kemurkaan-Nya. Rasulullah bersabda: “ketika Allah telah selesai menciptakan makhluk-makhluk-Nya, ia menulis dalam kitab yang ada di sisi-Nya diatas ‘arsy: ‘sesungguhnya rahmat-Ku mengalahkan kemurkaan-Ku’.” Hadist riwayat Imam Muslim."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ إِنَّ رَبَّكَ سَرِيعُ الْعِقَابِ وَإِنَّهُ لَغَفُورٌ رَحِيمٌ } \"Sesungguhnya Tuhanmu amat cepat siksaan-Nya dan sesungguhnya Dia Maha Pengampun lagi Maha Penyayang\" , dan diantara kelembutan al-Qur'an ditunjukkan oleh ayat ini : yaitu kesederhanaan dalam pensifatan { سَرِيعُ الْعِقَابِ } dengan satu penekanan saja, sedangkan dikuatkan dalam pensifatan { لَغَفُورٌ رَحِيمٌ } dengan tiga penekanan, yaitu : إن , dan لام التوكيد , dan التوكيد اللفظي yang diterangkan dengan lafazh (الرحيم) sebagai taukid untuk lafazh (الغفور); agar menjadi tenang jiwa-jiwa setiap pelaku amal shalih akan ampunan dari Allah dan rahmat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165 Dialah yang menjadikan kamu penguasa-penguasa dalam rangka memakmurkan bumi. Kalian menjadi pemimpin atas sebagian kalian dalam bumi. Dia juga meninggikan derajat sebagian kamu atas sebagian yang lain beberapa derajat dalam hal ilmu, harta, pangkat dan lainnya, tidak lain untuk mengujimu tentang apa yang diberikan-Nya kepadamu. Sesungguhnya Tuhanmu amat cepat siksaan-Nya kepada mereka yang durhaka dan sesungguhnya Dia Maha Pengampun atas dosa-dosa orang yang beriman kepada-Nya, rasul-Nya dan kitab-kitab-Nya lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menjadikan kalian sebagai khalifah-khalifah di bumi} meneruskan kepemimpinan pendahulu kalian di bumi {dan Dia meninggikan sebagian kalian beberapa derajat atas sebagian lain untuk menguji kalian} menguji kalian {atas apa yang Dia berikan kepada kalian. Sesungguhnya Tuhanmu sangat cepat hukumanNya. Sesungguhnya Dia Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "165. “Dan Dia-lah yang menjadikan kamu penguasa-penguasa di bumi.” Maksudnya, sebagian menggantikan (sebagai pemimpin) sebagian yang lain. Allah menempatkanmu di bumi dan Dia menundukkan sesuatu yang ada padanya untukmu. Dia mengujimu untuk melihat bagaimana kamu beramal. “Dan Dia meninggikan sebagian kamu atas sebagian (yang lain) beberapa derajat,” dalam kekuatan, keselamatan, rizki, penciptaan, dan akhlak. “Untuk mengujimu tentang apa yang diberikanNya kepadamu.” Maka amalmu pun berbeda-beda. “Sesungguhnya Tuhanmu amat cepat siksaanNya” kepada orang yang durhaka kepadaNya dan mendustakan ayat-ayatNya. “Dan sesungguhnya Dia Maha Pengampun lagi Maha Penyayang,” bagi yang beriman kepadanya dan beramal shalih serta bertaubat dari perbuatan-perbuatan dosa besar. Ini adalah akhir tafsir Surat al-An’am. Segala puji dan sanjungan adalah milik Allah. Semoga shalawat dan salam yang banyak terlimpahkan kepada Muhammad, keluarga dan saahabat-sahabatNya sampai Hari Kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 165: Baik dengan harta, kedudukan, dsb. Siapa di antara kamu yang taat dan siapa di antara kamu yang bermaksiat. Kepada orang-orang yang bermaksiat dan mendustakan ayat-ayat-Nya. Kepada orang yang beriman dan beramal saleh, serta bertobat dari semua dosa yang membinasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 165",
    "description": "Pada akhir surah ini dijelaskan bahwa hidup adalah cobaan dari Allah. Dan dialah yang menjadikan kamu sebagai khalifah-khalifah di bumi, setiap generasi digantikan oleh generasi berikutnya sampai hari kiamat, untuk meramaikan bumi di atas dasar nilai-nilai ilahi. Dan dia mengangkat derajat sebagian kamu di atas yang lain'ada yang kaya, miskin, lemah, kuat, sehat, sakit, dan sebagainya'untuk menguji kesyukuranmu atas karunia yang diberikan-Nya kepadamu. Sesungguhnya tuhanmu sangat cepat memberi hukuman bagi mereka yang durhaka dan sungguh, dia maha pengampun bagi yang taat dan bertobat dari dosadosanya, maha penyayang kepada makhluk-Nya. Alif laam miim, shaad. Huruf-huruf abjad pada permulaan surah ini mengisyaratkan kemukjizatan Al-Qur'an. Beberapa surah dalam alqur'an, memang, dibuka dengan huruf abjad seperti , aalif laam miim, alif laam raa, alif, laam, miim, shaat, dan sebagainya. Makna huruf-huruf itu hanya Allah yang tahu. Ada yang berpendapat bahwa huruf-huruf itu adalah nama surah dan ada pula yang berpendapat bahwa gunanya untuk menarik perhatian, atau untuk menunjukkan mukjizat Al-Qur'an, karena Al-Qur'an disusun dari rangkaian huruf-huruf abjad yang digunakan dalam bahasa bangsa arab sendiri. Meskipun demikian, mereka tidak pernah mampu untuk membuat rangkaian huruf-huruf itu menjadi seperti Al-Qur'an."
  }
]