[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika Allah menimpakan kepada dirimu (wahai manusai) sesuatu yang menyebabkan mudarat bagimu, seperti kemiskinan dan penyakit, maka tidak ada yang sanggup menghilangkannya, melainkan Dia sendiri. Dan apabila Dia mendatangkan kebaikan kepadamu, seperti hidup kecukupan dan kesehatan fisik, maka tidak ada yang dapat menolak karuniaNYa dan menghalangi ketetapanNya, dan Dia Maha kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Apabila kamu -wahai anak Adam- mendapatkan cobaan dari Allah tidak ada yang dapat memalingkannya darimu selain Allah. Dan apabila kamu mendapatkan kebaikan dari-Nya tidak ada yang dapat menghalanginya dan tidak ada yang dapat menolak karunia-Nya. Karena Dia adalah Tuhan Yang Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang dapat melemahkan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai manusia, jika Allah menimpakan kepadamu keburukan berupa kemiskinan atau penyakit, maka tidak ada seorangpun yang dapat menghilangkannya kecuali Dia; dan jika Allah menimpakan kepadamu kebaikan berupa keluasan rezeki atau kesehatan maka tidak ada seorangpun yang dapat menghalangi karunia-Nya. Dia Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَإِن يَمْسَسْكَ اللهُ بِضُرٍّ (Dan jika Allah menimpakan sesuatu kemudharatan kepadamu) Yakni jika Allah menurunkan kepadamu mudharat seperti kemiskinan atau penyakit. فَلَا كَاشِفَ لَهُۥٓ إِلَّا هُوَ ۖ (maka tidak ada yang menghilangkannya melainkan Dia sendiri) Yakni tidak ada seorangpun yang mampu mengangkat mudharat yang menimpamu itu kecuali Allah. وَإِن يَمْسَسْكَ بِخَيْرٍ (Dan jika Dia mendatangkan kebaikan kepadamu) Berupa kelapangan rezeki atau kesehatan. فهو على كل شيء قدير (maka Dia berkuasa atas segala sesuatu) Dan diantaranya mampu untuk menimpakan kepadamu keburukan atau kebaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "'Amir bin 'abdu qays berkata : Di dalam al-qur'an terdapat ayat-ayat agung jika aku membacanya, aku tidak peduli dengan segala kemudharatan yang tengah menimpa diriku: { وَإِنْ يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلَا كَاشِفَ لَهُ إِلَّا هُوَ } \"Dan jika Allah menimpakan sesuatu kemudharatan kepadamu, maka tidak ada yang menghilangkannya melainkan Dia sendiri.\" , { مَا يَفْتَحِ اللَّهُ لِلنَّاسِ مِنْ رَحْمَةٍ فَلَا مُمْسِكَ لَهَا ۖ وَمَا يُمْسِكْ فَلَا مُرْسِلَ لَهُ مِنْ بَعْدِهِ } \"Apa saja yang Allah anugerahkan kepada manusia berupa rahmat, maka tidak ada seorangpun yang dapat menahannya; dan apa saja yang ditahan oleh Allah maka tidak seorangpun yang sanggup melepaskannya sesudah itu\" [ Fathir : 2 ], { سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا } \"Allah kelak akan memberikan kelapangan sesudah kesempitan\" [ Ath-Thalaq : 7 ], { وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا } \"Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya\" [ Hud : 6 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Dan jika kalian dihadapkan kepada mudharat berupa kefakiran atau penyakit, wahai manusia, maka tidak ada yang mampu mengangkat kemudharatan yang menimpa seseorang selain Allah, Dan jika kamu menerima kebaikan berupa keuntungan dan kesehatan, maka Allah itu berkuasa atas setiap sesuatu berupa memberikan kebaikan, keburukan dan hal lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Allah menimpakan kepadamu} menimpakan {kemudharatan} musibah {maka tidak ada yang dapat menghilangkannya} maka tidak ada yang bisa mengangkatnya {selain Dia. Jika Dia memberikan kebaikan kepadamu, Dia Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Di antara dalil tauhidNya adalah bahwa hanya Allah sendiri sajalah yang mengankat kesulitan dan mendatangkan kebaikan dan kebahagiaan. Oleh karena itu, Dia berfirman, “jika Allah menimpakan sesuatu kemudharatan kepadamu,” berupa kemiskinan atau sakit atau kesulitan atau kecemasan atau keseddihan atau lainya, “ maka tidak ada yang menghilangkannya melainkan Dia Sendiri. Dan jika dia mendatangkan kebaikan kepadamu, maka dia Maha Kuasa atas setiap sesuatu.” Jika Dialah satu-satunya yang memberikan manfaat dan menimpakan mudharat, maka dialah semata yang berhak untuk disembah dan dipertuhankan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 17: Ayat ini termasuk dalil tauhid-Nya, di mana hanya Dia sendiri yang mampu menghilangkan bencana dan mendatangkan kebaikan. Oleh karena Dia yang satu-satunya memberikan manfaat (An Naafi') dan menimpakan bahaya (Adh Dhaarr), maka Dia saja yang berhak untuk disembah dan diibadati. Seperti sakit dan kemiskinan. Seperti sehat dan kekayaan, maka tidak ada yang dapat menghalangi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 17",
    "description": "Dan jika Allah menimpakan kepadamu, wahai manusia, suatu bencana yang terasa pahit dalam kehidupan kamu seperti gempa bumi, gunung meletus, penyakit, dan berbagai krisis, maka tidak ada yang dapat menghilangkannya selain dia, karena Allah maha berkuasa atas segala sesuatu. Dan jika dia mendatangkan kebaikan kepadamu, seperti sehat, kaya, dan sukses dalam hidup, maka dia mahakuasa atas segala sesuatu untuk mewujudkan, mengurangi, bahkan menghilangkan kebaikan tersebutAllah menjelaskan dan menegaskan bahwa dialah yang berkuasa atas hamba-hamba-Nya, baik yang beriman maupun yang kufur, semuanya tunduk kepada Allah di akhirat. Dan dia mahabijaksana dalam penciptaan dan perbuatan-Nya, serta maha mengetahui segala sesuatu yang tampak maupun yang tersembunyi dari pandangan manusia."
  }
]