[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia lah Allah yang Maha berkuasa, yang berada di atas sekalian hamba-hambaNya. semua makhluk tunduk kepadaNya dan hinalah para pembangkang di hadapanNya. Dia yang maha bijaksana yang meletakkan semua perkara pada tempaat semestinya sesuai dengan hikmahNya, juga Maha teliti yang tidak ada sesuatu pun yang samar bagiNya. Dzat yang memiliki sifat-sifat demikian, maka wajib untuk tidak disekutukan dengan apapun. Dalam ayat ini terkandung petunjuk sifat fauqiyyah Allah (maksudnya, Allah berada diatas) seluruh makhlukNya secara mutlak yang sesuai dengan keagunagan Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dia lah Tuhan Yang Maha Menang terhadap hamba-hamba-Nya serta Żāt yang menundukkan mereka. Mahatinggi dari mereka dalam segala hal dan tidak bisa dilemahkan oleh apa pun, serta tidak terkalahkan oleh siapa pun. Semuanya tunduk kepadaNya. Dia berada di atas hamba-hamba-Nya dalam bentuk yang sesuai dengan keagungan-Nya -Subḥānahu-. Dia lah Yang Maha Bijaksana dalam menciptakan sesuatu, mengatur makhluk-Nya dan menetapkan syariat-Nya, lagi Maha Mengetahui, sehingga tidak ada sesuatu pun yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Allah Maha Kuasa atas seluruh hamba-Nya. Allah mengatur alam semesta dengan hikmah dan ilmu-Nya. Dia Maha Mengetahui segala perbuatan hamba-Nya. Tidak ada yang tersembunyi dari-Nya. Dan Dia menetapkan segala sesuatu dengan penuh hikmah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِۦ ۚ (Dan Dialah yang berkuasa atas sekalian hamba-hamba-Nya) Yakni mengusai mereka dengan mampu memaksa mereka. Dan dalam kata memaksa terdapat makna lebih yang tidak terkandung dalam kata berkuasa, yaitu kemampuan untuk menolak seseorang mencapai keinginannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah mengatakan : { فَوْقَ عِبَادِهِ } \"diatas segala hamba-hamba Nya\" adalah karena Dia mensifati diri-Nya dengan penguasa dan penakluk bagi mereka, dan diantara sifat penguasa adalah senantiasa diatas dan meninggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Allahlah Dzat yang Maha Menaklukkan, lagi Maha Luhur di atas hamba-hambaNya dengan keluhuran, kuasa dan kemenangan. Dialah Dzat yang Maha Bijaksana dalam tindakanNya dan Maha Pemberi kabar tentang sesuatu yang baik bagi hamba-hambaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Maha Kuasa} Maha Menaklukkan {atas hamba-hambaNya, dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “ Dan Dialah yang berkuasa atas sekalian hamba-hambaNya.” Tidak adal salah seorang pun dari mereka yang bertindak, bergerak, dan diam melainkan dengan kehendakNya. Para raja dan lain-lainya tidak akan keluar dari kerajaan dan kekuasaaNya, justru mereka di atur dan di kuasai. Jika dia adalah penguasa sementara yang lain di kuasai, maka dialah yang berhak diibadahi. “ Dan Dialah yang Maha Bijaksana” dalam sesuatu yang dia perintahkan dan Dia larang, dan memberi pahala dan menghukum, dalam mencipta dan menakdirkan. “ Lagi Maha Mengetahui.” Yang mengetahui apa yang disimpan dan di rahasiakan seperti perkara-perkara yang samar. Ini semua adalah termasuk dalam tauhid."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 18: Oleh karena itu, tidaklah manusia bertindak, bergerak atau diam kecuali dengan kehendak-Nya. Semua makhluk tidak keluar dari kerajaan-Nya dan kekuasaan-Nya. Dalam perintah dan larangan-Nya, memberi balasan dan menyiksa, dan dalam hal mencipta dan menetapkan taqdirnya. Semua rahasia, perkara yang samar dan yang disembunyikan. Ini semua termasuk dalil tauhid-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 18",
    "description": "Allah menjelaskan dan menegaskan bahwa dialah yang berkuasa atas hamba-hamba-Nya, baik yang beriman maupun yang kufur, semuanya tunduk kepada Allah di akhirat. Dan dia mahabijaksana dalam penciptaan dan perbuatan-Nya, serta maha mengetahui segala sesuatu yang tampak maupun yang tersembunyi dari pandangan manusiakatakanlah, wahai rasulullah, kepada orang-orang musyrik ini, siapakah yang lebih kuat kesaksiannya dalam mengukuhkan kebenaranku sebagai utusan Allah' katakanlah, Allah. Dia menjadi saksi antara aku tentang apa yang aku sampaikan kepada kamu bahwa tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya, dan apa yang kamu ucapkan kepadaku berupa penolakan, kesombongan, dan olokolokan. Al-qur'an ini diwahyukan kepadaku sebagai bukti bahwa aku adalah utusan Allah agar dengan Al-Qur'an ini aku memberi peringatan kepadamu tentang hidup sesudah mati, pertanggungjawaban manusia di hadapan Allah, dan aku memperingatkan pula dengan Al-Qur'an ini kepada orang yang sampai Al-Qur'an kepadanya, meskipun tidak berjumpa dan tidak sezaman denganku. Dapatkah kamu benar-benar bersaksi dengan menunjukkan bukti-bukti yang meyakinkan bahwa ada tuhan-tuhan lain bersama Allah' katakanlah, wahai rasulullah kepada orang-orang musyrik itu, aku tidak dapat bersaksi untuk membuktikan ada tuhan-tuhan lain selain Allah. Katakanlah, kepada orang-orang yang menolak itu, sesungguhnya hanya dialah tuhan yang maha esa, tidak ada sekutu bagi-Nya, tidak ada tuhan yang memberi manfaat dan mudarat kepada manusia selain Allah, dan aku berlepas diri secara total dari apa yang kamu persekutukan, dewa-dewa dan berhala yang kalian anggap sejajar dengan Allah."
  }
]