[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah wahai rasul, kepada kaum musyrikin itu, ”siapakah yang paling kuat persaksiannya dalam menetapkan kebenaranku tentang apa yang aku sampaikan kepada kalian bahwa aku adalah seorang utusan Allah?” katakanlah, ”Allah menjadi saksi antara aku dengan kalian.” maksudnya, Dia Maha mengetahui risalah yang aku bawa kepada kalian dan apa yang kalian ucapkan kepadaku. ”Allah telah mewahyukan kepadaku al-qur’an ini agar dengan itu aku memperingatkan kalian terhadap siksaNya yang akan menimpa kalian. Dan aku memperingatkan dengannya manusia yang al-qur’an telah sampai kepadanya dari umat-umat. Sesungguhnya kalian benar-benar mengakui ada sesembahan-sesmbahan yang menyertai Allah yang kalian sekutukan denganNya. ” katakanlah kepada mereka wahai rasul, ”aku tidak bersaksi atas apa yang kalian yakini. Sesungguhnya Allah adalah sesembahan yang Maha Esa, tiada sekutu bagiNya. Dan sesungguhnya aku berlepas diri setiap sekutu yang kalian sembah bersamaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Katakanlah -wahai Rasul- kepada orang-orang musyrik yang mendustakan kamu, “Siapakah yang paling agung dan kesaksiannya paling penting di atas kejujuranku?” Katakanlah, “Allah-lah yang paling agung dan kesaksian yang paling penting di atas kejujuranku. Dia adalah saksi antara diriku dan kalian. Dia mengetahui apa yang kubawa kepada kalian dan jawaban yang akan kalian berikan. Allah telah mewahyukan Al-Qur`ān ini kepadaku untuk memberikan peringatan kepada kalian dan kepada siapa pun yang mendengarnya, baik dari bangsa manusia maupun bangsa jin. Sesungguhnya kalian wahai orang-orang musyrik percaya bahwa di samping Allah ada sembahan-sembahan yang lain. Katakanlah -wahai Rasul-, “Aku tidak mau bersaksi atas apa yang kalian percayai itu karena kepercayaan tersebut batil. Sesungguhnya Allah adalah satu-satunya Rabb yang berhak disembah, tidak ada sekutu bagi-Nya. Dan sesungguhnya aku berlepas diri dari apa yang kamu jadikan sekutu dengan-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Hai Muhammad, Katakanlah kepada orang-orang yang menyekutukan Allah: Adakah kesaksian yang lebih agung melebihi apa yang Aku sampaikan kepada kalian bahwa Aku adalah utusan Allah? Jawaban pertanyaan ini Allah Jelaskan dengan firman-Nya, katakanlah hai Muhammad: Allah adalah saksi antara aku dengan kalian, Dia Maha Agung dan Maha Benar. Dia bersaksi bahwa aku adalah Rasul utusan-Nya dan bersaksi bahwa aku jujur dalam apa yang telah aku sampaikan kepada kalian. Dia mewahyukan kepadaku Al-qur'an yang aku bacakan kepada kalian sebagai peringatan kepada kalian dan kepada seluruh manusia yang telah sampai Al-qur'an kepadanya. Penyebutan sebab turunnya Al-qur'an sebagai peringatan tanpa menyebutkannya sebagai kabar gembira, karena ayat ini ditujukan bagi orang-orang yang berpaling dari kebenaran sehingga hanya peringatan yang sesuai bagi mereka. Kemudian Allah mengolok-olok mereka dengan firman-Nya, katakanlah hai Muhammad: sungguh kalian telah menyekutukan Allah. Aku tidak bersaksi bersama kalian dan tidak menyepakati kesyirikan yang kalian lakukan. Allah Maha Esa dengan kebesaran dan keagungan-Nya. Tidak ada Tuhan selain-Nya dan aku berlepas diri dari kesyirikan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. قُلْ أَىُّ شَىْءٍ أَكْبَرُ شَهٰدَةً ۖ (Katakanlah: “Siapakah yang lebih kuat persaksiannya?”) Yakni saksi mana yang lebih kuat persaksiannya. قُلِ اللهُ ۖ شَهِيدٌۢ بَيْنِى وَبَيْنَكُمْ ۚ (Katakanlah: “Allah”. Dia menjadi saksi antara aku dan kamu) Ini adalah jawaban dari pertanyaan sebelumnya. Apabila Allah-lah saksi antara Rasulullah dan mereka maka Dia adalah saksi yang paling kuat persaksiannya untuk Rasulullah. Pendapat lain mengatakan bahwa jawabannya telah ada dalam kalimat قُلِ اللهُ, yakni Allah adalah yang paling kuat persaksiannya. Kemudian Allah memulai lagi firman-Nya dengan kalimat شَهِيدٌۢ بَيْنِى وَبَيْنَكُمْ, yakni Dia adalah saksi antara aku dan kalian. وَأُوحِىَ إِلَىَّ هٰذَا الْقُرْءَانُ لِأُنذِرَكُم بِهِۦ وَمَنۢ بَلَغَ ۚ (Dan Al Quran ini diwahyukan kepadaku supaya dengan dia aku memberi peringatan kepadamu dan kepada orang-orang yang sampai Al-Quran (kepadanya)) Yakni supaya aku memperingatkan kalian dengan al-qur’an, dan memperingatkan semua orang yang telah sampai kepadanya al-qur’an dari seluruh suku dan jenis. dan hukum-hukum dalam al-qur’an mencakup manusia dan jin semuanya yang telah ada saat risalah ini diturunkan sampai hari kiamat apabila mereka telah mendapat dakwah islam dan mendengar al-qur’an. قُل لَّآ أَشْهَدُ ۚ( Katakanlah: “Aku tidak mengakui”) Yakni maka aku tidak mau bersaksi bersama kalian bahwa terdapat tuhan-tuhan yang lain selain Allah, karena persaksian ini merupakan persaksian yang paling bathil. وَإِنَّنِى بَرِىٓءٌ مِّمَّا تُشْرِكُونَ (dan sesungguhnya aku berlepas diri dari apa yang kamu persekutukan) Yakni dari patung-patung yang kalian jadikan sebagai sesembahan. Atau dari kesyirikan kalian kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Wahai rasul katakanlah kepada orang yang meminta kesaksian atas kenabian dan kebenaranmu: “Manakah saksi yang lebih agung dan lebih utama persaksiannya untuk membuktikan kebenaran?” katakanlah: “Allah adalah saksiku, Dialah seagung-agung saksi bagi rasulNya di hadapan ciptaanNya. Allah mewahyukan kepadaku Al-Qur’an ini, supaya aku bisa memberi peringatan tentang azab kepada orang yang bermaksiat dan tidak mau beriman, dan seluruh manusia yang mau menerimanya sampai hari kiamat. Wahai orang-orang musyrik, apakah sesungguhnya kalian akan bersaksi tanpa hujjah bahwa ada tuhan lain bersama Allah?” Katakanlah kepada mereka: “Aku tidak mengakui adanya tuhan lain bersama Allah, Kesaksian kalian itu adalah sebathil-bathil kesaksian. Sesungguhnya aku berlepas diri dari ucapan kalian dan berhala yang kalian jadikan sekutu Allah” Para pemimpin Mekah berkata: “Wahai Muhammad, Kami tidak mendapati satu orang pun yang mempercayai apa yang kamu ucapkan berupa perkara risalah, maka tunjukkanlah kepada kami, orang yang bersaksi untukmu bahwa dirimu adalah rasul sebagaimana yang kamu akui” lalu Allah SWT menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapakah yang lebih kuat} lebih besar {kesaksiannya” Katakanlah, “Allah. Dia menjadi saksi antara aku dan kalian. Al-Qur’an ini diwahyukan kepadaku supaya dengan itu aku mengingatkan kalian} dengan itu memperingatkan kalian {dan orang yang sampai} dan orang-orang yang telah sampai kepadanya dari golongan jin dan manusia {Apakah kalian benar-benar bersaksi bahwa ada tuhan-tuhan lain selain Allah” Katakanlah, “Aku tidak bersaksi.” Katakanlah, “Sesungguhnya Dialah Tuhan Yang Maha Esa dan aku lepas tangan dari apa yang kalian persekutukan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “ Katakanlah” kepada mereka tatkala kami menjelaskan ketunjuka kepada mereka dengan menerangkan kepada mereka jalan-jalan, “ siapakah yang lebih kuat persaksianya?” Di atas dasar gunung ini. “ Katakanlan, ‘ Allah’,” yang lebih kuat persaksianya karena dia “ menjadi saksi antara aku dan kamu.” Tiada yang labih kuat dan lebih besar persaksianya daripada Dia. Dia bersaksi untukku dengan persetujuan dan perbuatanNya. Dia menyetujui apa yang aku ucapkan kepadamu sebagaimana Allah berfirman, \"Seandainya dia (Muhammad) mengadakan sebagian perkataan atas (nama) Kami, niscaya benar-benar Kami pegang dia pada tangan kanannya. Kemudian benar-benar Kami potong urat tali jantungnya.\" ( Al-Haqqah : 44-46). Allah Mahabijaksana lagi Mahaberkuasa. Tidak layak –dengan kebijaksanaan dan kekuasaanNya- Dia membiarkan pendusta atas namaNya dengan klaim bahwa Allah mengutusnya padahal Dia tidak mengutusnya, bahwa Allah memerintahkannya berdakwah kepada manusia padahal Dia tidak memerintahkannya berdakwah, bahwa Allah menghalalkan untuknya harta, darah, dan wanita orang-orang yang menyelishinya. Dengan kebohongannya tersebut, maka tidak layak Allah membenarkannya dengan pengakuan dan perbuatanNYa. Lalu Dia mendukungnya dengan ayat-ayat yang jelas dan mukjizat-mukjizat yang mengagumkan, menolongnya dan melecehkan orang yang menyelisihi dan memusuhinya. Adakah persaksian yang lebih besar dari ini? FirmanNya “Dan al-Quran ini diwahyukan kepadaku supaya dengannya Aku memberi peringatan kepadamu dan kepada orang-orang yang mana al-Quran sampai (kepadanya).” Maksudnya, Allah mewahyukan al-Quran yang mulia ini kepadaku untuk kebaikan dan kemaslahatanmu, dan dengannya aku memberimu peringatan adanya hukuman yang pedih. Peringatan itu dengan menyebukan sesuatu yang mereka diperingatkan darinya yang meliputi targhib (anjuran) dan tarhib (ancaman) dan penjelasan tentang perkataan-perkataan dan perbuatan-perbuatan lahir dan batin, di mana barangsiapa yang melakukannya, maka dia telah menerima peringatan. Al-Quran ini mengandung peringatan bagimu wahai orang-orang yang al-Quran ini berbicara kepadanya kepadanya dan orang-orang yang mana al-Quran sampai kepadanya hingga Hari Kiamat; di dalamnya terdapat penjelasan tentang tuntutan-tuntutan ilahiyyah yang diperlukan. Manakala Allah menjelaskan kesaksianNya yang merupakan kesaksian terbesar atas tauhid, Dia berfirman, “Katakanlah kepada orang-orang yang menentang berita Allah dan yang mendustakan rasul-rasulNya,’Apakah kamu mengakui bahwa ada tuhan-tuhan yang lain di samping Allah?’ katakanlah , ‘Aku tidak mengakui’ .” Maksudnya, jika mereka bersaksi maka janganlah kamu bersaksi bersama mereka. Bandingkan antara kesaksian Allah yang paling benar FirmanNya, Tuhan semesta alam disertai kesaksian makhluk tersuci yang ditopang dengan bukti-bukti yang kuat dan argument-argumen yang valid atas keesaan Allah semata tanpa sekutu bagiNya dengan kesaksian orang-orang musyrik yang akal dan agamanya rusak, pendapat dan akalnya kacau dan mengundang tertawaan orang-orang yang berakal kepada mereka, bahkan kesaksian mereka menyelisihi fitrah mereka, dan ucapan-ucapan mereka saling bertentangan dalam menetapkan bahwa ada tuhan-tuhan lain bersama Allah, padahal tidak ada syubhat yang paling ringan yang menyelisihi pendapat mereka, apalagi jika ada argument kuat. Jika kamu berakal, maka pilihlah untuk dirimu satu dari dua kesaksian sementara kami sendiri memilih untuk kami syariat yang Allah pilih untuk NabiNya yang Allah perintahkan kepada kami agar meneladaninya. Allah berfirman, “Katakanlah, ‘Sesungguhnya Dia adalah Tuhan Yang Maha Esa’ .” tidak ada yang berhak disembah dan dipertuhankan selainNya sebagaimana Dia adalah Esa dalam penciptaan dan pengaturan. “Dan sesungguhnya aku berlepas diri dari apa yang kamu persekutukan (dengan Allah),” berupa berhala-berhala, sesembahan-sesembahan lain dan semua yang disekutukan dengan Allah. Inilah hakikat tauhid penetapan ketuhanan kepada Allah dan menafikannya dari selainNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 19: Dalam tafsir Al Jalaalain diterangkan, bahwa ayat ini turun ketika orang-orang kafir berkata kepada Nabi shallallahu 'alaihi wa sallam, \"Bawalah kepada kami saksi terhadap kenabianmu, karena Ahli Kitab mengingkarimu.\" Atas kebenaranku. Yakni jika mereka berani bersaksi, maka katakanlah aku tidak dapat bersaksi, Inilah hakikat tauhid, yakni menetapkan bahwa Allah yang satu-satunya berhak disembah dan meniadakan sesembahan selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 19",
    "description": "Katakanlah, wahai rasulullah, kepada orang-orang musyrik ini, siapakah yang lebih kuat kesaksiannya dalam mengukuhkan kebenaranku sebagai utusan Allah' katakanlah, Allah. Dia menjadi saksi antara aku tentang apa yang aku sampaikan kepada kamu bahwa tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya, dan apa yang kamu ucapkan kepadaku berupa penolakan, kesombongan, dan olokolokan. Al-qur'an ini diwahyukan kepadaku sebagai bukti bahwa aku adalah utusan Allah agar dengan Al-Qur'an ini aku memberi peringatan kepadamu tentang hidup sesudah mati, pertanggungjawaban manusia di hadapan Allah, dan aku memperingatkan pula dengan Al-Qur'an ini kepada orang yang sampai Al-Qur'an kepadanya, meskipun tidak berjumpa dan tidak sezaman denganku. Dapatkah kamu benar-benar bersaksi dengan menunjukkan bukti-bukti yang meyakinkan bahwa ada tuhan-tuhan lain bersama Allah' katakanlah, wahai rasulullah kepada orang-orang musyrik itu, aku tidak dapat bersaksi untuk membuktikan ada tuhan-tuhan lain selain Allah. Katakanlah, kepada orang-orang yang menolak itu, sesungguhnya hanya dialah tuhan yang maha esa, tidak ada sekutu bagi-Nya, tidak ada tuhan yang memberi manfaat dan mudarat kepada manusia selain Allah, dan aku berlepas diri secara total dari apa yang kamu persekutukan, dewa-dewa dan berhala yang kalian anggap sejajar dengan Allah. Orang-orang yang telah kami berikan kitab kepadanya, yaitu orangorang yahudi yang diberi kitab taurat sehingga mereka disebut ahlulkitab, bersama kaum nasrani yang juga ahlulkitab karena menerima kitab injil, mengenal nabi Muhammad, sifat, karakter, tugas pokok, dan fungsinya sebagai nabi dan rasul terakhir, karena sudah tertulis dalam kitab taurat dan injil. Pengenalan mereka tentang nabi Muhammad seperti mereka mengenal anak-anaknya sendiri, namun sebagian besar dari orang-orang yahudi dan nasrani tersebut termasuk orang-orang yang merugikan dirinya karena mereka itu tidak beriman kepada rasulullah, akibat kedengkian mereka kepadanya."
  }
]