[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia lah Allah yang menciptakan kakek moyang kalian, Adam , dari tanah, sedang kalian adalah keturunan darinya. Kemudian Dia menulis ketetapan masa tinggal kalian di dunia ini dan menulis ajal lain yang sudah ditentukan yang tidak ada yang tahu kecuali oleh Allah , yaitu hari kiamat. Kemudian setelah itu semua, kalian masih meragukan terhadap kekeuasaan Allah , untuk membangkitkan (semua makhluk) setelah kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dia lah -Subḥānahu- yang menciptakan kalian -wahai manusia- dari tanah liat ketika Dia menciptakan bapak kalian, Adam -‘Alaihissalām- dari tanah liat. Kemudian Dia memberi kalian waktu sejenak untuk mencicipi kehidupan dunia. Dan Dia juga memberi kalian batas waktu lain yang hanya diketahui oleh-Nya untuk membangkitkan kalian (dari kubur) di hari Kiamat. Kemudian kalian meragukan kemampuan-Nya -Subḥānahu- untuk membangkitkan kalian (dari kubur kalian)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hanya Allah-lah yang menciptakan kalian. Dia menciptakan Adam dari tanah, dan menciptakan manusia yang lain dari Adam, dan menetapkan bagi setiap manusia waktu tertentu untuk menjalani kehidupan di dunia dengan menentukan ajal yang pasti berupa kematian dan kebangkitan. Allah juga menetapkan ajal lain yang hanya Allah yang mengetahuinya, berupa permulaan hari kiamat dan kehidupan akhirat. Namun kemudian kalian meragukan janji dan ancaman Allah serta kuasa-Nya untuk membangkitkan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. هُوَ الَّذِى خَلَقَكُم مِّن طِينٍ (Dialah Yang menciptakan kamu dari tanah) Yang dimaksudkan adalah Nabi Adam. ثُمَّ قَضَىٰٓ أَجَلًا ۖ (sesudah itu ditentukannya ajal) Yakni kematiannya. وَأَجَلٌ مُّسَمًّى عِندَهُۥ ۖ( dan ada lagi suatu ajal yang ada pada sisi-Nya) Yakni hari kiamat. Pendapat lain mengatakan yang dimaksud dengan ajal yang pertama adalah masa berlangsungnya dunia, dan ajal yang kedua adalah umur manusia sampai waktu kematiannya. ثُمَّ أَنتُمْ تَمْتَرُونَ(kemudian kamu masih ragu-ragu) Yakni bagaimana kalian ragu terhadap hari kebangkitan, padahal kalian menyaksikan pada diri kalian sebuah permulaan dan batas akhir yang menunjukkan adanya kebangkitan tersebut. Karena barangsiapa yang menciptakan kalian dari tanah dan menjadikan kalian makhluk hidup yang memiliki ilmu dan akal, dan menciptakan bagi kalian panca indra dan anggota tubuh, kemudian Dia mengambilnya dari kalian dan menjadikan kalian mayat-mayat, dan kalian kembali menjadi benda mati seperti sedia kala, maka Dia pasti mampu untuk membangkitkan kalian dan mengembalikan tubuh-tubuh kalian seperti sedia kala, kemudian mengembalikan arwah-arwahnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Allah adalah Tuhan yang menciptakan asal kalian, yaitu Adam dari tanah, lalu mentakdirkan ajal bagi setiap makhluk, yaitu kematian. Dan ada ajal tertentu yaitu hari kiamat yang ada di sisiNya (hanya diketahui olehNya), Kemudian kalian meragukan tentang kebangkitan dan kuasa Allah atas hal itu, wahai orang-orang musyrik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang menciptakan kalian dari tanah, kemudian Dia menentukan batas waktu hidup} menakdirkan waktu hidup kalian di dunia {Waktu yang ditentukan di sisiNya} menakdirkan waktu yang hanya diketahui olehNya untuk membangkitkan kalian semua di sisiNya {Kemudian kalian masih meragukannya} kalian meragukan adanya kebangkitan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Dia-lah Yang menciptakan kamu dari tanah,” yang demikian itu dengan menciptakan bahan dasar dirimu (yang berasal dari tanah) dan bapakmu, Adam (yang juga dari tanah). “Sesudah itu ditentukannya ajal (kematianmu),” maksudnya, DIa menjatah hidupmu di dunia ini, dengannya kamu bersenang-senang, kamu diuji dengan syariat para rasul yang diutus kepadamu demi menguji siapa yang berbuat terbaik di antara kamu dan memberimu umur yang mana orang yang berusaha mengingatnya tidak akan ingat. “Dan ada lagi suatu ajal yang ditentukan (untuk berbangkit) yang ada pada sisiNya (yang Dia sendirilah yang mengetahuinya),” yaitu alam Akhirat di mana manusia pindah ke sana dari ala mini lalu Dia membalas mereka sesuai dengan perbuatan mereka, baik dan buruk. “Kemudian,” walaupun dengan penjelasan yang sempurna yang memangkas hujjah, “kamu masih ragu-ragu (tentang kebangkitan itu).” Maksudnya, kamu meragukan janji pahala Allah dan ancaman siksaNYa setelah terjadinya pembalasan pada Hari Kiamat. Allah menyebutkan kegelapan dengan bentuk jamak, karena bahannya banyak dan jalannya bermacam-macam, sementara cahaya disebutkan dengan kata tunggal, karena jalan yang mengantarkan kepada Allah adalah satu, tanpa ragam yaitu jalan yang mengandung ilmu tentang kebenaran dan pengalamannya, sebagaimana FirmanNya, an bahwa (yang Kami perintahkan ini) adalah jalan-Ku yang lurus, maka ikutilah dia, dan janganlah kamu mengikuti jalan-jalan (yang lain), karena jalan-jalan itu mencerai beraikan kamu dari jalan-Nya.\" (Al-An’Am:153)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 2: Yakni dengan menciptakan zat yang kamu diciptakan daripadanya, yaitu tanah. Demikian juga menciptakan bapak semua manusia, yaitu Adam 'alaihis salam darinya. Dia menetapkan lama waktu kamu hidup di dunia, yang di sana kamu bersenang-senang dan diuji siapakah yang paling baik amalnya serta memberi waktu agar kamu dapat memikirkan hidupmu. Untuk dibangkitkannya kamu dan diberikan balasan terhadap amal yang kamu kerjakan. Yakni meragukan kebangkitan tersebut setelah kamu mengetahui bahwa Dia yang pertama kali menciptakan kamu, padahal yang mampu menciptakan pertama kali dari yang sebelumnya tidak ada tentu lebih mampu menciptakan kembali dari yang sebelumnya sudah ada. Demikian juga kamu masih meragukan janji Allah dan ancaman-Nya serta terjadinya pembalasan pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 2",
    "description": "Dialah Allah, yang menciptakan kamu dan nenek moyangmu, nabi adam, langsung dari tanah, dan menciptakan kamu, anak keturunan adam dari saripati tanah; kemudian dia menetapkan ajal, saat kematianmu; sedangkan batas akhir hidupmu di dunia bersifat rahasia, hanya diketahui oleh-Nya semata-mata; namun demikian, kamu, manusia yang kafir masih saja meragukannya, yakni meragukan keberadaan Allah beserta kekuasaan, kebesaran, dan kasih sayang-Nya. Dan dialah Allah, tuhan yang menciptakan makhluk, baik yang berada di langit maupun di bumi; di antara sifat-sifat-Nya adalah bahwa dia mengetahui apa yang kamu rahasiakan, tidak ada satu titik pun yang tidak diketahui-Nya; dan dia pun mengetahui apa yang kamu nyatakan, dan dia pun mengetahui pula apa saja yang kamu kerjakan, baik maupun buruk, terbuka maupun tertutup."
  }
]