[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang telah kami berikan kepada mereka taurat dan injil, mereka mengenal Muhammad dengan sifat-sifatnya yang tertulis di sisi mereka, sebagaimana mereka mengenal anak-anak kandung mereka, maka sebagaimana tidak samar di hadapan mereka untuk dibedakan dengan anak-anak lain, begitu pula Muhammad tidak samar dengan orang lain karena detailnya sifat-sifat beliau dalam kitab-kitab mereka. Akan tetapi, mereka lebih mengikuti hawa nafsu (keinginan) mereka. Akibatnya, mereka merugikan diri sendiri ketika mengingkari Muhammad dan risalah yang dibawanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang Yahudi yang Kami beri kitab suci Taurat dan orang-orang Nasrani yang Kami beri kitab suci Injil mengenal dengan baik figur Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-, sebagaimana mereka mengenal anak-anak mereka sendiri di antara anak-anak orang lain. Mereka itulah orang-orang yang merugikan dirinya sendiri dengan memasukkan diri sendiri ke dalam Neraka, karena mereka tidak mau beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Orang-orang Yahudi dan Nasrani mengingkari sifat-sifat Nabi Muhammad yang ada dalam Taurat dan Injil yang menjadi bukti atas kenabiannya. Dan telah dijelaskan sebelumnya bahwa kesaksian Allah atas kebenaran kenabian Muhammad sudah cukup untuk menjadi bukti kebenarannya. Kemudian pada ayat ini Allah menjelaskan bahwa mereka berdusta ketika berkata: kami tidak mengenal Muhammad. Sebab sesungguhnya mereka mengenal kenabian dan kerasulannya sebagaimana mereka mengenal anak-anak mereka. Dan kalian mengetahui wahai para penduduk Makkah bahwa kenabian Muhammad bukanlah sesuatu yang baru ada di dunia, namun itu merupakan kabar gembira yang selalu disampaikan lewat lisan para rasul. Jika para penduduk Makkah jauh dari kerasulan, maka orang-orang Yahudi dan Nasrani yang mengenali Muhammad berada disekitar mereka, rasul-rasul mereka telah menyampaikan kepada mereka tentang Muhammad, bagaimana rupa dan sifat-sifatnya. Maka hendaklah para penduduk Makkah itu bertanya kepada mereka tentang Muhammad, karena mereka mengetahuinya tanpa keraguan sedikitpun sebagaimana mereka mengenali anak-anak mereka sendiri. Akan tetapi orang-orang merugi di antara mereka hanya mengikuti hawa nafsu dan mendustakannya sehingga mereka merugikan diri sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. الَّذِينَ ءَاتَيْنٰهُمُ الْكِتٰبَ (Orang-orang yang telah Kami berikan kitab kepadanya) Yakni kitab Taurat, Injil, dan yang lainnya. Mereka mengetahui Rasululllah. كَمَا يَعْرِفُونَ أَبْنَآءَهُمُ ۘ (seperti mereka mengenal anak-anaknya sendiri) Dan sesungguhnya tidak ada orang yang lebih mengenal seseorang melebihi bapak dan ibunya. الَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ فَهُمْ لَا يُؤْمِنُونَ (Orang-orang yang merugikan dirinya, mereka itu tidak beriman) Yakni sesungguhnya orang-orang yang merugikan dirinya dengan kebebalan dan kedurhakaan mereka, adalah orang-orang yang tidak beriman kepada apa yang dibawa oleh Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Sesungguhnya ahli Taurat dan Injil sangat mengerti Nabi SAW bahwa risalahnya itu benar melalui penggambaran tentangnya dalam kitab mereka, sebagaimana mereka mengerti tentang anak-anak mereka. Orang-orang yang merugikan diri sendiri dengan kekolotan dan penolakan mereka, serta tindakan menyuguhkan mereka diri sendiri kepada azab di akhirat. Mereka itu adalah orang-orang yang tidak beriman kepada apa yang dikirimkan oleh Allah kepada nabiNya, nabi Muhammad SAW."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang telah Kami beri kitab} Taurat dan Injil {mengenalnya} mengenal nabi Muhammad dengan sebanr-benarnya {seperti mereka mengenal anak mereka sendiri. Orang-orang yang merugikan diri sendiri itu tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Manakala Allah menjelaskan persaksianNya, persaksian RasulNya atas tauhid, dan persaksian kaum musyrikin yang tidak memiliki ilmu atas kesyirikannya, Dia menyebutkan bahwa Ahli kitab, Yahudi, dan Nasrani, “mereka mengenalnya,” yakni mengenal kebenaran tauhid, “seperti mereka mengenal anak-anaknya sendiri.” Maksudnya, tidak ada keraguan dalam diri mereka kepadanya sebagaimana mereka mengenal anak-anak mereka dengan baik khususnya anak-anak yang selalu dekat dengan orang tuanya. Ada kemungkinan bahwa kata ganti di sini kembali kepada Rasulullah, Muhammad. Ahli kitab mengetahui dengan jelas kebenaran kerasulannya, mereka tidak meragukannya, karena mereka mengetahui berita-berita gembira tentang kedatangannya dan sifat-sifatnya yang sesuai dengannya yang tidak cocok untuk selainnya. Kedua makna ini saling terkait satu dengan yang lain. FirmanNYa, “Orang-orang yang merugikan dirinya,” maksudnya, menyia-nyiakan apa yang diciptakan untuknya berupa iman dan tauhid, dan melepaskan kemuliaan dari Allah Yang Mahamulia lagi Mahakaya, “maka mereka itu tidak beriman (kepada Allah).” Jika mereka tidak memiliki iman, maka jangan bertanya tentang kerugian dan keburukan yang terjadi pada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 20: Setelah Allah menyebutkan persaksian-Nya dan persaksian rasul-Nya terhadap tauhid, dan persaksian orang-orang musyrik, di mana tidak ada yang mereka ketahui selain itu, maka Allah menyebutkan bahwa Ahli Kitab juga mengetahui kebenaran tauhid atau kebenaran Nabi Muhammad shallallahu 'alaihi wa sallam berdasarkan ilmu yang ada pada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 20",
    "description": "Orang-orang yang telah kami berikan kitab kepadanya, yaitu orangorang yahudi yang diberi kitab taurat sehingga mereka disebut ahlulkitab, bersama kaum nasrani yang juga ahlulkitab karena menerima kitab injil, mengenal nabi Muhammad, sifat, karakter, tugas pokok, dan fungsinya sebagai nabi dan rasul terakhir, karena sudah tertulis dalam kitab taurat dan injil. Pengenalan mereka tentang nabi Muhammad seperti mereka mengenal anak-anaknya sendiri, namun sebagian besar dari orang-orang yahudi dan nasrani tersebut termasuk orang-orang yang merugikan dirinya karena mereka itu tidak beriman kepada rasulullah, akibat kedengkian mereka kepadanya. Dan siapakah yang lebih zalim, sesat, dan menyimpang dari kebenaran, daripada orang yang mengada-adakan suatu kebohongan terhadap Allah, meyakini tuhan memiliki anak dan teman perempuan; atau yang mendustakan ayat-ayat-Nya seperti yang dilakukan kaum kafir mekah dan madinah' sesungguhnya orang-orang yang zalim itu mempertuhankan seseorang atau sesuatu selain Allah, mereka tidak akan pernah beruntung dalam kehidupan di akhirat, karena mereka kekal di dalam neraka."
  }
]