[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada seorangpun yang lebih parah perbuatan kezhalimannya dari orang-orang yang mengada-ngadakan kedustaan atas nama Allah . Dia berprasangka bahwa Allah memiliki sekutu-sekutu dalam ibadah, atau mengklaim bahwa Dia memiliki putra atau istri, maupun mendustakan bukti-bukti nyata dan dalil-dalil yang Allah jadikan pendukung untuk menguatkan para rasulNya . Sungguh tidak akan beruntung orang-orang yang berbuat kezhaliman yang mengada-ngadakan kedustaan atas nama Allah dan merekapun tidak akan menggapai keinginan-keinginan mereka di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Tidak ada orang yang lebih berat kezalimannya daripada orang yang menyatakan bahwa Allah mempunyai sekutu kemudian menyembah sekutu itu bersama-Nya. Atau orang yang mendustakan ayat-ayat yang Dia turunkan kepada rasul-Nya. Sesungguhnya orang-orang yang zalim karena menyatakan bahwa Allah mempunyai sekutu dan mendustakan ayat-ayat-Nya itu selamanya tidak akan beruntung, jika mereka tidak bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Tidak ada orang yang lebih zalim daripada orang yang berdusta terhadap Allah dan mendustakan ayat-ayat-Nya yang agung. Dan bagian dari keadilan dan ketetapan Allah terhadap hamba-hamba-Nya, Dia menjadikan orang yang zalim tidak akan mendapat kebahagiaan, namun hanya akan mendapat penyesalan dan kerugian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللهِ كَذِبًا (Dan siapakah yang lebih aniaya daripada orang yang membuat-buat suatu kedustaan terhadap Allah) Yakni tidak ada orang yang lebih zalim melebihi orang yang membuat kedustaan terhadap Allah, yang menjadikan didalam Taurat, Injil, dan al-qur’an apa yang sebenarnya tidak ada didalamnya. أَوْ كَذَّبَ بِـَٔايٰتِهِۦٓ ۗ (atau mendustakan ayat-ayat-Nya) Yakni berupa mu’jizat-mujizat yang jelas atau ayat-ayat al-qur’an. Dan mereka menyandingkan dalam diri mereka kedustaan terhadap Allah dan mendustakan apa yang diperintahkan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Tidak ada yang lebih zalim daripada orang yang merekayasa kebohongan terhadap Allah, sehingga dia beranggapan bahwa Allah memiliki anak atau sekutu, atau orang yang mendustakan ayat-ayat Al-Qur’an. Sesungguhnya orang-orang kafir yang menzalimi diri sendiri dengan berdusta dan kufur itu tidak akan beruntung"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang lebih zalim} tidak ada yang lebih zalim {daripada orang yang mengada-adakan} membuat-buat {suatu kebohongan terhadap Allah atau mendustakan ayat-ayatNya. Sesungguhnya orang-orang yang zalim itu tidak beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Maksudnya, tidak ada kezhaliman dan kesombongan yang lebih besar daripada orang yang dalam dirinya terdapat satu dari dua sifat. Bagaimana jika keduanya terkumpul, yaitu berdusta atas Nama Allah atau mendustakan ayat-ayatNya yang dibawa oleh para Rasul? Dia adalah orang terzhalim, dan orang yang zhalim tidak akan beruntung untuk selama-lamanya. Termasuk dalam hal ini adalah semua yang berdusta atas Nama Allah dengan mengklaim bahwa Dia mempunyai sekutu dan penolong atau dia mengklaim sesembahan lain bersamaNya atau mengangkat istri dan anak untukNya. Dan termasuk juga semua yang menolak kebenaran yang dibawa oleh Rasul atau orang-orang yang menggantikan kedudukan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 21: Siapa yang lebih zhalim daripada orang yang membuat-buat dusta atas (nama) Allah atau mendustakan ayat- ayatNya? Sesungguhnya tidaklah berbahagia orang-orang yang zhalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak ada yang lebih zalim. Dengan menisbatkan sekutu kepada-Nya, atau menyangka bahwa selain-Nya ada juga yang berhak disembah, atau menyangka bahwa Dia punya istri dan anak, Mahasuci Allah dari semua ini. Yaitu Al Qur'an, termasuk pula menolak kebenaran yang dibawa rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 21",
    "description": "Dan siapakah yang lebih zalim, sesat, dan menyimpang dari kebenaran, daripada orang yang mengada-adakan suatu kebohongan terhadap Allah, meyakini tuhan memiliki anak dan teman perempuan; atau yang mendustakan ayat-ayat-Nya seperti yang dilakukan kaum kafir mekah dan madinah' sesungguhnya orang-orang yang zalim itu mempertuhankan seseorang atau sesuatu selain Allah, mereka tidak akan pernah beruntung dalam kehidupan di akhirat, karena mereka kekal di dalam neraka. Dan ingatlah, pada hari ketika kami mengumpulkan mereka semua, seluruh manusia sejak zaman adam hingga akhir zaman di padang mahsyar, kemudian kami berfirman kepada orang-orang yang menyekutukan Allah, sebagai pertanggungjawaban, di manakah sembahan-sembahanmu yang dahulu kamu sangka sebagai sekutu-sekutu kami yang kamu perlakukan sebagai tuhan'"
  }
]