[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hendaknya orang-orang musyrik yang mendustakan ayat-ayat Allah mengkhawatirkan diri mereka pada hari kami mengumpulkan mereka semua kemudian kami berfirman kepada mereka, ”Mana tuhan-tuhan sesembahan kalian yang dahulu kalian mengaku-ngaku bahwasanya mereka merupakan sekutu-sekutu yang mendampingi Allah agar mereka memberikan syafaat bagi kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan ingatlah akan hari Kiamat ketika Kami mengumpulkan mereka semua. Kami tidak akan meninggalkan seorang pun dari mereka. Kemudian Kami berfirman kepada orang-orang yang menyembah tuhan lain di samping menyembah Allah untuk mengecam tindakan mereka, “Di mana tuhan-tuhan yang dahulu kamu anggap sebagai sekutu-sekutu Allah?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah akan mengolok-olok orang-orang musyrik ketika Dia membangkitkan mereka pada hari kiamat dengan bertanya: dimanakah sekutu-sekutu yang kalian jadikan sesembahan selain Aku? Mengapa mereka tidak datang untuk menolong kalian dan menjauhkan kalian dari azab?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَيَوْمَ نَحْشُرُهُمْ جَمِيعًا (Dan (ingatlah), hari yang di waktu itu Kami menghimpun mereka semuanya) Yakni ceritakanlah pada mereka kabar tentang hari kiamat, hari dimana Allah mengumpulkan disisi-Nya antara orang yang menyembah dan yang disembah selain Allah. أَيْنَ شُرَكَآؤُكُمُ (Di manakah sembahan-sembahan kamu) sembahan-sembahan itu sebenarnya bukanlah sekutu Allah, namun mereka menamainya dengan hal itu maka disebut sebagai sekutu sebagaimana yang orang-orang musyrik katakan. Dan ia adalah sembahan-sembahan yang mereka sembah selain Allah atau mereka sembah bersama Allah. الَّذِينَ كُنتُمْ تَزْعُمُونَ (yang dulu kamu katakan (sekutu-sekutu) Kami?) Yakni yang mereka anggap sebagai sekutu. Allah mengolok mereka dengan memanggil sekutu-sekutu tersebut untuk mereka dengan mengatakan: “dimana mereka? Agar mereka dapat menolong kalian”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Ingatkanlah mereka tentang kabar hari kiamat, yaitu hari dimana Allah mengumpulkan para penyembah dan yang disembah, lalu Kami bertanya kepada orang-orang musyrik: “Manakan sekutu-sekutu kalian, yaitu para berhala yang kalian sembah selain Allah, dan sekutu-sekutu yang kalian anggap sebagai sekutu dan penyelamat kalian di sisi Allah?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari} pada hari kiamat {Kami mengumpulkan mereka semua kemudian Kami berfirman kepada orang-orang yang mempersekutukan Kami, “Manakah sekutu-sekutu kalian yang kalian sangkakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Allah memberitakan tentang tempat kembali orang-orang musyrik pada Hari Kiamat, mereka ditanya dan dicemooh, “Mana sekutu-sekutuKu yang kalian klaim?” maksudnya, Allah tidak memiliki sekutu. Hal tersebut hanya sekedar klaim dan kedustaan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 22: Dan (ingatlah) hari yang Kami akan kumpulkan mereka semua, kemudian, Kami berkata kepada orang-orang yang musyrik: \"Dimanakah orang-orang, yang kamu sekutukan yang kamu anggap?\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai bentuk taubikh (celaan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 22",
    "description": "Dan ingatlah, pada hari ketika kami mengumpulkan mereka semua, seluruh manusia sejak zaman adam hingga akhir zaman di padang mahsyar, kemudian kami berfirman kepada orang-orang yang menyekutukan Allah, sebagai pertanggungjawaban, di manakah sembahan-sembahanmu yang dahulu kamu sangka sebagai sekutu-sekutu kami yang kamu perlakukan sebagai tuhan' sikap orang-orang kafir dan musyrik di akhirat itu berbeda dengan sikap mereka di dunia. Ketika di akhirat kemudian tidaklah ada jawaban bohong mereka, karena mengikuti suara hati dan akal sehat, kecuali mengatakan, demi Allah, mereka bersumpah dengan nama Allah, ya tuhan kami, kini di akhirat, tidaklah kami mempersekutukan engkau dengan suatu apa pun."
  }
]