[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian tidak ada jawaban dari mereka ketika mereka menghadapi cobaan dan di uji dengan pertanyaan tentang sekutu-sekutu mereka, kecuali mereka berlepas diri dari mereka, dan bersumpah dengan nama Allah, tuhan mereka bahwa mereka dahulu tidak pernah menyekutukan Allah dengan selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Kemudian alasan yang mereka kemukakan setelah melalui ujian ini tidak lain hanyalah mereka berlepas diri dari sembahan-sembahan mereka. Dan mereka berdusta dengan mengatakan, “Demi Allah, Rabb kami, sesungguhnya kami tidak pernah menyekutukan-Mu, melainkan beriman kepada-Mu dan mengesakan-Mu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Ketika Allah bertanya kepada mereka tersebut, mereka tidak dapat menjawab kecuali hanya dengan mengingkari dan menyatakan bahwa mereka berlepas diri dari kesyirikan dan sesembahan-sesembahan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. ثُمَّ لَمْ تَكُن فِتْنَتُهُمْ (Kemudian tiadalah fitnah mereka) Yakni tidak lain akibat dari kekafiran yang mereka bangga-banggakan dan mereka berperang untuknya itu kecuali mengatakan: “Demi Allah, tiadalah kami mempersekutukan Allah. إِلَّآ أَن قَالُوا۟ وَاللهِ رَبِّنَا مَا كُنَّا مُشْرِكِينَ (kecuali mengatakan: “Demi Allah, Tuhan kami, tiadalah kami mempersekutukan Allah”) Yakni jawaban mereka tidak lain hanyalah keingkaran dan berlepas diri dari perbuatan syirik tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Tidaklah hasil dari kekufuran dan keberanian mereka untuk berdusta, dan jawaban mereka ketika melihat azab itu kecuali berlepas diri dari perbuatan syirik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian tidak ada alasan mereka} alasan mereka {kecuali mengatakan,“Demi Allah, Ya Tuhan kami, kami bukanlah orang-orang musyrik.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Kemudian tiadalah fitnah mereka.” Maksudnya, jawaban mereka manakala mereka ditanya dan diuji dengan pertanyaan itu tidak lain hanyalah pengingkaran terhadap kesyirikan mereka, dan mereka berani bersumpah bahwa mereka tidak menyekutukan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 23: Kemudian, tidaklah ada fitnah mereka, melainkan mereka berkata: \"Demi Allah wahai Tuhan kami! Bukanlah kami ini orang-orang yang musyrik\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 23",
    "description": "Sikap orang-orang kafir dan musyrik di akhirat itu berbeda dengan sikap mereka di dunia. Ketika di akhirat kemudian tidaklah ada jawaban bohong mereka, karena mengikuti suara hati dan akal sehat, kecuali mengatakan, demi Allah, mereka bersumpah dengan nama Allah, ya tuhan kami, kini di akhirat, tidaklah kami mempersekutukan engkau dengan suatu apa pun. Lihatlah dan renungkan secara mendalam, wahai rasulullah, bagaimana mereka, orang-orang musyrik dan orang-orang yang mempertuhankan manusia, berbohong terhadap diri mereka sendiri dengan mengingkari nurani dan akal budi yang menjadi sumber fitrah beragama. Dan sesembahan yang mereka ada-adakan dahulu, baik manusia, setan, dan jin, maupun benda-benda yang disakralkan, akan hilang dari mereka, tidak membela, menolong, dan menyelamatkan mereka dari azab Allah."
  }
]