[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perhatikanlah (wahai rasul), bagaimana orang-orang musyrik itu berdusta kepada diri mereka sendiri, padahal di akhirat kelak mereka akan berlepas diri dari perbuatan syirik (mereka). Dan pergi dan hilanglah dari mereka apa yang mereka sangka-sangka tentang syafaat (pertolongan) sesembahan-sesembahan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Lihatlah -wahai Muhammad- bagaimana mereka membohongi diri mereka sendiri dengan mengatakan bahwa mereka tidak berbuat syirik dan tuhan-tuhan yang mereka sembah di samping mereka menyembah Allah selama hidup di dunia telah melupakan dan menelantarkan mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Allah menjelaskan kepada Rasulullah kedustaan orang-orang musyrik dengan berfirman: Hai Muhammad, Lihatlah untuk mengambil pelajaran, bagaimana orang-orang musyrik itu berdusta terhadap diri mereka tentang kenyataan sesungguhnya kesyirikan yang mereka lakukan di dunia? Mereka di dunia berdusta terhadap diri mereka ketika berkata: sesungguhnya menyembah berhala-berhala ini dapat mendekatkan kita kepada Allah sedekat-dekatnya. Dan inilah mereka ketika di akhirat, menjadi orang-orang yang pertama kali berlepas diri dari berhala-berhala tersebut dan mengakui kebenaran yang sesungguhnya setelah kedustaan mereka telah sirna, sehingga mereka mengikrarkan ketuhanan Allah Semata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. انظُرْ كَيْفَ كَذَبُوا۟ عَلَىٰٓ أَنفُسِهِمْ ۚ (Lihatlah bagaimana mereka telah berdusta kepada diri mereka sendiri) Dengan mengingkari perbuatan syirik mereka di dunia. وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ (dan hilanglah daripada mereka sembahan-sembahan yang dahulu mereka ada-adakan) Yakni hilanglah kedustaan mereka, dan lenyaplah apa yang mereka dahulu perkirakan bahwa sekutu-sekutu mereka dapat mendekatkan kepada Allah. Serta apa yang mereka sembah dahulu meninggalkan mereka sehingga tidak bermanfaat sedikitpun bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Mereka ingin mendustakan Allah, tetapi mereka membenarkan diri mereka sendiri tentang apa yang mereka dustakan, maka hakikat kebohongan itu ada pada diri mereka sendiri dan pasti itu akan berdampak buruk baginya, dan kebohongan yang paling buruk adalah : seseorang membenarkan kebohongan dirinya sendiri dan membawa untuk dirinya keburukan, dan kebohongan mereka tidak akan mendatangkan keburukan bagi Allah karena Dia maha mengetahui apa yang mereka perbuat : { وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ } \"Dan Allah menjadi saksi bahwa sesungguhnya mereka itu adalah pendusta\" [ At-taubah : 107 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Lihat dan perhatikanlah kebohongan mereka yang terang dengan mengingkari kesyirikan mereka sendiri, dan bagaimana rekayasa mereka lenyap, serta anggapan mereka bahwa para sekutu itu mendekatkan mereka kepada Allah itu hilang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perhatikanlah bagaimana mereka berdusta terhadap diri sendiri. Dan telah lenyap dari mereka} hilang dari mereka {apa yang selalu mereka ada-adakan} apa yang mereka buat-buat berupa sekutu-sekutu Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. “Lihatlah,” dengan keheranan kepada mereka dan kepada keadaan mereka, “bagaimana mereka berdusta terhadap diri mereka sendiri.” Mereka melakukan kedustaan yang kerugiannya menimpa diri mereka sendiri dan memudaratkan mereka dengan berat. “Dan hilanglah dari mereka sesembahan-sesembahan yang dahulu mereka ada-adakan.” Yakni sekutu-sekutu yang mereka klaim bersama Allah. Mahasuci Allah dari apa yang mereka katakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 24: Lihatlah, bagaimana diri mereka, dan (bagaimana) apa yang hilang dari mereka atas apa yang telah mereka ada-adakan!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil merasa aneh terhadapnya. Dengan mengatakan bahwa dirinya tidak berbuat syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 24",
    "description": "Lihatlah dan renungkan secara mendalam, wahai rasulullah, bagaimana mereka, orang-orang musyrik dan orang-orang yang mempertuhankan manusia, berbohong terhadap diri mereka sendiri dengan mengingkari nurani dan akal budi yang menjadi sumber fitrah beragama. Dan sesembahan yang mereka ada-adakan dahulu, baik manusia, setan, dan jin, maupun benda-benda yang disakralkan, akan hilang dari mereka, tidak membela, menolong, dan menyelamatkan mereka dari azab Allah. Ayat ini menjelaskan sikap orang-orang kafir terhadap Al-Qur'an. Dan di antara mereka, orang kafir dan orang yang menyekutukan Allah, ada yang mendengarkan bacaan Al-Qur'an-Mu, wahai nabi Muhammad, tetapi bacaan itu seperti air di atas daun talas. Mereka sombong, menolak, dan menutup diri rapat-rapat. Oleh sebab itu, kami telah menjadikan hati mereka tertutup karena sikap mereka sendiri sehingga mereka tidak memahaminya, dan seakan-akan telinganya tersumbat benda padat. Dan kalaupun mereka, orang-orang kafir dan musyrik, sewaktu-waktu melihat segala tanda kebenaran yang membuktikan rasulullah itu benar, mereka tetap tidak mau beriman kepadanya karena kesombongan mereka. Sehingga apabila mereka, karena kebencian mereka kepada rasulullah demikian dahsyat, datang kepadamu untuk membantahmu tentang alqur'an dan ajaran islam, orang-orang kafir itu berkata, Al-Qur'an ini bukan wahyu seperti pengakuan Muhammad, tidak lain Al-Qur'an ini hanyalah dongengan orang-orang terdahulu yang diwariskan dari mulut ke mulut secara berangkai."
  }
]