[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara kaum musyrikin ada orang yang menyimak bacaan al-qur’an darimu (wahai rasul), namun tidak sampai ke hati mereka. Sebab, akibat mereka mengikuti hawa nafsu mereka , kami menjadikan pada hati mereka penutup, agar mereka tidak sanggup memahami al-qur’an. Dan kami jadikan (pula) pada pendengaran-pendengaran mereka sumbatan dan ketulian, sehingga tidak bisa mendengar dan mencerna apapun, walupun mereka telah melihat banyak bukti yang menunjukan kebenaran Muhammad , akan tetapi mereka tidak mempercayainya. Bahkan bila mereka datang kepadamu (wahai rasul), usai menyaksiakan secara langsung bukti-bukti yang menunjukan kebenaranmu, mereka membantahmu. Orang-orang yang mengingkari ayat-ayat Allah itu berkata, ”apa yang kami dengar ini tiada lain merupakan sesuatu yang disebarkan orang-orang kuno berupa hikayat-hikayat (dongeng) yang tidak memiliki hakikat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Di antara orang-orang musyrik itu ada orang yang mendengarkanmu -wahai Rasul- ketika kamu membaca Al-Qur`ān. Tetapi tidak mendapatkan manfaat apa pun dari apa yang mereka dengarkan. Karena Kami telah menyelimuti hati mereka dengan penutup sehingga mereka tidak bisa memahami Al-Qur`ān. Hal itu disebabkan oleh sikap mereka yang menolak keras dan berpaling darinya. Dan Kami telah membuat telinga mereka tuli terhadap hal-hal yang bermanfaat, walaupun mereka melihat bukti-bukti yang nyata dan hujah-hujah yang jelas mereka tidak akan beriman kepadanya. Bahkan ketika mereka datang kepadamu untuk berdebat melawan kebenaran dengan kebatilan, mereka berkata, “Kitab yang kamu datangkan itu hanyalah kutipan dari kitab-kitab terdahulu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Hai Muhammad, sebagian dari orang-orang musyrik itu mendengarkan al-qur'an bukan untuk mendapat manfaat dan petunjuk, namun demi membuat tuduhan terhadap ayat-ayat Allah untuk menghina dan melecehkannya. Mereka mendengarkan namun tidak mendapat manfaat dan tidak taat kepada kebenaran. Mereka sama saja dengan orang yang tidak dapat mendengar dan tidak dapat memahami. Karena Allah mengetahui keadaan mereka tersebut, Dia membuat penutup di hati mereka agar tidak dapat memahami Al-qur'an, dan membuat telinga mereka tuli agar tidak dapat mengambil manfaat dari Al-qur'an meskipun mereka telah melihat ayat-ayat dan tanda-tanda kekuasaan Allah yang jelas. Jika mereka mendatangimu dengan hati dan telinga yang tertutup, mereka akan mendebat dan menantangmu serta mencari-cari cara untuk membantah dan mendustakan ayat-ayat Allah, kemudian mereka akan berkata: \"Apa yang Muhammad katakan itu hanyalah dongeng-dongeng dan kedustaan-kedustaan dari orang-orang terdahulu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْكَ ۖ (Dan di antara mereka ada orang yang mendengarkan (bacaan)mu) Kalimat ini merupakan pendahuluan dari penjelasan atas apa yang dilakukan sebagian orang musyrik di dunia, mereka mendengarkan kamu membacakan al-qur’an. وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً (padahal Kami telah meletakkan tutupan di atas hati mereka) Yakni Kami telah menutup hati mereka dengan kebencian terhadap al-qur’an sehingga menghalangi mereka untuk memahaminya. Apapun makna (الوقر) yakni ketulian. Sehingga hati mereka tidak dapat memahami dan telinga mereka tidak dapat mendengar. حَتَّىٰٓ إِذَا جَآءُوكَ يُجٰدِلُونَكَ (Sehingga apabila mereka datang kepadamu untuk membantahmu) Yakni kekufuran dan kedurhakaan mereka telah sampai pada titik dimana apabila mereka mendatangimu untuk mendebatmu, mereka tidak cukup dengan tidak beriman, akan tetapi mereka juga mengatakan Al-Quran ini tidak lain hanyalah dongengan orang-orang dahulu. إِنْ هٰذَآ إِلَّآ أَسٰطِيرُ الْأَوَّلِينَ (“Al-Quran ini tidak lain hanyalah dongengan orang-orang dahulu”) Yakni al-qur’an ini tidak lain hanyalah bagian dari apa yang ditulis orang-orang terdahulu dalam kitab-kitab yang berisi dongeng-dongeng, percakapan dan perbincangan, serta hal-hal bathil. Mereka menganggap bahwa Nabi Muhammad mendapatkan al-qur’an ini dari dongeng-dongeng dan kisah-kisah tersebut, padahal ia adalah kitab yang diturunkan oleh Allah yang Maha Perkasa lagi Maha Terpuji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Dan di antara orang-orang musyrik itu ada yang menyimak bacaan Al-Qur’anmu, bukan untuk mendapatkan petunjuk, melainkan untuk berdebat. Dan Kami buatkan dalam hati mereka itu penutup yang menghalangi mereka untuk mengerti (memahami) Al-Qur’an. Dan Kami membuat telinga mereka tuli sehingga tidak mngerti Al-Qur’an akibat kekolotan mereka sendiri. Dan jia mereka melihat setiap ayat yang menunjukkan kepada keesaan Allah mereka tidak akan mengimaninya, sehingga jika mereka datang kepadamu untuk berdebat, orang-orang kafir itu akan berkata: “Al-Qur’an ini tidak lain hanyalah takhayul orang-orang terdahulu.” Ayat ini turun untuk Nadhar bin Al-Harits ketika ditanya tentang apa yang dikatakan nabi Muhammad, dan berkata: “Ketika berada di rumahnya aku tidak memahami ucapannya kecuali hanya melihatnya bergumam mengucapkan sesuatu, dan dia tidak mengucapkan sesuatu kecuali cerita-cerita orang terdahulu sebagaimana aku bercerita kepada kalian tentang cerita masa dulu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di antara mereka ada yang mendengarkanmu, dan Kami menjadikan di hati mereka penutup} penutup {supaya mereka tidak memahaminya} supaya mereka tidak memahaminya {dan pada telinga mereka penyumbat} ketulian {Jika mereka melihat setiap ayat, mereka tetap tidak beriman padanya, sehingga ketika mereka datang kepadamu untuk membantahmu} menentangmu {orang-orang kafir itu berkata, “Ini tidak lain hanyalah dongeng} hal sia-sia dan cerita {orang-orang terdahulu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Di antara orang-orang musyrik itu terdapat sekelompok orang yang pada sebagian waktu terdorong untuk mendengar apa yang kamu katakan, akan tetapi hal itu merupakan kegiatan mendengar tanpa bermaksud mengikuti kebenaran, oleh karena itu mereka tidak dapat mengambil manfaat darinya, karena mereka tidak menginginkan kebaikan. “Padahal Kami telah meletakkan tutupan di atas hati mereka,” maksudnya, meletakkan penghalang dan tabir sehingga mereka tidak memahami kalamullah. Dia melindungi kalamNya dari orang-orang yang seperti mereka. “Dan di telinga mereka,” Kami letakkan “sumbatan.” Yakni ketulian, maka mereka tidak mendengar apa yang bermanfaat bagi mereka. “Dan jika pun mereka melihat segala tanda (kebenaran), mereka tetap tidak mau beriman kepadanya.” Ini benar-benar kezhaliman dan sikap keras kepala, mereka tidak tunduk dan mempercayai bukti-bukti yang menunjukkan kepada kebenaran bahkan mereka membantah kebenaran dengan kebatilan untuk menghancurkannya. Oleh karena itu Allah berfirman, “Sehingga apabila mereka datang kepadamu untuk membantahmu, orang-oranng kafir itu berkata, ‘Al-Quran ini di ambil dari buku-buku orang terdahulu’ .” Maksudnya, al-Quran ini di ambil dari buku-buku orang terdahulu yang tertulis, bukan dari Allah dan bukan dari rasul-rasulNYa. Ini termasuk kekufuran mereka, jika tidak, mana mungkin kitab ini –yang menghimpun berita-berita orang terdahulu dan orang-orang yang datang kemudian serta hakikat-hakikat yang dibawa oleh para Nabi dan Rasul dan keadilan yang sempurna- dikatakan dongengan orang-orang terdahulu?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 25: Dan sebahagian daripada mereka ada yang mendengarkanmu, tetapi tutupan-tutupan atas hati mereka, supaya mereka tidak mengerti, dan (Kami adakan) sumbatan di kuping-kuping mereka, karena walaupun mereka melihat tidaklah mereka akan percaya kepadanya, sehingga apabila mereka datang kepadamu, mereka akan membantahmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Namun tidak ada niat untuk mencari yang benar dan mengikutinya. Oleh karena itu, mendengarnya mereka bacaan Rasulullah shallallahu 'alaihi wa sallam tidaklah memberikan manfaat kepada mereka, karena dalam hati mereka tidak ada keinginan kepada kebaikan. Sehingga mereka tidak mendengarkan dengan pendengaran yang bermanfaat bagi mereka (yang menjadikan mereka tunduk menerima). Bahkan mereka malah mendebatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 25",
    "description": "Ayat ini menjelaskan sikap orang-orang kafir terhadap Al-Qur'an. Dan di antara mereka, orang kafir dan orang yang menyekutukan Allah, ada yang mendengarkan bacaan Al-Qur'an-Mu, wahai nabi Muhammad, tetapi bacaan itu seperti air di atas daun talas. Mereka sombong, menolak, dan menutup diri rapat-rapat. Oleh sebab itu, kami telah menjadikan hati mereka tertutup karena sikap mereka sendiri sehingga mereka tidak memahaminya, dan seakan-akan telinganya tersumbat benda padat. Dan kalaupun mereka, orang-orang kafir dan musyrik, sewaktu-waktu melihat segala tanda kebenaran yang membuktikan rasulullah itu benar, mereka tetap tidak mau beriman kepadanya karena kesombongan mereka. Sehingga apabila mereka, karena kebencian mereka kepada rasulullah demikian dahsyat, datang kepadamu untuk membantahmu tentang alqur'an dan ajaran islam, orang-orang kafir itu berkata, Al-Qur'an ini bukan wahyu seperti pengakuan Muhammad, tidak lain Al-Qur'an ini hanyalah dongengan orang-orang terdahulu yang diwariskan dari mulut ke mulut secara berangkai. Dan mereka, orang-orang kafir dan orang-orang yang menyekutukan Allah itu, melarang, menghalangi, dan mengancam orang lain mendengarkan Al-Qur'an, dan mereka sendiri, dengan kesadaran dan tekad yang bulat, menjauhkan diri dari Al-Qur'an, rasulullah, dan ajaran islam. Dan sejatinya mereka, dengan menjauhkan diri dari ajaran islam, hanyalah membinasakan diri mereka sendiri dengan membiarkan dirinya dalam kesesatan, sedangkan mereka tidak menyadari sikap mereka yang membinasakan diri sendiri itu."
  }
]