[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik menghalang-halangi manusia untuk mengikuti Muhammad dan mendengar darinya (bacaan al-qur’an) dan mereka sendiri menjauhkan diri darinya. Dan mereka tidaklah membinasakan (Atas usaha menghalang-halangi (manusia) dari jalan Allah) kecuali diri mereka sendiri, sedang mereka tidak menyadari bahwa mereka melakukan usaha-usaha untuk kebinasaan diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Mereka melarang masyarakat percaya kepada rasul dan mereka sendiri pun menjauhinya. Mereka tidak membiarkan seorang pun mengambil manfaat darinya dan mereka sendiri juga tidak mengambil manfaat darinya. Dengan perbuatan mereka itu sesungguhnya mereka tidak mencelakakan siapa pun selain diri mereka sendiri. Tetapi mereka tidak menyadari bahwa apa yang mereka lakukan itu akan mencelakakan diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Orang-orang musyrik telah mengetahui dampak Al-qur'an bagi orang yang mendengarnya, sehingga mereka saling menasehati agar tidak mendengarnya dan memerintahkan orang lain untuk menjauhi dan tidak menerima Al-qur'an. Mereka telah menghalangi diri mereka dari petunjuk Al-qur'an dan menghalangi orang lain, agar mereka tetap mendapat kedudukan dan kekuasaan. Namun mereka telah menanggung dia dosa besar, yaitu dosa diri mereka sendiri dan dosa orang yang mereka sesatkan, sehingga pada hakikatnya mereka membinasakan diri mereka sendii. Agama Allah terjaga, kitab-Nya terlindungi dari pengubahan, dan Allah akan memenangkan Rasulullah dan agama yang benar ini atas agama yang lain. Orang-orang yang membangkang itu senantiasa berusaha menghalangi jalan Al-qur'an dan dakwah Nabi Muhammad; mereka melarang pengikut mereka untuk mendengar al-qur'an sebagaimana diri mereka enggan mendengarnya, karena takut mereka akan mengimaninya. Namun perbuatan yang mereka lakukan dan usaha yang mereka kerahkan hanya membawa kebinasaan bagi diri mereka di dunia dan di akhirat, karena Allah akan memenangkan agama-Nya dan menolong nabi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَهُمْ يَنْهَوْنَ (dan mereka sendiri menjauhkan diri daripadanya) Yakni orang-orang musyrik melarang orang lain untuk beriman kepada al-qur’an dan kepada Nabi Muhammad, dan mereka menjauhkan diri darinya. Pendapat lain mengatakan bahwa ayat ini diturunkan untuk Abu Thalib yang melarang orang-orang kafir untuk menyakiti Rasulullah, namun dia sendiri tidak beriman kepadanya. وَإِن يُهْلِكُونَ إِلَّآ أَنفُسَهُمْ وَمَا يَشْعُرُونَ (dan mereka hanyalah membinasakan diri mereka sendiri, sedang mereka tidak menyadari) Yakni dengan larangan dan kejauhan mereka itu, tidak membinasakan kecuali diri mereka sendiri dengan membahayakan diri mereka dalam azab dan kemurkaan Allah dan apa yang mereka rasakan dari siksa yang mereka undang sendiri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَهُمْ يَنْهَوْنَ عَنْهُ وَيَنْأَوْنَ عَنْهُ } Orang-orang kafir itu tahu akan keagungan al-qur'an dan daya tarik yang diberikan olehnya, tetapi mereka tidak berputus asah dari memalingkan orang-orang darinya, dan mereka terus berusaha membuat orang lain benci dengan al-Qur'an dengan segala cara, tetapi apa yang mereka perbuat justru membuat penyebaran al-Qur'an lebih luas, tadabbur dan taklim al-Qur'an semakin diminati orang banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Dan orang-orang musyrik yang mencegah manusia untuk mendengarkan Al-Qur’an dan menjauhkan mereka dari Al-Qur’an itu tidak bisa menghancurkan agama yang benar, kecuali hanya menghancirkan diri sendiri dengan menyuguhkannya kepada azab. Dan mereka tidak menyadari kemudharatan dari kekufuran mereka atas diri mereka sendiri. Ayat ini turun terkait paman-paman Nabi SAW yang berjumlah 10 orang. Mereka adalah orang-orang paling keras menentangnya secara terang-terangan dan sembunyi-sembunyi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka melarang (orang lain) kepadanya} mengikuti nabi Muhammad SAW {dan mereka pun menjauhkan diri darinya} mereka saling menjauhkan diri mereka darinya {Mereka tidak membinasakan} mereka tidak menghancurkan {kecuali diri mereka sendiri, tetapi mereka tidak menyadari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Dan mereka,” yakni orang-orang yang menyekutukan Allah dan mendustakan para Rasul menggabungkan antara sesat dan menyesatkan (orang lain), mereka melarang manusia mengikuti kebenaran, memperingatkan dan menjauhkan mereka darinya. Apa yang mereka lakukan ini tidak sedikit pun merugikan Allah dan hamba-hambaNYa yang beriman. “Dan mereka hanyalah membinasakan diri mereka sendiri, sedang mereka tidak menyadari” hal itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 26: Dan mereka melarang (manusia) dari padanya, dan mereka berjauh diri dari padanya, padahal tidaklah mereka itu membinasakan, melainkan diri mereka sendiri, tetapi mereka tidak sadar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Adapula yang mengartikan, \"Mereka melarang orang lain mengikuti Nabi\". Dan tidak beriman kepadanya. Mereka menggabung antara keadaannya yang sesat dan menyesatkan orang lain. Mereka melarang orang lain mengikuti kebenaran dan mereka juga menjauhinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 26",
    "description": "Dan mereka, orang-orang kafir dan orang-orang yang menyekutukan Allah itu, melarang, menghalangi, dan mengancam orang lain mendengarkan Al-Qur'an, dan mereka sendiri, dengan kesadaran dan tekad yang bulat, menjauhkan diri dari Al-Qur'an, rasulullah, dan ajaran islam. Dan sejatinya mereka, dengan menjauhkan diri dari ajaran islam, hanyalah membinasakan diri mereka sendiri dengan membiarkan dirinya dalam kesesatan, sedangkan mereka tidak menyadari sikap mereka yang membinasakan diri sendiri ituayat ini menjelaskan keinginan orang-orang kafir untuk menjadi orang beriman ketika dihadapkan ke neraka. Dan seandainya engkau, wahai rasulullah, melihat orang-orang kafir, orang-orang musyrik, dan orang-orang munafik pada hari kiamat, ketika mereka dihadapkan ke neraka, melihat dahsyatnya rantai dan belenggu api neraka, engkau akan menyaksikan peristiwa penting ketika mereka berkata, aduh, kami sangat ingin seandainya kami dikembalikan ke dunia, tentu kami tidak akan mendustakan ayat-ayat tuhan kami, seperti sikap kami selama hidup di dunia, serta bertekad menjadi orang-orang yang beriman kepada Allah, rasul, dan Al-Qur'an."
  }
]