[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seandainya engkau (Wahai Rasul) melihat kaum musyrikin pada Hari Kiamat, pastilah engkau akan menyaksikan perkara yang dahsyat. Yaitu, ketika mereka digiring menuju nereka dan mereka melihat rantai-rantai dan belenggu-belenggu, dan mereka melihat perkara-perkara dahsyat tersebut dan kejadian-kejadian yang mengerikan dengan mata kepala mereka sendiri, pada saat itulah mereka berkata, “Andai saja kami dikembalikan ke kehidupan dunia, kemudian kami membenarkan ayat-ayat Allah dan mengamalkannya serta menjadi orang-orang yang beriman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Seandainya kamu -wahai Rasul- melihat mereka di hari Kiamat ketika mereka dihadapkan pada api Neraka, lalu mereka mengungkapkan penyesalan mereka dengan mengatakan, “Oh, kiranya kami dikembalikan kepada kehidupan dunia, lalu kami tidak mendustakan ayat-ayat Allah, dan kami termasuk orang-orang yang beriman kepada Allah,” niscaya kamu akan melihat pemandangan yang menakjubkan dari buruknya keadaan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Firman ini ditujukan kepada Rasulullah, dan kata (إذ وقفوا) menggunakan bentuk lampau untuk menunjukkan bahwa peristiwa itu pasti akan terjadi. Hai Muhammad, seandainya engkau melihat orang-orang musyrik yang tersesat dan menyesatkan orang lain itu, ketika akan dimasukkan ke dalam neraka, saat mereka melihat azab yang berat yang tidak dapat mereka hindari, mereka akan berkata: \"sungguh celakalah kami, seandainya kami bisa kembali ke dunia agar kami dapat beriman kepada ayat-ayat Tuhan kami dan tidak mendustakannya, agar kami termasuk orang-orang yang beriman.\" Kalimat keterangan syarat dari kalimat (ولو ترى إذ وقفوا) tidak disebutkan agar setiap orang yang mendengar ayat ini dapat membayangkan dengan seluruh kemampuannya, bagaimana kehinaan yang dirasakan oleh orang-orang musyrik tersebut. Ini merupakan bentuk tingginya kefasihan Al-qur'an. (Tafsir as-sya'rawi 6/3581)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَلَوْ تَرَىٰٓ إِذْ وُقِفُوا۟ عَلَى النَّارِ (Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka) Yakni ketika mereka ditahan di dekat neraka sambil melihat bagaimana neraka tersebut. Yakni niscaya kamu akan melihat pemandangan yang menakutkan dan keadaan yang menyeramkan. فَقَالُوا۟ يٰلَيْتَنَا نُرَدُّ (lalu mereka berkata: “Kiranya kami dikembalikan) Yakni dikembalikan ke dunia. وَلَا نُكَذِّبَ بِـَٔايٰتِ رَبِّنَا (dan tidak mendustakan ayat-ayat Tuhan kami) Mereka berangan-angan untuk dikembalikan sehingga mereka bisa untuk tidak mendustakan dan menjadi orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Dan jika kamu melihat keadaan orang-orang musyrik ketika mereka dipenjarakan di dekat nereka sembari diperlihatkan gambaran neraka, sungguh kamu akan melihat suatu keadaan yang mengejutkan dan menakutkan, Mereka berkata: “Andai saja kami bisa kembali ke dunia, sungguh kami akan bertaubat di sana dan tidak akan mendustakan ayat-ayat Tuhan Kami. Kami akan beriman kepada Allah dan rasulNya. Semua itu hanyalah kebohongan dan alasan untuk menghindar”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu melihat ketika mereka dihadapkan} dihadapkan {ke neraka, mereka berkata,“Seandainya kami dikembalikan} dikembalikan ke dunia {kami tidak akan mendustakan ayat-ayat Tuhan kami, dan kami menjadi orang-orang mukmin.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Allah menyampaikan berita tentang orang-orang musyrik di Hari Kiamat manakala mereka dihadirkan di neraka, “Dan jika kamu (Muhammad) melihat ketika mereka dihadapkan ke neraka,” untuk dicemooh dan diazab, niscaya kamu melihat perkara yang menakutkan dan keadaan yang mengerikan, dan melihat bagaimana mereka mengakui kekufuran dan kefasikan atas diri mereka, mereka berharap dikembalikan ke dunia. “Lalu mereka berkata, ‘Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman,’ (tentulah kamu melihat suatu peristiwa yang mengharukan).”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 27: Dan (amatlah hebat) kalau engkau melihat tatkala mereka didirikan di pinggir neraka, lalu mereka berkata: \"Alangkah baiknya kalau dikembalikan kami (ke dunia) supaya baiknya kalau dikembalikan kami mendustakan ayat-ayat Tuhan kami, dan jadilah kami dari pada orang-orang Mu'minin!'\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 27",
    "description": "Ayat ini menjelaskan keinginan orang-orang kafir untuk menjadi orang beriman ketika dihadapkan ke neraka. Dan seandainya engkau, wahai rasulullah, melihat orang-orang kafir, orang-orang musyrik, dan orang-orang munafik pada hari kiamat, ketika mereka dihadapkan ke neraka, melihat dahsyatnya rantai dan belenggu api neraka, engkau akan menyaksikan peristiwa penting ketika mereka berkata, aduh, kami sangat ingin seandainya kami dikembalikan ke dunia, tentu kami tidak akan mendustakan ayat-ayat tuhan kami, seperti sikap kami selama hidup di dunia, serta bertekad menjadi orang-orang yang beriman kepada Allah, rasul, dan Al-Qur'an. Nurani mereka ingin kembali ke dunia untuk menjadi orang beriman, tetapi sebenarnya bagi mereka telah nyata kejahatan, yaitu penolakan dan kekufuran mereka terhadap ajakan rasulullah yang mereka sembunyikan dahulu dalam lubuk hati mereka. Seandainya mereka dikembalikan ke dunia, suatu angan-angan yang tidak mungkin terjadi, tentu mereka akan mengulang kembali kekufuran, kemusyrikan, dan kemunafikan yang telah dilarang oleh Allah mengerjakannya. Mereka itu kenyataannya sungguh pendusta terhadap diri mereka sendiri."
  }
]