[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebenarnya tidak demikian adanya. Justru akan tampak nyata bagi mereka pada Hari Kiamat apa yang sudah mereka ketahui sendiri tentang kebenaran risalah yang dibawa para rasul di dunia. Kendatipun mereka menampakkan di hadapan para pengikut mereka berupa sikap yang berbeda. Kalaupun ditetapkan bahwa mereka akan dikembalikan ke dunia lagi, dan mendapatkan kesmpatan, pastilah mereka kembali melakukan penentangan dan berbuat kekafiran dan pendustaan. Dan sesungguhnya mereka benar-benar berdusta dengan ucapan mereka, “seandainya kami dikembalikan ke dunia, kami tidak akan mendustakan ayat-ayat tuhan kami dan kami termasuk orang-orang yang beriman. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Sesungguhnya masalahnya tidak seperti yang mereka katakan, bahwa seandainya mereka dikembalikan ke dunia niscaya mereka akan beriman. Justru yang muncul dari mereka ialah apa yang dahulu mereka sembunyikan. Yaitu ucapan mereka, “Demi Allah, dahulu kami bukanlah orang-orang musyrik.” Hal itu terjadi ketika anggota badan mereka memberikan kesaksian yang merugikan mereka. Dan seandainya mereka benar-benar dikembalikan ke dunia, niscaya mereka akan kembali melakukan apa yang dilarang bagi mereka, seperti berbuat kufur dan syirik. Sesungguhnya mereka berbohong dalam janji mereka untuk beriman apabila mereka dikembalikan ke dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Allah Maha Mengetahui tabiat orang-orang yang selalu mendustakan dan membangkang itu. Ketika mereka telah ada di hari kiamat dan timbangan amal telah ditegakkan, dan Allah menampakan kekafiran dan pendustaan memenuhi catatan amal mereka; maka tampakklah dari mereka apa yang dahulu mereka ketahui tentang keesaan Allah dan kebenaran risalah para rasul, meskipun dahulu mereka di dunia menampakkan kebalikan itu semua. Dan pada hari itu mereka berharap dapat kembali ke dunia agar dapat berhenti dari kekafiran dan keingkaran mereka; namun itu tidak akan terjadi, karena mereka hanya berdusta ketika berkata: يليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين “Seandainya kami dikembalikan (ke dunia), tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.” Karena Allah Maha Mengetahui keadaan mereka, seandainya Allah mengembalikan mereka ke dunia saya mereka akan kembali melakukan kesyirikan dan kekafiran. Dalam firman-Nya: (وإنهم لكاذبون) menggunakan bentuk kalimat ismiyah yang berfungsi menunjukkan ketetapan dalam suatu keadaan; yakni kedustaan telah menjadi tabiat mereka di dunia, maka tidak mengherankan jika mereka berharap dapat kembali ke dunia agar beriman, namun jika mereka telah kembali mereka pasti akan kembali kepada tabiat buruk mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. بَلْ بَدَا لَهُم مَّا كَانُوا۟ يُخْفُونَ مِن قَبْلُ ۖ (Tetapi (sebenarnya) telah nyata bagi mereka kejahatan yang mereka dahulu selalu menyembunyikannya) Yakni tampak bagi mereka kemunafikan, kekafiran, dan keburukan amalan yang mereka dahulu sembunyikan, dan mereka yakin bahwa mereka akan binasa karena kesyirikan mereka. Oleh sebab itu mereka mengubah sikap dengan berangan-angan dan berjanji dengan janji palsu. Dan bisa jadi yang dimaksudkan adalah tampak bagi mereka kebenaran yang dahulu mereka sembunyikan dalam hati mereka yakni kebenaran Nabi Muhammad dalam berita-berita yang dibawanya, meskipun mereka mengaku dalam perkumpulan-perkumpulan mereka bahwa mereka mendustakan Muhammad. وَلَوْ رُدُّوا۟ (Sekiranya mereka dikembalikan ke dunia) Sebagaimana yang mereka angan-angankan. لَعَادُوا۟ (tentulah mereka kembali) Yakni kembali kepada apa yang telah dilarang kepada mereka, berupa keburukan-keburukan dan yang paling besar adalah kesyirikan. Sebagaimana Iblis yang telah menyaksikan ayat-ayat Allah namun ia masih saja durhaka. وَإِنَّهُمْ لَكٰذِبُونَ (Dan sesungguhnya mereka itu adalah pendusta belaka) Yakni berdusta dalam janji mereka untuk menjadi orang yang beriman. Karena sebenarnya mereka mengatakan janji itu hanya untuk bisa lolos dari azab yang akan menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Namun sebenarnya telah tampak bagi orang-orang kafir itu kekufuran, dan amal buruk di dunia yang mereka sembunyikan. Dan jika mereka dikambalikan di dunia sebagaimana yang mereka harapkan, maka sungguh mereka akan kembali kepada keyakinan buruk mereka, yaitu kesyirikan dan kemaksiatan, lalu tabiat buruk mereka mendominasi diri mereka. Sesungguhnya mereka itu adalah orang-orang yang berdusta dalam janji atau ucapan mereka, yaitu sesungguhnya harapan mereka untuk kembali itu tidak keluar dari keinginan yang benar untuk beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Namun telah tampak} tampak {bagi mereka apa yang mereka sembunyikan sebelumnya. Seandainya dikembalikan, sungguh mereka akan kembali} sungguh mereka akan kembali {pada apa yang telah dilarang. Sesungguhnya mereka benar-benar orang-orang yang berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Tetapi (sebenarnya) telah nyata bagi mereka sesuatu yang dahulu selalu mereka sembunyikan.” Mereka menyembunyikan pada diri mereka bahwa mereka adalah para pembohong, dan kebenaran yang mereka ketahui muncul pada hati mereka dalam banyak kesempatan, akan tetapi tujuan-tujuan buruk menghalangi mereka dari itu dan memalingkan hati mereka dari kebaikan. Dan dalam hal ini mereka adalah para pembual, karena tujuan mereka itu sebenarnya adalah hendak menolak azab dari diri mereka. Kalaupun “mereka dikembalikan ke dunia, tentulah mereka kembali kepada kesyirikan yang mana mereka telah dilarang mengerjakannya. Dan sesungguhnya mereka itu adalah pendusta-pendusta belaka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 28: Bahkan! Telah nyata bagi mereka apa yang mereka sembunyikan dahulu; dan jika dikembalikan mereka ke (dunia), tentu mereka kembali lagi kepada apa yang mereka dilarang, karena sesungguhnya mereka itu pendusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, bahwa mereka sebenarnya tidak bercita-cita ingin dikembalikan ke dunia untuk beriman kepada Allah, tetapi perkataan itu semata-mata diucapkan karena melihat kedahsyatan neraka, di mana mereka ingin dihindarkan daripadanya. Seperti syirk (menyekutukan Allah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 28",
    "description": "Nurani mereka ingin kembali ke dunia untuk menjadi orang beriman, tetapi sebenarnya bagi mereka telah nyata kejahatan, yaitu penolakan dan kekufuran mereka terhadap ajakan rasulullah yang mereka sembunyikan dahulu dalam lubuk hati mereka. Seandainya mereka dikembalikan ke dunia, suatu angan-angan yang tidak mungkin terjadi, tentu mereka akan mengulang kembali kekufuran, kemusyrikan, dan kemunafikan yang telah dilarang oleh Allah mengerjakannya. Mereka itu kenyataannya sungguh pendusta terhadap diri mereka sendiri. Orang-orang kafir tidak mempercayai adanya kehidupan akhirat dan kebangkitan setelah mati. Dan mereka akan mengatakan pula suatu pandangan yang bersumber dari ideologi materialisme, hidup hanyalah di dunia ini, kini, di sini, dan di tempat ini saja, dan kita tidak akan pernah dibangkitkan untuk hidup di akhirat setelah kematian menimpa diri kita."
  }
]