[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah berkata Orang-orang musyrik yang mengingkari Hari kebangkitan, “Tidaklah ada kehidupan kecuali kehidupan yang sedang kita jalani ini, kita tidak akan dibangkitkan setelah kematian kita. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan orang-orang musyrik itu berkata, “Tidak ada kehidupan lain selain kehidupan yang sedang kita jalani. Dan kita tidak akan dibangkitkan (dari kubur) untuk menjalani hisab (perhitungan amal).”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Mereka hanya mengimani adanya satu kehidupan yaitu kehidupan di dunia, sehingga mereka tidak peduli dengan adanya kehidupan lain yaitu kehidupan dimana Allah membangkitkan manusia untuk memberi perhitungan dan balasan: baik itu menuju surga atau neraka. Mereka senantiasa membangkang dan mengingkari, serta meyakini bahwa kehidupan hanya kehidupan di dunia; mereka hidup di dalamnya, menua, kemudian mati. Dan yang mereka maksud dengan kematian di sini adalah dahulu mereka hanyalah air mani kemudian mereka hidup di dunia. Atau dalam kalimat mereka terdapat pengakhiran dan pendahuluan, yakini: kami hidup di dunia dan mati di sana."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَقَالُوٓا۟ إِنْ هِىَ إِلَّا حَيَاتُنَا الدُّنْيَا (Dan tentu mereka akan mengatakan (pula): “Hidup hanyalah kehidupan kita di dunia ini saja) Yakni kami beramal dengan amalan-amalan kami ini hanyalah untuk kehidupan dunia, dan kami tidak akan beramal untuk akhirat karena akhirat itu tidak ada. وَمَا نَحْنُ بِمَبْعُوثِينَ(dan kita sekali-sekali tidak akan dibangkitkan”) Yakni setelah kematian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Orang-orang musyrik yang mendustakan kebangkitan itu berkata: “Tidaklah kehidupan kita ini hanyalah kehidupan di dunia saja. Kita tidak akan dibangkitkan setelah mati, tidak pula di akhirat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan mereka berkata,“Hidup hanyalah di dunia ini dan kita tidak akan dibangkitkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Dan tentu mereka akan mengatakan (pula),” yakni para pengingkar Hari Kebangkitan, “Hidup hanyalah kehidupan kita di dunia saja.” Perkara dan kondisi sebenarnya serta tujuan kita diciptakan adalah hanya untuk kehidupan dunia semata. “Dan kita sekali-kali tidak akan dibangkitkan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 29: Dan mereka berkata: \"Ini tidak lain, melainkan hidup kita di dunia dan tidaklah kita akan dibangkitkan\"."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil mengingkari adanya kebangkitan. Yakni jika mereka dikembalikan ke dunia, mereka akan mengatakan demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 29",
    "description": "Orang-orang kafir tidak mempercayai adanya kehidupan akhirat dan kebangkitan setelah mati. Dan mereka akan mengatakan pula suatu pandangan yang bersumber dari ideologi materialisme, hidup hanyalah di dunia ini, kini, di sini, dan di tempat ini saja, dan kita tidak akan pernah dibangkitkan untuk hidup di akhirat setelah kematian menimpa diri kita. Namun demikian, ketika di akhirat nanti, orang-orang kafir itu akan mengakui keberadaan kehidupan sesudah mati. Dan seandainya engkau, wahai rasulullah, melihat orang-orang kafir, orang-orang musyrik, dan orang-orang munafik pada hari kiamat ketika mereka dihadapkan kepada tuhannya, tentulah engkau melihat peristiwa yang mengharukan. Dia, Allah, berfirman kepada mereka yang menolak kebangkitan, hidup sesudah mati, bukankah kebangkitan ini benar-benar terjadi' mereka menjawab dengan jujur, sungguh benar, demi tuhan kami, wahai tuhan yang mahabenar. Dia berfirman kepada orang-orang kafir yang keras kepala dan membanggakan diri itu, rasakanlah azab yang sangat dahsyatnya ini, karena dahulu, di dunia, kamu mengingkarinya."
  }
]