[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah , Dia lah tuhan sembahan yang berhak diibadahi di langit dan di bumi. Dan diantara dalil-dalil ke uluhiyahan (ketuhanan) Nya, adalah bahwa Dia maha mengetahui semua yang kalian rahasiakan (wahai manusia), dan apa yang kalian tampakkan, serta mengetahui segala perbuatan kalian, yang baik maupun yang buruk. Oleh karena inilah, Allah menjadi satu-satunya sesembahan yang berhak untuk disembah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan Dia lah Rabb -Subḥānahu- yang berhak disembah di langit dan di bumi. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Dia mengetahui semua niat, ucapan, dan perbuatan yang kalian sembunyikan maupun yang kalian nyatakan. Dan Dia akan memberi kalian balasan yang setimpal dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah adalah Tuhan di langit dan di bumi. Penduduk langit dan bumi menyembah-Nya dengan penuh ketundukan. Dia Maha Mengetahui apa yang makhluk-Nya sembunyikan dan apa yang mereka tampakkan, dan Maha Mengetahui segala amal baik dan buruk mereka. Hanya Dialah yang berhak disembah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَهُوَ اللهُ فِى السَّمٰوٰتِ وَفِى الْأَرْضِ ۖ (Dan Dialah Allah (yang disembah), baik di langit maupun di bumi) Yakni Dia-lah yang disembah, yang Maha memiliki dan berkuasa atas langit dan bumi. Pendapat lain mengatakan maknanya adalah Dialah Allah yang mengetahui apa yang kalian rahasiakan dan kalian tampakkan baik itu di langit maupun di bumi, tidak ada sesuatu yang rahasia bagi-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara kunci dalam tadabbur ayat al-Qur'an ialah : mengetahui saat-saay yang tepat untuk waqaf dan ibtida'. Jika anda membaca frman Allah : { وَهُوَ اللَّهُ فِي السَّمَاوَاتِ } \"Dan Dialah Allah (yang disembah), baik di langit\" kemudian anda berhenti, lalu meneruskan bacaan { وَفِي الْأَرْضِ ۖ يَعْلَمُ سِرَّكُمْ وَجَهْرَكُمْ } \"maupun di bumi; Dia mengetahui apa yang kamu rahasiakan\" maka akan nampak dihadapanmu dari ayat yang agung dan suci ini, bahwasanya Allah dengan kekuasaannya yang berada di langit sesungguhnya Dia mengetahui segala hal yang dirahasiakan oleh hamba-hamba Nya dan apa yang dilahirkan oleh mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dialah Allah berhak disembah, Dzat yang mengatur langit dan bumi, Dzat yang mengetahui rahasia kalian, yaitu apa yang kalian sembunyikan di dalam dada kalian, dan pernyataan terang-terangan kalian, yaitu ucapan dan tindakan yang kalian tampakkan, dan Dzat yang mengetahui perbuatan kalian yang baik atau yang buruk, dan akan membalas kalian sesuai amal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah Allah di langit dan di bumi. Dia mengetahui rahasia kalian dan apa yang kalian tampakkan serta mengetahui apa pun yang kalian usahakan} apapun yang kalian lakukan baik berupa kebaikan maupun keburukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Dia adalah yang dipertuhankan dan disembah “di langit maupun di bumi,” yaitu, penduduk langit dan bumi mereka menyembah Rabb mereka, tunduk kepada kebesaranNya, pasrah kepada kemuliaan dan keperkasaanNya mereka itu adalah para malaikat yang dekat, para nabi yang diutus, para shiddiqin, syuhada, dan orang-orang shalih, Dan Allah “mengetahui apa yang kamu rahasiakan dan apa yang kamu lahirkan dan mengetahui (pula) apa yang kamu usahakan.” Maka berhati-hatilah untuk bermaksiat kepadaNya, rajin-rajinlah beramal yang mendekatkanmu kepadaNya dan mengantarkanmu kepada rahmatNYa, dan jauhilah setiap amal yang menjauhkanmu dariNya dan dari rahmatNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 3: Oleh karena itu, berhati-hatilah jangan sampai kamu bermaksiat kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 3",
    "description": "Dan dialah Allah, tuhan yang menciptakan makhluk, baik yang berada di langit maupun di bumi; di antara sifat-sifat-Nya adalah bahwa dia mengetahui apa yang kamu rahasiakan, tidak ada satu titik pun yang tidak diketahui-Nya; dan dia pun mengetahui apa yang kamu nyatakan, dan dia pun mengetahui pula apa saja yang kamu kerjakan, baik maupun buruk, terbuka maupun tertutup. Allah menjelaskan bahwa manusia yang kafir selalu menolak tandatanda kekuasaan-Nya. Mereka tidak menyadari bahwa Allah mengetahui apa yang mereka rahasiakan. Dan setiap ayat dari ayat-ayat tuhan yang menjelaskan bahwa Allah tuhan yang maha esa, bahwa nabi Muhammad adalah utusan Allah, bahwa Al-Qur'an yang diterimanya adalah wahyu Allah, yang sampai kepada mereka, orang-orang kafir, semuanya selalu diingkarinya dengan kesombongan, tanpa argumentasi yang masuk akal."
  }
]