[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sekiranya engkau (wahai Rasul) menyaksiakan orang-orang yang mengingkari Hari kebangkitan tatkala mereka di hadapkan kepada Allah untuk menentukan nasib mereka pada Hari kiamat, pastilah engkau saksikan kondisi terburuk (pada mereka). Yaitu ketika Allah berfirman, “bukankah kebangkitan ini yang dahulu kalian ingkari di dunia merupakan kebenaran?” Mereka menjawab, “ya, demi Tuhan kami, sesungguhnya itu memang benar. ” Allah berfirman, “Rasakanlah siksaan yang dahulu kalian ingkari. ” Maksudnya, siksaan yang dulu kalian dustakan di dunia lantaran keingkaran kalian terhadap Allah dan RasulNya, Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Seandainya kamu -wahai Rasul- melihat ketika orang-orang yang mengingkari kebangkitan dari kubur itu berdiri di hadapan Rabb mereka, niscaya kamu akan melihat pemandangan yang menakjubkan dari buruknya keadaan mereka. Yaitu ketika Allah bertanya kepada mereka, “Bukankah kebangkitan dari kubur yang dahulu kalian anggap mendustakannya ini benar dan nyata, tidak ada keraguan terhadapnya?” Mereka menjawab, “Kami bersumpah demi Rabb kami yang telah menciptakan kami bahwa kebangkitan dari kubur itu benar dan nyata, tidak ada keraguan terhadapnya.” Ketika itulah Allah berfirman kepada mereka, “Rasakanlah azab ini karena kalian telah mengingkari hari kebangkitan yang dahulu kalian mendustakannya selama hidup kalian di dunia!”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Ini merupakan pertanyaan untuk menegaskan keadaan mereka, dan firman ini ditujukan kepada Nabi Muhammad: Hai Muhammad, Seandainya kamu melihat orang-orang yang mengingkari hari kebangkitan, ketika mereka berdiri di hadapan Tuhan mereka setelah mereka menyaksikan kengerian hari kiamat dan kejadian-kejadian yang ada di dalamnya seperti Hisab, pembalasan, dan siksaan mereka akan berkata: يليتنا نرد ولا نكذب بآيات ربنا ونكون من المؤمنين \"Kiranya kami dikembalikan (ke dunia) dan tidak mendustakan ayat-ayat Tuhan kami.\" Maka kemudian mereka ditanya -untuk mengolok-olok mereka-: Bukankah yang dulu kalian dustakan ini merupakan kebenaran? Maka mereka bersumpah dengan nama Allah dan berkata: Sungguh benar. Lalu Allah berkata kepada mereka: rasakanlah azab ini sebagai bentuk keadilan kami akibat keingkaran danpendustaan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَلَوْ تَرَىٰٓ إِذْ وُقِفُوا۟ عَلَىٰ رَبِّهِمْ ۚ (Dan seandainya kamu melihat ketika mereka dihadapkan kepada Tuhannya) Yakni ketika mereka ditahan untuk menunggu keputusan Tuhan mereka tentang nasib mereka. Yakni niscaya kamu akan melihat sesuatu yang besar. Dan ketika itu Allah akan bertanya kepada mereka: Bukankah kebangkitan ini benar? أَلَيْسَ هٰذَا بِالْحَقِّ ۚ (“Bukankah hal ini benar?”) Yakni bukankah kebangkitan yang kalian ingkari adalah benar adanya? Dan balasan yang kalian pungkiri juga telah disiapkan. قَالُوا۟ بَلَىٰ وَرَبِّنَا ۚ (Mereka menjawab: “Sungguh benar, demi Tuhan kami”) Yakni mereka mengakui apa yang mereka ingkari, dan mereka menekankan pengakuan mereka dengan bersumpah. قَالَ فَذُوقُوا۟ الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ (Berfirman Allah: “Karena itu rasakanlah azab ini, disebabkan kamu mengingkari(nya)”) Yakni disebabkan kekafiran kalian terhadapnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Dan jika kamu melihat kondisi orang-orang yang mengingkari hari kebangkitan itu ketika mereka dipenjarakan untuk menunggu perintah Tuhan dan dihadapkan pada penghisaban, maka sungguh kamu akan menyaksikan sesuatu yang mengejutkan, Allah SWT berfirman kepada mereka: “Bukankah ini kebangkitan yang kebebenaran dan keberadaannya telah kalian ingkari di dunia” Mereka menjawab: “Benar, Demi Allah, kebangkitan itu pasti benar” Lalu Allah berfirman: “Maka rasakanlah azab neraka Jahanam akibat keingkaran kalian terhadap hal itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya kamu melihat ketika mereka dihadapkan kepada Tuhannya} dihadapkan kepada Tuhan mereka {Dia berfirman, “Bukankah ini benar” Mereka menjawab, “Sungguh benar, demi Tuhan kami.” Dia berfirman, “Rasakanlah azab ini karena kalian telah ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “Dan seandainya kamu melihat” orang-orang kafir, “Ketika mereka dihadapkan kepada Tuhannya,” niscaya kamu melihat perkara yang besar dan ketakutan yang amat sangat. “Allah berfirman,” mencela dan memojokkan mereka, “Bukankah (kebangkitan) ini,” yakni azab yang kamu lihat ini “benar?” mereka menjawab, “Sungguh benar, demi Tuhan kami.” Mereka mengakui, tetapi itu tidaklah berguna. “Allah berfirman, ‘Karena itu rasakanlah azab ini, disebabkan kamu mengingkari (nya)’ .”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 30: Dan (alangkah hebatnya!) kalau engkau lihat tatkala mereka dihadapkan kepada Tuhan mereka, (lalu) Ia bertanya: \"Bukankah (hari) ini benar?\" Mereka jawab: \"Benar! Demi Tuhan kami!\" la berkata (lagi): \"Maka rasakanlah 'adzab ini dengan sebab kamu telah kufur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 30",
    "description": "Namun demikian, ketika di akhirat nanti, orang-orang kafir itu akan mengakui keberadaan kehidupan sesudah mati. Dan seandainya engkau, wahai rasulullah, melihat orang-orang kafir, orang-orang musyrik, dan orang-orang munafik pada hari kiamat ketika mereka dihadapkan kepada tuhannya, tentulah engkau melihat peristiwa yang mengharukan. Dia, Allah, berfirman kepada mereka yang menolak kebangkitan, hidup sesudah mati, bukankah kebangkitan ini benar-benar terjadi' mereka menjawab dengan jujur, sungguh benar, demi tuhan kami, wahai tuhan yang mahabenar. Dia berfirman kepada orang-orang kafir yang keras kepala dan membanggakan diri itu, rasakanlah azab yang sangat dahsyatnya ini, karena dahulu, di dunia, kamu mengingkarinya. Allah kemudian menjelaskan bahwa sungguh rugi orang-orang yang mendustakan kebangkitan sesudah mati dan pertemuan dengan Allah di akhirat, sehingga apabila kiamat datang kepada mereka secara tiba-tiba, yang mereka anggap tidak masuk akal, mereka berkata, alangkah besarnya penyesalan kami terhadap kelalaian kami tentang kiamat itu karena kami telah mendustakannya ketika rasulullah dan para pelanjut misi dakwahnya memberitahukan akan terjadinya kiamat. Mereka mengatakan itu sambil mereka memikul dosa-dosa di atas punggungnya. Sungguh, alangkah buruknya apa yang mereka pikul itu, karena merupakan bukti tidak menggunakan nalar dan nurani yang jernih ketika menyikapi ajakan nabi dan rasul itu."
  }
]