[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh, merugilah orang-orang kafir yang mengingkari Hari kebangkitan setelah kematian, sehingga saat Hari kiamat tiba dan mereka dikagetkan dengan tempat kembali yang buruk, mereka berteriak keras menyesali diri mereka atas apa yang tealh mereka sia-siakan di kehidupan dunia mereka dahulu. Mereka memikul dosa-dosa mereka di atas punggung-punggung mereka. Maka betapa buruk beban berat lagi buruk yang mereka pikul itu!"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Sungguh merugi orang-orang yang telah mendustakan kebangkitan dari kubur pada hari Kiamat dan menganggap mustahil pertemuan dengan Allah. Sampai ketika hari Kiamat datang dengan tiba-tiba tanpa diketahui sebelumnya mereka mengungkapkan penyesalan mereka yang sangat dalam dengan mengatakan, “Oh, alangkah besarnya penyesalan kami dan betapa besarnya kekecewaan kami atas kelalaian kami dalam menjalankan perintah Allah. Kami ingkar kepada-Nya dan tidak mempersiapkan diri untuk menghadapi hari Kiamat.” Sementara mereka memikul kesalahan-kesalahan mereka di atas punggung mereka. Ingatlah, sungguh buruk kesalahan-kesalahan yang mereka pikul itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Sungguh merugi orang-orang yang mendustakan perjumpaan dengan Allah dan mengingkari hari kebangkitan, karena mereka telah menjual kehidupan yang kekal dengan kehidupan sementara. Sehingga ketika hari kiamat datang secara tiba-tiba, mereka terkejut dengan kesudahan mereka yang menyakitkan dan pahitnya kerugian yang mereka rasakan. Ketika itu mereka berkata dengan penuh penyesalan: \"Alangkah besar penyesalan kami, karena telah melalaikan kedatangan hari kiamat ini!\" Dan mereka kini memikul akibat dari dosa-dosa mereka dan dosa-dosa orang yang mereka sesatkan. Alangkah buruknya dosa-dosa itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. قَدْ خَسِرَ الَّذِينَ كَذَّبُوا۟ بِلِقَآءِ اللهِ ۖ (Sungguh telah rugilah orang-orang yang mendustakan pertemuan mereka dengan Tuhan) Yang dimaksud adalah keingkaran mereka terhadap hari kebangkitan dan pembalasan. حَتَّىٰٓ إِذَا جَآءَتْهُمُ السَّاعَةُ بَغْتَةً (sehingga apabila kiamat datang kepada mereka dengan tiba-tiba) Yakni hari kiamat yang datang tiba-tiba. قَالُوا۟ يٰحَسْرَتَنَا (mereka berkata: “Alangkah besarnya penyesalan kami) Makna (الحسرة) yakni penyelasan yang besar. عَلَىٰ مَا فَرَّطْنَا فِيهَا (terhadap kelalaian kami tentang kiamat itu!”) Dengan tidak mempersiapkan kedatangannya dan meyakini kejadiannya. وَهُمْ يَحْمِلُونَ أَوْزَارَهُمْ (sambil mereka memikul dosa-dosa mereka) Yakni mereka memikul beratnya dosa-dosa mereka diatas punggung mereka. أَلَا سَآءَ مَا يَزِرُونَ (Ingatlah, amat buruklah apa yang mereka pikul itu) Yakni betapa buruknya yang mereka pikul."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { يَا حَسْرَتَنَا عَلَىٰ مَا فَرَّطْنَا فِيهَا } \"Alangkah besarnya penyesalan kami, terhadap kelalaian kami tentang kiamat itu\", ayat ini menjadi salah satu bukti yang menjelaskan penyesalan orang-orang kafir dan mereka akan merasakan sakitnya pada hari kiamat, karena mereka telah melalaikan peringatan di saat hari-hari lapang itu masih terbuka, maka mesti menjadi pelajaran bagi kita semua sebelum penyesalan itu menjadi kehinaan bagi diri kita sendiri. 2 ). Menghabis waktu dengan mendengarkan sesuatu yang tidak mendekatkan diri kepada Allah; adalah kelalaian yang meni,bulkan kerugian bagi umurmu yang Allah telah karuniakan, maka sungguh orang yang berbuat demikian akan merugi selamanya : { يَا حَسْرَتَنَا عَلَىٰ مَا فَرَّطْنَا فِيهَا } \"Alangkah besarnya penyesalan kami, terhadap kelalaian kami tentang kiamat itu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Sungguh orang-orang yang mengingkari hari kebangkitan dan hari pembalasan akan merugi di akhirat, sehingga ketika kiamat telah datang dengan tiba-tiba, mereka berkata: “Alangkan sangat meruginya kami, karena lalai untuk bersiap-siap menyambut hal ini, yaitu dengan beriman dan beramal shalih” Mereka memikul dosa-dosa mereka di belakang punggung mereka, yaitu, dosa-dosa mereka tetap melekat. Mereka keberatan memikulnya dan merasakan tekanannya. Ingatlah, amat buruklah apa yang mereka pikul itu dan apa yang akan mereka dapatkan, yaitu azab yang buruk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh rugi orang-orang yang mendustakan pertemuan dengan Allah. Maka ketika telah datang kepada mereka hari kiamat secara tiba-tiba} secara tiba-tiba {mereka berkata,“Alangkah besarnya penyesalan kami} Betapa menyesalnya kami {atas kelalaian kami tentangnya}apa yang kami remehkan di dunia {dan mereka memikul dosa-dosa mereka} dosa-dosa mereka {di atas punggung mereka. Alangkah buruknya apa yang mereka pikul} mereka pikul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Orang yang medustakan pertemuannya dengan Allah, telah merugi, menyesal telah gagal meraih kebaikan,lalu pendustaan ini menyeret mereka kepada keberanian melakukan perkara-perkara yang diharamkan dan melakukan dosa-dosa yang membinasakan. “ Sehingga apabila kiamat datang kepada mereka,” sementara mereka berada dalam kondisi terburuk dan terjelek; mereka menampakkan penyesalan mendalam. “Mereka berkata, ‘Alangkah besarnya penyesalan kamiterhadap kelalaian kami tentang Hari Kiamat itu,’” akan tetapi itu adalah penyesalan kadaluwarsa. “ Sambil mereka memikul dosa-dosa di punggungnya. Ingatlah, amat buruk apa yang mereka pikul itu.” Dosa mereka memberatkan mereka. Mereka tidak mapu membebaskan diri darinya. Oleh karena itu mereka kekal di dalam neraka dan berhak untuk mendapat murka Allah selama-lamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-An’am ayat 31: Sesungguhnya telah rugilah orang-orang yang menghadapi (pemeriksaan) Allah, sehingga apabila datang kepada mereka hari Kiamat dengan sekonyong-konyong berkata: \" Kerugian kami atas apa yang telah kami teledor di dunia!\" Padahal dosa mereka atas bahu mereka. Bukankah jelek apa yang mereka dustakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mendustakan kebangkitan, di mana hal itu membuatnya berani mengerjakan perbuatan haram dan perbuatan yang dapat membinasakan. Sedangkan mereka dalam keadaan yang paling buruk, lantas mereka menampakkan penyesalan yang mendalam. Akan tetapi penyesalan pada saat itu tidak berguna lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 31",
    "description": "Allah kemudian menjelaskan bahwa sungguh rugi orang-orang yang mendustakan kebangkitan sesudah mati dan pertemuan dengan Allah di akhirat, sehingga apabila kiamat datang kepada mereka secara tiba-tiba, yang mereka anggap tidak masuk akal, mereka berkata, alangkah besarnya penyesalan kami terhadap kelalaian kami tentang kiamat itu karena kami telah mendustakannya ketika rasulullah dan para pelanjut misi dakwahnya memberitahukan akan terjadinya kiamat. Mereka mengatakan itu sambil mereka memikul dosa-dosa di atas punggungnya. Sungguh, alangkah buruknya apa yang mereka pikul itu, karena merupakan bukti tidak menggunakan nalar dan nurani yang jernih ketika menyikapi ajakan nabi dan rasul itu. Dan sebenarnya kalau mereka menggunakan nalar dan nurani yang jernih dalam menyikapi ajaran Al-Qur'an, mereka akan memahami bahwa kehidupan dunia ini hanyalah permainan dan senda gurau yang hanya akan bermanfaat jika digunakan untuk kehidupan di akhirat. Sedangkan negeri akhirat itu, sungguh lebih baik bagi orang-orang yang bertakwa, yaitu mereka yang beriman dan melindungi dirinya dari malapetaka dunia dan akhirat. Apakah kamu tidak memikirkan-Nya secara mendalam'"
  }
]