[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kehidupan dunia ini dalam kondisinya secara umum, melainkan hanya berisi tipuan dan kebatilan belaka. Dan berbuat amal shalih untuk negeri akhirat itu lebih baik bagi orang-orang yang takut kepada Allah. Mereka ini memelihara diri dari siksaanNya dengan amal ketaatan kepadaNYa dan menjauhi perbuatan-perbuatan maksiat kepadaNya. Tidakkah kalian mau berfikir (wahai orang-orang musyrik yang terpedaya oleh perhiasan dunia), lalu kalian lebih memilih yang abadi daripada yang fana?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan kehidupan dunia yang mereka cintai itu tidak lain hanyalah permainan dan tipu daya belaka bagi orang yang tidak mau melakukan apa yang diridai Allah. Sedangkan negeri Akhirat itu lebih baik bagi orang-orang yang takut kepada Allah dengan melaksanakan apa yang diperintahkan kepada mereka, yaitu beriman dan patuh kepada-Nya, dan meninggalkan apa yang terlarang bagi mereka, yaitu berbuat syirik dan melakukan maksiat. Tidakkah kalian memikirkan hal itu, wahai orang-orang musyrik? Sehingga kalian nantinya akan beriman dan beramal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Selama apapun kehidupan di dunia, ia hanyalah permainan dan senda gurau karena merupakan kehidupan yang fana. Adapun kehidupan akhirat merupakan kehidupan yang kekal, kehidupan ini akan membawa kebaikan bagi orang-orang yang bertakwa. Maka Adakah orang berakal yang memahami hal ini?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَمَا الْحَيَوٰةُ الدُّنْيَآ إِلَّا لَعِبٌ وَلَهْوٌ ۖ (Dan tiadalah kehidupan dunia ini, selain dari main-main dan senda gurau belaka) Maksud dari ayat ini adalah kedustaan orang-orang kafir dalam perkataan mereka tidak lain hanyalah kehidupan dunia. Adapun kehidupan sebenarnya yang pantas untuk beramal untuknya adalah kehidupan akhirat, karena ia kekal tanpa terputus. وَلَلدَّارُ الْءَاخِرَةُ خَيْرٌ لِّلَّذِينَ يَتَّقُونَ ۗ (Dan sungguh kampung akhirat itu lebih baik bagi orang-orang yang bertakwa) Yakni yang bertakwa kepada Allah dengan menjauhi kesyirikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Allah membalas perkataan orang-orang kafir “Tiada kehidupan lagi kecuali kehidupan kami di dunia”, bahwa sesungguhnya kehidupan ini hanyalah permainan yang tidak bisa mewujudkan suatu kemanfaatan dan tidak juga memberikan kemudharatan, serta hiburan yang memalingkan dari sesuatu yang bermakna dan penting. Kehidupan (dunia) itu adalah fatamorgana yang menipu. Sedangkan rumah akhirat dan persiapan diri untu menyambutnya itu lebih baik bagi orang-orang yang takut kepada Allah, takut berbuat syirik dan maksiat. Apakah kalian tidak memikirkan hal itu, wahai orang yang mengingkari akhirat?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kehidupan dunia hanyalah permainan dan senda gurau} tipu daya {sedangkan negeri akhirat itu lebih baik bagi orang-orang yang bertakwa. Tidakkah kalian berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Ini adalah hakikat dunia dan akhirat. adapun hakikat dunia, maka ia adalah main-main dan senda gurau, main-main pada badan dan senda gurau pada hati. Hati cenderung kepadanya, jiwa mencintainya, amnisi-ambisi terkait denganya, dan menyibikkan diri dengannya adalah seperti permainan anak-anak. Adapun akhirat. Maka ia “ lebih baik bagi orang-orang yang bertakwa,” dalam dzat, sipat, kekekalan, kelanggengannya. Di dalamnya terdapat apa yang di inginkan oleh jiwa dan di nikmati oleh mata, berupa kenikmatan hati dan ruh, dan banyaknya kebahagaiaan dan kesenangan, akan tetapi kenikmatan akhirat bukan untuk semua orang. Ia hanya untuk orang-orang yang takwa yang menjalankan perintah-perintah Allah dan menjuahi larangan-laranganNya. “ maka tidakkah kamu memahaminya?” maksudnya apakah kamu tidak memiliki akal yang dengannya kamu mengetahui rumah manakah yang lebih layak di utamakan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 32: Maksudnya kesenangan-kesenangan duniawi itu hanya sebentar dan tidak kekal. Janganlah seseorang terperdaya dengan kesenangan-kesenangan dunia, serta lalai dari memperhatikan urusan akhirat berupa ketaatan dan hal-hal yang membantunya. Maksudnya surga. Yaitu mereka yang mengerjakan perintah Allah dan meninggalkan larangan-Nya. Di surga terdapat apa yang mereka inginkan dan yang menyejukkan pandangan mereka, terdapat kenikmatan bagi hati maupun badan, dan penuh dengan kegembiraan, ini semua diperuntukkan bagi mereka yang bertakwa. Yakni tidakkah mereka dapat membedakan mana yang lebih layak didahulukan; dunia atau akhirat?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 32",
    "description": "Dan sebenarnya kalau mereka menggunakan nalar dan nurani yang jernih dalam menyikapi ajaran Al-Qur'an, mereka akan memahami bahwa kehidupan dunia ini hanyalah permainan dan senda gurau yang hanya akan bermanfaat jika digunakan untuk kehidupan di akhirat. Sedangkan negeri akhirat itu, sungguh lebih baik bagi orang-orang yang bertakwa, yaitu mereka yang beriman dan melindungi dirinya dari malapetaka dunia dan akhirat. Apakah kamu tidak memikirkan-Nya secara mendalam' manusia yang tertipu kehidupan dunia itu mengingkari ayat-ayat Allah dan mengucapkan kata-kata yang menyakiti perasaan rasulullah. Sungguh, kami mengetahui bahwa apa yang mereka katakan bahwa hidup ini hanyalah di dunia ini dan kita tidak akan pernah dibangkitkan untuk hidup di akhirat setelah kita mati, itu benar-benar menyedihkan hatimu, wahai nabi Muhammad. Bersabarlah menghadapi mereka, janganlah bersedih, karena sebenarnya mereka bukan mendustakan engkau. Nurani mereka mengakui kebenaran engkau sebagai rasul Allah, tetapi orangorang yang zalim itu mengingkari ayat-ayat Allah karena kesombongan dan ketertutupan hati mereka."
  }
]