[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami mengetahui bahwa telah menimbulkan rasa sedih di dalam hatimu atas pendustaan kaummu secara lahiriyah terhadapmu. Bersabarlah dan tetap tenang, sebab mereka tidaklah mendustakanmu dalam hati sanubari mereka, akan tetapi meyakini kebenaranmu. Namun, akibat sifat kezhaliman dan permusuhan yang ada pada diri mereka, mereka mengingkari bukti-bukti yang amat jelas terkait kebenaranmu, sehingga membuat mereka mendustakan risalah yang engkau bawa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Kami mengetahui -wahai Rasul- bahwa sikap mereka yang mendustakan dirimu secara lahiriah itu telah membuat kamu bersedih. Tetapi ketahuilah sesungguhnya mereka itu tidak mendustakan kamu di dalam hati mereka. Karena mereka mengetahui bagaimana kejujuran dan amanahmu. Akan tetapi mereka adalah orang-orang yang zalim karena mereka telah menolak perintahmu secara terang-terangan, namun sebenarnya hati mereka meyakini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Allah berfirman kepada Nabi Muhammad untuk menenangkan pikirannya dan menguatkan tekadnya agar dia tetap teguh menjalankan dakwahnya: \"Sungguh kami mengetahui bahwa kamu merasa sedih karena kaummu mendustakan risalahmu, menuduhmu sebagai tukang sihir, dan membuat kedustaan dan tuduhan terhadapmu. Sesungguhnya mereka tidak sedang mendustakanmu karena kamu telah hidup bersama mereka dan menyebutmu sebagai al-amin (orang yang jujur); namun mereka mendustakan ayat-ayat Allah yang kamu datangkan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. قَدْ نَعْلَمُ إِنَّهُۥ لَيَحْزُنُكَ الَّذِى يَقُولُونَ ۖ (Sesungguhnya Kami mengetahui bahwasanya apa yang mereka katakan itu menyedihkan hatimu) Yakni maka dari itu janganlah kamu bersedih. فَإِنَّهُمْ لَا يُكَذِّبُونَكَ (karena mereka sebenarnya bukan mendustakan kamu) Yakni mereka tidak menisbatkan kedustaan kepadamu, karena mereka mengenalmu sebagai orang yang jujur. Namun pendustaan mereka itu merujuk pada apa yang kamu bawa. وَلٰكِنَّ الظّٰلِمِينَ بِـَٔايٰتِ اللهِ يَجْحَدُونَ (akan tetapi orang-orang yang zalim itu mengingkari ayat-ayat Allah) Yakni sebenarnya mereka mendustakan ayat-ayat Allah dan kitab-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Cukuplah musuh-musuhmu mengetahui dan menyadari bahwa apa yang kamu sampaikan adalah benar, maka tetaplah di atas pendirianmu, sekalipun mereka menyalahimu, menyakitimu, dan melemparimu dengan tuduhan yang menyakitkan, perhatikan firman Allah : { قَدْ نَعْلَمُ إِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ ۖ فَإِنَّهُمْ لَا يُكَذِّبُونَكَ } \"Sesungguhnya Kami mengetahui bahwasanya apa yang mereka katakan itu menyedihkan hatimu, (janganlah kamu bersedih hati), karena mereka sebenarnya bukan mendustakan kamu\" { وَجَحَدُوا بِهَا وَاسْتَيْقَنَتْهَا أَنْفُسُهُمْ ظُلْمًا وَعُلُوًّا } \"Dan mereka mengingkarinya karena kezaliman dan kesombongan (mereka) padahal hati mereka meyakini (kebenaran)nya\" { قَالَ لَقَدْ عَلِمْتَ مَا أَنْزَلَ هَٰؤُلَاءِ إِلَّا رَبُّ السَّمَاوَاتِ وَالْأَرْضِ } \"Musa menjawab: “Sesungguhnya kamu telah mengetahui, bahwa tiada yang menurunkan mukjizat-mukjizat itu kecuali Tuhan Yang memelihara langit dan bumi\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Kami benar-benar tahu bahwa apa yang diucapkan orang-orang musyrik berupa pendustaan terhadapmu itu sangat membuatmu sedih, wahai rasulullah. Maka janganlah bersedih, sesungguhnya mereka itu sebenarnya tidak mendustakanmu, karena mereka tahu bahwa dirimu jujur, namun mereka menzalimi diri sendiri itu sesungguhnya mendustakan dan mengingkari ayat-ayat Allah. Abu Jahal berkata: “Sesungguhnya Kami tidak mendustakanmu, melainkan mendustakan apa yang kamu bawa.” Lalu turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami mengetahui bahwa sesungguhnya apa yang mereka katakan itu betul-betul membuatmu sedih. Sesungguhnya mereka tidak mendustakanmu} menghubungkanmu kepada hal dusta {tetapi orang-orang zalim itu selalu mengingkari ayat-ayat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Kami mengetahui bahwa sesuatu yang diucaokan para pendusta kepadamu telah membuatmu sedih dan susah. Kami tidak memintamu untuk bersabar kecuali agar kamu mendapatkan derajat yang tinggi dan orang yang paling mulia. Jangan mengira bahwa ucapan mereka keluar karena ketidaktahuan dan keraguaan tentang keadaanmu, “ karena sebenarnya mereka bukan mendustakan kamu.” Karena mereka mengtahui kejujuranmu, jalan masuk, jalan keluarmu dan seluruh keadaanmu. Bahkan mereka menamkanmu sebelum kamu di utus dengan al-Amin. “ akan tetapi orang-orang yang zhalim itu mengigkari ayat-ayat Allah.” Maksudnya, pendustaan mereka adalah kepafda ayat-ayat Allah yang Allah berikan kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 33: Allah memerintahkan Nabi-Nya untuk bersabar agar Beliau dapat memperoleh derajat yang tinggi di akhirat. Karena mereka mengetahui bahwa kamu adalah orang yang jujur dan amanah. Dalam ayat ini Allah menghibur Nabi Muhammad shallallahu 'alaihi wa sallam dengan menyatakan bahwa orang-orang musyrik yang mendustakan Nabi, pada hakekatnya adalah mendustakan Allah, karena Nabi itu diutus untuk menyampaikan ayat-ayat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 33",
    "description": "Manusia yang tertipu kehidupan dunia itu mengingkari ayat-ayat Allah dan mengucapkan kata-kata yang menyakiti perasaan rasulullah. Sungguh, kami mengetahui bahwa apa yang mereka katakan bahwa hidup ini hanyalah di dunia ini dan kita tidak akan pernah dibangkitkan untuk hidup di akhirat setelah kita mati, itu benar-benar menyedihkan hatimu, wahai nabi Muhammad. Bersabarlah menghadapi mereka, janganlah bersedih, karena sebenarnya mereka bukan mendustakan engkau. Nurani mereka mengakui kebenaran engkau sebagai rasul Allah, tetapi orangorang yang zalim itu mengingkari ayat-ayat Allah karena kesombongan dan ketertutupan hati mereka. Apa yang dialami nabi Muhammad juga dialami para rasul sebelumnya. Dan sesungguhnya rasul-rasul sebelum engkau pun, wahai nabi Muhammad, telah didustakan dan disakiti oleh umatnya yang sombong dan keras kepala, tetapi mereka, para utusan Allah itu memperkuat diri mereka dengan bersabar terhadap pendustaan dan penganiayaan yang dilakukan terhadap mereka, sampai datang pertolongan kami kepada mereka di dunia maupun di akhirat. Dan tidak ada seorang pun di antara jin dan manusia yang dapat mengubah kalimat-kalimat ketetapan Allah bahwa seorang utusan Allah itu akan ditolak, dikucilkan, diusir, bahkan dibunuh. Dan sungguh, telah datang kepadamu, wahai rasulullah, sebagian dari berita rasul-rasul itu yang menunjukkan daya tahan, keuletan dan ketangguhan mental mereka menghadapi kaumnya yang mendustakan."
  }
]