[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh telah mendustakan orang-orang kafir terhadap utusan-utusan Allah sebelummu yang diutsus ke tengah kaum-kaum mereka, dan mereka (para utusan Allah itu) mengalami berbagai gangguan di jalan Allah. Akan tetapi, mereka bersabar akan hal tersebut dan tetap meneruskan dakwah dan jihad mereka sampai datang kepada mereka kemenangan dari Allah. Tidak ada yang dapat mengubah kalimat-kalimat (ketetapan-ketetapan Allah), yaitu wahyu yang diturunkan kepada nabiNya, Muhammad , yang berisi janji kemenangan dariNya bagi beliau atas orang-orang yang memusuhi beliau. Dan sungguh telah sampai kepadamu (wahai rasul) sebagian berita rasul-rasul sebelummu dan apa yang terwujud bagi mereka berupa kemenangan dari Allah, serta apa yang terjadi pada orang-orang yang mendustakan mereka berupa siksaan Allah bagi mereka dan kemurkaanNya terhadap mereka. Engkau memiliki teladan dan cermin baik dari para rasul dahulu. Dalam ayat ini, termuat pelipur lara bagi Rasululah"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan janganlah kamu menyangka bahwa pendustaan itu hanya dialami oleh agama yang kamu bawa saja. Sebab, para rasul sebelummu juga didustakan dan disakiti oleh kaumnya. Tetapi mereka menghadapinya dengan sabar. Mereka terus berdakwah dan berjuang di jalan Allah sampai pertolongan dari Allah tiba. Tidak ada seorang pun yang dapat merubah kemenangan yang telah Allah tuliskan dan telah Dia janjikan kepada para rasul-Nya. Dan telah datang kepadamu -wahai Rasul- berita tentang para rasul serta segala rintangan yang mereka hadapi dari perilaku umat mereka dan pertolongan yang Allah berikan kepada mereka untuk mengalahkan dan membinasakan musuh-musuh mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Dan telah berlalu sunatullah sebelumnya, bahwa rasul-rasul Allah telah didustakan sebagaimana engkau didustakan wahai Muhammad, dan disakiti sebagaimana engkau disakiti; namun mereka tetap bersabar menanggung perlakuan buruk kaum mereka dan tidak menggoyahkan mereka dari jalan dakwah. Jika mereka bersabar sebagai utusan kepada kaum mereka, maka bagaimana denganmu wahai Muhammad, sedangkan engkau adalah penutup para nabi yang diutus kepada seluruh umat manusia? Maka bersabarlah karena Allah adalah penolongmu, tidak ada mampu menolak ketetapan Allah atau menunda kemenangan yang telah Allah janjikan kepadamu; dan segala sesuatu telah ditetapkan masanya. Allah telah menceritakan kepada Rasulullah kisah-kisah para nabi dan rasul. Allah tidak hanya berfirman kepadanya: \"Sesungguhnya para rasul telah didustakan kamu mereka.\" Namun Allah juga menceritakan kisah-kisah mereka dengan terperinci dengan mengkhususkan beberapa surat dalam Al-qur'an tentang kisah mereka, bagaimana mereka didustakan dan disakiti namun mereka tetap bersabar sehingga Allah menguatkan mereka dengan keteguhan, kejayaan, dan kemenangan yang nyata."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَقَدْ كُذِّبَتْ رُسُلٌ مِّن قَبْلِكَ (Dan sesungguhnya telah didustakan (pula) rasul-rasul sebelum kamu) Maka bersabarlah sebagaimana mereka telah bersabar dari pendustaan dan tindakan menyakiti yang ditujukan kepada mereka, sampai datang kepadamu pertolongan Kami sebagaimana telah mendatangi mereka. Dan kamu adalah pemenang dan unggul atas orang-orang yang mendustakanmu. –dan itu telah terjadi, Alhamdulillah-. وَلَقَدْ جَآءَكَ مِن نَّبَإِى۟ الْمُرْسَلِينَ (Dan sesungguhnya telah datang kepadamu sebahagian dari berita rasul-rasul itu) Yakni sebagian kisah mereka dan kisah bagaimana Allah menyelamatkan mereka dan orang-orang beriman yang bersama mereka, serta bagaimana Allah membinasakan orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dan sungguh para rasul terdahulu didustakan sebagaimana kamu didustakan kaummu, lalu mereka bersabar atas pendustaan dan fitnah itu, jadi bersabarlah seperti mereka sampai datang kepadamu pertolongan Kami, seperti kehancuran yang menimpa mereka. Dan tidak ada yang bisa mengganti janji Allah untuk menolong para rasulNya, dan peringatan Allah untuk mengabaikan musuh-musuhNya. Dan sungguh telah datang kepadamu berita-berita tentang para rasul, yaitu penyelamatan mereka dan pembinasaan musuh-musuh mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh rasul-rasul sebelummu telah didustakan, lalu mereka sabar atas dusta dan penganiayaan terhadap mereka sampai datang pertolongan Kami kepada mereka. Tidak ada yang dapat mengubah kalam Allah. Sungguh telah datang kepadamu sebagian berita rasul-rasul itu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “ Dan sungguh telah didustakan (pula) rasul-rasul sebelum kamu, akan tetapi mereka sabar terhadap pendustaan dan penganiayaan (yang dilakukan) terhadap mereka, sampai datang pertolongan kami kepada mereka.” Bersabarlah seperti mereka, niscaya kamu beruntung seperti mereka. “Dan sungguh telah kepadamu sebagian dari berita rasul-rasul itu.” Yang dengannya Kami meneguhkan dan menenangkan hatimu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 34: Ayat ini merupakan hiburan pula bagi Nabi shallallahu 'alaihi wa sallam. Oleh karena itu, bersabarlah sebagaimana mereka bersabar, niscaya kamu akan memperoleh kemenangan sebagaimana mereka. Yang membuat hatimu tenang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 34",
    "description": "Apa yang dialami nabi Muhammad juga dialami para rasul sebelumnya. Dan sesungguhnya rasul-rasul sebelum engkau pun, wahai nabi Muhammad, telah didustakan dan disakiti oleh umatnya yang sombong dan keras kepala, tetapi mereka, para utusan Allah itu memperkuat diri mereka dengan bersabar terhadap pendustaan dan penganiayaan yang dilakukan terhadap mereka, sampai datang pertolongan kami kepada mereka di dunia maupun di akhirat. Dan tidak ada seorang pun di antara jin dan manusia yang dapat mengubah kalimat-kalimat ketetapan Allah bahwa seorang utusan Allah itu akan ditolak, dikucilkan, diusir, bahkan dibunuh. Dan sungguh, telah datang kepadamu, wahai rasulullah, sebagian dari berita rasul-rasul itu yang menunjukkan daya tahan, keuletan dan ketangguhan mental mereka menghadapi kaumnya yang mendustakan. Dan jika keberpalingan mereka terasa berat bagimu, wahai nabi Muhammad, sungguh Allah maha mengetahui apa yang kamu rasakan itu sebagaimana yang dirasakan para nabi sebelummu. Engkau bisa menghadapi mereka dengan menunjukkan mukjizat yang menguatkan kerasulanmu. Maka sekiranya engkau dapat membuat lubang di bumi atau tangga ke langit lalu engkau dapat mendatangkan mukjizat kepada mereka, maka buatlah dengan izin Allah. Dan ada suatu kearifan yang harus senantiasa direnungkan, yaitu bahwa sekiranya Allah menghendaki, tentu dia jadikan mereka semua mengikuti petunjuk, sehingga mereka semuanya beriman kepada Allah. Oleh sebab itu, dengan merenungkan kearifan itu, janganlah sekali-kali engkau termasuk orang-orang yang bodoh dalam memahami hakikat kenabian dan kerasulan sehingga bersikap tidak sabar."
  }
]