[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika berat atasmu (wahai rosul) penolakan orang-orang musyrik dan keberpalinagn mereka dalam menyambut dakwahmu, maka jika kamu dapat membuat lubang di bumi atau tangga yang engkau naiki menuju langit, lalu kamu dapat mendatangkan tanda dan bukti atas kebenaran ucapanmu yang berbeda dengan apa yang kami datangkan kepada mereka, maka lakukanlah. Sekiranya Allah menghendaki, pasti Dia menyatukan mereka di atas hidayah yang kalian pegangi dan memberikan taufik bagi mereka untuk beriman. Akan tetapi, Allah tidak menghendaki hal tersebut demi hikmah yang Allah ketahui sendiri, maka janganlah sekali-kali engkau (wahai Rasul), termasuk orang-orang jahil yang kesedihan mereka menjadi-jadi dan diliputi penyesalan hingga menyebabkan mereka dirundung keluh kesah yang amat sangat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Jika kamu -wahai Rasul- merasa berat menghadapi sikap orang-orang yang mendustakanmu dan berpaling dari kebenaran yang kamu tawarkan kepada mereka, maka jika kamu sanggup mencari terowongan yang menembus bumi atau tangga yang menjulang ke langit, kemudian kamu bisa mendapatkan hujah-hujah dan bukti-bukti di luar apa yang Aku berikan kepadamu, lakukanlah. Seandainya Allah berkehendak menyatukan mereka pada petunjuk (agama) yang kamu bawa pasti Dia telah menyatukan mereka. Akan tetapi Allah tidak menghendaki hal itu karena ada hikmah yang sangat berharga. Maka, jangan sekali-kali kamu termasuk orang-orang yang bodoh karena hal itu. Yaitu dengan membiarkan dirimu larut dalam kesedihan karena memikirkan mereka yang tidak mau beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Hai Muhammad, jika terasa berat bagimu keberpalingan mereka darimu dan dari petunjukmu, dan terus-menerus melakukan kekafiran dan penentangan hingga datang mukjizat kepada mereka sebagai bukti kebenaran apa yang kamu katakan bahwa kamu adalah utusan Allah; maka buatlah mukjizat itu, seperti agar kamu dapat membuat lubang di bumi bagi mereka atau tangga yang dapat kamu gunakan untuk menaiki langit agar kamu dapat mendatangkan mukjizat. Namun tentu kamu tidak akan mampu melakukan itu, karena itu di atas kemampuan dan kuasamu. Oleh sebab itu tidak ada yang dapat kamu lakukan kecuali bersabar dan tetap tegar. Hinaan dan keberpalingan kaum-kaum terdahulu terhadap Rasul mereka merupakan hal yang biasa terjadi. Seandainya Allah menghendaki niscaya Dia akan menjadikan seluruh manusia beriman. Maka janganlah kamu terlalu sedih terhadap mereka sehingga kamu menjadi seperti orang-orang jahil yang tidak mampu bersabar ."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَإِن كَانَ كَبُرَ عَلَيْكَ إِعْرَاضُهُمْ (Dan jika perpalingan mereka (darimu) terasa amat berat bagimu) Rasulullah menganggap besar dan berat keberpalingan kaumnya, dan merasa sedih atas itu, maka Allah menjelaskan kepadanya bahwa keberpalingan yang muncul dari mereka adalah sesuatu yang memang harus terjadi, sebagaimana telah termaktub dalam ilmu Allah, dan penerimaan serta perbaikan mereka merupakan diluar kemampuan Rasulullah sebelum Allah meng-izinkan itu terjadi. فَإِنِ اسْتَطَعْتَ أَن تَبْتَغِىَ نَفَقًا فِى الْأَرْضِ (maka jika kamu dapat membuat lobang di bumi) Lalu kamu mendatangkan mereka ayat atau mukjizat darinya. أَوْ سُلَّمًا فِى السَّمَآءِ فَتَأْتِيَهُم بِـَٔايَةٍ ۚ( atau tangga ke langit lalu kamu dapat mendatangkan mukjizat kepada mereka) Yakni maka lakukanlah jika kamu bisa. Akan tetapi kamu tidak bisa melakukan itu, maka tinggalkanlah kesedihan. Makna (النفق) yakni celah atau lubang. Makna (السلم) yakni tangga yang dipakai untuk naik. Dan dalam hal ini Allah menyimpan hikmah, bahwa seandainya Rasulullah datang dengan membawa mujizat yang membuat mereka semua beriman maka beban penyampaian risalah yang merupakan cobaan dan ujian tidak lagi memiliki makna. Oleh sebab itu Dia berfirman: “Kalau Allah menghendaki, tentu saja Allah menjadikan mereka semua dalam petunjuk”. وَلَوْ شَآءَ اللهُ لَجَمَعَهُمْ عَلَى الْهُدَىٰ ۚ (Kalau Allah menghendaki, tentu saja Allah menjadikan mereka semua dalam petunjuk) Yakni dengan mengumpulkan antara pertolongan dan paksaan agar mereka semua beriman. Namun Allah tidak menghendaki hal itu, dan hanya milik Allah hikmah yang dalam. فَلَا تَكُونَنَّ مِنَ الْجٰهِلِينَ (sebab itu janganlah sekali-kali kamu termasuk orang-orang yang jahil) Karena kesedihan yang mendalam atas keberpalingan orang-orang kafir dari menerima seruanmu sebelum Allah mengizinkan itu terjadi merupakan perbuatan orang-orang jahil sedangkan kamu bukanlah termasuk dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Dan jika penolakan orang-orang musyrik terhadap risalahmu terasa berat dan menyakitkan, maka hal itu merupakan wujud dari ilmu Allah yang terdahulu (yang diajarkan). Jika kamu sanggup membuat lubang di bumi dan membuat tangga yang akan kamu naiki menuju langit, maka kamu akan membawakan mereka ayat yang luar bisa yang bisa kamu gunakan untuk memaksa mereka beriman. Maka lakukanlah hal itu, namun dengan hal itu mereka tetap tidak beriman. Jika Allah berkehendak untuk memberi petunjuk mereka, niscaya Dia menunjukkan mereka semua, namun Dia tidak menghendakinya, maka janganlah kamu termasuk orang-orang yang tidak mengetahui hal itu dan juga hikmah dalam perintah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika terasa berat} terasa berat dan sakit {bagimu keberpalingan mereka, maka jika kamu dapat mencari} mencari {lubang di bumi atau tangga ke langit} tangga menuju langit {lalu kamu dapat mendatangkan ayat kepada mereka. Jika Allah menghendaki, tentu Dia akan menjadikan mereka semua mendapat petunjuk. Maka jangan sekali-kali kamu termasuk orang-orang yang bodoh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. “ Dan jika keberpalingan mereka (darimu) teras amat berat bagimu,” karena kesungguhan dan kecintaanmu terhadap keimanan mereka, maka kerahkan kemampuanmu dalam hal itu karena memberi petunjuk kepada orang-orang yang mana Allah tidak ingin memberinya petunjuk bukanlah dalam jangkauan kemampuanmu. “Maka jika kamu dapat membuat lubang di bumi atau tangga ke langit lalu kamu dapat mendatangkan mujizat kepada mereka,” maka lakukanlah itu, namun hal itu tidaklah berguna bagi mereka. Ini adalah pemupusan keinginan kuat Muhammad untuk memberi hidayah kepada orang-orang yang ingkar tersebut. “ Kalau Allah mengehndaki, tentu saja Allah menjadikan mereka semua dalam petunjuk,” akan tetapi hikmahnNya menuntut keberadaan mereka dalam kesesatan. “ Sebaba itu janganlah kamu sekali-kali termasuk orang-orang yang jahil.’ Yaitu orang-orang yang tidak mengetahuihakikat perkara dan tidak meletakkannya pada tempatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 35: Maksudnya janganlah kamu merasa keberatan atas sikap mereka berpaling daripada Kami. Kalau kamu merasa keberatan, cobalah mengusahakan suatu mukjizat yang dapat memuaskan hati mereka, dan kamu tentu tidak akan sanggup, dan lagi hal itu tidaklah bermanfaat bagi mereka, karena menunjukkan orang yang tidak diinginkan Allah memperoleh hidayah bukanlah kemampuanmu, oleh karena itu bersabarlah sampai datang keputusan Allah. Akan tetapi hikmah Allah menghendaki untuk membiarkan mereka di atas kesesatan. Yakni orang-orang yang tidak mengetahui hakikat perkaranya dan tidak menempatkan sesuatu pada tempatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 35",
    "description": "Dan jika keberpalingan mereka terasa berat bagimu, wahai nabi Muhammad, sungguh Allah maha mengetahui apa yang kamu rasakan itu sebagaimana yang dirasakan para nabi sebelummu. Engkau bisa menghadapi mereka dengan menunjukkan mukjizat yang menguatkan kerasulanmu. Maka sekiranya engkau dapat membuat lubang di bumi atau tangga ke langit lalu engkau dapat mendatangkan mukjizat kepada mereka, maka buatlah dengan izin Allah. Dan ada suatu kearifan yang harus senantiasa direnungkan, yaitu bahwa sekiranya Allah menghendaki, tentu dia jadikan mereka semua mengikuti petunjuk, sehingga mereka semuanya beriman kepada Allah. Oleh sebab itu, dengan merenungkan kearifan itu, janganlah sekali-kali engkau termasuk orang-orang yang bodoh dalam memahami hakikat kenabian dan kerasulan sehingga bersikap tidak sabarayat sebelumnya berbicara tentang kaum yang durhaka dan karena mereka berpaling maka mereka tidak akan beriman, maka pada ayat ini menegaskan bahwa hanya orang-orang yang berusaha sungguhsungguh untuk mendengar sajalah yang akan mematuhi seruan Allah, karena mereka bukan orang-orang yang mati sehingga mereka dapat memetik pelajaran dari apa yang mereka dengarkan, dan orang-orang yang mati, baik mati hati nuraninya maupun mati dalam arti yang sebenarnya, kelak akan dibangkitkan oleh Allah, kemudian kepada-Nya mereka dikembalikan untuk mempertanggungjawabkan semua perbuatan mereka."
  }
]