[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya yang menyambutmu (wahai rasul), kepada apa yang engkau dakwahkan yang berisi hidayah, hanyalah orang-orang yang mendengarkan perkataan dengan pendengaran untuk menerimanya. Adapun orang-orang kafir, mereka itu terhitung manusia-manusia yang telah mati, sebab hidup yang hakiki hanya dengan dasar islam. Dan orang-orang yang telah mati akan Allah keluarkan mereka dari kubur-kubur mereka dalam keadaan hidup, dan kemudian akan kembali kepada Allah pada Hari Kiamat untuk menerima perhitungan dan balasan (perbuatan) mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sesungguhnya yang mau menerima agama yang kamu bawa hanyalah orang-orang yang bisa mendengar dan memahami kata-kata. Sedangkan orang-orang kafir adalah orang-orang mati yang tidak punya kemampuan untuk itu. Karena hati mereka telah mati. Dan orang-orang yang mati itu akan dibangkitkan kembali oleh Allah kelak pada hari Kiamat. Kemudian mereka semua akan dikembalikan kepada-Nya untuk menerima balasan yang setimpal atas perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Hai Muhammad, sesungguhnya orang-orang yang menerima dakwahmu adalah orang-orang yang mendengar dengan telinga yang sadar dan hati yang jujur yang mencintai petunjuk dan mentaati apa yang didengarnya. Ini merupakan ciri-ciri orang-orang yang benar-benar beriman yang tetap teguh bersamamu dan bersabar dalam menjalankan dakwah. Adapun orang-orang yang tidak menerima dakwahmu seperti orang-orang kafir dan musyrik, mereka adalah mayat-mayat meskipun mereka masih hidup, karena kehidupan sesungguhnya bagi manusia tersembunyi pada penerimaannya terhadap cahaya iman dan Islam. Orang-orang kafir itu adalah orang-orang mati dalam rupa manusia hidup; Allah akan membangkitkan mereka setelah kehidupan dunia mereka berakhir, mereka akan kembali kepada-Nya dan akan ditanya tentang amal perbuatan mereka di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. إِنَّمَا يَسْتَجِيبُ الَّذِينَ يَسْمَعُونَ ۘ (Hanya mereka yang mendengar sajalah yang mematuhi) Yakni dengan pendengaran yang digunakan untuk memahami sesuai dengan akal sehat dan pemahaman yang benar. Adapun orang-orang kafir tidak memiliki pendengaran tersebut, akan tetapi mereka seperti halnya orang mati yang tidak bisa mendengar. وَالْمَوْتَىٰ يَبْعَثُهُمُ اللهُ(dan orang-orang yang mati (hatinya), akan dibangkitkan oleh Allah) Yakni sebagaimana Allah akan membangkitkan orang-orang mati, begitu juga orang-orang kafir bisa jadi akan menghadap Allah dengan hati mereka untuk memahami apa yang kamu (Muhammad) datangkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36 Hanya mereka yang mendengar, memahami dan menelaah sajalah yang akan mematuhi seruanmu untuk beriman kepada Allah wahai Nabi. Dan orang-orang yang mati hatinya atau orang-orang kafir, mereka akan dibangkitkan oleh Allah di akhirat, kemudian kepada-Nya-lah mereka dikembalikan dan akan diberi balasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hanya orang-orang yang menyimak sajalah yang menjawab. Adapun orang-orang yang mati} orang-orang kafir {akan dibangkitkan oleh Allah, kemudian kepadaNya mereka dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Allah berfirman kepada NabiNya, “ Yang mematuhi” seruanmu dan mengikuti risalahmu seerta taat kepada perintah dan laranganmu, hanyalah “ orang-orang yang mendegar” dengan hatinya apa yang bermanfaat untuknya. Mereka itu adalah orang-orang yang berkal dan mendengar. Yang di maksud dengan “mendengar” di sini adalah mendengar dengan hati dengan penuh rasa ketaatan, kalau bukan itu maksudnya, maka mendengar adalah kegiatan yang bisa di lakukan oleh orang baik dan jahat. Semua mukalaf dengan mendengar ayat-ayatNya berarti hujjah Allah telah tegak atasnya dan tidak ada alasan baginya untuk menolak. “Dan orang-orang mati (hatinnya), akan di bangkitkan oleh Allah, kemudian kepadanya-lah mereka di kembalikan.” Ada kemungkinan maknanya adalah makna yang mengimbangi makna sebelumnya, yakni yang menjawabmu hanyalah orang yang hatinya hidup. Adapun orang yang hatinya mati yang tidak merasakan kebahagiaan, tidak menyadari sesuatu yang menyelamatkannya, maka mereka itu tidak menjawabmu, tidak tunduk kepadamu, dan waktu yang dijanjikan bagi mereka adalah Hari Kiamat, di mana Allah membangkitkan mereka lalu kepadaNya dia di kembalikan. Ada kemungkinan bahwa yang di maksud dengan ayat adalah secara zhahirnya, bahwa Allah menetapkan hari kebangkitkan dan bahwa dia akan membangkitkan yang mati pada hari kiamat kemudian memberi tahu kepada mereka apa yang dahulu mereka kerjakan. Dan ini mengandung dorongan untuk menjawab panggilan Allah dan rasulNya serta ancaman meninggalkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 36: Yakni dengan hatinya hal yang bermanfaat bagi mereka, karena jika semata-mata mendengar, maka orang yang baik dan jahat pun sama mendengar. Namun mendengar di sini adalah mendengar yang masuk ke hati lalu mematuhinya. Orang yang mati di sini ada dua makna: Pertama, mati dalam arti mati hatinya, sehingga artinya hanya orang-orang yang hidup hatinya yang mendengarkan seruanmu, adapun orang-orang yang telah mati hatinya, maka mereka tidak mendengarnya. Kedua, mati dalam arti yang sesungguhnya, sehingga maksudnya bahwa Allah Subhaanahu wa Ta'aala akan membangkitkan orang-orang yang telah mati.pada hari kiamat kemudian akan memberitahukan apa yang mereka kerjakan. Sehingga ayat di atas merupakan dorongan untuk memenuhi seruan Allah dan rasul-Nya, serta ancaman melakukan sebaliknya. Lalu Dia akan memberikan balasan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 36",
    "description": "Ayat sebelumnya berbicara tentang kaum yang durhaka dan karena mereka berpaling maka mereka tidak akan beriman, maka pada ayat ini menegaskan bahwa hanya orang-orang yang berusaha sungguhsungguh untuk mendengar sajalah yang akan mematuhi seruan Allah, karena mereka bukan orang-orang yang mati sehingga mereka dapat memetik pelajaran dari apa yang mereka dengarkan, dan orang-orang yang mati, baik mati hati nuraninya maupun mati dalam arti yang sebenarnya, kelak akan dibangkitkan oleh Allah, kemudian kepada-Nya mereka dikembalikan untuk mempertanggungjawabkan semua perbuatan mereka. Setelah menjelaskan situasi yang akan dialami para pendurhaka, Allah mengingatkan nabi Muhammad dan juga umat islam tentang beberapa ucapan dan usul para pendurhaka itu. Dan mereka, orangorang musyrik, berkata, mengapa tidak diturunkan kepadanya, yakni nabi Muhammad, suatu bukti berupa mukjizat dari tuhannya' katakanlah, wahai nabi, sebagai jawaban atas usul mereka yang telah menolak bukti-bukti yang telah ada, sesungguhnya Allah berkuasa menurunkan suatu bukti berupa mukjizat seperti yang mereka usulkan atau selainnya, tetapi kebanyakan mereka tidak mengetahui, yakni enggan menggunakan akal pikirannya secara benar. Kalau mereka tidak dapat meraih petunjuk atas aneka macam bukti dari Allah, itu karena sikap mereka yang memang berpaling dari kebenaran. (lihat: surah ashshaff/61: 5)."
  }
]