[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik berkata (sebagai penentang dan kesombongan), ”Mengapa Allah tidak menurunkan tanda yang menunjukan akan kebenaran Muhammad melalui tanda yang luar biasa?” Maka katakanlah kepada mereka wahai rasul, bahwa sesungguhnya Allah maha kuasa untuk menurunkan pada mereka tanda-tanda itu. Akan tetapi, kebanyakan mereka tidak mengetahi bahwa penurunan mukjizat itu hanya dilakukan sesuai sifat hikmah Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Orang-orang musyrik mengajukan tuntutan yang menyulitkan untuk menunda-nunda keimanan mereka dengan mengatakan, “Mengapa tidak diturunkan kepada Muhammad suatu tanda yang luar biasa sebagai bukti dari Rabbnya bahwa agama yang dibawanya itu benar?” Katakanlah -wahai Rasul-, “Sesungguhnya Allah mampu menurunkan bukti yang mereka inginkan itu. Tetapi kebanyakan dari orang-orang musyrik yang mengajukan tuntutan itu tidak tahu bahwa turunnya tanda-tanda yang luar biasa itu disesuaikan dengan kebijaksanaan Allah -Ta'ālā-, bukan disesuaikan dengan tuntutan mereka. Karena seandainya Allah benar-benar menurunkannya kemudian mereka tidak mau beriman, pasti Allah akan membinasakan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Orang-orang musyrik tidak merasa cukup dengan mukjizat al-qur'an yang sangat fasih yang Allah datangkan sesuai dengan keahlian mereka. Mereka tetap membangkang dan meminta mukjizat lain yang dapat mereka lihat secara kasat mata. Mereka telah buta dari kebenaran; karena mukjizat yang kasat mata hanya bertahan sesaat dan hanya berlaku bagi orang yang menyaksikan dan melihatnya. Orang yang melihatnya akan membenarkannya dengan berkata: \"ini adalah mukjizat\"; Adapun orang yang tidak melihatnya bisa jadi dia tidak mempercayainya. Dan mukjizat yang seperti itu akan berakhir dengan kematian nabi tersebut. Adapun Al-qur'an datang bagi seluruh manusia hingga hari kiamat. Alquran telah menantang mereka untuk mendatangkan yang semisalnya atau semisal satu surat yang ada di dalamnya. Allah Maha Kuasa untuk mendatangkan mukjizat yang nampak dengan kasat mata sebagai mukjizat bagi Nabi Muhammad, akan tetapi mereka tidak benar-benar meminta mukjizat itu untuk mendapat kebenaran, namun hanya untuk membantah dan menentang agar mereka tetap tidak beriman. Dan nabi-nabi terdahulu datang dengan mukjizat yang kasat mata karena risalah mereka hanya bagi umat tertentu dan pada zaman tertentu. Adapun Nabi Muhammad datang untuk seluruh manusia, di setiap tempat dan zaman hingga hari kiamat, sehingga mukjizat yang sesuai baginya adalah mukjizat yang senantiasa ada di setiap tempat dan zaman; mereka sungguh tidak memahami hikmah tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37 وَقَالُوا۟ لَوْلَا نُزِّلَ عَلَيْهِ ءَايَةٌ مِّن رَّبِّهِۦ ۚ (Dan mereka (orang-orang musyrik Mekah) berkata: “Mengapa tidak diturunkan kepadanya (Muhammad) suatu mukjizat dari Tuhannya?”) Yakni mukjizat yang dapat menjadikan mereka beriman, seperti dengan turunnya malaikat yang dapat mereka lihat dan dengar suaranya atau gunung yang diangkat dari tempatnya. Maka Allah memerintahkan Rasulullah untuk menjawab mereka dengan jawaban:اللهَ قَادِرٌ عَلَىٰٓ أَن يُنَزِّلَ ءَايَةً (Allah berkuasa menurunkan suatu mukjizat), akan tetapi Allah tidak melakukan hal tersebut agar tujuan dari pembebanan atas risalah yang merupakan ujian dan cobaan bisa tetap ada; dan juga seandainya Allah menurunkan mukjizat sebagaimana yang mereka minta, namun mereka tetap saja tidak beriman niscaya Allah tidak akan memberi mereka penangguhan, tapi Dia akan langsung mengazab mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37 Orang-orang musyrik Makkah berkata: “Mengapa tidak diturunkan kepada Muhammad suatu mukjizat dari Tuhannya sebagaimana yang kami minta? Sebagai bukti bahwa memang dia benar, seperti mengangkat gunung dan menurunkan malaikat.” Katakanlah kepada mereka wahai Rasul: “Sesungguhnya Allah kuasa menurunkan suatu mukjizat yang bisa membawa kepada keimanan, tetapi jika Allah mengabulkan permintaan mereka dan mereka tidak beriman, maka itu hanya akan mempercepat turunnya azab untuk mereka. Kebanyakan mereka tidak mengetahui akibat apa yang akan mereka terima jika mereka tidak beriman”. Ayat ini turun setelah peperangan hamraul asad setelah peperangan Uhud."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Mengapa tidak} mengapa tidak {diturunkan kepadanya suatu ayat dari Tuhannya” Katakanlah, “Sesungguhnya Allah Maha kuasa menurunkan suatu ayat, tetapi kebanyakan mereka tidak mengetahui.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Dan mereka orang-orang musyrik Makkah berkata,” yakni orang-orang yang mendustakan Rasululoh karena keras kepada sombong, “ Mengapa tidak di turunkan kepadanya suatu mujizat dari tuhanNya?” maksudnya, adalah mukjizat-mukjizat yang mereka usulkan dengan akal mereka yang rusak dan pertimbangan mereka yang basi seperti ucapan mereka, \"Dan mereka berkata: “Kami sekali-kali tidak percaya kepadamu hingga kamu memancarkan mata air dan bumi untuk kami, atau kamu mempunyai sebuah kebun korma dan anggur, lalu kamu alirkan sungai-sungai di celah kebun yang deras alirannya, atau kamu jatuhkan langit berkeping-keping atas kami, sebagaimana kamu katakan atau kamu datangkan Allah dan malaikat-malaikat berhadapan muka dengan kami.\"(Al-Isra: 90-92). “ katakanlah” untuk menjawab ucapan mereka, “ sesungguhnya Allah kuasa menurunkan suatu mijizat.” Tidak ada kelemahan dalam Qudrat Allah, bagamana bisa terjadi sementara sesuatu pasrah dan tunduk di hadapan kemuliaan dan kekuasaaNya? Akan tetapi kebanyakan orang tidak mengetahui. Karena kebodohan dan ketidaktahuan, mereka meminta sesuatu yang lebih buruk daripada mukjizat-mukjizat yang mana jika ia datang lalu mereka tidak mereka beriman kepadanya, niscaya azab akan di segerakan kepada mereka sebagaimana ia menjadi sunnatulah yang ytidak ada perubahan. Walaupun begitu,jika maksud mereka adalah mukjizat-mukjizat yang menjelaskan kebenaran dan menerangkan jalan bagi mereka, maka Muhammad telah hadir dengan seluruh mukjizat yang pasti, hujjah yang kuat yang menunjukkan kebenaran apa yang dia bawa, di mana dalam setiap masalah agama, seorang hamba bisa menemukan beberapa dalil aqli maupun naqli yang tidak menyisakan sedikit pun kebimbangan dan keraguan di dalam hati pada ayat Allah yang dia bawa. Mahasuci Allah yang telah mengutus RasulNya dengan membawa petunjuk dan agama yang benar, dan Dia mendukungnya dengan mukjizat-mukjizat yang jelas agar orang yang binasa menjadi binasa dalam kejelasan dan yang hidup menjadi hidup dalam kejelasan, dan sesungguhnya Allah Maha Mendengar lagi Maha Mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 37: Karena akal mereka yang dangkal (lihat juga Surah Al Israa': 90-93. Padahal jika diturunkan suatu mukjizat, maka ia akan menjadi bala' bagi mereka, di mana jika mereka tetap mengingkarinya, maka mereka akan segera dibinasakan sebagaimana hal itu merupakan sunnatullah yang tidak berubah. Namun demikian, jika maksud mereka ayat-ayat yang menerangkan kebenaran dan menjelaskan jalan, maka Nabi Muhammad shallallahu 'alaihi wa sallam telah membawa ayat yang jelas dan hujjah yang nyata yang menunjukkan benarnya apa yang Beliau bawa, di mana seorang hamba menemukan di sana dalil 'aqli dan naqli yang tidak meninggalkan keraguan sedikit pun di hati, maka Mahasuci Allah yang telah mengutus rasul-Nya dengan membawa petunjuk dan agama yang benar dan menguatkannya dengan bukti-bukti yang nyata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 37",
    "description": "Setelah menjelaskan situasi yang akan dialami para pendurhaka, Allah mengingatkan nabi Muhammad dan juga umat islam tentang beberapa ucapan dan usul para pendurhaka itu. Dan mereka, orangorang musyrik, berkata, mengapa tidak diturunkan kepadanya, yakni nabi Muhammad, suatu bukti berupa mukjizat dari tuhannya' katakanlah, wahai nabi, sebagai jawaban atas usul mereka yang telah menolak bukti-bukti yang telah ada, sesungguhnya Allah berkuasa menurunkan suatu bukti berupa mukjizat seperti yang mereka usulkan atau selainnya, tetapi kebanyakan mereka tidak mengetahui, yakni enggan menggunakan akal pikirannya secara benar. Kalau mereka tidak dapat meraih petunjuk atas aneka macam bukti dari Allah, itu karena sikap mereka yang memang berpaling dari kebenaran. (lihat: surah ashshaff/61: 5). Allah mahakuasa untuk sekadar mengabulkan permintaan orangorang musyrik seperti dalam ayat sebelumnya. Dan di antara contoh kekuasaan Allah adalah tidak ada seekor binatang yang merayap atau bergerak dengan kakinya dari satu tempat ke tempat lainnya yang ada di bumi, baik di darat maupun di laut, dan juga burung-burung yang terbang dengan kedua sayapnya, melainkan semuanya merupakan umat-umat juga seperti kamu, hai manusia. Tidak ada sesuatu pun yang kami luputkan atau abaikan di dalam kitab, yaitu Al-Qur'an atau lauh mahfudh, kemudian kepada tuhan mereka yakni seluruh manusia akan dikumpulkan untuk dimintai pertanggungjawaban."
  }
]