[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah ada di permukaan bumi binatang yang berjalan atau burung yang terbang di langit dengan mengepakkan dua sayapnya, kecuali merupakan kelompok-kelompok makhluk yang saling memiliki keserupaan sifat fisik dengan sesama jenisnya, layaknya kalian. Tidak ada sesuatu yang kami abaikan di lauhilmahfuzh , kami telah menuliskannya semua. Kemudian mereka akan dihimpun ke hadapan tuhan mereka pada Hari Kiamat. Allah akan mengadakan perhitungan dengan masing-masing makhluk sesuai dengan apa yang diperbuatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Setiap binatang yang bergerak di muka bumi dan burung yang terbang di langit adalah bangsa seperti kalian -wahai Anak Adam- yang diciptakan oleh Allah dan membutuhkan rezeki. Tidak ada sesuatu pun yang Kami abaikan di loh mahfuz, karena semuanya telah Kami tetapkan. Dan semuanya diketahui oleh Allah. Kemudian mereka semua akan dikumpulkan di hadapan Rabb mereka di hari Kiamat untuk menerima keputusan dari-Nya. Lalu masing-masing akan menerima balasan yang setimpal dengan amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Tanda-tanda kekuasaan Allah di alam semesta ini tidak terhitung banyaknya. Manusia diciptakan di dunia tidak untuk sesuatu yang sia-sia atau karena kebetulan; namun terdapat makhluk-makhluk lain di sekitar mereka, seperti hewan melata, burung-burung, serangga, dan lain sebagainya; itu semua memiliki ciri yang sama dengan manusia, butuh terhadap Sang Pencipta agar Dia memberi rezeki, menjaga, dan mengatur urusannya; dan mereka pada akhirnya akan dikumpulkan menuju Tuhan mereka untuk memutuskan perkara antara mereka. Allah sama sekali tidak melalaikan itu semua, Dia telah menulis dalam Lauhul Mahfudz segala urusan agama baik itu secara terperinci atau secara umum; maka apakah masuk akal bahwa Allah yang memiliki kekuasaan seperti ini, tidak mampu untuk menurunkan mukjizat?! Allah mengungkapkan kata 'طيران' (terbang) dengan penegasan 'بجناحيه' (dengan dua sayap) karena terbang hanya dapat dilakukan dengan dua sayap. Hal ini agar tidak ada yang berpendapat bahwa yang dimaksud Allah adalah makna majas yang berarti arti amal perbuatan sebagaimana dalam firman-Nya: ألزمناه طائره في عنقه “Telah Kami tetapkan amal perbuatannya (sebagaimana tetapnya kalung) pada lehernya.” (al-Isra: 13)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَمَا مِن دَآبَّةٍ فِى الْأَرْضِ وَلَا طٰٓئِرٍ يَطِيرُ بِجَنَاحَيْهِ إِلَّآ أُمَمٌ أَمْثَالُكُم ۚ (Dan tiadalah binatang-binatang yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan umat (juga) seperti kamu) Setiap jenis dari hewan-hewan tersebut memiliki aturannya sendiri-sendiri, seperti pekembangbiakan, cara hidup, interaksi, makanan, dan segala urusan kehidupannya Allah-lah yang menciptakannya sebagaimana Dia menciptakan kalian, memberinya rezeki sebagaimana memberi kalian rezeki, yang mana hal itu berada dalam ilmu dan takdir Allah yang meliputi segala sesuatu. Pendapat lain mengatakan yakni hewan-hewan tersebut seperti kalian dalam hal berzikir kepada Allah dan sebagai petunjuk akan kebesaran-Nya. مَّا فَرَّطْنَا فِى الْكِتٰبِ مِن شَىْءٍ ۚ( Tiadalah Kami alpakan sesuatupun dalam Al-Kitab) Yakni baik itu dari urusan-urusan kalian maupun urusan-urusan hewan-hewan tersebut. Yang dimaksud dengan al-kitab adalah lauhul mahfudz, Allah telah menetapkan didalamnya segala kejadian. ثُمَّ إِلَىٰ رَبِّهِمْ يُحْشَرُونَ (kemudian kepada Tuhanlah mereka dihimpunkan) Yakni hewan-hewan tersebut. Ayat ini menunjukkan bahwa hewan-hewan tersebut akan dibangkitkan dan dikumpulkan sebagaimana manusia akan dikumpulkan. Abu Hurairah berkata: “tidak ada hewan melata atau burung kecuali akan dibangkitkan di hari kiamat, kemudian mereka akan saling mengqishash, sampai hewan yang tak bertanduk akan mengqishash hewan bertanduk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sufyan bin 'Uyainan bertutur : Tidaklah di satu tempat di muka bumi ini ada kumpulan anak Adam kecuali diantara mereka ada yang sifatnya menyerupai binatang : dinatar mereka ada yang berjalan bagaikan singa, dan ada yang berlari bagaikan serigala, dan ada yang menyalak bagaikan anjing, dan ada yang bersolek bagaikan burung merak, dan di antara mereka ada juga yang rakus bagaikan seekor babi, juga kita akan dapati dinatara manusia jika mendengarkan 50 buah hikmah dia meninggalknnya dan tidak menjaganya satu pun, tetapi jika kamu berbuat salah dia akan mengingatnya terus menerus, maka hati-hatilah dari sifat-sifat yang buruk ini. 2 ). { مَا فَرَّطْنَا فِي الْكِتَابِ مِنْ شَيْءٍ } Al-Qur'an mencakup segala hal, juga ilmu pengetahuan dan permasalahan yang keluar darinya juga akan ditemukan ayat yang mengarah kepadanya, di dalamnya ada pengetahuan tentang keajaiban penciptaat makhluq hidup, dan tentang kerajaan Allah yang menguasai langit dan bumi, dan apa yang ada di luar angkasa, juga terdapat ayat yang berbicara tentang alam bawah tanah, dan tentang nama-nama Malaikat dan para Rasul, dan khabar tentang umat-umat, juga ada ayat yang berbica tentang awal penciptaan manusia sampai kematiannya, Maha besar Allah dengan segala kekuasan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38 Tidak ada satupun binatang melata maupun burung-burung yang terbang dengan kedua sayapnya yang ada di bumi, melainkan terdiri dari berbagai kelompok seperti kalian wahai manusia. Allah lah Yang menciptakannya, memberi rizki, dan ilmu-Nya meliputi semuanya Tidak ada sesuatupun dari semua takdirnya yang luput dari catatan Kami dalam Al lauhul Mahfudh, kemudian kepada Tuhanlah mereka dikumpulkan pada hari kiamat, sebagaimana Bani Adam dikumpulkan, kemudian mereka akan saling bersaksi satu sama lain, dan mereka akan menjadi debu atas kehendak Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada seekor hewan pun di bumi dan tidak pula burung-burung yang terbang dengan kedua sayapnya, melainkan merupakan umat seperti kalian} jenis-jenis (lain) seperti kalian {Kami tidak lalai pada sesuatu pun di dalam kitab} Kami tidak mengabaikan sesuatu apapun di dalam Lauhil Mahfudz kecuali Kami telah mencatatnya {kemudian kepada Tuhannya mereka dikumpulkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Seluruh hewan darat dan udara, binatang-binatang ternak, binatang liar dan burung-burung, semuanya adalah umat-umat sepertimu. Kami menciptakannya seperti Kami menciptakanmu. Kami memberi rizki kepadanya seperti Kami memberi rizki kepadamu. Kehendak dan kekuasaan Kami berlaku bagi mereka seperti ia berlaku padamu. “Dan tiadalah Kami alpakan sesuatu pun di dalam al-Kitab,” maksudnya, Kami tidak melalaikan dan melupakan sedikit pun dari sesuatu yang ada di Lauh al-Mahfuzh, bahkan segala sesuatu yang besar dan yang kecil tercantum di Lauh al-Mahfuzh seperti apa adanya, seluruh peristiwa terjadi sesuai dengan apa yang tertulis oleh pena. Ayat ini mengandung dalil bahwa kitab yang pertama meliputi segala yang ada. Ini adalah salah satu tingkatan Qadha’ dan Qadar. Ia adalah empat tingkatan: ilmu Allah yang meliputi segala sesuatu, kitabNya yang mencakup seluruh yang ada, kehendak dan kodratNYa yang berlaku menyeluruh atas segala sesuatu, dan penciptaanNya terhadap seluruh makhluk sampai perbuatan manusia. Ada kemungkinan bahwa yang dimaksud dengan “al-Kitab” di sini adalah al-Quran, dan maknanya adalah seperti makna FirmanNya, \"Dan Kami turunkan kepadamu Al Kitab (Al Quran) untuk menjelaskan segala sesuatu dan petunjuk serta rahmat dan kabar gembira bagi orang-orang yang berserah diri.\" (An-Nahl:89). Dan firman-Nya “Kemudian kepada Tuhanlah mereka dihimpunkan.” Maksudnya, seluruh umat dihimpun dan dikumpulkan kepada Allah pada pengadilan Kiamat, yaitu saat yang besar dan menakutkan. Lalu Dia membalas mereka dengan keadilan dan kebaikanNya, dan Dia memperlakukan hukumNya atas mereka yang dipuji oleh orang-orang terdahulu dan yang datang belakangan, dari penduduk langit dan bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 38: Yakni sama Allah yang menciptakannya sebagaimana Dia menciptakan kamu, Allah yang memberinya rezki sebagaimana Dia memberi kamu rezki, dan berlaku pada mereka kehendak dan kekuasaan-Nya sebagaimana berlaku pula pada kamu. Sebagian mufassir menafsirkan Al-Kitab tersebut dengan Lauhul Mahfuzh sehingga maksudnya bahwa nasib semua makhluk itu sudah dituliskan (ditetapkan) dalam Lauhul Mahfuzh, oleh karenanya apa yang terjadi sejalan dengan apa yang tertulis di sana. Hal ini merupakan salah satu di antara tingkatan qadha' dan qadar, yakni mengimani bahwa apa yang akan terjadi telah diketahui Allah, telah ditulis-Nya dalam Al Lauhul Mahfuzh, telah dikehendak, dan telah diciptakan, termasuk amal mereka. Ada pula yang menafsirkan kitab di sana dengan Al-Quran sehingga maksudnya bahwa dalam Al-Quran itu telah ada pokok-pokok agama, norma-norma, hukum-hukum, hikmah-hikmah dan petunjuk untuk kebahagiaan manusia di dunia dan akhirat, dan kebahagiaan makhluk pada umumnya. Kemudian Allah memutuskan masalahnya dan diadakan pengqishasan, setelah itu Allah menjadikan binatang-binatang itu menjadi tanah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 38",
    "description": "Allah mahakuasa untuk sekadar mengabulkan permintaan orangorang musyrik seperti dalam ayat sebelumnya. Dan di antara contoh kekuasaan Allah adalah tidak ada seekor binatang yang merayap atau bergerak dengan kakinya dari satu tempat ke tempat lainnya yang ada di bumi, baik di darat maupun di laut, dan juga burung-burung yang terbang dengan kedua sayapnya, melainkan semuanya merupakan umat-umat juga seperti kamu, hai manusia. Tidak ada sesuatu pun yang kami luputkan atau abaikan di dalam kitab, yaitu Al-Qur'an atau lauh mahfudh, kemudian kepada tuhan mereka yakni seluruh manusia akan dikumpulkan untuk dimintai pertanggungjawaban. Setelah bukti kekuasaan Allah sedemikian jelas seperti dijelaskan pada ayat sebelumnya, orang-orang yang beriman pasti dapat mengambil pelajaran, namun tidak demikian dengan orang-orang yang tidak beriman. Dan orang-orang yang mendustakan ayat-ayat kami yang sudah sedemikian jelas lagi mulia adalah orang yang tuli, tidak bisa mendengar, dan juga bisu, tidak dapat berbicara, dan berada dalam gelap gulita tanpa cahaya penuntun hidup. Barang siapa dikehendaki Allah dalam kesesatan, niscaya disesatkan-Nya dengan membiarkannya tetap berada di jalan yang sesat. Dan barang siapa dikehendaki Allah untuk diberi petunjuk karena berusaha maksimal untuk meraihnya, niscaya dia menjadikannya berada di atas jalan yang lurus. Begitulah janji Allah."
  }
]