[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mendustakan hujjah-hujjah Allah adalah orang-orang yang tuli, yang tidak dapat mendengarkan yang bermanfaat bagi mereka, orang-orang bisu yang tidak bicara atas dasar kebenaran. Mereka dilanda kebingungan dalam kegelapan yang bertumpuk-tumpuk. Tidak mau memilih jalan istiqamah (yanglurus). Barangsiapa yang dikehendaki Allah kesesatannya, maka dia akan tersesat, Dan barangsiapa yang dikehendaki Allah (untuk diberi petunjuknya), niscaya Dia menjadikannya berada di atas jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Orang-orang yang mendustakan ayat-ayat Kami laksana orang-orang tuli yang tidak bisa mendengar dan orang-orang bisu yang tidak bisa berbicara. Di samping itu mereka juga berada di dalam kegelapan yang membuat mereka tidak bisa melihat apa-apa. Jadi mana mungkin orang-orang seperti itu bisa menemukan jalan yang benar? Siapa saja yang Allah kehendaki dari kalangan manusia untuk disesatkan, Dia pasti akan menyesatkannya. Dan siapa saja yang Dia kehendaki untuk diberi petunjuk, Dia pasti memberinya petunjuk dengan menempatkannya di jalan lurus yang tidak berkelok-kelok."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Allah memerintahkan nabi-Nya untuk menegaskan perkataannya kepada orang-orang musyrik yang menyekutukan Allah dengan menggunakan huruf Kaf dalam firman-Nya (أرأيتكم). Mereka menyekutukan Allah karena menutup telinga mereka dari mendengar petunjuk, kebenaran, dan cahaya keimanan. Seandainya mereka menggunakan dengan baik panca indra yang telah Allah berikan kepada mereka, niscaya mereka akan menerima petunjuk; namun mereka lebih memilih kesesatan. Mereka tidak keluar dari kehendak Allah, yaitu kehendak yang sesuai dengan sunatullah pada manusia bahwa mereka bebas memilih petunjuk atau kesesatan, tanpa ada paksaan dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَالَّذِينَ كَذَّبُوا۟ بِـَٔايٰتِنَا صُمٌّ (Dan orang-orang yang mendustakan ayat-ayat Kami adalah pekak) Yakni yang tidak mendengar dengan pendengaran mereka. وَبُكْمٌ (bisu) Yakni yang tidak berbicara degan lisan-lisan mereka. فِى الظُّلُمٰتِ ۗ (berada dalam gelap gulita) Yakni dalam kegelapan kekafiran, kejahilan, dan kebingungan. Yakni mereka bagaikan orang buta dan bisu dalam gelap gulita, tidak dapat melihat jalan dan tidak memanggil orang untuk menuntunnya kejalan yang benar, dan tidak pula dilihat oleh orang lain untuk menuntunnya; maka bagaimana ia akan sampai pada tujuannya dan dapat menempuh jalan keselamatan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39 Orang-orang yang mendustakan ayat-ayat Kami yaitu Alquran adalah tuli untuk mendengarkan apa yang bermanfaat untuk mereka dengan pendengaran menelaah dan tadabbur dan bisu untuk mengatakan kebenaran. Mereka berada dalam kegelapan kekufuran dan kebodohan. Mereka tidak mendapat petunjuk kebenaran dan kemanfaatan untuk mereka sedikitpun. Barangsiapa yang dikehendaki Allah menjadi sesat, niscaya dia disesatkan-Nya, dan barangsiapa yang dikehendaki Allah untuk mendapat petunjuk, niscaya Dia menjadikan-Nya berada di atas jalan yang lurus yaitu agama Islam. Penyesatan dan petunjuk sesuai dengan ketetapan azali Allah atas makhluk-Nya. Barangsiapa yang disesatkan maka dia akan dijadikan menolak seruan-Nya, begitu juga barangsiapa yang duberi petunjuk maka dia akan dijadikan melihat dan menelaah dengan fikirannya, bukan dengan meniru tanpa ilmu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mendustakan ayat-ayat Kami itu tuli dan bisu dalam kegelapan. Siapa saja yang dikehendaki Allah, niscaya disesatkanNya. Siapa saja yang dikehendaki Allah, niscaya Dia menjadikannya berada di jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Ini adalah penjelasan tentang keadaan orang-orang yang mendustakan ayat-ayat Allah dan mendustakan Rasul-RasulNya bahwa mereka telah menutup pintu hidayah dari diri mereka dan membuka pintu kesesatan, bahwa mereka “pekak” dari mendengar kebenaran, “dan bisu,” tidak mampu berbicara dengannya, mereka hanya bisa berbicara dengan kebatilan. “Dan berada dalam gelap gulita.” Maksudnya, mereka tenggelam dalam kegelapan kebodohan, kekufuran, kezhaliman, pengingkaran, dan kemaksiatan. Ini termasuk penyesatan Allah kepada mereka. “Barangsiapa yang dikehendaki Allah (kesesatannya), niscaya Dia menyesatkanNya. Dan barangsiapa yang dikehendaki Allah (untuk diberiNya petunjuk), niscaya Dia menjadikannya berada di atas jalan yang lurus.” Karena Dia-lah yang memonopoli hidayah dan penyesatan sesuai dengan tuntutan karunia dan hikmahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 39: Ayat ini menerangkan keadaan orang-orang yang mendustakan ayat-ayat Allah lagi mendustakan rasul-Nya, bahwa mereka telah menutup pintu hidayah terhadap diri mereka dan membuka pintu kebinasaan. Telinga mereka tuli dari mendengarkan kebenaran dan mulut mereka bisu dari menyebutkannya sehingga yang mereka sebut adalah kebatilan. Yakni tenggelam dalam gelapnya kebodohan, kekufuran, kezaliman, sikap membangkang, dan berbuat maksiat. Hal ini termasuk penyesatan Allah untuk mereka. Disesatkan Allah berarti bahwa orang itu sesat karena keingkarannya dan tidak mau memahami petunjuk-petunjuk Allah. Yaitu Islam. Allah yang sendiri memberi hidayah dan menyesatkan sesuai karunia dan hikmah (kebijaksanaan)-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 39",
    "description": "Setelah bukti kekuasaan Allah sedemikian jelas seperti dijelaskan pada ayat sebelumnya, orang-orang yang beriman pasti dapat mengambil pelajaran, namun tidak demikian dengan orang-orang yang tidak beriman. Dan orang-orang yang mendustakan ayat-ayat kami yang sudah sedemikian jelas lagi mulia adalah orang yang tuli, tidak bisa mendengar, dan juga bisu, tidak dapat berbicara, dan berada dalam gelap gulita tanpa cahaya penuntun hidup. Barang siapa dikehendaki Allah dalam kesesatan, niscaya disesatkan-Nya dengan membiarkannya tetap berada di jalan yang sesat. Dan barang siapa dikehendaki Allah untuk diberi petunjuk karena berusaha maksimal untuk meraihnya, niscaya dia menjadikannya berada di atas jalan yang lurus. Begitulah janji Allah. Pada ayat 37 diinformasikan bahwa para pendurhaka mempertanyakan kemampuan Allah menurunkan bukti kebenaran risalah nabi Muhammad, maka ayat ini memerintahkan nabi Muhammad untuk menantang mereka. Katakanlah, wahai nabi, kepada mereka yang masih saja enggan untuk beriman, terangkanlah kepadaku jika siksaan Allah sampai kepadamu pada saat hidup di dunia ini, atau hari kiamat sampai kepadamu dengan segala situasi dan keadaannya yang amat berat, apakah kamu akan menyeru tuhan selain Allah, jika kamu orang yang benar dengan ucapanmu bahwa Allah memiliki sekutu, maka serulah tuhan-tuhan kamu itu!"
  }
]