[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir tersebut yang menyekutukan Allah bersama sesuatu yang lain, telah datang kepada mereka hujjah-hujjah yang terang dan bukti-bukti yang jelas tentang keesaan Allah dan kebenaran Muhammad dalam kenabiaannya serta risalah yang dibawanya, akan tetapi, begitu engkau mendatangi mereka, dengan serta merta mereka berpaling;tidak mau menerimanya dan tidak mengimaninya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Setiap hujah yang datang kepada orang-orang musyrik dari Rabb pasti mereka abaikan dan tidak mereka hiraukan. Telah datang kepada mereka hujah-hujah yang nyata dan bukti-bukti yang terang benderang yang menunjukkan keesaan Allah, dan juga telah datang kepada mereka mukjizat-mukjizat yang menunjukkan kebenaran para rasul-Nya, tetapi mereka berpaling darinya dan tidak menghiraukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Telah datang hujjah-hujjah dan bukti-bukti tentang keesaan dan kekuasaan Allah, dan telah jelas bagi mereka kenabian Rasulullah Muhammad, namun orang-orang kafir tersebut berpaling dan tidak menerimanya serta menyekutukan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَمَا تَأْتِيهِم مِّنْ ءَايَةٍ مِّنْ ءَايٰتِ رَبِّهِمْ (Dan tidak ada suatu ayatpun dari ayat-ayat Tuhan sampai kepada mereka) Seperti mu’jizat-mu’jizat para Rasul dan segala sesuatu yang datang dari kebesaran kekuasaan Allah, yang tidak dapat diragukan oleh orang yang berakal bahwa itu merupakan perbuatan Allah dan ayat-ayat-Nya yang wajib untuk dijadikan petunjuk akan ke-Esaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dan mukjizat para nabi yang menunjukkan kepada kuasa dan keesaan Allah yang dibawa kepada orang-orang musyrik itu tidak lain kecuali mereka menolaknya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidaklah datang kepada mereka satu ayat pun} dalil {dari ayat-ayat Tuhan mereka, kecuali mereka berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Ini adalah pemberitahuan dari Allah tentang berpalingnya orang-orang musyrik, kerasnya pendustaan dan permusuhan mereka, ayat-ayat tersebut tidak berguna bagi mereka sampai azab turun menimpa mereka. Dia berfirman, “Dan taka da suatu ayat pun dari ayat-ayat Tuhan yang sampai kepada mereka.” Ayat yang menunjukkan kebenaran secara pasti yang mengajak mereka kepada penerimaan dan ketaatan, “melainkan mereka salalu berpaling dari padanya (mendustakannya).” Mereka tidak memperhatikan dan tidak mendengarnya. Hati mereka sibuk dengan yang lain dan mereka membelakanginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 4: Ayat ini merupakan khabar (berita) dari Allah Ta'ala tentang pengingkaran orang-orang musyrik, kuatnya penolakan dan permusuhan mereka, di mana semua ayat tidak bermanfaat bagi mereka sampai datang kepada mereka hukuman yang semisal dengan generasi sebelum mereka. \"Ayat\" di sini dapat berarti mukjizat, ayat Al-Quran, atau peristiwa-peristiwa yang terjadi di alam yang menunjukkan kebenaran firman-firman Allah yang menghendaki mereka untuk mengikuti dan menerima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 4",
    "description": "Allah menjelaskan bahwa manusia yang kafir selalu menolak tandatanda kekuasaan-Nya. Mereka tidak menyadari bahwa Allah mengetahui apa yang mereka rahasiakan. Dan setiap ayat dari ayat-ayat tuhan yang menjelaskan bahwa Allah tuhan yang maha esa, bahwa nabi Muhammad adalah utusan Allah, bahwa Al-Qur'an yang diterimanya adalah wahyu Allah, yang sampai kepada mereka, orang-orang kafir, semuanya selalu diingkarinya dengan kesombongan, tanpa argumentasi yang masuk akal. Selain menolak tanda-tanda kekuasaan Allah, orang-orang kafir selalu juga menutup diri, menolak, dan mendustakan kebenaran alqur'an. Sungguh, mereka, orang-orang kafir dan munafik, telah mendustakan kebenaran Al-Qur'an yang menjelaskan tentang kerasulan nabi Muhammad, kehidupan setelah mati, surga, dan neraka, ketika ayatayat Al-Qur'an yang diturunkan kepada nabi Muhammad itu sampai kepada mereka. Maka kelak di akhirat, akan sampai kepada mereka, orangorang kafir yang mendustakan kehidupan di akhirat itu, berita-berita yang benar-benar nyata yang selama ini selalu mereka perolok-olokkan di dunia."
  }
]