[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah wahai rasul, kepada orang-orang musyrik , ”beritahukanlah kepadaku, jika telah datang kepada kalian siksaan Allah didunia atau telah datang kepada kalian Hari Kiamat yang kalian akan dibangkitkan padanya, apakah kepada selain Allah kalian akan merdo’a supaya bisa menyingkirkan bala yang menimpa kalian, bila kalian orang-orang yang benar dalam klaim kalian bahwa sesembahan kalian yang kalian sembah selain Allah dapat memberikan manfaat dan mendatangkan mudarat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Katakanlah -wahai Rasul- kepada orang-orang musyrik, “Katakan padaku, jikalau azab Allah atau hari Kiamat yang telah dijanjikan kepada kalian benar-benar datang kepada kalian, apakah ketika itu kalian akan memanjatkan doa kepada selain Allah untuk menyingkirkan bencana dan kesulitan yang menimpa kalian itu, apabila kalian sungguh-sungguh dengan pengakuan kalian bahwa tuhan-tuhan yang kalian sembah itu dapat mendatangkan manfaat dan menolak mudarat?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Hai Muhammad, katakanlah kepada orang-orang musyrik sebagai olokan bagi mereka: \"Katakan kepadaku jika kalian tertimpa azab dari Allah sebagai balasan bagi kalian, atau hari kiamat datang kepada kalian secara tiba-tiba, Siapakah Tuhan selain Allah yang akan kalian sembah jika kalian termasuk orang-orang yang benar?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. أَرَءَيْتَكُمْ (Terangkanlah kepadaku) Yakni jelaskan kepadaku. أَغَيْرَ اللهِ تَدْعُونَ (apakah kamu menyeru (tuhan) selain Allah) Apakah kalian akan menyeru sesembahan kalian selain Allah dalam keadaan itu, yaitu keadaan datangnya azab atau datangnya hari kiamat? Atau kalian akan menyeru Allah? إِن كُنتُمْ صٰدِقِينَ(jika kamu orang-orang yang benar!) Yakni benar dalam pengakuan kalian bahwa patung-patung kalian dapat memberi madharat dan memberi manfaat dan mereka adalah tuhan-tuhan seperti yang kalian klaim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40 Katakanlah wahai Rasul kepada penduduk Makkah: “Terangkanlah keadaa kalian kepadaku jika nanti siksaan Allah menimpa kalian di dunia, atau ketika hari kiamat datang kepada kalian dengan berbagai hiruk pikuknya. Apakah kalian akan menyeru tuhan selain Allah untuk menyelamatkan kalian dari azab kalian; atau kalian akan menyeru Allah, jika kalian memang orang-orang yang benar dalam bahwa berhala-berhala kalian itu dapat menolong dan memberi azab kepada kalian, atau bahwa mereka dapat mendekatkan kalian kepada Allah!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Terangkanlah kepadaku} Beritahulah aku {jika siksaan Allah sampai kepada kalian atau hari kiamat sampai kepada kalian} hari kiamat {apakah kalian akan menyeru kepada selain Allah, jika kalian adalah orang-oranga yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah berfirman kepada RasulNya, “Katakanlah” kepada orang-orang musyrik yang menyimpang dariNya kepada yang lain, “Terangkanlah kepadaku jika datang siksaan Allah kepadamu, atau datang kepadamu Hari KIamat, apakah kamu menyeru (tuhan) selain Allah, jika kamu orang-orang yang benar?” maksudnya, jika kesulitan-kesulitan dan kesengsaraan-kesengsaraan itu yang harus diangkat, apakah kamu memanggil tuhan-tuhanmu dan berhala-berhalamu ataukah kamu berdoa kepada Maharaja Yang Mahabenar yang sangat jelas?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 40: Ataukah kamu akan menyeru Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 40",
    "description": "Pada ayat 37 diinformasikan bahwa para pendurhaka mempertanyakan kemampuan Allah menurunkan bukti kebenaran risalah nabi Muhammad, maka ayat ini memerintahkan nabi Muhammad untuk menantang mereka. Katakanlah, wahai nabi, kepada mereka yang masih saja enggan untuk beriman, terangkanlah kepadaku jika siksaan Allah sampai kepadamu pada saat hidup di dunia ini, atau hari kiamat sampai kepadamu dengan segala situasi dan keadaannya yang amat berat, apakah kamu akan menyeru tuhan selain Allah, jika kamu orang yang benar dengan ucapanmu bahwa Allah memiliki sekutu, maka serulah tuhan-tuhan kamu itu! tidak mungkin kamu menyeru tuhan-tuhan itu, tetapi hanya kepada-Nya kamu menyeru untuk meminta pertolongan. Maka jika dia menghendaki, dia akan dengan mudah menghilangkan apa, yakni bahaya, yang kamu mohonkan kepada-Nya, dan pada hari kiamat pasti akan kamu tinggalkan apa yang kamu persekutukan dengan Allah saat di dunia, karena saat itu tidak ada satu pun makhluk yang dapat mengingkari kuasa Allah (lihat: surah al-fa'tihah/1: 4)."
  }
]