[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan nanti kalian akan memohon (disana) kepada tuhan kalian (Allah) yang telah menciptakan kalian, bukan kepada yang lain, dan kalian akan meminta pertolongan kepadaNya, lalu Dia mengangkat bala besar yang tengah menimpa kalian, jika Dia menghendaki. Sebab sesungguhnya Dia Maha kuasa atas segala sesuatu. Dan pada hari itu kalian akan meninggalkan berhala-berhala, patung-patung, dan pembela-pembela kalian. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Yang pasti ketika itu kalian tidak akan memanjatkan doa kecuali kepada Allah yang telah menciptakan kalian agar Dia menghindarkan kalian dari bencana dan melenyapkan kesulitan kalian. Karena hanya Dia lah yang mampu melakukan hal itu. Sedangkan tuhan-tuhan lain yang kalian sembah bersama Allah pasti akan kalian tinggalkan, karena kalian tahu bahwa mereka tidak dapat mendatangkan manfaat maupun menolak mudarat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Sungguh kalian tidak akan menyembah tuhan-tuhan dan berhala-berhala kalian, karena fitrah kalian akan menghadap kepada pencipta-Nya. Kalian akan menyembah-Nya dengan penuh ketundukan, karena itu merupakan fitrah manusia meskipun lisan kalian tidak mengatakan itu. Pada keadaan seperti itu fitrah manusia akan menghadap kepada Tuhannya dan lupa bahwa dia telah menyekutukan-Nya. Pada saat itulah akan tersingkap kebenaran yang sesungguhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. بَلْ إِيَّاهُ تَدْعُونَ (tetapi hanya Dialah yang kamu seru) Dan tidak menyeru yang lain, bahkan kalian akan mengikhlaskan seruan itu kepada-Nya dalam keadaan-keadaan genting ini. فَيَكْشِفُ مَا تَدْعُونَ إِلَيْهِ(maka Dia menghilangkan bahaya yang karenanya kamu berdoa kepada-Nya) Yakni agar Allah menjawab seruan kalian dengan mengangkat azab jika Dia menghendaki. وَتَنسَوْنَ مَا تُشْرِكُونَ (dan kamu tinggalkan sembahan-sembahan yang kamu sekutukan) Baik itu patung-patung dan lainnya. Mereka tidak berdoa diwaktu-waktu susah kecuali kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41 Tidak, tetapi hanya Dialah yang kamu seru ketika keadaan mendesak, bukan selain Dia. Maka Dia menghilangkan bahaya sesuai doa kamu kepada-Nya, jika Dia menghendaki, dan kamu tinggalkan sembahan-sembahan yang kamu sekutukan dengan Allah sebelum azab itu turun kepada kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak. Hanya kepadaNya kalian akan menyeru. Maka jika Dia menghendaki, Dia akan menghilangkan apa yang kalian mohonkan kepadaNya, dan kalian melupakan} meninggalkan {apa yang kalian persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Tetapi hanya Dia-lah yang kamu seru, maka Dia menghilangkan bahaya yang karenanya kamu berdoa kepadaNYa jika Dia menghendaki, dan kamu tinggalkan sembahan-sembahan yang kamu sekutukan (dengan Allah).” Maksudnya, jika demikian keadaanmu dengan sesembahan-sesembahanmu yang mana pada waktu sulit kamu melupakannya Karena kamu mengetahui bahwa sesembahan itu tidak memiliki manfaat dan mudarat, dan tidak memiliki hak mematikan, menghidupkan, dan membangkitkanmu. Justru kamu malah mengikhlaskan doa kepada Allah, karena kamu mengetahui bahwa Dia-lah yang mendatangkan mudarat dan manfaat, yang menjawab doa orang yang dalam kesulitan. Mengapa dalam keadaan suka kamu menyekutukanNya dengan sesuatu dan membuat tandingan-tandingan untukNya? Adakah dalil aqli dan naqli yang menunjukanmu kepada itu? Adakah kamu mempunyai ilmu tentang itu? Ataukah kamu berdusta atas Nama Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 41: Yakni dalam situasi sulit. Jika demikian keadaan kamu kepada sesembahan kamu, yakni kamu lupakan mereka ketika situasi sulit karena kamu mengetahui bahwa mereka tidak mampu menolong kamu, dan kamu alihkan doa kamu kepada Allah karena kamu mengetahui bahwa hanya Dia yang mampu menolong kamu, lalu mengapa kamu menyekutukan Allah dalam situasi tenang dan mengadakan sekutu bagi-Nya dengan menyembah patung, padahal kamu mengetahui keadaannya yang lemah? Dengan tidak berdoa kepada patung dan apa yang mereka persekutukan lainnya dengan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 41",
    "description": "Tidak mungkin kamu menyeru tuhan-tuhan itu, tetapi hanya kepada-Nya kamu menyeru untuk meminta pertolongan. Maka jika dia menghendaki, dia akan dengan mudah menghilangkan apa, yakni bahaya, yang kamu mohonkan kepada-Nya, dan pada hari kiamat pasti akan kamu tinggalkan apa yang kamu persekutukan dengan Allah saat di dunia, karena saat itu tidak ada satu pun makhluk yang dapat mengingkari kuasa Allah (lihat: surah al-fa'tihah/1: 4). Ayat ini mengabarkan bahwa ketentuan tersebut berlaku juga atas umat sebelumnya. Dan sungguh, kami telah mengutus para rasul kepada umat-umat sebelum engkau, wahai nabi Muhammad, tetapi mereka durhaka, maka kemudian kami siksa mereka dengan menimpakan kemelaratan dan kesengsaraan, agar mereka memohon kepada Allah sambil mengakui kesalahan dan dengan sikap kerendahan hati, semoga kiranya Allah menerima tobat mereka sehingga dapat terhindar dari siksa Allah."
  }
]