[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kami (wahai Rasul) telah mengutus rasul-rasul kepada golongan-golongan manusia sebelum engkau, rosul-rosul yang mengajak mereka kepada Allah . Namun umat-umat itu mendustakan para rasul itu, maka kami pun menimpakan cobaan kepada mereka terhadap harta benda mereka dengan kemelaratan yang sangat berat dan kesulitan hidup yang mencekik. kami juga menimpakan cobaan pada mereka terhadap fisik-fisik mereka dengan berbagai macam wabah dan rasa sakit, dengan harapan agar mereka mau menghinakan diri kepada Tuhan mereka dan tunduk patuh kepadaNya saja dalam beribadah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sesungguhnya Kami telah mengutus banyak rasul kepada umat-umat sebelum kamu -wahai Rasul- kemudian mereka mendustakan para rasul tersebut dan berpaling dari ajaran yang dibawanya. Maka Kami hukum mereka dengan kesusahan seperti kemiskinan dan musibah pada tubuh mereka seperti penyakit supaya mereka mau tunduk dan patuh kepada Rabb mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Allah meringankan beban Nabi Muhammad akibat berpalingnya orang-orang musyrik dari petunjuknya dan kebebalan mereka untuk tetap di dalam kekafiran, dengan berfirman bahwa Dia telah mengutus para rasul sebelumnya kepada umat-umat terdahulu. Para rasul itu menyeru mereka untuk beriman kepada Allah Semata dan meninggalkan peribadatan kepada berhala-berhala. Namun mereka berpaling dan mengingkari-Nya, maka Allah menyiksa mereka dengan kesusahan dan azab; sebagian mereka Allah siksa dengan kesempitan hidup dan kemiskinan, sebagian lain dengan berbagai penyakit, dan sebagian lain dengan azab yang pedih. Hal ini agar mereka tunduk dan kembali kepada keimanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42 فَأَخَذْنٰهُم بِالْبَأْسَآءِ (kemudian Kami siksa mereka dengan (menimpakan) kesengsaraan) Makna (البأس) yakni kemiskinan dan musibah-musibah yang menimpa harta benda. وَالضَّرَّآءِ(dan kemelaratan) Yakni penyakit dan musibah-musibah yang menimpa badan. لَعَلَّهُمْ يَتَضَرَّعُونَ(supaya mereka memohon (kepada Allah) dengan tunduk merendahkan diri) Yakni berdoa kepada Allah dengan penuh ketundukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika Allah menguji hamba-Nya dengan satu macam saja dari musibah, lalu kemudian mereka mengembalikan ibtila' itu kepada Allah, sungguh itu adalah tanda-tanda kebahagiaan baginya : { فَأَخَذْنَاهُمْ بِالْبَأْسَاءِ وَالضَّرَّاءِ لَعَلَّهُمْ يَتَضَرَّعُونَ } \"kemudian Kami siksa mereka dengan (menimpakan) kesengsaraan dan kemelaratan, supaya mereka memohon (kepada Allah) dengan tunduk merendahkan diri\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42 Sesungguhnya Kami telah mengutus para rasul kepada umat-umat sebelum kamu wahai Nabi, namun mereka mendustakan para rasul yang Kami utus, kemudian Kami siksa mereka dengan menimpakan kesengsaraan, kemelaratan, dan berbagai penyakit tubuh, supaya mereka memohon kepada Allah dengan tunduk merendahkan diri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah mengutus (rasul-rasul) kepada umat-umat sebelummu, kemudian Kami menyiksa mereka dengan kemelaratan} kesulitan dan kemiskinan {dan kesengsaraan} penyakit {agar mereka tunduk} merendahkan diri dan tunduk kepada Tuhan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Allah berfirman, “Dan sungguh kami telah mengutus (rasul-rasul) kepada umat-umat yang sebelum kamu,” dari umat-umat terdahulu dana bad-abad yang lampau, lalu mereka mendustakan rasul-rasul Kami dan mengingkari ayat-ayat Kami. “Kemudian Kami siksa mereka dengan (menimpakan) kesengsaraan dan kemelaratan.” Yakni kemiskinan, penyakit, dan musibah-musibah sebagai rahmat dari Kami untuk mereka. “Supaya mereka memohon dengan tunduk merendahkan diri” kepada Kami, dan kembali kepada Kami pada saat sulit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 42: Kemudian mereka mendustakannya. Seperti kemiskinan, sakit, penderitaan, dan musibah karena rahmat Allah kepada mereka. Dan mereka mau beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 42",
    "description": "Ayat ini mengabarkan bahwa ketentuan tersebut berlaku juga atas umat sebelumnya. Dan sungguh, kami telah mengutus para rasul kepada umat-umat sebelum engkau, wahai nabi Muhammad, tetapi mereka durhaka, maka kemudian kami siksa mereka dengan menimpakan kemelaratan dan kesengsaraan, agar mereka memohon kepada Allah sambil mengakui kesalahan dan dengan sikap kerendahan hati, semoga kiranya Allah menerima tobat mereka sehingga dapat terhindar dari siksa Allah. Setelah ditawarkan kesempatan untuk terhindar dari siksa dengan syarat mereka harus bertobat, para pendurhaka itu enggan melakukannya, maka muncul keheranan yaitu mengapa mereka tidak memohon kepada Allah dengan kerendahan hati ketika siksaan kami (Allah) datang menimpa mereka' jawabannya adalah memang mereka tidak bermohon, karena kedurhakaan mereka sudah sedemikian parah. Bahkan hati mereka telah menjadi keras sehingga sulit untuk menerima petunjuk dan setan pun merayu dan mengelabui mereka dengan menjadikan terasa indah bagi mereka apa, yakni dosa-dosa dan kedurhakaan, yang selalu mereka kerjakan."
  }
]