[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Ketika mereka meninggalkan pelaksanakan perintah-perintah Allah dengan berpaling darinya, Kami bukakan pintu-pintu segala rizki bagi mereka dan kami gantikan kesengsaraan mereka dengan kesenangan hidup, penderitaan penyakit (mereka) dengan kesehatan fisik sebagai bentuk istidraj (penguluran siksa) dari kami bagi mereka. Sehingga apabila mereka telah bertindak sewenang-wenang dan terlena dengan apa yang kami berikan kepada mereka berupa kebaikan dan kenikmatan, kami timpakan hukuman pada mereka dengan siksaan secara tiba-tiba. Maka ketika itu mereka hilang harapan dan berputus asa dari segala kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Setelah mereka mengabaikan peringatan yang diberikan kepada mereka -berupa kemiskinan yang parah dan penyakit berat- dan tidak mau melaksanakan perintah-perintah Allah, maka Kami beri mereka istidraj dengan cara membuka pintu rezeki seluas-luasnya kepada mereka, memberi mereka kekayaan yang melimpah, mengembalikan kesehatan mereka setelah mengidap penyakit berat. Sampai ketika mereka dihinggapi kesombongan dan keangkuhan atas kenikmatan hidup yang mereka rasakan, tiba-tiba azab Kami datang kepada mereka secara mendadak. Dan seketika itu juga mereka kebingungan dan putus asa tanpa ada harapan lagi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Setelah mereka tetap berpaling dari petunjuk Allah dan tidak mentaati perintah para rasul mereka, maka Allah memberi mereka istidraj dengan membuka bagi mereka pintu-pintu kesenangan dunia berupa rezeki yang luas dan kesehatan. Allah telah menguji mereka dengan kesejahteraan dan dengan kesusahan. Hingga ketika mereka telah bergembira atas gelimang kenikmatan yang mendatangi mereka dari setiap tempat, namun mereka tidak bersyukur kepada Allah dan terus melakukan kemaksiatan dan dosa-dosa sehingga tabiat mereka menjadi rusak dan kerusakan telah memenuhi seluruh kehidupan mereka; maka ketika itu ketetapan Allah datang dengan tiba-tiba tanpa ada peringatan sebelumnya, sehingga mereka tidak memiliki harapan untuk selamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. فَلَمَّا نَسُوا۟ مَا ذُكِّرُوا۟ بِهِۦ (Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka) Yakni meninggalkan kesadaran setelah peringatan dengan kemiskinan dan kemelaratan dan mereka malah berpaling dari peringatan tersebut. فَتَحْنَا عَلَيْهِمْ أَبْوٰبَ كُلِّ شَىْءٍ (Kamipun membukakan semua pintu-pintu kesenangan untuk mereka) Kami memberi mereka istidraj dengan membuka pintu-pintu kenikmatan bagi mereka. حَتَّىٰٓ إِذَا فَرِحُوا۟ بِمَآ أُوتُوٓا۟ (sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka) Berupa kenikmatan-kenikmatan dengan berbagai jenisnya, lalu mereka merasa senang dan penuh keangkuhan dan kesombongan serta merasa bahwa mereka diberi kenikmatan karena kekafiran mereka merupakan jalan yang benar. أَخَذْنٰهُم بَغْتَةً (Kami siksa mereka dengan sekonyong-konyong) Yakni dengan tiba-tiba, dan mereka tidak menyangka kedatangannya. فَإِذَا هُم مُّبْلِسُونَ(maka ketika itu mereka terdiam berputus asa) Yakni sedih dan putus asa dari hal yang baik karena buruknya keadaan yang menimpa mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "44-45 1 ). Rasulullah bersabda : (( إِذَا رَأَيْتَ اللهَ يُعْطِي الْعَبْدَ مِنَ الدُّنْيَا عَلَى مَعَاصِيهِ مَا يُحِبُّ، فَإِنَّمَا هُوَ اسْتِدْرَاجٌ ” ثُمَّ تَلَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : { فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ , فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا ۚ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } )) \"Apabila engkau melihat Allah memberikan kepada seorang hamba berupa nikmat dunia yang disukainya padahal dia suka bermaksiat, maka itu hanyalah istidraj belaka, lalu Rasulullah membaca: Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, Maka ketika itu mereka terdiam berputus asa , Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya. Segala puji bagi Allah, Tuhan semesta alam\". Abu Qathadah berkata : \"Mereka telah melampaui batas-batas yang telah Allah tetapkan, dan Allah tidaklah Ia membinasakan suatu kaum kecuali dikarenakan kezhaliman, kemaksiatan, dan kekufuran mereka atas nikmat Allah\" 2 ). Jika engkau melihat kenikmatan terus datang sedangkan kamu tetap dalam kemaksiatan, maka ketahuilah sesungguhnya itu adalah istidraj maka hendaklah kalian berhati-hati, Allah berfirman : { وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ } \"Dan orang-orang yang mendustakan ayat-ayat Kami, nanti Kami akan menarik mereka dengan berangaur-angsur (ke arah kebinasaan), dengan cara yang tidak mereka ketahui\" [ Al-A'raf : 182 ] Dan Allah juga berfirman : { فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ } \"Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44 Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, dan juga meninggalkan apa yang telah diperintahkan oleh para rasul mereka, maka Kami pun membukakan semua pintu-pintu kesenangan untuk mereka sebagai istidraj; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa atas apa yang menimpa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka melupakan apa yang diperingatkan kepada mereka} mereka mengabaikan apa yang diperingatkan untuk mereka {Kami pun membukakan untuk mereka pintu-pintu segala sesuatu, sehingga ketika mereka bergembira} angkuh {dengan apa yang telah diberikan, Kami menyiksa mereka secara tiba-tiba} secara tiba-tiba {maka ketika itu mereka putus asa} mereka putus asa dari setiap perbuatan baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Tatkala mereka melupakan peringatan yang telah di berikan kepada kereka ‘ kami pun Membukakan semua pintu-pintu kesenangan untuk mereka ‘’berupa Dunia dengan kesenangan dan kelalaian nya . ‘’ sehingga apabila mereka begembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, Maka ketika itu mereka terdiam berputus asa .’’ Maksudnya, mereka berputus asa dari kebaikan, dan ini adalah azab yang paling berat; Diazab dalam keadaan senang , lalai dan tidak terduga; Hal itu adalah hukum paling keras dan musibah paling besar bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 44: Sebagai istidraj (penangguhan azab). Rasulullah shallallahu 'alaihi wa sallam bersabda: اِذَا رَأَيْتَ اللهَ يُعْطِى الْعَبْدَ مِنَ الدُّنْيَا عَلىَ مَعَاصِيْهِ مَا يُحِبُّ فَإِنَّمَا هُوَ اسْتِدْرَاجٌ ثُمَّ تَلاَ رَسُوْلُ اللهِ صلى الله عليه وسلم \"فَلَمَّا نَسُوا ....الاية. “Apabila kamu melihat Allah memberikan kenikmatan dunia yang disenangi kepada seorang hamba padahal ia berada di atas maksiat, maka sebenarnya hal itu adalah istidraj,” kemudian Rasulullah shallallahu 'alaihi wa sallam membacakan ayat: ”Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kami pun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa. (Terj.Al An’aam: 44). HR. Ahmad dengan isnad yang jayyid, Shahihul Jami' no. 561]"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 44",
    "description": "Maka ketika mereka melupakan peringatan yang telah diberikan kepada mereka, atas respons mereka tersebut kami pun membukakan semua pintu kesenangan duniawi untuk mereka dan mereka pun lalu bersikap sombong, merasa tidak butuh pihak lain, termasuk kepada tuhan. Sehingga ketika mereka bergembira dengan apa yang telah diberikan kepada mereka, kami siksa mereka secara tiba-tiba sehingga tidak ada lagi kesempatan bagi mereka untuk bertobat, maka ketika itu mereka terdiam tidak berkutik karena diliputi penyesalan dan putus asa. Peringatan sudah disampaikan, teguran secara halus maupun keras juga sudah diberikan, bahkan aneka nikmat sudah mereka terima, mereka masih saja durhaka. Maka berlakulah ketentuan Allah, yaitu orangorang yang zalim itu dimusnahkan sampai ke akar-akarnya sehingga tidak tersisa. Dan itu semua bukan karena Allah berbuat aniaya kepada mereka, karena semua yang ditentukan Allah adalah baik, maka segala puji bagi Allah, tuhan seluruh alam."
  }
]