[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kaum tersebut dimusnahkan sampai ke akar-akarnya dan dibinasakan karena mereka ingkar kepada Allah dan mendustakan para RasulNya, sehingga tidak ada seorangpun dari mereka yang tersisa. Rasa syukur dan pujian dipanjatkan bagi Allah , pencipta segala sesuatu dan pemiliknya atas pertolonganNya bagi para waliNya dan kebinasaan para musuhNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Maka orang-orang kafir itu pun diputus generasi penerusnya dengan cara dibinasakan semua populasinya. Sementara para utusan Allah diberikan pertolongan. Ungkapan rasa syukur dan pujian hanya diperuntukkan bagi Allah semata, Rabb alam semesta yang telah membinasakan musuh-musuh-Nya dan menolong para pendukung-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Maka Allah membinasakan mereka semua tanpa terkecuali akibat kezaliman yang mereka perbuat. Segala puji bagi Allah Pencipta seluruh makhluk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا۟ ۚ (Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya) Yakni mereka semua dibinasakan sampai mereka tidak bisa lagi tumbuh dan beranak pinak. وَالْحَمْدُ لِلّٰهِ رَبِّ الْعٰلَمِينَ (Segala puji bagi Allah, Tuhan semesta alam) Yakni segala puji bagi Allah atas kebinasaan mereka. Dalam ayat ini terdapat pengajaran bagi orang-orang beriman agar memuji-Nya ketika datang kenikmatan-kenikmatan Allah, dan yang termasuk kenikmatan paling besar adalah binasanya orang-orang zalim. –ya Allah damaikanlah hamba-hamba-Mu yang beriman dari kezaliman orang-orang zalim, dan musnahkanlah mereka semua, dan gantilah mereka dengan orang-orang yang penuh dengan keadilan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "44-45 1 ). Rasulullah bersabda : (( إِذَا رَأَيْتَ اللهَ يُعْطِي الْعَبْدَ مِنَ الدُّنْيَا عَلَى مَعَاصِيهِ مَا يُحِبُّ، فَإِنَّمَا هُوَ اسْتِدْرَاجٌ ” ثُمَّ تَلَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ : { فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ , فَقُطِعَ دَابِرُ الْقَوْمِ الَّذِينَ ظَلَمُوا ۚ وَالْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } )) \"Apabila engkau melihat Allah memberikan kepada seorang hamba berupa nikmat dunia yang disukainya padahal dia suka bermaksiat, maka itu hanyalah istidraj belaka, lalu Rasulullah membaca: Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, Maka ketika itu mereka terdiam berputus asa , Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya. Segala puji bagi Allah, Tuhan semesta alam\". Abu Qathadah berkata : \"Mereka telah melampaui batas-batas yang telah Allah tetapkan, dan Allah tidaklah Ia membinasakan suatu kaum kecuali dikarenakan kezhaliman, kemaksiatan, dan kekufuran mereka atas nikmat Allah\" 2 ). Jika engkau melihat kenikmatan terus datang sedangkan kamu tetap dalam kemaksiatan, maka ketahuilah sesungguhnya itu adalah istidraj maka hendaklah kalian berhati-hati, Allah berfirman : { وَالَّذِينَ كَذَّبُوا بِآيَاتِنَا سَنَسْتَدْرِجُهُمْ مِنْ حَيْثُ لَا يَعْلَمُونَ } \"Dan orang-orang yang mendustakan ayat-ayat Kami, nanti Kami akan menarik mereka dengan berangaur-angsur (ke arah kebinasaan), dengan cara yang tidak mereka ketahui\" [ Al-A'raf : 182 ] Dan Allah juga berfirman : { فَلَمَّا نَسُوا مَا ذُكِّرُوا بِهِ فَتَحْنَا عَلَيْهِمْ أَبْوَابَ كُلِّ شَيْءٍ حَتَّىٰ إِذَا فَرِحُوا بِمَا أُوتُوا أَخَذْنَاهُمْ بَغْتَةً فَإِذَا هُمْ مُبْلِسُونَ } \"Maka tatkala mereka melupakan peringatan yang telah diberikan kepada mereka, Kamipun membukakan semua pintu-pintu kesenangan untuk mereka; sehingga apabila mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka dengan sekonyong-konyong, maka ketika itu mereka terdiam berputus asa\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45 Maka orang-orang yang zalim itu dimusnahkan sampai ke akar-akarnya tanpa bersisa satu orang pun. Segala puji bagi Allah, atas pembinasaan kalian, sebab dalam pembinasaan itu dapat menghentikan kerusakan yang mereka buat. Ini adalah peringatan untuk para hamba untuk bersyukur kepada Allah atas anugerah pertolongan-Nya untuk orang-orang yang berbuat baik, dan membinasakan orang-orang yang berbuat kerusakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka diputuslah} dicabutlah {akar kaum} akhir kaum {yang zalim. Segala puji bagi Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. ”Maka orang-orang yang zhalim itu dimusnahkan sampai ke akar-akarnya.” Maksudnya, mereka tenggelam dalam azab, dan sebab-sebab pun terputus. “Segala puji bagi Allah, Tuhan semesta alam,” atas apa yang Dia tetapkan dan Dia takdirkan, berupa binasanya orang-orang yang mendustakan. Dengan itu jelaslah ayat-ayatNya dan pemuliaanNya kepada wali-waliNya, penghinaanNya kepada musuh-musuhNya, serta kebenaran ayat-ayat yang dibawa oleh para Rasul."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 45: Atas pertolongan-Nya kepada para rasul dan dibinasakan-Nya orang-orang yang kafir. Dengan begitu semakin jelas ayat-ayat-Nya, pemuliaan-Nya kepada wali-wali-Nya, penghinaan kepada musuh-musuh-Nya dan benarnya apa yang dibawa para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 45",
    "description": "Peringatan sudah disampaikan, teguran secara halus maupun keras juga sudah diberikan, bahkan aneka nikmat sudah mereka terima, mereka masih saja durhaka. Maka berlakulah ketentuan Allah, yaitu orangorang yang zalim itu dimusnahkan sampai ke akar-akarnya sehingga tidak tersisa. Dan itu semua bukan karena Allah berbuat aniaya kepada mereka, karena semua yang ditentukan Allah adalah baik, maka segala puji bagi Allah, tuhan seluruh alam. Kalau masih ada juga yang enggan untuk mengikuti petunjuk Allah, sedangkan berbagai macam bentuk peringatan sudah disampaikan, maka katakanlah, wahai nabi Muhammad, terangkanlah atau beritahukanlah kepadaku jika Allah yang mahakuasa itu mencabut pendengaran dan penglihatan serta menutup hatimu, sehingga semuanya tidak berfungsi sebagaimana mestinya, maka siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu' tidak akan ada yang sanggup sama sekali. Maka perhatikanlah, bagaimana kami, melalui berbagai sarana dan cara, telah menjelaskan berulang-ulang kepada mereka ayat-ayat, yakni tanda-tanda kekuasaan kami, yang amat jelas dan sempurna, tetapi mereka tetap dan selalu berpaling."
  }
]