[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”beritahukanlah kepadaku jika Allah menghilangkan pendengaran kalian hingga membuat kalian tuli dan merusak pandangan kalian hingga membuat kalian buta dan mengunci hati kalian sehingga kalian menjadi tidak dapat memahami perkataan apapun, tuhan manakah selain Allah yang kuasa mengembalikan semua itu kepada kalian?” perhatikanlah (wahai rasul), bagaimana kami memvariasikan bentuk hujjah kepada mereka, tetapi mereka setelah itu tetap berpaling dan tidak mau mengingat dan mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Katakanlah -wahai Rasul- kepada orang-orang musyrik, “Katakan padaku, jikalau Allah membuat kalian tuli dengan cara mengambil pendengaran kalian, membuat kalian buta dengan mengambil penglihatan kalian, dan mengunci mati hati kalian sehingga kalian tidak mengerti apa-apa, siapakah tuhan yang dapat memberikan apa yang hilang darimu itu?” Renungkanlah -wahai Rasul- bagaimana Kami menjelaskan banyak hujah dan memberikan beragam bukti kepada mereka tetapi kemudian mereka berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Allah telah menjelaskan berkali-kali berbagai bukti atas ketuhanan dan keesaan-Nya; sehingga dengan bukti tersebut tertolaklah pengakuan orang-orang musyrik yang menjadikan berhala-berhala mereka sebagai Tuhan selain Allah. Allah menjelaskan kepada mereka hakikat apa yang mereka persekutukan dengan ungkapan-ungkapan yang mengandung olok-olok agar menegaskan hujjah atas mereka; Dia berfirman: Hai Muhammad, katakanlah kepada orang-orang musyrik: katakan kepadaku Jika Allah mengambil pendengaran kalian sehingga kalian menjadi tuli, mengambil penglihatan kalian sehingga kalian menjadi buta, dan menutup hati kalian. Apakah ada Tuhan selain Allah yang dapat mengembalikan kepada kalian apa yang telah Allah ambil? Atau Adakah Tuhan selain Allah yang dapat kalian datangi agar mengembalikan apa yang telah diambil dari kalian? Hai Rasulullah, lihatlah bagaimana kami menjelaskan berbagai macam ayat, seperti memberi bukti-bukti secara logika dan memerintahkan untuk memikirkan ayat-ayat kauniyah; namun dengan itu semua orang-orang kafir tetap berpaling dan ingkar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. قُلْ أَرَءَيْتُمْ (Katakanlah: “Terangkanlah kepadaku) Yakni jelaskanlah kepadaku. إِنْ أَخَذَ اللهُ سَمْعَكُمْ وَأَبْصٰرَكُمْ (jika Allah mencabut pendengaran dan penglihatan) Yakni mencabut kemampuan kedua indra tersebut, atau menghapus dua indra tersebut. وَخَتَمَ عَلَىٰ قُلُوبِكُم (serta menutup hatimu) Sehingga tidak dapat memahami sesuatu sedikitpun. مَّنْ إِلٰهٌ غَيْرُ اللهِ يَأْتِيكُم بِهِ ۗ (siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu?”) Yakni mengambil apa yang telah diambil-Nya. انظُرْ (Perhatikanlah) Wahai Muhammad. كَيْفَ نُصَرِّفُ الْءَايٰتِ (bagaimana Kami berkali-kali memperlihatkan tanda-tanda kebesaran (Kami)) Kalimat ini adalah bentuk ketakjuban atas hal itu. Makna (التصريف) disini adalah mendatangkan ayat -ayat dalam bentuk yang berbeda-beda, baik itu dengan memberi peringatan, pemberian uzur, menawarkan sesuatu yang disukai, atau mengancam dengan sesuatu yang ditakuti. ثُمَّ هُمْ يَصْدِفُونَ (kemudian mereka tetap berpaling (juga)) Yakni menghindar dan menolak ayat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46 Katakanlah kepada orang-orang yang mendustakan risalahmu wahai Nabi: “Terangkanlah kepadaku jika Allah mencabut pendengaran dan penglihatan serta menutup akal, fikiran dan pemahamanmu, siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu?” Perhatikanlah wahai Nabi bagaimana Kami berkali-kali memperlihatkan tanda-tanda kebaikan dan kebenaran kebesaran Kami sebagai kabar gembira dan juga peringatan, kemudian mereka tetap berpaling juga dan tetap tidak beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Terangkanlah kepadaku jika Allah mencabut} menghilangkan {pendengaran dan penglihatan kalian serta mengunci} mengunci {hati kalian. Siapakah tuhan selain Allah yang bisa mengembalikannya kepada kalian” Perhatikanlah bagaimana Kami menjelaskan} menerangkan dan menjelaskan {ayat-ayat. kemudian mereka tetap berpaling} berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Allah memberitakan bahwa sebagaimana Dia yang sendirian yang menciptakan mahkluk dan pengaturannya, maka dia pulalah yang sendirian dalam keesaan dan ketuhanan. Dian berfirman, “Katakanlah, ‘terangkanlah kepadaku jika Allah mencabut pengdengaran dan penglihatan serta menutup hatimu,’” maka kamu hidup tanpa pendengaran , tanpa penglihatan dan tanpa akal. “Siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu?” jika tidak ada selain Allah yang mendatangkan itu, maka mengapa kamu menyembah sesuatu bersama Allah, yang tidak memilki kekuatan apa pun kecuali jika Allah berkehendak? Ini adalah bukti kebenaran tauhid dan kebathilan syirik. Oleh karena itu Allah berfirman, “Perhatikanlah, bagaimana kami berkali-kali memperlihatkan tanda-tanda kebesaran (kami).” Maksudnya, perhatikanlah bagaimana kami menghadirkannya dengan bentuk yang bermacam-macam. Kami menghadirkannya dalam setiap disipin ilmu untuk menerangi kabenaran dan menelursuri jalan para pelaku kejahatan. “kemudian mereka,” setelah penjelasan lengkap ini, “tetap berpaling juga” dari ayat-ayat Allah dan melongos darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 46: Dalam ayat ini Allah Subhaanahu wa Ta'aala memberitahukan, bahwa sebagaimana Dia hanya sendiri yang mencipta dan mengatur segala sesuatu, Dia pula yang Esa dan yang berhak disembah. Sehingga kamu tidak mengetahui apa-apa. Jika selain Allah tidak mampu mengembalikannya, maka mengapa kamu menyembah di samping-Nya sesembahan yang tidak mampu berbuat apa-apa? Hal ini termasuk bukti kebenaran tauhid dan batalnya syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 46",
    "description": "Kalau masih ada juga yang enggan untuk mengikuti petunjuk Allah, sedangkan berbagai macam bentuk peringatan sudah disampaikan, maka katakanlah, wahai nabi Muhammad, terangkanlah atau beritahukanlah kepadaku jika Allah yang mahakuasa itu mencabut pendengaran dan penglihatan serta menutup hatimu, sehingga semuanya tidak berfungsi sebagaimana mestinya, maka siapakah tuhan selain Allah yang kuasa mengembalikannya kepadamu' tidak akan ada yang sanggup sama sekali. Maka perhatikanlah, bagaimana kami, melalui berbagai sarana dan cara, telah menjelaskan berulang-ulang kepada mereka ayat-ayat, yakni tanda-tanda kekuasaan kami, yang amat jelas dan sempurna, tetapi mereka tetap dan selalu berpalingpada ayat sebelumnya dijelaskan ancaman siksaan Allah dengan menekankan aspek keterkejutan yaitu datang dengan tiba-tiba, maka ayat ini mengulang kembali ancaman Allah terhadap para pendurhaka disertai dengan aspek jelasnya kedatangan siksaan tersebut yaitu secara terang-terangan. Katakanlah, wahai nabi Muhammad kepada orangorang kafir, terangkanlah kepadaku apa yang dapat kamu lakukan dan kepada siapa kamu akan meminta pertolongan jika siksaan Allah sampai kepadamu secara tiba-tiba atau terang-terangan, pasti tidak ada satu pun yang dapat menolong, maka adakah yang dibinasakan oleh Allah selain orang-orang yang zalim' tidak ada yang lain, karena kalau mereka tidak terus-menerus berbuat zalim pastilah Allah tidak akan menyiksa mereka."
  }
]