[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada kaum musyrikin, ”beritahukanlah olehkalian kepadaku apabila siksaan Allah datang kepada kalian secara mendadak sedang kalian tidak menyadarinya, atau tampak secara terang-terangan dan kalian dapat menyaksiakan dengan mata kepala kalian langsung; apakah ada yang dibinasakan (oleh Allah) selain orang-orang yang zhalim yang telah berbuat melampaui batas dengan cara memalingkan peribadahan kepada selain Allah dan dengan mendustakan rosul-rosulNya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Katakanlah kepada mereka -wahai Rasul-, “Katakan padaku, jikalau azab Allah datang kepada kalian dengan tiba-tiba tanpa kalian sadari, atau datang kepada kalian secara terangan-terangan dan terbuka, sesungguhnya tidak ada yang dibinasakan dengan azab itu kecuali orang-orang yang zalim lantaran perilaku mereka yang ingkar kepada Allah dan mendustakan Rasul-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Katakan kepadaku jika datang kepada kalian azab Allah secara tiba-tiba tanpa ada tanda-tanda kedatangannya sebelumnya, atau azab yang jelas setelah muncul tanda-tanda kedatangannya; bukankah yang binasa hanya orang-orang yang zalim, karena mereka telah kehilangan kehidupan dunia dan kenikmatannya, dan kehidupan akhirat mereka yang dipenuhi dengan kerugian, kehinaan, dan azab di neraka. Pertanyaan ini dimaksudkan sebagai penegasan -bahwa yang binasa hanya orang-orang zalim-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. قُلْ أَرَءَيْتَكُمْ إِنْ أَتَىٰكُمْ عَذَابُ اللهِ (Katakanlah: “Terangkanlah kepadaku jika datang siksaan Allah kepadamu) Yakni jelaskanlah kepadaku apabila itu telah datang kepada kalian. بَغْتَةً (dengan sekonyong-konyong) Yakni tanpa didahului tanda-tanda kedatangan azab, dan mereka lalai terhadap hal itu. أَوْ جَهْرَةً (atau terang-terangan) Yakni kedatangan azab dapat dilihat dari tanda-tanda yang mendahuluinya, dan dengan itu mereka mengetahui bahwa azab akan mendatangi mereka. هَلْ يُهْلَكُ إِلَّا الْقَوْمُ الظّٰلِمُونَ(maka adakah yang dibinasakan (Allah) selain dari orang yang zalim?) Yakni azab dan kemurkaan tidak membinasakan kecuali orang-orang yang zalim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47 Katakanlah kepada mereka wahai Nabi: “Terangkanlah kepadaku apa yang akan kalian lakukan jika datang siksaan Allah kepadamu dengan tiba-tiba tanpa peringatan atau tanda-tanda sedikitpun sebagaimana azab untuk kaum Luth. Atau datang kepadamu secara terang-terangan dengan berbagai tanda dan peringatan, sebagaimana yang menimpa kaum Nuh dan Fir’aun. Tidak ada yang dibinasakan Allah kecuali orang-orang yang zalim kepada diri mereka sendiri dan orang-orang yang ingkar lagi kafir?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Terangkanlah kepadaku jika sampai kepada kalian siksaan Allah secara tiba-tiba atau terang-terangan} secara jelas kalian lihat ketika tiba {maka adakah yang dibinasakan selain orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “katakanlah, ‘Teranngkanlah kepadaku’.” Beritakan kepadaku, “jika datang siksaan Allah kepadamu dengan sekoyong-koyong atau terang-terangan.” Maksudnya, secara tiba-tiba, atau sebelumnya telah di dahului oleh mukadimah yang dengannya kamu mengetahui terjadinya, “apakah ada yang dibinasakan Allahselain dari orang-orang yang zhalim?” yaitu orang yang menjadi pemicu turunnya azab kepada mereka akibat kezhaliman dan pengingkaranya. Waspadalah! Jangan berjalan di atas kezhaliman, karena ia adalah kebinasaan dan kesengsaraan yang kekal dan abadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 47: Yakni orang-orang kafir. Oleh karena itu, takutlah jika tetap di atas kekafiran sebelum azab Allah datang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 47",
    "description": "Pada ayat sebelumnya dijelaskan ancaman siksaan Allah dengan menekankan aspek keterkejutan yaitu datang dengan tiba-tiba, maka ayat ini mengulang kembali ancaman Allah terhadap para pendurhaka disertai dengan aspek jelasnya kedatangan siksaan tersebut yaitu secara terang-terangan. Katakanlah, wahai nabi Muhammad kepada orangorang kafir, terangkanlah kepadaku apa yang dapat kamu lakukan dan kepada siapa kamu akan meminta pertolongan jika siksaan Allah sampai kepadamu secara tiba-tiba atau terang-terangan, pasti tidak ada satu pun yang dapat menolong, maka adakah yang dibinasakan oleh Allah selain orang-orang yang zalim' tidak ada yang lain, karena kalau mereka tidak terus-menerus berbuat zalim pastilah Allah tidak akan menyiksa mereka kalau pada akhirnya orang-orang yang zalim itu mendapat siksa dari Allah, seperti dijelaskan pada ayat sebelumnya, hal ini bukan karena Allah berbuat sewenang-wenang, karena telah sampai kepada mereka para rasul yang kami utus itu yang tugas utamanya adalah untuk memberi kabar gembira bagi yang taat dan memberi peringatan bagi yang durhaka. Kalau pada akhirnya mereka memilih bersikap durhaka, maka konsekuensinya mereka mendapat siksa. Maka, barang siapa beriman dengan keimanan yang benar dan mengadakan perbaikan dengan bertobat secara sungguh-sungguh, maka tidak ada rasa takut pada mereka, yaitu tidak ada kekeruhan jiwa menyangkut sesuatu yang belum terjadi baik di dunia maupun di akhirat, dan mereka tidak bersedih hati atas sesuatu yang telah terjadi."
  }
]