[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kami mengutus para rasul kami, melainkan sebagai pemberi kabar gembira untuk orang-orang yang taat kepada kami dengan kenikmatan yang abadi dan pemberi peringatan keras terhadap orang-orang yang berbuat maksiat dengan siksaan yang pedih. Maka barangsiapa yang beriman dan membenarkan para rasul serta beramal shalih, maka mereka itu tidak mengalami kekhawatiran tatkala bertemu dengan tuhan mereka, dan(juga) tidak bersedih hati atas apa yang terlewatkan bagi mereka dari kenikmatan-kenikmatan dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan tidaklah Kami mengutus rasul-rasul Kami melainkan untuk memberitahu orang-orang yang beriman dan patuh kepada-Ku kabar yang menggembirakan berupa kenikmatan abadi yang tidak akan habis serta putus dan memperingatkan orang-orang yang ingkar dan durhaka kepada-Ku akan adanya azab-Ku yang sangat pedih. Barangsiapa yang beriman kepada para rasul dan beramal saleh, maka tidak ada kekhawatiran atas mereka tentang masa depan mereka di Akhirat, dan tidak ada kesedihan serta penyesalan bagi mereka atas kekayaan duniawi yang luput darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Allah menjelaskan tugas para nabi dan rasul, yaitu sebagai penyampai dari Tuhan mereka. Barangsiapa diantara kalian yang beriman dengan hatinya dan mendapat petunjuk untuk masuk agama Allah serta tidak berbuat kerusakan di muka bumi, bahkan berusaha memperbaiki dan memakmurkannya, maka tidak ada ketakutan bagi mereka saat bertemu Allah, dan tidak ada kesedihan atas sesuatu yang telah mereka tinggalkan, karena apa yang ada di sisi Allah lebih baik dan lebih kekal bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلَّا مُبَشِّرِينَ (Dan tidaklah Kami mengutus para rasul itu melainkan untuk memberikan kabar gembira) Yakni kabar gembira bagi orang yang taat kepada para Rasul berupa pahala yang besar yang disiapkan Allah bagi mereka. وَمُنذِرِينَ ۖ (dan memberi peringatan) Yakni peringatan bagi orang yang durhaka terhadap para Rasul berupa azab yang pedih. فَمَنْ ءَامَنَ (Barangsiapa yang beriman) Yakni beriman kepada apa yang dibawa para Rasul. وَأَصْلَحَ (dan mengadakan perbaikan) Yakni memperbaiki keadaan dirinya dengan menjalankan apa yang diperintahkan para Rasul kepada mereka. فَلَا خَوْفٌ عَلَيْهِمْ (maka tak ada kekhawatiran terhadap mereka) Yakni dari apapun. وَلَا هُمْ يَحْزَنُونَ(dan tidak pula mereka bersedih hati) Atas kenikmatan dunia yang mereka lewatkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48 Kami tidak mengutus para rasul itu melainkan untuk memberikan kabar gembira kepada orang-orang yang taat kepada mereka dengan anugerah surga dan memberi peringatan kepada orang-orang yang mendurhakai mereka dengan siksa api neraka. Barangsiapa yang beriman keapda Allah, rasul dan kitab-kitab-Nya dan memperbaiki amalnya, maka tak ada kekhawatiran bagi mereka atas azab akhirat dan mereka tidak pula bersedih hati atas dunia yang hilang dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah Kami utus para rasul melainkan untuk memberi kabar gembira dan memberi peringatan. Siapa saja yang beriman dan melakukan perbaikan, maka tidak ada rasa takut pada mereka dan mereka tidak bersedih hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Allah menyebutkan inti risalah para rasul bahwa ia merupakan berita gembira dan peringatan. Hal itu menuntut penjelasan tentang pembawa berita gembira, yang diberi berita gembira dan amal yang jika di lakukan oleh seorang hamba, maka dia mendapatkan berita gembira. Juga penjelasan tentang pemberi peringatan, sesuatu yang di peringatkan dan seseorang yang di beri peringatan dan perbautan-perbuatan yang jika di lakukan, maka dia berhak di peringatkan. Akan tetapi manusia terbagi menjadi dua dari segi apakah mereka menjawab dakwah para rasul atau tidak; “ barangsiapa yang beriman dan mengadakan perbaikan,” yakni beriman kepada Allah, malaikat-malaikatNya, kitab-kitabNya, rasul-rasulNya, dan Hari Akhir dan memperbaiki iman, amal, dan niatnya, “ maka tak ada kehawatiran terhadap mereka,” terhadap apa yang akan datang, “ dan tidak pula mereka bersedih hati,” terhadap apa yang telah berlalu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 48: Dalam ayat ini, Allah Subhaanahu wa Ta'aala memberitahukan inti dari apa yang dibawa para rasul, yaitu kabar gembira dan peringatan. Hal ini menghendaki untuk menyebutkan orang yang mendapat kabar gembira, bentuk dari kabar gembira itu dan amalan yang jika dikerjakan seseorang akan memperoleh kabar gembira, demikian juga orang yang mendapat peringatan, bentuk peringatan yang akan diterima, dan amalan yang jika dilakukan akan memperoleh apa yang diperingatkan itu. Manusia dalam hal ini, terbagi menjadi dua bagian; orang yang beriman dan orang yang kafir. Berupa surga bagi orang yang beriman. Berupa neraka bagi orang yang kafir. Mengadakan perbaikan mencakup memperbaiki imannya, amalnya dan niatnya. Terhadap hal yang akan datang. Terhadap hal yang telah berlalu dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 48",
    "description": "Kalau pada akhirnya orang-orang yang zalim itu mendapat siksa dari Allah, seperti dijelaskan pada ayat sebelumnya, hal ini bukan karena Allah berbuat sewenang-wenang, karena telah sampai kepada mereka para rasul yang kami utus itu yang tugas utamanya adalah untuk memberi kabar gembira bagi yang taat dan memberi peringatan bagi yang durhaka. Kalau pada akhirnya mereka memilih bersikap durhaka, maka konsekuensinya mereka mendapat siksa. Maka, barang siapa beriman dengan keimanan yang benar dan mengadakan perbaikan dengan bertobat secara sungguh-sungguh, maka tidak ada rasa takut pada mereka, yaitu tidak ada kekeruhan jiwa menyangkut sesuatu yang belum terjadi baik di dunia maupun di akhirat, dan mereka tidak bersedih hati atas sesuatu yang telah terjadi. Para rasul telah diutus dengan membawa bukti kebenaran dan juga peringatan. Dan orang-orang yang mendustakan ayat-ayat kami, yaitu mengingkari risalah yang disampaikan para rasul tersebut, maka akan ditimpa azab yang sangat pedih baik di dunia ataupun akhirat, karena mereka selalu berbuat fasik, yaitu selalu melakukan aktivitas yang menjadikan mereka keluar dari keimanan dan ketaatan kepada Allah atau keluar dari sistem yang ditetapkan-Nya."
  }
]