[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendustakan ayat-ayat Kami, baik yang berasal dari al-qur’an maupun mukjizat-mukjizat, maka mereka akan ditimpa siksaan pada hari kiamat akibat kekafiran mereka dan keluarnya mereka dari jalur ketaatan kepada Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Sedangkan orang-orang yang mendustakan ayat-ayat Kami akan ditimpa azab yang pedih karena mereka keluar dari kepatuhan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Adapun orang-orang yang mendustakan Alquran dan mukjizat dan mendustakan Nabi Muhammad, maka mereka akan mendapat azab akibat kekafiran dan kemaksiatan mereka. Ayat ini ditutup dengan kalimat (بما كانوا يفسقون) yaitu dengan menggunakan fi'il (كان) dan fi'il mudhari' (يفسقون) dan tidak menggunakan fi'il madhi (فسقوا), untuk mengungkapkan bahwa azab yang menimpa mereka adalah akibat kefasikan yang mereka perbuat secara terus menerus, karena fi'il mudhori' mengandung makna konsistensi dan keberlangsungan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49 Orang-orang yang mendustakan ayat-ayat Kami yang diperintahkan lewat para rasul, akan ditimpa siksa di akhirat disebabkan kekufuran mereka dan perbuatan fasik mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mendustakan ayat-ayat Kami akan ditimpa} akan ditimpa {azab karena mereka selalu berbuat fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “Dan orang-orang yang mendustakan ayat-ayat kami, mereka akan di timpa siksa,” yang mereka dapatkan dan rasakan, “ disebabkan mereka selalu berbuat fasik.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 49",
    "description": "Para rasul telah diutus dengan membawa bukti kebenaran dan juga peringatan. Dan orang-orang yang mendustakan ayat-ayat kami, yaitu mengingkari risalah yang disampaikan para rasul tersebut, maka akan ditimpa azab yang sangat pedih baik di dunia ataupun akhirat, karena mereka selalu berbuat fasik, yaitu selalu melakukan aktivitas yang menjadikan mereka keluar dari keimanan dan ketaatan kepada Allah atau keluar dari sistem yang ditetapkan-Nya. Ayat ini menguatkan bahwa rasul hanyalah menyampaikan apa yang berasal dari Allah. Katakanlah, wahai nabi Muhammad, aku tidak mengatakan kepadamu, hai orang-orang kafir, bahwa perbendaharaan Allah, yaitu aneka kekayaan dan kemewahan yang sering kalian jadikan ukuran kemuliaan hidup, ada padaku, dan aku tidak mengetahui yang gaib tanpa bantuan dari Allah , dan aku tidak pula mengatakan kepadamu bahwa aku malaikat yang tidak makan, tidak minum, dan tidak memiliki kebutuhan biologis. Aku hanyalah manusia seperti kamu. Yang membedakan kita adalah bahwa aku hanya mengikuti apa yang diwahyukan kepadaku, di antaranya berupa Al-Qur'an. Para pendurhaka menolak ajaran Allah, maka nabi Muhammad diperintahkan untuk mengajukan pertanyaan yang mengandung kecaman. Katakanlah, wahai Muhammad, apakah sama orang yang buta, terutama buta mata hatinya, dengan orang yang melihat' orang yang normal pasti akan menjawab berbeda. Maka, apakah kamu tidak pernah memikirkan-Nya'"
  }
]