[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”sesungguhnya aku tidak mengklaim bahwa aku memiliki pembendaharaan langit dan bumi sehingga aku bisa berbuat apa saja di dalamnya, dan aku pun tidak mengaku-ngaku mengetahui perkara-perkara ghaib, dan aku juga tidak mengaku bahwa aku adalah malaikat. Aku hanyalah seorang utusan yang di utus dari sisi Allah. Aku sekedar mengikuti apa yang di wahyukan (Allah) kepadaku dan kemudian aku sampaikan wahyuNya itu kepada umat manusia. ”Katakanlah (wahai rasul) kepada orang-orang musyrik itu, ”apakah sama orang kafir yang buta untuk menyaksikan ayat-ayat Allah sehingga dia tidak mengimaninya dengan orang mukmin yang dapat melihat ayat-ayat Allah lalu mengimaninya? . Apakah kalian tidak mau memikirkan ayat-ayat Allah agar dapat melihat kebenaran dan kemudian mengimaninya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Katakanlah -wahai Rasul- kepada orang-orang musyrik, “Aku tidak mengatakan kepada kalian bahwa aku mempunyai wewenang atas perbendaharaan Allah berupa rezeki sehingga aku bisa mengaturnya sesuka hatiku. Aku juga tidak mengatakan kepada kalian bahwa aku mengetahui perkara gaib selain apa yang Allah beritahukan kepadaku melalui wahyu. Dan aku juga tidak mengatakan kepada kalian bahwa aku adalah seorang malaikat. Karena aku adalah utusan dari Allah, aku tidak mungkin mengikuti apa pun selain apa yang diwahyukan kepadaku. Dan aku tidak mungkin mengakui sesuatu yang bukan milikku.” Dan katakan -wahai Rasul- kepada mereka, “Apakah sama orang kafir yang mata hatinya buta terhadap kebenaran dengan orang mukmin yang mata hatinya melihat kebenaran dengan jelas kemudian beriman kepadanya? Tidakkah kalian -wahai orang-orang musyrik- mau memikirkan menggunakan akal kalian tanda-tanda yang ada di sekitar kalian?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Hai Rasulallah, katakanlah kepada orang-orang musyrik: \"Aku tidak memiliki perbendaharaan langit dan bumi, maka mengapa kalian meminta kepadaku rumah dan istana istana; dan aku tidak mengaku bahwa aku mengetahui ilmu ghaib, maka mana mengapa kalian meminta agar aku memberitahu apa yang akan terjadi di masa depan; dan aku tidak pernah berkata kepada kalian bahwa aku adalah seorang malaikat, maka mengapa kalian memintaku untuk melakukan sesuatu yang tidak mampu dilakukan oleh manusia? Aku hanyalah manusia biasa yang diutus sebagai Rasul untuk menyampaikan risalah dari Tuhanku, dan aku hanya mengikuti apa yang diwahyukan kepadaku.\" Katakanlah: \"Apakah sama antara orang kafir yang hatinya buta dari menerima petunjuk dan kebenaran serta berpaling dari ayat-ayat Tuhannya, dengan orang mukmin yang membuka hatinya untuk menerima cahaya keimanan sehingga dia dapat melihat petunjuk dan beriman kepada Allah dan rasul-Nya? Apakah mereka tidak memikirkan ayat-ayat Allah sehingga mereka dapat beriman?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. قُل (Katakanlah) Wahai Muhammad. لَّآ أَقُولُ لَكُمْ عِندِى خَزَآئِنُ اللهِ (Aku tidak mengatakan kepadamu, bahwa perbendaharaan Allah ada padaku) Yakni dia tidak memiliki kenikmatan-kenikmatan dunia itu sehingga dapat mendatangkan kepada mereka ayat-ayat yang mereka minta. وَلَآ أَعْلَمُ الْغَيْبَ (dan tidak (pula) aku mengetahui yang ghaib) Sehingga ia dapat memberitahu dan megabarkan mereka apa yang akan terjadi di masa depan. وَلَآ أَقُولُ لَكُمْ إِنِّى مَلَكٌ ۖ (dan tidak (pula) aku mengatakan kepadamu bahwa aku seorang malaikat) Sehingga kalian membebani aku untk melakukan sesuatu diluar kewajaran yang tidak aku mampu. إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰٓ إِلَىَّ ۚ (Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku) Apa yang diperintahkan kepadaku untuk menyampaikannya. قُلْ هَلْ يَسْتَوِى الْأَعْمَىٰ وَالْبَصِيرُ ۚ (Katakanlah: “Apakah sama orang yang buta dengan yang melihat?”) Yakni tidak sama antara orang yang sesat dengan orang yang mendapat petunjuk, dan tidak sama antara orang islam dengan orang kafir. أَفَلَا تَتَفَكَّرُونَ (Maka apakah kamu tidak memikirkan?”) Yakni memikirkan hal itu agar kalian mengetahui bahwa keduanya tidaklah sama, sehingga kalian memilih jalan orang yang melihat dan mendapat petunjuk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara berkah wahyu (al-qur'an dan sunnah) : bahwasanya orang yang mengikuti wahyu Allah senantiasa melihat dengan terang benderang, sedangkan orang yang berpaling dari wahyu Allah adalah buta : { إِنْ أَتَّبِعُ إِلَّا مَا يُوحَىٰ إِلَيَّ ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ ۚ } \"Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku. Katakanlah: \"Apakah sama orang yang buta dengan yang melihat?\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50 Katakanlah wahai Nabi: Aku tidak mengatakan kepadamu wahai orang-orang yang membangkang lagi kafir bahwa perbendaharaan takdir dan rizki Allah ada padaku, sehingga aku dapat memberikan rizki ataupun mendatangkan mukjizat sebagaimana yang kalian minta. Dan aku tidak pula kepadamu bahwa aku seorang malaikat yang datang dengan berbagai hal yang menakjubkan. Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku, kemudian aku sampaikan kepada kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku tidak mengatakan kepada kalian bahwa perbendaharaan Allah ada padaku, aku tidak mengetahui yang ghaib, dan tidak pula mengatakan kepada kalian bahwa aku malaikat. Aku tidak mengikuti kecuali apa yang diwahyukan kepadaku.” Katakanlah,“Apakah sama orang yang buta dengan orang yang melihat} orang yang kafir dan orang yang mukmin {Apakah kalian tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah berfirman kepada NabiNya agar berkata kepada orang-orang yang mengusulkan turunnya ayat-ayat Allahatau kepada orang-orang yang berkata kepadanya bahwa kamu hanya mengajak kami untuk menyekutukan Allah dengan sesuatu, “Aku tidak mengatakan kepadamu, bahwa perbendaharaan Allah ada padaku.” Maksudnya, kunci-kunci rizki dan rahmatNya. “Dan tidak pula aku mengetahui yang ghaib.” Karena itu semua hanyalah hak Allah, Dia-lah yang membuka rahmatNya kepada manusia, maka tidak ada yang bisa menghalangi, dan apa yang di halangi oleh Allah, maka tidak ada yang mampu melepaskan sesudahnya. Hanya dia yang mengetahui alam ghaib dan alam nyata. Dia tidak menunjukan ghaibNya kepada seorang pun kecuali rasulNya yang diridhaiNya. “Dan tidak pula aku mengatakan kepadamu bahwa aku seorang malaikat.” Sehingga aku menjadi pelaksanaan perbuatan yang kuat. Aku tidak mengklaim mempunyai kedudukan tinggi daripada kedudukan lebih yang Allah berikan kepadaku. “ Aku tidak mengikuti kecuali apa yang di wahyukan kepadaku.” Ini adalah tujuanku, ujung dan akhir perkaraku, aku mengamalkannya untuk diriku sendiri dan mengajak seluruh manusia kepadanya. Jika kedudukanku di ketahui, maka untuk apa orang masih mencari-cari atau menuntut sesuatu dariku yang tidak aku klaim? Apakah seseorang diharuskan memikul sesuatu yang bukan kewajibanNya? Untuk apa apabila aku mendakwahimu dengan ayat yang di wahyukan kepadaku kamu telah menuduhku mengklaim kedudukan tinggi yang bukan milikku? Katakanlah kepada mereka tentang perbedaan antara orang yang menerima dakwahku, tunduk kepada apa yang di wahyukan kepadaku dengan orang yang tidak demikian, “ katakanlah, ‘ apakah sama orang yang buta yang melihat?’ maka apakah kamu tidak memikirkanNya?” lalau kamu menundukkan perkara di tempatnya yang semestinya, dan kamu memilih yang lebih baik dan lebih layak untuk di pilih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 50: Kepada mereka yang mengusulkan didatangkan suatu mukjizat atau mereka yang berkata kepada Nabi Muhammad shallallahu 'alaihi wa sallam, \"Sesungguhnya kamu mengajak kami agar kami menyembah kamu di samping Allah.\" Yakni kunci-kunci rezki dan rahmat-Nya. Aku tidak mendakwakan diriku melebihi kedudukan yang Allah berikan kepadaku. Jika kamu sudah mengetahui kedudukanku, lalu mengapa kamu meminta dariku perkara yang aku tidak mendakwakannya. Maksudnya katakanlah kepada mereka untuk menerangkan perbedaan antara orang yang menerima dakwah dengan orang yang menolaknya? Yakni orang kafir. Yakni orang yang beriman. Sehingga kamu dapat memposisikan sesuatu pada tempatnya, dan kamu memilih sesuatu yang lebih layak dipilih dan didahulukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 50",
    "description": "Ayat ini menguatkan bahwa rasul hanyalah menyampaikan apa yang berasal dari Allah. Katakanlah, wahai nabi Muhammad, aku tidak mengatakan kepadamu, hai orang-orang kafir, bahwa perbendaharaan Allah, yaitu aneka kekayaan dan kemewahan yang sering kalian jadikan ukuran kemuliaan hidup, ada padaku, dan aku tidak mengetahui yang gaib tanpa bantuan dari Allah , dan aku tidak pula mengatakan kepadamu bahwa aku malaikat yang tidak makan, tidak minum, dan tidak memiliki kebutuhan biologis. Aku hanyalah manusia seperti kamu. Yang membedakan kita adalah bahwa aku hanya mengikuti apa yang diwahyukan kepadaku, di antaranya berupa Al-Qur'an. Para pendurhaka menolak ajaran Allah, maka nabi Muhammad diperintahkan untuk mengajukan pertanyaan yang mengandung kecaman. Katakanlah, wahai Muhammad, apakah sama orang yang buta, terutama buta mata hatinya, dengan orang yang melihat' orang yang normal pasti akan menjawab berbeda. Maka, apakah kamu tidak pernah memikirkan-Nya' setelah pada ayat sebelumnya Allah mengecam orang-orang yang enggan menggunakan akal pikirannya secara benar, kini pembicaraan beralih kepada kelompok orang yang berpikir positif agar disampaikan pesan Allah. Peringatkanlah, wahai nabi Muhammad, dengannya, yakni dengan Al-Qur'an itu, kepada orang yang takut akan dikumpulkan menghadap tuhannya untuk mempertanggungjawabkan amal perbuatannya pada hari kiamat, dan mereka menyadari bahwa pada hari itu tidak ada bagi mereka pelindung dari segala yang mereka takuti dan tidak juga ada pemberi syafaat atau pertolongan selain dari Allah. Yang demikian itu agar mereka selalu bertakwa."
  }
]