[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan peringatkanlah (wahai rasul), dengan al-qur’an ini orang-orang yang meyakini bahwa mereka benar-benar akan dihimpun ke hadapan tuhan mereka. Mereka itu orang-orang yang mempercayai janji-janji Allah dan ancaman-ancamanNya. Tidak ada bagi Mereka pelindungan selain Allah yang menolong mereka dan tidak ada pemberi syafaat bagi mereka yang memberi syafaat disisi Allah sehingga dapat meloloskan mereka dari siksaanNya. Semoga mereka menjadi bertakwa kepada Allah dengan menjalankan perintah-perintah dan menjauhi larangan-larangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan dengan Al-Qur`ān ini berikanlah peringatan -wahai Rasul- kepada orang-orang yang takut akan dikumpulkan kepada Rabbnya kelak pada hari Kiamat, yang tidak ada penolong yang dapat memberikan manfaat bagi mereka dan tidak ada pelindung yang dapat melindungi mereka dari mara bahaya kecuali Allah. Mudah-mudahan mereka merasa takut kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Mereka itulah orang-orang yang mendapatkan manfaat dari Al-Qur`ān."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Hai Muhammad, sampaikanlah al-Qur’an dan peringatkanlah mereka dengannya, orang-orang yang takut kepada Tuhan mereka, karena mereka lebih mudah menerimanya daripada orang lain; mereka beriman kepada Allah dan membernarkan hari kebangkitan. Mereka tidak memiliki penolong dan pemberi syafaat selain Allah. Semoga dengan peringatan ini mereka akan semakin teguh dan kuat imannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَأَنذِرْ بِهِ الَّذِينَ يَخَافُونَ أَن يُحْشَرُوٓا۟ إِلَىٰ رَبِّهِمْ ۙ (Dan berilah peringatan dengan apa yang diwahyukan itu kepada orang-orang yang takut akan dihimpunkan kepada Tuhannya) Karena peringatan dapat bermanfaat bagi mereka apabila mereka takut ditimpa musibah dari Allah; berbeda dengan orang yang tidak takut pada hari kebangkitan karena kekafiran dan keingkaran mereka terhadap hari tersebut, mereka tidak akan mendapat pengaruh dari peringatan. Ayat ini mencakup semua orang yang beriman kepada hari kebangkitan dari kalangan orang-orang mukmin, ahli dzimmah, dan sebagian orang musyrik meskipun mereka pada dasernya tidak mempercayai hal itu namun mereka masih takut akan kebenaran dari apa yang dikabarkan Rasulullah, dan barangsiapa yang masih mempunyai sifat seperti itu maka pelajaran akan lebih mengena pada mereka dan peringatan akan bermanfaat bagi mereka. لَيْسَ لَهُم مِّن دُونِهِۦ وَلِىٌّ وَلَا شَفِيعٌ (sedang bagi mereka tidak ada seorang pelindung dan pemberi syafa’atpun selain daripada Allah) Yakni tidak ada penolong yang dapat menolong mereka, dan tidak pula pemberi syafaat, agar mereka dapat selamat dari azab Allah. Dalam ayat ini terdapat bantahan atas pengakuan orang-orang kafir yang percaya adanya hari kebangkitan, para ahli kitab mengaku bahwa nenek moyang mereka akan memberi syafaat bagi mereka, dan orang-orang musyrik mengaku bahwa patung-patung mereka akan memberi syafaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51 Berilah peringatan dengan Alquran yang diwahyukan kepada orang-orang mukmin yang senantiasa takut hari mahsyar dan segala hiruk pikuknya pada hari kiamat. Mereka juga yakin bahwa mereka tidak mempunyai pelindung dan pemberi pertolongan selain Allah. Merekapun juga yakin bahwa tidak ada yang bisa membero syafaat sehingga mereka bisa selamat dari azab-Nya kecuali Allah. Peringatkanlah mereka agar mereka takut kepada Allah di dunia, sehingga kemudian mereka menjalankan perintah Allah dan menjauhi kekufuran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Peringatkanlah dengannya} Peringatkanlah dengan Al-Qur’an {orang-orang yang takut akan dikumpulkan menghadap Tuhannya} dikumpulkan menghadap Tuhan mereka pada hari Kiamat {Tidak ada bagi mereka selain Dia} selain Allah {pelindung} yang mengawasi {dan pemberi syafaat, agar mereka bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Al-Qur’an ini adalah peringatan bagi semua makhluk, akan tetapi yang mengambil manfaat hanyalah “ orang-orang yang takut akan di himpun kepada Tuhannya pada Hari Kiamat.” Mereka yakin bahwa mereka akan berpindah dari alam ini ke alam kekekalan. Oleh karena itu mereka mengambil apa yang bermanfaat dan membuang apa yang merugikan. “ sedang bagi mereka tidak ada pelindung dan pemberi syafa’at.” Tidak ada selian Allah yang mengurusi perkara mereka lalu di wajudkan sesuatu yang di cari dan menoloak sesuatu yang di takuti. Tiidak ada pula yang memberi syafa’at kepada mereka. “ Agar mereka bertakwa” kepada Allah dengan menaati perintahnya-perintahNya dan menjauhi larangan-laranganNya, karena peringatan menuntut hal itu, dan ia adalah salah satu sebabnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 51: Al Qur'an merupakan peringatan kepada semua makhluk, akan tetapi ia hanyalah bermanfaat bagi mereka yang takut akan dikumpulkan kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 51",
    "description": "Setelah pada ayat sebelumnya Allah mengecam orang-orang yang enggan menggunakan akal pikirannya secara benar, kini pembicaraan beralih kepada kelompok orang yang berpikir positif agar disampaikan pesan Allah. Peringatkanlah, wahai nabi Muhammad, dengannya, yakni dengan Al-Qur'an itu, kepada orang yang takut akan dikumpulkan menghadap tuhannya untuk mempertanggungjawabkan amal perbuatannya pada hari kiamat, dan mereka menyadari bahwa pada hari itu tidak ada bagi mereka pelindung dari segala yang mereka takuti dan tidak juga ada pemberi syafaat atau pertolongan selain dari Allah. Yang demikian itu agar mereka selalu bertakwa. Ayat ini turun berkaitan dengan peristiwa ketika nabi Muhammad sedang bersama para sahabat dari golongan kurang mampu seperti bilal bin rabah dan kawan-kawan, maka datang para tokoh musyrik yang katanya mau mendengar dakwah nabi dengan syarat beliau mengusir orang-orang miskin tersebut. Allah mengingatkan nabi untuk tidak melakukan itu. Janganlah engkau, wahai nabi, mengusir orang-orang miskin yang menyeru tuhannya, yaitu beribadah dengan sungguh-sungguh, pada pagi dan petang hari. Mereka hanya mengharapkan keridaan-Nya. Sedangkan atas para tokoh musyrik tersebut engkau tidak memikul tanggung jawab sedikit pun terhadap perbuatan mereka dan mereka tidak memikul tanggung jawab sedikit pun terhadap perbuatanmu. Karena itu, wahai nabi, engkau tidak perlu khawatir yang menyebabkan engkau mengusir mereka. Jika itu engkau lakukan, maka engkau termasuk orangorang yang zalim. Pelajaran utama ayat ini adalah dalam menyampaikan dakwah tidak boleh membeda-bedakan dan bersikap diskriminatif terhadap objek dakwah berdasarkan status sosialnya."
  }
]