[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika datang kepadamu (Wahai nabi ). orang-orang yang membenarkan ayat-ayat Allah yang mempersaksikan kebenaran(risalah)mu, baik dari al-qur’an maupun lainnya mereka meminta fatwa (kepadamu) tentang cara bertaubat dari dosa-dosa mereka yang telah lalu, maka muliakanlah mereka dengan membalas salam mereka dan berilah mereka kabar gembira berupa rahmat Allah yang sangat luas, bahwa Dia telah menetapkan atas diriNya kasih sayang kepada hambaNYa sebagai bentuk kemurahan; bahwasannya orang yang telah berbuat dosa karena ketidaktahuannya terhadap akibat perbuatan tersebut dan dampaknya yang mengundang kemurkaan Allah (dan perlu diketahui setiap orang yang telah berbuat maksiat kepada Allah, baik tidak sengaja atau dengan kesengajaan, maka hakikatnya adalah seorang yang bodoh, meskipun dia sudah tahu keharamannya), kemudian dia bertaubat setelah itu dan mendawamkan amal shalih, maka sesungguhnya Allah mengampuni dosanya. Dia maha pengampun terhadap para hambaNYa yang bertaubat dan maha pengasih terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Apabila kamu -wahai Rasul- didatangi oleh orang-orang yang percaya kepada ayat-ayat Kami dan bersaksi atas kebenaran agama yang kamu bawa, maka jawablah salam mereka untuk menghormati mereka. Dan berilah mereka kabar gembira akan luasnya kasih sayang Allah. Karena Allah telah mewajibkan diri-Nya sendiri untuk menebar kasih sayang. Barangsiapa di antara kalian berbuat maksiat (dosa) karena tidak tahu dan tidak mengerti, kemudian ia bertobat sesudah melakukan perbuatan itu dan memperbaiki amal perbuatannya, sesungguhnya Allah pasti mengampuni apa yang telah diperbuatnya. Karena sesungguhnya Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertobat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Hai Rasulullah, jika datang kepadamu orang-orang mukmin yang lemah yang tidak boleh kamu usir tersebut, dan para pembesar kaum Quraisy yang menghina mereka; maka segeralah memberi salam kepada orang-orang mukmin yang lemah itu, sebagai penenang hati mereka dan pemuliaan hati mereka; dan sampaikanlah kepada mereka keluasan rahmat Allah dan kebesaran ampunan-Nya. Dan bagian dari rahmat-Nya adalah bahwa barangsiapa yang melakukan kesalahan dan kemaksiatan, kemudian dia bertaubat dan kembali kepada Allah dengan penuh penyesalan, maka Allah akan menghapus dosa dan kesalahannya, karena Dia Maha Pengampun dan Penyayang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَإِذَا جَآءَكَ الَّذِينَ يُؤْمِنُونَ بِـَٔايٰتِنَا (Apabila orang-orang yang beriman kepada ayat-ayat Kami itu datang kepadamu) Mereka adalah orang-orang yang dilarang Allah untuk diusir, mereka adalah orang-orang lemah dan miskin dari kalangan orang-orang beriman. فَقُلْ سَلٰمٌ عَلَيْكُمْ ۖ (maka katakanlah: “Salaamun alaikum) Sebagai penenang fikiran mereka dan pemuliaan bagi mereka. Dan setelah turunnya ayat ini, Rasulullah selalu memulai dengan memberikan salam apabila bertemu dengan para sahabatnya yang miskin. كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ ۖ (Tuhanmu telah menetapkan atas diri-Nya kasih sayang) Yakni Allah menetapkan atas diri-Nya hal ini sebagai bentuk keluasan karunia dan kebaikan-Nya. أَنَّهُۥ مَنْ عَمِلَ مِنكُمْ سُوٓءًۢا بِجَهٰلَةٍ(bahwasanya barang siapa yang berbuat kejahatan di antara kamu lantaran kejahilan) Yakni mengerjakan perbuatan orang-orang jahil, bukan perbuatan orang-orang bijaksana. Dan segala perbuatan dosa dilandasi dengan kejahilan. (lihat surat an-Nisa: 17). ثُمَّ تَابَ مِنۢ بَعْدِهِۦ (kemudian ia bertaubat setelah mengerjakannya) Yakni setelah mengerjakan perbuatan buruknya. وَأَصْلَحَ (dan mengadakan perbaikan) Memperbaiki apa yang dirusaknya dengan kemaksiatan, lalu ia kembali kepada kebenaran dan berbuat ketaatan maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Suatu ketika Mundzir bin Baluthy (salah seorang ulama andalusia) keluar untuk melaksanakan shalat istisqa', maka tatkala ia melihat orang-orang tengah menangis, beliau kemudian menyapa mereka sembari mengucapkan salam, seketika ia terdiam lalu menangis tidak seperti biasanya, lalu ia terdorong untuk membaca firman Allah : { سَلَامٌ عَلَيْكُمْ ۖ كَتَبَ رَبُّكُمْ عَلَىٰ نَفْسِهِ الرَّحْمَةَ } \"\"Salaamun alaikum. Tuhanmu telah menetapkan atas diri-Nya kasih sayang\" Lalu ia kemudian mengajak manusia untuk bertaubatd an senantiasa memohon ampun kepada Allah, lalu mereka pun berhenti dari tangisan, dan turunlah hujan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54 Apabila orang-orang yang beriman kepada ayat-ayat Kami itu datang kepadamu wahai Rasul. Mereka adalah orang-orang beriman dari golongan yang lemah atau fakir miskin, yaitu mereka yang Aku larang engkau untuk mengusir mereka, maka katakanlah untuk memberi kabar baik atas kekhwatiran mereka: “Keselamatan atas kalian. Tuhanmu telah menjawab kalian dengan kasih sayang atas dzat-Nya dengan jawaban yang mulia dan baik, bahwasanya barang siapa yang berbuat kejahatan di antara kamu lantaran kebodohan mereka, bukan karena sengaja, kemudian ia bertaubat setelah mengerjakannya dan memperbaiki amal perbuatan maksiatnya yang menyebabkan kerusakan, kemudian kembali kepada kebenaran, maka sesungguhnya Allah Maha Pengampun bagi orang-orang yang meminta ampunan lagi Maha Penyayang kepada mereka yang bertaubat. Ikrimah berkata: ayat ini turun untuk orang-orang yang tidak boleh diusir, larangan ini disampaikan Allah kepada Nabi, sehingga jika Nabi melihat mereka maka Nabi memulai dahulu menyampaikan salam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila telah datang kepadamu orang-orang yang beriman pada ayat-ayat Kami, katakanlah, “semoga keselamatan tercurah kepada kalian” Tuhan kalian telah menetapkan sifat kasih sayang pada diriNya, Siapa saja yang berbuat kejahatan di antara kalian karena ketidak tahuan} kebodohan {kemudian dia bertaubat setelah itu dan memperbaiki diri, maka sesungguhnya Dia Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Manakala Allah melarang Rosul-Nya untuk mengusir kaum Mukminin yang patuh, maka Dia memerintahkannya untuk memuliakan mereka dengan cara menghormati, menghargai, dan mengagungkan mereka. Allah berfirman, “Apabila orang-orang yang beriman kepada ayat-ayat Kami datang kepadamu, maka katakanlah, ‘Salamun alaikum’ .” maksudnya, jika orang-orang Mukmin datang kepadamu, maka hormatilah mereka, sambutlah mereka, terimalah mereka dengan salam penghormatan, sampaikan kepada mereka berita gembira berupa rahmat Allah dan keluasan karuniaNya yang bisa memompa semangat dan keinginan mereka, doronglah mereka kepada semua jalan dan sebab yang mengantarkan kepadanya. Takut-takutilah mereka dari melakukan dosa secara terus menerus, perintahkan mereka agar bertaubat dari dosa-dosa supaya mereka mendapatkan ampunan dan karunia Allah. Oleh karena itu, Allah berfirman “Tuhanmu telah menetapkan atas DiriNya kasih sayang, (yaitu) bahwasanya barangsiapa yang berbuat kejahatan di antara kamu lantaran kejahilan, kemudian ia bertaubat setelah mengerjakannya dan mengadakan perbaikan,” maksudnya, di samping meninggalkan dosa, menyesal, dan berhenti darinya, dia juga berupaya memperbaiki amal, menunaikan apa yang Allah wajibkan dan menambal amal-amal lahir batin yang rusak, jika semua itu ada, “maka sesungguhnya Allah Maha Pengampun lagi Maha Peyayang.” Yakni, Dia mencurahkan ampunan dan rahmatNya berdasarkan apa yang mereka lakukan terhadap perintahNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 54: Setelah Allah melarang Rasul-Nya menyingkirkan kaum mukmin meskipun kurang terhormat di masyarakat, Allah memerintahkan hal yang sebaliknya berupa memuliakan dan menghormati mereka. Di ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan agar Beliau menyambut mereka yang bertobat, menyampaikan salam dan memberi kabar gembira kepada mereka agar mereka semangat, menakutkan mereka jika tetap berbuat dosa serta memerintahkan mereka bertobat dari segala maksiat agar mereka memperoleh ampunan dan kepemurahan dari Tuhan mereka. Maksudnya ialah: 1. Orang yang berbuat maksiat dengan tidak mengetahui bahwa perbuatan itu adalah maksiat kecuali setelah dipikirkan lebih dahulu. 2. Orang yang durhaka kepada Allah baik dengan sengaja atau tidak. 3. Orang yang melakukan kejahatan karena kurang kesadaran disebabkan sangat marah atau karena dorongan hawa nafsu. Berdasarkan ayat ini, maka setelah meninggalkan maksiat dan menyesal terhadapnya, ia perlu memperbaiki amal dan mengerjakan apa yang diwajibkan Allah serta memperbaiki amal yang yang sebelumnya rusak oleh maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 54",
    "description": "Setelah Allah melarang nabi Muhammad mengusir orang-orang lemah dan miskin yang taat kepada-Nya, maka Allah lalu memberi bimbingan kepada nabi tentang bagaimana sewajarnya menghadapi mereka. Dan apabila orang-orang yang beriman kepada ayat-ayat kami datang kepadamu, khususnya mereka yang lemah dan miskin, maka katakanlah dengan lemah lembut, sala'mun 'alaikum (selamat sejahtera untuk kamu). Tuhanmu yang selalu membimbingmu telah menetapkan sifat kasih sayang yang sempurna pada diri-Nya, yaitu barang siapa berbuat kejahatan, apa pun jenisnya, di antara kamu karena kebodohan, yaitu mengikuti hawa nafsu kemudian dia bertobat dengan sungguhsungguh setelah itu dan memperbaiki diri dengan beramal saleh secara istikamah, maka dia maha pengampun, yaitu akan mengampuni semua kesalahan yang pernah dilakukan, lagi maha penyayang. Uraian yang sedemikian jelas pada ayat-ayat sebelumnya digarisbawahi pada ayat ini. Dan demikianlah kami terangkan ayat-ayat Al-Qur'an agar terlihat jelas jalan orang-orang yang saleh dan agar terlihat jelas pula jalan orang-orang yang berdosa. Setiap orang pada akhirnya akan mempertanggungjawabkan pilihan jalan yang ditempuh, karena keterangan-keterangan dari Allah yang mahakuasa sudah sangat jelas."
  }
]