[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”sesungguhnya Allah telah melarang diriku menyembah berhala-berhala yang kalian sembah selain Allah.” Dan katakanlah kepada mereka, ”Aku tidak akan mengikuti keinginan-keinginan kalian. Sungguh, aku akan tersesat dari jalan yang lurus jika aku mengikuti keinginan hawa nafsu kalian dan tidaklah pula aku termasuk orang yang memperoleh hidayah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Katakanlah -wahai Rasul-, “Sesungguhnya Allah melarangku menyembah tuhan-tuhan yang kalian sembah selain Allah .” Katakanlah -wahai Rasul-, “Aku tidak mau mengikuti selera kalian dalam menyembah tuhan selain Allah. Karena jika aku mengikuti selera kalian dalam hal itu, pasti aku akan tersesat dari jalan yang benar dan tidak bisa menemukannya. Dan itu adalah perilaku semua orang yang mengikuti hawa nafsu tanpa dilandasi bukti (wahyu) dari Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Hai Muhammad, katakanlah kepada orang-orang musyrik yang mengajakmu untuk menyembah tuhan-tuhan mereka atau merayumu untuk meridhai kesyirikan yang mereka lakukan: “Sesungguhnya Allah melarangku untuk menyembah berhala-berhala yang kalian ajak aku untuk menyembahnya. Aku tidak akan mengikuti jalan yang kalian tempuh, karena jika aku melakukannya niscaya aku akan menjadi termasuk orang-orang sesat yang mengambil jalan kegelapan dan kesesatan, dan menjauh dari jalan kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. لَّآ أَتَّبِعُ أَهْوَآءَكُمْ ۙ (Aku tidak akan mengikuti hawa nafsumu) Yakni keinginan-keinginan buruk kalian yang menjerumuskan kedalam kesesatan, berupa permintaan kalian kepadaku untuk menyembah sesembahan kalian dan mengusir orang yang ingin kalian usir. أَنَا۠ مِنَ الْمُهْتَدِينَ (aku termasuk orang-orang yang mendapat petunjuk) Yakni jika aku menjalankan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56 Katakanlah kepada orang-orang musyrik wahai Nabi: “Sesungguhnya Allah melarangku menyembah tuhan-tuhan yang kamu sembah selain Allah. Juga memerintahkanku untuk tidak mengikuti hawa nafsu kalian yang rusak dan berada dalam kesesatan yaitu penyembahan kepada berhala kalian, serta mengusir beberapa orang mukmin. Jika aku mengikuti hawa nafsu kalian maka aku akan tersesat”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya aku dilarang menyembah tuhan-tuhan yang kalian sembah} kalian sembah {selain Allah.” Katakanlah, “Aku tidak akan mengikuti keinginan kalian. Jika berbuat demikian, sungguh tersesatlah aku, dan aku tidak termasuk orang yang mendapat petunjuk.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Allah berfirman kepada NabiNya, “Katakanlah” kepada orang-orang musyrik yang menyembah tuhan lain bersama Allah, “Sesungguhnya aku dilarang menyembah tuhan-tuhan yang kamu sembah selain Allah,” berupa sekutu-sekutu dan berhala-berhala yang tidak memiliki manfaat, mudarat, dan tidak mematikan manusia kembali. Ini adalah kebatilan, kamu tidak memiliki argumentasi atau syubhat kecuali mengikuti hawa nafsu dimana mengikutinya adalah kesesatan paling besar. Oleh karena itu, Allah berfirman, “Katakanlah, ‘Aku tidak akan mengikuti hawa nafsumu, sungguh tersesatlah aku jika berbuat demikian’.” Maksudnya, jika aku mengikuti hawa nafsumu, “ dan tidaklah pula aku termasuk orang-orang yang medapat petunjuk,” dari segi manapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 56: Kepada orang-orang musyrik. Baik patung maupun sesembahan lainnya, yang memang tidak berkuasa memberikan manfaat atau menghindarkan bahaya, tidak mampu mematikan maupun menghidupkan, dan tidak ada sedikitpun alasan yang membenarkan demikian meskipun beerupa syubhat, selain mengikuti hawa nafsu, di mana mengikutinya merupakan kesesatan yang paling besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 56",
    "description": "Keterangan tentang jalan orang-orang yang sesat telah disebutkan pada ayat-ayat sebelumnya maka pada ayat ini menjelaskan respons yang seharusnya diberikan oleh nabi Muhammad dan orang-orang beriman atas sikap orang-orang musyrik. Katakanlah, hai Muhammad, aku dilarang menyembah tuhan-tuhan yang kamu sembah selain Allah. Dan katakanlah juga, aku tidak akan mengikuti keinginan hawa nafsumu di antaranya adalah mengusir orang-orang beriman yang meskipun keadaannya lemah dan miskin sekalipun. Jika berbuat demikian, sungguh tersesatlah aku, dan aku tidak termasuk orang yang mendapat petunjuk. Sikap nabi Muhammad telah jelas. Allah lalu memerintah beliau untuk menyampaikan alasannya. Katakanlah, wahai nabi Muhammad, sungguh aku berada di atas keterangan yang nyata dari tuhanku, yaitu Al-Qur'an, sedang kamu, hai orang-orang musyrik, mendustakannya. Bukanlah kewenanganku untuk menurunkan azab yang kamu tuntut untuk disegerakan kedatangannya. Menetapkan hukum itu, di antaranya menyangkut siapa yang akan menerima azab dan kapan diturunkan, hanyalah hak Allah. Dia menerangkan kebenaran menyangkut apa saja dan dia pemberi keputusan yang terbaik. Sebuah keputusan yang adil, karena dia maha mengetahui dan mahabijaksana dalam memutuskan."
  }
]