[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul kepada kaum musyrikin), ”sesungguhnya aku berada diatas ilmu yang terang yang bersumber dari syariat Allah yang telah Dia wahyukan kepadaku. Yaitu dengan mengesakanNya semata-mata dengan ibadah, dan sungguh kalian mendustakannya. Dan bukanlah dalam kemampuanku untuk menurunkan siksaan yang kalian minta supaya disegerakan kedatangannya. Tiadalah ketetapan penundaan hal itu kecuali tergantung kepada Allah .Dia menerangkan kebenaran dan Dialah sebaik-baik Dzat yang memutuskan antara kebenaran dan kebatilan melalui keputusan dan hukumNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, “Sesungguhnya aku berpijak pada bukti (wahyu) yang nyata dari Rabbku, bukan karena dorongan hawa nafsu. Sedangkan mendustakan bukti ini. Aku tidak berwenang mendatangkan azab yang ingin segera kalian dapatkan dan mukjizat yang kalian minta. Sesungguhnya wewenang untuk melakukan hal itu ada di tangan Allah. Tidak ada yang berhak membuat keputusan -termasuk apa yang kalian minta itu- selain Allah. Dia lah yang mengatakan kebenaran dan Dia lah yang memutuskannya. Dan Dia -Subḥānahu- adalah sebaik-baik pembuat keputusan yang memisahkan antara orang yang benar dan orang yang batil.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Hai Muhammad, katakanlah kepada orang-orang musyrik: “Sesungguhnya aku berada di atas jalan yang jelas dari Tuhanku; aku menyembah dan mengesakan-Nya dalam peribadatan. Dia Tuhan Yang Maha Agung yang tidak memiliki sekutu.” Adapun orang-orang musyrik adalah orang-orang yang mendustakan Allah dan menyekutukan-Nya dengan yang lain. Mereka menolak perintah Allah dan meminta kepada Rasulullah agar menyegerakan azab bagi mereka. Namun Rasulullah tidak dapat menyegerakannya, karena ketetapan dan urusan itu semua milik Allah, jika Dia menghendaki untuk menurunkan azab dan menyegerakannya di dunia sebagaimana yang telah diturunkan kepada sebagian umat terdahulu, maka tidak akan ada yang dapat menolaknya. Dan jika Dia menghendaki untuk mengakhirkan azab itu atau menundanya sampai di akhirat kelak, maka tidak ada yang dapat menghalangi ketetapan-Nya. Hanya Allah yang akan membuat ketetapan antara kebenaran dan kebatilan tanpa dorongan hawa nafsu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. قُلْ إِنِّى عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى (Katakanlah: “Sesungguhnya aku berada di atas hujjah yang nyata (Al Quran) dari Tuhanku) Yakni aku berada diatas bukti dan keyakinan dari tuhanku, yang tidak terdapat didalamnya hawa nafsu dan keraguan yang ada pada mereka, yang senantiasa mengikuti syubhat yang lemah dan keraguan yang bathil, yang tak berlandasan kecuali pada hawa nafsu yang sesat. وَكَذَّبْتُم بِهِۦ ۚ (sedang kamu mendustakannya) Yakni mendustakan tuhan atau hujjah. مَا عِندِى مَا تَسْتَعْجِلُونَ بِهِۦٓ ۚ (Tidak ada padaku apa yang kamu minta supaya disegerakan kedatangannya) Mereka dahulu senantiasa meminta untuk disegerakan turunnya azab atau datangnya mukjizat-mukjizat yang mereka minta. إِنِ الْحُكْمُ إِلَّا لِلّٰهِ ۖ (Menetapkan hukum itu hanyalah hak Allah) Yakni dalam segala hal; dan termasuk didalamnya adalah permintaan untuk disegerakan turunnya azab atau datangnya mukjizat-mukjizat yang mereka minta. يَقُصُّ الْحَقَّ ۖ (Dia menerangkan yang sebenarnya) Yakni menjelaskan kebenaran dari apa yang Dia tetapkan. Atau menceritakan kisah-kisah yang sebenarnya. وَهُوَ خَيْرُ الْفٰصِلِينَ (dan Dia Pemberi keputusan yang paling baik) Yakni yang membedakan antara kebenaran dan kebathilan dengan keputusan yang ditetapkan-Nya diantara para hamba Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57 Katakanlah kepada mereka: “Sesungguhnya aku berada di atas hujjah yang nyata (Al Quran) dari Tuhanku atas perbedaanku dengan kalian, sedang kamu mendustakan kebenaran serta Alquran yang diturunkan Allah kepadaku. Kalian telah menjadikan sekutu bagi Allah. Aku tidak mempunyai bagian atas azab yang kalian minta supaya disegerakan kedatangannya seraya kalian olok-olok itu. Yang Maha menetapkan hukum untuk memperlambat atau mempercepat azab itu hanyalah Allah. Allah lah Yang menetapkan ketetapan dengan benar, dan menceritakan berbagai kisah yang benar kepada rasul tentang janji dan ancaman-Nya. Yaitu Dialah Yang Maha Suci, sebaik-baik Pemberi keputusan yang paling baik, Yang memisahkan antar yang benar dan batil dalam menetapkan urusan hamba-Nya.” Alkilbi berkata: ayat ini turun untuk Nadr bin Haris dan para pembesar Qurays, mereka berkata: Wahai Muhammad, datangkan azab yang engkau janjikan kepada kami (seraya mengolok), kemudian ayat ini turun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku di atas keterangan yang nyata} bukti nyata dari Tuhanku, lalu kalian mendustakannya. Bukanlah kewenanganku atas apa kalian inginkan untuk disegerakan. Menetapkan hukum itu hanyalah hak Allah. Dia menerangkan kebenaran} Berfirman tentang kebenaran dan menentukan hukum dengan itu {dan Dia pemberi keputusan yang terbaik.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. adapun apa yang aku pegang dalam mentauhidkan Allah dan mengikhlaskan amal kepadaNya, maka ia adalah kebenaran berpijak kepada bukti-bukti dan dalil-dalil yang pasti. Dan aku “ berada di atas hujjah yang nyata (Al-Qur’an) dari tuhanku.” Maksudnya, saya berpedoman pada keyakinaan yang jelas dengan kebenaran Al-Qur’an dan kebahtilan selainnya. Ini adalah kesaksian dari Rasululloh yang pasti lagi tidak mengenal keraguan. Dia adalah saksi yang paling agung dari para makhluk yang mutlak lalu orang-orang Mukmin membenarkanNya. Kaebenaran dan keabsahannya telah terbukti bagi mereka bergantung kepada apa yang Allah limpahkan kepada mereka. Akan tetapi kamu wahai orang-orang musrik, “ kamu mendustakannya.” Padahal ia tidak patut kamu dustakan. Yang patut untuknya hanyalah pembenaran terhadapnya, jika kamu masih terus-menerus mendustakan, maka ketahuilah bahwa azab pasti menimpamu, tidak bisa tidak. Azab tersebut ada di sisi Allah. Dia yang menurunkannya kepadamu jika dia berkehendak dan bagaimanapun caranya dia berkehendak. Jika kamu tergesa-gesa dengannya, maka aku tidak memiliki hak untuk mengatur sedikitpun dalam hal ini, karena yang “ menetapkan hukum itu hanyalah hak Allah,” Sebagaimana dia telah meletakan hukum syar’I; Dia memerintahkan dan melarang, maka dia pun menetapkan hukum jazai (balasan), maka Dia membalas dan mengazab sesuai dengan tuntunan hikmahNya. Maka menyanggah hukumNya secara mutlak tidaklah di terima. Dia telah menjelaskan jalan dan menerangkan kebenaran kepada hamba-hambaNya dengan keterangan yang memangkas dalih dan hujjah mereka agar orang yang binasa menjadi binasa dengan jelas, dan orang yang hidup menjadi hidup dengan jelas. “ Dan Dia pemberi keputusan yang paling baik “ diantara hamba-hambaNya di dunia dan akhirat. Dia memutuskan di antara mereka dengan keputusan yang terbaik bahkan di puji oleh orang yang terhukum dengan orang yang kebenaran di tunjukan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 57: Maksudnya apa yang dipegang Nabi Muhammad shallallahu 'alaihi wa sallam berupa tauhid dan mengikhlaskan amal kepada-Nya mempunyai bukti yang nyata atas kebenarannya. Sebagaimana Dia yang menetapkan hukum syar'i; Dia yang memerintah dan melarang, maka Dia juga memberikan keputusan balasan (hukum jaza'i), Dia yang memberi pahala dan menyiksa sesuai kebijaksanaan-Nya. Agar hujjah tegak, dan tidak ada lagi alasan bagi mereka. Baik di dunia maupun di akhirat, dan Dia menetapkan keputusan yang terpuji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 57",
    "description": "Sikap nabi Muhammad telah jelas. Allah lalu memerintah beliau untuk menyampaikan alasannya. Katakanlah, wahai nabi Muhammad, sungguh aku berada di atas keterangan yang nyata dari tuhanku, yaitu Al-Qur'an, sedang kamu, hai orang-orang musyrik, mendustakannya. Bukanlah kewenanganku untuk menurunkan azab yang kamu tuntut untuk disegerakan kedatangannya. Menetapkan hukum itu, di antaranya menyangkut siapa yang akan menerima azab dan kapan diturunkan, hanyalah hak Allah. Dia menerangkan kebenaran menyangkut apa saja dan dia pemberi keputusan yang terbaik. Sebuah keputusan yang adil, karena dia maha mengetahui dan mahabijaksana dalam memutuskan. Katakanlah, wahai nabi Muhammad, seandainya ada padaku wewenang dan kekuasaan menyangkut apa, yakni azab, yang kamu minta agar disegerakan kedatangannya, tentu selesailah segala perkara antara aku dan kamu. Pasti aku akan mengabulkan permintaan kamu dengan segera menurunkan siksa karena itu memang juga menjadi keinginan setiap orang yang berkomitmen terhadap agamanya. Dan apalagi aku tidak mengetahui secara pasti siapa yang benar-benar zalim, hanya Allah-lah yang lebih mengetahui tentang orang-orang yang zalim."
  }
]