[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), “seandainya aku memiliki kemampuan menurunkan siksaan yang kalian minta disegerakan kedatangannya ,pastilah akan aku timpakan siksa itu pada kalian, sehingga selesailah urusan antara aku dan kalian.” Akan tetapi, urusan tersebut tergantung kepada Allah . Dia lebih mengetahui tentang orang-orang zhalim yang melakukan perbuatan-perbuatan melampaui batas hingga menyekutukan selain Allah denganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Katakanlah -wahai Rasul- kepada mereka, “Seandainya aku berhak dan berwenang untuk menyegerakan azab yang kalian minta, pasti aku sudah menimpakannya kepada kalian. Dan ketika itulah akan diputuskan perkara yang terjadi di antara aku dan kalian.\" Dan Allah Maha Mengetahui perihal orang-orang yang zalim terkait berapa lama Dia akan memberi mereka tenggang waktu dan kapan Dia akan menjatuhkan hukuman kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Hai Muhammad, katakanlah kepada orang-orang musyrik: “Sesungguhnya segala kejadian yang ada di alam semesta berada di tangan Allah. Dia yang mengaturnya dengan kehendak dan ilmu-Nya, seandainya perkara itu ada di tanganku dan atas kekuasaanku niscaya aku akan mendatangkan azab yang ingin kalian segerakan dan aku akan membinasakan kalian dengan azab itu demi membela Tuhanku dan membalas kalian yang telah melanggar larangan-Nya. namun perkara itu semua ada di tangan Allah. Dia adalah Tuhan Yang Maha Bijaksana dan Maha Mengetahui orang-orang zalim. Dia menunda pembalasan terhadap mereka atas pengetahuan dan hikmah-Nya; namun jika Dia sudah mengazab, maka sungguh azab-Nya sangat keras."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. قُل لَّوْ أَنَّ عِندِى مَا تَسْتَعْجِلُونَ بِهِۦ (Katakanlah: “Kalau sekiranya ada padaku apa (azab) yang kamu minta supaya disegerakan) Yakni seandainya apa yang kalian minta disegerakan itu berada dalam kekuasaan dan kemampuanku niscaya akan selesai urusan antara aku dan kalian ini. لَقُضِىَ الْأَمْرُ بَيْنِى وَبَيْنَكُمْ ۗ (tentu telah diselesaikan Allah urusan yang ada antara aku dan kamu) Yakni kalaulah azab yang kalian minta untuk disegerakan itu berada ditanganku niscaya aku telah menurunkan azab itu kepada kalian, dan pada saat itu selesailah urusan diantara kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58 Katakanlah kepada mereka: “Kalau sekiranya aku mempunyai kuasa untuk menurunkan azab yang kamu minta supaya disegerakan itu, maka aku akan menurunkan azab itu untuk kalian, tentu Allah telah memberi keputusan atas urusan yang ada antara aku dan kalian. Dan Allah Maha mengetahui tentang orang-orang yang zalim kepada diri mereka sendiri dengan berbuat kesyirikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,”Jika ada padaku apa yang kalian inginkan untuk dipercepat, tentu selesailah perkara antara aku dan kalian.” Allah lebih mengetahui tentang orang-orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “Katakanlah” kepada orang-orang yang ingin disegerakannya azab karena, kebodohan, pengingkaran, dan kezhaliman,” kalau sekiranya ada padaku apa yang kamu minta supaya di segerakan kedatanganNya, tentu urusan yang ada padaku dan kamu telah di selesaikan Allah.” Lalu aku menimpakanya atasmu dan dalam hal itu tidak ada kebaikkan untukmu, akan tetapi perkaranya ada di tangan Allah yang Maha Bijaksana dan sabar, walaupun orang-orang yang durhaka dan berani bermaksiat kepadaNya. Dia tetap membiarkan mereka, memberi rizki kepada mereka, melimpahkan nikmat-nikmatNya kepada mereka , lahir dan batin. “ Dan Allah lebih mengetahui tentang orang-orang yang zhalim.” Tidak ada sedikitpun keadaan mereka yang samar bagiNya, dia menunda tetapi tidak lalai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 58: Maksudnya tentu Allah telah menurunkan azab kepadamu hingga kamu binasa. Akan tetapi hal itu (menimpakan azab) adalah hak Allah yang Maha Penyantun lagi Maha Sabar (Al Haliim-Ash Shabuur) meskipun manusia berbuat kufur kepada-Nya, namun Dia tetap memberikan mereka rezki, mengulang-ulang peringatan agar mereka berhenti, dan Dia menginginkan kebaikan untuk mereka. Dia mengetahui kapan mereka dihukum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 58",
    "description": "Katakanlah, wahai nabi Muhammad, seandainya ada padaku wewenang dan kekuasaan menyangkut apa, yakni azab, yang kamu minta agar disegerakan kedatangannya, tentu selesailah segala perkara antara aku dan kamu. Pasti aku akan mengabulkan permintaan kamu dengan segera menurunkan siksa karena itu memang juga menjadi keinginan setiap orang yang berkomitmen terhadap agamanya. Dan apalagi aku tidak mengetahui secara pasti siapa yang benar-benar zalim, hanya Allah-lah yang lebih mengetahui tentang orang-orang yang zalim. Pengetahuan Allah bukan hanya menyangkut siapa yang zalim seperti pada ayat sebelumnya, namun juga lebih dari itu. Dan kuncikunci semua yang gaib ada pada-Nya; tidak ada yang mengetahui secara detail dan jelas selain dia. Dia juga mengetahui segala apa yang ada di darat dan apa yang ada di laut. Bahkan, tidak ada sehelai daun pun yang gugur atau yang lebih dari itu yang tidak diketahui-Nya. Mungkin ada yang menduga pengetahuan Allah hanya menyangkut apa yang di permukaan bumi saja, itu salah, karena tidak ada sebutir biji pun dalam kegelapan bumi dan tidak pula sesuatu yang basah atau yang kering, baik yang telah, sedang, atau akan terwujud, melainkan diketahui-Nya dan tertulis dalam kitab yang nyata."
  }
]