[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan disisi Allah lah kunci-kunci perkara ghaib, yaitu perbendaharaan perkara-perkara ghaib, tidak ada yang mengetahuinya kecuali Dia saja. Diantaranya adalah pengetahuan tentang hari kiamat, (waktu) turunnya hujan,janin yang ada didalam Rahim, rizki di masa depan serta tempat kematian sesorang. Dia mengetahui semua yang ada di darat dan di laut. Dan tidaklah ada dedaunan yang gugur dari satu tanaman, kecuali Dia mengetahuinya. Dan setiap biji yang ada ditempat tersembunyi di dalam tanah,setiap Sesuatu yang basah dan kering , (semuanya) tertulis rapi dalam buku yang nyata, tidak ada kesamaran sama sekali di dalamnya,yaitu lauhil mahfuzh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Hanya di sisi Allah-lah perbendaharaan perkara gaib. Tidak ada yang mengetahuinya selain Allah. Dia Mengetahui semua makhluk yang ada di darat seperti hewan, tumbuh-tumbuhan, dan benda-benda mati. Dia juga Mengetahui segala macam hewan dan tumbuh-tumbuhan yang ada di lautan. Dan Dia juga Mengetahui setiap daun yang jatuh di mana pun adanya. Tidak ada satu biji pun yang tersembunyi di bumi, tidak ada sesuatu yang basah, dan tidak ada sesuatu yang kering melainkan sudah ditetapkan di dalam tulisan yang jelas, yaitu Loh mahfuz."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Allah menegaskan ilmu-Nya yang Maha Luas yang meliputi segalanya. Dia menciptakan seluruh alam semesta dan menetapkan hamba-hamba-Nya di sana; tidak ada sesuatu apapun yang tersembunyi dari-Nya. Dia tidak terbatas oleh tempat dan waktu, Maha Mengetahui apa yang ada di bumi dan di langit, dan di darat dan di laut -Allah mengkhususkan penyebutan darat dan laut karena keduanya adalah dua makhluk terbesar yang bersinggungan dengan manusia-. Dia Mengetahui jumlah seluruh makhluk-Nya, baik itu manusia, jin, binatang, tanaman, dan lainnya. Dia mengetahui seluruh daun yang ada di bumi dan mengetahui kapan, bagaimana, dan di mana daun itu akan jatuh; dan tidak ada bijipun melainkan Allah mengetahui kapan akan tumbuh, berapa yang akan tumbuh, dan siapa yang akan memakannya. Semua ini telah tertulis di kitab yang jelas, yaitu lauhul mahfuz."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَعِندَهُۥ مَفَاتِحُ الْغَيْبِ (Dan pada sisi Allah-lah kunci-kunci semua yang ghaib) Yakni tempat-tempat disimpannya hal-hal ghaib. Pendapat lain mengatakan maknanya adalah kunci-kunci perbendaharaan hal-hal ghaib. لَا يَعْلَمُهَآ إِلَّا هُوَ ۚ (tidak ada yang mengetahuinya kecuali Dia sendiri) Tidak ada satupun makhluk-Nya yang mengetahui hal-hal ghaib yang Dia jadikan hanya untuk-Nya. Dan ini adalah bantahan atas kebohongan-kebohongan para dukun, peramal bintang, dan lainnya yang mengaku hal-hal yang tidak mereka miliki. Diriwayatkan bahwa Rasulullah bersabda: “kunci-kunci hal ghaib ada lima, tidak ada yang mengetahuinya kecuali Allah: tidak ada yang mengetahui apa yang akan terjadi besok kecuali Allah, tidak ada yang mengetahui apa yang ada didalam rahim kecuali Allah, tidak ada yang mengetahui kapan turun hujan kecuali Allah, dan jiwa seseorang tidak mengetahui dimana dia akan mati, dan tidak seorangpun yang tau kapan terjadi kiamat”. وَيَعْلَمُ مَا فِى الْبَرِّ وَالْبَحْرِ ۚ (dan Dia mengetahui apa yang di daratan dan di lautan) Baik itu hewan-hewan maupun benda mati, dengan ilmu yang detail. وَمَا تَسْقُطُ مِن وَرَقَةٍ (dan tiada sehelai daun pun yang gugur) Dari pohonnya. إِلَّا يَعْلَمُهَا (melainkan Dia mengetahuinya) Yakni mengetahui waktu dan tempat jatuhnya. وَلَا حَبَّةٍ(dan tidak sebutir biji-pun) Yang ada. فِى ظُلُمٰتِ الْأَرْضِ (dalam kegelapan bumi) Yakni di tempat-tempat yang gelap dalam perut bumi. وَلَا رَطْبٍ وَلَا يَابِسٍ (dan tidak sesuatu yang basah atau yang kering) Meliputi segala hal yang ada. إِلَّا فِى كِتٰبٍ مُّبِينٍ(melainkan tertulis dalam kitab yang nyata) Yakni dalam lauhul mahfudz."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Melalui ayat ini dan ayat-ayat yang serupa dengannya yang menunjukkan bahwasanya segala sesuatu yang ghaib tidak ada yang mengetahuinya kecuali Allah, al-Qur'an menutup segala pintu yang menjadi wasilah seseorang untuk mengetahui ilmu ghaib selain dari wahyu Allah, dan bahwasanya ilmu itu adalah kesesatan yang nyata, dan sesungguhnya sebagian darinya dapat menjerumuskan seseorang kepada kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59 Pada sisi Allah-lah kunci-kunci segala yang ghaib, tidak ada yang mengetahuinya kecuali Allah sendiri. Dengan itu berarti telah terpatahkan dugaan para pendeta dan peramal dan lainnya. Dia Mengetahui apa yang ada di daratan dan di lautan, dan tiada sehelai daun pun yang gugur melainkan Dia mengetahuinya pula. Tidak jatuh sebutir biji-pun dalam kegelapan bumi kecuali Dia Mengetahuinya, dan tidak sesuatu yang basah atau yang kering dari berbagai benda atau makhluk kecuali Dia Mengetahuinya. Itu semua telah tertulis dalam kitab yang nyata Lauh Mahfudz, dalam pengawasan dan ilmu Allah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di sisiNya kunci-kunci semua yang gaib} perbendaharaan {tidak ada yang mengetahuinya selain Dia. Dia mengetahui apa yang ada di darat dan di laut. Tidak ada selembar daun pun yang gugur kecuali Dia mengetahuinya. Tidak ada sebutir biji pun dalam kegelapan bumi dan tidak pula sesuatu yang basah atau yang kering, melainkan dalam kitab yang nyata} di Lauhil Mahfudz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. ayat yang agung ini termasuk ayat yang terbesar yang menjelaskan ilmu Allah yang menyeluruh bahwa ia meliputi seluruh yang ghaib, yang mana sebagian darinya Dia tunjukan kepada siap yang dikehendakiNya, dan masih banyak ilmuNya yang tidak Dia ungkapkan kepada para malaikat yang dekat dan para Nabi yang di utus, lebih-lebih mhkluk selain mereka. Bahwa Dia mengetahui apa yang ada di daratan dan di temapat-temapt sepi yang mencakup biantang, pepohonan, pasir kerikil, dan debu, dan hewan yang berada di laut, berupa binatang, tambang, ikan, dan lain-lain yang dikandungi oleh airnya. “Dan tiada sehelai daunpun yang gugur” dari pohon darat, laut, kota, desa, dunia dan akhirat kecuali Dia mengetahuinya. “ Dan tidak ada sebutir bijipun yang jatuh dalam kegelapab bumi,” berupa biji-bijian, buah-buahan dan tanaman, biji yang di tanam oleh manusia, dan biji-biji tanaman di darat yang menjadi cikal tumbuh-tumbuhan, “dan tidak pula sesuatu yang basah dan juga yang kering.” Ini menyebutkan yang umum setelah yang khusus, “ melainkan tertulis di dalam kitab yang nyata.” Maksudnya, Lauh Mahfudz. Ia mencakup dan mengandungnya, dan sebagian yang di sebutkan ini mencenggangkan akal orang-orang yang berakal dan mengagumkan hati orang-orang yang mulia. Ini adalah bukti keagungan Allah Yang Maha agung dan keluasanNya dalam seluruh sifat-sifatNya, dan jika seluruh mahkluk ia dari yang pertama sampai terakhir bersatu untuk menhetahui sebagian dari sifat-sifatNya, niscaya mereka tidak memiliki daya dan kekuatan untuk itu. Maka Mahasuci Allah Yang Mahaagung, Mahaluas, Maha Mengetahui, Maha Terpuji, Mahamulia, Maha Menyaksikan dan Maha Meliputi. Alangkah mulianya Dia sebagai Tuhan, yang atidak ada seorang pun yang mampu menghitung pujianNya, akan tetapi Dia sebagaimana yang di pujikan uuntukNya. Ayat ini menunjukan ilmuNya yang meliputi segala sesuatu dan kitabNya yang mencakup seluruh peristiwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 59: Ayat ini termasuk ayat yang paling agung yang menerangkan lebih jelas tentang ilmu-Nya yang meliputi segala sesuatu; secara garis besar maupun terperinci. Lihat pula Surah Lukman ayat 34."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 59",
    "description": "Pengetahuan Allah bukan hanya menyangkut siapa yang zalim seperti pada ayat sebelumnya, namun juga lebih dari itu. Dan kuncikunci semua yang gaib ada pada-Nya; tidak ada yang mengetahui secara detail dan jelas selain dia. Dia juga mengetahui segala apa yang ada di darat dan apa yang ada di laut. Bahkan, tidak ada sehelai daun pun yang gugur atau yang lebih dari itu yang tidak diketahui-Nya. Mungkin ada yang menduga pengetahuan Allah hanya menyangkut apa yang di permukaan bumi saja, itu salah, karena tidak ada sebutir biji pun dalam kegelapan bumi dan tidak pula sesuatu yang basah atau yang kering, baik yang telah, sedang, atau akan terwujud, melainkan diketahui-Nya dan tertulis dalam kitab yang nyata. Di antara yang gaib adalah kematian dan kebangkitan. Melalui ayat ini Allah menegaskan tentang hal itu. Dan dialah yang mewafatkanmu, yaitu menidurkan kamu, pada malam hari dengan menahan rohmu dan kamu tidak mampu melakukan apa pun, dan dia juga mengetahui apa yang kamu kerjakan pada siang hari meskipun mungkin ada yang kamu rahasiakan dari manusia, kemudian dia membangkitkanmu, yaitu membangunkan kamu, pada siang hari untuk disempurnakan batas waktu yaitu umurmu yang telah ditetapkan. Kemudian kepada-Nya, bukan kepada selain-Nya, tempat kamu kembali yaitu melalui pintu kematian, lalu dia memberitahukan kepadamu apa yang telah kamu kerjakan ketika kamu hidup di dunia. Kemudian dia akan memberikan balasan setimpal atas setiap perbuatanmu."
  }
]