[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia lah Allah yang mencabut ruh-ruh kalian di malam hari dengan cara yang menyerupai terabutnya nyawa-nyawa dalam kematian. Dan Dia mengetahui apa yang kalian usahakan di siang hari dari perkerjaan-pekerjaan, kemudian Dia mengembalikan ruh-ruh kalian ke jasad-jasad kalian ketika terjaga dari tidur di siang harinya dengan kondisi yang menyerupai orang-orang yang hidup setelah kematian, untuk disempurnakan ajal-ajal kalian yang telah ditentukan di dunia. Kemudian kepada Allah lah tempat kembali kalian setelah di bangkitkan dari kubur-kubur kalian dalam keadaan hidup, lalu Dia mengabarkan kepada kalian apa saja yang telah kalian kerjakan dalam kehidupan dunia kalian kemudia Dia akan memberikan balasan kepada kalian karena hal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan Allah-lah yang menggenggam nyawa kalian untuk sementara waktu ketika kalian sedang tidur. Dan Dia lah yang mengetahui apa yang kalian perbuat di siang hari ketika kalian sedang beraktivitas. Kemudian Dia membangkitkan kalian di siang hari setelah Dia menggenggam nyawa kalian dengan cara menidurkan kalian agar kalian melakukan pekerjaan kalian sampai akhir hayat kalian yang telah ditetapkan batasnya di sisi Allah. Kemudian hanya kepada-Nya kalian semua akan dikembalikan dengan dibangkitkan dari kubur kalian kelak pada hari Kiamat. Lantas Dia akan memberitahu kalian tentang apa yang telah kalian perbuat selama hidup kalian di dunia. Dan Dia akan memberi kalian balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Allah menjelaskan bukti atas kekuasaan dan ilmu-Nya. Dialah yang mencabut roh-roh dari diri kalian kemudian mengembalikannya dengan kekuasaan-Nya, untuk membangkitkan kalian kembali pada siang hari, sehingga kalian dapat bangun dan berdiri untuk bekerja dan mencari rezeki. Dia Maha Mengetahui apa yang kalian lakukan ketika bekerja dan mencari rezeki baik itu yang baik maupun yang buruk. Hal ini agar setiap orang menyempurnakan ajal yang telah Allah tentukan baginya dalam ilmu ghaib-Nya; kemudian mereka akan dikembalikan kepada-Nya pada hari akhir untuk membalas mereka dan memberitahukan apa yang telah mereka lakukan. Jika Allah menangguhkan siksaan orang-orang kafir di dunia, maka itu bukanlah karena kelalaian dari-Nya, namun itu karena agar semua orang mendapatkan rezeki yang telah ditetapkan baginya selama di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَهُوَ الَّذِى يَتَوَفَّىٰكُم بِالَّيْلِ (Dan Dialah yang menidurkan kamu di malam hari) Yakni menidurkan didalamnya, dengan mengambil jiwa kalian yang menjadi pembeda antara yang mati dan yang hidup. وَيَعْلَمُ مَا جَرَحْتُم بِالنَّهَارِ (dan Dia mengetahui apa yang kamu kerjakan di siang hari) Yakni yang kalian kerjakan dengan anggota badan kalian baik itu perbuatan baik atau buruk. ثُمَّ يَبْعَثُكُمْ فِيهِ(kemudian Dia membangunkan kamu pada siang hari) Yakni bangun pada siang hari. لِيُقْضَىٰٓ أَجَلٌ مُّسَمًّى ۖ (untuk disempurnakan ajal(mu) yang telah ditentukan) Yakni ditentukan bagi setiap hamba-Nya kehidupan dan rezeki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60 Dan Dialah Allah Yang menidurkan kamu di malam hari, sehingga kalian tidak bisa membedakan atau berbuat sesuatu dengan sadar, semua anggota tubuh istirahat dari segala tugasnya, itulah yang dimaksud dengan kematian. Dia juga mengetahui apa yang kamu kerjakan di siang hari, baik ataupun buruk, kemudian Dia membangunkan kamu pada siang hari untuk dijalankan ketetapan umurmu yang telah ditentukan. Kemudian kepada Allah-lah kamu akan kembali setelah kematian, lalu Dia memberitahukan kepadamu apa yang dahulu kamu kerjakan di dunia, kemudian akan memberi balasan dengan kebaikan atau keburukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang menidurkan kalian pada malam hari} menggenggam ruh kalian ketika kalian tidur pada malam hari {dan Dia mengetahui apa yang kalian kerjakan} kalian usahakan {pada siang hari. Kemudian Dia membangunkan kalian pada waktu itu} membangunkan kalian pada siang hari {untuk disempurnakan waktu yang telah ditetapkan} untuk disempurnakan masing-masing manusia sisa kehidupannya {Kemudian kepadaNya tempat kalian kembali, lalu Dia memberitahukan} memberitahukan kepada kalian {tentang apa yang telah kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Semua ini adalah penetapan uluhiyah Allah, bantahan kepada orang-orang musrik, dan keterangan bahwa Dialah yang berhak untuk di cintai, dihormati, dimuliakan, dan diagungkan. 60. Dia memberitakan bahwa hanya Dialah yang mengataur hamba-hambaNya pada waktu mereka bangun dan tidur, bahwa Dia mewafatkan mereka di malam hari dalam arti menidurkan,gerakan mereka berhenti dan badan mereka beristirahat. Dia membangunkan mereka dari tidur agar bisa beraktifitas demi kemaslahatan dunia dan agama. Dia mengetahui amal-amal yang mereka lakukan. Begitulah Allahbmengatur mereka sampaiajal mereka sempurna, Dia mengatur itu dalam ajal yang di tentukan, yaitu waktu yang ditentukan dan ajal yang lain setelah itut, yaitu kebagkitan sesudah kematian. Oleh karena itu, dia berfiman, “ Kemudian kepada Allah-lah kamu kembali,” bukan kepada selianNya. “ Lalu dia memberitahukan kepadamu apa yang dahulu kamu kerjakan,” baik dan buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 60: Ayat ini memperkuat uluhiyyah Allah (keberhakan Allah untuk diibadati), menegakkan hujjah terhadap orang-orang musyrik, menerangkan bahwa Allah Ta'ala yang berhak dicintai dan diagungkan, dita'zimkan dan dimuliakan. Allah mengabarkan, bahwa hanya Dia yang satu-satunya mengurus hamba-hamba-Nya ketika mereka jaga maupun tidur, Dia menidurkan mereka di malam hari agar gerakan mereka berhenti dan badan mereka dapat beristirahat, Dia pula yang membangunkan mereka kembali agar mereka dapat berusaha untuk hal yang bermaslahat bagi mereka baik terkait dengan agama maupun dunia, Dia mengetahui apa yang mereka kerjakan tersebut. Dia senantiasa melakukan demikian terhadap hamba-hamba-Nya sampai tiba ajal mereka; ajal hidup mereka di dunia dan ajal (waktu) mereka akan dibangkitkan. Dengan memegang ruh kamu ketika tidur. Mengembalikan ruhmu. Kamu ditidurkan di malam hari dan dibangunkan di siang hari, agar berlangsung perputaran waktu itu sehingga habis umurmu dan tiba ajal yang telah ditentukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 60",
    "description": "Di antara yang gaib adalah kematian dan kebangkitan. Melalui ayat ini Allah menegaskan tentang hal itu. Dan dialah yang mewafatkanmu, yaitu menidurkan kamu, pada malam hari dengan menahan rohmu dan kamu tidak mampu melakukan apa pun, dan dia juga mengetahui apa yang kamu kerjakan pada siang hari meskipun mungkin ada yang kamu rahasiakan dari manusia, kemudian dia membangkitkanmu, yaitu membangunkan kamu, pada siang hari untuk disempurnakan batas waktu yaitu umurmu yang telah ditetapkan. Kemudian kepada-Nya, bukan kepada selain-Nya, tempat kamu kembali yaitu melalui pintu kematian, lalu dia memberitahukan kepadamu apa yang telah kamu kerjakan ketika kamu hidup di dunia. Kemudian dia akan memberikan balasan setimpal atas setiap perbuatanmu. Jangan menduga kekuasaan Allah hanya seperti yang disebutkan pada ayat di atas. Dan dialah penguasa mutlak atas semua hamba-Nya, dan diutus-Nya kepadamu, wahai manusia, malaikat-malaikat yang berfungsi sebagai penjaga, sehingga apabila kematian datang kepada salah seorang di antara kamu, dan itu berarti usai sudah tugas malaikat penjaga tersebut, maka utusan-utusan kami, yaitu malaikat-malaikat, mencabut nyawanya, dan mereka, yakni para malaikat tersebut, tidak akan pernah melalaikan tugasnya (lihat: surah at-tahrim/6: 66)."
  }
]