[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah ,Dia lah yang memiliki kekuasaan tertinggi di atas semua hamba-hambaNya , dengan ketinggian secara mutlak dari segala aspek, yang layak dengan keagungan Allah . Tiap-tiap makhluk tunduk terhadap kemulian dan keagunganNya.Dan Dia mengutus kepada para hambaNYa malaikat-malaikat yang menjaga amal perbuatan mereka dan menghitungnya, hingga ketika kematian mendatangi salah seorang dari mereka, maka malaikat maut dan para pendampingnya mencabut ruhnya, sedang mereka tidak menyia-nyiakan perintah yang menjadi tugas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dia lah Tuhan Yang Maha Menang terhadap hamba-hamba-Nya serta Żāt yang menundukkan mereka. Mahatinggi dari mereka dalam segala hal dan segala sesuatu tunduk kepada-Nya. Dia berada di atas hamba-hamba-Nya dalam bentuk yang sesuai dengan keagungan-Nya -Subḥānahu wa Ta'ālā-. Dia mengirimkan kepada kalian -wahai manusia- para malaikat mulia yang bertugas mencatat amal perbuatan kalian sampai akhir hayat kalian, yang malaikat maut dan teman-temannya mencabut nyawa kalian. Sedangkan malaikat maut dan teman-temannya tidak pernah lalai dalam melaksanakan apa yang diperintahkan kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Allah Maha Perkasa atas semua hamba-Nya. Dia Maha Besar dan Maha Kuat, semua makhluk tunduk kepada kebesaran dan kekuatan-Nya. Allah mengutus para malaikat yang taat kepada para hamba-Nya untuk menulis dan menghitung amal perbuatan mereka; dan apabila ajal hamba-hamba itu telah sampai pada batasnya, para malaikat itu ditugaskan untuk mencabut nyawa mereka dan mengembalikannya kepada Kami. Para malaikat tersebut diperintahkan untuk mentaati perintah-perintah Allah, mereka tidak lalai dan tidak pernah meninggalkan apa yang telah diperintahkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61 وَهُوَ الْقَاهِرُ فَوْقَ عِبَادِهِۦ ۖ (Dan Dialah yang mempunyai kekuasaan tertinggi di atas semua hamba-Nya) Yakni yang berkuasa atas urusan hamba-hamba-Nya. وَيُرْسِلُ عَلَيْكُمْ حَفَظَةً (dan diutus-Nya kepadamu malaikat-malaikat penjaga) Yakni Allah menjadikan malaikat-malaikat sebagai penjaga kalian dari mara bahaya dan pencatat amal perbuatan kalian. حَتَّىٰٓ إِذَا جَآءَ أَحَدَكُمُ الْمَوْتُ تَوَفَّتْهُ رُسُلُنَا (sehingga apabila datang kematian kepada salah seorang di antara kamu, ia diwafatkan oleh malaikat-malaikat Kami) Mereka adalah malaikat maut dan pembantunya. Makna diwafatkan adalah diambil nyawanya. وَهُمْ لَا يُفَرِّطُونَ(dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya) Yakni tidak lalai dan lengah dari apa yang diperintahkan kepada mereka dalam hal memuliakan atau menghinakan hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61 Dialah Yang Maha Suci Yang mempunyai kekuasaan tertinggi di atas semua hamba-Nya, semua tunduk atas keagungan dan keluhuran-Nya. Dia Mengutus malaikat-malaikat penjaga dari mara bahaya kepadamu, dan menjaga/mengawasi kegiatan kalian, sehingga apabila datang kematian kepada salah seorang di antara kamu, ia diwafatkan melalui malaikat-malaikat Kami dengan menggenggam arwah mereka, dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya baik untuk memuliakan maupun untuk menghinakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Penguasa di atas semua hambaNya, dan Dia mengutus kepada kalian penjaga} malaikat-malaikat pengawas perbuatan kalian {sehingga apabila kematian datang kepada salah seorang di antara kalian, malaikat-malaikat Kami mencabut nyawanya, dan mereka tidak melalaikan tugasnya} mereka tidak melalaikan apa yang diperintahkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. “ Dan Dia-lah” Allah, “ yang mempunyai kekuasaan tertinggi dia atas semua hambaNya.” Dia memberlakukan IridahNya yang laus dan kehendaknya yang umum kepada mereka. Hamba-hamab itu tidak sedikitpun memiliki perkara, mereka tidak bergerak dan juga tidak diam melainkan dengan izinNya. Walaupun demikian Dia telah menugaskan para malaikat penjaga kepada hama-hambaNya yang menjaga para hamba dan menjaga apa yang di kerjakanNya, sebagaiamana firman Allah, \"Padahal sesungguhnya bagi kamu ada (malaikat-malaikat) yang mengawasi (pekerjaanmu) yang mulia (di sisi Allah) dan mencatat (pekerjaan-pekerjaanmu itu), mereka mengetahui apa yang kamu kerjakan\". (Al-Infitar:10-12) \" (yaitu) ketika dua orang malaikat mencatat amal perbuatannya, seorang duduk di sebelah kanan dan yang lain duduk di sebelah kiri.Tiada suatu ucapanpun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir.\" (Qaf:17-18). Ini adalah penjagaanNYa kepada mereka pada waktu mereka hidup. “Sehingga apabila kematian datang kepada salah seorang di antara kamu, dia diwafatkan oleh malaikat-malaikat Kami.” Yakni para malaikat yang ditugasi mencabut nyawa. “Dan malaikat-malaikat Kami itu tidak melalaikan kewajibannya” dalam hal itu, mereka tidak menambah satu saat pun yang ditakdirkan Allah, mereka tidak menguranginya dan tidak melakukan itu kecuali menurut rancangan Ilahiyah dan takdir rabbaniyyah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 61: Berlaku pada mereka iradah dan kehendak-Nya. Mereka tidaklah bergerak atau diam kecuali dengan izin-Nya. Yang menjaga kamu dan menjaga (mencatat dan menjumlahkan) amalmu. Yakni para malaikat yang ditugaskan mencabut nyawa atau malaikat maut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 61",
    "description": "Jangan menduga kekuasaan Allah hanya seperti yang disebutkan pada ayat di atas. Dan dialah penguasa mutlak atas semua hamba-Nya, dan diutus-Nya kepadamu, wahai manusia, malaikat-malaikat yang berfungsi sebagai penjaga, sehingga apabila kematian datang kepada salah seorang di antara kamu, dan itu berarti usai sudah tugas malaikat penjaga tersebut, maka utusan-utusan kami, yaitu malaikat-malaikat, mencabut nyawanya, dan mereka, yakni para malaikat tersebut, tidak akan pernah melalaikan tugasnya (lihat: surah at-tahrim/6: 66). Setelah semua menjumpai kematian dan mengalami kehidupan di alam barzakh, kemudian mereka, hamba-hamba Allah tersebut, dikembalikan kepada Allah, yakni kepada hukum dan ketetapan-Nya bahwa semua akan menerima balasan sesuai dengan amal perbuatannya ketika di dunia, karena dia adalah penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum dan segala aturan, khususnya pada hari itu, ada pada-Nya. Dan dialah pembuat perhitungan yang paling cepat. Dan tidak ada yang menandingi-Nya."
  }
]