[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian mereka yang telah mati itu akan dikembaliakn kepada Allah ,penguasa mereka yang sebenarnya. Ketahuilah, bahwa hanya milikNYa lah segala keputusan dan hukuman pada hari kiamat di antara para hambaNya. Dan Dia lah pembuat perhitungan yang paling cepat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Kemudian semua yang dicabut nyawanya akan dikembalikan kepada Allah, Pemilik sejati mereka untuk menerima balasan yang setimpal dengan amal perbuatan masing-masing. Dia lah yang berhak membuat keputusan yang sah dan vonis yang adil bagi mereka. Dan Dia adalah penghitung yang paling cepat amal perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Setelah mereka dicabut nyawanya dan mati, maka kemudian Allah mengembalikan mereka kepada-Nya untuk memberi keputusan di antara mereka; hanya Dia Pemberi Keputusan di hari kiamat, dan dia Maha cepat perhitungan-Nya, tidak perlu berpikir dan mendalami masalah sebelum memutuskan tidak sebagaimana yang dilakukan makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. ثُمَّ رُدُّوٓا۟ إِلَى اللهِ مَوْلَىٰهُمُ الْحَقِّ ۚ (Kemudian mereka (hamba Allah) dikembalikan kepada Allah, Penguasa mereka yang sebenarnya) Yakni malaikat maut mengembalikan nyawa para hamba-Nya setelah dihadapkan kepada Allah. وَهُوَ أَسْرَعُ الْحٰسِبِينَ (Dan Dialah Pembuat Perhitungan yang paling cepat) Yakni tidak butuh untuk memikirkan dan menimbang-nimbang perkara sebagaimana yang butuhkan hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62 Kemudian mereka para hamba Allah yang sudah dicabut nyawanya dikembalikan kepada Allah Sang Penguasa dan Yang Menghukumi dengan benar. Ketahuilah bahwa segala hukum pada hari itu mutlak ada pada kekuasan-Nya. Dan Dialah Pembuat Perhitungan bagi semua makhluk dalam waktu yang paling cepat, tanpa perlu berfikir dan menelaah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian mereka dikembalikan kepada Allah, Penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum hanya milikNya} ketentuan dan pasal {Dialah yang paling cepat membuat perhitungan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Kemudian” setelah kematian dan kehidupan di alam Barzakh dengan kebaikan dan keburukannya, “mereka (hamba Allah) dikembalikan kepada Allah, Penguasa mereka yang sebenarnya,” maksudnya, Dzat yang menguasai mereka dengan hukum takdirNya memberlakukan kepada mereka bermacam-macam tatanan sesuai dengan perintah dan laranganNya. Dia mengutus para Rasul kepada mereka dan menurunkan kitab-kitab lalu mereka dikembalikan kepadaNya agar Dia memutuskan balasanNya bagi mereka. Dia membalas kebaikan mereka dengan pahala dan mengazab kejahatan yang mereka kerjakan. Oleh karena itu Dia berfirman, “Ketahuilah, bahwa segala hukum (pada hari itu) adalah kepunyaanNya” semata tanpa sekutu bagiNya. “Dan Dia-lah Pembuat perhitungan yang paling cepat.” Karena kesempurnaan ilmu dan penjagaanNya terhadap amal-amal mereka sesuai dengan apa yang Dia tetapkan di Lauh al- Mahfuzh lalu dengan apa yang dicatat oleh para malaikat dalam kitab-kitab mereka. Jika Allah adalah Dzat yang sendirian dalam mencipta mengatur, Dia Mahakuasa atas hamba-hambaNya, Dia sangat memperhatikan mereka dalam segala keadaan. Dia-lah pemilik hukum takdir, hukum syar’I, dan hukum pembalasan, lalu bagaimana orang-orang musyrik membelot dari Dzat yang sifatNya demikian menuju penyembahan kepada sesuatu yang tidak memiliki sedikit pun perkara, tidak pula memiliki manfaat sedikit pun walaupun sebesar biji sawi dan tidak memiliki kemampuan dan keinginan? Demi Allah, jika mereka mengetahui kebijaksanaan Allah kepada mereka, ampunan dan rahmatNya kepada mereka sementara mereka menentangNya dengan kekufuran dan kesyirikan, mereka berani berbohong dan berdusta atas kebesaranNya namun Dia terus memberi rizki dan keselamatan kepada mereka, tentunya muncul pendorong pada diri mereka untuk mengetahuiNya, akal mereka pun larut dalam mencintaiNya, dan mereka akan marah besar terhadap diri mereka yang telah patuh kepada ajakan-ajakan setan yang mengantarkan kepada kehinaan dan kerugian, akan tetapi mereka adalah kaum yang tidak berakal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 62: Setelah mati dan menjalani hidup di alam barzakh (alam pemisah antara dunia dan akhirat). Dia berkuasa terhadap mereka dengan ketetapan qadar-Nya, berlaku pada mereka berbagai bentuk pengaturan-Nya sesuai yang dikehendaki-Nya, berkuasa terhadap mereka dengan ketetapan syar'i-Nya (berupa memerintah dan melarang), lalu mereka dikembalikan kepada Allah yang akan memberinya balasan. Oleh karena itu, segala hukum pada hari itu ada pada-Nya saja, dan Dia amat cepat hisabnya karena sempurnanya ilmu-Nya, penjagaan-Nya terhadap amal mereka sesuai yang ditetapkan dalam Al Lauhul Mahfuzh lalu diperkuat dengan apa yang dicatat oleh para malaikat-Nya. Jika demikian keadaan Allah, lalu bagaimana orang-orang musyrik berpaling dari-Nya dan malah beribadah kepada sesembahan yang tidak menguasai apa-apa, tidak mampu memberikan manfaat atau menolak bahaya dan tidak memiliki kemampuan apa-apa? Sekiranya mereka mengetahui santunnya Allah kepada mereka, maaf dan rahmat-Nya, sedang mereka menghadapinya dengan syirk dan kekufuran, berani berkata dusta terhadap Allah, namun Dia tidak segera menghukum mereka dan tetap memberi rezki mereka, bahkan mengajak mereka bertobat padahal Dia berkuasa menyiksa mereka segera, tentu mereka akan cinta kepada-Nya, mereka akan marah kepada diri mereka sendiri karena tunduk kepada seruan setan yang sesungguhnya membuat mereka hina dan rugi, namun sayang mereka tidak mengerti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 62",
    "description": "Setelah semua menjumpai kematian dan mengalami kehidupan di alam barzakh, kemudian mereka, hamba-hamba Allah tersebut, dikembalikan kepada Allah, yakni kepada hukum dan ketetapan-Nya bahwa semua akan menerima balasan sesuai dengan amal perbuatannya ketika di dunia, karena dia adalah penguasa mereka yang sebenarnya. Ketahuilah bahwa segala hukum dan segala aturan, khususnya pada hari itu, ada pada-Nya. Dan dialah pembuat perhitungan yang paling cepat. Dan tidak ada yang menandingi-Nya. Keluasan ilmu Allah telah dijelaskan, kekuasaan Allah yang mutlak telah dipaparkan, kini dijelaskan tentang salah satu sifat negatif manusia yaitu merasa membutuhkan Allah pada saat terdesak. Katakanlah, wahai nabi Muhammad, siapakah yang dapat menyelamatkan kamu dari kegelapan-kegelapan, yaitu aneka bencana, di darat dan di laut, yang mana saat kejadian itu kamu berdoa secara tulus kepada-Nya dengan rendah hati yaitu menunjukkan dirimu sebagai orang yang amat membutuhkan pertolongan dan dengan suara yang lembut sehingga menimbulkan rasa iba bagi yang mendengarnya, dengan mengatakan secara sungguhsungguh yang dikuatkan dengan janji, 'sekiranya dia menyelamatkan kami dari bencana ini, tentulah kami menjadi orang-orang yang benarbenar mantap bersyukur' itulah tabiat manusia khususnya yang durhaka. Pada saat tertimpa kesulitan yang mengancam keselamatan jiwanya, janji taat kepada Allah pun diucapkan. Namun pada saat situasi kembali normal, maka kedurhakaan pun berulang."
  }
]