[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, “siapakah yang akan menyelamatkan kalian dari rasa ketakuatan yang muncul akibat kezaliman-kezaliman yang ada di darat dan laut? Bukankah Dia adalah Allah yang kalian seru dengan doa dalam kondisi-kondisi sulit dengan penuh kerendahan diri, baik dengan suara keras dan lirih?” kalian mengatakan, “jika tuhan kami berkenan menyelamatkan kami dari bahaya-bahya ini, pastilah kami akan termasuk orang-orang yang bersyukur dengan cara hanya beribadah hanya kepadaNYa , tidak menyekutukanNYa dengan apapun.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Katakanlah -wahai Rasul- kepada orang-orang musyrik itu, “Siapakah yang dapat menyelamatkan kalian ketika kalian menghadapi berbagai bencana di tengah gelapnya daratan dan lautan, yang kalian memanjatkan doa hanya kepada-Nya seraya merendahkan dan menundukkan diri kepada-Nya secara lahir dan batin, ‘Sungguh, jika Rabb kami menyelamatkan kami dari bencana-bencana ini, pasti kami akan mensyukuri nikmat-nikmat yang Dia berikan kepada kami dengan tidak menyembah selain Dia’.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Hai Rasulallah, katakanlah kepada orang-orang musyrik: \"Siapakah yang akan menyelamatkan kalian jika salah seorang dari kalian tersesat di padang yang luas kemudian datang waktu malam, atau ketika seorang dari kalian menaiki kapal kemudian ombak besar menerpanya di tengah kegelapan malam, sehingga dia ditimpa ketakutan dan kecemasan; Kepada siapakah dia akan berdoa dan memohon pertolongan? Fitrah manusia akan mendorongnya untuk menghadap Allah yang telah menciptakannya dan menyempurnakan bentuknya, sehingga ketika itu dia akan berdoa kepada Allah dengan penuh ketundukan dan ketakutan baik itu secara sembunyi-sembunyi atau terang-terangan dengan berucap: \"Jika Engkau menyelamatkanku dari kesulitan dan kebinasaan ini niscaya aku akan termasuk orang-orang yang bersyukur kepada Engkau\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قُلْ مَن يُنَجِّيكُم مِّن ظُلُمٰتِ الْبَرِّ وَالْبَحْرِ (Katakanlah: “Siapakah yang dapat menyelamatkan kamu dari kegelapan di darat dan di laut) Yakni dari kerasnya bencana di darat dan laut. Siapakah yang mampu menyelamatkan kalian dari keadaan tersebut, saat kalian berdoa momohon kepada-Nya dengan penuh ketundukan. لَّئِنْ أَنجَىٰنَا (jika Dia menyelamatkan kami) Mereka berdoa jika Engkau menyelamatkan kami. مِنْ هٰذِهِۦ (dari hal ini) Dari bencana yang besar yang menimpa kami. لَنَكُونَنَّ مِنَ الشّٰكِرِينَ (tentulah kami menjadi orang-orang yang bersyukur) Yakni bersyukur kepada-Mu atas pertolongan-Mu dari bencana ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63 Katakanlah kepada orang-orang musyrik wahai Nabi: “Siapakah yang dapat menyelamatkan kamu dari bencana di darat dan di laut jika kalian telah menghadapinya? Kalian berdoa kepada-Nya dengan rendah diri dan dengan suara yang lembut seraya mengatakan: “Sesungguhnya jika Dia menyelamatkan kami dari bencana yang diturunkan kepada kami ini, tentulah kami menjadi orang-orang yang bersyukur atas nikmat-Mu kepada kami.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Siapakah yang menyelamatkan kalian dari kegelapan} kesulitan dan kengerian {di darat dan di laut. Kalian berdoa kepadaNya dengan rendah hati dan dengan suara yang lembut} doa dengan merendahkan diri secara keras maupun pelan {Sungguh jika Dia menyelamatkan kami dari ini, maka kami benar-benar menjadi orang-orang yang bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “Katakanlah” kepada orang-orang musyrik yang menyembah tuhan-tuhan lain bersama Allah demi menggiring mereka dari tauhid rububiyah yang telah mereka tetapkan kepada tauhid uluhiyah yang mereka ingkari, “Siapakah yang dapat menyelamatkanmu dari bencana di darat dan laut?” maksudnya, kesulitan dan kesengsaraan pada keduanya pada saat jalan keselamatan tertutup atau tersumbat bagimu lalu kamu berdoa kepada tuhanmu dengan rendah diri, hati yang tunduk dan lisan yang terus menerus mengucapkan hajatnya di dalam doa. Kamu berkata di dalam kondisi itu, “Sungguh jika Dia menyelamatkan kami dari (bencana) ini,” maksudnya, dari kesulitan yang menimpa kami ini, “tentulah kami menjadi orang-orang yang bersyukur” kepada Allah, yakni mengakui nikmat-nikmatNya, meletakannya pada jalan ketaatan dan menjaganya dengan tidak meletakkan pada kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 63: Kepada orang-orang musyrik yang menyembah selain-Nya, padahal mereka mengetahui rububiyyah (pengaturan) Alah terhadap alam semesta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 63",
    "description": "Keluasan ilmu Allah telah dijelaskan, kekuasaan Allah yang mutlak telah dipaparkan, kini dijelaskan tentang salah satu sifat negatif manusia yaitu merasa membutuhkan Allah pada saat terdesak. Katakanlah, wahai nabi Muhammad, siapakah yang dapat menyelamatkan kamu dari kegelapan-kegelapan, yaitu aneka bencana, di darat dan di laut, yang mana saat kejadian itu kamu berdoa secara tulus kepada-Nya dengan rendah hati yaitu menunjukkan dirimu sebagai orang yang amat membutuhkan pertolongan dan dengan suara yang lembut sehingga menimbulkan rasa iba bagi yang mendengarnya, dengan mengatakan secara sungguhsungguh yang dikuatkan dengan janji, 'sekiranya dia menyelamatkan kami dari bencana ini, tentulah kami menjadi orang-orang yang benarbenar mantap bersyukur' itulah tabiat manusia khususnya yang durhaka. Pada saat tertimpa kesulitan yang mengancam keselamatan jiwanya, janji taat kepada Allah pun diucapkan. Namun pada saat situasi kembali normal, maka kedurhakaan pun berulang. Allah maha mengetahui realitas hidup manusia, termasuk yang diselamatkan dari keadaan yang mengancam jiwanya, di mana pada akhirnya janji-janji itu dilupakan. Katakanlah, wahai nabi Muhammad, Allah yang menyelamatkan kamu dari bencana itu dan dari segala macam kesusahan, namun kemudian kamu kembali mempersekutukan-Nya. Sungguh buruk perilaku manusia itu. Mereka sendiri yang berjanji untuk taat kepada Allah, dan mereka sendiri pula yang mengingkarinya."
  }
]