[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka (wahai rasul), ”hanya Allah lah semata yang mampu menyelamatkan kalian dari marabahaya tersebut dan dari segala kesulitan. Namun setelah itu, kalian menyekutukan Nya dalam ibadah dengan selainNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Katakanlah -wahai Rasul-, “Allah-lah yang dapat menyelamatkan kalian dari bencana-bencana itu dan membebaskan kalian dari segala macam kesulitan. Tetapi setelah itu kalian menyekutukan-Nya dengan yang lain di kala jaya. Adakah kezaliman yang lebih besar dari kezaliman yang kalian lakukan?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Hai Rasulallah, katakanlah kepada mereka sebagai jawaban dari pertanyaan 'Siapakah yang akan menyelamatkan kalian?' Allah-lah yang akan menyelamatkan kalian dari kebinasaan yang akan menimpa kalian itu, dan dari segala kesulitan dan musibah, akan tetapi kalian tetap saja menyekutukan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64 قُلِ اللهُ يُنَجِّيكُم مِّنْهَا (Katakanlah: “Allah menyelamatkan kamu dari bencana itu) Yakni dari bencana yang besar tersebut. وَمِن كُلِّ كَرْبٍ (dan dari segala macam kesusahan) Makna (الكرب) yakni duka cita yang menyelimuti jiwa. ثُمَّ أَنتُمْ تُشْرِكُونَ (kemudian kamu kembali mempersekutukan-Nya) Setelah Allah berbuat baik kepada kalian dengan menyelamatkan kalian dari bencana dan duka cita. Sedangkan sekutu-sekutu kalian tidak dapat memberi kalian manfaat, lalu bagaimana kalian bisa menempatkan kesyirikan ini ditempat rasa syukur yang kalian janjikan untuk kalian lakukan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64 Katakanlah kepada mereka wahai Nabi: “Hanya Allahlah Yang menyelamatkan kamu dari bencana (kedzaliman) dan dari segala khayalan serta duka. Namun setelah itu kamu kembali mempersekutukan-Nya dengan menyembah selain Allah. Setelah kalian diberi anugerah. Bahkan sesembahan kalian itu tidak mampu memberi manfaat atau bahaya sedikitpun”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah ,“Allah yang menyelamatkan kalian dari itu dan dari segala macam kesusahan. Kemudian kalian menyekutukanNya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Katakanlah, ‘Allah menyelamatkan kamu dari bencana itu dan dari segala macam kesusahan’ .” yakni dari bencana ini secara khusus dan dari bencana-bencana yang lain secara umum. “Kemudian kamu kembali mempersekutukanNYa.” Kamu tidak menepati janjimu kepada Allah, dan melupakan nikmat-nikmatNya atasmu. Bukti mana yang lebih jelas daripada ini atas kebenaran tauhid dan kebatilan syirik?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 64",
    "description": "Allah maha mengetahui realitas hidup manusia, termasuk yang diselamatkan dari keadaan yang mengancam jiwanya, di mana pada akhirnya janji-janji itu dilupakan. Katakanlah, wahai nabi Muhammad, Allah yang menyelamatkan kamu dari bencana itu dan dari segala macam kesusahan, namun kemudian kamu kembali mempersekutukan-Nya. Sungguh buruk perilaku manusia itu. Mereka sendiri yang berjanji untuk taat kepada Allah, dan mereka sendiri pula yang mengingkarinyasebagaimana Allah mahakuasa menyelamatkan manusia dari bencana, Allah pun mahakuasa menimpakan bencana kepada siapa yang dikehendaki-Nya. Katakanlah, wahai nabi Muhammad, wahai para pendurhaka, jangan kalian merasa aman dari siksa Allah, karena dialah yang berkuasa mengirimkan azab yang amat pedih kepadamu. Azab itu bisa datang dari atas seperti badai topan, kilat yang menyambar, atau dari bawah kakimu seperti gempa dan banjir bandang, atau dapat juga berupa dia mencampurkan kamu yakni memecah belah masyarakat kamu ke dalam golongan-golongan yang saling bertentangan dan saling bermusuhan sehingga merasakan kepada sebagian kamu keganasan sebagian yang lain. Maka perhatikanlah, bagaimana kami menjelaskan dengan berbagai cara dan juga secara berulang-ulang tanda-tanda kekuasaan kami agar mereka memahami-Nya. Dan ternyata kaummu, wahai nabi Muhammad, baik yang hidup pada masamu maupun sesudahnya, mendustakannya, yakni mendustakan azab, padahal azab itu benar adanya. Katakanlah, hai nabi Muhammad, kalau kalian memang tetap durhaka kepada Allah, ketahuilah bahwa aku ini bukanlah penanggung jawab kamu yang dapat membela kamu ketika azab itu datang."
  }
]