[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), “Allah semata yang Mahakuasa mengirim kepada kalian siksaan dari arah atas kalian,seperti hujan batu, angin topan ,dan siksaan yang lain serupa dengannya, atau dari arah bawah kalian, dengan gempa bumi dan tertelan perut bumi, atau mengacaukan urusan kalian sehingga kalian terkotak-kotak dalam golongan-golongan yang saling berseteru, sebagian kalian membunuh sebagian lainnya.” perhatikanlah (wahai rasul) bagaimana kami memvariasikan hujjah-hujjah kami yang jelas ini bagi kaum musyrikin agar mereka dapat memahami dan mengambil pembelajaran?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Katakanlah -wahai Rasul- kepada mereka, “Allah-lah yang sanggup mengirimkan kepada kalian azab dari atas seperti batu, halilintar, dan banjir bandang, atau dari bawah seperti gempa bumi, atau tanah amblas, atau membuat kalian berselisih paham sehingga masing-masing orang mengikuti seleranya sendiri-sendiri, hingga saling serang satu sama lain.” Renungkanlah wahai Rasul! bagaimana Kami memberikan dan menjelaskan dalil-dalil serta bukti-bukti yang beraneka ragam kepada mereka agar mereka yakin bahwa agama yang kamu bawa adalah agama yang benar, dan agama yang mereka anut adalah agama yang batil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Hai Rasulallah, katakanlah kepada orang-orang yang berdoa dan tunduk kepada Allah namun kemudian menyekutukan-Nya: \"Sesungguhnya Allah berkuasa untuk mengirim azab dari langit bagi kalian dengan mengirim kalian hujan batu, banjir bandang, angin, atau suara yang sangat keras; atau mengirim azab dari bawah kaki kalian dengan mengirim likuifaksi, gempa bumi, atau memecah-belah kalian menjadi banyak golongan sehingga kalian saling membunuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. قُلْ هُوَ الْقَادِرُ عَلَىٰٓ أَن يَبْعَثَ عَلَيْكُمْ عَذَابًا (Katakanlah: “Dialah yang berkuasa untuk mengirimkan azab kepadamu) Yakni dari setiap arah. مِّن فَوْقِكُمْ(dari atas kamu) Yakni berupa azab yang turun dari langit seperti hujan batu es dan badai petir. أَوْ مِن تَحْتِ أَرْجُلِكُمْ (atau dari bawah kakimu) Berupa ditenggelamkan kedalam tanah, gempa bumi, dan ternggelam. أَوْ يَلْبِسَكُمْ شِيَعًا (atau Dia mencampurkan kamu dalam golongan-golongan) Menjadikan kalian berbeda beda dalam kemauan dan pandangan, sehingga menjadi golongan-golongan yang saling memerangi satu sama lain. وَيُذِيقَ بَعْضَكُم بَأْسَ بَعْضٍ ۗ( dan merasakan kepada sebahagian kamu keganasan sebahagian yang lain) Dengan pembunuhan, penawanan, dan penculikan. انظُرْ كَيْفَ نُصَرِّفُ الْءَايٰتِ(Perhatikanlah, betapa Kami mendatangkan tanda-tanda kebesaran Kami silih berganti) Kami menjelaskan kepada mereka hujjah-hujjah dan bukti-bukti dengan berbagai cara. لَعَلَّهُمْ يَفْقَهُونَ(agar mereka memahami(nya)) Yakni memahami kebenaran, sehingga mereka kembali kepada kebenaran itu yang telah Kami jelaskan kepada mereka dengan berbagai cara. Dikeluarkan oleh Imam Muslim dan Imam Ahmad dari Sa’ad bin Abi Waqqash bahwa Rasulullah berdoa kepada Tuhannya dengan doa yang panjang kemudian beliau mendatangi kami seraya bersabda: “aku meminta Tuhanku tiga hal, mengabulkan dua diantaranya dan menolak yang satu lagi. Aku meminta-Nya agar tidak membinasakan umatku dengan musibah tenggelam, dan Aku meminta-Nya agar tidak membinasakan umatku dengan musibah paceklik, lalu Allah mengabulkan keduanya. Dan aku memintanya agar tidak menjadikan kebinasaan umatku karena perselisihan diantara mereka, tapi Allah tidak mengabulkannya”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65 Katakan juga kepada mereka: “Dialah yang berkuasa untuk mengirimkan azab kepadamu dari segala arah, dari atas dengan hujan dan petir, atau dari bawah kakimu dengan penenggelaman, pelenyapan, goncangan dan lainnya. Atau Dia mencampurkan kamu dalam golongan-golongan yang saling bertentangan sehingga saling membunuh. Atau menimpakan kepada sebagian kamu keganasan kelompok lain berupa peperangan/pembunuhan, menyakiti, pembangkangan atau perampokan. Perhatikanlah, betapa Kami telah banyak mendatangkan tanda-tanda kebesaran dan kekuasaan Kami silih berganti agar mereka memahami kebenaran, serta agar mereka keluar dari kebatilan”. Sudah banyak diketahui bahwa Nabi meminta kepada Allah tiga hal, maka dikabulkan dua hal. Yaitu agar Allah tidak membinasakan ummat Nabi dengan penenggelaman serta sannah. Namun yang ketiga untuk tidak menjadikan kerusakan di antara para ummat ini tidak dikabulkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Dialah Yang Maha kuasa mengirimkan azab kepada kalian dari atas atau dari bawah kakimu atau Dia memecah belah kalian menjadi golongan-golongan} memecah kalian menjadi golongan-golongan yang berselisih atas keinginan yang berbeda {dan merasakan kepada sebagian kalian siksaan sebagian yang lain} membuat sebagian berkuasa atas sebagian lain dengan membunuh dan menyiksa {Perhatikanlah bagaimana Kami menjelaskan} merincikan {ayat-ayat agar mereka memahami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Allah mampu mengirimkan azab kepadamu dari segala penjuru, “dari atasmu atau dari bawah kakimu atau Dia mencampurkan kamu dalam golongan-golongan (yang saling bertentangan) dan merasakan kepada sebagian kamu keganasan sebagian yang lain.” Maksudnya, memasukkanmu dalam fitnah, sebagian darimu membunuh sebagian yang lain. Dia berkuasa atas semua itu, maka waspadalah jika kamu bermakasiat, karena dengan itu kamu tertimpa siksa yang menghancurkan dan membinasakanmu. Walaupun demikian, Dia tetap menyampaikan, bahwa Dia mampu melakukannya, akan tetapi Dia mengangkat azab dari umat ini dari atasnya disebabkan rahmatNya dalam bentuk hujan batu dan sejenisnya, dan dari bawah kaki mereka dalam bentuk penenggelaman, akan tetapi Dia menghukum orang yang menganiaya orang lain, dengan cara menimpakan penindasan sebagian orang kepada sebagian yang lain sebagai hukuman yang disegerakan di mana orang-orang yang mengambil pelajaran dapat melihatnya dan orang-orang yang melakukannya merasakannya. “Perhatikanlah, bagaimana Kami mendatangkan tanda-tanda kebesaran Kami silih berganti.” Maksudnya, Kami mendatangkannya dalam berbagai jenis dan menghadirkannya dalam bermacam-macam bentuk, seluruhnya menunjukkan kebenaran. “Agar mereka memahami (nya).” Yakni memahami hakikat-hakikat syariat dan tuntutan-tuntutan ilahi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 65: Azab yang datang dari atas seperti hujan batu, petir dan lain lain, sedangkan yang datang dari bawah seperti gempa bumi, tanah longsor, banjir dan sebagainya. Hal ini menghendaki mereka agar waspada terhadap sikap bermaksiat kepada-Nya karena Allah berkuasa menyiksa mereka kapan saja dan dari mana saja arahnya. Dengan adanya peperangan, dan inilah yang paling ringannya. Maksudnya adalah Allah Subhaanahu wa Ta'aala menunjukkan tanda-tanda kebesaran-Nya dalam berbagai rupa dengan cara yang berganti-ganti yang menunjukkan kebenarannya. Adapula yang mengartikan ayat di sini dengan ayat-ayat Al-Quran yang berarti bahwa ayat Al-Quran itu diturunkan ada yang berupa berita gembira, ada yang berupa peringatan, kisah-kisah, hukum-hukum dan lain-lain, di mana semua itu menunjukkan kebenarannya. Yakni menyadari bahwa apa yang mereka pegang selama ini adalah batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 65",
    "description": "Sebagaimana Allah mahakuasa menyelamatkan manusia dari bencana, Allah pun mahakuasa menimpakan bencana kepada siapa yang dikehendaki-Nya. Katakanlah, wahai nabi Muhammad, wahai para pendurhaka, jangan kalian merasa aman dari siksa Allah, karena dialah yang berkuasa mengirimkan azab yang amat pedih kepadamu. Azab itu bisa datang dari atas seperti badai topan, kilat yang menyambar, atau dari bawah kakimu seperti gempa dan banjir bandang, atau dapat juga berupa dia mencampurkan kamu yakni memecah belah masyarakat kamu ke dalam golongan-golongan yang saling bertentangan dan saling bermusuhan sehingga merasakan kepada sebagian kamu keganasan sebagian yang lain. Maka perhatikanlah, bagaimana kami menjelaskan dengan berbagai cara dan juga secara berulang-ulang tanda-tanda kekuasaan kami agar mereka memahami-Nya. Dan ternyata kaummu, wahai nabi Muhammad, baik yang hidup pada masamu maupun sesudahnya, mendustakannya, yakni mendustakan azab, padahal azab itu benar adanya. Katakanlah, hai nabi Muhammad, kalau kalian memang tetap durhaka kepada Allah, ketahuilah bahwa aku ini bukanlah penanggung jawab kamu yang dapat membela kamu ketika azab itu datang"
  }
]