[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada pertanggung jawaban atas orang-orang yang beriman yang takut kepada Allah dengan menaati perintah-perintahNya dan menjauhi larangan-laranganNYa, sedikitpun di hadapan hisab Allah, terhadap orang-orang yang hanyut dalam pembicaraan batil lagi memperolok-olok ayat-ayat Allah. Akan tetapi, menjadi kewajiban mereka untuk memberi nasihat kepada orang-orang tersebut supaya menghentikan ucapan-ucapan batil mereka, semoga mereka takut kepada Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Orang-orang yang bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya itu tidak bertanggungjawab sedikit pun terhadap perbuatan orang-orang yang zalim itu. Tugas mereka hanyalah melarang orang-orang tersebut melakukan perbuatan mungkar agar mereka bertakwa kepada Allah, sehingga mereka mau menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Hai Rasulallah, jika kamu telah pergi meninggalkan majelis orang-orang musyrik yang sedang berbicara buruk terhadap ayat-ayat Allah, maka kamu dan orang-orang yang bertakwa kepada Allah tidak akan dimintai pertanggungjawaban atas dosa-dosa mereka. Dan perbuatanmu meninggalkan majelis mereka merupakan pengingat bagi mereka agar takut kepada Allah, sehingga mereka dapat menjauhkan diri dari berkata buruk terhadap ayat-ayat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَمَا عَلَى الَّذِينَ يَتَّقُونَ مِنْ حِسَابِهِم مِّن شَىْءٍ (Dan tidak ada pertanggungjawaban sedikitpun atas orang-orang yang bertakwa terhadap dosa mereka) Yakni tidak ada dosa bagi orang-orang yang bertakwa kepada Allah apabila meninggalkan mejelis yang didalamnya terdapat olok-olok terhadap ayat-ayat Allah ketika mereka sedang duduk dengan orang-orang yang mengolok-olok tersebut, karena dosa orang yang mengolok itu adalah tanggungan dirinya sendiri. وَلٰكِن ذِكْرَىٰ لَعَلَّهُمْ يَتَّقُونَ (akan tetapi (kewajiban mereka ialah) mengingatkan agar mereka bertakwa) Yakni akan tetapi berdiri dan tinggalkanlah mereka untuk mengingatkan mereka akan besarnya dosa yang mereka lakukan saat mereka mengolok-olok ayat-ayat Allah, dengan begitu semoga mereka meninggalkan perbuatan mereka tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69 Orang-orang yang bertakwa tidak mempunyai pertanggungjawaban sedikitpun atas orang-orang yang menyangkal ayat-ayat Allah, mereka juga tidak mempunyai tanggung jawab atas dosa mereka, atau duduk bersama mereka sedangkan mereka menyanggah hal lain lagi. akan tetapi kewajiban mereka ialah mengingatkan mereka akan dosa-dosa besar yang disebabkan oleh pembangkangan mereka itu agar mereka meninggalkan perbuatan itu dan bertakwa kepada Allah, sehingga mereka tidak berkata tentang kebatilan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang bertakwa tidak ada tanggung jawab sedikit pun atas perhitungan mereka} dosa orang-orang yang mencela {tetapi mengingatkan} ingatkanlah dan berilah pelajaran kepada mereka {agar mereka bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. “dan tidak ada pertanggung jawaban sedikitpun atas orang-orang yang bertakwa terhadap dosa-dosa mereka; akan tetapi kewajiban mereka ialah mengingatkan agar mereka bertakwa.” Maksudnya, akan tetapi hanya untuk mengingatkan dan menasihati mereka, mudah-mudahan mereka bertakwa kepada Allah. Dalam hal ini terdapat dalil bahwa orang yang meberi nasihat harus mengunakan kata-kata yang paling dekat untuk membawanya takwa kepada Allah. Dalam hal ini juga terdapat dalil bahwa peringatan dan nasihat hanyalah menambah keburukan di atas keburukanNya, maka meninggalkannya adalah wajib, karena bila pemberian nasihat itu bertentangan bengan maksudnya, maka meninggalakan nasihat befungsi sebagai maksud nasihat itu sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 69: Dalam tafsir Al Baghawi dijelaskan, bahwa Ibnu Abas radhiyallahu 'anhuma berkata, \"Ketika turun ayat ini \"Wa idzaa ra'aitalladziina yakhuudhuuna…dst.\" Kaum muslimin berkata, \"Bagaimanakah kami akan duduk di Masjidilharam dan bertawaf di Baitullah, sedangkan mereka tidak berhenti memperolok-olok? Dalam sebuah riwayat disebutkan, \"Sesungguhnya kami takut terhadap dosa ketika kami meninggalkan mereka dan tidak melarang mereka.\" Maka Allah menurunkan ayat, \"Wa maa 'alallladziina yattaquun\" (tidak ada tanggung jawab sedikit pun dari orang-orang yang menjaga diri) dari sikap memperolok-olok terhadap mereka yang memperolok-olok. Wa laakin dzikraa, yakni tetapi berilah mereka peringatan dan nasehat dengan Al Qur'an Yakni jika orang-orang yang bertakwa menjauhi mereka dan tidak duduk bersama mereka, maka sesungguhnya yang demikian sudah membuat mereka (yang bertakwa) telah lepas tanggung jawab dan tidak memikul dosa mereka. Perintah berpaling dari mereka ketika itu adalah untuk mengingatkan mereka agar mereka bertakwa dan tidak mengulangi lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 69",
    "description": "Orang-orang yang bertakwa, yaitu yang berusaha melaksanakan perintah Allah dan menjauhi larangan-Nya, tidak ada tanggung jawab sedikit pun atas dosa-dosa mereka, yakni para pendurhaka, baik akibat melecehkan agama maupun dosa lainnya, tetapi kaum muslim berkewajiban mengingatkan mereka tersebut agar bertakwauntuk menguatkan tuntunan Allah dalam menghadapi para pendurhaka, khususnya yang suka melecehkan ajaran agama-Nya, ayat ini menegaskan kembali keharusan menjauhi mereka. Dan tinggalkanlah orang-orang yang menjadikan agamanya sebagai permainan, ejekan, dan bahan senda-gurau, dan mereka yang telah tertipu oleh kemewahan dan gemerlapnya kehidupan dunia. Namun demikian, jangan tinggalkan mereka sama sekali. Peringatkanlah mereka dengan Al-Qur'an agar setiap orang dapat memperoleh rahmat Allah dan tidak terjerumus ke dalam neraka karena perbuatannya sendiri. Di akhirat, tidak ada baginya pelindung dan pemberi syafaat atau pertolongan selain Allah. Dan jika dia hendak menebus dengan segala macam tebusan apa pun dan sebanyak apa pun, niscaya tidak akan diterima tebusan tersebut. Mereka itulah orang-orang yang dijerumuskan ke dalam neraka karena perbuatan mereka sendiri. Mereka mendapat minuman dari air yang mendidih dan azab yang pedih karena kekafiran yang terus-menerus mereka lakukan dahulu selama di dunia."
  }
]