[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tinggalkanlah olehmu (wahai rasul), orang-orang musyrik yang menjadikan agama islam sebagai bahan permaianan dan senda gurau, dengan memperolok-olok ayat-ayat Allah . Dan merekapun telah terpedaya oleh dunia dengan segala keindahannya. Dan ingatkanlah dengan al-qur’an orang-orang musyrik itu dan orang selain mereka, agar jiwa-jiwa mereka tidak tergadai oleh dosa-dosa dan kekafirannya kepada tuhannya. Dan tidak ada baginya penolong selain Allah yang akan menolongnya sehingga dapat menyelamatkannya dari siksaanNya, juga tidak ada pemberi syafaat baginya di sisi Allah. Meskipun dia mengajukan tebusan dengan apa saja, niscaya tidak akan diterima darinya. Mereka yang telah terpasung oleh dosa-dosa mereka itu, bagi mereka minuman yang sangat panas di dalam neraka dan siksaan yang pedih, akibat kekafiran mereka kepada Allah dan RasulNya, Muhammad , dan agama islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Dan tinggalkanlah -wahai Rasul- orang-orang musyrik yang telah menjadikan agama mereka sebagai permainan dan gurau senda yang mereka ejek dan mereka olok-olok, dan telah tertipu oleh kehidupan dunia yang berisi kenikmatan-kenikmatan sementara. Dan nasihatilah umat manusia -wahai Nabi- dengan ayat-ayat Al-Qur`ān agar seseorang tidak terjerumus ke dalam kebinasaan disebabkan perbuatan-perbuatan dosa yang ia lakukan. Tidak ada seorang pun yang dapat menolongnya dan tidak ada seorang pun yang dapat melindunginya dari siksa Allah di hari Kiamat kecuali Dia. Jika ia hendak menebus dirinya dari siksa tersebut dengan tebusan apa pun pasti tidak akan diterima. Mereka itu adalah orang-orang yang menjerumuskan dirinya sendiri ke dalam kebinasaan disebabkan perbuatan-perbuatan maksiat yang mereka lakukan. Mereka di hari Kiamat kelak akan mendapatkan minuman yang panasnya tiada tara dan azab yang amat menyakitkan akibat kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Hai Rasulallah, Tinggalkanlah orang-orang yang menyekutukan Allah, menjadikan agama Allah -Islam- sebagai permainan dan senda gurau untuk menghina ayat-ayat Allah, dan yang tertipu oleh gemerlap kehidupan dunia. Dan berilah peringatan dengan al-Qur'an orang-orang yang menyelisihi perintah-perintah Allah, agar setiap mereka tidak tertawan oleh dosa-dosa mereka sehingga dapat menjerumuskan mereka ke dalam kebinasaan dan azab. Karena setiap jiwa tidak memiliki penolong dan pemberi syafaat kecuali Allah. Tidak ada tebusan yang akan diterima untuk menebus mereka dari azab Allah. Mereka adalah orang-orang yang yang tertawan oleh dosa-dosa mereka sendiri; di neraka jahanam mereka akan mendapat minuman jadi air panas yang mendidih dalam perut dan azab yang menyakitkan akibat kekafiran mereka kepada Allah dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. وَذَرِ الَّذِينَ اتَّخَذُوا۟ دِينَهُمْ لَعِبًا وَلَهْوًا (Dan tinggalkan lah orang-orang yang menjadikan agama mereka sebagai main-main dan senda gurau) Yakni tinggalkanlah mereka yang menjadikan agama yang benar ini –yang sebenarnya harus mereka ketahui dan mereka peluk— sebagai permainan dan bahan candaan. Dan janganlah condongkan hatimu kepada mereka meskipun kamu diperintahkan untuk menyampaikan hujjah kepada mereka, karena mereka adalah orang-orang yang keras kepala. وَغَرَّتْهُمُ الْحَيَوٰةُ الدُّنْيَا ۚ( dan mereka telah ditipu oleh kehidupan dunia) Sehingga menjadikan mereka lebih memilih kehidupan dunia daripada akhirat, dan mereka mengingkari adanya hari kebangkitan. وَذَكِّرْ بِهِۦٓ (Peringatkanlah (mereka) dengan Al-Quran itu) Yakni dengan al-qur’an agar tidak terjerumus kedalam neraka. أَن تُبْسَلَ نَفْسٌۢ بِمَا كَسَبَتْ (agar masing-masing diri tidak dijerumuskan ke dalam neraka, karena perbuatannya sendiri) Makna (الإبلاس) yakni penyerahan diri sendiri kepada kebinasaan. Yakni agar orang tersebut teringat dan dapat menyelamatkan dirinya dari azab sebelum terkepung oleh azab itu sehingga tidak dapat melarikan diri. وَإِن تَعْدِلْ كُلَّ عَدْلٍ لَّا يُؤْخَذْ مِنْهَآ ۗ (Dan jika ia menebus dengan segala macam tebusanpun, niscaya tidak akan diterima itu daripadanya) Yakni walaupun kamu menyerahkan seluruh tebusan demi membebaskan jiwa seseorang yang telah terjerumus kedalam kebinasaan maka tebusan itu sekali-kali tidak akan diterima untuk terbebas dari kebinasaan. أُو۟لٰٓئِكَ (Mereka itulah) Yakni orang-orang yang menjadikan agama islam sebagai permainan dan bahan candaan. الَّذِينَ أُبْسِلُوا۟ بِمَا كَسَبُوا۟ ۖ( orang-orang yang dijerumuskan ke dalam neraka karena perbuatannya sendiri) Yakni mereka adalah orang yang diserahkan untuk mendapat kebinasaan karena perbuatan mereka. لَهُمْ شَرَابٌ مِّنْ حَمِيمٍ (Bagi mereka (disediakan) minuman dari air yang sedang mendidih) Yakni air panas yang mereka minum sehingga usus mereka terpotong-potong."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu 'Abbas berkata : \"Sesungguhnya pada kesesatan itu ada kelezatan dan keindahan bagi pemiliknya, Allah berfirman : { وَذَرِ الَّذِينَ اتَّخَذُوا دِينَهُمْ لَعِبًا وَلَهْوًا } \"Dan tinggalkan lah orang-orang yang menjadikan agama mereka sebagai main-main dan senda gurau\" Dan Allah berfirman : { أَفَمَنْ زُيِّنَ لَهُ سُوءُ عَمَلِهِ فَرَآهُ حَسَنًا } \"Maka apakah orang yang dijadikan (syaitan) menganggap baik pekerjaannya yang buruk lalu dia meyakini pekerjaan itu baik\". [ Fatir : 8 ]"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70 Tinggalkanlah orang-orang yang menjadikan agama mereka sebagai mainan dan senda gurau, atau hanya sebagai olok-olokan atau tontonan saja. Dan mereka telah ditipu oleh kehidupan dunia dan segala perhiasannya, sehingga mereka mengingkari hari kebangkitan dan melupakan kehidupan akhirat. Peringatkanlah mereka dengan Al-Quran itu agar masing-masing diri mereka tidak dijerumuskan ke dalam neraka Jahannam, karena perbuatan maksiat mereka sendiri ketika di dunia. Maksudnya: diberi peringatan dengan Alquran agar diri mereka selamat dari azab sebelum mereka diberi azab itu. Tidak akan ada pelindung baginya dan tidak pula pemberi syafa’at dari azab-Nya selain dari Allah. Bahkan jika ia menebus dengan segala macam tebusan apapun yang dia miliki, meskipun emas seisi dunia niscaya tidak akan diterima. Mereka itulah orang-orang yang dijerumuskan ke dalam azab sebab perbuatan buruk mereka. Mereka akan akan diberi minum yang sangat panas di neraka Jahannam dan azab yang pedih disebabkan kekafiran dan olok-olok mereka dahulu atas ayat-ayat Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tinggalkanlah} tinggalkanlah {orang-orang yang menjadikan agamanya sebagai permainan dan senda gurau. Mereka telah tertipu} dikelabui {oleh kehidupan dunia. Peringatkanlah dengannya} peringatkanlah manusia dengan Al-Qur’an {agar seseorang tidak terjerumus} supaya seseorang tidak terjerumus ke dalam kehancuran {karena perbuatannya sendiri. Tidak ada baginya pelindung dan pemberi syafaat selain Allah. Jika dia hendak menebus dengan setiap tebusan apa pun} jika dia menebus dengan setiap tebusan {maka tidak akan diterima. Mereka itulah orang-orang yang dijerumuskan} dijerumuskan dalam kehancuran {karena perbuatan mereka sendiri. Bagi mereka minuman dari air yang mendidih} air yang paling panas {dan azab yang pedih karena mereka selalu ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Yang di tuntut dari para hamba adalah mengiklaskan agama hanya kepada Allah dengan menyembahNya semata tanpa sekutu bagiNya, mengeluarkan segala daya untuk meraih keridoan dan kecintaanNya. Tuntunan itu mengandung pengonsentrasian hati dengan mengarahkannya kepada Allah, dan hendaknya usaha seorang hamba itu bermanfaat, serius dan tidak main-main, ihklas karena hanya wajahNya, bukan karena riya dan sum’ah. Inilah agama yang hakiki yang di sebut sebagai agama. Adapaun orang yang mengkalim bahwa dia di atas kebenaran, dan bahwa dia adalah ahli takwa dan agama sementara dia telah menjadikan agamanya sebagai bahan main-main dan olok-olok, maka hatinya lalai dari mencintai dan mengenal Allah, dia melakukan semua yang merugikanNya, tenggelam dalam kebahtilan, bermain-main dengan badanNya. Karena perbauatn dan usaha yang bukan karena Allah, maka ia adalah main-main. Yang demikian ini Allah meminta agar ditinggalkan, diwaspadai, dan tidak ceroboh. “ Dan peringatkanlah mereka denganya,” masudnya, dengan Al-Qur’an sesuatu yang bermanfaat bagi manusia sebagai, perintah, penjelas pendekatan yang baik dengan menyebut sifat-sifat kebaikan yang ada padanya, dan menyebutkan sifat-sifat yang merugikan bagi manusia sebagai pelarangan, menjelaskan jenis-jenisnya, menjelaskan sifat-sifat buruk dan jelek yang ada padanya yang mendorongnya untuk meninggalkannya. Semua itu agar orang tidak di azab karena apa yang di lakukan, yakni sebelum seorang hamba terjun ke dalam dosa dan menangtang dzat yang Maha Mengetahui perkara-perkara yang ghaib serta terus-menerus melakukan perbuatan-perbuatan yang di takuti. Berilah dia peringatan dan nasihat agar dia jera, berhenti melakukannya lagi. FirmanNya, “ tidak aka ada paginya pelindung dan tidak pula pemberi syafa’at selain Allah,” yakni sebelum dosa-dosa yang meliputinya yang mana tidak seorangpun mahkluk yang bisa memberinya manfaat, baik itu kerabat dan teman. Tidak ada seroangpun selain Allah yang mengurusinya, dan tidak seorangpun memberi syafa’at kepadanya. “Dan jika ia menebus dengan segala tebusan pun,” maksudnya, menebusnya dengan sepenuh tebusan, walaupun dengan emas sepenuh bumi, “ niscaya tidak akan di teriman darinya.” Maksudnya, tebusan tersebut tidak di terima dan tidak berguna. “mereka itulah,” maksudnya, orang-orang yang kriteria di atas, adalah “ orang-orang yang di jerumuskan ke dalam neraka.” Maksudnya, dibinasakan, dan tidak ada lagi harapan baik bagi mereka, “ di sebabkan perbuatan mereka sendiri. Bagi mereka di sediakan minuman dari air yang sedang mendidih.” Yakni air yang panas, sehinga karena sangat panasnya ia melepuhkan wajah dan memotong usus-usus mereka, “ dan azab yang pedih di sebabkan kekafiran mereka dahulu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 70: Yakni agama Islam yang mereka disuruh mematuhinya dengan sungguh-sungguh. Arti menjadikan agama sebagai main-main dan senda gurau adalah memperolokkan agama itu; mengerjakan perintah-perintah dan menjauhi larangan-Nya dengan dasar main-main dan tidak sungguh-sungguh atau kosong hatinya dari mencintai Allah dan mengenal-Nya serta menyibukkan diri dengan hal yang memudharratkannya, serta senang di atas kebatilan. Yakni sebelum dosa-dosanya meliputi dirinya, sehingga tidak ada yang dapat memberinya manfaat dengan syafaat selain Allah. Meskipun dengan emas sepenuh bumi. Yang memutuskan usus-usus mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 70",
    "description": "Untuk menguatkan tuntunan Allah dalam menghadapi para pendurhaka, khususnya yang suka melecehkan ajaran agama-Nya, ayat ini menegaskan kembali keharusan menjauhi mereka. Dan tinggalkanlah orang-orang yang menjadikan agamanya sebagai permainan, ejekan, dan bahan senda-gurau, dan mereka yang telah tertipu oleh kemewahan dan gemerlapnya kehidupan dunia. Namun demikian, jangan tinggalkan mereka sama sekali. Peringatkanlah mereka dengan Al-Qur'an agar setiap orang dapat memperoleh rahmat Allah dan tidak terjerumus ke dalam neraka karena perbuatannya sendiri. Di akhirat, tidak ada baginya pelindung dan pemberi syafaat atau pertolongan selain Allah. Dan jika dia hendak menebus dengan segala macam tebusan apa pun dan sebanyak apa pun, niscaya tidak akan diterima tebusan tersebut. Mereka itulah orang-orang yang dijerumuskan ke dalam neraka karena perbuatan mereka sendiri. Mereka mendapat minuman dari air yang mendidih dan azab yang pedih karena kekafiran yang terus-menerus mereka lakukan dahulu selama di dunia. Tuntunan Allah kepada kaum muslim dalam menghadapi kaum musyrik dilanjutkan dalam ayat ini, khususnya ketika menghadapi ajakan mereka untuk kembali kepada ajaran nenek moyang mereka. Katakanlah, wahai nabi Muhammad dan setiap muslim, apakah kita, kaum muslim, akan memohon dan menyembah kepada sesuatu selain Allah, yang tidak dapat memberi manfaat dan tidak pula mendatangkan mudarat kepada kita, dan apakah kita akan dikembalikan ke belakang yaitu masa lalu kita sebelum beriman dengan murtad meninggalkan agama islam, setelah Allah memberi petunjuk kepada kita, seperti orang yang telah disesatkan oleh setan di bumi, dalam keadaan kebingungan' kemudian kawan-kawannya dari yang telah beriman mengajaknya ke jalan yang lurus dengan mengatakan, tinggalkan penyembahan selain Allah dan ikutilah kami. Namun dia tetap menolak, maka katakanlah, wahai nabi dan kaum muslim, jika itu yang menjadi pilihanmu, maka ketahuilah sesungguhnya petunjuk Allah itulah petunjuk yang sebenarnya; dan karena itulah kita diperintahkan agar berserah diri kepada tuhan seluruh alam. Dan kita diperintahkan juga agar melaksanakan salat dengan khusyuk, sempurna syarat dan rukunnya, dan istikamah dalam mengerjakannya, serta bertakwa kepada-Nya. Dan dialah tuhan yang kepada-Nya kamu semua akan dihimpun untuk mempertanggungjawabkan segala amal perbuatan kamu. Kaum musyrik atau non-Muslim yang mengajak kepada kemurtadan pada ayat di atas dipersamakan dengan setan-setan yang mengganggu, dan orang yang akhirnya murtad dipersamakan dengan orang yang hilang akal atau gila. Ajakan kepada kebenaran di jalan Allah adalah petunjuk yang sebenarnya."
  }
]