[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan demikian pula kita semua diperintahkan untuk mendirikan shalat secara sempurna dan supaya kita takut kepadaNya dengan cara melaksanakan segala perintahNya dan menjauhi larangan-laranganNya. ”Dia lah Allah yang kepadaNya semua makhluk akan dikumpulkan pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Dan Dia juga memerintahkan kepada kita agar kita mendirikan salat dengan sebaik-baiknya, dan memerintahkan kepada kita agar kita bertakwa kepadanya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Karena hanya kepada Dia lah kelak semua makhluk akan dikumpulkan di hari Kiamat untuk menerima balasan yang setimpal dengan amal perbuatan masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Kami diperintahkan untuk mendirikan shalat, bertakwa kepada Allah dan takut kepada-Nya ketika sedang sendiri maupun saat di keramaian; Ini merupakan bukti kecintaan seorang hamba kepada Tuhannya. Allah akan mengumpulkan seluruh makhluk pada hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. وَأَنْ أَقِيمُوا۟ الصَّلَوٰةَ وَاتَّقُوهُ ۚ (dan agar mendirikan sembahyang serta bertakwa kepada-Nya) Yakni kita diperintahkan untuk berserah diri dan menegakkan shalat serta bertakwa kepada Allah; maka inilah yang disebut dengan petunjuk. وَهُوَ الَّذِىٓ إِلَيْهِ تُحْشَرُونَ(Dan Dialah Tuhan yang kepada-Nya-lah kamu akan dihimpunkan) Yakni kalian akan dikumpulkan kepada-Nya, tidak bermanfaat bagi kalian di hari itu kecuali amalan-amalan shaleh yang telah kalian kerjakan, dan yang paling utama adalah ketakwaan dan shalat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72 Juga memerintahkan kita agar mendirikan sholat secara sempurna pada waktunya serta bertakwa kepada-Nya, menjauhi maksiat kepada Allah dan takut atas azab-Nya”. Itulah petunjuk yang benar. Dialah Tuhan yang kepada-Nya-lah kamu akan dikumpulkan di akhirat untuk dihisab. Hanya milik-Nya lah kekuasaan untuk memberi keputusan di hari kiamat. Tidak akan ada yang bermanfaat bagi kalian kecuali ilmu yang baik berupa takwa, sholat dan sebagainya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan agar mendirikan shalat dan bertakwa kepadaNya. Dialah Dzat yang hanya kepadaNya kalian akan dikumpulkan} dikumpulkan pada hari kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. “Dan agar mendirikan shalat.” Maksudnya, kami diperintahkan untuk mendirikannya dengan rukun-rukun, syarat-syarat, Sunnah-sunnah dan penyempurna-penyempurnanya. “Serta bertakwa kepadaNYa,” dengan melakukan apa yang diperintahkan dan apa yang dilarang. “Dan Dia-lah Tuhan Yang kepadaNya-lah kamu akan dihimpunkan.’ Kamu dikumpulkan pada Hari Kiamat, lalu Dia membalasmu sesuai dengan perbuatanmu, baik dan buruknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 72: Dengan mengerjakan rukun, syarat, sunah dan penyempurnanya. Lalu Dia akan memberikan balasan terhadap amalmu; yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 72",
    "description": "Tuntunan Allah kepada kaum muslim dalam menghadapi kaum musyrik dilanjutkan dalam ayat ini, khususnya ketika menghadapi ajakan mereka untuk kembali kepada ajaran nenek moyang mereka. Katakanlah, wahai nabi Muhammad dan setiap muslim, \"apakah kita, kaum muslim, akan memohon dan menyembah kepada sesuatu selain Allah, yang tidak dapat memberi manfaat dan tidak pula mendatangkan mudarat kepada kita, dan apakah kita akan dikembalikan ke belakang yaitu masa lalu kita sebelum beriman dengan murtad meninggalkan agama islam, setelah Allah memberi petunjuk kepada kita, seperti orang yang telah disesatkan oleh setan di bumi, dalam keadaan kebingungan'\" kemudian kawan-kawannya dari yang telah beriman mengajaknya ke jalan yang lurus dengan mengatakan, \"tinggalkan penyembahan selain Allah dan ikutilah kami. \" namun dia tetap menolak, maka katakanlah, wahai nabi dan kaum muslim, \"jika itu yang menjadi pilihanmu, maka ketahuilah sesungguhnya petunjuk Allah itulah petunjuk yang sebenarnya; dan karena itulah kita diperintahkan agar berserah diri kepada tuhan seluruh alam. Dan kita diperintahkan juga agar melaksanakan salat dengan khusyuk, sempurna syarat dan rukunnya, dan istikamah dalam mengerjakannya, serta bertakwa kepada-Nya. \" dan dialah tuhan yang kepada-Nya kamu semua akan dihimpun untuk mempertanggungjawabkan segala amal perbuatan kamu. Kaum musyrik atau non-Muslim yang mengajak kepada kemurtadan pada ayat di atas dipersamakan dengan setan-setan yang mengganggu, dan orang yang akhirnya murtad dipersamakan dengan orang yang hilang akal atau gila. Ajakan kepada kebenaran di jalan Allah adalah petunjuk yang sebenarnya sering kali kaum musyrik menyatakan bahwa yang menciptakan langit dan bumi adalah Allah, namun faktanya mereka menyembah selain Allah. Ayat ini meluruskan kekeliruan mereka dengan menegaskan bahwa dialah Allah, bukan selain-Nya, yang menciptakan langit dan bumi dengan hak, yakni untuk tujuan yang benar. Sungguh benar pula ketika dia berfirman, jadilah! maka jadilah segala sesuatu yang dikehendaki-Nya itu. Sungguh firman-Nya adalah benar, dan milik-Nyalah segala kekuasaan pada waktu sangkakala ditiup yaitu pada hari kiamat. Dia mengetahui yang gaib yang tidak terjangkau oleh makhluk dan yang nyata. Dialah yang mahabijaksana, mahateliti."
  }
]