[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah , Dialah Dzat yang menciptakan langit dan bumi dengan tujuan yang haq. Dan ingatlah (wahai rasul) pada hari kaiamt ketika Dia akan berfirman , ”jadilah”, maka jadilah apa yang diperintahNya secepat kedipan mata atau bahkan lebih cepat. FirmanNya merupakan kebenaran yang sempurna. Dan milikNya semata kekuasaan pada hari ketika malaikat meniup sangkala pada tiupannya yang kedua yang menjadi saat kembalinya ruh-ruh ke jasad-jasadnya. Dan Dia lah dzat yang Maha Mengetahui perkara yang tersembunyi dari pancaindra kalian (wahai manusia) dana pa yang kalian saksiakan, dan Dia Maha bijaksana, yang menempatkan segala perkara pada tempatnya (yang tepat), lagi maha Mengetahui seluruh urusan makhlukNya. Dan Allah Dia lah yang secara khusus menguasai urusan-urusan ini dan perkara-perkara lainnya, dari permulaan hingga kejadian akhirnya, tentang perkembangan hingga tempat kembalinya. Dan Dia lah yang tuhan yang wajib bagi para hamba untuk menaati syari’atNya, diterima ketetapan hukumNya dengan tulus dan diharap-harapkan keridhaan dan ampunanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Dia lah -Subḥānahu wa Ta'ālā- Żāt yang menciptakan langit dan bumi dengan sebenar-benarnya. Yaitu tatkala Allah berfirman kepada sesuatu, “Jadilah!” Maka jadilah. Dan ketika Dia berfirman pada hari Kiamat, “Bangkitlah kalian!” Maka bangkitlah mereka. Yaitu firman-Nya yang benar, yang pasti akan terjadi tanpa kecuali. Dan Dia lah -Subḥānahu wa Ta'ālā- satu-satu-Nya pemilik kerajaan di hari Kiamat, tatkala Malaikat Israfil meniup sangkakala untuk kedua kalinya. Dia Maha Mengetahui apa yang tersembunyi dan apa yang nyata. Dia Maha Bijaksana dalam mengatur dan mengurus makhluk-Nya. Dan Dia Maha Mengetahui segala sesuatu, tidak ada sesuatu yang luput dari pengetahuan-Nya. Maka perkara-perkara yang tersembunyi akan tampak seperti perkara-perkara yang nyata bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Hanya Allah yang berhak disembah, karena Dia yang menciptakan langit dan bumi untuk tujuan yang benar; keduanya diciptakan tidak untuk sesuatu yang sia-sia atau batil. Pada hari kiamat Allah akan nampak bagi seluruh makhluk; dan segala perintah-Nya pasti akan terlaksana, tidak ada yang dapat menghalangi-Nya; dan firman-Nya pasti benar, tidak ada keraguan di dalamnya. Dialah penguasa segala sesuatu. Pada hari kiamat Allah akan memerintahkan malaikat untuk meniup sangkakala tiupan kedua, maka ruh-ruh akan kembali ke jasadnya masing-masing untuk dimulainya hari perhitungan. Allah Maha Mengetahui hal ghaib, terlebih lagi hal yang nampak; Dia Maha Bijaksana dalam menetapkan segala sesuatu dan Maha Mengetahui segalanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَهُوَ الَّذِى خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ بِالْحَقِّ ۖ (Dan Dialah yang menciptakan langit dan bumi dengan benar) Yakni dengan penciptaan yang benar. وَيَوْمَ يَقُولُ كُن فَيَكُونُ ۚ قَوْلُهُ الْحَقُّ ۚ( Dan benarlah perkataan-Nya di waktu Dia mengatakan: “Jadilah, lalu terjadilah”) Dia memerintahkan untuk bangkit dan berkumpul, maka para makhluk mentaatinya. Maka bagaimana kita akan menyembah selain-Nya yang tidak memberi manfaat dan mudharat, serta mengembalikan kita kepada kesesatan. وَلَهُ الْمُلْكُ يَوْمَ يُنفَخُ فِى الصُّورِ ۚ( dan di tangan-Nya-lah segala kekuasaan di waktu sangkakala ditiup) Makna (الصور) yakni tanduk yang ditiup, tiupan pertama untuk kehancuran alam dan yang kedua untuk kebangkitan. عٰلِمُ الْغَيْبِ وَالشَّهٰدَةِ ۚ (Dia mengetahui yang ghaib dan yang nampak) Yakni yang Maha mengetahui apa yang ghaib dan apa yang nampak dari segala sesuatu. وَهُوَ الْحَكِيمُ (Dan Dialah Yang Maha Bijaksana) Yakni dalam segala yang berasal dari-Nya. الْخَبِيرُ (lagi Maha Mengetahui) Mengetahui segalanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73 Dialah yang menciptakan langit dan bumi sebagai ciptaan yang saling melengkapi dengan benar, bukan hanya main-main atau kebatilan. Hari dimana jika Dia berkehendak atas sesuatu maka Dia hanya berkata: “Jadilah, lalu terjadilah”, perkataan yang benar tanpa ada keraguan. Di tangan-Nya-lah segala kekuasaan dan kerajaan yang sempurna yang tidak ada yang dapat melemahkan-Nya. Hari di waktu sangkakala ditiup, pada tiupan pertama untuk menghancurkan, dan kedua untuk menghidupkan kembali. Dia Maha mengetahui segala yang ghaib dan yang nampak. Dan Dialah Yang Maha Bijaksana atas segala perbuatan-Nya lagi Maha Mengetahui atas segala yang terlihat maupun tersembunyi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang menciptakan langit dan bumi dengan benar. Pada hari (ketika) Dia berkata, “Jadilah” Maka jadilah sesuatu itu. FirmanNya adalah kebenar} kebenaran yang nyata tidak bisa tidak {dan milikNyalah segala kekuasaan pada hari sangkakala ditiup. Dia mengetahui yang ghaib dan yang nyata. Dialah Yang Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. “Dan Dia-lah yang menciptakan langit dan bumi dengan benar.” Untuk memerintahkan para hamba, melarang, membalas, dan menghukum mereka. “Dan benarlah perkataanNYa di waktu Dia mengatakan, ‘Jadilah’, lalu terjadilah,” yang tidak ada kebimbangan padanya, tidak ada pengulangan, dan Dia tidak mengucapkan sesuatu yang sia-sia. “Dan di TanganNya-lah segala kekuasaan di waktu sangkakala ditiup.” Maksudnya, Hari KIamat. Ia disebut secara khusus, padahal Dia penguasa segala sesuatu karena pada hari itu segala kekuasaan terputus. Tidak ada yang berkuasa kecuali Allah yang Maha Esa lagi Maha Berkuasa. “Dia mengetahui yang ghaib dan yang Nampak. Dan DIa-lah Yang Mahabijaksana lagi Maha Mengetahui.” Pemilik hikmah yang sempurna, nikmat yang menyeluruh, kebaikan yang besar, ilmu yang mencakup segala rahasia, yang batin dan yang samar, yang tiada tuhan yang berhak disembah kecuali DIa dan tiada Rabb selainNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 73: Agar Dia memerintah hamba dan melarangnya di bumi, serta memberikan pahala atau hukuman. Yaitu pada hari kiamat, ketika Dia berfirman, \"Bangkitkah!\" maka semuanya bangkit. Ketika itu terlihat jelas kerajaan-Nya dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 73",
    "description": "Sering kali kaum musyrik menyatakan bahwa yang menciptakan langit dan bumi adalah Allah, namun faktanya mereka menyembah selain Allah. Ayat ini meluruskan kekeliruan mereka dengan menegaskan bahwa dialah Allah, bukan selain-Nya, yang menciptakan langit dan bumi dengan hak, yakni untuk tujuan yang benar. Sungguh benar pula ketika dia berfirman, jadilah! maka jadilah segala sesuatu yang dikehendaki-Nya itu. Sungguh firman-Nya adalah benar, dan milik-Nyalah segala kekuasaan pada waktu sangkakala ditiup yaitu pada hari kiamat. Dia mengetahui yang gaib yang tidak terjangkau oleh makhluk dan yang nyata. Dialah yang mahabijaksana, mahateliti. Kini diberikan contoh pengalaman nabi ibrahim dalam mengajarkan tauhid kepada kaumnya yang musyrik. Dan ingatlah serta jelaskanlah ketika ibrahim berkata kepada ayahnya yang bernama atau bergelar azar, pantaskah engkau menjadikan berhala-berhala yang engkau buat sendiri itu sebagai tuhan' sesungguhnya aku melihat dan menilai engkau, wahai orang tuaku, dan melihat juga kaummu yang sama-sama menyembah berhala itu sungguh dalam kesesatan yang nyata."
  }
]