[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul) perdebatan antara Ibrahim dengan ayahnya, Azar, ketika ia berkata kepada sang ayah, ”mengapa engkau menjadikan berhala-berhala itu sebagai tuhan-tuhan yang engkau sembah selain Allah ? sesungguhnya aku melihatmu dan kaummu dalam kesesatan yang nyata dari jalan yang lurus. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan ingatlah -wahai Rasul- tatkala Ibrahim -‘Alaihissalām- berkata kepada ayahnya yang musyrik, Āzar, “Wahai ayahku! Apakah Anda menjadikan patung-patung itu sebagai tuhan-tuhan yang Anda sembah selain Allah? Sesungguhnya aku melihat Anda dan kaum Anda yang menyembah berhala-berhala itu berada dalam kesesatan yang nyata dan menyimpang dari jalan yang benar disebabkan karena kalian menyembah tuhan selain Allah. Sebab, Allah -Subḥānahu- dalah Rabb yang disembah secara hak, sedang yang lain adalah tuhan yang disembah secara batil.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Hai Rasulallah, ingatlah ketika Ibrahim berkata kepada ayahnya, Azar: Apakah kamu menjadikan batu-batu ini sebagai tuhan-tuhan yang kamu sembah bersama kaummu? Sungguh kamu telah berpaling dari jalan yang benar dan lurus menuju jalan kesesatan yang nyata. Allah menyebut Ibrahim karena dia memiliki kedudukan yang tinggi di hati orang-orang Arab dan untuk menjelaskan perkara-perkara aqidah dengan penjelasan yang bersangkutan dengan orang yang mereka sukai. Dan dalam pernyataan Ibrahim terdapat penggunaan harfu ta'kid (penegasan) 'إن' karena pernyataan ini untuk menjelaskan kesesatan mereka yang nyata. Adapun penyebutan kata 'وقومك' (dan kaummu), untuk memberi peringatan dari awal bahwa banyaknya orang yang bersamanya di atas kesesatan tidak dapat menguatkan kepercayaannya atau melemahkan orang yang mengingkarinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَإِذْ قَالَ إِبْرٰهِيمُ لِأَبِيهِ ءَازَرَ (Dan (ingatlah) di waktu Ibrahim berkata kepada bapaknya, Aazar) Ada pendapat menyebutkan bahwa nama dari ayah Nabi Ibrahim adalah Taarikh, namun pendapat lain menyebutkan bahwa ia memiliki dua panggilan: Aazar dan Thaarikh. أَتَتَّخِذُ أَصْنَامًا ءَالِهَةً ۖ (Pantaskah kamu menjadikan berhala-berhala sebagai tuhan-tuhan?) Yakni apakah kamu menjadikannya sebagai tuhan-tuhan yang kamu sembah? إِنِّىٓ أَرَىٰكَ وَقَوْمَكَ (Sesungguhnya aku melihat kamu dan kaummu) Yakni kaummu yang sejalan denganmu dalam penyembahan berhala-berhala. فِى ضَلٰلٍ (dalam kesesatan) Dari jalan yang benar. مُّبِينٍ (yang nyata) Yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74 Ingatlah wahai Nabi di waktu Ibrahim berkata kepada bapaknya, Azar atau Tarikh, “Pantaskah engkau menjadikan berhala-berhala sebagai sesembahan selain Allah? Bahkan berhala-berhala itu tidak kuasa memberi manfaat maupun bahaya. Sesungguhnya aku melihat engkau dan kaummu ketika menyembaj berhala itu sungguh dalam kesesatan yang nyata jauh dari kebenaran.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Ibrahim berkata kepada ayahnya, Azar,“Apakah kamu menjadikan berhala-berhala itu sebagai tuhan. Sesungguhnya aku melihatmu dan kaummu dalam kesesatan yang nyata.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. Disini Allah mengatakan, Ceritakanlah kisah Ibrahim dengan menyanjung dan menghormatinya dalam kondisi di mana dia mengajak kepada tauhid dan melarang syirik. “Dan (ingatlah) di waktu Ibrahim berkata kepada bapaknya (Azar), ‘ Pantaskah kamu menjadikan berhala-berhala sebagai tuhan-tuhan?’ “ Yang tidak mampu menghadirkan manfaat dan mudarat, dan yang tidak memiliki hak sedikit pun dalam segala urusan. “Sesungguhnya aku melihatmu dan kaummu dalam kesesatan yang nyata.” Yang mana kamu menyembah sesuatu yang sedikit pun tidak berhak untuk disembah, sementara kamu meninggalkan penyembahan kepada penciptamu, pemberi rizkimu, dan pengaturmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 74: Ayat ini dan ayat setelahnya menerangkan dakwah Nabi Ibrahim 'alaihis salam kepada tauhid; baik kepada bapaknya maupun kepada kaumnya. Di antara mufassir ada yang berpendapat bahwa yang dimaksud dengan Abiihi (bapaknya) ialah pamannya. Ada pula yang berpendapat, bahwa Aazar adalah laqab (gelar) bagi bapak Nabi Ibrahim 'alaihis salam, nama aslinya adalah Tarukh. Pertanyaan ini sekaligus sebagai celaan. Karena menyembah sesuatu yang tidak berhak disembah dan karena meninggalkan menyembah kepada Tuhan yang sebenarnya, yaitu Tuhan yang mencipta dan memberi rezki kepada alam semesta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 74",
    "description": "Kini diberikan contoh pengalaman nabi ibrahim dalam mengajarkan tauhid kepada kaumnya yang musyrik. Dan ingatlah serta jelaskanlah ketika ibrahim berkata kepada ayahnya yang bernama atau bergelar azar, pantaskah engkau menjadikan berhala-berhala yang engkau buat sendiri itu sebagai tuhan' sesungguhnya aku melihat dan menilai engkau, wahai orang tuaku, dan melihat juga kaummu yang sama-sama menyembah berhala itu sungguh dalam kesesatan yang nyata. Apa yang disampaikan nabi ibrahim sedemikian kukuh sebagai buah dari keyakinannya yang lurus dan bimbingan Allah. Dan demikianlah kami memperlihatkan kepada ibrahim kekuasaan kami yang terdapat di langit dan di bumi agar semakin mantap keyakinannya dan semakin kuat argumennya, dan agar dia termasuk orang-orang yang semakin kukuh ke-yakin-annya, bahwa tiada pencipta dan pengatur di alam raya ini selain Allah."
  }
]