[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana kami telah memberikan Ibrahim hidayah menuju jalan yang haq dalam perkara peribadahan, kami juga memperlihatkan kepadanya sesuatu yang meliput langit dan bumi berupa kerajaan agung dan kekuasaan yang mencengangkan pandangan agar dia termasuk di antara orang-orang yang mendalam dalam keimanannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Sebagaimana Kami memperlihatkan kesesatan ayahnya dan kaumnya, Kami juga memperlihatkan kerajaan langit dan bumi yang sangat luas untuk dijadikan sebagai petunjuk bagi keesaan Allah dan kedudukan-Nya sebagai satu-satunya Rabb yang berhak disembah. Tujuannya ialah supaya ia (Ibrahim) menjadi yakin bahwa Allah adalah Rabb Yang Maha Esa, tidak ada sekutu bagi-Nya, dan Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Demikianlah Kami perlihatkan kepada Ibrahim tanda-tanda kekuasaan Kami di langit dan bumi, dan Kami perlihatkan bahwa kekuasaan Kami sangat besar dan luas, agar dia menjadi termasuk orang-orang yang beriman dan teguh di atas ketauhidan dan keikhlasan untuk beribadah kepada Allah. Dan pengungkapan dengan 'jar dan majrur' pada kalimat 'من الموقنين', dan bukan dengan 'ليكون موقنا'; karena itu lebih menegaskan maksudnya, sebab dengan ungkapan ini menunjukkan bahwa dia termasuk golongan yang dikenal manusia dengan golongan orang-orang yang yakin, sehingga secara bersamaan menunjukkan bahwa dia adalah orang yang yakin. Ini merupakan bentuk kiasan yang berguna untuk menetapkan sesuatu dengan menetapkan keseharusannya, dan ini merupakan pengungkapan yang lebih tegas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَكَذٰلِكَ نُرِىٓ إِبْرٰهِيمَ مَلَكُوتَ السَّمٰوٰتِ وَالْأَرْضِ (Dan demikianlah Kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi) Yakni makhluk-makhluk yang ada di langit dan bumi. Pendapat lain mengatakan Allah memperlihatkannya hal itu sampai dapat melihat ‘arsy dan perut bumi. Pendapat lain mengatakan Allah menunjukkan kepadanya kekuasaan-Nya di langit dan bumi yang Dia kabarkan di ayat ini. Makna (نري) yakni memperlihatkan, yaitu memceritakan keadaan yang telah lalu, karena dahulu Aazar dan kaumnya menyembah patung-patung, bintang-bintang, matahari, dan bulan; maka Allah menginginkan agar Ibrahim memperingatkan mereka atas kesalahan mereka. وَلِيَكُونَ مِنَ الْمُوقِنِينَ (dan (Kami memperlihatkannya) agar dia termasuk orang yang yakin) Yakni Kami memperlihatkannya makhluk-mahkluk yang menakjubkan dan kekuasaan yang mengherankan agar Ibrahim menjadi nabi yang berilmu, serta ilmunya berlandaskan keyakinan yang kuat, yang tidak digoyahkan oleh keraguan dalam kebesaran dan kekuasaan Allah atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75 Seperti Kami perlihatkan kesesatan bapak dan kaum bapaknya dalam menyembah berhala kepada Nabi Ibrahim maka Kami perlihatkan kepada Ibrahim pula tanda-tanda keagungan Kami berupa kerajaan langit dan bumi yang agung beserta keajaiban dan keagungan ciptaan-Nya. Itu untuk menunjukkan kemahaesaan dan kekuasaan Kami, agar dia menjadi Nabi yang yakin tanpa ada keraguan sedikitpun atas keagungan dan kekuasaan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah Kami memperlihatkan kepada Ibrahim kekuasaan} kerajaan {langit dan bumi dan agar dia termasuk orang-orang yang yakin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “Dan demikianlah,” ketika Kami memberi taufik kepadanya menuju tauhid dan dakwah kepadanya, “Kami perlihatkan kepada Ibrahim tanda-tanda keagungan (Kami yang terdapat) di langit dan bumi,” agar dia melihat dengan bashirah dalil yang kuat dan bukti-bukti yang jelas yang dikandungnya. “Dan (Kami memperlihatkannya) agar Ibrahim itu termasuk orang-orang yang yakin.” Karena berdasarkan tegaknya dalil, dia mendapatkan keyakinan dan ilmu yang sempurna dengan segala tuntutan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 75: Yang menunjukkan keesaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 75",
    "description": "Apa yang disampaikan nabi ibrahim sedemikian kukuh sebagai buah dari keyakinannya yang lurus dan bimbingan Allah. Dan demikianlah kami memperlihatkan kepada ibrahim kekuasaan kami yang terdapat di langit dan di bumi agar semakin mantap keyakinannya dan semakin kuat argumennya, dan agar dia termasuk orang-orang yang semakin kukuh ke-yakin-annya, bahwa tiada pencipta dan pengatur di alam raya ini selain Allah. Ayat ini dan juga selanjutnya adalah gambaran bagaimana nabi ibrahim dalam mengajarkan tauhid. Ketika malam telah menjadi gelap, dia, ibrahim, melihat sebuah bintang yang memancarkan cahaya dengan terang lalu dia berkata, inilah dia tuhanku yang selalu aku cari. Maka ketika bintang itu terbenam dan tidak tampak lagi, dia berkata, aku tidak suka menyembah dan bertuhan kepada yang terbenam yang pada akhirnya akan lenyap."
  }
]