[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika malam gelap telah menyapa Ibrahim dan menutupinya, dia mulai mengajak berdiskusi kaumnya untuk menetapkan kepada mereka bahwa ajaran agama yang mereka pegangi adalah batil. Mereka adalah orang-orang yang menyembah bintang-bintang. Ibrahim melihat bintang sambil berkata untuk menarik kaumnya secara perlahan-lahan dan menuntut mereka agar bertauhid kepada Allah, ”ini adalah tuhanku” ketika bintang itu tenggelam, dia berkata” Aku tidak menyukai tuhan yang bisa lenyap. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Maka tatkala malam mulai gelap, ia (Ibrahim) melihat sebuah bintang dan berkata, “Ini adalah tuhanku!” Namun tatkala bintang itu terbenam, Ibrahim berkata, “Aku tidak suka dengan tuhan yang terbenam. Karena Tuhan yang benar selalu hadir dan tidak pernah menghilang.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Ibrahim telah menghadapi kaumnya yang menyembah bintang-bintang dengan kebenaran yang tidak dapat tertutupi oleh gelapnya kekafiran, yang dengan kebenaran itu niscaya akan runtuh akidah kesyirikan dan penyembahan kepada selain Allah. Ketika malam telah tiba, dan Ibrahim melihat bintang itu nampak lalu kembali lenyap, maka ia berkata -sebagai bentuk sindiran, yang dalam ilmu debat disebut dengan melayani pemikiran lawan untuk menarik perhatian dan mengambil hati mereka dan untuk mengantarkan mereka menuju kebenaran-: \"inilah Tuhanku -sebagaimana yang kalian percayai-\". Ketika bintang itu lenyap, dia berkata: \"Aku tidak suka dengan Tuhan yang lenyap\". Kata tunjuk 'ini' berguna untuk membedakan bintang yang dimaksud dari bintang-bintang yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. فَلَمَّا جَنَّ عَلَيْهِ الَّيْلُ (Ketika malam telah gelap) Yakni Allah menyelimuti malam dengan kegelapan. رَءَا كَوْكَبًا ۖ (dia melihat sebuah bintang) Ada pendapat mengatakan bahwa dia melihat Jupiter, dan pendapat lain mengatakan venus. قَالَ هٰذَا رَبِّى ۖ( (lalu) dia berkata: “Inilah Tuhanku”) Terdapat pendapat mengatakan kisah ini adalah ketika penglihatannya masih lemah karena terjadi pada masa kanak-kanaknya. Pendapat lain mengatakan bahwa dia mengatakan ini dengan tujuan untuk memberikan hujjah atas kaumnya, seakan-akan dia adalah orang yang menggambarkan keadaan mereka dan kepercayaan mereka agar mereka tersindir. فَلَمَّآ أَفَلَ(tetapi tatkala bintang itu tenggelam) Yakni terbenam. قَالَ(dia berkata) Ibrahim berkata: sesungguhnya sesuatu yang terbenam tidak akan menjadi tuhan, karena tuhan adalah Dzat yang menjaga langit dan bumi. لَآ أُحِبُّ الْءَافِلِينَ (“Saya tidak suka kepada yang tenggelam”) Yakni tuhan-tuhan yang terbenam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76 Ketika malam telah gelap dan Dia tutup malam dengan kegelapannya, dia melihat sebuah bintang yang bercahaya, dia berkata kepada kaumnya: “Inilah Tuhanku. Dengan cahaya dan ketinggiannya dia lebih pantas menjadi tuhan dari pada berhala-berhala ini”, Dia ingin menunjukkan bukti hujjah kepada kaumnya melalui cara menunjukkan langsung kemudian menalarnya dengan akal dan indera. Tetapi tatkala bintang itu tenggelam dia berkata: “Saya tidak suka kepada tuhan yang tenggelam, sebab dia berubah di waktu siang dan menjadi tidak tampak.”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika malam telah gelap} telah menjadi gelap {dia melihat sebuah bintang, dia berkata,“Inilah Tuhanku.” Lalu ketika bintang itu terbenam} menghilang {dia berkata,“Aku tidak suka kepada yang terbenam.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. “Ketika malam menjadi gelap, dia melihat sebuah bintang.” Mungkin ia bintang yang bersinar, karena penghususananya dalam penyebutan menunjukan bahwa dia lebih dari yang lain. Oleh karena itu, wallahu a’lam, ada yang mengatakan bahwa itu adalah bintang Venus. “Lalu dia berkata, ‘Inilah tuhanku’.” Maksudnya, dia berkata, “ Inilah Rabbku,” dengan nada merendah, namun menentang. Lalu marilah kita lihat, apakah dia berhak memperoleh rububiyyah? Apakah kita memiliki dalil dalam hal ini? Karena seorang yang berakal tidak layak menjadikan hawa nafsunya sebagai tuhan tanpa dalil dan bukti. “ Tetapi tatkala bintang itu tenggelam,” maksudnya, bintang itu menghilang. “Dia berkata, ‘saya tidak suka kepada yang tenggelam’,” maksudnya, yang menghilang dan bersembunyi dari orang-orang yang menyembahnya, karena yang di sembah harus mengurusi kepentingan-kepentingan orang yang menyembahnya, dan harus berfungsi sebagai pengaturnya dalam urusannya. Adapun yang tengelam dalam waktu yang lama, maka bagaimana mungkin dia berhak disembah? Bukankah menjadikannya tuhan adalah termasuk hal kebodohan yang besar dan kebathilan yang parah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 76: Ada yang mengatakan bahwa bintang ini adalah bintang Zuhrah (Venus). Yakni di hadapan penduduk Hiran penyembah bintang atau planet mengajak mereka untuk berpikir. Pantaskah benda seperti ini disembah? Maksudnya menunjukkan bahwa benda tersebut adalah sesuatu yang baru, sehingga tidak layak disembah. Namun kata-kata ini tidak membuat kaumnya berubah sikap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 76",
    "description": "Ayat ini dan juga selanjutnya adalah gambaran bagaimana nabi ibrahim dalam mengajarkan tauhid. Ketika malam telah menjadi gelap, dia, ibrahim, melihat sebuah bintang yang memancarkan cahaya dengan terang lalu dia berkata, inilah dia tuhanku yang selalu aku cari. Maka ketika bintang itu terbenam dan tidak tampak lagi, dia berkata, aku tidak suka menyembah dan bertuhan kepada yang terbenam yang pada akhirnya akan lenyap. Setelah terbukti bahwa bintang yang cahayanya sangat kecil dalam pandangan mata telanjang manusia di bumi ini tidak wajar dipertuhankan, lalu ketika dia, ibrahim, mengalihkan pandangannya dengan melihat bulan terbit yang cahayanya lebih terang, dia berkata, inilah tuhanku yang kucari. Tetapi ketika bulan itu terbenam, dia pun berkata, sungguh, jika tuhanku yang telah membimbingku tidak memberi petunjuk kepadaku, pastilah aku termasuk orang-orang yang sesat karena menyembah yang bukan tuhan serta mengabdi kepada selain-Nya."
  }
]