[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tatkala Ibrahim melihat bulan tengah terbit, dia berkata kepada kaumnya (sebagai cara untuk menarik penentangnya secara perlahan-lahan(dari keyakinan yang salah) “ini adalah tuhanku” ketika bulan tersebut tenggelam, dia berkata dengan menunjukan kebutuhannya terhadap hidayah rabbnya, ”jika tuhanku tidak memberikan taufik kepadaku menuju kebenaran dalam bertauhid kepadaNya, niscaya aku pasti termasuk orang-orang yang sesat dari jalan lurus dengan menyembah selain Allah . ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Dan ketika melihat bulan muncul di langit, Ibrahim berkata “Ini adalah tuhanku!” Namun tatkala bulan itu terbenam, Ibrahim berkata, “Sungguh, jikalau Allah tidak membimbingku untuk mengesakan-Nya dan menyembah-Nya semata, niscaya aku benar-benar akan termasuk ke dalam golongan orang-orang yang jauh dari agama-Nya yang hak.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Ketika Ibrahim melihat bulan telah nampak, sedangkan bulan itu telah dijadikan kaumnya sebagai Tuhan selain Allah, maka dia berkata kepada mereka sebagai bentuk sindiran: \"Inilah Tuhanku!\". Ini merupakan bentuk keingkaran bahwa bintang atau bulan yang seperti itu tidak akan menjadi tuhan. Ketika bulan itu tenggelam dan lenyap, Ibrahim berkata -dengan penuh ancaman kepada mereka tentang kesudahan yang buruk bagi orang yang menyembah bintang-bintang tersebut-: “Kalaulah Tuhanku tidak memberiku petunjuk kepada jalan yang lurus dalam mengesakan dan menyembah-Nya, niscaya aku termasuk orang-orang yang berpaling dari jalan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. فَلَمَّا رَءَا الْقَمَرَ بَازِغًا (Kemudian tatkala dia melihat bulan terbit) Yakni yang muncul. فَلَمَّآ أَفَلَ قَالَ لَئِن لَّمْ يَهْدِنِى رَبِّى(Tetapi setelah bulan itu terbenam, dia berkata: “Sesungguhnya jika Tuhanku tidak memberi petunjuk kepadaku) Yakni yang menunjukkan Tuhan yang hakiki. لَأَكُونَنَّ مِنَ الْقَوْمِ الضَّآلِّينَ(pastilah aku termasuk orang yang sesat) Yakni orang-orang yang tidak mendapat petunjuk kepada kebenaran, sehingga mereka menzalimi diri mereka dan menghalangi diri mereka dari balasan yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77 Kemudian tatkala dia melihat bulan terbit dia berkata kepada kaumnya: “Inilah Tuhanku”. Tetapi setelah bulan itu terbenam, dia berkata: “Sesungguhnya jika Tuhanku tidak memberi petunjuk kepadaku, pastilah aku termasuk orang yang sesat dari petunjuk yang benar.”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu ketika dia melihat bulan terbit} muncul {dia berkata,“Inilah Tuhanku.” Lalu ketika bulan itu terbenam} menghilang {dia berkata, “Sungguh jika Tuhanku tidak memberi petunjuk kepadaku, maka sungguh aku benar-benar termasuk kaum yang sesat.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. “Kemudian tatkala dia melihat bulan terbit,” dan dia melihatnya dan lebih bercahaya dari cahaya bintang, “dia berkata, ‘Inilah Tuhanku’,” dengan nada merendah. “ tetapi setelah bulan terbenam, dia berkata ‘Sesungguhnya bila tuhanku tidak memberi petunjuk kepadaku, pastilah aku termasuk ke dalam orang-orang yang sesat’.” Maka dia benar-benar membutuhkan hidayah dari tuhannya. Dia menyadari bahwa dia tidak memberinya petunjuk, maka tidak ada yang memberi petunjuk kepadanya. Jika dia tidak membantunya dalam menaatinya maka tidak ada penolong bagiNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 77: Kepada orang-orang musyrik tersebut. Pantaskah benda seperti ini disembah? Yakni tidak meneguhkanku di atas hidayah. Kata-kata ini merupakan sindiran kepada kaumnya bahwa mereka adalah orang-orang yang sesat, namun kata-kata Beliau tidak bermanfaat apa-apa bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 77",
    "description": "Setelah terbukti bahwa bintang yang cahayanya sangat kecil dalam pandangan mata telanjang manusia di bumi ini tidak wajar dipertuhankan, lalu ketika dia, ibrahim, mengalihkan pandangannya dengan melihat bulan terbit yang cahayanya lebih terang, dia berkata, inilah tuhanku yang kucari. Tetapi ketika bulan itu terbenam, dia pun berkata, sungguh, jika tuhanku yang telah membimbingku tidak memberi petunjuk kepadaku, pastilah aku termasuk orang-orang yang sesat karena menyembah yang bukan tuhan serta mengabdi kepada selain-Nya. Matahari yang sinarnya lebih terang menjadi tujuan proses pencarian selanjutnya. Kemudian ketika dia, ibrahim, melihat matahari terbit pada pagi hari, dia berkata, inilah tuhanku yang kucari, ini lebih besar dan lebih terang sinarnya. Tetapi ketika matahari terbenam pada sore hari dan dia menyimpulkan sebagaimana kesimpulannya ketika melihat bintang dan bulan, dia pun berkata, wahai kaumku! sungguh, aku berlepas diri dari penyembahan bintang, bulan, matahari, dan apa saja yang kamu persekutukan dengan tuhan yang maha esa, tuhan yang sebenarnya. Sesungguhnya aku hadapkan wajahku, yakni seluruh jiwa raga dan totalitas hidupku, kepada tuhan, zat yang menciptakan langit dan bumi dengan segala isinya termasuk bintang, bulan, dan matahari, dengan penuh kepasrahan mengikuti agama yang benar, dan aku bukanlah termasuk orang-orang musyrik."
  }
]