[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika Ibrahim melihat matahari sedang terbit, dia berkata kepada kaumnya, ”ini tuhanku, ini lebih besar dari bintang-bintang dan bulan.” Ketika matahari telah tenggelam, dia berkata kepada kaumnya, ”sesungguhnya aku berlepas diri dari apa yang kalian persekutukan berupa menyembah berhala-berhala, bintang-bintang, dan patung-patung yang kalian sembah selain Allah . ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Dan tatkala melihat matahari terbit, Ibrahim berkata, “Yang terbit ini adalah tuhanku. Yang terbit ini lebih besar dari bintang dan bulan.” Kemudian tatkala matahari itu terbenam, Ibrahim berkata, “Wahai kaumku, sesungguhnya aku berlepas diri dari apa yang kalian jadikan sekutu dengan Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. ketika Ibrahim melihat matahari telah terbit -sedangkan matahari juga telah dijadikan kaumnya sebagai Tuhan selain Allah-, maka dia berkata kepada kaumnya sebagai bentuk sindiran: “Inilah tuhanku, ini adalah bintang yang paling besar”. Dan yang dimaksud Ibrahim adalah: “Apakah ini tuhan yang kalian percayai?” Dan yang dia maksud dengan paling besar adalah paling terang cahayanya dan lebih utama untuk dijadikan tuhan; dan ini juga termasuk dari sindirannya. Namun ketika matahari itu tenggelam dengan datangnya malam, ia berkata: “Aku berlepas diri dari kesyirikan kalian dengan menyembah berhala dan bintang-bintang. Ketika Ibrahim menyebutkan ‘matahari’, dia menggunakan kata tunjuk ‘هذا’ dan tidak menggunakan ‘هذه’ agar perkataannya mempunyai satu gaya bahasa. Dan ini juga sebagai penyucian kata ‘tuhan’ sepenuhnya sehingga tidak menjadikannya bersanding dengan tanda-tanda kata bentuk muannast, dan karena kata ‘الشمس’ (matahari) bukan merupakan kata muannast hakiki, namun muannast secara majas. Ibrahim telah berhasil menyampaikan kebenaran kepada kaumnya dengan menjelaskan bahwa menyembah bintang-bintang merupakan hal yang batil, dan dengan kembali kepada fitrah manusia sesuai dengan penciptaan Allah, yaitu untuk menyembah dan mengesakan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. قَالَ هٰذَا رَبِّى (Inilah Tuhanku) Yakni sesuatu yang terbit ini. هٰذَآ أَكْبَرُ ۖ (ini yang lebih besar) Yakni lebih besar dari yang sebelumnya seperti bintang-bintang dan bulan, maka yang ini lebih pantas untuk menjadi tuhan. قَالَ يٰقَوْمِ إِنِّى بَرِىٓءٌ مِّمَّا تُشْرِكُونَ (dia berkata: “Hai kaumku, sesungguhnya aku berlepas diri dari apa yang kamu persekutukan) Yakni dari segala sesuatu yang kalian jadikan sebagai sekutu-sekutu yang kalian sembah selain Allah; Nabi Ibrahim mengatakan ini ketika terbukti bahwa hal-hal ini hanyalah makhluk-makhluk yang tidak dapat memberi manfaat dan mudharat, dan tidak ada satupun dari hal-hal ini yang merupakan Tuhan semesta alam dengan bukti bahwa semua ini dapat hilang dan terbenam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam ayat dikatakan : { هَٰذَا رَبِّي } datang dengan susunan \"mudzakkar\", padahal sebelumnya الشمس datang dengan konteks \"mu'annats\"; karena dalam hal yang dimaksud adalah \"هذا الطالع\" dengan susunan \"mudzakkar\" yang berarti : yang terbit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78 Kemudian tatkala ia melihat matahari terbit dari timur, dia berkata: “Inilah Tuhanku, ini yang lebih besar dari bintang maupun rembulan”. Maka tatkala matahari itu terbenam, dia berkata: “Hai kaumku, sesungguhnya aku berlepas diri dari apa yang kamu persekutukan atas Allah dan juga kalian jadikan sesembahan. Ibrahim telah menetapkan ketuhanan Allah sebab terbenamnya berbagai benda langit itu, bahwa semua tadi tidak kuasa mendatangkan bahaya ataupun manfaat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian ketika dia melihat matahari terbit} terbit {dia berkata,“Inilah Tuhanku. Ini lebih besar.” Lalu ketika matahari terbenam} menghilang {dia berkata,“Wahai kaumku, sesungguhnya aku berlepas diri dari yang kalian persekutukan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. “ Kemudian tatkala dia melihat matahari terbit, dia berkata, ‘Inilah Tuhanku, ini yang lebih besar’,” daripada bintang dan bulan. “ maka tatakala matahari itu telah terbenam,” terungkaplah petunjuk untuknya. Pada saat itu hilanglah kebodohan. “ Dia berkata, ‘Hai kaumku sesungguhnya aku berlepas diri dari apa yang kamu persekutukan’.” Yang mana dalil yang benar dan jelas menyatakan kebathilannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 78: Hujjah yang disampaikan kepada mereka semakin kuat dan kebenaran semakin jelas. Dengan Allah berupa patung dan benda-benda di luar angkasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 78",
    "description": "Matahari yang sinarnya lebih terang menjadi tujuan proses pencarian selanjutnya. Kemudian ketika dia, ibrahim, melihat matahari terbit pada pagi hari, dia berkata, inilah tuhanku yang kucari, ini lebih besar dan lebih terang sinarnya. Tetapi ketika matahari terbenam pada sore hari dan dia menyimpulkan sebagaimana kesimpulannya ketika melihat bintang dan bulan, dia pun berkata, wahai kaumku! sungguh, aku berlepas diri dari penyembahan bintang, bulan, matahari, dan apa saja yang kamu persekutukan dengan tuhan yang maha esa, tuhan yang sebenarnya. Sesungguhnya aku hadapkan wajahku, yakni seluruh jiwa raga dan totalitas hidupku, kepada tuhan, zat yang menciptakan langit dan bumi dengan segala isinya termasuk bintang, bulan, dan matahari, dengan penuh kepasrahan mengikuti agama yang benar, dan aku bukanlah termasuk orang-orang musyrik"
  }
]