[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik itu mengatakan, ”mengapa Allah tidak menurunkan kepada Muhammd malaikat dari langit untuk membenarkannya tentang apa yang dia bawa berupa kenabian? ”seandanya kami menurunkan malaikat dari langit untuk mengabulkan permintaan mereka, pastilah telah diputuskan perintah untuk membinasakan mereka, kemudian mereka tidak diberi kesempatan untuk bertaubat, maka sungguh telah berlalu dalam ilmu Allah bahwa mereka tidak akan beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan orang-orang kafir itu akan berkata, “Seandainya Allah menurunkan bersama Muhammad seorang malaikat yang berbicara dengan kami dan bersaksi bahwa Muhammad adalah seorang rasul pasti kami akan beriman kepadanya.” Seandainya Kami benar-benar menurunkan seorang malaikat seperti yang mereka inginkan, niscaya Kami akan membinasakan mereka apabila mereka tidak mau beriman, dan mereka tidak akan diberi kesempatan untuk bertobat ketika malaikat tersebut turun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Orang-orang yang mendustakan Rasulullah itu berkata: \"Mengapa tidak diturunkan bersamanya seorang malaikat dari langit yang membenarkan apa yang dia katakan dan mengaku bahwa malaikat itu diutus oleh Allah.\" Seandainya Allah mengabulkan permintaan mereka niscaya mereka akan segera dibinasakan jika mereka tetap kafir terhadap-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَقَالُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ مَلَكٌ ۖ (Dan mereka berkata: “Mengapa tidak diturunkan kepadanya (Muhammad) malaikat?”) Yakni tidakkah Allah menurunkan kepadamu malaikat yang bisa kami lihat lalu mengatakan kepada kami bahwa kamu adalah nabi, agar kita beriman dan menjadi pengikutmu. وَلَوْ أَنزَلْنَا مَلَكًا (dan kalau Kami turunkan (kepadanya) malaikat) Yakni seandainya Kami menurunkan malaikat dengan sifat yang kalian usulkan, yang bisa mereka lihat dan bercakap-cakap dengan mereka. لَّقُضِىَ الْأَمْرُ (tentulah selesai urusan itu) Niscaya Kami akan segera membinasakan mereka apabila mereka masih saja tidak beriman saat malaikat itu turun dan mereka menyaksikannya. ثُمَّ لَا يُنظَرُونَ (kemudian mereka tidak diberi tangguh) Yakni tidak diberi waktu lagi setelah malaikat itu turun dan mereka menyaksikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Orang-orang musyrik Mekah berkata: “Mengapa tidak diturunkan kepada Muhammad malaikat yang bisa kami lihat, yang mana dia bersaksi bahwa Muhammad adalah nabi yang sudah diutus, sehingga kami beriman dan mengikutinya?” Jika Kami menurunkan malaikat, maka sungguh tuntaslah perkara pembinasaan mereka, kemudian mereka tidak diberi tangguh waktu untuk beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Mengapa tidak diturunkan kepadanya”} kepada nabi Muhammad SAW {malaikat. Jika Kami turunkan malaikat, niscaya selesailah urusan} maka sungguh usailah urusan dengan membinasakan mereka {kemudian mereka tidak lagi ditangguhkan} mereka tidak ditangguhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “ Dan mereka berkata,” dengan keras kepala yang dilandasi dengan kebodohan dan ketidaktahuan terhadap perkara yang masuk akal, “ mengapa tidak diturunkan kepadaNya (Muhammad) seorang malaikt?” mengapa tidak diturunkan kepada Muhammad dengan seorang malaikat yang menolongnya dan membantuNya dalam menunaikan tugasnya dengan anggapan dari mereka bahwa dia adalah manusia, sementara risallah Allah tidak akan sampai kecuali dengan tangan para malaikat. Allah menjelaskan kasih sayang dan rahmatNya kepada hamba-hambaNya dimana Dia mengutus kepada mereka manusia dari kalangan mereka sendiri, agar keimanan kepada syariat yang di bawanya adalah dengan di dasari ilmu, bashirah secara ghaib. “ dan kalau kami turunkan kepadanya deorang malaikat,” dengan membawa risalah kami, niscaya iman tersebut tidak di dasari oleh pengetahuan terhadap kebenaran dan niscaya iman tersebut hanya di dasari dengan perkara yang kasat mata, yang iaman itu sendiri sama sekali tidak berguna. Itu adalah mereka beriman, namun biasanya mereka tidak beriman, jika mereka tidak beriman, “ tentu selesailah urusan itu,” dan menyegerakan kebinasaan kepada mereka dan tidak ada penundaan lagi bagi mereka, karena ini adalah sunnatullah yang berlaku kepada orang yang meminta turunNya ayat yang du usulkan lalu tidak beriman kepadanya. Pengutusan seorang Rasul manusia kepada mereka dengan membawa ayat-ayat yang jelas di mana Allah mengetahui bahwa ia lebih baik dan lebih lembut bagi para hamba di sertai penagguhanNya terhadap orang-orang kafir yang mendustakan Allah adalah lebih baik dan lebih berguna bagi mereka, jadi tuntunan mereka agar malaikat turun adalah lebih buruk bagi merekajika mereka mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 8: Maksudnya untuk menerangkan dan menguatkan bahwa Muhammad shallallahu 'alaihi wa sallam itu seorang Nabi. Sebagaimana yang mereka usulkan. Maksudnya kalau diturunkan kepada mereka malaikat, lalu mereka tidak juga beriman, tentulah mereka akan diazab oleh Allah saat itu juga, sehingga mereka binasa semuanya. Oleh karena itu, diutusnya rasul dari kalangan manusia dengan membawa bukti yang nyata, ditambah dengan diberi tangguh sesungguhnya hal itu lebih baik bagi mereka dan lebih bermanfaat, daripada diutusnya rasul dari kalangan malaikat yang jika mereka tetap mendustakan, mereka langsung dibinasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 8",
    "description": "Dan mereka, orang-orang kafir itu, juga berkata, mengapa tidak diturunkan malaikat kepadanya, nabi Muhammad, yang menolongnya dari kesulitan, kalau benar dia utusan Allah' Allah menjawab ucapan mereka dengan berfirman, jika kami menurunkan malaikat kepadanya, yang membantu beliau menghadapi musuh-Musuh Allah, tentu selesailah urusan orang-orang kafir itu dan mereka langsung dibinasakan. Kemudian mereka, setelah dibinasakan, tidak diberi penangguhan sedikit pun dari azab Allah sejak di alam kubur hingga di neraka. Allah masih melanjutkan jawaban terhadap pertanyaan orang-orang kafir tersebut. Dan sekiranya rasul itu kami jadikan dari malaikat, maksudnya bahwa kalau Allah mengutus malaikat sebagai rasul, tentu Allah mengutusnya dalam bentuk manusia, pastilah kami jadikan dia berwujud laki-laki, sebagaimana yang mereka minta, karena manusia tidak dapat melihat malaikat, dan, dengan demikian, tentu mereka akan berkata juga, ini bukanlah malaikat, hanya manusia sebagaimana kami juga. Jika begitu sikap mereka, pasti kami akan menjadikan mereka tetap ragu, karena pada intinya mereka menolak kehadiran seorang utusan sebagaimana kini mereka ragu terhadap kerasulan nabi Muhammad."
  }
]