[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana aku harus menjadi takut kepada berhala-berhala kalian, sedang kalian tidak takut kepada tuhanku yang telah menciptakan kalian dan menciptakan berhala-berhala yang kalian persekutukan dengan Allah dalam ibadah, tanpa ada hujjah bagi kalian dalam perkara tersebut? maka manakah dari dua golngan itu, yaitu golongan orang-orang musyrik dan golongan orang –orang yang bertauhid, yang lebih berhak memperoleh ketenangan dan keselamatan serta keamanan dari siksa Allah ? jika kalian mengetahui kebenaran apa yang aku katakan, maka beritahukanlah kepadaku. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Bagaimana mungkin aku merasa takut kepada berhala-berhala yang kalian sembah selain Allah, sedangkan kalian tidak merasa takut ketika menyekutukan Allah dengan makhluk-Nya tanpa sedikit pun dalil yang mendukung tindakan itu? Golongan manakah di antara golongan yang mengesakan Allah dan golongan yang menyekutukan Allah yang lebih pantas mendapatkan keselamatan? Jika kalian mengetahui golongan mana yang lebih pantas mendapatkannya, maka ikutilah golongan tersebut. Tidak diragukan lagi bahwa golongan yang lebih pantas mendapatkan keselamatan itu ialah golongan mukminin yang mengesakan Allah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Lalu bagaimana aku akan takut dari berhala-berhala kalian yang merupakan benda mati dan makhluk Allah yang tidak dapat mendatangkan manfaat atau mudharat? Dan bagaimana kalian tidak takut kepada Allah yang telah menciptakan kalian dan menciptakan langit dan bumi, yang Dia Maha menghidupkan dan mematikan, segala sesuatu ada di tangan-Nya? Maka Siapakah yang berhak merasa aman; orang yang menyembah Allah yang memiliki segala sifat kesempurnaan tersebut, atau orang yang menyembah berhala'berhala yang tidak dapat mendatangkan manfaat atau mudharat? Dan adab Nabi Ibrahim ketika berdebat dengan lawannya, dia tidak berkata: \"Apakah aku atau kalian yang lebih berhak merasa aman?\" Akan tetapi nabi Ibrahim berkata: \"Maka golongan yang mana yang lebih berhak merasa aman jika kalian memahami hujjah-hujjah dan bukti-bukti tersebut?\" Adab ini mirip dengan yang Allah ajarkan kepada Nabi Muhammad ketika berdebat dengan orang-orang musyrik, Allah berfirman: وإنا أو أياكم لعلى هدى أو في ضلال مبين “Dan sesungguhnya kami atau kamu (orang-orang musyrik), pasti berada dalam kebenaran atau dalam kesesatan yang nyata.” (Saba': 24) Dalam ayat ini tidak disebutkan secara langsung bahwa mereka di atas jalan kesesatan sedangkan Nabi Muhammad di atas jalan kebenaran. Hal ini ditujukan agar tidak mengundang kemarahan mereka, namun mereka dibiarkan untuk memahami dengan fitrah dan akal mereka ketika dijelaskan dua jalan tersebut, dan mereka pasti akan menilai bahwa Nabi Muhammad di atas petunjuk sedangkan mereka di atas kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَكَيْفَ أَخَافُ مَآ أَشْرَكْتُمْ وَلَا تَخَافُونَ أَنَّكُمْ أَشْرَكْتُم بِاللهِ مَا لَمْ يُنَزِّلْ بِهِۦ عَلَيْكُمْ سُلْطٰنًا ۚ (Bagaimana aku takut kepada sembahan-sembahan yang kamu persekutukan (dengan Allah), padahal kamu tidak takut mempersekutukan Allah dengan sembahan-sembahan yang Allah sendiri tidak menurunkan hujjah kepadamu) Yakni bagaimana aku akan takut pada sesuatu yang tidak memberi mudharat dan manfaat, tidak dapat menciptakan dan memberi rezeki. Dan kenyataan sesungguhnya adalah kalianlah yang tidak untuk mempersukutukan Allah, padahal Dia-lah yang memberi mudharat dan mamfaat, menciptakan dan memberi rezeki. فَأَىُّ الْفَرِيقَيْنِ أَحَقُّ بِالْأَمْنِ ۖ( Maka manakah di antara dua golongan itu yang lebih berhak memperoleh keamanan (dari malapetaka)) Golongan orang-orang yang beriman kepada Allah yang Maha Kuat dan Kuasa, orang-orang yang ingkar terhadap patung yang lemah; atau golongan orang-orang yang beriman kepada patung yang lemah dan kafir terhadap Allah yang Maha Kuat dan Kuasa. Beritahukan kepadaku: golongan mana yang lebih layak untuk mendapatkan keamanan dan tidak takut? إِن كُنتُمْ تَعْلَمُونَ (jika kamu mengetahui?) Mengetahui bukti-bukti yang benar dan dapat membedakannya dari syubhat-syubhat yang bathil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81 Bagaimana aku takut kepada sembahan-sembahan yang kamu persekutukan dengan Allah, padahal mereka tidak bisa berbuat apapun? Padahal kamu tidak takut mempersekutukan Allah dengan sembahan-sembahan yang Allah sendiri tidak menurunkan hujjah kepadamu untuk mempersekutukan-Nya. Maka manakah di antara dua golongan itu, mukmin kepada Allah atau yang ingkar kepada Allah yang lebih berhak memperoleh keamanan dari malapetaka, jika kamu mengetahui kebenaran dan berbagai bukti yang benar dan juga bisa membedakan mana yang haq dan batil?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana mungkin aku takut kepada yang kalian sekutukan, dan kalian tidak takut menyekutukan Allah. Dia tidak pernah menurunkan kepada kalian alasan apa pun} alasan dan bukti {Maka golongan yang manakah dari keduanya yang lebih benar} lebih utama {mendapat keamanan. jika kalian mengetahui”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “Bagaimana aku takut kepada sesembahan-sesembahan yang kamu persekutukan (dengan Allah),” sementara keadaannya adalah lemah dan tidak berguna. “Padahal kamu tidak takut mempersekutukan Allah dengan sesembahan-sesembahan yang Allah sendiri tidak menurunkan hujjah kepadamu untuk mempersekutukanNya.” Kecuali hanya mengikuti hawa nafsu. “Maka manakah di antara dua golongan itu yang lebih berhak mendapat keamanan (dari malaikat), jika kamu mengetahui?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 81: Sedangkan sesembahan itu tidak dapat memberi manfaat atau menimpakan madharrat (bahaya). Sedangkan Dia Maha Kuasa; berbeda dengan sesembahan kamu yang begitu lemah. Yakni saya (Ibrahim) ataukah kamu? Setelah Allah memperlihatkan kepada Nabi Ibrahim 'alaihis salam tanda-tanda keagungan-Nya dan dengan itu semakin teguhlah imannya kepada Allah (ayat 75), maka Nabi Ibrahim 'alaihis salam mengajak kaumnya kepada tauhid dengan mengikuti alam pikiran mereka untuk kemudian membantah keyakinan dan sikap mereka selama ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 81",
    "description": "Terhadap ketegaran sikap nabi ibrahim tersebut kaumnya terus menantang dan mengancamnya. Maka nabi ibrahim pun menjawab, bagaimana aku takut kepada apa yang kamu persekutukan dengan Allah, baik benda-benda angkasa maupun berhala-berhala yang sama sekali tidak memiliki kekuasaan apa pun selain apa yang diizinkan oleh Allah, padahal kamu tidak takut dengan apa yang Allah sendiri tidak menurunkan keterangan kepadamu untuk mempersekutukan-Nya. Kalau demikian, manakah dari kedua golongan itu, yakni kami yang mengesakan Allah atau kalian yang mempersekutukan-Nya, yang lebih berhak mendapat keamanan dari siksa dan malapetaka, jika kamu mengetahui coba jelaskan kepada kami' karena sama sekali tidak ada jawaban dari kaum nabi ibrahim yang durhaka tersebut, akhirnya nabi ibrahim sendiri menegaskan sebuah prinsip penting bahwa orang-orang yang beriman kepada Allah yang maha esa dan tidak mencampuradukkan iman mereka dengan kezaliman, yakni syirik (lihat: surah luqma'n/31: 13), mereka itulah lebih tinggi derajatnya di sisi Allah. Mereka adalah orang-orang yang mendapat rasa aman dari Allah yang mereka sembah, dan mereka mendapat petunjuk secara sempurna."
  }
]