[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang beriman kepada Allah dan RasulNya, dan melaksanakan syariatNya dan tidak mencampuradukkan keimanan mereka dengan kesyirikan, mereka itulah yang akan mendapatkan ketenangan dan keselamatan, dan mereka itulah orang-orang yang memperoleh taufik menuju jalan yang haq."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Hanya orang-orang yang beriman kepada Allah dan mengikuti syariat-Nya, serta tidak mencampur iman mereka dengan syirik sajalah yang akan mendapatkan kedamaian dan keselamatan, bukan golongan yang lain. Mereka adalah orang-orang yang mendapatkan bimbingan. Mereka dibimbing oleh Rabb mereka ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Dalam ayat ini disebutkan jawaban dari Allah atas pertanyaan nabi Ibrahim yang diberikan kepada orang-orang musyrik ketika terjadi perdebatan, Dia berfirman: orang-orang yang beriman kepada Allah dan tidak mencampur keimanan mereka dengan kesyirikan, maka mereka akan mendapat keamanan di dunia dan mereka adalah orang-orang yang mendapat petunjuk dan teguh di atas kebenaran. Dari Abdullah bin Mas'ud, ia berkata, ketika turun ayat: الذين ءامنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون Para sahabat berkata: \"Namun siapa dari kita yang tidak pernah berbuat zalim?\" Maka turunlah ayat: يبني لا تشرك بالله أن الشرك لظلم عظيم (Shahih Bukhari 8/ 144 no. 4629, kitab at-tafsir, surat al-an'am)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. الَّذِينَ ءَامَنُوا۟ (Orang-orang yang beriman) Yakni mereka adalah orang-orang yang lebih berhak mendapat keamanan daripada orang-orang musyrik. وَلَمْ يَلْبِسُوٓا۟ إِيمٰنَهُم بِظُلْمٍ (dan tidak mencampuradukkan iman mereka dengan kezaliman) Yakni yang tidak mencampurnya dengan kezaliman. Dan yang dimaksud dengan kezaliman disini adalah kesyirikan, karena syirik merupakan perbuatan menjadikan peribadatan untuk yang berhak diibadahi; sedangkan makna zalim adalah menolak memberikan hak kepada yang berhak dan memberikannya kepada yang tidak berhak. Ibnu mas’ud berkata: ketika ayat ini diturunkan para sahabat Rasulullah merasa berat, lalu mereka berkata kepadanya: “siapa yang mampu untuk tidak menzalimi dirinya?”. Maka rasulullah menjawab: “ayat ini tidak seperti apa yang kalian bayangkan, tetapi ayat ini sebagaimana yang Lukman al-hakim katakan: Hai anakku, janganlah kamu berbuat syirik kepada Allah, karena kesyirikan sungguh adalah kezaliman yang besar.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam ayat ini disebutkan kata : { الْأَمْنُ } dan di ayat lain Allah mengatakan : { اَمَنَةً } dan kedua kata ini memiliki makna yang sama namun sedikit ada perbedaan, yaitu : الأمن : adalah kedamaian yang tidak disertai sebab munculnya ketakutan, sebagaimana Allah berfirman : { الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُمْ بِظُلْمٍ أُولَٰئِكَ لَهُمُ الْأَمْنُ وَهُمْ مُهْتَدُونَ } \"Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman (syirik), mereka itulah yang mendapat keamanan dan mereka itu adalah orang-orang yang mendapat petunjuk.\" Sedangkan : أمنة : adalah kedamaian yang disertai adanya sebab munculnya rasa takut, sebagaimana firman Allah { إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِنْهُ وَيُنَزِّلُ عَلَيْكُمْ مِنَ السَّمَاءِ مَاءً لِيُطَهِّرَكُمْ بِهِ } \"(Ingatlah), ketika Allah menjadikan kamu mengantuk sebagai suatu penenteraman daripada-Nya, dan Allah menurunkan kepadamu hujan dari langit untuk mensucikan kamu dengan hujan itu\" [ Al-Anfal : 11 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82 Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezaliman syirik, mereka itulah yang berhak mendapat keamanan dan terbebas dari azab di akhirat dan mereka itu adalah orang-orang yang mendapat petunjuk kebenaran. Ayat ini turun untuk seorang musuh yang membunuh dua orang muslim, kemudian dia berkata: apakah Islam ada manfaatnya bagiku? Nabi menjawab: Iya, kemudian tiga temannya terbunuh, kemudian dia pun terbunuh. Sehingga turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman dan tidak mencampur} mencampur {iman mereka dengan kezaliman} kemusyrikan {merekalah orang-orang yang mendapat rasa aman dan merekalah orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Allah berfirman untuk memberi keputusan kepada kedua kelompok, “Orang-orang yang beriman dan tidak mencampuradukkan iman mereka dengan kezhaliman (syirik), mereka itulah orang-orang yang mendapat petunjuk.” Aman dari ketakutan, azab, dan kesengsaraan serta mendapatkan hidayah kepada jalan yang lurus. Jika mereka tidak mencampur iman dengan kezhaliman secara mutlak, baik itu syirik dan kemaksiatan, maka mereka mendapatkan rasa aman dan hidayah yang sempurna. Jika mereka tidak mencampurnya dengan kesyirikan saja, namun mereka masih melakukan keburukan-keburukan, maka mereka mendapatkan pokok hidayah dan pokok rasa aman walaupun kesempurnaannya tidak tercapai. Pengertian dari ayat yang mulia ini adalah bahwa orang-orang yang tidak mencapai dua perkara itu, maka mereka juga tidak mendapatkan hidayah dan rasa aman. Akan tetapi bagian yang mereka dapatkan adalah kesesatan dan kesengsaraan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 82: Di ayat ini Allah Subhaanahu wa Ta'aala menyelesaikan perselisihan antara Nabi Ibrahim 'alaihis salam dengan kaumnya. Dari azab dan kesengsaraan. Ke jalan yang lurus. Jika seseorang tidak mencampuradukkan keimanan dengan kezaliman secara mutlak; baik dengan syirk maupun maksiat, maka mereka memperoleh keamanan dan hidayah yang sempurna, namun jika mereka hanya tidak mencampuradukkan keimanan mereka dengan kesyirkan, tetapi mereka mengerjakan perbuatan maksiat, maka mereka memiliki asal (dasar) hidayah dan asal keamanan. Ayat ini juga menunjukkan, bahwa barang siapa yang berbuat syirk ditambah lagi dengan kemaksiatan, maka ia tidak memperoleh hidayah maupun keamanan, bahkan yang mereka peroleh adalah kesesatan dan kesengsaraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 82",
    "description": "Karena sama sekali tidak ada jawaban dari kaum nabi ibrahim yang durhaka tersebut, akhirnya nabi ibrahim sendiri menegaskan sebuah prinsip penting bahwa orang-orang yang beriman kepada Allah yang maha esa dan tidak mencampuradukkan iman mereka dengan kezaliman, yakni syirik (lihat: surah luqma'n/31: 13), mereka itulah lebih tinggi derajatnya di sisi Allah. Mereka adalah orang-orang yang mendapat rasa aman dari Allah yang mereka sembah, dan mereka mendapat petunjuk secara sempurna. Atas semua argumen yang telah dijelaskan pada ayat sebelumnya, Allah pun menegaskan sebagai berikut. Dan itulah keterangan kami yang kami berikan dan ajarkan melalui malaikat dan atau kami ilhamkan kepada ibrahim untuk menghadapi kaumnya agar dia dapat mengatasi dan mengalahkan mereka. Kami tinggikan derajat siapa yang kami kehendaki dari hamba-hamba kami yang taat, sebagaimana nabi ibrahim yang telah kami tinggikan derajatnya agar menjadi teladan bagi manusia. Sesungguhnya tuhanmu mahabijaksana, maha mengetahui atas segala sesuatu."
  }
]