[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hujjah yang dikemukakan Ibrahim untuk menghadapi kaumnya itu merupakan hujjah kami yang telah kami berikan taufik untuk itu kepada Ibrahim hingga semua hujjah-hujjah mereka terpatahkan. kami tinggikan siapa saja yang kami kehendaki dari para hamba kami beberapa derjat di dunia dan akhirat. Sesungguhnya tuhanmu itu Mahabijaksana dalam pengaturan makhlukNya dan Maha Mengetahui tentang mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Firman Allah (Manakah dari kedua golongan itu yang lebih berhak mendapat keselamatan) yaitu argumen yang digunakan oleh Ibrahim untuk mengalahkan argumen kaumnya itu adalah argumen yang Kami ajarkan kepadanya untuk mengalahkan argumen kaumnya. Argumen itu Kami berikan kepadanya untuk mengangkat derajat hamba-hamba Kami yang Kami kehendaki hingga beberapa derajat di dunia dan Akhirat. Sesungguhnya Rabbmu -wahai Rasul- adalah Rabb Yang Maha Bijaksana dalam mengatur dan mengurus makhluk-Nya lagi Maha Mengetahui perihal hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Allah telah memberi Nabi Ibrahim hujjah-hujjah dan bukti-bukti yang dipakai untuk mendebat kaumnya, sehingga dia dapat mengalahkan mereka. Dan Allah telah memberinya ilmu, hikmah, dan keyakinan. Allah Maha Bijaksana dalam pengaturan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَتِلْكَ حُجَّتُنَآ (Dan itulah hujjah Kami) Yakni hujjah-hujjah yang telah Nabi Ibrahim kemukakan. ءَاتَيْنٰهَآ إِبْرٰهِيمَ عَلَىٰ قَوْمِهِۦ ۚ (yang Kami berikan kepada Ibrahim untuk menghadapi kaumnya) Yakni Kami tolong Ibrahim dengan mengajarinya hujjah-hujjah tersebut, sehingga ia dapat mengalahkan kaumnya. نَرْفَعُ دَرَجٰتٍ مَّن نَّشَآءُ ۗ( Kami tinggikan siapa yang Kami kehendaki beberapa derajat) Yakni dengan memberinya hidayah dan petunjuk kepada kebenaran serta pemberian hujjah, sebagaimana Kami angkat Ibrahim beberapa derajat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagaimana kami menaikkan derajat Ibrahim -عليه السلام- di dunia dan di akhirat, maka kami pun dengan ilmu mengangkat pemiliknya dia atas hamba-hamba derajat yang tinggi, khususnya seorang 'alim yang dengan ilmunya ia mengamalkan dan mengajarkannya kepada orang lain, maka dengan itu kami menjadikannya pula sebagai imam bagi umat manusia tentunya sesuai dengan keadaan yang terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83 Itulah hujjah Kami yang disebutkan oleh lisan Ibrahim yang Kami berikan kepada Ibrahim untuk menghadapi kaumnya, atau telah Kami ilhamkan kepadanya. Supaya dijadikan hujjah untuk menyanggah pemikiran syirik mereka agar mereka mau berfikir. Kami tinggikan siapa yang Kami kehendaki dari hamba-hamba Kami beberapa derajat di dunia dengan kenabian, ilmu dan hikmah, serta petunjuk dan pengetahuan tentang kebenaran. Sesungguhnya Tuhanmu Maha Bijaksana dalam segala perbuatan-Nya lagi Maha Mengetahui atas ciptaan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah keterangan yang Kami anugerahkan kepada Ibrahim untuk menghadapi kaumnya. Kami tinggikan orang yang Kami kehendaki beberapa derajat. Sesungguhnya Tuhanmu Maha bijaksana lagi Maha Mengetahui."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Manakala Allah menetapkan untuk Nabi Ibrahim dengan menjelaskan padanya tentang bukti-bukti yang kuat, maka Dia berfirman, “Dan itulah hujjah Kami yang Kami berikan kepada Ibrahim untuk menghadapi kaumnya.” Ibrahim mengungguli dan mengalahkan mereka dengannya. “Kami tinggikan siapa yang Kami kehendaki beberapa derajat,” sebagaimana Kami meninggikan derajat Ibrahim di dunia dan akhirat. Allah mengangkat pemilik ilmu beberapa derajat bagi yang beramal lagi mendidik. Allah menjadikannya sebagai pemimpin menurut keadaannya, perbuatannya dicermati, langkahnya diikuti, cahayanya diambil, dan ilmunya digunakan sebagai pegangan dalam kegelapan. Allah berfirman, “niscaya Allah akan meninggikan orang-orang yang beriman di antaramu dan orang-orang yang diberi ilmu pengetahuan beberapa derajat.” (Al-Mujadilah:11). “Sesungguhnya Tuhanmu Mahabijaksana lagi Maha Mengetahui.” Dia tidak meletakkan ilmu dan hikmah kecuali di tempat yang sesuai dengannya, dan Dia lebih mengetahui tempat itu dan yang seharusnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 83: Di dunia dan akhirat, seperti kepada Nabi Ibrahim 'alaihis salam. Hal itu, karena dengan ilmu Allah meninggikan hamba-hamba-Nya, khususnya orang yang berilmu, beramal dan mengajarkan ilmunya, maka Allah menjadikannya sebagai imam bagi manusia sesuai keadaannya; di mana perbuatannya akan diperhatikan, jejaknya diikuti, diambil cahayanya untuk menyinari, dan dengan ilmunya seseorang berjalan di kegelapan. Oleh karenanya Dia tidak meletakkan ilmu dan hikmah kecuali pada tempat yang layak, dan Dia mengetahui siapakah yang berhak menerima dan memperolehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 83",
    "description": "Atas semua argumen yang telah dijelaskan pada ayat sebelumnya, Allah pun menegaskan sebagai berikut. Dan itulah keterangan kami yang kami berikan dan ajarkan melalui malaikat dan atau kami ilhamkan kepada ibrahim untuk menghadapi kaumnya agar dia dapat mengatasi dan mengalahkan mereka. Kami tinggikan derajat siapa yang kami kehendaki dari hamba-hamba kami yang taat, sebagaimana nabi ibrahim yang telah kami tinggikan derajatnya agar menjadi teladan bagi manusia. Sesungguhnya tuhanmu mahabijaksana, maha mengetahui atas segala sesuatu. Di samping anugerah berupa hujah seperti dijelaskan kelompok ayat di atas, anugerah lain yang diberikan kepada nabi ibrahim adalah diberikannya putra dan keturunan yang menjadi utusan Allah. Dan kami telah menganugerahkan ishak putra ibrahim bersama sarah, dan yakub putra ishak kepadanya. Kepada masing-masing telah kami beri petunjuk, yakni tugas kerasulan untuk membimbing manusia ke jalan tauhid. Dan sebelum itu kami telah memberi petunjuk kepada nuh yang merupakan salah seorang leluhur nabi ibrahim, dan kepada sebagian dari keturunannya, yakni keturunan ibrahim, yaitu dawud dan sulaiman yang memegang kekuasaan pada masanya, ayyub yang tabah, yusuf yang menerima amanah kekuasaan serta menggunakan kekuasaannya untuk menyejahterakan masyarakat, dan musa, dan harun yang berhasil mengalahkan penguasa yang zalim. Dan demikianlah kami memberi balasan yang sempurna kepada orang-orang yang berbuat baik dengan sungguh-sungguh. Dan juga zakaria, yahya, yang menjadi korban kekejaman penguasa yang zalim ketika berdakwah, demikian juga isa, dan ilyas. Semuanya termasuk orang-orang yang saleh dan berusaha untuk mengajak kaumnya masing-masing untuk menjadi saleh. Dan demikian juga ismail putra ibrahim bersama hajar yang dikenal sangat tabah, juga alyasa' yang sangat santun dalam membimbing kaumnya, yunus yang mendapat cobaan tinggal di perut ikan, dan lut yang merupakan anak saudara nabi ibrahim. Masing-masing kami lebihkan derajatnya di atas umat lain pada masanya. Ayat ini menyebut 18 dari 25 nabi yang wajib diimani kenabian mereka. Tujuh sisanya disebut pada ayat lain, yaitu nabi adam, nabi idris, nabi hud, nabi syuaib, nabi saleh, nabi zulkifli, dan nabi Muhammad."
  }
]