[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menganugerahi Ibrahim karunia dengan memberikan kepadanya putra yang bernama ishaq dan cucu bernama ya’qub, dan sungguh kami telah memberikan taufik kepada mereka berdua untuk meniti jalan yang lurus. Demikian juga sebelumnya kami telah memberikan taufik menuju kebenaran kepada Nuh, (sebelum Ibrahim, ishaq, dan ya’qub). Demikian juga kami telah memberikan taufik menuju kebenaran bagi keturunan Nuh, yaitu dawud, sulaiman, Ayyub, yusuf, muusa, dan harun . Sebagaimana kami telah memberikan balasan baik bagi para nabi itu atas perbuatan-perbuatan baik mereka, kami pun akan memberikan balasan baik pula bagi setiap orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Dan Kami anugerahkan kepada Ibrahim putranya, Ishāq dan cucunya, Ya’qūb. Dan keduanya Kami bimbing ke jalan yang lurus. Sebelum itu Kami telah membimbing Nuh (ke jalan yang lurus). Dan Kami pun telah membimbing sebagian dari keturunan Nuh, Daud beserta putranya yaitu Sulaiman, Ayub, Yusuf, Musa beserta saudaranya yaitu Harun -‘Alaihimussalām- ke jalan yang benar. Dan balasan seperti yang Kami berikan kepada para nabi sebagai imbalan atas kebaikan mereka itu pun akan Kami berikan kepada orang-orang yang berbuat baik dari golongan lain sebagai imbalan atas kebaikan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Setelah Allah memberi Nabi Ibrahim kemenangan atas musuh-musuhnya, kemudian Allah mengingatkannya kenikmatan lain, yaitu mengaruniai Ishak dan Yakub. Allah telah memberi mereka semua hidayah, mulai dari kakek, anak, dan cucu; Allah menjadikan mereka semua nabi-nabi yang penuh kebaikan dan senantiasa menyeru kepada Allah. Sebelum itu Allah telah memberi hidayah kepada Nabi Nuh, dan menjadikan keturunan Nabi Ibrahim sebagai nabi-nabi dan rasul-rasul; mereka adalah Daud, Sulaiman, Ayub, Yusuf, Musa dan Harun; mereka semua adalah orang-orang yang senantiasa berbuat baik sehingga Allah membalas mereka sesuai dengan amal perbuatan mereka. Mereka memiliki kenabian dan kerasulan, dan kerajaan serta kekuasaan. Allah telah menjadikan Daud dan Sulaiman sebagai nabi sekaligus raja, sehingga mereka berdua memiliki kekuatan dan kekuasaan yang luas. Adapun Ayub, dahulu adalah seorang pemimpin kemudian mendapat banyak cobaan, san dia memiliki kesabaran dan kenabian. Dan Yusuf dahulu adalah seorang menteri, dia juga banyak mendapat cobaan namun tetap bersabar, maka Allah mengaruniakan kepadanya kekuasaan di samping kenabiannya. Adapun Musa dan Harun telah Allah karuniakan kepada mereka kenabian, dan dahulu Mereka berdua adalah hakim yang memiliki banyak pengikut. al-Qur'an menyebut mereka semuanya sesuai urutan ketinggian derajat mereka dalam agama; yang paling baik dari mereka adalah musa dan Harun kemudian Ayub dan Yusuf, dan kemudian Daud dan Sulaiman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَوَهَبْنَا لَهُۥٓ إِسْحٰقَ (Dan Kami telah menganugerahkan Ishak) Yakni seorang anak sebagai anugrah dari Kami, Kami juga anugerahkan kepadanya Ya’kub sebagai anak dari Ishaq. كُلًّا هَدَيْنَا ۚ (Kepada keduanya masing-masing telah Kami beri petunjuk) Yakni Kami telah menjadikan keduanya sebagai nabi. وَمِن ذُرِّيَّتِهِۦ (dan kepada sebahagian dari keturunannya) Yakni keturunan Nabi Nuh, kerena Nabi Yunus dan Luth tidak termasuk keturunan Nabi Ibrahim, akan tetapi Nabi Luth adalah anak dari saudara Nabi Ibrahim. دَاوُۥدَ وَسُلَيْمٰنَ (yaitu Daud, Sulaiman) Allah memasukkan pemberian petunjuk kepada para nabi tersebut termasuk kedalam nikmat-nikmat yang diberikan kepada Nabi Ibrahim, karena kemuliaan anak cucu merupakan kemuliaan bagi para pendahulunya. وَكَذٰلِكَ نَجْزِى الْمُحْسِنِينَ (Demikianlah Kami memberi balasan kepada orang-orang yang berbuat baik) Yakni sebagaimana Kami membalas para nabi tersebut yang telah berbuat baik dalam amalan mereka dengan jihad, dakwah, dan sabar, maka begitu pula Kami akan membalas setiap orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84 Kami telah menganugerahkan Ishak dan Ya’qub bin Ishak kepada Ibrahim. Kepada masing-masing keduanya telah Kami beri petunjuk kepada kebenaran serta Kami jadikan keduanya sebagai Nabi. Serta kepada Nuh sebelum itu juga telah Kami beri petunjuk, Kami jadikan Nuh sebagai Rasul pertama untuk manusia. Kami jadikan keturunan Nuh sebagai Nabi, yaitu Daud, Sulaiman, Ayyub, Yusuf, Musa dan Harun. Itu adalah jumlah keturunan yang baik dari Ibrahim, sebab kemuliaan anak bersambung kepada kemuliaan para leluhurnya. Sebagaimana Kami beri balasan [ara Nabi yang telah berbuat kebaikan dengan berjuang dan berdakwah, maka Kami memberi balasan kepada orang-orang yang berbuat baik dengan petunjuk agama dan menuntun manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah menganugerahkan kepadanya Ishaq dan Ya‘qub. Masing-masing mereka telah Kami beri petunjuk. Sebelumnya Kami telah memberi petunjuk kepada Nuh. dan sebagian dari keturunannya} dari keturunan Nuh AS {yaitu Daud, Sulaiman, Ayyub, Yusuf, Musa, dan Harun. Demikianlah Kami memberi balasan kepada orang-orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ketika Allah menyebutkan hamba dan KhalilNya, Ibrahim dan menyebutkan nikmatNya kepadanya dalam bentuk ilmu, dakwah, dan kesabaran, maka Allah menyebutkan anugerahnya kepadanya berupa anak keturunan yang shalih dan baik, dan bahwa Allah menjadikan makhluk tersuci dari keturunannya. Alangkah utama dan mulianya dia, yang tidak ada contoh semisal yang membandinginya. Dia berfirman, 84. “Dan Kami telah menganugerahkan Ishaq dan Ya’qub kepadanya.” Ya’qub adalah putra Ishaq. Ya’qub digelari Israil, bapak beberapa suku bangsa yang mana Allah mengutamakannya di alam dunia. “Kepada keduanya masing-masing,” Kami telah memberinya petunjuk ke jalan yang lurus pada ilmu dan amalnya. “Dan kepada Nuh,” Kami juga memberinya petunjuk “sebelum itu (juga).” Dan hidayahnya termasuk bentuk hidayah tertinggi yang bersifat khusus yang hanya didapatkan oleh beberapa orang di alam ini, dan mereka adalah ulul azmi yang berasal dari para Rasul yang mana salah satunya adalah dia. “Dan kepada sebagian dari keturunannya.” Ada kemungkinan kata gantinya adalah kembali kepada Nuh, karena dialah yang disebut paling dekat, karena Allah menyebutkan Luth bersama yang lain, dan ia termasuk keturunan Nuh, bukan Ibrahim, karena dia adalah keponakannya. Ada kemungkinan juga kata gantinya kembali kepada Ibrahim karena konteks ayat ini tentang pujian dan sanjungan kepadanya, dan Luth walaupun dia bukan termasuk keturunannya, tetapi dia termasuk yang beriman berkat dirinya, maka keutamaan dan keunggulan Ibrahim al-Khalil lebih tinggi daripada sekedar sebagai anaknya. “Yaitiu Dawud, Sulaiman” bin Dawud. “Dan Ayyub dan Yusuf” bin Ya’qub. “Dan Musa dan Harun.” Keduanya adalah putra Imran. “Demikianlah,” sebagaimana Kami menjadikan anak keturunan Ibrahim sebagai orang-orang yang baik karena dia telah beribadah kepada Tuhannya dengan baik dan memberi manfaat kepada makhluk dengan baik. Begitu pula “Kami memberi balasan kepada orang-orang yang berbuat baik,” dengan menjadikan nama yang baik dan keturunan yang shalih untuk mereka sesuai dengan kebaikan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 84: Setelah Allah menyebutkan tentang hamba-Nya dan kekasih-Nya, yaitu Nabi Ibrahim 'alaihis salam, serta karunia-Nya kepadanya berupa ilmu, dakwah dan sabar, Allah menyebutkan pemberian-Nya kepada Ibrahim sebagai pemuliaan terhadapnya dari-Nya berupa keturunan yang saleh. Ya'qub putera Ishak, ia disebut juga Israil. Ke jalan yang lurus. Nuh atau Ibrahim. Putera Dawud. Putera Ya'qub. Musa dan Harun adalah kedua putera Imran. Karena mereka telah berbuat ihsan dalam beribadah kepada Tuhannya dan dalam memberi manfaat kepada orang lain. Allah sebut nama baik mereka, memberi mereka keturunan yang saleh, meninggikan derajat mereka dan akan memasukkan mereka ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 84",
    "description": "Di samping anugerah berupa hujah seperti dijelaskan kelompok ayat di atas, anugerah lain yang diberikan kepada nabi ibrahim adalah diberikannya putra dan keturunan yang menjadi utusan Allah. Dan kami telah menganugerahkan ishak putra ibrahim bersama sarah, dan yakub putra ishak kepadanya. Kepada masing-masing telah kami beri petunjuk, yakni tugas kerasulan untuk membimbing manusia ke jalan tauhid. Dan sebelum itu kami telah memberi petunjuk kepada nuh yang merupakan salah seorang leluhur nabi ibrahim, dan kepada sebagian dari keturunannya, yakni keturunan ibrahim, yaitu dawud dan sulaiman yang memegang kekuasaan pada masanya, ayyub yang tabah, yusuf yang menerima amanah kekuasaan serta menggunakan kekuasaannya untuk menyejahterakan masyarakat, dan musa, dan harun yang berhasil mengalahkan penguasa yang zalim. Dan demikianlah kami memberi balasan yang sempurna kepada orang-orang yang berbuat baik dengan sungguh-sungguh. Dan juga zakaria, yahya, yang menjadi korban kekejaman penguasa yang zalim ketika berdakwah, demikian juga isa, dan ilyas. Semuanya termasuk orang-orang yang saleh dan berusaha untuk mengajak kaumnya masing-masing untuk menjadi saleh. Dan demikian juga ismail putra ibrahim bersama hajar yang dikenal sangat tabah, juga alyasa' yang sangat santun dalam membimbing kaumnya, yunus yang mendapat cobaan tinggal di perut ikan, dan lut yang merupakan anak saudara nabi ibrahim. Masing-masing kami lebihkan derajatnya di atas umat lain pada masanya. Ayat ini menyebut 18 dari 25 nabi yang wajib diimani kenabian mereka. Tujuh sisanya disebut pada ayat lain, yaitu nabi adam, nabi idris, nabi hud, nabi syuaib, nabi saleh, nabi zulkifli, dan nabi Muhammad"
  }
]