[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Begitu pula, Kami telah memberi hidayah kepada zakria, yahya, isa, dan ilyas. Semua nabi itu termasuk orang-orang shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Dan Kami juga membimbing Zakaria, Yahya, Isa putra Maryam, dan Ilyas -‘Alaihimussalām- (ke jalan yang benar). Dan para nabi itu semuanya termasuk golongan orang-orang saleh yang Allah pilih sebagai utusan-utusan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Dan Allah juga telah memberi hidayah kepada Zakaria, Yahya, dan Ilyas; mereka adalah orang-orang sholeh yang menyeru untuk mengesakan dan menyembah Allah. Mereka sangat menonjol dalam sisi kezuhudan dan ibadah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَإِلْيَاسَ ۖ (dan Ilyas) Ada pendapat mengatakan Ilyas adalah Idris, namun hal ini tidak benar karena Nabi Idris berada di zaman sebelum nabi Nuh, sedangkan Nabi Ilyas termasuk keturunan Nabi Nuh sebagaimana yang ditunjukkan oleh ayat-ayat tadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85 Kami juga telah memberi petunjuk kepada Zakaria, Yahya, Isa dan Ilyas. Riwayat yang shahih adalah bahwa Idris bukanlah Nabi sebelum Nuh, adapun Ilyas adalah keturunan dari Nabi Nuh sebagaimana disebutkan ayat-ayat di atas. Semuanya itu termasuk golongan orang-orang yang shaleh yang dihiasi dengan sifat zuhud di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Zakaria, Yahya, Isa, dan Ilyas. Semuanya termasuk orang-orang yang shalih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. “Dan Zakaria dan Yahya” bin Zakaria. “Dan Isa” putra Maryam. “Dan Ilyas. Semuanya,” mereka-mereka itu “termasuk orang-orang yang shalih,” dalam akhlak, amal mereka, dan ilmu, bahkan mereka adalah pemimpin, imam, dan panutan orang-orang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 85: Putera Zakariya. Putera Maryam. Putera Harun saudara Musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 85",
    "description": "Di samping anugerah berupa hujah seperti dijelaskan kelompok ayat di atas, anugerah lain yang diberikan kepada nabi ibrahim adalah diberikannya putra dan keturunan yang menjadi utusan Allah. Dan kami telah menganugerahkan ishak putra ibrahim bersama sarah, dan yakub putra ishak kepadanya. Kepada masing-masing telah kami beri petunjuk, yakni tugas kerasulan untuk membimbing manusia ke jalan tauhid. Dan sebelum itu kami telah memberi petunjuk kepada nuh yang merupakan salah seorang leluhur nabi ibrahim, dan kepada sebagian dari keturunannya, yakni keturunan ibrahim, yaitu dawud dan sulaiman yang memegang kekuasaan pada masanya, ayyub yang tabah, yusuf yang menerima amanah kekuasaan serta menggunakan kekuasaannya untuk menyejahterakan masyarakat, dan musa, dan harun yang berhasil mengalahkan penguasa yang zalim. Dan demikianlah kami memberi balasan yang sempurna kepada orang-orang yang berbuat baik dengan sungguh-sungguh. Dan juga zakaria, yahya, yang menjadi korban kekejaman penguasa yang zalim ketika berdakwah, demikian juga isa, dan ilyas. Semuanya termasuk orang-orang yang saleh dan berusaha untuk mengajak kaumnya masing-masing untuk menjadi saleh. Dan demikian juga ismail putra ibrahim bersama hajar yang dikenal sangat tabah, juga alyasa' yang sangat santun dalam membimbing kaumnya, yunus yang mendapat cobaan tinggal di perut ikan, dan lut yang merupakan anak saudara nabi ibrahim. Masing-masing kami lebihkan derajatnya di atas umat lain pada masanya. Ayat ini menyebut 18 dari 25 nabi yang wajib diimani kenabian mereka. Tujuh sisanya disebut pada ayat lain, yaitu nabi adam, nabi idris, nabi hud, nabi syuaib, nabi saleh, nabi zulkifli, dan nabi Muhammad"
  }
]