[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami memberikan hidayah pula kepada ismail, al-yasa, yunus, dan luth. Para rasul itu telah kami lebihkan derajatnya di atas manusia-manusia pada zaman mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Dan Kami juga membimbing Ismail, Ilyasa’, Yunus, dan Luth -‘Alaihimussalām-. Dan para nabi itu semua terutama Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- Kami berikan keutamaan atas alam semesta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Dan Allah telah memberi hidayah kepada Ismail, Yasa', Yunus, dan Luth. Allah telah memberi mereka keutamaan dengan kedudukan dan keshalehan di atas seluruh manusia lainnya pada zaman itu; sehingga mereka memiliki perilaku dan sifat yang mulia, sehingga sanjungan bagi mereka tetap abadi. Urutan nama para nabi dalam ayat-ayat ini memiliki maksud; penyebutan Ibrahim, Ishak, dan Yakub; bahwa Ishak adalah anak Ibrahim dan Yakub adalah anak Ishak; mereka semua adalah para nabi. Kemudian Daud dan Sulaiman; mereka berdua adalah nabi dan raja. Adapun Ayub dan Yusuf, mereka berdua mendapatkan nikmat setelah ujian yang berat. Sedangkan Sulaiman dan Ayub, mereka berdua memiliki keterkaitan sebagaimana disebutkan dalam firman Allah: نعم العبد إنه أواب “Dia adalah sebaik-baik hamba. Sesungguhnya dia amat taat (kepada Tuhannya),” (Shad: 30) Ayub adalah hamba yang senantiasa sabar, sedangkan Sulaiman adalah hamba yang senantiasa bersyukur; dan kesabaran dan kesyukuran merupakan inti keimanan. Dan Yusuf dan Harun, keduanya adalah saudara. Adapun Zakaria dan Yahya, keduanya adalah nabi. Sedangkan Yahya dan Isa keduanya dilahirkan dengan proses yang tidak biasa; Yahya dilahirkan dari seorang ayah yang sudah tua dan ibu yang mandul; Adapun Isa dilahirkan tanpa ayah. Yahya dan Isa keduanya disebutkan dalam surat Ali Imran dan Maryam; dan Allah mengakhiri penyebutan dua nama ini dengan Isa karena dia tidak memiliki ayah sehingga menjadi penutup silsilah keluarga yang pertama. Kemudian disebutkan silsilah yang lain: Ilyas bukan keturunan Ishak, Ismail adalah saudara Ishak, Yasa' adalah teman Ilyas (dan setiap disebutkan nama Yasa dalam al-Qur'an pasti akan Sebutkan nama Ilyas), Yunus bukan keturunan Ibrahim, Luth juga bukan keturunan Ibrahim, Adapun Yunus dan Luth keduanya adalah orang yang berhijrah kepada Tuhan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَالْيَسَعَ (dan Alyasa’) Ada pendapat mengatakan yang dimaksud adalah Khidhir, dan pendapat lain mengatakan dia adalah sahabat dari Nabi Idris, dan mereka ada di zaman sebelum Nabi Yahya dan Isa. وَكُلًّا فَضَّلْنَا عَلَى الْعٰلَمِينَ (Masing-masing Kami lebihkan derajatnya di atas umat) Yakni setiap dari nabi-nabi tersebut telah Kami lebihkan dari orang-orang lain dengan kenabian. Dan para nabi adalah sebaik-baik manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86 Kami juga telah memberi petunjuk kepada Ismail, dan Ilyasa’, disebutkan bahwa dia adalah sahabat dari Ilyas. Kemudian Yunus dan Luth, mereka berdua bukan keturunan dari Ibrahim, namun dari keturunan Nuh. Sebab Luth adalah anak dari saudara laki-laki Ibrahim. Masing-masing Kami lebihkan derajatnya di atas umat di masanya, yang menunjukkan bahwa derajat Nabi adalah sebaik-baik manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Ismail, Ilyasa’, Yunus, dan Lut. Masing-masing mereka Kami lebihkan di atas seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. “Dan Ismail” bin Ibrahim, bapak bangsa Arab, bapak dari Sayyid anak cucu Adam, Muhammad.“Dan Yunus” bin Matta. “Dan Luth” bin Harun, saudara Ibrahim. “Dan masing-masingnya,” dari para Nabi dan Rasul itu “Kami lebihkan derajatnya di atas umat (di masanya).” Karena derajat keutamaan ada empat, yaitu yang disebutkan oleh Allah dalam FirmanNya. “Dan barangsiapa yang mentaati Allah dan Rasul(Nya), mereka itu akan bersama-sama dengan orang-orang yang dianugerahi nikmat oleh Allah, yaitu: Nabi-nabi, para shiddiiqiin, orang-orang yang mati syahid, dan orang-orang saleh. Dan mereka itulah teman yang sebaik-baiknya.” (an-Nisa:69). Mereka itu termasuk ke dalam derajat yang tinggi, bahkan mereka adalah rasul-rasul terbaik secara mutlak. Para Rasul yang kisahnya Allah ceritakan di dalam kitabNya adalah lebih utama daripada yang tidak diceritakan, tanpa ragu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 86: Putera Ibrahim. Putera Mataa. Putera Haaran saudara Ibrahim. Derajat mereka sangat tinggi, di atas para wali, para shiddiqin, para syuhada dan di atas orang-orang yang saleh. Para rasul yang Allah ceritakan dalam kitab-Nya adalah para rasul yang paling utama di antara sekian para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 86",
    "description": "Di samping anugerah berupa hujah seperti dijelaskan kelompok ayat di atas, anugerah lain yang diberikan kepada nabi ibrahim adalah diberikannya putra dan keturunan yang menjadi utusan Allah. Dan kami telah menganugerahkan ishak putra ibrahim bersama sarah, dan yakub putra ishak kepadanya. Kepada masing-masing telah kami beri petunjuk, yakni tugas kerasulan untuk membimbing manusia ke jalan tauhid. Dan sebelum itu kami telah memberi petunjuk kepada nuh yang merupakan salah seorang leluhur nabi ibrahim, dan kepada sebagian dari keturunannya, yakni keturunan ibrahim, yaitu dawud dan sulaiman yang memegang kekuasaan pada masanya, ayyub yang tabah, yusuf yang menerima amanah kekuasaan serta menggunakan kekuasaannya untuk menyejahterakan masyarakat, dan musa, dan harun yang berhasil mengalahkan penguasa yang zalim. Dan demikianlah kami memberi balasan yang sempurna kepada orang-orang yang berbuat baik dengan sungguh-sungguh. Dan juga zakaria, yahya, yang menjadi korban kekejaman penguasa yang zalim ketika berdakwah, demikian juga isa, dan ilyas. Semuanya termasuk orang-orang yang saleh dan berusaha untuk mengajak kaumnya masing-masing untuk menjadi saleh. Dan demikian juga ismail putra ibrahim bersama hajar yang dikenal sangat tabah, juga alyasa' yang sangat santun dalam membimbing kaumnya, yunus yang mendapat cobaan tinggal di perut ikan, dan lut yang merupakan anak saudara nabi ibrahim. Masing-masing kami lebihkan derajatnya di atas umat lain pada masanya. Ayat ini menyebut 18 dari 25 nabi yang wajib diimani kenabian mereka. Tujuh sisanya disebut pada ayat lain, yaitu nabi adam, nabi idris, nabi hud, nabi syuaib, nabi saleh, nabi zulkifli, dan nabi Muhammad. Untuk menghilangkan kesan bahwa anugerah Allah hanya diberikan kepada para nabi yang telah disebutkan di atas, maka Allah menegaskan bahwa dia melebihkan pula derajat sebagian dari nenek moyang mereka, keturunan mereka, baik lelaki maupun perempuan, dan saudara-saudara mereka. Kami telah memilih mereka menjadi nabi dan rasul, dan mereka kami beri petunjuk ke jalan yang luas lagi lurus. 88. Itulah petunjuk Allah yang amat tinggi nilainya, yang dengan itu dia memberi petunjuk, yaitu kemampuan dan kemudahan untuk melaksanakannya, kepada siapa saja di antara hamba-hamba-Nya yang dia kehendaki karena telah berusaha dengan sungguh-sungguh untuk meraihnya. Sekiranya mereka yaitu yang telah disebutkan nama-namanya di atas mempersekutukan Allah, pasti lenyaplah, yakni sia-sia dan tidak berguna, aneka amalan yang telah mereka kerjakan."
  }
]