[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian pula, kami memberikan taufik menuju kebenaran kepada orang-orang yang kami kehendaki memperoleh hidayah dari bapak-bapak mereka, keturunan-keturunan mereka dan saudara-saudara mereka. Dan kami memilih mereka untuk (mengemban) ajaran agama kami dan menyampaikan risalah kami kepada umat manusia yang berada di tempat kami mengutus para rasul tersebut, dan kami berikan petunjuk bagi mereka menuju jalan yang benar yang tidak bengkok sama sekali, yaitu mentauhidkan Allah dan menyucikannya dari kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Dan Kami membimbing sebagian orangtua mereka, sebagian anak-anak mereka, dan sebagian saudara-saudara mereka yang Kami kehendaki untuk Kami bimbing dan Kami pilih untuk mengikuti jalan yang lurus. Yaitu jalan mengesakan Allah dan menaati-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Dan Allah juga telah memberi hidayah kepada sebagian ayah, keturunan, dan saudara mereka, meskipun tidak disebutkan nama-nama mereka karena mereka sangat banyak. Mereka telah mendapat hidayah menuju petunjuk, kebenaran, dan jalan yang lurus, dan memilih mereka sebagai nabi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَمِنْ ءَابَآئِهِمْ وَذُرِّيّٰتِهِمْ وَإِخْوٰنِهِمْ ۖ (Dan Kami lebihkan (pula) derajat sebahagian dari bapak-bapak mereka, keturunan dan saudara-saudara mereka) Kami beri petunjuk kepada sebagian nenek moyang, keturunan, dan istri-istri mereka. وَاجْتَبَيْنٰهُمْ(Dan Kami telah memilih mereka) Makna (الاجتباء) yakni pemilihan dan pemurnian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87 Kami beri petunjuk pula sebagian dari bapak-bapak mereka, keturunan dan saudara-saudara mereka. Dan Kami telah memilih mereka untuk menjadi nabi-nabi dan rasul-rasul dan Kami tunjukkan kepada mereka ke jalan lurus yaitu keimanan dan agama yang haq"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan sebagian dari nenek moyang mereka} sebagian dari nenek moyang mereka {keturunan mereka, dan saudara-saudara mereka. Kami telah memilih mereka} Kami telah memilih mereka {dan Kami memberi mereka petunjuk menuju jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. “(Dan Kami lebihkan pula derajat) sebagian dari bapak-bapak mereka,” yaitu bapak-bapak mereka yang disebut. “Dan keturunan mereka dan saudara-saudara mereka.” Maksudnya, Kami juga memberi petunjuk kepada bapak-bapak, keturunan, dan saudara-saudara mereka. “Dan Kami telah memilih mereka (untuk menjadsi nabi-nabi dan rasul-rasul ) dan Kami menunjuki mereka ke jalan yang lurus.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 87",
    "description": "Untuk menghilangkan kesan bahwa anugerah Allah hanya diberikan kepada para nabi yang telah disebutkan di atas, maka Allah menegaskan bahwa dia melebihkan pula derajat sebagian dari nenek moyang mereka, keturunan mereka, baik lelaki maupun perempuan, dan saudara-saudara mereka. Kami telah memilih mereka menjadi nabi dan rasul, dan mereka kami beri petunjuk ke jalan yang luas lagi lurus. 88. Itulah petunjuk Allah yang amat tinggi nilainya, yang dengan itu dia memberi petunjuk, yaitu kemampuan dan kemudahan untuk melaksanakannya, kepada siapa saja di antara hamba-hamba-Nya yang dia kehendaki karena telah berusaha dengan sungguh-sungguh untuk meraihnya. Sekiranya mereka yaitu yang telah disebutkan nama-namanya di atas mempersekutukan Allah, pasti lenyaplah, yakni sia-sia dan tidak berguna, aneka amalan yang telah mereka kerjakan. Itulah petunjuk Allah yang amat tinggi nilainya, yang dengan itu dia memberi petunjuk, yaitu kemampuan dan kemudahan untuk melaksanakannya, kepada siapa saja di antara hamba-hamba-Nya yang dia kehendaki karena telah berusaha dengan sungguh-sungguh untuk meraihnya. Sekiranya mereka yaitu yang telah disebutkan nama-namanya di atas mempersekutukan Allah, pasti lenyaplah, yakni sia-sia dan tidak berguna, aneka amalan yang telah mereka kerjakan."
  }
]