[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hidayah tersebut adalah taufik Allah yang telah memberikan taufik untuk itu kepada orang yang dikehendakiNya diantara para hambaNya. Sekiranya para nabi itu melakukan perbuatan syirik kepada Allah, (sekedar sebagai pengandaian dan perumpamaan saja) pastilah akan lenyap dari mereka amal-amal kebaikan mereka, sebab sesungguhnya Allah tidak menerima amalan yang di sertai dengan kesyirikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Bimbingan yang mereka terima itu berasal dari Allah, Dia membimbing hamba-hamba-Nya yang Dia kehendaki. Dan sekiranya mereka menyekutukan Allah dengan yang lain niscaya amal perbuatan mereka akan sia-sia. Karena perbuatan syirik dapat membatalkan amal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Hidayah, pemilihan, dan pemuliaan tersebut merupakan taufik dari Allah. Andai saja mereka menyekutukan Allah dan menyembah selain-Nya niscaya amal kebaikan mereka akan lenyap. Pengandaian ini merupakan Ibrah dan pelajaran bagi manusia agar menjauhi kesyirikan dan penyembahan kepada selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. ذٰلِكَ هُدَى اللهِ (Itulah petunjuk Allah) Yakni hidayah, karunia, dan pemilihan sebagaimana yang telah disebutkan. يَهْدِى بِهِۦ (Dia memberi petunjuk) Yakni Allah. مَن يَشَآءُ مِنْ عِبَادِهِۦ ۚ( kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya) Mereka adalah orang-orang yang diberi taufik dalam melakukan kebaikan dan mengikuti kebenaran. وَلَوْ أَشْرَكُوا۟( seandainya mereka mempersekutukan Allah) Yakni mereka yang disebutkan sebelumnya itu. لَحَبِطَ عَنْهُم (niscaya lenyaplah dari mereka) Yakni terhapuslah amalan-amalan kebaikan yang telah mereka kerjakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah menyebutkan di dalam surah al-An'am (18 nama Nabi), kemudian Dia -جل جلاله- mengatakan : { وَلَوْ أَشْرَكُوا لَحَبِطَ عَنْهُمْ مَا كَانُوا يَعْمَلُ } \"Seandainya mereka mempersekutukan Allah, niscaya lenyaplah dari mereka amalan yang telah mereka kerjakan\", dari itu kita memahami bahwa ikhlash memiliki kedudukan yang tinggi dan merupakan hak Allah secara muthlaq, dan tidak sedikit pun untuk manusia jatah darinya, ikhlash adalah kedudukan : \"mengkhususkan Tauhid hanya kepada Allah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88 Itulah petunjuk, anugerah, serta limpahan dari Allah, yang dengannya Dia memberi petunjuk kepada siapa yang dikehendaki-Nya di antara hamba-hamba-Nya. Mereka adalah orang-orang yang senantiasa berbuat kebaikan dan mengikuti kebenaran Seandainya mereka yang telah disebut itu mempersekutukan Allah, niscaya lenyaplah dari mereka amalan baik yang telah mereka kerjakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu petunjuk Allah. Dengannya Dia memberi petunjuk kepada siapa saja di antara hamba-hambaNya yang Dia kehendaki. Jika mereka menyekutukanNya, sungguh sia-sia} sia-sia {amal yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89. “Itulah,” petunjuk yang disebutkan adalah “Petunjuk Allah,” yang tiada petunjuk selain petunjukNYa. “Yang dengannya Dia memberi petunjuk kepada siapa yang dikendakiNya di antara hamba-hambaNya.” Maka carilah petunjuk dariNya, karena jika Dia tidak memberimu petunjuk, maka tidak ada pemberi petunjuk untukmu selainNya, dan di aantara orang yang mana Allah berkehendak untuk memberi petunjuk adalah orang-orang yang telah disebutkan. “seandainya mereka mempersekutukan Allah,” menurut kepastian dan perkiraan, “niscaya lenyaplah dari mereka amalan yang telah mereka kerjakan.” Karena syirik melenyapkan amal dan menyebabkan kekekalan di dalam neraka. Jika orang-orang mulia lagi terpilih itu melakukan kesyirikan, -dan ini mustahil- niscaya amal-amal mereka lenyap, lebih-lebih selain mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 88: Oleh karena itu, mintalah petunjuk kepada-Nya. Syirk menghapuskan amalan dan mengekalkan pelakunya di neraka, jika orang-orang pilihan itu berbuat syirk tentu hapuslah amalan mereka. Orang-orang pilihan saja dapat hapus amalnya jika berbuat syirk apalagi selain mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 88",
    "description": "Itulah petunjuk Allah yang amat tinggi nilainya, yang dengan itu dia memberi petunjuk, yaitu kemampuan dan kemudahan untuk melaksanakannya, kepada siapa saja di antara hamba-hamba-Nya yang dia kehendaki karena telah berusaha dengan sungguh-sungguh untuk meraihnya. Sekiranya mereka yaitu yang telah disebutkan nama-namanya di atas mempersekutukan Allah, pasti lenyaplah, yakni sia-sia dan tidak berguna, aneka amalan yang telah mereka kerjakan. Peringatan bahkan ancaman tersebut wajar diberikan karena mereka itulah orang-orang yang telah kami berikan kitab baik secara langsung kepada mereka maupun tidak langsung yaitu mereka terima melalui rasul yang lain, dan hikmah, yaitu kemampuan mengamalkan petunjuk Allah tersebut dengan bijak, dan juga kenabian. Jika orang-orang, yakni penduduk mekah, yang engkau seru, wahai nabi Muhammad, itu mengingkarinya, maka kami akan menyerahkannya kepada kaum yang tidak mengingkarinya di antara mereka adalah para shiddiqun, syuhada, dan para ulama yang menjadi penerus tugas para nabi."
  }
]