[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para nabi telah kami beri karunia kepada mereka dengan hidayah dan kenabian itu, mereka itulah orang-orang yang telah kami berikan kepada mereka kitab suci, seperti shuhuf (lembaran kitab suci) Ibrahim, taurat musa, zabur dawud, injil isa, dan kami telah anugerahkan kepada mereka pemahan kitab-kitab tersebut dan kami pilih mereka untuk menyampaikan wahyu kami. Wahi rasul, siapa saja yang mengingkari ayat-ayat al-qur’an ini dari orang-orang kafir dari kaummu, maka sesungguhnya kami akan menyerahkannya kepada kaum yang lain, yaitu kaum muhajirin dan anshar serta orang-orang yang mengikuti mereka hingga hari kiamat, yang sekali-kali tidak akan mengingkarinya. Sebaliknya, mereka betul-betul mengimaninya dan mengamalkan ajaran yang dikandungnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Para nabi tersebut merupakan orang-orang yang Kami beri kitab suci, hikmah, dan status sebagai nabi. Jika kaummu mengingkari ketiga pemberian itu, niscaya Kami akan menyiapkan kaum-kaum lain yang tidak mengingkarinya, tetapi mengimaninya dan berpegang teguh kepadanya. Yaitu kaum Muhajirin, kaum Ansar, dan orang-orang mengikuti mereka dengan baik sampai hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Para nabi dan rasul yang telah disebutkan itu telah Allah berikan kepada mereka kenikmatan kenabian dan petunjuk; dan Allah memberi mereka kitab, seperti suhuf Ibrahim, Taurat Musa, Zabur Daud, dan Injil Isa; Allah juga memberi mereka ilmu dan pemahaman yang benar serta kenabian. Hai Muhammad, jika kaummu mengingkarinya maka Kami akan menyerahkannya kepada kaum yang lain, yaitu kepada kaum Muhajirin dan Anshor serta para pengikut mereka hingga hari kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. أُو۟لٰٓئِكَ (Mereka itulah) Yakni para nabi yang telah Kami sebutkan sebelumnya itu telah Kami berikan kepada mereka kitab-kitab Kami. وَالْحُكْمَ (dan al-hikmah) Yakni ilmu. وَالنُّبُوَّةَ(dan kenabian) Yakni risalah. فَإِن يَكْفُرْ بِهَا هٰٓؤُلَآءِ (Jika orang-orang itu mengingkarinya) Yakni orang-orang kafir quraisy yang durhaka kepada Rasulullah. فَقَدْ وَكَّلْنَا بِهَا قَوْمًا(maka sesungguhnya Kami akan menyerahkannya kepada kaum) Yakni Kami berikan taufik kepada seuatu kaum untuk beriman. لَّيْسُوا۟ بِهَا بِكٰفِرِينَ(yang sekali-kali tidak akan mengingkarinya) Sebuah pendapat mengatakan mereka adalah kaum Muhajirin dan Anshar, Kami beri mereka taufik untuk mengemban risalah ini hingga seakan-akan merekalah yang telah diserahi dengan risalah tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Imam Ahmad menafsirkan firman Allah : { فَقَدْ وَكَّلْنَا بِهَا قَوْمًا لَيْسُوا بِهَا بِكَافِرِينَ } \"maka sesungguhnya Kami akan menyerahkannya kepada kaum yang sekali-kali tidak akan mengingkarinya\" beliau berkata : mereka adalah Penduduk Madinah, Ibnu 'Aqil kemudian mengomentari perkataan ini : Penduduk Madinah lah yang pertama kali menerimanya, dan adapun orang-orang yang datang setelah mereka yang menerima serahan ini tergantung bagaimana keilmuan, amalan, dan dakwah mereka menyebarkan risalah ini. 2 ). Islam ini bagaiman sehelai pakaian yang tidak akan terbuang di atas tanah, maka jika satu kaum melepaskannya, Allah akan memakaikannya kepada umat lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89 Mereka itulah delapan belas Nabi dan para pengikutnya yang telah Kami berikan jenis kitab yang sama yaitu kitab samawi, ilmu, dan risalah. Jika orang-orang kafir Quraisy dan orang-orang musyrik itu mengingkarinya, maka sesungguhnya Kami akan menyerahkannya kepada kaum yang sekali-kali tidak akan mengingkarinya. Mereka adalah kaum Muhajirin dan Anshor. Telah Kami pilih mereka untuk membawa risalah iman seakan mereka adalah wakil atas risalah itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang telah Kami anugerahi kitab, hikmah} hikmah {dan kenabian. Jika orang-orang itu mengingkarinya, Kami akan menyerahkannya} Kami menyerahkannya untuk mengimani dan menegakkan kebenarannya {kepada kaum yang tidak mengingkarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89. “Itulah,” petunjuk yang disebutkan adalah “Petunjuk Allah,” yang tiada petunjuk selain petunjukNYa. “Yang dengannya Dia memberi petunjuk kepada siapa yang dikendakiNya di antara hamba-hambaNya.” Maka carilah petunjuk dariNya, karena jika Dia tidak memberimu petunjuk, maka tidak ada pemberi petunjuk untukmu selainNya, dan di aantara orang yang mana Allah berkehendak untuk memberi petunjuk adalah orang-orang yang telah disebutkan. “seandainya mereka mempersekutukan Allah,” menurut kepastian dan perkiraan, “niscaya lenyaplah dari mereka amalan yang telah mereka kerjakan.” Karena syirik melenyapkan amal dan menyebabkan kekekalan di dalam neraka. Jika orang-orang mulia lagi terpilih itu melakukan kesyirikan, -dan ini mustahil- niscaya amal-amal mereka lenyap, lebih-lebih selain mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 89: Seperti kaum Muhajirin dan Anshar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 89",
    "description": "Peringatan bahkan ancaman tersebut wajar diberikan karena mereka itulah orang-orang yang telah kami berikan kitab baik secara langsung kepada mereka maupun tidak langsung yaitu mereka terima melalui rasul yang lain, dan hikmah, yaitu kemampuan mengamalkan petunjuk Allah tersebut dengan bijak, dan juga kenabian. Jika orang-orang, yakni penduduk mekah, yang engkau seru, wahai nabi Muhammad, itu mengingkarinya, maka kami akan menyerahkannya kepada kaum yang tidak mengingkarinya di antara mereka adalah para shiddiqun, syuhada, dan para ulama yang menjadi penerus tugas para nabi. Ayat ini ditujukan kepada rasulullah yang nama beliau tidak disebut dalam rangkaian ayat di atas. Mereka itulah para nabi yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka khususnya yang berkaitan dengan sikap mereka dalam berdakwah, yakni tidak meminta imbalan atas dakwah yang disampaikan. Untuk itu, katakanlah, hai Muhammad, kepada semua yang engkau ajak, aku tidak meminta imbalan kepadamu dalam menyampaikan dakwah khususnya ajaran alqur'an, karena dakwah yang kusampaikan dan Al-Qur'an itu tidak lain hanyalah peringatan untuk semua umat di seluruh alam."
  }
]