[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya kami menjadikan rasul yang diutus kepada mereka adalah malaikat, karena mereka tidak puas dengan Muhammad , kami pasti akan menjadikan malaikat itu dalam rupa manusia hingga mereka dapat mendengarkan darinya dan berkomunikasi dengannya. Sebab tidak mungkin bagi mereka melihat malaikat dalam rupa asli malaikat. Dan seandainya malaikat datang kepada mereka dengan rupa manusia, maka perkara kenabiannya akan menimbulkan keragu-raguan bagi mereka, sebagaimana keraguan mereka terhadap perkara kenabian Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Seandainya Kami menugaskan seorang malaikat sebagai rasul untuk mereka, niscaya Kami akan menjadikannya berwujud seorang laki-laki, agar mereka bisa mendengarnya dan menerima pesannya. Sebab, mereka tidak bisa melakukan hal itu bersama malaikat yang berada dalam wujud aslinya sebagaimana Allah menciptakannya. Dan seandainya Kami benar-benar menjadikan malaikat itu berwujud seorang laki-laki (manusia), niscaya urusannya akan rancu bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dalam ayat ini Allah menjelaskan kebodohan apa yang mereka minta, dari dua sisi: Pertama, sunnatullah telah ditetapkan bahwa doa orang-orang kafir tidak akan dikabulkan. Kedua, seandainya rasul yang diutus kepada mereka merupakan seorang malaikat, niscaya Allah akan menjadikannya dalam rupa manusia. Sebab manusia hanya dapat melihat makhluk yang memiliki jasad, sedangkan malaikat memiliki tabiat penciptaan yang berbeda daripada manusia, dan mereka pasti akan binasa jika melihat wujud asli malaikat. Adapun jika malaikat itu mendatangi mereka dengan rupa manusia maka mereka pasti akan kembali ragu sebagaimana mereka ragu terhadap Muhammad. Sehingga jika malaikat itu berkata kepada mereka: \"Aku adalah malaikat yang diutus Allah kepada kalian untuk membenarkan kenabian Muhammad.\" Sedangkan mereka melihatnya dengan rupa manusia layaknya mereka, niscaya mereka akan kembali ragu. Dan salah satu dari rahmat Allah adalah Dia tidak mengabulkan permintaan mereka. Tidakkah mereka merasakan rahmat itu dan memahami hikmah Allah dalam perkara tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَلَوْ جَعَلْنٰهُ مَلَكًا لَّجَعَلْنٰهُ رَجُلًا (Dan kalau Kami jadikan rasul itu malaikat, tentulah Kami jadikan dia seorang laki-laki) Yakni seandainya Kami menjadikan malaikat yang diutus kepada Nabi dapat terlihat dan berbicara dengan mereka, maka Kami pasti menjadikannya dalam bentuk seorang laki-laki, karena mereka tidak memiliki kemampuan untuk melihat malaikat dalam bentuk aslinya sebagaimana ia diciptakan Allah, kecuali bila diserupakan dengan bentuk tubuh manusia. Karena andai saja malaikat tersebut diutus dengan bentuk sesungguhnya niscaya mereka akan lari ketakutan sehingga menjadikan mereka tidak bisa berbicara dan menyaksikannya. وَلَلَبَسْنَا عَلَيْهِم مَّا يَلْبِسُونَ (tentulah Kami meragu-ragukan atas mereka apa yang mereka ragu-ragukan atas diri mereka sendiri) Karena jika mereka melihat malaikat tersebut dalam bentuk manusia maka mereka akan berkata: ini adalah manusia dan bukan malaikat. Maka mereka akan kembali kepada keraguan mereka sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan jika Kami jadikan rasul itu seorang malaikat sebagaimana yang mereka minta, sungguh Kami akan menjadikannya sorang laki-laki supaya mereka bisa melihatnya, karena sesungguhnya mereka tidak mungkin bisa melihat malaikat dalam bentuk aslinya dan mereka akan takut dengannya. Dan Kami kacaukan mereka ketika malaikat itu berwujud manusia agar dilihat, sebagaimana mereka mengacaukan diri sendiri, lalu mereka akan berkata: “Ini adalah manusia bukan malaikat”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Kami jadikan dia} Kami menjadikan yang diturunkan kepada mereka {itu dari malaikat, tentu Kami jadikan dia laki-laki} Maka Kami membuat bentuk malaikat itu berupa bentuk laki-laki {dan pasti Kami buat mereka tetap ragu sebagaimana mereka ragu (9)} dan sungguh Kami membuat mereka bingung atas apa yang dibingungkan oleh diri mereka, sehingga mereka tidak mengetahui apakah dia malaikat ataukah manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Walaupun begitu, seandainya malaikat diutus dan diturunkan, niscaya mereka tidak mampu mengambil ilmu darinya dan mereka tidak kuasa, dan kekuatan mereka yang fana tidak akan memikulnya. “ Dan Kalau Kami jadikan rasul itu dari malaikat, tentulah kami jadikan dia berupa laki-laki,” karena hikmah tidak menuntut selain itu. “ KamiPun jadikan mereka tetap raku sebagaimana kini mereka ragu.” Maksudnya, niscaya perkaranya tetap rancu dan campur baur, hal itu karena mereka sendiri yang membuat kerancuan itu atas mereka karena mereka sendirilah yang mebangun sendiri perkara mereka di atas kaidahnya yang merupakan kaidahnya yang benar, hal itu tetap tidak menjadi petunjuk bagi mereka walaupun sebagaian mereka mendapatkan petunjuk darinya. Dosanya adalah dosa mereka, yang mana mereka telah menutup pintu hidayah dari diri mereka dan membuka pintu kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 9: Maksudnya kalau Allah mengutus seorang malaikat sebagai rasul, tentu Allah mengutusnya dalam bentuk seorang manusia, karena hikmah tidak menghendaki selain seperti itu, lagi pula manusia tidak dapat melihat malaikat, dan tentu mereka akan berkata, \"Ini bukan malaikat, tetapi hanya manusia seperti kami juga,\" sehingga mereka akan tetap ragu-ragu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 9",
    "description": "Allah masih melanjutkan jawaban terhadap pertanyaan orang-orang kafir tersebut. Dan sekiranya rasul itu kami jadikan dari malaikat, maksudnya bahwa kalau Allah mengutus malaikat sebagai rasul, tentu Allah mengutusnya dalam bentuk manusia, pastilah kami jadikan dia berwujud laki-laki, sebagaimana yang mereka minta, karena manusia tidak dapat melihat malaikat, dan, dengan demikian, tentu mereka akan berkata juga, ini bukanlah malaikat, hanya manusia sebagaimana kami juga. Jika begitu sikap mereka, pasti kami akan menjadikan mereka tetap ragu, karena pada intinya mereka menolak kehadiran seorang utusan sebagaimana kini mereka ragu terhadap kerasulan nabi MuhammadAllah menjelaskan bahwa ajaran para rasul cenderung ditolak dan rasulnya dicemoohkan oleh manusia yang sombong. Dan sungguh, beberapa rasul sebelum engkau, Muhammad, telah diperolok-olokkan, oleh kaumnya yang sombong dan keras kepala, sehingga turunlah azab berupa bencana alam dan kejadian luar biasa kepada orang-orang yang mencemoohkan itu, supaya mereka menyadari kesalahannya dan mengubah sikapnya. Azab itu ditimpakan sebagai balasan atas olok-olokan mereka terhadap para rasul yang mengajak mereka kepada jalan Allah."
  }
]