[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para nabi yang telah disebutkan nama-namanya tersebut, itulah orang-orang yang telah diberikan taufik oleh Allah , untuk memegangi agama yang benar, maka hendaknya engkau (wahai rasul) mengikuti petunjuk mereka dan menapaki jalan mereka. Dan katakanlah kepada kaum musyrikin , ”Aku tidak meminta upah duniawi dari kalian dalam menyampaikan dakwah islam ini. Sesungguhnya balasanku hanyalah menjadi tanggungan Allah. Dan tidaklah islam itu, kecuali ajakan kepada semua manusia menuju jalan yang lurus dalam peringatan bagi kalian dan orang-orang yang serupa dengan kalian yang berdiri di atas kebatilan. Semoga kalian dapat mengambil pelajaran darinya hal-hal yang bermanfaat bagi kalian. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Para nabi beserta para orangtua, anak-anak, dan saudara-saudaranya tersebut adalah orang-orang yang benar-benar mendapatkan hidayah (petunjuk dari Allah). Maka ikutilah jejak mereka dan contohlah perilaku mereka. Dan katakanlah -wahai Rasul- kepada kaummu, “Aku tidak minta imbalan apa pun dari kalian atas jasaku menyampaikan Al-Qur`ān ini kepada kalian. Karena Al-Qur`ān itu tidak lain adalah peringatan bagi alam semesta dari golongan jin dan manusia agar mereka jadikan sebagai petunjuk ke jalan yang lurus dan jalur yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Para rasul terdahulu itu telah Allah beri petunjuk. Mereka merupakan teladan yang baik bagi para nabi dan rasul setelah mereka; maka jadikanlah mereka -Hai Muhammad- contoh dalam kesempurnaan akhlak dan teladan yang baik dalam sifat dan perilaku mereka, karena dengan begitu kamu akan memiliki akhlak yang sempurna, sehingga kamu dapat menjadi orang yang paling sempurna akhlaknya di antara mereka. Dan Muhammad telah benar-benar memiliki akhlak yang paling sempurna. Hai Muhammad, katakanlah kepada orang-orang musyrik yang menyekutukan Allah dan mendustakan risalah dan kitabmu: \"Aku sama sekali tidak meminta kepada kalian upah dalam menyampaikan al-Qur'an, karena al-Qur'an yang aku bawa dari Tuhanku ini merupakan pelajaran bagi kalian dan bagi manusia seluruhnya jika hendak mengambil pelajaran dan mencari hidayah.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. أُو۟لٰٓئِكَ الَّذِينَ هَدَى اللهُ ۖ فَبِهُدَىٰهُمُ اقْتَدِهْ ۗ (Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka) Rasulullah diperintahkan untuk mengikuti jejak para rasul sebelumnya dalam hal yang belum terdapat wahyu tentangnya. قُل لَّآ أَسْـَٔلُكُمْ عَلَيْهِ أَجْرًا ۖ( . Katakanlah: “Aku tidak meminta upah kepadamu dalam menyampaikan”) Yakni Allah memerintahkan Rasulullah agar memberitahukan kepada mereka bahwa ia tidak meminta imbalan atas dakwah yang disampaikan kepada mereka menuju hidayah. إِنْ هُوَ إِلَّا ذِكْرَىٰ(Al-Quran itu tidak lain hanyalah peringatan) Yakni al-qur’an itu. لِلْعٰلَمِينَ(untuk seluruh ummat) Yakni pembelajaran dan peringatan bagi seluruh makhluk yang ada saat al-qur’an diturunkan dan setelahnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَبِهُدَاهُمُ اقْتَدِهْ } \"maka ikutilah petunjuk mereka\" Abu 'Utsman al-Hindy berkata : Para salaf dahulu senantiasa mengagungkan hari-hari yang sepuluh dalam tiga masa : Sepuluh hari pertama bulan muharrom, dan sepuluh hari pertama bulan Dzul hijjah, dan sepuluh hari terakhir di bulan Ramadhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90 Mereka itulah orang-orang yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka wahai Rasul. Ikutilah jalan mereka dalam menyeru kepada pengesaan allah dan budi pekerti yang luhur. Katakanlah kepada kaummu wahai Rasul: “Aku tidak meminta upah kepadamu dalam menyampaikan Al-Quran atau dalam menyampaikan risalah”. Al-Quran itu tidak lain hanyalah peringatan untuk seluruh umat dari manusia maupun jin."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah yang telah diberi petunjuk oleh Allah} Allah telah memberi petunjuk mereka {Maka terhadap petunjuk mereka} dengan sunnah mereka {teladanilah} ikutilah dan teladanilah {Katakanlah,“Aku tidak meminta kepada kalian atasnya} atas penyampaian Al-Qur’an {suatu imbalan. Itu hanyalah peringatan} peringatan dan pelajaran {bagi seluruh alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. ”Mereka itulah,” maksudnya, yang di sebutkan adalah “ orang-orang yang diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka.” Maksudnya, berjalanlah wahai Rasul yang mulia dibelakang para Nabi yang terpilih itu, ikutilah agama mereka. Sungguh rasululoh telah taat, dia mengambil petunjuk dari petunjuk para Rasul sebelumnya. Dia mengumpulkan kesempurnaan pada mereka, maka terkumpullah padanya keutamanaan-keutamaan dan keistimewaan yang dengannya dia mengunguguli seluruh alam. Dia adalah sayyid para Rasul imam orang-orang yang bertakwa. Dari segi ini kalangan para sahabat berdalil dengannya bahwa Rasululoh adalah Rasul paling utama. “Katakanlah” kepada orang-orang yang berpaling kepada dakwahmu, “Aku tidak meminta upah kepadamu dalam menyampaikan (Al-Qur’an).” Maksudnya, aku tidak meminta harta dan bayaran kepadamu sebagai upah atas tabligh dan dakwahku kepadamu, karena itu bisa menjadi sebab penolakanmu, balasanku hanyalah pada Allah. “ Al-Qur’an itu tiada lain hanyalah peringatan untuk segala umat.” Dengan al-Qur’an mereka ingat apa yang berguna bagi mereka lalu mereka melakukannya, sedangkan yang membahayakan mereka, maka mereka menjauhinya, dengannya mereka ingat pengetahuan tentang Tuhan mereka dengan nama-nama dan sifat-sifatNya, dengannya mereka ingat akhlak-akhlak yang terpuji dan sarana-sarana yang mengantarkan kepadanya dan akhlak-akhlak yang tercela dan sarana-sarana yang mengantarkan kepadanya, dan ai adalah peringatan bagi seluruh alam. Itu adalah nikmat terbesar bagi mereka, maka mereka harus menerima dan mensyukurinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 90: Kepada mereka yang berpaling dari dakwahmu. Dengan Al Qur’an, mereka dapat mengingat hal yang bermanfaat bagi mereka sehingga mereka dapat mengerjakannya, dan dengan Al Qur’an mereka dapat mengingat hal yang berbahaya bagi mereka sehingga mereka dapat meninggalkannya. Dengan Al Qur’an, mereka dapat mengenal Tuhan mereka melalui nama dan sifat-Nya, dengan Al Qur’an mereka dapat mengetahui akhlak yang mulia, dan jalan-jalan yang mengarah kepadanya, dengan Al Qur’an mereka dapat mengenal akhlak yang tercela, dan jalan-jalan yang mengarah kepadanya. Oleh karena Al Qur’an merupakan peringatan bagi seluruh alam, maka ia adalah nikmat tebesar yang seharusnya mereka terima dan syukuri. Manusia dan jin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 90",
    "description": "Ayat ini ditujukan kepada rasulullah yang nama beliau tidak disebut dalam rangkaian ayat di atas. Mereka itulah para nabi yang telah diberi petunjuk oleh Allah, maka ikutilah petunjuk mereka khususnya yang berkaitan dengan sikap mereka dalam berdakwah, yakni tidak meminta imbalan atas dakwah yang disampaikan. Untuk itu, katakanlah, hai Muhammad, kepada semua yang engkau ajak, aku tidak meminta imbalan kepadamu dalam menyampaikan dakwah khususnya ajaran alqur'an, karena dakwah yang kusampaikan dan Al-Qur'an itu tidak lain hanyalah peringatan untuk semua umat di seluruh alam. Orang-orang yang menolak dakwah nabi Muhammad mendapat kecaman seperti dijelaskan dalam ayat ini. Mereka, yakni kaum yang diajak itu, tidak mengagungkan Allah yang maha esa lagi mahakuasa sebagaimana mestinya. Di antara buktinya adalah ketika mereka berkata, Allah tidak menurunkan sesuatu pun kepada manusia. Katakanlah, wahai Muhammad, siapakah yang menurunkan kitab, yakni taurat, yang dibawa musa sebagai cahaya yang sangat jelas dan petunjuk bagi manusia yaitu kaum bani israil' kamu, wahai bani israil, menjadikannya, yakni kitab itu, lembaran-lembaran kertas yang bercerai-berai agar kamu memperlihatkan sebagiannya sesuai dengan keinginanmu dan banyak yang lain yang kamu sembunyikan, padahal telah diajarkan kepadamu melalui kitab itu apa yang tidak diketahui, baik olehmu maupun oleh nenek moyangmu. Mereka tidak mungkin menjawab dengan jawaban yang benar. Maka katakanlah, wahai Muhammad, Allah-lah yang menurunkannya, kemudian setelah engkau menyampaikan kebenaran Al-Qur'an dan mereka tetap menolak maka jangan hiraukan mereka, biarkanlah mereka bermain-main dalam kesesatannya."
  }
]