[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "91 tidak ada diantara Kaum musyrikin yang mengagungkan Allah dengan pengagungan yang semestinya, lantaran mereka mengingkari jika Allah  menurunkan kepada salah seorang dari kalangan manusia dari sebagian wahyuNya. katakanlah (wahai rasul), ”jika persoalannya seperti apa yang kalian sangkakan, maka siapakah yang menurunkan kitab yang dibawa oleh Musa kepada kaumnya yang menjadi cahaya dan hidayah bagi manusia?” kemudian arah pembicaraan beralih kepada orang-orang yahudi sebagai bentuk peringatan keras bagi mereka dengan firmanNya, ”kalian menjadikan kitab (suci) ini dalam kertas-kertas yang saling terpisah. Kalian perlihatkan sebagiannya dan kalian sembunyikan sebagian besar darinya.” Dan diantara perkara yang mereka sembunyikan ialah berita tentang sifat-sifat Muhammad  dan kenabiannya.” Dan Allah mengajarkan kepada kalian wahai sekalian orang arab, dengan kitab al-qur’an yang diturunkanNya kepada kalian. Didalamnya terdapat berita-berita tentang umat-umat sebelum kalian dan sesudah kalian, dan segala seuatu yang terjadi setelah kematian, (yang belum pernah kalian ketahui dan kakek moyang sekalipun).” katakanlah, ”Allah lah yang menurunkannya” kemudian biarkan saja mereka dalam ucapan batil mereka tenggelam dan bermain-main."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Dan orang-orang musyrik itu tidak memuliakan Allah dengan pemuliaan yang sesungguhnya tatkala mereka berkata kepada nabi-Nya, Muhammad -ṣallallāhu 'alaihi wa sallam-, “Allah tidak pernah menurunkan wahyu apa pun kepada seorang manusia.” Katakanlah -wahai Rasul- kepada mereka, “Siapakah yang telah menurunkan kitab suci Taurat kepada Musa sebagai cahaya, petunjuk, dan pembimbing bagi kaumnya?” Orang-orang Yahudi mencatat kitab suci Taurat itu dalam buku catatan. Mereka memperlihatkan bagian-bagian yang sejalan dengan hawa nafsu mereka dan menyembunyikan bagian-bagian yang tidak sesuai dengan hawa nafsu mereka. Seperti bagian yang menyebutkan ciri-ciri Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-. Sedangkan kalian -wahai bangsa Arab- telah diajari sebagian dari ilmu Al-Qur`ān yang belum pernah kalian ketahui dan belum pernah diketahui oleh para pendahulu kalian. Katakanlah -wahai Rasul- kepada mereka, “Allah lah yang telah menurunkannya (kitab suci Taurat).” Kemudian biarkanlah mereka dalam kebodohan dan kesesatan mereka sampai ajal menjemput mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Orang-orang musyrik itu tidak mengagungkan Allah dengan sebenar-benarnya dan tidak mengetahui-Nya dan kekuasaan-Nya dengan sebenar-benar pengetahuan. Hal ini karena mereka mengingkari bahwa Allah telah memilih seorang hamba-Nya untuk menjadi nabi dan rasul untuk menerima wahyu dari-Nya. Dan jawaban Allah terhadap perkataan mereka adalah: Hai Muhammad, Katakanlah: Siapakah yang menurunkan kitab yang dibawa oleh Musa sebagai cahaya dan petunjuk bagi manusia? Kemudian firman Allah ini ditujukan bagi orang-orang Yahudi sebagai olokan bagi mereka: kalian telah menjadikan Taurat hanya sebatas kertas-kertas yang kalian tunjukkan dan sembunyikan sesuai keinginan kalian yang mengikuti hawa nafsu dan ketamakan kalian. Hai orang-orang Arab, Allah telah mengajarkan kalian al-Qur'an ini; kalian dan nenek moyang kalian tidak mengetahui hal ini sebelumnya. Hai Muhammad Katakanlah: \"Allah yang menurunkan al-Qur'an\". Dan biarkanlah mereka bermain-main dalam perbincangan mereka yang batil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. وَمَا قَدَرُوا۟ اللهَ حَقَّ قَدْرِهِۦٓ (Dan mereka tidak menghormati Allah dengan penghormatan yang semestinya) Yakni mereka tidak mengetahui kedudukan-Nya dengan pengetahuan yang sebenarnya. إِذْ قَالُوا۟ مَآ أَنزَلَ اللهُ عَلَىٰ بَشَرٍ مِّن شَىْءٍ ۗ (di kala mereka berkata: “Allah tidak menurunkan sesuatupun kepada manusia”) Sehingga mereka mengingkari pengutusan para rasul dan penurunan kitab-kitab. قُلْ مَنْ أَنزَلَ الْكِتٰبَ الَّذِى جَآءَ بِهِۦ مُوسَىٰ( Katakanlah: “Siapakah yang menurunkan kitab (Taurat) yang dibawa oleh Musa) Mereka mengakui adanya Taurat dan mematuhinya serta mengetahuinya dari berita-berita yang disampaikan orang-orang Yahudi, dan mereka mempercayainya. تَجْعَلُونَهُۥ قَرَاطِيسَ (kamu jadikan kitab itu lembaran-lembaran kertas) Yakni kalian jadikan Taurat berada dalam kertas-kertas yang berserakan, agar kalian bisa mencapai keinginan kalian dalam merubah dan menganti isinya, serta menyembunyikan sifat Rasulullah yang disebutkan didalamnya. تُبْدُونَهَا(kamu perlihatkan (sebahagiannya)) Yakni kalian perlihatkan sebagian kertas-kertas itu. وَتُخْفُونَ كَثِيرًا ۖ( dan kamu sembunyikan sebahagian besarnya) Dan kalian sembunyikan sebagain besar darinya. وَعُلِّمْتُم مَّا لَمْ تَعْلَمُوٓا۟ أَنتُمْ وَلَآ ءَابَآؤُكُمْ ۖ( padahal telah diajarkan kepadamu apa yang kamu dan bapak-bapak kamu tidak mengetahui(nya)?) Yang diajarkan kepada mereka adalah apa yang telah dikabarkan kepada mereka oleh Rasulullah berupa hal-hal yang telah diwahyukan kepadanya, karena hal-hal tersebut mengandung apa yang belum mereka ketahui dari kitab-kitab mereka, dan tidak mereka dapatkan dari lisan para nabi mereka, serta tidak diketahui oleh para bapak-bapak mereka. قُلِ اللهُ ۖ( Katakanlah: “Allah”) Yakni Allah yang menurunkannya. ثُمَّ ذَرْهُمْ فِى خَوْضِهِمْ يَلْعَبُونَ(kemudian (sesudah kamu menyampaikan Al Quran kepada mereka), biarkanlah mereka bermain-main dalam kesesatannya) Yakni dalam kebathilan mereka, mereka bermain-main seperti halnya anak-anak yang sedang bermain-main."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91 Kemudian Allah menjawab orang-orang yang mengingkari bahwa Allah mengutus seorang manusia atas dasar bahwa manusia belum mengetahui Allah dengan benar, sebagaimana mereka mengingkari pengutusan Rasul, juga penurunan kitab-kitab. Mereka berkala kepada Nabi: “Allah tidak menurunkan ayat maupun kitab kepada manusia ”. Katakanlah kepada mereka wahai Nabi: “Siapakah yang menurunkan kitab Taurat yang dibawa oleh Musa sebagai cahaya dan petunjuk bagi manusia atas kebenaran dan kebatilan. Lalu kamu jadikan kitab itu wahai Yahudi sebagai lembaran-lembaran kertas yang tercerai-berai, kamu perlihatkan sebagiannya dan kamu sembunyikan sebagian besarnya. Atau mereka menjadikan setiap kertas hanya satu halaman, untuk menunjukkan apa yang mereka kehendaki berdasarkan kebaikan mereka. Juga menyembunyikan keinginan mereka, padahal telah diajarkan kepadamu apa yang kamu dan bapak-bapak kamu tidak mengetahuinya dalam masalah agama dan dunia?” Katakanlah: “Allah-lah yang menurunkannya Taurat dan Alquran, kemudian sesudah kamu menyampaikan Al Quran kepada mereka, biarkanlah mereka bermain-main dalam kesesatannya.” Ayat ini turun untuk menjawab orang Yahudi yang bernama Malik bin Shaif atau Fanhash. Nabi ditanya: Allah belum menurunkan kitab dari langit."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak mengagungkan Allah} mereka tidak mengagungkan Allah {sebagaimana mestinya} sebagaimana mengagungkanNya {ketika mereka berkata,“Allah tidak menurunkan sesuatu pun kepada manusia.” Katakanlah,“Siapakah yang menurunkan kitab yang dibawa Musa sebagai cahaya dan petunjuk bagi manusia? Kalian menjadikannya lembaran-lembaran. Kalian memperlihatkan sebagian dan menyembunyikan banyak bagian, Kalian telah diajarkan tentang apa yang tidak kalian ketahui maupun nenek moyang kalian” Katakanlah,“Allah.” Kemudian, biarkanlah mereka} tinggalkan mereka {dalam kesesatan mereka} kebodohan dan kesesatan mereka {bermain-main"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Ini adalah celaan terhadap orang-orang Yahudi dan orang-orang yang musyrik yang mengingkari kerasulan, dan mereka mengklaim bahwa Allah tidak menurunkan apapun kepada manusia. Barangsiapa mengucapkan itu, maka mereka tidak menghormati, dan tidak mengagungkan Allah dengan semestinya, karena ini adalah celaan kepada hikmahNya, dan klaim buruk bahwa Dia mebiarkan hamba-hambaNya begitu saja tanpa diperintah dan dilarang, dan merupakan penafian terhadap nikmat terbesar yang di berikan oleh Allah kepada hambaNya. Ia adalah Risalah dimana tidak ada jalan bagi hamba untuk mendapatkan kebahagaiaan, kemuliaan, keberuntungan, kecuali denganya. Adakah celaan kepada Allah yang lebih besar ini? “Katakanlah” kepada mereka dengan perkataan yang memastikan rusaknya pendapat mereka, tetapkanlah dengan sesuatu yang diakui oleh mereka, “Siapakah yang menurunkan Kitab yang di bawa oleh Musa.” Yaitu Taurat yang besar “sebagai cahaya” dalam kegelapan kebodohan, “dan petunjuk” ddari kesesatan, petunjuk jalan yang lurus sesuai dengan ilmu dan amal. Ia adalah kitab yng terkenal dan tersebar, namanya memenuhi hati dan pengdengaran sehingga mereka menulisnya dia kertas dan mengubahnya sesuai dengan yang merema inginkan, apa yang sesuai dengan keinginan mereka, maka mereka menampakannya dan apa yang tidak, maka mereka menyembunyikannya dan banyak. “padahal telah di ajarkan kepadamu” ilmu-ilmu dengan kitab-kitab yang agung itu, “apa yang kamu dan bapak-bapak kamu tidak mengetahuiNya?” Jika kamu tanyakan kepada mereka siapa yang menurunkan kitab dengan kriteria-kriteria ini, maka jawablah pertanyaan ini dan “Katakanlah, ‘Allah-lah,” yang menurunkanNya. Pada saat itu kebenaran menjadi jelas dan terang seperti matahari, dan hujjah pun tegak atas mereka. “Kemudian (sesudah kamu menyampaikan al-Qur’an kepada mereka),” jika kamu telah melazimkan mereka menerima, “biarkanlah mereka bermain-main dalam kesesatannya.” Maksudnya, biarkan mereka tenggelam dalam kebathilan dan bermain-main dengan hal-hal yang tida berguna sampai mereka bertemu hari yang di janjikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 91: Yakni orang-orang Yahudi. Karena perkataan yang akan disebutkan itu sama saja mencacatkan kebijaksanaan-Nya dan menyangka bahwa Allah membiarkan begitu saja hamba-hamba-Nya; tidak memerintah dan tidak melarang. Bahkan menolak nikmat terbesar yang diberikan Allah kepada hamba-hamba-Nya, yaitu pengutusan rasul, di mana tidak ada jalan bagi manusia untuk memperoleh kebahagiaan dan keberuntungan kecuali dengannya. Kepada Nabi Muhammad shallallahu ‘alaihi wa sallam saat mereka menentang Al Qur’an. Bagi gelapnya kebodohan. Mereka menyalinnya dalam lembaran kertas, apa yang sesuai dengan keinginan mereka, mereka tampakkan dan yang tidak sesuai dengan keinginan mereka, mereka sembunyikan. Mereka lebih banyak menyembunyikan isi kitab itu. Seperti tentang sifat Nabi Muhammad shallalahu ‘alaihi wa sallam. Dalam kitab itu. Perkataan “Biarkanlah mereka bermain-main dalam kesesatannya” adalah sebagai sindiran kepada mereka, seakan-akan mereka dipandang sebagai kanak-kanak yang belum berakal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 91",
    "description": "Orang-orang yang menolak dakwah nabi Muhammad mendapat kecaman seperti dijelaskan dalam ayat ini. Mereka, yakni kaum yang diajak itu, tidak mengagungkan Allah yang maha esa lagi mahakuasa sebagaimana mestinya. Di antara buktinya adalah ketika mereka berkata, Allah tidak menurunkan sesuatu pun kepada manusia. Katakanlah, wahai Muhammad, siapakah yang menurunkan kitab, yakni taurat, yang dibawa musa sebagai cahaya yang sangat jelas dan petunjuk bagi manusia yaitu kaum bani israil' kamu, wahai bani israil, menjadikannya, yakni kitab itu, lembaran-lembaran kertas yang bercerai-berai agar kamu memperlihatkan sebagiannya sesuai dengan keinginanmu dan banyak yang lain yang kamu sembunyikan, padahal telah diajarkan kepadamu melalui kitab itu apa yang tidak diketahui, baik olehmu maupun oleh nenek moyangmu. Mereka tidak mungkin menjawab dengan jawaban yang benar. Maka katakanlah, wahai Muhammad, Allah-lah yang menurunkannya, kemudian setelah engkau menyampaikan kebenaran Al-Qur'an dan mereka tetap menolak maka jangan hiraukan mereka, biarkanlah mereka bermain-main dalam kesesatannya usai menjelaskan tujuan Allah menurunkan kitab kepada nabi musa, pada ayat ini Allah menegaskan tujuan diturunkannya Al-Qur'an. Dan ini, yakni Al-Qur'an, kitab yang telah kami turunkan dengan penuh berkah yang berisi tuntunan yang dapat mengantar kepada kebajikan yang melimpah; membenarkan kitab-kitab yang diturunkan sebelumnya seperti taurat dan injil, dan agar engkau, hai nabi Muhammad, memberi peringatan kepada penduduk ummul qura, yakni mekah, dan orangorang yang ada di sekitarnya yang tidak memercayainya. Orang-orang yang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya, yaitu Al-Qur'an, dan mereka selalu memelihara salatnya dengan tekun dan sungguh-sungguh."
  }
]