[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kitab al-qur’an ini adalah kitab yang kami turunkan kepadamu (wahai rasul), merupakan kitab yang memiliki manfaaat yang agung, yang membenarkan kitab-kitab yang datang sebelumnya yang diturunkan. Dan sesungguhnya ia merupakan dari sisi Allah. Kami menurunkannya agar dengan kitab itu engkau menakut-nakuti orang-orang (Makkah) dan sekitarnya dari seluruh penduduk penjuru dunia terhadap azab dan siksaan Allah. Dan orang-orang yang membenarkan kehidupan akhirat, mereka itu membenarkan al-qur’an adalah firman Allah dan memperhatikan penegakan shalat dalam waktu-waktunya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Dan kitab suci Al-Qur`ān ini Kami turunkan kepadamu wahai Nabi, sebagai kitab suci yang penuh berkah dan membenarkan kitab-kitab suci sebelumnya. Dan hendaknya kamu menjadikan kitab suci ini sebagai bahan untuk memperingatkan penduduk Makkah dan seluruh umat manusia yang ada di timur dan barat agar mereka mendapatkan petunjuk ke jalan yang benar. Orang-orang yang percaya akan adanya Akhirat pasti percaya kepada kitab suci Al-Qur`ān ini dan mengamalkan isinya. Dan mereka akan senantiasa menjaga salat-salat mereka dengan cara menunaikan rukun-rukunnya, hal-hal yang wajib, dan sunah-sunahnya pada waktu-waktu yang telah ditetapkan untuknya secara syariat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Hai Muhammad, al-Qur'an yang Aku turunkan kepadamu ini mengandung kebaikan, kebajikan, keberkahan, hukum-hukum, dan mukjizat-mukjizat. Ia menjadi saksi atas kebenaran kitab-kitab samawi yang telah diturunkan sebelumnya; dan untuk kamu gunakan sebagai peringatan bagi penduduk Makkah dan negeri-negeri lain di sekitarnya, agar tidak terjerumus ke dalam kesesatan dan kekafiran terhadap Allah. Dan orang-orang yang beriman kepada hari akhir dan hari kebangkitan setelah mati akan membenarkan al-Qur'an ini, bahwa ia adalah kalam Allah yang diturunkan kepadamu, dan mereka adalah orang-orang yang senantiasa menjaga salat dengan mendirikannya pada waktu-waktu yang telah ditentukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَهٰذَا كِتٰبٌ أَنزَلْنٰهُ مُبَارَكٌ (Dan ini (Al Quran) adalah kitab yang telah Kami turunkan yang diberkahi) Yang diturunkan kepada Muhammad. Lalu bagaimana kalian mengatakan bahwa Allah tidak menurunkan sesuatupun kepada manusia. Makna (المبارك) yakni yang memiliki berkah yang banyak. مُّصَدِّقُ الَّذِى بَيْنَ يَدَيْهِ (membenarkan kitab-kitab yang (diturunkan) sebelumnya) Yakni yang sesuai dengan kitab-kitab yang telah diturunkan Allah kepada para rasul sebelumnya seperti Taurat dan Injil. وَلِتُنذِرَ (dan agar kamu memberi peringatan) Yakni Kami menurunkannya untuk keberkahan dan untuk kamu jadikan peringatan. أُمَّ الْقُرَىٰ (kepada (penduduk) Ummul Qura) Yakni kota Makkah yang merupakan kota yang paling agung, ialah bangunan pertama yang didirikan untuk manusia sebagai tempat ibadah, dan ia merupakan kiblat dan tempat berhaji bagi umat ini. Maka peringatan bagi penduduk kota Makkah akan serta merta diikuti oleh peringatan bagi seganap penduduk bumi. وَمَنْ حَوْلَهَا ۚ( dan orang-orang yang di luar lingkungannya) Yakni manusia yang berada di bumi Allah yang luas ini. وَالَّذِينَ يُؤْمِنُونَ بِالْءَاخِرَةِ يُؤْمِنُونَ بِهِۦ ۖ(Orang-orang yang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya) Salah satu hak bagi orang yang percaya terhadap kehidupan akhirat adalah ia akan percaya pula dengan kitab ini. Karena kapercayaan terhadap akhirat melazimkan penerimaan terhadap seruan orang menuju apa yang dapat mendatangkan kebaikan akhirat tersebut dan menjauhkan dari kemudharatannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَهَٰذَا كِتَابٌ أَنْزَلْنَاهُ مُبَارَكٌ } \"Dan ini (Al Quran) adalah kitab yang telah Kami turunkan yang diberkah\" kitab yang penuh dengan keberkahan dan kebaikan, barangsiapa yang mempelajarinya dan mengamalkan segala syariat yang terkandung di dalamnya, niscaya kebaikan di dunia dan di akhirat akan membanjirinya, para ulama tafsir mengatakan : \"kami sibuk dengan al-Qur'an dan sungguh keberkahan menyelimuti kami sebagai bukti akan kebenaran firman Allah : { كِتَابٌ أَنْزَلْنَاهُ مُبَارَكٌ }. Dan sesungguhnya al-Qur'an ini Allah tidak memudahkan bagi siapapun untuk di amalkan kecuali bagi orang-orang yang baik dan mendapat berkah dari Allah, karena ia adalah kalam tuhan semesta alam, maka barangsiapa yang menjalankan segala perintah yang disampaikan oleh kitab ini dan menjauhi segala larangannya, dan darinya ia mengetahui aqidah yang benar, ia juga mengetahui asal-asal halal dan haram, dan akhlaq yang mulia, niscaya Allah akan memudahkan baginya segala urusan di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92 Dan Al-Quran ini adalah kitab yang telah Kami turunkan terdapat banyak manfaat dan keberkahan. Kami turunkan kepadamu wahai Rasul, yang membenarkan kitab-kitab yang diturunkan sebelumnya seperti Taurat dan Injil dan agar kamu memberi peringatan kepada penduduk Ummul Qura (Mekah) dan orang-orang yang di luar lingkungannya. Di kota itu tedapat Ka’bah yang mulia, rumah yang pertama kali dibangun untuk manusia. Ka’bah adalah kiblat umat manusia Orang-orang yang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya Al Quran, sebab siapa yang mengimani hari akhirat sebelum menerima balasan baik dan mereka selalu memelihara sembahyangnya dengan takut kepada siksa akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ini} Al-Qur’an {adalah kitab yang telah Kami turunkan, yang diberkahi, membenarkan kitab-kitab yang sebelumnya dan agar kamu memberi peringatan kepada (penduduk) Ummul Qura} penduduk Makkah {dan orang-orang yang ada di sekitarnya. Orang-orang yang beriman pada akhirat itu beriman padanya dan mereka selalu memelihara shalatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. “Dan ini,” al-Qur,an yang “kami turunkan” kepadamu. “Yang diberkahi,” maksudnya, Allah memberi sifat keberkahan. Hal itu karena kebaikannya yang banyak dan luas. “Membenarkan kitab-kitab sebelumnya.” Maksudnya, sesuai dengan kitab-kitab sebelumnya dan beraksi atas kebenaran. “dan agar kamu memberi peringatan kepada penduduk Makkah dan orang-orang yang diluar lingkungannya.” Maksudnya, Kami menurunkan Al-Qur’an juga agar kamu memberi peringatan kepada penduduk Ummul Qura-Makkah Al-Mukaramah-dan Daerah Arab sekelilingNya bahkan seluruh negeri. Peringatkan manusia dari azab Allah dan siksaNya terhadap umat-umat, peringatkan mereka dari penyebabnya. “orang-orang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya Al-Qur’an,” karena jika rasa takut dalam hati telah memenuhi bagiannya, maka ia akan tunduk kepada keridhaanNya. “Dan mereka selalu memelihara shalatnya.” Mereka terus nenerus menetapinya, menjaga rukun-rukun, batasan-batasan, syarat-syarat, adab-adab, dan penyempurnaan-penyempurnaaNya. Semoga Allah menjadikan kita termasuk dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 92: Karena banyak kebaikannya. Sesuai dan menjadi saksi terhadap kebenaran. Yaitu kitab-kitab dan sahifah-sahifah (lembaran) yang diturunkan sebelum Al Quran. Yakni semua manusia. Menjaga syarat dan rukunnya, adab dan penyempurnanya, semoga Allah menjadikan kita termasuk golongan mereka, Alahumma aamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 92",
    "description": "Usai menjelaskan tujuan Allah menurunkan kitab kepada nabi musa, pada ayat ini Allah menegaskan tujuan diturunkannya Al-Qur'an. Dan ini, yakni Al-Qur'an, kitab yang telah kami turunkan dengan penuh berkah yang berisi tuntunan yang dapat mengantar kepada kebajikan yang melimpah; membenarkan kitab-kitab yang diturunkan sebelumnya seperti taurat dan injil, dan agar engkau, hai nabi Muhammad, memberi peringatan kepada penduduk ummul qura, yakni mekah, dan orangorang yang ada di sekitarnya yang tidak memercayainya. Orang-orang yang beriman kepada adanya kehidupan akhirat tentu beriman kepadanya, yaitu Al-Qur'an, dan mereka selalu memelihara salatnya dengan tekun dan sungguh-sungguh. Ayat sebelumnya menguraikan bahwa Al-Qur'an bersumber dari Allah. Ayat ini mengecam orang-orang yang mengaku-ngaku mendapat wahyu dari Allah. Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan dusta terhadap Allah seperti halnya orang-orang yahudi, atau siapa yang lebih zalim daripada orang yang berkata, telah diwahyukan kepadaku oleh Allah, padahal tidak diwahyukan sesuatu pun kepadanya, dan siapa pula yang lebih zalim dari orang yang berkata, aku akan menurunkan, yaitu menyampaikan, seperti apa yang diturunkan Allah yaitu Al-Qur'an yang dipercayai oleh kaum muslim' tidak ada yang lebih zalim kecuali tiga macam manusia tersebut, maka wajar kalau mereka mendapat siksa. Alangkah ngerinya sekiranya engkau melihat pada waktu orang-orang zalim yang sudah mencapai puncak kezalimannya berada dalam kesakitan sakratulmaut, sedang para malaikat memukul dengan tangannya sambil berkata, keluarkanlah nyawamu! pada hari ini kamu akan dibalas dengan azab yang sangat menghinakan, karena kamu mengatakan terhadap Allah perkataan yang tidak benar dan karena kamu menyombongkan diri terhadap ayat-ayat-Nya yakni enggan menerimanya bahkan melecehkannya."
  }
]