[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan siapakah orang yang lebih zhalim dari orang yang mengadakan ucapab kedustaan atas Nama Allah di mana dia mengklaim Allah sama sekali tidak mengutus satu orang pun dari kalangan manusia sebagai rasul (Nya) atau dia mengaku-aku dengan dengan dusta bahwa Allah telah mewahyukan kepadanya, padahal Allah tidak pernah menyampaikan wahyu kepadanya, atau dia mengklaim bahwa dirinya berkuasa menurunkan sesuatu yang serupa dengan al-Qur’an yang di turunkan Allah? Seandainya engkau (wahai Rasul) , menyaksikan orang-orang yang berbuat melampaui batas saat mereka dalam kesulitan-kesulitan sakaratul maut, sedang para malaikat mencabut nyawa-nyawa mereka tengah membentangkan tangan-tangan mereka menimpakan siksaan seraya berkata kepada orang-orang tersebut, ; ‘’keluarkanlah nyawa kalian! Hari ini, kalian dihinakan sehina-hinanya, sebagaimana kalian dahulu mengadakan kebohongan atas Nama Allah, dan menyombongkan diri untuk mengikuti ayat-ayat Allah dan patuh terhadap rasul-rasul Nya. ’’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Tidak ada yang lebih zalim dari orang yang mengada-mengada dan membuat kebohongan atas nama Allah. Yaitu dengan mengatakan, “Allah tidak pernah menurunkan wahyu apa pun kepada seorang manusia.” Atau orang yang mengaku-aku bahwa Allah telah memberinya wahyu, padahal Allah tidak pernah memberinya wahyu apa pun. Atau orang yang mengatakan, “Aku akan menurunkan kitab suci seperti Al-Qur`ān yang telah Allah turunkan.” Sekiranya kamu -wahai Rasul- melihat ketika orang-orang zalim itu mengalami sakratulmaut, sementara para malaikat membentangkan tangannya ke arah mereka untuk memberikan siksaan dan pukulan. Dan para malaikat tersebut dengan nada yang sangat keras berkata kepada mereka, “Keluarkanlah nyawa kalian! Karena kami akan mencabutnya. Pada hari inilah kalian akan dibalas dengan azab yang menghinakan dan menistakan kalian, disebabkan kebohongan yang telah kalian buat atas nama Allah dengan mengaku-aku menjadi nabi, menerima wahyu dan menurunkan kitab suci seperti yang diturunkan oleh Allah. Dan juga disebabkan oleh kesombongan kalian untuk beriman kepada ayat-ayat-Nya.” Sekiranya kamu melihatnya, niscaya kamu akan melihat sesuatu yang sangat mengerikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Ini merupakan pertanyaan yang yang dimaksudkan untuk pengingkaran, yakni: Tidak ada yang lebih zalim daripada orang yang berdusta terhadap Allah Dengan mengatakan atau melakukan sesuatu yang dinisbahkan kepada Allah namun Allah berlepas diri dari hal tersebut; atau mengaku bahwa Allah telah memberinya wahyu; atau mengaku bahwa dia merupakan nabi yang diutus; atau mengaku bahwa dia mampu menurunkan seperti al-Qur'an yang telah diturunkan Allah. Hai Muhammad, jika kamu melihat orang-orang zalim itu ketika ajal tiba dan mengalami sakaratul maut, dan malaikat maut telah mengulurkan tangannya untuk memberi azab dan mencabut ruh mereka, seraya berkata dengan penuh kemurkaan: \"keluarkanlah ruh kalian dari jasad dan serahkanlah kepada kami. Jika kalian mampu menyelamatkannya dari azab maka lakukanlah, namun bagaimana kalian mampu melakukannya? Pada hari ini kalian dihinakan dan diazab dengan azab yang keras akibat keengganan kalian mendengar ayat-ayat Allah dan mengikuti para rasulnya serta kedustaan yang kalian katakan terhadap Allah berupa keingkaran bahwa Allah telah menurunkan kitab-kitab-Nya kepada para Rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللهِ كَذِبًا (Dan siapakah yang lebih zalim daripada orang yang membuat kedustaan terhadap Allah) Yakni bagaimana kalian mengatakan Allah tidak menurunkan sesuatupun kepada manusia, sedangkan hal itu menjadikan kalian mendustakan para nabi, dan tidak ada orang yang lebih zalim dari orang yang mengadakan kebohongan terhadap Allah seperti orang yang mengaku dirinya nabi padahal ia bukan nabi, atau berbohong terhadap Allah dalam suatu hal. أَوْ قَالَ أُوحِىَ إِلَىَّ وَلَمْ يُوحَ إِلَيْهِ شَىْءٌ (atau yang berkata: “Telah diwahyukan kepada saya”, padahal tidak ada diwahyukan sesuatupun kepadanya) Dan Allah telah menjauhkan para nabi-Nya dari apa yang kalian klaim atas mereka. Dan perbuatan kalian ini merupakan perbuatan para pendusta dan para pemimpin kesesatan seperti Musailamah al-kadzzab, Aswad al-ansy, dan Sajjah. وَمَن قَالَ سَأُنزِلُ مِثْلَ مَآ أَنزَلَ اللهُ ۗ( dan orang yang berkata: “Saya akan menurunkan seperti apa yang diturunkan Allah”) Yakni mengaku bahwa ia mampu menandingi a;-qur’an dengan yang semisalnya, yang mengatakan “sedandainya kami mau maka kami akan mendatangkan perkataan yang seperti ini. Pendapat lain mengatakan: dia adalah Abdullaah bin Abi Sarah, dahulu ia menulis wahyu untuk Rasulullah, maka Rasulullah mendiktenya (ثم أنشأناه خلقاآخر) lalu Abdullah berkata (فتبارك الله أحسن الخالقين) maka Rasulullah menjawab: “memang seperti itu ayat ini diturunkan”. Maka Abdullah ketika itu mendapat keraguan seraya bergumam: “seandainya Muhammad berkata benar maka aku telah diberi wahyu sebagaimana ia diberi wahyu, dan seandainya ia berbohong maka sebenarnya aku telah berkata sebagaimana yang ia katakan”. Kemudian ia murtad dari agama Islam dan bergabung dengan orang-orang musyrik, dan ia kembali memeluk Islam pada hari penakhlukkan kota Makkah sebagaimana telah diketahui. وَلَوْ تَرَىٰٓ إِذِ الظّٰلِمُونَ فِى غَمَرٰتِ الْمَوْتِ(Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim berada dalam tekanan sakratul maut) Yakni dalam kesakitan saat pencabutan nyawa. Ayat ini mencakup orang-rang yang ingkar terhadap apa yang diturunkan Allah, orang-orang yang mengaku sebagai nabi, dan orang-orang yang hendak menandingi al-qur’an. Maksud ayat ini adalah sekiranya kamu melihatnya pasti kamu akan melihat kejadian yang besar. وَالْمَلٰٓئِكَةُ بَاسِطُوٓا۟ أَيْدِيهِمْ (sedang para malaikat memukul dengan tangannya) Yakni untuk mencabut nyawa orang-orang kafir. Pendapat lain mengatakan yakni untuk mengazab mereka dengan membawa palu-palu besi di tangan mereka. أَخْرِجُوٓا۟ أَنفُسَكُمُ ۖ ((sambil berkata): “Keluarkanlah nyawamu”) Yakni sambil berkata kepada mereka “selamatkanlah diri kalian dari kesulitan yang kalian alami ini”, atau “bebaskanlah diri kalian dari tangan kami dan selamatkan diri kalian dari azab ini”, atau “keluarkanlah nyawa kalian untuk kami cabut dari jasad kalian dan serahkanlah ia kepada kami”. بِمَا كُنتُمْ تَقُولُونَ عَلَى اللهِ غَيْرَ الْحَقِّ (karena kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar) Yakni karena perkataan kalian ini, berupa keingkaran terhadap kitab-kitab yang diturunkan Allah kepada para rasul-Nya, dan karena pengakuan kalian bahwa Allah memiliki sekutu. وَكُنتُمْ عَنْ ءَايٰتِهِۦ تَسْتَكْبِرُونَ (dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayat-Nya) Yakni menyombongkan diri dari beriman kepada ayat-ayat-Nya dan beramal dengannya; maka balasan untuk kalian dengan azab yang hina ini merupakan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93 Siapakah yang lebih zalim daripada orang yang membuat kedustaan terhadap Allah, sehingga menentang kenabian dan mendustakan Allah dalam sesuatu atau yang berkata: “Telah diwahyukan kepada saya”, padahal tidak diwahyukan sesuatupun kepadanya, dan orang yang berkata: “Saya akan menurunkan seperti Alquran yang diturunkan Allah”. Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zalim (orang-orang kafir) berada dalam tekanan sakratul maut, sedang para malaikat memukul tangannya untuk menarik ruh mereka, sambil berkata: “Keluarkanlah nyawamu dari tangan kami, dan selamatkanlah ia dari azab jika kalian mampu” Ini adalah bukti bahwa sakarat maut itu sangat dahsyat. Di hari ini kamu dibalas dengan siksa yang sangat menghinakan, hingga benar-benar menghinakan diri sendiri, karena kamu selalu mengatakan terhadap Allah perkataan yang tidak benar seperti menyekutukan Allah atau menyangkal wahyu dan kenabian dan karena kamu juga selalu menyombongkan diri terhadap ayat-ayat-Nya dan menjalankan perintahnya. Ikrimah menyebutkan bahwa ayat wa man adhlama. ini turun untuk Musailamah. Adapun ayat Saunzila mitsla. turun untuk Abdullah bin Abi Saroh yang menulis wahyu, kemudian dia merubahnya, sehingga keluar dari Islam dan bergabung dengan Qurays, kemudian masuk Islam pada hari Fathu Makkah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan} membuat-buat {dusta terhadap Allah atau yang berkata,“Telah diwahyukan kepadaku,” padahal tidak diwahyukan apapun kepadanya dan orang yang berkata,“Aku akan mendatangkan sesuatu seperti yang diturunkan Allah.” Jika saja kamu melihat ketika orang-orang zalim itu dalam kesakitan mati} kesakitan dalam sakaratul maut {dan para malaikat memukul dengan tangannya,“Keluarkanlah nyawamu!” Pada hari ini kalian akan dibalas dengan azab yang menghinakan} menghinakan dan merendahkan {karena kalian mengatakan terhadap Allah yang tidak benar dan kalian menyombongkan diri terhadap ayat-ayatNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. Allah menjelaskan bahwa tidak ada seorangpun yang kezhaliman dan kejahatannya lebih besar daripada orang yang berdusta di atas Nama Allah dengan menisbatkan ucapan atau hukum kepada Allah padahal Allah terbebas darinya. Orang ini adalah orang terzhalim, karena perbuatannya mengandung kedustaan, dia mengubah agama, furu dan ushulnya, dan menisbatkannya kepada Allah, dan ini adalah kerusakan terbesar. Termasuk dalam hal ini adalah klaim kenabian, bahwa Allah mewahyukan kepadanya, padahal dalam hal tersebut dia dusta. Disamping dia telah berdusta atas Nama Allah dan kelancangannya terhadap kebesaran dan kekuasaanNya, dia juga telah mewajibkan manusia untuk mengikutinya, dia juga telah melawan mereka di atas dasar itu (jika tidak mau mengikutinya) serta menghalalkan darah dan harta orang-orang yang menyelisihinya. Termasuk di dalam ayat ini adalah setiap orang yang mangaku sebagi nabi seperti Musailamah al-kadzdzab, al- Aswad al- Ansi, al-Mukhtar, dan lain-lain yang mengikuti sifat ini. “Dan orang yang berkata, ‘saya akan menurunkan seperti apa yang di turunkan oleh Allah’.” Maksudnya, siapa yang lebih zhalim daripada orang yang mengklaim bahwa dirinya mampu melakukan apa yang di lakukan oleh Allah, menandingi hukum-hukumNya, dan membuat syari’at seperti Allah? Termasuk di dalamnya orang yang mengklaim bahwa dia mampu manangtang Al-Qur’an, bahwa dia mampu menghadirkan yang sepertinya. Kezhliman mana yang lebih besar daripada orang miskin lagi lemah lagi kurang dari berbagai segi bahwa dirinya mampu menandingi Yang Mahakuat, Mahakaya, pemilik kesempurnaan yang mutlak dari berbagai segi, pada dzat, nama, dan sifatNya? ketika Allah mencela orang-orang zhalim, maka Dia menyebutkan siksa yang Dia siapkan untuk mereka pada waktu mereka hadir di Hari Kiamat. Dia berfirman, “Alangkah dahsyatnya sekiranya kamu melihat di waktu orang-orang yang zhalim (berada) dalam tekanan-tekanan sakaratul maut.” Maksudnya, berada dalam kesulitan dan sekarat yang menyakitkan dan penderitaannya yang berat, niscaya kamu akan melihat perkara yang menakutkan dan keadaan yang sulit untuk digambarkan. “Sedang para malaikat memukul dengan tangannya,” kepada orang-orang zhalim yang kematiannya diiringi oleh pukulan dan siksaan. Para malaikat itu berkata kepada mereka pada waktu menarik ruhnya dan (sulitnya ia) keluar dari badannya, “Keluarkan nyawamu.” Di hari ini kamu dibalas dengan siksaan yang sangat menghinakan.” Maksudnya, azab yang keras yang menghinakanmu. Dan balasan itu dari jenis perbuatan itu sendiri, karena azab ini “disebabkan kamu selalu mengatakan terhadap Allah (perkataan) yang tidak benar.” Karena kedustaanmu atasnya dan penolakanmu terhadap kebenaran yang dibawa oleh para Rasul. “Dan (karena) kamu selalu menyombongkan diri terhadap ayat-ayatNya.” Maksudnya, kamu tidak mau tunduk dan berserah diri kepada hukum-hukumNya. Ini mengandung dalil atas azab dan nikmat kubur. Pembicaraan dan azab yang diarahkan kepada mereka ini terjadi pada waktu hadirnya kematian, sebelum dan sesudahnya. Ini juga menunjukkan bahwa ruh adalah materi, ia keluar dan masuk, diajak bicara, tinggal di dalam tubuh dan meninggalkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 93: Dengan mengaku sebagai nabi padahal bukan nabi. Seperti Musailamah Al Kadzdzab. Mereka memperolok ayat-ayat Allah, merekalah orang-orang berkata, “Jika kami mau, kami juga dapat berkata seperti ini.” Termasuk pula orang-orang yang berani menantang Al Qur’an. Kezaliman apa yang lebih besar daripada kezaliman orang yang lemah lagi miskin serta memiliki kekurang mengaku mampu melakukan seperti yang dilakukan Yang Maha Kuat, Maha Kaya dan memiliki kesempurnaan dari berbagai sisi? Dengan keras. Seperti mengaku nabi dan menerima wahyu dan mengaku mampu membuat kitab yang sama dengan Al Qur’an. Balasan seperti ini sesuai amal yang mereka kerjakan. Mengangkat diri dan tidak tunduk kepada ayat-ayat-Nya. Dalam ayat ini terdapat dalil adanya azab kubur dan nikmatnya, karena kata-kata di atas dan azab tersebut terjadi ketika mereka sakaratul maut, menjelang mati dan setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 93",
    "description": "Ayat sebelumnya menguraikan bahwa Al-Qur'an bersumber dari Allah. Ayat ini mengecam orang-orang yang mengaku-ngaku mendapat wahyu dari Allah. Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan dusta terhadap Allah seperti halnya orang-orang yahudi, atau siapa yang lebih zalim daripada orang yang berkata, telah diwahyukan kepadaku oleh Allah, padahal tidak diwahyukan sesuatu pun kepadanya, dan siapa pula yang lebih zalim dari orang yang berkata, aku akan menurunkan, yaitu menyampaikan, seperti apa yang diturunkan Allah yaitu Al-Qur'an yang dipercayai oleh kaum muslim' tidak ada yang lebih zalim kecuali tiga macam manusia tersebut, maka wajar kalau mereka mendapat siksa. Alangkah ngerinya sekiranya engkau melihat pada waktu orang-orang zalim yang sudah mencapai puncak kezalimannya berada dalam kesakitan sakratulmaut, sedang para malaikat memukul dengan tangannya sambil berkata, keluarkanlah nyawamu! pada hari ini kamu akan dibalas dengan azab yang sangat menghinakan, karena kamu mengatakan terhadap Allah perkataan yang tidak benar dan karena kamu menyombongkan diri terhadap ayat-ayat-Nya yakni enggan menerimanya bahkan melecehkannya. Setelah menjelaskan keadaan para pendurhaka ketika menghadapi tekanan sakratulmaut, ayat ini menjelaskan tentang keadaan mereka setelah roh terpisah dari jasad mereka. Dan kamu, setelah dicabut rohmu dan sekian lama menunggu di alam barzakh, akan benar-benar datang sendiri-sendiri kepada kami sebagaimana kami ciptakan kamu pada mulanya, yakni ketika lahir ke dunia, dan apa yang telah kami karuniakan kepadamu seperti harta benda, anak, kerabat, dan lainnya, kamu tinggalkan di belakangmu di dunia. Kami tidak melihat pemberi syafaat, yakni pertolongan, besertamu yang dulu kamu sembah dan yang kamu anggap bahwa mereka itu sekutu-sekutu bagi Allah. Sungguh, telah terputuslah semua pertalian antara kamu dan telah lenyap dari kamu apa yang dahulu kamu sangka sebagai sekutu Allah."
  }
]