[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sunguh kalian kelak akan datang kepada kami sendiri-sendiri untuk menghadapi perhitungan amal dan pembalasanya, sebagai mana dahulu kami ciptakan di dunia pertama kali dalam keadaan tanpa alas kaki dan telanjang. Dan kalian tinggalkan di belakang kalian apa yang dahulu kami kuasakan kepada kalian dari apa yang kalian bangga-banggakan berupa kekayaan di dunia. Dan kami tidaklah melihat beserta kalian di akhirat berhala-berhala yang dahulu kalian yakini bahwa mereka bapat memberikan syafa’at bagi kalian dan kalian klaim menjadi sekutu-sekutu Allah dalam ibadah. Sesunguhnya telah sirna hubungan yang kalian jalin antara kalian di dunia , dan hilanglah dari apa yang kalian klaim bahwa sesembahan-sesembahan kalian merupakan sekutu Allah dalam perkara peribadahan dan menjadi tampak jelas bahwa kalian telah merugi bagi diri kalian, keluarga dan harta benda kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Dan pada hari kebangkitan kelak akan dikatakan kepada mereka, “Kalian telah datang kepada Kami hari ini sendiri-sendiri, tanpa kekayaan dan jabatan, sebagaimana Kami menciptakan kalian pertama kali, tanpa alas kaki, tanpa pakaian, dan tidak berkhitan. Dan kalian terpaksa meninggalkan apa yang telah Kami berikan kepada kalian di dunia. Dan hari ini Kami tidak melihat kalian bersama berhala-berhala yang dahulu kalian anggap dapat menolong kalian dan kalian anggap sebagai sekutu-sekutu Allah yang berhak disembah. Hubungan kalian benar-benar terputus. Dan kalian telah kehilangan anggapan kalian bahwa mereka dapat menolong kalian dan mereka adalah sekutu-sekutu Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. kalian telah datang kepada Kami pada hari kiamat untuk menjalani hisab satu persatu, sebagaimana kalian Kami ciptakan di dunia pertama kali, yaitu dalam keadaan tanpa alas kaki, tanpa pakaian, dan belum dikhitan; dan kalian sama sekali tidak memiliki harta, keturunan, atau pengikut, karena itu semua telah kalian tinggalkan di dunia; dan kami tidak melihat berhala-berhala yang kalian jadikan sebagai tuhan itu bersama kalian, padahal kalian mengatakan bahwa mereka adalah pemberi syafaat di sisi Allah bagi kalian pada hari kiamat. Pada hari ini telah terputus dalam hubungan dan terpecah belah golongan kalian. Apa yang kalian akui dan percayai dahulu merupakan kedustaan kalian sehingga pada hari ini telah jelas bahwa Kalian adalah orang-orang yang merugi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. وَلَقَدْ جِئْتُمُونَا فُرٰدَىٰ (Dan sesungguhnya kamu datang kepada Kami sendiri-sendiri) Yakni satu persatu. Setiap orang terpisah dari keluarga, harta, penolong, dan apa yang mereka sembah selain Allah; ia tidak mendapat manfaat sedikitpun dari mereka. كَمَا خَلَقْنٰكُمْ أَوَّلَ مَرَّةٍ (sebagaimana kamu Kami ciptakan pada mulanya) Yakni sebagaimana keadaan kalian ketika baru keluar dari perut ibu kalian, telanjang dan belum disunat. وَتَرَكْتُم مَّا خَوَّلْنٰكُمْ (dan kamu tinggalkan apa yang telah Kami karuniakan kepadamu) Yakni yang Kami berikan kepada kalian. Makna (الخول) adalah kenikmatan dunia yang diberikan Allah kepada manusia, namun tidak mereka bawa atau manfaatkan sedikitpun. وَمَا نَرَىٰ مَعَكُمْ شُفَعَآءَكُمُ (dan Kami tiada melihat besertamu pemberi syafa’at) Yakni dari orang-orang yang kalian sembah dan yang kalian katakan dalam hal ini: “kami tidak menyembah mereka kecuali agar dapat mendekatkan kami kepada Allah sedekat-dekatnya”. Dan kalian anggap bahwa mereka itu sekutu-sekutu Allah yang berhak untuk diibadahi sebagaimana Allah berhak untuk diibadahi. لَقَد تَّقَطَّعَ بَيْنَكُمْ وَضَلَّ عَنكُم مَّا كُنتُمْ تَزْعُمُونَ (Sungguh telah terputuslah (pertalian) antara kamu dan telah lenyap daripada kamu apa yang dahulu kamu anggap) Yakni putuslah hubungan antara kalian dengan sekutu-sekutu tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94 Dikatakan kepada mereka di akhirat: sesungguhnya kamu datang kepada Kami sendiri-sendiri untuk dihisab sebagaimana kamu Kami ciptakan pada awal mula kali saat kalian lahir telanjang. Kamu tinggalkan dunia berupa harta dan lainnya. Kami tidak melihat pemberi syafa’at yang kamu anggap bahwa mereka itu sekutu-sekutu Tuhan di antara kamu itu ,menyertaimu. Sungguh telah terputuslah pertalian di antara kalian, yaitu kalian dengan sesembahan kalian. Telah lenyap dan pergi sesembahan berhala yang dahulu kalian anggap sebagai sekutu Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh kalian benar-benar datang kepada Kami sendiri-sendiri} sendiri-sendiri {sebagaimana Kami menciptakan kalian pada mulanya. Kalian sudah meninggalkan apa yang Kmi berikan} Kami berikan {di belakang} di belakang punggung kalian. Kami tidak melihat bersama kalian para pemberi syafaat kalian yang kalian anggap sebagai sekutu-sekutu(Ku). Sungguh telah terputus antara kalian}telah putus hubungan antara kalian {dan telah lenyap} telah hilang {dari kalian apa yang dahulu kalian sangka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Ini adalah keadaan mereka di alam Barzakh. Adapun pada Hari Kiamat, maka mereka menghadirinya dalam keadaan tidak membawa apa-apa, sendiri-sendiri tanpa keluarga, tanpa harta, tanpa anak, tanpa tentara dan penolong sebagaimana keadaannya saat pertama kali diciptakan oleh Allah, ia telanjang dari setelah itu dengan sebab-sebabnya, dan pada hari itu segala perkara yang berhubungan dengan hamba di dunia terputus kecuali amal baik dan amal buruk yang menjadi bahan rumah akhirat yang tumbuh darinya. Kebaikan, keburukan, kebahagiaan, kesedihan, azab dan nikmatnya adalah berdasarkan amal. Maka Amal-lah yang bermanfaat atau bermudarat, menyedihkan atau membahagiakan, sedang selain itu berupa keluarga, anak, harta dan penolong, maka semua itu adalah faktor luar, dan semua itu tidak termasuk kriteria. Oleh karena itu Allah berfirman, “Dan sungguh kamu datang kepada Kami sendiri-sendiri sebagaimana Kami menciptakanmu pada mulanya, dan kamu tinggalkan apa yang telah Kami karuniakan kepadamu,” yakni, yang Kami berikan sebagai nikmat kepadamu, “di belakangmu,” karena ia tidak berguna apa pun untukmu. “Dan Kami tiada melihat besertamu pemberi syafaat yang kamu anggap bahwa mereka itu sekutu-sekutu Tuhan di antara kamu.” Orang-orang musyrik menyekutukan Allah, mereka menyembah para malaikat, para Nabi, orang-orang shalih, dan lain-lain bersamaNya, padahal mereka semua adalah milik Allah, akan tetapi mereka memberikan bagian dari diri mereka kepada makhluk-makhluk ini dan melakukan kesyirikan dalam beribadah. Ini adalah klaim batil dan kezhaliman dari mereka, karena semuanya adalah hamba Allah, Allah adalah Maharaja yang berhak mereka sembah. Kesyirikan mereka dalam ibadah dengan memberikannya kepada para hamba adalah mengangkat mereka menduduki posisi pencipta dan pemilik. Maka pada Hari Kiamat mereka dicela dan dikatakan kepada mereka ucapan ini, “Dan Kami tiada melihat besertamu pemberi syafaat yang kamu anggap bahwa mereka itu sekutu-sekutu TUhan di antara kamu, sungguh terputuslah pertalian antara kamu.” Maksudnya, terputuslah hubungan dan ikatan antara kamu dengan sekutu-sekutumu dalam bentuk syafaat dan lain-lain. Ia tidak bermanfaat dan tidak berguna apa pun. “Dan telah lenyap darimu sesuatu yang dahulu kamu berdusta dengannya (di dunia),” berupa keuntungan, keamanan, kebahagiaan, dan keselamatan yang dihiasi dan dijadikan indah oleh setan dalam hatimu, dan lisanmu mengucapkan itu. Kamu terkecoh dengan klaim batil yang tidak ada hakikatnya pada waktu terbuktinya lawan dari klaimmu, dan ternyata kamu adalah orang yang merugi pada diri, harta, dan jiwamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 94: Akan dikatakan kepada mereka saat mereka dibangkitkan. Tanpa membawa anak, istri dan harta selain amalan. Dalam keadaan tidak beralas kaki, telanjang dan belum dikhitan. Berupa harta. Kata-kata ini diucapkan sebagai sindiran terhadap mereka. Seperti patung, berhala, malaikat, para nabi dan para wali yang mereka anggap sebagai sekutu bagi Allah. Berupa keberuntungan, keamanan serta kebahagiaan yang disangka akan mereka peroleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 94",
    "description": "Setelah menjelaskan keadaan para pendurhaka ketika menghadapi tekanan sakratulmaut, ayat ini menjelaskan tentang keadaan mereka setelah roh terpisah dari jasad mereka. Dan kamu, setelah dicabut rohmu dan sekian lama menunggu di alam barzakh, akan benar-benar datang sendiri-sendiri kepada kami sebagaimana kami ciptakan kamu pada mulanya, yakni ketika lahir ke dunia, dan apa yang telah kami karuniakan kepadamu seperti harta benda, anak, kerabat, dan lainnya, kamu tinggalkan di belakangmu di dunia. Kami tidak melihat pemberi syafaat, yakni pertolongan, besertamu yang dulu kamu sembah dan yang kamu anggap bahwa mereka itu sekutu-sekutu bagi Allah. Sungguh, telah terputuslah semua pertalian antara kamu dan telah lenyap dari kamu apa yang dahulu kamu sangka sebagai sekutu Allah. Setelah menguraikan aneka argumentasi keesaan Allah dalam ayat sebelumnya, ayat berikut ini menjelaskan kembali bukti keesaan Allah melalui argumen yang berbeda. Sungguh, Allah yang menumbuhkan butir tumbuh-tumbuhan, padi-padian, dan biji kurma serta buah-buahan lainnya. Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup. Itulah bukti kekuasaan Allah, maka mengapa kamu masih berpaling'"
  }
]