[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah membelah butir-butir tumbuhan dan kemudian mengeluarkan darinya tanaman, dan membelah biji buah-buahan dan lalu menumbuhkan pepohonan darinya. Dia mengeluarkan yang hidup dari yang mati, seperti manusia dan binatang yang tumbuh dari air mani, dan mengeluarkan yang mati dari yang hidup, seperti air mani dari manusia dan binatang. Yang mengeluarkan demikian adalah Allah. Maksudnya, yang melakukannya adalah Allah semata, tiada sekutu bagiNya, yang berhak untuk diibadahi. Maka sebagaimana kalian bisa dipalingkan dari kebenaran menuju kebatilan, sehingga kalian menyembah bersama Allah yang selainNya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Sesungguhnya hanya Allah lah yang dapat membelah biji-bijian kemudian mengeluarkan tanam-tanaman darinya. Dia pulalah yang membelah biji kurma kemudian mengeluarkan pohon kurma darinya. Dia mengeluarkan makhluk hidup dari makhluk mati. Karena Dia mengeluarkan manusia dan hewan-hewan lainnya dari sperma. Dan Dia juga mengeluarkan makhluk mati dari makhluk hidup. Karena Dia mengeluarkan sperma dari manusia dan mengeluarkan telur dari ayam. Yang melakukan itu semua adalah Allah yang telah menciptakan kalian. Bagaimana mungkin kalian -wahai orang-orang musyrik- berpaling dari kebenaran, sedangkan kalian menyaksikan sebagian dari keajaiban ciptaan-Nya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Dalam ayat ini dimulai perpindahan pembahasan dari penegasan tentang keesaan Allah, hari kebangkitan, dan pengutusan para rasul, menuju pembahasan tentang dalil-dalil mengenai kehebatan penciptaan Allah yang dapat dilihat. Hal ini untuk menjelaskan dalil-dalil dan bukti-bukti yang ada di alam semesta yang menunjukkan kekuasaan Allah, dan untuk menarik perhatian manusia menuju kenikmatan-kenikmatan besar yang telah Allah siapkan baginya di alam semesta ini. Allah menegaskan hal ini dengan jumlah ismiyah yang berfungsi untuk menjelaskan ketetapan dan konsistensi sifat-Nya dengan berfirman: Sesungguhnya Allah yang menumbuhkan bulir tumbuh-tumbuhan seperti gandum, sehingga mengeluarkan tumbuhan; dan menumbuhkan biji buah-buahan sehingga mengeluarkan pohon. Dalam penciptaan dua tanaman ini dan lainnya nampaklah keagungan Allah. Dia mengeluarkan makhluk hidup dari sesuatu yang mati, seperti penciptaan manusia dan hewan dari air mani; dan mengeluarkan suatu yang mati dari makhluk hidup, seperti penciptaan air mani dari manusia dan hewan. Jika Allah memiliki sifat-sifat ini maka Dia berhak untuk disembah dan diesakan, lalu Mengapa kalian menyembah selain Allah? Pengungkapan kalimat (يخرج الحي من الميت) menggunakan jumlah fi'liyah untuk menunjukkan bahwa perbuatan ini senantiasa terulang di setiap waktu; dan penggunaan ini merupakan sesuatu yang memiliki maksud bukan suatu hal yang kebetulan. Adapun pengungkapan kalimat (ومخرج الميت من الحي) menggunakan jumlah ismiyah untuk menunjukkan bahwa perbuatan ini tetap dan konsisten. Sehingga dengan penggunaan jumlah fi'liyah dan ismiyah pada dua kalimat tersebut menunjukkan bahwa perbuatan itu selalu terulang dan tetap, yakni selalu dilakukan dan sudah menjadi sifat Dzat-Nya. Hal ini karena kedua perbuatan tersebut memiliki kedudukan yang sama. Dan pertanyaan yang ada pada akhir ayat ini untuk menunjukkan keheranan dan pengingkaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. إِنَّ اللهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ ۖ (Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan) Yakni yang membelah biji-bijian agar keluar darinya tumbuhan, dan membelah biji kurma sehingga keluar darinya pohon kurma. Kata (النوى) adalah bentuk jamak dari kata (النواة), kata ini dipakai untuk penyebutan segala buah-buahan berbiji keras seperti buah kurma, apricot, dan prem. يُخْرِجُ الْحَىَّ مِنَ الْمَيِّتِ (Dia mengeluarkan yang hidup dari yang mati) Yakni mengeluarkan hewan-hewan dari sperma dan telur yang keduanya merupakan makhluk mati. وَمُخْرِجُ الْمَيِّتِ مِنَ الْحَىِّ ۚ( dan mengeluarkan yang mati dari yang hidup) Dan mengeluarkan sperma dan telur yang keduanya merupakan makhluk mati dari makhluk hidup. Atau maknanya adalah mengeluarkan orang beriman dari orang kafir lewat kelahiran keturunan mereka dan mengeluarkan orang kafir dari orang mukmin demikian pula. ذٰلِكُمُ اللهُ ۖ( demikian ialah Allah) Yakni yang melakukan hal menakjubkan tersebut adalah Allah. فَأَنَّىٰ تُؤْفَكُونَ (maka mengapa kamu masih berpaling?) Yakni bagaimana kalian berpaling dari kebenaran setelah melihat keluarbiasaan ciptaan-Nya dan kesempurnaan kuasa-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "95-96 { إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ } \"Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan\", { فَالِقُ الْإِصْبَاحِ وَجَعَلَ اللَّيْلَ سَكَنًا } \"Dia menyingsingkan pagi dan menjadikan malam untuk beristirahat\" az-Zujaj berkata : \"jika kita memperhatikan alam semesta ini, akan jelas bagi kita bahwasanya sebagian besar darinya terbentuk dengan pembelahan : seperti bumi yang terbelah dengan tumubuh-tumbuhan, dan awan yang terbelah dengan hujan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Sesungguhnya Allah adalah Dzat yang meretakkan (membelah) biji sehingga mengeluarkan tumbuhan, dan biji buah sehingga mengeluarkan pohon. Tanaman hidup tumbuh dari biji kering yang berasal dari tanaman hidup, dan telur itu berasal dari hewan. Orang mukmin juga bisa keluar dari orang kafir melalui kelahiran, begitu juga orang kafir bisa keluar dengan orang mukmin (dengan ingkar). Sang pembuat ciptaan yang menakjubkan itu hanyalah Allah, lalu bagaimana bisa kalian malah berpaling dari kebenaran (yang bisa dilakukan) dengan menyembah Allah sang Pencipta segala sesuatu, dan malah menyembah sesuatu yang tidak memberi mudharat dan manfaat?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah yang menumbuhkan} membelah {butir dan biji. Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup. Itulah Allah. Maka bagaimana bisa kalian dipalingkan} bagaimana bisa kalian dipalingkan dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Allah menyampaikan tentang kesempurnaanNya, keagungan kekuasaanNya, potensi kekuatanNya, keluasan rahmatNya, kemurahanNya yang universal dan perhatianNya yang mendalam kepada makhlukNya. Dia berfirman, “Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan.” Mencakup seluruh biji-bijian yang ditanam oleh manusia dan yang tidak mereka tanam seperti biji-bijian yang Allah tebarkan di tanah-tanah yang sepi lagi kosong. Biji-bijian itu tumbuh menjadi tanaman-tanaman yang bermacam-macam, serta berbeda-beda bentuk dan kegunaannya. Allah juga menumbuhkan biji-bijian dari pohon, berupa pohon kurma, buah-buahan, dan lain-lain, maka makhluk Allah seperti manusia, ternak, dan binatang memanfaatkannya. Mereka menikmati apa yang telah ditumbuhkan dari butir dan biji-bijian itu, mereka menjadikannya sebagai bahan makanan dan mengambil manfaat dengan berbagai macam pemanfaatan yang Allah jadikan padanya. Allah menunjukkan kepada mereka kebaikan dan kemurahanNya yang mengagumkan akal dan menakjubkan orang-orang yang berakal cemerlang. Dia menunjukan kepada mereka keunikan penciptaaNya dan kesempurnaan hikmahNya kepada mereka di mana denganNya mereka mengenalNya, mentauhidkanNya, menyadari bahwa dia-lah yang Mahabenar dan bahwa penghambaan selain kepadanya adalah bathil. “Dia mengeluarkan yang hidup dari yang mati,” sebagaimana mereka mengeluarkan hewan dari air mani, anak ayam dari telur, dan tanaman serta tumbuh-tumbuhan dari biji-bijian. “dan mengeluarkan yang mati,” yang tidak tumbuh atau tidak bernyawa “dari yang hidup” sebagaimana dia mengeluarkan biji-bijian dari tanaman dan tumbuh-tumbuhan dan dia mengeluarkan burung dan sebagianya. “yang memiliki sifat-sifat demikian,” maksudnya, melakukan apa yang di lakukan dan bersendirian dalam penciptaan dan pengaturan segala sesuatu “Ialah Allah TuhanMu.”pemilik hak uluhiyyah dan ibadah seluruh makhluk, dia-lah yang menumbuhkan dengan kemuruhanNya. “Maka kenapa kamu masih berpaling?” Maksdunya, mengapa kamu berpaling dan menolak ibadah dari dzat yang keadaanNya adalah demikian, dengan berpaling menuju ibadah kepada sesuatu yang tidak bermanfaat, mudarat dan tidak memiliki hak mematikan, menghidupkan, dan membangkitkan darinya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 95: Dalam ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala menerangkan tentang kesempurnaan-Nya, besarnya kekuasaan-Nya, kuatnya kemampuan-Nya, luasnya rahmat dan kepemurahan-Nya, dan besarnya perhatian-Nya terhadap makhluk-Nya. Daripadanya manusia, hewan ternak dan hewan lainnya memperoleh manfaat yang banyak. Allah memperlihatkan kepada mereka kepemurahan-Nya, indahnya ciptaan-Nya dan sempurna hikmah-Nya, di mana dengannya mereka dapat mengenal Allah, mentauhidkan-Nya dan mengetahui bahwa Dia-lah Tuhan yang berhak disembah, dan bahwa menyembah selain-Nya adalah batil. Seperti manusia dari air mani, burung dari sebutir telur, dan tumbuhan dari biji. Seperti keluarnya air mani dari manusia dan telur dari seekor burung. Dari beriman dan beribadah hanya kepada-Nya padahal telah tegak hujjah, bahwa selain-Nya tidak berkuasa apa-apa, tidak mampu memberi manfaat dan menimpakan bahaya, tidak mampu mematikan, menghidupkan, apalagi membangkitkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 95",
    "description": "Setelah menguraikan aneka argumentasi keesaan Allah dalam ayat sebelumnya, ayat berikut ini menjelaskan kembali bukti keesaan Allah melalui argumen yang berbeda. Sungguh, Allah yang menumbuhkan butir tumbuh-tumbuhan, padi-padian, dan biji kurma serta buah-buahan lainnya. Dia mengeluarkan yang hidup dari yang mati dan mengeluarkan yang mati dari yang hidup. Itulah bukti kekuasaan Allah, maka mengapa kamu masih berpaling' setelah menjelaskan kekuasaan-Nya terhadap sesuatu yang bersifat material dan berada di bumi, kini dijelaskan tentang benda-benda langit. Dia menyingsingkan pagi agar aneka makhluk dapat melakukan berbagai aktivitas, dan menjadikan malam untuk beristirahat, dan menjadikan matahari dan bulan beredar dengan ketelitian yang amat mengagumkan yang berguna sebagai dasar untuk perhitungan bulan dan tahun. Itulah ketetapan Allah yang mahaperkasa, maha mengetah."
  }
]