[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah , Dial ah yang membelah cahaya pagi dari kegelapan malam, dan menjadikan malam menjadi masa istirahat di mana tiap-tiap yang bergerak yang berdiam diri dan tenang pada waktu tersebut mengambil bagian waktu istirahatnya. Dan Dia menjadikan matahari dan bulan berjalan pada porosnya dengan dasar perhitungan yang sangat rapi lagi telah ditentukan. Perhitungan yang tidak berubah-ubah dan tidak berantakan. Itu adalah ketentuan Dzat yang Maha perkasa yang sangat kokoh kerajaanNya, Maha mengetahui segenap kemaslahatan makhlukNya dan pengaturan urusan-urusan mereka. Al-Aziz dan Al-Alim termasuk nama Allah yang paling baik yang menunjukan kesempurnaan keperkasaan dan ilmuNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Dan Dia pulalah yang membelah cahaya pagi dari gelapnya malam. Dia lah yang menjadikan malam sebagai waktu istirahat yang manusia berhenti melakukan kesibukan mencari rezeki untuk beristirahat dari penatnya kerja di siang hari. Dan Dia lah yang menjadikan matahari dan bulan berjalan menurut perhitungan yang telah Dia tetapkan. Keajaiban ciptaan tersebut merupakan ketentuan yang dibuat oleh Rabb Yang Maha Perkasa yang tidak terkalahkan oleh siapa pun lagi Maha Mengetahui apa yang terbaik bagi makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Kemudian Allah menjelaskan dengan ayat yang lain dalil-dalil yang menunjukkan kekuasaan-Nya. Allah yang menyingkap cahaya pagi dari kegelapan malam, menjadikan malam sebagai waktu istirahat bagi makhluk hidup setelah lelah beraktivitas di siang hari dan sebagai penenang jiwa dan raga mereka. Dan menjadikan matahari dan bulan beredar dengan perhitungan agar manusia dapat mengetahui waktu darinya, seperti mengetahui waktu melaksanakan ibadah dan pekerjaan dan waktu menunaikan kewajiban; ini merupakan perhitungan dari Allah Yang Maha Kuasa dan Maha Bijaksana dalam mengatur maslahat makhluk-makhluk-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. فَالِقُ الْإِصْبَاحِ (Dia menyingsingkan pagi) Yakni yang membelah kegelapan pagi. Yakni yang menyingsing sisa-sisa kegelapan malam dengan kecerahan siang. وَجَعَلَ الَّيْلَ سَكَنًا (dan menjadikan malam untuk beristirat) Yakni agar manusia dapat menentramkan diri dari kegiatan mencari penghidupan (mata pencaharian) mereka, dan beristirahat dari kelelahan dan keletihan. وَالشَّمْسَ وَالْقَمَرَ حُسْبَانًا ۚ (dan (menjadikan) matahari dan bulan untuk perhitungan) Yakni menjadikan keduanya untuk objek perhitungan hari, yang berhubungan dengan maslahat manusia, karena peredarannya telah terukur, tidak bertambah setelah berlalunya masa yang panjang dan tidak berkurang. Hal itu dijadikan agar menjadi penunjuk hamba-hamba-Nya pada besarnya kekuasaan-Nya dan hebatnya penciptaan-Nya. ذٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ (Itulah ketentuan Allah Yang Maha Perkasa lagi Maha Mengetahui) Dan termasuk dari pengetahuannya adalah menjadikan peredaran matahari dan bulan dengan pengaturan yang sedemikian teratur."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "95-96 { إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ } \"Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan\", { فَالِقُ الْإِصْبَاحِ وَجَعَلَ اللَّيْلَ سَكَنًا } \"Dia menyingsingkan pagi dan menjadikan malam untuk beristirahat\" az-Zujaj berkata : \"jika kita memperhatikan alam semesta ini, akan jelas bagi kita bahwasanya sebagian besar darinya terbentuk dengan pembelahan : seperti bumi yang terbelah dengan tumubuh-tumbuhan, dan awan yang terbelah dengan hujan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Allah jugalah Dzat yang menyingsingkan kegelapan pagidengan cahaya siang, dan membuat malam sebagai tempat untuk beristirahat, dimana manusia berhenti dari aktifitas dan hal yang melelahkan. Dia juga membuat matahari dan bulan sebagai tempat (atau media) untuk menghitung waktu, yang mana hal itu sangat berhubungan dengan kebaikan para hamba. Sistem yang telah disebutkan itu adalah kekuasaan Dzat yang Maha Kuat di kerajanNya, dan Dzat yang Maha Mengetahui ciptaanNya, sehingga Dia membuat aturan yang penuh hikmah ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dzat yang menyingsingkan pagi} memecah kegelapan malam dengan cahaya {dan menjadikan malam untuk beristirahat, serta matahari dan bulan untuk perhitungan} untuk melakukan perhitunagn yang ditentukan {Itulah ketetapan Allah Yang Maha perkasa lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. dan ketika Allah menyebutkan bahan penciptaan makanan pokok, mana dia juga menyebutkan nikmatNya dengan menyediakan tempat tinggal, dan dia menciptakan cahaya dan kegelapan yang di butuhkan oleh hamba dan manfaat serta maslahatnya. Dia berfirman, “dia menyisingkan pagi,” sebagiamana dia menumbuhkan biji-bijian, maka dia juga membelah kegelapan malam yang menyelimuti permukaan bumi dengan cahay pagi yang melenyapkanNya sedikit demi sedikit cahaya yang menyebar. Dengan pengganti masa tersebut, manusia beraktifitas dalam maslahat dan kehidupan, dan dalam kemanfaatan agama dan dunia mereka. Ketika manusia membutuhkan ketenangan dan ketentraman, serta istirahat yang tidak terjadi kecuali adanya siang dan cahaya, maka “Dia menjadikan” malam untuk beristirahat. Manusia beristirahat di rumah-rumah dan tempat tidur mereka di malam hari, ternak ke kangdangnya, burung ke sarangNya, maka masing-masing mengambil istirahatnya. Kemudian Allah menggangtikan dengan cahaya, dan begitulah seterusnya sampai Hari Kiamat. “Dan Allah” meenjadikan “matarhari dan bulan untuk perhitungan.” Dengan keduanya di ketahui waktu dan masa. Dengan itu waktu-waktu ibadah dan muamalah dipatok, lalu yang mana kalau bukan karena matahari, rembulan, dan pergantian kepada perintahkeduanya silih berganti, niscaya orang-orang tidak mengetahuinya hanyalah beberapa orang, itu pun setelah upaya yang keras yang karenanya ada kemaslahatan yang tidak tercapai. “Itulah ketentuan Allah Yang Maha Perkasa Lagi Maha Mengetahui.” Yang mana diantara keperkasaanNya tunduknya mahkluk yang besar ini, maka ia pun berjalan dengan tunduk dan patuh kepada perintahNya, yang mana ia tidak lemapui batasan yang diletakkan oleh Allah, tidak maju dan tidak mundur darinya. Dia Maha Mengetahui, di mana ilmuNya meliputi yang lahir, yang batin yang pertama dan yang terakhir. Di antara dalil aqli atas keluasan ilmuNya adalah pengendalian mahkluk-makhluk yang besar ini dengan tatanan dan aturan yang konkret yang mencenggangkan akal dalam kebaikan, kesempurnaan, dan kesesuaian dengan kemaslahatan dan hikmah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 96: Sehingga hari semakin terang, dan manusia dapat melakukan berbagai aktivitas. Ada pula yang mengartikan, bahwa matahari dan bulan beredar menurut perhitungan. Dengan matahari dan bulan dapat diketahui waktu, baik waktu beribadah maupun waktu bermu’amalah. Di mana dengan keperkasaan-Nya, semua makhluk tunduk kepada-Nya dan tidak berjalan melebihi batas yang Allah tetapkan. Ilmu-Nya meliputi yang nampak maupun yang tersembunyi, yang awal maupun yang akhir. Di antara dalil ‘aqli yang menunjukkan ilmu-Nya meliputi segala sesuatu adalah dengan diatur-Nya makhluk-makhluk yang besar dengan pengaturan yang indah, di mana hal ini membuat kita takjub karena begitu indahnya, begitu sempurnanya dan begitu sesuainya dengan maslahat dan hikmah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 96",
    "description": "Setelah menjelaskan kekuasaan-Nya terhadap sesuatu yang bersifat material dan berada di bumi, kini dijelaskan tentang benda-benda langit. Dia menyingsingkan pagi agar aneka makhluk dapat melakukan berbagai aktivitas, dan menjadikan malam untuk beristirahat, dan menjadikan matahari dan bulan beredar dengan ketelitian yang amat mengagumkan yang berguna sebagai dasar untuk perhitungan bulan dan tahun. Itulah ketetapan Allah yang mahaperkasa, maha mengetah fungsi matahari dan bulan telah diuraikan pada ayat di atas, selanjutnya fungsi bintang diuraikan pada ayat ini. Dan dialah Allah yang menjadikan bintang-bintang yang memancarkan cahaya bagimu, dengan tujuan antara lain agar kamu menjadikannya petunjuk arah dalam kegelapan di darat dan di laut. Kami telah menjelaskan secara rinci tanda-tanda kebesaran dan kekuasaan kami kepada orang-orang yang mengetahui."
  }
]