[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah Dialah yang menjadikan bintang-bintang bagi kalian (wahai sekalian manusia), sebagai petunjuk arah yang kalian dapat mengenali jalan-jalan pada malam hari melalui bintang-bintang tersebut, ketika kalian tersesat jalan akibat pekatnya kegelapan malam di darat maupun laut. Sesungguhnya kami telah menerangkan petunjuk-petunjuk yang sangat jelas agar ikut terdorong merenunginya orang-orang yang mengenal Allah dan RasulNya dan syariatNya dari kalangan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Dan Dia lah -Subḥānahu wa Ta'ālā- yang menciptakan untuk kalian -wahai anak-anak Adam- bintang-bintang di langit untuk kalian jadikan sebagai petunjuk dalam perjalanan apabila kalian merasakan kebimbangan dalam menentukan jalan yang hendak kalian ambil, baik di darat maupun di laut. Kami telah menjelaskan dalil-dalil dan bukti-bukti yang menunjukkan kekuasaan Kami bagi orang-orang yang mau merenungkannya kemudian mendapatkan manfaat darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Dan sebagian dari tanda-tanda kekuasaan Allah yang lain adalah menciptakan bintang-bintang di langit agar manusia dapat menggunakannya sebagai penunjuk arah pada kegelapan di darat maupun di laut, sehingga mereka dapat mengetahui jalan pada malam hari ketika mereka tersesat sehingga mereka tidak binasa. Ini merupakan kenikmatan yang Allah berikan bagi makhluk-Nya. Allah menjelaskan ayat-ayat yang dapat dipahami oleh orang-orang yang berilmu sehingga mereka mengetahui kekuasaan Allah yang besar di alam semesta."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. وَهُوَ الَّذِى جَعَلَ لَكُمُ النُّجُومَ لِتَهْتَدُوا۟ بِهَا (Dan Dialah yang menjadikan bintang-bintang bagimu, agar kamu menjadikannya petunjuk) Yakni Allah menciptakannya sebagai penunjuk jalan. فِى ظُلُمٰتِ (dalam kegelapan) Di malam hari saat perjalanan di laut atau darat. الْبَرِّ وَالْبَحْرِ ۗ (di darat dan di laut) Yakni ketika bingung menuntukan jalan yang tidak mungkin mendapat petunjuk kecuali dengan melihat gugusan bintang. Dan ini merupakan salah satu manfaat Allah menciptakan bintang-bintang ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Dialah Dzat yang menciptakan atau membuatkan bintang-bintang bagi kalian sebagai petunjuk jalan kalian dalam kegelapan malam, dan di seberang lautan ketika kalian ragu untuk menemukan jalan dari dua tempat itu. Sungguh Kami telah menerangkan ayat-ayat yang menunjukkan kepada kesempurnaan kuasa Kami bagi kaum yang mengetahui keagungannya, menyadari hakikatnya, dan dan meminta petunjuk menuju keberadaan, keesaan, ilmu, dan kuasa Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menjadikan} menciptakan {bagi kalian bintang-bintang agar kalian mendapat petunjuk dengan itu dalam kegelapan di darat dan di laut. Sungguh Kami telah merincikan} menerangkan {ayat-ayat kepada kaum yang mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. “Dan Dia-lah yang menjadikan bintang-bintang bagimu, agar kamu menjadikannNya petunjuk dalam kegelapan di darat dan laut.” Manakala jalan-jalana membingungkanmu, peniti jalan tidak mengetahui jalan mana yang diambil, maka Allah menadikan bintang-bintang sebagai petunjuk bagi manusia ke jalan yang harus mereka lalaui kepada kepentingan perniagaan dan perjalanan mereka. Dia antaranya adalah bintang-bintang tertentu yang selalu terlihat dan tetap di tempat, adapula yang selalu bergerak. Gerakannya diketahui oelh ahlinya, dan dengannya mereka mengetahui waktu dana rah. Ayat ini dan semisal dengannya menunjukan anjuran mempelajari gerakan dan orbit-orbitnya karena fungsi bintang sebagai petunjuk tidak tercapai kecuali dengan itu. “Sungguh kami telah menjelaskan tanda-tanda kebesaran kami,” maksudnya, kami telah menjelaskan dan menerangkannya, dan kami telah menjelaskan setiap jenis dan macamnya dengan selainnya yang mana tanda-tanda kebesaran Allah menjadu namapk dan jelas, “kepada orang-orang yang mengetahui,” maksudya, bagi ahli ilmu dan bagi ahli pengetahuan alam, karena merekalah yang di tuju oleh khitabullah (titah Allah), dan jawabanya di tuntut dari mereka. Hal Ini berbeda dengan kaum jahil dank eras kepala yang berpaling dari tanda kebesaran Allah dan berpaling dari ilmu yang di bawa oleh para Rasul, karena penjelasan tida bermanfaat bagi mereka sama sekali, pemerincian tidak akan menghilangkan kerancuan mereka, penerangan tidak akan membuka kesulitan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 97: Ketika safar. Hal itu, karena di antara bintang ada yang selalu terlhat dan tidak bergeser dari tempatnya, dan ada pula yang selalu bergerak, di mana pergerakannya diketahui oleh orang yang ahli dalam bidang ini. Dengannya mereka dapat mengetahui arah dan waktu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 97",
    "description": "Fungsi matahari dan bulan telah diuraikan pada ayat di atas, selanjutnya fungsi bintang diuraikan pada ayat ini. Dan dialah Allah yang menjadikan bintang-bintang yang memancarkan cahaya bagimu, dengan tujuan antara lain agar kamu menjadikannya petunjuk arah dalam kegelapan di darat dan di laut. Kami telah menjelaskan secara rinci tanda-tanda kebesaran dan kekuasaan kami kepada orang-orang yang mengetahuianeka makhluk telah diuraikan, baik yang berada di langit maupun di bumi, berikutnya dijelaskan kembali tentang makhluk yang paling dimuliakan Allah, yaitu manusia. Dan dialah yang menciptakan kamu, wahai umat manusia, dari diri yang satu, yakni adam, yang melalui istrinya kamu berkembang biak, maka bagimu ada tempat menetap dan juga tempat simpanan. Sesungguhnya telah kami jelaskan dengan aneka macam cara dan tanda-tanda kebesaran kami kepada orang-orang yang mengetahui."
  }
]