[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah Dia lah yang menurunkan hujan dari langit, lalu Dia mengeluarkan dari hujan itu berbagai macam tumbuhan. Kemudian menumbuhkan dari tetumbuhan tetsebut tanaman dan pepohonan yang menghijau, dan mengelurkan dari tanaman itu biji-bijian yang tersusun satu sama lain, seperti bulir biji gandum, jewawut dan padi. Dan Dia mengeluarkan dari mayang kurma, (yaitu tempat tumbuhnya bakal tandan kurma muda), tangkai-tangkai kurma yang mudah di jangkau tangan. Dia menumbuhkan kebun-kebun angggur. Dia mengeluarkan pohon zaitun dan delima yang serupa daunnya, namun berbeda buahnya dalam bentuk, rasa, dan karakter. Maka lihatlah olehmu Wahai sekalian manusia, buah-buahan pohon-pohon tersebut ketika tanaman itu berbuah, serta mengkal dan masaknya ketika tiba waktunya. Sesungguhnya dalam perkara tersebut (wahai sekalian manusia), terdapat berbagai petunjuk tentang kesempurnaan kekuasaan Dzat penciptanya, hikmah dan rahmatNya bagi kaum yang beriman kepaad Allah dan melaksanakan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Dan Dia lah -Subḥānahu wa Ta'ālā- yang menurunkan air hujan dari langit. Kemudian dengan air hujan itu Dia menumbuhkan segala jenis tanaman. Lalu dari tumbuh-tumbuhan itu Kami keluarkan tanam-tanaman dan pepohonan yang hijau. Dan darinya Kami keluarkan biji-bijian yang bertumpuk-tumpuk, seperti yang terjadi pada bulir-bulir (gandum dan sejenisnya). Dan dari mayang kurma muncul tangkai-tangkai yang dekat sehingga dapat diraih oleh orang yang berdiri maupun orang yang duduk. Kami pun mengeluarkan kebun-kebun anggur. Dan Kami juga mengeluarkan pohon zaitun dan pohon delima yang memiliki kemiripan dalam bentuk daunnya tetapi buahnya berbeda. Perhatikanlah -wahai manusia- bagaimana kondisi buahnya pada awal kemunculannya dan bagaimana kondisinya ketika buahnya telah matang. Sesungguhnya di situ terdapat petunjuk yang nyata mengenai kekuasaan Allah bagi orang-orang yang percaya kepada-Nya. Karena merekalah yang bisa mendapatkan manfaat dari petunjuk-petunjuk dan bukti-bukti semacam itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Dan termasuk tanda-tanda kekuasaan Allah, Dia menurunkan air dari langit untuk menumbuhkan tanaman-tanaman yang beraneka ragam, menumbuhkan tumbuhan dan pepohonan yang hijau, dan mengeluarkan dari tumbuhan-tumbuhan itu biji-bijian yang bersusun pada tangkainya seperti gandum. Mengeluarkan dari pohon kurma tandan yang menjulang rendah ke bawah sehingga mudah untuk dipetik. Dan Allah menumbuhkan pohon-pohon anggur, zaitun, dan delima yang masing-masing jenisnya memiliki daun yang mirip namun buahnya mempunyai rasa yang berbeda-beda. Allah memberi kepuasan bagi seluruh perasaan yang ada pada jiwa manusia, karena jiwa tidak hanya memiliki rasa lapar dan haus saja, namun juga terdapat rasa dan indra yang lain, dan setiap indra memiliki kepuasannya masing-masing; oleh sebab itu Allah berfirman: \"Hai manusia, lihat dan renungkan pohon itu berbuah dan matang.\" Hal ini untuk memberi kepuasan bagi kedua mata dengan pemandangan yang indah. Ini merupakan dalil-dalil dan bukti-bukti yang menunjukkan wujud Allah Yang Maha Kuasa dan Bijaksana yang hanya dapat dipahami dan diyakini oleh orang-orang yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَهُوَ الَّذِىٓ أَنزَلَ مِنَ السَّمَآءِ مَآءً (Dan Dialah yang menurunkan air hujan dari langit) Yakni air hujan. فَأَخْرَجْنَا بِهِۦ نَبَاتَ كُلِّ شَىْءٍ (lalu Kami tumbuhkan dengan air itu segala macam tumbuh-tumbuhan) Yakni seluruh jenis tumbuhan yang berbeda-beda. فَأَخْرَجْنَا مِنْهُ خَضِرًا (maka Kami keluarkan dari tumbuh-tumbuhan itu tanaman yang menghijau) Yakni berwarna hijau. Dan makna (الخصر) yakni sayuran segar. نُّخْرِجُ مِنْهُ حَبًّا مُّتَرَاكِبًا (Kami keluarkan dari tanaman yang menghijau itu butir yang banyak) Yakni butir yang bertumpuk-tumpuk seperti yang terdapat pada tangkai/malai biji-bijian. وَمِنَ النَّخْلِ مِن طَلْعِهَا قِنْوَانٌ دَانِيَةٌ (dan dari mayang korma mengurai tangkai-tangkai yang menjulai) Yakni keluar dari mayang kurma tandan-tandannya dengan perintah Allah. Dan makna (الدانية) yakni yang menjulang kebawah sampai dapat dijangkau orang yang berdiri atau duduk. Seorang ulama bernama az-Zajjaaj berkata: makna dari ayat ini adalah bahwa ada tangkai yang panjang hingga menjulang rendah dan ada pula tangkai yang pendek, namun tidak tersebutkan. وَالزَّيْتُونَ وَالرُّمَّانَ مُشْتَبِهًا وَغَيْرَ مُتَشٰبِهٍ (dan (Kami keluarkan pula) zaitun dan delima yang serupa dan yang tidak serupa) Yakni yang serupa dalam hal ukuran dan warnanya namun tidak serupa dalam hal rasa. Kemudian Allah memerintahkan untuk melihat dengan penuh pengamatan kepada buahnya ketika berbuah dan ketika tiba masa panennya, yakni ketika telah matang dan telah sesuai sekali dengan postur mereka. إِنَّ فِى ذٰلِكُمْ (Sesungguhnya pada yang demikian itu) Yang telah disebutkan sebelumnya secara garis besar dan secara terperinci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Allah adalah Dzat yang menurunkan hujan dari awan, lalu Dia mengeluarkan macam-macam tumbuhan yang berbeda di bumi. Dia mengeluarkan tumbuhan yang hijau dan segar, yang mana dari sebagian tumbuhan itu keluarlah biji yang tersusun satu sama lain seperti tangkai, dan dari mayang kurma (hal pertama yang tumbuh dari kurma) tangkai-tangkai yang hampir bisa diambil orang yang berdiri dan yang didik. Dia menumbuhkan kebun-kebun anggur, zaitun, dan delima yang ukuran dan warnanya hampir serupa, namun rasanya tidak serupa. Perhatikanlah buahnya saat tumbuhan itu berbuah, begitu juga perkembangannya, yang mana sesuai dengan dengan bentuknya. Sesungguhnya dalam sesuatu yang telah disebutkan itu terdapat dalil-dalil atas kesempurnaan kuasa sang Khaliq bagi kaum yang mengimani keberadaan dan kuasa Allah. Mereka itulah otang-orang yang mengambil manfaat dari suatu petunjuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah yang menurunkan air dari langit lalu dengannya Kami menumbuhkan segala macam tumbuhan. lalu darinya Kami mengeluarkan} tanaman {yang menghijau} tanaman dan pepohonan yang hijau {Darinya Kami mengeluarkan butir yang bertumpuk} saling bertumpuk satu sama lain seperti tangkai-tangkai {dan dari mayang kurma tangkai-tangkai} tangkai-tangkai {yang menjuntai} yang dekat, sehingga bisa dijangkau orang yang berdiri dan orang yang duduk {kebun-kebun anggur. zaitun dan delima yang serupa} yang serupa daunnya {dan yang tidak serupa} berbeda buahnya {Perhatikanlah buahnya ketika berbuah dan menjadi masak} matang {Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi kaum yang beriman."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Ini adalah salah satu nikmatnya yang besar yang di perlukan oleh manusia dan yang lainya yaitu bahwa Allah menurunkan air dari langit yang datang silih berganti disaat orang-orang memerlukannya. Lalu Allah menumbuhkan segala sesuatu yang dikarunia Allah, hidup lapang dengan rizkiNya, dan bersuka cita dengan kebaikanNya. Kekeringan,kekurangan dan penceklik lenyap dari mereka. Hati berbunga-bunga, wajah berseri-seri, para hamba meraih rahmat Allah Yang Maha Pengasih lagi Maha Peyayang berupa sesuatu yang denganya mereka merasakan nikmat dan suka cita. Hal itu mengharuskan mereka mengeluarkan upaya untuk mensyukuri Dzat yang telah menurunkan nikmat-nikmat, dengan menyembahnya, kembali kepadaNya, dan mecintaiNya. Dan ketika Dia menyebutkan bermacam pohon dan tumbuh yang ditumbuhkan oleh air, dia menyebutkan tanaman pangan dan pohon kurma karena manfaatnya sangat banyak, dan dia sebagai makanan pokok bagi manusia. Dia berfirman, “maka kami keluarkan dari tumbuh-tumbuhan itu tanaman yang menghujau, kami keluarkan darinya,” maksdunya, dari tanaman yang hijau itu, “butir yang banyak,” sebagian di atas sebagian yang lain, berupa gandum, jewawut , pedi, dan tanaman-tanaman pangan yang lainya. Dan dari penjelasan ini menunjukan bahwa butirnya bermacam-macam. Semuanya berasal dari bahan yang satu yang tidak bercampur aduk. Bahkan ia merupakan butir-butir yang terpisah-pisah dari pasal yang satu, dan ia juga menunjukan kepada banyaknya dan keluasan hasil produknya, agar asal bijinya tetap ada sementara sisa dan jumlah yang besar dimakan dan disimpan. “Dan dari pohon kurma,” Allah mengeluarkan “dari mayangnya,” yaitu jangjang dang mangar sebelum tangkai-tangkai yang menjual itu muncul , maka dari jangjang tersebut “terurai tangkai-tangkai yang menjulai.” Maksudnya, tangkai yang dekat, mudah diambil, merunduk kepada orang yang ingin memetiknya tanpa kesulitan. Walaupun ia panjang, namun padanya terdapat pelepah dan tatakan yang memudahkan untuk memanjatnya. “Dan,” dengan air itu Allah mengeluarkan “kebun-kebun anggur, dan Kamu keluarkan pula Zaitun dan Delima.” Ini termasuk pohon yang besar dan banyak manfaat dan kegunaanNya. Oleh karena itu, Allah menyebutkan secara khusus setelah menyebutkan pohon dan tumbuhan secara umum. FirmanNya, “Yang serupa dan yang tidak serupa.” Ada kemungkinan dia kembali kepada delima dan zaitun, yakni serupa pohon dan duanNya namun tidak serupa buahnya. Ada kemungkinan lain, ia kembali kepada semua pohon dan buah-buahan. Sebagian lainya mirip dengan sebagian yang lainya dan ciri-cirinya tidak jauh berbeda, dan sebagian yang lain benar-benat berbeda. Dari itu semua manusia mengambil manfaat, menitmati buah-buahan dan menjadikannya bahan makanan dan mereka juga bisa mengambil pelajaran. Oleh karena itu Allah memerintahkan agar mengambil pelajaran darinya. Dia berfirman, “perhatikanlah,” buah seluruh pohon khsususnya kurma, “diwaktu pohonnya berbuah dan perhatikan pula kematangannya.” Maksudnya, perhatikan waktu dia muncul dan waktu ia matang dan ranum. Karena hal itu mengandung pelajaran-pelajaran dan tanda-tanda kebesaran Allah sebagai bukti rahmatNya, keluasan karunia dan kemurahanNya, serta kesempurnaan kodrat, dan perhatianNya kepada hamba-hambaNya. Akan tetapi tidak semua orang mau memperhatikan dan mengambil pelajaran, dan tidak semua yang merenungkan pasti mengatahui rahasia yang dimaksud. Oleh karena itu Allah membatasi pengambilan manfaat dari tanda-tanda kebesaran Allah kepada orang-orang Mukmin. Dia berfirman, “Sesungguhnya pada yang demikian itu ada tanda-tanda kekuasaan Allah bagi orang-orang yang beriman.” Karena orang-orang Mukmin terdorong oleh iman mereka untuk beramal sesuai dengan tuntunan dan kelazimanNya yang mana salah satunya adalah tafakkur terhadap ayat-ayat Allah, mengambil hasil dari maksud dan targetnya dari segi akal, ftrah, dan syri’at."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-An’am ayat 99: Termasuk nikmat yang besar yang diberikan Allah kepada manusia adalah dengan diturunkan-Nya hujan dari langit secara berturut-turut ketika manusia membutuhkannya. Dengan hujan itu, Allah menumbuhkan segala sesuatu yang dibutuhkan manusia dan hewan untuk kelangsungan hidup mereka. Ini semua menghendaki mereka untuk bersyukur kepada yang telah memberikan nikmat ini, beribadah, kembali dan cinta kepada-Nya. Kata-kata \"yang serupa\" dan \"yang tidak serupa\" bisa kembalinya kepada zaitun dan delima, yakni serupa pohon dan daunnya, namun berbeda buahnya, dan bisa juga kembalinya kepada semua pohon dan buah, yakni bahwa sebagiannya ada yang serupa dan sebagian lagi tidak serupa. Semuanya bermanfaat bagi manusia, mereka bersenang-senang dengannya, memakannya dan dapat mengambil pelajaran daripadanya. Yang menunjukkan kasih sayang Allah, luasnya ihsan dan kepemurahan-Nya, sempurnanya kemampuan-Nya dan besarnya perhatian Dia terhadap hamba-hamba-Nya. Namun demikian, tidak semua orang yang berpikir dapat mengetahui maksudnya, oleh karenanya Allah Subhaanahu wa Ta'aala menerangkan bahwa hanya orang-orang yang beriman yang dapat mengambil pelajaran daripadanya. Hal itu, karena kaum mukmin dengan keimanan mereka mendorong mereka mengerjakan konsekwensinya berupa amal, yang di antaranya adalah memikirkan ayat-ayat Allah, menggali maksudnya dan apa yang ditunjukkan daripadanya berdasarkan akal, fitrah maupun syara’."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-An’am Ayat 99",
    "description": "Keesaan dan kekuasaan Allah telah terbukti dengan jelas bagi yang masih enggan untuk beriman, maka ayat ini menegaskan kembali seakan merangkum dan memerinci apa yang telah disebutkan. Dan dialah yang menurunkan air, yaitu hujan, dari langit, lalu kami tumbuhkan dengan air itu segala macam tumbuh-tumbuhan, maka kami keluarkan dari tumbuh-tumbuhan itu tanaman yang menghijau, kami keluarkan dari tanaman yang menghijau itu butir yang banyak padahal sebelumnya hanya satu biji atau benih. Dan, sebagai contoh dari proses di atas, dari mayang, yakni tongkol bunga, kurma, mengurai tangkai-tangkai yang menjulai yang mudah dipetik, dan kebun-kebun anggur, dan kami keluarkan pula zaitun dan delima yang serupa bentuk buahnya dan yang tidak serupa aroma dan kegunaannya. Perhatikanlah buahnya pada waktu berbuah, dan perhatikan pula proses bagaimana buah tersebut menjadi masak. Sungguh, pada yang demikian itu ada tanda-tanda kekuasaan Allah bagi orang-orang yang beriman. Aneka macam bukti yang dipaparkan seperti yang disebut pada beberapa ayat di atas, agaknya belum menjadikan kaum musyrik sadar akan keyakinannya yang keliru. Salah satu bentuk keyakinan yang sesat itu diurai pada ayat ini. Dan mereka, orang-orang musyrik, menjadikan jin sekutu-sekutu Allah, padahal dia yang menciptakannya, yakni jin-jin itu, dan mereka berbohong dengan mengatakan, Allah mempunyai anak laki-laki dan anak perempuan, yaitu para malaikat. Itu mereka yakini dan ucapkan tanpa dasar ilmu pengetahuan sedikit pun. Mahasuci Allah dari segala apa yang mereka ucapkan dan yakini, dan mahatinggi dia dari sifat-sifat yang mereka gambarkan."
  }
]