[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit pecah dan tatanannya rusak. Dan apabila bintang-bintang berjatuhan. Dan apabila lautan, Allah menghantamkan sebagian darinya dengan sebagian lainnya sehingga airnya lenyap, Dan apabila kuburan-kuburan dibalik dengan di bangkitkannya penghuninya, Saat itu setiap jiwa mengetahui seluruh amalnya,apa yang dia kerjakan dan apa yang dia lakukan, semuanya akan di balas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Jika langit telah terbelah untuk turunnya malaikat melaluinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-5. Allah menjelaskan dengan tegas betapa besar kekuasaan-Nya dengan peristiwa-peristiwa mengerikan yang terjadi pada makhluk-makhluk di hari kiamat, agar para hamba beriman kepada hari kebangkitan dan hari pembalasan dengan siksaan atau pahala: Jika langit telah terbelah, bintang-bintang telah berjatuhan, air lautan saling menghantam, dan kubur-kubur telah porak poranda sehingga penghuninya keluar dalam keadaan hidup. Maka ketika itu setiap jiwa akan mengetahui kebaikan yang telah dia lakukan dan perbuatan yang dia tunda pelaksanaan atau sunnah yang dilakukan baginya setelah kematiannya, itu semua akan mendapatkan balasannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِذَا السَّمَآءُ انفَطَرَتْ(Apabila langit terbelah) Yakni terbelah karena para malaikat yang turun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Imam Ahmad dan Tirmidzi, dari Abdullah bin Umar dari Nabi SAW berkata: “Barang siapa yang senang memperhatikan berbagai peristiwa yang akan terjadi pada hari kiamat, hendaknya dia membaca ayat “idza asy-syamsu kuwwirat, dan idza as-samaau infatharat, dan idza as-samaau insyaqqat.” 1- 2. Apabila langit telah terbelah dan bintang-bintang berjatuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila langit terbelah} terbelah karena turunnya para malaikat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-5 Maksudnya, bila langit runtuh dan terbelah, bintang-bintangnya berhamburan, hilang keindahannya, laut-laut meluap hingga menjadi satu lautan, kuburan terbongkar mengeluarkan semua mayat yang ada di dalamnya untuk dikumpulkan di tempat pemberhentian di hadapan Allah untuk pembalasan amal perbuatan, pada hari itu penutup tersingkap, sesuatu yang samar menjadi nyata, dan setiap jiwa mengetahui setiap keberuntungan atau kerugian yang menyertainya. Di sana, orang zhalim menggigit jari pada saat melihat perbuatan yang telah dilakukannya dan yakin akan mendapatkan kesengsaraan abadi dan siksaan selamanya. Di sana, (sebaliknya) orang bertakwa yang melakukan amal baik mendapatkan kemenangan besar, kenikmatan abadi, dan selamat dari siksaan Neraka Jahim."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada surah ini sebagaimana surah-surah sebelumnya ( At Takwir ) , dan juga akhir surah ( Abasa ) dan surah ( an Naziat ), pada surah-surah ini Allah membahas tentang peristiwa terjadinya hari kiamat dan perkara-perkara yang akan terjadi setelah kiamat itu terjadi. Peristiwa yang maha dahsyat ini Allah menyebutnya beberapa kali dalam surah-surah tersebut dengan tujuan agar kita mengambil darinya pelajaran dan peringatan, juga agar muncul rasa takut dalam diri setiap insan yang ada iman dalam hatinya, selain itu surah ini juga sebagai peringatan bagi mereka yang belum menyatakan keimanannya kepada Allah ﷻ agar mereka tidak mengatakan : Saya tidak mengetahui hal ini, saya tidak mengerti hal-hal yang akan terjadi di masa-masa yang akan datang, saya tidak mempersiapkan diri karena saya tidak mengetahuinya. Allah ﷻ berfirman : { إِذَا السَّمَاءُ انْفَطَرَتْ } apabila langit itu pecah dan terbelah, dari ayat ini kita mengetahui bahwa langit itu akan berubah dan akan mengalami kekacauan pada sistemnya, karena ajal yang ditetapkan oleh Allah telah tiba, dan segala sesuatu jika ajalnya telah tiba maka pasti akan berubah dan musnah."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِذَا السَّمَاءُ انْفَطَرَتْ “Apabila langit terbelah” Yakni terbelah, sebagaimana dalam firman Allah Tabaaraka wa Ta’ala: إِذَا السَّمَاءُ انْشَقَّتْ “Apabila langit terbelah,”(QS. Al-Insyiqaaq: 1-2)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 1: 1-4. Surat ini dimulai dengan keimanan, dimana Allah bersumpah dengan langit yang apabila telah terbelah dan berubah aturan (dari yang semestinya). Allah juga bersumpah dengan bintang-bintang yang apabila berjatuhan dan berserakan. Allah juga bersumpah dengan lautan yang meluap satu sama lain dan kemudian (terkumpul) menjadi lautan yang satu, dan bercampur air (dari laut) yang tawar dengan yang asin. Allah juga bersumpah dengan kuburan yang apabila dihamburkan dan dibangkitkan (mayit) di dalamnya untuk berkumpul di padang masyhar"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 1",
    "description": "1-4. Ada empat peristiwa besar pada hari kiamat yang disebutkan di bagian awal surah ini, dari ayat 1 s. D. 4. Dua peristiwa yang pertama terjadi di langit dan sisanya di bumi. Apabila langit yang demikian besar dan kukuh terbelah, retak, kemudian digulung. Dan apabila bintang-bintang jatuh berserakan, keluar dari garis edarnya, dan berhamburan secara acak akibat hilangnya gaya tarik-menarik antar-benda angkasa. Dan apabila lautan dijadikan meluap, di mana batas antara satu laut dengan lainnya terbelah dan hancur sehingga air meluap. Air tawar dan asin pun menyatu, berkumpul menjadi lautan raksasa tak bertepi. Dan apabila kuburan-kuburan dibongkar sehingga mayat-mayat yang ada di dalamnya hidup kembali lalu berhamburan keluar tak tentu arah"
  }
]