[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-12. Perkaranya bukan sebagaimana yang kalian ucapkan,bahwa kalian berhak menyembah selain Allah,sebaliknya kalian mendustakan hisab dan pembalasan. Sesungguhnya terhadap kalian ada para malaikat pengawas, Malaikat yang mulia disisi Allah yang mencatat apa yang mereka ditugaskan untuk mencatatnya, tidak ada sedikitpun dari amal amal kalian yang terlewat kan bagi mereka,mereka mengetahui apa yang kalian lakukan,yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sesungguhnya bagi kalian terdapat Malaikat yang mengawasi segala perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya segala tingkah laku kalian selalu diawasi oleh malaikat, yang mencatat segala perbuatan dalam catatan amalmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya bagi kamu ada malaikat-malaikat pengawas} malaikat-malaikat yang mengawasi amal ibadah kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 9-12 Allah berfirman, “Bukan hanya durhaka saja, bahkan kamu mendustakan Hari Pembalasan,” maksudnya, meski dengan nasihat dan peringatan ini, kalian tetap saja mendustakan Hari Pembalasan dan kalian pasti akan dihisab atas apa pun yang kalian lakukan. Allah menugaskan para malaikat mulia untukmu, mereka mencatat perkataan dan perbuatanmu dan mereka mengetahuinya. Termasuk dalam hal ini adalah aktivitas hati dan anggota badan. Selayaknya kalian memuliakan dan menghormati mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Didunia kalian bebas melakukan apa saja yang kalian inginkan, kalian bersenang-senang melakukan kefasikan dan kalian mengira bahwa semua perbuatan itu akan pergi begitu saja bersamaan dengan berlalunya hari-hari, tapi sebenarnya kalian tidak mengetahui bahwa apa yang berlaku dalam keseharian kalian didunia semuanya tertulis dalam lembaran amalan khusus yang dicatat oleh malaikat yang diberikan amanah oleh Allah siang dan malam, mereka terus mengawsi perbuatan kalian sampai kalian mengembuskan nafas terakhir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ (10) كِرَامًا كَاتِبِينَ (11) يَعْلَمُونَ مَا تَفْعَلُونَ \" Padahal sesungguhnya bagi kamu ada (malaikat-malaikat) yang mengawasi (pekerjaanmu), yang mulia (di sisi Allah) dan yang mencatat (pekerjaan-pekerjaanmu itu), mereka mengetahui apa yang kamu kerjakan.\" ditegaskan dengan dua penegasan yaitu: huruf إِنَّ dan huruf lam, وَإِنَّ عَلَيْكُمْ لَحَافِظِينَ \" Padahal sesungguhnya bagi kamu ada (malaikat-malaikat) yang mengawasi (pekerjaanmu),\"Seorang insan ada yang menjaganya dan yang mencatat perbuatannya, Allah Ta’ala berfirman: مَا يَلْفِظُ مِنْ قَوْلٍ إِلَّا لَدَيْهِ رَقِيبٌ عَتِيدٌ “Tiada suatu ucapan pun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir.”(QS. Qaf: 18) Setiap manusia ada malaikat hafadzah (penjaga) yang senantiasa mencatat segala yang diucapkan dan segala yang dilakukan. Al-Hafadzah adalah malaikat mulia dan tidak tercela, bahkan kemuliaan mereka itu menafikan berbuat zalim kepada siapa pun. Mereka menulis apapun yang tidak dilakukan atau tidak membiarkan yang telah dilakukan setiap manusia, karena mereka mereka semua diberikan sifat mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 10: 10-12. Ketahuilah oleh kalian bahwasanya amal-amal kalian seperti dicatat, dan sungguh setiap dari kalian ada malaikat-malaikat penjaga yang senantiasa mencatat (amalan), ia mencatat apa yang kalian kerjakan dari kebaikan maupun kejelekan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 10",
    "description": "Dan mengapa kamu mendustakan hari pembalasan, padahal sesungguhnya bagi kamu ada para malaikat yang mengawasi semua perbuatanmu. 11. Mereka adalah makhluk yang mulia di sisi Allah karena kepatuhan dan ketaatan mereka, dan yang tidak pernah luput mencatat amal perbuatanmu, dari yang baik hingga yang buruk, dari yang kecil hingga yang besar."
  }
]