[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang bertakwa yang menegakkan hak-hak Allah dan hak-hak hamba-hamba NYA benar-benar dalam kenikmatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Sesungguhnya orang yang banyak mengerjakan kebaikan dan ketaatan pasti berada di dalam kenikmatan abadi pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Orang-orang beriman yang mengerjakan ketaatan kepada Allah akan berada dalam kenikmatan surga."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "13-14. 1). Siapapun yang berbuat adil pada suatu wilayah dan menjalani keperintahan pada wilayah tersebut dengan ilmu dan keadilan, serta ketaatan kepada Allah dan rasul-Nya, maka dia termasuk kedalam golongan orang yang berbakti itu, dan siapapun yang berbuat kezholiman didalamnya, maka dia termasuk kedalam golongan orang-orang durhaka dan zholim, dan setiap dari mereka akan mendapatkan balasannya masing-masing : { إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ , وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ } . 2). Janganlah kamu mengira bahwa firman Allah : { نَّ الْأَبْرَارَ لَفِي نَعِيمٍ , وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ } hanya akan berlaku di hari kiamat kelak, bahkan mereka yang berbakti akan mendapatkan kenikmatan-kenikmatan itu dalama tiga masa : yaitu kehidupan dunia, alam barzakh, dan alam akhirat ( kiamat ), begitupun dengan orang-orang yang durhaka mereka akan merasakan siksaan mereka dalam tiga masa itu, dan tiada kenikmatan yang paling indah didunia selain baiknya hati, dada yang lapang, dan mengetahui siapa tuhan pencipta alam semesta ini, mencintai-Nya, serta mengamalkan segala yang diridhoi oleh-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Sungguh, orang yang beriman dengan teguh akan mendapatkan balasan kenikmatan surga. Adapun mereka yang ingkar dan mengabaikan hukum Allah akan mendapatkan siksa neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang berbakti benar-benar berada dalam kenikmatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 13-19 Yang dimaksud dengan orang-orang baik adalah mereka yang menunaikan hak-hak Allah dan hak-hak hambaNya, yang selalu konsisten dengan kebaikan dalam aktivitas hati maupun anggota badan. Balasan mereka adalah kenikmatan di hati, ruh, dan badan di dunia, di alam barzakh, dan di negeri keabadian. “Dan sesungguhnya orang-orang yang durhaka,” yang tidak menunaikan hak-hak Allah dan hak-hak hamba secara sempurna, mereka yang hati dan amalnya berdosa, “benar-benar berada dalam neraka,” yaitu dalam azab yang pedih di dunia, di alam barzakh dan di negeri keabadian. “Mereka masuk ke dalamnya,” dan disiksa dengan sekeras-kerasnya, “pada Hari Pembalasan,” yaitu pada hari Hari Pembalasan amal perbuatan. “Dan mereka sekali-kali tidak dapat keluar dari neraka itu,” yaitu mereka tetap berada di dalamnya dan tidak bisa keluar. “Tahukah kamu apakah Hari Pembalasan itu? Sekali lagi, tahukah kamu apakah Hari Pembalasan itu?” dalam ayat ini terdapat pemberitahuan yang memperbesar huru-hara hari yang sulit yang membuat akal risau, “(yaitu) hari (ketika) seseorang tidak berdaya sedikitpun untuk menolong orang lain,” meski dekat dan berteman tulus, masing-masing disibukkan oleh diri sendiri dan tidak ingin meminta tolong dari yang lain. “Dan segala urusan pada hari itu dalam kekusaan Allah,” Dia-lah yang menghukumi antara manusia dan mengambilkan hak orang yang dizhalimi dari orang yang menzhalimi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "الأبرار : Yaitu orang-orang yang banyak beramal shalih mereka berada dalam kenikmatan yang berlimpah... kapan ? mereka akan mendapatkan kenikmatan didunia dan ketika didalam kubur serta ketika mereka dibangkitkan dari kubur mereka, mereka akan selalu berada dalam kenikmatan, mereka berada dalam kebahagiaan dan kelapangan hati, mereka bersenag-senang dengan ketaatan mereka kepada Allah didunia, dan mereka pun akan bersenang-senang dengan ganjaran dari amalan mereka didalam kubur dan di akhirat nanti. Orang-orang yang banyak beramal shalih berada dalam kenikmatan yang berlimpah, walaupun dia miskin harta, akan tetapi pada hakikatnya dia dalam kenikmatan yang tidak terputus, karena kenikmatan yang sesungguhnya itu dihati yang tenang dan bukan pada harta yang banyak, boleh jadi dia yang dikelilingi dengan harta dunia yang berlimpah akan tetapi pada hakikatnya hidup mereka penuh dengan kegundahan hati."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ “Sesungguhnya orang-orang yang banyak berbakti benar-benar berada dalam kenikmatan,” Ini adalah penjelasan tentang akhir dan balasan إِنَّ الْأَبْرَارَ Adalah Bentuk jamak dari بَرّ [Barr] Mereka adalah orang-orang yang banyak berbuat baik, dan yang menjauhi perbuatan buruk لَفِي نَعِيمٍ Maknanya: Kenikmatan di hati, dan kenikmatan di tubuh, karenanya anda tidak akan mendapatkan seorang pun yang lebih baik hatinya, lebih tenang pikirannya dari orang-orang yang gemar berbuar baik, sehingga sebagian salaf mengatakan: “ Andai saja para raja, dan anak-anak raja tahu yang kita rasakan pasti mereka akan menghukum kita dengan pedang ” Kenikmatan yang diperoleh ini terdapat di dunia dan di akhirat. Sedangkan di akhirat adalah surga, sedangkan didunia adalah kenikmatan tenang dan tentramnya hati, dan kerelaannya terhadap ketetapan Allah dan takdir-Nya. Inilah kenikmatan hakiki, bukan dengan kepuasan badan semata (dengan syahwat) namun kenikmatan sejati adalah kenikmatan dalam hati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 13: 13-14. Kemudian Allah mengkabarkan bahwasanya penilaian (hasil akhir) adalah apa yang dicatat oleh para malaikat (dari amalan-amalan yang dikerjakan) seorang hamba. Maka bagi orang-orang mukmin yang mentaati Rabbnya di dunia, mereka akan mendapatkan balasan kemenangan dan kesenangan. Adapun orang-orang kafir yang bermaksiat kepada Rabb mereka di dunia, maka tempat kembalinya adalah di neraka, mereka dibakar di dalamnya dan di azab di dalamnya. Mereka tidaklah hidup tidak pula mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang memenuhi hak Allah dan hak hamba-hamba-Nya; yang senantiasa melazimi kebaikan baik pada hati mereka maupun amal mereka. Baik kenikmatan bagi hati, ruh maupun badan. Demikian pula baik di dunia, di alam barzakh maupun di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 13",
    "description": "Semua perbuatan manusia tercatat dalam buku catatan amal yang kelak akan diperlihatkan kepada mereka di akhirat. Sesungguhnya orang-orang yang banyak berbakti, beriman, dan beramal saleh, benar-benar berada dalam surga yang penuh kenikmatan tiada tara, tak terbayangkan, apalagi terbandingkan dengan kenikmatan duniawi. 14. Dan sesungguhnya orang-orang yang durhaka kepada Allah, enggan menaati-Nya, bahkan mengingkari, mendurhakai, dan menyekutukan-Nya, benar-benar berada dalam neraka yang penuh siksaan yang sangat mengerikan."
  }
]