[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-16. Dan sesungguhnya orang orang durhaka yang melalaikan hak-hak Allah dan hak-hak para hamba NYA berada di neraka jahim, Apinya membakar mereka dihari pembalasan. Mereka tidak akan lolos dari azab neraka jahanam,baik dengan keluar atau dengan kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan sesungguhnya orang-orang yang durhaka pasti berada di dalam Neraka yang menyala atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-16. Sedangkan orang-orang pendosa yang senantiasa berbuat kerusakan dengan kekafiran dan keangkuhan mereka, akan berada dalam neraka jahim. Pada hari perhitungan mereka akan memasukinya dan terbakar oleh kobarannya, dan mereka akan berada di dalamnya selamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Sungguh, orang yang beriman dengan teguh akan mendapatkan balasan kenikmatan surga. Adapun mereka yang ingkar dan mengabaikan hukum Allah akan mendapatkan siksa neraka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang durhaka benar-benar berada dalam neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 13-19 Yang dimaksud dengan orang-orang baik adalah mereka yang menunaikan hak-hak Allah dan hak-hak hambaNya, yang selalu konsisten dengan kebaikan dalam aktivitas hati maupun anggota badan. Balasan mereka adalah kenikmatan di hati, ruh, dan badan di dunia, di alam barzakh, dan di negeri keabadian. “Dan sesungguhnya orang-orang yang durhaka,” yang tidak menunaikan hak-hak Allah dan hak-hak hamba secara sempurna, mereka yang hati dan amalnya berdosa, “benar-benar berada dalam neraka,” yaitu dalam azab yang pedih di dunia, di alam barzakh dan di negeri keabadian. “Mereka masuk ke dalamnya,” dan disiksa dengan sekeras-kerasnya, “pada Hari Pembalasan,” yaitu pada hari Hari Pembalasan amal perbuatan. “Dan mereka sekali-kali tidak dapat keluar dari neraka itu,” yaitu mereka tetap berada di dalamnya dan tidak bisa keluar. “Tahukah kamu apakah Hari Pembalasan itu? Sekali lagi, tahukah kamu apakah Hari Pembalasan itu?” dalam ayat ini terdapat pemberitahuan yang memperbesar huru-hara hari yang sulit yang membuat akal risau, “(yaitu) hari (ketika) seseorang tidak berdaya sedikitpun untuk menolong orang lain,” meski dekat dan berteman tulus, masing-masing disibukkan oleh diri sendiri dan tidak ingin meminta tolong dari yang lain. “Dan segala urusan pada hari itu dalam kekusaan Allah,” Dia-lah yang menghukumi antara manusia dan mengambilkan hak orang yang dizhalimi dari orang yang menzhalimi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan sesungguhnya orang-orang yang durhaka berada dalam azab dunia, dan azab kubur, dan di akhirat mereka akan mendapati diri mereka penuh dengan azab dan siksaat, dalam diri mereka penuh dengan siksaan, hati mereka terasa sempit dan tertekan, hati mereka penuh dengan kegelisaan, bahkan diantara mereka ada yang bunuh diri karena merasa berada dalam siksaan didunia, itulah keadaan orang-orang durhaka didunia. Dan didalam kubur api menyala-nyala diatas mereka, kubur mereka menjadi lubang dari lubang neraka. Dan pada hari kiamat mereka ditempatkan di neraka jahannam, mereka selalu berada dalam siksaan. Maka jangan dibayangkan bahwa mereka akan mendapat azab dan siksaan hanya ketika kiamat itu tiba, akan tetapi didunia pun mereka disiksa, hidup mereka penuh dengan siksaan dan kesempitan, Allah berfirman : { وَمَنْ أَعْرَضَ عَنْ ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنْكًا وَنَحْشُرُهُ يَوْمَ الْقِيَامَةِ أَعْمَىٰ } ( Dan barangsiapa berpaling dari peringatan-Ku, maka sesungguhnya baginya penghidupan yang sempit, dan Kami akan menghimpunkannya pada hari kiamat dalam keadaan buta”. ) [ Thaha : 124 ] , penghidupan yang sempit, dan mereka menyangka bahwa mereka sedang berada dalam limpahan harta, akan tetapi hati mereka terasa sempit dan tersiksa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِنَّ الْفُجَّارَ لَفِي جَحِيمٍ “dan sesungguhnya orang-orang yang durhaka benar-benar berada dalam neraka.” Al-Fujjaar mereka adalah orang-orang kafir, kebalikan al-Abraar لَفِي جَحِيمٍ Maknanya: Neraka yang menyala"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 14: 13-14. Kemudian Allah mengkabarkan bahwasanya penilaian (hasil akhir) adalah apa yang dicatat oleh para malaikat (dari amalan-amalan yang dikerjakan) seorang hamba. Maka bagi orang-orang mukmin yang mentaati Rabbnya di dunia, mereka akan mendapatkan balasan kemenangan dan kesenangan. Adapun orang-orang kafir yang bermaksiat kepada Rabb mereka di dunia, maka tempat kembalinya adalah di neraka, mereka dibakar di dalamnya dan di azab di dalamnya. Mereka tidaklah hidup tidak pula mati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang tidak memenuhi hak Allah dan hak hamba-hamba-Nya; yang buruk hati dan amalnya. Yakni azab yang pedih, baik di dunia, di alam barzakh maupun di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 14",
    "description": "Dan sesungguhnya orang-orang yang durhaka kepada Allah, enggan menaati-Nya, bahkan mengingkari, mendurhakai, dan menyekutukan-Nya, benar-benar berada dalam neraka yang penuh siksaan yang sangat mengerikan. 15. Mereka yang durhaka itu masuk ke dalamnya pada hari pembalasan, di mana semua manusia harus mempertanggungjawabkan tiap detail perbuatannya."
  }
]