[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-16. Dan sesungguhnya orang orang durhaka yang melalaikan hak-hak Allah dan hak-hak para hamba NYA berada di neraka jahim, Apinya membakar mereka dihari pembalasan. Mereka tidak akan lolos dari azab neraka jahanam,baik dengan keluar atau dengan kematian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan mereka sama sekali tidak bisa lepas darinya selamanya, bahkan mereka itu kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَمَا هُمْ عَنْهَا بِغَآئِبِينَ (Dan mereka sekali-kali tidak dapat keluar dari neraka itu) Yakni mereka tidak akan dapat lari darinya, namun akan berada di dalamnya selama lamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15-16. Pada hari itu mereka memasuki tempat mereka. Mereka tidak akan mungkin keluar dari neraka, mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak mungkin keluar dari sana} keluar dari sana karena mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 13-19 Yang dimaksud dengan orang-orang baik adalah mereka yang menunaikan hak-hak Allah dan hak-hak hambaNya, yang selalu konsisten dengan kebaikan dalam aktivitas hati maupun anggota badan. Balasan mereka adalah kenikmatan di hati, ruh, dan badan di dunia, di alam barzakh, dan di negeri keabadian. “Dan sesungguhnya orang-orang yang durhaka,” yang tidak menunaikan hak-hak Allah dan hak-hak hamba secara sempurna, mereka yang hati dan amalnya berdosa, “benar-benar berada dalam neraka,” yaitu dalam azab yang pedih di dunia, di alam barzakh dan di negeri keabadian. “Mereka masuk ke dalamnya,” dan disiksa dengan sekeras-kerasnya, “pada Hari Pembalasan,” yaitu pada hari Hari Pembalasan amal perbuatan. “Dan mereka sekali-kali tidak dapat keluar dari neraka itu,” yaitu mereka tetap berada di dalamnya dan tidak bisa keluar. “Tahukah kamu apakah Hari Pembalasan itu? Sekali lagi, tahukah kamu apakah Hari Pembalasan itu?” dalam ayat ini terdapat pemberitahuan yang memperbesar huru-hara hari yang sulit yang membuat akal risau, “(yaitu) hari (ketika) seseorang tidak berdaya sedikitpun untuk menolong orang lain,” meski dekat dan berteman tulus, masing-masing disibukkan oleh diri sendiri dan tidak ingin meminta tolong dari yang lain. “Dan segala urusan pada hari itu dalam kekusaan Allah,” Dia-lah yang menghukumi antara manusia dan mengambilkan hak orang yang dizhalimi dari orang yang menzhalimi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan sekali-kali mereka tidak akan keluar dari neraka jahannam, mereka kekal didalamnya dan tidak akan bisa keluar selama-lamanya, Allah berfirman : { كَذَٰلِكَ يُرِيهِمُ اللَّهُ أَعْمَالَهُمْ حَسَرَاتٍ عَلَيْهِمْ ۖ وَمَا هُمْ بِخَارِجِينَ مِنَ النَّارِ } ( Demikianlah Allah memperlihatkan kepada mereka amal perbuatannya menjadi sesalan bagi mereka; dan sekali-kali mereka tidak akan keluar dari api neraka. ) [ Al-Baqarah : 164 ] , Allah juga berfirman : { كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا مِنْ غَمٍّ أُعِيدُوا فِيهَا وَذُوقُوا عَذَابَ الْحَرِيقِ } ( Setiap kali mereka hendak ke luar dari neraka lantaran kesengsaraan mereka, niscaya mereka dikembalikan ke dalamnya. (Kepada mereka dikatakan), “Rasailah azab yang membakar ini”) [ AL Hajj : 22 ] , mereka tidak akan mampu melarikan diri dan menghindar dari siksaan api neraka jahannam yang pedih itu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا هُمْ عَنْهَا بِغَائِبِينَ “Dan mereka sekali-kali tidak dapat keluar dari neraka itu.” Mereka tidak akan menghilang darinya maksudnya mereka tidak akan keluar darinya sebagaimana Allah Tabaaroka wa Ta’ala berfirman: وَمَا هُمْ بِخَارِجِينَ مِنْهَا “padahal mereka sama sekali tidak dapat ke luar daripadanya”(QS. Al-Maidah: 37) karena mereka akan kekal di dalamnya wal-‘iyaadzu billaah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 16: 15-16. Kemudian Allah jelaskan bahwa neraka ini akan memakan mereka dengan api yang sangat panas dan menjadikan mereka menderita dengan lautan api pada hari perhitungan dan pembalasan dimana mereka (para pendusta) mendustakan ketika di dunia. Allah menjelaskan bahwasanya mereka tidak akan musnah setelah di panggang dengan api sekejap pun, bahkan mereka akan kekal dengan sebenar-benarnya kekekalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 16",
    "description": "Dan mereka yang ingkar dan durhaka kepada Allah itu tidak mungkin keluar dari neraka itu dan tidak pula mati di dalamnya. Mereka menetap dan hidup di dalamnya selama-lamanya. 17. Menegaskan ketegangan hari kebangkitan, Allah bertanya, 'dan tahukah kamu apakah hari pembalasan itu''."
  }
]