[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-19. Tahukah kamu keagungan hari perhitungan amal? Kemudian tahukah kamu keagungan hari hisab? Pada hari itu, tidak ada seorangpun yang bisa memberi manfa’at kepada orang lain. Segala urusan pada hari itu hanya milik Allah semata, tidak ada yang mengalahkan NYA, tidak ada yang berkuasa atas NYA, dan tidak ada yang menentang NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Yaitu suatu hari di saat seseorang tidak bisa menolong orang lain, dan segala perkara pada Hari itu dalam kekuasaan Allah semata, berbuat sebagaimana Dia kehendaki, bukan dalam kekuasaan selain-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. يَوْمَ لَا تَمْلِكُ نَفْسٌ لِّنَفْسٍ شَيْـًٔا ۖ وَالْأَمْرُ يَوْمَئِذٍ لِّلَّهِ ((Yaitu) hari (ketika) seseorang tidak berdaya sedikitpun untuk menolong orang lain. Dan segala urusan pada hari itu dalam kekuasaan Allah) Yakni tidak ada orang yang mampu menetapkan atau melakukan sesuatu apapun, kecuali Allah tuhan semesta alam. Allah tidak memberikan kerajaan bagi siapapun pada hari itu sebagainya ketika di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Hari dimana setiap orang tidak lagi bermanfaat atau memberi manfaat bagi orang lain. Hari itu semua adalah atas kendali Allah, tidak ada yang mengendalikan/berwenang kecuali Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hari (ketika) seseorang tidak berdaya pada orang lain sedikit pun} hari pembalasan yaitu hari dimana seseorang tidak berguna bagi orang lain {Segala urusan pada hari itu adalah milik Allah}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 13-19 Yang dimaksud dengan orang-orang baik adalah mereka yang menunaikan hak-hak Allah dan hak-hak hambaNya, yang selalu konsisten dengan kebaikan dalam aktivitas hati maupun anggota badan. Balasan mereka adalah kenikmatan di hati, ruh, dan badan di dunia, di alam barzakh, dan di negeri keabadian. “Dan sesungguhnya orang-orang yang durhaka,” yang tidak menunaikan hak-hak Allah dan hak-hak hamba secara sempurna, mereka yang hati dan amalnya berdosa, “benar-benar berada dalam neraka,” yaitu dalam azab yang pedih di dunia, di alam barzakh dan di negeri keabadian. “Mereka masuk ke dalamnya,” dan disiksa dengan sekeras-kerasnya, “pada Hari Pembalasan,” yaitu pada hari Hari Pembalasan amal perbuatan. “Dan mereka sekali-kali tidak dapat keluar dari neraka itu,” yaitu mereka tetap berada di dalamnya dan tidak bisa keluar. “Tahukah kamu apakah Hari Pembalasan itu? Sekali lagi, tahukah kamu apakah Hari Pembalasan itu?” dalam ayat ini terdapat pemberitahuan yang memperbesar huru-hara hari yang sulit yang membuat akal risau, “(yaitu) hari (ketika) seseorang tidak berdaya sedikitpun untuk menolong orang lain,” meski dekat dan berteman tulus, masing-masing disibukkan oleh diri sendiri dan tidak ingin meminta tolong dari yang lain. “Dan segala urusan pada hari itu dalam kekusaan Allah,” Dia-lah yang menghukumi antara manusia dan mengambilkan hak orang yang dizhalimi dari orang yang menzhalimi."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada hari itu tidak seorangpun berdaya untuk menolong orang lain, kerabat tidak mampu untuk menolong kerabat lainnya, seseorang tidak mampu menolong temannya, setiap jiwa akan sibuk dengan urusan dirinya masing-masing. Setiap jiwa akan mengurusi drinya sendiri, setiap mereka akan mempertanggung jawabkan perbuatannya masing-masing, sedikitpun tidak akan meilirik ke saudaranya yang lain, dan tidak pula mereka akan meminta pertolongan dari orang lain sebagaimana ketika didunia, semua itu terjadi disebabkan dahsyatnya peristiwa pada hari pembalasan itu. { يَوْمَ لَا تَمْلِكُ نَفْسٌ لِنَفْسٍ شَيْئًا } Bahkan seorang Ayah pun tidak akan berdaya menolong anaknya sendiri, juga sebaliknya anak tidak berdaya untuk memberi perhatian dan pertolongan kepada Ayahnya sendiri, siapapun tidak akan mampu dan tidak akan sibuk dengan urusan orang lain, hanya amalan sholah lah yang akan menjadi penolongnya pada hari itu. { وَالْأَمْرُ يَوْمَئِذٍ لِلَّهِ } dan segala urusan pada hari itu dibawah pengawasan Allah ﷻ, maka bagaimana mungkin manusia mengingkari adanya hari pembalasan, segala urusan hamba berada ditangan penciptanya. Semoga Allah menganugerahkan kepada kita surga-Nya dan menerima segala amal shalih kita."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَ لَا تَمْلِكُ نَفْسٌ لِنَفْسٍ شَيْئًا “Yaitu hari tiada kuasa seorang pun kepada yang lainnya sedikit pun” di Hari kiamat tidak ada seorang pun yang memiliki kuasa terhadap orang lain baik memberikan kebaikan atau pun membentengi dari keburukan melainkan atas izin Allah ‘Azza Wa Jalla, sebagaimana Allah berfirman: وَالْأَمْرُ يَوْمَئِذٍ لِلَّهِ “dan perintah pada hari itu hanya milik Allah” Di dunia ini ada sebagian orang yang memerintah, seperti para penguasa, mentri, kepala suku, ayah, ibu tetapi di akhirat nanti perintah hanya milik Allah ‘Azza Wa Jalla, Setiap jiwa tidak punya wewenang kepada jiwa lainnya sedikitpun kecuali dengan izin Allah ‘Azza Wa Jalla. Oleh karena itu manusia pada hari itu ditimpa kegundahan dan tekanan yang tidak kuasa mereka tahan, kemudian mereka memin syafa’at kepada Adam, kemudian Nuh, Kemudian Ibrahim, Musa, Isa ‘alaihimussholaatu wassalaam, hingga berakhir pada Nabi Kita shallallaahu ‘alaihi wa sallam, maka beliau bisa memberikan syafa’at dengan izin Allah, maka alam akan tentram saat itu: “dan perintah pada hari itu hanya milik Allah” Jika ada yang mengatakan: Bukankah perintah itu milik Allah baik pada hari itu maupun hari lainnya? Kita katakan: Tentu, Perintah milik Allah baik pada hari kiamat maupun hari sebelumnya, tetapi munculnya perintah (perkara) Allah pada hari itu lebih banyak dibanding dengan munculnya perintahnya di dunia, karena di dunia, Manusia masih bisa menyelisihi perintah Allah ‘Azza Wa Jalla dan mematuhi perintah tuannya. Maka jika ditinjau dari sisi ini perintah tidak milik Allah, akan tetapi di akhirat tidak ada perintah kecuali hanya milik Allah ‘Azza Wa Jalla, ini juga seperti dalam firman Allah Ta’ala: لِمَنِ الْمُلْكُ الْيَوْمَ لِلَّهِ الْوَاحِدِ الْقَهَّارِ “Kepunyaan siapakah kerajaan pada hari ini?\" epunyaan Allah Yang Maha Esa lagi Maha Mengalahkan.”(QS. Ghafir: 16) kerajaan ini milik Allah di dunia mau pun di akhirat, tetapi pada hari itu hanya kekuasaan dan perintah Allah ‘Azza Wa Jalla saja yang muncul, dan jelas bahwa tidak ada di sana, pada hari itu siapa pin yang memerintahkan kecuali Allah Azza Wa Jalla, wallaahu a’lam. Wa shallallaahu wa sallama ‘alaa nabiyina Muhammadin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 19: 17-19. Kemudian Allah berbicara tentang tulang-belulang pada hari kiamat, Ia berkata : Dan tidaklah engkau mengetahui wahai manusia akan keadaan tulang-belulang pada hari perhitungan dan pembalasan. Ketahuilah wahai sekalian manusia ! Bahwasanya pada hari itu adalah hari yang sangat mengerikan, dimana tidak akan mampu salah seorang memberikan manfaat bagi seorang yang lainnya. Dan segala urusannya kembali kepada Allah semata. “Ya Allah wahai Dzat yang memiliki segala urusan pada setiap masa, masukanlah kami dengan rahmat-mu termasuk kedalam golongan orang-orang yang shalih”."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun orang lain itu kerabat atau kekasihnya. Masing-masing sibuk mengurus dirinya sendiri. Dialah yang memutuskan masalah di antara hamba-hamba-Nya, Dia akan mengambil hak dari orang yang zalim untuk orang yang dizalimi, wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 19",
    "description": "Hari pembalasan itu adalah pada hari ketika seseorang sama sekali tidak berdaya menolong orang lain. Setiap orang harus mempertanggungjawabkan amalnya sendiri. Hanya iman dan amal saleh yang mampu menyelamatkan seseorang dari siksa neraka. Dan segala urusan pada hari itu dalam kekuasaan Allah. Dialah penguasa tunggal; tidak ada penguasa lain selain dia. 1. Pada permulaan surah ini Allah memberi peringatan keras kepada mereka yang berbuat curang dalam timbangan dan takaran. Celakalah bagi orang-orang yang berbuat curang dalam menimbang dan menakar sehingga merugikan banyak orang!."
  }
]