[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit pecah dan tatanannya rusak. Dan apabila bintang-bintang berjatuhan. Dan apabila lautan, Allah menghantamkan sebagian darinya dengan sebagian lainnya sehingga airnya lenyap, Dan apabila kuburan-kuburan dibalik dengan di bangkitkannya penghuninya, Saat itu setiap jiwa mengetahui seluruh amalnya,apa yang dia kerjakan dan apa yang dia lakukan, semuanya akan di balas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan jika lautan telah dibukakan (tabilnya) sehingga bercampur satu sama lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَإِذَا الْبِحَارُ فُجِّرَتْ (dan apabila lautan menjadikan meluap) Terdapat pendapat mengatakan bahwa seluruh lautan akan meluap hingga menjadi satu. Atau akan Meletus seperti letusan gunung. Hal ini akan terjadi sebelum hari kiamat, sebagaimana telah disebutkan pada surat sebelumnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Peristiwa bencana alam yang terjadi di dunia seperti tsunami, gempa bumi, banjir, dan semacamnya adalah merupakan peringatan akan kejadian yang lebih dahsyat yang akan terjadi pada hari kiamat ! dan beberapa kejadian runtuhnya tembok bendungan yang menampung air yang begitu banyak yang menyebabkan tenggelamnya bebrapa kampung, lalu bagaimana ketika hari kiamat itu tiba dan saat itu air laut ditumpahkan seluruhnya ? maka hendaklah bagi setiap hamba untuk mengambil pelajaran dari peristiwa-peristiwa alam di dunia ini, karena barangsiapa yang hatinya tidak takut dengan peristiwa ini, itu menandakan hati yang rusak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Apabila laut telah meluap dan hilang pembatas-pembatasnya sehingga menjadi satu laut. Apabila kubur telah dibongkar untuk mengeluarkan dan membangkitkan penghuninya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{apabila lautan diluapkan} saling menutupi satu sama lain sehingga menjadi satu lautan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-5 Maksudnya, bila langit runtuh dan terbelah, bintang-bintangnya berhamburan, hilang keindahannya, laut-laut meluap hingga menjadi satu lautan, kuburan terbongkar mengeluarkan semua mayat yang ada di dalamnya untuk dikumpulkan di tempat pemberhentian di hadapan Allah untuk pembalasan amal perbuatan, pada hari itu penutup tersingkap, sesuatu yang samar menjadi nyata, dan setiap jiwa mengetahui setiap keberuntungan atau kerugian yang menyertainya. Di sana, orang zhalim menggigit jari pada saat melihat perbuatan yang telah dilakukannya dan yakin akan mendapatkan kesengsaraan abadi dan siksaan selamanya. Di sana, (sebaliknya) orang bertakwa yang melakukan amal baik mendapatkan kemenangan besar, kenikmatan abadi, dan selamat dari siksaan Neraka Jahim."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bentangan laut yang luas, samudera, teluk-teluk dan sungai-sungai yang sebelumnya terpisah satu sama lainnya, yang Allah meletakkan pembatas-pembatas diantara lautan-lautan tersebut, Allah berfirman : { مَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ , بَيْنَهُمَا بَرْزَخٌ لَا يَبْغِيَانِ } ( Dia membiarkan dua lautan mengalir yang keduanya kemudian bertemu , Antara keduanya ada batas yang tidak dilampaui masing-masing. ) [ Ar Rahman : 19 - 20 ] diantara keduanya ada pemisah yang tidak dapat dicapai oleh kedua lautan itu, dan Allah juga mengatakan dalam surah lain : { وَهُوَ الَّذِي مَرَجَ الْبَحْرَيْنِ هَٰذَا عَذْبٌ فُرَاتٌ وَهَٰذَا مِلْحٌ أُجَاجٌ وَجَعَلَ بَيْنَهُمَا بَرْزَخًا وَحِجْرًا مَحْجُورًا } ( Dan Dialah yang membiarkan dua laut yang mengalir (berdampingan); yang ini tawar lagi segar dan yang lain asin lagi pahit; dan Dia jadikan antara keduanya dinding dan batas yang menghalangi. ) [ Al-Furqan : 53 ]. Dan jika tiba masanya Allah akan mengangkat pembatas-pembatas itu kembali sehingga bercampurlan semua jenis lautan yang ada didunia dan menjadi satu macam laut saja."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا الْبِحَارُ فُجِّرَتْ “dan apabila lautan dijadikan meluap,” Maknanya: Diluapkan satu bagian dengan bagian lainnya dan menenggelamkan bumi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 3: 1-4. Surat ini dimulai dengan keimanan, dimana Allah bersumpah dengan langit yang apabila telah terbelah dan berubah aturan (dari yang semestinya). Allah juga bersumpah dengan bintang-bintang yang apabila berjatuhan dan berserakan. Allah juga bersumpah dengan lautan yang meluap satu sama lain dan kemudian (terkumpul) menjadi lautan yang satu, dan bercampur air (dari laut) yang tawar dengan yang asin. Allah juga bersumpah dengan kuburan yang apabila dihamburkan dan dibangkitkan (mayit) di dalamnya untuk berkumpul di padang masyhar"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga menjadi satu kesatuan lautan, dimana yang rasanya segar dan yang rasanya asin menyatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 3",
    "description": "1-4. Ada empat peristiwa besar pada hari kiamat yang disebutkan di bagian awal surah ini, dari ayat 1 s. D. 4. Dua peristiwa yang pertama terjadi di langit dan sisanya di bumi. Apabila langit yang demikian besar dan kukuh terbelah, retak, kemudian digulung. Dan apabila bintang-bintang jatuh berserakan, keluar dari garis edarnya, dan berhamburan secara acak akibat hilangnya gaya tarik-menarik antar-benda angkasa. Dan apabila lautan dijadikan meluap, di mana batas antara satu laut dengan lainnya terbelah dan hancur sehingga air meluap. Air tawar dan asin pun menyatu, berkumpul menjadi lautan raksasa tak bertepi. Dan apabila kuburan-kuburan dibongkar sehingga mayat-mayat yang ada di dalamnya hidup kembali lalu berhamburan keluar tak tentu arah"
  }
]