[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit pecah dan tatanannya rusak. Dan apabila bintang-bintang berjatuhan. Dan apabila lautan, Allah menghantamkan sebagian darinya dengan sebagian lainnya sehingga airnya lenyap, Dan apabila kuburan-kuburan dibalik dengan di bangkitkannya penghuninya, Saat itu setiap jiwa mengetahui seluruh amalnya,apa yang dia kerjakan dan apa yang dia lakukan, semuanya akan di balas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan jika tanah kuburan telah dibalik dan mayat yang ada di dalamnya telah dibangkitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَإِذَا الْقُبُورُ بُعْثِرَتْ (dan apabila kuburan-kuburan dibongkar) Yakni tanahnya terbalik dan mayatnya dikeluarkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Apabila laut telah meluap dan hilang pembatas-pembatasnya sehingga menjadi satu laut. Apabila kubur telah dibongkar untuk mengeluarkan dan membangkitkan penghuninya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan apabila kuburan-kuburan dibongkar} tanahnya dibalik dan dibangkitkan orang yang ada di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-5 Maksudnya, bila langit runtuh dan terbelah, bintang-bintangnya berhamburan, hilang keindahannya, laut-laut meluap hingga menjadi satu lautan, kuburan terbongkar mengeluarkan semua mayat yang ada di dalamnya untuk dikumpulkan di tempat pemberhentian di hadapan Allah untuk pembalasan amal perbuatan, pada hari itu penutup tersingkap, sesuatu yang samar menjadi nyata, dan setiap jiwa mengetahui setiap keberuntungan atau kerugian yang menyertainya. Di sana, orang zhalim menggigit jari pada saat melihat perbuatan yang telah dilakukannya dan yakin akan mendapatkan kesengsaraan abadi dan siksaan selamanya. Di sana, (sebaliknya) orang bertakwa yang melakukan amal baik mendapatkan kemenangan besar, kenikmatan abadi, dan selamat dari siksaan Neraka Jahim."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan apabila kuburan-kuburan yang penuh dengan mayat dibawah tanah dibalik sehingga keluarlah segala apa yang ada didalamnya, Allah membalikkan sisi dalamnya menjadi sisi luar, maka apa yang ada didlam perut bumi berhamburan keluar seperti mayat dan tulang belulang yang jumlahya tidak diketahui kecuali Allah ﷺ yang mengetahuinya . Bumi yang isinya penuh dengan mayat-mayat, yang tidak diketahui siapa saja yang ada disna, akan tetapi akan tiba masanya bumi itu dibalik dan dihamburkan ; dan keluarlah mayat-mayat dan tulang belulang hidup-hidup sebagaimana mereka diciptakan pertama kali, mereka kemudian meninggalkan kuburan mereka menuju padang mahsyar, dan satupun tidak akan menghindar, itulah salah satu peristiwa yang menakutkan yang akan terjadi pada hari kiamat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِذَا الْقُبُورُ بُعْثِرَتْ “dan apabila kuburan-kuburan dibongkar,”Maknanya: orang-orang mati yang berada di dalamnya dikeluarkan sehingga mereka bangun untuk Allah ‘Azza Wa Jalla."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 4: 1-4. Surat ini dimulai dengan keimanan, dimana Allah bersumpah dengan langit yang apabila telah terbelah dan berubah aturan (dari yang semestinya). Allah juga bersumpah dengan bintang-bintang yang apabila berjatuhan dan berserakan. Allah juga bersumpah dengan lautan yang meluap satu sama lain dan kemudian (terkumpul) menjadi lautan yang satu, dan bercampur air (dari laut) yang tawar dengan yang asin. Allah juga bersumpah dengan kuburan yang apabila dihamburkan dan dibangkitkan (mayit) di dalamnya untuk berkumpul di padang masyhar"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 4",
    "description": "1-4. Ada empat peristiwa besar pada hari kiamat yang disebutkan di bagian awal surah ini, dari ayat 1 s. D. 4. Dua peristiwa yang pertama terjadi di langit dan sisanya di bumi. Apabila langit yang demikian besar dan kukuh terbelah, retak, kemudian digulung. Dan apabila bintang-bintang jatuh berserakan, keluar dari garis edarnya, dan berhamburan secara acak akibat hilangnya gaya tarik-menarik antar-benda angkasa. Dan apabila lautan dijadikan meluap, di mana batas antara satu laut dengan lainnya terbelah dan hancur sehingga air meluap. Air tawar dan asin pun menyatu, berkumpul menjadi lautan raksasa tak bertepi. Dan apabila kuburan-kuburan dibongkar sehingga mayat-mayat yang ada di dalamnya hidup kembali lalu berhamburan keluar tak tentu arah. 5. Maka pada saat itulah setiap jiwa akan mengetahui secara rinci amal baik atau buruk apa saja yang telah dikerjakan olehnya di dunia dan apa yang dilalaikan-Nya. Dia kemudian akan mendapat balasan atas perbuatannya tersebut."
  }
]