[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-5. Apabila langit pecah dan tatanannya rusak. Dan apabila bintang-bintang berjatuhan. Dan apabila lautan, Allah menghantamkan sebagian darinya dengan sebagian lainnya sehingga airnya lenyap, Dan apabila kuburan-kuburan dibalik dengan di bangkitkannya penghuninya, Saat itu setiap jiwa mengetahui seluruh amalnya,apa yang dia kerjakan dan apa yang dia lakukan, semuanya akan di balas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Pada saat itu setiap jiwa mengetahui perbuatan yang telah dilakukannya dan yang telah dilalaikannya karena tidak mengamalkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. عَلِمَتْ نَفْسٌ مَّا قَدَّمَتْ وَأَخَّرَتْ (maka tiap-tiap jiwa akan mengetahui apa yang telah dikerjakan dan yang dilalaikannya) Yakni setiap orang mengetahui kebaikan atau keburukan yang telah dilakukan dan yang ditinggalkan setelah kitab catatan amal dibagikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Maka waktu itu setiap jiwa tahu tentang perbuatan-perbuatannya yang telah lalu, dan balasan apa yang akan dia dapatkan. Karena amal mereka kurang hanya karena bermalas-malasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{setiap jiwa akan mengetahui apa yang telah dikerjakan dan yang dilalaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-5 Maksudnya, bila langit runtuh dan terbelah, bintang-bintangnya berhamburan, hilang keindahannya, laut-laut meluap hingga menjadi satu lautan, kuburan terbongkar mengeluarkan semua mayat yang ada di dalamnya untuk dikumpulkan di tempat pemberhentian di hadapan Allah untuk pembalasan amal perbuatan, pada hari itu penutup tersingkap, sesuatu yang samar menjadi nyata, dan setiap jiwa mengetahui setiap keberuntungan atau kerugian yang menyertainya. Di sana, orang zhalim menggigit jari pada saat melihat perbuatan yang telah dilakukannya dan yakin akan mendapatkan kesengsaraan abadi dan siksaan selamanya. Di sana, (sebaliknya) orang bertakwa yang melakukan amal baik mendapatkan kemenangan besar, kenikmatan abadi, dan selamat dari siksaan Neraka Jahim."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan ketika itulah setiap jiwa akan mengetahui semua perbuatan yang ia lakukan semasa hidupnya didunia, baik maupun buruknya, serta kebaikan-kebaikan yang ia lalaikan, maka setiap yang meninggal dunia pasti meninggalkan berbagai jejak kelakuan yang beragam, jika ia meniggalkan kebaikan amalan shalih maka kebaikan pula yang akan ia peroleh di akhirat nanti. Dan jikalau ia meninggalakan keburukan-keburukan, meninggalkan berbagai macam jenis kekufuran dan kesesatan, proyek-proyek yang melanggar syariat islam dan menghasilkan berbagai macam kemaksiatan, maka tiada lain yang ia akan peroleh diakhirat selain balasan yang lebih buruk, maka kebaikan atau keburukan yang berlaku didunia akan mengikuti pelakunya sampai hari akhir nanti. Oleh karena itu menjadi sebuah motifasi bagi setiap hamba agar memperbanyak amalan kebaikan didunia agar apa yang ia tinggalkan setelah wafatnya adalah jejak dan kenangan yang penuh dengan kebaikan yang bermanfaat bagi dirinya juga bagi orang lain, Rasululah ﷺ bersabda : (( عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَالَ: \" إِذَا مَاتَ ابْنُ آدَمَ اِنْقَطَعَ عَمَلُهُ إِلَّا مِنْ ثَلَاثٍ: صَدَقَةٍ جَارِيَةٍ، وَعِلْمٍ يُنْتَفَعُ بِهِ، وَوَلَدٍ صَالِحٍ يَدْعُو لَهُ )) \"Dari Abu Hurairah, sesungguhnya Rasulullah Saw bersabda : “ Di mana anak Adam mati maka terputuslah amalannya kecuali 3 perkara : sedekah jariyah, ilmu yang bermanfaat dan anak shalih yang mendoakan orangtuanya\". Anak-anak yang sholeh yang ditinggal orangtuanya mereka meninggalkan kebaikan bagi anak-anak mereka, dan bagi mereka adalah pahala yang terus mengalir dari perbuatan anak-anak mereka. Maka orang-orang yang meninggalkan segala kebaikan pada orang lain dan mereka pun melakukan sebagaimana yang yang pernah dilakukan oleh orang meninggalk tersebut bagi mereka pahala yang terus mengalir walaupun mereka itu didalam kubur menyendiri dan kebaikan itu akan peroleh pula pada hari yang Allah janjikan. Sedangkan mereka yang semasa hidupnya banyak melakukan keburukan dan kemaksiatan, dan kemaksiatan itu kembali dilakukan oleh orang lain sepeninggalnya, maka sesungguhnya keburukan itu akan terus mengalir kepadanya walaupun setelah ia mati, Allah berfirman : { إِنَّا نَحْنُ نُحْيِي الْمَوْتَىٰ وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ } ( seungguhnya Kami menghidupkan orang-orang mati dan Kami menuliskan apa yang telah mereka kerjakan dan bekas-bekas yang mereka tinggalkan ) [ Yaa Siin : 12 ] . Kebaikan-kebaikan mereka dituliskan begitu pula yang mereka tinggalkan. { عَلِمَتْ نَفْسٌ مَا قَدَّمَتْ وَأَخَّرَتْ } inilah hasil yang akan diperoleh setiap manusia dari kehidupannya didunia, dan pada hari kebangkitan itu setiap mereka akan mengetahui nasib diri mereka masing-masing, apakah mereka akan menjadi hamba yang bahagia ataukah mereka akan menjadi orang yang sengsara, semua itu terhgantung dari amalan shalih mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Apabila empat kejadian ini terjadi maka عَلِمَتْ نَفْسٌ مَا قَدَّمَتْ وَأَخَّرَتْ “maka tiap-tiap jiwa akan mengetahui apa yang telah dikerjakan dan yang dilalaikannya.” Kata نَفْسٌ di sini dalam bentuk nakirah namun bermakna umum, sehingga maknanya: Setiap jiwa akan tahu apa yang telah perbuat dan yang ia tunda, yaitu dengan ditunjukkan catatan amalan kepadanya. Semua insan akan Allah tetapkan segala perbuatannya di lehernya, dan akan dikeluarkan di hari kiamat dalam bentuk buku catatan yang dihadirkan terbuka di hadapannya, bacalah buku catatan perbuatanmu, cukup itu sabagai perhitungan pada hari ini untuk dirimu. Pada hari itu orang-orang jahat akan mengatakan: Ada apa pada buku ini, tidak ada yang luput sesuatu yang kecil maupun yang besar melainkan sudah tercatat di dalamnya, maka setiap insan akan menyadari apa yang telah ia lakukan dan yang ia tunda. Saat ia di dunia telah melupakannya, tapi di hari kiamat akan dipampangkan amalannya, sehingga setiap jiwa akan tahu apa yang telah ia lakukan dan ia tunda, tujuannya di sini adalah peringatan agar menjauhi perbuatan yang menyelisihi Allah dan rasul-Nya, karena ia akan tahu itu semua dan akan dihisab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 5: Kemudian Allah datangkan jawaban bagi sumpah-sumpah (pada ayat sebelumnya), dimana Allah mengkabarkan pada hari itu akan mengetahui setiap jiwa atas apa yang telah mereka perbuat dahulu dari kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika itu segala tutupan terbuka dan tampak segala sesuatu yang tersembunyi, dan setiap jiwa mengetahui apa yang akan diperolehnya berupa keuntungan atau kerugian. Ketika itu, orang kafir menggigit tangannya saat melihat amalnya sia-sia, timbangan kebaikannya sedikit, keburukan dihadapkan kepadanya dan mengetahui bahwa ia akan mendapatkan kesengsaraan yang kekal dan azab selama-lamanya. Dan ketika itu, orang-orang yang bertakwa mendapatkan keberuntungan, memperoleh kenikmatan yang kekal dan keselataman dari azab neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 5",
    "description": "Maka pada saat itulah setiap jiwa akan mengetahui secara rinci amal baik atau buruk apa saja yang telah dikerjakan olehnya di dunia dan apa yang dilalaikan-Nya. Dia kemudian akan mendapat balasan atas perbuatannya tersebut. 6. Malaikat menyeru penuh heran, 'wahai manusia! apakah yang telah memperdayakan kamu sehingga berbuat durhaka terhadap tuhanmu yang mahamulia, padahal dialah yang telah menciptakanmu, memeliharamu, mendidikmu, dan menjadikanmu makhluk terbaik''"
  }
]