[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Wahai manusia yang mengingkari kebangkitan,apa yang membuatmu tertipu terhadap tuhan yang maha pemurah,pemilik kebaikan melimpah,yang berhak ditaati dan disyukuri? Bukankah Dia yang telah menciptakanmu dan membaguskan penciptaanmu lalu dia menyempurnakannya. Dan menyusun tubuhmu untuk menunaikan tugas tugasmu? Dia maha kuasa untuk menciptakan kalian dalam bentuk apa pun yang dia kehendaki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Yang telah mengadakan dirimu yang sebelumnya kamu tidak ada. Dan menjadikanmu dengan tubuh yang sempurna dan seimbang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. الَّذِى خَلَقَكَ (Yang telah menciptakan kamu) Yakni menciptakan kamu dari air mani, sedangkan ketika itu kamu belum menjadi makhluk apapun. فَسَوَّىٰكَ(lalu menyempurnakan kejadianmu) Sehingga kamu menjadi orang yang dapat mendengar, melihat, dan berfikir. فَعَدَلَكَ(dan menjadikan (susunan tubuh)mu seimbang) Yakni menjadikan tubuhmu serasi, memiliki bentuk yang indah, dan menjadikan anggota badanmu sesuai."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "6-7 1) Salah seorang dosen disalah satu universitas berkata : suatu ketika seorang mahasiswa yang berdarah perancis berkata kepadaku \"ketika aku mendengar firman Allah : { يَا أَيُّهَا الْإِنْسَانُ } aku terkejut dengan keagungan, dan keilmuan, serta kekuasaan pemilik firman ini, sehingga aku yakin bahwa ucapan ini bukan dari lisan manusia, dari titik inilah berawal ketertarikan aku dengan islam. 2) Dalam ayat disebutkan { بِرَبِّكَ } dan bukan { بالله } dalam firmannya Allah mengatakan { يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ } , pada hakikatnya lafazh ini mengandung makna dari beberapa makna الملك yang sesuai dengan peringatan kepada manusia perihal nikmat Allah kepadanya, dan peringatan akan hak Allah dalam ketaatan manusia kepada-Nya. 3) Alihkanlah pandangan mata kepada diri anda, dan perhatikanlah bagaimana Allah menciptakan tubuh ini dengan begitu sempurna, Dia menempatkan anggota-anggota tubuh ini pada tempatnya yang tepat, dan telah mengatur kegunaannya masing-masing, kemudian perhatikanlah firman Allah : { يَا أَيُّهَا الْإِنْسَانُ مَا غَرَّكَ بِرَبِّكَ الْكَرِيمِ , الَّذِي خَلَقَكَ فَسَوَّاكَ فَعَدَلَكَ } ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Wahai manusia, apa yang memperdayamu sehingga engkau bermaksiat kepada Tuhanmu? Diriwayatkan dari Ibnu Abi Hatim ketika bertamu kepada Abu bin Khalaf. Allah-lah yang membuatmu ada, yang menjadikan anggota tubuhmu lengkap sempurna dan berfungsi sempurna, sehingga engkau menjadi seimbang, dan ciptaan yang proporsional."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang telah menciptakanmu lalu menyempurnakan penciptaanmu} menjadikanmu sempurna dan sehat {dan menjadikanmu seimbang} menjadikanmu berdiri tegak dan memiliki badan yang sesuai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-8 Allah berfirman mencela manusia yang tidak menunaikan kewajiban semestinya dan berani menerjang kemaksiatan-kemaksiatan, “Hai manusia, apakah yang telah memberdayakan kamu (berbuat durhaka) terhaadap Rabbmu Yang Maha Pemurah?” Apakah karena ketidakpedulianmu pada kewajiban-kewajibanNya, ataukah karena kalian menghina azabNya, ataukah karena kamu tidak beriman akan balasanNya? Bukankah Dia “Yang telah menciptakan kamu lalu menyempurnakan kejadiannmu” dalam bentuk yang paling sempurna, “dan menjadikan (susunan tubuh)mu seimbang,” dan menyusunmu secara rapi, tegak, dan lurus dalam bentuk yang paling sempurna dan indah? Lantas apakah kamu pantas mengkufuri nikmat dari Dzat yang memberi, ataukah karena kamu mengingkari kebaikan Dzat yang berbuat baik? Semua itu tidak lain adalah karena kebodohan, kezhaliman, dan pembangkanganmu. Bersyukkurlah pada Allah, karena tidak membuat wujudmu seperti bentuk anjing, keledai atau binatang lainnya. Karena itu Allah berfirman, “Dalam bentuk apa saja yang Dia kehendaki, Dia menyusun tubuhmu.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ الَّذِي خَلَقَكَ } Dialah Allah tuhanmu yang telah menciptakan kamu dari tidak ada menjadi ada, dengan kuasanya lah kamu diletakkan di rahim ibumu dari tetesan mani, maka selain dengan kuasa-Nya kamu tidak diciptakan, lalu bagaimana mungkin kamu berpaling dari penghamabaan kepada-Nya ? apakah patung-patung berhala itu juga kuburan-kuburan yang kalian sembah itulah yang menciptakan kalin ? sama sekali itu adalah mustahil, bahkan mereka juga seperti kalian yang diciptakan, dan boleh jadi mereka lebih lemah dari kalian , maka sesungguhnya tiada pencipta selain Allah ﷻ, celakalah kamu yang telah mendustakan-Nya, dan berbuat kufur kepada-Nya. { فَسَوَّاكَ } Kemudian Dia meyempurnakan penciptaanmu dan menjadikannya dalam bentuk yang terbaik, Dia melengkapi anggota tubuhmu dan menjadikan susunan tubuhmu itu seimbang, kemudian dengan anggota tubuhmu itu kamu dapat berdiri dan berjalan dengan seimbang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "الَّذِي خَلَقَكَ : Menciptakanmu dari ketiadaan, mengadakanmu dari ketiadaan, فَسَوَّاكَ : Menjadikan perawakanmu seimbang, panjang kedua tangan tidak berbeda, panjang kedua kaki tidak berbeda, panjang jari jemari seimbang, menyesuaikan kedua tangan dan kaki, anda akan dapati yang panjang tangannya, tangan yang sebelahnya akan sama panjang, yang pendek pun demikian, dan begitu seterusnya. Allah ‘Azza Wa Jalla menjadikannya seimbang dari segala sisi, dari sisi bentuk tubuh: فَعَدَلَكَ “menjadikan (susunan tubuh) mu seimbang,” Dalam cara baca qiro’ah sab’ah: فَعَدَّلَكَ Maknanya: Menjadikanmu memiliki perawakan seimbang, tubuh yang ideal, tidak seperti hewan-hewan ternak yang tidak seimbang, yang berjalan dengan kedua tangan dan kakinya, sedangkan manusia Allah berikan keistimewaan ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 7: 6-8. Kemudian Allah peringatkan manusia-manusia yang mengingkari akan hari kebangkitan dan Ia berkata : Wahai manusia ! Atas dasar apa engkau mengkhianati dan engkau berani bermaksiat kepada Rabbmu Yang Maha Agung. Yang Ia telah memberikan nikmat kepadamu secara nyata dan menciptakanmu dan menjadikanmu sesempurna-sempurnanya makhluk. Allah jadikan engkau dengan bentuk paling indah dan Allah susun (dirimu) dengan wujud (manusia) dengan sebaik-baik bentuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sedangkan kamu sebelumnya tidak ada. Sehingga anggota badanmu sempurna; tanpa cacat. Misalnya tangan yang satu tidak lebih panjang daripada tangan yang lain, demikian pula kaki yang satu tidak lebih panjang daripada yang lain. Jika demikian, apakah pantas bagimu mengkufuri nikmat Allah yang telah memberikan berbagai nikmat kepadamu dan mengingkari kebaikan-Nya? Itu tidak lain karena kebodohanmu, kezalimanmu, sikapmu yang keras kepala dan tindakanmu yang tidak dipikirkan lebih dahulu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 7",
    "description": "Mengapa kamu ingkar kepada tuhan yang telah menciptakanmu dari tiada dalam ukuran yang tepat, lalu dia menyempurnakan kejadianmu dengan anggota-anggota tubuh, dan dia menjadikan susunan tubuh-Mu seimbang'8. Dalam bentuk apa saja yang dikehendaki, dia menyusun tubuhmu dengan sempurna. Tidak ada manusia yang sama persis dengan lainnya. Karena mempunyai bentuk tubuh yang sempurna, semestinya manusia bersyukur kepada Allah dan tidak bermaksiat bahkan menyekutukannya."
  }
]