[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8. Wahai manusia yang mengingkari kebangkitan,apa yang membuatmu tertipu terhadap tuhan yang maha pemurah,pemilik kebaikan melimpah,yang berhak ditaati dan disyukuri? Bukankah Dia yang telah menciptakanmu dan membaguskan penciptaanmu lalu dia menyempurnakannya. Dan menyusun tubuhmu untuk menunaikan tugas tugasmu? Dia maha kuasa untuk menciptakan kalian dalam bentuk apa pun yang dia kehendaki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dalam bentuk apa saja yang Allah kehendaki untuk menciptakanmu, Allah telah menciptakanmu. Dia telah memberikan kenikmatan kepadamu ketika Dia tidak menciptakanmu dalam bentuk keledai, kera, anjing maupun bentuk lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فِىٓ أَىِّ صُورَةٍ مَّا شَآءَ رَكَّبَكَ (dalam bentuk apa saja yang Dia kehendaki, Dia menyusun tubuhmu) Yakni Allah menyusunmu dengan rupa yang Allah kehendaki dari segala rupa yang ada, dan kamu tidak perlu memilih rupa bagi dirimu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dialah yang telah membentuk dan menyusunmu sekehendak-Nya dengan bentuk yang paling menakjubkan dan seimbang tanpa memilah-milah bentuk untukmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dalam bentuk apa saja yang dikehendaki, Dia menyusunmu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 6-8 Allah berfirman mencela manusia yang tidak menunaikan kewajiban semestinya dan berani menerjang kemaksiatan-kemaksiatan, “Hai manusia, apakah yang telah memberdayakan kamu (berbuat durhaka) terhaadap Rabbmu Yang Maha Pemurah?” Apakah karena ketidakpedulianmu pada kewajiban-kewajibanNya, ataukah karena kalian menghina azabNya, ataukah karena kamu tidak beriman akan balasanNya? Bukankah Dia “Yang telah menciptakan kamu lalu menyempurnakan kejadiannmu” dalam bentuk yang paling sempurna, “dan menjadikan (susunan tubuh)mu seimbang,” dan menyusunmu secara rapi, tegak, dan lurus dalam bentuk yang paling sempurna dan indah? Lantas apakah kamu pantas mengkufuri nikmat dari Dzat yang memberi, ataukah karena kamu mengingkari kebaikan Dzat yang berbuat baik? Semua itu tidak lain adalah karena kebodohan, kezhaliman, dan pembangkanganmu. Bersyukkurlah pada Allah, karena tidak membuat wujudmu seperti bentuk anjing, keledai atau binatang lainnya. Karena itu Allah berfirman, “Dalam bentuk apa saja yang Dia kehendaki, Dia menyusun tubuhmu.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dalam bentuk apapun kamu diciptakan yang Allah kehendaki dia akan melakukannya, dan kamu telah mendapati dirimu dalam rupa yang indah, karena sesungguhnya penciptaan manusia lah seindah-indahnya penciptaan, tidak kamu perhatikan bagaimana Allah menciptakan kamu dengan rupa yang indah dan tidak menjadikan rupamu itu seperti seekor kera, tidak pula seperti anjing dan babi, yang semua itu bagi kalian adalah rupa yang hina, dan pada hakikatnya Allah bisa menciptakan kalian dengan rupa yang hina itu, akan tetapi denga kasih sayang Allah ﷻ, Dia menganugerahkan kepada kalian rupa yang indah itu, adalah merupakan sebaik-baiknya bentuk penciptaan diantara seluruh makhluk dimuka bumi. Dan rupa manusia itu berbeda-beda : ada yang cantik dan gagah, dan ada pula yang buruk, diantara mereka ada yang tinggi, dan ada juga yang pendek, dan perbedaan warna kulit juga dapat kalian temukan diantara manusia itu sendiri bahkan banyak. Semua perbedaan ini adalah bukti kekuasaan Allah sang pencipta, Allah berfirman : { وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَاخْتِلَافُ أَلْسِنَتِكُمْ وَأَلْوَانِكُمْ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِلْعَالِمِينَ } ( Dan di antara tanda-tanda kekuasaan-Nya ialah menciptakan langit dan bumi dan berlain-lainan bahasamu dan warna kulitmu. Sesungguhnya pada yang demikan itu benar-benar terdapat tanda-tanda bagi orang-orang yang mengetahui. ) [ Ar-Rum : 22 ]. Allah ﷻ menciptakan manusia dengan berbagai perbedaan rupa diantara mereka, padahal mereka itu pada hakikatnya diciptakan dari asal yang sama, dari bapak dan ibu yang sama, yaitu dari Adam dan Hawa', kemudian Allah menjadikan diantara mereka itu perbedaan yang cukup banyak, mereka berbeda dari segi pemikiran, ilmu, dan ketampanan wajah, mereka juga berbeda pada warna kulit dan bahasa, itulah tanda-tanda kekuasaan Allah ﷻ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فِي أَيِّ صُورَةٍ مَا شَاءَ رَكَّبَكَ “dalam bentuk apa saja yang Dia kehendaki, Dia menyusun tubuh-mu.” Yakni: Allah membentukmu dalam bentuk yang Dia kehendaki. Ada orang yang rupawan, ada yang tidak rupawan, ada yang biasa-biasa saja, ada yang berkulit putih ada yang berkulit merah, ada yang berkulit hitam, ada yang pertengahan, Allah membentuk dengan bentuk yang sesuai dengan kehendak-Nya, tetapi Allah menjadikan manusia dalam bentuk terbaik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 8: 6-8. Kemudian Allah peringatkan manusia-manusia yang mengingkari akan hari kebangkitan dan Ia berkata : Wahai manusia ! Atas dasar apa engkau mengkhianati dan engkau berani bermaksiat kepada Rabbmu Yang Maha Agung. Yang Ia telah memberikan nikmat kepadamu secara nyata dan menciptakanmu dan menjadikanmu sesempurna-sempurnanya makhluk. Allah jadikan engkau dengan bentuk paling indah dan Allah susun (dirimu) dengan wujud (manusia) dengan sebaik-baik bentuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, pujilah Allah yang tidak menjadikan rupamu seperti rupa keledai atau hewan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 8",
    "description": "Dalam bentuk apa saja yang dikehendaki, dia menyusun tubuhmu dengan sempurna. Tidak ada manusia yang sama persis dengan lainnya. Karena mempunyai bentuk tubuh yang sempurna, semestinya manusia bersyukur kepada Allah dan tidak bermaksiat bahkan menyekutukannya. 9. Sekali-kali jangan begitu; janganlah kamu berbuat durhaka! bahkan kamu mendustakan hari pembalasan meski bukti-bukti yang menerangkan keniscayaannya telah kamu saksikan dengan nyata."
  }
]