[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-12. Perkaranya bukan sebagaimana yang kalian ucapkan,bahwa kalian berhak menyembah selain Allah,sebaliknya kalian mendustakan hisab dan pembalasan. Sesungguhnya terhadap kalian ada para malaikat pengawas, Malaikat yang mulia disisi Allah yang mencatat apa yang mereka ditugaskan untuk mencatatnya, tidak ada sedikitpun dari amal amal kalian yang terlewat kan bagi mereka,mereka mengetahui apa yang kalian lakukan,yang baik maupun yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Urusannya bukan sebagaimana yang kalian bayangkan -wahai orang yang terpedaya-, akan tetapi kalian mendustakan adanya Hari Pembalasan sehingga kalian tidak mempersiapkan diri untuk menghadapinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-12. Hai orang-orang yang tertipu, hati-hatilah kalian dari setan; sungguh kalian tidak berada dalam kebenaran, namun kalian adalah orang-orang yang mendustakan hari perhitungan. Dan kalian memiliki para malaikat yang mengawasi dan mencatat perbuatan kalian, mereka adalah makhluk yang mulia dan amanah dalam mencatat amal perbuatan kalian, mereka mengetahui segala perbuatan kalian yang kalian lakukan secara rahasia atau terang-terangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. كَلَّا (Bukan hanya durhaka saja) Ini merupakan peringatan agar tidak terperdaya oleh kemurahan Allah sehingga menjadikannya sebab kekafiran. بَلْ تُكَذِّبُونَ بِالدِّينِ (bahkan kamu mendustakan hari pembalasan) Yakni hari pembalasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Jangan seperti itu! Ungkapan untuk mencegah pendustaan terhadap kemuliaan Allah. Namun! Ungkapan untuk penanda perubahan topik ke topik lain. Kalian semua telah mendustakan hari perhitungan, dan pembalasan akhirat terhadap segala perbuatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali begitu. Bahkan, kamu mendustakan hari pembalasan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 9-12 Allah berfirman, “Bukan hanya durhaka saja, bahkan kamu mendustakan Hari Pembalasan,” maksudnya, meski dengan nasihat dan peringatan ini, kalian tetap saja mendustakan Hari Pembalasan dan kalian pasti akan dihisab atas apa pun yang kalian lakukan. Allah menugaskan para malaikat mulia untukmu, mereka mencatat perkataan dan perbuatanmu dan mereka mengetahuinya. Termasuk dalam hal ini adalah aktivitas hati dan anggota badan. Selayaknya kalian memuliakan dan menghormati mereka."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Perkara yag membawa manusia pada kekufuran dan penolakan terhadap keimanan, justru membuat mereka mendustakan agama Allah, mereka juga mengingkari adanya hari kebangkitan dan hari pembalasan, sebagaimana yang dikatakan orang-orang musyrik, dan Allah mengabdikan perkataan mereka dalam Al-Qur'an : { وَقَالُوا إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ } ( Dan tentu mereka akan mengatakan (pula): “Hidup hanyalah kehidupan kita di dunia ini saja, dan kita sekali-sekali tidak akan dibangkitkan”. ) [ Al-An'am : 29 ] orang-orang kafir menyangkal akan adanya hari kebangkitan, mereka mengatakan : itu tidak mungkin akan terjadi, dan sesungguhnya manusia jika telah menjadi mayat didalam kuburnya maka tidak akan hidup lagi selamanya. Bukankah Dia yang menciptakan manusia mampu membangkitkan mereka kembali ? dalam pandangan yang sering di gunangan oleh orang-orang yang berakal : bahwasanya sesuatu yang diadakan kembali lebih mudah daripada mewujudkannya pertama kali, dan Allah mengatakan : { وَهُوَ الَّذِي يَبْدَأُ الْخَلْقَ ثُمَّ يُعِيدُهُ وَهُوَ أَهْوَنُ عَلَيْهِ ۚ وَلَهُ الْمَثَلُ الْأَعْلَىٰ فِي السَّمَاوَاتِ وَالْأَرْضِ } ( Dan Dialah yang menciptakan (manusia) dari permulaan, kemudian mengembalikan (menghidupkan)nya kembali, dan menghidupkan kembali itu adalah lebih mudah bagi-Nya. Dan bagi-Nya-lah sifat yang Maha Tinggi di langit dan di bumi; ) [ Ar Rum : 27 ] segala sesuatu adalah sangat kecil bagi-Nya, Allah juga berfirman : { وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ ۖ قَالَ مَنْ يُحْيِي الْعِظَامَ وَهِيَ رَمِيمٌ , قُلْ يُحْيِيهَا الَّذِي أَنْشَأَهَا أَوَّلَ مَرَّةٍ ۖ وَهُوَ بِكُلِّ خَلْقٍ عَلِيمٌ } [ Yaa Siin : 78-79 ] Dia berkuasa diatas segala sesuatu, kenapa kalian tidak memikirkan hal ini lebih awal, dan pada akhirnya kalian menyangkal ? bahkan kalian mendustakan Allah ﷺ, juga mendustakan Rasul-Nya dalam perkara kebangkitan manusia setelah kematian. { كَلَّا بَلْ تُكَذِّبُونَ بِالدِّينِ } maksud dari الدين dalam ayat ini adalah : hari pembalasan, jikalau sekiranya manusia mau membanyangkan dan menyadari bahwa mereka akan dihisab atas semua yang telah mereka lakukan niscaya mereka akan mempersiapkan diri mereka dengan sebaik-baiknya, akan tetapi mereka melupakan hal itu, maka Allah berfirman : { إِنَّ الَّذِينَ يَضِلُّونَ عَنْ سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ } ( Sesungguhnya orang-orang yang sesat darin jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan. ) [ Shad : 26 ], mereka mendustakan hari perhitungan, oleh karena itu mereka bebas melakukan apa saja yang mereka inginkan, mereka melalaikan dan meremehkan perintah Allah, mereka melakukan segala kejahatan dan kemaksiatan serta kesyirikan dan kekufuran, karena mera tidak pernah membayangkan bahwa mereka akan dihisab di hari kiamat kelak, mereka mengira bahwa perbuatan mereka akan dilupakan dan diabaikan, sungguh mereka itu berada dalam kebinasaan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا بَلْ تُكَذِّبُونَ بِالدِّينِ :” Bukan hanya durhaka saja, bahkan kamu mendustakan hari pembalasan.” كَلَّا : Untuk mengungkapkan penentangan. Maksudnya, walau pun telah diciptakan dengan demikian bagus dan diluaskan kenikmatan, kalian tetap mendustakan ad-diin [agama] maksudnya: hari pembalasan, kalian mengatakan: إِنْ هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا نَحْنُ بِمَبْعُوثِينَ “kehidupan itu tidak lain hanyalah kehidupan kita di dunia ini, kita mati dan kita hidup dan sekali-kali tidak akan dibangkitkan lagi,”(QS. Al-Mu’minun: 37) Mendustakan hari pembalasan, atau maksudnya bisa juga mendustakan agama itu sendiri. Kalian tidak mengikrarkan agama yang datang dari para rasul, ayat ini mencakup kedua makna tersebut, karena dalam kaedah tafsir dan ilmu syarah hadits: Bahwa apa bila ada nash yang memiliki dua kemungkinan makna maka itu tidak saling menafikan namin keduanya bisa diterapkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Infitar ayat 9: Kemudian Allah peringatkan mereka (orang-orang musyrik), Ia berkata : Silahkan kalian ingkari wahai para pendusta ! Atas apa yang terkait dengan hari kebangkitan dengan cara (kalian) membantah Nabi ﷺ (utusan Ku) dan dengan cara memeranginya. Ia (para Nabi) tidak akan pernah berkhianat (dan) Allah akan bersabar dengan sikap kalian. Karena sesungguhnya kalian telah mendustakan hari perhitungan, hari pembalasan dan hari kebangkitan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni meskipun kamu sudah dinasihati dan diingatkan berkali-kali, namun kamu masih saja mendustakan hari pembalasan. Padahal amal kamu pasti akan dihisab, dan Allah Subhaanahu wa Ta'aala telah mengangkat para malaikat yang mulia yang mencatat ucapan dan amalmu; mereka mengetahui apa yang kamu kerjakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Infitar Ayat 9",
    "description": "Sekali-kali jangan begitu; janganlah kamu berbuat durhaka! bahkan kamu mendustakan hari pembalasan meski bukti-bukti yang menerangkan keniscayaannya telah kamu saksikan dengan nyata. 10. Dan mengapa kamu mendustakan hari pembalasan, padahal sesungguhnya bagi kamu ada para malaikat yang mengawasi semua perbuatanmu."
  }
]