[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami menurunkan al-qu’an dimalam yang mulia dan utama, yaitu salah satu malam dibulan Ramadhan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Sesungguhnya Kami menurunkan Al-Qur`ān sekaligus ke langit dunia sebagaimana kami mulai menurunkannya kepada Nabi -ṣallallāhu 'alaihi wa sallam- pada malam Lailatul Qadar di bulan Ramadan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Kami -dengan keagungan dan kekuasaan Kami yang sempurna-menurunkan al-Qur’an pada malam lailatul qadar. Allah menurunkannya ke langit dunia sekaligus dari lauhul mahfuzh pada malam itu. Malam lailatul qadar merupakan malam dimulainya penurunan al-Qur’an, malam ini memiliki kemuliaan dan keutamaan karena mengandung banyak keberkahan, malam ini terdapat pada bulan Ramadhan, sesuai dengan firman Allah: شَهْرُ رَمَضَانَ ٱلَّذِىٓ أُنزِلَ فِيهِ ٱلْقُرْءَانُ Bulan Ramadhan, bulan yang di dalamnya diturunkan (permulaan) Al Quran… (al-Baqarah: 185). Dan apa yang kamu ketahui tentang lailatul qadar? Itu adalah malam yang lebih baik daripada masa seribu bulan, karena pada malam itulah al-Qur’an diturunkan, terdapat berbagai amal shalih, dan pahala yang dilipatgandakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. إِنَّآ أَنزَلْنٰهُ فِى لَيْلَةِ الْقَدْرِ (Sesungguhnya Kami telah menurunkannya (Al Quran) pada malam kemuliaan) Yakni al-Qur’an diturunkan sekaligus dari lauhul mahfuzh pada malam lailatul qadar ke langit dunia, kemudian diturunkan kepada nabi setahap demi setahap sesuai kebutuhan dalam kurun 23 tahun. Malam lailatul qadar adalah salah satu malam dari sepuluh malam terakhir bulan Ramadhan, dan terdapat banyak hadits yang berbeda-beda dalam penentuan malam lailatul qadar tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Diantara tanda keagungan al-Qur'an ada tiga sisi yang disebutkan dalam surah ini : a. Kata kerja yang berarti diturunkan dalam surah ini hanya dinisbatkan kepadanya ( al- Qur'an ) tanpa adanya penisbatan kepada selainnya. b. Bahwasanya penyebutan al-Qur'an dalam surah ini dengan dhomir ( kata ganti ), adalah merupakan bukti akan kepastian makna yang terkandung didalamnya. c. Dan kemuliaan waktu yang didalamnya al-Qur'an ini diturunkan. 2 ) . Betapa banyak nyawa kaum muslimin telah pergi padahal mereka adalah jiwa-jiwa yang rindu akan bertemu dengan malam yang dimuliakan oleh Allah ini ! bukankah didalamnya sebaik-baik ucapan itu diturunkan ? dan bukankah Allah menjadikan malam ini lebih baik dari masa seribu bulan lamanya ? dan tidakkah dalam satu malam ini para Malaikat yang mulia turun dengan membawa rahmat Allah ? sungguh orang-orang yang bertemu dengan malam ini adalah orang-orang yang paling beruntung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Sesungguhnya kami telah menurunkan Al-Qur’an. Awal turunnya Al-qur’an adalah di malam yang agung dan penuh kemuliaan di antara malam-malam bulan Ramadhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menurunkannya} sesungguhnya Kami telah menurunkan Al-Qur’an dalam satu jumlah dari Lauhil Mahfudz ke langit bumi {pada Lailatul qadar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman menjelaskan keutamaan al-Quran dan tingginya derajat al-Quran. “Sesungguhnya Kami telah menurunkannya (al-Quran) pada malam kemuliaan.” Hal itu karena Allah mulai menurunkan al-Quran di bulan Ramadhan pada malam qadar, dengannya Allah merahmati seluruh hamba secara umum yang tidak mampu dihargai oleh manusia. Disebut malam qadar karena agungnya kemuliaan malam itu dan keutamaannya di sisi Allah, karena pada malam itu Allah menentukan ajal, rizki, dan ketentuan-ketentuan takdir selama satu tahun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Melalui surah ini Allah ﷻ mengabarkan tentang waktu diturunkannya Al-Qur'an \" Allah ﷻ berfirman : { إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ } { إِنَّا } Sesungguhnya kami, kata ganti kami kembali kepada Allah , Allah ﷻ menyebut dirinya dengan menggunakan kata ganti jamak, padalah Dia ﷻ adalah satu, akan tetapi maksud dari penggunaan kata ganti jamak dalah pengagungan, dan Allah ﷻ berhk untuk menyandangnya. { أَنْزَلْنَاهُ } Kami telah menurunkannya, yakni Al-Qur'an, { أَنْزَلْنَاهُ } kami telah menurunkan Al-Qur'an melalui perantara Jibril pemegang kepercayaan untuk membawa wahyu Allah kepada Rasul-Nya Muhammad ﷺ , dan ini merupakan dalil bahwasanya Al-Qur'an itu diturunkan dari Tuhan semsta alam Allah ﷻ , dan Al-Qur'an bukan makhluk, seperti yang dikatakan oleh golongan \"jahmiyah\" . Jahmiyah mengatakan : Al-Qur'an adalah makhluk, baik lafazh maupun maknanya, karena mereka tidak mengimani bahwa Allah ﷻ berbicara . { فِي لَيْلَةِ الْقَدْرِ } Kami telah menurunkan Al-Qur'an, kapan ? yaitu pada malam lailatul qadr, diayat lain Allah mengatakan : { إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةٍ مُبَارَكَةٍ ۚ إِنَّا كُنَّا مُنْذِرِينَ , فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ , رَحْمَةً مِنْ رَبِّكَ ۚ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ } ( Sesungguhnya Kami menurunkannya pada suatu malam yang diberkahi dan sesungguhnya Kami-lah yang memberi peringatan , Pada malam itu dijelaskan segala urusan yang penuh hikmah , (yaitu) urusan yang besar dari sisi Kami. Sesungguhnya Kami adalah Yang mengutus rasul-rasul , Sebagai rahmat dari Tuhanmu. Sesungguhnya Dialah Yang Maha Mendengar lagi Maha Mengetahui, ) [ Ad-Dukhan : 3-6 ] . dalam surah ad-dukhan Allah mengatakan bahwa Al-Qur'an diturunkan pada malam yang diberkahi, akan tetapi belum menjeleskan waktu yang tepat untuk malam itu, dan pada surah ini Dia ﷻ menerangkan secara pasti bahwa malam yang diberkahi itu pada malam lailatul qadar. Allah ﷻ mengatakan : { إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ } Sesungguhnya kami telah menurunkannya ( Al-Qur'an ) pada malam lailatul qadr, yakni { فِي لَيْلَةٍ مُبَارَكَةٍ } pada suatu malam yang diberkahi, kemudian di ayat lain Allah mengatakan : { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ } ( (Beberapa hari yang ditentukan itu ialah) bulan Ramadhan, bulan yang di dalamnya diturunkan (permulaan) Al Quran ) [ Al-Baqarah : 185 ] , ayat ini menjadi penguat bahwa Al-Qur'an diturunkan di malam lailatul qadar, karena malam lailatul qadar hanya ada di bulan ramadhan. Disebut malam lailatul qadr : karena malam itu memiliki ketetapan yang agung, dan pada malam ini juga ditetapkan taqdir tahunan tiap-tiap hamba mulai dari kehidupannya sampai kematiaannya, sehat dan sakitnya, dan apapun yang akan dia hadapi dalam satu tahun kedepan, taqdir yang ditetap pada malam ini juga telah dituliskan di lauhil mahfuzh. Sebagaimana adanya taqdir umuri ( التقدير العمري ), Yaitu takdir yang diberlakukan atas manusia pada awal penciptaannya ketika pembentukan air sperma (usia empat bulan) dan bersifat umum. Takdir ini mencakup rizki, ajal, kebahagiaan, dan kesengsaraan. Hal ini didasarkan sabda Rasulullah saw. berikut ini : (( ثُمَّ يُرْسَلُ إِلَيْهِ الْمَلَكُ فَيَنْفُخُ فِيْهِ الرُّوْحَ، وَيُؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ. )) “…Kemudian Allah mengutus seorang malaikat yang diperintahkan untuk meniupkan ruhnya dan mencatat empat perkara: rizki, ajal, amal, sengsara, atau bahagia….” (HR. Bukhari dan Muslim) Kemudian ada Takdir Yaumi/harian (التقدير اليومي) . Yaitu takdir yang dikhususkan untuk semua peristiwa yang akan terjadi dalam satu hari, mulai dari penciptaan, rizki, menghidupkan, mematikan, mengampuni dosa, menghilangkan kesusahan, dan lain sebagainya. Hal ini sesuai dengan firman Allah : { يَسْأَلُهُ مَنْ فِي السَّمَاوَاتِ وَالْأَرْضِ كُلَّ يَوْمٍ هُوَ فِي شَأْنٍ } “Semua yang ada di langit dan bumi selalu meminta kepada-Nya. Setiap waktu Dia dalam kesibukan.” (QS. Ar-Rahmaan : 29) Semua macam-macam taqdir yang telah disebutkan kembali kepada taqdir 'am / taqdir azali yang telah ditetapkan di lauh mahfuzh. Dan apakah Al-Qur'an yang diturunkan pada malam lailatul qadr telam mencakup semua surah yang diturunkan kepada Nabi ﷺ ? tentu tidak, karena seperti yang diketahui bahwa Al-Qur'an diturunkan kepada Nabi ﷺ secara berangsur-angsur, yaitu selama 23 tahun masa kenabian beliau , 13 tahun di Makkah, dan 10 tahun di Kota Madinah, 23 Al-Qur'an diturunkan kepada Rasulullah ﷺ sesuai peristiwa dan kejadian-kejadian. Lalu apakah makna dari ayat ini { إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ } , bahwa Al-Qur'an diturunkan pada malam lailatul qadr, dan { شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ } bulan ramadhan yang diturunkan didalamnya Al-Qur'an ? , makananya adalah : bahwasanya permulaan diturunkannya Al-Qur'an pada bulan ramadhan di malam lailatul qadr, kemudian setelahnya diturunkan secara bertahap hingga terkengkapi seluruhnya di akhir-akhir hidup Rasulullah ﷺ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ \" Sesungguhnya Kami telah menurunkannya (Al Qur'an) pada malam kemuliaan. \" إِنَّا أَنْزَلْنَاهُ Dhamir (kata ganti: kami) di sini kembali kepada Allah 'Azza Wa Jalla, dan dhamir haa pada أَنْزَلْنَاهُ kembali kepada Al-Quran, Allah menyebut diri-Nya dengan keagungan إِنَّا أَنْزَلْنَاهُ Karena AllahSubhaanahu wa Ta'ala adalah al-Azhiim (Maha agung) tidak ada sesuatu yang lebih agung dari-Nya, dan Allah Ta'ala terkadang menyebut dirinya dengan keagungan seperti dalam mulia ini: إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ \" Sesungguhnya Kami telah menurunkannya (Al Qur'an) pada malam kemuliaan. \" dan seperti dalam firman-Nya: إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ \" Sesungguhnya Kami-lah yang menurunkan Al Qur'an, dan sesungguhnya Kami benar-benar memeliharanya.\"(QS. Al-Hijr: 9) dan seperti firman Allah Ta'ala: إِنَّا نَحْنُ نُحْيِ الْمَوْتَى وَنَكْتُبُ مَا قَدَّمُوا وَآثَارَهُمْ وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ فِي إِمَامٍ مُبِينٍ \" Sesungguhnya Kami menghidupkan orang-orang mati dan Kami menuliskan apa yang telah mereka kerjakan dan bekas-bekas yang mereka tinggalkan. Dan segala sesuatu Kami kumpulkan dalam Kitab Induk yang nyata (Lohmahfuz).\"(QS. Yasin: 12) Terkadang Allah menyebut diri-Nya dengan bentuk satu orang, seperti: إِنَّنِي أَنَا اللَّهُ لَا إِلَهَ إِلَّا أَنَا فَاعْبُدْنِي وَأَقِمِ الصَّلَاةَ لِذِكْرِي \" Sesungguhnya Aku ini adalah Allah, tidak ada Tuhan (yang hak) selain Aku, maka sembahlah Aku dan dirikanlah salat untuk mengingat Aku.\"(QS. Thaha: 14) Itu dikarenakan Allah adalah esa lagi Maha Agung, ditinjau dari sifat datang dengan dhamir keagungan dan ditinjau dari keesaan datang dengan dhamir (kata ganti) satu orang. Dan dhamir (kata ganti) dalam firman-Nya أَنْزَلْنَاهُ adalah dhamir maf'ul bih, yaitu haa. Kembali kepada al-Quran tanpa disebutkan sebelumnya. Karena ini adalah perkara yang diketahui, dan tidak ada yang menentang bahwa yang dimaksud pada ayat ini adalah turunnya al-Quran al-Karim. Allah menurunkannya di malam lailatulqadar. Apa makna diturunkan di malam lailatul qadar? Yang benar adalah bahwa maknanya: Kami memulai menurunkannya pada malam lailatulqadar di bulan ramadhan, tidak ada keraguan pada hal ini, dalilnya adalah firman Allah Ta'ala: شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ \" bulan Ramadan, bulan yang di dalamnya diturunkan (permulaan) Al Qur'an sebagai petunjuk bagi manusia dan penjelasan-penjelasan mengenai petunjuk itu dan pembeda \"(QS. Al-Baqarah: 185) maka jika dikumpulkan ayat ini شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآنُ \" bulan Ramadan, bulan yang di dalamnya diturunkan (permulaan) Al Qur'an \" dengan ayat: إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ \" Sesungguhnya Kami telah menurunkannya (Al Qur'an) pada malam kemuliaan. \" Maka terjelaskan bahwa lailatulqadar ada pada bulan ramadhan. Dengan demikian kita mengetahui bahwa yang tersebar di kalangan sebagian orang awam bahwa lailatulqadar adalah malam pertengahan bulan Sya'ban tidak ada sumbernya, dan tidak benar. Karena laialatulqadar terjadi pada bulan ramadhan. Malam tengah bulan sya.ban sama seperti malam-malam tengah bulan Rajab, Jumada, Rabii', Shafar, Muharram dan bulan-bulan lainnya, tidak ada kekhususan di dalamnya. Hingga hadits-hadits yang ada tentang keutamaan sholat malam di dalamnya adalah hadits-hadits yang lemah, yang tidak bisa menjadi hujjah, dan begitu pun hadits-hadits yang menunjukkan keistimewaan harinya, yaitu hari tengah bulan sya'ban dengan berpuasa, maka itu adalah hadits-hadits yang lemah, tidak bisa menjadi hujjah. Tetapi sebagian ulama rahimahumullah bermudah-mudah dalam menyebutkan hadits-hadits dha'if yang berkaitan dengan keutamaan-keutamaan, baik keutamaan amalan, bulan-bulan tau tempat-tempat, ini adalah perkara yang tidak pantas. Karena jika anda menyebutkan hadits-hadits dha'if tentang keutamaan sesuatu, maka pendengar akan meyakini bahwa hadits tersebut adalah shahih, dan menisbatkannya kepada Rasul 'alaihissholaatu wassalaam, ini adalah perkara besar. Yang terpenting adalah bahwa hari tengah dari bulan Sya'ban, dan malam tengah bulan sya'ban, tidak mempunyai keistimewaan dari bulan-bulan lainnya. Malam hari pertengahannya tidak dikhususkan dengan sholat tertentu, malan tersebut juga bukanlah malam lailatulqadar, dan hari pertengahan bulan sya'ban pun tidak memiliki kekhususan berupa puasa. Ya, benar bahwa hadits menetapkan bahwa nabi shallallaahu 'alaihi wa sallam memperbanyak puasa pada bulan tersebut, hingga beliau tidak berbuka padanya kecuali sedikit saja (1), dan apa-apa yang berkaitan dengan puasa, tidak shahih dari Nabi shallallaahu 'alaihi wa sallam, kecuaili keutamaan untuk seluruh bulan, seperti puasa tiga hari di setiap bulan (2), dan dilakukan pada tanggal 13, 14 dan 15, itulah puasa hari-hari putih (bertepatan bulan purnama) Dan firman Allah Ta'ala فِي لَيْلَةِ الْقَدْرِ \" pada malam lailatul qadar \" Di antara para ulama ada yang mengatakan bahwa makna al-qadr adalah kemuliaan. Sebagaiamana jika dikatakan فُلَانُ ذُو قَدرٍ عَظِيمٍ [Fulan dzu qadrin adzim] \"fulan mempunyai kemuliaan yang besar\" atau فُلَانُ ذُو قَدرٍ كَبِيرٍ [Fulan dzu qadrin kabir] \"fulan mempunyai kemuliaan yang besar\" maknanya ذُو شَرَفٍ كَبِيْرٍ [Dzu syarafin kabiir] (sama). Dan sebagian ulama ada yang memaksudkan al-Qadr dengan at-Taqdir (ketentuan takdir). Karena pada malam tersebut ditetapkan takdir yang akan terjadi pada tahun tersebut, sebagaimana firman Allah Ta'ala: إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةٍ مُبَارَكَةٍ إِنَّا كُنَّا مُنْذِرِينَ (3) فِيهَا يُفْرَقُ كُلُّ أَمْرٍ حَكِيمٍ \" sesungguhnya Kami menurunkannya pada suatu malam yang diberkahi dan sesungguhnya Kami-lah yang memberi peringatan. Pada malam itu dijelaskan segala urusan yang penuh hikmah,\"(QS. Ad-Dukhan: 3-4) Dirinci dan dijelaskan. Yang benar adalah maknanya mencakup kedua makna tersebut, lailatulqadr tidak diragukan lagi ia memiliki kemuliaan yang besar, dan pada malam tersebut juga ditetapkan ketentuan yang akan terjadi pada malam tersebut, berupa penghidupan, kematian, ketetetapan-ketetapan rejeki dan yang lainnya. (1) Dikeluarkan oleh Bukhari (1969) dan Muslim (1156) dari hadits Aisyah radhiyallaahu 'anha (2) Dikeluarkan Muslim (1160) dari hadits Aisyah radhiyallaahu 'anha"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qadr ayat 1: 1-2. Allah mengabarkan kepada Nabi-Nya (Muhammad ﷺ) bahwasanya Allah menurunkan Al Qur’an ini pada malam Al Qadar. Kemudian Allah berkata : Apa yang engkau ketahui wahai Nabi Allah tentang malam Al Qadar ? Telah disebutkan bahwa Al Qur’an semuanya diturunkan dari Lauhul Mahfudz kemudian menuju langit dunia pada malam Al Qadar, kemudian turun perlahan-lahan (satu persatu) atas Nabi ﷺ sesuai dengan kejadian-kejadian nyata dan sesuai dengan apa yang Allah kehendaki atas alur kehidupannya (Nabi ﷺ) dari awal tahun pembebanan kerisalahan sampai menjelang tahun wafatnya. Dinamakan malam Al Qadar karena Allah mentakdirkan di dalamnya kejadian-kejadian pada keseluruhan tahun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menerangkan keutamaan Al Qur’an dan ketinggian kedudukannya. Malam kemuliaan dikenal dengan malam Lailatul Qadr, yaitu suatu malam yang penuh kemuliaan dan kebesaran, karena pada malam itu permulaan turunnya Al Quran. Menurut Syaikh As Sa’diy, dinamakan Lailatul Qadr karena besarnya kedudukannya dan keutamaannya di sisi Allah, demikian pula karena pada malam itu ditentukan apa yang akan terjadi dalam setahun berupa ajal, rezeki dan ketentuan-ketentuan taqdir. Ibnu Abbas berkata, “Allah menurunkan Al Qur’an secara sekaligus dari Lauh Mahfuzh ke Baitul ‘Izzah di langit dunia, kemudian turun secara berangsur-angsur sesuai situasi dan kondisi selama 23 tahun kepada Rasulullah shallallahu 'alaihi wa sallam.” Malam tersebut adalah malam yang penuh berkah. Barang siapa yang melakukan qiyamullail pada malam itu karena iman dan mengharap pahala, maka akan diampuni dosa-dosanya yang telah lalu sebagaimana disebutkan dalam Shahih Bukhari dan Muslim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qadr Ayat 1",
    "description": "Al-qur'an adalah kitab suci yang mulia. Sesungguhnya kami telah menurunkannya untuk pertama kali kepada nabi Muhammad di gua hira, atau menurunkannya secara sekaligus dari lau' ma'f'' ke baitul 'izzah di langit dunia, pada malam qadar, malam kemuliaan dan ke agungan. 2. Dan tahukah kamu, wahai nabi Muhammad, apakah malam kemuliaan dan keagungan itu' ungkapan lailatul qadr baru disebut oleh Al-Qur'an dalam ayat pertama surah ini sehingga Allah perlu menjelaskan artinya dan menggugah perhatian nabi tentangnya."
  }
]