[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tahukah kamu (wahai nabi) apa itu malam qadar dan mulia?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Tahukah kamu -wahai Nabi- kebaikan dan berkah yang ada di dalam malam ini?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَمَآ أَدْرَىٰكَ مَا لَيْلَةُ الْقَدْرِ (Dan tahukah kamu apakah malam kemuliaan itu?) Terdapat pendapat mengatakan: dinamakan malam lailatul qadar karena Allah pada malam itu menetapkan apa yang Dia kehendaki segala urusan yang akan terjadi pada satu tahun kedepan. Pendapat lain mengatakan: dinamakan demikian karena malam itu memiliki kemuliaan dan kedudukan yang besar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Jika saat-saat malam itu hanya sebatas 10 jam, maka setiap jamnya dapat didibaratkan setara dengan 8 tahun lebih, dan tiap detiknya setara dengan 50 hari, maka rugilah orang-orang yang melewatkan malam itu dengan kelalaian. 2 ) . Berapa banyak keistimewaan yang dimiliki oleh malam ini ? mulai dari kemuliaan apa yang diturunkan pada malam itu, kemuliaan watunya, dan kemuliaan ibadah-ibadah yang dianjurkan untuk dikerjakan pada malam itu, dan kemuliaan malaikat-malaikat yang mereka bergantian turun pada malam itu, serta kemuliaan ketaatan seorang hamba yang tidak dibatasi oleh waktu, dan kemuliaan malam itu dikuat lagi dengan : { سَلَامٌ هِيَ حَتَّىٰ مَطْلَعِ الْفَجْرِ } , sungguh merugilah orang-orang yang menyia-nyiakan malam yang mulia ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Dan apakah kamu mengetahui wahai Nabi SAW tentang malam ini dan keutamaannya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tahukah kamu apakah Lailatul qadar itu} malam kemuliaan dan keutamaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Selanjutnya Allah memperbesar dan memperagung kondisinya seraya berfirman, “Dan tahukah kamu apakah malam kemuliaan itu?” yakni, kondisinya yang amat agung dan nilai pentingnya yang besar."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah mengagungkan malam yang mulia itu dengan bertanya kepada Rasul-Nya, { وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ } dan tahukah kamu wahai Muhammad apakaha malam lailatulqadr yang mulia itu ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-3 Kemudian Allah Jalla wa 'Alaa berfirman: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \" Dan tahukah kamu apakah malam kemuliaan itu?\" Ungkapan pada penggalan ayat ini, dengan bahasa seperti ini mengandung faedah pemuliaan dan pengagungan, ini sering disebutkan dalam al-Quran al-Karim, Allah Ta'ala berfirman: وَمَا أَدْرَاكَ مَا يَوْمُ الدِّينِ (17) ثُمَّ مَا أَدْرَاكَ مَا يَوْمُ الدِّينِ \" Tahukah kamu apakah hari pembalasan itu? Sekali lagi, tahukah kamu apakah hari pembalasan itu?\"(QS. Al-Infithar: 17-18) Allah Ta'ala juga berfirman: الْحَاقَّةُ (1) مَا الْحَاقَّةُ (2) وَمَا أَدْرَاكَ مَا الْحَاقَّةُ \" Hari kiamat, apakah hari kiamat itu? Dan tahukah kamu apakah hari kiamat itu?\"(QS. Al-Haqqah: 1-3) الْقَارِعَةُ (1) مَا الْقَارِعَةُ (2) وَمَا أَدْرَاكَ مَا الْقَارِعَةُ \" Hari Kiamat, apakah hari Kiamat itu?. Tahukah kamu apakah hari Kiamat itu?\"(QS. Al-Qari'ah: 1-3) Bentuk bahasa ungkapan di sini tujuannya adalah pengagungan dan pemuliaan. Di sini Allah berfirman: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \"\" Apa yang kamu ketahui tentang lailatulqadr, perkaranya, kemuliaannya dan keagungannya. Kemudian Allah menjelaskannya dengan firman-Nya: لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ \" Malam kemuliaan itu lebih baik dari seribu bulan.\" Ayat ini jawaban untuk pertanyaan sebelumnya, yaitu firman Allah Ta'ala: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \" Dan tahukah kamu apakah malam kemuliaan itu?\" Jawabannya: لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ \" Malam kemuliaan itu lebih baik dari seribu bulan.\" Maknanya: dari seribu bulan yang tidak ada padanya lailatulqadar, yang dimaksud kebaikan di sini adalah pahala perbuatan di dalamnya, dan apa-apa yang Allah turunkan di dalamnya berupa kebaikan dan keberkahan atas umat ini. Oleh kerena itu, siapa saja yang sholat pada malam tersebut karena mengharap pahala dan keimanan maka ia akan diampuni dosanya yang telah lalu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qadr ayat 2: 1-2. Allah mengabarkan kepada Nabi-Nya (Muhammad ﷺ) bahwasanya Allah menurunkan Al Qur’an ini pada malam Al Qadar. Kemudian Allah berkata : Apa yang engkau ketahui wahai Nabi Allah tentang malam Al Qadar ? Telah disebutkan bahwa Al Qur’an semuanya diturunkan dari Lauhul Mahfudz kemudian menuju langit dunia pada malam Al Qadar, kemudian turun perlahan-lahan (satu persatu) atas Nabi ﷺ sesuai dengan kejadian-kejadian nyata dan sesuai dengan apa yang Allah kehendaki atas alur kehidupannya (Nabi ﷺ) dari awal tahun pembebanan kerisalahan sampai menjelang tahun wafatnya. Dinamakan malam Al Qadar karena Allah mentakdirkan di dalamnya kejadian-kejadian pada keseluruhan tahun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kalimat ini untuk membesarkan malam Lailatul Qadr."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qadr Ayat 2",
    "description": "Dan tahukah kamu, wahai nabi Muhammad, apakah malam kemuliaan dan keagungan itu' ungkapan lailatul qadr baru disebut oleh Al-Qur'an dalam ayat pertama surah ini sehingga Allah perlu menjelaskan artinya dan menggugah perhatian nabi tentangnya. 3. Malam kemuliaan itu lebih baik daripada seribu bulan tanpa malam qadar di dalamnya. Ibadah pada malam itu mempunyai nilai yang sangat tinggi di mata Allah, lebih tinggi daripada ibadah selama seribu bulan."
  }
]