[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Malam qadar adalah malam penuh berkah, amal shalih padanya lebih baik daripada amal 1000 bulan diselainnya yang tidak ada malam qadar padanya. Dan ini merupakan keutamaan dari Allah ta’ala untuk umat ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Malam ini adalah malam yang penuh dengan kebaikan yang agung, ia lebih baik dari seribu bulan bagi orang yang menjalankan salat malam dengan keimanan dan mengharap pahala."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ (Malam kemuliaan itu lebih baik dari seribu bulan) Yakni beramal pada satu malam itu lebih baik daripada beramal selama seribu bulan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tahukah anda berapa persamaan seribu tahun dalam hitungan jam ? ya, seribu tahun sama dengan 720.000 jam , atau lebih dari 33,200,000 menit, yakni satu detik yang berlaku dalam malam lailatul qadr itu adalah 70,244 detik pada malam-malam lain, maka sugguh merugilah orang-orang yang menyia-nyiakan waktunya pada malam itu dengan keburukan. 2 ). Jika seandainya ditawarkan kepada salah seorang dari kita suatu saham yang keuntungannya akan lebih besar sepuluh kali lipat, sungguh dia akan berlari mengambilnya dengan penuh semangat, maka bagaimana mungkin seseorang yang mengabaikan saham yang keuntungannya jauh lebih besar seribu kali lipat ?! { لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ } sesungguhnya itu adalah kesalahan yang sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Malam lailatul qadar yaitu malam dimana amal shalih ketika itu lebih baik daripada amal selama seribu bulan di waktu selain lailatul qadar. Jarir mengatakan dari Mujahid yang berkata: “Salah satu laki-laki dari Bani Israil ada yang melaksanakan shalat di waktu malam sampai pagi, kemudian berperang memerangi musuhnya di waktu siang sampai sore, dan dia melaksanakan hal itu selama seribu bulan, kemudian Allah menurunkan ayat {Lailatul qadri khairum min alfi syahr} sebagaimana yang diamalkan oleh laki-laki itu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lailatulqadar itu lebih baik daripada seribu bulan} amal shalih pada malam itu lebih baik daripada beramal selama seribu bulan di lain waktu itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Malam qadar itu lebih baik dari seribu bulan,” yakni keutamaannya menyamai seribu bulan. Amal yang dilakukan pada malam itu lebih baik dari amal yang dikerjakan selama seribu bulan penuh. Inilah salah satu hal yang membuat orang berakal terkesima dan tercengang karena Allah memberi karunia pada umat yang lemah ini berupa kekuatan dan daya dalam satu malam, di mana amal yang dikerjakan pada malam itu nilainya sama bahkan lebih dari amalan seribu bulan, sementara seseorang paling-paling diberi usia panjang selama delapan puluh sekian tahun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu malam yang lebih dari seribu bulan, yakni amalan shalih yang dilakukan oleh orang-orang beriman pada malam itu adalah lebih baik kedudukanya dibandingkan amalan selama seribu bulan, inilah yang menjadikan malam ini adalah malam yang mulia, kedudukan yang sangat agung, malam ini akan menghampiri kehidupan manusia di setiap tahunnya, jika Allah berkehendak kepada siapapun untuk meraihnya, niscaya dia akan meraih segala kebaikan, itulah sebabnya malam ini disebut malam yang mulia, malam yang diberkahi. Seribu bulan, yaitu 83 tahun 4 bulan, jika seorang hamba melakukan ibadah dan memperbanyak amaln shalih didalamnya, maka amalan shalih pada satu malam lailatul qadr itu jauh lebih baik kedudukannya, itulah keutamaan bagi siapa yang di kehendaki oleh Allah untuk meraih malam itu, sedangkan mereka yang belum dikehendaki olehnya akan merasakan malam itu seperti malam-malam biasa, dia tidak memanfaatkan malam itu dengan memperbanyak amalan shalih, dia tidak sama sekali tidak peduli dengan keagungan malam itu. Kemudian ulama berbeda pendapat perihal malam yang tepat saat-saat malam yang mulia itu tiba dalam bulan ramadhan, Ibnu Katsir menyebutkan dalam \"kitab Tafsirnya\" beberapa perkataan : - Yang pertama mengatakan : Malam itu datang pada malam pertama bulan ramadhan. - Yang lain mengatakan : bahkan pada malam terakhir dari bulam ramadhan. - Pendapat ketiga mengatakan : Jatuh pada malam ke 17 , yaitu pada malam purnama. - Pendapat lain juga mengatakan : bahwasanya malam itu datang pada malam ke 21 ramadhan. - Dan ada yang mengatakan pada malam ke 23 ramadhan - Dan pendapat yang paling kuat yang kebanyakan ulama sepakat dengan pendapat ini adalah : malam ke 27 ramadhan. Akan tetapi intinya adalah seseorag tidak dapat menjamin bahwa malam itu akan datang pada satu malam saja dia akan meraihnya, maka pada malam-malam lainnya dia tidak melakukan amalan-amalan shalih dengan sungguh-sungguh, akan tetapi mereka yang bersungguh-sungguh melakukan amalan shalin sepanjang bulan akan lebih terjamin dia akan meraih malam yang muia itu. Oleh karena itu Rasulullah ﷺ bersabda : (( عن أبي هريرة عن النبي صلى الله عليه و سلم قال : من قام شهر من ذنبه في حديث قتيبة وما تأخر رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه في حديث قتيبة وما تأخر ومن قام ليلة القدر إيمانا واحتسابا غفر له ما تقدم من ذنبه )) \" “Barangsiapa berpuasa Ramadhan atas dasar iman dan mengharap pahala dari Allah, maka dosanya yang telah lalu akan diampuni, “Barangsiapa melaksanakan shalat pada malam lailatul qadar karena iman dan mengharap pahala dari Allah, maka dosa-dosanya yang telah lalu akan diampuni.” [ Diriwayatkan oleh Imam Bukhori dan Imam Muslim dari hadits Abu Hurairah ] . Rasulullah ﷺ pernah I’tikaf di sepuluh hari pertama bulan Ramadhan lalu I’tikaf sepuluh hari pertengahan untuk mencari Lailatul Qadar kemudian jelaslah bagi beliau bahwa Lailatul Qadar ada pada sepuluh hari terakhir, maka beliau pun terus menerus I’tikaf di sepuluh hari terakhir hingga bertemu Rabbnya عز وجل. Sebagaimana yang telah kita sebutkan bahwa diantara keutamaan malam lailatul qadr : Allah menyebutnya dengan malam yang mulia dan malam yang diberkahi. Yang kedua : Allah mengagungkan malam itu karena keutamaan yang ada pada malam itu. Yang ketiga adalah { تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ } ( Pada malam itu turun malaikat-malaikat dan malaikat Jibril dengan izin Tuhannya untuk mengatur segala urusan. ) , Allah menyebutnya pada ayat ke 4 disurah ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "2-3 Kemudian Allah Jalla wa 'Alaa berfirman: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \" Dan tahukah kamu apakah malam kemuliaan itu?\" Ungkapan pada penggalan ayat ini, dengan bahasa seperti ini mengandung faedah pemuliaan dan pengagungan, ini sering disebutkan dalam al-Quran al-Karim, Allah Ta'ala berfirman: وَمَا أَدْرَاكَ مَا يَوْمُ الدِّينِ (17) ثُمَّ مَا أَدْرَاكَ مَا يَوْمُ الدِّينِ \" Tahukah kamu apakah hari pembalasan itu? Sekali lagi, tahukah kamu apakah hari pembalasan itu?\"(QS. Al-Infithar: 17-18) Allah Ta'ala juga berfirman: الْحَاقَّةُ (1) مَا الْحَاقَّةُ (2) وَمَا أَدْرَاكَ مَا الْحَاقَّةُ \" Hari kiamat, apakah hari kiamat itu? Dan tahukah kamu apakah hari kiamat itu?\"(QS. Al-Haqqah: 1-3) الْقَارِعَةُ (1) مَا الْقَارِعَةُ (2) وَمَا أَدْرَاكَ مَا الْقَارِعَةُ \" Hari Kiamat, apakah hari Kiamat itu?. Tahukah kamu apakah hari Kiamat itu?\"(QS. Al-Qari'ah: 1-3) Bentuk bahasa ungkapan di sini tujuannya adalah pengagungan dan pemuliaan. Di sini Allah berfirman: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \"\" Apa yang kamu ketahui tentang lailatulqadr, perkaranya, kemuliaannya dan keagungannya. Kemudian Allah menjelaskannya dengan firman-Nya: لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ \" Malam kemuliaan itu lebih baik dari seribu bulan.\" Ayat ini jawaban untuk pertanyaan sebelumnya, yaitu firman Allah Ta'ala: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \" Dan tahukah kamu apakah malam kemuliaan itu?\" Jawabannya: لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ \" Malam kemuliaan itu lebih baik dari seribu bulan.\" Maknanya: dari seribu bulan yang tidak ada padanya lailatulqadar, yang dimaksud kebaikan di sini adalah pahala perbuatan di dalamnya, dan apa-apa yang Allah turunkan di dalamnya berupa kebaikan dan keberkahan atas umat ini. Oleh kerena itu, siapa saja yang sholat pada malam tersebut karena mengharap pahala dan keimanan maka ia akan diampuni dosanya yang telah lalu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qadr ayat 3: 3-5. Allah mengabarkan bahwa tahun di malam ini lebih utama dibandingkan seribu tahun. Allah juga mengabarkan bahwa para malaikat dan bersamanya Jibril turun pada malam ini dari langit menuju ke bumi dengan izin Allah dan juga perintah ketuhanan. Dan Ia juga mengabarkan bahwa malam Al Qadr meliputi keselamatan dimulai dari awal malam sampai munculnya fajar, tidak terdapat di dalamnya kejelekan atau kesedihan yang palsu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni beramal saleh atau beribadah bertepatan dengan malam itu lebih baik baik daripada beribadah selama seribu bulan. Syaikh As Sa’diy berkata, “Hal ini termasuk hal yang mencengangkan hati dan akal, karena Allah Tabaaraka wa Ta'aala melimpahkan nikmat kepada umat yang lemah kekuatannya dengan malam yang beramal pada malam itu mengimbangi dan melebihi (beramal) selama seribu bulan; (seukuran) umur seseorang yang dipanjangkan umurnya selama 80 tahun lebih.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qadr Ayat 3",
    "description": "Malam kemuliaan itu lebih baik daripada seribu bulan tanpa malam qadar di dalamnya. Ibadah pada malam itu mempunyai nilai yang sangat tinggi di mata Allah, lebih tinggi daripada ibadah selama seribu bulan. 4. Pada malam itu turun para malaikat dan ruh, yakni jibril, dari langit ke bumi dengan izin tuhannya untuk mengatur semua urusan makhluk yang telah ditentukan-Nya di lauh mahf'z untuk satu tahun mendatang, seperti umur, rezeki, kematian, dan sebagainya. Inilah yang membuat malam itu begitu mulia."
  }
]