[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para malaikat dengan jumlah besar turun, diantara mereka adalah jibril, dengan izin tuhan mereka membawa segala urusan yang tuhan tetapkan pada tahun tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Para Malaikat dan Malaikat Jibril -'alaihissalām- turun pada malam itu dengan izin dari Rabb mereka Yang Mahasuci dengan membawa perkara yang telah ditakdirkan oleh Allah untuk tahun itu, baik berupa rezeki, kematian, kelahiran dan lainnya yang telah ditakdirkan oleh Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Pada malam itu para malaikat dan malaikat Jibril turun. Hal ini mengajarkan kaum muslimin untuk mengagungkan hari-hari ketika mereka dimuliakan dengan turunnya al-Qur’an. Allah merahasiakan kepastian malam itu agar kaum muslimin terus-menerus beribadah pada banyak malam demi mendapatkan keutamaannya. Para malaikat turun ke bumi untuk menurunkan keberkahan, dan mereka turun atas izin dari Tuhan mereka; dan izin ini juga berlaku pada setiap perkara yang Allah tetapkan sepanjang tahun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. تَنَزَّلُ الْمَلٰٓئِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِم (Pada malam itu turun malaikat-malaikat dan malaikat Jibril dengan izin Tuhannya) Yakni turun dari langit menuju bumi. Dan yang dimaksud dengan (الروح) yakni malaikat Jibril. مِّن كُلِّ أَمْرٍ (untuk mengatur segala urusan) Yakni segala hal."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا } Turunya para Malaikat ke bumi adalah bukti atas rahmat, dan kebaikan, serta berkah yang Allah berikan kepada makhluk di bumi; oleh karena itu jika Malaikat enggan untuk masuk ke suatu tempat, maka itu adalah tanda bahwa tempat itu jauh dari kebaikan dan berkah, sebagai contoh : ruangan yang didalmnya terdapat gambar yang diharamkan bagi setiap hamba untuk melihatnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Malaikat berbondong-bondong turun ke bumi beserta Jibril di antaranya pada malam ini atas perintah Tuhan mereka untuk menunaikan setiap perkara yang hendak dipenuhi oleh Allah di tahun berikutnya, dan memberikan kebaikan untuk orang-orang yang taat, di antaranya adalah ada yang mendoakan keselamatan mereka, memohonkan ampun dan mendoakan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada malam itu turun para malaikat dan Rūḥ} dan Jibril AS {dengan izin Tuhannya untuk mengatur semua urusan} menunaikan kekuasaan Allah pada tahun itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Pada malam itu turun malaikat-malaikat dan malaikat Jibril,” yakni mereka berkali-kali turun pada malam itu, “untuk mengatur segala urusan.”"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dari keistimewaan dan keutamaan malam lailatul qadr adalah : { تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا بِإِذْنِ رَبِّهِمْ مِنْ كُلِّ أَمْرٍ } pada malam itu malaikat dengan jumlah besar turun ke bumi, malaikat itu hadir ke masjid-masjid, mereka hadir di antara jamaah kaum muslimin yang sedang melakukan ibadah, para Malaikat itu menjaga orang-orang beriman dan membantu mereka dalam menghidupkan malam itu dengan shalat dan ibadah lainnya. { وَالرُّوحُ } Dan bersama mereka ada Malaikat Jibril - عليه السلام - , Ruh yakni Malaikat Jibril , karena Allah menyebutnya dengan ( الروح الأمين ) , penyebutan \"Ruh\" dalam ayat ini adalah penyebutan khusus setelah sebelumnya disebutkan Malaikat secara umum, dalam riwayat lain dikatakan : yakni ruh adalah bagian daripada malaikat-malaikat yang turun pada malam itu. Sedangkan maksud { مِنْ كُلِّ أَمْرٍ } “min kulli amr” dalam ayat tersebut adalah bahwa ketika Malikat-malaikat itu turun akan banyak keselamatan atau kesejahteraan untuk setiap urusan (perkara)."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah mengabarkan yang terjadi pada malam tersebut, Allah berfirman: تَنَزَّلُ الْمَلَائِكَةُ وَالرُّوحُ فِيهَا \" Pada malam itu turun malaikat-malaikat dan malaikat Jibril \" Turun tahapan demi tahapan, karena para malaikat adalah penduduk langit, dan langit berjumlah tujuh langit, maka para malaikat turun tehapan demi tahapan sehingga memenuhi bumi, dan turunnya malaikat adalah alamat yang menunjukkan rahmat, kebaikan dan keberkahan, oleh karenanya apabila malaikat enggan memasuki suatu tempat, itu menunjukkan bahwa tempat tersebut yang malaikat enggan memasukinya, tidak ada rahmat, kebaikan dan keberkahan di dalamnya, keperti tempat yang ada gambar-gambar (makhluk bernyawa) di dalamnya. Sesungguhnya para malaikat tidak akan memasuki rumah yang terdapat gambar makhluk bernyawa di dalamnya. Maksudnya gambar yang diharamkan, karena apabila gambar makhluk bernyawa dihinakan dijadikan alas kasur atau lap, kebanyakan ulama membulehkannya, dengan begitu malaikat tidak akan enggam memasuki tempat tersebut, karena seandainya malaiikat enggan masuk maka tentu sudah dilarang. Maka para malaikat akan tururn pada lailatul qadr dengan jumlah banyak, turunnya mereka adalah kebaikan dan keberkahan. Ar-Ruh ialah malaikat Jibril alaihissalaam, allah mengkhususkan penyebutannya karena kemuliaan dan keutamaannya, dan firman Allah Ta'ala بِإِذْنِ رَبِّهِمْ \"dengan izin Rabb mereka\" Maknanya: dengan perintah-Nya, dan yang dimaksud izin di sini adalah izin kauniy (terjadi takdir). Kerena izin atau perintah Allah terbagi menjadi dua: Izin kauniy (segala kejadian) dan izin syar'iy (aturan syari'at) . Maka firman Allah Ta'ala شَرَعُوا لَهُمْ مِنَ الدِّينِ مَا لَمْ يَأْذَنْ بِهِ اللَّهُ \" yang mensyariatkan untuk mereka agama yang tidak diizinkan Allah? \"(QS. Asy-Syura: 21) maknanya adalah apa-apa yang tidak Allah izinkan secara syari'at, karena Allah telah mengizinkan terjadi secara takdir (perbuatan mereka). Telah disyari'atkan selain Allah tetapi itu tidak berdasar izin Allah secara syar'iy. Dengan demikian, ayat ini بِإِذْنِ رَبِّهِمْ \"dengan izin Rabb mereka\" maknanya adalah perintah Allah secara taqdir (kejadian yang pasti terwujud). Firman Allah: مِنْ كُلِّ أَمْرٍ \" dengan segala urusan.\" Dikatakan bahwa huruf من [min] mbermakna al-baa: \"dengan\" Maknanya: dengan segala urusan Allah memerintahkan dengannya, urusan ini tidak dijelaskan, kita tidak mengetahui berupa urusan apakah itu. Tetapi kita katakan bahwa turunnya malaikat-malaikat ke bumi adalah pertanda kebaikan, rahmat dan keberkahan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qadr ayat 4: 3-5. Allah mengabarkan bahwa tahun di malam ini lebih utama dibandingkan seribu tahun. Allah juga mengabarkan bahwa para malaikat dan bersamanya Jibril turun pada malam ini dari langit menuju ke bumi dengan izin Allah dan juga perintah ketuhanan. Dan Ia juga mengabarkan bahwa malam Al Qadr meliputi keselamatan dimulai dari awal malam sampai munculnya fajar, tidak terdapat di dalamnya kejelekan atau kesedihan yang palsu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Katsir berkata, “Banyak para malaikat yang turun pada malam ini karena banyak keberkahannya, dan para malaikat turun bersamaan turunnya berkah dan rahmat, sebagaimana mereka turun pula ketika Al Qur’an dibaca, (turun) mengelilingi majlis dzikr dan menaruh sayap-sayapnya kepada penuntut ilmu karena memuliakannya.” Rasulullah shallallahu 'alaihi wa sallam bersabda: لَيْلَةُ الْقَدْرِ لَيْلَةٌ سَابِعَةٌ أَوْ تَاسِعَةٌ وَ عِشْرِيْنَ إِنَّ الْمَلاَئِكَةَ تِلْكَ اللَّيْلَةَ فِي الْأَرْضِ أَكْثَرُ مِنْ عَدَدِ الْحَصَى “Malam Lailatul Qadr itu adalah malam ke 27 atau 29. Sesungguhnya para malaikat pada malam itu di bumi lebih banyak daripada banyaknya batu kerikil.” (HR. Ahmad dan Thayalisi. Hadits ini dihasankan oleh Syaikh Al Albani dalam Shahihul Jaami’ no. 5473). Qatadah berkata, “Pada malam itu ditentukan segala urusan dan ditentukan ajal dan rezeki, sebagaimana firman Allah Ta’ala, “Pada malam itu dijelaskan segala urusan yang penuh hikmah,” (Terj. Ad Dukhaan: 4)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qadr Ayat 4",
    "description": "Pada malam itu turun para malaikat dan ruh, yakni jibril, dari langit ke bumi dengan izin tuhannya untuk mengatur semua urusan makhluk yang telah ditentukan-Nya di lauh mahf'z untuk satu tahun mendatang, seperti umur, rezeki, kematian, dan sebagainya. Inilah yang membuat malam itu begitu mulia. 5. Sejahteralah malam itu sejak matahari terbenam sampai terbit fajar. Pada malam itu Allah hanya menentukan keselamatan dan kesejahteraan bagi makhluknya. Para malaikat juga turun secara bergelombang sambil membawa rahmat, kebaikan, salam, dan berkah dari Allah. Pada malam itu pula, tiap kali berjumpa dengan orang beriman, para malaikat pasti mengucapkan salam kepadanya."
  }
]