[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sepanjang malam itu aman, tidak ada keburukan padanya hingga terbit fajar"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Malam yang penuh berkah ini seluruhnya penuh kebaikan semenjak permulaannya hingga habisnya dengan terbitnya fajar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah mengabarkan bahwa turunnya para malaikat pada lailatul qadar untuk menyebarkan kebaikan bagi kaum muslimin, meliputi keselamatan, ampunan, pahala, pengabulan doa, dan pujian para malaikat bagi orang-orang yang beribadah pada malam itu. malam lailatul qadar dipenuhi dengan para malaikat dan keselamatan, kebaikan malam itu tidak terhenti hingga waktu fajar tiba."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. سَلٰمٌ هِىَ (Malam itu (penuh) kesejahteraan) Yakni malam itu dipenuhi dengan keselamatan dan kebaikan tanpa ada keburukan di dalamnya, dan setan pada saat itu tidak dapat melakukan keburukan atau gangguan. حَتَّىٰ مَطْلَعِ الْفَجْرِ(sampai terbit fajar) Yakni sampai waktu terbitnya fajar. Yakni para malaikat tidak berhenti turun kelompok demi kelompok hingga terbit fajar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) .Sebagian pendapat mengatakan bahwa malam lailatul qadr adalah malam ke-27 ramadhan, dan bahwsanya kata { هي } dalam surah ini dimaksudkan ( angka 27 ), dan pendapat ini salah, jika seandainya hal itu benar tidaklah tersembunyikan dari pengetahuan Rasulullah dan para sahabatnya serta para salafussaleh, dan tidak pula hal itu dikenal dikalangan bangsa arab, bahkan perkataan ini menyelisihi dalil-dalil jelas lainnya, dan sebagian ulama membantah pendapat ini seperti Ibnu hazm. 2 ) . Kalimat \"lailatul qadr\" disebutkan dalam surah al-Qadar sebanyak lima kali, dan malam lailatul qadr terdapat lima keutamaan didalamnya : yaitu, waktu turunnya al-Qur'an, malam itu adalah lebih baik dari seribu bulan, para malaikat dan khususnya jibril pada malam itu mereka bergantian turun ke bumi, dan pada malam itu juga segala urusan ditentukan, dan malam itu penuh dengan kesejahteraan sampai terbit fajar, maka apakah kita menghargai malam itu dengan sebaik-baiknya penghargaan, dan mengagungkannya dengan sebaik-baiknya pengagungan ?. 3 ) . Allah telah mengkhususkan malam lailatul qadar dengan namanya, dan telah menyendirikannya pada satu surah pennuh, dan menyebutkan didalamnya keutamaan-keutamaan tersendiri untuknya, maka tidakkah malam itu berhak atas kita untuk menghususkan dan menyendirikannya dengan ibadah-ibadah didalamnya, dan berlepas dari segala kesibukan kita, dan memulai untuk menyibukkan diri hanya untuk beribadah penuh didalamnya ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Malam ini adalah malam (yang penuh) kesejahteraan dan penuh kebaikan mulai permulaannya sampai terbitnya fajar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kesejahteraan malam itu} Lailatul qadar di dalamnya mengandung kesejahteraan dan kebaikan, pada seluruh malamnya, dan tidak ada keburukan {sampai terbit fajar}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Malam itu (penuh) kesejahteraan,” yakni sejahtera dari berbagai aib dan keburukan karena banyaknya kebaikan pada malam itu “sampai terbit fajar,” yakni bermula sejak tenggelamnya matahari hingga terbitnya fajar. Berbagai hadist mutawatir banyak menyebutkan keutamannya, malam itu berada di bulan Ramadhan pada sepuluh malam terakhir khususnya, dan terutama pada malam-malam ganjil. Malam qadar berlaku setiap tahun hingga Kiamat tiba. Karena itu Nabi beri’tikaf dan memperbanyak ibadah pada sepuluh hari terakhir bulan Ramadhan demi mengharapkan malam qadar. Wallahu a’lam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Keutamaan kelima untuk malam itu adalah : { سَلَامٌ هِيَ } malam itu dipenuhi dengan keselamatan dan kesejahteraan, tiada keburukan apapun yang terjadi, dari terbenamnya matahari sampai terbit kembali, { حَتَّىٰ مَطْلَعِ الْفَجْرِ } setelah terbitnya matahari malam lailatul qadr yang penuh dengan keberkahan berakhir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "سَلَامٌ هِيَ \" Malam itu (penuh) kesejahteraan \" Penggalan ayat ini terdiri dari mubtada dan khabar, khabarnya dikedepankan, dan taqdirnya: \"هِيَ سَلَامٌ\" maknanya: malam tersebut adalah keselamatan, Allah mensifatinya dengan kesejahteraan, karena banyaknya yang terselamatkan dari dosa-dosa dan hukuman-hukumannya pada malam tersebut, nabi shallallaahu 'alaihi wasallm bersabda: مَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيْمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \"Siapa saja yang berdiri melaksanakan shalat malam pada lailatulqadr karena iman dan mengharap pahala, maka akan diampuni baginya dosa-dosanya yang telah lalu\" (1) pengampunan dosa-dosa tidak diragukan bahwa itu adalah keselamatan dari bahaya dan hukuman-hukumannya. حَتَّى مَطْلَعِ الْفَجْرِ \" sampai terbit fajar.\" Maksudnya: Bahwa turunnya para malaikat pada malam tersebut akan berakhir hingga terbit fajar, dan jika fajar telah terbit maka berakhir pula lailatulqadar. Penting: Telah kita katakan bahwa lailatulqadar terjadi pada bulan ramadhan, tapi pada bagian manakah, apakah di awal, di tengah atau di akhir bulan ramadhan? Kita katakan dalam menjawab pertanyaan ini: Sesungguhnya Nabi shallallaahu 'alaihi wa sallam pernah beri'tikaf sepuluh hari pertama (2), kemudian sepuluh hari pertengahan, kemudian diberitakan kepada beliau: Sesungguhnya lailatulqadr terjadi pada sepuluh hari terakhir, maka beliau pun beri'tikaf pada sepuluh hari terakhir. Dengan demikian maka lailatul qadar terjadi pada sepuluh hari terakhir dari bulan ramadhan. Namun pada malah ke berapakan ia terjadi? Allah yang Lebih mengetahui, bisa jadi pada malam ke 21, atau malam ke 30, atau malam di atara keduanya, tidak ada ketentuan yang memastikan pada malam tertentu di setiap tahunnya. Oleh karenanya Nabi shallallaahu 'alaihi wa sallam diperlihatkan malam lailatul qadar pada malam ke 21, dan beliau melihat dalam mimpinya bahwa beliau sujud pada pagi harinya saat hujan dan pada tanah yang basah, maka turunlah hujan pada malam tersebut, malam ke 21. Maka nabi shallallaahu 'alaihi wa sallam shalat di masjidnya, dan masjid beliau terbuat dari anyaman sejenis pohon, tidak bisa menahan tembusnya air dari atapnya, lalu Nabi shallallaahu 'alaihi wa sallam sujud di pagi harinya, yaitu saat shalat subuh dengan air dan tanah yang basah, dan para sahabatnya radhiyallaah 'anhu bekas air dan tanah di kening beliau(3). Maka pada malam tersebut, malam ke 21, walau demikian, beliau bersabda: اِلْتَمِسُوهَا فِي الْعَشْرِ الْأَوَاخِرِ \"carilah ia pada sepulh hari terakhir\"(4) dan dalam sebuah riwayat: فِي الْوِتْرِ مِنَ الْعَشْرِ الْأَوَاخِرِ \"Pada malam ganjil dari sepuluh hari terakhir\"(5) Para sahabat pada suatu tahun dari tahun-tahun yang ada terjadi pada tujuh hari terakhir, maka Rasulullah shallallaahu 'alahi wa sallam bersabda: أَرَى رُؤْيَاكُمْ قَدْ تَوَاطَأَتْ فِي السَّبْعِ الأَوَاخِرِ، فَمَنْ كَانَ مُتَحَرَّيْهَا فَلْيَتَحَرَّهَا فِي السَّبْعِ الْأوَاخِرِ \"Aku melihat mimpi kalian bertepatan pada tujuh hari terakhir, maka siapa saja ingin mengincar lailatulqadr maka incarlah ia pada tujuh hari terakhir \" (6) Yaitu pada tahun tersebut, adapun tahun-tahun berikutnya, maka malam tersebut terletak pada salah satu malam dari sepuluh terakhir ramadhan, tidak ditentukan, tetapi malam yang paling berpotensi adalah malam ke 27, bisa jadi misalnya tahun ini bertepatan pada malam 27, tahun ke dua terjadi pada malam ke 21, pada tahun ketiga terjadi pada malam ke 25, dan begitu seterusnya. Allah Azza Wa Jalla tidak menjelaskan kepastiannya karena dua faedah yang besar: Pertama: Menjadi bukti yang membedakan antara yang jujur dalam mencarinya dari yang malas, karena yang jujur tidak peduli akan kelelahan pada sepuluh hari tersebut dalam rangka meraihnya, sedangkan yang malas akan malas untuk berdiri sepulh malam demi meraih satu malam saja. Faedah kedua: Banyaknya pahala orang-orang muslim adalah dengan memperbanyak amalan, karena semakin banyak amalan maka pahala pun akan lebih banyak. Pada kesempatan ini saya ingin mengingatkan kesalahan banyak orang pada saat ini, di mana mereka besungguh-sungguh dalam melaksanakan umrah pada malam ke 27. Anda akan melihat pada malam ke 27, anda akan mendapati masjidilharam dipenuhi orang-orang, dan pengkhususan malam 27 ramadhan dengan ibadah umrah adalah termasuk bid'ah. Karena Rasulullah shallallaahu 'alaihi wa sallam tidak mengkhususkan dengan umrah pada perbuatannya, dan beliau juga tidak mengkhususkan malam tesebut dengan perkataannya, beliau tidak melaksanakan umrah dan tidak juga mengatakan bersungguh sungguhlah pada malam 27 dengan ibadah umrah, tapi beliau hanya memerintahkan bersungguh sungguh pada malam tersebut dengan mendirikan shalat malam di dalamnya tidak dengan ibadah umrah. Dengan demikian menjadi jelas kekeliruan kebanyakan orang, dan dengan demikian pula jelas bahwa orang-orang mengambil agama mereka dari orang tua dan nenek moyang mereka tanpa ada landasan dari syari'at, maka jauhilah beribadah kepada Allah kecuali dengan ilmu berdasarkan dalil dari kitabullah dan sunnah Rasulullaah shallallaahu 'alaihi wa sallam atau amalan para khulafaa rasyidin yang kita diperintahkan untuk mengikuti sunnah mereka. Pada surat ini mengandung beberapa keutamaan lailatulqadr: Keutamaan pertama: Bahwa Allah menurun padanya al-Quran yang dengannya Allah memberi petunjuk manusia dan kebahagiaan mereka di dunia dan akhirat. Kedua: Adanya pengagungan dan pemuliaan dengan bentuk pertanyaan dalam firman-Nya: وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ \" Dan tahukah kamu apakah malam kemuliaan itu?\" Ketiga: Bahwa lailatulqadr lebih baik dari seribu bulan. Keempat: bahwa para malaikat turun pada malam tersebut, dan mereka tidaklah turun melainkan dengan membawa kebaikan, rahmat dan keberkahan. Kelima: Bahwa malam tersebut adalah keselamatan, karena banyaknya keselamatan di dalamnya dari hukuman dan siksa, dengan ketaatan yang dilakukan hamba berupa ketaatan kepada Allah Azza Wa Jalla. Keenam: Bahwa Allah menurunkan dalam keuatamaannya berupa surat yang dibaca keseluruhannya hingga hari kiamat. Dan di antara keutamaan malam lailatulqadr: Yang ditetapkan hadits dalam shahihain, dari hadits Abu Hurairah radhiyallaahu 'anhu, bahwa Nabi shallallaahu 'alaihi wa sallam bersabda: مَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيْمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \"Siapa saja yang berdiri melaksanakan shalat malam pada lailatulqadr karena iman dan mengharap pahala, maka akan diampuni baginya dosa-dosanya yang telah lalu\" (7) sabda beliau: إِيْمَانًا وَاحْتِسَابًا \" karena iman dan mengharap pahala \" maknanya: Karena beriman kepada Allah, dan kepada apa yang Allah siapkan berupa pahala bagi orang-orang yang melaksanakannya pada lailatul qadar, dan mengharap balasan dan meminta pahala, dan ini diperoleh oleh siapa saja baik yang mengetahuinya mau pun yang tidak mengetahuinya, karena Nabi shallallaahu 'alahi wa sallam tidak memberikan syarat pengetahuan tentangnya dalam meraih pahala tersebut. Dengan ini, selesai pembicaraan tentang surat al-Qadr. (1) Dikeluarkan Bukhari (35) dan Muslim (760) dari hadits Abu Hurairah radhiyallaahu 'anhu (2) Dikeluarkan Bukhari (2018) dan Muslim (1167) dari hadits Abu Sa'id al-Khudriy radhiyallaahu 'anhu (3) Idem (4) Dikeluarkan Bukhari (2016) dan Muslim (1167) dari hadits Abu Sa'id Al-Khudriy radhiyallaahu 'anhu (5) Dikeluarkan Bukhari (2017) dan Muslim (1169) dari hadits Aisyah radhiyallaahu 'anha (6) Dikeluarkan Bukhari (2015) dan Muslim (1165) dari hadits Ibnu Umar radhiyallaahu 'anhuma (7) Dikeluarkan oleh Bukhari (35) dan Muslim (760)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qadr ayat 5: 3-5. Allah mengabarkan bahwa tahun di malam ini lebih utama dibandingkan seribu tahun. Allah juga mengabarkan bahwa para malaikat dan bersamanya Jibril turun pada malam ini dari langit menuju ke bumi dengan izin Allah dan juga perintah ketuhanan. Dan Ia juga mengabarkan bahwa malam Al Qadr meliputi keselamatan dimulai dari awal malam sampai munculnya fajar, tidak terdapat di dalamnya kejelekan atau kesedihan yang palsu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sa’id bin Manshur berkata dari Mujahid tentang firman Allah, “Sejahteralah (malam itu),” ia berkata, “Yakni sejahtera, dimana setan tidak dapat berbuat buruk di dalamnya atau mengganggu.” Qatadah dan Ibnu Zaid berkata tentang firman Allah Ta’ala, “Sejahteralah (malam itu),” maksudnya malam itu baik seluruhnya tidak ada keburukan sampai terbit fajar.” Tentang tanda malam Lailatul Qadr, Rasulullah shallallahu 'alaihi wa sallam bersabda: لَيْلَةُ الْقَدْرِ لَيْلَةٌ بَلْجَةٌ لاَ حَارَّةٌ وَ لاَ بَارِدَةٌ (وَلاَسَحَابٌ فِيْهَا وَلاَمَطَرٌ وَلاَرِيْحٌ ) وَ لاَ يُرْمَى فِيْهَا بِنَجْمٍ وَ مِنْ عَلاَمَةِ يَوْمِهَا تَطْلُعُ الشَّمْسُ لاَ شُعَاعَ لَهَا “Malam Lailatul Qadr adalah malam yang terang, tidak panas dan tidak dingin (tidak ada gumpalan awan, hujan maupun angin), dan tidak dilepaskan bintang. Sedangkan di antara tanda pada siang harinya adalah terbitnya matahari tanpa ada syu’anya.” (HR. Thabrani dalam Al Kabir dari Watsilah, dan dihasankan oleh Syaikh Al Albani dalam Shahihul Jaami’ no. 5472, namun yang disebutkan dalam tanda kurung menurutnya adalah dha’if, lihat Dha’iful Jaami’ no. 4958) Syu’a, menurut Imam Nawawi artinya yang terlihat dari sinar matahari ketika baru muncul seperti gunung dan batang yang menghadap kepadamu ketika engkau melihatnya, yakni sinar matahari yang berserakan. Beliau shallallahu 'alaihi wa sallam juga bersabda: لَيْلَةٌ سَمْحَةٌ طَلْقَةٌ لاَ حَارَّة ٌوَلاَ بَارِدَةٌ وَتُصْبِحُ شَمْسُ صَبِيْحَتِهَا ضَعِيْفَةٌ حَمْرَاءُ “(Malam Lailatul Qadr adalah) malam yang ringan, sedang, tidak panas dan tidak dingin, dimana matahari pada pagi harinya melemah kemerah-merahan.” (HR. Thayalisi dan Baihaqi dalam Syu’abul Iman, dishahihkan oleh Syaikh Al Albani dalam Shahihul Jaami’ no. 5475). Ibnu Katsir berkata, “Dan tanda malam Lailatul qadr adalah bahwa malam tersebut bersih, terang, seakan-akan ada bulan yang bersinar, tenang, tidak dingin dan tidak panas, sedangkan (pada pagi hari) matahari terbit dalam keadaan sedang tanpa ada sinar yang berserakan seperti bulan pada malam purnama.” Catatan: Lailatul qadr tidak terjadi pada malam tertentu secara khusus dalam setiap tahunnya, namun berubah-rubah, mungkin pada tahun sekarang malam ke 27, pada tahun depan malam ke 29 dsb. Dan sangat diharapkan terjadi pada malam ke 27. Mungkin hikmah mengapa malam Lailatul qadr disembunyikan oleh Allah Subhaanahu wa Ta'aala adalah agar diketahui siapa yang sungguh-sungguh beribadah dan siapa yang bermalas-malasan. Yakni awalnya dari tenggelam matahari dan akhirnya sampai terbit fajar. Syaikh As Sa’diy berkata, “Telah mutawatir hadits-hadits tentang keutamaannya, dan bahwa hal itu terjadi pada bulan Ramadhan, yatu pada sepuluh terakhir daripadanya, khususnya pada malam-malam ganjilnya, dan hal itu berlaku pada setiap tahun sampai hari Kiamat. Oleh karena itu, Nabi shallallahu 'alaihi wa sallam beri’tikaf dan memperbanyak ibadah pada sepuluh terakhir dari bulan Ramadhan karena mengharapkan Lailatul Qadr, wallahu a’lam.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qadr Ayat 5",
    "description": "Sejahteralah malam itu sejak matahari terbenam sampai terbit fajar. Pada malam itu Allah hanya menentukan keselamatan dan kesejahteraan bagi makhluknya. Para malaikat juga turun secara bergelombang sambil membawa rahmat, kebaikan, salam, dan berkah dari Allah. Pada malam itu pula, tiap kali berjumpa dengan orang beriman, para malaikat pasti mengucapkan salam kepadanya. 1. Orang-orang yang kafir dari golongan ahli kitab, yaitu yahudi dan nasrani, dan orang-orang musyrik penyembah berhala tidak akan meninggalkan kekafiran mereka sampai datang kepada mereka bukti yang nyata."
  }
]