[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "( Alif lam Ro ) keterangan tentang huruf-huruf yang terputus-putus (di awal surat) penjelasannya telah berlalu di awal pada permulaan surat al-baqarah. Kitab yang diturunkan Allah kepaada Muhammad ini, ayat-ayat nya telah terpelihara dari kesalahan dan kebatilan. kemudian diterangkan dengan adanya perintah dan larangan seta penjelasan halal dan haram dari sisi Allah, Dzat yang mahabijaksana dalam mengatur segala urusan, yang maha mengetahui bagaimana perkara-perkara itu berkesudahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Rā. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah. Al-Qur`ān adalah kitab yang ayat-ayatnya dan maknanya disusun dengan tepat dan kata-katanya ditata dengan baik. Maka engkau tidak melihat adanya celah atau kekurangan di dalamnya. Kemudian ayat-ayat itu diberi penjelasan dengan menyebutkan halal dan haram, perintah dan larangan, janji dan ancaman, kisah-kisah dan lain-lain, dari sisi Tuhan Yang Maha Bijaksana dalam mengatur makhluk-Nya dan menetapkan syariat-Nya, lagi Maha Mengetahui kondisi hamba-hamba-Nya dan apa yang terbaik untuk mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Surat ini dimulai dengan huruf-huruf tersebut sebagai peringatan dan tantangan. Al-Qur’an diturunkan menggunakan bahasa arab, dan inilah huruf-hurufnya; maka dapatkah orang-orang yang fasih dan mahir dalam bahasa arab untuk membuat layaknya al-Qur’an atau satu suratnya? Al-Qur’an adalah kitab yang sangat sempurna dalam susunannya, sifatnya, dan ungkapannya; tidak ada kekurangan dan pertentangan di dalamnya, ayat-ayatnya sempurna dan terperinci, dan tersusun dari penjelasan dan bukti-bukti yang sangat sempurna."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الٓر ۚ (Alif laam raa) Huruf-huruf hijjaiyah ini telah disebutkan penafsirannya di awal surat al-Baqarah. كِتٰبٌ((inilah) suatu kitab) Yakni al-Qur’an. أُحْكِمَتْ ءَايٰتُهُۥ(yang ayat-ayatnya disusun dengan rapi) Yakni ayat-ayat yang kuat dan sempurna, yang tidak mempunyai kekurangan dan tidak mungkin dihancurkan seperti bangunan yang kuat; dan ayat-ayat ini tidak akan diganti sebagaimana Taurat dan Injil. ثُمَّ فُصِّلَتْ(serta dijelaskan secara terperinci) Dengan janji kebaikan dan ancaman, pahala dan siksaan. Makna dari penyempurnaan ayat-ayat ini adalah bahwa ia tidak ada kerusakan dan tidak ada perselisihan. مِن لَّدُنْ حَكِيمٍ خَبِيرٍ(yang diturunkan dari sisi (Allah) Yang Maha Bijaksana lagi Maha Tahu) Yakni yang disempurnakan oleh Allah Yang Maha Bijaksana, dan dijelaskan oleh-Nya yang Maha Mengetahui segala urusan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) DIantara tadabbur qur'an dari ayat ini, kita menemukan adanya mukjizat sebagai seni yang nampak dan tersembunyi, : yaitu dari segi lafazh dan makna, lafazh-lafazhnya yang disusun rapi, dan maknanya yang dijelaskan secara terperinci, atau sebaliknya (walaupun ada khilaf dalam hal ini), karena setiap lafazh dan maknanya tidak akan cacat dan tercemari oleh tangan-tangan keji, ayat-ayat yang telah mengabarkan tentang hal-hal ghaib yang pernah ada dan telah terbukti kejadiannya secara ilmiyah, ayat-ayat suci yang memerintahkan kepada kebaikan, dan melarang dari segala kerusakan dan keburukan. 2 ). Di ayat mengatakan : { مِنْ لَدُنْ حَكِيمٍ خَبِيرٍ } dan tidak dengan kata { من رحمن الرحيم }; sebagai catatan bahwa mukjizat ini mesti dengan kebijaksaan dan ada hikmah baik di baliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Tirmidzi dan Hakim dari Ibnu Abbas berkata: Abu Bakar berkata: Ya Rasul, engkau telah beruban. Rasul menjawab: Surat Hud, Al-waqi’ah, Al-mursalat, ‘Amma yatasaalun, idzasy syamsu kuwwirat yang telah membuat rambutku beruban. Ini adalah hadis hasan sebagaimana dikatakan Tirmidzi, dan hadis sahih menurut Hakim. Nabi ditanya tentang apa yang telah membuat rambutnya beruban di surat Hud, Nabi menjawab: Yaitu firman Allah: Fastaqim kamaa umirtu (112). 1 Alif laam raa, untuk memberi perhatian, menantang (bangsa Arab) dan meneguhkan Al-Qur’an bahwa itu diturunkan dari sisi Allah. Al-Qur’an adalah kitab yang ayat-ayatnya tersusun rapi tanpa kurang dan berantakan seperti bangunan yang tersusun rapi, dalam lafadznya tersusun dengan rincian-rincian ayat, dalam maknanya dijelaskan kisah-kisah, nasehat dan hukum, dan waktu turunnya dalam jangka waktu sesuai kebutuhan dan kemaslahatan. Al-Qur’an ini adalah penjelas yang diturunkan dari sisi (Allah) Yang Maha Bijaksana dalam menciptakan, mengatur firman, kehendak dan ketentuanNya lagi Maha Mengetahui keadaan dan kebaikan manusia,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Alif Lām Rā. Kitab yang ayat-ayatnya telah disusun rapi} ayat-ayatnya telah disempurnakan sehingga tidak ada pertentangan dan tidak ada kecacatan {kemudian dirincikan} dejelaskan tentang perintah, larangan, janji, yang diberi janji, pahala, dan hukuman {dari sisi} dari sisi {Dzat Yang Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman, “(Inilah) suatu kitab”, yang agung yang diturunkan dengan mulia “yang ayat-ayatnya disusun dengan rapi.” Yakni dengan sempurna dan bagus. Berita-beritanya jujur, perintah dan larangannya adil, lafazhnya fasih, maknanya indah “kemudian dijelaskan secara terperinci.” Yakni diterangkan dan diperjelas sebagai bentuk penjelasan yang paling tinggi, “yang diturunkan dari sisi (Allah) Yang Mahabijaksana.” Meletakkan segala sesuatu di tempatnya, mendudukannya pada posisinya, tidak memerintahkan dan melarang kecuali sesuai dengan tuntutan hikmahNya. “Lagi Mahatahu”, yang mengetahui lahir dan batin. Jika penataannya yang rapid an penjelasannya dari Allah Yang Mahabijaksana lagi Maha Mengetahui, maka sesudah itu janganlah kamu bertanya tentang kebesaranNYa, keagunganNya dan pencakupanNya atas hikmah yang sempurna dan rahmat yang luas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (آلر) Aliif Laam Raa : Ini adalah salah satu dari Huruf Muqatha’ah : tertulis (آلر) dan dibaca, Aliif Laam Raa. (أُحۡكِمَتۡ) Uhkimat : Tersusun, ditata dengan rapi dan sempurna, tidak ada cacat sedikit pun. (فُصِّلَتۡ) Fushshilat : Penjelasan mengenai hukum, kisah, pelajaran, serta berbagai macam petunjuk. (مِن لَّدُنۡ) Mil ladun : Dari sisi (حَكِيمٍ خَبِيرٍ) Yang Maha Bijaksana lagi Maha Mengetahui, yaitu Allah jalla wa ‘alaa. Makna Ayat : Firman-Nya ta’ala (آلر) adalah termasuk ayat yang mutasyabih, sehingga sudah sepantasnya untuk menyerahkan maknanya kepada Allah, maka dikatakan: “Allah lebih mengetahui maknanya.” Namun terdapat 2 faidah, yang pertama : Bahwa Al-Qur’anul Karim—Allah menantang seluruh manusia untuk membuat yang semisalnya atau satu surat yang mirip—terdiri dari huruf ini : آلم , آلر , طه, طس, حم, ق, ن, , maka buatlah yang semisal huruf-huruf ini jika kalian masih tidak mampu. Jika kalian tak mampu, ketahuilah bahwa Al-Qur’an adalah kitab Allah dan wahyu-Nya serta Muhammad adalah hamba dan rasul-Nya, maka berimanlah kalian. Yang kedua : Ketika mereka enggan mendengarkan Al-Qur’an, bahkan mereka membuat kegaduhan ketika dibacakan Al-Qur’an dan mereka melarang penyebarannya, kemudian datang huruf-huruf ini yang menyelisihi keumuman bahasa serta dialek mereka, sehingga mereka terdorong untuk menyimaknya. Dan ketika mendengarnya, mereka tersentuh dan beriman dengannya. Inilah sebaik-baik faidah yang dimiliki Huruf Muqaththa’ah. Firman-Nya ta’ala (كِتَٰبٌ أُحۡكِمَتۡ ءَايَٰتُهُۥ) kitab yang agung ini (Al-Qur’an) terdiri dari huruf-huruf ini, tersusun dan tertata dengan sempurna tidak ada kesalahan sedikitpun, baik dari sisi susunan kata ataupun maknanya. Dan firman-Nya (ثُمَّ فُصِّلَتْ) Dijelaskan apa yang terkandung di dalamnya berupa hukum, syari’at, nasehat, aqidah, sastra serta akhlak, dan kandungan-kandungan yang tidak ada tandingannya dari kitab-kitab lain. Firman-Nya (مِنْ لَّدُنْ حَكِيْمٍ خَبِيْرٍ) Yang Maha Bijaksana lagi Maha Teliti-lah yang menjelaskannya. Maha Bijaksana dalam pengaturan, syariat, hukum dan ketentuan-Nya. Maha Teliti akan keadaan hamba-hamba-Nya, urusan seluruh makhluk-Nya. Maka tidaklah kitab, hukum serta penjelasan-Nya, kecuali menjadi yang paling sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 1: Maksudnya diperinci atas beberapa macam, ada yang berbicara mengenai aqidah, ibadah, hukum, kisah, akhlak, ilmu pengetahuan, janji dan peringatan, nasehat, perumpamaan dan lain-lain. Dia meletakkan sesuatu pada tempatnya, menempatkan sesuatu pada posisinya, tidak memerintah dan melarang kecuali sesuai kebijaksanaan-Nya. Dia mengetahui yang nampak maupun yang tersembunyi. Oleh karena berasal dari sisi Allah yang Mahabijaksana lagi Maha Teliti, maka anda tidak perlu menanyakan tentang keagungan kitab itu serta kandungannya yang penuh hikmah dan rahmat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 1",
    "description": "Alif lam ra. Inilah kitab, Al-Qur'an yang ayat-ayatnya disusun dengan rapi, terpelihara dari kekeliruan, kemudian kandungannya dijelaskan secara terperinci, ada yang mengenai tauhid, hukum, kisah, akhlak, ilmu pengetahuan, janji dan peringatan, dan lain lain, disusun surat demi surat, ayat demi ayat, yang diturunkan dari sisi Allah yang mahabijaksana dalam setiap keputusan-Nya, mahateliti dalam semua ketetapan-nAllah menurunkan ayat-ayat Al-Qur'an yang sangat indah dan tersusun rapi serta mendetail kandungannya, agar kamu tidak menyembah selain Allah. Sesungguhnya aku, Muhammad, adalah pemberi peringatan adanya siksa bagi orang-orang yang ingkar dan pembawa berita gembira dari-Nya, yakni surga untukmu wahai orang-orang yang beriman."
  }
]