[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kami melapangkan bagi manusia keadaan dunianya dan meluaskan baginya rizki setelah kesempitan penghidupannya, tentulah saat itu dia benar-benar akan mengatakan, ” telah pergi dariku kesulitan hidup dan telah lenyap berbagi macam kesengsaraan.” sesungguhnya ia benar-benar seorang yang mengingkari nikmat-nikmat, keterlaluan dalam berbangga diri dan angkuh di hadapan manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan sungguh jika Kami merasakan kemudahan mendapatkan rezeki dan kesehatan setelah ia merasakan kemiskinan dan penyakit, pasti ia akan berkata, \"Kesulitanku sudah pergi. Dan penyakitku sudah hilang.\" Ia tidak bersyukur kepada Allah atas nikmat itu. Ia gemar membanggakan diri dan suka menyombongkan nikmat yang diterimanya dari Allah di depan orang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-11. Dan jika ia kembali mendapat kenikmatan, ia cenderung berfoya-foya, sombong, lupa terhadap sunnatullah, merasa aman dari perubahan nasib, dan lupa bahwa itu adalah karunia dan rahmat dari Allah. Kemudian Allah mengecualikan orang yang bersabar saat ditimpa musibah, dan menyucikan dirinya dengan amalan-amalan shalih; dia tidak mengeluh ketika mendapat musibah dan tidak sombong ketika mendapat kenikmatan. Mereka adalah orang-orang yang memiliki derajat yang tinggi, bagi mereka ampunan yang besar berkat keshalihan, harapan, dan rasa syukur mereka kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَلَئِنْ أَذَقْنٰهُ نَعْمَآءَ بَعْدَ ضَرَّآءَ مَسَّتْهُ لَيَقُولَنَّ ذَهَبَ السَّيِّـَٔاتُ عَنِّىٓ ۚ (Dan jika Kami rasakan kepadanya kebahagiaan sesudah bencana yang menimpanya, niscaya dia akan berkata: “Telah hilang bencana-bencana itu daripadaku”) Yakni jika seorang hamba diberi kenikmatan oleh Allah berupa kesehatan, keselamatan, dan kekayaan padahal sebelumnya ia berada dalam kesengsaraan seperti kemiskinan, penyakit, atau ketakutan, maka mereka tidak menyikapinya dengan rasa syukur kepada Allah, namun mereka malah mengatakan “segala musibah telah hilang sama-sekali” tanpa bersyukur kepada Allah atau memuji-Nya atas keadaan buruk mereka yang telah diangkat oleh Allah. إِنَّهُۥ لَفَرِحٌ فَخُورٌ(sesungguhnya dia sangat gembira lagi bangga) Yakni sangat senang dengan penuh kesombongan dan sangat angkuh didepan orang lain dan semena-mena karena Allah telah memberikan berbagai kenikmatan kepada mereka ketika itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dan jika Kami anugerahkan kepada mereka suatu kebahagiaan berupa kesehatan, keselamatan dan kecukupan sesudah adanya bencana berupa sakit, rasa takut atau fakir, niscaya mereka akan berkata: “Bencana-bencana itu telah hilang dariku dan tidak akan kembali lagi”, sehingga kemudian mereka tidak bersyukur. Sesungguhnya mereka sangat senang lagi bangga dengan berlebihan dengan kenikmatan yang mereka terima, disertai dengan rasa bangga dan kesombongan kepada manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh jika Kami membuatnya merasakan nikmat setelah bencana yang menimpanya} menimpanya {niscaya dia akan berkata,“Telah hilang keburukan itu} keburukan {dariku” Sesungguhnya dia sangat gembira} sangat gembira dengan disertai keangkuhan {dan membanggakan diri} sangat membanggakan diri kepada manusia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah mengabarkan tentang tabiat manusia bahwa dia itu bodoh dan zhalim, bahwa jika Allah memberikan rahmat kepadanya seperti rizki, kesehatan, anak keturunan dan lain-lain, kemudian Dia mengambil darinya, maka dia menyerah dan tunduk kepada keputusasaan tidak berharap pahala dari Allah dan tidak terlitas dibenaknya bahwa Allah akan mengembalikannya atau yang sepertinya atau yang lebih baik daripadanya, dan bahwa jika Allah melimpahkan rahmat setelah kesulitan yang menimpanya maka dia berbahagia menyombongkan diri dan menyangka harta yang banyak itu akan langgeng, seraya dia berkata ”telah hilang bencana bencana itu dariku’ sesungguhnya dia sangat gembira lagi bangga” maksudnya dia berbahagia dengan apa yang diberikan kepadamya hamba-hambaNYa. Hal itu membuat lupa diri, sombong, angkuh, takabur dihadapan manusia, menghina dan merendahkan mereka. Adakah cacat yang lebih berat daripada ini?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نعماء بعد ضراء) Na’maa a ba’da dharraa : Kebaikan setelah keburukan. (السيئات) As-Sayyiaat : Bentuk plural dari (سيئة) keburukan, segala sesuatu yang menyulitkan berupa musibah. (فرح فخور) Farihun fakhuur : Sangat bahagia lagi sombong. Makna ayat : (و لئن أذقناه نعماء بعد ضراء) Kami berikan kepadanya kenikmatan, kelapangan hidup dan kesehatan setelah tertimpa kesengsaraan. (ليقولن) Mengganti pujian dan syukur kepada Allah atas kenikmatan yang ia rasakan setelah kesengsaraan, kekayaan yang ia dapatkan setelah kemiskinan dan kesehatan setelah ia merasakan sakit, seraya berkata dengan penuh kebanggaan : (ذهب السيئات عني) telah hilang dari ku keburukan, (إنه لفرح) “Sesungguhnya dia” sangat berbahagia (فخور) sombong dan bangga. Penyebab hal di atas adalah kegelapan jiwa yang disebabkan kekufuran dan maksiat. Pelajaran dari ayat : • Tercelanya mencintai dan berbangga dengan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 10: Ia tidak bersyukur terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 10",
    "description": "Dan jika kami berikan kebahagiaanberupa keluasan rezeki, kehidupan yang menyenangkan, dan kesehatan kepadanya setelah ditimpa bencana berupa malapetaka, kemiskinan, kesulitan hidup, atau sakit yang menimpanya, niscaya dia akan berkata dengan nada sombong, telah hilang bencana itu dariku. Sesungguhnya dia merasa sangat gembira dan bangga, karena menganggap bahwa dirinya telah selamat dari bencana itu. Padahal Allahlah yang telah menyelamatkan mereka, dan mereka tidak menyadari hal itu. Itulah sifat orang-orang sombong, ketika mendapat cobaan mereka putus asa, dan ketika selamat dari bencana mereka lupa kepada Allah, kecuali orang-orang yang sabar dalam menghadapi kesulitan serta rida terhadap ketentuan Allah, dan mereka tetap istikamah dalam mengerjakan kebajikan baik ketika mereka dalam kesulitan maupun kelapangan hidup. Mereka akan memperoleh ampunan dan pahala yang besar di sisi Allah atas amal saleh yang mereka lakukan."
  }
]