[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berita yang kami sebutkan kepadamu wahai rasul, yaitu peristiwa-peristiwa negeri-negeri yang telah kami hancurkan penghuninya, kami memberitahukannya kepadamu, diantara ngeri-negeri itu masih ada peniggalan-peningggalannya yang tersisa, dan diantaranya ada negeri yang telah sirna sama sekali bekas-bekasnya, tidak ada sedikitpun yang tersisa darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Berita-berita tentang negeri-negeri yang telah Kami ceritakan kepadamu -wahai Rasul- di dalam surah ini ada sebagian negeri yang tanda-tandanya masih tegak berdiri dan ada yang tanda-tandanya sudah musnah dan tidak berbekas sama sekali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Hai Nabi, itulah kisah-kisah berbagai negeri yang Kami ceritakan kepadamu agar menjadi ibrah dan pelajaran. Sebagian negeri itu masih tersisa puing-puingnya sebagai saksi para penduduknya, seperti negeri Madain kaum Shalih, negeri kaum ‘Ad, dan peninggalan-peninggalan Fir’aun. Dan sebagian negeri yang lain telah hancur luluh lantah, terkubur di dalam tanah atau hilang jejaknya, seperti negeri kaum Nabi Nuh dan kaum Nabi Syuaib."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. ذٰلِكَ مِنْ أَنۢبَآءِ الْقُرَىٰ نَقُصُّهُۥ عَلَيْكَ (Itu adalah sebahagian dan berita-berita negeri (yang telah dibinasakan) yang Kami ceritakan kepadamu) Yakni kisah umat-umat terdahulu yang diceritakan Allah dalam surat ini. مِنْهَا(di antaranya) Yakni diantara negeri-negeri itu. قَآئِمٌ (ada yang masih berdiri) Dengan bangunan-bangunannya. وَحَصِيدٌ (dan ada (pula) yang telah musnah) Telah hancur dan roboh bangunannya sama sekali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Itulah kisah-kisah yang diceritakan Allah kepadamu dalam surah ini, wahai Nabi berupa kabar tentang umat-umat sebelumnya yang Kami hancurkan karena kufur dan berdusta. Di antara negeri-negeri itu ada yang masih tersisa jejaknya, ada yang hancur lebur hingga tiada jejak yang tersisa, seperti tanaman yang berdiri di atas tangkainya dan tanaman yang lenyap."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Itu adalah sebagian berita} kabat {tentang negeri-negeri yang Kami ceritakan kepadamu. Di antaranya masih ada bekasnya} masih berdiri bangunannya {dan ada yang telah musnah} di antaranya ada reruntuhan yang tidak bisa dilihat jejaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100 tatkala Allah menyebutkan kisah kisah umat dengan rasul rasul mereka, maka Allah berfirman kepada rasulNya ”itu adalah sebagian dari berita berita negeri (yang telah dibinasakan) yang kami ceritakan kepadamu (Muhammad)” agar kamu memperingatkan manusia dengannya, sebagai bukti kerasulanmu, nasihat dan pelajaran bagi orang orang yang beriman “diantara negeri negeri itu ada yang masih kedapatan bekas bekasnya” belum hilang sama sekali masih ada bekas bekas negeri yang menunjukannya. ”dan” darinya “ada (pula) yang telah musnah” tempat tinggal mereka terkikis habis, tak berbekas dan tidak ada tanda tandanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ذَٰلِكَ) dzalik : isyarat kepada kisah-kisah para Nabi yang telah disebutkan pada ayat-ayat sebelumnya. (مِنۡ أَنۢبَآءِ ٱلۡقُرَىٰ) min ambaa’il quraa : kisah-kisah tentang para penduduk negeri: kaum Nuh, ‘Ad, Tsamud, kaum Luth, penduduk Madyan, dan Firaun. (مِنۡهَا قَآئِمٞ وَحَصِيدٞ) minhaa qaa’imuw wa hashiid : di antara negeri tersebut ada yang masih tersisa seperti Madain Shalih, dan ada pula yang tidak tersisa sama sekali seperti negeri ‘Ad. Makna ayat : Ketika Allah mengkisahkan untuk Rasul-Nya dengan surat ini tentang kisah-kisah para umat terdahulu, berfirman : (ذَٰلِكَ) yang telah dikisahkan (مِنۡ أَنۢبَآءِ ٱلۡقُرَىٰ) tentang para penduduknya, Kami ceritakan kepada mu sebagai bentuk penetapan kenabianmu dan kerasulanmu, serta untuk memperkuat hatimu dan menghiburmu. Dan firman-Nya : (مِنۡهَا قَآئِمٞ وَحَصِيدٞ) dari negeri-negeri yang telah punah, ada yang masih tersisa dinding dan reruntuhannya, dan ada pula negeri seakan-akan sudah dipanen, hilang tidak tersisa sama sekali. Pelajaran dari ayat : • Penetapan nubuwah Nabi Muhammad shallahu ‘alaihi wa sallam, serta penyampaian risalahnya, dan hiburan untuknya dengan kisah yang Allah sampaikan tentang orang-orang terdahulu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 100: Agar engkau memperingatkan manusia dengannya, menjadi bukti kerasulanmu dan menjadi pelajaran bagi orang-orang yang beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 100",
    "description": "Setelah diuraikan beberapa kisah para nabi beserta kaumnya yang ingkar terhadap risalah yang dibawa para nabi dan akibat pengingkaran mereka, ayat berikut ini menegaskan tujuan dipaparkannya kisah-kisah tersebut. Itulah beberapa berita tentang negeri-negeri yang telah kami binasakan penduduknya akibat kekufuran mereka yang kami ceritakan kepadamu wahai nabi Muhammad, agar engkau sampaikan kepada umatmu sebagai pelajaran bagi mereka. Di antara negeri-negeri itu sebagian masih ada bekas-bekas peninggalannya yang tersisa dan ada pula yang telah musnah hingga tidak ada bekasnya sama sekali. Dan terhadap kisah-kisah tersebut hendaknya semua orang tahu bahwa kami tidak menzalimi mereka sedikit pun dengan menimpakan azab kepada orang yang tidak berbuat zalim, tetapi merekalah yang menzalimi diri mereka sendiri dengan kekufuran dan kedurhakaan, karena itu tidak bermanfaat sedikit pun bagi mereka sembahan, yaitu berhalaberhala yang mereka sembah selain Allah, lantaran berhala itu tidak bisa menolong atau menghalangi sedikit pun ketika siksaan tuhanmu datang. Sembahan itu hanya menambah kebinasaan dan kehinaan serta kerugian bagi mereka karena tidak mampu mendatangkan manfaat dan menolak mudarat."
  }
]