[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan penghancuran mereka bukanlah terjadi tanpa sebabdan dosa yang berhak menerimanya. Akan tetapi, (karena) mereka telah berbuat kezhaliman terhadap diri mereka dengan perbuatan syirik dan kerusakan yang mereka perbuat di muka bumi. Maka tidak bermanfaat sama sekali bagi mereka Tuhan-tuhan sesembahan mereka yang mereka seru dan mereka minta kepadanya untuk menyingkirkan mara bahaya dari mereka, ketika ketetapan tuhanmu telah pasti datang untuk menyiksa mereka. Dan tuhan-tuhan sesembahan mereka tidak menambah bagi mereka, kecuali kehancuran, kebinasaan, dan kerugian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Kami tidaklah menzalimi mereka ketika Kami membinasakan mereka. Tetapi mereka sendirilah yang menjerumuskan diri mereka ke dalam jurang kehancuran dengan kekafiran mereka kepada Allah. Dan tuhan-tuhan yang mereka sembah selain Allah tidak melindungi mereka dari azab yang menimpa mereka ketika Tuhanmu -wahai Rasul- memerintahkan untuk membinasakan mereka. Bahkan tuhan-tuhan yang mereka sembah itu semakin memperparah kerugian dan kehancuran mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Kami tidak menzalimi mereka ketika Kami membinasakan mereka, akan tetapi mereka menzalimi diri mereka sendiri dengan menejerumuskannya ke dalam kebinasaan. Sesembahan-sesembahan yang mereka sembah selain Allah tidak dapat menyelamatkan mereka, dan tidak menambah bagi mereka melainkan kebinasaan dan kehancuran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَمَا ظَلَمْنٰهُمْ (Dan Kami tidaklah menganiaya mereka) Atas azab yang Kami timpakan kepada mereka. وَلٰكِن ظَلَمُوٓا۟ أَنفُسَهُمْ ۖ (tetapi merekalah yang menganiaya diri mereka sendiri) Dengan kakafiran dan kemaksiatan yang merupakan sebab kebinasaan. Maka mereka sendirilah yang mengundang kebinasaan bagi diri mereka. فَمَآ أَغْنَتْ عَنْهُمْ ءَالِهَتُهُمُ(karena itu tiadalah bermanfaat sedikitpun kepada mereka sembahan-sembahan) Yakni tidak dapat menolak azab dari mereka. لَّمَّا جَآءَ أَمْرُ رَبِّكَ ۖ (di waktu azab Tuhanmu datang) Ketika azab Allah telah datang. وَمَا زَادُوهُمْ غَيْرَ تَتْبِيبٍ (Dan sembahan-sembahan itu tidaklah menambah kepada mereka kecuali kebinasaan belaka) Yakni sembahan-sembahan itu tidak menambah bagi mereka kecuali kebinasaan dan kerugian, padahal dulunya mereka menganggap sesembahan itu dapat memberi mereka manfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Dan Kami tidaklah zalim dengan membinasakan mereka tanpa sebab dosa, namun mereka menzalimi diri sendiri dengan berbuat kekufuran dan kemaksiatan. Tuhan-tuhan mereka yaitu berhala- berhala yang mereka sembah tidak berguna bagi mereka untuk menyelamatkan dari azab, melainkan membuat mereka semakin menderita ketika telah datang perintah Tuhanmu untuk mengazab mereka. Berhala-berhala yang mereka sembah tidak memberikan apapun selain kehancuran dan kerugian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak menzalimi mereka, tetapi merekalah yang menzalimi diri sendiri. Maka tidak bermanfaat} tidak bisa menjaga mereka {sedikit pun bagi mereka tuhan-tuhan yang mereka sembah selain Allah ketika datang keputusan Tuhanmu. Itu menambah mereka kecuali kebinasaan} kerugian dan kehancuran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101 \"dan kami tidaklah menganiaya mereka” dengan menimpakan berbagai azab kepada mereka, ”tetapi yang menganiaya diri mereka sendiri” dengan syirik, kufur dan penentangan ”karena itu tiadalah bermanfaat sedikitpun kepada mereka sembahan sembahan yang mereka seru selain Allah ketika azab Rabbmu datang” begitulah semua orang yang berlindung kepada selain Allah, ia tidak dapat melindunginya pada waktu azab itu turun. ”dan sembahan sembahan itu tidaklah menambah kepada mereka melainkan kebinasaan belaka” kerugian, kebinasaan tidak seperti yang terlintas dibenak mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلَّتِي يَدۡعُونَ) allatii yad’uuna : yang mereka sembah dengan berdoa dan selainnya: menyembelih, nadzar, dan bersumpah atas nama mereka. (غَيۡرَ تَتۡبِيبٖ) ghaira tatbiib : kerugian dan kebinasaan. Makna ayat : Firman-Nya (وَمَا ظَلَمۡنَٰهُمۡ) kami tidak menzalimi mereka dengan menghancurkan mereka, tapi mereka sendirilah yang menzalimi diri mereka sendiri dengan kesyirikan, maksiat, menentang ayat-ayat Kami, serta angkuh terhadap Rasul Kami. Firman-Nya (فَمَآ أَغۡنَتۡ عَنۡهُمۡ ءَالِهَتُهُمُ ٱلَّتِي يَدۡعُونَ مِن دُونِ ٱللَّهِ مِن شَيۡءٖ) berhala-berhala yang mereka jadikan tuhan—dengan beribadah kepadanya dengan berbagai ibadah: doa, nadzar, menyembelih, dan pengagungan—tidak memberikan manfaat sama sekali (لَّمَّا جَآءَ أَمۡرُ رَبِّكَۖ) ketika datang azab Kami (وَمَا زَادُوهُمۡ غَيۡرَ تَتۡبِيبٖ) dan tidaklah memberikan mereka kecuali kerugian dan kebinasaan. Pelajaran dari ayat : • Sucinya Allah dari kezaliman ketika menghancurkan para pelaku syirik dan zalim. • Sesembahan orang-orang musyrik tidak memberikan manfaat sama sekali ketika datangnya azab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 101: Dengan membinasakan mereka tanpa dosa. Dengan berbuat syirk, kufur dan pembangkangan. Tidak seperti yang mereka sangka selama ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 101",
    "description": "Dan terhadap kisah-kisah tersebut hendaknya semua orang tahu bahwa kami tidak menzalimi mereka sedikit pun dengan menimpakan azab kepada orang yang tidak berbuat zalim, tetapi merekalah yang menzalimi diri mereka sendiri dengan kekufuran dan kedurhakaan, karena itu tidak bermanfaat sedikit pun bagi mereka sembahan, yaitu berhalaberhala yang mereka sembah selain Allah, lantaran berhala itu tidak bisa menolong atau menghalangi sedikit pun ketika siksaan tuhanmu datang. Sembahan itu hanya menambah kebinasaan dan kehinaan serta kerugian bagi mereka karena tidak mampu mendatangkan manfaat dan menolak mudarat. Kemudian Allah mengingatkan, dan begitulah siksa tuhanmu apabila dia menyiksa penduduk negeri-negeri yang berbuat zalim dengan menyekutukan Allah dan berbuat durhaka. Sungguh, siksa-Nya sangat pedih, lagi sangat berat sehingga sulit menghindarkan diri darinya. Kisah-kisah umat terdahulu yang dipaparkan tersebut adalah sebagai pelajaran bagi generasi sesudahnya."
  }
]