[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana aku telah menghukum suatu penduduk negeri yang zhalim dengan siksaan lantaran mendurhakai perintahKu dan mendustakan rasul-rasulKu, aku (juga) akan menghukum orang-orang yang lain dari penduduk negeri-negeri, jika mereka berbuat kezhaliman terhadap diri mereka dengan kafir kepada Allah, kemaksiatan mereka kepada Allah dan pendustaan mereka terhadap rasul-rasulNya. Sesungguhnya siksaan Allah sangat menyakitkan lagi keras."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Begitulah hukuman dan pembinasaan yang Allah berikan kepada penduduk negeri-negeri yang mendustakan ayat-ayat-Nya kapanpun dan dimanapun mereka berada. Sesungguhnya hukuman yang Allah berikan kepada penduduk negeri-negeri yang zalim itu adalah hukuman yang sangat memilukan dan mengerikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Demikianlah contoh-contoh siksaan Allah kepada para penduduk negeri yang zalim, sungguh siksaan Allah sangat keras dan pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. وَهِىَ ظٰلِمَةٌ ۚ (ketika penduduk negeri-negeri yang berbuat zalim) Yakni Allah mengazab penduduk negeri yang zalim tersebut. إِنَّ أَخْذَهُۥٓ (Sesungguhnya azab-Nya itu) Yakni siksa Allah bagi orang-orang kafir. أَلِيمٌ شَدِيدٌ (sangat pedih lagi keras) Menyakitkan dan berat. Imam Bukhari dan Muslim mengeluarkan hadits dari Abu Musa al-Asy’ari, ia berkata, Rasulullah bersabda: “sesungguhnya Allah menangguhkan azab bagi orang yang zalim, agar jika ia telah mengazabnya niscaya Dia tidak akan membiarkannya lolos” kemudian beliau membaca ayat (وكذلك أخذ ربك إذا أخذ القرى وهي ظالمة إن أخذه أليم شديد)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Mukmin yang berakal tidak akan terlena oleh akibat buruk yang terlambat, melainkan ia akan membela diriya sebelum ia sampai dengan taubat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Seperti azab itulah tuhanmu menghukum penduduk suatu negeri, dan mereka itu zalim dengan melakukan dosa. Sesungguhnya hukumanNya bagi orang-orang kafir itu sangat menyakitkan sehingga tidak ada yang bisa lepas darinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikianlah siksaan Tuhanmu apabila Dia mengazab negeri-negeri yang berbuat zalim. Sesungguhnya siksaNya sangat pedih lagi sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102 maksudnya, azab meluluhlantakan dan menghancurkan mereka. tuhan yang mereka sembah selain Allah tidak berguna sedikitpun bagi mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِذَآ أَخَذَ ٱلۡقُرَىٰ) idzaa akhadzal quraa : jika Allah menyiksa suatu negeri karena dosa-dosa mereka. (أَلِيمٞ شَدِيدٌ) aliimun syadiid : sangat pedih dan menyakitkan. Makna ayat : Kemudian di ayat yang terakhir, Allah berfirman kepada Rasul-Nya Muhammad shalallahu ‘alahi wa sallam (وَكَذَٰلِكَ أَخۡذُ رَبِّكَ) begitu pula azab yang telah disebutkan, yaitu siksa Rabbmu (إِذَآ أَخَذَ ٱلۡقُرَىٰ) ketika mengazab negeri dan kota beserta penghuninya yang zalim dengan syirik dan maksiat. (إِنَّ أَخۡذَهُۥٓ أَلِيمٞ شَدِيدٌ) sangat pedih tidak ada yang mampu menahannya, lalu apakah para orang musyrik, kafir, zalim mau mengambil pelajaran dan meninggalkan perbuatan syirik mereka, kufur, dan kezaliman sebelum Allah menyiksa mereka sebagaimana yang terjadi pada kaum sebelum mereka. Pelajaran dari ayat : • Tercelanya sifat zalim, dan akibat buruk dari para orang zalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 102: Imam Bukhari dan Muslim meriwayatkan dari Abu Musa Al Asy’ariy radhiyallahu 'anhu, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda: « إِنَّ اللَّهَ لَيُمْلِى لِلظَّالِمِ حَتَّى إِذَا أَخَذَهُ لَمْ يُفْلِتْهُ ». قَالَ : ثُمَّ قَرَأَ ( وَكَذَلِكَ أَخْذُ رَبِّكَ إِذَا أَخَذَ الْقُرَى وَهْىَ ظَالِمَةٌ إِنَّ أَخْذَهُ أَلِيمٌ شَدِيدٌ ) . “Sesungguhnya Allah memberi tangguh orang yang zalim. Namun apabila Dia sudah menyiksanya, maka Dia tidak akan meloloskannya.” Kemudian Beliau membacakan ayat, “Dan begitulah siksa Tuhanmu apabila Dia menyiksa (penduduk) negeri-negeri yang berbuat zalim. Sungguh, siksa-Nya sangat pedih lagi keras.” (Terj. Huud: 102)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 102",
    "description": "Kemudian Allah mengingatkan, dan begitulah siksa tuhanmu apabila dia menyiksa penduduk negeri-negeri yang berbuat zalim dengan menyekutukan Allah dan berbuat durhaka. Sungguh, siksa-Nya sangat pedih, lagi sangat berat sehingga sulit menghindarkan diri darinya. Kisah-kisah umat terdahulu yang dipaparkan tersebut adalah sebagai pelajaran bagi generasi sesudahnya. Setelah diuraikan tentang azab yang menimpa umat-umat terdahulu disebabkan oleh perbuatan zalim yang mereka lakukan, ayat berikutnya menegaskan perihal pelajaran yang dapat dipetik dari uraian tersebut. Sesungguhnya pada yang demikian itu, yaitu peristiwa kehancuran negeri-negeri yang penduduknya zalim itu pasti terdapat pela-jaran yang sangat berharga bagi orang-orang yang takut kepada azab akhirat. Hari akhir itulah hari ketika semua manusia dikumpulkan untuk dihisab kemudian menerima sanksi atau pahala atas amal perbuatan mereka di dunia, dan itulah hari yang disaksikan oleh semua makhluk dari generasi pertama hingga generasi terakhir."
  }
]