[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pada peristiwa hukuman dari kami terhadap para penduduk negeri-negeri zaman dulu yang berbuat kezhaliman, benar-benar terdapat pelajaran dan pesan baik bagi orang yang takut terhadap siksaan Allah dan azabNya di akhirat. Hari tersebut adalah hari dimana manusia dikumpulkan dihadapanNya untuk menghadapi perhitungan amal dan pembalasannya, dan seluruh makhluk semuanya menyaksikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Sesungguhnya hukuman berat yang Allah timpakan kepada penduduk negeri-negeri yang zalim itu mengandung pelajaran yang berharga bagi orang yang takut akan azab di Hari Kiamat. Yaitu hari di saat Allah menghimpun seluruh umat manusia untuk diperhitungkan amal mereka. Dan itu adalah hari yang disaksikan oleh semua orang yang hadir di Padang Mahsyar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Sungguh pada azab tersebut terdapat ibrah dan pelajaran bagi orang yang takut terhadap azab akhirat, dan sungguh itu sangat layak untuk menjadi pelajaran. Dan siksaan di dunia yang masih menyisakan peninggalan-peninggalannya adalah dalil dan bukti adanya azab di akhirat, pada hari itu seluruh manusia akan dikumpulkan, orang-orang pada generasi terdahulu dan generasi selanjutnya akan menghadirinya, dan juga seluruh penduduk langit dan bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. إِنَّ فِى ذٰلِكَ لَءَايَةً (Sesungguhnya pada yang demikian itu benar-benar terdapat pelajaran) Sebagai ibrah dan pelajaran. لِّمَنْ خَافَ عَذَابَ الْاٰخِرَةِ ۚ( bagi orang-orang yang takut kepada azab akhirat) Karena merekalah orang-orang yang dapat mengambil ibrah dan perlajaran. ذٰلِكَ يَوْمٌ مَّجْمُوعٌ لَّهُ النَّاسُ(Hari kiamat itu adalah suatu hari yang semua manusia dikumpulkan untuk (menghadapi)nya) yakni manusia hari itu dikumpulkan untuk dihisab dan diberi balasan. وَذٰلِكَ (dan hari itu) Yakni hari kiamat. يَوْمٌ مَّشْهُودٌ (hari yang disaksikan) Yang disaksikan oleh orang-orang yang dikumpulkan di padang mahsyar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tatkala Allah menjelaskan dalam surah ini beberapa hukuman bagi kaum-kaum yang mendustakan Rasul-rasul Nya, juga apa yang terjadi pada mereka dari kehinaan; Allah kemudian berfirman pada penghujung surah : { إِنَّ فِي ذَٰلِكَ لَآيَةً لِمَنْ خَافَ عَذَابَ الْآخِرَةِ } bahwasanya hukuman-hukuman bagi para penentang Allah itu adalah pelajaran penting bagi mereka takut akan hari akhir, sedangkan orang yang tidak ada keimanan dalam dirinya dan tidak ada rasa takut dalam benaknya ayat-ayat ini tidak akan berguna baginya sebagai pelajaran, bahkan ketika ayat-ayat itu dibacakan mereka hanya berkata : \"sesungguhnya aku masih berada dalam kesejahteraan dan kebahagiaan\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Sesungguhnya dalam kisah-kisah yang berkaitan dengan kabar-kabar para pendahulu dan kebinasaan mereka itu terdapat pelajaran dan nasehat bagi orang yang takut dengan azab akhirat yang sangat dahsyat. Hal itu terjadi pada hari kiamat. Pada hari itu, manusia dikumpulkan untuk dihisab dan dibalas. Dan hari itu adalah hari yang disaksikan oleh seluruh makhluk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya pada yang demikian itu terdapat pelajaran} terdapat teladan dan pelajaran {bagi orang yang takut pada azab akhirat. Itu adalah hari ketika manusia dikumpulkan dan itu adalah hari yang disaksikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103 “sesungguhnya pada yang demikian itu” azab Allah yang disebutkan yang menghancurkan orang orang yang zhalim itu, dengan berbagai macam azab, ”benar benar terdapat pelajaran bagi orang yang takut akan azab akhirat\" yakni, pelajaran dan dalil bahwa orang orang zhalim dan para pelaku kejahatan, mereka akan ditimpa hukuman dunia dan akhirat. Kemudian Allah berpindah dari pembahasan ini kepada penjelasan akhirat. Dia berfirman ”hari kiamat itu adalah suatu hari yang semua manusia dikumpulkan pada hari itu untuk mendapatkan balasan dan untuk memperlihatkan kepada mereka kebesaran dan keagungan serta keadilan Allah yang besar yang dengannya mereka akan mengenalNya dengan sebenarnya. ”dan hari itu adalah suatu hari yang disaksikan (oleh segala sesuatu)” yakni disaksikan oleh Allah , malaikat, dan seluruh makhluk."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَأٓيَةٗ) la aayah : tanda bahwa Dzat yang mampu mengazab di dunia, pasti mampu untuk mengazab pula di akhirat kelak. (يَوۡمٞ مَّشۡهُودٞ) yaumum masyhuud : yang akan disaksikan oleh seluruh makhluk yaitu hari kiamat. Makna ayat : Firman-Nya (إِنَّ فِي ذَٰلِكَ لَأٓيَةٗ) hukuman yang Allah berikan kepada para umat yang zalim, serta azab yang turun kepada mereka adalah tanda yang jelas, bahwa Dzat yang mampu mengazab mereka di dunia, mampu untuk mengazab di akhirat. Maka seorang yang beriman akan perjumpaannya dengan Allah akan melihat ayat (pelajaran) dari peristiwa tersebut. Merekapun terus menerus menjaga ketakwaan mereka hingga mereka bertemu dengan Allah dalam keadaan beriman kepada-Nya, taat kepada perintah dan menjauhi larangan-Nya. Firman-Nya (ذَٰلِكَ يَوۡمٞ مَّجۡمُوعٞ لَّهُ ٱلنَّاسُ وَذَٰلِكَ يَوۡمٞ مَّشۡهُودٞ) hari yang ada azab akhirat adalah hari dimana seluruh manusia dikumpulkan untuk mendapatkan balasan atas perbuatan mereka. (وَذَٰلِكَ يَوۡمٞ مَّشۡهُودٞ) hari yang disaksikan oleh seluruh makhluk. Pelajaran dari ayat : • Keutamaan beriman kepada hari akhir. • Kepastian adanya kebangkitan pada hari kiamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 103: Yakni pada kisah-kisah yang disebutkan itu atau pada siksaan yang ditimpakan kepada orang-orang zalim. Atau terdapat ayat, yakni dalil yang menunjukkan bahwa orang-orang zalim akan mendapatkan hukuman duniawi dan ukhrawi. Selanjutnya, Allah menyifatkan keadaan akhirat. Yakni untuk dihisab dan diberikan balasan, serta ditunjukkan kepada mereka keagungan Allah, kekuasaan-Nya dan keadilan-Nya, di mana dengan ditunjukkan hal tersebut mereka pun mengetahui keadaan yang sebenarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 103",
    "description": "Setelah diuraikan tentang azab yang menimpa umat-umat terdahulu disebabkan oleh perbuatan zalim yang mereka lakukan, ayat berikutnya menegaskan perihal pelajaran yang dapat dipetik dari uraian tersebut. Sesungguhnya pada yang demikian itu, yaitu peristiwa kehancuran negeri-negeri yang penduduknya zalim itu pasti terdapat pela-jaran yang sangat berharga bagi orang-orang yang takut kepada azab akhirat. Hari akhir itulah hari ketika semua manusia dikumpulkan untuk dihisab kemudian menerima sanksi atau pahala atas amal perbuatan mereka di dunia, dan itulah hari yang disaksikan oleh semua makhluk dari generasi pertama hingga generasi terakhir. Dan kami tidak akan menunda datangnya hari kiamat, karena waktunya telah ditetapkan, kecuali sampai waktu yang sudah ditentukan menurut perhitungan dan ketentuan Allah."
  }
]