[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidaklah mengundurkan hari kiamat dari kalian, melainkan sampai berakhirnya masa yang telah ditentukan dalam pengetahuan kami, tidak bertambah dan tidak berkurang dari ketentuan takdir kami sesuai dengan kebijaksanaan kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Dan Kami tidak akan menunda hari yang disaksikan itu kecuali sampai batas waktu yang sudah diketahui hitungannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Kami tidaklah menunda datangnya hari yang besar ini, akan tetapi hari ini memang memiliki waktu yang telah ditetapkan, tanpa disegerakan atau diakhirkan, sehingga ia belum datang bukan karena ketidakmampuan atau kelalaian Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. وَمَا نُؤَخِّرُهُۥٓ إِلَّا لِأَجَلٍ مَّعْدُودٍ (Dan Kami tiadalah mengundurkannya, melainkan sampai waktu yang tertentu) Dengan waktu yang telah diketahui. Dan Allah telah menentukan terjadinya pembalasan setelah itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Dan Kami tidak menunda hari kiamat itu kecuali sampai zaman yang ditentukan hitungannya di sisi Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak akan menundanya, kecuali sampai waktu yang sudah ditentukan} diketahui bilangannya di sisi Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104 “dan kami tiadalah mengundurkannya” yakni kedatangan hari kiamat “melainkan sampai waktu yang tertentu” jika masa dunia telah habis dan penciptaan di dalamnya yang telah ditakdirkan oleh Allah (telah selesai) maka pada saat itu Dia memindahkan mereka ke alam akhirat dan memberlakukan kepada mereka hukum hukumNya yang jaza’iyah (balasan) sebagaimana di dunia Dia telah memberlakukan kepada mereka hukum hukumNya syariyyah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لِأَجَلٖ مَّعۡدُودٖ) illaa liajalim ma’duud : waktu di dunia yang sebentar, beberapa hari atau jam. Makna ayat : Firman-Nya (وَمَا نُؤَخِّرُهُۥٓ إِلَّا لِأَجَلٖ مَّعۡدُودٖ) Kami mengundur tegakknya hari kiamat untuk menyempurnakan umur dunia yang hanya berkisar tahunan, hari, bahkan jam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 104: Yakni apabila ajal dunia habis. Ketika itulah, manusia dipindahkan ke alam akhirat dan diberlakukan hukum-hukum jaza’i(balasan)-Nya sebagaimana ketika di dunia diberlakukan hukum-hukum syar’i-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 104",
    "description": "Dan kami tidak akan menunda datangnya hari kiamat, karena waktunya telah ditetapkan, kecuali sampai waktu yang sudah ditentukan menurut perhitungan dan ketentuan Allah. Ketika hari kiamat itu datang, tidak ada seorang pun yang mampu berbicara untuk berdalih di hadapan Allah karena dahsyatnya hari itu, kecuali dengan izin-Nya, yakni diberi kemampuan berbicara. Maka di antara mereka ada yang sengsara akibat perbuatan buruk yang mereka lakukan, mereka adalah kelompok penghuni neraka, dan ada yang berbahagia karena amal baik yang mereka lakukan selama di dunia, mereka adalah penghuni surga."
  }
]