[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada saat hari kiamat tiba, tidak ada seorangpun yang berbicara, kecuali dengan izin tuhannya. Lalu diantara mereka ada yang celaka yang pantas mendapatkan azab, dan adapula yang bahagia yang memperoleh kemurahan(dari Allah) dengan nikmat-nikmat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Ketika hari itu datang tidak ada seorangpun yang bisa berbicara untuk menyampaikan hujah atau syafaat kecuali setelah mendapatkan izin dari Allah. Dan pada hari itu manusia terbagi menjadi dua golongan, golongan celaka yang akan masuk Neraka dan golongan bahagia yang akan masuk Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Jika hari ini telah tiba, maka tidak ada seorangpun yang dapat berbicara melainkan dengan izin Allah. Ketika itu keadaan manusia berbeda-beda, sebagian mereka berada dalam azab dan kesulitan, dan sebagian yang lain berada dalam kesejahteraan dan kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. يَوْمَ يَأْتِ لَا تَكَلَّمُ نَفْسٌ (Di kala datang hari itu, tidak ada seorangun yang berbicara) Yakni tidak berbicara dengan hujjah dan tidak untuk meminta syafaat. إِلَّا بِإِذْنِهِۦ (melainkan dengan izin-Nya) Untuk berbicara mengemukakan hujjah. Pada hari itu urusan hanya milik Allah semata tidak ada orang yang memberi syafaat sebelum Dia mengizinkan. فَمِنْهُمْ شَقِىٌّ وَسَعِيدٌ (maka di antara mereka ada yang celaka dan ada yang berbahagia) Yakni manusia terbagi menjadi dua golongan; penghuni neraka dan penghuni surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Pada hari datangnya kiamat itu tidak ada satupu jiwa yang bisa berbicara kecuali dengan ijin Tuhannya. Di antara manusia ada yang sedih dengan kekufurannya, yaitu para penduduk neraka dan ada yang bahagia dengan keimanannya, yaitu penduduk surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika hari itu datang, tidak seorang pun yang berbicara} tidak ada yang berbicara {kecuali dengan izinNya} dengan izin Allah {Maka di antara mereka ada yang sengsara dan berbahagia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105 “dikala datang hari itu” dimana seluruh makhluk berkumpul, ”tidak ada seorangpun yang berbicara, melainkan dengan izinNya” bahkan para malaikat, para nabi yang mulia tidak memberi syafaat kecuali dengan izinNya. ”maka diantara mereka ada yang celaka dan ada yang berbahagia” orang orang yang celaka adalah orang orang yang kafir kepada Allah, mendustakan rasul rasulNya dan menyelisihi perintahNya, sedangkan orang orang yang berbahagia adalah orang orang Mukmin yang bertakwa."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِلَّا بِإِذۡنِهِۦۚ) illaa bi’idznih : kecuali atas izin Allah. (شَقِيّٞ وَسَعِيدٞ) syaqiyyuw wa sa’iid : pada hari kiamat ada orang telah ditetapkan celaka, sehingga ia masuk kedalam neraka, ada pula orang yang ditetapkan bahagia, sehingga ia masuk kedalam surga. Makna ayat : Firman-Nya : (يَوۡمَ يَأۡتِ) yaitu pada hari kiamat (لَا تَكَلَّمُ نَفۡسٌ إِلَّا بِإِذۡنِهِۦۚ) tidak ada yang bisa berbicara kecuali atas izin Allah, firman-Nya : (فَمِنۡهُمۡ شَقِيّٞ وَسَعِيدٞ) manusia pada saat itu ada yang bahagia dan ada yang celaka, itu semua kembali kepada apa yang telah Allah tetapkan bagi seluruh manusia pada kitab takdir, kemudian berdasarkan apa yang mereka lakukan berupa kebaikan atau keburukan. Pelajaran dari ayat : • Setiap jiwa tidak mampu berbicara pada hari kiamat, sampai ia diberi izin (oleh Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 105: Dan semua makhluk berkumpul. Meskipun ia seorang nabi atau pun malaikat. Semuanya tercatat sejak dahulu. Orang-orang yang sengsara adalah orang-orang yang kafir kepada Allah dan Rasul-Nya serta mendurhakai perintah-Nya. Sedangkan orang-orang yang berbahagia adalah orang-orang yang beriman dan bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 105",
    "description": "Ketika hari kiamat itu datang, tidak ada seorang pun yang mampu berbicara untuk berdalih di hadapan Allah karena dahsyatnya hari itu, kecuali dengan izin-Nya, yakni diberi kemampuan berbicara. Maka di antara mereka ada yang sengsara akibat perbuatan buruk yang mereka lakukan, mereka adalah kelompok penghuni neraka, dan ada yang berbahagia karena amal baik yang mereka lakukan selama di dunia, mereka adalah penghuni surga. Maka adapun orang-orang yang sengsara di akhirat akibat perbuatan buruk yang mereka lakukan ketika di dunia, maka tempat tinggalnya adalah di dalam neraka, di sana mereka mendesah keras ketika mengeluarkan nafas dan demikian pula ketika menarik nafas diiringi dengan suara merintih, karena pedihnya siksaan neraka."
  }
]