[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "106-107. Adapun orang-orang yang celaka di kehidupan dunia, dikarenakan rusaknya keyakinan mereka dan buruknya perbuatan-perbuatan mereka, maka neraka menjadi tempat tinggal mereka. Bagi mereka disana, dahsyatnya siksaan yang mereka alami, terdengar dari mereka suara rintihan dan tarikan nafas karena kerasnya siksaan itu. Dan keduanya merupakan seburuk-buruk suara. Mereka tinggal di dalamnya selama-lamanya, selama langit dan bumi ada, siksaan mereka tidak putus-putus dan tidak berakhir, akan tetapi benar-benar abadi, kecuali apa yang dikehendaki tuhanmu berupa mengeluarkan para pendurhaka dari kalangan orang-orang yang bertauhid setelah beberapa lama mereka tinggal di dalam neraka. Sesungguhnya tuhanmu wahai rasul, maha berbuat apa yang dikehendakiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Orang-orang yang celaka akibat kekafiran mereka dan perbuatan mereka yang rusak akan masuk Neraka. Di dalam Neraka itu suara dan hembusan nafas mereka terdengar sangat keras akibat sengatan nyala apinya yang sangat dahsyat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106-107. Adapun orang-orang yang menderita, mereka berada di neraka, mereka bernafas dan berteriak dengan suara yang keras, yang menggambarkan keadaan mereka, mereka akan kekal di dalamnya selama masih ada langit dan bumi, kecuali jika Allah menghendaki untuk mengeluarkan orang-orang beriman yang banyak melakukan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. فَأَمَّا الَّذِينَ شَقُوا۟ (Adapun orang-orang yang celaka) Dari golongan orang-orang kafir dan pelaku maksiat. Yakni ditetapkan bagi mereka keburukan karena kekafiran dan kerusakan amalan mereka. فَفِى النَّارِ لَهُمْ فِيهَا زَفِيرٌ وَشَهِيقٌ(maka (tempatnya) di dalam neraka, di dalamnya mereka mengeluarkan dan menarik nafas (dengan merintih)) Makna (الزفير) yakni mengeluarkan nafas dengan suara yang keras dikarenakan rasa sakit pada dada mereka. Makna (الشهيد) yakni menarik nafas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Adapun orang-orang yang sedih dengan kekufuran dan kemaksiatannya itu telah diketahui oleh Allah SWT. Dan mereka itu menetap di neraka. Mereka terengah engah di dalamnya karena sangat kesakitan dadanya dan susah bernafas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang sengsara, maka di dalam neraka. Dan di sana mereka menarik nafas dan merintih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106 mengenai balasan mereka. ”adapun orang orang yang celaka” yakni, kesengsaraan, kehinaan dan rasa malu terjadi pada mereka, ”maka (tempatnya) didalam neraka” terbenam di dalam azabnya dengan hukuman yang berat di dalamnya. ”di dalamnya mereka” karena beratnya siksa “mengeluarkan dan menarik nafas (dengan merintih)” suara yang paling jelek dan paling buruk."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (زَفِيرٞ وَشَهِيقٌ) zafiiruw wa syahiiq : az-zafiir adalah teriakan, asy-syahiiq adalah rintihan. Makna ayat : Firman-Nya : (فَأَمَّا ٱلَّذِينَ شَقُواْ) adapun orang yang telah Allah tetapkan celaka, (فَفِي ٱلنَّارِ لَهُمۡ فِيهَا زَفِيرٞ) maka ia berada di dalam nereka, di dalamnya mereka berteriak (وَشَهِيقٌ) yaitu rintihan, keduanya adalah suara yang saling bergandengan, seperti ringkikan keledai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 106: Karena demikian kerasnya azab yang diberikan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 106",
    "description": "Maka adapun orang-orang yang sengsara di akhirat akibat perbuatan buruk yang mereka lakukan ketika di dunia, maka tempat tinggalnya adalah di dalam neraka, di sana mereka mendesah keras ketika mengeluarkan nafas dan demikian pula ketika menarik nafas diiringi dengan suara merintih, karena pedihnya siksaan neraka. Keberadaan mereka kekal di dalamnya dalam waktu yang lama selama ada langit dan bumi ketika di dunia, dan mereka pun tidak bisa keluar darinya kecuali jika tuhanmu menghendaki untuk mengeluarkan salah seorang dari mereka yang berbuat maksiat namun mereka beriman kepada Allah. Mereka ini disiksa di neraka karena dosa-dosanya. Sungguh, tuhanmu maha pelaksana terhadap apa yang dia kehendaki baik di dunia maupun di akhirat, sehingga tidak ada satu pun yang dapat mengelak atau menghindar dari ketetapan-Nya."
  }
]