[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "106-107. Adapun orang-orang yang celaka di kehidupan dunia, dikarenakan rusaknya keyakinan mereka dan buruknya perbuatan-perbuatan mereka, maka neraka menjadi tempat tinggal mereka. Bagi mereka disana, dahsyatnya siksaan yang mereka alami, terdengar dari mereka suara rintihan dan tarikan nafas karena kerasnya siksaan itu. Dan keduanya merupakan seburuk-buruk suara. Mereka tinggal di dalamnya selama-lamanya, selama langit dan bumi ada, siksaan mereka tidak putus-putus dan tidak berakhir, akan tetapi benar-benar abadi, kecuali apa yang dikehendaki tuhanmu berupa mengeluarkan para pendurhaka dari kalangan orang-orang yang bertauhid setelah beberapa lama mereka tinggal di dalam neraka. Sesungguhnya tuhanmu wahai rasul, maha berbuat apa yang dikehendakiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Mereka tinggal di dalam Neraka untuk selama-lamanya. Mereka tidak akan keluar darinya sepanjang langit dan bumi masih ada. Kecuali orang-orang yang Allah kehendaki untuk dikeluarkan dari sana. Yaitu orang-orang yang menganut ajaran tauhid tetapi mereka memiliki dosa. Sesungguhnya Tuhanmu -wahai Rasul- Maha kuasa melakukan apa saja yang dikehendaki-Nya. Tidak seorangpun dapat memaksakan kehendaknya kepada Dia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. خٰلِدِينَ فِيهَا مَا دَامَتِ السَّمٰوٰتُ وَالْأَرْضُ (mereka kekal di dalamnya selama ada langit dan bumi) Yakni mereka kekal di dalamnya selama-lamanya tanpa henti dan tak ada habisnya. Dan yang dimaksud adalah langit dan bumi di akhirat. إِلَّا مَا شَآءَ رَبُّكَ ۚ (kecuali jika Tuhanmu menghendaki (yang lain)) Dengan mengakhirkan suatu kaum dari ketetapan itu. Pendapat lain mengatakan yakni orang-orang beriman yang bermaksiat akan dikeluarkan dari neraka, dan menyisakan orang-orang kafir di dalamnya. إِنَّ رَبَّكَ فَعَّالٌ لِّمَا يُرِيدُ (Sesungguhnya Tuhanmu Maha Pelaksana terhadap apa yang Dia kehendaki) Berbuat di dunia dan di akhirat sesuai kehendak-Nya. Umar bin Khattab berkata: “seandainya penghuni neraka tinggal didalamnya dengan jumlah hari seperti jumlah tiap bulir pasir yang ada di padang pasir niscaya mereka masih ada kesempatan untuk keluar dari neraka.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Mereka menetap di neraka selama keabadian langit dan bumi di dunia. Menurut bangsa Arab ungkapan ini adalah ungkapan untuk menunjukkan keabadian yang menggunakan perumpamaan, yaitu kinayah untuk menunjukkan keabadian. Ketentuan itu sesuai dengan kehendak Allah yang mana tidak ada satupun yang berkuasa di atasNya. Dia adalah Dzat yang melakukan sesuatu sesuai kehendakNya. Dan di antara kehendakNya adalah mengabadikan orang–orang yang berbuat maksiat terhadap orang-orang mukmin abadi di neraka. Sesungguhnya Allah melakukan sesuatu yang dikehendakiNya di dunia dan akhirat, dan tidak ada satupun yang bisa menghalanginya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka kekal di dalamnya} mereka tinggal di dalam neraka selamanya {selama masih ada langit dan bumi, kecuali Tuhanmu menghendaki} kecuali orang di antara para pelaku maksiat yang bertauhid yang dikehendaki Allah untuk dikeluarkan {Sesungguhnya Tuhanmu Maha Melaksanakan apa yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107 “mereka kekal didalamnya” yakni, neraka dengan azab yang demikian “selama ada langit dan bumi, kecuali jika Rabbmu menghendaki (yang lain)” yakni, mereka kekal di dalamnya selama lamanya kecuali batas waktu yang dikehendaki Allah agar mereka tidak berada di dalamnya. hal itu sebelum mereka masuk ke dalamnya sebagaimana yang dikatakan oleh mayoritas ahli tafsir. Jadi pengecualian atas hal ini kembali kepada sebelum mereka memasukinya. Maka mereka kekal di dalamnya selama lamanya kecuali waktu dimana mereka belum memasukinya. ”sesungguhnya Rabbmu maha pelaksana terhadap apa yang Dia kehendaki” semua yang diinginkan oleh Allah untuk dilakukan dan dituntut oleh hikmahNya maka Allah pasti melakukannya, tiada seorangpun yang menghalangi Allah dari keinginanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (خَٰلِدِينَ فِيهَا) mereka kekal di dalamnya, neraka (مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۚ إِنَّ رَبَّكَ فَعَّالٞ لِّمَا يُرِيدُ) selama langit dan bumi masih tegak. Firman-Nya : (إِلَّا مَا شَآءَ رَبُّكَۚ) pelaku dosa besar tidak akan kekal di neraka selama mereka adalah orang yang beriman. Firman-Nya : (إِنَّ رَبَّكَ فَعَّالٞ لِّمَا يُرِيدُ) Sesungguhnya Rabb kalian—wahai seluruh manusia—melakukan segala sesuatu terserah dengan kehendaknya, jika Dia menginginkan sesuatu, Dia akan melaksanakannya dan tidak akan ada yang bisa menghalangi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 107: Dengan diberi tambahan waktu yang tidak ada akhirnya, maksudnya adalah bahwa mereka kekal di dalamnya selama-lamanya. Jumhur (mayoritas) para mufassir mengatakan, bahwa maksud “selama ada langit dan bumi, kecuali jika Tuhanmu menghendaki (yang lain)” adalah mereka kekal di neraka selama-lamanya kecuali waktu yang dkehendaki Allah mereka tidak berada di dalamnya, yaitu waktu sebelum mereka memasuki neraka. Setiap yang ingin dikerjakan-Nya dan sesuai hikmah-Nya, maka Dia melakukannya, tidak ada seorang pun yang dapat menolaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 107",
    "description": "Keberadaan mereka kekal di dalamnya dalam waktu yang lama selama ada langit dan bumi ketika di dunia, dan mereka pun tidak bisa keluar darinya kecuali jika tuhanmu menghendaki untuk mengeluarkan salah seorang dari mereka yang berbuat maksiat namun mereka beriman kepada Allah. Mereka ini disiksa di neraka karena dosa-dosanya. Sungguh, tuhanmu maha pelaksana terhadap apa yang dia kehendaki baik di dunia maupun di akhirat, sehingga tidak ada satu pun yang dapat mengelak atau menghindar dari ketetapan-Nya. Dan adapun orang-orang yang berbahagia, maka tempat kembali mereka adalah di dalam surga yang penuh kenikmatan di sisi Allah yang maha mulia. Mereka kekal di dalamnya dalam waktu lama selama ada langit dan bumi ketika di dunia, kecuali jika tuhanmu menghendaki mereka diampuni dosanya lalu diberi balasan masuk surga atas amal saleh yang mereka lakukan. Anugerah Allah bagi ahli surga adalah sebagai karunia yang tidak ada putus-putusnya, melainkan kekal sepanjang masa."
  }
]