[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedangkan orang-orang yang diberi karunia kebahgiaan bagi mereka, mereka masuk kedalam surga, abadi di dalamnya selama langit dan bumi masih ada, kecuali golongan yang Allah kehendaki untuk menunda mereka masuk, yaitu orang-orang yang bermaksiat dari kalangan ahli tauhid, sesungguhnya mereka akan berada di dalam neraka beberapa waktu lamanya, kemudian dikeluarkan dari sana menuju surga dengan kehendak Allah dan rahmatNya. Dan tuhanmu akan memberikan kepada orang-orang yang bahagia di dalam surga karunia yang tidak terputus-putus dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Sedangkan orang-orang bahagia yang telah mendapatkan kebahagiaan dari Allah karena keimanan dan amal perbuatan baik mereka akan masuk Surga. Mereka tinggal di Surga itu untuk selama-lamanya sepanjang langit dan bumi masih ada. Kecuali orang yang Allah kehendaki untuk dimasukkan ke Neraka terlebih dahulu sebelum dimasukkan ke Surga. Yaitu orang-orang mukmin yang memiliki dosa. Sesungguhnya nikmat yang Allah berikan kepada penghuni Surga tidak pernah terputus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Adapun orang-orang yang ditetapkan Allah mendapat kebahagiaan, maka mereka berada di dalam surga, mereka tinggal di dalam istana-istana dan rumah-rumah yang ada di dalamnya; mereka bersenang-senang di antara naungan-naungannya yang luas dan pohon-pohonnya yang berbuah lebat. Mereka akan kekal di dalamnya kecuali jika Allah menghendaki lain, kerena segala hal terjadi atas kehendak-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. وَأَمَّا الَّذِينَ سُعِدُوا۟ (Adapun orang-orang yang berbahagia) Ditetapkan bagi mereka kebahagiaan dengan keimanan dan amal baik mereka. إِلَّا مَا شَآءَ رَبُّكَ ۖ (kecuali jika Tuhanmu menghendaki (yang lain)) Yang dimaksud adalah karena mereka terlambat dalam masuk ke kubur dan ketika di padang mahsyar sebelum mereka masuk surga. عَطَآءً غَيْرَ مَجْذُوذٍ (sebagai karunia yang tiada putus-putusnya) Terbentang tanpa ada batas dan tanpa terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Adapun orang-orang yang berbahagia, dengan keimanan mereka dan amal shaleh mereka itu juga diketahui dan dibantu oleh Allah. Mereka itu menetap di surga selamanya, selama langit dan bumi. Menurut kalam bangsa Arab, ungkapan itu adalah untuk menunjukkan keabadian. Ketentuan itu sesuai dengan kehendak Allah yang mana tidak ada satupun makhluk yang beisa menaklukanNya. Dan di antara kehendakNya yaitu memuliakan mereka dengan sesuatu yang lebih agung dari hal itu. Tuhan memberi mereka pemberian yang tiada putus dan bersambung selama-lamanya. Perbedaan manusia terkait derajat rendah neraka dan derajat tinggi surga tidak bisa mencegah setiap hal yang disebutkan itu. Dia membalas setiap orang sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang berbahagia, maka di dalam surga. Mereka kekal di dalamnya selama masih ada langit dan bumi, kecuali jika Tuhanmu menghendaki} kecuali orang di antara para pelaku maksiat yang bertauhid yang dikehendaki Allah untuk dimasukkan neraka sebelum dimasukkan ke surga {sebagai karunia yang tidak putus-putusnya} tidak terputus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108 “adapun orang orang yang berbahagia” yakni yang meraih kebahagiaan, kemenangan, dan keberuntungan ”maka tempatya di dalam surge, mereka kekal didalamnya selama ada langit dan bumi, kecuali jika Rabbmu menghendaki (yang lain)” kemudia Dia menegaskannya dengan FirmanNya ”sebagai karunia yang tiada putus putusnya.” Nikmat yang kekal dan kelezatan yang tinggi yang Allah berikan kepada mereka akan berlangsung terus, tak terputus sesaat pun. kita memohon kepada Allah dari karuniaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (عَطَآءً غَيۡرَ مَجۡذُوذٖ) ‘athoo’an ghaira majdzuudz : tidak terputus bahkan kekal. Makna ayat : Firman-Nya : (وَأَمَّا ٱلَّذِينَ سُعِدُواْ) Adapun orang yang telah Allah tulis sebagai orang yang bahagia, karena taufik-Nya sehingga mereka beriman, beramal saleh, meninggalkan syirik dan maksiat, (فَفِي ٱلۡجَنَّةِ خَٰلِدِينَ فِيهَا مَا دَامَتِ ٱلسَّمَٰوَٰتُ وَٱلۡأَرۡضُ إِلَّا مَا شَآءَ رَبُّكَۖ) maka mereka berada di dalam surga, kekal selamanya, selama langit dan bumi masih tegak. Ketentuan Allah adalah mutlak, kecuali dengan kehendak-Nya. Pelajaran dari ayat : • Kehendak Allah adalah mutlak, jika Dia berkehendak mengeluarkan seluruh penduduk nereka dari neraka pasti akan terjadi, jika berkehendak mengusir penduduk surge dari surge Dia pasti akan melakukannya, namun Dia telah menetapkan bahwa Dia adalah Yang Maha Perkasa dan Maha Adil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 108: Lihat tafsir ayat 107. Ya Allah, masukkanlah kami ke surga dan lindungilah kami dari neraka. Ya Allah, masukkanlah kami ke surga dan lindungilah kami dari neraka. Ya Allah, masukkanlah kami ke surga dan lindungilah kami dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 108",
    "description": "Dan adapun orang-orang yang berbahagia, maka tempat kembali mereka adalah di dalam surga yang penuh kenikmatan di sisi Allah yang maha mulia. Mereka kekal di dalamnya dalam waktu lama selama ada langit dan bumi ketika di dunia, kecuali jika tuhanmu menghendaki mereka diampuni dosanya lalu diberi balasan masuk surga atas amal saleh yang mereka lakukan. Anugerah Allah bagi ahli surga adalah sebagai karunia yang tidak ada putus-putusnya, melainkan kekal sepanjang masa. Karena begitu dahsyatnya keadaan hari kiamat itu, maka janganlah engkau wahai orang-orang yang mendengar seruan ini ragu-ragu tentang apa yang mereka sembah, yaitu berhala, karena sesembahan mereka tidak dapat mendatangkan manfaat dan menolak mudarat. Tindakan mereka menyembah berhala atau sejenisnya sebagaimana nenek moyang mereka dahulu menyembah, benar-benar dapat menghantarkan mereka masuk ke dalam neraka. Kami pasti akan menyempurnakan pembalasan terhadap perbuatan yang telah mereka lakukan di dunia dengan sempurna tanpa dikurangi sedikit pun."
  }
]