[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah kamu wahai rasul, merasa ragu-ragu terhadap kebatilan tuhan-tuhan sesembahan yang disembah oleh kaum musyrikin dari kaummu. mereka itu tidaklah menyembah berahal-berhala, kecuali serupa dengan apa yang disembah oleh nenek moyang mereka sebelumnya. Dan kami sungguh-sungguh akan memenuhi bagi mereka apa yang telah kami janjikan kepada mereka dengan sepenuhnya tanpa berkurang sedikitpun. Dan ini merupakan ketentuan yang tertuju kepada seluruh umat manusia sekaliapun lafazhnya hanya tertuju kepada Rasulullah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Maka janganlah engkau -wahai Rasul- merasa bimbang dan ragu terhadap rusaknya tuhan-tuhan yang disembah oleh orang-orang musyrik. Tidak ada satupun dalil aqli dan syar'i yang membenarkan anggapan mereka. Satu-satunya faktor yang mendorong mereka untuk menyembah tuhan-tuhan selain Allah ialah mengikuti adat leluhur mereka. Dan sesungguhnya Kami benar-benar akan memberikan azab yang menjadi hak mereka secara sempurna tanpa dikurangi sedikitpun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Allah memerintahkan Nabi Muhammad untuk tidak meragukan kesesatan ibadah orang-orang musyrik karena mareka telah berjalan di atas ajaran nenek moyang mereka; dan janganlah tertipu dengan penampilan dan perkataan dusta yang mereka lakukan; serta janganlah tergoda dengan kenikmatan dan perhiasan dunia yang diberikan kepada mereka, karena Allah membalas usaha mereka di dunia, sedangkan di akhirat mereka akan mendapatkan siksaan sesuai dengan hak mereka sebagai balasan yang adil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. فَلَا تَكُ فِى مِرْيَةٍ مِّمَّا يَعْبُدُ هٰٓؤُلَآءِ ۚ (Maka janganlah kamu berada dalam keragu-raguan tentang apa yang disembah oleh mereka) Yakni janganlah kamu ragu tentang kebatilan apa yang mereka sembah. Patung-patung mereka tidak akan mampu memberi manfaat atau mudharat. مَا يَعْبُدُونَ إِلَّا كَمَا يَعْبُدُ ءَابَآؤُهُم (Mereka tidak menyembah melainkan sebagaimana nenek moyang mereka menyembah dahulu) Yakni yang membuat mereka menyembah patung-patung bukanlah wahyu yang disampaikan kepada mereka dengan cara yang benar dan bukan pula hasil pemikiran akal sehat; namun karena mereka mengikuti apa yang mereka dapatkan dari nenek moyang. وَإِنَّا لَمُوَفُّوهُمْ نَصِيبَهُمْ (Dan sesungguhnya Kami pasti akan menyempurnakan dengan secukup-cukupnya pembalasan (terhadap) mereka) Dengan azab, sebagaimana Kami sempurnakan azab bagi nenek moyang mereka tanpa ada pengurangan sedikitpun. Pendapat lain mengatakan, yakni balasan kebaikan atau keburukan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Janganlah kamu gelisah wahai Nabi terhadap apa yang orang-orang musyrik itu sembah. Tidak ada manfaat dalam berhala-berhala mereka. Dan tempat kembali mereka itu seperti para pendahulu mereka yang kufur, yaitu ke dalam neraka. Ibadah mereka terhadap berhala-berhala itu meniru ayah-ayah mereka yang dahulu. Sungguh Allah memberi mereka takdir yang layak berupa azab yang sempurna tanpa kurang sedikitpun."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka janganlah kamu} maka janganlah kamu {dalam keragu-raguan} keraguan {tentang apa yang mereka sembah. Mereka tidak lain hanya menyembah sebagaimana nenek moyang mereka sebelumnya. Sesungguhnya Kami benar-benar akan menyempurnakan balasan mereka} bagian mereka berupa azab {tanpa dikurangi sedikit pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109 Allah berfirman kepada RasulNya, Muhammad “maka janganlah kamu berada dalam keragu raguan tentang apa yang disembah oleh mereka” yaitu orang orang musyrik, maksudnya jnagan meragukan mereka, dan bahwa apa yang mereka kerjakan itu adalah kebatilan. Mereka tidak memilki dalil aqli dan tidak pula syar’i. Dalil dan syubhat mereka adalah terbatas pada tindakan mereka mengikuti nenek moyang mereka saja, maka mereka menyembah apa yang disembah oleh nenek moyang mereka sebelumnya, dan termasuk hal yang sudah dimaklumi bahwa ini bukanlah syubhat, terlebih lagi menjadi dalil, karena ucapan selain Nabi bukanlah dalil, khususnya (ucapan) semisal orang orang yang sesat itu yang kesalahannya banyak, pendapat mereka rusak dalam perkara pokok agama, karena pendapat mereka, meskipun mereka bersepakat, ia tetap salah dan sesat. ”dan sesungguhnya Kami pasti akan menyempurnakan dengan secukup cukupnya pembalasan (terhadap) mereka dengan tidak dikurangi sedikitpun” maksudnya, mereka pasti mendapatkan bagian mereka di dunia dari apa yang telah ditulis untuk mereka meskipun bagian tersebut melimpah ruah dalam pandanganmu, karena ia tidak menunjukan kebaiakn mereka, karena Allah memberikan dunia kepada orang yang dicintaiNya dan yang tidak dicintaiNya, sementara dia tidak memberikan iman dan agama yang benar kecuali kepada yang dicintaiNya. Alhasil, jangan terkecoh dengan kesepakatan orang orang sesat atas perkataan orang orang yang sesat dari kalangan nenek moyang, dan jangan pula terkecoh dengan sesuatu yang Allah berikan kepada mereka di dunia ini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَلَا تَكُ فِي مِرۡيَةٖ مِّمَّا يَعۡبُدُ هَٰٓؤُلَآءِۚ) falaa taku fii miryatim mim maa ya’budu haa’ulaa : jangan engkau ragu akan batilnya ibadah mereka orang-orang musyrik. (نَصِيبَهُمۡ غَيۡرَ مَنقُوصٖ) nashiibahum ghaira manquush : bagian mereka berupa kebaikan, keburukan, rahmat, atau azab. Makna ayat : Firman-Nya : (عَطَآءً غَيۡرَ مَجۡذُوذٖ) sebuah pemberian yang tidak terputus dari Rabb mu untuk orang-orang yang taat. Ini adalah dalil kekalnya mereka di dalam surga. Firman-Nya : (فَلَا تَكُ فِي مِرۡيَةٖ مِّمَّا يَعۡبُدُ هَٰٓؤُلَآءِۚ) Allah berfirman kepada Rasul-Nya shallahu ‘alaihi wa sallam, melarangnya agar jangan ragu terhadap batilnya peribadatan para musyrikin kepada berhala mereka, karena mereka tidak punya dalil legalitas ibadah tersebut. Mereka hanya mengikuti nenek moyang mereka, menyembah apa yang mereka sembah berupa berhala-berhala. Firman-Nya : (وَإِنَّا لَمُوَفُّوهُمۡ نَصِيبَهُمۡ غَيۡرَ مَنقُوصٖ) Allah mengkabarkan bahwa Dia akan membalas segala yang mereka—kaum musyirikin—lakukan dengan kebaikan, keburukan, rahmat, atau azab yang sempurna, tidak dikurangi sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 109: Maksudnya jangan ragu-ragu bahwa menyembah berhala itu adalah perbuatan yang sesat dan buruk akibatnya, mereka akan diazab karenanya sebagaimana generasi sebelum mereka. Ayat ini merupakan hiburan bagi Nabi shallallahu 'alaihi wa sallam. Yakni tidak ada alasan mereka menyembah berhala selain karena mengikuti nenek moyang mereka dahulu, padahal yang demikian bukanlah alasan. Maksudnya azab. Ada pula yang menafsirkan, bahwa mereka akan memperoleh bagian yang ditentukan untuk mereka di dunia dengan sempurna meskipun bagian (kenikmatan) yang ditentukan untuk mereka banyak. Namun yang demikian tidaklah menunjukkan baiknya keadaan mereka, karena Allah Subhaanahu wa Ta'aala memberikan dunia kepada orang yang Dia cintai dan yang tidak Dia cintai, dan tidak memberikan iman dan amal saleh keculai kepapa orang yang Dia cintai. Kesimpulan ayat ini adalah, janganlah kita tertipu oleh orang-orang zalim karena sepakatnya mereka dengan orang-orang terdahulu yang tersesat dan jangan pula tertipu karena kenikmatan yang Allah berikan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 109",
    "description": "Karena begitu dahsyatnya keadaan hari kiamat itu, maka janganlah engkau wahai orang-orang yang mendengar seruan ini ragu-ragu tentang apa yang mereka sembah, yaitu berhala, karena sesembahan mereka tidak dapat mendatangkan manfaat dan menolak mudarat. Tindakan mereka menyembah berhala atau sejenisnya sebagaimana nenek moyang mereka dahulu menyembah, benar-benar dapat menghantarkan mereka masuk ke dalam neraka. Kami pasti akan menyempurnakan pembalasan terhadap perbuatan yang telah mereka lakukan di dunia dengan sempurna tanpa dikurangi sedikit pun. Setelah dijelaskan tentang keingkaran penduduk mekah terhadap risalah nabi Muhammad serta penolakan mereka terhadap Al-Qur'an, berikut ini dijelaskan tentang keberadaan umat nabi musa terhadap kitab suci yang diturunkan kepadanya. Dan sungguh, kami telah menurunkankan kitab taurat kepada musa, lalu diperselisihkannya tentang isi kitab itu oleh bani israil, sehingga ada yang mempercayainya ada juga yang mengingkarinya, mereka yang mengingkari karena mengikuti hawa nafsunya. Dan kalau tidak ada ketetapan yang terdahulu dari tuhanmu untuk menunda siksaan hingga hari kiamat, niscaya telah dilaksanakan hukuman di antara mereka berupa azab pada waktu itu juga. Sungguh, mereka orang kafir mekah dan orang-orang yang mengingkari kitab taurat benar-benar dalam kebimbangan dan keraguan terhadapnya yakni kebenaran isi kandungan kitab suci yang diturunkan Allah."
  }
]