[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, orang-orang yang bersabar menghadapi apa yang menimpa mereka berupa kesulitan hidup, karena keimanan mereka kepada Allah dan harapan mereka memperoleh pahala dari sisiNya, dan mereka mengerjakan amal shalih sebagai ungkapan syukur kepada Allah atas nikmat-nikmatNya, mereka itulah orang-orang yang mendapat ampunan dari dosa-dosa mereka dan pahala besar di akhirat kelak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Kecuali orang-orang yang sabar dalam menghadapi kesulitan, menjalankan ketaatan dan menjauhi kemaksiatan, serta senantiasa mengerjakan amal saleh. Orang-orang seperti itu akan berbeda kondisinya. Mereka tidak akan merasa putus asa, tidak akan mengingkari nikmat Allah dan tidak akan menyombongkan diri kepada orang lain. Orang-orang semacam itu akan diampuni dosa-dosanya oleh Tuhan mereka. Dan mereka akan mendapatkan balasan yang sangat besar di Akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِلَّا الَّذِينَ صَبَرُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ (kecuali orang-orang yang sabar (terhadap bencana), dan mengerjakan amal-amal saleh) Yakni, akan tetapi orang-orang yang sabar memiliki sikap yang berbeda; mereka tetap teguh dalam dua situasi tersebut, yakni tetap menyikapinya dengan rasa syukur; mereka tetap meningat Allah ketika kenikmatan hilang, dan tetap mengingat Allah ketika musibah hilang sebab mereka tahu bahwa kenikmatan itu datang dari Allah sehingga mereka tidak menyombongkan diri. أُو۟لٰٓئِكَ(mereka itu) Yakni orang-orang yang senantiasa bersabar dan beramal shalih. لَهُم مَّغْفِرَةٌ (beroleh ampunan) Atas dosa-dosa mereka. وَأَجْرٌ (dan pahala) Atas amal kebaikan mereka. كَبِيرٌ (yang besar) Yang sangat-sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Kecuali orang-orang yang sabar terhadap bencana atas dasar ridho terhadap ketetapan Allah, dan senantiasa tetap mengerjakan amal-amal saleh; mereka itulah yang akan memperoleh ampunan dan pahala yang besar atas amal baiknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kecuali orang-orang yang sabar dan beramal shalih, bagi mereka itu ampunan dan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. ini adalah tabiat manusia itu sendiri, kecuali orang yang diberi taufik oleh Allah dan dikeluarkan dari pelaku buruk ini kepada perilaku baik, mereka itu adalah orang orang yang sabar pada saat sulit, mereka tidak berputus asa karena, pada saat senang, mereka tidak sombong dan mengamalkan amal shalih yang wajib dan dianjurkan ”mereka itu beroleh ampunan” atas dosa dosa mereka yang dengannya segala perkara yang dikhawatirkan lenyap dari mereka. ”dan pahala yang besar” Maksudnya beruntung dengan meraih surge yang penuh dengan kenikmatan yang di dalamnya ada apa yang diinginkan oleh jiwa dan dinikmati oleh mata."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (صبروا) Shabaruu : Mereka bersabar atas kesulitan dan keburukan. (مغفرة) Maghfirah : Pengampunan atas dosa mereka. (و أجر كبير) Wa ajrun kabiir : Surga, tempat orang-orang yang baik. Makna ayat : Adapun insan yang beriman lagi taat kepada Allah dan rasul-Nya, mereka berada di sisi lain. Ketika memperoleh kebaikan mereka bersyukur, dan bersabar ketika tertimpa keburukan. Hal itu di karenakan cahaya iman dalam hati mereka dan amalan yang suci pada diri mereka. Inilah kandungan dari firman-Nya (إلا الذين آصبروا و عملوا الصالحات أولئك لهم مغفرة و أجر كبير) mereka memperoleh ampunan atas dosa mereka (و أجر كبير) pahala yang besar dari Rabb mereka yaitu surga. Pelajaran dari ayat : • Penjelasan bahwa kesempurnaan iman seorang mukmin akan merealisasikan sabar dan syukur, dan balasan atas hal tersebut dengan ampunan dan surga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 11: Ketika mendapatkan musibah seingga tidak berputus asa, dan bersabar ketika mendapatkan nikmat sehingga tidak sombong, bahkan mensyukurinya. Yang wajib maupun yang sunat. Terhadap dosa-dosa mereka sehingga segala yang dikawatirkan hilang. Yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 11",
    "description": "Itulah sifat orang-orang sombong, ketika mendapat cobaan mereka putus asa, dan ketika selamat dari bencana mereka lupa kepada Allah, kecuali orang-orang yang sabar dalam menghadapi kesulitan serta rida terhadap ketentuan Allah, dan mereka tetap istikamah dalam mengerjakan kebajikan baik ketika mereka dalam kesulitan maupun kelapangan hidup. Mereka akan memperoleh ampunan dan pahala yang besar di sisi Allah atas amal saleh yang mereka lakukan. Setelah pada ayat sebelumnya dijelaskan tentang macam-macam tabiat manusia, maka pada ayat ini Allah menjelaskan tentang salah satu tabiat buruk manusia yaitu sombong. Di antara kesombongan orang-orang kafir adalah mendustakan kerasulan nabi Muhammad dan kebenaran kitab suci Al-Qur'an. Diriwayatkan oleh ibnu 'abba's, bahwa pemuka kafir mekah berkata kepada nabi Muhammad, jika betul-betul engkau utusan Allah, jadikanlah bukit-bukit mekah itu emas untuk kami, sebagian lain ada yang berkata, datangkan kepada kami para malaikat yang menyaksikan kenabianmu. Kemudian Allah meneguhkan hati nabi Muhammad seraya berfirman, maka boleh jadi engkau wahai nabi Muhammad hendak meninggalkan berdakwah untuk menyampaikan sebagian dari apa yang diwahyukan kepadamu lantaran mereka mencemoohmu dan dadamu sempit, yakni sedih karenanya. Sehingga karena itu kamu takut mereka akan mengatakan, mengapa tidak diturunkan kepadanya harta kekayaan berupa emas permata, kebun, dan ternak yang dapat digunakan untuk menarik perhatian dalam berdakwah, atau datang bersamanya malaikat yang ikut menjelaskan wahyu yang diturunkan dan memperkuat kenabianmu' sungguh, janganlah engkau merasa pesimis dan khawatir, karena engkau hanyalah seorang pemberi peringatan dan Allah pemelihara segala sesuatu tentang urusan hamba-Nya, sehingga sedikit pun engkau wahai nabi Muhammad, tidak terpengaruh oleh ejekan mereka."
  }
]