[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah berikan kepada Musa kitab suci, yaitu taurat, kemudian kaumnya berselisih pendapat tentangnya. Maka beriman Sebagian golongan dan sebagian yang lain mengingkarinya. Dan seandainya bukan karena ketetapan dari tuhanmu yang telah berlalu bahwa Dia tidak menyegerakan siksaan bagi mahklukNya, pastilah akan datang ketentuan Allah tersebut di kehidupan dunia mereka untuk membinasakan orang-orang yang mendustakan dan menyelamatkan orang-orang mukmin. Dan sesungguhnya orang-orang kafir dari kaum yahudi dan orang-orang musyrik (wahai rasul), benar-benar berada dalam keraguan yang menggelisahkan terhadap al-qur’an ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Dan sungguh Kami telah memberikan Kitab Suci Taurat kepada Musa, kemudian manusia berselisih paham tentang hal itu. Ada yang beriman kepadanya dan ada yang ingkar kepadanya. Seandainya tidak ada keputusan dari Allah yang telah ditetapkan sebelumnya bahwa Allah tidak akan menyegerakan azab-Nya di dunia, melainkan menundanya sampai Hari Kiamat karena alasan tertentu, niscaya Allah benar-benar menurunkan azab yang berhak mereka terima di dunia. Sesungguhnya orang-orang kafir dari kalangan Yahudi dan orang-orang musyrik benar-benar ragu terhadap Al-Qur`ān dan menjerumuskan orang ke dalam keraguan terhadapnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Sungguh, Kami telah memberi Musa Taurat, namun Bani Israil saling berselisih tentangnya, antara orang yang membenarkan dan yang mendustakan; seandainya Allah menghendaki, niscaya Dia akan menyegerakan azab bagi orang-orang yang kafir dan meragukannya, akan tetapi Allah menangguhkan azab itu hingga batas waktu tertentu. Sungguh mereka dalam keraguan terhadap apa yang diturunkan kepada Musa, seperti kaummu yang ragu terhadap al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. وَلَقَدْ ءَاتَيْنَا مُوسَى الْكِتٰبَ (Dan sesungguhnya Kami telah memberikan Kitab kepada Musa) Yakni Taurat. فَاخْتُلِفَ فِيهِ ۚ( lalu diperselisihkan tentang Kitab itu) Yakni tentang kitab itu dan rincian hukum-hukumnya, sehingga sebagian mereka beriman dan sebagian yang lain tidak mengamalkan sebagian hukum-hukum tersebut. وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِىَ بَيْنَهُمْ ۚ (Dan seandainya tidak ada ketetapan yang telah terdahulu dari Tuhanmu, niscaya telah ditetapkan hukuman di antara mereka) Yakni seandainya Allah tidak menetapkan untuk mengakhirkan azab bagi mereka sampai hari kiamat karena mengetahui kebaikan dari penundaan itu niscaya telah jatuh hukuman antara mereka, atau antara kaum Nabi Musa, dengan diganjar kebaikan bagi orang yang benar dan diazab orang yang bersalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Sungguh Kami telah memberi Musa kitab Taurat. Lalu kaumnya tepisah antara yang beriman dan yang berdusta, sehingga ada yang kaum yang mengimaninya dan mengingkarinya, sebagaimana yang dilakukan penduduk Mekah. Jika tidak karena ketentuan Allah terdahulu yang menunda azab sampai hari kiamat, sungguh akan ditentukan setiap hukum antara kaummu atau kaum Musa terkait apa yang mereka perdebatkan tentang kitab itu di dunia. Sesungguhnya orang-orang kafir Mekah dan para pendusta Taurat itu sungguh dalam kegelisahan tentang kitab yang diturunkan untuk mereka, yaitu dalam kebingungan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan kepada Musa kitab} Taurat {lalu kitab itu diperselisihkan} lalu manusia yaitu orang mukmin dan orang kafir memperselisihkannya {Jika tidak ada ketetapan yang terdahulu dari Tuhanmu, niscaya telah diputuskan hukuman di antara mereka. Sesungguhnya mereka} sesungguhnya orangorang kafir dari kaummu {benar-benar dalam keraguan tentangnya} tentang Al-Qur’an {dan kegelisahan} kebingungan yang membebani"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110 Allah mengabarkan bahwa Dia telah memberi Musa kitab taurat yang mewajibkan kesepakatan atas perintah perintah dan larangan laranganNya, akan tetapi meskipun begitu, orang orang yang menisbatkan diri kepadanya berselisih dengan perselisihan yang merugikan akidah mereka dan kesatuan agama mereka. ”dan seandainya tidak ada ketetapan yang telah terdahulu dari Rabbmu” dengan menangguhkan mereka dan tidak menyegerakan azab, \"pasti akan timpakan kepada mereka\" dengan ditimpakan azab kepada orang zhalim akan tetapi hikmah Allah menuntut ditundanya keputusan diantara mereka sampai hari kiamat dan mereka diam dalam keraguan pertanyaan. jika begini sikap mereka terhadap kitab mereka, bersama alqur’an yang Allah wahyukan kepadamu, maka tidaklah aneh jika ada sebagian dari orang orang yahudi yang tidak beriman kepadanya dan mereka selalu meragukannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلۡكِتَٰبَ) al-kitab : Taurat. (وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ) wa lau laa kalimatun sabaqat : kalau bukan karena apa yang tertuliskan dalam takdir berupa pengakhiran hisab dan pembalasan amal hingga hari kiamat. (لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ) lafii syakkim minhu muriib : jatuh kedalam keraguan, yaitu keguncangan jiwa dan kegundahannya. Makna ayat : Ayat-ayat ini masih dalam rangka menghibur Nabi shallahu ‘alaihi wa sallam dan menyabarkannya serta menguatkan dirinya dalam penyampaian risalah Allah, mendakwahkan tauhid serta menghadapi penentangan kaum musyrikin, maka Allah berfirman : (وَلَقَدۡ ءَاتَيۡنَا مُوسَى ٱلۡكِتَٰبَ) “Kami telah memberi Musa al-kitab yaitu Taurat, sebagaimana Kami menurunkan kepadamu Al-Qur’an. Lalu Yahudi berselisih mengenai Taurat, di antara mereka ada yang beriman dan ada pula yang kafir, sama seperti kaummu terhadap Al-Qur’an. Ada yang beriman dan ada pula yang kafir kepadanya, oleh karena itu janganlah bersedih. Firman-Nya : (وَلَوۡلَا كَلِمَةٞ سَبَقَتۡ مِن رَّبِّكَ) Penangguhan pembalasan amal di dunia hingga hari kiamat (لَقُضِيَ بَيۡنَهُمۡۚ) tentu kaum mukminin akan selamat dan kaum kafir akan binasa. Firman-Nya : (وَإِنَّهُمۡ لَفِي شَكّٖ مِّنۡهُ مُرِيبٖ) Kaummu dan orang-orang musyrik Arab mereka dalam keraguan mengenai Al-Qur’an, apakah termasuk wahyu dari Allah dan kalam-Nya atau selain itu (مُرِيبٖ) mereka dalam keadaan ragu, keguncangan jiwa, dan kebingungan. Pelajaran dari ayat : • Hiburan untuk Rasulullah shalallahu ‘alaihi wa sallam dan meringankan apa yang beliau hadapi berupa perlawanan orang-orang kafir. • Sebab ditangguhkannya azab di dunia, bahwa balasan hanya di akhirat tidak di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 110: Ayat ini sebagai penghibur Nabi Muhammad shallallahu 'alaihi wa sallam saat Beliau menghadapi penolakan dan pendustaan orang kafir Mekah terhadap Al Quran. Allah menceritakan bahwa Taurat yang dibawa Nabi Musa ‘alaihis salam dahulu juga ditolak dan didustakan oleh orang-orang kafir. Maksudnya kalau bukan karena ketetapan penundaan hisab dan pembalasan terhadap mereka sampai hari kiamat, tentulah mereka dibinasakan pada waktu itu juga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 110",
    "description": "Setelah dijelaskan tentang keingkaran penduduk mekah terhadap risalah nabi Muhammad serta penolakan mereka terhadap Al-Qur'an, berikut ini dijelaskan tentang keberadaan umat nabi musa terhadap kitab suci yang diturunkan kepadanya. Dan sungguh, kami telah menurunkankan kitab taurat kepada musa, lalu diperselisihkannya tentang isi kitab itu oleh bani israil, sehingga ada yang mempercayainya ada juga yang mengingkarinya, mereka yang mengingkari karena mengikuti hawa nafsunya. Dan kalau tidak ada ketetapan yang terdahulu dari tuhanmu untuk menunda siksaan hingga hari kiamat, niscaya telah dilaksanakan hukuman di antara mereka berupa azab pada waktu itu juga. Sungguh, mereka orang kafir mekah dan orang-orang yang mengingkari kitab taurat benar-benar dalam kebimbangan dan keraguan terhadapnya yakni kebenaran isi kandungan kitab suci yang diturunkan Allah. Tapi jangan duga bahwa Allah akan membiarkan mereka yang berselisih. Allah memperhatikan mereka dan besumpah, sesungguhnya kepada masing-masing yang berselisih itu pasti tuhanmu akan memberi balasan secara penuh atas perbuatan mereka pada hari pembalasan, sebagai imbalan atas perbuatan mereka. Sungguh, dia mahateliti terhadap perbuatan apa saja yang mereka kerjakan baik yang ditampakkan atau disembunyikan. Allah maha mengetahui dan mahateliti, tidak ada satu pun perbuatan manusia yang terlewat dari pengamatan Allah."
  }
]