[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan setiap kaum yang berselisih itu yang telah kami sebutkan kepadamu (wahai rasul), berita-berita tentang mereka, tuhanmu benar-benar akan memenuhi bagi mereka balasan perbuatan-perbuatan mereka pada hari kiamat. Bila baik, maka balasannya baik, jika buruk, maka balasannyapun buruk. Sesungguhnya tuhanmu mahamengetahui semua yang dikerjakan oleh orang-orang musyrik. Tidak ada sesuatu yang tersembunyi bagiNya dari perbuatan mereka. di dalam ayat ini terdapat peringatan dan ancaman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Sesungguhnya kepada masing-masing dari mereka yang berselisih paham itu Tuhanmu -wahai Rasul- akan memberikan balasan amal perbuatannya secara sempurna. Jika amal perbuatannya baik maka akan baiklah balasannya. Dan jika amal perbuatannya buruk maka akan buruk pula balasannya. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat. Tidak ada satupun amal perbuatan mereka yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Setiap mereka; kaum terdahulu dan selanjutnya, para pemimpin dan pengikutnya, ada yang mendapatkan bagian azab mereka di dunia, dan ada yang Allah akhirkan azabnya di akhirat, dan Allah akan memenuhi balasan atas perbuatan mereka. Tidak ada yang tersembunyi dari-Nya, dan tidak ada yang terlewat dari ilmu-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَإِنَّ كُلًّا لَّمَّا لَيُوَفِّيَنَّهُمْ رَبُّكَ أَعْمٰلَهُمْ ۚ (Dan sesungguhnya kepada masing-masing (mereka yang berselisih itu) pasti Tuhanmu akan menyempurnakan dengan cukup) yakni tidak ada bagi orang-orang yang berselisih itu kecuali Allah akan membalas amalan mereka dan menyempurnakan balasannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111. Sesungguhnya masing-masing kelompok yang berbeda itu yaitu orang yang beriman dan berdusta itu pasti akan bertemu dengan hari penghisaban agar amalnya dibalas dengan sempurna, berupa kebaikan atau keburukan. Sesungguhnya Allah Maha Mengetahui amal-amal para hamba baik yang tampak maupun tersembunyi, Tidak ada yang luput dariNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya setiap itu} sesungguhnya setiap yang berselisih dari golongan orang mukmin dan orang kafir {Tuhanmu pasti akan memberi balasan atas perbuatan mereka} membalas perbuatan mereka {Sesungguhnya Dia Maha Memberitahu apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111 “dan sesungguhnya kepada masing mas ing (mereka yang berselish itu) pasti Rabbmu akan menyempurnakan dengan cukup (balasan) pekerjaan mereka” maksudnya, Allah pasti akan memutuskan diantara mereka pada hari kiamat dengan hukumNya yang adil, lalu masing masing di balas dengan sesuatu yang menjadi haknya. ”sesungguhnya Dia terhadap apa yang mereka kerjakan” dari yang baik dan yang buruk, ”maha mengetahui” tidak sedikitpun dari amal mereka yang samar bagiNya, kecil dan besarnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (وَإِنَّ كُلّٗا لَّمَّا لَيُوَفِّيَنَّهُمۡ رَبُّكَ أَعۡمَٰلَهُمۡۚ) “Dan sesungguhnya kepada masing-masing (mereka yang berselisih itu) pasti Tuhanmu akan menyempurnakan dengan cukup, (balasan) pekerjaan mereka”. Setiap hamba yang beriman atau yang kafir, baik atau buruk, pasti akan Allah balas amalan mereka pada hari kiamat dengan sempurna tidak dikurangi sedikit pun, (إِنَّهُۥ بِمَا يَعۡمَلُونَ خَبِيرٞ) “Sesungguhnya Dia Maha Mengetahui apa yang mereka kerjakan.” penekanan atas kabar akan adanya pembalasan amal yang adil, karena pengetahuan terhadap amal, dan pengamatan yang sempurna pasti menghasilkan ganjaran yang sempurna pula. Pelajaran dari ayat : • Balasan ukhrawi adalah pasti, karena yang menentukannya adalah Yang Maha Benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 111: Allah Subhaanahu wa Ta'aala akan memutuskan masalah mereka pada hari kiamat dengan hukum-Nya yang adil, dan akan memberikan balaan kepada masing-masingnya sesuai yang layak baginya. Oleh karena itu, amal mereka besar maupun kecil tidak samar bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 111",
    "description": "Tapi jangan duga bahwa Allah akan membiarkan mereka yang berselisih. Allah memperhatikan mereka dan besumpah, sesungguhnya kepada masing-masing yang berselisih itu pasti tuhanmu akan memberi balasan secara penuh atas perbuatan mereka pada hari pembalasan, sebagai imbalan atas perbuatan mereka. Sungguh, dia mahateliti terhadap perbuatan apa saja yang mereka kerjakan baik yang ditampakkan atau disembunyikan. Allah maha mengetahui dan mahateliti, tidak ada satu pun perbuatan manusia yang terlewat dari pengamatan Allah. Setelah diuraikan tentang keberadaan umat terdahulu yang ragu dan berselisih terhadap ajaran nabinya, maka pada ayat ini Allah memperingatkan kepada nabi dan umatnya agar konsisten terhadap ajaran yang benar. Maka tetaplah engkau wahai nabi Muhammad, tetap teguh dan konsisten dalam melaksanakan perintah Allah dan menyeru ke jalan yang benar, sebagaimana telah diperintahkan kepadamu dan juga orang yang bertobat bersamamu dari perbuatan syirik dan dosa, dan janganlah kamu melampaui batas terhadap perintah dan larangan-Nya. Sungguh, dia maha melihat apa yang kamu kerjakan kemudian akan memberikan balasan atas perbuatan yang kamu kerjakan."
  }
]