[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tetaplah kamu lurus (Wahai Rasul), sebagaimana Tuhanmu memetintahkanmu dan orang-orang yang bertabaut bersamamu, dan janganlah kalian berbuat melampaui batas yang telah Allah tentukan kepada kalian. Sesungguhnya Tuhan kalian Maha Melihat semua perbuatan yang kalian lakukan seluruhnya, tidak ada yang tersembunyi bagiNya dari segala sesuatu dari perbuatan mereka, dan Dia akan memebiri balasan kepada kalian atas perbuatan-perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Maka tetaplah engkau -wahai Rasul- tegak seperti yang Allah perintahkan kepadamu. Maka jalankanlah perintah-perintah-Nya dan jauhilah larangan-larangan-Nya. Pun hendaknya orang-orang mukmin yang bertobat tetap mengikuti perintah Allah bersamamu dan tidak melampaui batas, berupa melakukan perbuatan maksiat. Sesungguhnya Allah Maha Melihat apa yang mereka perbuat. Tidak ada satupun amal perbuatan mereka yang luput dari pengetahuan-Nya. Dan Dia akan memberikan balasan yang setimpal kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. Jika kamu telah menemukan jalan yang benar, maka beristiqamahlah bersama orang-orang yang bertaubat denganmu di atas agama Allah sesuai dengan perintah-Nya; dan janganlah kalian berbuat zalim sebagaimana kaum-kaum sebelum kalian, sehingga mereka berpaling dari jalan yang lurus, dan terjerumus ke dalam kelalaian atau sifat berlebih-lebihan. Allah Maha Mengetahui dan Maha Melihat amal perbuatan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. فَاسْتَقِمْ كَمَآ أُمِرْتَ (Maka tetaplah kamu pada jalan yang benar, sebagaimana diperintahkan kepadamu) Yakni sebagaimana Allah telah memerintahkanmu. Sehingga masuk didalamnya semua yang diperintahkan dan dilarang-Nya. وَمَن تَابَ مَعَكَ(dan (juga) orang yang telah taubat beserta kamu) Yakni agar orang-orang yang bertaubat bersamamu juga tetap berada dalam jalan yang benar. Betapa agung ayat ini dan betapa berat perintah yang ada didalamnya, kerena beristiqamah sebagaimana yang diperitahkan Allah tidak akan tercapai kecuali oleh jiwa yang bersih. وَلَا تَطْغَوْا۟ ۚ( dan janganlah kamu melampaui batas) Makna (الطغيان) yakni melampaui batas. Yakni janganlah kalian melampaui batas dengan berbuat kemaksiatan. إِنَّهُۥ بِمَا تَعْمَلُونَ بَصِيرٌ(Sesungguhnya Dia Maha Melihat apa yang kamu kerjakan) Yang akan membalas kalian sesuai dengan haknya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tadabburilah ayat ini dengan penuh seksama : { فَاسْتَقِمْ كَمَا أُمِرْتَ } \"Maka tetaplah kamu pada jalan yang benar, sebagaimana diperintahkan kepadamu\" agar jelas bagimu bahwa diantara kesempurnaan istiqomah adalah keberadaanmu diatas apa yang sesuai dengan yang diperintahkan kepadamu, dan bukan yang nampak baik di dalam benakmu, karena tekadang hakikat istiqomah itu hanya dengan berpaling kepada kebenaran, sebagaimana yang pernah dilakukan oleh Nabi Ibrahim yang lurus; yakni : berpaling kepada kebenaran. dan perlu anda fahamil bahwa apa yang dapat membawamu kepada kesesatan bisa benar di sisi orang-orang yang berakal buruk. 2 ). Perhatikan, kenapa ayat ini memberikan konteks yang melarang untuk berbuat sesuatu yang melampaui batas, dan tidak melarang dari hal yang mengurangi amalan? karena ijtihad dalam istiqomah dapat menimbulkan sikap keras terhadap diri sendiri dan juga kepada orang lain. bahkan bisa sampai kepada derajat berlebihan, dan semua ini adalah hal yang melampaui batas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112. Tetaplah beristiqamah wahai Nabi untuk mengerjakan perintah Tuhanmu dan berdakwa kepadaNya. Teruslah beristiqamah sebagaimana yang diperintahkan dan dilarang Tuhan. Sebaiknya orang yang bertaubat di sisimu itu beristiqamah untuk menjauhi kesyirikan, tetap mengimani risalahmu dan tetap mengerjakan petunjukmu. Serta janganlah kalian melampaui batas dalam menunaikan perintah dan menjauhi larangan. Maknanya janganlah kalian berbuat kemaksiatan. Sesungguhnya Allah SWT Maha Melihat amal kalian dan akan membalas kalian sesuai amal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka tetaplah} maka tetaplah berpegang pada Islam {sebagaimana kamu telah diperintahkan, juga orang yang bertaubat bersamamu. Janganlah melampaui batas} Janganlah melalui batas ketentuan Allah {Sesungguhnya Dia Maha Melihat apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112 manakala Allah mengabarkan tidak istiqamahnya mereka yang menjadi penyebab perselisihan dan perpecahan mereka, maka Allah memerintahkan nabiNya, dan orang orang mukmin yang bersamanya agar beristiqamah sebagaimana yang diperintahkan kepada mereka, maka mereka meniti syariat syariat yang telah Allah syariatkan, meyakini akidah akidah yang benar yang dikabarkan oleh Allah, tidak menyimpang dari hal tersebut ke kanan atau kekiri dan hendaknya mereka selalu begitu, tidak melampaui batas dari istiqamah yang telah diletakan oleh Allah. firmanNya ”sesungguhnya Dia Maha Melihat apa yang kamu kerjakan” tidak sedikitpun dari amalmu yang samar bagiNya, Dia akan membalasmu atasnya. Ayat ini mengandung dorongan untuk beristiqamah dan melarang sebaliknya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَٱسۡتَقِمۡ كَمَآ أُمِرۡتَ) fastaqim kamaa umirta : di atas perintah dan larangan, sebagaimana engkau diperintahkan, tanpa adanya pengurangan. (وَلَا تَطۡغَوۡاْۚ) walaa tathghau : janganlah engkau melanggar hukum-hukum Allah. Makna ayat : Firman-Nya : (فَٱسۡتَقِمۡ كَمَآ أُمِرۡتَ وَمَن تَابَ مَعَكَ) oleh karena itu, istiqamah lah engkau dan orang-orang beriman bersamamu seperti yang diperintahkan oleh Rabb mu dalam kitab-Nya, berkeyakinan lah dengan keyakinan yang benar, beramal salehlah, tinggalkan kebatilan, jauhi amal-amal buruk, sehingga balasan untuk kalian adalah balasan yang baik pada hari kiamat nanti. Firman-Nya : (وَلَا تَطۡغَوۡاْۚ) janganlah kalian melampaui batas yang telah digariskan baik dalam masalah aqidah, perkataan, dan amal. Firman-Nya : (إِنَّهُۥ بِمَا تَعۡمَلُونَ بَصِيرٞ) “Sesungguhnya Dia Maha Melihat apa yang kalian kerjakan.”, peringatan dari perbuatan melampaui batas, serta ancaman bagi orang-orang yang melenceng dari manhaj yang lurus. Pelajaran dari ayat : • Wajibnya istiqamah di atas agama Allah dari segi aqidah, ibadah, hukum, dan adab. • Haramnya ghuluw (berlebih-lebihan) dan melampaui batas yang Allah gariskan dalam syariatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 112: Yakni tetap mengerjakan perintah Tuhanmu, jangan malas mengerjakannya atau meremehkannya, dan tetaplah mengajak manusia kepadanya meskipun banyak yang mendustakan. Yakni melewati batasan-batasan Allah, atau melewati aturan. Dalam ayat ini terdapat perintah agar berjalan di atas Sunnah Rasulullah shallallahu 'alaihi wa sallam dan tidak menambah-nambah atau berbuat bid’ah dalam agama. Oleh karena itu, Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 112",
    "description": "Setelah diuraikan tentang keberadaan umat terdahulu yang ragu dan berselisih terhadap ajaran nabinya, maka pada ayat ini Allah memperingatkan kepada nabi dan umatnya agar konsisten terhadap ajaran yang benar. Maka tetaplah engkau wahai nabi Muhammad, tetap teguh dan konsisten dalam melaksanakan perintah Allah dan menyeru ke jalan yang benar, sebagaimana telah diperintahkan kepadamu dan juga orang yang bertobat bersamamu dari perbuatan syirik dan dosa, dan janganlah kamu melampaui batas terhadap perintah dan larangan-Nya. Sungguh, dia maha melihat apa yang kamu kerjakan kemudian akan memberikan balasan atas perbuatan yang kamu kerjakan. Dan selain itu, janganlah kamu menjadi lemah semangat, sehingga cenderung tunduk atau loyal kepada orang yang zalim yang tingkah laku mereka melampaui batas, merampas hak orang lain, atau menghalalkan segala macam cara yang dilarang oleh agama. Jika kamu loyal atau mengikuti tingkah laku orang-orang zalim tersebut, maka perbuatan itu akan menyebabkan kamu ditimpa api neraka bersama dengan mereka, sedangkan kamu tidak mempunyai seorang penolong pun selain Allah, sehingga kamu tidak akan diberi pertolongan untuk menghindar dari azab itu. Tidak ada yang kuasa mendatangkan manfaat selain Allah, dan tidak ada yang bisa menolak kemudaratan selain Allah."
  }
]