[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian condong kepada orang-orang kafir yang zhalim tersebut, akibatnya kalian akan terkena api neraka, dan kalian tidak memiliki selain Allah seorang penolong pun yang dapat menolong kalian dan membela urusan-urusan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Dan janganlah kalian cenderung kepada orang-orang kafir yang zalim itu, baik dengan cara berdamai atau berkasih sayang dengan mereka. Karena kecenderungan itu bisa membuat kalian terancam dengan api Neraka. Dan kalian tidak memiliki pelindung yang dapat menyelamatkan kalian dari api Neraka selain Allah. Kemudian kalian tidak akan menemukan seseorang yang dapat menolong kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. Dan janganlah kalian condong kepada orang-orang zalim, jangan ikuti jalan mereka, jangan merasa aman dari tipu daya mereka, dan jangan melakukan kezaliman seperti mereka sehingga kalian dapat terjerumus ke dalam neraka. Kalian tidak memiliki penolong selain Allah yang dapat menolong kalian dari azab Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَلَا تَرْكَنُوٓا۟ إِلَى الَّذِينَ ظَلَمُوا۟ (Dan janganlah kamu cenderung kepada orang-orang yang zalim) Kecenderungan kepada orang-orang zalim yang dilarang adalah dengan merasa rela atas apa yang dilakukan oleh orang-orang zalim, atau membaik-baikkan dan menghiasi jalan kezaliman itu bagi orang lain, serta ikut berbuat dalam perbuatan tersebut. Adapun ikut campur urusan mereka untuk menolak kemudharatan dan mendatangkan manfaat maka ini tidak termasuk dalam kecenderungan ini. فَتَمَسَّكُمُ النَّارُ(yang menyebabkan kamu disentuh api neraka) Karena kecenderungan kepada mereka. وَمَا لَكُم مِّن دُونِ اللهِ مِنْ أَوْلِيَآءَ(dan sekali-kali kamu tiada mempunyai seorang penolongpun selain daripada Allah) Yakni kalian disiksa dengan api neraka karena tidak ada yang dapat menolong kalian, bahkan orang-orang yang kalian cenderungi itu. ثُمَّ لَا تُنصَرُونَ(kemudian kamu tidak akan diberi pertolongan) Yakni kalian tidak akan mendapatkan seorangpun yang dapat menolong kalian dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113. Janganlah kalian condong ke arah yang rendah, yaitu condong kepada orang-orang zalim yang kafir dengan menyukai apa yang mereka lakukan, yaitu ikut serta dalam amal mereka, niscaya kalian akan mendapatkan neraka karena hal itu. Tidaklah bagi kalian itu penolong dan penyelamat dari neraka selain Allah. Kalian tidak akan mendapati penolong di sisi Allah yang melindungi kalian dari azab."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah cenderung} Janganlah condong {pada orang-orang yang zalim sehingga kalian akan ditimpa} sehingga kalian akan ditimpa} api neraka, dan kalian tidak mempunyai seorang penolong pun selain Allah} penyelamat yang menjaga kalian dari azabNya {kemudian kalian tidak akan diberi pertolongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113 Oleh karena itu, Allah memperingatkan mereka dari kecenderungan kepada orang yang melewati batas istiqamah, Dia berfirman ”dan janganlah kamu cenderung kepada orang orang yang zhalim” karena jika kamu cenderung kepada mereka, maka kamu menyepakati kezhaliman mereka atau rela terhadap kezhaliman mereka. ”sehingga kamu disentuh api neraka” jika kamu melakukan itu ”dan sekali kali kamu tiada mempunyai seorang penolongpun selain dari pada Allah” yang bisa melindungimu dari azab Allah, dan tidak ada penolong yang membuatmu memperoleh pahala Allah sedikitpun. ”kemudian kamu tidak akan diberi pertolongan” azab tidak dihalangi darimu jika ia menimpamu. Ayat ini berisi peringatan terhadp sikap rukun kepada orang zhalim dan yang dimaksud dengan rukun adalah kecenderungan, bergabung kepadanya dalam kezhaliamnnya, menyetujuinya dan rela dengan kezhalimannya. jiika ini adalah ancaman terhadap rukun kepada orang orang zhalim lalu bagaimana (parahnya) keadaan orang orang zhalim itu sendiri? Semoga Allah menyelamatkan kita dari kezhaliman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَلَا تَرۡكَنُوٓاْ إِلَى ٱلَّذِينَ ظَلَمُواْ) wa laa tarkanuu ilalladziina zhalamuu : janganlah engkau mencintai mereka dan ridha dengan perbuatan mereka. (فَتَمَسَّكُمُ ٱلنَّارُ) fatamassakumun nar : kalian tertimpa azabnya (neraka)—tidak ada yang terkena azab neraka kecuali penduduknya. Makna ayat : Firman-Nya : (وَلَا تَرۡكَنُوٓاْ إِلَى ٱلَّذِينَ ظَلَمُواْ فَتَمَسَّكُمُ ٱلنَّارُ) janganlah kalian condong kepada kaum musyrikin dengan bermudah-mudahan dan ridha dengan kesyirikan mereka, lantas kalian menjadi seperti mereka, kemudian kalian masuk ke dalam neraka sebagaimana mereka, dan kalian terkena azab neraka sebagaimana mereka pula. Firman-Nya : (وَمَا لَكُم مِّن دُونِ ٱللَّهِ مِنۡ أَوۡلِيَآءَ ثُمَّ لَا تُنصَرُونَ) Seandainya kalian condong kepada orang-orang musyrik tersebut, maka kalian berada di dalam neraka seperti mereka, kalian tidak akan mendapatkan penolong yang menolong kalian untuk mengeluarkan kalian dari neraka, kecuali Allah. Lalu kalian tidak akan mendapatkan pertolongan. Peringatan ini sekalipun diarahkan kepada Nabi shalallahu ‘alahi wa sallam, tapi yang dimaksud adalah umatnya, karena hanya umatnya yang akan melakukannya, adapun Rasulullah shalallahu ‘alaihi wa sallam ia adalah maksum, belepas diri dari syirik, bagaimana mungkin melakukan kesyirikan? Pelajaran dari ayat : • Haramnya bermudah-mudahan dengan orang-orang musyrik atau ridha dengan mereka atau amalan mereka, karena ridha dengan kekufuran adalah kufur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 113: Cenderung kepada orang yang zalim maksudnya bergaul dengan mereka serta meridhai perbuatannya dan mengadakan pendekatan atau bahkan sepakat dengan kezaliman mereka. Akan tetapi jika bergaul dengan mereka tanpa meridhai perbuatannya dengan maksud agar mereka kembali kepada kebenaran atau memelihara diri (dari gangguan mereka), maka diperbolehkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 113",
    "description": "Dan selain itu, janganlah kamu menjadi lemah semangat, sehingga cenderung tunduk atau loyal kepada orang yang zalim yang tingkah laku mereka melampaui batas, merampas hak orang lain, atau menghalalkan segala macam cara yang dilarang oleh agama. Jika kamu loyal atau mengikuti tingkah laku orang-orang zalim tersebut, maka perbuatan itu akan menyebabkan kamu ditimpa api neraka bersama dengan mereka, sedangkan kamu tidak mempunyai seorang penolong pun selain Allah, sehingga kamu tidak akan diberi pertolongan untuk menghindar dari azab itu. Tidak ada yang kuasa mendatangkan manfaat selain Allah, dan tidak ada yang bisa menolak kemudaratan selain Allah. Setelah diperintahkan untuk istikamah dalam melaksanakan ajaran agama dan memiliki pendirian teguh, maka ayat berikut ini diperintahkan melaksanakan salat serta beramal saleh, karena amaliah tersebut dapat menghapus dosa-dosa kecil, sebagaimana firman-Nya: dan laksanakanlah salat dengan teratur dan benar sesuai dengan ketentuan agama, baik syarat, rukun, dan sunah-sunahnya pada kedua ujung siang, yakni pagi dan petang atau salat subuh, zuhur dan asar dan pada bagian permulaan malam yaitu salat magrib, isya, dan salat sunah seperti tahajud dan witir. Sesungguhnya perbuatan-perbuatan baik itu seperti salat sebagaimana disebutkan di atas, zakat, sedekah, zikir, istigfar, dan amal ibadah lainnya dapat menghapus kesalahan-kesalahan dan dosadosa kecil yang telah dilakukan, lantaran perbuatan itu tidak mudah dihindari. Adapun dosa besar, harus disertai dengan tobat yang tulus. Itulah peringatan yang sangat bermanfaat bagi orang-orang yang siap menerimanya dan selalu mengingat Allah."
  }
]