[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kerjakanlah shalat (wahai Nabi), dengan cara sebaik-baiknya pada dua tepi siang, yaitu pagi dan sore hari, dan pada saat-saat malam hari, Sesungguhnya perbuatan-perbuatan baik akan menghapuskan dosa-dosa yang terdahulu dan menghilangkan pengaruh buruknya. Dan adanya perintah untuk mendirikan shalat dan penjelasan perbuatan-perbuatan baik akan melenyapkan perbuatan-perbuatan buruk memuat satu nasihat bagi orang yang mau mengambil pelajaran dan memikirkanya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Dan dirikanlah salat -wahai Rasul- dengan sebaik-baiknya di dua ujung siang, yaitu pagi dan petang hari. Dan dirikanlah salat di saat-saat tertentu di malam hari. Sesungguhnya amal perbuatan yang baik dapat menghapuskan dosa-dosa kecil. Hal tersebut merupakan nasihat bagi orang-orang yang mau menerima nasihat dan menjadi pelajaran bagi orang-orang yang mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Dan selalu dirikanlah shalat, kerjakanlah pada pagi dan petang hari, yaitu shalat subuh, dhuhur, dan ashar; dan kerjakanlah pada waktu malam untuk mendekatkan diri kepada Allah, yaitu shalat maghrib, isya’, dan shalat malam. Sesungguhnya dengan shalat dan seluruh amal kebaikan lainnya Allah menghapus kesalahan-kesalahan. Demikianlah pelajaran bagi orang-orang yang senantiasa mengambil pelajaran dan mendapat manfaat darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. وَأَقِمِ الصَّلَوٰةَ طَرَفَىِ النَّهَارِ (Dan dirikanlah sembahyang itu pada kedua tepi siang) Yaitu shalat subuh dan ashar. Namun pendapat lain mengatakan, yakni shalat subuh dan maghrib. وَزُلَفًا مِّنَ الَّيْلِ ۚ (dan pada bahagian permulaan daripada malam) Yakni waktu shalat di malam hari. Atau yang dimaksud adalah shalat Isya’. إِنَّ الْحَسَنٰتِ (Sesungguhnya perbuatan-perbuatan yang baik itu) Dan diantaranya serta yang menjadi tiangnya adalah shalat. يُذْهِبْنَ السَّيِّـَٔاتِ ۚ( menghapuskan (dosa) perbuatan-perbuatan yang buruk) Perbuatan buruk secara umum. Pendapat lain mengatakan yakni menghapus dosa-dosa kecil saja, ia menghapusnya sampai seakan-akan tidak pernah dilakukan. ذٰلِكَ ذِكْرَىٰ لِلذّٰكِرِينَ (Itulah peringatan bagi orang-orang yang ingat) Yakni menjadi pelajaran bagi orang-orang yang mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Dirikanlah shalat di waktu pagi dan siang, pagi dan sore, maksudnya adalah shalat subuh, ashar, dan zhuhur. Dan di sepanjang waktu malam secara mutlak, yaitu mencakup shalat maghrib dan isya’. Sesungguhnya mengerjakan kebaikan, salah satunya yaitu shalat lima waktu itu bisa menghilangkan atau melebur dosa-dosa kecil. Adapun dosa besar maka harus dilebur dengan bertaubat. Sebagian kalian melihat bahwa umumnya keburukan itu bisa dilebur dengan kebaikan. Hukum tersebut merupakan pelajaran bagi orang-orang yang mau mengambil pelajaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dirikanlah shalat pada kedua ujung hari} permulaan dan akhir siang {dan pada bagian-bagian} waktu-waktu {malam. Sesungguhnya perbuatan-perbuatan baik menghapus haal-hal buruk. Itu adalah peringatan bagi orang-orang yang selalu mengingat} pelajaran bagi orang yang mau mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "114 Allah memerintahkan untuk mendirikan shalat secara sempurna, ”pada kedua tepi siang (pagi dan petang)” yakni diawal dan diakhirnya, termasuk dalam hal ini shalat shubuh, zhuhur dan ashar. ”dan pada bagian permulaan dari malam” termasuk didalamnya shalat maghrib dan isya, dan itu juga mencakup shalat malam karena ia termasuk yang mendekatkan seorang hamba kepada Allah. ”sesungguhnya perbuatan perbuatan yang baik itu menghapuskan (dosa) perbuatan perbuatan yang buruk” maksudnya, shalat lima waktu ini dan shalat shalat sunnah yang mengikutinya adalah termasuk kebaikan yang paling besar, di samping ia adalah kebaikan yang mendekatkan kepada Allah dan mengundang pahala Allah, ia juga menghapus keburukan dan menghilangkannya, yang dimaksud dengan itu adalah dosa dosa kecil sebagaimana hadits hadits shahih dari Nabi membatasinya demikian. Seperti sabda nabi, ”shalat lima waktu, shalat jum’at ke jum’at (berikutnya) Ramadhan ke ramadhan (berikutnya) adalah pelebur (dosa) yang terletak diantaranya, selama dosa dosa besar dijauhi” Bahkan seperti yang dikhusukan dalam surat An-Nisaa yaitu firman Allah ta'ala : \"jika kamu menjauhi dosa besar yang kalian dilarang darinya, kami akan hapus dosa-dosa mu dan kami masukan kamu ke tempat yang mulia\" “itulah” bisa jadi isyaratnya kembali kepada semua yang disebutkan berupa istiqamah diatas jalan yang lurus, tidak melanggar dan melampaui batasnya, tidak rukun kepada orang orang zhalim, perintah menegakan shalat dan penjelasan bahwa kebaikan itu melenyapkan keburukan, semua itu adalah “peringatan bagi orang orang yang ingat” mereka memahami apa yang diperintahkan dan dilarang oleh Allah dengannya, dan menaati perintah yang baik itu yang membuahkan kebaikan yang menangkal keburukan dan kejahatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَأَقِمِ ٱلصَّلَوٰةَ) wa aqimish shalaah : laksanakanlah shalat-shalat wajib. (طَرَفَيِ ٱلنَّهَارِ) tharafayinnahaari : subuh pada awal yang pertama, kemudian zhuhur, ashar pada bagian kedua. (وَزُلَفٗا مِّنَ ٱلَّيۡلِۚ) wa zulafam minal lail : jam-jam malam, yaitu shalat maghrib dan isya. (إِنَّ ٱلۡحَسَنَٰتِ يُذۡهِبۡنَ ٱلسَّيِّ‍َٔاتِۚ) innal hasanaati yudzhibnas sayyiaat : pahala dari shalat lima waktu dapat menghapuskan dosa-dosa kecil yang terjadi di antara waktu shalat tersebut. (ذَٰلِكَ ذِكۡرَىٰ لِلذَّٰكِرِينَ) dzaalika dzikraa lidz dzaakiriin : yang telah disebutkan dalam firman-Nya (وَأَقِمِ ٱلصَّلَوٰةَ) “Tegakkanlah shalat.” Pelajaran bagi orang yang mau mengambil pelajaran. Makna ayat : Ayat ini masih menceritakan arahan untuk Rasulullah shalallahu ‘alaihi wa sallam dan orang-orang beriman, serta petunjuk bagi mereka menuju kesempurnaan dan kebahagiaan. Allah ta’ala berfirman : (وَأَقِمِ ٱلصَّلَوٰةَ طَرَفَيِ ٱلنَّهَارِ وَزُلَفٗا مِّنَ ٱلَّيۡلِۚ) Dirikanlah shalat di waktu yang lima ini yaitu: Subuh, Zhuhur, Ashar, Maghrib, dan ‘Isya. Tunaikanlah shalat dengan sempurna, sehingga ia menjadi kebaikan yang Allah akan menghapus dengannya keburukan. Firman-Nya : (ذَٰلِكَ) perkara yang diperintahkan serta konsekuensinya, (ذِكۡرَىٰ) pelajaran (لِلذَّٰكِرِينَ) bagi orang-orang yang mau mengambil pelajaran. Pelajaran dari ayat : • Penjelasan waktu-waktu shalat. Dua penghujung siang: pagi, yaitu shalat Subuh, serta petang, yaitu shalat Zhuhur dan Ashar, dan permulaan malam: yaitu shalat Maghrib dan Isya. • Pernjelasan ketentuan Allah ta’ala bahwa kebaikan menghapus keburukan, dan dalam hadits, “الصَّلَاةُ إِلىَ الصَّلاَةِ كَفَّارَةٌ لِمَا بَيْنَهَا مَا لَمْ تَغْشَ الكَبَائِرَ” “ Sholat ke sholat yang lain adalah penghapus dosa di antara keduanya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 114: Imam Bukhari dan Muslim meriwayatkan dari Ibnu Mas’ud radhiyallahu 'anhu, bahwa ada seorang laki-laki yang mencium seorang wanita, lalu laki-laki itu datang kepada Rasulullah shallallahu 'alaihi wa sallam dan menceritakan hal itu, maka turunlah kepada Beliau ayat, “Dan dirikanlah shalat pada kedua ujung siang (pagi dan petang) dan pada bagian permulaan malam. Perbuatan-perbuatan baik itu menghapus kesalahan-kesalahan. Itulah peringatan bagi orang-orang yang selalu mengingat (Allah).” Laki-laki itu berkata, “Apakah ayat ini untukku?” Beliau bersabda, “Untuk orang yang melakukan demikian di kalangan umatku.” Dalam riwayat Muslim dan para pemilik kitab sunan dari Ibnu Mas’ud disebutkan, “Ada seorang laki-laki yang datang kepada Nabi shallallahu 'alaihi wa sallam dan berkata, “Wahai Rasulullah, sesungguhnya saya mendapatkan seorang wanita di kebun, lalu aku berbuat segala sesuatu dengannya, hanyasaja aku tidak menjima’inya; aku mencium dan memeluknya. Oleh karena itu, lakukanlah terhadapku apa yang engkau kehendaki…dst.” Yakni shalat Subuh, Zhuhur dan ‘Ashar. Yaitu Maghrib dan Isya. Termasuk ke dalamnya shalat malam, karena ia dapat mendekatkan diri kepada Allah Subhaanahu wa Ta'aala berdasarkan lafaz “wa zulafam minal lail.” Seperti shalat yang lima waktu dan shalat-shalat sunat. Yakni dosa-dosa kecil, hal ini berdasarkan sabda Rasulullah shallallahu 'alaihi wa sallam: « الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ مَا بَيْنَهُنَّ إِذَا اجْتَنَبَ الْكَبَائِرَ » . “Shalat yang lima waktu, shalat Jum’at yang satu ke shalat Jum’at berikutnya, dan Ramadhan yang satu ke Ramadhan berikutnya mengapuskan dosa-dosa antara keduanya apabila ia menjauhi dosa-dosa besar.” (HR. Muslim) Kata “itu” di sini bisa tertuju kepada perintah-perintah sebelumnya, yaitu tetap istiqmah di atas jalan yang lurus, tidak melampaui batas, tidak cenderung kepada orang-orang zalim, mendirikan shalat dan penjelasan bahwa kebaikan-kebaikan dapat menghapuskan kesalahan-kesalahan. Dengannya mereka dapat memahami perintah dan larangan Allah, dan mereka bisa mengerjakan perbuatan-perbuatan baik yang membuahkan kebaikan dan menghindarkan keburukan. Akan tetapi, perbuatan tersebut butuh usaha keras dari dalam diri manusia dan kesabaran, oleh karenanya pada ayat selanjutnya Allah memerintahkan bersabar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 114",
    "description": "Setelah diperintahkan untuk istikamah dalam melaksanakan ajaran agama dan memiliki pendirian teguh, maka ayat berikut ini diperintahkan melaksanakan salat serta beramal saleh, karena amaliah tersebut dapat menghapus dosa-dosa kecil, sebagaimana firman-Nya: dan laksanakanlah salat dengan teratur dan benar sesuai dengan ketentuan agama, baik syarat, rukun, dan sunah-sunahnya pada kedua ujung siang, yakni pagi dan petang atau salat subuh, zuhur dan asar dan pada bagian permulaan malam yaitu salat magrib, isya, dan salat sunah seperti tahajud dan witir. Sesungguhnya perbuatan-perbuatan baik itu seperti salat sebagaimana disebutkan di atas, zakat, sedekah, zikir, istigfar, dan amal ibadah lainnya dapat menghapus kesalahan-kesalahan dan dosadosa kecil yang telah dilakukan, lantaran perbuatan itu tidak mudah dihindari. Adapun dosa besar, harus disertai dengan tobat yang tulus. Itulah peringatan yang sangat bermanfaat bagi orang-orang yang siap menerimanya dan selalu mengingat Allah. Dan selain mengerjakan salat, juga bersabarlah dalam menghadapi cobaan dan kesulitan ketika melaksanakan perintah Allah, karena tanpa kesabaran, amal ibadah terasa berat, terutama dalam hal beristikamah. Sesungguhnya Allah tidak menyia-nyiakan sedikit pun pahala yang diberikan kepada orang yang berbuat kebaikan. Perintah bersabar pada ayat ini mencakup bersabar dalam melaksanakan perintah Allah, dan bersabar dalam menghindari perbuatan maksiat maupun bersabar dalam menghadapi ujian atau cobaan."
  }
]