[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersabarlah kamu (Wahai Nabi), dalam mendirikan shalat dan dalam menghadapi ganguan dari kaum musyrikin dari kaummu. Sebab sesungguhnya Allah tidak akan menyia-nyiakan pahala orang-orang yang melakukan cara terbaik dalam perbuatan-perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "115. Dan bersabarlah dalam menjalankan apa yang diperintahkan kepadamu, seperti istikamah dan lain-lain. Dan juga bersabarlah dalam menjauhi apa yang dilarang bagimu, seperti melampaui batas dan berteman dengan orang-orang yang zalim. Sesungguhnya Allah tidak akan membatalkan pahala orang-orang yang berbuat baik. Dia akan menerima sebaik-baik amal yang mereka kerjakan dan akan memberikan balasan yang lebih baik dari apa yang telah mereka perbuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "115. Dan teguhlah dalam kesabaran, hiasilah dirimu dengan sifat ini, dan jadikan dirimu senantiasa berada dalam ketaatan kepada Allah dan menjauhi kemaksiatan. Sungguh Allah tidak akan menyia-nyiakan pahala bagi orang yang bersungguh-sungguh dalam beramal, menyadari pengawasan Allah, dan berbuat baik dan lembut kepada orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "115. وَاصْبِرْ (Dan bersabarlah) Bersabarlah atas apa yang Aku perintahkan, berupa keistiqamahan, tidak melakukan perbuatan yang melampaui batas, tidak condong kepada orang-orang zalim, dan menegakkan shalat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "115. Bersabarlah dalam melakukan shalat, beristiqamah, meninggalkan kezaliman dan condong kepada orang-orang zalim. Sesungguhnya Allah membalas orang-orang baik dengan pahala. Ayat ini mencakup kesabaran atas segala ketaatan dan meninggalkan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bersabarlah sesungguhnya Allah tidak akan menyia-nyiakan pahala orang yang berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "115 akan tetapi perkara perkara tersebut membutuhkan keteguhan dan kesabaran jiwa. Oleh karena itu, Allah berfirman ”dan besrsabarlah” yakni tahanlah dirimu atas ketaatan kepada Allah dan tahanlah dari kemaksiatan kepadaNya. teguhkanlah dirimu, teruskanlah atas hal itu dan jangan mengeluh “karena sesungguhnya Allah tiada menyia nyiakan pahala orang orang yang berbuat kebaikan” akan tetapi Dia menerima dari mereka sesuatu yang terbaik yang mereka kerjakan dan membalas mereka dengan balasan yang lebih baik dari apa yang mereka kerjakan. Ini mengandung dorongan yang besar kepada kesabaran dengan cara membuat jiwa yang lemah rindu kepada pahala setiap kali ia jenuh dan bosan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلۡمُحۡسِنِينَ) al-muhsinin : orang-orang yang niat, perkataan, dan amal mereka baik, di karenakan amal-amal tersebut ikhlas karena Allah, serta melakukannya seseuai dengan syariat Allah dan penjelasan Rasulullah shalallahu ‘alaihi wa sallam. Makna ayat : Firman-Nya : (وَٱصۡبِرۡ) bersabarlah dalam melakukan ketaatan dan meninggalkan keburukan, serta kepada gangguan para musyrikin, dan janganlah merasa sulit (فَإِنَّ ٱللَّهَ لَا يُضِيعُ أَجۡرَ ٱلۡمُحۡسِنِينَ) karena Allah tidak akan menyia-nyiakan balasan orang-orang yang berbuat kebajikan, balasan bagi mereka pada hari kiamat. Al-Muhsinun yaitu orang-orang yang mengikhlaskan amal mereka kepada Allah, serta menlaksanakannya dengan sesempurna mungkin, sehingga lahirlah kebaikan yang Allah hapus dengannya dosa-dosa. Pelajaran dari ayat : • Wajibnya bersabar dan berbuat kebajikan, keduanya termasuk amal-amalan yang utama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 115: Yakni terhadap gangguan kaummu atau bersabarlah dalam mendirikan shalat atau secara umum bersabar di atas ketaatan dan bersabar dalam menjauhi kemaksiatan. Yaitu mereka yang bersabar di atas ketaatan dan bersabar dalam menjauhi kemaksiatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 115",
    "description": "Dan selain mengerjakan salat, juga bersabarlah dalam menghadapi cobaan dan kesulitan ketika melaksanakan perintah Allah, karena tanpa kesabaran, amal ibadah terasa berat, terutama dalam hal beristikamah. Sesungguhnya Allah tidak menyia-nyiakan sedikit pun pahala yang diberikan kepada orang yang berbuat kebaikan. Perintah bersabar pada ayat ini mencakup bersabar dalam melaksanakan perintah Allah, dan bersabar dalam menghindari perbuatan maksiat maupun bersabar dalam menghadapi ujian atau cobaan. Setelah diuraikan tentang perintah menghindari perbuatan dosa, kemudian bimbingan cara menghapus kesalahan serta perintah bersabar, kemudian dijelaskan tentang gambaran kehancuran umat terdahulu. Maka sungguh disayangkan mengapa dari dahulu tidak ada di antara umat-umat sebelum kamu yang telah kami binasakan, terdapat sekelompok orang yang mempunyai keutamaan karena memiliki akal sehat dan cerdas yang melarang berbuat kerusakan di bumi, serta mencegah kemungkaran, kecuali sebagian kecil di antara orang yang telah kami selamatkan, yaitu orang-orang yang beriman kepada Allah dan mengikuti ajaran yang dibawa rasul-Nya. Dan adapun orang-orang yang zalim terhadap karunia Allah, hanya mementingkan kenikmatan dan kemewahan hidup duniawi, melupakan kehidupan akhirat, dan mereka mengikuti hawa nafsunya, mereka adalah orang-orang yang berdosa lagi durhaka, dan dosa yang mereka perbuat sudah terlalu berat sehingga Allah mengazab mereka (lihat: surah al-isra'/17:16)."
  }
]