[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mengapa tidak di jumpai pada masa-masa yang telah berlalu sejumlah orang dari orang-orang yang baik dan orang-orang shalih yang melarang para pelaku kekafiran mereka dan dari kekufuran mereka dan dari tindakan merusak di muka bumi. Dan tidak di jumpai dari kaum-kaum itu, kecuali segelintir saja orang-orang yang beriman, lalu Allah menyelamatkan mereka disebabkan hal itu dari siksa Nya ketika Allah menyiksa kaum yang zhalim. Dan memperturutkan orang-orang yang berbuat kezhaliman kepada dari mereka dari mereka dari setiap umat yang telah berlalu kepada kasenang-senangan dan kenikmatan-kenikmatan dunia. Dan mereka adalah orang yang gemar berbuat kajahatan lagi berbuat kazhaliman dengan ikut tenggelam dengan kenikmatan yang mereka peroleh, maka azab pasti bagi mereka. Dalam ayat ini terkandung pelajaran dan nasihat bagi oarng-orang yang suka berbuat maksiat dari kaum muslimin; karena mereka tidak membebaskan diri mereka dari sikap menzhalimi diri mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Seandainya saja di antara umat-umat yang ditimpa azab sebelum kalian ada sisa-sisa orang baik dan saleh yang melarang umat-umat tersebut dari ingkar kepada Allah dan melarang mereka dari berbuat kerusakan di muka bumi dengan perbuatan maksiat. Hanya sedikit sekali orang baik dan saleh yang tersisa di antara mereka. Orang-orang baik itu telah melarang mereka dari berbuat kerusakan di muka bumi. Oleh karena itulah Kami menyelamatkan mereka ketika Kami membinasakan kaum mereka yang zalim. Sedangkan orang-orang yang zalim di antara kaum mereka hanya mementingkan kenikmatan yang tengah mereka nikmati. Dan mereka menjadi zalim karena hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Mengapa orang-orang sebelum kalian tidak memiliki jiwa yang suci dan semangat yang tinggi, yang melarang orang lain berbuat kerusakan di muka bumi; kecuali sedikit dari mereka yang Allah selamatkan dengan kebaikan dan kesadaran mereka. Sedangkan orang-orang yang menzalimi diri mereka sendiri dan orang lain -dan mereka adalah mayoritas- menempuh jalan berfoya-foya dan menempatkan sesuatu bukan pada tempatnya, mereka berperang demi kekuasaan, kepemimpinan, dan kekayaan agar dapat bersenang-senang dengan harta dan kedudukan, mereka menempuh jalan ini dengan segala cara; mereka adalah orang-orang yang keji dan pembuat kerusakan serta berpaling dari jalan yang lurus dan memerangi kebenaran; sehingga mereka layak mendapat kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. فَلَوْلَا (Maka mengapa tidak ada) Maka tidakkah. كَانَ مِنَ الْقُرُونِ (dari umat-umat) Umat-umat yang telah ditimpa azab. مِن قَبْلِكُمْ أُو۟لُوا۟ بَقِيَّةٍ (yang sebelum kamu orang-orang yang mempunyai keutamaan) Dalam akal fikiran dan agama. يَنْهَوْنَ (yang melarang) Melarang kaumnya. عَنِ الْفَسَادِ فِى الْأَرْضِ إِلَّا قَلِيلًا (kerusakan di muka bumi, kecuali sebahagian kecil) Yakni, akan tetapi hanya sedikit dari mereka saja. مِّمَّنْ أَنجَيْنَا مِنْهُمْ ۗ( di antara orang-orang yang telah Kami selamatkan di antara mereka) Mereka dahulu melarang perbuatan merusak bumi, maka Kami menyelamatkan mereka. وَاتَّبَعَ الَّذِينَ ظَلَمُوا۟ مَآ أُتْرِفُوا۟ فِيهِ(dan orang-orang yang zalim hanya mementingkan kenikmatan yang mewah yang ada pada mereka) Lebih memilih hal itu daripada menyibukkan diri dengan amalan akhirat, dan mereka menghabiskan umur mereka untuk memuaskan syahwat. وَكَانُوا۟ مُجْرِمِينَ(dan mereka adalah orang-orang yang berdosa) Mereka mengikuti hawa nafsu mereka sehingga menjadi termasuk orang-orang yang berdosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116. Maka kenapa tidak ada umat-umat terdahulu yang Kami binasakan, yaitu orang-orang yang memiliki pikiran, akal dan agama itu mencegah kerusakan di dunia dari keburukan dan kemungkaran, kecuali sebagian kecil yang telah Kami selamatkan dari azab. Mereka itu adalah orang-orang yang beriman dengan risalah para nabi. Mereka menunaikan hal penting ini, lalu Kami menyelamatkan mereka. Orang-orang yang menzalimi diri sendiri itu mementingkan kenikmatan berupa syahwat dan tempat aman atas amal akhirat. Dan orang-orang yang mengikuti syahwat itu adalah orang-orang jahat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka mengapa tidak} maka mengapa tidak {ada di antara generasi} umat {sebelum kalian sekelompok orang yang mempunyai keutamaan} orang yang memiliki kelebihan berbuat baik dan karunia {yang melarang kerusakan di bumi, kecuali sebagian kecil, yaitu orang yang telah Kami selamatkan di antara mereka. Orang-orang yang zalim mengikuti sesuatu yang membuat mereka senang} sesuatu yang membuat mereka bahagia berupa kenikmatan dunia {dan mereka adalah orang-orang yang berdosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116 tatkala Allah menyebutkan pembinasaan umat umat yang mendustakan para rasul dan bahwa kebanyakan dari mereka menyimpang dari ahli kitab ilahiyah, dan semua itu mematikan dan melenyapkan agama agama, maka Dia menyebutkan bahwa mengapa tidak dijadikan (dari umat umat yang telah berlalu) sisa sisa orang yang baik yang menyeru kepada petunjuk, melarang kerusakan dan penyimpangan sehingga terwujudlah manfaat mereka yang dengannya agama agama terpelihara? akan tetapi mereka sangat sedikit sekali. Intinya mereka itu selamat karena mengikuti rasul rasul, dan mereka melaksanakan ajaran agama mereka, dan ia adalah hujjah Allah yang Allah berlakukan melalui tangan mereka agar orang yang binasa menjadi binasa dengan kejelasan, dan orang yang hidup menjadi hidup dengan kejelasan ”dan“ akan tetapi “orang orang yang zhalim hanya mementingkan kenikmatan yang mewah yang ada pada mereka” maksudnya mereka memperturutkan kenikmatan dan kemewahan yang mereka rasakan, dan tidak menginginkan penggantinya “dan mereka adalah orang orang yang berdosa” lagi zhalim dengan mengikuti kemewahan. oleh karena itu, mereka ditimpa dan dibinasakan oleh siksa dan azab. Ini mengandung dorongan bagi umat ini agar tetap ada sisa sisa orang yang memperbaiki apa yang dirusak oleh manusia, mereka tegak berpegang teguh dengan agama Allah menyeru orang yang sesat kepada petunjuk, bersabar atas gangguan dari mereka, mengentaskan mereka dari ketidaktahuan. Ini adalah posisi tertinggi yang diminati oleh orang yang berminat, pemilik kedudukan ini adalah seorang imam dalam agama, apabila perbuatannya diikhlaskan kepada Allah, Rabb semesta alam."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَلَوۡلَا) falaulaa : (لولا) kata pemberi anjuran dan motivasi untuk melakukan sesuatu. (مِنَ ٱلۡقُرُونِ) minal quruun : penduduk suatu masa, Al-Quruun yaitu seratus tahun (satu abad). (أُوْلُواْ بَقِيَّةٖ) uluu baqiyyah : pemilik peninggalan berupa agama dan ilmu. (مَآ أُتۡرِفُواْ فِيهِ) maa utrifuu fiihi : apa yang mereka nikmati berupa makanan, minuman, baju yang mewah. (وَكَانُواْ مُجۡرِمِينَ) wa kaanuu mujrimiin : mereka berbuat buruk kepada diri sendiri dengan melakukan maksiat, serta orang lain dengan mengajak mereka melakukan keburukan. Makna ayat : Allah berfirman kepada Rasul-Nya : (فَلَوۡلَا كَانَ مِنَ ٱلۡقُرُونِ) Jika saja orang-orang di masa sebelum kalian—wahai Rasulullah dan kaum mukminin—( أُوْلُواْ بَقِيَّةٖ) orang-orang yang memiliki pemahaman, akal, keutamaan, serta agama, mereka melarang dari kesyirikan, dusta, dan kemaksiatan. Mengapa mereka tidak melakukannya, mereka itu—bisa jadi—hanya sedikit dari mereka yang Allah selamatkan berupa para pengikut Rasul dari pemusnahan umat-umat mereka. Firman-Nya : (وَٱتَّبَعَ ٱلَّذِينَ ظَلَمُواْ مَآ أُتۡرِفُواْ فِيهِ وَكَانُواْ مُجۡرِمِينَ) tidak ada di antara mereka ulama yang melarang dari membuat kerusakan di bumi, kecuali sedikit dari mereka yang Allah selamatkan. Adapun selain mereka adalah orang-orang zalim terhadap diri mereka sendiri, dengan melakukan kesyirikan, maksiat, serta berfoya-foya dengan kenikmatan dunia, oleh karena itu semua mereka termasuk orang-orang yang berdosa. Lalu Allah binasakan mereka dan menyelamatkan Rasul-Nya dan orang-orang beriman, sebagaimana yang telah dikisahkan mengenai kaum Nuh, Hud, Shalih, dan Syu’aib alahim salam. Pelajaran dari ayat : • Manusia akan terus berada di atas kebaikan, selama masih ada ulama-ulama yang mengajak kepada kebaikan dan melarang dari kerusakan dan keburukan. • Bermegah-megahan banyak membawa seseorang menyakiti dirinya sendiri dengan mengikuti hawa nafsunya dan meninggalkan amal-amal saleh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 116: Setelah sebelumnya Allah Subhaanahu wa Ta'aala menyebutkan tentang kebinasaan umat-umat terdahulu yang mendustakan para rasul, maka Allah Subhaanahu wa Ta'aala menyebutkan bahwa kalau sekiranya di kalangan umat-umat itu ada orang-orang yang utama yang mengajak kepada petunjuk dan melarang perbuatan buruk, tentu mereka akan selamat, akan tetapi sedikit sekali orang yang melakukan. Oleh karena itu, umat akan tetap eksis selama mereka mengikuti petunjuk Allah yang dibawa oleh para rasul, dan jika mereka meninggalkannya, maka mereka akan binasa. Mereka melakukan amar ma’ruf dan nahi munkar sehingga mereka selamat. Baik dengan melakukan kerusakan di bumi (kemaksiatan) maupun dengan tidak melakukan nahi munkar padahal mampu. Oleh karena itu, mereka mesti diberi hukuman dan dibinasakan oleh azab. Dalam ayat ini terdapat dorongan kepada umat ini agar di tengah-tengah mereka ada orang-orang yang utama yang mengadakan perbaikan, yang menegakkan agama Allah, mengajak orang yang tersesat kepada petunjuk, bersabar terhadap gangguan dan menerangkan jalan yang lurus kepada masyarakat yang sebelumnya nampak gelap di hadapan mereka. Orang yang melakukannya kedudukannya dalam agama adalah tinggi dan pelakunya menjadi imam dalam agama ini apabila dia melakukannya ikhlas karena Allah Rabbul ‘alamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 116",
    "description": "Setelah diuraikan tentang perintah menghindari perbuatan dosa, kemudian bimbingan cara menghapus kesalahan serta perintah bersabar, kemudian dijelaskan tentang gambaran kehancuran umat terdahulu. Maka sungguh disayangkan mengapa dari dahulu tidak ada di antara umat-umat sebelum kamu yang telah kami binasakan, terdapat sekelompok orang yang mempunyai keutamaan karena memiliki akal sehat dan cerdas yang melarang berbuat kerusakan di bumi, serta mencegah kemungkaran, kecuali sebagian kecil di antara orang yang telah kami selamatkan, yaitu orang-orang yang beriman kepada Allah dan mengikuti ajaran yang dibawa rasul-Nya. Dan adapun orang-orang yang zalim terhadap karunia Allah, hanya mementingkan kenikmatan dan kemewahan hidup duniawi, melupakan kehidupan akhirat, dan mereka mengikuti hawa nafsunya, mereka adalah orang-orang yang berdosa lagi durhaka, dan dosa yang mereka perbuat sudah terlalu berat sehingga Allah mengazab mereka (lihat: surah al-isra'/17:16). Dan sekali-kali tuhanmu yang membimbing dan memberi petunjuk kepada hamba-Nya tidak akan membinasakan negeri-negeri secara zalim, yakni membinasakan secara total dan menyeluruh, selama penduduknya negeri itu adalah orang-orang yang selalu berbuat kebaikan, baik dalam beragama maupun dalam kehidupan sosial kemasyarakatan."
  }
]