[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Tuhanmu wahai Rasul, sekali-kali tidak akan membinasakan suatu negri dari negri-negri yang ada, sedang para penduduknya melakukan perbaikan di muka bumi lagi menjauhi perbuatan kerusakan dan kezhaliman, Sesungguhnya Dia hanya menghancurkan disebabkan oleh tindakan kezhaliman dan kerusakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Dan tidaklah Tuhanmu -wahai Rasul- membinasakan suatu negeri apabila penduduknya melakukan perbaikan di muka bumi. Dia akan membinasakannya hanya apabila penduduknya melakukan perusakan melalui perbuatan-perbuatan yang tergolong kafir, zalim dan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117. Dan bagian dari ketetapan Allah yang menunjukkan keadilan dan rahmat-Nya, Dia tidak membinasakan suatu negeri secara zalim yang penduduknya senantiasa melakukan perbaikan; akan tetapi Allah membinasakan negeri yang penduduknya senantiasa berbuat kezaliman dan kerusakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. وَمَا كَانَ رَبُّكَ لِيُهْلِكَ الْقُرَىٰ بِظُلْمٍ وَأَهْلُهَا مُصْلِحُونَ (Dan Tuhanmu sekali-kali tidak akan membinasakan negeri-negeri secara zalim, sedang penduduknya orang-orang yang berbuat kebaikan) Yakni saling menasehati. Allah tidak akan membinasakan mereka sampai perbuatan merusak di bumi telah menjadi sifat mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kebaikan diri dari pribadi seseorang belum tentu memberikan kebaikan bagi orang lain, karena terkadang ia lalai dan mengabaikan keadaan orang-orang disekitarnya, padahal syari'at memerintahkan agar setiap diri memperbaiki dirinya masing-masing dan menyebarkan kebaikan kepada siapapun di sekitarnya, oleh karena itu jadilah anda orang yang baik dan berbuatlah kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117. Dan Tuhanmu tidak akan membinasakan penduduk suatu negeri dengan semena-mena, sedangkan mereka baik dalam mengerjakan amal agama dan dunia, berupa keimanan dan ibadah muamalah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhanmu tidak akan membinasakan negeri-negeri secara zalim sedangkan penduduknya berbuat kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117 maksudnya, Allah tidak patut membinasakan sebuah negeri secara zhalim, padahal mereka itu “berbuat kebaikan” yakni mereka berjalan diatas kebaikan dengan terus menerus, maka Allah tidak patut membinasakannya kecuali jika mereka berbuat zhalim dan hujjah Allah telah tegak atasnya. Bisa jadi maknanya adalah bahwa Allah tidak akan membinasakan negeri karena kezhalimannya dahulu, jika mereka bertaubat dan memperbaiki amal perbuatannya, karena Allah memaafkan mereka dan menghapus kezhaliman mereka yang telah lalu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِظُلۡمٖ) bizhulmin : (menyiksa mereka dengan zalim) tanpa ada kesalahan yang mereka perbuat. Makna ayat : Firman-Nya : (وَمَا كَانَ رَبُّكَ لِيُهۡلِكَ ٱلۡقُرَىٰ بِظُلۡمٖ وَأَهۡلُهَا مُصۡلِحُونَ) Tidak mungkin Rabbmu—wahai Rasulullah—memusnahkan suatu kaum dengan zalim, padahal mereka adalah orang-orang yang berbuat kebaikan. Namun, Dia menhancurkan mereka karena kezaliman mereka terhadap diri mereka sendiri, dengan berbuat syirik, mendustakan utusan-utusan-Nya, dan maksiat. Isi dari ayat ini, menjelaskan ketetapan Allah dalam menghancurkan umat-umat terdahulu, di antaranya yang telah dikisahkan di dalam surat ini. Pelajaran dari ayat : • Selama penduduk suatu negeri adalah orang-orang saleh, mereka akan aman dari segala mara bahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 117: Dia tidak berbuat zalim kepada mereka. Oleh karena itu, Allah tidak akan membinasakan mereka kecuali apabila mereka berbuat zalim dan telah tegak hujjah kepada mereka. Maksud ayat ini bisa juga bahwa Allah tidak akan membinasakan neger-negeri karena kezaliman mereka yang dahulu apabila mereka telah rujuk dan memperbaiki amal mereka, karena Allah akan memaafkan mereka, dan menghapuskan kezaliman mereka yang telah lalu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 117",
    "description": "Dan sekali-kali tuhanmu yang membimbing dan memberi petunjuk kepada hamba-Nya tidak akan membinasakan negeri-negeri secara zalim, yakni membinasakan secara total dan menyeluruh, selama penduduknya negeri itu adalah orang-orang yang selalu berbuat kebaikan, baik dalam beragama maupun dalam kehidupan sosial kemasyarakatan. Dan jika tuhanmu wahai nabi Muhammad yang membimbing dan memberiimu menghendaki, tentu dia jadikan seluruh manusia menjadi umat yang satu, yakni menganut satu agama, satu keyakinan, atau satu pendapat, tetapi Allah tidak menghendaki demikian, melainkan memberikan kebebasan kepada manusia untuk memilih'sebagai wujud keadilan Allah dalam memberikan pahala dan siksa. Meskipun Allah memberi mereka kebebasan memilih, mereka senantiasa tetap berselisih pendapat tentang kebenaran, lantaran mereka mengikuti hawa nafsunya."
  }
]