[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekiranya Tuhanmu menghendaki, pastilah Dia akan menjadikan manusia semuanya umat yang bersatu diatas satu agama, yaitu islam. Akan tetapi, Dia tidak menghendakinya, sehingga manusia akan tetap saling berselisih dalam agama-agama mereka, dan itu sesuai dengan kandungan hikmahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Sekiranya Tuhanmu -wahai Rasul- berkehendak membuat manusia menjadi satu umat yang mengikuti kebenaran, niscaya Dia akan melakukannya. Akan tetapi Dia tidak menghendaki hal itu. Maka merekapun terus-menerus berselisih paham tentang kebenaran gara-gara mengikuti hawa nafsu dan melampaui batas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "118. Seandainya Tuhanmu menghendaki, niscaya Dia akan menjadikan seluruh manusia dalam satu golongan, di atas kalimat tauhid dan jalan para nabi. Akan tetapi Allah tidak memaksa hamba-hamba-Nya untuk menempuh jalan kebenaran, namun hanya menyeru mereka kepadanya dan membiarkan mereka memilih; sehingga sebagian mereka beriman, dan sebagian lainnya menuruti hawa nafsunya; oleh sebab itu mereka selalu berselisih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. وَلَوْ شَآءَ رَبُّكَ لَجَعَلَ النَّاسَ أُمَّةً وٰحِدَةً ۖ (Jikalau Tuhanmu menghendaki, tentu Dia menjadikan manusia umat yang satu) Umat yang berada diatas kebenaran tanpa ada perselisihan, yang bersatu dalam agama Islam saja. وَلَا يَزَالُونَ مُخْتَلِفِينَ(tetapi mereka senantiasa berselisih pendapat) Mereka masih saja berselisih tentang kebenaran karena mengikuti hawa nafsu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "118-119 Qhotadah -rahimahullah- mengatakan : orrang-orang yang berada di bawah naungan rahmat Allah adalah mereka yang senantiasa dalam jama'ah. sekalipaun rumah-rumah dan badan mereka terpisah, sedangkan orang-orang terjerumus dalam maksiat adalah mereka selalu berselisih dan bertolak belakang sesamanya, sekalipun rumah dan jasad mereka berdekatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118. Jika Tuhanmu berkehendak, niscaya Dia akan menjadikan semuanya berada dalam satu agama, namun Dia menghendaki agar memilih, dengan tujuan untuk mewujudkan prinsip keadilan terkait pahala dan hukuman. Setelah menentukan pilihan, mereka masih tetap berselisih karena selalu mengikuti hawa nafsu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Tuhanmu menghendaki, sungguh Dia akan menjadikan manusia umat yang satu} pemeluk agama yang satu {Dan mereka senantiasa berselisih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "118 Allah mengabarkan bahwa kalau Dia berkehendak, niscaya Dia menjadikan manusia umat yang satu, berpegang teguh pada agama islam karena kehendak Allah tiada berbatas, taka da satupun yang menghalangiNya, akan tetapi hikmahNya menuntut mereka terus berselisih, menyelisihi jalan yang lurus, mengikuti jalan yang mengantarkan kepada neraka. Masing masing melihat kebenaran pada dirinya dan kesesatan pada orang lain."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أُمَّةٗ وَٰحِدَةٗۖ) ummataw wahidah : di atas satu agama yaitu Islam. Makna ayat : Firman-Nya : (وَلَوۡ شَآءَ رَبُّكَ لَجَعَلَ ٱلنَّاسَ أُمَّةٗ وَٰحِدَةٗۖ) menjadikan kalian semua berada di atas Islam, dengan menciptakan langsung hidayah di dalam hati mereka dan menghilangkan segala penghalang hidayah. Tapi Dia tidak berkehendak demikian, dan mereka senantiasa berada dalam perselisihan: dalam jenis agama yang bervariasi baik itu Yahudi, Nasrani, Majusi, dan bahkan suatu agama dapat terpecah kembali menjadi kelompok-kelompok yang bermacam-macam. Pelajaran dari ayat : • Persatuan adalah rahmat dan perpecahan adalah azab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 118: Di atas agama yang satu, yaitu Islam. Hikmah-Nya menghendaki bahwa mereka akan senantiasa berselisih, menyelisihi jalan yang lurus, mengikuti jalan yang menghubungkan ke neraka, masing-masing melihat bahwa dirinya yang benar sedangkan yang lain salah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 118",
    "description": "Dan jika tuhanmu wahai nabi Muhammad yang membimbing dan memberiimu menghendaki, tentu dia jadikan seluruh manusia menjadi umat yang satu, yakni menganut satu agama, satu keyakinan, atau satu pendapat, tetapi Allah tidak menghendaki demikian, melainkan memberikan kebebasan kepada manusia untuk memilih'sebagai wujud keadilan Allah dalam memberikan pahala dan siksa. Meskipun Allah memberi mereka kebebasan memilih, mereka senantiasa tetap berselisih pendapat tentang kebenaran, lantaran mereka mengikuti hawa nafsunya. Perselisihan itu terjadi kecuali di antara orang yang diberi rahmat oleh tuhanmu, mereka tidak berselisih, tetap mengikuti petunjuk Allah dan memilih agama yang benar. Dan untuk itulah Allah menciptakan sebagian mereka sengsara dan sebagian lain bahagia. Kalimat tuhanmu, yakni keputusan-ku telah tetap, bahwa aku pasti akan memenuhi neraka jahanam dengan jin dan manusia semuanya yang durhaka."
  }
]