[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali orang yang dirahmati tuhanmu, lalu mereka beriman kepadaNya dan mengikuti rasul-rasulNya. Maka mereka itu sesungguhnya tidak akan berselisih dalam mentauhidkan Allah dan risalah yang dibawa oleh para rasul dari sisi Allah. dan sesungguhnya hikmah Allah telah berkonsekuensi Dia menciptakan manusia dalam keadaan berselisih, satu golongan celaka dan golongan lain bahagia. Dan masing-masing berjalan menuju takdir penciptaannya. Dengan ini, maka terpenuhilah janji Allah dalam ketetapan qadha dan qadarNya, bahwa Dia akan memenuhi Neraka jahanam dengan makhluk dari bangsa jin dan manusia yang mengikuti iblis dan tentara-tentaranya, dan mereka tidak memperoleh petunjuk menuju keimanan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Kecuali orang yang dirahmati Allah dengan bimbingan-Nya ke jalan yang benar. Mereka itulah orang-orang yang tidak berselisih paham tentang keesaan Allah. Dan untuk menghadapi ujian perselisihan paham itulah Allah menciptakan mereka. Sehingga ada yang celaka dan ada yang bahagia. Dan kalimah Tuhanmu -wahai Rasul- yang telah ditetapkan-Nya di zaman azali memastikan bahwa Dia akan mengisi Neraka Jahannam dengan para pengikut setan dari bangsa jin dan manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Kecuali orang yang dirahmati Pencipta dan Pemberimu hidayah, dan menjauhkannya dari kesesatan dan memberinya petunjuk kepada kebenaran; dan demi kebenaran dan ujian inilah Allah menciptakan mereka, agar dapat membedakan antara orang yang beriman dan orang yang kafir. Dengan sunnatullah inilah dapat terwujud janji Allah bagi orang-orang yang lebih memilih jalan kesesatan, sehingga neraka Jahannam penuh dengan mereka karena jumlah mereka begitu banyak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. إِلَّا مَن رَّحِمَ رَبُّكَ ۚ (kecuali orang-orang yang diberi rahmat oleh Tuhanmu) Dengan memberinya hidayah kepada agama yang benar. Maka mereka itu bukanlah orang-orang yang berselisih. وَلِذٰلِكَ (Dan untuk itulah) Yakni untuk perselisihan ini. خَلَقَهُمْ ۗ (Allah menciptakan mereka) Atau sebab rahmat-Nya Allah menciptakan mereka. وَتَمَّتْ كَلِمَةُ رَبِّكَ(Kalimat Tuhanmu (keputusan-Nya) telah ditetapkan) Telah ditetapkan sebagaimana yang telah ditetapkan di masa Azaly-Nya. Dan apabila telah ditetapkan maka tidak mungkin dapat dirubah. Kalimat ini yakni firman-Nya: لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ (sesungguhnya Aku akan memenuhi neraka Jahannam dengan jin dan manusia (yang durhaka) semuanya) Yakni dengan makhluk-Nya yang berhak masuk neraka dari golongan jin dan manusia. Dalam hadits disebutkan: Allah berfirman kepada surga “kamu adalah rahmat-Ku, denganmu Aku mengasihi siapa yang Aku kehendaki”. Dan Allah berfirman kepada neraka: “kamu adalah azab-Ku, denganmu Aku mengazab siapa yang Aku kehendaki. Dan Aku akan mengisi kalian dengan penghuni masing-masing dari kalian”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "118-119 Qhotadah -rahimahullah- mengatakan : orrang-orang yang berada di bawah naungan rahmat Allah adalah mereka yang senantiasa dalam jama'ah. sekalipaun rumah-rumah dan badan mereka terpisah, sedangkan orang-orang terjerumus dalam maksiat adalah mereka selalu berselisih dan bertolak belakang sesamanya, sekalipun rumah dan jasad mereka berdekatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119. Mereka masih tetap berselisih kecuali orang yang dikasihi Allah, dan diberi petunjuk dengan keutamaanNya menuju agama yang benar. Untuk mewujudkan kehendak ini, tanpa ada paksaan, DIa menciptakan mereka agar memilih. Seperti itulah Dia menciptakan mereka sesuai rahmatNya. Ketentuan dan perintah Allah masih tetap, yaitu akan mengisi neraka dengan manusia dan jin karena kekufuran dan kemaksiatan mereka, yaitu keduanya, bukan salah satunya saja"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang yang dirahmati oleh Tuhanmu. Karena itulah} karena munculnya perselisihan itu {Allah menciptakan mereka. Kalam Tuhanmu telah sempurna,“Sungguh aku akan memenuhi neraka Jahanam dengan golongan jin dan manusia semuanya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119 “kecuali orang orang yang diberi rahmat oleh Rabbmu” lalu Dia membimbing mereka kepada ilmu tentang kebenaran, mengamalkannya dan bersepakat diatasnya. Mereka itu telah ditakdirkan kebahagiaan bagi mereka dan memperoleh perhatian Rabbani dan taufik ilahi. Adapun selain mereka, maka mereka adalah orang orang yang tertipu yang bersandar kepada dirinya sendiri, FirmanNya ”dan untuk itulah Allah menciptakan mereka” maksudnya hikmahNya menuntut bahwa Dia menciptakan mereka agar ada diantara mereka yang berbahagia dan ada yang sengsara, yang sepakat dan yang berselisih, ada kelompok yang ditakdirkan untuknya kesesatan agar keadilan dan hikmahNYa diketahui oleh manusia, dan agar apa yang tersimpan dalam tabiat manusia dari kebaikan dan keburukan diketahui, serta agar medan jihad dan ibadah menjadi tegak yang mana ia tidak terlaksana dan tercapai kecuali dengan ujian. ”dan” karenanya, ”kalimat Rabbmu (keputusanNya) telah ditetapkan. Sesungguhnya aku akan memenuhi Neraka jahanam dengan jin dan manusia (yang durhaka) semuanya” pasti Dia akan memudahkan penghuni neraka yang melakukan perbuatan neraka untuk mengantarkan kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَلِذَٰلِكَ خَلَقَهُمۡۗ) wa lidzaalika khalahum : menciptakan orang yang suka berselisih untuk terus berselisih dan orang-orang yang dirahmati untuk senantiasa berada di dalam rahmat-Nya. Makna ayat : Firman-Nya : (إِلَّا مَن رَّحِمَ رَبُّكَۚ) Wahai Rasulullah! Sesungguhnya mereka tidak akan berselisih, bahkan beriman kepada Allah dan Rasul-Nya, beramal dengan ketaatan kepada keduanya, tidak ada firqah di antara mereka tidak pula perselisihan, agama mereka satu dan perkara mereka satu. Firman-Nya : (وَلِذَٰلِكَ خَلَقَهُمۡۗ) oleh karena itu Dia menciptakan mereka. Di antara mereka ada yang kafir, ada juga yang beriman. Orang kafir adalah orang yang sengsara, sedangkan mukmin adalah orang yang bahagia. Firman-Nya : (وَتَمَّتۡ) benar adanya dan pasti akan terjadi, yaitu (كَلِمَةُ رَبِّكَ لَأَمۡلَأَنَّ جَهَنَّمَ مِنَ ٱلۡجِنَّةِ وَٱلنَّاسِ أَجۡمَعِينَ) karena perselisihan mereka membawa mereka menuju neraka Jahanam, dan Allah telah menetapkan akan memenuhi neraka Jahanam dengan jin dan manusia seluruhnya, dan pasti akan terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 119: Yakni Allah menginginkan kebaikan untuk mereka, sehingga mereka tidak berselisih. Allah menunjukkan mereka kepada ilmu (pengetahuan terhadap kebenaran) dan amal, serta bersepakat di atasnya. Adapun selain mereka, maka mereka akan dibiarkan dan dierahkan kepada diri mereka sendiri. Hikmah Allah menghendaki, Dia menciptakan mereka agar di antara mereka ada orang yang bahagia dan ada orang yang sengsara, ada orang yang bersatu, dan ada orang yang berselisih, ada yang diberi petunjuk dan ada yang mesti tersesat, agar semakin jelas kepada manusia keadilan-Nya, dan hikmah-Nya dan untuk memperlihatkan apa yang tersembunyi dalam diri manusia berupa kebaikan atau keburukan. Demikian juga agar lapangan jihad dan ibadah tegak, di mana hal itu tidak mungkin sempurna kecuali dengan adanya ujian dan cobaan. Di samping itu, karena kalimat (keputusan) Tuhanmu telah tetap, “Aku pasti akan memenuhi neraka Jahanam dengan jin dan manusia (yang durhaka) semuanya.” Sehingga Dia memudahkan penghuni neraka untuk memasukinya dengan mengerjakan amal yang akan menyampaikan mereka kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 119",
    "description": "Perselisihan itu terjadi kecuali di antara orang yang diberi rahmat oleh tuhanmu, mereka tidak berselisih, tetap mengikuti petunjuk Allah dan memilih agama yang benar. Dan untuk itulah Allah menciptakan sebagian mereka sengsara dan sebagian lain bahagia. Kalimat tuhanmu, yakni keputusan-ku telah tetap, bahwa aku pasti akan memenuhi neraka jahanam dengan jin dan manusia semuanya yang durhaka. Setelah dijelaskan tentang tujuan diutusnya para rasul, pada ayat ini dijelaskan kembali manfaat dari kisah-kisah yang dipaparkan bagi umat sesudahnya. Dan semua kisah rasul-rasul yang kami ceritakan kepadamu wahai nabi Muhammad agar dengan kisah itu kami teguhkan hatimu dalam menghadapi rintangan, dan tegar dalam melaksanakan tugas-tugas berat yang dibebankan kepadamu; dan di dalamnya telah diberikan kepadamu segala sesuatu tentang kebenaran, nasihat yang membimbingmu menuju kebaikan, dan peringatan bagi orang yang beriman agar bisa memetik manfaatnya dan berpengaruh dalam dirinya."
  }
]