[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka barangkali kamu (wahai rasul dikarenakan beratnya apa yang kamu saksikan pada mereka berupa kekafiran dan pendustaan) akan meninggalkan sebagian apa yang telah diwahyukan kepadamu dari wahyu yang Allah turunkan kepadamu dan yang telah perintahkan kamu untuk menyampaikannya, dan dadamu menjadi sesak lantaran khawatir mereka akn menuntut darimu beberapa tuntutan sebagai bentuk kerasnya sikap mereka, seperti mengatakan, ”sekiranya diturunkan padanya harta yang melimpah ruah, atau malaikat datang bersamanya untuk membenarkan ajaran risalahnya.” karenanya, sampaikanlah olehmu apa yang aku wahyukan kepadamu, karena sesungguhnya tidak ada kewajiban atas dirimu selain memberikan peringatan saja dengan wahyu yang diturunkan kepadamu. Dan Allah Mahamemelihara segala sesuatu, juga mengatur semua urusan makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Boleh jadi karena engkau -wahai Rasul- menghadapi kekafiran mereka, keangkuhan mereka dan usulan mereka untuk mendatangkan ayat-ayat yang sesuai dengan selera mereka, maka engkau memutuskan untuk tidak menyampaikan sebagian dari apa yang harus engkau sampaikan karena menurutmu hal itu akan sulit mereka laksanakan, dan dadamu terasa sesak untuk menyampaikannya kepada mereka agar mereka tidak berkata, \"Mengapa dia tidak diberi kekayaan yang cukup? Atau mengapa tidak ada Malaikat yang datang bersamanya untuk membenarkan ucapannya?\" Janganlah engkau memutuskan untuk tidak menyampaikan sebagian dari wahyu yang diturunkan kepadamu karena alasan itu. Sesungguhnya engkau hanyalah seorang pemberi peringatan yang bertugas menyampaikan apa yang harus engkau sampaikan. Bukanlah kewajibanmu untuk mendatangkan ayat-ayat yang mereka usulkan. Dan Allah Maha Menjaga segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Janganlah sekali-kali menggoyahkan tekatmu dan memalingkanmu dari dakwahmu, kebatilan-kebatilan yang mereka sebarkan dan keinginan-keinginan yang selalu mereka ajukan yang menampakkan kebebalan mereka, yaitu ketika mereka berkata: “Mengapa tidak turun baginya harta melimpah atau malaikat dari langit yang membenarkan perkataannya”. Mereka mengatakan ini karena mereka tidak mengetahui hakikat risalah dan dakwah para rasul yaitu sebagai peringatan dan pemberi penjelasan. Maka janganlah perkataan mereka ini melemahkanmu dan membuatmu meninggalkan apa yang diwahyukan kepadamu; sebab kamu bukan penanggung jawab mereka, namun kamu hanyalah pemberi peringatan. Allah-lah yang mengatur segala yang ada di alam semesta, seandainya Dia menghendaki niscaya Dia akan mendatangkan kepada mereka mukjizat-mukjizat tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. فَلَعَلَّكَ تَارِكٌۢ بَعْضَ مَا يُوحَىٰٓ إِلَيْكَ (Maka boleh jadi kamu hendak meninggalkan sebahagian dari apa yang diwahyukan kepadamu) Yakni boleh jadi karena dahsyatnya apa yang akan kamu saksikan dari mereka berupa keingkaran mereka atas kenikmatan Allah dan kedustaan mereka terhadap ayat-ayat Allah, serta permintaan mereka kepadamu untuk didatangkan mukjizat-mukjizat sesuai dengan keinginan dan hawa hafsu mereka, maka kamu akan meninggalkan sebagian apa yang telah diturunkan kepadamu dan apa yang diperintahkan kepadamu untuk menyampaikannya kepada umatmu berupa sesuatu yang susah untuk mereka terima dan amalkan. Yakni, maka janganlah kamu berbuat seperti itu, namun sampaikanlah kepada mereka semua yang telah diturunkan kepadamu, baik itu mereka sukai atau mereka benci. وَضَآئِقٌۢ بِهِۦ صَدْرُكَ(dan sempit karenanya dadamu) Disebabkan oleh kekhawatiran. أَن يَقُولُوا۟ لَوْلَآ أُنزِلَ عَلَيْهِ كَنزٌ (bahwa mereka akan mengatakan: “Mengapa tidak diturunkan kepadanya perbendaharaan (kekayaan)) Yakni harta yang tersimpan yang dapat ia manfaatkan. أَوْ جَآءَ مَعَهُۥ مَلَكٌ ۚ (atau datang bersama-sama dengan dia seorang malaikat?”) Malaikat yang membenarkanmu dan menjelaskan kepada kami tentang kebenaran kerasulanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Maka janganlah engkau tinggalkan beberapa wahyu yang telah diwahyukan kepadamu karena khawatir bahwa mereka akan mendustakan dan mengolok dengan mengatakan: “Mengapa dia tidak diberi kekayaan atau tidak disertai oleh seorang malaikat sehingga kenabiannya terbukti?” Sesungguhnya kamu hanyalah seorang pemberi peringatan dan Allah Pemelihara segala sesuatu. Maka berserahlah dan berpeganglah kepada Allah. Dia membalas seluruh manusia atas amalnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Boleh jadi kamu hendak meninggalkan sebagian dari apa yang diwahyukan kepadamu dan dadamu menjadi sempit karena mereka berkata} agar mereka tidak berkata {“Mengapa tidak} mengapa tidak {diturunkan kepadanya harta} harta yang banyak {atau telah datang malaikat bersamanya” Sesungguhnya kamu hanyalah seorang pemberi peringatan. dan Allah adalah pemelihara segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah berfirman menghibur nabiNya Muhammad terhadap pendustaan orang-orang yang mendustakan, ”maka boleh jadi kamu hendak meninggalkan sebagian dari apa yang diwahyukan kepadamu dan dadamu sempit karenanya, karena khawatir bahwa mereka akan mengatakan, ’mengapa tidak diturunkan kepadanya perbendaharaan (kekayaan)” maksudnya ini tidak layak untuk orang sepertimu, karena ucapan mereka berpengaruh padamu dan menghalangi pekerjaan dakwahmu, akibatnya kamu meninggalkan sebagian yang diwahyukan kepadamu dan dadamu menjadi sempit karena penolakan mereka dengan ucapan mereka, ”mengapa tidak diturunkan kepadanya pembendaharaan (kekayaan) atau datang bersama sama dengannya seorang malaikat?” ucapan ini muncul dari pengingkaran, kezaliman, kesombongan, kesesatan dan kebodohan terhadap tempat tempat dalil dan bukti, maka majulah terus diatas dakwahmu. ucapan ucapan yang lemah yang keluar dari orang bodoh ini janganlah menghalangimu, janganlah membuat dadamu sempit karenanya. apakah mereka menyodorkan dalil dalil yang kamu tidak bisa membantahnya? Ataukah mereka mencela sebagian dari ajaran yang kamu bawa dengan celaan yang mempengaruhinya dan mengurangi nilainya yang akibatnya kamu menjadi sempit dada karenanya? apakah kamu bertanggung jawab atas hisab mereka dan dituntut untuk memberi petunjuk kepada mereka? ”sesungguhnya kamu hanyalah seorang pemberi peringatan, dan Allah pemelihara segala sesuatu” Dia-lah pemelihara mereka, yang menjaga amal mereka dan membalasnya dengan balasan yang sempurna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فلعلك) Fala’llaka : Pertanyaan dalam rangka mengingkari, yaitu tidak mungkin engkau akan meninggalkannya atau tidak pula dadamu terasa sempit. (ضائق به صدرك) Dhaaiqum bihii shadruk : Engkau enggan menyampaikannya (Al-Qur’an) karena engkau tidak ingin mendengar mereka berkata ini dan itu. (كنز) Kanzun : Harta yang banyak, sehingga engkau bisa menggunakannya untuk dirimu dan pengikutmu. (وكيل) Wakiil : Pengawas yang menjaga. Makna ayat : Ketika kaum musyrikin telah banyak meminta kepada Rasulullah, seperti; mengubah gunung-gunung menjadi emas, sebagian ide-ide bodoh mereka, “Mengapa tidak turun bersamanya malaikat memberi peringatan?” atau “Mengapa ia tidak diberi harta yang banyak atau ia memiliki kebun yang bisa ia makan isinya?” Kemudian Allah berfirman kepada Rasul-Nya (فلعلك تارك بعض ما يوحى إليك)” Maka boleh jadi kamu hendak meninggalkan sebahagian dari apa yang diwahyukan kepadamu” engkau tidak membacanya di hadapan orang-orang musyrikin, tidak pula menyampaikannya karena meremehkan dan berpaling darinya (و ضائق به صدرك) (hatimu menjadi sempit -pent) karena Al-Qur’an, engkau enggan berhadapan dengan mereka agar mereka tidak mengatakan (لولا أنزل عليه كنز) \"Mengapa tidak diturunkan kepadanya perbendaharaan (kekayaan)” harta yang melimpah, sehingga engkau bisa hidup dengannya, sebagai tanda bahwa Allah benar-benar mengutusnya. (أو جاء معه ملك) “atau datang bersama-sama dengan dia seorang malaikat?\" sama-sama berdakwah serta membenarkan dan bersaksi atasnya, maka tidak seharusnya engkau merasa sedih, tapi sampaikanlah dan jangan berkecil hati (إنما أنت نذير) “Sesungguhnya kamu hanyalah seorang pemberi peringatan” pemberi peringatan akibat buruk dari kesyirikan, kekufuran dan maksiat. Allah lah yang mengawasi dan menjaga atas segala sesuatu, tugasmu adalah pemberi peringatan. Pelajaran dari ayat : • Penjelasan akan penjagaan, bantuan dan pertolongan Allah untuk rasul-Nya. • Pembangkangan dan kesombongan kaum musyrikin terhadap kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 12: Di ayat ini, Allah Subhaanahu wa Ta'aala menghibur Nabi Muhammad shallallahu 'alaihi wa sallam karena didustakan. Dengan tidak menyampaikan kepada mereka karena mereka tidak peduli. Ketika membacakan ayat Al Qur’an kepada mereka karena mereka akan mengatakan seperti yang disebutkan dalam ayat di atas. Yang membenarkannya. Meninggalkan dakwah hanya karena akan dikatakan begini dan begitu tidaklah pantas bagimu. Tidak selayaknya perkataan mereka mengusik hatimu dan menghalangi apa yang selama ini engkau lakukan, yaitu dakwah. Sesungguhnya perkataan mereka muncul dari sikap keras, zalim, penentangan, kesesatan, dan kebodohannya terhadap hujjah dan dalil yang disampaikan. Oleh karena itu, tetaplah engkau berdakwah, dan janganlah perkataan yang lemah yang timbul dari orang yang kurang akal menghalangimu dan menyesakkan dadamu. Dalam ayat ini terdapat petunjuk, bahwa tidak patut bagi da’i yang mengajak manusia kepada Allah berhenti berdakwah hanya karena ada yang menghalangi atau ada yang mencela, khususnya apabila celaannya idak memiliki sandaran, tidak tertuju kepada dakwahnya, dan hendaknya ia tidak merasa sempit dada, bahkan tetap tenang, dan terus berdakwah. Kewajibanmu hanyalah menyampaikan; tidak mendatangkan apa yang mereka usulkan. Allah yang memelihara amal mereka dan akan memberi balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 12",
    "description": "Setelah pada ayat sebelumnya dijelaskan tentang macam-macam tabiat manusia, maka pada ayat ini Allah menjelaskan tentang salah satu tabiat buruk manusia yaitu sombong. Di antara kesombongan orang-orang kafir adalah mendustakan kerasulan nabi Muhammad dan kebenaran kitab suci Al-Qur'an. Diriwayatkan oleh ibnu 'abba's, bahwa pemuka kafir mekah berkata kepada nabi Muhammad, jika betul-betul engkau utusan Allah, jadikanlah bukit-bukit mekah itu emas untuk kami, sebagian lain ada yang berkata, datangkan kepada kami para malaikat yang menyaksikan kenabianmu. Kemudian Allah meneguhkan hati nabi Muhammad seraya berfirman, maka boleh jadi engkau wahai nabi Muhammad hendak meninggalkan berdakwah untuk menyampaikan sebagian dari apa yang diwahyukan kepadamu lantaran mereka mencemoohmu dan dadamu sempit, yakni sedih karenanya. Sehingga karena itu kamu takut mereka akan mengatakan, mengapa tidak diturunkan kepadanya harta kekayaan berupa emas permata, kebun, dan ternak yang dapat digunakan untuk menarik perhatian dalam berdakwah, atau datang bersamanya malaikat yang ikut menjelaskan wahyu yang diturunkan dan memperkuat kenabianmu' sungguh, janganlah engkau merasa pesimis dan khawatir, karena engkau hanyalah seorang pemberi peringatan dan Allah pemelihara segala sesuatu tentang urusan hamba-Nya, sehingga sedikit pun engkau wahai nabi Muhammad, tidak terpengaruh oleh ejekan mereka. Bahkan mereka mengatakan, dia (Muhammad) telah membuat-buat Al-Qur'an itu. Tuduhan mereka tidak beralasan, karena itu katakanlah wahai nabi, kalau demikian tuduhan kalian terhadap Al-Qur'an, maka datangkanlah sepuluh surah semisal dengannya yang dibuat-buat dengan susunan bahasa yang indah. Dan ajaklah siapa saja di antara kamu selain Allah yang sanggup merangkai kata dan menyusunnya menjadi kalimat seperti Al-Qur'an. Jika kamu mengaku bahwa dirimu adalah orangorang yang benar dan mampu, buktikanlah kebenaran ucapanmu itu. Sekalipun seluruh pujangga dan sastrawan dikerahkan untuk menyusun semisal Al-Qur'an, niscaya mereka tidak akan mampu melakukannya, karena Al-Qur'an bukanlah buatan manusia. (lihat: surah al-baqarah/2: 23; yunus/10: 38; al-isra'/17: 88; aaa'ur/52: 34)."
  }
]