[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami mengisahkan kepadamu (wahai nabi), dari berita-berita para rasul yang hidup sebelum masa mu, semua apa yang kamu butuhkan yang dapat meneguhkan hatimu untuk mengemban beban-beban tugas menyampaikan risalah. Dan sesungguhnya telah datang kepadamu dalam surat ini dan dalam berita-berita yang dikandungnya suatu penjelasan tentang kebenaran yang kamu pegangi. Dan telah datang padamu nasihat di dalamnya yang akan membuat kaum kafir menghentikan perbuatan mereka dan menjadi peringatan bagi orang-orang yang beriman kepada Allah dan RasulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Semua kabar yang Kami ceritakan kepadamu -wahai Rasul- tentang rasul-rasul sebelummu Kami maksudkan untuk meneguhkan dan menguatkan hatimu dalam memegang teguh kebenaran. Di dalam surah ini telah datang kepadamu kebenaran yang tidak diragukan sama sekali. Dan di dalam surah ini telah datang kepadamu nasihat bagi orang-orang kafir dan peringatan bagi orang-orang mukmin yang bisa mendapatkan manfaat dari peringatan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120. Dan semua yang ada dalam surat ini dan surat lainnya Kami ceritakan kepadamu, yaitu kisah-kisah para nabi dan keadaan mereka bersama kaum mereka masing-masing, sehingga Kami menambah keteguhanmu dengan banyaknya pelajaran, firman, dan kisah-kisah; dan agar kamu dapat meneladani para nabi dan menghibur hatimu dengan kedustaan dan keingkaran yang mereka dapatkan dari kaum mereka. Dan datang kepadamu kebenaran dalam surat ini secara jelas sebagai pelajaran dan peringatan yang dapat diambil manfaatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. مَا نُثَبِّتُ بِهِۦ فُؤَادَكَ ۚ (yang dengannya Kami teguhkan hatimu) Dengan bertambahnya keyakinan dan ketentraman. وَجَآءَكَ فِى هٰذِهِ(dan dalam surat ini telah datang kepadamu) Yakni datang kepadamu dalam surat ini bukti-bukti tegas yang menunjukkan kebenaran akan tempat awal dan tempat kembali. وَمَوْعِظَةٌ (serta pengajaran) Yang menjadi pelajaran bagi orang beriman yang mencermatinya. وَذِكْرَىٰ( dan peringatan) Yang menjadi peringatan bagi orang beriman yang memikirkannya. Allah mengkhususkan orang-orang beriman sebab mereka adalah orang-orang yang dapat mengambil pelajaran dan peringatan. Dalam surat ini terdapat kelebihan dalam hal pelajaran dan peringatan karena ia mengandung kisah-kisah para Nabi dengan umat mereka, kisah bagaimana mereka teguh dalam berdakwah mengajak umat mereka kepada Allah, kisah perdebatan diantara mereka, bagaimana para Nabi bersabar dalam menghadapi sikap buruk kaum mereka, dan rincian bagaimana Allah menyelamatkan para nabi dan orang-orang beriman serta bagaimana Allah membinasakan orang-orang zalim dan meninggalkan jejak kehidupan mereka sampai beberapa waktu. Hal-hal ini dapat menjadi meneguh hati Rasulullah dalam menjalankan dakwahnya, menjadi peringatan bagi orang-orang yang berada di jalan kebenaran tentang baiknya kesudahan mereka, dan kemenangan akan datang di kemudian hari."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara faidah mendengarkan kisah orang-orang shalih adalah : sebagai penguat dan penolong dalam mengikuti jejak-jejak yang mereka bawa. 2 ). Ketika kekuatan orang-orang bathil semakin membesar, dan racun-racun mereka semakin menyebar luas; sesungguhnya hati seorang mukmin (dalam keadaan seperti ini) harus tersentuh dan bergetar, dan ia senantiasa memilih jalan yang meneguhkan hatinya, yaitu dengan mempelajari berita-berita tentang para nabi dalam al-qur'an tatkala mereka berhadapan dengan kaum yang tersesat, Allah berfirman : { وَكُلًّا نَقُصُّ عَلَيْكَ مِنْ أَنْبَاءِ الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ } \"Dan semua kisah dari rasul-rasul Kami ceritakan kepadamu, ialah kisah-kisah yang dengannya Kami teguhkan hatimu\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120. Wahai Nabi, setiap berita tentang para rasul yang Kami sampaikan kepadamu itu untuk meneguhkan hatimu dalam menunaikn risalah dan menangguh fitnah. Dan telah datang dalam surah yang mengandung beberapa kisah nabi ini dan dalil-dalil keimanan itu tidak lain kecuali kebenaran yang teguh dari Tuhanmu, pelajaran dan pengingat bagi orang-orang mukmin, yaitu orang yang berbuat kebenaran dengan baik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap kisah rasul-rasul yang Kami ceritakan kepadamu itu adalah kisah-kisah untuk Kami teguhkan hatimu. Telah datang kepadamu dalam hal ini} dalam surah ini {kebenaran, nasihat, dan peringatan bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120 tatkala Allah menyebutkan di surat ini berita berita tentang para nabi, maka Dia menyebutkan hikmah dari itu semua seraya berfirman ”dan semua kisah dari rasul rasul kami ceritakan kepadamu (Muhammad) kisah kisah yang dengannya kami teguhkan hatimu” agar hatimu teguh, tenang dan bersabar sebagaimana kesabaran rasul rasul ulul azmi karena jiwa itu merasa tenang dengan meneladani dan menjadi giat untuk beramal, serta ingin menyaingi yang lain, dan kebenaran menjadi kuat dengan menyebutkan saksi saksinya dan banyaknya pendukung. ”dan dalam surat ini telah datang kepadamu kebenaran” yang yakin tanpa ada sedikitpun keraguan dari sisi manapun. ilmu tentang hal itu termasuk ilmu tentang kebenaran yang merupakan keutamaan jiwa yang paling besar ”serta pengajaran dan peringatan bagi orang orang yang beriman” maksudnya, mereka mengambil pelajaran darinya, maka mereka menahan diri dari perkara perkara yang buruk dan mengingat perkara yang dicintai Allah lalu mereka melakukannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَكُلّٗا نَّقُصُّ) wa kullan naqushshu : segala sesuatu yang engkau butuhkan berupa kisah para Rasul yang telah Kami bacakan kepada mu, agar menguatkan hatimu. (مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ) maa nutsabbitu bihii fuaadak : kisah yang telah Kami sampaikan agar menguatkan hatimu dalam berdakwah dan menyampaikan risalah. (وَجَآءَكَ فِي هَٰذِهِ ٱلۡحَقُّ) wa jaa’aka fii hadzil haqq : apa yang ada di dalam surat ini adalah kebenaran yang datang dari Allah ta’ala, seperti yang telah turun selain surat ini. (وَمَوۡعِظَةٞ وَذِكۡرَىٰ) wa mau’izhatuw wa dzikraa : dan ada padanya pelajaran dan peringatan untuk kaum mukminin, karena mereka akan mendapatkan manfaat darinya. Makna ayat : Ketika Allah menceritakan kepada Rasul-Nya shalallhu ‘alaihi wa sallam kisah-kisah para Nabi dan Rasul bersama dengan umat-umat mereka, serta apa saja yang mereka hadapi dari kaum mereka berupa pendustaan, pembangkangan, serta permusuhan, dan bagaimana Para Rasul bersabar hingga datangnya pertolongan Allah. Allah berfirman : (وَكُلّٗا نَّقُصُّ عَلَيۡكَ مِنۡ أَنۢبَآءِ ٱلرُّسُلِ مَا نُثَبِّتُ بِهِۦ فُؤَادَكَۚ) Kami mengkisahkan kepada mu, segala yang engkau butuhkan untuk mendukung kondisimu serta memperkuat tekadmu (أَنۢبَآءِ ٱلرُّسُلِ) berupa kabar-kabar Para Rasul bersama dengan umat mereka merupakan hal yang dapat memperkuat hatimu, sehingga engkau bisa melanjutkan dakwahmu dan penyampaian risalah. Firman-Nya : (وَجَآءَكَ فِي هَٰذِهِ) di dalam surat ini, (ٱلۡحَقُّ) berupa kabar-kabar yang ada pada surat lainnya (وَمَوۡعِظَةٞ) engkau dan selainmu mengambil pelajaran darinya, (وَذِكۡرَىٰ) dengannya kaum mukminin menjadi ingat dan kuat di atas kebenaran serta bersabar dalam melaksanakan ketaatan dan cobaan, oleh karena itu janganlah mengeluh dan merasa bosan. Pelajaran dari ayat : • Faidah-faidah dari kisah-kisah Qur’ani, diantaranya: o Menguatkan hati Rasulullah salallahu ‘alaihi wa sallam o Adanya pelajaran dan nasihat untuk kaum mukminin. o Bukti kenabian Rasulullah shalallahu ‘alaihi wa sallam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 120: Setelah disebutkan dalam surat ini berita para nabi, maka disebutkan hikmahnya seperti yang tersebut di atas. Yang perlu diceritakan. Agar hatimu tenang, dapat teguh dan bisa bersabar sebagaimana para rasul ulul ‘azmi dapat bersabar. Hal itu, karena jiwa akan mengikuti, semangat beramal, berlomba dengan yang lain, dan kebenaran semakin kuat ketika disebutkan saksi-saksinya dan banyaknya orang yang melakukan. Sehingga mereka menjauhi perbuatan-perbuatan yang dibenci Allah dan melakukan perbuatan-perbuatan yang dicintai-Nya. Karena merekalah yang dapat mengambil manfaat darinya, berbeda dengan orang-orang kafir, berbagai nasihat dan peringatan tidaklah beranfaat bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 120",
    "description": "Setelah dijelaskan tentang tujuan diutusnya para rasul, pada ayat ini dijelaskan kembali manfaat dari kisah-kisah yang dipaparkan bagi umat sesudahnya. Dan semua kisah rasul-rasul yang kami ceritakan kepadamu wahai nabi Muhammad agar dengan kisah itu kami teguhkan hatimu dalam menghadapi rintangan, dan tegar dalam melaksanakan tugas-tugas berat yang dibebankan kepadamu; dan di dalamnya telah diberikan kepadamu segala sesuatu tentang kebenaran, nasihat yang membimbingmu menuju kebaikan, dan peringatan bagi orang yang beriman agar bisa memetik manfaatnya dan berpengaruh dalam dirinya. Dan katakanlah wahai nabi Muhammad kepada orang yang tidak beriman, berbuatlah menurut kemampuan dan cara yang kamu tempuh sesuai dengan kedudukanmu; sesungguhnya kami pun benar-benar akan berbuat pula menurut cara dan kemampuan kami, sesuai yang diajarkan Allah."
  }
]