[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah (wahai Rasul), kepada orang-orang kafir yang tidak mengakui keesaan Allah, “Berbuatlah kalian apa yang kalian perbuat sesuai dengan keadaan dan keyakinan kalian untuk melawan dakwah dan melancarkan gangguan kepada rasul dan orang-orang yang menyambut dakwahnya, karena sesungguhnya kamipun berbuat sesuai dengan martabat dan keyakinan kami dengan tetap teguh di atas agama kami dan melaksanakn perintah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Katakanlah -wahai Rasul- kepada orang-orang yang tidak beriman kepada Allah dan tidak mau mengesakan-Nya, \"Berbuatlah menurut keyakinan kalian dalam menolak kebenaran dan menghalang-halangi manusia dari kebenaran. Sesungguhnya kami pun berbuat menurut keyakinan kami dalam memegang teguh, mendakwahkan dan mempertahankan kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121. Allah memerintahkan Nabi Muhammad untuk mengamcam orang-orang musyrik: Hai Muhammad, katakanlah kepada orang-orang yang tidak juga beriman dan sadar, ‘tetap dalam kesesatan kalian, karena kami akan tetap dalam keimanan dan kebaikan kami; dan tunggulah ketetapan Allah terhadap kalian, karena kami juga menunggu keputusan Allah antara kami dengan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. وَقُل لِّلَّذِينَ لَا يُؤْمِنُونَ (Dan katakanlah kepada orang-orang yang tidak beriman) Yang tidak beriman kepada kebenaran ini serta tidak mengambil pelajaran dan peringatan. اعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ (Berbuatlah menurut kemampuanmu) Sesuai kesanggupan, keadaan, dan cara kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121. Wahai Nabi, katakanlah kepada orang-orang yang tidak mengimani kebenaran dan risalah keselamatan ini: “Kerjakanlah apa yang bisa kalian lakukan sesuai dengan cara kalian, yaitu keburukan. Sesungguhnya kami juga mengerjakan sesuatu sesuai cara kami menuju kebaikan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah kepada orang-orang yang tidak beriman,“Berbuatlah sesuai kemampuan kalian. Sesungguhnya Kami benar-benar akan berbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121 Adapun orang yang bukan termasuk ahli iman, maka nasihat dan peringatan yang bermacam macam tidaklah berguna bagi mereka. oleh karena itu, Allah berfirman ”dan katakanlah kepada orang orang yang tidak beriman” setelah ayat ayat tegak atas mereka, ”berbuatlah menurut kedudukanmu” yakni keadaanmu dimana kamu berada diatasnya. ”sesungguhnya kamipun berbuat (pula)” diatas apa yang kami yakini."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (وَقُل لِّلَّذِينَ لَا يُؤۡمِنُونَ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنَّا عَٰمِلُونَ ١٢١ وَٱنتَظِرُوٓاْ إِنَّا مُنتَظِرُونَ ١٢٢) Dan katakanlah wahai Rasul Kami! Kepada orang-orang yang tidak beriman dari kaum mu yang mereka terus menerus mendustakanmu dan tenggelam di dalam kesyirikan dan maksiat: “Beramallah sesuka kalian, karena kami juga beramal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": ""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 121: Setelah ayat-ayat disampaikan kepada mereka. Dalam kata-kata ini terdapat ancaman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 121",
    "description": "Dan katakanlah wahai nabi Muhammad kepada orang yang tidak beriman, berbuatlah menurut kemampuan dan cara yang kamu tempuh sesuai dengan kedudukanmu; sesungguhnya kami pun benar-benar akan berbuat pula menurut cara dan kemampuan kami, sesuai yang diajarkan Allah. Dan tunggulah sanksi yang akan dijatuhkan Allah kepadamu, akibat perbuatan yang kamu lakukan, sesungguhnya kami, yakni nabi dan orang-orang beriman pun termasuk yang menunggu imbalan dari Allah berupa kebahagiaan atau kesuksesan yang akan diberikan kepada kami."
  }
]