[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan tunggulah oleh kalian balasan urusan kami, karena sesungguhnya kamipun menunggu balasan urusan kalian. Dalam ayat ini ada tantangan dan ancaman bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. Dan tunggulah apa yang akan kami terima. Karena sesungguhnya kamipun menunggu apa yang akan kalian terima.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122-123. Hanya Allah yang mengetahui langit dan bumi, segala urusan hamba-hamba-Nya tidak ada yang tersembunyi dari-Nya, hanya kepada-Nya kembali segala urusan di dunia dan di akhirat. Maka sembahlah Dia sebenar-benarnya, dan bertawakkallah kepada-Nya dengan sesungguhnya. Tuhanmu tidak lalai dari segala perbuatan hamba-hamba-Nya, Dia Maha Melihat dan Menghisab amalan-amalan itu, kemudian Dia akan membalasnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. وَانتَظِرُوٓا۟ إِنَّا مُنتَظِرُونَ (Dan tunggulah (akibat perbuatanmu); sesungguhnya kamipun menunggu) Lihatlah kesudahan dari urusan kami, karena kami juga menunggu kesudahan urusan kalian dan azab yang akan Allah timpakan kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122. Tunggulah akibat dari kekufuran dan kebohongan kalian. Sesungguhnya kami menungu terjadinya akibat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan tunggulah. Sesungguhnya kami adalah orang-orang yang menunggu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122 “dan tunggulah (akibat perbuatanmu)” apa yang akan menimpamu. ”sesungguhnya kami pun menunggu (pula)” apa yang akan menimpamu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Dan tunggulah siapa di antara kita yang akan menjadi pemenang dan siapa yang akan kalah di akhir nanti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 122",
    "description": "Dan tunggulah sanksi yang akan dijatuhkan Allah kepadamu, akibat perbuatan yang kamu lakukan, sesungguhnya kami, yakni nabi dan orang-orang beriman pun termasuk yang menunggu imbalan dari Allah berupa kebahagiaan atau kesuksesan yang akan diberikan kepada kami. Dan hanya milik Allah-lah segala rahasia langit dan bumi dan kepadanya segala urusan dikembalikan pada hari kiamat, masing-masing orang akan mendapat imbalan atas perbuatannya. Maka sembahlah dia dan bertawakAllah kepada-Nya, karena dialah yang memenuhi kebutuhan kamu. Dan tuhanmu tidak akan lengah terhadap perbuatan apa saja yang kamu kerjakan, baik perbuatan jahat atau amal saleh, semua diketahui Allah dan semua amal akan dihitung."
  }
]