[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah memiliki pengetahuan setiap apa yang ghaib yang ada di langit dan di bumi. Dan hanya kepadaNyalah seluruh urusan kembali pada hari kiamat, maka beribadahlah kepadaNya (wahai nabi). Dan serahkanlah urusanmu kepadaNya. Dan tidaklah tuhanmu lalai dari apa yang kalian kerjakan, entah perbuatan baik maupun buruk, dan Dia akan memberikan balasan bagi masing-masing orang sesuai dengan perbuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Hanya Allah-lah satu-satunya yang mengetahui perkara-perkara yang gaib di langit dan di bumi. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya. Dan hanya kepada-Nya lah semua urusan akan dikembalikan di Hari Kiamat. Maka beribadahlah -wahai Rasul- hanya kepada Allah semata dan berserah dirilah kepada-Nya dalam semua urusanmu. Tuhanmu tidak pernah lalai terhadap apa yang kalian perbuat. Dia Maha Mengetahuinya dan akan memberikan balasan sesuai dengan amal perbuatannya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. وَلِلّٰهِ غَيْبُ السَّمٰوٰتِ وَالْأَرْضِ (Dan kepunyaan Allah-lah apa yang ghaib di langit dan di bumi) Yakni Allah mengetahui segala yang tidak diketahui hamba-hamba-Nya di langit dan di bumi, tidak ada yang mengetahui selain-Nya. وَإِلَيْهِ يُرْجَعُ الْأَمْرُ كُلُّهُۥ (dan kepada-Nya-lah dikembalikan urusan-urusan semuanya) Yakni di hari kiamat agar Allah dapat membalas semua makhluk sesuai dengan amalan mereka. فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ ۚ (maka sembahlah Dia, dan bertawakkallah kepada-Nya) Karena Allah cukup bagimu atas segala yang kamu benci, dan yang akan memberimu segala yang kamu inginkan. وَمَا رَبُّكَ بِغٰفِلٍ عَمَّا تَعْمَلُونَ (Dan sekali-kali Tuhanmu tidak lalai dari apa yang kamu kerjakan) Tapi Dia mengetahui segalanya dan akan membalas segala perbuatan, membalas perbuatan baik dengan kebaikan dan perbuatan buruk dengan keburukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Setiap orang membutuhkanmu untuk keperluan dirinya.. mulia dari keluarga, anak, teman, dan pembantu, namun tidak ada yang akan membersamaimu selamanya diatas kebenaran kecuali kasih sayang sang pencipta, jika kamu diterlantarkan atau disiksa atas kesalahanmu tidak ada yang tinggal bersamamu selamanya agar kamu meminta bantuan kepadanya, dan di situlah kebinasaan akan menjemputmu, namun ketika kelembutan dan kasih sayang dzat yang menciptakanmu senantiasa membersamaimu maka sebanyak apapun orang yang meninggalkanmu tidak akan berdampak buruk bagimu, oleh karena itu jangan sekali-kali kamu berpaling kepada selain dari-Nya, dan jangan pula kamu memohon pertolongan kepada selain-Nya"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123. Hanya milik Allahlah pengetahuan tentang seluruh hal yang ghaib bagi manusia di langit dan bumi. Dan hanya kepadaNyalah tempat kembalinya segala urusan di hari kiamat. Lalu Dia akan membalas masing-masing orang sesuai amalnya. Maka menyembahlah hanya kepada Tuhanmu dengan orang-orang mukmin yang bersamamu. Dan serahanlah segala urusanmu kepada Allah. Cukuplah dia yang kau butuhkan. Tidak ada amal kalian yang luput dari Allah, baik amal baik atau buruk. Dia mengetahuinya dan akan membalasnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Milik Allahlah yang ghaib di langit dan di bumi. KepadaNyalah segala urusan dikembalikan. Maka sembahlah Dia dan bertawakallah kepadaNya. Tuhanmu tidak akan lengah terhadap apa yang kalian kerjakan}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123 Allah telah membedakan kedua kelompok tersebut, Dia menunjukan pertolonganNya kepada hamba hambaNya yang beriman dan hukumanNya kepada musuh musuhNya yang mendustakan. ”dan kepunyaan Allah lah apa yang ghaib di langit dan di bumi” yakni perkara perkara yang ghaib dan perkara perkara yang samar pada keduanya. ”dan kepadaNya lah dikembalikan urusan urusan semuanya” dari amal perbuatan dan pelakunya sehingga dibedakanlah antara yang baik dan yang buruk. ”maka sembahlah Dia, dan bertawakallah kepadaNya” yakni lakukanlah ibadah kepadaNya yaitu seluruh apa yang Allah perintahkan yang kamu mampu untuk melakukannya. ”dan bertawakallah kepadaNya” dalam hal itu. ”dan sekali kali Rabbmu tidak lalai dari apa yang kamu kerjakan” berupa kebaikan dan keburukan. IlmuNya meliputi semua itu, penaNya telah mencatatnya, hikmah dan balasanNya akan berlaku atas itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) wa lillahi ghaibus samaawaati wal ardhi : hal-hal yang gaib di dalam keduanya (langit dan bumi), hanya Allah yang mengetahui, tidak ada selain-Nya yang mengetahui. (فَٱعۡبُدۡهُ) fa’bud hu : Esakan Dia dalam beribadah, jangan lah engkau sekutukan-Nya dengan apa pun. (وَتَوَكَّلۡ عَلَيۡهِۚ) wa tawakkal ‘alaihi : serahkanlah seluruh urusanmu kepada-Nya, serta yakinlah kepada-Nya, karena Dia yang mencukupimu. Makna ayat : Firman-Nya : (وَلِلَّهِ غَيۡبُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ) hanya Dia lah yang mengetahui kapan datangnya kemenangan itu, dan kapan pula mereka kalah. (َإِلَيۡهِ يُرۡجَعُ ٱلۡأَمۡرُ كُلُّهُۥ) kemenangan dan kekalahan kembali kepada-Nya, sebagaimana perkara hidayah, kesesatan, kebahagiaan, dan kesengsaraan. Hanya kepada-Nya lah kalian beribadah—wahai Rasulullah—serta serahkan urusanmu kepada-Nya. Dialah yang akan mencukupi semua kebutuhanmu di dunia dan di akhirat, (وَمَا رَبُّكَ بِغَٰفِلٍ عَمَّا تَعۡمَلُونَ) “Dan sekali-kali Tuhanmu tidak lalai dari apa yang kamu kerjakan” Wahai sekalian manusia! Dan Dia akan membalas setiap amalan baik itu kebajikan atau keburukan. (وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ ) Dialah Allah yang Maha mampu atas segala sesuatu. Pelajaran dari ayat : • Ilmu gaib hanya milik Allah, tidak ada yang mengetahui selain-Nya. • Seluruh perkara kembali kepada Allah. • Wajibnya beribadah kepada Allah dan bertawakkal kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 123: Allah mengetahui yang ghaib pada keduanya. Baik perbuatan maupun pelakunya, lalu Dia memisahkan yang baik dan yang buruk. Yakni kerjakanlah ibadah, yakni semua yang diperintahkan Allah yang mampu kamu lakukan, serta bertawakkallah kepada-Nya dalam hal itu. Karena Dia akan mencukupkanmu. Dia hanya menangguhkan mereka sampai waktunya tiba. Selesai tafsir surat Hud, wal hamdulillahi rabbil ‘alamin, wa shallallahu ‘alaa Muhammad wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 123",
    "description": "Dan hanya milik Allah-lah segala rahasia langit dan bumi dan kepadanya segala urusan dikembalikan pada hari kiamat, masing-masing orang akan mendapat imbalan atas perbuatannya. Maka sembahlah dia dan bertawakAllah kepada-Nya, karena dialah yang memenuhi kebutuhan kamu. Dan tuhanmu tidak akan lengah terhadap perbuatan apa saja yang kamu kerjakan, baik perbuatan jahat atau amal saleh, semua diketahui Allah dan semua amal akan dihitung. Alif laam raa'. Huruf-huruf hija'iyyah yang menjadi pembuka surah pada ayat ini dan surah lainya diungkap Allah untuk menggugah dan menarik perhatian kepada lawan bicara, agar mereka memperhatikan pesan-pesan yang akan disampaikan Allah. Huruf ini adalah huruf-huruf yang merangkai ayat-ayat Al-Qur'an hingga menjadi susunan ayat yang indah dan istimewa. Ayat-ayat berikut yang terdapat dalam surah ini adalah sebagian dari ayat-ayat yang terdapat dalam kitab suci Al-Qur'an yang jelas dan nyata bahwa ayat-ayat tersebut adalah wahyu dari Allah."
  }
]