[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah orang-orang musyrik dari penduduk negeri Makkah akan mengatakan, ”sesungguhnya Muhammadlah yang telah mengada-adakan al-qur’an ini?” katakanlah kepada mereka, ”jika memang urusan ini seperti yang kalian duga-duga, maka datangkanlah sepuluh surat serupa yang dibuat-buat sendiri, dan panggillah siapa saja yang kalian bisa dari seluruh makhluk Allah yang dapat membantu kalian untuk mendatangkan sepuluh surat tersebut, jika kalian orang-orang yang benar dalam klaim kalian, ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Bahkan orang-orang musyrik berkata, \"Al-Qur`ān itu dibuat sendiri oleh Muhammad, bukan wahyu dari Allah.\" Katakanlah -wahai Rasul- untuk menantang mereka, \"Kalau begitu, datangkanlah sepuluh surah yang setara dengannya dengan cara membuatnya sendiri, di mana kalian tidak terikat dengan kebenaran semacam Al-Qur`ān yang kalian anggap buatan manusia. Dan panggillah orang-orang yang bisa kamu panggil untuk membantu kalian, jika kalian adalah orang-orang yang benar terkait tuduhan kalian bahwa Al-Qur`ān adalah buatan manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Orang-orang musyrik menyebar kedustaan bahwa al-Qur’an ditulis sendiri oleh Muhammad dan menganggapnya dari Tuhannya. Katakanlah kepada mereka: “Jika memang begitu, maka datangkanlah sepuluh surat semisalnya, dan mintalah bantuan dari makhluk yang kalian inginkan dan dari berhala-berhala yang kalian bela, jika anggapan kalian itu memang benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. أَمْ يَقُولُونَ افْتَرَىٰهُ ۖ (Bahkan mereka mengatakan: “Muhammad telah membuat-buat Al Quran itu”) Yakni Muhammad membuat-buat al-Qur’an sendiri untuk membohongi manusia. قُلْ فَأْتُوا۟ بِعَشْرِ سُوَرٍ مِّثْلِهِۦ(Katakanlah: “(Kalau demikian), maka datangkanlah sepuluh surat-surat yang menyamainya) Dalam kefasihan dan keindahannya, keringkasan kalimatnya dan keluasan maknanya. مُفْتَرَيٰتٍ(yang dibuat-buat) Yakni jika aku ini membuat-buat al-Qur’an, maka sebenarnya aku ini dari kaum kalian, oleh sebab itu cobalah kalian datangkan kepadaku dan buatlah meski lebih sedikit dari apa yang aku buat-buat ini. وَادْعُوا۟( dan panggillah) Untuk membantu kalian dalam membuat tandingan berupa sepuluh surat. مَنِ اسْتَطَعْتُم(orang-orang yang kamu sanggup) Yang kalian sanggup untuk memanggilnya, dan memohon bantuan darinya; baik itu dari golongan manusia maupun dari sesembahan yang kalian jadikan sekutu bagi Allah. إِن كُنتُمْ صٰدِقِينَ (jika kamu memang orang-orang yang benar) Dalam anggapan kalian bahwa aku membuat-buat al-Qur’an. Karena seandainya hal ini sebagai mana yang kalian anggap niscaya kalian juga dapat mendatangkan yang semisalnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Bahkan mereka orang-orang musyrik mengatakan: “Apakah Muhammad telah membuat-buat Al Quran itu”, Katakanlah wahai Nabi: “Kalau demikian, maka buatkanlah sepuluh surat yang dapat menyamainya, baik dari segi balaghah maupun hasan, melihat bahwa kalian adalah orang-orang Arab yang fasih dan ahli menjelaskan. Mintalah bantuan kepada siapapun yang telah kalian jadikan sekutu Allah, bukan meminta tolong kepada Allah, jika kamu memang orang-orang yang benar”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka berkata,“Dia telah membuat-buat itu”} membuat-buat itu {Katakanlah,“Datangkanlah sepuluh surah yang serupa dengannya, yang dibuat-buat} yang dibuat-buat oleh diri kalian{dan ajaklah siapa saja yang sanggup kalian (ajak) selain Allah, jika kalian adalah orang-orang yang benar.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. “bahkan mereka mengatakan ‘Muhammad telah membat buat al qur’an itu” maksudnya, Muhammad adalah pembuat alqur’an, maka Allah menjawab mereka dengan “katakanlah” kepada mereka ”kalau demikian maka datangkanlah sepuluh surat-surat yang dibuat-buat yang menyamainya, dan panggillah orang orang yang kamu sanggup (memanggilnya) selain Allah, jika kamu memang orang orang yang benar” maksudnya, kalau memang Muhammad telah membuatnya lalu karena dalam urusan kefasihan dan balghah tiada beda antara kalian dengan dia, sementara kalian adalah benar benar musuh, yang berusaha dengan segala upaya yang menginkanmu untuk membatalkan dakwahnya, jika kalian benar maka datangkanlah sepuluh surat yang sepertinya, hasil dari kreasimu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (افتراه) Iftaraahu : Merekayasa dan berbohong. Makna ayat : Firman-Nya (أم يقولون افتراه) Bahkan mereka berkata, “Itu adalah karangannya; Al-Qur’an, yang ia buat sendiri bukan berdasarkan wahyu.” Oleh karena itu katakanlah, (فأتوا بعشر سور مثله مفتريات و ادعوا من استطعتم) “Buatlah 10 surat yang sama, dan panggillah bantuan semampu kalian (إن كنتم صادقين) kalau kalian tuduhkan itu benar, aku yang mengarangnya. Namun jika kalian tidak mampu –dan kalian tidak akan pernah bisa—, maka bertaubatlah dan berserah diri kepada Rabb kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 13: Dalam hal kefasehan dan ketinggian sastra. Karena kalian adalah orang-orang Arab yang faseh dalam berbahasa. Allah Subhaanahu wa Ta'aala pertama menantang mereka agar mereka mendatangkan sepuluh surat yang sama dengan Al Qur’an, ternyata mereka tidak mampu. Kemudian Dia menantang mereka agar mendatangkan satu surat saja, dan ternyata mereka tidak mampu juga. Untuk membantu pekerjaan itu. Bahwa Al Qur’an dibuat oleh Muhammad. Dalam ayat ini terdapat dalil, bahwa Al Qur’an adalah mukjizat itu sendiri, oleh karenanya tidak ada satu pun manusia yang mampu mendatangkan yang semisalnya, tidak pula sepuluh surat, bahkan satu surat. Allah menantang orang-orang Arab yang ahli bahasa untuk mendatangkan satu surat saja, ternyata mereka tidak berani, karena mereka mengetahui bahwa mereka tidak memiliki kemampuan untuknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 13",
    "description": "Bahkan mereka mengatakan, dia (Muhammad) telah membuat-buat Al-Qur'an itu. Tuduhan mereka tidak beralasan, karena itu katakanlah wahai nabi, kalau demikian tuduhan kalian terhadap Al-Qur'an, maka datangkanlah sepuluh surah semisal dengannya yang dibuat-buat dengan susunan bahasa yang indah. Dan ajaklah siapa saja di antara kamu selain Allah yang sanggup merangkai kata dan menyusunnya menjadi kalimat seperti Al-Qur'an. Jika kamu mengaku bahwa dirimu adalah orangorang yang benar dan mampu, buktikanlah kebenaran ucapanmu itu. Sekalipun seluruh pujangga dan sastrawan dikerahkan untuk menyusun semisal Al-Qur'an, niscaya mereka tidak akan mampu melakukannya, karena Al-Qur'an bukanlah buatan manusia. (lihat: surah al-baqarah/2: 23; yunus/10: 38; al-isra'/17: 88; aaa'ur/52: 34). Setelah mereka ditantang untuk membuat semisal Al-Qur'an, kemudian Allah berfirman, maka jika mereka tidak memenuhi tantanganmu membuat semisal Al-Qur'an, padahal mereka adalah ahli bahasa dan sastrawan ulung, maka katakanlah kepada mereka, ketahuilah, bahwa Al-Qur'an itu diturunkan dengan ilmu Allah yang luas meliputi segala sesuatu, dan percayalah bahwa tidak ada tuhan yang wajib disembah selain dia, sebab hanya Allah yang mengetahui segala sesuatu dengan ilmunya, tidak mempunyai tandingan, dan sekutu dalam kekuasaannya. Oleh karena itu, maka maukah kamu berserah diri masuk islam dengan meyakini dan memercayai kekuasaan Allah, tuhan semesta alam' sekalipun bukti-bukti kebenaran Al-Qur'an sudah jelas, namun orang-orang kafir tetap tidak memercayai dan mengakui kebenaran isi kandungan Al-Qur'an. Penyebab mereka ingkar adalah karena kesombongan mereka. Sifat takabur dan sombong mendorong seseorang mengingkari kebenaran walaupun bukti sudah jelas. (lihat: surah annaml/27: 14)."
  }
]