[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jika orang-orang musyrik tidak memenuhi permintaan kalian (wahai rasul), dan orang-orang yang beriman bersamamu, terhadap tuntutan kalian kepada mereka, karena ketidakmampuan mereka semua untuk itu, maka ketahuilah, bahwa sesungguhnya al-qur’an ini hanya Allah lah yang menurunkannya kepada RasaulNya dengan ilmuNya, dan bukan dari perkataan manusia, dan ketahuilah, bahwa tidak ada sesembahan yang berhak diibadahi kecuali Allah. Apakah kalian (setelah tegaknya hujjah ini di hadapan kalian), mau berserah diri dan tunduk kepada Allah dan rasulNya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Jika mereka tidak bisa membuat apa yang kalian minta dari mereka karena ketidakmampuan mereka, maka ketahuilah -wahai orang-orang mukmin- dengan pengetahuan yang meyakinkan bahwa Al-Qur`ān ini Allah turunkan kepada Rasul-Nya dengan sepengetahuan-Nya, bukan dibuat oleh manusia. Dan ketahuilah bahwasanya tidak ada tuhan yang berhak disembah selain Allah. Apakah kalian berserah diri dan tunduk kepada Allah setelah mengetahui hujah-hujah yang tidak terbantahkan ini?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Jika kalian tidak mampu mendatangkannya, dan berhala-berhala kalian tidak dapat mengabulkannya, maka ketahuilah bahwa kitab ini diturunkan dari Allah, tidak ada Tuhan selain Dia. Apakah setelah bukti ini, kalian taat kepada agama ini dan berserah diri kepada Tuhan semesta alam?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. فَإِلَّمْ يَسْتَجِيبُوا۟ لَكُمْ (Jika mereka yang kamu seru itu tidak menerima seruanmu) Yakni jika mereka tidak dapat melakukan apa yang kamu minta dari mereka. فَاعْلَمُوٓا۟( maka ketahuilah) Ketahuilah Wahai orang-orang yang beriman dengan penuh keyakinan. أَنَّمَآ أُنزِلَ بِعِلْمِ اللهِ(sesungguhnya Al Quran itu diturunkan dengan ilmu Allah) Yakni ilmu Allah yang hanya Dia yang memilikinya, yang tidak dapat dijangkau oleh akal manusia, karena al-Qur’an mengandung mukjizat yang berada di luar kemampuan manusia. وَأَن لَّآ إِلٰهَ إِلَّا هُوَ ۖ( dan bahwasanya tidak ada Tuhan selain Dia) Yang Maha Esa dalam sifat ketuhanan, Yang Mampu melakukan apa yang tidak dapat dilakukan selain-Nya. فَهَلْ أَنتُم مُّسْلِمُونَ(maka maukah kamu berserah diri (kepada Allah)?) Yakni, maka berpegang teguhlah kalian diatas agama Islam dengan penuh keikhlasan kepada Allah, karena kalian telah mendapatkan kepercayaan yang lebih setelah menyaksikan kelemahan orang-orang kafir untuk mendatangkan sepuluh surat yang semisal al-Qur’an, dan kalian juga telah mendapatkan petunjuk yang lebih meskipun sebelumnya kalian telah beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Jika mereka yang kamu mintai pertolongan itu tidak menerima permintaanmu itu maka ketahuilah dengan penuh keyakinan wahai manusia sebagai persaksian baik dari orang musyrik atau mukmin bahwa Alquran adalah wahyu yang turun dari Allah kepada rasul-Nya dengan ilmu Allah. Tidak ada Yang mengetahui ilmu itu kecuali Allah. Tidak ada Yang kuasa selain Dia. Juga ketahuilah bahwasanya tidak ada Tuhan Yang berhak disembah selain Dia, maka maukah kamu beriman kepada Allah dan Al-Qur'an jika kamu bukan termasuk orang muslim setelah tampak jelas hujjah bahwa Al-Qur'an itu dari sisi Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka tidak memenuhi ajakan kalian} jika mereka tidak datang karena menentang apa yang kalian serukan kepada mereka {“Ketahuilah sesungguhnya itu diturunkan dengan ilmu Allah dan tidak ada tuhan kecuali Dia. Apakah kalian mau berserah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. “jika mereka yang kamu seru itu tidak menerima seruanmu (ajakanmu) itu” sedikitpun “maka (katakanlah olehmu) ketahuilah sesungguhnya al quran itu diturunkan dengan ilmu Allah“ dari sisi Allah untuk menegakan dalil dan tuntutan dan menghilangkan penghalang. ”dan bahwasannya tidak ada tuhan (yang berhak disembah) kecuali Dia” maksudnya ketahuilah bahwa tiada tuhan yang haq kecuali Dia, yakni hanya Dia semata yang berhak dituhankan dan diibadahi “maka maukah kamu berserah diri (kepada Allah)?” tunduk kepada uluhiyahNya dan pasrah kepada ubudiyahNya. Ayat ayat ini mengandung petunjuk bahwa tidak seharusnya seorang da’I kepada Allah terhalangi oleh sanggahan orang orang yang menyanggah dan celaan orang orang yang mencela, lebih lebih jika celaannya tidak berdasar dan tidak mengarah kepada apa yang dia dakwahkan. Hendaknya dia tidak bersempit dada, justru dia mesti tetap tenang, maju terus dalam urusannya dan memperhatikan perkaranya. Dia tidak harus menjawab sanggahan mereka yang berpijak kepada dalil dail yang mereka pilih. Cukup baginya menegakkan dalil yang benar yang bebas dari sanggahan atas segala persoalan dan tuntutan. Ayat ini menunjukan bahwa al qur’an adalah mukjizat dengan sendirinya tak satupun manusia yang mampu menghadirkan yang sepertinya, tidak pula dengan sepuluh surat sepertinya bahkan tidak pula dengan satu surat sepertinya, karena para musuh yang fasih dan ahli ilmu balaghah telah ditantang oleh Allah untuk membuat ayat dan mereka tidak menyangkalnya karena mereka mengetahui bahwa mereka tidak memiliki kemampuan untuk itu. Ayat ini menunjukan bahwa perkara yang padanya dituntut keyakinan (ilm al yaqin) dan tidak cukup dengan dugaan semata adalah ilmu al quran dan ilmu tauhid berdasarkan FirmanNya “maka katakanlah olehmu ketahuilah sesungguhnya al qur’an itu diturunkan dengan ilmu Allah dan bahwasannya tidak ada tuhan (yang berhak disembah) kecuali Dia”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فهل أنتم مسلمون) Fa hal antum muslimuun : Menyerahkan diri kepada Allah, dengan taat dan tunduk kepada perintah-Nya. Makna ayat : Firman-Nya (فإن لم يستجيبوا لكم) Lalu katakanlah kepada mereka wahai utusan Kami, “Sekiranya mereka tidak bisa membantu kalian, dan kalian tidak mampu (فاعلموا أنما أنزل بعلم الله) ketahuilah bahwa Al-Qur’an dipenuhi dengan ilmu Allah, sebagai bukti yang kuat bahwa Al-Qur’an benar-benar turun dari sisi-Nya dan wahyu-Nya (وأن لا إله إلا هو) dan tidak ada sesembahan yang berhak diibadahi kecuali Allah, (فهل أنتم مسلمون) masuklah kalian kedalam Islam setelah jelasnya hujjah serta kelemahan kalian, dan itu yang terbaik bagi kalian. Pelajaran dari ayat : • Bahwa Rasulullah tidak dibebankan agar manusia seluruhnya mendapat hidayah, namun sebagai pemberi peringatan tentang efek buruk dari kekufuran dan maksiat mereka, kemudian Allah akan membalas semuanya. • Tantangan Allah kepada para pendusta nubuwwah dan tauhid, dengan membuat 10 surat yang setara dengan Al-Qur’an tapi mereka tidak mampu, dan tegaklah hujjah atas mereka. Dan Al-Qur’an adalah Kalam Allah yang hakiki dan wahyu-Nya, Muhammad adalah hamba dan utusan-Nya dan tidak ada tuhan yang berhak disembah kecuali Dia (Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 14: Yakni wahai orang-orang musyrik. Setelah nyata buktinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 14",
    "description": "Setelah mereka ditantang untuk membuat semisal Al-Qur'an, kemudian Allah berfirman, maka jika mereka tidak memenuhi tantanganmu membuat semisal Al-Qur'an, padahal mereka adalah ahli bahasa dan sastrawan ulung, maka katakanlah kepada mereka, ketahuilah, bahwa Al-Qur'an itu diturunkan dengan ilmu Allah yang luas meliputi segala sesuatu, dan percayalah bahwa tidak ada tuhan yang wajib disembah selain dia, sebab hanya Allah yang mengetahui segala sesuatu dengan ilmunya, tidak mempunyai tandingan, dan sekutu dalam kekuasaannya. Oleh karena itu, maka maukah kamu berserah diri masuk islam dengan meyakini dan memercayai kekuasaan Allah, tuhan semesta alam' sekalipun bukti-bukti kebenaran Al-Qur'an sudah jelas, namun orang-orang kafir tetap tidak memercayai dan mengakui kebenaran isi kandungan Al-Qur'an. Penyebab mereka ingkar adalah karena kesombongan mereka. Sifat takabur dan sombong mendorong seseorang mengingkari kebenaran walaupun bukti sudah jelas. (lihat: surah annaml/27: 14). Setelah menjelaskan tentang bukti-bukti kebenaran ajaran islam dan kebenaran Al-Qur'an, maka ayat berikut ini menerangkan bahwa penyebab orang musyrik mendustakan Al-Qur'an adalah karena dorongan hawa nafsu yang cenderung mengutamakan urusan duniawi. Barang siapa menghendaki kehidupan dunia dengan pangkat, kemewahan, serta kenikmatan hidup, dan menginginkan pula perhiasannya seperti harta kekayaan yang melimpah, fasilitas hidup yang lengkap dan mewah, pasti kami akan berikan balasan penuh atas pekerjaan dan jerih payah mereka selama di dunia dengan sempurna. Itulah ketetapan Allah yang berlaku bagi siapa saja yang bekerja akan mendapatkan hasil dari jerih payahnya, dan mereka di dunia tidak akan dirugikan oleh hasil usaha mereka sendiri."
  }
]