[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang tidak mendapatkan di akhirat, kecuali neraka jahanam yang mana mereka akan merasakan panasnya, dan hilangah dari mereka manfaat amal-amal yang telah mereka perbuat, dan sia-sialah perbuatan mereka, lantaran dikerjakan bukan karena wajah Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Orang-orang yang memiliki tujuan yang hina itu tidak akan mendapatkan balasan apapun di Hari Kiamat selain Neraka yang akan mereka masuki. Pahala amal baik mereka musnah. Dan amal perbuatan mereka sia-sia belaka, karena tidak didahului dengan iman dan tidak disertai dengan tujuan yang baik. Amal perbuatan mereka tidak ditujukan untuk mendapatkan wajah Allah (ikhlas) dan kebahagiaan hidup di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Orang-orang yang terpaut oleh dunia yang fana dan tertipu oleh keindahannya itu tidak akan mendapat hasil di akhirat melainkan neraka; manfaat dari amalan-amalan yang dulu mereka lakukan sirna dan lenyap di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. أُو۟لٰٓئِكَ الَّذِينَ لَيْسَ لَهُمْ فِى الْاٰخِرَةِ إِلَّا النَّارُ ۖ (Itulah orang-orang yang tidak memperoleh di akhirat, kecuali neraka) Mereka tidak menginginkan akhirat dengan beramal amalan yang mengantarkan kepadanya, yang menjadikannya berhak untuk mendapatkan balasan yang baik di kehidupan akhirat. وَحَبِطَ مَا صَنَعُوا۟( dan lenyaplah di akhirat itu apa yang telah mereka usahakan) Yakni di kehidupan akhirat nanti, jelaslah bahwa amalan yang mereka perbuat menjadi sirna. Mereka merusaknya dengan rusaknya niat mereka dan tidak ikhlas karena Allah saat melakukan amalan-amalan itu. وَبٰطِلٌ مَّا كَانُوا۟ يَعْمَلُونَ (dan sia-sialah apa yang telah mereka kerjakan.) Kerena ia tidak beramal dengan cara yang benar yang dapat menjadikan mereka berhak untuk mendapat balasan yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Itulah orang-orang yang tidak mempunyai amal apapun, kelak di akhirat tidak memperoleh apapun kecuali neraka. Di akhirat kelak amal kebaikan dan segala usaha mereka di dunia akan lenyap dan sia-sia, karena amal mereka bukan karena Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang yang tidak memperoleh apapun di akhirat kecuali neraka, sia-sia apa yang telah mereka usahakan di dunia} telah hilang apa yang mereka kerjakan di dunia {dan batal apa yang dahulu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. “itulah orang orang yang tidak memperoleh akhirat kecuali neraka” mereka kekal didalamnya selama lamanya, azabNya tidak terputus mereka tidak mendapatkan balasan yang mulia “dan lenyaplah diakhirat itu apa yang telah mereka usahakan di dalamnya” yakni di dunia, maksudnya batal dan lenyap rencana mereka untuk membuat maka bagi kebenaran dan pengikutnya, begitu pula amal kebaikan yang tidak berdasar dan tidak terpenuhi syaratnya yaitu iman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وحبط) Wa habitha : Hilang dan rusak. Makna ayat : Kemudian sekiranya mereka tidak bertaubat, dan mati dalam keadaan kafir,maka tidak ada tempat kembali untuk mereka kecuali neraka. (و حبط ما صنعوا) hilanglah semua yang telah mereka kerjakan di dunia. Inilah makna dari firman-Nya : (مَن كَانَ يُرِيدُ ٱلۡحَيَوٰةَ ٱلدُّنۡيَا وَزِينَتَهَا نُوَفِّ إِلَيۡهِمۡ أَعۡمَٰلَهُمۡ فِيهَا وَهُمۡ فِيهَا لَا يُبۡخَسُونَ ١٥ أُوْلَٰٓئِكَ ٱلَّذِينَ لَيۡسَ لَهُمۡ فِي ٱلۡأٓخِرَةِ إِلَّا ٱلنَّارُۖ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَٰطِلٞ مَّا كَانُواْ يَعۡمَلُونَ ١٦). Pelajaran dari ayat : • Orang kafir tidak akan memperoleh manfaat dari amal-amalnya sekalipun termasuk amal saleh, dan kerugian pasti menimpanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 16: Seperti usaha mereka membuat makar terhadap kebenaran dan orang-orangnya, demikian pula amal baik mereka yang tidak didasari iman atau ikhlas karena Allah yang merupakan syarat diterimanya. Maksudnya apa yang mereka usahakan di dunia itu tidak ada pahalanya di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 16",
    "description": "Orang-orang yang amal perbuatannya hanya berorientasi duniawi semata, itulah orang-orang yang tidak memperoleh sesuatu di akhirat kecuali neraka. Mereka berusaha di dunia bukan atas dorongan iman, taat, pendekatan diri kepada Allah, dan membersihkan diri dari dosa, maka sia-sialah di akhirat sana apa yang telah mereka usahakan berupa harta kekayaan dan pangkat selama di dunia. Dan oleh karenanya, terhapuslah apa yang telah mereka kerjakan selama hidup di dunia. Bagi orang yang bekerja hanya untuk mencari kebahagiaan dan kemewahan dunia, Allah pasti akan berikan sesuai dengan apa yang mereka usahakan. Setelah ayat sebelumnya menjelaskan tentang kelompok orang yang hanya mengejar kemewahan hidup di dunia, tanpa mempersiapkan diri untuk kehidupan di akhirat, ayat berikut ini menjelaskan tentang keberadaan orang-orang yang percaya kepada ajaran yang dibawa oleh nabi Muhammad dan percaya kepada isi kandungan Al-Qur'an dan mereka yang tidak percaya kepada nabi serta ajaran yang terkandung dalam Al-Qur'an. Maka apakah orang yang sudah beriman kepada Allah serta mengikuti ajaran nabi Muhammad dan mereka mempunyai bukti yang nyata tentang kebenaran isi kandungan Al-Qur'an yang turun dari tuhannya sama dengan orang yang hanya mengejar kemewahan hidup di dunia saja' dan bukti kebenaran Al-Qur'an tersebut diikuti oleh saksi dari-Nya, yaitu Al-Qur'an yang membuktikan tentang kebenarannya sebagai wahyu Allah, dan sebelumnya sudah ada pula kitab taurat yang diturunkan kepada nabi musa yang memberi kabar gembira tentang kedatangan nabi Muhammad sebagai utusan Allah. Kitab suci yang diturunkan Allah kepada para rasul tersebut menjadi pedoman hidup bagi seluruh umat manusia dan rahmat bagi mereka yang beriman dan berharap petunjuk kepadanya. Barang siapa mengingkarinya dan meragukan kebenaran isi kandungan Al-Qur'an di antara kelompok-kelompok orang quraisy yang taklid buta terhadap ajaran nenek moyang mereka yang sesat, maka nerakalah tempat yang diancamkan baginya. Karena itu janganlah engkau ragu terhadap kebenaran Al-Qur'an yang tidak mengandung kebatilan (lihat: surah fushshilat/41: 41-42). Sungguh, alqur'an itu kebenarannya benar-benar datang dari tuhanmu yang mahabijaksana lagi maha terpuji, tetapi kebanyakan manusia tidak beriman kepada-Nya. Sekalipun bukti-bukti kebenaran nabi Muhammad sebagai utusan Allah dan Al-Qur'an adalah wahyu Allah sudah jelas, namun orang-orang kafir tetap tidak memercayainya. Orang-orang kafir tidak percaya kepada nabi Muhammad dan ajaran-ajaran Al-Qur'an, karena hati mereka tertutup oleh sifat dengki, sombong, dan angkuh."
  }
]