[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang berpijak diatas hujjah dan bashirah(ilmu jelas) dari tuhannya dalam perkara yang dia imani dan dia serukan, melalui wahyu yang Allah turunkan, yang didalamnya terdapat penjeasan, yang diikuti oleh bukti lain yang mempersaksikannya, yaitu jibril atau Muahmmad dan didukung hal itu oleh bukti ketiga sebelum al-qur’an, yaitu taurat, kitab suci yang diturunkan kepada Musa sebagai penuntun dan rahmat bagi yang beriman kepadanya, (apakah serupa orang seperti ini) dengan orang yang motifasinya adalah dunia yang fana dengan semua perhiasannya? mereka itu membenarkan al-qur’an ini dan melaksanakan hukum-hukumnya. Barangsiapa kafir terhadap Al-qur’an ini dari orang-orang yang bersekutu untuk melawan rasulullah , maka balasan mereka adalah neraka, dia akan memasukinya dengan pasti. Maka janganlahkamu (wahai rasul) berada dalam keraguan perihal al-qur’an dan statusnya yang berasal dari sisi Allah setelah kamu menyaksikan dalil-dalil petunjuk dan hujjah-hujjah. Dan ketahuilah, bahwa sesungguhnya agama ini adalah agama yang haq dari tuhanmu, akan tetapi kebanyakan manusia tidak mengimaninya dan tidak mengetahui dengan apa yang merka diperintahkannya. Ini merupakan taujih umum untuk umat nabi Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Tidaklah sama antara Nabi Muhammad -ṣallallāhu 'alaihi wa sallam- yang memiliki bukti dari Tuhannya dan memiliki saksi dari Tuhannya yaitu Jibril, dan kenabiannya telah disaksikan oleh Kitab Suci Taurat yang diturunkan kepada Musa -'alaihissalām- sebagai teladan dan rahmat bagi umat manusia, tidaklah sama antara beliau dan orang-orang mukmin yang berjuang bersamanya dengan orang-orang kafir yang berkeliaran di dalam kesesatan. Orang-orang mukmin itu percaya kepada Al-Qur`ān dan juga percaya kepada Muhammad -ṣallallāhu 'alaihi wa sallam- yang menerimanya. Dan siapapun penganut agama yang ingkar kepadanya maka Neraka adalah ancaman baginya di hari Kiamat. Maka janganlah engkau -wahai Rasu- merasa ragu terhadap kebenaran Al-Qur`ān dan adanya ancaman bagi mereka. Karena sesungguhnya Al-Qur`ān adalah kebenaran yang tidak perlu diragukan. Tetapi kebanyakan manusia tidak beriman, walaupun dalil-dalil dan bukti-bukti yang menunjukkan kebenarannya sangat berlimpah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Orang yang berada dalam cahaya dan hidayah dari Tuhannya, dan hidayah itu dikuatkan dengan bukti yang jelas dari Tuhannya, yaitu dengan kitab yang agung, dan diteguhkan dengan kitab sebelumnya, yaitu Taurat yang diturunkan sebagai petunjuk menuju hidayah, kebaikan, dan rahmat bagi Bani Israil di dunia dan akhirat mereka; maka mereka adalah orang-orang yang memiliki derajat yang tinggi, mereka beriman kepada hujjah-hujjah dan bukti-bukti yang jelas. Dan barangsiapa yang mengingkari agama, maka tempat mereka adalah neraka, setelah kehidupan yang sulit mereka telah berakhir. Hai orang yang beriman, maka janganlah ragu setelah ada bukti-bukti yang datang silih berganti ini, ia adalah kebenaran yang datang dari Tuhanmu, akan tetapi kebanyakan manusia tidak mengimaninya karena kebebalan dan kelalaian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِۦ (Apakah orang-orang yang ada mempunyai bukti yang nyata (Al Quran) dari Tuhannya) Yakni apakah mereka dalam mengikuti Rasulullah dan beriman kepada Allah sama dengan orang yang tidak mengharapkan kecuali kehidupan dunia dan kenikmatannya. Pendapat lain mengatakan, yang dimaksud dalam ayat ini adalah Rasulullah. وَيَتْلُوهُ شَاهِدٌ مِّنْهُ(dan diikuti pula oleh saksi dari Allah) Yakni al-Qur’an. Pendapat lain mengatakan, yakni mukjizat-mukjizat atau kitab Injil. وَمِن قَبْلِهِۦ كِتٰبُ مُوسَىٰٓ( dan sebelum Al Quran itu telah ada Kitab Musa) Asal kalimatnya adalah dan saksi itu diikuti pula oleh saksi lain sebelumnya yaitu kitab Nabi Musa yang memberi kabar gembira tentang pengutusan Nabi Muhammad dan mengabarkan bahwa dia adalah Rasulullah. إِمَامًا وَرَحْمَةً ۚ( yang menjadi pedoman dan rahmat) Makna (الإمام) yakni sesuatu yang menjadi pedoman dan teladan dalam agama. Dan Taurat ini merupakan nikmat yang agung yang diberikan oleh Allah kepada umat tersebut. أُو۟لٰٓئِكَ يُؤْمِنُونَ بِهِۦ ۚ( Mereka itu beriman kepada Al Quran) Yakni yang percaya kepada Rasulullah atau kepada al-Qur’an. وَمَن يَكْفُرْ بِهِۦ مِنَ الْأَحْزَابِ(Dan barangsiapa di antara mereka (orang-orang Quraisy) dan sekutu-sekutunya yang kafir kepada Al Quran) Dari penduduk Makkah dan lainnya dari agama-agama yang lain. فَالنَّارُ مَوْعِدُهُۥ ۚ( maka nerakalah tempat yang diancamkan baginya) Yakni ia pasti merupakan penghuni neraka. فَلَا تَكُ فِى مِرْيَةٍ مِّنْهُ (karena itu janganlah kamu ragu-ragu terhadap Al Quran itu) Yakni janganlah kalian ragu terhadap al-Qur’an sedikitpun, atau terhadap apa yang diancamkan itu. إِنَّهُ الْحَقُّ مِن رَّبِّكَ(Sesungguhnya (Al Quran) itu benar-benar dari Tuhanmu) Maka tidak ada celah untuk keraguan didalamnya. وَلٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ(tetapi kebanyakan manusia tidak beriman) Padahal bukti-bukti telah jelas yang mengharuskan mereka beriman namun mereka tetap mendustainya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sa'id bin Jabir berkata : aku tidak pernah mendengar satu hadits pun dari Nabi melainkan aku menemukan pembenarannya dalam al-qur'an, maka tatkala dikabarkan kepadaku hadits : (( وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَا يَسْمَعُ بِي أَحَدٌ مِنْ هَذِهِ الْأُمَّةِ يَهُودِيٌّ وَلَا نَصْرَانِيٌّ ثُمَّ يَمُوتُ وَلَمْ يُؤْمِنْ بِالَّذِي أُرْسِلْتُ بِهِ إِلَّا كَانَ مِنْ أَصْحَابِ النَّارِ )) \"Demi Dzat yang jiwa Muhammad berada di tangan-Nya, tidaklah seseorang dari umat ini baik Yahudi dan Nashrani mendengar tentangku, kemudian dia meninggal dan tidak beriman dengan agama yang aku diutus dengannya, kecuali dia pasti termasuk penghuni neraka\" aku kemudian bertanya dimana pembenaran hadits ini dalam al-qur'an ? hingga aku menemukan ayat ini { وَمَنْ يَكْفُرْ بِهِ مِنَ الْأَحْزَابِ فَالنَّارُ مَوْعِدُهُ } \"Dan barangsiapa di antara mereka (orang-orang Quraisy) dan sekutu-sekutunya yang kafir kepada Al Quran, maka nerakalah tempat yang diancamkan baginya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Apakah orang-orang yang beramal sesuai petunjuk, iman dan bukti dari Allah serta mengikuti Nabi SAW itu sama seperti orang-orang yang hanya menginginkan dunia dan segala perhiasannya? Mereka memegang teguh Al Quran dengan iman. Sebelum Al Quran itu diturunkan telah ada Kitab Musa yang menjadi pedoman dan mempersaksikan bahwa Nabi Muhammad adalah seorang rasul Allah. Barangsiapa di antara mereka orang-orang Quraisy dan sekutu-sekutunya yang kafir kepada Al Quran, maka nerakalah tempat yang diancamkan bagi mereka, karena itu janganlah kamu ragu-ragu terhadap Al Quran itu. Sesungguhnya Al Quran itu benar-benar dari Tuhanmu, tetapi kebanyakan manusia tidak beriman dengan berbagai bukti yang menunjukkan kebenaran Al Quran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang yang mempunyai bukti nyata} bukti {dari Tuhannya, diikuti oleh seorang saksi dariNya} diikuti oleh seorang saksi dari Allah yang membenarkannya, yaitu Jibril AS {dan sebelumnya sudah ada pula kitab Musa yang menjadi pedoman dan rahmat. Mereka itu beriman kepadanya. Siapa yang mengingkarinya dari golongan-golongan} para pengikut agama-agama lain {maka nerakalah tempat kembalinya. Janganlah} Janganlah {dalam keraguan} keraguan {terhadapnya. Sesungguhnya (Al-Qur’an) itu kebenaran dari Tuhanmu, tetapi kebanyakan manusia tidak beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Allah menyebutkaan keadaan RasulNya, Muhammad dan ahli waris dakwahnya yang meneruskan perjuangannya serta para penegak hujjah yang yakin dengan itu dan menyebutkan bahwa selain mereka tidak disandangkan sifat sifat milik mereka dan tidak ada yang sama dengan mereka “apakah orang orang kafir itu sama dengan orang orang yang sudah mempunyai bukti yang nyata (al quran) dari Rabbnya” dengan wahyu yang Allah turunkan di dalamnya terdapat masalah masalah penting dengan dalil dalilnya yang jelas maka dia yakin dengan keterangan itu. ”dan diikuti” yakni keterangan dan bukti ini diikuti oleh bukti yang lain yaitu, ”seorang saksi” yakni saksi (yang memiliki) fitrah yang lurus dan akal yang benar yaitu Muhammad ketika dia bersaksi terhadap apa yang diwahyukan dan disyariatkan Allah dan dia mengetahui kebaikannya dengan akalnya, maka hal itu menambah keimanannya. “dan\" ada saksi ketiga, yaitu ”kitab musa” taurat yang Allah jadikan sebagai “pedoman” bagi manusia dan \"rahmat\" bagi mereka. Kitab ini menjadi saksi bagi Al-quran dan menyetujuinya dalam kebenaran yang dibawanya. maksudnya apakah orang yang sifat begini, yang telah hadir kepada bukti bukti keimanan dan tegak baginya bukti bukti keyakinan sama dengan orang yang berada di dalam kebodohan dan kegelapan dalam keadaan tidak keluar darinya? Tentu di sisi Allah dan di mata hamba Allah tidaklah sama. ”mereka itu” yaitu orang orang yang diberi taufik untuk mengetahui dalil dalil, \"mereka beriman\" kepada al qur’an secara hakiki maka iman mereka membuahkan seluruh kebaikan di dunia dan akhirat. “dan barangsiapa yang mengingkarinya” yakni al qur’an “diantara sekutu sekutunya” yakni seluruh golongan penduduk bumi yang bersekutu menolak kebenaran “maka nerakalah tempat yang diancamkan baginya.” Mereka pasti masuk kedalamnya ”karena itu janganlah kamu ragu ragu terhadap al qur’an itu” dengan kebimbangan sedikitpun ”sesungguhnya al quran itu benar benar dari Rabbmu, tetapi kebanyakan manusia tidak beriman” bisa jadi karena ketidaktahuan dan kesesatan, bisa jadi karena kezhaliman, pengingkaran dan kekejian mereka, karena jika tidak maka barangsiapa tujuannya baik dan pemahamannya lurus, niscaya dia pasti beriman kepadanya karena dia melihat ajakan kepada iman dari segala segi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (على بينة من ربه) ‘Alaa bayynatimm mirrabbih : berdasarkan ilmu yang pasti. (ويتلوه شاهد منه) Wa yatluuhu syaahidum minhu : Dan bersamanya bukti. (كتاب موسى) Kitaabu muusaa : Taurat. (و من يكفر به) Wa may yakfur bihi : Ingkar terhadap Al-Qur’an. (فالنار موعده) Fan naaru mau’iduh : Tempat kembali yang pasti adalah neraka, tidak terelakkan. (في مرية منه) Fii miryatim minhu : Berada di dalam keraguan. Makna ayat : Firman-Nya (أفمن كان على بينة من ربه) “Apakah yang berada diatas kebenaran berupa apa yang Allah wahyukan; Al-Qur’an serta apa yang dikandungnya berupa dalil dan bukti ke-esa-an Allah, kenabian rasul-Nya, serta kebangkitan di hari kiamat. Firman-Nya (و يتلوه شاهد منه) bersamanya bukti; perkataan yang jujur, akhlak dan kepribadian yang sempurna, sebagaimana ketika seorang arab badui melihatnya lalu berkata, “Demi Allah, ini bukan wajah seorang pendusta.” Lalu bukti ketiga ada dalam firman-Nya (و من قبله كتاب موسى) yaitu Taurat (إماما و رحمة) sebagai saksi atasnya (Rasulullah), di dalam nya dijelaskan ciri serta sifat Rasulullah dan umatnya. Apakah orang yang berada diatas petunjuk dan bukti akan kebenaran agamanya, sama seperti orang yang tidak punya petunjuk tidak pula bukti kecuali hanya mengikuti adat orang-orang sesat dan musyrikin? Firman-Nya (أولئك يؤمنون به) mereka adalah orang-orang yang beriman dengannya: Al-Qur’an, Nabi, dan agama yang benar. Firman-Nya (و من يكفر به) barangsiapa ingkar kepada Al-Qur’an, nabi-Nya, dan agama-Nya (من الأحزاب) dari kelompok, umat, dan bangsa apapun (فالنار موعده) maka nereka lah tempat kembali mereka, cukup lah bagi mereka Jahanam, seburuk-buruknya tempat kembali. Firman-Nya ( فلا تك في مرية منه) Janganlah engkau berada dalam keraguan bahwa orang-orang kafir akan kembali kedalam neraka. Firman-Nya (إنه الحق من ربك) “Sesungguhnya (Al Qur'an) itu benar-benar dari Tuhanmu” yaitu Al-Qur’an yang mereka dustakan dan apa ada didalamnya berupa janji dan ancaman, serta agama yang benar, itu semua benar adanya dari Rabb-mu, namun (أكثر الناس لا يؤمنون) kebanyakan manusia tidak beriman, sekalipun dalil telah tampak, telah jelas tanda-tanda kebenaran, serta telah tetap bukti atasnya(atas kebenaran). Pelajaran dari ayat : • Seorang muslim berada diatas kebenaran, sedangkan agama-agama lain berada dalam kegelapan, kesesatan, dan kebodohan. • Sunnatullah bahwa kebanyakan manusia tidak beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 17: Allah Subhaanahu wa Ta'aala menyebutkan keadaan Nabi Muhammad shallallahu 'alaihi wa sallam dan orang-orang yang mengikuti Beliau menegakkan agama-Nya. Orang di sini adalah Nabi Muhammad shallallahu 'alaihi wa sallam atau kaum mukmin. Yang membenarkannya. Ada yang menafsirkan “saksi” di sini dengan malaikat Jibril ‘alaihis salam. Ada pula yang menafsirkan “saksi” di sini dengan Al Quran itu sendiri karena Al Quran adalah suatu mukjizat yang tidak dapat dibantah atau dibatalkan. Ada pula yang menafsirkan “saksi” di sini dengan fitrah yang lurus dan akal yang sehat, di mana fitrah dan akal mendukungnya sehingga imannya bertambah. Yaitu Taurat, yang menjadi saksi pula terhadap kebenaran Al Qur’an dan sejalan dengan kebenaran yang dibawanya. Tentu tidak sama baik di hadapan Allah maupun di hadapan hamba-hamba Allah. Yakni tidak sama orang yang berada di atas keterangan yang meyakinkan dengan orang yang berada dalam kegelapan dan kebodohan, tidak ada penguat sama sekali baginya lagi tidak dapat meloloskan diri darinya. Yang berada di atas bukti yang nyata. Maka mereka akan memperoleh surga. Yakni orang-orang Quraisy dan orang-orang kafir lainnya dengan segala macamnya. Ada yang tidak beriman karena kebodohan dan kesesatannya, dan ada pula yang tidak beriman karena kezaliman, sikap keras dan penentangannya. Hal itu, karena kalau memang niat mereka baik dan pemahamannya lurus, tentu ia akan beriman, karena semua sisi, mendorongnya untuk beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 17",
    "description": "Setelah ayat sebelumnya menjelaskan tentang kelompok orang yang hanya mengejar kemewahan hidup di dunia, tanpa mempersiapkan diri untuk kehidupan di akhirat, ayat berikut ini menjelaskan tentang keberadaan orang-orang yang percaya kepada ajaran yang dibawa oleh nabi Muhammad dan percaya kepada isi kandungan Al-Qur'an dan mereka yang tidak percaya kepada nabi serta ajaran yang terkandung dalam Al-Qur'an. Maka apakah orang yang sudah beriman kepada Allah serta mengikuti ajaran nabi Muhammad dan mereka mempunyai bukti yang nyata tentang kebenaran isi kandungan Al-Qur'an yang turun dari tuhannya sama dengan orang yang hanya mengejar kemewahan hidup di dunia saja' dan bukti kebenaran Al-Qur'an tersebut diikuti oleh saksi dari-Nya, yaitu Al-Qur'an yang membuktikan tentang kebenarannya sebagai wahyu Allah, dan sebelumnya sudah ada pula kitab taurat yang diturunkan kepada nabi musa yang memberi kabar gembira tentang kedatangan nabi Muhammad sebagai utusan Allah. Kitab suci yang diturunkan Allah kepada para rasul tersebut menjadi pedoman hidup bagi seluruh umat manusia dan rahmat bagi mereka yang beriman dan berharap petunjuk kepadanya. Barang siapa mengingkarinya dan meragukan kebenaran isi kandungan Al-Qur'an di antara kelompok-kelompok orang quraisy yang taklid buta terhadap ajaran nenek moyang mereka yang sesat, maka nerakalah tempat yang diancamkan baginya. Karena itu janganlah engkau ragu terhadap kebenaran Al-Qur'an yang tidak mengandung kebatilan (lihat: surah fushshilat/41: 41-42). Sungguh, alqur'an itu kebenarannya benar-benar datang dari tuhanmu yang mahabijaksana lagi maha terpuji, tetapi kebanyakan manusia tidak beriman kepada-Nya. Sekalipun bukti-bukti kebenaran nabi Muhammad sebagai utusan Allah dan Al-Qur'an adalah wahyu Allah sudah jelas, namun orang-orang kafir tetap tidak memercayainya. Orang-orang kafir tidak percaya kepada nabi Muhammad dan ajaran-ajaran Al-Qur'an, karena hati mereka tertutup oleh sifat dengki, sombong, dan angkuh. Dan siapakah yang lebih zalim daripada orang yang mengada-adakan suatu kebohongan terhadap Allah' seperti anggapan bahwa Allah mempunyai putra, malaikat putri Allah, berhala menjadi perantara menuju Allah, atau menyamakan Allah dengan manusia. Mereka itu akan dihadapkan kepada tuhan mereka, dan dihadirkan kepadanya para saksi, yaitu malaikat pencatat amal, para nabi, ulama, dan saksi-saksi lainnya, lalu mereka berkata, orang-orang inilah yang telah berbohong terhadap tuhan mereka ketika di dunia. Di hadapan Allah dan para saksi, mereka tidak bisa mengelak, kemudian dikatakan kepadanya, ingatlah, laknat Allah akan ditimpakan kepada orang yang berbuat zalim, karena menzalimi diri sendiri dengan perbuatan bohong dan syirik."
  }
]