[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang zhalim yang menghalangi manusia dari jalan Allah yang menyampaikan mereka kepada penyembahanNya, mereka menginginkan agar jalan tersebut bengkok supaya sejalan dengan hawa nafsu keinginan mereka, dan mereka itulah orang-orang kafir terhadap akhirat, tidak beriman kepada Hari kebangkitan dan hari pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Yaitu orang-orang yang menghalangi manusia dari jalan Allah yang lurus dan berusaha membuatnya menjadi bengkok agar tidak dilalui oleh siapapun. Dan mereka itu mengingkari adanya kehidupan sesudah mati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Yaitu orang-orang yang memalingkan orang lain dari jalan Allah yang lurus dan jelas, dan senantiasa berusaha menghilangkan syiar-syiarnya agar menjadi bengkok dan sesuai dengan hawa nafsu mereka, selain itu mereka juga mengingkari hari akhir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. الَّذِينَ يَصُدُّونَ عَن سَبِيلِ اللهِ (orang-orang yang menghalangi (manusia) dari jalan Allah) Yakni yakni mereka menghalangi orang yang mampu mereka halangi dari memeluk agama Allah. وَيَبْغُونَهَا عِوَجًا(dan menghendaki (supaya) jalan itu bengkok) Mereka menyebut jalan Allah sebagai jalan yang bengkok agar orang-orang menghindar darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Orang-orang yang zhalim itu adalah yang menghalangi manusia dari jalan agama dan keimanan kepada Allah. Mereka menghendaki supaya jalan itu bengkok/menyimpang dari jalan Islam yang lurus. Mereka itulah orang-orang yang tidak percaya akan adanya hari kebangkitan, perhitungan amal dan hari akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka yang menghalangi} menghalangi {dari jalan Allah} agama Allah {dan menghendaki agar jalan itu bengkok} menginginkan jalan itu menyimpang dari jalan yang lurus {Mereka itulah orang-orang yang ingkar terhadap hari akhir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. kemudian Allah menyifati kezhaliman mereka, seraya berfirman ”yaitu orang orang yang menghalangi manusia dari jalan Allah” mereka menghalangi jalan Allah dengan diri mereka sendiri yaitu jalan para Rasul yang mana mereka menyeru manusia kepadanya. Orang orang itu menghalangi orang lain darinya. Mereka menjadi imam imam yang menyeru kepada neraka. “dan menghendaki (supaya) jalan itu bengkok” mereka bersungguh sungguh membelokan jalan Allah, menjelekannya dan mencorengnya agar dia menurut pandangan manusia menjadi bukan jalan yang lurus, maka mereka memperindah kebatilan dan memperburuk kebenaran semoga Allah menimpakan keburukan kepada mereka ”dan mereka itulah orang orang yang tidak percaya akan adanya hari akhirat”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سبيل الله) Sabiilillah : Islam. (عوجا) ‘Iwaja : Bengkok. Makna ayat : Kemudian Allah menjelaskan kembali kejahatan mereka (الذين يصدون عن سبيل الله) menjauhkan diri mereka dan orang lain dari agama Islam, (و يبغونها) mengharapkan agar jalan Allah (Islam) (عوجا) menjadi sesuai dengan keinginan hawa nafsu mereka, karena mereka ingin agar Islam menghalalkan yang haram: riba, zina, bertabarruj, dan mereka menginginkan agar Islam mengizinkan mereka menyembah kubur, pohon, batu, dan sebagainya, ditambah lagi dosa mereka yang terbesar keingkaran mereka terhadap hari akhir. Pelajaran dari ayat : • Besarnya kejahatan orang yang menghalangi dari Islam, baik dengan perkataan, perilaku, atau kekuatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 19: Yaitu agama Islam. Dengan berusaha memembengkokkan, memperburuk citranya, memfitnahnya, sehingga jalan yang lurus tersebut di hadapan manusia seakan-akan tidak lurus, yang batil menjadi nampak indah, sedangkan yang benar menjadi nampak buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 19",
    "description": "Termasuk orang zalim juga adalah mereka yang menghalangi manusia dari hidayah Allah serta merintangi mereka dari jalan menuju Allah. Dan mereka ingin menyelewengkan jalan-Nya serta menghendaki agar jalan menuju kebenaran itu bengkok sehingga orang lain mengingkari agama yang benar. Dan mereka itulah orang yang tidak percaya adanya hari akhirat, hari dibangkitkannya manusia dari kubur untuk mempertangungjawabkan amal perbuatan mereka di dunia. Orang-orang yang berusaha menghalangi dari jalan Allah akan dilipatgandakan siksaannya di akhirat (lihat: surah an-nahl/16: 88). Setelah dijelaskan ancaman Allah terhadap orang-orang musyrik dengan siksa akhirat, kemudian Allah menjelaskan kekuasaan-Nya menurunkan siksaan di dunia dan akhirat. Mereka orang-orang kafir yang jauh dari rahmat Allah dalam kondisi apa pun tidak mampu menghalangi datangnya siksaan Allah di bumi. Dan ketika azab itu datang, tidak akan ada seorang pun bagi mereka baik di dunia maupun kelak di akhirat sebagai penolong yang mampu melindunginya selain Allah. Bahkan azab itu akan dilipatgandakan kepada mereka di akhirat disebabkan perbuatan durhaka yang mereka kerjakan, kemudian melanjutkan kedurhakaannya dengan menghalangi orang lain berbuat kebajikan, bahkan mendorongnya berbuat kesesatan. Mereka pun tidak mampu mendengar kebenaran seruan Al-Qur'an dan tidak dapat melihatnya disebabkan mereka tidak memanfaatkan anugerah yang diberikan Allah, karenanya hati mereka diliputi kemusyrikan dan kezaliman, bahkan mereka bersikap negatif terhadap seruan Al-Qur'an. (lihat: surah fushshilat/41:26)."
  }
]