[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diturunkannya al-qur’an dan adanya penjelasan hukum-hukum, perincian dan dijaganya , bertujuan supaya kalian tidak beribadah kecuali kepada Allah semata, tiada sekutu bagiNYa. Sesungguhnya aku bagi kalian (wahai sekalian manusia), hanyalah seorang pemberi peringatan dari Allah yang memperingatkan kalian dari siksaanNYa, dan pemberi kabar gembira yang memberikan kabar gembira dengan pahalaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Ayat-ayat yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- berisi larangan menyembah tuhan lain di samping Allah. Sesungguhnya aku (Muhammad -ṣallallāhu 'alaihi wa sallam-) memperingatkan kalian -wahai manusia- akan adanya azab Allah ika kalian ingkar dan durhaka kepada-Nya. Dan aku memberikan kabar gembira kepada kalian akan adanya ganjaran dari Allah jika kalian beriman kepada-Nya dan menjalankan syari'at-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah memerintahkan umat Nabi Muhammad untuk mengesakan-Nya dalam ibadah, karena hanya Dia yang berhak disembah. Rasulullah berkata kepada mereka: “Sungguh aku diutus Allah sebagai pemberi peringatan bagi orang-orang yang bermaksiat dengan kemurkaan dan azab-Nya, dan sebagai pemberi kabar gembira bagi orang-orang yang taat dengan karunia dan keridhaan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. أَلَّا تَعْبُدُوٓا۟ إِلَّا اللهَ ۚ (agar kamu tidak menyembah selain Allah) Yakni ayat-ayat yang disusun dan dijelaskan oleh Allah dalam al-Qur’an ini isi kandungannya adalah perintah untuk beribadah kepada Allah semata, tanpa menyekutukan dengan selain Dia. إِنَّنِى لَكُم مِّنْهُ نَذِيرٌ(Sesungguhnya aku (Muhammad) adalah pemberi peringatan kepadamu daripada-Nya) Yakni aku memperingatkan kalian dari azab Allah yang diturunkan bagi orang yang bermaksiat. وَبَشِيرٌ(dan pembawa khabar gembira) Aku memberi kalian kabar gembira berupa surga dan keridhaan Allah bagi orang yang mentaati-Nya dan beramal shaleh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2 Dan isi dan hukum-hukum dalam ayat-ayatnya adalah perintah untuk menyembah hanya kepada Allah dan tiada sekutu bagiNya serta tidak menyembah kepada selainNya. Sesungguhnya aku (Muhammad) diutus oleh Allah kepada kalian sebagai pemberi peringatan dengan azab dan neraka bagi yang kafir dan pembawa kabar gembira dengan pahala dan surga bagi yang taat,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Janganlah kalian menyembah kecuali kepada Allah. Sesungguhnya aku bagi kalian adalah pemberi peringatan dan pembawa berita gembira"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Allah hanyalah menurunkan kitabNya agar kamu tidak menyembah kecuali Allah, maksudnya agar mengikhlaskan seluruh agama kepada Allah dan agar tidak seorang pun dari makhlukNya yang disekutukan denganNya. “Sesungguhnya aku (Muhammad) bagimu,” wahai manusia. “DariNya” , dari Allah Rabbmu “adalah pemberi peringatan”, bagi yang berani melakukan kemaksiatan dengan azab dunia dan akhirat. “Dan pembawa kabar gembira”, bagi orang-orang yang taat kepada Allah dengan pahala dunia dan akhirat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَتَاعًا حَسَنًا) Mataa’an hasanan : Kehidupan yang bahagia dan rizki yang luas. (إِلَى أَجَلٍ مُسَمًّى) Ilaa ajalim musamman : Sampai ajalnya, kematian. (وَ يُؤْتِ كَلَّ ذِيْ فَضْلٍ) Wa yu’ti kulla dzii fadhlin : membalas setiap amal yang saleh dengan ganjaran yang mulia. (عَذَابَ يَوْمٍ كَبِيْرٍ) ‘Adzaba yaumin kabiir : Yaitu azab hari kiamat. Makna Ayat : Firman-Nya (أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَۚ إِنَّنِي لَكُم مِّنۡهُ نَذِيرٞ وَبَشِيرٞ) Allah menurunkan kitab, menyempurnakan ayatnya serta menjelaskan hukum dan petunjuk-petunjuk yang ada di dalamnya, agar mereka tidak menyembah kecuali hanya kepada Allah semata, karena tidak ada sesembahan yang berhak disembah kecuali Dia. Serta ibadah tidak akan bermanfaat, kecuali peribadatan yang dipersembahkan kepada-Nya. Firman-Nya (إِنَّنِي لَكُم مِّنۡهُ نَذِيرٞ وَبَشِيرٞ) Ini adalah perkataan rasul-Nya sebagai pemberi kabar seraya berkata: “Wahai sekalian manusia! Sungguh aku adalah pemberi peringatan atas adanya azab yang pedih dari Rabb kalian yang Maha Bijaksana seandainya kalian tidak bertaubat kepada-Nya serta beriman dan mentauhidkan-Nya. (بَشِيرٞ) Aku memberikan kabar gembira bagi orang yang beriman serta mentauhidkan-Nya dan beramal saleh dengan surga di akhirat kelak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 2: Yakni Allah menurunkan kitab itu untuk mengembalikan manusia kepada fitrahnya, yaitu menyembah hanya kepada Allah dan sebagai pedoman bagi mereka dalam meniti hidup di dunia yang fana ini. Dengan azab jika kamu kafir. Dengan pahala jika kamu beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 2",
    "description": "Allah menurunkan ayat-ayat Al-Qur'an yang sangat indah dan tersusun rapi serta mendetail kandungannya, agar kamu tidak menyembah selain Allah. Sesungguhnya aku, Muhammad, adalah pemberi peringatan adanya siksa bagi orang-orang yang ingkar dan pembawa berita gembira dari-Nya, yakni surga untukmu wahai orang-orang yang beriman. Sesungguhnya hanya Allah yang berhak disembah dan hendaklah kamu memohon ampunan secara tulus kepada tuhanmu dan kemudian bertobatlah, yakni kembali kepada-Nya dengan menyesali kesalahankesalahan serta tidak mengulanginya lagi, niscaya dia akan memberi kenikmatan yang baik kepadamu di dunia sampai waktu yang telah ditentukan, yakni datangnya ajal. Dan dia akan memberikan karunia-Nya, yakni pahala, kepada setiap orang yang berbuat baik. Dan jika kamu berpaling dari petunjuk Allah dan rasul-Nya, maka sungguh, aku takut kamu akan ditimpa azab pada hari yang besar, yakni hari pembalasan kelak."
  }
]