[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu, mereka tidak akan dapat melarikan diri dari Allah di dunia. Dan mereka tidaklah mempunyai penolong-penolong yang dapat menghalangi mereka dari siksaanNya. Akan diliatgandakan bagi mereka siksaan di dalam neraka jahanam, disebabkan mereka tidak dapat mendengar al-qur’an dengan memanfaatkannya, atau menyaksikan ayat-ayat Allah di dalam semesta ini untuk mencari petunjuk, karena mereka sibuk dalam kekafiran yang mereka hidup didalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang semacam itu tidak akan bisa lari dari azab Allah di dunia ini apabila menimpa mereka. Dan selain Allah mereka tidak memiliki teman dan pelindung yang dapat melindungi mereka dari hukuman Allah. Sedangkan hukuman mereka di Akhirat akan ditambah karena mereka telah memalingkan diri mereka sendiri dan juga orang lain dari jalan Allah. Selama di dunia mereka tidak mau mendengar dalam arti tidak mau menerima kebenaran dan petunjuk, dan tidak mau melihat tanda-tanda kekuasaan Allah untuk diambil manfaatnya, karena mereka berpaling terlalu jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Mereka ketika di dunia tidak pernah luput dari kekuasaan Allah, dan tidak pernah memiliki penolong; akan tetapi Allah menangguhkan mereka dan meakhirkan azab mereka sebagai istidraj. Dan inilah mereka di akhirat yang mereka sia-siakan, mereka mendapat azab yang berlipat ganda akibat kesesatan dan penyesatan yang mereka lakukan. Ketika di dunia mereka enggan mendengarkan orang yang menyeru kepada kebenaran karena keberpalingan dan kebencian mereka terhadapnya; dan mereka tidak memperhatikan ayat-ayat yang tersebar di sekitar mereka, namun mereka berada dalam kebutaan dan kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. أُو۟لٰٓئِكَ لَمْ يَكُونُوا۟ مُعْجِزِينَ فِى الْأَرْضِ (Orang-orang itu tidak mampu menghalang-halangi Allah untuk (mengazab mereka) di bumi ini) Mereka tidak akan bisa lolos di dunia dari Allah apabila Dia hendak menyiksa mereka. وَمَا كَانَ لَهُم مِّن دُونِ اللهِ مِنْ أَوْلِيَآءَ ۘ( dan sekali-kali tidak adalah bagi mereka penolong selain Allah) Yang akan membela mereka dari siksaan yang Allah kehendaki bagi mereka. يُضٰعَفُ لَهُمُ الْعَذَابُ ۚ( Siksaan itu dilipat gandakan kepada mereka) Dikarenakan kedustaan mereka terhadap Allah, penghalangan mereka dari jalan-Nya, dan penyebutan mereka kepada agama Islam bahwa ia adalah agama yang sesat, maka azab mereka dilipat gandakan dari azab yang ditimpakan bagi orang kafir yang tidak melakukan seperti perbuatan mereka. مَا كَانُوا۟ يَسْتَطِيعُونَ السَّمْعَ(Mereka selalu tidak dapat mendengar (kebenaran) dan mereka selalu tidak dapat melihat(nya)) Mereka mereka sangat keterlaluan dalam berpaling dari kebenaran dan benci terhadapnya sampai seakan-akan mereka tidak dapat mendengar dan melihat kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Orang-orang yang mengingkari hari akhirat dan menghalangi manusia dari agama Allah itu tidak mampu menghalang-halangi Allah untuk mengazab mereka di bumi ini. Sekali-kali mereka tidak mempunyai penolong yang bisa menghalangi mereka dari azab selain Allah. Pada hari kiamat siksaan itu dilipatgandakan kepada mereka yang telah menghalangi manusia dari agama dan jalan Allah serta menganggap Islam adalah jalan yang menyimpang dari kebenaran. Mereka tidak pe dapat mendengar dan melihat kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itu tidak mampu} menghindar dari azab Allah dengan melarikan diri {di bumi dan tidak akan ada bagi mereka penolong} penolong dan penyelamat {selain Allah. Azab itu akan dilipatgandakan untuk mereka. Mereka tidak mampu mendengar dan tidak dapat melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20 “orang orang itu tidak mampu menghalang halangi Allah untuk (mengazab mereka) di bumi ini” yakni mereka tidak lolos dari azab Allah karena mereka di bawah cengkraman dan kekuasaanNya “dan sekali kali tidak ada penolong bagi mereka selain Allah” yang menolak dari mereka perkara yang dibenci dan menolong mewujudkan bagi mereka apa yang bermanfaat akan tetapi seluruh sarana dengan para penolong telah terputus. ”siksaan itu dilipatgandakan kepada mereka” ditambah dan diberatkan karena mereka telah sesat dan menyesatkan orang lain. ”mereka selalu tidak dapat mendengar kebenaran” akibat kebencian dan ketidaksukaannya terhadap kebenaran. mereka tidak bisa mendengar ayat ayat Allah dengan pendengaran yang bermanfaat. “maka mengapa mereka orang orang kafir berpaling dari peringatan Allah? seakan akan mereka itu keledai liar yang lari terkejut, lari dari singa” “dan mereka selalu tidak dapat melihatnya” maksudnya, melihat dengan tujuan mengambil pelajaran dan merenungkan apa yang berguna bagi mereka. Mereka itu hanyalah orang yang tuli dan bisu yang tidak berakal."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (معجزين في الأرض) Mu’jiziin fil ardh : Lolos dari siksa Allah, bahkan Dia mampu menyiksa mereka kapan pun. (من أولياء) Min auliyaa’ : Penolong mereka dari azab Allah. (و ما كانوا يبصرون) Wa maa kaanuu yubshiruun : Mereka tidak melihat karena kebencian mereka terhadap kebenaran sampai tidak mampu mendengar tidak pula melihat. Makna ayat : Allah berfirman (أولئك) mereka yang sudah disebutkan di atas (لم يكونوا معجزين في الأرض) tidak akan dapat lolos dari (siksaan) Allah di bumi, sekalipun mereka memandang diri sebagai orang-orang kuat. Karena azab itu akan menjumpai dan turun kepada mereka kapan pun Dia kehendaki, sekalipun mereka lari darinya. Mereka tidak mempunyai pelindung tidak pula penolong selain Allah yang dapat mencegah mereka dari azab Allah ketika datang. Firman-Nya (يضاعف لهم العذاب) sebuah kabar dari-Nya bahwa mereka orang-orang zalim akan mendapatkan azab yang berlipat pada hari kiamat nanti, karena mereka menghalangi diri mereka dan orang lain dari jalan Allah. Inilah keadilan yang sebenarnya. Firman-Nya tentang mereka (ما كانوا يستطيعون السمع و ما كانوا يبصرون) berita tentang keadaan mereka ketika di dunia, disebabkan oleh besarnya kebencian mereka kepada kebenaran dan orang yang mengajak kepada kebenaran seperti para da’i, sehingga mereka tidak mampu mendengar dan melihat kebenaran, tidak pula orang-orang yang berpegang teguh di atasnya. Pelajaran dari ayat : • Besarnya dosa merendahkan syariat Islam karena hawa nafsu dan syahwat, dengan takwil yang batil, fatwa yang tidak bertanggung jawab dari orang yang menjual akhiratnya untuk dunia. • Penjelasan bahwa orang yang membenci perkataan atau seseorang, ia tidak bisa melihatnya atau mendengarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 20: Karena mereka dalam genggaman-Nya dan dalam kekuasaan-Nya. Bahkan hubungan mereka dengan yang lain terputus. Karena mereka menyesatkan yang lain pula. Yang demikian karena begitu bencinya mereka kepada kebenaran seakan-akan mereka orang yang tuli dan buta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 20",
    "description": "Setelah dijelaskan ancaman Allah terhadap orang-orang musyrik dengan siksa akhirat, kemudian Allah menjelaskan kekuasaan-Nya menurunkan siksaan di dunia dan akhirat. Mereka orang-orang kafir yang jauh dari rahmat Allah dalam kondisi apa pun tidak mampu menghalangi datangnya siksaan Allah di bumi. Dan ketika azab itu datang, tidak akan ada seorang pun bagi mereka baik di dunia maupun kelak di akhirat sebagai penolong yang mampu melindunginya selain Allah. Bahkan azab itu akan dilipatgandakan kepada mereka di akhirat disebabkan perbuatan durhaka yang mereka kerjakan, kemudian melanjutkan kedurhakaannya dengan menghalangi orang lain berbuat kebajikan, bahkan mendorongnya berbuat kesesatan. Mereka pun tidak mampu mendengar kebenaran seruan Al-Qur'an dan tidak dapat melihatnya disebabkan mereka tidak memanfaatkan anugerah yang diberikan Allah, karenanya hati mereka diliputi kemusyrikan dan kezaliman, bahkan mereka bersikap negatif terhadap seruan Al-Qur'an. (lihat: surah fushshilat/41:26)mereka (orang kafir) itulah orang yang merugikan dirinya sendiri karena membuat-buat kedustaan, menukar petunjuk dengan kesesatan, dan menjadikan berhala sebagai tuhan. Dan akibat perbuatan yang mereka lakukan, lenyaplah dari mereka apa yang selalu mereka ada-adakan, yaitu anggapan bahwa berhala dapat memberikan pertolongan bagi mereka."
  }
]