[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang merugikan diri mereka sendiri akibat kedustaan mereka atas nama Allah, dan telah hilang dari mereka apa yang dahulu mereka ada-adakan berupa tuhan-tuhan sesembahan yang mereka anggap dapat memberikan syafaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Orang-orang semacam itu adalah orang-orang yang telah merugikan diri sendiri karena telah menjerumuskan diri mereka ke dalam jurang kehancuran dengan cara menyembah tuhan-tuhan selain Allah. Dan musnahlah tuhan-tuhan dan penolong-penolong yang mereka buat-buat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Orang-orang itu telah merugikan diri mereka sendiri di akhirat, karena menjerumuskannya ke dalam kebinasaan, dan menyia-nyiakan kenikmatan yang kekal akibat keingkaran mereka. Dan jelas bagi mereka sekutu-sekutu yang mereka buat ternyata hanyalah khayalan. Mereka telah kehilangan penolong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أُو۟لٰٓئِكَ الَّذِينَ خَسِرُوٓا۟ أَنفُسَهُمْ (Mereka itulah orang-orang yang merugikan dirinya sendiri) Karena telah menyembah selain Allah dan menghalangi jalan-Nya. وضل عنهم ما كانوا يفترون (dan lenyaplah dari mereka apa yang selalu mereka ada-adakan) Yakni lenyaplah apa yang mereka ada-adakan berupa sesembahan yang mereka anggap akan memberi mereka syafaat, dan tidak ada yang tersisa di tangan mereka kecuali kerugian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Mereka orang-orang kafir yang telah disebut itulah orang-orang yang rugi atas dirinya sendiri, mereka telah menyia-nyiakan diri mereka sendiri dengan kekufuran dan kesesatan dari pada menyibukkan diri dalam petunjuk dan keimanan. Segala yang telah mereka ada-adakan berupa tuhan-tuhan mereka serta anggapan bahwa sesembahan mereka dapat menyelamatkan mereka di akhirat telah lenyap dari mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah orang-orang yang merugikan diri sendiri dan telah lenyap} telah hilang {dari mereka sesuatu yang selalu mereka ada-adakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21 “mereka itulah orang orang yang merugikan dirinya sendiri” dimana mereka menghilangkan pahala besar dan tertimpa siksa yang berat. ”dan lenyaplah dari mereka sesuatu yang selalu mereka ada adakan” maksudnya sirnalah agama yang mereka propagandakan dan mereka anggap baik. Tuhan yang mereka sembah selain Allah tidak memberi manfaat kepada mereka ketika keputusan Rabbmu telah tiba."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وضل عنهم ما كانوا يفترون) Wa dhalla ‘anhum maa kaanuu yaftaruun : Hilang dari mereka sesuatu yang diseru menjadi sekutu bagi Allah Ta’ala Makna ayat : Pembahasan ayat masih berkisar tentang ancaman bagi orang-orang berdosa dan keadaan mereka di akhirat kelak, Allah berfirman (أولئك) “Mereka” orang-orang yang terusir (الذين خسروا أنفسهم) “orang-orang yang merugikan dirinya sendiri” karena mereka akan menetap di dalam tempat kesengsaraan, dan kehilangan segalanya sampai diri mereka sendiri. (وضل عنهم ما كانوا يفترون) telah hilang apa yang mereka duga bahwa sesembahan kalian adalah sekutu bagi Allah, mampu memberikan syafaat, dan menolong mereka. Pelajaran dari ayat : • Bolehnya membandingkan sesuatu yang berlawanan sebagai pelajaran dan nasehat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 21: Karena mereka menolak pahala yang demikian besar dan mencari tempat kembali yang paling buruk, yaitu neraka dan mereka kekal di dalamnya, wal ‘iyaadz billah. Yakni seruan mereka, dan sesembahan yang mereka sembah selain Alah tidaklah berguna apa-apa bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 21",
    "description": "Mereka (orang kafir) itulah orang yang merugikan dirinya sendiri karena membuat-buat kedustaan, menukar petunjuk dengan kesesatan, dan menjadikan berhala sebagai tuhan. Dan akibat perbuatan yang mereka lakukan, lenyaplah dari mereka apa yang selalu mereka ada-adakan, yaitu anggapan bahwa berhala dapat memberikan pertolongan bagi mereka. Orang-orang tersebut, pasti mereka itu menjadi orang yang paling rugi, sengsara, dan tersiksa di akhirat, karena mereka menduga apa yang telah mereka lakukan dapat mengantar pada kebahagiaan, padahal ternyata sebaliknya. (lihat: surah al-kahf /18: 103-104)."
  }
]