[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan kepada rasulNya, mengerjakan amal-amal shalih dan tunduk kepada Allah dalam setiap perkara yang mereka diperintah untuk menjalankannya dan perkara yang mereka dilarang melakukannya, mereka itu adalah para penghuni surga, mereka tidak meninggal di dalamnya dan tidak keluar darinya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sesungguhnya orang-orang yang percaya kepada Allah dan Rasul-Nya, mengerjakan amal saleh, serta tunduk dan khusyuk kepada Allah mereka itulah para penghuni Surga yang akan tinggal di sana untuk selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Orang-orang yang beriman kepada Allah, para rasul-Nya, dan ayat-ayat-Nya, dan beramal shalih, serta bertaubat dan kembali kepada Allah, adalah orang-orang yang mendapat kedudukan yang tinggi di surga; mereka tidak meninggalkan surga dan tidak meresakan kematian dan penuaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَأَخْبَتُوٓا۟ إِلَىٰ رَبِّهِمْ (dan merendahkan diri kepada Tuhan mereka) Yakni mereka bertaubat dan tunduk kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-Nya serta mengerjakan amal-amal saleh dan merendahkan diri karena takut kepada Tuhan mereka, mereka itu adalah penghuni-penghuni surga; mereka kekal di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman dan beramal shalih serta merendahkan diri kepada Tuhan mereka} takut dan tunduk kepada Tuhan mereka {mereka itulah para penghuni surga. Mereka kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23 Allah berfirman ”sesungguhnya orang orang yang beriman” dengan hati mereka membenarkan dan menggakui apa yang diperintahkan Allah untuk beriman kepada pokok pokok dan dasar dasar agama “dan mengerjakan amal amal shalih” yang meliputi perbuatan perbuatan hati, anggota badan dan perkataan perkataan lisan, ”dan merendahkan diri kepada Rabb mereka” yakni mereka tunduk, pasrah dan takluk kepada kebesaran dan kekuasaanNya, mereka kembali kepadaNya dengan kecintan, ketakutan, harapan dan berseraah diri kepadaNya “mereka itu” orang orang yang mengumpulkan sifat sifat tersebut ”adalah penghuni penghuni surga. Mereka kekal didalamnya.” karena mereka tidak membiarkan kebaikan sebagai tuntutan melainkan pasti mereka mendapatkannya, dan tidak ada kebaikan melainkan mereka berlomba kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (و أخبتوا إلى ربهم) Wa akhbatuu ilaa rabbihim : tunduk kepada Rabb mereka, dengan ketaatan dan rasa takut. Makna ayat : Setelah menyebutkan keadaan orang-orang kafir dan apa yang mereka peroleh berupa kesengsaraan. Allah mengkabarkan keadaan orang beriman (إن الذين آمنوا و عملوا الصالحات) “Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal saleh” beriman kepada Allah; janji dan ancaman-Nya, rasul-Nya; ajarannya, dan beramal saleh sesuai dengan apa yang disyariatkan Allah berupa shalat dan zakat (وأخبتوا إلى ربهم) menyerahkan diri dan hati mereka, serta tunduk kepada-Nya, (أولئك) mereka lah penghuni surga (هم فيها خالدون) tidak akan keluar, tidak pula berpindah darinya. Inilah kandungan dari ayat yang ketiga (keadaan orang mukmin di akhirat kelak). Pelajaran dari ayat : • Penghuni negeri yang penuh kenikmatan—surga—adalah para ahli iman dan taat. Sedangkan penghuni negeri kesengsaraan—neraka—adalah orang-orang kafir dan zalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 23: Setelah Allah menyebutkan keadaan orang-orang yang celaka, maka pada ayat ini, Dia menyebutkan sifat orang-orang yang berbahagia, dan pahala yang akan mereka peroleh di sisi Allah Subhaanahu wa Ta'aala. Dengan hati mereka; apa yang diperintahkan Allah untuk diimani, seperti rukun iman yang enam. Baik yang terkait dengan hati, lisan maupun anggota badan. Patuh kepada-Nya, merendahkan diri kepada keagungan-Nya, tunduk kepada kekuasaan-Nya, kembali kepada-Nya dengan mencintai-Nya, takut dan berharap kepada-Nya serta bertadharru’ (memohon dengan rasa rendah diri) kepada-Nya. Karena tidak ada suatu kebaikan pun, kecuali mereka berusaha mengejar dan berlomba-lomba kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 23",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-Nya dan membuktikan kebenaran dan ketulusan iman mereka dengan mengerjakan kebajikan dengan tulus ikhlas, dan merendahkan diri menghadapkan wajahnya kepada tuhan pemelihara alam semesta. Mereka itu adalah penghuni surga yang tidak pernah keluar darinya, karena mereka kekal berada di dalamnya. Allah membuat perumpamaan sifat dan keadaan kedua golongan, yaitu golongan orang-orang kafir dan golongan orang-orang mukmin. Golongan orang kafir ibarat seperti orang buta mata kepala dan mata hatinya, sehingga tidak melihat tanda-tanda yang dapat menghantarkan ke jalan yang benar. Dan tuli telinganya, tidak mendengar sedikit pun tuntunan dan petuah-petuah agama. Adapun orang mukmin diibaratkandengan orang yang dapat melihatdengan mata kepala dan mata hatinya dan dapat mendengar dalam keadaan sempurna, karena mereka menggunakan penglihatan dan pendengarannya untuk memperhatikan, memahami, serta mengamalkan isi kandungan ayat-ayat Al-Qur'an. Samakah kedua golongan itu' tentu keduanya tidak sama. Maka dengan itu tidakkah kamu mengambil pelajaran' karena di balik perumpamaan terdapat pelajaran yang paling berharga."
  }
]