[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Perumpamaan antara dua golongan kafir dan golongan yang beriman, adalah seperti perumpamaan antara orang buta yang tidak dapat melihat lagi tuli yang tidak dapat mendengar dengan orang yang dapat melihat dan mendengar dengan normal. Golongan yang kafir tidak dapat melihat kebenaran untuk kemudian mereka ikuti, dan tidak mampu mendengar penyeru menuju kepada Allah sehingga kemudian mereka memperoleh petunjuk. Adapun golongan yang beriman, sungguh telah dapat melihat hujjah-hujah Allah dan mendengar seruan kepada Allah, lalu menyambutNya. Apakah sama antara dua golongan ini?. Apakah mereka mau mengambil pelajaran dan memikirkannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Perumpamaan golongan kafir dan golongan mukmin itu seperti orang buta yang tidak bisa melihat dan orang tuli yang tidak bisa mendengar. Ini adalah perumpamaan golongan kafir yang tidak mau mendengar dalam arti tidak mau menerima kebenaran dan tidak mau melihatnya untuk mengambil manfaatnya. Dan seperti orang yang bisa mendengar dan bisa melihat. Ini adalah perumpamaan golongan mukmin yang memiliki kemampuan untuk mendengar dan melihat. Apakah kedua golongan itu memiliki sifat dan keadaan yang sama? Tidak. Keduanya tidaklah sama. Tidakkah kalian mau mengambil pelajaran dari ketidaksamaan antara kedua golongan itu?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Dalam ayat ini Allah membuat perumpamaan orang kafir dengan orang buta dan tuli, karena dia tidak melihat dan mendengar ayat-ayat Allah. Dan membuat perumpamaan orang beriman dengan orang yang dapat melihat dan mendengar, karena dia melihat dan mendengar ayat-ayat tersebut dengan penuh perhatian. Dan Allah menjelaskan bahwa antara orang kafir dan orang beriman tidaklah sama, maka adakah orang yang mengambil pelajaran dari perumpamaan ini dan memahaminya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. مَثَلُ الْفَرِيقَيْنِ كَالْأَعْمَىٰ وَالْأَصَمِّ وَالْبَصِيرِ وَالسَّمِيعِ (Perbandingan kedua golongan itu (orang-orang kafir dan orang-orang mukmin), seperti orang buta dan tuli dengan orang yang dapat melihat dan dapat mendengar) Maka orang kafir seperti orang yang buta dan bisu, sedangkan orang mukmin seperti orang yang dapat melihat dan mendengar. هَلْ يَسْتَوِيَانِ(Adakah kedua golongan itu sama?) Yakni dalam keadaan dan sifatnya. أَفَلَا تَذَكَّرُونَ (Maka tidakkah kamu mengambil pelajaran) Agar mengetahui ketidaksamaan kedua golongan itu yang begitu jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Perbandingan golongan orang-orang kafir dan orang-orang mukmin adalah seperti orang buta dan tuli dari melihat dan mendengarkan kalam Allah dengan orang yang dapat melihat dan dapat mendengar sehingga bisa mentadaburi Alquran. Adakah keadaan dan sifat kedua golongan itu sama? Maka apakah kamu tidak mengambil pelajaran dari perbandingan itu?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan kedua golongan itu} golongan kafir dan golongan mukmin {seperti orang buta dan orang tuli dengan orang yang dapat melihat dan mendengar. Apakah kedua golongan itu sama. Apakah kalian tidak mengambil pelajaran} apakah mereka tidak mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24 “perbandingan kedua golongan itu (orang orang kafir dan orang orang mukmin)” yaitu kelompok orang orang yang sengsara dan orang orang yang berbahagia “seperti orang buta dan tuli” mereka adalah orang orang yang sengsara, “dengan orang yang dapat melihat dan mendengar” mereka adalah orang orang yang berbahagia, ”adakah kedua golongan itu sama keadaannya dan sifatnya?” perbandingan yang tidak sama, akan tetapi antara keduanya terdapat perbedaan yang sulit dijelaskan. ”maka tidakkah kamu mengambil pelajaran dari perbandingan itu?” perbuatan perbuatan yang berguna untukmu kamu melakukannya dan perbuatan perbuatan yang merugikan, kamu menjauhinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مثل الفريقين) matsalul fariiqaini : golongan yang beriman dan golongan yang kafir. (أفلا تذكرون) Afalaa tadzakkaruun : tidak kah kalian mengambil pelajaran, lalu kalian memohon ampun kepada Rabb kalian dan bertaubat? Makna ayat : Adapun ayat yang keempat (ayat 24) firman Allah (مثل الفريقين كالأعمى و الأصم و البصير السميع هل يستويان مثلا ) “Perbandingan kedua golongan itu (orang-orang kafir dan orang-orang mukmin), seperti orang buta dan tuli dengan orang yang dapat melihat dan dapat mendengar” Allah memberikan perbandingan antara ahli syirik dengan ahli tauhid, sebagai penjelasan makna dan penetapan hukum. (مثل الفريقين) Sifat kedua pihak tersebut bagaikan orang buta dan tuli –inilah golongan yang kafir, zalim— (و البصير والسميع) dan orang yang melihat lagi mendengar—inilah golongan orang yang beriman dan bertauhid. Oleh karena itu, apakah keduanya sama!? Jawabannya pasti tidak. Karena antara orang yang buta dan melihat, perbedaan yang jelas sebagaimana orang tuli dengan mendengar. Orang berakal macam apa yang rela disamakan dengan orang buta dan tuli, tapi tidak mau menjadi orang yang melihat dan mendengar ? Tentu tidak ada. Jadi (أفلا تذكرون) tidak kah kalian mengambil pelajaran dari perumpamaan ini, lalu bertaubat kepada Rabb kalian, beriman kepada-Nya men-tauhid-kan-Nya, beriman kepada rasul-Nya dan mengikutinya, serta beriman dan mempelajari kitab-Nya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 24: Yakni sifat. Inilah perumpamaan golongan yang kafir atau golongan yang celaka. Inilah perumpamaan golongan yang mukmin atau golongan yang berbahagia. Yakni mengingat amal yang bermanfaat bagimu, lalu kamu melakukannya dan mengingat amal yang merugikan kamu, lalu kamu meninggalkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 24",
    "description": "Allah membuat perumpamaan sifat dan keadaan kedua golongan, yaitu golongan orang-orang kafir dan golongan orang-orang mukmin. Golongan orang kafir ibarat seperti orang buta mata kepala dan mata hatinya, sehingga tidak melihat tanda-tanda yang dapat menghantarkan ke jalan yang benar. Dan tuli telinganya, tidak mendengar sedikit pun tuntunan dan petuah-petuah agama. Adapun orang mukmin diibaratkandengan orang yang dapat melihatdengan mata kepala dan mata hatinya dan dapat mendengar dalam keadaan sempurna, karena mereka menggunakan penglihatan dan pendengarannya untuk memperhatikan, memahami, serta mengamalkan isi kandungan ayat-ayat Al-Qur'an. Samakah kedua golongan itu' tentu keduanya tidak sama. Maka dengan itu tidakkah kamu mengambil pelajaran' karena di balik perumpamaan terdapat pelajaran yang paling berharga. Setelah menjelaskan ciri dan sifat-sifat orang mukmin dan orang kafir ketika mendapat seruan Al-Qur'an, serta kesudahan dari kedua golongan itu, selanjutnya Allah menceritakan kisah nabi nuh ketika menyeru kaumnya untuk mengikuti risalah Allah. Dan sungguh, kami telah mengutus nabi nuh kepada kaumnya untuk menyampaikan risalah kepada mereka seraya dia berkata, sungguh, aku ini adalah pemberi peringatan adanya siksa neraka yang nyata bagi kalian, serta pemberi penjelasan yang nyata menuju jalan keselamatan yang dapat menghindarkan kalian dari azab yang pedih."
  }
]