[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengutus Nuh kepada kaumnya, kemudian ia berkata kepada mereka, ”sesunggguhnya aku adalah pemberi peringatan bagi kalian dari siksaan Allah, yang menerangkan kepada kalian ajaran yang aku diutus membawanya kepada kalian, berupa perintah dan larangan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. \"Sungguh Kami telah mengutus Nuh -'alaihissalām- sebagai Rasul kepada kaumnya. Lalu dia berkata kepada mereka, 'Wahai kaumku! Sesungguhnya aku adalah seorang pemberi peringatan bagi kalian akan adanya azab Allah. Dan aku bertugas menjelaskan kepada kalian tentang ajaran yang harus kusampaikan pada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Sungguh Kami telah mengutus Nabi Nuh kepada kaumnya, sehingga dia menyampaikan risalah yang Allah berikan kepadanya: “Aku adalah pemberi peringatan bagi kalian dengan membawa penjelasan yang jelas dan aku menjelaskan bagi kalian jalan keselamatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَلَقَدْ أَرْسَلْنَا نُوحًا إِلَىٰ قَوْمِهِۦٓ (Dan sesungguhnya Kami telah mengutus Nuh kepada kaumnya) Yang berkata kepada kaumnya. إِنِّى لَكُمْ نَذِيرٌ مُّبِينٌ (Sesungguhnya aku adalah pemberi peringatan yang nyata bagi kamu) Pemberi peringatan yang diutus oleh Allah dan aku memiliki bukti bahwa aku adalah utusan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Sesungguhnya dulu Kami telah mengutus Nuh kepada kaumnya, dia berkata: “Sesungguhnya aku adalah pemberi peringatan atas adanya neraka jika kalian ingkar, serta menunjukkan jalan keselamatan dari azab.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah mengutus Nuh kepada kaumnya. “Sesungguhnya aku bagi kalian adalah pemberi peringatan yang nyata} pemberi peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25 “dan sesungguhnya kami telah mengutus Nuh” rasul pertama “kepada kaumnya” mengajak mereka kepada Allah dan melarang mereka berbuat syirik. Dia berkata “sesungguhnya aku adalah pemberi peringatan yang nyata bagimu” maksudnya, aku menjelaskan kepadamu sesuatu yang mana aku memperingatkanmu dengannya sebagai penjelasan yang menghilangkan kerancuan permasalahan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نوح) Nuuh : Nabi Nuh ‘alaihissalam, seorang hamba yang pandai bersyukur, bapaknya manusia yang kedua. (إني لكم نذير مبين) Inni lakum nadziirum mubiin : Memperingatkan kalian dari azab Allah. Makna ayat : Ini adalah awal dari kisah Nabi Nuh, yang mengawali lima kisah setelahnya di dalam surat Hud ini. Allah berfirman (ولقد نوحا إلى قومه إني لكم نذير مبين) Telah kami utus Nuh kepada kaum agar menyampaikan (إني لكم نذير مبين) aku memperingatkan kalian akan akibat buruk dari kekufuran kalian kepada Allah dan rasul-Nya, serta perilaku mensekutukan Allah dengan berhala kalian dalam hal ibadah. Pelajaran dari ayat : • Bahwa Nuh –namanya Abdul Ghaffar—adalah rasul pertama untuk penghuni bumi, setelah mereka berbuat syirik dan menyembah selain Allah berupa berhala dan sesembahan-sesembahan yang batil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 25: Jelas sehingga tidak menimbulkan kesamaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 25",
    "description": "Setelah menjelaskan ciri dan sifat-sifat orang mukmin dan orang kafir ketika mendapat seruan Al-Qur'an, serta kesudahan dari kedua golongan itu, selanjutnya Allah menceritakan kisah nabi nuh ketika menyeru kaumnya untuk mengikuti risalah Allah. Dan sungguh, kami telah mengutus nabi nuh kepada kaumnya untuk menyampaikan risalah kepada mereka seraya dia berkata, sungguh, aku ini adalah pemberi peringatan adanya siksa neraka yang nyata bagi kalian, serta pemberi penjelasan yang nyata menuju jalan keselamatan yang dapat menghindarkan kalian dari azab yang pedih. Nabi nuh memperingatkan akan beratnya siksaan yang akan menimpa orang-orang kafir, seraya menyarankan agar kamu tidak menyembah selain Allah tuhan yang maha esa dan mahakuasa. Aku benar-benar khawatir jika kalian tetap dalam kekafiran dan kemusyrikan itu kamu akan ditimpa azab pada hari yang sangat pedih, yaitu hari di mana Allah menurunkan azab-Nya di dunia maupun kelak di akhirat. Ketika azab itu datang, kalian tidak mampu menghindar dari azab itu dan tidak ada pula seorang penolong pun."
  }
]