[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka para tokoh kekafiran dari kaumnya berkata, ”sesungguhnya kamu itu bukanlah malaikat, akan tetapi seorang manusia biasa. Mengapa diturunkan wahayu kepadamu, sementara kami tidak? dan kami tidaklah melihat orang yang mengikutimu, kecuali orang-orang rendah diantara kami. Orang-orang itu hanya mengikutimu tanpa berpikir panjang dan pengamatan seksama. Dan kami tidak melihat kalian memiliki keistimewaan di atas kami dalam soal rizki dan kekayaan harta, ketika kalian memeluk agama kalian itu. Bahkan kami meyakini bahwa kalian itu adalah para pendusta dengan apa yang kalian klaim”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Maka para pemuka dan para kaumnya berkata, \"Kami tidak akan mengikuti ajakanmu, karena kamu tidak punya kelebihan apapun atas kami. Kamu hanya manusia biasa seperti kami. Dan kami tidak melihat orang-orang yang mengikutimu kecuali orang-orang jelata dalam pandangan kami . Di samping itu kamu juga tidak mempunyai kehormatan, kekayaan dan jabatan yang lebih tinggi dari kami yang bisa membuatmu layak kami ikuti. Bahkan kami menduga bahwa kamu berdusta tentang pengakuanmu itu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Namun orang-orang kafir dari kaumnya menjawab: “Kami tidak menganggapmu melainkan sebagai manusia seperti kami, tidak ada keistimewaan yang kamu miliki.” Mereka menganggap bahwa kedudukan untuk menjadi seorang rasul tidak dapat diraih oleh seorang manusia. Mereka juga berpaling dari orang-orang yang beriman kepadanya, dengan melihat mereka dengan pandangan yang menghinakan dan meremehkan. Mereka angkuh terhadap Nabi Nuh dan para pengikutnya dan menghina dakwahnya dengan berkata: “Dan kami tidak melihat orang-orang yang mengikutimu kecuali orang-orang lemah dan miskin serta orang-orang rendahan lainnya; mereka mengikutimu karena kebodohan mereka dan tanpa memikirkan apa yang yang kami pahami! Kami tidak melihat kalian memiliki rezeki dan kedudukan sehingga kalian mendapatkan petunjuk yang tidak kami dapatkan, akan tetapi kami melihat kalian adalah orang-orang yang berbohong.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَقَالَ الْمَلَأُ الَّذِينَ كَفَرُوا۟ مِن قَوْمِهِۦ (Maka berkatalah pemimpin-pemimpin yang kafir dari kaumnya) Makna (الملأ) yakni para pembesar mereka. Orang-orang itu menanggapi Nabi Nuh dengan jawaban yang menunjukkan ketidakpercayaan mereka terhadap kenabiannya dengan tiga alasan: 1. perkataan mereka: “Kami tidak melihat kamu, melainkan (sebagai) seorang manusia (biasa) seperti kami” Yakni kamu tidak memiliki keistimewaan atas kami (sama-sama sebagai manusia) sehingga kamu berhak menjadi nabi sedangkan kami tidak. 2. perkataan mereka: “dan kami tidak melihat orang-orang yang mengikuti kamu, melainkan orang-orang yang hina dina di antara kami” Yakni tidak ada pemimpin mereka yang mengikuti kamu. Dan makna “الأراذل” yakni orang-orang miskin dan orang-orang yang tidak memiliki derajat serta orang-orang terpinggirkan. Yakni kamu tidak memiliki keistimewaan atas kami dengan orang-orang yang hina itu menjadi pengikutmu sebab mereka tidak dapat memahami kesalahan dari perkataan yang mereka dengar, namun mereka mengikuti begitu saja orang yang menyeru mereka kepada agama baru tanpa memahaminya. بَادِىَ الرَّأْىِ (yang lekas percaya saja) Yakni mereka mengikutimu begitu saja tanpa mendalami dan memastikan kebenaran kenabianmu. 3. perkataan mereka: \"dan kami tidak melihat kamu memiliki sesuatu kelebihan apapun atas kami” Yakni kami tidak menganggapmu dan orang-orang hina yang mengikutimu memiliki kelebihan atas kami sehingga kalian menjadi lebih baik dari kami dan lebih berhak atas pengakuanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Maka pemimpin-pemimpin kaum yang kafir berkata: “Kami tidak melihat kamu, melainkan sebagai tiga hal, yaitu sebagai seorang manusia biasa seperti kami, sehingga engkau tidak layak bergelar nabi. Kedua, kami tidak melihat para pengikutmu melainkan hanya kumpulan orang-orang yang miskin dan hina dina di antara kami yang terlalu terburu-buru percaya. Sehingga engkau tidak mempunyai keistimewaan apapun menurut kami. Ketiga kami tidak melihatmu memiliki sesuatu kelebihan apapun atas kami, bahkan kami yakin bahwa kamu adalah orang-orang yang dusta”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu para pemuka} pemuka dan pemimpin {orang kafir dari kaumnya berkata,“ Kami tidak melihatmu melainkan hanya seorang manusia seperti kami. Kami tidak melihat orang yang mengikutimu, melainkan orang-orang yang hina di antara kami} orang-orang yang hina di antara kami {yang lekas percaya} pendapat yang mereka perlihatkan kepada kami {Kami tidak melihat kamu memiliki kelebihan atas kami, bahkan kami menganggap kalian adalah para pembohong.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27 “Maka berkatalah pemimpin pemimpin yang kafir dari kaumnya” yakni orang orang terhormat dan para pembesar kaumnya menolak dakwah nuh sebagaimana kebiasaan yang berlaku pada orang seperti mereka bahwa merekalah yang pertama kali menolak dakwah para rasul ”kami tidak melihatmu, melainkan (sebagai) seorang manusia (biasa) seperti kami” ini adalah penghalang menurut mereka untuk mengikutinya, padahal sebenarnya itulah yang benar yang tidak ada kebenaran selainnya, karena manusia hanya mungkin belajar dari manusia dan berdialog dengannya dalam segala urusan, lain halnya dengan malaikat. ”dan kami tidak melihat orang orang yang mengikutimu hanyalah orang-orang yang hina lagi rendah diantara kami\", yakni, kami tidak melihat orang-orang yang mengikutimu kecuali hanyalah orang-orang yang rendah dari kami (menurut sangkaan mereka). padahal sebenarnya mereka adalah orang orang yang mulia dan manusia yang berakal yang tunduk kepada kebenaran. Mereka bukan orang orang hina lagi rendah seperti yang dibilang oleh pembesar pembesar kaum yang mengikuti semua setan yang Bengal dan mengangkat tuhan tuhan dari batu dan pohon lalu mereka mendekatkan diri kepadanya dan bersujud. Apakah kamu tahu ada yang lebih hina dan rendah daripada mereka? ucapan mereka, ”yang lekas percaya saja” maksudnya, mereka hanya mengikutimu tanpa berpikir dan menimbang, tetapi hanya disebabkan kamu mengajak mereka, langsung mereka mengikutimu. Maksud mereka dengan itu adalah bahwa mereka bukanlah orang orang yang mengetahui urusan. Mereka tidak mengetahui bahwa akal yang spontan mengajak kepada ulul albab, mereka langsung mengenali dan mengetahuinya, tidak seperti perkara yang samar yang memerlukan pemikiran dan perenungan panjang. “dan kami tidak melihatmu memiliki sesatu kelebihan apapun atas kami” maksudnya, kamu tidak lebih baik daripada kami yang membuat kami tunduk kepadamu. ”bahkan kami yakin bahwa kamu adalah orang orang yang dusta” mereka berbohong dalam ucapan mereka. Ini karena mereka telah melihat ayat ayat yang Allah jadikan sebagai dukungan bagi Nuh yang membuat mereka merasa yakin dengan pasti terhadap kebenarannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (الملأ) Al-Mal’u : Orang-orang terpandang dan pemegang kekuasaan di suatu negeri. (أراذلنا) Araadzilunaa : Plural dari (أرذل) orang-orang rendahan. (بادي الرأي) Baadiyarra’yi : Akalnya dangkal, tidak bisa berfikir. Makna ayat : . (فقال الملأ الذين كفروا من قومه) para petinggi kaumnya yang ingkar kepada Allah dan rasul-Nya membantah Nuh seraya berkata: (ما نراك إلا بشرا مثلنا) engkau tidak memiliki kelebihan atas kami, bagaimana bisa engkau menjadi seorang rasul, sedangkan engkau sama dengan kami—itu yang pertama, lalu yang kedua (وما نراك اتبعك إلا الذين هم أراذلنا) “dan kami tidak melihat orang-orang yang mengikuti kamu melainkan orang-orang yang hina dina di antara kami “ orang-orang rendahan berprofesi rendahan, tukang bekam, tukang daging, dan yang sejenisnya. Perkataan mereka (و ما نرى لكم علينا من فضل) tidaklah kami melihat kalian punya kelebihan, sehingga kami harus menjadi pengikut kalian, kemudian meninggalkan agama kami, mengikuti agama kalian, bahkan kami menganggap kalian itu pendusta. Pelajaran dari ayat : • Pengikut para Rasul adalah orang-orang fakir dan lemah. Sedangkan musuh mereka adalah orang-orang kaya dan terpandang. • Orang-orang terpandang meremehkan yang dibawah mereka. Dan dalam hadits (الكبر بطر الحق و غمط الناس) “Kesombongan adalah menolak kebenaran dan meremehkan orang lain.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 27: Menurut mereka, keadaan sebagai manusia merupakan penghalang bagi mereka untuk mengikutinya, padahal sesungguhnya rasul itu harus dari kalangan manusia agar orang lain dapat menimba ilmu darinya, mudah untuk bertanya-tanya serta dapat mengikutinya, berbeda jika dari kalangan malaikat. Padahal sesungguhnya merekalah orang-orang yang mulia dan menggunakan akalnya, sebaliknya para pemuka itulah orang-orang yang hina dan kurang akal karena mengikuti setan yang durhaka, menjadikan tuhan dari batu dan pohon yang keadaannya lebih lemah dari mereka, di mana mereka mendekatkan diri dan sujud kepadanya. Siapakah yang lebih hina dan kurang akal dari orang yang seperti ini keadaannya? Kebenaran yang jelas memang harus segera diterima tanpa perlu ditunda, berbeda jika perkaranya masih samar yang butuh pemikiran yang dalam. Yang mengharuskan kami mengikutimu. Dalam pengakuan sebagai rasul. Padahal sesungguhnya mereka yang berdusta, karena mereka telah melihat ayat-ayat yang menunjukkan kebenaran Nabi Nuh ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 27",
    "description": "Mendengar ajakan nabi nuh untuk mengesakan Allah dan tidak menyekutukan-Nya, maka berkatalah para pemuka yang kafir dari kaumnya seraya mengemukakan beberapa alasan, kami tidak melihat engkau sebagai seorang utusan Allah, melainkan hanyalah seorang manusia biasa yang tidak punya kelebihan dan keistimewaan seperti kami yang memiliki kedudukan tinggi dan status sosial di masyarakat. Dan kami pun tidak melihat orang yang mengikuti engkau, melainkan orang yang kedudukannya hina dina di antara kami yang tidak memiliki harta kekayaan dan kedudukan di masyarakat sehingga mudah dibujuk dan lekas percaya menerima ajakanmu. Kami juga tidak melihat engkau memiliki suatu kelebihan apa pun baik ilmu pengetahuan, kekayaan, atau keistimewaan yang luar biasa yang dapat kamu banggakan atas kami sehingga dapat memikat dan mendorong kami mengikuti seruanmu. Bahkan atas alasan itu semua, kami menganggap engkau adalah orang pendusta. Setelah menjelaskan bantahan-bantahan kaum nabi nuh yang tidak menerima ajakan menuju jalan yang benar, yaitu menyembah Allah, pada ayat ini dijelaskan tentang jawaban-jawaban nabi nuh kepada kaumnya. Dia (nabi nuh) berkata, wahai kaumku! apa pendapatmu jika aku mempunyai bukti yang nyata dan terang dari tuhanku bahwa aku benar-benar diutus oleh Allah, dan aku diberi rahmat dari sisi-Nya berupa kenabian dan risalah yang mengandung keutamaan di dalamnya, sedangkan rahmat berupa keterangan dan dalil-dalil itu disamarkan, yakni tidak tampak bagimu disebabkan kalian mengikuti hawa nafsu dan berpaling dari petunjuk. Apa kami akan memaksa kamu untuk menerimanya, padahal kamu tidak menyukainya' tugas kami hanya menyampaikan ajaran yang benar, dan kami menyerahkan urusan kalian kepada Allah."
  }
]