[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nuh berakata, ”wahai kaumku, apa pendapat kalian bila aku berada diatas hujjah yang nyata dari tuhanku terkait risalah yang aku bawa kepada kalian, yang menerangkan kepada kalian bahwa sesungguhnya aku berada di atas petunjuk yang benar dari sisiNya, dan Dia memberikan kepadaku rahmat dari sisinya, yaitu berupa kenabian dan kerasulan? Dia menutupinya dari kalian karena kebodohan kalian dan kesilauan kalian terhadap keadaan kalian. Apakah pantas aku menekan kalian untuk menerimanya dengan pemaksaan, sedang kalian mengingkarinya? kami tidak mau melakukan hal itu. Akan tetapi, kami serahkan urusan kalian kepada Allah hingga Dia memutuskan urusan kalian sesuai dengan kehendakNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Nuh berkata kepada kaumnya, \"Wahai kaumku! Katakan padaku, jika aku memiliki bukti dari Tuhanku yang menunjukkan kebenaranku dan menuntut kalian percaya kepadaku, dan Dia memberiku rahmat dari sisi-Nya dengan menjadikanku sebagai Nabi dan Rasul-Nya, dan hal itu tidak kalian ketahui karena kebodohan kalian, apakah kami bisa memaksa kalian untuk beriman dan memasukkan iman itu ke dalam hati kalian? Kami tidak akan sanggup melakukan hal itu. Karena yang dapat membimbing manusia ke dalam iman adalah Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Kemudian Nabi Nuh menyeru mereka dengan lembut: “Hai kaumku, bagaimana menurut kalian jika aku mendapat cahaya dan petunjuk dari Tuhanku, mengistimewakanku dengan rahmat-Nya, dan memilihku sebagai seorang Rasul; namun itu semua tidak kalian ketahui atau tersembunyi dari kalian sehingga kalian tidak dapat melihat dan memahaminya. Apakah kemudian aku harus memaksa kalian untuk menempuh jalan ini, sedangkan kalian enggan dan berpaling darinya?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. قَالَ يٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى (Berkata Nuh: “Hai kaumku, bagaimana pikiranmu, jika aku ada mempunyai bukti yang nyata dari Tuhanku) Yakni beritahukanlah aku jika aku memang memiliki bukti dari Tuhanku tentang kebenaran kenabianku yang menjadikan dapat menerimanya. وَءَاتَىٰنِى رَحْمَةً مِّنْ عِندِهِۦ(dan diberinya aku rahmat dari sisi-Nya) Yakni berupa kenabian. فَعُمِّيَتْ(tetapi rahmat itu disamarkan) Disembunyikan. أَنُلْزِمُكُمُوهَا (Apa akan kami paksakankah kamu menerimanya) Apakah mungkin bagi kami untuk memaksa kalian dan memasukkan keimanan ke dalam hati kalian dengan paksaan. وَأَنتُمْ لَهَا كٰرِهُونَ (padahal kamu tiada menyukainya?) Tanpa menghayatinya. Dan tidak ada yang dapat kalian beriman kecuali Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Nuh berkata: “Hai kaumku, bagaimana menurut kalian jika aku mempunyai bukti yang nyata dari Tuhanku atas kebenaran kenabianku., Aku tidak sama dengan manusia biasa lainnya yang tidak mendapat anugerah kebabian. Aku dianugerahi rahmat dari sisi-Nya berupa kenabian dan risalah, tetapi rahmat itu disamarkan bagi kalian. Lali apakah akan kami paksakan kepada kalian untuk menerima dan beriman kepada Allah, bahkan kalian pun tidak menyukai dan tidak mengambil pelajaran darinya? Itu telah menunjukkan bahwa tidak ada yang kuasa kecuali Allah, dan kami tidak mampu berbuat sesuai apa yang kami kehendaki.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia} Nuh {berkata,“Wahai kaumku, apa pendapat kalian} terangkanlah kepadaku {jika aku mempunyai bukti nyata} bukti {dari Tuhanku dan Dia menganugerahiku rahmat} kenabian dan risalah {dari sisiNya, lalu disamarkan bagi kalian} lalu disembunyikan dari penglihatan kalian {Apakah kami akan memaksa kalian untuk menerimanya} apakah kami akan memaksa kalian untuk menerimanya {sedangkan kalian tidak menyukainya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28 Oleh karena itu, ”Nuh berkata” kepada mereka menanggapi “hai kaumku, bagaimana pendapatmu, jika aku sudah mempunyai bukti yang nyata dari Rabbku” maksudnya berada diatas keyakinan dan kepastian, yakni dia adalah Rasul yang sempurna dan teladan yang ditaati oleh orang orang yang berakal. Akal tokoh tokoh besar dibanding akal Nuh adalah kecil. Dia adalah orang orang yang benar jujur, maka jika dia berkata ”sesungguhnya aku mempunyai bukti yang nyata dari Rabbku” cukuplah ucapan ini sebagai bukti dan saksi atas kebenarannya ”dan dia memberiku rahmat disisiNya” maksudnya, Dia memberiku wahyu, mengangkatku menjadi rasul dan memberiku nikmat hidayah. ”Tetapi rahmat itu disamarkan bagimu” maksudnya, disamarkan atas kalian, \"apakah kami akan memaksamu atasnya\", maksudnya, apakah kami akan memaksamu atas sesuatu yang jelas bagi kami sementara kamu masih ragu padanya \"dan kamu tidak menyukainya\" sehingga kamu berusaha menolak sesuatu yang aku bawa? Itu semua tidak merugikan kami dan tidak menodai keyakinan kami sedikitpun. Ucapan dan dustamu atas kami, tidak menghalangi kami dari sesuatu yang kami imani, paling paling ia justru menjadi penghalang bagimu yang mengakibatkan kamu menolak tunduk kepada kebenaran yang menurutmu adalah kebatilan. Jika keadaannya telah sampai disini maka kami tidak kuasa memaksamu kepada perintah Allah dan mewajibkanmu kepada sesuatu yang kamu lari darinya. Oleh karena itu, dia berkata, ”apa akan kami paksakan kamu menerimanya padahal kamu tiada menyukainya?”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أرأيتم) Ara aitum : Kabarkanlah kepadaku. (على بيتة من ربي) ‘Alaa bayyinatim mirrabii : Di atas ilmu dari Allah, sehingga aku tahu bahwa tidak ada sesembahan yang berhak disembah kecuali Allah. (فعميت عليكم) Fa’amiyat ‘alaikum : Tersembunyi dari kalian sehingga tidak melihatnya. (أنلزمكموها) Anulzimukumuuha : Memaksa kalian untuk menerimanya. Makna ayat : Ayat-ayat ini masih menjelaskan kisah Nabi Nuh bersama kaumnya. Allah menceritakan bahwa Nuh berkata kepada kaumnya (أرأيتم) kabarkan kepada ku (إن كنت على بينة من ربي) aku berada di atas ilmu yang pasti tentang sifat-sifat-Nya yang tinggi, segala yang Dia perintahkan kepadaku berupa ibadah, tauhid, dakwah, dan sebagainya. (فعميت عليكم) tertutup bagi kalian, tidak melihatnya. Lalu apa yang harus aku lakukan (أنلزمكموها) apakah aku paksa kalian dan yang beriman kepada ku untuk memperhatikannya dan beriman serta mengamalkannya (و أنتم لها كارهون) sedangkan kalian benci terhadapnya –orang yang tidak suka terhadap sesuatu tidak akan peduli kepada hal yang ia benci. Inilah yang ditunjukkan ayat yang pertama (ayat 27) Pelajaran dari ayat : • Kebencian seseorang terhadap sesuatu akan menjadikannya enggan melihat, mendengar, dan tidak ingin memahami apa yang dikatakan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 28: Kata-kata ini sesungguhnya sudah cukup sebagai persaksiannya. Kebencian mereka itulah yang menghalangi mereka dari tunduk kepada kebenaran sehingga tidak mungkin mereka dipaksa untuk menerimanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 28",
    "description": "Setelah menjelaskan bantahan-bantahan kaum nabi nuh yang tidak menerima ajakan menuju jalan yang benar, yaitu menyembah Allah, pada ayat ini dijelaskan tentang jawaban-jawaban nabi nuh kepada kaumnya. Dia (nabi nuh) berkata, wahai kaumku! apa pendapatmu jika aku mempunyai bukti yang nyata dan terang dari tuhanku bahwa aku benar-benar diutus oleh Allah, dan aku diberi rahmat dari sisi-Nya berupa kenabian dan risalah yang mengandung keutamaan di dalamnya, sedangkan rahmat berupa keterangan dan dalil-dalil itu disamarkan, yakni tidak tampak bagimu disebabkan kalian mengikuti hawa nafsu dan berpaling dari petunjuk. Apa kami akan memaksa kamu untuk menerimanya, padahal kamu tidak menyukainya' tugas kami hanya menyampaikan ajaran yang benar, dan kami menyerahkan urusan kalian kepada Allah. Dan selanjutnya nabi nuh berkata kepada kaumnya, wahai kaumku! aku tidak meminta harta kepada kalian sebagai imbalan atas seruanku agar kalian mengikuti jalan yang benar. Imbalanku hanyalah dari Allah yang memberi tugas kepadaku, aku pun bertawakal kepada-Nya. Dan aku sekali-kali tidak akan mengusir orang yang telah beriman kepadaku hanya karena mereka kaum yang lemah dan bukan golongan terpandang lagi kaya raya. Sungguh, mereka akan bertemu dengan tuhannya setelah dibangkitkan untuk menerima imbalan pahala atas keimanan mereka. Dan sebaliknya aku memandangmu sebagai kaum yang bodoh karena selalu mengukur kebenaran dari sisi materi, sehingga kalian menginginkan kami mengusir orang-orang fakir duduk bersama-sama dengan kami, sementara keimananmu baru sebatas janji belaka."
  }
]