[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mintalah oleh kalian kepadaNya agar berkenan mengampuni dosa-dosa kalian, kemudian bertaubatlah kepadaNYa dalam keadaan menyesal, niscaya Dia akan memberikan kesenangan di dunia dengan kesenanagn yang baik berupa kehidupan yang baik di dalamnya, sampai waktu datangnya ajal kalian. Dan memberikan kepada setiap yang memiliki keutamaan dari ilmu maupun amal balasan keutamaannya itu secara sempurna, tidak ada pengurangan sedikitpun padanya. Dan apabila kalian berpaling dari seruan yang aku seru kalian padanya, maka sesungguhnya aku khawatir akan menimpa kalian siksaan hari yang amat pedih, yaitu siksaan hari kiamat. Ini merupakan bentuk ancaman keras terhadap orang yang berpaling dari perintah-perintah Allah dan mendustakan rasul-rasaulNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Mintalah -wahai manusia- ampunan dari Tuhan kalian atas dosa-dosa kalian. Kembalilah kepada-Nya dengan penyesalan atas keteledoran kalian dalam menjalankan perintah-Nya, niscaya Dia akan memberi kalian kenikmatan hidup yang baik di dunia sampai ajal menjemput kalian pada waktu yang telah ditentukan. Dan Dia akan memberikan balasan yang sempurna tanpa dikurangi sedikitpun kepada setiap orang yang memiliki kelebihan dalam menjalankan ketaatan kepada-Nya. Dan jika kalian enggan beriman kepada ajaran yang kubawa dari Tuhanku, sesungguhnya aku benar-benar khawatir bahwa kalian akan mendapatkan azab yang berat di Hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan mintalah kalian ampunan dari Pencipta kalian atas segala dosa, dan bertaubatlah dengan sebenar-benarnya; niscaya Allah akan memberi kalian kehidupan yang baik, keselamatan, keistiqamahan dalam ketaatan-Nya hingga ajal kalian datang, dan menjadikan kalian umat yang paling baik kekuatan, ilmu, pertahanan, dan kenikmatannya. Allah akan membalas setiap orang sesuai dengan amalannya dengan balasan di dunia dan di akhirat; karena kedudukan di dunia dan di akhirat berbeda-beda sesuai dengan amal perbuatan. Dan jika kalian berpaling dari hidayah dan penjelasan yang aku sampaikan, maka aku khawatir kalian akan mendapat kesudahan yang buruk dan azab yang pedih pada hari yang sangat mengerikan dan menakutkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَأَنِ اسْتَغْفِرُوا۟ رَبَّكُمْ ثُمَّ تُوبُوٓا۟ إِلَيْهِ (dan hendaklah kamu meminta ampun kepada Tuhanmu dan bertaubat kepada-Nya) Allah mendahulukan penyebutan permohonan ampun karena ampunan merupakan tujuan utamanya, sedangkan taubat adalah sebab yang mengantarkan kepada ampunan. Pendapat lain mengatakan, yakni mohonlah ampun dari dosa-dosa kecil dan bertaubatlah dari dosa-dosa besar. يُمَتِّعْكُم مَّتٰعًا حَسَنًا(niscaya Dia akan memberi kenikmatan yang baik kepadamu) Berupa rejeki yang luas dan kehidupan yang lapang. إِلَىٰٓ أَجَلٍ مُّسَمًّى(sampai kepada waktu yang telah ditentukan) Sampai waktu yang ditentukan oleh Allah, yaitu kematian. وَيُؤْتِ كُلَّ ذِى فَضْلٍ(dan Dia akan memberikan kepada tiap-tiap orang yang mempunyai keutamaan) Keutamaan dalam ketaatan dan amal shaleh. فَضْلَهُۥ ۖ((balasan) keutamaannya) Baik itu di dunia maupun di akhirat, atau juga kedua-duanya. وَإِن تَوَلَّوْا۟(Jika kamu berpaling) Yakni jika kalian berpaling dari beribadah kepada Allah, memohon ampun, dan taubat. فَإِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيرٍ (maka sesungguhnya aku takut kamu akan ditimpa siksa di hari yang besar) Yakni hari kiamat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Di banyak ayat dalam al-qur'an kata \"Istighfar\" sering disandingkan dengan kata \"Taubat\", oleh karena itu \"istighfar\" diibaratkan sebagai permohonan ampunan dengan lisan, sedangkan taubat diibaratkan dengan permohonan perlepasan diri dari segala dosa denga hati dan anggota badan. 2 ). Ibnul Qayyim menyebutkan ada empat ayat dalam al-qur'an Allah mengakatakan di dalamnya bahwasanya Dia memberi balasan bagi muhsinin dengan kebajikannya dua balasan : yaitu balasan kebaikan di dunia dan balasan kebajikan di akhirat. Keempat ayat itu adalah : { وَأَنِ اسْتَغْفِرُوا رَبَّكُمْ ثُمَّ تُوبُوا إِلَيْهِ يُمَتِّعْكُمْ مَتَاعًا حَسَنًا إِلَىٰ أَجَلٍ مُسَمًّى وَيُؤْتِ كُلَّ ذِي فَضْلٍ فَضْلَهُ } \"Dan hendaklah kamu meminta ampun kepada Tuhanmu dan bertaubat kepada-Nya. (Jika kamu mengerjakan yang demikian), niscaya Dia akan memberi kenikmatan yang baik (terus menerus) kepadamu sampai kepada waktu yang telah ditentukan dan Dia akan memberikan kepada tiap-tiap orang yang mempunyai keutamaan (balasan) keutamaannya\". { وَالَّذِينَ هَاجَرُوا فِي اللَّهِ مِنْ بَعْدِ مَا ظُلِمُوا لَنُبَوِّئَنَّهُمْ فِي الدُّنْيَا حَسَنَةً ۖ وَلَأَجْرُ الْآخِرَةِ أَكْبَرُ ۚ لَوْ كَانُوا يَعْلَمُونَ } \"Dan orang-orang yang berhijrah karena Allah sesudah mereka dianiaya, pasti Kami akan memberikan tempat yang bagus kepada mereka di dunia. Dan sesungguhnya pahala di akhirat adalah lebih besar, kalau mereka mengetahui\" [ An-Nahl : 41 ] { مَنْ عَمِلَ صَالِحًا مِنْ ذَكَرٍ أَوْ أُنْثَىٰ وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً ۖ وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ } \"Barangsiapa yang mengerjakan amal saleh, baik laki-laki maupun perempuan dalam keadaan beriman, maka sesungguhnya akan Kami berikan kepadanya kehidupan yang baik dan sesungguhnya akan Kami beri balasan kepada mereka dengan pahala yang lebih baik dari apa yang telah mereka kerjakan\" [ An-Nahl : 97 ] { قُلْ يَا عِبَادِ الَّذِينَ آمَنُوا اتَّقُوا رَبَّكُمْ ۚ لِلَّذِينَ أَحْسَنُوا فِي هَٰذِهِ الدُّنْيَا حَسَنَةٌ ۗ وَأَرْضُ اللَّهِ وَاسِعَةٌ ۗ إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُمْ بِغَيْرِ حِسَابٍ } \"Katakanlah: “Hai hamba-hamba-Ku yang beriman. bertakwalah kepada Tuhanmu”. Orang-orang yang berbuat baik di dunia ini memperoleh kebaikan. Dan bumi Allah itu adalah luas. Sesungguhnya hanya orang-orang yang bersabarlah Yang dicukupkan pahala mereka tanpa batas\" [ Az-Zumar : 10 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3 Hendaklah kamu meminta ampun kepada Allah atas dosa-dosa dan kekufuran kalian, bertaubat dan kembali kepada-Nya dengan berbuat taat. Jika kamu mengerjakan yang demikian, niscaya Dia akan memberi kalian kenikmatan di dunia dengan kebaikan hidup dan keluasan rejeki sampai kepada waktu yang telah ditentukan di sisi Allah yaitu kematian dan akhir umur. Dia akan memberikan kepada tiap-tiap orang baik yang beramal baik dengan balasan berupa keutamaan dan pahala amal tersebut di dunia dan akhirat. Jika kamu berpaling dari hidayah, maka sesungguhnya aku khawatir, kamu akan mendapatkan siksa pada hari kiamat, yaitu azab yang sangat dahsyat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mohonlah ampunan kepada Tuhan kalian kemudian bertaubatlah kepadaNya} kembalilah kepadaNya dengan penuh penuh penyesalan {maka Dia akan memberi kesenangan kepada kalian dengan kenikmatan yang baik} memberi kalian kehidupan yang baik berupa kelapangan rejeki dan kesejahteraan hidup {sampai waktu yang telah ditentukan} sampai waktu selesainya ajal kalian {dan memberikan kepada setiap orang yang beramal shalih karuniaNya} memberi setiap orang yang beramal shalih di dunia balasan amalnya itu di akhirat {Jika kalian berpaling} berpaling {sesungguhnya aku takut kalian ditimpa azab pada hari yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “Dan hendaklah kamu meminta ampun kepada Rabbmu”, dari dosa-dosa yang kamu kerjakan, “dan bertaubat kepadaNya”, pada (sisa) umurmu yang kamu hadapi dengan kembali dan mendekatkan diri kepadaNya, meninggalkan sesuatu yang dibenci Allah kepada sesuatu yang dicintai dan diridhaiNya. Kemudian Allah menyebutkan akibat dari istigfar dan taubat, seraya Dia berfirman, “Niscaya Dia akan memberi kenikmatan yang baik (terus menerus) kepadamu.” Maksudnya, Dia memberimu rizki yang bisa kamu nikmati dan manfaatkan, “sampai waktu yang telah ditentukan.” Yakni sampai kamu mati. “Dan Dia akan memberi kepada tiap-tiap orang yang mempunyai keutamaan (balasan) keutamaannya.” Maksudnya, Allah memberikan karunia dan kebaikanNya kepada ahli kebaikan dan kebajikan sebagai balasan atas kebaikannya dalam bentuk kebaikan yang mereka raih dan keburukan yang dijauhkan. “Jika kamu berpaling,” dari apa yang aku dakwahkan kepadamu, kamu berpaling bahkan kamu mungkin mendustakan, “maka sesungguhnya aku takut kamu akan ditimpa siksa Hari Kiamat.” Yaitu Hari Kiamat yang padanya Allah mengumpulkan orang-orang terdahulu dan yang datang kemudian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَتَاعًا حَسَنًا) Mataa’an hasanan : Kehidupan yang bahagia dan rizki yang luas. (إِلَى أَجَلٍ مُسَمًّى) Ilaa ajalim musamman : Sampai ajalnya, kematian. (وَ يُؤْتِ كَلَّ ذِيْ فَضْلٍ) Wa yu’ti kulla dzii fadhlin : membalas setiap amal yang saleh dengan ganjaran yang mulia. Makna ayat : (وَأَنِ ٱسۡتَغۡفِرُواْ رَبَّكُمۡ ثُمَّ تُوبُوٓاْ إِلَيۡهِ يُمَتِّعۡكُم مَّتَٰعًا حَسَنًا إِلَىٰٓ أَجَلٖ مُّسَمّٗى) Mohonlah ampun kepada Rabb kalian dengan pengakuan atas kesalahan kalian karena beribadah kepada selain-Nya. Kemudian bertaubatlah dengan beriman kepada-Nya juga rasul-Nya, janji dan ancaman-Nya, serta dengan mentaati perintah dan larangan-Nya. Untuk kalian pahala atas hal tersebut, dengan memberikan kalian kebahagiaan di dunia ini, dengan kenikmatan yang banyak dan kebaikan yang melimpah hingga akhir kehidupan mereka. Firman-Nya (وَيُؤۡتِ كُلَّ ذِي فَضۡلٖ فَضۡلَهُۥۖ) Allah memberikan balasan pada hari kiamat kepada hamba yang beramal saleh dan berperilaku baik, sedekah, atau kebajikan ketika mereka di dunia kelak dengan surga, negeri orang-orang yang baik. Firman-Nya (وَإِن تَوَلَّوۡاْ) berpaling dari seruan ini lalu kalian tetap berada dalam kesyirikan dan kekufuran kalian, (فَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ كَبِيرٍ ) aku khawatir kalian tertimpa azab hari yang besar yaitu azab hari kiamat. Pelajaran dari ayat : 1. Wajibnya membersihkan diri dari kesyirikan terlebih dahulu, kemudian mempersembahkan ibadah hanya kepada Allah. 2. Tidak ada satu kebaikan pun yang disia-siakan oleh Allah, seandainya hamba tersebut termasuk orang yang bertauhid, maka (و يؤت كل ذي فضل فضله) Dia akan memberikan ganjaran atas amalan shaleh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 3: Dari perbuatan syirk dan dosa-dosa lainnya. Dengan kembali menaati-Nya dan mengerjakan perbuatan yang dicintai-Nya. Yaitu penghidupan yang baik dan rezeki yang banyak. Yaitu kematian. Balasan-Nya. Yakni dari seruanku. Hari di mana Allah Subhaanahu wa Ta'aala mengumpulkan makhluk yang dahulu maupun yang datang kemudian, lalu memberikan balasan terhadap amal mereka. Jika amalnya baik, maka akan diberi balasan yang baik, dan jika buruk, maka akan diberi balasan yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 3",
    "description": "Sesungguhnya hanya Allah yang berhak disembah dan hendaklah kamu memohon ampunan secara tulus kepada tuhanmu dan kemudian bertobatlah, yakni kembali kepada-Nya dengan menyesali kesalahankesalahan serta tidak mengulanginya lagi, niscaya dia akan memberi kenikmatan yang baik kepadamu di dunia sampai waktu yang telah ditentukan, yakni datangnya ajal. Dan dia akan memberikan karunia-Nya, yakni pahala, kepada setiap orang yang berbuat baik. Dan jika kamu berpaling dari petunjuk Allah dan rasul-Nya, maka sungguh, aku takut kamu akan ditimpa azab pada hari yang besar, yakni hari pembalasan kelak. Karena hanya kepada Allah-lah kamu kembali pada hari kiamat nanti. Dia mahakuasa atas segala sesuatu."
  }
]