[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan wahai kaumku, siapakah yang dapat mengahalangi diriku dari Allah, jika Dia menyiksaku atas tindakan pengusiranku terhadap kaum Mukminin? apakah kalian tidak merenungi perkara-perkara dengan baik, lalu mengetahui apa yang paling bermanfaat dan terbaik bagi kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Wahai kaumku! Siapakah yang akan melindungiku dari azab Allah jika aku mengusir mereka secara semena-mena tanpa ada kesalahan sedikitpun? Tidakkah kalian mau mengambil pelajaran dan berusaha melakukan sesuatu yang lebih baik dan lebih bermanfaat bagi kalian?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Hai kaumku, Siapakah yang dapat menolongku dari Allah dan menjauhkanku dari kemurkaan-Nya jika aku mengusir para kekasih dan orang-orang yang dekat dengan-Nya. Tidakkah kalian melihat keadaan kalian dan tempat kembali kalian sehingga kalian dapat mengambil pelajaran darinya?” Secara tidak langsung, ini merupakan penjelasan kedudukan orang-orang yang beriman kepadanya di sisi Tuhan mereka, dan pengingkaran terhadap olokan orang-orang kafir yang ditujukan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَيٰقَوْمِ مَن يَنصُرُنِى مِنَ اللهِ إِن طَرَدتُّهُمْ ۚ (Hai kaumku, siapakah yang akan menolongku dari (azab) Allah jika aku mengusir mereka) Padahal mereka telah bergegas beriman dan menerima seruanku, serta bergegas mendakwahkan risalah yang aku bawa. Akan tetapi mereka berhak mendapatkan penghargaan dan derajat yang tinggi atas kesegeraan mereka dalam beriman kepada Allah; bukan malah diusir dan dihinakan, dan orang yang melakukan ini merupakan orang bodoh yang tidak memahami hak Allah, dan bagaimana aku akan melakukan hal ini sedangkan aku adalah Rasulullah, dan siapa yang akan menolongku jika aku melakukan kemaksiatan ini, sebab orang-orang beriman yang bersegera dalam ketaatan Allah adalah para wali dan kekasih Allah meskipun mereka adalah orang-orang miskin yang tidak memiliki apapun, apabila aku berlaku buruk terhadap mereka dan mengusir mereka maka aku akan menjadi musuh Allah, lalu siapa yang akan menolongku?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah berfirman tentang perkataan Nuh kepada kaumnya : { وَيَا قَوْمِ مَنْ يَنْصُرُنِي مِنَ اللَّهِ إِنْ طَرَدْتُهُمْ ۚ أَفَلَا تَذَكَّرُونَ } \"Dan (dia berkata): \"Hai kaumku, siapakah yang akan menolongku dari (azab) Allah jika aku mengusir mereka. Maka tidakkah kamu mengambil pelajaran?\". Sebagian ulama berdalil dengan ayat ini bahwasanya diwajibkan hormat kepada kaum mukminin, dan haram bagi siapapun yang merendahkan mereka, sekalipun dari segi ekonomi mereka miskin tanpa ada yang diandalkan dari harta; hal ini para ulama perpendapat karena Allah menceritakan tentang perkataan Nuh kepada petinggi-petinggi kaumnya tatkala mereka meminta agar orang-orang beriman diusir dan diasingkan dari kampung mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. “Hai kaumku, siapakah yang akan menolongku dari azab Allah jika aku mengusir mereka. Mereka adalah orang-orang yang paling berhak untuk dimuliakan atas iman mereka. tidakkah kamu mengambil pelajaran?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaumku, siapakah yang akan menolongku dari (azab) Allah} siapakah yang bisa menjagaku dari azab Allah {jika aku mengusir mereka. Apakah kalian tidak mengambil pelajaran} apakah mereka tidak mengambil pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30 “dan dia berkata ’hai kaumku, siapakah yang akan menolongku dari azab Allah jika kau mengusir mereka” maksudnya siapa yang melindungiku dari azabNya, karena megusir mereka menyebabkan turunnya azab dan siksa yang mana tidak ada pelindung selain Allah. ”maka tidaklah kamu mengambil pelajaran?” apa yang lebih berguna dan lebih baik bagimu, dan semestinya kamu merenungkan segala urusan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya : (من ينصرني من الله إن طردتهم) siapa yang akan menolongku dari azab Allah jika aku bermaksiat kepadanya, aku mengusir orang-orang fakir, lemah yang kalian dengan pandang remeh—dengan mata yang tidak mampu melihat kebenaran. Kemudian Nuh berkata (أفلا تذكرون) tidak kah kalian berfikir dan mengetahui kesalahan dan kebodohan kalian, sehingga kalian kembali kepada kebenaran dan bertaubat kepada Rabb kalian, beriman dengan rasul-Nya dan hanya menyembah-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 30: Kata-kata ini diucapkan oleh Nabi Nuh ‘alaihis salam sewaktu dia didesak oleh golongan kafir yang kaya dari kaumnya agar mengusir golongan yang beriman yang miskin dan kekurangan. Yakni sesuatu yang lebih bermanfaat dan lebih baik bagimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 30",
    "description": "Nabi nuh pun berkata kepada mereka, wahai kaumku! siapakah yang akan menolongku dari azab Allah jika aku mengusir mereka dari kampung halaman ini karena alasan mereka bukan orang terpandang lagi berharta, padahal mereka lebih berhak dihormati karena mereka telah beriman kepada Allah. Tidakkah kamu mengambil pelajaran tentang kebenaran ajaran yang aku bawa'dan selanjutnya nabi nuh menyampaikan jawaban lagi atas tuduhan mereka seraya berkata, aku tidak mengatakan kepadamu sesuatu yang bohong seperti pernyataan, bahwa aku mempunyai gudang-gudang perbendaharaan rezeki dan kekayaan dari Allah yang dapat kami berikan sesuai keinginanku. Dan aku tidak mengetahui sesuatu yang gaib tanpa bantuan informasi dari Allah. Dan tidak pula kami mengatakan bahwa sesungguhnya aku adalah malaikat yang tidak makan dan minum, dan tidak memiliki kebutuhan manusiawi serta naluri kemanusiaan, melainkan kami adalah manusia biasa seperti kalian, hanya saja kami adalah rasul utusan Allah yang mendapat bimbingan wahyu darinya. Setelah berbicara tentang dirinya, nabi nuh menyampaikan perihal pengikutnya. Dan aku tidak juga mengatakan kepada orang yang dipandang hina oleh penglihatanmu karena kalian hanya memandang mulia orang yang memiliki harta dan kedudukan, bahwa Allah tidak akan memberikan ganjaran atas amal kebaikan kepada mereka selama di dunia. Hal ini karena aku tidak mengetahui sesuatu yang gaib dan tidak pula mengetahui apa yang tersembunyi dalam hati mereka, Allah lebih mengetahui apa yang ada pada diri mereka tentang keimanannya yang tulus. Sungguh, jika aku mengatakan sesuatu yang tidak benar atas nama Allah, maka dengan demikian aku benar-benar termasuk orang-orang yang zalim terhadap diriku dan orang lain, karena menempatkan sesuatu bukan pada tempatnya."
  }
]