[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan aka tidak akan berkata kepada kalian, ”sesungguhnya aku memiliki penguasaan kendali perbendaharaan kekayaan Allah, dan aku tidak mengetahui perkara ghaib, dan aku bukanlah malaikat. Dan aku tidak mengataakn kepada orang-orang yang kalian lecehkan dari orang-orang mukmin yang lemah, Allah tidak akan memberikan pahala atas amal-amal kalian, Allah saja yang lebih mengetahui apa yang ada di dalam dada dan hati mereka. Dan jika aku lakukan itu, dengan demikian aku benar-benar termasuk orang-orang yang berbuat kezhaliman terhadap diri mereka dan kepada orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Dan aku tidak mengatakan kepada kalian, wahai kaumku!, bahwa aku mempunyai gudang-gudang rezeki Allah yang akan kubagikan kepada kalian jika kalian mau beriman. Aku juga tidak mengatakan kepada kalian, bahwa aku mengetahui perkara yang gaib. Aku pun tidak mengatakan kepada kalian, bahwa aku adalah Malaikat. Tetapi aku adalah manusia biasa seperti kalian. Dan aku pun tidak mengatakan tentang orang-orang miskin yang kalian hina dan remehkan itu, bahwa Allah tidak akan memberi mereka bimbingan atau petunjuk ke jalan yang benar. Karena Allah Maha Mengetahui niat dan keadaan mereka. Sesungguhnya jika aku mengatakan hal itu, niscaya aku akan termasuk ke dalam golongan orang-orang zalim yang pantas mendapatkan azab dari Allah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Aku tidak pernah berkata kepada kalian bahwa aku memiliki kekayaan Allah karena kekayaan-Nya tidak dapat dikuasai oleh seorangpun, dan tidak diberikan kecuali kepada yang dia kehendaki; aku tidak pernah mengaku sebagai dukun atau peramal; aku tidak pernah berkata bahwa aku adalah seorang malaikat; dan aku tidak pernah berkata kepada orang-orang yang kalian remehkan itu bahwa mereka tidak akan mendapat kebaikan dari Allah sedangkan Allah Maha Mengetahui keimanan yang ada dalam diri mereka. Jika aku melakukan hal-hal tersebut maka aku telah melanggar perintah Tuhanku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَلَآ أَقُولُ لَكُمْ عِندِى خَزَآئِنُ اللهِ (Dan aku tidak mengatakan kepada kamu (bahwa): “Aku mempunyai gudang-gudang rezeki dan kekayaan dari Allah) Agar kalian tidak menjadikannya bukti bahwa aku berbohong jika aku tidak mempunyainya. وَلَآ أَعْلَمُ الْغَيْبَ(dan aku tiada mengetahui yang ghaib) Yakni dan aku tidak mengaku bahwa aku paling mengetahui keghaiban Allah, namun aku hanya mengatakan kepada kalian bahwa aku adalah seorang pemberi peringatan yang nyata. وَلَآ أَقُولُ(dan tidak (pula) aku mengatakan) Yakni kepada kalian. إِنِّى مَلَكٌ (Bahwa sesungguhnya aku adalah malaikat) Sehingga kalian dapat mengatakan “kami melihatmu hanyalah seorang manusia seperti kami”. وَلَآ أَقُولُ لِلَّذِينَ تَزْدَرِىٓ أَعْيُنُكُمْ (dan tidak juga aku mengatakan kepada orang-orang yang dipandang hina oleh penglihatanmu) Yakni aku tidak berkata tentang orang-orang beriman kepada Allah yang menjadi pengikutku, yang kalian hina dan sepelekan. لَن يُؤْتِيَهُمُ اللهُ خَيْرًا ۖ( Sekali-kali Allah tidak akan mendatangkan kebaikan kepada mereka) Akan tetapi Allah telah memberi mereka kebaikan berupa keimanan. Dan Allah akan membalas mereka dengan balasan yang agung di akhirat dan mengangkat derajat mereka di dunia. اللهُ أَعْلَمُ بِمَا فِىٓ أَنفُسِهِمْ ۖ (Allah lebih mengetahui apa yang ada pada diri mereka) Yakni apabila dalam hati mereka terdapat kebaikan maka Allah akan memberi mereka karunia-Nya sesuai dengan kebaikan itu. Dan kelemahan serta kemiskinan mereka tidak akan menghalangi Allah untuk memberi mereka karunia-Nya. إِنِّىٓ إِذًا لَّمِنَ الظّٰلِمِينَ (sesungguhnya aku, kalau begitu benar-benar termasuk orang-orang yang zalim) Apabila aku mengatakan bahwa Allah tidak akan memberi mereka kebaikan, padahal aku tidak mengetahui isi hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Aku tidak mengatakan kepadamu bahwa “Aku mempunyai gudang-gudang rezeki dan kekayaan dari Allah, aku tidak mengetahui segala yang ghaib, sehingga aku tidak bisa mendatangkan apa yang kalian inginkan kemudian kalian mendustakanku Aku hanyalah seorang pemberi peringatan”. Aku juga tidak mengatakan: “Bahwa sesungguhnya aku adalah malaikat, namun aku hanyalah seorang manusia biasa”, dan juga tidak mengatakan kepada orang-orang miskin yang kalian pandang hina dengan perkataan: “Sekali-kali Allah tidak akan mendatangkan kebaikan kepada mereka yaitu keimanan”. Allah lebih mengetahui apa yang ada pada diri mereka, Allah membalas mereka di akhirat lebih baik dari apa yang telah Allah berikan kepada kalian di dunia. Sesungguhnya aku, kalau begitu benar-benar termasuk orang-orang yang zalim pada diri sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Aku tidak mengatakan kepada kalian bahwa aku mempunyai perbendaharaan (rezeki) Allah. Aku juga tidak mengetahui yang gaib dan tidak mengatakan bahwa sesungguhnya aku adalah malaikat. Aku tidak mengatakan kepada orang-orang yang dipandang hina} direndahkan dan dikucilkan {oleh penglihatan kalian bahwa Allah tidak akan memberi mereka kebaikan. Allah lebih mengetahui apa yang ada pada diri mereka. Jika demikian, sesungguhnya aku benar-benar termasuk orang-orang yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31 “dan aku tidak mengatakan kepada kamu (bahwa) ‘aku mempunyai gudang gudang rizki dan kekayaan dari Allah, dan aku tiada mengetahui yang ghaib dan tidak (pula) aku mengatakan, ’sesungguhnya aku adalah malaikat”. Yakni, aku hanyalah seorang rasul Allah kepadamu, aku memberimu berita gembira dan peringatan, selain itu aku tidak sedikitpun mempunyai wewenang. Kekayaan Allah tiada ada padaku sehingga aku bisa mengaturnya dan memberikannya kepada orang yang aku kehendaki, dan menghalanginya dari orang yang aku kehendaki. ”dan aku tiada mengetahui yang ghaib” sehingga aku bisa mengabarkan rahasiamu dan batinmu. ”dan tidak pula aku mengatakan ’sesungguhnya aku adalah malaikat” maknanya aku tidak mengklaim tingkatan diatas tingkatanku, tidak pula posisi di mana Allah mendudukkanku padanya tidak pula aku menghukum manusia berdasarkan dugaanku. Dan aku tidak “mengatakan kepada orang orang yang dipandang hina oleh penglihatanmu” yakni orang orang orang mukmin yang lemah yang diremehkan oleh para pembesar orang orang kafir. ”sekali kali Allah tidak akan mendatangkan kebaikan kepada mereka, Allah Maha mengetahui apa yang ada pada diri mereka\", jika mereka benar dengan keimanan mereka, maka mereka akan mendapatkan banyak kebaikan, jika tidak demikian, maka hisab mereka menjadi tanggung jawab Allah. ”sesungguhnya aku kalau begitu” jika aku mengatakan sesuatu dari yang diatas “benar benar termasuk orang orang yang zhalim” ini adalah pemutus asaan dari Nuh kepada kaumnya untuk mengusir orang orang Mukmin yang miskin atau membenci mereka sekaligus meyakinkan bagi orang yang berpikir obyektif."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (خزائن الله) Khazaa’inullah : Perbendaharaan yang ada di dalamnya karunia dan harta. (تزدري أعينكم) Tazdarii a’ayunukum : Memandang mereka dengan remeh. Makna ayat : Kemudian berkata pada ayat yang terakhir (31) (و لا أقول لكم عندي خزائن الله) “Dan aku tidak mengatakan kepada kamu (bahwa): \"Aku mempunyai gudang-gudang rezeki dan kekayaan dari Allah” bantahan atas perkataan mereka (و ما نرى لكم علينا من فضل) “Kami tidak melihat kamu memiliki suatu kelebihan apa pun atas kami”, (و لا أعلم الغيب ) dan aku tidak mengetahui yang gaib, hal-hal yang tersembunyi dalam hati manusia, lalu aku mengusir ini dan membiarkan itu (و لا أقول إني ملك) aku tidak mengatakan pula, bahwa aku adalah malaikat, kemudian kalian berkata, “Kami tidak melihat mu kecuali manusia, sama seperti kami (و لا أقول للذين تزدري أعينكم) “dan aku tidak (juga) engatakan kepda orang yang dipandang hina oleh penglihatanmu” yaitu orang-orang yang kalian pandang remeh karena kemiskinan dan lemahnya mereka di masyarakat (لن يؤتيكم الله خيرا الله أعلم بما في أنفسهم) bahwa Allah tidak akan memberikan kebaikan kepada mereka dan Allah lebih mengetahui apa yang ada pada diri mereka berupa: kejujuran, kemunafikan, dan siapa yang mencintai dan membenciku, seakan-akan mereka mencela kaum mukminin dan menuduh bahwa mereka munafik atau punya maksud busuk atau ingin mencari harta, sehingga mereka mau mengikuti Nuh. Firman-Nya (إني إذا لمن الظالمين) seandainya aku mengatakan kepada orang-orang mukmin dari golongan lemah, kalian tidak akan mendapatkan kebaikan dari Allah, maka aku tergolong orang-orang zalim yang semena-mena kepada manusia, dengan menghalangi hak-hak dan merendahkan kehormatan mereka. Pelajaran dari ayat : • Ilmu gaib adalah hal yang Allah khusus kan untuk diri-Nya, kecuali orang yang Allah kehendaki untuk mengetahuinya. • Haramnya merendahkan orang lain dan menjadikan mereka bahan ejekan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 31: Sehingga aku memberikanya kepada orang yang aku kehendaki dan aku halangi orang yang aku kehendaki. Aku hanyalah utusan Allah kepada kepada kamu yang tugasnya hanya memberikan kabar gembira dan peringatan; tidak lebih. Sehingga aku memberitakan kepadamu rahasia kamu dan apa yang kamu sembunyikan. Bahkan aku adalah manusia seperti kamu, dan aku tidak menempatkan diriku di atas posisi yang Allah berikan kepadaku. Yakni kaum mukmin yang lemah. Jika iman mereka benar, maka mereka akan mendapatkan kebaikan yang banyak, dan jika tidak demikian, maka hisab mereka terserah kepada Allah Azza wa Jalla. Kata-kata Nabi Nuh ‘alaihis salam di atas merupakan cara bijaksana agar kaumnya tidak lagi mengusir atau membenci kaum mukmin yang fakir serta usaha agar mereka menerima pengikutnya itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 31",
    "description": "Dan selanjutnya nabi nuh menyampaikan jawaban lagi atas tuduhan mereka seraya berkata, aku tidak mengatakan kepadamu sesuatu yang bohong seperti pernyataan, bahwa aku mempunyai gudang-gudang perbendaharaan rezeki dan kekayaan dari Allah yang dapat kami berikan sesuai keinginanku. Dan aku tidak mengetahui sesuatu yang gaib tanpa bantuan informasi dari Allah. Dan tidak pula kami mengatakan bahwa sesungguhnya aku adalah malaikat yang tidak makan dan minum, dan tidak memiliki kebutuhan manusiawi serta naluri kemanusiaan, melainkan kami adalah manusia biasa seperti kalian, hanya saja kami adalah rasul utusan Allah yang mendapat bimbingan wahyu darinya. Setelah berbicara tentang dirinya, nabi nuh menyampaikan perihal pengikutnya. Dan aku tidak juga mengatakan kepada orang yang dipandang hina oleh penglihatanmu karena kalian hanya memandang mulia orang yang memiliki harta dan kedudukan, bahwa Allah tidak akan memberikan ganjaran atas amal kebaikan kepada mereka selama di dunia. Hal ini karena aku tidak mengetahui sesuatu yang gaib dan tidak pula mengetahui apa yang tersembunyi dalam hati mereka, Allah lebih mengetahui apa yang ada pada diri mereka tentang keimanannya yang tulus. Sungguh, jika aku mengatakan sesuatu yang tidak benar atas nama Allah, maka dengan demikian aku benar-benar termasuk orang-orang yang zalim terhadap diriku dan orang lain, karena menempatkan sesuatu bukan pada tempatnya. Setelah nabi nuh memberikan jawaban-jawaban atas tuduhan dan dakwaan kaumnya, sehingga mereka tidak mampu lagi memberikan sanggahan walau mereka telah berpikir panjang, lalu mereka berkata, wahai nuh! sungguh, engkau telah banyak berbantah dengan kami, karena semua alasan telah kamu bantah dan engkau telah memperpanjang bantahanmu terhadap kami dan kami pun merasa jemu dan bosan maka dari itu lebih baik hentikan saja perdebatan ini, tapi datangkanlah kepada kami azab yang engkau ancamkan, jika kamu termasuk orang yang benar dalam ucapan yang engkau sampaikan itu."
  }
]