[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”wahai Nuh, kamu telah membantah kami dan sudah terlalu banyak melancarkan bantahan kepada kami, maka datangkanlah kepada kami apa yang kamu ancamkan kepada kami dari siksaan, jika kamu termasuk orang-orang yang benar dalam klaimmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Mereka berkata dengan nada sombong dan angkuh, \"Wahai Nuh! Sungguh kamu telah berdebat dan beradu argumen dengan kami. Bahkan kamu sudah terlalu banyak berdebat dan beradu argumen dengan kami. Maka datangkanlah kepada kami azab yang kamu janjikan kepada kami, jika kamu termasuk orang-orang yang benar dalam pengakuanmu itu!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Orang-orang musyrik membantah Nabi Nuh dengan penuh kesombongan: “Hai Nuh, kamu telah berpanjang lebar dalam mendebat kami sehingga kami merasa bosan, maka segerakanlah apa yang kamu ancamkan kepada kami jika kamu memang orang yang benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قَالُوا۟ يٰنُوحُ قَدْ جٰدَلْتَنَا فَأَكْثَرْتَ جِدٰلَنَا (Mereka berkata “Hai Nuh, sesungguhnya kamu telah berbantah dengan kami, dan kamu telah memperpanjang bantahanmu terhadap kami) Melawan kami dengan berbagai hujjah. فَأْتِنَا بِمَا تَعِدُنَآ (maka datangkanlah kepada kami azab yang kamu ancamkan kepada kami) Azab yang kamu takut-takuti kami dengannya dan kamu khawatirkan akan menimpa kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Mereka berkata “Hai Nuh, sesungguhnya kamu telah berbantah dengan kami, dan kamu telah memperpanjang bantahanmu terhadap kami, maka dari itu datangkanlah kepada kami azab yang kamu ancamkan kepada kami itu, jika kamu termasuk orang-orang yang benar”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Nuh, sungguh kamu telah berdebat dengan kami} kamu berbantah-bantahan dengan kami {dan kamu telah memperpanjang perdebatanmu terhadap kami}bantahanmu kepada kami {Maka datangkanlah kepada kami azab yang kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32 tatkala mereka melihat Nuh tidak berhenti dari dakwahnya dan mereka sendiri tidak mendapatkan apa yang mereka inginkan, maka “mereka berkata ‘hai Nuh sesunggguhnya kamu telah berbantah bantahan dengan kami, dan kamu telah memperpanjang bantahanmu terhadap kami, maka datangkanlah kepada kami azab yang kamu ancamkan kepada kami, jika kamu termasuk orang orang yang benar” betapa bodohnya mereka, betapa sesatnya mereka, dimana mereka mengucapkan kata kata ini kepada Nabi mereka yang tulus. Jika mereka benar, mengapa mereka tidak mengatakan ’Hai nuh, kamu telah menasihati kami, mengasihi kami dan menyeru kami kepada perkara perkara yang belum jelas bagi kami, maka kami ingin kamu menjelaskannya agar kami bisa mengikutimu, jika tidak maka terimakasih atas nasihat nasihatmu” sungguh ini adalah jawaban yang obyetif bagi orang yang diseru kepada perkara yang samar baginya, akan tetapi mereka adalah orang orang yang dusta dalam perkataan mereka, lancang terhadap Nabi mereka. Mereka tidak menolak kata katanya dengan syubhat paling rendah, terlebih lagi menolak dengan hujjah. Oleh karena itu, mereka membelok karena kebodohan dan kesesatan mereka kepada permintaan disegerakannya azab, dan menantang Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (جادلنا) Jaadalnaa : engkau mendebat ingin menjatuhkan kami, dan tidak menganggap agama kami. (بما تعدنا) Bimaa ta’idunaa : Janji berupa azab, seandainya kami tidak beriman kepada yang engkau seru. (إن كنت من الصادقين) Inkunta minsh shaadiqiin : engkau benar dalam klaim kenabianmu dan pengkabaran berita dari sisi Allah. Makna ayat : Ayat-ayat ini masih menceritakan kisah Nabi Nuh beserta kaumnya, Allah berfirman tentang perkataan kaum Nuh kepadanya (قالوا يا نوح قد جادلتنا) “Engkau sudah banyak mendebat kami, maka datangkan lah apa yang engkau ancamkan kepada kami (إن كنت من الصادقين) percepatlah azab itu dan turunkan lah kepada kami, jika engkau memang termasuk orang-orang yang benar. Pelajaran dari ayat : • Bolehnya berdebat untuk menegakkan kebenaran dan menghancurkan kebatilan, dengan tata cara yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 32: Ketika mereka melihat ternyata Nabi Nuh ‘alaihis salam tidak juga berhenti dari dakwahnya dan tidak mau mengikuti tuntutan mereka, mereka berkata seperti yang disebutkan dalam ayat di atas. Alangkah jahil dan sesat mereka, karena berkata seperti ini kepada nabi mereka yang begitu tulusnya kepada mereka! Tidakkah mereka mengatakan, “Wahai Nuh! Engkau telah menasehati kami, merasa kasihan kepada kami dan telah mengajak kami kepada suatu perkara yang belum begitu jelas bagi kami, kami ingin engkau lebih menjelaskan lagi kepada kami agar kami dapat mengikutimu. Kalau pun tidak, maka nasehatmu patut disyukuri.” Inilah jawaban yang baik. Akan tetapi mereka berdusta dalam kata-katanya dan bersikap berani terhadap nabi mereka. Mereka juga tidak membantahnya dengan syubhat yang kecil, apalagi dengan hujjah karena kebenaran telah jelas bagi mereka dan mereka tidak mempunyai alasan lagi untuk menolaknya seain sikap keras, sehingga mereka beralih meminta disegerakan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 32",
    "description": "Setelah nabi nuh memberikan jawaban-jawaban atas tuduhan dan dakwaan kaumnya, sehingga mereka tidak mampu lagi memberikan sanggahan walau mereka telah berpikir panjang, lalu mereka berkata, wahai nuh! sungguh, engkau telah banyak berbantah dengan kami, karena semua alasan telah kamu bantah dan engkau telah memperpanjang bantahanmu terhadap kami dan kami pun merasa jemu dan bosan maka dari itu lebih baik hentikan saja perdebatan ini, tapi datangkanlah kepada kami azab yang engkau ancamkan, jika kamu termasuk orang yang benar dalam ucapan yang engkau sampaikan itu. Mendengar jawaban kaumnya, dia (nabi nuh) menjawab, hanya Allah yang berwenang dan kuasa akan mendatangkan azab itu kepadamu jika dia menghendaki, dan kamu tidak akan dapat melepaskan diri dari azab Allah, ketika azab itu datang."
  }
]