[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nuh berkata kepada kaumnnya, :sesungguhnya Allah sajalah yang menimpakan siksaan pada kalian, bila Dia menghendaki, dan kalian tidak akan lolos dari siksaanNya, bila dia berkehendak menyiksa kalian. karena sesungguhnya Allah tidak ada yang mampu melemahkanNYa sesuatupun di muka bumi dan di langit."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Nuh berkata kepada mereka, \"Aku tidak bisa mendatangkan azab itu kepada kalian. Sesungguhnya Allah-lah yang akan mendatangkannya kepada kalian, jika Dia menghendakinya. Dan kalian tidak akan bisa lolos dari azab Allah jika Dia berkehendak menjatuhkan azab-Nya kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33- 34. Nabi Nuh menjawab mereka dengan penuh keyakinan: “Yang akan memenuhi ancaman ini dan mendatangkan azab adalah Allah; jika Dia berkehendak maka Dia akan menyegerakannya, dan jika Dia berkehendak lain maka Dia akan mengakhirkannya. Akan tetapi jika azab itu telah menimpa kalian, maka kalian tidak akan dapat berlari darinya dan menolaknya. Nasehatku sama sekali tidak berguna bagi kalian, padahal aku sangat peduli dan mengasihani kalian jika Allah tidak menghendaki hidayah bagi kalian. Allah adalah pencipta kalian dan yang mengatur urusan kalian, hanya kehendak-Nyalah yang akan terlaksana. Kepada-Nya kalian akan kembali untuk membuat perhitungan atas perkataan dan perbuatan yang telah kalian lakukan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. قَالَ إِنَّمَا يَأْتِيكُم بِهِ اللهُ (Nuh menjawab: “Hanyalah Allah yang akan mendatangkan azab itu kepadamu) Entah Allah akan menyegerakannya atau mengakhirkannya. إِن شَآءَ وَمَآ أَنتُم بِمُعْجِزِينَ(jika Dia menghendaki, dan kamu sekali-kali tidak dapat melepaskan diri) Yakni tidak akan lolos dari apa yang dikehendaki Allah terhadap kalian dengan berlari kabur atau membela diri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Nuh menjawab: “Hanyalah Allah yang akan mendatangkan azab itu kepadamu jika Dia menghendaki untuk menyegerakan atau menangguhkan, dan kamu sekali-kali tidak dapat melepaskan diri dari azab-Nya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nuh menjawab,“Sesungguhnya hanya Allah yang akan mendatangkannya kepada kalian jika Dia menghendaki dan sekali-kali kalian tidak akan dapat melepaskan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33 Oleh karena itu Nuh, menjawab mereka dengan berkata ”hanyalah Allah yang akan mendatangkan azab itu kepadamu jika Dia menghendaki” maksudnya, jika hikmah dan kehendakNya menuntutNya menurunkan siksa kepadamu, maka Dia akan melakukan itu ”dan kamu sekali kali tidak dapat melepaskan diri” dari Allah sedangkan aku sendiri tidak memiliki wewenang apa pun."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بمعجزين) Bi mu’jiziin : tidak akan menang atau lolos dari azab Allah, seandainya Dia berkehendak menyiksamu kapan pun. Makna ayat : Kemudian Allah mengabarkan perkataan Nuh sebagai bantahan kepada kaumnya, seperti yang Allah ajarkan kepadanya (قل إنما يأتيكم به الله) Allah lah yang akan mendatangkan azab itu, jika Dia berkehendak. (وما أنتم بمعجزين) dan kalian tidak dapat lolos dan lari dari azab Allah. Pelajaran dari ayat : • Kehendak Allah mendahului segala sesuatu, apa yang Ia kehendaki pasti terjadi dan yang tidak dikehendaki tidak akan terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 33: Karena urusan itu kembali kepada-Nya; bukan kepadaku, Dia akan menurunkannya kepadamu jika kehendak dan hikmah-Nya menetapkan demikian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 33",
    "description": "Mendengar jawaban kaumnya, dia (nabi nuh) menjawab, hanya Allah yang berwenang dan kuasa akan mendatangkan azab itu kepadamu jika dia menghendaki, dan kamu tidak akan dapat melepaskan diri dari azab Allah, ketika azab itu datang. Nabi nuh lalu menekankan lagi, dan jika Allah hendak menyesatkanmu, itu adalah akibat ulahmu sendiri, maka nasihatku tidak akan bermanfaat lagi bagimu sekalipun aku ingin memberi nasihat kepadamu lagi. Semua itu tidak bermanfaat bagimu kalau Allah hendak menyesatkanmu disebabkan karena kamu terus-menerus menolak tuntunan-Nya, padahal dia adalah tuhanmu yang memelihara dan membimbingmu. Dan hanya kepada-Nyalah kamu semua akan dikembalikan."
  }
]