[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak akan bemanfaat bagi kalian nasihat dan kesungguhanku mendakwahi kalian kepada keimanan jika Allah memang berkehendak menyesatkan kalian dan membinasakan kalian. Dia pemilik kalian, dan kepadaNya kalian akan dikembalikan di akhirat untuk menghadapi perhitungan amal perbuatan dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Tidak ada gunanya nasihat dan peringatan yang kuberikan kepada kalian jika Allah berkehendak menyesatkan kalian dari jalan yang lurus dan membiarkan kalian berjalan tanpa petunjuk akibat keangkuhan kalian. Dia adalah Tuhan kalian. Dia lah yang memegang urusan kalian, sehingga Dia menyesatkan kalian sesuai kehendak-Nya. Dan hanya kepada-Nya lah kalian akan dikembalikan di Hari Kiamat untuk mendapatkan balasan yang sesuai dengan amal perbuatan kalian.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلَا يَنفَعُكُمْ نُصْحِىٓ (Dan tidaklah bermanfaat kepadamu nasehatku) Yang aku curahkan kepada kalian sebagai nasehat kepada Allah dengan menyampaikan risalah-Nya dan nasehat kepada kalian dengan menjelaskan kebenaran. إِن كَانَ اللهُ يُرِيدُ أَن يُغْوِيَكُمْ (jika aku hendak memberi nasehat kepada kamu, sekiranya Allah hendak menyesatkan kamu) Nasehat yang aku berikan kepada kalian tidak bermanfaat apabila Allah hendak menyesatkan kalian dari jalan hidayah dan membelokkan kalian dari jalan kebenaran, dan aku tidak tahu apa yang Allah kehendaki dari kalian. هُوَ رَبُّكُمْ (Dia adalah Tuhanmu) Maka Dia-lah yang menyesatkan dan yang memberi petunjuk. وَإِلَيْهِ تُرْجَعُونَ (dan kepada-Nya-lah kamu dikembalikan) Kemudian Dia akan membalas amalan kalian, maka mohonlah kepada-Nya agar memberi kalian hidayah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Jika aku hendak memberi nasehat kepadamu, maka nasehatku untuk menjauhi sebab-sebab munculnya azab tidaklah bermanfaat untukmu, sebab kalian membantah nasehat. Sekiranya Allah hendak menyesatkan kamu dari jalan kebenaran, maka Dia akan mengazab dan membinasakan kalian. Dia adalah Tuhanmu Yang Menciptakan dan Mengendalikan apa yang telah Dia kehendaki, baik berupa petunjuk maupun pembiaran. Kepada-Nya-lah kamu dikembalikan untuk diberi balasan atas segala perbuatan kalian”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nasihatku tidak akan bermanfaat bagi kalian sekalipun aku ingin menasihati kalian. Allah hendak menyesatkan kalian} menyesatkan kalian {Dia adalah Tuhan kalian dan hanya kepadaNyalah kalian dikembalikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34 “dan tidaklah nasihatku bermanfaat kepadamu jika aku hendak memberi nasihat kepadamu, sekiranya Allah menyesatkanmu” maksudnya keinginan Allah lah yang akan menang, jika Dia hendak menyesatkanmu karena kamu menolak kebenaran meskipun aku sudah berusaha sekuat tenaga memberimu nasihat dengan baik Nuh telah melakkan itu tetap saja hal itu tidak berguna bagimu sediitpun. ”Dia adalah Rabbmu” melakukan apa yang dikehendakiNya dan menetapkan hukum yang diinginkanNya. ”dan kepadaNyalah kamu dikembalikan” Lalu Dia membalas perbuatanmu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (نصحي) Nushhii : dengan ancamanku kepada kalian dengan azab Rabb kalian, jika kalian tetap di atas kekufuran. (أن يغويكم) Ayyughwiyakum : menjatuhkan kalian kedalam kesesatan, tetap di dalamnya, dan kalian tidak akan mendapat hidayah selamanya. Makna ayat : Firman-Nya (ولا ينفعكم نصحي إن أردت أنصح لكم إن كان الله يريد أن يغويكم هو ريكم و إليه ترجعون) nasihatku tidak akan bermanfaat bagi kalian—tidak akan menerimanya sekalipun aku telah berusaha sekuat tenaga, jika Allah menghendaki kalian sesat, karena kalian sudah melebihi batas, keras kepala, ingkar, serta sombong. Yang seperti ini tidak berhak mendapatkan hidayah dari Allah, bahkan lebih pantas untuk tetap di dalam kesesatan hingga mereka hancur dalam kesesatan dan celaka di akhirat kelak. Firman-Nya (هو ربكم و إليه ترجعون) Semua keputusan adalah milik-Nya, bukankah kalian hamba-Nya dan Dia Rabb kalian, jika Dia berkehendak kalian akan dirahmati atau Dia akan menyiksa kalian. Tapi keadilannya tidak memungkinkan-Nya menyiksa orang-orang saleh dan merahmati orang-orang sesat lagi zalim. Pelajaran dari ayat : • Nasehat tidak akan bermanfaat jika Allah tidak menghendaki kebaikan kepada yang diberi nasehat. • Tidak boleh menentukan kemana seseorang akan kembali setelah mati, kecuali dengan perkataan, “Allah yang lebih mengetahui.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 34: Dia bertindak terhadapmu sesuai kehendak-Nya dan memutuskan kamu dengan apa yang diinginkan-Nya. Lalu Dia akan membalas amalmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 34",
    "description": "Nabi nuh lalu menekankan lagi, dan jika Allah hendak menyesatkanmu, itu adalah akibat ulahmu sendiri, maka nasihatku tidak akan bermanfaat lagi bagimu sekalipun aku ingin memberi nasihat kepadamu lagi. Semua itu tidak bermanfaat bagimu kalau Allah hendak menyesatkanmu disebabkan karena kamu terus-menerus menolak tuntunan-Nya, padahal dia adalah tuhanmu yang memelihara dan membimbingmu. Dan hanya kepada-Nyalah kamu semua akan dikembalikan. Allah menceritakan kisah nabi nuh untuk meneguhkan hati rasulullah dan sebagai pelajaran bagi masyarakat. Namun demikian, ternyata kaum kafir mekah tetap enggan percaya bahkan mereka kelompok orang kafir itu berkata, dia Muhammad cuma mengada-ada saja tentang Al-Qur'an. Katakanlah, wahai nabi Muhammad, jika aku mengada-ada, akulah yang akan memikul dosanya, sedang kalian bebas dari tanggung jawab. Akan tetapi, jika tuduhanmu itu tidak benar dan Al-Qur'an benar-benar bersumber dari Allah, maka kalian akan memikul dosanya dan aku bebas dari dosa yang kamu perbuat."
  }
]