[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Atau apakah ada orang-orang musyrik dari kuam nuh mengatakan, ”nuh sendiri yang mengada-adakaan ucapan itu?” katakalanlah kepada mereka ”bila aku benar-benar mengada-adakan hal itu atas nama Allah, maka dosa tindakan itu hanyalah menjadi tanggunganku, akan tetapi bila aku benar, maka kalian lah orang-orang yang jahat lagi pendosa, dan aku berlepas diri dari kekafiran, pendustaan dan kejahatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Penyebab kafirnya kaum Nuh ialah mereka beranggapan bahwa Nuh telah membuat sendiri agama yang dibawanya itu atas nama Allah. Katakanlah -wahai Rasul- kepada mereka, \"Jika aku membuat sendiri agama itu maka aku telah berdosa, dan hanya akulah yang akan menanggung hukuman atas dosaku. Dan aku sama sekali tidak ikut menanggung akibat dari dosa pendustaan kalian itu. Jadi aku bersih dari dosa kalian itu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Apakah mereka menganggap bahwa Nuh berdusta dan mengada-ngada tentang ancaman ini? Katakanlah: “Jika aku mengada-ngada ancaman ini, maka perhitungan amalanku ada di tangan Allah, Dia akan menghukumku atas kejahatanku itu, dan aku berlepas diri dari kejahatan dan kedustaan kalian, sehingga tidak ada seorangpun yang menanggung dosa orang lain.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. أَمْ يَقُولُونَ افْتَرَىٰهُ ۖ (Dia cuma membuat-buat nasihatnya saja) Yakni apakah orang-orang kafir Makkah mengatakan “Muhammad telah mengada-ada kisah Nuh ini. قُلْ إِنِ افْتَرَيْتُهُۥ (Katakanlah: “Jika aku membuat-buat nasihat itu) Maka itu merupakan dosa yang besar. فَعَلَىَّ إِجْرَامِى (maka hanya akulah yang memikul dosaku) Yakni dosaku dan balasan perbuatanku, dan kalian tidak akan memikulnya. وَأَنَا۠ بَرِىٓءٌ مِّمَّا تُجْرِمُونَ (dan aku berlepas diri dari dosa yang kamu perbuat) Dosa kalian akan kalian pikul sendiri, dan aku tidak akan memikulnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Malahan kaum kafir Makkah itu berkata: “Dia hanya membuat-buat nasihatnya dari Alquran tentang cerita Nuh saja”. Katakanlah: “Jika aku membuat-buat nasihat itu, maka hanya akulah yang memikul dosaku, dan aku berlepas diri dari dosa yang kamu perbuat”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka berkata} bahkan ataukah mereka berkata {“Dia cuma mengada-adakannya} membuat-buatnya {Katakanlah,“Jika aku mengada-adakannya} membuat-buatnya {maka akulah yang akan memikul dosanya} maka akulah yang menerima dosanya {dan aku berlepas diri dari dosa yang kalian perbuat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35 “malahan kaum Nuh itu berkata ‘Dia Cuma membuat buat nasihatnya saja” kata ganti ini mengandung kemungkinan kembali kepada Nuh sebagaimana konteks ucapan yang membicarakan Nuh dengan kaumnya, maknanya adalah bahwa kaumnya berkata ”Nuh telah berdusta atas nama Allah, berdusta tentang wahyu yang dia klaim bahwa ia dari Allah. Dan bahwa Allah memintanya untuk berkata ”katakanlah ’jika aku membuat buat nasihat itu, maka hanya akulah yang memikul dosaku, dan aku berlepas diri dari dosa yang kamu perbuat” masing masing memikul dosanya. “dan seorang yang berdosa tidak dapat memikul dosa orang lain” Dan mengandung kemungkinan ia kembali kepada Nabi Muhammad sholallohu alaihi wasallam. Jadi ayat ini merupakan sisipan di tengah tengah kisah Nuh dengan kaumnya karena ia termasuk perkara yang tidak diketahui oleh para Nabi. Tatkala Allah mulai menceritakannya kepada RasulNya, dan itu termasuk bukti bukti yang menunjukan kebenaran risalahnya, maka Diapun menyebutkan pendustaan kaumnya kepadanya dengan penjelasan yang sempurna, seraya Dia berfirman ”apakah mereka berkata ’Dia telah membuat buatnya?” yakni al qur’an ini dibuat buat oleh Muhammad dari dirinya sendiri. Ini termasuk kata kata yang paling aneh dan yang paling batil, karena mereka mengetahui bahwa dia (Muhammad) tidak membaca dan tidak menulis serta tidak pernah pergi dari mereka untuk mengkaji kitab kitab, lalu dia hadir dengan kitab ini yang menantang mereka agar menghadirkan satu surat yang semisal dengannya. jika mereka tetap mengkliam dengan realita yang demikian bahwa Muhammad membuat buatnya, maka jelaslah bahwa mereka itu hanya sekedar menentang. Tak ada lagi guna berdebat dengan mereka, bahkan yang cocok dalam kondisi ini adalah berpaling dari mereka. Oleh karena itu Dia berfirman “katakanlah jika aku membuat buat nasihat itu, maka hanya akulah yang memikul dosaku” dan kebohonganku. ”dan aku berlepas diri dari dosa yang kamu perbuat” yakni mengapa kamu terus menuduhku berdusta."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أم يقولون) Am yaquuluunaf taraah : bahkan mereka berkata “Ia berbohong.” (افتراه) Iftaraah : dia yang membuatnya, bukan dari wahyu. (فعلي إجرامي) Fa’alayya ijraamii : akibat dari kedustaan aku yang menanggungnya. (و أنا بريء) Wa ana barii : aku berlepas diri dari perbuatan kalian, aku tidak bertanggung jawab atas hal itu. (مما تجرمون) Mimma tujrimuun : apa yang kamu perbuat kepada diri kalian sendiri, kalian merusaknya dengan perbuatan syirik, kufur, dan maksiat. Makna ayat : Allah meletakkan ayat ini (ayat 35) diantara kisah Nabi Nuh dan kaumnya. Dan point terpenting disini adalah: bahwa kisah tentang Nabi Nuh dan kaumnya tidak akan bisa diketahui kecuali oleh seorang nabi yang Allah beri wahyu. Oleh karena itu (أم يقولون افتراه) mereka berkata dia mengarang Al-Qur’an dan berdusta, ia tidak mendapat wahyu atasnya.” (قل إن افتريته) jika aku memang yang membuatnya sebagaimana persangkaan kalian ( فعلي إجرامي) bagiku dosa atas dusta (وأنا بريء مما تجرمون) dan aku berlepas diri dari perbuatanmu, pendustaan kalian terhadapku, kekufuran terhadap Rabb kalian dan rasul-Nya, janji, dan ancamannya. Pelajaran ayat : • Bolehnya menyisipkan perkataan tambahan, ketika memiliki manfaat untuk menegakkan kebenaran dan menghilangkan kebatilan atau memberi perhatian pada perkara yang penting. • Penyampaian kisah-kisah adalah bukti terbesar atas kebenaran kenabian Nabi shallahu ‘alaihi wa sallam dan ajakannya menuju Allah. • Kaidah, bahwa seseorang menanggung hasil dari perbuatannya sendiri dan tidak akan memikul dosa orang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 35: Dhamir (kata ganti nama) “Dia” di sini bisa kembalinya kepada Nabi Nuh ‘alaihis salam, sebagaimana susunannya tentang kisah Nabi Nuh dengan kaumnya, sehingga maknanya adalah, bahwa kaum Nuh berkata, “Dia (Nuh) cuma membuat-buat nasihatnya saja.” Bisa juga kata “Dia” di sini kembalinya kepada Nabi Muhammad shallallahu 'alaihi wa sallam, sehingga kalimat ini berada tengah-tengah kisah Nabi Nuh, di mana kisah-kisah tersebut termasuk perkara yang tidak diketahui kecuali oleh para nabi yang mendapatkan wahyu. Ketika Allah Subhaanahu wa Ta'aala mengisahkannya kepada Rasul-Nya, di mana hal itu termasuk ayat-ayat yang menunjukkan kebenaran risalah Nabi Muhammad shallallahu 'alaihi wa sallam, maka Allah menyebutkan tentang pendustaan kaumnya terhadap Beliau, yakni mereka malah berkata, bahwa Al Qur’an ini diada-ada sendiri oleh Muhammad. Hal ini termasuk perkataan yang paling aneh dan batil, karena mereka mengetahui bahwa Beliau tidak dapat membaca dan menulis, dan tidak pergi belajar kepada Ahli Kitab. Apabila mereka tetap menganggap bahwa Muhammad mengada-ada padahal telah nyata tidak demikian, maka dapat diketahui bahwa mereka hanya menentang, dan tidak ada faedahnya berdebat dengan mereka, sehingga sikap yang layak dilakukan terhadap mereka adalah berpaling dari mereka, oleh karenanya Alah Subhaanahu wa Ta'aala memerintahkan Beliau mengatakan, “Jika aku mengada-ada, akulah yang memikul dosanya, dan aku bebas dari dosa yang kamu perbuat.” Hukumannya. Yakni masing-masing menanggung dosanya sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 35",
    "description": "Allah menceritakan kisah nabi nuh untuk meneguhkan hati rasulullah dan sebagai pelajaran bagi masyarakat. Namun demikian, ternyata kaum kafir mekah tetap enggan percaya bahkan mereka kelompok orang kafir itu berkata, dia Muhammad cuma mengada-ada saja tentang Al-Qur'an. Katakanlah, wahai nabi Muhammad, jika aku mengada-ada, akulah yang akan memikul dosanya, sedang kalian bebas dari tanggung jawab. Akan tetapi, jika tuduhanmu itu tidak benar dan Al-Qur'an benar-benar bersumber dari Allah, maka kalian akan memikul dosanya dan aku bebas dari dosa yang kamu perbuat. Setelah sekian lama nabi nuh mengajak kaumnya beriman kepada Allah, namun mereka tetap dalam kekafiran sehingga nabi nuh pun menyatakan bahwa nasihatnya tidak berguna lagi. Ayat berikut ini menegaskan tentang pernyataan nabi nuh tersebut. Diwahyukan oleh Allah kepada nabi nuh, ketahuilah bahwa tidak akan beriman di antara kaummu yang selama ini keras kepala dan menolak kerasulanmu, kecuali orang yang sebelum ini benar-benar telah beriman kepada Allah dan mengakui kerasulanmu saja, karena itu janganlah engkau bersedih hati tentang apa yang mereka perbuat selama ini, dengan menolak kerasulanmu, mendurhakai tuntunanmu dan menyakiti hatimu, karena tidak lama lagi kami akan menjatuhkan hukuman atas mereka. Ketika itu nabi nuh mengadu kepada Allah dan memohon kepada-Nya, maka Allah mengabulkan permohonannya."
  }
]