[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah telah mewahyukan kepada nuh tatkala siksaan telah pasti ada pada kaumnya, bahwa sesungguhnya tidak akan beriman kepada Allah kecuali orang yang telah beriman sebelumnya. Maka janganlah kamu bersedih hati wahai nuh, terhadap apa yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Allah mewahyukan kepada Nuh, \"Sesungguhnya tidak akan ada kaummu yang beriman kepadamu -wahai Nuh selain orang-orang yang telah beriman sebelumnya. Maka janganlah engkau -wahai Nuh bersedih hati atas perbuatan mereka yang mendustakan dan menghinamu dalam kurun waktu yang panjang itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Dan disampaikan kepada Nabi Nuh bahwa tidak akan ada lagi kaumnya yang beriman selain orang-orang yang telah beriman sebelumnya. Maka janganlah kamu bersedih terhadap hinaan, pendustaan, dan gangguan yang selalu mereka lakukan karena telah datang waktu untuk membalas mereka, inilah awal dari kehancuran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَأُوحِىَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن يُؤْمِنَ مِن قَوْمِكَ إِلَّا مَن قَدْ ءَامَن (Dan diwahyukan kepada Nuh, bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman) Allah memutuskan harapan Nabi Nuh tentang keimanan mereka dengan kabar yang pasti ini kecuali orang yang telah beriman sebelumnya, agar ia berhenti menyeru mereka dan bersiap-siap untuk menyelamatkan diri. فَلَا تَبْتَئِسْ(karena itu janganlah kamu bersedih hati) Yakni janganlah kamu bersedih. Makna (الابتئاس) yakni kesedihan yang dibarengi dengan rasa murung."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pernahkah anda berfikir dan mentadabburi ayat ini, ayat yang di dalamnya menjelaskan bagaiman marahnya Allah kepada kaum-kaum yang ditetapkan bagi mereka tidak akan mendapatkan hidayah selamanya? perhatikan : { أَنَّهُ لَنْ يُؤْمِنَ مِنْ قَوْمِكَ إِلَّا مَنْ قَدْ آمَنَ } \"bahwasanya sekali-kali tidak akan beriman di antara kaummu, kecuali orang yang telah beriman (saja)\" { وَلَا أَنْتُمْ عَابِدُونَ مَا أَعْبُدُ } \"Kalian juga tidak menyemabah apa yang aku sembah, yaitu Allah yang maha esa, Dia adalah tuhan alam semesta yang hanya Dia semata yang berhak di sembah\" [ Al-Kafirun : 3 ], { لَمْ يَكُنِ اللَّهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ طَرِيقًا } \"Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka\" [ An-Nisa : 168 ], { لَا يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ } \"tidaklah bermanfaat lagi iman seseorang kepada dirinya sendiri yang belum beriman sebelum itu\" [ Al-An'am : 158 ], hal yang menggabungkan diantara ayat-ayat ini adalah bahwasanya mereka telah diberikan kesempatan untuk hidayah namun mereka mengabaikan, maka dari itu jadilah engkau bagian dari orang-orang yang takut kepada amarah Allah, senantiasa mengharap rahmat dari-Nya, dan bersegeralah memperbanyak amalan shalih sebelum kesempatan itu ditutup."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Setelah kaum Nabi Nuh dibinasakan, Allah telah mewahyukan kepada Nuh, bahwasanya kaumnya sekali-kali tidak akan beriman, kecuali orang yang telah beriman saja, karena itu janganlah kamu bersedih hati tentang apa yang selalu mereka kerjakan berupa dusta dan kezhaliman. Ayat ini adalah penghibur atas kesedihan nabi Nuh atas keimanan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diwahyukan kepada Nuh bahwa tidak akan beriman di antara kaummu, kecuali orang yang benar-benar telah beriman. Maka janganlah kamu bersedih} maka janganlah bersedih {atas apa yang selalu mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36 firmanNya “dan diwahyukan kepada Nuh, bahwasannya sekali kali tidak akan beriman diantara kaummu, kecuali orang yang telah beriman (saja)” yakni mereka adalah orang orang yang keras hatinya. ”karena itu janganlah kamu bersedih hati tentang apa yang selalu mereka kerjakan” jangan bersedih, jangan hiraukan mereka dan keadaan mereka, karena Allah telah murka kepada mereka dan menimpakan azabNya yang tak bisa ditolak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : Makna kata : (و أوحي إلى نوح) Wa uuhiya ilaa nuuh : ketahui lah, Allah mewahyukan kepadanya. Wahyu adalah pemberitaan yang cepat lagi tersembunyi. (فلا تبتئس) Falaa tabtais : janganlah sedih, karena Aku akan menyelamatkan mu dan menghancurkan mereka. Makna ayat : Pembahasan kembali kepada kisah Nabi Nuh—setelah diselingi dengan ayat 35. (و أوحي إلى نوح أنه لن يؤمن من قومك إلا من قد آمن) Tidak akan ada yang beriman lagi dari kaum mu setelah mereka (yang telah beriman kepada Nabi Nuh). Ini terjadi setelah beliau mendakwahi kaumnya selama seribu kurang lima puluh tahun (950 tahun). Tidak akan ada yang beriman lagi dari kaum mu, oleh karena itu (فلا تبتئس) jangan gusar dan sedih atas apa yang telah mereka lakukan, berupa keburukan, kerusakan, ingkar, dan maksiat, Aku akan menyelamatkan mu dan orang-orang bersama mu dari kalangan orang-orang beriman, dan Aku akan menenggelamkan mereka. Pelajaran dari ayat : • Tidak boleh nya bersedih dan berkecil hati dengan perilaku pelaku keburukan dan kerusakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 36: Berupa perbuatan syirk, karena Allah telah murka kepada mereka. Maka Nabi Nuh ‘alaihis salam mendoakan kebinasaan kepada mereka, “Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi.---Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka tidak akan melahirkan selain anak yang berbuat maksiat lagi sangat kafir.” (lihat Nuh: 26-27) Allah pun mengabulkan doanya dan berfirman seperti yang tersebut dalam ayat di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 36",
    "description": "Setelah sekian lama nabi nuh mengajak kaumnya beriman kepada Allah, namun mereka tetap dalam kekafiran sehingga nabi nuh pun menyatakan bahwa nasihatnya tidak berguna lagi. Ayat berikut ini menegaskan tentang pernyataan nabi nuh tersebut. Diwahyukan oleh Allah kepada nabi nuh, ketahuilah bahwa tidak akan beriman di antara kaummu yang selama ini keras kepala dan menolak kerasulanmu, kecuali orang yang sebelum ini benar-benar telah beriman kepada Allah dan mengakui kerasulanmu saja, karena itu janganlah engkau bersedih hati tentang apa yang mereka perbuat selama ini, dengan menolak kerasulanmu, mendurhakai tuntunanmu dan menyakiti hatimu, karena tidak lama lagi kami akan menjatuhkan hukuman atas mereka. Ketika itu nabi nuh mengadu kepada Allah dan memohon kepada-Nya, maka Allah mengabulkan permohonannya. Dan Allah memberikan perintah kepada nabi nuh, buatlah sebuah kapal untuk menyelamatkanmu dan pengikut-pengikutmu itu dengan pengawasan dan petunjuk wahyu kami tentang tata cara pembuatannya, dan janganlah engkau bicarakan dengan aku sesuatu hal tentang orangorang yang zalim. Apakah engkau berharap kepada-ku agar aku memberi maaf kepada mereka, atau engkau memohon agar aku tangguhkan atau ringankan siksa bagi mereka, karena keputusan-ku telah kutetapkan bahwa sesungguhnya mereka itu akan ditenggelamkan."
  }
]