[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan nuh membuat kapal. Tiap kali dari sekelompok orang dari para pembesar kaumnya melewatinya, mereka memperolok-oloknya. Maka nuh berkata kepada mereka ”jika kalian mengejek kami sekarang lantaran kebodohan kalian terhadap kebenaran ancaman Allah, maka kami akan mengolok-olok kalian esok hari ketika kalian tenggelam, sebagaimana kalian mengejek kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Kemudian Nuh menjalankan perintah Tuhannya dan mulai membuat kapal. Setiap kali melewatinya, para pembesar dan para pemuka kaumnya selalu mengejeknya. Hal itu karena Nuh membuat kapal di daerah yang jauh dari air dan sungai. Setelah mereka terus-menerus mengejeknya maka Nuh berkata, \"Jika kalian mengejek kami sekarang ketika kami membuat kapal, maka kelak kami akan mengejek kalian. Karena kalian tidak tahu bahwa kalian nanti akan tenggelam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Kemudian Nabi Nuh mulai membuat kapal dengan penuh kesungguhan dan semangat; sedangkan orang-orang merasa heran dan mulai mengejeknya, mereka menghina dan berusaha menghilangkan semangatnya, serta mengolok-oloknya setiap pagi dan petang hari, mereka menganggap apa yang dilakukan itu sangat aneh. Namun Nabi Nuh membalas mereka dengan peringatan: “Sebaiknya kalian melihat keadaan diri kalian sebelum datangnya ketetapan Allah dan turunnya azab. Jika pembuatan kapal untuk keselamatan ini adalah sesuatu yang mengherankan, maka kelalaian kalian dari dekatnya ajal kalian merupakan hal yang lebih mengherankan lagi! Dan jika kalian menghina kami dan mengejek apa yang kami lakukan, maka kami akan menghina kalian karena telah lalai dari azab yang segera datang.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَيَصْنَعُ الْفُلْكَ (Dan mulailah Nuh membuat bahtera) Yakni Nabi Nuh mulai membuat perahu. سَخِرُوا۟ مِنْهُ ۚ (mereka mengejeknya) Mereka berkata “hai Nuh, kamu sekarang menjadi tukang kayu setelah dulunya adalah seorang nabi” atau dengan mengatakan “ia membuat parahu di daratan, lalu bagaimana perahu itu akan berlayar” قَالَ إِن تَسْخَرُوا۟ مِنَّا(Berkatalah Nuh: “Jika kamu mengejek kami) Disebabkan pekerjaan kami mebuat perahu saat ini, maka kami akan mengejek kalian kelak ketika kalian tenggelam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan mulailah Nuh membuat bahtera. Setiap kali pemimpin kaumnya berjalan meliwati Nuh, mereka mengejeknya, “Apakah sekarang engkau menjadi tukang kayu setelah engkau menjadi Nabi?”, sebab mereka tahu bahwa mereka sedang berada di daratan yang jauh dari air. Nuh berkata: “Jika kamu mengejek kami, maka sesungguhnya kami pun mengejekmu ketika kamu ditenggelamkan, sebagaimana kamu sekalian mengejek kami."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan dia membuat bahtera itu. Setiap kali berjalan melewatinya pemuka} pemuka {dari kaumnya, mereka mengejeknya. Dia berkata,“Jika kalian mengejek kami, sesungguhnya kami akan mengejek kalian sebagaimana kalian mengejek"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Nuh menaati perintah Allah, dia mulai membuat bahtera. ”dan setiap kali pemimpin kaumnya berjalan melewat Nuh“ dan melihat perahu yang Nuh buat “mereka mengejeknya. Berkatalah Nuh ‘jika kamu mengejek kami” sekarang “maka sesungguhnya kami pun mengejekmu sebagaimana kamu sekalian mengejek (kami)”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman-Nya (ويصنع الفلك و كلما مر عليه ملأ من قومه سخروا منه) Allah menceritakan keadaan Nuh ketika ia membuat sebuah kapal: dari memotong kayu, memproses, dan merakitnya; kaumnya lalu lalang di hadapannya dan setiap kali para pembesar kaumnya lewat, mereka mengejeknya, “Wahai Nuh, engkau sekarang menjadi seorang tukang kayu.”, atau “Engkau mau membawa laut kesini, atau membawa kapal itu ke laut ?” kemudian beliau membalas perkataan mereka (إن تسخروا منا فإنا نسخر منكم كما تسخرون) jika kalian mengejek kami, kami akan mengejek kalian pula. Pelajaran dari ayat : • Sudah menjad ketentuan bahwa orang-orang yang benar dan mengajak kepada kebenaran pasti akan dihina, karena gelapnya jiwa mereka disebabkan kekufuran dan maksiat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 38: Apabila kami selamat dan kamu tenggelam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 38",
    "description": "Setelah Allah memerintahkan nabi nuh untuk membuat kapal dan memberi informasi tentang keputusan Allah untuk menenggelamkan kaumnya yang durhaka, mulailah dia, yakni nabi nuh membuat sebuah kapal besar di bawah bimbingan dan petunjuk Allah. Setiap kali pemimpin kaumnya berjalan melewati nabi nuh yang sedang membuat kapal, mereka mengejeknya karena mereka tidak mengetahui tentang tujuan nabi nuh membuat kapal itu. Dia nabi nuh tidak menghiraukan ejekan mereka dan hanya berkata, jika kamu sekarang mengejek kami, maka kami, yaitu aku dan orang-orang yang membantuku membuat kapal, akan mengejekmu ketika azab itu datang sebagaimana kamu sekarang mengejek kami terus-menerus. Maka kelak kamu akan mengetahui siapa di antara kita yang akan ditimpa azab yang menghinakan di dunia ini dan siapa pula yang akan ditimpa azab yang kekal di akhirat nanti."
  }
]