[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalian akan mengetahui bila ketetapan Allah telah tiba terkait ancaman tersebut, siapakah orang yang akan terkena siksaan Allah di dunia yang akan menghinakannya dan selanjutnya akan diturunkan kepadanya siksaan abadi ahirat tanpa putus?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Kelak kalian akan tahu bahwa orang yang mendapatkan azab Allah di dunia akan terhina dan celaka. Dan di Hari Kiamat nanti ia akan mendapatkan azab yang kekal dan tidak terputus.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Kelak kalian akan mengetahui siapa yang akan ditimpa azab yang menghinakan dan mengantarkannya menuju azab yang kekal. Nabi Nuh mengancam mereka bahwa azab di dunia merupakan awal dari azab akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. عَذَابٌ يُخْزِيهِ (azab yang menghinakannya) Yakni azab ditenggelamkan di dunia. وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ(dan yang akan ditimpa azab yang kekal) Yakni azab neraka yang kekal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Kelak kamu akan mengetahui siapa yang akan ditimpa oleh azab yang menghinakan dan juga siapa yang akan ditimpa azab yang kekal yaitu azab neraka”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka kalian akan mengetahui siapa yang akan ditimpa azab yang menghinakan} yang merendahkan dan menghinakannya {dan yang akan ditimpa} yang akan diturunkan kepadanya {azab yang kekal.”} kekal dan tidak ada hentinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39 “kelak kamu akan mengetahui siapa yang akan ditimpa oleh azab yang menghinakannya dan siapa yang akan ditimpa azab yang kekal” kami atau kamu? mereka mengetahuinya ketika azab turun menimpa mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يخزيه) Yukhziih : merendahkan dan menghinakan. (و يحل عليه عذاب مقيم) Wa yahillu ‘alaihi ‘adzabum muqiim : jatuh kepadanya azab neraka pada hari kiamat, dan tidak akan bisa lolos. Makna ayat : (فسوف تعلمون) kalian akan mengetahui nanti (من يأتيه عذاب يخزيه) siapa yang akan tertimpa azab yang menghinakan dan menghancurkan kesombongan kalian. (و يحل عليه عذاب مقيم) azab neraka hari kiamat kelak, azab yang kekal tidak ada akhirnya. Pelajaran dari ayat : • Penjelasan akan benarnya janji Allah bagi para rasulNya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 39",
    "description": "Maka kelak kamu akan mengetahui siapa di antara kita yang akan ditimpa azab yang menghinakan di dunia ini dan siapa pula yang akan ditimpa azab yang kekal di akhirat nanti. Demikianlah kaum nabi nuh yang terus-menerus mengejeknya dalam pembuatan kapal. Hingga apabila perintah kami datang untuk membinasakan para pendurhaka dan tiba perintah kami kepada nabi nuh beserta pengikutnya menaiki kapal dan air dari dalam tanur, yakni periuk telah mendidih dan bergejolak hingga memancarkan air dengan sangat deras, lalu kami berfirman kepada nabi nuh, muatkanlah ke dalamnya segala jenis hewan, dari masing-masing sepasang jantan dan betina, dan muatkan juga keluargamu yang beriman kepada Allah kecuali orang yang telah terkena ketetapan terdahulu sebagai orang yang akan diazab karena kedurhakaan mereka, dan muatkan pula orang yang beriman dari mereka. Ternyata orang-orang beriman yang ikut bersama dengan nabi nuh hanya sedikit. Meskipun nabi nuh sudah berdakwah kurang lebih 950 tahun lamanya, mengajak umatnya beriman kepada Allah dan meyakinkan bahwa mereka yang tidak mengikuti ajakannya akan ditenggelamkan, tetapi mereka tetap durhaka. (lihat: surah al- 'ankabut/29:14)."
  }
]