[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kepada Allah kalian kembali setelah kematian kalian semua, maka takutlah akan siksaanNya. Sebab Allah mahakuasa untuk membangkitkan kalian, mengumpulkan kalian dan memberikan balasan bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Hanya kepada Allah-lah kalian –wahai manusia- akan kembali di Hari Kiamat. Dan Dia Maha Kuasa atas segala sesuatu, tidak ada sesuatupun yang dapat melemahkan-Nya. Tidak akan susah bagi-Nya menghidupkan dan menghisab kalian sesudah kematian dan kebangkitan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Kepada Allah kalian akan kembali. Dia Maha Kuasa atas segalanya; termasuk berkuasa dalam membangkitakan, menghisab, dan membalas kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِلَى اللهِ مَرْجِعُكُمْ ۖ (Kepada Allah-lah kembalimu) Kalian kembali kepada-Nya dengan kematian, kemudian kebangkitan, kemudian pembalasan. Dan kalian tidak akan kembali kepada selain-Nya. وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ(dan Dia Maha Kuasa atas segala sesuatu) Dan termasuk kuasa-Nya adalah pembangkitan, pengumpulan, dan pembalasan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4 Kepada Allah-lah kamu akan kembali pada hari kebangkitan, dan Dia Maha Kuasa atas segala sesuatu. Pahala dan siksa adalah mutlak dari-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kepada Allahlah kalian dikembalikan. Dia Maha kuasa atas segala sesuatu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Lalu Allah membalas perbuatan mereka, jika baik maka baik, jika buruk maka buruk. Dan FirmanNya, “dan Dia Mahakuasa atas segala sesuatu.” Sebagai dalil bahwa Allah menghidupkan yang mati karena Dia Mahakuasa atas segala sesuatu. Termasuk kategori sesuatu itu adalah menghidupkan orang mati. Dia telah mengabarkan itu, dan Dia adalah pembicara paling benar, maka dari segi akal dan syariat hal itu pasti terjadi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Firman-Nya (إِلَى ٱللَّهِ مَرۡجِعُكُمۡۖ) Allah mengkabarkan setelah memperingati mereka dengan azab pada hari kiamat, bahwa mereka pasti akan kembali kepada-Nya, Dia akan menghidupkan mereka kembali kemudian mengumpulkan mereka dihadapan-Nya serta membalas perbuatan mereka dengan keadilan dan rahmat-Nya. (وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ) Maha Kuasa untuk menghidupkan setelah kematian mereka, membalas keburukan mereka dengan yang setimpal, mengganjar kebaikan dengan sepuluh kali lipat. Inilah keadilan dan kasih sayang yang tidak ada taranya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 4: Termasuk di antaranya Dia mampu memberikan pahala dan menimpakan siksa. Kata-kata ini seakan-akan seperti dalil yang menunjukkan bahwa Allah Subhaanahu wa Ta'aala berkuasa menghidupkan orang yang telah mati sebagai bantahan terhadap orang-orang kafir yang mengingkarinya sebagaimana tersebut dalam ayat 7."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 4",
    "description": "Karena hanya kepada Allah-lah kamu kembali pada hari kiamat nanti. Dia mahakuasa atas segala sesuatu. Setelah menjelaskan bahwa seluruh manusia akan kembali dan menghadap Allah pada hari kiamat nanti, lalu ayat ini menjelaskan bahwa pengetahuan Allah meliputi apa saja yang ditampakkan maupun yang disembunyikan. Ingatlah, sesungguhnya mereka, yaitu orang-orang munafik, memalingkan dada dari kebenaran agama yang dibawa oleh nabi Muhammad, untuk menyembunyikan sesuatu dalam diri, yakni permusuhan dan kemunafikan mereka dari dia, yakni nabi Muhammad. Ingatlah, ketika mereka dengan sungguh-sungguh menyelimuti, menutupi diri-Nya dengan kain agar tidak terlihat oleh Allah dan nabi Muhammad, Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan, yakni tampakkan, sungguh, Allah maha mengetahui segala isi hati dan segala yang tersembunyi."
  }
]