[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hingga apabila datang ketetapan kami untuk membinasakan mereka sebagai mana Kami telah janjikan kejadian itu kepada Nuh, dan air memancar dengan kuat dari tungku api (yaitu tempat memebakar roti) sebagai tanda akan datangnya siksaan, Kami berfirman kepada Nuh, “Angkutlah ke dalam kapal itu segala jenis binatang jantan dan betina, dan angkutlah ke dalamnya keluargamu, kecuali orang yang telah berlaku padanya ketetapan (Allah) pada mereka sebagai orang yang tidak akan beriman kepada Allah, ” seperti putra dan istrinya. “ Dan angkutlah ke dalamnya orang yang beriman bersamamu dari kaummu. ” Dan tidaklah beriman bersamanya kecuali berjumlah sedikit, meski telah berlalu masa waktu yang panjang dan tinggal lama berada di tengah mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Nuh -'alaihissalām- berhasil menyelesaikan pembuatan kapal yang Allah perintahkan. Sampai ketika datang perintah Kami untuk membinasakan mereka dan air menyembur dari dalam tungku yang semula mereka gunakan untuk membuat roti sebagai pertanda dimulainya serangan air bah maka Kami berfirman kepada Nuh -'alaihissalām-, \"Angkutlah ke dalam kapalmu segala jenis binatang yang ada di muka bumi ini masing-masing satu pasang, jantan dan betina. Angkutlah juga seluruh keluargamu, kecuali yang sudah ditetapkan sebelumnya bahwa ia akan tenggelam karena tidak mau beriman. Dan angkutlah orang-orang beriman yang menjadi pengikutmu di antara kaummu.\" Sementara hanya sedikit saja di antara kaumnya yang mau beriman dan menjadi pengikutnya, walaupun dia menghabiskan waktu yang lama untuk mengajak mereka beriman kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Hingga ketika telah datang ketetapan itu, dan tungku telah mengeluarkan air, sebagai tanda waktu untuk menaiki kapal, karena air telah meninggi dan tanda datangnya kebinasaan kaumnya akibat banjir bandang. Maka muatlah satu pasang dari setiap jenis semua makhluk, dan muatlah keluargamu kecuali mereka yang telah ditetapkan sebelumnya untuk tidak beriman. Dan tidak ada yang beriman kecuali sedikit dari anggota keluarganya dan kaumnya yang lain, padahal Nabi Nuh telah tinggal bersama mereka dalam waktu yang cukup lama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. وَفَارَ التَّنُّورُ (dan dapur telah memancarkan air) Yakni air itu memancar dari tannur. Tannur merupakan kuali yang dipakai untuk memasak roti. Dan pendapat lain mengatakan tannur merupakan permukaan bumi. Dan pancaran air merupakan tanda berawalnya banjir bandang. قُلْنَا احْمِلْ فِيهَا مِن كُلٍّ زَوْجَيْنِ اثْنَيْنِ (Kami berfirman: “Muatkanlah ke dalam bahtera itu dari masing-masing binatang sepasang) Yakni naikkanlah ke atas perahu setiap jenis hewan yang ada di bumi sepasang-sepasang. وَأَهْلَكَ(dan keluargamu) Allah memerintahkan Nabi Nuh untuk membawa bersamanya keluarganya, yakni anak-anak dan istrinya. إِلَّا مَن سَبَقَ عَلَيْهِ الْقَوْلُ (kecuali orang yang telah terdahulu ketetapan terhadapnya) Yakni yang telah ditetapkan sebelumnya bahwa ia termasuk orang-orang yang akan ditenggelamkan. وَمَنْ ءَامَنَ ۚ (dan (muatkan pula) orang-orang yang beriman) Yakni, dan naikkanlah ke atas perahu orang yang beriman dari kaummu bersamamu. Kemudian Allah menyebutkan orang-orang beriman bahwa mereka berjumlah sedikit jika hal ini dibandingkan dengan orang-orang yang kafir terhadapnya. وَمَآ ءَامَنَ مَعَهُۥٓ إِلَّا قَلِيلٌ(Dan tidak beriman bersama dengan Nuh itu kecuali sedikit) Terdapat pendapat mengatakan mereka berjumlah 80 orang, tiga diantara mereka adalah anak-anaknya, yaitu Sam, Ham, dan Yafits; serta istri anak-anak Nabi Nuh ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Hingga apabila perintah Kami untuk membinasakan itu datang dan bumi telah memancarkan air sebagai tanda datangnya bencana banjir bandang, Kami berfirman kepada Nuh: “Muatlah setiap binatang dengan sepasang jantan dan betina ke dalam bahtera itu, serta muatlah keluargamu kecuali orang yang telah ditetapkan bahwa mereka akan ditenggelamkan. Muatlah pula orang-orang yang beriman”. Orang-orang yang beriman bersama dengan Nuh itu hanya sedikit. Mereka berjumlah 80 orang, 3 orang dari keluarganya, yaitu Sam, Ham. Yafits dan istri-istri mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sehingga apabila perintah Kami datang perintah Kami} azab Kami {dan tungku telah memancarkan air} air yang memancar dengan kuat dari tungku yang digunakan untuk memberi minum {Kami berfirman,“Muatlah ke dalamnya} dalam bahtera itu {dari setiap (binatang) sepasang-sepasang (jantan dan betina), dan keluargamu kecuali orang yang telah berlaku ketetapan terdahulu atas dia} orang yang telah berlaku ketetapan atasnya bahwa dia termasuk orang-orang yang ditenggelamkan {dan orang yang beriman. Dan tidak ada yang beriman bersamanya, kecuali hanya sedikit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40 “hingga apabila perintah kami datang” yakni takdir kami tentang turunnya azab kepada mereka, ”dan dapur perapian telah memancarkan air” yakni Allah menurunkan hujan deras dan memancarkan bumi dengan mata air sampai sampai tungku di dapur yang biasanya menyala dengan api dan jauh dari air ikut seerta memancarkan air, maka kedua air itu bertemu atas dasar perkara yang telah ditakdirkan. ”kami berfirman kepada Nuh 'muatkanlah ke dalam bahtera itu dari masing masing binatang sepasang (jantan dan betina)” maksudnya, jantan dan betina dari setiap spesies makhluk agar cikal bakal makhluk tetap terjaga. Adapun sisa spesies yang lebih dari sepasang, maka ia tidak diangkut karena perahu tidak mampu membawanya. ”dan keluargamu kecuali orang yang ketetapan (takdir terhadap yang terdahulu” dari golongan kaum kafir seperti anaknya yang tenggelam. ”dan (muatkan pula) orang orang yang beriman” padahal ketika itu ”tidak beriman bersama dengan Nuh itu kecuali sedikit”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فار التنور) Faarat tannuur : keluarnya air dan meluap dari (التنور) yaitu tempat untuk memanggang roti. (زوجين اثنين) Zaujainitsnain : dari jenis laki dan perempuan, sepasang dari segala jenis makhluk hidup. (وأهلك) Wa ahlaka : Istri dan anak-anakmu. Makna ayat : Allah berfirman (حتى إذا جاء أمرنا و فار التنور) “Hingga apabila perintah Kami datang dan dapur telah memancarkan air” lanjutkan lah pembuatan kapal, sampai datang ketentuan Kami—pemusnahan orang-orang musyrik, dan (التنور وفار) air keluar dari dalam at-tannuur (tempat memasak roti) dan meluber. Itu adalah tanda dimulainya banjir besar, maka angkutlah ke dalamnya—kapal yang telah engkau buat, dua jenis dari setiap makhluk, yaitu jantan dan betina. (و أهلك) dan bawa pula keluargamu: istri dan anakmu, Kusam, Ham, dan Yafuts, (إلا من سبق عليه القول) kecuali yang telah Kami tetapkan kehancuran mereka: seperti istri Nuh, Wa’ilah dan anaknya Kan’an. (و من آمن) dan bawa pula orang-orang yang beriman dari seluruh manusia. (و ما آمن معه إلا قليل) tidak lah yang beriman kepada kecuali sedikit, sekitar 80 laki-laki dan perempuan, ini adalah penjelasan ayat 40. Pelajaran dari ayat : • Bahwa iman akan memberikan keselamatan, sedangkan kekufuran membawa petaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 40: Yakni qadar-Nya yang menetapkan waktu turunnya azab. Sebagai tanda bagi Nabi Nuh ‘alaihis salam akan tiba banjir besar. Yakni istri dan anak-anakmu. Yakni ketetapan untuk dibinasakan, seperti anaknya Kan’an dan seorang istrinya, sedangkan anak-anaknya yang lain, yaitu Sam, Ham dan Yafits dan tiga orang istrinya ikut bersama Nabi Nuh ‘alaihis salam. Ada yang mengatakan, bahwa orang yang beriman bersama Nabi Nuh hanya enam orang bersama para istrinya. Ada yang mengatakan, jumlah orang yang berada di kapal ada delapan puluh orang, separuhnya laki-laki, dan separuhnya lagi perempuan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 40",
    "description": "Demikianlah kaum nabi nuh yang terus-menerus mengejeknya dalam pembuatan kapal. Hingga apabila perintah kami datang untuk membinasakan para pendurhaka dan tiba perintah kami kepada nabi nuh beserta pengikutnya menaiki kapal dan air dari dalam tanur, yakni periuk telah mendidih dan bergejolak hingga memancarkan air dengan sangat deras, lalu kami berfirman kepada nabi nuh, muatkanlah ke dalamnya segala jenis hewan, dari masing-masing sepasang jantan dan betina, dan muatkan juga keluargamu yang beriman kepada Allah kecuali orang yang telah terkena ketetapan terdahulu sebagai orang yang akan diazab karena kedurhakaan mereka, dan muatkan pula orang yang beriman dari mereka. Ternyata orang-orang beriman yang ikut bersama dengan nabi nuh hanya sedikit. Meskipun nabi nuh sudah berdakwah kurang lebih 950 tahun lamanya, mengajak umatnya beriman kepada Allah dan meyakinkan bahwa mereka yang tidak mengikuti ajakannya akan ditenggelamkan, tetapi mereka tetap durhaka. (lihat: surah al- 'ankabut/29:14). Dan dia pun berkata kepada kaumnya yang beriman, naiklah kamu semua bersamaku ke dalamnya, yakni kapal itu dengan menyebut nama Allah pada waktu kapal mulai berlayar dan setelah berlabuhnya, seraya berserah diri kepada-Nya. Sesungguhnya tuhanku maha pengampun atas dosa orang yang bertobat, dan maha penyayang kepada siapa saja yang menempuh jalan kebenaran. Ayat ini mengandung pesan, tentang keharusan tawakal kepada Allah ketika memulai suatu aktivitas maupun setelah persoalan selesai, dan berbaik sangka kepada-Nya."
  }
]