[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nuh berkata kepada orang-orang yang telah beriman bersamanya, “ Naiklah kalian ke dalam kapal dengan menyebut nama Allah ketika berlayar ke atas permukaan air dan dengan menyebut nama Allah pada akhir perjalanan dan berlabuhnya. Sesungguhnya Tuhanku Maha pengampun dosa-dosa orang-orang yang bertaubat dan kembali kepadaNya dari hamba-hambaNya, juga Maha penyayang terhadap mereka dengan tidak menyiksa mereka setelah mereka bertaubat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Nuh -'alaihissalām- berkata kepada keluarganya dan kaumnya yang beriman, \"Naiklah kalian ke dalam kapal. Dengan nama Allah-lah kapal ini berlayar. Dan dengan nama Allah pula kapal ini berlabuh. Sesungguhnya Tuhanku Maha Pengampun terhadap dosa-dosa hamba-hamba-Nya yang bertobat lagi Maha Penyayang kepada mereka. Salah satu bentuk kasih sayang-Nya kepada orang-orang mukmin ialah Dia menyelamatkan mereka dari kebinasaan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Nabi Nuh berkata kepada orang-orang yang beriman kepadanya setelah terjadinya apa yang telah dijanjikan: “Naiklah ke kapal dengan menyebut nama Allah saat mulai berlayar dan saat telah berlabuh. Sungguh Tuhanku Maha Pengampun bagi orang yang beriman kepada-Nya, dan Maha Pengasih kepada para nabi dan kekasih-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَقَالَ ارْكَبُوا۟ فِيهَا (Dan Nuh berkata: “Naiklah kamu sekalian ke dalamnya) Yang mengatakan ini adalah nabi Nuh. Ia mengatakan ini agar mereka merasakan kelembutan dan rahmat Allah kepada mereka. بِسْمِ اللهِ مَجْر۪ىٰهَا وَمُرْسَىٰهَآ ۚ( dengan menyebut nama Allah di waktu berlayar dan berlabuhnya) Yakni ketika berlayar di banjir bandang dan ketika berlabuh setelah itu. إِنَّ رَبِّى لَغَفُورٌ(Sesungguhnya Tuhanku benar-benar Maha Pengampun) Atas dosa-dosa. رَّحِيمٌ(lagi Maha Penyayang) Dan bagian dari kasih sayang-Nya adalah Allah menyelamatkan golongan ini sebagai karunia dari-Nya, agar berbagai jenis hewan yang dimuat di atas perahu tetap ada, dan untuk eksistensi manusia setelah musibah banjir bandang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Nuh berkata kepada orang-orang yang dia bawa di dalam bahtera: “Naiklah kamu sekalian ke dalamnya dengan menyebut nama Allah di waktu berlayar dan berlabuhnya”. Sesungguhnya Tuhanku benar-benar Maha Pengampun lagi Maha Penyayang bagi orang-orang yang bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nuh berkata,“Naiklah ke dalamnya dengan (menyebut) nama Allah pada waktu berlayar} ketika berlayar di atas air {dan berlabuhnya} dan dengan menyebut nama Allah ketika selesai pelayarannya {Sesungguhnya Tuhanku benar-benar Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. ”dan Nuh berkata” kepada orang orang yang Allah perintahkan agar mereka diangkut. ”naiklah kamu sekalian ke dalamnya dengan menyebut nama Allah di waktu berlayar dan berlabuhnya” bahtera itu berlayar dengan nama Allah, berlabuh dengan nama Allah dan berjalan dengan perintah dan instruksiNya. ”sesungguhnya Rabbku benar benar maha Pengampun lagi Maha Penyayang” dimana Dia mengampuni kami menyayangi kami dan menyelamatkan kami dari kaum yang zhalim."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مجريها و مرساها) Majreehaa wa mursaahaa : berjalan dan berlayarnya kapal. Makna ayat : Kemudian Allah menceritakan bahwa Dia berfirman kepada Nuh dan orang-orang beriman (اركبوا فيها) “Naiklah ke dalamnya.”, kapal (بسم الله مجريها و مرساها) dengan nama Allah, kapal ini berlayar dan dengan nama-Nya pula kapal ini berlabuh. (إني ربي لغفور رحيم) Rabb ku Maha Pengampun dan Penyayang, tidak mengazab kami atas dosa yang terkadang kami lakukan, lantas merahmati, menyelamatkan, dan memuliakan kami. Pelajaran dari ayat : • Disyariatkannya mengucapkan basmalah ketika berkendara, baik dengan kapal atau yang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 41: Karena Dia akan menyelamatkan kita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 41",
    "description": "Dan dia pun berkata kepada kaumnya yang beriman, naiklah kamu semua bersamaku ke dalamnya, yakni kapal itu dengan menyebut nama Allah pada waktu kapal mulai berlayar dan setelah berlabuhnya, seraya berserah diri kepada-Nya. Sesungguhnya tuhanku maha pengampun atas dosa orang yang bertobat, dan maha penyayang kepada siapa saja yang menempuh jalan kebenaran. Ayat ini mengandung pesan, tentang keharusan tawakal kepada Allah ketika memulai suatu aktivitas maupun setelah persoalan selesai, dan berbaik sangka kepada-Nya. Setelah nabi nuh bersama pengikutnya masuk ke dalam kapal dan kapal itu pun mulai berlayar membawa mereka ke dalam gelombang yang tingginya laksana gunung-gunung, dan sebelum itu nabi nuh pun memanggil anaknya yang tidak ikut bersamanya, ketika dia, yakni kan'an, anak yang tidak beriman itu, berada di tempat yang jauh terpencil. Lalu nabi nuh memanggilnya dengan penuh kasih dan harap, wahai anakku, kemari dan naiklah ke kapal bersama kami agar engkau selamat, dan janganlah engkau tetap dalam keingkaran bersama orang-orang kafir, nanti kamu akan tenggelam binasa. Suatu petunjuk tentang kebenaran risalah walaupun sudah disertai keterangan dan bukti yang kuat, tidak akan bermanfaat kecuali bila ada taufik dari Allah."
  }
]