[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kapal itu berlayar bersama mereka dalam golongan ombak yang meninggi lagi memuncak hingga seperti gunung-gunung dan ketinggianya. Dan Nuh memanggil putranya (dan putranya berada di suatu tempat tersendiri jauh dari kaum Mukminin) Nuh berkata kepada putranya, “Wahai, putraku naiklah bersama kami ke dalam kapal, dan janganlah kamu termasuk orang-orang yang kafir kepada Allah, akibatnya kamu akan tenggelam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Kapal itu berlayar dengan membawa para penumpangnya yang terdiri dari manusia dan lainnya di tengah ombak yang sangat besar laksana gunung. Dan Nuh -'alaihissalām- dengan kelembutannya sebagai ayah berkata kepada putranya yang kafir dan terpisah dari ayahnya dan kaumnya di suatu tempat, \"Wahai anakku! Naiklah bersama kami di dalam kapal, agar kamu tidak tenggelam. Janganlah kamu bersama orang-orang kafir, karena kamu akan tenggelam seperti mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. mata-mata air memancarkan air yang sangat besar, dan langit menurunkan hujan yang sangat deras, sedangkan kapal itu terbawa arus air menghadapi hempasan ombak-ombak yang sangat besar. Ketika itu, Nabi Nuh dengan kasih sayang orang tua, memanggil anaknya yang masih kafir dengan harapan keadaan yang mengerikan itu berpengaruh terhadapnya, sehingga dia berusaha untuk selamat dan mengikuti ayahnya. Ketika itu anaknya masih jauh dari air dari langit dan bumi, kemudian air saling bertemu. Nabi Nuh berseru: “Hai anakku, kemari dan naiklah bersama kami agar kamu dapat selamat dari kebinasaan, dan janganlah bersama orang-orang kafir sehingga kamu tertimpa azab mereka dan merugi di kehidupan akhiratmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَهِىَ تَجْرِى بِهِمْ فِى مَوْجٍ كَالْجِبَالِ (Dan bahtera itu berlayar membawa mereka dalam gelombang laksana gunung) Dalam ayat ini terdapat penjelasan bertapa luar biasanya huru-hara dan bersarnya angin serta besarnya banjir bandang yang menenggelamkan bumi, namun meski begitu Allah masih menyelamatkan perahu itu bersama penumpangnya sebagai karunia dan rahmat dari-Nya وَنَادَىٰ نُوحٌ ابْنَهُۥ (Dan Nuh memanggil anaknya) Terdapat pendapat mengatakan, ia adalah Kan’an yang termasuk orang kafir, dan pendapat lain mengatakan ia termasuk orang munafik. وَكَانَ فِى مَعْزِلٍ (sedang anak itu berada di tempat yang jauh terpencil) Terpencil dari kaum dan kerabatnya sehingga tidak sampai kepadanya perkataan Nuh “naiklah ke atas perahu”. Pendapat lain mengatakan yang dimaksud adalah jauh dari agama ayahnya (Nuh). وَلَا تَكُن مَّعَ الْكٰفِرِينَ (dan janganlah kamu berada bersama orang-orang yang kafir) Bersama orang-orang kafir di luar perahu. Atau maknanya adalah janganlah kamu berada dalam agama mereka (orang-orang kafir) karena mereka akan binasa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "42-43 1 ). Nuh berkata kepada anaknya : { ارْكَبْ مَعَنَا وَلَا تَكُنْ مَعَ الْكَافِرِينَ } \"Hai anakku, naiklah (ke kapal) bersama kami dan janganlah kamu berada bersama orang-orang yang kafir\" Nuh tidak mengatakan : \"bersama orang-orang yang tenggelam\" atau \"bersama orang-orang yang binasa itu\"; karena musibah yang sesungguhnya adalah kufur dan bukan kematian karena tenggelam. 2 ). Sesungguhnya meniti jalannya orang-orang beriman dan bermajlis bersama mereka, serat bergabung bersama mereka adalah jalan menuju keselamatan yang sebenarnya; karena mereka senantiasa berada di sisi Allah dan mereka juga senantiasa mendapatkan pertolongan dari-Nya, sekalipun mereka terhampas oleh fitnah dunia, akan tetapi sebab-sebab mereka menuju keselamatan sangat mudah; bagaikan kapal kayu yang terombang-ambing di tengah ombak laut yang tingginya seperti gunung, sebagaimana meniti jalan bersama orang-orang kafir dan munafiq adalah jalan menuju kebisaan, sekalipun mereka memiliki segala bentuk dan jumlah materi kekayaan dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Bahtera itu berlayar membawa mereka dalam gelombang yang setinggi gunung. Dan Nuh memanggil anaknya, sedang anak itu berada di tempat yang jauh terpencil: “Hai anakku, naiklah ke kapal bersama kami dan janganlah kamu berada bersama orang-orang yang kafir sebab mereka akan binasa”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahtera itu berlayar membawa mereka melewati ombak yang seperti gunung-gunung. Nuh memanggil anaknya, sedang dia berada di tempat terpencil} tempat yang jauh dari bahtera {“Wahai anakku, naiklah bersama kami dan janganlah bersama orang-orang kafir.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. kemudian Allah menjelaskan bagaimana bahtera itu berlayar seolah olah kita melihatnya, seraya Dia berfirman ”dan bahtera itu berlayar membawa mereka” Nuh dan orang orang yang bersamanya ”dalam gelombang laksana gunung” Allah lah penjaganya dan penjaga penumpangnya. ”dan Nuh memanggil anaknya” ketika dia naik supaya sang anak naik bersamanya ”sedang anak itu berada di tempat terpencil” dari mereka ketika mereka naik. Maksudnya dia menjauh sementara Nuh ingin agar dia mendekat untuk naik. Nuh berkata kepadanya “hai anakku, naiklah (ke kapal) bersama kami, dan janganlah kamu Bersama orang orang yang kafir” akibatnya kamu akan tertimpa azab yang menimpa mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (في موج كالجبال) Fii maujin kal jibaal : al-Mauj artinya ombak, meningginya air laut seperti atau setinggi gunung. Makna ayat : Firman-Nya pada ayat 42 (وهي تجري بهم في موج كالجبال) menceritakan tentang bagaimana bahtera Nuh mengarungi air dan ombak menjulang laksana gunung-gunung saking tingginya, dan Nuh menyeru putranya Kan’an, ketika itu ia berada (و كان في معزل) jauh dari kapal, ia menolak untuk menaiki kapal, karena durhaka, dan kufur. Nabi Nuh berkata (يا بني اركب معنا ولا تكن مع الكافرين) “Wahai anakku, naiklah dan jangan engkau bersama orang-orang kafir, sehingga engkau tenggelam sebagaimana mereka tenggelam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 42: Dalam hal tinggi dan besarnya gelombang itu, namun Allah Subhaanahu wa Ta'aala menjaga kapal Nabi Nuh dan menjaga para penumpangnya. Yaitu Kan’an, ketika Nabi Nuh menaiki kapalnya. Sehingga kamu akan ditimpa seperti yang menimpa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 42",
    "description": "Setelah nabi nuh bersama pengikutnya masuk ke dalam kapal dan kapal itu pun mulai berlayar membawa mereka ke dalam gelombang yang tingginya laksana gunung-gunung, dan sebelum itu nabi nuh pun memanggil anaknya yang tidak ikut bersamanya, ketika dia, yakni kan'an, anak yang tidak beriman itu, berada di tempat yang jauh terpencil. Lalu nabi nuh memanggilnya dengan penuh kasih dan harap, wahai anakku, kemari dan naiklah ke kapal bersama kami agar engkau selamat, dan janganlah engkau tetap dalam keingkaran bersama orang-orang kafir, nanti kamu akan tenggelam binasa. Suatu petunjuk tentang kebenaran risalah walaupun sudah disertai keterangan dan bukti yang kuat, tidak akan bermanfaat kecuali bila ada taufik dari Allah. Mendengar panggilan dan ajakan sang ayah, dia anaknya yang kafir itu pun menjawab, aku akan mencari perlindungan ke gunung yang tinggi, sehingga dengan menaiki gunung itu dapat menghindarkan aku dari air bahtera! kemudian nabi nuh berkata, tidak ada yang dapat melindungi dari siksaan Allah pada hari ini selain Allah yang maha penyayang menghendaki untuk menyelamatkan. Dan gelombang yang besar pun menjadi penghalang antara keduanya, yakni ayah dan anaknya; maka akhirnya dia, anak yang menolak ajakan ayahnya itu termasuk orang yang ditenggelamkan."
  }
]