[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Putra Nuh berkata, “ Aku akan berlindung ke puncak gunung, aku akan berlindung diri dari air, sehingga akan menghalangiku dari tenggelam.” Maka Nuh menjawabnya, ” Tidak ada yang dapat menghalangi hari ini dari ketetapan Allah dan ketentuaNya yang telah turun pada mahluk, berupa tenggelam dan kebinasaan, kecuali orang yang di rahmati oleh Allah . Maka dari itu, berimanlah dan naiklah ke dalam kapal bersama kami.” Kemudian ombak yang menggunung memisahkan Nuh dengan putranya, akibatnya putranya termasuk orang-orang yang di tenggelamkan lagi binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Putra Nuh -'alaihissalām- berkata kepada sang ayah, \"Aku akan berlindung ke gunung yang tinggi agar aku terhindar dari air.\" Nuh berkata kepada putranya, \"Hari ini tidak ada yang dapat melindungi seseorang dari azab Allah yang menenggelamkan apa saja dengan air bah, kecuali Allah sendiri yang merahmati orang yang dikehendakinya. Dia akan melindunginya dari azab tersebut.\" Tiba-tiba ombak besar memisahkan antara Nuh dan putranya yang kafir. Maka jadilah putra Nuh termasuk di antara orang-orang yang tenggelam dalam air bah akibat kekafirannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Akan tetapi anaknya menjawabnya dengan penuh penentangan dan tanpa rasa takut: “Aku akan berlindung ke gunung yang tinggi yang tidak dapat dicapai oleh air, agar aku tidak tenggelam dalam banjir.” Ayahnya menjawab dengan rasa kasihan: “Tidak ada tempat yang dapat menyelamatkan dari ketetapan dan azab Allah pada hari ini, kecuali bagi orang-orang beriman yang dirahmati Allah.” Dan ini adalah seruan akhir kepada anaknya karena ombak memisahkan mereka, sehingga dia tidak dapat selamat dan akhirnya hilang suaranya. Dia ditenggelamkan bersama orang-orang kafir, dan ikatan kekeluargaannya dengan seorang nabi tidak dapat menjadi syafaat baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. يَعْصِمُنِى مِنَ الْمَآءِ ۚ (yang dapat memeliharaku dari air bah) Yakni menghindarkanku dengan ketinggiannya dari air yang akan menghanyutkanku. لَا عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللهِ (Tidak ada yang melindungi hari ini dari azab Allah) Yakni tidak ada yang dapat menghindarkanku kerena hari ini telah ditetapkan untuk turunnya azab. إِلَّا مَن رَّحِمَ ۚ( selain Allah (saja) Yang Maha Penyayang) Namun barangsiapa yang dirahmati Allah maka ia adalah orang yang mendapat perlindungan. وَحَالَ بَيْنَهُمَا الْمَوْجُ(Dan gelombang menjadi penghalang antara keduanya) Ombak-ombak semakin besar sehingga menghalangi Nabi Nuh dari anaknya sehingga ia tidak dapat menyelamatkannya dari tenggelam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "42-43 1 ). Nuh berkata kepada anaknya : { ارْكَبْ مَعَنَا وَلَا تَكُنْ مَعَ الْكَافِرِينَ } \"Hai anakku, naiklah (ke kapal) bersama kami dan janganlah kamu berada bersama orang-orang yang kafir\" Nuh tidak mengatakan : \"bersama orang-orang yang tenggelam\" atau \"bersama orang-orang yang binasa itu\"; karena musibah yang sesungguhnya adalah kufur dan bukan kematian karena tenggelam. 2 ). Sesungguhnya meniti jalannya orang-orang beriman dan bermajlis bersama mereka, serat bergabung bersama mereka adalah jalan menuju keselamatan yang sebenarnya; karena mereka senantiasa berada di sisi Allah dan mereka juga senantiasa mendapatkan pertolongan dari-Nya, sekalipun mereka terhampas oleh fitnah dunia, akan tetapi sebab-sebab mereka menuju keselamatan sangat mudah; bagaikan kapal kayu yang terombang-ambing di tengah ombak laut yang tingginya seperti gunung, sebagaimana meniti jalan bersama orang-orang kafir dan munafiq adalah jalan menuju kebisaan, sekalipun mereka memiliki segala bentuk dan jumlah materi kekayaan dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43 Anaknya menjawab: “Aku akan mencari perlindungan ke gunung yang dapat melindungiku dari air bah!” Nuh berkata: “Tidak ada yang dapat melindungi dari azab Allah hari ini selain Allah saja Yang Maha Penyayang, mereka adalah orang-orang yang dikasihi Allah. Mereka adalah para penumpang bahtera ini.”. Dan gelombang menjadi penghalang antara keduanya; maka jadilah anak itu termasuk orang-orang yang ditenggelamkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjawab,“Aku akan berlindung} aku akan mencari perlindungan {ke gunung yang dapat menyelamatkanku} melindungiku {dari air. Nuh berkata,“Tidak ada penyelamat} tidak ada yang bisa mencegah {pada hari ini dari ketetapan Allah kecuali orang yang dirahmati olehNya” {Gelombang menjadi penghalang antara keduanya} antara Nuh dan anaknya {lalu dia termasuk orang-orang yang ditenggelamkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. anaknya menyanggah untuk mendustakan ucapan bapaknya bahwa tiada yang selamat kecuali orang yang naik perahu bersamanya. ”aku akan mencari perlindungan ke gunung yang dapat memeliharaku dari air bah!” maksudnya aku akan naik ke gunung yang melindungiku dari banjir. Nuh berseru “tidak ada yang melindungi dari Azab Allah selain Allah saja yang Maha penyayang” tidak ada gunung dan lainnya yang menyelamatkan seseorang meskipun dia mengambil cara apapun, dia tetap tidak akan selamat jika Allah tidak menyelamatkannya. ”dengan gelombang menjadi penghalang antara keduanya, maka jadilah anak itu termasuk orang orang yang ditenggelamkan”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يعصمني من الماء) Ya’shimunii minal maa : menyelamatkanku dari air, sehingga tidak tenggelam. Makna ayat : Kemudian anak itu menjawab (سآوي إلى جبل يعصمني من الماء) “Aku akan berlindung ke gunung, sehingga aku tidak ikut tenggelam, kemudian Nabi Nuh menjawab (لا عاصم اليوم من أمر الله) “Tidak ada yang bisa berlindung dari azab-Nya kepada orang-orang kafir ( إلا من رحم) kecuali yang Allah rahmati, sehingga ia selamat. Allah berfirman (و حال بينهما الموج) Maka mereka berdua terpisahkan—anak yang durhaka dan ayah yang penyayang—oleh ombak. (فكان) yaitu anak tersebut (من مغرقين) termasuk orang-orang yang tenggelam. Pelajaran dari ayat : • Durhaka kepada kedua orang tua adalah sebab terbesar hancurnya seorang anak di dunia, dan azab yang pasti di akhirat nanti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 43: Meskipun ia telah berusaha mencari sebab yang dia kira dapat menyelamatkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 43",
    "description": "Mendengar panggilan dan ajakan sang ayah, dia anaknya yang kafir itu pun menjawab, aku akan mencari perlindungan ke gunung yang tinggi, sehingga dengan menaiki gunung itu dapat menghindarkan aku dari air bahtera! kemudian nabi nuh berkata, tidak ada yang dapat melindungi dari siksaan Allah pada hari ini selain Allah yang maha penyayang menghendaki untuk menyelamatkan. Dan gelombang yang besar pun menjadi penghalang antara keduanya, yakni ayah dan anaknya; maka akhirnya dia, anak yang menolak ajakan ayahnya itu termasuk orang yang ditenggelamkan. Dan setelah Allah membinasakan orang kafir, kemudian difirmankan oleh Allah, kepada bumi dan langit, wahai bumi yang telah memancarkan air dari sumbernya! telanlah airmu hingga kering dan wahai langit! berhentilah mencurahkan hujan. Dan air pun disurutkan oleh Allah yang mahakuasa, dan penetapan perintah Allah membinasakan orang-orang yang mendustakan dan menyelamatkan orang-orang yang beriman pun diselesaikan. Dan kapal itu pun berlabuh di atas gunung judi, yakni terletak di pegunungan ararat (turki), dan dikatakan, binasalah orang-orang zalim yang melampaui batas hukum Allah dan ingkar kepada-Nya, serta mendustakan rasul-Nya."
  }
]