[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada Bumi setelah kebinasaan kaum Nuh , ”Wahai bumi, seraplah airmu wahai langit, hentikan hujanmu,” sehingga air berkurang dan surut. Dan telah datang ketetapan Allah berupa kebinasaan kaum Nuh , sedangkan perahu merapat di gunung judi, dan di katakan, “Kebinasaan dan kutukan bagi orang-orang yang berbuat kezhaliman yang telah melampaui batas-batas Allah dan tidak beriman kepadaNya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Setelah air bah itu berakhir, Allah berfirman kepada bumi, \"Wahai bumi! Seraplah air bah yang ada di atasmu!\" dan Dia berfirman kepada langit, \"Wahai langit! Tahanlah dan jangan turunkan air hujan!\" Lalu air menyusut dan bumi pun mengering. Dan Allah telah membinasakan orang-orang kafir. Sementara kapal berhenti di atas bukit Judi. Dan dikatakan, \"Enyahlah dan binasalah orang-orang yang melampaui batas-batas Allah dengan kekafirannya!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Kemudian Allah memerintahkan bumi untuk menelan airnya sehingga dapat kembali ke parit-parit, lubang-lubang, sungai, dan lautan; dan memerintahkan langit untuk berhenti menurunkan hujan. Sehingga debit air menurun, dan kapal itu bersandar di atas gunung Judiy; dan dikatakan: “Kebinasaan bagi orang-orang zalim, Allah telah membinasakan mereka dan menyelamatkan hamba-hamba-Nya yang beriman.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَقِيلَ يٰٓأَرْضُ ابْلَعِى مَآءَكِ (Dan difirmankan: “Hai bumi telanlah airmu,) Tidak seperti air surut pada umumnya yang berlangsung secara perlahan-lahan. وَيٰسَمَآءُ أَقْلِعِى(dan hai langit (hujan) berhentilah) dikatakan (أقلع المطر) yakni apabila tujuan telah berhenti. وَغِيضَ الْمَآءُ(dan airpun disurutkan) Yakni berkurang sampai kering. وَقُضِىَ الْأَمْرُ(perintahpun diselesaikan) Allah membinasakan kaum Nabi Nuh dengan sempurna dan teratur. وَاسْتَوَتْ عَلَى الْجُودِىِّ ۖ( dan bahtera itupun berlabuh di atas bukit Judi) Yakni perahu itu berhenti diatas gunung yang dikenal sebagai gunung Judiy, yaitu gunung yang terletak di dekat kota Mushil. وَقِيلَ بُعْدًا(dan dikatakan: “Binasalah) Yakni hancurlah. لِّلْقَوْمِ الظّٰلِمِينَ(orang-orang yang zalim) Para ulama ilmu balaghah menyatakan bahwa ayat yang mulia ini memiliki kefasihan yang sangat tinggi yang tidak mungkin diungkapkan dengan kata-kata, dan menjadikan para ahli dalam ilmu balaghah, ilmu bayan, dan ilmu sastra tidak mempu untuk mendatangkan ayat yang semisalnya atau yang mendekati itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Berkata Qhadi 'Iyadh : telah diceritakan bahwasanya Ibnul muqfi' suatu ketika berkehendak untuk membantah isi al-qur'an! maka ia pun terus mencobanya, dan tatkala ia berjalan melewati seorang anak sedang membaca ayat ini : { وَقِيلَ يَا أَرْضُ ابْلَعِي مَاءَكِ }, maka ia pun kembali dan mengurunkan apa yang baru saja ia lakukan, dan berkata : aku bersaksi sesungguhnya ayat ini tidak mungkin dibantahkan, dan sungguhnya ia bukanlah perkataan manusia, dan ia pun menjadi orang yang paling fasih di masanya. 2 ). Al-Qurthubi berkata : ketika bukit judi tunduk dan merendah; ia semakin kuat, dan ketika ia meninggi di antara yang lainnya; ia jatuh, dan ini adalah sunnatullah dan ciptaannya; ia mengangkat siapa yang tunduk, dan merendahkan siapa saja yang merasa tinggi di antara yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44 Setelah kehancuran itu difirmankan kepada bumi: “Hai bumi telanlah airmu, dan hai langit berhentilah menurunkan hujan,” dan airpun disurutkan, perintahpun diselesaikan dan bahtera itupun berlabuh di atas bukit Judi, dan dikatakan: “Binasalah orang-orang yang zalim”. Ayat ini menjadi ayat yang mengandung ijaz yang dapat mencakup penjelasan atas bencana itu dengan balaghah dan fashahah yang tinggi yang tidak bisa dibuat permisalannya dan manunjukkan bahwa ini adalah kalam Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Difirmankan,“Wahai bumi, telanlah} minumlah {airmu dan wahai langit, berhentilah”} tahanlah air hujan {Lalu air pun disurutkan} berkurang {dan urusan pun diselesaikan} telah diselesaikan pembinasaan kaum Nuh {dan berlabuh} lalu bahtera itu berhenti {di atas gunung Judiy} di atas gunung Judiy di dekat Maushil {dan dikatakan,“Binasalah} hancur dan rugilah {kaum yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. ketika Allah menenggelamkan mereka dan menyelamatkan Nuh dan orang orang yang bersamanya, maka “difirmankan ’hai bumi telanlah airmu” yang keluar darimu dan yang turun kepadamu, telanlah air yang ada di permukaanmu, ”dan hai langit (hujan) berhentilah” maka keduanya menaati perintah Allah. Bumi menelan airnya dan langit menghentikan hujannya, hingga air di bumi pun surut. \"Perintah pun diselesaikan” dengan dibinasakannya orang orang yang mendustakan dan diselamatkannya orang orag mukmin. ”dan bahtera itu pun berlabuh diatas bukit judi” yaitu perahu itu berhenti di gunung itu yang terkenal dari negeri maushil. ”dan dikatakan ‘binasalah orang orang yang zhalim” maksudnya kebinasaan mereka diikuti dengan laknat, kemurkaan dan kemarahan yang selalu bersama mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (و غيض الماء) Wa ghiidhal maa : air berkurang, meresap ke dalam tanah. (على الجودي) ‘Alal juudyy : di atas gunung Judi, gunung di daerah barat kota Moshul. (بعدا للقوم الظالمين) bu’dallill qaumizh zhaalimiin : kecelakaan bagi mereka. Makna ayat : (و قيل يا أرض ابلعي ماءك ) Dan dikatakan kepada bumi, “Telanlah airmu (و يا سماء أقلعي) dan wahai langit, hentikanlah hujanmu, dan yang memerintahkan keduanya adalah Allah. (و غيض الماء) berkurang dan meresap kedalam bumi, (و استوت على الجودي) kapal itu berlabuh bersama penumpangnya diatas gunung Judi, yaitu gunung di daerah dekat dengan Mosul (و قيل بعدا للقوم الظالمين) kebinasaan atas mereka, sehingga tidak tersisa sedikitpun. Banjir tersebut menenggelamkan mereka—dalam keadaan mereka berbuat zalim, dan banjir terjadi di awal bulan Rajab hingga 6 bulan lamanya, sampai kapal tersebut berlabuh di awal bulan Muharram. Pelajaran dari ayat : • Besarnya kekuasaan Allah, bahwa seluruh makhluk tunduk kepada-Nya, sampai langit dan bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 44: Setelah Allah menenggelamkan mereka dan menyelamatkan Nuh dan orang yang bersamanya. Yakni Allah telah melaksanakan janjinya dengan membinasakan orang-orang yang kafir kepada Nabi Nuh ‘alaihis salam dan menyelamatkan orang-orang yang beriman. Bukit Judi terletak di Armenia sebelah selatan, berbatasan dengan Mesopotamia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 44",
    "description": "Dan setelah Allah membinasakan orang kafir, kemudian difirmankan oleh Allah, kepada bumi dan langit, wahai bumi yang telah memancarkan air dari sumbernya! telanlah airmu hingga kering dan wahai langit! berhentilah mencurahkan hujan. Dan air pun disurutkan oleh Allah yang mahakuasa, dan penetapan perintah Allah membinasakan orang-orang yang mendustakan dan menyelamatkan orang-orang yang beriman pun diselesaikan. Dan kapal itu pun berlabuh di atas gunung judi, yakni terletak di pegunungan ararat (turki), dan dikatakan, binasalah orang-orang zalim yang melampaui batas hukum Allah dan ingkar kepada-Nya, serta mendustakan rasul-Nya. Dan setelah nabi nuh beserta orang-orang beriman selamat dan kapal berlabuh, lalu nabi nuh memohon kepada tuhannya sambil berkata, ya tuhanku, sesungguhnya anakku adalah termasuk keluargaku, sedang engkau telah memerintahkan kepadaku mengajak keluargaku masuk ke dalam kapal agar selamat, dan aku yakin bahwa janji-Mu akan menyelamatkan mereka itu pasti benar. Engkau adalah hakim yang paling adil dalam menentukan ketetapan."
  }
]