[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Nuh menyeru Tuhanya, sambil berkata, ”Wahai Tuhanku, sesungguhnya Engkau telah menjanjikan kepadaku untuk menyelamatkan keluargaku dari tenggelam dan kebinasaan, dan sesungguhnya putraku termasuk keluargaku, dan sesungguhnya janjiMu itu benar yang tidak ada penggingkaran padanya, dan Engkau adalah sebaik-baik yang Memutuskan perkara dan yang paling adil. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan Nuh -'alaihissalām- mengadu kepada Tuhannya, \"Ya Tuhanku! Sesungguhnya putraku adalah bagian dari keluargaku. Sedangkan Engkau telah berjanji kepadaku untuk menyelamatkan mereka. Dan janji-Mu adalah kebenaran yang tidak mungkin diingkari. Sementara Engkau adalah Tuhan Yang Maha Adil dan Maha Mengetahui.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Lalu Nabi Nuh berdoa kepada Allah dengan penuh ketundukan: “Ya Tuhanku, Anakku adalah bagian dari keluargaku, dan aku percaya terhadap janjimu dan berserah diri kepadamu, sedangkan Engkau adalah Dzat yang paling bijaksana dalam menentukan ketetapan-Mu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. فَقَالَ رَبِّ إِنَّ ابْنِى مِنْ أَهْلِى (Dan Nuh berseru kepada Tuhannya sambil berkata: “Ya Tuhanku, sesungguhnya anakku termasuk keluargaku) Dan ia merupakan termasuk orang-orang yang Engkau janjikan untuk Engkau selamatkan sesuai firman-Mu: “serta keluargamu” وَإِنَّ وَعْدَكَ الْحَقُّ (dan sesungguhnya janji Engkau itulah yang benar) Yang tidak mungkin diingkari. وَأَنتَ أَحْكَمُ الْحٰكِمِينَ (Dan Engkau adalah Hakim yang seadil-adilnya) Yakni Yang paling Mengetahui dan Adil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45 Nuh berseru kepada Tuhannya sambil berkata: “Ya Tuhanku, sesungguhnya anakku termasuk keluargaku, sesungguhnya janji Engkau itulah yang benar. Dan Engkau adalah seadil-adilnya Hakim”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nuh memohon kepada Tuhannya, lalu berkata,“Ya Tuhanku, sesungguhnya anakku termasuk keluargaku} orang-orang yang engkau janjikan kepadaku akan engkau selamatka dari bencana tenggelam {dan sesungguhnya janjiMu itu pasti benar} kebenaran yang tidak mungkin ada kesalahan di dalamnya {Engkau adalah hakim yang paling adil.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “dan Nuh berseru kepada Rabbnya sambil berkata ’ya Rabbku, sesungguhnya anakku termasuk keluargaku, dan sesungguhnya janjiMu adalah benar\", yakni, Engkau telah berkata kepadaku, ”angkutlah dari masing masing hewan (jantan dan betina) dan keluargamu” dan engau tidak akan menelisihi janjiMu kepadaku. Boleh jadi Nuh terbawa oleh rasa kasih sayangnya, dan bahwa Allah menjanjikan keselamatan keluarganya, sehingga dia mengira bahwa janjiNya berlaku umum kepada keluarganya yang beriman dan yang tidak beriman. Oleh karena itu, dia berdoa kepada Allah dengan doa itu meski begitu dia menyerahkan urusannya kepada hikmah Allah yang mendalam."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (من أهلي) min ahlii: dari kalangan keluargaku, yaitu istri-istri dan anak-anakku. (وإن وعدك الحق) Wa inna wa’dakal haqq : janji yang benar, tidak akan diingkari. Makna ayat : Ayat ini masih menjelaskan kisah Nabi Nuh beserta kaumnya, Allah berfirman-Nya (ونادى نوح ربه) berdoa kepada-Nya meminta (رب إن ابني من أهلي و إن وعدك الحق و أنت أحكم الحاكمين) “Ya Tuhanku, sesungguhnya anakku, termasuk keluargaku, dan sesungguhnya janji Engkau itulah yang benar. Dan Engkau adalah Hakim yang seadil-adilnya.\"—kejadian ini terjadi ketika Nuh memasukkan semua makhluk dan manusia yang beriman ke dalam kapal dan enggan Kan’an anak Nabi Nuh untuk naik—“Wahai Rabb, sesungguhnya anakku Kan’an lahir dari istriku, dan termasuk dalam keluargaku, Engkau telah menjanjikan akan menyelamatkanku, keluargaku, dan orang-orang yang beriman bersamaku, (و إن وعدك الحق) dan sesungguhnya janji-Mu adalah benar, tidak akan diingkari selamanya, (و أنت أحكم الحاكمين) Engkau lah yang paling mengetahui dan paling adil. Anakku tidak mentaatiku, enggan naik ke dalam kapal, dan akan segera binasa bersama mereka jika Engkau tidak merahmatinya wahai Rabb semesta alam. Pelajaran dari ayat : • Ikatan iman dan takwa lebih agung dari ikatan nasab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 45: Dan Engkau telah berjanji menyelelamatkan mereka (keluargaku). Yang tidak mungkin diingkari. Nabi Nuh ‘alaihis salam karena rasa kasihan yang begitu dalam, dan karena Allah telah berjanji akan menyelamatkan keluarganya, ia mengira bahwa janji itu mengena kepada seluruh anggota keluarganya; yang mukmin maupun yang kafir. Oleh karena itu, Beliau mengucapkan kata-kata di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 45",
    "description": "Dan setelah nabi nuh beserta orang-orang beriman selamat dan kapal berlabuh, lalu nabi nuh memohon kepada tuhannya sambil berkata, ya tuhanku, sesungguhnya anakku adalah termasuk keluargaku, sedang engkau telah memerintahkan kepadaku mengajak keluargaku masuk ke dalam kapal agar selamat, dan aku yakin bahwa janji-Mu akan menyelamatkan mereka itu pasti benar. Engkau adalah hakim yang paling adil dalam menentukan ketetapan. Mengabarkan perihal putra nabi nuh yang ikut tenggelam, dia yang mahaadil dan bijaksana berfirman, wahai nuh! sesungguhnya putramu (kan'an), dia bukanlah termasuk keluargamu yang dijanjikan akan diselamatkan, karena dalam pengetahuan-ku, dia tidak beriman, berlaku jahat, durhaka, bahkan mengingkarimu sendiri. Perbuatan yang ia lakukan sungguh tidak baik. Oleh sebab itu, jangan engkau memohon kepada-ku sesuatu yang tidak engkau ketahui hakikatnya. Aku menasihatimu agar tidak meminta sesuatu yang belum diketahui dengan yakin bahwa permohonan itu benar atau wajar, agar engkau tidak termasuk golongan orang yang bodoh."
  }
]