[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman, ’’Wahai nuh, sesungguhnya putramu yang telah binasa itu bukanlah bagian dari keluargamu yang aku berjanji untuk menyelamatkan mereka. Hal itu disebabkan oleh kekafirannya dan perbuatan tidak baik yang dia lakukan. Dan sesungguhnya Aku melarangmu untuk meminta kepadaKu sesuatu hal yang tidak ada pengetahuan bagimu tentang hakikatnya. Sesungguhnya Aku menasihatimu agar kamu tidak termasuk orang-orang yang bodoh dalam permintaanmu kepadaKu tentang hal itu”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Allah berfirman kepada Nuh, \"Wahai Nuh! Sesungguhnya putramu yang Engkau minta Aku selamatkan itu bukan bagian dari keluargamu yang Ku-janjikan kepadamu akan Ku-selamatkan. Karena ia kafir. Sesungguhnya permintaanmu itu, wahai Nuh, adalah tindakan yang tidak sepantasnya keluar darimu dan tidak patut dilakukan oleh orang yang berkedudukan sepertimu. Maka janganlah engkau meminta sesuatu yang tidak engkau ketahui duduk persoalannya. Sesungguhnya aku mengingatkanmu, jangan sekali-kali engkau menjadi orang bodoh yang meminta kepada-Ku sesuatu yang bertentangan dengan pengetahuan dan kebijaksanaan-Ku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Hai Nuh, dia bukanlah keluargamu yang beriman yang Aku janjikan kepadamu untuk menyelamatkan mereka. Dia telah melakukan perbuatan yang tidak baik, sehingga dia berhak untuk ditenggelamkan. Maka tidak tidak layak bagimu untuk memohon permintaan ini. Aku mengingatkanmu agar jangan menjadi termasuk orang-orang yang jahil terhadap ketetapan dan keadilan-Ku terhadap makhluk-Ku. Ini merupakan olokan bagi Nuh dan pelajaran baginya agar tidak berdoa dengan doa seperti ini karena terbawa oleh rasa kasih sayang sebagai seorang ayah; dan orang yang berdoa harus memiliki ilmu dan keikhlasan dalam mengharap keridhaan Allah. (Taisir al-Lathif al-Mannan fii Khulashatu Tafsir al-Qur’an, as-Sa’di. 1/332)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. قَالَ يٰنُوحُ إِنَّهُۥ لَيْسَ مِنْ أَهْلِكَ ۖ (Allah berfirman: “Hai Nuh, sesungguhnya dia bukanlah termasuk keluargamu) Kerena ia tidak termasuk orang-orang yang beriman dan mengikutimu, dan kekerabatan merupakan kekerabatan dalam agama seselum kekerabatan secara nasab. إِنَّهُۥ عَمَلٌ غَيْرُ صٰلِحٍ ۖ( sesungguhnya (perbuatan)nya perbuatan yang tidak baik) Untuk menekankan olokan baginya Allah menjadikannya seakan-akan ia adalah amal perbuatan itu sendiri. Yakni, wahai Nuh, janganlah kamu menisbatkan amalan buruk kepadamu, anakmu itu hakikatnya bukanlah termasuk keluargamu, karena itu bukanlah dakwah para nabi Allah dan bukan seruan mereka kepada manusia. Dan hubungan kekeluargaan apabila terjalin antara orang-orang beriman maka ia tetap berlanjut, namun apabila antara wali Allah dan musuh-Nya maka hubungan itu terputus. فَلَا تَسْـَٔلْنِ مَا لَيْسَ لَكَ بِهِۦ عِلْمٌ ۖ( Sebab itu janganlah kamu memohon kepada-Ku sesuatu yang kamu tidak mengetahui) Yakni seandainya dalam ilmu-Ku ia merupakan orang yang beriman niscaya Aku akan menyelamatkannya. Dalam ayat ini terdapat dalil dilarangnya berdoa dengan sesuatu yang telah diketahui bahwa hal itu tidak sesuai dengan Syariat. إِنِّىٓ أَعِظُكَ أَن تَكُونَ مِنَ الْجٰهِلِينَ (Sesungguhnya Aku memperingatkan kepadamu supaya kamu jangan termasuk orang-orang yang tidak berpengetahuan) Yakni Aku memperingatkanmu agar tidak termasuk dari mereka, namun jadilah termasuk orang-orang yang berilmu dan mengamalkannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Muqotil berkata : Teman yang senantiasa mengajak kepada kebaikan lebih baik dari seorang anak yang enggan diajak kepada kebaikan, tidakkah kamu mendengar firman Allah : { إِنَّهُ لَيْسَ مِنْ أَهْلِكَ ۖ إِنَّهُ عَمَلٌ غَيْرُ صَالِحٍ } \"Allah berfirman: \"Hai Nuh, sesungguhnya dia bukanlah termasuk keluargamu (yang dijanjikan akan diselamatkan), sesungguhnya (perbuatan)nya perbuatan yang tidak baik\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46 Allah berfirman kepada Nuh: “Hai Nuh, sesungguhnya dia Kan’an bukanlah termasuk keluargamu yang dijanjikan akan diselamatkan, sesungguhnya perbuatannya adalah perbuatan yang tidak baik berupa dusta dan kekafiran. Sebab itu janganlah kamu memohon kepada-Ku sesuatu yang kamu tidak mengetahui (hakekat)nya. Sesungguhnya Aku memperingatkan kepadamu supaya kamu jangan termasuk orang-orang yang tidak berpengetahuan”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Wahai Nuh, sesungguhnya dia tidak termasuk keluargamu} tidak termasuk dalam keluarga seagama {karena perbuatannya tidak baik} sesungguhnya dia berbuat kerusakan {Maka janganlah memohon kepadaKu sesuatu yang tidak kamu ketahui. Sesungguhnya Aku menasihatimu} melarangmu dan memperingatkanmu {agar tidak termasuk orang-orang bodoh.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Allah berfirman kepadanya “sesungguhnya dia bukanlah termasuk keluargamu” yang aku janjikan kepadamu selamat. ”sesungguhnya (perbuatannya) adalah perbuatan yang tidak baik” maksudnya, doa yang kamu ucapkan untuk keselamatan orang kafir yang tidak beriman kepada Allah dan RasulNya. ”sebab itu janganlah kamu memohon kepadaKu sesuatu yang kamu tidak mengetahui hakikat(nya)” yang kamu tidak mengetahui akhirnya dan akibatnya, apakah ia baik atau tidak baik. ”sesungguhnya Aku memperingatkan kepadamu supaya kamu jangan termasuk orang orang yang tidak berpengetahuan” sesungguhnya Aku menasihatimu dengan nasihat yang dengannya kamu termasuk orang orang yang sempurna, dan dengannya kamu selamat dari sifat orang orang yang bodoh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إنه عمل صالح) Innahu ‘amalun ghairu shaalih : Permintaanmu ini bukan perbuatan yang baik. (أعظك) A’izhuka : Aku memperingatkanmu agar tidak menjadi seperti orang-orang bodoh. (من الجاهلين) Minal jaahiliin : tergolong orang-orang yang tidak memahami keagungan-Ku dan benarnya janji-Ku, sehingga engkau meminta-Ku sesuatu yang engkau tidak pahami. Makna ayat : Kemudian Allah tabaraka wa ta’laa menjawab (إنه ليس من أهلك) dia bukanlah dari keluargamu yang Aku janjikan dengan keselamatan, karena ia tidak berada di atas agamamu dan menyelisihi jalanmu. (إنه عمل غير صالح) Permintaanmu agar Aku menyelamatkan anakmu yang kafir—dan sudah Ku jelaskan Aku akan menenggelamkan orang-orang kafir—bukanlah perbuatan yang tidak pantas kau lakukan. (إني أعظك) Aku melarangmu dan memperingatkanmu (أن نكون من الجاهلين) agar engkau tidak termasuk orang-orang yang bodoh, kemudian meminta hal yang tidak engkau ketahui dasarnya. Pelajaran dari ayat : • Tidak bolehnya beramal tanpa ilmu, sehingga tidak boleh seseorang melakukan sesuatu kecuali sudah jelas hukumnya dari Allah. • Tercelanya kebodohan dan orang-orang yang bodoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 46: Yakni yang dijanjikan akan diselamatkan atau tidak memeluk agamamu. Menurut pendapat sebagian ahli tafsir bahwa yang dimaksud dengan “perbuatan itu” adalah permohonan Nabi Nuh ‘alaihis salam agar anaknya yang kafir diselamatkan, padahal orang kafir tidak mungkin diselamatkan. Yakni tidak engkau ketahui akhirnya; apakah berakibat baik atau buruk. Yakni orang yang kurang sempurna dan terkena sifat orang-orang bodoh karena memohon sesuatu yang tidak diketahui akibatnya. Maka Nabi Nuh ‘alaihis salam menyesal dengan penyesalan yang dalam karena sikap itu, dan ia mengucapkan kata-kata di atas (lihat ayat selanjutnya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 46",
    "description": "Mengabarkan perihal putra nabi nuh yang ikut tenggelam, dia yang mahaadil dan bijaksana berfirman, wahai nuh! sesungguhnya putramu (kan'an), dia bukanlah termasuk keluargamu yang dijanjikan akan diselamatkan, karena dalam pengetahuan-ku, dia tidak beriman, berlaku jahat, durhaka, bahkan mengingkarimu sendiri. Perbuatan yang ia lakukan sungguh tidak baik. Oleh sebab itu, jangan engkau memohon kepada-ku sesuatu yang tidak engkau ketahui hakikatnya. Aku menasihatimu agar tidak meminta sesuatu yang belum diketahui dengan yakin bahwa permohonan itu benar atau wajar, agar engkau tidak termasuk golongan orang yang bodoh. Setelah Allah memperingatkan nabi nuh untuk tidak memohonkan keselamatan dan ampunan bagi putranya yang kafir, dan nabi nuh pun menyadari kekeliruannya, kemudian dia (nabi nuh) berkata, ya tuhanku, sesungguhnya aku berlindung kepada-Mu untuk memohon kepadamu sesuatu yang aku tidak mengetahui hakikatnya. Kalau sekiranya engkau tidak mengampuni kesalahan dan dosaku yang lalu, sekarang, dan mendatang, dan tidak pula menaruh belas kasihan kepadaku, niscaya aku termasuk golongan orang yang rugi dan jauh dari rahmat-Mu. Para nabi memohon ampunan atas kesalahan yang dilakukan, sekalipun apa yang dilakukan itu di luar pengetahuannya, karena khawatir akan pengaruh dosa yang dilakukan jika Allah tidak mengampuninya."
  }
]