[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Nuh berkata, ”wahai tuhanku, sesungguhnya aku memohon keselamatan dan mengharap perlindungan kepadaMu dari memohon kepadaMu sesuatu yang aku tidak memiliki pengetahuan. Dan jika Engkau tidak mengampuni dosaku dan merahmatiku dengan rahmatMu, niscaya aku akan termasuk orang-orang yang memperdayai diri mereka hingga kehilangan kebaikan-kebaikannya dan akhirnya binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Nuh -'alaihissalām- berkata, \"Ya Tuhanku! Sesungguhnya aku meminta pertolongan-Mu dan perlindungan-Mu dari meminta sesuatu yang tidak kuketahui duduk persoalannya. Jika Engkau tidak berkenan mengampuni dosaku dan menyayangiku dengan kasih sayang-Mu, niscaya aku akan termasuk orang yang merugi di Akhirat nanti.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Nuh berkata: “Ya Tuhanku, aku berlindung kepada-Mu agar tidak memohon sesuatu yang tidak aku miliki ilmunya. Dan jika Engkau tidak mengampuniku dengan karunia-Mu dan tidak merahmatiku dengan rahmat-Mu yang Maha Luas, niscaya aku akan termasuk orang-orang yang merugi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. قَالَ رَبِّ إِنِّىٓ أَعُوذُ بِكَ أَنْ أَسْـَٔلَكَ مَا لَيْسَ لِى بِهِۦ عِلْمٌ ۖ (Nuh berkata: Ya Tuhanku, sesungguhnya aku berlindung kepada Engkau dari memohon kepada Engkau sesuatu yang aku tiada mengetahui) Sesuatu yang tidak aku ketahui kebenaran dan kebolehannya. وَإِلَّا تَغْفِرْ لِى(Dan sekiranya Engkau tidak memberi ampun kepadaku) Atas kesalahanku telah memohon hal itu tanpa ada pengetahuan dariku. وَتَرْحَمْنِىٓ( dan (tidak) menaruh belas kasihan kepadaku) Dengan rahmat-Mu, dan tidak menerima taubatku. أَكُن مِّنَ الْخٰسِرِينَ (niscaya aku akan termasuk orang-orang yang merugi) Dalam amal perbuatanku sehingga aku tidak mendapatkan keuntungan darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Nuh menjawab dengan berkata: Ya Tuhanku, sesungguhnya aku berlindung kepada Engkau dari memohon kepada Engkau sesuatu yang aku tiada mengetahui hakekatnya. Dan sekiranya Engkau tidak memberi ampun kepadaku, dan tidak menaruh belas kasihan kepadaku, niscaya aku akan termasuk orang-orang yang merugi”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Nuh berkata, “Ya Tuhanku, sesungguhnya aku berlindung kepadaMu} Aku memohon perlindungan dan pertolongan kepadaMu {dari memohon sesuatu yang tidak aku ketahui. Jika Engkau tidak mengampuniku dan mengasihiku, niscaya aku termasuk orang-orang yang merugi.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. pada saat itu Nuh sangat menyesal atas apa yang dilakukannya, dan Nuh berkata \"ya Rabbku sesungguhnya aku berlindung kepadaMu untuk memohon sesuatu yang aku tiada mengetahui (hakikatnya). Dan sekiranya Engkau tidak memberi ampun kepadaku dan (tidak) menaruh belas kasihan kepadaku, niscaya aku akan termasuk orang orang yang merugi”. Maka dengan ampunan dan rahmat, seorang hamba selamat dari kerugian. ini menunjukan bahwa Nuh tidak memiliki ilmu bahwa pertanyaannya kepada Allah tentang anaknya adalah haram dan termasuk kedalam firman Allah “dan janganlah kamu bicarakan dengan aku tentang orang orang yang zhalim itu, sesungguhnya mereka itu akan ditenggelamkan” akan tetapi ada perkara yang bertentangan dengannya, dia mengira ia masuk kedalam FirmanNya, ”dan keluargamu” dan setelah itu, jelaslah baginya bahwa ia termasuk kedalam larangan terhadap mendoakan mereka dan mengulag ulangnya untuk mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Nabi Nuh menjawab (رب) “Wahai Rabbku, ( إني أعوذ بك) aku berlindung kepada-Mu (أن أسألك) –dari saat ini—untuk memohon sesuatu yang tidak aku ketahui. Seandainya Engkau tidak mengampuniku dan merahmatiku, (أكن من الخاسرين) tentu aku akan menjadi orang-orang yang kehilangan keberuntungan, lantas binasa. Pelajaran dari ayat : • Keutamaan Nabi Nuh, bahwa ia satu dari para Rasul Ulul ‘Azmi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 47: Terhadap kelalaianku. Yakni tanpa ampunan Allah dan rahmat-Nya seorang hamba menjadi orang yang rugi. Nabi Nuh ‘alaihis salam tidak mengetahui bahwa permohonannya agar anaknya yang kafir diselamatnya adalah haram, bahkan melakukan perkara yang dilarang Allah dalam firman-Nya, “Dan janganlah engkau bicarakan dengan Aku tentang orang-orang yang zalim. Sesungguhnya mereka itu akan ditenggelamkan.” (lih. Ayat: 37), ia mengira permohonannya itu boleh karena anaknya yang kafir termasuk keluarganya yang dijanjikan akan diselamatkan. Namun setelah mendapat teguran Allah, jelaslah bahwa permohonan tersebut termasuk yang dilarang dilakukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 47",
    "description": "Setelah Allah memperingatkan nabi nuh untuk tidak memohonkan keselamatan dan ampunan bagi putranya yang kafir, dan nabi nuh pun menyadari kekeliruannya, kemudian dia (nabi nuh) berkata, ya tuhanku, sesungguhnya aku berlindung kepada-Mu untuk memohon kepadamu sesuatu yang aku tidak mengetahui hakikatnya. Kalau sekiranya engkau tidak mengampuni kesalahan dan dosaku yang lalu, sekarang, dan mendatang, dan tidak pula menaruh belas kasihan kepadaku, niscaya aku termasuk golongan orang yang rugi dan jauh dari rahmat-Mu. Para nabi memohon ampunan atas kesalahan yang dilakukan, sekalipun apa yang dilakukan itu di luar pengetahuannya, karena khawatir akan pengaruh dosa yang dilakukan jika Allah tidak mengampuninya. Setelah nabi nuh memohon ampunan kepada Allah, dan Allah menerima ampunan nabi nuh serta menyelamatkannya dari bencana, lalu difirmankan kepadanya, wahai nabi nuh! turunlah bersama keluarga dan pengikutmu dari kapal ini dengan selamat sejahtera dan penuh keberkahan dari kami, bagimu dan bagi semua umat mukmin yang ikut bersamamu maupun umat-umat yang datang sesudahmu sampai hari kiamat. Dan ada pula umat-umat yang datang sesudahmu akan kami beri kesenangan dalam kehidupan dunia, tetapi karena mereka durhaka, maka tidak memperoleh keselamatan dan keberkahan, kemudian mereka akan ditimpa azab kami di dunia dan akhirat atau di akhirat saja dengan siksa yang pedih."
  }
]