[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman, ”Wahai nuh, turunlah kamu dari kapal itu menuju permukaan tanah dengan aman dan keselamatan dari Kami, dan limpahan kebaikan-kebaikan dan nikmat-nikmat yang abadi padamu dan pada kumpulan orang-orang yang bersamamu. Disisi lain, ada umat-umat dan golongan-golongan lain yang juga celaka, kami akan memberikan kesenangan kepada mereka di kehidupan dunia, hingga mereka mencapai ajal-ajal mereka, kemudian mereka tertimpa siksaan pedih dari kami pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Allah berfirman kepada Nuh -'alaihissalām-, \"Wahai Nuh! Turunlah dari kapal dengan selamat dan aman, dengan membawa banyak anugerah dari Allah untukmu dan untuk keturunan yang akan datang dari orang-orang mukmin yang berada di atas kapal bersamamu. Dan di sana ada umat-umat lain dari keturunan mereka yang menjadi kafir. Maka Kami akan memberi mereka kesempatan untuk menikmati hidup mereka di dunia ini. Kami akan memberi mereka rezeki untuk bekal hidup mereka di dunia. Kemudian mereka akan mendapatkan azab yang pedih dari Kami di Akhirat nanti.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Nabi Nuh diseru: “Turunlah dari perahu dengan keselamatan dari Kami, dan keberkahan menyertaimu. Banjir bandang telah berakhir, dan bumi bersih dari orang-orang kafir. Keberkahan ini melimpah kepadamu dan menyertai orang-orang beriman dari keturunanmu, dan mereka akan menjadi banyak sehingga menjadi banyak umat. Dan orang yang memiliki kekafiran maka dia akan diberi kenikmatan di dunia hingga ajalnya tiba, kemudian dia akan mendapat azab yang pedih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. قِيلَ يٰنُوحُ اهْبِطْ (Difirmankan: “Hai Nuh, turunlah) Yakni turunlah dari perahu menuju dataran yang rendah. Atau turunlah dari gunung menuju dataran rendah. Karena air telah masuk ke dalam bumi dan telah mengering. بِسَلٰمٍ مِّنَّا (dengan selamat sejahtera dari Kami) Dengan keselamatan dan keamanan. وَبَرَكٰتٍ (dan penuh keberkatan) Yakni kenikmatan-kenikmatan yang terus menerus. وَعَلَىٰٓ أُمَمٍ مِّمَّن مَّعَكَ ۚ (dan atas umat-umat (yang mukmin) dari orang-orang yang bersamamu) Mereka adalah suku-suku yang berasal dari keturunan orang-orang yang bersama Nabi Nuh di atas perahu. Dan yang berada di perahu merupakan kaum yang beragam, dan hewan-hewan dengan berbagai jenis. وَأُمَمٌ سَنُمَتِّعُهُمْ(Dan ada (pula) umat-umat yang Kami beri kesenangan pada mereka) Yaitu keturunan mereka yang menjadi kafir hingga hari kiamat, mereka akan Kami beri kesenangan di dunia dan Kami berikan sebagiannya sebagai penghidupan mereka. ثُمَّ يَمَسُّهُم مِّنَّا(kemudian mereka akan ditimpa dari Kami) Di akhirat dengan azab yang pedih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Difirmankan kepada Nuh: “Hai Nuh, turunlah dengan selamat sejahtera dan penuh keberkatan dari Kami atasmu dan umat-umatmu yang mukmin yaitu orang-orang yang bersamamu. Dan ada pula umat-umat yang Kami beri kesenangan pada mereka dalam kehidupan dunia, kemudian mereka akan ditimpa azab yang pedih dari Kami”. Yang dimaksud dengan mereka adalah cucu-cucu kafir dari orang yang bersamanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dikatakan,“Wahai Nuh, turunlah} turunlah dari bahteramu menuju daratan {dengan penuh keselamatan dari Kami} dengan aman dan selamat dari Kami {dan penuh keberkahan atasmu} dan dengan kebaikan dan kenikmatan yang tetap atas dirimu {serta umat-umat yang bersamamu}keturunan umat yang bersamamu dalam bahtera {dan umat-umat yang Kami beri kesenangan, kemudian mereka akan ditimpa azab yang sangat pedih dari Kami.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “difirmankan ’hai Nuh turunlah dengan selamat sejahtera dan penuh keberkahan dari kami atasmu dan atas umat umat (yang mukmin) dari orang orang yang bersamamu” dari kalangan manusia dan pasangan binatang yang dia bawa bersamanya. Allah memberkahi semuanya sehingga mereka memenuhi seluruh penjuru bumi. ”dan akan ada (pula) umat umat yang kami beri kesenangan pada mereka” dalam kehidupan dunia ”kemudian mereka akan ditimpa azab yang pedih dari kami” penyelamatan ini tidak menghalangi kami untuk menghukum orang yang kafir setelah itu meskipun dia diberi kenikmatan sesaat, dia tetap akan dihukum setelah itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سنمتعهم) Sanumatti’uhum : Memberikan mereka rizki dan kesenangan hingga akhir ajal mereka, kemudian mereka akan ditimpa azab-Ku sedang mereka dalam keadaan kafir. Makna ayat : Kemudian Allah berfirman (يا نوح اهبط) “Wahai Nuh, turunlah dari kapal engkau dan orang-orang beriman bersamamu dengan keselamatan, penghormatan dari Kami, dan keberkahan atasmu dan keturunan umatmu, maka janganlah khawatir akan kelaparan tidak pula sengsara, dan sebagian dari keturunan umat yang bersamamu, akan Kami berikan mereka kenikmatan di dunia dengan rizki, kemudian Kami siksa mereka dengan azab yang pedih pada hari kiamat, karena mereka melenceng dari Islam dan hidup di atas kesyirikan dan kekufuran.” Ini adalah kabar tentang perkara gaib yang Allah kabarkan, dan pasti akan terjadi. Telah muncul generasi-generasi dari keturunan Nuh: ada yang kafir dan ada yang beriman, dan hukum Allah akan terlaksana, dan ditetapkan bagi masing-masing janji dan ancaman-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 48: Allah memberkahi mereka semua, sehingga mereka menempati berbagai penjuru bumi. Di akhirat. Mereka ini adalah orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 48",
    "description": "Setelah nabi nuh memohon ampunan kepada Allah, dan Allah menerima ampunan nabi nuh serta menyelamatkannya dari bencana, lalu difirmankan kepadanya, wahai nabi nuh! turunlah bersama keluarga dan pengikutmu dari kapal ini dengan selamat sejahtera dan penuh keberkahan dari kami, bagimu dan bagi semua umat mukmin yang ikut bersamamu maupun umat-umat yang datang sesudahmu sampai hari kiamat. Dan ada pula umat-umat yang datang sesudahmu akan kami beri kesenangan dalam kehidupan dunia, tetapi karena mereka durhaka, maka tidak memperoleh keselamatan dan keberkahan, kemudian mereka akan ditimpa azab kami di dunia dan akhirat atau di akhirat saja dengan siksa yang pedih. Itulah kisah nabi nuh dan umatnya. Kisah yang dipaparkan adalah sebagian dari berita-berita gaib yang kami wahyukan kepadamu, wahai nabi Muhammad; tidak pernah engkau mengetahui informasi kisah itu sebelumnya dan tidak pula kaummu mengetahui kisah itu sebelum informasi Al-Qur'an ini datang. Karena itu, maka bersabarlah dalam menyampaikan tuntunan Al-Qur'an dan tabahlah dalam menghadapi gangguan kaummu, sebagaimana nabi nuh bersabar. Sungguh, kesudahan yang baik adalah bagi orang yang bertakwa. Kebaikan dan kesabaran akan membuahkan kemenangan dan pahala. Kebaikan didapat manakala seseorang mengerjakan ketaatan, sedang kesabaran akan diperoleh dengan meninggalkan hal-hal yang dilarang."
  }
]