[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kisah yang telah kami ceritakan kepadamu (wahai rasul), tentang nuh dan kaumnya, yang merupakan berita ghaib yang telah berlalu, kami mewahyuakn kepadamu apa yang kamu dan kaummu tidak ketahui sebelum keterangan ini, maka bersabarlah kamu menghadapi pendustaan kaummu dan gangguan mereka kepadamu, sebagaimana nabi-nabi terdahulu sabar menghadapinya. Sesungguhnya kesudahan yang baik di dunia dan di akhirat adalah bagi orang-orang yang bertakwa yang takut kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Kisah Nuh ini adalah bagian dari berita-berita gaib yang semula tidak engkau ketahui -wahai Rasul- dan juga tidak diketahui oleh kaummu sebelum datangnya wahyu yang Kami wahyukan kepadamu. Maka bersabarlah engkau terhadap ulah kaummu yang menyakitimu dan mendustakanmu, seperti kesabaran yang ditunjukkan oleh Nuh -'alaihissalām-. Sesungguhnya kemenangan dan kejayaan itu adalah milik orang-orang yang menjalankan perintah-perintah Allah dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Hai Rasulullah, demikianlah kisah-kisah yang Kami ceritakan kepadamu, sebagai kisah-kisah yang tidak mungkin diketahui penjelasan dan perinciannya kecuali melalui wahyu dari Kami. Kamu dan kaummu tidak mengetahui kisah-kisah ini sebelum Kami menyampaikannya. Maka bersabarlah dalam menghadapi kesusahan dan kesulitan, karena ketetapan Allah telah berlaku bahwa kesudahan yang baik adalah bagi orang yang menghiasi diri dengan ketakwaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. تِلْكَ (Itu adalah) Yakni kisah Nabi Nuh itu. مِنْ أَنۢبَآءِ الْغَيْبِ(di antara berita-berita penting tentang yang ghaib) Yakni diantara kisah-kisah yang ghaib. مَا كُنتَ (tidak pernah kamu) Wahai Muhammad. تَعْلَمُهَآ أَنتَ وَلَا قَوْمُكَ مِن قَبْلِ هٰذَا(mengetahuinya dan tidak (pula) kaummu sebelum ini) Yakni sebelum wahyu yang diturunkan ini, maka kedatanganmu dengan membawa berita ini dengan terperinci dan sesuai dengan kenyataan merupakan bukti untuk mereka bahwa kamu benar-benar Rasulullah. فَاصْبِرْ ۖ( Maka bersabarlah) Atas apa yang kamu dapatkan dari orang-orang kafir pada masamu. إِنَّ الْعٰقِبَةَ(sesungguhnya kesudahan yang baik) Yakni kesudahan yang baik di dunia dan di akhirat. لِلْمُتَّقِينَ (bagi orang-orang yang bertakwa) Bertakwa kepada Allah dan beriman kepada apa yang dibawa oleh para Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Kisah tentang Nuh itu adalah di antara berita-berita penting tentang yang ghaib yang Kami wahyukan kepadamu Muhammad; tidak pernah kamu mengetahuinya dan tidak pula kaummu sebelum ini. Maka bersabarlah; sesungguhnya kesudahan yang baik adalah bagi orang-orang yang mewaspadai kesyirikan dan kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itu adalah sebagian dari berita-berita} kabar-kabar {ghaib yang Kami wahyukan kepadamu. Kamu tidak mengetahuinya dan tidak pula kaummu sebelum ini. Maka bersabarlah. Sesungguhnya kesudahan yang baik adalah bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Allah berfirman kepada nabiNya Muhammad setelah menyampaikan kisah yang gamblang ini yang tidak diketahui kecuali oleh orang yang Allah beri nikmat kerasulan. ”itu adalah diantara berita berita penting tentang yang ghaib yang kami wahyukan kepadamu (Muhammad) tidak pernah kamu mengetahuinya dan tidak pula kaummu sebelum ini\". Maka mereka berkata: Dia mengetahuinya, maka pujilah Allah dan bersukurlah kepada Allah dan bersabarlah kamu, berpegang teguhlah pada agamamu yang benar, jalan yang lurus dan dakwah kepada Allah. “sesungguhnya kesudahan yang baik adalah bagi orang orang yang bertakwa” orang orang yang menjauhi syirik dan dosa dosa yang lain. maka kesudahan yang baik akan menjadi milikmu dan milik kaummu sebagaimana terjadi pada Nuh dan kaumnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (للمتقين) Lilmuttaqiin : orang-orang yang bertakwa kepada Allah, menyembahnya dan tidak mensekutukan-Nya dengan sesuatu apa pun. Makna ayat : Firman-Nya pada ayat 49, ayat terakhir yang akan menceritakan kisah Nuh, (تلك من أنباء الغيب نوحيها) Kisah yang Kami sampaikan kepadamu adalah perkara gaib, tidak ada yang mengetahuinya kecuali Allah (نوحيها) Kami wahyukan kepadamu melalui ayat-ayat Al-Qur’an, (ما كنت تعلمها أنت ولا قومك) engkau dan kaummu tidak mengetahui detail kisah ini sebelum turunnya Al-Qur’an, oleh karena itu (فاصبر) bersabarlah wahai Rasul Kami, atas gangguan dari kaummu dalam menyampaikan dakwah Rabbmu, hingga tiba pertolongan Kami, karena akhir yang bahagia dan terpuji senantiasa untuk orang yang bertakwa kepada Rabbnya dan bersabar melakukannya hingga mereka menghadap-Nya dalam keadaan beriman, bersabar, dan mengharapkan pahala-Nya. Pelajaran dari ayat : • Penjelasan pelajaran dari kisah-kisah yang terdapat dalam al-Qur’an, yaitu menghibur Rasul shallahu ‘alaihi wa sallam dan kaum mukiminin • Penegasan kenabian Rasulullah shallahu ‘alaihi wa sallam, dengan bukti logika, yaitu pemberitahuan tentang hal gaib yang tidak mungkin dicapai kecuali dengan wahyu. • Keutamaan bersabar, dan akhir yang indah bagi orang-orang yang bertakwa, bertauhid dan beramal saleh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 49: Allah Subhaanahu wa Ta'aala berfirman kepada Nabi-Nya Muhammad shallallahu 'alaihi wa sallam setelah mengisahkan kisah tersebut, di mana kisah tersebut tidak ada yang mengetahuinya kecuali orang yang dianugerahkan kenabian dan kerasulan kepadanya. Dalam berdakwah dan dalam menerima gangguan dari kaummu sebagaimana Nabi Nuh bersabar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 49",
    "description": "Itulah kisah nabi nuh dan umatnya. Kisah yang dipaparkan adalah sebagian dari berita-berita gaib yang kami wahyukan kepadamu, wahai nabi Muhammad; tidak pernah engkau mengetahui informasi kisah itu sebelumnya dan tidak pula kaummu mengetahui kisah itu sebelum informasi Al-Qur'an ini datang. Karena itu, maka bersabarlah dalam menyampaikan tuntunan Al-Qur'an dan tabahlah dalam menghadapi gangguan kaummu, sebagaimana nabi nuh bersabar. Sungguh, kesudahan yang baik adalah bagi orang yang bertakwa. Kebaikan dan kesabaran akan membuahkan kemenangan dan pahala. Kebaikan didapat manakala seseorang mengerjakan ketaatan, sedang kesabaran akan diperoleh dengan meninggalkan hal-hal yang dilarang. Setelah dipaparkan kisah nabi nuh beserta kaumnya dan diakhiri dengan pernyataan bahwa kesudahan baik akan diraih orang yang bertakwa, maka pada ayat ini diuraikan tentang kisah nabi hud beserta kaumnya, sebagaimana firman Allah, dan kami mewahyukan kepadamu, wahai nabi Muhammad bahwa kepada kaum 'ad, kami utus saudara mereka seketurunan, yaitu nabi hud. Dia berkata, wahai kaumku! sembahlah Allah dan jangan menyembah selain dia. Dialah pencipta seluruh alam seisi-Nya, tidak ada tuhan bagimu yang berhak disembah selain dia. Dan apa pun yang selama ini kamu sembah, itu hanyalah mengada-ada karena bukti tentang keesaan dan kekuasaan Allah sudah jelas."
  }
]