[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang musyrik menyembunyikan kekafiran di hati-hati mereka, karena beranggapan bahwa akan tersembunyi bagi Allah apa yang dirahasiakan jiwa-jiwa mereka. Tidakkah mereka mengetahui ketika mereka menutup-nutupi tubuh-tubuh mereka dengan pakaian-pakaian mereka bahwa sesungguhnya Allah tidak tersembunyi bagiNya rahasia dan tindakan nyata mereka? sesungguhnya Dia mahamengetahui semua perkara yang disembunyikan oleh hati-hati mereka berupa niat-niat , bisikan hati nurani, dan rahasia-rahasia jiwa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Ingatlah! Sesungguhnya orang-orang musyrik itu membungkukkan dada mereka untuk menyembunyikan apa yang ada di dalam dada mereka berupa keraguan tentang Allah, karena kebodohan mereka. Ingatlah, ketika mereka menutupi kepala mereka dengan baju mereka, sesungguhnya Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka tampakkan. Sesungguhnya Dia Maha Mengetahui apa yang tersimpan di dalam dada."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah memperingatkan orang-orang yang berpaling; bagaimana mereka jika bertemu Nabi di jalan atau pasar, mereka bersembunyi dan menjauh agar beliau tidak melihat mereka. Ini merupakan bukti keingkaran, kejahilan, dan kelalaian mereka dari pengawasan Allah dalam setiap keadaan mereka, dan ilmu Allah tentang apa yang tersembunyi dalam hati mereka dan yang terbesit dalam otak mereka, berupa was-was, bisikan, dan fikiran-fikiran mereka. Dan peringatan ini juga untuk meluruskan kesalahan banyak orang yang malu menghadap ke langit ketika bergaul dengan istri mereka, padahal Allah melihat dan mengetahui apa yang ada dalam hati mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. أَلَآ إِنَّهُمْ يَثْنُونَ صُدُورَهُمْ (Ingatlah, sesungguhnya (orang munafik itu) memalingkan dada mereka) Yakni berpaling dari Allah dan terus dalam keadaan mereka. لِيَسْتَخْفُوا۟ مِنْهُ ۚ( untuk menyembunyikan diri daripadanya) Yakni menyembunyikan amal keburukan mereka dari Allah agar Rasulullah dan orang-orang beriman tidak dapat mengetahuinya. أَلَا حِينَ يَسْتَغْشُونَ ثِيَابَهُمْ(Ingatlah, di waktu mereka menyelimuti dirinya dengan kain) Ketika mereka tidur di atas Kasur mereka dan menutupi diri dengan selimut mereka, Allah tetap mengetahui apa yang ada dalam hati mereka. Imam Mujahid berkata: mereka memalingkan dada mereka saat berbuat atau berkata sesuatu, dengan ini mereka menganggap telah menyembunyikannya dari Allah. يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ۚ( Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka tampakkan) Sehingga tidak ada guna bagi mereka untuk menyembunyikan sesuatu karena hal yang lahir dan batin adalah hal yang sama bagi Allah. إِنَّهُۥ عَلِيمٌۢ بِذَاتِ الصُّدُورِ(sesungguhnya Allah Maha Mengetahui segala isi hati) Yakni ucapan yang ada dalam hati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5 Ingatlah, sesungguhnya orang munafik itu memalingkan dada berupa dendam dan benci untuk menyembunyikan diri daripadanya (Muhammad). Ingatlah, di waktu mereka menyelimuti dirinya dengan kain karena benci melihat nabi SAW, Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka tampakkan, sesungguhnya Allah Maha Mengetahui segala isi hati dan yang ada dalam dada. Surat ini turun untuk kaum kafir, ketika mereka berpapasan dengan Rasul SAW mereka selalu menutup dada (memalingkan dan menutupinya) dan memalingkan muka mereka, serta menutup muka mereka dengan baju mereka karena menjauhi dan tidak suka berpapasan dengan Rasul. Mereka menyangka jika yang mereka lakukan itu bisa bersembunyi dari pengawasan Allah dan rasul-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketahuilah sesungguhnya mereka menutupi} membelokkan {dada mereka untuk menyembunyikan diri dariNya} untuk menyembunyikan diri dari Allah {Ketahuilah bahwa ketika mereka menyelimuti dirinya dengan kain} menutupi kepala mereka dengan pakaian mereka {Dia mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan. Sesungguhnya Dia Maha Mengetahui isi hati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Allah mengabarkan kebodohan orang-orang musyrik dan kesesatan mereka yang jauh, bahwa mereka itu “memalingkan dada mereka” maksudnya, mereka berpaling agar bisa bersembunyi dari Allah sehingga dada mereka itu menghalangi ilmu Allah tentang keadaan mereka dan menghalangi penglihatanNya kepada gerak-gerik mereka. Allah berfirman menjelaskan kesalahan mereka dalam prasangkanya ini, “Ingatlah di waktu mereka menyelimuti dirinya dengan kain.” Yakni menutupi dengannya. Dalam kondisi tersebut yang merupakan kondisi paling tersamar, Allah tetap mengetahui keadaan mereka lebih dari itu. “Allah mengetahui apa yang mereka sembunyikan”, berupa perkataan dan perbuatan, “dana pa yang mereka tampakkan”, darinya bahkan apa yang lebih mendalam darinya, yaitu “sesungguhnya Allah Maha Mengetahui segala isi hati.” Yakni keinginan-keinginan, was-was dan pemikiran-pemikiran yang ada di dalamnya yang tidak dikatakan, baik secara rahasia atau terang-terangan, bagaimana mungkin keadaanmu samar bagiNya ketika kamu memalingkan dadamu agar bisa bersembunyi dariNya? Ada kemungkinan makna lain dalam hal ini yaitu bahwa Allah menyebut berpalingnya orang-orang musyrik dari Rasul dan kelalaian mereka terhadap dakwahnya, bahwa karena kerasnya berpalingnya mereka, sampai mereka memalingkan dada mereka yakni mereka membelokkan badan manakala mereka meihat Rasu agar beliau tidak melihat mereka, menyampaikan dakwahnya dan menasehati mereka dengan sesuatu yang bermanfaat bagi mereka. Adakah sesuatu yang melebihi atas berpalingnya mereka ini? Kemudian Allah mengancam mereka dengan ilmuNya terhadap seluruh keadaan mereka, dan bahwa mereka tidak ada sesuatu pun yang tersembunyi atas Allah dan Dia akan membalas mereka sesuai dengan perbuatan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يُثْنُوْنَ صُدُوْرَهُمْ) Yastnuuna shudurahum : Menundukkan kepala mereka dengan harapan dapat bersembunyi dari Allah. (يَسْتَغْشَوْنَ ثِيَابَهُمْ) Yastaghsyuuna tsiyaabahum : Menutupi kepala serta wajah supaya Allah tidak bisa melihat mereka. Makna ayat : Firman-Nya (أَلَآ إِنَّهُمۡ يَثۡنُونَ صُدُورَهُمۡ لِيَسۡتَخۡفُواْ مِنۡهُۚ) Ini adalah contoh perilaku yang buruk lagi bodoh, sebagian dari mereka menundukkan kepala mereka sehingga Rasulullah tidak melihat mereka, dan sebagian yang lain berfikir kalau mereka bisa menyembunyikan diri mereka dari Allah, ini adalah puncak dari kebodohan, lalu ada yang melakukannya karena kebencian mereka terhadap Rasulullah sehingga mereka enggan melihat beliau. Maka Allah membantah mereka dengan firman-Nya (أَلَا حِينَ يَسۡتَغۡشُونَ) menutupi wajah mereka dengan pakaian (يَعۡلَمُ مَا يُسِرُّونَ وَمَا يُعۡلِنُونَۚ إِنَّهُۥ عَلِيمُۢ بِذَاتِ ٱلصُّدُورِ) Tidak ada gunanya mereka menutupi diri dari Allah, karena Allah mengetahui rahasia mereka dan apa yang mereka tampakkan serta yang tersembunyi di dalam hati mereka. Adapun jika mereka melakukannya karena kebencian mereka kepada Rasulullah, maka sungguh buruk perilaku mereka, Allah akan membalas apa yang mereka lakukan, sungguh Dia Maha Bijaksana lagi Maha Mengetahui. Pelajaran dari ayat : 1. Penjelasan tentang kebodohan orang-orang musyrik dimana mereka mencoba menutupi wajah mereka dari Allah. 2. Kembalinya seluruh manusia kepada Rabb mereka, baik mereka mau atau enggan. Pengadilan yang adil, tidak ada seorang pun yang binasa di sisi Allah, kecuali orang yang benar-benar celaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 5: Tentang sebab turunnya ayat ini disebutkan dalam hadits riwayat Imam Bukhari dari Muhammad bin ‘Abbad bin Ja’far, bahwa ia mendengar Ibnu Abbas membacakan ayat, “Alaa innahum yatsnuuna shudurahum,” Ia (Muhammad bin ‘Abbad) berkata, “Aku bertanya kepadanya tentang ayat itu, ia menjawab, “Mereka adalah orang-orang yang merasa malu ketika buang hajat jika kelihatan ke langit atau menjima’i istrinya lalu kelihatan ke langit, maka turunlah ayat berkenaan dengan mereka.” Dari jalan yang lain Imam Bukhari meriwayatkan dari Muhammad bin ‘Abbad bin Ja’far, bahwa Ibnu Abbas pernah membacakan ayat, “Alaa innahum yatsnuuna shudurahum,” aku pun bertanya, “Wahai Abul ‘Abbas, apa maksud mereka memalingkan (membungkukkan) dadanya?” Ia menjawab, “Yaitu seseorang menjima’i istrinya, lalu ia merasa malu atau buang hajat (dalam keadaan telanjang), lalu merasa malu (kemudian membungkukkan dadanya), maka turunlah ayat, “Alaa innahum yatsnuuna shudurahum,” Ada pula yang berpendapat, bahwa ayat ini turun berkenaan dengan orang-orang munafik, wallahu a’lam. Bisa juga diartikan “membungkukkan.” Jika turun berkenaan dengan orang-orang munafik, maka maksudnya bahwa mereka menyembunyikan perasaan permusuhan dan kemunafikan mereka terhadap Nabi Muhammad shallallahu 'alaihi wa sallam, sehingga kata “dia” di sana kembalinya kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Tetapi jika turun berkenaan orang-orang yang merasa malu ketika buang hajat atau menjima’i istrinya, maka kata “dia” di sana kembalinya kepada Allah, yakni mereka mencoba menyembunyikan diri dengan membungkukkan dadanya agar tidak dilihat-Nya, padahal Dia mengetahui segalanya termasuk apa yang disembunyikan dalam hati mereka. Ada pula yang menafsirkan, bahwa orang-orang yang mendustakan Rasulullah shallallahu 'alaihi wa sallam karena saking berpalingnya mereka dari dakwah Beliau sampai membungkukkan dadanya ketika melihat Rasulullah shallallahu 'alaihi wa sallam agar Beliau tidak melihat mereka dan tidak mendakwahi mereka. Sehingga perbuatan mereka, yakni berusaha bersembunyi tidaklah berguna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 5",
    "description": "Setelah menjelaskan bahwa seluruh manusia akan kembali dan menghadap Allah pada hari kiamat nanti, lalu ayat ini menjelaskan bahwa pengetahuan Allah meliputi apa saja yang ditampakkan maupun yang disembunyikan. Ingatlah, sesungguhnya mereka, yaitu orang-orang munafik, memalingkan dada dari kebenaran agama yang dibawa oleh nabi Muhammad, untuk menyembunyikan sesuatu dalam diri, yakni permusuhan dan kemunafikan mereka dari dia, yakni nabi Muhammad. Ingatlah, ketika mereka dengan sungguh-sungguh menyelimuti, menutupi diri-Nya dengan kain agar tidak terlihat oleh Allah dan nabi Muhammad, Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka nyatakan, yakni tampakkan, sungguh, Allah maha mengetahui segala isi hati dan segala yang tersembunyi. Dan tidak satu pun makhluk bergerak dan bernyawa, yang melata, merayap atau berjalan di muka bumi ini melainkan semuanya telah dijamin Allah rezekinya. Semua makhluk itu diberi naluri dan kemampuan untuk mencari rezeki sesuai dengan fitrah kejadiannya. Dia mengetahui tempat kediamanya ketika hidup di dunia dan mengetahui pula tempat penyimpanannya setelah mati. Semua itu sudah tertulis dan diatur serapirapinya dalam kitab yang nyata, yaitu lauh mahfudh, perihal perencanaan dan pelaksanaan dari seluruh ciptaan Allah secara menyeluruh dan sempurna."
  }
]