[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, aku tidak meminta imbalan dari kalian atas dakwahku terhadap kalian untuk memurnikan ibadah kepada Allah dan meninggalkan penyembahan patung-patung. Imbalanku atas dakwahku terhadap kalian hanyalah menjadi tanggungan Allah yang telah menciptakanku. Tidaklah kalian mau berfikir?, sehingga kalian dapat membedakan mana yang hak dan mana yang batil?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Wahai kaumku! Aku tidak meminta imbalan apapun dari kalian atas jasaku menyampaikan wahyu dari Tuhanku dan mengajak kalian beriman kepada-Nya. Imbalanku adalah dari sisi Allah yang telah menciptakanku. Tidakkah kalian mengerti akan hal itu dan mengikuti ajakanku?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Hai kaumku, aku tidak meminta kepada kalian upah dari dakwah yang aku lakukan, sehingga kalian berprasangka buruk terhadapku. Balasan bagiku hanya dari Allah yang telah menciptakanku di atas fitrah yang lurus. Apakah kalian tidak memakai akal kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. يٰقَوْمِ لَآ أَسْـَٔلُكُمْ عَلَيْهِ أَجْرًا ۖ (Hai kaumku, aku tidak meminta upah kepadamu bagi seruanku ini) Yakni atas penyampaian dan nasehat kepada kalian ini. عَلَى الَّذِى فَطَرَنِىٓ ۚ (hanyalah dari Allah yang telah menciptakanku) Dan Dia akan memberiku pahala atas seruan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Hai kaumku, aku tidak meminta upah kepadamu atas seruanku ini. Upahku tidak lain hanyalah dari Allah yang telah menciptakanku. Maka tidakkah kamu memikirkan kebenaran itu dengan sebenar-benarnya untuk mengetahui kebenaran yang diberikan kepadamu?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai kaumku, aku tidak meminta imbalan kepada kalian atas seruanku ini. Imbalanku hanyalah dari Dzat yang telah menciptakanku} menciptakanku {Apakah kamu tidak berpikir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. kemudian Hud menyebutkan tidak adanya penghalang bagi mereka untuk patuh kepadanya, ”hai kaumku, aku tidak meminta upah kepadamu bagi seruanku ini” yakni bayaran dari hartamu atas ajakanku yang akibatnya kamu akan berkata bahwa orang ini hendak mengambil harta kami. Aku berdakwah dan mengajar Cuma Cuma. ”tidaklah upahku melainkan dari Allah yang telah menciptakanku, maka tidakkah kamu memikirkannya? Sesuatu yang aku dakwahkan kepadamu, yang harus diterima. Berpikir adalah penghilang suatu penghalang dari penolakan terhadap dakwah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لا أسألكم عليه أجرا) : Aku tidak meminta upah dari kalian atas apa yang aku sampaikan berupa dakwah tauhid. (فطرني) : Yang menciptakanku. Makna ayat : Firman-Nya (يا قوم لا أسألكم عليه أجرا) yaitu, aku tidak meminta kalian upah atas ajakan ku kepada kalian menuju tauhid, sehingga kalian menjadi sempurna dengan hanya beribadah kepada-Nya meraih pahala (harta) (إن أجري إلا على الذي فطرني) upahku hanya dari Allah yang telah menciptakanku. Dan firman-Nya (أفلا تعقلون) tidak kah kalian berpikir senadainya aku mencari upah dengan dakwah menuju tauhid, tentu aku akan memintanya dari kalian. Namun aku sama sekali tidak meminta sepeser pun upah, kecuali dari Rabb ku. Maka jelaslah kejujuranku dalam ajakan dan nasehatku untuk kalian. Pelajaran dari ayat : • Kewajiban ikhlas dalam dakwah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 51: Agar kamu tidak mengatakan, bahwa seruanku dimaksudkan untuk mencari hartamu. Oleh karena Beliau tidak meminta imbalan apa-apa atas seruannya, maka yang demikian seharusnya menjadikan mereka tunduk mengikuti seruannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 51",
    "description": "Kemudian nabi hud menyampaikan bahwa dakwah yang ia lakukan adalah tulus tanpa pamrih dengan pernyataannya, wahai kaumku! aku tidak meminta suatu imbalan sedikit pun kepadamu atas seruanku ini. Imbalanku hanyalah dari Allah yang telah menciptakanku. Karena ketika Allah menciptakanku, pasti dia telah menyiapkan segala sarana dan kebutuhanku. Maka jika demikian, tidakkah kamu memikirkan tentang kebenaran seruanku ini'dan nabi hud lalu mengajak mereka, wahai kaumku! mohonlah ampunan kepada tuhanmu yang selama ini telah melimpahkan karunianya kepadamu, dan mohonlah ampunan atas dosa yang kalian perbuat lalu bertobatlah kepada-Nya dengan meninggalkan kedurhakaan dan bertekad untuk tidak mengulanginya, niscaya dia akan menurunkan hujan yang sangat deras yang membawa keberkahan dengan berbagai karunia lahir dan batin, dan dia akan menambahkan pula kekuatan yang besar berupa kekuatan spiritual buah dari keimanan kepada Allah atau berupa keturunan dan harta benda di atas kekuatan fisikmu yang kalian miliki sekarang. (lihat: surah nuh/71: 10-12). Maka sekali lagi bertobatlah, dan janganlah kamu berpaling dari tuntunan-Nya yang aku sampaikan, dan janganlah kembali lagi menjadi orang yang berdosa. Ayat ini menunjukkan bahwa beristigfar dan bertobat adalah pangkal segala kebaikan jiwa, raga, harta, dan keturunan."
  }
]