[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, “wahai Hud, kamu tidaklah datang kepada kami dengan membawa hujjah yang jelas yang menunjukan kebenaran dakwah yang kamu seru kepadanya, dan kami tidak akan meninggalkan tuhan-tuhan sesembahan kami yang telah kami sembah hanya kerena ucapanmu. Dan kami tidak membenarkan kamu terkait apa yang kamu sampaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Kaumnya berkata, \"Wahai Hūd! Engkau tidak membawa bukti nyata yang bisa membuat kami percaya kepadamu. Kami tidak akan berhenti menyembah tuhan-tuhan kami hanya karena kata-katamu yang tidak berdasar. Dan kami tidak percaya kepadamu tentang pengakuanmu bahwa engkau adalah Rasul!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Mereka menjawab: “Hai Hud, kamu tidak mendatangkan kepada kami mukjizat yang menjadi bukti kebenaran risalah dan dakwahmu sehingga kami dapat menerimanya. Dan kami tidak akan meninggalkan penyembahan tuhan-tuhan kami demi mengikuti perkataanmu, namun kami akan meninggalkan perkataanmu itu dan tidak mempedulikannya. Kami tidak akan mempercayaimu dan mengikuti dakwahmu apapun yang terjadi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. مَا جِئْتَنَا بِبَيِّنَةٍ (kamu tidak mendatangkan kepada kami suatu bukti yang nyata) Yakni dengan bukti yang jelas yang menunjukkan bahwa kamu benar-benar seorang Rasul yang diutus oleh Allah dan kamu bukanlah orang yang berdusta yang mengaku sebagai utusan Allah. وَمَا نَحْنُ بِتَارِكِىٓ ءَالِهَتِنَا(dan kami sekali-kali tidak akan meninggalkan sembahan-sembahan kami) Yang kami sembah selain Allah. عَن قَوْلِكَ(karena perkataanmu) Yang berasal dari perkataanmu tanpa ada bukti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Kaum ‘Ad berkata: “Hai Hud, kamu tidak mendatangkan suatu bukti yang nyata kepada kami. Kami sekali-kali tidak akan meninggalkan sembahan-sembahan kami karena perkataanmu, dan kami sekali-kali tidak akan mempercayai kamu sebagai Nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Hud, kamu tidak mendatangkan kepada kami suatu bukti yang nyata} dalil yang jelas {dan kami tidak akan meninggalkan tuhan-tuhan kami karena perkataanmu} karena perkataanmu {kami tidak akan percaya kepadamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. mereka menjawab ucapan Hud, “hai Hud, kamu tidak mendatangkan kepada kami suatu bukti yang nyata” jika yang mereka maksud adalah bukti yang nyata, bukti nyata yang mereka ada-adakan, mak ini tidak mesti untuk sebuah kebenaran. Bahkan Nabi telah mendatangkan tanda-tanda yang menunjukan kebenaran apa yang dibawanya. Dan jika maksud mereka adalah bahwa dia tidak membawakan bukti nyata yang menjadi saksi atas perkataannya sebagai suatu kebenaran, maka mereka telah berdusta dalam hal ini karena tiada seorang Nabi pun yang datang kepada kaumnya melainkan Allah pasti memberinya ayat ayat mukjizat yang membuat orang beriman. kalaupun dia tidak menghadirkan ayat ayat kecuali ajakannya kepada mereka agar mengikhlaskan agama hanya kepada Allah semata, tidak ada sekutu bagiNya, perintahnya kepada semua perbuatan baik dan perilaku yang terpuji, larangannya terhadap sifat sifat tercela berupa menyekutukan Allah, perbautan perbautan keji, perbuatan aniaya dan macam macam kemungkaran disertai sifat sifat yang dimiliki sendiri oleh Hud yang tidak dimiliki kecuali oleh orang orang yang jujur lagi terpilih, niscaya cukuplah itu sebagai tanda dan bukti atas kebenarannya, bahkan orang orang yang beerakal dan ulil albab melihat bahwa tanda ini lebih besar daripada sekedar mukjizat yang dilihat oleh sebagian orang saja. Diantara tanda tanda dan bukti bukti yang menunjukan atas kebenarannya adalah bahwa dia adalah satu orang, tanpa kawan dan pendukung sedangkan dia menyeru kepada kaumnya, memanggil mereka, menantang mereka dan berkata kepada mereka ”sesungguhnya aku bertawakal kepada Allah, Rabbku dan Rabbmu”. \"“Sesungguhnya aku bersaksi kepada Allah dan saksikanlah olehmu sekalian bahwa sesungguhnya aku berlepas diri dari apa yang kamu persekutukan, Dari selain-Nya, sebab itu jalankanlah tipu dayamu semuanya terhadapku dan janganlah kamu memberi tangguh kepadaku.\" (QS. Hud :54-55) Mereka adalah musuh, pemegang kendali kekuasaan, mereka hendak memedamkan cahaya yang dibawanya dengan cara apapun. Namun hud tidak menghiarukan dan mempedulikan mereka. Dan mereka tidak mampu dan tidak kuasa sedikitpun menimpakan keburukan kepadanya. Sesungguhnya pada yang demikian itu terdapat tanda tanda bagi orang yang berakal. Ucapan mereka, ”dan kami sekali kali tidak akan meninggalkan sembahan sembahan kami karena perkataanmu” maksudnya, kami tidak akan meninggalkan penyembahan terhadap tuhan tuhan kami hanya disebabkan oleh perkataanmu yang mana kamu tidak mendukungnya menurut mereka degan bukti apapun. ”dan kami sekali kali tidak akan mempercayai kamu” ini adalah pemutusasaan dari mereka kepada nabi mereka Hud terhadap kemungkinan mereka beriman, dan bahwa mereka akan tetap tersesat di dalam kekufuran mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِبَيِّنَةٖ) bibayyinah : dengan hujjah dan bukti atas benarnya apa yang engkau dakwahkan: memurnikan ibadah hanya kepada Allah. (وَمَا نَحۡنُ بِتَارِكِيٓ ءَالِهَتِنَا) : meninggalkan peribadatan sesembahan kami karena perkataanmu bahwa mereka tidak pantas disembah. Makna ayat : Masih melanjutkan kisah Hud dan kaumnya, Allah mengkabarkan tentang perkataan kaum Hud kepadanya : (قَالُواْ يَٰهُودُ مَا جِئۡتَنَا بِبَيِّنَةٖ) “Wahai Hud, engkau tidak datang dengan bukti kebenaran seruanmu kepada kami, agar kami menyembah Allah dan meninggalkan sesembahan kami serta mengakui kenabianmu. (وَمَا نَحۡنُ بِتَارِكِيٓ ءَالِهَتِنَا) kami tidak akan meninggalkan peribadatan kepada mereka (عَن قَوۡلِكَ) disebabkan perkataanmu, bahwa mereka tidak pantas disembah karena tidak mampu memberikan manfaat tidak pula bahaya. (وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِينَ) tidaklah kami akan mengikutimu—agama mu—tidak pula membenarkan apa yang engkau ucapkan. Pelajaran dari ayat : • Penjelasan mengenai perselisihan dan permusuhan kaum musyrikin dari masa ke masa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 53: Jika maksud mereka dari \"bukti yang nyata\" adalah bukti yang mereka usulkan, maka yang demikian tidak mesti harus ada pada kebenaran, bahkan yang mesti adalah seorang nabi datang membawa ayat yang menunjukkan kebenaran yang dibawanya. Namun jika maksud mereka, bahwa belum datang kepada mereka bukti yang membenarkan ucapan Beliau, maka sesungguhnya mereka telah berdusta, karena tidak ada seorang nabi pun yang datang kecuali Allah menyertakan bersamanya ayat yang semisalnya pasti diimani manusia. Kalau pun Beliau tidak memiliki ayat selain dakwah Beliau kepada mereka agar mereka beribadah hanya kepada Allah dan tidak menyekutukan-Nya dengan sesuatu, serta perintah Beliau kepada mereka untuk mengerjakan semua amal saleh, berakhlak mulia dan melarang semua amal buruk dan akhlak tercela, seperti syirk, perbuatan keji, kezaliman, berbagai kemungkaran. Belum lagi ditambah dengan sifat mulia yang dimiliki Nabi Hud, sifat makhluk pilihan Allah, maka yang demikian sudah cukup menjadi ayat dan bukti terhadap kebenarannya. Bahkan orang-orang yang berakal memandang, bahwa ayat itu lebih besar daripada perkara luar biasa yang dilihat oleh sebagian manusia, yakni mukjizat. Termasuk tanda kebenaran Beliau adalah bahwa Beliau hanya seorang diri, tidak memiliki beberapa orang penolong maupun pembela, namun Beliau berani menyeru mereka dengan lantang dan melemahkan mereka, serta berkata, \"Sesungguhnya aku bersaksi kepada Allah dan saksikanlah bahwa aku berlepas diri dari apa yang kamu persekutukan dengan yang lain, sebab itu jalankanlah semua tipu dayamu terhadapku dan jangan kamu tunda lagi. Sesungguhnya aku bertawakkal kepada Allah Tuhanku dan Tuhanmu.” Musuh-musuh Nabi Hud memiliki kekuatan dan berusaha memadamkan cahaya yang bersama Beliau dengan berbagai cara, namun Beliau tidak peduli terhadap mereka, dan ternyata mereka lemah tidak sanggup menimpakan keburukan apa-apa. Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi orang-orang yang berakal. Ucapan mereka ini untuk membuat Nabi Hud berputus asa, dan bahwa mereka akan senantiasa kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 53",
    "description": "Setelah nabi hud mengajak kaum 'ad kepada ketauhidan, mereka lalu berkata, wahai hud! engkau tidak mendatangkan suatu bukti yang nyata kepada kami tentang kebenaran ajaran yang kamu bawa, dan karena itu, kami pun tidak akan meninggalkan sesembahan kami yang selama ini telah kami sembah hanya karena perkataanmu yang tidak berdasar dan kami tidak akan mempercayaimu. Sekalipun bukti kekuasaan Allah yang disampaikan para rasul sudah jelas, karena kesombongan, seseorang menganggap bahwa bukti tersebut tidak jelas. Kaum nabi hud melontarkan tuduhan kepada nabinya seraya berkata, kami hanya mengatakan bahwa sebagian sesembahan kami telah menimpakan penyakit gila atas dirimu disebabkan kamu mencela berhala sesembahan kami. Kemudian dia, yakni nabi hud menjawab, sesungguhnya aku bersaksi kepada Allah tuhan yang mahakuasa dan saksikanlah bahwa aku berlepas diri dari apa yang kamu persekutukan terhadap Allah yang maha esa, penguasa alam semesta."
  }
]