[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-55. Kami tidak mengatakan kecuali bahwa sebagian tuhan-tuhan sesembahan kami telah menimpakan kegilaan kepadamu, disebabkan laranganmu menyembahnya. Hud berkata kepada mereka, ”sesungguhnya aku persaksikan Allah atas apa yang aku katakan, dan saksikanlah oleh kalian bahwa sesungguhnya aku berlepas diri dari apa yang kalian persekutukan selain Allah berupa tandingan-tandingan dan berhala-berhala selain Allah. Maka perhatikan dan kerahkanlah segala daya oleh kalian dan semua tuhan untuk menimpakan mudarat padaku, dan janganlah kalian menunda hal itu walaupun sekedipan mata sekalipun.” Yang demikian itu, karena Hud sangat yakin sepenuhnya bahwa sesungguhnya tidak akan ada gangguan yang menimpanya dari mereka maupun tuhan-tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54 - 55. Kami hanya mengatakan bahwa salah satu dari tuhan-tuhan kami telah membuatmu gila ketika kamu melarang kami menyembah mereka. Hūd berkata, \"Sesungguhnya aku meminta Allah untuk menjadi saksi, dan bersaksilah kalian bahwa aku sama sekali tidak pernah menyembah tuhan-tuhan yang kalian sembah selain Allah. Maka silakan kalian bersama tuhan-tuhan sesembahan kalian yang menurut kalian telah membuatku menjadi gila itu membuat tipu daya terhadapku. Kemudian jangan kalian memberi penangguhan waktu kepadaku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Mintalah kepada tuhan-tuhan selain Allah yang kalian kehendaki dan bersepakatlah untuk membuat makar terhadapku, dan janganlah kalian menundanya lagi. Nabi Hud menantang mereka dengan tantangan ini agar tersingkap kepalsuan tuhan-tuhan mereka dan terputus harapan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. مِن دُونِهِۦ ۖ (dari selain-Nya) Yakni dari kesyirikan kalian dengan menyekutukannya dengan yang lain tanpa ada hujjah yang Allah turunkan bagi kalian. فَكِيدُونِى جَمِيعًا(sebab itu jalankanlah tipu dayamu semuanya terhadapku) Yakni buatlah tipu daya terhadapku oleh kalian dan para sesembahan kalian jika memang sesembahan itu dapat memberiku mudharat dan keburukan sebagaimana yang kalian akui. ثُمَّ لَا تُنظِرُونِ (dan janganlah kamu memberi tangguh kepadaku) Yakni jangan tunda tipu daya itu terhadapku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Sesungguhnya aku berlepas diri dari seluruh berhala dan musuh Allah, yaitu apa yang kalian sekutukan selain Allah. rencanakanlah tipu daya kepadaku semampu kalian, yaitu kalian dan tuhan yang kalian anggap akan berbahaya bagiku, lalu mengabaikanku, sungguh segeralah menyakitiku. Tantangan dari Hud ini adalah usaha untuk menurunkan penderitaan dan kehancuran sebagai mukjizat terbesarnya, yaitu bahwa dia sendiri dan mereka itu dalam kelompok besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dengan selain Dia. Maka lakukanlah semua tipu daya kalian terhadapku} Lakukanlah tipu daya kalian dan tuhan-tuhan kalian untuk membahayakanku {dan janganlah kalian menunda-nunda lagi} maka janganlah kalian menunda untukku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55 Oleh karena itu, Hud menjelaskan bahwa dia benar benar percaya diri bahwa dia tidak akan tertimpa kesulitan dari mereka dan dari sesembahan sesembahan mereka, dia berkata ”sesungguhnya aku jadikan Allah sebagai saksiku, dan saksikanlah olehmu sekalian bahwa aku berlepas diri dari apa yang kamu persekutukan, dari selainNya. Sebab itu jalankanlah tipu dayamu semuanya terhadapku” yakni carilah kemudaratan untukku semuanya dengan segala cara yang bisa kamu lakukan, ”dan janganlah kamu memberi tangguh kepadaku” yakni, janganlah menangguhkan itu padaku."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ثُمَّ لَا تُنظِرُونِ) : janganlah kalian tunda. Makna ayat : (مِن دُونِهِۦۖ) dari selain Allah yaitu berhala-berhala dan sekutu, kemudian menantang mereka seraya meremehkan mereka dan sesembahan mereka, (فَكِيدُونِي جَمِيعٗا) “Buatlah tipu daya untuk mencelakai ku dan jangan kalian tunda-tunda."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 55",
    "description": "Aku berlepas diri dari sesembahan selain Allah, seperti berhala. Oleh sebab itu, jalankanlah semua tipu dayamu terhadapku bersama penolongpenolongmu untuk mencelakakan aku, dan jangan kamu tunda lagi walau sekejap. Sesungguhnya aku bertawakal dengan menyerahkan semua urusanku hanya kepada Allah tuhanku dan tuhanmu, karena dialah yang mememeliharaku dan dapat menghindarkan diriku dari tipu dayamu. Tidak satu pun makhluk bergerak yang bernyawa di muka bumi melainkan dialah yang memegang ubun-ubunnya, yakni menguasai, mengatur, dan mengurus semua makhluk-Nya. Sungguh, tuhanku berada di jalan yang lurus, yakni jalan yang benar dan adil sehingga kamu tidak bisa semenamena berbuat zalim terhadap diriku karena Allah menolongku. Ayat ini menganjurkan untuk berserah diri kepada Allah terhadap segala urusan, setelah berusaha secara maksimal."
  }
]