[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya aku bertawakal kepada Allah, tuhanku dan tuhan kalian, pemilik segala sesuatu, yang mengendalikan urusan didalamnya, maka tidak akan ada sesuatupun yang menimpaku, kecuali dengan ketetapanNya. Dan Dia lah Dzat yang mahakuasa atas segala sesuatu. Tidak ada sesuatupun yang berjalan di muka bumi, kecuali Allah lah pemiliknya, dia berada di bawah kekuasaan dan kendaliNya. Sesungguhnya tuhanku di atas jalan yang lurus.” Maksudnya, mahaadil dalam ketetapan, syariat, dan perintahNya. Dia akan memberikan balasan kepada orang yang berbuat baik atas tindakan kebaikannya, dan orang yang berbuat buruk atas kelakuan buruknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Sesungguhnya aku hanya berserah diri dan bersandar kepada Allah dalam segala urusanku. Karena Dia adalah Tuhanku dan juga Tuhan kalian. Semua makhluk yang melata di muka bumi ini berada di bawah kendali dan kekuasaan-Nya. Dia berhak melakukan apapun terhadapnya. Sesungguhnya Tuhanku Maha Benar lagi Maha Adil. Maka Dia tidak akan membuatku berada di bawah kendali kalian. Karena aku berada di pihak yang benar dan kalian berada di pihak yang salah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Sungguh aku telah bertawakkal kepada Allah, Tuhanku dan Tuhan kalian. Tidak ada suatu makhluk yang berjalan di muka bumi atau di dalam tanah melainkan atas pengaturan Allah. Sungguh Tuhanku benar, dan keadilan adalah milik-Nya, Dia memberi keputusan di antara hamba-hamba-Nya dengan kebenaran. Allah memberi mereka petunjuk kepada hidayah, dan menjaga orang yang menempuh jalan-Nya yang lurus. Keputusan-Nya adil, hidayah-Nya jelas, dan ketetapan-Nya berlaku. Allah membalas orang yang baik dengan kebaikan, dan membalas orang yang buruk dengan keburukan. Imam al-Alusi berkata: Allah Maha Melihat segala urusan hamba-hamba-Nya, membalas mereka dengan pahala dan siksa, mencukupkan orang yang bersandar kepada-Nya. (Ruh al-Ma’any, al-Alusi, 12/83). Maka bagaimana merasa aman orang yang berpaling dari jalan Allah yang lurus, dan menggantungkan harapan kepada batu-batu yang tidak dapat memberi manfaat atau mudharat?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. إِنِّى تَوَكَّلْتُ عَلَى اللهِ رَبِّى وَرَبِّكُم ۚ (Sesungguhnya aku bertawakkal kepada Allah Tuhanku dan Tuhanmu) Karena Allah melindungiku dari tipu daya kalian, meski kalian sangat berusaha untuk memberiku mudharat. Dan barangsiapa yang bertawakkal kepada Allah maka cukuplah Dia menjadi pelindungnya. مَّا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذٌۢ بِنَاصِيَتِهَآ ۚ(Tidak ada suatu binatang melatapun melainkan Dialah yang memegang ubun-ubunnya) Yakni seluruh makhluk bernyawa, dan diantaranya adalah kalian yang berada di genggaman-Nya dan dibawah kuasa-Nya dengan penuh kehinaan dan kerendahan. Dan makna dari “memegang ubun-ubunnya”, bahwa Allah adalah pemiliknya yang berkuasa atas dirinya. Dan ubun-ubun adalah batas rambut yang ada di depan kepala. إِنَّ رَبِّى عَلَىٰ صِرٰطٍ مُّسْتَقِيمٍ(Sesungguhnya Tuhanku di atas jalan yang lurus) Yakni Dia berada dalam kebenaran dan keadilan, sehingga Dia tidak menjadikan kalian berkuasa atasku, sebab aku adalah orang beriman yang menyeru ke jalan-Nya, sedangkan kalian adalah orang-orang kafir dan berpaling dari seruan-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Apa hikmah di balik pengkhususan pengendalian ubun-ubun tanpa menyebutkan seluruh anggota badan pada perkataan Hud kepada kaumnya : { إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُمْ ۚ مَا مِنْ دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا } ? Ibnu Jarir menjawab : (karena bangsa Arab dulunya menggunakan satu istilah untuk orang yang selalu tunduk dan taat dengan \"Tidaklah ubun-ubun fulan ini kecuali berada di tangan fulan ini\" yakni : dia selalu taat untuk mengerjakan apapun yang diperintahkan kepadanya)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Sesungguhnya aku menyerahkan urusanku kepada Allah, Tuhanku dan kalian. Dialah yang menjagaku dari tipu daya kalian, sekalipun kalian berkorban dalam melakukan kerusakan. Tidak ada hewan yang melata di atas bumi kecuali Allah merajai, berkuasa dan menundukkannya sesuai kehendakNya, sehingga tidak ada manfaat dan kemahdharatan kecuali dengan ijinNya. Sesungguhnya aku berada di jalan kebenaran dan keadilan sehingga Allah tidak akan membuat kalian berkuasa atasku dan kalian tidak akan bisa menzalimi dan mensia-siakanku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya aku bertawakal} bergantung {kepada Allah Tuhanku dan Tuhan kalian. Tidak ada satu pun makhluk yang bergerak melainkan Dialah yang memegang ubun-ubunnya} berkuasa atas dia {Sesungguhnya Tuhanku di jalan yang lurus} yang benar dan adil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56 “sesungguhnya aku bertawakal kepada Allah” aku bersandar kepada Allah dalam segala urusanku “Rabbku dan Rabbmu” Dia pencipta semuanya, pengatur kami dan kamu. Dialah yang mendidik kami. \"Tidak ada suatu binatang melatapun melainkan Dialah yang memegang ubun ubunnya”, Dia tidak diam dan tidak bergerak kecuali dengan izinNya, jika kamu semua bersepakat mencelakaiku sementara Allah tidak menguasakanmu, maka itu karena suatu hikmah yang diinginkanNya “sesungguhnya Rabbku diatas jalan yang lurus” yakni diatas keadilan, hikmah dan pujian dalam ketetapan, takdir, syariat, perintah, balasan, pahala dan azabNya. perbuatan perbuatanNya tidak keluar dari jalan yang lurus yang terpuji karenanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ءَاخِذُۢ بِنَاصِيَتِهَآۚ) : yang memilikinya, menguasainya, dan mengaturnya. Sehingga tidak akan memberikan manfaat atau keburukan kecuali atas izinnya. (إِنَّ رَبِّي عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ) : Di atas jalan kebenaran. Makna ayat : Kemudian beliau membeberkan sumber kekuatannya, yaitu karena bertawakal kepada Allah, (إِنِّي تَوَكَّلۡتُ عَلَى ٱللَّهِ رَبِّي وَرَبِّكُمۚ) aku menyerahkan segala urusan dan kepercayaanku kepada-Nya, Dia tidak akan menyerahkan aku kepada kalian, tidak pula meninggalkan ku. Lalu menjelaskan bahwa kekuasaan Allah meliputi mereka semua (مَّا مِن دَآبَّةٍ إِلَّا هُوَ ءَاخِذُۢ بِنَاصِيَتِهَآۚ) “Tidak ada suatu binatang melata pun melainkan Dia-lah yang memegang ubun-ubunnya” yang menguasai, yang mengatur sesuai kehendaknya, menurunkan azab bagi yang Dia kehendaki, lalu menerangkan bahwa Rabb mereka berada dijalan yang keadilan dan kebenaran, tidak mungkin musuh-musuh-Nya dapat mengalahkan wali-wali-Nya. (إِنَّ رَبِّي عَلَىٰ صِرَٰطٖ مُّسۡتَقِيمٖ) “Sesungguhnya Tuhanku di atas jalan yang lurus.\" oleh karena itu aku tidak perlu takut pula sedih. Pelajaran dari ayat : • Keadaan kaum mukminin adalah sama. Apa yang dikatakan oleh Nabi Nuh untuk menantang kaumnya, diucapkan pula oleh Nabi Hud. • Kaidah bahwa segala sesuatu di alam semesta tunduk kepada kuasa Allah, tidak ada yang luput dari kehendaknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 56: Tidak ada satu pun makhluk bernyawa yang bergerak atau diam kecuali dengan izin-Nya, oleh karena itu jika mereka semua berkumpul untuk menimpakan bahaya kepadanya, sedangkan Allah tidak mengizinkan, maka mereka tidak akan sanggup menimpakan kepadanya. Disebutkan ubun-ubun, karena yang memegang ubun-ubun berarti yang berkuasa penuh terhadapnya dan makhluk yang dipegang menunjukkan lemah dan hina di hadapannya. Maksudnya perbuatan Allah selalu di atas keadilan, kebenaran, hikmah (kebijaksanaan), qadha’ dan qadar-Nya terpuji, demikian juga dalam syari’at dan perintah-Nya dan dalam balasan-Nya. Semua perbuatan-Nya tidak keluar dari jalan yang lurus yang berhak dipuji dan disanjung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 56",
    "description": "Sesungguhnya aku bertawakal dengan menyerahkan semua urusanku hanya kepada Allah tuhanku dan tuhanmu, karena dialah yang mememeliharaku dan dapat menghindarkan diriku dari tipu dayamu. Tidak satu pun makhluk bergerak yang bernyawa di muka bumi melainkan dialah yang memegang ubun-ubunnya, yakni menguasai, mengatur, dan mengurus semua makhluk-Nya. Sungguh, tuhanku berada di jalan yang lurus, yakni jalan yang benar dan adil sehingga kamu tidak bisa semenamena berbuat zalim terhadap diriku karena Allah menolongku. Ayat ini menganjurkan untuk berserah diri kepada Allah terhadap segala urusan, setelah berusaha secara maksimal. Maka jika kamu berpaling dari ajakanku, dan tetap dalam kekafiran, maka sungguh, aku telah menyampaikan kepadamu apa yang menjadi tugasku sebagai rasul, yaitu menyampaikan risalah Allah disertai dengan buktibukti kebenaran risalah itu kepadamu. Dan aku telah menyampaikan juga bahwa tuhanku akan menimpakan azab kepadamu jika kamu tetap dalam kekafiran, kemudian mengganti kamu dengan kaum yang lain yang beriman kepada Allah, sedang kamu tidak dapat mendatangkan mudarat kepada-Nya sedikit pun disebabkan oleh perbuatan durhaka yang kamu lakukan. Sesungguhnya tuhanku maha pemelihara segala sesuatu, serta mengetahui apa yang kamu lakukan. Karena itu, dia akan memeliharaku dari gangguan dan tipu daya kamu. Ayat ini menunjukkan bahwa binasanya suatu kaum disebabkan mereka mengingkari risalah para rasul-Nya."
  }
]