[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "“jika kalian tetap berpaling dari apa yang aku seru kalian kepadanya, yaitu pengesaan Allah dan mengkhihlaskan ibadah bagiNya, maka sungguh aku telah menyampaikan risalah tuhanku kepada kalian dan telah tegak hujjah di hadapan kalian. Dan karena kalian tidak beriman kepada Allah, Dia akan membinasakan kalian, dan akan mendatangkan satu kaum lain yang akan mengggantikan kalian menguasai negeri-negeri kalian dan harta benda kalian, dan mereka akan mengkhihlasakn ibadah bagiNya dan kalian tidak dapat melancarakan mudarat kepadaNya sama sekali. Sesungguhnya tuhanku maha memelihara segala sesuatu. Dia lah yang akan menjagaku dari kalian yang hendak melancarkan gangguan buruk kepadaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Jika kalian berpaling dan bersikeras menolak agama yang kubawa maka tugasku tidak lebih dari sekedar menyampaikannya saja kepada kalian. Dan aku telah menyampaikan kepada kalian semua ajaran yang harus kusampaikan, dan kalian sudah tidak punya alasan untuk mengelak. Kelak kalian pasti akan dibinasakan oleh Tuhanku. Dan Dia akan mendatangkan kaum lain yang akan menggantikan kalian. Sedangkan pendustaan dan pembangkangan kalian itu tidak menyebabkan kerugian apapun bagi Allah, karena Dia sama sekali tidak membutuhkan hamba-hamba-Nya. Sesungguhnya Tuhanku Maha Mengawasi segala sesuatu. Maka Dia lah yang akan menjagaku dari setiap kejahatan yang kalian upayakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Jika kalian berpaling, aku telah menunaikan kewajibanku untuk menyampaikan dakwah Tuhanku yang telah memperlakukanku dengan baik dan mengatur urusanku, dia akan mengganti kalian dengan kaum yang lain, dan kekafiran kalian tidak mendatangkan mudharat sedikitpun bagi-Nya. Sungguh tuhanku Maha Melihat, Berkuasa, dan Menjaga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. فَإِن تَوَلَّوْا۟ (Jika kamu berpaling) Yakni terus-menerus menolak untuk menerima seruan ini dan teguh dalam kekafiran. فَقَدْ أَبْلَغْتُكُم مَّآ أُرْسِلْتُ بِهِۦٓ إِلَيْكُمْ (maka sesungguhnya aku telah menyampaikan kepadamu apa (amanat) yang aku diutus (untuk menyampaikan)nya kepadamu) Aku tidak memiliki kewajiban kecuali hal itu, dan aku telah memberi kalian hujjah. وَيَسْتَخْلِفُ رَبِّى قَوْمًا غَيْرَكُمْ (Dan Tuhanku akan mengganti (kamu) dengan kaum yang lain (dari) kamu) Yakni Allah akan membinasakan kalian karena sikap kalian terhadap rasul dari Tuhan kalian dan keberpalingan kalian dari seruan-Nya, kemudian Allah akan mendatangkan kaum yang lain untuk mengganti kalian di muka bumi. وَلَا تَضُرُّونَهُۥ شَيْـًٔا ۚ (dan kamu tidak dapat membuat mudharat kepada-Nya sedikitpun) Baik itu mudharat yang besar maupun yang kecil. إِنَّ رَبِّى عَلَىٰ كُلِّ شَىْءٍ حَفِيظٌ (Sesungguhnya Tuhanku adalah Maha Pemelihara segala sesuatu) Maha Mengawasi dan Menjaga. Sehingga Allah menjagaku dari usaha kalian untuk memberiku kemudharatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Dan jika kalian berpaling dari dakwahku dan berpegang teguh atas kekufuran, maka sesungguhnya aku menyampaikan risalah Tuhanku dan hujjah kepada kalian serta menegaskan azab bagi kalian yang membinasakan kalian. lalu Dia (Allah) akan mendatangkan kaum lain di rumah kalian dan mereka lebih taat daripada kalian yang mana mereka mengesakan dan menyembah Allah. Dan kalian tidak bisa memberikan mudharat sedikitpun kepadaNya dengan penolakan kalian. Sesungguhnya Tuhanku Mengawasi dan maha Mengetahui setiap sesuatu yang kalian kerjakan. Dialah yang menjagaku dari setiap sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka jika kalian berpaling} berpaling dari apa yang aku serukan kepada kalian {sungguh aku telah menyampaikan kepada kalian apa aku diutus kepada kalian. Tuhanku akan mengganti kalian dengan kaum lain} Allah membinasakan dan mengganti kalian dengan kaum lain sebagai pengganti kalian di rumah-rumah dan harta-harta kalian {kalian tidak dapat mendatangkan mudarat kepadaNya sedikit pun. Sesungguhnya Tuhanku Maha Pemelihara segala sesuatu.”} Maha Mengawasi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57 “jika kamu berpaling” dari apa yang kamu dakwahkan kepadamu, ”maka sesungguhnya aku telah menyampaikan kepadamu (apa) amanat yang aku diutus untuk menyampaikan nya kepadamu” tidak ada lagi tanggung jawab atasku dalam urusanmu “dan Rabbku akan mengganti kamu dengan kaum yang lain dari kamu” yang menjalankan ibadah kepadaNya dan tidak menyekutuanNya dengan sesuatu. ”dan kamu tidak dapat memudaratNya sedikitpun” karena mudaratmu akan kembali kepada dirimu. Kemaksiatan yang dilakukan oleh seseorang tidak merugikan Allah dan ketaatan yang dilakukan oleh seorang tidak berguna bagi Allah. \"siapa berbuat baik, maka pahalanya untuk dirinya sendiri, dan siapa yang berbuat jahat maka dosanya menjadi tanggungan dirinya sendiri\". “sesungguhnya Rabbku adalah Maha pemelihara segala sesuatu”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَإِن تَوَلَّوۡاْ) : Asal katanya (تتولوا) Fi’il mudhori’ (kata kerja yang menunjukkan akan atau sedang) yang dihapus huruf ta’ kedua yang artinya berpaling. (حَفِيظٞ) : Pengawas, dan pasti akan membalas semua perbuatan hamba-Nya. Makna ayat : (فَإِن تَوَلَّوۡاْ) seandainya kalian berpaling dari kebenaran, itu tidak memberikan efek kepadaku. Aku hanya menyampaikan perintah Rabb ku kepada kalian, Dia akan menghancurkan kalian, dan (وَيَسۡتَخۡلِفُ رَبِّي قَوۡمًا غَيۡرَكُمۡ) menggantikan kalian dengan kaum yang lain, hal itu sama sekali tidak memberikan keburukan kepada-Nya sedikit pun (إِنَّ رَبِّي عَلَىٰ كُلِّ شَيۡءٍ حَفِيظٞ) Maha Mengawasi, dan akan membalas setiap insan atas apa yang ia lakukan dengan rahmat dan keadilannya. Bagi-Nya lah segala pujian dan karunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 57: Yakni dari seruanku. Yang beribadah hanya kepada-Nya dan tidak menyekutukan-Nya dengan sesuatu. Usaha memudharatkan dari kamu seperti dengan berbuat syirk hanyalah akan kembali kepadamu. Alah Subhaanahu wa Ta'aala tidaklah terkena mudharat karena maksiat orang-orang yang bermaksiat sebagaimana ketaatan orang yang taat tidaklah bermanfaat bagi-Nya, karena barang siapa beramal saleh, maka keuntungannya untuk dirinya sendiri, dan barang siapa mengerjakan keburukan, maka kecelakaannya untuk dirinya sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 57",
    "description": "Maka jika kamu berpaling dari ajakanku, dan tetap dalam kekafiran, maka sungguh, aku telah menyampaikan kepadamu apa yang menjadi tugasku sebagai rasul, yaitu menyampaikan risalah Allah disertai dengan buktibukti kebenaran risalah itu kepadamu. Dan aku telah menyampaikan juga bahwa tuhanku akan menimpakan azab kepadamu jika kamu tetap dalam kekafiran, kemudian mengganti kamu dengan kaum yang lain yang beriman kepada Allah, sedang kamu tidak dapat mendatangkan mudarat kepada-Nya sedikit pun disebabkan oleh perbuatan durhaka yang kamu lakukan. Sesungguhnya tuhanku maha pemelihara segala sesuatu, serta mengetahui apa yang kamu lakukan. Karena itu, dia akan memeliharaku dari gangguan dan tipu daya kamu. Ayat ini menunjukkan bahwa binasanya suatu kaum disebabkan mereka mengingkari risalah para rasul-Nya. Usai mengisahkan ajakan nabi hud kepada kaumnya untuk beriman dan azab yang akan diturunkan kepada mereka jika mereka tetap dalam kekafiran, maka Allah pada ayat berikut menjelaskan kebenaran informasi yang disampaikan oleh nabi hud. Dan ketika azab kami untuk membinasakan kaum 'ad datang, yaitu berupa angin yang sangat kencang, maka kami selamatkan nabi hud dan orang-orang yang beriman bersama dia dengan rahmat kami yang selalu mengiringi mereka. Dan kami selamatkan pula mereka di akhirat nanti dari azab yang berat lagi pedih sebagaimana yang Allah timpakan kepada orang-orang kafir."
  }
]