[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika datang ketetapan Kami untuk mengazab kaum hud, kami selamatkan hud dan kaum muminin darinya karena karunia dan rahmat Kami kepada mereka. Dan kami selamatkan mereka dari siksaan pedih yang kami timpakan pada kaum Ad, sehingga pada keesokan hari tidak ada yang terlihat dari mereka kecuali tempat tinggal mereka saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan tatkala perintah Kami untuk membinasakan mereka telah datang, maka Kami selamatkan Hūd dan orang-orang yang beriman bersamanya dengan rahmat Kami yang mereka terima. Dan Kami selamatkan mereka dari azab pedih yang Kami timpakan kepada kaum Hūd yang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Dan ketika ketetapan Kami telah turun kepada mereka, Kami menyelamatkan Hud dan para pengikutnya. Kami menyelamatkan mereka dari angin kencang yang menerpa orang-orang kafir dan menghancurkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَلَمَّا جَآءَ أَمْرُنَا (Dan tatkala datang azab Kami) Yakni ketika datang azab Kami yang membinasakan kaum ‘Ad. بِرَحْمَةٍ مِّنَّا (dengan rahmat dari Kami) Dengan rahmat yang agung dari Allah, karena tidak akan ada yang selamat kecuali dengan rahmat Allah. مِّنْ عَذَابٍ غَلِيظٍ (dari azab yang berat) Yakni azab yang keras. Terdapat pendapat mengatakan azab ini berupa angin yang sangat panas yang menghancurkan tempat tinggal mereka dan membinasakan mereka sehingga tidak ada seorangpun yang tersisa dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Dan ketika datang perintah Kami, yaitu azab Kami untuk membinasakan kaum ‘Aad, Kami menyelamatkan Hud dan orang yang beriman bersamanya dengan rahmat Kami. Kami menyelamatkan mereka semua dari azab yang sangat dahsyat dan tidak dapat terhentikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika datang keputusan Kami} azab Kami {Kami menyelamatkan Hud dan orang-orang yang beriman bersamanya dengan rahmat Kami. Kami menyelamatkan mereka dari azab yang dahsyat} dahsyat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58 “dan tatkala datang azab kami” dengan dikirimnya angin yang kencang \"yang tidak berhembus kepada sesuatu melainkan ia menjadikannya seperti debu\", ”kami selamatkan Hud dan orang orang yang beriman bersamanya dengan rahmat dari kami, dan kami selamatkan (pula) mereka diakhirat dari azab yang berat” yang keras lagi berat yang diturunkan oleh Allah kepada 'Ad, sehingga mereka pada waktu pagi tidak terlihat kecuali tempat tinggal mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ولما جاء أمرنا) Walamma jaa’a amruna : Ketika datang kKetentuan Kami dengan mengazab mereka dengan angin yang sangat kencang. (بِرَحۡمَةٖ مِّنَّا) : dengan karunia dan nikmat Kami. Makna ayat : Pembahasan masih berlanjut pada kisah Hud dan kaumnya Allah ta’ala berfirman (وَلَمَّا جَآءَ أَمۡرُنَا) Dan tatkala datang azab Kami (نَجَّيۡنَا هُودٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا) Kami selamatkan Hud dan orang-orang beriman bersamanya dengan kasih sayang kami, karunia, dan nikmat. (وَنَجَّيۡنَٰهُم مِّنۡ عَذَابٍ غَلِيظٖ) Dan Kami selamatkan mereka dari azab kami yang berat, yaitu azab pada hari kiamat dengan dua keselamatan: di dunia selamat dari azab angin yang menghancurkan lagi kuat, yang menghancurkan segalanya menurut perintah dari Rabbnya, di akhirat selamat dari azab nereka—yang lebih mengerikan. Pelajaran dari ayat: • Penekanan tentang perkara tauhid, karena inti dari kisah ini adalah tauhid. • Ketentuan Allah atas orang-orang terdahulu, bahwa Dia mengutus para Rasul untuk memberi peringatan dan kabar gembira, sekiranya mereka memenuhi seruan itu, mereka akan bahagia, dan jika tidak, Dia akan menangguhkan mereka sampai tegak dengan sempurna hujjah atas mereka, lalu membinasakan mereka, dan menyelamatkan orang-orang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 58: Dengan mengirimkan kepada mereka angin yang membinasakan, di mana angin itu tidak membiarkan sesuatu apa pun yang dilandanya, melainkan menjadikannya seperti serbuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 58",
    "description": "Usai mengisahkan ajakan nabi hud kepada kaumnya untuk beriman dan azab yang akan diturunkan kepada mereka jika mereka tetap dalam kekafiran, maka Allah pada ayat berikut menjelaskan kebenaran informasi yang disampaikan oleh nabi hud. Dan ketika azab kami untuk membinasakan kaum 'ad datang, yaitu berupa angin yang sangat kencang, maka kami selamatkan nabi hud dan orang-orang yang beriman bersama dia dengan rahmat kami yang selalu mengiringi mereka. Dan kami selamatkan pula mereka di akhirat nanti dari azab yang berat lagi pedih sebagaimana yang Allah timpakan kepada orang-orang kafir. Dan demikian itulah akhir kisah kaum 'ad yang dibinasakan Allah disebabkan mereka mengingkari tanda-tanda keesaan dan kekuasaan tuhan. Mereka juga mendurhakai rasul-rasul-Nya yang diutus membawa bukti-bukti kebenaran risalah yang dibawanya, dan mereka pun menuruti perintah semua penguasa yang bertindak sewenang-wenang terhadap orang yang beriman kepada Allah dan rasul-Nya, lagi durhaka terhadap kebenaran ajaran yang dibawa oleh utusan Allah."
  }
]