[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan itulah kaum Ad, mereka telah kafir kepada Ayat-ayat Allah dan mendurhakai rasul-rasulNya, dan mereka lebih menaati perintah setiap penguasa yang sombong kepada Allah yang tidak mau menerima kebenaran dan tidak tunduk kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Itulah kaum 'Ād yang ingkar kepada ayat-ayat Allah, Tuhan mereka, serta durhaka kepada Rasul mereka, Hūd, dan patuh kepada perintah setiap orang yang sombong terhadap kebenaran, enggan menerimanya dan tidak mau tunduk kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Itulah kaum ‘Ad yang ingkar dan angkuh, mereka mengingkari kenikmatan-kenikmatan Allah dan ayat-ayat-Nya yang jelas yang ada dalam diri dan penjuru bumi yang menunjukkan keesaan-Nya. Dan mereka mendustakan Nabi Hud, padahal dia telah membawa kepada mereka hujjah-hujjah dan dalil-dalil yang jelas. Mereka menyelisihi rasul-rasul-Nya dengan berpaling dari Nabi Hud dan mentaati perintah orang-orang kafir yang memaksa mereka untuk kafir dan ingkar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. جَحَدُوا۟ بِـَٔايٰتِ رَبِّهِمْ (yang mengingkari tanda-tanda kekuasaan Tuhan mereka) Yakni mereka mengkafiri, mendustai, dan mengingkari mukjizat-mukjizat. وَعَصَوْا۟ رُسُلَهُۥ (dan mendurhakai rasul-rasul Allah) Yakni mendurhakai Nabi Huud saja, karena pada masa nabi Huud tidak ada rasul selain dia; akan tetapi ayat ini mengisyaratkan bahwa orang yang mendustakan seorang rasul maka ia telah mendustakan semua rasul. وَاتَّبَعُوٓا۟ أَمْرَ كُلِّ جَبَّارٍ عَنِيدٍ (dan mereka menuruti perintah semua penguasa yang sewenang-wenang lagi menentang) Makna (الجبر) yakni sombong, dan makna (العنيد) yakni orang zalim yang tidak mau menerima kebenaran. Yakni mereka adalah orang-orang yang mengetahui buruknya kesudahan mereka dikarenakan mereka berpaling dari ketaatan kepada Allah dan rasul-Nya serta mukjizat-mukjizat dan bukti-bukti yang ia datangkan, dan karena mereka mengikuti pemimpin mereka untuk berbuat keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Itulah kaum ‘Aad yang Kami binasakan. Lihatlah jejak-jejak mereka di bumi. Sesungguhnya mereka ingkar kepada ayat-ayat Allah yang menunjukkan pada keesaanNya dan mukjizat-mukjizatNya, dan menentang rasulNya, Hud (diungkapkan dengan Ar-Rusul (jamak) bukan mufrad karena mendustakan satu rasul sama dengan mendustakan seluruh rasul) Kaum itu menaati perintah setiap orang angkuh yang sewenang-wenang, tidak mau menerima dan mematuhi kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Itulah kaum ‘Ad. Mereka mengingkari} mengingkari {ayat-ayat Tuhan mereka, mendurhakai rasul-rasulNya, dan mengikuti perintah semua penguasa yang sewenang-wenang} meremehkan kebenaran {lagi keras kepala} sewenang-wenang tidak mau menerima kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59 “dan itulah kisah kaum Ad” yang mana Allah menimpakan azab kepada mereka karena kezhaliman mereka karena mereka “mengingkari tanda tanda kekuasaan Rabb mereka” oleh karena itu mereka berkata kepada Hud “kamu tidak datang kepada kami dengan membawa bukti” jelaslah dengan ini bahwa sebenarnya mereka itu meyakini dakwahnya, hanya saja mereka menentang dan mengingkarinya, ”dan mendurhakai rasul rasul Allah” karena barangsiapa yang mendurhakai rasul maka dia mendurhakai semua rasul, hal itu karena dakwah mereka adalah sama. ”dan mereka menuruti perintah semua penguasa yang sewengang wenang” yang menguasai hamba Allah dengan kezhaliman “yang menentang (kebenaran)” yakni ayat ayat Allah mereka mendurhakai semua orang yang memberi penipu yang hendak mencelakakan mereka, maka tidak heran kalau Allah membinasakan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (جَبَّارٍ عَنِيدٖ) : sombong akan kebenaran, tidak patuh, dan enggan menerima. Makna ayat : Firman-Nya (وَتِلۡكَ عَادٞۖ) Inilah ‘Ad kaum Hud, (جَحَدُواْ بِ‍َٔايَٰتِ رَبِّهِمۡ) mereka menentang ayat-ayat Rabb mereka, tidak beriman dan (وَعَصَوۡاْ رُسُلَهُۥ) bermaksiat kepada rasul-rasul mereka, Hud. )Menggunakan bentuk plural( karena barangsiapa mendustakan seorang rasul, seperti mendustakan seluruh rasul. (وَٱتَّبَعُوٓاْ أَمۡرَ كُلِّ جَبَّارٍ عَنِيدٖ) Mengikuti perintah para penyeru kesesatan, orang-orang angkuh lagi keras kepala terhadap kebenaran, sehingga mengantarkan mereka menuju kemurkaan Allah dan azab-Nya yang pedih. Pelajaran dari ayat : • Celaan untuk sifat sombong dan keras kepala, yang mana keduanya sifat buruk yang ada pada manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 59: Sebagai isyarat kepada bekas peninggalan mereka, yakni berjalanlah di muka bumi dan perhatikanlah kesudahan mereka. Kemudian Allah menyifatkan keadaan mereka pada lanjutan ayatnya. Disebutkan kata “rasul” dalam bentuk jamak adalah, karena mendustakan seorang rasul sama saja mendustakan semua rasul karena pokok ajaran yang mereka bawa itu sama. Tidak mengikuti orang yang tulus memberi nasehat kepada mereka lagi sayang, yaitu nabi mereka, bahkan mereka mengikuti penipu mereka yang hendak membinasakan mereka, sehingga Allah membinasakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 59",
    "description": "Dan demikian itulah akhir kisah kaum 'ad yang dibinasakan Allah disebabkan mereka mengingkari tanda-tanda keesaan dan kekuasaan tuhan. Mereka juga mendurhakai rasul-rasul-Nya yang diutus membawa bukti-bukti kebenaran risalah yang dibawanya, dan mereka pun menuruti perintah semua penguasa yang bertindak sewenang-wenang terhadap orang yang beriman kepada Allah dan rasul-Nya, lagi durhaka terhadap kebenaran ajaran yang dibawa oleh utusan Allah. Dan mereka yang dibinasakan itu pun selalu diikuti dengan laknat, yakni dijauhkannya dari rahmat Allah selama di dunia ini dan begitu pula mereka mendapat laknat di hari kiamat nanti berupa siksa neraka yang sangat pedih. Ingatlah, bahwa kaum 'ad itu ingkar kepada tuhan mereka dan mengingkari nikmat Allah yang telah dikaruniakan kepada mereka. Sungguh, binasalah kaum 'ad, umat nabi hud itu, dan mereka dijauhkan dari rahmat-Nya. Allah tidak membinasakan suatu kaum, kecuali apabila mereka berbuat kerusakan dan mengingkari nikmat Allah yang telah diberikan kepada mereka."
  }
]