[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah telah menjamin rizki semua makhluk yang berjalan di atas permukaan bumi, sebagai bentuk karunia dariNya, dan Dia mengetahui tempat tinggalnya saat hidup dan setelah matinya, dan mengetahui tempat dimana ia akan mati. Semua itu sudah tertulis di satu kitab di sisi Allah yang sudah menerangkan semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Tidak ada makhluk yang hidup di bumi ini melainkan rezekinya dijamin oleh Allah sebagai wujud kemurahan-Nya kepada makhluk. Dia mengetahui tempat tinggalnya di bumi dan mengetahui tempat di mana ia akan mati. Setiap makhluk hidup bersama rezekinya, tempat tinggalnya dan tempat matinya semuanya tercatat di dalam kitab yang jelas, yaitu Lauḥ Maḥfuẓ."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan bagian dari keluasan ilmu, kesempurnaan kuasa, dan pehatian-Nya kepada hamba-hamba-Nya; Allah menjamin setiap makhluk yang ada di muka bumi, Dia memberinya rezeki, mengetahui dimana ia tinggal selama hidupnya, baik itu di sarang, liang, atau gua-gua; dan Allah mengetahui tempat ia nanti setelah mati. Semua ini tertulis dalam lauhul mahfudz yang mencatat segala hal kecil dan besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَمَا مِن دَآبَّةٍ فِى الْأَرْضِ إِلَّا عَلَى اللهِ رِزْقُهَا (Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya) Berupa makanan yang layak bagi hewan dengan berbagai macam jenisnya sebagai bentuk karunia dan kemurahan Allah. Ketika Allah tidak lalai dari binatang, dengan memberinya rezeki, maka bagaimana Allah akan melalaikan urusan manusia dan segala ucapan dan perbuatannya. وَيَعْلَمُ مُسْتَقَرَّهَا(dan Dia mengetahui tempat berdiam binatang itu) Yakni tempat tinggalnya dalam tanah sebagai tempat persembunyiannya. وَمُسْتَوْدَعَهَا ۚ( dan tempat penyimpanannya) Yakni tempat dimana ia akan mati. كُلٌّ فِى كِتٰبٍ مُّبِينٍ (Semuanya tertulis dalam Kitab yang nyata (Lauh mahfuzh)) Yakni segala yang yang telah disebutkan itu seperti, hewan-hewan, tempat persembunyiannya, tempat ia akan mati, dan rezekinya telah tertulis dalam kitab yang jelas, yaitu dalam Lauh mahfuzh."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Setiap makhluq sudah ditentukan rezekinya, dan mereka harus mendapatkannya : { وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا } \"Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya\" ; bahkan apa yang ia makan dari sesuatu yang haram pun masuk dalam kategori rezeki ini! sebagaimana orang-orang kafir mendapatkan rezeki mereka dan terkadang apa yang mereka dapat karena perantara yang haram namun mereka diberikan rezeki yang baik, adapun orang-orang bertaqwa Allah beri mereka rezeki dari arah yang mereka tidak sangka, namun jatah yang mereka terima bukan dari arah yang haram dan tidak pula dari sumber yang kotor. 2 ). Jika ada rasa takut yang terlintas dalam benakmu akan kemiskinan, ketahuilah bahwasanya itu hanya bisikan yang tidak berharga, dan bantahlah rasa takut itu dengan rezeki yang telah dituliskan oleh al-qur'an : { وَمَا مِنْ دَابَّةٍ فِي الْأَرْضِ إِلَّا عَلَى اللَّهِ رِزْقُهَا } \"Dan tidak ada suatu binatang melata pun di bumi melainkan Allah-lah yang memberi rezekinya\" , dan jika syaithon menakut-nakutimu dengan kematian dan pembunuhan, lawanlah ia dengan ketentuan ajal yang dituliskan oleh al-qur'an : { وَلِكُلِّ أُمَّةٍ أَجَلٌ ۖ فَإِذَا جَاءَ أَجَلُهُمْ لَا يَسْتَأْخِرُونَ سَاعَةً ۖ وَلَا يَسْتَقْدِمُونَ } \"Tiap-tiap umat mempunyai batas waktu; maka apabila telah datang waktunya mereka tidak dapat mengundurkannya barang sesaatpun dan tidak dapat (pula) memajukannya\" [ Al-A'raf : 34 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Semua makhluk pun di atas bumi, baik yang melata maupun berjalan, baik manusia ataupun hewan, tidak ada satu pun melainkan Allah-lah Yang memberi rezeki. Allah memberikan rezeki dengan keutamaan, rahmat dan ihsan. Dia mengetahui tempat tinggal dan tempat penyimpanan para makhluknya, atau tempat hidup dan matinya. Semuanya telah tertulis dalam Kitab yang nyata (Lauh mahfuzh)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak satu pun hewan yang bergerak di bumi melainkan dijamin rezekinya oleh Allah. Dia mengetahui tempat tinggalnya} tempat tinggalnya di bumi {dan tempat penyimpanannya} tempat dimana dia dikubur ketika mati {Semua itu dalam kitab yang nyata} Lauhil Mahfuz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Maksudnya, semua yang merayap di muka bumi berupa manusia, binatang darat atau laut maka Allah telah menjamin rizki dan makanan mereka, rizki merka telah menjadi kewajiban Allah “dan dia mengetahui tempat berdiamnya binatang itu dan tempat penyimpanannya” maksudnya, Dia mengetahui tempat berdiam diri bintang binatang ini yaitu rumah tempat tinggalnya dan perlindungannya, dan mengetahui tempat penyimpannanya yaitu tempat dimana ia berpindah kepadanya pada waktu pulang perginya dan kondisi-kondisi tertentunya. ”semuanya” seluruh perincian tentang keadaanya “tertulis dalam kitab yang nyata” yakni lauh Mahfuzh yang meliputi seluruh peristiwa yang terjadi di langit dan bumi. Semuanya diliputi oleh ilmu Allah di catat oleh penaNya, berlaku padanya kehendakNya dan dicukupi olehNya rizkinya. Hendaknya manusia tetap tenang kepada jaminan Allah yang menjamin rizkinya dan yang ilmuNya meliputi Dzat dan sifat sifatNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 6: Baik manusia, hewan darat maupun hewan laut. Menurut sebagian ahli tafsir yang dimaksud dengan tempat kediamannya di sini adalah dunia dan tempat penyimpanan adalah akhirat. Menurut ahli tafsir yang lain maksud tempat kediamannya adalah tulang sulbi dan tempat penyimpanan adalah rahim. Ada pula yang menafsirkan “tempat kediaman” adalah tempat makhluk tersebut berdiam atau bermukim, sedangkan maksud “tempat penyimpanannya” adalah tempat pindahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 6",
    "description": "Dan tidak satu pun makhluk bergerak dan bernyawa, yang melata, merayap atau berjalan di muka bumi ini melainkan semuanya telah dijamin Allah rezekinya. Semua makhluk itu diberi naluri dan kemampuan untuk mencari rezeki sesuai dengan fitrah kejadiannya. Dia mengetahui tempat kediamanya ketika hidup di dunia dan mengetahui pula tempat penyimpanannya setelah mati. Semua itu sudah tertulis dan diatur serapirapinya dalam kitab yang nyata, yaitu lauh mahfudh, perihal perencanaan dan pelaksanaan dari seluruh ciptaan Allah secara menyeluruh dan sempurna. Dan di antara kekuasaan Allah lainnya adalah bahwa dialah yang menciptakan langit dan bumi serta apa yang ada pada keduanya dalam enam masa melalui proses penciptaan yang rapi dan teratur. Dan sebelum itu dia menciptakan 'arsy sebagai tempat bersemayam-Nya di atas air. Demikian itulah, agar dia menguji siapakah di antara kamu yang lebih baik amal ibadahnya, bekerja dengan jujur, ikhlas dan beraktivitas untuk kemaslahatan umat. Mereka yang berbuat kebajikan akan mendapat imbalan pahala, sedang mereka yang berbuat kejahatan akan mendapatkan siksa. Jika engkau wahai nabi Muhammad, berkata kepada penduduk mekah, sesungguhnya kamu akan dibangkitkan pada hari kiamat nanti setelah mati untuk mempertanggungjawabkan amal perbuatan kalian ketika di dunia, niscaya orang kafir itu akan berkata, apa yang kamu katakan ini hanyalah sihir yang nyata untuk menipu dan menakut-nakuti agar kami mudah percaya."
  }
]