[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka diikuti di dunia ini dengat lakanat dari Allah dan kemurkaan dariNya pada hari kiamat. Ingatlah, sesungguhnya kaum Ad mengingkari tuhan mereka dan mendustakan rasul-rasulNya. Dan ingatlah, kehancuran dan kebinasaan bagi bangsa Ad, kaum hud, disebabkan perbuatan syirik mereka dan kekafiran mereka terhadap nikmat tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Di dalam kehidupan dunia ini mereka ditimpa kehinaan dan terusir dari rahmat Allah. Dan di Hari Kiamat pun mereka juga dijauhkan dari rahmat Allah. Hal itu terjadi karena mereka ingkar kepada Allah. Ingatlah! Maka Allah menjauhkan mereka dari semua kebaikan dan mendekatkan mereka kepada semua keburukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Mereka mati diliputi laknat dan dijauhkan dari rahmat Allah, sehingga menjadi ibrah bagi orang lain dan perumpamaan bagi setiap orang zalim. Maka hendaklah setiap orang yang berakal memperhatikan dan mewaspadai keadaan seperti kaum ‘Ad, mereka telah kafir dan ingkar terhadap Tuhan mereka. Terlaknatlah mereka, bagaimana mereka menolak dakwah nabi mereka, Hud?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَأُتْبِعُوا۟ فِى هٰذِهِ الدُّنْيَا لَعْنَةً (Dan mereka selalu diikuti dengan kutukan di dunia ini) Mereka dilaknat oleh orang-orang yang melaknat, sehingga laknat itu melekat pada diri mereka yang tidak akan lepas dari mereka selama mereka masih hidup di dunia. وَيَوْمَ الْقِيٰمَةِ ۗ(dan (begitu pula) di hari kiamat) Dan mereka juga dilaknat di akhirat sebagaimana dilaknat di dunia. كَفَرُوا۟ رَبَّهُمْ (kafir kepada Tuhan mereka) Yakni kafir terhadap Tuhan mereka atau terhadap kenikmatan dari Tuhan mereka. أَلَا بُعْدًا لِّعَادٍ قَوْمِ هُودٍ (Ingatlah kebinasaanlah bagi kaum ‘Ad (yaitu) kaum Huud itu) Yakni mereka tetap jauh dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Allah membuat laknat itu (penolakan dari rahmatNya) melekat pada mereka ketika mereka meninggalkan dunia dan pada hari kiamat sampai mengantarkan mereka kepada azab. Ingatlah sesungguhnya kaum ‘Aad telah ingkar kepada Tuhan mereka dan kufur terhadap nikmatNya. Ingatlah kebinasaan dan terusirnya kaum ‘Aad dari rahmat Allah SWT"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka diikuti} diikuti {dengan laknat di dunia ini dan di hari kiamat. Ketahuilah, sesungguhnya kaum ‘Ad itu ingkar kepada Tuhan mereka. Ingatlah bahwa kebinasaan itu bagi kaum ‘Ad, yakni kaumnya Hud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60 “dan mereka selalu diikuti dengan kutukan didunia ini” di setiap waktu dan pada semua generasi. Sungguh cerita mereka yang buruk dan berita mereka yang jelek selalu disebut sebut dengan celaan dan cibiran. ”dan (begitu pula) di hari kiamat” mereka mendapatkan laknat pula. ”ingitlah sesungguhnya kaum 'ad itu kafir kepada Rabb mereka” yakni mengingkkari penciptanya, pemberi rizkinya dan pemberi nikmatnya. ”ingatlah kebinasaanlah bagi kaum 'ad (yaitu) kaum Hud itu” maksudnya semoga Allah menjauhkan mereka dari kebaikan dan mendekatkan kepada keburukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَيَوۡمَ ٱلۡقِيَٰمَةِۗ) : dan laknat hingga hari kiamat. (أَلَا بُعۡدٗا لِّعَادٖ قَوۡمِ هُودٖ) : celaka bagi kaum ‘Ad, dan terusir dari semua rahmat. Makna ayat : Firman-Nya (وَأُتۡبِعُواْ فِي هَٰذِهِ ٱلدُّنۡيَا لَعۡنَةٗ) Allah menyertai mereka dengan murka-Nya dan pada hari kiamat lebih berat lagi. Lalu menutup kisah dengan firman-Nya (أَلَآ إِنَّ عَادٗا كَفَرُواْ رَبَّهُمۡۗ) Ketahuilah bahwa ‘Ad telah kufur kepada Rabb mereka, tidak mengakui ketuhanan-Nya dan hak-Nya untuk diibadahi. (أَلَا بُعۡدٗا) Celakalah (لِّعَادٖ قَوۡمِ هُودٖ) bagi ‘Ad, kaumnya Hud. Maka tidak kah orang musyrik Quraisy mengambil pelajaran dari kisah ini? Sehingga mereka beriman dan mengesakan-Nya, sehingga mereka selamat dan beruntung. Pelajaran dari ayat : • Melakukan maksiat, kezaliman, kufur, kerusakan, hanya akan membawa pelakunya kepada kehancuran dan kerugian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 60: Dari manusia di setiap waktu dan generasi, nama mereka buruk dan dicela oleh manusia setelah mereka. Di hadapan sejumlah makhluk. Mereka kafir kepada Tuhan mereka yang menciptakan, yang memberi rezeki dan mengurus mereka, mereka membalas kebaikan-Nya dengan keburukan, maka dengan keadilan-Nya mereka layak dibinasakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 60",
    "description": "Dan mereka yang dibinasakan itu pun selalu diikuti dengan laknat, yakni dijauhkannya dari rahmat Allah selama di dunia ini dan begitu pula mereka mendapat laknat di hari kiamat nanti berupa siksa neraka yang sangat pedih. Ingatlah, bahwa kaum 'ad itu ingkar kepada tuhan mereka dan mengingkari nikmat Allah yang telah dikaruniakan kepada mereka. Sungguh, binasalah kaum 'ad, umat nabi hud itu, dan mereka dijauhkan dari rahmat-Nya. Allah tidak membinasakan suatu kaum, kecuali apabila mereka berbuat kerusakan dan mengingkari nikmat Allah yang telah diberikan kepada mereka. Setelah dijelaskan kisah kaum nabi hud dan keingkaran mereka terhadap nabinya serta azab yang ditimpakan kepada mereka, maka ayat berikut ini, menjelaskan tentang kisah kaum samud. Dan kepada kaum samud yang mendiami wilayah hijr antara kota madinah dengan tabuk, kami utus saudara seketurunan mereka, yaitu nabi saleh, dia berkata, wahai kaumku! sembahlah Allah tuhan yang esa, karena tidak ada tuhan bagimu yang pantas dan layak disembah selain dia. Dialah Allah yang telah menciptakanmu dari bumi, yakni nabi adam yang diciptakan Allah dari tanah, dan menugaskanmu memakmurkannya, karena kamu memang layak untuk mengurus bumi dengan bercocok tanam, membangun rumah, mendirikan bangunan, gedung-gedung tinggi, dan lain sebagainya. Tapi ternyata di antara kamu ada yang melakukan pelanggaran dengan berbuat kerusakan, seperti eksploitasi hutan maupun hasil bumi secara besar-besaran tanpa menjaga kelestarian dan keseimbangan alam serta lingkungannya. Karena itu mohonlah ampunan kepada-Nya atas dosa-dosa yang kamu lakukan, kemudian bertobatlah kepada-Nya dengan meninggalkan perbuatan syirik dan dosa, lalu sembahlah Allah. Sesungguhnya tuhanku sangat dekat rahmatnya kepada orang-orang yang taat dan memperkenankan doa hambanya."
  }
]