[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami mengutus kepada kaum Tsamud saudara mereka, Shaleh. Kemudian dia berkata kepada mereka, ”wahai kaumku, sembahlah Allah semata, karena tidak ada tuhan yang berhak disembah bagi kalian kecuali Dia, maka murnikanlah ibadah bagiNya. Dia lah yang memulai penciptaan kalian dari tanah dengan menciptakan bapak moyang kalian, Adam darinya, dan menjadikan kalian orang-orang yang memakmurkannya, maka mohonlah kepadaNya agar berkenan mengampuni dosa-dosa kalian, dan kembalilah kepadaNya dengan taubat nasuha. Sesungguhnya tuhanku dekat kepada orang yang mengikhlaskan ibadah kepadaNya dan mau bertaubat kepadaNya, lagi mengabulkan (permintaannya), bila dia berdo’a kepadaNYa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dan kepada kaum Ṡamūd Kami mengutus saudara mereka, Ṣāleḥ. Dia berkata, \"Wahai kaumku! Sembahlah Allah saja! Kalian tidak punya sesembahan lain yang berhak disembah selain Allah. Dia lah yang telah menciptakan kalian dari tanah melalui penciptaan bapak kalian, Adam dari tanah liat yang diambil dari bumi. Dan Dia telah menjadikan kalian sebagai penghuni bumi. Maka mohonlah ampunan kepada-Nya, dan kembalilah kepada-Nya dengan menjalankan ketaatan dan meninggalkan kemaksiatan. Sesungguhnya Tuhanku dekat dengan orang yang memurnikan ibadahnya kepada-Nya. Dan Dia senantiasa mengabulkan doanya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Dan Kami telah mengutus kepada kaum Tsamud saudara mereka, Shalih. Dia memerintahkan mereka untuk menyembah Allah semata, karena hanya Dia yang berhak disembah. Dan bentuk kesempurnaan ketuhanan-Nya dan bukti keesaan-Nya, Dia menciptakan kalian dari tanah dan mengilhami kalian untuk memakmurkan bumi dengan bercocok tanam, dan menyiapkan kalian cara-cara mendapat penghidupan di bumi; kalian memahat gunung-gunungnya, mendirikan bangunan di tanahnya yang lapang, menikmati rezekinya, dan mengeluarkan harta bendanya; maka mohonlah ampun kepada-Nya atas kesalahan yang kalian perbuat, karena Dia memerintahkan kalian untuk memohon ampun dan berjanji akan menerimanya, dan tetaplah di atas jalan taubat dan istiqamah sebagaimana Dia memintahkan kalian. Sesungguhnya Tuhanku dekat dengan hamba-hamba-Nya yang beriman dan mengabulkan mereka yang berdoa kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَإِلَىٰ ثَمُودَ أَخَاهُمْ صٰلِحًا ۚ (Dan kepada Tsamud (Kami utus) saudara mereka Shaleh) Mereka tinggal di kota Hijr yang terletak diantara kota Madinah dan syam. هُوَ أَنشَأَكُم مِّنَ الْأَرْضِ (Dia telah menciptakan kamu dari bumi (tanah)) Yakni memulai penciptaan kalian dari tanah, karena seluruh bani Adam berasal dari keturunan nabi Adam yang diciptakan dari tanah. وَاسْتَعْمَرَكُمْ فِيهَا(dan menjadikan kamu pemakmurnya) Yakni menjadikan kalian pemakmurnya dengan mendirikan tempat tinggal dan menanam pepohonan. فَاسْتَغْفِرُوهُ (karena itu mohonlah ampunan-Nya) Yakni kembalilah kepada peribadatan-Nya dan menyesallah kalian atas kelalaian yang telah kalian lakukan. إِنَّ رَبِّى قَرِيبٌ مُّجِيبٌ (Sesungguhnya Tuhanku amat dekat (rahmat-Nya) lagi memperkenankan (doa hamba-Nya)) Yakni cepat dalam menjawab orang yang berdoa kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Dan Kami mengutus kepada kaum Tsamud yang tinggal daerah Hijr di antara Madinah dan Syam saudaranya se-kabilah dan se-nasab yaitu Shalih. Shalih berkata: “Wahai kaumku, menyembahlah hanya kepada Allah. Tiada Tuhan selain Dia. Dia memulai penciptaan dan pembentukan kalian dari tanah dengan menciptakan ayah kalian Adam, lalu memakmurkan kalian dengan memberi kemampuan untuk membuat rumah dan bercocok tanam, maka memohon ampunlah kepadaNya dari dosa-dosa kalian berupa kesyirikan, lalu kembalilah menyembahNya dan berhijrah dari perbuatan dosa (menuju kebaikan). Sesungguhnya Tuhanku Maha Dekat rahmatNya bagi makhlukNya yang taat dan Maha Mengabulkan doa.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kepada kaum Tsamud, saudara mereka, Shalih. Dia berkata,“Wahai kaumku, sembahlah Allah. Tidak ada tuhan bagi kalian selain Dia. Dia telah menciptakan kalian} memulai penciptaan kalian {dari tanah dan memakmurkan kalian di dalamnya} menjadikan kalian memakmurkannya dan tinggal di sana {Maka mohonlah ampunan kepadaNya, kemudian bertaubatlah kepadaNya. Sesungguhnya Tuhanku sangat dekat lagi Maha Mengabulkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61 “dan” kami utus ”kepada tsamud”, mereka adalah 'ad yang kedua yang terkenal yang tinggal di hijr dan wadil qura, “saudara mereka” dalam nasab “shaleh” hamba Allah dan rasulNya yang menyeru mereka kepada beribadah hanya kepada Allah Dia berkata “hai kaumku sembahlah Allah” tauhidkanlah Dia dan ikhlaskanlah agama untukNya “sekali kali tidak ada bagimu tuhan selain Dia” tidak dari penduduk langit atau bumi. ”dia telah menciptakan mu dari bumi (tanah)” yakni menciptakan kamu di dalamnya ”dan menjadikan kamu pemakmurnya” menjadikanmu sebagai khalifah di dalamnya dan memberimu nikmat lahir dan batin, dan menempatkanmu di bumi. kamu membangun menanam sesukamu, mengambil manfaatnya dan mengeruk keuntungannya. Karena Dia tidak memiliki sekutu dalam semua itu, maka janganlah kamu menyekutukanNYa dengan sesuatu. ”karena itu mohonlah ampunanNya” dari kekufuran, kesyirikan, kemaksiatan yang telah kamu lakukan. Tinggalkanlah semua itu ”kemudian bertaubatlah kepadaNya” yakni kembalilah kepadaNya dengan bertaubat yang nasuha. ”sesungguhnya Rabbku amat dekat (rahmatNya) lagi memperkenankan (doa hambaNya)” yakni dekat kepada orang yang berdoa kepadaNya dengan doa permintaan dan doa ibadah, menjawabNya dengan mengabulkan permintaannya, menerima ibadahnya dan memberinya pahala yang besar. Ketauhilah bahwa kedekatan Allah ada dua macam: umum dan khusus. Yang pertama adalah kedekatan umum, yaitu kedekatan dengan ilmuNya dari seluruh makhlukNYa kedekatan ini tersebut dalam firman Allah “dan kami lebih dekat kepadanya daripada urat lehernya”, yang kedua adalah kedekatan khusus yaitu, kedekatanNya kepada orang orang yang beribadah, memohon dan mencintaiNya. ia tersebut dalam firman Allah ”dan sujudlah dan dekatkanlah (dirimu kepada Rabb)\" dan dalam ayat ini serta ayat lain \"Dan apabila hamba-hamba-Ku bertanya kepadamu tentang Aku, maka (jawablah), bahwasanya Aku adalah dekat. Aku mengabulkan permohonan orang yang berdoa apabila ia memohon kepada-Ku\" Kedekatan ini adalah kedekatan yang menuntut kasih saying Allah (kepada hamba hambaNya) jawabanNya terhadap doa doa mereka, dan mewujudkan keinginan keinginan mereka. Oleh karena itu nama al qarib disandingkan dengan nama al mujib."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَإِلَىٰ ثَمُودَ) : Kami mengutus kepada kabilah Tsamud. (أَخَاهُمۡ صَٰلِحٗاۚ) : Saudara mereka satu nasab karena Shalih berasal dari kabilah Tsamud, jarak antara dirinya dan Tsamud—kakek moyang kabilah Tsamud— adalah 5 generasi. (وَٱسۡتَعۡمَرَكُمۡ) : menjadikan kalian penghuninya, dengan membuat tempat dan tinggal di atasnya. (قَرِيبٞ مُّجِيبٞ) : Dekat dengan makhlukNya, karena seluruh alam berada di bawah kekuasaan-Nya, Maha Mengabulkan permintaan siapa pun yang berdoa. Makna ayat : Sebuah awal dari kisah Nabi Shalih dengan kaumnya, ketika Allah menjelaskan pengutusan Shalih kepada kaumnya (وَإِلَىٰ ثَمُودَ أَخَاهُمۡ صَٰلِحٗاۚ) Kami utus kepada Tsamud—yang tinggal di Al-Hijr, daerah antara Hijaz dan Syam (أَخَاهُمۡ) saudara mereka se-kabilah bukan se-agama (صَٰلِحٗاۚ), Shalih. Kemudian berkata (يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ) seraya menyeru mereka, dengan panggilan ‘Wahai kaumku’ untuk menarik hati mereka, memperhatikan apa yang akan dikatakan. (يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ) Berimanlah kalian kepada-Nya, Esakanlah Dia dalam peribadatan kalian dan janganlah kalian menyekutukanNya. Karena kalian tidak punya sesembahan yang berhak disembah kecuali Dia. Dialah Rabb kalian, yang menciptakan, memberi rizki, dan yang mengatur segalanya. (أَنشَأَكُم مِّنَ ٱلۡأَرۡضِ) Menciptakan ayah kalian Adam dari tanah (وَٱسۡتَعۡمَرَكُمۡ فِيهَا) menempatkan kalian di bumi, hidup dan tinggal di sana, maka mohonlah ampun kepada-Nya, dan berimanlan dengan keesaan-Nya, serta bertaubatlah, beribadahlah kepada-Nya dan jangan menyekutukan-Nya dengan siapa pun. (إِنَّ رَبِّي قَرِيبٞ مُّجِيبٞ) Shalih mengabarkan kepada kaumnya tentang kedekatan Allah dengan hamba-hamba-Nya, bahwa Dia yang mengabulkan doa-doa orang yang berdoa kepada-Nya, semua itu sebagai motivasi agar mereka beriman dan taat, lalu meninggalkan syirik dan maksiat. Inilah penjelasan dari ayat 61. Pelajaran dari ayat : • Persamaan wasilah dan tujuan para Rasul, wasilah mereka: dakwah menyeru agar beribadah kepada Allah saja dan tujuan mereka: keridhaan Allah dan surga. • Istighfar lebih diprioritaskan daripada taubat, karena seseorang tidak akan meninggalkan kesalahannya sampai ia sadar kalau ia salah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 61: Mereka tinggal di Hijr; nama sebuah daerah pegunungan yang terletak di pinggir jalan antara Madinah dan Syam (Syiria). Sekabilah atau sesuku. Yakni dengan menciptakan bapak mereka Adam dari tanah. Maksudnya manusia dijadikan penghuni dunia untuk menguasai dan memakmurkan dunia serta mengolahnya, mereka bisa membangun bangunan di atasnya, menanam pepohonan di sana, menggarap tanahnya, memanfaatkan sumber daya alamnya, dsb. Dari perbuatan syirk dan dosa-dosa lainnya. Dengan kembali menaati-Nya. Dia Dekat dengan makhluk-Nya dengan ilmu-Nya. Perlu diketahui, bahwa kedekatan Allah terbagi dua; umum dan khusus. Umum maksudnya, bahwa Allah Ta’ala dekat dengan semua makhluk dengan ilmu-Nya, seperti yang disebutkan dalam firman Allah Ta’ala, “Dan Kami lebih dekat kepadanya daripada urat lehernya,” (terj. Qaaf: 16). Sedangkan kedekatan khusus adalah kedekatan-Nya dengan hamba-hamba-Nya, orang-orang yang meminta kepada-Nya dan mencintai-Nya, seperti yang diebutkan dalam firman-Nya, “Sujudlah dan dekatkanlah (dirimu kepada Tuhan).” (Terj. Al ‘Alaq: 19), untuk kedekatan khusus ini menghendaki seseorang mendapatkan kelembutan-Nya, pengabulan terhadap doa mereka serta diwujudkan-Nya keinginan mereka, oleh karena itu, nama-Nya “Al Qariib” (Mahadekat) sering digandengkan dengan nama-Nya “Al Mujiib” (yang mengabulkan permohonan hamba-Nya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 61",
    "description": "Setelah dijelaskan kisah kaum nabi hud dan keingkaran mereka terhadap nabinya serta azab yang ditimpakan kepada mereka, maka ayat berikut ini, menjelaskan tentang kisah kaum samud. Dan kepada kaum samud yang mendiami wilayah hijr antara kota madinah dengan tabuk, kami utus saudara seketurunan mereka, yaitu nabi saleh, dia berkata, wahai kaumku! sembahlah Allah tuhan yang esa, karena tidak ada tuhan bagimu yang pantas dan layak disembah selain dia. Dialah Allah yang telah menciptakanmu dari bumi, yakni nabi adam yang diciptakan Allah dari tanah, dan menugaskanmu memakmurkannya, karena kamu memang layak untuk mengurus bumi dengan bercocok tanam, membangun rumah, mendirikan bangunan, gedung-gedung tinggi, dan lain sebagainya. Tapi ternyata di antara kamu ada yang melakukan pelanggaran dengan berbuat kerusakan, seperti eksploitasi hutan maupun hasil bumi secara besar-besaran tanpa menjaga kelestarian dan keseimbangan alam serta lingkungannya. Karena itu mohonlah ampunan kepada-Nya atas dosa-dosa yang kamu lakukan, kemudian bertobatlah kepada-Nya dengan meninggalkan perbuatan syirik dan dosa, lalu sembahlah Allah. Sesungguhnya tuhanku sangat dekat rahmatnya kepada orang-orang yang taat dan memperkenankan doa hambanya. Mereka, yakni kaum samud berkata, wahai saleh! sungguh, engkau sebelum mengaku menjadi nabi ini sebagai panutan yang berada di tengah-tengah kami merupakan orang yang diharapkan menjadi pemimpin yang kami cintai dan kami taati. Namun mengapa engkau sekarang melarang kami menyembah apa yang disembah oleh nenek moyang kami, bahkan engkau menyuruh kami hanya menyembah kepada Allah' sungguh, kami benar-benar dalam keraguan yang menggelisahkan jika kami meninggalkan berhala yang selama ini telah kami sembah, lalu tiba-tiba kami taat terhadap apa yang engkau serukan kepada kami, yaitu menyembah Allah."
  }
]