[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum tsamud berkata kepada nabi mereka shaleh , ”sesungguhnya kami sebelumnya berharap kamu menjadi seorang pemimpin yang ditaati sebelum seruan yang kamu katakan itu kepada kami. Apakah kamu akan melarang kami dari menyembah tuhan-tuhan yang telah disembah oleh bapak-bapak kami dahulu? dan sesungguhnya kami benar-benar dalam keraguan yang membimbangkan terhadap dakwahmu kapada kami untuk beribadah hanya kepada Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Kaumnya berkata kepadanya, \"Wahai Ṣāleḥ! Dahulu engkau mempunyai kedudukan yang tinggi di antara kami, sebelum engkau menyampaikan dakwah ini. Dahulu kami berharap engkau menjadi orang yang pandai, bisa memberikan nasihat dan saran-saran. Apakah engkau melarang kami menyembah tuhan yang telah disembah oleh leluhur kami? Sungguh, kami benar-benar ragu terhadap seruanmu agar kami menyembah kepada Allah. Keraguan itu membuat kami curiga bahwa engkau telah berdusta atas nama Allah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Namun kaum Tsamud menjawabnya tanpa adab: “Hai Shalih, kamu sebelum menyeru dakwah ini merupakan orang yang diharapkan dapat mendapat kebaikan dan kesuksesan karena kami melihatmu memiliki kecerdasan dan akhlak yang mulia. Namun apa yang membuatmu melarang kami dari agama nenek moyang kami yang kami cintai ini? Sungguh kami ragu terhadap dakwahmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. قَدْ كُنتَ فِينَا مَرْجُوًّا قَبْلَ هٰذَآ ۖ (sesungguhnya kamu sebelum ini adalah seorang di antara kami yang kami harapkan) Yakni dahulu kami berharap kamu akan menjadi pemimpin bagi kami yang ditaati, kami dapat mengambil manfaat dari pendapat-pendapatmu, sebelum kamu menunjukkan pengakuanmu sebagai seorang nabi dan seruanmu kepada pengesaan Allah. Setelah nabi Shalih menyeru mereka kepada Allah, mereka berkata “terputuslah harapan kami darimu”. أَتَنْهَىٰنَآ أَن نَّعْبُدَ مَا يَعْبُدُ ءَابَآؤُنَا(apakah kamu melarang kami untuk menyembah apa yang disembah oleh bapak-bapak kami?) Pertanyaan ini sebagai bentuk pengingkaran. Mereka mengingkari nabi Shalih atas larangan ini. وَإِنَّنَا لَفِى شَكٍّ مِّمَّا تَدْعُونَآ إِلَيْهِ مُرِيبٍ(dan sesungguhnya kami betul-betul dalam keraguan yang menggelisahkan terhadap agama yang kamu serukan kepada kami) Yang berupa penyembahan kepada Allah semata dan meninggalkan penyembahan kepada berhala-berhala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Mereka berkata: “Wahai Shalih, sungguh kamu orang yang diharapkan menjadi pemimpin kami. Kami bisa mengambil manfaat pandanganmu sebelum pengakuan kenabianmu. Kamu melarang kami menyembah berhala yang disembah para leluhur. Kami bimbang untuk bertauhid dan berlepas diri dari berhala, yaitu kebimbangan yang cenderung pada keraguan, suudzan dan kegelisahan jiwa?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Shalih, kamu benar-benar merupakan orang yang diharapkan di tengah-tengah kami} Kami berharap kamu menjadi pemuka yang ditaati di tengah-tengah kami {sebelum ini} sebelum seruanmu ini {Apakah kamu melarang kami menyembah apa yang disembah oleh nenek moyang kami. Sesungguhnya kami benar-benar dalam keraguan yang penuh kebimbangan} kebimbangaan yang sangat membebani {terhadap apa yang kamu serukan kepada kami.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62 Tatkala nabi mereka shaleh memerintahkan dan mendorong mereka kepada keikhlasan hanya kepada Allah semata maka mereka menolak dakwahnya dan menyebutnya dengan sambutan yang buruk. ”kaum tsamud, berkata ’hai shaleh sesungguhnya kamu sebelum ini adalah seorang diantara kami yang kami harapkan” kami mengharapkan dan menunggu nunggu manfaat dan pendapat yang baik darimu. Ini adalah kesaksian dari mereka kepada Nabi mereka, Shaleh, bahwa dia masih terkenal dengan kemuliaan akhlak dan kebaikan sifat, bahwa dia termasuk orang terpilih dari kaumnya, akan tetapi ketika shaleh hadir dengan perkara yang tidak sesuai hawa nafsu mereka yang rusak, maka mereka mengucapkan kata kata ini yang isinya adalah bahwa kamu hai shaleh adalah orang yang sempurna sebelumnya, tetapi sekarang kamu menyelisihi dugaan kamu kepadamu, kamu sekarang dalam keadaan tidak lagi diharapkan kebaikannya. Dosa shaleh adalah apa yang mereka katakan tentangnya (ini merupakan perkataan mereka) yaitu “apakah kamu melarang kami untuk menyembah tuhan yang disembah oleh bapak bapak kami?” menurut mereka, ini adalah perkara terbesar yang mencoreng shaleh. Bagaimana dia mencela akal mereka dan akal nenek moyang mereka yang tersesat? bagaimana dia melarang mereka menyembah yang tidak bermanfaat dan tidak bermudarat serta tidak berguna sedikitpun dari batu, pohon dan lain lain dan dia memerintahkan mereka mengikhlaskan agama hanya kepada Allah Rabb mereka yang senantiasa melimpahkan nikmat nikmat kepada mereka terus menerus, kebaikanNya kepada mereka selalu turun, yang mana tiada nikmat pada mereka kecuali dariNya dan tiada yang menangkal keburukan kecuali Dia? “dan sesungguhnya kami betul betul dalam keraguan yang menggelisahkan terhadap agama yang kamu serukan kepada kami” yakni kami masih ragu terhadap dakwahmu dengan keraguan yang berpengaruh pada hati kami."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَرۡجُوّٗا قَبۡلَ هَٰذَآۖ) : sebelum engkau mengatakan hal ini, kami mengharapkanmu untuk menjadi pemimpin kami. Makna ayat : Adapun ayat 62, berisi tentang balasan mereka kepada Shalih, mereka berkata sebagaimana yang Allah kabarkan (يَٰصَٰلِحُ قَدۡ كُنتَ فِينَا مَرۡجُوّٗا قَبۡلَ هَٰذَآۖ) “Dahulu kami mengharapkan kebaikan kepada mu, dan berharap engkau menjadi pemimpin kami, sampai engkau mengejutkan kami dengan dakwahmu, agar kami meninggalkan berhala-berhala kami lalu beribadah kepada Tuhan mu.” Kemudian mereka mengingkari seruannya tersebut, (أَتَنۡهَىٰنَآ أَن نَّعۡبُدَ مَا يَعۡبُدُ ءَابَآؤُنَا) Apakah engkau melarang kami untuk menyembah apa yang disembah nenek moyang kami? Dan mereka mengkabarkan bahwa hati mereka tidak yakin dengan kebenaran dakwahnya—tauhid, mereka berkata, (وَإِنَّنَا لَفِي شَكّٖ مِّمَّا تَدۡعُونَآ إِلَيۡهِ مُرِيبٖ) Kami dalam keraguan—tidak tenangnya hati terhadap suatu perkara. Inilah inti dari ayat ini. Pelajaran dari ayat : • Sebuah adat, jika ada seseorang yang saleh, ia begitu diharapkan oleh kaumnya, ketika ia menyeru mereka kepada kebenaran, dan meninggalkan keburukan, mereka langsung membencinya. Dan terkadang mereka melemparkan perkataan seperti perkataan kaum Tsamud kepada Nabi Shalih, (قَدۡ كُنتَ فِينَا مَرۡجُوّٗا قَبۡلَ هَٰذَآ) “Sungguh dahulu engkau adalah orang yang kami harapkan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 62: Yakni diharapkan menjadi tokoh dan orang yang dimintai pendapatnya. Yang demikian adalah karena Nabi Saleh terkenal dengan akhlaknya yang mulia dan orang terbaik di antara kaumnya, maka Mahabijaksana Allah yang memberikan kenabian kepada orang yang tepat. Akan tetapi, ketika Nabi Saleh datang kepada mereka membawa sesuatu yang tidak sesuai dengan hawa nafsu mereka, mereka menolak dakwah Beliau dan menerangkan bahwa sebelumnya Beliau di hadapan mereka orang yang sempurna, namun sekarang mereka tidak berharap apa-apa dari Beliau, hanya karena Beliau melarang mereka menyembah selain Allah sesuatu yang sesungguhnya tidak mampu memberi manfaat dan tidak mampu menimpakan bahaya dan memerintahkan mereka hanya menyembah Allah Tuhan yang senantiasa melimpahkan kepada mereka nikmat-nikmat-Nya, di mana tidak ada satu pun nikmat kecuali berasal dari-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 62",
    "description": "Mereka, yakni kaum samud berkata, wahai saleh! sungguh, engkau sebelum mengaku menjadi nabi ini sebagai panutan yang berada di tengah-tengah kami merupakan orang yang diharapkan menjadi pemimpin yang kami cintai dan kami taati. Namun mengapa engkau sekarang melarang kami menyembah apa yang disembah oleh nenek moyang kami, bahkan engkau menyuruh kami hanya menyembah kepada Allah' sungguh, kami benar-benar dalam keraguan yang menggelisahkan jika kami meninggalkan berhala yang selama ini telah kami sembah, lalu tiba-tiba kami taat terhadap apa yang engkau serukan kepada kami, yaitu menyembah Allah. Mendengar jawaban dan sikap kaumnya, dia'nabi saleh'berkata, wahai kaumku! terangkanlah kepadaku bagaimana sikap kamu jika aku mempunyai bukti yang nyata dari tuhanku berupa mukjizat yang dianugerahkan Allah sebagai bukti kerasulanku dan diberi-Nya aku rahmat dari-Nya, berupa pengetahuan, hidayah atau potensi yang bukan lahir dari kemampuanku' maka siapa yang akan menolongku dari azab Allah jika aku mendurhakai-Nya, dengan mengikuti keinginan kamu, tetap mempertahankan tradisi sesat para leluhur' jika aku mengikuti keinginanmu, maka kamu hanya akan menambah kerugian kepadaku, karena kamu telah menyesatkanku, agar aku mengabaikan rahmat yang dianugerahkan Allah padaku, sehingga Allah murka terhadap diriku."
  }
]