[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Shaleh berkata kepada kaumnya, ”wahai kaumku, beritahukanlah kepadaku, bila kau memiliki bukti nyata dari Allah dan memberikan kepadaku dariNya kenabian dan hikmah, maka siapakah yang akan dapat menghalangi siksaan Allah dariku, jika aku mendurhakaiNya, dengan tidak menyampaikan risalah dan menasihati kalian? karenanya, kalian tidaklah menambahkan kepadaku selain penyesatan dan menjauhkan dari kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Ṣāleḥ menjawab ucapan kaumnya dengan mengatakan, \"Wahai kaumku! Katakan padaku, jika aku berada di atas hujah yang nyata dari Tuhanku, dan Dia memberiku rahmat dari-Nya, yaitu kenabian, siapakah yang dapat melindungiku dari hukuman-Nya jika aku durhaka kepada-Nya dengan tidak menyampaikan apa yang Dia perintahkan untuk kusampaikan kepada kalian? Kalian tidak memberiku tambahan apapun selain kesesatan dan kejauhan dari rida-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Maha Nabi Shalih menjelaskan kepada mereka: “Hai kaumku, bagaimana menurut kalian, jika aku berada dalam cahaya dari Tuhanku dan aku yakin berada dalam jalan yang benar; aku dapat memetik hasilnya dan merasakan manisnya, dan dapat menghirup kasih sayang dari-Nya. Maka siapa yang dapat menyelamatkanku dari azab-Nya jika aku menyelisihi-Nya setelah ayat-ayat-Nya jelas bagiku, rahmat-rahmat-Nya menyelimutiku, dan kabar gembira dari-Nya telah jelas untukku. Sehingga jika aku mengikuti hawa nafsu kalian, maka kalian hanya akan menambah kerugian. Hai kaumku, ini adalah unta dari Allah bagi kalian sebagai bukti yang jelas atas kebenaran kenabianku dan bukti kekuasaan Allah yang mengutusku; maka biarkanlah unta ini memakan rumput di bumi Allah yang luas ini, dan janganlah kalian mengganggunya, agar kalian tidak mendapat azab yang segera menimpa kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قَالَ يٰقَوْمِ أَرَءَيْتُمْ (Shaleh berkata: “Hai kaumku, bagaimana pikiranmu) Yakni fikirkanlah perkataanku lalu beritahukan kepadaku. إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى(jika aku mempunyai bukti yang nyata dari Tuhanku) Yakni hujjah yang jelas dan bukti yang benar. رَحْمَةً (rahmat) Yakni kenabian. فَمَن يَنصُرُنِى مِنَ اللهِ(maka siapakah yang akan menolong aku dari (azab) Allah) Yang dapat menghalangiku dari azab Allah. إِنْ عَصَيْتُهُۥ ۖ(jika aku mendurhakai-Nya) Dalam menyampaikan risalah dan berhenti dari kewajibanku menyampaikan kepada kalian agar meninggalkan penyembahan para Thaghut, dan menjadikan penyembahan hanya kepada Allah semata. Sedangkan aku tidak memiliki orang yang dapat menolongku dari Allah jika aku tidak menyampaikan risalah yang Allah perintahkan kepadaku untuk menyampaikannya. فَمَا تَزِيدُونَنِى(Sebab itu kamu tidak menambah apapun kepadaku) Dengan menakut-nakutiku. غَيْرَ تَخْسِيرٍ (selain daripada kerugian) menjadikanku orang yang rugi karena membatalkan amalanku dan terancam siksaan dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Shalih berkata: “Wahai kaumku pikirkanlah dan katakanlah kepadaku bahwa aku berada di jalan kebenaran dan mendapat wahyu kenabian, jika aku memiliki bukti yang benar dari Tuhanku atas keyakinan dan pengetahuan itu. Maka siapa yang menyelamatkanku dari azab Allah jika aku menentang perintahNya, dan mendurhakainya dalam menyampaikan risalahNya dan mencegah kesyirikan? Dan tidaklah permintaan kepadaku agar mengikuti kalian itu kecuali kesesatan dan terjerumus dalam kerugian”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Shalih berkata,“Wahai kaumku, jelaskan pendapat kalian} terangkanlah kepadaku {jika aku mempunyai bukti yang nyata} dalil yang jelas {dari Tuhanku dan Dia memberiku rahmat} kenabian {Maka siapa yang akan menolongku dari (azab) Allah} melindungiku dari azab Allah {jika aku mendurhakaiNya. Kalian tidak menambah apa pun untukku selain kerugian} menyesatkan dan menjauhkan dari kebaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. mereka mengklaim bahwa seandainya mereka mengetahui kebenaran dakwahnya niscaya mereka akan mengikutinya padahal sebenaranya mereka berdusta dalam hal ini. Oleh karena itu, shaleh memenjelaskan kedustaan mereka dengan ucapannya. ”shaleh berkata ’hai kaumku, bagaimana pendapatmu jika aku mempunyai bukti yang nyata dari Rabku” yakni dalil dan keyakinan dariku. ”dan Dia memberiku rahmat (kenabian) dariNya” maksudnya Dia memberiku nikmat wahyu dan kerasulan lalu apakah aku mengikuti keyakinanmu dan dakwahmu? ”maka siapakah yang akan menolongku dari (azab) Allah jika aku mendurhakaiNya. sebab itu kamu tidak menambah apapun kepadaku selain kerugian” yakni selain kekalahan, kesialan, dan kemudaratan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَرَءَيۡتُمۡ) : kabarkanlah kepadaku. (عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي) : dengan pengetahuan yang telah Dia ajarkan kepada ku, bagaimana mungkin aku menyembah kepada selain-Nya? (غَيۡرَ تَخۡسِيرٖ) : kecuali kerugian dan kesengsaraan. Makna ayat : Adapun ayat ke-63, Menjelaskan bahwa Shalih berdakwah kepada kaumnya dengan santun, agar tegak hujjah atas mereka, lalu beriman dan mentauhidkan Allah. Kemudian berkata—sebagaimana yang Allah kabarkan, (قَالَ يَٰقَوۡمِ أَرَءَيۡتُمۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي) “Wahai kaumku, apa pendapat kalian jika aku berada di atas ilmu mengenai iman, Allah, dan tentang wajibnya hanya beribadah kepada-Nya serta mentauhidkan-Nya. (وَءَاتَىٰنِي مِنۡهُ رَحۡمَةٗ) berupa nubuwah dan risalah. (فَمَن يَنصُرُنِي مِنَ ٱللَّهِ إِنۡ عَصَيۡتُهُۥ) Maka siapa yang akan menolongku dari-Nya, jika aku bermaksiat kepada-Nya ? Demi Allah tidak ada, selamanya. Kalau begitu tidaklah kalian—jika aku mengikuti kalian, meninggalkan beribadah kepada Allah, dan ridha dengan sesembahan kalian—menambahkan untukku kerugian dan kesesatan selama di dunia dan di akhirat. Pelajaran dari ayat : • Tidak bolehnya menuruti keinginan orang-orang yang salah, apa pun modelnya, karena menturuti hal tersebut hanya akan menambah kesengsaraan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 63: Dan aku berada dalam keyakinan yang kuat terhadapnya. Yakni apakah setelah itu, aku mengikuti permintaan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 63",
    "description": "Mendengar jawaban dan sikap kaumnya, dia'nabi saleh'berkata, wahai kaumku! terangkanlah kepadaku bagaimana sikap kamu jika aku mempunyai bukti yang nyata dari tuhanku berupa mukjizat yang dianugerahkan Allah sebagai bukti kerasulanku dan diberi-Nya aku rahmat dari-Nya, berupa pengetahuan, hidayah atau potensi yang bukan lahir dari kemampuanku' maka siapa yang akan menolongku dari azab Allah jika aku mendurhakai-Nya, dengan mengikuti keinginan kamu, tetap mempertahankan tradisi sesat para leluhur' jika aku mengikuti keinginanmu, maka kamu hanya akan menambah kerugian kepadaku, karena kamu telah menyesatkanku, agar aku mengabaikan rahmat yang dianugerahkan Allah padaku, sehingga Allah murka terhadap diriku. Setelah dijelaskan tentang ajakan nabi saleh kepada kaumnya agar tidak menyembah selain Allah, serta tanggapan mereka terhadap ajakan tersebut, maka pada ayat ini dijelaskan tentang bukti kekuasaan Allah berupa mukjizat yang diberikan kepada nabi saleh yaitu seekor unta. Dan ketika mukjizat itu datang kepadanya, nabi saleh berkata, wahai kaumku! inilah unta betina dari Allah, sebagai mukjizat untukmu karena kamu menuntut agar dibuatkan seekor unta betina dari batu karang, sebagaimana kemampuan kamu memahat gunung menjadi relief yang indah bagaikan sesuatu yang benar-benar hidup (lihat: surah ala'ra'f/7: 74 dan asy-syu'ara'/26: 149). Mendengar tantangan tersebut, Allah segera mendatangkan seekor unta betina yang keluar dari sebongkah batu besar. Unta yang diciptakan Allah sebagai mukjizat itu benar-benar hidup, ia memiliki bulu yang tebal, bisa mengandung dan melahirkan, makan dan minum'layaknya makhluk hidup'bahkan unta itu bisa memberikan minum kepada seluruh penduduk dari air susunya. Oleh sebab itu, biarkanlah dia makan di bumi Allah dan minum dari air sumur yang tersedia, sebagai hak yang harus dipenuhi untuk dia (lihat: surah asy-syu'ara/26: 155 dan al-qamar/54: 27-28). Dan janganlah kamu mengganggunya dengan gangguan apa pun seperti menyakiti atau membunuhnya yang akan menyebabkan kamu segera ditimpa azab dalam waktu dekat."
  }
]