[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahi kaumku, ini adalah unta milik Allah, Dia menjadikannya bagi kalian sebagai hujjah dan pertanda yang menunjukan kebenaranku dalam seruanku terhadap kalian. Maka biarkanlah ia makan di muka bumi Allah, rizkinya bukanlah menjadi tanggung jawab kalian. Dan janganlah kalian menyentuhnya dengan menyembelihnya. Bila kalian melakukannya, niscaya siksaan dari Allah yang dekat akan menimpa kalian akibat menyembelihnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Wahai kaumku! Ini adalah unta betina dari Allah sebagai tanda yang menunjukkan kebenaranku. Maka biarkanlah unta itu bergembala (mencari makan) di bumi Allah. Dan jangan sekali-kali kalian mengganggunya dengan cara apapun. Karena kalian akan ditimpa azab yang dekat dari sejak kalian menyembelihnya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَيٰقَوْمِ هٰذِهِۦ نَاقَةُ اللهِ لَكُمْ ءَايَةً (Hai kaumku, inilah unta betina dari Allah, sebagai mukjizat (yang menunjukkan kebenaran) untukmu) Mukjizat yang jelas, sebab nabi shalih mengeluarkan unta betina ini dari perut gunung sebagaimana yang orang-orang kafir minta. فَذَرُوهَا تَأْكُلْ فِىٓ أَرْضِ اللهِ(sebab itu biarkanlah dia makan di bumi Allah) Di padang rumput yang ada di bumi, karena unta itu adalah unta milik Allah yang memakan makanan di bumi Allah. فَيَأْخُذَكُمْ عَذَابٌ قَرِيبٌ (yang akan menyebabkan kamu ditimpa azab yang dekat) Yakni tidak lama setelah kalian menyembelihnya, yaitu setelah tiga hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Wahai kaumku, ini adalah unta Allah. Dia menciptakannya untuk kalian sebagai hujjah atas kebenaranku dan mukjizat yang nyata, maka biarkanlah dia memakan rumput di bumi dan janganlah kalian menghendaki keburukan baginya dengan membunuh dan menyakitinya. Niscaya kalian akan mendapatkan azab yang dekat, jika kalian melukainya, azab itu akan datang dalam 3 hari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai kaumku, inilah unta betina dari Allah sebagai mukjizat untuk kalian} tanda atas kebenaranku {Maka biarkanlah dia makan di bumi Allah dan janganlah memperlakukannya dengan buruk} setiap keburukan {sehingga kalian ditimpa azab.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64 “hai kaumku, inilah unta betina dari Allah, sebagai mukjizat (yang menunjukan kebenaran) untukmu” ia memiliki hari untuk minum dari sumur kemudian mereka memerah air susunya, dan mereka pun memiliki hari untuk minum dari sumur. ”sebab itu biarkanlah ia makan dibumi Allah” perawatan dan makanannya bukan tanggung jawab mu sedikitpun. ”dan janganlah kamu mengganggunya dengan ganguan apapun.” yakni menyembelihnya ”yang akan menyebabkan kamu ditimpa azab yang dekat”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ءَايَةٗۖ) Aayatan : tanda atas kebenaran risalah, bahwa tidak ada ilah yang berhak disembah kecuali Allah. (فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ) Fadzaruuha ta’kul fii ardhillah : tinggalkanlah ia makan dimanapun, kecuali di tempat yang ada pemiliknya. (بِسُوٓءٖ) Bi suu’ : seperti memukulnya, menyembelihnya, atau melarangnya minum dari tempat minumnya. Makna ayat : Kembali ayat ini mengisahkan tentang Nabi Shalih dan kaumnya, ketika beliau mendakwahi kaumnya kepada tauhid, mereka mendustakannya, serta meminta bukti akan kebenaran dakwahnya, lalu Nabi Shalih menjawab—sebagaimana yang Allah kabarkan pada ayat ini—(وَيَٰقَوۡمِ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ) Karena mereka memintanya agar mengeluarkan dari gunung yang mereka tunjuk, seekor unta, lalu Nabi Shalih berdoa, dan Allah kabulkan, maka gunung itu pun mengeluarkan seekor unta yang sedang hamil, fisiknya sangat sempurna. Nabi Shalih pun berkata, (وَيَٰقَوۡمِ هَٰذِهِۦ نَاقَةُ ٱللَّهِ) “Wahai kaumku, inilah untanya Allah—dinisbatkan kepada-Nya, karena unta tersebut tercipta dengan kekuasaan dan kehendak-Nya (لَكُمۡ ءَايَةٗۖ) bukit atas kebenaran seruanku: mempersembahkan ibadah hanya kepada Allah serta meninggalkan segala peribadatan berhala-berhala (فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ) biarkan ia makan dari tumbuhan bumi—ladang yang tidak dimiliki orang—dan jangan ganggu dia, seperti menyembelihnya (فَيَأۡخُذَكُمۡ عَذَابٞ قَرِيبٞ) sehingga datang kepada kalian azab yang dekat, tidak lebih dari 3 hari. Pelajaran dari ayat : • Allah ketika memberikan ayat-ayat (bukti) kepada orang-orang yang memintanya, tidak melazimkan mereka menjadi beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 64: Unta betina itu memiliki hari untuk meminum air sumur yang ada pada mereka, dan mereka boleh meminum air susu dari unta itu. Di samping itu, mereka juga memiliki hari tertentu untuk minum dari sumur itu, dan mereka juga tidak dibebani memberinya makan, di mana ini semua mengharuskan mereka tidak menyakitinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 64",
    "description": "Setelah dijelaskan tentang ajakan nabi saleh kepada kaumnya agar tidak menyembah selain Allah, serta tanggapan mereka terhadap ajakan tersebut, maka pada ayat ini dijelaskan tentang bukti kekuasaan Allah berupa mukjizat yang diberikan kepada nabi saleh yaitu seekor unta. Dan ketika mukjizat itu datang kepadanya, nabi saleh berkata, wahai kaumku! inilah unta betina dari Allah, sebagai mukjizat untukmu karena kamu menuntut agar dibuatkan seekor unta betina dari batu karang, sebagaimana kemampuan kamu memahat gunung menjadi relief yang indah bagaikan sesuatu yang benar-benar hidup (lihat: surah ala'ra'f/7: 74 dan asy-syu'ara'/26: 149). Mendengar tantangan tersebut, Allah segera mendatangkan seekor unta betina yang keluar dari sebongkah batu besar. Unta yang diciptakan Allah sebagai mukjizat itu benar-benar hidup, ia memiliki bulu yang tebal, bisa mengandung dan melahirkan, makan dan minum'layaknya makhluk hidup'bahkan unta itu bisa memberikan minum kepada seluruh penduduk dari air susunya. Oleh sebab itu, biarkanlah dia makan di bumi Allah dan minum dari air sumur yang tersedia, sebagai hak yang harus dipenuhi untuk dia (lihat: surah asy-syu'ara/26: 155 dan al-qamar/54: 27-28). Dan janganlah kamu mengganggunya dengan gangguan apa pun seperti menyakiti atau membunuhnya yang akan menyebabkan kamu segera ditimpa azab dalam waktu dekat. Maka mereka, yakni kaum nabi saleh yang membangkang menyembelih unta itu dengan pisau atau sejenisnya dengan tanpa menaruh rasa belas kasihan, kemudian dia nabi saleh berkata kepada mereka dengan nada mengejek, bersukarialah kamu semua di rumahmu selama tiga hari, setelah itu kamu pasti akan binasa akibat perbuatan dosa yang kamu lakukan. Itu adalah janji Allah yang tidak dapat didustakan oleh siapa pun, karena Allah pasti akan menepati janji-Nya."
  }
]