[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tatkala datang kepada mereka ketetapan kami untuk membinasakan kaum tsamud, kami menyelamtkan shaleh dan orang-orang beriman yang bersamanya dari kebinasaan dengan rahmat dari kami, dan kami selamatkan mereka dari kehinaan hari itu dan kenistaannya. Sesungguhhnya tuhanmu (wahai rasul), Dia mahakuat lagi Mahaperkasa dan diantara bukti kekuatan dan keperkasaaNya, Dia membinasakan umat-umat manusia yang berbuat melampaui batas dan menyelamatkan para rasul dan pengikut-pengikut mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Kemudian tatkala datang perintah Kami untuk membinasakan mereka Kami selamatkan Ṣāleḥ dan orang-orang yang beriman bersamanya dengan rahmat dari Kami. Dan Kami selamatkan mereka dari kehinaan dan kenistaan pada hari itu. Sesungguhnya Tuhanmu -wahai Rasul- adalah Żat Yang Maha Kuat lagi Maha Perkasa, tidak ada seorangpun yang dapat mengalahkan-Nya. Oleh karena itulah Dia mampu membinasakan umat-umat yang ingkar kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Setelah berlalu masa itu, dengan kelembutan dan rahmat-Nya, Allah menyelamatkan Nabi-Nya dan para pengikutnya dari kehinaan yang ada pada hari yang sulit itu. Hai Muhammad, Sungguh Tuhanmu Maha Kuat dalam mengazab, mengalahkan segala kekuatan, semua singgasana hancur di depan kekuatan-Nya. dan Dia Maha Perkasa, tidak ada yang mampu mengalahkan-Nya, Dia memuliakan dan menolong para kekasih-Nya, dan menghinakan para musuh-Nya sehingga tidak dapat melawan sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. فَلَمَّا جَآءَ أَمْرُنَا (Maka tatkala datang ketetapan Kami) Dengan turunnya azab. وَمِنْ خِزْىِ يَوْمِئِذٍ ۗ (dan dari kehinaan di hari itu) Berupa kebinasaan kaumnya akibat suara yang sangat keras. Makna (الخزي) yakni kehinaan dan kerendahan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Ketika perintah Kami untuk membinasakan kaum Tsamud telah datang, Kami menyelamatkan Shalih dan orang yang beriman bersamanya dari kehancuran dengan rahmat yang Kami berikan kepadanya. Kami juga menyelamatkan mereka dari kerendahan dan kehinaan pada hari kiamat. Wahai Shalih, sesungguhnya Tuhanmu Maha Kuat, Maha Kuasa dan Maha Menaklukkan segala sesuatu serta Maha Mengalahkan musuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika telah datang keputusan Kami, Kami menyelamatkan Shalih dan orang-orang yang beriman bersamanya dengan rahmat dari Kami serta dari kehinaan hari itu} kehinaan dan kerendahan pada hari itu {Sesungguhnya Tuhanmu itu Dzat Yang Maha kuat lagi Maha perkasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66 “maka tatkala datang urusan kami\", dengan terjadinya azab, ”kami selamatkan Shaleh beserta orang orang yang beriman bersamanya dengan rahmat dari kami, dan (kami selamatkan) dari kehinaan di hari itu” yakni kami menyelamatkan mereka dari azab, kehinaan dan kenistaan. ”sesungguhnya tuhanmu Dialah yang Maha kuat lagi Maha perkasa” termasuk kekuatan dan keperkasaanNya adalah Dia membinasakan umat umat yang melampaui batas dan menyelamatkan para rasul dan pengikutnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Allah berfirman : (فَلَمَّا جَآءَ أَمۡرُنَا نَجَّيۡنَا صَٰلِحٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا) ketika telah turun perintah Allah untuk mengazab mereka, Allah selamatkan Rasul-Nya Shalih dan orang-orang beriman dengan rahmat-Nya—dengan kelembutan dan nikmat-Nya. (وَمِنۡ خِزۡيِ يَوۡمِئِذٍۚ) Kami selamatkan mereka pula dari kehinaan dan azab. (إِنَّ رَبَّكَ هُوَ ٱلۡقَوِيُّ ٱلۡعَزِيزُ) Sesungguhnya Rabbmu—wahai Muhammad –Maha Kuat, ketika Ia menyiksa tidak ada yang bisa menghalangi kehendak-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 66: Ada yang mengatakan, bahwa jumlah mereka empat ribu orang. Di antara bukti kekuatan dan keperkasaan-Nya adalah Dia membinasakan umat-umat yang zalim dan menyelamatkan rasul serta para pengikutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 66",
    "description": "Maka ketika keputusan kami datang, kaum nabi hud itu binasa dan kami selamatkan nabi saleh dan orang-orang yang beriman bersamanya dari azab itu dengan rahmat kami selama di dunia dan kami selamatkan pula dari kehinaan yang menimpa pada hari itu, yaitu hari kiamat. Sungguh, tuhanmu, dia mahakuat, dan mahakuasa untuk mengalahkan siapa saja yang menentang, lagi mahaperkasa terhadap siapa saja yang memusuhi para nabi dan kekasih-Nya. Setelah tiga hari yang dijanjikan tiba, kemudian suara yang mengguntur demikian keras dari langit pun datang menimpa orang-orang zalim itu yang getarannya merontokkan jantung, sehingga mereka mati bergelimpangan di negerinya karena begitu dahsyatnya azab itu."
  }
]