[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan suara yang menggelar kuat menghabisi kaum tsamud yang berbuat kezhaliman, sehingga mereka menjadi orang-orang yang mati di tempat-tempat tinggal mereka, binasa lagi jatuh tersungkur dengan wajah, tidak ada gerakan sama sekali pada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Kaum Ṡamūd dihantam teriakan yang sangat keras. Mereka tewas seketika akibat kerasnya teriakan tersebut. Mereka jatuh tertelungkup dengan posisi wajah melekat ke tanah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Suara yang sangat keras menimpa orang-orang yang menzalimi diri mereka sendiri dan orang lain dengan kekafiran dan keingkaran mereka, sehingga mereka mati bergeletakan dalam rumah mereka. Kekuatan mereka telah musnah dan bangunan mereka telah hancur serta kepala mereka telah tunduk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَأَخَذَ الَّذِينَ ظَلَمُوا۟ الصَّيْحَةُ (Dan satu suara keras yang mengguntur menimpa orang-orang yang zalim itu) Mereka ditimpa suara yang sangat keras sehingga mereka mati. Terdapat pendapat mengatakan makna (الصيحة) yakni malaikat Jibril. Dan pendapat lain mengatakan yakni suara keras dari langit yang memotong-motong hati mereka. فَأَصْبَحُوا۟ فِى دِيٰرِهِمْ جٰثِمِينَ (lalu mereka mati bergelimpangan di rumahnya) Yakni mati berjatuhan diatas wajah mereka, terkapar diatas tanah seperti bangkai seekor burung."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Lalu orang-orang yang menzalimi diri sendiri dengan berbuat kufur itu ditimpa jeritan yang sangat dahsyat dari arah langit, atau jeritan yang menimbulkan getaran dalam hati. Dan orang-orang kafir itu terkejut dengan suara itu lalu mereka tersungkur mati di dalam rumah-rumah mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Suara yang menggelegar} suara yang sangat dahsyat lagi menghancurkan yang turun dari langin {menimpa orang-orang zalim itu, sehingga mereka mati bergelimpangan di rumah-rumah mereka (67)} mati bergelimpangan dengan lutut dan wajah mereka menempel di tanah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67 “dan satu suara keras yang mengguntur menimpa orang orang yang zhalim itu” ia memutuskan jantung mereka, ”lalu mereka mati bergelimpangan di rumahnya” tergelatak bertumbungan tanpa bergerak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فِي دِيَٰرِهِمۡ جَٰثِمِينَ) Fii diyaarim jaatsimiin : jatuh tersunggkur pada lutut dan wajah-wajah mereka. Makna ayat : Allah menceritakan tentang kehancuran kaum Tsamud firman-Nya (وَأَخَذَ ٱلَّذِينَ ظَلَمُواْ ٱلصَّيۡحَةُ فَأَصۡبَحُواْ فِي دِيَٰرِهِمۡ جَٰثِمِينَ) Sesungguhnya orang-orang yang menyekutukan Rabb mereka, mendustakan ayat-ayat-Nya, mereka tersambar halilintar, tercabutlah jantung mereka, sehingga mereka musnah dan menjadi seonggok mayat yang tersungkur, seakan-akan mereka tidak pernah tinggal di rumah-rumah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 67: Yang memutuskan jantung mereka. Dalam keadaan berlutut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 67",
    "description": "Setelah tiga hari yang dijanjikan tiba, kemudian suara yang mengguntur demikian keras dari langit pun datang menimpa orang-orang zalim itu yang getarannya merontokkan jantung, sehingga mereka mati bergelimpangan di negerinya karena begitu dahsyatnya azab itu. Keberadaan kaum samud yang diazab hingga binasa, seolah-olah menggambarkan bahwa mereka belum pernah tinggal di tempat itu karena demikian dahsyatnya azab itu, hingga menghancurleburkan apa saja yang ada di negeri itu. Ingatlah, kaum samud mengingkari dan mendurhakai tuhan mereka yang selama ini memelihara, membimbing, dan berbuat baik kepada mereka. Ingatlah, binasalah kaum samud karena jauh dari rahmat Allah. Hancurnya suatu negeri disebabkan ulah dan kedurhakaan yang dilakukan umat manusia."
  }
]