[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu lantaran begitu cepatnya lenyap dan hancur, seolah-olah tidak pernah mendiami negeri itu. Ingatlah sesungguhnya kaum tsamud telah mengingkari ayat-ayat tuhan mereka dan hujjah-hujjah dariNya. Maka ingatlah kehancuran bagi kaum tsamud, dan pengusiran bagi mereka dari rahmat Allah. Maka alangkah celaka dan nistanya mereka itu!"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Seolah-olah mereka tidak pernah tinggal di negeri mereka dalam kenikmatan maupun kemakmuran. Ingatlah! Sesungguhnya kaum Ṡamūd itu telah ingkar kepada Allah, Tuhan mereka. Mereka senantiasa dijauhkan dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Seakan-akan mereka tidak pernah tinggal di sana dengan kenikmatan dan kesejahteraan, mereka menjadi peninggalan; dan bangunan-bangunan yang megah di kota itu hancur, sehingga tidak tersisa darinya kecuali bukit-bukit menakutkan dan rumah-rumah yang tidak terjamah. Semua ini sebagai pelajaran dan peringatan bagi manusia agar tidak ingkar terhadap kenikmatan dari Tuhan mereka. Sungguh laknat bagi mereka di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. كَأَن لَّم يَغْنَوْا۟ فِيهَآ ۗ (seolah-olah mereka belum pernah berdiam di tempat itu) Yakni keadaan mereka setelah dibinasakan seakan-akan mereka tidak pernah tinggal di negeri itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Seakan-akan mereka tidak tinggal di dalam rumah-rumah mereka sebelumnya. Ingatlah bahwa kaum Tsamud itu kufur kepadaTuhannya. Ingatlah juga bahwa mereka dihancurkan dan terusir dari rahmat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seakan-akan mereka belum pernah tinggal di sana} belum pernag tinggal di negeri mereka {Ingatlah sesungguhnya kaum Tsamud telah mengingkari Tuhan mereka. Ingatlah, bahwa kaum Tsamud telah binasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68 “seolah olah mereka belum pernah berdiam di tempat itu” maksudnya, ketika azab datang kepada mereka seolah olah mereka tidak bernikmat ria di negeri mereka, tidak tentram padanya dan tidak bersuka ria sesaat pun. Nikmat telah berpisah dari mereka, azab yang terus menerus tak terhenti telah mencaplok mereka, seolah olah ia masih terasa. ”ingatlah sesungguhnya kaum tsamud mengingkari tuhan mereka” maksudnya mereka ingkar setelah ayat ayat Allah yang terang datang kepada mereka. ”ingatlah, kebinasaanlah bagi kaum tsamud” betapa hina dan sengsaranya mereka. Kita berlindung kepada Allah dari azab dan kehinaan dunia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ) Ka’allam yaghnau fiihaa : seakan-akan mereka tidak pernah ada dan tinggal disini sebelumnya. Makna ayat : Allah berfirman (أَلَآ إِنَّ ثَمُودَاْ كَفَرُواْ رَبَّهُمۡۗ أَلَا بُعۡدٗا لِّثَمُودَ) celaka lah bagi kaum Tsamud, ini adalah celaan dan ancaman. Selesailah kisah Shalih bersama kaumnya Tsamud, yang mereka lebih menyukai kekafiran dari pada iman dan menyukai syirik daripada tauhid. Pelajaran dari ayat : • Buruknya kezhaliman dan akhir yang buruk bagi pelakunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 68: Demikian cepatnya mereka dibinasakan oleh guntur itu, seakan-akan mereka belum pernah bersenang-senang di sana dan menempatinya meskipun sehari, kenikmatan berpisah dari mereka dan mereka ditimpa azab yang kekal, yang tidak putus-putusnya, wal ‘iyaadz billah. Setelah datang bukti yang nyata. Alangkah celaka dan hina mereka, kita memohon kepada Allah agar Dia melindungi kita dari azab dunia dan kehinaannya serta dari azab akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 68",
    "description": "Keberadaan kaum samud yang diazab hingga binasa, seolah-olah menggambarkan bahwa mereka belum pernah tinggal di tempat itu karena demikian dahsyatnya azab itu, hingga menghancurleburkan apa saja yang ada di negeri itu. Ingatlah, kaum samud mengingkari dan mendurhakai tuhan mereka yang selama ini memelihara, membimbing, dan berbuat baik kepada mereka. Ingatlah, binasalah kaum samud karena jauh dari rahmat Allah. Hancurnya suatu negeri disebabkan ulah dan kedurhakaan yang dilakukan umat manusia. Setelah dijelaskan kisah kaum samud dan kedurhakaan mereka serta kesudahannya, kemudian dipaparkan kisah nabi ibrahim dan keluarganya ketika kedatangan tamu-tamu mulia yang tidak lain adalah para malaikat. Dan para utusan kami, yakni para malaikat telah datang kepada nabi ibrahim dengan membawa kabar gembira tentang kelahiran putranya kelak yang akan lahir dari rahim sarah istrinya, kemudian cucu yang akan lahir dari keturunannya, mereka mengucapkan, selamat, semoga keselamatan dan kebahagiaan selalu tercurah padamu wahai nabi ibrahim. Kemudian dia'nabi ibrahim'pun menjawab, selamat semoga kebahagiaan yang sempurna itu menyertaimu selamanya. Maka tidak lama kemudian sebagaimana layaknya tuan rumah yang baik, nabi ibrahim menyuguhkan daging anak sapi yang dipanggang untuk menjamu tamunya (lihat: surah adh-dhariyat/51: 24-26). Ayat ini menganjurkan, memberi salam ketika berkunjung ke rumah orang, dan wajib hukumnya menjawab salam (lihat: surah an-nisa'/4: 86). Ayat ini juga memberi pelajaran untuk menghormati dan memuliakan tamu antara lain menjamu tamu."
  }
]