[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh para malakat telah mendatangi Ibrahim, memberikan kabar gembira baginya dan istrinya dengan kelahiran ishaq dan ya’qub setelahnya, lalu mereka berkata, ”salam, Ibrahim berkata untuk menjawab salam mereka, ”salam.” Lalu Ibrahim segera beranjak dan membawakan bagi mereka daging anak sapi gemuk yang telah dipanggang agar mereka menyantapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Para Malaikat datang kepada Ibrahim -'alaihissalām- dalam wujud beberapa orang laki-laki untuk menyampaikan kabar gembira untuk dia dan isterinya akan lahirnya Isḥāq kemudian Ya'qūb. Para Malaikat itu berkata, \"Salām.\" Ibrahim menjawabnya dengan ucapan, \"Salām.\" Lalu Ibrahim bergerak cepat dan kembali dengan membawa anak sapi panggang untuk jamuan makan mereka. Ibrahim mengira bahwa para lelaki itu adalah manusia biasa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Sungguh telah datang para malaikat yang Kami utus kepada Ibrahim untuk menyampaikan kabar gembira baginya. Mereka mengucapkan salam kepadanya, dan dia menjawab salam mereka dan menjamu mereka dengan segera menyiapkan makanan bagi mereka dengan penuh semangat; tidak memakan waktu lama untuk menyiapkan makanan itu, meski yang dia siapkan adalah daging anak sapi panggang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَلَقَدْ جَآءَتْ رُسُلُنَآ إِبْرٰهِيمَ بِالْبُشْرَىٰ (Dan sesungguhnya utusan-utusan Kami (malaikat-malaikat) telah datang kepada lbrahim dengan membawa kabar gembira) Setelah Allah menurunkan malaikat untuk mengazab kaum Luth, mereka mendatangi nabi Ibrahim dengan menyerupa sebagai manusia, mereka mendatanginya untuk memberinya kabar gembira yang akan disebutkan. فَمَا لَبِثَ (maka tidak lama kemudian) Yakni Nabi Ibrahim. أَن جَآءَ بِعِجْلٍ حَنِيذٍ (Ibrahim menyuguhkan daging anak sapi yang dipanggang) Makna (الحنيذ) yakni daging yang dipanggang dengan batu panas, tanpa tersentuh oleh api."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Dan sungguh telah datang kepada Ibrahim para malaikat dengan membawa kabar gembira tentang Ishaq sebagai anaknya. Mereka berkata: “Kesejahteraan terlimpah atasmu” Ibrahim menjawab: “Kesejahteraan pula terlimpah atas kalian” Lalu tidak lama Ibrahim datang dengan daging anak sapi yang dipanggang di atas batu yang dipanaskan dengan api. Dan itu merupakan sebaik-baik panggangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh benar-benar telah datang para utusan Kami kepada Ibrahim dengan membawa kabar gembira} dengan kabar gembira tentang Ishaq dan Ya’kub {Mereka mengucapkan,“Selamat.” Dia} Ibrahim {menjawab,“Selamat.” Tidak lama kemudian, Ibrahim datang} lalu tidak lama sehingga dia datang {dengan membawa daging anak sapi yang dipanggang} yang dipanggang dengan batu yang dipanaskan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69 “dan sesungguhnya telah dating utusan utusan kami\" (malaikat malaikat yang mulia) ”kepada Ibrahim” al-khalil Rasul kami, ”dengan membawa kabar gembira” yakni kabar gembira seorang anak, ketika Allah mengutus mereka untuk membinasakan kaum luth. Allah memerintahkan mereka agar singgah pada Ibrahim untuk menyampaikan berita gembira dengan lahirnya ishaq. Ketika para malaikat itu datang kepada Ibrahim, ”mereka mengucapkan ‘salaman’ (selamat) Ibrahim menjawab ’salamun’(selamatlah)” maksudnya para malaikat itu mengucapkan salam dan ibrahim menjawab salamnya. Ini menunjukan disyariatkannya memberi salam. ia adalah syariat agama Ibrahim ia diucapkan sebelum berbicara. hendaknya jawaban salam lebih mendalam daripada memberi salam, karena salam mereka menggunakan jumlah fi'liyah (kalimat verbal) yang menunjukan perubahan pada yang baru dan jawabannya menggunakan kalimat ismiyah (kalimat non verbal) yang menunjukan ketetapan dan kelanggengan. terdapat perbedaan besar diantara keduanya sebagaimana hal itu diketahui dalam ilmu bahasa arab. ”maka tidak lama” setelah mereka, datanglah ibrahim “menyuguhkan daging anak sapi yang dipanggang” maksudnya dia langsung menghadirkan untuk tamu tamunya daging anak sapi yang gemuk yang dibakar diatas batu panas. Ibrahim menyuguhkannya seraya berkata “makanlah”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna per-kata : (بِٱلۡبُشۡرَىٰ) Bil busyraa : dengan Ishaq dan setelahnya Ya’kub. (فَمَا لَبِثَ) Fama labitsa : tidak lama. (بِعِجۡلٍ حَنِيذٖ) bi’ijlin haniidz : dipanggang dengan batu. Makna ayat : Ini adalah kabar gembira dari Allah kepada Ibrahim yang Allah firmankan : (وَلَقَدۡ جَآءَتۡ رُسُلُنَآ إِبۡرَٰهِيمَ بِٱلۡبُشۡرَىٰ) yang dimaksud rasul-rasul Kami: Jibril, Mikail, dan Israfil. Mereka memasuki rumah beliau dengan memberi salam, lantas Ibrahim menjawab salam mereka, inilah makna firman-Nya : (قَالُواْ سَلَٰمٗاۖ قَالَ سَلَٰمٞۖ) . Firman-Nya (فَمَا لَبِثَ أَن جَآءَ بِعِجۡلٍ حَنِيذٖ) tidak lama kemudian, beliau menghidangkan seekor anak sapi panggang, (حَنِيذٖ) dari kata (محنوذ) mahnuudz yaitu dipanggang di atas batu. Kemudian mendekatkan makanan tersebut dan mempersilahkan untuk makan, (أَلَا تَأۡكُلُونَ) [Adz-Dzariyat: 27] “Silahkan dimakan.” Pelajaran dari ayat : • Dianjurkannya memberi kabar kepada seorang mukmin dengan kebaikan, sekalipun dengan mimpi yang baik. • Disyariatkan salam ketika masuk kedalam rumah orang lain, atau singgah, atau melewatinya. Juga diwajibkannya menjawab salam. • Disyariatkannya pemilik rumah untuk melayani tamunya, serta memuliakan tamu. Dalam hadits sahih (من كان يؤمن بالله و اليوم الآخر فاليكرم ضيفه) “Barangsiapa yang beriman kepada Allah dan hari akhir, hendaklah ia muliakanlah tamunya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 69: Tentang kelahiran Ishaq, dan darinya lahir Ya’qub. Dalam ayat ini terdapat dalil disyari’atkannya mengucapkan salam, dan bahwa ia termasuk ajaran Nabi Ibrahim, dan bahwa salam didahulukan sebelum berbicara, demikian juga sepatutnya menjawab salam melebihi ucapan yang pertama mengucapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 69",
    "description": "Setelah dijelaskan kisah kaum samud dan kedurhakaan mereka serta kesudahannya, kemudian dipaparkan kisah nabi ibrahim dan keluarganya ketika kedatangan tamu-tamu mulia yang tidak lain adalah para malaikat. Dan para utusan kami, yakni para malaikat telah datang kepada nabi ibrahim dengan membawa kabar gembira tentang kelahiran putranya kelak yang akan lahir dari rahim sarah istrinya, kemudian cucu yang akan lahir dari keturunannya, mereka mengucapkan, selamat, semoga keselamatan dan kebahagiaan selalu tercurah padamu wahai nabi ibrahim. Kemudian dia'nabi ibrahim'pun menjawab, selamat semoga kebahagiaan yang sempurna itu menyertaimu selamanya. Maka tidak lama kemudian sebagaimana layaknya tuan rumah yang baik, nabi ibrahim menyuguhkan daging anak sapi yang dipanggang untuk menjamu tamunya (lihat: surah adh-dhariyat/51: 24-26). Ayat ini menganjurkan, memberi salam ketika berkunjung ke rumah orang, dan wajib hukumnya menjawab salam (lihat: surah an-nisa'/4: 86). Ayat ini juga memberi pelajaran untuk menghormati dan memuliakan tamu antara lain menjamu tamu. Ketika hidangan itu tersaji, nabi ibrahim menyodorkannya ke hadapan mereka seraya meminta agar hidangan itu dimakan. Maka ketika dilihatnya tangan mereka tidak menjamah hidangan yang disodorkannya itu, dia'nabi ibrahim'mencurigai perihal kedatangan mereka, dan merasa takut kepada mereka karena khawatir kedatangan mereka akan membawa berita buruk. Menyaksikan sikap nabi ibrahim yang demikian itu mereka para malaikat itu pun berkata, jangan takut, sesungguhnya kami diutus oleh Allah kepada kaum lut untuk membinasakan mereka. Ayat ini memberi pelajaran tentang etika bertamu, hendaknya memberi rasa tenteram dan tenang ketika bertamu, terutama ketika seseorang menaruh curiga dan takut terhadap orang yang belum dikenal, hendaknya tamu segera menjelaskan identitas dirinya."
  }
]