[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dialah yang menciptakan langit dan bumi dan segala yang ada di dalamnya dalam enam hari, dan arsyNya berada di atas air sebelum itu, supaya Dia menguji kalian siapakah dari kalian yang lebih ketaatan dan amalanya kepadaNya, yaitu amal yang dikerjakan ikhlas karena Allah, yang sesuai dengan petunjuk Rasulullah . Dan bila kamu , berkata (wahai rasul) kepada kaum musyrikin dari kaummu, ”sesungguhnya kalian akan dibangkitkan dalam keadaan hidup setelah kematian kalian,” pastilah mereka akan bersegera mendustakan dan mengatakan, ”tidaklah al-qur’an yang kamu bacakan kepada kami kecuali sihir yang nyata.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dia lah yang menciptakan langit dan bumi yang demikian besarnya dan menciptakan isinya dalam masa enam hari. Dan Arasy-Nya sudah ada di atas air sebelum penciptaan langit dan bumi. Dia hendak menguji kalian -wahai manusia- siapa di antara kalian yang paling baik amal perbuatannya yang diridai Allah, dan siapa di antara kalian yang paling buruk amal perbuatannya yang dimurkai Allah. Kemudian Allah akan memberikan balasan yang setimpal kepada setiap orang. Sungguh, jika engkau -wahai Rasul- berkata, \"Sesungguhnya kalian -wahai manusia- akan dibangkitkan kembali sesudah kematian untuk dihisab,\" niscaya orang-orang yang ingkar kepada Allah dan mengingkari Hari Kebangkitan itu akan berkata, \"Al-Qur`ān yang kamu baca ini tidak lain adalah sihir yang nyata. Jadi Al-Qur`ān adalah kebatilan yang nyata.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Dia menciptakan langit dalam empat hari dan menciptakan bumi selama dua hari, sehingga genap menjadi enam hari. Dan arsy-Nya berada di atas air. Allah menciptakan langit dan bumi untuk menguji hamba-hamba-Nya dan membalas mereka sesuai amal perbuatan mereka; memberi pahala bagi orang-orang baik, dan menyiksa orang-orang jahat. Hai Muhammad, jika kamu mengatakan mereka bahwa mereka akan dibangkitkan setelah kematian, niscaya mereka akan berkata: “Apa yang kamu datangkan ini benar-benar sihir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَكَانَ عَرْشُهُۥ عَلَى الْمَآءِ (dan singgasana-Nya di atas air) Yakni ‘Arsy-Nya berada di atas air sebelum langit dan bumi diciptakan. لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا ۗ (agar Dia menguji siapakah di antara kamu yang lebih baik amalnya) Yakni dalam penciptaan alam semesta ini terdapat larangan dan perintah, dan Allah akan membalas orang yang baik atas kebaikannya dan orang yang jahat atas kejahatannya. لَيَقُولَنَّ الَّذِينَ كَفَرُوٓا۟( niscaya orang-orang yang kafir itu akan berkata) Sesungguhnya perkataan ini. إِنْ هٰذَآ إِلَّا سِحْرٌ مُّبِينٌ(Ini tidak lain hanyalah sihir yang nyata) Yakni perkataan batil seperti kebatilan sihir, dan tipuan seperti tipuan dari sihir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Dialah yang menciptakan langit dan bumi dalam enam hari/masa, adapun ‘Arsy Allah sebelum itu adalah di atas air, 'Arsy adalah makhluk besar. Kita tidak mengetahui hakikat ‘Arsy itu. Kita mengimani tanpa menyerupakannya dengan sesuatu apapun. Itu semua dimaksudkan untuk menguji siapakah di antara kamu yang amalnya lebih baik dalam menjalankan perintah dan meninggalkan larangan-Nya, sehingga yang berbuat baik akan diberi pahala begitu juga yang berbuat buruk akan diberi hukuman. Jika kamu wahai Muhammad berkata kepada penduduk Makkah: “Sesungguhnya kelak sesudah mati, kamu akan dibangkitkan”, niscaya orang-orang yang kafir itu akan berkata: “Ini tidak lain hanyalah sihir yang nyata”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dialah yang telah menciptakan langit dan bumi dalam enam hari, dan ʻArsyNya di atas air. Itu untuk menguji kalian} menguji kalian {siapakah di antara kalian yang lebih baik amalnya. Sungguh jika kamu berkata,“Sesungguhnya kalian akan dibangkitkan setelah mati,”. Sungguh orang-orang kafir akan berkata,“Ini} Al-Qur’an ini {tidak lain kecuali sihir yang nyata”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah mengabarkan bahwa Dia “menciptakan langit dan bumi dalam enam masa” hari pertamanya adalah hari ahad dan hari terakhirnya adalah hari jumat. Dan ketika Dia menciptakan langit dan bumi, maka Dia bersemayam di arasyNya. Dia mengatur dan menata segala urusan menurut kehendakNya yang meliputi hukum hukum syar’i. Oleh karena itu, Dia berfirman ”agar Dia menguji siapakah diantara kamu yang lebih baik amalnya.” Maksudnya, Allah mengujimu tatkala Dia menciptakan segala sesuatu yang ada di langit dan bumi untukmu. Dia mengujimu dengan perintah dan laranganNya, maka Dia melihat siapa yang lebih baik amalnya di antara kamu. Al fudhail bin iyadh berkata ”yang paling ikhlas dan yang paling benar” Dia ditanya ”wahai abu ali apa maksudnya?” Dia menjawab ”jika suatu amal perbuatan itu ikhlas akan tetapi ia tidak benar, maka ia tidak diterima, jika ia benar tetapi tidak ikhlas, maka ia tidak diterima, hingga ia dilakukan secara ikhlas dan benar. Yang ikhlas adalah yang dilakukan karena wajah Allah, dan yang benar adalah yang mengikuti syariat dan sunnah. Ini sebagaimana Allah ”dan aku tidak menciptakan jin dan manusia melainkan untuk menyembahKu”. ”Allah lah yang menciptakan tujuh langit dan seperti itu pula bumi. perintah Allah berlaku padanya, agar kamu mengetahui bahwasannya Alah Maka Kuasa atas segala sesuatu, dan bahwa Allah, ilmuNya benar benar meliputi segala sesuatu” Allah menciptakan manusia untuk beribadah kepadaNYa dan mengetahuiNya dengan nama dan sifat sifatNya. Dia memerintah mereka dengan itu. Maka barangsiapa yang tunduk dan dan menunaikan apa yang diperintahkan maka dia termasuk orang orang yang beruntung. Barangsiapa yang berpaling maka mereka adalah orang orang merugi, dan pasti Dia akan mengumpulkan mereka di alam yang mana Dia membalas mereka atas dasar perintah dan laranganNya. oleh karena itu Allah menyebutkan pendustaan orang orang musyrik terhadap hari pembalasan. Dia berfirman ”dan jika kamu berkata (kepada penduduk makkah) sesungguhnya kamu akan dibangkitkan sesudah mati niscaya orang orang yang kafir itu akan berkata ’ini tidak lain adalah sihir yang nyata’” Maksudnya. jika kamu berkata dan mengabarkan kepada mereka tentang kebangkitan sesudah kematian niscaya mereka tidak mempercayaimu, justru mereka sangat mendustakanmu dan melecehkan apa yang kamu bawa, dan mereka berkata, ”ini tidak lain adalah sihir yang nyata” Ketahuilah, ia adalah kebenaran yang nyata."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (في ستة أيام) Fii sittati ayyaam : Hari Ahad, Senin, Selasa, Rabu, Kamis dan Jum’at. (و كان عرشه على الماء) Wa kaana ‘arsyuhuu ‘alal maai : Ketika itu belum diciptakan makhluk selainnya (air). Pada masa itu air berada di udara. (ليبلوكم) Liyabluwakum : Menguji kalian, agar terlihat siapa yang lebih baik amalannya. Makna ayat : Firman-Nya (وهو الذي خلق السموات و الأرض في ستة أيام و كان عرشه على الماء) Menciptakan langit dan bumi yang tujuh dalam 6 hari. Makna “hari” disini boleh dihitung seperti hari-hari biasa di dunia atau dihitung dengan perhitungan hari di sisi-Nya yaitu 1000 tahun, berdasarkan firman-Nya dalam surat Al-Hajj (و إن يوما عند ربك كألف سنة مما تعدون) “Sesungguhnya sehari disisi Tuhanmu adalah seperti seribu tahun menurut perhitunganmu.”. Kemudian Firman-Nya (و كان عرشه على الماء) Allah menciptakan ‘Arsy sebelum menciptakan langit dan bumi. ‘Arsy adalah singgasana kerajaan, dari sana lah ditentukan semua perkara dalam kehidupan. Firman-Nya (على الماء) pada masa itu belum ada bumi maupun langit, kecuali air yang seperti udara. Firman-Nya (ليبلوكم أحسن أيكم عملا) menciptakan kalian dan segala sesuatu untuk menguji, siapa diantara kalian yang paling taat dan bagus amalannya, yaitu dengan ikhlas hanya mengharap ridha Allah dan mengerjakannya sesuai dengan yang disyariatkan dan dijelaskan-Nya dan rasul-Nya. Ini adalah tanda kekuasaan dan ilmu-Nya, dengannya seluruh ibadah harus dan hanya dipersembahkan kepada-Nya, tidak ada satu pun perkara hamba-hamba-Nya yang tersembunyi dari-Nya, lalu bagaimana mungkin orang-orang bodoh itu mencoba menutupi isi hati dan gerak-gerik mereka dari Allah dengan menundukkan kepala, menutupi wajah mereka dengan pakaian!? Sungguh buruk perilaku mereka. Firman-Nya (ولئن قلت) Seandainya engkau berkata wahai Rasul, kepada orang-orang musyrik bahwa “Kalian akan dibangkitkan setelah kematian.”, diciptakan kembali dengan penciptaan yang baru, kalian akan bangkit untuk menjalankan penghitungan dan pembalasan berdasarkan amal-amal kalian di dunia. (ليقولن الذين كفروا) mereka akan berkata ketika mereka mendengar kabar kehidupan setelah kematian serta apa saja yang ada berupa kenikmatan abadi dan azab yang menghinakan (إن هذا إلا سحر مبين) tidaklah perkataan Muhammad kecuali sihir yang nyata, ingin agar manusia menjauh dari kesenangan mereka, mengumpulkan masa untuk menjadi pemimpin dan mendapat pelayanan dari mereka. Sungguh ini adalah perkataan yang batil serta prasangka dusta. Seperti ini lah keadaan orang-orang kafir. Pelajaran dari ayat : • Menjelaskan bagaimana alam ini diciptakan, serta tujuan penciptaannya • Penegasan akan adanya hari kiamat setelah penetapan atas Uluhiyyah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 7: Awalnya adalah hari Ahad dan akhirnya adalah hari Jum’at. Yang berada di atas langit yang tujuh. Setelah Allah Subhaanahu wa Ta'aala menciptakan langit dan bumi, Dia bersemayam di atas ‘Arsy, mengatur segala urusan dan mengendalikannya sesuai kehendak-Nya dengan hukum-hukum qadari dan syar’i-Nya. Allah Subhaanahu wa Ta'aala menciptakan langit dan bumi dan apa yang ada di antara keduanya berupa manfaat dan maslahat bagi manusia adalah untuk menguji mereka, siapakah di antara mereka yang paling taat (paling ikhlas amalnya dan paling sesuai dengan sunnah Rasul-Nya, di mana keduanya merupakan syarat diterimanya amal). Allah Subhaanahu wa Ta'aala menciptakan manusia untuk beribadah kepada-Nya, barang siapa yang melakukannya maka dia akan beruntung, sebaliknya barang siapa yang berpaling darinya, maka dia akan rugi, dan Allah akan mengumpulkannya di hari pembalasan, oleh karenanya pada lanjutan ayat di atas, Allah Subhaanahu wa Ta'aala menyebutkan keingkaran orang-orang kafir kepada hari pembalasan. Yakni niscaya mereka akan mengingkarinya dengan pengingkaran yang keras sampai berkata seperti yang disebutkan dalam ayat di atas. Maksud mereka mengatakan bahwa kebangkitan nanti sama dengan sihir adalah kebangkitan itu tidak ada sebagaimana sihir itu hanyalah khayalan belaka. Sedangkan menurut sebagian ahli tafsir yang dimaksud dengan kata “ini” adalah Al Quran, dan ada pula yang menafsirkan kata “ini” dengan hari berbangkit."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 7",
    "description": "Dan di antara kekuasaan Allah lainnya adalah bahwa dialah yang menciptakan langit dan bumi serta apa yang ada pada keduanya dalam enam masa melalui proses penciptaan yang rapi dan teratur. Dan sebelum itu dia menciptakan 'arsy sebagai tempat bersemayam-Nya di atas air. Demikian itulah, agar dia menguji siapakah di antara kamu yang lebih baik amal ibadahnya, bekerja dengan jujur, ikhlas dan beraktivitas untuk kemaslahatan umat. Mereka yang berbuat kebajikan akan mendapat imbalan pahala, sedang mereka yang berbuat kejahatan akan mendapatkan siksa. Jika engkau wahai nabi Muhammad, berkata kepada penduduk mekah, sesungguhnya kamu akan dibangkitkan pada hari kiamat nanti setelah mati untuk mempertanggungjawabkan amal perbuatan kalian ketika di dunia, niscaya orang kafir itu akan berkata, apa yang kamu katakan ini hanyalah sihir yang nyata untuk menipu dan menakut-nakuti agar kami mudah percaya. Orang-orang kafir itu bahkan berani menantang agar diturunkan siksa dengan segera, sebagaimana dijelaskan pada ayat ini. Dan sungguh, jika kami tangguhkan azab terhadap mereka yang mendustakan ayat-ayat kami sampai waktu yang ditentukan menurut kehendak kami, niscaya mereka yang menghendaki agar siksaan itu turun dengan segera akan berkata, dengan nada mengejek, apakah yang menghalanginya, yakni siksaan itu turun sekarang' kemudian Allah berfirman, ketahuilah wahai nabi Muhammad, ketika azab itu betul-betul datang kepada mereka dengan segera, pasti azab itu tidaklah dapat dielakkan oleh mereka. Mereka tidak dapat menahan dan menghindar karena begitu dahsyatnya azab itu. Mereka dikepung dari segala penjuru oleh azab yang dahulu mereka memperolok-olokkannya. Sikap orang-orang kafir yang tidak memercayai kebenaran Al-Qur'an dan mengingkari adanya hari pembalasan, bahkan menantang diturunkannya azab dengan segera, disebabkan oleh kesombongan dan keangkuhan mereka, sehingga hatinya sulit menerima cahaya keimanan."
  }
]