[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Ibrahim melihat tangan-tangan mereka tidak menyentuh daging anak sapi yang dia bawakan kepada mereka dan tidak memakannya, dia memandang adanya keanehan dari mereka, dan dia merasa ketakutan dalam hatinya, tetapi menyembunyikan perasaan itu. Ketika para malaikat melihat rasa kecemasan pada Ibrahim, mereka berkata, ”janganlah kamu takut, sesungguhnya kami adalah malaikat-malaikat tuhanmu, kami dikirim kepada kaum luth untuk membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Kemudian tatkala Ibrahim melihat bahwa tangan-tangan mereka sama sekali tidak menyentuh anak sapi panggang itu dan mereka tidak memakannya sedikitpun, tiba-tiba dia merasakan keanehan pada diri mereka. Dia menyembunyikan rasa takut kepada mereka di dalam hatinya. Dan tatkala para Malaikat melihat rasa takut Ibrahim kepada mereka maka mereka berkata, \"Jangan takut kepada kami! Kami diutus oleh Allah untuk menimpakan azab kepada kaum Lūṭ.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Ibrahim mengajak mereka untuk menyantap makanan yang telah disiapkan, namun mereka tidak mau mengambilnya, sehingga Ibrahim merasa takut dari mereka, sebab seorang tamu tidak akan enggan memakan makanan yang disuguhkan melainkan karena keraguannya terhadap makanan itu atau karena dia memiliki tujuan jahat. Ketika itu Ibrahim belum mengetahui bahwa tamu-tamunya adalah para malaikat. Dan saat mereka melihat Ibrahim mulai merasa takut, mereka segera menenangkannya dengan mengatakan yang sebenarnya siapa mereka dan tujuan kedatangan mereka, yaitu untuk membinasakan kaum Luth hingga tidak tersisa setelah mereka tetap tenggelam dalam kekafiran dan kezaliman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. فَلَمَّا رَءَآ أَيْدِيَهُمْ لَا تَصِلُ إِلَيْهِ (Maka tatkala dilihatnya tangan mereka tidak menjamahnya) Yakni tangan mereka tidak menjamah daging sapi panggang itu sebagaimana orang yang akan memakan sesuatu. نَكِرَهُمْ(Ibrahim memandang aneh perbuatan mereka) Yakni Nabi Ibrahim merasa aneh dengan hal itu, ia mengira mereka datang membawa keburukan, karena adat istiadat kaumnya jika seorang tamu tidak memakan makanan yang disajikan akan dianggap sebagai orang yang datang dengan membawa keburukan. وَأَوْجَسَ مِنْهُمْ(dan merasakan dalam hatinya dari mereka) Yakni merasa dalam dirinya dari mereka. خِيفَةً ۚ(perasaan takut) Ketakutan dan kekhawatiran. إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمِ لُوطٍ (sesungguhnya kami adalah (malaikat-ma]aikat) yang diutus kepada kaum Luth) Kami adalah para malaikat yang diutus untuk mengazab mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Ketika menyaksikan bahwa tangan mereka tidak mengambil dan tidak memakan daging anak sapi tersebut atau makanan yang disajikan itu, Ibrahim menuduh mereka dan menganggap mereka bermaksud buruk, karena hal itu sudah merupakan adat kebiasaan. Dia merasakan ketakutan dan kekhawatiran muncul dalam dirinya. Mereka berkata kepadanya: “Janganlah takut kepada kami, kami adalah malaikat-malaikat yang diutus untuk mengazab kaum Luth”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika (Ibrahim) melihat tangan mereka tidak mencapainya} mencapai daging anak sapi itu {dia mencurigai} mencurigai hal tersebut dari mereka {dan memendam rasa takut kepada mereka} menyembunyikan rasa takut dalam dirinya tentang mereka {Mereka berkata,“Jangan takut. Sesungguhnya kami diutus kepada kaum Luth"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70 “maka tatkala dilihatnya tangan mereka tidak menjamahnya” yakni hidangan tersebut “Ibrahim mencurigai perbuatan mereka, dan merasa takut kepada mereka” Ibrahim mengira mereka hadir dengan tujuan buruk, itu sebelum dia mengetahui siapa mereka, maka mereka berkata “jangan kamu takut sesungguhnya kami adalah malaikat malaikat yang diutus kepada kaum luth” maksudnya, kami adalah utusan Allah, Allah mengutus kami untuk membinasakan kaum luth."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَا تَصِلُ إِلَيۡهِ) laa tashilu ilaihi : tidak bisa memegangnya kemudian memakannya. (نَكِرَهُمۡ) nakirahum : tidak mengenal mereka. (وَأَوۡجَسَ) wa aujasa : merasa takut. (لُوطٖ) luuth : anaknya Haran, saudara laki-laki Ibrahim. Makna ayat : (فَلَمَّا رَءَآ أَيۡدِيَهُمۡ لَا تَصِلُ إِلَيۡهِ) ketika melihat mereka tidak menyentuh makanan tersebut (وَأَوۡجَسَ مِنۡهُمۡ خِيفَةٗۚ) maka ia merasa takut kepada mereka, karena secara adat, jika seorang tamu singgah lalu dihidangkan makanan, tapi tidak mau memakannya, berarti ia punya maksud buruk, dan para malaikat tidak seperti itu. (قَالُواْ) mereka berkata kepadanya (لَا تَخَفۡ) “Janganlah takut.”, lalu menjelaskan maksud dari kedatangan mereka, (إِنَّآ أُرۡسِلۡنَآ إِلَىٰ قَوۡمِ لُوطٖ) “Kami diutus kepada kaum Luth.”, yaitu untuk menghancurkan mereka karena dosa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 70: Ia mengira bahwa mereka datang kepadanya dengan membawa keburukan atau hal yang tidak diinginkan, yang demikian ketika Beliau belum mengetahui tentang mereka. Untuk membinasakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 70",
    "description": "Ketika hidangan itu tersaji, nabi ibrahim menyodorkannya ke hadapan mereka seraya meminta agar hidangan itu dimakan. Maka ketika dilihatnya tangan mereka tidak menjamah hidangan yang disodorkannya itu, dia'nabi ibrahim'mencurigai perihal kedatangan mereka, dan merasa takut kepada mereka karena khawatir kedatangan mereka akan membawa berita buruk. Menyaksikan sikap nabi ibrahim yang demikian itu mereka para malaikat itu pun berkata, jangan takut, sesungguhnya kami diutus oleh Allah kepada kaum lut untuk membinasakan mereka. Ayat ini memberi pelajaran tentang etika bertamu, hendaknya memberi rasa tenteram dan tenang ketika bertamu, terutama ketika seseorang menaruh curiga dan takut terhadap orang yang belum dikenal, hendaknya tamu segera menjelaskan identitas dirinya. Dan istrinya, sarah, yang sedang berdiri dan mendengar perbincangan mereka, lalu dia pun tersenyum gembira mendengar hal tersebut dan hilanglah rasa takut dan curiga, maka kami sampaikan kepadanya kabar gembira tentang kelahiran seorang putra yang memiliki pengetahuan luas yang kelak akan diberi nama ishak dan setelah ishak kemudian akan lahir dari keturunannya seorang putra bernama yakub (lihat: surah adh-dhariyat/51: 28)."
  }
]