[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sedang istri Ibrahim, sarah, waktu itu berdiri di balik penutup tabir, mendengarkan pembicaraan. Kemudian dia tertawa gembira lantaran keajaiban yang dia dengarkan. Kemudian kami memberikan kabar gembira kepadanya melalui lisan malaikat itu bahwa sesungguhnya dia akan melahirkan dari suaminya, Ibrahim, seorang anak yang beranama ishaq, dan akan hidup bersama sang anak itu, dan dia akan memiliki cucu setelah ishaq, yaitu ya’qub."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Sementara istri Ibrahim, Sārah berdiri. Maka Kami sampaikan kabar gembira untuknya. Yaitu bahwa dia akan melahirkan Isḥāq. Dan Isḥāq akan mempunyai putra bernama Ya'qūb. Sārah langsung tersenyum dan menyambut gembira apa yang didengarnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Ketika itu istri Ibrahim, Sarah membantu Ibrahim menjamu tamu dari belakang tabir. Dia sangat senang ketika mendengar perkataan para malaikat kepada Ibrahim tentang Nabi Luth dan para pengikutnya akan diselamatkan dari azab, dan tentang kebinasaan orang-orang yang mendustakan dan berpaling dari dakwah Nabi Luth. Dan di saat dia merasakan kebahagiaan ini, para malaikat memberinya kabar gembira bahwa dia akan dikaruniai keturunan yang shalih yang bernama Ishaq, dan dari Ishaq akan lahir Ya’qub."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. وَامْرَأَتُهُۥ قَآئِمَةٌ (Dan isterinya berdiri) Ketika itu istrinya berdiri untuk melayani para tamu (malaikat) sedangkan nabi Ibrahim dalam keadaan duduk. Makna (الضحك) yakni tertawa. Dan pendapat lain mengatakan maknanya adalah istri Ibrahim mengalami haidh ketika itu juga padahal ia telah tua dan mandul, dan telah putus asa untuk bisa mengalami haidh. فَبَشَّرْنٰهَا بِإِسْحٰقَ (maka Kami sampaikan kepadanya berita gembira tentang (kelahiran) Ishak) Yang ia lahirkan untuk Nabi Ibrahim. ومن وراء إسحاق يعقوب (dan dari Ishak (akan lahir puteranya) Ya'qub) Kami juga memberinya kabar gembira bahwa Ishak akan memiliki anak bernama Ya’qub."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Dan istrinya, Sarah berdiri di balik satir mendengar pembicaraan mereka dan datangnya para malaikat. Lalu dia tertawa dengan bahagia sembari kekhawatirannya menghilang, dimana Kami memberinya kabar gembira tentang kelahiran Ishaq melalui lisan para malaikat. Dan Kami limpahkan kepadanya seorang cucu bernama Ya’kub setelah Ishaq."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Istrinya} Istri Ibrahim {berdiri, lalu tersenyum. Kemudian Kami menyampaikan kabar gembira kepadanya tentang Ishaq dan setelah} setelah {Ishaq ada Ya‘qub"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71 “dan istrinya berdiri (dibalik tirai)” melayani tamu. ”lalu dia tersenyum” takjub ketika mendengar kata kata mereka dan tugas yang mereka bawa. ”maka sampaikan kepadanya berita gembira tentang (kelahiran) ishak dan dari ishak (akan lahir putranya) ya’qub”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Pada saat itu istri Ibrahim berdiri di balik tirai, melayani mereka bersama Ibrahim, ketika mendengar kabar akan dihancurkannya kaum Luth, ia tertawa bahagia atas kehancuran orang-orang buruk. Lalu Allah memberikannya kabar gembira--melalui para malaikat—dengan Ishaq lalu setelahnya Ya’kub: seorang anak yang melahirkan cucu. Pelajaran dari ayat : • Kemuliaan keluarga keturunan Ibrahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 71: Istrinya, yaitu Sarah berdiri melayani mereka. Ketika mendengar tentang mereka dan untuk apa mereka datang. Yakni cucunya, yaitu Ya’qub akan lahir sedangkan Ibrahim masih hidup dan menyaksikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 71",
    "description": "Dan istrinya, sarah, yang sedang berdiri dan mendengar perbincangan mereka, lalu dia pun tersenyum gembira mendengar hal tersebut dan hilanglah rasa takut dan curiga, maka kami sampaikan kepadanya kabar gembira tentang kelahiran seorang putra yang memiliki pengetahuan luas yang kelak akan diberi nama ishak dan setelah ishak kemudian akan lahir dari keturunannya seorang putra bernama yakub (lihat: surah adh-dhariyat/51: 28). Mendengar kabar gembira tentang lahirnya seorang putra bernama ishak dalam kondisi mereka sudah lanjut usia, dia istri nabi ibrahim' sarah'berkata dengan nada keheranan sambil memukul wajah dengan jarinya seraya berkata, sungguh ajaib, mungkinkah aku akan melahirkan seorang anak padahal aku sudah tua, karena mustahil wanita seusiaku ini bisa hamil dan melahirkan seorang anak, dan lagi pula suamiku ini sudah sangat tua, untuk bisa memberikan keturunan' ini benar-benar sesuatu yang ajaib karena di luar kebiasaan yang ada (lihat: surah adz- dza'riya't/51: 29)."
  }
]