[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sarah berakata ketika diberi kabar gembira berupa ishaq dengan penuh keheranan, ”aneh, bagaimana aku akan memiliki anak sedang aku adalah wanita yang mandul sejak dulu, sementara suamiku sudah dalam periode masa tua dan usia lanjut? sesungguhnya melahirkan anak dari seorang wanita yang seperti keadaaanku dan keadaan suamiku yang sudah berusia lanjut benar-benar suatu perkara yang sangat mengherankan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Tatkala mendengar kabar gembira dari para malaikat itu Sarah sangat terkejut dan berkata, \"Bagaimana mungkin aku akan melahirkan anak, sedangkan usiaku sudah lanjut, dan suamiku pun sudah senja?!\" Sesungguhnya melahirkan anak pada usia seperti itu adalah sesuatu yang aneh dan tidak biasa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Namun kabar gembira ini membuatnya heran, bagaimana dia akan mengandung dan melahirkan padahal dia sudah tua. Dia berkata: “Sungguh mengherankan -ini adalah kalimat yang sering dikatakan para wanita jika terheran oleh susuatu-, Apakah aku akan melahirkan sedangkan aku sudah tua dan suamiku juga sudah tua! Ini sungguh sesuatu yang sangat aneh.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. قَالَتْ يٰوَيْلَتَىٰٓ (Isterinya berkata: “Sungguh mengherankan) Kalimat ini banyak sekali diucapkan oleh para wanita apabila datang kepada mereka sesuatu yang mengherankan mereka. ءَأَلِدُ وَأَنَا۠ عَجُوزٌ (apakah aku akan melahirkan anak padahal aku adalah seorang perempuan tua) Perempuan yang telah lanjut usia. Terdapat pendapat mengatakan umurnya ketika itu adalah 90 tahun. وَهٰذَا بَعْلِى شَيْخًا ۖ(dan ini suamikupun dalam keadaan yang sudah tua) Yakni suamiku Ibrahim adalah lelaki yang sudah tua yang sudah tidak dapat menghamili seorang wanita. Terdapat pendapat mengatakan umurnya ketika itu adalah 120 tahun. Istri yang diberi kabar gembira ini adalah istri yang bernama Sarah. Adapun nabi Ibrahim sebenarnya telah mendapat seorang anak dari istrinya yang lain bernama Hajar yang melahirkan nabi Ismail. Oleh sebab itu Sarah berharap mendapatkan seorang anak pula, namun umurnya telah lanjut. Dan akhirnya Allah memberinya kabar gembira ini lewat perantara para malaikat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Istri Ibrahim berkata: “Betapa mengejutkan dan mengagetkan, bagaimana bisa aku melahirkan sedangkan aku adalah perempuan tua berumur 70 tahun lebih dan suamiku ini sudah tua mencapai umur 100 tahun. Sesungguhnya kabar gembira ini adalah perkara yang aneh bahwa akan ada seorang anak dari dua orang tua yang sudah lanjut usia, Semua itu berdasarkan adat yang populer bukan berdasarkan pandangan ilahiyyah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Sungguh mengejutkan} sungguh mengejutkan {Mungkinkah aku akan melahirkan padahal aku sudah tua dan suamiku ini} suamiku {sudah renta} sudah tua dan mencapai usia senja {Sesungguhnya ini benar-benar sesuatu yang mengagumkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72 istri Ibrahim kaget dengan hal itu, dan “istrinya berkata ‘sungguh mengherankan, mungkinkah aku akan melahirkan anak padahal aku adalah seorang perempuan tua, dan ini suamiku pun dalam keadaan yang sudah tua pula?” kedua perkara ini menghalangi lahirnya anak. ”sesungguhnya ini benar benar suatu yang sangat aneh”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لُوطٖ) luuth : anaknya Haran, saudara laki-laki Ibrahim. (يَٰوَيۡلَتَىٰٓ) yaawailataa : aduhai, datanglah kemari, sudah waktunya engkau datang. (وَهَٰذَا بَعۡلِي شَيۡخًاۖ) wa haadza ba’lii syaikhaa : yaitu Ibrahim, suaminya. (إِنَّ هَٰذَا لَشَيۡءٌ عَجِيبٞ) Inna haadza lasyaiun ‘ajiib : ini adalah sesuatu yang menakjubkan, tidak mungkin Makna ayat : Ketika mendengar kabar gembira tersebut, ia memukul wajahnya keheranan—sebagaimana biasanya perempuan—lalu berkata, (يَٰوَيۡلَتَىٰٓ ءَأَلِدُ وَأَنَا۠ عَجُوزٞ وَهَٰذَا بَعۡلِي) \"Sungguh mengherankan, apakah aku akan melahirkan anak padahal aku adalah seorang perempuan tua, dan ini” yaitu suaminya, Ibrahim (شَيۡخًاۖ) lanjut usia, pada saat itu berumur 100 tahun, dan umurnya di atas 90 tahun. (إِنَّ هَٰذَا لَشَيۡءٌ عَجِيبٞ) aku melahirkan pada umur yang setua ini, ini adalah hal yang menakjubkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 72: Usiaku sudah 99 tahun. Ketika itu usianya sudah 100 tahun atau 120 tahun. Yakni lahir anak dari kedua orang yang sudah sangat tua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 72",
    "description": "Mendengar kabar gembira tentang lahirnya seorang putra bernama ishak dalam kondisi mereka sudah lanjut usia, dia istri nabi ibrahim' sarah'berkata dengan nada keheranan sambil memukul wajah dengan jarinya seraya berkata, sungguh ajaib, mungkinkah aku akan melahirkan seorang anak padahal aku sudah tua, karena mustahil wanita seusiaku ini bisa hamil dan melahirkan seorang anak, dan lagi pula suamiku ini sudah sangat tua, untuk bisa memberikan keturunan' ini benar-benar sesuatu yang ajaib karena di luar kebiasaan yang ada (lihat: surah adz- dza'riya't/51: 29). Mendengar pernyataan sarah, mereka para malaikat berkata, mengapa engkau merasa heran tentang ketetapan Allah' dia mahakuasa atas segala sesuatu, tak ada yang mengherankan dalam semua keputusannya. Itu adalah rahmat dan berkah Allah yang luas dan banyak, dicurahkan kepada kamu, wahai ahlulbait keluarga ibrahim! sesungguhnya Allah maha terpuji dalam nama, sifat, dan perbuatan-Nya, karena dia melimpahkan karunia banyak kepada hamba-Nya, lagi maha pengasih memiliki kedudukan tinggi, karena dialah zat yang memiliki keagungan dan kebesaran."
  }
]