[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para utusan itu berakat kepadanya, ”Apakah kamu merasa heran terhadap ketetapan Allah dan keputusanNya? rahmat Allah dan keberkahan-keberkahanNYa senantiasa tercurah pada kalian wahsi sekalian penghuni rumah kenabian. Sesungguhnya Allah maha terpuji sifat-sifat dan perbuatan-perbuatanNya, memiliki kemuliaan dan keagungan padanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Ketika Sarah terkejut dengan kabar gembira itu para Malaikat berkata, \"Apakah engkau terkejut dengan kada dan kadar Allah? Orang sepertimu pasti tahu bahwa Allah mampu mewujudkan hal itu. Semoga rahmat dan berkah dari Allah senantiasa dilimpahkan kepada kalian, wahai keluarga besar Ibrahim. Sesungguhnya Allah Maha Terpuji di dalam sifat-sifat dan tindakan-tindakan-Nya, lagi Maha Mulia dan Maha Tinggi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Para malaikat menjawab perkataan Sarah: “Apakah kamu heran terhadap keajaiban ini, padahal kamu berada dalam keluarga nabi, tempat turunnya wahyu dan rahmat? Keajaiban tidaklah sesuatu yang aneh bagi orang yang sudah terbiasa melihatnya. Kabar gembira ini merupakan rahmat Tuhan bagi kalian wahai Ahlul bait, dan ini tidaklah sesuatu yang sulit dilakukan Allah, karena Dia Maha Kuasa. Dan bentuk kuasa-Nya adalah meninggikan derajat para nabi dan kekasih-Nya, memberi mereka kenikmatan yang membuat mereka menjadi mulia dan memiliki derajat yang tinggi; dan Allah memuji kesabaran mereka, sehingga mereka menjadi terpuji dan mendapat pahala yang besar serta meraih kejayaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. قَالُوٓا۟ أَتَعْجَبِينَ مِنْ أَمْرِ اللهِ ۖ (Para malaikat itu berkata: “Apakah kamu merasa heran tentang ketetapan Allah?) Padahal tidak ada yang mustahil baginya. Para malaikat mengingkari keheranannya meskipun hal ini merupakan sesuatu yang tidak biasa karena Sarah merupakan istri seorang nabi, dan hal ini harusnya tidak sudah diketahui bahwa ini merupakan bagian dari kuasa Allah. وَبَرَكٰتُهُۥ (dan keberkatan-Nya) Makna (البركات) yakni pertambahan dan pertumbuhan. أَهْلَ الْبَيْتِ ۚ (ahlulbait) Wahai keluarga nabi, dan kamu wahai istri nabi. إِنَّهُۥ حَمِيدٌ(Sesungguhnya Allah Maha Terpuji) Yakni membalas pujian dari hamba-hamba-Nya. مَّجِيدٌ (lagi Maha Pemurah) Yang memiliki kemuliaan dan ketinggian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Para malaikat berkata: “Janganlah kamu terkejut dengan takdir, ketentuan dan hikmah Allah, sedangkan kamu ada di rumah datangnya wahyu kenabian sehingga tampak bagimu bahwa ini termasuk takdir-takdir Allah SWT. Sesungguhnya rahmat Allah yang luas dan nikmatNya yang banyak itu dilimpahkan kepadamu wahai keluarga baitun nubuwwah (rumah Ibrahim) Sesungguhnya Allah dipuji atas tindakan dan kebaikannya yang melimpah dan kepemilikanNya atas kemuliaan dan keluhuran”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} para malaikat berkata {“Apakah kamu merasa heran dengan ketetapan Allah} ketentuan dan takdir Allah {rahmat dan berkah Allah kepada kalian, wahai ahlul bait} ahlu bait Ibrahim {Sesungguhnya Dia Maha Terpuji} terpuji sifat dan tindakanNya {lagi Maha Mulia”} Dzat yang memiliki kagungan dan kemuliaan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73 “para malaikat itu berkata ’apakah kamu merasa heran tentang ketetapan Allah?” ketetapanNya tidaklah mengherankan karena keinginanNya pada segala sesuatu pasti terlaksana, tidak ada yang mengherankan sedikitpun pada kodratNya khususnya sesuatu yang Dia atur dan tetapkan untuk penghuni rumah yang penuh berkah ini ”itu adalah rahmat Allah dan keberkahanNya, terlimpahkan atas kalian hai ahlul bait” maksudnya, senantiasa rahmatNya, kebaikanNya dan keberkahanNya yang merupakan tambahan dari kebaikanNya dan turunnya kebaikan ilahi kepada hamba (semua itu) selalu di curahkan kepadamu hai ahlul bait. ”sesungguhnya Allah maha terpuji lagi maha pemurah” dzat yang sifat sifatNya terpuji karena sifat sifatNya adalah sifat kesempurnaan, Dzat yang perbuatanNya terpuji karena perbuatanNya adalah kebaikan, kemuliaan, kemurahan, hikmah dan keadilan serta keberimbangan. ”lagi maha pemurah”, al majdu adalah keagungan dan keluasan sifat, Dia memiliki sifat sifat kesempurnaan, dan Dia memiliki dari sifat sifat kesempurnaan itu sifat yang tersempurna dan terluas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : (قَالُوٓاْ أَتَعۡجَبِينَ مِنۡ أَمۡرِ ٱللَّهِۖ رَحۡمَتُ ٱللَّهِ وَبَرَكَٰتُهُۥ عَلَيۡكُمۡ أَهۡلَ ٱلۡبَيۡتِۚ) “Mereka berkata, apakah engaku merasa takjub atas keputusan Allah? Rahmat Allah atas kalian wahai Ahlal Bait.” Yaitu keluarga Ibrahim, (إِنَّهُۥ حَمِيدٞ) Maha Terpuji atas karunia-Nya dan nikmat-Nya atas kalian. (مَّجِيدٞ) Yang Maha Terpuji. Nama istri Ibrahim yang Allah berikan kabar gembira adalah Sarah anak paman Ibrahim ‘alahi salam. Kabar gembira ini diarahkan kepada Ibrahim, dan istrinya Sarah bersamanya, kabar gembira itu: hancurnya orang-orang zalim dan lahirnya Ishaq dan Ya’kub."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 73: Terlebih dalam hal tadbir (pengaturan dan pengurusan)-Nya untuk ahli bait yang diberkahi ini. Berkah artinya tambahan kebaikan dari Allah kepada hamba-Nya. Yakni ahli bait Ibrahim. Baik sifat maupun perbuatan-Nya. Karena sifat-Nya adalah sifat sempurna, dan perbuatan-Nya adalah ihsan, kepemurahan, baik, penuh hikmah, dan adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 73",
    "description": "Mendengar pernyataan sarah, mereka para malaikat berkata, mengapa engkau merasa heran tentang ketetapan Allah' dia mahakuasa atas segala sesuatu, tak ada yang mengherankan dalam semua keputusannya. Itu adalah rahmat dan berkah Allah yang luas dan banyak, dicurahkan kepada kamu, wahai ahlulbait keluarga ibrahim! sesungguhnya Allah maha terpuji dalam nama, sifat, dan perbuatan-Nya, karena dia melimpahkan karunia banyak kepada hamba-Nya, lagi maha pengasih memiliki kedudukan tinggi, karena dialah zat yang memiliki keagungan dan kebesaran. Setelah mendengar berita gembira dan penjelasan tentang maksud kedatangan para malaikat, maka ketika itu rasa takut pun hilang dari diri nabi ibrahim karena penjelasan para malaikat tentang maksud kedatangan mereka, dan kabar gembira akan kelahiran ishak dan yakub telah datang kepadanya, lalu dia pun berdiskusi dengan para malaikat kami tentang kaum nabi lut yang akan diazab oleh Allah."
  }
]