[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian ketika telah sirna dari Ibrahim rasa cemas yang sempat menggelayutinya dikarenakan para tamu tidak memakan hidangan, dan datang kepdanya kabar gembira dengan kehadiran ishaq dan ya’qub, dia terus bertukar pikiran dengan para utusan kami terkait misi yang kami mengutus mereka dengannya, yaitu menghukum kaum luth dan membinasakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Setelah rasa takut yang menyelimuti hatinya -karena melihat para tamunya tidak memakan hidangannya- itu hilang lalu tahu bahwa mereka adalah Malikat, dan mendapatkan kabar gembira bahwa dirinya akan memiliki putra bernama Isḥāq kemudian memiliki cucu bernama Ya'qūb, Ibrahim langsung berdebat dengan utusan-utusan (Malaikat-Malaikat) Kami tentang persoalan kaum Lūṭ. Dia berharap mereka menunda azab yang akan ditimpakan kepada kaum Lūṭ. Dan dia berharap mereka menyelamatkan Lūṭ dan keluarganya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Setelah ketakutan Ibrahim telah hilang, dan hatinya menjadi tenang dengan kabar gembira yang melapangkan dadanya dan menenangkan hatinya, maka kemudian Ibrahim meminta agar azab kaum Luth ditangguhkan, dengan harapan mereka mau bertaubat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. فَلَمَّا ذَهَبَ عَنْ إِبْرٰهِيمَ الرَّوْعُ (Maka tatkala rasa takut hilang dari Ibrahim) Yakni rasa takut yang ia dapati dalam dirinya. وَجَآءَتْهُ الْبُشْرَىٰ( dan berita gembira telah datang kepadanya) Berupa seorang anak. يُجٰدِلُنَا فِى قَوْمِ لُوطٍ (diapun bersoal jawab dengan (malaikat-malaikat) Kami tentang kaum Luth) Yakni Nabi Ibrahim memdebat utusan-utusan Kami dalam urusan kaum Luth, dengan harapan akan mendapat jalan untuk mengakhirkan turunnya azab kepada kaum Luth, dan supaya Nabi Luth dan keluarganya mereka selamatkan dari azab, sebagaimana disebutkan dalam surat al-Ankabut: قال إن فيها لوطا، قالوا نحن أعلم بمن فيها لننجينه وأهله “Ibrahim berkata, “Sesungguhnya di kota itu ada Luth.” Mereka (para malaikat) berkata, “Kami lebih mengetahui siapa yang ada di kota itu. Kami pasti akan menyelamatkan dia dan pengikut-pengikutnya”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Ketika kekhawatiran Ibrahim hilang setelah mengetahui bahwa mereka adalah malaikat yang memberikan kabar gembira kepadanya tentang Ishaq, dia bertanya kepada utusan-utusan Kami tentang perkara kaum Luth agar azab terhadap mereka ditunda, barangkali mereka mau beriman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka ketika telah hilang dari Ibrahim rasa takut} rasa takut {dan telah datang kabar gembira kepadanya, dia bermujadalah dengan Kami} berdiskusi dengan utusan-utusan Kami {tentang kaum Luth"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74 “maka ketika rasa takut hilang dari Ibrahim” ketakutan yang menghinggapinya karena tamu tamunya, ”dan berita gembira telah datang kepadanya” yaitu berita kelahiran anak, maka Ibrahim pada saat itu beralih kepada tema dialog kerasulan (dengan para malaikat itu) tentang dibinasakannya umat luth, dia berkata kepada mereka ”sesungguhnya di kota itu ada luth” para malaikat berkata ”kami lebih mengetahui siapa yang ada di kota itu. Kami sungguh sungguh akan menyelamatkan dia dan pengikut pengikutnya kecuali istrinya”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلرَّوۡعُ) ar-rau’u : Rasa cemas dan takut. (ٱلۡبُشۡرَىٰ) al-busyraa : kabar yang mengembirakan dan menyenangkan. (يُجَٰدِلُنَا) yujaadilunaa : mendebat Kami. (فِي قَوۡمِ لُوطٍ) fii qaumi luuth : perkara penghancuran kaum Luth. Luth—rasul Allah—bin Haran anak paman Ibrahim. Makna ayat : Ayat-ayat ini masih mengkisahkan tentang kabar gembira Ibrahim, Allah berfirman (فَلَمَّا ذَهَبَ عَنۡ إِبۡرَٰهِيمَ ٱلرَّوۡعُ) “Maka tatkala rasa takut hilang dari Ibrahim” takut dan khawatir kepada malaikat. (وَجَآءَتۡهُ ٱلۡبُشۡرَىٰ) Berita gembira dengan seorang anak dan kehancuran kaum Luth, mulai mendebat para malaikat dalam perkara kaum Luth, karena diantara mereka ada orang-orang mukmin. (قَالَ إِنَّ فِيهَا لُوطٗاۚ) Ibrahim berkata,”Sesungguhnya di antara mereka ada Luth” [Al-‘Ankabut:32] Mereka menjawab, sebagaimana yang Allah kabarkan pada surat Al-‘Ankabut (نَحۡنُ أَعۡلَمُ بِمَن فِيهَاۖ لَنُنَجِّيَنَّهُۥ وَأَهۡلَهُۥٓ إِلَّا ٱمۡرَأَتَهُۥ كَانَتۡ مِنَ ٱلۡغَٰبِرِينَ) [Al-‘Ankabut:32] “Kami lebih mengetahui dengan siapa yang ada di dalamnya. Kami pasti akan menyelamatkannya dan keluarganya, kecuali istrinya, ia termasuk ke dalam orang-orang yang tertinggal.” Pelajaran dari ayat : • Bolehnya membela orang yang masih diharapkan untuk menjadi baik, namun tidak boleh ketika perkara tersebut sudah naik ke meja pengadilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 74",
    "description": "Setelah mendengar berita gembira dan penjelasan tentang maksud kedatangan para malaikat, maka ketika itu rasa takut pun hilang dari diri nabi ibrahim karena penjelasan para malaikat tentang maksud kedatangan mereka, dan kabar gembira akan kelahiran ishak dan yakub telah datang kepadanya, lalu dia pun berdiskusi dengan para malaikat kami tentang kaum nabi lut yang akan diazab oleh Allah. Diskusi nabi ibrahim dengan malaikat itu didorong oleh rasa santun dan ibanya kepada manusia. Dan sesungguhnya nabi ibrahim adalah sosok orang yang benar-benar penyantun, yakni penyabar dan tidak tergesa-gesa dalam bertindak. Karenanya ia berharap agar azab itu tidak segera diturunkan kepada kaum nabi lut, agar ada kesempatan untuk mereka bertobat. Nabi ibrahim pun pengiba lantaran rasa takutnya ketika menghadap Allah dan munculnya rasa khawatir akan murka Allah dengan menurunkan azab terhadap orang yang berbuat salah, dan dia suka kembali kepada Allah dengan menyerahkan segala urusan hanya kepada-Nya."
  }
]