[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Ibrahim sangatlah penyantun, tidak suka disegerakan turunnya siksaan, banyak menundukan diri kepada Allah dan berdoa kepadaNya, bertaubat kembali kepada Allah dalam seluruh urusannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Sesungguhnya Ibrahim adalah seorang yang lembut, suka menunda hukuman, gemar menundukkan dirinya kepada Tuhan, banyak berdoa kepada Allah dan rajin bertobat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Allah menegaskan kelembutan dan kesabaran Nabi Ibrahim, serta sifatnya yang senantiasa tunduk dan merasa kurang maksimal dalam berdakwah. Allah Maha mengetahui rasa kasih sayang dan kelembutan yang ada dalam hati Ibrahim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. إِنَّ إِبْرٰهِيمَ لَحَلِيمٌ (Sesungguhnya Ibrahim itu benar-benar seorang yang penyantun) Yakni orang yang tidak suka tergesa-gesa dalam berbagai urusan. Makna (الأواه) yakni banyak bermunajat. Dan makna (المنيب) yakni orang yang kembali kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu 'Abbas berkata : sifat penyayang yang diridhoi oleh Allah, mendatangkan bagi pemiliknya kehormatan di dunia dan di akhirat, bukankah Allah berfirman tentang pujian-Nya kepada kekasih-Nya Ibrahim : { إِنَّ إِبْرَاهِيمَ لَحَلِيمٌ أَوَّاهٌ مُنِيبٌ } \"Sesungguhnya Ibrahim itu benar-benar seorang yang penyantun lagi penghiba dan suka kembali kepada Allah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Sesungguhnya Ibrahim itu sangat sabar, sehingga dia tidak tergesa-gesa dalam memohon hukuman, selalu memohon kepada Allah, dan takut kepada Allah dan manusia, serta selalu menyerahkan setiap urusannya kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Ibrahim benar-benar penyantun, pengiba} sangat tunduk kepada Allah dan berdoa kepadaNya {dan suka kembali kepada Allah} bertaubat kembali kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75 ”sesungguhnya Ibrahim itu benar benar seorang yang penyantun” yakni pemilik akhlak yang baik, dada yang lapang dan tidak marah ketika terjadi kejahilan dari orang orang yang jahil. ”lagi penghiba” yakni orang yang merendahkan diri kepada Allah dalam setiap waktu, ”dan suka kembali kepada Allah” dengan mengetahuiNya, mencintaiNya, menghadap kepadaNya dan berpaling dari selainNya. Oleh karena itu dia mendebat orang yang ditetapkan binasa oleh Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (َحَلِيمٌ أَوَّٰهٞ) haliimun awwaah : al-Haliim maknanya yang tidak langsung menghukum dan al-Awwaah artinya hatinya lembut Makna ayat : Firman-Nya : (إِنَّ إِبۡرَٰهِيمَ لَحَلِيمٌ أَوَّٰهٞ مُّنِيبٞ) Menjelaskan sebab Nabi Ibrahim mendebat para malaikat, karena Ibrahim adalah orang yang lembut hatinya, tidak tergesa-gesa, tidak ingin agar mereka segera disiksa, lantas memohon penangguhan azab agar mereka punya waktu untuk bertaubat. Arti awwaah adalah rendah hati, taat, banyak mengatakan ‘Ah’ ketika ada sesuatu yang menyulitkan, dan muniiban yaitu sering bertaubat dan kembali kepada Allah di setiap waktu. Pelajaran dari ayat : • Keutamaan lemah lembut. • Keutamaan kembali kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 75: Yakni berakhlak mulia, lapang dada, dan tidak lekas marah karena ada tindakan bodoh orang-orang yang bodoh. Selalu merendahkan diri kepada Allah di setiap waktu. Yakni sering kembali kepada Allah dengan mengenali-Nya dan mencintai-Nya, serta menghadapkan diri kepada-Nya, dan berpaling dari selain-Nya. Oleh karena itu, dia bersoal jawab tentang orang-orang yang akan dibinasakan Allah. Disebutkan, bahwa Ibrahim berkara kepada para malaikat itu, “Apakah kamu hendak membinasakan negeri yang di sana terdapat 300 orang mukmin? Mereka menjawab, “Tidak.” Ibrahim berkata lagi, “Apakah kamu hendak membinasakan negeri yang di sana terdapat 200 orang mukmin?” Mereka menjawab, “Tidak.” Ibrahim berkata, “Apakah kamu hendak membinasakan negeri yang di sana terdapat 40 orang mukmin?” Mereka menjawab, “Tidak.” Ibrahim berkata lagi, “Apakah kamu hendak membinasakan negeri yang di sana terdapat 14 orang mukmin?” Mereka menjawab, “Tidak.” Ibrahim berkata, “Bagaimana jika di sana terdapat seorang mukmin?” Mereka menjawab, “Tidak.” Ibrahim berkata, “Di sana terdapat Luth.” Mereka berkata, “Kami lebih tahu tentang siapa yang ada di sana…dst.” Ketika soal-jawab dilakukan cukup lama, maka para malaikat berkata seperti yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 75",
    "description": "Diskusi nabi ibrahim dengan malaikat itu didorong oleh rasa santun dan ibanya kepada manusia. Dan sesungguhnya nabi ibrahim adalah sosok orang yang benar-benar penyantun, yakni penyabar dan tidak tergesa-gesa dalam bertindak. Karenanya ia berharap agar azab itu tidak segera diturunkan kepada kaum nabi lut, agar ada kesempatan untuk mereka bertobat. Nabi ibrahim pun pengiba lantaran rasa takutnya ketika menghadap Allah dan munculnya rasa khawatir akan murka Allah dengan menurunkan azab terhadap orang yang berbuat salah, dan dia suka kembali kepada Allah dengan menyerahkan segala urusan hanya kepada-Nya. Kemudian para malaikat berkata, wahai ibrahim! tinggalkanlah perbincangan ini, yaitu agar azab kaum nabi lut ditunda, karena sungguh, ketetapan tuhanmu untuk membinasakan kaum nabi lut telah datang. Dia lebih tahu perihal keadaan mereka, dan mereka itu akan ditimpa azab yang tidak dapat ditolak oleh siapa pun. Apabila Allah membuat suatu ketetapan untuk mengazab suatu kaum yang membangkang terhadap utusan-Nya, maka tidak ada satu pun yang dapat menolak ketetapan itu."
  }
]