[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para utusan Allah berakata, ”wahai ibrahim, hentikanlah perdebatan ini terkait perkara kaum luth dan beriba kepada mereka, karena sesungguhnya telah pasti pada mereka siksaan dan telah telah datang ketetapan Allah yang telah ditakdirkanNYa pada mereka untuk membinasakan mereka. Dan sesungguhnya pada mereka akan turun siksaan dari Allah, tanpa dapat disingkirkan dari mereka dan ditolak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Para Malaikat berkata, \"Wahai Ibrahim! Hentikanlah perdebatan tentang kaum Lūṭ ini. Karena perintah Tuhanmu telah datang untuk menimpakan azab yang telah Dia tetapkan untuk mereka. Sesungguhnya kaum Lūṭ itu akan ditimpa azab yang sangat besar. Dan azab itu tidak mungkin ditolak dengan perdebatan maupun doa.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Hai Ibrahim, Janganlah kamu membahas hal ini lagi, karena ketetapan Allah pasti akan terlaksana, dan azab-Nya pasti akan diturunkan dan tidak mungkin ditunda lagi sebagai balasan atas kekafiran dan kesesatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. يٰٓإِبْرٰهِيمُ أَعْرِضْ عَنْ هٰذَآ ۖ (Hai Ibrahim, tinggalkanlah soal jawab ini) Tinggalkanlah perdebatan dalam urusan yang telah diputuskan ini, dan siap untuk dilaksanakan. إِنَّهُۥ قَدْ جَآءَ أَمْرُ رَبِّكَ ۖ( sesungguhnya telah datang ketetapan Tuhanmu) Dengan azab-Nya yang telah ditetapkan atas mereka dan telah ditulis ketentuannya. وَإِنَّهُمْ ءَاتِيهِمْ عَذَابٌ غَيْرُ مَرْدُودٍ(dan sesungguhnya mereka itu akan didatangi azab yang tidak dapat ditolak) Yakni tidak dapat ditolak dengan doa atau perdebatan, karena azab ini pasti akan ditimpakan atas mereka, tidak mungkin dialihkan atau ditolak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Para malaikat berkata: “Wahai Ibrahim, hindarilah untuk mendebat perkara yang sudah ditentukan. Sesungguhnya Tuhanmu telah mendatangkan azabNya. Dia lebih tahu tentang keadaan mereka. Dan akan datang kepada mereka azab yang tidak bisa dihalang-halangi dengan perdebatan, doa atau semacamnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Ibrahim, berpalinglah dari ini} diskusi ini {Sesungguhnya benar-benar telah datang keputusan Tuhanmu. Sesungguhnya mereka akan ditimpa azab yang tidak dapat ditolak”} dialihkan dari mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76 dikatakan kepada Ibrahim ”hai Ibrahim, tinggalkanlah Tanya jawab ini\", yakni berdebat. \"sesungguhnya telah datang ketetapan Rabbmu” untuk membinasakan mereka. ”dan sesungguhnya mereka itu didatangi azab yang tidak dapat di tolak” sehingga debatmu tidak berguna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَعۡرِضۡ عَنۡ هَٰذَآۖ) a’ridh ‘an haadza : janganlah engkau berdebat dalam perkara kaum Luth. (غَيۡرُ مَرۡدُودٖ) ghairu mardud : tidak ada yang bisa menolaknya, karena Allah telah menetapkan sesuatu, dan pasti akan terjadi. Makna ayat : Ketika Ibrahim mendesak dan mendebat para malaikat, mereka berkata (يَٰٓإِبۡرَٰهِيمُ أَعۡرِضۡ عَنۡ هَٰذَآۖ) “Wahai Ibrahim, berpalinglah engkau darinya—berdebat (إِنَّهُۥ قَدۡ جَآءَ أَمۡرُ رَبِّكَۖ) telah datang ketetapan dari Allah agar menghancurkan kaum tersebut. (وَإِنَّهُمۡ ءَاتِيهِمۡ عَذَابٌ غَيۡرُ مَرۡدُودٖ ) akan datang kepada mereka azab yang tidak akan tertolak. Inilah yang akan disebutkan pada ayat selanjutnya. Pelajaran dari ayat : • Ketentuan Allah tidak akan tertolak, apa yang Allah gariskan pasti terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 76",
    "description": "Kemudian para malaikat berkata, wahai ibrahim! tinggalkanlah perbincangan ini, yaitu agar azab kaum nabi lut ditunda, karena sungguh, ketetapan tuhanmu untuk membinasakan kaum nabi lut telah datang. Dia lebih tahu perihal keadaan mereka, dan mereka itu akan ditimpa azab yang tidak dapat ditolak oleh siapa pun. Apabila Allah membuat suatu ketetapan untuk mengazab suatu kaum yang membangkang terhadap utusan-Nya, maka tidak ada satu pun yang dapat menolak ketetapan itu. Setelah para malaikat utusan Allah menyampaikan berita kepada nabi ibrahim, kemudian para malaikat yang menyamar sebagai orang laki-laki tampan itupun bertamu ke rumah nabi lut, sebagaimana dijelaskan berikut ini. Dan ketika para utusan kami, yakni para malaikat itu datang kepada nabi lut, dia merasa curiga atas kedatangannya dan dadanya merasa sempit karena kehadiran-Nya akan menarik perhatian kaumnya sehingga khawatir akan diganggu oleh mereka. Kemudian dia nabi lut berkata, sungguh, ini adalah hari yang sangat sulit, karena nabi lut tidak bisa menolak kehadiran tamunya yang rupawan, dan nabi lut merasa tidak sanggup melindungi mereka jika mendapat gangguan dari kaumnya."
  }
]