[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika malaikat-malaikat datang kepada luth, kedatangan mereka menyusahkan luth dan dia menjadi gelisah karena itu. Sebab, dia belumlah tahu bahwa mereka itu adalah utusan-utusan Allah, sehingga mengkhawatirkan mereka dari kaumnya. Dan dia berkata, ”ini adalah hari cobaan dan kesulitan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Dan tatkala para Malaikat itu datang kepada Lūṭ dalam wujud laki-laki, Lūṭ merasa sedih dan dadanya terasa sesak karena khawatir terhadap kaumnya yang gemar menyalurkan syahwatnya dengan sesama laki-laki bukan dengan wanita. Maka Lūṭ berkata, \"Ini adalah hari yang sangat sulit.\" Karena dia mengira bahwa kaumnya akan menyerangnya untuk mendapatkan tamu-tamunya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Ketika para malaikat meninggalkan Ibrahim dan pergi ke negeri Sodom dengan menyerupa sebagai manusia, mereka bertemu dengan Nabi Luth, kemudian dia menjamu mereka dengan penuh kekhawatiran kaumnya akan mengganggu mereka, Nabi Luth benar-benar dalam situasi yang sulit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَلَمَّا جَآءَتْ رُسُلُنَا لُوطًا (Dan tatkala datang utusan-utusan Kami (para malaikat) itu kepada Luth) Setalah para malaikat keluar dari perjamuan nabi Ibrahim –dan jarak antara nabi Ibrahim dengan negeri nabi Luth beberapa farsakh— mereka kemudian mendatangi nabi Luth dengan menyerupa sebagai para tamu. سِىٓءَ بِهِمْ(ia merasa susah) Ketika mereka mendatangi nabi Luth, ia merasa susah dengan kedatangan ini. وَضَاقَ بِهِمْ ذَرْعًا (dan merasa sempit dadanya karena kedatangan mereka) Dadanya terasa sempit karena khawatir atas mereka dari kaumnya, sebab ia tau kefasikan kaumnya dan perbuatan keji mereka yaitu suka mendatangi sesama jenis. وَقَالَ هٰذَا يَوْمٌ عَصِيبٌ (dan dia berkata: “Ini adalah hari yang amat sulit) Nabi Luth mengetahui bahwa ia harus mencegah kaumnya dari kebiasaan keji mereka, dan ia merasa akan dikalahkan oleh kaumnya ketika membela para tamunya dan tidak mampu melawan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "77-78 1 ). Diantara hari-hari yang amat sulit bagi orang-orang shalih adalah hari yang di dalamnya orang-orang berbuat maksiat. 2 ). Awal mula seseorang melakukan kemaksian (umumnya) dengan ragu-ragu dan ada rasa takut dalam dirinya; sampai ketika kemaksiatan itu terus berlanjut, dan akhirnya ia akan dengan segera melakukannya tanpa ketakutan apapun, perhatikan ayat ini : { جَاءَهُ قَوْمُهُ يُهْرَعُونَ إِلَيْهِ وَمِنْ قَبْلُ كَانُوا يَعْمَلُونَ السَّيِّئَاتِ } \"Dan datanglah kepadanya kaumnya dengan bergegas-gegas. Dan sejak dahulu mereka selalu melakukan perbuatan-perbuatan yang keji\". 3 ). Jika kita mengamati ayat ini secara seksama : { أَلَيْسَ مِنْكُمْ رَجُلٌ رَشِيدٌ } \"Tidak adakah di antaramu seorang yang berakal?\" kita akan mengetahui bahwa kecanduan pada perbuatan keji, selain melemahkan iman ia juga mengilangkan harga diri seseorang, dan ia akan membinasakan akhlaq yang tersisisa dari diri seseorang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Dan ketika para malaikat datang kepada Luth dalam wujud pemuda yang tampan setelah meninggalkan Ibrahim. Dan jarak antara Ibrahim dan Luth itu beberapa farsakh, kedatangan mereka membuat Ibrahim bersedih. Dadanya sesak karena bersedih melihat mereka (Luth dan keluarganya) dalam keadaan seperti itu, dan mengkhawatirkan mereka dari kaumnya yang fasik dan tidak normal karena melakukan praktek homo seksual. Dia berkata dalam dirinya: “Hari ini adalah hari yang sangat menyakitkan, dan penuh dengan permasalahan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika telah datang para utusan Kami kepada Luth, dia merasa gundah tentang mereka} dia merasakan hal buruk dengan kedatangan mereka {dan dadanya} dadanya {terasa sempit karena mereka. Dia berkata,“Ini adalah hari yang sangat sulit”} sangat buruk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77 “dan tatkala datang utusan utusan kami (para malaikat) itu” para malaikat yang sebelumya hadir kepada Ibrahim, ketika mereka datang kepada “luth, dia merasa susah” yakni kedatangan mereka dan dia berkata ‘ini adalah hari yang amat sulit” yakni benar benar sulit karena dia tahu pasti bahwa kaumnya tidak membiarkan mereka, karena mereka hadir dalam bentuk pemuda yang mulus tak berkumis dan berjanggut dan sangat tampan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (سِيٓءَ بِهِمۡ) sii’a bihim : menjadi sedih dan risau karena kedatangan mereka. (وَضَاقَ بِهِمۡ ذَرۡعٗا) wa dhaaqa bihim dzar’aa : merasa keberatan terhadap suatu perkara. (يَوۡمٌ عَصِيبٞ) yaumun ‘ashiib : hari yang berat Makna ayat : Ini adalah prolog dari kisah Luth bersama para malaikat dan kaumnya. Allah berfirman (وَلَمَّا جَآءَتۡ رُسُلُنَا) yaitu tamu Ibrahim ‘alaihi salam (لُوطٗا سِيٓءَ بِهِمۡ) “dia merasa susah dan merasa sempit dadanya karena kedatangan mereka” merasa khawatir dari orang-orang jahat kaumnya. (وَقَالَ هَٰذَا يَوۡمٌ عَصِيبٞ) ini adalah hari yang sulit, karena bisa terjadi sesuatu hal yang dapat menyeret tamunya kepada kehinaan, sedangkan dia berada di tengah-tengah kaumnya. Ini inti dari ayat 77. Pelajaran dari ayat : • Keutamaan memuliakan tamu dan menjaganya dari segala jenis keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 77: Nabi Luth ‘alaihis salam merasa kesusahan ketika kedatangan utusan-utuaan Allah itu karena mereka berupa pemuda yang rupawan dan datang sebagai tamu, sedangkan kaum Luth sangat menyukai pemuda-pemuda yang rupawan untuk melakukan homoseksual. Nabi Luth merasa tidak sanggup melindungi mereka apabila ada gangguan dari kaumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 77",
    "description": "Setelah para malaikat utusan Allah menyampaikan berita kepada nabi ibrahim, kemudian para malaikat yang menyamar sebagai orang laki-laki tampan itupun bertamu ke rumah nabi lut, sebagaimana dijelaskan berikut ini. Dan ketika para utusan kami, yakni para malaikat itu datang kepada nabi lut, dia merasa curiga atas kedatangannya dan dadanya merasa sempit karena kehadiran-Nya akan menarik perhatian kaumnya sehingga khawatir akan diganggu oleh mereka. Kemudian dia nabi lut berkata, sungguh, ini adalah hari yang sangat sulit, karena nabi lut tidak bisa menolak kehadiran tamunya yang rupawan, dan nabi lut merasa tidak sanggup melindungi mereka jika mendapat gangguan dari kaumnya. Dan tak lama setelah tamu itu tiba, maka kaumnya pun segera datang kepadanya dan bermaksud melakukan perbuatan keji terhadap tamu nabi lut itu. Dan memang sejak dahulu mereka selalu melakukan perbuatan keji itu, yaitu menyukai sesama laki-laki. Menyaksikan tingkah laku mereka, nabi lut berkata, wahai kaumku! inilah putriputriku yang ada di negeri ini yang sudah kamu kenal, mereka lebih suci bagimu untuk kamu jadikan sebagai istrimu, maka bertakwalah kepada Allah agar terhindar dari murka-Nya, dan janganlah kamu mencemarkan nama baikku dengan melakukan perbuatan keji dan jahat terhadap tamuku ini. Tidak adakah di antaramu orang yang pandai dan menggunakan akalnya untuk berpikir mana perbuatan yang baik dan mana perbuatan yang buruk, serta berusaha menghindari segala bentuk perbuatan munkar'."
  }
]