[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kaum luth datang dengan berjalan cepat menuju kepadanya untuk meminta kesempatan melakukan perbuatan keji. Dan mereka itu, sebelum kedatangan mereka, memang suka mendatangi sesama lelaki demi melampiaskan syahwat mereka, bukan kepada kaum wanita. Maka luth berkata kepada kaumnya, ”putri-putriku itu, silahkan nikahilah mereka, mereka lebih suci bagi kalian daripada apa yang kalian inginkan. luth menyebut wanita-wanita sebagai putri-putrinya, lantaran seorang nabi yang diutus ke suatu umat, berposisi sebagai ayah bagi kaumnya. ”takutlah kalian kepada Allah dan hindarilah siksaanNYa. Dan jangalah kalian mempermalukan aku dengan berlaku melampaui batas terhadap tamu-tamuku. Bukanlah pada kalian ada orang yang berpikiran normal, yang akan melarang orang yang hendak berbuat keji, lalu menghalang-halangi mereka dari perbuatan buruk tersebut karena meremehkan tamu adalah perbuatan memalukan yang tidak dilakukan kecuali oleh orang-orang yang dungu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Tiba-tiba kaum Lūṭ berdatangan ke rumah Lūṭ dengan tergopoh-gopoh. Mereka ingin melampiaskan syahwat mereka kepada tamu-tamunya. Dan sebelum itu mereka memiliki kebiasaan menyalurkan hasrat seksual mereka dengan sesama lelaki bukan dengan wanita. Lūṭ menolak keinginan kaumnya itu dan membela dirinya di hadapan tamu-tamunya, dia mengatakan, \"Wahai kaumku! Mereka adalah putri-putriku yang merupakan bagian dari wanita-wanita kalian, maka nikahilah mereka! Karena wanita-wanita itu lebih suci bagi kalian daripada melakukan perbuatan keji (homoseksual). Takutlah kalian kepada Allah! Jangan mempermalukan aku di depan tamuku! Tidak adakah di antara kalian orang waras yang bisa melarang kalian melakukan perbuatan yang keji itu?!\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Ketika kaum Nabi Luth mendengar adanya tamu-tamu di rumah Nabi Luth, mereka segera mendatangi rumahnya dengan saling mendorong. Kedatangan mereka ke rumah Nabi Luth dengan dosa-dosa dan kemaksiatan yang dahulu mereka lakukan, seakan-akan menjadi bencana besar bagi mereka. Nabi Luth mengetahui tujuan buruk yang ingin dilakukan kaumnya, dan yakin mereka benar-benar ingin merealisasikan tujuan mereka; maka Nabi Luth menawarkan mereka anak-anak perempuannya yang masih gadis untuk membangkitkan fitrah mereka, sehingga mereka mau menikahi anak-anak perempuannya secara halal dan meninggalkan kebiasaan buruk mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. وَجَآءَهُۥ قَوْمُهُۥ يُهْرَعُونَ إِلَيْهِ (Dan datanglah kepadanya kaumnya dengan bergegas-gegas) Mereka datang kepadanya dengan segera. Terdapat pendapat mengatakan mereka berjalan dengan cepat dan memaksa untuk meminta agar dapat berbuat keji dengan para tamunya. وَمِن قَبْلُ كَانُوا۟ يَعْمَلُونَ السَّيِّـَٔاتِ ۚ( Dan sejak dahulu mereka selalu melakukan perbuatan-perbuatan yang keji) Yakni kebiasaan mereka adalah mendatangi sesama lelaki. Ketika mereka telah sampai di rumah Nabi Luth dan ingin berbuat keji dengan para tamunya, Nabi Luth berdiri menuju kaumnya untuk membela para tamu itu. قَالَ يٰقَوْمِ هٰٓؤُلَآءِ بَنَاتِى هُنَّ أَطْهَرُ لَكُمْ ۖ( Luth berkata: “Hai kaumku, inilah puteri-puteriku, mereka lebih suci bagimu) Nabi Luth ingin mencegah mereka dengan sesuatu yang lebih sedikit mudharatnya karena ia tidak memiliki cara lain. Terdapat pendapat mengatakan yang dimaksud adalah nikahilah putri-putriku. Pendapat lain mengatakan yang dimaksud Nabi Luth ketika mengatakan “inilah putri-putriku” adalah para wanita secara umum, karena seorang nabi adalah ayah bagi seluruh kaumnya. Pendapat lain mengatakan perkataan nabi Luth ini adalah sebagai cara saja untuk mencegah mereka, agar mereka pergi dari para tamunya, dan tidak bermaksud benar-benar menawarkan putri-putrinya. هن أطهر لكم (mereka lebih suci bagimu) Yakni lebih halal dan suci. وَلَا تُخْزُونِ فِى ضَيْفِىٓ (dan janganlah kamu mencemarkan (nama)ku terhadap tamuku ini) Yakni bertakwalah kepada Allah dengan meninggalkan keinginan kalian untuk berbuat keji dengan mereka, dan janganlah mengundang aib bagiku di depan para tamuku. أَلَيْسَ مِنكُمْ رَجُلٌ رَّشِيدٌ (Tidak adakah di antaramu seorang yang berakal?) Yang mengarahkan dan melarang kalian agar meninggalkan perbuatan keji ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "77-78 1 ). Diantara hari-hari yang amat sulit bagi orang-orang shalih adalah hari yang di dalamnya orang-orang berbuat maksiat. 2 ). Awal mula seseorang melakukan kemaksian (umumnya) dengan ragu-ragu dan ada rasa takut dalam dirinya; sampai ketika kemaksiatan itu terus berlanjut, dan akhirnya ia akan dengan segera melakukannya tanpa ketakutan apapun, perhatikan ayat ini : { جَاءَهُ قَوْمُهُ يُهْرَعُونَ إِلَيْهِ وَمِنْ قَبْلُ كَانُوا يَعْمَلُونَ السَّيِّئَاتِ } \"Dan datanglah kepadanya kaumnya dengan bergegas-gegas. Dan sejak dahulu mereka selalu melakukan perbuatan-perbuatan yang keji\". 3 ). Jika kita mengamati ayat ini secara seksama : { أَلَيْسَ مِنْكُمْ رَجُلٌ رَشِيدٌ } \"Tidak adakah di antaramu seorang yang berakal?\" kita akan mengetahui bahwa kecanduan pada perbuatan keji, selain melemahkan iman ia juga mengilangkan harga diri seseorang, dan ia akan membinasakan akhlaq yang tersisisa dari diri seseorang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Datanglah kaum Luth bergegas menghampirinya dengan menggedor-gedor pintu agar mereka bisa mempraktekkan kekejian bersama tamu Luth, yaitu kebiasaan mereka sebelumnya yaitu mendatangi laki-laki. Luth berkata kepada mereka: “Itulah puteri-puteriku, nikahilah mereka, karena nabi suatu kaum itu ayah bagi orang-orang yang beriman kepadanya, puteri-puteriku itu lebih halal dan suci. Bertakwalah kepada Allah dengan meninggalkan kekejian dan takut dengan hukumanNya. Janganlah kalian mendobrak rumahku untuk bertemu tamu-tamuku. Tidakkah di antara kalian ada laki-laki yang sadar, berakal, mendapatkan petunjuk menuju kebenaran, berlindung dari keburukan, serta mencegah kemungkaran?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kaumnya datang dengan bergegas} dengan cepat-cepat {kepadanya. Sebelumnya mereka selalu melakukan perbuatan-perbuatan keji. Luth berkata} Luth berkata kepada mereka {“Wahai kaumku, ini adalah putri-putriku} putri-putri kaumku {Mereka lebih suci} boleh {bagi kalian. Maka bertakwalah kepada Allah dan janganlah kalian mencemarkan (nama)-ku} mencemarkanku {di hadapan tamuku. Apakah tidak ada di antara kalian orang yang berakal sehat”} mendapat petunjuk menuju kebenaran dan terpelihara dari perbuatan keji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78 oleh karena itu, apa yang terlintas dibenaknya benar benar terjadi maka “datanglah kepadanya kaumnya dengan bergegas gegas” yakni dengan cepat dan tergesa gesa menginginkan perbuatan keji yang mereka lakukan kepada tamu tamunya. Oleh karena itu, Allah berfirman “dan sejak dahulu mereka selalu melakukan perbuatan perbuatan yang keji” yaitu perbuatan keji yang tidak seorang pun didunia ini yang mendahului mereka dalam hal tersebut. ”luth berkata ’hai kaumku, inilah putri putri (negeri) ku, mereka lebih suci bagimu’” daripada tamu tamuku ini seperti sulaiman yang menawarkan kepada dua orang wanita yang bersengketa pada seorang anak agar anak itu dibelah menjadi dua untuk menyingkap kebenaran dan karena luth mengetahui bahwa putri putri (negeri) nya tidak akan mereka dapatkan dan mereka tidak berhak pada mereka, dan tujuan besar dari luth adalah menolak perbuatan keji yang besar ini. ”maka bertakwalah kepada Allah dan janganlah kamu mencemarkan (nama) ku terhadap tamuku ini” yaitu dengan cara jagalah ketakwaan kepada Allah atau hargailah tamu tamuku, jangan kalian membuatku malu di hadapan mereka. ”tidak adakah diantaramu seorang yang berakal?” yang melarang dan mencegahmu. ini adalah dalil atas pengabaian dan penyimpangan mereka dari kebaikan dan karakter pribadi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يُهۡرَعُونَ إِلَيۡهِ) yuhra’uuna ilaihi : bergegas karena dorongan syahwat, berjalan cepat tanpa pikir panjang. (ٱلسَّيِّ‍َٔاتِۚ) as-sayyiaat : dosa-dosa besar, homoseksual. (وَلَا تُخۡزُونِ فِي ضَيۡفِيٓۖ) wa laa tukhzuuni fii dhaifii : Jangan membuat aku malu dan rendah dengan meminta tamuku (رَجُلٞ رَّشِيدٞ) rajulun rasyiid : punya akal untuk berfikir tentang efek-efek dari suatu perkara. Makna ayat : Allah mengabarkan ketika kaumnya Luth mendatangi Luth pada hari dan masa yang sulit, Allah berfirman (وَجَآءَهُۥ قَوۡمُهُۥ يُهۡرَعُونَ إِلَيۡهِ) bergegas karena dorongan syahwat hewani mereka (وَمِن قَبۡلُ كَانُواْ يَعۡمَلُونَ ٱلسَّيِّ‍َٔاتِۚ) yang sebelumnya mereka melakukan homoseksual, maka Luth mencoba menjauhkan mereka dari tamunya, berkata (يَٰقَوۡمِ هَٰٓؤُلَآءِ بَنَاتِي هُنَّ أَطۡهَرُ لَكُمۡۖ) mereka adalah perempuan-perempuan kaum ini, nikahilah mereka! Karena itu lebih suci bagi kalian, dan bertakwalah kepada Allah, takutlah kepada azab-Nya (وَلَا تُخۡزُونِ فِي ضَيۡفِيٓۖ) janganlah kalian membuat aku malu di hadapan tamu ku. (أَلَيۡسَ مِنكُمۡ رَجُلٞ رَّشِيدٞ ) apakah tidak ada orang yang berakal di antara kalian, menyuruh kepada yang baik dan mencegah dari kemungkaran? Pelajaran dari ayat : • Menjijikannya perbuatan homoseksual, serta dampak buruk terhadap seseorang. • Usaha Nabi Luth untuk menjaga tamunya dengan menawarkan putri-putrinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 78: Ketika mereka mengetahui kedatangannya. Maksudnya perbuatan keji di sini ialah mengerjakan liwath (homoseksual). Yakni nikahilah mereka. Sikap Nabi Luth ini seperti sikap Nabi Sulaiman ‘alaihis salam kepada kedua orang wanita yang datang kepadanya membawa seorang anak, masing-masing mengaku sebagai anaknya, maka untuk mengetahui anak siapakah bayi itu, Nabi Sulaiman ‘alaihis salam berpura-pura akan membelah anak tersebut menjadi dua. Wanita yang satu menerima usulan itu, sedangkan yang satu lagi menolak, maka dapat diketahui bahwa anak itu adalah anak si wanita yang menolak dibelah menjadi dua, bukan anak si wanita yang menerima usulan agar dibelah menjadi dua. Maksud dari sikap itu, demikian juga sikap Nabi Luth di atas adalah untuk menolak perkara keji yang lebih besar. Yang menyuruh berbuat baik dan melarang berbuat buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 78",
    "description": "Dan tak lama setelah tamu itu tiba, maka kaumnya pun segera datang kepadanya dan bermaksud melakukan perbuatan keji terhadap tamu nabi lut itu. Dan memang sejak dahulu mereka selalu melakukan perbuatan keji itu, yaitu menyukai sesama laki-laki. Menyaksikan tingkah laku mereka, nabi lut berkata, wahai kaumku! inilah putriputriku yang ada di negeri ini yang sudah kamu kenal, mereka lebih suci bagimu untuk kamu jadikan sebagai istrimu, maka bertakwalah kepada Allah agar terhindar dari murka-Nya, dan janganlah kamu mencemarkan nama baikku dengan melakukan perbuatan keji dan jahat terhadap tamuku ini. Tidak adakah di antaramu orang yang pandai dan menggunakan akalnya untuk berpikir mana perbuatan yang baik dan mana perbuatan yang buruk, serta berusaha menghindari segala bentuk perbuatan munkar'mendengar seruan nabi lut agar menjadikan perempuan sebagai istri, mereka menjawab, sesungguhnya engkau pasti tahu bahwa sejak dahulu hingga sekarang, kami tidak mempunyai keinginan atau ketertarikan terhadap putri-putrimu yang ada di negeri ini yang sudah kami kenal; dan engkau tentu mengetahui apa yang sebenarnya kami kehendaki untuk menyalurkan nafsu' kami hanya menginginkan lelaki, bukan perempuan. Karena itu, janganlah kauminta kami menikahi perempuan!."
  }
]