[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum luth berkata kepadanya, ”sungguh kamu sudah tahu sebelumnya bahwa sesungguhnya kami tidak ada kebutuhan dan hasrat kepada wanita. Dan sesungguhnya kamu betul-betul sudah tahu apa yang kami inginkan.” maksudnya, kami tidak menginginkan kecuali laki-laki, dan tidak ada hasrat dari kami untuk menikahi kaum perempuan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Kaumnya menjawab, \"Kamu sudah tahu -wahai Lūṭ- bahwa kami tidak tertarik dengan putri-putrimu dan juga wanita-wanita dari kaummu. Sesungguhnya kamu tahu apa yang kami inginkan. Kami hanya menginginkan laki-laki.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Akan tetapi mereka enggan menikahi mereka, dan lebih memilih perbuatan keji daripada fitrah mereka. Mereka berkata kepada Nabi Luth: “Kamu telah mengetahui kami tidak berhasrat untuk menikahi perempuan, dan kamu juga telah mengetahui apa tujuan kami ke sini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. مَا لَنَا فِى بَنَاتِكَ مِنْ حَقٍّ (kami tidak mempunyai keinginan terhadap puteri-puterimu) Yakni kami tidak butuh dan tidak bernafsu terhadap putri-putrimu. Terdapat pendapat mengatakan, sebenarnya mereka telah melamar putri-putri mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Mereka berkata: “Sungguh kamu sudah tahu wahai Luth, bahwa kami tidak berhasrat dan tidak butuh kepada anak perempuan. Sesungguhnya kamu sudah tahu bahwa kami ingin mendatangi laki-laki dan meninggalkan perempuan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“Sungguh kamu pasti tahu bahwa kami tidak mempunyai keinginan} kebutuhan dan kesenangan {terhadap putri-putrimu dan sesungguhnya kamu mengetahui apa yang kami inginkan.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79 “mereka menjawab” kepadanya, ”sungguh kamu telah tahu bahwa kami tidak mempunyai keinginan (syahwat) terhadap putri putrimu, dan sesungguhnya kamu tentu mengetahui apa yang sebenarnya kami kehendaki” maksudnya kami hanya menginginkan laki laki, kami tidak menginginkan perempuan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Lalu kaumnya menjawab—semoga Allah melaknat mereka, (لَقَدۡ عَلِمۡتَ مَا لَنَا فِي بَنَاتِكَ مِنۡ حَقّٖ) “Engkau sudah mengetahui kami tidak ada keinginan dengan mereka (وَإِنَّكَ لَتَعۡلَمُ مَا نُرِيدُ ) dan engkau tau apa yang kami inginkan, yaitu melakukan homoseksual."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 79: Maksudnya mereka tidak punya syahwat terhadap wanita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 79",
    "description": "Mendengar seruan nabi lut agar menjadikan perempuan sebagai istri, mereka menjawab, sesungguhnya engkau pasti tahu bahwa sejak dahulu hingga sekarang, kami tidak mempunyai keinginan atau ketertarikan terhadap putri-putrimu yang ada di negeri ini yang sudah kami kenal; dan engkau tentu mengetahui apa yang sebenarnya kami kehendaki untuk menyalurkan nafsu' kami hanya menginginkan lelaki, bukan perempuan. Karena itu, janganlah kauminta kami menikahi perempuan!kemudian dia (nabi lut) berkata, sekiranya aku mempunyai kekuatan atau kedudukan untuk menolak perbuatan jahatmu, atau aku dapat berlindung kepada keluarga yang kuat, tentu akan aku lakukan, agar aku dapat melindungi tamu-tamuku ini."
  }
]