[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Luth berakata kepada mereka ketika mereka menolak kecuali perbuatan(homo) yang keji itu, ”seandainya aku memiliki kekuatan dan penolong bersamaku untuk melawan kalian, atau aku bernaung pada satu keluarga besar yang akan melindungiku dari kalian, pastilah akan aku halangi antara kalian dan antara apa yang kalian inginkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Lūṭ berkata, \"Seandainya aku mempunyai kekuatan untuk melawan kalian, atau mempunyai keluarga yang bisa melindungiku sehingga aku bisa menghalangi kalian dari tamu-tamuku.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Nabi Luth merasa kebingungan, bagaimana dia dapat melindungi tamu-tamunya. Maka dia berkata kepada tamu-tamu itu: “Andai saja aku memiliki kekuatan untuk melindungi dan menyelamatkan kalian dari gangguan mereka, atau dapat meminta pertolongan keluarga yang memiliki kekuatan sehingga mereka dapat menolong kita!” Pada situasi sulit ini, para malaikat menyatakan tujuan mereka, memberi Nabi Luth kabar gembira dan menenangkannya, dan menyuruhnya untuk meninggalkan kota pada akhir malam bersama istri dan anak-anak perempuan mereka, namun mereka tidak boleh menengok ke belakang ketika meninggalkan kota agar tidak ikut tertimpa azab. Maka Nabi Luth keluar meninggalkan kota pada gelap malam bersama keluarganya, mereka semua melalui jalan yang diperintahkan untuk dilewati, dan tidak ada dari mereka yang menoleh ke belakang ke arah kota kecuali istrinya, sehingga dia tertimpa azab yang menimpa kaumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. قَالَ لَوْ أَنَّ لِى بِكُمْ قُوَّةً (Luth berkata: “Seandainya aku ada mempunyai kekuatan (untuk menolakmu)) Yakni duhai seandainya aku memiliki kemampuan untuk mencegah perbuatan kalian. أَوْ ءَاوِىٓ إِلَىٰ رُكْنٍ شَدِيدٍ(atau kalau aku dapat berlindung kepada keluarga yang kuat (tentu aku lakukan)) Tempat yang kokoh untuk berlindung. Pendapat lain mengatakan yang dimaksud dengan (الركن الشديد) yakni keluarga yang kuat yang dapat melindunginya, ia mengatakan ini karena ia tidak memiliki keluarga dari kaum mereka sebab ia berasal dari Irak. Yakni seandainya aku memiliki satu dari dua hal, yaitu kekuatan atau keluarga, pasti aku akan melawan kalian, membuat perhitungan dengan kalian, serta mencegah kalian dari pelecehan kehormatan rumah dan tamuku. Imam Bukhari meriwayatkan dari Abu Hurairah bahwa Rasulullah bersabda: “semoga Allah mengampuni nabi Luth, andaisaja begitu, ia akan berlindung di tempat yang kokoh”. Yakni perlindungan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Luth berkata kepada mereka: “Kalau saja aku punya kekuatan dan kuasa untuk mencegah kalian atau penolong yang bisa aku mintai perlindungan, yaitu kerabat yang kuat mencegah kalian, niscaya aku akan melawan kalian agar tidak menginginkan tamu-tamuku.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Jika aku mempunyai kekuatan untuk menghalangimu} penolong dan pembantu untuk menghalangi kalian {atau aku dapat berlindung} berlindung dan ikut {kepada kerabat yang kuat} kerabat yang menjadi penjaga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80 Luth semakin cemas saja, maka dia berkata, ”seandainya aku mempunyai kekuatan (untuk menolakmu) atau kalau aku dapat berlindung kepada keluarga yang kuat (tentu aku lakukan)” seperti kabilah yang tangguh, niscaya aku akan melarang kalian. Ini adalah berdasarkan sebab sebab yang kongkret, jika tidak, maka dia berlindung kepada tempat sandaran terkuat, yaitu Allah yang tak seorangpun mampu melawanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَوۡ ءَاوِيٓ إِلَىٰ رُكۡنٖ شَدِيدٖ) aw aawii ilaa ruknin syadiid : kepada keluarga yang kuat, menyelamatkan ku dari kalian, tapi ia tidak punya, karena ia bukan penduduk asli. Makna ayat : Lalu Nabi Luth ‘alaihi salam berkata (لَوۡ أَنَّ لِي بِكُمۡ قُوَّةً) Seandainya aku punya pengikut yang dapat menolongku dan membantuku, tentu aku sudah menghalangi kalian dari perbuatan itu, (أَوۡ ءَاوِيٓ إِلَىٰ رُكۡنٖ شَدِيدٖ) yaitu keluarga yang kuat, sehingga bisa menjaganya dan tamunya dari orang-orang jahat. Pelajaran dari ayat : • Menginginkan kekuatan untuk mencegah keburukan adalah hal yang terpuji."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 80: Maka kegelisahan Nabi Luth semakin bertambah. Hal ini hanya menyesuaikan dengan sebab yang bisa dirasakan, karena jika tidak sesungguhnya Beliau telah berlindung kepada Yang Mahakuat, yaitu Allah. Ketika para malaikat melihat Nabi Luth kesusahan, maka para malaikat mengucapkan kata-kata sebagaimana yang disebutkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 80",
    "description": "Kemudian dia (nabi lut) berkata, sekiranya aku mempunyai kekuatan atau kedudukan untuk menolak perbuatan jahatmu, atau aku dapat berlindung kepada keluarga yang kuat, tentu akan aku lakukan, agar aku dapat melindungi tamu-tamuku ini. Setelah dijelaskan tentang tingkah laku kaum nabi lut yang melampaui batas, kemudian ayat berikut ini memberitakan bahwa Allah akan menurunkan azab kepada mereka. Mereka para malaikat berkata, wahai nabi lut, jangan takut! sesungguhnya kami adalah para utusan tuhanmu untuk menyampaikan berita bahwa mereka akan diazab Allah, sehingga mereka tidak akan dapat mengganggu kamu karena mereka akan binasa, sebab itu pergilah beserta keluargamu pada akhir malam dan jangan ada seorang pun di antara kamu yang menoleh ke belakang, yakni teruslah."
  }
]