[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para malaikat berkata, ”wahai luth, sesungguhnya kami adalah utusan-utusan tuhanmu, Dia mengirim kami untuk menghancurkan kaummu, dan sesungguhnya mereka tidak akan sampai mencelakaimu. Maka keluarlah kamu dari negeri ini, kamu dan keluargamu pada sisa malam, dan janganlah seorangpun dari kalian menengok ke arah belakangnya, supaya tidak sampai dia menyaksikan siksaan, akibatnya siksaan itu akan menimpanya. Akan tetapi, istrimu yang telah mengkhianatimu dengan kekafiran dan kemunafikan, dia juga akan ditimpa apa yang akan menimpa kaummu, berupa kebinasaan. Sesungguhnya waktu kebinasaan mereka adalah waktu shubuh, yaitu ketetapan waktu yang akan segera tiba.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Para Malaikat itu berkata kepada Lūṭ -'alaihissalām-, \"Wahai Lūṭ! Sesungguhnya kami adalah utusan-utusan yang dikirim oleh Allah. Kaummu tidak akan bisa mengganggumu. Bawalah keluargamu keluar dari kota ini di tengah malam yang gelap. Dan jangan sampai ada seorangpun di antara kalian yang melihat ke belakang, kecuali isterimu, dia akan melihat ke belakang. Dia tidak mematuhi larangan itu karena dia akan mendapatkan azab yang sama dengan apa yang menimpa kaummu. Sesungguhnya waktu pembinasaan mereka adalah subuh. Dan waktu subuh itu sudah dekat.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81-83. Ketika ketetapan Kami menimpa mereka dan azab Kami datang dengan tiba-tiba; Kami balikkan kota itu, bagian atasnya menjadi bagian bawahnya, dan Kami hujani mereka dengan hujan batu yang telah disiapkan sebagai azab bagi mereka; dan azab bagi setiap orang yang melanggar batas dan kewajiban tidak akan jauh dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. قَالُوا۟ يٰلُوطُ إِنَّا رُسُلُ رَبِّكَ لَن يَصِلُوٓا۟ إِلَيْكَ ۖ (Para utusan (malaikat) berkata: “Hai Luth, sesungguhnya kami adalah utusan-utusan Tuhanmu, sekali-kali mereka tidak akan dapat mengganggu kamu) Yakni para malaikat berkata pada nabi Luth: “mereka tidak akan mampu menimpamu dengan keburukan, kami adalah para malaikat yang diutus Allah kepadamu”. Kemudian para malaikat memerintahkannya untuk keluar dari negeri kaum mereka dengan mengatakan “pergilah dengan membawa keluargamu” فَأَسْرِ بِأَهْلِكَ(sebab itu pergilah dengan membawa keluargamu) Pergilah safar dengan mereka dari kota ini pada malam hari. بِقِطْعٍ مِّنَ الَّيْلِ (di akhir malam) Di waktu malam yang gelap gulita. وَلَا يَلْتَفِتْ مِنكُمْ أَحَدٌ (dan janganlah ada seorangpun di antara kamu yang tertinggal) Yakni janganlah melihat ke belakang. Atau janganlah kalian fikirkan apa yang kau tinggalkan seperti harta benda dan lainnya. إِلَّا امْرَأَتَكَ ۖ( kecuali isterimu) Akan tetapi istrimu akan menyalahi perintah ini sehingga ia akan menengok ke belakang. إِنَّهُۥ مُصِيبُهَا مَآ أَصَابَهُمْ ۚ( Sesungguhnya dia akan ditimpa azab yang menimpa mereka) Yakni tertimpa azab pula. إِنَّ مَوْعِدَهُمُ الصُّبْحُ ۚ(sesungguhnya ajal mereka di waktu subuh) Allah menjadikan waktu subuh sebagai waktu kebinasaan mereka karena di waktu itu diri manusia dalam keadaan tenang dan dalam kenikmatan tidur di akhir malam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dan diantara hikmah larangan terhadap mereka untuk kembali melihat ke belakang agar mereka giat dalam berjalan; karena orang selalu melihat ke belakang tidak akan bergeser dari tingkatannya yang rendah. Ayat ini juga memberi peringatan kepada setiap mukmin agar mereka tidak melihat ke belakang dalam bekerja kecuali dengan tujuan mencari dan memperbaiki kesalahan pada apa yang telah berlaku pada dirinya. 2 ). Terkadang orang-orang yang membenci kebenaran menyebabkanmu sibuk dengan kebodohan-kebodohan mereka di belakangmu; sehingga kamu terpancing dan terus melihat ke belakang dan menyebabkan perjalanmu lambat sampai tujuan, Allah berfirman kepada nabi-Nya Luth : { فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِنَ اللَّيْلِ وَلَا يَلْتَفِتْ مِنْكُمْ أَحَدٌ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Para malaikat yang diutus berkata: “Wahai Luth, sesungguhnya kami adalah malaikat yang diutus Allah untuk membinasakan kaum itu, mereka tidak akan melakukan keburukan terhadapmu, maka pergilah bersama keluargamu di saat gelap, atau di sebagian malam, dan jangan ada satupun dari kalian yang berpaling ke belakang, kecuali istrimu, jangan sampai dia keluar bersamamu. Sesungguhnya dia juga akan menerima azab yang akan diterima kaum itu. Sesungguhnya waktu kehancuran mereka adalah pagi hari, dimana jiwa-jiwa sedang tenang dan berkumpul. Bukankah waktu pagi itu merupakan waktu hukuman yang sangat dekat?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Wahai Luth, sesungguhnya kami adalah para utusan Tuhanmu. Mereka tidak akan dapat mengganggumu, maka pergilah} keluarlah {beserta keluargamu pada sebagian} pada sebagian lembaran {malam dan jangan ada yang menoleh} jangan ada yang melihat ke belakang {seorang pun di antara kalian kecuali istrimu. Sesungguhnya dia akan terkena apa yang menimpa mereka} akan tetapi istrinya akan menoleh, lalu dia ditimpa azab yang menimpa mereka {dan sesungguhnya janji untuk mereka} janji untuk menghancurkan mereka {itu waktu subuh. Bukankah subuh itu sudah dekat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81 Oleh karena itu, ketika urusannya telah memuncak dan perkaranya bertambah sulit, ”para utusan (malaikat) berkata” kepada luth, ”sesungguhnya kami adalah utusan utusan Rabbmu” maksudnya mereka membuka identitas mereka agar luth tenang hatinya. ”sekali kali mereka tidak akan dapat mengganggu kamu” dengan keburukan, kemudian jibril berkata dengan menggerakan sayapnya, lalu dia menyapu mata mereka. lalu mereka beranjak pergi dengan mengancam luth (untuk membalas) pada waktu hadirnya shubuh. Para malaikat memerintakan luth agar membawa keluarga pergi “diakhir malam” jauh sebelum shubuh (tiba) agar bisa menjauhi desa mereka. ”dan janganlah seorangpun diantara kamu yang menoleh kebelakang. ”yakni cepat cepatlah pergi, yang penting kamu selamat, janganlah menengok ke belakang. ”kecuali istrimu. Sesungguhnya dia akan ditimpa” azab “yang menimpa mereka” Karena dia berserikat dalam dosanya bersama kaumnya, dialah yang mengabarkan kepada kaumnya tentang kehadiran tamu tamu kepada luth. ”sesungguhnya saat jatuhnya azab kepada mereka ialah di waktu shubuh” seakan akan luth menginginkannya cepat, maka dikatakan kepadanya, ”bukankah shubuh itu sudah dekat?”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (فَأَسۡرِ بِأَهۡلِكَ) Fa asri bi ahlika : keluarlah dari negeri itu pada malam hari. (بِقِطۡعٖ مِّنَ ٱلَّيۡلِ) Bi qith’im minal lail : pada sebagian malam. (ٱلصُّبۡحُۚ) ash-shubh : dari terbit fajar hingga matahari bersinar. Makna ayat : Setelah semakin parah kekhawatiran Luth dan merasa sedih karena tidak mampu menjaga tamunya yang mulia, sampai berkata (لَوۡ أَنَّ لِي بِكُمۡ قُوَّةً أَوۡ ءَاوِيٓ إِلَىٰ رُكۡنٖ شَدِيدٖ) “Andai aku mempunyai kuasa atas kalian, dan punya keluarga yang mampu menolongku.” Berkatalah para malaikat, (يَٰلُوطُ إِنَّا رُسُلُ رَبِّكَ) “Wahai Luth, kami adalah utusan dari Rabbmu untuk menyelamatkanmu dan menghancurkan kaummu. (لَن يَصِلُوٓاْ إِلَيۡكَۖ) mereka tidak akan mampu mengganggu kami, sekecil apapun. (فَأَسۡرِ بِأَهۡلِكَ) Maka, keluarlah bersama keluargamu, (بِقِطۡعٖ مِّنَ ٱلَّيۡلِ) di sebagian malam, (وَلَا يَلۡتَفِتۡ مِنكُمۡ أَحَدٌ) jangan sampai ada yang menoleh ke belakang, jika mereka melihat turunnya azab, mereka juga akan terkena, (إِلَّا ٱمۡرَأَتَكَۖ) kecuali istrimu, istri yang buruk, tinggalkan lah ia di dalamnya, jika ia ikut keluar, biarkan ia menoleh kebelakang, (إِنَّهُۥ مُصِيبُهَا مَآ أَصَابَهُمۡۚ) karena ia sama akan tertimpa azab seperti mereka. Kemudian Luth bertanya, kapan waktu azab itu turun. Para malaikat berkata, (إِنَّ مَوۡعِدَهُمُ ٱلصُّبۡحُۚ) “Waktunya adalah ketika fajar terbit.” Tapi Luth merasa itu masih lama, lalu mereka berkata, (أَلَيۡسَ ٱلصُّبۡحُ بِقَرِيبٖ) “Bukankah waktu subuh sudah dekat?”. Pelajaran dari ayat : • Dianjurkannya bersafar di malam hari, karena di sana ada keberkahan dan bisa mengeurangi lelah selama perjalanan. • Tidak bolehnya bersedih atas kehancuran orang-orang zalim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 81: Mereka memberitahukan demikian agar hati Nabi Luth merasa tenteram setelah sebelumnya gelisah. Disebutkan, bahwa malaikat Jibril membutakan mata mereka dengan sayapnya, maka mereka pun pergi dan mengancam Nabi Luth dengan akan melakukan tindakan terhadapnya jika pagi hari tiba, kemudian para malaikat memerintahkan Luth membawa pergi keluarganya di akhir malam sebelum Subuh tiba, agar Beliau beserta keluarga dan pengikutnya dapat menjauh dari negerinya. Yakni agar tidak melihat peristiwa besar yang menimpa mereka. Di antara mufassir ada yang mengartikan, “Segeralah keluar (dari negerimu), dan hendaknya yang menjadi perhatianmu adalah keselamatan dan jangan memperhatikan yang berada di belakangmu.” Yakni jangan pergi membawanya, karena istrinya ikut serta dengan kaumnya dalam dosa. Istrinya yang menunjukkan kaumnya tentang kedatangan para tamu Nabi Luth. Ada yang mengatakan, bahwa Luth keluar tidak bersama istrinya, ada pula yang mengatakan, bahwa istrinya ikut keluar bersamanya, namun ia menengok ke belakang dan berkata, “Duh, kaumku!” lalu ada batu yang datang kepadanya dan membunuhnya. Sebelumnya Luth bertanya kepada mereka tentang waktu mereka akan dibinasakan, lalu para malaikat menjawab, “Sesungguhnya saat terjadinya siksaan bagi mereka itu pada waktu subuh.” Luth berkata, “Saya ingin lebih cepat lagi,” Para malaikat menjawab, “Bukankah subuh itu sudah dekat?\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 81",
    "description": "Setelah dijelaskan tentang tingkah laku kaum nabi lut yang melampaui batas, kemudian ayat berikut ini memberitakan bahwa Allah akan menurunkan azab kepada mereka. Mereka para malaikat berkata, wahai nabi lut, jangan takut! sesungguhnya kami adalah para utusan tuhanmu untuk menyampaikan berita bahwa mereka akan diazab Allah, sehingga mereka tidak akan dapat mengganggu kamu karena mereka akan binasa, sebab itu pergilah beserta keluargamu pada akhir malam dan jangan ada seorang pun di antara kamu yang menoleh ke belakang, yakni teruslahmaka ketika keputusan kami datang untuk menurunkan azab kepada kaum nabi lut yang durhaka, kami menjungkirbalikkannya negeri kaum lut sehingga bagian atas bangunan berada di bawah dan bagian bawah bumi ada di atas, sebagai akibat perbuatan mereka memutarbalikkan fitrah, dan kami hujani mereka bertubi-tubi tiada henti dari tempat tinggi dengan batu dari tanah yang terbakar (lihat: surah al-'ankabut/29: 34 dan adh-dhariyat/51: 32-33)."
  }
]