[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika datang kepada mereka ketetapan kami untuk turunnya siksaan pada mereka, kami menjadikan bagian atas negeri mereka yang mereka menjalani kehidupan padanya kebagian bawah; kami membalikannya. Dan kami hujani mereka dengan bebatuan dari tanah padat lagi keras, sebagiannya telah disatukan dengan yang lain secara bertubi-tubi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Kemudian tatkala perintah Kami untuk membinasakan kaum Lūṭ datang, Kami buat bagian atas kota-kota mereka berada di bawah dengan cara mengangkatnya ke atas dan membaliknya bersama mereka. Dan Kami hujani mereka dengan batu yang berasal dari tanah liat yang mengeras secara bertubi-tubi hingga tersusun rapi dalam posisi saling tindih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. فَلَمَّا جَآءَ أَمْرُنَا (Maka tatkala datang ketetapan Kami) Dengan turunnya azab. جَعَلْنَا عٰلِيَهَا سَافِلَهَا (ami jadikan negeri kaum Luth itu yang di atas ke bawah (Kami balikkan)) Yakni menjadikan bagian atas negeri kaum Luth dibalik menjadi di bagian bawah. Terdapat pendapat mengatakan bahwa Allah memerintahkan malaikat Jibril untuk mengangkat negeri itu dengan satu sayapnya kemudian ia membalik negeri itu. وَأَمْطَرْنَا عَلَيْهَا حِجَارَةً مِّن سِجِّيلٍ (dan Kami hujani mereka dengan batu dari tanah yang terbakar) Makna (السجيل) yakni tanah yang membatu karena terbakar atau karena sebab lain. مَّنضُودٍ (dengan bertubi-tubi) Dengan silih berganti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Tatkala telah tiba perintah Kami untuk menurunkan azab, Kami jadikan negeri kaum yang berkedudukan di atas menjadi di bawah ketika Kami melempari mereka dengan tanah, Kami menurunkan atas mereka bebatuan yang banyak yang terbuat dari tanah yang mengaras secara terus menerus sampai saling bertumpukkan satu sama lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika telah datang keputusan Kami, Kami menjadikan tempat tinggi negeri itu menjadi ke bagian bawah dan Kami menghujani mereka dengan batu dari tanah yang terbakar} tanah yang mengeras {secara bertubi-tubi} saling berjatuhan secara bertubi-tubi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82 “maka tatkala datang azab kami” menimpa mereka, ”kami jadikan” negeri kaum luth ”yang diatas kebawah(kami balikan)” maksudnya kami balikkan atas mereka, ”dan kamu hujani mereka dengan batu dari tanah yang terbakar” dari batu api yang sangat panas ”dengan bertubi tubi” maksudnya bertubi tubi mengejar orang yang kabur dari negeri itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (جَعَلۡنَا عَٰلِيَهَا سَافِلَهَا) ja’alnaa ‘aaliyahaa : permukaan negeri tersebut, (سَافِلَهَا) saafilahaa : menjadi di bawah. (مِّن سِجِّيلٖ) min sijjiil : dari tanah yang keras. (مَّنضُودٖ) mandhuud : tersusun rapi satu bagian di atas bagian lainnya. Makna ayat : Allah berfirman : (فَلَمَّا جَآءَ أَمۡرُنَا جَعَلۡنَا عَٰلِيَهَا سَافِلَهَا) maka ketika telah tiba turunnya perintah Allah untuk mengazab mereka, memerintahkan Jibril untuk menjungkir-balikkan negeri tersebut beserta isinya, dan Allah hujani mereka dengan batu-batu keras, siapa pun yang berada di luar negeri tersebut, pasti akan terkena batu tersebut dan binasa. Pelajaran dari ayat : • Bukti kekuasaan Allah, menjungkir-balikkan 4 kota dalam satu waktu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 82: Malaikat Jibril mengangkat negeri itu ke atas, lalu dibalikkan ke bawah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 82",
    "description": "Maka ketika keputusan kami datang untuk menurunkan azab kepada kaum nabi lut yang durhaka, kami menjungkirbalikkannya negeri kaum lut sehingga bagian atas bangunan berada di bawah dan bagian bawah bumi ada di atas, sebagai akibat perbuatan mereka memutarbalikkan fitrah, dan kami hujani mereka bertubi-tubi tiada henti dari tempat tinggi dengan batu dari tanah yang terbakar (lihat: surah al-'ankabut/29: 34 dan adh-dhariyat/51: 32-33). Azab yang ditimpakan kepada kaum nabi lut yang diberi tanda oleh tuhanmu mengandung pesan, bahwa apa yang menimpa kaum nabi lut bisa jadi menimpa siapa saja. Dan siksaan itu tiadalah jauh dari orang yang zalim kapan dan di mana saja berada pada setiap kurun waktu sepanjang zaman. Apabila perbuatan keji merajalela di tengah-tengah masyarakat, dan perbuatan itu mereka lakukan secara terang-terangan."
  }
]