[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang berasal dari sisi Allah dengan bertanda yang jelas, yang berbeda dengan bentuk bebatuan bumi. Dan bebatuan yang kami hujankan pada kaum luth, bukan tidak mungkin orang-orang kafir quraisypun mengalami hujan batu serupa. Dalam ayat ini terdapat ancaman bagi setiap pendurhaka lagi penentang terhadap Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Batu itu diberi tanda khusus oleh Allah. Dan batu itu tidaklah jauh dari orang-orang yang zalim dari suku Quraisy maupun lainnya. Batu itu dekat dengan mereka ketika Allah memutuskan untuk menurunkannya kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. مُّسَوَّمَةً (Yang diberi tanda) Yakni pada batu tersebut terdapat tanda kaum yang akan dilempar dengan batu tersebut. Terdapat pendapat mengatakan pada batu itu terdapat tanda seperti cincin-cincin. Terdapat pula pendapat mengatakan pada setiap batu tersebut tertulis nama orang yang akan dilempar dengannya. عِندَ رَبِّكَ ۖ (oleh Tuhanmu) Pada perbendaharaan-Nya. وَمَا هِىَ مِنَ الظّٰلِمِينَ(dan siksaan itu dari orang-orang yang zalim) Yakni batu-batu ini bagi setiap orang zalim. Dan kemungkinan yang dimaksud dengan orang zalim yakni orang yang melakukan kekejian kaum Luth. بِبَعِيدٍ (tiadalah jauh) Karena mereka berhak mendapatkan siksa lemparan batu ini akibat kezaliman mereka. Terdapat pendapat mengatakan maknanya adalah tidaklah negeri kaum Luth terlalu jauh, karena ia terletak antara negeri Syam dan Madinah, tempat ini tidaklah jauh dari Makkah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Bebatuan ini diberi tanda khusus bahwa azab tersebut dari sisi Tuhanmu dan berada di gudang-gudangNya yang memang diperuntukkan bagi mereka bukan lainnya. Dan (jarak) bebatuan atau kaum Luth ini tidak jauh dari orang-orang kafir Mekah dan sekitarnya. Mereka melewatinya dalam perjalanan menuju Syam. Ini merupakan ancaman bagi setiap orang zalim."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Batu-batu itu) diberi tanda dari sisi Tuhanmu} diberi tanda di sisi Tuhanmu dengan tanda khusus yang membyatnya berbeda {Siksaan itu tidak jauh dari orang yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83 ”yang diberi tanda oleh Rabbmu” maksudnya diberi alamat dengan alamat azab dan murka ”dan siksaan itu tiadalah jauh dari orang orang yang zhalim” yang berbuat seperti perbuatan kaum luth. maka hendaknya manusia berhati hati dengan tidak melakukannya agar tidak diazab seperti azab mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مُّسَوَّمَةً) musawwamah : bertanda khusus. (عِندَ رَبِّكَۖ) ‘inda rabbik : dari sisi Allah. Makna ayat : Firman-Nya (مُّسَوَّمَةً) tersusun serta bertanda dengan nama target. Firman-Nya (عِندَ رَبِّكَۖ) telah diberi tanda dari sisi Rabb mu, wahai Rasulullah. (وَمَا هِيَ مِنَ ٱلظَّٰلِمِينَ بِبَعِيدٖ) Tidaklah negeri yang hancur yang berisi orang-orang zalim, kaum musyrikin arab (بِبَعِيدٖ) tidak jauh berbeda, atau tidaklah turunnya bebatuan yang menghancurkan kaum Luth tidak akan jauh dari orang-orang zalim. Pelajaran dari ayat : • Ancaman bagi orang-orang zalim dengan hukuman yang paling keras pada setiap zaman dan lokasi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 83: Yakni nama-nama orang yang akan dilempari batu tertera di batu tersebut. Ada yang mengatakan, di batu itu ada tanda azab dan kemurkaan dari Allah Azza wa Jalla, wallahu a’lam. Yakni batu itu tidak jauh dari orang-orang yang zalim. Sebagian mufassir mengartikan bahwa negeri kaum Luth yang dibinasakan itu tidak jauh dari penduduk Mekah yang zalim (orang-orang musyrik). Oleh karena itu, hendaknya manusia takut kalau sekiranya mereka berbuat seperti yang dilakukan kaum Luth akan tertimpa azab sebagaimana kaum Luth."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 83",
    "description": "Azab yang ditimpakan kepada kaum nabi lut yang diberi tanda oleh tuhanmu mengandung pesan, bahwa apa yang menimpa kaum nabi lut bisa jadi menimpa siapa saja. Dan siksaan itu tiadalah jauh dari orang yang zalim kapan dan di mana saja berada pada setiap kurun waktu sepanjang zaman. Apabila perbuatan keji merajalela di tengah-tengah masyarakat, dan perbuatan itu mereka lakukan secara terang-terangan. Setelah diuraikan kisah kaum nabi lut yang diazab oleh Allah akibat kedurhakaan dan perbuatan keji yang mereka lakukan, kemudian diuraikan kembali kisah umat terdahulu, yaitu kaum nabi syuaib sebagai pelajaran bagi umat nabi Muhammad. Dan kepada penduduk madyan, kami utus saudara satu keturunan dengan mereka, yaitu nabi syuaib. Dia berkata, wahai kaumku! sembahlah Allah, tidak ada tuhan bagimu yang berhak disembah selain dia. Kemudian nabi syuaib menasihati mereka seraya berkata, dan janganlah kamu kurangi takaran dan timbangan dalam berniaga, karena perbuatan itu sama saja menipu manusia. Sesungguhnya aku melihat kamu dalam keadaan yang baik ekonominya ditopang dengan keadaan wilayah yang subur, sehingga hidup makmur, bahagia dan sejahtera sehingga tidak perlu melakukan kecurangan. Dan sesungguhnya aku khawatir jika kamu menipu dan berbuat curang, kamu akan ditimpa azab pada suatu hari yang merata, yakni azab itu menimpa seluruh manusia yang ada di dalamnya karena dahsyatnya azab tersebut, sehingga tidak ada satu pun yang selamat."
  }
]