[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami utus ke negeri madyan saudara mereka, syu’aib. kemudian dia mengatakan, ”wahai kaumku, sembahlah Allah semata, kalian tidak memiliki sesembahan selainNYa yang berhak diibadahi. maka ikhlaskanlah ibadah untukNya. Dan janganlah kalian mengurangi hak-hak manusia dalam takaran dan timbangan mereka. Sesungguhnya kalian itu berada dalam kelapangan hidup, dan sesungguhnya aku takut atas kalian, akibat perbuatan mengurangi takaran dan timbangan yang kalian lakukan, datangnya siksaan pada hari yang meliputi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Dan kepada penduduk Madyan Kami mengutus saudara mereka, Syu'aib. Dia berkata, \"Wahai kaumku! Sembahlah Allah saja. Kalian tidak punya sesembahan lain yang berhak disembah selain Dia. Janganlah kalian mengurangi takaran dan timbangan apabila kalian menakar atau menimbang untuk orang lain. Sesungguhnya aku melihat kalian memiliki rezeki dan nikmat yang melimpah. Oleh karena itu jangan mengubah nikmat yang Allah berikan kepada kalian itu dengan berbuat maksiat. Sesungguhnya aku takut kalian akan ditimpa azab pada hari yang membinasakan kalian semua tanpa kecuali, di hari kalian tidak akan menemukan tempat berlindung dan tempat melarikan diri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Sebagaimana Kami mengutus Nuh, Hud, Shalih, Ibrahim, dan Luth; Kami utus pula kepada penduduk kota Madyan saudara mereka, Syuaib. Dia berkata kepada mereka: “Hai Kaumku, sembahlah Allah semata, dan janganlah mengurangi takaran dan timbangan sehingga kalian memakan harta yang bukan milik kalian; sungguh aku melihat kalian dalam ketentraman dan kesejahteraan, sehingga kalian tidak perlu melakukan hal itu. Sungguh aku takut kalian akan dibinasakan oleh azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَإِلَىٰ مَدْيَنَ أَخَاهُمْ شُعَيْبًا ۚ (Dan kepada (penduduk) Mad-yan (Kami utus) saudara mereka, Syu’aib) Yakni dan Kami utus kepada penduduk Madyan saudara mereka dari satu nasab yang bernama Syu’aib. Negeri ini diberi nama Madyan karena nama nenek moyang mereka adalah Madyan bin Ibrahim. Kisah mereka telah disebutkan dalam surat al-A’raf: 85-93. Nabi Syu’aib dikenal dengan sebutan Khatib para Nabi karena ia sangat mahir dalam berdialog dengan kaumnya. إِنِّىٓ أَرَىٰكُم بِخَيْرٍ(sesungguhnya aku melihat kamu dalam keadaan yang baik) Dalam keluasan rezeki. Maka janganlah kalian merubah kenikmatan yang diberikan Allah kepada kalian dengan kemaksiatan kepada-Nya dan memberi mudharat kepada para hamba-Nya, karena kenikmatan ini telah cukup bagi kalian sehingga tidak perlu untuk mengambil harta orang lain dengan cara yang tidak benar. وَإِنِّىٓ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ مُّحِيطٍ (dan sesungguhnya aku khawatir terhadapmu akan azab hari yang membinasakan) Azab yang tidak akan menyisakan seorangpun dari kalian, dan tidak akan ada yang mendapatkan tempat berlindung dan tempat berlari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Dan Kami mengutus kepada penduduk Madyan (kota yang dekat dengan Jordania) saudara senasab mereka yaitu Syuaib AS yang dijuluki Khathibul Anbiya’ karena kekuatan hujjah dan penjelasannya serta keralaannya yang luar biasa terhadap kaumnya. Dia berkata kepada mereka: “Wahai kaumku, menyembahlah hanya kepada Allah, tiada sekutu bagiNya. Kalian tidak memiliki Tuhan yang layak disembah dengan benar selain Allah. Janganlah kalian mengurangi takaran dan timbangan dalam berjual beli, memberikan pinjaman dan semacamnya. Sesungguhnya aku melihat kalian memiliki keuntungan melimpah yang membuat kalian kaya. Jujur dalam timbangan merupakan bentuk keadilan. Sesungguhnya aku mengkhawatirkan turunnya azab atas kalian pada hari dimana manusia diliputi kekhawatiran, dimana tidak ada satupun bisa melarikan diri.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Kepada penduduk Madyan, saudara mereka, Syuʻaib. Dia berkata,“Wahai kaumku, sembahlah Allah, Tidak ada tuhan bagi kalian selain Dia. Janganlah kalian mengurangi takaran dan timbangan. Sesungguhnya Aku melihat kamu dalam keadaan yang baik} dalam keadaan lapang rezeki dan memiliki banyak kenikmatan {Sesungguhnya aku khawatir kalian akan ditimpa azab pada hari yang meliputi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84 “dan” kami utus “kepada (penduduk) madyan”, madyan adalah kabilah yang terkenal yang tinggal di madyan, dekat palestina, ”saudara mereka” senasab, yaitu “syuaib” karena mereka mengenalnya dan bisa mengambil agama darinya. syuaib berkata kepada mereka, ”hai kaumku, sembahlah Allah, sekali kali tiada tuhan bagimu selain Dia” maksudnya, ibadah kepadaNya, karena mereka ketika itu menyekutukanNya dengan sesuatu, disamping itu mereka berlaku culas dalam timbangan dan takaran. Oleh karena itu, syuaib melarang mereka melakukan itu, dia berkata ”dan janganlah kamu kurangi takaran dan timbangan” akan tetapi penuhilah timbangan dan takaran dengan adil. ”sesungguhnya aku melihat kamu dalam keadaan yang baik (mampu)” maksudnya, berada dalam kenikmatan yang melimpah, kesehatan dan harta anak anak, maka bersyukurlah kepada Allah atas pemberianNYa kepadamu. jangan kufur terhadap nikmat Allah karena Dia bisa mencabutnya darimu. ”dan sesungguhnya aku khawatir terhadapmu akan azab hari yang membinasakan (kiamat)” yakni azab yang mengelilingimu dan tidak menyisakan apapun."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَإِلَىٰ مَدۡيَنَ) wa ilaa madyana : Kami mengutus utusan kami ke Madyan, yaitu kepada penduduk Madyan. (ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَ) al-miikyaala wal miizaan : ketika kalian menjual kepada seseorang, janganlah kalian kurangi takaran dan timbangannya. (عَذَابَ يَوۡمٖ مُّحِيطٖ) ‘adzaaba yaumim muhiith : azab yang meliputi kalian dari segala penjuru, tidak ada yang selamat darinya. Makna ayat : Sebuah prolog dari kisah Syu’aib beserta kaumnya penduduk Madyan, Allah berfirman (وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ شُعَيۡبٗاۚ) Kami mengutus kepada kabilah Madyan, saudara mereka se-nasab Syu’aib. (قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ) Esakanlah Allah, kalian tidak memiliki tuhan yang berhak disembah kecuali Dia, Dia-lah yang menciptakan kalian, memberi kalian rizki, dan mengatur segala urusan kalian. Firman-Nya (وَلَا تَنقُصُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَۖ) janganlah kalian mengurangi timbangan, ketika kalian menakar atau menimbang untuk orang lain, firman-Nya (إِنِّيٓ أَرَىٰكُم بِخَيۡرٖ) “sesungguhnya aku melihat kamu dalam keadaan yang baik (mampu)” kelapangan dan rizki yang luas (وَإِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٖ مُّحِيطٖ ) aku khawatir kalian akan tertimpa azab yang meliputi semuanya—tidak ada yang bisa lolos, ketika kalian terus berada di atas kesyirikan dan kecurangan Pelajaran dari Ayat : • Ada persamaan dakwah para Rasul, dimulai dengan tauhid, kemudian menyuruh kepada yang baik, melarang dari yang mungkar untuk menyempurnakan manusia dan membuat mereka bahagia setelah selamat dari kerugian • Diharamkannya mengurangi takaran, terlebih timbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 84: Kabilah yang sudah dikenal, mereka tinggal di Madyan; dekat dengan Palestina. Senasab, karena mereka sudah mengenal Beliau sebelumnya dan agar mereka dapat mengambil petunjuk darinya. Sehingga tidak butuh melakukan kecurangan. Jika kamu tidak beriman. Tanpa menyisakan sedikit pun dari kalian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 84",
    "description": "Setelah diuraikan kisah kaum nabi lut yang diazab oleh Allah akibat kedurhakaan dan perbuatan keji yang mereka lakukan, kemudian diuraikan kembali kisah umat terdahulu, yaitu kaum nabi syuaib sebagai pelajaran bagi umat nabi Muhammad. Dan kepada penduduk madyan, kami utus saudara satu keturunan dengan mereka, yaitu nabi syuaib. Dia berkata, wahai kaumku! sembahlah Allah, tidak ada tuhan bagimu yang berhak disembah selain dia. Kemudian nabi syuaib menasihati mereka seraya berkata, dan janganlah kamu kurangi takaran dan timbangan dalam berniaga, karena perbuatan itu sama saja menipu manusia. Sesungguhnya aku melihat kamu dalam keadaan yang baik ekonominya ditopang dengan keadaan wilayah yang subur, sehingga hidup makmur, bahagia dan sejahtera sehingga tidak perlu melakukan kecurangan. Dan sesungguhnya aku khawatir jika kamu menipu dan berbuat curang, kamu akan ditimpa azab pada suatu hari yang merata, yakni azab itu menimpa seluruh manusia yang ada di dalamnya karena dahsyatnya azab tersebut, sehingga tidak ada satu pun yang selamat. Dan setelah nabi syuaib melarang mengurangi takaran dan timbangan seraya berkata, wahai kaumku! penuhilah takaran dan timbangan dengan adil ketika berniaga, dan janganlah kamu merugikan manusia terhadap hak-hak mereka dengan mengurangi timbangan dan takaran. Jika kalian melebihkan takaran dan timbangan untuk orang lain, itu merupakan tindakan yang lebih bagus. Dan jangan sekali-kali kamu membuat kejahatan di bumi dengan berbuat kerusakan di mana-mana hingga membuat rusaknya sebuah tatanan, dan hancurnya sebuah negeri."
  }
]