[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, sempurnakanlah takaran dan timbangan dengan adil, dan janganlah kalian mengurangi hak manusia dalam semua barang-barang mereka, dan janganlah kalian berjalan di muka bumi, dengan melakukan berbagai maksiat kepada Allah di dalamnya dan menyebarluaskan kerusakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Wahai kaumku! Penuhilah takaran dan timbangan secara adil apabila kalian menakar atau menimbang untuk orang lain. Dan janganlah kalian mengurangi hak-hak orang lain sedikitpun dengan cara mengurangi takaran atau timbangan, melakukan kecurangan atau menipu. Pun jangan membuat kerusakan di muka bumi dengan melakukan pembunuhan atau perbuatan-perbuatan maksiat lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Hai kaumku, takar dan timbanglah dengan adil sebagaimana yang telah disyariatkan Tuhan kalian, yaitu dengan memilihkan barang yang bagus dan menjauhkan yang jelek. Janganlah kalian mengurangi hak-hak orang lain dengan menipu dan merugikan mereka, atau membuat aib pada barang mereka agar dapat kalian beli dengan harga murah, atau mengambil dari mereka lebih dari hak kalian. Dan janganlah kalian menyebarkan kerusakan di muka bumi dengan kekafiran, merampas hak-hak orang lain, dan melakukan perampokan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. بِالْقِسْطِ ۖ (dengan adil) Yakni tanpa menambah atau mengurangi. وَلَا تَبْخَسُوا۟ النَّاسَ أَشْيَآءَهُمْ(dan janganlah kamu merugikan manusia terhadap hak-hak mereka) Dengan mengurangi hak mereka dengan menipu atau merampasnya. وَلَا تَعْثَوْا۟ فِى الْأَرْضِ مُفْسِدِينَ (dan janganlah kamu membuat kejahatan di muka bumi dengan membuat kerusakan) Yakni janganlah banyak berbuat kerusakan di bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Tidak cukup menahan mereka agar tidak mengurangi timbangan, bahkan (Syuaib) mewajibkan mereka agar berlaku adil, sekalipun dia harus menambah takaran tersebut. Sempurnakanlah takaran dan timbangan dengan adil dan sepadan tanpa mengambil takaran terlalu banyak dan kurang dalam memberi. Janganlah kalian mengurangi sedikitpin hak-hak manusia dengan cara menipu atau memaksa, dan janganlah berbuat kerusakan di bumi, memperbanyak dan melanjutkan perbuatan kerusakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaumku, penuhilah} sempurnakanlah {takaran dan timbangan dengan adil} dengan adil {Janganlah merugikan} mengurangi {manusia tentang hak-hak mereka dan janganlah berjalan} janganlah berjalan {di bumi dengan berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85 “hai kaumku cukupkanlah takaran dan timbangan dengan adil” yang mana kamu rela agar diperlakukan demikian. ”dan janganlah kamu merugikan manusia terhadap hak hak mereka” maksudnya, janganlah mengurangi hak hak manusia dengan melakukan kecurangan dengan mengurangi timbangan dan takaran. ”dan janganlah kamu membuat kejahatan di muka bumi dengan membuat kerusakan” karena terus menerus berbuat maksiat akan merusak agama, akidah, dunia, dan membinasakan tanaman dan ternak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (بِٱلۡقِسۡطِۖ) bil qisth : dengan adil, menjual dan membeli dengan ukuran yang sama. (وَلَا تَبۡخَسُواْ) wa laa tabkhasuu : janganlah kalian mengurangi hak mereka yang ada pada kalian, baik itu dalam hal takaran atau timbangan dan yang lain. (وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ) wa laa ta’tsau fil ardhi : jangan menyebarkan kerusakan di muka bumi. Makna ayat : Firman-Nya, (وَيَٰقَوۡمِ أَوۡفُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَ بِٱلۡقِسۡطِۖ) \"Hai kaumku, cukupkanlah takaran dan timbangan dengan adil” beliau memerintahkan mereka agar menyempurnakan timbangan dan takaran, setelah beliau melarang mereka mengurangi timbangan dan takaran, sebagai penekanan terhadap larangan tersebut. Kemudian menambah hal lain, yaitu janganlah mereka merugikan manusia, (وَلَا تَبۡخَسُواْ ٱلنَّاسَ أَشۡيَآءَهُمۡ) janganlah kalian mengurangi hak-hak mereka, dan melarang mereka dari hal yang lebih umum (وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ) janganlah kalian membuat kerusakan di muka bumi, dan hal ini termasuk segala jenis maksiat dan perkara-perkara yang haram. Pelajaran dari ayat : • Diharamkannya mengurangi hak manusia: seperti upah pekerja dan harga barang. • Tidak bolehnya membuat kerusakan di muka bumi apa pun jenisnya, yang terbesar: meninggalkan syariat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 85: Di mana kalian suka jika mendapatkannya secara penuh dari orang lain. Karena sesungguhnya kemaksiatan jika terus dilakukan dapat merusak agama dan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 85",
    "description": "Dan setelah nabi syuaib melarang mengurangi takaran dan timbangan seraya berkata, wahai kaumku! penuhilah takaran dan timbangan dengan adil ketika berniaga, dan janganlah kamu merugikan manusia terhadap hak-hak mereka dengan mengurangi timbangan dan takaran. Jika kalian melebihkan takaran dan timbangan untuk orang lain, itu merupakan tindakan yang lebih bagus. Dan jangan sekali-kali kamu membuat kejahatan di bumi dengan berbuat kerusakan di mana-mana hingga membuat rusaknya sebuah tatanan, dan hancurnya sebuah negeri. Sisa keuntungan yang halal dari Allah meskipun sedikit nilainya, adalah lebih baik bagimu dari pada keuntungan banyak yang diperoleh dengan cara menipu dan berbuat curang, jika kamu betul-betul orang yang beriman kepada Allah dengan menaati perintah-Nya dan menjauhi larangan-Nya. Dan aku bukanlah seorang penjaga atau saksi atas dirimu, aku hanyalah seorang rasul."
  }
]