[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya apa yang tersisa bagi kalian setelah menyempurnakan takaran dan timbangan itu berupa keuntungan halal yang sudah pasti bagi kalian lebih baik bagi kalian daripada apa yang kalian ambil berupa hasil tindakan pengurangan dan lainnya dari cara-cara haram untuk mencari penghasilan, jika kalian beriman kepada Allah dengan sebenarnya. Maka laksanakanlah perintahNya, dan aku bukanlah pengawas bagi kalian yang memperhitungkan perbuatan-perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Harta halal yang Allah sisakan untuk kalian setelah kalian memenuhi hak-hak orang lain secara adil lebih bermanfaat dan lebih barokah daripada tambahan harta yang kalian dapatkan dengan cara mengurangi takaran atau timbangan, atau membuat kerusakan di muka bumi. Jika kalian benar-benar beriman kepada Allah, terimalah sisa tersebut. Dan aku bukanlah seorang pengawas yang bertugas menghitung dan mencatat amal perbuatan kalian. Yang menjadi pengawas kalian ialah Żat Yang Maha Mengetahui rahasia juga bisikan yang samar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Rezeki yang halal dan baik lebih baik bagi kalian dan lebih besar keberkahannya serta lebih bermanfaat daripada rezeki haram yang kalian cari. Pakailah harta yang halal itu untuk menjalankan ketaatan, dan cukupkanlah diri kalian dengan harta itu, serta syukurilah; dan Janganlah klian mengambil harta yang bukan milik kalian, jika kalian beriman kepada Allah, karena keimanan mendorong seseorang untuk menjauhi harta haram, dan berusaha mencari harta halal. Aku bukanlah pengawas kalian dan aku tidak dapat mencegah kalian mengambil harta haram, karena setiap manusia adalah pengawas bagi dirinya sendiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. بَقِيَّتُ اللهِ خَيْرٌ لَّكُمْ (Sisa (keuntungan) dari Allah adalah lebih baik bagimu) Yakni harta halal yang disisakan Allah bagi kalian dengan memenuhi hak orang lain secara adil lebih baik dan penuh berkah daripada mengurangi dan mengambil hak orang lain serta berbuat kerusakan di bumi. إِن كُنتُم مُّؤْمِنِينَ ۚ( jika kamu orang-orang yang beriman) Karena hanya orang beriman yang mengambil manfaat dari hal itu. وَمَآ أَنَا۠ عَلَيْكُم بِحَفِيظٍ (Dan aku bukanlah seorang penjaga atas dirimu) Yakni aku bukan orang yang mengawasi amal perbuatan kalian dan aku akan menghisabnya kemudian membalas kalian atas perbuatan tersebut. Namun aku hanyalah orang yang menyampaikan risalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Apa yang ditetapkan Allah bagi kalian berupa rejeki halal yang tetap setelah memberikan hak-hak (orang) dengan adil itu lebih utama dan lebih berkah bagi kalian daripada usaha haram jika kalian beriman kepada Allah, karena sesungguhnya orang mukmin itu selalu mengambil manfaat terhadap peringatan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sisa (keuntungan) dari Allah} sesuatu yang halal yang disisakan Allah untuk kalian setelah menunaikan hak-hak dengan adil {itu lebih baik bagi kalian jika kalian adalah orang-orang yang beriman. Dan aku bukanlah seorang penjaga atas diri kalian} pengawas yang menghitung pekerjaan kalian lalu aku membalas kalian atas pekerjaan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86 “sisa (keuntungan) dari Allah lah adalah lebih baik bagimu.” maksudnya, sesuatu yang disisakan untukmu dari kebaikan dan sesuatu yang ada padamu adalah cukup bagimu. jangan tamak terhadap sesuatu yang kamu tidak memerlukannya dan justru merugikanmu. ”jika kamu orang orang yang beriman” maka lakukanlah sesuai dengan tuntutan iman. ”dan aku bukanlah seorang penjaga atas dirimu” aku bukanlah penjaga dan penanggung jawab amalmu. yang menjaganya adalah Allah, aku Cuma menyampaikan risalah yang diamanatkan kepadaku."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (خَيۡرٞ لَّكُمۡ بَقِيَّتُ ٱللَّهِ) baqiyyatullahi : hasil dari jujur dalam takaran dan timbangan lebih baik daripada hal haram yang Allah haramkan untuk kalian. (وَمَآ أَنَا۠ عَلَيۡكُم بِحَفِيظٖ) wa maa ana ‘alaikum bi hafiizh : aku tidak bisa mengawasi timbangan kalian, tapi aku hanya menasehati kalian, tidak lebih. Makna ayat : Firman-Nya (بَقِيَّتُ ٱللَّهِ خَيۡرٞ لَّكُمۡ إِن كُنتُم مُّؤۡمِنِينَۚ) hasil yang kalian dapatkan dari menunaikan hak-hak manusia secara sempurna, lebih baik dari apa yang kalian peroleh dari penipuan—karena yang pertama mengandung barakah, dan yang kedua tidak–( إِن كُنتُم مُّؤۡمِنِينَۚ) jika kalian beriman dengan syariat, janji, dan ancaman-Nya, (وَمَآ أَنَا۠ عَلَيۡكُم بِحَفِيظٖ) aku tidak bisa mengawasi kalian selama transaksi kalian, tidak pula menghitung kezaliman kalian lantas membalasnya, aku hanya seorang pemberi nasihat tidak lebih. Pelajaran dari ayat : • Wajibnya ridha dengan yang halal walaupun sedikit, benci terhadap yang haram sekalipun banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 86: Yang dimaksud dengan sisa (yang halal) dari Allah adalah keuntungan yang halal dalam perdagangan setelah mencukupkan takaran dan timbangan. Daripada keuntungan yang diperoleh dari mengurangi takaran dan timbangan. Oleh karena itu kerjakanlah konsekwensi keimanan. Yang akan membalas amalmu, bahkan aku hanyalah pemberi peringatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 86",
    "description": "Sisa keuntungan yang halal dari Allah meskipun sedikit nilainya, adalah lebih baik bagimu dari pada keuntungan banyak yang diperoleh dengan cara menipu dan berbuat curang, jika kamu betul-betul orang yang beriman kepada Allah dengan menaati perintah-Nya dan menjauhi larangan-Nya. Dan aku bukanlah seorang penjaga atau saksi atas dirimu, aku hanyalah seorang rasul. Setelah nabi syuaib memberi peringatan kepada kaumnya, lalu mereka berkata, dengan nada mengejek, sombong, dan angkuh, wahai syuaib! apakah agamamu yang menyuruhmu agar kami meninggalkan apa yang disembah nenek moyang kami yaitu berhala, atau engkau melarang kami mengelola harta kami menurut cara yang kami kehendaki seperti cara membelanjakan dan cara memperolehnya yang engkau nilai sebagai kecurangan' mereka memperolok dan menyindir nabi syuaib dengan perkataan, sesungguhnya engkau benar-benar orang yang sangat penyantun dan pandai menasihati seperti itu kepada kami. Perkataan ini mereka ucapkan untuk mengejek nabi syuaib."
  }
]