[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, ”wahai syu’aib, apakah shalat yang kamu tekuni ini yang memerintahkan kamu agar kami meninggalkan apa yang disembah bapak-bapak moyang kami, berupa berhala-berhala dan patung-patung atau agar kami terkekang untuk berbuat apa saja dalam mencari penghasilan dengan semua usaha yang dapat kami tempuh berupa cara rekayasa dan tipu daya?” dan mereka berkata untuk mengoloknya, ”sesungguhnya kamu benar-benar orang yang penyantun lagi berpikiran lurus dalam harta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Kaum Syu'aib berkata, \"Wahai Syu'aib! Apakah salat yang engkau laksanakan kepada Allah itu menyuruhmu agar kami meninggalkan kebiasaan kami menyembah berhala-berhala yang dahulu disembah oleh leluhur kami, dan menyuruhmu agar kami meninggalkan kebiasaan kami mengelola dan mengembangkan harta kami sesuka hati kami?! Padahal sebelum melaksanakan dakwah ini sungguh kami mengenalmu benar-benar orang yang penyantun dan berakal sehat, orang yang pandai dan bijaksana. Jadi, apa yang telah terjadi padamu?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Namun mereka menjawab: “Hai Syuaib, apakah shalat yang selalu kamu kerjakan itu menyuruhmu agar kami meninggalkan agama nenek moyang kami, atau melarang kami memakai harta kami sesuai yang kami inginkan? Kami tidak mengenalmu melainkan seorang yang berakal dan bijak, mengapa kamu sekarang melakukan hal yang merendahkan tuhan-tuhan kami dan membuat aturan dalam muamalat kami!” Mereka juga meragukan dan menghina dakwahnya, dan menganggapnya bukan orang yang berakal. Demikianlah orang yang berakal dalam pandangan mereka, yaitu orang yang sesuai dengan orang-orang bodoh, berusaha mencari dunia, dan memakai hartanya sesuka hati tanpa ada aturan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. قَالُوا۟ يٰشُعَيْبُ أَصَلَوٰتُكَ تَأْمُرُكَ أَن نَّتْرُكَ مَا يَعْبُدُ ءَابَآؤُنَآ (Mereka berkata: “Hai Syu’aib, apakah sembahyangmu menyuruh kamu agar kami meninggalkan apa yang disembah oleh bapak-bapak kami) Berupa berhala-berhala. أَوْ أَن نَّفْعَلَ فِىٓ أَمْوٰلِنَا مَا نَشٰٓؤُا۟ ۖ( atau melarang kami memperbuat apa yang kami kehendaki tentang harta kami) Baik itu Dengan mengambil atau memberikan harta kami, menambah atau mengurangi. Itu semua adalah harta kami, tidak ada celaan bagi kami dalam memperlakukan harta kami sesuka hati kami. إِنَّكَ لَأَنتَ الْحَلِيمُ الرَّشِيدُ (Sesungguhnya kamu adalah orang yang sangat penyantun lagi berakal) Kalimat ini sebagai ejekan bagi Nabi Syu’aib, sebab mereka menganggap bahwa nabi Syu’aib kebalikan dari dua sifat itu. Terdapat pendapat mengatakan bahwa bagi mereka Nabi Syu’aib adalah orang yang penyantun dan berakal, namun mereka mengingkari perintah dan larangannya yang menyelisihi kesantunan dan akal sehat menurut mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seakan-akan mereka tidak melihat Syu'aib mengagungkan ibadah apapun seperti shalat; oleh karena itu penyebutkannya dikhususkan dalam ayat ini. 2 ). { إِنَّكَ لَأَنْتَ الْحَلِيمُ الرَّشِيدُ } \"Sesungguhnya kamu adalah orang yang sangat penyantun lagi berakal\" begitu besar pengaruh yang diberikan oleh dua sifat ini dalam mewujudkan kepemimpinan yang baik bagi orang yang memliki santun yang baik dalam akhlaqnya, dan kematangan akalnya! keduanya adalah sifat yang sangat terpuji, dan kehilangan kedua sifat ini adalah sebab jatuhnya seseorang, sekalipun ia bagian dari orang-orang terkenal!."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Dengan mengejek dan menghina, kaum itu berkata: “Apakah shalatmu memerintahmu meninggalkan berhala dan patung yang disembah leluhur kita, atau apa yang kami perbuat terhadap harta kami sesuai keinginan dan kebaikan kami berupa penambahan dan pengurangan yang kami atur sesuka hati, sedangkan kamu itu dikenal sangat toleran, memiliki akal, tidak tergesa-gesa, memiliki kesadaran atau mendapat petunjuk serta berpegang tegung pada hal itu?!” Ucapan ini dikatakan dengan cara mengejek."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Wahai Syuʻaib, apakah shalatmu yang menyuruhmu agar kami meninggalkan apa yang disembah nenek moyang kami atau melarang kami mengelola harta menurut cara yang kami kehendaki. Sesungguhnya kamu benar-benar orang yang sangat penyantun lagi cerdas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87 “mereka berkata ’hai syuaib, apakah shalatmu menyuruhmu agar kami meninggalkan tuhan yang disembah oleh bapak bapak kami” maksudnya mereka mengatakan itu sebagai ejekan terhadap nabi mereka dan ketidakmungkinan mengikutinya. makna dari apa yang mereka katakan adalah bahwa laranganmu untuk kami, hanyalah mewajibkan agar kamu shalat dan beribadah kepada Allah (semata), jika kamu memang demikian maka apakah wajib bagi kami meninggalkan apa yang disembah oleh nenek moyang kami karena suatu ucapan yang tak berdalil, melainkan hanya karena ia sesuai denganmu? Bagaimana kami mengikutimu dan meninggalkan nenek moyang kami orang orang yang berakal dan berpemikiran? Begitu pula kata katamu kepada kami, tidak mengharuskan kami melakukan pada harta kami seperti apa yang kamu katakan kepada kami berupa memenuhi takaran timbangan dan menunaikan hak hak yang wajib padanya, akan tetapi kami tetap melakukan apa yang kami kehendaki karena ia adalah harta kami, kamu tak memiliki hak apapun. Oleh Karena itu, mereka mengejeknya dengan berkata, ”sesungguhnya kamu adalah orang yang sangat penyantun lagi berakal” maksudnya bukankah kamu adalah orang dengan kelembutan, kasih sayang dan ketenangan yang telah menjadi sifat dan pembawaanmu, tidak ada yang kamu lakukan kecuali kebaikan, kamu tidak memerintahkan kecuali kebaikan dan kamu tidak melarang kecuali keburukan? yakni perkaranya tidak begitu, maksud mereka adalah bahwa syuaib memiliki sifat yang bertentangan dengan dua sifat tersebut yaitu kebodohan dan kesesatan, jadi maksudnya adalah; bagaimana kamu menjadi orang yang penyantun lagi berakal sedangkan nenek moyang kami adalah orang orang yang bodoh dan sesat? Kata kata yang mereka lontarkan adalah dengan nada mengejek dan bahwa perkaranya adalah sebaliknya, tidaklah seperti yang mereka kira, justru perkaranya seperti yang mereka katakan bahwa shalatnya memintanya melarang kaumnya menyembah tuhan yang disembah oleh nenek moyang yang sesat dan (melarang) membuat apa yang mereka inginkan pada harta mereka karena shalat melarang perbuatan keji yang lebih besar daripada penyembahan kepada selain Allah dan daripada mencurangi hak hamba hamba Allah atau mencurinya dengan timbangan dan takaran. Syuaiblah orang yang penyantun lagi berakal."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَصَلَوٰتُكَ) ashalaatuka : banyaknya shalat yang engkau lakukan memberikan efek kepada akalmu, lalu engkau menyuruh kami hal yang tidak seharusnya: meninggalkan sesembahan kami dan mengelola harta kami. (ٱلۡحَلِيمُ ٱلرَّشِيدُ) al haliimur rasyiid : yang santun dan berakal. Al-hilm (tenang) lawan dari ath-thaisy (gegabah) dan ar-rusyd (cerdas) lawan as-safah (dungu). Mereka mengatakannya bukan sebagai pujian, tapi untuk mengejek. Makna ayat : Masih menjelaskan tentang kisah Syu’aib dengan kaumnya penduduk Madyan, ketika mereka diperintahkan untuk hanya beribadah kepada Allah dan melarang mereka melakukan kecurangan dalam timbangan dan takaran, merugikan manusia, serta melakukan kerusakan di muka bumi, pada saat itu mereka memecahkan dirham dan menyebarkannya, mereka juga merampok. Mereka pun membalas sebagaimana yang Allah kabarkan, (قَالُواْ يَٰشُعَيۡبُ أَصَلَوٰتُكَ تَأۡمُرُكَ أَن نَّتۡرُكَ مَا يَعۡبُدُ ءَابَآؤُنَآ أَوۡ أَن نَّفۡعَلَ فِيٓ أَمۡوَٰلِنَا مَا نَشَٰٓؤُاْۖ) melalui perkataan ini mereka mengingkari larangannya agar tidak menyembah berhala yang dahulu disembah oleh nenek moyang mereka. Sebagaimana mereka mengingkari larangan berbuat curang pada timbangan dan takaran. Mereka juga membantah perintahnya untuk terus berbuat benar dan adil dalam jual-beli. Lalu hal tersebut mereka kaitkan dengan shalatnya yang banyak—mereka melihat itu sebagai penyebab lemahnya akal dan kurang wawasan. Perkataan mereka kepadanya (إِنَّكَ لَأَنتَ ٱلۡحَلِيمُ ٱلرَّشِيدُ ) “Sesungguhnya kamu adalah orang yang sangat penyantun lagi berakal.\" ini adalah sarkasme dan ejekan dari mereka, bukan pengakuan kesantunan Syu’aib dan kecerdasannya—dan kenyataannya memang seperti yang mereka katakan. Haliim orang yang tidak terpancing emosi lantas melakukan hal yang tidak dilakukan ketika tidak marah. Dan rasyiid lawan dari safiih (bodoh) orang yang tidak bisa mengatur keuangan dan yang lain. Inilah penjelasan ayat (87) Pelajaran dari ayat : • Penjelasan pemberian Allah kepada Nabi Sya’aib Al-‘Araby, berupa kefasihan dan retorika, sampai dijuluki Oratornya Para Nabi. • Dibencinya melakukan sesuatu yang telah dia larang dan meninggalkan sesuatu yang dia suruh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 87: Dengan nada mengejek. Yaitu patung-patung. Maksud mereka adalah bahwa hal ini menurut mereka adalah perkara yang batil, tidak mungkin diserukan oleh orang yang mengajak kepada kebaikan. Menurut mereka, perintah Beliau memenuhi takaran dan timbangan serta menunaikan hak yang wajib tidaklah wajib dilakukan mereka, karena harta itu adalah harta mereka dan Beliau tidak berhak apa-apa terhadapnya. Perkataan ini mereka ucapkan untuk mengejek Nabi Syu'aib ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 87",
    "description": "Setelah nabi syuaib memberi peringatan kepada kaumnya, lalu mereka berkata, dengan nada mengejek, sombong, dan angkuh, wahai syuaib! apakah agamamu yang menyuruhmu agar kami meninggalkan apa yang disembah nenek moyang kami yaitu berhala, atau engkau melarang kami mengelola harta kami menurut cara yang kami kehendaki seperti cara membelanjakan dan cara memperolehnya yang engkau nilai sebagai kecurangan' mereka memperolok dan menyindir nabi syuaib dengan perkataan, sesungguhnya engkau benar-benar orang yang sangat penyantun dan pandai menasihati seperti itu kepada kami. Perkataan ini mereka ucapkan untuk mengejek nabi syuaib. Mendengar sindiran mereka itu, dia'nabi syuaib'berkata, wahai kaumku! terangkan padaku jika aku mempunyai bukti yang nyata tentang apa yang aku sampaikan kepadamu dari tuhanku, dan aku dianugerahi-Nya rezeki yang baik lagi banyak dan melimpah, pantaskah aku mengabaikan perintah dan larangan-Nya' aku tidak bermaksud menyalahi kamu terhadap apa yang aku larang darinya, yakni aku tidak bermaksud melarang kamu melakukan sesuatu, sementara aku sendiri mengerjakan apa yang aku larang itu. Aku hanya bermaksud mendatangkan perbaikan dan keadilan selama aku masih sanggup melakukannya, bukan untuk memonopoli. Dan petunjuk yang aku ikuti hanya dari Allah dan tidak ada taufik bagiku untuk menegakkan kebenaran melainkan dengan pertolongan Allah. Kepada-Nya aku bertawakal setelah berusaha maksimal, dan hanya kepada-Nya pula aku kembali, yakni mengembalikan segala urusan."
  }
]