[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Syu’aib menjawab, ”wahai kaumku, apakah pendapat kalian bila aku berada di atas jalan yang jelas dari tuhanku terkait apa yang aku seru kalian kepadanya, berupa perintah mengikhlaskan ibadah kepadaNya dan terkait urusan yang aku larang kalian darinya untuk merusak harta benda, dan Dia memberikan rizki kepadaku dengan rizki melimpah yang halal lagi baik? dan aku tidak ingin menyalahi kalian dengan melakukan perkara yang aku larang kalian darinya. Dan aku tidaklah menginginkan dalam perkara yang aku perintahkan kalian melakukannya dan larang kalian darinya kecuali untuk memperbaiki keadaan kalian sesuai kesanggupan dan kemampuanku. Dan tidaklah ada taufik bagiku dalam menapaki kebenaran dan usaha memperbaiki keadaan kalian kecuali dengan taufik dari Allah. Kepada Allah lah semata aku bertawakal, dan kepadaNya lah aku kembali dengan bertaubat dan inabah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Syu'aib berkata, \"Wahai kaumku! Katakan padaku tentang keadaan kalian jika aku mempunyai bukti yang nyata dan pengetahuan yang jelas dari Tuhanku, dan Dia memberiku rezeki yang halal, serta mengangkatku menjadi Nabi. Aku tidak ingin melarang kalian melakukan sesuatu kemudian aku sendiri melakukannya. Aku tidak menginginkan apapun selain memperbaiki keadaan kalian dengan cara mengajak kalian mengesakan Tuhan kalian dan menaati-Nya sesuai dengan batas kemampuanku. Dan yang memberi pertolongan untuk mencapai tujuan itu hanyalah Allah. Hanya kepada-Nya lah aku berserah diri dalam semua urusanku. Dan hanya kepada-Nya lah aku kembali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Nabi Syuaib menjawab mereka dengan lembut: “Hai kaumku, tidakkah kalian memperhatikan, jika aku berada di atas cahaya, keyakinan, dan petunjuk dari Tuhanku yang selalu memberiku kebaikan dan mengaruniakan kepadaku rezeki yang halal, baik, dan berkah. Aku tidak ingin melarang kalian dari sesuatu namun aku sendiri melakukannya, sehingga kalian meragukanku dan berburuk sangka kepadaku. Aku tidak ingin dari dakwahku ini melainkan perbaikan yang membawa kebaikan bagi semua orang, dan agar timbangan dilakukan dengan adil dan hak-hak orang lain ditunaikan. Dan taufikku untuk saat ini dan masa depan hanya dari Allah semata, kepada-Nya aku bertawakkal dan kepada-Nya tempat kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. قَالَ يٰقَوْمِ أَرَءَيْتُمْ إِن كُنتُ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّى (Syu’aib berkata: “Hai kaumku, bagaimana pikiranmu jika aku mempunyai bukti yang nyata dari Tuhanku) Yakni bukti yang jelas tentang apa yang aku perintahkan dan aku larang pada kalian. وَرَزَقَنِى مِنْهُ رِزْقًا حَسَنًا ۚ( dan dianugerahi-Nya aku dari pada-Nya rezeki yang baik) Ada pendapat mengatakan bahwa Nabi Syu’aib memiliki banyak harta. Pendapat lain mengatakan bahwa yang dimaksud dengan rezeki yakni kenabian. Dan pendapat lain mengatakan yang dimaksud adalah hikmah. Yakni apakah kalian mengira jika datang kepadaku perintah dari Allah untuk menyampaikannya kepada kalian maka aku akan meninggalkan hal itu hanya karena kalian tidak menolaknya? وَمَآ أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَىٰ مَآ أَنْهَىٰكُمْ عَنْهُ ۚ( Dan aku tidak berkehendak menyalahi kamu (dengan mengerjakan) apa yang aku larang) Yakni bukanlah sifatku, melarang kalian dari berbuat sesuatu kemudian aku sendiri melakukannya. إِنْ أُرِيدُ إِلَّا الْإِصْلٰحَ(Aku tidak bermaksud kecuali (mendatangkan) perbaikan) Aku tidak menginginkan dari perintah dan larangan ini melainkan perbaikan bagi kalian dan mencegah kerusakan dalam agama dan muamalat kalian. مَا اسْتَطَعْتُ ۚ( selama aku masih berkesanggupan) Yakni sesuai dengan kemampuanku. وَمَا تَوْفِيقِىٓ إِلَّا بِاللهِ ۚ( Dan tidak ada taufik bagiku melainkan dengan (pertolongan) Allah) Yakni tidaklah aku menjadi orang yang mendapat taufik, memberi petunjuk, dan seorang nabi, kecuali dengan pertolongan Allah dan pemberian-Nya. عَلَيْهِ تَوَكَّلْتُ(Hanya kepada Allah aku bertawakkal) Dalam segala urusanku. وَإِلَيْهِ أُنِيبُ (dan hanya kepada-Nya-lah aku kembali) Yakni aku mengembalikan dan menyerahkan segala urusanku kepada apa yang dipilihkan Allah untukku."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tiga faidah dan pesan penting dari perkataan Syu'aib kepada keumnya, yang mesti dijaga bagi siapapun yang berakal, yaitu : حق الله (Haq Allah), حق النفس (Haq diri), حق الناس (Haq orang lain). 2 ). Diantara malu yang terpuji adalah : ia malu ketika diceritakan satu keburukan dari dirinya, ia senantiasa menjaga reputasi dirinya dari kotoran apapun, jauh dari segala rumor yang buruk { وَمَا أُرِيدُ أَنْ أُخَالِفَكُمْ إِلَىٰ مَا أَنْهَاكُمْ عَنْهُ } \"Dan aku tidak berkehendak menyalahi kamu (dengan mengerjakan) apa yang aku larang\". 3 ). { إِنْ أُرِيدُ إِلَّا الْإِصْلَاحَ مَا اسْتَطَعْتُ } \"Aku tidak bermaksud kecuali (mendatangkan) perbaikan selama aku masih berkesanggupa\" yakni : aku tidak bermaksud lain kecuali mendatangkan kebaikan bagi kalian, dan mendatangkan manfaat yang terus berlanjut, dan tidaklah aku bermaksud hanya untuk diriku sendiri sebagaimana yang aku mampu, maka tatkala ayat ini menjadi tazkiyah untuk kita, kuatkanlah keyakinan dengan apa yang datang setelahnya : { وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ } \"Dan tidak ada taufik bagiku melainkan dengan (pertolongan) Allah. Hanya kepada Allah aku bertawakkal dan hanya kepada-Nya-lah aku kembali\". 4 ). Bukan menjadi syarat untuk menghadirkan perbaikan agar keberhasilan itu tercapai : { إِنْ أُرِيدُ إِلَّا الْإِصْلَاحَ مَا اسْتَطَعْتُ ۚ وَمَا تَوْفِيقِي إِلَّا بِاللَّهِ ۚ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ } \"Aku tidak bermaksud kecuali (mendatangkan) perbaikan selama aku masih berkesanggupan. Dan tidak ada taufik bagiku melainkan dengan (pertolongan) Allah. Hanya kepada Allah aku bertawakkal dan hanya kepada-Nya-lah aku kembal\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Syuaib berkata: “Wahai kaumku, beritahu aku jika aku memiliki pengetahuan dan bukti nyata dari Tuhanku tentang apa yang aku serukan kepada kalian, dan memberiku rejeki yang melimpah lagi baik, maka apakah masuk akal jika aku menentang perintah Allah dan laranganNya? Tidak masuk akal dan bukan urusanku untuk melarang sesuatu kepada kalian lalu aku melaksanakan sesuatu yang bertentangan. Aku tidak menghendaki apapun kecuali hanya perbaikan dengan berlaku adil sebisaku. Dan tidak ada yang menolongku dalam melakukan kebenaran kecuali Allah SWT. Hanya kepadaNyalah aku menyerahkan dan mengembalikan seluruh urusanku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Wahai kaumku, jelaskan pendapat kalian} beritahulaah aku {jika aku mempunyai bukti nyata dari Tuhanku dan Dia menganugerahiku rezeki yang baik} halal {Aku tidak ingin berselisi dengan kalian tentang apa yang aku larang kepada kalian. Aku tidak lain hanya menginginkan perbaikan sesuai dengan kemampuanku. Tidak ada kemampuan bagiku melainkan dengan (pertolongan) Allah. KepadaNya aku bertawakal dan kepadaNya (pula) aku kembali} Aku kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88 “syuaib berkata” kepada mereka, ”hai kaumku, bagaimana pendapatmu jika aku mempunyai bukti yang nyata dari Rabbku” yakni keyakinan dan ketenangan tentang kebenaran agama yang aku bawakan, ”dan Dia menganugerahiku dari padaNya rizki yang baik (patutkah aku menyalahi perintahNya)?” yakni Allah memberiku berbagai macam harta kekayaan. ”dan” aku tidak “berkendak menyalahi kamu (dengan mengerjakan) apa yang aku larangkan untukmu” aku tidak ingin melarangmu dari perbuatan curang dalam timbangan dan takaran sedangkan aku melakukannya sehingga akibatnya adalah aku dituduh dalam hal itu, justru tidaklah aku melarang suatu perkara melainkan akulah orang pertama yang meninggalkannya. “tidaklah aku bermaksud melainkan (mendatangkan) perbaikan selama aku masih berkesanggupan” yakni, aku tidak punya maksud dan tujuan kecuali untuk memperbaiki kondisi kalian dan menegakan manfaat untuk kalian, aku tidak punya tujuan khusus untuk diriku saja sebatas kemampuanku, ini merupakan jenis tazkiyah untuk diri, dan penolaknya adalah ucapannya \"dan tidak ada taufik bagiku melainkan dengan (pertolongan) Allah” maksudnya, taufik yang aku dapatkan untuk melakukan kebaikan dan menghindari kejahatan, tidak lain kecuali dari Allah, bukan karena daya dan kekuatanku. ”hanya kepada Allah aku bertawakal” aku bersandar kepadaNya dalam urusanku, dan aku percaya dengan jaminanNya. ”dan hanya kepadaNyalah aku kembali” dalam menunaikan ibadah yang Dia perintahkan kepadaku. Dalam hal ini terdapat makna usaha mendekatkan diri kepadaNya dengan perbuatan perbuatan baik. Dengan dua perkara ini, segala urusan seseorang hamba menjadi lurus yaitu meminta pertolongan kepada Allah dan kembali kepadaNya sebagai FirmanNya, ”maka sembahlah Dia, dan bertawakallah kepadaNya” Dan Dia berfirman \"Hanya kepadaMu kami menyembah dan hanya kepadaMu kami meminta pertolongan\"."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أَنۡ أُخَالِفَكُمۡ) an ukhaalifakum : aku tidak ingin melarang sesuatu untuk kalian tinggalkan, akan tetapi aku malah melakukannya. (إِنۡ أُرِيدُ إِلَّا ٱلۡإِصۡلَٰحَ) In uriidu illal ishlaah : aku tidak menginginkan apa-apa kecuali kebaikan untuk kalian. (وَمَا تَوۡفِيقِيٓ إِلَّا بِٱللَّهِۚ) wa maa taufiiqii illa billah : aku tidaklah melakukan perbaikan kecuali atas taufik dari Allah dan karunia-Nya kepadaku. (وَإِلَيۡهِ أُنِيبُ) wa ilaihi uniib : aku menyandarkan semua perkaraku kepada-Nya. Makna ayat : Adapun 3 ayat setelahnya, menjelaskan balasan Syu’aib atas perkataan mereka, (يَٰقَوۡمِ أَرَءَيۡتُمۡ) kabarkanlah kepadaku, (ۡ إِن كُنتُ عَلَىٰ بَيِّنَةٖ مِّن رَّبِّي) “jika aku mempunyai bukti yang nyata dari Tuhanku” di atas bukti kebenaran dan pengetahuan tentang ketuhanan-Nya, perkara-perkara yang Dia cintai dan Dia murkai, janji-Nya bagi wali-wali-Nya dan ancaman untuk musuh-musuh-Nya. (وَرَزَقَنِي مِنۡهُ رِزۡقًا حَسَنٗاۚ) “dan dianugerahi-Nya aku daripada-Nya rezeki yang baik (patutkah aku menyalahi perintah-Nya)?” halal dan thayyib, maka apakah pantas bagiku menutupi kebenaran dan kebaikan ini lalu membantu kalian melakukan hal yang batil, demi Allah tidak akan, dan aku tidak ingin menyelisihi apa yang telah ku larang, aku tidak memerintahkan untuk menyempurnakan timbangan, tapi aku malah menguranginya, tidak pula menyuruh kalian meninggalkan berhala-berhala kalian, tapi aku malah menyembah mereka, aku melarang kalian dari memecahkan dirham namun aku juga melakukannya, maka aku seperti orang yang memerintahkan sesuatu tapi tidak melaksanakannya, dan melarang dari sesuatu tapi malah mengerjakannya, lantas pantas dicela, dicerca, dan tidak dapat dipercaya, tidak pula dianggap perkataannya, serta pendapatnya tertolak. Tapi sebaliknya aku tidak menginginkan dari perintahku tidak pula laranganku (أُرِيدُ إِلَّا ٱلۡإِصۡلَٰحَ) kecuali kebaikan bagi kalian (مَا ٱسۡتَطَعۡتُۚ) sebisa ku (وَمَا تَوۡفِيقِيٓ) dan petunjuk yang aku ikuti (إِلَّا بِٱللَّهِۚ) hanya dari Allah Rabb kalian (عَلَيۡهِ تَوَكَّلۡتُ) kepada-Nya lah aku menyerahkan segala urusanku (وَإِلَيۡهِ) dan hanya kepada-Nya (أُنِيبُ) aku kembali kepada-Nya dengan taubat dan taat. Pelajaran dari ayat : • Dibencinya keras kepala, enggan mengakui kebenaran dan tidak mau mengikutinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 88: Yakni berada di atas keyakinan dan ketenangan dalam hal kebenaran yang dibawanya. Dengan menyampurkan yang halal dengan yang haram hasil dari mengurangi takaran dan timbangan. Yakni aku tidak menginginkan ketika melarang kamu mengurangi takaran dan timbangan, lalu aku melakukannya, bahkan aku tidaklah melarang sesuatu melainkan aku sebagai orang pertama yang meninggalkannya. Oleh karena dalam ucapan ini ada sedikit tazkiyah (perekomendasian) terhadap diri, maka Nabi Syu’aib melanjutkan dengan kata-kata yang tersebut di atas. Sehingga dapat melakukan yang demikian dan melakukan ketaatan lainnya. Bukan karena usaha dan kekuatanku. Bersandar dan percaya dengan pencukupan dari-Nya. Dalam melakukan apa yang diperintahkan kepadaku berupa berbagai macam ibadah. Dengan tawakkal dan kembali kepada Allah keadaan hamba menjadi baik, sebagaimana dalam ayat 5 surat Al Fatihah, “Hanya kepada Engkau kami menyembah dan hanya kepada Engkau kami memohon pertolongan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 88",
    "description": "Mendengar sindiran mereka itu, dia'nabi syuaib'berkata, wahai kaumku! terangkan padaku jika aku mempunyai bukti yang nyata tentang apa yang aku sampaikan kepadamu dari tuhanku, dan aku dianugerahi-Nya rezeki yang baik lagi banyak dan melimpah, pantaskah aku mengabaikan perintah dan larangan-Nya' aku tidak bermaksud menyalahi kamu terhadap apa yang aku larang darinya, yakni aku tidak bermaksud melarang kamu melakukan sesuatu, sementara aku sendiri mengerjakan apa yang aku larang itu. Aku hanya bermaksud mendatangkan perbaikan dan keadilan selama aku masih sanggup melakukannya, bukan untuk memonopoli. Dan petunjuk yang aku ikuti hanya dari Allah dan tidak ada taufik bagiku untuk menegakkan kebenaran melainkan dengan pertolongan Allah. Kepada-Nya aku bertawakal setelah berusaha maksimal, dan hanya kepada-Nya pula aku kembali, yakni mengembalikan segala urusan. Setelah nabi syuaib menjelaskan maksud dan tujuannya, sehingga tidak ada alasan untuk mengecam apa yang disampaikan beliau, kemudian nabi syuaib memperingatkan mereka dengan pernyataan, dan wahai kaumku! janganlah pertentangan antara aku dengan kamu menyebabkan kamu berbuat dosa terhadap perintah Allah, sehingga kamu akan ditimpa siksaan seperti yang menimpa kaum nabi nuh yang ditenggelamkan, kaum nabi hud yang dimusnahkan dengan angin kencang yang dingin, atau kaum nabi saleh yang disiksa dengan suara yang mengguntur, sedang kaum nabi lut tidak jauh masa maupun jarak wilayahnya dari kamu, juga telah diazab dengan dihujani batu. Jika kamu mengingkari risalahku, tidak mustahil azab tersebut akan menimpa kamu juga."
  }
]