[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, janganlah permusuhan dan kebencian kepadaku serta perbedaan agama yang aku yakini sampai menyeret kalian untuk melakukan penentangan dan bertahan di atas keadaan kalian berupa kekafiran kepada Alalh, akibatnya akan menimpa kalian seperti apa yang menimpa kaum nuh, kaum hud atau kaum shaleh berupa kehancuran. Dan tidaklah jauh kaum luth dan siksaan yang mendera mereka dengan kalian, dari negeri dan masa kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Wahai kaumku! Jangan sekali-kali rasa permusuhan kalian kepadaku mendorong kalian untuk mendustakan ajaran yang kubawa. Karena aku khawatir kalian akan ditimpa azab seperti yang menimpa kaum Nuh, kaum Hūd, atau kaum Ṣāleḥ. Sedangkan kaum Lūṭ tidaklah jauh dari kalian, baik dari segi waktu maupun tempat. Dan kalian benar-benar mengetahui apa yang menimpa mereka. Maka ambillah pelajaran berharga dari kisah-kisah mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Ketika hati mereka tidak terbuka terhadap dakwah Nabi Syuaib dan tidak mau menerima nasihatnya, maka dia kemudian mengingatkan mereka tentang kesudahan orang-orang kafir dan sesat sebelum mereka, dia menyeru mereka dengan penuh perhatian: “Hai kaumku, berhati-hatilah jika kalian menyelisihi dan memusuhiku, kalian akan seperti umat-umat terdahulu yang telah binasa, kalian akan ditimpa azab dan siksaan sebagaimana kaum Nabi Nuh, Hud, dan Shalih, dan kalian juga tidak jauh dari kaum Nabi Luth dalam hal jarak waktu, tempat, dan perkara kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. وَيٰقَوْمِ لَا يَجْرِمَنَّكُمْ شِقَاقِىٓ (Hai kaumku, janganlah hendaknya pertentangan antara aku (dengan kamu) menyebabkan kamu menjadi jahat) Yakni janganlah permusuhan kalian kepadaku menjadikan kalian mendustakan aku, sehingga balasan kalian adalah azab yang menimpa kalian seperti azab yang telah menimpa umat sebelum kalian. وَمَا قَوْمُ لُوطٍ مِّنكُم بِبَعِيدٍ (sedang kaum Luth tidak (pula) jauh (tempatnya) dari kamu) Yakni tempat tinggal mereka tidak jauh dari tempat tinggal kalian, atau zaman mereka tidak jauh dari zaman kalian, oleh sebab itu takutlah tertimpa seperti apa yang menimpa mereka jika kalian bermaksiat kepada Allah seperti mereka bermaksiat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَيَا قَوْمِ لَا يَجْرِمَنَّكُمْ شِقَاقِي } Assuddy menjelaskan ayat ini : jangalah kalian terbawa oleh permusuhanku dengan kalian sehingga kalian terus menerus berada pada kesesatan dan kekafiran; dengannya kalian akan ditimpa azab sebagaimana mereka (kaum Nuh) mengalami hal yang sama! Dan diantaa faidah dari perkataan Assuddy : bahwasanya orang yang berakal tidak memusuhi kebenaran karena ia hanya akan memusuhi siapa saja yang membawanya; dan sikapnya itu tidak lain hanya mendatangkan keburukan bagi dirinya sendiri!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Wahai kaumku, jangan sampai musuh dan pembangkangku yang keras dalam mendustakanku itu menghasut kalian, sehingga kalian akan ditimpa azab sebagaimana yang diterima kaum Nuh berupa azab tenggelam, kaum Hud berupa angin kencang yang menyebarknan udara dingin, atau kaum Shalih berupa guncangan dan bumi yang menenggelamkan mereka. Dan pembinasaan kaum Luth itu tidak jauh kabar, tempat dan waktunya. Apakah kalian tidak mengambil pelajaran?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai kaumku, jangan sekali-kali pertentanganku} pertentangan dan perselisihanku {menjadikan kalian} membawa kalian {ditimpa sesuatu seperti apa yang menimpa kaum Nuh, kaum Hud, atau kaum Shalih, dan tidaklah kaum Luth itu jauh dari kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89 “hai kaumku, janganlah pertentangan anatara aku (dengan kamu) menyebabkan kamu menjadi jahat” yakni pertentangan dan perselisihan antara kita, jangan memicumu berlaku tidak baik “hingga kamu ditimpa” azab ”seperti yang menimpa kaum Nuh atau kaum Hud atau kaum shaleh, sedang kaum Luth tidak (pula) jauh (tempatnya) dari kamu” tidak jauh tempatnya dan tidak pula masanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (لَا يَجۡرِمَنَّكُمۡ شِقَاقِيٓ) laa yajrimannakum syiqaaqii : jangan sampai perselisihan kalian terhadap ku menyebabkan turunnya azab, sebagaimana yang terjadi kepada kaum Nuh dan umat-umat setelahnya. (وَمَا قَوۡمُ لُوطٖ مِّنكُم بِبَعِيدٖ) wa maa qaumu luthim minkum bi ba’iid : dari sisi waktu dan tempat, lokasi danau Luth agak dekat dengan negeri Madyan—diantara Ma’an dan Urdun. Makna ayat : Kemudian memperingatkan mereka untuk tidak menentang dan keras kepala (وَيَٰقَوۡمِ لَا يَجۡرِمَنَّكُمۡ) “Wahai kaumku, jangan sampai perselisihan antara aku dengan kalian dalam perkara kufur dan maksiat, menyebabkan kalian terkena azab, sebagaimana azab itu turun kepada kaum Nuh dengan ditenggelamkannya mereka, kaum Hud dengan angin yang membinasakan, atau kaum Shalih dengan guntur yang mengguncang bumi, (وَمَا قَوۡمُ لُوطٖ مِّنكُم بِبَعِيدٖ) sedang kaum Luth tidak jauh dari kalian—tempat dan masanya—dan kalian sudah mengetahui bagaimana mereka hancur dan binasa"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 89: Yakni tempat tinggalnya atau waktu kebinasaan mereka tidak jauh dari kamu. Oleh karena itu, ambillah pelajaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 89",
    "description": "Setelah nabi syuaib menjelaskan maksud dan tujuannya, sehingga tidak ada alasan untuk mengecam apa yang disampaikan beliau, kemudian nabi syuaib memperingatkan mereka dengan pernyataan, dan wahai kaumku! janganlah pertentangan antara aku dengan kamu menyebabkan kamu berbuat dosa terhadap perintah Allah, sehingga kamu akan ditimpa siksaan seperti yang menimpa kaum nabi nuh yang ditenggelamkan, kaum nabi hud yang dimusnahkan dengan angin kencang yang dingin, atau kaum nabi saleh yang disiksa dengan suara yang mengguntur, sedang kaum nabi lut tidak jauh masa maupun jarak wilayahnya dari kamu, juga telah diazab dengan dihujani batu. Jika kamu mengingkari risalahku, tidak mustahil azab tersebut akan menimpa kamu juga. Dan oleh karena itu, mohonlah ampunan atas dosa-dosa yang telah kamu lakukan kepada tuhanmu Allah yang maha pengampun, kemudian bertobatlah dengan sungguh-sungguh kepada-Nya dan bertekad tidak mengulangi kesalahan lagi, serta memperbanyak amal saleh. Sungguh, tuhanku maha penyayang terhadap hamba-hamba-Nya yang mau bertobat, mereka akan dihindarkan dari azab-Nya; lagi maha pengasih yang menganugerahkan kenikmatan kepada hamba-Nya yang berbuat kebajikan."
  }
]