[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kami memberikan kepada manusia kenikmatan dari kami, berupa kesehatan, keamanan dan nikmat lainnya, kemudian kami mencabut nikmat-nikmat itu darinya, maka dia menjadi sangat putus asa dari rahmat Allah, mereka ingkar terhadap nikmat yang telah Allah karuniakan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Sungguh jika Kami memberikan suatu nikmat kepada manusia, seperti nikmat kesehatan dan kekayaan, kemudian Kami cabut nikmat itu darinya, ia pasti akan merasa sangat putus asa terhadap rahmat Allah dan sangat ingkar terhadap nikmat-Nya. Ia melupakan nikmat itu apabila sudah dicabut darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Bentuk keburukan tabiat adalah mengeluh dan marah ketika kenikmatan hilang darinya, sehingga ia merasa jauh dari kebaikan dan putus asa dari segala rahmat serta melupakan kenikmatan yang telah ia rasakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَلَئِنْ أَذَقْنَا الْإِنسٰنَ (Dan jika Kami rasakan kepada manusia) Yakni inilah tabiat manusia, merasa putus asa ketika kenikmatan itu diambil dari mereka, serta menjadi lalai ketika musibah telah diangkat. مِنَّا رَحْمَةً(suatu rahmat (nikmat) dari Kami) Berupa rejeki yang luas, kesehatan, dan keselamatan dari berbagai musibah. ثُمَّ نَزَعْنٰهَا مِنْهُ (kemudian rahmat itu Kami cabut daripadanya) Yakni kami ambil kenikmatan itu darinya. إِنَّهُۥ لَيَـُٔوسٌ (pastilah dia menjadi putus asa) Yakni putus asa dari kenikmatan, dan merasa kenikmatan itu dan kenikmatan lainnya tidak akan kembali ia dapatkan. كَفُورٌ (lagi tidak berterima kasih) Yakni sangat ingkar dan melupakan segala kenikmatan yang telah ia nikmati dahulu, sehingga mereka tidak mensyukirinya setelah kenikmatan itu hilang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Jika Kami anugerahkan kepada mukmin ataupun kafir berupa rahmat (nikmat), rasa aman, kesehatan maupun keluasan rezeki, kemudian anugerah itu Kami cabut dari mereka, maka pastilah dia menjadi putus asa serta tidak berterima kasih"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh jika Kami membuat manusia merasakan suatu rahmat dari Kami} kenikmatan {kemudian Kami mencabut kembali} Kami merenggut {darinya, sesungguhnya dia menjadi putus asa} sangat putus asa {lagi sangat kufur} sangat kufur terhadap nikmat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Allah mengabarkan tentang tabiat manusia bahwa dia itu bodoh dan zhalim, bahwa jika Allah memberikan rahmat kepadanya seperti rizki, kesehatan, anak keturunan dan lain-lain, kemudian Dia mengambil darinya, maka dia menyerah dan tunduk kepada keputusasaan tidak berharap pahala dari Allah dan tidak terlitas dibenaknya bahwa Allah akan mengembalikannya atau yang sepertinya atau yang lebih baik daripadanya, dan bahwa jika Allah melimpahkan rahmat setelah kesulitan yang menimpanya maka dia berbahagia menyombongkan diri dan menyangka harta yang banyak itu akan langgeng, seraya dia berkata ”telah hilang bencana bencana itu dariku’ sesungguhnya dia sangat gembira lagi bangga” maksudnya dia berbahagia dengan apa yang diberikan kepadamya hamba-hambaNYa. Hal itu membuat lupa diri, sombong, angkuh, takabur dihadapan manusia, menghina dan merendahkan mereka. Adakah cacat yang lebih berat daripada ini?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (أذقنا الإنسان) Adzaqnal insaan : Kami berikan mereka rahmat yaitu kekayaan dan kesehatan. (ثم نزعناها منه) Tsumma naza’naahaa minhu : Kemudian kami cabut dari mereka nikmat tersebut. (يئوس كفور) Yauusun kafuur : Sangat putus asa dan ingkar. Makna ayat : Allah memberitahukan bahwa manusia yang belum mengikuti cahaya iman dan tidak berhias dengan amalan saleh, ketika mereka merasakan kenikmatan dari Allah, dengan kelapangan hidup dan kesehatan fisik, lalu Dia mengambilnya dari mereka (إنه) yaitu manusia tersebut (ليئوس) sangat putus asa (كفور) lagi sangat ingkar kepada Rabbnya yang telah memberikan kenikmatan, lagi tidak mengakui apa yang telah Rabbnya berikan. Pelajaran dari ayat: • Ketika manusia tidak memiliki iman dan amal saleh, ia akan berada di dalam puncak kelemahan dan kemunduran rohani. • Tercela dan haramnya berputus asa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 9: Allah Subhaanahu wa Ta'aala memberitahukan tentang tabi’at manusia yang zalim lagi jahil, bahwa jika Allah memberikan rahmat kepadanya seperti sehat dan rezeki yang banyak, lalu dicabut-Nya rahmat itu, maka ia langsung berputus asa; tidak mengharap pahala Allah terhadap musibah itu, dan tidak terlintas dalam hatinya bahwa Allah Subhaanahu wa Ta'aala akan mengembalikannya atau mengembalikan yang semisalnya atau bahkan yang lebih baik daripadanya, dan bahwa jika Alah memberikan rahmat setelah ia ditimpa bencana, ia pun langsung bergembira dan berbangga serta mengira bahwa kenikmatan itu akan tetap langgeng padanya. Ia bergembira karena nikmat itu dan membanggakan diri di hadapan hamba-hamba Allah dengan bersikap sombong dan ujub lagi merendahkan mereka. Inilah tabi’at manusia. Namun tidak semua manusia seperti ini, bahkan di antara mereka ada yang diberi taufiq oleh Allah dan dikeluarkan-Nya dari akhlak tercela ini seperti yang disebutkan di ayat 11 surat ini. Seperti halnya orang yang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 9",
    "description": "Setelah pada ayat sebelumnya dijelaskan tentang penciptaan langit dan bumi serta apa-apa yang ada pada keduanya, untuk menguji manusia, apakah mensyukuri nikmat Allah atau mengingkarinya, maka pada ayat ini Allah menerangkan tentang tabiat manusia pada umumnya. Dan jika kami berikan rahmat kami ke-pada manusia berupa kesehatan, harta kekayaan, kedudukan, keturun-an, dan rasa aman, kemudian rahmat itu kami cabut kembali, maka pasti-lah dia menjadi putus asa. Mereka hanya memperlihatkan keingkaran dan tidak berterima kasih serta tidak pula menghargai nikmat-nikmat yang masih ada pada dirinya. Dan jika kami berikan kebahagiaanberupa keluasan rezeki, kehidupan yang menyenangkan, dan kesehatan kepadanya setelah ditimpa bencana berupa malapetaka, kemiskinan, kesulitan hidup, atau sakit yang menimpanya, niscaya dia akan berkata dengan nada sombong, telah hilang bencana itu dariku. Sesungguhnya dia merasa sangat gembira dan bangga, karena menganggap bahwa dirinya telah selamat dari bencana itu. Padahal Allahlah yang telah menyelamatkan mereka, dan mereka tidak menyadari hal itu."
  }
]