[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mohonlah kepada tuhan kalian ampunan bagi dosa-dosa kalian, kemudian kembalilah kepada ketaatan kepadaNya, dan teruslah di atas itu. Sesungguhnya tuhanku Mahapengasih lagi Maha penyayang terhadap orang yang bertaubat dan kembali kepadaNYa, Dia akan mengampuni dan menerima taubatnya.” maka, dalam ayat ini terdapat penetapan sifat (rahmat) menyayangi dan mawadah (mengasihi) bagi Allah , sesuai dengan (keagungan)Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Mohonlah ampun kepada Tuhan kalian. Kemudian bertobatlah kepada-Nya dari dosa-dosa kalian. Sesungguhnya Tuhanku Maha Penyayang kepada orang-orang yang bertobat, lagi Maha Mencintai mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Dan bersegeralah memohon ampun kepada Allah sebelum terlambat, kemudian beristiqamahlah di atas jalan bertaubatan yang aku serukan ini. Sungguh Tuhanku yang menjaga dan mengurusiku Maha Pengasih bagi orang yang bertaubat, Mencintai hamba-hamba-Nya yang beriman, dan merekapun mencintai-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. إِنَّ رَبِّى رَحِيمٌ (Sesungguhnya Tuhanku Maha Penyayang) Memiliki rahmat yang agung bagi para hamba yang bertaubat. وَدُودٌ (lagi Maha Pengasih) Allah memperlakukan orang yang bertaubat dan memohon ampun dengan penuh kasih sayang, dengan berlemah lembut kepada mereka, menggiring kebaikan kepada mereka, dan mencegah keburukan dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Memohon ampunlah kepada Tuhanmu atas dosa-dosamu, lalu bertaubatlah dari kemaksiatan yang lalu. Sesungguhnya Tuhanku Maha Pemurah lagi Maha Penyayang bagi orang-orang yang mau bertaubat, serta Maha menakdirkan suatu kelembutan dan kebaikan bagi mereka sebagaimana menentukan ketulusan cinta bagi orang yang mencintaiNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mohonlah ampunan kepada Tuhan kalian kemudian bertaubatlah kepadaNya. Sesungguhnya Tuhanku Maha Penyayang lagi Maha Mencintai.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90 “dan mohonlah ampun kepada Rabbmu” dari dosa dosa yang kamu lakukan “kemudian bertaubatlah kepadaNya” dalam sisa umurmu dengan taubat nasuha, kembali kepadaNya dengan menaatiNya dan tidak menyelisihiNya ”sesungguhnya Rabbku maha penyayang lagi maha pengasih” bagi yang bertaubat dan kembali kepadaNya, Dia merahmatinya, mengampuninya, mencintainya, dan menerima taubatnya. Al wadud adalah nama Allah. makna wadud adalah bahwa Allah mencintai hamba hamba yang beriman, dan merekapun mencintaiNya. Itu berwaza \"fa'uul\" bermakna \"faa'il\" dan \"maf'ul\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (رَحِيمٞ وَدُودٞ) rahiimuw waduud : Maha Pengasih kepada kaum mukminin dan Mencintai orang-orang yang bertakwa. Makna ayat : . Dan beristighfarlah kepada Rabb kalian atas dosa syirik dan maksiat lalu kembalilah kalian kepadanya dengan ketaatan. (إِنَّ رَبِّي رَحِيمٞ) sungguh Tuhanmu Maha Penyayang bagi hamba-Nya yang bertaubat (وَدُودٞ ) mencintai hamba-Nya yang kembali kepada-Nya. Pelajaran dari ayat : • Wajibnya istighfar dan taubat dari dosa. • Penyebutan sifat Allah berupa Rahmat dan Cinta"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 90: Terhadap dosa-dosa yang kamu lakukan. Dengan tobat yang sesungguhnya dan kembali menaati-Nya serta menjauhi larangan-Nya. Bagi orang yang bertobat dan kembali. Dia akan menyayanginya, mengampuninya, menerima tobatnya, dan mencintainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 90",
    "description": "Dan oleh karena itu, mohonlah ampunan atas dosa-dosa yang telah kamu lakukan kepada tuhanmu Allah yang maha pengampun, kemudian bertobatlah dengan sungguh-sungguh kepada-Nya dan bertekad tidak mengulangi kesalahan lagi, serta memperbanyak amal saleh. Sungguh, tuhanku maha penyayang terhadap hamba-hamba-Nya yang mau bertobat, mereka akan dihindarkan dari azab-Nya; lagi maha pengasih yang menganugerahkan kenikmatan kepada hamba-Nya yang berbuat kebajikan. Setelah diuraikan nasihat nabi syuaib kepada kaumnya supaya mengikuti jalan yang benar, kemudian dipaparkan tentang jawaban mereka setelah mendengar nasihat nabi syuaib, seraya berkata, wahai syuaib! kami tidak banyak mengerti tentang apa yang engkau katakan itu, sedang kenyataannya kami memandang atau menilai engkau sekarang ini sebagai seorang yang lemah di antara kami, karena tidak memiliki kekuatan, baik berupa harta kekayaan atau kekuasaan untuk melawan kami. Kalau tidak karena kami memandang keluargamu, tentu kami telah merajam engkau dengan melempari batu hingga mati, sedang engkau pun bukan seorang yang berpengaruh, memiliki kewibawaan atau kedudukan di lingkungan kami. 92. Mendengar hina."
  }
]