[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”wahai syu’aib, kami tidak banyak memahami apa yang kamu ucapkan. Dan sesungguhnya kami melihat dirimu orang yang lemah di tengah kami, kamu bukanlah termasuk pembesar-pembesar, bukan pula termasuk para penguasa. Kalaulah bukan karena mempertimbangkan keluarga besarmu, pastilah kami akan membunuhmu dengan bentuk rajam dengan bebatuan(kepadamu),” dan waktu itu keluarganya masih berada di atas keyakinan kaumnya. ”dan kamu tidaklah memiliki kedudukan dan kehormatan pada pandangan kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Kaum Syu'aib berkata, \"Wahai Syu'aib! Kami tidak banyak mengerti ajaran yang engkau bawa. Dan kami melihat engkau adalah orang yang lemah di antara kami, karena kedua matamu lemah atau buta. Seandainya keluargamu bukan penganut agama kami, niscaya kami telah membunuhmu dengan melemparimu dengan batu. Dan engkau bukanlah orang yang kami hormati, sehingga kami tidak takut membunuhmu. Kami tidak membunuhmu semata-mata karena kami menghormati keluargamu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Mereka menjawab dengan kesal: “Hai Syuaib, kami tidak memahami apa yang kamu katakan.” Mereka menjadikan perkataan dan hujjahnya yang jelas itu sebagai sesuatu yang sulit dipahami sehingga akal mereka tidak mampu memahaminya. Mereka melanjutkan: “Dan kami sungguh menganggap kamu adalah orang lemah, sehingga kami tidak peduli telah menyelisihimu dan mengacuhkan dakwahmu; kalaulah bukan karena keluargamu, niscaya kami akan melemparimu dengan batu; kamu tidak memiliki tempat di hati kami dan tidak memiliki pelindung yang menghalangi kami untuk membunuhmu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. قَالُوا۟ يٰشُعَيْبُ مَا نَفْقَهُ كَثِيرًا مِّمَّا تَقُولُ (Mereka berkata: “Hai Syu’aib, kami tidak banyak mengerti tentang apa yang kamu katakan itu) Kamu mendatangi kami dengan kabar berita ghaib yang tidak kami kenal sebelumnya seperti tentang kenabianmu, dan kelemah-lembutan, rahmat, dan kasih sayang Allah, serta kabar tentang hari kebangkitan, sedangkan kami tidak mengetahui hal-hal tersebut. Yakni kami tidak mengetahuinya sebagaimana mengetahui hal-hal yang kasat mata. وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفًا ۖ( dan sesungguhnya kami benar-benar melihat kamu seorang yang lemah di antara kami) Yakni kamu tidak memiliki kekuatan yang dapat melindungi dirimu dari kami dan mampu untuk menyelisihi kami. وَلَوْلَا رَهْطُكَ لَرَجَمْنٰكَ ۖ( kalau tidaklah karena keluargamu tentulah kami telah merajam kamu) Yakni pastilah kami telah membunuhmu dengan lemparan batu. Makna (رهط الرجل) yakni keluarga seseorang yang menjadi sandaran baginya dan sumber kekuatannya. Orang-orang kafir ini menjadikan keluarganya sebagai pencegah niat mereka untuk merajamnya padahal keluarganya berjumlah sedikit sedangkan jumlah orang kafir beribu-ribu adalah karena keluarganya tersebut berada dalam agama orang-orang kafir, sehingga mereka masih menghormati dan takut dari keluarganya. وَمَآ أَنتَ عَلَيْنَا بِعَزِيزٍ (sedang kamupun bukanlah seorang yang berwibawa di sisi kami) Namun kami tidak merajammu karena masih menghormati keluargamu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { قَالُوا۟ يٰشُعَيْبُ مَا نَفْقَهُ كَثِيرًا مِّمَّا تَقُولُ } \"Mereka berkata: “Hai Syu’aib, kami tidak banyak mengerti tentang apa yang kamu katakan itu\" , { وَجَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَنْ يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا } \"padahal Kami telah meletakkan tutupan di atas hati mereka (sehingga mereka tidak) memahaminya dan (Kami letakkan) sumbatan di telinganya\" [ AL-An'Am : 25 ]. Perhatikan apa yang dikatakan Allah tentang musuh-musuh para Rasul mulai dari sikap mereka yang pura-pura tidak memahami ayat hingga pendustaan mereka terhadapnya, kamu juga akan menemukan orang-orang setelah mereka ada yang menhindar dari dzikir kepada Allah, dan dari tadabbur ayat-ayat Nya, bahkan mereka hanya ikut kepada apa yang dibacakan oleh syaithon. 2 ). { وَإِنَّا لَنَرَاكَ فِينَا ضَعِيفًا ۖ وَلَوْلَا رَهْطُكَ لَرَجَمْنَاكَ } \"kalau tidaklah karena keluargamu tentulah kami telah merajam kamu\" Syu'aib sama sekali tidak beralih kepada perangkap mereka tentang dirinya, dan tidak pula ia terkejut atas pengakuan mereka tentang keluarganya, melainkan Syu'aib merasa sedih dengan ketiadaan iman dalam diri mereka, sedang mereka tidak mengetahui bahwa sesungguhnya kekuatan dan wibawa syu'aib hanya bergantung kepada Allah semata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Kaum itu berkata: “Wahai Syuaib, Kami tidak banyak memahamai hal-hal ghaib yang kamu jelaskan kepada kami, layaknya memahami sesuatu yang bisa dilihat. Kami lihat bahwa kamu itu lemah dan tidak mampu menentang kami serta melindungi diri. Kalau bukan karena kerabatmu yang kuat, sungguh kami sudah merajammu atau membunuhmu menggunakan batu. Kamu itu tidak lebih mulia dari kami sehingga tidak dirajam”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Syuʻaib, Kami tidak banyak mengerti} tidak memahami {tentang apa yang kamu katakan itu, sesungguhnya kami memandangmu sebagai seorang yang lemah di antara kami. Kalau tidak karena keluargamu} keluargamu {tentu kami telah melemparimu} membunuhmu dengan melemparimu menggunakan batu {dan kamu atas kami bukan seorang yang berpengaruh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91 “mereka berkata ’hai syuaib, kami tidak banyak mengerti tentang apa yang kamu katakan itu” mereka gerah dengan nasihat nasihat dan wejangan wejangannya kepada mereka, merekapun berkata ”kami tidak banyak mengerti tentang apa yang kamu katakan”, itu karena kebencian mereka dan ketidak senangannya terhadap kata kata syuaib. ”dan sesungguhnya kami benar benar melihat kamu seorang yang lemah diantara kami” kamu bukan seorang pemimpin besar, kamu hanyalah orang rendahan. ”kalau tidaklah karena keluargamu” yakni kabilahmu dan orang orangmu “tentulah kami telah merajammu, sedang kamu pun bukanlah seorang yang berwibawa di sisi kami” kamu tidak memiliki harga dihati kami dan kehormatan pada diri kami, kami membiarkanmu karena kami memandang kabilahmu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَا نَفۡقَهُ) maa nafqahu : kami tidak memahami banyak dari perkataanmu. (وَلَوۡلَا رَهۡطُكَ) wa lau laa rahthuka : anggota keluargamu. (وَمَآ أَنتَ عَلَيۡنَا بِعَزِيزٖ) wa maa anta ‘alaina bi ‘aziz : engkau bukan orang kuat di mata kami. Makna ayat : Setelah perbincangan antara Syu’aib dan kaumnya, dan telah diucapkan apa yang mereka ucapkan. Nabi Syu’aib alahi salam adalah orang yang fasih, lagi mendapat pertolongan dari Allah. Setiap perkataannya membungkam mereka dan mematahkan argumentasi mereka, sehingga mereka tidak punya cara selain dengan kekerasan dan ancaman, bahkan mereka mencela dan menghinakan beliau. Ini adalah tanda dekatnya masa kebinasaan mereka. Mereka berkata, sebagaimana yang Allah firmankan pada ayat-ayat berikut, (قَالُواْ يَٰشُعَيۡبُ مَا نَفۡقَهُ كَثِيرٗا مِّمَّا تَقُولُ) \"Hai Syuaib, kami tidak banyak mengerti tentang apa yang kamu katakan itu” mereka memanggilnya untuk mendengar perkataan mereka, kemudian memaklumatkan bahwa mereka tidak paham banyak dari perkataannya, padahal Syu’aib berkomunikasi dengan bahasa mereka, mereka tidak paham karena kesombongan dan keangkuhan mereka, orang yang sombong lagi angkuh tidak akan mau memahami perkataan orang lemah. Mereka berkata, (وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفٗاۖ) “Kami tidak melihat mu kecuali engkau hanya orang lemah” sebuah ejekkan atasnya (وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَٰكَۖ) seandainya bukan karena adanya orang-orang kabilahmu yang kami hormati (لَرَجَمۡنَٰكَۖ) niscaya kami akan merajam mu. Terakhir (وَمَآ أَنتَ عَلَيۡنَا بِعَزِيزٖ) “sedang kamu pun bukanlah seorang yang berwibawa di sisi kami.” engaku tidak bisa membela diri jika kami menyerang mu. Pelajaran dari Ayat : • Karunia yang Allah berikan kepada Nabi Syu’aib berupa: kefasihan dan terampil dalam menyampaikan sesuatu, sampai beliau dijuluki: Khatibnya Para Nabi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 91: Memberitahukan tentang kurang pedulinya mereka terhadap seruan Nabi Syu’aib ‘alaihis salam dan menujukkan kebosanan mereka. Yang demikian adalah karena kebencian mereka terhadap nasehatnya dan sikap menjauh darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 91",
    "description": "Setelah diuraikan nasihat nabi syuaib kepada kaumnya supaya mengikuti jalan yang benar, kemudian dipaparkan tentang jawaban mereka setelah mendengar nasihat nabi syuaib, seraya berkata, wahai syuaib! kami tidak banyak mengerti tentang apa yang engkau katakan itu, sedang kenyataannya kami memandang atau menilai engkau sekarang ini sebagai seorang yang lemah di antara kami, karena tidak memiliki kekuatan, baik berupa harta kekayaan atau kekuasaan untuk melawan kami. Kalau tidak karena kami memandang keluargamu, tentu kami telah merajam engkau dengan melempari batu hingga mati, sedang engkau pun bukan seorang yang berpengaruh, memiliki kewibawaan atau kedudukan di lingkungan kami. 92. Mendengar hinamendengar hinaan mereka, dia'nabi syuaib'menjawab, wahai kaumku! apakah keluargaku lebih terhormat menurut pandanganmu daripada Allah, padahal dia lebih berhak untuk ditakuti dan diagungkan, bahkan dia kamu tempatkan di belakangmu, yakni perintah-perintah Allah kamu abaikan dengan sikap menghina dan sombong' ketahuilah sesungguhnya pengetahuan tuhanku meliputi apa yang kamu kerjakan, tidak ada satu pun perbuatan yang kamu lakukan, baik yang tersembunyi atau terang-terangan, melainkan semuanya diketahui oleh-Nya. Semua amal perbuatan yang kamu lakukan pasti akan dihisab."
  }
]