[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Syu’aib menjawab , ”wahai kaumku, apakah keluarga besarku lebih kuat lagi lebih mulia menurut kalian daripada Allah? dan kalian mengesampingkan perintah tuhan kalian, lalu menempatkannya berada di belakang punggung kalian, kalian tidak melaksanakan perintah yang kalian diperintah dan tidak berhenti dari larangan yang kalian dilarang, sesungguhnya tuhanku meliputi apa yang kalian perbuat, tidak ada sebesar biji sawi pun dari perbuatan-perbuatan kalian yang samar bagaiNya, dan dia akan memberikan balasan kepada kalian atas tindakan-tindakan itu, baik balasan di dunia maupun diakhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Syu'aib berkata, \"Wahai kaumku! Apakah keluargaku lebih mulia dan lebih terhormat bagi kalian dibanding Allah, Tuhan kalian? Dan kalian tinggalkan Allah begitu saja di belakang kalian ketika kalian tidak percaya kepada Nabi-Nya yang Dia utus kepada kalian?! Sesungguhnya Tuhanku Maha Mengetahui apa yang kalian perbuat. Tidak ada satupun amal perbuatan kalian yang luput dari pengetahuan-Nya. Dan Dia akan membalas perbuatan kalian itu dengan membinasakan kalian di dunia dan menimpakan azab yang berat kepada kalian di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Syuaib menjawab mereka: “Hai kaumku, apakah rasa hormat dan cinta kepaa keluargaku lebih berharga bagi kalian daripada menjaga kewajiban Allah dan menjauhi larangan-Nya serta menhormati nabi-Nya? Sungguh kalian telah berpaling dari Allah dan tidak mempedulikan perintah dan larangan-Nya. Sungguh Tuhanku yang telah menjagaku dengan karunia-Nya dan meliputiku dengan kenikmatan-Nya Maha Mengetahui kalian, tipu daya, dan amal perbuatan kalian, tidak ada sedikitpun yang tersumbunyi dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. قَالَ يٰقَوْمِ أَرَهْطِىٓ أَعَزُّ عَلَيْكُم مِّنَ اللهِ (Syu’aib menjawab: “Hai kaumku, apakah keluargaku lebih terhormat menurut pandanganmu daripada Allah) Karena menghina nabi Allah sama saja dengan menghina Allah dan kalian tidak menghormati nabi-Nya. Dan kalian lebih menghormati keluargaku daripada menghormati Allah. وَاتَّخَذْتُمُوهُ(sedang Allah kamu jadikan sesuatu) Yakni karena kalian tidak menganggap nabi yang telah Allah utus kepada kalian maka kalian telah menjadikan Allah sesuatu yang terbuang di belakangmu. وَرَآءَكُمْ ظِهْرِيًّا ۖ( yang terbuang di belakangmu?) Yakni tidak kalian pedulikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Syuaib berkata: “Apakah menurut kalian kerabatku itu lebih mulia daripada Allah? karena sesungguhnya meremehkan Nabi itu sama halnya dengan meremehkan Allah. Dan kalian jadikan perkara Allah dan nabinya terabaikan, yaitu terbuang di belakang kalian. Sesungguhnya Tuhanku Maha Mengetahui keadaan-keadaan dan amal-amal kalian lelu akan membalas kalian atas hal itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di sisi Kami sebagai seorang yang mulia {Dia menjawab,“Wahai kaumku, apakah keluargaku} apakah keluargaku {kalian pandang lebih terhormat daripada Allah} lebih agung di sisi kalian daripada Allah {lalu kalian menempatkanNya di belakang punggung kalian} Kalian menjadikan keputusan Allah itu terbuang di belakang punggung kalian {Sesungguhnya Tuhanku meliputi apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92 “syuaib menjawab” kepada mereka dengan lembut ”hai kaumku, apakah keluargaku lebih terhormat menurut pandanganmu daripada Allah” yakni bagaimana bisa kamu memperhatikanku karena kaumku dan tidak memperhatikanku demi Allah, sehingga kaumku lebih mulia daripada Allah dihadapanmu. ”sedang Allah kamu jadikan sesuatu yang terbuang dibelakangmu?” yakni kamu membuang perintah Allah dibelakang punggungmu, tak mempedulikannya dan kamu tidak takut kepadaNya “sesungguhnya (pengetahuan) Rabbku meliputi apa yang kamu kerjakan” tidak ada sekecil pun amalmu yang di langit dan di bumi yang samar dariNya sehingga Dia akan membalasmu sesuai dengan perbuatanmu dengan sempurna."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ظِهۡرِيًّاۖ) zhihriyya : tidak peduli dan acuh, bagaikan barang yang dibuang kebelakang punggung. Makna ayat : Lalu Syu’aib ‘alahi salam membalas mereka (قَالَ يَٰقَوۡمِ أَرَهۡطِيٓ أَعَزُّ عَلَيۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَآءَكُمۡ ظِهۡرِيًّاۖ) “Wahai kaumku, apakah keluarga ku lebih kalian takuti dari Allah, dan kalian menjadikan-Nya di belakang punggung kalian ?” yaitu tidak memperhatikan perintah tidak pula larangan-Nya, seperti mencampakkan-Nya ke belakang kalian, tidak menoleh tidak pula mendengarkan dan mentaati-Nya, sungguh celaka kalian, (إِنَّ رَبِّي بِمَا تَعۡمَلُونَ مُحِيطٞ) Sungguh Rabbku Maha Meliputi apa yang kalian lakukan.” Yaitu ilmu-Nya, amalan kalian terlah diketahui, tidak ada sedikitpun yang tersembunyi dari-Nya, dan Dia pasti akan membalas kalian cepat atau lambat. Pelajaran dari ayat : • Semakin besarnya cobaan tanda bahwa jalan keluar sudah dekat. • Rusaknya akal seseorang yang lebih mengedepankan perintah manusia, lantas mengabaikan perintah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 92: Sehingga kamu tidak merajamku karena keluargaku, bukan karena takut kepada Allah. Amalmu tidaklah tersembunyi bagi-Nya meskipun kecil sebesar semut, dan Dia akan membalas amalanmu dengan sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 92",
    "description": "Mendengar hinaan mereka, dia'nabi syuaib'menjawab, wahai kaumku! apakah keluargaku lebih terhormat menurut pandanganmu daripada Allah, padahal dia lebih berhak untuk ditakuti dan diagungkan, bahkan dia kamu tempatkan di belakangmu, yakni perintah-perintah Allah kamu abaikan dengan sikap menghina dan sombong' ketahuilah sesungguhnya pengetahuan tuhanku meliputi apa yang kamu kerjakan, tidak ada satu pun perbuatan yang kamu lakukan, baik yang tersembunyi atau terang-terangan, melainkan semuanya diketahui oleh-Nya. Semua amal perbuatan yang kamu lakukan pasti akan dihisab. Dan nabi syuaib pun melanjutkan pembicaraan, wahai kaumku! berbuatlah semau dan sesuka kamu menurut kemampuanmu, jika kamu mengancamku dan melanjutkan kedurhakaan sesungguhnya aku pun tetap berbuat pula sesuai dengan apa yang diperintahkan tuhanku yaitu berdakwah dan memperingatkan kamu menurut kemampuanku. Kelak kamu akan mengetahui siapa yang akan ditimpa azab yang menghinakan akibat menyekutukan Allah dan berbuat jahat kepada manusia, dan siapa yang berdusta. Dan tunggulah siksaan yang dijanjikan Allah kepada kamu! sesungguhnya aku bersamamu adalah orang yang menunggu apa yang dijanjikan tuhanku."
  }
]