[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, lakukanlah apa saja yang kalain dapat perbuat sesuai dengan budaya dan keadaan kalian, sesunggguhnya aku akan beramal lagi tekun di atas jalanku dan tugas yang Allah berikan kepadaku untuk mendakwahi kalian kepada tauhid. Kalian akan tahu siapakah dari kita yang akan tertimpa siksaan yang menghinakannya dan siapakah dari kita yang berdusta dalam ucapannya, aku atau kalian? dan tunggulah apa yang akan menimpa kalian, sesungguhnya aku bersama kalian akan ikut menunggu-nunggu.” ini adalah peringatan keras bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Wahai kaumku! Berbuatlah semampu kalian dengan cara yang kalian yakini kebenarannya. Dan akupun berbuat semampuku dengan cara yang kuyakini kebenarannya. Kelak kalian akan tahu siapa di antara kita yang akan menerima azab sebagai hukumannya, dan siapa di antara kita yang berdusta dalam pengakuannya. Maka tunggulah apa yang akan diputuskan oleh Allah. Sesungguhnya aku akan menunggu bersama kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Hai kaumku, teruslah melakukan perbuatan yang sesuai dengan hawa nafsu kalian dengan kekuatan dan kenikmatan yang kalian miliki di dunia; karena aku juga akan terus melakukan perbuatanku. Dan kelak kalian akan mengetahui kesudahannya, siapa yang akan ditimpa azab yang menghinakannya di dunia dan mengantarkannya menuju azab yang kekal di akhirat. Tunggu dan bersiaplah, karena aku juga menunggu dan bersiap untuk datangnya keputusan dan ketetapan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَيٰقَوْمِ اعْمَلُوا۟ عَلَىٰ مَكَانَتِكُمْ (Dan (dia berkata): “Hai kaumku, berbuatlah menurut kemampuanmu) Setelah nabi Luth melihat kebebalan mereka dalam kekafiran, dan keteguhan mereka diatas agama nenek moyang mereka, serta tidak bermanfaat bagi mereka nasehat, maka ia mengancam mereka dengan menyuruh mereka agar berbuat sebisa dan semampu mereka, dan ia memberitahu mereka bahwa ia telah berbuat semampunya. سَوْفَ تَعْلَمُونَ مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ (Kelak kamu akan mengetahui siapa yang akan ditimpa azab yang menghinakannya) Yakni azab yang menghinakan, dan penuh keburukan dan aib yang akan menimpa orang-orang yang menyombongkan diri di depan orang lain tanpa alasan yang benar. وَمَنْ هُوَ كٰذِبٌ ۖ( dan siapa yang berdusta) Kalian akan mengetahui siapa orang yang akan diazab dan siapa yang berdusta diantara kita. وَارْتَقِبُوٓا۟ إِنِّى مَعَكُمْ رَقِيبٌ(Dan tunggulah azab (Tuhan), sesungguhnya akupun menunggu bersama kamu) Yakni tunggulah bersamaku apa yang akan ditetapkan Allah diantara kita."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Wahai kaumku, ketahuilah tujuan dari posisi kalian dan usaha kalian berupa kekufuran dan kebohongan. Sesungguhnya aku mengerjakan apa yang diperintahkan Tuhan kepadaku sesuai posisiku. Kalian akan mengetahui akibat kesyirikan dan perbuatan melukai manusia. Barangsiapa ditimpa azab maka dia akan dihinakan dan direndahkan. Dan siapakah yang pendusta antara aku dan kalian. Tunggulah azab Tuhan kalian, sesungguhnya aku menungguh janji kasih sayang Tuhanku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai kaumku, berbuatlah sesuai dengan kemampuan kalian} dengan cara kalian {Sesungguhnya aku berbuat juga. Kalian akan mengetahui siapa yang akan ditimpa azab yang menghinakannya} menghinakannya {dan siapa yang berdusta. Tunggulah} tunggulah akibat dari perbuatan kalian {sesungguhnya aku bersama kalian adalah orang yang menunggu} orang yang menunggu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93 manakala mereka membuatnya lelah dan diapun berputus asa dari mereka, maka syuaib berkata kepada mereka, ”hai kaumku, berbuatlah menurut kemampuanmu” yakni sesuai dengan keadaan dan keyakinanmu. ”sesungguhnya akupun berbuat (pula). kelak kamu akan mengetahui siapa yang akan ditimpa azab yang menghinakannya” azab yang kekal menimpanya, apakah aku atau kamu. Mereka mengetahui itu ketika azab benar benar menimpa mereka “dan tunggulah azab (Rabb)” yang akan menimpaku “sesungguhnya akupun menunggu bersama kamu” apa yang akan menimpamu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (َلَىٰ مَكَانَتِكُمۡ) ‘alaa makaanatikum : sesuai dengan kekuasaan dan kekuatan kalian. Makna ayat : Lalu membalas ancaman mereka dengan yang semisal, (وَيَٰقَوۡمِ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ) “Wahai kaumku, berbuatlah menurut kemampuan kalian (إِنِّي عَٰمِلٞۖ) begitu pula aku, (سَوۡفَ تَعۡلَمُونَ) kalian akan mengetahui nanti (مَن يَأۡتِيهِ عَذَابٞ يُخۡزِيهِ) siapa yang akan terkena azab yang menghinakan (وَمَنۡ هُوَ كَٰذِبٞۖ) di antara kita yang berdusta, lalu disiksa dan dihinakan, maka baginya untuk menanti kedatangannya (وَٱرۡتَقِبُوٓاْ إِنِّي مَعَكُمۡ رَقِيبٞ) tunggulah, aku menunggunya bersama kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 93: Ketika kaumnya melemahkan Nabi Syu’aib, dan Beliau tidak sanggup berbuat apa-apa, maka Beliau berkata seperti yang tersebut pada ayat di atas. Aku atau kamu? Dan mereka mengetahui keadaan yang sesungguhnya ketika azab menimpa mereka. Apa yang akan menimpaku. Apa yang akan menimpamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 93",
    "description": "Dan nabi syuaib pun melanjutkan pembicaraan, wahai kaumku! berbuatlah semau dan sesuka kamu menurut kemampuanmu, jika kamu mengancamku dan melanjutkan kedurhakaan sesungguhnya aku pun tetap berbuat pula sesuai dengan apa yang diperintahkan tuhanku yaitu berdakwah dan memperingatkan kamu menurut kemampuanku. Kelak kamu akan mengetahui siapa yang akan ditimpa azab yang menghinakan akibat menyekutukan Allah dan berbuat jahat kepada manusia, dan siapa yang berdusta. Dan tunggulah siksaan yang dijanjikan Allah kepada kamu! sesungguhnya aku bersamamu adalah orang yang menunggu apa yang dijanjikan tuhanku. Maka ketika keputusan atau ketetapan kami untuk membinasakan mereka telah datang, maka terlebih dahulu kami selamatkan nabi syuaib dan orang-orang yang beriman bersamanya dari azab itu. Orang-orang yang beriman kepada Allah diselamatkan dengan rahmat yang besar dari kami, sedang orang yang zalim terhadap dirinya dengan perbuatan syirik, dibinasakan oleh suara yang mengguntur yang dapat membinasakan orang dalam sekejap, sehingga mereka mati bergelimpangan di rumahnya atau di negerinya karena dahsyatnya azab itu."
  }
]