[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika telah datang ketetapan kami untuk membinasakan kaum syua’ib, kami selamatkan rasul kami syuaib dan orang-orang mukminin yang bersamanya dengan rahmat dari kami. Dan suara menggelegar dari langit menerpa orang-orang dzolim, dan membinasakan mereka, sehingga mereka terpaku di atas lutut-lutut mereka di kampung-kampung mereka dalam keadaan tak bernyawa lagi, tidak ada gerakan sama sekali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Dan tatkala perintah Kami untuk membinasakan kaum Syu'aib telah datang, Kami selamatkan Syu'aib dan orang-orang yang beriman bersamanya dengan rahmat Kami. Sementara orang-orang yang zalim di antara kaumnya dihantam suara yang sangat keras menggelegar, hingga tewas dan jatuh tertelungkup dengan wajah melekat ke tanah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Ketika ketetapan Kami telah datang, Kami selamatkan Syuaib dan orang-orang beriman yang bersamanya dengan kekuatan dan rahmat Kami; dan Kami binasakan orang-orang yang menzalimi diri mereka sendiri dengan suara yang sangat keras, sehingga ketika mereka di rumah, mereka dikagetkan oleh azab saat mereka dalam kelalaian. Mereka semua binasa dengan suara keras itu, sehingga mereka menjadi mayat-mayat yang bergelempangan akibat kengerian yang menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. بِرَحْمَةٍ مِّنَّا (dengan rahmat dari Kami) Yakni rahmat Kami bagi mereka, Kami telah menyelamatkan mereka karena rahmat Kami yang berupa petunjuk menuju keimanan. وَأَخَذَتِ الَّذِينَ ظَلَمُوا۟ (dan orang-orang yang zalim dibinasakan) Zalim terhadap orang lain dengan mengambil harta mereka dengan jalan yang salah dan zalim terhadap diri mereka sendiri dengan terus menerus dalam kekafiran. الصَّيْحَةُ (oleh satu suara yang mengguntur) Suara yang dikeluarkan oleh malaikat Jibril kepada mereka sehingga nyawa mereka keluar dari jasad mereka. فَأَصْبَحُوا۟ فِى دِيٰرِهِمْ جٰثِمِينَ (lalu jadilah mereka mati bergelimpangan di rumahnya) Tafsir dari kalimat ini telah disebutkan pada ayat 67."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Ketika perintah Kami untuk membinasakan mereka telah tiba, niscaya Kami akan menyelamatkan Syuaib dan orang-orang mukmin yang bersamanya dari azab karena kasih sayang Kami kepada mereka. Dan orang-orang yang menzalimi diri sendiri dengan kesyirikan akan ditimpa suara teriakan atau guncangan yang mematikan, sehingga mereka menjadi mayat di rumah-rumah mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika telah datang keputusan Kami. Kami menyelamatkan Syuʻaib dan orang-orang yang beriman bersamanya dengan rahmat dari Kami. Dan orang-orang yang zalim, mereka dibinasakan oleh suara menggelegar sehingga mereka mati bergelimpangan di rumah-rumah mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94 “dan tatkala datang azab kami” yang membinasakan kaum syuaib ”kami selamatkan kaum syuaib dan orang orang yang beriman bersama sama dengannya dengan rahmat dari kami, dan orang orang yang zhalim dibinasakan oleh satu suara yang mengguntur, lalu jadilah mereka mati bergelimpangan dirumahnya” (sehingga) kamu tidak lagi mendengar suara mereka, dan tidak melihat gerakan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (ٱلصَّيۡحَةُ) ash-shaihatu : suara yang mengguntur yang menimpa mereka. (جَٰثِمِينَ) Jaatsimiin : berlutut. Makna ayat : Firman-Nya : (وَلَمَّا جَآءَ أَمۡرُنَا) ketika telah datang ketentuan Kami berupa azab (نَجَّيۡنَا شُعَيۡبٗا وَٱلَّذِينَ ءَامَنُواْ مَعَهُۥ بِرَحۡمَةٖ مِّنَّا) Kami selamatkan Syu’aib dan orang-orang beriman dengan karunia dan nikmat dari Kami, (وَأَخَذَتِ ٱلَّذِينَ ظَلَمُواْ) dan orang-orang zalim, pelaku syirik dan maksiat (ٱلصَّيۡحَةُ) mereka tertimpa suara yang menggetarkan jantung mereka sampai terlepas, lalu mati bergelimpangan tidak bergerak. Pelajaran dari ayat : • Keutamaan sabar menanti datangnya kemudahan dari Allah, ini adalah berharap yang diperintahkan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 94: Untuk membinasakan kaum Syu’aib. Ada yang mengatakan, bahwa Malaikat Jibril yang berteriak dengan suara keras itu. Ada pula yang mengatakan, bahwa ada suara keras yang datang dari langit kepada mereka, lalu membinasakannya, wallahu a’lam. Dalam keadaan berlutut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 94",
    "description": "Maka ketika keputusan atau ketetapan kami untuk membinasakan mereka telah datang, maka terlebih dahulu kami selamatkan nabi syuaib dan orang-orang yang beriman bersamanya dari azab itu. Orang-orang yang beriman kepada Allah diselamatkan dengan rahmat yang besar dari kami, sedang orang yang zalim terhadap dirinya dengan perbuatan syirik, dibinasakan oleh suara yang mengguntur yang dapat membinasakan orang dalam sekejap, sehingga mereka mati bergelimpangan di rumahnya atau di negerinya karena dahsyatnya azab itu. Keberadaan kaum nabi syuaib yang dibinasakan Allah seolah-olah mereka belum pernah tinggal di tempat itu, karena semua makhluk hidup telah binasa dan bangunan tempat tinggal mereka pun telah hancur. Ingatlah, binasalah penduduk madyan sebagaimana kaum samud juga telah binasa dengan suara yang mengguntur; kaum samud dibinasakan oleh suara yang mengguntur dari bawah, sedang penduduk madyan dibinasakan oleh suara yang mengguntur dari atas akibat kedurhakaan dan kesombongan mereka."
  }
]