[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Seakan-akan mereka tidak pernah mendiami kampung-kampung mereka sejenakpun.Maka ingatlah kutukan bagi bangsa madyan, takala Allah membinasakan mereka dan menghinakan mereka, sebagaimana kaum tsamud telah hancur. Sesungguhnnya dua bangsa ini sama-sama mengalami kutukan dan kebinasaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Seolah-olah mereka tidak pernah tinggal di sana. Ingatlah! Penduduk kota Madyan itu telah jauh dari rahmat Allah dengan datangnya hukuman Allah kepada mereka. Sebagaimana kaum Ṡamūd yang terusir dari rahmat Allah dengan turunnya murka Allah kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95. Seakan-akan kemarin mereka belum pernah tinggal dan terdengar di sana. Sungguh laknat dan kebinasaan bagi mereka, sebagaimana laknat dan kebinasaan bagi kaum Tsamud; keadaan mereka sama dan kesudahan mereka juga sama; mereka sama-sama dalam jurang dosa dan kesesatan, dan sama-sama terjerumus ke dalam keburukan dan azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. أَلَا بُعْدًا(Ingatlah, kebinasaanlah) Yakni kehancuran. كَمَا بَعِدَتْ (sebagaimana telah binasa) Sebagaimana telah hancur kaum Tsamud."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Seakan-akan tidak ada yang tinggal di dalamnya. Ingatlah kehancuran kaum Madyan, seperti halnya Kami membinasakan kaum Tsamud sebelumnya. Kehancuran dua kaum itu akibat shaihah (sara teriakan), dimana suara bagi kaum Tsamud itu berasal dari bawah mereka sedangkan suara bagi kaum Madyan itu dari atas mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seakan-akan mereka tidak pernah tinggal} mereka tidak tinggal {di sana. Ingatlah, kebinasaan} kehancuran {bagi penduduk Madyan sebagaimana kaum Tsamud telah binasa} hancur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95 “seolah olah mereka belum pernah berdiam di tempat itu” maksudnya seakan akan mereka tidak pernah tinggal dikampung mereka itu dan tidak merasakan kemakmuran didalamnya ketika azab datang kepada mereka. ”sebagaimana kaum tsamud telah binasa” kedua kabilah ini sama sama berserikat dalam kemurkaan, laknat dan kebinasaan. Syuaib terkenal dengan julukan, khatibul anbiya karena dialognya yang bagus kepada kaumnya. pada kisahnya terdapat banyak faidah dan pelajaran. diantaranya; kaum kafir diazab dan diberi khitab tentang akidah islam, demikian pula syariat dan cabang cabang islam, karena syuaib menyeru kaumnya kepada tauhid dan kepada pemenuhan timbangan dan takaran, dan syuaib menyatakan bahwa ancaman Allah berkaitan dengan kedua hal tersebut. Diantaranya; mengurangi takaran dan timbangan termasuk dosa besar. Barangsiapa yang melaukan itu, maka dikhawatirkan ditimpa azab dunia, hal itu termasuk mencuri harta orang orang jika mencuri lewat takaran dan timbangan mengundang azab, maka mengambil dengan paksa dan terang terngan adalah lebih mengundang dan lebih layak mendapat azab. Diantaranya; balasan itu berasal dari jenis perbuatan, barangsiapa yang mengurangi harta manusia untuk menambah hartanya maka dia akan dibalas dengan sebaliknya. itu menjadi penyebab lenyapnya kebaikan dari rizki yang ada pada dirinya. hal ini sesuai dengan ucapan syuaib. “sesungguhnya aku melihatmu dalam kebaikan”, maksudnya maka kamu jangan menjadi penyebab hilangnya kebaikan itu karena perbuatanmu. Diantaranya; hendaknya seorang hamba merasa cukup dengan rizki Allah merasa cukup dengan halal tanpa haram. cukup dengan usha usaha yang halal tanpa usaha usaha yang haram. hal itu adalah lebih baik baginya berdasarkan ucapan syuaib ”sisa (keuntungan) dari Allah adalah lebih baik bagimu”. hal itu mengandung keberkahan dan tambahan rizki yang tidak terkandung pada sikap rakus atau usaha usaha yang haram yang mencabut keberkahan rizki Diantaranya; bahwa hal itu termasuk tuntutan dan buah iman Karena dia mengkaitkan hal itu dengan keberadaan iman, ini menunjukan bahwa apabila amal perbuatan tidak ada, maka iman itu berkurang atau tidak ada. Diantaranya; shalat senantiasa disyariatkan kepada para nabi terdahulu, ia termasuk amal perbuatan yang paling utama, sampai sampai orang orang kafir pun mengakui keutamaannya dan keunggulannya diatas amal amal yang lain. shalat mencegah dari perbuatan keji dan mungkar. ia adalah timbangan bagi iman dan syariat syariatnya. dengan menegakkannya, keadaan seorang hamba menjadi sempurna dan dengan meninggalkannya, keadaan agamanya menjadi berantakan. Diantaranya; harta yang Allah rizkikan kepada manusia, meskipun Allah telah memberikannya kepadanya, dia tetap tidak boleh berbuat pada harta itu sesukanya karena ia adalah amanat di tangannya. Dia harus menunaikan hak Allah pada harta itu dengan menunaikan kewajiban kewajiban yang terkait dengannya, menjauhi usaha usaha yang dilarang oleh Allah dan rasulNya, tidak sebagaimana yang diklaim oleh orang orang kafir dan yang seperti mereka sukai pada harta mereka, menyelarasi hukum Allah atau menyelisihinya. Diantaranya; termasuk kelengkapan dan kesempurnaan dakwah seorang dai adalah hendaknya dia mejadi orang pertama yang melakukan perintahnya sendiri ketika dia memerintahkannya kepada orang lain, dan orang pertama yang meninggalkan larangannya sendiri yang mana dia larangkan untuk orang lain sebagaimana syuaib berkata, ”dan aku tidak berkehendak menyalahimu dengan melakukan apa yang aku larang” dan karena firma Allah ta'ala : \"Wahai orang-orang yang beriman, kenapakah kamu mengatakan sesuatu yang tidak kamu kerjakan? Amat besar kebencian di sisi Allah bahwa kamu mengatakan apa-apa yang tidak kamu kerjakan.\" Diantaranya; tugas rosul, agama dan sunnah mereka adalah berkehendak untuk memperbaiki menurut kemampuan dan kemungkinan, mereka berusaha mewujudkan kebaikan dan menyempurnakannya atau mewujudkan sesuatu yang mereka mampu untuk mewujudkannya, menolak dan meminimalkan kerusakan serta menjaga kepentingan umum di atas kepentingan khusus. Hakikat kemaslahatan itu adalah sesuatu yang dengannya kemaslahatan manusia bisa diwujudkan, urusan agama dan dunia mereka menjadi lurus. Diantaranya; barangsiapa melakukan perbaikan sebatas kemampuannya, maka dia tidak dicela dan disalahkan pada bagian yang dia tidak lakukan karena dia tidak mampu. seorang hamba harus melakukan perbaikan pada diri dan orang lain semampunya. Diantaranya; hendaknya seorang hamba tidak bergantung kepada dirinya sekejap pun, tetapi hendaklah ia senantiasa meminta tolong kepada Rabbnya, bertawakal kepadaNya dan meminta taufik, jika dia mendapatkan taufik, maka hendaknya dia menisbatkannya kepada pemberinya, dan jangan ujub terhadap dirinya sendiri sebagaimana syuaib berkata ”dan tidak ada taufik bagiku melainkan dengan (pertolongan) Allah. hanya kepada Allah aku bertawakal, dan hanya kepadaNyalah aku kembali” Diantaranya; mewaspadai azab-azab yang menimpa umat umat terdahulu dan apa yang terjadi pada mereka, hendaknya kisah-kisah tentang azab para pelaku dosa disampaikan untuk memberi nasihat dan peringatan, sebagaimana kisah-kisah tentang balasan Allah kepada orang orang yang bertakwa disampaikan untuk memacu dan mendorong kepada ketakwaan. Diantaranya; orang yang bertaubat dari dosa sebagaimana dosanya dimaafkan dan diampuni, maka dia juga dicintai dan disukai oleh Allah, tidak perlu memandang ucapan orang yang berkata, ”bahwa orang yang bertaubat sudah cukup baginya kalau diampuni dan dimaafkan” masalah dicintai dan disukai oleh Allah, maka itu tidak terjadi, (yang benar adalah yang pertama) karena Allah berfirman ”dan mohonlah ampun kepada Rabbmu, kemudian bertaubatah kepadaNya. Sesungguhnya Rabbku Maha penyayang lagi maha pengasih” Diantaranya; Allah membela orang orang mukmin dengan banyak sebab, mereka mungkin mengetahui sebagian sebab darinya, dan mungkin pula tidak mengetahui sedikitpun darinya, dan mungkin saja Allah membelanya melalui kabilahnya dan penduduk negerinya kafir, sebagimana Allah menjaga syuaib dari rajam kaumnya dengan sebab kabilahya. Sesungguhnya hubungan seperti ini yang dengannya pembelaan kepada islam bisa diwujudkan boleh boleh saja dilakukan, bahkan bisa jadi harus dilakukan, karena usaha perbaikan selalu dituntut berdasarkan kemungkinan dan kemampuan. Berdasarkan hal ini, seandainya kaum muslimin yang berada dibawah kepemimpinan orang orang kafir berpartisipasi dan berusaha menjadikan pemerintahan dalam bentuk republic yang dengannya pribadi dan masyarakat muslimin bisa mendapatkan hak hak agama dan dunia, niscaya itu lebih baik daripada tunduk kepada Negara yang membunuh hak hak agama dan dunia mereka, dan berusaha memberangus mereka, menjadikan mereka hanya sebagai kuli dan pembantu untuk mereka. Benar, jika memungkinkan Negara itu dipegang oleh kaum muslimin dan kaum musliminlah yang menjadi pemimpinya, maka itu harus dipilih, akan tetapi jika ini tidak mungkin, maka tingkatan dibawahnya yang memberi perlindungan bagi agama dan dunia harus didahulukan. wallahua’lam."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ) ka’allam yaghnau fiihaa : seakan mereka tidak pernah tinggal disini seharipun. (أَلَا بُعۡدٗا لِّمَدۡيَنَ) alaa bu’dal limadyan : celakalah Madyan, kaum Syu’aib. Makna ayat : Allah berfirman (كَأَن لَّمۡ يَغۡنَوۡاْ فِيهَآۗ) “Seakan-akan mereka belum pernah tinggal dan menempati lokasi tersebut dalam waktu yang lama. Lalu melaknat mereka, firman-Nya (أَلَا بُعۡدٗا لِّمَدۡيَنَ) mereka jauh dari rahmat serta celaka, sebagaimana kaum sebelum mereka, Tsamud. Pelajaran dari ayat : • Benarnya janji Allah dan Rasul-Nya, serta tidak mungkinnya janji itu diingkari."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 95: Nabi Syu'aib terkenal dengan ahli khutbah (pidato) dari kalangan para nabi karena bagusnya penyampaian Beliau kepada kaumnya. Dalam kisah Beliau dapat diambil banyak pelajaran, di antaranya: - Kaum kafir, sebagaimana mereka ditujukan pokok ajaran Islam (Tauhid), mereka pun ditujukan syari’at Islam dan cabangnya. Hal itu, karena Nabi Syu’aib ‘alaihis salam mengajak kaumnya kepada tauhid dan mengajak pula memenuhi takaran dan timbangan yang termasuk syari’at Islam. - Mengurangi takaran dan timbangan adalah dosa yang besar, dan dikhawatirkan akan ditimpa azab secara segera bagi yang melakukannya. Rasulullah shallallahu 'alaihi wa sallam bersabda: وَلَمْ يَنْقَصُوا الْمِكْيَالَ وَالْمِيزَانَ، إِلاَّ أثخِذَوا بِالسِّنِينَ وَشِدَّة الْمَئُونَةِ وَجَوْرِ السُّلْطَانِ عَلَيْهِمْ “Tidaklah mereka mengurangi takaran dan timbangan kecuali mereka akan ditimpa kemarau panjang, kesulitan pangan dan kezaliman penguasa.” (HR. Ibnu Majah, dishahihkan oleh Syaikh Al Albani dalam Shahih At Targhib wat Tarhib) - Balasan disesuaikan dengan jenis amalan. Oleh karena itu, barang siapa yang mengurangi harta manusia, dengan maksud agar hartanya bertambah, maka ia akan dibalas dengan yang serupa dengan dicabutnya kebaikan atau keberkahan pada rezeki tersebut. - Termasuk sikap yang mirip dengan perbuatan mereka adalah sikap sebagian orang yang ingin dipenuhi haknya, namun kewajibannya tidak dilakukan, padahal antara hak dan kewajiban haruslah seimbang. - Seorang hamba seharusnya qana’ah (menerima apa adanya) pemberian Allah, mencukupkan diri dengan yang halal dan melakukan usaha yang halal, dan bahwa hal tersebut lebih baik baginya, karena yang demikian akan diberikan berkah dan tambahan rezeki. Demikian juga bahwa mencukupkan diri dengan yang halal termasuk lawazim (hal yang menyatu) dengan iman dan atsar(pengaruh)nya (lihat ayat 86), sehingga menunjukkan bahwa jika tidak demikian, maka menunjukkan imannya kurang atau tidak ada. - Shalat senantiasa disyari’atkan kepada para nabi sejak dahulu (lihat ayat 87), dan bahwa ia merupakan amalan yang paling utama sampai diakui oleh orang-orang kafir, dan bahwa shalat dapat mencegah dari perbuatan keji dan munkar, dan ia merupakan timbangan keimanan, di mana jika seseorang mendirikannya, maka akan sempurna keadaan agama seorang hamba, dan jika tidak didirikannya, maka akan rusak keadaan agama seorang hamba. - Harta yang diberikan Allah –meskipun sudah diberikan kepadanya- namun demikian pemiliknya tidak berhak bertindak semaunya, karena harta itu adalah amanah di sisinya. Ia harus memenuhi hak Allah padanya dengan menunaikan hak-hakny dan tidak melakukan usaha yang haram.. - Seorang da’i harus menjadi orang pertama yang menjauhi apa yang dilarangnya. - Tugas para rasul, sunnah dan ajaran mereka adalah mengadakan perbaikan sesuai kemampuan dan memperhatikan maslahat umum daripada maslahat pribadi. Arti maslahat adalah sesuatu yang dengannya keadaan hamba menjadi baik, dan urusan agama serta dunia mereka menjadi lurus. - Sepatutnya seorang hamba tidak bersandar kepada dirinya, bahkan senantiasa meminta pertolongan kepada Tuhannya, bertawakkal kepada-Nya sambil meminta taufiq-Nya serta tidak ujub (bangga) terhadap dirinya. - Dalam memberi nasehat sepatutnya mengisahkan pula umat-umat terdahulu yang binasa agar lebih masuk ke dalam hati orang yang mendengarnya. Demikian pula mengisahkan pula orang-orang yang dimuliakan Allah agar orang itu mengikutinya dan menjadi jelas jalan yang harus dilaluinya. - Orang yang bertobat dari dosa sebagaimana dosanya akan diampuni, Allah Subhaanahu wa Ta'aala juga akan mencintainya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 95",
    "description": "Keberadaan kaum nabi syuaib yang dibinasakan Allah seolah-olah mereka belum pernah tinggal di tempat itu, karena semua makhluk hidup telah binasa dan bangunan tempat tinggal mereka pun telah hancur. Ingatlah, binasalah penduduk madyan sebagaimana kaum samud juga telah binasa dengan suara yang mengguntur; kaum samud dibinasakan oleh suara yang mengguntur dari bawah, sedang penduduk madyan dibinasakan oleh suara yang mengguntur dari atas akibat kedurhakaan dan kesombongan mereka. Pada ayat berikut Allah menjelaskan kisah nabi musa ketika menghadapi fir'aun. Dan sungguh, kami telah mengutus nabi musa untuk menyampaikan risalah Allah disertai dengan tanda-tanda yang membuktikan kekuasaan dan keesaan kami berupa kitab taurat atau sembilan tanda-tanda kekuasaan Allah (lihat: surah al-a'ra'f/7: 133 dan al-isra'/17: 101). Dan kami anugerahkan kepadanya bukti yang nyata berupa mukjizat yang membuktikan tentang kerasulannya."
  }
]