[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengutus Musa dengan membawa bukti-bukti petunjuk tentang keesan kami dan hujjah yang menerangkan bagi orang yang menyaksikannya langsung dan mau merenunginya dengan hati yang lurus, bahwa sesunggguhnya hujah itu menunjukan keeasan Allah dan kedustaan orang yang mengaku-ngaku memiliki kekuasaan rububiyah selain Allah ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Dan sungguh Kami telah mengutus Musa dengan membawa ayat-ayat Kami yang menunjukkan keesaan Allah dan membawa bukti-bukti nyata yang menunjukkan kebenaran ajaran yang dibawanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "96. Sungguh Kami telah mengutus Musa dengan membawa ayat-ayat Kami yang menunjukkan kebenaran risalahnya, dan dia juga memiliki mukjizat yang jelas dan kewibawaan sehingga tidak ada seorangpun yang dapat mengganggunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. بِـَٔايٰتِنَا وَسُلْطٰنٍ مُّبِينٍ (dengan tanda-tanda (kekuasaan) Kami dan mukjizat yang nyata) Bukti dan mukjizat. Pendapat lain mengatakan makna ayat-ayat yakni Sembilan mukjizat yang disebutkan dalam surat al-Isra’. Maksud dari (السلطان) yakni mukjizat tongkat yang berubah menjadi ular."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Dan sungguh Kami telah mengutus Musa dengan ayat-ayat Kami yaitu Taurat dan 9 ayat sebagaimana yang dijelaskan dalam surah Al-Isra’ (17/101) yang kemudian dijelaskan di surah Al-A’rah (7/133) serta dengan mukjizat nyata atau bukti-bukti yang kuat dan jelas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar mengutus Musa dengan ayat-ayat Kami dan keterangan yang nyata} dalil-dalil nyata atas kebenaran kenabiannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96 “dan sesungguhnya kami telah mengutus Musa” bin Imran ”dengan tanda tanda (kekuasaan) kami” yang menunjukan kebenaran agama yang dibawanya seperti tongkat, tangan dan tanda tanda yang lain yang Allah berlakukan melalui tangan Musa “dan mukjizat yang nyata” yakni hujjah yang jelas dan gamblang yang muncul seperti matahari."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مُوسَىٰ) muusaa : Musa bin Imran, Kaliimullah (orang yang Allah ajak bicara secara langsung) dan rasul-Nya kepada Bani Israil. (بِ‍َٔايَٰتِنَا) bi aayaatinaa : 9 ayat yang sebagian besarnya disebutkan dalam surat Al-A’raaf (وَسُلۡطَٰنٖ مُّبِينٍ) wa sulthaanim mubiin : argumen yang kuat untuk mengalahkan Firaun, musuh Allah. Makna ayat : Inilah sebuah potongan kisah Musa ‘alaihi salam dan Firaun yang tercantum pada 4 ayat pendek, Allah ta’alaa berfirman-Nya (وَلَقَدۡ أَرۡسَلۡنَا مُوسَىٰ) setelah Kami utus Syu’aib kepada penduduk Madyan, Kami mengutus Musa bin Imran bersama (بِ‍َٔايَٰتِنَا) ayat-ayat Kami sebagai tanda (dia adalah utusan Allah) dan benarnya dakwah dan ajakannya. (وَسُلۡطَٰنٖ مُّبِينٍ) argumentasi yang kuat lagi jelas atas diharuskannya mentauhidkan Allah dan batilnya sesembahan selain-Nya, seperti Firaun—laknat Allah atasnya—ketika ia berkata: (وَقَالَ فِرۡعَوۡنُ يَٰٓأَيُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَٰهٍ غَيۡرِي) “Aku tidak tahu bahwa ada tuhan selain aku.” Pelajaran dari ayat : • Orang yang ditetapkan celaka tidak akan beriman dengan ayat-ayat-Nya, bahkan membantah dan mendustakanya, sehingga ia binasa. • Kuatnya argumentasi dan bukti tidak memastikan ketaatan dan keimanan seseorang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 96: Yang menunjukkan benarnya apa yang Beliau bawa, seperti tongkatnya yang berubah menjadi ular, tangannya bercahaya, dsb. Yakni hujjah yang jelas dan nyata sebagaimana terangnya matahari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 96",
    "description": "Pada ayat berikut Allah menjelaskan kisah nabi musa ketika menghadapi fir'aun. Dan sungguh, kami telah mengutus nabi musa untuk menyampaikan risalah Allah disertai dengan tanda-tanda yang membuktikan kekuasaan dan keesaan kami berupa kitab taurat atau sembilan tanda-tanda kekuasaan Allah (lihat: surah al-a'ra'f/7: 133 dan al-isra'/17: 101). Dan kami anugerahkan kepadanya bukti yang nyata berupa mukjizat yang membuktikan tentang kerasulannya. Kami utus nabi musa kepada fir'aun penguasa mesir dan para pemuka kaumnya, tetapi mereka tidak mengindahkan ajakan rasul-Nya untuk menyembah Allah, bahkan tetap mengikuti perintah fir'aun dalam kekufuran dan kedurhakaan, padahal perintah fir'aun bukanlah petunjuk yang benar, melainkan kesesatan, karena fir'aun memimpin kerusakan dan kedurhakaan."
  }
]