[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami mengutus musa kepada fir’aun dan para pembesar kaumnya serta kaum bangsawan dari kaumnya, tetapi firaun kafir, dan memerintahkan kaumnya untuk mengikuti dirinya, lalu merekapun mengikuti fir’aun dan menyelisihi perintah Musa, padahal tidak ada kelurusan petunjuk dalam perintah firaun, ia hanyalah murni kebodohan, kesesatan, kekafiran dan penentangan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Kami mengutus Musa kepada Fir'aun dan para pemuka kaumnya. Kemudian para pemuka kaumnya itu mengikuti perintah Fir'aun kepada mereka agar ingkar kepada Allah. Padahal perintah Fir'aun itu bukanlah perintah yang benar sehingga patut diikuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97. Dan Kami mengutusnya kepada Fir’aun dan para pengikutnya, akan tetapi mereka mengikuti jejak Fir’aun dan berpaling dari risalah Musa, meski jejak Fir’aun tidak benar dan tidak menjamin keselamatan mereka, sebab dia adalah orang yang sesat yang tidak memerintahkan kepada kebaikan dan menyeru kepada petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. وَمَلَإِي۟هِۦ(dan pemimpin-pemimpin kaumnya) Yakni pemuka-pemuka kaum. Adapun selainnya adalah para pengikut mereka. فَاتَّبَعُوٓا۟ أَمْرَ فِرْعَوْنَ ۖ( tetapi mereka mengikut perintah Fir’aun) Yakni perintah Fir’aun kepada mereka agar menjadi orang-orang kafir. Dan bisa juga makna dari (أمر فرعون) yakni urusan dan jalan hidup Fir’aun. وَمَآ أَمْرُ فِرْعَوْنَ بِرَشِيدٍ (padahal perintah Fir’aun sekali-kali bukanlah (perintah) yang benar) Yakni tidak terdapat kebenaran sama sekali, namun berupa kemaksiatan dan kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Kami mengutusnya kepada Fir’aun dan pemimpin-pemimpin kaumnya yang mengikuti perintah Fir’aun untuk kufur dan menentang Musa. Dan Fir’aun itu tidak memiliki petunjuk sama sekali, melainkan dia itu dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kepada Fir‘aun dan para pemuka kaumnya} para pemuka kaumnya {lalu mereka mengikuti perintah Fir‘aun} jalan dan cara Fir’aun dalam kesesatan {dan tidaklah perintah Fir‘aun itu benar} kebenaran yang menuju kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97 “kepada firaun dan pemimpin pemimpin kaumnya” maksudnya tokoh kaumnya, karena mereka diikuti sedangkan selain mereka adalah pengikut bagi mereka. mereka tidak tunduk pada mukjizat yang dibawa oleh Musa dan ditunjukannya kepada mereka seperti yang telah dirinci di surat al araf, mereka justru “mengikuti perintah firaun padahal perintah firaun sekali kali bukanlah (perintah) yang benar” firaun adalah sesat dan menyimpang, dia tidak memerintahkan kecuali kepada kemudaratan murni."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَمَلَإِيْهِۦ) wa malaihi : orang-orang berpangkat pada kerajaan Firaun. (وَمَآ أَمۡرُ فِرۡعَوۡنَ بِرَشِيدٖ) wa maa amru fir’auna bi rasyiid : bukanlah perintah yang benar, bahkan bodoh. Makna ayat : Firman-Nya (إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ) Kami mengutusnya kepada Firaun dan para pembesar kaumnya dengan ayat-ayat Kami serta bukti yang nyata. Musa memerintahkan mereka untuk mengikuti kebenaran dan meninggalkan kebatilan, namun mereka enggan dan mengikuti perintah Firaun, lalu ia menyesatkan mereka. (وَمَآ أَمۡرُ فِرۡعَوۡنَ بِرَشِيدٖ) padahal perintah Firaun bukanlah perintah yang benar, yang dapat membawa pengikutnya menuju kebahagiaan dan kemenangan. Pelajaran dari ayat : • Peringatan agar tidak mengikuti pemimpin-pemimpin yang buruk, pembuat kerusakan dan sesat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 97: Karena mereka adalah orang-orang yang diikuti. Perintahnya salah dan isinya merugikan semata, oleh karena itu mengikuti perintahnya akan membinasakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 97",
    "description": "Kami utus nabi musa kepada fir'aun penguasa mesir dan para pemuka kaumnya, tetapi mereka tidak mengindahkan ajakan rasul-Nya untuk menyembah Allah, bahkan tetap mengikuti perintah fir'aun dalam kekufuran dan kedurhakaan, padahal perintah fir'aun bukanlah petunjuk yang benar, melainkan kesesatan, karena fir'aun memimpin kerusakan dan kedurhakaan. Dia'fir'aun'kelak berjalan di depan kaumnya di hari kiamat, sebagaimana yang ia lakukan ketika di dunia, memimpin mereka dalam kekufuran dan kedurhakaan, lalu ia pun membawa mereka masuk ke dalam neraka untuk merasakan pedihnya siksaan itu. Neraka yang penuh siksaan dan penderitaan itu adalah seburuk-buruk tempat yang dimasuki fir'aun beserta para pengikutnya."
  }
]