[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun akan berjalan di depan kaumnya pada hari kiamat lalu memasukan mereka ke dalam neraka. Amat buruk tempat tinggal yang mereka masuki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Kelak di hari Kiamat Fir'aun akan memimpin kaumnya hingga membawa mereka masuk ke dalam Neraka bersama dirinya. Dan seburuk-buruk tempat ialah tempat yang mereka datangi itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Pada hari kiamat Fir’aun berjalan di depan para pengikutnya dan menggiring mereka ke neraka, sebagaimana di dunia dia menggiring mereka kepada kesesatan; dan mereka mentaatinya seperti segerombol domba yang mentaati penggembalanya. Sungguh tempat yang mereka tuju itu adalah seburuk-buruk tempat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. يَقْدُمُ قَوْمَهُۥ يَوْمَ الْقِيٰمَةِ (Ia berjalan di muka kaumnya di hari kiamat) Ia berada didepan mereka untuk menggiring mereka kedalam azab neraka sebagaimana ia telah memerintahkan mereka di dunia agar menjadi kafir dan mereka mentaatinya. فَأَوْرَدَهُمُ النَّارَ ۖ (lalu memasukkan mereka ke dalam neraka) Mereka mengikutinya sampai masuk ke dalam neraka. وَبِئْسَ الْوِرْدُ الْمَوْرُودُ(Neraka itu seburuk-buruk tempat yang didatangi) Karena orang yang mendatangi sumber air sesungguhnya bertujuan untuk menghilangkan dahaga, namun neraka adalah kebalikan dari semua itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Qotadaha berkata : Fir'aun akan berjalan di depan kaumnya, sampai akhirnya ia menjerumuskan mereka ke dalam neraka! Seperti itulah pemimpin dalam kesesatan yang memasukkan pengikut-pengikutnya ke dalam kebinasaan, maka lihatlah di belakang siapa kah kamu berjalan!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Fir’aun berjalan memimpin kaumnya menuju azab neraka pada hari kiamat, lalu dia memasukkan mereka ke dalam neraka Jahanam. Seburuk-buruk tempat yang didatangi adalah tempat yang mereka datangi dan masuki karena biasanya tempat berair itu biasanya didatangi manusia karena kehausan namun neraka itu kebalikan dari hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia di depan kaumnya} Fir’aun berjalan di depan kaumnya {pada hari Kiamat, lalu membawa mereka} memasukkan mereka {ke dalam neraka. Itulah seburuk-buruk tempat masuk} tempat masuk {yang dimasuki} yang dimasuki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98 tidak aneh ketika kaumnya mengikutinya, maka firaun mencelakakan dan membinasakan mereka ”ia berjalan dimuka kaumnya di hari kiamat lalu memasukan mereka kedalam neraka. neraka itu seburuk buruk tempat yang didatangi”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَقۡدُمُ قَوۡمَهُۥ) yaqdumu qaumahu : berjalan mendahului menuju neraka dan mengantarkan kaumnya ke nereka. (وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ) wa bi’sa wirdul mauruud : seburuk-buruk tempat yang dimasuki, nereka. Makna ayat : (يَقۡدُمُ قَوۡمَهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ) Dia mengantarkan kaumnya menuju neraka (وَبِئۡسَ ٱلۡوِرۡدُ ٱلۡمَوۡرُودُ) “Neraka itu seburuk-buruk tempat yang didatangi.” neraka Jahanam. Pelajaran dari ayat : • Tercelanya sumber-sumber kebatilan, keburukan, dan kerusakkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 98: Lalu kaumnya mengikutinya dari belakang sebagaimana mereka mengikutinya ketika di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 98",
    "description": "Dia'fir'aun'kelak berjalan di depan kaumnya di hari kiamat, sebagaimana yang ia lakukan ketika di dunia, memimpin mereka dalam kekufuran dan kedurhakaan, lalu ia pun membawa mereka masuk ke dalam neraka untuk merasakan pedihnya siksaan itu. Neraka yang penuh siksaan dan penderitaan itu adalah seburuk-buruk tempat yang dimasuki fir'aun beserta para pengikutnya. Dan mereka selalu diikuti dengan laknat atau kutukan di sini, yakni di dunia dengan laknat yang terus menerus hingga masuk ke liang kubur setelah ditenggelamkan di laut merah, dan begitu pula pada hari kiamat mereka akan mendapat laknat lain dengan dimasukkannya mereka ke dalam neraka. Laknat itu seburuk-buruk pemberian yang diberikan Allah kepada mereka yang mengingkari risalah yang dibawa nabi musa."
  }
]