[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah mengiringkan laknat pada mereka di dunia ini selain siksaan yang Dia segerakan bagi mereka di dunia ini selain siksaan yang Dia segerakan bagi mereka di dunia berupa tengggelam di dasar laut. Dan pada hari kiamat, terdapat laknat lain(bagi mereka)dengan dimasukan ke dalam neraka. Alangkah buruk kondisi yang menyatu pada mereka dan datang bertubi-tubi pada mereka, berupa siksaan Allah, serta laknat di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Di dunia ini Allah menghukum mereka secara bertubi-tubi dengan cara mengutuk, mengusir dan menjauhkan mereka dari rahmat-Nya di samping membinasakan mereka dengan cara menenggelamkan mereka ke dalam air laut. Dan Allah menambah hukuman mereka dengan mengutuk, mengusir dan menjauhkan mereka dari rahmat-Nya di Hari Kiamat. Seburuk-buruk hasil ialah dua kali kutukan dan azab yang mereka peroleh di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Mereka di dunia mendapat laknat secara terus menerus, mereka dijauhkan dari rahmat Allah; dan pada hari kiamat mereka juga mendapat laknat. Itulah seburuk-buruk laknat yang datang setelah laknat lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَأُتْبِعُوا۟ (Dan mereka selalu diikuti) Yakni Allah menjadikan setelah kebinasaan Fir’aun dan kaumnya satu sifat yang telah Dia jelaskan pada ayat lain. في هذه (di sini) Di dunia لَعْنَةً (dengan kutukan) Yakni diusir dan dijauhkan dari rahmat-Nya. وَيَوْمَ الْقِيٰمَةِ ۚ( dan (begitu pula) di hari kiamat) Dan di hari kiamat mereka dilaknat oleh seluruh manusia yang ada di padang mahsyar. بِئْسَ الرِّفْدُ الْمَرْفُودُ (La’nat itu seburuk-buruk pemberian yang diberikan) Yakni seburuk-buruk pemberian adalah laknat yang mereka berikan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Setelah dibinasakan di laut, Allah membuat Fir’aun dan pembesar-pembesar kaumnya dengan ditolak dan dijauhkan dari rahmat dunia. Allah juga memberi mereka kutukan dan laknat lain pada hari kiamat yaitu disisihkan dari penduduk lain saat Yaumul Hasyr, yaitu seburuk-buruk pemberian atau bantuan. Laknat itu dinamakan dengan pemberian bertujuan untuk menyindir, sebagaimana penamaan Az-zaqqum dalam surah Ash-Shaffat ayat 63."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka diikuti} mereka diikuti {di sini} di dunia ini {dengan laknat dan pada hari Kiamat. Itu seburuk-buruk pemberian yang diserahkan} pemberian yang diberikan kepada mereka, yaitu laknat di dunia dan akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99 “dan mereka selalu diikuti” di dunia ini “dengan kutukan dan (begitu pula) di hari kiamat” Allah, malaikat, dan semua manusia melaknat mereka di dunia dan akhirat. ”laknat itu seburuk buruk pemberian yang diberikan” maksudnya, ia adalah sejelek jelek sesuatu yang terkumpul untuk mereka. Azab Allah dan laknat dunia dan akhirat menumpuk pada mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (وَأُتۡبِعُواْ فِي هَٰذِهِۦ لَعۡنَةٗ) wa utbi’uu fii haadzhii la’nah : laknat mengiringi mereka selama di dunia, dengan ditenggelamkan. (بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ) bi’sar rifdul marfuud : sejelek-jeleknya pemberian, yaitu laknat ketika di dunia dan laknat akhirat. Makna ayat : Firman-Nya (وَأُتۡبِعُواْ فِي هَٰذِهِۦ لَعۡنَةٗ) Firaun dan kaumnya dilaknat di dunia dan pada hari kiamat kelak. (بِئۡسَ ٱلرِّفۡدُ ٱلۡمَرۡفُودُ) Seburuk-buruknya pemberian, yaitu laknat dunia dan akhirat. Ar-Rifd adalah pemberian atau bantuan, al-Marfuud adalah yang dibantu, dan yang diberi. Pelajaran dari ayat : • Seburuk-buruk orang yang disiksa adalah orang yang disiksa di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Hud ayat 99: Allah melaknatnya, para malaikat melaknatnya, dan manusia semua melaknatnya di dunia maupun akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Hud Ayat 99",
    "description": "Dan mereka selalu diikuti dengan laknat atau kutukan di sini, yakni di dunia dengan laknat yang terus menerus hingga masuk ke liang kubur setelah ditenggelamkan di laut merah, dan begitu pula pada hari kiamat mereka akan mendapat laknat lain dengan dimasukkannya mereka ke dalam neraka. Laknat itu seburuk-buruk pemberian yang diberikan Allah kepada mereka yang mengingkari risalah yang dibawa nabi musa. Setelah diuraikan beberapa kisah para nabi beserta kaumnya yang ingkar terhadap risalah yang dibawa para nabi dan akibat pengingkaran mereka, ayat berikut ini menegaskan tujuan dipaparkannya kisah-kisah tersebut. Itulah beberapa berita tentang negeri-negeri yang telah kami binasakan penduduknya akibat kekufuran mereka yang kami ceritakan kepadamu wahai nabi Muhammad, agar engkau sampaikan kepada umatmu sebagai pelajaran bagi mereka. Di antara negeri-negeri itu sebagian masih ada bekas-bekas peninggalannya yang tersisa dan ada pula yang telah musnah hingga tidak ada bekasnya sama sekali."
  }
]