[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Lalu datanglah Thaghut Fir’aun, umat-umat sebelumnya yang kafir kepada para rasul mereka, dan penduduk negeri-negeri kaum Luth yang negeri mereka dijungkirbalikkan disebabkan oleh perbuatan mungkar mereka, yaitu kekafiran, kesyirikan dan homoseksual. Setiap umat tersebut mendurhakai rasul mereka yang diutus kepada mereka, maka Allah mengazab mereka dengan azab yang sangat berat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Masing-masing dari mereka durhaka terhadap Rasul-Nya yang diutus kepada mereka dan mendustakannya, maka Allah menyiksa mereka dengan siksaan yang lebih keras dari apa yang pernah menghancurkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَأَخَذَهُمْ أَخْذَةً رَّابِيَةً (lalu Allah menyiksa mereka dengan siksaan yang sangat keras) Yakni Allah menyiksa mereka dengan siksaan yang lebih keras daripada siksaan bagi kaum yang lain, yaitu dengan membalikkan rumah-rumah mereka besama dengan mereka, serta mengirim kepada mereka angin yang membawa hujan batu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Setiap kaum dari para utusan, melakukan maksiat kepada Tuhan mereka. Mereka tidak beriman dengan dakwah yang dilakukan olehnya. Kemudian Allah menyiksa mereka dengan siksaan yang sangat keras"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mendurhakai utusan Tuhan mereka, lalu Dia menyiksa mereka dengan siksaan yang sangat keras} menambah kekerasan dalam siksa itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Maksudnya, begitu juga dengan selain kedua umat pembangkang tadi, yaitu ‘Ad dan Tsamud, masih banyak lagi umat yang melampaui batas dan membangkang, seperti raja Mesir (Fir’aun) yang didatangi oleh rasul Allah, Nabi Musa bin Imran. Nabi Musa memberitahukan tanda-tanda kebesaran yang jelas padanya, namun mereka tindak meyakini kebenaran itu, justru membangkang dan kufur secara zhalim dan sombong. Sebelum mereka ada, “(penduduk) negeri yang dijungkirbalikkan,” yaitu negeri kaum Luth, seluruhnya melakukan “kesalahan yang besar,” yakni melakukan perbuatan yang melampaui batas; kekufuran, pendustaan, kezhaliman, pembangkangan yang disertai dengan berbagai kemaksiatan dan kefasikan. “Maka (masing-masing) mereka mendurhakai rasul Rabb mereka,” ini adalah isim jenis (kata benda umum) yang maksudnya, mereka semua mendustakan rasul yang diutus Allah pada mereka, kemudian mereka semua disiksa oleh Allah “dengan siksaan yang sangat keras,” yakni siksaan yang melebihi batas dan ukuran yang membinasakan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 10: 9-10. Allah menyebutkan tentang adzab yang ditimpakan kepada orang yang melampaui batas yaitu Fir’aun; Dimana telah datang ia dan yang sebelumnya suatu kaum, begitu juga kaum Luth. Mereka datang dengan perbuatan yang buruk dari kekafiran, syirik dan dosa-dosa kemungkaran. Allah menyendirikan Fir’aun dalam penyebutan karena sebab angkuh dan sombong dank arena ia meminta kaumnya (Bani Israil) untuk menyembahnya. Kemudian Allah menjelaskan bahwa mereka semua, para pendosa yang bermaksiat kepada utusan Allah yang ia diutus kepada mereka. Maka Allah siksa mereka dengan siksa yang keras. Allah tenggelamkan Fir’aun dan tentaranya di laut, dan kaum Luth Allah kirimkan pada mereka adzab; Yaitu Allah jungkir balikkan, sehingga yang atas menjadi di bawah, dan yang bawah menjadi di atas, dan tampaklah perbuatan menjijikkan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni siksaan yang melebihi batas dan ukuran sehingga membuat mereka binasa. Di antara mereka yang dibinasakan itu adalah kaum Nuh; Allah Subhaanahu wa Ta'aala membinasakan mereka dengan banjir besar yang sampai menutupi bagian bumi yang tinggi seperti gunung dan perbukitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 10",
    "description": "Maka diakibatkan sikap mereka yang mendurhakai utusan tuhannya, Allah menyiksa mereka dengan siksaan yang sangat keras sehingga memusnahkan mereka. 11-12. Tidak semua umat para nabi itu dibinasakan mereka yang taat akan diselamatkan, di antaranya adalah para pengikut nabi nuh, seperti yang ditegaskan pada ayat ini. Sesungguhnya ketika air naik membumbung sampai ke puncak gunung kami membawa nenek moyang kamu ke dalam kapal, agar kami jadikan peristiwa itu, akan diselamatkan nya mereka yang beriman dibinasakannya mereka yang durhaka , sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar."
  }
]