[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12 Manakala air sudah melewati ambang batasnya, di mana ia naik dan lebih tinggi dari segala sesuatu, Kami angkut nenek moyang kalian bersama NUh dalam kapal yang berjalan di atas air. Kami hendak menjadikan peristiwa yang padanya orang-orang beriman selamat dan orang-orang kafir tenggelam, sebagai nasihat dan pelajaran, di mana setiap pemilik telinga yang biasanya mengingat dan memahami apa yang ia dengar dari Allah akan mengingatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Sesungguhnya tatkala air telah melewati batas tingginya, Kami bawa orang-orang yang menjadi nenek moyang kalian di bahtera yang dibuat oleh Nuh -'alaihissalām- atas perintah dari Kami, maka bahtera itu menjadi tumpangan bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-12. Dan Allah membinasakan kaum Nabi Nuh dengan banjir bandang; dan Allah menyelamatkan Nabi Nuh dan orang-orang beriman yang bersamanya dengan kapal yang terapung di permukaan air dengan ketetapan dan penjagaan dari Allah. Dan Allah menjadikan peristiwa itu sebagai pelajaran dan peringatan bagi orang yang memiliki pendengaran yang digunakan untuk memahami kebenaran, dan memanfaatkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِنَّا لَمَّا طَغَا الْمَآءُ (Sesungguhnya Kami, tatkala air telah naik) Yakni air itu telah membanjiri. حَمَلْنٰكُمْ فِى الْجَارِيَةِ(Kami bawa (nenek moyang) kamu, ke dalam bahtera) Yakni ketika kalian masih berada di tulang sulbi nenek moyang kalian. Dan makna (الجارية) yakni kapal Nabi Nuh, yang berlayar di atas banjir bandang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Sesunggguhnya ketika kami mengangkat air dan mengeluarkan segala sesuatu dari dalam gunung dan ciptaan-ciptaan lainnya pada masa banjir bandang yang dijanjikan kepada Nuh AS, kami membawa spesies awal kalian di dalam kapal yang berlayar di atas air. Kapal itu adalah kapal Nuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya ketika air naik} melewati batasnya sehingga naik di atas segala sesuatu {Kami membawa kalian ke dalam (bahtera) yang berlayar} bahtera yang berlayar yang dibuat Nuh AS"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-12. DI antara sebagian besar kaum pendusta terdapat kaum Nuh. Allah menenggelamkan mereka dalam lautan ketika air menggenangi seluruh permukaan bumi dan melampaui ambang batas tertingginya. Allah memberi karunia seluruh makhluk yang ada setelah mereka yang berada “dalam bahtera,” semua makhluk yang ada setelah mereka berada di tulang punggung ayah dan ibu mereka yang diselamatkan Allah. Mereka memuji dan dan bersyukur kepada Allah yang telah menyelamatkan mereka pada saat kaum yang melampaui batas dibinasakan. Mereka menjadikan tanda-tanda kebesarnNYa sebagai pelajaran yang menunjukkan keesaanNya. Karena itu Allah berfirman, “Agar Kami jadikan,” perahu dan yang dimaksudkan adalah jenisnya, sebagai “peringatan bagi kamu,” ingatan kalian pada perahu pertama yang dibuat dan bagaimana kisahnya dan bagaimana Allah menyelamatkan orang yang beriman kepadaNya dan mengikuti RasulNya di atas perahu itu dan bagaimana Allah membinasakan seluruh penduduk bumi, karena jenis sesuatu itu mengingatkan pada aslinya. Allah berfirman, “Dan agar diperhatikan oleh telinga yang mau mendengar,” yang dicerna oleh mereka yang berakal dan dimengerti maksudnya, serta arah tanda-tanda kebesaranNya. Lain halnya dengan mereka yang berpaling, orang-orang yang lalai, orang-orang tolol, dan tidak memiliki kecerdasan. Mereka ini tidak bisa mengambil manfaat dari tanda-tanda kebesaran Allah karena tidak adanya pemahaman mereka mengenai Allah dan tidak mau memikirkan tanda-tanda kebesaranNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 11: 11-12. Ingatlah wahai manusia apa yang terjadi pada kaum Nuh, ketika mereka jelas atas kekafiran dan kesewenang-wenangannya, lalu ingatlah bagaimana Allah menenggelamkannya dengan banjir bandang. Dan Allah selamatkan mereka yang seiman dengan Nuh yang ia (Nuh) bawa mereka di atas kapal yang ia buat atas petunjuk dari wahyu Allah. Allah menjelaskan bahwa dijadikannya nikmat ini, yang Ia berikan nikmat-Nya kepada orang-orang yang beriman, yang menjadi pelajaran (nasihat) yang tejaga dari zaman ke zaman setelah mereka semua, agar supaya mereka (yang setelahnya) mengambil pelajaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dibawa dalam kapal Nabi Nuh ‘alaihis salam untuk diselamatkan ialah keluarga Nabi Nuh dan orang-orang yang beriman selain anaknya yang durhaka. Yang dibuat oleh Nabi Nuh ‘alaihis salam. Oleh karena itu, pujilah Allah dan bersyukurlah kepada-Nya karena Dia telah menyelamatkan kamu ketika Dia membinasakan orang-orang yang melampaui batas, dan ambillah pelajaran darinya yang menunjukkan keesaan Allah Subhaanahu wa Ta'aala dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 11",
    "description": "11-12. Tidak semua umat para nabi itu dibinasakan mereka yang taat akan diselamatkan, di antaranya adalah para pengikut nabi nuh, seperti yang ditegaskan pada ayat ini. Sesungguhnya ketika air naik membumbung sampai ke puncak gunung kami membawa nenek moyang kamu ke dalam kapal, agar kami jadikan peristiwa itu, akan diselamatkan nya mereka yang beriman dibinasakannya mereka yang durhaka , sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar"
  }
]