[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11-12 Manakala air sudah melewati ambang batasnya, di mana ia naik dan lebih tinggi dari segala sesuatu, Kami angkut nenek moyang kalian bersama NUh dalam kapal yang berjalan di atas air. Kami hendak menjadikan peristiwa yang padanya orang-orang beriman selamat dan orang-orang kafir tenggelam, sebagai nasihat dan pelajaran, di mana setiap pemilik telinga yang biasanya mengingat dan memahami apa yang ia dengar dari Allah akan mengingatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Agar Kami jadikan bahtera itu dan cerita tentangnya sebagai nasihat sekaligus bukti atas penghancuran orang-orang kafir dan keselamatan bagi orang-orang yang beriman serta agar didengar oleh telinga yang mengingat apa yang didengarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. لِنَجْعَلَهَا لَكُمْ (agar Kami jadikan peristiwa itu bagi kamu) Yakni menjadikan kisah kebinasaan kaum Nuh itu untuk kalian hai umat Muhammad. تَذْكِرَةً(sebagai peringatan) Sebagai ibrah dan pelajaran yang menunjukkan keagungan kuasa Allah dan kerasnya siksaan-Nya. وَتَعِيَهَآ أُذُنٌ وٰعِيَةٌ(dan agar diperhatikan oleh telinga yang mau mendengar) Yakni agar dapat dihafalkan oleh telinga yang dapat menghafal apa yang telah ia dengar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sungguh kami menjadikan peristiwa itu (saat kami memberi pertolongan bagi kaum mukmin dan membinasakan kaum kafir) sebagai contoh bagi kamu, supaya dijaga (diperhatikan) oleh telinga yang mau menjaganya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{agar Kami menjadikan itu sebagai peringatan} pelajaran {bagi kalian dan agar diperhatikan} diperhatikan {oleh telinga yang mau mendengar} yang mau menjaganya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11-12. DI antara sebagian besar kaum pendusta terdapat kaum Nuh. Allah menenggelamkan mereka dalam lautan ketika air menggenangi seluruh permukaan bumi dan melampaui ambang batas tertingginya. Allah memberi karunia seluruh makhluk yang ada setelah mereka yang berada “dalam bahtera,” semua makhluk yang ada setelah mereka berada di tulang punggung ayah dan ibu mereka yang diselamatkan Allah. Mereka memuji dan dan bersyukur kepada Allah yang telah menyelamatkan mereka pada saat kaum yang melampaui batas dibinasakan. Mereka menjadikan tanda-tanda kebesarnNYa sebagai pelajaran yang menunjukkan keesaanNya. Karena itu Allah berfirman, “Agar Kami jadikan,” perahu dan yang dimaksudkan adalah jenisnya, sebagai “peringatan bagi kamu,” ingatan kalian pada perahu pertama yang dibuat dan bagaimana kisahnya dan bagaimana Allah menyelamatkan orang yang beriman kepadaNya dan mengikuti RasulNya di atas perahu itu dan bagaimana Allah membinasakan seluruh penduduk bumi, karena jenis sesuatu itu mengingatkan pada aslinya. Allah berfirman, “Dan agar diperhatikan oleh telinga yang mau mendengar,” yang dicerna oleh mereka yang berakal dan dimengerti maksudnya, serta arah tanda-tanda kebesaranNya. Lain halnya dengan mereka yang berpaling, orang-orang yang lalai, orang-orang tolol, dan tidak memiliki kecerdasan. Mereka ini tidak bisa mengambil manfaat dari tanda-tanda kebesaran Allah karena tidak adanya pemahaman mereka mengenai Allah dan tidak mau memikirkan tanda-tanda kebesaranNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 12: 11-12. Ingatlah wahai manusia apa yang terjadi pada kaum Nuh, ketika mereka jelas atas kekafiran dan kesewenang-wenangannya, lalu ingatlah bagaimana Allah menenggelamkannya dengan banjir bandang. Dan Allah selamatkan mereka yang seiman dengan Nuh yang ia (Nuh) bawa mereka di atas kapal yang ia buat atas petunjuk dari wahyu Allah. Allah menjelaskan bahwa dijadikannya nikmat ini, yang Ia berikan nikmat-Nya kepada orang-orang yang beriman, yang menjadi pelajaran (nasihat) yang tejaga dari zaman ke zaman setelah mereka semua, agar supaya mereka (yang setelahnya) mengambil pelajaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penyelamatan kaum mukmin dan penenggelaman orang-orang kafir. Ada pula yang menafsirkan dhamir (kata ganti nama) ‘haa’ dengan kapal, yakni Allah Subhaanahu wa Ta'aala menjadikan kapal itu sebagai pengingat terhadap kapal pertama yang dibuat, kisahnya dan bagaimana Allah Subhaanahu wa Ta'aala menyelamatkan orang-orang yang beriman kepada-Nya dan mengikuti Rasul-Nya, dan bagaimana Dia membinasakan penghuni bumi semuanya. Yaitu orang-orang yang berakal, dimana mereka akan memikirkannya dan mengetahui maksudnya. Berbeda dengan orang yang berpaling dan lalai, maka mereka tidak dapat mengambil manfaat dari ayat-ayat Allah karena tidak mau mendengarkan dan memikirkan ayat-ayat Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 12",
    "description": "11-12. Tidak semua umat para nabi itu dibinasakan mereka yang taat akan diselamatkan, di antaranya adalah para pengikut nabi nuh, seperti yang ditegaskan pada ayat ini. Sesungguhnya ketika air naik membumbung sampai ke puncak gunung kami membawa nenek moyang kamu ke dalam kapal, agar kami jadikan peristiwa itu, akan diselamatkan nya mereka yang beriman dibinasakannya mereka yang durhaka , sebagai peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar. 13-15. Di awal surah diuraikan tentang kiamat, kini diuraikan tentang proses terjadinya kiamat. Maka apabila sangkakala ditiup oleh malaikat lsrafil sekali tiup, dan diangkatlah bumi dan gunung-gunung dengan sangat mudahnya, lalu dibenturkan keduanya sekali benturan maka bumi menjadi datar, tidak ada lagi gunung dan lembah (lihat: surah t'h'/20:105-106). Maka pada hari itu terjadilah hari kiamat."
  }
]