[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-18. Manakala malaikat meniup sangkakala sekali tiupan, yaitu tiupan pertama yang disusul dengan kehancuran alam semesta, bumi dan gunung-gunung di angkat dari tempatnya lalu keduanya hancur berkeping-keping dan dihantamkan dengan sekali hantaman. Saat itulah Hari Kiamat tiba. Langit terbelah, saat itu langit lemah dan rapuh, tidak kokoh dan tidak kuat, sedangkan para malaikat ada di sisi-sisi dan penjuru-penjurunya. Arasy Tuhanmu berada di atas mereka sambil dijunjung oleh 8 malaikat agung pada Hari Kiamat. Pada hari itu, kalian wahai manusia, dihadapkan kepada Allah untuk menghadapi perhitungan amal dan pembalasan, tidak ada sedikit pun rahasia kalian yang samar bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Lalu terbelahlah langit pada hari itu karena para Malaikat turun darinya, dan langit pada hari itu lemah setelah tadinya kuat dan tak bercelah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Pada hari itu langit akan terbelah, pintu-pintunya akan terbelah sebagai jalan para malaikat untuk turun; sehingga langit menjadi lemah dan rentan hancur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَانشَقَّتِ السَّمَآءُ فَهِىَ يَوْمَئِذٍ وَاهِيَةٌ (dan terbelahlah langit, karena pada hari itu langit menjadi lemah) Yakni terbelah karena para malaikat yang turun, dan ketika itu langit menjadi lemah dan kendor."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15-16. Pada hari itu, kiamat telah terjadi. Langit berguncang dan bagian-bagiannya menjadi terpecah belah. Pada hari itu, langit sangat rapuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Terjadilah kiamat {Langit juga terbelah, pada hari itu langit menjadi rapuh} lemah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-18. Ketika Allah menyebutkan apa yang dilakukanNya terhadap orang-orang yang mendustakan para RasulNya dan bagaimana Allah memberi balasan serta menyegerakan siksaan mereka di dunia, Allah menyelamatkan para Rasul dan pengikutnya, hal ini menjadi pendahuluan balasan akhirat serta pembalasan amal perbuatan secara sempurna pada Hari Kiamat. Allah menyebutkan berbagai hal mengerikan yang akan terjadi pada Hari KIamat. Pertama yang terjadi pada Hari Kiamat adalah ketika Israfil meniup “sangkakala”, ketika seluruh jasad bangkit pada tiupan pertama. Kemudian semua ruh keluar dan merasuk ke jasadnya masing-masing. Semua manusia berdiri menuju Rabb semesta alam. “Dan diangkatlah bumi dan gunung-gunung, lalu dibenturkan keduanya sekali bentur.” Maksudnya, gunung-gunung dicabut dan terlepas dari bumi kemudian di angkat hingga bumi menjadi datar sama sekali, tidak terlihat adanya tanah menurun dan tidak pula perbukitan. Inilah yang dilakukan Allah terhadap bumi beserta seluruh yang ada di atasnya. Sedangkan yang dilkaukan terhadap langit; langit bergetar, berjalan, terpecah dan warnanya berubah. Kekokohan dan kekuatan besar pun melemah setelah itu. Hal itu terjadi tidak lain dikarenakan sesuatu yang besar yang membuatnya terguncang dan dikarenakan urusan besar yang membuatnya lemah. “Dan malaikat-malaikat” mulia “berada di penjuru-penjuru langit.” Yakni, berada di tepi-tepi langit dan di pancang-pancang langit. Mereka tunduk karena Rabb mereka dan merendah karena keagunganNya. “Dan pada hari itu delapan orang malaikat menjunjung ‘Arasy Rabbmu di atas (kepala) mereka,” yakni para malaikat dengan kekuatan yang luar biasa ketika Allah datang untuk memutuskan perkara manusia dengan keadilan dan karuniaNya. Karena itu Allah berfirman, “Pada hari itu kamu dihadapkan pada Rabbmu, tiada sesuatu pun dari keadaanmu yang tersembunyi (bagi Allah).” Tidak raga dan hati kalian, tidak perbuatan dan sifat-sifat kalian, karena Allah Maha Mengetahui yang ghaib dan yang nyata. Semua manusia dikumpulkan dalam keadaan telanjang dan tidak mengenakan alas kaki di tanah luas terbentang rata. Penyeru akan memperdengarkan kepada mereka. Pandangan Allah mengenai semua manusia. Pada hari itu Allah akan memberi balasan atas amal perbuatan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 16: 13-18. Ketahuilah olehmu wahai manusia, jika malaikat telah meniupkan sangkakala dengan tiupan yang kedua, kemudian bumi akan terangkat begitu juga dengan gunung, kemudian dibenturkan keduanya, maka terbenturlah dengan sekali benturan. Dengan kejadian itu semua, maka terjadilah Al Waqi’ah, yaitu hari kiamat. Maka terbelah lah langit hingga terpisah, tidak utuh lagi dan juga padat atau, tiupan malaikat yang kedua adalah seruan untuk perubahan alam, awal perubahan alam dengan bentuk yang baru yang sebagaimana Allah inginkan untuk kebaikan kehidupan yang abadi, dengan dimulainya tiupan yang kedua ini. Kemudian Allah menjelaskan bahwa malaikat pada hari itu di sisi-sisi langit dan ujung-ujung langit untuk memenuhi perintah Allah. Dan malaikat pemikul Arsy Rabbnya, di atas (malaikat lain) di hari kiamat yang berjumlah delapan malaikat yang besar. Kemudian Allah menjelaskan bahwa manusia pada hari itu akan Allah berikan pemaparan atas balasan mereka, tidak ada yang tersembunyi bagi Allah sesuatu apapun dari mereka, tidak juga rahasia-rahasia mereka. Berkata Syaikh Abdul Aziz bin Baz tentang firman Allah وَيَحْمِلُ عَرْشَ رَبِّكَ فَوْقَهُمْ يَوْمَئِذٍۢ ثَمَـٰنِيَةٌۭ : Hal ini terjadi pada hari kiamat, dan ketika di dunia sudah dikenal bahwa yang membawa Arsy adalah empat malaikat. Berkata DR Al Kabisi : Bawa Arsy disini hanya secara makna, berbeda pendapat antara Ahlus Sunnah; Bahkan terjadi perselisihan di antara para Nabi dan Al Qur’an. Dan sungguh menyimpang dari petunjuk Allah akan sebagian sifat-Nya dan sebagian permasalahan Aqidah yang di antaranya adalah ketinggian Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 16",
    "description": "16-17. Setelah gunung hancur dan bumi menjadi rata dan terbelahlah langit, karena dahsyatnya situasi saat itu maka pada hari itu langit menjadi rapuh. Dan ketika itu juga atas perintah Allah para malaikat berada di berbagai penjuru langit yang telah rapuh itu. Pada hari itu delapan malaikat menjunjung'arsy yaitu singgasana tuhanmu di atas kepala mereka"
  }
]