[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19-24. Barangsiapa diberi kitab catatan amalnya dengan tangan kanannya, maka dia berkata dengan penuh kegembiraan dan suka cita, “Ambillah dan silakan membaca kitabku. Sesungguhnya di dunia aku yakin bila aku akan mendapatkan balasanku pada Hari kIamat, maka aku menyiapkan bekal berupa iman dan amal shalih.” Dia hidup dalam kenikmatan dan diridhai di surga yang tinggi tempat dan derajatnya. Buahnya dekat, dapat dipetik oleh orang yang duduk, orang yang berdiri, serta orang yang berbaring. Dikatakan kepada mereka, “Makanlah makanan dan minumlah minuman yang bersih dari gangguan, serta selamat dari segala yang dibenci, disebabkan apa yang kalian kerjakan berupa amal shalih di kehidupan dunia dahulu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Buah-buahannya dekat dengan orang yang memetiknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Buah-buahan di dalam surga sangat mudah dipetik, orang yang ingin memetiknya tidak perlu bersusah payah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. قُطُوفُهَا دَانِيَةٌ (buah-buahannya dekat) Yakni buah-buahannya dekat dengan orang yang akan memakannya baik itu dia sedang berdiri, duduk, atau berbaring."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22- 23. Yaitu kehidupan di surga yang tempat dan derajatnya tinggi. Buah-buahannya sangat dekat. Dia bisa memakannya dengan berdiri, bersandar dan berbaring"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang buah-buahannya} buah-buahnya {dekat} dekat untuk dipetik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Maka orang itu berada dalam kehidupan yang diridhai,” maksudnya mencakup seluruh hal yang diinginkan jiwa dan dipandang nikmat oleh mata. Mereka rela mendapatkannya dan tidak memilih yang lain. “Dalam surga yang tinggi,” yakni, istana-istana yang tinggi tempatnya. “Buah-buahannya dekat,” maksudnya, buah dan tamannya dengan berbagai jenisnya dekat dan mudah dipetik oleh penghuninya, baik dengan berdiri, duduk, maupun bertelekan. Dikatakan kepada mereka sebagai suatu penghormatan, “Makan dan minumlah,” dari berbagai jenis makanan nikmat dan minuman yang lezat, “dengan penuh nikmat,” yakni dengan sempurna tanpa terkotori dan tanpa lelah mengunyah. Balasan itu mereka dapatkan “disebabkan amal yang telah kamu kerjakan pada hari-hari yang telah lalu,” yaitu amal-amal shalih yang kamu kerjakan dan amal-amal buruk yang kamu tinggalkan seperti shalat, puasa, sedekah, haji, berbuat baik terhadap sesama, dzikir mengingat Allah, bertaubat padaNYa dan amalan-amalan lain yang menjadi sebab masuk surga, menjadi unsur kenikmatan dan pangkal kebahagiaannya dan meninggalkan amal-amal yang buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 23: 19-24 Allah mengabarkan bahwa barangsiapa yang diberikan kitab dengan tangan kanan, mereka berkata dengan girang : Lihatlah kitabku, demi Allah aku sudah menyangka (atau : aku yakin di dunia, bahwa nanti di akhirat aku akan dihisab dan berhadapan di hadapan Allah). Kemudian Allah menjelaskan bahwa dia akan hidup dengan ridha dan diberikan semua kelezatan, ia akan di masukkan ke dalam surga yang tinggi yang berbilik-bilik, dan diberikan buah matang dari pohon yang dekat untuk dimakan. Mudah untuk memetiknya dan mengambilnya. Kemudian dikatakan kepada mereka dengan penghormatan : Makanlah dan minumlah oleh kalian wahai penduduk surga apa yang lezat dan menyenangkan dari makanan surga dan minumannya yang lezat; Karena sebab kalian mementingkan tauhid dan amalan shalih di hari-hari yang telah berlalu di kehidupan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dapat dipetik oleh orang yang berdiri, duduk dan berbaring."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 23",
    "description": "21-24. Maka sebagai balasan atas amal salehnya ketika di dunia orang itu berada dalam kehidupan yang menyenangkan dan diridai, sehingga dia benar-benar merasa puas dengan anugerah Allah tersebut yaitu dalam surga yang tinggi tempat dan martabatnya. Di antara fasilitasnya adalah buah-buahannya dekat sehingga mudah untuk memetiknya. Kepada mereka dikatakan, 'makan dan minumlah dengan nikmat apa saja yang kamu inginkan. Ltu semua adalah ganjaran dari Allah karena amal yang telah kamu kerjakan pada hari-hari yang telah lalu. ' demikianlah ke-mahaadilan Allah, ia memberikan balasan yang sempurna bagi orang-orang yang bersabar untuk senantiasa taat kepada-Nya selama hidup di dunia"
  }
]