[
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dikatakan kepada mereka sebagai bentuk pemuliaan, “Makan dan minumlah dengan makanan dan minuman yang tidak mengandung penyakit sebagai balasan atas amal saleh yang kalian lakukan di hari-hari yang telah lalu di dunia.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Dan sebagian kenikmatan surga itu, dapat makan dan minum sesuka hati yang semata-mata untuk menikmatinya, bukan karena membutuhkannya. Semua kenikmatan ini merupakan balasan bagi mereka atas ketaatan dan ibadah yang telah mereka kerjakan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. بِمَآ أَسْلَفْتُمْ فِى الْأَيَّامِ الْخَالِيَةِ (disebabkan amal yang telah kamu kerjakan pada hari-hari yang telah lalu) Yakni karena amalan-amalan shalih yang telah kalian lakukan di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dikatakan kepada mereka: “Makan dan minumlah makanan dan minuman yang lezat itu. Kalian tidak akan mengalami gangguan (perut) saat memakannya, karena kalian telah melakukan amal shalih di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Makan dan minumlah dengan nikmat} makan dan minumlah dengan tenang tanpa ada yang mengganggu dan melarang {sebagai balasan amal yang kalian kerjakan} atas apa yang dahulu kakian kerjakam berupa amal shalih {pada hari-hari yang telah lalu} hari-hari di dunia yang telah berlalu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21-24. “Maka orang itu berada dalam kehidupan yang diridhai,” maksudnya mencakup seluruh hal yang diinginkan jiwa dan dipandang nikmat oleh mata. Mereka rela mendapatkannya dan tidak memilih yang lain. “Dalam surga yang tinggi,” yakni, istana-istana yang tinggi tempatnya. “Buah-buahannya dekat,” maksudnya, buah dan tamannya dengan berbagai jenisnya dekat dan mudah dipetik oleh penghuninya, baik dengan berdiri, duduk, maupun bertelekan. Dikatakan kepada mereka sebagai suatu penghormatan, “Makan dan minumlah,” dari berbagai jenis makanan nikmat dan minuman yang lezat, “dengan penuh nikmat,” yakni dengan sempurna tanpa terkotori dan tanpa lelah mengunyah. Balasan itu mereka dapatkan “disebabkan amal yang telah kamu kerjakan pada hari-hari yang telah lalu,” yaitu amal-amal shalih yang kamu kerjakan dan amal-amal buruk yang kamu tinggalkan seperti shalat, puasa, sedekah, haji, berbuat baik terhadap sesama, dzikir mengingat Allah, bertaubat padaNYa dan amalan-amalan lain yang menjadi sebab masuk surga, menjadi unsur kenikmatan dan pangkal kebahagiaannya dan meninggalkan amal-amal yang buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 24: 19-24 Allah mengabarkan bahwa barangsiapa yang diberikan kitab dengan tangan kanan, mereka berkata dengan girang : Lihatlah kitabku, demi Allah aku sudah menyangka (atau : aku yakin di dunia, bahwa nanti di akhirat aku akan dihisab dan berhadapan di hadapan Allah). Kemudian Allah menjelaskan bahwa dia akan hidup dengan ridha dan diberikan semua kelezatan, ia akan di masukkan ke dalam surga yang tinggi yang berbilik-bilik, dan diberikan buah matang dari pohon yang dekat untuk dimakan. Mudah untuk memetiknya dan mengambilnya. Kemudian dikatakan kepada mereka dengan penghormatan : Makanlah dan minumlah oleh kalian wahai penduduk surga apa yang lezat dan menyenangkan dari makanan surga dan minumannya yang lezat; Karena sebab kalian mementingkan tauhid dan amalan shalih di hari-hari yang telah berlalu di kehidupan dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti shalat, zakat, puasa, haji, berbuat ihsan kepada manusia, dzikrullah dan kembali kepada-Nya. Oleh karena itu, amal saleh Allah jadikan sebagai sebab seseorang masuk surga, sebagai bahan kenikmatannya dan sumber kebahagiaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 24",
    "description": "21-24. Maka sebagai balasan atas amal salehnya ketika di dunia orang itu berada dalam kehidupan yang menyenangkan dan diridai, sehingga dia benar-benar merasa puas dengan anugerah Allah tersebut yaitu dalam surga yang tinggi tempat dan martabatnya. Di antara fasilitasnya adalah buah-buahannya dekat sehingga mudah untuk memetiknya. Kepada mereka dikatakan, 'makan dan minumlah dengan nikmat apa saja yang kamu inginkan. Ltu semua adalah ganjaran dari Allah karena amal yang telah kamu kerjakan pada hari-hari yang telah lalu. ' demikianlah ke-mahaadilan Allah, ia memberikan balasan yang sempurna bagi orang-orang yang bersabar untuk senantiasa taat kepada-Nya selama hidup di dunia. 25-26. Setelah uraian tentang balasan yang diterima oleh orang-orang yang taat kini giliran diuraikan keadaan orang-orang yang durhaka. Dan adapun orang yang kitabnya diberikan di tangan kirinya, maka dia berkata dengan penuh kesedihan dan penyesalan, 'alangkah baiknya jika kitab catatan amalku ini tidak diberikan kepadaku. Sehingga aku tidak mengetahui bagaimana perhitungan terhadap diriku."
  }
]