[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-29. Adapun orang yang diberi kitab catatan amalnya dengan tangan kirinya, dia berkata dengan penuh kesedihan dan penyesalan, “Celaka diriku, seandainya aku tidak diberi kitabku,seandainya aku tidak tahu balasanku. Seandainya kematian yang aku alami di dunia adalah akhir segala urusanku dan aku tidak dibangkitkan sesudahnya. Harta yang aku kumpulkan di dunia tidak berguna bagiku, alasanku lenyap menghilang dan aku tidak punya alasan apa pun.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Adapun orang yang diberi kitab catatan amalnya dengan tangan kirinya, maka ia berkata karena penyesalan yang mendalam, “Seandainya saja aku tidak diberi kitab catatan amalku karena di dalamnya terdapat perbuatan-perbuatan buruk yang mengharuskan aku mendapat siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-27. Kemudian Allah menyebutkan golongan kedua, yaitu orang-orang yang menerima kitab catatan amalnya dengan tangan kiri. Setiap orang dari mereka akan berharap untuk tidak dibangkitkan dan tidak mendapat kitab catatan amal; mereka berharap andai saja kematian mereka tidak harus dihidupkan kembali setelahnya, sebab mereka menyakini buruknya tempat kesudahan mereka ketika menerima kitab itu dengan tangan kiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَأَمَّا مَنْ أُوتِىَ كِتٰبَهُۥ بِشِمَالِهِۦ فَيَقُولُ (Adapun orang yang diberikan kepadanya kitabnya dari sebelah kirinya, maka dia berkata) Berkata dengan penuh kesedihan karena keburukan yang ia lihat di kitabnya. يٰلَيْتَنِى لَمْ أُوتَ كِتٰبِيَهْ (“Wahai alangkah baiknya kiranya tidak diberikan kepadaku kitabku (ini)) Yakni andai aku tidak diberi kitabku ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Adapun orang yang menerima kitabnya (buku catatan amalnya) dengan tangan kiri. maka dia akan berkata dengan sedih dan penuh penyesalan: “Andai saja aku bisa untuk tidak menerima kitabku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang yang diberi catatan amalnya di tangan kirinya berkata,“Seandainya saja aku tidak diberi catatan amalku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-29. Mereka adalah orang-orang yang celaka. Catatan amal mereka yang mencakup amalan-amalan buruk diterima dengan tangan kiri sebagai tanda yang membedakan mereka dengan yang lain dan sebagai tanda kehinaan,aib, dan dipermalukan. Salah satu dari mereka berkata dengan bersedih dan berduka, “Aduhai alangkah baiknya kiranya tidak diberikan kepadaku kitabku (ini),” karena ia diberi kabar gembira akan masuk neraka dan kerugian abadi, “dan aku tidak mengetahui apa hisab terhadap diriku,” alangkah baiknya aku terlupakan dan tidak dibangkitkan serta amalku tidak diperhitungkan. Karena itu ia berkata, “Aduhai kiranya kematian itulah yang menyelesaikan segala sesuatu,” maksudnya, alangkah baiknya (jika) kematianku itu adalah kematian yang tidak lagi dibangkitkan. Kemudian ia menengok harta dan kekuasaannya. Itulah yang mengundang bencana baginya dan sama sekali tidak membawa guna untuk hari akhirnya andai dijadikan tebusan dari siksaan. Ia berkata, “Hartaku sekali-kali tidak memberi manfaat kepadaku.” Maksudnya, tidak berguna bagiku, tidak di dunia karena tidak aku gunakan untuk amal baik sama sekali dan tidak pula di akhirat. Waktu memanfaatkan harta telah habis. “Telah hilang kekuasaan dariku,” yakni lenyap dan sirna. Bala tentara tidak lagi berguna,tidak pula banyaknya segala sesuatu, tidak jumlah maupun persiapan dan tidak pula wibawa. Semua itu lenyap bagai diterbangkan angin. Karenanya, pedagang kehilangan laba. Yang datang adalah penggantinya berupa kesedihan dan duka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 25: 25-29. Kemudian Allah mengabarkan barangsiapa yang diberikan kitab dengan tangan kiri (dan) jika ia melihat amalan buruknya, maka ia berkata : Seandainya aku tidak diberikan kitabku, sebab ini bukti bahwasanya aku berhak untuk diadzab dan dimasukkan neraka. Ia melanjutkan perkataannya : Seandainya aku tidak tahu sesuatupun dari hisabku, dan tidak tahu apa balasanku, dan seandainya kematian di dunia adalah kematian terakhir dan kematian yang tak akan pernah dibangkitkan kembali. Kemudian ia berkata dengan penyesalan : Apa yang dapat aku gunakan dari hartaku, yang telah aku kumpulkan di dunia ? Sungguh ia tak bermanfaat bagiku, dan tak dapat menjagaku dari suatu adzab Allah. Sungguh aku telah tersungkur di hadapannya (harta), sedangkan ia pergi tanpa mampu memenuhi keinginanku, hartaku tak bermanfaat bagiku pada hari ini, tak ada kekuasaan, tak ada kedudukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang-orang yang celaka diberikan catatan amal mereka yang buruk dengan tangan kiri mereka untuk memisahkan mereka dengan yang lain dan untuk menghinakan mereka sekaligus membuka aib mereka. Dalam keadaan sedih dan duka. Karena ia diberi kabar gembira dengan masuk ke neraka dan mendapatkan kesengsaraan yang kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 25",
    "description": "25-26. Setelah uraian tentang balasan yang diterima oleh orang-orang yang taat kini giliran diuraikan keadaan orang-orang yang durhaka. Dan adapun orang yang kitabnya diberikan di tangan kirinya, maka dia berkata dengan penuh kesedihan dan penyesalan, 'alangkah baiknya jika kitab catatan amalku ini tidak diberikan kepadaku. Sehingga aku tidak mengetahui bagaimana perhitungan terhadap diriku"
  }
]