[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-34. Dikatakan kepada para malaikat penjaga Jahanam, “Ambillah penjahat penuh dosa ini, tariklah kedua tangannya ke lehernya dengan belenggu, kemudian masukkanlah dia ke dalam Neraka Jahim agar dia merasakan panasnya, kemudian ikatlah dalam rantai besi yang panjangnya 70 hasta, masukkanlah dia kedalamnya, sesungguhnya dia tidak membenarkan bahwa Allah adalah Tuhan yang haq semata, tidak ada sekutu bagiNya, tidak mengamalkan petunjukNya, tidak mendorong orang-orang untuk memberi makan orang-orang yang membutuhkan dari kalangan orang-orang miskin dan lainnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Sesungguhnya dia dulu tidak beriman kepada Allah Yang Mahaagung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Pada ayat-ayat ini disebutkan perkara yang menyebabkan mereka mendapat azab tersebut; yaitu karena mereka tidak beriman kepada Allah, melarang diri sendiri dan orang lain untuk memberi sebagian harta bagi orang-orang miskin, mereka enggan memberi makan orang-orang miskin dan juga melarang orang lain melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Sesungguhnya dia tidak membenarkan adanya Allah dan keesaanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya dia tidak beriman kepada Allah Yang Maha agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-37. Pada saat itu ia diperintahkan untuk disiksa, dikatakan kepada Zabaniyah malaikat yang bengis dan kejam, “Peganglah dia lalu belenggulah tangannya ke lehernya.” Maksudnya, kenakan belenggu di lehernya hingga tercekik, “kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala.” Maksudnya, bolak-balikkan dia di atas bara dan kobarannya, “kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta,” yang berasal dari belenggu Neraka Jahanam yang amat panas membara. Belitlah dia dengan dimasukkan dari anusnya hingga menusuk keluar dari mulutnya kemudian digantung dan terus disiksa dengan azab yang mengerikan. Alangkah buruknya azab dan siksa. Duhai meruginya dia dengan penghinaan dan celaan. Penyebabnya sampai di tempat itu adalah, “sesungguhnya dia dahulu tidak beriman kepada Allah Yang Maha agung.” Ia kufur terhadap Rabbnya, membangkang para RasulNya, dan menolak kebenaran yang dibawa oleh para rasul, “dan juga dia tidak mendorong (orang lain) untuk memberi makan orang miskin.” Maksudnya, di hatinya tidak ada belas kasih terhadap fakir miskin. Ia tidak pernah memberi mereka makan dari hartanya dan tidak mendorong orang lain untuk memberi mereka makan, karena tidak adanya nilai Agama dalam dirinya. Oleh karena itu, pusat dan unsur kebahagiaan itu ada dua; ikhlas karena Allah semata yang akarnya ada pada keimanan terhadap Allah dan berbuat baik terhadap sesama dengan segala bentuk kebaikan yag diantara bentuk terbesarnya adalah menghilangkan kemadorotan dari orang yang membutuhkan dengan memberi mereka makanan pokoknya, sedangkan pada diri mereka penghuni nereka tadi tidak ada keikhlasan dan tidak ada kebaikan, Karena itulah mereka berhak mendapatkan apa yang mereka peroleh. “Maka tiada seorang teman pun baginya pada hari ini di sini.” Pada Hari Kiamat tidak ada seorang “teman” dan sahabat pun yang bisa menolongnya agar bisa selamat dari azab Allah dan bisa membuatnya mendapatkan pahala Allah. Orang-orang yang zalim tidak mempunyai teman setia seorangpun dan tidak (pula) mempunyai seorang pemberi syafa’at yang diterima syafa’atnya. Ghafir:18 Ia tidak mendapat “makanan sedikit pun (baginya) kecuali dari darah dan nanah.” Yaitu darah bercampur nanah penduduk neraka yang amat panas, pahit, busuk, dan tidak enak. Tidak ada yang memakan makanan seperti ini “kecuali orang-orang yang berdosa.” Yaitu orang-orang yang tersesat dari jalan yang lurus dan menempuh jalan lain yang mengantarkan mereka menuju Neraka Jahim. Karena itu mereka berhak mendapatkan siksaan yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 33: 30-35. Dikatakan kepada penjaga neraka jahannam yang menyala-nyala dengan hebat : Masukkan oleh kalian, mereka (kafir) pendosa ini dan ikatlah tangannya di lehernya, kemudian lemparkan ke dalam neraka jahannam yang terbakar, dan timpakan adzab nereka, kemudian ikatlah dengan rantai yang panjangnya 70 hasta dengan rantai dari api yang sangat panas, ikat dengannya. Berkata Sufyan : Sesungguhnya masuk api dalam duburnya dan keluar melalui mulutnya. Kami berlindung kepada Allah dan semoga Allah memberi kami kebaikan. Diberikan adzab ini karena di dunia tidak beribadah kepada Allah saja secara ikhlas; Akan tetapi ia menyekutukan Allah bersamaan dengan tuhan-tuhan selain-Nya. Dan dalam hatinya tidak hinggap kasih sayang bagi orang faqir dan yang membutuhkan; Ia tidak pernah memberikan dari hartanya,dan tidak juga menganjurkan selain dirinya agar memberikan makan kepada mereka orang-orang faqir. Maka tidak ada pertolongan baginya di hari kiamat, dan tidak ada pula kebahagiaan, begitu juga tidak aka didapati siapapun yang menjadi juru selamatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebab ia diazab dengan azab yang demikian rupa adalah karena dia tidak beriman kepada Allah, yakni kafir kepada-Nya, menentang para rasul-Nya dan menolak kebenaran yang mereka bawa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 33",
    "description": "33-34. Mengapa si pendurhaka itu disiksa sedemikian hebat' inilah yang menjadi penyebabnya. Sesungguhnya dia dahulu ketika di dunia adalah orang yang tidak beriman kepada Allah yang mahabesar. Dan juga dia tidak mendorong dirinya dan orang lain untuk memberi makan orang miskin, padahal dia memiliki kemampuan"
  }
]