[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-37. Dia tidak punya makanan kecuali nanah penghuni neraka, yang tidak ada yang memakannya kecuali orang-orang pendosa yang bersikukuh di atas kekafiran kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Tidak ada yang mau makan makanan itu kecuali para pelaku dosa dan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Tidak ada yang memakan makanan ini melainkan orang yang sengaja tidak beriman kepada Allah dan melakukan perbuatan yang mengundang kemurkaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. لَّا يَأْكُلُهُۥٓ إِلَّا الْخٰطِـُٔونَ (Tidak ada yang memakannya kecuali orang-orang yang berdosa) Yakni orang-orang yang banyak memiliki banyak kesalahan dan berlumuran dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Tidak ada yang memakan (nanah) itu kecuali orang-orang kafir yang memiliki banyak dosa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada yang memakannya, kecuali para pendosa.”} orang-orang yang melakukan dosa besar seperti menyekutukan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-37. Pada saat itu ia diperintahkan untuk disiksa, dikatakan kepada Zabaniyah malaikat yang bengis dan kejam, “Peganglah dia lalu belenggulah tangannya ke lehernya.” Maksudnya, kenakan belenggu di lehernya hingga tercekik, “kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala.” Maksudnya, bolak-balikkan dia di atas bara dan kobarannya, “kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta,” yang berasal dari belenggu Neraka Jahanam yang amat panas membara. Belitlah dia dengan dimasukkan dari anusnya hingga menusuk keluar dari mulutnya kemudian digantung dan terus disiksa dengan azab yang mengerikan. Alangkah buruknya azab dan siksa. Duhai meruginya dia dengan penghinaan dan celaan. Penyebabnya sampai di tempat itu adalah, “sesungguhnya dia dahulu tidak beriman kepada Allah Yang Maha agung.” Ia kufur terhadap Rabbnya, membangkang para RasulNya, dan menolak kebenaran yang dibawa oleh para rasul, “dan juga dia tidak mendorong (orang lain) untuk memberi makan orang miskin.” Maksudnya, di hatinya tidak ada belas kasih terhadap fakir miskin. Ia tidak pernah memberi mereka makan dari hartanya dan tidak mendorong orang lain untuk memberi mereka makan, karena tidak adanya nilai Agama dalam dirinya. Oleh karena itu, pusat dan unsur kebahagiaan itu ada dua; ikhlas karena Allah semata yang akarnya ada pada keimanan terhadap Allah dan berbuat baik terhadap sesama dengan segala bentuk kebaikan yag diantara bentuk terbesarnya adalah menghilangkan kemadorotan dari orang yang membutuhkan dengan memberi mereka makanan pokoknya, sedangkan pada diri mereka penghuni nereka tadi tidak ada keikhlasan dan tidak ada kebaikan, Karena itulah mereka berhak mendapatkan apa yang mereka peroleh. “Maka tiada seorang teman pun baginya pada hari ini di sini.” Pada Hari Kiamat tidak ada seorang “teman” dan sahabat pun yang bisa menolongnya agar bisa selamat dari azab Allah dan bisa membuatnya mendapatkan pahala Allah. Orang-orang yang zalim tidak mempunyai teman setia seorangpun dan tidak (pula) mempunyai seorang pemberi syafa’at yang diterima syafa’atnya. Ghafir:18 Ia tidak mendapat “makanan sedikit pun (baginya) kecuali dari darah dan nanah.” Yaitu darah bercampur nanah penduduk neraka yang amat panas, pahit, busuk, dan tidak enak. Tidak ada yang memakan makanan seperti ini “kecuali orang-orang yang berdosa.” Yaitu orang-orang yang tersesat dari jalan yang lurus dan menempuh jalan lain yang mengantarkan mereka menuju Neraka Jahim. Karena itu mereka berhak mendapatkan siksaan yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 37: 36-37. Allah menjelaskan bahwa Dia tidak memberikan orang kafir pada hari kiamat makanan yang dimakan di nereka kecuali nanah penghuni nereka yang mengalir, disebutan dalam ayat yang lain bahwa makanan mereka adalah tanaman berduri yang tidak mengenyangkan dan pohon zaqum. Tidaklah makanan ini dimakan kecuali oleh orang-orang fasiq pendosa yang sesat dari jalan yang lurus, mereka semua berjalan mengikuti petunjuk ke neraka. Kami meminta kepada Allah keselamatan dan kebaikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang tidak menempuh jalan yang lurus, bahkan menempuh jalan ke neraka. Oleh karena itulah, mereka berhak mendapatkan azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 37",
    "description": "35-37. Atas segala perbuatan buruk yang dilakukan di dunia, maka akhirnya pada hari ini yaitu hari di akhirat, di sini yaitu di neraka, tidak ada seorang teman pun baginya yang dapat menolong atau meringankan siksa yang dia terima. Dan tidak ada pula baginya makanan sedikit pun kecuali berupa gislin yaitu makanan yang terbuat dari darah penghuni neraka dan juga nanah. Tidak ada yang memakannya kecuali orang-orang yang berdosa yaitu yang secara terus menerus berbuat durhaka. 38-40. Semua yang diuraikan pada ayat-ayat di atas belum terlihat oleh manusia, maka kelompok ayat ini menegaskan tentang kebenaran informasi Al-Qur'an dengan bersumpah menyebut wujud yang terlihat maupun yang tidak terlihat. Maka aku bersumpah demi apa yang kamu lihat, dan demi apa yang tidak kamu lihat dari ciptaan-ciptaan-ku. Sesungguhnya ia, Al-Qur'an, itu benar-benar wahyu yang diturunkan kepada rasul yang mulia yaitu nabi Muhammad."
  }
]