[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4.Kaum Tsamud, yaitu kaum Nabi Shaleh, dan kaum Ad yaitu kaum Nabi Hud, telah mendustakan Hari KIamat yang kengeriannya menggetarkan hati manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Ṡamūd kaum nabi Ṣāleḥ dan 'Ād kaum Nabi Hūd telah mendustakan hari Kiamat yang menggetarkan manusia karena kedahsyatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Setelah ayat-ayat sebelumnya mengabarkan hari kiamat pasti akan terjadi, kemudian ayat-ayat selanjutnya berbicara tentang kesudahan sebagian kaum yang mendustakan hari kiamat, dan memulainya dengan menyebutkan kaum Tsamud dan ‘Ad. Dan pada ayat ini hari kiamat disebut dengan ‘al-Qari’ah’, karena ia mengetuk hari dengan kengerian dan keburukannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. كَذَّبَتْ ثَمُودُ وَعَادٌۢ بِالْقَارِعَةِ (Kaum Tsamud dan ‘Aad telah mendustakan hari kiamat) Hari kiamat dinamakan dengan al-Qari’ah karena menakuti manusia dengan huru-hara dan kengeriannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kaum Tsamud yang merupakan kaum nabi Shalih dan kaum ‘Aad yang merupakan kaum nabi Hud, mereka mendustakan kiamat yang dapat menggetarkan manusia karena sangat mengerikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kaum Tsamud dan ‘Ad telah mendustakan hari kiamat} Hari kiamat yang meggetarkan manusia dengan kengeriannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Kemudian Allah menyebutkan contoh dari kondisi-kondisi kiamat yang ada di dunia yang bisa disaksikan, yaitu datangnya berbagai macam siksaan keras yang menimpa umat-umat pembangkang seraya berfirman, “Kaum Tsamud telah mendustakan.” Mereka adalah kabilah terkenal yang menghuni daerah al-Hijir, mereka adalah kaum yang diutuskan kepada mereka seseorang rasul bernama Nabi Shaleh. Nabi Shaleh melarang mereka dari kesyirikan yang mereka lakukan dan memerintahkan mereka untuk bertauhid, tapi mereka menentang dan mendustakan seruan Nabi Shaleh. Mereka mendustakan berita tentang Hari Kiamat yang disampaikan Nabi Shaleh. Hari Kiamat itulah hari menakutkan yang membuat makhluk ketakutan karena huru-haranya. Begitu juga dengan kaum ‘Ad pertama, kaum yang bertempat di Hadhramaut ketika Allah mengutus Nabi Hud kepada mereka. Nabi Hud menyerukan mereka untuk menyembah Allah semata, tapi mereka mendustakannya dan mengingkari Hari Kebangkitan yang disampaikan pada mereka. Allah kemudian membinasakan kedua kaum tersebut dengan siksaan yang disegerakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 4: Allah menjelaskan sebagian umat yang mendustakan hari kiamat, dan menjelaskan urutan bagaimana ia mendustakan adzab dan balasan. Allah menjelaskan juga bahwa Tsamud (kaum Shalih) dan Ad (kaum Hud), yang mendustakan Al Qari’ah yaitu hari kiamat. Dinamakan Al Qari’ah karena hati yang ketakutan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tsamud adalah kabilah yang terkenal yang menempati Hijr, dimana Allah Subhaanahu wa Ta'aala mengutus kepada mereka Nabi Shalih ‘alaihis salam, Beliau melarang mereka berbuat syirk dan memerintahkan mereka bertauhid, namun mereka menolak dakwah Beliau dan mendustakannya serta mendustakan apa yang Beliau beritakan tentang hari Kiamat. Mereka tinggal di Hadhramaut; Allah Subhaanahu wa Ta'aala mengutus kepada mereka Rasul-Nya Hud ‘alaihis salam yang mengajak mereka mentauhidkan Allah, namun mereka mendustakan Beliau dan mendustakan apa yang Beliau beritakan tentang kebangkitan, maka Allah Subhaanahu wa Ta'aala membinasakan kedua kabilah itu dengan azab yang segera. Al Qaari'ah menurut bahasa berarti yang menggentarkan hati, hari kiamat dinamakan Al Qaari'ah karena ia menggentarkan hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 4",
    "description": "4-5. Telah banyak generasi di masa lalu yang mengingkari hari kiamat. Kelompok ayat ini mengungkap sekelumit tentang kaum yang mengingkari hari kiamat dan sanksi yang mereka terima. Kaum samud, dan 'ad telah mendustakan hari kiamat. Maka adapun kaum samud, mereka telah dibinasakan dengan suara yang sangat keras yaitu suara guntur yang menggelegar bercampur dengan kilat, 4-5"
  }
]