[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-43. Aku bersumpah dengan apa yang kalian lihat, yaitu hal-hal yang terlihat, dan juga apa yang tidak kalian lihat yang ghaib dari kalian, sesungguhnya al-Quran itu adalah Firman Allah, yang dibaca oleh seorang utusan yang punya kedudukan dan keutamaan agung, ia bukan perkataan penyair seperti yang kalian tuduhkan, tetapi sedikit dari kalian yang punya pemikiran dan perenungan untuk membedakan di antara keduanya, akan tetapi ia adalah Firman Tuhan alam semesta yang Dia turunkan kepada RasulNya, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya Al-Qur`ān adalah kalam Allah, yang dibacakan oleh Rasul-Nya yang mulia kepada manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِنَّهُۥ لَقَوْلُ رَسُولٍ كَرِيمٍ (Sesungguhnya Al Quran itu adalah benar-benar wahyu (Allah yang diturunkan kepada) Rasul yang mulia) Yakni al-Qur’an adalah bacaan Rasul yang mulia, yaitu Muhammad. Atau itu adalah firman yang disampaikan oleh utusan yang mulia yaitu Jibril."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya Al-Quran ini adalah wahyu yang mulia bagi Rasulallah (yang berasal) dari Allah. Al-Qur’an disampaikan oleh Tuhannya melalui Jibril AS atau langsung kepada dirinya. Terkait asbabun nuzul ayat 38-40 ini, Maqatil berkata: “Sesungguhnya Walid bin Mughirah berkata: “Sesungguhnya Muhammad adalah penyihir”, kemudian Abu Jahal menyahut:”Penyair”, lalu Uqbah ikut menyahut: “Dukun”, Kemudian Allah yang Maha Agung dan Maha Tinggi berfirman:”{Fa laa Uqsimu…} maknanya adalah Aku bersumpah.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya (Al-Qur’an) itu benar-benar wahyu Rasul yang mulia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-43. Allah bersumpah dengan apa saja yang dapat dilihat oleh makhluk dan yang tidak dapat dilihat, hal itu mencakup seluruh makhluk, bahkan juga mencakup DzatNYA Yang Mahasuci. (Allah bersumpah) atas kebenaran al-Quran yang dibawa oleh Rasulullah. Rasulullah menyampaikan al-Quran dari sisi yang dialamatkan para musuhnya yang dinyatakan sebagai penyair atau penyihir. Yang membuat mereka melakukan hal itu adalah karena mereka tidak memiliki iman dan tidak mau berpikir. Sekiranya mereka tidak memiliki iman dan memikirkan apa yang bermanfaat bagi mereka dan apa yang buruk bagi mereka, di antaranya dengan melihat keadaan Nabi Muhammad dan memperhatikan sifat-sifat serta akhlak beliau, niscaya mereka akan melihat perkaranya (jelas) seperti matahari, yang akan menunjukkan kepada mereka bahwasanya beliau adalah benar-benar utusan Allah, dan bahwasanya apa yang beliau bawa “adalah wahyu yang diturunkan dari Rabb semesta alam,” tidak pantas sebagai ucapan manusia. Akan tetapi ia adalah perkataan yang menunjukkan keagungan Dzat Yang Mengucapkannya, kebesaran sifat-sifatNya, kesempurnaan pemeliharaanNya kepada makhluk dan ketinggianNya di atas para hamba. Dan bahwasanya hal ini adalah persangkaan dari mereka dengan apa-apa yang tidak pantas bagi Allah dan bagi hikmah (kebijaksanaanNya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 40: 38-43. Allah bersumpah dengan semua yang dilihat oleh makhluk, seperti : langit, bumi dan selainnya, dan juga bagi makhluk yang tidak melihatnya: Seperti : malaikat, jin dan selain mereka berdua. Bahwa Al Qur’an ini yang dihadapan kalian adalah kalam Allah, Rasul ﷺ bacakan kepada kalian, dan ia adalah Muhammad ﷺ, Jibril mengajarkan kepadanya. Ketahuilah oleh kalian bahwa Rasul bukanlah penyair sebagaimana mereka (kaum musyrikin) mengklaim, bukan juga tukang sajak, sebagaimana sajak-sajak dukun, sebagaimana sebagian mereka (kaum musyikin) mengklaim. Sesungguhnya Al Qur’an adalah kalam Rabbul Alamin yang diturunkan kepada Rasul ﷺ yang terpercaya Muhammad ﷺ. Akan tetapi mereka tidak beriman dengannya, tidak juga saling menasihati dan mengambil hikmah dari ayat-ayatnya dan sedikit dari kalian yang mengagungkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 40",
    "description": "38-40. Semua yang diuraikan pada ayat-ayat di atas belum terlihat oleh manusia, maka kelompok ayat ini menegaskan tentang kebenaran informasi Al-Qur'an dengan bersumpah menyebut wujud yang terlihat maupun yang tidak terlihat. Maka aku bersumpah demi apa yang kamu lihat, dan demi apa yang tidak kamu lihat dari ciptaan-ciptaan-ku. Sesungguhnya ia, Al-Qur'an, itu benar-benar wahyu yang diturunkan kepada rasul yang mulia yaitu nabi Muhammad. 41-43. Dania Al-Qur'an itu bukanlah perkataan seorang penyair yang biasanya menghias kata dan kalimat dengan indah tanpa menghiraukan kandungannya. Sedikit sekali kamu beriman kepadanya. Dan Al-Qur'an itu bukan pula perkataan tukang tenung yang sering merasa mengetahui hal-hal yang gaib. Sedikit sekali kamu berpikir untuk memahami perbedaan antara keduanya dan mengambil pelajaran darinya. Ia, Al-Qur'an, adalah wahyu yang diturunkan dari tuhan seluruh alam. Diturunkan sebagai bentuk kasih sayang-Nya kepada seluruh alam."
  }
]