[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "44-48. Seandainya Muhammad mengklaim sesuatu atas Nama Kami padahal Kami tidak mengucapkannya, niscaya Kami menghukumnya dan mengambilnya dengan kekuatan dan dengan keras, kemudian Kami memutuskan urat jantungnya, maka tidak seorangpun yang sanggup menghalangi Kami untuk menghukumnya. Sesungguhnya al-Quran ini adalah nasihat bagi orang-orang yang bertakwa yang melaksanakan perintah-perintah Allah dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Seandainya Muhammad mengada-adakan sebagian ucapan atas nama Kami yang tidak Kami ucapkan,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44-47. Seandainya Nabi yang mulia ini mengatakan kedustaan atas nama Allah, niscaya Allah akan segera menyiksanya hingga binasa, tidak ada seorangpun yang menghalangi siksaan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَلَوْ تَقَوَّلَ عَلَيْنَا بَعْضَ الْأَقَاوِيلِ (Seandainya dia (Muhammad) mengadakan sebagian perkataan atas (nama) Kami) Yaitu seandainya utusan itu mengada-ada, baik itu terhadap Muhammad atau Jibril sebagaimana telah dijelaskan. Yakni seandainya ia melakukan itu dan mengada-ada sendiri, kemudian mengatakan bahwa perkataan itu adalah firman Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Seandainya Muhammad mengubahnya dengan beberapa ucapan yang bohong atau batil yang berasal dari dirinya kemudian menghubungkannya dengan kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekiranya dia mengada-adakan terhadap Kami} Sekiranya nabi Muhammad mengada-ada terhadap Kami {sebagian perkataan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-47. Sesungguhnya “seandainya dia (muhammad) mengadakan perkataan” atas nama Allah dan mengadakan kebohongan pada “sebagian perkataan” yang dusta, “niscaya benar-benar Kami pegang dia pada tangan kanannya. Kemudian benar-benar Kami potong urat tali jantungnya.” Yaitu urat yang bersambung dengan hati, apabila ia terputus, niscaya manusia akan binasa disebabkannya. Seandainya ditakdirkan bahwa Rasulullah –dan hal ini tidak mungkin- mengadakan perkataan dusta atas nama Allah, niscaya Dia akan menyegerakan azab untuk beliau, dan menghukum beliau sebagaimana hukuman Dzat Yang Mahaperkasa lagi Mampu, karena Dia Mahabijaksana dan Mampu melakukan segala sesuatu. hikmahNya menuntut agar tidak memberi waktu tangguh kepada orang yang berdusta atas namaNya yang mengklaim bahwa Allah membolehkan untuknya darah dan harta dari orang-orang yang menyelisihi mereka, dan (mengklaim) bahwa dia dan pengikutnya mendapatkan keselamatan sedangkan yang menyelisihinya mendapatkan kebinasaan. Maka apabila Allah telah mengukuhkan RasulNya dengan bukti-bukti yang nyata berupa mukjizat-mukjizat dan menolong beliau dalam menghadapi para musuh serta memberikan kemampuan kepada beliau menundukkan mereka, maka itu merupakan kesaksian terbesar dari Allah atas risalahnya. Dan firmanNya, “Maka sekali-kali tidak ada seorang pun dari kalian yang dapat menghalangi (Kami), dari pemotongan urat nadi itu.” Maksudnya, kalau Allah hendak membinasakan beliau, niscaya dia sendiri tidak akan mampu mencegahnya dari azab Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 44: 44-48. Ketahuilah wahai orang-orang musyrik, kalo saja Muhammad ﷺ mengada-ngada (memalsukan) sebagian perkataan-perkataan (Allah), sungguh Allah akan membalasanya dengan balasan yang pedih. Dan Allah juga akan menariknya dengan kuat dan sangat. Kemudian akan Allah potong urat jantungnya dan mematikannya. Dan kalian tak akan mungkin dapat mencegah adzab Allah dan melindunginya. Kemudian Allah mengabarkan bahwa Al Qur’an ini cahaya, petunjuk dan peringatan bagi orang-orang yang bertakwa yang ia mengerjakan apa yang Allah perintahkan dan menjauhi larangan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kalau memang Beliau mengada-ada atas nama Allah, tentu Allah Subhaanahu wa Ta'aala akan segera menghukumnya karena Dia Mahabijaksana lagi Mahakuasa atas segala sesuatu. Kebijaksanaan-Nya menghendaki untuk tidak menunda hukuman terhadap orang yang berdusta atas nama-Nya. Tetapi kenyataannya, Allah Subhaanahu wa Ta'aala membela Beliau dan memenangkan Beliau terhadap musuhnya, maka yang demikian merupakan dalil terbesar yang menunjukkan kerasulannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 44",
    "description": "44-47. Setelah ditegaskan bahwa Al-Qur'an adalah bersumber dari Allah, ayat-ayat ini memperkuat penegasan tersebut dengan menyatakan bahwa tidak ada campur tangan sedikit pun dari nabi Muhammad dalam menyusun isi kandungan Al-Qur'an. Dan sekiranya dia, nabi Muhammad, mengada-adakan sebagian perkataan apalagi semua atas nama kami, pasti kami siksa dia dengan sangat keras atau pastilah kami pegang dia pada tangan kanannya. Kemudian vang lebih mengerikan lagi adalah pasti kami potong pembuluh jantungnya sehingga dia tidak akan hidup sekejap pun. Sekiranya itu kami lakukan maka tidak seorang pun dari kamu yang dapat menghalangi kami untuk menghukumnya"
  }
]