[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "44-48. Seandainya Muhammad mengklaim sesuatu atas Nama Kami padahal Kami tidak mengucapkannya, niscaya Kami menghukumnya dan mengambilnya dengan kekuatan dan dengan keras, kemudian Kami memutuskan urat jantungnya, maka tidak seorangpun yang sanggup menghalangi Kami untuk menghukumnya. Sesungguhnya al-Quran ini adalah nasihat bagi orang-orang yang bertakwa yang melaksanakan perintah-perintah Allah dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan tidak ada dari kalian yang mampu menghalangi Kami darinya, maka jauh kemungkinannya bahwa ia mengada-adakan ucapan atas nama Kami demi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. فَمَا مِنكُم مِّنْ أَحَدٍ عَنْهُ حٰجِزِينَ (Maka sekali-kali tidak ada seorangpun dari kamu yang dapat menghalangi (Kami), dari pemotongan urat nadi itu) Yakni tidak ada seorangpun yang menghalangi Kami darinya atau dapat menyelamatkannya dari Kami, lalu untuk apa ia berusaha membuat kedustaan terhadap Allah demi kalian?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Dan tidak ada satupun dari kalian yang berusaha mencegah atau menghalang-halangi kami untuk menghukumnya atau berusaha menyelamatkannya dari kami. Lalu bagaimana bisa dia berdusta kepada Allah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka tidak ada seorang pun dari kalian yang dapat menghalangi darinya} tidak ada satupun dari kalian yang dapat mencegah hukuman Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44-47. Sesungguhnya “seandainya dia (muhammad) mengadakan perkataan” atas nama Allah dan mengadakan kebohongan pada “sebagian perkataan” yang dusta, “niscaya benar-benar Kami pegang dia pada tangan kanannya. Kemudian benar-benar Kami potong urat tali jantungnya.” Yaitu urat yang bersambung dengan hati, apabila ia terputus, niscaya manusia akan binasa disebabkannya. Seandainya ditakdirkan bahwa Rasulullah –dan hal ini tidak mungkin- mengadakan perkataan dusta atas nama Allah, niscaya Dia akan menyegerakan azab untuk beliau, dan menghukum beliau sebagaimana hukuman Dzat Yang Mahaperkasa lagi Mampu, karena Dia Mahabijaksana dan Mampu melakukan segala sesuatu. hikmahNya menuntut agar tidak memberi waktu tangguh kepada orang yang berdusta atas namaNya yang mengklaim bahwa Allah membolehkan untuknya darah dan harta dari orang-orang yang menyelisihi mereka, dan (mengklaim) bahwa dia dan pengikutnya mendapatkan keselamatan sedangkan yang menyelisihinya mendapatkan kebinasaan. Maka apabila Allah telah mengukuhkan RasulNya dengan bukti-bukti yang nyata berupa mukjizat-mukjizat dan menolong beliau dalam menghadapi para musuh serta memberikan kemampuan kepada beliau menundukkan mereka, maka itu merupakan kesaksian terbesar dari Allah atas risalahnya. Dan firmanNya, “Maka sekali-kali tidak ada seorang pun dari kalian yang dapat menghalangi (Kami), dari pemotongan urat nadi itu.” Maksudnya, kalau Allah hendak membinasakan beliau, niscaya dia sendiri tidak akan mampu mencegahnya dari azab Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 47: 44-48. Ketahuilah wahai orang-orang musyrik, kalo saja Muhammad ﷺ mengada-ngada (memalsukan) sebagian perkataan-perkataan (Allah), sungguh Allah akan membalasanya dengan balasan yang pedih. Dan Allah juga akan menariknya dengan kuat dan sangat. Kemudian akan Allah potong urat jantungnya dan mematikannya. Dan kalian tak akan mungkin dapat mencegah adzab Allah dan melindunginya. Kemudian Allah mengabarkan bahwa Al Qur’an ini cahaya, petunjuk dan peringatan bagi orang-orang yang bertakwa yang ia mengerjakan apa yang Allah perintahkan dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 47",
    "description": "44-47. Setelah ditegaskan bahwa Al-Qur'an adalah bersumber dari Allah, ayat-ayat ini memperkuat penegasan tersebut dengan menyatakan bahwa tidak ada campur tangan sedikit pun dari nabi Muhammad dalam menyusun isi kandungan Al-Qur'an. Dan sekiranya dia, nabi Muhammad, mengada-adakan sebagian perkataan apalagi semua atas nama kami, pasti kami siksa dia dengan sangat keras atau pastilah kami pegang dia pada tangan kanannya. Kemudian vang lebih mengerikan lagi adalah pasti kami potong pembuluh jantungnya sehingga dia tidak akan hidup sekejap pun. Sekiranya itu kami lakukan maka tidak seorang pun dari kamu yang dapat menghalangi kami untuk menghukumnya. 48-49. Setelah dijelaskan bahwa Al-Qur'an bersumber dari Allah, kini diuraikan fungsi dari Al-Qur'an dan respons manusia atas kehadirannya. Dan sungguh, Al-Qur'an itu adalah pelajaran yang amat berharga bagi orang-orang yang bertakwa. Dan sungguh, kami mengetahui bahwa di antara kamu wahai manusia ada orang yang mendustakan disamping ada pula yang menerimanya dengan segala ketulusan hatinya."
  }
]