[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "44-48. Seandainya Muhammad mengklaim sesuatu atas Nama Kami padahal Kami tidak mengucapkannya, niscaya Kami menghukumnya dan mengambilnya dengan kekuatan dan dengan keras, kemudian Kami memutuskan urat jantungnya, maka tidak seorangpun yang sanggup menghalangi Kami untuk menghukumnya. Sesungguhnya al-Quran ini adalah nasihat bagi orang-orang yang bertakwa yang melaksanakan perintah-perintah Allah dan menjauhi larangan-laranganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan sesungguhnya Al-Qur`ān itu adalah nasihat bagi orang-orang yang bertakwa kepada Rabbnya dengan menjalankan segala perintah-Nya dan menjauhi segala parangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-52. Ayat-ayat ini menjelaskan tentang al-Qur’an, ia merupakan peringatan, pelajaran, dan nasehat bagi orang-orang bertakwa yang mendapat manfaat darinya dan menjalankan perintah yang ada di dalamnya. Allah mengetahui bahwa sebagian manusia mendustakan al-Qur’an; dan al-Qur’an akan menjadi sebab penyesalan dan kerugian orang-orang yang mengingkarinya, ketika mereka melihat pahala yang didapatkan orang-orang beriman, dan siksaan dan azab yang disiapkan bagi orang-orang kafir itu. Al-Qur’an merupakan kitab yang benar dan jelas, yang tidak mengandung keraguan sedikitpun. Maka bertasbihlah kepada Tuhanmu, dan sebutlah nama-Nya yang agung, memuji-Nya atas kenikmatan diturunkannya al-Qur’an dan kenikmatan lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَإِنَّهُۥ لَتَذْكِرَةٌ لِّلْمُتَّقِينَ (Dan sesungguhnya Al Quran itu benar-benar suatu pelajaran bagi orang-orang yang bertakwa) Yakni al-Qur’an adalah pelajaran bagi orang-orang yang bertakwa, sebab mereka dapat mengambil manfaat darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Sesungguhnya Al-Quran adalah nasehat bagi orang-orang yang melaksanakan perintah-perintah Allah, takut dengan hukumanNya dan menjauhi kemaksiatan. Mereka adalah orang-orang yang bertakwa, karena mereka menggunakan (Al-Quran) sebagai pengingat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya (Al-Qur’an) itu} Al-Qur'an itu {benar-benar suatu pelajaran bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Dan sesungguhnya ia” yakni al-Quran al-Karim, “benar-benar suatu pelajaran bagi orang-orang yang bertakwa.” Mereka mengambil pelajaran melalui al-Quran tentang kemaslahatan agama dan dunia mereka, sehingga mereka mengetahui dan mengamalkannya. Al-Quran mengingatkan mereka berkaitan dengan akidah-akidah Agama, dan akhlak-akhlak yang diridhai, serta hukum-hukum syar’I, sehingga mereka menjadi ulama rabbani, hamba yang arif, dan imam yang dapat mendapat petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 48: 44-48. Ketahuilah wahai orang-orang musyrik, kalo saja Muhammad ﷺ mengada-ngada (memalsukan) sebagian perkataan-perkataan (Allah), sungguh Allah akan membalasanya dengan balasan yang pedih. Dan Allah juga akan menariknya dengan kuat dan sangat. Kemudian akan Allah potong urat jantungnya dan mematikannya. Dan kalian tak akan mungkin dapat mencegah adzab Allah dan melindunginya. Kemudian Allah mengabarkan bahwa Al Qur’an ini cahaya, petunjuk dan peringatan bagi orang-orang yang bertakwa yang ia mengerjakan apa yang Allah perintahkan dan menjauhi larangan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan Al Qur’an mereka dapat mengingat hal yang bermaslahat bagi mereka baik dalam hal agama maupun dunia, mereka dapat mengetahuinya dan dapat mengamalkannya. Al Qur’an juga mengingatkan mereka ‘aqidah yang benar, akhlak yang diridhai dan hukum-hukum syar’i sehingga mereka menjadi orang-orang yang mendapat petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 48",
    "description": "48-49. Setelah dijelaskan bahwa Al-Qur'an bersumber dari Allah, kini diuraikan fungsi dari Al-Qur'an dan respons manusia atas kehadirannya. Dan sungguh, Al-Qur'an itu adalah pelajaran yang amat berharga bagi orang-orang yang bertakwa. Dan sungguh, kami mengetahui bahwa di antara kamu wahai manusia ada orang yang mendustakan disamping ada pula yang menerimanya dengan segala ketulusan hatinya"
  }
]