[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Kaum Tsamud dibinasakan dengan suara teriakan menggelegar yang kerasnya melewati batas. Kaum Ad dibinasakan dengah angin dingin yang kencang. Allah mengirimkannya kepada mereka selama 7 malam dan 8 hari terus-menerus, tidak berhenti tidak terputus. Kamu melihat mereka di hari-hari dan malam-malam tersebut mati seolah-olah mereka adalah pangkal pohon kurma yang teronggok yang rapuh bagian dalamnya. Apakah kamu melihat yang tersisa yang selamat dari mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Adapun Ṡamūd, mereka telah dihancurkan oleh Allah dengan petir yang sampai pada puncaknya dalam kedahsyatan dan kekuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Balasan bagi kaum Tsamud -mereka adalah kaum Nabi Shalih- atas pendustaan mereka terhadap akhirat dan keingkaran mereka terhadap Allah dan rasul-Nya adalah kebinasaan dari Allah dengan suara keras yang berulang, sehingga tidak tersisa seorangpun dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. فَأَمَّا ثَمُودُ فَأُهْلِكُوا۟ بِالطَّاغِيَةِ (Adapun kaum Tsamud, maka mereka telah dibinasakan dengan kejadian yang luar biasa) Tsamud adalah kaum Nabi Shalih. Dan makna (الطاغية) adalah suara yang sangat keras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Adapun kaum Tsamud, mereka dihancurkan oleh kiamat (kecil) yang kedahsyatan dan kekuatannya melebihi batas. Kiamat (kecil) itu berupa suara yang amat keras atau badai petir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun kaum Tsamud, mereka telah dibinasakan dengan suara yang sangat keras} suara yang dahsyat melebihi batas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Adapaun kaum Tsamud, maka mereka tidak dibinasakan dengan kejadian yang luar biasa.” Yakni suara keras yang amat mengerikan, yang memutuskan hati dan menghempaskan ruh mereka. Mereka pun menjadi bangkai, dan yang terlihat hanya tempat tinggal serta bangkai mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 5: Allah mengabarkan bahwa Tsamud binasa dengan Thagiyah, yaitu suara yang mengerikan dan mematikan. Tempat kaum Tsamud dahulu di kiri Jazirah Arab, dinamakan juga Al Hajr. Masih tersisa peninggalannya dan tulisan-tulisannya di gunung yang di dalamnya mereka jadikan kuburan bagi mayat-mayat kaum mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu petir yang sangat keras yang menyebabkan suara yang mengguntur yang dapat menghancurkan dan membinasakan, sehingga ruh mereka keluar dari jasad mereka dan jadilah mereka mayat-mayat yang bergelimpangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 5",
    "description": "4-5. Telah banyak generasi di masa lalu yang mengingkari hari kiamat. Kelompok ayat ini mengungkap sekelumit tentang kaum yang mengingkari hari kiamat dan sanksi yang mereka terima. Kaum samud, dan 'ad telah mendustakan hari kiamat. Maka adapun kaum samud, mereka telah dibinasakan dengan suara yang sangat keras yaitu suara guntur yang menggelegar bercampur dengan kilat, 6-8. Sedangkan kaum 'ad, mereka telah dibinasakan dengan angin topan yang sangat dingin dan memiliki daya rusak yang sangat kuat. Allah menimpakan angin itu sebagai bentuk siksa kepada mereka dengan kekuasaan-Nya selama tujuh malam delapan hari terus-menerus tanpa henti untuk membinasakan mereka. Maka kamu melihat kaum 'ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong yaitu telah lapuk bagian dalamnya. Maka adakah kamu wahai siapa pun kamu, melihat seorang pun yang masih tersisa di antara mereka' tidak tersisa satu orang pun. Ltu berarti mereka sama sekali tidak memiliki keturunan yang dapat melanjutkan regenerasi kaum mereka."
  }
]