[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-52. Sesungguhnya Kami mengetahui bahwa di antara kalian ada yang mendustakan al-Quran ini sekalipun ayat-ayatnya jelas, dan sesungguhnya mendustakan al-Quran adalah penyesalan besar atas orang-orang kafir saat mereka melihat azab yang menimpa mereka dan melihat kenikmatan yang didapatkan oleh orang-orang beriman. Sesungguhnya ia adalah kebenaran yang kokoh, yang tidak ada keraguan padanya. Maka sucikanlah Allah dari apa yang tidak layak bagiNya, dan sebutlah Dia dengan NamaNya Yang Agung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan sesungguhnya mendustakan Al-Qur`ān benar-benar merupakan penyesalan yang besar pada hari Kiamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَإِنَّهُۥ لَحَسْرَةٌ عَلَى الْكٰفِرِينَ (Dan sesungguhnya Al Quran itu benar-benar menjadi penyesalan bagi orang-orang kafir) Yakni al-Qur’an adalah penyesalan bagi orang-orang kafir di hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Sesungguhnya Al-Quran ini akan menyebabkan mereka merasa merugi dan menyesal pada hari kiamat ketika melihat pahala orang-orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya itu benar-benar menjadi penyesalan} penyesalan yang besar {bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “Dan sesunggguhnya al-Quran itu benar-benar menjadi penyesalan bagi orang-orang kafir (di akhirat).” Sesungguhnya mereka, ketika mengingkari al-Quran dan melihat azab yang Dia ancamkan kepada mereka, maka mereka menyesal karena tidak mengambilnya sebagai petunjuk dan tidak tunduk kepada perintahNya, sehingga mereka melewatkan pahala itu dan mendapatkan azab yang paling keras, sedangkan segala sebab (pertolongan) telah terputus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 50: 49-51. Allah mengabarkan bahwasanya Dia Maha Mengetahui dari manusia siapa yang mendustakan Al Qur’an ini yang jelas ayat-ayatnya. Kemudian Allah mengabarkan bahwa Al Qur’an ini didustkan oleh kafir dan ia akan dibangkitkan dan menyesal atas mereka (di hari kiamat). Allah juga mengabrkan bahwa hari kiamat adalah benar adanya dimana, apa saja yang Allah katakan pasti benar dan tidaklah Allah berkata kecuali kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka melihat pahala orang-orang yang membenarkan Al Qur’an dan hukuman orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 50",
    "description": "50-52. Dan sungguh, Al-Qur'an itu akan benar-benar menimbulkan penyesalan bagi orang-orang kafir khususnya di akhirat nanti setelah mereka melihat pahala yang diperoleh bagi yang beriman dan mengetahui siksa yang mereka alami. Dan sungguh, Al-Qur'an itu adalah kebenaran yang meyakinkan tanpa ada sedikit pun keraguan. Maka bertasbihlah dengan menyebut nama tuhanmu yang mahaagung serta sucikanlah dia dari segala hal yang tidak layak bagi-Nya"
  }
]