[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-52. Sesungguhnya Kami mengetahui bahwa di antara kalian ada yang mendustakan al-Quran ini sekalipun ayat-ayatnya jelas, dan sesungguhnya mendustakan al-Quran adalah penyesalan besar atas orang-orang kafir saat mereka melihat azab yang menimpa mereka dan melihat kenikmatan yang didapatkan oleh orang-orang beriman. Sesungguhnya ia adalah kebenaran yang kokoh, yang tidak ada keraguan padanya. Maka sucikanlah Allah dari apa yang tidak layak bagiNya, dan sebutlah Dia dengan NamaNya Yang Agung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan sesungguhnya Al-Qur`ān adalah kebenaran yang diyakini, yang tidak ada keraguan di dalamnya bahwa ia berasal dari sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَإِنَّهُۥ لَحَسْرَةٌ عَلَى الْكٰفِرِينَ (Dan sesungguhnya Al Quran itu benar-benar menjadi penyesalan bagi orang-orang kafir) Yakni al-Qur’an adalah penyesalan bagi orang-orang kafir di hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Sesungguhnya Al-Qur’an ini adalah sesuatu yang diyakini, yang kebenarannya sudah pasti dan tidak ada keraguan di dalamnya. Al-Quran adalah sesuatu yang menyadarkan perasaan atau emosi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya (Al-Qur’an) itu kebenaran yang meyakinkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Dan sesungguhnya al-Quran itu benar-benar kebenaran yang diyakini.” Maksudnya,al-Quran merupakan urutan ilmu yang paling tinggi, karena urutan ilmu yang paling tinggi adalah al-Yaqin, yaitu ilmu yang tetap yang tidak goyah dan tidak pula sirna. Al-Yaqin itu memiliki tiga derajat. Masing-masing lebih tinggi daripada yang sebelumnya: Yang pertama, ilmul Yaqin, yaitu ilmu yang diambil dari kabar. Kemudian yang kedua, ainul Yaqin, yaitu ilmu yang dijangkau dari penginderaan mata. Kemudian ketiga, haqqul Yaqin, yaitu ilmu yang didapatkan dari rasa dan interaksi langsung. Al-Quran ini termasuk ke dalam kriteria yang ketiga ini. Sesungguhnya segala sesuatu yang di dalamnya termasuk ilmu-ilmu yang dikuatkan dengan bukti yang pasti (qath’i) dan segala fakta di dalamnya serta pengetahuan yang bersifat imaniyah, bisa didapatkan oleh orang yang telah meraih haqqul Yaqin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 51: 49-51. Allah mengabarkan bahwasanya Dia Maha Mengetahui dari manusia siapa yang mendustakan Al Qur’an ini yang jelas ayat-ayatnya. Kemudian Allah mengabarkan bahwa Al Qur’an ini didustkan oleh kafir dan ia akan dibangkitkan dan menyesal atas mereka (di hari kiamat). Allah juga mengabrkan bahwa hari kiamat adalah benar adanya dimana, apa saja yang Allah katakan pasti benar dan tidaklah Allah berkata kecuali kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kebenarannya berada pada posisi paling tinggi, yaitu sampai meyakinkan yang merupakan ilmu yang tetap, tidak goyang dan tidak ragu-ragu lagi. Yakin ada tiga tingkatan: (1) ‘Ilmul yaqiin, yaitu ilmu yang diambil dari berita, (2) ‘Ainul yaqiin, yaitu ilmu yang diperoleh dari melihat langsung, (3) Haqqul yaqiin, yaitu ilmu yang diperoleh dari merasakan langsung. Nah, Al Qur’an ini menempati posisi paling tinggi, yaitu haqqul yaqiin karena di dalamnya terdapat ilmu yang diperkuat dengan bukti-bukti yang pasti, hakikat dan ma’rifat keimanan sehingga dengannya seseorang merasakan kebenarannya secara haqqul yaqiin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 51",
    "description": "50-52. Dan sungguh, Al-Qur'an itu akan benar-benar menimbulkan penyesalan bagi orang-orang kafir khususnya di akhirat nanti setelah mereka melihat pahala yang diperoleh bagi yang beriman dan mengetahui siksa yang mereka alami. Dan sungguh, Al-Qur'an itu adalah kebenaran yang meyakinkan tanpa ada sedikit pun keraguan. Maka bertasbihlah dengan menyebut nama tuhanmu yang mahaagung serta sucikanlah dia dari segala hal yang tidak layak bagi-Nya"
  }
]