[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Kaum Tsamud dibinasakan dengan suara teriakan menggelegar yang kerasnya melewati batas. Kaum Ad dibinasakan dengah angin dingin yang kencang. Allah mengirimkannya kepada mereka selama 7 malam dan 8 hari terus-menerus, tidak berhenti tidak terputus. Kamu melihat mereka di hari-hari dan malam-malam tersebut mati seolah-olah mereka adalah pangkal pohon kurma yang teronggok yang rapuh bagian dalamnya. Apakah kamu melihat yang tersisa yang selamat dari mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Adapun 'Ād, mereka telah dibinasakan oleh Allah dengan angin yang sangat dingin dan keras, yang sampai pada puncak kekerasannya atas mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Sedangkan balasan bagi kaum ‘Ad - mereka adalah kaum Nabi Hud- atas pendustaan mereka adalah kebinasaan dari Allah dengan angin kencang yang menghancurkan dan sangat dingin, sehingga tidak ada sesuatupun yang dilewatinya melainkan akan tumbang, tidak ada apapun yang dapat menghalanginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَأَمَّا عَادٌ فَأُهْلِكُوا۟ بِرِيحٍ صَرْصَرٍ (Adapun kaum ‘Aad maka mereka telah dibinasakan dengan angin yang sangat dingin) ‘Aad adalah kaum Nabi Huud. Dan makna (الريح الصرصار) yakni angin yang sangat dingin. Sedangkan (العاتية) yakni angin yang sangat membinasakan karena hembusannya yang sangat kencang, waktunya yang lama, dan hawanya yang dingin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sedangkan kaum ‘Aad, mereka dihancurkan dengan angin yang memiliki suara sangat keras, dingin dan sangat kencang. Angin yang sangat kuat dalam melakukan penghancuran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sedangkan kaum ‘Ad telah dibinasakan dengan angin yang sangat dingin} dingin {yang sangat kencang} berhembus sangat kencang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Adapun kaum ‘Ad, maka mereka telah dibinasakan dengan angin yang sangat dingin,” yaitu angin yang bertiup sangat kencang yang mengeluarkan gemuruh keras melebihi suara halilintar, “lagi amat kencang,” yang melebihi batas menurut mayoritas ahli tafsir. Atau menerjang kaum ‘Ad dan melebihi batasnya sebagaimana menurut pendapat yang benar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 6: 6-8. Allah mengabarkan bahwa Ad binasa dengan sebab angin yang dahsyat, badai besar dan dingin. Angin ini Allah timpakan kepada mereka selama delapan hari, tujuh malam berturut-turut; Maka binasalah mereka semua, hingga engkau akan melihat kaum yang mati, yang mereka sebagaimana pohon kurma yang dicabut akarnya dari perut bumi. Apakah engkau melihat mereka ada yang tersisa seorangpun setelah adzab menimpanya ? Lokasi kaum Ad di Rub Al Khali, yaitu antara Najran dan laut arab. Mereka adalah kaum yang kuat dan menampakkan kesombongan sebagaimana Amerika saat ini. Maka Allah membinasakan mereka dengan udara ini yang membawa oksigen untuk kehidupan jasad : وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ artinya : Dan tidak ada yang mengetahui tentara Tuhanmu melainkan Dia sendiri, {Al Muddattsir : 31}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni angin yang sangat kencang hembusannya sampai memiliki suara melebihi suara guruh. Yakni yang keras sampai melampaui batas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 6",
    "description": "6-8. Sedangkan kaum 'ad, mereka telah dibinasakan dengan angin topan yang sangat dingin dan memiliki daya rusak yang sangat kuat. Allah menimpakan angin itu sebagai bentuk siksa kepada mereka dengan kekuasaan-Nya selama tujuh malam delapan hari terus-menerus tanpa henti untuk membinasakan mereka. Maka kamu melihat kaum 'ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong yaitu telah lapuk bagian dalamnya. Maka adakah kamu wahai siapa pun kamu, melihat seorang pun yang masih tersisa di antara mereka' tidak tersisa satu orang pun. Ltu berarti mereka sama sekali tidak memiliki keturunan yang dapat melanjutkan regenerasi kaum mereka"
  }
]