[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-8. Kaum Tsamud dibinasakan dengan suara teriakan menggelegar yang kerasnya melewati batas. Kaum Ad dibinasakan dengah angin dingin yang kencang. Allah mengirimkannya kepada mereka selama 7 malam dan 8 hari terus-menerus, tidak berhenti tidak terputus. Kamu melihat mereka di hari-hari dan malam-malam tersebut mati seolah-olah mereka adalah pangkal pohon kurma yang teronggok yang rapuh bagian dalamnya. Apakah kamu melihat yang tersisa yang selamat dari mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Allah mengirimkannya kepada mereka selama tujuh malam delapan hari yang menghancurkan mereka semua. Maka kamu lihat kaum itu di rumah-rumah mereka mati bergelimpangan di atas tanah, seakan-akan mereka setelah dibinasakan seperti pangkal pohon kurma keropos yang tumbang di atas tanah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Angin kencang yang menghancurkan ini tetap berhembus menerjang kaum ‘Ad selama lima hari tujuh malam tanpa henti; sehingga hanya menyisakan kaum ‘Ad yang mati bergeletakan di tanah seperti batang pohon kurma kosong yang tercabut dari akarnya. Angin ini telah membinasaan mereka semua, sehingga tidak ada yang dapat selamat; tidak ada seorangpun yang dapat melihat salah satu dari mereka selamat, sungguh mereka telah binasa seluruhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. سَخَّرَهَا عَلَيْهِمْ سَبْعَ لَيَالٍ وَثَمٰنِيَةَ أَيَّامٍ (yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari) Yakni Allah mengirim angin ini kepada mereka selama tenggang waktu itu tanpa henti. dan angin ini membinasakan mereka karena berhembus dengan membawa batu-batu kecil yang menimpa mereka. حُسُومًا(terus menerus) Yakni yang menghancurkan dan menyirnakan mereka. فَتَرَى الْقَوْمَ فِيهَا(maka kamu lihat kaum ‘Aad pada waktu itu) Yakni pada rumah-rumah mereka. صَرْعَىٰ( mati bergelimpangan) Yakni mati tergeletak di atas tanah. كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ (seakan-akan mereka tunggul pohon kurma yang telah kosong (lapuk)) Yakni batang pohon kurma yang roboh dan lapuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7-8. Dengan kuasaNya, Allah memerintahkan bencana itu kepada mereka selama 7 malam dan 8 hari secara berturut-turut. Bencana itu menghapus mereka (melenyapkan mereka). Maka lihatlah kaum yang dihancurkan sampai mati dengan cara dilempar-lemparkan. Mereka seperti biji kurma kosong yang berjatuhan. Apakah kamu menemukan di antara mereka seseorang yang masih hidup?!. Sungguh mereka semua mati."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menimpakan angin itu kepada mereka} menimpakannya kepada mereka {selama tujuh malam delapan hari terus-menerus} terus-menerus {Maka kamu melihat kaum itu pada waktu itu mati bergelimpangan} binasa {seperti batang-batang pohon kurma} batang pohon kurma {yang telah kosong} jatuh dan tumbang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. “Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus,” yakni malapetaka dan bencana mengerikan yang menimpa mereka sehingga memporak-porandakan dan membinasakan mereka. “Maka kamu melihat kaum ‘Ad pada waktu itu mati bergelimpangan,” maksudnya, dalam keadaan mati binasa, “seakan-akan mereka tanggul-tanggul pohon kurma yang telah kosong (lapuk),” maksudnya, mereka seperti batang pohon kurma yang ujungnya telah terpotong (mati) karena lapuk, sehingga berjatuhan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 7: 6-8. Allah mengabarkan bahwa Ad binasa dengan sebab angin yang dahsyat, badai besar dan dingin. Angin ini Allah timpakan kepada mereka selama delapan hari, tujuh malam berturut-turut; Maka binasalah mereka semua, hingga engkau akan melihat kaum yang mati, yang mereka sebagaimana pohon kurma yang dicabut akarnya dari perut bumi. Apakah engkau melihat mereka ada yang tersisa seorangpun setelah adzab menimpanya ? Lokasi kaum Ad di Rub Al Khali, yaitu antara Najran dan laut arab. Mereka adalah kaum yang kuat dan menampakkan kesombongan sebagaimana Amerika saat ini. Maka Allah membinasakan mereka dengan udara ini yang membawa oksigen untuk kehidupan jasad : وَمَا يَعْلَمُ جُنُودَ رَبِّكَ إِلَّا هُوَ artinya : Dan tidak ada yang mengetahui tentara Tuhanmu melainkan Dia sendiri, {Al Muddattsir : 31}."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga menghancurkan dan membinasakan mereka. Yakni seperti batang-batang pohon kurma yang telah terpotong pangkalnya dan jatuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 7",
    "description": "6-8. Sedangkan kaum 'ad, mereka telah dibinasakan dengan angin topan yang sangat dingin dan memiliki daya rusak yang sangat kuat. Allah menimpakan angin itu sebagai bentuk siksa kepada mereka dengan kekuasaan-Nya selama tujuh malam delapan hari terus-menerus tanpa henti untuk membinasakan mereka. Maka kamu melihat kaum 'ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong yaitu telah lapuk bagian dalamnya. Maka adakah kamu wahai siapa pun kamu, melihat seorang pun yang masih tersisa di antara mereka' tidak tersisa satu orang pun. Ltu berarti mereka sama sekali tidak memiliki keturunan yang dapat melanjutkan regenerasi kaum mereka"
  }
]