[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "9-10. Lalu datanglah Thaghut Fir’aun, umat-umat sebelumnya yang kafir kepada para rasul mereka, dan penduduk negeri-negeri kaum Luth yang negeri mereka dijungkirbalikkan disebabkan oleh perbuatan mungkar mereka, yaitu kekafiran, kesyirikan dan homoseksual. Setiap umat tersebut mendurhakai rasul mereka yang diutus kepada mereka, maka Allah mengazab mereka dengan azab yang sangat berat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Fir'aun, umat-umat sebelumnya dan negeri yang telah dibolak-balik, yaitu kaum Lūṭ, telah melakukan perbuatan-perbuatan salah berupa kesyirikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9-10. Dan Allah juga membinasakan Fir’aun dan bala tentaranya, serta umat-umat terdahulu yang telah mendustakan Allah dan hari kebangkitan. Dan Allah membinasakan negeri kaum Nabi Luth, mereka semua telah melakukan perbuatan buruk, yaitu kekafiran dan menentang rasul mereka, sehingga mereka layak mendapat kebinasaan di dunia dan azab di akhirat; dan kebinasaan mereka di dunia di akibatkan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَجَآءَ فِرْعَوْنُ وَمَن قَبْلَهُۥ (Dan telah datang Fir’aun dan orang-orang yang sebelumnya) Yakni dari kaum-kaum yang kafir. وَالْمُؤْتَفِكٰتُ(dan (penduduk) negeri-negeri yang dijungkir balikkan) Yakni negeri-negeri kaum Luth. Yakni penduduk negeri-negeri itu. بِالْخَاطِئَةِ (karena kesalahan yang besar) Yakni melakukan perbuatan salah yaitu kemusyrikan dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Telah datang Fir’aun, yaitu Raja Mesir yang sewenang-wenang dan orang-orang terdahulu dari umat-umat yang kafir. Al-Mu’tafikat adalah penduduk di daerah nabi Luth yang melakukan perbuatan yang salah, yaitu syirik, perbuatan yang keji dan perbuatan-perbuatan maksiat lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Begitu juga, Firʻaun dan orang-orang yang sebelumnya serta penduduk negeri yang dijungkirbalikkan} penduduk negeri yang dihuni kaum Luth yang tempat tinggalnya dijungkir balikkan {datang dengan membawa kesalahan} dengan perbuatan munkar berupa kekufuran dan kekejian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9-10. Maksudnya, begitu juga dengan selain kedua umat pembangkang tadi, yaitu ‘Ad dan Tsamud, masih banyak lagi umat yang melampaui batas dan membangkang, seperti raja Mesir (Fir’aun) yang didatangi oleh rasul Allah, Nabi Musa bin Imran. Nabi Musa memberitahukan tanda-tanda kebesaran yang jelas padanya, namun mereka tindak meyakini kebenaran itu, justru membangkang dan kufur secara zhalim dan sombong. Sebelum mereka ada, “(penduduk) negeri yang dijungkirbalikkan,” yaitu negeri kaum Luth, seluruhnya melakukan “kesalahan yang besar,” yakni melakukan perbuatan yang melampaui batas; kekufuran, pendustaan, kezhaliman, pembangkangan yang disertai dengan berbagai kemaksiatan dan kefasikan. “Maka (masing-masing) mereka mendurhakai rasul Rabb mereka,” ini adalah isim jenis (kata benda umum) yang maksudnya, mereka semua mendustakan rasul yang diutus Allah pada mereka, kemudian mereka semua disiksa oleh Allah “dengan siksaan yang sangat keras,” yakni siksaan yang melebihi batas dan ukuran yang membinasakan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Haqqah ayat 9: 9-10. Allah menyebutkan tentang adzab yang ditimpakan kepada orang yang melampaui batas yaitu Fir’aun; Dimana telah datang ia dan yang sebelumnya suatu kaum, begitu juga kaum Luth. Mereka datang dengan perbuatan yang buruk dari kekafiran, syirik dan dosa-dosa kemungkaran. Allah menyendirikan Fir’aun dalam penyebutan karena sebab angkuh dan sombong dank arena ia meminta kaumnya (Bani Israil) untuk menyembahnya. Kemudian Allah menjelaskan bahwa mereka semua, para pendosa yang bermaksiat kepada utusan Allah yang ia diutus kepada mereka. Maka Allah siksa mereka dengan siksa yang keras. Allah tenggelamkan Fir’aun dan tentaranya di laut, dan kaum Luth Allah kirimkan pada mereka adzab; Yaitu Allah jungkir balikkan, sehingga yang atas menjadi di bawah, dan yang bawah menjadi di atas, dan tampaklah perbuatan menjijikkan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengutus kepadanya hamba dan Rasul-Nya Musa ‘alaihis salam, menunjukkan kepadanya bukti-bukti akan kebenarannya, tetapi ia mengingkarinya karena zalim dan keras kepala. Maksudnya, umat-umat dahulu yang mengingkari nabi-nabi seperti kaum Shaleh, kaum Syu'aib dan lain-lain. Maksud negeri-negeri yang dijungkirbalikkan ialah negeri-negeri kaum Luth. Sedangkan kesalahan yang dilakukan mereka ialah mendustakan para rasul ditambah melakukan perbuatan keji dan munkar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Haqqah Ayat 9",
    "description": "Bukan hanya kaum 'Ad dan Hamud yang diazab oleh Allah. Kemudian setelah beberapa waktu lamanya datanglah Fir?aun penguasa Mesir di masa lalu yang kepadanya Nabi Musa diutus, dan orang-orang yang sebelumnya di antaranya adalah kaum Nabi Nuh dan kaum Nabi lbrahim. Dan penduduk negeri-negeri yang dijungkirbalikkan karena kesalahan yang besar yaitu kaum Nabi Lut.10. Maka diakibatkan sikap mereka yang mendurhakai utusan Tuhannya, Allah menyiksa mereka dengan siksaan yang sangat keras sehingga memusnahkan mereka."
  }
]