[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), “aku berlindung dan bernaung kepada Tuhan yang menguasai al falaq,yaitu waktu shubuh.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Katakan wahai Rasul, “Aku berpegang teguh pada Allah Pemilik subuh dan berlindung kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah menyampaikan kepada Rasulullah dan umatnya untuk meminta pertolongan dari-Nya: Aku berlindung kepada Tuhan yang mendatangkan subuh, agar selamat dari segala keburukan; dan Allah-lah Yang menciptakan subuh yang menyingkap malam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. قُلۡ اَعُوۡذُ بِرَبِّ الۡفَلَقِۙ (Katakanlah: “Aku berlindung kepada Tuhan Yang Menguasai subuh) Makna (الفلق) yakni subuh, karena malam telah keluar darinya. Pendapat lain mengatakan: yakni segala yang keluar dari segala yang diciptakan Allah, baik itu hewan, subuh, biji, dan semua tanaman dan lainnya. Dan terdapat pendapat mengatakan: ini merupakan isyarat bahwa Dia berkuasa untuk menghilangkan gelap gulita dari alam semesta, maka Dia juga mampu untuk melindungi orang yang meminta perlindungan kepada-Nya dari segala yang dia takuti."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Dalam beristi'adzah dengan sifat seperti pada ayat adalah bagian dari sikap optimisme seorang hamba, dan tanda peringatan akan cahaya yang nampak setelah kegelapan yang tidak memberikan harapan, kelapangan setelah kesempitan, kesenangan setelah penderitaan, dan al-afalaq yakni segala sesuatu yang tertutup kemudian Allah merenggangkannya, seperti tumbuhan yang tumbuh dari bawah tanah, mata air yang dikeluarkan dari gunung-gunung, hujan yang pecah dari gumpalan awan, bayi yang dilahirkan dari rahim ibunya, dan sebagainya yang bersifat tertutup. 2 ). { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ , مِنْ شَرِّ مَا خَلَقَ } Banyak orang yang ketika membaca ayat ini menghadirkan dalam pikirannya keburukan-keburukan orang selainnya, padahal seharusnya yang pertama ia lakukan adalah memohon perlindungan atas keburukan dirinya, sebagaimmana yang di contohkan oleh Rasulullah ketika khutbah haji dalam hadits shohih ; ( ونعوذ بالله من شرور أنفسنا ) \"dan kami memohon perlindungan dari keburukan-keburukan diri kami\" , dan hadits : ( أعوذ بك من شر نفسي وشر الشيطان وشركه ) ; lihatlah bagaiman keburukan diri sendiri lebih diutamakan sebelum keburukan yang datang dari syaithon. 3 ). Alangkah agungnya bersiti'adzah dengan sifat yang agung ini ( رَبِّ الْفَلَقِ ) , dan apa yang terkandung di dalamnya dari kekuatan, kemenangan dan kekuasaan atas gelapnya kejahatan, sihir dan kedengkian, dan cermatilah bagaimana lafaz \"al-Falaq\" dan apa yang berhadapan dengannya, dari tertutupnya kegelapan malam, dan tertutupnya praktek sihir, dan tertutupnya hati-hati para pendengki. 4 ). { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ , مِنْ شَرِّ مَا خَلَقَ } Pernahkah anda melihat sesuatu yang mampu menghantarkan kepada ketenangan dan keamanan dari kejahatan-kejahatan seperti ini ? sesungguhnya kamu tidak akan bisa memohon perlindungan kepada sesuatu apapun yang mampu memberikan perlindungan yang lebih besar dari dzat yang menciptakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan Mu’awwidzatain: Imam Muslim, Imam Ahmad, Tirmidzi dan An-Nasa’I dari Uqbah bin Amir yang berkata bahwa Rasulallah SAW bersabda: “Apakah kamu mengetahui bahwa ada beberapa ayat yang diturunkan pada malam ini, yang mana belum pernah ada ayat yang menyerupainya. Ayat-ayat itu adalah {Qul A’uudzu bi rabbil falaq} [QS Al-Falaq: 113/1] dan {Qul A’uudzu bi rabbin naas} [QS An-Naas: 114/1]”. Tirmidzi mengatakan dan dibenarkan oleh Al-Baihaqi dari Abu Sa’id Al-Khudzri yang berkata “Rasulallah SAW meminta pertolongan dari intaian jin dan manusia. Dan ketika surah Mu’awwidzatain ini diturunkan, beliau membaca kedua surah ini dan meninggalkan apapun selain itu” 1. Katakanlah wahai Nabi: “Aku berlindung kepada Tuhannya Pagi yang memecah kegelapan malam dengan cahayanya sehingga malam terbelah dan menjadi pagi”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Aku berlindung} aku meminta pertolongan dan perlindungan {kepada Tuhan yang (menjaga) fajar} subuh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Maksudnya, “Katakanlah,” seraya memohon perlindungan, “Aku berlindung,” yakni aku berlindung dan berpegangan, “kepada Rabb yang menguasai Shubuh,” yang membelah butir tanaman dan biji buah-buahan dan yang menyibak Shubuh."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ قُلْ } Katakanlah wahai Muhammad { أَعُوذُ } aku berlindung, dan aku memohon pertolongan { بِرَبِّ الْفَلَقِ } aku memohon perlindungan kepada Tuhan yang menguasai waktu subuh, makna asal dari kata ( الفلق ) adalah : membelah, dan lebih khususnya berati \"الصبح\" waktu subuh\" karena Allah membelah malam menjadi pagi , Allah - عز وجل - berfirman : { فَالِقُ الْإِصْبَاحِ وَجَعَلَ اللَّيْلَ سَكَنًا } ( Dia menyingsingkan pagi dan menjadikan malam untuk beristirahat ) [ Al-An'am : 96 ] , di ayat lain Allah - عز وجل - berfirman : { إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَىٰ } ( Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan ) [ Al-An'am : 95 ] , \"الفلق\" membelah, yakni Allah - عز وجل - membelah bumi ( tanah ) untuk menumbuhkan biji-bijian."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ “Katakanlah: \"Aku berlindung kepada Tuhan Yang Menguasai subuh,” Tuhan yang menguasai al-falaq adalah Allah. Al-Falaq adalah masuknya waktu subuh. Dan bisa pula bermakna lebih umum bahwa falaq adalah segala yang Allah putarkan berupa memasukkan waktu subuh, dan yang menumbuhkan biji-bijian tumbuhan dan buah-buahan, sebagaimana Allah Ta’ala berfirman: إِنَّ اللَّهَ فَالِقُ الْحَبِّ وَالنَّوَى“Sesungguhnya Allah menumbuhkan butir tumbuh-tumbuhan dan biji buah-buahan.”(QS. Al-An’aam: 95) dan firman-Nya: فَالِقُ الْإِصْبَاحِ “Dia menyingsingkan pagi” (QS. Al-An’aam: 96)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Falaq ayat 1: Allah memerintahkan kepada Nabi-Nya agar mengatakan kepada manusia : Sungguh aku berlindung dari Rabb subuh yang membelah kegelapan yang menyelimuti sesuatu, yang kemudian menyebarkan cahaya dan terlihatlah lah sesuatu dengan jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Rabbul falaq bisa juga berarti Tuhan Yang Membelah butir tumbuh-tumbuhan dan biji buah-buahan, demikian pula yang membelah malam dengan terbitnya fajar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Falaq Ayat 1",
    "description": "Wahai nabi Muhammad, katakanlah kepada umatmu, 'aku berlindung kepada tuhan yang menguasai subuh, waktu yang membelah kegelapan malam. Allah mahakuasa menyingkirkan segala kejahatan dari hamba-Nya karena semua makhluk berada dalam genggaman-Nya. 2. Aku berlindung kepada Allah dari kejahatan semua makhluk yang dia ciptakan, baik yang tampak maupun tidak, yang tidak dapat menolak kejahatannya selain sang pencipta."
  }
]