[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dari keburukan seluruh makhluk dan gangguan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dari kejahatan makhluk-makhluk yang mengganggu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. مِنۡ شَرِّ مَا خَلَقَۙ‏ (dari kejahatan makhluk-Nya) Yakni aku berlindung kepada Allah dari segala keburukan yang datang dari setiap makhluk yang diciptakan Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 1 ). Dalam beristi'adzah dengan sifat seperti pada ayat adalah bagian dari sikap optimisme seorang hamba, dan tanda peringatan akan cahaya yang nampak setelah kegelapan yang tidak memberikan harapan, kelapangan setelah kesempitan, kesenangan setelah penderitaan, dan al-afalaq yakni segala sesuatu yang tertutup kemudian Allah merenggangkannya, seperti tumbuhan yang tumbuh dari bawah tanah, mata air yang dikeluarkan dari gunung-gunung, hujan yang pecah dari gumpalan awan, bayi yang dilahirkan dari rahim ibunya, dan sebagainya yang bersifat tertutup. 2 ). { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ , مِنْ شَرِّ مَا خَلَقَ } Banyak orang yang ketika membaca ayat ini menghadirkan dalam pikirannya keburukan-keburukan orang selainnya, padahal seharusnya yang pertama ia lakukan adalah memohon perlindungan atas keburukan dirinya, sebagaimmana yang di contohkan oleh Rasulullah ketika khutbah haji dalam hadits shohih ; ( ونعوذ بالله من شرور أنفسنا ) \"dan kami memohon perlindungan dari keburukan-keburukan diri kami\" , dan hadits : ( أعوذ بك من شر نفسي وشر الشيطان وشركه ) ; lihatlah bagaiman keburukan diri sendiri lebih diutamakan sebelum keburukan yang datang dari syaithon. 3 ). Alangkah agungnya bersiti'adzah dengan sifat yang agung ini ( رَبِّ الْفَلَقِ ) , dan apa yang terkandung di dalamnya dari kekuatan, kemenangan dan kekuasaan atas gelapnya kejahatan, sihir dan kedengkian, dan cermatilah bagaimana lafaz \"al-Falaq\" dan apa yang berhadapan dengannya, dari tertutupnya kegelapan malam, dan tertutupnya praktek sihir, dan tertutupnya hati-hati para pendengki. 4 ). { قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ , مِنْ شَرِّ مَا خَلَقَ } Pernahkah anda melihat sesuatu yang mampu menghantarkan kepada ketenangan dan keamanan dari kejahatan-kejahatan seperti ini ? sesungguhnya kamu tidak akan bisa memohon perlindungan kepada sesuatu apapun yang mampu memberikan perlindungan yang lebih besar dari dzat yang menciptakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Aku berlindung kepada Allah dari keburukan makhluk-makhlukNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dari kejahatan makhluk yang Dia ciptakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Dari kejahatan makhlukNya.” Ini mencakup seluruh makhluk Allah, baik manusia, jin maupun binatang. Maka memohon perlindungan haruslah kepada Penciptanya dari keburukan yang ada padanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ayat ini mencakup seluruh yang Allah ciptakan baik manusia, jin, hewan, benda-benda mati yang dapat menimbulkan bahaya dan dari kejelekan seluruh makhluk, ayat ini juga mencakup meminta perlindungan pada diri sendiri. Ingatlah, nafsu selalu memerintahkan pada kejelekan. Allah Ta’ala berfirman : { إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي } “Karena sesungguhnya nafsu itu selalu menyuruh kepada kejahatan, kecuali nafsu yang diberi rahmat oleh Tuhanku.” (QS. Yusuf [12] : 53). Maka sebaiknya setiap kali seseorang mengucapkan ayat ini, maka yang pertama kali terbetik dalam benaknya adalah dirinya sendiri. Jadi dia berlindung dari kejelekan dirinya sendiri, yang terkadang menimbulkan keburukan tanpa ia sadari."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مِنْ شَرِّ مَا خَلَقَ “dari kejahatan makhluk-Nya,” Maknanya: dari semua keburukan makhluk-makhluk dan di antaranya jiwa, kerena setiap jiwa mengajak kepada keburukan. Maka jika anda mengatakan: مِنْ شَرِّ مَا خَلَقَ “dari kejahatan makhluk-Nya,” Maka yang pertama masuk di dalamnya adalah jiwamu sendiri, sebagaiamana datang dalam khutbah hajah: وَنَعُوْذُ بِاللهِ مِنْ شُرُورِ أَنْفُسِنَا “dan kami berlindung dari keburukan-keburukan jiwa-jiwa kami”(1) dan firman-Nya: مِنْ شَرِّ مَا خَلَقَ “dari kejahatan makhluk-Nya,” Mencakup setan-setan manusia jin dan binatang berbisa dan yang lainnya. (1) Dikeluarkan Abu Dawud (1097), Tirmidziy (1105) Nasai’y (1404) Ibnu Majah (1892) dari hadits Ibnu Mas’ud radhiyallaahu ‘anhu, dan dinyatakan shahih oleh al-ALbaniy dalam al-Misykat (3149)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Falaq ayat 2: Allah (juga) memerintahkannya agar berkata kepada manusia : Sungguh aku berlindung kepada Allah dari keburukan-keburukan semua makhluk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti makhluk hidup yang mukallaf (yang mendapat beban) seperti manusia dan jin, dan makhluk hidup yang tidak mukallaf, demikian pula makhluk tidak hidup seperti racun, dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Falaq Ayat 2",
    "description": "Aku berlindung kepada Allah dari kejahatan semua makhluk yang dia ciptakan, baik yang tampak maupun tidak, yang tidak dapat menolak kejahatannya selain sang pencipta. 3. Dan aku berlindung pula dari kejahatan malam apabila telah gelap gulita pada waktu malam muncul hewan-hewan yang membahayakan dan pada waktu itu pula rencana jahat biasa disusun."
  }
]