[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dari keburukan malam yang sangat gelap apabila ia datang dan menyebar,dan yang ada padanya dari keburukan-keburukan dan gangguan-ganguan"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan aku berpegang teguh kepada Allah dari kejahatan yang muncul pada malam hari, dari hewan melata maupun pencuri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Aku berlindung kepada Allah dari keburukan malam hari ketika telah gelap gulita. Penyebutan (غاسق) dengan lafazh nakirah untuk menunjukkan bahwa itu bersifat umum. Dan firman-Nya (وقب) yakni kegelapannya telah masuk pada segala hal, dan itu merupakan waktu orang-orang jahat melakukan kejahatan yang mereka inginkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَمِنۡ شَرِّ غَاسِقٍ اِذَا وَقَبَۙ‏ (dan dari kejahatan malam apabila telah gelap gulita) Yakni dan aku berlindung kepada-Nya dari keburukan malam jika telah datang. Dikatakan: karena pada malam hari hewan-hewan buas keluar dari liangnya, dan orang-orang jahat mulai keluar untuk berbuat kerusakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ } Yakni : jika malam telah masuk, dan siapapun yang mengamati bagaimana kejahatan itu terjadi, dia akan mendapati kebanyakan kejadiannya pada malam hari, pada waktu itu juga para syaithon-syaithon bertebaran, juga mereka yang berkeinginan jahat pada orang lain, maka patutlah bagi orang-orang beriman mendapati hidupnya dalam kebahagiaan karena malam mereka dihabiskan dengan ibadah, mereka menghindari begadang yang tidak bermanfaat,. 2 ). { وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ } \"Ghosiqin\" yakni malam, dan Allah telah memerintahkan hamba-Nya agar mereka memohon perlindungan kepada-Nya dari kejahatan makhluk-Nya, adapun penyebutan malam pada surah secara khusus; karena kebanyakan terjadinya kemaksiatan dan kejahatan pada malam hari, pencurian banyak terjadi pada malam hari, hama juga keluar pada malam hari, dan ulama mengatakan : pengaruh dari sihir kebanyakan terjadi pada malam hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dan Aku berlindung kepada Allah dari keburukan malam saat aku bertemu makhluk (jahat) dalam kegelapannya. “Al-Ghasiq” adalah malam yang kegelapannya sangat pekat. Dan kata “Waqab” artinya adalah kegelapan malam menjadi semakin pekat. Aku berlindung kepada Allah dari keburukan para tukang sihir yang merusak manusia dengan sihirnya. “An-Nafatsat” adalah bentuk jamak dari kata “An-Nafatsah”. An-Naftsu adalah tiupan ringan. ‘Uqad adalah jamak dari kata “’uqdah” yaitu sesuatu yang dijerat menggunakan tali atau semacamnya, sehingga ikatan itu terurai. Allah memerintahkan Jibril untuk membantu Rasulallah SAW, lalu dia berkata:”Dengan menyebut nama Allah, aku membantumu dari setiap hal yang menyakitimu, yaitu dari pendengki dan pengintai, dan Allah akan menyembuhkanmu”. Maka berkuranglah pengaruh sihir ini terhadap Nabi yang semata-mata terjadi di urusan dunia saja (tidak berhubungan dengan wahyu) ketika beliau dalam keadaan agak sakit. Itu menunjukan gambaran peristiwa itu. Gambaran itu terjadi ketika dalam keadaan bermimpi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dari kejahatan malam} malam {apabila telah gelap gulita} menjadi gelap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Kemudian Allah menyebutkan secara khusus setelah menyebutkan secara umum seraya berfirman, “Dan dari kejahatan malam apabila telah gelap gulita,” yakni dari kejahatan apa pun yang ada di malam hari ketika kegelapan menutupi manusia dan kala banyak ruh-ruh jahat gentayangan, dan binatang-binatang yang menyakitkan bertebaran."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "غَاسِقٍ : Malam apabilah menjadi gelap gulita, dan matahari pun pergi, maka ketika malam telah tiba dengan gelapnya, pada saat itu akan bermunculan begitu banyak keburukan dan kejahatan, sehingga bahaya yang ditimbulkan oleh kejahatan tersebut berdampak buruk pula pada manusia, oleh karena itu kita dianjurkan untuk meminta perlindungan kepada Allah dari segala bahaya kejahatan yang terjadi pada malam yang gelap gulita, baik itu kejahatan yang ditimbulkan oleh perbuatan manusia, ataupun kejahatan yang disebabkan oleh ulah para syaithon, bahkan setiap kita harus meminta perlindungan dari keburukan yang disebabkan oleh diri kita sendiri. ( وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ ) ( Dan dari kejahatan malam apabila telah gelap gulita ) غَاسِقٍ adalah : الظلام yakni gelap , Allah berfirman : { أَقِمِ الصَّلَاةَ لِدُلُوكِ الشَّمْسِ إِلَىٰ غَسَقِ اللَّيْلِ } ( Dirikanlah shalat dari sesudah matahari tergelincir sampai gelap malam ) [ Al-Isra' : 78 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ “dan dari kejahatan malam apabila telah gelap gulita,” Al-Ghasiq dikatakan bahwa kata tersebut bermakna malam hari. Dikatakan jika bermakna rembulan. Yang tepat adalah maknanya mencakup keduanya. Sedangkan yang pertama, karena Allah Ta’ala berfirman: أَقِمِ الصَّلَاةَ لِدُلُوكِ الشَّمْسِ إِلَى غَسَقِ اللَّيْلِ “Dirikanlah salat dari sesudah matahari tergelincir sampai gelap malam”(QS. Al-Isra: 78) Waktu malam di dalamnya banyak keluar binatang bintang berbisa dan binatang-binatang buas, oleh kerenanya memohon perlindungan dari keburukan al-ghasiq yang bermakna malam. Sedangkan rembulan, sebagaimana datang dalam hadits dari Nabi shallallaahu ‘alaihi wa sallam bahwa Nabi shallallaahu ‘alaihi wa sallam memperlihatkan bulan kepada ‘Aisyah, lalu bersabda: هَذَا هُوَ الْغَاسِقُ “Inilah al-ghasiq” Disebut Ghasiq karena kemunculannya pada malah hari. Firman Allah Ta’ala: وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ “dan dari kejahatan malam apabila telah gelap gulita,” adalah ma’thuuf kepada: مِنْ شَرِّ مَا خَلَقَ “dari kejahatan makhluk-Nya,” termasuk pengathafan yang khusus kepada yang umum. Karena al-Ghasiq adalah termasuk makhluk-makhluk Allah ‘Azza Wa Jalla, dan firman-Nya: إِذَا وَقَبَ Maknanya: Apabila telah memasuki waktunya. Maka malam hari jika sudah memasuki waktu dengan kegelapannya adalah ghasiq, dan juga bulan jika telah mengeluarkan cahayanya itu pun adalah ghasiq. Dan ini semua tidak terjadi kecuali saat malam hari telah tiba."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Falaq ayat 3: Allah (juga) memerintahkannya agar berkata kepada manusia : Sungguh aku berlindung kepada Allah dari keburukan malam jika datang kegelapannya yang sangat, yang menutupi bumi. Karena jika malam telah tiba, menyebarlah segala makhluk dan setan, dan memperbanyak keburukan dan kemaksiatan. Oleh sebab itu dikatakan : Malam lebih tersembunyi dibandingkan kebinasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Falaq Ayat 3",
    "description": "Dan aku berlindung pula dari kejahatan malam apabila telah gelap gulita pada waktu malam muncul hewan-hewan yang membahayakan dan pada waktu itu pula rencana jahat biasa disusun. 4. Dan aku berlindung pula dari kejahatan perempuan-perempuan penyihir yang meniup pada buhul-buhul dengan rapalan-rapalan yang dilafalkannya. Mereka bekerja sama dengan setan untuk menimpakan keburukan kepada orang yang di sihir melalui cara cara tertentu, di antaranya dengan meniup buhul-buhul."
  }
]