[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga dari keburukan wanita-wanita penyihir yang meniup dalam simpul-simpul yang mereka jalin dengan tujuan menyihir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan aku berpegang teguh kepada Allah dari kejatahan para penyihir yang meniup pada ikatan-ikatan tali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Aku berlindung kepada Allah dari keburukan para wanita-wanita penyihir yang meniup sesuatu dengan berkomat-kamit. Mereka melakukan itu untuk meletakkan sihir mereka pada sesuatu, mengikatnya dengan tali-tali dan meniupnya. Para penyihir beranggapan bahwa sihir mereka akan tetap bekerja selama tali-tali itu tetap terikat, oleh sebab itu mereka takut tali-tali itu terurai. Kemudian mereka akan mengubur benda itu di tempat yang tidak diketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَمِنۡ شَرِّ النَّفّٰثٰتِ فِى الۡعُقَدِۙ (dan dari kejahatan wanita-wanita tukang sihir yang menghembus pada buhul-buhul) Yakni dan aku berlindung kepada-Nya dari keburukan penyihir-penyihir wanita, sebab mereka meniup ikatan tali ketika akan melakukan sihir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 1 ). Penghubungan antara sifat hasad dan sihir dalam dua ayat yang saling berdampingan ini menunjukkan adanya hubungan diantara keduanya, setidaknya ada pengaruh halus yang terjadi pada diri sang penyihir dengan sihirnya, dan pada pendengki dengan sifat dengkinya, tetapi dari satu sisi keduanya masuk dalam makna \"kerusakan\" atau \"bahaya\" secara umum, keduanya merupakan upaya yang dilakukan oleh pihak tertentu untuk menjatuhkan orang lain dengan cara yang halus, dan kedua adalah perbuatan tercela yang dilarang. 2 ) Pelaku 'ain adalah pelaku hasad ( pendengki ) pada hakikatnya, bahkan dia lebih berbahaya daripada pelaku hasad; oleh karena itu di dalam firman-Nya Allah menyebut pelaku hasad tanpa menyebut pelaku 'ain; karena sesungguhnya hasad lebih umum dan mencakup didalamnya 'ain, maka setiap pelaku 'ain dapat dipastikan bahwa dia adalah pelaku hasad, tetapi tidak semua pelaku hasad adalah pelaku 'ain, maka jika seseorang memohon perlindungan dari bahaya hasad masuk di dalamnya 'ain, dan inilah diantara cakupan al-Qur'an dan keajaibannya. 3 ). Pendengki dan penyihir dihubungkan dalam surah ini; karena keduanya bermaksud pada orang laing suatu keburukan, dan syaithon senantiasa bersama pendengki dan penyihir, dia berbicara kepada keduanya dan selalu menjadi rekan untuk keduanya, tetapi yang membedakan antara keduanya adalah bahwasanya pendengki senantiasa ditolong oleh syaothon tanpa ia harus meminta kepadanya, sedangkan penyihir akan mendapat pertolongan dari syaithon ketika ia meminta kepadanya; maka dari itu -wallahu a'lam- di dalam surah kejahatan pendengki dan kejahatan penyihir saling berdampingan; karena sesungguhnya memohon perlindungan dari kejahatan keduanya mencakup seluruh kejahatan-kejahatan yang datang dari syaithon jin dan syaithon manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3-4. Dan Aku berlindung kepada Allah dari keburukan malam saat aku bertemu makhluk (jahat) dalam kegelapannya. “Al-Ghasiq” adalah malam yang kegelapannya sangat pekat. Dan kata “Waqab” artinya adalah kegelapan malam menjadi semakin pekat. Aku berlindung kepada Allah dari keburukan para tukang sihir yang merusak manusia dengan sihirnya. “An-Nafatsat” adalah bentuk jamak dari kata “An-Nafatsah”. An-Naftsu adalah tiupan ringan. ‘Uqad adalah jamak dari kata “’uqdah” yaitu sesuatu yang dijerat menggunakan tali atau semacamnya, sehingga ikatan itu terurai. Allah memerintahkan Jibril untuk membantu Rasulallah SAW, lalu dia berkata:”Dengan menyebut nama Allah, aku membantumu dari setiap hal yang menyakitimu, yaitu dari pendengki dan pengintai, dan Allah akan menyembuhkanmu”. Maka berkuranglah pengaruh sihir ini terhadap Nabi yang semata-mata terjadi di urusan dunia saja (tidak berhubungan dengan wahyu) ketika beliau dalam keadaan agak sakit. Itu menunjukan gambaran peristiwa itu. Gambaran itu terjadi ketika dalam keadaan bermimpi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dari kejahatan perempuan-perempuan yang meniup pada tali-talinya} penyihir-penyihir perempuan yang meniup benang untuk melemparkan sihir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “Dan dari kejahatan-kejahatan wanita tukang sihir yang menghembus pada buhul-buhul,” yakni dari kejahatan wanita-wanita yang menggunakan bantuan hembusan pada buhul yang diikatkan dengan sihir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "( النَّفَّاثَاتِ ) Yaitu wanita-wanita tukang sihir yang menyihir manusia, mereka melakukan itu dengan mengikat mantra-mantra pada tali kemudian meniupnya dengan bantuan syaithon, hembusan yang jahat, dari sihir itu timbul lah penyakit dan berbagai keburukan yang tertimpa pada manusia, oleh karena itu secara hukum tukang sihir boleh di bunuh dalam keadaan apapun, karena perbuatan mereka menimbulkan banyak keburukan dan kerusakan. umumnya yang menjadi tukang sihir adalah wanita. Namun ayat ini juga dapat mencakup tukang sihir laki-laki dan wanita, sebagaiman yang dilakukan oleh penyihir laki-laki dari kaum Yahudi yang menyihir Nabi ﷺ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ “dan dari kejahatan wanita-wanita tukang sihir yang menghembus pada buhul-buhul,” شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ Mereka adalah wanita-wanita tukang sihir yang membuat simpul dari tali dan yang lainnya, mereka meniupkannya dengan membaca mantra-mantra, yang mengandung nama-nama setan. Di setiap tali diikat lalu ditiup, diikat lalu ditup, diikat lalu ditiup, dan ia dengan jiwa buruknya mengarah kepada seseorang tertentu, sihirnya akan mempengaruhi kepada yang disihir. Allah menyebutkan wanita-wanita penyihir tanpa menyebut laki-laki penyihir, karena mayoritas yang menggunakan sihir jenis ini adalah wanita, oleh karenannya Allah berfirman: النَّفَّاثَاتِ فِي الْعُقَدِ “wanita-wanita tukang sihir yang menghembus pada buhul-buhul,” Dan bisa juga dikatakan: Sesungguhnya maksud dari an-naffatsaat adalah jiwa-jiwa yang meniupkan maka di sini mencakup laki-laki dan perempuan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Falaq ayat 4: Allah (juga) memerintahkannya agar berkata kepada manusia :Aku berlindung kepada Allah dari keburukan wanita-wanita penyihir; Karena yang dominan menjadikan musibah dalam sihir yaitu wanita (pada waktu itu). Adapun sekarang, laki-laki lebih banyak (menjadi penyihir) daripada wanita. Dan berlindung kepada Allah dari tiupan-tiupannya setelah komat-kamit dan lafadz yang diambil dari setan, ditiupkan dengan ludahnya atas apa yang ia yakini dari syair-syair penyihir atau melalui (media) pakaian yang ditujukan kepada objeknya (manusia), dan kalau tidak dengan menggunakan mantra-mantra yang terkenal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Biasanya tukang-tukang sihir dalam melakukan sihirnya membuat buhul-buhul dari tali lalu membacakan jampi-jampi dengan menghembus-hembuskan nafasnya ke buhul tersebut. Ayat ini menunjukkan, bahwa sihir memiliki hakikat yang perlu diwaspadai bahayanya. Untuk mengatasinya adalah dengan meminta perlindungan kepada Allah dari sihir itu dan dari orang-orangnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Falaq Ayat 4",
    "description": "Dan aku berlindung pula dari kejahatan perempuan-perempuan penyihir yang meniup pada buhul-buhul dengan rapalan-rapalan yang dilafalkannya. Mereka bekerja sama dengan setan untuk menimpakan keburukan kepada orang yang di sihir melalui cara cara tertentu, di antaranya dengan meniup buhul-buhul. 5. Dan aku berlindung pula dari kejahatan orang yang dengki apabila dia dengki, yang selalu menginginkan hilangnya kenikmatan dari orang lain. '."
  }
]