[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dari keburukan orang hasad, pembenci manusia apabila ia iri kepada mereka atas sesuatu yang Allah berikan kepada mereka, ia ingin agar nikmat-nikmat itu hilang dari mereka dan ingin menimpakan gangguan kepada mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan aku berpegang teguh kepada Allah dari kejahatan pendengki apabila ia berbuat sesuatu akibat dorongan kedengkiannya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Aku berlindung kepada Allah dari keburukan pendengki jika sedang dengki. Yaitu keinginan lenyapnya kenikmatan dari orang lain karena rasa cemburu; sifat ini kebalikan dari sifat ghibthah, yaitu keinginan untuk mendapatkan suatu kebaikan seperti kebaikan yang didapatkan orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَمِنۡ شَرِّ حَاسِدٍ اِذَا حَسَدَ (dan dari kejahatan pendengki bila ia dengki) Dengki adalah harapan agar kenikmatan yang diberikan Allah kepada seseorang dapat hilang darinya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "4-5 1 ). Penghubungan antara sifat hasad dan sihir dalam dua ayat yang saling berdampingan ini menunjukkan adanya hubungan diantara keduanya, setidaknya ada pengaruh halus yang terjadi pada diri sang penyihir dengan sihirnya, dan pada pendengki dengan sifat dengkinya, tetapi dari satu sisi keduanya masuk dalam makna \"kerusakan\" atau \"bahaya\" secara umum, keduanya merupakan upaya yang dilakukan oleh pihak tertentu untuk menjatuhkan orang lain dengan cara yang halus, dan kedua adalah perbuatan tercela yang dilarang. 2 ) Pelaku 'ain adalah pelaku hasad ( pendengki ) pada hakikatnya, bahkan dia lebih berbahaya daripada pelaku hasad; oleh karena itu di dalam firman-Nya Allah menyebut pelaku hasad tanpa menyebut pelaku 'ain; karena sesungguhnya hasad lebih umum dan mencakup didalamnya 'ain, maka setiap pelaku 'ain dapat dipastikan bahwa dia adalah pelaku hasad, tetapi tidak semua pelaku hasad adalah pelaku 'ain, maka jika seseorang memohon perlindungan dari bahaya hasad masuk di dalamnya 'ain, dan inilah diantara cakupan al-Qur'an dan keajaibannya. 3 ). Pendengki dan penyihir dihubungkan dalam surah ini; karena keduanya bermaksud pada orang laing suatu keburukan, dan syaithon senantiasa bersama pendengki dan penyihir, dia berbicara kepada keduanya dan selalu menjadi rekan untuk keduanya, tetapi yang membedakan antara keduanya adalah bahwasanya pendengki senantiasa ditolong oleh syaothon tanpa ia harus meminta kepadanya, sedangkan penyihir akan mendapat pertolongan dari syaithon ketika ia meminta kepadanya; maka dari itu -wallahu a'lam- di dalam surah kejahatan pendengki dan kejahatan penyihir saling berdampingan; karena sesungguhnya memohon perlindungan dari kejahatan keduanya mencakup seluruh kejahatan-kejahatan yang datang dari syaithon jin dan syaithon manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Aku meminta perlindungan kepada Allah dari buruknya kedengkian, yaitu orang yang berangan-angan agar kenikmatan orang yang dia cemburui hilang. Jika kedengkiannya sudah merasuk (dalam diri) maka dia akan berusaha menghilangkan kenikmatan yang dimiliki orang yang dicemburui. Sihir, intaian, kedengkian dan hal lain yang serupa itu tidak akan bisa membahayakan DzatNya, namun atas kehendak Allah, pengaruh dari hal-hal ini hanya menyentuh bagian luar saja."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan dari kejahatan orang yang dengki apabila dia dengki.”} menampakkan kedengkiannya dan menunaikan sesuatu yang mereka perlukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan dari kejahatan orang yang dengki apabila ia dengki.” Orang dengki adalah orang yang senang atas lenyapnya nikmat dari orang yang ia dengki dengan berusaha sekuat tenaga untuk melenyapkan nikmat tersebut dengan berbagai cara. Sehingga, perlu meminta perlindungan kepada Allah dari kejahatannya dan untuk meruntuhkan tipu dayanya. Penyebar penyakit-penyakit ‘ain juga termasuk orang yang dengki karena tidaklah penyakit ‘ain muncul kecuali dari seorang pendengki, bertabiat buruk, dan berjiwa keji. Surat ini mencakup perlindungan dari segala macam kejahatan secara umum dan khusus dan menunjukkan bahwa sihir itu nyata, bahayanya mengkhawatirkan, dan kita harus meminta perlindungan kepada Allah dari sihir dan pelakunya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "حَاسِدٍ : Hasad ( dengki ) adalah berangan-angan hilangnya nikmat yang ada pada orang lain baik agar pindah kepada diri kita ataupun tidak . Allah menutup surat ini dengan hasad, sebagai peringatan akan bahayanya perkara ini. Hasad adalah memusuhi nikmat Allah. Rasulullah ﷺ bersabda tentang buruknya perkara ini : إِيَّاكُمْ وَالْحَسَدَ فَإِنَّ الْحَسَدَ يَأْكُلُ الْحَسَنَاتِ كَمَا تَأْكُلُ النَّارُ الْحَطَبَ ». أَوْ قَالَ « الْعُشْبَ » “Hati-hatilah kalian dari hasad, karena sesungguhnya hasad itu memakan kebaikan sebagaimana api memakan kayu bakar atau semak belukar (rumput kering)“. (HR. Bukhari Muslim) . Adapun rasa ingin mendapatkan kenikmatan atau keberuntungan yang didapatkan oleh orang lain disebut Ghibthah, tanpa diiringi hawa nafsu yang menginginkan kenikmatan atau keberuntungan itu hilang dari orang yang mendapatkannya. Orang yang Ghibthah juga tidak merasa benci manakala melihat orang lain mendapat nikmat atau keberuntungan. Orang yang berbuat hasad hanyalah mencederai dirinya sendiri, karena hasad atau Kedengkian adalah bukti kurang iman. Dengki itu bukti tidak ridha pada perbuatan Allah terhadap hamba-Nya. Dengki itu sikap ingin mengatur Allah sesuai hawa nafsunya. Tentulah dengki itu sikap yang tak punya adab. Yaitu adab terhadap Allah, Tuhan semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ “dan dari kejahatan orang yang dengki apabila ia dengki” Orang yang dengki adalah orang yang membenci kenikmatan dari Allah yang terdapat pada orang lain, maka anda akan mendapatinya tertekan karena adanya nikmat itu, jika Allah memberi kenikmatan kepada seorang insan berupa harta, jabatan atau ilmu atau yang lainnya, lalu ia dengki. Tetapi orang yang dengki terbagi menjadi dua jenis: pertama adalah yang hasad, dan membenci dengan hatinya kepada nikmat dari Allah kepada orang lain, tetapi ia tidak mengancam orang didengkinya. Anda akan mendapatinya tertekan gundah karena kenikmatan-kenikmatan Allah kepada orang lain. Tetapi ia tidak melakukan tindakan melampaui batas kepada yang mempunyai nikmat itu. Dan keburukan dan musibah itu apabila yang dengki meluapkan kedengkiannya, oleh karenanya Allah berfirman: إِذَا حَسَدَ “Apabila ia dengki” Dan diantara bentuk kedengkian hasad adalah ‘ain yang terkena kepada yang dipandang. Yang mana ia memiliki kebencian terhadap kenikmatan dari Allah kepada orang lain, jika ia merasakan dengan dirinya bahwa Allah telah memberinya kenikmatan kepada seseorang , keluarlah dari dirinya suatu aura yang tidak bisa kita deskripsikan karena ini perkara yang tidak diketahui. Maka ia pun terkena ‘ain. Terkadang orang yang terkena ‘ain bisa mati, terkadang sakit, terkadang kesurupan, bahkan terkadang orang yang hasad, ‘ainnya bisa mempengaruhi besi, sehingga tidak bisa digunakan, atau mempengaruhi mobil sehingga meledak atau mogok, atau mesin pemompa air bisa terkena ain atau mesin pembajak sawah. Pengaruh ‘ain adalah kebenaran yang nyata, yang bisa menimpa dengan izin Allah ‘Azza Wa Jalla. Allah ‘Azza Wa jalla menyebutkan malam hari ketika telah gelap,wanita-wanita penyihir yang meniup simpul dan orang yang dengki ketika ia dengki, dikarenakan semua hal tersebut bahayanya tesembunyi, Malam adalah menutup dan pembungkus وَاللَّيْلِ إِذَا يَغْشَى “Demi malam apabila menutupi (cahaya siang),”(QS. Al-Lail: 1) menyembunyikan keburukan dan tidak diketahui kerenanya النَّفَّاثَاتِ فِي الْعُقَدِ “wanita-wanita tukang sihir yang menghembus pada buhul-buhul,” Sihir pun juga tersembunyi tidak diketahui, orang yang dengki, apabila seorang yang memiliki ‘ain mendengki juga ini tersembunyi. Ain datang dari seseorang yang anda sangka dia adalah yang paling anda cintai, dan anda yang paling ia cintai, walau pun demikian ia menimpakan ain kepadamu. Karena sebab tersebut, Allah mengkhususkan tiga itu: al-Ghasiq (malam) ketika telah gelap, wanita-wanita tukang sihir yang meniup buhul-buhul dan orang yang dengki ketika mendengki, dan semua itu masuk dalam firman-Nya: مِنْ شَرِّ مَا خَلَقَ “dari kejahatan makhluk-Nya,” Apabila ada yang mengatakan: Bagaimana cara agar terhindar dari tiga keburukan tersebut? Kita jawab: Cara agar terbebas dari itu adalah hendaknya seorang insan mengaitkan hatinya kepada Tuhannya, menyerahkan urusannya kepada-Nya, dan merealisasikan ketawakkalan, dan menggunakan wirid-wirid yang disyari’atkan yang dapat melindungi dan menjaga dirinya dari keburukan tiga hal itu, dan tidaklah semakin banyak kasus di tengah manusia pada akhir-akhir ini yang terkena pengaruh penyihi-penyihir dan orang-orang yang hasad atau yang semisalnya melainkan dikarenakan ia lalai dari Allah dan kelemahan tawakkal mereka kepada Allah ‘Azza Wa Jalla. Dan sedikitnya mereka mengucapkan wirid-wirid yang disyari’atkan yang bisa menjadi wasilah perlindungan. Padahal kita tahu bahwa wirid-wirid yang disyari’atkan adalah perisai yang kuat, lebih kokoh dari tembok yang menghalangi Yajuj dan Majuj, tetapi sangat disayangkan banyak dari manusia yang tidak mengetahui wirid-wirid tersebut sedikit pun, dan yang mengetahui pun banyak terlalaikan, yang membaca hatinya tidak hadir, dan semua ini adalah kekurangan. Seandainya orang-orang mengucapkan wirid-wirid tersebut sesuai dengan yang disyari’atkan, maka pasti mereka akan terselamatkan dari keburukan-keburukan yang banyak, kita memohon kepada Allah agar menjauhkan kita dari keburukan dan memberikan keselamatan untuk kita."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Falaq ayat 5: Dan yang terakhir, Allah perintahkan agar mengatakan kepada mereka : Aku berlindung kepada Allah dari keburukan orang yang hasad, yang hasad kepada manusia. Dan berlindung dari hasad atau berlindung dari ‘Ain; Sebab ‘ain adalah benar adanya, sebagaimana yang dikatakan Nabi ﷺ : Ain termasuk nyata, dan seandainya ada yang mendahului takdir, niscaya ainlah yang mendahuluinya. Dan berlindung dari sihir dan ‘ain dianjurkan dan Rasulullah ﷺ berbuat demikian. Ketika Rasul ﷺ sakit, Aisyah meruqyahnya dengan dua surat. Hasad adalah berharap hilangnya nikmat (ini makna secara umum), dan terkadang karena takjub kepada manusia (lain), oleh karenanya janganlah menjadi manusia yang sering takjub. Ya Allah jadikanlah kami orang-orang yang diberkahi, karena mungkin musibah datang kerena sebab ‘ain dari manusia. Dan hasad adalah bagian dari sifat Yahudi yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hasad artinya suka atau senang jika nikmat yang ada pada orang lain hilang darinya. Namun jika senang pada nikmat orang lain dalam arti, ia senang jika ia memperoleh pula nikmat itu dan tidak ada keinginan agar nikmat pada orang lain hilang, maka tidaklah tercela, hal ini dinamakan juga ‘ghibthah’. Yakni menampakkan kedengkiannya dan melakukan konsekwensi dari dengki itu dengan melakukan segala sebab yang bisa dilakukan agar nikmat itu hilang darinya. Termasuk ke dalam yang hasad adalah orang yang menimpakan keburukan kepada orang lain melalui matanya (‘ain), karena hal itu tidaklah muncul kecuali dari orang yang dengki yang buruk tabiatnya dan buruk jiwanya. Demikian pula termasuk ke dalam ‘yang hasad’ adalah Iblis dan keturunannya yang sangat dengki kepada manusia. Disebutkan ketiga macam kejahatan itu meskipun telah dicakup dalam firman Allah Ta’ala, “Dari kejahatan (makhluk yang) Dia ciptakan,” adalah karena besarnya kejahatan ketiga macam itu (kejahatan malam ketika telah gelap, wanita-wanita tukang sihir dan orang yang dengki)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Falaq Ayat 5",
    "description": "Dan aku berlindung pula dari kejahatan orang yang dengki apabila dia dengki, yang selalu menginginkan hilangnya kenikmatan dari orang lain. '1. Wahai nabi Muhammad, katakanlah kepada umatmu, 'aku berlindung kepada tuhan yang menciptakan, memelihara, dan mengurus manusia."
  }
]