[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(ha mim) pembicaraan tentang huruf-huruf yang terpisah-pisah (sepertin ini) telah hadir di awal surat al-baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ḥā Mīm. Pembahasan tentang huruf-huruf semacam ini sudah ada di awal surah Al-Baqarah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1-2. حمٓ وَالْكِتٰبِ الْمُبِينِ (Haa Miim. Demi Kitab (Al Quran) yang menerangkan) Allah bersumpah dengan al-Qur’an itu sendiri bahwa ia merupakan petunjuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Ha’, Mim, adalah dua huruf arab yang memberi penekanan perhatian pada kalimat setelahnya, dan untuk menunjukkan kesempurnaan Al-Qur’an, meskipun tersusun dari huruf-huruf bahasa yang dilafalkan bangsa Arab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ḥā Mīm"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. ini adalah sumpah dengan al-qur’an terhadap al-qur’an. Allah bersumpah dengan al-qur’an yang nyata secara mutlak dan tidak menyebutkan sesuatu yang dikaitkan dengannya, untuk menunjukkan bahwa al-qur’an menjelaskan segala masalah dunia-akhirat yang diperlukan para hamba. “sesungguhnya kami menjadikan al-qur’an dalam bahasa arab.” Inilah yang disumpahkan, al-qur’an dijadikan dengan bahasa yang fasih, jelas dan nyata. Dan inilah salah satu dari penjelasannya. Allah berfirman, “supaya kamu memahami(nya),” kata-kata dan maknanya agar mudah dan dekat dipendengaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 1: (Ha Mim) hanya Allah sajalah yang mengetahui arti dan maksudnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lihat pembahasan tentangnya di awal ayat surah Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 1",
    "description": "H' m'm. Kedua huruf ini termasuk huruf-huruf yang terletak pada permulaan sebagian dari surah-surah al-quran seperti: alif l'm m'm, alif l'm r', alif l'm m'm s'd, dan sebagainya. Di antara ahli-ahli tafsir ada yang menyerahkan pengertiannya kepada Allah karena di pandang termasuk ayat-ayat mutasyabihat, dan ada pula yang menafsirkannya. Golongan yang menafsirkannya ada yang memandangnya sebagai nama surah, dan ada pula yang berpendapat bahwa huruf-huruf abjad itu gunanya untuk menarik perhatian para pendengar supaya memperhatikan al-quran itu, dan untuk mengisyaratkan bahwa al-quran itu diturunkan dari Allah dalam bahasa arab yang tersusun dari huruf-huruf abjad. Kalau mereka tidak percaya bahwa al-quran di turunkan dari Allah dan hanya buatan Muhammad semata-mata, maka cobalah mereka buat semacam al-quran itu. 2. Demi al-kitab, demikian Allah bersumpah yang diturunkan kepada nabi Muhammad, yaitu al-quran yang nyata bersumber dari Allah, nyata ke istimewaannya, dan nyata uraian-uraiannya sehingga menjadi petunjuk bagi manusia."
  }
]