[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dialah yang telah menjadikan untuk kalian bumi yang terhampar, memudahkan untuk kalian jalan-jalan di atasnya untuk kehidupan kalian dan perniagaan kalian, agar dengan jalan-jalan tersebut kalian bisa meraih kemaslahatan dunia dan agama kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dia lah Allah Yang menghamparkan bumi untuk kalian. Dia menjadikan tempat-tempat yang bisa kalian injak dengan kaki kalian, dan membuatkan bagi kalian jalan-jalan di gunung dan lembah dengan harapan agar kalian mendapat petunjuk dalam perjalanan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. الَّذِى جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا (Yang menjadikan bumi untuk kamu sebagai tempat menetap) Makna (المهد) yakni tempat yang terhampar. وَجَعَلَ لَكُمْ فِيهَا سُبُلًا(dan Dia membuat jalan-jalan di atas bumi untuk kamu) Yakni jalan-jalan yang dapat kalian tempuh menuju tempat yang kalian inginkan. لَّعَلَّكُمْ تَهْتَدُونَ(supaya kamu mendapat petunjuk) Dengan menempuh jalan itu kepada tujuan dan keperluan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Dialah Dzat yang membuat bumi yang terbentang bagi kalian seperti kasur atau karpet untuk hidup di atas permukaannya. Dia juga membuatkan kalian jalan di dalamnya supaya kalian mendapatkan petunjuk untuk memenuhi kepentingan kalian. Ayat ini sampai ayat 14 adalah untuk menegur mereka yang berada dalam kesyirikan setelah mengakui bahwa Allah adalah sang Pencipta lagi sang Pemberi nikmat yang banyak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang menjadikan bumi sebagai tempat menetap} tempat yang lapang dan luas {bagi kalian dan menjadikan jalan-jalan} jalan-jalan yang bisa kalian lintasi {di atasnya untuk kalian agar kamu mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. selanjutnya Allah juga menyebutkan berbagai dalil yang menunjukkan kesempurnaan nikmat dan kekuasaanNYa dengan apa-apa yang diciptakan untuk hamba-hambaNya, seperti bumi yang dihamparkan dan dijadikan sebagai tempat menetap untuk para hamba yang memungkinkan mereka melakukan apa pun yang diinginkan. “dan dia membuat jalan-jalan diantara gunung-gunung, drai jalan itu kalian menembus berbagai wilayah dibaliknya, “supaya kamu mendapat petunjuk,” kala menempuh perjalanan, agar kalian tidak tersesat dan supaya kalian juga mendapat petunjuk dengan mengambil I’tibar (pelajaran) serta mengingat Allah karenanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 10: (Yang menjadikan bumi untuk kalian sebagai tempat menetap) sebagai hamparan yang mirip dengan ayunan bayi (dan Dia membuat jalan-jalan di atas bumi untuk kalian) dilalui (supaya kalian mendapat petunjuk) untuk mencapai tujuan-tujuan di dalam perjalanan kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan di antara dalil yang menunjukkan sempurnanya nikmat dan kekuasaan-Nya, yaitu karena Dia telah menciptakan bumi untuk manusia dan menjadikannya sebagai tempat menetap bagi manusia sehingga mereka bisa melakukan apa yang mereka inginkan di atasnya. Yakni di antara gunung-gunung. Yani agar kamu mendapat petunjuk jalan dan tidak tersesat, demikian pula agar kamu mendapat petunjuk dari memperhatikan hal itu; yang menunjukkan bahwa Allah Subhaanahu wa Ta'aala tidaklah membiarkan hamba-hamba-Nya tersesat dan kebingungan, sehingga Dia jelaskan jalan petunjuk agar mereka tidak tersesat dalam meniti hidup di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 10",
    "description": "Begitu banyak kekuasaan Allah yang ditunjukkan kepada manusia. Di antaranya adalah bahwa dialah yang menjadikan bumi sebagai tempat menetap yang mantap dan nyaman bagimu dan dia pulalah yang menjadikan untukmu jalan-jalan yang banyak di atas bumi yang terhampar luas itu agar kamu mendapat petunjuk untuk menuju ke arah dan tujuan yang kamu inginkan dan untuk menuju ke tempat pembuktian ke-esaan Allah. 11. Dan dia pulalah yang menurunkan secara bertahap dan teratur air dari langit menurut ukuran yang diperlukan untuk semua makhluk-Nya yang ada di bumi, untuk kebutuhan minuman kamu, untuk minuman hewan-hewan piaraanmu dan untuk kebutuhan-kebutuhanmu yang lain. Lalu dengan air yang diturunkan sesuai kadarnya itu kami hidupkan negeri yang mati dan tandus sehingga tumbuh-tumbuhan yang ada padanya dapat keluar dari bumi dan tumbuh dengan baik dan subur. Seperti itulah kamu nanti akan dikeluarkan ketika akan dibangkitkan dari kuburmu."
  }
]