[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia lah yang menurunkan hujan dari langit dengan takaran, bukan berupa badai sehingga ia meneggelamkan dan tidak pula sedikit sehingga tidak menutupi hajat kebutuhan, sehingga ia menjadi kehidupan untuk kalian dan hewan-hewan kalian, dengan hujan tersebut Kami menumbuhkan lahan yang luas dari bumi yang kosong dari tanaman, sebagiamana Kami mengeluarkan pohon-pohon dan tanaman-tanaman dengan hujan yang Kami turunkan dari langit sehingga bumi yang mati itu menjadi hidup. Demikianlah kalian (wahai manusia) akan dikeluarkan dari kubur kalian setelah kematian kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Dan Yang menurunkan air dari langit dengan kadar yang cukup bagi kalian, bagi hewan ternak kalian dan bagi tanaman-tanaman kalian, lalu Kami menghidupkan kembali negeri yang mati, tidak ditumbuhi tanaman. Sebagaimana Allah menghidupkan tanah yang mati tersebut dengan tumbuh-tumbuhan, Dia akan menghidupkan kalian untuk dibangkitkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-14. Allah yang menurunkan air hujan dari awan sesuai dengan kebutuhan. Kemudian dengan air itu Kami menghidupkan negeri yang tandus. Seperti keluarnya tanaman dari tanah, kalian akan keluar dari kubur setelah kematian. Allah yang menciptakan segala jenis makhluk seluruhnya, dan menundukkan bagi kalian kendaraan di laut dan darat, seperti kapal, unta, dan kuda; agar kalian dapat berada di atas punggungnya seraya berkata: ‘Maha Suci Allah yang telah menundukkan bagi kita kendaraan ini, sungguh kami tidak kuasa untuk itu. Dan kepada-Nya kita akan kembali setelah kematian untuk menjalani hisab.’ Ibnu Umar berkata, Jika Rasulullah berada di atas punggung unta untuk bepergian, maka beliau bertakbir tiga kali kemudian mengucapkan: ‘Maha Suci Allah yang telah menundukkan bagi kita kendaraan ini, sungguh kami tidak kuasa untuk itu. Dan kepada-Nya kita akan kembali. Ya Allah, kami meminta kepada-Mu kebaikan dan ketakwaan dalam safar kami ini.’ (Shahih Muslim, kitab haji, bab apa yang diucapkan ketika berkendara untuk menunaikan haji dan lainnya, no. 1342)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَالَّذِى نَزَّلَ مِنَ السَّمَآءِ مَآءًۢ بِقَدَرٍ (Dan Yang menurunkan air dari langit menurut kadarnya) Yakni menurut kebutuhannya dan sesuai dengan maslahat yang ada, agar tidak merusak tanaman dan pemukiman kalian dengan menenggelamkannya, dan tidak pula kurang dari yang dibutuhkan sehingga kalian butuh lebih banyak terhadapnya. فَأَنشَرْنَا بِهِۦ بَلْدَةً مَّيْتًا ۚ( lalu Kami hidupkan dengan air itu negeri yang mati) Yakni dengan air itu Kami hidupkan tanah yang tandus yang tidak menumbuhkan tanaman. كَذٰلِكَ تُخْرَجُونَ(seperti itulah kamu akan dikeluarkan (dari dalam kubur)) Yakni dibangkitkan dari kubur kalian dalam keadaan hidup."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Dan Dzat yang menurunkan hujan dari awan sesuai kebutuhan dan kemaslahatan. Lalu dengan hujan itu, kami menghidupkan negeri gersang yang tidak ada satupun tumbuhan di dalamnya. Sebagaimana proses menghidupkan itulah kalian dikeluarkan dari kubur untuk dihisab dan dibalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dzat yang menurunkan air dari langit sesuai takaran} sesuai ukuran kebutuhan kalian terhadapnya {lalu dengan air itu Kami menghidupkan} Kami menghidupkan {negeri yang mati} yang tidak memiliki tanaman {Seperti itulah kalian akan dikeluarkan} kalian akan dibangkitkan dari kubur kalian dalam keadaan hidup"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “dan yang menurunkan air dari langit menurut kadar (yang diperlukan),” tidak lebih dan tidak kurang dan juga sesuatu ukuran yang diperlukan. Tidak kurang sekiranya tidak terdapat manfaat padanya dan tidak lebih sekiranya membahayakan para hamba dan negeri, tapi dengan air itu Allah menolong para hamba dan menyelamatkan negeri dari kesempitan. Karena itu Allah berfirman,”lalu kami hidupkan dengan air itu negeri yang mati,” yakni, kami menghidupkannya setelah kematiannya. “seperti itulah kamu akan dikeluarkan (dari dalam kubur),” yakni, sebagaimana Allah menghidupkan bumi mati dengan air, seperti itu juga Allah menghidupkan kembali kalian setelah kalian berada di alam barzakh untuk memberi balasan berdasarkan amal perbuatan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 11: (Dan Yang menurunkan air dari langit menurut kadar) yang diperlukan oleh kalian, dan Dia tidak menurunkannya dalam bentuk hujan yang sangat besar yang disertai dengan angin topan (lalu Kami hidupkan dengan air itu negeri yang mati, seperti itulah) sebagaimana cara menghidupkan itulah (kalian akan dikeluarkan) dari dalam kubur kalian lalu kalian menjadi hidup kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tidak kurang dan tidak lebih, dan hal itu pun disesuaikan dengan ukuran kebutuhan; tidak kurang sehingga tidak memberi manfaat dan tidak banyak sehingga memadharratkan hamba dan negerinya, bahkan Dia menghujani hamba dan menyelamatkan negeri-negeri dari kesengsaraan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 11",
    "description": "Dan dia pulalah yang menurunkan secara bertahap dan teratur air dari langit menurut ukuran yang diperlukan untuk semua makhluk-Nya yang ada di bumi, untuk kebutuhan minuman kamu, untuk minuman hewan-hewan piaraanmu dan untuk kebutuhan-kebutuhanmu yang lain. Lalu dengan air yang diturunkan sesuai kadarnya itu kami hidupkan negeri yang mati dan tandus sehingga tumbuh-tumbuhan yang ada padanya dapat keluar dari bumi dan tumbuh dengan baik dan subur. Seperti itulah kamu nanti akan dikeluarkan ketika akan dibangkitkan dari kuburmu. 12-13. Dan kekuasaan-Nya yang lain adalah bahwa dia pulalah yang menciptakan semuanya, yaitu semua makhluk-Nya berpasang-pasangan dan dengan keberpasangannya itu mereka saling menyempurnakan satu sama lain. Dan dialah yang menjadikan kapal sebagai alat transportasi laut untukmu yang dapat mengantar kamu dan kebutuhan kamu ke tempat tujuanmu di laut dengan aman dan atas izin-Nya dan hewan ternak sebagai alat transportasi darat yang kamu tunggangi, agar kamu duduk di atas punggungnya dengan aman dan atas izin-Nya dan menjadikannya sebagai pengangkut barang-barang kebutuhanmu. Kemudian kamu ingat dengan pikiran dan hatimu nikmat tuhanmu, yaitu ditundukkannya hewan-hewan itu untuk kamu apabila kamu telah duduk dengan aman dan mantap dan melihat barang-barangmu aman di atasnya; dan agar kamu mengucapkan dengan lidahmu sebagai peng-akuan atas kekuasaan Allah menundukkannya dengan mengatakan, 'mahasuci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya, yakni sebelum Allah menundukkannya, tidak mampu menguasainya. \"."
  }
]