[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Dia lah yang menciptakan segala jenis hewan-hewan dan tumbuhan, Dia juga membuat kapal-kapal untuk kalian yang kalian naiki di lautan, diantara hewan-hewan ternak seperti unta, kuda dan bigal serta keledai ada yang kalian kendarai di daratan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan yang menciptakan segala sesuatu, seperti malam-siang, laki-laki perempuan dan sebagainya, dan Dia menjadikan bagi kalian dari kapal-kapal dan binatang ternak untuk kalian tunggangi dalam perjalanan kalian, maka kalian menaiki kapal di lautan dan menunggangi hewan ternak di daratan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَالَّذِى خَلَقَ الْأَزْوٰجَ كُلَّهَا (Dan Yang menciptakan semua yang berpasang-pasangan) Yakni menciptakan berbagai jenis makhluk. Pendapat lain mengatakan bahwa yang dimaksud adalah menciptakan hewan yang berpasangan, jantan dan betina; begitu pula dengan tanaman jantan dan betina pada setiap jenisnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Dan Dzat yang menciptakan semua jenis makhluk yang saling berpasang-pasangan dan berhubungan. Dia juga menciptakan untuk kalian sesuatu yang dapat kalian tunggangi di darat dan lautan berupa perahu-perahu dan hewan ternak. Yang dimaksud hewan ternak di sini adalah unta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dzat yang menciptakan semua makhluk berpasang-pasangan} berpasangan {dan menjadikan untuk kalian kapal} bahtera {serta hewan ternak untuk kalian kendarai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “dan yang menciptakan kalian semua yang berpasang-pasangan,” yaitu seluruh jenis yang tumbuh di bumi dan diri kalian serta segala sesuatu yang tidak kalian ketahui seperti waktu malam dan siang, hangat dan dingin, lelaki dan perempuan dan lain sebagainya, “dan menjadikan untukmu kapal,” yaitu kapal laut dan kendaraan yang kalian tumpangi, “dan” dari ”binatang ternak yang kamu tunggangi,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 12: (Dan Yang menciptakan makhluk yang berpasang-pasangan) berbagai jenis makhluk berpasang-pasangan (semuanya, dan menjadikan untuk kalian kapal) atau perahu-perahu (dan binatang ternak) misalnya unta (yang kalian tunggangi) di dalam lafal ayat ini dibuang daripadanya Dhamir yang kembali kepada lafal Ma demi untuk meringkas, Dhamir tersebut adalah lafal Fihi maksudnya, yang dapat kalian kendarai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada malam dan ada siang, ada panas dan ada dingin, ada laki-laki dan ada perempuan, dst."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 12",
    "description": "12-13. Dan kekuasaan-Nya yang lain adalah bahwa dia pulalah yang menciptakan semuanya, yaitu semua makhluk-Nya berpasang-pasangan dan dengan keberpasangannya itu mereka saling menyempurnakan satu sama lain. Dan dialah yang menjadikan kapal sebagai alat transportasi laut untukmu yang dapat mengantar kamu dan kebutuhan kamu ke tempat tujuanmu di laut dengan aman dan atas izin-Nya dan hewan ternak sebagai alat transportasi darat yang kamu tunggangi, agar kamu duduk di atas punggungnya dengan aman dan atas izin-Nya dan menjadikannya sebagai pengangkut barang-barang kebutuhanmu. Kemudian kamu ingat dengan pikiran dan hatimu nikmat tuhanmu, yaitu ditundukkannya hewan-hewan itu untuk kamu apabila kamu telah duduk dengan aman dan mantap dan melihat barang-barangmu aman di atasnya; dan agar kamu mengucapkan dengan lidahmu sebagai peng-akuan atas kekuasaan Allah menundukkannya dengan mengatakan, 'mahasuci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya, yakni sebelum Allah menundukkannya, tidak mampu menguasainya. \"12-13"
  }
]