[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "13-14 Agar kalain duduk nyaman di atas punggung hewan kendaraan kalian, kemudian kalian mengingat nikmat tuhan kalian bila kalian mengendarainya dan kalian mengucapkan, ”segala puji bagi Allah yang telah menundukan ini bagi kami dan kami sendiri tidak mampu menundukannya.” Dan agar kalain mengucapkan Sesungguhnya kami akan kembali dan berpulang kepada tuhan kami setelah kami mati.”. Dalam ayat ini menjelaskan bahwa Allah yang memberikan nikmat kepada manusia dengan berbagai bentuknya, itulah yang berhak untuk disembah dalam kondisi apapun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Allah menjadikan itu semua dengan harapan kalian dapat stabil di atas punggung hewan yang kalian tunggangi di dalam safar kalian, lalu kalian mengingat di hati kalian nikmat Rabb terhadap diri kalian yang telah menundukkannya untuk kalian saat kalian telah mantap di atas punggungnya, dan kalian mengucap dengan lisan-lisan kalian, “Mahasuci dan bersih Żat yang telah menundukkan tunggangan ini bagi kami sehingga kami mampu menguasainya, dan sebelumnya kami tidak mampu melakukannya kalaulah Allah tidak menundukkannya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. لِتَسْتَوُۥا۟ عَلَىٰ ظُهُورِهِۦ (Supaya kamu duduk di atas punggungnya) Yakni agar kalian dapat berada di atas hewan atau kapal yang kalian kendarai. ثُمَّ تَذْكُرُوا۟ نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ(kemudian kamu ingat nikmat Tuhanmu apabila kamu telah duduk di atasnya) Yakni agar kalian mengingat nikmat yang telah diberikan kepada kalian yang berupa penundukan kendaraan darat dan laut untuk kalian. وَتَقُولُوا۟ سُبْحٰنَ الَّذِى سَخَّرَ لَنَا هٰذَا(dan supaya kamu mengucapkan: “Maha Suci Tuhan yang telah menundukkan semua ini bagi kami) Yakni yang telah menundukkan kendaraan ini. وَمَا كُنَّا لَهُۥ مُقْرِنِينَ (padahal kami sebelumnya tidak mampu menguasainya) Yakni kami sebelumnya tidak dapat menundukannya kalaulah bukan karena Allah yang menundukkannya bagi kami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Supaya kalian dapat stabil di atas kendaraan-kendaraan tersebut, lalu kalian mengingat nikmat Allah saat stabil menaiki kendaraan itu, kemudian memujiNya, dan mengagungkanNya. Setelah turun, kalian berkata: “Maha suci Dzat yang mengendalikan kendaraan ini dari kekurangan dan aib untuk kami. Kami tidak akan bisa menggunakannya dan mengendarainya dengan seimbang jika Allah tidak mengontrolnya untuk kami”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar kalian dapat duduk} agar kalian dapat menetap {di atas punggungnya} di atas punggung hewan yang kalian tunggangi {Kemudian kalian mengingat nikmat Tuhan kalian, jika sudah duduk di atasnya} jika kalian sudah menetap di atas punggu apa yang kalian naiki baik di darat maupun di laut {dan kalian akan berkata,“Maha suci} Maha suci {Dzat yang telah menundukkan} menundukkan dan menaklukkan {untuk kami tunggangan ini {dan kami sebelumnya tidak mampu menguasainya} terhadap hewan yang ditunggangi menahan kekuatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13-14. “supaya kamu duduk di atas punggungnya,” ini mencakup punggung kapal dan binatang. Artinya, agar kalian tegak diatasnya. “kemudian kamu ingat nikmat Rabbmu apabila kamu telah duduk di atasnya,” dengan mengakui nikmat Dzat yang menundukkannya dan memujiNya atas hal itu. Karena itu Allah berfirman,”dan supaya kamu mengucapkan,’Mahasuci Dia yang telah menundukkan semua ini bagi kami padahal sebelumnya kami tidak mampu menguasainya,” maksudnya, andaikan Allah tidak menundukkan kapal dan binatang bagi kami, pasti kami tidak kuasa dan mampu atasnya. Tapi karena kelembutan dan kemuliaanNya, Allah menundukkan dan memudahkan sebab-sebabnya. Maksud dari semua ini adalah penjelasan bahwa Rabb yang disifati sebagai yang memberi nikmat kepada para hamba itulah yang berhak disembah, shalat, dan sujud kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 13: (Supaya kalian dapat duduk) tetap (di atas punggungnya) Dhamir yang ada pada ayat ini dimudzakkarkan, dan lafal Zhahr dikemukakan dalam bentuk jamak sehingga menjadi Zhuhur; hal ini karena memandang makna yang terkandung di dalam lafal Ma (kemudian kalian ingat nikmat Rabb kalian apabila kalian telah duduk di atasnya dan supaya kalian mengatakan, \"Maha Suci Tuhan yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya) tidak dapat menguasainya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik punggung kapal maupun punggung binatang ternak. Yaitu mengakui nikmat Allah, karena Dia telah menundukkannya, serta memuji-Nya. Yakni kalau bukan karena penundukkan-Nya kepada kami baik kapal maupun hewan ternak, tentu kami tidak akan sanggup menguasainya. Akan tetapi, karena kelembutan dan kemurahan-Nya Dia menundukkannya dan memudahkan sebab-sebabnya. Maksud ayat ini adalah bahwa Tuhan yang memiliki sifat itu, yaitu melimpahkan berbagai nikmat kepada hamba-hamba-Nya, Dialah yang berhak diibadahi, ditujukan shalat dan sujud serta doa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 13",
    "description": "12-13. Dan kekuasaan-Nya yang lain adalah bahwa dia pulalah yang menciptakan semuanya, yaitu semua makhluk-Nya berpasang-pasangan dan dengan keberpasangannya itu mereka saling menyempurnakan satu sama lain. Dan dialah yang menjadikan kapal sebagai alat transportasi laut untukmu yang dapat mengantar kamu dan kebutuhan kamu ke tempat tujuanmu di laut dengan aman dan atas izin-Nya dan hewan ternak sebagai alat transportasi darat yang kamu tunggangi, agar kamu duduk di atas punggungnya dengan aman dan atas izin-Nya dan menjadikannya sebagai pengangkut barang-barang kebutuhanmu. Kemudian kamu ingat dengan pikiran dan hatimu nikmat tuhanmu, yaitu ditundukkannya hewan-hewan itu untuk kamu apabila kamu telah duduk dengan aman dan mantap dan melihat barang-barangmu aman di atasnya; dan agar kamu mengucapkan dengan lidahmu sebagai peng-akuan atas kekuasaan Allah menundukkannya dengan mengatakan, 'mahasuci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya, yakni sebelum Allah menundukkannya, tidak mampu menguasainya. \"14. Dan sesungguhnya sesudah kehidupan di dunia ini, kami pasti akan kembali kepada tuhan kami, untuk mempertanggungjawabkan amal perbuatan kami. '."
  }
]