[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang musyrik itu menjadikan bagiNya bagian dari makhlukNya, yaitu ucapan mereka tentang malaikat, ”anak-anak perempuan Allah”. sesungguhnya manusia adalah pengingkar terhadap nikmat-nikmat tuhannya yang telah Dia limpahkan kepadanya, memperlihatkan pengingkaran dan kekafirannya, menghitung musibah-musibah dan melupakan berbagai nikmat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Orang-orang musyrik mengira bahwa sebagian makhluk itu dilahirkan dari Al-Khāliq -Subḥānahu-, tatkala mereka berkata, “Para Malaikat adalah anak-anak perempuan Allah.” Sesungguhnya orang yang mengucapkan hal ini adalah pembangkang yang jelas kekufuran dan kesesatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Orang-orang musyrik menganggap Allah memiliki anak. Maha Suci Allah dari apa yang mereka katakan. Sungguh manusia sangat jelas kekafirannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَجَعَلُوا۟ لَهُۥ مِنْ عِبَادِهِۦ جُزْءًا ۚ (Dan mereka menjadikan sebahagian dari hamba-hamba-Nya sebagai bahagian daripada-Nya) Yang dimaksud adalah para malaikat yang mereka anggap sebagai anak-anak perempuan Allah karena anak merupakan bagian dari ayahnya. إِنَّ الْإِنسٰنَ لَكَفُورٌ مُّبِينٌ(Sesungguhnya manusia itu benar-benar pengingkar yang nyata (terhadap rahmat Allah)) Yakni mereka mengingkari kenikmatan dari Allah secara jelas, karena kenikmatan yang diberikan Allah bagi mereka sangat jelas, sehingga keingkaran mereka terhadap kenikmatan itu menjadi kedustaan yang lebih jelas lagi. Dan orang-orang jahil itu juga menisbatkan anak kepada-Nya dan bahkan menjadikan bagi-Nya jenis anak yang lebih lemah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Setelah mengakui bahwa Allah adalah sang Pencipta, orang-orang musyrik menjadikan salah satu hamba Allah sebagai anakNya, yaitu para malaikat. Mereka berkata: “Para malaikat adalah puteri-puteri Allah, karena anak adalah bagian dari orang tua” Sesungguhnya manusia yang berkata demikian, berada dalam kekufuran yang sangat besar dan menampakkan kekufurannya, karena pengingkaran terhadap nikmat ini setelah jelas kebenarannya, maka itu adalah pendustaan yang nampak."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjadikan sebagian dari hamba-hambaNya bagiNya sebagai bagian} bagian dari anak, dengan berkata,”Malaikat adalah anak perempuan Allah {Sesungguhnya manusia itu benar-benar orang yang ingkar yang nyata} tampak keingkarannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Allah mengabarkan kejinya perkataan orang-orang musyrik yang menganggap Allah memilki anak, padahal Dia-lah Yang Maha Esa, Maha Tunggal dan tempat bergantung segala sesuatu, yang tidak memilki pendamping dan tidak juga anak dan tidak ada satu sekutu pun bagiNya. Anggapan tersebut batil dari berbagai segi; pertama, semua makhluk adalah hamba-hambaNya sedangkan ubudiyah itu menafikan memilki anak. Kedua, anak adalah bagian dari ayah, sedangkan Allah berbeda dengan makhlukNya dari segi sifat-sifat dan keluhuranNya. Karena itu, mustahil bagi Allah memiliki anak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 15: (Dan mereka menjadikan sebagian dari hamba-hamba-Nya sebagai bagian daripada-Nya) karena mereka telah mengatakan, bahwa malaikat-malaikat itu adalah anak-anak perempuan Allah. Dikatakan Juz'an atau bagian, karena anak itu adalah bagian dari orang tuanya; padahal hakikatnya malaikat-malaikat itu adalah hamba-hamba Allah swt. (Sesungguhnya manusia) yang telah mengatakan perkataan tadi (benar-benar pengingkar yang nyata) yang jelas dan nyata kekafirannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang kejinya ucapan orang-orang musyrik yang menjadikan anak untuk Allah, padahal Dia Maha Esa, bergantung kepada-Nya segala sesuatu, Dia tidak punya istri dan anak, dan tidak ada yang setara dengan-Nya, dan bahwa hal tersebut termasuk kebatilan yang paling batil karena beberapa sisi, di antaranya: - Makhluk semuanya adalah hamba-Nya, dan keadaan sebagai hamba menolak sebagai anak. - Anak merupakan bagian dari bapaknya, sedangkan Allah Subhaanahu wa Ta'aala berbeda dengan makhluk-Nya. Berbeda sifat-Nya dan sifat-sifat kebesaran-Nya. Oleh karena itu, mustahil Allah Subhaanahu wa Ta'aala mempunyai anak. - Mereka menyangka bahwa para malaikat adalah puteri-puteri Allah, padahal sudah menjadi maklum bahwa puteri merupakan bagian yang paling rendah, lalu bagaimana untuk Allah anak perempuan dan untuk mereka anak laki-laki. Apakah mereka lebih mulia dari Allah, Mahatinggi Allah dari hal itu dengan ketinggian yang besar. - Bagian yang mereka nisbatkan kepada Allah adalah puteri, dimana bagian tersebut adalah bagian yang paling hina, paling mereka benci, bahkan saking bencinya mereka, ketika diberitakan kelahiran seorang anak perempuan wajahnya menjadi hitam, lalu bagaimana mereka menjadikan untuk Allah sesuatu yang mereka benci. - Perempuan sifatnya memiliki kekurangan, termasuk dalam bicara dan dalam menjelaskan (lihat ayat 18). - Mereka menjadikan para malaikat yang sesungguhnya sebagai hamba-hamba Allah sebagai perempuan, sehingga mereka berani terhadap para malaikat yang didekatkan, mengangkat mereka (para malaikat) dari kedudukan sebagai hamba sebagai sekutu bagi Allah dalam sesuatu yang menjadi kekhususan-Nya, selanjutnya mereka menurunkan kedudukan mereka (para malaikat) dari kedudukan laki-laki kepada kedudukan perempuan, maka Mahasuci Allah yang memperlihatkan bertentangannya orang yang berdusta terhadap-Nya dan menentang Rasul-Nya. - Allah Subhaanahu wa Ta'aala membantah mereka (kaum musyrik), bahwa mereka tidak menyaksikan penciptaan malaikat, lalu bagaimana mereka berani berbicara terhadap sesuatu yang tidak mereka ketahui. Meskipun begitu, mereka akan ditanya tentang persaksian tersebut, akan dicatat dan akan diberikan siksa sebagai balasan. Maksudnya orang musyrikin mengatakan bahwa malaikat-malaikat itu adalah anak-anak perempuan Allah, padahal malaikat itu sebagian dari makhluk ciptaan-Nya. Yang mengatakan seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 15",
    "description": "Walaupun Allah telah menerangkan kekuasaan-Nya dalam menciptakan langit dan bumi serta menundukkan hewan ternak untuk manusia, sebagian manusia masih saja mempersekutukan Allah dengan makhluk-Nya. Dan mereka, yakni orang-orang musyrik, menjadikan sebagian dari hamba-hamba-Nya, yang merupakan ciptaan-Nya sebagai bagian dari-Nya, dengan menganggap bahwa malaikat adalah anak-anak tuhan. Sesungguhnya, manusia yang mempercayai dan mengatakan demikian itu benar-benar pengingkar nikmat tuhan, yang melampaui batas dalam kekafirannya, lagi yang nyata kesyirikan dan keingkarannya. 16. Lalu Allah mengecam apa yang telah di katakan dan di yakini oleh orang-orang musyrik dengan mengatakan, 'pantaskah dia, Allah yang maha esa, yang mahakuasa, dan yang maha pencipta itu mengambil dengan sungguh-sungguh dari apa yang di ciptakan-Nya sendiri berupa anak-anak perempuan yang justru orang-orang musyrik itu tidak suka mendapatkannya' tentulah tidak pantas. Dan pantas pulakah kamu beranggapan bahwa Allah memberikan anak laki-laki kepadamu' tentulah tidak pantas. Sungguh ini kepercayaan yang sangat keliru dan tidak masuk akal. '."
  }
]