[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah kalian wahai (orang-orang jahil) mengklaim bahwa tuhan kalian mengangkat anak perempuan dari makhlukNya, sedangkan kalian sendiri tidak menerimanya untuk diri kalian, dan mengistimewakan kalain dengan anak laki-laki dan menjadikan mereka untuk kalian? Dalam ayat ini merupakan celaan terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Apakah kalian -wahai orang-orang musyrik- mengatakan bahwa Allah menjadikan dari apa yang diciptakan-Nya sebagai anak-anak perempuan-Nya untuk diri-Nya dan mengkhususkan anak-anak lelaki untuk kalian? Pembagian macam apa ini yang sedang kalian bagi?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Allah mengingkari orang-orang musyrik: Apakah Allah akan menjadikan anak-anak perempuan bagi diri-Nya sendiri, kemudian menjadikan anak-anak laki-laki bagi kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَأَصْفَىٰكُم بِالْبَنِينَ (dan Dia mengkhususkan buat kamu anak laki-laki) Sehingga Dia memberi diri-Nya anak yang lebih lemah, sedangkan kalian diberi anak yang lebih kuat? Bagaimana ini mungkin terjadi sedangkan Dia adalah Pencipta seluruh makhluk, padahal segala urusan dan keputusan ada di tangan-Nya?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Pantaskan Allah menjadikan salah satu makhluknya sebagai puteriNya, sedangkan kalian mengkhususkan anak laki-laki untuk diri kalian? Maknanya bahwa kenyataannya tidak seperti yang mereka anggapkan. Kalian mengklaim bahwa Allah menjadikan sesuatu yang dimuliakan untuk diriNya dan sesuatu yang lebih baik dari milik Allah itu untuk diri kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah patut Dia mengambil anak perempuan dari sebagian yang telah Dia ciptakan dan memilihkan untuk kalian} mengkhususkan dan memilihkan untuk kalian {anak laki-laki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. ketiga, mereka mengira bahwa para malaikat adalah putri-putri Allah. Dan sudah dimaklumi bahwa perempuan itu adalah yang lebih rendah di anatra dua golongan, lantas bagaimana Allah memilki anak perempuan sedangkan mereka memilih anak lelaki, serta lebih memuliakan diri mereka dengannya. Artinya, mereka lebih mulia dari Allah. Mahatinggi Allah dari hal itu karena kesombongan dan kecongkakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 16: (Patutkah) lafal Am di sini bermakna Istifham Inkari, sedangkan lafal Al Qaulu diperkirakan keberadaannya sesudah itu, yakni Ataquluna: Apakah kalian patut mengatakan (Dia mengambil anak perempuan dari yang diciptakan-Nya) untuk diri-Nya sendiri (dan Dia mengkhususkan buat kalian) memilihkan buat kalian (anak laki-laki) yang hal ini disimpulkan daripada perkataan kalian yang tadi itu; jumlah kalimat ini merupakan kalimat yang diinkari oleh Istifham tadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 16",
    "description": "Lalu Allah mengecam apa yang telah di katakan dan di yakini oleh orang-orang musyrik dengan mengatakan, 'pantaskah dia, Allah yang maha esa, yang mahakuasa, dan yang maha pencipta itu mengambil dengan sungguh-sungguh dari apa yang di ciptakan-Nya sendiri berupa anak-anak perempuan yang justru orang-orang musyrik itu tidak suka mendapatkannya' tentulah tidak pantas. Dan pantas pulakah kamu beranggapan bahwa Allah memberikan anak laki-laki kepadamu' tentulah tidak pantas. Sungguh ini kepercayaan yang sangat keliru dan tidak masuk akal. '17. Allah menegaskan apa yang di kecam-Nya di dalam ayat sebelumnya dengan mengatakan bahwa apabila salah seorang di antara mereka, yaitu kaum musyrik mekah yang berkeyakinan seperti itu, di beri kabar gembira dengan kelahiran apa, yaitu anak perempuan, yang di jadikan sebagai perumpamaan bagi al-rahman, Allah yang maha pengasih, jadilah wajahnya hitam pekat karena kejengkelan dan kemarahan menerima kehadiran anak perempuan itu, sedang ia sendiri ketika menerima berita itu amat menahan sedih dan marah. Kalau demikian halnya, mengapa mereka menyatakan bahwa Allah memiliki anak perempuan'."
  }
]