[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila salah seorang dari mereka diberi kabar gembira dengan kelahiran anak perempuan (yang mereka nisbatkan kepada Allah saat mereka mengatakan bahwa malaikat adalah anak perempuan Allah) maka wajahnya menghitam karena buruknya berita gembira tersebut(baginya), dia bersedih, dadanya penuh dengan kepedihan dan penyesalan. Maka bagaimana mereka bisa menisbatkan sesuatu kepada Allah yang mereka sendiri tidak bisa menerimanya untuk diri mereka? mahatinggi dan maha suci Allah dari apa yang dikatakan oleh orang-orang kafir itu setinggi-tingginya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Jika salah seorang dari mereka mendapat kabar gembira dengan lahirnya anak perempuan yang mereka nisbahkan kepada Rabb mereka, wajah mereka menjadi hitam pekat karena besarnya kegundahan dan kesedihan serta hatinya dipenuhi dengan kemarahan. Maka bagaimana ia menasabkan kepada Rabbnya sesuatu yang membuatnya marah apabila ia mendapatkannya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-19. Jika salah seorang dari orang-orang musyrik itu mendapat kabar kelahiran anaknya berjenis perempuan, maka wajahnya berubah menjadi menghitam karena kesedihan. Apakah mereka menjadikan bagi Allah anak yang terbiasa berhias sejak kecil dan tidak mampu berdebat karena tidak dapat memberi penjelasan dengan baik? Dan orang-orang musyrik itu menjadikan para malaikat yang senantiasa menyembah Allah itu berjenis perempuan. Apakah mereka menyaksikan penciptaan mereka sehingga mereka dapat menetapkan jenis kelamin mereka? Perkataan dusta mereka itu akan dicatat, dan mereka akan mendapat balasannya di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَإِذَا بُشِّرَ أَحَدُهُم بِمَا ضَرَبَ لِلرَّحْمٰنِ مَثَلًا (apabila salah seorang di antara mereka diberi kabar gembira dengan apa yang dijadikan sebagai misal bagi Allah Yang Maha Pemurah) Karena anak merupakan misal bagi ayahnya. Yakni jika salah satu dari mereka dikabarkan bahwa ia mendapat anak perempuan maka mereka merasa sedih yang nampak pada wajahnya. ظَلَّ وَجْهُهُۥ مُسْوَدًّا(jadilah mukanya hitam pekat) Yakni wajahnya dari menghitam karena kesedihan dan sakit hati disebebkan kelahiran anak perempuannya padahal dia sangat mengharap anak laki-laki. وَهُوَ كَظِيمٌ (sedang dia amat menahan sedih) Yakni penuh dengan kesedihan dan kegalauan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Saat dikabarkan tentang kelahiran anak perempuan kepada salah satu orang musyrik, maka wajahnya akan berubah menjadi hitam padam karena sedih. Dia dipenuhi dengan kesedihan dan kemarahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila salah seorang di antara mereka diberi kabar gembira tentang sesuatu yang dijadikan} dijadikan {sebagai perumpamaan} perumpamaan {bagi Dzat Yang Maha Pengasih. Wajahnya menjadi} menjadi {kehitam-hitaman karena menahan amarah} dipenuhi kemarahan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. keempat, jenis yang bisa dinasabkan kepada Allah yakni, perempuan adalah jenis yang lebih rendah dan lebih mereka benci, hingga begitu bencinya mereka karena hal itu,”apabila salah seorang di antara mereka diberi kabar gembira dengan apa yang dijadikan sebagai missal bagi Allah Yang Maha Pemurah; jadilah mukanya hitam pekat,” karena ketidaksukaan nya dan kerasnya murka. Lantas bagaimana mereka menjadikan sesuatu yang mereka benci untuk Allah?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 17: (Padahal apabila salah seorang di antara mereka diberi kabar gembira dengan apa yang dijadikan sebagai misal bagi Allah Yang Maha Pemurah) maksudnya, dijadikan baginya hal serupa dengan apa yang ia nisbatkan kepada Allah, yaitu diberi anakanak perempuan. Atau dengan kata lain, apabila ia diberi berita gembira tentang kelahiran anak perempuannya (jadilah) maka menjadi berubahlah (mukanya hitam) artinya, roman mukanya tampak berubah menjadi kelabu (sedangkan dia amat menahan sedih) penuh dengan kedukaan, maka mengapa mereka berani menisbatkan anak-anak perempuan kepada Allah swt.?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksud ayat ini ialah apabila dia diberi kabar tentang kelahiran anaknya yang perempuan, mukanya menjadi merah padam karena malu dan dia sangat marah, padahal dia sendiri mengatakan bahwa Allah mempunyai anak perempuan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 17",
    "description": "Allah menegaskan apa yang di kecam-Nya di dalam ayat sebelumnya dengan mengatakan bahwa apabila salah seorang di antara mereka, yaitu kaum musyrik mekah yang berkeyakinan seperti itu, di beri kabar gembira dengan kelahiran apa, yaitu anak perempuan, yang di jadikan sebagai perumpamaan bagi al-rahman, Allah yang maha pengasih, jadilah wajahnya hitam pekat karena kejengkelan dan kemarahan menerima kehadiran anak perempuan itu, sedang ia sendiri ketika menerima berita itu amat menahan sedih dan marah. Kalau demikian halnya, mengapa mereka menyatakan bahwa Allah memiliki anak perempuan'18. Lalu Allah mengecam mereka dengan mengatakan bahwa apakah orang, yakni wanita-wanita yang dibesarkan dalam perhiasan, patut dijadikan sebagai anak Allah sedang dia tidak mampu memberi alasan atau penjelasan yang tegas dan jelas dalam pertengkaran."
  }
]