[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kalian lancang dan menisbatkan kepada Allah seseorang yang dibesarkan dalam perhiasan, yaitu kondisi perdebatan yang tidak jelas hujjahnya karena dia tumbuh dalam perhiasan dan kenikmatan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Apakah mereka menasabkan kepada Rabb mereka seorang yang tumbuh dipelihara dengan perhiasan sementara dalam perdebatan dia tidak mampu berbicara secara jelas karena kodratnya sebagai wanita?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. أَوَمَن يُنَشَّؤُا۟ فِى الْحِلْيَةِ وَهُوَ فِى الْخِصَامِ غَيْرُ مُبِينٍ (Dan apakah patut (menjadi anak Allah) orang yang dibesarkan dalam keadaan berperhiasan sedang dia tidak dapat memberi alasan yang terang dalam pertengkaran) Yakni karena mereka menjadikan anak perempuan bagi Allah, maka mereka telah menganggap anak Allah dibesarkan dalam berhias serta tidak mampu mengurus urusannya sendiri, dan jika dia berselisih tidak dapat melakukan perdebatan dan melawan musuhnya akibat akalnya yang lemah; demikianlah anak perempuan pada umumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Atau pantaskah mereka menjadikan seseorang yang penuh perhiasan sebagai anak untuk Allah? Mereka adalah perempuan-perempuan (Hamzah pada ayat itu adalah hamzah inkary) yang dididik dengan bergelimang perhiasan, sedangkan dia tidak mampu menunjukkan alasannya dalam perselisihan atau perdebatan karena hujjahnya lemah. Kelemahannya dalam berdebat itu akibat kewanitaannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah patut orang yang tumbuh} orang yang dibina {dalam keadaan berperhiasan} dalam keadaan berperhiasan {sedangkan dalam perdebatan} dalam perdebatan {tidak bisa memberikan alasan jelas} menunjukkan alasan kaarena lemah dalam hal tersebut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. kelima, golongan wanita memiliki kekuarangan dari segi sifat, cara bicara dan penjelasan, karena itu Allah berfirman ”dan apakah patut (menjadi anak Allah), orang yang dibesarkan dalam keadaan berperhiasan,” yaitu diberi perhiasaan karena kurang elok, diberi perhiasaan dengan sesuatu dari luar, “sedang dia dalam pertengakaran,”yaitu pada saat pertengkaran yang mengharuskan seseorang menampakkan ucapannya, “tidak dapat memberi alasan yang terang,” yaitu tidak diperjelas dengan hujjah dan penjelas drai apa yang terdapat dalam benaknya. Lantas bagaimana mereka menisbatkan anak perempuan pada Allah?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 18: (Dan apakah patut) Hamzah atau kata tanya di sini mengandung pengertian ingkar, sedangkan Wawu 'Athafnya menunjukkan 'Athaf jumlah kepada jumlah yang lain. Maksudnya, apakah patut mereka menjadikan bagi Allah (orang yang dibesarkan dalam perhiasan) maksudnya selalu berhias diri (sedangkan dia tidak dapat memberi alasan yang terang dalam pertengkaran) tidak pernah menang di dalam adu argumentasi karena kelemahan akalnya sebagai perempuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak jelas hujjahnya dan tidak fasih mengungkapkan isi hatinya, lalu bagaimana mereka menisbatkannya kepada Allah Subhaanahu wa Ta'aala?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 18",
    "description": "Lalu Allah mengecam mereka dengan mengatakan bahwa apakah orang, yakni wanita-wanita yang dibesarkan dalam perhiasan, patut dijadikan sebagai anak Allah sedang dia tidak mampu memberi alasan atau penjelasan yang tegas dan jelas dalam pertengkaran. 19. Allah menegaskan apa yang dinyatakan-Nya di dalam ayat di atas dengan mengatakan bahwa mereka, orang-orang musyrik mekah, menjadikan malaikat-malaikat yang mereka itu hamba-hamba Allah yang maha pengasih yang sangat taat dan senantiasa beribadah kepada-Nya itu sebagai berjenis kelamin perempuan. Apakah mereka menyaksikan sendiri dengan mata kepala mereka atau melalui bukti-bukti yang pasti menyangkut penciptaan mereka, yakni malaikat-malaikat itu pada saat diciptakan ataukah melihat wujud malaikat itu setelah diciptakan' hal itu pastilah tidak akan terjadi. Mereka tidak menyaksikannya. Kelak akan dituliskan di dalam catatan amal mereka oleh malaikat yang ditugaskan untuk itu kesaksian mereka dan akan dimintai pertanggungjawaban di akhirat kelak."
  }
]