[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah bersumpah dengan al-quran yang agung lafazh dan maknanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Allah bersumpah dengan Al-Qur`ān yang menjelaskan jalan hidayah menuju kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-4. Sungguh demi al-Qur’an yang jelas hukum-hukum dan petunjuknya bagi para hamba, Kami -dengan keagungan dan kekuasaan Kami yang sempurna- jadikan al-Qur’an berbahasa Arab fasih, agar kalian memahami maknanya dan menghayati tujuannya. Sungguh al-Qur’an di lauhul mahfuzh yang ada di sisi Kami memiliki derajat dan kemuliaan yang tinggi, penuh dengan hikmah dan hukum yang bijaksana. Dari Ibnu Abbas, ia berkata: “Makhluk yang pertama kali Allah ciptakan adalah pena, kemudian Allah memerintahkannya untuk menulis apa yang hendak Allah ciptakan, dan kitab itu ada di sisi-Nya.” kemudian ia membaca: وَإِنَّهُۥ فِىٓ أُمِّ ٱلْكِتَٰبِ لَدَيْنَا لَعَلِىٌّ حَكِيمٌ Dan sesungguhnya Al Quran itu dalam induk Al Kitab (Lauh Mahfuzh) di sisi Kami, adalah benar-benar tinggi (nilainya) dan amat banyak mengandung hikmah. (Diriwayatkan oleh Abdullah bin Ahmad dari Imam Ahmad, as-Sunnah 2/410 no. 898. Dan diriwayatkan oleh at-Thabari dalam tafsirnya 25/48 dari jalur Ibnu Aliyah dari ad-Distiwa’i. Sanadnya shahih. (Lihat: riwayat-riwayat Imam Ahmad dalam tafsir 4/81 no. 149))."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Aku bersumpah demi Al-Qur’an yang jelas lagi menerangkan bahwa Al-Qur’an adalah petunjuk yang menggunakan bahasa Arab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi kitab yang jelas} yang menjelaskan dari jalan kesesatan menuju jalan petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. ini adalah sumpah dengan al-qur’an terhadap al-qur’an. Allah bersumpah dengan al-qur’an yang nyata secara mutlak dan tidak menyebutkan sesuatu yang dikaitkan dengannya, untuk menunjukkan bahwa al-qur’an menjelaskan segala masalah dunia-akhirat yang diperlukan para hamba. “sesungguhnya kami menjadikan al-qur’an dalam bahasa arab.” Inilah yang disumpahkan, al-qur’an dijadikan dengan bahasa yang fasih, jelas dan nyata. Dan inilah salah satu dari penjelasannya. Allah berfirman, “supaya kamu memahami(nya),” kata-kata dan maknanya agar mudah dan dekat dipendengaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 2: (Demi Alkitab) demi Alquran (yang menerangkan) yang menonjolkan jalan petunjuk beserta dengan sarana yang diperlukannya yaitu berupa syariat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah bersumpah dengan Al Qur’an untuk Al Qur’an. Allah Subhaanahu wa Ta'aala bersumpah dengan kitab yang menerangkan dan menyebutkan secara mutlak “menerangkan” namun tidak menyebutkan menerangkan apa, untuk menunjukkan bahwa Al Qur’an menerangkan semua yang dibutuhkan hamba baik yang terkait dengan urusan dunia, agama maaupun akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 2",
    "description": "Demi al-kitab, demikian Allah bersumpah yang diturunkan kepada nabi Muhammad, yaitu al-quran yang nyata bersumber dari Allah, nyata ke istimewaannya, dan nyata uraian-uraiannya sehingga menjadi petunjuk bagi manusia. 3. Sesungguhnya kami menjadikannya, yaitu kitab yang nyata itu, sebagai Al-Qur'an, yaitu bacaan dalam bahasa arab agar kamu mengerti pesan-pesannya dengan menggunakan akalmu."
  }
]