[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik dari kaum quraisy itu berkata ”kalau Allah yang maha pengasih menghendaki, niscaya kami tidak menyembah seseorang dari makhluk-Nya. ini adalah hujjah yang batil, Allah telah menegakkan hujjah atas manusia dengan mengutus para rasul dan menurunkan kitab-kitab mereka. Hakikatnya mereka tidak memiliki ilmu tentang apa yang mereka katakan, akan tetapi mereka mengucapkannya hanya sebatas dugaan dan kebohongan, karena dalam hal ini mereka tidak memiliki bukti dan informasi dari Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan mereka berkata sambil berdalih dengan takdir, “Jika Allah berkehendak kami tidak menyembah Malaikat, niscaya kami tidak akan menyembah mereka. Jadi kehendak Allah atas diri kami itu merupakan tanda keridaan-Nya.” Ucapan mereka itu sama sekali tidak didasari ilmu dan sesungguhnya mereka hanyalah mendustakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-22. Mereka juga membuat kedustaan dengan berkata: “Seandainya Allah menghendaki, niscaya kami tidak akan menyembah sekutu-sekutu itu.” Mereka sama sekali tidak memiliki bukti atas perkataan ini, tidak lain mereka sedang berdusta. Apakah Kami menurunkan suatu kitab sebelum al-Qur’an kepada orang-orang musyrik itu, yang mereka jadikan pegangan dalam beramal? Mereka sama sekali tidak mendatangkan bukti atas apa yang mereka katakan; bahkan mereka mengakui hanya mengikuti kepercayaan dan kekafiran nenek moyang mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَقَالُوا۟ لَوْ شَآءَ الرَّحْمٰنُ مَا عَبَدْنٰهُم ۗ (Dan mereka berkata: “Jikalau Allah Yang Maha Pemurah menghendaki tentulah kami tidak menyembah mereka (malaikat)”) Yakni orang-orang kafir berkata: “hai orang-orang beriman, jika Allah menghendaki agar kami tidak menyembah para malaikat itu niscaya kami tidak akan menyembah mereka.” Ini merupakan perkataan yang benar namun bertujuan untuk sesuatu yang batil, sebab dengan perkataan itu mereka ingin menyatakan bahwa Allah meridhai penyembahan mereka terhadap berhala-berhala. مَّا لَهُم بِذٰلِكَ مِنْ عِلْمٍ ۖ( Mereka tidak mempunyai pengetahuan sedikitpun tentang itu) Yakni mereka mengira bahwa jika Allah menghendaki susuatu berarti Allah meridhainya. إِنْ هُمْ إِلَّا يَخْرُصُونَ(mereka tidak lain hanyalah menduga-duga belaka) Yakni tidak lain mereka hanya berdusta dalam perkataan mereka dan ingin membuat tipu daya. Karena Allah menciptakan orang beriman dan orang kafir, namun Allah mencintai orang beriman dan memurkai orang kafir, serta Allah memerintahkan kepada kebenaran keimanan, dan kebaikan, namun Allah tidak meridhai kekafiran dari hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Orang-orang musyrik berkata: “Jika sang Maha Pengasih (sebagaimana yang kalian klaim wahai orang-orang mukmin) berkehendak, maka kami tidak akan menyembah malaikat” Maknanya adalah mereka beranggapan bahwa peribadatan itu atas kehendak dan ridha Allah. Apa yang mereka anggap itu bukanlah bukti ilmiah yang dapat diterima. Tidaklah mereka kecuali hanya pendusta. {Min} dalam firmanNya {Min ‘ilmin} menunjukkan keumuman sesuatu setelahnya dan (in) pada kalimat {In Hum} adalah huruf yang bermakna nafi (maa nafi)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Sekiranya Dzat Yang Maha Pengasih menghendaki, sungguh kami tidak menyembah mereka” Mereka tidak mempunyai pengetahuan sedikit pun tentang itu. Mereka hanyalah menduga-duga} berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Allah befiman “dan mereka berkata, ’jikalau Allah yang maha pemurah menghendaki, tentulah kami tidak menyembah mereka (malaikat)’.”mereka berhujjah atas penyembahan mereka terhadap paara malaikat dengan kehendak.itukah hujjah yang tetap saja didengung-dengungkan oleh orang-orang musyrik yang merupakan hujjah batil dengan sendirinya secara logis dan syariat. semua orang yang berakal tidak menerima hujjah takdir, dan andai yang bersangkutan menempuh diantara salah satu kondisinya, pasti pendirian mereka tidak kuat. Dan secara syariat Allah tidak membenarkan berhujjah dengan takdir dan tidak menyebutnya dari selain orang-orang yang menyekutukanNya dan mendustakan rasulNYa. Allah telah menegakkan hujjah atas para hamba sehingga tidak tersisa satu hujjah pun bagi setiap orang.karena itu Allah berfirman,”mereka tidak mempunyai pengetahuan sedikitpun tentang itu, mereka tidak lain hanyalah menduga-duga belaka,” yaitu hanya menduga tanpa didasari dalil dan hanya serampangan saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 20: (Dan mereka berkata, \"Jika Allah Yang Maha Pemurah menghendaki tentulah kami tidak menyembah mereka\") tidak menyembah malaikat; maka ibadah atau penyembahan kami kepada mereka berdasarkan kehendak dari-Nya, Dia rela kami melakukan hal itu. Lalu Allah berfirman, \"(Tiadalah bagi mereka tentang hal itu) yakni dugaan mereka yang mengatakan bahwa Allah rela mereka menyembah malaikat (suatu pengetahuan pun, tidak lain) tiada lain (mereka hanya menduga-duga belaka) hanya berdusta belaka tentang itu, karenanya mereka harus menerima siksaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka ketika menyembah para malaikat berhujjah dengan kehendak Allah; hujjah yang senantiasa dipakai orang-orang musyrik, hujjah yang batil dengan sendirinya secara akal maupun syara’. Semua orang yang berakal tidak akan menerima berhujjah dengan qadar, dan jika tetap dilakukannya, maka pendiriannya tidak akan teguh karena Allah Subhaanahu wa Ta'aala telah memberikan kekuasaan kepada mereka untuk memilih jalan yang benar dan jalan yang salah, dan Dia telah menegakkan hujjah dengan mengutus Rasul-Nya untuk menerangkan jalan yang benar, tetapi mereka malah memilih jalan yang salah dengan kesadaran mereka. Adapun secara syara’ adalah karena Allah Subhaanahu wa Ta'aala membatalkan berhujjah dengannya, Dia telah menegakkan hujjah sehingga tidak ada hujjah bagi seorang pun terhadapnya. Oleh karena itu Dia berfirman, “Mereka tidak mempunyai ilmu tentang itu. Tidak lain mereka hanyalah menduga-duga belaka.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 20",
    "description": "Dan hal yang lebih buruk lagi dari sikap mereka adalah ketika mereka berkata, 'sekiranya Allah yang maha pengasih menghendaki agar kami tidak menyembah para malaikat-malaikat itu, tentulah kami tidak menyembah mereka. ' mereka, orang-orang musyrik yang menyatakan bahwa para malaikat itu berjenis kelamin perempuan, tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka dan mengada-ada, bahkan mereka berbohong. 21. Atau kalau mereka tidak pernah menyaksikan penciptaan para malaikat dan menyaksikan wujudnya, apakah pernah kami berikan informasi atau pengetahuan yang menjelaskan mengenai hal itu melalui sebuah kitab yang diturunkan kepada mereka sebelumnya, yaitu sebelum Al-Qur'an diturunkan, lalu mereka berpegang teguh dengannya, yaitu dengan informasi di dalam kitab itu' sama sekali tidak. Mereka tidak pernah memiliki informasi mengenai hal itu."
  }
]