[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka menghadiri penciptaan malaikat atau apakah Kami memberi mereka sebuah kitab sebelum al-qur’an yang Kami turubkan sehingga mereka berpegang kepadanya dan mengamalkan isinya, lalu merekapun berhujjah atasmu wahai rasul?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Ataukah Kami pernah memberikan kepada orang-orang musyrik satu kitab sebelum turunnya Al-Qur`ān yang membolehkan ibadah kepada selain Allah, dan mereka memegang teguh kitab itu serta berdalih dengannya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. أَمْ ءَاتَيْنٰهُمْ كِتٰبًا مِّن قَبْلِهِۦ (Atau adakah Kami memberikan sebuah kitab kepada mereka sebelum Al Quran) Yakni ataukan Kami berikan suatu kitab sebelum al-Qur’an yang tercantum di dalamnya “Sembahlah selain Allah”? فَهُم بِهِۦ مُسْتَمْسِكُونَ(lalu mereka berpegang dengan kitab itu?) Yakni kitab yang mereka jadikan sebagai pegangan dan bukti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Ataukah kami telah menurunkan bagi mereka kitab sebelum Al-Qur’an yang menguatkan ucapan mereka dan mengijinkan mereka untuk menyembah berhala, sehingga mereka berpegang teguh dengan kitab itu, mengerjakan apa yang ada di dalamnya dan menggunakannya untuk berhujjah. Maksudnya adalah bahwa Allah tidak melakukan demikian itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kami pernah memberikan mereka kitab sebelumnya} sebelum Al-Qur’an ini {lalu mereka berpegang teguh padanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. selanjutnya Allah berfiman,”atau adakah kami memberikan sebuah kitab kepada mereka sebelum al-qur’an lalu mereka berpegang dengan kitab itu?” artinya, seakan Allah memberitahu mereka benarnya tindakan serta perkataan meeka. Tapi sama sekali tidak demikian, karena Allah telah mengutus Muhammad sebagai pemberi kabar ancaman kepada mereka dan tidak ada orang lain yang memberi peringatan selainn beliau. Mereka tidak memilki dalil aqli dan naqli. Ketika kedua dalil tersebut tidak ada, berarti yang ada hanya kebatilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 21: (Atau adakah Kami memberikan sebuah Kitab kepada mereka sebelumnya) sebelum Alquran yang di dalamnya terdapat anjuran untuk menyembah selain Allah (lalu mereka berpegang dengan kitab itu?) hal tersebut tentu saja tidak akan terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang memberitakan benarnya perbuatan dan ucapan mereka. Bahkan tidak demikian, sesungguhnya Allah telah mengutus Muhammad shallallahu 'alaihi wa sallam sebagai pemberi peringatan kepada mereka, sedangkan mereka sebelumnya tidak didatangi oleh pemberi peringatan. Dengan demikian, akal dan naql (kitab) tidak membenarkan perbuatan mereka, sehingga tidak ada lagi setelahnya selain kebatilan. Ya memang, mereka punya alasan, yang bukan hujjah, tetapi syubhat, dimana syubhat itu adalah syubhat yang paling lemah, yaitu mengikuti nenek moyang mereka yang sesat, dimana orang-orang kafir sejak dulu biasa menolak rasul karena alasan mengikuti nenek moyang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 21",
    "description": "Atau kalau mereka tidak pernah menyaksikan penciptaan para malaikat dan menyaksikan wujudnya, apakah pernah kami berikan informasi atau pengetahuan yang menjelaskan mengenai hal itu melalui sebuah kitab yang diturunkan kepada mereka sebelumnya, yaitu sebelum Al-Qur'an diturunkan, lalu mereka berpegang teguh dengannya, yaitu dengan informasi di dalam kitab itu' sama sekali tidak. Mereka tidak pernah memiliki informasi mengenai hal itu. 22. Bahkan setelah kehabisan alasan dan dalih atas kesesatan mereka, mereka berkata, 'sesungguhnya kami mendapati nenek moyang dan leluhur kami menganut suatu agama, yakni suatu keyakinan dan kepercayaan yang patut kami ikuti dan teladani, dan sesungguhnya kami mendapat petunjuk untuk mengikuti jejak mereka. '."
  }
]