[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebaliknya mereka berkata, ”sesungguhnya kami mendapati nenek moyang kami berjalan di atas sebuah jalan, ajaran dan agama, dan sesungguhnya kami hanya mengikuti dan meneladani jejak nenek moyang kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Tidak, hal itu tidak pernah terjadi, akan tetapi mereka berucap dengan berdalih taklid, “Kami mendapati bapak-bapak kami menganut suatu agama dan syariat, mereka dahulu menyembah berhala, dan kami mengikuti jejak mereka dalam menyembah berhala.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. بَلْ قَالُوٓا۟ إِنَّا وَجَدْنَآ ءَابَآءَنَا عَلَىٰٓ أُمَّةٍ (Bahkan mereka berkata: “Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama) Yakni di atas suatu kebiasaan dan cara yang mereka pakai dalam menyembah berhala-berhala ini. وَإِنَّا عَلَىٰٓ ءَاثٰرِهِم مُّهْتَدُونَ(dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka”) Mereka mengakui tidak memiliki landasan, alasan, dan syubhat di tangan mereka, dan mereka hanya mengikuti kesesatan nenek moyang mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Bahkan orang-orang musyrik itu berkata ketika hujjah mereka gagal: “Sesungguhnya kami mendapati leluhur kami berada dalam agama, kepercayaan dan adatnya. Atas warisan mereka, kami adalah orang-orang yang diberi petunjuk dalam jalan kami. Maknanya, kami mengikuti jalan leluhur kami dan menjalani ajaran mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan mereka berkata,“Sesungguhnya kami telah mendapati nenek moyang kami menganut suatu agama} kepercayaan dan agama {dan kami hanya mengikuti jejak mereka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. ya, mereka memiliki syubhat yang paling lemah, yaitu hanya mengikuti nenek moyang mereka sesat. Mereka adalah orang-orang yang selalu menentang seruan para rasul karena mengikuti nenek moyang mereka. Karena itu dalam ayat ini Allah berfirman,”bahkan mereka berkata,’sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama’.” Yaitu berada diatas ajaran dan aliran,”dan sesungguhnya kami adalah orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka,” karena itu, kami tidak mengikuti agama yang dibawa Muhammad."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 22: (Bahkan mereka berkata, 'Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama) yang diyakininya (dan sesungguhnya kami) berjalan atau mengikuti (jejak-jejak mereka sebagai petunjuk kami')\" dan bapak-bapak kami itu menyembah selain Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 22",
    "description": "Bahkan setelah kehabisan alasan dan dalih atas kesesatan mereka, mereka berkata, 'sesungguhnya kami mendapati nenek moyang dan leluhur kami menganut suatu agama, yakni suatu keyakinan dan kepercayaan yang patut kami ikuti dan teladani, dan sesungguhnya kami mendapat petunjuk untuk mengikuti jejak mereka. ' 23. Dan apa yang dikatakan oleh kaum musyrik mekah kepadamu sekarang, wahai nabi Muhammad, demikian juga yang dikatakan oleh umat-umat terdahulu ketika kami mengutus seorang pemberi peringatan, yaitu nabi atau rasul sebelum engkau diutus, dalam suatu negeri di lokasi mana pun di bumi ini, orang-orang yang hidup mewah secara durhaka di masing-masing negeri itu selalu berkata, 'sesungguhnya kami mendapati nenek moyang kami yang juga orang-orang terkemuka dan paham menganut suatu agama, yakni kepercayaan yang mereka yakini benar dan sesungguhnya kami tidak lain, kecuali sekadar pengikut-pengikut yang mengikuti jejak-jejak mereka. '."
  }
]