[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "dan begitu juga Kami tidak mengutus seorang pemberi peringatan sebelummu (wahai rasul) pada sebuah negeri, lalu dia memperingatkan penduduknya terhadap hukuman Kami atas kekafiran mereka, dia memerintahkan mereka agar mewaspadai dan berhati-hati terhadap murka dan azab Kami, kecuali para pemuka dan pemimpin mereka yang bergelimang kenikmatan berkata, ”sesunggguhnya kami mendapati leluhur kami di atas suatu ajaran dan agama, dan sesungguhnya kami hanya mengikuti dan meneladani manhaj dan jejak mereka. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sebagaimana mereka telah berbuat dusta, mereka berdalih dengan taklid terhadap bapak-bapak mereka. Kami tidak pernah mengutus sebelummu -wahai Rasul- kepada suatu negeri seorang rasul yang memberi peringatan kepada kaumnya kecuali para pembesar di negeri itu berkata, “Sesungguhnya kami mendapati bapak-bapak kami menganut satu agama dan sesungguhnya kami mengikuti jejak mereka.” Jadi kaummu bukan yang pertama yang melakukan hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Sebagaimana orang-orang kafir itu mengikuti nenek moyang mereka tanpa memiliki alasan, demikian pula yang dilakukan umat-umat yang mendustakan sebelum mereka. Hai Rasulullah, Tidaklah Kami mengutus pemberi peringatan sebelummu melainkan orang-orang yang angkuh dan hidup dalam kemewahan akan berkata: “Kami mendapat nenek moyang kami berada di atas suatu agama, dan kami akan mengikuti jalan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَإِنَّا عَلَىٰٓ ءَاثٰرِهِم مُّقْتَدُونَ (dan sesungguhnya kami adalah pengikut jejak-jejak mereka”) Allah hanya menyebutkan orang-orang yang bermewah-mewah sebagai peringatan bahwa hidup bermewah-mewah merupakan sebab kelalaian dari melihat dan memikirkan kandungan risalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Seperti halnya orang-orang musyrik yang membenarkan kesyirikan, orang-orang yang hidup mewah dan penuh nikmat, yaitu para pemimpin dan orang-orang sombong dari umat-umat terdahulu yang mendapat kiriman para rasul juga berkata: “Sesungguhnya kami mendapati leluhur kami berada di jalan dan agama yang diwariskan, sedangkan kami berjalan mengikuti jalan mereka” Ayat ini diturunkan untuk Walid bin Mughirah, Abu Sufyan, Abu Jahal, ‘Utbah, dan Syaibah bin Rabi’ah dari suku Quraisy. Apa yang diucapkan mereka juga diucapkan umat sebelum mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah ketika Kami mengutus seorang pemberi peringatan sebelum kamu ke suatu negeri. Orang-orang yang hidup mewah} orangorang yang diberi nikmat {selalu berkata,“Sesungguhnya kami mendapati nenek moyang kami menganut suatu dan kami hanya mencontoh jejak mereka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “dan demikianlah, kami tidak mengutus sebelum kamu seorang pemberi peringatan pun dalam suatu negeri, melainkan orang-orang yang hidup mewah dinegeri itu berkata,” yaitu orang-orang yang hidup mewah dan para pembesar yang dibuat angkuh oleh dunia dan tertipu karena harta, serta merasa tinggi hati terhadap kebenaan, “sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama dan sesungguhnya kami adalah pengikut jejak-jejak mereka.” Artinya, mereka itu bukanlah orang-orang pertama dan mereka bukanlah orang yang pertama kali mengucapkan kata-kata itu. Inilah hujjah yang orang-orang musyrik yang sesat karena mengikuti nenek moyang mereka yang sesat. Mereka tidak bermaksud mengikuti kebenaran dan petunjuk, tapi hanya karena rasa fanatisme semata yang dimaksud untuk menolong kebatilan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 23: (Dan demikianlah Kami tidak mengutus sebelum kamu seorang pemberi peringatan pun dalam suatu negeri, melainkan orang-orang yang hidup mewah di negeri itu berkata) yakni mereka yang bergelimang di dalam kemewahan hidup pasti mengatakan sebagaimana apa yang telah dikatakan oleh kaummu, (\"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama) suatu tuntunan (dan sesungguhnya kami adalah pengikut jejak-jejak mereka\") mengikuti jejak-jejak mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, mereka bukanlah orang pertama yang menolak rasul dengan alasan mengikuti nenek moyang, dan mereka bukanlah orang yang pertama mengucapkan kata-kata itu. Berhujjahnya mereka (kaum musyrik) dengan mengikuti nenek moyang mereka bukanlah tujuannya mengikuti yang hak dan mengikuti petunjuk, ia hanyalah sebatas fanatik yang maksudnya membela kebatilan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 23",
    "description": "23. Dan apa yang dikatakan oleh kaum musyrik mekah kepadamu sekarang, wahai nabi Muhammad, demikian juga yang dikatakan oleh umat-umat terdahulu ketika kami mengutus seorang pemberi peringatan, yaitu nabi atau rasul sebelum engkau diutus, dalam suatu negeri di lokasi mana pun di bumi ini, orang-orang yang hidup mewah secara durhaka di masing-masing negeri itu selalu berkata, 'sesungguhnya kami mendapati nenek moyang kami yang juga orang-orang terkemuka dan paham menganut suatu agama, yakni kepercayaan yang mereka yakini benar dan sesungguhnya kami tidak lain, kecuali sekadar pengikut-pengikut yang mengikuti jejak-jejak mereka. '24. Apa yang dikatakan oleh umat-umat terdahulu itu dijawab oleh para rasul utusan Allah itu dengan mengatakan, 'dan apakah kamu akan mengikutinya juga sekalipun aku membawa untukmu agama, yakni keyakinan dan kepercayaan, yang lebih baik daripada apa yang kamu peroleh dari agama dan kepercayaan yang dianut nenek moyangmu dahulu'' dengan sikap menentang, mereka menjawab, 'sesungguhnya kami mengingkari agama yang kamu diperintahkan untuk menyampaikannya. '."
  }
]