[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Muhammad dan para rasul yang mendahuluinya berkata kepada orang-orang yang menyangkalnya dengan syubhat batil ini, ”apakah kalian akan tetap mengikuti nenek moyang kalian sekalipun aku telah datang kepada kalian dengan membawa sesuatu dari sisi tuhan kalian yang lebih membingbing ke jalan yang benar dan lebih menunjukan jalan yang lurus dari pada agama dan ajaran yang kalian warisi dari nenek moyang kalian?” Mereka menjawab dengan penuh pengingkaran, Sesunggguhnya kami tetap ingar dan kafir kepada apa yang kalian diutus dengannya. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Rasul mereka berkata kepada mereka, “Apakah kalian akan tetap mengikuti bapak-bapak kalian jika aku mendatangkan kepada kalian apa yang lebih baik daripada agama yang mereka anut?” Mereka menjawab, “Kami kafir terhadap ajaran risalahmu dan para rasul sebelummu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-25. Allah mengabarkan bahwa Nabi Muhammad dan Rasul-Rasul sebelumnya telah mengingkari orang-orang kafir yang mengikuti kekafiran nenek moyang mereka. Para rasul itu telah datang dengan membawa hidayah dari Allah, akan tetapi orang-orang kafir itu tetap berada dalam kesesatan mereka dan berkata, ‘Kami mengingkari risalah yang kalian bawa.’ Maka Kami membinasakan mereka. Hai Rasulullah, bagaimana kesudahan orang-orang yang mendustakan Allah dan para rasul-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. قٰلَ أَوَلَوْ جِئْتُكُم بِأَهْدَىٰ مِمَّا وَجَدتُّمْ عَلَيْهِ ءَابَآءَكُمْ ۖ ((Rasul itu) berkata: “Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih (nyata) memberi petunjuk daripada apa yang kamu dapati bapak-bapakmu menganutnya?”) Yakni rasul mereka mengatakan kepada mereka: “Apakah kalian tetap mengikuti nenek moyang mereka meskipun aku telah mendatangkan kepada kalian agama yang lebih dapat memberi petunjuk daripada agama nenek moyang kalian?”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Rasul mereka berkata: “Apakah kalian akan tetap mengikuti agama leluhur kalian meskipun aku telah mendatangkan agama yang menunjukkan kepada jalan kebenaran dari agama leluhur kalian?” Mereka berkata: “Sesungguhnya kami menolak apa yang diperintahkan untukmu. Kami tidak akan mengimani dan mengamalkannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Apakah sekalipun aku datang kepada kalian dengan sesuatu yang lebih baik panduannya daripada apa yang kalian peroleh dari nenek moyang kalian. Mereka menjawab,“Sesungguhnya kami terhadap apa diutus kepadamu adalah orang-orang yang ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. karena itu, setiap rasul menanggapi orang yang menentangnya dengan syubhat batil dengan,”berkata,’apakah (kmau akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih (nyata) memberikan petunjuk daripada apa yang kamu dapati bapak-bapakmu menganutnya’,” yaitu, maukah kalian mengikuti demi petunjuk? “mereka menjawab, ’sesungguhnya kami mengingkari agama yang kamu diutus untuk menyampaikannya,” berdasar tanggapan mereka itu dapat diketahui bahwa mereka tidak ingin mengikuti kebenaran dan petunjuk tapi hanya ingin mengikuti kebatilan dan kemauan hawa nafsu mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 24: (Rasul itu berkata) kepada mereka, (\"Apakah) kalian akan mengikutinya juga (sekalipun aku membawa untuk kalian agama yang lebih nyata memberi petunjuk daripada apa yang kalian dapati bapak-bapak kalian menganutnya?\" Mereka menjawab, \"Sesungguhnya kami terhadap agama yang kamu diutus untuk menyampaikannya) yaitu yang disampaikan oleh kamu dan oleh rasul-rasul yang sebelum kamu (adalah orang-orang yang ingkar\") maka Allah berfirman seraya mengancam mereka melalui firman selanjutnya:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari sini diketahui, bahwa mereka tidak ingin mengikuti yang hak dan mengikuti petunjuk, maksud mereka adalah mengikuti yang batil dan hawa nafsu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 24",
    "description": "Apa yang dikatakan oleh umat-umat terdahulu itu dijawab oleh para rasul utusan Allah itu dengan mengatakan, 'dan apakah kamu akan mengikutinya juga sekalipun aku membawa untukmu agama, yakni keyakinan dan kepercayaan, yang lebih baik daripada apa yang kamu peroleh dari agama dan kepercayaan yang dianut nenek moyangmu dahulu'' dengan sikap menentang, mereka menjawab, 'sesungguhnya kami mengingkari agama yang kamu diperintahkan untuk menyampaikannya. '25. Lalu, akibat dari keyakinan dan kepercayaan mereka yang salah dan penentangan terhadap apa yang dibawa oleh para rasul itu, kami binasakan mereka dengan berbagai macam siksaan. Maka perhatikanlah, wahai Muhammad atau siapa pun yang mau memperhatikan dan mengambil pelajaran, bagaimana kesudahan orang-orang terdahulu yang mendustakan kebenaran yang dibawa oleh para rasul itu."
  }
]