[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami membalas umat-umat yang mendustakan para rasul tersebut dengan menumpahkan hukuman kepada mereka berupa pembenaman (kedalam bumi), penenggelam (dilaut) dan lainnya. maka perhatikanlah (wahai rasul) bagaimana akibat dari kehidupan mereka saat mereka mendustakan ayat-ayat Allah dan para utusanNYa?. hendaknya kaummu juga waspada sehingga mereka tidak bersikukuh di atas sikap mendustakan yang mereka lakukan, akibatnya mereka akan ditimpa apa yang telah menimpa umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Maka Kami membalas umat-umat yang mendustakan para rasul sebelummu dan Kami binasakan mereka, maka perhatikanlah bagaimana kesudahan dari orang-orang yang mendustakan para rasul mereka. Kesudahan mereka itu merupakan kesudahan yang menyakitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. فَانتَقَمْنَا مِنْهُمْ ۖ (Maka Kami binasakan mereka) Dengan azab yang Allah timpakan kepada mereka, sebagaimana yang Allah timpakan kepada kaum Nabi Nuh, ‘Aad, dan Tsamud. فَانظُرْ كَيْفَ كَانَ عٰقِبَةُ الْمُكَذِّبِينَ(maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan itu) Dari umat-umat tersebut, sebab bekas-bekas peninggalan mereka masih tersisa yang nampak bagi orang-orang yang mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Kami membalas para pendusta rasul sebelum kamu dengan memberi mereka hukuman dan membinasakan mereka. Maka lihatlah wahai rasulallah bagaimana akhir dari para pendusta itu. Hal itu merupakan pelajaran bagi orang yang berpikir."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu kami membinasakan mereka. Maka perhatikanlah bagaimana kesudahan} akhir {orang-orang yang mendustakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. “maka kami binasakan mereka,” karena sikap mendustakan dan penentangan mereka terhadap kebenaran dengan syubhat batil itu.”maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan itu,” maka hendaklah mereka itu waspada agar tidak terus mendustakan agar mereka tidak tertimpa sebagaimana yang pernah menimpa orang-orang sebelum mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 25: (Maka Kami binasakan mereka) orang-orang yang mendustakan rasul-rasul sebelum kamu itu (maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan itu)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena pendustaan mereka terhadap yang hak dan penolakan mereka kepadanya dengan syubhat yang batil ini. Oleh karena itu, hendaknya mereka ini takut jika terus menerus mendustakan akan ditimpa hal yang sama seperti yang menimpa generasi sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 25",
    "description": "Lalu, akibat dari keyakinan dan kepercayaan mereka yang salah dan penentangan terhadap apa yang dibawa oleh para rasul itu, kami binasakan mereka dengan berbagai macam siksaan. Maka perhatikanlah, wahai Muhammad atau siapa pun yang mau memperhatikan dan mengambil pelajaran, bagaimana kesudahan orang-orang terdahulu yang mendustakan kebenaran yang dibawa oleh para rasul itu. 26-27. Dan ingatlah ketika nabi ibrahim, nenek moyang mereka yang tidak mau mengikuti jejak buruk dari leluhurnya, berkata kepada ayah-Nya dan kaumnya yang menyekutukan Allah dan menyembah berhala-berhala, 'sesungguhnya aku berlepas diri dari apa, yaitu berhala-berhala, yang kamu sembah, kecuali yang kamu sembah itu adalah Allah, tuhan yang telah menciptakan aku, menciptakan kalian, dan apa yang kamu sembah itu; karena sesungguhnya dia pulalah yang akan memberi petunjuk kepadaku untuk kebahagiaan hidup di dunia dan akhirat. '."
  }
]