[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai rasul) saat ibrahim berkata kepada bapaknya dan kaumnya yang mana mereka menyembah apa yang disembah oleh kaummu, ”sesunggguhnya aku berlepas diri dari apa yang kalian sembah selain Allah”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Ingatlah -wahai Rasul- ketika Ibrahim berkata kepada ayahnya dan kaumnya, “Sesungguhnya aku berlepas diri dari berhala-berhala yang kalian sembah selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-28. Hai Rasulullah, sebutkanlah kisah ketika Ibrahim berkata kepada ayahnya, Azar dan kaumnya: “Aku berlepas diri dari patung-patung dan berhala-berhala yang kalian sembah selain Allah. Namun Tuhan yang telah menciptakanku dan menunjukkanku jalan kebenaran yang aku sembah.” Ibrahim menjadikan kalimat tauhid ‘Laa ilaaha illa Allah’ tetap ada pada keturunannya, agar mereka kembali kepada ketaatan dan keesaan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَإِذْ قَالَ إِبْرٰهِيمُ لِأَبِيهِ وَقَوْمِهِۦٓ (Dan ingatlah ketika Ibrahim berkata kepada bapaknya dan kaumnya) Yakni orang-orang yang mengikuti nenek moyang mereka dan menyembah berhala-berhala. إِنَّنِى بَرَآءٌ مِّمَّا تَعْبُدُونَ(Sesungguhnya aku tidak bertanggung jawab terhadap apa yang kamu sembah) Yakni berlepas diri dari berhala-berhala tersebut, aku tidak menyembah atau memohon kepadanya dan tidak pula menjadikannya tuhan-tuhan. Namun aku mengingkari dan memusuhi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Ingatlah wahai nabi ketika Ibrahim berkata kepada ayah dan kaumnya yang menyembah patung dan berhala: “Sesungguhnya aku berlepas diri dari berhala yang kalian sembah ini. Dari awal aku tidap pernah menyembah dan dekat-dekat dengannya”. Bentuk mufrad, jamak, mudzakar, dan muanats kata {Baraa’un} sama."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Ibrahim berkata kepada ayah dan kaumnya,“Sesungguhnya aku berlepas diri} berlepas diri {dari apa yang kalian sembah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah mengabarkan tentang agama Nabi Ibrahim, kekasih dekat Allah agama yang diklaim oleh ahli kitab dan orang-orang musyrik sebagai agama mereka, di mana masing-masing mengklaim berada di atas agama Ibrahim. Allah memberitahukan tentang agama Ibrahim yang diwariskan pada keturunannya, maka FirmanNya, ”dan ingatlah ketika Ibrahim berkata kepada bapaknya dari kaumnya,”yaitu orang-orang yang menyembah tuhan-tuhan lain bersama Allah, mereka menyembah dan mendekatkan diri kepada mereka, “sesungguhnya aku anti terhadap apa yang kamu sembah,” yakni,membenci, menjauhi dan menentang para penganutnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 26: (Dan) ingatlah (ketika Ibrahim berkata kepada bapaknya dan kaumnya, \"Sesungguhnya aku tidak bertanggung jawab) atau berlepas diri (terhadap apa yang kalian sembah.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang agama Nabi Ibrahim ‘alaihis salam, dimana orang-orang Ahli Kitab dan kaum musyrik menisbatkan diri kepada Beliau, dan masing-masing mereka menyangka bahwa mereka berada di atas jalan Beliau, maka dalam ayat ini Allah Subhaanahu wa Ta'aala memberitahukan tentang agama Beliau yang diwariskannya kepada anak cucunya. Di antara mufassir ada yang berpendapat bahwa yang dimaksud dengan Abiihi (bapaknya) ialah pamannya. Ayah dan kaumnya menyembah selain Allah Subhaanahu wa Ta'aala. Maksudnya, Nabi Ibrahim ‘alaihis salam tidak menyembah berhala-berhala yang disembah kaumnya, membencinya, menjauhinya dan memusuhi orang-orang yang menyembahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 26",
    "description": "26-27. Dan ingatlah ketika nabi ibrahim, nenek moyang mereka yang tidak mau mengikuti jejak buruk dari leluhurnya, berkata kepada ayah-Nya dan kaumnya yang menyekutukan Allah dan menyembah berhala-berhala, 'sesungguhnya aku berlepas diri dari apa, yaitu berhala-berhala, yang kamu sembah, kecuali yang kamu sembah itu adalah Allah, tuhan yang telah menciptakan aku, menciptakan kalian, dan apa yang kamu sembah itu; karena sesungguhnya dia pulalah yang akan memberi petunjuk kepadaku untuk kebahagiaan hidup di dunia dan akhirat. '26-27"
  }
]