[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecualii Allah yang telah menciptakanku, Dia akan membimbingku untuk mengikuti jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kecuali Allah Yang telah menciptakanku, sesungguhnya Dia memberiku petunjuk kepada apa yang bermanfaat bagiku dalam mengikuti agama-Nya yang lurus.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. إِلَّا الَّذِى فَطَرَنِى (tetapi (aku menyembah) Tuhan Yang menjadikanku) Dan aku mengakui ketuhanan-Nya, dan kepada-Nya aku menyembah dan meminta, bukan kepada selain-Nya. فَإِنَّهُۥ سَيَهْدِينِ(karena sesungguhnya Dia akan memberi hidayah kepadaku”) Yakni akan memberiku petunjuk kepada agama-Nya serta meneguhkanku di atas kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Akan tetapi (Aku menyembah) Dzat yang menciptakanku yaitu Allah. Dialah Dzat yang aku sembah dan tempat aku berdoa, bukan kepada selainNya. Dialah Dzat yang akan membimbingku menuju agama yang benar dan meneguhkanku atas agama itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali Dzat yang menciptakanku} menciptakanku {Sesungguhnya Dia akan memberi petunjuk kepadaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “tetapi (aku menyembah Rabb) yang menjadikanku,” aku menjadikanNYa sebagai pelindung dan aku mengharap agar Dia memberi petunjuk kepadaku ilmu danmengamalkan kebenaran. Sebagaimana Dia menciptakanku dan mengaturku dengan apa-apa yang menjadikan agama dan duniaku menjadi baik, Dia juga akan memberi petunjuk untukku kepada apa-apa yang menjadikan agama dan akhiratku baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 27: (Tetapi aku menyembah Tuhan Yang menjadikanku) menyembah Allah yang telah menciptakan aku (karena sesungguhnya Dia akan memberi taufik kepadaku\") artinya Dia pasti membimbingku kepada agama-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dialah yang aku sembah. Yakni aku berharap Dia memberiku petunjuk kepada ilmu terhadap yang hak dan mengamalkannya. Sebagaimana Dia telah menciptakanku dan mengurusku dengan sesuatu yang memperbaiki fisik dan duniaku, maka Dia akan menunjuki pula aku terhadap hal yang bermaslahat bagi agamaku dan akhiratku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 27",
    "description": "26-27. Dan ingatlah ketika nabi ibrahim, nenek moyang mereka yang tidak mau mengikuti jejak buruk dari leluhurnya, berkata kepada ayah-Nya dan kaumnya yang menyekutukan Allah dan menyembah berhala-berhala, 'sesungguhnya aku berlepas diri dari apa, yaitu berhala-berhala, yang kamu sembah, kecuali yang kamu sembah itu adalah Allah, tuhan yang telah menciptakan aku, menciptakan kalian, dan apa yang kamu sembah itu; karena sesungguhnya dia pulalah yang akan memberi petunjuk kepadaku untuk kebahagiaan hidup di dunia dan akhirat. '28. Dan dia, yakni ibrahim, menjadikannya, yakni kalimat tauhid yang disampaikannya kepada kaumnya itu, kalimat yang kekal pada keturunannya sesudahnya agar mereka kembali kepada kalimat tauhid itu apabila suatu saat nanti mereka menyimpang dari jalan yang benar dengan menyekutukan Allah."
  }
]