[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ibrahim menjadikan kalimat tauhid (la ilaaha illallah) tetap tegak pada orang-orang sesudahnya, agar mereka kembali menaati tuhan mereka dan mentauhidkanNYa serta bertaubat dari kekafiran dan dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Ibrahim menjadikan kalimat tauhid \"Lā ilāha illallāh\" kekal pada anak keturunan setelahnya, sehingga di antara mereka senantiasa ada yang mengesakan Allah dan tidak menyekutukan-Nya dengan sesuatupun, dengan harapan agar mereka kembali kepada Allah dengan bertobat kepada-Nya dari kesyirikan dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَجَعَلَهَا كَلِمَةًۢ بَاقِيَةً فِى عَقِبِهِۦ (Dan (lbrahim a. s.) menjadikan kalimat tauhid itu kalimat yang kekal pada keturunannya) Yakni dan Ibrahim menjadikan ketauhidan dan kebersihan dari kemusyrikan, kokoh pada anak keturunannya sehingga akan tetap ada diantara mereka yang mengesakan Allah. Mujahid dan Qatadah mengatakan yang dimaksud adalah kalimat laailaaha illallah, akan tetap ada orang setelah Ibrahim yang menyembah Allah hingga hari kiamat. لَعَلَّهُمْ يَرْجِعُونَ(supaya mereka kembali kepada kalimat tauhid itu) Yakni Ibrahim mengokohkan kalimat tauhid itu agar menjadi tempat kembali keturunannya yang menyekutukan Allah berkat ajakan orang yang mengesakan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Nabi Ibrahim menjadikan kalimat tauhid (Laa Ilaaha Illallah) sebagai kalimat yang kekal untuk keturunannya dan mewasiati mereka dengan kalimat itu, sehingga mereka selalu mengesakan Allah, seraya berharap agar orang yang syirik dapat kembali kepada kalimat itu dan menjadi orang yang bertauhid dengan julukan golongan orang-orang yang bertauhid"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjadikannya perkataan yang kekal} Ibrahim AS menjadi kalimat tauhid menjadi perkataan yang kekal sepanjang perjalanan zaman {pada keturunannya} keturunan setelahnya {agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “dan (Ibrahim) menjadikan kalimat tauhid itu,” perkara terpuji yang merupakan induk dan atas segala perkara,yaitu memurnikan ibadah hanya untuk Allah semata dan melepaskan diri (anti) dari menyembah sesuatu pun selainNYa, sebagaimana “kalimat yang kekal pada keturununannya,” supaya mereka kembali kepada kalimat tauhid itu.” Karena masyhur dan Nabi Ibrahim dan diwasitkan kepada keturunannya dan diwasiatkan pada beberapa anaknya seperti ishaq dan ya’qub pada sebagian yang lain, senada dengan firman Allah, ”dan tidak ada yang benci kepada agama nabi Ibrahim, kecuali orang yang memperbodoh dirinya sendiri, dan sungguh kami telah memilihnya di dunia dan sesungguhnya dia diakhirat benar-benar termasuk orang yang shalih,” (al-baqarah:130)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 28: (Dan Ibrahim menjadikannya) kalimat tauhid, yang tersimpul dari perkataannya, sebagaimana yang disitir oleh firman-Nya, \"Sesungguhnya aku pergi menghadap kepada Rabbku, dan Dia akan memberi petunjuk kepadaku...\" (Q.S. Ash shaffat, 99). (sebagai kalimat yang kekal pada keturunannya) pada anak cucunya, maka tetap akan ada orang-orang yang mengesakan Allah di antara keturunannya itu (supaya mereka) penduduk Mekah (kembali) meninggalkan apa yang biasa mereka lakukan, yaitu menyembah berhala, kemudian memeluk agama bapak moyang mereka, yakni Nabi Ibrahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karena itu, senantiasa pada keturunan Beliau ada orang yang mentauhidkan Allah ‘Azza wa Jalla. Maksudnya, Nabi Ibrahim ‘alaihis salam menjadikan kalimat tauhid sebagai pegangan bagi keturunannya sehingga kalau di antara mereka ada orang yang mempersekutukan Allah agar mereka kembali kepada tauhid itu, karena sudah masyhurnya kalimat itu dari Beliau dan karena ia merupakan wasiat Beliau kepada keturunannya. Kalimat ini tetap ada pada keturunannya sampai mereka didatangi oleh kemewahan hidup dan sikap melampaui batas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 28",
    "description": "Dan dia, yakni ibrahim, menjadikannya, yakni kalimat tauhid yang disampaikannya kepada kaumnya itu, kalimat yang kekal pada keturunannya sesudahnya agar mereka kembali kepada kalimat tauhid itu apabila suatu saat nanti mereka menyimpang dari jalan yang benar dengan menyekutukan Allah. 29. Bahkan Allah menyatakan, 'aku, tuhan yang maha esa, telah memberikan kenikmatan hidup kepada mereka, yakni kaum nabi ibrahim yang menyekutukan-ku dan nenek moyang mereka yang durhaka itu dan tidak menurunkan siksaan kepada mereka semua sampai kebenaran yang mutlak yang tidak diragukan lagi kebenarannya, yaitu Al-Qur'an, datang kepada mereka dan datang pula seorang rasul, yaitu nabi Muhammad, yang memberi penjelasan. '."
  }
]