[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan aku telah memberikan kenikmatan kehidupan kepada orang-orang musyrik dari kaummu (wahai rasul), dan nenek moyang mereka, Aku tidak menyegerakan hukuman atas mereka disebabkan kekafiran mereka sebelum mereka didatangi oleh al-qur’an dan seoarng utusan yang menjelaskan apa yang mereka butuhkan terkait dengan perkara-perkara agama mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Aku tidak menyegerakan kehancuran bagi orang-orang musyrik pendusta itu, akan tetapi Aku memberikan kenikmatan hidup bagi mereka dengan tetap tinggal di dunia dan Aku beri kenikmatan kepada bapak-bapak mereka sebelum mereka hingga datang kepada mereka Al-Qur`ān dan Rasul yang memberi penjelasan, yaitu Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-32. Hai Rasulullah, orang-orang musryik dari kaummu itu tidak melaksanakan wasiat Nabi Ibrahim, tidak pula segera mendapat siksaan. Namun Aku memberikan mereka dan nenek moyang mereka berbagai kenikmatan, hingga datang kepada mereka al-Qur’an dan seorang rasul yang menjelaskan jalan petunjuk bagi mereka, rasul itu menjelaskan segala kebaikan yang harus dilakukan dan segala keburukan yang harus ditinggalkan. Dan ketika mereka mendustakan al-Qur’an dengan berkata: “Kitab yang didatangkan Muhammad ini adalah sihir, bukan wahyu dari Allah; sungguh kami mengingkarinya.” Dan mereka juga berkata: “Mengapa al-Qur’an tidak diturunkan kepada orang terpandang dari kota Makkah atau Thaif?” Maka Allah mengingkari perkataan mereka: Hai Rasulullah, Apakah mereka yang membagi rahmat Tuhanmu, sehingga mereka dapat memberi kenabian kepada yang mereka inginkan? Tidak, Kami yang membagi rezeki manusia di kehidupan dunia, Kami mengangkat derajat sebagian mereka di atas sebagian lainnya dengan menjadikan sebagiannya kaya dan sebagian lainnya miskin, agar setiap mereka saling memberi manfaat dan tolong menolong. Hai Rasulullah, rahmat Tuhanmu yang agung berupa memasukkan mereka ke dalam surga itu lebih baik daripada yang kenikmatan dunia yang mereka kumpulkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. بَلْ مَتَّعْتُ هٰٓؤُلَآءِ وَءَابَآءَهُمْ (Tetapi Aku telah memberikan kenikmatan hidup kepada mereka dan bapak-bapak mereka) Sehingga mereka terlena dengan penangguhan bagi mereka dan tenggelam di dalam syahwat. حَتَّىٰ جَآءَهُمُ الْحَقُّ(sehingga datanglah kepada mereka kebenaran) Yakni al-Qur’an. وَرَسُولٌ مُّبِينٌ (dan seorang rasul yang memberi penjelasan) Yakni Nabi Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Namun orang-orang musyrik Mekah dan para leluhur mereka itu lebih bersenang-senang dengan dunia sehinggga bertambahlah dosa mereka. Kami tidak mempercepat hukuman atas kekufuran mereka, lalu mereka tertipu tentang hal itu, sampai datanglah kepada mereka Al-Qur’an dan rasul yang menjelaskan tentang jalan petunjuk dan menampakkan risalah dengan mukjizat. Dialah Muhammad SAW."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan Aku telah memberikan kenikmatan kepada mereka} orang-orang kafir Mekkah {dan nenek moyang mereka sampai datang kepada mereka kebenaran} Al-Qur’an {beserta seorang Rasul yang memberi penjelasan} menerangkan risalah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. kalimat tauhid itu senantiasa ada pada keturunan nabi Ibrahim hingga kemewahan dan sikap melampaui batas masuk dalam diri mereka. Allah berfirman, ”tetapi aku telah memberikan kenikmatan hidup kepada mereka dan kepada bapak-bapak mereka,” dengan berbagai kesenangan hingga kesenangan menjadi tujuan dan puncak tujuan mereka, rasa cinta pada kesenangan senantiasa tumbuh di hati mereka hingga menjadi sifat lekat dan keyakinan yang mengakar,”sehingga datanglah kepada mereka kebenaran (al-qur’an),” yang tidak menyimpan keraguan dan keserupaan,”dan seorang rasul yang memberi penjelasan,” yang menjelaskan risalah. Dalil-dalil kerasulannya tegak secara nyata pada akhlak dan mukjizat-mukjizatnya serta apa yang dibawanya serta ajaran yang membenarkan para rasul yang sama dengan seruan nabi Muhammad."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 29: (Tetapi Aku telah memberikan kenikmatan hidup kepada mereka) kepada orang-orang musyrik itu (dan bapak-bapak mereka) dan Aku tidak menyegerakan hukuman-Ku kepada mereka (sehingga datanglah kebenaran kepada mereka) Alquran yang membawa kebenaran (dan seorang rasul yang memberi penjelasan) yang menampakkan kepada mereka hukum-hukum syariat, yaitu Nabi Muhammad saw."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang musyrik. Dengan berbagai kesenangan, sehingga hal itu (kesenangan) menjadi tujuan. Di antara keturunan Nabi Ibrahim ‘alaihis salam itu ada yang melupakan tauhid dan Allah tidak mengazab mereka tetapi memberikan kenikmatan dan kehidupan kepada mereka yang seharusnya mereka syukuri. Namun mereka tidak mensyukurinya, malah menuruti hawa nafsunya, karena itu Allah menurunkan Al Quran dan mengutus seorang Rasul untuk membimbing mereka dan menjelaskan hukum-hukum syar’i. Benarnya kerasulan Beliau dapat dilihat dari akhlak Beliau, mukjizatnya, apa yang Beliau bawa, Beliau membenarkan para rasul sebelumnya, dan dapat dilihat pula dari inti dakwahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 29",
    "description": "Bahkan Allah menyatakan, 'aku, tuhan yang maha esa, telah memberikan kenikmatan hidup kepada mereka, yakni kaum nabi ibrahim yang menyekutukan-ku dan nenek moyang mereka yang durhaka itu dan tidak menurunkan siksaan kepada mereka semua sampai kebenaran yang mutlak yang tidak diragukan lagi kebenarannya, yaitu Al-Qur'an, datang kepada mereka dan datang pula seorang rasul, yaitu nabi Muhammad, yang memberi penjelasan. '30. Dan ketika kebenaran, yakni Al-Qur'an, itu datang kepada mereka, dengan penuh keangkuhan, penghinaan, dan pelecehan mereka berkata, 'ini adalah sihir yang nyata dan sesungguhnya kami adalah orang-orang yang selamanya mengingkarinya. '."
  }
]