[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4 Sesungguhnya Kami menurunkan al-qur’an kepada muhammad dengan bahasa arab, agar kalian memahami dan merenungkan makna-makna dan hujjah-hujjahnya. Dan sesungguhnya ia di lauhil mahfudz di sisi Kami, benar-benar memliki kedudukan dan derajat yang tinggi, muhkam (bermakna jelas) tanpa ada perselisihan dan pertentangan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Sesungguhnya Kami menurunkan Al-Qur`ān ini dengan lisan Arab agar kalian -wahai orang-orang yang Al-Qur`ān ini diturunkan dengan lisan kalian- merenungkan dan memahami makna-maknanya untuk kalian sampaikan kepada umat yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. إِنَّا جَعَلْنٰهُ قُرْءٰنًا عَرَبِيًّا (Sesungguhnya Kami menjadikan Al Quran dalam bahasa Arab) Yakni Allah menurunkannya dengan bahasa Arab, karena setiap nabi diberi kitab dengan bahasa kaumnya. لَّعَلَّكُمْ تَعْقِلُونَ(supaya kamu memahami(nya)) Yakni Kami jadikan al-Qur’an itu berbahasa arab agar kalian dapat memahaminya hai orang-orang Arab, dan mengerti makna dan kandungannya, karena ia menggunakan bahasa yang sangat fasih yang menerangkan maksud kandungannya dan mudah dipahami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Sesungguhnya kami menciptakan Al-Qur’an dengan bahasa Arab, supaya kaliam memahami makna-maknanya dan mengetahui apa yang terkandung di dalamnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sesungguhnya Kami menjadikannya sebagai Al-Qur’an yang berbahasa Arab agar kalian mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-3. ini adalah sumpah dengan al-qur’an terhadap al-qur’an. Allah bersumpah dengan al-qur’an yang nyata secara mutlak dan tidak menyebutkan sesuatu yang dikaitkan dengannya, untuk menunjukkan bahwa al-qur’an menjelaskan segala masalah dunia-akhirat yang diperlukan para hamba. “sesungguhnya kami menjadikan al-qur’an dalam bahasa arab.” Inilah yang disumpahkan, al-qur’an dijadikan dengan bahasa yang fasih, jelas dan nyata. Dan inilah salah satu dari penjelasannya. Allah berfirman, “supaya kamu memahami(nya),” kata-kata dan maknanya agar mudah dan dekat dipendengaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 3: (Sesungguhnya Kami menjadikan Alquran) maksudnya, Kami adakan Alkitab ini (bacaan yang berbahasa Arab) atau memakai bahasa Arab (supaya kalian) hai penduduk Mekah (memahaminya) memahami makna-maknanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah isi sumpahnya, yakni Al Qur’an dijadikan dengan bahasa yang paling fasih, paling jelas, dan paling terang, dan ini di antara kejelasannya. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan hikmahnya. Baik lafaz maupun maknanya agar lebih mudah dipahami di pikiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 3",
    "description": "Sesungguhnya kami menjadikannya, yaitu kitab yang nyata itu, sebagai Al-Qur'an, yaitu bacaan dalam bahasa arab agar kamu mengerti pesan-pesannya dengan menggunakan akalmu. 4. Dan sesungguhnya dia, yaitu Al-Qur'an itu, di dalam ummul-kit'b, yaitu kitab induk atau lau' mahf'z, yang berada di sisi kami dan ia benar-benar bernilai tinggi dan penuh hikmah di dalamnya. '."
  }
]