[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika al-qur’an datang kepada mereka dari sisi Allah, mereka berkata, ”apa yang dibawa oleh utusan ini adalah sihir yang dengannya dia menyihir kami, ia bukan wahyu dari Allah, dan sesungguhnya kami mendustakannya”."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Ketika datang kepada mereka Al-Qur`ān yang merupakan kebenaran, yang tidak ada keraguan di dalamnya, mereka berkata, “Ini adalah sihir yang digunakan Muhammad untuk menyihir kami, dan sesungguhnya kami mengingkarinya dan sekali-kali tidak akan mempercayainya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Saat didatangkan kepada mereka bahwa Al-Qur’an itu dari sisi Allah, mereka berkata: “Apa yang dibawa Muhammad ini adalah sihir, bukan wahyu. Sesungguhnya kami terhadap Al-Qur’an itu adalah orang-orang yang menolak”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika datang kepada mereka kebenaran itu, mereka berkata,“Ini adalah sihir dan sesungguhnya kami mengingkarinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. “pada saat kebenaran datang pada mereka,” yang mengharuskan orang berakal dan memilki agama meski hanya sedikit untuk menerima dan tunduk padanya, “mereka berkata, ’ini adalah sihir dan sesungguhnya kami adalah orang-orang yang mengingkarinya,” dan inilah salah bentuk penentangan dan keberatan terbesar mereka. Mereka tidak hanya berpaling dari kebenaran dan mengingkarinya. Mereka belum puas hingga menuduhnya secara keji. Mereka menganggapnya sebagai sihir batil yang hanya dibawa oleh makhluk paling keji dan paling pandai berdusta. Yang mendorong mereka melakukan hal itu adalah keangkuhan mereka yang melampaui batas karena berbagai nikmat yang diberikan oleh Allah kepada mereka dan nenek moyang mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 30: (Dan tatkala kebenaran itu datang kepada mereka) yakni Alquran (mereka berkata, \"Ini adalah sihir dan sesungguhnya kami adalah orang-orang yang mengingkarinya.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dimana kebenaran itu mengharuskan orang yang memiliki akal meskipun kurang sempurna untuk menerima dan tunduk kepadanya. Ini merupakan penentangan yang paling keras, dimana mereka tidak hanya berpaling dan mengingkari, bahkan mereka belum puas sampai mencacatkan kebenaran dan memperburuk citranya dan menganggapnya sebagai sihir yang tidak dilakukan kecuali oleh orang yang paling buruk dan paling besar kedustaannya, dan yang membuat mereka begitu adalah karena sikap melampaui batas mereka karena Allah telah menganugerahkan kesenangan kepada mereka dan nenek moyang mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 30",
    "description": "Dan ketika kebenaran, yakni Al-Qur'an, itu datang kepada mereka, dengan penuh keangkuhan, penghinaan, dan pelecehan mereka berkata, 'ini adalah sihir yang nyata dan sesungguhnya kami adalah orang-orang yang selamanya mengingkarinya. '31. Dan mereka tidak hanya melecehkan Al-Qur'an, tetapi juga melecehkan nabi Muhammad dengan berkata, 'mengapa Al-Qur'an ini, yang diyakini oleh Muhammad sebagai petunjuk yang diturunkan tuhan, tidak diturunkan kepada seorang laki-laki yang agung, kaya, dan berpengaruh yang berasal dari salah satu dua negeri ini, yaitu mekah dan taif''"
  }
]