[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik dari kaum quraisy itu berakta, ”bila al-qur’an ini memang benar datang dari Allah, mengapa ia tidak turun kepada seorang laki-laki agung (pembesar) dari salah satu dari dua kota, yaitu makkah dan tha’if?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Orang-orang musyrik pendusta itu berkata, “Kenapa Allah tidak menurunkan Al-Qur`ān ini kepada salah seorang dari dua orang pembesar dari Makkah atau Ṭa`if sebagai ganti dari diturunkannya Al-Qur`ān kepada Muhammad, seorang yang fakir lagi yatim?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَقَالُوا۟ لَوْلَا نُزِّلَ هٰذَا الْقُرْءَانُ عَلَىٰ رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيمٍ (Dan mereka berkata: “Mengapa Al Quran ini tidak diturunkan kepada seorang besar dari salah satu dua negeri ini?”) Yakni besar dalam kedudukan dan harta benda serta pemimpin kaumnya. Yang dimaksud dengan dua negeri yaitu Makkah dan Thaif, dan yang dimaksud dengan dua lelaki adalah Walid bin Mughirah dari Makkah dan ‘Urwah bin Mas’ud ats-Tsaqafy dari Thaif; demikianlah yang dikatakan oleh Qatadah dan lainnya. Dan makna ayat ini adalah seandainya al-Qur’an itu benar niscaya akan diturunkan kepada seorang pembesar dari pembesar-pembesar dua negeri itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Para Kafir Mekah itu berkata: “Tidakkah sepantasnya Al-Qur’an ini diturunkan kepada laki-laki agung dan pemimpin kaumnya yang berasal dari orang-orang agung dan pembesar Mekah atau Thaif, yaitu Walid bin Mughirah dari Mekah dan Urwah bin Mas’ud Ats-Tsaqfiy dari Thaif” Maksudnya adalah Jika saja Al-Qur’an benar-benar diturunkan, maka akan diturunkan untuk orang agung yang berasal dari pembesar dua negeri. {laulaa} berfungsi untuk memberi makna khusus untuk sesuatu yang dimaksud oleh kalimat setelahnya. Ibnu Abbas berkata bahwa orang-orang Arab berkata: “Jika saja Nabi itu manusia, maka orang lain selain Muhammad itu lebih berhak mendapatkan risalah”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Mengapa Al-Qur’an ini tidak} mengapa tidak {diturunkan kepada seorang pembesar dari dua negeri ini} Mekkah dan Thaif"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. “dan mereka berkata,” seraya membuat usulan kepada Allah berdasarkan akal rusak mereka, ”mengapa al-qur’an ini tidak diturunkan kepada seorang besar dari salah satu dua negeri (mekkah dan tha’if) ini,” yaitu orang terhormat dari kalangan mereka dari kalangan Makkah dan tha’if sepeti al-walid bin al-mughirah dan lainnya yang meupakan orang-orang besar bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 31: (Dan mereka berkata, \"Mengapa tidak) kenapa tidak (diturunkan Alquran ini kepada seorang besar dari) kalangan penduduk (da negeri) yakni Mekah dan Madinah, maksudnya dari salah satu antara keduanya (yang besar ini?\") yang dimaksud oleh mereka adalah Al Walid Ibnu Mughirah di Mekah, atau Urwah ibnu Mas'ud Ats Tsaqafi di Thaif."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Memberikan usulan berdasarkan akal mereka yang rusak. Mereka mengingkari wahyu dan kenabian Muhammad shallallahu 'alaihi wa sallam, karena menurut pikiran mereka, seorang yang diutus menjadi Rasul itu hendaklah seorang yang kaya raya dan berpengaruh. Kalau sekiranya mereka mengetahui hakikat laki-laki sejati dan sifat yang dengannya diketahui tingginya kedudukan seseorang di sisi Allah maupun di sisi makhluk-Nya, tentu mereka akan mengetahui, bahwa Muhammad bin Abdullah bin Abdul Muththalib adalah laki-laki yang paling besar kedudukannya, paling tinggi kemuliaannya, paling sempurna akalnya, paling banyak ilmunya, paling tajam dan kuat pendapatnya, paling sempurna akhlaknya, paling luas kasih sayangnya, paling banyak memberikan petunjuk dan paling takwa kepada-Nya. Beliau adalah laki-laki yang paling sempurna, laki-laki nomor satu di dunia; diakui oleh kawan maupun lawan. Oleh karena itu, hanya orang yang dungu saja yang tidak mengakui keutamaan dan kemuliaan Beliau, yaitu orang-orang yang berdoa dan beribadah kepada sesuatu yang lebih lemah dari dirinya, seperti patung, berhala, batu, pohon, dsb. yang tidak dapat menimpakan bahaya dan tidak dapat memberikan manfaat, tidak dapat memberi dan menghalangi, bahkan menjadi beban bagi penyembahnya, perlu diurusnya dan dijaga. Bukankah ini menunjukkan kebodohannya dan tidak dapat menimbang sesuatu secara adil dan tepat?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 31",
    "description": "Dan mereka tidak hanya melecehkan Al-Qur'an, tetapi juga melecehkan nabi Muhammad dengan berkata, 'mengapa Al-Qur'an ini, yang diyakini oleh Muhammad sebagai petunjuk yang diturunkan tuhan, tidak diturunkan kepada seorang laki-laki yang agung, kaya, dan berpengaruh yang berasal dari salah satu dua negeri ini, yaitu mekah dan taif'' 32. Atas sikap pengingkaran mereka terhadap Al-Qur'an dan kerasulan nabi Muhammad itu, Allah lalu bertanya kepada nabi Muhammad, 'apakah mereka, yang ingkar, durhaka, dan menyekutukan tuhan itu, yang membagi-bagi rahmat tuhan, pencipta, pemelihara, dan pelimpah rahmat kepada-Mu, wahai nabi Muhammad' sama sekali tidak. Mereka tidak dapat melakukan itu. Kamilah yang membagikan rahmat di antara mereka dan kami pula lah yang menentukan penghidupan mereka dalam kehidupan dunia sesuai dengan ketentuan dan hukum-hukum yang telah kami tetapkan. Dan kami telah meninggikan sebagian mereka dalam kedudukan, harta, ilmu, dan jabatan mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain sehingga mereka dapat saling membantu dan menolong dalam pemenuhan kebutuhan hidup. Dan rahmat tuhan yang dilim-pahkan kepada mu berupa kenabian dan kerasulan lebih baik dari apa yang mereka kumpulkan, baik berupa kekayaan yang melimpah dan kekuasaan yang sangat tinggi. '."
  }
]