[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka yang membagi-bagikan status kenabian sehingga mereka bisa memberikannya kepada siapa yang mereka kehendaki?. Kamilah yang membagi-bagikan dalam kehidupan dunia mereka berupa rizki dan makanan, Kami juga tinggikan sebagian dari mereka beberapa derajat atas sebagian yang lain, sehingga ada yang kaya dan ada yang miskin, ada yang kuat dan adapula yang lemah, agar sebagian melengkapi sebagian yang lain dalam kehidupan. Dan rahmat Allah bagimu (wahai rasul) dengan memasukanmu kedalam surga adalah lebih baik daripada apa yang mereka kumpulkan berupa kekayaan dunia yang fana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Apakah mereka yang membagi-bagikan rahmat Rabbmu -wahai Rasul- sehingga mereka memberikannya kepada yang mereka kehendaki dan menahannya dari yang mereka kehendaki? Kami-lah yang membagi rezeki mereka di dunia dan Kami menjadikan di antara mereka ada yang kaya dan ada yang miskin agar sebagian dari mereka memanfaatkan sebagian yang lain. Dan rahmat Rabbmu untuk hamba-hamba-Nya di Akhirat lebih baik daripada harta dunia fana yang mereka kumpulkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. أَهُمْ يَقْسِمُونَ رَحْمَتَ رَبِّكَ ۚ (Apakah mereka yang membagi-bagi rahmat Tuhanmu?) Yakni apakah mereka yang membagi kenabian? نَحْنُ قَسَمْنَا بَيْنَهُم مَّعِيشَتَهُمْ فِى الْحَيَوٰةِ الدُّنْيَا ۚ( Kami telah menentukan antara mereka penghidupan mereka dalam kehidupan dunia) Lalu mengapa mereka tidak rela dengan pembagian Allah dalam urusan kenabian, dan tidak ridha dengan penyerahan kenabian bagi siapa yang Allah kehendaki? وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجٰتٍ(dan kami telah meninggikan sebahagian mereka atas sebagian yang lain beberapa derajat) Sebagaimana yang terjadi dalam urusan rezeki, kedudukan, kekuatan, kemerdekaan, akal, dan ilmu. لِّيَتَّخِذَ بَعْضُهُم بَعْضًا سُخْرِيًّا ۗ( agar sebagian mereka dapat mempergunakan sebagian yang lain) Agar sebagian mereka dapat mempekerjakan sebagian yang lain sehingga menjadi sebab penghidupan sebagian mereka. وَرَحْمَتُ رَبِّكَ(Dan rahmat Tuhanmu) Yaitu apa yang Allah siapkan di akhirat bagi hamba-hamba-Nya yang shalih. خَيْرٌ مِّمَّا يَجْمَعُونَ(lebih baik dari apa yang mereka kumpulkan) Yakni lebih baik dari harta benda dan seluruh kenikmatan duniawi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Apakah kaum itu mau membagi-bagi rahmat Tuhanmu wahai Muhammad, sehingga mereka bisa memilih nubuwah untuk orang yang mereka kehendaki? Tidak, Kamilah yang membagi-bagi penghidupan di antara mereka, sehingga kami menjadikan sebagian mereka kaya dan sisanya miskin. Bagaimana bisa mereka tidak puas dengan pembagian tentang urusan nubuwwah. Kami meninggikan kedudukan rejeki, bakat dan hal lain dari sebagian mereka di atas sebagian lainnya. {Rahmatu Rabbika} adalah Nubuwwah atau Surga yang lebih baik dari keuntungan dan kenikmatan dunia yang mereka kumpulkan. Ayat ini diturunkan untuk menanggapi orang-orang musyrik yang menginginkan Nubuwwah itu diberikan kepada salah satu dari dua pembesar mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka yang membagi-bagi rahmat Tuhanmu} kenabian {Kamilah yang menentukan penghidupan di antara mereka di kehidupan dunia dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat mengambil manfaat sebagian yang lain} mengambil manfaat dengan memperkerjakannya untuk diberi imbalan {Rahmat Tuhanmu} surga Tuhanmu {lebih baik daripada apa yang mereka kumpulkan} daripada apa yang dikumpulkan orang-orang kafir berupa reruntuhan dunia yang akan lenyap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah berrfirman seraya menyangkal usulan mereka, “apakah mereka yang membagi-bagi rahmat rabbmu,” artinya, apakah mereka memegang pebendaharaan rahmat Allah dan pengaturan rahmat ada di tangan mereka sehingga mereka bisa memberikan kenabian dan risalah pada siapa saja yang mereka kehendaki? “kami telah menentukan antara mereka penghidupan mereka dalam kehidupan dunia, dan kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat,”yakni, dalam kehidupan dunia,”dan” (padahal) “rahmat Rabbmu lebih baik dari apa yang mereka kumpulkan,” dari dunia. Mengingat penghidupan para hamba serta rizki duniawi mereka berada di tangan Allah yang mana Dialah yang membagikannya diantara para hamba, Dia memperluas rizki bagi siapa saja yang dikehendaki dan menyempitkannya bagi siapa saja yang dikehendaki berdasakan kebijaksanaanNya, maka rahmat duniawiNya yang mana yang tertinggi darinya adalah rahmat kenabian dan risalah tentu lebih utama dan layak berada di tangan Allah. Allah lebih tahu di mana menempatkan tugas kerasulan. Sehingga dapat diketahui bahwa usulan orang-orang musyrik gugur serta sia-sia dan pengaturan seluruh masalah, baik yang besifat duniawi dan Agama berada di tangan Allah semata. Ini adalah pemuasan bagi mereka dari segi kesalahan dalam membuat usulan yang sama sekali tidak mereka kuasai. Itu semua tidak lain hanyalah kezhaliman dai mereka dan penentangan terhadap kebenaran. Perkataan mereka, “mengapa al-qur’an ini tidak diturunkan kepada seorang besar dari salah satu dua negei (mekkah dan tha’if) ini,” andai saja mereka mengetahui hakikat oang-orang besar dan sifat-sifat yang dengannya bisa diketahui tingginya derajat seseorang serta agungnya derajat di sisi Allah dan makhlukNya, pasti mereka mengetahui bahwa nabi Muhammad bin Abdullah bin abdul muthalib adalah orang yang paling agung derajatnya, paling tinggi kebanggaannya, paling sempurna akalnya, paling banyak ilmunya, paling agung pandangan dan tekadnya, paling sempurna akhlaknya, paling luas kasih sayangnya, sangat bebelas kasih, orang yang paling mendapat petunjuk dan paling bertakwa. beliaulah kutub inti kesempurnaan, pada diri beliau bermuara sifat-sifat lelaki sejati. Beliaulah lelaki paling segalanya di dunia secara mutlak. Dan itu diketahui oleh kawan maupun lawan, kecuali orang-orang yang sesat dan angkuh. Maka bagaimana orang sepeti itu bisa lebih mengutamakan orang-orang musyrik yang seberat biji sawi sekalipun tidak dapat menyamai tingkat kesempurnaan beliau, dan siapaun yang tekad dan puncak akalnya adalah menjadikan patung, pohon, batu sebagai tuhan yang disembah dan dijadikan sebagai tempat mendekatkan diri, padahal tidak bisa membahayakan dan juga tidak bisa memberi manfaat, padahal ia sendiri bergantung pada Rabbnya dan memerlukan bantuan orang untuk kepentingannya? Hanya orang-orang bodoh dan gila yang melakukan hal ini. Lantas bagaimana oang seperti itu dijadikan oang besar, atau bagaimana bisa lebih diutamakan daripada penutup para rasul dan penghulu anak cucu Nabi Adam? Tapi orang-oang kafir tidak berakal. Dalam ayat ini terdapat peringatan atas hikmah Allah dalam hal melebihkan sebagian oang atas yang lain di dunia, “aga sebagian mereka dapat mempergunakan sebagian yang lain,”yaitu agar sebagian dari mereka menguasa atas sebagian yang lain dalam tugas, pekerjaan, dan perindustrian. Andai semua oang sama dari segi kekayaan, pasti tidak ada yang saling memerlukan satu sama lain dan pasti banyak kepentingan dan manfaat mereka yang terbengkalai. Di dalam ayat ini juga terdapat dalil bahwa nikmat agama lebih baik daipada nikmat duniawi, sebagaimana yang difirmankan Allah dalam ayat lainnya, “katakanlah,’dengan karunia Allah dan RahmatNya, hendaklah dengan itu mereka bergembira. Karunia dan rahmatNya itu adalah lebih baik dari apa yang mereka kumpulkan’,” (yunus:58)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 32: (Apakah mereka yang membagi-bagi rahmat Rabbmu?) yang dimaksud dengan rahmat adalah kenabian (Kami telah menentukan antara mereka penghidupan mereka dalam kehidupan dunia) maka Kami jadikan sebagian dari mereka kaya dan sebagian lainnya miskin (dan Kami telah meninggikan sebagian mereka) dengan diberi kekayaan (atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat mempergunakan) golongan orang-orang yang berkecukupan (sebagian yang lain) atas golongan orang-orang yang miskin (sebagai pekerja) maksudnya, pekerja berupah; huruf Ya di sini menunjukkan makna Nasab, dan menurut suatu qiraat lafal Sukhriyyan dibaca Sikhriyyan yaitu dengan dikasrahkan huruf Sin-nya (Dan rahmat Rabbmu) yakni surga Rabbmu (lebih baik daripada apa yang mereka kumpulkan) di dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman membantah usulan mereka. Maksudnya, apakah mereka yang menyimpan rahmat Tuhanmu (seperti kenabian, dsb.) dan di tangan mereka hak mengaturnya, sehingga mereka memberikan kenabian dan kerasulan kepada orang yang mereka kehendaki dan mencegahnya dari orang yang mereka kehendaki. Jika penghidupan manusia dan rezeki mereka di tangan Allah Subhaanahu wa Ta'aala, Dia yang membagikannya di antara hamba-hamba-Nya, Dia yang melapangkan rezeki kepada siapa yang Dia kehendaki dan menyempitkannya kepada siapa yang Dia kehendaki sesuai kebijaksanaan-Nya, maka rahmat agama; dimana yang paling tinggi adalah kenabian dan kerasulan lebih patut berada di Tangan Allah Subhaanahu wa Ta'aala, sehingga Dialah yang paling tahu dimanakah Dia menaruh risalah-Nya. Dari sini diketahui, bahwa usulah mereka gugur dengan sendirinya, dan bahwa mengatur segala urusan baik yang terkait dengan agama maupun dunia adalah di Tangan Allah Subhaanahu wa Ta'aala saja. Hal ini untuk menundukkan mereka dari sisi kesalahan mereka dalam memberikan usulan yang bukan di tangan mereka urusan tentang hal itu, bahkan hal itu sebenarnya sikap zalim mereka dan penolakan terhadap yang hak. Yakni oleh karena itu, Kami jadikan sebagian mereka sebagai orang kaya dan sebagian lagi sebagai orang miskin. Dalam ayat ini terdapat pengingat dari Allah Subhaanahu wa Ta'aala terhadap hikmah mengapa Dia melebihkan sebagian hamba di atas sebagian yang lain di dunia, yaitu agar sebagian dapat dimanfaatkan oleh orang lain dengan mendapat upah. Jika seandainya manusia semuanya sama kaya, dan sebagiannya tidak membutuhkan yang lain, maka tentu banyak maslahat mereka yang hilang. Yaitu surga. Dalam ayat ini terdapat dalil bahwa nikmat agama jauh lebih baik daripada nikmat dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 32",
    "description": "Atas sikap pengingkaran mereka terhadap Al-Qur'an dan kerasulan nabi Muhammad itu, Allah lalu bertanya kepada nabi Muhammad, 'apakah mereka, yang ingkar, durhaka, dan menyekutukan tuhan itu, yang membagi-bagi rahmat tuhan, pencipta, pemelihara, dan pelimpah rahmat kepada-Mu, wahai nabi Muhammad' sama sekali tidak. Mereka tidak dapat melakukan itu. Kamilah yang membagikan rahmat di antara mereka dan kami pula lah yang menentukan penghidupan mereka dalam kehidupan dunia sesuai dengan ketentuan dan hukum-hukum yang telah kami tetapkan. Dan kami telah meninggikan sebagian mereka dalam kedudukan, harta, ilmu, dan jabatan mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain sehingga mereka dapat saling membantu dan menolong dalam pemenuhan kebutuhan hidup. Dan rahmat tuhan yang dilim-pahkan kepada mu berupa kenabian dan kerasulan lebih baik dari apa yang mereka kumpulkan, baik berupa kekayaan yang melimpah dan kekuasaan yang sangat tinggi. '33-35. Dan sekiranya bukan karena kami menghindarkan semua manusia menjadi umat yang satu dalam kekafiran, pastilah sudah kami buatkan untuk orang-orang yang kafir kepada Allah, yang maha pengasih, bagi rumah-rumah mereka loteng-loteng yang terbuat dari perak, dan demikian pula tangga-tangga yang mereka naiki, dan kami buatkan pula pintu-pintu yang terbuat dari perak bagi rumah-rumah mereka, dan begitu pula dipan-dipan tempat mereka bersandar, dan kami buatkan pula perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia semata, yang bersifat sementara sedangkan kehidupan akhirat di sisi tuhanmu disediakan khusus bagi orang-orang yang bertakwa."
  }
]