[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalau bukan karena menghindarkan manusia untuk bersatu padu menjadi jamaah yang satu diatas kekafiran, niscaya Kami menjadikan bagi orang-orang yang kafir kepada Allah yang maha pengasih untuk rumah-rumah mereka atap dari perak, demikian pula tangga-tangga yang mereka naiki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Kalaulah bukan karena menghindari manusia menjadi satu umat dalam kekufuran, niscaya Kami akan jadikan rumah orang-orang yang kafir kepada Allah atap-atap dari perak dan Kami jadikan untuk mereka tangga-tangga (dari perak) yang mereka gunakan untuk naik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-35. Kalaulah bukan karena manusia menginginkan kekafiran setelah melihat orang kafir hidup dalam kelapangan sehingga mereka berada dalam kekafiran yang sama, niscaya Kami akan jadikan kehidupan orang-orang kafir penuh dengan kenikmatan dunia, dan Kami akan berikan kepada mereka istana-istana yang memiliki atap perak, tangga yang nyaman untuk dinaiki, pintu-pintu perak, dipan-dipan mewah tempat mereka bersandar, dan perabotan dari emas. Seluruh kenikmatan sementara yang Kami berikan kepada orang-orang kafir itu hanyalah kenikmatan yang mereka nikmati di dunia yang fana. Adapun kenikmatan dunia hanya Allah siapkan bagi orang-orang bertakwa di dalam surga yang kekal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلَوْلَآ أَن يَكُونَ النَّاسُ أُمَّةً وٰحِدَةً (Dan sekiranya bukan karena hendak menghindari manusia menjadi umat yang satu) Yakni kalaulah bukan karena menghindari mereka berkumpul dalam kekafiran akibat kecondongan kepada dunia dan perhiasannya sehingga tidak tersisa orang beriman di muka bumi. لَّجَعَلْنَا لِمَن يَكْفُرُ بِالرَّحْمٰنِ لِبُيُوتِهِمْ سُقُفًا مِّن فِضَّةٍ(tentulah kami buatkan bagi orang-orang yang kafir kepada Tuhan Yang Maha Pemurah loteng-loteng perak bagi rumah mereka) Niscaya Kami akan berikan kepada mereka di dunia apa yang telah Kami sebutkan itu, karena keremehan dunia di sisi Allah, agar menjadi istidraj bagi orang-orang kafir dari arah yang tidak mereka sangka. وَمَعَارِجَ(dan (juga) tangga-tangga (perak)) Yakni tangga yang terbuat dari perak. عَلَيْهَا يَظْهَرُونَ (yang mereka menaikinya) Yakni dengan tangga-tangga itu mereka naik ke tempat dan bangunan yang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Bukan karena takut jika seluruh manusia berada dalam satu kepercayaan yaitu dalam kekufuran, sungguh kami menjadikan rumah-rumah orang-orang kafir itu memiliki atap perak dan tangga-tangga perak yang mereka gunakan untuk naik ke atas (atap)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya bukan karena manusia menjadi satu umat} satu kelompok atas kekufuran {Sungguh Kami sudah membuatkan bagi orang-orang yang ingkar kepada Dzat Yang Maha Pengasih itu loteng-loteng rumah mereka dan tangga-tangga} tangga-tangga {yang mereka naiki} mereka naiki {dari perak} dari perak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-35. Allah mengabarkan bahwa dunia tidak bernilai apapun disisiNya dan seandainya bukan karena kelembutan dan rahmatNya terhadap hamba-hambaNYa yang tidak terlalu agresif mencari dunia, niscaya Allah amat melapangkan dunia bagi orang-oang kafir, dan menjadikan “loteng-loteng perak bagi rumah mereka dan (juga) tangga-tangga (perak)” “yang mereka naiki” yakni atapnya, “dan (kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka dan (begitu pula) dipan-dipan yang mereka betelekan atasnya,” yang terbuat dari perak, dan pasti Allah menjadikan bagi mereka “perhiasan-perhiasann (dari emas untuk mereka),” artinya, niscaya Allah menghiasi dunia meeka dengan bebagai macam perhiasaan, dan pasti memberi apapun yang mereka inginkan, tapi hal itu terhalang oleh rahmatNya pada hamba-hambaNYa karena khawatir mereka akan cepat kufur dan banyaknya kemaksiatan karena cinta dunia. Dalam ayat ini terdapat petunjuk bahwa Allah menghalangi sebagian orang dari hal-hal duniawi secara umum dan khusus untuk kepentingan-kepentingan mereka, dan dunia itu tidak menyamai sayap nyamuk pun disisi Allah .dan yang disebutkan itu tadi hanyalah nikmat-nikmat duniawi yang kotor dan fana, dan akhirat di sisi Allah lebih baik bagi orang-orang yang bertakwa kepada Rabb mereka dengan mengerjakan perintah-perintahNya, karena nikmat akhirat adalah nikmat yang sempurna dari bebagai segi. Di dalam surga terdapat apapun yang diinginkan jiwa dan dipandang nikmat oleh mata. Mereka kekal di dalamnya. Alangkah berbedanya kedua negeri akhirat itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 33: (Dan sekiranya bukan karena hendak menghindari manusia menjadi umat yang satu) dalam kekafiran (tentulah Kami buatkan bagi orang-orang yang kafir kepada Tuhan Yang Maha Pemurah bagi rumah-rumah mereka) lafal Libuyutihim menjadi Badal dari lafal Liman (loteng-loteng) dapat dibaca Saqfan atau Suqfan keduanya adalah bentuk jamak (dari perak dan juga tangga-tangga) dari perak pula (yang mereka menaikinya) yang dapat mereka naiki untuk mencapai atap rumah-rumah mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa dunia tidak ada artinya apa-apa di sisi-Nya, dan kalau bukan karena kelembutan dan rahmat-Nya kepada hamba-hamba-Nya, tentu Dia akan meluaskan dunia kepada orang-orang kafir dengan seluas-luasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 33",
    "description": "33-35. Dan sekiranya bukan karena kami menghindarkan semua manusia menjadi umat yang satu dalam kekafiran, pastilah sudah kami buatkan untuk orang-orang yang kafir kepada Allah, yang maha pengasih, bagi rumah-rumah mereka loteng-loteng yang terbuat dari perak, dan demikian pula tangga-tangga yang mereka naiki, dan kami buatkan pula pintu-pintu yang terbuat dari perak bagi rumah-rumah mereka, dan begitu pula dipan-dipan tempat mereka bersandar, dan kami buatkan pula perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia semata, yang bersifat sementara sedangkan kehidupan akhirat di sisi tuhanmu disediakan khusus bagi orang-orang yang bertakwa"
  }
]