[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35 Dan Kami menjadikan pintu-pintu rumah mereka dari perak. Kami menjadikan untuk mereka ranjang-ranjang dimana mereka bersandar di atasnya dan Kami memberikan emas kepada mereka, namun semua itu hanyalah kenikmatan dunia, kenikmatan yang sedikit yang akan hilang, sedangkan kenikmatan akhirat tersimpan di sisi tuhanmu bagi orang-orang yang bertakwa, bukan bagi selain mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan Kami buatkan pintu-pintu (perak) untuk rumah-rumah mereka dan Kami buatkan bagi mereka dipan-dipan tempat mereka bersandar, sebagai bentuk ujian dan cobaan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَلِبُيُوتِهِمْ أَبْوٰبًا وَسُرُرًا (Dan (Kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka dan (begitu pula) dipan-dipan) Yaknni dan niscaya Kami akan jadikan bagi rumah-rumah mereka terbuat dari perak, begitu pula dengan dipan-dipan mereka. عَلَيْهَا يَتَّكِـُٔونَ(yang mereka bertelekan atasnya)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Kami telah menjadikan pintu-pintu dari perak pada rumah mereka, juga dipan-dipan perak tempat mereka bersandar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan bagi rumah-rumah mereka ada pintu-pintu dan dipan-dipan yang mereka gunakan untuk bersandar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-35. Allah mengabarkan bahwa dunia tidak bernilai apapun disisiNya dan seandainya bukan karena kelembutan dan rahmatNya terhadap hamba-hambaNYa yang tidak terlalu agresif mencari dunia, niscaya Allah amat melapangkan dunia bagi orang-oang kafir, dan menjadikan “loteng-loteng perak bagi rumah mereka dan (juga) tangga-tangga (perak)” “yang mereka naiki” yakni atapnya, “dan (kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka dan (begitu pula) dipan-dipan yang mereka betelekan atasnya,” yang terbuat dari perak, dan pasti Allah menjadikan bagi mereka “perhiasan-perhiasann (dari emas untuk mereka),” artinya, niscaya Allah menghiasi dunia meeka dengan bebagai macam perhiasaan, dan pasti memberi apapun yang mereka inginkan, tapi hal itu terhalang oleh rahmatNya pada hamba-hambaNYa karena khawatir mereka akan cepat kufur dan banyaknya kemaksiatan karena cinta dunia. Dalam ayat ini terdapat petunjuk bahwa Allah menghalangi sebagian orang dari hal-hal duniawi secara umum dan khusus untuk kepentingan-kepentingan mereka, dan dunia itu tidak menyamai sayap nyamuk pun disisi Allah .dan yang disebutkan itu tadi hanyalah nikmat-nikmat duniawi yang kotor dan fana, dan akhirat di sisi Allah lebih baik bagi orang-orang yang bertakwa kepada Rabb mereka dengan mengerjakan perintah-perintahNya, karena nikmat akhirat adalah nikmat yang sempurna dari bebagai segi. Di dalam surga terdapat apapun yang diinginkan jiwa dan dipandang nikmat oleh mata. Mereka kekal di dalamnya. Alangkah berbedanya kedua negeri akhirat itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 34: (Dan Kami buatkan pula -pintu-pintu bagi rumah-rumah mereka) yang juga terbuat dari perak (dan) begitu pula Kami buatkan untuk mereka (dipan-dipan) yang terbuat dari perak; lafal Sururan adalah bentuk jamak dari lafal Sarirun artinya, ranjang atau dipan (yang mereka bertelekan atasnya.)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 34",
    "description": "33-35. Dan sekiranya bukan karena kami menghindarkan semua manusia menjadi umat yang satu dalam kekafiran, pastilah sudah kami buatkan untuk orang-orang yang kafir kepada Allah, yang maha pengasih, bagi rumah-rumah mereka loteng-loteng yang terbuat dari perak, dan demikian pula tangga-tangga yang mereka naiki, dan kami buatkan pula pintu-pintu yang terbuat dari perak bagi rumah-rumah mereka, dan begitu pula dipan-dipan tempat mereka bersandar, dan kami buatkan pula perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia semata, yang bersifat sementara sedangkan kehidupan akhirat di sisi tuhanmu disediakan khusus bagi orang-orang yang bertakwa"
  }
]