[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35 Dan Kami menjadikan pintu-pintu rumah mereka dari perak. Kami menjadikan untuk mereka ranjang-ranjang dimana mereka bersandar di atasnya dan Kami memberikan emas kepada mereka, namun semua itu hanyalah kenikmatan dunia, kenikmatan yang sedikit yang akan hilang, sedangkan kenikmatan akhirat tersimpan di sisi tuhanmu bagi orang-orang yang bertakwa, bukan bagi selain mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Dan niscaya Kami buatkan bagi mereka emas-emas, dan semua itu tidak lain hanyalah kenikmatan kehidupan dunia, dan manfaatnya sedikit karena tidak kekal, sementara kenikmatan di Akhirat lebih baik bagi Rabbmu -wahai Rasul- untuk orang-orang yang bertakwa kepada Allah dengan menaati segala perintah-Nya dan menghindari segala larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَزُخْرُفًا ۚ (Dan (Kami buatkan pula) perhiasan-perhiasan) Dan niscaya Kami juga akan memberikan mereka perhiasan pada atap, pintu, kasur, dan lain sebagainya. Makna (الزخرف) yakni emas, atau hiasan dan ukiran. وَإِن كُلُّ ذٰلِكَ لَمَّا مَتٰعُ الْحَيَوٰةِ الدُّنْيَا ۚ( Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia) Yakni semua itu hanyalah sesuatu yang dinikmati di dunia semata. وَالْاٰخِرَةُ عِندَ رَبِّكَ لِلْمُتَّقِينَ (dan kehidupan akhirat itu di sisi Tuhanmu adalah bagi orang-orang yang bertakwa) Yakni bagi orang yang menjauhi kemusyrikan dan kemaksiatan, serta beriman kepada Allah dan beramal shalih; dan akhirat akan kekal selamanya, dan kenikmatannya tidak akan sirna."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Kami buatkan pula perhiaasan dan prasasti pada atap, pintu dan dipan mereka - zukhruf bermakna emas atau perhiasan -. Itu semua adalah kesenangan dunia, kemudian akan hilang ketika kematian telah datang. Adapun surga adalah orang-orang yang bertakwa, tidak berbuat kesyirikan dan maksiat. In adalah huruf nafi yang bermakna seperti huruf ma, dan lamma bermakna illa. Maksud dari ketiga ayat tersebut bahwa jika bukan karena Kami tidak ingin manusia menjadi kafir semua, maka pasti akan Kami buatkan berbagai macam perhiasan dunia untuk orang-orang kafir, sebagai wujud pelecehan terhadap kesenengan dunia jika dibandingkan dengan kesenangan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan perhiasan-perhiasan dari emas} dan Kami menjadikan bagi mereka perhiasan emas {Sesungguhnya semua itu tidak lain} semua itu tidak lain {kecuali kesenangan hidup dunia dan akhirat di sisi Tuhanmu bagi orang-orang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-35. Allah mengabarkan bahwa dunia tidak bernilai apapun disisiNya dan seandainya bukan karena kelembutan dan rahmatNya terhadap hamba-hambaNYa yang tidak terlalu agresif mencari dunia, niscaya Allah amat melapangkan dunia bagi orang-oang kafir, dan menjadikan “loteng-loteng perak bagi rumah mereka dan (juga) tangga-tangga (perak)” “yang mereka naiki” yakni atapnya, “dan (kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka dan (begitu pula) dipan-dipan yang mereka betelekan atasnya,” yang terbuat dari perak, dan pasti Allah menjadikan bagi mereka “perhiasan-perhiasann (dari emas untuk mereka),” artinya, niscaya Allah menghiasi dunia meeka dengan bebagai macam perhiasaan, dan pasti memberi apapun yang mereka inginkan, tapi hal itu terhalang oleh rahmatNya pada hamba-hambaNYa karena khawatir mereka akan cepat kufur dan banyaknya kemaksiatan karena cinta dunia. Dalam ayat ini terdapat petunjuk bahwa Allah menghalangi sebagian orang dari hal-hal duniawi secara umum dan khusus untuk kepentingan-kepentingan mereka, dan dunia itu tidak menyamai sayap nyamuk pun disisi Allah .dan yang disebutkan itu tadi hanyalah nikmat-nikmat duniawi yang kotor dan fana, dan akhirat di sisi Allah lebih baik bagi orang-orang yang bertakwa kepada Rabb mereka dengan mengerjakan perintah-perintahNya, karena nikmat akhirat adalah nikmat yang sempurna dari bebagai segi. Di dalam surga terdapat apapun yang diinginkan jiwa dan dipandang nikmat oleh mata. Mereka kekal di dalamnya. Alangkah berbedanya kedua negeri akhirat itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 35: (Dan Kami buatkan pula perhiasan-perhiasan) dari emas untuk mereka. Makna ayat, seandainya tidak karena khawatir orang mukmin akan menjadi kafir, bila Kami anugerahkan kepadanya hal-hal tersebut sebagaimana yang telah Kami berikan kepada orang kafir, tentulah Kami akan memberikan kepada orang mukmin hal-hal itu. Karena keduniaan itu tidak ada artinya di sisi Kami, dan kelak di akhirat tidak berharga sama sekali bila dibandingkan dengan nikmat surga. (Dan sesungguhnya) lafal In di sini adalah bentuk Takhfif dari Inna yang Tsaqilah; artinya sesungguhnya (semuanya itu tiada lain) jika dibaca Lama dengan cara Takhfif, maka huruf Ma adalah Zaidah, jika dibaca Lamma dengan memakai Tasydid pada huruf Mim maknanya sama dengan lafal Illa, dan lafal In bermakna Nafi. Menurut bacaan pertama arti ayat ini ialah, \"Dan sesungguhnya semuanya itu hanyalah. \" Menurut bacaan kedua artinya menjadi, \"Dan tiadalah semuanya itu melainkan (kesenangan kehidupan dunia) yang dapat dipakai untuk bersenang-senang kemudian lenyap sesudah itu (dan kehidupan di akhirat itu) yakni di surga (di sisi Rabbmu bagi orang-orang yang bertakwa.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kalau bukan karena dikhawatirkan orang-orang mukmin akan kafir karena orang-orang kafir diberikan semua kesenangan itu, tentu Allah Subhaanahu wa Ta'aala akan memberikan semua yang disebutkan itu karena rendahnya kedudukan dunia di sisi Allah dan tidak ada artinya dengan kenikmatan di akhirat. Ayat ini menunjukkan bahwa Dia menghalangi hamba-hamba-Nya sebagian kesenangan dunia baik secara umum maupun khusus karena maslahat mereka, dan bahwa dunia di sisi Allah tidak memiliki arti apa-apa sampai saking rendahnya tidak menyamai beratnya sayap nyamuk, dan bahwa semua yang disebutkan adalah kesenangan hidup di dunia yang memiliki kekurangan, sementara dan akan binasa, dan bahwa akhirat (surga) di sisi Allah lebih baik bagi orang-orang yang bertakwa, karena kenikmatannya sempurna, kekal dan semua yang diinginkan ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 35",
    "description": "33-35. Dan sekiranya bukan karena kami menghindarkan semua manusia menjadi umat yang satu dalam kekafiran, pastilah sudah kami buatkan untuk orang-orang yang kafir kepada Allah, yang maha pengasih, bagi rumah-rumah mereka loteng-loteng yang terbuat dari perak, dan demikian pula tangga-tangga yang mereka naiki, dan kami buatkan pula pintu-pintu yang terbuat dari perak bagi rumah-rumah mereka, dan begitu pula dipan-dipan tempat mereka bersandar, dan kami buatkan pula perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia semata, yang bersifat sementara sedangkan kehidupan akhirat di sisi tuhanmu disediakan khusus bagi orang-orang yang bertakwa. 36. Dan barang siapa berpaling dari pengajaran Allah yang maha pengasih, yaitu tidak memperhatikan apa yang terkandung di dalam Al-Qur'an, kami biarkan setan menyesatkan dan mengendalikannya serta menjadi teman karibnya yang selalu menyertai, mendampingi, dan mendorongnya melakukan kedurhakaan."
  }
]