[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barang siapa yang berpaling dari mengingat Allah yang maha pengasih yaitu al-qur’an, sehingga tidak takut hukumanNya dan tidak mengambil petunjukNya, maka Kami mengirimkan setan kepadanya di dunia yang menyesatkannya sebagai balasan kepadanya karena dia berpaling dari dzikrullah tersebut, setan tersebut menjadi rekan akrabnya yang menghalang-halanginya melakukan yang halal dan mendorongnya melakukan yang haram."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Orang yang memandang Al-Qur`ān dengan pandangan tidak profesional maka itu mengantarkannya pada sikap berpaling dari Al-Qur`ān, dia akan dihukum dengan penguasaan setan terhadap dirinya yang senantiasi menambahkan kesesatan padanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-39. Barangsiapa yang berpaling dan lalai dari al-Qur’an dan menyembah Allah, maka Kami akan menjadikan baginya setan yang menyesatkannya sehingga dia tidak dapat terlepas dari keraguan; setan itu akan selalu bersamanya. Sungguh setan dari golongan jin dan manusia akan selalu menghalangi orang-orang kafir yang sesat dari petunjuk, dengan cara menghiasi bagi mereka jalan kesesatan; sehingga mereka menganggap diri mereka di atas jalan petunjuk, hingga ketika orang kafir datang pada hari kiamat bersama setan yang senantiasa menyertainya untuk menjalani hisab, orang itu menyesal dan berteriak: “Andai saja antara diriku dan dirimu terdapat jarak antara timur dan barat; sungguh kamu adalah seburuk-buruk teman.” Akan tetapi kebersamaan kalian dengan para teman dan kekasih kalian pada hari kiamat dalam azab tidak akan membawa manfaat bagi kalian, karena kalian tidak akan saling menghibur. Dan azab tidak akan dibagi-bagi di antara kalian sehingga azab itu menjadi lebih ringan karena kezaliman dan kekafiran yang kalian lakukan bersama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَمَن يَعْشُ عَن ذِكْرِ الرَّحْمٰنِ (Barangsiapa yang berpaling dari pengajaran Tuhan Yang Maha Pemurah) Yakni barangsiapa yang gelap penglihatannya sehingga tidak mengetahui hak Tuhannya. Makna (الأعشى) yakni orang yang tidak dapat melihat di malam hari namun dapat melihat di siang hari. نُقَيِّضْ لَهُۥ شَيْطٰنًا (kami adakan baginya syaitan) Yakni Kami siapkan baginya setan. Dan pendapat selain dari pendapat ini. Ibnu Abi Hatim meriwayatkan bahwa kaum Quraisy berkata: utuslah bagi setiap sahabat Muhammad seseorang yang dapat menariknya. Maka mereka menyiapkan Thalhah bin Ubaidullah bagi Abu Bakar, kemudian Thalhah mendatanginya saat berada di sekumpulan kaum. Maka Abu Bakar bertanya kepadanya: “kemana kalian akan mengajakku?” Thalhah menjawab: “Aku mengajakmu untuk menyembah Laata dan ‘Uzza.” Abu Bakar kembali bertanya: “Apa itu Laata?” Thalhah menjawab: “dia adalah termasuk anak-anak laki-laki Allah.” Abu Bakar berkata: “Dan apa itu ‘Uzza?” Thalhah berkata: “dia adalah termasuk anak-anak perempuan Allah.” Abu Bakar berkata: “Lalu siapa ibu mereka?” Maka Thalhah berkata kepada kaumnya: “Jawablah pertanyaan lelaki ini.” Namun mereka semua terdiam. Maka Thalhah berkata: “Berdirilah hai Abu Bakar, sungguh aku bersaksi bahwa tiada Tuhan selain Allah dan Muhammad adalah Rasulullah.” Maka turunlah ayat ini. فَهُوَ لَهُۥ قَرِينٌ (maka syaitan itulah yang menjadi teman yang selalu menyertainya) Sehingga setan selalu menyertainya kemanapun dia pergi, dan ia mengikuti setan dalam segala urusanya, dan mentaati segala yang setan bisikkan kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Barangsiapa berpaling dari Alquran maka akan kami biarkan dan kami persilakan setan untuk menyesatkannya dan menjadi teman karibnya, yang akan menyesatkan segala urusannya. Ayat ini turun untuk para kafir Qurays yang menyembah berhala"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berpaling} yang memandang dengan pandangan abai dan pura pura tidak melihat {dari peringatan Dzat Yang Maha Pengasih, Kami akan membiarkan} Kami akan memudahkan dan mempersilahkan {setan baginya. Maka setan adalah teman baginya} selalu menemani"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Allah mengabarkan tentang hukumanNya yang amat dahsyat bagi orang yang berpaling dari peringatanNya, dimana Allah berfirman, ”barangsiapa yang berpaling,” yaitu berpaling dan menghalang-halangi, ”dari pengajaran (Rabb) yang maha pemuah,” yaitu al-qur’an yang agung yang merupakan rahmat terbesar Allah yang maha pemurah terhadap para hambaNya; dimana siapapun yang menerimanya, berarti telah menerima pemberian terbaik serta mendapatkan tujuan dan keinginan terbesar, dan siapapun yang berpaling dan menolaknya, berarti ia amat merugi dan tidak akan mendapatkan kebahagiaan selamanya setelah itu, Allah menjadikan setan sebagai teman yang menyertainya, yang memberinya janji, memberinya angan-angan, dan menolongnya pada kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 36: (Barang siapa yang berpaling) yaitu memalingkan diri (dari pengajaran Tuhan Yang Maha Pemurah) dari Alquran (Kami adakan) Kami jadikan (baginya setan, maka setan itulah yang menjadi teman yang selalu menyertainya) yakni tidak pernah berpisah darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang hukuman-Nya yang besar bagi orang yang berpaling dari peringatan-Nya. Yaitu Al Qur’anul Karim yang merupakan rahmat terbesar yang Dia berikan kepada hamba-hamba-Nya. Barang siapa yang menerimanya, maka ia telah menerima pemberian terbaik, berhasil memperoleh harapan yang paling besar, dan barang siapa yang berpaling darinya dan menolaknya, maka ia telah rugi dengan kerugian yang tidak ada lagi kebahagiaan setelahnya, dan Allah Yang Maha Pengasih akan menyerahkan untuknya setan yang durhaka sebagai kawannya yang menemani, yang menjanjikan dan membuatnya berangan-angan serta mendorongnya berbuat maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 36",
    "description": "Dan barang siapa berpaling dari pengajaran Allah yang maha pengasih, yaitu tidak memperhatikan apa yang terkandung di dalam Al-Qur'an, kami biarkan setan menyesatkan dan mengendalikannya serta menjadi teman karibnya yang selalu menyertai, mendampingi, dan mendorongnya melakukan kedurhakaan. 37. Dan sesungguhnya mereka, yakni setan-setan yang menjadi temannya itu benar-benar menghalang-halangi mereka dari jalan yang benar sehingga mereka tidak mampu melakukan kebaikan, sedang mereka menyangka bahwa mereka mendapat petunjuk dari apa yang ditunjukkan setan itu."
  }
]