[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya setan-setan itu benar-benar menghalang-halangi orang-orang yang berpaling dari dzikir Allah (al-qur’an) dari jalan kebenaran, setan-setan itu memperindah kesesatan bagi mereka, membuat mereka benci kepada iman kepada Allah dan amal ketaatan kepadaNYa. Orang-orang yang berpaling itu menyangka bahwa apa yang mereka pegang berupa kesesatan adalah kebenaran dan petunjuk akibat setan-setan tersebut yang menghiasinya untuk mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Dan para setan yang menyertai mereka, yang dikuasakan atas orang-orang yang berpaling dari Al-Qur`ān menghalang-halangi mereka dari agama Allah, sehingga mereka tidak mematuhi perintah-perintah-Nya dan tidak menjauhi larangan-larangan-Nya dan mereka mengira mendapat petunjuk menuju kebenaran, dengan demikian mereka tidak bertobat dari kesesatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ (Dan sesungguhnya syaitan-syaitan itu benar-benar menghalangi mereka dari jalan yang benar) Yakni setan-setan yang Allah sertakan bagi setiap hamba-Nya yang berpaling dari mengingat Allah akan menghalangi mereka dari jalan yang benar dan membisikkan kepada mereka bahwa mereka berada dalam petunjuk. وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ(dan mereka menyangka bahwa mereka mendapat petunjuk) Yakni orang-orang kafir mengira mendapat petunjuk akibat bisikan setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Para setan itu ada yang dari jin dan juga golongan manusia, Allah akan memberlakukan itu bagi siapa saja yang menentang dan menolak Alquran. Agar setan-setan itu menghalangi dari jalan hidayah. Mereka mengira bahwa dengan mengikuti bisikan-bisikan setan itu mereka telah mendapat petunjuk dan berada dalam jalan kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya mereka} sesungguhnya setan-setan itu {benar-benar menghalangi mereka dari jalan} jalan kebenaran {dan mereka mengira} orang-orang kafir {mengira bahwa mereka adalah orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “dan sesungguhnya setan-setan itu benar-benar menghalangi mereka dari jalan yang benar,” yaitu jalan dan agama yang lurus, ”dan mereka menyangka bahwa mereka mendapat petunjuk,” disebabkan oleh tindakan setan yang menghiasi kebatilan untuk mereka serta berpalingnya mereka dari kebenaran, sehingga keduanya menyatu. Bila ada yang bertanya, ”apakah orang seperti ini mendapatkan udzur Karena ia mengira mendapatkan petunjuk padahal tidak?” jawabannya adalah, tidak ada udzur bagi orang seperti ini dan juga oang-orang yang sama, yang kebodohan mereka bersumber dari berpaling darri peringatan Allah, padahal sebenarnya mereka bisa mengikuti petunjuk, mereka merasa cukup dengan petunjuk (tidak membutuhkannya) padahal sebenarnya mereka mampu dan mereka menyukai kebatilan. Maka dosa dan tindakan jahat adalah milik mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 37: (Dan sesungguhnya mereka) setan-setan itu (benar-benar menghalangi mereka) menghalangi orang-orang yang berpaling itu (dari jalan yang benar) atau jalan petunjuk (dan mereka menyangka bahwa mereka mendapat petunjuk) disebutkannya Dhamir dengan memakai kata jamak karena memandang segi makna yang dikandung lafal Man."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini disebabkan penghiasan dari setan kepada kebatilan dan berpalingnya mereka dari yang hak. Jika seorang berkata, “Apakah ia bisa diterima uzurnya, yaitu karena ia mengira bahwa hal itu sebagai petunjuk?” Maka dijawab, bahwa orang itu dan yang sepertinya tidak bisa diterima uzurnya karena sumber kebodohan mereka adalah berpaling dari peringatan Allah padahal mampu mengambilnya sebagai petunjuk; mereka tidak suka petunjuk padahal mampu memperolehnya, dan mereka juga senang kepada yang batil. Inilah keadaan orang yang berpaling dari mengingat Allah di dunia bersama kawannya yaitu setan, ia berada dalam kesesatan, kebodohan dan terbaliknya hakikat yang sebenarnya. Adapun keadaannya ketika datang menghadap Tuhannya, maka lebih buruk lagi, ia akan menampakkan penyesalan dan kesedihan yang tidak dapat ditutupi, dan berlepas diri dari kawannya itu (lihat ayat 38 surah ini)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 37",
    "description": "Dan sesungguhnya mereka, yakni setan-setan yang menjadi temannya itu benar-benar menghalang-halangi mereka dari jalan yang benar sehingga mereka tidak mampu melakukan kebaikan, sedang mereka menyangka bahwa mereka mendapat petunjuk dari apa yang ditunjukkan setan itu. 38. Sehingga apabila dia yang berpaling itu, yakni orang yang tidak mau mengikuti petunjuk Al-Qur'an itu, datang kepada kami pada hari kiamat nanti, dia berkata dengan menyesali apa yang pernah dilakukannya di dunia ini, 'wahai! sekiranya dapat dilakukan, maka jarak antara aku dan kamu seperti jarak antara timur dan barat! memang, teman yang paling jahat bagi manusia adalah setan yang menjadi qarin itu. '."
  }
]