[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sehingga orang yang berpaling dari dzikir Allah (al-qur’an) yang maha pengasih itu datang untuk menghadapi hisab dan mendapatkan balasan, dia berkata kepada rekannya, ”saya berharap anatara diriku dengan dirimu terdapat jarak sejauh timur dengan barat, seburuk-buruk rekan adalah kamu, karena kamu telah menyesatkanku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Sehingga jika telah datang kepada Kami orang yang berpaling dari peringatan Allah pada hari Kiamat, ia berkata dengan penuh harap, “Aduhai sekiranya antara diriku dan dirimu -wahai setan yang selalu menemani- terdapat jarak antara timur dan barat, engkau merupakan teman yang buruk.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. حَتَّىٰٓ إِذَا جَآءَنَا قَالَ يٰلَيْتَ بَيْنِى وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ (Sehingga apabila orang-orang yang berpaling itu datang kepada kami (di hari kiamat) dia berkata: “Aduhai, semoga (jarak) antaraku dan kamu seperti jarak antara timur dan barat) Yakni orang kafir pada hari kiamat berharap dijauhkan dari setan yang selalu menyertainya sejauh timur dan barat. فَبِئْسَ الْقَرِينُ (maka syaitan itu adalah sejahat-jahat teman) Yakni seburuk-buruk teman yang selalu menyertai adalah kamu hai setan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Sehingga jika orang-orang yang menentang Alquran itu mendatangi Kami di akhirat, mereka berkata kepada para setan teman mereka: “Seandainya pun jarakku dan jarak kalian itu sejauh timur dan barat, maka kalian memanglah sejahat-jahatnya teman bagiku. Kalian telah menyesatkanku dari jalan iman.” Masyriqani adalah pintu jagad, timur dan barat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sehingga apabila dia datang kepada Kami dia berkata} orang kafir berkata kepada temannya yaitu setan {“Aduhai, sekiranya (jarak) antara aku dan kamu seperti jarak antara timur dan barat} seperti jarak antara timur dan barat {Itulah seburuk-buruk teman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. inilah kondisi orang yang berpaling dari peringatan Allah di dunia bersama qarinnya, yaitu kesesatan dan memutar balik kebenaran. Sedangkan kondisinya ketika mendatangi Rabbnya di akhirat adalah kondisi yang paling buruk, yaitu penyesalan dan kesedihan yang tidak bisa diobati dan berlepas diri dari qarinnya. Karena itu Allah berfirman, ”sehingga apabila orang-orang yang berpaling itu datang kepada kami (dihari kiamat) dia berkata,”aduhai, semoga (jarak) antaraku dan kamu seperti jarak antara masyriq dan maghrib, maka setan itu adalah sejahat-jahat teman (yang menyertai manusia),” Seperti firman yang lain “Dan (ingatlah) hari (ketika itu) orang yang lalim menggigit dua tangannya, seraya berkata: \"Aduhai kiranya (dulu) aku mengambil jalan bersama-sama Rasul.\" Kecelakaan besarlah bagiku; kiranya aku (dulu) tidak menjadikan sifulan itu teman akrab (ku). Sesungguhnya dia telah menyesatkan aku dari Al Qur'an ketika Al Qur'an itu telah datang kepadaku. Dan adalah setan itu tidak mau menolong manusia.” (QS. Al-furqon : 27-29)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 38: (Sehingga apabila orang yang berpaling itu datang kepada Kami) bersama dengan temannya atau setannya di hari kiamat kelak (dia berkata,) orang yang berpaling itu kepada temannya atau setannya (\"Aduhai) huruf Ya di sini menunjukkan makna Tanbih (seandainya jarak antara aku dan kamu seperti jarak antara masyriq dan Magrib) yakni sejauh jarak antara timur dan barat (maka sejelek-jelek teman) bagiku adalah kamu.\" Lalu Allah berfirman:"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 38",
    "description": "Sehingga apabila dia yang berpaling itu, yakni orang yang tidak mau mengikuti petunjuk Al-Qur'an itu, datang kepada kami pada hari kiamat nanti, dia berkata dengan menyesali apa yang pernah dilakukannya di dunia ini, 'wahai! sekiranya dapat dilakukan, maka jarak antara aku dan kamu seperti jarak antara timur dan barat! memang, teman yang paling jahat bagi manusia adalah setan yang menjadi qarin itu. '39. Allah lalu menafikan apa yang menjadi harapan orang-orang yang enggan mengikuti petunjuk Al-Qur'an dengan mengatakan, 'dan harapanmu itu sekali-kali tidak akan memberi manfaat kepadamu sedikit pun pada hari itu karena kamu pada waktu di dunia dahulu telah menzalimi dirimu sendiri dengan menolak peringatan dari Al-Qur'an dan melakukan perbuatan durhaka. Sesungguhnya kamu dengan qarin-qarinmu itu pantas bersama-sama dalam azab itu, yaitu siksaan api neraka yang amat pedih."
  }
]