[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hari ini tidak ada yang bermanfaat bagi kalian (wahai orang-orang yang berpaling dari al-qur’an) saat kalian menyekutukan Allah di dunia, saat ini kalian sama-sama dalam azab, kalian dan teman-teman itu. Masing-masing dari kalian memperoleh bagian yang penuh dari azab, sebagaimana kalian berserikat dalam kekafiran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Allah berfirman kepada orang-orang kafir pada hari Kiamat, “Hari ini tidak bermanfaat bagi kalian -sedang kalian telah menganiaya diri kalian sendiri dengan melakukan syirik dan kemaksiatan- kebersamaan kalian di dalam azab, teman-teman kalian tidak akan pernah memikul/menanggung azab kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَلَن يَنفَعَكُمُ الْيَوْمَ (sekali-kali tidak akan memberi manfaat kepadamu di hari itu) Kalimat ini akan ditujukan kepada mereka pada hari kiamat. إِذ ظَّلَمْتُمْ(karena kamu telah menganiaya) Yakni akibat kezaliman kalian terhadap diri kalian sendiri di dunia. أَنَّكُمْ فِى الْعَذَابِ مُشْتَرِكُونَ(Sesungguhnya kamu bersekutu dalam azab itu) Yakni persekutuan kalian dalam azab sudah tidak bermanfaat lagi pada hari ini; berbeda halnya ketika di dunia, jika terjadi musibah yang menimpa banyak orang menjadi lebih ringan bagi jiwa; namun karena kerasnya azab di akhirat sehingga kebersamaan mereka dalam azab tidak meringankan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Penyesalan kalian pada hari itu -wahai para pembangkang Alquran- itu ada guna sama sekali, karena ketika di dunia kalian telah mendholimi diri kalian sendiri dengan kekafiran. Kalian juga pantas bersama-sama menerima azab, penyesalan kalian sama sekali tidak berguna. Idz bermakna lam ta’lil. Maksudnya adalah bahwa diazab bersama tidak berarti mengurangi siksa, namun setiap jiwa akan diazab sesuai dengan perbuatan mereka. Perbedaan antara bentuk musibah yang diterima ketika di dunia, menyebabkan dampak penyiksaan bersama itu menjadi menjadi lebih ringan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sekali-kali tidak akan memberi manfaat kepada kalian pada hari itu karena kalian telah berbuat zalim. Sesungguhnya kalian bersekutu dalam azab itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. firman Allah “(harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu dihari itu, karena kamu telah menganiaya (dirimu sendiri). Sesungguhnya kamu bersekutu dalam azab itu,” maksudnya, pada hari kiamat ketika kalian bersama-sama dengan teman dan karib kalian sama sekali tidak berguna bagi kalian. Hal itu karena kalian bersama-sama dalam kezhaliman, karena itu kalian juga mengikuti mereka dalam hukuman dan azabNya. Dan juga tidak berguna bagi kalian ruh pelipur lara dari musibah. Sebab bila musibah menimpa di dunia dan dirasa oleh banyak orang, maka musibah tersebut akan terasa ringan. Sedangkan musibah akhirat itu menyatukan berbagai siksaan yang tidak ada istirahatnya sedikitpun, tidak ada istirahat yang kita kenal ini. Kami memohon kesalamatan kepadamu, wahai Rabb dan berilah kami kenikmatan dengan rahmatMu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 39: (Sekali-kali tidak akan memberi manfaat kepada kalian) angan-angan dan penyesalan kalian itu, hai orang-orang yang berpaling (di hari ini karena kalian telah berbuat aniaya) maksudnya telah jelaslah kelaliman kalian dengan sebab menyekutukan Allah sewaktu di dunia. Lafal Idz merupakan Badal dari lafal Al Yaumu. (Bahwasanya kalian) bersama dengan teman-teman kalian (bersekutu dalam azab ini) adanya illat dalam ayat ini diperkirakan keberadaannya, tidak disebutkan karena kurang penting."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan kekafiran dan kemaksiatan. Kebersamaan mereka dalam azab tidaklah memberikan manfaat apa-apa bagi mereka, demikian pula mereka tidak mendapatkan ruh hiburan saat tertimpa musibah, karena biasanya ketika di dunia saat seseorang tertimpa musibah, lalu ada orang lain pula yang mendapatkan musibah, maka musibah itu terasa ringan dan sebagiannya menghibur yang lain. Adapun musibah di akhirat, maka musibah itu menghimpun semua siksa, di dalamnya tidak ada istirahat meskipun sebentar. Ya Allah, masukkanlah kami ke surga dan jauhkanlah kami dari neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 39",
    "description": "Allah lalu menafikan apa yang menjadi harapan orang-orang yang enggan mengikuti petunjuk Al-Qur'an dengan mengatakan, 'dan harapanmu itu sekali-kali tidak akan memberi manfaat kepadamu sedikit pun pada hari itu karena kamu pada waktu di dunia dahulu telah menzalimi dirimu sendiri dengan menolak peringatan dari Al-Qur'an dan melakukan perbuatan durhaka. Sesungguhnya kamu dengan qarin-qarinmu itu pantas bersama-sama dalam azab itu, yaitu siksaan api neraka yang amat pedih. 40. Maka apakah engkau, wahai nabi Muhammad, dapat menjadikan orang yang tuli, yaitu yang enggan mendengar ajakan kepada kebaikan, bisa mendengar ajakan itu, atau dapatkah engkau memberi petunjuk kepada orang yang buta hatinya untuk berpikir dan memahami petunjuk yang disampaikan kepada mereka dan kepada orang yang tetap dalam kesesatan yang nyata'."
  }
]