[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4 Sesungguhnya Kami menurunkan al-qur’an kepada muhammad dengan bahasa arab, agar kalian memahami dan merenungkan makna-makna dan hujjah-hujjahnya. Dan sesungguhnya ia di lauhil mahfudz di sisi Kami, benar-benar memliki kedudukan dan derajat yang tinggi, muhkam (bermakna jelas) tanpa ada perselisihan dan pertentangan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan sesungguhnya Al-Qur`ān ini di Lauḥul Maḥfūẓ memiliki derajat yang tinggi dan penuh hikmat. Ayat-ayatnya sangat tegas terkait perintah-perintah dan larangan-larangannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَإِنَّهُۥ فِىٓ أُمِّ الْكِتٰبِ (Dan sesungguhnya Al Quran itu dalam induk Al Kitab) Yakni dalam lauhul mahfuzh. لَدَيْنَا(di sisi Kami) Yakni yang ada pada Kami. لَعَلِىٌّ حَكِيمٌ(adalah benar-benar tinggi (nilainya) dan amat banyak mengandung hikmah) Yakni memiliki kedudukan yang tinggi dan kandungan yang serasi yang tidak mengandung kontradiksi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sesungguhnya Al-Qur’an yang dikukuhkan di Lauhil Mahfudz ini berada di sisi Kami dan sungguh memiliki nilai yang sangat tinggi, karena merupakan mukjizat yang paling sempurna di atas setiap kitab sebelumnya. Tidak ada perselisihan dan pertentangan di dalamnya serta mengandung hikmah yang dapat sampai (ke dalam pikiran orang yang menerimanya)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan sesungguhnya (Al-Qur’an) itu} Sesungguhnya Al-Qur’an itu {berada di dalam Ummul Kitāb} Lauhil Mahfuz {di sisi Kami, benar-benar tinggi} benar-benar perkara yang tinggi di antara banyak kitab {dan penuh hikmah} memiliki hikmah yang banyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “dan sesungguhnya al-qur’an itu dalam induk al-kitab (lauhul mahfudz) di sisi kami,” berada di al-mala al-a’la di tingkat paling atas dan paling mulia, “adalah benar-benar tinggi (nilainya) dan amat banyak mengandung hikmah,” yaitu, benar-benar tinggi dalam tingkatan, kemuliaan, dan posisinya, bijaksana dalam segala perintah, larangan, dan berita yang tercakup. Di dalamnya tidak ada hukum yang bersebrangan dengan hikmah, keadilan, dan keseimbangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 4: (Dan sesungguhnya Alquran itu) telah ditetapkan (dalam induk Alkitab) asal Kitab, yaitu Lohmahfuz (di sisi Kami) lafal ayat ini menjadi Badal dari lafal 'Indana (adalah benar-benar tinggi) yang jauh lebih tinggi daripada Kitab-kitab sebelumnya (dan amat banyak mengandung hikmah) artinya sangat padat dengan hikmah-hikmah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di atas kitab-kitab sebelumnya. Penuh hikmah pada perintah dan larangannya serta beritanya. Oleh karena itu, tidak ada satu pun hukum yang menyelisihi hikmah, keadilan dan keselarasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 4",
    "description": "Dan sesungguhnya dia, yaitu Al-Qur'an itu, di dalam ummul-kit'b, yaitu kitab induk atau lau' mahf'z, yang berada di sisi kami dan ia benar-benar bernilai tinggi dan penuh hikmah di dalamnya. '5. Maka apakah dengan penolakan kamu terhadap Al-Qur'an yang kami turunkan itu, wahai orang-orang kafir, akan menyebabkan kami akan berhenti menurunkan ayat-ayat Al-Qur'an sebagai peringatan kepa-damu, karena kamu adalah kaum yang melampaui batas karena kebejatan dan keingkaranmu terhadapnya' sama sekali tidak. Kami tidak akan pernah berhenti menurunkannya. '."
  }
]