[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu (wahai rasul) mampu membuat orang yang Allah tulikan untuk bisa mendengarkan kebenaran atau kamu mampu memberi petunjuk kejalan hidayah kepada orang yang hatinya di butakan oleh Allah sehingga dia tidak melihatnya, atau kamu mampu membimbing orang yang berjalan di atas kesesatan yang nyata lagi jelas ke jalan yang benar?. Semua itu bukan wewenangmu, karena tugasmu hanya menyampaikan, bukan tugasmu yang memberi petunjuk kepada mereka, karena Allah lah yang memberi petunjuk kepada siapa yang Dia kehendaki dan menyesatkan siapa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya mereka itu tuli dari mendengarkan kebenaran dan buta dari melihat kebenaran, maka apakah engkau -wahai Rasul- mampu menjadikan mendengar orang yang tuli, memberi petunjuk kepada orang yang buta atau memberi hidayah kepada orang yang berada dalam kesesatan yang nyata dari jalan yang lurus?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Hai Rasulullah, Apakah kamu dapat menjadikan orang tuli dari kebenaran itu dapat mendengar? Atau dapat memberi petunjuk bagi orang yang buta dari hidayah dan tersesat dari kebenaran?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. أَفَأَنتَ تُسْمِعُ الصُّمَّ أَوْ تَهْدِى الْعُمْىَ (Maka apakah kamu dapat menjadikan orang yang pekak bisa mendengar atau (dapatkah) kamu memberi petunjuk kepada orang yang buta) Yakni kamu tidak akan mampu melakukan itu, maka janganlah kamu merasa sempit dadamu karena kekafiran mereka. وَمَن كَانَ فِى ضَلٰلٍ مُّبِينٍ (dan kepada orang yang tetap dalam kesesatan yang nyata?) Yakni kamu tidak dapat memberi petunjuk kepada orang seperti itu, sebab orang-orang kafir itu seperti orang tuli yang tidak mendengar apa yang kamu datangkan, dan seperti orang buta yang tidak dapat melihat, hal ini akibat kesesatan mereka yang jauh dan kejahilan mereka yang parah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Wahai Rasul apakah engkau mampu menjadikan orang yang tuli dari kebenaran menjadi bisa mendengar? Atau menjadikan orang yang buta akan kebenaran dan petunjuk menjadi bisa melihat? Atau memberi petunjuk kepada orang yang jauh dari kebenaran? Maksudnya adalah bahwa orang-orang kafir itu buta dan tuli serta sesat karena kebodohan dan kekufuran mereka. Kalimat apakah engkau yang mengandung hamzah istifham ini bermaksud membuat pendengarnya menjadi takjub. Ayat ini turun ketika Rasul merasa telah lelah dalam menyeru ummatnya, sehingga mereka semakin tersesat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah kamu dapat membuat mendengar orang-orang yang tuli atau kamu dapat memberi petunjuk kepada orang-orang yang buta dan kepada orang yang tetap dalam kesesatan yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah berfirman pada RasulNya Muhammad seraya memberi hiburan atas keengganan orang-orang yang mendustakan, dan tidak mau mengikuti seruan beliau, dan bahwasannya tidak ada kebaikan pada diri mereka dan tidak ada kesucian dalam diri mereka untuk diajak menuju petunjuk, ”maka apakah kamu dapat menjadikan orang yang tuli menjadi mendengar,” yaitu orang-orang yang tidak mendengar,”atau (dapatkah) kamu memberi petunjuk kepada orang yang buta?” yakni, orang-orang yang tidak melihat,ataukah engkau bisa memberi mereka petunjuk para orang “yang tetap dalam kesesatan yang nyata.” Yaitu terang dan jelas, Karena ia mengetahui kesesatan tapi ridha dengannya. Sebagaimana orang tuli tidak mendengar suara dan orang buta tidak bisa melihat, begitu juga orang yang amat tersest dengan nyata juga tidak bisa mendapat petunjuk. Fitrah dan akal sehat mereka rusak karena berpaling dari peringatan. Mereka membuat keyakinan palsu dan sifat-sifat yang menghalangi antara mereka dengan petunjuk yang mengharuskan mereka terjembab dalam kebinasaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 40: (Maka apakah kamu dapat menjadikan orang yang pekak dapat mendengar, atau dapatkah kamu memberi petunjuk kepada orang yang buta hatinya dan kepada orang yang tetap dalam kesesatan yang nyata?) jelas sesatnya, maksudnya mereka tidak beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman kepada Rasul-Nya memberinya hiburan karena orang-orang yang mendustakan tidak mau memenuhi seruan Beliau shallallahu 'alaihi wa sallam, dan bahwa mereka tidak memiliki kebaikan sama sekali serta tidak memiliki sifat baik yang membuat mereka mendatangi petunjuk. Dia tersesat dalam keadaan tahu bahwa dirinya tersesat dan ridha dengannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 40",
    "description": "Maka apakah engkau, wahai nabi Muhammad, dapat menjadikan orang yang tuli, yaitu yang enggan mendengar ajakan kepada kebaikan, bisa mendengar ajakan itu, atau dapatkah engkau memberi petunjuk kepada orang yang buta hatinya untuk berpikir dan memahami petunjuk yang disampaikan kepada mereka dan kepada orang yang tetap dalam kesesatan yang nyata'41-42. Maka sungguh, sekiranya kami membawamu pergi dengan mewafatkanmu atau dengan cara yang lain sebelum engkau mencapai kemenangan, maka sesungguhnya kami akan tetap memberikan azab kepada mereka di akhirat nanti, atau kami perlihatkan kepadamu azab yang telah kami ancamkan atau sampaikan kepada mereka. Maka sungguh, kami maha berkuasa untuk menurunkan siksaan atas mereka. '."
  }
]