[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42 Bila Kami mewafatkanmu (wahai rasul), sebelum kamu menang atas orang-orang yang mendustakan dari kaummu, maka Kami akan tetap membalas mereka di akhirat, atau Kami memperlihatkan kepadamu siksa Kami yang telah Kami ancamkan kepada mereka bahwa ia akan turun menimpa mereka, seperti pada hari perang badar. Sesungguhnya Kami maha kuasa untuk melakukan hal itu atas mereka, kuasa untuk memenangkanmu atas mereka dan merendahkan mereka melalui kedua tanganmu dan tangan orang-orang yang beriman kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Maka seandainya Kami mewafatkan kamu -dengan mematikan kamu sebelum Kami menyiksa mereka- maka sesungguhnya Kami akan membalas mereka dengan menyiksa mereka di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-45. Yang tersisa bagi mereka hanyalah azab dan siksaan. Hai Rasulullah, jika Kami mewafatkanmu sebelum mereka binasa, maka Kami akan membalas mereka setelah kematianmu; atau Kami akan membuatmu menyaksikan azab yang Kami ancamkan kepada mereka. Kami Maha Kuasa untuk menolongmu dalam menghadapi mereka, maka berpeganglah dengan teguh pada perintah Allah. Sungguh kamu berada dalam agama Islam, dan al-Qur’an ini merupakan kemuliaan bagimu dan bagi kaummu karena diturunkan menggunakan bahasa mereka, sehingga mereka menjadi orang yang paling mengetahui tentangnya. Dan pada hari kiamat kalian akan ditanya tentang keimanan dan pengamalannya. Hai Rasulullah, tanyalah kepada para pengikut rasul-rasul sebelummu: Apakah Allah mengizinkan untuk menyembah berhala-berhala? Dari Qatadah, tentang firman Allah: (فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُم مُّنتَقِمُونَ) ia berkata, Anas berkata: Rasulullah telah pergi (wafat) dan siksaan masih belum diturunkan, Allah tidak menjadikan Rasulullah menyaksikan sesuatu yang tidak beliau harapkan pada umatnya hingga beliau wafat. Padahal, tidak ada seorang nabipun melainkan dia telah menyaksikan siksaan bagi umatnya, kecuali nabi kalian (Nabi Muhammad). (Diriwayatkan al-Hakim dalam al-Mustadrak 2/447, kitab tafsir, dishahihkan dan disepakati oleh az-Dzahabi. Dan diriwayatkan al-Baihaqi dalam Syu’abul Iman 4/118-119 no. 1410. Serta diriwayatkan ad-Dhiya al-Maqdisi dalam al-Mukhtarah 6/107-108 no. 2097-2100 dari berbagai jalur dari Hamid at-Thawil dari Anas. Dishahihkan oleh muhaqqiq kitab Syu’abul iman: Para perawinya Tsiqat)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. فَإِمَّا نَذْهَبَنَّ بِكَ (Sungguh, jika Kami mewafatkan kamu) Yakni mematikan kamu sebelum azab menimpa mereka. فَإِنَّا مِنْهُم مُّنتَقِمُونَ (maka sesungguhnya Kami akan menyiksa mereka (di akhirat)) Baik itu di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Maka sekiranya Kami mewafatkanmu sebelum mereka mendapatkan azab, maka Kami akan tetap memberikan azab bagi mereka di akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka sungguh jika Kami benar-benar mewafatkanmu} Kami mewafatkanmu sebelum Kami mengazab mereka {sesungguhnya Kami akan memberikan balasan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. tidak tersisa apapun buat mereka selain azab dan hukuman, baik di dunia maupun diakhirat. Karena itu Allah berfirman, ”sungguh, jika kami mewafatkan kamu (sebelum kamu mencapai kemenangan), maka sesungguhnya kami akan menyiksa mereka (di akhiart),” yaitu bila kami mewafatkanmu sebelum kami memberitahukan azab yang kami yang benar bahwa kami benar-benar akan menyiksa mereka yang mendustakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 41: (Sungguh, jika) lafal Imma asalnya adalah gabungan antara Syarthiyyah dan Ma Zaidah (Kami mewafatkan kamu) sebelum Kami mengazab mereka (maka sesungguhnya Kami akan menyiksa mereka) di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana orang yang tuli tidak dapat mendengar suara, orang yang buta tidak dapat melihat dan orang yang sesat dengan kesesatan yang nyata tidak mendapatkan petunjuk, maka mereka ini telah rusak fitrah dan akalnya karena berpaling dari peringatan dan mengadakan keyakinan yang baru dan sifat yang buruk yang menghalangi mereka dari petunjuk dan mengharuskan mereka bertambah sengsara, sehingga tidak tersisa lagi bagi mereka selain azab dan hukuman baik di dunia maupun di akhirat. Yakni sebelum engkau mencapai kemenangan atau sebelum memperlihatkan azab yang dijanjikan-Nya kepada mereka, maka ketahuilah Kami tetap akan memberikan azab kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 41",
    "description": "41-42. Maka sungguh, sekiranya kami membawamu pergi dengan mewafatkanmu atau dengan cara yang lain sebelum engkau mencapai kemenangan, maka sesungguhnya kami akan tetap memberikan azab kepada mereka di akhirat nanti, atau kami perlihatkan kepadamu azab yang telah kami ancamkan atau sampaikan kepada mereka. Maka sungguh, kami maha berkuasa untuk menurunkan siksaan atas mereka. '41-42"
  }
]