[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42 Bila Kami mewafatkanmu (wahai rasul), sebelum kamu menang atas orang-orang yang mendustakan dari kaummu, maka Kami akan tetap membalas mereka di akhirat, atau Kami memperlihatkan kepadamu siksa Kami yang telah Kami ancamkan kepada mereka bahwa ia akan turun menimpa mereka, seperti pada hari perang badar. Sesungguhnya Kami maha kuasa untuk melakukan hal itu atas mereka, kuasa untuk memenangkanmu atas mereka dan merendahkan mereka melalui kedua tanganmu dan tangan orang-orang yang beriman kepadamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Atau Kami memperlihatkan kepadamu sebagian dari siksa yang pernah Kami janjikan kepada mereka, sesungguhnya Kami berkuasa atas mereka, mereka tidak bisa mengalahkan Kami sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. أَوْ نُرِيَنَّكَ الَّذِى وَعَدْنٰهُمْ (Atau Kami memperlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka) Yakni memperlihatkan azab yang diturunkan kepada mereka sebelum kematianmu. فَإِنَّا عَلَيْهِم مُّقْتَدِرُونَ(Maka sesungguhnya Kami berkuasa atas mereka) Yakni jika Kami telah menghendaki niscaya Kami akan mengazab mereka. Dan Allah telah memperlihatkan azab yang ditimpakan kepada mereka pada perang Badar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Ataukah akan Kami perlihatkan azab yang telah Kami siapkan untuk mereka sebelum kewafatanmu. Kami sungguh Maha Kuasa untuk mengazab mereka, dan itu sudah terjadi ketika perang Badr."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau Kami benar-benar memperlihatkan kepadamu sesuatu yang telah Kami ancamkan kepada mereka. Sesungguhnya Kami Maha Berkuasa atas mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “atau kami memperlihatkan kepadamu (azab) yang telah kami (Allah) ancamkan kepada mereka,” berupa azab, “maka sesungguhnya kami berkuasa atas mereka,” tapi hal itu bergantung pada putusan hikmah Allah, apakah azabnya dipercepat atau ditunda. Inilah kondisimu bersama mereka yang mendustakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 42: (Atau kami memperlihatkan kepadamu) sewaktu kamu masih hidup (apa yang telah Kami ancamkan kepada mereka) yakni azab yang Kami ancamkan itu (maka sesungguhnya Kami atas mereka) maksudnya, untuk mengazab mereka (berkuasa) sangat berkuasa atau sangat mampu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya ialah kemenangan Muhammad shallallahu 'alaihi wa sallam dan kehancuran kaum musyrik. Akan tetapi hal itu sesuai kebijaksanaan-Nya untuk menangguhkan azab atau menyegerakannya. Inilah keadaan engkau dan keadaan orang-orang yang mendustakanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 42",
    "description": "41-42. Maka sungguh, sekiranya kami membawamu pergi dengan mewafatkanmu atau dengan cara yang lain sebelum engkau mencapai kemenangan, maka sesungguhnya kami akan tetap memberikan azab kepada mereka di akhirat nanti, atau kami perlihatkan kepadamu azab yang telah kami ancamkan atau sampaikan kepada mereka. Maka sungguh, kami maha berkuasa untuk menurunkan siksaan atas mereka. '43. Wahai Muhammad, berpegang teguhlah engkau kepada apa yang telah di wahyukan Allah kepadamu. Dengan demikian, sungguh engkau berada di jalan yang lurus."
  }
]