[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka berpeganglah (wahai rasul) dengan apa yang Allah perintahkan dalam al-qur’an yang telah Dia wahyukan kepadamu. Sesungguhnya kamu berada di atas jalan yang lurus. itulah agama Allah yang Dia perintahkan, yaitu islam. Disini terkandung peneguhan bagi rasulullah dan sanjungan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Maka berpegang teguhlah -wahai Rasul- dengan apa yang telah diwahyukan kepadamu oleh Rabbmu dan laksanakanlah, sesungguhnya engkau berada pada jalan kebenaran, tidak ada keraguan padanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Maka berpegang teguhlah dengan Alquran yang telah diwahyukan padamu wahai Rasul. Sekalipun mereka mendustakannya, kamu tetaplah dalam jalan lurus dan agama yang benar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berpegang teguhlah pada apa yang telah diwahyukan kepadamu. Sesungguhnya kamu berada di jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. sedangkan engkau “maka berpegang teguhlah kamu kepada agama yang telah diwahyukan kepadamu,” baik tindakan maupun sifat terhadap sifat yang diperintahkan dan menyeru padanya serta berusaha untuk melaksankannya pada dirimu sendiri dan pada orang lain. “sesungguhnya kamu berada diatas jalan yang lurus,” yang menghantarkan kepada Allah dan kepada tempat kemuliaanNYa. Inilah yang membuatmu untuk semakin berpegang teguh dan mendapatkan petunjuk bila kau mengetahui bahwa agama itu adalah benar, adil, jujur, berdiri diatas dasar yang kokoh, sementara yang lain membangun kenyamannya diatas keraguan, dugaan, dan kezhaliman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 43: (Maka berpegang teguhlah kamu kepada apa yang telah diwahyukan kepadamu) yakni Alquran. (Sesungguhnya kamu berada di atas jalan) atau tuntunan (yang lurus.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni adapun engkau, maka berpeganglah…dst. Baik dengan mengerjakannya maupun bersifat dengannya, demikian pula mendakwahkannya dan berusaha mewujudkannya (berpegang teguh itu) baik pada dirimu maupun pada diri orang lain. Yang menyampaikan kepada Allah dan kepada surga-Nya. Hal ini mengharuskan engkau berpegang kepada agama-Nya dengan kuat dan menjadikannya petunjuk, jika engkau mengetahui bahwa engkau berada di atas yang hak, di atas keadilan, dan kebenaran, dan engkau berada di atas bangunan yang berpondasi kuat, sedangkan orang lain berada di atas bangunan yang mudah roboh; di atas keraguan, persangkaan, dan kezaliman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 43",
    "description": "Wahai Muhammad, berpegang teguhlah engkau kepada apa yang telah di wahyukan Allah kepadamu. Dengan demikian, sungguh engkau berada di jalan yang lurus. 44. Dan ketahuilah wahai nabi Muhammad, bahwa sesungguhnya Al-Qur'an yang diturunkan kepadamu itu benar-benar suatu peringatan dan pengajaran yang sangat baik bagimu dan bagi kaummu dan semua yang mengikuti tuntunanmu, dan kelak kamu sekalian akan dimintai pertanggungjawaban."
  }
]