[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya al-qur’an ini merupakan kemuliaan bagimu dan bagi kuammu dari quraisy, dimana ia turun dengan bahasa mereka, mereka orang-orang yang paling memahaminya, maka selayaknya mereka menjadi orang-orang yang paling kuat menegakannya dan paling gigih mengamalkannya. Dan kalian akan ditanya kamu dan orang-orang yang bersamamu, tentang kewajiban syukur kepada Allah dan mengamalkan tuntutannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Dan sesungguhnya Al-Qur`ān ini merupakan kemuliaan bagimu dan kemuliaan bagi kaummu, maka kamu akan dimintai pertanggungjawaban pada hari Kiamat tentang keimanan terhadapnya, mengikuti petunjuknya dan seruan kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَإِنَّهُۥ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ ۖ (Dan sesungguhnya Al Quran itu benar-benar adalah suatu kemuliaan besar bagimu dan bagi kaummu) Yakni al-Qur’an adalah kehormatan bagimu dan bagi kaum Quraisy yang merupakan kaummu, sebab al-Qur’an diturunkan kepadamu sedangkan kamu berasal dari Quraisy dengan menggunakan bahasamu yang merupakan bahasa mereka juga. Pendapat lain mengatakan maknanya adalah bahwa al-Qur’an merupakan peringatan yang kalian gunakan untuk mengingatkan kalian terhadap urusan agama dan untuk kalian amalkan. وَسَوْفَ تُسْـَٔلُونَ(dan kelak kamu akan diminta pertanggungan jawab) Terhadap kehormatan yang Allah berikan kepada kalian. Dan mereka juga akan dimintai pertanggungjawaban terhadap apa yang wajib mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Sesungguhnya Alquran ini benar-benar suatu keagungan bagimu juga bagi kaummu yang diturunkan dengan bahasa mereka. Pada hari kiamat kelak mereka akan dimintai pertanggungjawaban atas segala perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya (Al-Qur’an) itu} Sesungguhnya Al-Qur’an itu {benar-benar merupakan kemuliaan} kemuliaan {bagimu dan bagi kaummu dan kelak kamu akan dimintai pertanggung jawaban"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “dan sesungguhnya al-qur’an itu benar-benar suatu kemuliaan besar bagimu dan bagi kaummu,” yaitu kebanggaan bagimu, kebajikan agung serta nikmat yang tidak terkira dan tidak diketahui sifatnya serta mengingatkanmu juga pada kebaikan dunia dan akhirat serta mendorongmu padanya. Juga mengingatkanmu pada keburukan dan memperingatkanmu darinya. “dan kelak kamu akan diminta pertanggung jawaban,” darinya, apakah kalian menunaikannya sehingga derajat kalian tinggi serta kalian mendapat manfaat, ataukah kalian tidak menunaikannya sehingga menjadi hujjah yang akan melawan kalian serta sebagai suatu kekufuran dari kalian dengan nikmat ini?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 44: (Dan sesungguhnya Alquran itu benar-benar adalah suatu kemuliaan besar) benar-benar merupakan kemuliaan yang besar (bagimu dan bagi kaummu) karena diturunkan dengan memakai bahasa mereka (dan kelak kalian akan diminta pertanggungan jawab) tentang pengamalannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bisa juga diartikan sebagai kemuliaan dan ketinggian bagimu serta nikmat yang tidak dapat diukur besarnya, demikian pula mengingatkan kamu sesuatu yang di sana terdapat kebaikan di dunia maupun di akhirat, mendorongmu kepadanya, serta mengingatkan kamu kepada keburukan dan menakut-nakuti kamu darinya. Yakni yang terkait dengan Al Qur’an itu; apakah kamu sudah memenuhi haknya sehingga Al Qur’an menjadi hujjah bagimu atau malah tidak memenuhinya sehingga Al Qur’an menjadi hujjah atasmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 44",
    "description": "Dan ketahuilah wahai nabi Muhammad, bahwa sesungguhnya Al-Qur'an yang diturunkan kepadamu itu benar-benar suatu peringatan dan pengajaran yang sangat baik bagimu dan bagi kaummu dan semua yang mengikuti tuntunanmu, dan kelak kamu sekalian akan dimintai pertanggungjawaban. 45. Dan tanyakanlah, wahai Muhammad, kepada rasul-rasul kami yang telah kami utus kepada umat-umat sebelum engkau, \"apakah kami menentukan tuhan-tuhan selain Allah yang maha pengasih untuk disembah'\" tentu tidak. Kami hanya menentukan satu tuhan yang disembah, yaitu Allah yang maha esa."
  }
]