[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bertanyalah (wahai rasul) kepada para pengikut nabi-nabi yang telah Kami utus sebelummu dan para pembawa syariat mereka, ”apakah utusan-utusan mereka mengajak manusia untuk menyembah selain Allah?”. maka mereka akan mengabarkan kepadamu bahwa hal itu tidak terjadi, karena semua rasul mengajak kepada apa yang kamu serukan kepada manusia sekarang, yaitu menyembah Allah semata. yang tidak ada sekutu bagiNya dan melarang menyembah selainNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan tanyakanlah -wahai Rasul- kepada para rasul yang telah Kami utus sebelummu, apakah Kami menjadikan selain Ar-Raḥmān tuhan-tuhan untuk disembah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَسْـَٔلْ مَنْ أَرْسَلْنَا مِن قَبْلِكَ مِن رُّسُلِنَآ أَجَعَلْنَا مِن دُونِ الرَّحْمٰنِ ءَالِهَةً يُعْبَدُونَ (Dan tanyakanlah kepada rasul-rasul Kami yang telah Kami utus sebelum kamu: “Adakah Kami menentukan tuhan-tuhan untuk disembah selain Allah Yang Maha Pemurah?”) Yang dimaksud adalah pertanyaan kepada para rasul pada malam Isra mi’raj ketika beliau menemui mereka. Pendapat lain mengatakan maknanya adalah tanyakanlah kepada umat-umat yang telah Kami utus kepada mereka para rasul, apakah Allah mengizinkan penyembahan terhadap berhala-berhala dalam suatu agama? Apakah hal itu diperbolehkan bagi salah satu dari umat itu?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Bertanyalah wahai Rasul, tentang umat para rasul terdahulu yang telah kami bangkitkan sebelummu: “Apakah Allah pernah mengizinkan menjadikan berhala sebagai sesembahan, juga apakah kalian tidak pernah diperingatkan?” Maksudnya adalah bahwa para Nabi terdahulu kesemuanya bersaksi dan menyeri kepada pengesaan Allah, juga perintah ini sudah ada sejak dulu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tanyakanlah kepada rasul-rasul Kami yang telah Kami utus sebelum kamu,“Apakah Kami menjadikan selain Dzat yang Maha Pengasih sebagai tuhan-tuhan yang disembah”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “dan tanyakanlah kepada rasul-rasul kami yang telah kami utus sebelkum kamu, ‘adakah kami menentukan sesembahan-sesembahan untuk disembah selain Allah yang maha pemurah’,” sehingga orang-orang musyrik memilki semacam hujjah yang mereka ikuti dari salah seorang rasul tersebut? Bila kau bertanya dan mencari tahu kondisi mereka (para rasul) kau tidak akan mendapatkan satupun dari mereka yang menyeru untuk menjadikan tuhan lain bersama Allah. Semua rasul dari yang pertama hingga yang terakhir sama menyeru untuk menyembah Allah semata, yang tidak ada sekutu bagiNya. Allah berfirman, ”dan sesungguhnya kami telah mengutus rasul pada tiap-tiap umat (untuk menyerukan),’sembahlah Allah (saja), dan jauhilah thagut,” (an-nahl:36) Semua rasul yang diutus Allah mengatakan pada kaumnya, ”sembahlah Allah, tidak ada bagi kalian tuhan lain selainNya,” hal ini menunjukkan bahwa orang-orang musyrik tidak memilki sandaran dalam kesyirikan mereka, bukan berasal dari akal sehat dan juga bukan berita para rasul."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 45: (Dan tanyakanlah kepada rasul-rasul Kami yang telah Kami utus sebelum kamu, \"Adakah Kami menentukan selain Allah Yang Maha Pemurah) (sebagai tuhan-tuhan untuk disembah), menurut suatu pendapat bahwa hal ini memang berdasarkan kenyataan, yaitu seumpamanya Allah mengumpulkan rasul-rasul itu pada malam sewaktu nabi diisra-kan. Menurut pendapat yang lain bahwa yang dimaksud adalah umat-umat dari kalangan ahli kitab. Kedua pendapat tadi tidak usah diselidiki kebenarannya, karena makna yang dimaksud dari perintah menanyakan ini ialah untuk menetapkan terhadap orang-orang musyrik Quraisy, bahwasanya tiada seorang utusan pun dari Allah dan tiada pula suatu kitab pun yang diturunkan-Nya yang memerintahkan untuk menyembah kepada selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang berpendapat, bahwa perintah ini sesuai zhahirnya, yaitu pada malam Beliau berisraa’-mi’raj dikumpulkan para rasul kepada Beliau, lalu Beliau diperintahkan untuk bertanya kepada para rasul, namun Beliau sudah cukup yakin sehingga tidak bertanya. Namun kebanyakan para mufassir berkata, “(Maksudnya) bertanyalah kepada orang-orang mukmin dari Ahli Kitab yang para nabi diutus kepada mereka, bukankah para rasul datang membawa tauhid?” Ini adalah pendapat Ibnu Abbas dalam semua riwayat, Mujahid, Qatadah, Adh Dhahhak, As Suddiy, Al Hasan dan dua orang Muqatil. Hal ini ditunjukkan pula oleh qiraat Abdullah (Ibnu Mas’ud) dan Ubay, “Was ‘alilladziina ar salnaa ilaihim qablaka rusulanaa.” Perintah untuk bertanya ini adalah untuk menyatakan kepada kaum musyrik Quraisy, bahwa tidak ada satu pun rasul maupun kitab yang memerintahkan beribadah kepada selain Allah Subhaanahu wa Ta'aala. Ayat ini menunjukkan bahwa semua para rasul menyuruh menyembah Allah dan menjauhi sesembahan selain-Nya. Demikian pula menunjukkan bahwa kaum musyrik tidak memiliki sandaran dalam syriknya, baik dari akal yang sehat maupun nukilan dari para rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 45",
    "description": "Dan tanyakanlah, wahai Muhammad, kepada rasul-rasul kami yang telah kami utus kepada umat-umat sebelum engkau, \"apakah kami menentukan tuhan-tuhan selain Allah yang maha pengasih untuk disembah'\" tentu tidak. Kami hanya menentukan satu tuhan yang disembah, yaitu Allah yang maha esa. 46. Ayat yang lalu berbicara tentang rasul-rasul Allah yang telah diutus sebelum nabi Muhammad. Ayat ini berbicara tentang nabi musa, salah satu dari rasul-rasul itu. Dan sungguh, kami telah mengutus musa dengan membawa mukjizat-Mukjizat, yakni bukti-bukti kenabian dan kerasulannya serta bukti-bukti kekuasaan kami, kepada fir'aun, yang mengaku dirinya sebagai tuhan, dan pemuka-pemuka kaumnya yang mendukung dan mempertahankan pengakuannya itu. Maka dia, yakni nabi musa, berkata, 'sesungguhnya aku adalah utusan dari tuhan yang telah menciptakan kalian, dan memiliki seluruh alam. '."
  }
]