[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-47 Sungguh Kami telah mengutus Musa dengan membawa hujjah-hujah Kami kepada fir’aun dan para pemuka kaumnya, sebagaimana Kami mengutusmu (wahai rasul) kepada orang-orang musyrik dari kaummu, maka Musa berkata kepada mereka , ”sesungguhnya aku adalah utusan tuhan semesta alam.” Ketika musa datang dengan membawa keterangan-keterangan yang nyata yang membuktikan kebenarannya dalam dakwahnya, ternyata fir’aun dan orang-orangnya menertawakan ayat-ayat dan bukti-bukti yang dibawa musa kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan sungguh Kami telah mengutus Musa dengan tanda-tanda kekuasaan Kami kepada Fir'aun dan orang-orang terpandang dari kaumnya dan dia berkata kepada mereka, “Aku adalah utusan Rabb segala makhluk.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46-47. Sungguh Kami telah mengutus Musa dengan ayat-ayat yang menunjukkan keesaan Kami dan dengan mukjizat-mukjizat yang menunjukkan kebenaran risalah Musa kepada Fir’aun dan para tentaranya. Musa berkata: “Aku adalah rasul yang diutus Tuhan semesta alam kepada kalian.” Ketika Musa mendatangkan ayat-ayat dan berbagai mukjizat, mereka menyikapinya dengan tertawaan dan hinaan sebagai bentuk pengingkaran mereka terhadap risalahnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِـَٔايٰتِنَآ (Dan sesunguhnya Kami telah mengutus Musa dengan membawa mukjizat-mukjizat Kami) Yakni sembilan mukjizat yang telah disebutkan pada surat al-Isra: 101. إِلَىٰ فِرْعَوْنَ وَمَلَإِي۟هِۦ(kepada Fir’aun dan pemuka-pemuka kaumnya) Yakni para petinggi kaumnya. فَقَالَ إِنِّى رَسُولُ رَبِّ الْعٰلَمِينَ (Maka Musa berkata: “Sesungguhnya aku adalah utusan dari Tuhan seru sekalian alam”) Yang mengutusku kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Kami telah mengutus Musa sebagai rasul sebelummu dengan berbagai ayat yang menunjukkan kemahaesaan Kami juga dengan 9 mukjizat sebagai bukti kebenaran risalahnya. Hal ini telah tercantum pada surat Al a’raf ayat 133 dan sebagainya. Kami telah mengutusnya kepada Fir’aun serta para petinggi rakyat dan kaumnya. Musa berkata kepada mereka: Aku adalah rasul yang diutus Tuhan semesra alam untuk menyeru kalian untuk menuntun kalian pada pengesaan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah mengutus Musa dengan membawa ayat-ayat Kami kepada Fir‘aun dan para pemukanya} para pemuka kaumnya {Dia berkata,“Sesungguhnya aku adalah utusan dari Tuhan semesta alam”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. ketika Allah berfirman, ”dan tanyankanlah kepada rasul-rasul kami yang telah kami utus sebelum kamu,’ adakah kami menentukan sesembahan-sesembahan selain Allah yang maha pemurah,” Allah menjelaskan kondisi nabi musa dan seruannya yang merupakan seruan termasyhur diantara para rasul, dan juga karena Allah sering menyebutnya di dalam al-qur’an. Allah menyebutkan kondisinya bersama fir’aun seraya berfirman”dan sesungguhnya kami telah mengutus musa dengan membawa mukjizat-mukjizat kami,” yang secara pasti menunjukkan kebenaran yang dibawanya seperti, tongkat, ular, belalang, kutu, dan mukjizat lain untuk fir’aun dan tentaranya (pemuka kaumnya) seraya berkata,”sesungguhnya kau adalah utusan dari Rabb seru sekalian alam,” musa mengajak mereka untuk mengakui Rabb mereka dan melarang mereka untuk menyembah selainNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 46: (Dan sesungguhnya Kami telah mengutus Musa dengan membawa mukjizat-mukjizat Kami kepada Firaun dan pemukapemuka kaumnya) yaitu bangsa Kobtik, (maka Musa berkata, \"Sesungguhnya aku adalah utusan dari Rabb seru sekalian alam.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala berfirman, “Dan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, \"Apakah kami menentukan tuhan-tuhan selain Allah Yang Maha Pengasih untuk disembah?\", maka Dia menerangkan keadaan Musa dan dakwahnya yang sudah masyhur. Yang menunjukkan kebenaran kerasulannya dan apa yang Beliau serukan, seperti tongkat, ular, pengiriman belalang dan kutu, dll. Beliau mengajak mereka mengakui Tuhan mereka (Allah) dan melarang mereka beribadah kepada selain-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 46",
    "description": "Ayat yang lalu berbicara tentang rasul-rasul Allah yang telah diutus sebelum nabi Muhammad. Ayat ini berbicara tentang nabi musa, salah satu dari rasul-rasul itu. Dan sungguh, kami telah mengutus musa dengan membawa mukjizat-Mukjizat, yakni bukti-bukti kenabian dan kerasulannya serta bukti-bukti kekuasaan kami, kepada fir'aun, yang mengaku dirinya sebagai tuhan, dan pemuka-pemuka kaumnya yang mendukung dan mempertahankan pengakuannya itu. Maka dia, yakni nabi musa, berkata, 'sesungguhnya aku adalah utusan dari tuhan yang telah menciptakan kalian, dan memiliki seluruh alam. '47. Maka ketika dia, yakni nabi musa, datang kepada mereka membawa mukjizat-Mukjizat kami itu untuk memperkuat ke rasulannya, seperti tongkatnya yang berubah menjadi ular, seketika itu mereka mengejek dan menertawakannya."
  }
]