[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "46-47 Sungguh Kami telah mengutus Musa dengan membawa hujjah-hujah Kami kepada fir’aun dan para pemuka kaumnya, sebagaimana Kami mengutusmu (wahai rasul) kepada orang-orang musyrik dari kaummu, maka Musa berkata kepada mereka , ”sesungguhnya aku adalah utusan tuhan semesta alam.” Ketika musa datang dengan membawa keterangan-keterangan yang nyata yang membuktikan kebenarannya dalam dakwahnya, ternyata fir’aun dan orang-orangnya menertawakan ayat-ayat dan bukti-bukti yang dibawa musa kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Maka tatkala dia mendatangi mereka dengan tanda-tanda kekuasaan Kami, mereka menertawakannya sebagai bentuk cemoohan dan hinaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Ketika Musa datang kepada mereka dengan membawa ayat yang menunjukkan kebenaran risalahnya. Mereka menganggapnya sebagai sihir dan olok-olokan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia datang kepada mereka dengan ayat-ayat Kami, seketika itu mereka menertawakannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47-48. ”maka tatkala dia datang kepada mereka dengan membawa mukjizat-mukjizat kami, dengan serta merta mereka menertawakannya,” yaitu mereka menolak, mengingkari, dan menertawakannya secara zhalim dan sombong. Hal itu bukan karena kekurangan dalam tanda-tanda kebesaran Allah dan bukan karena kurang jelasnya tanda-tanda itu, karena itu Allah berfirman,”dan tidaklah kami perlihatkan kepada mereka suatu mukjizat kecuali mukjizat itu lebih besar dari mukjizat-mujizat sebelumnya,”artinya, tanda-tanda kebesaran Allah yang belakangan lebih besar dari yang sebelumnya.”dan kami timpakan kepada mereka azab,” seperti dengan belalang, katak,kutu, dan darah sebagai tanda-tanda kebesaran yang memberi penjelasan.”supaya mereka kembali (kejalan yang benar)” pada islam dan tunduk padanya, agar kesyirikan dan keburukan mereka sirna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 47: (Maka tatkala dia datang kepada mereka dengan membawa mukjirat-mukjizat Kami) yang menunjukkan kebenaran risalahNya (dengan serta merta mereka menertawakannya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka menolak dan mengingkarinya serta memperolok-oloknya dengan sikap zalim dan sombong, sehingga hal itu bukan karena mukjizatnya yang kurang dan tidak jelasnya ayat-ayatnya. Oleh karena itulah di ayat selanjutnya, Allah Subhaanahu wa Ta'aala berfirman, “Dan tidaklah Kami perlihatkan suatu mukjizat kepada mereka kecuali (mukjizat itu) lebih besar dari mukjizat-mukjizat (yang sebelumnya).”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 47",
    "description": "Maka ketika dia, yakni nabi musa, datang kepada mereka membawa mukjizat-Mukjizat kami itu untuk memperkuat ke rasulannya, seperti tongkatnya yang berubah menjadi ular, seketika itu mereka mengejek dan menertawakannya. 48. Dan tidaklah kami perlihatkan suatu ayat, yaitu tanda kekuasaan kami, berupa mukjizat kepada mereka kecuali ia lebih besar dari mukjizat-Mukjizat yang sebelumnya. Namun demikian, mereka tetap bersikeras dengan sikap dan keyakinan mereka yang enggan menerima kebenaran. Dan akibat dari perbuatan mereka itu kami timpakan kepada mereka azab duniawi sebagai cobaan dari kami seperti kekurangan makanan, berjangkitnya hama tumbuh-tumbuhan agar mereka kembali ke jalan yang benar."
  }
]