[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidak memperlihatkan kepada fir’aun dan orang-orangnya sebuah hujjah kecuali ia lebih agung dari yang sebelumnya dan lebih jelas dalam membuktikan kebenaran apa yang didakwahkan oleh musa. Dan kami telah menimpakan kepada mereka berbagai macam azab, seperti belalang, kodok, kutu, banjir bandang dan sebagainya, agar mereka meninggalkan kekafiran mereka kepada Allah dan berganti dengan mentauhidkan dan menaatiNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan tidaklah Kami tunjukkan kepada Fir'aun dan para pembesar dari kaumnya mukjizat atas kebenaran apa yang dibawa oleh Musa -'alaihissalām- melainkan lebih besar dari mukjizat yang telah ditunjukkan sebelumnya, dan Kami timpakan azab atas mereka di dunia dengan harapan agar mereka berhenti dari kekufuran yang mereka lakukan, akan tetapi hal itu tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Tidaklah Kami menunjukkan kepada Fir’aun dan tentaranya suatu mukjizat melainkan mukjizat itu lebih besar dari mukjizat sebelumnya. Dan Kami memberi mereka berbagai jenis azab agar mereka berhenti dari kekafiran dan beriman kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَمَا نُرِيهِم مِّنْ ءَايَةٍ إِلَّا هِىَ أَكْبَرُ مِنْ أُخْتِهَا ۖ (Dan tidaklah Kami perlihatkan kepada mereka sesuatu mukjizat kecuali mukjizat itu lebih besar dari mukjizat-mukjizat yang sebelumnya) Yakni setiap mukjizat Musa lebih besar daripada mukjizat sebelumnya. Pendapat lain mengatakan yakni jika mukjizat pertama digabung dengan mukjizat kedua maka mukjizat itu akan semakin jelas. وَأَخَذْنٰهُم بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ(Dan Kami timpakan kepada mereka azab supaya mereka kembali (ke jalan yang benar)) Yakni akibat perdustaan mereka terhadap mukjizat-mukjizat mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Kami tidak memperlihatkan kepada para pembangkang Alquran suatu mukjizat kecuali mukjizat-mukjizat itu lebih besar dan lebih agung dari pada sebelumnya. Kami timpakan kepada mereka azab, berupa kekeringan, banjir bandang, kekurangan harta dan buah-buahan agar mereka keluar dari kekafiran dan kesesatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak memperlihatkan kepada mereka suatu mukjizat} dalil atas kebenaran dakwahnya {kecuali mukjizat itu lebih besar daripada mukjizat (sebelumnya)} dari mukjizat yang sebelumnya {dan Kami menimpakan kepada mereka azab} dengan kemarau bertahun-tahun, belalang, kutu, katak, darah dan kebutaan {agar mereka kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47-48. ”maka tatkala dia datang kepada mereka dengan membawa mukjizat-mukjizat kami, dengan serta merta mereka menertawakannya,” yaitu mereka menolak, mengingkari, dan menertawakannya secara zhalim dan sombong. Hal itu bukan karena kekurangan dalam tanda-tanda kebesaran Allah dan bukan karena kurang jelasnya tanda-tanda itu, karena itu Allah berfirman,”dan tidaklah kami perlihatkan kepada mereka suatu mukjizat kecuali mukjizat itu lebih besar dari mukjizat-mujizat sebelumnya,”artinya, tanda-tanda kebesaran Allah yang belakangan lebih besar dari yang sebelumnya.”dan kami timpakan kepada mereka azab,” seperti dengan belalang, katak,kutu, dan darah sebagai tanda-tanda kebesaran yang memberi penjelasan.”supaya mereka kembali (kejalan yang benar)” pada islam dan tunduk padanya, agar kesyirikan dan keburukan mereka sirna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 48: (Dan tidaklah Kami perlihatkan kepada mereka sesuatu tanda) yang menunjukkan azab Kami seperti banjir, topan, yaitu berupa air bah yang melanda rumah-rumah mereka yang ketinggiannya mencapai leher orang yang sedang duduk, hal ini berlangsung selama. tujuh hari, dan juga belalang-belalang yang memusnahkan tanaman-tanaman mereka (melainkan tanda atau azab itu lebih besar daripada azab-azab lainnya) yang sebelumnya. (Dan Kami timpakan kepada mereka azab supaya mereka kembali) sadar dari kekafirannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud azab di sini ialah azab duniawi sebagai cobaan dari Allah seperti kurangnya makanan, berjangkitnya hama tumbuh-tumbuhan, merebaknya belalang, katak, darah dsb. Agar mereka beriman dan tidak berbuat syrik dan berbuat buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 48",
    "description": "Dan tidaklah kami perlihatkan suatu ayat, yaitu tanda kekuasaan kami, berupa mukjizat kepada mereka kecuali ia lebih besar dari mukjizat-Mukjizat yang sebelumnya. Namun demikian, mereka tetap bersikeras dengan sikap dan keyakinan mereka yang enggan menerima kebenaran. Dan akibat dari perbuatan mereka itu kami timpakan kepada mereka azab duniawi sebagai cobaan dari kami seperti kekurangan makanan, berjangkitnya hama tumbuh-tumbuhan agar mereka kembali ke jalan yang benar. 49. Dan setiap ada bencana yang ditimpakan kepada fir'aun dan kaumnya, mereka berkata, 'wahai pesihir, maksudnya nabi musa, berdoalah kepada tuhanmu untuk mengangkat bencana itu dan melepaskan kami dari bencana yang menimpa kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya jika doamu dikabulkan, hai musa, kami akan menjadi orang yang mendapat petunjuk. '."
  }
]