[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-50 Fir’aun dan para pembesarnya berkata kepada musa, ”wahai tukang sihir (tukang sihir dihormati dikalangan mereka dan sihir bukan merupakan sifat tercela) berdo’alah kepada tuahnmu untuk kami dengan janjiNya yang telah dijanjikanNya kepadamu dan kemuliaan-kemuliaan yang Dia berikan kepadamu agar Dia menghilangkan azab ini, bila Dia menghilangkan azab ini dari kami, maka kami akan menjadi orang-orang yang mendapatkan petunjuk dan beriman kepada apa yang kamu bawa.” Maka ketika musa berdoa agar azab tersebut diangkat dari mereka, dan Kami pun mengangkatnya dari mereka, ternyata mereka menyelisihi dan tetap bersikukuh diatas kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Maka mereka berkata kepada Musa -'alaihissalām- tatkala merasakan sebagian azab, “Wahai penyihir! Mohonkan untuk kami kepada Rabbmu apa yang disebutkan Rabbmu untuk menyingkirkan azab ini jika kami beriman. Sesungguhnya kami benar-benar akan mendapat petunjuk kepada-Nya apabila azab ini disingkirkan dari kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Fir’aun dan tentaranya berkata: “Hai orang pintar -mereka menyebut penyihir sebagai orang pintar-, berdoalah kepada Allah bagi kami dengan perjanjian yang Dia berikan kepadamu, agar Dia menghilangkan azab dari kami; dengan begitu kami akan beriman kepada risalahmu.” Maka Musa berdoa untuk mereka, dan Allah menghilangkan azab dari mereka. Akan tetapi mereka tidak menepati janji mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَقَالُوا۟ يٰٓأَيُّهَ السَّاحِرُ (Dan mereka berkata: “Hai ahli sihir) Terdapat pendapat mengatakan bahwa mereka dahulu menyebut orang yang berilmu dengan sebutan penyihir, dan mereka sangat menghormati dan mengagungkan para penyihir. ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ(berdoalah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu) Yakni dengan janji Allah kepadamu yang telah kamu sebutkan kepada kami, bahwa jika kami beriman maka siksaan ini akan diangkat dari kami. إِنَّنَا لَمُهْتَدُون(sesungguhnya kami (jika doamu dikabulkan) benar-benar akan menjadi orang yang mendapat petunjuk) Yakni kelak kami akan termasuk orang yang mendapat petunjuk dan beriman kepada apa yang kamu bawa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Fir’aun dan kaumnya berkata kepada Musa ketika mereka melihat azab: “Wahai kau penyihir atau orang yang berilmu, ini adalah panggilan mereka kepada ulama’ mereka. Doakanlah kami kepada Allah atas apa yang kalian sampaikan kepada kami dari zaman itu sampai ke zamanmu ini, jika kami beriman maka kami akan terbebas dari azab. Atau itu berarti doa kalian telah diterima Allah, karena engkau adalah seorang rasul, kami sungguh beriman dan membenarkan apa yang telah Allah turunkan kepadamu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai penyihir} wahai orang yang sangat berilmu {berdoalah kepada Tuhanmu untuk kami sesuai dengan apa yang telah Dia janjikan kepadamu} sesuai dengan apa yang kamu beritahukan kepada kami berupa janjiNya kepadamu bahwa jika kami beriman maka azab itu akan diangkat dari kami {Sesungguhnya kami benar-benar akan menjadi orang-orang yang mendapat petunjuk”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. “dan mereka berkata,” ketika azab menimpa mereka “hai ahli sihir,” maksud mereka adalah nabi musa. Perkataan ini mungkin merupakan celaan atau mungkin perkataan ini bagi mereka adalah sebuah pujian. Mereka tunduk padanya dengan menggunakan nada bicara layaknya berbicara dengan pembesar-pembesar mereka, yaitu para tukang sihir, mereka berkata, ”hai ahli sihir, berdoalah kepada Rabbmu untuk melepaskan kami sesuai dengan apa yang telah dijanjikanNYa kepadamu,” dengan sesuatu yang dikhususkan Allah padamu dan dilebihkan padamu dengan berbagai kelebihan dan kebajikan agar Dia melenyapkan siksaan dari kami, “sesungguhnya kami (jika doamu dikabulkan) benar-benar akan menjadi orang yang mendapat petunjuk,” bila Allah melenyapkan siksaan ini dari kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 49: (Dan mereka berkata) kepada Musa tatkala mereka melihat adanya azab itu, (\"Hai ahli sihir!) maksudnya, hai orang yang alim lagi sempurna ilmunya! Dikatakan demikian karena menurut mereka ilmu sihir itu adalah ilmu yang paling diagungkan di kalaagan mereka (Berdoalah kepada Rabbmu untuk kami, sesuai dengan apa yang telah dijanjikan-Nya kepadamu) yakni Dia akan melepaskan kami dari azab ini jika kami beriman (sesungguhnya kami benar-benar akan menjadi orang-orang yang mendapat petunjuk\") atau mau beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika azab itu menimpa mereka. Yang mereka maksud dengan pesihir di sini ialah Nabi Musa ‘alaihis salam. Ucapan ini bisa maksudnya memperolok-olok Beliau dan bisa maksudnya sebagai ucapan penghormatan mereka kepada Beliau, karena mereka menyangka bahwa ulama mereka adalah para pesihir. Yakni dengan keistimewaan yang Allah berikan kepadamu berupa keutamaan dan kelebihan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 49",
    "description": "Dan setiap ada bencana yang ditimpakan kepada fir'aun dan kaumnya, mereka berkata, 'wahai pesihir, maksudnya nabi musa, berdoalah kepada tuhanmu untuk mengangkat bencana itu dan melepaskan kami dari bencana yang menimpa kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya jika doamu dikabulkan, hai musa, kami akan menjadi orang yang mendapat petunjuk. '50. Maka dengan begitu cepat ketika kami hilangkan dan hindarkan azab itu dari mereka karena doa yang dimohonkan oleh nabi musa itu, seketika itu juga dari waktu ke waktu dan secara terus-menerus mereka ingkar janji."
  }
]