[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah Kami akan berpaling dari kalian dan tidak menurunkan al-quran kepada kalain hanya gara-gara kalian berpaling dan menolak untuk tunduk serta berbuat melampaui batas dengan tidak beriman kepadanya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Apakah Kami akan berhenti menurunkan Al-Qur`ān kepada kalian karena kalian banyak melakukan kesyirikan dan kemaksiatan? Tidak, Kami tidak akan melakukan itu, bahkan belas kasih atas kalian mengharuskan hal yang sebaliknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Allah mengingkari dan mengolok orang-orang kafir: “Apakah Kami menjadi tidak lagi memperingatkan kalian karena kalian berpaling, bermaksiat, dan sangat mendustakan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. أَفَنَضْرِبُ عَنكُمُ الذِّكْرَ صَفْحًا أَن كُنتُمْ قَوْمًا مُّسْرِفِينَ (Maka apakah Kami akan berhenti menurunkan Al Quran kepadamu, karena kamu adalah kaum yang melampaui batas?) Apakah kalian menyangka bahwa Kami akan meninggalkan seruan dan peringatan untuk kalian kepada kebenaran. Qatadah mengatakan tentang tafsir ayat ini: “Demi Allah, seandainya al-Qur’an diangkat kembali ke langit ketika ia ditolak oleh orang-orang terdahulu dari umat ini niscaya mereka akan binasa, namun Allah masih sayang kepada mereka sehingga Dia masih mengulangi peringatan kepada mereka dan menyeru mereka selama 20 tahun atau sampai waktu yang ditentukan Allah dst.” Yakni sampai sebagian mereka beriman kepada al-Qur’an dan agama Islam menang. Allah tidak menghentikan seruan bagi mereka kepada kebaikan dan al-Qur’an meskipun dahulu mereka berpaling darinya, agar orang yang telah ditakdirkan Allah untuk beriman dapat mendapat petunjuk dan agar orang yang tidak ditakdirkan Allah untuk beriman mendapat hujjah atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Apakah benar, jika Kami akan meninggalkan kalian dalam keadaan teledor wahai manusia, tidak mengingatkan kalian tentang Al-Qur’an, tidak menasehati, tidak memerintah dan tidak melarang kalian? Tidak akan, karena sesungguhnya kalian adalah golongan yang suka melampaui batas dalam melakukan keborosan dan kesesatan, Kalian juga orang-orang yang menyekutukan Allah. Hamzah dalam {Afanadhribu} adalah istifham inkariy, {Adzikra} adalah Al-Qur’an, dan {Shafhan} adalah penolakan. Maknanya dalam ayat ini adalah orang-orang yang menolak. Maksudnya adalah bentuk pengingkaran bahwa perkara itu berbeda dengan yang diharapkan, yaitu bahwa Al-Qur’an diturunkan menggunakan bahasa mereka supaya mereka memahaminya, bahkan seharusnya Al-Qur’an itu mengingatkan kalian untuk mendirikan bukti (keimanan) kalian di akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah Kami akan menahan} Apakah Kami akan menahan {Adz-Dzikr} Al-Qur’an {dari kalian dan mengabaikan kalian} mengabaikan kalian {karena kalian} karena kalian {adalah kaum yang melampaui batas} melampaui batas kesesatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. selanjutnya Allah mengabrkan bahwa hikmah dan karuniaNya mengharuskan tidak membiarkan para hambaNya begitu saja, dan tidak mengutus rasul dan tidak menurunkan kitab kepada mereka meski mereka melampaui batas dan berbuat zhalim. Allah berfirman, ”maka apakah kami akan berhenti menurunkan al-qur’an kepadamu,” yaitu apakah kami berpaling drai kalian dan tidak menurunkan peringatan kepada kalian dan berhenti menurunkan al-qur’an karena kalian berpaling dan tidak tunduk kepada Allah? Meski demikian, Allah tetap menurunkan al-qur’an dan memberi penjelasan segala sesuatu kepada kalian. Bila kalian beriman dan menjadikannya sebagai petunjuk, itulah taufik untuk kalian, namun bila tidak dipercayai dan tidak dijadikan sebagai petunjuk, maka hujjah telah tegak atas kalian dan kalian berada di atas kejelasan berbagai hal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 5: (Maka apakah Kami akan berhenti) akan menahan (menurunkan Adz-Dzikr kepada kalian) yakni Alquran (dengan sebenarbenarnya) maksudnya Kami benar-benar menahan Alquran dan tidak menurunkannya kepada kalian, karena itu kalian tidak lagi 311 terkena amar makruf dan nahi mungkar, demikian itu hanya (karena kalian adalah kaum yang melampaui batas?) kaum yang musyrik tentu tidak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan bahwa hikmah dan karunia-Nya menghendaki untuk tidak membiarkan hamba-hamba-Nya begitu saja; dengan tidak mengutus rasul dan tidak menurunkan kitab meskipun mereka sebagai orang-orang yang melampaui batas lagi zalim. Yakni apakah Kami akan berpaling dari kamu dan Kami tidak menurunkan kitab kepadamu serta membiarkan kamu (tidak memerintahkan kamu dan tidak melarang) karena kamu berpaling dan tidak mau tunduk kepadanya? Bahkan Kami tetap akan menurunkan kitab dan menerangkan segala sesuatu di dalamnya. Jika kamu mengimaninya maka kamu akan mendapatkan petunjuk, dan jika kamu tidak beriman, maka telah tegak hujjah atas kamu dan kamu di atas masalah yang sudah jelas perkaranya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 5",
    "description": "Maka apakah dengan penolakan kamu terhadap Al-Qur'an yang kami turunkan itu, wahai orang-orang kafir, akan menyebabkan kami akan berhenti menurunkan ayat-ayat Al-Qur'an sebagai peringatan kepa-damu, karena kamu adalah kaum yang melampaui batas karena kebejatan dan keingkaranmu terhadapnya' sama sekali tidak. Kami tidak akan pernah berhenti menurunkannya. '6. Setelah Allah menegaskan bahwa Al-Qur'an adalah kitab yang bernilai tinggi dan tidak akan pernah berhenti di turunkan walaupun mendapat penolakan dari orang-orang kafir, maka pada ayat ini Allah menegaskan bahwa sikap orang-orang musyik mekah tidak beda dengan umat-umat sebelumnya, 'dan betapa banyak nabi-nabi yang telah kami utus kepada umat-umat yang terdahulu sebelum engkau, wahai nabi Muhammad, sikap umat-umat mereka tidak berbeda dengan sikap orang-orang musyrik mekah yang kamu hadapi. '"
  }
]