[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-50 Fir’aun dan para pembesarnya berkata kepada musa, ”wahai tukang sihir (tukang sihir dihormati dikalangan mereka dan sihir bukan merupakan sifat tercela) berdo’alah kepada tuahnmu untuk kami dengan janjiNya yang telah dijanjikanNya kepadamu dan kemuliaan-kemuliaan yang Dia berikan kepadamu agar Dia menghilangkan azab ini, bila Dia menghilangkan azab ini dari kami, maka kami akan menjadi orang-orang yang mendapatkan petunjuk dan beriman kepada apa yang kamu bawa.” Maka ketika musa berdoa agar azab tersebut diangkat dari mereka, dan Kami pun mengangkatnya dari mereka, ternyata mereka menyelisihi dan tetap bersikukuh diatas kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Maka tatkala Kami hapuskan azab itu dari mereka, ternyata mereka mengingkari janji mereka dan tidak menepatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ إِذَا هُمْ يَنكُثُونَ (Maka tatkala Kami hilangkan azab itu dari mereka, dengan serta merta mereka memungkiri (janjinya)) Yakni maka Musa berdo’a kepada Tuhannya, sehingga Allah menyingkap azab dari mereka. Namun setelah azab itu disingkap mereka mengingkari janji mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Kemudian Musa berdoa kepada Tuhannya, sehingga mereka terbebas dari azab. Namun ketika azab itu hilang dan janji mereka dituntut, justru mereka tetap kembali pada kekafiran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika Kami menghilangkan azab itu dari mereka, seketika itu mereka ingkar janji} mengingkari janji mereka dan tidak menepatinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “maka tatkala kami hilangkan azb itu dari mereka, dengan serta merta mereka memungkiri (janjinya),” artinya mereka tidak menepati ucapan, tapi mereka malah mengingkari dan terus berada dalam kekufuran. Hal ini seperti yang difirmankan Allah, “maka kami kirimkan kepada mereka topan, belalang, kutu, katak, dan darah sebagai bukti yang jelas, tetapi mereka tetap menyombongkan diri dan mereka adalah kaum yang berdosa.” Dan ketika mereka ditimpa azab (yang telah diterangkan itu) mereka pun berkata: \"Hai Musa, mohonkanlah untuk kami kepada Tuhanmu dengan (perantaraan) kenabian yang diketahui Allah ada pada sisimu. Sesungguhnya jika kamu dapat menghilangkan azab itu daripada kami, pasti kami akan beriman kepadamu dan akan kami biarkan Bani Israel pergi bersamamu\".Maka setelah kami hilangkan azab itu dari mereka hingga batas waktu yang mereka sampai kepadanya, tiba-tiba mereka mengingkarinya. (al-a’raf:133-135)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 50: (Maka tatkala Kami hilangkan) berkat doa Musa (azab itu dari mereka, dengan serta merta mereka memungkiri) janjinya, bahkan mereka masih tetap melaju di dalam kekafirannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan doa Musa. Mereka tidak memenuhi janji mereka untuk beriman dan mereka tetap di atas kekafiran (lihat pula surah Al A’raaf: 133-135)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 50",
    "description": "Maka dengan begitu cepat ketika kami hilangkan dan hindarkan azab itu dari mereka karena doa yang dimohonkan oleh nabi musa itu, seketika itu juga dari waktu ke waktu dan secara terus-menerus mereka ingkar janji. 51. Dan fir'aun dengan penuh kesombongan dan keangkuhan berseru kepada kaumnya seraya berkata, 'wahai kaumku! bukankah kerajaan mesir itu milikku sendiri, bukan milik orang lain, dan bukankah sungai-sungai ini yang mengalir di bawah istanaku juga menjadi milikku dan ke kayaanku; apakah kamu tidak melihat betapa hebatnya aku dan betapa besar ke kuasaanku dan betapa lemahnya musa'."
  }
]