[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "51-52 Fir’aun mengumumkan di depan para pembesar kaumnya dengan penuh kebangggan dan kesombongan sebagai penguasa mesir, ”bukanlah kerajaan mesir ini adalah milikku, cabang-cabang nil mengalir di bawah istanaku di sela-sela kebunku, apakah kalian tidak melihat keagunganku dan kekuatanku serta kelemahan dan kemiskinan musa? lebih dari itu aku lebih baik daripada orang yang tidak punya kemuliaan ini. dia merendahkan dirinya demi menutupi kebutuhan-kebutuhannya karena kerendahan dan kemiskinannya, dia juga hampir tidak bisa berbicara dengan jelas karena cacat pada lisannya.” Firaun mengatakan semua itu karena terdorong oleh kekafiran dan penentangannya demi menghalang-halangi manusia dari jalan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Dan Fir'aun menyeru di tengah kaumnya menyombongkan kerajaannya, “Wahai kaumku! Bukankah aku memiliki kerajaan Mesir dan sungai-sungai Nil ini mengalir di bawah istanaku? Tidakkah kalian melihat kerajaanku dan mengakui kebesaranku?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-53. Fir’aun berseru kepada kaumnya dengan penuh kesombongan: “Bukankah negeri Mesir adalah milikku, dan sungai Nil mengalir di bawah istana-istanaku? Tidakkah kalian melihat betapa besarnya kuasaku?” Kemudian dia melanjutkan perkataannya: “Bahkan aku lebih baik daripada Musa yang tidak memiliki kehormatan itu, dan tidak dapat berbicara dengan fasih. Mengapa Musa tidak mendapat gelang-gelang dari emas jika dia benar-benar orang agung, atau datang bersamanya para malaikat yang berbondong-bondong untuk bersaksi atas kebenaran risalahnya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَنَادَىٰ فِرْعَوْنُ فِى قَوْمِهِۦ (Dan Fir’aun berseru kepada kaumnya) Fir’aun khawatir kaumnya akan condong kepada Musa, maka ia mengumpulkan mereka dengan berseru kepada mereka. Atau ia memerintah sambil berseru: قَالَ يٰقَوْمِ أَلَيْسَ لِى مُلْكُ مِصْرَ(berkata: “Hai kaumku, bukankah kerajaan Mesir ini kepunyaanku) Tidak ada yang menyaingiku dan menyelisihiku dalam kerajaan ini. وَهٰذِهِ الْأَنْهٰرُ تَجْرِى مِن تَحْتِىٓ ۖ( dan (bukankah) sungai-sungai ini mengalir di bawahku) Yakni dibawah kerajaanku. Dan yang dimaksud adalah sungai nil dan cabang-cabangnya. أَفَلَا تُبْصِرُونَ (maka apakah kamu tidak melihat(nya)?) Apakah kalian tidak menyaksikannya dan menjadikannya tanda atas kuatnya kerajaanku dan besarnya kedudukanku, serta lemahnya Musa untuk melawanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Fir’aun memberi pengumuman kepada kaumnya dengan berkata: “Wahai kaumku, bukankah kerajaan Mesir ini adalah milikku, tidak ada perdebatan lagi? Bukankah sungai-sungai yang mengalir di bawah istanaku (sungai Nil) ini dengan kehendakku? Apakah kalian tidak melihat kebesaran dan kekuatan kerajaanku ini?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Fir‘aun berseru kepada kaumnya dan berkata,“Wahai kaumku, bukankah Kerajaan Mesir itu milikku dan sungai-sungai itu mengalir di bawahku} di bawah istana-istanaku {Apakah kalian tidak melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “dan fir’aun berseru kepada kaumnya (seraya) berkata,” dengan rasa tinggi hati karena kebatilannya, kekuasaan membuatnya tertipu, harta dan bala tentara membuatnya melampaui batas, “hai kaumku, bukankah kerajaan mesir ini kepunyaanku,” yaitu, bukankah aku penguasa dan yang mengaturnya? “dan sungai-sungai ini mengalir dibawahku,” yaitu sungai-sungai yang mengalir dari sungai nil ditengah istana dan kebun, “apakah kalian tidak memandang,” kerajaan yang panjang dan luas ini? Inilah puncak kebodohan fir’aun karena merasa bangga dengan sesuatu yang berada diluar kuasa dirinya, bukan bebangga diri dengan sifat-sifat yang terpuji atau tindakan –tindakan lurus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 51: (Dan Firaun berseru) dengan nada penuh kesombongan (kepada kaumnya seraya berkata, \"Hai kaumku, bukankah kerajaan Mesir ini kepunyaanku dan sungai-sungai ini) yaitu sungai Nil dan anak-anaknya (mengalir di bawahku) di bawah keraton-keratonku, adalah kepunyaanku juga (maka apakah kalian tidak melihat) keagungan dan kebesaranku?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Merasa tinggi dengan kebatilannya dan telah tertipu oleh kerajaannya. Harta dan tentaranya juga telah membuatnya bersikap melampaui batas. Yakni aku rajanya dan yang berkuasa bertindak di dalamnya. Yang berasal dari sungai Nil. Yakni di bawah istanaku. Kebesaran dan kerajaanku yang panjang dan lebar. Hal ini termasuk kebodohannya yang dalam, karena ia berbangga dengan sesuatu yang berada di luar dirinya dan tidak berbangga dengan sifat-sifat terpuji dan perbuatan yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 51",
    "description": "Dan fir'aun dengan penuh kesombongan dan keangkuhan berseru kepada kaumnya seraya berkata, 'wahai kaumku! bukankah kerajaan mesir itu milikku sendiri, bukan milik orang lain, dan bukankah sungai-sungai ini yang mengalir di bawah istanaku juga menjadi milikku dan ke kayaanku; apakah kamu tidak melihat betapa hebatnya aku dan betapa besar ke kuasaanku dan betapa lemahnya musa'52. Bukankah dengan kehebatan, kekayaan, dan kekuasaanku itu aku lebih baik dan lebih tinggi kedudukannya dari orang yang hina ini, yaitu musa, yang tidak memiliki kekuasaan apa pun dan dia juga adalah orang yang hampir tidak dapat menjelaskan perkataannya dengan kalimat-kalimat yang baik' tentulah aku lebih baik daripada musa."
  }
]