[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "51-52 Fir’aun mengumumkan di depan para pembesar kaumnya dengan penuh kebangggan dan kesombongan sebagai penguasa mesir, ”bukanlah kerajaan mesir ini adalah milikku, cabang-cabang nil mengalir di bawah istanaku di sela-sela kebunku, apakah kalian tidak melihat keagunganku dan kekuatanku serta kelemahan dan kemiskinan musa? lebih dari itu aku lebih baik daripada orang yang tidak punya kemuliaan ini. dia merendahkan dirinya demi menutupi kebutuhan-kebutuhannya karena kerendahan dan kemiskinannya, dia juga hampir tidak bisa berbicara dengan jelas karena cacat pada lisannya.” Firaun mengatakan semua itu karena terdorong oleh kekafiran dan penentangannya demi menghalang-halangi manusia dari jalan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Maka aku lebih baik dari pada Musa yang terusir dan lemah, yang tidak mampu berbicara dengan baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. أَمْ أَنَا۠ خَيْرٌ مِّنْ هٰذَا الَّذِى هُوَ مَهِينٌ (Bukankah aku lebih baik dari orang yang hina ini) Yakni namun aku lebih baik dari Musa yang lemah dan hina, serta tidak memiliki kehormatan. وَلَا يَكَادُ يُبِينُ(dan yang hampir tidak dapat menjelaskan (perkataannya)?) Yakni perkataannya tidak jelas akibat lidahnya yang memiliki kekurangan; dan penjelasan tentang ini telah disebutkan pada surat Taha."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Bukankah aku lebih baik dari Musa yang lemah, hina, dan tidak mempunyai kemuliaan ini. Dia juga hampir tidak bisa menjelaskan perkataannya, karena lisannya cedal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah aku lebih baik daripada orang yang hina ini} yang lemah dan rendah {yang hampir-hampir tidak dapat memberi penjelasan} fasih dalam perkataaannya karena bermasalah pada lisannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. ”bukankah aku lebih baik dari orang yang hina ini,?” Firaun, semoga Allah memburukannya, menghina nabi musa bin Imran, kalimullah yang terpandang di sisi Allah. Artinya, aku (firaun) perkasa sedangkan ia (musa) hina, manakah diantara yang lebih baik? Disamping itu “hampir tidak dapat menjelaskan (perkataanNya),” dari dasar benaknya dengan pekataan, sebab nabi musa tidak bisa bebicara fasih. Ini sama sekali bukanlah cacat jika musa bisa mengucapkan apa yang ada dibenaknya meski untuk berbicara terasa berat baginya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 52: (Bukankah) kalian telah melihat sesudah kesemuanya itu (aku lebih baik dari orang ini) dari Nabi Musa (yang dia adalah orang hina) lemah lagi hina (dan yang hampir tidak dapat berbicara dengan jelas) tidak dapat menjelaskan perkataannya, karena sewaktu kecil ia pernah memakan bara api, hingga lisannya pelan atau tidak fasih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu karena Beliau tidak fasih lisannya. Ini bukanlah aib jika Beliau masih bisa menerangkan isi hatinya meskipun berat dalam mengucapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 52",
    "description": "Bukankah dengan kehebatan, kekayaan, dan kekuasaanku itu aku lebih baik dan lebih tinggi kedudukannya dari orang yang hina ini, yaitu musa, yang tidak memiliki kekuasaan apa pun dan dia juga adalah orang yang hampir tidak dapat menjelaskan perkataannya dengan kalimat-kalimat yang baik' tentulah aku lebih baik daripada musa. 53. Maka kalau memang musa merupakan utusan tuhan yang dikirim kepada kami, mengapa dia, yakni musa, tidak dipakaikan oleh tuhannya gelang dari emas sebagai identitasnya atau para malaikat datang bersama-sama dia untuk mengiringinya sebagai bentuk dukungan terhadap pengutusannya''."
  }
]