[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "lalu mengapa Dia tidak memberikan kepada Musa (Bila musa memang benar-benar utusan tuhan semesta alam) gelang-gelang emas atau malaikat hadir bersamanya, sebagain berkaitan dengan sebagain yang lain, lalu mereka satu persatu bersaksi bahwa musa adalah utusan Allah kepada kami?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Maka kenapa Allah tidak memberikan kepada orang yang diutus-Nya gelang-gelang dari emas untuk menjelaskan bahwa dia adalah utusan-Nya, atau datang bersamanya para malaikat yang mengiringinya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. فَلَوْلَآ أُلْقِىَ عَلَيْهِ أَسْوِرَةٌ مِّن ذَهَبٍ (Mengapa tidak dipakaikan kepadanya gelang dari emas) Yakni mengapa dia tidak dipakaikan gelang-gelang emas jika memang dia adalah orang yang mulia. أَوْ جَآءَ مَعَهُ الْمَلٰٓئِكَةُ مُقْتَرِنِينَ (atau malaikat datang bersama-sama dia untuk mengiringkannya?”) Yakni turun berduyun-duyun jika memang dia adalah orang yang benar, sehingga para malaikat itu dapat menolongnya dan bersaksi atas kenabiannya. Fir’aun yang terlaknat itu memperdaya kaumnya bahwa para rasul yang sesungguhnya harus dengan penampilan yang mewah dan diiringi oleh para malaikat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Maka mengapa Musa tidak dipakaikan gelang emas jika dia memang agung? Atau datang dengan iringan dan kawalan para malaikat, yang akan membantunya dan bersaksi atas kenabiannya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa tidak} mengapa tidak {dipakaikan kepadanya gelang dari emas atau malaikat datang bersamanya yang mengiringinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. selanjutnya firaun bekata, ”mengapa tidak dipakaikan kepadanya gelang di emas,” yaitu mengapa musa tidak seperti ini, behiaskan pehiasan gelang, “atau malaikat datang besama-sama dia untuk mengingkarinya,” menolong seruannya dan memperkokoh pekataannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 53: (Mengapa tidak) kenapa tidak dipakaikan kepadanya jika memang ia orang yang benar di dalam pengakuannya (gelang dari emas) lafal Asawirah adalah bentuk jamak dari lafal Aswiratun yang wazannya sama dengan lafal Aghribatun, dan lafal Aswiratun ini merupakan bentuk jamak pula dari lafal Siwarun. Maksud Firaun, mengapa tidak dipakaikan kepadanya gelang dari emas sebagaimana kebiasaan orang-orang yang diberi kekuasaan olehnya, yaitu orang tersebut diberi pakaian kebesaran yang terbuat dari emas dan pula dipakaikan kepadanya gelang emas sebagai tanda kedudukannya (atau malaikat datang bersama-sama dia mengiringkannya\") datang berturut-turut kepadanya seraya menyatakan kebenaran kerasulannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, mengapa Tuhan tidak memakaikan gelang emas kepada Musa, sebab menurut kebiasaan mereka apabila seseorang akan diangkat menjadi pemimpin, mereka mengenakan gelang dan kalung emas kepadanya sebagai tanda kebesaran. Sambil menjadi saksi atas kebenarannya, membantu dakwahnya dan menguatkan ucapannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 53",
    "description": "Maka kalau memang musa merupakan utusan tuhan yang dikirim kepada kami, mengapa dia, yakni musa, tidak dipakaikan oleh tuhannya gelang dari emas sebagai identitasnya atau para malaikat datang bersama-sama dia untuk mengiringinya sebagai bentuk dukungan terhadap pengutusannya''54. Maka dia, yakni fir'aun, dengan perkataannya itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya dan mengakui kekuasaan dan ketuhanannya. Sungguh, mereka adalah kaum yang fasik, yang secara terus-menerus menolak kerasulan nabi musa dan menyimpang dari ajaran agama."
  }
]