[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Fir’aun membuat akal kaumnya dungu dan mengajak mereka kepada kesesatan. Dan merekapun menaatinya. mereka mendustakan musa. Dan sesungguhnya mereka adalah kaum yang menyimpang dari ketaatan kepada Allah dan jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Fir'aun telah mempengaruhi kaumnya sehingga mereka menaatinya dalam kesesatannya, sesungguhnya mereka adalah kaum yang keluar dari ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-56. Fir’aun dapat mempengaruhi akal kaumnya, dan menggoda mereka dengan kenikmatan dunia, serta menyesatkan mereka sehingga mereka mau mentaatinya. Sungguh mereka adalah kaum yang menyelisihi perintah Allah. Setelah mereka membuat Kami murka karena kekafiran mereka, Kami segera menurunkan siksaan bagi mereka, dengan menenggelamkan mereka semua ke dalam laut; dan Kami jadikan mereka sebagai contoh bagi orang-orang kafir setelah mereka dalam hal kelayakan mendapat azab dan pelajaran bagi kaum lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. فَاسْتَخَفَّ قَوْمَهُۥ فَأَطَاعُوهُ ۚ (Maka Fir’aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya) Yang membuatnya mengatakan hal ini adalah kebodohan dan kejahilan yang parah terhadap perkataan itu serta keangkuhan dan tipu dayanya. Lalu mereka menuruti perintah Fir’aun dan mempercayai perkataannya karena kebodohan mereka, dan mereka kemudian mendustakan Musa. إِنَّهُمْ كَانُوا۟ قَوْمًا فٰسِقِينَ(Karena sesungguhnya mereka adalah kaum yang fasik) Yakni enggan melakukan ketaatan kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Maka dengan pengaruh perkataan Fir’aun itu kaumnya menjadi takut dan percaya sehingga mereka patuh kepada perintahnya. Sesungguhnya mereka telah keluar dari ketaatan kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang mengiringinya dan memberi kesaksian terhadap kebenarannya {Lalu dia telah memengaruhi} membodohi {kaumnya sehingga mereka mematuhinya. Sesungguhnya mereka adalah kaum yang fasik} yang tidak mau taat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. ”maka fir’aun mempengaruhi kaumnya (dengan perkataan itu) lalu mereka patuh kepadanya,” yakni, mempengaruhi akal kaumnya dengan menampakkan syubhat itu, yang tidak bisa menggemukan dan tidak bisa menghilangkan rasa lapar, tidak ada hakikatnya, dan bukan dalil atas kebenaran atau kebatilan. Syubhat itu hanya diucapkan oleh orang-orang yang lemah akal. Dalil apa yang menunjukkan bahwa fir’aun benar hanya karena ia menjadi raja mesir dan sungai-sungai mengalir dibawahnya? Dalil apa yang menunjukkan kebatilan agama yang dibawa nabi musa hanya karena minimnya pengikut, berat lidahnya dan tidak diberi pehiasan oleh Allah? Nabi musa berhadapan dengan sekelompok besar yang tidak bisa menerima apa-apa yang logis, (masuk akal), maka apapun yang dikatakan fir’aun baik yang benar maupun yang batil, mereka ikuti saja. ”karena sesungguhnya mereka adalah kaum yang fasik,” sebab kefasikan mereka adalah karena firaun menghiasi kesyirikan dan keburukan untuk mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 54: (Maka Firaun mempengaruhi) berupaya menanamkan pengaruhnya kepada (kaumnya, lalu mereka patuh kepadanya) mematuhi apa yang dikehendaki oleh Firaun, yaitu mendustakan Musa (karena sesungguhnya mereka adalah kaum yang fasik.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan syubhat yang ditampilkannya yang sesungguhnya tidak ada hakikatnya, yang bukan dalil terhadap yang hak maupun yang batil; syubhat yang hanya laku di kalangan orang yang lemah akal. Mana dalil yang menunjukkan bahwa Fir’aun adalah orang yang benar dalam pernyataannya bahwa dirinya sebagai raja Mesir dan sungai-sungai mengalir di bawah istananya. Apakah di sana terdapat dalil yang menunjukkan batilnya apa yang dibawa Nabi Musa ‘alaihis salam hanya karena pengikutnya sedikit, lisannya tidak fasih dan karena Allah tidak memberinya perhiasan selain hanya karena Beliau bertemu dengan para pemuka yang tidak berakal yang selalu mengikuti ucapan pimpinannya; benar atau salah. Oleh karena kefasikannya, Allah jadikan Fir’aun untuk mereka; dimana dia menghias kesyirkkan dan keburukan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 54",
    "description": "Maka dia, yakni fir'aun, dengan perkataannya itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya dan mengakui kekuasaan dan ketuhanannya. Sungguh, mereka adalah kaum yang fasik, yang secara terus-menerus menolak kerasulan nabi musa dan menyimpang dari ajaran agama. 55. Maka ketika mereka, yaitu fir'aun dan kaumnya, membuat kami murka karena pernyataan dan sikap mereka yang menentang nabi musa sebagai utusan kami, kami membalas sikap mereka itu dengan menghukum mereka, lalu kami tenggelamkan mereka semuanya di laut merah, ."
  }
]