[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55-56 Maka ketika mereka membuat Kami murka (dengan kemaksiatan yang mereka lakukan terhadap Kami dan pendustaan mereka kepada musa dan ayat-ayat yang dibawa olehnya) Kami membalas mereka dengan menyegerakan azab yang menimpa mereka kami menenggelamkan mereka semuanya kelautan. maka kami menjadikan orang-orang yang kami tenggelamkan itu sebagai pendahulu bagi siapa yang melakukan perbuatan seperti perbuatan mereka dari kalangan orang-orang yang datang sesudah mereka, bahwa mereka pun akan mendapatkan azab, dan sekaligus pelajaran dan nasihat bagi yang lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Maka tatkala mereka menjadikan Kami murka karena mereka terus menerus dalam kekufuran, Kami membalas mereka dan Kami tenggelamkan mereka seluruhnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. فَلَمَّآ ءَاسَفُونَا (Maka tatkala mereka membuat Kami murka) Yakni setelah mereka membuat Kami marah. انتَقَمْنَا مِنْهُمْ فَأَغْرَقْنٰهُمْ أَجْمَعِينَ (Kami menghukum mereka lalu kami tenggelamkan mereka semuanya) Dalam lautan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Ketika mereka membuat Kami murka dengan bertindak di luar batas kemaksiatan dan kerusakan, maka Kami tenggelamkan mereka semua di laut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka ketika mereka telah membuat Kami murka} membuat Kami murka {Kami menghukum mereka, lalu Kami menenggelamkan mereka semuanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56. maka tatkala mereka membuat kami murka,” yaitu membuat kami murka karena perbuatan-perbuatan mereka, “kami menghukum mereka lalu kami tenggelamkan mereka semuanya (dilaut), dan kami jadikan mereka sebagai pelajaran dan contoh bagi orang-orang kemudian,” agar orang-orang menjadikannya sebagai pelajaran dan agar dijadikan nasihat bagi orang-orang yang mau menjadikannya sebagai nasihat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 55: (Maka tatkala mereka membuat Kami murka) (Kami menghukum mereka lalu Kami tenggelamkan mereka semuanya di laut.)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 55",
    "description": "Maka ketika mereka, yaitu fir'aun dan kaumnya, membuat kami murka karena pernyataan dan sikap mereka yang menentang nabi musa sebagai utusan kami, kami membalas sikap mereka itu dengan menghukum mereka, lalu kami tenggelamkan mereka semuanya di laut merah, 56. Lalu kami jadikan mereka yang menentang terhadap ajaran-ajaran Allah yang dibawa oleh nabi musa dan hukuman yang ditimpakan kepada mereka itu sebagai kaum terdahulu dan pelajaran bagi orang-orang yang datang kemudian."
  }
]