[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "55-56 Maka ketika mereka membuat Kami murka (dengan kemaksiatan yang mereka lakukan terhadap Kami dan pendustaan mereka kepada musa dan ayat-ayat yang dibawa olehnya) Kami membalas mereka dengan menyegerakan azab yang menimpa mereka kami menenggelamkan mereka semuanya kelautan. maka kami menjadikan orang-orang yang kami tenggelamkan itu sebagai pendahulu bagi siapa yang melakukan perbuatan seperti perbuatan mereka dari kalangan orang-orang yang datang sesudah mereka, bahwa mereka pun akan mendapatkan azab, dan sekaligus pelajaran dan nasihat bagi yang lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Lalu Kami jadikan Fir'aun dan pemuka-pemuka kaumnya sebagai pelajaran bagi orang yang melakukan perbuatan mereka, akan hancur sebagaimana mereka hancur, dan Kami jadikan mereka pelajaran bagi orang yang mau mengambil pelajaran agar tidak melakukan perbuatan mereka sehingga akan ditimpa apa yang telah menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. فَجَعَلْنٰهُمْ سَلَفًا (dan Kami jadikan mereka sebagai pelajaran) Yakni sebagai teladan bagi orang kafir yang bertingkah seperti mereka dalam keberhakan mendapat azab. وَمَثَلًا لِّلْاٰخِرِينَ(dan contoh bagi orang-orang yang kemudian) Yakni sebagai ibrah dan pelajaran bagi orang setelah mereka, atau sebagai kisah yang menakjubkan yang dijadikan permisalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Maka Kami jadikan mereka lebih dulu mendapatkan azab dari pada orang-orang kafir terdahulu, Kami menimpakan azab bagi mereka di kubur dan akhirat. Mereka Kami jadikan pelajaran untuk orang-orang sesudah mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikan mereka sebagai kaum terdahulu} kaum terdahulu bagi umat-umat kafir {dan pelajaran} pelajaran dan teladan {bagi orang-orang yang kemudian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55-56. maka tatkala mereka membuat kami murka,” yaitu membuat kami murka karena perbuatan-perbuatan mereka, “kami menghukum mereka lalu kami tenggelamkan mereka semuanya (dilaut), dan kami jadikan mereka sebagai pelajaran dan contoh bagi orang-orang kemudian,” agar orang-orang menjadikannya sebagai pelajaran dan agar dijadikan nasihat bagi orang-orang yang mau menjadikannya sebagai nasihat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 56: (Dan Kami jadikan mereka sebagai pelajaran) lafal Salafan merupakan bentuk jamak dari lafal salifun, wazannya sama dengan lafal Khadimun atau pelayan, yang jamaknya adalah Khadamun; yakni orang-orang terdahulu yang dijadikan sebagai pelajaran (dan contoh bagi orang-orang yang kemudian) sesudah mereka, di mana orang-orang yang sesudah mereka itu dapat mengambil contoh dari keadaan mereka, karena itu mereka tidak berani melakukan hal-hal serupa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar mereka tidak melakukan hal yang sama dengannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 56",
    "description": "Lalu kami jadikan mereka yang menentang terhadap ajaran-ajaran Allah yang dibawa oleh nabi musa dan hukuman yang ditimpakan kepada mereka itu sebagai kaum terdahulu dan pelajaran bagi orang-orang yang datang kemudian. 57. Setelah menjelaskan bahwa kaum nabi musa yang menentang ajaran Allah dan hukuman yang ditimpakan kepada mereka adalah pelajaran bagi orang-orang datang kemudian, Allah lalu menjelaskan pelajaran yang dapat diambil oleh nabi Muhammad dan umatnya dari kisah nabi isa. Dan ketika putra maryam, yakni nabi isa, dijadikan oleh orang-orang musyrik perumpamaan untuk menentang kebenaran ayat-ayat Allah, tiba-tiba kaummu, suku quraisy wahai nabi Muhammad bersorak gembira karenanya."
  }
]