[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika orang-orang musyrik menjadikan isa putra maryam sebagai perumpamaan ketika mereka mendebat Muhammad dan berdalih atasnya dengan penyembahan orang-orang nasrani kepada isa, maka kaummu karena itu dan demi itu bersuara keras dan gaduh karena senang dan gembira, hal itu ketika turun firman Allah : إِنَّكُمْ وَمَا تَعْبُدُونَ مِنْ دُونِ اللَّهِ حَصَبُ جَهَنَّمَ أَنْتُمْ لَهَا وَارِدُونَ Sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan Jahannam, kamu pasti masuk ke dalamnya. (QS. AL-ANBIYA : 98) Dan orang-orang musyrik berkata “kami ridho jika tuhab-tuhan kami seperti kedudukan Isa, maka Allah menurunkan firman-Nya: إِنَّ الَّذِينَ سَبَقَتْ لَهُمْ مِنَّا الْحُسْنَىٰ أُولَٰئِكَ عَنْهَا مُبْعَدُونَ Bahwasanya orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami, mereka itu dijauhkan dari neraka (QS. AL-ANBIYA : 101) Maka orang-orang yang dilepmarkan kedalam nereka dari tuhan-tuhan orang musyrikin adalah mereka yang ridho dengan penyembahan mereka kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan tatkala orang-orang musyrik mengira bahwa Isa yang disembah oleh orang-orang Nasrani masuk dalam keumuman firman Allah -Ta'ālā-, “Sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan Jahanam, kamu pasti masuk ke dalamnya.” [Al-Anbiyā`: 98]. padahal Allah telah melarang untuk menyembahnya sebagaimana Allah melarang untuk menyembah berhala-berhala, tiba-tiba kaummu -wahai Rasul- melanjutkan dengan perdebatan sambil berkata, “Kami rela tuhan-tuhan kami seperti kedudukan Isa,” maka Allah menurunkan firman-Nya, “Bahwasanya orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami, mereka itu dijauhkan dari Neraka.” [Al-Anbiyā`: 101]."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57-59. Setelah Allah menjadikan Isa bin Maryam sebagai permisalan, karena dia seperti Adam yang diciptakan tanpa ayah; kemudian orang-orang musyrik menyikapinya dengan teriakan dan kebisingan, dan membuat kedustaan: “Muhammad ingin agar kita menjadikan dirinya sebagai tuhan yang kita sembah, sebagaimana yang dilakukan orang-orang Nasrani kepada Isa.” Dan mereka juga berkata: “Apakah tuhan-tuhan kita yang sekarang kita sembah ini lebih baik, atau Muhammad yang kita sembah dan meninggalkan tuhan-tuhan kita itu?” Hai Rasulullah, tidaklah mereka membuat perumpamaan itu bagimu melainkan untuk mereka gunakan sebagai bahan berselisih denganmu. Isa tidak lain adalah seorang hamba yang Kami beri nikmat keimanan dan kenabian, dan kelahirannya Kami jadikan tanpa seorang ayah sebagai tanda dan bukti besarnya kekuasaan Kami terhadap Bani Israil dan kaum yang lain. Abu Umamah berkata, Rasulullah bersabda: “Tidaklah ada suatu kaum yang tersesat setelah mendapat petunjuk, melainkan mereka adalah tukang membantah.” Kemudian beliau membaca ayat: بَلْ هُمْ قَوْمٌ خَصِمُونَ “sebenarnya mereka adalah kaum yang suka bertengkar.” (Diriwayatkan Ibnu Majah dalam as-Sunan 1/19 no. 49, muqaddimah, bab menjauhi pelaku bid’ah dan kaum yang suka berdebat. Dan diriwayatkan at-Tirmidzi dan berkata, hadits hasan shahih, kami tidak mengetahui lafadh ini melainkan dari hadits ini, al-Jami’ as-Shahih, tafsir, surat az-Zukhruf. Al-albani berkata: hadits hasan, Shahih Ibnu Majah 1/15. Dan diriwayatkan al-Hakim, dan ad-Dzahabi menshahihkan dan menyepakatinya, al-Mustadrak 2/447,448)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا (Dan tatkala putra Maryam (Isa) dijadikan perumpamnaan) Ketika turun firman Allah: إنكم وما تعبدون من دون الله حصب جهنم ” Sungguh, kamu (orang kafir) dan apa yang kamu sembah selain Allah, adalah bahan bakar Jahannam.” (al-Anbiya’: 98) Maka Ibnu az-Zab’ary berkata: “Demi Tuhan ka’bah, aku menentangmu! Bukankah orang-orang Nasrani menyembah Isa al-Masih, orang-orang Yahudi menyembah ‘Uzair, dan Bani Malih menyembah para malaikat?” Sehingga orang-orang kafir merasa senang dengan perkataannya. Maka turunlah firman Allah: إن الذين سبقت لهم منا الحسنى أولئك عنها مبعدون “Sungguh, sejak dahulu bagi orang-orang yang telah ada (ketetapan) yang baik dari Kami, mereka itu akan dijauhkan (dari neraka).” (al-Anbiya: 101) Dan turun juga ayat 57 dari surat ini. إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ(tiba-tiba kaummu (Quraisy) bersorak karenanya) Yakni bersorak dan mengangkat suara mereka karena rasa senang atas perumpamaan dalam ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Ketika Kami menjadikan Isa putera Maryam sebagai contoh, atau sebagai hujjah dan bukti tiba-tiba kafir Qurays bersorak dan tertawa bergembira atas contoh itu. Mereka merasa bahwa mereka telah membantah Nabi SAW dengan apa yang telah mereka dengarkan itu. Ayat ini turun pada saat perebatan Ibnu Azzaba’ri kepada Rasul ketila Firman Allah turun: Sesungguhnya kalian beserta sesembahan kalian adalah bahan bakar Jahannam. (Al anbiya’: 98) Ibnu Azzaba’ri berkata: Aku memusuhimu, demi Tuhan Ka’bah, bukankah orang Nasrani menyembah Isa, sementara Yahudi menyembah Uzair dan anak-anak malaikat yang indah? Sehingga dia gembira dengan perkataannya. Maka turunlah ayat ini: Sungguh sejak dahulu bagi orang-orang yang telah ada ketetapan yang baik dari Kami, mereka itu akan dijauhkan dari neraka.(Alanbiya’: 101)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika putra Maryam dijadikan perumpamaan} orang-orang musyrik menjadikan nabi Allah Isa sebagai perumpamaan bagi tuhan-tuhan mereka dan menyamakannya untuk masuk neraka {tiba-tiba kaummu bersorak karenanya} meraung dan berteriak senang dengan perumpamaan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Allah berfiman,”dan tatkala putra maryam (isa), dijadikan perumpamaan, ”yaitu dilarang untuk disembah dan penyembahannya disamakan sepeti penyembahan terhadap patung dan sekutu-sekutu, “dan tiba-tiba kaummu (quraisy),” yang mendustakanmu, yang “karennya,” yaitu karena perumpamaan yang dibuat ini, “mereka bersorak,” yakni, karena bekeras hati dalam memusuhimu, beteriak dan mengira bahwa mereka menang dan beruntung dalam hujjah mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 57: (Dan tatkala dijadikan) dibuat (putra Maryam sebagai perumpamaan) yaitu ketika Allah swt. menurunkan firman-Nya, \"Sesungguhnya kalian dan apa yang kalian sembah selain Allah adalah makanan neraka Jahanam..\" (Q.S. Al Anbiya, 98). Seketika itu juga orang-orang musyrik mengatakan, \"Kami rela bila ternyata tuhan-tuhan sesembahan kami bersama dengan Isa, karena ia pun menjadi sesembahan selain Allah pula (tiba-tiba kaummu) yakni mereka yang musyrik (terhadap perumpamaan itu) terhadap misal tersebut (menertawakannya) karena gembira mendengar perumpamaan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Ahmad meriwayatkan dengan sanadnya yang sampai kepada Maula bin ‘Aqil ia berkata: Ibnu Abbas berkata, “Sungguh aku mengetahui sebuah ayat dalam Al Qur’an yang belum pernah ditanyakan oleh seorang pun. Aku tidak mengetahui, apakah orang-orang sudah mengetahuinya sehingga tidak lagi bertanya atau mereka tidak mengerti sehingga (perlu) bertanya?” Lalu ia (Ibnu Abbas) mulai berbicara dengan kami. Ketika ia (Ibnu Abbas) bangun (dan pergi), maka kami saling cela-mencela karena tidak bertanya kepadanya, maka aku berkata, “Saya siap untuk bertanya, jika ia datang besok. Ketika ia datang, aku berkata, “Wahai Ibnu Abbas, kemarin engkau menyebutkan tentang sebuah ayat yang belum ditanyakan oleh seorang pun; engkau tidak mengetahui apakah orang-orang sudah mengetahuinya sehingga tidak lagi bertanya atau mereka tidak mengerti? Lalu aku melanjutkan kata-kataku, “Beritahukanlah kepadaku tentang ayat itu dan tentang beberapa ayat yang telah engkau bacakan.” Ia (Ibnu Abbas) menjawab, “Ya.” Rasulullah shallallahu 'alaihi wa sallam pernah berkata kepada orang-orang Quraisy, “Wahai kaum Quraisy! Sesungguhnya tidak ada satu pun yang disembah selain Allah ada kebaikannya.” Orang-orang Quraisy mengetahui, bahwa orang-orang Nasrani menyembah Isa putra Maryam dan mengetahui apa yang dikatakan Muhammad shallallahu 'alaihi wa sallam, lalu mereka berkata, “Wahai Muhammad! Bukankah engkau menyangka bahwa Isa seorang nabi dan salah satu hamba di antara hamba-hamba Allah yang saleh. Jika engkau benar, maka sesungguhnya sembahan-sembahan mereka sama seperti yang engkau katakan.” Maka Allah menurunkan ayat, “Dan ketika putra Maryam (Isa) dijadikan perumpamaan, tiba-tiba kaummu (suku Quraisy) bersorak karenanya.” Aku bertanya, “Apa maksud bersorak?” Ia (Ibnu Abbas) menjawab, “Berteriak dengan gaduh.” (Apa maksud), “Dan sungguh, dia (Isa) benar-benar menjadi pertanda akan datangnya hari Kiamat.” (Az Zukhruf: 61) Ibnu Abbas menjawab, “Yaitu keluarnya Isa putra Maryam ‘alaihis salam sebelum hari Kiamat.” (Hadits ini diriwayatkan pula oleh Thahawi dalam Musykilul Aatsar juz 1 hal. 431. Hadits ini menurut Haitsami dalam Majma’uz Zawaa’id juz 7 hal. 104, diriwayatkan oleh Ahmad dan Thabrani yang sama seperti itu (hanyasaja di sana disebutkan lafaznya, “Fa in kunta shaadiqan fa innahaa li aalihatihim”) dan di dalam sanadnya terdapat ‘Ashim bin Bahdalah yang ditsiqahkan oleh Ahmad dan yang lain, ia buruk hapalannya, sedangkan para perawi selebihnya adalah para perawi hadits shahih. As Suyuthiy dalam Lubaabun Nuqul berkata, “Sesungguhnya sanadnya shahih,” Syaikh Muqbill mengatakan, bahwa yang ditetapkan oleh Adz Dzahabi dalam Al Mizan adalah bahwa hadits ‘Ashim itu hasan.”)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 57",
    "description": "Setelah menjelaskan bahwa kaum nabi musa yang menentang ajaran Allah dan hukuman yang ditimpakan kepada mereka adalah pelajaran bagi orang-orang datang kemudian, Allah lalu menjelaskan pelajaran yang dapat diambil oleh nabi Muhammad dan umatnya dari kisah nabi isa. Dan ketika putra maryam, yakni nabi isa, dijadikan oleh orang-orang musyrik perumpamaan untuk menentang kebenaran ayat-ayat Allah, tiba-tiba kaummu, suku quraisy wahai nabi Muhammad bersorak gembira karenanya. 58. Dan mereka berkata, 'manakah yang lebih baik tuhan-tuhan kami, berupa berhala-berhala yang kami sembah atau dia, yakni isa'' mereka tidak memberikannya, yakni perumpamaan itu, kepadamu, Muhammad, melainkan dengan maksud membantah saja, bukan untuk menunjukkan kebenaran keyakinan mereka, tetapi untuk memelesetkan apa yang disampaikan kepada mereka. Bahkan sebenarnya mereka adalah kaum yang suka bertengkar."
  }
]