[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik dari kaummu (wahai rasul) berkata, ”apakah tuhan-tuhan yang kami sembah ini lebih baik atau isa yang disembahi oleh kaumnya? bila isa di dalam neraka maka kami dan tuhan-tuhan kami juga di neraka.” mereka tidak membuat perumpamaan tersebut kecuali hanya untuk membantah, karena mereka adalah yang selalu membantah dengan kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan mereka berkata, “Mana yang lebih baik, sesembahan kami ataukah Isa?” Dan tidaklah Ibnu Az-Ziba'ra dan semisalnya membuat permisalan ini untukmu karena keinginan untuk sampai pada kebenaran, akan tetapi karena senang berdebat. Mereka adalah kaum yang mempunyai tabiat suka berdebat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَقَالُوٓا۟ ءَأٰلِهَتُنَا خَيْرٌ أَمْ هُوَ ۚ (Dan mereka berkata: “Manakah yang lebih baik tuhan-tuhan kami atau dia (Isa)?”) Yakni apakah tuhan-tuhan Kami atau Isa al-Masih yang lebih baik? Mereka menentangnya dengan mengatakan: “jika memang semua yang disembah selain Allah akan masuk neraka, maka kami rela tuhan-tuhan kami akan berkumpul bersama Isa al-Masih, ‘Uzair, dan para malaikat. مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًۢا ۚ( Mereka tidak memberikan perumpamaan itu kepadamu melainkan dengan maksud membantah saja) Yakni mereka tidak membuat perumpamaan bagimu tentang Isa melainkan agar mereka dapat membantahmu, dan bukan untuk mencari kebenaran, sebab Isa datang membawa tauhid dan mewasiatkan kaumnya dengan tauhid itu dengan ucapannya: “Allah adalah Tuhan kita, Tuhan yang satu.” بَلْ هُمْ قَوْمٌ خَصِمُونَ(sebenarnya mereka adalah kaum yang suka bertengkar) Yakni orang-orang yang sering berselisih dan berdebat namun tidak mengharapkan kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Mereka berkata: “Mana yang lebih baik, Tuhan kami atau Isa yang mereka jadikan Tuhan. Jika Tuhan mereka masuk neraka, tentunya Tuhan kami akan bersamanya di neraka. Allah kemudian menjawabnya bahwa orang-orang musyrik hanya bermaksud membantah dengan permisalan tersebut bukan untuk mencari kebenaran. Mereka adalah kaum yang suka bertengkar dalam kebatilan dan suka mencari musuh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Manakah yang lebih baik, tuhan-tuhan kami atau dia” Mereka tidak memberikan perumpamaan itu kepadamu, kecuali untuk membantah saja. Sebenarnya mereka adalah kaum yang suka bertengkar} suka berpegang pada pertengkaran dan kebathilan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “dan mereka berkata,’manakah yang lebih baik dari sesembahan-sesembahan kami atau dia?” yakni, nabi isa, di mana mereka dilarang untuk menyembah semuanya (termasuk nabi isa) serta kebersamaan mereka dalam ancaman yang menyembah mereka. Saat itu turun juga firman Allah, ”sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan jahanam, kamu pasti masuk kedalamnya,” (al-anbiya:98) Sisi kezhaliman hujjah mereka adalah karena mereka bekata,”sudah menjadi ketetapan bagi kami dan bagimu, wahai Muhammad bahwa Isa adalah salah seoang hamba Allah yang mendekatkan diri, yang memiliki kesudahan yang baik, lantas mengapa kau samakan antara isa dengan patung dalam larangan penyembahan tersebut semuanya, andai hujjahmu benar tentu tidak ditentang, lantas mengapa kau juga bekata,” sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan jahanam, kamu pasti masuk kedalamnya,” (al-anbiya:98) Nash ayat ini menurut mereka mencakup patung-patung dan nabi isa, ini tidak lain adalah kontradiksi dan kontadiksinya dalam hujjah menunjukkan bahwa ia batil. Inilah puncak syubhat yang mereka yakini, mereka yang bergembira karenannya dan mereka juga menghadang dan saling memberi kabar gembira. Tapi alhamdulillah syubhat tersebut yang paling lemah dan batil karena penyamaan antara larangan untuk menyembah isa dan larangan untuk menyembah patung adalah karena penyembahan merupakan hak Allah semata, dan tidak berhak bagi salah satu makhlukpun, tidak pula para malaikat yang mendekatkan diri,tidak pula para nabi yang diutus dan tidak pula makhluk lain selain mereka. Syubhat macam apa yang menyamakan larangan penyembahan nabi isa dan lainnya?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 58: (Dan mereka berkata, 'Manakah yang lebih baik tuhan-tuhan kami atau dia?') yakni nabi Isa, maka karenanya kami rela tuhan-tuhan kami bersama dia (Mereka tidak memberikan perumpamaan itu) atau misal tersebut (kepadamu melainkan dengan maksud membantah saja) atau menyanggah kamu dengan cara yang batil, karena mereka telah mengetahui, bahwa berhalaberhala yang tidak berakal itu tidak akan dapat menyamai Nabi Isa a.s. (sebenarnya mereka adalah kaum yang suka bertengkar\") sangat gemar bertengkar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat 57 dan 58 di atas menceritakan kembali kejadian ketika Rasulullah shallallahu 'alaihi wa sallam membacakan di hadapan orang-orang Quraisy surah Al Anbiya ayat 98 yang artinya, “Sesungguhnya kamu dan apa yang kamu sembah selain Allah adalah bahan bakar Jahannam.” Maka seorang Quraisy bernama Abdullah bin Az Zab'ari menanyakan kepada Rasulullah shallallahu 'alaihi wa sallam tentang keadaan Isa yang disembah orang Nasrani apakah beliau juga menjadi bahan bakar neraka Jahannam seperti halnya sembahan-sembahan mereka. Rasulullah shallallahu 'alaihi wa sallam terdiam dan mereka pun mentertawakannya; lalu mereka menanyakan lagi mengenai mana yang lebih baik antara sembahan-sembahan mereka dengan Isa ‘alaihis salam? Pertanyaan-pertanyan mereka ini hanyalah mencari perbantahan saja, bukan mencari kebenaran. Jalan pikiran mereka itu adalah kesalahan yang besar. Nabi Isa ‘alaihis salam yang disembah oleh orang-orang Nasrani sesungguhnya tidak rela dijadikan sesembahan. Di samping itu, penyamaan Allah Subhaanahu wa Ta'aala antara larangan menyembah berhala dan larangan menyembah Nabi Isa ‘alaihi salam adalah karena ibadah adalah hak Allah Subhaanahu wa Ta'aala saja, tidak dimiliki oleh seorang pun dari makhluk, baik malaikat yang didekatkan, para nabi yang diutus maupun lainnya, dimanakah letak syubhat ketika pelarangan diratakan baik menyembah patung maupun menyembah Isa ‘alaihis salam? Tidak ada bukan? Dan lagi kelebihan Nabi Isa ‘alaihis salam dan keadaannya yang dekat dengan Allah Subhaanahu wa Ta'aala tidaklah menunjukkan dibedakannya Beliau dalam masalah ini, karena Beliau sebagaimana diterangkan dalam lanjutan ayat adalah seorang hamba yang Allah berikan nikmat kepadanya dengan kenabian, hikmah, ilmu dan amal. Adapun firman Allah Ta’ala di surah Al Anbiya: 98, “Innakum wa maa ta’buduuna minduunillahi hashabu Jahannam” (artinya: Sesungguhnya kamu dan apa yang kamu sembah selain Allah adalah bahan bakar Jahannam.) maka dapat dikaji sebagai berikut: Pertama, firman-Nya tersebut menggunakan kata “maa” (apa) yang biasa digunakan untuk sesuatu yang tidak berakal, sehingga tidak termasuk ke dalamnya Nabi Isa ‘alaihis salam. Kedua, ayat ini tertuju kepada orang-orang musyrik yang tinggal di Mekah dan sekitarnya, dimana mereka menyembah patung dan berhala dan tidak menyembah Al Masih. Ketiga, bahwa Allah Subhaanahu wa Ta'aala setelah ayat tersebut berfirman, “Bahwa orang-orang yang telah ada untuk mereka ketetapan yang baik dari Kami, mereka itu dijauhkan dari neraka,” (Terj. Al Anbiyaa’: 101) Tidak diragukan lagi bahwa Isa dan para nabi yang lain serta para wali tergolong ke dalam ayat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 58",
    "description": "Dan mereka berkata, 'manakah yang lebih baik tuhan-tuhan kami, berupa berhala-berhala yang kami sembah atau dia, yakni isa'' mereka tidak memberikannya, yakni perumpamaan itu, kepadamu, Muhammad, melainkan dengan maksud membantah saja, bukan untuk menunjukkan kebenaran keyakinan mereka, tetapi untuk memelesetkan apa yang disampaikan kepada mereka. Bahkan sebenarnya mereka adalah kaum yang suka bertengkar. 59. Lalu Allah menunjukkan kepada mereka bahwa dia, yaitu isa, tidak lain hanyalah seorang hamba, bukan tuhan seperti keyakinan orang-orang nasrani, yang kami berikan nikmat ke nabian kepadanya dan kami jadikan dia sebagai contoh pelajaran yang sangat mengagumkan bagi bani israil, baik yang hidup pada masa isa maupun yang sesudahnya."
  }
]