[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Isa putra marayam hanya seorang hamba yang telah Kami beri nikmat dengan derajat kenabian dan Kami menjadikannya sebagai bukti dan pelajaran bagi bani israil, bukti yang menetapkan kuasa Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Tidaklah Isa bin Maryam melainkan hanyalah seorang hamba dari hamba-hamba Allah, Kami berikan kepadanya kenabian dan kerasulan dan Kami jadikan dia sebagai permisalan bagi Bani Israil yang mereka gunakan untuk menunjukkan kekuasaan Allah tatkala Dia menciptakannya tanpa bapak, sebagaimana Dia menciptakan Adam tanpa ibu dan bapak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ (Isa tidak lain hanyalah seorang hamba yang Kami berikan kepadanya nikmat) Yakni Kami muliakan dia dengan memberinya kenikmatan. وَجَعَلْنٰهُ مَثَلًا لِّبَنِىٓ إِسْرٰٓءِيلَ(dan Kami jadikan dia sebagai tanda bukti (kekuasaan Allah) untuk Bani lsrail) Yakni sebagai tanda dan pelajaran bagi mereka yang menjadikan mereka mengetahui kekuasaan Allah; kerena dia lahir tanpa ayah dan mampu menghidupkan orang mati, serta dapat menyembuhkan kebutaan, kusta, dan segala penyakit dengan izin Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Isa putera Maryam tidak lain hanyalah salah satu hamba Allah yang telah Allah anugerahi kenabian dan kerasulan. Kami telah menjadikan dia lahir tanpa seorang Ayah. Itu sebagai ayat atau bukti terhadap kekuasaan Kami untuk Bani Israil dan kaum lainnya. Matsalan : permisalan. Sebagai permisalan bagi orang-orang menyimpang, untuk ditunjukkan kekuasaan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia tidak lain} Isa AS tidak lain {kecuali seorang hamba yang Kami beri kenikmatan dan Kami jadikan dia sebagai pelajaran bagi Bani Israil} ayat dan pelajaran bagi Bani Israil yang menunjukkan pada kekuasaan Allah dimana Dia menciptakannya tanpa ayah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. nabi isa diutaamakan dan predikatnya sebagai yang dekat dengan Allah sama sekali tidak menunjukkan adanya sesuatu yang membedakan antaranya dengan patung dan behala dan penyembahan selain Allah, ”isa tidak lain hanyalah seoang hamba yang kami berikan kepadanya nikmat,” berupa kenabian,hikmah, ilmu, dan amal, “dan kami jadikan dia sebagai tanda bukti (kekuasaan Allah) untuk bani israil,” dimana dengan nabi isa, mereka mengetahui kuasa Allah yang menciptakannya tanpa ayah. Sedangkan firman Allah, ”sesungguhnya kamu dan apa yang kamu sembah selain Allah, adalah umpan jahanam, kamu pasti masuk kedalamnya,” (al-anbiya : 98) terdapat tiga hal untuk menjawabnya: pertama firman Allah, “sesungguhnya kamu dan apa yang kamu sembah selain Allah,” adalah isim (noun) untuk Sesuatu yang tidak berakal yang tidak mencakup nabi isa dan lainnya. Kedua, dialog ini tertuju pada kaum musyrikin yang berada di Makkah dan sekitarnya. Mereka hanya menyembah patung dan berhala, tidak menyembah nabi isa. Ketiga Allah berfirman setelah ayat ini, ”sesungguhnya orang-orang yang telah ada untuk mereka ketetapan yang baik dari kami, mereka itu dijauhkan dari neraka,” (al-anbiya:101), dan tidak diragukan bahwa nabi isa dan para nabi lain serta para wali temasuk dalam ayat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 59: (Bukankah) tidak lain (dia) yakni Nabi Isa itu (hanyalah seorang hamba yang Kami berikan kepadanya nikmat) kenabian (dan Kami jadikan dia) yaitu kelahirannya dengan tanpa ayah (sebagai perumpamaan untuk Bani Israel) maksudnya, sebagai bukti yang menunjukkan akan kekuasaan Allah swt. yang mampu menciptakan apa yang dikehendaki-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lahir dari Maryam tanpa bapak. Hal itu sebagai dalil Mahakuasanya Allah Subhaanahu wa Ta'aala atas apa yang Dia kehendaki. Ayat ini menegaskan pandangan Islam terhadap kedudukan lsa ‘alaihis salam, yaitu sebagai hamba Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 59",
    "description": "Lalu Allah menunjukkan kepada mereka bahwa dia, yaitu isa, tidak lain hanyalah seorang hamba, bukan tuhan seperti keyakinan orang-orang nasrani, yang kami berikan nikmat ke nabian kepadanya dan kami jadikan dia sebagai contoh pelajaran yang sangat mengagumkan bagi bani israil, baik yang hidup pada masa isa maupun yang sesudahnya. 60. Dan sekiranya kami menghendaki, tetapi kami tidak menghendaki dan tidak melakukannya, niscaya kami menjadikan sebahagian di antara kamu malaikat-malaikat yang secara turun temurun dan silih berganti menggantikan kamu di bumi."
  }
]