[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-8 Dan kami telah banyak mengutus nabi pada abad-abad pertama yang telah berlalu sebelum kaummu wahai nabi. Tidak ada seorang nabipun yang datang kepada mereka kecuali mereka memperolok-oloknya seperti kaummu memperolok-olokmu. Maka Kami membinasakan orang-orang yang membinasakan orang-orang yang membinasakan utusan-utusan Kami padahal mereka lebih besar kekuatan dan perlengkapannya dari kaummu wahi nabi. Azab atas orang-orang terdahulu telah berlalu disebabkan kekafiran dan pelanggaran serta penghinaan mereka terhadap nabi-nabi mereka. Disini terkandung hiburan bagi nabi ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan berapa banyak Kami telah mengutus Nabi pada umat-umat terdahulu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-10. Betapa banyak Nabi-Nabi yang telah Kami utus kepada umat-umat terdahulu! Namun tidaklah seorang Nabi datang kepada umat-umat itu melainkan mereka akan menghinanya. Oleh sebab itu Kami binasakan kaum yang lebih kuat dari kaummu itu -hai Rasulullah-, dan telah disebutkan kisah mereka dan kebinasaan mereka. Sungguh jika kamu bertanya kepada mereka, ‘Siapa yang menciptakan tujuh langit dan bumi?’ niscaya mereka akan menjawab, ‘Diciptakan oleh Allah Yang Maha Perkasa atas kerajaan-Nya dan Maha Mengetahui seluruh makhluk-Nya.’ Hai manusia, Allah menciptakan bagi kalian bumi yang terhampar, dan menciptakan jalan-jalan pada permukaannya, agar kalian dapat sampai pada tempat yang kalian tuju."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَكَمْ أَرْسَلْنَا مِن نَّبِىٍّ فِى الْأَوَّلِينَ (Berapa banyaknya nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu) Yakni betapa banyaknya nabi-nabi yang telah Kami utus kepada umat-umat terdahulu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Kami telah banyak mengutus para rasul dan nabi sebelum kamu untuk umat-umat terdahulu wahai Rasulallah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Betapa banyak nabi yang telah Kami utus kepada umat-umat yang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6-8. Allah berfirman, bahwa ini adalah kesempatan kami pada makhluk, untuk tidak membiarkan mereka sia-sia, “berapa banyaknya nabi-nabi yang telah kami utus kepada umat-umat terdahulu,” memerintahkan mereka untuk menyembah Allah semata, yang tidak ada sekutu bagiNya. Akan tetapi sikap mendustakan tetap saja ada di berbagai umat. “dan tiada seorang nabi pun datang kepada mereka melainkan mereka selalu memperolok-oloknya,” karena membantah ajaran yang dibawa serta merasa congkak pada kebenaran. “maka telah kami binasakan orang-orang yang lebih besar,” dari mereka, “kekuatannya,” yaitu kekuatan, tindakan, dan bekas-bekasnya di bumi, “dan telah terdahulu (tersebut dalam al-qur’an) perumpamaan umat-umat masa dahulu,” yaitu, orang-orang yang seperti mereka dan berita mereka telah berlalu, dan kami juga telah menjelaskan pelajaran dan larangan untuk tidak mendustakan dan mengingkari."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 6: Berapa banyak nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala dengan ayat ini menerangkan bahwa sudah menjadi sunnah-Nya; Dia tidak meninggalkan mereka begitu saja, bahkan betapa banyak nabi-nabi yang telah diutus-Nya kepada umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 6",
    "description": "Setelah Allah menegaskan bahwa Al-Qur'an adalah kitab yang bernilai tinggi dan tidak akan pernah berhenti di turunkan walaupun mendapat penolakan dari orang-orang kafir, maka pada ayat ini Allah menegaskan bahwa sikap orang-orang musyik mekah tidak beda dengan umat-umat sebelumnya, 'dan betapa banyak nabi-nabi yang telah kami utus kepada umat-umat yang terdahulu sebelum engkau, wahai nabi Muhammad, sikap umat-umat mereka tidak berbeda dengan sikap orang-orang musyrik mekah yang kamu hadapi. ' 7. Dan di antara sikap mereka adalah bahwa setiap kali seorang nabi datang kepada mereka, mereka enggan menerima kehadirannya. Mereka memperlihatkan sikap-sikap yang buruk kepada para nabi itu dan selalu memperolok-olokkannya dengan berbagai macam olokan meskipun para nabi telah di dukung dengan berbagai bukti atas kebenaran dakwah mereka."
  }
]