[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kalau Kami berkenan niscaya Kami menjadikan sebagai ganti kalian para malaikat yang sebagian yang lain sebagai ganti manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan seandainya Kami berkehendak untuk menghancurkan kalian -wahai Bani Adam- nicaya kami hancurkan kalian dan Kami jadikan para Malaikat sebagai pengganti kalian di bumi, mereka menyembah Allah dan tidak menyekutukan-Nya dengan sesuatu apapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Hai manusia, seandainya Kami menghendaki, niscaya sebagian kalian akan Kami jadikan sebagai malaikat yang menguasai bumi sebagai pengganti kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَلَوْ نَشَآءُ لَجَعَلْنَا مِنكُم مَّلٰٓئِكَةً فِى الْأَرْضِ يَخْلُفُونَ (Dan kalau Kami kehendaki benar-benar Kami jadikan sebagai gantimu di muka bumi malaikat-malaikat yang turun temurun) Yakni seandainya Kami menghendaki niscaya Kami akan membinasakan kalian dan mengganti kalian di bumi dengan para malaikat yang memakmurkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Sekiranya Kami berkehendak, maka akan Kami jadikan para malaikat sebagai pengganti kalian untuk menjadi mengurusi dan memakmurkan bumi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya Kami berkehendak, niscaya Kami menjadikan malaikat sebagai pengganti kalian} sebagai pengganti kalian {di bumi secara turun temurun} saling bergantian satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. selanjutnya Allah berfiman “dan kalau kami kehendaki, benar-benar kami jadikan sebagai gantimu di muka bumi malaikat-malaikat yang turun temurun,” artinya, niscaya kami jadikan para malaikat sebagai pengganti kalian dan mereka tetap berada di bumi hingga kami mengutus malaikat (sebagai rasul) dari jenis mereka. Sedangkan kalian wahai para manusia! Kalian tidak akan mampu bila para malaikat diutus sebagai rasul dari jenis kalian sehingga memungkinkan bagi kalian untuk belajar darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 60: (Dan kalau Kami kehendaki benar-benar Kami jadikan sebagai ganti kalian) untuk mengganti kalian (di muka bumi malaikat-malaikat yang turun temurun) misalnya, kalian Kami binasakan terlebih dahulu, lalu Kami jadikan malaikat sebagai ganti kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni lalu mereka tinggal di bumi, kemudian Allah mengutus utusan yang terdiri dari para malaikat. Adapun kamu wahai manusia! Maka tidak bisa yang diutus kepadamu adalah para malaikat (tidak sejalan). Oleh karena itu, termasuk rahmat Allah kepadamu adalah Dia mengutus para rasul dari jenismu agar kami dapat menimba ilmu dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 60",
    "description": "Dan sekiranya kami menghendaki, tetapi kami tidak menghendaki dan tidak melakukannya, niscaya kami menjadikan sebahagian di antara kamu malaikat-malaikat yang secara turun temurun dan silih berganti menggantikan kamu di bumi. 61. Dan sungguh dia, yakni nabi isa yang mengagumkan itu yang lahir tanpa ayah, dan dianugerahi kemampuan menghidupkan orang mati serta menyembuhkan berbagai macam penyakit, benar-benar menjadi pertanda akan datangnya hari kiamat. Karena itu, janganlah kamu ragu-ragu sedikit pun tentang kepastian datangnya hari kiamat itu dan ikutilah aku dengan mengikuti ajaran-ajaran yang disampaikan oleh rasul-ku. Inilah jalan yang lurus yang dapat menyelamatkan kamu dari siksaan-ku di dunia dan di akhirat."
  }
]