[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya turunnya Isa sebelum Hari Kiamat menunjukkan bahwa Kiamat sudah dekat, maka jangan meragukannya, karena ia pasti dan tidak bisa tidak, dan ikutilah apa yang aku kabarkan kepada kalian dari Allah, ini adalah jalan lurus menuju surga, yang tiada kebengkokan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Dan sesunguhnya Isa adalah salah satu tanda dari tanda-tanda hari Kiamat besar ketika dia turun pada akhir jaman, maka janganlah engkau ragu tentang datangnya hari Kiamat. Dan ikutilah aku pada apa yang aku bawa dari sisi Allah. Apa yang aku bawa ini adalah jalan lurus yang tidak ada bengkoknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61-62. Turunnya Isa sebelum hari kiamat merupakan tanda dekatnya kedatangan hari kiamat, maka janganlah kalian meragukan itu dan taatilah perintah-Ku, ini adalah jalan yang lurus menuju surga. Dan janganlah setan menghalangi kalian dengan kesesatannya dari ketaatan dan hidayah-Ku, dia adalah musuh kalian yang sangat jelas permusuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَإِنَّهُۥ لَعِلْمٌ لِّلسَّاعَةِ (Dan sesungguhnya Isa itu benar-benar memberikan pengetahuan tentang hari kiamat) Yang dimaksud adalah Isa al-Masih, turunnya dia dari langit adalah tanda kedekatan terjadinya hari kiamat, karena dia merupakan salah satu dari tandanya sebab Allah akan menurunkannya dari langit sebelum terjadinya hari kiamat sebagaimana keluarnya Dajjal merupakan tanda kedatangan hari kiamat. فَلَا تَمْتَرُنَّ بِهَا (Karena itu janganlah kamu ragu-ragu tentang kiamat itu) Maka janganlah kalian meragukan kejadiannya dan jangan pula mendustakannya, sebab hari kiamat pasti akan datang. وَاتَّبِعُونِ ۚ هٰذَا صِرٰطٌ مُّسْتَقِيمٌ (dan ikutilah Aku. Inilah jalan yang lurus) Yakni ikutilah aku dalam apa yang aku perintahkan kepada kalian berupa mengesakan Allah dan menjauhi kemusyrikan, sebab perintahku ini merupakan jalan yang lurus yang mengantarkan kepada kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Ketika kelak Isa keluar sebagai tanda besar akan datangnya kiamat. Seperti juga kedatangan Dajjal, maka jangan sekali kalian mengeluh, karena hari kiamat itu benar-benar suatu kepastian dan tidak ada keraguan. Lakukanlah perintahku dan taatlah kepadaku untuk mengesakan Allah dan menghilangkan kesyirikan. Inilah yang aku serukan kepada kalian yaitu jalan yang lurus tidak berbelok-belok menuju surga dan keridhoan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya dia itu benar-benar menjadi pertanda tentang hari kiamat} sesungguhnya turunnya Isa di akhir zaman merupakan tanda atas semakin dekatnya hari kiamat {Maka jangan sekali-kali kamu ragu tentangnya} maka janganlah kamu ragu tentang terjadinya kiamat {dan ikutilah Aku. Ini adalah jalan yang lurus} jalan yang lurus menuju surga tanpa ada kebengkokan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. “dan sesungguhnya isa itu benar-benar memberikan pengetahuan tentang hari kiamat,” maksudnya, nabi isa benar-benar tanda atas hari kiamat dan sesungguhnya Allah yang kuasa menciptakannya dari seorang ibu tanpa ayah juga mampu menghidupkan oang-orang mati dari kubur. Atau, nabi isa akan turun di akhir zaman dan turunnya nabi isa adalah salah satu tanda datangnya hari kiamat. “karena itu janganlah kamu ragu-ragu tentang kiamat itu,” yakni, janganlah kalian meragukan hari kiamat sebab meragukan hari kiamat adalah suatu kekufuran, “dan ikutilah aku,” dengan menjalankan apa yang aku perintahkan dan menjauhi apa yang aku larang. “inilah jalan yang luus,” yang menghantarkan kepada Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 61: (Dan sesungguhnya dia) Nabi Isa itu (benar-benar merupakan pengetahuan tentang hari kiamat) artinya, dengan diturunkannya dia maka diketahuilah dekatnya hari kiamat. (Karena itu janganlah kalian ragu-ragu tentang kiamat itu) atau janganlah kalian meragukannya. Lafal Tamtarunna asalnya Tamtarunanna, kemudian dibuang daripadanya Nun alamat rafa' karena dijazmkan, dan dibuang pula daripadanya Wawu Dhamir jamak tetapi bukan karena Illat bertemunya dua huruf yang disukunkan, sehingga jadilah Tamtarunna. (Dan) katakanlah kepada mereka, (\"Ikutilah aku) yakni ajaran tauhid ini. (Inilah) apa yang kuperintahkan kalian menjalankannya (jalan) atau tuntunan (yang lurus.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika Isa turun ke dunia di akhir zaman saat Dajjal telah keluar, merupakan tanda dekatnya hari Kiamat, demikian pula menunjukkan bahwa yang berkuasa menciptakannya tanpa bapak, berkuasa pula membangkitkan orang-orang yang telah mati dari kubur mereka. Karena meragukannya adalah sebuah kekufuran. Yaitu dengan mengerjakan apa yang aku perintahkan dan menjauhi apa yang aku larang. Di antara yang aku perintahkan adalah mentauhidkan Allah ‘Azza wa Jalla. Yang menghubungkan kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 61",
    "description": "Dan sungguh dia, yakni nabi isa yang mengagumkan itu yang lahir tanpa ayah, dan dianugerahi kemampuan menghidupkan orang mati serta menyembuhkan berbagai macam penyakit, benar-benar menjadi pertanda akan datangnya hari kiamat. Karena itu, janganlah kamu ragu-ragu sedikit pun tentang kepastian datangnya hari kiamat itu dan ikutilah aku dengan mengikuti ajaran-ajaran yang disampaikan oleh rasul-ku. Inilah jalan yang lurus yang dapat menyelamatkan kamu dari siksaan-ku di dunia dan di akhirat. 62. Dan oleh sebab itu, Allah dengan tegas memperingatkan mereka dengan mengatakan, 'janganlah kamu sekali-kali di palingkan oleh setan dari jalan-ku yang lurus itu sehingga menyimpang dari ajaran-ajaran-ku. Sungguh, setan itu merupakan musuh yang nyata bagimu yang selalu membawa kamu kepada kesesatan. '."
  }
]