[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jangan sampai setan menghalang-halangi kalian dengan godaannya sehingga kalian tidak menaatiKu dalam apa yang Aku perintahkan kepada kalian dan apa yang aku larang kalian melakukannya. Sesungguhnya setan itu musuh yang nyata bagi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Dan janganlah sampai setan membelokkan kalian dari jalan yang lurus dengan kesesatannya dan iming-imingnya, sesungguhnya setan adalah musuh yang nyata permusuhannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَلَا يَصُدَّنَّكُمُ الشَّيْطٰنُ (Dan janganlah kamu sekali-kali dipalingkan oleh syaitan) Yakni janganlah kalian terperdaya oleh bisikan dan godaan yang dimasukkan ke dalam hati kalian, sehingga menghalangi kalian dari mengikutiku. إِنَّهُۥ لَكُمْ عَدُوٌّ مُّبِينٌ(sesungguhnya syaitan itu musuh yang nyata bagimu) Yakni dia menyatakan permusuhan dengan kalian tanpa keraguan sedikitpun dan tanpa menyembunyikan permusuhannya itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Jangan sampai kalian dibuat berpaling oleh setan, sungguh mereka itu musuh yang nyata bagi kalian, mereka mengajak kalian dalam kesesatan dan kebinasaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jangan sekali-kali kalian dipalingkan} Jangan sampai kalian dipalingkan dari agama Allah {oleh setan. Sesungguhnya dia merupakan musuh yang nyata bagi kalian} yang tampak permusuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “dan janganlah kamu sekali-kali dipalingkan oleh setan,” dari apa yang Allah perintahkan, karena setan adalah “musuh yang nyata bagimu,” yang amat ingin menyesatkanmu dengan usaha paling keras untuk itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 62: (Dan janganlah kalian sekali-kali dipalingkan) dapat dipalingkan dari agama Allah (oleh setan; sesungguhnya setan itu musuh yang nyata bagi kalian\") nyata permusuhannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari menjalankan perintah Allah. Ia berusaha sekuat tenaga untuk menyesatkan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 62",
    "description": "Dan oleh sebab itu, Allah dengan tegas memperingatkan mereka dengan mengatakan, 'janganlah kamu sekali-kali di palingkan oleh setan dari jalan-ku yang lurus itu sehingga menyimpang dari ajaran-ajaran-ku. Sungguh, setan itu merupakan musuh yang nyata bagimu yang selalu membawa kamu kepada kesesatan. '63. Dan ketika nabi isa datang kepada kaumnya, bani israil, membawa keterangan yang nyata yang bersumber dari Allah, dia lalu berkata, 'sungguh, aku datang kepadamu, wahai kaumku dengan membawa hikmah, yakni ajaran-ajaran dan hukum-hukum yang bersumber dari Allah yang dapat menyelamatkan kamu dan untuk menjelaskan kepada-Mu sebagian dari apa yang kamu perselisihkan dari ajaran-ajaran agama yang di turunkan Allah di dalam taurat. Maka bertakwalah kamu kepada Allah dengan melaksanakan segala yang di perintahkan-Nya dan meninggalkan larangan-larangan-Nya dan taatlah pula kepadaku dengan mengikuti tuntunan yang aku sampaikan kepadamu."
  }
]