[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Dan ketika Isa datang kepada Bani Israil dengan membawa keterangan-keterangan yang nyata dan dalil-dalil, Isa berkata, “Aku datang kepada kalian dengan kenabian, aku akan menjelaskan kepada kalian sebagian perkara yang kalian perselisihkan terkait dengan agama kalian, maka bertakwalah kepada Allah dengan menjalankan perintah-perintahNya dan menjauhi larangan-laranganNya dan taatilah dalam apa yang aku perintahkan kepada kalian dari Tuhan kalian, yaitu agar kalian bertakwa dan menaati Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Dan tatkala Isa -'alaihissalām- datang kepada kaumnya dengan bukti-bukti yang nyata bahwa dia adalah seorang Rasul, dia berkata kepada mereka, “Aku membawa hikmah kepada kalian dari sisi Allah, dan agar aku menjelaskan bagi kalian sebagian apa yang kalian perselisihkan dari permasalahan agama kalian. Maka bertakwalah kepada Allah dengan menjalankan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya, dan taatilah aku pada apa yang aku perintahkan kepada kalian dan yang aku larang kalian darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Setelah Isa mendatangkan berbagai mukjizat yang luar biasa kepada Bani Israil, dia berkata: “Aku datang kepada kalian sebagai Nabi, aku akan menjelaskan sebagian perkara agama yang kalian perselisihkan, maka takutlah kepada Allah dan taatilah perintahku. Allah adalah Tuhanku dan Tuhan kalian semua, maka sembahlah Dia semata, inilah jalan yang lurus menuju surga.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. وَلَمَّا جَآءَ عِيسَىٰ بِالْبَيِّنٰتِ (Dan tatkala Isa datang membawa keterangan) Yakni membawa mukjizat-mukjizat yang jelas dan syari’at-syari’at berupa Injil. قَالَ قَدْ جِئْتُكُم بِالْحِكْمَةِ(dia berkata: “Sesungguhnya aku datang kepadamu dengan membawa hikmat) Yakni dengan kenabian. Dan pendapat lain mengatakan bahwa makna hikmat di sini adalah apa yang dapat mendekatkan pada kebaikan dan menghentikan keburukan. وَلِأُبَيِّنَ لَكُم بَعْضَ الَّذِى تَخْتَلِفُونَ فِيهِ ۖ( dan untuk menjelaskan kepadamu sebagian dari apa yang kamu berselisih tentangnya) Yakni tentang hukum-hukum yang ada dalam Taurat. فَاتَّقُوا۟ اللهَ(maka bertakwalah kepada Allah) Yakni janganlah kalian bermaksiat kepada-Nya. وَأَطِيعُونِ(dan taatlah (kepada)ku) Dalam tauhid dan syari’at-syari’at yang aku perintahkan kepada kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Ketika Isa datang dan menyampaikan ayat-ayat Injil kepada Bani Israil, Isa berkata: “Aku datang kepada kalian sebagai nabi dan dengan kitab Injil, untuk memberi penjelasan kepada kalian tentang berbagai hukum yang kalian perdebatkan dalam kitab Taurat. Sehingga mereka takut kepada Allah, menjauhi maksiat. Lalu taatilah perintahku untuk mengesakan Allah dan menjalankan syariat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika Isa datang membawa bukti-bukti nyata} dalil-dalil yang jelas {dia berkata,“Sungguh aku datang kepada kalian dengan membawa hikmah} dengan kenabian {dan untuk menjelaskan kepada kalian sebagian dari apa yang kalian perselisihkan. Maka bertakwalah kepada Allah dan taatilah aku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. ”dan tatkala isa datang membawa ketenangan,” yang menunjukkan atas kebenaran nubuwaah (kenabian) dan kebenaran mukjizat yang dibawanya seperti menghidupkan orang mati,menyembuhkan orang buta dan mukjizat lain, “ia berkata,” kepada bani israil,”sesungguhnya aku datang kepadamu dengan membawa hikmah,” yakni, kenabian dan ilmu yang selayaknya,”dan untuk menjelaskan kepadamu sebagian dari apa yang kamu berselisih tentangnya,” maksudnya, aku menjelaskan kebenaran dan jawabannya pada kalian sehingga kesulitan itu hilang dari kalian. Nabi isa datang untuk menyempurnakan dan melengkapi syariat nabi musa dan juga hukum-hukum taurat. Nabi isa datang dengan membawa beberapa kemudahan yang mengharuskan risalah beliau untuk dipatuhi dan diterima.”maka bertakwalah kepada Allah dan taatlah (kepada)ku,” yakni, sembahlah Allah semata yang tidak ada sekutu bagiNya, kerjakan perintahNYa jauhi laranganNya dan berimanlah padaku, benarkan aku dan ikutilah aku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 63: (Dan tatkala Isa datang dengan membawa keterangan-keterangan) mukjizat-mukjizat dan syariat-syariat (dia berkata, \"Sesungguhnya aku datang kepada kalian dengan membawa hikmah) kenabian dan syariat Injil (dan untuk menjelaskan kepada kalian sebagian dari apa yang kalian berselisih tentangnya) yakni tentang hukum-hukum Taurat, yaitu menyangkut masalah agama dan masalah-masalah lainnya, Nabi Isa menjelaskan kepada mereka perkara agama yang sebenarnya (maka bertakwalah kepada Allah dan taatlah kepadaku.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menunjukkan benarnya kenabian Beliau dan apa yang Beliau bawa, seperti menghidupkan orang yang mati, menyembuhkan orang yang buta sejak lahir dan orang yang berpenyakit sopak. Kepada Bani Israil. Yang dimaksud dengan hikmah di sini ialah kenabian, Injil, ilmu dan hukum. Sehingga kesamaran menjadi hilang. Oleh karena itu, Nabi Isa ‘alaihis salam datang menyempurnakan syariat Nabi Musa ‘alaihis salam dan datang membawa sebagian kemudahan yang seharusnya diikuti dan diterima Yakni sembahlah Allah saja, ikutilah perintah-Nya dan jauhilah larangan-Nya, berimanlah kepadaku, benarkanlah aku dan taatilah aku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 63",
    "description": "Dan ketika nabi isa datang kepada kaumnya, bani israil, membawa keterangan yang nyata yang bersumber dari Allah, dia lalu berkata, 'sungguh, aku datang kepadamu, wahai kaumku dengan membawa hikmah, yakni ajaran-ajaran dan hukum-hukum yang bersumber dari Allah yang dapat menyelamatkan kamu dan untuk menjelaskan kepada-Mu sebagian dari apa yang kamu perselisihkan dari ajaran-ajaran agama yang di turunkan Allah di dalam taurat. Maka bertakwalah kamu kepada Allah dengan melaksanakan segala yang di perintahkan-Nya dan meninggalkan larangan-larangan-Nya dan taatlah pula kepadaku dengan mengikuti tuntunan yang aku sampaikan kepadamu. 64. Sungguh Allah yang kamu takuti, taati, dan patuhi itu, dialah tuhanku dan tuhanmu yang telah menciptakan aku dan kamu dan telah memberikan berbagai nikmat kepadaku dan kepadamu, maka sembahlah dia satu-satunya, jangan menyekutukan dia dengan yang lain. Ini adalah jalan yang lurus yang dapat menyelamatkan kamu dari siksaan-Nya yang amat pedih. '."
  }
]