[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Sesungguhnya Allah adalah Tuhanku dan Tuhan kalian semuanya, maka sembahlah Dia semata, dan jangan menyekutukanNya dengan sesuatu pun. Apa yang aku perintahkan kepada kalian ini berupa ketakwaan dan pengesaan Allah dalam uluhiyah adalah jalan yang lurus, ia adalah agama Allah yang haq di mana Dia tidak menerima selainnya dari siapapun.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Sesungguhnya Allah adalah Rabbku dan Rabb kalian, tidak ada Rabb lain bagi kita selain Dia, maka ikhlaskan ibadah hanya kepada-Nya semata. Tauhid ini adalah jalan lurus yang tidak ada bengkoknya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. إِنَّ اللهَ هُوَ رَبِّى وَرَبُّكُمْ فَاعْبُدُوهُ ۚ (Sesungguhnya Allah Dialah Tuhanku dan Tuhan kamu maka sembahlah Dia) Ini merupakan penjelasan tentang apa yang harus mereka taati. هٰذَا صِرٰطٌ مُّسْتَقِيمٌ(ini adalah jalan yang lurus) Yakni menyembah Allah semata dan menjalankan syari’at-syari’at-Nya merupakan jalan lurus yang mengantarkan kepada keridhaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Allah itu adalah Tuhanku dan juga Tuhan kalian, maka sembahlah Allah semata. Taatilah perintah dan syariat-Nya. Inilah jalan lurus yang aku serukan kepada kalian, dan akan menuntun kalian menuju surga dan keridhoan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah, Dialah Tuhanku dan Tuhan kalian. Sembahlah Dia. Ini adalah jalan yang lurus”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “sesungguhnya Allah, Dialah Rabbku dan Rabbmu, maka sembahlah Dia, ini adalah jalan yang lurus,” dalam pernyataan ini terdapat pengakuan akan tauhid rrububiyyah karena sesungguhnya Allah adalah Dzat yang mengatur seluruhnya makhluk dengan berbagai nikmat, baik yang lahir maupun yang batin, serta pengakuan akan tauhid ubudiyah berupa perintah untuk menyembah Allah semata yang tidak ada sekutu bagiNya seta pemberitahuan bahwa Allah tidak seperti yang dikatakan orang-orang nasrani bahwa dia adalah putra Allah atau salah satu dari tiga unsur (trinitas). Didalam ayat ini juga tedapat pemberitahuan bahwa semua yang tersebut itu adalah jalan yang luus yang menghantarkan kepada Allah dan kepada surgaNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 64: (Sesungguhnya Allah Dialah Rabbku dan Rabb kalian, maka sembahlah Dia, ini adalah jalan) tuntunan (yang lurus.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat pengakuan terhadap tauhid rububiyyah (Allah adalah Pengatur alam semesta) dan tauhid Uluhiyyah (Allah yang berhak disembah saja), demikian pula terdapat pemberitahuan bahwa Isa ‘alaihis salam adalah salah satu di antara hamba-hamba Allah, dan bahwa apa yang disebutkan ini adalah jalan yang lurus; yang menyampaikan kepada Allah dan kepada surga-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 64",
    "description": "Sungguh Allah yang kamu takuti, taati, dan patuhi itu, dialah tuhanku dan tuhanmu yang telah menciptakan aku dan kamu dan telah memberikan berbagai nikmat kepadaku dan kepadamu, maka sembahlah dia satu-satunya, jangan menyekutukan dia dengan yang lain. Ini adalah jalan yang lurus yang dapat menyelamatkan kamu dari siksaan-Nya yang amat pedih. '65. Akan tetapi, golongan-golongan yang ada saling berselisih di antara mereka mengenai pribadi nabi isa yang agung dan hamba Allah yang lahir tanpa ayah itu. Maka, celakalah orang-orang yang zalim itu karena perselisihan mereka dan mengingkari isa sebagai utusan Allah dan menentang ajaran agama yang dibawanya karena azab hari yang amat pedih pada hari kiamat kelak."
  }
]