[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Maka orang-orang berselisih tentang perkara Isa sehingga mereka menjadi beberapa kelompok, diantara mereka ada yang mengakui bahwa Isa adalah hamba dan utusan Allah dan inilah yang benar, dan diantara mereka ada yang mengklaim bahwasanya ia sebagai putra Allah, dan diantara mereka ada yang berkata bahwa dia adalah Allah. MahaTinggi Allah dari perkataan mereka setinggi-tingginya. Kebinasaan dan azab yang pedih di Hari Kiamat atas siapa yang menyifati Isa bukan dengan sifat yang Allah tetapkan untuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Lalu berbagai kelompok Nasrani berselisih pendapat tentang Isa, di antara mereka ada yang berkata, dia adalah tuhan, dan ada yang berkata dia adalah anak Allah, ada juga yang berkata bahwa dia dan ibunya adalah dua tuhan. Maka celakalah bagi orang yang menganiaya dirinya sendiri -karena menyebut Isa sebagai tuhan, sebagai anak tuhan atau sebagai satu dari tiga tuhan- dengan siksa menyakitkan yang menunggu mereka pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65-66. Maka golongan-golongan yang ada dalam Yahudi dan Nasrani saling berselisih tentang Isa, dan mereka terlalu berlebih-lebihan dalam mengagungkannya. Celakalah orang-orang yang menzalimi diri mereka sendiri dengan melakukan kekafiran ketika mereka mendapat azab yang pedih pada hari kiamat. Bukankah orang-orang yang menyelisihi Isa itu menunggu melainkan hari kiamat yang datang secara tiba-tiba saat mereka lalai darinya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. إِنَّ اللهَ هُوَ رَبِّى وَرَبُّكُمْ فَاعْبُدُوهُ ۚ (Sesungguhnya Allah Dialah Tuhanku dan Tuhan kamu maka sembahlah Dia) Ini merupakan penjelasan tentang apa yang harus mereka taati. هٰذَا صِرٰطٌ مُّسْتَقِيمٌ(ini adalah jalan yang lurus) Yakni menyembah Allah semata dan menjalankan syari’at-syari’at-Nya merupakan jalan lurus yang mengantarkan kepada keridhaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Kelompok Yahudi dan Nasrani berbeda pendapat dalam menentukan siapa sebenarnya Isa. Apakah dia Tuhan, ataukah putera Allah, ataukah salah satu Tuhan dari tiga Tuhan (trinitas)? Kebinasaan dan azab yang pedi pada hari kiamat adalah bagi mereka yang mengingkari dan menyekutukan Allah dan tidak melaksanakan syariat-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Golongan-golongan di antara mereka} orang-orang yang bersekutu dari kaum Isa, terkait perkara itu {berselisih. Maka celakalah} binasalah {orang-orang yang zalim karena azab pada hari yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. ketika nabi isa datang kepada mereka dengan membawa risalah itu, “maka beselisihlah golongan-golongan (yang terdapat),” mereka yang berpihak pada kedustaan, “diantara mereka,” masing-masing mengatakan pekataan batil tentang nabi isa dan menolak risalah yang dibawanya kecuali oang-orang beriman yang mendapat petunjuk Allah, mereka yang bersaksi atas kerasulannya dan membenarkan apa yang dibawanya dan mengatakan bahwa nabi isa adalah hamba dan rasul Allah. “lalu kecelakaan yang besarlah bagi orang-oang yang zhalimi dai siksaan hai yang pedih (kiamat),” yaitu, alangkah besarnya kesedihan orang-oang zhalim dan alangkah besarnya kerugian mereka pada hari itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 65: (Maka berselisihlah golongan-golongan di antara mereka) tentang perkara Nabi Isa ini, apakah dia anak Allah atau Allah, atau tuhan yang ketiga (maka kecelakaan yang besarlah) lafal Al Wail menunjukkan kalimat azab (bagi orang-orang yang lalim) bagi orang-orang kafir, karena perkataan yang mereka ucapkan mengenai Nabi Isa (yaitu siksaan hari yang pedih) atau azab yang menyakitkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Nabi Isa ‘alaihis salam menerangkan kebenaran. Tentang Nabi Isa, ada yang mengatakan bahwa dia adalah Allah, atau dia putra Allah atau dia salah satu di antara yang tiga. Padahal yang benar bahwa Isa adalah hamba Allah dan Rasul-Nya. Demikian pula mereka membantah apa yang Beliau bawa. Kecuali orang-orang yang beriman, yang bersaksi terhadap kerasulan Beliau, membenarkan semua yang Beliau bawa, dan mereka berkata tentang Beliau, bahwa Beliau adalah hamba Allah dan Rasul-Nya. Yakni alangkah sedih, rugi dan celaka mereka pada hari itu. Yakni orang-orang yang kafir karena ucapan mereka yang salah tentang Nabi Isa ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 65",
    "description": "Akan tetapi, golongan-golongan yang ada saling berselisih di antara mereka mengenai pribadi nabi isa yang agung dan hamba Allah yang lahir tanpa ayah itu. Maka, celakalah orang-orang yang zalim itu karena perselisihan mereka dan mengingkari isa sebagai utusan Allah dan menentang ajaran agama yang dibawanya karena azab hari yang amat pedih pada hari kiamat kelak. 66. Dengan pembangkangan mereka untuk mengakui nabi isa sebagai rasul Allah dan pengingkaran mereka terhadap ajaran-Nya, lalu Allah mengatakan bahwa apakah mereka dengan keadaan yang demikian itu hanya menunggu saja kedatangan hari kiamat yang datang kepada mereka secara mendadak, tanpa mereka mengetahui sebelumnya, sedang mereka tidak menyadarinya karena mereka selalu sibuk dengan pertengkaran mereka'."
  }
]