[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang berteman akrab dalam kemaksiatan kepada Allah di dunia, sebagian dari mereka akan berlepas diri dari sebagian yang lain di Hari Kiamat, akan tetapi orang-orang yang berkawan di atas landasan takwa kepada Allah, maka perkawanan mereka tetap berlangsung di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Orang-orang yang saling berteman dan berkawan dalam kekufuran dan kesesatan pada hari Kiamat nanti sebagian dari mereka menjadi musuh dari sebagian yang lain, kecuali orang-orang yang bertakwa kepada Allah dengan melaksanakan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya, maka ikatan pertemanan mereka abadi, tidak putus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67-73. Orang-orang yang saling mencintai atas dasar keduniaan dan syahwat, maka mereka akan saling bermusuhan pada hari kiamat. Kecuali orang-orang yang takut kepada Allah dengan menjalankan ketaatan dan saling mencintai karena Allah, maka akan dikatakan kepada mereka: “Hai hamba-hamba-Ku, janganlah kalian takut dari siksaan-Ku dan jangan kalian bersedih karena dunia yang kalian lewatkan. Orang-orang yang beriman kepada ayat-ayat Kami dan tunduk kepada Allah akan dikatakan kepada mereka, ‘Masuklah ke dalam surga dari delapan pintunya, kalian dan pasangan kalian akan mendapatkan kenikmatan di dalam surga itu.’ Di dalam surga mereka akan dikelilingi makanan yang berada di wadah dari emas dan gelas-gelas emas yang menjadi tempat minuman mereka. Di dalam surga mereka akan mendapatkan segala kenikmatan yang diri mereka inginkan dan yang mata mereka sukai. Mereka akan tinggal di dalam surga selamanya. Itulah surga yang tinggi derajatnya yang Allah berikan bagi kalian berkat kebaikan yang kalian lakukan ketika di dunia. Di dalamnya kalian akan mendapatkan berbagai jenis buah-buahan yang dapat kalian makan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. الْأَخِلَّآءُ يَوْمَئِذٍۭ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ (Teman-teman akrab pada hari itu sebagiannya menjadi musuh bagi sebagian yang lain) Yakni para teman dekat di dunia yang saling mencintai karena urusan dunia akan saling bermusuhan pada hari kiamat, dan mereka mandapati urusan yang menjadikan mereka saling mencintai adalah sebab azab bagi mereka, oleh sebab itu mereka menjadi musuh satu sama lain. إِلَّا الْمُتَّقِينَ(kecuali orang-orang yang bertakwa) Maka mereka adalah teman-teman dekat di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Orang-orang yang saling berteman dan saling bersahabat di dunia hanya atas dasar urusan dunia dan permainannya saja kelak pada hari kiamat akan saling membenci satu sama lain. Kecuali orang-orang yang bertakwa, yaitu orang-orang yang senantiasa taat dan menjalankan perintah Allah serta menjauhi larangan-Nya. Mereka saling mencintai karena Allah semata, merekalah orang-orang yang setia satu sama lain dan sahabat sejati. Ayat ini turun untuk Umayyah bin Khalf Aljumahi dan Uqbah bin Abi Mu’ith dua orang yang saling berteman karib. Mereka bersepakat dan satu misi untuk menyakiti/melukai Nabi SAW, namun mereka berdua terbunuh dalam perang Badr"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Teman-teman akrab} teman-teman dan kekasih {pada hari itu} pada hari kiamat {saling bermusuhan satu sama lain, kecuali orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. teman-teman akrab pada hari kiamat yang saling berteman dalam kekufuan,pendustaan, dan kemaksiatan, “sebagiannya menjadi musuh bagi sebagaian yang lain,” karena persahabatan dan saling mencintai di antara mereka di dunia bukan karena Allah, sehingga berubah menjadi permusuhan pada hari kiamat, “kecuali orang-orang yang bertakwa,” yang menjaga diri dari kesyirikan dan kemaksiatan, cinta mereka abadi dan menyatu dengan keabadian cinta karena Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 67: (Teman-teman akrab) dalam hal maksiat sewaktu di dunia (pada hari itu) pada hari kiamat itu lafal Yaumaidzin berta'alluq kepada firman selanjutnya (sebagian dari mereka menjadi musuh bagi sebagian yang lain kecuali orang-orang yang bertakwa) terkecuali orang-orang yang saling kasih mengasihi di dalam ketaatan kepada Allah swt., mereka itulah yang sebenarnya berteman, kemudian dikatakan kepada mereka yang bertakwa itu,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang bersahabat di atas kekafiran, mendustakan dan maksiat kepada Allah sewaktu di dunia. Hal itu, karena persahabatan mereka bukan karena Allah sehingga pada hari Kiamat berubah menjadi permusuhan. Yakni mereka yang menjauhi diri dari syrik dan maksiat, maka persahabatan mereka akan kekal dan terus-menerus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 67",
    "description": "Teman-teman karib pada hari kiamat itu sebagian mereka menjadi musuh bagi yang lainnya karena hubungan pertemanan mereka terjalin atas dasar kezaliman, tidak atas dasar kebaikan dan kemaslahatan, kecuali orang-orang yang bertakwa yang tidak saling bermusuhan karena pertemanan dan persahabatan mereka terjalin atas dasar ketaatan kepada Allah. 68. Allah telah menggambarkan dalam ayat-ayat yang lalu tentang keadaan bani israil yang memperoleh azab yang amat pedih di hari kiamat karena ke zaliman mereka. Selanjutnya, Allah menggambarkan ke nikmatan yang akan di peroleh oleh orang-orang saleh di dalam surga. 'wahai hamba-hamba-ku yang mengikuti jalan-ku yang lurus! tidak ada ketakutan bagimu pada hari kiamat itu dan tidak pula kamu bersedih hati dalam menghadapi keadaan apa pun pada hari itu."
  }
]