[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Dikatakan kepada orang-orang yang bertakwa, “Wahai hamba-hambaKu, tidak ada ketakutan atas kalian di hari ini dari azabKu, dan kalian juga tidak bersedih atas bagian-bagian yang tidak kalian dapatkan dari kenikmatan dunia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Dan Allah berfirman kepada mereka, “Wahai hamba-hamba-Ku! Tidak ada ketakutan bagi kalian pada Hari ini tentang apa yang akan kalian hadapi dan tidak pula kalian sedih atas harta benda dunia yang kalian tinggalkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. يٰعِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَآ أَنتُمْ تَحْزَنُونَ(Hai hamba-hamba-Ku, tiada kekhawatiran terhadapmu pada hari ini dan tidak pula kamu bersedih hati) Yakni akan dikatakan perkataan ini kepada orang-orang bertakwa yang saling mencintai karena Allah, sehingga kekhawatiran dan kesedihan mereka ketika itu akan hilang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Akan dikatakan kepada orang-orang yang bertakwa dan saling berteman karib karena Allah pada hari kiamat: “Wahai hamba-hamba-Ku, jangan kalian takut pada hiruk pikuk hari ini, juga jangan kalian bersedih atas apa yang telah hilang ketika di dunia.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Wahai hamba-hambaKu, tidak ada ketakutan bagi kalian pada hari ini dan tidak pula kalian bersedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. selanjutnya Allah menyebutkan pahala orang-oang yang bertakwa. Pada hari kiamat Allah akan memanggil mereka dengan panggilan yang membuat hati mereka senang dan menghilangkan semua bencana dan keburukan seraya berfiman,”hai hamba-hambaku, tiada kekhawatiran terhadapmu pada hari ini dan tidak pula kamu besedih hati,” maksudnya, tidak ada ketakutan yang akan mendatangi kalian dari berbagai hal yang kalian hadapi dan tidak ada kesedihan yang akan menimpa kalian karena sesuatu yang telah berlalu. Manakala segala yang ditakuti dari bebagai hal tidak ada, yang ada adalah apa-apa yang disenangi dan diharapkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 68: (\"Hai hamba-hamba-Ku, tiada kekuatiran terhadap kalian pada hari ini dan tidak pula kalian bersedih hati.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan pahala orang-orang yang bertakwa, dan bahwa Allah akan memanggil mereka pada hari Kiamat dengan sesuatu yang membuat senang hati mereka dan ketika itu hilang segala musibah dan penderitaan. Yakni tidak ada kekhawatiran yang akan menimpamu di masa mendatang dan tidak pula kamu bersedih hati terhadap hal yang telah berlalu bagimu. Jika sesuatu yang tidak diinginkan sudah hilang dari berbagai sisi, maka yang ada adalah hal yang diinginkan dan diharapkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 68",
    "description": "Allah telah menggambarkan dalam ayat-ayat yang lalu tentang keadaan bani israil yang memperoleh azab yang amat pedih di hari kiamat karena ke zaliman mereka. Selanjutnya, Allah menggambarkan ke nikmatan yang akan di peroleh oleh orang-orang saleh di dalam surga. 'wahai hamba-hamba-ku yang mengikuti jalan-ku yang lurus! tidak ada ketakutan bagimu pada hari kiamat itu dan tidak pula kamu bersedih hati dalam menghadapi keadaan apa pun pada hari itu. 69. Orang-orang yang tidak takut dan tidak bersedih hati itu ialah orang-orang yang beriman kepada ayat-ayat kami yang tertulis yang dibawa oleh para rasul utusan kami serta yang terhampar di alam ini, dan mereka berserah diri dengan sepenuhnya kepada Allah dengan melaksanakan ajaran-ajaran-Nya."
  }
]