[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70. Orang-orang yang beriman kepada ayat-ayat Kami dan mengamalkan apa-apa yang datang kepada mereka, mereka tunduk kepada Allah, Tuhan semesta alam dengan hati dan anggota badan mereka. Dikatakan kepada mereka, “Masuklah kalian bersama rekan-rekan kalian yang beriman ke dalam surga, kalian diberi nikmat didalamnya dan gembira.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Orang-orang yang membenarkan Al-Qur`ān yang diturunkan kepada Rasul mereka dan mereka mematuhi Al-Qur`ān, menjalankan perintah-perintahnya dan menajuhi larangan-larangannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. الَّذِينَ ءَامَنُوا۟ بِـَٔايٰتِنَا وَكَانُوا۟ مُسْلِمِينَ ((Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan adalah mereka dahulu orang-orang yang berserah diri) Firman Allah (يا عبادي....) bukanlah bagi semua hamba-hamba Allah, namun hanya bagi orang-orang beriman dan beragama Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Wahai kalian para hamba-Ku, kalian telah beriman dan membenarkan ayat-ayat Kami yaitu Alquran. Kalian semua adalah orang-orang yang berserah diri, taat pada jalan Allah, ikhlas dan patuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan mereka adalah orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. “(yaitu) orang-orang yang beriman kepada ayat-ayat kami dan mereka dahulu adalah orang-orang yang berserah diri,” artinya Allah menyifati meeka sebagai orang-orang yang berriman dengan ayat-ayat Allah dan hal itu mencakup pembenaran terhadap ayat tersebut serta segala sesuatu yang mana pembenaran tidak akan berat kecuali dengannya seperti mengetahui maknanya dan mengamalkan tuntutannya. Mereka adalah orang-orang yang menyerahkan diri kepada Allah,tunduk kepadaNya di berbagai kondisi mereka. Mereka menyatukan sifat antara praktik lahir dan batin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 69: (Yaitu orang-orang yang beriman) lafal ayat ini menjadi Na'at atau sifat bagi lafal 'Ibaadi' pada ayat di atas (kepada ayatayat Kami) yakni Alquran (dan adalah mereka dahulu orang-orang yang berserah diri.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sifat mereka beriman kepada ayat-ayat Allah, hal ini tentu mencakup membenarkannya, dan melakukan sesuatu yang dengannya pembenaran menjadi sempurna, yaitu mengetahui maknanya dan mengamalkan konsekwensinya. Kepada Allah dan tunduk kepada-Nya dalam semua keadaan mereka. Oleh karena itu, mereka menggabung antara mengerjakan amalan zhahir (berserah diri dan tunduk) maupun batin (beriman)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 69",
    "description": "Orang-orang yang tidak takut dan tidak bersedih hati itu ialah orang-orang yang beriman kepada ayat-ayat kami yang tertulis yang dibawa oleh para rasul utusan kami serta yang terhampar di alam ini, dan mereka berserah diri dengan sepenuhnya kepada Allah dengan melaksanakan ajaran-ajaran-Nya. 70. Di hari kiamat kelak kami akan memerintahkan mereka, \"masuklah kamu semua ke dalam surga, kamu dan pasangan-pasanganmu, yaitu suami atau istrimu yang berserah diri kepada Allah dengan sepenuhnya itu akan selalu di gembirakan dengan segala pelayanan dan ke nikmatan surga yang sangat menyenangkan. '."
  }
]