[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "69-70. Orang-orang yang beriman kepada ayat-ayat Kami dan mengamalkan apa-apa yang datang kepada mereka, mereka tunduk kepada Allah, Tuhan semesta alam dengan hati dan anggota badan mereka. Dikatakan kepada mereka, “Masuklah kalian bersama rekan-rekan kalian yang beriman ke dalam surga, kalian diberi nikmat didalamnya dan gembira.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Masuklah ke dalam Surga, kalian dan orang-orang yang semisal dengan kalian dalam keimanan, bergembira dengan kenikmatan abadi yang kalian temui, tidak habis dan tidak terputus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. ادْخُلُوا۟ الْجَنَّةَ أَنتُمْ وَأَزْوٰجُكُمْ (Masuklah kamu ke dalam surga, kamu dan isteri-isteri kamu) Yang dimaksud dengan (الأزواج) yakni istri-istri mereka di dunia. Pendapat lain mengatakan bahwa yang dimaksud adalah teman-teman mereka yang beriman. Dan pendapat lain mengatakan yang dimaksud adalah istri-istri mereka dari golongan bidadari. تُحْبَرُونَ(digembirakan) Yakni dimuliakan dan diberi kenikmatan. Pendapat lain mengatakan yang dimaksud adalah mereka digembirakan dengan nyanyian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Dikatakan kepada mereka juga: “Masukklah kalian semua ke dalam surga beserta para istri kalian yang beriman. Kalian akan dibuat senang, dimulyakan dan diberi kenikmatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masuklah ke dalam surga, kalian dan pasangan kalian dalam keadaan dibahagiakan”} diberi kenikmatan dan dibahagiakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. “masuklah kamu ke dalam surga,” yang merupakan tempat keabadian, “kamu dan istri-istri kamu,”yaitu orang yang memiliki amal sepertimu dari semua orang yang menyertaimu seperti anak, istri, teman, dan lainnya, di amna kalian “digembirakan,” yakni, diberi nikmat dan dimuliakan, dan berbagai kebaikan dan kaunia Allah mendatangi kalian,kegembiraan, kebahagiaan, kelezatan, dan segala sesuatu yang tidak bisa diungkapkan dengan kata-kata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 70: (Masuklah kalian ke dalam surga, kalian) lafal Antum berkedudukan menjadi Mubtada (dan pasangan-pasangan kalian) yakni istri-istri kalian (digembirakan) dibahagiakan dan dimuliakan, lafal Tuhbaruuna menjadi Khabar dari Mubtada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang merupakan tempat menetap. Yang seperti amalmu; baik istri, anak, kawan, maupun lainnya. Yakni akan diberi nikmat dan akan dimuliakan, dan karunia Tuhanmu akan datang kepadamu baik berupa kebaikan, kesenangan maupun kenikmatan yang tidak dapat diuraikan oleh lisan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 70",
    "description": "Di hari kiamat kelak kami akan memerintahkan mereka, \"masuklah kamu semua ke dalam surga, kamu dan pasangan-pasanganmu, yaitu suami atau istrimu yang berserah diri kepada Allah dengan sepenuhnya itu akan selalu di gembirakan dengan segala pelayanan dan ke nikmatan surga yang sangat menyenangkan. '71. Di dalam surga nanti kepada mereka yang beriman dan bertakwa itu diedarkan piring-piring dari emas yang berisi aneka macam makanan yang lezat dan juga gelas-gelas minum yang berisi aneka macam minuman yang lezat, dan di dalamnya, yakni di dalam surga itu terdapat apa saja yang di ingini oleh hati dan segala yang sedap di pandang mata. Dan kamu sekalian, wahai orang-orang yang bertakwa dan menyerahkan diri sepenuhnya kepada Allah, akan menjadi orang-orang yang kekal di dalamnya."
  }
]