[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di surga orang-orang yang beriman kepada Allah dan para utusanNya itu dikelilingi oleh makanan dalam nampan-nampan emas, minuman dalam gelas-gelas emas, di sana mereka mendapatkan apa yang diinginkan oleh jiwa mereka dan dinikmati oleh pandangan mata mereka, mereka tinggal di sana selama-lamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Para pelayan berkeliling mengedarkan piring-piring emas dan gelas-gelas yang tidak ada pegangannya dan di Surga itu terdapat apa yang dinginkan hati dan yang menyedapkan mata bila memandangnya, dan kalian bertempat tinggal di dalamnya, tidak akan keluar darinya selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. يُطَافُ عَلَيْهِم بِصِحَافٍ مِّن ذَهَبٍ (Diedarkan kepada mereka piring-piring dari emas) Yakni di surga mereka mendapat makanan-makanan yang diedarkan dalam nampan-nampan emas. وَأَكْوَابٍ ۖ( dan piala-piala) Yakni mereka juga mendapat minuman-minuman yang diedarkan kepada mereka dalam gelas-gelas yang terbuat dari emas. وَفِيهَا مَا تَشْتَهِيهِ الْأَنفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ( dan di dalam surga itu terdapat segala apa yang diingini oleh hati dan sedap (dipandang) mata) Berupa makanan dan minuman dengan berbagai jenisnya yang disenangi hati, dan kenikmatan-kenikmatan dan pemandangan yang memanjakan masa. وَأَنتُمْ فِيهَا خٰلِدُونَ(dan kamu kekal di dalamnya”) Mereka tidak akan mati atau dikeluarkan dari surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Mereka dikelilingi oleh berbagai makanan pada mangkuk-mangkuk dan juga minuman-minuman berwadahkan gelas emas. Di surga, apapun yang kalian kehendaki maka akan kalian dapatkan. Semua mata akan merasakan kenikmatan ketika melihat itu semua. Melihat berbagai macam makanan dan minuman. Kalian kekal selamanya di surga dan tidak akan pernah keluar atau dikeluarkan darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Diedarkan kepada mereka piring-piring} piring-piring {dan gelas-gelas dari emas. Dan di dalamnya terdapat apa yang diinginkan oleh hati dan dipandang sedap oleh mata. Dan kalian kekal di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. “diedarkan kepada mereka piring-piring dari emas, dan piala-piala,” maksudnya, para pelayan mengelilingi mereka dari kalangan anak-anak kecil yang kekal dengan membawa berbagai makanan dengan bejana tebaik dan termewah, yaitu piing-piring yang terbuat dari emas dan minuman dengan gelas yang paling halus, yaitu gelas yang tidak ada pegangannya yang merupakan gelas terbening terrbuat dari perak yang jauh lebih bening dari mutiara.”dan di dalam surga itu terdapat segala apa yang diingini oleh hati dan sedap (dipandang mata),” ini adalah kalimat yang menyeluruh yang mencakup segala kenikmatan, kebahagiaan, ketentraman mata dan hati. Semua yang diinginkan oleh jiwa berupa makanan, minuman, pakaian, pasangan, kenikmatan mata seperti pemandangan indah, pohon, kebun, kenikmatan indah yang berhias dan lainnya terdapat di dalam surga yang disiapkan untuk penghuninya dalam bentuk yang paling sempurna dan utama. Seperti yang disebutkan dalam firman Allah,”bagi mereka di dalamnya buah-buahan dan bagi mereka apa-apa yang disiapkan.” (yasin:57) dan kamu kekal didalamnya,” inilah kesempurrnaan nikmat penghuni surga yaitu kekal selamanya di dalam surga yang mencakup kekekalan dan bertambahnya nikmat dan tidak terputus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 71: (Diedarkan kepada mereka piring-piring) yang besar-besar (dari emas, gelas-gelas) tempat untuk minum yang tidak ada pengikatnya hingga si peminum dapat meminum dari sebelah mana saja; lafal Akwaabun adalah bentuk jamak dari lafal Kuubun (dan di dalam surga itu terdapat segala apa yang diingini oleh hati) untuk dinikmati kelezatannya (dan sedap dipandang mata) artinya, sangat menyejukkan bila dipandang (dan kalian kekal di dalamnya.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pelayan mereka yang terdiri dari anak muda yang tetap muda mengedarkan makanan dan minuman kepada mereka dengan piring dan gelas yang paling baik, yaitu piring dan gelas emas. Semua yang diinginkan oleh hati, seperti makanan, minuman, menggauli istri, dan yang sedap dipandang mata seperti pemandangan yang indah, pohon-pohon yang lebat, kesenangan yang mengagumkan ada bagi mereka dengan keadaan yang paling sempurna dan paling utama. Inilah pelengkap kenikmatan surga, yaitu kekal selamanya di sana, dimana di dalamnya mengandung tetapnya nikmat itu dan bertambah serta tidak pernah putus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 71",
    "description": "Di dalam surga nanti kepada mereka yang beriman dan bertakwa itu diedarkan piring-piring dari emas yang berisi aneka macam makanan yang lezat dan juga gelas-gelas minum yang berisi aneka macam minuman yang lezat, dan di dalamnya, yakni di dalam surga itu terdapat apa saja yang di ingini oleh hati dan segala yang sedap di pandang mata. Dan kamu sekalian, wahai orang-orang yang bertakwa dan menyerahkan diri sepenuhnya kepada Allah, akan menjadi orang-orang yang kekal di dalamnya. 72. Dan itulah surga dengan segala ke nikmatan yang kamu dapatkan di dalamnya yang di wariskan atau di anugerahkan kepada kamu di sebabkan karena amal-amal perbuatan baik yang senantiasa telah kamu kerjakan sewaktu kamu berada di dunia dahulu."
  }
]