[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Di surga kalian mendapatkan buah-buahan yang bermacam-macam, dan dari setiap macamnya kalian makan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Bagi kalian buah-buahan yang banyak, tidak pernah berhenti, darinya kalian makan.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Berbagai macam buah-buahan ini juga diperuntukkan bagi kalian, makanlah segala yang kalian sukai tanpa kepayahan karena kekelannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi kalian di dalamnya buah-buahan yang banyak yang sebagiannya kalian makan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. “didalam surga itu ada buah-buahan yang banyak,” sebagaimana dalam ayat lain,” di dalam kedua suga itu ada aneka buah-buahan yang berpasang-pasangan,” (ar-rahman:52) “yang sebagiannya kamu makan,” yaitu, buah-buahan nikmat dan buah lezat yang kalian pilih untuk dimakan. Ketika Allah menyebutkan kenikmatan surga, selanjutnya Allah menyebutkan siksa jahanam"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 73: (Di dalam surga itu ada buah-buahan yang banyak untuk kalian yang sebagiannya) sebagian daripadanya (kalian makan) dan setiap apa yang telah dimakan secara langsung mendapat penggantinya yang baru."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu buah yang kamu pilih di antara sekian buah yang enak itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 73",
    "description": "Di dalam surga itu terdapat banyak buah-buahan yang lezat rasanya dan beraneka macam rupanya. Semua itu di siapkan untukmu, namun hanya sebagiannya yang dapat kamu makan karena begitu banyaknya sehingga kamu tidak mampu menghabiskannya. 74. Apa yang telah di sebutkan pada ayat-ayat sebelumnya merupakan balasan bagi orang-orang yang beriman, bertakwa, dan menyerahkan diri secara tulus kepada Allah. Sebaliknya, pada ayat-ayat berikut digambarkan balasan bagi orang-orang yang berdosa. Sungguh, orang-orang yang berdosa itu, yakni yang melanggar aturan-aturan Allah, kekal di dalam azab neraka jahanam sebagai balasan atas amal jahat yang mereka lakukan."
  }
]