[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "74-76. Sesungguhnya orang-orang yang mengerjakan dosa-dosa disebabkan kekafiran mereka, mereka berada di dalam siksa Jahanam, mereka kekal di dalamnya, azab tidak diringankan dari mereka, mereka pun berputus asa dari rahmat Allah. Kami tidak menzhalimi para penjahat tersebut dengan menyiksa mereka, sebaliknya justru merekalah yang menzhalimi diri mereka dengan kesyirikan dan pengingkaran mereka bahwa Allah adalah satu-satunya Tuhan yang berhak disembah, tidak ada sekutu bagiNya, di samping karena mereka menolak untuk mengikuti rasul-rasul Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Sesungguhnya orang-orang yang berbuat dosa dengan melakukan kekufuran dan maksiat berada dalam siksa neraka Jahanam pada hari Kiamat, mereka tinggal di dalamnya selamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74-76. Orang-orang yang melakukan kejahatan dan dosa-dosa besar akan berada dalam azab neraka Jahannam, azab itu tidak akan diringankan bagi mereka meski hanya sebentar saja, sehingga mereka merasa putus asa dari rahmat Allah. Kami tidak menzalimi mereka dengan azab ini, akan tetapi mereka yang menzalimi diri sendiri dengan melakukan kekafiran dan perbuatan-perbuatan buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Sungguh orang-orang yang kafir kepada Allah mereka akan kekal dalam neraka Jahannam, tidak akan diizinkan keluar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang durhaka itu kekal di dalam azab neraka Jahanam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. ”sesungguhnya orang-orang yang berdosa,” yakni, orang-orang yang berdosa karena kekufuran dan pendustaan mereka, “kekal di dalam azab neraka jahanam,”mereka diliputi oleh azab dari berbagai sisi dan mereka tidak bisa keluar dari neraka jahanam itu selama-lamanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 74: (Sesungguhnya orang-orang yang berdosa kekal di dalam azab neraka Jahanam.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan kenikmatan di surga, maka Dia melanjutnya dengan menyebutkan azab di neraka Jahanam. Karena kekafiran dan pendustaan mereka. Azab meliputi mereka dari berbagai sisi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 74",
    "description": "Apa yang telah di sebutkan pada ayat-ayat sebelumnya merupakan balasan bagi orang-orang yang beriman, bertakwa, dan menyerahkan diri secara tulus kepada Allah. Sebaliknya, pada ayat-ayat berikut digambarkan balasan bagi orang-orang yang berdosa. Sungguh, orang-orang yang berdosa itu, yakni yang melanggar aturan-aturan Allah, kekal di dalam azab neraka jahanam sebagai balasan atas amal jahat yang mereka lakukan. 75. Azab neraka yang di timpakan kepada mereka itu tidak akan di ringankan dan di kurangi sedikit pun dari mereka. Karena azab dan siksa yang diterimanya itu, mereka selamanya berputus asa di dalamnya karena mereka tidak dapat melepaskan diri dari siksaan itu."
  }
]