[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "74-76. Sesungguhnya orang-orang yang mengerjakan dosa-dosa disebabkan kekafiran mereka, mereka berada di dalam siksa Jahanam, mereka kekal di dalamnya, azab tidak diringankan dari mereka, mereka pun berputus asa dari rahmat Allah. Kami tidak menzhalimi para penjahat tersebut dengan menyiksa mereka, sebaliknya justru merekalah yang menzhalimi diri mereka dengan kesyirikan dan pengingkaran mereka bahwa Allah adalah satu-satunya Tuhan yang berhak disembah, tidak ada sekutu bagiNya, di samping karena mereka menolak untuk mengikuti rasul-rasul Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Siksa atas mereka tidak diringankan, dan mereka di dalamnya putus asa dari rahmat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. لَا يُفَتَّرُ عَنْهُمْ (Tidak diringankan azab itu dari mereka) Yakni azab mereka sama sekali tidak diringankan meski hanya sejenak untuk beristirahat. وَهُمْ فِيهِ مُبْلِسُونَ(dan mereka di dalamnya berputus asa) Yakni putus asa dari harapan mendapat keselamatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Tidak ada keringanan azab bagi mereka, mereka putus asa dari pembebasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak diringankan} tidak diringankan {dari mereka dan di dalamnya mereka berputus asa} mereka berputus asa dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “tidak diringankan azab itu dari mereka,” barang sebentar pun, tidak dihilangkan dan tidak pula diringankan,”dan mereka didalamnya berputus asa,” yaitu berputus asa dari berbagai kebaikan, tidak mengharapkan terlepas karena mereka berkata seraya menyeru Rabb mereka, “ ya Rabb kami keluarkanlah kami darinya (dan kembalikanlah kami ke dunia), maka jika kami kembali (juga pada kekafiran), sesungguhnya kami adalah orang-orang yang zhalim,” Allah berfirman, ”tinggalah dengan hina di dalamnya, dan janganlah kamu berbicara dengan aku,” (al-mu’minin:107-108)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 75: (Tidak dihenti-hentikan) maksudnya, tidak diringankan (azab itu dari mereka sedangkan mereka di dalamnya berputus asa) yakni dalam keadaan diam berputus asa"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak dikurangi apalagi dihilangkan. Mereka berputus asa dari semua kebaikan dan tidak mengharapkan lagi jalan keluar. Hal itu adalah karena mereka menyeru Tuhan mereka dengan mengatakan, “Ya Tuhan Kami, keluarkanlah kami daripadanya (dan kembalikanlah kami ke dunia), maka jika kami kembali (juga kepada kekafiran), sesungguhnya kami adalah orang-orang yang zalim.\"--Allah berfirman, \"Tinggallah dengan hina di dalamnya, dan janganlah kamu berbicara dengan Aku.” (Terj. Al Mu’minuun: 107-108) Azab yang pedih ini disebabkan perbuatan mereka dan karena mereka menzalimi diri mereka sendiri, dan Allah tidaklah menzalimi mereka; Dia tidak menghukum mereka tanpa dosa sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 75",
    "description": "Azab neraka yang di timpakan kepada mereka itu tidak akan di ringankan dan di kurangi sedikit pun dari mereka. Karena azab dan siksa yang diterimanya itu, mereka selamanya berputus asa di dalamnya karena mereka tidak dapat melepaskan diri dari siksaan itu. 76. Dan dengan siksaan yang mereka dapatkan itu, tidaklah kami menzalimi atau menganiaya mereka sedikit pun, tetapi merekalah yang menzalimi diri mereka sendiri sehingga mereka mendapatkan azab itu."
  }
]