[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "74-76. Sesungguhnya orang-orang yang mengerjakan dosa-dosa disebabkan kekafiran mereka, mereka berada di dalam siksa Jahanam, mereka kekal di dalamnya, azab tidak diringankan dari mereka, mereka pun berputus asa dari rahmat Allah. Kami tidak menzhalimi para penjahat tersebut dengan menyiksa mereka, sebaliknya justru merekalah yang menzhalimi diri mereka dengan kesyirikan dan pengingkaran mereka bahwa Allah adalah satu-satunya Tuhan yang berhak disembah, tidak ada sekutu bagiNya, di samping karena mereka menolak untuk mengikuti rasul-rasul Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Kami tidak menganiaya mereka saat memasukkan mereka ke dalam neraka, akan tetapi mereka sendiri yang menganiaya diri mereka dengan melakukan kekufuran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Kami sama sekali tidak mendholimi mereka sedikitpun, Kami tidak akan menyiksa mereka kecuali sebab perbuatan dosa mereka. Kami tidak akan pernah menambahkan siksa kecuali apa yang hanya menjadi bagiannya. Mereka sendirilah yang berbuat dholim pada diri mereka sendiri dengan kekufuran dan kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak menzalimi mereka, tetapi mereka adalah orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. siksaan besar ini disebabkan oleh perbuatan yang mereka lakukan dan karena kezhaliman mereka terhadap diri sendiri. Allah tidak menzhalimi dan tidak menyiksa mereka tanpa dosa dan kesalahan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 76: (Dan tidaklah Kami menganiaya mereka tetapi merekalah yang menganiaya diri mereka sendiri.)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 76",
    "description": "Dan dengan siksaan yang mereka dapatkan itu, tidaklah kami menzalimi atau menganiaya mereka sedikit pun, tetapi merekalah yang menzalimi diri mereka sendiri sehingga mereka mendapatkan azab itu. 77. Dan ketika para pendosa itu mendapatkan siksaan yang amat pedih di dalam neraka, mereka berseru kepada malaikat malik yang memimpin penjaga neraka dengan berkata, 'wahai malaikat malik! biarlah tuhanmu, yaitu dengan memohon kepada-Nya agar dia mematikan kami saja karena kalau kami sudah di matikan, kami tidak akan merasakan lagi siksaan yang amat pedih ini. ' dia, yakni malaikat malik, menjawab, 'sungguh, kamu tidak akan dimatikan oleh Allah, dan kamu akan tetap tinggal di neraka ini untuk merasakan siksaan yang amat pedih ini. '."
  }
]