[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-78. Para penjahat itu memanggil-manggil Malik, penjaga Jahanam setelah mereka dimasukkan ke dalam neraka oleh Allah, “Wahai Malik, biarlah Tuhanmu mematikan kami, sehingga kami bisa beristirahat dari penderitaan ini.” Maka Malik menjawab, “Kalian tetap tinggal, kalian tidak akan keluar darinya, kalian tidak bisa menghindar darinya.” Sungguh Kami telah datang kepada kalian dengan kebenaran dan menjelaskannya untuk kalian, akan tetapi kebanyakan dari kalian membenci kebenaran yang dibawa oleh para rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Mereka memanggil Mālik, malaikat penjaga meraka, sambil berkata, “Wahai Mālik! Hendaknya Rabbmu mematikan kami agar kami bisa istirahat dari siksaan.” Maka Mālik menjawab mereka dengan berkata, “Sesungguhnya kalian tinggal di dalam siksa selamanya, kalian tidak akan mati dan siksaan tidak akan berhenti dari kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Para penghuni neraka yang telah putus asa itu berkata kepada menjaga neraka yang bernama Malik, untuk meminta kepadanya agar Allah mencabut nyawa mereka sehigga mereka dapat terlepas dari azab itu. Maka malaikat Malik menjawab: “Kalian akan tinggal dalam azab ini selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَنَادَوْا۟ يٰمٰلِكُ (Mereka berseru: “Hai Malik) Yakni orang-orang berdosa berseru dengan seruan ini. Malik merupakan malaikat yang menjaga neraka. لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ( biarlah Tuhanmu membunuh kami saja”) Mereka menjadikan Malik sebagai perantara antara mereka dengan Allah, agar dia dapat meminta bagi mereka untuk dimatikan agar mereka dapat terbebas dari azab. قَالَ إِنَّكُم مّٰكِثُونَ (Dia menjawab: “Kamu akan tetap tinggal (di neraka ini)”) Yakni tetap tinggal di neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Setelah putus asa dari harapan peringanan siksa, orang-orang yang telah banyak melakukan dosa itu berkoar: “Wahai malaikat Malik penjaga neraka, mintakan kepada Tuhanmu untuk mematikan kami saja. Mintakan kematian untuk kami kepada Tuhanmu, agar kami bisa istirahat dari siksa ini. Itulah yang kami.” harapkan dari Allah. Maka Malik menjawab: “Kalian akan disiksa di sini selama-lamanya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menyeru,“Wahai malaikat Malik} wahai malaikat Malik penjaga neraka {hendaklah Tuhanmu mematikan kami”} hendaklah mematikan kami {Dia menjawab,“Sesungguhnya kalian akan tetap tinggal} menetap dalam azab itu selamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. “mereka berseru,” ketika berada di neraka itu dengan harapan agar dapat istirahat, ”hai malik, biarlah Rabbmu membunuhi kami saja,” yaitu, hendaklah Dia mematikan kami agar kami lega, karena kami berada dalam kesedihan luar biasa dan siksaan yang berat yang tidak bisa ditanggung dengan sabar. “Dia menjawab,” yakni malaikat penjaga neraka,ketika mereka memintanya untuk berdoa kepada Allah untuk mereka agar mereka dimatikan saja, “kamu akan tetap tinggal (di neraka ini).” Artinya, tetap berada di dalamnya dan tidak akan keluar selamanya dan mereka tidak mendapatkan apa yang mereka inginkan, tapi malaikat penjaga neraka menjawab dengan membalikkan keinginan mereka. Malaikat semakin membuat mereka berduka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 77: (Mereka berseru, \"Hai Malik!) dia adalah malaikat penjaga neraka (Biarlah Rabbmu membunuh kami saja\") maksudnya, mematikan kami. (Dia menjawab) seruan mereka setelah seribu tahun kemudian, (\"Kalian akan tetap tinggal\") di dalam azab yang abadi untuk selama-lamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika berada dalam neraka dengan harapan mereka dapat beristirahat. Malik adalah Malaikat penjaga neraka. Yakni agar kami dapat beristirahat, karena kami dalam kesedihan yang sangat dan azab yang keras, kami tidak sanggup bersabar terhadapnya. Dengan jawaban yang tidak sesuai dengan yang mereka minta dan membuat mereka bertambah sedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 77",
    "description": "Dan ketika para pendosa itu mendapatkan siksaan yang amat pedih di dalam neraka, mereka berseru kepada malaikat malik yang memimpin penjaga neraka dengan berkata, 'wahai malaikat malik! biarlah tuhanmu, yaitu dengan memohon kepada-Nya agar dia mematikan kami saja karena kalau kami sudah di matikan, kami tidak akan merasakan lagi siksaan yang amat pedih ini. ' dia, yakni malaikat malik, menjawab, 'sungguh, kamu tidak akan dimatikan oleh Allah, dan kamu akan tetap tinggal di neraka ini untuk merasakan siksaan yang amat pedih ini. '78. Ayat-ayat yang lalu menggambarkan siksaan yang amat pedih yang di rasakan di dalam neraka oleh orang-orang yang kafir terhadap wahyu-wahyu Allah. Ayat berikut menggambarkan pengingkaran orang-orang mekah terhadap kebenaran yang dibawa oleh rasulullah. Allah berfirman, 'sesungguhnya kami melalui rasul yang telah kami utus dan wahyu-wahyu yang kami turunkan benar-benar telah membawa kebenaran yang amat sempurna kepada kamu yang bersumber dari kami, tetapi kebanyakan di antara kamu benar-benar benci pada kebenaran itu sehingga kamu tidak mau mempercayainya."
  }
]