[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "77-78. Para penjahat itu memanggil-manggil Malik, penjaga Jahanam setelah mereka dimasukkan ke dalam neraka oleh Allah, “Wahai Malik, biarlah Tuhanmu mematikan kami, sehingga kami bisa beristirahat dari penderitaan ini.” Maka Malik menjawab, “Kalian tetap tinggal, kalian tidak akan keluar darinya, kalian tidak bisa menghindar darinya.” Sungguh Kami telah datang kepada kalian dengan kebenaran dan menjelaskannya untuk kalian, akan tetapi kebanyakan dari kalian membenci kebenaran yang dibawa oleh para rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Sungguh telah kami datangkan kepada mereka di dunia kebenaran yang tidak ada keraguan padanya, akan tetapi sebagian besar dari kalian benci terhadap kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Sungguh Kami telah mendatangkan kebenaran kepada kalian melalui para rasul, akan tetapi kebanyakan dari kalian membenci kebenaran itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. لَقَدْ جِئْنٰكُم بِالْحَقِّ (Sesungguhnya Kami benar-benar telah memhawa kebenaran kepada kamu) Yakni Kami telah menutus kepada kalian beberapa rasul, dan Kami juga telah menurunkan bersama mereka kitab-kitab, kemudian mereka menyeru kepada kalian, namun kalian tidak menerima dan mempercayai mereka. وَلٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كٰرِهُونَ (tetapi kebanyakan di antara kamu benci pada kebenaran itu) Yakni tidak menerimanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Allah berkata: “Kami telah mendatangkan kepada kalian dan lainnya wahai orang-orang yang mengingkari kebenaran tentang datangnya hari kebangkitan dan hari perhitungan melalui lisan rasul Kami. Kami juga telah menurunkan Alquran dan kitab-kitab terdahulu, namun kebanyakan kalian tetap mengingkari kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar telah datang kepada kalian dengan kebenaran, tetapi kebanyakan kalian membenci kebenaran itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. selanjutnya Allah mencela mereka atas perbuatan yang mereka lakukan seraya berfirman, ”sesungguhnya kami benar-benar telah membawa kebenaran kepada kamu,” yang wajib kalian ikuti. Andai kalian mengikutinya, pasti kalian beruntung dan berbahagia, “tetapi kebanyakan di antara kamu benci kepada kebenaran itu,” karena itu kalian amat sengsara, yang tidak ada lagi kebahagiaan setelahnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 78: Allah swt. berfirman: (Sesungguhnya Kami benar-benar telah membawa kepada kalian) hai penduduk Mekah (kebenaran) melalui lisan rasul (tetapi kebanyakan di antara kalian benci pada kebenaran itu.)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya mereka dicela lagi. Melalui lisan para rasul. Oleh karena itu kamu mendapatkan kesengsaraan yang tidak ada lagi kebahagiaan setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 78",
    "description": "Ayat-ayat yang lalu menggambarkan siksaan yang amat pedih yang di rasakan di dalam neraka oleh orang-orang yang kafir terhadap wahyu-wahyu Allah. Ayat berikut menggambarkan pengingkaran orang-orang mekah terhadap kebenaran yang dibawa oleh rasulullah. Allah berfirman, 'sesungguhnya kami melalui rasul yang telah kami utus dan wahyu-wahyu yang kami turunkan benar-benar telah membawa kebenaran yang amat sempurna kepada kamu yang bersumber dari kami, tetapi kebanyakan di antara kamu benar-benar benci pada kebenaran itu sehingga kamu tidak mau mempercayainya. 79. Penduduk mekah itu sebenarnya tidak hanya membenci kebenaran yang di bawa oleh rasul kami itu, tetapi bahkan mereka telah merencanakan dengan mantap suatu tipu daya jahat untuk membendung dan menghalangi penyebaran ajaran islam, menganiaya para pembela agama itu, dan bahkan merencanakan pembunuhan terhadap rasul kami. Apa yang mereka rencanakan itu tidak akan kami biarkan, maka untuk itu sesungguhnya kami telah berencana dengan sangat baik dan rapi untuk mengalahkan dan mengatasi semua tipu daya mereka. '."
  }
]