[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebaliknya apakah orang-orang musyrik itu malah menyusun sebuah rencana untuk melawan kebenaran yang Kami bawa kepada mereka? Sesungguhnya Kami juga merencanakan sesuatu untuk mereka yang menghinakan mereka berupa azab dan siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Jika mereka melakukan tipu daya terhadap Nabi -ṣallallāhu 'alaihi wa sallam- dan menyiapkan untuknya tipu muslihat yang jahat, maka Kami pasti membuat perencanaan yang mengungguli tipu muslihat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79-80. Allah membongkar tipu daya orang-orang kafir: “Apakah mereka menyusun tipu daya terhadap Nabi Muhammad dengan rapi? Sungguh Kami juga menyusun ketetapan Kami bagi mereka dengan kehancuran dan kebinasaan. Atau mereka mengira Kami tidak mendengar apa yang mereka rahasiakan dalam hati mereka dan yang mereka saling bisikkan? Sungguh Kami mendengar dan mengetahui hal itu; dan para malaikat Kami mencatat segala perbuatan mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. لَقَدْ جِئْنٰكُم بِالْحَقِّ (Sesungguhnya Kami benar-benar telah memhawa kebenaran kepada kamu) Yakni Kami telah menutus kepada kalian beberapa rasul, dan Kami juga telah menurunkan bersama mereka kitab-kitab, kemudian mereka menyeru kepada kalian, namun kalian tidak menerima dan mempercayai mereka. وَلٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كٰرِهُونَ (tetapi kebanyakan di antara kamu benci pada kebenaran itu) Yakni tidak menerimanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Atau bahkan mereka merencanakan suatu tipu daya untuk rasul SAW dan berniat membunuhnya supaya tidak bisa melanjutkan dakwahnya? Sesungguhnya Kami telah mebuat rencana untuk mengatasi tipu daya mereka dengan membinasakan dan membalas mereka. Muqatil berkata: ayat ini turun untuk orang-orang yang membuat tipu daya dalam menghalangi dakwah Nabi SAW. Juga untuk mengingkari kitab-kitab terdahulu yang telah lebih dulu memberi perintah kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah mereka telah merencanakan suatu tipu daya } bahkan mereka menyusun tipu daya untuk nabi Muhammad SAW {Sesungguhnya Kami jug telah berencana} menyusun tipu daya untuk melawan mereka yaitu dengan siksaan dan azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Allah berfirman, ”bahkan mereka telah menetapkan,” maksudnya, orang-orang yang mendustakan kebenaran dan menentangnya menetapkan, “satu tipu daya (jahat),” yaitu mereka merencanakan makar jahat terhadap kebenaran dan orang yang membawanya, agar mereka bisa menangkalnya dengan kebatilan yang hiasi.”maka sesungguhnya kami akan membalas tipu daya mereka,” artinya, menetapkan suatu urusan dan merencanakan sesuatu yang mengalahkan rencana mereka serta membatalkannya. Itulah sebab-sebab dan dalil-dalil yang ditetapkan oleh Allah untuk membatalkannya. Itulah sebab-sebab dan dalil-dalil yang ditetapkan oleh Allah untuk membatalkan kebatilan, sebagaimana yang difirmankanNya,”sebenarnya kami melontarkan yang haq kepada yang batil lalu yang haq itu menghancurkannya.” (al-anbiya:18)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 79: (Bahkan mereka telah menetapkan) yaitu orang-orang kafir Mekah telah memutuskan (suatu tipu daya) kejahatan untuk mencelakakan Nabi Muhammad (maka sesungguhnya Kami menetapkan pula) keputusan Kami untuk membuat tipu muslihat guna membinasakan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, kaum musyrikin Mekah bukan saja benci kepada kebenaran, bahkan mereka juga telah merencanakan hendak membunuh Nabi Muhammad shallallahu 'alaihi wa sallam tetapi rencana itu gagal, karena Allah juga mempunyai rencana untuk menyelamatkan Nabi-Nya shallallahu 'alaihi wa sallam. Bisa juga maksudnya, mereka (orang-orang kafir) juga telah membuat rencana jahat terhadap kebenaran dan orang-orangnya agar mereka dapat membatalkan yang hak, seperti dengan menghias kebatilan, namun Allah Subhaanahu wa Ta'aala telah berencana pula untuk mengatasinya dengan menetapkan sebab dan dalil untuk mengokohkan yang hak dan membatalkan yang batil sebagaimana firman-Nya, “Sebenarnya Kami melontarkan yang hak kepada yang batil lalu yang hak itu menghancurkannya, maka dengan serta merta yang batil itu lenyap...dst.” (Terj. Al Anbiyaa’: 18)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 79",
    "description": "Penduduk mekah itu sebenarnya tidak hanya membenci kebenaran yang di bawa oleh rasul kami itu, tetapi bahkan mereka telah merencanakan dengan mantap suatu tipu daya jahat untuk membendung dan menghalangi penyebaran ajaran islam, menganiaya para pembela agama itu, dan bahkan merencanakan pembunuhan terhadap rasul kami. Apa yang mereka rencanakan itu tidak akan kami biarkan, maka untuk itu sesungguhnya kami telah berencana dengan sangat baik dan rapi untuk mengalahkan dan mengatasi semua tipu daya mereka. '80. Dalam keadaan demikian, Allah mengajukan pertanyaan yang berisi kecaman atas rencana mereka dengan mengatakan, 'apakah mereka mengira bahwa kami tidak mendengar rahasia dan bisikan-bisikan mereka' apa yang mereka duga itu merupakan suatu kekeliruan yang amat besar karena sebenarnya kami mendengar semua yang mereka rencanakan itu, dan utusan-utusan kami, yakni malaikat yang mencatat amal baik dan buruk selalu mencatat di sisi mereka apa yang mereka niatkan, katakan, dan kerjakan."
  }
]