[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang mempersekutukan Allah itu menyangka bahwa Kami tidak mendengar apa yang mereka rahasiakan di dalam jiwa mereka dan apa yang mereka bisik-bisikkan diantara mereka? Benar, Kami mendengar dan mengetahui, dan utusan-utusan Kami, para malaikat penjaga yang mulia, juga menulis apa yang mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Ataukah mereka mengira bahwa Kami tidak mendengar rahasia yang mereka sembunyikan di dalam hati mereka, atau rahasia yang mereka bicarakan dengan bisik-bisik? Bahkan Kami mendengarkan semua itu dan malaikat yang ada di hadapannya menuliskan setiap apa yang mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. أَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَىٰهُم ۚ (Apakah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka?) Yakni tidaklah mereka saling berbicara secara rahasia di tempat yang sepi yang hanya ada mereka saja, dan apa yang mereka bisikkan diantara mereka. بَلَىٰ( Sebenarnya (Kami mendengar)) Kami mendengar dan mengetahuinya. وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ (dan utusan-utusan (malaikat-malaikat) Kami selalu mencatat di sisi mereka) Yakni para malaikat penjaga mereka akan mencatat semua perkataan dan perbuatan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Bahkan mereka mengira bahwa Allah tidak mendengar rahasia mereka bersama kelompok mereka, yang telah mereka bisikkan bersama golongan mereka. Itu semua tidak benar, Kami mendengar dan mengetahui rahasia mereka. Utusan-utusan Kami telah mencatat segala perbuatan atau perkataan mereka di sisi mereka. Kata bala berfungsi untuk membantah kalimat sebelumnya, dan menetapkan kalimat sesudahnya. Ayat ini turun di antara tiga, yaitu Ka’bah dan penutupnya, beserta qursyiyani wa tsaqafiy (dua orang Qurays dan dua orang yang berilmu), salah satu di antara mereka berkata: “Apakah kalian menyaksikan Allah mendengar perkataan kami?” kemudian satu lagi menjawab: “Jika kalian berbicara lantang maka Allah akan mendengarnya, namun jika kalian merahasiakannya/dalam batin saja, maka Allah tidak akan mendengarnya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ataukah mereka mengira} mengira {bahwa Kami tidak mendengar rahasia mereka} perkataan hati mereka {dan bisikan mereka} dan bisikan di antara mereka secara rahasia {Sebenarnya (Kami mendengar) dan utusan-utusan Kami} dan para malaikat Kami yang mengawasi {di sisi mereka itu mencatat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “apakah mereka mengira,” dengan kebodohan dan kezhaliman mereka, “bahwa kami tidak mendengar rahasia,” yang tidak mereka katakan, lebih dari itu adalah rahasia di dalam hati, “dan bisikan-bisikan mereka,” pembicaraan lirih yang mereka bisikan? Karena itulah mereka melakukan kemaksiatan dan mereka mengira tidak ada yang mengintai dan tidak akan membalas atas rahasia mereka. Allah menanggapi mereka dengan firman, ”sebenarnya (kami mendengar),” yaitu, kami mengetahui rahasia dan bisikkan mereka, “dan utusan-utusan kami,” yaitu para malaikat mulia, yang “selalu mencatat di sisi mereka,” semua yang mereka lakukan akan dicatat hingga mereka datang di hari kiamat, mereka mendapatkan amalan mereka hadir, dan Rabbmu tidak menzhalimi seorang pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 80: (Apakah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka) yakni apa-apa yang mereka rahasiakan dari orang lain dan apa-apa yang mereka perlihatkan dengan terang-terangan di antara sesama mereka sendiri. (Sebenarnya) Kami mendengar hal tersebut (dan utusan-utusan Kami) yakni malaikat-malaikat pencatat amal perbuatan (di sisi mereka) di sisi orang-orang kafir (selalu mencatat) hal tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan kebodohan dan kezaliman mereka. Yang disembunyikan dalam hati mereka. Sehingga mereka berani berbuat maksiat dan mengira bahwa maksiat itu tidak ada akibatnya serta tidak diberikan balasan terhadap hal yang tersembunyi darinya. Allah Subhaanahu wa Ta'aala membantah sangkaan mereka itu. Mereka mencatat apa yang mereka kerjakan dan menjaganya untuk mereka sampai tiba hari Kiamat, lalu mereka mendapatkan amal mereka ada di hadapan, dan Allah Subhaanahu wa Ta'aala tidak pernah menzalimi seorang pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 80",
    "description": "Dalam keadaan demikian, Allah mengajukan pertanyaan yang berisi kecaman atas rencana mereka dengan mengatakan, 'apakah mereka mengira bahwa kami tidak mendengar rahasia dan bisikan-bisikan mereka' apa yang mereka duga itu merupakan suatu kekeliruan yang amat besar karena sebenarnya kami mendengar semua yang mereka rencanakan itu, dan utusan-utusan kami, yakni malaikat yang mencatat amal baik dan buruk selalu mencatat di sisi mereka apa yang mereka niatkan, katakan, dan kerjakan. 81. Pada ayat-ayat yang lalu, Allah menggambarkan pengingkaran orang-orang kafir mekah terhadap kebenaran yang di bawa oleh nabi Muhammad. Pada ayat ini, Allah menggambarkan bantahan terhadap kepercayaan mereka bahwa tuhan mempunyai anak. 'katakanlah, wahai Muhammad, \"jika benar dan terbukti bahwa tuhan yang maha pengasih mempunyai anak, seperti yang kamu duga, maka akulah orang yang mula-Mula memuliakan anak itu. \" akan tetapi, ternyata apa yang mereka duga itu tidak terbukti."
  }
]