[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "81-82. Katakanlah (wahai Rasul) kepada orang-orang musyrik dari kaummu yang menganggap bahwa malaikat adalah anak perempuan Allah, “Bila Allah yang Maha Pengasih memiliki anak, maka aku adalah orang pertama yang menyembah anak yang kalian anggap itu.” Akan tetapi hal itu tidak terjadi dan tidak akan terjadi. Mahasuci Allah dari istri dan anak. Ini adalah penyucian dan pembersihan bagi Tuhan langit dan bumi, Tuhan Arasy yang agung, dari kebohongan dan kedustaan yang dibuat-buat oleh orang-orang musyrik berupa penisbatan anak kepada Allah dan anggapan-anggapan batil lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Katakan -wahai Rasul- kepada orang-orang yang menasabkan anak perempuan untuk Allah, Mahatinggi Allah dari ucapan mereka setinggi-tingginya, “Allah tidak memiliki anak, Maha suci Dia dari hal tersebut. Aku adalah orang pertama yang menyembah Allah lagi menyucikan-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81-83. Hai Rasulullah, katakanlah kepada orang-orang musyrik yang menganggap Allah memiliki anak: “Seandainya itu benar, niscaya aku adalah orang yang pertama kali menyembah anak itu. akan tetapi Dia tidak memiliki anak, sehingga aku menyembah Allah.” Memiliki anak adalah hal yang tidak mungkin bagi Allah, dan kalimat syarat ini tidak harus benar terjadi. Maha Suci Allah, Pencipta tujuh langit dan bumi, Tuhan pemilik ‘arsy, dari segala kedustaan yang dituduhkan orang-orang musyrik itu. Biarkanlah mereka tenggelam dalam kesesatan dan bermain-main dengan dunia mereka, hingga mereka sampai di hari kiamat sebagai hari yang dijanjikan bagi mereka untuk mendapatkan azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. قُلْ إِن كَانَ لِلرَّحْمٰنِ وَلَدٌ فَأَنَا۠ أَوَّلُ الْعٰبِدِينَ (Katakanlah, jika benar Tuhan Yang Maha Pemurah mempunyai anak, maka akulah (Muhammad) orang yang mula-mula memuliakan (anak itu)) Yakni katakanlah hai Muhammad, jika memang benar Allah memiliki seorang anak maka aku adalah orang paling pertama yang akan menyembahnya; namun Allah tidak mungkin memiliki seorang anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Katakanlah wahai Rasul: “Jika memang benar Allah mempunyai putera sebagaimana yang telah kalian kira, maka akulah yang pertama kali akan mengagungkannya. Namun itu adalah suatu yang mustahil. Telah ada dasar teguh yang menetapkan bahwa Allah tidak mempunyai anak. Mustahil juga jika aku menyembah selain Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Jika benar Tuhan Yang Maha Pengasih itu mempunyai anak, aku adalah orang pertama yang menyembahnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. maksudnya, katakanlah wahai rasul yang mulia kepada orang-orang yang menganggap Allah mempunyai anak, padahal Dia adalah maha esa dan tunggal, hanya Dia tempat bergantung segala sesuatu yang tidak memiliki pendamping dan tidak juga anak, Dia tidak memiliki sekutu apa pun, “katakanlah,’jika benar (Rabb) yang maha pemurah mempunyai anak, maka akulah (Muhammad) orang pertama yang menyembah,” yakni anak itu, karena anak adalah bagian dari ayahnya. Aku adalah makhluk yang paling berhak tunduk pada perintah-perintah yang dicintai Allah tapi aku adalah orang pertama yang memungkiri hal itu dan paling menafikannya. Dengan demikian, kebatilan anggapan mereka diketahui. Ini adalah hujjah yang agung bagi orang yang mengetahui kondisi para Rasul, dan bahwasannya bila diketahui bahwa Muhammad adalah makhluk paling sempurna, maka dialah orang pertama yang terlebih dahulu mengetahui kebaikan dan menyempurnakannya, dan dialah orang pertama yang terlebih dahulu mengetahui keburukan dan meninggalkan serta mengingkarinya, serta jauh darinya. Andai Allah memilki anak, pasti Muhammad bin Abdullah, rasul terbaik, adalah rasul pertama yang menyembahnya dan tidak didahului oleh orang-orang musyrik. Kemungkinan makna lain ayat ini: Andaikan Allah memiliki anak, aku adalah orang pertama yang menyembahnya untuk Allah. Termasuk ibadahku kepada Allah adalah menetapkan apa pun yang telah di tetapkanNYa dan menafikan apa pun yang dinafikanNya. Inilah ibadah yang bersifat ucapan dan I’tiqadiyah (keyakinan) (yang merupakan ibadah lisan dan hati). Sebagai keharusan atas hal ini, bila memang anggapan orang-orang musyrik benar, tentu aku adalah orang pertama yang menciptakannya. Dengan demikian diketahui kebatilan klaim orang-orang musyrik itu serta rusaknya secara logika dan naqli."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 81: (Katakanlah! Jika benar Tuhan Yang Maha Pemurah mempunyai anak) seumpamanya (maka akulah orang yang mulamula menyembahnya) menyembah anak Tuhan itu, akan tetapi telah ditetapkan, bahwa tiada anak bagi-Nya, sehingga tiada pula penyembahan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang yang mengatakan Allah punya anak, padahal Dia Maha Esa, semua makhluk bergantung kepada-Nya, Dia tidak beranak dan tidak diperanakkan dan tidak ada seorang pun yang setara dengan-Nya. Yakni akan tetapi kenyataannya Dia tidak punya anak, sehingga aku tidak menyembahnya. Oleh karena itulah, aku adalah orang yang pertama mengingkarinya dan menafikannya. Ayat ini merupakan hujjah yang besar yang menerangkan kebatilan perkataan mereka, dan bahwa tidak ada satu pun kebaikan, kecuali para rasul adalah orang yang pertama melakukannya, dan tidak ada satu pun keburukan kecuali para rasul adalah orang yang pertama meninggalkannya, mengingkarinya dan menjauhinya. Bisa juga maksud ayat ini adalah, bahwa jika Allah Yang Maha Pengasih punya anak, maka aku sebagai orang yang pertama beribadah kepada Allah, sehingga termasuk beribadah kepada Allah Subhaanahu wa Ta'aala adalah menetapkan apa yang ditetapkan-Nya dan meniadakan apa yang ditiadakan-Nya, dan hal ini termasuk ibadah pada perkataan dan keyakinan. Dengan demikian, jika hal itu benar tentu aku adalah orang yang pertama menetapkannya, sehingga dari sini diketahui kebatilan perkataan orang-orang musyrik yang mengatakan bahwa Allah punya anak baik secara akal maupun naql (nukilan)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 81",
    "description": "Pada ayat-ayat yang lalu, Allah menggambarkan pengingkaran orang-orang kafir mekah terhadap kebenaran yang di bawa oleh nabi Muhammad. Pada ayat ini, Allah menggambarkan bantahan terhadap kepercayaan mereka bahwa tuhan mempunyai anak. 'katakanlah, wahai Muhammad, \"jika benar dan terbukti bahwa tuhan yang maha pengasih mempunyai anak, seperti yang kamu duga, maka akulah orang yang mula-Mula memuliakan anak itu. \" akan tetapi, ternyata apa yang mereka duga itu tidak terbukti. 82. Mahasuci tuhan pemelihara langit dan bumi, tuhan pemilik 'arsy, dari segala kekurangan, mahasuci Allah yang maha esa dari apa yang mereka sifatkan itu."
  }
]