[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka biarkanlah (wahai rasul), orang-orang yang berdusta atas Nama Allah berbicara dalam kebatilan mereka dan bermain-main di dunia mereka, sampai mereka mendapatkan hari yang diancamkan kepada mereka, yaitu azab, bisa di dunia dan bisa di akhirat atau bisa pula di keduanya sekaligus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Maka tinggalkanlah mereka -wahai Rasul- terus tenggelam dalam kebatilan yang mereka lakukan dan bermain-main hingga mereka mendapati hari yang dijanjikan kepada mereka, lalu mereka mengetahui akibat dari apa yang telah mereka lakukan dan menyesal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَذَرْهُمْ يَخُوضُوا۟ وَيَلْعَبُوا۟ (Maka biarlah mereka tenggelam (dalam kesesatan) dan bermain-main) Yakni tenggelam dalam memberbincangkan kedustaan mereka dan bermain-main dalam dunia mereka. حَتَّىٰ يُلٰقُوا۟ يَوْمَهُمُ الَّذِى يُوعَدُونَ(sampai mereka menemui hari yang dijanjikan kepada mereka) Yakni pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Biarkanlah atau tinggalkanlah mereka dalam kesesatan mereka, terlena dalam keduniaan mereka, sampai mereka akan tahu sendiri akan datangnya hari kiamat yang telah mereka tunggu-tunggu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka biarkanlah mereka} biarkanlah mereka {tenggelam} berbicara dengan kebathilan {dan bermain-main sampai mereka menemui hari yang dijanjikan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. “maka biarkanlah mereka tenggelam (dalam kesesatan) dan bermain-main,” yakni tenggelam dalam kebatilan dan bermain-main dengan kemustahilan. Ilmu mereka membahayakan dan tidak berguna, karena mereka menyelami dan meneliti berbagai ilmu yang digunakan untuk menentang kebenaran yang dibawa oleh para rasul. Semua tindakan mereka adalah permainan dan kebodohan yang tidak bisa menyucikan jiwa dan membuahkan pengetahuan. Oleh sebab itulah Allah mengancam mereka dengan sesuatu di hadapan mereka pada hari kiamat seraya berfirman, ”sampai mereka menemui hari yang dijanjikan kepada mereka,” mereka akan mengetahui apa yang mereka dapatkan berupa kesengsaraan abadi dan siksa yang terus menerus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 83: (Maka biarlah mereka tenggelam) dalam kesesatannya atau dalam kebatilannya (dan bermain-main) di dalam dunia mereka (sampai mereka menemui hari yang dijanjikan kepada mereka) yaitu azab yang dijanjikan kepada mereka pada hari kiamat nanti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di dunia. Oleh karena itu, ilmu mereka merugikan mereka dan tidak bermanfaat; mereka tenggelam dalam mengkaji ilmu-ilmu untuk menolak yang hak dan apa yang dibawa para rasul. Perbuatan mereka adalah main-main dan kebodohan, tidak membersihkan jiwa dan membuahkan pengetahuan. Oleh karena itu, pada lanjutan ayatnya Allah Subhaanahu wa Ta'aala mengancam mereka dengan hari Kiamat, “Sampai mereka menemui hari yang dijanjikan kepada mereka.” Yaitu hari Kiamat, dimana mereka akan mengetahui apa yang mereka dapatkan, yaitu kesengsaraan yang kekal dan azab yang tetap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 83",
    "description": "Jika mereka tetap bersikeras dengan kesesatan itu, maka biarkanlah mereka, wahai nabi Muhammad, tenggelam dalam kesesatannya dan bermain-main dengan kesesatan yang mereka yakini itu sampai mereka menemui hari yang di janjikan kepada mereka, yakni hari kiamat di mana mereka akan mempertanggungjawabkan semua amal yang telah mereka lakukan. 84. Dan dialah tuhan yang mahasuci dari segala kekurangan, dialah tuhan yang disembah di langit dan dia pulalah tuhan yang disembah di bumi dan dialah yang mahabijaksana terhadap semua yang di ciptakan-Nya, maha mengetahui terhadap segala sesuatu yang nyata maupun yang tersembunyi."
  }
]