[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hanya Allah semata yang berhak disembah dengan sebenarnya di langit dan di bumi. Dia-lah yang Mahabijaksana yang menciptakan makhlukNya dengan sangat baik dan menetapkan syariat dengan sangat mulia. Dia juga Maha Mengetahui segala sesuatu terkait dengan urusan makhlukNya, tidak ada sesuatu pun darinya yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Dan Dia lah -Subḥānahu- yang berhak disembah di langit yang dan yang berhak disembah di bumi, dan Dia Maha Bijaksana dalam penciptaan-Nya, takdir-Nya dan aturan-Nya, Maha Mengetahui atas segala ihwal hamba-hamba-Nya, tidak ada sedikitpun dari ihwal mereka yang tersembunyi dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84-85. Allah adalah Tuhan di langit dan Tuhan di bumi, tidak ada Tuhan selain Dia. Dia Maha Bijaksana dalam mengatur makhluk-Nya, Maha Mengetahui kemaslahatan mereka. Allah Maha Agung dan Maha Banyak kebaikan-Nya, Dia Pemilik kerajaan tujuh langit, bumi, dan yang ada di antara keduanya. Hanya Dia yang mengetahui waktu terjadinya hari kiamat, dan hanya kepada-Nya tempat kembali untuk menjalani hisab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. وَهُوَ الَّذِى فِى السَّمَآءِ إِلٰهٌ وَفِى الْأَرْضِ إِلٰهٌ ۚ (Dan Dialah Tuhan (Yang disembah) di langit dan Tuhan (Yang disembah) di bumi) Dia adalah Allah yang disembah di langit dan disembah di bumi. Atau yang berhak disembah di langit dan di bumi. Qatadah berkata: yakni disembah di langit dan di bumi. وَهُوَ الْحَكِيمُ الْعَلِيمُ (dan Dialah Yang Maha Bijaksana lagi Maha Mengetahui) Yakni memiliki hikmah yang dalam dan ilmu yang luas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Dialah Allah Tuhan langit dan bumi, tidak ada yang layak untuk disembah kecuali Dia. Allah Maha Bijaksana dalam segala perlakuan-Nya kepada hamba-Nya. Allah Maha Tahu atas apa yang terbaik untuk hamba-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dialah Tuhan} yang disembah dengan benar {di langit dan Tuhan di bumi. Dialah Dzat Yang Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Allah mengabarkan bahwa hanya Dia semata yang berhak dipertaruhkan dan disembah di langit dan di bumi. Semua penghuni langit dan orang-orang beriman yang ada di bumi menyembah dan mengagungkanNya serta tunduk pada keagunganNya. Mereka memerlukanNya karena kesempurnaanNya, “bertasbih untukNya tujuh langit dan bumi serta apa pun yang ada padanya dan tidaklah segala sesuatu melainkan bertasbih dengan memujiNya,” (al-isra:44) “dan kepada Allah sujud semua yang ada di langit dan bumi secara suka rela dan terpaksa,” (ar-rad:15) Hanya Dialah yang dipertuhankan dan disembah; yang di sembah oleh seluruh makhluk secara suka rela dan terpaksa. Dan ini sebagimana firman Allah, ”dan Dialah Allah di langit dan di bumi,” (al-an’am:3) Yakni, predikatnya sebagai yang disembah dan dicintai ada pada keduanya. Sedangkan Dia berada di atas arasyNya, berbeda dengan makhlukNya, sendiri dengan keluhuran, terpuji dengan kesempurnaanNya. “dan Dialah yang maha bijaksana,” yang maha bijaksana terhadap apa yang telah diciptakan dan yang maha menyempurnakan apa yang disyariatkan Allah tidak menciptakan sesuatu pun melainkan karena suatu kebijaksanaan dan tidak mensyariatkan sesuatu melainkan untuk suatu hikmah. “lagi maha mengetahui,” segala sesuatu, mengetahui yang rahasia dan tersembunyi, tidak ada sebesar biji atom pun yang luput dariNya, baik yang ada di alam atas maupun alam bawah, tidak pula yang lebih kecil atau lebih besar dari biji atom."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 84: (Dan Dialah Tuhan yang disembah di langit) lafal Fis Samaa-i Ilaahun kedua huruf Hamzahnya dapat dibaca Tahqiq dan Tas-hil, yakni Tuhan yang disembah di langit (dan Tuhan yang disembah di bumi) kedua Zharaf yang ada dalam ayat ini berta'alluq kepada lafal sesudahnya (dan Dialah Yang Maha Bijaksana) di dalam mengatur makhluk-Nya (lagi Maha Mengetahui) kemaslahatan-kemaslahatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia yang berhak disembah saja baik di langit maupun di bumi. Oleh karena itu, penghuni langit semuanya dan penduduk bumi yang beriman mereka beribadah kepada-Nya, mengagungkan-Nya, dan tunduk kepada kebesaran-Nya. Allah Subhaanahu wa Ta'aala berfirman, “Hanya kepada Allah-lah sujud (patuh) segala apa yang di langit dan di bumi, baik dengan kemauan sendiri ataupun terpaksa (dan sujud pula) bayang-bayangnya di waktu pagi dan petang hari.” (Terj. Ar Ra’d: 15) Ayat di atas sama seperti firman-Nya, “Dan Dialah Allah (yang disembah), baik di langit maupun di bumi.” (Terj. Al An’aam: 3) Yakni Dia yang disembah dan dicintai baik di langit maupun di bumi. Adapun Dzat-Nya, maka berada di atas ‘Arsyi-Nya, terpisah dengan makhluk-Nya, sendiri dengan keagungan-Nya dan mulia dengan kesempurnaan-Nya. Dia merapihkan ciptaan-Nya dan merapihkan syariat-Nya. Oleh karena itu, Dia tidaklah menciptakan sesuatu kecuali karena hikmah (kebijaksanaan) dan tidak mensyariatkan sesuatu kecuali karena hikmah, dan ketetapan-Nya baik yang qadari (terhadap alam semesta) maupun yang syar’i (dalam agama-Nya) juga mengandung hikmah. Terhadap hal yang bermaslahat bagi mereka. Dia mengetahui segala sesuatu, yang tampak maupun yang tersembunyi, dan tidak ada satu pun yang luput dari pengetahuan Allah Subhaanahu wa Ta'aala seberat dzarrah (debu) pun baik di langit maupun di bumi, demikian pula yang lebih kecil dari itu atau yang lebih besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 84",
    "description": "Dan dialah tuhan yang mahasuci dari segala kekurangan, dialah tuhan yang disembah di langit dan dia pulalah tuhan yang disembah di bumi dan dialah yang mahabijaksana terhadap semua yang di ciptakan-Nya, maha mengetahui terhadap segala sesuatu yang nyata maupun yang tersembunyi. 85. Dan mahasuci Allah yang keberkatan dan kebajikan-Nya amat banyak, dia merupakan pemilik kerajaan langit dan bumi, dan juga pemilik apa yang ada di antara keduanya, baik yang diketahui oleh manusia maupun yang tersembunyi dari mereka. Dan, di sisi-Nyalah ilmu tentang segala keadaan yang menyangkut hari kiamat dan hanya kepada-Nyalah kamu di kembalikan untuk mempertanggungjawabkan semua amal yang telah di lakukan."
  }
]