[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Keberkahan Allah sangat banyak, kebaikanNya melimpah dan kekuasaanNya sangat agung. Dia-lah pemilik tunggal kerajaan langit yang tujuh dan bumi yang tujuh, serta apa yang ada diantara keduanya seluruhnya. Hanya di sisiNya ilmu tentang saat dimana Kiamat tiba, saat itu seluruh makhluk dibangkitkan dari kubur mereka untuk berdiri di padang hisab, kepada Allah-lah kalian (wahai manusia) dikembalikan setelah kematian kalian, lalu Dia memberikan balasan kepada masing-masing sesuai dengan yang berhak dia dapatkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Semakin bertambah kebaikan dan berkah Allah -Subḥānahu-, hanya Dia Żat yang memiliki kerajaan langit, kerajaan bumi dan yang ada di antara keduanya, dan hanya Dia yang mengetahui tentang saat terjadinya hari Kiamat, tidak ada selain-Nya yang mengetahuinya serta hanya kepada-Nya kalian akan kembali di Akhirat untuk perhitungan amal dan pemberian balasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَتَبَارَكَ الَّذِى لَهُۥ مُلْكُ السَّمٰوٰتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا (Dan Maha Suci Tuhan Yang mempunyai kerajaan langit dan bumi; dan apa yang ada di antara keduanya) Makna (الركة) yakni kebaikan yang banyak. Yang dimaksud dengan apa yang ada di antara langit dan bumi adalah ruang ankasa dan udara serta hewan-hewan yang ada di dalamnya. وَعِندَهُۥ عِلْمُ السَّاعَةِ(dan di sisi-Nya-lah pengetahuan tentang hari kiamat) Yakni ilmu tentang waktu terjadinya hari kiamat. وَإِلَيْهِ تُرْجَعُونَ(dan hanya kepada-Nya-lah kamu dikembalikan) Kemudian setiap orang akan dibalas sesuai dengan haknya dalam kebaikan dan keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Maha Suci dan Maha Agung Allah Penguasa langit, bumi beserta segala yang ada di antaranya, seperti udara dan semua makhluk. Hanya Dia yang tahu tentang hari kiamat, hanya kepada-Nya lah kalian akan kembali. Setiap orang akan dibalas sesuai dengan amal perbuatannya baik keburukan atau kebaikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maha berkah} Maha melimpah kebaikan dan keberkahanNya {Dzat yang memiliki kerajaan langit dan bumi serta apa yang ada di antara keduanya. Di sisiNyalah ilmu tentang hari kiamat dan hanya kepadaNyalah kalian dikembalikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. “dan maha suci (Rabb) yang mempunyai kerajaan langit dan bumi; dan apa yang ada diantara keduanya,” “mahasuci,” yaitu maha tinggi dan maha agung, banyak kebaikanNya, lalu sifat-sifatNya, agung kerajaanNya, luas ilmuNya, maha mengetahui segala sesuatu, hingga Dia sendiri yang mengetahui keghaiban yang tidak satu pun dari makhlukNya tahu; tidak nabi yang diutus dan tidak pula malaikat yang dekat dengan Allah. Karena itu Allah berfirman “dan di sisiNyalah pengetahuan tentang hari kiamat,” zharf (kata keterangan tempat dan waktu) di dahulukan untuk menunjukkan pembatasan. Yaitu, hanya, Dia yang mengetahui kapan tibanya hari kiamat. Diantara kesempurnaan kerajaanNya adalah Dia menguasai kerajaan dunia dan akhirat. Karena itu Dia berfirman, ”dan hanya kepadaNyalah kamu dikembalikan,” yaitu di akhirat, Allah akan menghukumi secara adil di antara kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 85: (Dan Maha Besar) Maha Agung (Tuhan Yang mempunyai kerajaan langit dan bumi; dan apa yang ada di antara keduanya; dan di sisi-Nyalah pengetahuan tentang hari kiamat) yakni kapan ia akan terjadi (dan hanya kepada-Nyalah kalian dikembalikan) lafal Turja'uuna dapat pula dibaca Yurja`uuna; berdasarkan qiraat kedua maka artinya: Dan hanya kepadaNyalah mereka dikembalikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tabaaraka artinya Mahatinggi, Maha Agung, Mahabanyak kebaikan-Nya, luas sifat-Nya dan Maha besar kerajaan-Nya. Oleh karena itu, Dia menyebutkan luasnya kerajaan-Nya meliputi langit, bumi dan apa yang ada di antara keduanya, demikian pula luas ilmu-Nya dan bahwa Dia Maha Mengetahui segala sesuatu, sehingga Dia sendiri saja dalam mengetahui banyak hal gaib yang tidak ada satu pun makhluk mengetahuinya, baik nabi yang diutus maupun malaikat yang didekatkan. Dia menerangkan bahwa di sisi-Nyalah pengetahuan tentang kapan datang hari Kiamat. Di antara sempurnanya kerajaan-Nya dan luasnya adalah bahwa Dia yang memiliki dunia dan akhirat. Oleh karena itu, Dia berfirman, “dan hanya kepada-Nyalah kamu dikembalikan.” Yaitu di akhirat, lalu Dia akan memberikan keputusan di antara kamu dengan keputusan-Nya yang adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 85",
    "description": "Dan mahasuci Allah yang keberkatan dan kebajikan-Nya amat banyak, dia merupakan pemilik kerajaan langit dan bumi, dan juga pemilik apa yang ada di antara keduanya, baik yang diketahui oleh manusia maupun yang tersembunyi dari mereka. Dan, di sisi-Nyalah ilmu tentang segala keadaan yang menyangkut hari kiamat dan hanya kepada-Nyalah kamu di kembalikan untuk mempertanggungjawabkan semua amal yang telah di lakukan. 86. Dan Allah menegaskan bahwa orang-orang yang menyeru kepada selain Allah dan menyembah selain-Nya, baik berhala, maupun malaikat, manusia, atau siapa pun tidak mendapat sedikit pun syafaat, yakni pertolongan di akhirat, kecuali orang yang menyaksikan dan mengakui yang hak (tauhid), yakni yang mengesakan Allah dan mereka meyakini apa yang mereka saksikan dan akui itu."
  }
]