[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang disembah oleh orang-orang musyrik itu tidak memiliki syafaat di sisi Allah untuk seseorang kecuali siapa yang bersaksi dengan benar, mengakui tauhid Allah dan kenabian Muhammad, disamping mereka mengetahui hakikat dari apa yang mereka akui dan saksikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Dan sesembahan yang disembah oleh orang-orang musyrik selain Allah tidak bisa memberi syafaat di sisi Allah, kecuali orang yang bersaksi bahwa tidak ada tuhan yang berhak disembah selain Allah, dan dia mengerti apa yang dipersaksikannya, seperti Isa, Uzair dan malaikat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86-87. Sesembahan-sesembahan selain Allah tidak memilki syafaat di sisi Allah, meskipun mereka adalah malaikat. Namun orang yang bersaksi atas kebenaran, mengikrarkan keesaan Allah, dan mengetahui apa yang diikrarkannya itu, maka syafaatnya dapat berlaku di sisi Allah atas izin-Nya. Sungguh jika kamu bertanya kepada orang-orang musyrik, siapa yang menciptakan mereka? Niscaya mereka akan mengakui bahwa Allah-lah pencipta mereka. Namun mengapa mereka berpaling dari menyembah Allah kepada selain-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَتَبَارَكَ الَّذِى لَهُۥ مُلْكُ السَّمٰوٰتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا (Dan Maha Suci Tuhan Yang mempunyai kerajaan langit dan bumi; dan apa yang ada di antara keduanya) Makna (الركة) yakni kebaikan yang banyak. Yang dimaksud dengan apa yang ada di antara langit dan bumi adalah ruang ankasa dan udara serta hewan-hewan yang ada di dalamnya. وَعِندَهُۥ عِلْمُ السَّاعَةِ(dan di sisi-Nya-lah pengetahuan tentang hari kiamat) Yakni ilmu tentang waktu terjadinya hari kiamat. وَإِلَيْهِ تُرْجَعُونَ(dan hanya kepada-Nya-lah kamu dikembalikan) Kemudian setiap orang akan dibalas sesuai dengan haknya dalam kebaikan dan keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Orang-orang yang mempunyai sesembahan selain Allah, sperti berhala ataupu sesembahan lainnya tidak akan mendapat pertolongan dari Allah. Namun yang masih meyakini dengan sepenuh hati bahwa Allah adalah Maha Esa maka mereka akan mendapatkan pertolongan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sembahan-sembahan mereka selain Dia tidak memiliki syafaat, kecuali orang yang bersaksi dengan yang benar} dengan kalimat tauhid {dan mereka meyakininya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. di antara kesempurnaan kekuasaanNya adalah, tidak ada satu pun dari makhlukNya yang berkuasa atas sesuatupun, tidak ada seorang pun yang dapat memberi syafaat tanpa izinNya, “dan sesembahan-sesembahan yang mereka sembah selain Allah tidak dapat memberi syafaat,” dengan kata lain, semua yang disembah selain Allah dari paa nabi, malaikat, dan lainnya,tidak berkuasa atas syafaat dan tidak bisa memberikannya tanpa izin dari Allah dan mereka pun tidak bisa memberi syafaat kecuali bagi orang yang diridhai Allah karena itu Allah berfiman,”akan tetapi (orang yang dapat memberi syafaat ialah) orang yang besyahadat (bersaksi) dengan yang haq (tauhid) dan mereka (meyakini)nya.” Yakni, mengucapkan dengan lisan, mengakui dengan hati dan mengetahui apa yang dipersaksikan tesebut. Disyaratkan persaksiannya harus benar, yaitu bersaksi untuk Allah dengan keesan, bersaksi untuk para rasul dengan kenabian dan risalah dan membenarkan apa yang mereka bawa berupa asas dan cabang agama, hakikat dan syariat agama. mereka itulah orang-orang yang akan bisa mendapatkan faidah dari syafaat oang-orang yang memberi syafaat dan mereka adalah oang-orang yang selamat dai siksa Allah seta beruntung mendapatkan pahalaNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 86: (Dan tidaklah memiliki apa-apa yang mereka seru) yang mereka sembah, dimaksud adalah orang-orang kafir pelakunya (selain Dia) selain Allah (suatu syafaat pun) bagi seseorang (tetapi yang dapat memberi syafaat ialah orang yang mengakui yang hak) yakni orang yang telah mengatakan, \"Laa Ilaaha Illallaah\"/tiada Tuhan selain Allah (dan mereka mengetahui) apa yang mereka akui dengan kalbunya, yaitu yang telah diucapkan oleh lisannya. Yang dimaksud antara lain ialah Nabi Isa, Nabi Uzair dan malaikat-malaikat, sesungguhnya mereka dapat memberi syafaat kepada orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara sempurnanya kerajaan-Nya juga adalah tidak ada seorang pun yang berkuasa terhadap urusan-Nya, dan tidak ada yang berani memberi syafaat kecuali dengan izin-Nya. Syaikh As Sa’diy menerangkan, bahwa semua yang diibadahi selain Allah, baik para nabi, malaikat, maupun selain mereka tidak memiliki syafaat, dan mereka tidaklah memberi syafaat kecuali dengan izin Allah, dan lagi mereka pun tidak memberi syafaat kecuali kepada orang yang Allah ridhai. Oleh karena itulah pada lanjutan ayatnya Allah Subhaanahu wa Ta'aala berfirman, “kecuali orang yang mengakui yang hak (tauhid) dan mereka meyakini.” Dengan demikian, Nabi Muhammad shallallahu 'alaihi wa sallam dan Nabi yang lain ‘alaihimush shalaatu was salam dapat memberi syafa'at setelah diberi izin oleh Allah Subhaanahu wa Ta'aala dan kepada orang yang diridhai-Nya. Yakni mengucapkan dengan lisannya dan mengakui dengan hatinya serta mengetahui (meyakini) apa yang diikrarkannya itu. Demikian pula disyaratkan pengakuan ini terhadap yang hak, yaitu bersaksi bahwa Allah Subhaanahu wa Ta'aala yang berhak disembah saja (Laailaahaillallah), mengakui kenabian dan kerasulan para rasul-Nya dan benarnya apa yang mereka bawa, baik yang terkait dengan dasar agama maupun cabang, hakikat maupun syariat. Mereka inilah oran yang bermanfaat bagi mereka syafaat orang-orang yang memberi syafaat dan mereka inilah orang-orang yang selamat dari azab Allah serta mendapatkan pahala-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 86",
    "description": "Dan Allah menegaskan bahwa orang-orang yang menyeru kepada selain Allah dan menyembah selain-Nya, baik berhala, maupun malaikat, manusia, atau siapa pun tidak mendapat sedikit pun syafaat, yakni pertolongan di akhirat, kecuali orang yang menyaksikan dan mengakui yang hak (tauhid), yakni yang mengesakan Allah dan mereka meyakini apa yang mereka saksikan dan akui itu. 87-88. Dan jika engkau, wahai nabi Muhammad, bertanya kepada mereka, yakni kaum musyrik mekah mengenai siapakah yang menciptakan mereka, niscaya mereka menjawab bahwa yang menciptakan mereka adalah Allah. Jadi, bagaimana mereka dapat dipalingkan dari menyembah Allah pada hal mereka mengakui Allah sebagai pencipta mereka, dan Allah mengetahui ucapan mereka itu dan ucapannya, yakni ucapan nabi Muhammad ketika mengadu kepada Allah dengan mengatakan, 'ya tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman kepada-Mu dan kepada apa yang diturunkan untuk mereka. '."
  }
]