[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kamu (wahai Rasul) bertanya kepada orang-orang musyrik dari kaummu tentang siapa yang menciptakan mereka?, pastilah mereka akan menjawab, “Allah-lah yang menciptakan kami.” Lalu bagaimana mereka akhirnya berpaling dari penghambaan kepada Allah dan mempersekutukanNYa dengan sesuatu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Dan jika engkau tanya mereka, siapa yang menciptakan mereka, niscaya mereka menjawab, “Kami diciptakan oleh Allah.” Maka bagaimana mereka berpaling dari ibadah kepada Allah setelah mereka mengakui hal itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللهُ ۖ (Dan sungguh jika kamu bertanya kepada mereka: “Siapakah yang menciptakan mereka, niscaya mereka menjawab: “Allah”) Yakni mereka mengakui bahwa pencipta mereka adalah Allah, mereka tidak dapat mengingkari hal ini. فَأَنَّىٰ يُؤْفَكُونَ (maka bagaimanakah mereka dapat dipalingkan (dari menyembah Allah)?) Yakni bagaimana mereka berpaling dari menyembah Allah menjadi menyembah selain Allah padahal mereka mengakui bahwa Allah adalah pencipta mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Wahai Nabi, jika engkau tanyakan kepada orang-orang kafir, siapa yang telah menciptakan mereka, mereka menjawab bahwa Allah lah pencipta mereka, Allah lah pencipta segala sesuatu. Sehingga bagaimana bisa mereka berpaling dari menyembah Allah. Lantas mereka menyembah selain Allah setelah mereka sendiri pun meyakini bahwa Pencipta mereka adalah Allah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kamu bertanya kepada mereka,”Siapakah yang menciptakan mereka, sungguh mereka akan menjawab,“Allah” Maka bagiamana mereka bisa dipalingkan} maka bagaimana mereka bisa dipalingkan dari menyembahNya kepada menyembah kepada selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. selanjutnya Allah berfirman, ”dan sungguh jika kamu betanya kepada mereka,’siapakah yang menciptakan mereka?’ niscaya mereka menjawab,’Allah’,” maksudnya, jika kau betanya pada oang-orang musyrik tentang tauhid rububiyah dan siapakah pencipta itu, pasti mereka mengakui bahwa Dialah Allah yang tidak ada sekutu bagiNya,”maka bagaimanakah mereka dapat dipalingkan dari menyembah Allah dan ikhlas semata karenaNYa? Pengakuan mereka akan merupakan dalil terbesar atas batilnya kesyirikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 87: (Dan sungguh jika) huruf Lam di sini bermakna Qasam (kamu bertanya kepada mereka, \"Siapakah yang menciptakan mereka?\" Niscaya mereka menjawab, \"Allah\") lafal Layaquulunna dibuang daripadanya Nun alamat Rafa' dan Wawu Dhamir jamak, karena asalnya adalah Layaquuluunanna (maka bagaimanakah mereka dapat dipalingkan) sehingga mereka tidak mau menyembah Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pengakuan mereka bahwa Allah Pencipta mereka mengharuskan mereka untuk beribadah hanya kepada-Nya. Hal ini merupakan dalil terbesar yang menunjukkan batilnya perbuatan syrik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 87",
    "description": "87-88. Dan jika engkau, wahai nabi Muhammad, bertanya kepada mereka, yakni kaum musyrik mekah mengenai siapakah yang menciptakan mereka, niscaya mereka menjawab bahwa yang menciptakan mereka adalah Allah. Jadi, bagaimana mereka dapat dipalingkan dari menyembah Allah pada hal mereka mengakui Allah sebagai pencipta mereka, dan Allah mengetahui ucapan mereka itu dan ucapannya, yakni ucapan nabi Muhammad ketika mengadu kepada Allah dengan mengatakan, 'ya tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman kepada-Mu dan kepada apa yang diturunkan untuk mereka. '87-88. Jadi, bagaimana mereka dapat di palingkan dari menyembah Allah pada hal mereka mengakui Allah sebagai pencipta mereka, dan Allah mengetahui ucapan mereka itu dan ucapannya, yakni ucapan nabi Muhammad ketika mengadu kepada Allah dengan mengatakan, 'ya tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman kepada-Mu dan kepada apa yang diturunkan untuk mereka"
  }
]