[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-89. Muhammad berkata mengadukan kaumnya yang mendustakannya kepada Tuhannya, “Wahai Tuhanku, sesungguhnya orang-orang itu adalah kaum yang tidak beriman kepadaMu dan kepada apa yang Engkau adalah kaum yang tidak beriman kepadaMu dan kepada apa yang Engkau mengutusku dengannya kepada mereka.” Maka Allah memerintahkannya untuk berpaling dari mereka dan dari gangguan mereka serta membiarkan mereka disebabkan kekafiran mereka dan penentangan mereka. Jangan terlontar darimu (wahai Rasul) kecuali keselamatan bagi mereka sebagaimana yang diucapkan oleh orang-orang yang berakal dan beradab kepada orang-orang bodoh, karena orang-orang yang berakal tidak membalas kebodohan dengan kebodohan dan membalas keburukan dengan yang semisalnya. Mereka pasti akan mengetahui musibah dan bencana yang akan menimpa mereka. Dlam ayat ini terdapat ancaman dan peringatan keras bagi orang-orang kafir yang menentang dan orang-orang yang seperti mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Dan Dia -Subḥānahu- mempunyai pengetahuan tentang keluhan rasul-Nya terhadap pendustaan kaumnya, dan ucapannya dalam berkeluh kesah, “Wahai Rabb! Sesungguhnya mereka adalah kaum yang tidak beriman kepada risalah yang Engkau mengutusku untuk menyampaikannya kepada mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Nabi Muhammad mengadu kepada Allah dengan penuh ketundukan: “Orang-orang musyrik itu tidak beriman kepada Allah dan kepada risalahku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللهُ ۖ (Dan sungguh jika kamu bertanya kepada mereka: “Siapakah yang menciptakan mereka, niscaya mereka menjawab: “Allah”) Yakni mereka mengakui bahwa pencipta mereka adalah Allah, mereka tidak dapat mengingkari hal ini. فَأَنَّىٰ يُؤْفَكُونَ (maka bagaimanakah mereka dapat dipalingkan (dari menyembah Allah)?) Yakni bagaimana mereka berpaling dari menyembah Allah menjadi menyembah selain Allah padahal mereka mengakui bahwa Allah adalah pencipta mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Wa qilihi terdapat wawu qosam. Pengucap, yang diucap, dan ucapan adalah satu kesatuan. Maksudnya perkataan rasul yang menyatakan aduan bahwa mereka tidak beriman akan disiksa sesuai dengan perbuatan mereka adalah suatu kebenaran. Ya rabb bermakna para orang yang tidak mengimana dakwahku dan risalahku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dan ucapannya} di sisi Allah pengetahuan tentang ucapan nabi Muhammad terkait keluhannya {“Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. “dan (Allah mengetahui) ucapan Muhammad,’ ya Rabbku, sesungguhnya mereka itu adalah kaum yang tidak beriman’,” kalimat ini ma’thuf kepada firman Allah, “dan disisiNya pengetahuan hari kiamat,” yaitu, dan disisiNyalah pengethuan tentang apa yang Muhammad ucapkan seraya mengeluh pada Rabbnya akan kedustaan kaumnya karena merasa sedih atas hal itu serta menyesali ketidak berimanan mereka. Allah mengetahui kondisi ini dan Mahakuasa untuk menyegerakan para hamba, karena Allah mengetahui bahwa mereka akan bertaubat dan kembali (kepadaNya)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 88: (Dan ucapannya) ucapan Nabi Muhammad; dinashabkannya lafal Qiilihi karena menjadi Mashdar yang dinashabkan oleh Fi'ilnya yang Muqaddar atau diperkirakan keberadaannya; yakni, dan berkatalah dia, (\"Ya Rabbku! Sesungguhnya mereka itu adalah kaum yang tidak beriman.\")"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu keluhannya kepada Tuhannya karena pendustaan kaumnya dan rasa sedihnya Beliau terhadapnya karena mereka tidak mau beriman. Maka Allah Subhaanahu wa Ta'aala mengetahui keadaan Beliau, mampu segera menyiksa mereka, akan tetapi Dia Maha halim (santun), Dia menundanya agar mereka bertobat dan kembali. Oleh karena itulah dalam ayat selanjutnya Allah Subhaanahu wa Ta'aala berfirman, “Maka berpalinglah dari mereka dan katakanlah, \"Salam (selamat tinggal).\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 88",
    "description": "87-88. Dan jika engkau, wahai nabi Muhammad, bertanya kepada mereka, yakni kaum musyrik mekah mengenai siapakah yang menciptakan mereka, niscaya mereka menjawab bahwa yang menciptakan mereka adalah Allah. Jadi, bagaimana mereka dapat di palingkan dari menyembah Allah pada hal mereka mengakui Allah sebagai pencipta mereka, dan Allah mengetahui ucapan mereka itu dan ucapannya, yakni ucapan nabi Muhammad ketika mengadu kepada Allah dengan mengatakan, 'ya tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman kepada-Mu dan kepada apa yang diturunkan untuk mereka. '89. Allah menyambut pengaduan nabi Muhammad dengan berfirman, 'maka berpalinglah dari mereka, wahai nabi Muhammad, dan katakanlah kepada mereka, 'salam (selamat tinggal). ' kelak di dunia ini atau di akhirat nanti, mereka akan mengetahui nasib mereka yang buruk, berupa azab yang amat pedih."
  }
]