[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-89. Muhammad berkata mengadukan kaumnya yang mendustakannya kepada Tuhannya, “Wahai Tuhanku, sesungguhnya orang-orang itu adalah kaum yang tidak beriman kepadaMu dan kepada apa yang Engkau adalah kaum yang tidak beriman kepadaMu dan kepada apa yang Engkau mengutusku dengannya kepada mereka.” Maka Allah memerintahkannya untuk berpaling dari mereka dan dari gangguan mereka serta membiarkan mereka disebabkan kekafiran mereka dan penentangan mereka. Jangan terlontar darimu (wahai Rasul) kecuali keselamatan bagi mereka sebagaimana yang diucapkan oleh orang-orang yang berakal dan beradab kepada orang-orang bodoh, karena orang-orang yang berakal tidak membalas kebodohan dengan kebodohan dan membalas keburukan dengan yang semisalnya. Mereka pasti akan mengetahui musibah dan bencana yang akan menimpa mereka. Dlam ayat ini terdapat ancaman dan peringatan keras bagi orang-orang kafir yang menentang dan orang-orang yang seperti mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Maka berpalinglah dari mereka dan katakan kepada mereka sesuatu sebagai balasan atas kejahatan mereka -kejadian ini terjadi di Makkah- niscaya mereka akan mengetahui siksa yang akan mereka temui."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Maka Allah menjawab: “Maafkan dan biarkanlah mereka, dan katakanlah kepada mereka: ‘Salam ‘alaikum’ sebagai tanda bahwa kamu berpaling dan meninggalkan mereka. Mereka akan mengatahui akibat dari pendustaan yang mereka lakukan.” Ini merupakan bentuk ancaman bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. فَاصْفَحْ عَنْهُمْ (Maka berpalinglah (hai Muhammad) dari mereka) Yakni berpalinglah dari apa yang mereka tuduhkan kepadamu yang mengatakan bahwa kamu adalah tukang sihir dan dukun, dan bersabarlah dalam berdakwah sampai datang keputusan Allah. وَقُلْ سَلٰمٌ ۚ (dan katakanlah: “Salam) Yakni aku hanya akan berpaling dari kalian. فَسَوْفَ يَعْلَمُونَ (Kelak mereka akan mengetahui) Kalimat ini mengandung ancaman besar dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Allah menjawab dengan firman-Nya: “Biarkanlah orang-orang musyrik itu, bantahlah mereka dengan bantahan orang berakal kepada orang bodoh.” Katakanlah kepada mereka: “Selamat tinggal sebagai ungkapan perpisahan, bukan doa keselamatan. Kelak mereka akan tahu akibat dari apa yang telah mereka dustakan dan mereka ingkari. Disitu terdapat makna ancaman dan janji yang teguh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berpalinglah} berpalinglah {dari mereka dan katakanlah,“Salam”} sesuatu yang kamu ucapkan untuk berpaling dari keburukan mereka {Mereka kelak akan mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. karena itu Allah berfirman, ”maka berpalinglah (hai Muhammad) dari mereka dan katakanlah, ’salam (selamat tinggal)’,” yakni, berpalinglah dari gangguan mereka, baik gangguan lisan maupun tindakan, serta maafkan mereka, jangan kau sahuti meeka kecuali dengan ucapan salam yang biasa diucapkan oleh orang-orang berakal dan memiliki mata hati untuk orang-oang bodoh, sebagaimana yang difirmankan Allah tentang hamba-hambaNYa yang shalih, ”dan apabila orang-orang jahil menyapa mereka,” yakni, sesuai dengan ucapan kebodohan mereka,”mereka mengucapkan kata-kata (yang mengandung) keselamatan,” Rasulullah melaksanakan peintah Rabbnya dan menghadapi gangguan dari kaumnya dan orang lain dengan kebaikan dan tuturr kata yang baik. Semoga kesejahteraan serta keselamatan Allah senantiasa terlimpah pada orang yang dikhususkan oleh Allah dengan akhlak yang agung, dengan ahklak itu Rasulullah menjadi makhluk utama penghuni langit dan bumi. Dan firman Allah, “kelak meeka akan mengetahui (nasib mereka yang buuk),” yakni akibat dosa dan kejahatan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 89: Lalu Allah swt. berfirman: (Maka berpalinglah) artinya palingkanlah dirimu (dari mereka dan katakanlah, \"Salam\") selamat tinggal bagi kalian. Ayat ini diturunkan sebelum diperintah untuk memerangi mereka (Kelak mereka akan mengetahui) ayat ini mengandung ancaman buat mereka; dan dapat dibaca Ya'lamuuna atau Ta'lamuuna, kalau dibaca Ta'lamuuna artinya, kelak kalian akan mengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni maafkanlah gangguan yang datang kepadamu dari mereka baik yang berupa perkataan maupun perbuatan, dan jangan kamu sikapi selain dengan sikap yang dilakukan oleh orang-orang yang berakal dan berpandangan tajam terhadap orang-orang yang bodoh, yaitu sikap salam (selamat tinggal). Maka Beliau shallallahu 'alaihi wa sallam melakukan perintah Tuhannya, dan menyikapi gangguan kaumnya dengan membiarkan dan memaafkan serta tidak membalas selain dengan berbuat ihsan kepada mereka serta ucapan yang baik. Semoga Allah melimpahkan shalawat dan salam kepada Beliau atas kesabarannya. Yakni akibat perbuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 89",
    "description": "Allah menyambut pengaduan nabi Muhammad dengan berfirman, 'maka berpalinglah dari mereka, wahai nabi Muhammad, dan katakanlah kepada mereka, 'salam (selamat tinggal). ' kelak di dunia ini atau di akhirat nanti, mereka akan mengetahui nasib mereka yang buruk, berupa azab yang amat pedih. 1. H' m'm."
  }
]