[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kamu (wahai rasul) bertanya kepada orang-orang musyrik dari kaummu, ”siapa yang mencipatakan langit dan bumi?” niscaya mereka akan menjawab, ”yang menciptakannya adalah Allah yang perkasa dalam kekuasaan-Nya juga maha mengetahui keduanya dan segala seuatu yang ada pada keduanya; tidak ada sesuatupun yang samar bagiNya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Jika kamu -wahai Rasul- bertanya kepada orang-orang musyrik pendusta, “Siapa yang menciptakan langit dan siapa yang menciptakan bumi?” Niscaya mereka akan menjawab pertanyaanmu itu, “Langit dan bumi diciptakan oleh Żat Yang Maha Perkasa, yang tidak ada yang mengalahkan-Nya, dan Maha Mengetahui segala sesuatu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ (Dan sungguh jika kamu tanyakan kepada mereka: “Siapakah yang menciptakan langit dan bumi?”, niscaya mereka akan menjawab: “Semuanya diciptakan oleh Yang Maha Perkasa lagi Maha Mengetahui”) Yakni jika kamu bertanya kepada kaummu yang kafir, siapakah yang menciptakan makhluk-makhluk yang ada di langit dan di bumi? Niscaya mereka akan menyatakan bahwa Allah adalah penciptanya dan tidak akan mengingkari hal itu. mereka tidak mengingkari bahwa hanya Allah saja yang menciptakan alam semesta, tidak seperti orang-orang atheis; namun mereka menyembah orang-orang shalih dan berhala-berhala agar menjadi perantara antara mereka dengan Allah Pencipta alam semesta, dan dakwah Rasulullah adalah untuk menghilangkan perantara-perantara tersebut dan menekankan keesaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Sungguh jika orang-orang kafir dari kaummu itu bertanya: “Siapa yang menciptakan dan membuat langit dan bumi?, sungguh mereka akan mengakui bahwa sang pencipta hanyalah Allah yang Maha Kuat yang tidak mungkin dikalahkan dan Dzat yang Maha Mengetahui segala sesuatu. Beserta pengakuan ini, mereka juga menyembah Allah dan selainNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian menanyakan kepada mereka,“Siapakah yang menciptakan langit dan bumi” Sungguh mereka akan menjawab,“Yang menciptakannya adalah Dzat Yang Maha perkasa lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Allah mengabarkan tentang orang-orang musyrik, bahwa jika engkau bertanya kepada mereka, “siapakah yang menciptakan langit dan bumi?,” niscaya mereka akan menjawab,” hanya Allah semata, yang tidak ada sekutu bagiNya, “yang MahaPerkasa,” yang semua makhluk tunduk kepada keperkasaanNya, “lagi Maha Mengetahui,” semua masalah-masalah zahir dan batin, permulaan dan akhirnya. Bila mereka mengakui hal itu, lantas mengapa mereka menganggap Allah memilki anak, pendamping dan sekutu? Dan bagaimana mereka menyekutukanNya dengan sesuatu yang tidak bisa menciptakan, memberi rizki, mematikan, dan menghidupkan?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Az-Zukhruf ayat 9: (Dan sungguh jika) huruf Lam di sini bermakna Qasam (kamu tanyakan kepada mereka, \"Siapakah yang menciptakan langit dan bumi?\" Niscaya mereka akan menjawab,) dari lafal Layaquulunna terbuang Nun alamat Rafa'nya, karena jika masih ada, maka akan terjadilah huruf Nun yang berturut-turut, dan hal ini dinilai jelek oleh orang-orang Arab. Sebagaimana dibuang pula daripadanya Wawu Dhamir jamak, tetapi 'Illatnya bukan karena bertemunya dua huruf yang disukunkan (\"Semuanya diciptakan oleh Yang Maha Perkasa lagi Maha Mengetahui\") jawaban terakhir mereka adalah, \"Allah Yang Maha Perkasa dan Maha Mengetahuilah yang menciptakan kesemuanya itu.\" Selanjutnya Allah swt. menambahkan:"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan keperkasaan-Nya semua makhluk tunduk kepada-Nya. Dia Maha Mengetahui perkara yang tampak maupun tersembunyi, yang awal maupun yang akhir. Jika mereka mengakui bahwa Allah Subhaanahu wa Ta'aala yang menciptakan langit dan bumi, lalu mengapa mereka menjadikan anak, istri dan sekutu untuk-Nya? Mengapa mereka menyekutukan-Nya dengan sesuatu yang tidak mampu menciptakan dan memberi rezeki, tidak dapat mematikan dan menghidupkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Az-Zukhruf Ayat 9",
    "description": "Dan sesungguhnya mereka sebenarnya menyadari tentang bukti kekuasaan Allah di alam ini, termasuk kekuasaan untuk membinasakan orang-orang yang ingkar terhadap utusan-utusan-Nya. Oleh karena itu, jika kamu menanyakan kepada mereka, 'siapakah yang menciptakan langit yang demikian tinggi dan kukuh itu dengan bintang-bintang yang menghiasinya dan siapa pulakah yang menciptakan bumi yang indah dan terhampar luas dengan segala kenikmatan yang dapat dinikmati'' pastilah mereka secara spontan dan tanpa berpikir panjang akan menjawab, 'semuanya, yakni langit dan bumi dengan segala isi keduanya diciptakan oleh yang mahaperkasa terhadap sesuatu dengan kekuasaan-Nya, maha mengetahui terhadap segala sesuatu yang diciptakan-Nya. '10. Begitu banyak kekuasaan Allah yang ditunjukkan kepada manusia. Di antaranya adalah bahwa dialah yang menjadikan bumi sebagai tempat menetap yang mantap dan nyaman bagimu dan dia pulalah yang menjadikan untukmu jalan-jalan yang banyak di atas bumi yang terhampar luas itu agar kamu mendapat petunjuk untuk menuju ke arah dan tujuan yang kamu inginkan dan untuk menuju ke tempat pembuktian ke-esaan Allah."
  }
]