[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Tha. Ha). Keterangan tentang huruf-huruf yang terpisah-pisah (di awal surat seperti ini) telah berlalu di muka pada permulaan surat al- baqarah. ayat-ayat al-Qur’an ini adalah ayat-ayat alkitab yang mulia yang terang maknanya lagi jelas petunjuknya dalam apa-apa yang terkandung padanya berupa ilmu-ilmu, hokum-hukum dan ajaran-ajaran syariat. Maka al-Qur’an adalah kitab. Allah menyatukan baginya dua nama sekaligus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ṭā Sīn. Pembahasan tentang huruf-huruf seperti ini telah dijelaskan dalam permulaan surah Al-baqarah. Ayat-ayat yang diturunkan kepadamu ini adalah ayat-ayat Al-Qur`ān, yaitu kitab yang jelas lagi nyata, tidak ada kesamaran padanya, barangsiapa yang menghayati dan memperhatikannya, niscaya ia akan yakin bahwa ia berasal dari sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an. Ayat-ayat yang memiliki tujuan yang jauh dan susunan yang indah ini merupakan ayat-ayat al-Qur’an dan kitab yang penuh dengan penjelasan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تِلْكَ ((Surat) ini) Kata tunjuk ini merujuk pada surat ini. ءَايٰتُ الْقُرْءَانِ وَكِتَابٍ مُّبِينٍ (adalah ayat-ayat Al Quran dan Kitab yang menjelaskan) Yang dimaksud dengan (كِتَابٍ مُّبِينٍ) adalah al-Qur’an itu sendiri. Dalam ayat ini disebutkan dua sifat al-Qur’an, yaitu sebagai al-Qur’an (bacaan) yang menunjukkan bahwa ia adalah bacaan berbahasa arab yang mengandung mukjizat, serta sebagai kitab (tulisan) yang menunjukkan bahwa ia tertulis yang disertai penjelasan kandungannya bagi orang yang membacanya, atau maksudnya adalah jelas maknanya dan mukjizatnya kerena mengandung bahasa yang fasih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: surat ini tergolong surat Thawasin yaitu yang Nabi tempatkan pada tempat Zabur, seperti pada surat Asy syuaro. 1. Thaa’, sin sebagai pengingat seperti pada surat-surat sebelumnya. Ayat ini adalah ayat Alquran agung. Kitab yang terdapat berbagai tuntunan agama dan syariat, kebenaran dan kebatilan sebagai petunjuk untuk kebahagiaan manusia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ṭā Sīn. Inilah ayat-ayat Al-Qur’an dan kitab yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1 Allah mengingatkan hamba-hambaNya akan keagungan al-qur’an, dan Dia mengisyaratkan kepada al-qur’an dengan suatu isyarat yang bermakna “ta’zhim,” (pengagungan), seraya berfirman, ”ini adalah ayat-ayat al-qur’an, dan (ayat-ayat) kitab yang menjelaskan,” maksudnya, ia adalah ayat-ayat yang tertinggi, penjelasan-penjelasan yang terkuat dan keterangan-keterangan yang terjelas dan paling nyata tentang harapan-harapan yang paling tinggi, tujuan-tujuan yang paling utama, amal-amal yang terbaik, dan akhlak yang terluhur. Ayat-ayat yang menunjukkan kepada berita-berita yang benar, perintah-perintah yang baik dan larangan dari segala perbuatan jelek dan akhlak (moral) yang tercela. Ayat-ayat yang sampai pada kejelasan dan keterangannya bagi mata hati yang bercahaya sejelas matahari bagi pandangan mata; ayat-ayat yang menunjukkan kepada iman dan mengajak untuk sampai kepada keyakinan, dan ia mengonfirmasikan tentang perkara-perkara ghaib yang telah berlalu dan yang akan datang (sebagaimana) telah terjadi dan akan terjadi; ayat-ayat yang mengajak untuk mengenal Rabb yang Mahaagung dengan nama-namaNya yang sangat baik dan sifat-sifatNya yang tinggi dan perbuatan-perbuatannNya yang sempurna; ayat-ayat yang mengenalkan kepada kita rasul-rasulNya, para waliNya dan sifat-sifat mereka hingga seakan-akan kita melihat mereka dengan pandangan mata kita."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 1: Telah berlalu pembahasan atas huruf muqatha’ah di awal surat Al Baqarah. Kemudian Allah mengisyaratkan kepada ayat yang bahwasanya pada Al Qur’an dan kitab agung ini yang Allah turunkan kepada Nabi-Nya ﷺ pada surat ini dan selainnya adalah ayat-ayat yang jelas dan terang. Allah jelaskan padanya segala urusan hamba dan kemaslahatan bagi mereka di dunia dan amalan mereka yang membawa keberhasilan dengan amalan tersebut untuk meraih ridha Allah beserta surge di akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya akan keagungan Al Qur’an serta memberikan isyarat yang menunjukkan keagungan-Nya. Menjelaskan mana yang hak (benar) dan mana yang batil. Ayat-ayat-Nya adalah ayat yang paling agung, bukti yang paling kuat, dilalah(maksud)nya paling jelas, dan paling menerangkan tuntutan yang diinginkan. Ayat-ayat-Nya menunjukkan berita yang benar, perintah yang baik, dan larangan terhadap perbuatan yang membahayakan serta akhlak tercela, ayat-ayat-Nya dalam hal jelas dan terangnya bagi mata hati ibarat matahari bagi mata kepala, ayat-ayat-Nya menunjukkan kepada keimanan dan mengajak untuk meyakini, serta memberitakan berita-berita yang lalu dan yang akan datang yang akan terjadi sesuai kenyataan. Ayat-ayat yang mengajak untuk mengenal Allah Rabbul ‘alamin dengan nama-nama-Nya yang indah dan sifat-sifat-Nya yang tinggi serta perbuatan-perbuatan-Nya yang sempurna, ayat-ayat yang menerangkan kepada kita para rasul dan wali-Nya serta menyifati mereka seakan-akan kita melihat mereka secara langsung. Namun demikian, banyak manusia di dunia ini yang tidak dapat mengambil manfaat daripadanya, semua yang menentang tidak mendapatkan petunjuk darinya sebagai penjagaan terhadap ayat-ayat ini dari orang yang tidak memiliki kebaikan dan kesalehan serta kebersihan hati. Hanya orang-orang yang diistimewakan Allah dengan iman, dan hati yang bersinar lagi bersih saja yang mendapatkan petunjuk darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 1",
    "description": "'' s'n. Inilah ayat-ayat Al-Qur'an, dan kitab yang jelas, bahwa kitab ini adalah firman Allah dan menjelaskan pesan-pesan Allah kepada manusia. 2. Al-qur'an adalah menjadi petunjuk, pembimbing manusia ke jalan yang lurus dan berita gembira bagi orang-orang yang beriman. Merekalah yang bisa memanfaatkan Al-Qur'an dalam kehidupan mereka. Mereka akan mendapatkan kebahagiaan di dunia dan di akhirat nanti akan masuk surga."
  }
]