[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-12. Kemudian tatkala Musa mendatangi api itu, Allah memanggilnya dan memberitahukan kepadanya bahwa ini adalah suatu tempat yang disucikan Allah dan diberkahi olehNya. Maka Dia menjadikannya sebagai tempat untuk berbicara kepada Musa dan mengangkatnya sebagai rasul. Dan sesungguhnya Allah memberkahi siapa saja yang berada di api itu dan yang ada di sekitarnya dari kalangan malaikat, dan Mahasuci Allah, Penguasa seluruh makhluk dari segala yang tidak pantas bagiNya. “Wahai Musa, sesungguhnya Aku adalah Allah yang berhak diibadahi semata, yang Mahaperkasa Yang Kuasa untuk membalas musuh-musuhKu, juga Mahabijaksana dalam pengaturan makhluk-makhlukKu. Dan lemparkanlah tongkatmu.” Maka ia (musa) melemparkan tongkatnya, lalu berubah menjadi seekor ular. Ketika melihatnya bergerak-gerak dengan mudah seperti rayapan ular yang cepat, Musa berbalik untuk lari, dan tidak kembali kepadanya. Maka Allah menenangkannya dengan FirmanNYa, “Wahai Musa, jangan takut. Sesungguhnya orang yang Aku utus kepada mereka dengan membawa risalahKu tidak takut disisiKu. Akan tetapi, orang yang melewati batas dengan berbuat dosa kemudian bertaubat dan menggantinya dengan taubat yang baik setelah buruknya dosa, sesungguhnya Aku Maha Pengampun baginya lagi Maha penyayang terhadapnya. Maka seseorang tidak boleh berputus asa dari rahmat dan ampunan Allah. Dan masukkanlah tanganmu ke dalam kerah bajumu yang terbuka sampai ke dada, niscaya akan keluar dalam keadaan putih seperti salju, namun bukan karena penyakit kusta. Dua hal tersebut termasuk bagian dari Sembilan mukjizat yaitu tangan, tongkat, paceklk panjang, kekurangn buah-buahan, banjir bandang, belelang, kutu, katak, dan darah untuk menguatkanmu dalam menyampaikan risalah kepada Fir’aun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang telah keluar dari perintah Allah lagi kafir terhadapNya.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan lemparkanlah tongkatmu\". Maka Musa pun melakukannya. Tatkala Musa melihatnya bergerak seperti seekor ular yang gesit, ia lari berbalik ke belakang tanpa menoleh. Allah berfirman kepada Musa, \"Hai Musa! Janganlah kamu takut terhadapnya. Sesungguhnya orang yang dijadikan rasul tidak takut di hadapan-Ku, baik dari ular ataupun lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-12. “Dan lemparlah tongkat yang kamu pegang itu”. Ketika Musa melemparnya dan menyaksikan tongkat itu bergerak dengan lincah seperti ular, maka dia merasa takut dan lari menjauh karena ketakutan. Kemudian Allah menenangkannya dengan menyerunya sekali lagi: “Hai Musa, janganlah kamu takut dari kejadian ini, karena para rasul tidak seharusnya merasa takut saat di hadapan-Ku, karena mereka dalam keamanan. Adapun orang yang menzalimi hamba yang lain kemudian bertaubat dari kezalimannya dan mengganti amal buruknya dengan amal shalih, maka Aku akan mengampuni dan mengasihinya. Dan masukkanlah tanganmu ke dalam lubang bajumu, maka saat kamu keluarkan kembali akan berwarna putih bersinar tapi bukan karena penyakit. Ini merupakan bagian dari sembilan mukjizat; yaitu tongkat, tangan, kekurangan buah-buahan, banjir, diangkatnya musibah, belalang, kutu, katak, dan darah, untuk menghadapi Fir’aun dan kaumnya. Mereka adalah kaum yang berpaling dari ketaatan Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَأَلْقِ عَصَاكَ ۚ (dan lemparkanlah tongkatmu) Maka Musa melempar tongkat itu dari tangannya, kemudian menjadi ular. فَلَمَّا رَءَاهَا تَهْتَزُّ كَأَنَّهَا جَآنٌّ(Maka tatkala (tongkat itu menjadi ular dan) Musa melihatnya bergerak-gerak seperti dia seekor ular yang gesit) Yakni tongkat itu bergerak seperti ular putih yang bergerak lincah. Allah menyerupakannya dengan ular putih karena kelincahan gerakannya. وَلَّىٰ مُدْبِرًا(larilah ia berbalik ke belakang) Karena ketakutan. وَلَمْ يُعَقِّبْ ۚ( tanpa menoleh) Yakni tidak kembali ke belakang. يٰمُوسَىٰ لَا تَخَفْ(Hai Musa, janganlah kamu takut) Maka Allah berfirman: “Hai Musa, janganlah kamu takut dari ular itu atau dari mara bahayanya” إِنِّى لَا يَخَافُ لَدَىَّ الْمُرْسَلُونَ (Sesungguhnya orang yang dijadikan rasul, tidak takut di hadapan-Ku) Yakni orang yang Aku jadikan sebagai Rasul tidak takut di sisi-Ku, maka janganlah kamu takut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. “Lemparkanlah tongkatmu dari tanganmu\". Maka seketika Musa melihatnya bergerak-gerak seperti seekor ular yang gesit. Seketika itu Musa berlari berbalik ke belakang tanpa menoleh karena ketakutan yang amat sangat. Allah berfirman: \"Hai Musa, janganlah kamu takut kepada ular itu. Sesungguhnya orang yang dijadikan rasul itu tidak punya rasa takut terhadap ular atau lainnya. Jangan engkau takut.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lemparkanlah tongkatmu” Ketika itu Musa melihatnya} Musa melihat tongkatnya {bergerak-gerak} bergerak dengan tidak teratur {seperti seekor ular} ular yang ringan dan cepat pergerakannya {dia berlari sambil berbalik ke belakang tanpa menoleh} kembali {“Wahai Musa, jangan takut. Sesungguhnya di hadapanKu para rasul tidak perlu takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10 “dan lemparkanlah tongkatmu,” maka Musa pun melemparkannya. “maka tatkala (tongkat itu menjadi ular dan) Musa melihatnya seakan-akan seekor ular yang gesit,” ular jantan yang gerak nya cepat, “larilah dia ke belakang tanpa menoleh,” karena ketakutan kepada ular yang dia lihat sesuai tuntutan tabi’at manusia. Maka Allah berkata kepadanya, “hai Musa, janganlah kamu takut,” pada ayat yang lain Dia berfirman, “hai Musa, datanglah kepadaKu dan janganlah kamu takut. Sesungguhnya kamu termasuk orang-orang yang aman,” (al-qashash:31) “sesungguhnya Aku, tidaklah orang yang dijadikan rasul takut di hadapanKu,” karena seluruh hal-hal yang menakutkan sudah termuat dalam keputusan dan takdirNya dan pengendalian dan perintahNya. Maka, orang-orang yang telah diistimewakan oleh Allah dengan risalah (kerasulan)Nya dan dipilihNya untuk meneri wahyuNya maka tidak pantas bagi mereka untuk takut pada selain Allah, terutama ketika Allah makin dekat kepada mereka dan selangkah akan berbicara dengannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 10: Allah memerintahkan untuk melemparkan tongkat yang ada di tangannya, maka Musa melakukannya dengan melemparkannya, maka berubahlah menjadi ular yang besar dengan cepat, maka takutlah Musa akan hal itu dengan ketakutan yang sangat, melarikan diri karena sebab ketakutan; Allah kemudian menyerunya kembali dengan menenangkannya, Allah berkata kepadanya : Wahai Musa, jangan engkau takut, tidak semestinya bagi siapa yang terpilih untuk mendakwahkan kerisalahan dari-Ku untuk takut kepada selain dari Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena takut, sesuai tabiat manusia. Hal itu karena semua yang ditakuti di bawah qadha’ dan qadar-Nya serta pengaturan-Nya, oleh karena itu orang-orang yang diberi keistimewaan oleh Allah dengan risalah serta dipilih untuk menerima wahyu-Nya tidak patut takut kepada selain Allah, khususnya ketika bertambah dekat dengan-Nya serta diajak bicara oleh-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 10",
    "description": "Allah ingin membuktikan bahwa diri-Nya adalah Allah, tuhan seluruh alam. Pada saat itu nabi musa memegang tongkat. \"dan lemparkanlah tongkatmu!' nabi musa menuruti perintah Allah dan melemparkan tongkatnya. Maka ketika tongkat itu berubah menjadi ular dan musa melihatnya bergerak-gerak seperti seekor ular yang gesit, nabi musa sangat ketakutan dan larilah dia berbalik ke belakang tanpa menoleh dan tidak kembali lagi ke tempat semula. Saat itu Allah berkata: 'wahai musa! jangan takut terhadap apa yang kamu lihat! sesungguhnya di hadapan-ku, para rasul tidak perlu takut. Mereka tahu bahwa aku tidak akan menistakan mereka, justru aku akan membimbing mereka. 11. Kecuali orang yang berlaku zalim terhadap dirinya dengan melakukan perbuatan dosa yang kemudian mengubah dirinya dengan kebaikan setelah melakukan kejahatan dengan cara bertobat; maka sungguh, aku maha pengampun bagi mereka yang kembali kepada-ku, maha penyayang kepada mereka."
  }
]