[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-12. Kemudian tatkala Musa mendatangi api itu, Allah memanggilnya dan memberitahukan kepadanya bahwa ini adalah suatu tempat yang disucikan Allah dan diberkahi olehNya. Maka Dia menjadikannya sebagai tempat untuk berbicara kepada Musa dan mengangkatnya sebagai rasul. Dan sesungguhnya Allah memberkahi siapa saja yang berada di api itu dan yang ada di sekitarnya dari kalangan malaikat, dan Mahasuci Allah, Penguasa seluruh makhluk dari segala yang tidak pantas bagiNya. “Wahai Musa, sesungguhnya Aku adalah Allah yang berhak diibadahi semata, yang Mahaperkasa Yang Kuasa untuk membalas musuh-musuhKu, juga Mahabijaksana dalam pengaturan makhluk-makhlukKu. Dan lemparkanlah tongkatmu.” Maka ia (musa) melemparkan tongkatnya, lalu berubah menjadi seekor ular. Ketika melihatnya bergerak-gerak dengan mudah seperti rayapan ular yang cepat, Musa berbalik untuk lari, dan tidak kembali kepadanya. Maka Allah menenangkannya dengan FirmanNYa, “Wahai Musa, jangan takut. Sesungguhnya orang yang Aku utus kepada mereka dengan membawa risalahKu tidak takut disisiKu. Akan tetapi, orang yang melewati batas dengan berbuat dosa kemudian bertaubat dan menggantinya dengan taubat yang baik setelah buruknya dosa, sesungguhnya Aku Maha Pengampun baginya lagi Maha penyayang terhadapnya. Maka seseorang tidak boleh berputus asa dari rahmat dan ampunan Allah. Dan masukkanlah tanganmu ke dalam kerah bajumu yang terbuka sampai ke dada, niscaya akan keluar dalam keadaan putih seperti salju, namun bukan karena penyakit kusta. Dua hal tersebut termasuk bagian dari Sembilan mukjizat yaitu tangan, tongkat, paceklk panjang, kekurangn buah-buahan, banjir bandang, belelang, kutu, katak, dan darah untuk menguatkanmu dalam menyampaikan risalah kepada Fir’aun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang telah keluar dari perintah Allah lagi kafir terhadapNya.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Akan tetapi orang yang berlaku zalim terhadap dirinya sendiri dengan melakukan dosa, kemudian ia bertobat setelah itu, maka sungguh Aku Maha Pengampun atas dosa-dosanya, lagi Maha Penyayang terhadapnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِلَّا مَن ظَلَمَ (tetapi orang yang berlaku zalim) Akan tetapi orang yang takut adalah orang yang berbuat dosa. ثُمَّ بَدَّلَ حُسْنًۢا(kenudian melakukan kebaikan) Yakni bertaubat dan menyesali kesalahannya. بَعْدَ سُوٓءٍ(setelah melakukan keburukan) Yakni setelah berbuat dosa. فَإِنِّى غَفُورٌ رَّحِيمٌ (maka seaungguhnya Aku Maha Pangampun lagi Maha Penyayang) Yakni Aku mengampuni orang yang takut terhadap kedudukan-Ku setelah ia melakukan dosa. Ayat ini mengandung sindiran halus bagi Musa yang telah membunuh orang Mesir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Namun jika mereka yang takut adalah mereka yang berbuat dan berlaku zalim kepada diri mereka sendiri atau orang lain serta berbuat maksiat. Kemudian bertaubat dari dosa-dosanya, serta berbuat kebaikan untuk menggantikan perbuatan buruknya maka Allah akan mengampuninya. Maka seaungguhnya Aku Maha Pangampun lagi Maha Penyayang bagi orang yang bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang yang berbuat zalim} selain orang yang menzalimi diri sendiri dengan berbuat maksiat {yang kemudian mengganti keburukannya} kesalahan {dengan kebaikan} diikuti dengan taubat dan penyesalan {Sesungguhnya Aku Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11 “tetapi orang yang berlaku zhalim, kemudian menukar kezhalimannya dengan kebaikan (Allah akan mengampuninya),” maksudnya, inilah tempat (dimana dia layak) takut dan kesepian, disebabkan dia telah terlanjur melakukan kezhaliman dan telah melakukan perbuatan dosa. Adapun para rasul, maka mereka sama sekali tidak layak mempunyai rasa kesepian dan rasa takut. Tetapi, sekalipun demikian, siapa saja yang telah terlanjur berbuat zhalim terhadap diri sendiri dengan bermaksiat kepada Allah, lalu dia bertaubat dan kembali kepadaNYa, lalu dia mengganti perbuatan maksiatnya itu dengan kebajikan-kebajikan, dan kemaksiatan-kemaksiatannya dengan ketaatan-ketaatan, karena sesungguhnya Allah Mahapengampun lagi Mahapenyayang, maka jangan ada seorang pun yang berputus asa drai rahmat dan ampunanNya, karena sesungguhnya Dia selalu mengampuni dosa-dosa semuanya, dan Dia lebih sayang kepada hamba-hambaNYa draipada seorang ibu terhadap anaknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 11: Kemudian Allah mengecualikan dan menjelaskan bahwa siapa yang menerobos aturan Allah serta terjatuh dalam kedzaliman kemudian bertaubat kepada Allah setelah kedzaliman yang dia lakukan dengan taubat nasuha, ia mengganti keburukan dengan kebaikan; Maka sungguh Allah menerima taubatnya dan menerima kesalahanya; Karena Dia adalah maha pengampun yang mengampuni segala dosa, dan maha menyayangi yang luas kasih sayang-Nya atas segala sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah letak yang perlu ditakuti karena telah melakukan kezaliman dan karena dosa yang pernah dilakukannya. Adapun para rasul, maka mereka tidak perlu takut dan khawatir. Di samping itu, sapa saja yang menzalimi dirinya dengan berbuat maksiat, lalu Dia bertobat dan kembali kepada-Nya, ia pun merubah keburukannya dengan kebaikan dan maksiatnya dengan taat, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang. Oleh karena itu, jangan ada seorang pun yang berputus asa dari rahmat dan ampunan-Nya, karena Dia mengampuni semua dosa, dan Dia lebih sayang daripada seorang ibu terhadap anaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 11",
    "description": "Kecuali orang yang berlaku zalim terhadap dirinya dengan melakukan perbuatan dosa yang kemudian mengubah dirinya dengan kebaikan setelah melakukan kejahatan dengan cara bertobat; maka sungguh, aku maha pengampun bagi mereka yang kembali kepada-ku, maha penyayang kepada mereka. 12. Allah ingin memperlihatkan bukti lain akan kemahakuasaan-Nya. Dan masukkanlah tanganmu ke leher bajumu, niscaya ia, tanganmu itu, akan keluar menjadi putih bersinar berkilauan tanpa cacat. Nabi musa pun menuruti perintah itu, dan terbukti benar apa yang dikatakan Allah. Kedua mukjizat ini termasuk sembilan macam mukjizat yang diperlihatkan kepada fir'aun dan kaumnya. Kesembilan mukjizat itu ialah: tongkat dan tangan nabi musa, berkurangnya hasil tanaman, banjir, belalang, kutu, katak, dan darah. Tapi semua itu tidak berarti bagi mereka. Mereka benar-benar orang-orang yang fasik yang telah keluar dari aturan-aturan agama."
  }
]