[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-12. Kemudian tatkala Musa mendatangi api itu, Allah memanggilnya dan memberitahukan kepadanya bahwa ini adalah suatu tempat yang disucikan Allah dan diberkahi olehNya. Maka Dia menjadikannya sebagai tempat untuk berbicara kepada Musa dan mengangkatnya sebagai rasul. Dan sesungguhnya Allah memberkahi siapa saja yang berada di api itu dan yang ada di sekitarnya dari kalangan malaikat, dan Mahasuci Allah, Penguasa seluruh makhluk dari segala yang tidak pantas bagiNya. “Wahai Musa, sesungguhnya Aku adalah Allah yang berhak diibadahi semata, yang Mahaperkasa Yang Kuasa untuk membalas musuh-musuhKu, juga Mahabijaksana dalam pengaturan makhluk-makhlukKu. Dan lemparkanlah tongkatmu.” Maka ia (musa) melemparkan tongkatnya, lalu berubah menjadi seekor ular. Ketika melihatnya bergerak-gerak dengan mudah seperti rayapan ular yang cepat, Musa berbalik untuk lari, dan tidak kembali kepadanya. Maka Allah menenangkannya dengan FirmanNYa, “Wahai Musa, jangan takut. Sesungguhnya orang yang Aku utus kepada mereka dengan membawa risalahKu tidak takut disisiKu. Akan tetapi, orang yang melewati batas dengan berbuat dosa kemudian bertaubat dan menggantinya dengan taubat yang baik setelah buruknya dosa, sesungguhnya Aku Maha Pengampun baginya lagi Maha penyayang terhadapnya. Maka seseorang tidak boleh berputus asa dari rahmat dan ampunan Allah. Dan masukkanlah tanganmu ke dalam kerah bajumu yang terbuka sampai ke dada, niscaya akan keluar dalam keadaan putih seperti salju, namun bukan karena penyakit kusta. Dua hal tersebut termasuk bagian dari Sembilan mukjizat yaitu tangan, tongkat, paceklk panjang, kekurangn buah-buahan, banjir bandang, belelang, kutu, katak, dan darah untuk menguatkanmu dalam menyampaikan risalah kepada Fir’aun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang telah keluar dari perintah Allah lagi kafir terhadapNya.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan masukkanlah tanganmu ke bajumu di bawah leher, niscaya ketika keluar ia akan menjadi putih seperti salju, bukan putih pucat karena penyakit. Mukjizat ini termasuk dalam sembilan mukjizat yang membuktikan kebenaranmu di hadapan Fir'aun dan kaumnya -yaitu (beserta mukjizat tangan) berupa tongkat, tahun-tahun yang kering, kekurangan buah-buahan, angin topan, belalang, kutu, katak, dan darah-. Sesungguhnya mereka adalah kaum yang menyimpang dari ketaatan kepada Allah dengan berbuat kekafiran terhadap-Nya\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَأَدْخِلْ يَدَكَ فِى جَيْبِكَ (Dan masukkanlah tanganmu ke leher bajumu) Makna (الجيب) adalah lubang baju tempat memasukkan kepala. تَخْرُجْ بَيْضَآءَ مِنْ غَيْرِ سُوٓءٍ ۖ( niscaya ia akan ke luar putih (bersinar) bukan karena penyakit) Yakni bukan karena penyakit kusta atau penyakit lainnya. Maka Musa memasukkan tangannya, dan ketika ia mengeluarkannya ternyata tangannya mengeluarkan cahaya seperti petir. فِى تِسْعِ ءَايٰتٍ((Kedua mukjizat ini) termasuk sembilan buah mukjizat) Maknanya adalah dua mukjizat ini termasuk dari sembilan mukjizat, yaitu tongkat dan tangan, dan sisanya adalah banjir bandang, belalang, kutu, katak, darah, kutukan, dan kekeringan dan paceklik yang terjadi di perkampungan Bani Israil. إِلَىٰ فِرْعَوْنَ وَقَوْمِهِۦٓ ۚ( (yang akan dikemukakan) kepada Fir’aun dan kaumnya) Yakni kamu diutus dengan mukjizat-mukjizat itu kepada Fir’aun dan kaumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Masukkanlah tanganmu ke leher bajumu, niscaya ia akan mengeluarkan kemilau putih (bersinar) yang berlawanan dengan warna kulitnya. Bukan karena penyakit lepra atau semisalnya. Kedua mukjizat ini termasuk sembilan buah mukjizat antara lain: menghilangkan harta, menormalkan hati, belalang, kutu, merubah air menjadi darah, katak, angin topan atau hujan lebat, mengurangi buah-buahan. Itu ditunjukkan kepada Fir’aun untuk diseru kepada iman kepada Allah sebagai Tuhan Yang Maha Esa tidak ada sekutu baginya. Juga untuk mentaati perintah-Nya. Sesungguhnya mereka adalah kaum yang keluar dari ketaatan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masukkanlah tanganmu ke sakumu}saku bajumu {tangan itu akan keluar dalam keadaan putih tanpa cacat} tanpa cacat dan tidak berpenyakit {itu termasuk sembilan macam mukjizat (yang ditunjukkan) kepada Fir‘aun dan kaumnya. Sesungguhnya mereka benar-benar kaum yang fasik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12 “dan masukanlah tanganmu ke leher bajumu, niscaya dia akan keluar putih (bercahaya) bukan karena penyakit,” bukan sopak dan juga bukan karena kekurangan, bahkan ia putih yang cahayanya mengagumkan orang-orang yang memandangnya, “(kedua mukjizat ini) termasuk Sembilan buah mukjizat (yang akan dikemukakan) kepada fir’aun dan kaumnya,” maksudnya, dua mukjizat ini (berubahnya tongkat menjadi seekor ular besar dan keluarnya tangan dari dalam leher baju putih bersinar) termasuk dalam Sembilan mukjizat yang kamu gunakan untuk menyeru fir’aun dan kaumnya dengannya. “sesungguhnya mereka adalah kaum yang fasik,” mereka fasik karena kesyirikan mereka, kecongkakan, dan kesemena-menaan mereka terhadap hamba-hamba Allah dan kesombongan mereka di muka bumi ini dengan tidak benar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 12: Kemudian Allah memberikan kepada Musa mukjizat yang kedua, yang menjadikannya dan menujuki bahwa dirinya adalah benar utusan Allah, Allah berkata kepadanya : Masukkan tanganmu ke dalam celah bajumu yang dekat dengan dadamu, kemudian keluarkan tanganmu, maka engkau akan mendapatinya berwarna putih yang murni tanpa penyakit lepra dan tanpa cacat padanya; Bahkan akan menjadikan kagum (pesona) bagi mereka yang melihat sehingga engkau dapat mengambil hati mereka, itulah kandungan dari sembilan ayat yang Kami berikan kepada mereka, dan mengokohkan engkau dengan ayat tersebut, untuk engkau menyeru fir’aun dan kaumnya untuk beribadah kepada Allah saja tanpa menyekutukan-Nya, sungguh fir’aun dan kaumnya, mereka adalah orang-orang yang keluar dari ketaatan kepada Allah dan tauhid, ia adalah orang-orang yang tetap dalam kesyirikan dan menjadikan sekutu-sekutu selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bukan karena sopak atau kekurangan, bahkan putih bersinar yang menyilaukan orang-orang yang melihatnya. Untuk membuktikan kebenaran Nabi Musa ‘alaihis salam dan seruannya. Mereka menjadi fasik karena syirk mereka, melampaui batas dan bersikap sombong terhadap hamba-hamba Allah. Maka Nabi Musa ‘alaihis salam pergi menghadap Fir’aun dan para pemukanya, mengajak mereka kepada Allah dan memperlihatkan ayat-ayat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 12",
    "description": "Allah ingin memperlihatkan bukti lain akan kemahakuasaan-Nya. Dan masukkanlah tanganmu ke leher bajumu, niscaya ia, tanganmu itu, akan keluar menjadi putih bersinar berkilauan tanpa cacat. Nabi musa pun menuruti perintah itu, dan terbukti benar apa yang dikatakan Allah. Kedua mukjizat ini termasuk sembilan macam mukjizat yang diperlihatkan kepada fir'aun dan kaumnya. Kesembilan mukjizat itu ialah: tongkat dan tangan nabi musa, berkurangnya hasil tanaman, banjir, belalang, kutu, katak, dan darah. Tapi semua itu tidak berarti bagi mereka. Mereka benar-benar orang-orang yang fasik yang telah keluar dari aturan-aturan agama. 13. Banyaknya kemukjizatan nabi musa tidak menyebabkan mereka sadar akan kekeliruan mereka, malah mereka bertambah angkuh dan sombong. Maka ketika mukjizat-Mukjizat kami yang terang benderang dan tidak terbantahkan itu sampai kepada mereka, yaitu fir'aun dan pengikutnya, mereka berkata dengan nada sinis dan mengejek, 'ini sihir yang nyata. ' mereka berkata demikian karena perilaku sihir sudah menjadi bagian dari kehidupan mereka saat itu."
  }
]