[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tatkala mukjizat-mukjizat tersebut telah datang kepada mereka dengan nyata lagi jelas yang dengan itu orang-orang yang menyaksikannya dapat mengetahui kebenaran kandungan yang ditunjukkan oleh mukjizat-mukjizat tersebut, mereka berkata, “Ini adalah sihir yang nyata lagi jelas.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Maka tatkala mukjizat-mukjizat Kami itu sampai kepada mereka dalam keadaan jelas nan nyata, mereka berkata, \"Apa yang dibawa oleh Musa berupa mukjizat-mukjizat ini hanyalah sihir yang nyata\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Ketika sembilan mukjizat dan lainnya didatangkan kepada Fir’aun dan kaumnya -dan mereka telah melihatnya dengan mata kepala mereka-, mereka menuduh Musa melakukan sihir, dan mengatakan bahwa mukjizat-mukjizat itu jelas adalah sihir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَلَمَّا جَآءَتْهُمْ ءَايٰتُنَا مُبْصِرَةً (Maka tatkala mukjizat-mukjizat Kami yang jelas itu sampai kepada mereka) Yakni setelah sampai kepada mereka mukjizat-mukjizat Kami yang sangat jelas yang menunjukkan kebenaran kenabian Musa, karena begitu jelasnya seakan-akan mukjizat itu tampak dengan sendirinya. Pendapat lain mengatakan maknanya adalah karena ia sangat jelas sehingga ia terlihat dengan baik. قَالُوا۟ هٰذَا سِحْرٌ مُّبِينٌ(berkatalah mereka: “Ini adalah sihir yang nyata”) Mereka mengaku bahwa mukjizat itu adalah sihir merupakan hal yang sangat jelas bagi mereka dan mengaku mereka sangat yakni bahwa itu adalah sihir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Maka tatkala sembilan mukjizat-mukjizat itu Kami tunjukkan kepada Fir’aun dan kaumnya yang menjelaskan kebenaran kenabiannya, berkatalah mereka: \"Ini adalah sihir yang nyata\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mukjizat-mukjizat Kami yang terang} yang tampak jelas {sampai kepada mereka, mereka berkata,“Ini adalah sihir yang nyata”} yang terlihat nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13 maka Musa berangkat menuju fir’aun dan para pembesarnya, lalu mengajak mereka kepada Allah dan dia memperlihatkan kepada mereka mukjizat-mukjizat tersebut, “maka tatkala mukjizat-mukjizat kami itu sampai kepada mereka dengan jelas,” (yaitu) dengan terang yang membuktikan kebenaran dan dengannya kebenaran menjadi sangat jelas sebagimana pandangan mata melihat jelas matahari, “berkatalah mereka,’ini adalah sihir yang nyata’.” Tidak cukup bagi mereka sekedar mengatakan bahwa itu adalah sihir, bahkan mereka mengatakan, “yang sangat nyata lagi jelas bagi setiap orang!” ini merupakan hal yang paling mengherankan! Bukti-bukti (mukjizat-mukjizat) yang sangat jelas dan mengungkap kebenaran dianggap kejanggalan yang paling besar dan sihir yang paling nyata. Tidaklah ini melainkan sikap kecongkakan dan alasan yang paling tidak tahu malu!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 13: Allah mengabarkan bahwa Musa mentaati perintah Tuhannya, ia keluar untuk menyeru fir’aun dan kaumnya, mereka semua menolak ayat-ayat yang jelas, yang benar akan kejujurannya, dan bahwasanya Musa adalah rasul dari sisi Allah. Tidaklah fir’aun dan kaumnya kecuali menolak dan sombong serta melampau batas, sungguh sulit baginya meninggalkan kesombongan dan keputusan mereka, mereka berkata : Apa yang datang kepada kami ini wahai Musa, kecuali hanyalah sihir yang nayata bagi siapapun yang melihat, tidak ada keraguan bagi kami dan juga kerancuan akan hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sungguh aneh sikap mereka, ayat-ayat yang begitu jelas itu dianggap sebagai permainan sihir. Hal ini tidak lain karena kesombongan yang besar dalam diri mereka dan memutarbalikkan fakta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 13",
    "description": "Banyaknya kemukjizatan nabi musa tidak menyebabkan mereka sadar akan kekeliruan mereka, malah mereka bertambah angkuh dan sombong. Maka ketika mukjizat-Mukjizat kami yang terang benderang dan tidak terbantahkan itu sampai kepada mereka, yaitu fir'aun dan pengikutnya, mereka berkata dengan nada sinis dan mengejek, 'ini sihir yang nyata. ' mereka berkata demikian karena perilaku sihir sudah menjadi bagian dari kehidupan mereka saat itu. 14. Allah mengungkapkan jati diri mereka yang sebenarnya. Dan mereka mengingkarinya, yakni bukti-bukti kebenaran nabi musa, karena kezaliman dan kesombongannya dengan tidak mau mengakui bukti-bukti tersebut, padahal hati mereka meyakini kebenaran-Nya. Maka perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan. Mereka pasti akan terkena sanksi berat dari Allah."
  }
]