[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan firaun beserta kaumnya mendustakan mukjizat-mukjizat yang berjumlah Sembilan yang nyata petunjuknya tentang kebenaran Musa dalam pengakuan kenabian dan kebenaran dakwahnya. Dan mereka itu mengingkari bahwa itu semua dari sisi Allah dengan lisan-lisan mereka, padahal sesungguhnya mereka meyakininya dalam hati mereka, sebagai bentuk penentangan terhadap kebenaran lagi sikap arogan untuk mengakui. Maka lihatlah (wahai Rasul), bagaimana kesudahan orang-orang yang kafir kepada ayat-ayat Allah dan melakukan perbuatan kerusakan di muka bumi, yaitu ketika Allah menenggelamkan mereka di dalam laut?. Dan dalam kejadian tersebut terdapat pelajaran bagi orang yang mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Dan mereka pun mengingkari adanya mukjizat-mukjizat yang nyata ini dan sama sekali tidak mengakuinya, padahal hati mereka meyakini kebenarannya dari sisi Allah; ini dikarenakan kezaliman dan kesombongan mereka terhadap kebenaran. Maka perhatikanlah -wahai Rasul- bagaimana kesudahan orang-orang yang berbuat kebinasaan dimuka bumi ini dengan berbagai kekafiran dan maksiat mereka, sungguh Kami telah binasakan dan hancurkan mereka seluruhnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Mereka mendustakan mukjizat-mukjizat yang jelas itu padahal hati mereka yakin bahwa itu benar-benar datang dari Allah, akhibat permusuhan dan kesombongan mereka terhadap orang-orang beriman. Hai Rasulullah, lihatlah bagaimana kesudahan orang-orang yang berdosa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَجَحَدُوا۟ بِهَا وَاسْتَيْقَنَتْهَآ أَنفُسُهُمْ (Dan mereka mengingkarinya padahal hati mereka meyakini (kebenaran)nya) Mereka mendustakannya padahal mereka meyakini kebenarannya. ظُلْمًا وَعُلُوًّا ۚ( karena kezaliman dan kesombongan (mereka)) Yakni kerena keangkuhan mereka untuk beriman kepada apa yang dibawa oleh Musa padahal mereka mengetahui bahwa itu berasal dari Allah. فَانظُرْ(Maka perhatikanlah) Hai Muhammad. كَيْفَ كَانَ عٰقِبَةُ الْمُفْسِدِينَ (betapa kesudahan orang-orang yang berbuat kebinasaa) Yakni fikirkanlah hal itu, karena didalamnya terkandung pelajaran bagi orang-orang yang mau mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Mereka mengingkarinya karena kezaliman terhadap diri mereka sendiri dengan kesyirikan dan kesombongan untuk tidak mengimani mukjizat Musa. Maka perhatikanlah wahai Nabi, betapa mengerikannya akibat yang diterima orang-orang yang berbuat kerusakan di bumi yang membangkang risalah Musa yaitu dengan dibenamkan di dunia dan dibakar di akhirat.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka mengingkarinya} mendustakan ayat-ayat itu dan tidak mengakuinya {karena kezaliman dan keangkuhan} dan kesombongan {sedangkan diri mereka meyakininya} diri mereka mengetahui bahwa itu adalah kebenaran dari sisi Allah {Perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14 “dan mereka mengingkarinya,” maksudnya, mereka mengingkari dan tidak mempercayai ayat-ayat Allah itu (mukjizat), “padahal hati mereka meyakini (kebenaran) nya,” maksudnya, pengingkaran dan ketidakpercayaan mereka terhadapnya tidak berdasar pada keraguan dan kebimbingan, melainkan sebenarnya pengingkaran mereka itu disertai dengan rasa tahu dan yakin kepada kebenaran mukjizat-mukjizat tersebut, (hal itu) “karena kezhaliman,” dari mereka terhadap hak Allah dan terhadap diri mereka sendiri, “dan karena kesombongan,” terhadap kebenaran, terhadap manusia dan terhadap sikap patuh kepada para rasul. “maka perhatikanlah bagaimana kesudahan orang-orang yang berbuat kebinasaan,” yaitu seburuk-buruk kesudahan; mereka dibinasakan oleh Allah dan ditenggelamkan di lautan. Allah menjadikan mereka hina dan mewariskan tempat-tempat tinggal mereka kepada rakyat yang tertindas dari hamba-hambaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 14: Setelah Musa datang dengan membawa mukjizat-mukjizat yang menunjukkan atas kebenaran dan keselamatan kenabiannya; Mereka menolak (fir’aun dan kaumnya) dan mendustakannya, dengan berkata : Ini adalah sihir yang nyata; (Meskipun) dengan keyakinan mereka yang yakin bahwa itu adalah dari sisi Allah, akan tetapi mereka mendustakannya dengan dzalim, merasa tinggi dan sombong atas kebenaran. Maka lihatlah wahai Nabi Allah, bagaimana tempat kembali orang-orang pendosa ini, yang mendustakan Allah, ayat-ayat-Nya dan para utusan Allah. Sungguh akhir dari mereka bahwasanya Allah akan menenggelamkan mereka di lautan bersama dengan tentara-tentara mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik kepada hak Tuhan mereka maupun kepada diri mereka. Terhadap kebenaran, terhadap para hamba, dan dari tunduk kepada para rasul. Bahwa mukjizat itu berasal dari sisi Allah. Mereka mengingkari bukan karena masih ragu-ragu, tetapi atas dasar yakin terhadap kebenarannya. Allah membinasakan mereka, menenggelamkan mereka ke dalam laut dan menghinakan mereka serta mewariskan tempat tinggal mereka kepada hamba-hamba-Nya yang lemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 14",
    "description": "Allah mengungkapkan jati diri mereka yang sebenarnya. Dan mereka mengingkarinya, yakni bukti-bukti kebenaran nabi musa, karena kezaliman dan kesombongannya dengan tidak mau mengakui bukti-bukti tersebut, padahal hati mereka meyakini kebenaran-Nya. Maka perhatikanlah bagaimana kesudahan orang-orang yang berbuat kerusakan. Mereka pasti akan terkena sanksi berat dari Allah. 15. Setelah menjelaskan kisah nabi musa dan fir'aun, Allah menjelaskan kisah nabi daud (1085 sm-1000 sm) dan nabi sulaiman (1043 sm-975 sm), untuk menghibur nabi Muhammad saw. Dan sungguh, kami telah memberikan anugerah yang besar yaitu ilmu baik ilmu keagamaan atau keduniaan, kepada dawud dan puteranya sulaiman. Dan sebagai ungkapan rasa syukur kepada Allah atas semua nikmat-Nya, keduanya berkata dengan kerendahan hati, 'segala puji bagi Allah yang melebihkan kami dari banyak hamba-hamba-Nya yang beriman. ' keduanya, di samping menjadi nabi, suatu kedudukan tertinggi dalam martabat keagamaan, juga menjadi raja, sebuah kedudukan tertinggi dalam jabatan kemanusiaan."
  }
]