[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menganugerahkan ilmu kepada Dawud dan Sulaiman, lalu mereka berdua mengamalkannya dan berkata, “Segala puji bagi Allah yang telah mengutamakan kami dengan ilmu ini atas kebanyakan dari hambaNya yang beriman.” Pada ayat ini terdapat dalil petunjuk akan kemuliaan ilmu dan ketinggian martabat ahli ilmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dan sesungguhnya Kami telah menganugerahkan ilmu kepada Daud dan putranya Sulaiman, di antaranya pemahaman terhadap bahasa burung, dan keduanya mengucapkan ungkapan rasa syukur kepada Allah, \"Segala puji bagi Allah yang melebihkan kami dari kebanyakan hamba-hamba-Nya yang beriman dengan menganugerahkan kami darajat kenabian, dan menjadikan jin dan setan tunduk kepada kami \"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Sungguh Kami telah memberi Daud dan Sulaiman ilmu yang luas dari ilmu dunia dan akhirat. Mereka berdua berkata: “Segala puji bagi Allah yang telah memuliakan kami dengan ilmu dan dengan kerajaan di atas hamba-hamba-Nya yang lain yang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَلَقَدْ ءَاتَيْنَا دَاوُۥدَ وَسُلَيْمٰنَ عِلْمًا ۖ (Dan sesungguhnya Kami telah memberi ilmu kepada Daud dan Sulaiman) Yakni ilmu yang banyak. وَقَالَا الْحَمْدُ لِلّٰهِ(dan keduanya mengucapkan: “Segala puji bagi Allah) Yakni maka mereka berdua mengamalkan ilmu mereka, kemudian mereka berkata “alhamdulillah.” الَّذِى فَضَّلَنَا عَلَىٰ كَثِيرٍ مِّنْ عِبَادِهِ الْمُؤْمِنِينَ(yang melebihkan kami dari kebanyakan hamba-hambanya yang beriman”) Yakni dengan ilmu dan kenabian, serta menundukkan bagi mereka burung, jin, dan manusia. Namun mereka berdua tidak merasa lebih mulia dari mereka semua karena kerendahan hati keduanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini menunjukkan keutamaan Ilmu di atas segala kenikmatan Dunia. As-Subki mengatakan: Allah ta'ala mendatangkan kepada Daud dan Sulaiman berbagai kenikmatan Dunia dan akirat yang mana kenikmatan itu tidak akan habis, dan dalam ayat ini Allah tidak mengecualikan nikmat Ilmu; hal itu menunjukkan bahwa pada hakikatnya Daud dan Sulaiman hidup dalam limpahan nikmat yang begitu banyak. Maka wahai kalian yang dikaruniai oleh Allah nikmat melalui jalan-jalan menuntut ilmu, ketahuilah bahwa kemuliaan kalian masih melebihi kaum-kaum yang ada, maka senantiasa lah bersyukur kepada Allah atas nikmat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya Kami telah memberi ilmu yang banyak kepada Daud dan Sulaiman yaitu ilmu syariat, memutuskan permasalahan antara manusia, berbicara dengan burung dan lainnya. Kemudian dia memuji dan bersyukur atas keutamaan itu; dan keduanya mengucapkan: \"Segala puji bagi Allah yang melebihkan kami dari kebanyakan hamba-hambanya yang beriman\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar telah menganugerahkan} memberi {ilmu kepada Dawud dan Sulaiman. Keduanya berkata,“Segala puji bagi Allah yang melebihkan kami daripada kebanyakan hamba-hambaNya yang mukmin”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15 Allah mengingatkan di dalam al-qur’an ini dan memuji karuniaNya kepada Dawud dan putranya, sulaiman yaitu berupa ilmu pengetahuan yang luas lagi banyak, dengan bukti (ungkapan) nakirah, sebagimana Allah berfirman, “dan (ingatlah kisah) Dawud dan sulaiman, di waktu keduanya memberikan keputusan mengenai tanaman, karena tanaman itu dirusak oleh kambing-kambing kepunyaan kaumnya. Dan kami menyaksikan keputusan yang diberikan oleh mereka itu, maka kami telah memberikan pengertian kepada sulaiman tentang hukum (yang lebih tepat), dan kepada masing-masing mereka telah kami berikan hikmah dan ilmu,” (al-anbiya:78-79) Dan keduanya pun berkata seraya bersyukur kepada tuhannya atas karuniaNya yang sangat besar, yaitu atas pengajaran untuk keduanya, “segala puji bagi Allah yang melebihkan kami dari kebanyakan hamba-hambaNya yang beriman,” maka keduanya memuji Allah karena telah menjadikan keduanya termasuk orang-orang yang beriman, manusia yang mendapat kebahagiaan, dan mereka adalah orang-orang yang special. Sudah tidak ragu lagi bahwa orang-orang yang beriman itu ada empat derajat, yaitu orang-orang shalih, lalu di atasnya adalah para syuhad’, dan di atasnya lagi adalah para shidiqqin dan yang plaing atas adalah para nabi. Dawud dan sulaiman adalah termasuk dalam kategori elitnya para rasul, sekalipun mereka masih berada di bawah derajat (tingkatan) ulul azmi yang berjumlah lima rasul. Akan tetapi mereka tetap termasuk golongan para rasul yang paling utama lagi mulia; yaitu mereka yang dipuji oleh Allah di dalam al-qur’an dengan pujian yang amat besar. Maka dari itu mereka memuji Allah atas kedudukan yang mereka capai ini. Ini adalah tanda kebahagiaan seorang hamba, yaitu dia bersyukur kepada Allah atas berbagai nimatNya yang bersifat religi dan duniawi, dan kalau dia melihat (merasakan) bahwa seluruh nikmat adalah berasal dari Rabbnya, maka dia tidak akan berbangga diri karenanya dan tidak menjadi sombong dengannya, bahkan dia melihat bahwa kenimatan-kenikmatan tersebut sangat berhak untuk disyukuri sebanyak-banyaknya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 15: Allah mengabarkan Dia telah memberikan kepada Nabi-Nya Dawud dan anaknya (Sulaiman) ilmu yang banyak serta hikmat dan kekuasaan, maka mereka berdua amalkan ilmu tersebut dan memuji kepada Allah dengan rasa syukur atas pemuliaan-Nya dan karunia bagi keduanya atas para makhluk di zaman mereka berdua. Ayat ini menunjukkan atas kemulian ilmu dan tingginya kedudukan pemiliknya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ilmu yang banyak berdasarkan bentuk nakirah (umum) pada lafaz “ ‘ilmaa ”, seperti ilmu qadha’ (cara menyelesaikan masalah dengan tepat), dan lain-lain. Sebagai tanda syukurnya kepada Allah atas nikmat yang besar itu. Keduanya memuji Allah karena menjadikan mereka berdua sebagai orang-orang mukmin, orang-orang yang berbahagia dan termasuk orang-orang yang diistimewakan. Perlu diketahui, bahwa kaum mukmin ada empat tingkatan: - Orang-orang saleh, - Para syuhada’ - Para shiddiqin - Para nabi dan rasul Adapun Dawud dan Sulaiman termasuk rasul-rasul pilihan, meskipun derajat mereka di bawah para rasul ulul ‘azmi, akan tetapi mereka berdua termasuk rasul-rasul yang mulia yang Allah tinggikan nama mereka dan Allah puji mereka dengan pujian yang besar. Mereka memuji Allah karena mencapai derajat yang tinggi tersebut, dan ini merupakan tanda kebahagiaan seorang hamba, yaitu bersyukur kepada Allah atas nikmat agama dan dunia yang diperoleh dan melihat bahwa semua nikmat itu berasal dari Tuhannya, sehingga dia tidak sombong dan ujub dengannya, bahkan dia melihat bahwa nikmat itu berhak disyukuri. Ketika kedua nabi itu dipuji Allah secara bersamaan, maka Allah mengkhususkan Nabi Sulaiman dengan keistimewaannya, yaitu diberi Allah kerajaan yang besar dan terjadi padanya beberapa kejadian yang tidak dialami bapaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 15",
    "description": "Setelah menjelaskan kisah nabi musa dan fir'aun, Allah menjelaskan kisah nabi daud (1085 sm-1000 sm) dan nabi sulaiman (1043 sm-975 sm), untuk menghibur nabi Muhammad saw. Dan sungguh, kami telah memberikan anugerah yang besar yaitu ilmu baik ilmu keagamaan atau keduniaan, kepada dawud dan puteranya sulaiman. Dan sebagai ungkapan rasa syukur kepada Allah atas semua nikmat-Nya, keduanya berkata dengan kerendahan hati, 'segala puji bagi Allah yang melebihkan kami dari banyak hamba-hamba-Nya yang beriman. ' keduanya, di samping menjadi nabi, suatu kedudukan tertinggi dalam martabat keagamaan, juga menjadi raja, sebuah kedudukan tertinggi dalam jabatan kemanusiaan. 16. Dan sebagai penghargaan Allah kepada nabi daud atas kepatuhan dan syukurnya kepada Allah, sulaiman telah mewarisi ayahnya yaitu dawud dalam hal kenabian dan kekuasaan, dan dia, sulaiman, berkata, 'wahai manusia! kami telah diajari oleh Allah bahasa burung dan kami diberi segala sesuatu yang kami butuhkan dalam mengurus umat dan kerajaan kami. Sungguh, semua ini benar-benar karunia yang nyata. ' perilaku kedua nabi ini menjadi pelajaran yang sangat berarti bagi kaum muslimin."
  }
]