[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dihimpunkan bagi Sulaiman bala tentaranya dari bangsa jin dan manusia serta burung dalam suatu perjalanan mereka. Mereka itu meskipun berjumlah banyak, mereka tidak terabaikan. Akan tetapi, setiap jenis makhluk memiliki pihak yang mengatur barisan pertama hingga barisan terakhir, agar mereka berdiri semua dengan rapi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan dihimpunkan untuk Sulaiman bala tentaranya dari kalangan jin, manusia dan burung-burung, lalu mereka itu digiring dengan tertib dalam barisan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَحُشِرَ لِسُلَيْمٰنَ جُنُودُهُۥ مِنَ الْجِنِّ وَالْإِنسِ وَالطَّيْرِ (Dan dihimpunkan untuk Sulaiman tentaranya dari jin, manusia dan burung) Yakni Allah mengumpulkan bala tentara Nabi Sulaiman dari jenis-jenis tersebut. فهم يوزعون (lalu mereka itu diatur dengan tertib (dalam barisan)) Makna (الوازع) adalah orang yang ditugaskan untuk mengatur barisan pasukan, ia meluruskan pasukannya yang belum meluruskan barisan agar barisannya rapi dan teratur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Dan dihimpunkan untuk Sulaiman tentara dari bangsa jin, manusia dan burung. Mereka itu diatur dengan tertib dalam barisan. Kemudian mereka diberi minum. Komandan perang yaitu yang mewakili setiap barisan yang paling baik. Dari pembagian bermakna menahan atau mencegah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dikumpulkan} dikumpulkan {untuk Sulaiman bala tentara dari (kalangan) jin, manusia, dan burung, lalu mereka diatur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17 “dan dihimpunkan untuk sulaiman tentaranya dari jin, manusia, dan burung lalu mereka itu diatur dengan tertib,” maksudnya, bala tentaranya yang berjumlah sangat besar dan bermacam-macam dari bangsa manusia, jin, setan dan burung-burung dikumpulkan. “lalu mereka itu diatur dengan tertib,” mereka diatur dan dirapikan dengan serapi-raoinya drai yang awal hingga yang terakhir, dan mereka ditertibkan dengan sangta rapi dalam perjalanan, dalam waktu singgah dan dalam waktu ada di tempat tinggal serta waktu bepergian. Sulaiman sudah siap untuk itu dan telah mempersiapkan segalanya. Semua tentara tersebut tunduk kepada perintahnya, tidak mampu mendurhakai atau membangkang terhadapnya, sebagaimana dijelaskan oleh Allah, “inilah anugerah kami; maka berikanlah kepada orang lain atau tahanlah (untuk dirimu sendiri) dengan tiada pertanggungan jawab,” (shad:38)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 17: Terkumpul pada Sulaiman para pasukan dari jin dan manusia serta burung-burung, para pasukan tersebut sigap yang mereka mengikuti aturan, dengan tidak saling berebut kedudukan dan posisi sebagai penanggung jawab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam perjalanannya. Mereka diatur dan dirapikan sedemikian rapi baik ketika berjalan maupun berhenti. Semua tentaranya mengikuti perintahnya dan tidak sanggup mendurhakainya serta tidak berani membangkang. Beliau berjalan dengan bala tentaranya yang banyak dan rapih dalam sebagian safarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 17",
    "description": "Dan sebagai bukti atas pernyataan nabi sulaiman di atas, Allah mengabarkan bahwa untuk sulaiman dikumpulkan bala tentaranya yang terdiri dari jin, manusia dan burung, lalu mereka berbaris dengan tertib dalam rangka mengatur kehidupan masyarakat dan menghadapi musuh-Musuh nabi sulaiman. 18. Para prajurit tersebut mulai bergerak maju. Hingga ketika mereka sampai di lembah semut, berkatalah seekor semut kepada teman-temannya, 'wahai semut-semut! nabi sulaiman dan bala tentaranya sudah mendekati perkampungan kita, selamatkanlah diri kalian. Masuklah ke dalam sarang-sarangmu, agar kamu tidak diinjak oleh sulaiman dan bala tentaranya, sedangkan mereka tidak menyadari akan keberadaan kita. ' jika semut yang kecil saja nabi sulaiman mampu mendengar dan memahami bahasanya, apalagi hewan yang lebih besar lagi. Inilah salah satu anugerah Allah kepadanya."
  }
]