[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Hingga ketika mereka sampai di sebuah lembah sarang semut, seekor semut berkata, “Wahai sekalian semut, masuklah kalian ke sarang-sarang kalian, agar Sulaiman dan bala tentaranya tidak membinasakan kalian, sedang mereka tidak menyadarinya.” Maka Sulaiman tersenyum sembari tertawa karena mendengar perkataan semut itu lantaran semut itu paham dan sadar untuk mengingatkan kawanan semut. Dan Sulaiman merasakan betapa besar nikmat Allah kepada dirinya, maka dia hadapkan hatinya kepadaNya dengan berdoa, “Wahai Tuhanku, berilah aku ilham dan taufik untuk mensyukuri kenikmatanMu yang telah Engkau limpahkan kepadaku dan kepada kedua orangtuaku dan agar dapat beramal shalih sehingga Engkau ridha kepadaku, dan masukkanlah aku dengan rahmatMu ke dalam kenikmatan surgaMu bersama hamba-hambaMu yang shaleh yang telah Engkau ridhai amal perbuatan mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Mereka terus digiring hingga ketika mereka sampai di lembah semut (salah satu tempat di negeri Syam), seekor semut berkata, \"Wahai semut-semut, masuklah ke dalam sarang kalian, agar kalian tidak diinjak oleh Sulaiman dan bala tentaranya, sedangkan mereka tidak menyadari keberadaan kalian, sebab bila mereka mengetahuinya niscaya mereka tidak akan menginjak-injak kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18-19. Ketika rombongan Sulaiman bersama bala tentaranya berjalan dan sampai di lembah semut, seekor semut berkata: “Wahai semut-semut, berhati-hati dan masuklah ke rumah kalian agar Sulaiman dan bala tentaranya tidak menginjak kalian tanpa mereka sadari.” Maka Sulaiman tersenyum dan tertawa akibat perkataan semut itu, dan dia memahamkan semut itu bahwa Sulaiman dan bala tentaranya tidak akan menyakiti siapapun secara sengaja, dan mereka peduli terhadap kemaslahatan para semut. Dan Sulaiman tunduk dan berdoa kepada Tuhannya: “Ya Tuhanku, ilhamkanlah kepadaku agar aku senantiasa mensyukuri segala nikmat yang telah Engkau berikan kepadaku dan kepada kedua orang tuaku, dan berilah aku taufik dalam menjalankan amal shalih yang Engkau ridhai, serta masukkanlah aku ke dalam rahmat-Mu yang luas dan masukkanlah aku ke dalam surga bersama orang-orang shalih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. قَالَتْ نَمْلَةٌ يٰٓأَيُّهَا النَّمْلُ ادْخُلُوا۟ مَسٰكِنَكُمْ (Hingga apabila mereka sampai di lembah semut berkatalah seekor semut: Hai semut-semut, masuklah ke dalam sarang-sarangmu) Percakapan semut ini diceritakan seperti percakapan makhluk yang berakal karena Sulaiman memahami percakapan tersebut. لَا يَحْطِمَنَّكُمْ سُلَيْمٰنُ وَجُنُودُهُۥ (agar kamu tidak diinjak oleh Sulaiman dan tentaranya) Yakni berhati-hatilah agar kalian tidak terinjak oleh Sulaiman dan tentaranya dengan kaki mereka dan kaki hewan tungganggan mereka, yang akan mengakibatkan diri kalian hancur. وَهُمْ لَا يَشْعُرُونَ (sedangkan mereka tidak menyadari) Semut itu memberi uzur kepada mereka sebelum mereka melakukannya. Yakni mereka tidak menyadari telah menginjak kalian dan tidak mengetahui posisi kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara kehebatan al-Qur'an dari segi bahasa: adanya bentuk kalimat dengan konteks berjaga-jaga jika ditakutkan bagi seseorang yang yang sedang berhadapan dengan ayat memahami ayat dengan pemahaman yang salah. Diantara contohnya adalah: sebagaimana yang dikisahkan oleh Allah ta'ala tentang namlah (semut) : { لَا يَحْطِمَنَّكُمْ سُلَيْمَٰنُ وَجُنُودُهُۥ وَهُمْ لَا يَشْعُرُونَ } pada kalimat { وَهُمْ لَا يَشْعُرُونَ } adalah merupakan lafadzyang bermakna ihtiros (berjaga-jaga atau waspada) menjelaskan bahwasanya diantara keadilan Sulaiman dan kemuliaanya dan kemuliaan bala tentaranya bahwa mereka tidak menginjak semut-semut itu dan terlebih lagi mahkluk yang lebih besar darinya kecuali merka tidak merasakannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Hingga apabila mereka sampai di lembah semut berkatalah raja semut ketika dia melihat Sulaiman dan bala tentara: Hai semut-semut, masuklah ke dalam sarang-sarangmu, agar kamu tidak diinjak oleh Sulaiman dan tentaranya, sehingga kalian bisa mati terinjak sedangkan mereka tidak menyadari juga tidak mengetahui kalian. Raja semut telah memperingatkan sebelum mereka melakukannya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka diatur dengan rapi {Sehingga ketika sampai di lembah semut, ratu semut berkata,“Wahai para semut, masuklah ke dalam sarang kalian agar kalian tidak diinjak} agar kalian tidak dihancurkan {oleh Sulaiman dan bala tentaranya, sedangkan mereka tidak menyadarinya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18 maka berangkatlah pasukan tentara yang amat besar tersebut di dalam salah satu perjalannya, “hingga apabila mereka sampai di lembah semut berkatalah seekor semut,” maksudnya, ia mengingatkan para kawan-kawannya dan keluarga besarnya, “hai semut-semut, masuklah kedalam sarang-sarangmu, agar kamu tidak diinjak oleh sulaiman dan tentaranya sedangkan mereka tidak menyadari,” semut itu memberi nasihat dan memperdengarkan (ucapannya) kepada semut-semut lainnya, baik dengan sendirinya di mana Allah telah menganugerahkan kepada semut-semut itu kemampuan untuk mendengar yang diluar dari kebiasaan, karena peringatan kepada seluruh semut yang memenuhi lembah dengan suara seekor semut merupakan suatu keajaiban yang luar biasa ; atau (kemungkinan kedua) semut itu memberitahu kepada semut-semut yang ada di sekitarnya lalu berita menyebar dari satu kepada yang lainnya hingga sampai kepada seluruhnya, dan semut itu memerintahkan kepada mereka supaya berhati-hati dan berjalan menuju sarang-sarangnya. Semut itu mengetahui kondisi sulaiman dan bala tentaranya serta keagungan kekuasaannya; dan semut itu memberi tahu seluruh rekan-rekannya bahwasannya bala tentara tersebut, jika menginjak kalian, maka hal itu terjadi bukan karena kesengajaan atau kesadaran mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 18: Maka ketika para pasukan berjalan dengan sigap dan mengikuti aturan, mereka semua berjalan di atas lembah yang hidup di atasnya semut; Maka ketika semut itu melihat pasukan Sulaiman, semut tersebut menasihati dan memperingatkan semut yang lain dengan berkata : Wahai semut, masuklah ke dalam rumah-rumah kalian, sehingga kalian tidak celaka karena Sulaiman dan pasukannya, sedangkan mereka adalah makhluk yang tidak mengerti (keberadaan kita). Maka Allah berikan penglihatan kepada Sulaiman dengan kuasa-Nya dan hikmah dari-Nya, sebgaimana firman Allah pada surat Thaha : 50."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika melihat bala tentara Nabi Sulaiman ‘alaihis salam. Semut tersebut menasihati semut yang lain, bisa dirinya langsung (seekor semut) dengan suara yang terdengar oleh semua semut, yakni Allah telah memberikan kepada semut-semut pendengaran di luar kebiasaan, di mana peringatan dari satu semut terdengar oleh semut-semut yang lain yang telah memenuhi sebuah lembah. Hal ini termasuk hal yang sangat ajaib. Bisa juga semut tersebut memberitahukan kepada semut-semut yang ada di sekelilingnya, lalu berita itu disampaikan di antara mereka sehingga sampai kepada semuanya. Semut tersebut mengetahui keadaan Sulaiman dan bala tentaranya serta besarnya kerajaannya, dan ia memberi uzur kepada kawan-kawannya, bahwa jika mereka (Sulaiman dan bala tentaranya) menginjak, maka yang demikian dilakukan tanpa disengaja, lalu Nabi Sulaiman mendengarkan ucapannya dan memahaminya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 18",
    "description": "Para prajurit tersebut mulai bergerak maju. Hingga ketika mereka sampai di lembah semut, berkatalah seekor semut kepada teman-temannya, 'wahai semut-semut! nabi sulaiman dan bala tentaranya sudah mendekati perkampungan kita, selamatkanlah diri kalian. Masuklah ke dalam sarang-sarangmu, agar kamu tidak diinjak oleh sulaiman dan bala tentaranya, sedangkan mereka tidak menyadari akan keberadaan kita. ' jika semut yang kecil saja nabi sulaiman mampu mendengar dan memahami bahasanya, apalagi hewan yang lebih besar lagi. Inilah salah satu anugerah Allah kepadanya. 19. Begitu mendengar perkataan semut tersebut, maka dia, sulaiman, tersenyum lalu tertawa karena mendengar perkataan semut itu, dia senang dengan anugerah Allah yang diperlihatkan kepadanya. Dan sebagai ungkapan rasa syukur, dia, sulaiman, berdoa, 'ya tuhanku yang memeliharaku! anugerahkanlah aku ilham untuk tetap mensyukuri nikmat-Mu yang demikian banyak yang telah engkau anugerahkan kepadaku dan kepada kedua orang tuaku dan berikanlah juga aku ilham agar aku bisa mengerjakan kebajikan yang engkau ridai; dan masukkanlah aku, dengan rahmat-Mu, ke dalam golongan hamba-hamba-Mu yang saleh. '"
  }
]