[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18-19. Hingga ketika mereka sampai di sebuah lembah sarang semut, seekor semut berkata, “Wahai sekalian semut, masuklah kalian ke sarang-sarang kalian, agar Sulaiman dan bala tentaranya tidak membinasakan kalian, sedang mereka tidak menyadarinya.” Maka Sulaiman tersenyum sembari tertawa karena mendengar perkataan semut itu lantaran semut itu paham dan sadar untuk mengingatkan kawanan semut. Dan Sulaiman merasakan betapa besar nikmat Allah kepada dirinya, maka dia hadapkan hatinya kepadaNya dengan berdoa, “Wahai Tuhanku, berilah aku ilham dan taufik untuk mensyukuri kenikmatanMu yang telah Engkau limpahkan kepadaku dan kepada kedua orangtuaku dan agar dapat beramal shalih sehingga Engkau ridha kepadaku, dan masukkanlah aku dengan rahmatMu ke dalam kenikmatan surgaMu bersama hamba-hambaMu yang shaleh yang telah Engkau ridhai amal perbuatan mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Ketika Sulaiman mendengar ucapan semut itu, ia pun tersenyum dengan tertawa karena mendengar perkataan semut itu. Lalu dia berdoa memohon kepada Tuhannya, \"Wahai Tuhanku! Bimbinglah aku dan ilhamkan padaku untuk tetap mensyukuri nikmat-Mu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang tuaku, dan berilah aku taufik untuk mengerjakan amal saleh yang Engkau ridai; serta masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَتَبَسَّمَ (maka dia tersenyum) Yakni Sulaiman. ضَاحِكًا مِّن قَوْلِهَا(dengan tertawa karena (mendengar) perkataan semut itu) Nabi Sulaiman tertawa karena takjub dengan perkataan semut itu serta pemahaman dan kesadarannya untuk memperingatkan semut yang lain. وَقَالَ رَبِّ أَوْزِعْنِىٓ( Dan dia berdoa: “Ya Tuhanku berilah aku ilham) Yakni ilhamilah aku. أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِىٓ أَنْعَمْتَ عَلَىَّ وَعَلَىٰ وٰلِدَىَّ (untuk tetap mensyukuri nikmat Mu yang telah Engkau anugerahkan kepadaku dan kepada dua orang ibu bapakku) Sebab kenikmatan yang diberikan kepada kedua orang tua merupakan kenikmatan baginya pula, dan hal itu menjadikan Sulaiman patut bersyukur kepada Allah. وَأَنْ أَعْمَلَ صٰلِحًا تَرْضَىٰهُ(dan untuk mengerjakan amal saleh yang Engkau ridhai) Yakni amal shalih yang Engkau terima dariku. وَأَدْخِلْنِى بِرَحْمَتِكَ فِى عِبَادِكَ الصّٰلِحِينَ(dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh) Yakni jadikanlah aku termasuk golongan mereka, dan masukkanlah namaku bersama nama-nama mereka, serta bangkitkanlah aku dalam kolompok mereka menuju surga sebagai tempat tinggal orang-orang shalih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Maka Sulaiman tersenyum dengan tertawa karena mendengar perkataan semut itu karena takjub dengan pemahaman itu. Dan dia berdoa: \"Ya Tuhanku berilah aku ilham untuk tetap mensyukuri nikmat Mu yang telah Engkau anugerahkan kepadaku dan kepada dua orang ibu bapakku dan untuk mengerjakan amal saleh yang Engkau ridhai; dan masukkanlah aku dengan rahmat-Mu ke dalam golongan hamba-hamba-Mu yang saleh\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia tersenyum seraya tertawa karena perkataan semut itu. Dia berdoa,“Ya Tuhanku, anugerahkanlah aku} berilah aku ilham dan tuntunlah aku {untuk tetap mensyukuri nikmatMu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang tuaku dan untuk tetap mengerjakan amal shalih yang Engkau ridhai. dan masukkanlah aku dengan rahmatMu ke dalam golongan hamba-hambaMu yang shalih”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19 setelah sulaiman mendengar ucapan semut itu dan memahaminya, “maka dia tersenyum dengan tertawa karena (mendengar) perkataan semut itu,” karena kagum terhadap kefasihan, nasihat dan indahnya ungkapan semut itu. Ini adalah keadaan para nabi, yaitu etika yang sempurna dan kagum pada tempatnya, dan tertawa mereka tidak melebihi kecuali pada senyum, sebagaimana Rasulullah, kebanyakan tertawanya adalah senyum. Sebab tertawa terbahak-bahak itu menunjukkan kelemahan akal dan kejelekan adab, sedangkan tidak senyum dan tidak kagum terhadap sesuatu yang memang pantas dikagumi menunjukkan pada perangai jahat dan kecongkakan. Para rasul semuanya bersih dari itu semua. Dan sulaiman berkata seraya bersyukur kepada Allah yang telah menyampaikannya kepada kedudukan (mulia) ini, “ ya Rabbku, berilah aku ilham,” maksudnya, ilhami dan berilah aku bimbingan, “untuk tetap mensyukuri nikmatMu yang telah Engkau anugerahkan kepadaku dan kepada kedua orang ibu bapakku,” sebab sesungguhnya nikmat kepada kedua ibu bapak merupakan nikmat kepada anak. Oleh karena itu, sulaiman memohon kepada Rabbnya bimbingan (taufiq) untuk bisa mensyukuri nikmat agama dan dunia yang dianugerahkanNya kepadanya dan kepada kedua orangtuanya, “dan untuk mengerjakan amal shalih yang engkau ridhai,” maksudnya, bimbinglah aku untuk beramal shalih yang Engkau ridhai, karena amal shalih tersebut sejalan dengan perintahMu, dalam keadaan tulus di dalam melakukannya, selamat dari hal-hal yang dapat merusak dan menguranginya, “dan masukanlah aku dengan rahmatMu,” yang di antaranya adalah surga, “ke dalam,” golongan, “hamba-hambaMu yang shalih,” sebab, rahmat itu diperuntukkan hanya untuk orang-orang yang shalih dengan berbagai derajat dan kedudukan mereka. Itu semua adalah satu contoh dari kondisi sulaiman ketika mendengar sarapan dan seruan seekor semut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 19: Allah menjelaskan apa yang seharusnya Sulaiman lakukan setelah mendengar perkataan semut dengan tersenyum (Sulaiman) mendengarnya; Dan Sulaiman berdoa kepada Tuhannya : Wahai Tuhanku, berikan aku ilham agar aku bersyukur atas nikmat darimu yang engkau berikan padaku dan kepada bapakku, tetapkan aku untuk beramal shalih dan terimalah amalan tersebut dariku, masukkanlah aku dalam rahmat-Mu, kebaikan dari-Mu yaitu dengan memasuki surga-Mu bersama orang-orang yang shalih yang mereka ridha atas-Mu dan Engkaupun ridha atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kagum terhadapnya dan terhadap nasehatnya. Seperti inilah keadaan para nabi ‘alaihimush shalaatu was salaam, mereka memiliki adab yang sempurna dan kagum pada tempatnya, dan tertawa mereka pun hanya senyuman, sebagaimana Nabi Muhammad shallallahu 'alaihi wa sallam yang sebagian besar tertawanya adalah senyum. Hal itu, karena tertawa terbahak-bahak menunjukkan lemahnya akal dan kurang adab, dan jika tidak tersenyum sama sekali dan tidak kagum terhadap hal tersebut menunjukkan akhlaknya yang buruk dan keras, sedangkan para rasul bersih dari semua itu. Ada yang berpendapat, bahwa Beliau mendengar suara semut dari jarak tiga mil yang dibawa oleh angin, maka Beliau menahan bala tentaranya ketika telah dekat ke lembah semut, hingga semua semut masuk ke rumahnya. Ketika itu bala tentara Nabi Sulaiman ada yang berkendaraan dan ada yang berjalan kaki. Sebagai rasa syukur kepada Allah Subhaanahu wa Ta'aala yang telah mengantarkan Beliau kepada kedudukan tersebut. Yakni berilah taufiq. Baik nikmat agama maupun dunia. Yaitu amal yang sesuai perintah Allah dengan ikhlas menjalankannya, selamat dari hal yang membatalkan pahalanya dan yang menguranginya. Yaitu para nabi dan para wali. Inilah potret Beliau yang disebutkan Allah ketika Beliau mendengar suara semut dan panggilannya. Selanjutnya, Allah menyebutkan potret Beliau ketika berbicara dengan burung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 19",
    "description": "Begitu mendengar perkataan semut tersebut, maka dia, sulaiman, tersenyum lalu tertawa karena mendengar perkataan semut itu, dia senang dengan anugerah Allah yang diperlihatkan kepadanya. Dan sebagai ungkapan rasa syukur, dia, sulaiman, berdoa, 'ya tuhanku yang memeliharaku! anugerahkanlah aku ilham untuk tetap mensyukuri nikmat-Mu yang demikian banyak yang telah engkau anugerahkan kepadaku dan kepada kedua orang tuaku dan berikanlah juga aku ilham agar aku bisa mengerjakan kebajikan yang engkau ridai; dan masukkanlah aku, dengan rahmat-Mu, ke dalam golongan hamba-hamba-Mu yang saleh. ' 20. Jika pada ayat yang lalu nabi sulaiman memahami bahasa semut, pada ayat ini nabi sulaiman memahami bahasa burung, antara lain burung hudhud. Nabi sulaiman menggunakan burung hudhud untuk berbagai keperluan seperti membawakan surat, mencari air dan memantau keadaan bangsa lain. Dan pada satu kesempatan, dia, sulaiman, memeriksa burung-burung yang ada di sekitarnya, lalu berkata kepada prajurit yang ada, 'mengapa aku tidak melihat burung hudhud' kemanakah dia' apakah ia termasuk yang tidak hadir'."
  }
]