[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ia adalah ayat-ayat yang memandu menuju jalan kemenangan di dunia dan akhirat, memberitahukan kabar gembira berupa balasan yang baik bagi kaum Mukminin yang mengimaninya, dan memperoleh hidayah dengan petunjuknya,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Ayat-ayat ini menjadi petunjuk ke jalan kebenaran, dan menjadi berita gembira untuk orang-orang yang beriman kepada Allah dan Rasul-Nya,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2-3. Ayat-ayat tersebut memberi petunjuk kepada jalan yang lurus, memberi kabar gembira berupa surga yang penuh dengan kenikmatan bagi orang-orang yang mengakui keesaan Allah dan kerasulan Rasulullah. Mereka adalah orang-orang yang senantiasa mendirikan shalat pada waktunya dengan menyempurnakan syarat-syaratnya, menunaikan zakat kepada orang-orang yang berhak menerimannya, dan mereka benar-benar yakin dengan adanya akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. هُدًى وَبُشْرَىٰ لِلْمُؤْمِنِينَ (untuk menjadi petunjuk dan berita gembira untuk orang-orang yang beriman) Yakni ayat-ayat tersebut adalah pemberi petunjuk dan kabar gembira."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Untuk menjadi petunjuk dalam kebenaran dan keistiqamahan, dan berita gembira untuk orang-orang yang beriman berupa surga"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Petunjuk dan berita gembira bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2 akan tetapi, bersama (semua) ini kebanyakan manusia tidak mengambil pelajaran darinya, dan seluruh orang yang menentang tidak berpedoman kepada ayat-ayat tersebut, sebagai penjagaan terhadapnya dari orang-orang yang tidak mengandung kebaikan, dan tidak pula keshalihan ataupun kesucian di dalam hatinya. Sesungguhnya yang mau berpedoman kepadanya hanyalah orang yang telah diistimewakan dengan iman, sehingga dengannya hati mereka menjadi bercahaya dan nurani mereka menjadi bersih. Maka dari itu, Dia berfirman, ”sebagai petunjuk dan berita gembira bagi orang-orang yang beriman,” maksudnya, membimbing mereka untuk menelusuri jalan yang lurus, menjelaskan kepada mereka apa-apa yang semestinya harus mereka lakukan atau yang harus mereka tinggalkan, dan memberikan berita gembira kepada mereka akan pahala drai Allah sebagai akibat atas tindakan (menelusuri) jalan yang lurus tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 2: Allah menjelaskan bahwa maksud ayat ini di antaranya adalah petunjuk bagi manusia dan mengeluarkan manusia dari kegelapan kekufuran menuju cahaya keimanan, dan sebagai kabar bagi orang-orang yang beriman dengan balasan yang besar dan pahala yang akan didapatkan bagi siapa yang mengamalkan ayat ini, sebagaiamana akan menambah keimanan dengan nikmat dari Allah dan karunia-Nya bagi hamba yang bertakwa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar tidak tersesat dan menerangkan kepada mereka apa yang perlu ditempuh dan apa yang perlu ditinggalkan, serta memberikan kabar gembira kepada mereka pahala Allah yang akan diberikan karena mengikuti petunjuk itu. Yakni menyampaikan kabar gembira berupa surga untuk orang-orang yang beriman kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 2",
    "description": "Al-qur'an adalah menjadi petunjuk, pembimbing manusia ke jalan yang lurus dan berita gembira bagi orang-orang yang beriman. Merekalah yang bisa memanfaatkan Al-Qur'an dalam kehidupan mereka. Mereka akan mendapatkan kebahagiaan di dunia dan di akhirat nanti akan masuk surga. 3. Orang yang beriman adalah orang-orang melaksanakan salat sesuai dengan syarat dan rukunnya, dan melakukannya terus menerus sepanjang hayat, dan menunaikan zakat, sebagai bentuk kewajiban dan rasa syukur kepada Allah atas limpahan rezeki-Nya, dan mereka meyakini adanya kebangkitan manusia dan kehidupan abadi pada hari akhirat."
  }
]