[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Sulaiman memeriksa keadaan burung-burung yang ditundukkan baginyan dan keadaan burung yang tidak hadir. Sebelumnya, ada besertanya seekor burung hud-hud yang istimewa lagi dikenal, akan tetapi dia tidak menjumpainya. Maka ia berkata, “Mengapa aku tidak melihat burung hud-hud yang biasa aku lihat? Apakah ada penghalang yang menghalanginya dari (penglihatanku) ataukah ia termasuk yang tidak hadir di hadapanku, sehingga aku tidak bisa melihatnya karena ketidakhadirannya?” Tatkala sudah jelas bahwa ia tidak hadir, Sulaiman berkata, “Sesungguhnya aku akan menyiksanya dengan siksaan yang pedih akibat ketidakhadirannya sebagai sanksi baginya atau aku akan benar-benar menyembelihnya sebagai hukuman atas perbuatannya karena ia tidak tunduk patuh terhadap aturan yang berlaku padanya, atau ia benar-benar datang kepadaku dengan alasan yang jelas yang berisi alasan ketidakhadirannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Lalu Sulaiman memeriksa burung-burung itu, namun dia tidak melihat burung Hudhud, ia pun berkata, \"Mengapa aku tidak melihat Hudhud, apakah ada yang menghalangi pandanganku dari melihatnya, ataukah dia termasuk yang absen?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-22. Sulaiman memeriksa pasukannya dari kalangan burung, kemudian dia berkata: “Mengapa aku tidak melihat Hudhud? Dia tidak hadir bersama kita.” Setelah Sulaiman mendapat kejelasan bahwa Hudhud tidak hadir, dia bersumpah akan menyiksanya dengan siksaan yang berat, menyembelihnya, atau datang dengan membawa hujjah yang jelas sebagai alasan ketidak-hadirannya. Selang beberapa waktu Hudhud datang dan berkata kepada Sulaiman: “Aku melihat apa yang belum kamu lihat, aku datang kepadamu dari negeri Saba’ -dan Saba’ adalah kabilah yang terkenal di Yaman- dengan membawa kabar yang besar dan sangat penting."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَتَفَقَّدَ الطَّيْرَ (Dan dia memeriksa burung-burung) Yakni Sulaiman memeriksa burung-burung dan menanyakan siapa yang tidak hadir. Dahulu burung-burung adalah makhluk yang menemani Sulaiman ketika bepergian, mereka menaunginya dengan sayap-sayap mereka. فَقَالَ مَا لِىَ لَآ أَرَى الْهُدْهُدَ(lalu berkata: “Mengapa aku tidak melihat hud-hud) Apakah itu karena ada yang menghalanginya dariku, atau karena sebab lainnya? Kemudian Nabi Sulaiman mengira bahwa hud-hud tidak hadir, beliau bertanya: أَمْ كَانَ مِنَ الْغَآئِبِينَ(apakah dia termasuk yang tidak hadir) yakni apakah memang ia tidak hadir?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini menggambarkan bagaimana seorang pemimpin kehilangan berita tentang pengikutnya, dan penjagaan terhadap mereka, perhatikan bagaiamana Hud-hud dengan tubuhnya yang kecil tidak terpantau keberadaannya oleh Sulaiman, lalu bagaimana dengan mereka yang tubhnya lebih besar dari Hud-hud? dan Semoga Allah merahmati Umar; sebagaimana dikisahkan dalam biografinya, suatu ketika salah seorang berkata : jika saja seekor domba diterkam oleh Serigala di daratan sungai eufrat, sungguh Umar akan bertanya tentangnya. 2 ). Nabi Sulaiman merasa kehilangan dengan ketiadaan Hud-hud di sisinya, namun zaman sekarang sebagian orang tua tidak merasa kehilangan ketika anak-anak mereka berkeliaran di malam hari bahkan tidak ada upaya untuk mengetahui keberadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Dan dia memeriksa burung-burung dan tidak menemukan burung Hud Hud lalu berkata: \"Mengapa aku tidak melihat hud-hud, apakah dia tidak hadir, atau tidak terilhat karena tertutup burung lain?” Fungsi am adalah untuk berpindah dari kalimat pertama ke kelimat setelahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia memeriksa (pasukan) burung} Sulaiman mencari apa yang hilang dari pasukan burung {lalu berkata,“Mengapa aku tidak melihat Hud hud. Ataukah dia termasuk yang tidak hadir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20 kemudian Allah menyebutkan satu contoh lain dari dialognya kepada burung, seraya berfirman, ”dan dia memeriksa burung-burung’,” ini menunjukkan kepada kebulatan tekad dan ketegasannya serta betapa baiknya dia dalam mengorganisasikan bala tentaranya dan pengendaliannya terhadap semua permasalahan yang kecil dan yang besar, sampai-sampai beliau tidak pernah menyepelekan masalah ini, yaitu masalah memeriksa burung dan melihat langsung apakah semuanya ada atau ada sesuatu yang hilang. Inilah makna ayat di atas. Sungguh sama sekali tidak melakukan apa-apa orang yang mengatakan, ”sesungguhnya (tindakan) sulaiman memeriksa burung adalah untuk melihat ada di mana posisi burung hud-hud dari sulaiman, (yang bertugas) untuk menunjukkan kepadanya jauh atau dekatnya air. Mereka juga telah beranggapan bahwa burung hud-hud sedang melihat adanya air di bawah tanah yang sangat rimbun. Sesungguhnya pendapat ini sama sekali tidak ada dalilnya. Bahkan dalil aqli dan lafzhi (nash) menunjukkan ketidak benaran pendapat ini. Dalil aqli menunjukkan bahwa sebenarnya berdasarkan kebiasaan dan pengalaman serta kenyataan-kenyataan bahwa hewan-hewan tersebut, semuanya tidak mempunyai sedikitpun kemampuan melihat sebagimana penglihatan yang diluar kebiasaan seperti ini, dan melihat adanya air di bawah tanah yang sangat rimbun. Kalau halnya memang seperti itu, Allah pasti menyebutkannya, sebab ia merupakan mukjizat paling besar. Sedangkan dalil lafzhi (menunjukkan) kalau seandainya yang dimaksud adalah makna tersebut, tentu Allah mengatakan, ”sulaiman mencari hud-hud untuk melihat air untuknya. Maka tatkala sulaiman mencarinya, maka dia mengatakan apa yang telah dikatakannya (di atas dalam ayat.) atau, “dia memeriksa hud-hud” atau “ia mencarinya,” atau ungkapan lain yang serupa dengannya. Dan yang benar adalah bahwa sulaiman memeriksa seluruh burung untuk mengetahui mana yang hadir dan mana yang absen dan untuk mengetahui kekonsistenan masing-masing pada pos-pos dan tempat-tempat yang telah ditetapkannya. Dan juga, sulaiman merasa tidak butuh dan tidak memerlukan air secara mendesak sehingga harus memerintahkan burung hud-hud. Sebab di sisinya ada setan-setan dan ifrit-ifrit yang sanggup menggali tanah untuk mencarikan air untuknya sedalam apapun keadaan air tersebut, dan Allah pun telah menundukkan angin bagi sulaiman, yang perjalanannya di waktu pagi sama dengan perjalanan sebulan dan perjalanannya di waktu sore sama dengan perjalanan sebulan. Maka bagaimana mungkin, bersama semua itu (dikatakan bahwa) sulaiman membutuhkan burung hud-hud?! Tafsiran-tafsiran yang ada ini dan perkataan-perkataan yang masyhur ini tidaklah dikenal selainnya ia dinukil dari bani israil secara lepas, dan penukilnya lupa akan kontradiksinya dengan makna-makna yang shahih dan kesesuaiannya dengan berbagai pendapat. Kemudian tafsiran-tafsiran tersebut senantiasa dinukil dan dikutip oleh orang-orang yang datang kemudian begitu saja (tanpa diricek) dari orang-orang terdahulu, hingga dia mengira bahwa tafsiran tersebutlah yang benar, sehingga termuat secara bebas perkataan-perkataan yang sangat rancu di dalam kitab-kitab tafsir. Orang yang pandai nan cermat mengetahui bahwa al-qur’an mulia yang berbahasa arab nan jelas ini, yang dengannya Allah berbiacara kepada semua manusia, yang berilmu dan yang bodoh dan memerintahkan mereka untuk merenungkan maknanya dan memahaminya sesuai dengan lafazh-lafazh bahasa arab yang sudah dimaklumi maknanya, yang tidak awam bagi orang-orang arab asli, dan apabila dia menemukan pendapat-pendapat (tafsiran) yang dikutip drai selain Rasulullah, maka dia mengembalikannya pada prinsip ini, lalu jika pendapat ini sejalan dengan prinsip ini, maka dia menerimanya, karena lafazh itu menunjukkan kepada yang demikian. Dan jika pendapat-pendapat itu menyalahinya baik secara lafazh dan makna atau secara lafazh saja, atau secara makna saja maka dia menolaknya dan memastikan kebatilannya, karena ia mempunyai prinsip (landasan) yang sudah maklum yang bertentangan dengan pendapat-pendapat tersebut, yaitu makna dan petunjuk kalimat yang sudah baku (diketahui) Buktinya adalah bahwa pemeriksaan sulaiman terhadap burung-burung dan perasaan kehilangan burung hud-hud membuktikan kesempurnaan pengaturan dan pengendaliannya pada kerajaan sendirian, dan menunjukkan kesempurnaan kecerdasannya, sampai-sampai dia mencari burung sekecil itu, “lalu berkata,’mengapa aku tidak melihat burung hud-hud, apakah dia termasuk yang tidak hadir’,” maksudnya, apakah ketidakdapatanku melihat burung hud-hud ini karena kurangnya pengetahuanku kepadanya karena ia tersembunyi di antara kumpulan yang besar ini? Atau ia ada di atas pintunya karena absen (tidak hadir) tanpa seizin ataupun perintah dariku?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 20: Maka ketika ada yang merasa kurang (dari pasukannya), Sulaiman berkata : Di mana hud-hud, aku tidak melihat dia ada di antara para burung ?, Apakah dia termasuk yang tidak hadir ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini menunjukkan sempurnanya azam (tekad) dan keteguhan hati Beliau serta bagusnya dalam mengatur tentara serta mengatur secara langsung, baik perkara-perkara kecil maupun besar. Beliau memperhatikan, apakah tentaranya hadir semua atau ada yang tidak hadir. Menurut Mujahid, Sa’id bin Jubair dan lainnya dari Ibnu Abbas serta selain Beliau, bahwa burung Hud-hud adalah ahli ukur yang menunjukkan letak air di padang sahara kepada Nabi Sulaiman ‘alaihis salam ketika Beliau memerlukannya (seperti untuk shalat, dsb.), ia melihat air di batas (di bawah) bumi, sebagaimana seseorang melihat sesuatu yang tampak di permukaan bumi, ia mengetahui berapa jarak kedalamannya dari permukaan bumi. Apabila burung Hud-hud telah menunjukkannya, maka Nabi Sulaiman ‘alaihis salam memerintahkan para jin menggali tempat tersebut untuk mengeluarkan air dari situ. Suatu hari, Nabi Sulaiman ‘alaihis salam singgah di salah satu padang sahara memeriksa burung-burung untuk melihat Hud-hud, namun ternyata Beliau tidak melihatnya, maka Beliau berkata, “Mengapa aku tidak melihat Hud-hud, atau apakah ia termasuk yang tidak hadir?” …dst. Suatu hari Ibnu Abbas mengisahkan seperti ini, sedangkan ketika itu ada salah seorang khawarij yang bernama Nafi’ bin Azraq, ia adalah seorang yang sering membantah Ibnu Abbas, ia pernah berkata kepadanya, “Berhentilah wahai Ibnu Abbas! Bangsa Romawi telah dikalahkan.” Ibnu Abbas berkata, “Memangnya kenapa?” Ia menjawab, “Sesungguhnya engkau menceritakan tentang Hud-hud, bahwa ia melihat air di batas bumi, dan bahwa seorang anak menaruh sebuah biji dalam perangkap, lalu menyirami perangkap itu dengan tanah, kemudian burung Hud-hud datang untuk mengambil biji itu, namun jatuh dalam perangkap, lalu ditangkap oleh anak itu.” Ibnu Abbas kemudian berkata, “Kalau bukan karena orang ini akan pergi dan berkata, “Aku telah berhasil membantah Ibnu Abbas, tentu aku tidak akan menjawabnya.” Selajutnya Ibnu Abbas berkata kepadanya, “Kasihanilah dirimu! Sesungguhnya apabila kedudukan (khawatir) turun, mata akan buta dan sikap hati-hati akan hilang.” Nafi’ kemudian berkata kepadanya, “Demi Allah, aku tidak akan berdebat denganmu sedikit pun tentang Al Qur’an untuk selamanya.” Kisah tentang Hud-hud di atas, yakni bahwa ia melihat air yang berada di bawah tanah menurut Syaikh As Sa’diy tidak ada dalilnya. Bahkan menurutnya juga, bahwa dalil ‘aqli (akal) dan lafzhi (lafaz) sudah menunjukkan tidak benarnya. Dalil ‘aqlinya adalah berdasarkan kebiasaan dan pengalaman, bahwa semua hewan ini tidak mampu melihat adanya air di bawah tanah. Jika memang mampu, tentu Allah akan menyebutkannya, karena ia termasuk ayat kauniy (di alam semesta) yang besar. Sedangkan dalil lafzhinya adalah, bahwa jika maksudnya seperti itu tentu lafaznya, “wa thalabal hud-huda li yanzhura lahul maa’a falammaa faqada qaala maa qaala” (artinya: ia meminta Hud-hud untuk melihat air. Ketika Hud-hud tidak ada, maka ia berkata apa yang dia katakan) atau “fatasya ‘anil hud-hud” (artinya: ia mencari Hud-hud) atau “bahatsa ‘anhu” (artinya: ia mencari Hud-hud) dsb. Namun ternyat lafaznya “tafaqqadath thaira” untuk melihat yang hadir dan yang tidak hadir, yang tetap ditempat yang ditentukannya dan yang tidak. Di samping itu, Nabi Sulaiman tidak butuh kepada keahlian Hud-hud, karena ia memiliki tentara dari kalangan setan dan ifrit yang siap mengeluarkan air untuknya meskipun sangat dalam di bawah permukaan bumi. Menurut Syaikh As Sa’diy pula, bahwa tafsir tersebut dinukil dari Bani Israil, dan yang menukilnya tidak memperhatikan isinya yang bertentangan dengan maknanya yang sahih, lalu hal itu senantiasa dinukil dari generasi sebelum mereka sehingga mengira bahwa hal itu benar. Adapun orang yang cerdas mengetahui, bahwa Al Qur’an ini, yang menggunakan bahasa Arab yang jelas, yang dipakai bicara oleh Allah untuk semua manusia, yang memerintahkan mereka untuk memikirkan makna-maknanya, mewujudkannya sesuai dengan lafaz-lafaz bahasa Arab yang dikenal maknanya yang tidak asing oleh orang-orang Arab, dan jika ditemukan ucapan-ucapan yang dinukil dari selain Rasulullah shallallahu 'alaihi wa sallam, maka dikembalikan kepada prinsip tersebut, jika sesuai maka diterima, karena lafaz yang menunjukkan kepadanya. Tetapi, jika bertentangan dengan lafaz dan makna atau lafaz saja atau makna saja, maka ditolak, karena ada dasar yang sudah diketahui yang bertentangan dengannya, yaitu yang ia ketahui dari makna dan dilalah(yang ditunjukan)nya. Penguatnya adalah bahwa pemeriksaan Nabi Sulaiman ‘alaihis salam terhadap burung-burung menunjukkan kecakapannya dan mampu mengatur kerajaannya sendiri serta menunjukkan kecerdasannya, sampai-sampai.mengetahui ketidakhadiran burung yang kecil ini. Hud-hud adalah sejenis burung pelatuk. Yakni tanpa izin dan perintah dariku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 20",
    "description": "Jika pada ayat yang lalu nabi sulaiman memahami bahasa semut, pada ayat ini nabi sulaiman memahami bahasa burung, antara lain burung hudhud. Nabi sulaiman menggunakan burung hudhud untuk berbagai keperluan seperti membawakan surat, mencari air dan memantau keadaan bangsa lain. Dan pada satu kesempatan, dia, sulaiman, memeriksa burung-burung yang ada di sekitarnya, lalu berkata kepada prajurit yang ada, 'mengapa aku tidak melihat burung hudhud' kemanakah dia' apakah ia termasuk yang tidak hadir'21. Melihat ketidak hadiran burung hudhud di antara prajuritnya, nabi sulaiman selaku pemimpin tertinggi atas bala tentaranya, mulai marah dan mengancamnya seraya berkata, \"jika dia datang pasti akan kuhukum ia dengan hukuman yang berat sesuai dengan kesalahannya, atau pasti akan kusembelih ia, kecuali jika ia datang kepadaku dengan alasan yang jelas yang bisa aku terima. \"."
  }
]