[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Sulaiman memeriksa keadaan burung-burung yang ditundukkan baginyan dan keadaan burung yang tidak hadir. Sebelumnya, ada besertanya seekor burung hud-hud yang istimewa lagi dikenal, akan tetapi dia tidak menjumpainya. Maka ia berkata, “Mengapa aku tidak melihat burung hud-hud yang biasa aku lihat? Apakah ada penghalang yang menghalanginya dari (penglihatanku) ataukah ia termasuk yang tidak hadir di hadapanku, sehingga aku tidak bisa melihatnya karena ketidakhadirannya?” Tatkala sudah jelas bahwa ia tidak hadir, Sulaiman berkata, “Sesungguhnya aku akan menyiksanya dengan siksaan yang pedih akibat ketidakhadirannya sebagai sanksi baginya atau aku akan benar-benar menyembelihnya sebagai hukuman atas perbuatannya karena ia tidak tunduk patuh terhadap aturan yang berlaku padanya, atau ia benar-benar datang kepadaku dengan alasan yang jelas yang berisi alasan ketidakhadirannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Ketika yakin bahwa burung Hudhud tersebut memang absen, ia berujar, \"Sungguh aku benar-benar akan mengazabnya dengan azab yang keras atau benar-benar menyembelihnya sebagai hukuman atas ketidak hadirannya, kecuali jika ia datang kepadaku dengan membawa alasan yang benar-benar menjelaskan ketidak hadirannya\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. لَأُعَذِّبَنَّهُۥ عَذَابًا شَدِيدًا أَوْ لَأَا۟ذْبَحَنَّهُۥٓ (Sungguh aku benar-benar akan mengazabnya dengan azab yang keras atau benar-benar menyembelihnya) Terdapat pendapat mengatakan yang dimaksud dengan azab yang keras adalah dengan mencabut bulu-bulunya. Dan pendapat lain mengatakan yakni dengan melarangnya untuk melayani Nabi Sulaiman lagi. أَوْ لَيَأْتِيَنِّى بِسُلْطٰنٍ مُّبِينٍ(kecuali jika benar-benar dia datang kepadaku dengan alasan yang terang) Yakni dengan alasan yang jelas atas ketidakhadirannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Sungguh aku benar-benar akan mengazabnya dengan azab yang keras atau benar-benar menyembelihnya agar menjadi pembelajaran yang lain karena tidak hadir tanpa izinku. Kecuali jika dia benar-benar datang kepadaku dengan alasan yang terang\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sunggu aku akan menghukumnya dengan hukuman yang berat atau aku sembelih dia, kecuali jika dia datang kepadaku dengan alasan yang jelas”} alasan yang menjelaskan uzurnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21 maka saat itulah sulaiman marah kepadanya dan mengencamnya seraya mengatakan, “sungguh aku akan mengazabnya dengan keras,” tidak untuk membunuhnya, “atau benar-benar aku akan menyembelihnya kecuali jika dia benar-benar datang kepadaku dengan alasan yang terang,” maksudnya, argument yang jelas atas ketidak hadirannya. Ini pun menunjukkan keutuhan sifat war’ (sikap ekstra hati-hati) dan keadilannya. Yaitu bahwa sulaiman tidak akan bersumpah atas dasar hanya sekedar akan menghukumnya dengan siksaan atau dengan membunuhnya, karena hal ini tidak mungkin terjadi kecuali karena suatu dosa, sedangkan keabsenan (ketidak hadirannya) bisa jadi karena suatu alasan yang jelas. Maka drai itu sulaiman memberikan pengecualian disebabkan sifat wara’ dan kecerdasan yang dimilikinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 21: Ketika Sulaiman yakin bahwa hud-hud tidak hadir, dia mengancam dengan berkata : Aku akan menghukumnya dengan hukuman yang keras karena sebab ketiadaannya, dengan tanpa izin dariku, atau aku akan menghukumnya karena sebab apa yang telah dia lakukan dan agar sebagai pelajaran bagi pasukan yang lainnya, atau dia harus datang kepadaku dengan membawa alas an yang jelas serta sebuah bukti yang pasti atas ketidak hadirannya dan keterlambatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika itu marahlah Nabi Sulaiman ‘alaihis salam dan mengancamnya. Hal ini menunjukkan tingginya wara’ dan sikap inshaf(adil)nya, yakni bahwa ia tidaklah bersumpah akan menghukumnya kecuali karena perbuatannya yang salah. Oleh karena ketidakhadirannya bisa jadi karena uzur, maka Beliau mengecualikannya karena wara’ dan kecerdasannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 21",
    "description": "Melihat ketidak hadiran burung hudhud di antara prajuritnya, nabi sulaiman selaku pemimpin tertinggi atas bala tentaranya, mulai marah dan mengancamnya seraya berkata, \"jika dia datang pasti akan kuhukum ia dengan hukuman yang berat sesuai dengan kesalahannya, atau pasti akan kusembelih ia, kecuali jika ia datang kepadaku dengan alasan yang jelas yang bisa aku terima. \"22. Maka tidak lama kemudian datanglah burung hudhud yang dicari cari, dan langsung menghadap nabi sulaiman. Lalu setelah ia di tanya oleh nabi sulaiman tentang keberadannya, dengan spontan ia berkata, dengan nada bangga 'aku telah mengetahui sesuatu yang belum engkau ketahui wahai baginda nabi sulaiman. Aku datang kepadamu dari negeri yang jauh yaitu negeri saba' di yaman dengan membawa suatu berita yang yang penting dan meyakinkan dan perlu engkau ketahui. \"."
  }
]