[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka burung hud-hud tidak hadir beberapa saat yang tidak lama. Kemudian ia menghadap, maka Sulaiman menegurnya atas ketidakhadiran dan keterlambatannya. Lalu hud-hud berkata kepadanya, “Aku telah mengetahui sesuatu perkara yang tidak engkau ketahui dengan baik. Aku datang kepadamu dari negeri Saba’ di Yaman dengan membawa berita yang sangat penting, dan aku yakin tentang itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Hudhud menghilang dalam waktu yang tidak terlalu lama. Ketika dia datang, ia berkata kepada Sulaiman -'alaihissalām-, \"Aku telah mengetahui sesuatu yang engkau belum mengetahuinya; dan kubawa kepadamu dari penduduk negeri Saba' suatu berita penting lagi benar yang tidak ada keraguan padanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. فَمَكَثَ غَيْرَ بَعِيدٍ (Maka tidak lama kemudian (datanglah hud-hud)) Yakni hud-hud terlambat sebentar saja. Pendapat lain mengatakan bahwa tidak lama setalah Sulaiman mencari dan mengancam hud-hud kemudian datanglah hud-hud. فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِۦ (lalu ia berkata: “Aku telah mengetahui sesuatu yang kamu belum mengetahuinya) Yakni aku mengetahui sesuatu yang belum kamu ketahui. وَجِئْتُكَ مِن سَبَإٍۭ بِنَبَإٍ يَقِينٍ (dan kubawa kepadamu dari negeri Saba suatu berita penting yang diyakini) Saba’ adalah nama sebuah negeri yang terletak di Yaman yang dipimpin oleh ratu Bilqis. Makna (النبأ) adalah berita yang sangat penting."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Hudhud belum terbebas dari ancaman Sulaiman, dan dia pun tidak akan berani -dengan kelemahannya- untuk berkata kepada Sulaiman yang kuat seperti perkataan ini : { أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ } \"Aku telah mengetahui sesuatu yang kamu belum mengetahuinya\" jika saja bukan dia bukan seorang sulthan yang berilmu. 2). Boleh jadi seseorang yang derajatnya di antara manusia sangat rendah namun ia memiliki ilmu yang tidak diketahui oleh seorang imam pada zamannya, bukankah Hud hud mengetahui perkara yang tidak dikethui oleh Nabi yang diutus? 3 ). Lihatlah kepada Hudhud yang berkata kepada seorang Nabi : { أَحَطْتُ بِمَا لَمْ تُحِطْ بِهِ } \"Aku telah mengetahui sesuatu yang kamu belum mengetahuinya\" inilah Hudhud makhluk kecil yang derajatnya jauh di bawah Sulaiman 'alaihissalam berkata kepadanya : Aku mengetahui apa yang kamu tidak ketahui, seakan-akan perkataan ini mengajarkan kita tentang adab kepada orang selain kita, dia mengajakan kepada kita tentang hal yang belum diajarkan kepada kita, bukankah juga seekor burung kecil telah mengajarkan bagaimana menguburkan bangkai mayat? { فَبَعَثَ ٱللَّهُ غُرَابًا يَبْحَثُ فِى ٱلْأَرْضِ } \"Kemudian Allah menyuruh seekor burung gagak menggali-gali di bumi\" Al-Maidah : 31. 4 ). Satu hal yang mengherankan dari sebagian da'i dan penuntut ilmu, diantara mereka ada yang menolak nasihat dari orang lain dan berdalih akan mengurangi kedudukannya! maka ada baiknya bagi mereka dan pengikut-pengikutnya untuk mempelajari kisah Sulaiman -seorang raja dan Nabi yang diutus oleh Allah- yang Hudhud berkata kepadanya : \"Aku telah mengetahui sesuatu yang kamu belum mengetahuinya\" kemudian sulaiman merendahkan hatinya dari ucapan seekor burung ini dan menerima kebenaran yang disampaikan; yang kemudian menjadi sebab keislaman satu kerajaan pada zamannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Maka tidak lama kemudian datanglah hud-hud, lalu ia berkata: \"Aku telah mengetahui sesuatu yang kamu belum mengetahuinya; dan kubawa kepadamu dari negeri Saba di negeri Yaman suatu berita penting yang diyakini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia datang tidak lama kemudian} lalu Hud-hud datang dari ketidak hadirannya di waktu yang tidak lama {lalu dia berkata,“Aku telah mengetahui sesuatu yang belum kamu ketahui} Aku mengetahui sesuatu yang belum kamu ketahui {Aku datang kepadamu dari negeri Saba’} negeri Saba’ di daerah Yaman {dengan suatu berita yang meyakinkan} kabar yang dapat benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22 “maka tidak lama kemudian,” maksudnya, kemudian hud-hud datang. Ini membuktikan betapa segannya para tentara itu pada sulaiman dan menunjukkan betapa patuhnya mereka terhadap perintahnya, sampai-sampai burung hud-hud yang telah terlambat karena adanya alasan yang sangat jelas tidak mampu untuk terlambat dalam waktu yang cukup lama. “lalu ia berkata,” kepada sulaiman, “aku telah mengetahui sesuatu yang kamu belum mengetahuinya,” maksudnya, saya mempunyai suatu ilmu (pengetahuan) yang tidak terjangkau oleh pengetahuanmu yang luas dan ketinggian derajatmu di dalamnya. ”dan kubawa kepadamu dari negeri saba,” yaitu nama satu kabilah yang sangat terkenal di negeri yaman. “suatu berita yang diyakini,” maksudnya, berita yang sangat meyakinkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 22: Maka ketika hud-hud datang telat, dia mendatangi Sulaiman sambil berkata karena keterlambatannya : Sungguh aku telah membawa kabar yang penting, yang engkau tidak tahu akan hal itu (bersamaan dengan luasnya ilmumu), sungguh telah datang kepadamu wahai Nabi Allah dari kabilah saba di Yaman dengan membawa kabar yang penting dan pasti yang tanpa keraguan padanya. Ini adalah pelajaran bagi panglima, yang wajib bagi pemimpin pasukan beserta pasukan untuk selalu hadir dalam urusan umum, dan wajib memiliki ilmu atas pasukannya bagi yang memimpin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini menunjukkan rasa takut bala tentaranya kepada Nabi Sulaiman dan sangat tunduk mengikuti perintahnya, bahkan burung Hud-hud yang tertinggal karena uzur saja tidak berani terlambat terlalu lama. Saba’ nama kerajaan di zaman dahulu, letaknya dekat kota San'a; ibu kota Yaman sekarang ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 22",
    "description": "Maka tidak lama kemudian datanglah burung hudhud yang dicari cari, dan langsung menghadap nabi sulaiman. Lalu setelah ia di tanya oleh nabi sulaiman tentang keberadannya, dengan spontan ia berkata, dengan nada bangga 'aku telah mengetahui sesuatu yang belum engkau ketahui wahai baginda nabi sulaiman. Aku datang kepadamu dari negeri yang jauh yaitu negeri saba' di yaman dengan membawa suatu berita yang yang penting dan meyakinkan dan perlu engkau ketahui. \"23. Burung hudhud mulai bercerita. Sungguh, kudapati ada seorang perempuan berkedudukan sebagai ratu yang memerintah mereka yaitu penduduk negeri saba' di yaman, dan dia dianugerahi segala sesuatu apa yang dibutuhkannya berupa kekayaan, peralatan, persenjataan, dan lainnya, sesuai dengan kedudukannya sebagai pemimpin satu negeri, serta memiliki singgasana yang besar yang tidak ada tandingannya pada saat itu."
  }
]