[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya aku mendapati seorang wanita yang memerintah penduduk negeri Saba’, dan ia dianugerahi segala sesuatu dari berbagai bentuk kemewahan kehidupan dunia dan dia memiliki singgasana yang sangat besar bentuknya. Ia duduk dia atasnya untuk mengatur kerajaannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Sesungguhnya aku menjumpai seorang wanita yang memerintah mereka, dan wanita tersebut dianugerahi segala sesuatu berupa sarana kekuasaan, dan kerajaan, dan ia mempunyai singgasana besar yang dari atasnya ia mengatur seluruh perkara rakyatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-24. Aku melihat penduduk Saba dipimpin oleh seorang perempuan. Perempuan ini memiliki segala perkara dunia yang dibutuhkan raja, dan dia memiliki singgasana yang besar. Aku melihat mereka menyembah matahari yang mereka sembah selain Allah. Setan telah mengiasi perbuatan mereka menyembah matahari dan perbuatan buruk mereka yang lain, sehingga memalingkan mereka dari keimanan kepada Allah. Mereka tidak mendapat petunjuk menuju jalan kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. إِنِّى وَجَدتُّ امْرَأَةً تَمْلِكُهُمْ (Sesungguhnya aku menjumpai seorang wanita yang memerintah mereka) Pendapat mengatakan nama ratu itu adalah Bilqis binti Syurahbil. وَأُوتِيَتْ مِن كُلِّ شَىْءٍ(dan dia dianugerahi segala sesuatu) Yakni diberi sesuatu pada zamannya. وَلَهَا عَرْشٌ عَظِيمٌ (serta mempunyai singgasana yang besar) Makna (العرش) adalah singgasana raja. Terdapat pendapat mengatakan bahwa singgasana itu terbuat dari emas."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "23-25 1 ). Berkata Hudhud kepada Sulaiman tentang kerajaan saba' : { إِنِّى وَجَدتُّ ٱمْرَأَةً تَمْلِكُهُمْ } \"Sesungguhnya aku menjumpai seorang wanita yang memerintah mereka\" dia tidak mengatakan : \"seorang ratu memerintahkan mereka...\" padahal ia benar seorang ratu!!! namun seakan-akan Hudhud merendahkan kaum laki-laki yang urusan mereka diatur oleh seorang perempuan; maka ia datang dengan kalimat yang merendakan itu, dan menempatkan posisi perempuan dalam kehidupan nyata yang sesuai dengan naluri penciptaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Sesungguhnya aku menjumpai seorang wanita yang memerintah mereka, dia adalah Bilqis binti Syarahil. Dia dianugerahi segala sesuatu yang dia butuhkan, seperti peralatan perang dan tentara, serta mempunyai singgasana yang besar dan tinggi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya aku mendapati seorang perempuan yang memerintah mereka} yang memerintah penduduk Saba’ {Dia dianugerahi} Dia diberi {segala sesuatu dan memiliki singgasana yang besar} singgasana yang besar yang dia duduki untuk memerintah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23 kemudian ia menjelaskan berita tersebut, seraya berkata, “sesungguhnya aku menjumpai seorang wanita yang memerintah mereka,” maksudnya, memerintah suku saba’ dan dia adalah seorang perempuan.”dan dia dianugerahi segala sesuatu,” maksudnya, dia diberi kekuasaan berupa harta benda, perlengkapan senjata, bala tentara, benteng-benteng dan pagar kokoh, dan lain-lainnya. “serta mempunyai singgasana yang besar,” maksudnya, kursi kerajaannya yang dijadikannya sebagai tempat duduk adalah singgasana yang sangat besar. Besarnya singgasana membuktikan kebesaran kerajaan, kekuatan kekuasaan, dan banyaknya anggota dewan musyawarah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 23: Berkata hud-hud kepada Sulaiman : Wahai Nabi Allah, sesungguhnya aku mendapati perempuan (dikatakan bernama Bilqis), yang merajai kabila saba’. Ia datang dengan membawa segala sesuatu yang ada di kerajaannya, denga menampakkan kekuatan dan kekuasaan, aku juga mendapati perempuan tersebut memiliki kursi yang sangat besar yang ia duduk padanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu ratu Balqis yang memerintah kerajaan Saba di zaman Nabi Sulaiman. Yang dimiliki oleh para raja seperti harta, senjata, bala tentara, benteng, perhiasan dan perlengkapan lainnya. Yakni kursi yang ia duduki. Kursi itu begitu besar dan mewah, dihiasi emas, mutiara dan berbagai perhiasan. Besarnya kursi menunjukkan besarnya kerajaan, memiliki kekuatan dan banyaknya orang-orang yang hadir dalam musyawarah. Para Ahli Tarikh (sejarah) berkata, “Singgasana ini berada dalam istana yang besar, kokoh dan tinggi bangunannya. Di bagian timur terdapat 360 jendela, dan di bagian barat juga sama. Bangunannya dibuat agar siap dimasuki sinar matahari setiap hari lewat jendela dan ketika tenggelam berhadapan dengan matahari sehingga mereka sujud kepadanya di pagi dan sore hari.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 23",
    "description": "Burung hudhud mulai bercerita. Sungguh, kudapati ada seorang perempuan berkedudukan sebagai ratu yang memerintah mereka yaitu penduduk negeri saba' di yaman, dan dia dianugerahi segala sesuatu apa yang dibutuhkannya berupa kekayaan, peralatan, persenjataan, dan lainnya, sesuai dengan kedudukannya sebagai pemimpin satu negeri, serta memiliki singgasana yang besar yang tidak ada tandingannya pada saat itu. 24. Burung hudhud terus bercerita. \"aku kata burung hudhud, \" dapati dia, ratu itu, dan kaumnya menyembah sesuatu yang mereka anggap luar biasa yaitu matahari, bukan menyembah kepada Allah yang satu; dan setan yang telah bersumpah di hadapan Allah untuk terus mempedaya anak cucu adam sampai hari kiamat, telah menjadikan terasa indah bagi mereka perbuatan-perbuatan buruk mereka, seperti kemusyrikan, kekafiran dan kemaksiatan lainnya, sehingga setan mampu memperdayai dan menghalangi mereka dari jalan Allah, dengan tipu muslihatnya yang sangat halus. Maka karena mereka memilih berpihak kepada setan, mereka tidak mendapat petunjuk. \"."
  }
]