[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku mendapati dirinya dan kaumnya menyembah matahari, berpaling dari beribadah kepada Allah. dan setan menjadikan mereka memandang baik perbuatan-perbuatan buruk yang mereka lakukan. Maka setan membelokkan mereka dari iman kepada Allah dan bertauhid kepadaNya. Mereka tidak memperoleh petunjuk jalan menuju kepada Allah, bertauhid kepadaNya serta beribadah kepadaNya semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Aku mendapati wanita ini dan kaumnya menyembah matahari tanpa (menyembah) Allah -Subḥānahu wa Ta'ālā-; dan setan telah menjadikan mereka memandang indah perbuatan-perbuatan syirik dan maksiat itu, lalu memalingkan mereka dari jalan kebenaran, sehingga mereka tidak mendapatkan jalan petunjuk kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَجَدتُّهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِن دُونِ اللهِ (Aku mendapati dia dan kaumnya menyembah matahari, selain Allah) Mereka menyembah matahari selain menyembah Allah. وَزَيَّنَ لَهُمُ الشَّيْطٰنُ أَعْمٰلَهُمْ(dan syaitan telah menjadikan mereka memandang indah perbuatan-perbuatan mereka) Yakni perbuatan mereka menyembah matahari dan perbuatan kafir lainnya. فَصَدَّهُمْ عَنِ السَّبِيلِ(lalu menghalangi mereka dari jalan (Allah)) Akibat penghiasan amalan mereka itu setan berhasil menghalangi mereka dari jalan yang benar, yaitu keimanan kepada Allah dan mengesakan-Nya. فَهُمْ لَا يَهْتَدُونَ(sehingga mereka tidak dapat petunjuk) Menuju kebenaran dalam urusan agama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Aku mendapati dia dan kaumnya menyembah matahari, selain Allah; dan syaitan telah menjadikan mereka memandang indah perbuatan-perbuatan buruk mereka itu lalu menghalangi mereka dari jalan Allah, sehingga mereka tidak dapat petunjuk pada kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Aku mendapati dia dan kaumnya sedang menyembah matahari, bukan Allah. Setan telah menghiasi bagi mereka perbuatan-perbuatan mereka sehingga menghalangi mereka} sehingga menghalangi mereka {dari jalan (kebenaran)} jalan kebenaran {Mereka tidak mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24 ”aku mendapatinya dan kaumnya menyembah matahari, selain Allah,” maksudnya, mereka adalah orang-orang musyrik penyembah matahari. “dan setan telah menjadikan mereka memandang indah perbuatan-perbuatan mereka,” sehingga mereka melihat sesuatu yang mereka anut itulah yang benar. “sehingga mereka tidak dapat petunjuk,” karena orang ynag sudah berkeyakinan bahwa yang dianutnya itu benar, maka tidak mungkin bisa diharap mendapat petunjuk sehingga keyakinannya berubah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 24: Kemudian hud-hud berkata : Sungguh aku mendapatinya wahai Nabi Allah pada perempuan ini dan kaumnya menyekutukan Allah, mereka beribadah kepada matahari dan sujud kepada matahari (dengan menyembah) selain Allah, setan telah memperindah akan kesyirikan yang mereka lakukan; Setan mencegah dan menjauhkan mereka dari jalan tauhid dan iman, sehingga mereka terjatuh dalam kesesatan dan dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka melihat, bahwa perbuatannya benar. Karena yang menyangka dirinya benar, padahal salah sangat sulit diharapkan untuk mendapatkan hidayah sampai pandangannya berubah"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 24",
    "description": "Burung hudhud terus bercerita. \"aku kata burung hudhud, \" dapati dia, ratu itu, dan kaumnya menyembah sesuatu yang mereka anggap luar biasa yaitu matahari, bukan menyembah kepada Allah yang satu; dan setan yang telah bersumpah di hadapan Allah untuk terus mempedaya anak cucu adam sampai hari kiamat, telah menjadikan terasa indah bagi mereka perbuatan-perbuatan buruk mereka, seperti kemusyrikan, kekafiran dan kemaksiatan lainnya, sehingga setan mampu memperdayai dan menghalangi mereka dari jalan Allah, dengan tipu muslihatnya yang sangat halus. Maka karena mereka memilih berpihak kepada setan, mereka tidak mendapat petunjuk. \"25. \"mereka juga tidak menyembah Allah yang mengeluarkan apa yang terpendam di langit seperti air hujan dan di bumi seperi menumbuhkan tanam-tanaman, dan yang mengetahui apa yang kamu sembunyikan dalam hatimu dan yang kamu nyatakan dengan perkataanmu."
  }
]