[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Setan menjadikan mereka memandang baik terhadap perbuatan-perbuatan mereka (yang buruk) itu, agar mereka tidak bersujud kepada Allah Yang telah mengeluarkan hal-hal yang tersembunyi lagi tertutupi di langit dan di bumi seperti hujan, tanaman dan lain sebagainya. Dan Dia mengetahui apa yang kalian sembunyikan dan apa yang kalian tampakkan. Allah, Dia-lah Dzat Yang tiada sesembahan yang berhak diibadahi selainNya yang pantas untuk disembah. Dia Tuhan yang mempunyai Arasy yang agung yang merupakan makhluk yang paling besar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Setan telah menjadikan mereka memandang indah perbuatan syirik dan maksiat mereka; agar mereka tidak menyembah Allah semata, Żat Yang mengeluarkan apa yang tersimpan di langit berupa air hujan, dan yang Dia pendam di bumi berupa tetumbuhan, dan Dia mengetahui apa yang kalian sembunyikan dan nampakkan berupa amal perbuatan, serta tidak ada satu amal pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-26. Setan menghiasi hal itu bagi mereka agar mereka tidak bersujud kepada Dzat yang mengeluarkan hal yang tersembunyi di langit dan bumi, dan mengetahui segala yang kalian rahasiakan dan yang kalian tampakkan; Allah, tidak ada Tuhan yang berhak disembah selain Dia; Dia adalah Tuhan pemilik arsy yang merupakan makhluk yang paling besar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. أَلَّا يَسْجُدُوا۟ (agar mereka tidak menyembah Allah) Yakni setan membisikkan mereka “janganlah kalian menyembah Allah.” Pendapat lain mengatakan maknanya adalah setan menghiasi perbuatan yang mereka lakukan agar mereka tidak menyembah Allah. الَّذِى يُخْرِجُ الْخَبْءَ فِى السَّمٰوٰتِ وَالْأَرْضِ (Yang mengeluarkan apa yang terpendam di langit dan di bumi) Yakni menampakkan apa yang tersembunyi pada keduanya, yaitu air hujan dari langit dan tumbuhan dari bumi. Terdapat pendapat mengatakan yang dimaksud dengan sesuatu yang terpendam di bumi adalah harta karun, tanaman, dan sumber-sumber air yang ada di dalamnya. Pendapat lain mengatakan yang dimaksud adalah rahasianya. وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ (dan Yang mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan) Yakni Allah menyingkapkan apa yang tersembunyi dalam diri manusia dengan ilmu-Nya sebagaimana Dia menampakkan apa yang tersembunyi pada langit dan bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Para setan mengatakan bahwa amal mereka adalah amal indah agar mereka tidak menyembah Allah Yang mengeluarkan apa yang terpendam di langit seperti menampakkan bintang dan hujan. Juga yang ada di bumi dengan menumbuhkan tumbuhan dan rezeki. Yang mengetahui apa yang kamu sembunyikan dan apa yang kamu nyatakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak menyembah} setan menghiasi untuk mereka perbuatan mereka agar tidak menyembah {Allah yang mengeluarkan apa yang terpendam di langit dan di bumi} menampakkan sesuatu yang terpendam dan tersembunyi di langit dan bumi, berupa hujan dan tanaman {dan mengetahui apa yang kalian sembunyikan dan yang kalian nyatakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25 kemudian ia berkata,”mengapa tidak,” maksudnya, kenapa tidak,” mereka menyembah Allah yang mengeluarkan sesuatu yang terpendam di langit dan dibumi,” maksudnya, Dia mengetahui apa saja yang tersembunyi lagi terpendam di penjuru langit dan di segala penjuru bumi, berupa makhluk terkecil, bibit tumbuh-tumbuhan dan rahasia hati, dan yang mengeluarkan sesuatu yang tersimpan di dalam bumi dan langit dengan menurunkan hujan dan menumbuhkan tanaman dan mengeluarkan sesuatu yang tersimpan di dalam bumi (jasad manusia.) saat sangkakala ditiup dan dikeluarkannya orang-orang yang sudah mati dari tanah untuk memberikan pembalasan terhadap amal perbuatan mereka, “dan yang mengetahui sesuatu yang kamu sembunyikan dan sesuatu yang kamu nyatakan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 25: Hud-hud berkata : Sungguh setan telah menghiasi amalan-amalan mereka, sampai-sampai mereka meninggalkan sujud kepada Allah saja tanpa menyekutukan-Nya; Di mana Allah yang menampakkan apa yang tersembunyi dan tak kasat mata apa yang ada di langit dan di bumi seperti hujan, pertanian, tumbuhan, hewan-hewan melata dan Dialah yang mengetahui apa yang tersembunyi dalam dada-dada kalian, dan yang kalian tampakkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti menurunkan hujan dari langit, menumbuhkan tanam-tanaman, mengeluarkan logam, minyak bumi dari bumi, mengeluarkan orang-orang yang mati dari bumi (untuk dibangkitkan dan diberikan balasan), dsb. Dalam hatimu. Dengan lisanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 25",
    "description": "\"mereka juga tidak menyembah Allah yang mengeluarkan apa yang terpendam di langit seperti air hujan dan di bumi seperi menumbuhkan tanam-tanaman, dan yang mengetahui apa yang kamu sembunyikan dalam hatimu dan yang kamu nyatakan dengan perkataanmu. 26. \"dialah Allah, tidak ada tuhan yang wajib dan patut disembah melainkan dia. Dialah tuhan yang mempunyai 'arsy dan bersemayam di atas singgasana-Nya yang agung. '"
  }
]