[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "25-26. Setan menjadikan mereka memandang baik terhadap perbuatan-perbuatan mereka (yang buruk) itu, agar mereka tidak bersujud kepada Allah Yang telah mengeluarkan hal-hal yang tersembunyi lagi tertutupi di langit dan di bumi seperti hujan, tanaman dan lain sebagainya. Dan Dia mengetahui apa yang kalian sembunyikan dan apa yang kalian tampakkan. Allah, Dia-lah Dzat Yang tiada sesembahan yang berhak diibadahi selainNya yang pantas untuk disembah. Dia Tuhan yang mempunyai Arasy yang agung yang merupakan makhluk yang paling besar.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Allah, tiada Tuhan yang berhak disembah kecuali Dia, Tuhan Yang mempunyai Arasy yang besar\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. اللهُ لَآ إِلٰهَ إِلَّا هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ (Allah, tiada Tuhan Yang disembah kecuali Dia, Tuhan Yang mempunyai ‘Arsy yang besar”.) Allah menyebutkan ‘arsy karena ia adalah makhluk yang paling besar sebagaimana disebutkan dalam hadits marfu’."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Allah, Yang tiada Tuhan Yang patut disembah kecuali Dia, Tuhan Yang mempunyai ´Arsy yang besar, dikhususkan sebab “Arsy adalah ciptaan paling agung sebagaimana disebutkan dalam hadis marfu’ nabi Muhammad SAW. Kami mengimaninya tanpa membayangkannya dan menyerupakannya. Disunnahkan untuk melakukan sujud tilawah setelah selesai membaca al arsyil adhim untuk pembaca maupun pendengar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah, tidak ada tuhan selain Dia, Tuhan yang mempunyai ʻArsy yang agung ”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26 “Allah, tiada tuhan yang berhak disembah kecuali Dia,” maksudnya, penghambaan, inabah, rasa hina dan rasa cinta tidak pantas dipersembahkan kecuali hanya kepadaNya, sebab sesungguhnya Dia-lah sembahan, karena sifat-sifat yang sempurna yang dimilkiNya dank arena berbagai karunia (nikmatNya) yang mengharuskan akan hal itu. “Rabb yang mempunyai Arasy yang besar,” yang merupakan atap bagi seluruh makhluk ciptaanNya, dan yang melebihi luas langit dan bumi, maka Dzat Yang Maharaja ini sangat besar kekuasaanNya, sangat agung kedudukanNya. kepadaNya-lah tempat mengekspresikan rasa hina, tunduk, sujud dan rukuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 26: Allah mengabarkan bahwasanya tidak ada yang berhak di ibadahi kecuali Dia, dan bahwasanya Dialah Tuhan pemilik arsy yang agung, yang Dialah maha besar dari makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena Dia memiliki sifat-sifat sempurna, dan karena nikmat-nikmat yang diberikan-Nya menghendaki agar hanya menyembah kepada-Nya saja. Yang merupakan atap seluruh makhluk. Pemilik ‘Arsy tersebut adalah Raja Yang besar kekuasaan-Nya, yang berhak diruku’i dan disujudi, Dia menyelamatkan Hud-hud ketika ia menyampaikan berita besar ini, dan Nabi Sulaiman pun merasa takjub mengapa hal ini bisa samar bagi-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 26",
    "description": "\"dialah Allah, tidak ada tuhan yang wajib dan patut disembah melainkan dia. Dialah tuhan yang mempunyai 'arsy dan bersemayam di atas singgasana-Nya yang agung. ' 27. Mendengar laporan dari burung hudhud, dia, sulaiman, berkata, dengan nada memperingatkan, 'akan kami lihat, apa kamu benar terhadap apa yang engkau katakan, atau termasuk yang berdusta. \"."
  }
]