[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-28. Sulaiman berkata kepada hud-hud, “Kami akan analisa berita yang kamu bawa kepada kami, apakah kamu berkata jujur dalam perkara itu ataukah kamu termasuk orang-orang yang berdusta padanya. Pergilah dengan membawa suratku ini kepada penduduk negeri Saba’ itu, dan berikan surat itu kepada mereka, lalu menyingkirlah kamu dengan jarak yang masih dekat dari mereka di mana kamu tetap bisa mendengar perkataan mereka. Lalu perhatikanlah perbincangan yang terjadi diantara mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Sulaiman -'alaihissalām- berkata kepada Hudhud, \"Akan kami lihat, apakah engkau memang benar tentang kabar yang engkau klaim, ataukah engkau termasuk makhluk yang berdusta."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27-28. Sulaiman berkata kepada Hudhud: “Kami akan memastikan beritamu; apakah kamu jujur atau termasuk orang yang berdusta.” Maka Sulaiman menulis surat dan memerintahkan Hudhud mengirimnya kepada ratu negeri Saba’. Kemudian dia pergi untuk melihat jawaban apa yang akan mereka berikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. قَالَ (Berkata) Yakni Sulaiman berkata kepada hud-hud. سَنَنظُرُ (Akan kami lihat) Yakni kita saksikan kisah yang kamu kabarkan kepada kami. أَصَدَقْتَ(apa kamu benar) Dalam ucapanmu. أَمْ كُنتَ مِنَ الْكٰذِبِينَ(ataukah kamu termasuk orang-orang yang berdusta) Ayat ini mengandung anjuran untuk mengungkap berita dan menyingkap kebenarannya serta untuk tidak menerima kabar seseorang hanya kerena mengikuti perkataannya saja jika memungkinkannya untuk mencari kebenaran kabar tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Berkata Sulaiman kepada Hud hud: \"Akan kami lihat, apa kamu benar, ataukah kamu termasuk orang-orang yang berdusta.” Ini menunjukkan bahwa dianjurkan melakukan tabayun kepada berita dengan melihat kebenaran asli."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Sulaiman berkata kepada Hud-hud {“Kami akan memperhatikan apakah kamu benar atau termasuk orang-orang yang berdusta"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-28 maka selamatlah hud-hud itu setelah ia menyampaikan berita yang sangat besar itu, dan sulaiman pun merasa sangat heran, bagaimana bisa berita ini luput dari pengetahuannya, kemudian dia berkata seraya meneguhkan kesempurnaan dan kematangan akalnya, “akan kami lihat, apa kamu benar, ataukah kamu termasuk orang-orang yang berdusat. Pergilah dengan (membawa) suratku ini,” nashnya akan disebutkan pada ayat berikutnya, “lalu jatuhkanlah kepada mereka, kemudian berpalinglah dari mereka,” maksudnya, mundur dengan tidak terlalu jauh. “lalu perhatikanlah apa yang mereka kembalikan,” kepadamu, dan apa yang mereka bicarakan tentang isi surat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 27: Sulaiman berkata kepada hud-hud : Aku akan melihat dan memperhatikan akan kabar ini yang telah datang padaku, apakah engkau jujur sehingga aku memaafkanmu ? atau engkau dusta atas apa yang telah engkau kabarkan yang menyelisihi akan realitanya ?."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada burung Hud-hud. Disebutkan dalam Tafsir Al Baghawi dan Al Jalaalain, bahwa burung Hud-hud menunjukkan tempat air kepada mereka, lalu mereka menggali sumur-sumur tersebut, kemudian bala tentaranya meminum airnya hingga hilang dahaganya, lalu berwudhu’ dan shalat, kemudian Nabi Sulaiman menuliskan surat, yang isinya: Dari hamba Allah Sulaiman bin Dawud kepada Balqis ratu Saba, “Dengan menyebut nama Allah Yang Maha Pengasih lagi Maha Penyayang, salam atas orang yang mengikuti petunjuk, amma ba’du: “Janganlah engkau berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri.” Ibnu Juraij berkata, “Sulaiman tidak menuliskan lebih dari apa yang diceritakan Allah dalam kitab-Nya.” Qatadah berkata, “Demikianlah para nabi, menulis beberapa kalimat secara garis besar; tidak panjang dan tidak banyak.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 27",
    "description": "Mendengar laporan dari burung hudhud, dia, sulaiman, berkata, dengan nada memperingatkan, 'akan kami lihat, apa kamu benar terhadap apa yang engkau katakan, atau termasuk yang berdusta. \"28. Untuk melacak kebenaran pengakuan burung hudhud, nabi sulaiman memerintahkannya untuk pergi ke negeri saba' dan berkata, \"pergilah engkau ke negeri ratu itu, dengan membawa suratku ini, lalu jatuhkanlah kepada mereka, ratu balqis dan pembesarnya, kemudian berpalinglah dan menghindarlah dari mereka, lalu perhatikanlah reaksi mereka terhadap isi surat itu dan perhatikan apa yang mereka bicarakan. '."
  }
]