[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "27-28. Sulaiman berkata kepada hud-hud, “Kami akan analisa berita yang kamu bawa kepada kami, apakah kamu berkata jujur dalam perkara itu ataukah kamu termasuk orang-orang yang berdusta padanya. Pergilah dengan membawa suratku ini kepada penduduk negeri Saba’ itu, dan berikan surat itu kepada mereka, lalu menyingkirlah kamu dengan jarak yang masih dekat dari mereka di mana kamu tetap bisa mendengar perkataan mereka. Lalu perhatikanlah perbincangan yang terjadi diantara mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Maka Sulaiman pun menulis sepucuk surat dan menyerahkannya kepada Hudhud, dan ia mewasiatkannya, \"Pergilah dengan membawa suratku ini, lalu jatuhkan dan serahkanlah kepada mereka, kemudian beralihlah ke tempat yang tidak jauh dari mereka sehingga kamu bisa mendengar apa yang mereka bicarakan tentang isi surat ini.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. اذْهَب بِّكِتٰبِى هٰذَا فَأَلْقِهْ إِلَيْهِمْ (Pergilah dengan (membawa) suratku ini, lalu jatuhkan kepada mereka) Yakni kepada penduduk negeri Saba’. ثُمَّ تَوَلَّ عَنْهُمْ(kemudian berpalinglah dari mereka) Yakni pergilah agak menjauh dari mereka ke tempat yang masih memungkinkanmu mendengar perkataan mereka. Hal ini agar ia masih dapat menceritakan kepada Sulaiman apa yang ia dengar. فَانظُرْ مَاذَا يَرْجِعُونَ(lalu perhatikanlah apa yang mereka bicarakan) Yakni dengarkanlah percakapan yang berjalan di antara mereka. Kemudian hud-hud pergi ke Saba’ dan melempar surat itu kepada mereka, lalu agak menjauh dan ia mendengar percakapan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Kemudian Sulaiman menulis sebuah surat, dan berkata kepada Hud hud: Pergilah dengan membawa suratku ini, lalu jatuhkan kepada mereka, kemudian pergilah ke tempat yang tidak jauh, lalu perhatikanlah apa yang mereka bicarakan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pergilah dengan tulisanku ini, lalu berilah kepada mereka. Kemudian berpalinglah dari mereka} tinggalkanlah mereka menuju tempat yang dekat untuk bersembunyi {lalu perhatikanlah} lalu lihatlah dan perhatikanlah {jawaban mereka} jawaban yang mereka berikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27-28 maka selamatlah hud-hud itu setelah ia menyampaikan berita yang sangat besar itu, dan sulaiman pun merasa sangat heran, bagaimana bisa berita ini luput dari pengetahuannya, kemudian dia berkata seraya meneguhkan kesempurnaan dan kematangan akalnya, “akan kami lihat, apa kamu benar, ataukah kamu termasuk orang-orang yang berdusat. Pergilah dengan (membawa) suratku ini,” nashnya akan disebutkan pada ayat berikutnya, “lalu jatuhkanlah kepada mereka, kemudian berpalinglah dari mereka,” maksudnya, mundur dengan tidak terlalu jauh. “lalu perhatikanlah apa yang mereka kembalikan,” kepadamu, dan apa yang mereka bicarakan tentang isi surat ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 28: Sulaiman menulis risalah untuk raja saba’, diperintahkan hud-hud untuk membawa kepada raja tersebut, dan diberikan kepadanya, kemudian bergeser untuk mendengar respon raja tersebut dan komentarnya atas risalah (dari Sulaiman)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Balqis dan kaumnya. Yakni, dan berdiamlah tidak jauh dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 28",
    "description": "Untuk melacak kebenaran pengakuan burung hudhud, nabi sulaiman memerintahkannya untuk pergi ke negeri saba' dan berkata, \"pergilah engkau ke negeri ratu itu, dengan membawa suratku ini, lalu jatuhkanlah kepada mereka, ratu balqis dan pembesarnya, kemudian berpalinglah dan menghindarlah dari mereka, lalu perhatikanlah reaksi mereka terhadap isi surat itu dan perhatikan apa yang mereka bicarakan. '29. Setelah surat nabi sulaiman sampai ke tangan ratu balqis dan ia memahami isi surat tersebut, dia, ratu itu, berkata kepada para pembesar kerajaan, 'wahai para pembesar! ada berita amat penting yang perlu kamu ketahui, sesungguhnya telah disampaikan kepadaku sebuah surat yang mulia karena mengandung ungkapan yang beretika, bijak, dan mengandung banyak hikmah. \"."
  }
]