[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hud-hud pergi dan menjatuhkan surat itu kepada sang ratu. Kemudian sang ratu membacanya dan mengumpulkan seluruh pembesar dari kaumnya. Hud-hud mendengar ratu itu berkata kepada mereka, “Sesungguhnya telah sampai kepadaku surat yang isinnya penting dari seseorang yang berkedudukan agung.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Lalu surat itu diterima oleh sang ratu. Dia berkata, \"Wahai para pembesar! Sesungguhnya telah dijatuhkan kepadaku sepucuk surat yang mulia lagi agung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29-31. Ketika ratu Saba menerima surat yang mulia itu, dia mengumpulkan para pembesar kaumnya dan menyampaikan kepada mereka dengan penuh kehormatan untuk meminta pendapat dan bantuan: “Wahai para petinggi kaum, telah datang kepadaku surat yang mulia dari Sulaiman, dia mengawali suratnya dengan ‘Bismillahirrahmanirrahim. Janganlah kalian membangkang terhadapku, dan menghadaplah kepadaku dengan penuh ketundukan kepada agama Allah.’"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. قَالَتْ (Berkata ia) Yakni Bilqis berkata. يٰٓأَيُّهَا الْمَلَؤُا۟ إِنِّىٓ أُلْقِىَ إِلَىَّ كِتٰبٌ كَرِيمٌ (Hai pembesar-pembesar, sesungguhnya telah dijatuhkan kepadaku sebuah surat yang mulia) Bilqis memuliakan surat itu sebagai penghormatan bagi Sulaiman dan karena surat itu mengandung perkataan yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Bilqis berkata: \"Hai pembesar-pembesar, sesungguhnya telah dijatuhkan sebuah surat yang mulia kepadaku. Karena terdapat tanda tangan raja yang agung”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai para pembesar} para pembesar {sesungguhnya telah disampaikan kepadaku sebuah surat yang mulia”} yang sangat penting"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-31 maka burung itu pun pergi, lalu menjatuhkan surat itu pada sang ratu. Dan ia (sang ratu) berkata kepada kaumnya, ”sesungguhnya telah dijatuhkan kepadaku sebuah surat yang mulia,” maksudnya, surat yang berharga, berasal dari raja yang sangat besar di bumi ini. Kemudian ia menjelaskan isinya, seraya berkata, ”sesungguhnya surat itu dari sulaiman, dan sesungguhnya (isi) nya, ’dengan menyebut nama Allah Yang Mahapemurah lagi Mahapenyayang, bahwa janganlah kamu berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri’,” maksudnya, jangan sampai kalian berada di atasku, akan tetapi tunduklah kalian di bawah kekuasaanku, dan patuhilah perintah-perintahku serta datanglah kalian kepadaku dengan berserah diri. Ini kalimat yang sangta ringkas disertai penjelasan yang sempurna, karena ia mencakup larangannya dari tindakan sombong dan menetapi keadaan sesat mereka selama ini, tunduk kepada perintahnya, bergabung dibawah (panji) ketaatan kepadanya, dan datang menghadapnya serta mengajak mereka kepada islam. Di dalamnya terkandung kesunnahan memulai tulis menulis dengan ungkapan basmallah secara sempurna, dan mendahulukan nama di awal judul tulisan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 29: Hud-hud memenuhi apa yang diperitahkan padanya, maka diberikanlah risalah tersebut, kemudian bersiap mendengar. Diambilah risalah tersebut oleh raja perempuan itu, kemudian dikumpulkanlah para pembesar yang mulia dari kaumnya dan berkata : Burung tersebut telah datang kepada kita membawa risalah yang besar urusannya, yang agung imbasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lalu burung Hud-hud membawa pergi surat itu dan menjatuhkannya kepada ratu Balqis. Yakni yang sangat agung, dari salah seorang raja besar di dunia. Ada pula yang menafsirkan dengan, “Yang diberi cap.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 29",
    "description": "Setelah surat Nabi Sulaiman sampai ke tangan Ratu Balqis dan ia memahami isi surat tersebut, dia, ratu itu, berkata kepada para pembesar kerajaan, ?Wahai para pembesar! Ada berita amat penting yang perlu kamu ketahui, sesungguhnya telah disampaikan kepadaku sebuah surat yang mulia karena mengandung ungkapan yang beretika, bijak, dan mengandung banyak hikmah.\"30-31. Ratu melanjutkan perkataannya, \"Sesungguhnya surat itu dari seorang yang bernama Sulaiman yang isinya, 'Dengan nama Allah Yang Maha Pengasih, Maha Penyayang.' Nabi Sulaiman meingingatkan kepada Balqis, 'Janganlah engkau berlaku sombong terhadapku sebagaimana yang dilakukan oleh para penguasa lain, dan datanglah kepadaku sebagai orang-orang yang berserah diri.' dengan tidak memperlihatkan perlawanan.\""
  }
]