[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang menegakkan shalat lima waktu dengan melaksanakan rukun-rukunnya yang sempurna dan memenuhi syarat-syarat, juga membayarkan zakat yang wajib kepada orang-orang yang berhak menerimanya, dan mereka itu meyakini terhadap kehidupan akhirat, dan pahala serta siksaan yang ada padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. yaitu orang-orang yang mendirikan salat secara sempurna, dan menunaikan zakat harta mereka dengan menyalurkannya kepada yang berhak menerimanya, dan mereka yakin akan adanya pahala dan azab di Akhirat kelak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Yaitu orang-orang yang mendirikan shalat pada waktu dan aturan syariatnya dengan sempurna. Serta yang menunaikan zakat wajib dan mereka yakin dengan sepenuh hati akan adanya negeri akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menegakkan shalat, menunaikan zakat, dan meyakini akhirat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3 barangkali ada yang mengatakan: sudah banyak sekali orang yang mengklaim beriman. Apakah diterima dari setiap orang yang mengklaim bahwa dirinya adalah seorang Mukmin? Atau harus ada bukti yang benar? Maka dari itu, Allah menjelaskan sifat (ciri) orang-orang beriman, seraya berfirman, ”(yaitu) orang-orang yang mendirikan shalat,” yang wajib dan yang Sunnah. Mereka melakukannya dengan aturan-aturannya yang nampak, berupa rukun-rukun, syarat-syarat, kewajiban-kewajiban bahkan Sunnah-sunnahnya, dan lengkap dengan amalnya yang batin, yaitu khusu’ yang merupakan jiwa dan substansinya, yaitu dengan merasakan kedekatan Allah dan menghayati apa yang dibaca dan dilakukan oleh orang yang shalat, ”dan menunaikan zakat,” yang wajib berhak menerimanya, “dan mereka yakin akan adanya negeri akhirat,” maksudnya, keimanan mereka telah mencapai pada tingkat yakin, yaitu ilmu yang sempurna yang sampai kedalam hati, lagi mendorong untuk beramal. Keyakinan mereka pada akhirat mengharuskan keseriusan usaha mereka untuk menghadapinya dan mewaspadai segala hal yang bisa menjadi sebab siksaan dan hukuman. Ini adalah dasar kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 3: Allah menjelaskan bahwa di antara sifat mereka orang-orang yang beriman : mereka menegakkan shalat yang lima yang wajib bagi mereka secara sempurna dengan syarat-syaratnya, rukun-rukunnya, wajib-wajibnya dalam waktu-waktu yang telah ditentukan, mereka juga menunaikan zakat yang diwajibkan bagi mustahiknya dengan ikhlas dan memperbaiki jiwa serta yakin dengan kehidupan akhirat dan apa yang padanya terdapat pahala dan hukuman, surga dan neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mungkin seseorang ada yang berkata, “Boleh jadi banyak orang yang mengaku beriman, lalu apakah dapat diterima pengakuannya sebagai mukmin? Ataukah harus ada pembuktian terhadapnya? Inilah yang benar, yakni harus ada bukti terhadap keimanannya. Oleh karena itu, di sini Allah Subhaanahu wa Ta'aala menerangkan sifat orang-orang mukmin. Sesuai dengan cara yang diperintahkan, baik shalat fardhu maupun sunat. Mereka mengerjakan perbuatan-perbuatannya yang tampak seperti rukun maupun syaratnya serta yang wajibnya, bahkan yang sunatnya, serta mengerjakan perbuatan-perbuatan yang tersembunyi, yaitu khusyu’ yang merupakan ruh shalat itu dengan menghadirkan perasaan dekatnya Allah serta mentadabburi apa yang dbaca dan dilakukan. Kepada mustahiknya. Iman yang ada pada mereka telah mencapai derajat yakin, yang merupakan ilmu yang maksimal yang menancap ke dalam hati dan menghendaki beramal. Keyakinan mereka kepada akhirat menghendaki untuk menyempurnakan usaha mereka serta mengingatkan mereka terhadap sebab-sebab azab dan hukuman, dan ini merupakan modal semua kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 3",
    "description": "Orang yang beriman adalah orang-orang melaksanakan salat sesuai dengan syarat dan rukunnya, dan melakukannya terus menerus sepanjang hayat, dan menunaikan zakat, sebagai bentuk kewajiban dan rasa syukur kepada Allah atas limpahan rezeki-Nya, dan mereka meyakini adanya kebangkitan manusia dan kehidupan abadi pada hari akhirat. 4. Sesungguhnya orang-orang yang tidak beriman kepada akhirat, dan menganggapnya sebagai satu kemustahilan belaka, kami jadikan terasa indah bagi mereka perbuatan-perbuatan mereka yang buruk, seperti kemusyrikan, dan segala bentuk kemaksiatan, sehingga mereka bergelimang dalam kesesatan."
  }
]