[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Kemudian sang ratu menjelaskan isi surat itu dengan berkata, “ Sesungguhnya surat itu dari Sulaiman dan sesungguhnya ia dibuka dengan tulisan ‘Bismillahirrahmanirrahim. Janganlah kalian berlaku sombong dan bersikap congkak terhadap apa yang aku seru kalian kepadanya. Datanglah kepadaku dengan patuh kepada Allah dengan mengesakan dan ketaatan, lagi berserah diri kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Kandungan surat yang dikirimkan Sulaiman kepadaku ini dibuka dengan ungkapan, \"Dengan menyebut nama Allah Yang Maha Pemurah lagi Maha Penyayang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. إِنَّهُۥ مِن سُلَيْمٰنَ وَإِنَّهُۥ بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيمِ (Sesungguhnya surat itu, dari SuIaiman dan sesungguhnya (isi)nya: “Dengan menyebut nama Allah Yang Maha Pemurah lagi Maha Penyayang) Yakni surat itu dibuka dengan basmalah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Sesungguhnya surat itu, dari SuIaiman bin Dawud dan berisi: \"Dengan menyebut nama Allah Yang Maha Pemurah lagi Maha Penyayang."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya tulisan itu} tulisan itu {dari Sulaiman dan isinya} dan yang tertulis {Dengan nama Allah Yang Maha Pengasih lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-31 maka burung itu pun pergi, lalu menjatuhkan surat itu pada sang ratu. Dan ia (sang ratu) berkata kepada kaumnya, ”sesungguhnya telah dijatuhkan kepadaku sebuah surat yang mulia,” maksudnya, surat yang berharga, berasal dari raja yang sangat besar di bumi ini. Kemudian ia menjelaskan isinya, seraya berkata, ”sesungguhnya surat itu dari sulaiman, dan sesungguhnya (isi) nya, ’dengan menyebut nama Allah Yang Mahapemurah lagi Mahapenyayang, bahwa janganlah kamu berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri’,” maksudnya, jangan sampai kalian berada di atasku, akan tetapi tunduklah kalian di bawah kekuasaanku, dan patuhilah perintah-perintahku serta datanglah kalian kepadaku dengan berserah diri. Ini kalimat yang sangta ringkas disertai penjelasan yang sempurna, karena ia mencakup larangannya dari tindakan sombong dan menetapi keadaan sesat mereka selama ini, tunduk kepada perintahnya, bergabung dibawah (panji) ketaatan kepadanya, dan datang menghadapnya serta mengajak mereka kepada islam. Di dalamnya terkandung kesunnahan memulai tulis menulis dengan ungkapan basmallah secara sempurna, dan mendahulukan nama di awal judul tulisan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 30: Kemudian raja tersebut berkata : Risalah ini telah datang kepadaku dari seorang raja yang teragung di antara raja-raja di bumi, raja tersebut berkata : (dari) Sulaiman yang di dalamnya terkandung Bismillahirrahmanirrahim."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para ulama berkata, “Belum ada seorang pun yang menulis, “Bismillahirrahmaanirrahim” sebelum Nabi Sulaiman ‘alaihis salam.” Dalam ayat ini terdapat anjuran memulai tulisan dengan basmalah. Oleh karena kematangan dan kecerdasan akalnya, maka ratu Balqis segera mengumpulkan para pembesar kerajaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 30",
    "description": "30-31. Ratu melanjutkan perkataannya, \"Sesungguhnya surat itu dari seorang yang bernama Sulaiman yang isinya, 'Dengan nama Allah Yang Maha Pengasih, Maha Penyayang.' Nabi Sulaiman meingingatkan kepada Balqis, 'Janganlah engkau berlaku sombong terhadapku sebagaimana yang dilakukan oleh para penguasa lain, dan datanglah kepadaku sebagai orang-orang yang berserah diri.' dengan tidak memperlihatkan perlawanan.\"30-31. Ratu melanjutkan perkataannya, \"Sesungguhnya surat itu dari seorang yang bernama Sulaiman yang isinya, 'Dengan nama Allah Yang Maha Pengasih, Maha Penyayang.' Nabi Sulaiman meingingatkan kepada Balqis, 'Janganlah engkau berlaku sombong terhadapku sebagaimana yang dilakukan oleh para penguasa lain, dan datanglah kepadaku sebagai orang-orang yang berserah diri.' dengan tidak memperlihatkan perlawanan.\""
  }
]