[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Kemudian sang ratu menjelaskan isi surat itu dengan berkata, “ Sesungguhnya surat itu dari Sulaiman dan sesungguhnya ia dibuka dengan tulisan ‘Bismillahirrahmanirrahim. Janganlah kalian berlaku sombong dan bersikap congkak terhadap apa yang aku seru kalian kepadanya. Datanglah kepadaku dengan patuh kepada Allah dengan mengesakan dan ketaatan, lagi berserah diri kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Bahwa janganlah kalian berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang taat lagi berserah diri terhadap apa yang aku dakwahkan kepada kalian berupa pengesaan Allah, dan meninggalkan kesyirikan kepada-Nya yang kalian lakukan, sebab kalian telah menyembah matahari sebagai tuhan disamping Allah\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. أَلَّا تَعْلُوا۟ عَلَىَّ (Bahwa janganlah kamu sekalian berlaku sombong terhadapku) Ykani janganlah kamu menyombongkan diri seperti yang dilakukan raja-raja yang kejam. وَأْتُونِى مُسْلِمِينَ (dan datanglah kepadaku sebagai orang-orang yang berserah diri) Yakni dengan penuh ketaatan pada agama yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Isi surat: Janganlah kamu sekalian berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri. Yaitu dengan masuk kepada aagama Allah dan beriman kepada risalah-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah berlaku sombong terhadapku} janganlah kamu sombong kepadaku {dan datanglah kepadaku sebagai orang-orang yang berserah diri”} orang-orang yang tunduk lagi berserah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29-31 maka burung itu pun pergi, lalu menjatuhkan surat itu pada sang ratu. Dan ia (sang ratu) berkata kepada kaumnya, ”sesungguhnya telah dijatuhkan kepadaku sebuah surat yang mulia,” maksudnya, surat yang berharga, berasal dari raja yang sangat besar di bumi ini. Kemudian ia menjelaskan isinya, seraya berkata, ”sesungguhnya surat itu dari sulaiman, dan sesungguhnya (isi) nya, ’dengan menyebut nama Allah Yang Mahapemurah lagi Mahapenyayang, bahwa janganlah kamu berlaku sombong terhadapku dan datanglah kepadaku sebagai orang-orang yang berserah diri’,” maksudnya, jangan sampai kalian berada di atasku, akan tetapi tunduklah kalian di bawah kekuasaanku, dan patuhilah perintah-perintahku serta datanglah kalian kepadaku dengan berserah diri. Ini kalimat yang sangta ringkas disertai penjelasan yang sempurna, karena ia mencakup larangannya dari tindakan sombong dan menetapi keadaan sesat mereka selama ini, tunduk kepada perintahnya, bergabung dibawah (panji) ketaatan kepadanya, dan datang menghadapnya serta mengajak mereka kepada islam. Di dalamnya terkandung kesunnahan memulai tulis menulis dengan ungkapan basmallah secara sempurna, dan mendahulukan nama di awal judul tulisan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 31: Berkata raja tersebut : Sungguh Sulaiman berkata dalam risalah ini : Jangan merasa tinggi atasku dan jangan merasa bisa keluar dari kerajaanku, datanglah kepadaku dengan berserah diri kepada Allah, tunduk akan perintahku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka pun mengetahui, bahwa surat itu berasal dari Nabi Sulaiman ‘alaihis salam. Surat ini begitu fasih dan ringkas, karena maksudnya sudah tercapai dalam kata-kata yang singkat dan bagus itu. Di dalamnya terkandung larangan bagi mereka bersikap sombong terhadapnya, tetap di atas keadaannya (yakni menyembah matahari), serta memerintahkan mereka taat dan tunduk kepadanya, serta mengajak mereka kepada Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 31",
    "description": "30-31. Ratu melanjutkan perkataannya, \"Sesungguhnya surat itu dari seorang yang bernama Sulaiman yang isinya, 'Dengan nama Allah Yang Maha Pengasih, Maha Penyayang.' Nabi Sulaiman meingingatkan kepada Balqis, 'Janganlah engkau berlaku sombong terhadapku sebagaimana yang dilakukan oleh para penguasa lain, dan datanglah kepadaku sebagai orang-orang yang berserah diri.' dengan tidak memperlihatkan perlawanan.\"32. Mengingat penting dan seriusnya persoalan ini, dia, Balqis, berkata kepada para pembesar itu, untuk meminta pertimbangan, ?Wahai para pembesar! Berilah aku pertimbangan dari kalian dalam perkaraku ini. Apa yang harus aku perbuat? Walaupun aku sebagai pemimpin tunggal bagi kamu, Aku tidak pernah memutuskan suatu perkara sebelum kamu hadir dalam majelis-ku untuk bermusyawarah bagaimana sebaiknya menyikapi surat Sulaiman ini.\""
  }
]