[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sang ratu berkata, “Wahai para pembesar, sampaikanlah kepadaku pendapat kalian dalam perkara ini. Aku tidaklah memutuskan dalam suatu perkara kecuali dengan kehadiran kalian dan pertimbangan dari kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Ratu itu berkata, \"Wahai para pembesar dan pemuka kaumku! Berilah aku saran yang benar dalam urusanku ini, sebab aku tidak pernah memutuskan suatu persoalan hingga kalian berkumpul di majelisku dan memberiku saran dan pendapat kalian\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Kemudian sang ratu mengulangi perkataannya dengan penuh penghormatan dalam bermusyawarah seraya menyatakan bahwa dia tidak akan mengambil keputusan sebelum mendapat pandangan dari para petinggi itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. قَالَتْ يٰٓأَيُّهَا الْمَلَؤُا۟ أَفْتُونِى فِىٓ أَمْرِى (Berkata dia (Balqis): “Hai para pembesar berilah aku pertimbangan dalam urusanku) Yakni Hai para pemuka kaum, berikanlah aku pendapat dan jelaskanlah padaku keputusan yang benar dalam perkara ini serta berikanlah aku jawaban terbaik. مَا كُنتُ قَاطِعَةً أَمْرًا حَتَّىٰ تَشْهَدُونِ(aku tidak pernah memutuskan sesuatu persoalan sebelum kamu berada dalam majelis(ku)) Aku tidak pernah memutuskan suatu perkara sebelum kalian duduk bersamaku untuk memberi pendapat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Bilqis menjawab: \"Hai para pembesar berilah aku pertimbangan dalam urusanku ini, aku tidak pernah memutuskan sesuatu persoalan sebelum kalian berada dalam majelisku\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai para pembesar, berilah aku nasehat dalam urusanku} jelaskanlah kepadaku terkait hal yang benar dalam perkara yang menimpaku ini {Aku tidak memutuskan suatu urusan} menentukan suatu keputusan {sampai kalian menyaksikan} kalian hadir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32-33 di antara hal yang menunjukkan ketegasan dan kematangan akal si ratu itu adalah ia segera mengumpulkan para tokoh kerajaannya dan para pembesar negaranya, lalu berkata,”hai para pembesar, berilah aku pertimbangan dalam urusanku (ini),” maksudnya, sampaikan kepadaku apa yang akan kita jawabkan kepadanya?! Apakah kita masuk saja pada kekuasaannya, kita tunduk, atau apa yang harus kita lakukan?! “aku tidak pernah memutuskan suatu persoalan sehingga kalian hadir dalam majelisku,” maksudnya, aku sekali-kali tidak bersikap dictator dalam suatu perkara tanpa melibatkan pendapat dan musyawarah kalian. “mereka menjawab, ’kita adalah orang-orang yang memilki kekuatan dan (juga) memiilki keberanian yang sangat,” maksudnya, kalau engkau menolak perkataannya dan engkau tidak mau tunduk kepadanya, maka sesungguhnya kami adalah orang-orang yang kuat dalam peperangan. Nampaknya mereka lebih condong pada pendapat yang terakhir ini yang kalau saja terjadi, maka ia akan menjadi kebinasaan mereka. Akan tetapi mereka juga tidak terlalu mantap padanya, maka mereka mengatakan, ”dan keputusan berada ditanganmu,” maksudnya, keputusannya adalah keputusanmu. Hal ini disebabkan mereka tahu kecerdasan akalnya, ketegasannya dan ketulusannya kepada mereka. “maka pertimbangkanlah,” dengan pertimbangan akal dan pikiran, “apa yang akan kamu perintahkan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 32: Raja tersebut berkata kepada seorang pembesar dan laki-laki yang paling mulia di negerinya : Wahai kaum, isyaratkan kepadaku dan kabarkan kepadaku apa yang harus aku perbuat atas urusan ini dan tidaklah aku termasuk orang yang keras kepada dalam berpendapat dan tidak juga lamban dalam urusan, sampai-sampai aku mengambil pendapat kalian dan isyarat dari kalian (saat ini)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah kita harus tunduk dan taat kepadanya atau apa yang kita lakukan? Yakni tidak memutuskan sendiri atau sewenang-wenang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 32",
    "description": "Mengingat penting dan seriusnya persoalan ini, dia, balqis, berkata kepada para pembesar itu, untuk meminta pertimbangan, 'wahai para pembesar! berilah aku pertimbangan dari kalian dalam perkaraku ini. Apa yang harus aku perbuat' walaupun aku sebagai pemimpin tunggal bagi kamu, aku tidak pernah memutuskan suatu perkara sebelum kamu hadir dalam majelis-ku untuk bermusyawarah bagaimana sebaiknya menyikapi surat sulaiman ini. \"33. Mendengar permintaan ratu balqis, mereka, para pemuka itu, menjawab sebagai bentuk loyalitas mereka yang tinggi terhadap sang ratu, 'baginda ratu! 'kita memiliki kekuatan dan keberanian yang luar biasa untuk berperang, tetapi meskipun demikian, keputusan terakhir berada di tanganmu, wahai paduka yang mulia! maka pertimbangkanlah apa yang akan engkau perintahkan. ' kami akan turuti apa yang engkau perintahkan kepada kami. \"."
  }
]