[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata menjawabnya, “Kita ini adalah orang-orang yang memiliki kekuatan dalam jumlah personel dan persenjataan dan kita adalah orang-orang yang bernyali tinggi dan berkeberanian dalam mengarungi pertempuran yang sengit, sedang (putusan) urusan ini terserah kepadamu, dan engkau adalah pemimpin yang berpikiran lurus, maka renungkanlah apa yang akan engkau perintahkan kepada kami? Kami akan dengar keputusanmu dan taat kepadamu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Para pemuka kaumnya tersebut menjawab, \"Kita adalah orang-orang yang memiliki kekuatan yang dahsyat, dan juga memiliki keberanian yang sangat dalam peperangan, sedang keputusan berada di tanganmu, maka pertimbangkanlah apa yang akan engkau perintahkan pada kami, sebab kami pasti kuasa untuk melaksanakannya\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Mereka menjawab dengan sindiran agar melawan Sulaiman dengan kekuatan tentara: “Kita sangat kuat dalam pasukan, senjata, dan harta; dan kita memiliki keteguhan dan ketangguhan dalam berperang. Namun keputusan ada di tanganmu, maka cermatilah perintah yang akan engkau berikan kepada kami.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. قَالُوا۟ (Mereka menjawab) Maka mereka memberi mereka jawaban. نَحْنُ أُو۟لُوا۟ قُوَّةٍ(Kita adalah orang-orang yang memiliki kekuatan) Dalam jumlah bala tentara dan persiapannya. وَأُو۟لُوا۟ بَأْسٍ شَدِيدٍ(dan (juga) memiliki keberanian yang sangat) Dalam peperangan dan pertempuran, kita memiliki keberanian dan bala bantuan untuk melindungi diri, negeri, dan kerajaan kita. وَالْأَمْرُ إِلَيْكِ(dan keputusan berada ditanganmu) Yakni keputusan kembali pada pendapatmu فَانظُرِى مَاذَا تَأْمُرِينَ(maka pertimbangkanlah apa yang akan kamu perintahkan) Yakni perhatikanlah apa yang akan kamu perintahkan kepada kami, dan kami akan mendengar dan mentaati perintah itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Apa lagi yang ditunggu oleh kerajaan Saba' jika kerajaan mereka diatur oleh sorang ratu yang selalu meminta pendapat dari pendapat yang dipenuhi oleh tipu daya: { قَالُوا نَحْنُ أُولُو قُوَّةٍ وَأُولُو بَأْسٍ شَدِيدٍ } tanpa melihat kedudukan dan kekuatan siapa yang mengirimkan surat itu, dan kebodohan apa lagi yang akan mereka kerjakan untuk negara mereka semacam pendapat yang satu ini? ini hasil yang nyata ketika kepemimpinan diserahkan kepada orang yang bukan ahlinya!! 2 ). Sejenak terkejut melihat ucapan penasehat kerajaan Saba' tatkala mereka mengatakan : { قَالُوا نَحْنُ أُولُو قُوَّةٍ وَأُولُو بَأْسٍ شَدِيدٍ } setelah mereka diminta pendapat dan sikap netral, jawaban mereka memberi sumbangsi untuk sistem pemeritahan yang diatur dengan sewenang-wenang, tanpa mempertimbangkan sistem musyawarah pada peristiwa semacam ini yang menentukan keberlangsungan jalannya suatu negara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Mereka menjawab: \"Kita adalah orang-orang yang memiliki kekuatan dan (juga) memiliki keberanian yang sangat (dalam peperangan), dan keputusan berada ditanganmu: maka pertimbangkanlah apa yang akan kamu perintahkan\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“Kita memiliki kekuatan dan ketangkasan yang luar biasa} memiliki dukungan dan keberanian dalam perang {tetapi keputusan ada padamu. Maka pertimbangkanlah apa yang akan kamu perintahkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32-33 di antara hal yang menunjukkan ketegasan dan kematangan akal si ratu itu adalah ia segera mengumpulkan para tokoh kerajaannya dan para pembesar negaranya, lalu berkata,”hai para pembesar, berilah aku pertimbangan dalam urusanku (ini),” maksudnya, sampaikan kepadaku apa yang akan kita jawabkan kepadanya?! Apakah kita masuk saja pada kekuasaannya, kita tunduk, atau apa yang harus kita lakukan?! “aku tidak pernah memutuskan suatu persoalan sehingga kalian hadir dalam majelisku,” maksudnya, aku sekali-kali tidak bersikap dictator dalam suatu perkara tanpa melibatkan pendapat dan musyawarah kalian. “mereka menjawab, ’kita adalah orang-orang yang memilki kekuatan dan (juga) memiilki keberanian yang sangat,” maksudnya, kalau engkau menolak perkataannya dan engkau tidak mau tunduk kepadanya, maka sesungguhnya kami adalah orang-orang yang kuat dalam peperangan. Nampaknya mereka lebih condong pada pendapat yang terakhir ini yang kalau saja terjadi, maka ia akan menjadi kebinasaan mereka. Akan tetapi mereka juga tidak terlalu mantap padanya, maka mereka mengatakan, ”dan keputusan berada ditanganmu,” maksudnya, keputusannya adalah keputusanmu. Hal ini disebabkan mereka tahu kecerdasan akalnya, ketegasannya dan ketulusannya kepada mereka. “maka pertimbangkanlah,” dengan pertimbangan akal dan pikiran, “apa yang akan kamu perintahkan,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 33: Maka berkatalah para kaumnya : Kami adalah orang-orang yang memiliki kekuatan, keras dan berani serta mengetahui peperangan, maka jika engkau meminta kami akan hal itu (perang); Kami termasuk orang-orang yang telah bersiap, akan tetapi urusannya kembali kepada engkau. Keputusan ada padamu, maka lihatlah apa yang padanya terdapat kebaikan, dan kami adalah orang-orang yang patuh akan urusanmu, dan bergegas dengan pendapatmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tampaknya mereka lebih cenderung untuk berperang yang sesungguhnya jika dilanjutkan, tentu mereka akan binasa. Karena mereka mengetahui kecerdasan akalnya dan kematangannya. Yakni kami akan mengikutimu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 33",
    "description": "Mendengar permintaan ratu balqis, mereka, para pemuka itu, menjawab sebagai bentuk loyalitas mereka yang tinggi terhadap sang ratu, 'baginda ratu! 'kita memiliki kekuatan dan keberanian yang luar biasa untuk berperang, tetapi meskipun demikian, keputusan terakhir berada di tanganmu, wahai paduka yang mulia! maka pertimbangkanlah apa yang akan engkau perintahkan. ' kami akan turuti apa yang engkau perintahkan kepada kami. \"34. Sebagai pemimpin yang bijak, ratu balqis memilih jalan damai daripada berperang sebagaimana yang ditawarkan oleh pembesar kaumnya. Lalu dia, balqis, berkata, \"sepengetahuanku sesungguhnya raja-raja dan penguasa negeri apabila menaklukkan suatu negeri, di mana pun juga mereka tentu akan membinasakannya, dengan memporak porakandakannya dan menjadikan penduduknya yang mulia yaitu pemuka-pemuka mereka jadi hina, agar tidak ada lagi kekuatan yang dominan; dan demikian yang akan mereka perbuat. \"."
  }
]