[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Sang ratu mengeluarkan pernyataan untuk memperingatkan mereka dari menghadapi Sulaiman dengan permusuhan lagi menjelaskan akibat buruk dari suatu pertempuran, “Sesungguhnya raja-raja bila mereka memasuki suatu negeri bersama dengan bala tentara mereka dengan paksa dan zhalim, mereka akan menghancurkannya dan menjadikan para pembesar negeri itu sebagai orang-orang yang hina. Mereka membunuhi dan melakukan penawanan. Inilah kebiasaan mereka yang terus berlangsung lagi tetap terjadi untuk memaksa manusia supaya takut kepada mereka. Dan sesungguhnya aku akan mengirim kepada Sulaiman dan kaumnya hadiah yang berisi bebagai harta yang mahal supaya aku dapat melunakkan hatinya dengannya dan aku akan menunggu apa yang dibawa kembali oleh para utusanku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dia berkata, \"Sesungguhnya raja-raja apabila memasuki suatu negeri di antara negeri-negeri yang ada, niscaya mereka membinasakannya dengan melakukan pembunuhan, kerusakan, dan perampasan, dan menjadikan para pembesar dan pemukanya jadi hina setelah sebelumnya mereka memiliki kemuliaan dan kekuatan. Demikian lah yang dilakukan para raja itu apabila mereka menaklukkan penduduk suatu negeri; dengan tujuan menanamkan rasa takut dan keseganan dalam hati orang-orang yang mereka taklukkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Jawaban salah satu pihak dari kaumnya ini membuatnya tenang, namun dia takut dari kewibawaan surat Sulaiman dan ketegasannya dalam pesan yang disampaikan; sehingga dia takut menghadapi Sulaiman dan berusaha memuaskan kedua belah pihak dengan berkata: “Sesungguhnya para raja jika menyerang suatu negeri dengan bala tentara maka mereka akan menghancurkannya, dan menundukkan para petingginya; dan demikianlah yang akan mereka lakukan jika dapat mengalahkan kita. Maka aku akan mengirim kepada Sulaiman hadiah yang besar kemudian aku akan menunggu kabar yang dibawa para utusanku, apakah Sulaiman menerima atau menolak hadiah itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. قَالَتْ إِنَّ الْمُلُوكَ إِذَا دَخَلُوا۟ قَرْيَةً أَفْسَدُوهَا (Dia berkata: “Sesungguhnya raja-raja apabila memasuki suatu negeri, niscaya mereka membinasakannya) Yakni apabila mereka memasuki suatu negeri, mereka akan menghancurkan bangunan-bangunannya, merusak harta kekayaannya, dan memisahkan kesatuan penduduknya. وَجَعَلُوٓا۟ أَعِزَّةَ أَهْلِهَآ أَذِلَّةً ۖ( dan menjadikan penduduknya yang mulia jadi hina) Yakni mereka akan menghinakan pemimpin-pemimpinnya dan menurunkan derajat mereka, mereka akan merebut kedudukan pemimpin-pemimpin tersebut sehingga menjadi orang-orang yang hina. Mereka melakukan itu untuk menyempurnakan kekuasaan mereka dan mengokohkan penakhlukkan mereka serta memasukkan rasa takut ke dalam hati manusia. Allah membenarkan pendapat Bilqis dengan firman-Nya: وَكَذٰلِكَ يَفْعَلُونَ (dan demikian-lah yang akan mereka perbuat)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dia berkata: \"Sesungguhnya raja-raja apabila memasuki suatu negeri, niscaya mereka membinasakannya, dan menjadikan penduduknya yang mulia jadi hina; dan demikian pulalah yang akan mereka perbuat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Sesungguhnya raja-raja ketika menaklukkan suatu negeri, mereka tentu membinasakannya dan menjadikan penduduknya yang mulia menjadi hina. Demikianlah yang akan mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35 kemudian sang ratu berkata kepada mereka untuk meyakinkan mereka tentang pendapat mereka, sambil menjelaskan buruknya dampak peperangan, ”sesungguhnya raja-raja apabila memasuki suatu negeri, niscaya mereka membinasakannya,” dalam bentuk pembunuhan, penawanan, perampasan harta benda dan pengrusakan bangunan-bangunannya, “dan menjadikan penduduknya yang mulia jadi hina,” maksudnya, mereka menjadikan para pemimpin kaum bangsawannya termasuk orang-orang yang hina. Maksudnya, ini adalah pendapat yang kurang tepat. Dan juga, aku tidak akan patuh kepadanya sebelum melakukan pengujian dan mengutus orang yang menyingkap tentang segala kondisinya dan mempertimbangakannya, barulah permasalahan kita akan menjadi jelas. Lalu dia berkata, ”sesungguhnya aku akan mengutus utusan kepada mereka dengan (membawa) hadiah, dan (aku akan) menunggu apa yang akan dibawa kembali oleh utusan-utusan itu,” darinya. Apakah dia tetap pada pendirian dan pendapatnya? Ataukah dia akan terpedaya dengan hadiah, dan hadiah itu mampu merubah pikirannya? Dan bagaimana pula keadaan bala tentaranya?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 34: Raja tersebut berkata kepada mereka : Sesungguhnya sebagian dari kebiasan kerajaan adalah jika memasuki sebuah negeri yaitu dengan tanpa senjata; Karena dapat membuat kerusakan dengan peperangan, merampas, perusakan, pencurian, dan mereka menjadikan kebahagiaan menuju kehinaan yang buruk. Inilah kebiasaan kerajaan-kerajaan dalam mensikapi akan kekuasaan mereka kepada manusia, yaitu dengan melempar kehinaan dalam hati-hati manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Memberikan kepuasan terhadap usulan mereka dan menerangkan akibat dari berperang. Yakni melakukan pembunuhan, penawanan, perampasan harta dan perobohan terhadap rumah-rumah mereka. Seperti para tokohnya dan orang-orang yang terhormat di antara mereka. Seakan-akan ratu Balqis berkata kepada mereka, bahwa pandangannya ini tidak begitu tepat, dan ia tidak akan memilih pandangan itu sampai mengetahui keadaan Nabi Sulaiman dengan mengutus orang yang akan memberitahukan kepada mereka keadaannya agar keputusannya tepat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 34",
    "description": "Sebagai pemimpin yang bijak, ratu balqis memilih jalan damai daripada berperang sebagaimana yang ditawarkan oleh pembesar kaumnya. Lalu dia, balqis, berkata, \"sepengetahuanku sesungguhnya raja-raja dan penguasa negeri apabila menaklukkan suatu negeri, di mana pun juga mereka tentu akan membinasakannya, dengan memporak porakandakannya dan menjadikan penduduknya yang mulia yaitu pemuka-pemuka mereka jadi hina, agar tidak ada lagi kekuatan yang dominan; dan demikian yang akan mereka perbuat. \"35. Ratu balqis kemudian mengemukakan gagasannya di hadapan pembesar-pembesar kerajaannya. Ratu mengatakan: \"dan sungguh, aku akan mengirim utusan kepada mereka, nabi sulaiman dan pengawal kerajaannya, dengan membawa hadiah yang banyak, sangat berharga dan bernilai, dan aku akan menunggu apa yang akan dibawa kembali oleh para utusan itu, bagaimana sikap raja sulaiman terhadap kebijakanku ini'\"."
  }
]