[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Sang ratu mengeluarkan pernyataan untuk memperingatkan mereka dari menghadapi Sulaiman dengan permusuhan lagi menjelaskan akibat buruk dari suatu pertempuran, “Sesungguhnya raja-raja bila mereka memasuki suatu negeri bersama dengan bala tentara mereka dengan paksa dan zhalim, mereka akan menghancurkannya dan menjadikan para pembesar negeri itu sebagai orang-orang yang hina. Mereka membunuhi dan melakukan penawanan. Inilah kebiasaan mereka yang terus berlangsung lagi tetap terjadi untuk memaksa manusia supaya takut kepada mereka. Dan sesungguhnya aku akan mengirim kepada Sulaiman dan kaumnya hadiah yang berisi bebagai harta yang mahal supaya aku dapat melunakkan hatinya dengannya dan aku akan menunggu apa yang dibawa kembali oleh para utusanku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Dan sesungguhnya aku akan mengirim hadiah kepada penulis surat ini dan kaumnya, dan aku akan menunggu jawaban yang akan dibawa kembali oleh utusan-utusan itu setelah hadiah itu diserahkan kepada mereka\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَإِنِّى مُرْسِلَةٌ إِلَيْهِم بِهَدِيَّةٍ (Dan sesungguhnya aku akan mengirim utusan kepada mereka dengan (membawa) hadiah) Jika ia adalah seorang raja pasti kita telah menjadikannya puas sehingga kita tidak perlu lagi memikirkan urusannya, namun jika ia seorang Nabi pasti ia tidak akan puas dengan itu sebab tujuan utamanya adalah menyeru kepada agamanya. فَنَاظِرَةٌۢ بِمَ يَرْجِعُ الْمُرْسَلُونَ(dan (aku akan) menunggu apa yang akan dibawa kembali oleh utusan-utusan itu) Kemudian aku akan memikirkan dan merencanakan apa yang harus dilakukan sesuai dengan hasil yang dibawa oleh para utusanku yang membawa hadiah, apakah ia akan menerima hadiah itu atau akan menolaknya, dengan begitu aku dapat berbuat sesuai dengan keharusannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pikirkan baik-baik kepada siapa yang memberikan hadiah kepadamu karena terkadang hadiah itu menguntungkan dan terkadang mencelakakan; maka pikirkan dengan matang waktu dan keadaan sebelum kamu membalas atau menolak hadiah itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Dan sesungguhnya aku akan mengirim utusan kepada mereka dengan (membawa) hadiah, dan (aku akan) menunggu apa yang akan dibawa kembali oleh utusan-utusan itu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya aku akan mengirim utusan kepada mereka dengan hadiah dan aku akan menunggu} menunggu {apa yang akan dibawa kembali oleh para utusan itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35 kemudian sang ratu berkata kepada mereka untuk meyakinkan mereka tentang pendapat mereka, sambil menjelaskan buruknya dampak peperangan, ”sesungguhnya raja-raja apabila memasuki suatu negeri, niscaya mereka membinasakannya,” dalam bentuk pembunuhan, penawanan, perampasan harta benda dan pengrusakan bangunan-bangunannya, “dan menjadikan penduduknya yang mulia jadi hina,” maksudnya, mereka menjadikan para pemimpin kaum bangsawannya termasuk orang-orang yang hina. Maksudnya, ini adalah pendapat yang kurang tepat. Dan juga, aku tidak akan patuh kepadanya sebelum melakukan pengujian dan mengutus orang yang menyingkap tentang segala kondisinya dan mempertimbangakannya, barulah permasalahan kita akan menjadi jelas. Lalu dia berkata, ”sesungguhnya aku akan mengutus utusan kepada mereka dengan (membawa) hadiah, dan (aku akan) menunggu apa yang akan dibawa kembali oleh utusan-utusan itu,” darinya. Apakah dia tetap pada pendirian dan pendapatnya? Ataukah dia akan terpedaya dengan hadiah, dan hadiah itu mampu merubah pikirannya? Dan bagaimana pula keadaan bala tentaranya?!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 35: Berkata raja kepada mereka : Wahai manusia yang hadir, akan akan uji kaum tersebut, akan aku utus kepada mereka (Sulaiman dan kaumnya) dengan membawa hadiah dari harta yang berharga, maka aku akau tunggu, apakah dia (Sulaiman) akan tetap pendiriannya dan ucapannya ? Atau justru puas dengan hadiah, dan berganti pandangan kepada kita, dan atau akan tetap mengekang untuk mengikuti (dengan tunduk) kepada kekuasaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Abbas berkata, “Dia (Balqis) berkata kepada kaumnya, “Jika ia menerima hadiah, maka berarti ia seorang raja, maka perangilah, dan jika ia tidak menerimanya, maka berarti ia seorang nabi, maka ikutilah.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 35",
    "description": "Ratu balqis kemudian mengemukakan gagasannya di hadapan pembesar-pembesar kerajaannya. Ratu mengatakan: \"dan sungguh, aku akan mengirim utusan kepada mereka, nabi sulaiman dan pengawal kerajaannya, dengan membawa hadiah yang banyak, sangat berharga dan bernilai, dan aku akan menunggu apa yang akan dibawa kembali oleh para utusan itu, bagaimana sikap raja sulaiman terhadap kebijakanku ini'\"36. Sesuai dengan arahan ratu balqis, berangkatlah utusan ratu dari negeri saba' di yaman menuju palestina tempat kediaman nabi sulaiman dengan membawa hadiah-hadiah itu. Maka ketika para utusan itu sampai kepada sulaiman dan mengemukakan maksud kedatangannya dan menyampaikan hadiah dari ratu balqis, dia, sulaiman, sama sekali tidak tertarik untuk melihat hadiah-hadiah itu bahkan berkata kepada para utusan itu, 'apakah kamu akan memberi harta kepadaku. Dan kamu masih tetap dalam kesyirikan dan kekafiranmu' tak mungkin hal itu terjadi. Ketahuilah oleh kalian bahwa apa yang Allah berikan kepadaku berupa kenabian, kerajaan, harta benda, dan bala tentara itu jauh lebih baik daripada apa yang Allah berikan kepadamu yang berupa perhiasan dunia semata. Tetapi kamu merasa bangga dengan hadiahmu. Aku tidak butuh terhadap hadiah-hadiah itu. Kembalikanlah hadiah-hadiah itu kepada orang yang mengutusmu."
  }
]