[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika para utusan ratu telah tiba dengan membawa hadiah bagi Sulaiman, Sulaiman berkata untuk mengingkari tindakan tersebut dan guna menyebut-nyebut kenikmatan-kenikmatan Allah yang terlimpah padanya, “Apakah kalian akan memperbanyak kekuasaan milikku dengan kekayaan untuk membuatku senang? Apa yang Allah anugerahkan kepadaku berupa kenabian, kerajaan dan kekayaan yang melimpah lebih baik dan lebih utama daripada apa yang diberikanNya kepada kalian. Bahkan kalianlah yang sebenarnya akan girang dengan hadiah yang diserahkan kepada kalian. Sebab, sesungguhnhya kalian adalah orang-orang yang suka membanggakan diri dengan kekayaan dunia lagi suka bersaing dengan jumlahnya yang banyak.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Maka tatkala para utusan yang membawa hadiah itu sampai kepada Sulaiman, maka Sulaiman mengingkari pengiriman hadiah tersebut sembari berkata, \"Apakah kalian mengirimkan kepadaku harta agar kalian mengalihkanku dari mendakwahi kalian? Sungguh, apa yang diberikan Allah kepadaku berupa kenabian, kerajaan dan harta tentu lebih baik daripada apa yang diberikan-Nya kepada kalian; akan tetapi kalian malah merasa bangga dengan hadiah duniawi yang diberikan kepada kalian.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-38. Ketika para urusan ratu itu datang kepada Sulaiman dengan membawa hadiah, dia mengingkari mereka dan mengolok ratu dan hadiahnya: “Apakah kalian akan memberiku harta? Sungguh ilmu, kenabian, dan kerajaan yang Allah berikan kepadaku lebih baik daripada harta yang Allah berikan kepada kalian. Bahkan kalian bangga dengan hadiah yang diberikan kepada kalian. Hai utusan, kembalilah kepada mereka; sungguh kami akan mendatangi mereka dengan bala tentara luar biasa yang tidak mungkin dapat mereka lawan, dan sungguh kami akan mengeluarkan mereka dari negeri mereka dalam keadaan tunduk dan terhina.” Lalu Sulaiman bertanya para petingginya dari kalangan jin dan manusia: “Siapa yang dapat mendatangkan singgasana ratu Saba kepadaku sebelum mereka datang dalam keadaan menyerah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَلَمَّا جَآءَ سُلَيْمٰنَ (Maka tatkala utusan itu sampai kepada Sulaiman) Yakni ketika utusan itu datang membawa hadiah untuk Sulaiman. قَالَ أَتُمِدُّونَنِ بِمَالٍ (Sulaiman berkata: “Apakah (patut) kamu menolong aku dengan harta?) Yakni Sulaiman mengatakan ucapannya ini karena mengingkari perbuatan mereka yang mendatanginya dengan membawa hadiah harta benda, padahal Sulaiman sangat tinggi kekuasaannya dan sangat banyak hartanya. فَمَآ ءَاتَىٰنِۦَ اللهُ (maka apa yang diberikan Allah kepadaku) Berupa kenabian, kekuasaan yang besar, dan harta yang sangat banyak. خَيْرٌ مِّمَّآ ءَاتَىٰكُم (lebih baik daripada apa yang diberikan-Nya kepadamu) Daripada harta yang diberikan kepada kalian yang termasuk diantaranya adalah hadiah ini. بَلْ أَنتُم بِهَدِيَّتِكُمْ تَفْرَحُونَ (tetapi kamu merasa bangga dengan hadiahmu) Namun aku tidak merasa bangga dengan hadiah itu, sebab aku tidak butuh terhadap dunia. Sulaiman mengatakan ini kepada utusan itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) Jika saja sebagian dari para ulama menyikapi hadiah-hadiah yang di berikan kepada mereka sama seperti sikap Sulaiman 'alaihissalam, niscaya kehormatan mereka akan lebih kuat dan akan tercetus melalui tangan-tangan mereka kebaikan negeri dan penduduknya, sebagaimana membaiknya kerajaan Saba', coba perhatikan ayat ini : ( أَتُمِدُّونَنِ بِمَالٍ فَمَآ ءَاتَىٰنِۦَ ٱللَّهُ خَيْرٌ مِّمَّآ ءَاتَىٰكُم بَلْ أَنتُم بِهَدِيَّتِكُمْ تَفْرَحُونَ ) \"Apakah (patut) kamu menolong aku dengan harta? maka apa yang diberikan Allah kepadaku lebih baik daripada apa yang diberikan-Nya kepadamu; tetapi kamu merasa bangga dengan hadiahmu.\" 2. Seorang pegawai yang beriman kepada yang ghaib adalah ketika melihat kawan-kawannya yang menjulurkan tangan mereka kepada harta haram, lalu dengannya dia menjadi bagian orang-orang yang memiliki kekayaan dan kelapangan, dan dia merasa puas dengan sesuatu yang sedikit dari hartanya dan bersabar menghadapi kehimpitan; berharap kekayaan dan kelapangan di akhirat ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Maka tatkala utusan Bilqis sampai kepada Sulaiman dengan membawa hadiah, Sulaiman berkata: \"Apakah patut kamu menolong aku dengan harta? Maka apa yang diberikan Allah kepadaku beruoa kenabian, kerajaan, harta yang berlimpah ini lebih baik daripada harta dunia dan perhiasan yang Allah berikan kepadamu; tetapi kamu merasa bangga dengan hadiahmu, itu sebab bahwa kalian adalah ahli dunia. Atamudduni adalah pertanyaan celaan yang bermakna apakah pantas engkau memberiku harta? Bal adalah pemindahan fokus dari satu kalimat ke kalimat lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika sampai kepada Sulaiman, dia berkata,“Apakah kalian akan memberi harta kepadaku. Apa yang diberikan Allah kepadaku} yang diberikan Allah kepadaku berupa kenabian, agama, dan kekuasaan {lebih baik daripada apa yang diberikan kepada kalian, tetapi kalian merasa bangga dengan hadiah kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36 kemudian dia pun mengirim hadiah bersama para utusan yang dipilih dari kalangan orang-orang yang cerdik dan memilki kepandaian diantara para pengikutnya. “maka tatkala utusan itu sampai kepada sulaiman,” maksudnya, para utusan telah sampai kepada sulaiman dengan membawa hadiah, “sulaiman berkata,” dengan nada kesal terhadap mereka dan marah atas ketidak patuhan mereka, “apakah (patut) kamu menolong aku dengan harta? Sementara sesuatu yang diberikan Allah kepadaku lebih baik daripada sesuatu yang diberikanNya kepadamu?” hadiah ini sama sekali tidak berkenan bagiku, dan akupun tidak bahagia disebabkannya, karena Allah sudah membuatku tidak butuh kepadanya, dan Dia telah banyak melimpahkan banyak karuniaNya kepadaku,”tetapi kamu merasa bangga terhadap hadiahmu,” karena kecintaan kalian pada dunia dan karena sedikitnya sesuatu yang kalian miliki disebanding apa yang telah Allah karuniakan kepadaku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 36: Ketika datang para utusan dengan membawa hadiah kepada Sulaiman; Sulaiman marah kepada mereka, dan atas kecongkakan kaumnya, berkata Sulaiman dengan sangat murka : Apakah kalian menyangkan bahwasanya aku akan ridha dengan harta dan terlena dengannya ?? Yang memberiku harta dan kenabian adalah Allah, hartaku lebih afdhal daripada apa yang kalian berikan, semisal dengan hadiah ini, tiada kesenangan padaku sedikitpun; Bahkan kalianlah dan yang semisal dengan kalian dari pecinta dunia yang bersenang-senang (dari harta semisal ini)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil mengingkari dan marah kepada mereka. Berupa kenabian dan kerajaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 36",
    "description": "Sesuai dengan arahan ratu balqis, berangkatlah utusan ratu dari negeri saba' di yaman menuju palestina tempat kediaman nabi sulaiman dengan membawa hadiah-hadiah itu. Maka ketika para utusan itu sampai kepada sulaiman dan mengemukakan maksud kedatangannya dan menyampaikan hadiah dari ratu balqis, dia, sulaiman, sama sekali tidak tertarik untuk melihat hadiah-hadiah itu bahkan berkata kepada para utusan itu, 'apakah kamu akan memberi harta kepadaku. Dan kamu masih tetap dalam kesyirikan dan kekafiranmu' tak mungkin hal itu terjadi. Ketahuilah oleh kalian bahwa apa yang Allah berikan kepadaku berupa kenabian, kerajaan, harta benda, dan bala tentara itu jauh lebih baik daripada apa yang Allah berikan kepadamu yang berupa perhiasan dunia semata. Tetapi kamu merasa bangga dengan hadiahmu. Aku tidak butuh terhadap hadiah-hadiah itu. Kembalikanlah hadiah-hadiah itu kepada orang yang mengutusmu. 37. Nabi sulaiman memerintahkan utusan itu untuk kembali dan berkata, \"kembalilah kamu sekalian kepada mereka, yakni ratu balqis dan pengikutnya! lalu katakanlah kepada mereka, sungguh, kami pasti akan mendatangi mereka dengan bala tentara yang mereka tidak mampu melawannya, dan tidak mungkin tertandingi! karena, bala tentara nabi sulaiman bukan saja dari kalangan manusia, tapi juga dari kalangan jin. Dan dengan pasti, sungguh akan kami usir mereka dari negeri itu saba' secara terhina dan mereka akan menjadi tawanan yang hina dina. ' itulah balasan dari orang yang membangkang terhadapku. \"."
  }
]