[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Sulaiman berkata kepada utusan dari negeri Saba’ itu, “Kembalilah kamu kepada mereka. Demi Allah, sungguh kami akan mendatangi mereka dengan bala tentara yang tidak ada kemampuan bagi mereka untuk melawan dan memeranginya. Dan sungguh kami akan mengusir mereka dari negeri mereka itu dalam keadaan terhina, sedang mereka menjadi orang-orang yang rendah lagi tertindas, bila tidak tunduk terhadap agama Allah semata, dan tidak meninggalkan peribadatan kepada selainNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Sulaiman -'alaihissalām- lalu berkata kepada utusan sang ratu tersebut, \"Kembalilah kepada mereka (pembesar kaummu) dengan hadiah yang engkau bawa itu, sungguh kami akan mendatanginya (Ratu) dan kaumnya dengan balatentara yang tidak akan bisa mereka hadapi, dan kami pasti akan mengusir mereka dari negeri Saba' sedang mereka dalam keadaan rendah dan terhina setelah sebelumnya mereka memiliki kekuatan dan kemuliaan, jikalau mereka tidak datang kepadaku dengan menyerahkan diri\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. ارْجِعْ إِلَيْهِمْ (Kembalilah kepada mereka) Yakni kepada Bilqis dan kaumnya. فَلَنَأْتِيَنَّهُم بِجُنُودٍ لَّا قِبَلَ لَهُم بِهَا(sungguh kami akan mendatangi mereka dengan balatentara yang mereka tidak kuasa melawannya) Yakni yang tidak mungkin kalian lawan. ولنخرجنكم منها (dan pasti kami akan mengusir mereka dari negeri itu) Yakni dari negeri yang kalian tinggali. أَذِلَّةً (dengan terhina) Padahal sebalumnya mereka adalah orang-orang yang mulia. وَهُمْ صٰغِرُونَ(dan mereka menjadi (tawanan-tawanan) yang hina dina) Yakni menjadi hina. Dan pendapat lain mengatakan yang dimaksud adalah mereka akan menjadi tawanan dan budak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Kembalilah kepada kaummu wahai para utusan dengan membawa hadiah ini kembali, sungguh kami akan mendatangi mereka dengan balatentara yang mereka tidak akan kuasa melawannya. Pasti kami akan mengusir mereka dari negeri Saba dengan terhina dan mereka menjadi (tawanan-tawanan) yang hina dina\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kembalilah kepada mereka, Sungguh kami benar-benar akan mendatangi mereka dengan bala tentara yang tidak mampu mereka atasi} yang tidak akan mampu dan tidak bisa mereka hadapi {Kami pasti akan mengusir mereka dari negeri itu} negeri Saba’ {dalam keadaan terhina lagi rendah} terhina dan terusir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37 kemudian sulaiman berpesan kepada utusannya itu tanpa menuliskannya dalam surat setelah melihat kecerdasannya, dan setelah dia yakin bahwa utusan itu akan menyampaikan pesannya sebagaimana adanya, seraya berkata, ”kembalilah kepada mereka,” maksudnya, dengan hadiah ini. “sungguh kami akan mendatangi mereka dengan bala tentara yang mereka tidak kuasa melawannya,” maksudnya, yang mereka tidak akan mampu menghadapinya. “dan pasti kami akan mengusir mereka dari negeri itu (saba) dengan terhina, dan mereka menjadi (tawanan-tawanan) yang hina dina,” maka utusan itupun kembali kepada mereka dan menyampaikan segala apa yang telah dikatakan oleh sulaiman. Dan mereka pun bersiap-siap berangkat menuju sulaiman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 37: Kemudian berkata Sulaiman kepada mereka : Kembalilah kepada kaum kalian dan bawalah hadiah ini, dan berilah kabar kepada mereka, bahwa aku akan datang kepada mereka membawa pasukan dan gerombolan (masa) yang tidak dapat ditandingi dengan yang semisal dengannya, tidak pula mendatangkan yang semisal darinya, dengan sebab kami akan mengeluarkan mereka (kaummu) dari bumi dan kerajaan mereka dengan terhina, sebagai orang-orang kecil dengan menghinakan mereka dan merendahkan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan membawa hadiahmu. Jika mereka tidak taat dan tunduk. Maka utusan itu kembali kepada mereka dan menyampaikan kata-kata Nabi Sulaiman ‘alaihis salam, dan mereka pun segera bersiap-siap untuk mengadakan perjalanan menuju kerajaan Sulaiman, dan Nabi Sulaiman pun tahu, bahwa mereka akan pergi menemuinya. Oleh karena itu, Beliau berkata kepada para pemukanya yang hadir, dari kalangan jin dan manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 37",
    "description": "Nabi sulaiman memerintahkan utusan itu untuk kembali dan berkata, \"kembalilah kamu sekalian kepada mereka, yakni ratu balqis dan pengikutnya! lalu katakanlah kepada mereka, sungguh, kami pasti akan mendatangi mereka dengan bala tentara yang mereka tidak mampu melawannya, dan tidak mungkin tertandingi! karena, bala tentara nabi sulaiman bukan saja dari kalangan manusia, tapi juga dari kalangan jin. Dan dengan pasti, sungguh akan kami usir mereka dari negeri itu saba' secara terhina dan mereka akan menjadi tawanan yang hina dina. ' itulah balasan dari orang yang membangkang terhadapku. \"38. Melihat kesungguhan nabi sulaiman yang akan menyerang kerajaannya, akhirnya ratu balqis menuruti apa yang diperintahkan oleh sulaiman. Berangkatlah sang ratu dan pengikutnya dari yaman menuju palestina. Namun sebelum ratu balqis sampai di palestina, nabi sulaiman, mengadakan sayembara terlebih dahulu. Dia sulaiman berkata, 'wahai para pembesar! siapakah di antara kamu yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku menyerahkan diri'' nabi sulaiman mendengar akan kemewahan singgasana ratu balqis. Dan balqis sangat bangga dengan singgasananya itu. Dia ingin melakukan kejutan terhadap ratu balqis, sebagai bagian dari taktik pamer kekuatan sebagai bukti akan kekuasaannya yang jauh lebih besar dari kekuasaan ratu balqis."
  }
]