[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sulaiman berkata kepada makhluk-makhluk yang Allah tundukkan baginya dari bangsa jin dan manusia, “Siapakah di antara kalian yang sanggup membawakan kepadaku singgasana kerajaannya yang besar sebelum mereka datang kepadaku dalam keadaan tunduk lagi taat?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Lalu Sulaiman -'alaihissalām- berkata memerintahkan para pemuka kerajaannya, \"Wahai para pembesar! Siapakah di antara kamu sekalian yang sanggup membawa singgasana kerajaannya kepadaku sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. قَالَ (Berkata Sulaiman) Sulaiman berkata. يٰٓأَيُّهَا الْمَلَؤُا۟ أَيُّكُمْ يَأْتِينِى بِعَرْشِهَا(Hai pembesar-pembesar, siapakah di antara kamu sekalian yang sanggup membawa singgasananya kepadaku) Yakni singgasana Bilqis yang telah disebutkan bahwa singgasana itu sangat besar. قَبْلَ أَن يَأْتُونِى مُسْلِمِينَ(sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri) Sulaiman mendapat wahyu dari Allah bahwa mereka akan mendatanginya dengan berserah diri. Atau Sulaiman memprediksinya lewat keadaan yang terjadi. Terdapat pendapat mengatakan bahwa Sulaiman hendak mengambil singgasana Bilqis untuk menunjukkan kepadanya kekuatan yang Allah berikan kepadanya sehingga itu menjadi bukti atas kenabiannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Lalu ketika tahu bahwa Bilqis dan kaumnya datang, Sulaiman berkata: \"Hai para pembesar, siapakah di antara kalian yang sanggup membawa singgasana Bilqis kepadaku, sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri.” Sulaiman ingin menunjukkan beberapa mukjizat tanda kenabian kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Wahai para pembesar, siapakah di antara kalian yang bisa membawakanku singgasananya sebelum mereka datang dalam keadaan berserah diri} dalam keadaan tunduk lagi taat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40 sulaiman telah mengetahui bahwa mereka akan berangkat menuju kepadanya. Maka dia segera berkata kepada jin dan manusia yang hadir disisinya, “siapakah di antara kamu sekalian yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri?” maksudnya, agar kita dapat menguasainya sebelum mereka menyerahkan diri, sehingga harta mereka menjadi terpelihara. “berkatalah ifrit (yang cerdik) drai golongan jin,” ifrit adalah jin yang paling kuat lagi sangat aktif sekali, “ aku akan datang kepadamu dengan membawa singgasana itu kepadamu sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat membawanya lagi dapat dipercaya,” secara zahir, sulaiman saat itu berada di negeri syam, sehingga perjalanan pulang pergi antara dia dan negeri saba’ kira-kira sejauh perjalanan 4 bulan: dua pulang untuk pergi dan dua bulan untuk pulang. Namun demikian ifrit berkata,”aku berkomitemen untuk membawanya, bagaimanapun besar dan beratnya serta jauhnya perjalanan, sebelum engkau beranjak dari tempat dudukmu yang saat ini sedang engkau duduki.” Biasanya pertujuan yang panjang itu adalah selama panjangnya waktu dhuha kira-kira sepertiga hari. Ini adalah kebiasaan yang panjang. Dan kadang-kadang kurang dari itu atau lebih. Inilah raja yang agung yang beberapa gelintir dari para pengikutnya mempunyai kekuatan dan kemampuan seperti itu. Yang lebih dahsyat dari itu lagi adalah bahwa, “berkatalah seorang yang mempunyai ilmu dari al-kitab,” para ahli tafsir mengatakan,”seorang lelaki shalih yang ada di sisi sulaiman, namanya Ashaf bin barkhiya’. Dia mengetahu nama Allah yang teragung, yang kalau Allah dimohon dengannya pasti mengabulkan, dan kalau diminta dengannya pasti memberi, “aku akan membawa singgasana itu kepadamu sebelum matamu berkedip,” dengan berdoa kepada Allah yang teragung itu, hingga singgasana itu hadir saat itu juga. Dia pun berdoa kepada Allah, maka singgasana itu datang. Allah yang lebih mengetahui maksudnya, apakah ini yang dimaksud, atau dia adalah orang yang mempunyai ilmu dari al-kitab yang dengannya dia mempunyai kemampuan untuk mengambil benda yang jauh dan menjangkau sesuatu yang sulit “maka tatkala dia melihat singgasana itu,” maksudnya, sulaiman melihatnya, “terletak di hadapannya,” maka dia memuji kepada Allah atas ketentuanNya, kerajaanNya dan kemudahan segala perkara baginya, dan “dia pun berkata, ‘ini termasuk karunia Rabbku untuk mengujiku apakah aku bersyukur atau mengingkari’.” Maksudnya, untuk mengujiku dalam hal ini. Jadi, sulaiman sama sekali tidak terpedaya dengan kerajaan, kekuasaan dan kemampuannya, seperti kebiasaan para raja jahiliyyah, bahkan dia mengetahui bahwa itu semua adalah ujian dari Rabbnya. Maka dari itu dia takut kalau tidak bisa mensyukuri nikmat ini. Kemudian dia menjelaskan bahwa kesyukuran itu manfaatnya sama sekali bukan untuk Allah, melainkan kembali kepada orang yang bersyukur itu sendiri, seraya berkata, ”dan barangsiapa yang bersyukur maka sesungguhnya dia bersyukur untuk (kebaikan) dirinya sendiri, dan barangsiapa yang ingkar, maka sesungguhnya Rabbku mahakaya lagi Mahamulia.” Mahakaya dari segala amalnya, Mahamulia lagi banyak kebaikannya, meliputi orang yang bersyukur dan yang mengingkari. Hanya saja mensyukuri nikmat-nikmatNya akan menambah nikmat itu sendiri, sedangkan mengingkarinya menyebabkan kemusnahannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 38: Berkata Sulaiman kepada mereka sekumpulan jin dan manusia : Siapa yang di antara kalian mampu mendatangkan kepadaku kerajaan ini (bilqis) dengan berserah diri dan terhina sebelum aku berdiri (dari singgasanaku) ?!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 38",
    "description": "Melihat kesungguhan nabi sulaiman yang akan menyerang kerajaannya, akhirnya ratu balqis menuruti apa yang diperintahkan oleh sulaiman. Berangkatlah sang ratu dan pengikutnya dari yaman menuju palestina. Namun sebelum ratu balqis sampai di palestina, nabi sulaiman, mengadakan sayembara terlebih dahulu. Dia sulaiman berkata, 'wahai para pembesar! siapakah di antara kamu yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku menyerahkan diri'' nabi sulaiman mendengar akan kemewahan singgasana ratu balqis. Dan balqis sangat bangga dengan singgasananya itu. Dia ingin melakukan kejutan terhadap ratu balqis, sebagai bagian dari taktik pamer kekuatan sebagai bukti akan kekuasaannya yang jauh lebih besar dari kekuasaan ratu balqis. 39. Mendengar seruan nabi sulaiman, 'ifrit dari golongan jin menawarkan diri dan berkata, \"wahai sulaiman, akulah yang akan membawanya yaitu singgasana ratu balqis itu, kepadamu sebelum engkau berdiri dari tempat dudukmu; yaitu antara pagi hari sampai siang, untuk mengurusi rakyat dan seluk beluk kerajaan. Dan sungguh, aku kuat melakukannya dan dapat dipercaya, tidak akan melakukan tindakan yang tidak terpuji. \"."
  }
]