[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "berkatalah makhluk bertenaga kuat lagi hebat dari bangsa jin, “Aku akan membawanya kepadamu sebelum kamu berdiri dari tempat dudukmu itu untuk memutuskan diantara manusia. Dan sesungguhnya aku benar-benar sanggup untuk membawanya, dan dapat dipercaya untuk menjaga apa yang ada di dalamnya. Aku akan bawa sebagaimana bentuknya, aku tidak mengurangi apa pun darinya dan tidak aku ubah-ubah.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. 'Ifrit (Jin besar) dari golongan jin berkata, \"Aku akan datang dengan membawa singgasananya kepadamu sebelum engkau berdiri dari tempat duduk yang engkau duduki sekarang; sesungguhnya aku benar-benar kuat untuk membawanya lagi dapat dipercaya untuk menjaganya, dan aku akan mendatangkannya dengan utuh\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Jin yang kuat dan besar berkata: “Aku akan mendatangkan singgasananya kepadamu sebelum engkau berdiri dari tempat dudukmu itu. Sungguh aku mampu mengangkatnya dan terpercaya dalam menjalankan tugas ini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. قَالَ عِفْرِيتٌ مِّنَ الْجِنِّ أَنَا۠ ءَاتِيكَ بِهِۦ قَبْلَ أَن تَقُومَ مِن مَّقَامِكَ ۖ (Berkata ‘Ifrit (yang cerdik) dari golongan jin: “Aku akan datang kepadamu dengan membawa singgsana itu kepadamu sebelum kamu berdiri dari tempat dudukmu) Yakni sebalum ia berdiri dari tempat ia duduk untuk menjalankan perintah dan memberi putusan di antara manusia. وَإِنِّى عَلَيْهِ لَقَوِىٌّ(sesungguhnya aku benar-benar kuat untuk membawanya) Yakni sungguh aku mampu untuk mengangkatnya. أَمِينٌ (lagi dapat dipercaya) Terhadap singgasana itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Berkatalah seorang cerdik dari golongan jin (‘Ifrit): \"Aku akan datang kepadamu dengan membawa singgsana itu kepadamu sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat untuk membawanya dan aku dapat dipercaya\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ifrit dari golongan jin berkata} yang sangat besar dan kuat {“Aku yang akan membawanya kepadamu sebelum kamu berdiri dari singgasanamu} tempat dudukmu {Sesungguhnya aku benar-benar kuat lagi dapat dipercaya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40 sulaiman telah mengetahui bahwa mereka akan berangkat menuju kepadanya. Maka dia segera berkata kepada jin dan manusia yang hadir disisinya, “siapakah di antara kamu sekalian yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri?” maksudnya, agar kita dapat menguasainya sebelum mereka menyerahkan diri, sehingga harta mereka menjadi terpelihara. “berkatalah ifrit (yang cerdik) drai golongan jin,” ifrit adalah jin yang paling kuat lagi sangat aktif sekali, “ aku akan datang kepadamu dengan membawa singgasana itu kepadamu sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat membawanya lagi dapat dipercaya,” secara zahir, sulaiman saat itu berada di negeri syam, sehingga perjalanan pulang pergi antara dia dan negeri saba’ kira-kira sejauh perjalanan 4 bulan: dua pulang untuk pergi dan dua bulan untuk pulang. Namun demikian ifrit berkata,”aku berkomitemen untuk membawanya, bagaimanapun besar dan beratnya serta jauhnya perjalanan, sebelum engkau beranjak dari tempat dudukmu yang saat ini sedang engkau duduki.” Biasanya pertujuan yang panjang itu adalah selama panjangnya waktu dhuha kira-kira sepertiga hari. Ini adalah kebiasaan yang panjang. Dan kadang-kadang kurang dari itu atau lebih. Inilah raja yang agung yang beberapa gelintir dari para pengikutnya mempunyai kekuatan dan kemampuan seperti itu. Yang lebih dahsyat dari itu lagi adalah bahwa, “berkatalah seorang yang mempunyai ilmu dari al-kitab,” para ahli tafsir mengatakan,”seorang lelaki shalih yang ada di sisi sulaiman, namanya Ashaf bin barkhiya’. Dia mengetahu nama Allah yang teragung, yang kalau Allah dimohon dengannya pasti mengabulkan, dan kalau diminta dengannya pasti memberi, “aku akan membawa singgasana itu kepadamu sebelum matamu berkedip,” dengan berdoa kepada Allah yang teragung itu, hingga singgasana itu hadir saat itu juga. Dia pun berdoa kepada Allah, maka singgasana itu datang. Allah yang lebih mengetahui maksudnya, apakah ini yang dimaksud, atau dia adalah orang yang mempunyai ilmu dari al-kitab yang dengannya dia mempunyai kemampuan untuk mengambil benda yang jauh dan menjangkau sesuatu yang sulit “maka tatkala dia melihat singgasana itu,” maksudnya, sulaiman melihatnya, “terletak di hadapannya,” maka dia memuji kepada Allah atas ketentuanNya, kerajaanNya dan kemudahan segala perkara baginya, dan “dia pun berkata, ‘ini termasuk karunia Rabbku untuk mengujiku apakah aku bersyukur atau mengingkari’.” Maksudnya, untuk mengujiku dalam hal ini. Jadi, sulaiman sama sekali tidak terpedaya dengan kerajaan, kekuasaan dan kemampuannya, seperti kebiasaan para raja jahiliyyah, bahkan dia mengetahui bahwa itu semua adalah ujian dari Rabbnya. Maka dari itu dia takut kalau tidak bisa mensyukuri nikmat ini. Kemudian dia menjelaskan bahwa kesyukuran itu manfaatnya sama sekali bukan untuk Allah, melainkan kembali kepada orang yang bersyukur itu sendiri, seraya berkata, ”dan barangsiapa yang bersyukur maka sesungguhnya dia bersyukur untuk (kebaikan) dirinya sendiri, dan barangsiapa yang ingkar, maka sesungguhnya Rabbku mahakaya lagi Mahamulia.” Mahakaya dari segala amalnya, Mahamulia lagi banyak kebaikannya, meliputi orang yang bersyukur dan yang mengingkari. Hanya saja mensyukuri nikmat-nikmatNya akan menambah nikmat itu sendiri, sedangkan mengingkarinya menyebabkan kemusnahannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 39: Berkata salah satu jin dengan penuh semangat : Aku akan mendatangkan kepadamu sebelum engkau berdiri dari tempat dudukmu yang engkau ada padanya, aku adalah jin yang kuat yang mampu membawa (kerajaan bilqis), aku juga amanah mendatangkan padamu sebagaimana permintaanmu, aku tidak mencacatinya sedikitpun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia adalah jin yang kuat, rajin dan cerdik. As Suddiy dan selainnya berkata, “Beliau (Nabi Sulaiman) biasa duduk untuk menyelesaikan masalah manusia dan memberikan keputusan dari awal siang (pagi) sampai matahari tergelincir (pertengahan siang).” Zhahirnya, bahwa Nabi Sulaiman ‘alaihis salam ketika itu berada di Syam, sehingga jarak antara kerajaannya dengan kerajaan Saba di Yaman kurang lebih memakan waktu perjalanan 4 bulan; dua bulan pergi dan dua bulan pulang. Nabi Sulaiman ‘alaihis salam berkata, “Saya ingin lebih cepat lagi.” Dari sini dapat diketahui, bahwa maksud Sulaiman membawa singgasana ratu Balqis adalah untuk memperlihatkan besarnya kerajaan yang diberikan Allah kepadanya dan bagaimana ditundukkan kepadanya bala tentara yang terdiri dari jin, manusia dan hewan yang tidak pernah diberikan kepada seorang pun sebelum Beliau dan tidak pula diberikan kepada seorang pun setelah Beliau, sekaligus sebagai hujjah atas kenabiannya bagi Balqis dan kaumnya, karena yang demikian merupakan peristiwa yang luar biasa, di mana singgsana yang begitu besar dipindahkan dalam waktu yang cukup singkat, padahal jarak antara kedua kerajaan itu cukup jauh. Zhahirnya, bahwa kerajaan Nabi Sulaiman ‘alaihis salam berada di Syam, sehingga jarak antara kerajaannya dengan kerajaan Saba kurang lebih memakan waktu perjalanan 4 bulan; dua bulan pergi dan dua bulan pulang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 39",
    "description": "Mendengar seruan nabi sulaiman, 'ifrit dari golongan jin menawarkan diri dan berkata, \"wahai sulaiman, akulah yang akan membawanya yaitu singgasana ratu balqis itu, kepadamu sebelum engkau berdiri dari tempat dudukmu; yaitu antara pagi hari sampai siang, untuk mengurusi rakyat dan seluk beluk kerajaan. Dan sungguh, aku kuat melakukannya dan dapat dipercaya, tidak akan melakukan tindakan yang tidak terpuji. \"40. Nabi sulaiman rupanya menginginkan lebih cepat dari itu, lalu tampillah seorang yang mempunyai ilmu dari kitab, yaitu kitab-kitab sebelum nabi sulaiman seperti kitab taurat dan zabur, menawarkan dirinya dan berkata, wahai sulaiman! aku akan membawa singgasana itu kepadamu sebelum matamu berkedip, setelah memandangi sesuatu benda yang jauh dengan mata yang terbelalak. Maka ketika dia, sulaiman, melihat singgasana itu terletak di hadapannya, dia pun berkata dengan hati penuh syukur, 'ini termasuk karunia tuhanku untuk mengujiku, apakah aku bersyukur atau mengingkari nikmat-Nya. Barangsiapa bersyukur, dengan hatinya melalui pengakuan yang tulus, atau lisan-Nya melalui ungkapan tahmid, tasbih atau lainnya atau melalui anggota tubuh yang lainnya dengan menggunakan kenikmatan itu untuk mencari rida Allah, maka sesungguhnya dia bersyukur untuk kebaikan dirinya sendiri, karena Allah akan menambahkan banyak lagi kenikmatan kepadanya dan barangsiapa ingkar terhadap nikmat-Nya seperti menganggap nikmat yang diperolehnya karena jerih payahnya saja atau menggunakannya untuk kemaksiatan, maka sesungguhnya tuhanku mahakaya, tidak membutuhkan iapa pun, bahkan sebaliknya semua makhluk membutuhkan-Nya, serta mahamulia tidak pernah melakukan sesuatu yang tak terpuji. \"."
  }
]