[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat dan tidak berbuat baik untuknya, Kami perlihatkan kepada mereka perbuatan-perbuatan buruk mereka seakan-akan terlihat baik, sehingga mereka melihatnya tampak baik, sedang mereka itu dilanda keragu-raguan dan kebingungan tentang itu. Mereka itu adalah orang-orang yang akan mendapat siksaan yang buruk di dunia berupa dibunuh, ditawan, kehinaan dan kekalahan. Dan mereka di akhirat kelak adalah manusia yang paling merugi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sesungguhnya orang-orang kafir yang tidak beriman kepada negeri Akhirat beserta apa yang ada didalamnya berupa pahala dan azab, Kami jadikan mereka memandang indah perbuatan-perbuatan buruk mereka, maka merekapun terus menerus melakukan keburukan itu, sebab mereka berada dalam kebimbangan; tidak mendapatkan hidayah kepada kebenaran dan tidak pula kepada petunjuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Orang-orang yang mendustakan akhirat akan Kami hiasi amalan-amalan buruk mereka agar mereka menganggapnya sebagai amalan-amalan baik. Mereka tenggelam di dalam kesesatan mereka, dan orang-orang yang jauh dari rahmat Allah itu akan mendapatkan azab yang sangat keras di dunia, dan di akhirat mereka akan menjadi manusia yang paling merugi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْاٰخِرَةِ (Sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat) Mereka adalah orang-orang kafir yang tidak mempercayai hari kebangkitan. زَيَّنَّا لَهُمْ أَعْمٰلَهُمْ(Kami jadikan mereka memandang indah perbuatan-perbuatan mereka) Allah menghiasi amalan buruk mereka sehingga mereka memandangnya sebagai amal yang baik. فَهُمْ يَعْمَهُونَ(maka mereka bergelimang (dalam kesesatan)) Yakni mereka dalam kebingungan dan kegalauan, mereka tidak mendapat petunjuk ke jalan yang benar dan tidak pula berada dalam kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat yaitu hari kebangkitan dan perhitungan yaitu orang-orang kafir. Kami jadikan mereka memandang indah perbuatan-perbuatan mereka. Kami juga menghukum mereka atas perbuatan buruk mereka, maka mereka bergelimang dalam kesesatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang tidak beriman kepada akhirat, Kami menjadikan indah} menjadikan bagus {bagi mereka perbuatan-perbuatan mereka. Maka mereka terombang-ambing"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4 “sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat,” dan mereka (malah) mendustakannya serta mendustakan orang yang datang dengan meyakinkannya, “kami jadikan mereka memandang indah perbuatan-perbuatan mereka, maka mereka bergelimang,” dengan penuh rasa bimbang, bingung dan lebih mengutamakan murka Allah daripada keridhaanNya. Kenyataan-kenyataan telah terbalik bagi mereka, sehingga mereka melihat yang batil itu sebagai kebenaran, dan yang benar sebagai kebatilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 4: Ketahuilah bahwa mereka yang tidak meyakini akan negeri akhirat dan mendustakan para rasul serta mengingkari hari kebangkitan, Allah hiasi amalan-amalan buruk mereka dan cinta akan keburukan, sebagaimana Nabi ﷺ berkata : Neraka itu dikelilingi dengan syahwat; Di mana mereka berlezat-lezat dengan syahwat mereka dan indah bagi mereka meskipun sebuah keburukan. Keadaan mereka yang kafir, tidak menuntut (bagi diri mereka sendiri) untuk beribadah dan juga menahan dari hal-hal yang haram, (mereka meyakini) tidak ada hisab dan hari kebangkitan; Mereka (seoalh-olah) terbebas dari itu semua, yaitu mengikuti tabiat keimanan untuk mempersiapkan akan hari kiamat, begitu juga dengan shalat, puasa dan segala macam ibadah, oleh karenanya terdapat pada diri mereka berlepaas diri, bersuka ria, membabi buta dan menolak untuk dikatakan sebagai hamba di dunia ini karena sebab hawa nafsu mereka yang tanpa landasan dan juga ikatan apapun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mendustakannya dan mendustakan orang yang menetapkan adanya. Mereka mengutamakan kemurkaan Allah daripada keridhaan manusia, hakikat yang sebenarnya sudah hilang dari mereka, sehingga yang batil mereka lihat sebagai kebenaran dan kebenaran mereka lihat sebagai kebatilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 4",
    "description": "Sesungguhnya orang-orang yang tidak beriman kepada akhirat, dan menganggapnya sebagai satu kemustahilan belaka, kami jadikan terasa indah bagi mereka perbuatan-perbuatan mereka yang buruk, seperti kemusyrikan, dan segala bentuk kemaksiatan, sehingga mereka bergelimang dalam kesesatan. 5. Mereka menganggap bahwa apa yang mereka lakukan tidak akan ada pertanggung jawabannya di akhirat kelak. Sebagai balasan atas mereka, mereka itulah orang-orang yang akan mendapat siksaan buruk di dunia dan mereka di akhirat adalah orang-orang yang paling rugi dan paling menyesali atas perbuatannya di dunia."
  }
]