[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang yang memiliki ilmu dari al-Kitab berkata, “Aku akan membawa singgasana itu kepadamu sebelum kedipan dua pelupuk matamu ketika bergerak untuk melihat sesuatu.” Maka Sulaiman mengizinkannya. Lalu orang itu berdoa kepada Allah, dan ia pun berhasil membawa singgasana itu. Ketika Sulaiman melihat singgasana itu tiba di depannya dan berada di sisinya, ia berkata, “Ini adalah diantara karunia Tuhanku yang telah menciptakanku dan menciptakan seluruh alam ini, guna mengujiku, apakah aku akan besyukur dengan kejadian itu sebagai pengakuan atas nikmat-nikmat Allah kepadaku ataukah aku akan mengkufuri nikmat dengan tidak bersyukur? Barangsiapa bersyukur kepada Allah atas nikmat-nikmatNya, sesungguhnya manfaat bersyukur itu kembali padanya, dan barangsiapa mengingkari nikmat dan tidak bersukur, sesungguhnya Tuhanku Mahakaya, tidak membutuhkan rasa syukurnya, juga Mahamulia yang kebaikannya merata meliputi orang yang bersyukur dan orang yang ingkar nikmat di dunia, kemudian Dia akan memperhitungkan amal perbuatan mereka dan memberikan balasan bagi mereka di akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Seorang saleh lagi alim yang berada di sisi Sulaiman, yang memiliki ilmu dari Al-Kitab, di antaranya ilmu tentang nama Allah teragung yang apabila seseorang bertawassul dengannya niscaya akan dikabulkan, berkata \"Aku akan membawa singgasana itu kepadamu sebelum matamu berkedip, dengan cara berdoa kepada Allah sehingga Dia-pun akan mendatangkannya\". Lalu ia pun berdoa, dan Allah langsung mengabulkan doanya. Maka tatkala Sulaiman melihat singgasananya telah terletak di hadapannya, ia pun berkata, \"Ini termasuk karunia Tuhanku yang Maha Suci, untuk mengujiku apakah aku bersyukur atau mengingkari akan nikmat-Nya?. Dan barangsiapa yang bersyukur kepada Allah, maka manfaat dan kebaikan bersyukur tersebut akan kembali pada dirinya sendiri, sebab Allah Maha Kaya, dan syukurnya para hamba tidak memberi-Nya manfaat sama sekali, sebaliknya barangsiapa yang mengingkari nikmat Allah dan tidak mensyukurinya, maka sesungguhnya Tuhanku Maha Kaya dan tidak memerlukan sikap syukurnya, lagi Maha Mulia yang mana di antara kemuliaan-Nya adalah tetap memberikan karunia terhadap orang-orang yang mengingkari nikmat-Nya\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Seorang ulama yang mengetahui kitab ilahi berkata: “Aku akan mendatangkan singgasananya sebelum engkau mengedipkan mata.” Lalu dia berdoa kepada Allah dan datanglah singgasana itu. ketika Sulaiman melihat singgasana itu ada di hadapannya, dia berkata: “Ini merupakan karunia Allah untuk mengujiku; apakah aku akan mensyukuri nikmat-nikmat-Nya, atau aku akan mengingkarinya. Barangsiapa yang bersyukur kepada Allah atas segala kenikmatan yang telah Dia berikan maka pahala rasa syukurnya bagi dirinya sendiri, dan barangsiapa yang mengingkari kenikmatan dan enggan bersyukur maka Tuhanku Maha Kaya, tidak membutuhkan rasa syukur itu, dan Maha Pemurah dengan luasnya kenikmatan bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. قَالَ الَّذِى عِندَهُۥ عِلْمٌ مِّنَ الْكِتٰبِ (Berkatalah seorang yang mempunyai ilmu dari Al Kitab) Mayoritas ahli tafsir berpendapat bahwa nama orang yang mempunyai ilmu dari al-Kitab adalah Ashif bin Barkhiya, orang dari kalangan Bani Israil, ia adalah seorang Menteri Nabi Sulaiman. Pendapat lain mengatakan bahwa ia adalah Nabi Sulaiman itu sendiri, seakan-akan Nabi Sulaiman menganggap apa yang akan dilakukan Ifrit terlalu lambat, sehingga ia meremehkan kemampuannya dengan mengatakan: “aku dapat mendatangkan itu untukmu sebelum kamu mengedipkan mata.” Yang dimaksud dengan (الطرف) adalah adalah mengedipkan kelopak mata dan membukanya kembali untuk melihat. Dan yang dimaksud dengan mengedipkan mata adalah mengatupkan kelopak mata. Istilah ini sama saja ketika sesorang mengatakan kepada temannya “lakukanlah itu sekarang juga.” فَلَمَّا رَءَاهُ مُسْتَقِرًّا عِندَهُۥ (Maka tatkala Sulaiman melihat singgasana itu terletak di hadapannya) Maka Sulaiman mengizinkannya untuk mendatangkan singgasana itu, lalu ia berdoa kepada Allah sehingga ia dapat mendatangkan sunggasana tersebut. Ketika Sulaiman telihat singgasana itu telah ada di hadapannya ia berkata: قَالَ هٰذَا مِن فَضْلِ رَبِّى لِيَبْلُوَنِىٓ ءَأَشْكُرُ أَمْ أَكْفُرُ قَالَ هٰذَا مِن فَضْلِ رَبِّى لِيَبْلُوَنِىٓ ءَأَشْكُرُ أَمْ أَكْفُرُ ۖ( iapun berkata: “Ini termasuk kurnia Tuhanku untuk mencoba aku apakah aku bersyukur atau mengingkari (akan nikmat-Nya)) Yakni untuk mengujiku apakah aku akan bersyukur kepada Allah atas kenikmatan ini dan mengakui bahwa itu merupakan karunia dari-Nya, atau aku akan mengingkarinya dengan tidak bersyukur kepada-Nya sama sekali."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "قَالَ ٱلَّذِى عِندَهُۥ عِلْمٌ مِّنَ ٱلْكِتَٰبِ أَنَا۠ ءَاتِيكَ بِهِۦ قَبْلَ أَن يَرْتَدَّ إِلَيْكَ طَرْفُكَ ۚ فَلَمَّا رَءَاهُ مُسْتَقِرًّا عِندَهُۥ قَالَ هَٰذَا مِن فَضْلِ رَبِّى لِيَبْلُوَنِىٓ ءَأَشْكُرُ أَمْ أَكْفُرُ ۖ وَمَن شَكَرَ فَإِنَّمَا يَشْكُرُ لِنَفْسِهِۦ ۖ وَمَن كَفَرَ فَإِنَّ رَبِّى غَنِىٌّ كَرِيمٌ 1 ). \"Dia menggunakan ilmu bukan dengan kekuatan\" 2 ). Perhatikan pada ayat ini tatkala didatangkan kepada Sulaiman singgasana Bilqis : { مُسْتَقِرًّا } walaupun waktu yang dibutuhkan sangat cepat untuk memindahan singgasana besar itu dari kerajaan Bilqis, akan tetapi seakan-akan ia telah lama tersimpan di tempat itu, padahal menjadi kebiasaan manusia ketika memindahkan suatu barang besar dengan waktu yang singkat akan meninggalkan bekas bahwa barang itu baru saja dipindahkan, dan hal ini tidak terjadi pada singgasana Bilqis. Maha kuasa Allah dengan segala kekuatanNya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Berkatalah seorang ulama Al Kitab: \"Aku akan membawa singgasana itu kepadamu sebelum matamu berkedip\". Maka tatkala Sulaiman melihat singgasana itu terletak di hadapannya, iapun berkata: \"Ini termasuk karunia Tuhanku untuk mencoba aku apakah aku bersyukur atau mengingkari nikmat-Nya. Barangsiapa yang bersyukur maka sesungguhnya dia bersyukur untuk kebaikan dirinya sendiri dan barangsiapa yang ingkar, maka sesungguhnya Tuhanku Maha Kaya lagi Maha Mulia. Tidak butuh atas rasa syukurnya. Sikap ini adalah pembelajaran agung untuk senantiasa bersyukur atas nikmat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seorang yang mempunyai ilmu dari kitab berkata,“Aku yang membawanya kepadamu sebelum matamu berkedip” Ketika dia melihat itu} Sulaiman melihat singgaasana itu {ada di hadapannya, dia berkata,“Ini termasuk karunia Tuhanku untuk mengujiku} untuk mengujiku {apakah aku bersyukur atau ingkar. Siapa saja yang bersyukur, maka sesungguhnya dia bersyukur untuk dirinya sendiri. Siapa saja yang kufur, maka sesungguhnya Tuhanku Maha kaya lagi Maha mulia”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38-40 sulaiman telah mengetahui bahwa mereka akan berangkat menuju kepadanya. Maka dia segera berkata kepada jin dan manusia yang hadir disisinya, “siapakah di antara kamu sekalian yang sanggup membawa singgasananya kepadaku sebelum mereka datang kepadaku sebagai orang-orang yang berserah diri?” maksudnya, agar kita dapat menguasainya sebelum mereka menyerahkan diri, sehingga harta mereka menjadi terpelihara. “berkatalah ifrit (yang cerdik) drai golongan jin,” ifrit adalah jin yang paling kuat lagi sangat aktif sekali, “ aku akan datang kepadamu dengan membawa singgasana itu kepadamu sebelum kamu berdiri dari tempat dudukmu; sesungguhnya aku benar-benar kuat membawanya lagi dapat dipercaya,” secara zahir, sulaiman saat itu berada di negeri syam, sehingga perjalanan pulang pergi antara dia dan negeri saba’ kira-kira sejauh perjalanan 4 bulan: dua pulang untuk pergi dan dua bulan untuk pulang. Namun demikian ifrit berkata,”aku berkomitemen untuk membawanya, bagaimanapun besar dan beratnya serta jauhnya perjalanan, sebelum engkau beranjak dari tempat dudukmu yang saat ini sedang engkau duduki.” Biasanya pertujuan yang panjang itu adalah selama panjangnya waktu dhuha kira-kira sepertiga hari. Ini adalah kebiasaan yang panjang. Dan kadang-kadang kurang dari itu atau lebih. Inilah raja yang agung yang beberapa gelintir dari para pengikutnya mempunyai kekuatan dan kemampuan seperti itu. Yang lebih dahsyat dari itu lagi adalah bahwa, “berkatalah seorang yang mempunyai ilmu dari al-kitab,” para ahli tafsir mengatakan,”seorang lelaki shalih yang ada di sisi sulaiman, namanya Ashaf bin barkhiya’. Dia mengetahu nama Allah yang teragung, yang kalau Allah dimohon dengannya pasti mengabulkan, dan kalau diminta dengannya pasti memberi, “aku akan membawa singgasana itu kepadamu sebelum matamu berkedip,” dengan berdoa kepada Allah yang teragung itu, hingga singgasana itu hadir saat itu juga. Dia pun berdoa kepada Allah, maka singgasana itu datang. Allah yang lebih mengetahui maksudnya, apakah ini yang dimaksud, atau dia adalah orang yang mempunyai ilmu dari al-kitab yang dengannya dia mempunyai kemampuan untuk mengambil benda yang jauh dan menjangkau sesuatu yang sulit “maka tatkala dia melihat singgasana itu,” maksudnya, sulaiman melihatnya, “terletak di hadapannya,” maka dia memuji kepada Allah atas ketentuanNya, kerajaanNya dan kemudahan segala perkara baginya, dan “dia pun berkata, ‘ini termasuk karunia Rabbku untuk mengujiku apakah aku bersyukur atau mengingkari’.” Maksudnya, untuk mengujiku dalam hal ini. Jadi, sulaiman sama sekali tidak terpedaya dengan kerajaan, kekuasaan dan kemampuannya, seperti kebiasaan para raja jahiliyyah, bahkan dia mengetahui bahwa itu semua adalah ujian dari Rabbnya. Maka dari itu dia takut kalau tidak bisa mensyukuri nikmat ini. Kemudian dia menjelaskan bahwa kesyukuran itu manfaatnya sama sekali bukan untuk Allah, melainkan kembali kepada orang yang bersyukur itu sendiri, seraya berkata, ”dan barangsiapa yang bersyukur maka sesungguhnya dia bersyukur untuk (kebaikan) dirinya sendiri, dan barangsiapa yang ingkar, maka sesungguhnya Rabbku mahakaya lagi Mahamulia.” Mahakaya dari segala amalnya, Mahamulia lagi banyak kebaikannya, meliputi orang yang bersyukur dan yang mengingkari. Hanya saja mensyukuri nikmat-nikmatNya akan menambah nikmat itu sendiri, sedangkan mengingkarinya menyebabkan kemusnahannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 40: Kemudian berkata salah seorang laki-laki yang memiliki ilmu dari Al Kitab, dikatakan ia memiliki ilmu akan nama-nama Allah yang agung : Aku akan mendatangkan kepadamu dengan sekejap mata, yaitu ketika engkau mengedipkan matamu. Kemudian Sulaiman mengizinkannya, ia berdoa kepada Allah dengan nama-Nya yang agung, datanglah kerajaan (bilqis) tersebut di hadapan Sulaiman, kemudian Sulaiman berkata : Ini adalah karunia dari Tuhanku dan kasih sayang-Nya padaku, hal itu juga menjadi ujian bagiku, apakah aku menjadi orang yang bersyukur dan menyandarkan rasa syukru tersebut kepada Allah atau akau kufur akan nikmat Allah kemudian aku tidak mensyukuri nikmat tersebut. Kemudian Sulaiman berkata : Barangsiapa yang bersyukur kepada Allah, maka manfaatnya akan kembali kepadanya, adapun yang mendustakannya, maka sungguh Allah adalah maha kaya dari makhluk-Nya, Dialah yang maha mulia yang memuliakan dan mengkaruniakan kepada hamba-Nya dengan nikmat dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kitab di sini maksudnya kitab yang diturunkan sebelum Nabi Sulaiman ‘alaihis salam, yaitu Taurat dan Zabur. Orang yang disebutkan itu bernama Ashaf bin Barkhiya juru tulis Nabi Sulaiman, seorang yang shiddiq (yang sangat membenarkan) yang mengetahui Ismul a’zham (nama Allah yang agung) yang jika berdoa dengannya, maka akan dikabulkan, dan jika meminta dengannya, maka akan dipenuhi. Syaikh Ibnu ‘Utsaimin dalam tafsir Juz ‘Amma (pada tafsir surah An Naazi’at) menjelaskan, para ulama mengatakan bahwa yang membawa singgasana itu demikian cepat adalah para malaikat. Mereka membawanya dari Yaman dengan sekejap, sedangkan Sulaiman berada di Syam. Hal ini menunjukkan bahwa kekuatan malaikat melebihi kekuatan jin, meskipun begitu mereka sangat takut kepada Allah Subhaanahu wa Ta'aala. Ada yang berpendapat, bahwa maksudnya, “Lihatlah ke atas, jika penglihatanmu sudah terasa lelah (dan engkau mengedipkan matamu), maka singgasana itu akan hadir di depanmu.” Menurut Wahab bin Munabbih, “Tetaplah melihat, maka setelah lama melihat, singgasana itu akan berada di hadapanmu.” Lalu dia (Ashaf) bangkit kemudian berwudhu’ serta berdoa kepada Allah Subhaanahu wa Ta'aala.” Mujahid berkata, “Dia mengucapkan (dalam doanya), “Yaa Dzal Jalaali wal ikram.” Beliau memuji Allah atas pemberian-Nya dan kemudahan dari-Nya. Beliau 'alaihis salam tidak tertipu oleh kerajaannya dan kekuasaannya seperti halnya kebiasaan raja-raja yang jahil (bodoh). Bahkan Beliau mengetahui, bahwa hal itu adalah ujian dari Tuhannya, dan Beliau khawatir jika sampai tidak bersyukur atas nikmat itu. Selanjutnya Beliau menerangkan, bahwa manfaat syukur itu kembalinya kepada manusia, tidak kepada Allah Subhaanahu wa Ta'aala. Yakni, tidak berterima kasih atas nikmat itu. Tidak butuh syukur hamba-Nya. Kebaikan-Nya merata baik kepada orang yang bersyukur maupun orang yang kufur, hanyasaja mensyukuri nikmat-Nya menjadikannya bertambah, sedangkan mengkufuri nikmat-Nya menjadikannya hilang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 40",
    "description": "Nabi sulaiman rupanya menginginkan lebih cepat dari itu, lalu tampillah seorang yang mempunyai ilmu dari kitab, yaitu kitab-kitab sebelum nabi sulaiman seperti kitab taurat dan zabur, menawarkan dirinya dan berkata, wahai sulaiman! aku akan membawa singgasana itu kepadamu sebelum matamu berkedip, setelah memandangi sesuatu benda yang jauh dengan mata yang terbelalak. Maka ketika dia, sulaiman, melihat singgasana itu terletak di hadapannya, dia pun berkata dengan hati penuh syukur, 'ini termasuk karunia tuhanku untuk mengujiku, apakah aku bersyukur atau mengingkari nikmat-Nya. Barangsiapa bersyukur, dengan hatinya melalui pengakuan yang tulus, atau lisan-Nya melalui ungkapan tahmid, tasbih atau lainnya atau melalui anggota tubuh yang lainnya dengan menggunakan kenikmatan itu untuk mencari rida Allah, maka sesungguhnya dia bersyukur untuk kebaikan dirinya sendiri, karena Allah akan menambahkan banyak lagi kenikmatan kepadanya dan barangsiapa ingkar terhadap nikmat-Nya seperti menganggap nikmat yang diperolehnya karena jerih payahnya saja atau menggunakannya untuk kemaksiatan, maka sesungguhnya tuhanku mahakaya, tidak membutuhkan iapa pun, bahkan sebaliknya semua makhluk membutuhkan-Nya, serta mahamulia tidak pernah melakukan sesuatu yang tak terpuji. \"41. Nabi sulaiman ingin mengetahui sampai sejauh mana ratu balqis teliti terhadap singgasananya, ia ingin memperlihatkan kepadanya akan kemahakuasaan Allah, zat yang disembah oleh nabi sulaiman, di samping untuk memperlihatkan mukjizat yang Allah berikan kepada nabi sulaiman. Dia, sulaiman, berkata, 'ubahlah untuknya singgasananya; dengan menjadikan singgasananya tidak persis seperti aslinya. Kita akan melihat apakah dia, balqis, mengenal singgasananya yang telah berubah itu atau tidak mengenalnya lagi. '."
  }
]