[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sulaiman berkata kepada makhluk-makhluk yang ada di sisinya, “Ubahlah bentuk singgasana kerajaannya yang dipakainya untuk duduk ke bentuk yang ia kenal bila ia melihatnya, supaya bisa kita lihat apakah ia sadar dapat mengenalnya ataukah termasuk orang-orang yang tidak menyadarinya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Sulaiman -'alaihissalām- berkata, \"Ubahlah bentuk singgasana kerajaannya dari bentuk aslinya; kita lihat apakah dia mengenal bahwa itu merupakan singgasananya, ataukah dia termasuk orang-orang yang tidak mengenal barang-barang yang dimilikinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-43. Sulaiman hendak mengajak ratu itu untuk masuk Islam, dengan memerintahkan: “Ubahlah sebagian ciri-ciri dari singgasana itu, agar kita dapat melihat apakah ratu itu masih mengenal singgasananya, sehingga dapat menjadi sebab hidayahnya menuju agama Islam karena dalam mendatangkan singgasana itu terdapat mukjizat yang luar biasa yang menjadi bukti kebenaran Sulaiman.” Ratu itu takjub dan mengakui mukjizat itu: “Sepertinya ini adalah singgasanaku” -dia mengetahui terdapat beberapa yang diubah-. Dari sini Sulaiman mengetahui kecerdasan akal ratu itu, kemudian dia menyampaikan kenikmatan Allah dan menjelaskan kepada sang ratu keagungan ilmu jika ilmu itu berasal dari Allah dan kekuasaan Allah dalam menguatkan para nabi-Nya: “Kami mendapat ilmu dari kuasa Allah sebelum ratu Saba mengetahui. Dan kami tunduk kepada agama Allah.” Akan tetapi penyembahannya terhadap matahari menghalanginya beriman kepada Allah, dia termasuk orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. قَالَ نَكِّرُوا۟ لَهَا عَرْشَهَا (Dia berkata: “Rubahlah baginya singgasananya) Yakni ubahlah tempat duduknya sampai Bilqis tidak dapat mengenalinya lagi ketika ia melihatnya. Pendapat lain mengatakan maknanya adalah ubahlah singgasana itu dengan menambah dan mengurangi bagian-bagiannya. Terdapat pendapat mengatakan bahwa kaum Nabi Sulaiman berkata kepadanya bahwa Bilqis memiliki masalah pada akalnya sehingga Nabi Sulaiman ingin mengujinya. نَنظُرْ أَتَهْتَدِىٓ(maka kita akan melihat apakah dia mengenal) Apakah ia akan mendapat petunjuk untuk mengenalnya. Atau mendapat petunjuk untuk beriman kepada Allah. أَمْ تَكُونُ مِنَ الَّذِينَ لَا يَهْتَدُونَ(ataukah dia termasuk orang-orang yang tidak mengenal(nya)) Atau ia tidak mendapat petunjuk tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Sulaiman berkata kepada para pengikutnya: \"Rubahlah sedikit singgasananya dengan menambah atau menguranginya agar ini dirasa asing bagi Balqis. Ini sebagai ujian bagi akalnya; Maka kita akan melihat apakah dia mengenal ataukah dia termasuk orang-orang yang tidak mengenalnya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Ubahlah} ubahlah {untuknya singgasananya, kita akan melihat apakah dia mendapat petunjuk} untuk mengenalinya {atau termasuk orang yang tidak mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41 kemudian dia berkata kepada orang yang ada di sekitarnya, “rubahlah baginya singgasananya,” maksudnya, rubahlah ia dengan cara menambah atau menguranginya, dan kita dalam hal ini, “akan melihat,” dengan maksud menguji kecerdasan balqis, “apakah dia mengenal,” yang benar, dan dia benar-benar mempunyai kecerdasan dan kepandaian yang laik dengan kerajaannya, “ataukah dia termasuk orang-orang yang tidak mengenal(nya),”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 41: Berkata Sulaiman kepada mereka : Buatlah oleh kalian kerajaan (singgasana) dengan sebagian yang diubah, dikurangi dan tambahan padanya; Agar kita dapat menguji bagaimana pendapatnya dan apakah dia menyadarinya, kemudian kita lihat apakah dia tahu akan singgasananya atau termasuk yang tidak memahaminya ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik dengan ditambah atau dikurangi. Maksudnya adalah untuk menguji akalnya; apakah ia memiliki kecerdasan dan kepandaian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 41",
    "description": "Nabi sulaiman ingin mengetahui sampai sejauh mana ratu balqis teliti terhadap singgasananya, ia ingin memperlihatkan kepadanya akan kemahakuasaan Allah, zat yang disembah oleh nabi sulaiman, di samping untuk memperlihatkan mukjizat yang Allah berikan kepada nabi sulaiman. Dia, sulaiman, berkata, 'ubahlah untuknya singgasananya; dengan menjadikan singgasananya tidak persis seperti aslinya. Kita akan melihat apakah dia, balqis, mengenal singgasananya yang telah berubah itu atau tidak mengenalnya lagi. '42. Singgasana ratu balqis akhirnya diubah, berbeda dari aslinya kemudian singgasana itu diletakkan di tempat yang akan dilewati oleh ratu balqis. Maka ketika dia, balqis, datang dan melewati tempat yang ada singgasananya, ditanyakanlah kepadanya, 'serupa inikah singgasanamu'' dia, balqis, menjawab dengan sedikit ragu, 'seakan-akan itulah dia singgasanaku. ' dan balqis terus berkata, 'kami telah diberi pengetahuan akan kenabian nabi sulaiman, cerita tentang burung hudhud, dan cerita tentang utusan kami yang membawa hadiah untuk nabi sulaiman, sebelumnya yaitu sebelum kejadian yang mencengangkan ini dan kami adalah orang-orang yang berserah diri kepada Allah. Karena kejadian demi kejadian yang kami lihat dan kami amati, membuktikan bahwa kami berada dalam kesesatan dan ajakan nabi sulaiman adalah ajakan yang benar. \"."
  }
]