[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketika Ratu Saba’ datang kepada Sulaiman di majelisnya, maka dikatakan kepada wanita itu, “Apakah seperti ini singgasanamu?” ia menjawab, “Sesungguhnya itu menyerupainya.” Maka Sulaiman merasa bahwa wanita itu telah benar dalam jawabannya, dan sesungguhnya ia telah meyakini kekuasaan Allah dan kebenaran kenabian Sulaiman. Sulaiman berkata, “Dan kami telah diberi pengetahuan tentang Allah dan besarnya kekuasaanNya sebelum wanita itu. Dan kami adalah orang-orang yang tunduk kepada perintah Allah lagi mengikuti ajaran agama Islam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Maka ketika Ratu Saba` tersebut datang kepada Sulaiman, ditanyakanlah kepadanya untuk mengujinya, \"Serupa inikah singgasanamu?\" Dia menjawab, \"Seakan-akan singgasana ini adalah singgasanaku. Sulaiman lalu berkata, \"Allah telah memberi kami pengetahuan tentangnya sebelumnya karena Dia Maha Kuasa untuk hal ini, dan kami adalah orang-orang yang berserah diri lagi taat kepada perintah-Nya\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. فَلَمَّا جَآءَتْ (Dan ketika Balqis datang) Yakni ketika Bilqis datang kepada Nabi Sulaiman. قِيلَ(ditanyakanlah kepadanya) Ditanyakan kepada Bilqis. Dan orang yang bertanya adalah Nabi Sulaiman atau orang lain yang diperintah oleh Nabi Sulaiman. أَهٰكَذَا عَرْشُكِ ۖ قَالَتْ كَأَنَّهُۥ هُوَ ۚ(“Serupa inikah singgasanamu?” Dia menjawab: “Seakan-akan singgasana ini singgasanaku) Bilqis antara mengenal dan tidak, dan ia merasa heran dengan keberadaan singgasana itu di tempat Nabi Sulaiman, sehingga ia berkata: “seakan-akan itu adalah singgasanaku,” ia masih tidak yakin dengan hal itu. وَأُوتِينَا الْعِلْمَ مِن قَبْلِهَا وَكُنَّا مُسْلِمِينَ (kami telah diberi pengetahuan sebelumnya dan kami adalah orang-orang yang berserah diri) Terdapat pendapat mengatakan orang yang mengatakan ini adalah Sulaiman. Yakni kami"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Ketika Bilqis datang, dia ditanya: \"Serupa inikah singgasanamu?\" Dia menjawab: \"Seakan-akan singgasana ini singgasanaku, kami telah diberi pengetahuan sebelumnya sehingga kami mengenalinya. Kami adalah orang-orang yang berserah diri\". Maka Sulaiman berkata setelah mendengar jawaban Bilqis: Bilqis telah mendapat ilmu dengan kekuasaan Allah, dan kami termasuk orang yang berpegang kepada hukum Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika dia datang, dikatakan kepadanya,“Apakah ini singgasanamu” Dia menjawab,“Sepertinya iya. Kami telah diberi pengetahuan sebelumnya} Sulaiman berkata,”Kami telah diberi pengetahuan oleh Allah dengan kuasaNya {dan kami adalah orang-orang yang berserah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42 “dan ketika balqis datang,” menghadap sulaiman, maka sulaiman memperlihatkan kepadanya singgasana itu, yang ama balqis belum lama meninggalkannya di negerinya. Dan “ditanyakanlah kepadanya, ’serupa inikah singgasanamu?’” maksudnya, sesungguhnya kami yakin bahwa anda mempunyai singgasana yang sangat besar. Apakah ia serupa dengan singgasana yang kami perlihatkan kepada anda ini? “dia menjawab, ’seakan-akan singgasana ini singgasanaku’,” ini menunjukkan kecerdasan dan kepandaiannya. Ia tidak mengatakan, ’ia ini,” karena adanya perubahan dan modifikasi dalam singgasana tersebut, dan dia juga tidak menafikkan kalau itu adalah singgasananya, karena dia memang mengenalnya. Maka dari itu dia mengungkapkan jawabannya dengan ungkapan yang mengandung dua kemungkinan, mengandung dua sayap makna. Maka sulaiman dengan rasa kagum kepada kehebatan dan kecerdasannya, dan rasa bersyukur kepada Allah karena telah mengaruniakan kepada dirinya karunia yang lebih besar daripada yang dikaruniakanNya kepada balqis, berkata, ”kami telah diberi pengetahuan sebelumnya,” maksudnya, hidayah, kecerdasan dan ketegasan sebelum ratu ini, “dan kami adalah orang-orang yang berserahdiri,” inilah hidayah sesungguhnya yang (sangat) bersemangat. Dan ada kemungkinan bahwa ungkapan ini adalah perkataan sang ratu saba’ itu (yang artinya), dan kami telah diberi pengetahuan tentang kerajaan sulaiman, kekuasaan dan kehebatannya sebelum keadaan di mana kami melihta kemampuannya menghadirkan singgasana ini dari jarak yang sangat jauh. Maka dari itu kami tunduk kepadanya, kami datang dengan berserah diri dan tunduk pada kekuasaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 42: Ketika sampai raja (bilqis) kepada Sulaiman, nampak kepadanya akan singgasananya setelah diubah-ubah, berkata Sulaiman kepadanya : Apakah singgasana ini mirip dengan milikmu ? Dia berkata : Mirip dan menyerupai. Bilqis tidak berkata : Ya seperti milikku; Tidak juga berkata : Tidak, milikku tidak demikian; Akan tetapi dia berkata : Seperti milikku; Karena yang demikian adalah jawaban yang lebih afdhal, sebagaimana dikatakan oleh Ibnu Katsir : Hal ini merupakan jawaban yang cerdas dan bermartabat. Kemudian berkata Sulaiman : Telah menyapa pada wanita ini kebenaran, akan tetapi kami diberikan ilmu oleh Allah dan karena kuasa-Nya sebelumnya, dan kami adalah orang-orang yang mengikuti agama islam yang tunduk kepada perintah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini menunjukkan kecerdasannya. Ia tidak mengatakan, “Memang ini.” Karena adanya sedikit perubahan, tetapi tidak menafikan bahwa ia adalah singgasananya. Ia menjawab dengan kata-kata yang mengandung dua kemungkinan; yang kedua-duanya benar. Jelaslah bagi Nabi Sulaiman bahwa jawabannya benar, dan ia (Balqis) pun akhirnya mengetahui kekuasaan Allah dan benarnya kenabian Sulaiman ‘alaihis salam, maka Nabi Sulaiman berkata karena kagum terhadap diri ratu Balqis yang mendapat petunjuk dan terhadap kecerdasannya serta sebagai rasa syukur kepada Allah karena dikaruniakan nikmat yang lebih dari itu, “Kami telah diberi pengetahuan tentang Allah dan kekuasaan-Nya sebelumnya dan kami adalah orang-orang yang tunduk kepada perintah Allah lagi mengikuti agama Islam.” Bisa juga, bahwa kata-kata ini adalah kata-kata ratu Balqis, sehingga artinya, “Dan kami telah diberi pengetahuan tentang kerajaan Sulaiman dan kekuasaannya sebelum peristiwa yang saat ini kami melihatnya, yaitu membawakan singgasana dari jarak yang jauh, maka kami tunduk dan datang dalam keadaan menyerahkan diri.” Yakni hidayah, akal dan kematangan sebelum ratu Balqis. Inilah hidayah yang bermanfaat lagi sebagai modal dasarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 42",
    "description": "Singgasana ratu balqis akhirnya diubah, berbeda dari aslinya kemudian singgasana itu diletakkan di tempat yang akan dilewati oleh ratu balqis. Maka ketika dia, balqis, datang dan melewati tempat yang ada singgasananya, ditanyakanlah kepadanya, 'serupa inikah singgasanamu'' dia, balqis, menjawab dengan sedikit ragu, 'seakan-akan itulah dia singgasanaku. ' dan balqis terus berkata, 'kami telah diberi pengetahuan akan kenabian nabi sulaiman, cerita tentang burung hudhud, dan cerita tentang utusan kami yang membawa hadiah untuk nabi sulaiman, sebelumnya yaitu sebelum kejadian yang mencengangkan ini dan kami adalah orang-orang yang berserah diri kepada Allah. Karena kejadian demi kejadian yang kami lihat dan kami amati, membuktikan bahwa kami berada dalam kesesatan dan ajakan nabi sulaiman adalah ajakan yang benar. \"43. Allah lalu menjelaskan akan terhambatnya ratu balqis untuk cepat berbalik menyembah kepada Allah. Dan kebiasaannya menyembah selain Allah seperti penyembahannya kepada matahari, mencegahnya untuk melahirkan keislamannya dengan cepat. Sesungguhnya, dia, balqis, dahulu termasuk orang-orang kafir, menutupi dirinya dari kebenaran, sampai datang kepadanya ajakan nabi sulaiman, yang disertai dengan kisah-kisah yang menakjubkannya yang menunjukkan kebenaran ajakan nabi sulaiman."
  }
]