[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apa yang disembah oleh sang ratu selain Allah telah menghalang-halanginya untuk beribadah kepada Allah. Sesungguhnya dia dahulu adalah seorang wanita yang kafir dan tumbuh berkembang ditengah kaum yang kafir dan terus berjalan di atas ajaran agama mereka. Hanya saja ia punya kecerdasan dan kepandaian yang dengan itu dia dapat mengetahui (membedakan) antara kebenaran dan kebatilan. Akan tetapi, keyakinan-keyakinan yang batil telah melenyapkan cahaya mata hatinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dan ia (Ratu Saba`) dijauhkan dari tauhid oleh apa yang disembahnya selain Allah karena mengikuti kaumnya, sesungguhnya dia dahulunya berasal dari orang-orang yang kafir terhadap Allah, sehingga ia pun kafir seperti mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَصَدَّهَا (mencegahnya) Yakni menghalanginya dari keimanan. مَا كَانَت تَّعْبُدُ مِن دُونِ اللهِ ۖ( apa yang disembahnya selama ini selain Allah) Yakni kebiasaannya menyembah matahari yang sudah ia lakukan sejak kecil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Kesesatan mencegahnya untuk menunjukkan keislamannya dan keimanannya kepada Allah, karena sesungguhnya dia dahulu termasuk orang-orang yang kafir dan tidak beriman kepada Allah dengan menyembah matahari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kegiatannya menyembah selain Allah telah mencegahnya} menghalanginya untuk menyembah Allah {Sesungguhnya dia dahulu termasuk kaum yang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43 Allah berfirman, ”dan apa yang disembahnya selama ini selain Allah, telah mencegahnya,” maksudnya, mencegahnya untuk masuk islam. Sebab, dia mempunyai kecerdasan dan kepandaian yang bisa digunakan untuk membedakan mana yang haq dan mana yang batil. Akan tetapi keyakinan-keyakinan yang palsu telah melenyepkan mata (hati) nya, “sesungguhnya dia dahulunya termasuk orang-orang yang kafir,” maka dari itu dia tetap berpegang kepada agama (sesat) mereka. Kesendirian seseorang dari para ahli agama dan kebiasaan yang berlanjut pada suatu perkara yang dia lihat dengan aklanya, berupa kesesatan dan kesalahan mereka merupakan sesuatu yang sangat jarang terjadi. Maka dari itu tidak aneh kalau balqis tetap pada kekafirannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 43: Kemudian Allah menjelaskan terhalangnya raja (bilqis) ini dari masuknya kepada agama islam, dan dari beribadah kepada Allah saja tanpa menyekutukan-Nya; Sebabnya adalah karena tersebarnya di antara kaum itu penyembahan kepada matahari, mereka mengingkari nikmat Allah dan beribadah kepada selain Allah serta didapati pula nenek moyangnya tersesat seperti demikian, kemudian mereka mengikutinya dan jadilah mereka mengikuti jalan nenek moyang mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena tinggal di lingkungan orang-orang yang kafir, meskipun ia (Balqis) memiliki kecerdasan yang dengannya ia dapat mengetahui yang hak dan yang batil, akan tetapi keyakinan-keyakinan yang batil menghilangkan mata hatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 43",
    "description": "Allah lalu menjelaskan akan terhambatnya ratu balqis untuk cepat berbalik menyembah kepada Allah. Dan kebiasaannya menyembah selain Allah seperti penyembahannya kepada matahari, mencegahnya untuk melahirkan keislamannya dengan cepat. Sesungguhnya, dia, balqis, dahulu termasuk orang-orang kafir, menutupi dirinya dari kebenaran, sampai datang kepadanya ajakan nabi sulaiman, yang disertai dengan kisah-kisah yang menakjubkannya yang menunjukkan kebenaran ajakan nabi sulaiman. 44. Kejutan berikutnya yang ingin diperlihatkan oleh nabi sulaiman kepada balqis adalah ketika balqis diajak untuk melihat seisi istana nabi sulaiman yang megah dan indah, untuk memperlihatkan istana-Nya yang lebih hebat dari istana balqia di yaman. Dikatakan kepadanya balqis, 'masuklah ke dalam istana. ' yang di dalamnya ada lantai yang berlapis kaca yang sangat bening, sehingga terlihat jelas apa yang ada di bawahnya. Maka ketika dia balqis melihat lantai istana itu, dia terkecoh, dikiranya dia akan memasuki kolam air yang besar, dan oleh karena itu disingkapkannya penutup kedua betisnya agar tidak basah oleh air kolam itu. Melihat kejadian cukup menggelikan itu, dia, sulaiman, berkata, 'sesungguhnya ini bukanlah kolam air yang kau sangka, tapi hanyalah lantai istana yang dilapisi kaca. ' pada akhirnya balqis mengakui semua kehebatan nabi sulaiman, dan apa yang dia lihat adalah betul-betul mencerminkan kekuasaan Allah zat yang patut disembah. Dia balqis berkata, dengan penuh kesadaran dan keyakinan yang mantap 'ya tuhanku, zat yang memiliki dan mengurusiku! sungguh, aku telah berbuat zalim terhadap diriku karena telah menyembah selain Allah yaitu matahari yang tidak mempunyai kekuatan apa pun dan tidak bisa memberi perlindungan kepada penyembahnya jika mereka berada dalam keadaan bahaya. \" sebagai puncak dari pengakuan keislamannya, ratu balqis berkata: aku berserah diri bersama sulaiman kepada Allah, tuhan seluruh alam. ' dialah pemilik, pemelihara, mengurus, alam seluruh. Dialah tuhan yang wajib disembah."
  }
]