[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakan kepadanya, “Masuklah kamu ke dalam istana.” Dan lantai istana terbuat dari kaca yang dibawahnya adalah air. Ketika ia menyaksikannya, ia mengira air yang gelombangnya mengarah kesana ke mari. Dan ia menyingkap kedua betisnya supaya bisa melewati air tersebut. Maka Sulaiman berkata kepadanya, “Sesungguhnya itu adalah lantai yang licin, terbuat dari kaca yang jernih, sedang aliran air ada di bawahnya.” Maka dengan itu, dia menyadari kebesaran kerajaan Sulaiman, dan berkata, “Wahai Tuhanku, sesungguhnya aku telah menzhalimi diriku dengan perbuatan syirik yang sebelumnya aku perbuat, dan aku patuh kepada Sulaiman untuk mengikuti dan memeluk agama ajaran Tuhan seluruh alam semesta.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Lalu dikatakan kepadanya, \"Masuklah ke dalam istana\". Istana tersebut lantainya seperti bentuk kolam. Maka tatkala dia melihat lantai istana itu, dikiranya itu adalah genangan air, maka dia menyingkapkan kedua betisnya agar bisa melewatinya. Sulaiman -'alaihissalām- berkata, \"Sesungguhnya ia adalah istana licin yang terbuat dari kaca\". Lalu ia pun menyerunya masuk Islam, dan Ratu Balqis langsung menerima seruannya seraya berkata, \"Wahai Tuhanku! Sesungguhnya aku telah berbuat zalim terhadap diriku sendiri ketika menyembah tuhan lain disamping-Mu, dan aku berserah diri bersama Sulaiman kepada Allah, Tuhan seluruh makhluk\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Saat Sulaiman melihat kecerdasan dan ketelitian jawaban ratu itu, maka dia memperlihatkan hal lain untuk menunjukkan kebesaran kerajaan yang Allah berikan kepadanya dan untuk memuliakan dan menempatkan ratu itu pada kedudukan yang sesuai, agar dia dapat mengajaknya menuju agama Islam dan karena ratu itu memiliki pengaruh besar bagi kaumnya. Maka Sulaiman meminta sang ratu memasuki istana yang menakjubkan yang memiliki lantai kaca yang seperti air! Ratu itu masuk dan melihat lantai kaca yang bening dan dibawahnya terdapat air yang jernih, sehingga dia mengira itu adalah air yang bergelombang tanpa dilapisi kaca; maka sang ratu menyingkap betisnya agar pakaiannya tidak basah terkena air. Maka Sulaiman berkata: “Itu adalah lantai halus yang terbuat dari kaca yang menutupi air tersebut.” Dengan demikian sang ratu mengetahui niat baik Sulaiman untuk mengajak dirinya dan kaumnya menuju hidayah; maka dia mengikrarkan keislamannya: “Ya Tuhanku, sungguh aku telah menzalimi diriku dengan menyembah selain-Mu. Aku kini telah masuk Islam dan tunduk kepada-Mu dengan mengikuti Sulaiman dalam ketaatan kepada-Mu, Tuhan semesta alam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. قِيلَ لَهَا ادْخُلِى الصَّرْحَ ۖ(Dikatakan kepadanya: “Masuklah ke dalam istana”) Makna (الصرح) adalah istana. فَلَمَّا رَأَتْهُ حَسِبَتْهُ لُجَّةً(Maka tatkala dia melihat lantai istana itu, dikiranya kolam air yang besar) Yakni ia menyangkanya adalah lautan. Makna (اللجة) adalah air yang banyak. Oleh sebab itu ia menyingkap kedua betisnya. وَكَشَفَتْ عَن سَاقَيْهَا ۚ( dan disingkapkannya kedua betisnya) Untuk masuk ke air. Ketika ia melakukan itu Nabi Sulaiman berkata: إِنَّهُۥ صَرْحٌ مُّمَرَّدٌ مِّن قَوَارِيرَ إِنَّهُۥ صَرْحٌ مُّمَرَّدٌ مِّن قَوَارِيرَ ۗ( Sesungguhnya ia adalah istana licin terbuat dari kaca) Makna (الممرد) adalah sesuatu yang telah digosok sampai licin berkilau. Saat Bilqis mendengar hal itu ia berserah diri dan patuh. قَالَتْ رَبِّ إِنِّى ظَلَمْتُ نَفْسِى(Berkatalah Balqis: “Ya Tuhanku, sesungguhnya aku telah berbuat zalim terhadap diriku) Sebab aku dahulu menyembah selain-Mu. وَأَسْلَمْتُ مَعَ سُلَيْمٰنَ(dan aku berserah diri bersama Sulaiman) Menjadi pengikutnya dan memasuki agamanya karena Allah Tuhan semesta alam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah ta'ala berfirman tentang Bilqis sebelum keislamannya : { وَكَشَفَتْ عَنْ سَاقَيْهَا ۚ } \"dan disingkapkannya kedua betisnya\". Dari ayat ini menunjukkan bahwa pakaian Bilqis sebelum keislamannya adalah pakaian yang menutupi betisnya, lalu siapakah dia ?! perempuan kafir! namun pada hari ini sangat disayangkan para wanita muslimat saling berlomba melepas pakaian mereka dan melepas rasa malu mereka. Tanpa ada rasa malu dan tidak ada rasa takut kepada Allah! bukankah seharusnya perempuan kafir yang lebih jarang menggunakan pakaian tertutup dari sebagian kaum mulmat ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Dikatakan kepada Bilqis: \"Masuklah ke dalam istana\". Maka ketika dia melihat lantai istana itu, di mengira lautan air yang besar. Dia menyingkapkan kedua betisnya. Sulaiman berkata: \"Sesungguhnya ia adalah istana licin terbuat dari kaca, bukan lautan\". Kemudian Sulaiman menyeru Bilqis kepada Islam, Bilqis menjawab: \"Ya Tuhanku, sesungguhnya aku telah berbuat zalim terhadap diriku dan aku berserah diri bersama Sulaiman kepada Allah, Tuhan semesta alam\". Diriwayatkan dari Ibnu Syaibah dan Ibnu Abi Hatim dari Ibnu Abbas bahwa Sulaiman menikahi Bilqis setelah itu. Syaukani berkata yang lebih sahih bahwa kabar pernikahan ini adalah khabar dari ahli kitab yang tidak dibenarkan juga tidak dinafikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dikatakan kepadanya,“Masuklah ke istana} istana, di sana terdapat lantai yang terbuat dari kaca yang di bawahnya terdapat air {Ketika dia melihatnya, dia menyangkanya kolam air} dia mengiranya sebagai air {Dia menyingkapkan kedua betisnya. Dia berkata} Sulaiman berkata {“Sesungguhnya ini hanyalah lantai licin} halus {yang terbuat dari kaca} kaca {”Dia berkata,“Ya Tuhanku, sesungguhnya aku telah menzalimi diriku. Aku berserah diri bersama Sulaiman kepada Allah, Tuhan semesta alam”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44 kemudian sulaiman ingin agar balqis melihat sebagian dari kekuasaannya yang mencengangkan akal. Lalu dia menyuruhnya masuk ke mahligainya (istana), yaitu berupa tempat (ruangan) yang tinggi dan luas. Ia terbuta dari kaca yang tembus pandang, dibawahnya sungai-sungai mengalir,”dikatakan kepadanya, ’masuklah ke dalam istana.’ Maka tatkala dia melihat lantai istana itu, dikiranya kolam yang besar’.” Maksudnya, kolam air. Hal itu karena kaca-kaca itu tembus pandang, hingga air yang berada di bawahnya terlihat seolah-olah tempat itu adalah air yang mengalir tanpa pembatas yang membatasinya. “dan dia menyingkap kedua betisnya,” karena takut basah. Ini juga termasuk kecerdasan dan kesopanannya, karena dia tidak menolak masuk ke tempat yang diperintahkan kepadanya untuk dimasuki. Sebab, dia yakin bahwa dirinya tidak diundang kecuali untuk dihormati, dan dia tahu bahwa kerajaan sulaiman dan sistem regulasinya telah dibangun diatas landasan kebijaksanaan, dan dalam hatinya pun tidak sama sekali tidak ada rasa ragu sedikitpun terhadap kondisi buruk setelah apa yang telah bisa dilihatnya. Setelah dia siap untuk menceburkan diri, maka dikatakan kepadanya, ”sesungguhnya ia adalah istana licin,” maksudnya, sebuah majelis, “terbuat dari kaca,” maka anda tidak perlu menyingkap kedua betismu. Pada saat itu, ketika dia telah sampai kepada sulaiman dan menyaksikan apa yang telah dilihatnya serta mengetahui kenabian dan kerasulannya, maka dia pun bertaubat dan kembali dari kekafirannya, dan berkata, ”Ya Rabbku, sesungguhnya aku telah berbuat zhalim terhadap diriku, dan aku berserah diri bersama sulaiman kepada Allah, Rabb semesta alam.” Demikianlah bagian dari kisah ratu negeri saba’ yang Allah kisahkan kepada kita dan tentang apa yang terjadi antara dia dengan sulaiman. Adapun selain itu kisah-kisah tambahan dan kisah-kisah israiliyat (yang bersumber dari bani israil) maka tidak ada sama seklai hubungannya dengan tafsir (penjelasan) terhadap firman Allah, yang mana tafsir itu harus berdasarkan pada dalil yang telah dimaklumi lagi terjaga, sedangkan nukilan-nukilan dalam masalah ini, semuanya atau kebanyakannya tidak demikan. Kewajiban yang harus dilakukan adalah mengabaikannya dan tidak memasukkannya ke dalam tafsir. Wallahu’alam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 44: Dikatakan kepada raja tersebut (bilqis), masuklah engkau ke dalam istanaku, maka ketika ia masuk dan melihat lantai dan menyangka bahwa itu adalah air, dia menyingkap betisnya agar tidak basah karenanya, berkatalah Sulaiman kepadanya : Sungguh lantai ini terbuat dari kaca yang bening, yang terlihat di bawahnya air bening yang mengalir, seolah-olah kaca itu tidak ada. Maka ketika bilqis melihat hal itu, dia segera mengetahui akan keagungan Allah dan kenabian Sulaiman serta kerisalahannya, kemudian ia bertaubat dari kesyirikannya, dia mengetahui akan kebathilan apa yang ada pada kesyirikan tersebut. Kemudian dia masuk ke dalam islam, berserah diri kepada Allah Sang Pencipta Alam.Berkata Syaikh Asy Sya’rawi : Bilqis menjadikan mulia kerajaannya dengan berkata : Aku berserah diri bersama Sulaiman. Tidak berkata : Aku berserah diri mengikuti Sulaiman, sebagaimana para pengikut Nabi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Nabi Sulaiman ‘alaihis salam ingin agar Balqis melihat kekuasaannya yang menyilaukan akal, maka Beliau memerintahkan Balqis agar masuk ke dalam Sharh, yaitu majlis Beliau yang tinggi dan luas, majlis itu terbuat dari kaca dan di bawahnya ada sungai yang mengalir. Untuk menyelamkan kakinya. Nabi Sulaiman ‘alaihis salam sebelumnya memerintahkan kepada para setan untuk membuatkan istana yang besar dari kaca dan dialirkan air di bawahnya karena kedatangan (Balqis). Oleh karena itu, orang yang tidak mengetahui keadaannya akan mengira bahwa lantai itu adalah kolam air, padahal ada kaca tipis yang menghalangi antara pejalan dengan air yang di bawahnya. Selanjutnya, Beliau mengajak Balqis masuk ke dalam Islam, dan ia pun mau memeluk Islam. Setelah mengetahui kebesaran kearajaan Nabi Sulaiman. Karena beribadah kepada selain-Mu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 44",
    "description": "Kejutan berikutnya yang ingin diperlihatkan oleh nabi sulaiman kepada balqis adalah ketika balqis diajak untuk melihat seisi istana nabi sulaiman yang megah dan indah, untuk memperlihatkan istana-Nya yang lebih hebat dari istana balqia di yaman. Dikatakan kepadanya balqis, 'masuklah ke dalam istana. ' yang di dalamnya ada lantai yang berlapis kaca yang sangat bening, sehingga terlihat jelas apa yang ada di bawahnya. Maka ketika dia balqis melihat lantai istana itu, dia terkecoh, dikiranya dia akan memasuki kolam air yang besar, dan oleh karena itu disingkapkannya penutup kedua betisnya agar tidak basah oleh air kolam itu. Melihat kejadian cukup menggelikan itu, dia, sulaiman, berkata, 'sesungguhnya ini bukanlah kolam air yang kau sangka, tapi hanyalah lantai istana yang dilapisi kaca. ' pada akhirnya balqis mengakui semua kehebatan nabi sulaiman, dan apa yang dia lihat adalah betul-betul mencerminkan kekuasaan Allah zat yang patut disembah. Dia balqis berkata, dengan penuh kesadaran dan keyakinan yang mantap 'ya tuhanku, zat yang memiliki dan mengurusiku! sungguh, aku telah berbuat zalim terhadap diriku karena telah menyembah selain Allah yaitu matahari yang tidak mempunyai kekuatan apa pun dan tidak bisa memberi perlindungan kepada penyembahnya jika mereka berada dalam keadaan bahaya. \" sebagai puncak dari pengakuan keislamannya, ratu balqis berkata: aku berserah diri bersama sulaiman kepada Allah, tuhan seluruh alam. ' dialah pemilik, pemelihara, mengurus, alam seluruh. Dialah tuhan yang wajib disembah. 45. Kaum 'amud mendiami satu kawasan antara madinah dan syam. Tepatnya di kota al-hijr atau mada'in, sebelah utara madinah, sekitar 200 km. Setelah diceritakan tentang kisah nabi sulaiman dan ratu balqis, pada ayat berikut ini diceritakan tentang kisah kaum 'amud, dan sungguh, kami telah mengutus kepada kaum 'amud saudara mereka karena berasal dari satu negeri yaitu saleh yang menyeru kepada mereka, 'sembahlah Allah yang mahakuasa, pencipta langit dan bumi, bukan kepada yang lain-Nya, yang tidak mempunyai kemampuan apa-apa. Tetapi tiba-tiba mereka menjadi dua golongan yang bermusuhan. Yaitu golongan yang beriman dan golongan yang kafir kepadanya."
  }
]