[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kami telah mengutus kepada kaum Tsamud saudara mereka, Shaleh (yang berseru), “Esakanlah Allah dan janganlah kalian mengadakan sesembahan lain bersamaNya.” Maka ketika Shaleh mendatangi mereka guna menyerukan (di tengah mereka) kepada bertauhid kepada Allah dan beribadah kepadaNya saja, kaumnya menjadi dua golongan: sebagian beriman kepadanya dan sebagian yang lain mengingkari dakwahnya. Dan masing-masing golongan mengkaliam bahwa kebenaran bersamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan sesungguhnya Kami telah mengutus kepada kaum Ṡamūd saudara mereka yang senasab yaitu Ṣāleḥ -'alaihissalām- yang berseru, \"Sembahlah Allah semata\". Tetapi tiba-tiba setelah didakwahi, mereka pun terbagi menjadi dua golongan; golongan mukmin dan golongan kafir, keduanya saling berselisih siapakah di antara mereka yang berada diatas ke benaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-46. Sungguh Kami telah mengutus kepada kabilah Tsamud saudara mereka, Shalih agar dia menyampaikan kepada mereka: “Sembahlah Allah Semata.” Akan tetapi kaumnya kemudian terpecah menjadi dua golongan; sebagian beriman dan sebagian kafir. Lalu Shalih berkata kepada kaumnya yang kafir: “Hai kaumku, mengapa kalian mengharapkan azab sebelum kalian meminta rahmat? Mengapa kalian tidak meminta ampunan dari Allah, agar kalian dapat meraih rahmat-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَلَقَدْ أَرْسَلْنَآ إِلَىٰ ثَمُودَ أَخَاهُمْ صٰلِحًا أَنِ اعْبُدُوا۟ اللهَ (Dan sesungguhnya Kami telah mengutus kepada (kaum) Tsamud saudara mereka Shaleh (yang berseru): “Sembahlah Allah”) Yakni risalah yang aku bawa berisi “sembahlah Allah.” فَإِذَا هُمْ فَرِيقَانِ(etapi tiba-tiba mereka (jadi) dua golongan) Dua golongan yaitu orang-orang beriman dan orang-orang kafir. Setiap golongan memperjuangkan apa yang mereka yakini dan merasa kebenaran ada dalam golongannya. Pendapat lain mengatakan bahwa pertentangan yang terjadi di antara mereka adalah dalam masalah Nabi Shalih, apakah ia benar-benar seorang Rasul atau tidak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Sesungguhnya Kami telah mengutus kepada kaum Tsamud saudara nasab mereka, bukan secara agama, yaitu Shaleh yang diminta untuk menyeru: \"Sembahlah Allah semata\". Tetapi tiba-tiba mereka menjadi dua golongan yang bermusuhan. Yaitu orang mukmin dan kafir, mereka berdebat tentang kenabian Shaleh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kam telah mengutus kepada kaum Tsamud saudara mereka Shalih,“Sembahlah Allah” Seketika mereka menjadi dua golongan yang bermusuhan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45 Allah menginformasikan bahwasannya Dia telah mengutus kepadamu kaum tsamud, yaitu suatu kabilah yang sangat popular, saudara mereka senasab, yaitu shaleh; dan bahwa shaleh memerintahkan kepada mereka agar beribadah hanya kepada Allah saja dan meninggalkan sembahan-sembahan dan segala bentuk berhala. “tetapi tiba-tiba mereka (menjadi) dua golongan yang bermusuhan,” di antara mereka ada yang beriman dan ada pula yang kafir, dan mereka (yang kafir) adalah yang terbanyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 45: Allah mengabarkan bahwasanya Dia mengutus kepada kabilah tsamud saudara mereka dari nasab yaitu Shalih, yang dia (Shalih) memerintahkan kepada mereka agar beribadah kepada Allah saja, dan tidak menyeru bersamaan dengan-Nya Tuhan yang lain. Maka terbagilah manusia setelah Shalih berdakwah kepada dua kelompok yang saling berselisih : Kelompok yang beriman kepada Allah dan mengesakan-Nya, membenarkan utusan Allah dan kelompok yang mendustakan ayat-ayat Allah dan mengingkari utusan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni senasab. Sebagian beriman, sedangkan sebagian lagi kafir. Yang kafir jumlahnya lebih banyak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 45",
    "description": "Kaum 'amud mendiami satu kawasan antara madinah dan syam. Tepatnya di kota al-hijr atau mada'in, sebelah utara madinah, sekitar 200 km. Setelah diceritakan tentang kisah nabi sulaiman dan ratu balqis, pada ayat berikut ini diceritakan tentang kisah kaum 'amud, dan sungguh, kami telah mengutus kepada kaum 'amud saudara mereka karena berasal dari satu negeri yaitu saleh yang menyeru kepada mereka, 'sembahlah Allah yang mahakuasa, pencipta langit dan bumi, bukan kepada yang lain-Nya, yang tidak mempunyai kemampuan apa-apa. Tetapi tiba-tiba mereka menjadi dua golongan yang bermusuhan. Yaitu golongan yang beriman dan golongan yang kafir kepadanya. 46. Nabi saleh dalam dakwahnya selalu memberi kabar gembira kepada yang beriman dan memberikan peringatan kepada mereka yang ingkar kepadanya dengan azab yang pedih. Kaumnya meminta kepadanya agar azab itu disegerakan. Pada saat itulah, dia, saleh berkata, 'wahai kaumku! mengapa kamu meminta kepadaku disegerakan keburukan yaitu azab Allah bagi yang ingkar kepadanya sebelum kamu meminta kebaikan berupa kebaikan di dunia maupun akhirat karena beriman dan beramal saleh' nabi saleh kemudian menasihati kaumnya dengan mengatakan: mengapa kamu tidak memohon ampunan kepada Allah, atas dosa-dosa yang kamu lakukan, agar kamu mendapat rahmat darinya''."
  }
]