[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Shaleh berkata kepada golongan yang kafir, “Mengapa kalian lebih cepat untuk mengingkari dan melakukan perbuatan-perbuatan buruk yang akan mendatangkan siksaan bagi kalian dan menunda-nunda untuk beriman dan berbuat amal-amal kebaikan yang mendatangkan pahala bagi kalian? Kenapa kalian tidak memohon ampunan saja kepada Allah secara langsung dan bertaubat kepadanya dengan harapan kalian akan dilimpahkan rahmat?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Ṡāleh -'alaihissalām- berkata kepada mereka, \"Mengapa kalian meminta agar disegerakan turunnya azab sebelum kalian memohon rahmat? Alangkah baiknya kalian meminta ampun atas dosa-dosa kalian kepada Allah, agar Dia mencurahkan kalian rahmat-Nya\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. قَالَ يٰقَوْمِ لِمَ تَسْتَعْجِلُونَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ ۖ (Dia berkata: “Hai kaumku mengapa kamu minta disegerakan keburukan sebelum (kamu minta) kebaikan?) Yakni mengapa kalian menunda-nunda untuk beriman padahal itu dapat mendatangkan kalian pahala, dan kalian lebih memilih kekafiran yang mendatankan siksaan bagi kalian? Mereka sangat kafir sampai-sampai mereka berkata “Hai Shalih, datangkanlah kepada kami azab.” لَوْلَا تَسْتَغْفِرُونَ اللهَ(Hendaklah kamu meminta ampun kepada Allah) Yakni tidakkah kalian memohon ampun kepada Allah dan bertaubat kepada-Nya dari kesyirikan kalian. لَعَلَّكُمْ تُرْحَمُونَ(agar kamu mendapat rahmat) Agar kalian dirahmati Allah sehingga tidak mengazab kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Shaleh berkata kepada para pendustanya: \"Hai kaumku mengapa kamu minta disegerakan keburukan sebelum kamu minta) kebaikan? Hendaklah kamu meminta ampun kepada Allah, agar kamu mendapat rahmat dan tidak justru mendapat azab\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Shalih berkata {“Wahai kaumku, mengapa kalian meminta disegerakan keburukan sebelum kebaikan} azab sebelum rahmat {Mengapa tidak} mengapa tidak {memohon ampunan kepada Allah agar kalian dirahmati”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46 “dia berkata, ’hai kaumku mengapa kamu minta disegerakan keburukan sebelum kebaikan?” maksudnya, kenapa kalian bersegera melakukan dosa-dosa dan bersemangat untuknya sebelum kalian melakukan kebaikan-kebaikan yang dengannya keadaan kalian menjadi baik dan permasalahan agama dan dunia kalian menjadi baik pula. Padahal sebenarnya tidak ada yang mengharuskan kalian pergi untuk melakukan dosa-dosa. “hendaklah kamu meminta ampun kepada Allah,” yaitu kalian bertaubat dari kesyirikan dan kedurhakaan kalian, dan kalian berdoa agar Dia mengampuni kalian, “agar kamu mendapat rahmat,” karena sesungguhnya rahmat Allah sangat dekat kepada orang-orang yang berbuat kebajikan; dan orang yang bertaubat dari dosa termasuk orang-orang yang berbuat kebajikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 46: Berkata Shalih kepada mereka yang mendustakan dan mengingkari : Tidaklah kekafiranmu memberikan dampak kepada keimanan, dan adzab Allah akan disegerakan. Mereka berkata : Datangkan kepada kami adzab Allah jika engkau termasuk orang-orang yang benar (Al Ankabut : 29)? Kalian meninggalkan keimanan kalian kepada Allah padahal dia adalah sebab keselamatan dan kebaikan bagi kalian, segeralah kalian memohon ampun kepada Allah dan beriman kepada-Nya serta mengikuti apa yang kalian diseru kepadanya, semoga Allah merahmati kalian dan mengampuni kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang-orang yang kafir. Mereka berkata, “Jika apa yang dibawanya kepada kami adalah benar, maka datangkanlah azab.” Menurut Syaikh As Sa’diy, maksud kata-kata Saleh adalah, “Mengapa kamu segera melakukan kekafiran dan mengerjakan keburukan yang dapat mendatangkan azab kepadamu sebelum mengerjakan kebaikan, sehingga keadaan kamu menjadi baik, agama maupun duniamu? Dan lagi tidak ada desakan bagimu untuk melakukan kemaksiatan. Mengapa kamu tidak meminta ampunan Allah lebih dulu dan bertobat kepada-Nya dengan berharap rahmat-Nya. Dari perbuatan syirk. Karena rahmat Allah dekat dengan orang-orang yang berbuat kebaikan (muhsinin), sedangkan orang yang bertobat dari dosa termasuk orang-orang yang muhsin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 46",
    "description": "Nabi saleh dalam dakwahnya selalu memberi kabar gembira kepada yang beriman dan memberikan peringatan kepada mereka yang ingkar kepadanya dengan azab yang pedih. Kaumnya meminta kepadanya agar azab itu disegerakan. Pada saat itulah, dia, saleh berkata, 'wahai kaumku! mengapa kamu meminta kepadaku disegerakan keburukan yaitu azab Allah bagi yang ingkar kepadanya sebelum kamu meminta kebaikan berupa kebaikan di dunia maupun akhirat karena beriman dan beramal saleh' nabi saleh kemudian menasihati kaumnya dengan mengatakan: mengapa kamu tidak memohon ampunan kepada Allah, atas dosa-dosa yang kamu lakukan, agar kamu mendapat rahmat darinya''47. Mendengar nasihat nabi saleh tersebut, mereka menjawab, 'kami mendapat nasib yang malang seperti perpecahan di antara kami, kepahitan hidup, gagal panen, dan lain sebagainya, disebabkan oleh kamu dan orang-orang yang bersamamu. Sebelum kamu datang menyeru kepada kami, kami tidak menemukan nasib seperti ini. \"dia, saleh, berkata, 'nasibmu, baik itu nasib baik atau buruk adalah ada pada Allah sesuai dengan ketetapan-Nya, bukan kami yang menjadi sebab, tetapi kamu adalah kaum yang sedang diuji. ' apakah setelah kedatangan nabi saleh, kamu beriman kepadanya atau tidak, jika beriman, kamu akan mendapat pahala dan jika kafir kamu akan mendapatkan siksaan."
  }
]