[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Shaleh berkata berkata kepadanya, “Kami mendapat kesialan dengan keberadaanmu dan orang yang bersamamu yang telah memeluk ajaran agamamu.” Shaleh berkata kepada mereka, “Apa yang kalian alami dari Allah berupa kebaikan atau keburukan, maka Dia-lah yang telah menakdirkannya pada kalian dan akan memberikan balasan dengan itu. Bahkan kalian adalah kaum yang diuji dengan kesenangan, kesusahan, kebaikan dan keburukan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Kaumnya menjawab sembari tetap ngotot menentang kebenaran, \"Kami mendapat nasib yang malang disebabkan dirimu dan orang-orang mukmin yang besertamu\". Ṣāleḥ berkata -'alaihissalām- kepada mereka, \"Perbuatan kalian dalam menggunakan burung ketika kalian ditimpa kesusahan, semuanya ada dalam pengetahuan Allah, tidak ada yang luput dari-Nya sedikitpun, akan tetapi kalian adalah kaum yang diuji dengan berbagai kelapangan perkara baik dan hal yang buruk\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Kaumnya berkata dengan bodoh: “Kami mendapat kesialan akibat dirimu dan orang-orang yang bersamamu.” Maka Nabi Shalih menjawab: “Kebaikan maupun keburukan yang menimpa kalian adalah ketetapan dari Allah, hanya saja kalian sedang mendapat ujian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. قَالُوا۟ اطَّيَّرْنَا بِكَ وَبِمَن مَّعَكَ ۚ (Mereka menjawab: “Kami mendapat nasib yang malang, disebabkan kamu dan orang-orang yang besertamu”) Asal kata (اطيرنا) adalah (تطيرنا), yakni kami bernasib buruk karena dirimu dan orang-orang yang menikutimu dan masuk agamamu. Terdapat pendapat mengatakan mereka ditimpa kekeringan sehingga mereka merasa sial akibat Shalih. قَالَ(Shaleh berkata) Shalih berkata kepada mereka. طٰٓئِرُكُمْ عِندَ اللهِ ۖ (Nasibmu ada pada sisi Allah) Yakni burung itu (yang menandakan nasib sial menurut keyakinan mereka) bukanlah penyebabnya, namun itu semua berada di sisi Allah, sebab segala kejadian berada di tangan Allah, Dia berbuat apa yang Dia kehendaki, dan burung tersebut tidak mengetahui apapun tentang hal itu. بَلْ أَنتُمْ قَوْمٌ تُفْتَنُونَ (tetapi kamu kaum yang diuji) Yakni kaum yang sedang diberi cobaan. Pendapat lain mengatakan maknanya adalah kalian sedang disesatkan oleh setan dengan keyakinan kalian tentang burung yang menandakan nasib sial."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kebiasaan merasa sial pada hari tertentu bukan menjadi kebiasan khusus bagi orang-orang jahiliyah dimana mereka meyakini bulan shafar adalah waktu sial mereka, melainkan hal tersebut menjadi keyakinan yang turun temurun terus dlakukan oleh para musuh-musuh Rasul. Coba perhatikan bagaimana al-Qur'an mencatatkan perilaku buruk pada kaum Shalih { قَالُوا اطَّيَّرْنَا بِكَ وَبِمَنْ مَعَكَ ۚ قَالَ طَائِرُكُمْ عِنْدَ اللَّهِ ۖ بَلْ أَنْتُمْ قَوْمٌ تُفْتَنُونَ }, dan kaum Musa { فَإِذَا جَآءَتْهُمُ ٱلْحَسَنَةُ قَالُوا۟ لَنَا هَٰذِهِۦ ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ يَطَّيَّرُوا۟ بِمُوسَىٰ وَمَن مَّعَهُۥٓ ۗ أَلَآ إِنَّمَا طَٰٓئِرُهُمْ عِندَ ٱللَّهِ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ } \"Kemudian apabila datang kepada mereka kemakmuran, mereka berkata: “Itu adalah karena (usaha) kami”. Dan jika mereka ditimpa kesusahan, mereka lemparkan sebab kesialan itu kepada Musa dan orang-orang yang besertanya. Ketahuilah, sesungguhnya kesialan mereka itu adalah ketetapan dari Allah, akan tetapi kebanyakan mereka tidak mengetahui.\" [ Q.S Al-A'raf : 131 ], dan ashabul qoryah { قَالُوا۟ طَٰٓئِرُكُم مَّعَكُمْ ۚ أَئِن ذُكِّرْتُم ۚ بَلْ أَنتُمْ قَوْمٌ مُّسْرِفُونَ } \"Utusan-utusan itu berkata: “Kemalangan kamu adalah karena kamu sendiri. Apakah jika kamu diberi peringatan (kamu bernasib malang)? Sebenarnya kamu adalah kaum yang melampui batas.\" [ Q.S Yasiin : 19 ], dan pada kaum Quraisy saat bersama denga Nabi Muhammad : { أَيْنَمَا تَكُونُوا۟ يُدْرِككُّمُ ٱلْمَوْتُ وَلَوْ كُنتُمْ فِى بُرُوجٍ مُّشَيَّدَةٍ ۗ وَإِن تُصِبْهُمْ حَسَنَةٌ يَقُولُوا۟ هَٰذِهِۦ مِنْ عِندِ ٱللَّهِ ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ يَقُولُوا۟ هَٰذِهِۦ مِنْ عِندِكَ ۚ قُلْ كُلٌّ مِّنْ عِندِ ٱللَّهِ ۖ فَمَالِ هَٰٓؤُلَآءِ ٱلْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا } \"Di mana saja kamu berada, kematian akan mendapatkan kamu, kendatipun kamu di dalam benteng yang tinggi lagi kokoh, dan jika mereka memperoleh kebaikan, mereka mengatakan: “Ini adalah dari sisi Allah”, dan kalau mereka ditimpa sesuatu bencana mereka mengatakan: “Ini (datangnya) dari sisi kamu (Muhammad)”. Katakanlah: “Semuanya (datang) dari sisi Allah”. Maka mengapa orang-orang itu (orang munafik) hampir-hampir tidak memahami pembicaraan sedikitpun?\". [ Q.S An-Nisa : 79 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Mereka menjawab: \"Kami mendapat nasib yang malang, disebabkan kamu dan orang-orang yang mengikutimu\". Shaleh berkata: \"Nasibmu ada pada kuasa Allah, bukan kami yang menjadi sebab, kebaikan dan keburukan ada di tangan Allah. Bukan pada burung yang menyebabkan kalian pesimis. Tetapi kalian kaum yang diuji dengan kebaikan dan keburukan.\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Kami bernasib malang} Kami menjadi sial {karena kamu dan orang-orang yang bersamamu” Dia berkata,“Nasibmu di sisi Allah} nasib sial yang menimpa kalian dari sisi Allah, karena kekufuran kalian {Kalian adalah kaum yang sedang diuji”} yang diuji dengan kebaikan dan keburukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47 “mereka berkata,” kepada nabi mereka, shaleh, seraya mendustakan dan menentang, “kami mendapat nasib yang malang, disebabkan kamu dan orang-orang yang besertamu’,” mereka beranggapan -semoga Allah memperburuk mereka- bahwa mereka sama sekali tidak melihat suatu kebaikan di wajah shaleh, dan bahwa dia dan orang-orang yang beriman bersamanya telah menjadi penyebab yang telah menghalangi sebagian tuntutan kehidupan dunia mereka! Maka shaleh berkata kepada mereka, ”nasibmu ada pada sisi Allah,” maksudnya, tidaklah yang menimpa kalian itu melainkan karena dosa-dosa kalian, “tetapi kamu kaum yang diuji,” dengan kesenangan dan kesusahan, kebaikan dan keburukan, untuk diketahui apakah kalian mau berhenti (melakukan dosa) dan bertaubat, atau tidak. Itulah tabi’at mereka dalam mendustakan nabi mereka sendiri dan itulah respons mereka kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 47: Dijawablah oleh kaum Shalih dengan sombong : Sungguh engkau terlihat pesimis wahai Shalih, lalu bagaimana kami dapat mengikutimu, sungguh telah menimpa kami (musibah) karena sebab dirimu. Maka Shalih menjawab dengan berkata : Tidaklah apa yang menimpa kalian kecuali karena sebab kesyirikan kalian dan dosa kalian, ketahuilah wahai kaum bahwa sesungguhnya kalian sedang diuji suka cita dan duka, kebaikan dan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena celakanya mereka, bahwa mereka tidaklah tertimpa azab atau musibah kecuali menyalahkan Saleh dan para pengikutnya. Seperti inilah kebiasaan mereka dalam mendustakan nabi mereka. Dengan kesenangan dan musibah, dengan kebaikan dan keburukan agar Dia melihat, apakah kita berhenti dan bertobat atau tidak?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 47",
    "description": "Mendengar nasihat nabi saleh tersebut, mereka menjawab, 'kami mendapat nasib yang malang seperti perpecahan di antara kami, kepahitan hidup, gagal panen, dan lain sebagainya, disebabkan oleh kamu dan orang-orang yang bersamamu. Sebelum kamu datang menyeru kepada kami, kami tidak menemukan nasib seperti ini. \"dia, saleh, berkata, 'nasibmu, baik itu nasib baik atau buruk adalah ada pada Allah sesuai dengan ketetapan-Nya, bukan kami yang menjadi sebab, tetapi kamu adalah kaum yang sedang diuji. ' apakah setelah kedatangan nabi saleh, kamu beriman kepadanya atau tidak, jika beriman, kamu akan mendapat pahala dan jika kafir kamu akan mendapatkan siksaan. 48. Pada ayat-ayat berikut ini diceritakan tentang negeri kaum 'amud yang senantiasa bermaksiat. Negeri tersebut ialah al-hijr, yang terletak di selatan madinah. Dan di kota itu ada sembilan orang laki-laki yang dari waktu ke waktu selalu berbuat kerusakan di bumi, yaitu segala macam kemaksiatan. Mereka tidak melakukan perbaikan terhadap diri mereka sendiri dengan beriman dan bertakwa."
  }
]