[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebelumnya di kota Shaleh – yaitu al-Hijr yang terletak barat laut dari jazirah Arab- terdapat Sembilan orang laki-laki. Karakter mereka adalah melakukan perusakan di muka bumi tanpa diselingi sedikit pun unsur perbaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan dahulu di kota Hijr itu ada sembilan orang laki-laki yang membuat kerusakan di muka bumi dengan melakukan kekufuran dan maksiat, dan mereka tidak berbuat kebaikan di dalamnya dengan iman dan amal saleh."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48-50. Dan di negeri Nabi Shaleh yaitu Negeri Hijr kaum Tsamud terdapat sembilan orang jahat yang hendak berbuat kerusakan di muka bumi, tidak mempedulikan perbaikan sedikitpun, dan saling bersepakat untuk bersumpah atas nama Allah: “Kita akan mendatangi nabi Shalih dan keluarganya yang beriman secara tiba-tiba pada malam hari untuk membunuh mereka semua. Kemudian jika kerabat mereka menuntut kita maka kita akan mengatakan kepadanya, ‘Kami tidak ada di tempat pembunuhan dan kami tidak mengetahui siapa apa yang membunuh. Sungguh kami berkata jujur atas apa yang kami katakan’.” Demikianlah mereka menyusun tipu daya, sehingga Allah membalas mereka dengan kehancuran namun mereka tidak menyadarinya. Allah menjadikan kehancuran mereka terdapat dalam tipu daya yang mereka lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَكَانَ فِى الْمَدِينَةِ (Dan adalah di kota itu) Yakni kota yang ditinggali oleh Nabi Shalih, yaitu kota Hijr. تِسْعَةُ رَهْطٍ(sembilan orang laki-laki) Yakni sembilan lelaki dari keturunan orang-orang terpandang. Sembilan orang ini adalah orang-orang yang bertanggungjawab atas penyembelihan unta betina yang merupakan mukjizat Nabi Shalih. يُفْسِدُونَ فِى الْأَرْضِ وَلَا يُصْلِحُونَ (yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan) Yakni kebiasaan mereka adalah merusak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَكَانَ فِي الْمَدِينَةِ تِسْعَةُ رَهْطٍ يُفْسِدُونَ فِي الْأَرْضِ وَلَا يُصْلِحُونَ } \"Dan adalah di kota itu sembilan orang laki-laki yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan.\" Walaupun jumlah mereka yang sedikit dibandigkan jumlah keseluruhan penduduk kota tersebut, namun kerusakan yang mereka perbuat menimbulkan kehancuran yang memporak porandakan kota dan penduduknya. Dan pemuda-pemuda itu tidak menginginkan kebaikan untuk mereka; karena ini adalah klaim mereka yang dengannya mereka menipu para provokator, dan seperti itulah kebiasaan perusak disetiap masa dan tempat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Di kota Shaleh yaitu al hijr ada sembilan orang laki-laki dari anak para petinggi yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan. Mereka telah sepakat untuk membunuh Shaleh dan menyembelih unta-unta."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di kota itu} di kota batu itu {ada sembilan orang laki-laki} laki-laki dari anak para pemuka mereka {yang berbuat kerusakan di bumi dan tidak melakukan perbaikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48 “dan pada saat itu di kota itu,” maksudnya, di kota dimana shaleh berada, yaitu kota tempat mayoritas kaumnya, “ada Sembilan orang laki-laki yang membuat kerusakan di muka bumi, dan mereka tidak berbuat kebaikan,” maksudnya, tabi’at mereka adalah melakukan pengrusakan di bumi. Mereka tidak mempunyai tujuan dan perbuatan untuk perbaikan. Mereka bersiap-siap untuk menentang shaleh, melecehkan agamanya, dan mengajak kaumnya untuk melakukan hal demikian, sebagaimana dinyatakan oleh Allah, “maka bertakwalah kepada Allah dan taatlah kepadaku; dan janganlah kamu menaati perintah orang-orang yang melewati batas, yang membuat kerusakan di muka bumi dan tidak mengadakan perbaikan,” (as-syuara:150-152)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 48: Allah mengabarkan bahwa Shalih bertempat di kota hijr yaitu sebuah kota yang terdapat Sembilan laki-laki yang merusak bumi dan sabotase, dan tidak ada sedikitpun di antara mereka yang menginginkan kebaikan selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut ahli tafsir yang dimaksud dengan kota ini ialah kota kaum Tsamud Yaitu kota Al Hijr. Dengan perbuatan maksiat. Sifat mereka mengadakan kerusakan di bumi, dan tidak ada maksud untuk mengadakan perbaikan. Mereka telah siap memusuhi Saleh dan mencela agamanya serta mengajak kaumnya agar bersikap sama seperti mereka. Dengan melakukan ketaatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 48",
    "description": "Pada ayat-ayat berikut ini diceritakan tentang negeri kaum 'amud yang senantiasa bermaksiat. Negeri tersebut ialah al-hijr, yang terletak di selatan madinah. Dan di kota itu ada sembilan orang laki-laki yang dari waktu ke waktu selalu berbuat kerusakan di bumi, yaitu segala macam kemaksiatan. Mereka tidak melakukan perbaikan terhadap diri mereka sendiri dengan beriman dan bertakwa. 49. Mereka, sembilan orang tersebut, berkata kepada teman-temannya tentang niat jahat mereka, 'bersumpahlah kamu dengan nama Allah, bahwa kita pasti akan menyerang dia yaitu nabi saleh bersama keluarganya secara tiba-tiba pada malam hari, dan membunuhi mereka, kemudian untuk menutupi kasus ini, kita akan mengatakan kepada ahli warisnya bahwa kita tidak menyaksikan kebinasaan keluarganya itu, apalagi menyaksikan terbunuhnya saleh. Dan sungguh, kita orang yang benar. ' demikianlah perilaku orang jahat. Mereka melakukan tipu daya dalam melaksanakan kejahatan, kemudian mereka lepas tangan terhadap apa yang telah mereka lakukan secara licik, agar terkesan mereka adalah orang baik-baik."
  }
]