[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sembilan orang itu, sebagian dari mereka berkata kepada sebagian yang lain, “Mari kita saling bersumpah dengan Nama Allah, dengan cara tiap-tiap orang bersumpah di hadapan kawan-kawannya, ‘Kami benar-benar akan mendatangi Shaleh di malam hari, lalu kami akan membunuhnya dan menghabisi keluarganya’, kemudian kita akan berkata kepada ahli waris korban dari kerabatnya, ‘Kami tidak ikut serta dalam pembunuhan mereka, dan kami jujur dalam ucapan yang kami sampaikan’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Mereka saling berkata, \"Bersumpahlah setiap dari kalian kepada Allah, bahwa kita sungguh-sungguh akan mendatanginya dengan tiba-tiba di malam hari, lalu kita membunuh mereka, kemudian kita katakan kepada ahli warisnya bahwa kita tidak menyaksikan kematian Ṣāleḥ dan keluarganya, dan sesungguhnya kita adalah orang-orang yang benar dalam berkata-kata\"."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قَالُوا۟ تَقَاسَمُوا۟ بِاللهِ (Mereka berkata: “Bersumpahlah kamu dengan nama Allah) Sebagian mereka berkata kepada sebagian lainnya: “marilah kita semua saling bersumpah.” لَنُبَيِّتَنَّهُۥ وَأَهْلَهُۥ(bahwa kita sungguh-sungguh akan menyerangnya dengan tiba-tiba beserta keluarganya di malam hari) Ini merupakan isi sumpah mereka, yakni sungguh kita akan mendatangi Shalih di malam hari dengan tiba-tiba pada kegelapan malam, kemudian membunuh dia dan keluarganya. ثُمَّ لَنَقُولَنَّ لِوَلِيِّهِۦ (kemudian kita katakan kepada warisnya) Yakni kepada kerabatnya yang menuntut balas. مَا شَهِدْنَا مَهْلِكَ أَهْلِهِۦ (kita tidak menyaksikan kematian keluarganya itu) Mereka saling bersumpah akan membunuh Nabi Shalih dan keluarganya kemudian mengingkari perbuatan mereka di hadapan para walinya dengan mengatakan “bahkan kami tidak melihat kematiannya” untuk mengecoh para walinya bahwa mereka tidak membunuhnya dan tidak pula menghadiri kematiannya. وَإِنَّا لَصٰدِقُونَ(dan sesungguhnya kita adalah orang-orang yang benar) Yakni jujur dalam perkataan kami “kami tidak menyaksikan kematiannya.” Sebab jika mereka membunuhnya di kegelapan malam tentu mereka tidak dapat menyaksikan kematiannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Mereka berkata kepada sesama mereka: \"Bersumpahlah kamu dengan nama Allah, bahwa kita sungguh-sungguh akan menyerangnya dengan tiba-tiba beserta keluarganya pada malam hari, kemudian kita katakan kepada warisnya bahwa kita tidak menyaksikan kematian keluarganya itu. Kita juga tidak tahu siapa yang telah membunuhnya. Sesungguhnya kita adalah orang-orang yang benar\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Bersumpahlah dengan (nama) Allah} mereka berkata satu sama lain,”bersumpahlah dengan nama Allah {kita pasti akan menyerangnya pada malam hari} Kita akan membunuhnya pada malam hari {bersama keluarganya. Kemudian kita akan mengatakan kepada walinya} wali yang berhubungan darah dengannya {kita tidak menyaksikan} Kita tidak mengetahui {kebinasaan} kematian {keluarganya. Sesungguhnya kita adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49 mereka terus dalam kondisi keji tersebut, sehingga karena permusuhan itu “mereka saling bersumpah” di antara mereka; setiap orang bersumpah pada yang lain, “kita sungguh-sungguh akan menyerangnya dengan tiba-tiba beserta keluarganya di malam hari.” Maksudnya, sungguh kami akan membunuh mereka,’ kemudian kami katakan kepada ahli warisnya,” apabila dia menuntut kami dan menuduh kami bahwa kamilah yang telah membunuh mereka. Kita mengingkari hal itu, menafikannya dan kita bersumpah bahwa,”sesungguhnya kami benar-benar jujur,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 49: Allah mengabarkan bahwa sembilan laki-laki itu saling bersepakat di antara mereka, masing-masing bersumpah untuk datang kepada Shalih pada waktu malam dan membunuhnya dan juga keluarganya, kemudian mereka berkata kepada ahli waris Shalih : Demi Allah kami tidaklah menjadi saksi atas pembunuhan mereka (Shalih dan keluarganya), tidak juga hadir di sana. Mereka bersumpah agar dianggap sebagai orang-orang yang jujur atas ucapan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Antara sesama mereka. Sehingga kita tidak mengetahui siapa yang membunuh mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 49",
    "description": "Mereka, sembilan orang tersebut, berkata kepada teman-temannya tentang niat jahat mereka, 'bersumpahlah kamu dengan nama Allah, bahwa kita pasti akan menyerang dia yaitu nabi saleh bersama keluarganya secara tiba-tiba pada malam hari, dan membunuhi mereka, kemudian untuk menutupi kasus ini, kita akan mengatakan kepada ahli warisnya bahwa kita tidak menyaksikan kebinasaan keluarganya itu, apalagi menyaksikan terbunuhnya saleh. Dan sungguh, kita orang yang benar. ' demikianlah perilaku orang jahat. Mereka melakukan tipu daya dalam melaksanakan kejahatan, kemudian mereka lepas tangan terhadap apa yang telah mereka lakukan secara licik, agar terkesan mereka adalah orang baik-baik. 50. Allah menceritakan tentang perilaku jahat mereka. Dan mereka membuat tipu daya terhadap nabi saleh dan keluarganya dan kami pun menyusun tipu daya dengan menghancurkan mereka, sebagai balasan atas tipu daya mereka sedang mereka tidak menyadari atas balasan atas tipu daya mereka itu."
  }
]