[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-5. Sesungguhnya orang-orang yang tidak beriman kepada negeri akhirat dan tidak berbuat baik untuknya, Kami perlihatkan kepada mereka perbuatan-perbuatan buruk mereka seakan-akan terlihat baik, sehingga mereka melihatnya tampak baik, sedang mereka itu dilanda keragu-raguan dan kebingungan tentang itu. Mereka itu adalah orang-orang yang akan mendapat siksaan yang buruk di dunia berupa dibunuh, ditawan, kehinaan dan kekalahan. Dan mereka di akhirat kelak adalah manusia yang paling merugi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Orang-orang memiliki karakter yang disebutkan di atas, mereka itulah orang-orang yang mendapat azab buruk di dunia yaitu dibunuh atau ditawan, dan di Akhirat kelak mereka adalah orang-orang yang paling merugi di mana pada hari Kiamat kelak mereka merugikan diri mereka sendiri, dan juga keluarga mereka dengan dikekalkan dalam Neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. أُو۟لٰٓئِكَ الَّذِينَ لَهُمْ سُوٓءُ الْعَذَابِ (Mereka itulah orang-orang yang mendapat azab yang buruk) Yakni azab di dunia seperti terbunuh atau tertawan. وَهُمْ فِى الْاٰخِرَةِ هُمُ الْأَخْسَرُونَ(dan mereka di akhirat adalah orang-orang yang paling merugi) Yakni orang yang paling merugi dan kecewa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Mereka yang mengingkari hari kebangkitan itulah orang-orang yang mendapat azab di dunia berupa peperangan/terbunuh dan penawanan. Adapun keadaan mereka di akhirat adalah orang-orang yang paling merugi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka ragu-ragu dengan keadaan bingung di dalamnya {Mereka itulah orang-orang yang mendapat siksaan buruk dan di akhirat mereka adalah orang-orang yang paling rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5 “mereka itulah orang-orang yang mendapat azab yang buruk,” maksudnya, azab yang paling dahsyat, paling buruk dan paling besar. “dan mereka,” di akhirat, “adalah orang-orang yang paling merugi,” kerugian dipusatkan kepada mereka disebabkan mereka telah merugikan diri mereka sendiri dan keluarganya di Hari kiamat kelak. Dan mereka telah merugi terhadap iman yang telah diserukan oleh para rasul kepada mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 5: Allah menjelaskan bahwa mereka tidak beriman dengan akhirat, Allah telah persiapkan bagi mereka sekeras-kerasnya adzab, mereka di neraka adalah orang yang paling merugi. Dan tidak diragukan lagi bahwa amalan-amalan mereka yang kafir (dan) nampak indah akan memiliki balasan dengan tanpa permulaan (langsung diadzab)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti terbunuh, tertawan, dll. Karena kembalinya ke neraka dan kekal di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 5",
    "description": "Mereka menganggap bahwa apa yang mereka lakukan tidak akan ada pertanggung jawabannya di akhirat kelak. Sebagai balasan atas mereka, mereka itulah orang-orang yang akan mendapat siksaan buruk di dunia dan mereka di akhirat adalah orang-orang yang paling rugi dan paling menyesali atas perbuatannya di dunia. 6. Setelah menjelaskan kedudukan dan fungsi Al-Qur'an, ayat ini menjelaskan tentang pembawa Al-Qur'an yaitu nabi Muhammad. Dan sesungguhnya engkau wahai rasul benar-benar telah diberi Al-Qur'an dari sisi Allah yang mahabijaksana, maha mengetahui atas segala sesuatu."
  }
]