[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka pun mengatur strategi untuk membinasakan Shaleh dan keluarganya sebagai tindakan makar dari mereka, lalu Kami menolong Nabi kami, Shaleh, dan Kami siksa mereka dengan siksaan tanpa disangka-sangka, sedang mereka tidak pernah berasumsi akan datangnya tipu daya dari Kami sebagai balasan atas makar mereka itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan merekapun merencanakan makar tersembunyi untuk membinasakan Ṣāleḥ dan pengikutnya dari kalangan orang-orang mukmin, dan Kamipun merencanakan makar pula untuk menolong dan menyelamatkannya dari makar mereka serta untuk membinasakan orang-orang kafir dari kaumnya, sedang mereka tidak menyadari hal itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. وَمَكَرُوا۟ مَكْرًا (Dan merekapun merencanakan makar dengan sungguh-sungguh) Yakni membuat makar dengan cara tersebut. وَمَكَرْنَا مَكْرًا(dan Kami merencanakan makar (pula)) Yakni Kami akan membalas perbuatan mereka, yaitu dengan membinasakan mereka. وَهُمْ لَا يَشْعُرُونَ(sedang mereka tidak menyadari) Yakni tidak menyadari makar dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Merekapun merencanakan makar dengan sungguh-sungguh dan Kami merencanakan makar pula berupa pembalasan dan penyegeraan pembinasaan mereka, namun mereka tidak menyadari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka membuat tipu daya dan Kami pun menyusun tipu daya, dan mereka tidak sadar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50 merekapun sepakat untuk melakukan hal itu, “dan mereka pun merencanakan makar dengan sungguh-sungguh,” mereka sudah mengatur siasat untuk membunuh shaleh dan keluarganya secara sembunyi-sembunyi sampai dari kaum mereka sendiri Karena takut kepada ahli warisnya, “dan kami merencanakan makar (pula).” Untuk memberikan pertolongan kepada shaleh dan mempermudah urusannya serta membinasakan kaumnya yang mendustakan, “sedang mereka tidak menyadari,”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 50: Mereka membuat makar untuk membunuh Shalih dengan jalan ini, mereka merencanakan rencana tersembunyi, akan tetapi Allah membimbing Shalih dan pengikutnya serta memberikan jalan tersembunyi untuk selamat dari mereka. Allah adzab mereka orang-orang pendosa dengan adzab yang pedih akan tetapi mereka tidak merasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan memberikan pertolongan kepada Saleh ‘alaihis salam, memudahkan urusannya dan membinasakan kaumnya yang mendustakan. Mereka belum sempat melakukan rencana itu karena telah lebih dulu dibinasakan Allah, demikian pula kaum mereka. Muhammad bin Ishaq berkata, “Sembilan orang itu berkata setelah membunuh unta itu, “Marilah kita bunuh Saleh. Jika ia memang benar, maka dia akan mendahului kita sebelum kita (membunuhnya), dan jika ia berdusta, maka kita telah membunuh untanya.” Mereka pun mendatangi Saleh di malam hari untuk melakukan rencana itu di tengah keluarganya, maka para malaikat melukai kepala mereka dengan batu. Ketika mereka dirasakan oleh kawan-kawannya terlambat datang, maka mereka menyusul dengan mendatangi rumah Saleh dan mereka mendapati kawan-kawan mereka telah pecah kepalanya oleh batu, lalu mereka berkata kepada Saleh, “Engkaukah yang telah membunuh mereka?” Mereka pun hendak membunuh Saleh, lalu keluarga Saleh bangkit menghalanginya dalam keadaan memakai senjata sambil berkata, “Demi Allah, kamu tidak bisa membunuhnya selamanya, dan dia telah mengancammu, bahwa azab akan turun menimpamu dalam tempo tiga hari. Jika ia benar, maka janganlah menambah kemurkaan Tuhanmu kepadamu, dan jika ia berdusta, maka kamu sedang berada di belakang yang kamu inginkan, maka mereka pun pulang pada malam itu.” Ibnu Abi Hatim berkata, “Setelah mereka membunuh unta itu, Saleh berkata kepada mereka, “Bersenang-senanglah kamu selama tiga hari. Itu adalah janji yang tidak didustakan.” Mereka pun berkata, “Saleh mengira bahwa ia akan menyelesaikan urusannya dengan kita (yakni membinasakan) dalam tempo tiga hari, padahal kita akan akan menyelesaikan urusannya (yakni membinasakannya) sebelum tiga hari. Ketika itu, Saleh memiliki masjid di Hijr di daerah bukit yang ia biasa shalat di sana. Mereka pun keluar menuju gua yang ada di sana pada malam hari dan berkata, “Jika Saleh datang untuk shalat, maka kita bunuh dia. Setelah kita membunuhnya, maka kita pulang ke keluarganya dan menyelesaikan pula urusan kita dengan mereka (yakni membunuh juga), maka Allah mengirimkan kepada mereka batu besar yang hendak menjatuhi mereka, mereka pun takut jika batu itu menimpa mereka, maka segeralah mereka (masuk ke gua) lalu batu besar itu menutupi mereka, sedangkan mereka dalam gua tersebut, sehingga kaum mereka tidak mengetahui keberadaan mereka dan mereka juga tidak mengetahui hal yang menimpa kaum mereka, maka Allah mengazab mereka di tempat itu dan kaum mereka di tempat mereka dan Allah menyelamatkan Saleh serta orang-orang yang bersamanya…dst. (Lihat Tafsir Ibnu Katsir)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 50",
    "description": "Allah menceritakan tentang perilaku jahat mereka. Dan mereka membuat tipu daya terhadap nabi saleh dan keluarganya dan kami pun menyusun tipu daya dengan menghancurkan mereka, sebagai balasan atas tipu daya mereka sedang mereka tidak menyadari atas balasan atas tipu daya mereka itu. 51. Maka perhatikanlah bagaimana akibat dari tipu daya mereka, bahwa kami, sesuai dengan kehendak kami dan cara kami, telah memutuskan untuk membinasakan mereka dan kaum mereka semuanya, karena dosa-dosa mereka."
  }
]