[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itu adalah tempat-tempat tinggal mereka yang kosong, tidak ada seorang pun dari mereka di sana. Allah membinasakan mereka disebabkan tindak kezhaliman mereka terhadap diri mereka sendiri dengan perbuatan syirik dan mendustakan nabi mereka. Sesungguhnya dalam peristiwa pengahancuran dan pembinasaan itu benar-benar terdapat pelajaran bagi orang-orang yang mengetahui apa yang telah Kami perbuat terhadap mereka itu. Dan itu adalah ketetapan Kami terhadap orang-orang yang mendustakan rasul-rasul."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Maka itulah rumah-rumah mereka yang dinding-dindingnya telah runtuh dari atap-atapnya dan telah ditinggalkan penghuninya disebabkan kezaliman mereka. Sesungguhnya dalam azab yang ditimpakan kepada mereka akibat kezaliman mereka tersebut terdapat pelajaran bagi kaum yang beriman, sebab merekalah yang bisa mengambil pelajaran dari ayat-ayat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. فَتِلْكَ بُيُوتُهُمْ خَاوِيَةًۢ (Maka itulah rumah-rumah mereka dalam keadaan runtuh) Yakni kosong dari pemiliknya, runtuh tak berpenghuni. بِمَا ظَلَمُوٓا۟ ۗ( disebabkan kezaliman mereka) Yakni akibat kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Maka seperti itulah, rumah-rumah mereka runtuh disebabkan kezaliman mereka sendiri. Sesungguhnya pada yang demikian itu terdapat pelajaran bagi kaum yang mau berkoreksi diri, berfikir dan yang mengetahui kekuasaan Kami sehingga mereka mendapat pelajaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah rumah-rumah mereka yang kosong} kosong {akibat kezaliman mereka. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda} pelajaran {bagi kaum yang mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52 “maka itulah rumah-rumah mereka dalam keadaan runtuh,” dinding-dindingnya telah roboh menutupi atapnya, sepi dari penghuninya dan kosong dari orang-orang yang mengunjunginya, “disebabkan kezhaliman mereka,” maksudnya, itu adalah akibat kezhaliman dan kesyirikan mereka terhadap Allah serta kecongkakan mereka di muka bumi. “sesungguhnya pada yang demikian itu (terdapat) pelajaran bagi kaum yang mengetahui,” kenyataan-kenyataan, dan mereka merenungkan balasan Allah terhadap para waliNya dan musuh-musuhNya sehingga mereka dapat mengambil pelajaran darinya; serta mereka mengetahui bahwa kesudahan perbuatan zhalim adalah kebinasaan dan kehancuran; sedangkan kesudahan keimanan dan keadilan adalah keselamatan dan kemenangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 52: Lihatlah wahai Nabi Allah kepada rumah-rumah orang-orang jahat tersebut yang padanya ada salah satu di antara mereka tinggal, telah Kami hancurkan seluruhnya karena sebab kedzaliman mereka terhadap diri-diri mereka dengan kesyirikan, dan karena pengingkaran mereka kepada nabi mereka, serta penolakan akan ayat-ayat Allah. Ketahuilah bahwa pada kisah ini terdapat tanda-tanda yang nyata, juga pelajaran yang jelas bagi orang-orang yang mengetahui secara hakiki dan melihat keadaan dari para pendusta, maka mereka mengambil nasihat dan pelajaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dinding-dindingnya roboh menimpa atapnya, penghuninya telah tiada dan tidak ada lagi yang singgah di sana. Inilah akibat kezaliman mereka, berupa syirk kepada Allah, mendustakan nabi mereka dan melakukan berbagai kemaksiatan. Pembinasaan dan penghancuran mereka. Bisa juga diartikan, “terdapat pelajaran.” Itu adalah sunatullah terhadap orang-orang yang mendustakan. Mereka memikirkan peristiwa-peristiwa yang dialami para wali-Nya dan musuh-musuh-Nya. Mereka mengetahui, bahwa akibat dari perbuatan zalim adalah kehancuran dan kebinasaan, dan bahwa akibat iman dan keadilan adalah keselamatan dan kemenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 52",
    "description": "Allah membinasakan mereka melalui suara yang mengguntur (lihat: surah hud/11: 67), kemudian gempa yang dahsyat (lihat: surah al-a'r'f/7: 78) yang menghancurkan. Demikian pula pada ayat ini, Allah menggambarkan kehancuran mereka. Maka itulah rumah-rumah mereka yang runtuh, luluh lantak karena kezaliman mereka, yaitu penentangan mereka terhadap ajakan nabi saleh untuk bertobat dan berbuat baik. Apa yang terjadi pada kaum nabi saleh adalah pelajaran yang sangat berguna. Sungguh, pada yang demikian itu benar-benar terdapat tanda kekuasaan Allah bagi orang-orang yang mengetahui. Apa yang dikatakan oleh Allah, baik janji maupun ancaman, adalah benar adanya, pasti akan menjadi kenyataan, bukan main-main. 53. Kemudian Allah menjelaskan nasib dari nabi shaleh dan pengikutnya. Dan kami selamatkan orang-orang yang beriman dan mereka selalu bertakwa. Keimanan dan ketakwaan akan membawa keberuntungan bagi pelakunya baik dunia maupun akhirat, karena itulah kehendak Allah pada manusia."
  }
]