[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami selamatkan dari kebinasaan yang menimpa kaum Tsamud, Shaleh dan orang-orang yang beriman kepadanya, yang takut kepada siksaan Allah dengan keimanan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan Kami telah menyelamatkan orang-orang yang beriman kepada Allah dari kalangan kaum Ṣāleḥ, sebab mereka dahulu selalu bertakwa kepada Allah dengan mengerjakan perintah dan menjauhi larangan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَأَنجَيْنَا الَّذِينَ ءَامَنُوا۟ (Dan telah Kami selamatkan orang-orang yang beriman) Yaitu Shalih dan orang-orang yang beriman kepadanya. وَكَانُوا۟ يَتَّقُونَ(dan mereka itu selalu bertakwa) Yakni bertakwa kepada Allah dan takut dari azab-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Kami telah selamatkan Shaleh beserta orang-orang yang beriman yang takut atas azab Allah, dan takut berbuat maksiat dan kesyirikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menyelamatkan orang-orang yang beriman dan selalu bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53 oleh karena itu Allah berfirman,”dan telah kami selamatkan orang-orang yang beriman dan mereka itu selalu bertakwa,” maksudnya, kami menyelamatkan orang-orang yang beriman kepada Allah, para malaikatNya, kitab-kitabNya, para RasulNya, Hari akhir dan kepada takdir, yang baik dan yang buruk; dan mereka selalu mewaspadai syirik kepada Allah dan berbagai kemaksiatan, dan mereka melaksanakan ketaatan kepadaNya dan ketaatan kepada para RasulNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 53: Allah selamatkan mereka yang beriman kepada para rasul dari adzab dan kebinasaan, dan itulah di antara sifat-sifat orang-orang yang beriman, yang mereka menjadikan di antara mereka dan adzab Allah benteng dengan ketauhidan, keimanan kepada Allah dan beramal dengan perintah-Nya serta meninggalkan kesyirikan dan menjauhkannya begitu juga meninggalkan apa yang Allah larang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu Shaleh ‘alaihis salam dan orang-orang yang beriman bersamanya. Yakni dari syirk dan perbuatan maksiat, serta mengerjakan ketaatan kepada Allah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 53",
    "description": "Kemudian Allah menjelaskan nasib dari nabi shaleh dan pengikutnya. Dan kami selamatkan orang-orang yang beriman dan mereka selalu bertakwa. Keimanan dan ketakwaan akan membawa keberuntungan bagi pelakunya baik dunia maupun akhirat, karena itulah kehendak Allah pada manusia. 54. Dan ingatlah, wahai rasul, dan ceritakan kepada kaummu kisah nabi lut, ketika dia berkata kepada kaumnya, 'mengapa kamu mengerjakan perbuatan fahisyah, perilaku keji, yaitu melakukan hubungan seksual antara lelaki dengan sesama jenis padahal kamu melihatnya yaitu kekejian perbuatan maksiat itu' mengapa kamu membiarkan hal itu terus terjadi dan kamu melakukannya'."
  }
]