[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-55. Dan ingatlah Luth ketika dia berkata kepada kaumnya, “Apakah kalian melakukan tindakan yang paling parah dalam keburukannya, sedang kalian mengetahui keburukannya? Sesungguhnya kalian mendatangi laki-laki melalui dubur-dubur mereka untuk memenuhi syahwat sebagai pengganti kaum wanita. Bahkan kalian adalah kaum yang bodoh terhadap hak Allah yang menjadi kewajiban kalian. Maka kalian menyelisihi perintahNya dengan tindakan tersebut, dan kalian durhaka kepada Rasul kalian dengan perbuatan kalian yang buruk itu yang tidak ada seorang pun dari semua makhluk di alam semesta ini yang pernah mendahului kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Dan ingatlah -wahai Rasul- kisah Lūṭ, ketika dia berkata kepada kaumnya mengingkari dan mencela mereka, \"Mengapa kalian mengerjakan perbuatan keji -yaitu homoseksual- ditempat-tempat berkumpul kalian secara terang-terangan yang mana sebagian kalian bisa melihat perbuatan keji sebagian lainnya?!"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-55. Dan kami telah mengutus Nabi Luth kepada kaumnya ketika dia berkata kepada mereka: “Mengapa kalian melakukan kejahatan yang sangat buruk dan keji padahal kalian mengetahui bahwa itu adalah kejahatan yang menghinakan?” Dan dia menegur mereka: “Kalian menyetubuhi sesama laki-laki melalui dubur mereka demi memuaskan syahwat setan, dan kalian berpaling dari para wanita yang telah Allah halalkan bagi kalian. Sungguh kalian tidak mengetahui bahaya dari kejahatan ini di dunia dan di akhirat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَلُوطًا (Dan Luth) Yakni dan Kami utus pula Luth. إِذْ قَالَ لِقَوْمِهِۦٓ أَتَأْتُونَ الْفٰحِشَةَ(ketika dia berkata kepada kaumnya: “Mengapa kamu mengerjakan perbuatan fahisyah) Yakni perbuatan yang sangat buruk dan keji. Mereka adalah penduduk kota Sodom. وَأَنتُمْ تُبْصِرُونَ(sedang kamu memperlihatkan(nya)?) Sebab mereka melakukan perbuatan keji itu dengan terang-terangan karena sikap mereka yang durhaka dan menentang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Ingatlah kisah Luth wahai Nabi, ketika dia berkata kepada kaumnya: \"Mengapa kamu mengerjakan perbuatan keji dan sodom itu, serta kalian juga memperlihatkannya tanpa rasa malu?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Luth ketika dia berkata kepada kaumnya,“Mengapa kalian melakukan perbuatan keji} perbuatan yang buruk {padahal kalian mengetahui} sebagian kalia saling mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54 maksudnya, ingatlah hamba dan rasul Kami, yaitu Luth dan kabarnya yang mulia di waktu dia berkata kepada kaumnya seraya mengajak mereka kepada Allah dan memberi nasihat, “mengapa kamu mengerjakan perbuatan keji itu,” maksudnya, perbuatan yang sangat menjijikan yang dinyatakan keji oleh akal sehat dan fitrah serta dianggap buruk oleh syariat, “sedang kamu melihat,” hal tersebut dan kalian mengetahui keburukannya, namun kalian tetap berkeras kepala dan tetap melakukan perbuatan itu karena kezhaliman drai kalian dan ceroboh terhadap Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 54: Ingatlah wahai Nabi Allah ketika Luth berkata kaumnya dengan penghinaan : Apakah kalian akan mendatangi kejahatan yang buruk ini sedangkan kalian mengetahui akan keburukan dan kejahatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dan ingatlah hamba Kami dan Rasul Kami Luth serta beritanya yang cukup menarik. Yaitu homoseks. Disebut perbuatan keji,. Karena dianggap keji oleh akal, fitrah dan semua syariat. Yakni mengetahui buruk dan kejinya perbuatan itu, tetapi kamu malah mengerjakannya karena zalim dan berani kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 54",
    "description": "Dan ingatlah, wahai rasul, dan ceritakan kepada kaummu kisah nabi lut, ketika dia berkata kepada kaumnya, 'mengapa kamu mengerjakan perbuatan fahisyah, perilaku keji, yaitu melakukan hubungan seksual antara lelaki dengan sesama jenis padahal kamu melihatnya yaitu kekejian perbuatan maksiat itu' mengapa kamu membiarkan hal itu terus terjadi dan kamu melakukannya'55. Mengapa kamu mendatangi laki-laki untuk memenuhi syahwat-Mu, bukan mendatangi perempuan yang diciptakan oleh Allah untuk kamu sekalian' bukankah apa yang kamu lakukan adalah betul-betul bertentangan dengan fitrah manusia, bahkan binatang sekali pun tidak melakukannya. Sungguh, kamu adalah kaum yang tidak mengetahui akan akibat perbuatanmu. \"[]."
  }
]