[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-55. Dan ingatlah Luth ketika dia berkata kepada kaumnya, “Apakah kalian melakukan tindakan yang paling parah dalam keburukannya, sedang kalian mengetahui keburukannya? Sesungguhnya kalian mendatangi laki-laki melalui dubur-dubur mereka untuk memenuhi syahwat sebagai pengganti kaum wanita. Bahkan kalian adalah kaum yang bodoh terhadap hak Allah yang menjadi kewajiban kalian. Maka kalian menyelisihi perintahNya dengan tindakan tersebut, dan kalian durhaka kepada Rasul kalian dengan perbuatan kalian yang buruk itu yang tidak ada seorang pun dari semua makhluk di alam semesta ini yang pernah mendahului kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. \"Mengapa kalian mendatangi laki-laki untuk melampiaskan nafsu, bukan mendatangi wanita? Sungguh kalian tidak menginginkan adanya kehormatan dan anak, namun hanya ingin melampiaskan hawa nafsu binatang, bahkan kalian adalah kaum yang jahil terhadap kewajiban kalian berupa iman, kesucian dan sikap jauh dari maksiat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. أَئِنَّكُمْ لَتَأْتُونَ الرِّجَالَ شَهْوَةً (Mengapa kamu mendatangi laki-laki untuk (memenuhi) nafsu(mu)) Kalimat ini diulangi untuk menekankan bahwa perbuatan itu sangat buruk dan menerangkan bahwa perbuatan keji itu adalah homoseksual. مِّن دُونِ النِّسَآءِ ۚ (bukan (mendatangi) wanita?) Yakni meninggalkan para wanita, padahal mereka-lah yang seharusnya mereka datangi. بَلْ أَنتُمْ قَوْمٌ تَجْهَلُونَ(Sebenarnya kamu adalah kaum yang tidak mengetahui (akibat perbuatanmu)”) Yakni tidak mengetahui besarnya siksaan bagi pelaku kemaksiatan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. \"Mengapa kalian mendatangi laki-laki untuk memenuhi nafsu kalian yang sangat tidak berfaidah, sebab tujuan berhubungan adalah mendapat keturunan bukan hanya untuk memenuhi nafsu, mengapa bukan malah mendatangi wanita yang telah Allah ciptakan untuka kalian melalui jalan menikah? Sebenarnya kamu adalah kaum yang bodoh akibat perbuatanmu, dan hukuman atas perbuatan itu adalah sangat pedih\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mengapa kalian mendatangi laki-laki, bukan perempuan, untuk memenuhi syahwat. Kalian adalah kaum yang berbuat kebodohan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55 kemudian Allah menjelaskan kekejian tersebut, seraya berfirman, ”mengapa kamu mendatangani laki-laki untuk (memenuhi) nafsu(mu), bukan (mendatangi) wanita?” maksudnya, bagaimana kalian bisa sampai pada kondisi seperti ini, sehingga nafsu birahi kalian tertuju pada kaum laki-laki dan kepada dubur mereka, yaitu tempat keluarnya tinja, kentut dan kotoran, dan kalian meninggalkan sesuatu yang telah Allah ciptakan untuk kalian pada kaum perempuan, yaitu berupa tempat yang baik yang mana jiwa sudah difitrahkan cenderung kepadanya, sedangkan kalian malah terbalik, kalian menganggap baik sesuatu yang buruk dan menganggap buruk sesuatu yang baik? “sebenarnya kamu adalah kaum yang [berlebih-lebihan],” melampaui batasan-batasan Allah dan sangat lancang terhadap apa-apa yang diharamkanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 55: Kemudian Luth berkata dengan sangat marah kepada mereka, karena sebab buruknya tindakan mereka : Apakah kalian akan menyelisihi fitrah kalian di mana Allah telah berikan fitrah (fitrah yang baik) kepada kalian, dengan menikahi laki-laki dari manusia ?!!, dan kalian mininggalkan apa yang Allah telah muliakan kalian dengan bersenang-senang dengan istri-istri kalian dari perempuan ?!, Bahkan kalian adalah satu kaum yang bodoh dengan kejelekan apa yang telah kalian kerjakan, dan kalian tidak takut akan dahsyatnya adxab di mana akan segera menimpa kalian, karena sebab perbuatan kalian yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, mengapa kamu sampai seperti ini keadaannya, syahwatmu tertuju kepada laki-laki, padahal dubur mereka adalah tempat keluar kotoran, dan kamu meninggalkan apa yang Allah ciptakan untukmu, yaitu tempat yang baik dari kaum wanita? Kamu anggap baik perbuatan buruk dan kamu anggap buruk perbuatan baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 55",
    "description": "Mengapa kamu mendatangi laki-laki untuk memenuhi syahwat-Mu, bukan mendatangi perempuan yang diciptakan oleh Allah untuk kamu sekalian' bukankah apa yang kamu lakukan adalah betul-betul bertentangan dengan fitrah manusia, bahkan binatang sekali pun tidak melakukannya. Sungguh, kamu adalah kaum yang tidak mengetahui akan akibat perbuatanmu. \"[]56. Teguran nabi lut tidak digubris sedikit pun oleh kaumnya, bahkan mereka menganggapnya sebagai teguran yang tidak wajar untukditanggapi, karena itu jawaban kaumnya tidak lain hanya dengan mengatakan kepada sesama yang durhaka, 'usirlah lut dan keluarganya yakni pengikut-pengikutnya dari negeri tempat tinggalmu; sesungguhnya mereka adalah orang-orang yang terus menerus menganggap dirinya suci sehingga tidak sudi ikut bersama kita. '."
  }
]