[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tidak ada jawaban dari kaum Luth kepada Luth kecuali perkataan sebagian dari mereka kepada sebagian lainnya, “Usirlah keluarga Luth dari negeri kalian. Sesungguhnya mereka itu kumpulan orang yang tidak mau menggauli lelaki.” Orang-orang itu mengatakan hal itu kepada kawan-kawannya sebagai bentuk olokan terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Maka kaumnya tidak mempunyai jawaban kecuali ucapan mereka, “Usirlah keluarga Lūṭ dari negerimu, sesungguhnya mereka adalah orang-orang yang senantiasa menjaga diri dari kotoran-kotoran dan najis-najis.” Mereka mengucapkan hal itu sebagai bentuk olok-olok terhadap keluarga Lūṭ -'alaihissalām- yang tidak mau ikut serta bersama mereka dalam perbuatan nista yang mereka lakukan, tapi justru keluarga Lūṭ -'alaihissalām- mengingkari perbuatan yang mereka lakukan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Akan tetapi mereka tetap melakukan kejahatan keji itu dan menyikapi Nabi Luth dengan hinaan dan olokan: “Usirlah Luth dan keluarganya dari negeri kalian karena mereka enggan mengikuti apa yang kalian perbuat dan tidak menyetujui perbuatan kalian itu, sehingga mereka tidak layak untuk tinggal bersama kalian di negeri ini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ (karena sesungguhnya mereka itu orang-orang yang (mendakwakan dirinya) suci) Yakni menyucikan diri dari dubur para lelaki. Mereka mengatakan ini sebagai olokan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Maka jawaban kaum Luth tidak lain adalah: \"Usirlah Luth beserta keluarganya dari negerimu; karena sesungguhnya mereka itu orang-orang yang (mendakwakan dirinya) bersih, dan tidak nyaman dengan perbuatan kita\". Mereka mengatakan itu dengan maksud mencela"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jawaban kaumnya tidak lain kecuali dengan mengatakan,“Usirlah Luth dan pengikutnya dari negeri kalian. Sesungguhnya mereka adalah orang-orang yang selalu menyucikan diri} menyucikan diri dari bagian dubur laki-laki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56 “maka jawabanya kaumnya bukan,” menerima dan tidak pula kesadaran, ingat ataupun mengambil pelajaran. Tetapi malah jawaban mereka adalah menentang, membangkang dan mengancam nabi mereka yang sangat tulus itu dan rasul mereka yang terpercaya dengan ancaman mengeluarkan dan mengusirnya dari negerinya. Maka tidaklah jawaban kaumnya “melainkan mengatakan, ’usirlah luth beserta keluarganya dari negerimu,” lalu, seakan-akan dikatakan kepada mereka, “apa dendam kalian terhadap mereka dan apa dosa mereka yang telah mengharuskan mereka di usir?” Maka mereka menjawab, “karena sesungguhnya mereka itu orang-orang yang menjaga kesucian diri,” maksudnya, mereka menjauhkan diri dari homoseks dan dari dubur kaum lelaki!! Semoga Allah menjelekkan mereka. Mereka benar-benar telah menjadikan kebajikan yang termulia setingkat dengan keburukan yang plaing busuk, dan mereka tidak puas hanya dengan mendurhakai nabi mereka dalam sesuatu yang dinasihatikannya, hingga sampai pada tingkat akan mengusirnya. Keburukan (mereka) dapat dilihat dari cara mereka berbicara. Mereka mengatakan, ”usirlah mereka dari kampung halaman kalian, sebab mereka adalah manusia-manusia yang mengaku suci!!” arti dari ungkapan ini adalah; kalian adalah orang-orang yang tercemar dengan kebusukkan dan kekejian yang berkonsekuensi turunnya hukuman di kampung halaman kalian dan keselamatan orang yang keluar darinya!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 56: Mereka tidaklah memiliki jawaban kecuali hanya berkata sebagian mereka atas sebagian yang lain : Keluarkan Luth dan siapa yang beriman kepadanya dari negeri kalian. Kemudian berkata pengolok-olok : Sungguh mereka hanyalah orang-orang yang ingin mensucikan perbuatan mereka dan mengotorinya, yaitu mereka tidak merasa memiliki aib kecuali merasa diri mereka suci dan menuntut untuk disucikan (dibenarkan atas perbuatannya). Inilah keadaan kebanyakan zaman dan tempat yang menjadikan keistiqamahan, hidayah, kesucian dan kebaikan sebagai aib (keburukan) bagi orang-orang yang keluar dari ketaatan (kepada Allah)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seakan-akan ada yang berkata, “Apa alasan yang mengharuskan kamu mengusir mereka (Luth dan keluarganya)?” Perkataan kaum Luth kepada sesamanya ini merupakan ejekan terhadap Luth dan orang-orang beriman kepadanya, karena Luth dan orang-orang yang bersamanya tidak mau mengerjakan perbuatan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 56",
    "description": "Teguran nabi lut tidak digubris sedikit pun oleh kaumnya, bahkan mereka menganggapnya sebagai teguran yang tidak wajar untukditanggapi, karena itu jawaban kaumnya tidak lain hanya dengan mengatakan kepada sesama yang durhaka, 'usirlah lut dan keluarganya yakni pengikut-pengikutnya dari negeri tempat tinggalmu; sesungguhnya mereka adalah orang-orang yang terus menerus menganggap dirinya suci sehingga tidak sudi ikut bersama kita. '57. Maka kami selamatkan dia dan keluarganya serta para pengikutnya dari siksa yang akan menimpa, kecuali istrinya. Kami telah menentukan dan mentakdirkan akibat kedurhakaannya bahwa dia termasuk orang-orang yang tertinggal yakni berada dalam azab dan binasa bersama orang-orang kafir."
  }
]