[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu Kami selamatkan Luth dan keluarganya dari azab yang akan melanda kaum Luth kecuali istrinya, Kami telah takdir dia termasuk orang yang tertinggal dalam siksaan sehingga ikut binasa bersama orang-orang yang binasa. Sebab dia sesungguhnya mendukung kaumnya untuk melakukan perbuatan-perbuatan buruk mereka lagi menyetujuinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Maka Kami menyelamatkannya dan menyelamatkan keluarganya kecuali istrinya, Kami memutuskan baginya untuk tetap bersama orang-orang yang menetap dalam siksaan agar ia termasuk dalam golongan orang-orang yang binasa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Dan ketika Kami menetapkan siksaan bagi mereka -dengan keagungan dan kekuasaan Kami-, maka Kami selamatkan Nabi Luth dan keluarganya dari azab yang menimpa kaumnya. Akan tetapi Kami tetapkan bagi istri Nabi Luth untuk tetap bersama orang-orang yang binasa dalam azab, karena dia telah membantu mereka dengan menunjukkan kepada mereka kedatangan para tamu Nabi Luth sehingga kaumnya mendatangi mereka dan ingin berbuat keji dengan tamu-tamu itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. فَأَنجَيْنٰهُ وَأَهْلَهُۥٓ (Maka Kami selamatkan dia beserta keluarganya) Kami selamatkan dari azab. إِلَّا امْرَأَتَهُۥ قَدَّرْنٰهَا مِنَ الْغٰبِرِينَ (kecuali isterinya. Kami telah mentakdirkan dia termasuk orang-orang yang tertinggal (dibinasakan)) Yakni Kami takdirkan dia termasuk orang yang kekal dalam azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Maka Kami selamatkan dia beserta keluarganya yang beriman dari azab, kecuali isterinya. Kami telah mentakdirkan dia termasuk orang-orang yang tertinggal dalam azab (dibinasakan)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami menyelamatkan dia dan keluarganya, kecuali istrinya. Kami telah menentukan} Kami telah menentukan putusan untuknya bahwa dia {termasuk yang tertinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-58 oleh karenanya, Allah berfirman, ”maka kami menyelamatkannya beserta keluarganya, kecuali istrinya. Kami telah menakdirkannya termasuk orang-orang yang tertinggal,” yaitu, tatkala malaikat mendatanginya dalam bentuk beberapa orang tamu, hal itu di dengar oleh kaumnya, maka mereka datang kepadanya dengan maksud buruk terhadap para tamu itu, dan luth menutup pintu agar mereka tidak dapat masuk; kemudian keadaan menjadi lebih tegang, maka para malaikat mengabarkan tentang keadaan yang sebenarnya, dan bahwa mereka (para malaikat) datang untuk menyelamatkan luth dan mengeluarkannya drai tengah-tengah mereka, dan bahwa para malaikat hendak membinasakan mereka (kaum luth), dan waktunya adalah dini hari. Para malaikat menyuruh luth agar berangkat beserta keluarga di malam hari kecuali istrinya, karena dia akan ditimpa oleh azab yang akan menimpa kaumnya. Maka luth pun berangkat di malam hari bersama keluarganya sehingga mereka pun selamat. Sedangkan mereka (kaumnya) ditimpa azab di waktu dini hari, lalu Allah membalik kampung halaman mereka sehingga bagian atasnya menjadi terbalik ke bagian bawah, dan Allah menimpakan hujan batu dari tanah yang terbakar dengan bertubi-tubi terhadap mereka dari sisi tuhanmu. Maka dari itu, di sini Dia berfirman, ”dan kami turunkan hujan atas mereka (hujan batu), maka amat buruklah hujan yang ditimpakan atas orang-orang yang diberi peringatan itu.” Maksudnya, seburuk-buruk hujan adalah hujan (yang menimpa) mereka, dan seburuk-buruk azab adalah azab yang menimpa mereka, sebab mereka telah diberi peringatan dan ditakut-takuti, namun mereka tidak berhenti dan tidak jera. Maka dari itu, Allah menimpakkan hukumanNya yang sangat keras terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 57: Luth dan keluarganya Allah selamatkan dari adzab yang akan menimpa kaumnya dan keluarganya. Dan Kami kecualikan selamat dari adzab istri Luth, karena dia yang tersisa untuk ikut terkena adzab dan sebagai orang yang celaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika para malaikat datang sebagai tamu (dalam rupa manusia) kepada Nabi Luth ‘alaihis salam, maka kaumnya mengetahui kedatangan mereka dan ingin melakukan kejahatan kepada tamu-tamu itu, maka Nabi Luth menutup pintunya dari mereka, dan Beliau (Nabi Luth ‘alaihis salam) kebingungan, lalu para malaikat memberitahukan keadaan yang sebenarnya, bahwa kedatangan mereka adalah untuk menyelamatkan Nabi Luth dan mengeluarkannya dari tengah-tengah kaumnya, mereka ingin membinasakan mereka, di mana waktu pembinasaannya adalah pagi hari, dan mereka (para malaikat) memerintahkan Nabi Luth membawa pergi keluarganya di malam hari sehingga mereka selamat sedangkan kaumnya ditimpa azab pada pagi harinya; Allah membalikkan negeri mereka dan menjadikan bagian atasnya di bawah dan bawahnya menjadi di atas, lalu mereka ditimpa hujan batu dari yanah yang keras dan bertubi-tubi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 57",
    "description": "Maka kami selamatkan dia dan keluarganya serta para pengikutnya dari siksa yang akan menimpa, kecuali istrinya. Kami telah menentukan dan mentakdirkan akibat kedurhakaannya bahwa dia termasuk orang-orang yang tertinggal yakni berada dalam azab dan binasa bersama orang-orang kafir. 58. Dan kami hujani mereka dengan hujan batu yang membinasakan sebagai bentuk azab dari kami, maka sangat buruklah hujan yang ditimpakan pada orang-orang yang diberi peringatan akan datangnya azab itu tetapi tidak mengindahkan."
  }
]