[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami hujani mereka dari langit dengan hujan batu yang berasal dari tanah yang membinasakan. Amat buruk hujan yang menimpa kaum yang sudah diperingatkan tersebut yang telah jelas hujjah di hadapan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan Kami hujani kaum Lūṭ -'alaihissalām- dengan batu dari langit. Maka itu merupakan hujan yang buruk lagi mencelakakan bagi orang-orang yang sudah diberi peringatan dengan azab, tetapi mereka tidak mau mendengarkannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Dengan keagungan dan kekuasaan Kami, Kami turunkan kepada orang-orang yang berbuat kerusakan itu hujan dari langit yang membawa keburukan, yaitu hujan yang mengandung bebatuan yang dapat membinasakan. Sungguh buruk ujian yang menimpa orang-orang yang telah diberi peringatan oleh Nabi Nuh sehingga telah tegak hujjah atas mereka. Hal ini karena mereka mendustakan Rasul mereka dan hendak mengusirnya sehingga mereka berhak mendapat azab. Objek olokan dalam kalimat ini tidak disebutkan, dan kalimat lengkapnya adalah: Seburuk-buruk hujan yang diturunkan kepada orang-orang yang telah diperingati adalah hujan yang menimpa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. فَسَآءَ مَطَرُ الْمُنذَرِينَ (maka amat buruklah hujan yang ditimpakan atas orang-orang yang diberi peringatan itu) Yakni orang-orang yang mendapat peringatan namun tidak mempedulikan peringatan itu sehingga mereka ditimpa hujan batu sampai mati."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Tidak didapati dalam al-Qur'an penyebutan kata (المطر) kecuali pada ayat yang menjelaskan tentang pembalasan dan siksaan berbeda dengan kata (الغيث) yang al-Qur'an menyebutkan dengannya tentang kebaikan dan rahmat; Allah ta'ala berfirman : { وَأَمْطَرْنَا عَلَيْهِمْ مَطَرًا ۖ فَسَاءَ مَطَرُ الْمُنْذَرِينَ } \"Dan Kami turunkan hujan atas mereka (hujan batu), maka amat buruklah hujan yang ditimpakan atas orang-orang yang diberi peringatan itu.\" dan pada ayat alin disebutkan : { وَهُوَ ٱلَّذِى يُنَزِّلُ ٱلْغَيْثَ مِنۢ بَعْدِ مَا قَنَطُوا۟ وَيَنشُرُ رَحْمَتَهُۥ ۚ وَهُوَ ٱلْوَلِىُّ ٱلْحَمِيدُ } \"Dan Dialah Yang menurunkan hujan sesudah mereka berputus asa dan menyebarkan rahmat-Nya. Dan Dialah Yang Maha Pelindung lagi Maha Terpuji.\" [ Asy-Syura : 28 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Kami turunkan hujan dari langit kepada mereka (hujan batu), kemudian Kami binasakan mereka dengan hujan batu itu. Maka itulah seburuk-buruk hujan yang ditimpakan atas orang-orang yang diberi peringatan tentang azab Allah jika mereka melakukan maksuat, namun mereka membangkang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang terkena azab {Kami menghujani mereka dengan hujan} batu dari langit {Betapa buruk} betapa buruk {hujan yang menimpa orang-orang yang telah diberi peringatan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57-58 oleh karenanya, Allah berfirman, ”maka kami menyelamatkannya beserta keluarganya, kecuali istrinya. Kami telah menakdirkannya termasuk orang-orang yang tertinggal,” yaitu, tatkala malaikat mendatanginya dalam bentuk beberapa orang tamu, hal itu di dengar oleh kaumnya, maka mereka datang kepadanya dengan maksud buruk terhadap para tamu itu, dan luth menutup pintu agar mereka tidak dapat masuk; kemudian keadaan menjadi lebih tegang, maka para malaikat mengabarkan tentang keadaan yang sebenarnya, dan bahwa mereka (para malaikat) datang untuk menyelamatkan luth dan mengeluarkannya drai tengah-tengah mereka, dan bahwa para malaikat hendak membinasakan mereka (kaum luth), dan waktunya adalah dini hari. Para malaikat menyuruh luth agar berangkat beserta keluarga di malam hari kecuali istrinya, karena dia akan ditimpa oleh azab yang akan menimpa kaumnya. Maka luth pun berangkat di malam hari bersama keluarganya sehingga mereka pun selamat. Sedangkan mereka (kaumnya) ditimpa azab di waktu dini hari, lalu Allah membalik kampung halaman mereka sehingga bagian atasnya menjadi terbalik ke bagian bawah, dan Allah menimpakan hujan batu dari tanah yang terbakar dengan bertubi-tubi terhadap mereka dari sisi tuhanmu. Maka dari itu, di sini Dia berfirman, ”dan kami turunkan hujan atas mereka (hujan batu), maka amat buruklah hujan yang ditimpakan atas orang-orang yang diberi peringatan itu.” Maksudnya, seburuk-buruk hujan adalah hujan (yang menimpa) mereka, dan seburuk-buruk azab adalah azab yang menimpa mereka, sebab mereka telah diberi peringatan dan ditakut-takuti, namun mereka tidak berhenti dan tidak jera. Maka dari itu, Allah menimpakkan hukumanNya yang sangat keras terhadap mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 58: Allah menurunkan kepada kaum luth adzab dengan menghujani dengan bebatuan dari neraka sijjil yang dijatuhkan di atas kepala-kepala mereka dan binasalah mereka semua, seburuk-buruk hujan adalah hujan yang diberikan kepada kaum Nabi Luth, dan seburuk-buruk adzab adalah adzab mereka, sungguh telah tegak bagi mereka hujjah dan telah datang kepada mereka pemberi peringatan akan tetapi mereka tidak beriman; Bahkan mendustakan dan sombong. Berkata Ibnu Athiyyah : Sesungguhnya ayat ini adalah asal bagi siapa yang menegakkan hukuman sebagaimana dosa kaum Luth dengan rajam, madzhab malik merajam yang melakukan dan pasangan yang sama-sama berbuat keji, madzhab syafi’i menegakkan hukuman sebagaimana pezina; Di mana jika yang berzina adalah gadis dicambuk dan dirajam, dan madzhab abu hanifah dicela dengan tanpa hukuman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seburuk-buruk hujan adalah hujan mereka dan seburuk-buruk azab adalah azab mereka, karena mereka telah diberi peringatan, namun tidak mau berhenti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 58",
    "description": "Dan kami hujani mereka dengan hujan batu yang membinasakan sebagai bentuk azab dari kami, maka sangat buruklah hujan yang ditimpakan pada orang-orang yang diberi peringatan akan datangnya azab itu tetapi tidak mengindahkan. 59. Demikianlah uraian kisah-kisah para nabi dan umatnya yang memberi tuntunan dan pelajaran yang harus disyukuri, maka katakanlah, wahai nabi Muhammad, \"segala puji hanya bagi Allah dalam segala situasi dan kondisi dan salam sejahtera atas hamba-hamba-Nya yang dipilih-Nya sebagai pengemban misi kerasulan. \" katakan pula kepada orang-orang musyrik, 'apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan dengan-Nya yang tidak dapat mendatangkan manfaat atau mudarat''."
  }
]