[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) “Segala pujian dan syukur hanya milik Allah, dan keselamatan dariNya serta keamanan atas hamba-hambaNya yang telah Dia pilih untuk mengemban risalahNya.” Kemudian tanyakanlah kepada kaum musyrikin dari kaummu, “Apakah Allah yang memiliki kekuasaan mendatangkan manfaat dan keburukan yang lebih baik, ataukah obyek yang mereka persekutukan selain Allah yang tidak memiliki kuasa terhadap dirinya ataupun orang lain untuk memberikan manfaat dan kemadorotan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Katakan -wahai Rasul- “Segala puji bagi Allah atas segala nikmat-nikmat-Nya dan amanat dari-Nya atas para Rasul-Nya yang telah dipilih-Nya untuk menyampaikan agama-Nya. Apakah Allah yang berhak disembah, yang di Tangan-Nya kekuasaan atas segala sesuatu yang lebih baik ataukah sesembahan-sesembahan yang disembah oleh orang-orang musyrik yang tidak mampu memberikan manfaat maupun mudarat?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Allah memerintahkan nabi Muhammad untuk memuji Allah atas isi dari kisah para nabi berupa azab yang menimpa kaum yang mendustakan, dan atas isyarat yang ada dalam kisah-kisah tersebut berupa janji Allah untuk memberi kemenangan atas musuh-musuhnya. Dan setelah itu Allah memerintahkannya untuk menyampaikan salam kepada hamba-hamba-Nya yang telah Dia pilih untuk mengemban risalah. Dan dalam kalimat ini terdapat balasan dan penghargaan bagi para nabi atas segala cobaan yang mereka dapatkan di jalan dakwah. Kemudian Allah memerintahkan Rasulullah untuk mengingkari orang musyrik dengan berkata: “Manakah yang lebih baik, Allah yang telah disebutkan perbuatan dan sifat-sifat-Nya yang menunjukkan kebesaran kuasa-Nya, atau berhala-berhala yang kalian jadikan sekutu Allah dalam ibadah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. قُلِ الْحَمْدُ لِلّٰهِ (Katakanlah: “Segala puji bagi Allah) Yakni katakanlah hai Muhammad “Segala puji bagi Allah yang telah membinasakan orang-orang kafir dari umat-umat terdahulu. وَسَلٰمٌ عَلَىٰ عِبَادِهِ الَّذِينَ اصْطَفَىٰٓ ۗ( dan kesejahteraan atas hamba-hamba-Nya yang dipilih-Nya) Mereka adalah orang-orang terbaik, yaitu umat Nabi Muhammad, serta para Nabi beserta pengikut mereka. ءَآللهُ خَيْرٌ أَمَّا يُشْرِكُونَ(Apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan dengan Dia?) Yakni apakah Allah lebih baik atau berhala-berhala. Pendapat lain mengatakan maknanya adalah apakah pahala Allah lebih baik atau siksaan berhala-berhala yang kalian jadikan sekutu-sekutu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Katakanlah wahai Nabi: \"Segala puji bagi Allah Yang telah menunjukkan jalan, juga Yang telah membinasakan orang-orang kafir durhaka dari umat-umat yang kosong. Kesejahteraan atas hamba-hamba yang Allah pilih, yaitu para Nabi, mereka adalah manusia pilihan, sarta para pengikutnya. Apakah pengesaan, ketaatan kepada-Nya serta pahala dari Allah itu yang lebih baik? Ataukah kesyirikan orang musyrik atas Allah dengan menyembah berhala yang bahkan tidak mampu memberi manfaat maupun bencana? Kalimat Aaallah dibaca panjang, bentuk asli dari A-allah, yang bermakna: Apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan atas Dia?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Segala puji bagi Allah dan keselamatan atas hamba-hambaNya yang Dia pilih. Apakah Allah yang lebih baik ataukah apa yang mereka persekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59 maksudnya, katakanlah, ”segala puji hanya milik Allah yang berhak mendapat kesempurnaan pujian, pujaan dan sanjungan, karena kesempurnaan sifat-sifatNya, keindahan kebaikan, karunia, keadilan dan kebijaksanaanNya dalam menimpakan hukuman terhadap orang-orang yang zhalim. Dan berilah juga salam kepada hamba-hambaNya yang Dia pilih atas sekalian manusia, dari kalangan para nabi, para utusan, dan manusia-manusia pilihan Allah, Rabb semesta alam. Hal itu karena sangat tingginya kemuliaan mereka dan sebagai isyarat kepada kedudukan dan keselamatan mereka dari keburukan dan najis, dan kebersihan apa yang mereka katakan tentang Rabb mereka dari segala kekurangan dan aib (cela). “apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan denganNya?” ini adalah kalimat tanya jawab yang sudah pasti dan telah dimaklumi. Maksudnya Allah Rabb yang Mahaagung yang sempurna sifat-sifatNya, Mahabesar kelembutanNya yang lebih baik, ataukah patung-patung dan berhala-berhala yang mereka sembah selain Allah, sedangkan mereka lemah dari segala sisi, tidak bisa menimpakkan madarat dan tidak pula dapat memberikan manfat, tidak bisa menguasai untuk dirinya dan untuk para penyembahnya sebesar biji sawi pun dari kebaikan. Jadi, Allah yang lebih baik daripada sesuatu yang mereka persekutukan itu. Kemudian Allah menjelaskan rincian hal-hal yang dengannya Dia dapat dikenal dan dapat dipastikan bahwasannya Dia-lah AIlah yang disembah, dan bahwa beribadah kepadaNya itulah yang benar dan beribadah kepada selain Dia adalah kepalsuan,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 59: Katakanlah wahai Nabi Allah : Segala puji bagi Allah yang yang berhak mendapatkan kesempurnaan pujian; Dialah pemilik kenikmatan dan pemilik karunia yang diberikan kepada hamba-Nya, katakanlah : Keselamatan dan penghormatan bagi hamba Allah dan kekasih-Nya yang mereka Allah pilih untuk membawa risalah-Nya dan menyampaikan dakwah-Nya, dan mereka adalah orang-orang yang selamat dari mengerjakan keburukan dan berkeyakinan rusak. Kemudian tanyalah wahai Nabi Allah kepada orang-orang musyrik dari kaummu : Apakah Allah yang maha tinggi, di mana Dialah yang menguasai kebaikan dan keburukan, ataukah sesembahan patung-patung ini yang kalian sembah selain Allah yang tiada menguasai kebaikan dan keburukan serta kebaikan. Dalam firman Allah : Apakah Allah pemilik kebaikan ataukan berhala yang kalian ibadahi, dikatakan : Bahwasanya Nabi ﷺ jika membaca ayat ini beliau berkata : Dialah Allah yang maha baik, kekal, pembalas dan mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah berhak mendapatkan segala pujian dan sanjungan karena sempurna sifatnya, karena kebaikan-Nya, pemberian-Nya, keadilan dan kebijaksanaan-Nya dalam hal hukuman-Nya kepada orang-orang yang mendustakan dan mengazab orang-orang yang zalim. Dia juga memberikan salam kepada hamba-hamba pilihan-Nya, seperti para nabi, dan para rasul. Hal ini untuk meninggikan nama mereka, dan meninggikan kedudukan mereka serta selamatnya mereka dari keburukan dan kotoran, serta selamatnya apa yang mereka ucapkan tentang Tuhan mereka dari kekurangan dan aib. Yakni apakah Allah Tuhan yang Mahaagung yang sempurna sifat itu lebih baik ataukah patung-patung dan berhala-berhala yang memiliki kekurangan dari berbagai sisi, yang tidak mampu memberi manfaat dan menimpakan madharrat? Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan lebih rinci sesuatu yang dengannya diketahui dan dipastikan bahwa hanya Allah satu-satunya Tuhan yang berhak disembah dan bahwa menyembah selain-Nya adalah batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 59",
    "description": "Demikianlah uraian kisah-kisah para nabi dan umatnya yang memberi tuntunan dan pelajaran yang harus disyukuri, maka katakanlah, wahai nabi Muhammad, \"segala puji hanya bagi Allah dalam segala situasi dan kondisi dan salam sejahtera atas hamba-hamba-Nya yang dipilih-Nya sebagai pengemban misi kerasulan. \" katakan pula kepada orang-orang musyrik, 'apakah Allah yang lebih baik, ataukah apa yang mereka persekutukan dengan-Nya yang tidak dapat mendatangkan manfaat atau mudarat'' 60. Setelah ayat-ayat yang lalu membicarakan tindakan Allah terhadap para pembangkang serta penyelamatan terhadapnya hamba-Nya yang taat, kini Allah mengajak untuk membandingkan antara ciptaan-Nya dan yang dilakukan oleh selain-Nya. Wahai nabi Muhammad, katakan kepada mereka, 'bukankah dia yang telah menciptakan langit dan bumi tanpa contoh sebelumnya dan yang menurunkan air hujan dari langit yang sangat bermanfaat untukmu, lalu kami tumbuhkan dengan air itu kebun-kebun yang berpemandangan indah' kamu sekali-kali tidak akan mampu menumbuhkan pohon-pohonnya yang beraneka ragam dengan jenis, warna dan buah yang berlainan seandainya Allah tidak menurun-kan hujan dari langit. Jika demikian, apakah di samping Allah ada tuhan yang lain' keserasian dalam ciptaan Allah menunjukkan bahwa tidak ada tuhan lain yang menyertai Allah. Bahkan, sebenarnya mereka yang menyekutukan Allah adalah orang-orang yang menyimpang dari kebenar-an, sebab telah mempersamakan Allah dengan lainnya dalam ibadah dan keagungan."
  }
]