[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya kamu (wahai rasul) benar-benar merima al-Qur’an dari sisi Allah, Dzat Yang Mahabijaksana dalam penciptaan dan pengaturanNya, Yang pengetahuanNya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan sesungguhnya engkau -wahai Rasul- benar-benar menerima Al-Qur`ān yang diturunkan padamu ini dari sisi Allah Yang Maha Bijaksana dalam menentukan penciptaan, pengaturan dan syariat-Nya, lagi Maha Mengetahui, tidak ada satu maslahat hamba-Nya pun yang luput dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai Rasulullah, kamu adalah makhluk yang paling mulia yang menerima al-Qur’an dari Allah Yang Maha Bijaksana dalam mengatur makhluk-Nya dan Maha Mengetahui para mahkluk dan rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَإِنَّكَ لَتُلَقَّى الْقُرْءَانَ مِن لَّدُنْ حَكِيمٍ عَلِيمٍ (Dan sesungguhnya kamu benar-benar diberi Al Quran dari sisi (Allah) Yang Maha Bijaksana lagi Maha Mengetahui) Yakni Allah memberimu al-Qur’an kemudian kamu menerimanya dari sisi Allah Yang Maha Bijaksana dan Maha Mengetahui."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya kamu wahai Nabi, benar-benar diberi Al Quran sebagai wahyu dari sisi Allah Yang Maha Bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu benar-benar telah diberi} benar-benar diberi {Al-Qur’an dari sisi} dari sisi {Dzat Yang Maha bijaksana lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6 “dan sesungguhnya kamu telah diberi al-qur’an dari sisi (Allah) Yang Mahabijaksana lagi Maha Mengetahui.” Maksudnya, sesungguhnya al-qur’an yang turun kepadamu dan yang engkau terima ini adalah turun dari sisi Dzat Yang Mahabijaksana, yang meletakkan segala sesuatu tepat pada tempanya, dan menurunkannya pada kedudukan-kedudukannya, “Yang Mahamengetahui,” segala rahasia keadaan, yang tersembunyi dan yang tampak. Apabila dia berasal dari Yang Maha bijaksana lagi Maha Mengetahui, maka sudah dapat dipastikan bahwasannya al-qur’an itu semuanya adalah suatu hikmah dan kemaslahatan bagi manusia, siapakah yang lebih mengetahui akan kemaslahatan mereka daripada mereka sendiri?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 6: Allah mengabarkan kepada Nabi ﷺ bahwasanya Al Qur’an ini yang diturunkan kepadanya dengan perantara Jibril, ia adalah dari sisi Allah yang maha bijaksana dalam segala ciptaan, yang maha mengetahui, yang mencakup segala sesuatu atas segala pengetahuan; Tidak sebagaimana klaim orang-orang kafir yang bahwasanya berkata bahwa Al Qur’an adalah karangan Nabi ﷺ atau ia adalah dongeng-dongeng terdahulu yang Nabi tulis."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menempatkan sesuatu pada tempatnya dan memposisikan sesuatu pada posisinya. Segala rahasia dan hal yang tersembunyi sebagaimana Dia mengetahui yang tampak. Dari sini diketahui, bahwa penurunan Al Qur’an itu merupakan hikmah dan maslahat bagi hamba."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 6",
    "description": "Setelah menjelaskan kedudukan dan fungsi Al-Qur'an, ayat ini menjelaskan tentang pembawa Al-Qur'an yaitu nabi Muhammad. Dan sesungguhnya engkau wahai rasul benar-benar telah diberi Al-Qur'an dari sisi Allah yang mahabijaksana, maha mengetahui atas segala sesuatu. 7. Di antara isi kandungan Al-Qur'an adalah cerita tentang nabi-nabi masa lalu, antara lain adalah nabi musa. Allah memerintahkan kepada nabi Muhammad untuk menceritakan kepada kaumnya tentang nabi musa, yaitu ketika nabi musa sedang dalam perjalanan menuju ke mesir beserta istrinya untuk menemui ibundanya. Keduanya tersesat di jalan, di malam yang gelap dan dingin. Ceritakan kepada mereka, wahai nabi Muhammad, ketika musa berkata kepada keluarganya, 'sungguh, aku melihat api. Diamlah kamu di sini, aku akan membawa kabar dari arah api itu tentang itu kepadamu, atau aku akan membawa suluh api atau obor kepadamu agar kamu dapat berdiang menghangatkan badan dekat api. '."
  }
]