[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tanyalah mereka siapa yang menciptakan langit dan bumi dan menurunkan bagi kalian air dari langit, kemudian Dia menumbuhkan dengannya kebun-kebun yang berpemandangan indah? Kalian tidak mungkin untuk menumbuhkan pohon-pohonnya, sekiranya Allah tidak menurunkan air dari langit. Sesungguhnya peribadahan kepada Allah itulah perkara yang haq, dan penyembahan terhadap selain Allah adalah perkara batil. Apakah ada tuhan bersama Allah yang melakukan perbuatan-perbuatan tersbut di atas sehingga ia pantas disembah bersama Allah dan dipersekutukan denganNya? Bahkan orang-orang musyrik telah melenceng dari jalan kebenaran dan keimanan, lalu mereka menyamakan sesuatu dengan Allah dalam ibadah dan pengagungan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Atau siapakah yang telah menciptakan langit-langit dan bumi tanpa ada contoh sebelumnya, dan menurunkan atas kalian -wahai manusia- air hujan dari langit lalu Kami tumbuhkan bagi kalian dengan air itu kebun-kebun yang bagus nan indah, yang kamu sekali-kali tidak mampu untuk menumbuhkan pohon di kebun-kebun itu karena kelemahan kalian atas hal itu, lalu Allah lah yang menumbuhkannya, maka adakah sesembahan lain selain Allah? Tidak, bahkan mereka adalah kaum yang menyimpang dari kebenaran dengan menyamakan antara Żat Pencipta dan makhluk secara zalim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Hai Rasulallah, tanyakanlah kepada kaummu: “Apakah menyembah berhala berhala lebih baik, atau menyembah Allah yang telah menciptakan langit dan bumi, menurunkan hujan yang bermanfaat dari langit bagi kalian sehingga kalian menjalankan kehidupan kalian, dan dengan air hujan itu Allah menumbuhkan kebun-kebun yang sedap dilihat dan menenangkan arti orang yang memandangnya? Kalian tidak mampu untuk menumbuhkan pepohonannya. Kalaulah bukan Allah yang menciptakan sebab-sebabnya bagi kalian dengan menghilangkan segala yang menghalangi pertumbuhannya, Maka apakah terdapat pencipta selain Allah yang membantu-Nya untuk melakukan hal itu?” Orang-orang musyrik itu adalah kaum yang Berpaling dari jalan yang benar sehingga menjadikan selain Allah sebagai sekutu dalam ibadah, padahal Allah Maha Esa dalam menciptakan, memberi rezeki, dan mengatur hamba-hambanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. أَمَّنْ خَلَقَ السَّمٰوٰتِ وَالْأَرْضَ (Atau siapakah yang telah menciptakan langit dan bumi) Yakni apakah tuhan-tuhan mereka lebih baik atau Tuhan yang menciptakan langit dan bumi serta memperhitungkan penciptaannya? وَأَنزَلَ لَكُم مِّنَ السَّمَآءِ مَآءً(dan yang menurunkan air untukmu dari langit) Yakni suatu jenis air, yaitu air hujan. فَأَنۢبَتْنَا بِهِۦ حَدَآئِقَ(lalu Kami tumbuhkan dengan air itu kebun-kebun) Makna (الحديقة) adalah kebun yang dikelilingi pagar. ذَاتَ بَهْجَةٍ(yang berpemandangan indah) Yakni memiliki keindahan yang menyejukkan orang yang memandangnya. مَّا كَانَ لَكُمْ أَن تُنۢبِتُوا۟ شَجَرَهَآ ۗ( yang kamu sekali-kali tidak mampu menumbuhkan pohon-pohonnya?) Manusia tidak mampu melakukan itu, sebab itu diatas kemampuan mereka, karena mereka tidak mampu memunculkan sesuatu dari tidak ada menjadi ada. أَءِلٰهٌ مَّعَ اللهِ ۚ( Apakah disamping Allah ada tuhan (yang lain)?) Yakni apakah yang melakukan itu semua adalah tuhan selain Allah sehingga kalian menyembah tuhan itu, atau yang menciptakannya adalah Allah semata? Pendapat lain mengatakan maknanya adalah apakah Allah yang telah disebutkan beberapa penciptaan-Nya itu bersama sesembahan yang lain sehingga ia disandingkan dan dijadikan sekutu-Nya dalam ibadah? بَلْ هُمْ قَوْمٌ يَعْدِلُونَ(Bahkan (sebenarnya) mereka adalah orang-orang yang menyimpang (dari kebenaran)) Yakni menyimpang dari Allah menuju selain-Nya; atau menyimpang dari kebenaran menuju kebatilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Apakah sesembahan kalian yang lebih baik, atau Yang telah menciptakan langit dan bumi, juga Yang menurunkan air hujan untukmu dari langit. Kemudian Dia tumbuhkan dengan air hujan itu kebun-kebun yang berpemandangan indah. Kalian, para manusia sekali-kali tidak akan pernah mampu menumbuhkan pohon-pohon di kebun-kebun itu. Itu semua menunjukkan bahwa manusia itu lemah. Apakah benar dbahwa ada tuhan selan Allah, atau ada tuhan yang lain? Padahal Allah adalah pencipta segala yang ada? Bahkan sebenarnya mereka adalah orang-orang yang menyimpang dari kebenaran, yaitu pengesaan Allah, sehingga mereka menyekutukan Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau siapakah Dzat yang menciptakan langit dan bumi serta yang menurunkan air dari langit untuk kalian, lalu Kami menumbuhkan dengan air itu kebun-kebun} kebun-kebun {yang memiliki pemandangan inda} keindahan dan kecantikan {kalian tidak akan mampu menumbuhkan pohon-pohonnya. Apakah ada tuhan (lain) bersama Allah. Sebenarnya mereka adalah orang-orang yang menyimpang} yang menyimpang dari jalan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Maksudnya, atau siapakah yang telah menciptakan langit dan segala apa yang ada di dalamnya, berupa matahari, bulan, bintang-bintang, para malaikat dan bumi serta segala apa yang ada padanya seperti gunung, lautan, sungai, pohon-pohonan dan lain-lainnya, “dan yang menurunkan bagimu,” maksudnya, untuk kalian “air dari langit, lalu Kami tumbuhkan dengan air itu kebun-kebun,” maksudnya taman-taman, “yang berpemandangan indah,” maksudnya, indah dipandang karena banyak pohon-pohon, bermacam-macam, dan buah-buahannya yang baik. “Yang kamu sekali-kali tidak mampu menumbuhkan pohon-pohonnya.” Kalau saja bukan karunia Allah terhadap kalian, dengan menurunkan hujan (niscaya kalian tidak mampu menumbuhkan pohon-pohon). “Apakah di samping Allah ada sembahan (yang lain),” yang mampu melakukan perbuatan seperti itu hingga berhak disembah bersamaNya dan dipersekutukan denganNYa? “Bahkan (sebenarnya) mereka adalah orang-orang yang menyimpang,” dari Allah kepada selain Dia, dan mereka menyetarakanNya dengan selain Dia, padahal mereka mengetahui bahwa hanya Dia semata Pencipta alam bawah dan alam atas dan yang menurunkan rizki. 61. Maksudnya, apakah patung-patung dan berhala-berhala yang sangat lemah dari segala sisinya, yang tidak bisa berbuat apa pun, tidak bisa memberi rizki dan tidak bermanfaat itu lebih baik, atau Allah yang “telah menjadikan bumi sebagai tempat berdiam,” di diami oleh manusia, dan memungkinkan mereka untuk tinggal (menetap), bercocok tanam, membangun, pergi dan pulang, “dan yang menjadikan sungai-sungai dicelah-celahnya.” Maksudnya, menjadikan sungai-sungai di celah-celah bumi ini yang dapat digunakan oleh manusia untuk tanaman merekka, pohon-pohon mereka, minuman mereka dan hewan ternak mereka, “dan yang menjadikan pasak-pasak (gunung-gunung) untuknya.” Maksudnya, gunung-gunung yang menjadikan bumi jadi kokoh dan terpasak kuat, agar tidak binasa, dan gunung-gunung itu menjadi pasak baginya, agar tidak goncang, “dan menjadikan antara dua laut,” maksudnya, air asin dan air tawar “suatu pemisah,” yang mencegah keduanya bercampur, sehingga mengakibatkan hilangnya manfaat yang diinginkan dari keduanya. Akan tetapi Allah menjadikan di antara keduanya dinding pemisah dari tanah. Dia jadikan tempat mengalirnya sungai itu di bumi (darat), dijauhkan dari lautan, sehingga dengan begitu dapat dicapai maksud dan kemaslahatan keduanya. “Apakah di samping Allah ada sembahan (yang lain),” yang mampu melakukan itu semua sehingga laik kalau Allah dikesampingkan dan dipersekutukan dengannya? “Bahkan (sebenarnya) kebanyakan dari mereka tidak mengetahui,” sehingga mereka mempersekutukan Allah karena bertaklid buta kepada para pembesar mereka. Dan apabila tidak demikian, kalau mereka mengetahui dengan sebenar-benarnya, tentu mereka tidak mempersekutukan sesuatu apa pun denganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 60: Tanyalah kepada mereka wahai Nabi Allah : Siapa yang menciptakan langit dan bumi ? Dan siapa yang menurunkan dari langit air yang menumbuhkan perkebunan dan taman-taman yang enak dipandang ? Kalian mengetahui bahwa tidaklah mungkin seorangpun dari manusia untuk menumbuhkan pepohonan ini, apakah ada tuhan lain selain Allah yang melakukan demikian sampai-sampai kalian beribadah kepada selain-Nya, dan menyekutukan-Nya dalam peribadatan ?; Bahkan ketahuilah wahai Nabi Allah ﷺ bahwasanya mereka orang-orang musyrik menyamakan Allah dengan selain-Nya, dan menyerupakan Allah dengan selain-Nya dengan tanpa bukti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dan apa yang ada di dalamnya, seperti matahari, bulan, bintang dan malaikat. Dan apa yang ada di dalamnya, seperti gunung, lautan, sungai, pohon-pohon dan lain-lain. Pohonnya banyak dan bermacam-macam serta buahnya baik. Kalau bukan karena nikmat Allah kepadamu dengan menurunkan hujan. Bisa juga diartikan, “mereka adalah orang-orang yang menyekutukan Allah dengan selain-Nya.” Padahal mereka mengetahui, bahwa hanya Dia saja yang satu-satunya menciptakan alam semesta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 60",
    "description": "60. Setelah ayat-ayat yang lalu membicarakan tindakan Allah terhadap para pembangkang serta penyelamatan terhadapnya hamba-Nya yang taat, kini Allah mengajak untuk membandingkan antara ciptaan-Nya dan yang dilakukan oleh selain-Nya. Wahai nabi Muhammad, katakan kepada mereka, 'bukankah dia yang telah menciptakan langit dan bumi tanpa contoh sebelumnya dan yang menurunkan air hujan dari langit yang sangat bermanfaat untukmu, lalu kami tumbuhkan dengan air itu kebun-kebun yang berpemandangan indah' kamu sekali-kali tidak akan mampu menumbuhkan pohon-pohonnya yang beraneka ragam dengan jenis, warna dan buah yang berlainan seandainya Allah tidak menurun-kan hujan dari langit. Jika demikian, apakah di samping Allah ada tuhan yang lain' keserasian dalam ciptaan Allah menunjukkan bahwa tidak ada tuhan lain yang menyertai Allah. Bahkan, sebenarnya mereka yang menyekutukan Allah adalah orang-orang yang menyimpang dari kebenar-an, sebab telah mempersamakan Allah dengan lainnya dalam ibadah dan keagungan. 61. Tanyakan kepada mereka, 'bukankah dia yang telah menjadikan bumi datar, mantap dan tidak bergoncang sehingga layak sebagai tempat berdiam, yang menjadikan sungai-sungai di celah-celahnya, yaitu antara gunung-gunung yang tertancap di bumi, dan yang menjadikan gunung-gunung untuk mengokohkan nya, dan yang menjadikan suatu pemisah antara dua laut, yaitu laut yang asin dan sungai air tawar yang bermuara di laut, sehingga masing-masing tidak bercampur aduk' apakah di samping Allah ada tuhan lain yang melakukan itu sehingga kamu persekutukan dia dengannya' sungguh tidak ada, bahkan sebenarnya kebanyakan mereka tidak mau memanfaatkan ilmu kebenaran yang sesungguhnya, seolah-olah mereka tidak mengetahui."
  }
]