[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah menyembah kepada apa-apa yang kalian persekutukan itu lebih baik dari menyembah Yang menjadikan bagi kalian bumi sebagai tempat tinggal dan menjadikan di tengah-tengahnya sungai-sungai dan menjadikan gunung-gunung sebagai pengokoh baginya dan menjadikan pemisah antara dua laut yang berair tawar dan berair asin sehingga salah satunya tidak merusak yang lain? Apakah ada tuhan yang disembah bersama Allah yang melakukan itu sehingga kalian kemudian menyekutukannya bersama Allah dalam ibadah kalian? Bahkan kebanyakan dari kaum musyrikin tidak mengetahui besarnya keagungan Allah. mereka menyekutukan sesuatu denganNya karena sekedar ikut-ikutan dan merupakan tindakan kezhaliman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Atau siapakah yang telah menjadikan bumi stabil dan kokoh tak bergoncang bersama yang ada di atasnya, dan menjadikan di dalamnya sungai-sungai yang mengalir, menjadikan gunung-gunung yang teguh dan menjadikan antara dua lautan yang asin dan yang tawar pembatas yang mencegah tercampurnya laut asin dengan laut tawar sehingga tidak merusaknya yang tidak layak untuk diminum. Adakah sesembahan lagi selain Allah yang menjalankan semua itu? Bahkan sebagian besar dari mereka tidak mengetahui, seandainya mereka mengetahuinya niscaya mereka tidak akan menyekutukan Allah dengan salah satu dari para makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Hai Rasulullah tanyakanlah kepada mereka: “Manakah yang lebih baik, menyembah selain Allah atau menyembah Dzat yang telah menjadikan bumi layak untuk ditinggali dan menjadikannya diam dan kokoh -sebagaimana yang terlihat- padahal sesungguhnya ia bergerak dan melayang di angkasa? Dan yang telah menciptakan sungai-sungai di bumi dan mengalirkannya sesuai dengan kemaslahatan para hamba, menciptakan gunung-gunung yang kokoh dan menjulang tinggi sehingga bumi tidak berguncang, menciptakan pembatas di antara air tawar dan air asin sehingga keduanya tidak tercampur sesuai dengan hikmah-Nya yang menjadikan keduanya tetap ada sifat yang telah ditetapkan. Apakah terdapat Tuhan selain Allah yang ikut menciptakan ciptaan yang luar biasa itu sehingga kalian membuat sekutu dalam menyembah Allah.” Mayoritas orang musyrik itu tidak memahami betapa besarnya kekuasaan Allah sehingga mereka menjadikan selain Allah sebagai Sekutu dalam menyembah-Nya, dan mereka tidak mengetahui penderitaan yang akan mereka alami akibat kesyirikan mereka dan tidak memahami kebahagiaan jika mereka mengesakan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. أَمَّن جَعَلَ الْأَرْضَ قَرَارًا (Atau siapakah yang telah menjadikan bumi sebagai tempat berdiam) Yakni Allah menjadikan bumi seimbah sehingga layak untuk dihuni. وَجَعَلَ لَهَا رَوٰسِىَ (dan yang menjadikan gunung-gunung untuk (mengkokohkan)nya) Yakni gunung-gunung yang kokoh yang mencegah terjadinya goncangan sehingga menimpa manusia yang hidup di atasnya. وَجَعَلَ بَيْنَ الْبَحْرَيْنِ حَاجِزًا ۗ( dan menjadikan suatu pemisah antara dua laut?) Yakni laut air tawar dan laut air asin, keduanya tidak saling tercampur, yang satu tidak dapat merubah sifat yang lainnya dan tidak bisa saling menembus. Hal ini telah dijelaskan pada surat al-Furqan. أَءِلٰهٌ مَّعَ اللهِ ۚ( Apakah disamping Allah ada tuhan (yang lain)?) Yakni jika telah jelas bahwa demikian itu tidak dapat dilakukan kecuali oleh Allah, apakah di alam semesta ini terdapat tuhan lain yang mampu menciptakan seperti ciptaan-Nya? Lalu mengapa mereka menyekutukan-Nya dengan sesuatu yang tidak dapat memberi manfaat atau mudharat? بَلْ أَكْثَرُهُمْ لَا يَعْلَمُونَ(Bahkan (sebenarnya) kebanyakan dari mereka tidak mengetahui) Yakni tidak mengetahui keesaan Tuhan mereka dan kebesaran kuasa-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Apakah sesembahan kalian yang lebih baik, atau Dia Yang telah menjadikan bumi sebagai tempat berpijak manusia? Yang menjadikan sungai-sungai mengalir di celah-celah hamparan bumi, juga Yang menjadikan gunung-gunung untuk mengokohkan bumi. Dia Yang menjadikan suatu pemisah antara dua laut, sehingga airnya tidak bercampur sama sekali? Apakah masih ada Tuhan selain Allah, atau ada tuhan yang lain lagi? Namun/bahkan sebenarnya, kebanyakan dari mereka tidak mengetahui kebenaran, yaitu pengesaan Allah, mereka menyekutukan Allah dengan sesembahan lain"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Atau siapakah yang telah menjadikan bumi sebagai tempat berdiam} tempat tinggal {menjadikan di celah-celahnya} di celah-celahnya {sungai-sungai, menjadikan gunung-gunung untuknya} gunung-gunung untuk meneguhkannya {dan menjadikan di antara dua laut} yang tawar dan yang asin {suatu pemisah} penghalang yang mencegahnya bercampur {Apakah ada tuhan (lain) bersama Allah. Sebenarnya kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Maksudnya, apakah patung-patung dan berhala-berhala yang sangat lemah dari segala sisinya, yang tidak bisa berbuat apa pun, tidak bisa memberi rizki dan tidak bermanfaat itu lebih baik, atau Allah yang “telah menjadikan bumi sebagai tempat berdiam,” di diami oleh manusia, dan memungkinkan mereka untuk tinggal (menetap), bercocok tanam, membangun, pergi dan pulang, “dan yang menjadikan sungai-sungai dicelah-celahnya.” Maksudnya, menjadikan sungai-sungai di celah-celah bumi ini yang dapat digunakan oleh manusia untuk tanaman merekka, pohon-pohon mereka, minuman mereka dan hewan ternak mereka, “dan yang menjadikan pasak-pasak (gunung-gunung) untuknya.” Maksudnya, gunung-gunung yang menjadikan bumi jadi kokoh dan terpasak kuat, agar tidak binasa, dan gunung-gunung itu menjadi pasak baginya, agar tidak goncang, “dan menjadikan antara dua laut,” maksudnya, air asin dan air tawar “suatu pemisah,” yang mencegah keduanya bercampur, sehingga mengakibatkan hilangnya manfaat yang diinginkan dari keduanya. Akan tetapi Allah menjadikan di antara keduanya dinding pemisah dari tanah. Dia jadikan tempat mengalirnya sungai itu di bumi (darat), dijauhkan dari lautan, sehingga dengan begitu dapat dicapai maksud dan kemaslahatan keduanya. “Apakah di samping Allah ada sembahan (yang lain),” yang mampu melakukan itu semua sehingga laik kalau Allah dikesampingkan dan dipersekutukan dengannya? “Bahkan (sebenarnya) kebanyakan dari mereka tidak mengetahui,” sehingga mereka mempersekutukan Allah karena bertaklid buta kepada para pembesar mereka. Dan apabila tidak demikian, kalau mereka mengetahui dengan sebenar-benarnya, tentu mereka tidak mempersekutukan sesuatu apa pun denganNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 61: Tanyalah kepada mereka wahai Nabi Allah : Siapa yang mengkaruniakan bumi yang terhampar dan menghidupkan kalian untuk menetap di atanya ? Dan siapa yang menjadikan pertengahan bumi terdapat sungai-sungai yang dimanfaatkan oleh seorang hamba ? Siapa yang mengokohkan bumi dan menancapkan gunung-gunung agar bumi tidak berguncang dan bergetar ? Siapa yang menjadikan dua lautan tidak bercampur ketika bertemu ? Bahkan satu sama lain saling mempertahankan kekhususan rasanya ?! Apakah ada tuhan selain Allah yang melakukan demikian, dan disekutukan dalam penghambaan ? Ketahuilah wahai Nabi Allah bahwasanya kebanyakan mereka tidak mengetahui mentauhidkan kepada Rabb-Nya, tidak puli mensucikan-Nya dari apa yang tidak pantas bagi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Apakah berhala dan patung yang memiliki kekurangan dari berbagai sisi, tidak mampu berbuat, memberi rezeki, memberi manfaat dan tidak mampu menimpakan madharrat itu lebih baik? Manusia dapat berdiam di atasnya, membuat tempat tinggal, mengolah tanah, membangun dan lain-lain. Sehingga manusia memperoleh manfaat darinya. Mereka dapat menyirami tanaman dan pepohonan mereka, memberi minum hewan ternak mereka dan lain-lain. Yang dimaksud dua laut di sini ialah laut yang asin dan sungai yang besar yang bermuara ke laut. sungai yang tawar itu setelah sampai di muara tidak langsung menjadi asin. Yang melakukan hal itu sehingga Allah disekutukan. Sehingga mereka menyekutukan Allah karena ikut-ikutan. Padahal jika mereka mengetahui dengan sebenarnya, maka mereka tidak akan menyekutukan-Nya dengan sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 61",
    "description": "Tanyakan kepada mereka, 'bukankah dia yang telah menjadikan bumi datar, mantap dan tidak bergoncang sehingga layak sebagai tempat berdiam, yang menjadikan sungai-sungai di celah-celahnya, yaitu antara gunung-gunung yang tertancap di bumi, dan yang menjadikan gunung-gunung untuk mengokohkan nya, dan yang menjadikan suatu pemisah antara dua laut, yaitu laut yang asin dan sungai air tawar yang bermuara di laut, sehingga masing-masing tidak bercampur aduk' apakah di samping Allah ada tuhan lain yang melakukan itu sehingga kamu persekutukan dia dengannya' sungguh tidak ada, bahkan sebenarnya kebanyakan mereka tidak mau memanfaatkan ilmu kebenaran yang sesungguhnya, seolah-olah mereka tidak mengetahui. 62. Tanyakan pula kepada mereka, 'bukankah dia Allah yang memperkenankan doa orang yang terpaksa, yakni berada dalam kesulitan yang mencekam apabila dia berdoa kepada-Nya' dan bukankah dia yang kuasa menghilangkan kesusahan yang menimpa siapa pun dan yang kuasa menjadikan kamu wahai manusia sebagai khalifah, penerus gene-rasi sebelum kamu di bumi' apakah ada yang mampu melakukan hal serupa itu' pasti tidak ada. Jika demikian, apakah di samping Allah ada tuhan yang lain' sedikit sekali nikmat Allah yang kamu ingat."
  }
]