[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah penyembahan kepada apa-apa yang kalian persekutukan dengan Allah itu lebih baik dari Dzat Yang memandu kalian dalam kegelapan di daratan dan lautan ketika kalian tersesat jalan lalu jalan-jalan menjadi gelap bagi kalian, dan juga Yang menghembuskan angin-angin sebagai pemberi kabar gembira dengan apa-apa yang Allah akan merahmati hamba-hambaNya seperti hujan yang menghidupkan tanah yang telah tandus? Apakah ada tuhan bersama Allah yang melakukan sesuatu dari hal tersebut, lalu kalian menyerunya selain menyeru Allah? Allah Mahabersih dan Mahasuci dari apa yang mereka persekutukan denganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Atau siapakah yang memberi kalian petunjuk dalam kegelapan di daratan dan kegelapan di lautan dengan tanda-tanda dan bintang-bintang yang dipasang untuk kalian, dan siapa yang mengirimkan angin sebagai kabar gembira menjelang turunnya hujan yang dengannya Allah memberi rahmat kepada hamba-hamba-Nya? Adakah sesembahan yang berhak disembah bersama Allah yang menjalankan dan menakdirkan itu semua? Mahasuci Allah dan Mahabersih dari para makhluk yang mereka persekutukan dengan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Hai Rasulallah, tanyakanlah kepada mereka: Siapakah yang dapat memberi mereka petunjuk menuju jalan yang benar ketika mereka tersesat dalam kegelapan di darat maupun di laut? Allah telah menciptakan bagi mereka bintang-bintang yang teratur agar dapat menjadi petunjuk bagi orang-orang yang dalam perjalanan, dan menetapkan pemahaman bagi manusia agar dapat mengenali jalan yang benar. Dan tanyakanlah kepada mereka: Siapa yang mengirim angin yang membawa kabar gembira yang menghenbuskan awan-awan yang menurunkan hujan bagi hamba-hamba yang tertimpa kekeringan, dan menghidupkan tanah yang tandus. Apakah terdapat tuhan selain Allah yang ikut menciptakan hal itu? Maha Suci Allah Yang Maha Esa dari memiliki sekutu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أَمَّن يَهْدِيكُمْ فِى ظُلُمٰتِ الْبَرِّ وَالْبَحْرِ (Atau siapakah yang memimpin kamu dalam kegelapan di dataran dan lautan) Yakni Allah menuntun kalian pada malam-malam gelap gulita ketika kalian bepergian di tengah-tengah padang pasir yang tidak memiliki tanda penunjuk arah atau di tengah-tengah lautan yang penuh gelombang. وَمَن يُرْسِلُ الرِّيٰحَ بُشْرًۢا بَيْنَ يَدَىْ رَحْمَتِهِۦٓ ۗ( dan siapa (pula)kah yang mendatangkan angin sebagai kabar gembira sebelum (kedatangan) rahmat-Nya?) Yakni menghembuskan angin sebelum turun hujan sebagai tanda turunnya hujan yang akan datang sebentar lagi. أَءِلٰهٌ مَّعَ اللهِ ۚ( Apakah disamping Allah ada tuhan (yang lain)?) Yang melakukan hal itu dan menciptakannya? تَعٰلَى اللهُ عَمَّا يُشْرِكُونَ (Maha Tinggi Allah terhadap apa yang mereka persekutukan (dengan-Nya)) Yakni Maha Suci Allah dari memiliki sekutu yang kalian anggap itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Apakah sesembahan kalian yang lebih baik, atau Dia Yang menuntun kalian dalam kegelapan ketika berada di dataran maupun lautan ketika kalian tersesat pada perjalanan kalian dengan bintang-bintang? Siapa pulakah yang mendatangkan angin sebagai kabar gembira sebelum hujan turun? Apakah disamping Allah ada tuhan yang lain? Sekali-kali tidak. Maha Tinggi Allah terhadap apa yang mereka persekutukan dengan-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau siapakah yang memberi petunjuk kalian} membimbing kalian {dalam kegelapan darat dan laut serta yang mengirimkan angin sebagai kabar gembira sebelum (kedatangan) rahmatNya. Apakah ada tuhan (lain) bersama Allah. Maha tinggi Allah dari apa yang mereka sekutukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Maksudnya, siapa yang memberi kalian bimbingan pada saat kalian berada dalam kegelapan malam dan kegelapan lautan di mana tidak ada pemberi petunjuk sama sekali dan tidak pula ada tanda-tanda yang dapat dilihat, dan tidak ada jalan menuju keselamatan kecuali (jalan) bimbinganNya kepada kalian dan (sebab-sebab) yang dengannya kalian bisa mendapatkan arah petunjuk. “Dan siapa pulakah yang mendatangkan angin sebagai kabar gembira sebelum (kedatangan) rahmatNya?” maksudnya, (siapa yang mendatangkan angin) sebelum kedatangan hujan. Dia mendatangkannya lalu menggerakkan awan, kemudian menyatukannya, kemudian menggabungkannya, kemudian mengawinkannya, kemudian mencurahkannya (dalam bentuk hujan), hingga manusia merasa gembira karenanya sebelum hujan itu turun. “Apakah di samping Allah ada sembahan (yang lain),” yang mampu melakukan itu semua?! Atau hanya Dia semata yang melakukannya?! Lalu kenapa kalian mempersekutukan sesuatu denganNya dan kalian menyembah selain Dia? “Mahatinggi Allah terhadap apa yang mereka persekutukan (denganNya).” Mahatinggi Allah, Mahasuci lagi Mahaqudus dari perbuatan syirik kalian dan dari penyetaraan kalian terhadapNya dengan yang lain.."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 63: Tanyalah kepada mereka wahai Nabi Allah : Siapa yang menunjuki kalian dan mengeluarkan kalian dari kegelapan di darat maupun di laut ? Siapa yang mengutus angin sebelum turunnya hujan secara langsung kemudian bergembiralah seorang hamba ? Sucikanlah Allah oleh kalian dari kesyirikan yang dilakukan mereka orang-orang musyrik yang menyembah tuhan-tuhan lain; Dialah Allah yang maha esa, yang tunggal, yang tidak dilahirkan dan melahirkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang sebelumnya tidak ada tanda dan rambu-rambu serta sarana agar dapat selamat kecuali setelah Dia memberikan petunjuk kepada kamu, memudahkan jalan serta menyiapkan segala sebab yang dengannya kamu mendapatkan petunjuk. Misalnya diadakan-Nya bintang-bintang di malam hari dan tanda batas bumi di siang hari. Allah melepaskan angin itu, lalu menggerakkan awan dan menyatukannya lalu mengawinkannya, setelah itu turunlah air hujan, sehingga manusia merasa gembira sebelum hujan turun. Yang dimaksud dengan rahmat Allah di sini ialah air hujan yang menyebabkan suburnya tumbuh-tumbuhan. Yang melakukan hal itu, atau Dia saja yang sendiri melakukannya? Jika kamu mengetahui bahwa Dia sendiri yang melakukan semua itu, maka mengapa kamu menyekutukan-Nya dengan sesuatu dan menyembah selain-Nya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 63",
    "description": "Tanyakan pula kepada mereka, wahai rasul, 'bukankah dia Allah yang memberi petunjuk kepada kamu dalam perjalanan di tengah kegelapan di daratan dan lautan melalui bintang-bintang, atau arah angin, atau tanda-tanda lainnya' dan bukankah dia yang mendatangkan aneka angin sebagai kabar gembira sebelum kedatangan hujan sebagai rahmat-Nya yang akan menghidupkan tanah dan tumbuhan' apakah di samping Allah ada tuhan lain yang membuat itu sehingga kamu menyembah dan memohon kepada selain-Nya' mahatinggi dan mahasuci Allah terhadap apa yang mereka persekutukan. 64. Selain bukti-bukti yang terhampar di alam raya, di langit dan di bumi, tanyakan pula kepada mereka tentang awal dan akhir perjalanan hidup manusia serta aneka anugerah-Nya. Bukankah dia yang memulai penciptaan semua makhluk, termasukmanusia, kemudian setelah manusia hidup di pentas bumi lalu mati dia mengulanginya lagi dengan menghidupkannya kembali setelah hancur dan binasa' dan bukankah dia yang memberikan rezeki kepadamu dari langit dengan menurunkan hujan dan dari bumi dengan menumbuhkan tanaman' apakah di samping Allah ada tuhan lain yang melakukan itu' pasti tidak ada. Kalaupun mereka berkata ada, maka katakanlah, nabi Muhammad, 'jika ada tuhan selain Allah maka kemukakanlah alasan-alasan yang menjadi bukti pendukung kebenaranmu, jika kamu menganggap dirimu orang yang berkata benar. Sekali-kali kamu tidak akan dapat mendatangkan itu. '."
  }
]