[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tanyakanlah kepada mereka, “Siapakah yang menciptakan makhluk dan kemudian membinasakannya ketika Dia menghendakinya kemudian mengulang penciptaannya kembali? Dan siapakah yang memberikan rizki kepada kalian dari langit dengan menurunkan hujan dan dari bumi dengan ditumbuhkannya tanaman dan lainnya? Apakah ada tuhan selain Allah yang melakukan itu?” katakanlah, “Datangkanlah hujjah kalian bila kalian berkata jujur dalam klaim bahwa sesungguhnya Allah memiliki sekutu dalam kerajaan dan ibadah kepadanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Atau siapakah yang memulai penciptaan di dalam rahim, fase demi fase, kemudian menghidupkannya setelah sebelumnya mematikannya, dan siapakah yang memberi kalian rezeki dari langit dengan hujan yang diturunkan dari arah langit dan memberi kalian rezeki dari bumi dengan tumbuh-tumbuhan yang ditumbuhkan padanya? Adakah sesembahan yang berhak di sembah bersama Allah yang menjalankan dan menakdirkan itu semua? Katakan -wahai Rasul- kepada orang-orang musyrik, “Tunjukkan hujah-hujah kalian atas kesyirikan yang kalian perbuat jika kalian adalah orang-orang yang benar berdasarkan pengakuan kalian bahwa kalian berada dalam kebenaran.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Hai Rasulullah, tanyakanlah kepada mereka: “Siapa yang menciptakan makhluk pertama kali tanpa ada yang menyerupai ciptaan itu sebelumnya, kemudian membangkitkan makhluk itu kembali setelah kematiannya dalam bentuk seperti ketika ia belum mati? Dan siapa yang menurunkan hujan dari langit bagi kalian yang menjadi sumber rezeki kalian; dan siapa yang menumbuhkan berbagai macam tumbuhan dan buah-buahan di bumi bagi kalian? Apakah terdapat tuhan selain Allah yang ikut melakukan hal itu?” Hai Rasulullah, katakanlah kepada mereka: “Datangkanlah hujjah kalian jika kalian menganggap diri kalian benar dalam mengangkat sekutu-sekutu bagi Allah dalam menyembah-Nya; dan jika memang ada yang dapat menciptakan segala kenikmatan tersebut selain Allah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. أَمَّن يَبْدَؤُا۟ الْخَلْقَ ثُمَّ يُعِيدُهُۥ (u siapakah yang menciptakan (manusia dari permulaannya), kemudian mengulanginya (lagi)) Dahulu mereka percaya bahwa Allah adalah Sang Pencipta, dan Allah mengharuskan mereka untuk beriman kepada kuasa-Nya dalam membangkitkan mereka kembali. وَمَن يَرْزُقُكُم مِّنَ السَّمَآءِ وَالْأَرْضِ ۗ( dan siapa (pula) yang memberikan rezeki kepadamu dari langit dan bumi?) Dengan hujan, tanaman, dan hewan ternak. أَءِلٰهٌ مَّعَ اللهِ ۚ( Apakah disamping Allah ada tuhan (yang lain)?) Apakah disamping Allah ada tuhan lain yang menciptakan suatu hal tersebut sehingga kalian menjadikannya sebagai sekutu-Nya? قُلْ هَاتُوا۟ بُرْهٰنَكُمْ(Katakanlah: “Unjukkanlah bukti kebenaranmu) Seandainya kalian benar dalam ucapan kalian bahwa Allah memiliki sekutu yang mampu menciptakan seperti ciptaan-Nya niscaya kalian dapat mendatangkan bukti tentang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Apakah sesembahan kalian yang lebih baik, atau Dia Yang menciptakan manusia kemudian Dia mematikan mereka kemudian menghidupkan mereka kembali pada hari kiamat. Siapa pula Yang memberikan rezeki baik kepadamu dari langit lewat hujan? Juga dari bumi dengan menumbuhkan tumbuh-tumbuhan, buah-buahan dan berbagai binatang ternak. Apakah disamping Allah ada tuhan yang lain yang mampu menciptakan dan memberi rezeki? Katakanlah kepada orang-orang musyrik itu wahai Nabi: \"Tunjukkanlah bukti kebenaranmu, jika kamu memang orang-orang yang benar\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Atau siapakah yang memulai} menciptakan {suatu ciptaan kemudian mengulanginya} menghidupkannya lagi setelah mematikannya {dan yang memberi rezeki kalian dari langit dan bumi. Apakah ada tuhan (lain) bersama Allah. Katakanlah,“Datangkanlah bukti kalian} bukti kalian bahwa Allah memiliki sekutu {jika kalian adalah orang-orang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Maksudnya, siapakah yang memulai penciptaan dan menjadikan makhluk-makhluk ini, dan memulai penciptaannya kemudian mengulangi penciptaan pada Hari KIamat dan kebangkitan? “Dan siapa (pula) yang memberikan rizki kepadamu dari langit dan bumi,” berupa hujan dan tumbuh-tumbuhan?! “Apakah di samping Allah ada sembahan (yang lain)?” yang melakukannya dan kuasa atasnya. “Katakanlah,’ tunjukkanlah bukti kebenaranmu’.” Maksudnya, argumen dan dallil kalian yang membuktikan kebenaran apa yang kalian katakan. “JIka kamu orang-orang yang benar.” Kalau tidak, maka dengan asumsi bahwa kalian mengatakan, “Sesungguhnya patung-patung memiliki persekutuan denganNya dalam hal itu,” maka hal itu hanya klaim semata yang kalian bisa membenarkannya dengan bukti. Kalau tidak, maka ketahuilah bahwa kalian telah berbuat kepalsuan, kalian tidak mempunyai argument. Maka kembalilah kepada dalil-dalil yang pasti dan argument-argumen yang meyakinkan yang membuktikan bahwa Allah semata yang melakukan semua itu, dan hanya Dia semata yang berhak mendapat curahan segala bentuk ibadah dan pengabdian kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 64: Tanyalah kepada mereka wahai Nabi Allah : Siapa yang memulai dalam penciptaan makhluk dan mengadakan mereka dari ketiadaan ? Siapa yang mematikan dan mengakhiri dari kehidupan mereka ? Siapa yang mengembalikan seluruh makhluk pada kali yang lain ? Siapa yang memberikan rezeki dengna menurunkan air hujan dari langit ? Dan juga menumbuhkan ladang di bumi ? Apakah ada tuhan lain yang bersekutu dengan Allah yang melakukan demikian sampai-sampai kalian menyembah pada selain Allah, dan menyekutukan Allah dalam peribadatan ? Maka jika mereka menjawab atau diam wahai Nabi Allah, maka katakan kepada mereka : Berikan bukti-bukti kalian, hujjah kalian atas apa yang kalian klaim yang bahwasanya Allah ada tuhan lain jika kalian benar-benar jujur. Dan seluruh pertanyaan ini yang terulang-ulang pada kata “Siapakah” maksudnya adalah sebuah ketetapan dan ketetapan atas apa yang orang-orang beriman meyakini atas Sang Pencipta (Allah), dan sebagai celaan bagi orang-orang musyrik yang menyimpang dari petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengulangi lagi menciptakan pada saat mereka dibangkitkan. Dengan turunnya hujan. Dengan tumbuhnya pepohonan sebagai rezeki untukmu. Yakni tidak ada yang melakukan semua yang disebutkan itu selain Allah dan tidak ada tuhan yang berhak disembah selain-Nya. Bahwa di samping Allah ada pula tuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 64",
    "description": "Selain bukti-bukti yang terhampar di alam raya, di langit dan di bumi, tanyakan pula kepada mereka tentang awal dan akhir perjalanan hidup manusia serta aneka anugerah-Nya. Bukankah dia yang memulai penciptaan semua makhluk, termasukmanusia, kemudian setelah manusia hidup di pentas bumi lalu mati dia mengulanginya lagi dengan menghidupkannya kembali setelah hancur dan binasa' dan bukankah dia yang memberikan rezeki kepadamu dari langit dengan menurunkan hujan dan dari bumi dengan menumbuhkan tanaman' apakah di samping Allah ada tuhan lain yang melakukan itu' pasti tidak ada. Kalaupun mereka berkata ada, maka katakanlah, nabi Muhammad, 'jika ada tuhan selain Allah maka kemukakanlah alasan-alasan yang menjadi bukti pendukung kebenaranmu, jika kamu menganggap dirimu orang yang berkata benar. Sekali-kali kamu tidak akan dapat mendatangkan itu. '64. Selain bukti-bukti yang terhampar di alam raya, di langit dan di bumi, tanyakan pula kepada mereka tentang awal dan akhir perjalanan hidup manusia serta aneka anugerah-Nya. ' 64. '65. Banyak orang beranggapan bahwa ada orang yang dapat mengetahui hal ghaib, termasuk waktu kedatangan kiamat. Katakanlah wahai nabi Muhammad, 'tidak ada sesuatu dan siapa pun di langit dan di bumi yang mengetahui perkara yang gaib, kecuali Allah. Dan mereka tidak merasakan apalagi mengetahui kapan mereka akan dibangkitkan dari alam barzakh"
  }
]