[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "65-66. Katakanlah (wahai Rasul) kepada mereka, bahwa tidak ada seorang pun di langit dan di bumi yang mengetahui perkara-perkara ghaib yang hanya khusus diketahui oleh Allah semata. Dan mereka tidak tahu kapan akan dibangkitkan dari kubur-kubur mereka ketika Hari Kiamat datang. Bahkan ilmu mereka hanya akan menjadi sempurna di alam akhirat, lalu mereka meyakini kampung akhirat dan segala sesuatu yang terjadi disana berupa kengerian-kengerian ketika mereka menyaksikannya secara langsung, sedangkan di dunia mereka dalam keraguan terhadapnya, bahkan mata hati mereka telah buta terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Katakan -wahai Rasul-, “Tidak ada yang mengetahui hal yang gaib, dari para Malaikat yang ada di langit maupun manusia yang ada di bumi, akan tetapi hanya Allah semata yang mengetahuinya. Dan semua yang ada di langit dan yang ada di bumi tidak mengetahui kapan mereka akan dibangkitkan untuk menerima pembalasan, kecuali Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Hai Rasulullah, katakanlah kepada mereka: Tidak ada yang di langit dan di bumi yang mengetahui ilmu ghaib selain Allah, hanya Allah yang mengetahui detailnya. Dan mereka tidak mengetahui kapan mereka akan dibangkitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَمَا يَشْعُرُونَ أَيَّانَ يُبْعَثُونَ(dan mereka tidak mengetahui bila mereka akan dibangkitkan) Yakni mereka tidak mengetahui kapan mereka akan dibangkitkan dari kubur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Katakanlah wahai Nabi: \"Tidak ada seorangpun di langit dan di bumi yang mengetahui perkara ghaib, kecuali Allah, Dia lah Yang Maha Tahu.\", dan mereka tidak mengetahui bila mereka akan dibangkitkan dari kubur mereka kemudian dihisab dan diberi balasan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Tidak ada siapa pun di langit dan di bumi yang mengetahui sesuatu yang gaib selain Allah. Dan mereka tidak menyadari} mereka tidak mengetahui {kapan} kapan {mereka akan dibangkitkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Allah mengabarkan bahwasanya hanya Dia Yang esa yang mengetahui rahasia langit dan bumi, sebagaimana dijelaskan dalam FirmanNya, \"Dan pada sisi Allah-lah kunci-kunci semua yang gaib; tak ada yang mengetahuinya kecuali Dia sendiri, dan Dia mengetahui apa yang di daratan dan di lautan, dan tiada sehelai daun pun yang gugur melainkan Dia mengetahuinya (pula), dan tidak jatuh sebutir biji pun dalam kegelapan bumi dan tidak sesuatu yang basah atau yang kering, melainkan tertulis dalam kitab yang nyata (Lohmahfuz).\" (Al-An’Am:59), dan juga seperti disebutkan dalam FirmanNya yang lain, \"Sesungguhnya Allah, hanya pada sisi-Nya sajalah pengetahuan tentang Hari Kiamat; dan Dia-lah Yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tiada seorang pun yang dapat mengetahui (dengan pasti) apa yang akan diusahakannya besok. Dan tiada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal.\" (Luqman:34). Hal-hal yang ghaib seperti ini dan yang serupa dengannya, hanya Allah yang mengetahuinya. Ia tidak diketahui oleh seorang malaikat, yang paling dekat (kepada Allah) dan tidak pula oleh seorang nabi yang diutus. Jika hanya Dia semata yang mengetahui hal-hal seperti itu, dan pengetahuanNya meliputi seluruh apa yang tersembunyi, tidak Nampak dan samar, maka ibadah hanya berhak dipersembahkan kepadaNya semata. Kemudian Allah menginformasikan tentang betapa rapuhnya pengetahuan orang-orang yang mendustakan tentang akhirat, seraya beralih dari sesuatu menuju kepada sesuatu lain yang lebih (dalam) daripadanya, seraya berfirman, “Dan mereka tidak menyadari,” maksudnya, mereka tidak mengetahui, “kapan mereka akan dibangkitkan.” Maksudnya, kapan kebangkitan, dan kehidupan kembali dari kubur. Maka dari itu mereka tidak siap."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 65: Kemudian katakan kepada mereka wahai Nabi Allah : Tak seorangpun di antara kalian mengetahui yang ghaib di langit maupun di bumi kecuali hanyalah Allah saja, Dialah yang maha suci yang khusus memiliki pengetahuian ghaib tersebut, tidak dengan selain-Nya. Tidaklah manusia juga mengetahui kapan dibangkitkan dari kubur mereka untuk dibalas dan dihisab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya, mereka bertanya kepada Nabi Muhammad shallallahu 'alaihi wa sallam tentang kapan terjadinya kiamat. Allah Subhaanahu wa Ta'aala sendiri yang mengetahui hal gaib di langit dan di bumi. Contohnya adalah seperti yang disebutkan dalam surah Luqman ayat 34, yaitu: “Sesungguhnya Allah, hanya pada sisi-Nya sajalah pengetahuan tentang hari Kiamat; dan Dia-lah yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. dan tidak ada seorang pun yang dapat mengetahui (dengan pasti) apa yang akan diusahakannya besok, dan tidak ada seorang pun yang dapat mengetahui di bumi mana dia akan mati. Sesungguhnya Allah Maha mengetahui lagi Maha Mengenal.” Gaib seperti ini (gaib mutlak) tidak ada yang mengetahuinya kecuali Allah, malaikat yang didekatkan maupun rasul tidak mengetahuinya. Jika hanya Allah yang mengetahui hal itu, yang ilmu-Nya meliputi segala rahasia dan yang tersembunyi, maka Dialah yang berhak diibadahi. Maka segala puji bagi Allah yang menjadikan kita sebagai orang-orang muslim, yang menyembah hanya kepada Allah; Tuhan yang sempurna sifat-Nya. Semoga Dia menjadikan kita istiqamah di atas Islam sampai akhir hayat, Allahumma aamin. Selanjutnya Allah Subhaanahu wa Ta'aala memberitahukan tentang lemahnya pengetahuan orang-orang yang mendustakan itu terhadap akhirat, berpindah dari sesuatu yang sedang menjadi yang lebih jauh lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 65",
    "description": "Banyak orang beranggapan bahwa ada orang yang dapat mengetahui hal ghaib, termasuk waktu kedatangan kiamat. Katakanlah wahai nabi Muhammad, 'tidak ada sesuatu dan siapa pun di langit dan di bumi yang mengetahui perkara yang gaib, kecuali Allah. Dan mereka tidak merasakan apalagi mengetahui kapan mereka akan dibangkitkan dari alam barzakh. '66. Bahkan sebenarnya pengetahuan mereka, yakni kaum musyrik, tentang akhirat tidak sampai ke sana. Bahkan mereka ragu-ragu tentangnya, yaitu akhirat. Bahkan mereka adalah orang-orang yang buta tentang kebenaran itu, karena tidak mau berusaha mencari alasan-alasan yang membenarkan adanya hari akhir. Hal itu disebabkan oleh mata hati mereka yang telah dirusak oleh kesesatan."
  }
]