[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "65-66. Katakanlah (wahai Rasul) kepada mereka, bahwa tidak ada seorang pun di langit dan di bumi yang mengetahui perkara-perkara ghaib yang hanya khusus diketahui oleh Allah semata. Dan mereka tidak tahu kapan akan dibangkitkan dari kubur-kubur mereka ketika Hari Kiamat datang. Bahkan ilmu mereka hanya akan menjadi sempurna di alam akhirat, lalu mereka meyakini kampung akhirat dan segala sesuatu yang terjadi disana berupa kengerian-kengerian ketika mereka menyaksikannya secara langsung, sedangkan di dunia mereka dalam keraguan terhadapnya, bahkan mata hati mereka telah buta terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Akan tetapi pengetahuan mereka tentang Akhirat menjadi sempurna setelah mereka melihatnya dengan mata kepala sendiri setelah sebelumnya para Rasul mengabarkan kepada mereka tentang Akhirat, dan Akhirat itu adalah gaib, sehingga mereka mengingkarinya karena mereka tidak melihatnya. Mereka berada dalam keraguan dan kebimbangan terhadap kehidupan Akhirat saat hidup mereka di dunia. Mata dan hati mereka telah buta terhadap Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Mereka itu berada dalam ketidaktahuan tentang terjadinya kehidupan akhirat dan mereka tidak memiliki ilmu tentang peristiwa-peristiwa besar yang ada di dalamnya; hingga ketika mereka melihatnya saat hari kiamat dan menyaksikan segala yang diancamkan kepada mereka, maka mereka menjadi tahu apa yang sebelumnya tidak mereka ketahui dan mereka ingkari saat berada di dunia; dahulu mereka dalam keraguan, bahkan penglihatan dan hati mereka buta ketika di dunia sehingga tidak dapat memahami sedikitpun tanda-tanda adanya kehidupan akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. بَلِ ادّٰرَكَ عِلْمُهُمْ فِى الْاٰخِرَةِ ۚ (Sebenarnya pengetahuan mereka tentang akhirat tidak sampai (kesana) malahan mereka ragu-ragu tentang akhirat itu) Yakni mereka akan benar-benar mengetahui ketika mereka telah di akhirat, sebab mereka telah melihat sendiri segala apa yang diancamkan kepada mereka; namun ketika itu pengetahuan mereka sudah tidak bermanfaat lagi karena mereka adalah orang-orang yang mendustakannya di dunia. بل هم في شك منها (malahan mereka ragu-ragu tentang akhirat itu) Yakni tetapi mereka di dunia berada dalam keraguan tentang akhirat. Kemudian Allah berpindah menyebutkan hal yang lebih parah dari hal ini dengan firman-Nya: بَلْ هُم مِّنْهَا عَمُونَ بَلْ هُم مِّنْهَا عَمُونَ (lebih-lebih lagi mereka buta daripadanya) Sehingga mereka tidak memahami sama sekali bukti-buktinya karena masalah pada penglihatan mereka yang merupakan sumber pemahaman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Sebenarnya pengetahuan mereka tentang akhirat tidak sampai (kesana) malahan mereka ragu-ragu tentang akhirat itu, lebih-lebih lagi hati mereka buta atas urusan akhirat. Mereka tidak bisa mengambil pelajaran dari berbagai bukti akhirat yang ada sebab tidak normalnya penglihatan mereka yang mereka gunakan untuk memahami sesuatu. Bal adalah huruf yang berfungsi untuk berpindah dari satu keadaan menuju keadaan lain. Maksudnya adalah ilmu, bukti dan hujjah mereka tidak cukup/tidak sampai untuk memahami bahwa akhirat itu ada tanpa suatu keraguan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bahkan pengetahuan mereka tentang akhirat tidak sampai} apakah pengetahuan mereka sampai tentang akhirat sehingga mereka bertanya tentang waktu datangnya {Bahkan mereka dalam keraguan tentangnya. Bahkan mereka buta tentang itu} dalam kebutaan dan ketidak tahuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. “Sebenarnya pengetahuan mereka tentang akhirat tidak sampai (ke sana).” Maksudnya, sebenarnya pengetahuan mereka sangat lemah dan sangat kurang, dan belum menjadi keyakinan, tidak pula menjadi pengetahuan yang sampai ke dalam hati. Ini adalah tingkatan pengetahuan yang paling dangkal dan paling rendah, lemah dan rapuh. Bahkan mereka tidak mempunyai ilmu walaupun sedikit. Dan sesungguhnya “malahan mereka ragu-ragu tentangnya” maksudnya, (ragu-ragu) tentang akhirat itu, dan dengan adanya keraguan itu ilmu (pengetahuan) menjadi sirna, sebab ilmu (pengetahuan) itu dengan semua tingkatannya tidak bisa bersatu dengan keraguan, “lebih-lebih lagi mereka darinya,” maksudnya, dari akhirat, “buta.” Mata hati mereka telah buta darinya, dan di dalam hati mereka tidak ada keyakinan kepada kejadiannya, atau kemungkinan akan terjadi, bahkan mereka mengingkarinya dan menganggapnya tidak mengkin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 66: Allah mengabarkan bahwasanya orang-orang kafir memahami dan mengikuti keilmuan mereka yang bahwasanya di sana tidak ada akhirat dan juga kebangkitan setelah kematian; Bahkan mereka meragukan dan kebingungan akan hal tersebut. Dan telah berulang pengingkaran mereka akan kebangkitan sampai-sampai mereka menetapkan atas diri mereka bahwa mereka tidak akan dibangkitkan, bahkan lebih besar (kekufurannya) akan hal itu dengan menjadi buta akan sabda Rasulullah ﷺ, dan juga mendustakannya serta mengingkari faktanya; Mereka berkata tentang akhirat dengan olok-olok : “Maukah kamu kami tunjukkan kepadamu seorang laki-laki yang mengabarkan kepadamu bahwa apabila tubuhmu telah hancur sehancur-hancurnya, sungguh kamu akan dikembalikan dalam rupa yang baru ?” (QS. Saba : 7)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pengetahuan mereka lemah, sedikit, dan tidak yakin serta tidak masuk sampai ke hati. Ini merupakan tingkatan ilmu yang paling rendah, bahkan mereka tidak memiliki ilmu sama sekali. Oleh karena itu, pada lanjutan ayatnya dikatakan, bahwa mereka ragu-ragu tentang akhirat itu. Sedangkan keragu-raguan menyingkirkan pengetahuan, karena ilmu (pengetahuan) dengan semua tingkatannya tidak berkumpul bersama keragu-raguan. Tidak terlintas di hati mereka akan terjadi atau kemungkinan untuk terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 66",
    "description": "Bahkan sebenarnya pengetahuan mereka, yakni kaum musyrik, tentang akhirat tidak sampai ke sana. Bahkan mereka ragu-ragu tentangnya, yaitu akhirat. Bahkan mereka adalah orang-orang yang buta tentang kebenaran itu, karena tidak mau berusaha mencari alasan-alasan yang membenarkan adanya hari akhir. Hal itu disebabkan oleh mata hati mereka yang telah dirusak oleh kesesatan. 67. Dan keraguan serta kebutaan hati orang-orang yang kafir yang mengingkari hari kebangkitan itu mendorong mereka untuk berkata, 'setelah jasad kita hancur lebur menjadi tanah dan begitu pula jasad nenek moyang kita yang sudah sekian lama meninggalkan dunia ini, apakah benar kita akan dikeluarkan dari kubur untuk hidup kembali sebagaimana sebelumnya'."
  }
]