[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengingkari keesaan Allah berkata, “Apakah kami dan nenek moyang kami akan dibangkitkan dalam keadaan hidup seperti bentuk kami sekarang setelah kematian kami sesudah kami berubah menjadi tanah?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Dan orang-orang yang kafir berkata dengan penuh pengingkaran, “Apakah bila kami telah mati dan telah menjadi debu, mungkinkah kami dibangkitkan kembali?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Orang-orang kafir yang mengingkari hari kebangkitan mulai menggaungkan kepercayaan mereka: “Jika kami dan nenek moyang kami mati dan jasad kami telah menjadi tanah, apakah kami akan dihidupkan kembali seperti ketika kami sebelum mati dan keluar dari kubur kami? Sungguh itu adalah kebangkitan yang mustahil.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Orang-orang yang kafir kepada Allah dan hari kiamat berkata: \"Apakah setelah kami menjadi tanah dan begitu pula bapak-bapak kami; apakah sesungguhnya kami akan dikeluarkan/dihidupkan lagi dari kubur untuk dihisab dan diberi balasan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang ingkar berkata,“Apakah ketika kami sudah menjadi tanah dan juga nenek moyang kami akan dikeluarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Maka dari itu Allah berfirman, “Berkatalah orang-orang yang kafir, ‘Apakah setelah kita menjadi tanah dan (begittu pula) bapak-bapak kita; apakah sesungguhnya kita akan dikeluarkan?” maksudnya, ini sangat tidak mungkin. Mereka menganalogikan kekuasaan Dzat Yang Mahasempurna kekuasaanNya dengan kekuasaan mereka yang sangat lemah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 67: Berkata mereka yang mengingkari ayat-ayat Allah dan kufur dengan hari kebangkitan dan hari akhir : Apakah kami akan dibangkitkan, begitu juga dengan bapak-bapak kami dari kubur-kubur mereka pada kali yang lain setelah mereka berubah menjadi tanah dan pasir ?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengingkari kebangkitan. Menurut mereka, hal ini mustahil. Yang demikian karena mereka menyamakan Zat Yang Mahakuasa dengan kemampuan mereka yang lemah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 67",
    "description": "Dan keraguan serta kebutaan hati orang-orang yang kafir yang mengingkari hari kebangkitan itu mendorong mereka untuk berkata, 'setelah jasad kita hancur lebur menjadi tanah dan begitu pula jasad nenek moyang kita yang sudah sekian lama meninggalkan dunia ini, apakah benar kita akan dikeluarkan dari kubur untuk hidup kembali sebagaimana sebelumnya'68. Sejak dahulu sungguh kami telah dijanjikan oleh nabi Muhammad, persis seperti apa yang disampaikan nabi-nabi terdahulu, akan diberi ancaman dengan ini, yaitu hari kebangkitan; kami dan nenek moyang kami. Jika benar apa yang dikatakannya tentang kebangkitan, mestinya telah terjadi. Tetapi, sebenarnya janji dan ancaman kebangkitan ini tidak lain hanyalah dongeng orang-orang terdahulu. '."
  }
]