[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh kami telah diberi ancaman tentang hari kebangkitan tersebut, begitu juga nenek moyang kami sebelumnya. Akan tetapi, kami belumlah melihat kebenaran dan kejadiannya. Ancaman ini tiada lain kecuali sesuatu yang ditulis dan diada-adakan oleh orang-orang dahulu berupa kedustaan-kedustaan dalam kitab-kitab mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Dan sungguh kami pernah diancam dengan hal ini dan bapak-bapak kami pun pernah diancam sebelumnya bahwa kami akan dibangkitkan dalam keadaan hidup semua, akan tetapi kami tidak melihat kenyataan dari ancaman yang diancamkan kepada kami itu, melainkan hanya sekedar kedustaan orang-orang terdahulu yang mereka tuliskan di dalam kitab-kitab mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68. Orang-orang yang ingkar itu menegaskan keyakinan mereka dengan mengatakan: “Kebangkitan di akhirat hanyalah hayalan dan kedustaan yang disampaikan kepada kita dan nenek moyang sebelum kita, dan tidak ada dalil yang menunjukkan kebenaran hal itu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. لَقَدْ وُعِدْنَا هٰذَا(Sesungguhnya kami telah diberi ancaman dengan ini) Yakni dengan hari kebangkitan. نَحْنُ وَءَابَآؤُنَا مِن قَبْلُ(kami dan (juga) bapak-bapak kami dahulu) Yakni sebelum Muhammad memberi ancaman itu kepada kami, dan kami belum pernah melihat nenek moyang kami kembali hidup. إِنْ هٰذَآ(ini tidak lain) Yakni mereka berkata: “ancaman bahwa kami akan dibangkitkan ini إِلَّآ أَسٰطِيرُ الْأَوَّلِينَ(hanyalah dongengan-dongengan orang dahulu kala) Yakni cerita dan kebohongan yang ditulis dalam kitab-kitab terdahulu, dan bukan merupakan wahyu dari Allah.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Sesungguhnya kami dan bapak-bapak kami dahulu benar-benar telah diberi ancaman dengan hari kebangkitan, bahkan sebelum Muhammad memberi peringatan tentang itu. Namun itu semua tidak terjadi, dan apa yang diancamkan kepada kami ini tidak lain hanyalah dongengan-dongengan orang dahulu kala saja yang mereka ambil dari kitab-kitab.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh telah diberi ancaman dengan ini kami dan nenek moyang kami sebelumnya. Sesungguhnya ini hanyalah dongeng orang-orang terdahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. “Sesungguhnya kami telah diberi ancaman dengan ini,” maksudnya, dengan kebangkitan, “kami dan juga bapak-bapak kami dahulu,” namun ia pun tidak kunjung mendatangi kami, dan kami pun tidak pernah melihatnya sedikitpun darinya. “Ini tidak lain hanyalah dongengan-dongengan orang dahulu kala.” Maksudnya cerita dan dongeng-dongeng mereka yang digunakan untuk melewatkan waktu, padahal ia sama sekali tidak memiliki landasan (bukti) dan tidak pula mempunyai kebenaran tentangnya. Allah beralih di dalam memberitakan tentang keadaan orang-orang yang mendustakan kepada pemberitaan bahwa mereka tidak mengetahui kapan waktu akhirat itu, kemudian pemberitaan tentang kelemahan ilmu pengetahuan mereka tentangnya. Kemudian pemberitaan bahwa pengetahuan mereka adalah keraguan, kemudian pemberitaan tentang kebutaan mereka, kemudian pembirataan tentang keingkaran mereka dan anggapan mereka bahwa akhirat itu sangat tidak mungkin akan terjadi. Maksudnya, dan disebabkan keadaan dan kondisi seperti itu maka hilanglah rasa takut pada akhirat dari dalam hati mereka. Maka dari itu mereka berani melakukan maksiat terhadap Allah, dan sangat mudah bagi mereka untuk mendustakan kebenaran dan meyakini yang batil (palsu), dan mereka menghalalkan segala keinginan (syahwat) dengan mengorbankan segala bentuk ibadah. Maka dari itu mereka rugi dunia dan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 68: Mereka berkata dengan kesesatan yang menjadi-jadi akan pengingkaran hari kebangkitan : Sungguh benar-benar kami dijanjikan akan hari kebangkitan ini, kami dan bapak-bapak kami yang sebelumnya, maka tidak ada kenyataan akan hal itu, dan tidak hari kebangkitan itu hanyalah dongeng-dongeng orang terdahulu, kisah-kisah, khurafat yang termaktub dalam kitab-kitab mereka yang telah using dimakan waktu dan hanyalah sebagai hiburan mereka dalam kisah-kisah pengantar tidur mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ternyata tidak datang, dan kami tidak melihatnya. Setelah memberitakan tentang keadaan mereka yang mendustakan, selanjutnya disebutkan keadaan mereka sehingga seperti itu, yaitu karena mereka tidak mengetahui kapan tibanya kiamat, lemahnya pengetahuan mereka tentang itu, dan memberitahukan bahwa mereka masih ragu-ragu, bahkan buta tentangnya, selanjutnya memberitakan tentang pengingkaran mereka terhadap kebangkitan dan anggapan mustahil terjadi. Oleh karena itulah, rasa takut kepada akhirat hilang dari hati mereka, mereka pun berani mengerjakan maksiat dan menjadi ringan untuk menolak yang hak (benar), membenarkan yang batil, merasakan manisnya memenuhi syahwat daripada beribadah, sehingga rugi dunia dan akhiratnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 68",
    "description": "Sejak dahulu sungguh kami telah dijanjikan oleh nabi Muhammad, persis seperti apa yang disampaikan nabi-nabi terdahulu, akan diberi ancaman dengan ini, yaitu hari kebangkitan; kami dan nenek moyang kami. Jika benar apa yang dikatakannya tentang kebangkitan, mestinya telah terjadi. Tetapi, sebenarnya janji dan ancaman kebangkitan ini tidak lain hanyalah dongeng orang-orang terdahulu. '69. Katakanlah kepada mereka yang mendustakanmu, wahai nabi Muhammad, sebagai peringatan dan ancaman untuk mereka, 'berjalanlah kamu semua di muka bumi, lalu perhatikanlah sejarah bagaimana kesudahan orang-orang yang berdosa dengan mendustakan para rasul di masa lalu, agar kamu dapat mengambil pelajaran yang membuat kamu takut akan azab Allah. Allah telah membinasakan mereka, dan akan memperlakukan hal yang sama terhadap kamu jika kamu tidak beriman."
  }
]