[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul) kepada orang-orang yang mendustakan itu, “Berjalanlah kalian di muka bumi, lalu perhatikanlah perkampungan orang-orang yang berbuat dosa sebelum kalian, bagaimanakah kesudahan orang-orang yang mendustakan rasul-rasul? Allah membinasakan mereka karena pendustaan yang mereka perbuat. Dan Allah akan berbuat kepada kalian seperti pada mereka jika kalian tidak beriman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Katakan -Wahai Rasul- kepada orang-orang yang ingkar terhadap kebangkitan itu, “Berjalankah kalian ke berbagai arah di bumi dan perhatikanlah bagaimana kondisi akhir dari para pendosa yang ingkar dengan kebangkitan.” Kami telah binasakan mereka karena pengingkaran mereka terhadap kebangkitan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Hai Rasulullah, katakanlah kepada orang-orang yang ingkar itu: “Perhatikanlah keadaan umat-umat terdahulu yang mendustakan para rasul yang menasehati mereka, dan lihatlah apa yang menimpa mereka setelah itu; Allah telah menghancurkan mereka sehancur-hancurnya, dan kesudahan mereka adalah kebinasaan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. قُلْ سِيرُوا۟ فِى الْأَرْضِ (Katakanlah: “Berjalanlah kamu (di muka) bumi) Dan saksikanlah sisa-sisa peradaban yang besar milik orang-orang sebelum kalian. فَانظُرُوا۟( lalu perhatikanlah) Dengan mata dan hati kalian. كَيْفَ كَانَ عٰقِبَةُ الْمُجْرِمِين(bagaimana akibat orang-orang yang berdosa) Yakni bagaimana akhir dan kesudahan orang-orang yang mendustakan kabar-kabar hari kebangkitan yang dibawa oleh para Nabi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Katakanlah kepada para pendusta hari kebangkitan wahai Nabi: \"Berjalanlah kamu di muka bumi, lalu perhatikanlah dengan seksama dan mengambil pelajaran. Bagaimana akibat orang-orang yang melakukan dosa, mendustakan hari kebangkitan serta mendustakan ajaran Nabinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Berjalanlah di bumi, lalu perhatikanlah bagaimana kesudahan orang-orang yang berdosa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Kemudian Allah mengingatkan mereka akan kebenaran apa saja yang diinformasikan oleh para rasul, seraya berfirman, “Katakanlah, ‘Berjalanlah kamu (di muka bumi), lalu perhatikanlah bagaimana akibat orang-orang yang berdosa’.” Oleh karena itu, kalian tidak akan menemukan seorang yang berdosa yang terus dalam perbuatan dosanya melainkan kesudahannya adalah seburuk-buruk kesudahan, dan Allah telah menimpakan terhadapnya sebagian dari keburukan dan siksaan yang layak dengan keadaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 69: Katakanlah kepada mereka wahai Nabi Allah : Bergeraklah di muka bumi dan berjalanlah di atasnya, lihatlah dengan mata-mata kalian atas bekas-bekas kaum sebelum kalian yang mereka mendustakan, pikirkanlah, ambillah pelajaran dan tadabburilah bagaimana akhir dari kehidupan meraka ?! Allahlah yang memberi kehidupan kepada mereka kemudian Allah jugalah yang mematikan mereka, Dialah yang mampu untuk mewujudkan mereka semua pada kali yang lain, jika memang kalian adalah orang-orang yang berpikir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengingatkan mereka terhadap kebenaran yang diberitakan para rasul. Oleh karena itu, kamu tidak mendapatkan pelaku dosa tetap di atas dosanya kecuali kesudahannya sangat buruk, Allah akan menimpakan kepadanya keburukan dan hukuman yang cocok dengan keadaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 69",
    "description": "Katakanlah kepada mereka yang mendustakanmu, wahai nabi Muhammad, sebagai peringatan dan ancaman untuk mereka, 'berjalanlah kamu semua di muka bumi, lalu perhatikanlah sejarah bagaimana kesudahan orang-orang yang berdosa dengan mendustakan para rasul di masa lalu, agar kamu dapat mengambil pelajaran yang membuat kamu takut akan azab Allah. Allah telah membinasakan mereka, dan akan memperlakukan hal yang sama terhadap kamu jika kamu tidak beriman. 70. Laksanakanlah tugasmu dengan sebaik mungkin, dan janganlah engkau wahai nabi Muhammad bersedih hati terhadap mereka yang enggan mengikuti ajaran yang engkau sampaikan, sebab tugasmu hanyalah menyampaikan risalah kami, dan janganlah pula dadamu merasa sempit terhadap upaya tipu daya mereka, sebab kami akan menolongmu dan melindungimu dari itu semua. '."
  }
]