[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah kisah Musa, ketika ia berkata kepada keluarganya dalam perjalanannya dari Madyan menuju negeri Mesir, “Sesungguhnya aku menyaksikan api. Aku akan datang kepada kalian dengan membawa berita yang menunjukkan arah jalan yang tepat atau aku akan datang dengan membawa nyala api itu agar kalian dapat menghangatkan diri dengannya dari hawa dingin.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Ingatlah -wahai Rasul- ketika Musa berkata kepada keluarganya, \"Sesungguhnya aku melihat api. Aku kelak akan membawa kepadamu kabar dari tempat nyalanya yang akan memberi petunjuk ke arah perjalanan kita, atau aku membawa kepadamu suluh api yang bersumber darinya supaya kamu dapat berdiang dengannya dari suhu dingin\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Hai Rasulullah, ingatlah ketika Musa berkata kepada keluarganya -saat dia berada di padang pasir Sina ketika dia tersesat saat akan menuju Mesir dari negeri Madyan-: “AKu melihat api, aku akan datang kembali kepada kalian dengan membawa kabar yang dapat menunjukkan jalan kepada kita, atau aku dapat membawa sesuluh api agar kalian dapat menghangatkan diri dari udara dingin.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِذْ قَالَ مُوسَىٰ لِأَهْلِهِۦٓ ((Ingatlah) ketika Musa berkata kepada keluarganya) Terdapat pendapat mengatakan bahwa ketika itu ia hanya bersama istrinya. إِنِّىٓ ءَانَسْتُ نَارًا(Sesungguhnya aku melihat api) Yakni aku melihat api. سَـَٔاتِيكُم مِّنْهَا بِخَبَرٍ(Aku kelak akan membawa kepadamu berita daripadanya) Huruf (س) dalam kata (سآتيكم) menunjukkan dekatnya jarak api itu. أَوْ ءَاتِيكُم بِشِهَابٍ قَبَسٍ (atau aku membawa kepadamu suluh api) Yakni aku akan membawa kepadamu api yang aku ambil dari sana. Makna (القبس) adalah api yang diambil dari tempatnya untuk menyalakan api di tempat lain. لَّعَلَّكُمْ تَصْطَلُونَ (supaya kamu dapat berdiang) Yakni dengan harapan kalian dapat menyalakan api untuk menghangatkan diri dari kedinginan. Tsa’lab berkata makna (الشهاب) adalah ranting kayu yang salah satu ujungnya terdapat bara api."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Ingatlah wahai Nabi, ketika Musa berkata kepada istrinya dalam perjalanan Madyan menuju Mesir: \"Sesungguhnya aku melihat api dari kejauhan. Aku kelak akan membawa kepadamu khabar dari api itu, agar dapat menunjukkan jalan untuk kita. Atau aku akan membawa kepadamu suluh api supaya kamu dapat menghangatkan diri dari dingin\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) ketika Musa berkata kepada keluarganya,“Sesungguhnya aku melihat} Aku melihat {api. Aku akan membawa kabar tentangnya kepada kalian atau membawa nyala api} nyala api {agar kalian bisa mendapat kehangatan} kalian bisa mendapat kehangatan di udara yang dingin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7 maksudnya, ingatlah kondisi yang utama lagi sangat mulia ini drai kondisi-kondisi Nabi Musa bin Imran, yaitu pada permulaan mendapat wahyu, dan terpilihnya dia menjadi RasulNya, serta pembicaraan Allah secara langsung kepadanya. Yaitu, setelah dia tinggal di negeri madyan dalam beberapa tahun lamanya, kemudian dia berjalan bersma keluarganya drai madyan menuju mesir. Ketika dia di tengah perjalanan, dia tersesat, dan pada saat itu dia berada dalam kegelapan malam yang sangat dingin. Maka dia berkata kepada mereka (keluarganya),” sesungguhnya aku melihat api,” aku melihat adanya api dari kejauhan. “aku nanti akan membawa kepadamu kabar drainya,” tentang jalan, “atau aku membawa kepadamu suluh api supaya kamu dapat berdiang,” maksudnya, kalian dapat menghangatkan badan. Ini menunjukan bahwa Musa tersesat dan sudah sangat kedinginan dan begitu pula keluarganya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 7: Ingatlah wahai Nabi Allah suatu hari ketika Musa berkata kepada pengikutnya : Tunggulah di sini, karena aku melihat api, aku akan pergi melihatnya, agar aku dapat memberikan kabar kepada kalian apa yang menunjuki aku atas jalan menuju ke mesir, atau akau datang kepada kalian dengan mematikan api tersebut untuk menjaga kalian darinya. Dan secara hakikat, itu bukanlah api, ia hanyalah cahaya yang Allah ciptakan, akan tetapi Musa menyangkanya sebagai api, oelh karena itu Allah menyerunya berdasarkan sangkaannya. Maka ketika Musa telah sampai pada api tersebut, Musa mendapatkan petunjuk dan memberikan hakikat dan pilihan dari pengajaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni istrinya ketika Beliau berjalan bersamanya dari Madyan ke Mesir setelah tinggal di Madyan beberapa tahun. Saat di tengah perjalanan Beliau tersesat, dan ketika itu Beliau bersama keluarganya berada di malam hari yang gelap lagi dingin. Yakni dari kejauhan. Yaitu tentang jalan yang akan ditempuh, di mana saat itu mereka sedang tersesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 7",
    "description": "Di antara isi kandungan Al-Qur'an adalah cerita tentang nabi-nabi masa lalu, antara lain adalah nabi musa. Allah memerintahkan kepada nabi Muhammad untuk menceritakan kepada kaumnya tentang nabi musa, yaitu ketika nabi musa sedang dalam perjalanan menuju ke mesir beserta istrinya untuk menemui ibundanya. Keduanya tersesat di jalan, di malam yang gelap dan dingin. Ceritakan kepada mereka, wahai nabi Muhammad, ketika musa berkata kepada keluarganya, 'sungguh, aku melihat api. Diamlah kamu di sini, aku akan membawa kabar dari arah api itu tentang itu kepadamu, atau aku akan membawa suluh api atau obor kepadamu agar kamu dapat berdiang menghangatkan badan dekat api. '8. Maka tidak berapa lama ketika dia, yakni musa, tiba di sana yaitu tempat api itu, dia diseru oleh satu suara yang tidak ada rupanya, 'telah diberkahi, diberikan kebaikan yang sangat banyak orang yang berada di dekat api, yaitu nabi musa sendiri dan orang-orang yang berada di sekitarnya yaitu penduduk negeri syam, tempat diutusnya para nabi. Mahasuci Allah, tuhan pemelihara seluruh alam dari segala sesuatu yang yang tak layak bagi-Nya. '."
  }
]