[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu bersedih hati atas sikap berpaling kaum musyrikin dan pendustaan mereka terhadapmu, dan janganlah hati kamu menjadi sempit gara-gara tipu daya mereka terhadapmu. Sesungguhnya Allah akan menolongmu atas mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Janganlah kamu sedih karena berpalingnya orang-orang musyrik dari dakwahmu, janganlah hatimu merasa sempit karena memperhatikan apa yang mereka perbuat dalam rangka mempedayamu, karena Allah bersamamu dan akan menolongmu menghadapi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "70. Allah meneguhkan hati Rasulullah dan menentramkan kegalauannya akibat penderitaan yang dia dapatkan di jalan dakwah: “Janganlah kamu membinasakan dirimu akibat kesedihanmu terhadap kaummu yang mendustakan; kewajibanmu hanyalah menyampaikan risalah, maka janganlah dadamu menjadi sempit karena tipu daya dan kedustaan yang ditujukan kepadamu. Allah akan menolongmu atas mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. وَلَا تَحْزَنْ عَلَيْهِمْ (Dan janganlah kamu berduka cita terhadap mereka) Akibat kekafiran yang terus menerus mereka lakukan. وَلَا تَكُن فِى ضَيْقٍ(dan janganlah (dadamu) merasa sempit) Makna (ضَيْقٍ) adalah sesuatu yang dapat membuat hati sempit. مِّمَّا يَمْكُرُونَ(terhadap apa yang mereka tipudayakan) Yakni janganlah kamu merasa sempit dalam berdoa kepada Allah akibat tipu daya yang mereka lakukan terhadapmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Janganlah kamu berduka cita terhadap pendustaan mereka terhadapmu dan pengingkaran mereka terhadap hari kebangkitan dan ajaranmu wahai Nabi. Jangan berkecil hati atau dadamu merasa sempit terhadap apa yang mereka tipudayakan. Sesungguhnya Allah melindungi, menjaga, dan menolongmu dari mereka\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah bersedih terhadap mereka dan janganlah merasa sempit} merasa berdosa di dalam dada {terhadap tipu daya mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Maksudnya, janganlah kamu bersedih, wahai Muhammad, terhadap orang-orang yang mendustakan itu dan ketidakberimanan mereka; karena sesungguhnya kamu, kalau saja mengetahui apa yang ada pada mereka dari keburukan dan bahwa mereka sebenarnya tidak layak untuk kebaikan, tentu kamu tidak akan berduka dan bersedih, dadamu tidak akan merasa sempit dan jiwamu tidak akan merasa gelisah dengan tipu daya mereka, karena sesungguhnya tipu daya mereka akan kembali menimpa mereka sendiri, \"Orang-orang kafir itu membuat tipu daya, dan Allah membalas tipu daya mereka itu. Dan Allah sebaik-baik pembalas tipu daya.\" (Ali- Imran:54)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 70: Kemudian Allah memerintahkan Nabi-Nya Muhammad ﷺ agar tidak bersedih atas kelakuan mereka yang mengingkari, dan agar tidak membantah mereka lagi atasmu, jangan pula membuat makar dan jangan pula menipu mereka serta jangan berkecil hati akan hal itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan hiburan bagi Nabi shallallahu 'alaihi wa sallam agar tidak mempedulikan tipu daya mereka terhadap Beliau, karena Allah yang akan membela Beliau."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 70",
    "description": "Laksanakanlah tugasmu dengan sebaik mungkin, dan janganlah engkau wahai nabi Muhammad bersedih hati terhadap mereka yang enggan mengikuti ajaran yang engkau sampaikan, sebab tugasmu hanyalah menyampaikan risalah kami, dan janganlah pula dadamu merasa sempit terhadap upaya tipu daya mereka, sebab kami akan menolongmu dan melindungimu dari itu semua. '71. Pendustaan orang-orang kafir itu telah mencapai puncaknya, dan mereka meminta agar siksa itu segera didatangkan dengan selalu berkata, 'kapankah datangnya janji azab yang kamu ancamkan itu' buktikan jika kamu, wahai nabi Muhammad dan pengikutmu, adalah orang yang benar dalam janji dan ancamanmu itu. '."
  }
]