[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang musyrik dari kaummu (wahai Rasul) akan berkata, “Kapankah ancaman dengan siksaan yang kamu dan para pengikutmu ancamkan kepada kami akan terjadi, bila kalian berkata benar dalam ancaman yang kalian sampaikan kepada kami?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Dan orang-orang yang kafir yang mengingkari kebangkitan dari kaummu berkata, “Kapan datangnya siksa yang telah engkau dan orang-orang beriman ancamkan kepada kami, jika kalian memang benar dalam apa yang kalian klaim itu?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Ayat-ayat ini membahas tentang cara-cara yang digunakan orang-orang yang ingkar itu dalam menghina dan merendahkan rasul mereka; mereka siap mendapatkan azab yang diancamkan kepada mereka, dan meminta agar Rasulullah menetapkan waktu datangnya azab mereka tunggu itu jika dia yakin azab itu akan terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Orang-orang kafir pendusta hari kebangkitan berkata: \"Kapan datangnya azab itu, jika memang kamu orang-orang yang benar?\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Kapankah datangnya janji ini jika kalian adalah orang-orang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Dan orang-orang yang mendustakan itu berkata tentang kebangkitan dan kebenaran yang dibawa oleh Rasulullah, seraya meminta agar azab segera menimpa, “Bilakah datangnya azab itu, jika memang kamu orang-orang yang benar.” Ini merupakan kepicikan pikiran dan kebodohan mereka; sebab sesungguhnya terjadinya azab dan waktunya telah ditangguhkan oleh Allah pada waktu yang telah ditetapkan dan telah ditetapkan berdasarkan ketetapanNya. Sehingga tidak menunjukkan ketidaksegeraanNya mewujudkan permintaan mereka. Sekalipun demikian Allah berfirman dengan nada mengingatkan mereka akan terjadinya apa yang mereka minta untuk disegerakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 71: Mereka bertanya dengan tujuan mengolok-olok dan sombong dengan berkata : Kapan terjadinya janji ini dengan datangnya adzab di mana telah dijanjikan kepada kami; Jika memang kalian dan pengikutmu adalah termasuk orang-orang yang jujur akan janji yang engkau berikan kepada kami ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mendustakan akhirat dan mendustakan kebenaran yang dibawa rasul sambil meminta disegerakan azab. Ini termasuk kebodohan mereka, karena terjadinya telah Allah tetapkan waktunya, sehingga tidak disegerakan tidaklah menunjukkan bahwa hal itu tidak terjadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 71",
    "description": "Pendustaan orang-orang kafir itu telah mencapai puncaknya, dan mereka meminta agar siksa itu segera didatangkan dengan selalu berkata, 'kapankah datangnya janji azab yang kamu ancamkan itu' buktikan jika kamu, wahai nabi Muhammad dan pengikutmu, adalah orang yang benar dalam janji dan ancamanmu itu. '72. Katakanlah kepada mereka, wahai nabi Muhammad, 'boleh jadi sebagian dari azab yang kamu minta disegerakan itu telah hampir sampai kepadamu dan akan segera menimpamu. '"
  }
]