[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Tuhanmu itu benar-benar mempunyai karunia yang besar kepada sekalian manusia, dengan tidak menyegerakan siksaan bagi mereka atas perbuatan maksiat mereka kepada Allah dan kekafiran mereka kepadaNya. Akan tetapi, kebanyakan dari mereka tidak bersyukur kepada Allah atas itu, lalu mau beriman kepadaNya dan mengikhlaskan ibadah bagiNya semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Sesungguhnya Rabbmu itu -wahai Rasul- benar-benar mempunyai karunia yang besar kepada manusia dengan tidak menghiraukan permintaan mereka untuk disegerakan siksa atas mereka meski mereka berada dalam kekafiran dan kemaksiatan, akan tetapi sebagian besar manusia tidak bersyukur atas kenikmatan yang telah Allah berikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Hai Rasulullah, jika Tuhanmu menetapkan azab bagi kaummu diakhirkan karena keingkaran dan kedustaan mereka kepadamu, maka itu merupakan karunia dari-Nya; dan setiap penangguhan turunnya azab Allah adalah kesempatan bagi mereka. Sungguh kenikmatan-kenikmatan Allah sangat banyak yang harus mereka syukuri, akan tetapi kebanyakan mereka mengingkari karunia Kami bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَإِنَّ رَبَّكَ لَذُو فَضْلٍ عَلَى النَّاسِ (Dan sesungguhnya Tuhanmu benar-benar mempunyai kurnia yang besar (yang diberikan-Nya) kepada manusia) Penundaan azab dan lainnya merupakan bagian dari karunia dan nikmat Allah. وَلٰكِنَّ أَكْثَرَهُمْ لَا يَشْكُرُونَ(tetapi kebanyakan mereka tidak mensyukuri(nya)) Yakni mereka tidak mensyukuri karunia dan nikmat-Nya serta tidak mengetahui bagaimana seharusnya mereka menyikapi kemurahan rahmat-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Sesungguhnya Tuhanmu benar-benar mempunyai karunia besar yang diberikan-Nya kepada manusia, berupa berbgai nikmat yang terus-menerus kepada mereka, dan penundaan azab bagi mereka. Tetapi kebanyakan mereka tidak mensyukurinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu benar-benar Dzat yang memberi karunia kepada manusia, tetapi kebanyakan mereka tidak bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Allah mengingatkan hamba-hambaNya kepada keluasan kemurahan dan berlimpahnya karuniaNya, dan Allah menganjurkan mereka untuk berterima-kasih (bersyukur). Sekalipun begitu, kebanyakan manusia telah berpaling dari bersyukur dan mereka asyik (sibuk) dengan berbagai kenikmatan, lupa terhadap pemberi nikmat tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 73: Ketahuilah wahai Nabi Allah bahwa Rabbmu maha luas karunia-Nya atas seluruh manusia, maka tidaklah Allah tergesa-gesa dalam menimpakan hukuman, agar mereka dapat bertaubat dan mendapatkan petunjuk. Akan tetapi kebanyakan manusia menyekutukan Allah, mereka tidak mengenal akan pemberian nikmat Allah atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala mengingatkan hamba-hamba-Nya terhadap luasnya kepemurahan-Nya dan banyak karunia-Nya serta mendorong mereka untuk mensyukurinya. Meskipun begitu, kebanyakan manusia berpaling dari syukur, sibuk dengan nikmat-nikmat dan lupa kepada Pemberi nikmat, tidak mengakui nikmat itu berasal dari-Nya, tidak mau memuji-Nya dan tidak mau mengerjakan perintah-Nya dan menjauhi larangan-Nya. Termasuk di antaranya ditunda-Nya azab dari orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 73",
    "description": "Dan sungguh, tuhanmu benar-benar memiliki karunia yang diberikan-Nya kepada seluruh manusia. Di antara wujud rahmat dan karunia-Nya itu adalah penundaan hukuman yang akan ditimpakan atas orang-orang yang berdusta guna memberi mereka kesempatan berpikir dan bertobat akan tetapi kebanyakan mereka tidak mensyukuri karunia Allah. 74. Dan sungguh, tuhan pemeliharamu benar-benar senantiasa mengetahui apa yang disembunyikan dalam dada, yakni hati mereka dan apa yang mereka nyatakan, baik berupa perbuatan maupun ucapan, sehingga dia akan membalas itu semua."
  }
]