[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Tuhanmu itu benar-benar mengetahui apa yang disembunyikan oleh hati makhlukNya dan apa saja yang mereka tampakkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Dan sesungguhnya Rabbmu benar-benar mengetahui apa yang disembunyikan oleh hati hamba-hamba-Nya dan apa yang ditampakkannya, tidak ada sedikitpun yang tersembunyi bagi Allah dari hal itu dan Dia akan memberikan balasan kepada mereka karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Hai Rasulullah, Tuhanmu Maha Mengetahui segala yang disembunyikan hati mereka dan segala perkataan dan perbuatan yang mereka tampakkan. Jika orang-orang yang mendustakan itu menyembunyikan sesuatu, maka Allah Maha Mengetahui segala yang mereka sembunyikan dan yang mereka tampakkan, dan Dia Maha Mengetahui tipu daya yang mereka lakukan kepada orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. وَإِنَّ رَبَّكَ لَيَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ (Dan sesungguhnya Tuhanmu, benar-benar mengetahui apa yang disembunyikan hati mereka) Yakni yang dirahasiakan dalam hati. وَمَا يُعْلِنُونَ (dan apa yang mereka nyatakan) Yakni perkataan dan perbuatan yang mereka nampakkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Sesungguhnya Tuhanmu itu wahai Rasul, benar-benar Maha Mengetahui apa yang mereka sembunyikan dalam hati mereka, juga apa yang mereka nyatakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu mengetahui apa yang disembunyikan} disembunyikan {dada mereka dan apa yang mereka nyatakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Dan sesungguhnya Rabbmu, benar-benar mengetahui apa yang disembunyikan,” yang diliputi “dada mereka dan apa yang mereka nayatakan,” maka hendaklah mereka waspada terhadap Dzat Yang Maha Mengetahui segala yang tersembunyi dan segala yang Nampak, dan hendaklah mereka selalu mengawasiNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 74: Allah kemudian mengabarkan kepada Nabi-Nya ﷺ bahwa Allah mengetahui apa yang disembunyikan di hati-hati mereka orang-orang musyrik dan isinya serta mengetahui yang nampak darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan lisan mereka. Oleh karena itu, hendaklah mereka berhati-hati kepada Tuhan mereka yang mengetahui semua yang tampak maupun tersembunyi dan merasakan pengawasan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 74",
    "description": "Dan sungguh, tuhan pemeliharamu benar-benar senantiasa mengetahui apa yang disembunyikan dalam dada, yakni hati mereka dan apa yang mereka nyatakan, baik berupa perbuatan maupun ucapan, sehingga dia akan membalas itu semua. 75. Dan tidak ada sesuatu pun yang tersembunyi di langit dan di bumi, sekecil dan sehalus apa pun, melainkan tercatat dalam kitab yang jelas di sisi Allah, yaitu lauh mahf'zh. Kitab itu mencakup segala sesuatu yang telah dan yang akan terjadi."
  }
]