[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidak ada sesuatu yang tidak terlihat oleh pandangan makhluk di langit dan di bumi, kecuali terdapat di dalam kitab yang nyata yang berada di sisi Allah. kitab itu telah meliputi seluruh peristiwa yang telah terjadi dan yang akan terjadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Tidak ada suatu perkara yang gaib atas manusia baik berada di langit maupun di bumi kecuali hal itu tentu telah tercatat di dalam kitab yang nyata, yaitu Al-Lauḥul Maḥfūẓ."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Allah Maha Mengetahui segala yang tersembunyi dari hamba-Nya baik itu sesuatu yang ada di langit maupun di bumi, tidak ada yang terlewat dari ilmu-Nya. Allah telah mencantumkan segala rinciannya di Ummul Kitab (Lauhul Mahfuzh) yang ada pada-Nya; maka mengapa mereka mengharap azab yang belum datang waktu kedatangan yang telah ditentukan baginya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَمَا مِنْ غَآئِبَةٍ فِى السَّمَآءِ وَالْأَرْضِ إِلَّا فِى كِتٰبٍ مُّبِينٍ (Tiada sesuatupun yang ghaib di langit dan di bumi, melainkan (terdapat) dalam kitab yang nyata (Lauhul Mahfuzh)) Makna (الغائبة) yakni segala yang dirahasiakan Allah dari para makhluk-Nya. Segala hal itu tercantum dalam Lauhul Mahfuzh, oleh sebab itu tidak ada yang tersembunyi bagi Allah, termasuk di antaranya adalah azab yang mereka harapkan segera kedatangannya, azab itu telah ditentukan waktu dan ajalnya yang diketahui oleh Allah, maka mengapa mereka mengharapkan kedatangannya sebelum waktunya yang telah ditentukan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Tidak ada sesuatupun keghaiban baik yang ada di langit maupun di bumi, melainkan sudah tercatat dalam kitab jelas yaitu Lauhul Mahfuzh. Lalu bagaimana bisa ada sesuatu yang bisa tersembunyi dari Allah? Perkara ghaib adalah segala sesuatu yang Allah sembunyikan dari penglihatan makhluk. Min adalah huruf yang menunjukkan sifat umum pada kata sesudahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada sesuatu pun yang tersembunyi} ciptaan yang tersembunyi {di langit dan di bumi melainkan ada dalam kitab yang nyata} Lauhil Mahfuz"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. “Tiada sesuatu pun yang ghaib di langit dan bumi,” maksudnya, yang tersembunyi dan yang rahasia dari rahasia-rahasia alam atas dan alam bawah, “melainkan (terdapat) dalam kitab yang nyata,” maksudnya, semua itu telah dimuat oleh al-KItab dengan segala apa yang telah terjadi dan yang akan terjadi hingga Hari KIamat. Jadi, segala kejadian yang terjadi, yang Nampak atau yang tersembunyi, melainkan pasti ia sesuai dengan catatan yang termaktub di dalam Lauhul Mahfuzh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 75: Allah mengabarkan tidaklah segala sesuatu lepas dan tersembunyi dari makhluk-Nya di langit maupun di bumi kecuali telah tertulis di dalam kitab yang jelas; Ia adalah Lauhul Mahfudz."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kitab itu meliput segala sesuatu yang telah terjadi dan akan terjadi sampai tegaknya hari kiamat. Oleh karena itu, segala yang terjadi besar maupun kecil kecuali sesuai yang tertulis dalam Lauh Mahfuzh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 75",
    "description": "Dan tidak ada sesuatu pun yang tersembunyi di langit dan di bumi, sekecil dan sehalus apa pun, melainkan tercatat dalam kitab yang jelas di sisi Allah, yaitu lauh mahf'zh. Kitab itu mencakup segala sesuatu yang telah dan yang akan terjadi. 76. Setelah diuraikan tentang keniscayaan kiamat, kini diuraikan tentang kenabian yang salah satu buktinya adalah al-qur`an. Sungguh, Al-Qur'an yang diwahyukan melalui malaikat jibril kepada nabi Muhammad ini menjelaskan kepada bani israil sebagian besar dari perkara agama, seperti masalah akidah, hukum dan kisah-kisah yang termaktub dalam taurat, yang mereka perselisihkan."
  }
]