[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya al-Qur’an ini menerangkan kepada Bani Israil tentang kebenaran dalam perkara-perkara yang mereka perselisihkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Sesungguhnya Al-Qur`ān yang diturunkan atas Muhammad -ṣallallāhu 'alaihi wa sallam- ini menjelaskan kepada Bani Israil sebagian besar dari perkara-perkara yang mereka perselisihkan dan membuka kesesatan-kesesatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Hai Rasulullah, kitab yang diturunkan kepadamu merupakan wahyu dari Allah yang menjelaskan bagi Bani Israil kebenaran yang ingin mereka sembunyikan dan mereka ubah. Kitab ini mengembalikan mereka kepada kebenaran tentang banyak sekali masalah yang saling mereka perselisihkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. إِنَّ هٰذَا الْقُرْءَانَ يَقُصُّ عَلَىٰ بَنِىٓ إِسْرٰٓءِيلَ أَكْثَرَ الَّذِى هُمْ فِيهِ يَخْتَلِفُونَ (Sesungguhnya Al Quran ini menjelaskan kepada Bani lsrail sebahagian besar dari (perkara-perkara) yang mereka berselisih tentangnya) Al-Qur’an diturunkan sebagai penjelas terhadap kebenaran yang mereka perselisihkan, seandainya mereka meyakini al-Qur’an niscaya mereka akan mendapatkan didalamnya penjelasan yang menyelesaikan perselisihan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Sesungguhnya Al Quran yang diturunkan kepadamu ini wahai Rasul, menjelaskan kepada Bani lsrail yang sezaman dengan nabi tentang sebagian besar dari perkara-perkara yang mereka perselisihkan. Diantaranya adalah perumpaaman dan gambaran tentang keadaan surga dan neraka, serta tentang Uzair dan Isa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Al-Qur’an ini menjelaskan kepada Bani Israil sebagian besar dari sesuatu yang mereka perselisihkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Ini adalah informasi tentang penjagaan al-Quran terhadap kitab-kitab suci terdahulu, uraian dan penjelasannya terhadap apa-apa yang terkandung di dalam kitab-kitab tersebut, karena telah terjadi kesamaran dan perselisihan di kalangan Bani Israil. Lalu al-Quran mengisahkan semua itu dengan suatu kisah yang dengannya segala kesulitan dapat tertanggulangi, dan al-Quran menjelaskan yang benar dari berbagai permasalahan yang diperselisihkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 76: Allah menyebutkan bahwa dari karunia Allah dan kebaikan-Nya atas bani israil dan manusia seluruhnya yaitu diturunkannya Al Qur’an yang agung ini, yang bermanfaat dan mulia penyebutannya. Dan bahwasanya itu semua adalah sebagai hujjah bagi bani israil yang berselisih; Misal perselisihan mereka akan Isa dan ibunya, perselisihan mereka akan uzair, perselisihan mereka akan hari kebangkitan dan apakah hari kebangkitan dengan arwah dan badan atau arwah saja."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini memberitakan tentang pengawasan Al Qur’an terhadap kitab-kitab yang terdahulu, merincikan dan menjelaskannya terhadap kesamaran yang ada dalam kitab-kitab tersebut dan perselisihan yang terjadi di kalangan Bani Israil, maka Al Qur’an menjelaskan dengan penjelasan yang menyingkirkan kemusykilan dan menerangkan yang benar di antara masalah yang diperselisihkan. Jika seperti ini kemuliaannya dan kejelasannya, serta menyingkirkan segala khilaf dan menyelesaikan segala kemusykilan, maka ia merupakan nikmat yang paling besar yang diberikan Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya, akan tetapi sedikit sekali yang menyikapi nikmat ini dengan sikap syukur. Oleh karena itulah, pada ayat selanjutnya Allah menerangkan, bahwa manfaat, cahaya dan petunjuk Al Qur’an hanyalah dikhususkan kepada orang-orang mukmin. Yang ada di zaman Nabi Muhammad shallallahu 'alaihi wa sallam. Al Qur’an menjelaskan sesuatu yang mereka perselisihkan, sehingga tidak ada lagi kebingungan di benak mereka jika mereka mau mengikutinya dan masuk Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 76",
    "description": "Setelah diuraikan tentang keniscayaan kiamat, kini diuraikan tentang kenabian yang salah satu buktinya adalah al-qur`an. Sungguh, Al-Qur'an yang diwahyukan melalui malaikat jibril kepada nabi Muhammad ini menjelaskan kepada bani israil sebagian besar dari perkara agama, seperti masalah akidah, hukum dan kisah-kisah yang termaktub dalam taurat, yang mereka perselisihkan. 77. Dan sungguh, Al-Qur'an itu benar-benar menjadi petunjuk yang sangat jelas menuju kebahagiaan hidup dan sebagai rahmat yang agung bagi orang-orang yang beriman kepadanya."
  }
]