[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya al-Qur’an ini benar-benar merupakan sumber hidayah dari kesesatan dan rahmat dari azab bagi orang-orang yang mengimaninya dan mengambil hidayah dengan hidayahnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Sesungguhnya hal itu merupakan petunjuk dan rahmat bagi orang-orang beriman yang menjalankan apa yang ada di dalam Al-Qur`ān."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Al-Qur’an mengandung berbagai manfaat, ia merupakan petunjuk bagi orang-orang beriman dan rahmat bagi orang-orang yang mengikuti cahayanya sehingga mereka dapat meraih kemenangan di dunia dan di akhirat. Pengkhususan penyebutan orang-orang beriman dalam ayat ini karena merekalah yang dapat mengambil manfaat dari al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَإِنَّهُۥ لَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ (Dan sesungguhnya Al Quran itu benar-benar menjadi petunjuk dan rahmat bagi orang-orang yang beriman) Yakni dan al-Qur’an sungguh merupakan petunjuk dan rahmat bagi orang yang beriman kepada Allah dan mengikuti Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Sesungguhnya Al Quran itu benar-benar menjadi petunjuk bagi manusia dari kesesatan, dan rahmat bagi orang-orang yang beriman dari azab"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya (Al-Qur’an) itu benar-benar menjadi petunjuk dan rahmat bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Kalaulah al-Quran memiliki kedudukan agung seperti itu, berupa kejelasan dan mampu menghapus semua perselisihan dan menguraikan semua yang tidak jelas (musykil), maka ia berarti menjadi nikmat (karunia) terbesar dari Allah atas hamba-hambaNya (umat manusia). Akan tetapi tidak semua orang mau menerima kenikmatan dengan mensyukurinya. Maka dari itu Allah menjelaskan bahwa manfaat al-Quran, cahaya dan petunjuknya khusus bagi orang-orang yang beriman saja, seraya berfirman, “Dan sesungguhnya al-Quran itu benar-benar menjadi petunjuk,” dari kesesatan, kepalsuan dan kerancuan, “dan rahmat.” Dada mereka menjadi sejuk karenanya, dan segala urusan agama dan dunia mereka menjadi lancar (lurus) dengannya, “bagi orang-orang yang beriman” kepadanya, yang membenarkannya dan menerimanya dengan tulus, bersemangat untuk menghayatinya, merenungkan makna-maknanya. Maka merekalah yang menggunakan al-Quran untuk memperoleh hidayah kepada jalan yang lurus dan rahmat yang mengandung kebahagiaan, kemengan, dan keberuntungan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 77: Allah menyebutkan bahwa diantara sifat-sifat Al Qur’an ini adalah sebagai petunjuk dan cahaya serta rahmat bagi orang-orang yang beriman, mereka adalah yang tercerahkan dengan cahaya Al Qur’an dan mendapat petunjuk darinya. orang-orang yang beriman adalah mereka yang jujur dan mendapatkan petunjuk; Sama saja apakah mereka dari seorang muslim, yahudi ataupun selain dari mereka jika beriman kepadamu (Muhammad), dan dengan apa yang engkau diutus dengannya, serta mereka yang meninggalkan ibadah kepada selain Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar tidak tersesat. Dada mereka menjadi sejuk karenanya dan urusan mereka baik yang terkait dengan agama maupun dunia menjadi lurus. Yakni orang-orang yang membenarkannya, menerimanya, mentadabburinya dan memikirkan makna-maknanya. Mereka inilah yang memperoleh hidayah kepada jalan yang lurus dan rahmat yang mengandung kebahagiaan dan keberuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 77",
    "description": "Dan sungguh, Al-Qur'an itu benar-benar menjadi petunjuk yang sangat jelas menuju kebahagiaan hidup dan sebagai rahmat yang agung bagi orang-orang yang beriman kepadanya. 78. Perselisihan itu diakhiri dengan datangnya putusan tuhan. Sungguh, tuhan pemeliharamu nabi Muhammad yang akan menyelesaikan perkara yang diperselisihkan di antara mereka dengan hukum-Nya yang selalu bersifat adil dan bijaksana, dan dia mahaperkasa yang tidak seorang pun dapat menolak putusan-Nya, maha mengetahui yang tidak samar bagi-Nya antara kebenaran dan kebatilan."
  }
]