[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Tuhanmu akan memutuskan perkara di antara orang-orang yang berselisih dari kalangan Bani Israil dan orang-orang selain mereka dengan keputusan hukumNya terhadap mereka, di mana Dia akan memberikan hukuman kepada orang yang batil dan memberikan balasan baik kepada orang yang berbuat baik. Dan Dia-lah Dzat Yang MahaPerkasa Yang selalu mengalahkan, maka keputusanNya tidak tertolak, juga Maha Mengetahui maka tidak samar bagiNya antara kebenaran dengan kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Sesungguhnya Rabbmu -wahai Rasul- akan mengadili di antara manusia -baik yang beriman maupun yang kafir- pada hari Kiamat dengan hukum-Nya yang adil, maka Dia merahmati orang yang beriman dan menyiksa orang yang kafir, dan Dia Maha Perkasa yang membalas setiap musuh-musuh-Nya dan tidak ada seorang pun yang bisa mengalahkan-Nya, Maha Mengetahui yang tidak kabur bagi-Nya mana yang benar dan mana yang batil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Hai Rasulullah, Tuhanmu akan memberi keputusan bagi seluruh makhluk; memutuskan golongan-golongan yang berselisih dalam akidah mereka dan menerapkan dengan firman-Nya yang hak; memberi pahala orang baik yang menempuh jalan yang benar dan menyiksa orang jahat yang tersesat jalannya. Dia Maha Perkasa dalam membalas dan Maha Mengetahui keadaan seluruh hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. إِنَّ رَبَّكَ يَقْضِى بَيْنَهُم بِحُكْمِهِۦ ۚ (Sesungguhnya Tuhanmu akan menyelesaikan perkara antara mereka dengan keputusan-Nya) Yakni Allah memberi keputusan pada Bani Israil yang saling berselisih dengan keputusan yang benar, dengan memberi pahala bagi pihak yang benar dan memberi hukuman bagi pihak yang salah. Pendapat lain mengatakan bahwa Allah akan memutuskan perkara di antara mereka di dunia sehingga kandungan kitab yang mereka ubah akan tampak. وَهُوَ الْعَزِيزُ الْعَلِيمُ(dan Dia Maha Perkasa lagi Maha Mengetahui) Yakni Yang tidak terkalahkan dan mengetahui keputusan yang Dia berikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Sesungguhnya Tuhanmu akan menyelesaikan perkara antara kelompok Bani Israil dan lainnya dengan keputusan-Nya yang benar dan adil. Dia Maha memberi hukuman kepada orang-orang yang berbuat kesalahan. Maha Mencukupi terhadap orang yang berbuat kebaikan. Dia Maha Perkasa lagi Maha Kuasa , tidak ada yang tidak mampu Allah kuasai. Juga Maha Mengetahui atas segala keadaan makhluk-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Tuhanmu akan menyelesaikan (masalah)} memecahkan {di antara mereka dengan putusanNya. Dialah Yang Maha perkasa lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Maksudnya, sesungguhnya Allah akan menyelesaikan perkara di antara orang-orang yang bersengketa dan akan memberikan keputusan hukum diantara orang-orang yang berselisih berdasarkan keputusanNya yang adil dan ketentuanNya yang bijaksana. Jadi, semua perkara sekalipun terjadi ketidakjelasan padanya di dunia diantara orang-orang yang berselisih karena ketidakjelasan dalil, atau karena adanya beberapa tujuan, maka sesungguhnya yang benar yang sesuai dengan realita akan dijelaskan di saat Allah memberikan keputusanNya. “Dan Dia Mahaperkasa,” Yang menaklukan seluruh makhluk, sehingga mereka tunduk kepadaNya, “lagi Maha Mengetahui,” seluruh sesuatu, Mengetahui perkataan orang-orang yang bersellisih, berdasarkan apa perkataan itu keluar, tujuannya apa dan maksudnya apa. Dan Dia akan memberikan balasan pada masing-masing sesuai dengan pengetahuanNYa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 78: Allah mengabarkan akan menghukumi di antara orang –orang yang berselisih, dan juga di antara orang-orang yang berdebat dengan hukum dan ketetapan yang adil, Dialah Allah yang maha suci, yang maha gagah, yang menguasai di mana tidak ada yang dapat menolak ketetapan-Nya, maha mengetahui segala sesuatu dengan bentuk sebenaarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara orang-orang yang berselisih. Segala masalah yang di sana terdapat kesamaran antara orang-orang yang berselisih karena samarnya dalil atau sebagian maksudnya, maka Allah Subhaanahu wa Ta'aala akan menerangkan pada hari itu yang benarnya ketika Allah memberikan keputusan. Dia mengalahkan semua makhluk, sehingga mereka semua tunduk. Segala sesuatu, termasuk ucapan orang-orang yang berselisih, apa yang muncul dari mereka, tujuan dan maksudnya, dan Dia akan memberikan balasan kepada masing-masing sesuai ilmu-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 78",
    "description": "Perselisihan itu diakhiri dengan datangnya putusan tuhan. Sungguh, tuhan pemeliharamu nabi Muhammad yang akan menyelesaikan perkara yang diperselisihkan di antara mereka dengan hukum-Nya yang selalu bersifat adil dan bijaksana, dan dia mahaperkasa yang tidak seorang pun dapat menolak putusan-Nya, maha mengetahui yang tidak samar bagi-Nya antara kebenaran dan kebatilan. -."
  }
]