[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bergantunglah kamu (wahai Rasul) dalam seluruh urusanmu kepada Allah dan percayalah kepadaNya, sesungguhnya Dia-lah yang menolongmu dalam seluruh perkara. Sesungguhnya kamu benar-benar di atas kebenaran nyata yang tidak ada keragu-raguan padanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Maka bertawakallah kepada Allah dan bersandarlah kepada-Nya di segala urusanmu, sesungguhnya engkau berada dalam kebenaran yang jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Hai Rasulullah, jika Allah yang akan memberi ketetapan, maka kamu harus bersandar kepada-Nya dalam segala urusanmu dan menyerahkannya kepada-Nya. Kamu telah menunaikan risalah dan menyampaikan amanah serta berhasil menegakkan kebenaran yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. فَتَوَكَّلْ عَلَى اللهِ ۖ (Sebab itu bertakwalah kepada Allah) Yakni serahkanlah urusanmu kepada-Nya dan bersandarlah hanya kepada-Nya, sebab Dia adalah penolongmu; maka dari itu janganlah kamu pedulikan orang-orang musyrik yang durhaka kepadamu. إِنَّكَ عَلَى الْحَقِّ الْمُبِينِ (sesungguhnya kamu berada di atas kebenaran yang nyata) Yakni sangat jelas bahwa ia berada di atas kebenaran, sama sekali tidak ada keraguan tentang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Sebab itu serahkanlah segala urusanmu kepada Allah, yakinlah kepada-Nya dan jangan khawatir atas perlawanan mereka. Sesungguhnya kamu berada di atas kebenaran yang nyata"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka bertawakallah kepada Allah. Sesungguhnya kamu berada di atas kebenaran yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Maksudnya, bersandarlah kepada Rabbmu dalam mencari kebaikan dan menolak segala marabahaya, dan dalam menyampaikan risalah, menegakkan agama dan berjihad melawan musuh. “SEsungguhnya kamu berada di atas kebenaran yang nyata,” yaitu dengan jelas. Orang yang berada di atas kebenaran yang menyerukan dan membela kebenaran adalah lebih berhak bertawakal daripada yang lain. Sebab ia tengah mengupayakan perkara yang pasti, yang dimaklumi kebenarannya, tidak ada keraguan sama sekali padanya. Apalagi ia benar-benar sangat jelas, tidak ada kesamarannya dan tidak ada pula kekaburannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 79: Kemudian Allah melanjutkan menghibur Nabi ﷺ dan menyebutkan akan peran penting dirinya yang bahwasanya dia adalah penyampai dan pemberi petunjuk dengan meminta pertolongan kepada Allah dan dia selalu meminta kepada Allah, dialah yang di atas kebenaran yang nyata yang tanpa keraguan atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni serahkanlah urusan kepada-Nya atau percayalah kepada-Nya, atau bersandarlah kepada-Nya dalam menyampaikan risalah, menegakkan agama, dan berjihad melawan musuh. Oleh karena itu, jangan ragu-ragu dan tetap maju sambil bertawakkal kepada-Nya karena engkau di atas yang hak, sedangkan mereka di atas yang batil, dan kesudahan yang baik akan didapatkan oleh orang-orang yang berada di atas yang hak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 79",
    "description": "-80. Keengganan mereka beriman pada hakikatnya disebabkan oleh tertutupnya mata dan telinga mereka, dan memang sungguh, engkau wahai nabi Muhammad, tidak dapat menjadikan orang yang mati hatinya dapat mendengar kebenaran, sebab mereka telah kehilangan kesadarannya, dan engkau tidak pula dapat menjadikan orang yang tuli karena menutup diri, dapat mendengar seruan, lebih-lebih apabila mereka telah berpaling lari berbalik ke belakang, sehingga tidak memiliki kesiapan untuk mendengarkan dakwahmu."
  }
]