[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-12. Kemudian tatkala Musa mendatangi api itu, Allah memanggilnya dan memberitahukan kepadanya bahwa ini adalah suatu tempat yang disucikan Allah dan diberkahi olehNya. Maka Dia menjadikannya sebagai tempat untuk berbicara kepada Musa dan mengangkatnya sebagai rasul. Dan sesungguhnya Allah memberkahi siapa saja yang berada di api itu dan yang ada di sekitarnya dari kalangan malaikat, dan Mahasuci Allah, Penguasa seluruh makhluk dari segala yang tidak pantas bagiNya. “Wahai Musa, sesungguhnya Aku adalah Allah yang berhak diibadahi semata, yang Mahaperkasa Yang Kuasa untuk membalas musuh-musuhKu, juga Mahabijaksana dalam pengaturan makhluk-makhlukKu. Dan lemparkanlah tongkatmu.” Maka ia (musa) melemparkan tongkatnya, lalu berubah menjadi seekor ular. Ketika melihatnya bergerak-gerak dengan mudah seperti rayapan ular yang cepat, Musa berbalik untuk lari, dan tidak kembali kepadanya. Maka Allah menenangkannya dengan FirmanNYa, “Wahai Musa, jangan takut. Sesungguhnya orang yang Aku utus kepada mereka dengan membawa risalahKu tidak takut disisiKu. Akan tetapi, orang yang melewati batas dengan berbuat dosa kemudian bertaubat dan menggantinya dengan taubat yang baik setelah buruknya dosa, sesungguhnya Aku Maha Pengampun baginya lagi Maha penyayang terhadapnya. Maka seseorang tidak boleh berputus asa dari rahmat dan ampunan Allah. Dan masukkanlah tanganmu ke dalam kerah bajumu yang terbuka sampai ke dada, niscaya akan keluar dalam keadaan putih seperti salju, namun bukan karena penyakit kusta. Dua hal tersebut termasuk bagian dari Sembilan mukjizat yaitu tangan, tongkat, paceklik panjang, kekurangn buah-buahan, banjir bandang, belelang, kutu, katak, dan darah untuk menguatkanmu dalam menyampaikan risalah kepada Fir’aun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang telah keluar dari perintah Allah lagi kafir terhadapNya.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Maka tatkala dia tiba di tempat api yang ia lihat itu, Allah pun menyerunya, \"Bahwa telah disucikan orang-orang yang berada di dekat api itu, dan siapa saja yang berada di sekitarnya dari kalangan para Malaikat, dan sebagai bentuk pengagungan terhadap Tuhan segala makhluk serta penyucian-Nya dari segala sifat yang tidak pantas bagi-Nya yang disandarkan pada-Nya oleh orang-orang yang sesat \"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-9. Ketika Musa mendatangi api itu, Allah memanggilnya dan menyampaikan bahwa tampat yang terdapat api itu dan tempat di sekitarnya yang tersinari merupakan tempat yang suci dan diberkati; dan salah satu keberkatannya adalah Allah menjadikannya sebagai tempat berbicara dengan Musa, dan tempat menyeru dan menjadikannya rasul. Maha Suci Allah, Tuhan seluruh makhluk, dari segala yang tidak layak bagi-Nya. Hai Musa, Aku adalah Tuhan Yang Hak, Yang Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam mengatur hamba-hamba-Nya. Ibnu Abbas berkata, (أن بورك من في النار), Api itu adalah cahaya-Nya. dan (ومن حولها) yakni Diberkati orang yang berada di dalam cahaya itu dan orang yang di sekitar cahaya itu. (Majmu’ al-Fatawa 5/461)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فَلَمَّا جَآءَهَا (Maka tatkala dia tiba di (tempat) api itu) Yakni setelah Musa sampai di tempat api itu. نُودِىَ أَنۢ بُورِكَ(diserulah dia: “Bahwa telah diberkati) Yakni disucikan. مَن فِى النَّارِ (orang-orang yang berada di dekat api itu) Api itu ternyata hanya cahaya, namun Musa mengira itu adalah api. Ibnu Abbas berkata: Maha Suci dan Maha Tinggi Allah, cahaya itu adalah cahaya Tuhan semesta alam yang berada di pohon. وَمَنْ حَوْلَهَا (dan orang-orang yang berada di sekitarnya) Kemungkinan yang maksud adalah para malaikat. وَسُبْحٰنَ اللهِ رَبِّ الْعٰلَمِينَ (Dan Maha Suci Allah, Tuhan semesta alam) Kalimat ini menunjukkan bahwa Musa meresa takjub dan kaget dari apa yang terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Maka tatkala Musa tiba di tempat api yang dia sangka itu, dan api itu ternyata adalah cahaya, lantas dia mendapat seruan: \"Telah diberkati orang-orang yang berada di dekat api itu, dan orang-orang yang berada di sekitarnya. Maksudnya Musa telah di berkati beserta sebidang tempat di negeri Syam. Jin dan manusia bertasbih kepada Allah dari segala yang tidak patut bagi nama-nama dan sifat-Nya, dan dari segala keburukan. Dan Maha Suci Allah, Tuhan semesta alam\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka ketika dia tiba di sana, dia diseru,“telah diberkahi} telah disucikan {orang yang berada di dekat api dan orang yang berada di sekitarnya} yaitu para malaikat {Maha suci Allah, Tuhan semesta alam} Maha suci Allah Tuhan semesta alam dari segala sesuatu yang tidak pantas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8 “maka tatkala dia tiba di (tempat) api itu, diserulah dia, ’bahwa telah diberkati orang-orang yang berada didekat api itu, dan orang-orang yang berada di sekitarnya,” maksudnya, dia diseru oleh Allah dan dikabarkan kepadanya bahwa ini adalah tempat yang suci lagi diberkati. Di antara berkatnya adalah Allah menjadikannya sebagai tempat untuk Dia berbicara langsung kepada Musa, menyerunya dan mengangkatnya sebagai rasul. “dan Maha suci Allah, Rabb semesta alam,” dari segala dugaan bahwa Dia memiliki kekurangan dan kelemahan. Bahkan dia Mahasempurna dalam sifat dan perbuatanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 8: Kemudian Allah menyeru Musa dan mengabarkan bahwasanya tempat ini di mana terdapat cahaya adalah sebuah tempat yang penuh berkah dan disucikan; Diberkahi siapa yang mengikuti cahaya itu, yaitu Musa, dan diberkahi pula sipa yang disekeliling cahaya tersebut dan mereka adalah para malaikat yang mulia; Kemudian Allah mensucikan diri-Nya dari kekurangan dan aib, Allah mengabarkan bahwa Dialah Tuhan seluruh alam yang tinggi di atas seluruh makhluk-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah memberitahukan, bahwa tempat tersebut adalah tempat suci lagi diberkahi. Karena berkahnya, Allah Subhaanahu wa Ta'aala menjadikannya sebagai tempat Allah berbicara dengan Nabi Musa ‘alaihis salam, memanggilnya dan mengutusnya. Yakni dari perkiraan adanya kekurangan atau keburukan, bahkan Dia sempurna sifat dan perbuatan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 8",
    "description": "Maka tidak berapa lama ketika dia, yakni musa, tiba di sana yaitu tempat api itu, dia diseru oleh satu suara yang tidak ada rupanya, 'telah diberkahi, diberikan kebaikan yang sangat banyak orang yang berada di dekat api, yaitu nabi musa sendiri dan orang-orang yang berada di sekitarnya yaitu penduduk negeri syam, tempat diutusnya para nabi. Mahasuci Allah, tuhan pemelihara seluruh alam dari segala sesuatu yang yang tak layak bagi-Nya. '9. Kemudian Allah memperkenalkan diri-Nya kepada nabi musa. 'wahai musa! sesungguhnya suara yang memanggilmu itu adalah suara-ku, aku adalah Allah, yang mahaperkasa, mahamulia, yang tidak ada kekuatan apa pun yang sanggup mengalahkan-ku mahabijaksana terhadap semua perkataan dan tindakan-ku."
  }
]