[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kamu (wahai Rasul) tidak kuasa untuk memperdengarkan kebenaran kepada orang yang telah dicap hatinya oleh Allah, sehingga mematikan hatinya, dan kamu (juga) tidak mampu untuk memperdengarkan seruan dakwahmu kepada orang yang sudah ditulikan pendengarannya oleh Allah untuk mendengar kebenaran saat mereka membalikkan badan berpaling dari dirimu. Karena orang yang tuli tidak akan bisa mendengar seruan apabila mereka menghadap, apalagi apabila mereka membelakangi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Sesungguhnya engkau -wahai Rasul- tidak mampu menjadikan orang-orang mati, yang hati mereka telah mati karena kekufurannya kepada Allah, bisa mendengar dan engkau juga tidak mampu menjadikan orang yang kehilangan pendengarannya untuk bisa mendengarkan seruanmu kepada mereka, apabila mereka berpaling darimu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Sungguh orang-orang musyrik telah berpaling dari dakwahmu, karena mereka tidak memanfaatkan kemampuan yang telah Allah berikan kepada mereka; mereka seperti mayat yang tidak dapat membuka akal dan hati mereka bagi ayat-ayat al-Qur’an, mereka tuli dan menutup pendengaran mereka dari petunjukn ayat-ayat itu, dan keberpalingan mereka membuat mereka tidak mungkin dapat memanfaatkan pendengaran mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. إِنَّكَ لَا تُسْمِعُ الْمَوْتَىٰ وَلَا تُسْمِعُ الصُّمَّ الدُّعَآءَ (Sesungguhnya kamu tidak dapat menjadikan orang-orang yang mati mendengar dan (tidak pula) menjadikan orang-orang yang tuli mendengar panggilan) Allah menyerupakan orang-orang kafir dengan orang yang telah mati yang tidak dapat merasakan atau berfikir, serta menyerupakan mereka dengan orang tuli sebab mereka tidak mau mendengar nasihat dan pelajaran serta tidak menjawab seruan kepada Allah. إِذَا وَلَّوْا۟ مُدْبِرِينَ(apabila mereka telah berpaling membelakang) Yakni Jika mereka benar-benar berpaling dari kebenaran. Sebab orang tuli tidak dapat mendengar panggilan meski ia berhadapan dengan orang yang memanggil; maka bagaimana keadaannya jika ia malah berpaling dan membelakangi orang yang memanggilnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Sesungguhnya engkau wahai Rasul tidak dapat menjadikan orang-orang kafir itu untuk mendengarkan seruanmu, karena mereka seperti orang mati yang tidak mampu merasakan apa-apa. Mereka seperti orang-orang tuli yang tidak dapat mendengarkan apapun, apabila mereka telah berpaling dan menolak seruan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya kamu tidak dapat menjadikan orang yang mati dan orang yang tuli dapat mendengar seruan apabila mereka telah berpaling ke belakang} kembali berpaling darimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Apabila kamu telah melaksanakan apa yang dibebankan kepadamu dan kamu telah bertawakal kepada Allah dalam semua itu, maka kesesatan orang yang sesat tidak akan membahayakanmu, dan bukan kewajibanmu memberi petunjuk mereka. Maka dari itu Allah berfirman, “Sesungguhnya kamu tidak dapat menjadikan orang-orang yang mati dapat mendengar dan (tidak pula) menjadikan orang-orang yang tuli mendengar panggilan.” Maksudnya, pada saat kamu mengajak dan memanggil mereka, terutama “apabila mereka telah berpaling ke belakang,” karena hal itu akan menjadi lebih parah dalam membuat mereka tidak mendengar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 80: Allah mengabarkan kepada Nabi-Nya ﷺ bahwa di antara mereka orang-orang kafir terdapat satu kaum yang semisal dengan mayat yang tidak dapat merasakan dan berpikir, seperti tuli yang tidak mendengar. Karena sebab mereka berpaling dari kebenaran dengan pengingkaran yang sangat, mereka menolak ucapan dan mendengar dari Nabi ﷺ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengumpamakan mereka (orang-orang kafir) dengan orang-orang yang mati, tuli dan buta. Karena hal ini lebih menunjukkan bahwa mereka tidak mau mendengarkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 80",
    "description": "Keengganan mereka beriman pada hakikatnya disebabkan oleh tertutupnya mata dan telinga mereka, dan memang sungguh, engkau wahai nabi Muhammad, tidak dapat menjadikan orang yang mati hatinya dapat mendengar kebenaran, sebab mereka telah kehilangan kesadarannya, dan engkau tidak pula dapat menjadikan orang yang tuli karena menutup diri, dapat mendengar seruan, lebih-lebih apabila mereka telah berpaling lari berbalik ke belakang, sehingga tidak memiliki kesiapan untuk mendengarkan dakwahmu. 81. Keadaan mereka juga sama dengan orang yang buta, dan engkau tidak akan dapat memberi petunjuk jalan kebenaran kepada orang yang buta mata hatinya akibat dari kesesatannya itu. Engkau tidak dapat menjadikan seorang pun mendengar, kecuali orang-orang yang beriman kepada ayat-ayat kami, lalu mereka tunduk patuh dan berserah diri kepada Allah secara mantap dan kukuh."
  }
]