[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu (wahai Rasul) tidak akan dapat memberi hidayah dari kesesatan bagi orang yang telah dibutakan oleh Allah dari melihat kebenaran dan jalan lurus. Dan tidak mungkin bagimu untuk memperdengarkannya, kecuali kepada orang yang mengimani ayat-ayat Kami, dan mereka itu berserah diri, taat dan menyambut seruan dakwahmu kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Engkau bukanlah pemberi petunjuk bagi orang yang hatinya telah buta dari kebenaran, maka janganlah engkau bersedih atas mereka sehingga jiwamu mejadi lelah, Engkau tidak bisa membuat dakwahmu didengarkan kecuali oleh orang-orang yang beriman kepada ayat-ayat Kami dan mereka tunduk kepada perintah-perintah Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Hai Rasulullah, kamu tidak akan mampu memberi petunjuk bagi orang yang buta penglihatan dan hatinya terhadap keimanan. Dan jika orang yang dapat mendengar berharap mengetahui orang-orang yang berlawanan dengan itu maka mereka adalah orang-orang yang menerima dakwah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَمَآ أَنتَ بِهٰدِى الْعُمْىِ عَن ضَلٰلَتِهِمْ ۖ (Dan kamu sekali-kali tidak dapat memimpin (memalingkan) orang-orang buta dari kesesatan mereka) Yakni kamu tidak akan mampu memberi petunjuk bagi orang yang dibutakan Allah dari kebenaran, yaitu petunjuk yang dapat mengantarkannya kepada keimanan. إِن تُسْمِعُ إِلَّا مَن يُؤْمِنُ بِـَٔايٰتِنَا(Kamu tidak dapat menjadikan (seorangpun) mendengar, kecuali orang-orang yang beriman kepada ayat-ayat Kami) Yakni kamu hanya dapat menjadikan mendengar orang yang percaya terhadap al-Qur’an sehingga ia menerima dan meridhainya; dan bukan orang yang ingkar terhadapnya. فَهُم مُّسْلِمُونَ (lalu mereka berserah diri) Yakni mereka taat dan rela."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Kamu sekali-kali tidak dapat menuntun dan mengeluarkan orang-orang yang buta mata dan hati dari kesesatan menuju cahaya kebenaran dan iman. Kamu tidak dapat menjadikan seorangpun mendengar, kecuali orang-orang yang beriman kepada Alquran. Mereka adalah orang-orang yang mendapat petunjuk kepada jalan Tuhan mereka, mereka senantiasa berserah diri dengan mengesakan dan taat kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu bukanlah pemberi petunjuk bagi orang-orang yang buta dari kesesatannya. Kamu tidak dapat menjadikan bisa mendengar, kecuali orang yang beriman pada ayat-ayat Kami dan mereka berserah diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “Dan kamu sekali-kali tidak dapat memimpin orang-orang yang buta dari kesesatan mereka,” sebagaimana di FirmankanNYa di dalam ayat lain, \"Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya, dan Allah lebih mengetahui orang-orang yang mau menerima petunjuk.\" (Al-Qashash:56). “Kamu tidak dapat menjadikan (seorang pun) mendengar, kecuali orang-orang yang beriman kepada ayat-ayat Kami, lalu mereka berserah diri.” Maksudnya, mereka yang patuh kepadamu, yaitu orang-orang yang beriman kepada ayat-ayat Allah dan tunduk kepadanya dengan perbuatan dan kepasrahan mereka, sebagaimana yang difirmankan Allah, \"Hanya orang-orang yang mendengar sajalah yang mematuhi (seruan Allah), dan orang-orang yang mati (hatinya), akan dibangkitkan oleh Allah, kemudian kepada-Nya-lah mereka dikembalikan.\" (Al-An’Am: 36)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 81: Allah juga mengabarkan bahwa Nabi ﷺ tidak dapat memberikan hidayah dari kesesatanyang buta hatinya dari petunjuk dan jalan yang lurus. Dan tidaklah dapat mendengar firman Allah kecuali bagi siapa yang mengharapkan keberhasilan dam keselamatan dari api neraka, dan mereka adalah orang-orang yang memenuhi atas apa yang telah didakwahkan kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mereka yang beriman kepada ayat-ayat Allah disertai sikap tunduk kepada ayat-ayat itu dengan amal mereka dan sikap menyerahkan diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 81",
    "description": "Keadaan mereka juga sama dengan orang yang buta, dan engkau tidak akan dapat memberi petunjuk jalan kebenaran kepada orang yang buta mata hatinya akibat dari kesesatannya itu. Engkau tidak dapat menjadikan seorang pun mendengar, kecuali orang-orang yang beriman kepada ayat-ayat kami, lalu mereka tunduk patuh dan berserah diri kepada Allah secara mantap dan kukuh. 82. Dan apabila perkataan, yaitu ketentuan masa kehancuran alam dan datangnya kiamat, telah berlaku atas mereka, kami keluarkan di akhir zaman nanti makhluk bergerak yang bernyawa dari bumi, berupa binatang melata atau manusia, yang akan mengatakan kepada mereka antara lain mengatakan bahwa manusia yang durhaka dan mengingkari hari kebangkitan selalu tidak yakin kepada ayat-ayat, yakni tanda-tanda keesaan dan kekuasaan kami yang terhampar di alam raya."
  }
]