[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila ketetapan azab telah jatuh pada mereka karena mereka terus menerus hanyut dalam maksiat dan perbuatan yang melampaui batas serta sikap berpaling mereka dari ajaran syariat Allah dan hukumNya, sehingga mereka menjadi makhluk Allah yang paling jahat, maka Kami keluarkan kepada mereka dari muka bumi di akhir zaman satu pertanda dari tanda-tanda kiamat yang besar, yaitu sejenis binatang yang akan memberitahukan kepada mereka bahwa sesungguhnya manusia yang mengingkari hari kebangkitan, mereka itu tidak mengimani al-Qur’an, Muhammad dan ajaran agamanya dan tidak juga beramal shalih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Jika siksa telah pasti dan telah tetap atas mereka karena pendirian mereka atas kekufuran dan kemaksiatan lalu yang tersisa hanya manusia-manusia jahat, maka ketika Kiamat sudah dekat, Kami keluarkan untuk mereka suatu tanda dari tanda-tanda besar Kiamat, yaitu seekor binatang melata dari bumi yang berbicara kepada mereka dengan bahasa yang mereka pahami, bahwa manusia sudah tidak percaya dengan ayat-ayat Kami yang diturunkan kepada Nabi Kami."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Dan jika datang kepada mereka janji Kami, maka Kami akan menampakkan kepada mereka tanda kiamat kubra, yaitu munculnya hewan yang berbicara kepada mereka bahwa manusia telah telah berpaling dan ragu terhadap ayat-ayat Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَإِذَا وَقَعَ الْقَوْلُ عَلَيْهِمْ (Dan apabila perkataan telah jatuh atas mereka) Yakni jika mereka telah pantas mendapatkan azab serta berbagai kengerian yang dulu mereka ingin disegerakan; hal ini terjadi ketika kedatangan hari kiamat telah dekat أَخْرَجْنَا لَهُمْ دَآبَّةً مِّنَ الْأَرْضِ(Kami keluarkan sejenis binatang melata dari bumi) Allah lebih mengetahui bagaimana sifat dan bentuk binatang melata ini. Kemunculan binatang ini merupakan salah satu tanda hari kiamat telah dekat. تُكَلِّمُهُمْ (yang akan mengatakan kepada mereka) Yakni binatang itu akan berbicara kepada manusia. أَنَّ النَّاسَ كَانُوا۟ بِـَٔايٰتِنَا لَا يُوقِنُونَ (bahwa sesungguhnya manusia dahulu tidak yakin kepada ayat-ayat Kami) Ia memberi tahu manusia bahwa orang ini adalah orang beriman, sedangkan orang itu adalah orang kafir. Imam Muslim meriwayatkan hadits marfu’ dari Ibnu Umar: “tanda hari kiamat yang paling pertama muncul adalah terbitnya matahari dari barat dan keluarnya binatang melata di hadapan orang-orang pada permulaan siang.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Apabila isi kalam Allah telah jatuh sebagai janji atas mereka para orang kafir, sehingga azab bagi mereka benar-benar mereka terima pada hari kiamat. Kami keluarkan sejenis binatang melata dari bumi yaitu aljassasah, Allah lah Yang Maha tahu gambaran yang pasti tentangnya. Binatang itu akan memberitahu mereka, bahwa sesungguhnya manusia dahulu tidak yakin kepada ayat-ayat Allah yang telah mengabarkan tentang kedatangan hari kiamat. Maksud ayat-ayat tersebut adalah ayat yang turun dalam kitab-kitab samawi. Begitu juga ayat-ayat yang kauniyah yang menunjukkann sifat wujud Allah, sifat Maha Satu dan kebenaran para rasul-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila perkataan itu telah berlaku} azab itu wajib berlaku {atas mereka, Kami mengeluarkan makhluk bergerak dari bumi yang akan mengatakan kepada mereka} yang berbicara kepada mereka dengan perkataan yang mereka pahami {bahwa manusia selama ini tidak yakin pada ayat-ayat Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Maksudnya, apabila telah jatuh atas manusia “perkataan” yang telah dipastikan oleh Allah dan telah ditetapkan waktunya; “Kami keluarkan sejenis binatang melata,” yang keluar “dari bumi” atau salah satu binatang melata yang ada di bumi, bukan dari langit. Dan binatang melata ini “akan mengatakan kepada mereka,” akan mengatakan kepada manusia, “bahwa sesungguhnya manusia dahulu tidak yakin kepada ayat-ayat Kami,” maksudnya, karena manusia sangat lemah pengetahuan dan keyakinan mereka kepada ayat-ayat Allah. Maka Allah memunculkan binatang melata tersebut sesbagai salah satu mukjizat Allah yang sangat menakjubkan, untuk menjelaskan kepada manusia apa yang dahulu mereka ragukan. Dan binatang melata ini yang dikenal akan muncul di akhir zaman, dan ia akan menjadi salah satu dari tanda-tanda kiamat, sebagaimana dijelaskan di dalam banyaak hadits. [Allah dan RasulNya tidak menjelaskan bentuk binatang melata ini, dan yang dijelaskan hanya pengaruhnya saja dan maksud darinya, dan bahwa ia merupakan salah satu dari ayat-ayat (tanda-tanda kebenaran) Allah; ia akan berkata kepada manusia dengan perkataan yang diluar dari kebiasaan di saat perkataan (putusan Allah) jatuh pada manusia dan di saat mereka meragukan ayat-ayat Allah, sehingga ia menjadi hujjah (argemen) dan bukti bagi orang-orang yang beriman, dan hujjah terhadap orang-orang yang menentang]."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 82: Allah menyebutkan tanda di antara tanda-tanda kiamat besar yaitu keluarnya hewan melata; Di mana bersamaan dengan tertutupnya pintu taubat, kemudian terbit matahari dari barat, yang mengharuskan adzab bagi orang-orang kafir karena sebab terus menerusnya mereka dari maksiat dan melampau batas serta berpaling dari Allah dan hukum-Nya; Allah mengeluarkan hewan melata untuk menyingkap orang-orang kafir dan sebagai pengkabaran bahwa orang-orang yang ingkar kepada hari kebangkitan, mereka adalah orang-orang yang tidak membenarkan Al Qur’an dan juga Rasul Muhammad ﷺ. Berkata ulama umat, Ibnu Abbas : Keluarnya hewan melata dan terbitnya matahari dari barat adalah akhir dari tanda-tanda kiamat. Dan di shahih muslim dari Ibnu Umar secara marfu’ : Sesungguhnya di antara tanda-tanda pertama kali dari hari kiamat besar adalah : Terbitnya matahari di barat dan keluarnya hewan melata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keluarnya binatang melata yang dapat berbicara dengan manusia merupakan salah satu di antara tanda-tanda kiamat. Mereka tidak beriman kepada Al Qur’an yang menerangkan tentang kebangkitan, hisab dan pembalasan. Oleh karena lemahnya ilmu dan keyakinan mereka kepada ayat-ayat Allah, maka Allah mengeluarkan binatang melata tersebut yang merupakan ayat-ayat Allah yang menakjubkan untuk menerangkan kepada manusia apa yang mereka perselisihkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 82",
    "description": "Dan apabila perkataan, yaitu ketentuan masa kehancuran alam dan datangnya kiamat, telah berlaku atas mereka, kami keluarkan di akhir zaman nanti makhluk bergerak yang bernyawa dari bumi, berupa binatang melata atau manusia, yang akan mengatakan kepada mereka antara lain mengatakan bahwa manusia yang durhaka dan mengingkari hari kebangkitan selalu tidak yakin kepada ayat-ayat, yakni tanda-tanda keesaan dan kekuasaan kami yang terhampar di alam raya. 83. Setelah keluar d'bbah, terjadilah kiamat dengan kejadian yang diurai di sini. Dan ingatlah, wahai nabi Muhammad, pada hari ketika kami mengumpulkan dari setiap umat, suka atau tidak suka, segolongan orang yang selalu mendustakan ayat-ayat kami, baik yang terhampar di alam raya maupun yang terbaca dalam kitab suci, lalu mereka dibagi-bagi dalam kelompok-kelompok. Mereka itu adalah para pembesar yang menjadi panutan. Mereka akan digiring di depan pengikut mereka untuk dimintakan pertanggungjawaban dan mendapatkan pembalasan."
  }
]