[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada Hari kami menghimpun dari tiap-tiap umat segolongan orang yang mendustakan dalil-dalil dan hujjah-hujjah Kami, dimana barisan pertama dari mereka ditahan hingga orang-orang yang terakhir dari mereka supaya mereka semua dapat bergabung menjadi satu. Kemudian mereka digiring menuju proses perhitungan amal perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Ingatlah -wahai Rasul- suatu hari saat Kami mengumpulkan dari setiap umat sekelompok dari pembesar-pembesar mereka yang telah mendustakan ayat-ayat Kami, dari mulai awal hingga akhir dari mereka yang membantah, kemudian mereka digiring menuju perhitungan amal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Hai Muhammad, ingatlah ketika dibangkitkan golongan orang-orang durhaka, yaitu para pemimpin orang-orang sesat yang secara terang-terangan menentang dan berpaling dari syariat Allah; mereka yang pertama-tama menghadap Tuhan mereka dan menyaksikan kengerian azab, mereka akan mendapat kehinaan; kemudian mereka akan digiring dan dikumpulkan dengan golongan mereka yang lain dalam keadaan yang menghinakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَهُمْ يُوزَعُونَ(lalu mereka dibagi-bagi) Yakni ingatlah Hai Muhammad, hari ketika Kami mengumpulkan orang-orang yang mendustakan ayat-ayat Kami dari setiap umat, sehingga ketika itu orang yang terdahulu dari mereka akan berbantah dengan orang yang datang di generasi selanjutnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Ingatlah wahai Nabi, hari ketika Kami kumpulkan golongan tiap-tiap umat yaitu orang-orang yang mendustakan ayat-ayat Kami baik berupa kitab maupun rasul. Lalu mereka dibagi-bagi dalam kelompok-kelompok. Kemudian mereka diseret menuju tempat perkumpulan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) Kami mengumpulkan} mengumpulkan {segolongan} satu golongan {dari setiap umat, yaitu orang yang mendustakan ayat-ayat Kami, lalu mereka dibagi-bagi} mereka didorong dan digiring menuju tempat hisab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Allah mengabarkan tentang keadaan orang-orang yang mendustakan di suatu tempat pemberhentian pada Hari Kiamat, dan bahwasanya Allah akan menghimpun mereka dan setiap umat akan dikumpulkan secara bergelombang dan berkelompok, “dari orang-orang yang mendustakan ayat-ayat Kami, lalu mereka dibagi-bagi,” dikumpulkan dari yang terdahulu kepada yang terakhir, dan yang terakhir kepada yang terdahulu, agar pertanyaan, cercaan dan makian meliputi mereka semua."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 83: Allah kemudian menutup surat ini dengan sebagian keadaan-keadaan hari kebangkitan dan kengeriannya serta kedahsyatannya. Pada hari itu berubah bumi, pada hari itu Allah mengumpulkan seluruh umat dengan satu jamaah yang mereka mengingkari ayat-ayat Allah dan dalil-dalil dari-Nya yang nyata. Kemudian mereka berdiri di hadapan Allah dengan hina dan penuh pengagungan kepada-Nya, mereka tidak saling-mendahului satu sama lain, kemudian mereka berdiri ditempat yang Allah inginkan atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan orang-orang yang mendustakan di padang mahsyar, dan bahwa Allah akan mengumpulkan mereka. Dia mengumpulkan dari setiap umat satu golongan di antara mereka yang mendustakan ayat-ayat-Nya, dari yang terdahulu hingga yang datang kemudian, lalu disatukan, agar pertanyaan, cercaan dan celaan merata kepada mereka. Yaitu para tokohnya yang menjadi panutan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 83",
    "description": "Setelah keluar d'bbah, terjadilah kiamat dengan kejadian yang diurai di sini. Dan ingatlah, wahai nabi Muhammad, pada hari ketika kami mengumpulkan dari setiap umat, suka atau tidak suka, segolongan orang yang selalu mendustakan ayat-ayat kami, baik yang terhampar di alam raya maupun yang terbaca dalam kitab suci, lalu mereka dibagi-bagi dalam kelompok-kelompok. Mereka itu adalah para pembesar yang menjadi panutan. Mereka akan digiring di depan pengikut mereka untuk dimintakan pertanggungjawaban dan mendapatkan pembalasan. 84. Hingga apabila mereka datang di tempat yang ditentukan dan berdiri di hadapan Allah untuk diperhitungkan amal perbuatannya, dengan nada mencemooh para pendusta itu, dia Allah berfirman, 'mengapa kamu telah mendustakan ayat-ayat-ku yang telah disampaikan oleh para utusan-ku dan yang telah ku-hamparkan di alam raya, padahal kamu tidak mempunyai pengetahuan tentang itu, karena kamu tidak berpikir dan merenungkannya terlebih dahulu. Atau apakah yang telah kamu kerjakan selama itu, padahal kami tidak menciptakan kamu untuk sesuatu yang sia-sia''."
  }
]