[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "84-85. Hingga ketika telah datang dari tiap-tiap umat segolongan orang dari orang-orang yang mendustakan ayat-ayat Kami, dan mereka sudah berkumpul, Allah berfirman kepada mereka, “Apakah kalian mendustakan ayat-ayatKu yang telah Aku turunkan kepada para rasulKu, dan mendustakan ayat-ayatKu yang Aku jadikan sebagai petunjuk atas kewajiban bertauhid kepadaKu dan hakKu untuk diibadahi, sedang kalian tidak mengetahui tentang kebatilannya, sehingga kalian kemudian berpaling darinya dan mendustakannya? Atau apakah yang telah kalian kerjakan?” Dan telah jatuh ketetapan siksaan pada mereka, disebabkan kezhaliman dan pendustaan mereka. Mereka itu tidak berbicara dengan dasar hujjah yang dapat mereka jadikan sebagai penolak siksaan buruk yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Mereka terus digiring hingga sampai kepada tempat untuk menimbang amal mereka, Allah berfirman kepada mereka sebagai bentuk hinaan atas mereka, “Kalian telah mendustakan ayat-ayat-Ku yang menunjukkan keesaan-Ku dan mencakup syariat-syariat-Ku, kalian tidak mau tahu dan menganggap itu sebagai kebatilan hingga kalian cepat mendustakannya, atau adakah hal lain yang kalian lakukan terhadapnya dalam hal membenarkan dan mendustakannya?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Orang-orang durhaka yang mendustakan itu akan mendahului kaum mereka untuk menghadapi pertanyaan sulit pada hari yang berat untuk dilalui: “Bagaimana kalian menyikapi ayat-ayat Allah yang disampaikan kepada kalian untuk menjelaskan kekuasaan Allah dan keesaan-Nya? Kalian enggan untuk memahaminya, dan kalian mendustakan dan berpaling darinya. Dan apa yang telah kalian lakukan di kehidupan kalian yang panjang itu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. حَتَّىٰٓ إِذَا جَآءُو (Hingga apabila mereka datang) Yakni datang ke tempat mereka dihisab. قَالَ(Allah berfirman) Allah berfirman kepada mereka. أَكَذَّبْتُم بِـَٔايٰتِى(Apakah kamu telah mendustakan ayat-ayat-Ku) Yang telah Aku turunkan kepada rasul-rasul-Ku yang aku perintahkan untuk menyampaikannya kepada kalian. وَلَمْ تُحِيطُوا۟ بِهَا عِلْمًا(padahal ilmu kamu tidak meliputinya) Namun kalian buru-buru mendustakannya sebelum memahami hakikat sebenarnya dan mengetahui makna dan dalilnya; sehingga orang yang melakukan itu layak untuk ditimpa musibah yang menghentikannya dari kebodohan, kesesatan, dan tuduhan terhadap apa yang tidak mereka pahami dan ketahui hakikatnya. أَمَّاذَا كُنتُمْ تَعْمَلُونَ (atau apakah yang telah kamu kerjakan?) Sehingga itu menyibukkan kalian dari memperhatikan ayat-ayat Kami dan memikirkan makna-maknanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Hingga apabila mereka telah berada pada tempat penghitungan amal, Allah berfirman: \"Apakah kamu telah mendustakan ayat-ayat-Ku yang telah turun kepada para rasul-Ku? Kemudian kalian juga tidak mempelajarinya, tidak memahami makna dan berbagai buktinya, bahkan kalian mendustakannya. Lalu apa yang sebenarnya telah kalian kerjakan setelah itu, sehingga kalian tidak menelaah dan mempelajarinya?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sehingga apabila mereka datang, Dia berfirman} Allah berfirman kepada mereka {“Mengapa kamu mendustakan ayat-ayatKu, padahal kalian tidak mempunyai pengetahuan tentang itu atau apa yang selalu kalian lakukan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. “Hingga apabila mereka datang,” hadir; Allah berkata kepada mereka dengan mencela dan mencerca, “Apakah kamu telah mendustakan ayat-ayatKu, padahal ilmumu tidak meliputinya.” Maksudnya, yang wajib atas kalian adalah menahan diri (abstain) hingga kebenaran menjadi terbuka bagi kalian, dan kalian (wajib) tidak berbicara kecuali berdasarkan pengetahuan. Lalu bagaimana mungkin kalian mendustakan sesuatu perkara yang kalian sama sekali tidak mempunyai ilmu tentangnya, “atau apakah yang telah kamu kerjakan?” maksudnya, mereka ditanya tentang ilmu dan perbuatan mereka; lalu ternaya Allah menemukan ilmu mereka adalah pendustaan terhadap kebenaran, dan perbuatan mereka (dipersembahkan) untuk selain Allah, atau tidak berdasarkan Sunnah Rasul mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 84: Allah kemudian menjelaskan bahwa ketika mereka hadir pada hari itu, maka mereka akan dalam keadaan dihisab; Allah berkata kepada mereka : Apakah kalian menolak akan ayat-ayat-Ku dan tidak beriman kepadanya ? dan apakah kalian secara langsung menolak dan mendustakan sebelum kalian memikirkannya dan tergambar dengan gambaran yang benar ? Itulah sebab dari kebinasaan kalian! Atau apa yang kalian kerjakan dan dengan apa kalian menjadi tersibukkan di dunia ?!."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ke tempat hisab. Maksudnya, mendustakan ayat-ayat Allah, tanpa memikirkannya lebih dahulu sampai jelas masalahnya. Allah Subhaanahu wa Ta'aala bertanya kepada mereka tentang ilmu mereka dan amal mereka, namun ternyata ilmu mereka adalah mendustakan yang hak tanpa berpikir terlebih dahulu, sedangkan amal mereka adalah untuk selain Allah atau tidak di atas sunnah Rasulullah shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 84",
    "description": "Hingga apabila mereka datang di tempat yang ditentukan dan berdiri di hadapan Allah untuk diperhitungkan amal perbuatannya, dengan nada mencemooh para pendusta itu, dia Allah berfirman, 'mengapa kamu telah mendustakan ayat-ayat-ku yang telah disampaikan oleh para utusan-ku dan yang telah ku-hamparkan di alam raya, padahal kamu tidak mempunyai pengetahuan tentang itu, karena kamu tidak berpikir dan merenungkannya terlebih dahulu. Atau apakah yang telah kamu kerjakan selama itu, padahal kami tidak menciptakan kamu untuk sesuatu yang sia-sia''85. Mereka tidak mendapat dalih untuk membela diri. Mereka bersalah, dan dengan demikian berlakulah perkataan berupa janji azab Allah atas mereka karena kezaliman mereka, maka mereka tidak dapat berkata, bukan saja karena tidak ada dalih yang dapat mereka katakan, tetapi lebih-lebih karena sangat pedihnya azab yang mereka rasakan. Mereka tidak mampu mengelak dan berdalih."
  }
]