[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "84-85. Hingga ketika telah datang dari tiap-tiap umat segolongan orang dari orang-orang yang mendustakan ayat-ayat Kami, dan mereka sudah berkumpul, Allah berfirman kepada mereka, “Apakah kalian mendustakan ayat-ayatKu yang telah Aku turunkan kepada para rasulKu, dan mendustakan ayat-ayatKu yang Aku jadikan sebagai petunjuk atas kewajiban bertauhid kepadaKu dan hakKu untuk diibadahi, sedang kalian tidak mengetahui tentang kebatilannya, sehingga kalian kemudian berpaling darinya dan mendustakannya? Atau apakah yang telah kalian kerjakan?” Dan telah jatuh ketetapan siksaan pada mereka, disebabkan kezhaliman dan pendustaan mereka. Mereka itu tidak berbicara dengan dasar hujjah yang dapat mereka jadikan sebagai penolak siksaan buruk yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Maka mereka pun tertimpa siksa karena kezaliman mereka dengan berbuat kekufuran terhadap Allah dan pendustaan terhadap ayat-ayat-Nya, dan mereka tidak bisa berbicara untuk membela diri mereka masing-masing karena ketidakmampuan mereka dan Ketidakabsahan argumen mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Demikianlah kengerian azab yang mereka hadapi di waktu yang menakutkan itu, ketika mereka berhak mendapat ketetapan berupa azab akibat kesyirikan yang telah mereka lakukan dan kedustaan mereka terdahap para rasul. Allah telah memenuhi balasan yang berhak mereka dapatkan; mereka tidak mampu mengingkarinya atau mengemukakan alasan, sehingga mereka hanya diam seribu bahasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. وَوَقَعَ الْقَوْلُ عَلَيْهِم بِمَا ظَلَمُوا۟ (Dan jatuhlah perkataan (azab) atas mereka disebabkan kezaliman mereka) Yakni mereka berhak mendapatkan siksaan karena kezaliman mereka dan kezaliman yang paling besar adalah menyekutukan Allah. فَهُمْ لَا يَنطِقُونَ (maka mereka tidak dapat berkata) Yakni mereka tidak dapat mengajukan alasan saat azab itu terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Maka mereka benar-benar ditimpa azab, disebabkan kezaliman mereka sendiri yaitu syirik dan mendustakan ayat-ayat Allah. Maka mereka tidak dapat berkata apa-apa untuk meminta ampunan ketika azab melalap mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berlakulah perkataan} wajib berlaku azab {atas mereka karena kezaliman mereka sehingga mereka tidak dapat bisa berkata} tidak bisa berkata dengan alasan untuk menolak azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. “Dan jatuhlah perkataan (azab) atas mereka disebabkan kezhalliman mereka.” Maksudnya, sudah menjadi hak atas mereka jatuhnya azab disebabkan kezhaliman mereka yang terus mereka kerjakan, sementara hujjah telah dihadapkan atas mereka, “Maka mereka tidak dapat berkata,” karena mereka sama sekali tidak memiliki hujjah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 85: Allah menjelaskan bahwa adzab adalah keharusan dan kemestian bagi mereka karena sebab kedzaliman mereka dan kesyirikan mereka serta pelampauan batas mereka; Mereka tidak sama sekali memiliki udzur yang meringankan mereka. Mereka akan terdiam dan sepakat (atas akibat yang akan menimpa mereka)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena mereka tetap terus di atasnya serta hujjah telah mengalahkan mereka. Karena mereka sudah tidak memiliki hujjah lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 85",
    "description": "Mereka tidak mendapat dalih untuk membela diri. Mereka bersalah, dan dengan demikian berlakulah perkataan berupa janji azab Allah atas mereka karena kezaliman mereka, maka mereka tidak dapat berkata, bukan saja karena tidak ada dalih yang dapat mereka katakan, tetapi lebih-lebih karena sangat pedihnya azab yang mereka rasakan. Mereka tidak mampu mengelak dan berdalih. 86. Perhatikanlah apa yang dialami manusia setiap hari untuk mendekatkan pemahaman tentang hari kebangkitan. Apakah mereka tidak memperhatikan bahwa kami telah menjadikan malam agar mereka beristirahat padanya dengan tidur dan menjadikan siang yang menerangi agar mereka dapat bekerja dan mencari nafkah' sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran dan kekuasaan Allah yang bermanfaat bagi orang-orang yang beriman, antara lain menjadi bukti kuasa-Nya menghidupkan manusia setelah kematiannya."
  }
]