[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang mendustakan ayat-ayat Kami itu tidak melihat bahwa sesungguhnya Kami telah menjadikan malam hari sebagai waktu mereka beristirahat dan tidur, dan siang hari mereka dapat melihat dengan terang untuk berusaha dalam mencari penghidupan mereka? Sesungguhnya dalam kejadian pengendalian keduanya benar-benar terdapat petunjuk bagi kaum yang mengimani kesempurnaan kekuasaan Allah, keesaan dan agungnya kenikmatan-kenikmatan dariNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. “Tidakkah orang-orang yang mendustakan kebangkitan itu melihat bahwa Kami telah menjadikan malam sebagai tempat untuk mereka beristirahat dengan tidur dan Kami jadikan siang itu terang agar mereka bisa melihat dan mulai bekerja. Sesungguhnya di dalam kematian yang berulang-ulang dan di dalam kebangkitan setelahnya itu benar-benar terdapat tanda-tanda adanya kebangkitan setelah kematian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Ayat-ayat ini tertuju kepada akal dan hati orang-orang yang mendustakannya, agar akal dan hati itu tidak dikuasai oleh pemandangan yang setiap hari mereka saksikan, sehingga mereka tidak memikirkan tentang siapa yang telah menciptakan siang dan malam dan yang telah membuatnya bergerak dengan perhitungan yang teliti. Sepatutnya mereka dapat meninggalkan kesyirikan jika menyaksikan tanda kebesaran Allah dalam pergantian siang dan malam. Allah menjadikan malam gelap gulita agar manusia dapat mendapat ketenangan, dan menjadikan siang terang benderang agar sesuai dengan pergerakan manusia. Bukankah tanda-tanda ini dan semisalnya yang ada di alam semesta dapat mendatangkan keimanan kepada Allah, kekuasaan-Nya, dan kebesaran nikmat-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. أَلَمْ يَرَوْا۟ أَنَّا جَعَلْنَا الَّيْلَ لِيَسْكُنُوا۟ فِيهِ وَالنَّهَارَ مُبْصِرًا ۚ (Apakah mereka tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan malam supaya mereka beristirahat padanya dan siang yang menerangi?) Yakni Kami menjadikan malam sebagai ketenangan, istirahat, dan waktu untuk tidur; ini karena kegelapan dan hawa dingin pada malam hari, sehingga manusia tidak bekerja pada waktu malam. Dan Kami jadikan siang terang sehingga manusia dapat melihat mata pencaharian yang mereka harus kerjakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Apakah mereka tidak tahu dan tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan malam yang gelap supaya mereka dapat beristirahat dan tidur. Juga siang yang terang supaya mereka bisa bekerja, mencari rizki dan mencari penghasilan. Sesungguhnya pada yang demikian itu terdapat tanda-tanda kekuasaan Allah yang nyata bagi orang-orang yang beriman kepada Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak memperhatikan bahwa Kami telah menciptakan malam agar mereka beristirahat padanya dan siang yang terang} yang terang bersinar sehingga bisa melihat padanya {Sesungguhnya pada yang demikian itu terdapat tanda-tanda bagi kaum beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Maksudnya, apakah mereka tidak menyaksikan tanda yang sangat besar ini dan kenikmatan yang sangat agung ini, yaitu Allah telah menundukkan malam dan siang untuk mereka. Malam dengan kegelapannya adalah agar mereka bisa tenang dan istirahat dari kelelahan dan agar bisa bersiap untuk bekerja; dan siang dengan cahayanya agar mereka bisa bertebaran di dalam (mencari) kehidupan dan (membantu) aktivitas mereka. “Sesungguhnya pada demikian itu terdapat tanda-tanda bagi orang-orang yang beriman” yang menunjukkan kesempurnaan keesaan Allah dan berlimpahnya karuniaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 86: Apakah mereka orang-orang yang mendustakan tidak melihat akan dua tanda pada malam dan siang ? Yang menjadikan mereka mendapat ilham ? Apakah mereka tidak melihat tanda-tanda malam dan bagaimana Allah menjadikannya gelap sehingga tenang dan untuk beristirahat ? Apakah mereka tidak melihat tanda-tanda dari siang, dan bagaimana Allah menjadikannya terang untuk melihat sebagai bentuk usaha mereka dari mencari rezeki bagi mereka, di mana mereka mesti mencarinya ?! Sesungguhnya pada tanda-tanda ini adalah sebagai tanda kekuasaan (Allah) yang terang dan nyata bagi siapa yang memiliki akal yang kemudian menunjukinya kepada iman kepada Allah dan keesaan-Nya, dan benarnya peribadatan hanya kepada-Nya saja tanpa selain dari-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ayat sekaligus nikmat yang besar ini, yaitu ditundukkan-Nya malam dan siang untuk mereka. Dengan adanya malam, mereka dapat merasakan ketenangan dan dapat beristirahat dari kelelahan serta bersiap-siap kembali untuk bekerja. Dengan adanya siang, mereka dapat bertebaran di muka bumi untuk mencari penghidupan dan melakukan kegiatan. Yakni tanda yang menunjukkan sempurnanya keesaan Allah dan luas nikmat-Nya. Disebutkan mereka secara khusus, karena hanya mereka yang dapat mengambil manfaat darinya, berbeda dengan orang-orang kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 86",
    "description": "Perhatikanlah apa yang dialami manusia setiap hari untuk mendekatkan pemahaman tentang hari kebangkitan. Apakah mereka tidak memperhatikan bahwa kami telah menjadikan malam agar mereka beristirahat padanya dengan tidur dan menjadikan siang yang menerangi agar mereka dapat bekerja dan mencari nafkah' sungguh, pada yang demikian itu benar-benar terdapat tanda-tanda kebesaran dan kekuasaan Allah yang bermanfaat bagi orang-orang yang beriman, antara lain menjadi bukti kuasa-Nya menghidupkan manusia setelah kematiannya. 87. Dan ingatlah, serta ingatkanlah umatmu, wahai nabi Muhammad, pada hari ketika sangkakala ditiup oleh malaikat israfil atas izin Allah, maka terkejutlah siapa dan apa yang ada di langit dan apa yang ada di bumi oleh dahsyatnya suara sangkakala tersebut, kecuali siapa dan apa yang dikehendaki Allah untuk dimuliakan. Dan semua mereka datang menghadap-Nya dengan merendahkan diri dan dalam keadaan hina."
  }
]