[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul) hari ketika malaikat akan meniup sangkakala, sehingga terkejutlah semua makhluk yang ada di langit dan di bumi dengan dahsyat karena tiupan yang mengerikan tersebut, kecuali orang yang Allah kecualikan dari orang-orang yang Allah muliakan dan dilindungi dari keterkejutan mendengarnya. Dan seluruh makhluk akan datang kepada Tuhan mereka dalam keadaan hina dina lagi tunduk patuh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Ingatlah -wahai Rasul- pada suatu hari ketika Malaikat yang ditugaskan untuk meniup terompet meniupnya pada tiupan kedua, maka semua yang berada di langit dan di bumi terkejut, selain yang dikecualikan oleh Allah untuk tidak terkejut, sebagai bentuk anugerah dari-Nya. Dan setiap makhluk Allah mendatangi-Nya pada Hari itu dengan taat dan hina."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Hai Rasulullah, ingatlah hari ketika malaikat meniup sangkakala pada hari kiamat; semua yang ada di langit dan bumi ketakutan akibat apa yang mereka lihat dan mereka dengar, kecuali orang yang Allah muliakan dan mendapat keamanan dari goncangan dahsyat di alam semesta itu, seperti orang-orang yang mati syahid, para nabi, dan para malaikat. Dan seluruh makhluk akan menghadap Allah dalam keadaan tunduk dan patuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَيَوْمَ يُنفَخُ فِى الصُّورِ (Dan (ingatlah) hari (ketika) ditiup sangkakala) Makna (الصور) adalah tanduk yang ditiup oleh malaikat. Tiupan ini terjadi tiga kali; pertama, tiupan yang mengagetkan seluruh makhluk; kedua, tiupan yang membinasakan seluruh makhluk; dan ketiga, tiupan yang membangkitkan semua makhluk. Pendapat lain mengatakan bahwa tiupan ini terjadi dua kali, dan tiupan yang mengagetkan seluruh makhluk yang tercantum pada ayat ini bisa jadi yang dimaksud adalah tiupan yang kebinasaan atau tiupan kebangkitan. فَفَزِعَ مَن فِى السَّمٰوٰتِ وَمَن فِى الْأَرْضِ(maka terkejutlah segala yang di langit dan segala yang di bumi) Yakni mereka seluruh makhluk merasa kaget dan terkejut akibat suara yang mereka dengar. إِلَّا مَن شَآءَ اللهُ ۚ( kecuali siapa yang dikehendaki Allah) Yakni kecuali siapa yang Allah kehendaki untuk tidak terkejut ketika mendengar tiupan itu. Terdapat pendapat mengatakan mereka adalah para syuhada, para nabi, dan orang-orang yang beriman, hal ini berdasarkan firman Allah: من جاء بالحسنة فله خير منها وهم من فزع يومئذ آمنون “Barangsiapa yang membawa kebaikan, maka ia memperoleh (balasan) yang lebih baik dari padanya, sedang mereka itu adalah orang-orang yang aman tenteram dari pada kejutan yang dahsyat pada hari itu.” (An-Naml: 89) وَكُلٌّ أَتَوْهُ دٰخِرِينَ(Dan semua mereka datang menghadap-Nya dengan merendahkan diri) Yakni datang dengan keadaan patuh dan merasa hina."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. ingatlah suatu hari waha Nabi, hari ketika sangkakala ditiup pertama kali oleh Israfil, maka terkejut dan takut dengan amat sangatlah segala ada di langit dan segala yang ada di bumi, kecuali orang-orang yang dikehendaki Allah untuk tidak takut, yaitu para syuhada yang hakikatnya masih hidup di sisi Allah, dan dari sisi-Nya diberikan rizki. Kemudian semuanya tanpa terkecuali, baik yang terkejut maupun yang tidak terkejut dengan tiupan sangkakala pertama akan berjalan menuju tempat perhitungan amalcsetelah tiupan sangkakala kedua, mereka datang menghadap-Nya dengan merendahkan diri. Tiupan sangkakala pertama adalah untuk membinasakan dan membunuh, adapun tiupan kedua untuk membangkitkan dan menghidupkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) sangkakala ditiup sehingga terkejut semua yang ada di langit dan yang ada di bumi, kecuali orang yang dikehendaki Allah. Semuanya datang menghadapNya dengan merendahkan diri} dalam keadaan rendah dan hina"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Allah menakut-nakuti hamba-hambaNya dengan apa yang ada di dalamnya berupa berbagai ujian, kesempitan dan hal-hal yang sangat menakutkan hati, seraya berfirman, “Dan hari (ketika) ditiup sangkakala, maka terkejutlah,” disebabkan tiupan itu, “segala yang di langit dan segala yang di bumi,” maksudnya, mereka tersentak dan kaget, sebagian dari mereka merangkul sebagian yang lain karena kaetakutan terhadap apa yang akan menjadi pendahuluan kiamat, “kecuali siapa yang dikehendaki Allah,” di antara orang-orang yang dimuliakan oleh Allah, diteguhkan dan dijaga dari rasa takut. “Dan semua mereka” dari setiap manusia di saat sangkakala ditiup, “datang menghadapNya dengan merendahkan diri,” dengan rasa hina dina lagi tunduk, sebagaimana difirmankan oleh Allah di dalam ayat yang lain: \"Tidak ada seorang pun di langit dan di bumi, kecuali akan datang kepada Tuhan Yang Maha Pemurah selaku seorang hamba.\" (Maryam: 93). Dan pada hari itu para pemimpin dan rakyat yang dipimpin sama merasa hina dan tunduk kepada Raja Diraja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 87: Ingatkanlah kepada meraka wahai Nabi ﷺ akan hari di mana malaikat meniup sangkakala, manusia tercerai berai dan ketakutan serta gelisah makhluk yang di langit dan di bumi, mereka semua binasa ketika sangkakala telah ditiup kecuali bagi yang Allah kehendaki dari makhluknya yang aman dari huru-hara ini. Setiap makhluk datang kepada Allah pada hari itu dengan tertunduk dan rendah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menakut-nakuti hamba-hamba-Nya dengan peristiwa yang akan terjadi di hadapan mereka, yaitu hari kiamat dengan cobaan dan kesusahan pada hari itu serta hal yang mencemaskan hati. Yakni tiupan pertama malaikat Israfil. Sampai membuat mereka mati. Yakni kecuali mereka yang dimuliakan Allah, diteguhkan-Nya dan dijaga-Nya dari peristiwa yang mengejutkan itu. Menurut sebagian mufassir, bahwa mereka yang dikecualikan Allah adalah para syuhada’, di mana mereka hidup di sisi Allah mendapatkan rezeki. Setelah dihidupkan kembali. Ketika itu pemimpin dengan rakyatnya adalah sama, mereka merendahkan diri kepada Allah pemilik semua kerajaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 87",
    "description": "Dan ingatlah, serta ingatkanlah umatmu, wahai nabi Muhammad, pada hari ketika sangkakala ditiup oleh malaikat israfil atas izin Allah, maka terkejutlah siapa dan apa yang ada di langit dan apa yang ada di bumi oleh dahsyatnya suara sangkakala tersebut, kecuali siapa dan apa yang dikehendaki Allah untuk dimuliakan. Dan semua mereka datang menghadap-Nya dengan merendahkan diri dan dalam keadaan hina. 88. Dan bukan hanya manusia yang datang dalam keadaan tunduk dan hina, engkau juga akan melihat gunung-gunung pada hari kebangkitan, yang engkau kira tetap di tempatnya dan tidak bergerak, padahal sesungguhnya ia berjalan dan bergerak cepat seperti awan yang berjalan dengan bantuan angin. Itulah sebagian dari ciptaan Allah yang mencipta dengan sempurna segala sesuatu. Sungguh, dia mahateliti dan mengetahui apa yang kamu kerjakan, baik berupa ketaatan maupun kemaksiatan, dan akan memberikan balasan atas itu semua."
  }
]