[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu akan melihat gunung-gunung yang kamu kira mereka berhenti dan diam tak bergerak, padahal ia berjalan dengan jalan yang cepat sebagaimana perjalanan awan yang ditiup oleh hembusan angina. Ini termasuk perbuatan Allah yang telah membuat segala sesuatu dengan indah dan merapikannya. Sesungguhnya Allah Mahateliti terhadap apa yang diperbuat oleh hamba-hambaNya, perbuatan yang baik maupun yang buruk, dan akan memberikan balasan kepada mereka sesuai dengan amal perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Dan engkau lihat gunung-gunung pada hari itu, engkau mengiranya diam tidak bergerak, padahal sesungguhnya gunung-gunung itu berjalan kencang sebagaimana jalannya awan. Itulah ciptaan Allah, dan Dia lah yang telah menggerakkannya, sesungguhnya Dia Maha Mengerti atas apa yang kalian kerjakan, tidak ada sesuatu pun dari perbuatan kalian yang tersembunyi dari-Nya, dan Dia akan membalas kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Hai Rasulullah, setelah tiupan sangkakala itu kamu akan melihat gunung-gunung tinggi yang kamu kira tetap kokoh, padahal gunung-gunung itu bergerak dengan cepat dan berpindah dari tempatnya; ketika itu ia seperti awan yang terhempas oleh angin sehingga ia bergerak dengan cepat dan tercerai berai. Siapakah yang telah menciptakan ketetapan alam yang menakjubkan ini? Dia adalah Allah yang telah menciptakan segalanya dengan baik dan mengaturnya dengan detail, Dia Maha Mengetahui apa yang kalian perbuat, dan akan membalas perbuatan yang telah kalian lakukan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَتَرَى الْجِبَالَ تَحْسَبُهَا جَامِدَةً (Dan kamu lihat gunung-gunung itu, kamu sangka dia tetap di tempatnya) Yakni kalian menganggapnya diam berdiri di tempatnya. وَهِىَ تَمُرُّ مَرَّ السَّحَابِ ۚ( padahal ia berjalan sebagai jalannya awan) Yakni berjalan dengan cepat seperti awan yang bergerak karena tertiup angin, hal ini terjadi pada hari kiamat. Atau mungkin juga terjadi di dunia yang mengisyaratkan bahwa bumi ini berputar, penduduk bumi merasa bahwa bumi tidak bergerak, padahal ia bergerak, dengan dalil lanjutan ayat ini صُنْعَ اللهِ الَّذِىٓ أَتْقَنَ كُلَّ شَىْءٍ ۚ”Begitulah) perbuatan Allah yang membuat dengan kokoh tiap-tiap sesuatu.” Sebab penciptaan dan pengokohan tidak sesuai dengan kata ‘penghancuran’, karena Allah akan menghancurkan gunung-gunung di hari kiamat. إِنَّهُۥ خَبِيرٌۢ بِمَا تَفْعَلُونَ(sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan) Dengan pengetahuan-Nya, Allah menciptakan dan mengatur dengan rapi segala ciptaan-Nya. Makna (الخبير) adalah mengetahui segala yang nampak dan tersembunyi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Engkau lihat gunung-gunung itu, kamu sangka dia tetap di tempatnya pada saat sangkakala ditiup pada hari kiamat. Padahal ia berjalan dengan cepat seperti perjalanan awan. Begitulah ciptaan Allah, Yang membuat sesuatu dengan kokoh. Dialah yang mengatur dan menentukan segala sesuatu sesuai dengan ukuran dan kesempurnaannya. Sesungguhnya Allah Maha Mengetahui segala apapun yang engkau kerjakan, baik maupun buruk. Allah akan memberi balasan atas perbuatanmu. Al-khabir adalah sifat Maha Mengetahui terhadap segala yang tampak maupun yang tidak tampak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu akan melihat gunung-gunung} Kamu akan melihat gunung-gunung pada hari kiamat {yang kamu kira} yang kamu kira {tetap di tempatnya} tetap pada tempatnya, tidak bergerak {padahal dia berjalan seperti jalannya awan} berjalan cepat seperti jalannya awan {Penciptaan Allah menjadikan sempurna} menentukan {segala sesuatu. Sesungguhnya Dia Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. Di antara praharanya adalah “Kamu lihat gunung-gunung itu, kamu sangka ia tetap.” Tidak hilang sedikit pun darinya, dan kamu mengiranya tetap seperti sebagaimana adanya, padahal ia telah mencapai puncak rasa terhimpit dan rasa takut luar biasa, ia hancur, kemudian berangsur sirna dan menjadi bagai debu yang beterbangan. Oleh karena itu, Allah berfirman, “Padahal ia berjalan sebagaimana jalannya awan,” karena sangat ringan dan sangat ketakutan. Dan begitulah “perbuatan Allah yang membuat dengan kokoh tiap-tiap sesuatu; sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 88: Ingatlah wahai manusia, itulah hari yang berat yaitu hari kiamat. Hari di mana gunung-gunung berterbangan, yang keadaannya ketika di dunia kokoh, dan hakikatnya gunung-gunung tersebut berjalan dalam senyap, sebagaimana berjalannya awan yang berjalan dengan cepat yang terbang sebagaimana anai-anai yang berhamburan. Semua ini adalah ciptaan Allah yang menghukumi dan menetapkan segala sesuatunya. Dialah yang maha tahu akan apa yang kalian kerjakan, dan kalian akan dikumpulkan pada hari itu, dan kalian juga akan dibalas atas apa-apa yang telah kalian kerjakan, maka jika baik akan dibalas kebaikan dan apabila buruk akan dibalas keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk huru-haranya adalah seperti yang disebutkan dalam ayat di atas. Yakni pada saat malaikat Israfil meniup sangkakala. Maksudnya, seperti awan mendung yang didorong oleh angin. Oleh karena itu, gunung nanti sama seperti itu, dijalankan, lalu dihancurkan sehigga seperti bulu yang dihamburkan kemudian menjadi debu yang berhamburan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 88",
    "description": "Dan bukan hanya manusia yang datang dalam keadaan tunduk dan hina, engkau juga akan melihat gunung-gunung pada hari kebangkitan, yang engkau kira tetap di tempatnya dan tidak bergerak, padahal sesungguhnya ia berjalan dan bergerak cepat seperti awan yang berjalan dengan bantuan angin. Itulah sebagian dari ciptaan Allah yang mencipta dengan sempurna segala sesuatu. Sungguh, dia mahateliti dan mengetahui apa yang kamu kerjakan, baik berupa ketaatan maupun kemaksiatan, dan akan memberikan balasan atas itu semua. 89. Setelah kiamat terjadi dan manusia dikumpulkan di padang mahsyar, menghadap tuhannya dengan merendahkan diri, keadaan mereka digambarkan sebagai berikut; barangsiapa membawa kebaikan, yakni keimanan yang benar, tulus dan sernpurna yang membuahkan amal saleh, maka dia akan memperoleh balasan yang lebih baik daripadanya, yakni balasan yang berlipat ganda dari sepuluh hingga tujuh ratus kali, bahkan tidak terbatas, sedang mereka merasa aman dan tenteram dari kejutan yang dahsyat pada hari penghimpunan di padang mahsyar itu."
  }
]