[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa datang membawa tauhidullah, beriman kepadaNya dan hanya beribadah kepadaNya semata, serta amal-amal shalih pada Hari Kiamat, maka baginya di sisi Allah pahala besar yang lebih baik dan lebih utama darinya, yaitu surga. Dan mereka itu akan aman pada hari ketakutan yang terdahsyat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Barangsiapa pada hari Kiamat nanti datang dengan membawa iman dan amal saleh maka baginya Surga, dan mereka merasa tenteram karena ditenteramkan oleh Allah dari kejutan yang dahsyat hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89-90. Seluruh makhluk akan menghadap Tuhan mereka. Pada waktu yang sulit itu tidak bermanfaat bagi seseorang melainkan amalan yang telah dia lakukan di dunia. Sebagian mereka akan bahagia, dan sebagian lainnya akan menderita; barangsiapa yang menghadap Tuhannya dengan kalimat tauhid yang dia ucapkan dengan penuh keikhlasan maka dia akan bahagia dengan pahala yang besar yang telah disiapkan baginya, pahalanya akan dilipatgandakan sepuluh kali lipat dari amal kebaikan yang telah dia kerjakan; kengerian hari kiamat tidak membuat mereka bersedih hari karena mereka telah mendapat keamanan dari peristiwa itu. Adapun orang-orang yang menderita, mereka akan menghadapi peristiwa yang menghinakan mereka, karena wajah mereka akan dicampakkan ke tanah, dan wajah itu yang pertama kali akan dilempar ke dalam kerak neraka. Ketika di dunia mereka selalu mengikuti hawa nafsu. Dan akan dikatakan kepada mereka: “Apa yang kalian dapatkan ini tidak lain adalah balasan atas kejahatan-kejahatan yang telah kalian lakukan dahulu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. وَهُم مِّن فَزَعٍ يَوْمَئِذٍ ءَامِنُونَ (sedang mereka itu adalah orang-orang yang aman tenteram dari pada kejutan yang dahsyat pada hari itu) Yakni aman dari segala kengerian di hari itu. Pendapat lain mengatakan yang dimaksud adalah kedahsyatan besar yang disebutkan pada firman Allah: لا يحزنهم الفزع الأكبر “Mereka tidak disusahkan oleh kedahsyatan yang besar (pada hari kiamat)” (al-Anbiya’: 103)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Barangsiapa membawa kebaikan, yaitu iman dan amal baik, maka ia memperoleh balasan yang lebih baik dari pada perbuatannya dengan berlipat-lipat. Mereka adalah orang-orang yang aman tenteram dari hari kiamat, yaitu hari ketakutan yang amat dahsyat, karena Allah menjaga mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang datang dengan kebaikan} dengan keimanan dan amal shalih {maka baginya sesuatu yang lebih baik darinya dan mereka dari kejutan pada hari itu merasa aman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. Kemudian Allah menjelaskan bagaimana cara pembalasanNya, seraya berfirman, “Barangsiapa yang membawa kebaikan,” kebaikan adalah kata jenis, mencakup segala kebaikan yang bersifat perkataan, perbuatan atau gerak hati [maka dia akan mendapat sepuluh kali lipat pahalanya]. Ini adalah pelipatan yang paling sedikit. “Sedang mereka itu adalah orang-orang yang aman dari kejutan yang dahsyat pada hari itu.” Maksudnya, aman dari perkara yang karenanya manusia seluruhnya merasa sangat ketakutan, sekalipun mereka juga tersentak bersama mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 89: Allah menyebutkan orang-orang yang selamat pada hari kiamat dan menjelaskan bahwa mereka datang kepada Allah dengan tauhid dan iman serta penghambaan diri, beramal dengan amalan-amalan yang shalih. Mereka semua Allah balas dengan kebaikan atas amalan-amalan mereka, yaitu surga yang luasnya sebagaimana langit dan bumi, dan mereka pada hari kiamat besar mendapatkan ketenangan dan keamanan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan bagaimana bentuk pembalasan-Nya. Baik yang terkait dengan ucapan, perbuatan maupun hati."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 89",
    "description": "Setelah kiamat terjadi dan manusia dikumpulkan di padang mahsyar, menghadap tuhannya dengan merendahkan diri, keadaan mereka digambarkan sebagai berikut; barangsiapa membawa kebaikan, yakni keimanan yang benar, tulus dan sernpurna yang membuahkan amal saleh, maka dia akan memperoleh balasan yang lebih baik daripadanya, yakni balasan yang berlipat ganda dari sepuluh hingga tujuh ratus kali, bahkan tidak terbatas, sedang mereka merasa aman dan tenteram dari kejutan yang dahsyat pada hari penghimpunan di padang mahsyar itu. 90. Dan barangsiapa membawa kejahatan, yakni mempersekutukan Allah, lalu mati dalam keadaan musyrik maka mereka itu akan mendapat balasan yang setimpal dengan kejahatannya, yaitu disungkurkanlah wajah mereka ke dalam neraka. Kepada mereka dikatakan, \"kamu tidak diberi balasan, melainkan setimpal dengan apa yang telah kamu kerjakan."
  }
]