[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-12. Kemudian tatkala Musa mendatangi api itu, Allah memanggilnya dan memberitahukan kepadanya bahwa ini adalah suatu tempat yang disucikan Allah dan diberkahi olehNya. Maka Dia menjadikannya sebagai tempat untuk berbicara kepada Musa dan mengangkatnya sebagai rasul. Dan sesungguhnya Allah memberkahi siapa saja yang berada di api itu dan yang ada di sekitarnya dari kalangan malaikat, dan Mahasuci Allah, Penguasa seluruh makhluk dari segala yang tidak pantas bagiNya. “Wahai Musa, sesungguhnya Aku adalah Allah yang berhak diibadahi semata, yang Mahaperkasa Yang Kuasa untuk membalas musuh-musuhKu, juga Mahabijaksana dalam pengaturan makhluk-makhlukKu. Dan lemparkanlah tongkatmu.” Maka ia (musa) melemparkan tongkatnya, lalu berubah menjadi seekor ular. Ketika melihatnya bergerak-gerak dengan mudah seperti rayapan ular yang cepat, Musa berbalik untuk lari, dan tidak kembali kepadanya. Maka Allah menenangkannya dengan FirmanNYa, “Wahai Musa, jangan takut. Sesungguhnya orang yang Aku utus kepada mereka dengan membawa risalahKu tidak takut disisiKu. Akan tetapi, orang yang melewati batas dengan berbuat dosa kemudian bertaubat dan menggantinya dengan taubat yang baik setelah buruknya dosa, sesungguhnya Aku Maha Pengampun baginya lagi Maha penyayang terhadapnya. Maka seseorang tidak boleh berputus asa dari rahmat dan ampunan Allah. Dan masukkanlah tanganmu ke dalam kerah bajumu yang terbuka sampai ke dada, niscaya akan keluar dalam keadaan putih seperti salju, namun bukan karena penyakit kusta. Dua hal tersebut termasuk bagian dari Sembilan mukjizat yaitu tangan, tongkat, paceklk panjang, kekurangn buah-buahan, banjir bandang, belelang, kutu, katak, dan darah untuk menguatkanmu dalam menyampaikan risalah kepada Fir’aun dan kaumnya. Sesungguhnya mereka itu adalah kaum yang telah keluar dari perintah Allah lagi kafir terhadapNya.\""
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Lalu Allah berfirman padanya, \"Wahai Musa, sesungguhnya Aku lah Allah Yang Maha Perkasa, yang tidak bisa dikalahkan oleh siapapun, lagi Maha Bijaksana dalam penentuan ciptaan, takdir, dan syariat-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. يٰمُوسَىٰٓ إِنَّهُۥٓ أَنَا اللهُ الْعَزِيزُ الْحَكِيمُ ((Allah berfirman): “Hai Musa, sesungguhnya, Akulah Allah, Yang Maha Perkasa lagi Maha Bijaksana) Makna (العزيز) adalah Maha perkasa dan kuasa. Dan (الحكيم) adalah Maha bijaksana dalam setiap urusan dan perbuatan-Nya. Dikatakan bahwa Musa berkata: Ya Tuhanku, siapakah yang memanggilku? Maka Allah menjawab dengan firman-Nya: itu adalah Aku, Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah berfirman: \"Hai Musa, sesungguhnya, Akulah Allah Tuhanmu, Aku Yang menyerumu. Yang Maha Perkasa lagi Maha Bijaksana dalam firman maupun tindakan.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Wahai Musa, sesungguhnya Aku adalah Allah Yang Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9 “hai Musa, sesungguhnya, Akulah Allah, Yang Mahaperkasa lagi MahaBijaksana,” maksudnya, Allah menginformasikan kepadanya bahwa Allah semata-lah yang berhak disembah, tiada sekutu bagaiNya, sebagaimana disebutkan dalam ayat yang lain, “sesungguhnya Aku adalah Allah, tidak ada yang berhak disembah kecuali Aku, maka sembahlah Aku (semata), dan dirikanlah shalat untuk mengingatKu,” (thaha:14) “Yang Mahaperkasa,” yang menundukkan segala sesuatu dan semua makhluk tunduk padaNya, “lagi Mahabijaksana,” di dalam urusan dan penciptaanNya. Di aantara kebijaksanaanNya adalah Dia mengangkat Musa bin Imran sebagai RasulNya, yang mana Allah telah mengetahui bahwa Musa mampu untuk mengemban kerasulan, wahyu dan pembicaraan denganNya. Dan di antara keperkasaanNya adalah Anda bersandar (pasrah) kepadaNya dan Anda tidak merasa takut karena kesendirianmu dan banyaknya musuhmu serta keganasan mereka. Sebab ubun-ubun mereka ada di tangan Allah, gerak-gerik dan diamnya mereka ada dalam pengendalian Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 9: Allah kemudian menyeru Musa dengna berkata : Wahai Musa, sungguh Aku adalah Allah yang tiada Tuhan selain Aku, Akulah Tuhan yang benar, yang berhak di ibadahi dan memberi petunjuk, tiada yang lain, Akulah yang maha kuat, menaklukkan segala yang berkuasa dari makhluk, yang maha bijaksana dalam urusan dan sikap dan juga dalam menciptakan dan penjagaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Dia adalah Allah Tuhan yang berhak diibadahi satu-satunya dan tidak ada sekutu bagi-Nya. Yang mengalahkan segala sesuatu dan menundukkannya. Termasuk keperkasaan-Nya adalah engkau cukup bersandar kepada-Nya dan tidak perlu takut meskipun hanya sendiri, banyaknya musuh dan ganasnya mereka, karena ubun-ubun mereka di Tangan Allah, Dia berkuasa kepada mereka, dan diam serta gerak mereka dengan kehendak-Nya. Baik dalam perintah maupun ciptaan-Nya. Termasuk kebijaksanaan-Nya adalah Dia mengutus hamba-Nya Musa bin Imran yang telah diketahui Allah, bahwa dia cocok memikul risalah, wahyu dan diajak bicara oleh-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 9",
    "description": "Kemudian Allah memperkenalkan diri-Nya kepada nabi musa. 'wahai musa! sesungguhnya suara yang memanggilmu itu adalah suara-ku, aku adalah Allah, yang mahaperkasa, mahamulia, yang tidak ada kekuatan apa pun yang sanggup mengalahkan-ku mahabijaksana terhadap semua perkataan dan tindakan-ku. 10. Allah ingin membuktikan bahwa diri-Nya adalah Allah, tuhan seluruh alam. Pada saat itu nabi musa memegang tongkat. \"dan lemparkanlah tongkatmu!' nabi musa menuruti perintah Allah dan melemparkan tongkatnya. Maka ketika tongkat itu berubah menjadi ular dan musa melihatnya bergerak-gerak seperti seekor ular yang gesit, nabi musa sangat ketakutan dan larilah dia berbalik ke belakang tanpa menoleh dan tidak kembali lagi ke tempat semula. Saat itu Allah berkata: 'wahai musa! jangan takut terhadap apa yang kamu lihat! sesungguhnya di hadapan-ku, para rasul tidak perlu takut. Mereka tahu bahwa aku tidak akan menistakan mereka, justru aku akan membimbing mereka."
  }
]