[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa datang dengan membawa kesyirikan dan perbuatan-perbuatan buruk lagi keji, maka balasan bagi mereka adalah Allah akan menyeret mereka dengan wajah-wajah mereka di neraka pada Hari Kiamat. Dan akan dikatakan kepada mereka sebagai bentuk celaan terhadap mereka, “Bukankah kalian diberi balasan sesuai dengan apa yang kalian perbuat di dunia dahulu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Dan barangsiapa yang datang dengan membawa kekufuran dan kemaksiatan maka bagi mereka Neraka, wajah mereka diceburkan ke dalamnya dan dikatakan kepada mereka sebagai bentuk hinaan dan celaan, “Tidaklah kalian mendapatkan balasan melainkan atas apa yang telah kalian lakukan di dunia berupa kekufuran dan kemaksiatan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. وَمَن جَآءَ بِالسَّيِّئَةِ (Dan barang siapa yang membawa kejahatan) Yang dimaksud dengan kejahatan di sini adalah perbuatan syirik. فَكُبَّتْ وُجُوهُهُمْ فِى النَّارِ(maka disungkurkanlah muka mereka ke dalam neraka) Yakni disungkurkan dan dicampakkan di atas muka mereka. هَلْ تُجْزَوْنَ إِلَّا مَا كُنتُمْ تَعْمَلُونَ(Tiadalah kamu dibalasi, melainkan (setimpal) dengan apa yang dahulu kamu kerjakan) Yakni para malaikat penjaga neraka Jahannam berkata kepada mereka: “kalian tidak dibalas demikian melainkan karena amalan buruk kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Barangsiapa yang membawa kejahatan, yaitu kesyirikan dan maksiat kepada Allah, maka disungkurkanlah muka mereka ke dalam neraka. Maksud dari itu adalah seluruh tubuh mereka, yang hanya disebutkan wajah mereka, sebab wajah adalah tanda anggota tubuh yang paling dimuliakan. Engkau tidak akan diberi balasan melainkan setimpal dengan kesyirikan dan maksiat yang telah engkau lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang datang kejahatan} dengan kemusyrikan {maka disungkurkan} maka dijatuhkan {wajah mereka ke dalam neraka. Apakah kalian diberi balasan selain dengan apa yang telah kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. “Dan barangsiapa yang membawa kejahatan,” kata jenis yang mencakup seluruh kejahatan, “maka disungkurkanlah muka mereka ke dalam neraka.” Maksudnya, mereka diceburkan ke dalam neraka dengan muka tersungkur, dan dikatakan kepada mereka, “Tiadalah kamu dibalas,melainkan (setimpal) dengan apa yang dahulu kamu kerjakan.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 90: Allah kemudian menyebutkan orang-orang yang merugi dan menjelaskan bahwa mereka adalah orang-orang yang datang kepada Allah dengan menyekutukan-Nya dan amalan-amalan yang buruk. Allah akan menelungkupkan wajah mereka ke api neraka pada hari kiamat, dan dikatakan kepada mereka dengan penghinaan : Rasakanlah adzab akibat kalian menyekutukan Allah dan kejahatan kalian serta amalan-amalan buruk kalian yang rusak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti syirk. Jika wajah yang merupakan anggota badan yang paling mulia ditelungkupkan ke neraka, maka anggota badan yang lain apa lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 90",
    "description": "Dan barangsiapa membawa kejahatan, yakni mempersekutukan Allah, lalu mati dalam keadaan musyrik maka mereka itu akan mendapat balasan yang setimpal dengan kejahatannya, yaitu disungkurkanlah wajah mereka ke dalam neraka. Kepada mereka dikatakan, \"kamu tidak diberi balasan, melainkan setimpal dengan apa yang telah kamu kerjakan. 91. Katakanlah wahai nabi Muhammad kepada siapa pun juga, \"aku hanya diperintahkan oleh Allah yang perintah-Nya tidak dapat diabaikan agar menyembah semata-mata hanya kepada tuhan negeri ini, yakni mekah, yang dia telah menjadikan suci padanya dengan menjadikannya aman dari pertumpahan darah, tidak boleh ada orang atau sesuatu yang terzalimi di situ, sampai pun hewan dan tumbuhan. Dan bagi tuhanku itu segala sesuatu adalah milik-Nya, dan aku juga diperintahkan selain menyembah kepada-Nya agar aku termasuk orang muslim, yang berserah diri, patuh melaksanakan semua perintah-Nya dan menjauhi semua larangan-Nya."
  }
]