[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "91-92. Katakanlah (wahai Rasul) kepada sekalian manusia, “Sesungguhnya aku hanya diperintah untuk beribadah kepada Tuhan Pemilik negeri ini (Makkah) yang telah dijadikan kota suci olehNya atas makhlukNya, agar mereka tidak menumpahkan darah (orang) yang haram dibunuh, atau menzhalimi seseorang didalamya, atau membidik hewan buruan, dan menebang pepohonannya. Dan milikNya-lah segala sesuatu. Dan aku diperintah supaya menjadi orang-orang yang patuh terhadap perintahNya, yang bersegera untuk menaatiNya, dan agar aku membacakan al-Qur’an kepada sekalian manusia. Maka barangsiapa mendapatkan hidayah melalui kandungannya dan mengikuti risalah yang aku bawa, sesungguhnya kebaikan dan balasan baiknya teruntuk bagi dirinya saja.” Dan barangsiapa yang tersesat dari kebenaran, maka katakanlah (wahai Rasul), “Sesungguhnya aku hanyalah seorang pemberi peringatan bagi kalian dari azab dan hukuman Allah jika kalian tidak beriman. Aku hanyalah salah seorang di antara para rasul yang (ditugaskan untuk) memberi peringatan kepada kaum mereka, dan bukan di tanganku sedikit pun taufik memberikan hidayah itu”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Katakan kepada mereka, -wahai Rasul- “Sesungguhnya aku hanyalah diperintahkan untuk menyembah Rabb negeri ini (Makkah) yang telah disucikan, maka tidak boleh menumpahkan darah di dalamnya, tidak boleh menzalimi orang lain di dalamnya, binatang buruannya tidak boleh dibunuh, pepohonannya tidak boleh ditebang, dan milik Allah lah segala kerajaan, dan aku diperintahkan untuk menjadi orang-orang yang berserah diri kepada Allah dan tunduk pada-Nya dengan taat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Hai Rasulullah, katakanlah: “Tuhanku memerintahkanku agar menyembah-Nya semata, tanpa menyekutukan-Nya dengan apapun. Dia adalah Pemilik Makkah yang telah Dia tetapkan sebagai tempat yang haram (terhormat) dan aman, sehingga tidak boleh ada pertumpahan darah di dalamnya, hewannya tidak boleh diburu, dan tanamannya tidak boleh dicabut. Ini semua adalah bentuk kemuliaan Makkah, sehingga tidak ada yang masuk ke negeri ini apa yang bertentangan bagi kemaslahatannya atau membawa mudharat bagi penduduknya. Dan jika Allah adalah pemilik negeri ini, Dia juga pemilik segalanya; Allah tidak hanya memiliki negeri ini namun dia juga memilik segala sesuatu.” Allah juga memerintahkan Rasulullah untuk tetap mengesakan-Nya dan senantiasa tunduk kepada perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. إِنَّمَآ أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هٰذِهِ الْبَلْدَةِ الَّذِى حَرَّمَهَا (Aku hanya diperintahkan untuk menyembah Tuhan negeri ini (Mekah) Yang telah menjadikannya suci) Yakni katakanlah hai Muhammad, aku hanya diperintah untuk menyembah Allah semata, tidak ada sekutu bagi-Nya, Tuhan negeri Makkah yang terdapat di dalamnya Baitullah. Makna (حرمها) adalah Allah menjadikannya tanah haram dan aman dari pertumpahan darah, tidak ada seorangpun yang dizalimi, dan hewan liarnya tidak boleh diburu. وَلَهُۥ كُلُّ شَىْءٍ ۖ( dan kepunyaan-Nya-lah segala sesuatu) Dia-lah yang mempunyai hak menciptakan, memiliki, dan mengatur. وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ(dan aku diperintahkan supaya aku termasuk orang-orang yang berserah diri) Yakni termasuk orang yang taat kepada perintah Allah, tunduk kepada-Nya dengan menjalankan perintah-Nya dan menjauhi larangan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Katakanlah wahai Nabi: Sesungguhnya aku hanya diperintahkan untuk menyembah Tuhan negeri ini (Mekah), Yang telah menjadikan negeri ini aman dan suci. Tidak ada pertumpahan darah, tidak ada seorangpun yang terdhalimi, tidak ada tanaman/pepohonan satupun yang tertebang, juga tidak ada pengasingan. Aku diperintahkan supaya aku menjadi orang-orang yang berserah diri dalam beribadah kepada-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya aku hanya diperintahkan untuk menyembah Tuhan negeri ini} Mekkah {yang telah menjadikannya suci} menjadikannya suci lagi aman, sehingga tidak dialirkan darah di dalamnya, tidak ada seorang pun yang dizalimi di dalamnya, tidak ada satu pun buruan yang diburu, dan tidak ada pohon di dalamnya yang ditebang {dan memiliki segala sesuatu. Aku diperintahkan agar termasuk ke dalam golongan orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Maksudnya, katakanlah kepada mereka wahai Muhammad, “Aku hanya diperintahkan untuk menyembah Rabb negeri ini.” Maksudnya, Makkah al-MUkarramah, “yang telah menjadikannya haram” dan memberikan limpahan karunia kepada penduduknya. Maka mereka wajib meresponnya dengan bersyukur dan menerima, “dan kepunyaanNya-lah segala sesuatu,” yang ada di atas dan yang di bawah. Kalimat ini diungkapkan agar tidak ada anggapan keliru bahwa kerububiyahanNya tidak hanya khusus pada Baitullah saja. Dan aku diperintah “supaya aku termasuk orang-orang yang berserah diri.” Maksudnya, aku segera masuk kepada Islam. Dan ini telah dilakukan oleh Rasulullah, karena beliau adalah orang pertama yang masuk Islam dari umat ini dan merupakan orang yang paling besar penyerahan dirinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 91: Katakanlah kepada mereka wahai Nabi Allah : Sungguh Allah hanyalah memerintahkan untuk mengibadahi Rabb pemilik negeri ini, yaitu Mekkah –semoga Allah menjaganya-, di mana Allah melarang untuk menumpahkan darah di sana, atau mendzhalimi salah seorang manusia di sana, Dialah Allah Tuhan seluruh sesuatu dan Penguasanya. Katakan juga wahai Nabi Allah kepada mereka : Aku diperintahkan untuk bersegera dalam perintah dan ketaatan pada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, katakanlah kepada mereka wahai Muhammad. Oleh karena itu, tidak boleh ditumpahkan darah padanya, diburu binatang buruannya, dan dicabut rumputnya. Ini termasuk di antara nikmat yang diberikan Allah kepada kaum Quraisy yang sepatutnya mereka syukuri; Allah menghilangkan azab dari negeri mereka, dan menghilangkan berbagai fitnah yang biasa terjadi di tempat lain. Dia yang menciptakannya dan yang memilikinya. Disebutkan kalimat ini adalah untuk menghindari timbulnya sangkaan, bahwa Dia hanya yang memiliki rumah tua itu (ka’bah) saja. Nabi shallallahu 'alaihi wa sallam telah melakukannya, dan Beliaulah orang yang pertama berserah diri di kalangan umat ini dan paling besar sikap berserah dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 91",
    "description": "Katakanlah wahai nabi Muhammad kepada siapa pun juga, \"aku hanya diperintahkan oleh Allah yang perintah-Nya tidak dapat diabaikan agar menyembah semata-mata hanya kepada tuhan negeri ini, yakni mekah, yang dia telah menjadikan suci padanya dengan menjadikannya aman dari pertumpahan darah, tidak boleh ada orang atau sesuatu yang terzalimi di situ, sampai pun hewan dan tumbuhan. Dan bagi tuhanku itu segala sesuatu adalah milik-Nya, dan aku juga diperintahkan selain menyembah kepada-Nya agar aku termasuk orang muslim, yang berserah diri, patuh melaksanakan semua perintah-Nya dan menjauhi semua larangan-Nya. 92. Dan di samping yang aku lakukan khusus buat diriku, aku diperintahkan pula agar aku membacakan semua ayat-ayat suci Al-Qur'an kepada manusia. Maka barangsiapa mendapat petunjuk dari hasil penyampaianku, atau bacaan dan pemahaman Al-Qur'an yang kusampaikan, maka sesungguhnya dia mendapat petunjuk untuk kebaikan dirinya, dalam hal ini aku hanya berfungsi sebagai penyampai kabar gembira, dan barangsiapa yang enggan memperhatikan tuntunan Al-Qur'an sehingga dia sesat dan tidak menemukan jalan yang benar, maka katakanlah kepadanya dan kepada siapa pun juga, \"sesungguhnya aku ini tidak lain hanyalah solah seorang pemberi peringatan dari sekian banyak nabi dan rasul yang telah diutus sebelum aku. Hidayah ada di tangan tuhan. \"."
  }
]