[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "91-92. Katakanlah (wahai Rasul) kepada sekalian manusia, “Sesungguhnya aku hanya diperintah untuk beribadah kepada Tuhan Pemilik negeri ini (Makkah) yang telah dijadikan kota suci olehNya atas makhlukNya, agar mereka tidak menumpahkan darah (orang) yang haram dibunuh, atau menzhalimi seseorang didalamya, atau membidik hewan buruan, dan menebang pepohonannya. Dan milikNya-lah segala sesuatu. Dan aku diperintah supaya menjadi orang-orang yang patuh terhadap perintahNya, yang bersegera untuk menaatiNya, dan agar aku membacakan al-Qur’an kepada sekalian manusia. Maka barangsiapa mendapatkan hidayah melalui kandungannya dan mengikuti risalah yang aku bawa, sesungguhnya kebaikan dan balasan baiknya teruntuk bagi dirinya saja.” Dan barangsiapa yang tersesat dari kebenaran, maka katakanlah (wahai Rasul), “Sesungguhnya aku hanyalah seorang pemberi peringatan bagi kalian dari azab dan hukuman Allah jika kalian tidak beriman. Aku hanyalah salah seorang di antara para rasul yang (ditugaskan untuk) memberi peringatan kepada kaum mereka, dan bukan di tanganku sedikit pun taufik memberikan hidayah itu”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Dan aku diperintahkan untuk membacakan Al-Qur`ān kepada manusia, maka barangsiapa mendapatkan petunjuk dengannya dan menjalankan apa yang ada di dalamnya maka petunjuknya itu bermanfaat untuk dirinya sendiri. Dan barangsiapa tersesat dan menyimpang dari apa yang ada di dalamnya serta mengingkarinya dan tidak menjalankan apa yang ada di dalamnya, maka katakan, “Sesungguhnya aku tidak lain hanyalah seorang pemberi peringatan, aku mengingatkan kalian dari siksa Allah dan aku tidak memiliki hak untuk memberi kalian hidayah.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Tuhanku juga memerintahkanku untuk membacakan al-Qur’an kepada manusia, menyampaikan isi kandungannya, dan menjadi pemberi kabar gembira dan peringatan. Barangsiapa yang menjadikan cahaya Allah sebagai petunjuk, maka manfaatnya akan kembali kepada dirinya berupa ketenangan hati dan meraih jalan yang lurus. Dan barangsiapa yang mengutamakan hawa nafsunya dan mendustakan para rasul-Nya, maka katakanlah kepada mereka -Hai Rasulullah-: “Aku adalah batu bata dari bangunan yang kokoh dari para rasul, untuk memberi peringatan kepada manusia; dan aku tidak berkuasa memberi hidayah kepada seorangpun.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَأَنْ أَتْلُوَا۟ الْقُرْءَانَ ۖ (Dan supaya aku membacakan Al Quran) Yang dimaksud adalah membacanya dengan maksud menyeru kepada keimanan. Yakni agar aku membacakan al-Qur’an bagi kalian untuk memberi kalian peringatan dengan al-Qur’an itu dan menyeru kalian menuju ketaatan kepada Allah. فَمَنِ اهْتَدَىٰ فَإِنَّمَا يَهْتَدِى لِنَفْسِهِۦ ۖ( Maka barangsiapa yang mendapat petunjuk maka sesungguhnya ia hanyalah mendapat petunjuk untuk (kebaikan) dirinya) Sebab mamfaat dari hal itu kembali pada dirinya. وَمَن ضَلَّ (dan barangsiapa yang sesat) Dengan berbuat kafir dan berpaling dari petunjuk, maka akibat kesesatannya akan ia tanggung sendiri. فَقُلْ إِنَّمَآ أَنَا۠ مِنَ الْمُنذِرِينَ (maka katakanlah: “Sesungguhnya aku (ini) tidak lain hanyalah salah seorang pemberi peringatan”) Dan aku telah melakukan itu dengan menyampaikan risalah ini kepada kalian, dan aku tidak ditugaskan lebih dari itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Aku diperintahkan membacakan Al Quran untuk menyerukan kepada manusia keimanan dan ketaatan kepada Allah. Maka barangsiapa yang mendapat petunjuk maka sesungguhnya ia mendapat petunjuk untuk kebaikan dirinya sendiri, dan barangsiapa yang sesat dengan kekafiran, serta membangkang dari petunjuk dan sesat, maka katakanlah kepada mereka: \"Sesungguhnya aku ini tidak lain hanya bertugas memberi peringatan orang-orang yang durhaka dari ancaman azab Allah\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Agar aku membacakan Al-Qur’an. Maka siapa saja yang mendapat petunjuk, sesungguhnya dia mendapatkannya untuk dirinya. Dan siapa saja yang tersesat, maka katakanlah,“Sesungguhnya aku tidak lain hanyalah salah seorang pemberi peringatan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. “Dan” aku juga pernah diperintah “supaya aku membacakan” kepada kalian “al-Quran,” agar kalian menjadikannya sebagai pedoman, mengikuti dan mempelajari lafazh-lafazhnya dan makna-maknanya. Inilah yang menjadi kewajibanku, dan aku pun telah menunaikannya. “Maka barangsiapa yang mendapat petunjuk maka sesungguhnya ia hanyalah mendapat petunjuk untuk dirinya.” Manfaatnya akan kembali kepada dirinya sendiri. “Dan barangsiapa yang sesat maka katakanlah, ‘Sesungguhnya aku (ini) tidak lain hanyalah salah seorang pemberi peringatan’.” Aku sama sekali tidak memiliki hidayah sedikit pun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 92: Katakanlah kepada mereka juga : Aku juga diperintahkan untuk membacakan Al Qur’an kepada manusia, maka barangsiapa yang mendapati petunjuk kepada kebenaran yang aku datang dengannya, maka sungguh kebenaran tersebut akan memberikan manfaat dan balasan padanya. Dan barangsiapa yang tersesat dari jalan kebenaran, maka katakanlah kepadanya wahai Nabi Allah : Sesungguhnya aku hanyalah pemberi peringatan bagi mereka yang ingkar dan sesat (yang berhak) dibalas dengan adzab dan hukuman dari Allah, dan tidaklah hidayah itu ada di tanganmu serta keimanan pula."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar kamu mengambil petunjuk darinya dan mengikutinya. Inilah tugas Nabi Muhammad shallallahu 'alaihi wa sallam. Yakni aku tidak berkuasa menjadikan kamu mendapatkan hidayah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 92",
    "description": "Dan di samping yang aku lakukan khusus buat diriku, aku diperintahkan pula agar aku membacakan semua ayat-ayat suci Al-Qur'an kepada manusia. Maka barangsiapa mendapat petunjuk dari hasil penyampaianku, atau bacaan dan pemahaman Al-Qur'an yang kusampaikan, maka sesungguhnya dia mendapat petunjuk untuk kebaikan dirinya, dalam hal ini aku hanya berfungsi sebagai penyampai kabar gembira, dan barangsiapa yang enggan memperhatikan tuntunan Al-Qur'an sehingga dia sesat dan tidak menemukan jalan yang benar, maka katakanlah kepadanya dan kepada siapa pun juga, \"sesungguhnya aku ini tidak lain hanyalah solah seorang pemberi peringatan dari sekian banyak nabi dan rasul yang telah diutus sebelum aku. Hidayah ada di tangan tuhan. \"93. Dan sebagai bentuk rasa syukur atas anugerah Al-Qur'an yang diturunkan sebagai petunjuk dan berita gembira serta peringatan kepada seluruh manusia maka katakanlah wahai nabi Muhammad, \"segala puji bagi Allah atas segala nikmat anugerah dan juga segala petaka yang bertujuan menguji. Kepada mereka yang enggan percaya, nabi Muhammad diperintahkan untuk menyampaikan bahwa \"dia yang maha esa itu akan memperlihatkan kepadamu tanda-tanda keesaan, kebesaran dan kekuasaan-Nya, maka kamu akan mengetahuinya. Dan pada saat itu kamu akan yakin bahwa kitab suci Al-Qur'an dan seluruh berita yang ada di dalamnya adalah kebenaran. Dan selanjutnya nabi Muhammad diingatkan, yang tujuan sebenarnya adalah mereka yang durhaka, bahwa tuhanmu tidak lengah terhadap apa yang kamu dan mereka kerjakan dan semua akan diberi balasan sesuai dengan keadilan atau kemurahan Allah. \"."
  }
]