[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ucapkanlah (wahai Rasul) pujian yang baik bagi Allah. Dia akan memperlihatkan kepada kalian ayat-ayat kebesaranNya pada diri kalian, di langit dan dibumi, maka kalian akan mengetahuinya dengan pengetahuan yang akan memandu kalian menuju kepada kebenaran dan menjelaskan kepada kalian tentang kebatilan. Dan tidaklah Tuhanmu itu lalai dari apa yang kalian perbuat. Dan Dia akan memberikan balasan kepada kalian atas perbuatan kalian tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Katakan -wahai Rasul- “Segala puji bagi Allah atas semua nikmat-Nya yang tak terhitung, Allah akan menampakkan kepada kalian tanda-tanda kebesaran-Nya di jagat dan pada jiwa-jiwa kalian, di langit dan bumi serta rezeki sehingga kalian akan mengetahuinya dengan pengetahuan yang membimbing kalian untuk tunduk kepada kebenaran, dan tidaklah Rabbmu itu lalai atas apa yang kalian lakukan, justru Dia mengetahuinya, tidak ada sesuatu pun yang tersembunyi dari-Nya dan Dia akan membalas perbuatan kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Hai Rasulullah, katakanlah: “Pujian agung bagi Allah atas segala kenikmatan yang telah Dia berikan kepada kita di dunia dan di akhirat; dan kalian akan melihat ayat-ayat-Nya di dunia sehingga kalian akan mengetahui petunjuknya atas apa yang aku sampaikan kepada kalian, dan kalian akan mengetahui kekuasaan-Nya dalam menguatkannya. Dan kebenaran akan jelas bagi kalian ketika kalian datang kematian, akan tetapi pada waktu itu tidak akan diterima lagi keimanan dan ketaatan dari kalian. Sungguh Tuhanmu Maha Melihat kalian, dan tidak lalai dari perbuatan orang-orang yang mendustakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَقُلِ الْحَمْدُ لِلّٰهِ (Dan katakanlah: “Segala puji bagi Allah) Atas nikmat-nikmat yang Allah berikan berupa kenabian, ilmu, dan lainnya. سَيُرِيكُمْ ءَايٰتِهِۦ(Dia akan memperlihatkan kepadamu tanda-tanda kebesaran-Nya) Lewat diri kalian dan selain kalian. فَتَعْرِفُونَهَا ۚ( maka kamu akan mengetahuinya) Yakni mengetahui ayat-ayat-Nya dan bukti-bukti kekuasaan dan keesaan-Nya. Namun pengetahuan ini tidak bermanfaat bagi orang-orang kafir, sebab mereka mengetahui ayat-ayat tersebut saat keimanan sudah tidak diterima lagi dari mereka, yaitu saat kematian mendatangi mereka. وَمَا رَبُّكَ بِغٰفِلٍ عَمَّا تَعْمَلُونَ(Dan Tuhanmu tiada lalai dari apa yang kamu kerjakan”) Ini merupakan ancaman dan pemberian rasa takut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93. Katakanlah wahai Rasul: \"Segala puji bagi Allah atas segala nikmat yang Dia anugerahkan kepadaku berupa nikmat kenabian, ilmu, amal yang menjadikan Dia ridho kepadaku. Dia akan memperlihatkan kepadamu tanda-tanda kebesaran-Nya, seperti pada perang Badar, atau kelak di akhirat yang telah kalian paksa penyegeraannya. Tuhanmu tidak pernah lalai atas apapun yang engkau kerjakan, Maha Tahu atas perbuatanmu.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Segala puji bagi Allah. Dia akan memperlihatkan kepada kalian ayat-ayatNya sehingga kalian akan mengetahuinya. Tuhanmu tidak lengah terhadap apa yang kalian kerjakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. “Dia akan memperlihatkan kepadamu tanda-tandaNya, maka kamu akan megetahuinya,” dengan suatu pengetahuan yang menunjukkan kalian kepada yang benar dan yang palsu. Maka Dia pasti memperlihatkan kepada kalian tanda-tandaNya yang dapat kalian jadikan sebagai penerang dalam kegelapan-kegelapan; agar binasa orang yang semestinya binasa berdasarkan bukti, dan agar hidup orang semestinya hidup berdasarkan bukti. “Dan Rabbmu tiada lalai dari apa yang kamu kerjakan.” Bahkan sebenarnya Dia telah mengetahui apa yang telah kalian lalui berupa perbuatan dan keadaan, dan Dia mengetahui besarnya kadar balasan untuk perbuatan tersebut, dan Dia akan memberikan keputusan di antara kalian dengan suatu keputusan yang kalian akan memujiNya atas putusan itu, dan kalian sama sekali tidak akan memiliki argument apa pun terhadapnya dari segala sisi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Naml ayat 93: Allah kemudian mengakhiri surat ini dengan memerintahkan kepada Nabi-Nya Muhammad ﷺ agar berkata : Segala puji milik Allah. Yaitu puji-pujian seluruhnya milik Allah saja, dan karunia seluruhnya adalah milik Allah. Kalian akan diperlihatkan tanda-tanda dari ke-esaan Allah dan kekuasaan-Nya dengan pengetahuan yang benar. Sungguh Tuhanmu wahai Nabi Allah tidaklah lalai atas apa yang diperbuat dan dikatakan oleh manusia kepadamu. Karena sesungguhnya tidaklah tersembunyi bagi-Nya sesuatu apapun juga dari amalan-amalan mereka, tetaplah berdakwah (lanjutkan), sampaikan apa yang engkau diperintahkan dengannya, karena sungguh engkau akan mendapatkan balasan beserta orang-orang yang beriman. Kata “Sayurikum” maknanya adalah kalian akan diperlihatkan yaitu atas ayat-ayat keagungan Allah dan kuasa-Nya serta ke-esaan-Nya yang akan senantiasa nampak di setiap zaman yang akan datang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah berhak mendapatkan pujian di dunia dan akhirat, dan dari semua makhluk, terlebih oleh hamba pilihan-Nya, sehingga yang patut mereka lakukan adalah memuji dan menyanjung Tuhan mereka melebihi pujian yang dilantunkan oleh selain mereka, karena tingginya derajat mereka, dekatnya mereka dan banyaknya kebaikan yang diberikan kepada mereka. Allah Subhaanahu wa Ta'aala memperlihatkan kepada mereka ayat-ayat-Nya, termasuk di antaranya terbunuhnya orang-orang yang kafir kepada-Nya pada perang Badar, ditawannya mereka, dipukulnya wajah dan punggung mereka oleh malaikat, dan lain-lain. Bisa juga maksudnya, bahwa Allah Subhaanahu wa Ta'aala akan memperlihatkan ayat-ayat-Nya yang menerangkan mana yang hak dan mana yang batil serta menyinari keadaan yang sebelumnya gelap, sehingga kita benar-benar mengetahuinya. Dia mengetahui amal dan keadaan yang kamu lakukan, mengetahui ukuran yang perlu diberikan kepada amal itu serta memberikan keputusan di antara kamu dengan keputusan yang kamu akan memuji-Nya serta tidak menyisakan hujjah lagi bagi kamu. Selesai tafsir surah An Naml dengan pertolongan Allah dan taufiq-Nya, wal hamdulillahi awwalan wa aakhiran. Kita meminta kepada Allah Subhaanahu wa Ta'aala agar kelembutan-Nya dan pertolongan-Nya tetap dilimpahkan kepada kita, Dia adalah Tuhan yang Maha Pemurah, Maha Penyayang, membuka harapan bagi orang-orang yang sudah hampir putus harapan, mengabulkan doa orang-orang yang meminta, Pemberi kenikmatan di setiap saat dan setiap waktu, memudahkan Al Qur’an bagi orang-orang yang mengambilnya sebagai pelajaran serta memudahkan jalan dan pintu-pintunya, wal hamdulillahi rabbil ‘aalamin wa shallallahu ‘alaa Muhammad wa ‘alaa aalihi wa shahbihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Naml Ayat 93",
    "description": "Dan sebagai bentuk rasa syukur atas anugerah Al-Qur'an yang diturunkan sebagai petunjuk dan berita gembira serta peringatan kepada seluruh manusia maka katakanlah wahai nabi Muhammad, \"segala puji bagi Allah atas segala nikmat anugerah dan juga segala petaka yang bertujuan menguji. Kepada mereka yang enggan percaya, nabi Muhammad diperintahkan untuk menyampaikan bahwa \"dia yang maha esa itu akan memperlihatkan kepadamu tanda-tanda keesaan, kebesaran dan kekuasaan-Nya, maka kamu akan mengetahuinya. Dan pada saat itu kamu akan yakin bahwa kitab suci Al-Qur'an dan seluruh berita yang ada di dalamnya adalah kebenaran. Dan selanjutnya nabi Muhammad diingatkan, yang tujuan sebenarnya adalah mereka yang durhaka, bahwa tuhanmu tidak lengah terhadap apa yang kamu dan mereka kerjakan dan semua akan diberi balasan sesuai dengan keadilan atau kemurahan Allah. \"t' s'n m'm."
  }
]