[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Takjublah kepada kebiasaan dan keamanan orang orang quraisy, stabilnya kemaslahatan mereka, Dan teraturnya perjalanan dagang mereka di musim dingin ke Yaman dan musim panas ke Syam dengan lancar dan mudah, untuk mendapatkan apa yang mereka butuhkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Karena kebiasaan kaum Quraisy dan adat mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah menyebutkan kenikmatan yang telah diberikan kepada kabilah Quraisy, berupa keamanan dan perniagaan yang biasa mereka lakukan menuju negeri Yaman dan Syam, sehingga mereka dapat menikmati kenikmatan yang ada pada musim panas dan musim dingin, sebagai nikmat yang harus mereka syukuri: Takjublah pada kebiasaan kaum Quraisy yang bepergian ke Yaman di musim dingin dan ke Syam di musim panas, dan kenikmatan-kenikmatan yang ada pada dua perjalanan itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah telah melimpahkan kepada kaum Quraisy berbagai kenikmatan yang berbeda-beda, Dia mengalihkan hati-hati manusia kepada mereka, dan Dia juga membukakan bagi mereka kemudahan dalam urusan perdagangan, Dia memberi mereka makan dan membebaskan mereka dari kelaparan, serta menjadikan untuk mereka rasa aman dari segala ketakutan, tetapi mereka belum juga menerima syari'at ini pada awal-awal risalah, maka tidak harus bagi setiap da'i merasa takjub dengan sikap mereka yang berpaling dari Allah tetapi bergelimang kenikmata dari Allah. 2 ). { لِإِيلَافِ قُرَيْشٍ } Apakah yang menjadi sebab kenapa Allah mengawali surah ini dengan bahasan kebiasaan orang-orang quraisy ? Seorang Ahli ilmu mengatakan : hal itu dikarenakan kepedulian Allah terhadap sikap mereka, yang dengannya perintah ibadah itu ditujukan kepada mereka, dan syukur terhadap segala nikmat Allah atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan surah: Al-Baihaqi meriwayatkan tentang masalah khilafiyah dari Ummu Hani’ binti Abu Thalib bahwa sesungguhnya Rasulallah SAW bersabda: ”Allah mengutamakan suku Quraisy dengan tujuh karakter, di antaranya yaitu bahwa Allah menurunkan surah dalam Al-Qur’an untuk mereka”, kemudian Rasulallah SAW membaca surah ini. 1. Kagumlah kalian pada kebiasaan suku Quraisy, yaitu suku dari bangsa Arab yang paling agung yang berasal dari keturunan An-Nadhar bin Kinanah dan merupakan sukunya Nabi SAW. Kata “Iilaf” merupakan mashdar dari kata Alifa yaitu persembahan keramah-tamahan. Imam Hakim dan lainnya mengatakan bahwa hadits dari Ummu Hani’ sebelumnya adalah untuk menjelaskan sebab turunnya surah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Disebabkan oleh kebiasaan orang-orang Quraisy} karena kebiasaan kafilah Quraisy"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Banyak ulama tafsir yang menyatakan bahwa huruf jar dan majrur dalam ayat ini berkaitan dengan surat sebelumnya. Yakni, Kami (Allah) memperlakukan tentara bergajah itu adalah demi kaum Quraisy, demi keamanan, tegaknya maslahat mereka, dan untuk keteraturan perjalanan mereka di musim dingin ke Yaman dan di musim panas ke Syam untuk berdagang dan mencari rizki. Karena itu Allah membinasakan siapa pun yang berniat jahat pada mereka. Allah mengagungkan perihal tanah haram dan penduduknya di hati bangsa Arab agar mereka menghormati kaum Quiraisy dan agar mereka tidak mengganggu kaum Quraisy kemana pun ketika ingin bepergian. Karena itu Allah memerintahkan kaum Quraisy bersukur seraya berfirman, “Maka hendaklah mereka menyembah Rabb Pemilik rumah ini (Ka’bah),” yakni, hendaklah mereka mengesakanNYa dan memurnikan ibadah hanya untukNya. “Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.” Hal itu karena kenikmatan rizki dan rasa aman merupakan salah satu nikmat duniawi terbesar yang mengharuskan untuk disyukuri. Segala puji dan syukur hanya untukMu, ya Allah, atas segala nikmat lahir dan batin yang Engkau limpahkan. Allah mengkhususkan penyebutan rububiyah pada Ka’bah karena keutamaan dan kemuliaannya, karena pada hakikatnya Dia adalah Rabb segala sesuatu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Surah yang agung ini ada kaitannya dengan surah sebelumnya. Takjub dan kagumlah kalian pada kebiasaan orang-orang dari suku quraisy yang suka berbuat baik disekitar alharom yakni disekitar kakbah, suku quraisy merupakan mutiara bagi bangsa arab saat itu, hal itu dikarenakan mereka tinggal disekitar masjid alharom atau kakbah, dan mereka kerap menyambut kehadiran para hujjaj pada zaman jahiliyah yang datang dari berbagai wilayah, mereka mempersembahkan segala kebaikan yang mereka miliki. Dan sesungguhnya Allah - عز وجل - memusnahkan bala tentara gajah untuk memuliakan suku ini, yang merupakan keluarga pemegang kunci kakbah hingga saat ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "1-2. Surat ini memiliki kaitan dengan surat sebelumnya. Surat sebelumnya mengandung penjelasan tentang karunia Allah 'Azza Wa Jalla kepada penduduk Mekah, dengan kejadian yang Allah perbuat kepada pesukan gajah yang pergi ke Mekkah dalam rangka menghancurkan ka'bah. Dalam surat ini Allah menjelaskan nikmat besar lain kepada penduduk Mekkah (Suku Quraisy) yaitu kebiasaan (bepergian) mereka dalam setahun dua kali, yaitu sekali pada musim panas, dan sekali pada musim dingin. لِإِيلَافِ قُرَيْشٍ (1) إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ \"106:1. Karena kebiasaan orang-orang Quraisy, (yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas.\" Al-Iilaaf bermakna mengumpulkan dan menyatukan, yang dimaksud disini adalah berdagang yang mereka lakukan sekali pada musim semi, sekali di musim panas. Pada musim dingin mereka pergi ke negeri yang untuk memperolah hasil pertanian, karena udaranya cocok. Sedangkan pada musim pana mereka pergi ke arah Syam karena kebanyakan perdagangan buah-buahan dan lainya ada pada waktu ini, pada musim panas disamping juga cocoknya udara yang dingin. Ini adalah kenikmatan dari Allah Subhaanahu wa Ta'ala kepada Quraisy, pada dua perjalanan tersebut, karena darinya mereka memperolah manfaat yang banyak dan penghasilan yang besar dari perdagangan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Quraisy ayat 1: 1-2. Allah mengabarkan bahwa perbuatan (Allah) yang diperbuatan kepada pasukan bergajah karena sebab Quraisy dan keamanan mereka; Dan karena sebab kebiasaan rihlah mereka; Dimana Quraisy kebiasaannya rihlah di musim panas menuju Syam dan musim dingin menuju Yaman. Dan rihlah keduanya ini dengan tujuan mencari barang dagangan, karena Arab pada waktu itu hidup dengan tanpa merasakan aman, dimana yang kuat dari mereka akan menindas yang lemah. Adapun penduduk Mekkah pada waktu itu adalah berdagang di dua tempat rihlah tersebut, mereka tidak pernah bertemu dengan perampok dan pembegal di dua tempat tadi. Karena mereka adalah penjaga baitullah, maka setiap orang arab mereka memuliakannya, sebab mereka mengetahui bahwa Quraisy akan membalasnya ketika manusia berhaji, seandainya memperlakukan keburukan kepada mereka (Quraisy)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para mufassir banyak yang menyebutkan, bahwa jaar-majrur (huruf yang mengkasrahkan dan kata yang dikasrahkan) itu terkait dengan surah sebelumnya, yakni Kami bertindak terhadap pasukan bergajah itu adalah untuk suku Qurasiy dan untuk keamanan mereka, stabilnya kemaslahatan mereka, terjaganya perjalanan mereka di musim dingin dan musim panas untuk berdagang dan berusaha. Allah Subhaanahu wa Ta'aala telah membinasakan orang-orang yang bermaksud buruk kepada mereka, membesarkan perkara tanah haram dan penduduknya di hati orang-orang Arab sehingga mereka dihormati dan tidak ada yang melakukan tindakan buruk kepada mereka ketika mereka bersafar ke mana saja yang mereka mau, mereka mendapat jaminan keamanan dari penguasa-penguasa negeri-negeri yang dilaluinya. Ini adalah suatu nikmat yang besar dari Tuhan mereka. Oleh karena itu sudah sewajarnya mereka bersyukur kepada Allah Subhaanahu wa Ta'aala yang telah memberikan nikmat itu kepada mereka dengan beribadah kepada-Nya dan mengikhlaskan ibadah karena-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Quraisy Ayat 1",
    "description": "Wahai manusia, kamu akan dibuat kagum karena kebiasaan orang-orang quraisy, suatu kabilah besar yang mempunyai peranan sentral pada masyarakat arab dalam bidang politik dan sosial. 2. Yaitu kebiasaan mereka bepergian pada musim dingin ke yaman dan musim panas ke syam untuk berniaga guna memenuhi kebutuhan hidup mereka di mekah untuk berkhidmat merawat kakbah dan melayani para peziarah, suatu hal yang menjadi kebanggan mereka atas kabilah-kabilah lain."
  }
]