[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Takjublah kepada kebiasaan dan keamanan orang orang quraisy, stabilnya kemaslahatan mereka, Dan teraturnya perjalanan dagang mereka di musim dingin ke Yaman dan musim panas ke Syam dengan lancar dan mudah, untuk mendapatkan apa yang mereka butuhkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Yaitu melakukan perjalanan pada musim dingin ke Yaman dan perjalanan pada musim panas ke negeri Syam dengan aman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. اٖلٰفِهِمۡ رِحۡلَةَ الشِّتَآءِ وَالصَّيۡفِ‌ۚ‏ ((yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas) Pada musim dingin mereka pergi ke Yaman karena ia merupakan negeri yang panas, dan pada musim panas mereka pergi ke Syam karena ia merupakan negeri yang dingin. Dan kaum Quraisy hidup dengan berdagang. Kalaulah mereka tidak bepergian pada dua musim ini niscaya mereka tidak akan mampu bertahan, dan kalaulah bukan karena keamanan yang mereka dapatkan karena tinggal di sekitar Ka’bah niscaya mereka tidak akan mampu bekerja. Makna ayat ini adalah Allah menjadikan mereka menyukai bepergian di dua musim itu, oleh sebab itu hendaklah mereka mengesakan Allah dalam ibadah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Kebiasaan mereka adalah (bisa) berpergian dengan aman dan tenang pada musim dingin menuju Yaman, karena di sana merupakan negeri yang panas, dan pada musim panas menuju Syam, karena di sana merupakan negeri yang dingin. Perjalanan mereka untuk melakukan perdagangan yang (akhirnya) membuat mereka memiliki kekuasaan dan kemasyhuran di kalangan suku-suku lain. Kata “Iilaf” disini merupakan badal (pengganti) dari kata “iilaf” pada ayat pertama. Kata “iilaf” ini diletakkan di permulaan untuk memikat dan untuk menghubungkannya dengan kata “iilaf” di ayat pertama."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kebiasaan mereka} kebiasaan mereka {bepergian pada musim dingin} menuju Yaman {dan musim panas} perjalanan pada musim panas menuju Syam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Banyak ulama tafsir yang menyatakan bahwa huruf jar dan majrur dalam ayat ini berkaitan dengan surat sebelumnya. Yakni, Kami (Allah) memperlakukan tentara bergajah itu adalah demi kaum Quraisy, demi keamanan, tegaknya maslahat mereka, dan untuk keteraturan perjalanan mereka di musim dingin ke Yaman dan di musim panas ke Syam untuk berdagang dan mencari rizki. Karena itu Allah membinasakan siapa pun yang berniat jahat pada mereka. Allah mengagungkan perihal tanah haram dan penduduknya di hati bangsa Arab agar mereka menghormati kaum Quiraisy dan agar mereka tidak mengganggu kaum Quraisy kemana pun ketika ingin bepergian. Karena itu Allah memerintahkan kaum Quraisy bersukur seraya berfirman, “Maka hendaklah mereka menyembah Rabb Pemilik rumah ini (Ka’bah),” yakni, hendaklah mereka mengesakanNYa dan memurnikan ibadah hanya untukNya. “Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.” Hal itu karena kenikmatan rizki dan rasa aman merupakan salah satu nikmat duniawi terbesar yang mengharuskan untuk disyukuri. Segala puji dan syukur hanya untukMu, ya Allah, atas segala nikmat lahir dan batin yang Engkau limpahkan. Allah mengkhususkan penyebutan rububiyah pada Ka’bah karena keutamaan dan kemuliaannya, karena pada hakikatnya Dia adalah Rabb segala sesuatu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Salah satu kebiasaan suku quraisy adalah melakukan perjalanan pada dua musim, yaitu musim dingin dan musim panas, mereka melakukan perjalanan untuk berdagang, mereka membawa barang dari tempat-tempat tujuan mereka untuk di bawa masuk ke kota makkah, karena pada saat itu kota Makkah tidak menyimpan barang-barang berharga yang dapat digunakan dalam kehidupan sehari-hari mereka, suku quraisya memiliki kebiasan melakukan perjalanan kedua kota yang berbeda : Perjalanan pada musim dingin menuju Yaman, karena ditempat itu mereka mendapatkan hawa yang cukup hangat. Dan perjalanan musim panas menuju Kota Syam, karena di wilayah itu cuaca yang cukup sejuk dan adem. Perjalanan mereka terus dalam keadaan aman, dan ada hambatan yang menghalangi mereka, seperti permapok dan begal, perjalanan mereka lakukan untuk kepentingan baitul haram, dan juga : ini merupakan permulaan dari diutusnya Rasulullah ﷺ sebagai pembawa risalah untuk rumah yang mulia ini."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "1-2. Surat ini memiliki kaitan dengan surat sebelumnya. Surat sebelumnya mengandung penjelasan tentang karunia Allah 'Azza Wa Jalla kepada penduduk Mekah, dengan kejadian yang Allah perbuat kepada pesukan gajah yang pergi ke Mekkah dalam rangka menghancurkan ka'bah. Dalam surat ini Allah menjelaskan nikmat besar lain kepada penduduk Mekkah (Suku Quraisy) yaitu kebiasaan (bepergian) mereka dalam setahun dua kali, yaitu sekali pada musim panas, dan sekali pada musim dingin. لِإِيلَافِ قُرَيْشٍ (1) إِيلَافِهِمْ رِحْلَةَ الشِّتَاءِ وَالصَّيْفِ \"106:1. Karena kebiasaan orang-orang Quraisy, (yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas.\" Al-Iilaaf bermakna mengumpulkan dan menyatukan, yang dimaksud disini adalah berdagang yang mereka lakukan sekali pada musim semi, sekali di musim panas. Pada musim dingin mereka pergi ke negeri yang untuk memperolah hasil pertanian, karena udaranya cocok. Sedangkan pada musim pana mereka pergi ke arah Syam karena kebanyakan perdagangan buah-buahan dan lainya ada pada waktu ini, pada musim panas disamping juga cocoknya udara yang dingin. Ini adalah kenikmatan dari Allah Subhaanahu wa Ta'ala kepada Quraisy, pada dua perjalanan tersebut, karena darinya mereka memperolah manfaat yang banyak dan penghasilan yang besar dari perdagangan tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Quraisy ayat 2: 1-2. Allah mengabarkan bahwa perbuatan (Allah) yang diperbuatan kepada pasukan bergajah karena sebab Quraisy dan keamanan mereka; Dan karena sebab kebiasaan rihlah mereka; Dimana Quraisy kebiasaannya rihlah di musim panas menuju Syam dan musim dingin menuju Yaman. Dan rihlah keduanya ini dengan tujuan mencari barang dagangan, karena Arab pada waktu itu hidup dengan tanpa merasakan aman, dimana yang kuat dari mereka akan menindas yang lemah. Adapun penduduk Mekkah pada waktu itu adalah berdagang di dua tempat rihlah tersebut, mereka tidak pernah bertemu dengan perampok dan pembegal di dua tempat tadi. Karena mereka adalah penjaga baitullah, maka setiap orang arab mereka memuliakannya, sebab mereka mengetahui bahwa Quraisy akan membalasnya ketika manusia berhaji, seandainya memperlakukan keburukan kepada mereka (Quraisy)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Orang Quraisy biasa mengadakan perjalanan terutama untuk berdagang ke negeri Syam pada musim panas dan ke negeri Yaman pada musim dingin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Quraisy Ayat 2",
    "description": "Yaitu kebiasaan mereka bepergian pada musim dingin ke yaman dan musim panas ke syam untuk berniaga guna memenuhi kebutuhan hidup mereka di mekah untuk berkhidmat merawat kakbah dan melayani para peziarah, suatu hal yang menjadi kebanggan mereka atas kabilah-kabilah lain. 3. Mereka pergi berniaga tiap tahun dengan aman dan sentosa. Oleh karena itu maka hendaklah mereka menyembah tuhan pemilik rumah ini, yaitu kakbah, dengan pengabdian yang hakiki dan tidak mempersekutukan-Nya, sebagai bentuk rasa syukur atas nikmat yang telah mereka terima."
  }
]