[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Karena itu, hendaknya mereka bersyukur dan menyembah tuhan bangunan yang mereka banggakan ini, (yaitu ka’bah) yang karena Nya mereka mendapatkan kemuliaan dan tempat yang tinggi, dan hendaklah mereka mentauhidkan Allah dan mengikhlaskan ibadah hanya kepada NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Maka hendaknya mereka menyembah Allah Pemilik Baitul Haram ini semata, Yang telah memudahkan perjalanan tersebut bagi mereka, dan hendaknya mereka tidak menyekutukan-Nya dengan sesuatu pun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Maka hendaklah mereka mengikhlaskan ibadah hanya kepada Tuhannya Masjidil Haram, Yang telah memberi mereka kenikmatan dan hewan ternak, serta keamanan dari ketakutan dan perampasan atas harta mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. فَلْيَعْبُدُوا۟ رَبَّ هٰذَا الْبَيْتِ (Maka hendaklah mereka menyembah Tuhan Pemilik rumah ini (Ka’bah)) Allah memberitahukan kepada mereka bahwa Dia adalah Tuhan Baitul haram, sebab mereka dahulu memiliki banyak berhala yang mereka sembah, maka Allah membedakan diri-Nya dari berhala-berhala itu. Dan dengan Baitul haram mereka menjadi mulia di hadapan orang-orang Arab lainnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "3-4 1 ). { فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ } Al-Qur'an tidak mengatakan : فليعبدوا الله ; tatkala mengisyaratkan kata { رَبَّ } karena Allah berhak atas hamba-Nya menyendirikan-Nya dalam segala ibadah tanpa menyekutukan-Nya. Adapun penisbatan kata { رَبَّ } kedalam kalimat { هَٰذَا الْبَيْتِ } dan tidak dengan kata ( ربهم ) sebagai isyarat bahwa baitullah ( ka'bah ) itu adalah asas dari nikmat kebiasaan orang-orang quraisy dengan diperintahkannya Ibrahim untuk membangun al-harom ini, yang hal itu merupakan sebab diangkatnya derajat merek diantara orang-orang Arab. 2 ). Perhatikanlah bagaimana sebab dan musabab dihubungkan dalam ayat-ayat berikut : { فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ , الَّذِي أَطْعَمَهُمْ } sebagaiman yang juga disebutkan di ayat pertama dalam mushaf : { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } yakni : Allah ta'ala berhak untuk mendapat pujian, karena Dialah tuhan semesta alam, Dia menciptakan mereka dan memberi mereka makan, hal ini telah ditetapkan di awal perintah dalam mushaf : { يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ } \"wahai manusia sembahlah tuhan kalian\" , kemudian dijelaskan setelahnya sebab dari perintah itu : { الَّذِي خَلَقَكُمْ } Dialah tuhanmu yang menciptakan. [ al-Baqarah : 21 ] . 3 ). Allah ta'ala berfirman dalam surah an-Naml : 91 : { رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ } , kemudian Allah berifrman dalam surah ini : { فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ } karena ayat ini bermaksud menjelaskan keagungan rumah ( ka'bah ) ini, sedangkan yang disebutkan dalam surah an-Naml adalah penjelasan umum dari kepemilikan Allah; maka pengkhususan yang disebutkan dalam surah ini bertujuan agar orang-orang quraisy tidak menyangka bahwa Allah hanya berkuasa atas wilayah saja. 4 ) . Orang yang baik selalu terpikat dengan amalan yang baik, dan mensyukuri kebaikan, oleh karena itu Allah ta'ala selalu menggabungkan ayat yang memerintahkan ibadah kepadanya dengan ayat yang menceritakan tentang kenikmatan yang Dilimpahkan kepada hamba-hamba Nya, agar mereka senantiasa berserah diri dengan segala perintah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Karena kenikmatan berupa kebiasaan ini, maka sebaiknya mereka menyembah Tuhan Ka’bah yang menjadikan mereka mulia di seluruh penjuru Arab dan mereka bisa hidup di samping Baitul Haram dengan aman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{maka hendaklah mereka menyembah Tuhan rumah ini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Banyak ulama tafsir yang menyatakan bahwa huruf jar dan majrur dalam ayat ini berkaitan dengan surat sebelumnya. Yakni, Kami (Allah) memperlakukan tentara bergajah itu adalah demi kaum Quraisy, demi keamanan, tegaknya maslahat mereka, dan untuk keteraturan perjalanan mereka di musim dingin ke Yaman dan di musim panas ke Syam untuk berdagang dan mencari rizki. Karena itu Allah membinasakan siapa pun yang berniat jahat pada mereka. Allah mengagungkan perihal tanah haram dan penduduknya di hati bangsa Arab agar mereka menghormati kaum Quiraisy dan agar mereka tidak mengganggu kaum Quraisy kemana pun ketika ingin bepergian. Karena itu Allah memerintahkan kaum Quraisy bersukur seraya berfirman, “Maka hendaklah mereka menyembah Rabb Pemilik rumah ini (Ka’bah),” yakni, hendaklah mereka mengesakanNYa dan memurnikan ibadah hanya untukNya. “Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.” Hal itu karena kenikmatan rizki dan rasa aman merupakan salah satu nikmat duniawi terbesar yang mengharuskan untuk disyukuri. Segala puji dan syukur hanya untukMu, ya Allah, atas segala nikmat lahir dan batin yang Engkau limpahkan. Allah mengkhususkan penyebutan rububiyah pada Ka’bah karena keutamaan dan kemuliaannya, karena pada hakikatnya Dia adalah Rabb segala sesuatu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ayat ini mengatakan : Hendaklah mereka menyembah Tuhan pemilik rumah ini, dan tidak mengatakan : sembahlah rumah ini, karena sesungguhnya ibadah itu hanya untuk Allah - عز وجل - , adapun rumah itu hanya sebagai tempat untuk melaksanakan ibadah kepada Allah - عز وجل -."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah memerintahkan mereka agar beribadah kepada Tuhan rumah ini (ka'bah), Allah berfirman: فَلْيَعْبُدُوا رَبَّ هَذَا الْبَيْتِ \" Maka hendaklah mereka menyembah Tuhan Pemilik rumah ini (Kakbah)\" Sebagai bentuk kesyukuran kepada-Nya atas nikmat ini, huruf Faa di sini bisa menjadi faa sababiyah (menunjukkan sebab), sehingga bermakna. Karena sebab dua perjalanan ini, hendaknya mereka beribadah kepada Tuhan rumah ini, atau juga bisa menunjukkan faa tafrii' (menunjukkan perbedaan). Tapi apapun jenisnya, maka faa ini dibangun atas kalimat (pada ayat) sebelumnya. Maknyanya: dengan kenikmatan yang besar ini, maka wajib bagi mereka beribadah kepada Allah. Ibadah maknyanya adalah merendah kepada Allah 'Azza Wa Jalla karena cinta dan pengagungan. Seorang insan beribadah kepada Allah merendah kepada-Nya dengan mendengar dan taat kepada-Nya. Apabila sampai kepadanya perintah dari Allah dan Rasul-Nya, katakan: Kami dengar dan kami taat, apabila sampai kepadanya berita, katakan: Kami dengar dan kami beriman disertai dengan kecintaan dan pengagungan, dengan kecintaan seorang insan melakukan perintah-perintah (Allah) dengan pengagungan ia meninggalkan larangan-larangan, karena takut kepada (Allah) Yang Maha Besar 'Azza Wa Jalla. Inilah di antara makna-makna ibadah. Ibadah pun juga disebut dengan perkara yang menjadi bentuk ibadah itu sendiri. Syaikhul Islam Ibnu Taimiyah rahimahullah mendefinisikannya dengan pemaknaan tersebut, beliau mengatkan: إِنَّ الْعِبَادَةَ اسْمٌ جَامِعٌ لِكُلِّ مَا يُحِبُّهُ اللهُ وَيَرْضَاهُ، مِنَ الأَقْوَالِ وَالْأَعْمَالِ الظَّاهِرَةِ وَالْبَاطِنَةِ \"Sesungguhnya ibadah adalah nama yang merangkum segala sesuatu yang dicintai dan diridhai Allah baik berupa perkataan-perkataan dan perbuatan-perbuatan baik yang terlihata atau pun yang tersembunyi \" Dan Firman-Nya: رَبَّ هَذَا الْبَيْتِ \"Tuhan rumah ini\" Maksudnya adalah ka'bah yang diagungkan. Allah Ta'ala telah menyandarkannya kepada diri-Nya dalam firman-Nya Ta'ala: وَطَهِّرْ بَيْتِيَ لِلطَّائِفِينَ وَالْقَائِمِينَ وَالرُّكَّعِ السُّجُودِ \" dan sucikanlah rumah-Ku ini bagi orang-orang yang tawaf, dan orang-orang yang beribadah dan orang-orang yang rukuk dan sujud. \"(QS. Al-Hajj: 26) Di sini Allah menyandarkan rububiyah-Nya kepada ka'bah Allah berfirman: رَبَّ هَذَا الْبَيْتِ \"Tuhan rumah ini\" Menyandarkan rububiyah-Nya kepada ka'bah untuk pemuliaan dan pengagungan. Dengan demikian, Allah telah memberikan keistimewaan ka'bah dengan rububiyah-Nya sekali, dan di ayat lain Allah menyandarkannya kepada diri-Nya, sebagai penghormatan dan pengagungan. Kemudian pada ayat kedua, Allah berfirman: إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا \" Aku hanya diperintahkan untuk menyembah Tuhan negeri ini (Mekah) Yang telah menjadikannya suci \" dan setelahnya Allah berfirman وَلَهُ كُلُّ شَيْءٍ \" dan kepunyaan-Nya-lah segala sesuatu,\" menangkal dari dugaan yang menduga bahwa Allah hanya Rabb negeri itu saja, Allah berfirman: وَلَهُ كُلُّ شَيْءٍ \" dan kepunyaan-Nya-lah segala sesuatu,\" Setiap momen memiliki ungkapan yang sesuai dengan kondisi, dalam firman-Nya: إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ رَبَّ هَذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ \" Aku hanya diperintahkan untuk menyembah Tuhan negeri ini (Mekah) Yang telah menjadikannya suci dan kepunyaan-Nya-lah segala sesuatu,\" terdapat keserasian penjelasan luasnya kepunyaan Allah , sehingga tidak ada kaum musyrikin yang menduga bahwa Dia hanyalah Tuhan negeri itu saja. Sedangkan pada surat ini maka ini adalah tempat yang sesuai untuk mengagungkan ka'bah, maka di sini ka'bah cocok disebutkan sendiri saja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Quraisy ayat 3: 3-4. Dengan sebab kedudukan ini yang Allah peruntukkan bagi Quraisy memiliki kedudukan di hati orang-orang Arab; Maka sudah semestinya bagi mereka (wajib) mentauhidkan Allah pemilik rumah ini (Ka’bah) dan mengikhlaskan ibadah kepada-Nya. Ialah Allah yang memberi makan mereka dengan sebab (kemudahan) rihlah mereka, dari lapar yang sangat sebelum rihlah, dan ketakutan yang sangat; Karena sebelumnya bangsa arab saling menyandera satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dikhususkan kepada rumah itu (ka’bah) meskipun Dia Rabbul ‘aalamiin karena keutamaan dan kelebihan rumah itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Quraisy Ayat 3",
    "description": "Mereka pergi berniaga tiap tahun dengan aman dan sentosa. Oleh karena itu maka hendaklah mereka menyembah tuhan pemilik rumah ini, yaitu kakbah, dengan pengabdian yang hakiki dan tidak mempersekutukan-Nya, sebagai bentuk rasa syukur atas nikmat yang telah mereka terima. 4. Hendaklah mereka menyembah tuhan yang telah memberi makanan kepada mereka untuk menghilangkan lapar, memenuhi kebutuhan dasar mereka, dan mengamankan mereka dari rasa ketakutan. Terpenuhinya kebutuhan akan makanan dan rasa aman merupakan dua prasyarat penting yang menjamin kesejahteraan suatu masyarakat."
  }
]