[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yang memberi mereka makan dari kelaparan berat, dan memberi mereka rasa aman dari ketakutan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Yang telah memberi mereka makanan untuk menghilangkan rasa lapar dan memberi mereka rasa aman dari ketakutan, dengan menanamkan di dalam hati orang-orang Arab pengagungan terhadap tanah haram dan pengagungan terhadap para penduduknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. الَّذِىۡۤ اَطۡعَمَهُمۡ مِّنۡ جُوۡعٍ (Yang telah memberi makanan kepada mereka untuk menghilangkan lapar) Yakni Allah memberi mereka makanan dengan perjalanan di dua musim tersebut, sehingga Allah menyelamatkan mereka dari kelaparan yang terjadi sebelum perjalanan tersebut. وَّاٰمَنَهُمۡ مِّنۡ خَوۡفٍ(dan mengamankan mereka dari ketakutan) Dahulu orang-orang Arab saling menyerang dan menawan, namun kaum Quraisy terbebas dari hal ini karena mereka tinggal di sekitar Baitul haram. Dan Allah juga telah memberi mereka keamanan dari serangan pasukan gajah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "3-4 1 ). { فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ } Al-Qur'an tidak mengatakan : فليعبدوا الله ; tatkala mengisyaratkan kata { رَبَّ } karena Allah berhak atas hamba-Nya menyendirikan-Nya dalam segala ibadah tanpa menyekutukan-Nya. Adapun penisbatan kata { رَبَّ } kedalam kalimat { هَٰذَا الْبَيْتِ } dan tidak dengan kata ( ربهم ) sebagai isyarat bahwa baitullah ( ka'bah ) itu adalah asas dari nikmat kebiasaan orang-orang quraisy dengan diperintahkannya Ibrahim untuk membangun al-harom ini, yang hal itu merupakan sebab diangkatnya derajat merek diantara orang-orang Arab. 2 ). Perhatikanlah bagaimana sebab dan musabab dihubungkan dalam ayat-ayat berikut : { فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ , الَّذِي أَطْعَمَهُمْ } sebagaiman yang juga disebutkan di ayat pertama dalam mushaf : { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ } yakni : Allah ta'ala berhak untuk mendapat pujian, karena Dialah tuhan semesta alam, Dia menciptakan mereka dan memberi mereka makan, hal ini telah ditetapkan di awal perintah dalam mushaf : { يَا أَيُّهَا النَّاسُ اعْبُدُوا رَبَّكُمُ } \"wahai manusia sembahlah tuhan kalian\" , kemudian dijelaskan setelahnya sebab dari perintah itu : { الَّذِي خَلَقَكُمْ } Dialah tuhanmu yang menciptakan. [ al-Baqarah : 21 ] . 3 ). Allah ta'ala berfirman dalam surah an-Naml : 91 : { رَبَّ هَٰذِهِ الْبَلْدَةِ الَّذِي حَرَّمَهَا وَلَهُ كُلُّ شَيْءٍ } , kemudian Allah berifrman dalam surah ini : { فَلْيَعْبُدُوا رَبَّ هَٰذَا الْبَيْتِ } karena ayat ini bermaksud menjelaskan keagungan rumah ( ka'bah ) ini, sedangkan yang disebutkan dalam surah an-Naml adalah penjelasan umum dari kepemilikan Allah; maka pengkhususan yang disebutkan dalam surah ini bertujuan agar orang-orang quraisy tidak menyangka bahwa Allah hanya berkuasa atas wilayah saja. 4 ) . Orang yang baik selalu terpikat dengan amalan yang baik, dan mensyukuri kebaikan, oleh karena itu Allah ta'ala selalu menggabungkan ayat yang memerintahkan ibadah kepadanya dengan ayat yang menceritakan tentang kenikmatan yang Dilimpahkan kepada hamba-hamba Nya, agar mereka senantiasa berserah diri dengan segala perintah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dialah Dzat yang melapangkan rejeki mereka dan memberi makan mereka melalui dua perjalanan itu sehingga kalian terlepas dari kelaparan yang sangat berat. Mereka hidup di sana sebelum melakukan dua perjalanan itu, dan yang membuat mereka (bisa) hidup dengan aman yaitu karena tempat yang mulia itu. Sehingga bangsa Arab tidak ada yang (berani) mengganggu mereka sebagaimana Allah mengamankan mereka dari serangan kaum Habsyah yang membawa pasukan gajah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang telah memberi mereka makanan untuk menghilangkan lapar dan mengamankan mereka dari rasa takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Banyak ulama tafsir yang menyatakan bahwa huruf jar dan majrur dalam ayat ini berkaitan dengan surat sebelumnya. Yakni, Kami (Allah) memperlakukan tentara bergajah itu adalah demi kaum Quraisy, demi keamanan, tegaknya maslahat mereka, dan untuk keteraturan perjalanan mereka di musim dingin ke Yaman dan di musim panas ke Syam untuk berdagang dan mencari rizki. Karena itu Allah membinasakan siapa pun yang berniat jahat pada mereka. Allah mengagungkan perihal tanah haram dan penduduknya di hati bangsa Arab agar mereka menghormati kaum Quiraisy dan agar mereka tidak mengganggu kaum Quraisy kemana pun ketika ingin bepergian. Karena itu Allah memerintahkan kaum Quraisy bersukur seraya berfirman, “Maka hendaklah mereka menyembah Rabb Pemilik rumah ini (Ka’bah),” yakni, hendaklah mereka mengesakanNYa dan memurnikan ibadah hanya untukNya. “Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.” Hal itu karena kenikmatan rizki dan rasa aman merupakan salah satu nikmat duniawi terbesar yang mengharuskan untuk disyukuri. Segala puji dan syukur hanya untukMu, ya Allah, atas segala nikmat lahir dan batin yang Engkau limpahkan. Allah mengkhususkan penyebutan rububiyah pada Ka’bah karena keutamaan dan kemuliaannya, karena pada hakikatnya Dia adalah Rabb segala sesuatu."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu tuhan yang melimpahkan kepada mereka begitu banyak rezeki, dan menjadikan diri mereka merasa aman dari rasa takut, rezeki dan keamanan dua nikmat yang saling berdampingan satu sama lian, sebagaimana rasa lapar dan takut berdampingan, Allah - عز وجل - berfirman : { وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا } ( Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezekinya datang kepadanya melimpah ruah dari segenap tempat ) [ An-Nahl : 112 ] , dan Allah berfirman : { يُجْبَىٰ إِلَيْهِ ثَمَرَاتُ كُلِّ شَيْءٍ رِزْقًا مِنْ لَدُنَّا وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ } ( yang didatangkan ke tempat itu buah-buahan dari segala macam (tumbuh-tumbuhan) untuk menjadi rezeki (bagimu) dari sisi Kami?. Tetapi kebanyakan mereka tidak mengetahui. ) [ Al-Qashash : 57 ] , buah-buahan dengan jenisnya yang bermacam didatangkan ke Kota Makkah, adalah merupakan bentuk ijabah dari doa Nabi Ibrahim - عليه السلام - Allah berfirman dengan mengutip doa Nabi Ibrahim : { وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَٰذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ } ( Dan (ingatlah), ketika Ibrahim berdoa: “Ya Tuhanku, jadikanlah negeri ini, negeri yang aman sentosa, dan berikanlah rezeki dari buah-buahan kepada penduduknya ) [ Al-Baqarah : 126 ] , Allah telah menurunkan kepada mereka rezeki yang melimpah akan tetapi ketika ditus kepada mereka seorang mereka kafir kepadanya dan mengeluarkannya dari kota itu, akhirnya Allah angkat kembali kenikmatan itu sebagai peringatan atas perbuatan keji mereka , Allah berfirman : { وَضَرَبَ اللَّهُ مَثَلًا قَرْيَةً كَانَتْ آمِنَةً مُطْمَئِنَّةً يَأْتِيهَا رِزْقُهَا رَغَدًا مِنْ كُلِّ مَكَانٍ فَكَفَرَتْ بِأَنْعُمِ اللَّهِ فَأَذَاقَهَا اللَّهُ لِبَاسَ الْجُوعِ وَالْخَوْفِ بِمَا كَانُوا يَصْنَعُونَ } ( Dan Allah telah membuat suatu perumpamaan (dengan) sebuah negeri yang dahulunya aman lagi tenteram, rezekinya datang kepadanya melimpah ruah dari segenap tempat, tetapi (penduduk)nya mengingkari nikmat-nikmat Allah; karena itu Allah merasakan kepada mereka pakaian kelaparan dan ketakutan, disebabkan apa yang selalu mereka perbuat. ) , { وَلَقَدْ جَاءَهُمْ رَسُولٌ مِنْهُمْ فَكَذَّبُوهُ فَأَخَذَهُمُ الْعَذَابُ وَهُمْ ظَالِمُونَ } ( Dan sesungguhnya telah datang kepada mereka seorang rasul dari mereka sendiri, tetapi mereka mendustakannya; karena itu mereka dimusnahkan azab dan mereka adalah orang-orang yang zalim ) [ An-Nahl : 112 - 113 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Firman-Nya: الَّذِي أَطْعَمَهُمْ مِنْ جُوعٍ وَآمَنَهُمْ مِنْ خَوْفٍ \" Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.\" الَّذِي [Alladzi: Rabb yang] ini adalah sifat bagi Rabb, jega demikian maka ia dalam kondisi manshub. Oleh karenanya baik jika bacaan dihentikan, dengan membaca: فَلْيَعْبُدُوا رَبَّ هَذَا الْبَيْتِ \" Maka hendaklah mereka menyembah Tuhan Pemilik rumah ini (Kakbah).\" Kemudian anda membaca: الَّذِي أَطْعَمَهُمْ \"Yang memberi makan mereka\" Karena kalau anda menyambung bacaannya dengan membaca: رَبَّ هَذَا الْبَيْتِ (3) الَّذِي أَطْعَمَهُمْ Maka pendengar akan mengira bahwa kata الذي [Alladzi: Yang] adalah sifat untuk al-bait (ka'bah) ini jauh dari makna sebenarnya, dan maknanya tidak lurus. الَّذِي أَطْعَمَهُمْ مِنْ جُوعٍ وَآمَنَهُمْ مِنْ خَوْفٍ \" Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan.\" Allah menjelaskan nikmat dari-Nya untuk mereka. Baik nikmat yang terlihat mau pun yang tersembunyi. Pemberian makanan kepada mereka saat lapar dan terlindungi dari kebinasaan terdapat pada perkara yang tersembunyi, itulah makanan yang mereka makan, وَآمَنَهُمْ مِنْ خَوْفٍ \" mengamankan mereka dari ketakutan.\" Perlindungan dari ketakutan dalam perkara yang terlihat, karena ketakutan adalah jelas, jika negeri dikepung oleh musuh, penduduknya ketakutan dan tidak mau keluar, dan mereka berdiam di tempat berlindung, maka Allah mengingatkan mereka dengan nikmat ini وَآمَنَهُمْ مِنْ خَوْفٍ \" mengamankan mereka dari ketakutan.\" Tempat teraman di bumi yaitu mekah, oleh karenanya pohonnya tidak boleh ditebang, tidak dibersihkan rerumputannya dan tidak dipungut barang temuannya, juga tidak boleh diburu binatang buruannya, tidak boleh darah tertumpah di dalamnya. Keistimewaan-keistimewaan ini tidak ada pada negeri-negeri lain. Sampai pun Madinah diharamkan (dihormati), memiliki keharaman, tetapi keharamannya lebih rendah dari mekkah jauh. Keharaman Mekkah tidak mungkin diperbuat oleh seorang dari kaum muslimin yang belum pernah mendatanginya walau sekali saja, melainkan tetap haram, sedangkan Madinah tidak demikian. Keharaman Mekkah, haram rerumputannya dan pohon-pohonnya secara mutlak, sedangkan keharaman Madinah, maka ada keringanan pada sebagian pohon untuk bercocok tanam dan sebagainya. Binatang buruan di Mekkah haram dan ada sangsinya (jika diburu) sedangkan buruan Madinah tidak ada sangsi dari buruannya. Tempat yang teragung yang paling aman adalah Mekkah, sampai pohon-pohon pun aman di dalamnya, binatang-binatang buruan pun aman di dalamnya, dan kalau bukan karena Allah memberikan kemudahan kepada hamba-hamba-Nya, maka binatang-binatang ternak pun yang bukan buruan diharamkan, tetapi Allah Ta'ala menyayangi hamba-hamba dan mengizinkan mereka menyembelih dan menaher di tempat tersebut. Allah telah mengingatkan tempat tersebut dalam firman-Nya: أَوَلَمْ يَرَوْا أَنَّا جَعَلْنَا حَرَمًا آمِنًا وَيُتَخَطَّفُ النَّاسُ مِنْ حَوْلِهِمْ \" Dan apakah mereka tidak memperhatikan, bahwa sesungguhnya Kami telah menjadikan (negeri mereka) tanah suci yang aman, sedang manusia sekitarnya rampok-merampok.\"(QS. Al-'Ankabut: 67) Maksudnya: Apakah mereka tidak bersyukur kepada Allah atas nikmat ini?! Surat ini, seluruhnya adalah peringatan buat Quraisy terhadapa apa yang telah Allah karuniakan berupa kenikmatan di rumah yang agung ini (ka'bah), keamanan dari ketakutan dan perolehan makanan yang membebaskan dari kelaparan. Jika ada yang mengatakan: Apa kewajiban orang quraisy terhadap kenikmatan ini? Dan juga apa kewajiban orang-orang yang tinggal di Mekkah saat ini baik orang Quraisy atau pun yang lainnya? Kita katakan: Kewajiban mereka adalah bersyukur kepada Allah Ta'ala dengan melakukan ketaatan kepada-Nya dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya. Oleh karenanya jika kemaksiatan semakin banyak di negeri haram, maka akan membahayakan penduduknya lebih berbahaya dari pada orang selain mereka, karena kemaksiatan di tempat yang memiliki keutamaan lebih akan lebih besar (dosanya) dari tempat yang tidak afdhal, oleh karenanya Allah Ta'ala berfirman وَمَنْ يُرِدْ فِيهِ بِإِلْحَادٍ بِظُلْمٍ نُذِقْهُ مِنْ عَذَابٍ أَلِيمٍ \" dan siapa yang bermaksud di dalamnya melakukan kejahatan secara lalim, niscaya akan Kami rasakan kepadanya sebahagian siksa yang pedih.\"(QS. Al-Hajj: 25) Allah Ta'ala mengancam siapa saja yang ada didalamnya, maknanya: siapa saja yang ingin melakukan kejahatan apa lagi yang telah melakukan kejahatan. Wajib atas setiap orang untuk mengingat kenikmatan dari Allah kepadanya di setiap tempat, tidak hanya di Mekkah saja. Negeri kita (Arab Saudi) wa lillaahil hamdu, saat ini adalah negeri yang paling aman di seluruh dunia, negeri kita adala yang paling deras kenikmatan dan kehidupannya, Allah Ta'ala telah memberikan makanan kepada kita sehingga terhindar dari kelaparan, dan memberikan keamanan dari ketakutan. Maka hendaknya kita bersyukur atas kenikmatan ini, dan saling menolong di atas kabaikan dan ketakwaan dan memerintah dalam kebaikan dan melarang dari kemungkaran, juga berdakwah kepada Allah di atas ilmu, kesantunan dan keteguhan, dan hendaknya menjalin persaudaraan yang erat. Dan wajib bagi kita, terlebih bagi penuntut ilmu, jika terjadi perselisihan di antara mereka, mereka duduk bersama untuk bermusyawarah dan berdiskusi dengan tenang yang bertujuan mencapai kebenaran, dan jika sudah jelas kebenaran bagi seorang insan, wajib baginya mengikutinya, tidak boleh membela pendapatnya, karena dia bukanlah pembuat syari'at yang terbebas dari kekeliruan, sampai mengatakan, bahwa pendapatnyalah yang benar, dan selannya adalah keliru. Wajib bagi seorang insan yang beriman, menjadi seseorang yang keadaanya sesuai yang Allah inginkan darinya وَمَا كَانَ لِمُؤْمِنٍ وَلَا مُؤْمِنَةٍ إِذَا قَضَى اللَّهُ وَرَسُولُهُ أَمْرًا أَنْ يَكُونَ لَهُمُ الْخِيَرَةُ مِنْ أَمْرِهِمْ وَمَنْ يَعْصِ اللَّهَ وَرَسُولَهُ فَقَدْ ضَلَّ ضَلَالًا مُبِينًا \"Dan tidaklah patut bagi laki-laki yang mukmin dan tidak (pula) bagi perempuan yang mukmin, apabila Allah dan Rasul-Nya telah menetapkan suatu ketetapan, akan ada bagi mereka pilihan (yang lain) tentang urusan mereka. Dan barang siapa mendurhakai Allah dan Rasul-Nya maka sungguhlah dia telah sesat, sesat yang nyata.\"(QS. Al-Ahzab: 36) Ada pun jika seorang insan membela pendapatnya dan tetap bersikeras atas pendapatnya, meskipun telah jelas baginya bahwa pendapatnya itu batil, maka ini adalah kesalahan, ini adalah di antara jalannya orang-orang musyrik yang enggan mengikuti Rasul shallallaahu 'alaihi wa sallam, dan mereka mengatkan: إِنَّا وَجَدْنَا آبَاءَنَا عَلَى أُمَّةٍ وَإِنَّا عَلَى آثَارِهِمْ مُهْتَدُونَ \"Sesungguhnya kami mendapati bapak-bapak kami menganut suatu agama, dan sesungguhnya kami orang-orang yang mendapat petunjuk dengan (mengikuti) jejak mereka.\"(QS. Az-Zukhruf: 22) Kita meminta kepada Allah agar menetapkan atas kita kenikmatan islam, keamanan dalam negeri dan menjadikan kita sebagai saudara yang erat di atas kitaabullah dan sunnah Rasulullah shallallaahu 'alaihi wasallam , sesungguhnya Dia Maha kuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Quraisy ayat 4: 3-4. Dengan sebab kedudukan ini yang Allah peruntukkan bagi Quraisy memiliki kedudukan di hati orang-orang Arab; Maka sudah semestinya bagi mereka (wajib) mentauhidkan Allah pemilik rumah ini (Ka’bah) dan mengikhlaskan ibadah kepada-Nya. Ialah Allah yang memberi makan mereka dengan sebab (kemudahan) rihlah mereka, dari lapar yang sangat sebelum rihlah, dan ketakutan yang sangat; Karena sebelumnya bangsa arab saling menyandera satu sama lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia melapangkan rezeki untuk mereka dan mengamankan mereka dari ketakutan, dimana keduanya merupakan nikmat dunia yang besar, maka segala puji bagi Allah atas nikmat-nikmat yang banyak itu, baik yang tampak maupun yang tersembunyi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Quraisy Ayat 4",
    "description": "Hendaklah mereka menyembah tuhan yang telah memberi makanan kepada mereka untuk menghilangkan lapar, memenuhi kebutuhan dasar mereka, dan mengamankan mereka dari rasa ketakutan. Terpenuhinya kebutuhan akan makanan dan rasa aman merupakan dua prasyarat penting yang menjamin kesejahteraan suatu masyarakat. 1. Tahukah kamu, wahai rasul, orang yang mendustakan agama dan mengingkari hisab serta hari pembalasan di akhirat nanti'."
  }
]