[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10. Bersabarlah atas apa yang dikatakan oleh orang-orang musyrik terhadapmu dan terhadap agamamu, serta selisihilah perbuatan mereka yang batil dengan berpaling dari mereka dan tidak membalas perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Dan bersabarlah terhadap ucapan para pendusta yang berisi olok-olokan dan cercaan, dan tinggalkanlah mereka dengan cara yang tidak menyakitinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Dan bersabarlah dalam menghadapi gangguan dari kaummu, janganlah kamu membalas keburukan dengan keburukan pula, namun berpalinglah dari mereka dan jangan membalas gangguan mereka, tanggunglah semua itu demi berjuang di jalan Allah dan jalan dakwah kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَاصْبِرْ عَلَىٰ مَا يَقُولُونَ (Dan bersabarlah terhadap apa yang mereka ucapkan) Yang berupa hinaan, ejekan, dan pendustaan. Dan janganlah kamu resah terhadap hal itu. وَاهْجُرْهُمْ هَجْرًا جَمِيلًا (dan jauhilah mereka dengan cara yang baik) Yakni janganlah kau hiraukan mereka serta jangan kau fikirkan sikap mereka kepadamu. Terdapat pendapat mengatakan: yakni dengan mengacuhkan mereka tanpa merasa cemas. Perintah ini berlaku sebelum diturunkannya ayat yang memerintahkan untuk memerangi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Bersabarlah engkau wahai Nabi, atas apa yang dikatakan oleh orang-orang kafir Makkah, baik itu cemoohan dan olok-olok mereka. Janganlah berpaling dari mereka, dan pergilah dengan cara yang baik tanpa ada rasa putus asa terhadap perlakuan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan bersabarlah terhadap apa yang mereka katakan dan tinggalkanlah mereka dengan cara yang baik} tidak disakiti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Pada saat Allah memerintah Rasulullah untuk shalat secara khusus dan berdzikir secara umum di mana hal tersebut akan memberikan kemampuan kuat bagi seorang hamba untuk memikul beban dan pekerjaan berat, Allah memerintahkan Rasulullah untuk bersabar atas perkataan yang duicapkan oleh para penentang dan mereka yang mencelanya dan mencela risalah yang beliau bawa serta diperintahkan untuk terus menjalankan perintah Allah yang tidak dapat ditahan dan dihadang oleh siapa pun. Allah memerintahkan beliau untuk meninggalkan mereka secara baik-baik. Itulah cara menjauhi orang sekiranya ada maslahatnya dan tidak ada gangguannya. Rasulullah bahkan memperlakukan mereka dengan meninggalkan dan berpaling dari perkataan-perkataan yang menyakiti. Allah juga memerintahkan beliau untuk mendebat mereka dengan cara yang baik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 10: Allah memerintahkan Nabi-Nya untuk bersabar atas apa yang dikatakan oleh mereka orang-orang kafir dari celaan dan dari apa yang Nabi-Nya datangkan kepada mereka. Dan segala urusannya di serahkan kepada mereka (orang-orang kafir) dan (berusaha) menjauhi mereka setelah sampai dakwah kepada mereka dan kemudian mereka menolaknya. Dan sesungguhnya Allah memerintah Nabi-Nya untuk menyelesaikan urusannya dengan keputusan yang baik dan indah, agar supaya Nabi tidak menyinggunya dan tersibukkan dengan mereka dan dendam kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala memerintahkan shalat secara khusus kepada Nabi-Nya shallallahu 'alaihi wa sallam dan berdzikr secara umum sehingga seorang hamba memiliki kemampuan untuk memikul beban dan mengerjakan pekerjaan yang berat, maka Allah Subhaanahu wa Ta'aala memerintahkan Beliau bersabar terhadap apa yang diucapkan oleh orang-orang yang menentang Beliau, mencaci-maki Beliau dan mencaci-maki apa yang Beliau bawa, dan agar Beliau tetap terus melaksanakan perintah Allah, tidak berhenti hanya karena ada yang menghalangi, dan agar Beliau menghajr (meninggalkan) mereka dengan cara yang baik yang sesuai maslahat yang tidak ada gangguan padanya. Maka Beliau shallallahu 'alaihi wa sallam meninggalkan mereka dan berpaling dari mereka dan dari ucapan mereka yang menyakitkan serta memerintahkan Beliau untuk berdebat dengan cara yang baik. Kaum kafir Mekkah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 10",
    "description": "Di samping berusaha sungguh-sungguh dan berserah diri kepada Allah, modal sukses dalam menyampaikan dakwah adalah sabar. Inilah yang ditegaskan dalam ayat ini. Dan bersabarlah wahai nabi Muhammad terhadap apa saja yang mereka katakan yang menyakitimu dan tinggalkanlah mereka dengan cara yang baik sehingga mereka tidak merasa bahwa engkau memusuhi mereka dan menaruh dendam terhadap mereka. 11-13. Setelah segala cara ditempuh untuk mengajak kaum musyrik beriman, ternyata mereka tetap musyrik, maka tidak perlu berkecil hati, karena Allah yang akan membalas mereka. Dan biarkanlah aku yang bertindak terhadap orang-orang yang mendustakan, yang memiliki segala kenikmatan hidup, dan berilah mereka penangguhan sebentar saja, karena sungguh, di sisi kami ada belenggu-belenggu yang berat yang akan mengikat mereka dan api neraka yang menyala-Nyala, dan mereka juga diberi makanan tetapi ada makanan yang apabila dimakan akan menyumbat di kerongkongan dan azab yang pedih."
  }
]