[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "11. Biarkanlah Aku (wahai Rasul) dengan orang-orang yang mendustakan ayat-ayatKu yang bergelimang kenikmatan dan kemewahan hidup di dunia, berilah mereka penangguhan untuk beberapa saat dengan menunda azab atas mereka hingga ajal ketetapan azab atas mereka datang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Janganlah engkau pedulikan urusan para pendusta yang hanya menikmati kenikmatan dunia, biarkanlah Aku berbuat terhadap mereka, dan tunggulah sebentar hingga ajal mereka datang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Dan berpalinglah dari orang-orang yang mendustakan dan menyakitimu, janganlah kamu membalas mereka dengan perbuatan yang serupa; serahkanlah mereka kepada-Ku, Aku yang akan membalas mereka dengan balasan yang setimpal. Kebanyakan dari orang-orang yang mendustakanmu itu hidup dalam kemewahan dan kenikmatan, namun semua itu akan berakhir dengan kematian mereka yang akan segera datang, atau berakhir dengan kemenangan Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَذَرْنِى وَالْمُكَذِّبِينَ (Dan biarkanlah Aku (saja) bertindak terhadap orang-orang yang mendustakan itu) Yakni serahkan mereka kepada-Ku, dan jangan lagi kamu pedulikan mereka, sebab cukuplah Aku yang mengurus mereka dan membelas perbuatan mereka untukmu. أُو۟لِى النَّعْمَةِ (orang-orang yang mempunyai kemewahan) Yakni orang-orang yang berada dalam kekayaan, kelapangan, kemewahan, dan kenikmatan dunia. وَمَهِّلْهُمْ قَلِيلًا (dan beri tangguhlah mereka barang sebentar) Sampai datang ajal mereka. Pendapat lain mengatakan: yakni sampai turunnya azab bagi mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Biarkan Aku (Allah) yang bertindak dan biarkan orang-orang yang berdusta itu dengan risalahmu. Aku berkuasa untuk menghukum mereka, Aku akan mencukupkan urusanmu atas mereka. Mereka telah memiliki dan menikmati harta dan anak mereka. Tunggu saja sebentar, biarkanlah mereka, dengan lembut dan tanpa memberi hukuman. Ayat ini diturunkan untuk orang-orang sombong Quraisy dan pengolok-olok dari para pembesar Makkah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Biarkanlah Aku, terhadap para pendusta yang memiliki segala kenikmatan hidup} orang yang memiliki kenikmatan dan hiburan di dunia {dan tangguhkanlah mereka sementara} sebentar saja sampai selesai ajal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Dan biarkanlah Aku (saja) bertindak terhadap orang-orang yang mendustakan itu,” yakni, tinggalkan antara Aku dengan mereka. Aku akan membalas mereka, meski Aku memberi mereka waktu, bukan berarti Aku melalaikan mereka. Allah berfirman, “Orang-orang yang mempunyai kemewahan,” yakni para pemilik kenikmatan dan kekayaan yang bertindak melampaui batas pada saat Allah memperluas rizki mereka dan melapangkan mereka berkat karuniaNya seperti disebutkan dalam firmanNya, “Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas, karena dia melihat dirinya serba cukup.” -Al-Alaq: 6-7-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 11: 11-14. Allah berkata dengan mengancam : Tinggalkan wahai Nabi Allah atas mereka orang-orang yang mendustakan ayat-Ku, yaitu mereka yang mengingkari agama Allah, orang-orang berharta, kaya dan penuh kemewahan; Biarkan mereka di atas kebathilannya dalaam waktu yang sebentar; Mereka akan diadzab dan dihisab di sisi Ku. Dan agar mereka (para pendusta) paham, bahwasanya mereka di sisi Kami pada hari kiamat di ikat dengan beban yang di letakkan di kedua kaki mereka sebagai penghinaan bagi mereka. Dan di sisi kami ada neraka yang keras yang apinya menyala-nyala yang mereka akan dilemparkan ke dalamnya. Dan di sisi kami juga ada makanan yang tidak mengenyangkan dan menyenangkan; Bahkan akan menyangkut (ketika dimakan) di tenggorkan karena sebab kejelekannya dan keburukannya. Seperti zaqum dan makanan berduri, dan di sisi kami pula terdapat adzab yang pedih dan menyakitkan. Adzab ini akan diberikan pada hari kiamat bagi orang-orang kafir dan para pengingkar dakwah. Hari dimana gunung, bumi bergoncang dan gempa serta bergerak. Dan gunung menjadi tumpukan pasir yang berterbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti para tokoh mereka (kaum kafir Mekkah). Mereka bersikap melampaui batas ketika Allah Subhaanahu wa Ta'aala meluaskan rezeki-Nya dan melimpahkan karunia-Nya, seperti yang difirmankan Allah Subhaanahu wa Ta'aala, “Ketahuilah! Sesungguhnya manusia benar-benar melampaui batas,-- Karena dia melihat dirinya serba cukup.” (Terj. Al ‘Alaq: 6-7) Oleh karena itu, tidak lama kemudian para tokoh mereka terbunuh di perang Badar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 11",
    "description": "11-13. Setelah segala cara ditempuh untuk mengajak kaum musyrik beriman, ternyata mereka tetap musyrik, maka tidak perlu berkecil hati, karena Allah yang akan membalas mereka. Dan biarkanlah aku yang bertindak terhadap orang-orang yang mendustakan, yang memiliki segala kenikmatan hidup, dan berilah mereka penangguhan sebentar saja, karena sungguh, di sisi kami ada belenggu-belenggu yang berat yang akan mengikat mereka dan api neraka yang menyala-Nyala, dan mereka juga diberi makanan tetapi ada makanan yang apabila dimakan akan menyumbat di kerongkongan dan azab yang pedih"
  }
]