[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Sesungguhnya Kami telah menyediakan bagi mereka di akhirat belenggu-belenggu yang berat, api neraka yang menyala-nyala yang membakar mereka, makanan yang sangat pahit yang tertahan pada kerongkongan dan sulit tertelan, dan azab yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Dan makanan yang menjadikan kerongkongan tersedak karena sangat pahit, dan Kami mempunyai siksa yang menyakitkan sebagai tambahan atas yang telah lalu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَطَعَامًا ذَا غُصَّةٍ (Dan makanan yang menyumbat di kerongkongan dan azab yang pedih) Yakni makanan yang menyangkut di kerongkongan yang tidak dapat dihilangkan atau dikeluarkan darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Juga makanan-makanan yang menyumbat kerongkongan dan menyiksa mereka dengan siksaan amat pedih pada hari kiamat. Siksa yang akan diturunkan kepada mereka yang tetap pada kekafiran mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Neraka yang menyala {makanan yang menyumbat kerongkongan} menyumbat kerongkongan {dan azab yang pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-13. Maksudnya, sesungguhnya di sisi Kami terdapat “belenggu-belenggu yang berat,” siksa yang berat yang Kami jadikan siksaan bagi orang yang terus menerus berada di atas apa yang membuat murka Allah, “dan neraka yang menyala-nyala,” yaitu api yang berkobar, “dan makanan yang menyumbat di kerongkongan,” karena pahit, buruk, amat tidak enak, dan berbau busuk, “dan azab yang pedih,” yang menyakitkan dan mengerikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 13: 11-14. Allah berkata dengan mengancam : Tinggalkan wahai Nabi Allah atas mereka orang-orang yang mendustakan ayat-Ku, yaitu mereka yang mengingkari agama Allah, orang-orang berharta, kaya dan penuh kemewahan; Biarkan mereka di atas kebathilannya dalaam waktu yang sebentar; Mereka akan diadzab dan dihisab di sisi Ku. Dan agar mereka (para pendusta) paham, bahwasanya mereka di sisi Kami pada hari kiamat di ikat dengan beban yang di letakkan di kedua kaki mereka sebagai penghinaan bagi mereka. Dan di sisi kami ada neraka yang keras yang apinya menyala-nyala yang mereka akan dilemparkan ke dalamnya. Dan di sisi kami juga ada makanan yang tidak mengenyangkan dan menyenangkan; Bahkan akan menyangkut (ketika dimakan) di tenggorkan karena sebab kejelekannya dan keburukannya. Seperti zaqum dan makanan berduri, dan di sisi kami pula terdapat adzab yang pedih dan menyakitkan. Adzab ini akan diberikan pada hari kiamat bagi orang-orang kafir dan para pengingkar dakwah. Hari dimana gunung, bumi bergoncang dan gempa serta bergerak. Dan gunung menjadi tumpukan pasir yang berterbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak keluar dari mulut dan tidak turun ke perut. Entah makanan itu zaqqum, dhari’ (pohon yang berduri), ghisliin (campuran darah dan nanah), atau duri dari neraka. Hal itu, karena pahitnya makanan itu, atau baunya yang tidak sedap dan menyakitkannya makanan tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 13",
    "description": "11-13. Setelah segala cara ditempuh untuk mengajak kaum musyrik beriman, ternyata mereka tetap musyrik, maka tidak perlu berkecil hati, karena Allah yang akan membalas mereka. Dan biarkanlah aku yang bertindak terhadap orang-orang yang mendustakan, yang memiliki segala kenikmatan hidup, dan berilah mereka penangguhan sebentar saja, karena sungguh, di sisi kami ada belenggu-belenggu yang berat yang akan mengikat mereka dan api neraka yang menyala-Nyala, dan mereka juga diberi makanan tetapi ada makanan yang apabila dimakan akan menyumbat di kerongkongan dan azab yang pedih. 14. Ingatlah siksa yang diancamkan itu pasti akan terjadi yaitu pada hari ketika bumi dan gunung-gunung berguncang keras ketika itu bumi menjadi datar, dan menjadilah gunung-gunung itu seperti onggokan pasir yang dicurahkan yang tampak ringan, padahal sebelumnya adalah sesuatu yang berat lagi kokoh."
  }
]