[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14. Pada hari bumi dan gunung-gunung bergetar dan berguncang hingga gunung-gunung hancur menjadi tumpukan pasir yang beterbangan padahal sebelumnya keras dan kuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Siksa itu menimpa orang-orang yang mendustakan pada hari di mana bumi dan gunung bergoncang. Saat itu gunung-gunung menjadi butiran pasir yang mengalir beterbangan dikarenakan dahsyatnya hari itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Azab ini akan datang kepada mereka di hari ketika bumi diguncangkan dan gunung-gunung saling dihantamkan sehingga berubah menjadi pasir yang berhamburan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. يَوْمَ تَرْجُفُ الْأَرْضُ وَالْجِبَالُ (Pada hari bumi dan gunung-gunung bergoncangan) Yakni bergoncang bersama orang-orang yang ada di atasnya. Dan makna (الرجفة) yakni gempa bumi yang dahsyat. وَكَانَتِ الْجِبَالُ كَثِيبًا مَّهِيلًا(dan menjadilah gunung-gunung itu tumpukan-tumpukan pasir yang berterbangan) Yakni menjadi pasir yang mengalir akibat goncangan yang dahsyat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Hari dimana bumi dan gunung-gunung diguncangkan ketika terdengar tiupan sangkakala pertama. Kemudian gunung-gunung menjadi kumpulan pasir yang membuat kaki-kaki masuk ke dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Pada hari (ketika) bumi dan gunung-gunung berguncang keras} berguncang {dan gunung-gunung itu menjadi seperti pasir} pasir {yang tercurah} jatuh berserakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Hal itu akan terjadi “pada hari bumi dan gunung-gunung bergoncangan,” karena huru-hara dahsyat, “dan menjadilah gunung-gunung itu tumpukan pasir yang beterbangan,” yakni seperti pasir berhamburan kemudian terhempas setelah itu sehingga menjadi seperti debu yang berserakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 14: 11-14. Allah berkata dengan mengancam : Tinggalkan wahai Nabi Allah atas mereka orang-orang yang mendustakan ayat-Ku, yaitu mereka yang mengingkari agama Allah, orang-orang berharta, kaya dan penuh kemewahan; Biarkan mereka di atas kebathilannya dalaam waktu yang sebentar; Mereka akan diadzab dan dihisab di sisi Ku. Dan agar mereka (para pendusta) paham, bahwasanya mereka di sisi Kami pada hari kiamat di ikat dengan beban yang di letakkan di kedua kaki mereka sebagai penghinaan bagi mereka. Dan di sisi kami ada neraka yang keras yang apinya menyala-nyala yang mereka akan dilemparkan ke dalamnya. Dan di sisi kami juga ada makanan yang tidak mengenyangkan dan menyenangkan; Bahkan akan menyangkut (ketika dimakan) di tenggorkan karena sebab kejelekannya dan keburukannya. Seperti zaqum dan makanan berduri, dan di sisi kami pula terdapat adzab yang pedih dan menyakitkan. Adzab ini akan diberikan pada hari kiamat bagi orang-orang kafir dan para pengingkar dakwah. Hari dimana gunung, bumi bergoncang dan gempa serta bergerak. Dan gunung menjadi tumpukan pasir yang berterbangan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang sebelumnya kokoh, kuat dan keras. Setelah itu dilumatkan menjadi debu yang berhamburan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 14",
    "description": "Ingatlah siksa yang diancamkan itu pasti akan terjadi yaitu pada hari ketika bumi dan gunung-gunung berguncang keras ketika itu bumi menjadi datar, dan menjadilah gunung-gunung itu seperti onggokan pasir yang dicurahkan yang tampak ringan, padahal sebelumnya adalah sesuatu yang berat lagi kokoh. 15-16. Setelah dijelaskan ancaman siksa akhirat yang akan diterima bagi para pendurhaka, ayat ini mengingatkan manusia tentang siksa dunia. Sesungguhnya kami telah mengutus seorang rasul, Muhammad kepada kamu, wahai penduduk mekah, bahkan juga seluruh manusia, yang menjadi saksi terhadapmu menyangkut sikap dan perbuatan kamu, sebagaimana kami telah mengutus seorang rasul yaitu musa, kepada fir'aun. Namun fir'aun mendurhakai rasul yang kami utus itu, maka kami siksa dia dengan siksaan yang berat. Maka jika kamu wahai penduduk mekah mendurhakai nabi Muhammad, kami dapat menyiksa kamu seperti yang dialami oleh fir'aun."
  }
]