[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Sesungguhnya Kami telah mengutus kepada kalian (wahai orang-orang Makkah) Muhammad sebagai rasul, dan saksi atas kalian dengan apa yang kalian lakukan, yaitu kekafiran dan kedurhakaan, sebagaimana Kami telah mengutus Musa sebagai rasul kepada Thagut Fir’aun, lalu Fir’aun mendustakan Musa, tidak beriman kepada risalahnya dan mendustakan dakwahnya, maka Kami membinasakannya dengan keras. Di sini terkandung peringatan dari berbuat maksiat kepada Rasulullah, Muhammad, karena dikhawatirkan orang yang maksiat akan ditimpa oleh apa yang telah menimpa Fir’aun dan kaumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Sesungguhnya Kami telah mengutus kepada kalian seorang Rasul sebagai saksi atas perbuatan kalian pada hari kiamat sebagaimana Kami juga telah mengutus kepada Fir'aun seorang utusan, yaitu Musa -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Sungguh Nabi Muhammad Kami utus kepada kalian agar dia memeberi peringatan dan mengajak kalian menuju kebenaran, serta sebagai saksi bagi orang yang beriman atas orang yang kafir. Hal ini bukanlah perkara baru, karena sebelumnya telah diutus para rasul kepada kaum mereka; sepeti Musa yang diutus kepada Fir’aun dan kaumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ رَسُولًا شٰهِدًا عَلَيْكُمْ (Sesungguhnya Kami telah mengutus kepada kamu (hai orang kafir Mekah) seorang Rasul, yang menjadi saksi terhadapmu) Yakni yang bersaksi atas kalian pada hari kiamat tentang amal perbuatan kalian. Yakni Kami telah mengutus rasul, namun kalian menyelisihinya. كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ رَسُولًا(sebagaimana Kami telah mengutus (dahulu) seorang Rasul kepada Fir’aun) Yakni Nabi Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Sesungguhnya Kami telah mengutus Rasul yang bernama Muhammad SAW kepada kalian wahai penduduk Makkah. Kelak dia akan bersaksi pada hari kiamat tentang kedurhakaan kalian. Sebagaimana Kami dulu telah mengutus Musa sebagai Rasul kepada Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah mengutus seorang rasul kepada kalian sebagai saksi atas kalian, sebagaimana Kami telah mengutus seorang rasul kepada Fir‘aun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. Allah berfirman, bahwa pujilah Rabb kalian atas diutusnya nabi ‘ummi berbangsa arab ini yang memberi kabar gembira dan peringatan serta sebagai saksi atas perbuatan umatnya. Janganlah kalian kufur dan mendurhakai Rasul kalian sehingga kalian seperti Fir’aun ketika Allah mengutus Musa bin Imran, Musa menyerunya kepada Allah dan memerintahkannya untuk bertauhid, tapi Fir’aun tidak membenarkannya, justru malah mendurhakainya, kemudian Allah menyiksanya “dengan siksaan yang berat,” yaitu berat dan dahsyat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 15: 15-16. Ketahuilah wahai orang-orang Mekkah, bahwasanya Allah mengutus Rasul kepada kalian yaitu Muhammad ﷺ, sebgai utusan yang memiliki urusan yang mulia dan ditinggikan derajatnya. Rasul tersebut akan menjadi saksi kalian pada hari kimat, dimaa ia telah menyampaikan kepada kalian risalah dari Allah dengan penyampaian yang sempurna. Sebagaimana Musa diutus sebagai Rasul untuk mendakwahkan kebenran kepada orang yang melampaui batas yaitu Fir’aun. Dan Fir’aun mendurhakai Musa, maka Allah ambil nyawanya dengan keras, yaitu dengan ditenggelamkan oleh Allah di dunia (di laut), dan di akhirat dia akan menerima dengan seberat-beratnya adzab. Pada dua ayat ini terdapat peringatan dan ancaman bagi orang-orang musyrik, jika mereka masih tetap dalam pengingkarannya dan kekafirannya maka sungguh Allah akan mengadzab mereka dengan adzab yang pedih dan tidak akan Allah kurangi adzab-Nya bagi Fir’aun dan bala tentaranya ketika ia mendurhakai Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini Allah Subhaanahu wa Ta'aala memerintahkan manusia untuk memuji-Nya dan bersyukur kepada-Nya karena Dia telah mengutus Nabi yang ummi sebagai pemberi kabar gembira dan peringatan, yang menjadi saksi terhadap ummat atas amal yang mereka kerjakan. Demikian pula memerintahkan mereka untuk tidak kafir kepada Beliau seperti yang dilakukan Fir’aun yang kafir kepada Nabi Musa ‘alaihis salam yang diutus-Nya kepadanya saat ia mengajak Fir’aun menyembah Allah, namun ia menolaknya dan mendurhakainya, maka Allah Subhaanahu wa Ta'aala menyiksanya dengan siksaan yang berat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 15",
    "description": "15-16. Setelah dijelaskan ancaman siksa akhirat yang akan diterima bagi para pendurhaka, ayat ini mengingatkan manusia tentang siksa dunia. Sesungguhnya kami telah mengutus seorang rasul, Muhammad kepada kamu, wahai penduduk mekah, bahkan juga seluruh manusia, yang menjadi saksi terhadapmu menyangkut sikap dan perbuatan kamu, sebagaimana kami telah mengutus seorang rasul yaitu musa, kepada fir'aun. Namun fir'aun mendurhakai rasul yang kami utus itu, maka kami siksa dia dengan siksaan yang berat. Maka jika kamu wahai penduduk mekah mendurhakai nabi Muhammad, kami dapat menyiksa kamu seperti yang dialami oleh fir'aun"
  }
]