[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "15-16. Sesungguhnya Kami telah mengutus kepada kalian (wahai orang-orang Makkah) Muhammad sebagai rasul, dan saksi atas kalian dengan apa yang kalian lakukan, yaitu kekafiran dan kedurhakaan, sebagaimana Kami telah mengutus Musa sebagai rasul kepada Thagut Fir’aun, lalu Fir’aun mendustakan Musa, tidak beriman kepada risalahnya dan mendustakan dakwahnya, maka Kami membinasakannya dengan keras. Di sini terkandung peringatan dari berbuat maksiat kepada Rasulullah, Muhammad, karena dikhawatirkan orang yang maksiat akan ditimpa oleh apa yang telah menimpa Fir’aun dan kaumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Lalu Fir'aun mendurhakai Rasul yang diutus kepadanya dari Rabbnya, maka Kami menyiksanya dengan siksaan yang dahsyat di dinia dengan ditenggelamkan, dan di Akhirat dengan siksa Neraka. Maka janganlah kalian mendurhakai Rasul kalian sehingga kalian akan ditimpa oleh azab yang menimpa Fir'aun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Akan tetapi Fir’aun tidak beriman kepada Musa dan kepada risalahnya, sehingga dia layak untuk dibinasakan. Dan kebinasaannya merupakan pelajaran besar, dia telah Allah tenggelamkan bersama para tentaranya di lautan, dan ini merupakan pelajaran bagi orang yang menerima ayat ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. فَعَصَىٰ فِرْعَوْنُ الرَّسُولَ (Maka Fir’aun mendurhakai Rasul itu) Dan dia mendustakannya dan tidak beriman kepada risalah yang didatangkannya. فَأَخَذْنٰهُ أَخْذًا وَبِيلًا(lalu Kami siksa dia dengan siksaan yang berat) Yakni azab yang sangat berat dan kejam. Yaitu Kami siksa Fir’aun dengan siksaan yang keras dengan menengggelamkannya ke dalam laut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Kemudia Fir’aun mendustakan kerasulan Musa dan tidak mengimaninya, sehingga kami timpakan kepadanya azab dan bencana yang dahsyat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Fir‘aun mendurhakai rasul itu sehingga Kami menyiksa dia dengan siksaan yang berat} keras"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-16. Allah berfirman, bahwa pujilah Rabb kalian atas diutusnya nabi ‘ummi berbangsa arab ini yang memberi kabar gembira dan peringatan serta sebagai saksi atas perbuatan umatnya. Janganlah kalian kufur dan mendurhakai Rasul kalian sehingga kalian seperti Fir’aun ketika Allah mengutus Musa bin Imran, Musa menyerunya kepada Allah dan memerintahkannya untuk bertauhid, tapi Fir’aun tidak membenarkannya, justru malah mendurhakainya, kemudian Allah menyiksanya “dengan siksaan yang berat,” yaitu berat dan dahsyat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 16: 15-16. Ketahuilah wahai orang-orang Mekkah, bahwasanya Allah mengutus Rasul kepada kalian yaitu Muhammad ﷺ, sebgai utusan yang memiliki urusan yang mulia dan ditinggikan derajatnya. Rasul tersebut akan menjadi saksi kalian pada hari kimat, dimaa ia telah menyampaikan kepada kalian risalah dari Allah dengan penyampaian yang sempurna. Sebagaimana Musa diutus sebagai Rasul untuk mendakwahkan kebenran kepada orang yang melampaui batas yaitu Fir’aun. Dan Fir’aun mendurhakai Musa, maka Allah ambil nyawanya dengan keras, yaitu dengan ditenggelamkan oleh Allah di dunia (di laut), dan di akhirat dia akan menerima dengan seberat-beratnya adzab. Pada dua ayat ini terdapat peringatan dan ancaman bagi orang-orang musyrik, jika mereka masih tetap dalam pengingkarannya dan kekafirannya maka sungguh Allah akan mengadzab mereka dengan adzab yang pedih dan tidak akan Allah kurangi adzab-Nya bagi Fir’aun dan bala tentaranya ketika ia mendurhakai Musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 16",
    "description": "15-16. Setelah dijelaskan ancaman siksa akhirat yang akan diterima bagi para pendurhaka, ayat ini mengingatkan manusia tentang siksa dunia. Sesungguhnya kami telah mengutus seorang rasul, Muhammad kepada kamu, wahai penduduk mekah, bahkan juga seluruh manusia, yang menjadi saksi terhadapmu menyangkut sikap dan perbuatan kamu, sebagaimana kami telah mengutus seorang rasul yaitu musa, kepada fir'aun. Namun fir'aun mendurhakai rasul yang kami utus itu, maka kami siksa dia dengan siksaan yang berat. Maka jika kamu wahai penduduk mekah mendurhakai nabi Muhammad, kami dapat menyiksa kamu seperti yang dialami oleh fir'aun. 17. Lalu ketentuan Allah yang akan menghukum siapa saja yang mendurhakai rasul-Nya tetap berlaku sepanjang masa, bagaimanakah kamu akan dapat menjaga dirimu dari jatuhnya siksa Allah jika kamu tetap kafir kepada hari yang sedemikian berat lagi dahsyat sehingga menjadikan anak-anak kecil saking takutnya berubah menjadi tua dan beruban."
  }
]