[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17. Bagaimana kalian akan dapat melindungi diri kalian bila kalian tetap kafir terhadap azab Hari Kiamat yang membuat anak-anak kecil beruban karena dahsyatnya kengerian dan kesulitannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Maka bagaimana kalian akan menolak dan menjaga diri kalian -jika kalian kafir terhadap Allah dan kalian mendustakan Rasul-Nya- dari hari yang dahsyat dan panjang yang menjadikan anak kecil berubah menjadi tua karena kedahsyatan dan panjangnya hari itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Hai manusia, berhati-hatilah dari azab Allah jika kalian tidak beriman; azab ini akan datang pada hari kiamat yang ketika itu anak-anak kecil akan beruban karena sangat ketakutan, segala perkara akan tersingkap, dan peristiwa-peristiwa mengerikan akan terjadi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. فَكَيْفَ تَتَّقُونَ (Maka bagaimanakah kamu akan dapat memelihara dirimu) Yakni bagaimana kalian akan melindungi diri kalian. إِن كَفَرْتُمْ(jika kamu tetap kafir) Yakni jika kalian tetap di atas kekafiran. يَوْمًا(pada suatu hari) Yakni dari azab pada suatu hari. يَجْعَلُ الْوِلْدٰنَ شِيبًا (yang menjadikan anak-anak beruban) Akibat kengeriannya yang dahsyat. Yakni anak kecil ketika itu menjadi putih rambutnya, ini sebagai isyatar tentang kengerian yang dahsyat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17-18. Lalu bagaimana kalian akan bisa menjaga diri, jika kamu tetap dalam keadaan kafir terhadap azab pada hari yang akan membuat anak-anak menjadi beruban karena dahsyatnya hiruk pikuk hari itu? Langit-pun terbelah oleh bencana hari itu. Adapun munfathirun sebagai khobar dari as-sama’ atau langit tertulis sebagai isim mudzakkar, hal ini disebabkan langit diibaratkat sebagai atap. Janji Allah pasti terjadi, dan tidak mungkin tidak terjadi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu bagaimana kalian akan dapat menjaga diri pada hari yang menjadikan anak-anak beruban jika kalian tetap ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Maksudnya, bagaimana kalian bisa selamat pada Hari KIamat, hari yang urusannya amat menakutkan dan besar bahayanya yang membuat anak-anak menjadi beruban dan melelehkan benda-benda padat yang besar, langit terpecah dan bintang-bintangnya bertebaran. “Adalah janjiNya itu pasti terlaksana,” pasti terjadi dan tidak ada yang bisa menghalanginya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 17: 17-18. Dan jika urusannya wahai orang-orang musyrik, sebagaimana telah kalian dengar yaitu dari keburukan adzab bagi orang-orang yang mendustakan dan mengingkari; Lalu bagaimana kalian akan melindungi diri-diri kalian dari adzab Allah pada hari kiamat jika kalian tetap kokoh atas kekufuruan dan kedurhakaan kalian. Itulah hari kiamat yang keras kondisinya, yang memutihkan rambut anak-anak kecil (karena saking dahsyatnya), dan membuat langit terbelah dimana langit awalnya kokoh. Dan hari kiamat mau tidak mau pasti terjadi, tidak ada keraguan dan kebimbangan atas hal tersebut; Semua itu adalah janji Allah, yang Allah tidak akan ingkar terhadap janji-Nya (yaitu mendatangkan kiamat)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu hari Kiamat, hari dimana segala sesuatu yang keras dan besar menjadi luluh, anak-anak beruban, langit yang kuat terbelah dan bintang-bintang berjatuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 17",
    "description": "Lalu ketentuan Allah yang akan menghukum siapa saja yang mendurhakai rasul-Nya tetap berlaku sepanjang masa, bagaimanakah kamu akan dapat menjaga dirimu dari jatuhnya siksa Allah jika kamu tetap kafir kepada hari yang sedemikian berat lagi dahsyat sehingga menjadikan anak-anak kecil saking takutnya berubah menjadi tua dan beruban. 18. Sedemikian dahsyatnya langit yang begitu kokoh menjadi terbelah dan berantakan pada hari itu. Janji Allah pasti terlaksana karena Allah tidak akan pernah mengingkari janji-Nya."
  }
]