[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "18. Pada hari itu langit terbelah karena parahnya kengerian saat itu. Janji Allah tentang kedatangan hari itu pasti terwujud, tidak bisa tidak."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Langit terpecah karena dahsyatnya hari itu, dan janji Allah pasti terlaksana, tidak ada keraguan sama sekali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Salah satu peristiwa mengerikan pada hari itu; langit akan terbelah, dan planet dan bintang-bintang akan berjatuhan. Sungguh itu adalah peristiwa menakutkan yang mengguncang jiwa. Hari itu sungguh pasti akan terjadi, karena Allah telah mengabarkannya dan menjanjikan kehadirannya; dan janji Allah tidak akan dipungkiri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. السَّمَآءُ مُنفَطِرٌۢ بِهِۦ ۚ (Langit(pun) menjadi pecah belah pada hari itu) Yakni langit terpecah belah karena kengerian yang dahsyat dan para malaikat yang turun. كَانَ وَعْدُهُۥ مَفْعُولًا (Adalah janji-Nya itu pasti terlaksana) Yakni pasti terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17-18. Lalu bagaimana kalian akan bisa menjaga diri, jika kamu tetap dalam keadaan kafir terhadap azab pada hari yang akan membuat anak-anak menjadi beruban karena dahsyatnya hiruk pikuk hari itu? Langit-pun terbelah oleh bencana hari itu. Adapun munfathirun sebagai khobar dari as-sama’ atau langit tertulis sebagai isim mudzakkar, hal ini disebabkan langit diibaratkat sebagai atap. Janji Allah pasti terjadi, dan tidak mungkin tidak terjadi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Langit terbelah pada hari itu} terbelah dengan keras pada hari itu {JanjiNya pasti terlaksana} pasti terjadi bukan mustahil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. Maksudnya, bagaimana kalian bisa selamat pada Hari KIamat, hari yang urusannya amat menakutkan dan besar bahayanya yang membuat anak-anak menjadi beruban dan melelehkan benda-benda padat yang besar, langit terpecah dan bintang-bintangnya bertebaran. “Adalah janjiNya itu pasti terlaksana,” pasti terjadi dan tidak ada yang bisa menghalanginya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 18: 17-18. Dan jika urusannya wahai orang-orang musyrik, sebagaimana telah kalian dengar yaitu dari keburukan adzab bagi orang-orang yang mendustakan dan mengingkari; Lalu bagaimana kalian akan melindungi diri-diri kalian dari adzab Allah pada hari kiamat jika kalian tetap kokoh atas kekufuruan dan kedurhakaan kalian. Itulah hari kiamat yang keras kondisinya, yang memutihkan rambut anak-anak kecil (karena saking dahsyatnya), dan membuat langit terbelah dimana langit awalnya kokoh. Dan hari kiamat mau tidak mau pasti terjadi, tidak ada keraguan dan kebimbangan atas hal tersebut; Semua itu adalah janji Allah, yang Allah tidak akan ingkar terhadap janji-Nya (yaitu mendatangkan kiamat)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 18",
    "description": "Sedemikian dahsyatnya langit yang begitu kokoh menjadi terbelah dan berantakan pada hari itu. Janji Allah pasti terlaksana karena Allah tidak akan pernah mengingkari janji-Nya. 19. Setelah ancaman disampaikan Al-Qur'an kembali menegaskan bahwa sungguh, ayat-ayat Al-Qur'an ini adalah peringatan sekaligus petunjuk. Barangsiapa menghendaki kebaikan, niscaya dia mengambil jalan yang lurus kepada tuhannya."
  }
]