[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "19. Sesungguhnya ayat-ayat yang menakutkan ini berisi ancaman dan peringatan keras, merupakan nasihat dan pelajaran bagi manusia. Barangsiapa hendak mengambil nasihat dan pelajaran, maka dia menjadikan ketakwaan dan ketaatan sebagai sarana yang membawanya kepada ridha Allah Tuhannya yang menciptakannya dan mengaturnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Sesungguhnya nasihat ini -yang berisi penjelasan tentang kedahsyatan dan huru-hara pada hari Kiamat- merupakan peringatan yang bermanfaat bagi orang-orang yang beriman. Barangsiapa ingin mengambil jalan yang mengantarkannya kepada Rabbnya maka hendaknya ia mengambil jalan ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Sungguh penyebutan dan ancaman tentang azab pada ayat-ayat tersebut merupakan pelajaran besar, seruan kepada keimanan dan ketaatan, serta peringatan dan ancaman bagi orang yang kafir dan ingkar; maka orang yang hendak memanfaatkan peringatan dan pelajaran ini, menempuh jalan keimanan dan petunjuk menuju kebenaran yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. إِنَّ هٰذِهِۦ (sungguhnya ini) Yakni ayat-ayat tersebut. تَذْكِرَةٌ ۖ( adalah suatu peringatan) Yakni pelajaran bagi orang-orang beriman. فَمَن شَآءَ اتَّخَذَ إِلَىٰ رَبِّهِۦ سَبِيلًا (Maka barangsiapa yang menghendaki niscaya ia menempuh jalan (yang menyampaikannya) kepada Tuhannya) Yakni jadikanlah ketaatan dan pengesaan kepada Allah serta seluruh amal shalih sebagai jalan yang menuntun pada keridhaan Allah di surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Sesungguhnya ayat-ayat yang berisi tentang hal-hal yang menakutkan adalah sebagai peringatan dan nasehat. Maka barang siapa yang mau mengambil pelajaran dan manfaat dari ayat-ayat tersebut maka dia akan memilih jalan menuju Tuhannya dengan mengimaninya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya ini adalah peringatan. Siapa saja yang berkehendak niscaya mengambil jalan kepada Tuhannya} jalan yang mencapai keridhaanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Maksudnya, sesungguhnya nasihat yang diberitahukan Allah tentang keadaan-keadaan Hari Kiamat serta huru-haranya ini adalah sebagai peringatan yang mengingatkan orang-orang bertakwa serta sebagai peringatan bagi orang-orang yang beriman, “maka barangsiapa yang menghendaki, niscaya ia menempuh jalan (yang menyampaikannya) kepada Rabbnya,” yakni, sebagai jalan yang menghubungkan padaNya dengan cara mengikuti syariatNya, karena Allah telah menjelaskan syariatNya secara jelas. Dalam hal ini terdapat dalil bahwa Allah telah membuat manusia mampu melakukan perbuatan-perbuatan mereka, tidak seperti yang dikatakan oleh Jabriyah yang menyatakan bahwa perbuatan manusia berlaku di luar kehendak mereka. Hal ini bertentangan dengan dalil naqli dan dalil aqli."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 19: Ketahuilah wahai manusia, bahwasanya kabar ini dan nasihat-nasihat yang telah lalu disebutkan adalah sebagai peringatan dan nasihat bagi orang-orang yang berakal.; Maka barangsiapa yang menginginkan menjadi orang-orang lalai, lupa kemudian ingin menerima nasihat dan Berjaya, maka ambilah jalan yang diridhai oleh Tuhannya, yaitu dengan mentauhidkan-Nya dan ikhlas ibadah kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni peristiwa yang terjadi pada hari Kiamat. Orang-orang yang beriman akan sadar dan mempersiapkan diri untuk menghadapinya. Yaitu dengan iman dan amal saleh atau mengikuti syariat-Nya, karena Allah telah menerangkan sejelas-jelasnya jalan yang dapat menuju Allah dan negeri akhirat (surga). Dalam ayat ini terdapat dalil bahwa Allah Subhaanahu wa Ta'aala memberikan kemampuan pada hamba untuk melakukan perbuatan mereka tidak sebagaimana yang dikatakan kaum Jabariyyah yang mengatakan bahwa perbuatan yang dilakukan hamba terjadi bukanlah dengan kehendak mereka. Hal ini jelas bertentangan dengan dalil dan akal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 19",
    "description": "Setelah ancaman disampaikan Al-Qur'an kembali menegaskan bahwa sungguh, ayat-ayat Al-Qur'an ini adalah peringatan sekaligus petunjuk. Barangsiapa menghendaki kebaikan, niscaya dia mengambil jalan yang lurus kepada tuhannya. 20. Jalan lurus menuju tuhan mungkin dirasakan berat bagi sementara orang, maka ayat ini memberi petunjuk solusinya. Sesungguhnya tuhanmu senantiasa mengetahui bahwa engkau, wahai nabi Muhammad, terkadang berdiri untuk mengerjakan salat kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan demikian pula segolongan dari orang-orang yang bersamamu yaitu para sahabat yang mengikutimu. Allah menetapkan ukuran malam dan siang. Allah mengetahui bahwa kamu tidak dapat menentukan batas-batas waktu itu secara pasti dan rinci dalam melaksanakan salat, maka dia memberi keringanan kepadamu menyangkut apa yang telah ditetapkan-Nya sebelum ini, karena itu bacalah apa yang mudah bagimu dari Al-Qur'an. Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit sehingga akan sulit melaksanakan salat malam seperti yang diperintahkan, dan ada juga yang berjalan di bumi yaitu bepergian jauh untuk mencari sebagian karunia Allah baik urusan perniagaan atau menuntut ilmu. Dan Allah mengetahui juga akan ada yang lain berperang di jalan Allah, maka bacalah apa yang mudah bagimu dari Al-Qur'an dan laksanakanlah salat secara baik dan berkesinambungan, tunaikanlah zakat secara sempurna dan berikanlah pinjaman kepada Allah pinjaman yang baik yaitu segala pemberian di jalan Allah di luar kewajiban zakat. Kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh balasan-Nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Dan di samping amalan tersebut maka mohonlah ampunan kepada Allah. Sungguh, Allah maha pengampun, maha penyayang."
  }
]