[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20. Sesungguhnya Tuhanmu (wahai Nabi) mengetahui bahwa kamu shalat tahajjud di malam hari, terkadang kurang dari dua pertiga malam, terkadang setengah malam, terkadang sepertiga malam. Sebagian sahabatmu juga shalat malam bersamamu. Hanya Allah semata yang menetapkan ukuran malam dan siang, dan Dia mengetahui kadar keduanya, apa yang telah berlalu dari keduanya dan apa yang tersisa. Allah tahu bahwa kalian tidak mungkin shalat sepanjang malam, maka Allah meringankan atas kalian, maka bacalah dalam shalat malam ayat al-Quran yang mudah bagi kalian untuk membacanya. Allah tahu ada orang-orang yang terhalang oleh sakitnya sehingga tidak bisa shalat malam. Ada juga orang-orang yang bergerak di muka bumi untuk berniaga dan bekerja mencari rizki Allah yang halal. Ada juga orang-orang yang berjihad di jalan Allah untuk meninggikan kalimat Allah dan menyebarkan agamaNya. Bacalah ayat al-Quran yang mudah bagi kalian untuk membacanya, jagalah kewajiban shalat, tunaikanlah zakat yang wajib atas kalian, dan bersedekahlah pada jalan-jalan kebaikan dari harta kalian dalam rangka mencari WajahNya. Apa yang kalian lakukan berupa kebaikan-kebaikan dan ketaatan-ketaatan, kalian pasti akan mendapatkan balasannya di sisi Allah pada Hari Kiamat lebih baik dari apa yang kalian lakukan, dan lebih besar balasannya. Carilah ampunan Allah dalam segala keadaan kalian, sesungguhnya Allah Maha Pengampun dan Maha Penyayang terhadap kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Sesungguhnya Rabbmu -wahai Rasul- mengetahui bahwa kamu kadang-kadang mengerjakan salat kurang dari dua pertiga malam, kadang-kadang salat setengah malam dan kadang-kadang sepertiga malam, dan demikian pula segolongan orang-orang beriman yang bersamamu mengerjakan salat malam. Allah menetapkan ukuran malam dan siang serta menghitung waktu-waktunya. Allah -Subḥānahu- mengetahui bahwa kalian tidak bisa mengitung dan memastikan batas waktunya, lalu kalian merasa berat untuk mendirikan salat pada sebagian besar waktunya demi mencapai apa yang diminta, karena itulah Allah mengampuni kalian. Maka salatlah pada malam hari yang mudah bagi kalian. Allah mengetahui bahwa di antara kalian -wahai orang-orang yang beriman- ada yang akan sakit, mendapat kesulitan karena penyakitnya, dan yang lain bepergian untuk mencari rezeki dari Allah, serta yang lain lagi pergi untuk memerangi orang-orang kafir demi mencari keridaan Allah dan agar menjadikan kalimat Allah sebagai yang tertinggi. Mereka ini merasa kesulitan untuk mengerjakan salat malam, maka salatlah pada malam hari yang mudah bagi kalian. Kerjakanlah salat wajib dengan sempurna, keluarkan zakat harta kalian, sedekahkan sebagian harta kalian di jalan Allah. Dan setiap kebaikan yang kalian kerjakan untuk diri kalian niscaya kalian akan mendapatinya lebih baik dan pahalanya lebih besar. Dan mintalah ampunan kepada Allah, sesungguhnya Allah Maha Pengampun bagi hamba-Nya yang meminta ampunan dan Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Allah menyampaikan ilmu-Nya tentang Rasulullah dan para sahabatnya yang mentaati perintah untuk mendirikan shalat malam yang disebutkan pada awal surat ini. Mereka benar-benar mendirikan shalat selama dua pertiga, setengah, atau sepertiga waktu malam; Allah Maha Mengetahui segala yang terjadi di alam semesta. Karena kewajiban mendirikan shalat malam secara terus menerus merupakan perintah yang berat, maka pada ayat ini disebutkan keringanan hukumnya menjadi tidak wajib -sunnah- atas seluruh kaum muslimin. Dan dalam ayat ini dijelaskan sebab-sebab hadirnya keringanan ini; Allah mengetahui kewajiban mendirikan shalat malam adalah hal yang berat untuk dilaksanakan; dan Allah mengetahui akan ada berbagai hal yang menghalangi pelaksaannya seperti sakit, bepergian, dan berjihad; hal-hal ini akan memberatkan jiwa untuk melaksanakannya. Keringanan hukum ini merupakan rahmat dari Allah bagi hamba-hamba-Nya dengan memperhatikan keadaan-keadaan mereka. Setelah itu Allah mendorong orang-orang beriman agar melakukan berbagai ketaatan untuk mendekatkan diri kepada-Nya; dengan mendirikan shalat secara sempurna, mengeluarkan zakat kepada orang yang berhak mendapatkannya, memperbanyak sedekah, dan berbagai perbuatan baik lainnya. Dan semua orang beriman yang mengerjakan ketaatan dan amal shalih akan mendapatkan balasan yang lebih baik dan pahala yang berlipat-ganda dari Allah Yang Maha Pemurah. Dan bagian dari rahmat Allah kepada hamba-hamba-Nya, Dia mendorong mereka untuk beristighfar, yaitu memohon ampun kepada-Nya; tidak ada seorangpun yang tidak membutuhkan istighfar. Dan Allah Maha Luas ampunan-Nya dan Maha Pengasih bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. إِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَىٰ مِن ثُلُثَىِ الَّيْلِ وَنِصْفَهُۥ وَثُلُثَهُۥ (Sesungguhnya Tuhanmu mengetahui bahwasanya kamu berdiri (sembahyang) kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya) Yakni Allah mengetahui bahwa Rasulullah terkadang mendirikan shalat malam kurang dari dua pertiga malam, atau setelah malam, atau juga sepertiganya, sebagaimana yang Allah perintahkan kepadanya di awal surat ini. وَطَآئِفَةٌ مِّنَ الَّذِينَ مَعَكَ ۚ( dan (demikian pula) segolongan dari orang-orang yang bersama kamu) Yakni dan sebagian sahabatmu juga mendirikannya dengan kadar waktu tersebut. وَاللَّـهُ يُقَدِّرُ الَّيْلَ وَالنَّهَارَ ۚ( Dan Allah menetapkan ukuran malam dan siang) Yakni Allah mengetahui kadar siang dan malam dengan pasti, sehingga Dia juga mengetahui seberapa kadar kalian mendirikan shalat malam. عَلِمَ أَن لَّن تُحْصُوهُ(Allah mengetahui bahwa kamu sekali-kali tidak dapat menentukan batas-batas waktu-waktu itu) Yakni kalian tidak akan mampu mengetahui kadar siang dan malam dengan pasti. Pendapat lain mengatakan: yakni Allah mengetahui kalian tidak akan mampu mendirikan shalat malam semalam penuh. فَتَابَ عَلَيْكُمْ ۖ( maka Dia memberi keringanan kepadamu) Yakni mengampuni kalian dan memberi kalian keringanan untuk tidak mendirikan shalat malam apabila kalian tidak mampu; Allah mengubah bagi kalian hal berat menjadi ringan, dan yang sulit menjadi mudah. فَاقْرَءُوا۟ مَا تَيَسَّرَ مِنَ الْقُرْءَانِ ۚ( karena itu bacalah apa yang mudah (bagimu) dari Al Quran) Yakni maka bacalah apa yang ringan dan mudah bagi kalian tanpa terikat seberapa lama kalian mengerjakannya. Ayat ini adalah ayat yang menghapus (menasakh) hukum tentang kewajiban mendirikan shalat malam bagi umat Islam. عَلِمَ أَن سَيَكُونُ مِنكُم مَّرْضَىٰ (Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit) Sehingga kalian tidak dapat mendirikan shalat malam. وَءَاخَرُونَ يَضْرِبُونَ فِى الْأَرْضِ يَبْتَغُونَ مِن فَضْلِ اللَّـهِ ۙ( dan orang-orang yang berjalan di muka bumi mencari sebagian karunia Allah) Yakni bepergian untuk berdagang dan mencari keuntungan, demi mengais rezeki yang kalian butuhkan, sehingga kalian tidak mampu mendirikan shalat malam. وَءَاخَرُونَ يُقٰتِلُونَ فِى سَبِيلِ اللَّـهِ (dan orang-orang yang lain lagi berperang di jalan Allah) Yakni orang-orang yang berjihad, tidak mampu melakukan shalat malam. Ayat ini diturunkan sebelum diwajibkannya melakukan jihad, yang diwajibkan di Madinah. Dalam ayat ini Allah menyebutkan tiga sebab disyariatkannya keringanan ini, namun Allah menghapus kewajiban shalat malam bagi seluruh umat Islam karena sebab-sebab ini yang dimiliki oleh sebagian umat. فَاقْرَءُوا۟ مَا تَيَسَّرَ مِنْهُ ۚ وَأَقِيمُوا۟ الصَّلَوٰةَ(maka bacalah apa yang mudah (bagimu) dari Al Quran dan dirikanlah sembahyang) Yakni dirikanlah shalat wajib lima waktu. وَءَاتُوا۟ الزَّكَوٰةَ(tunaikanlah zakat) Yakni zakat yang wajib dari harta kalian. Pendapat lain mengatakan: yakni segala perbuatan baik. وَأَقْرِضُوا۟ اللَّـهَ قَرْضًا حَسَنًا ۚ( dan berikanlah pinjaman kepada Allah pinjaman yang baik) Yakni keluarkanlah harta kalian di jalan kebaikan dengan menafkahkannya untuk keluarga, kepentingan jihad, dan zakat yang wajib. وَمَا تُقَدِّمُوا۟ لِأَنفُسِكُم مِّنْ خَيْرٍ(Dan kebaikan apa saja yang kamu perbuat untuk dirimu) Yakni segala perbuatan baik yang telah disebutkan dan yang belum disebutkan. تَجِدُوهُ عِندَ اللَّـهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا ۚ( niscaya kamu memperoleh (balasan)nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya) Yakni lebih baik daripada harta yang kalian infakkan dengan menunggu datangnya kematian, atau yang kalian wasiatkan untuk diinfakkan setelah kematian kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Wahai Rasul, sesungguhnya Tuhanmu itu Maha Tahu bahwa engkau bangun malam hari untuk qiyamul lail. Terkadang lebih sedikit dari sepertiga malam, terkadang separuh dari sepertiga malam, dan juga sepertiga dari sepertiga malam. Sehingga beberapa sahabatmu pun ikut mendirikan shalat malam bersamamu. Allah Maha Tahu ukuran waktu-waktu malam dan siang, juga menghitung waktu-waktu itu dengan rinci. Allah Tahu bahwa engkau tidak akan bisa menentukan batas-batas waktu malam dan siang dengan rinci, yang membuatmu kesulitan dalam mendirikan shalat malam. Sehingga Allah memberikan keringanan kepada engkau agar memudahkanmu. Maka shalatlah disertai dengan membaca ayat Al-quran yang mudah bagimu. Ayat ini me-nasakh/menghapus hukum bahwa shalat malam itu wajib bagi ummat. Allah tahu bahwa akan ada di antara umat Islam yang akan sakit dan tidak mampu mengerjakan kewajiban tersebut. Juga ada yang akan melakukan perjalanan jauh seperti keperluan untuk berdagang untuk mencari rizki Allah. Ada juga yang berjuang untuk keperluan dakwah kepada Agama Allah dan kebenaran. Maka shalatlah dengan bacaan Al-quran yang menurutmu mudah bagimu. Penyebutan keringanan yang kedua adalah untuk sebab kesulitan mendirikan shalat malam yang lain yaitu perjalanan jauh, sakit dan berjuang di jalan Allah. Maka laksanankanlah shalat fardhu tepat waktu dengan menyempurnakan rukun-rukunnya. Tunaikanlah zakat kepada orang yang berhak menerimanya. Belanjakanlah kelebihan dari hartamu dalam kebaikan. Berikanlah pinjaman yang baik dengan sukarela hanya untuk mengharap keridhoan Allah. Wahai orang-orang yang beriman, amal kebaikan apapun yang engkau kerjakan untuk dirimu sendiri akan mendapat balasan yang paling baik dari Allah. Mintalah ampunan kepada Allah atas dosa-dosa kalian. Sungguh Allah Maha Pengampun kepada para hamba-Nya yang meminta ampunan, dan Maha Mencurahkan rahmat kepada para hamba-Nya yang memohon rahmat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmu mengetahui bahwa kamu berdiri} shalat {kurang dari} lebih sedikit dari {dua pertiga malam, atau seperdua malam atau sepertiganya} kamu shalat di sepedua malam pada suatu waktu, dan shalat di sepertiga malam di waktu lainnya {dan segolongan dari orang-orang yang bersamamu. Allah menetapkan ukuran malam dan siang} Allah mengetahui ukuran malam dan siang {Allah mengetahui bahwa kamu tidak dapat menghitungnya} bahwa kamu tidak akan sanggup mengetahui itu {Maka Dia kembali kepada kalian} kembali pada kalian dengan memberi ampunan dan keringanan {Maka bacalah apa yang mudah pada Al-Qur’an} maka shalatlah pada waktu yang mudah bagi kalian {Dia mengetahui bahwa akan ada di antara kalian orang-orang yang sakit, dan yang lain berjalan} berjalan {di bumi mencari} mencari {sebagian karunia Allah} rezeki Allah {serta yang lain berperang di jalan Allah, maka bacalah apa yang mudah darinya. Tegakkanlah shalat, tunaikanlah zakat, dan berikanlah pinjaman kepada Allah pinjaman yang baik} dan berinfaklah di jalan Allah dengan infak yang ikhlas dan baik bagi jiwa {Kebaikan apa saja yang kalian lakukan untuk diri kalian niscaya kalian mendapatinya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Mohonlah ampunan kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Di permulaan surat ini Allah memerintahkan RasulNya untuk shalat di seperdua malam, dua pertiga atau sepertiganya. Dan hukum asalnya, bahwa Rasulullah adalah teladan bagi umatnya dalam hukum-hukum. Dan di tempat ini Allah menjelaskan bahwa Rasulullah menunaikan perintah tersebut dan juga segolongan dari orang-orang yang beriman. Mengingat penentuan waktu pelaksanaan shalat malam berat bagi orang, maka Allah mengabarkan bahwa Dia amat memudahkannya seraya berfirman, “Dan Allah menetapkan ukuran malam dan siang,” yakni, mengetahui ukuran keduanya, mengetahui apa yang berlalu dan yang masih tersisa dari keduanya. “Allah mengetahui bahwa kamu sekali-kali tidak dapat menentukan batas-batas waktu itu,” artinya kalian tidak akan mengetahui ukurannya secara tepat, tidak kurang dan tidak lebih, karena hal itu akan menuntut sikap waspada dan beban yang lebih. “Karena itu bacalah apa yang mudah (bagimu) dari al-Quran,” yakni, yang kalian bisa dan yang tidak berat bagimu. Karena itu orang yang shalat malam diperintahkan untuk tetap shalat selama masih kuat. Kemudian bila lelah, malas atau mengantuk, hendaklah beristirahat agar bisa melaksanakan shalat dengan tenang dan nyaman. Selanjutnya Allah menyebutkan sebagian sebab yang sesuai untuk meringankan, “Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit,” berat bagi mereka untuk menjalankan shalat di seperdua, sepertiga, atau dua pertiga malam terakhir. Untuk itu, orang yang sakit hendaklah shalat sebatas kemampuannya. Dalam shalat malam tidak diperintahkan berdiri bila hal itu terasa memberatkan. Bahkan bila shalat sunnah terasa berat, boleh ditinggalkan dan yang bersangkutan tetap mendapatkan pahala seperti ketika mengerjakannya pada saat masih sehat. “Dan orang-orang lainnya berjalan di muka bumi mencari sebagian karunia Allah,” yakni Allah mengetahui bahwa di antara kalian ada yang bepergian untuk urusan dagangan demi mencukupi diri agar tidak membebani orang lain dan menahan diri untuk meminta-minta. Kondisi orang yang bepergian cocok untuk diberi keringanan. Ia dibolehkan untuk menjamak dua shalat dalam satu waktu dan mengqashar shalat yang empat rakaat. “Dan orang-orang yang lain lagi yang berperang di jalan Allah, maka bacalah apa yang mudah (bagimu) dari al-Quran.” Allah menyebutkan dua keringanan; keringanan bagi orang sehat dan tidak bepergian untuk menjaga vitalitasnya tanpa harus memaksakan diri menentukan waktu shalat malam tapi cukup mencari waktu shalat yang utama, yaitu sepertiga malam terakhir setelah seperdua pertama. Yang kedua adalah keringanan bagi orang sakit, orang yang bepergian, baik untuk urusan perdagangan atau ibadah seperti jihad, haji atau yang lainnya. Yang bersangkutan juga mesti memelihara sesuatu yang tidak membebaninya. Karena itu, segala puja dan puji hanya bagi Allah semata yang tidak membuat kerumitan dalam Agama bagi kita, sebaliknya Allah mempermudah syariatNya serta memperhatikan kondisi-kondisi manusia serta kepentingan Agama, raga, dan dunia mereka. Kemudian Allah memerintahkan hamba-hambanya untuk dua ibadah yang merupakan induk dan inti dari ibadah; yaitu mendirikan shalat yang Agama tidak bisa tegak tanpanya dan menunaikan zakat yang merupakan bukti keimanan. Dengan zakat, kesetaraan antara orang-orang fakir miskin bisa terpenuhi. Allah berfirman, “Dan dirikanlah shalat,” yakni dengan rukun-rukunnya,batasan-batasannya, syarat-syaratnya dan seluruh penyempurna-penyempurnanya. “Dan berikanlah pinjaman kepada Allah pinjaman yang baik,” yakni murni demi mengharap Wajah Allah dengan niat tulus dan teguh dari hati serta dengan harta yang baik. Pinjaman baik ini mencakup sedekah wajib dan sunnah. Selanjutnya Allah menganjurkan untuk mengerjakan perbuatan baik secara umum seraya berfirman, “Dan kebaikan apa saja yang kamu perbuat untuk dirimu, niscaya kamu memperoleh (balasannya) di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya,” kebaikan itu pahalanya sepuluh kali lipat hingga tujuh ratus kali dan bahkan hingga berlipat-lipat. Perlu diketahui, kebaikan seberat biji atom dalam dunia ini sebanding dengan berlipat-lipat nilai dunia serta segala apa pun yang ada di atasnya serta apa pun yang terdapat di negeri penu nikmat abadi berupa kenikmatan-kenikmatan dan kesenangan-kesenangan. Kebaikan dunia ini merupakan bahan kebaikan di negeri keabadian, benih, asal dan asasnya. Alangkah ruginya waktu-waktu yang berlalu dalam kelalaian dan alangkah ruginya waktu yang berlalu tanpa mal baik. Alangkah ruginya hati yang tidak terpengaruh oleh petuah Penciptanya dan tidak berbekas seruan rindu Dzat Yang Maha Pengasih padanya ketimbang kasihnya terhadap dirinya sendiri. Segala puji hanya bagiMu ya Allah, kepadaMu-lah tempat mengadu, padaMu kami mohon pertolongan, tidak ada daya dan kekuatan selain dariMu. “Dan mohonlah ampunan kepada Allah; sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Di dalam perintah istighfar setelah dorongan berbuat ketaatan dan kebaikan terdapat faidah besar, sebab manusia itu mungkin tidak melakukan perintah secara sempurna, yang mungkin tidak dikerjakan sama sekali atau dikerjakan tapi tidak sempurna. Untuk itu manusia diperintahkan untuk menutupi kekurangan di atas dengan beristighfar. Manusia selalu berbuat dosa dimalam dan di siang hari, bila tidak direngkuh dengan rahmat dan maghfirah Allah, tentu binasa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 20: Allah mengabarkan kepada Nabi-Nya ﷺ, bahwa Allah mengetahui bahwa Nabi-Nya mengerjakan shalat disebagian malam, terkadang mengerjakan kurang dari waktu sepertiga malam, dan terkadang di pertengahan malam, dan terkadang di sepertiga malam, dan ia mengerjakannya bersama sekelompok manusia dari para sahabatnya, dan Dia (Allah) Maha Tahu atas ukuran malam dan siang harinya. Dan Allah mengetaui kalian tidak mampu wahai manusia, untuk mengerjakan di seluruh waktu malam, oleh karenanya bertaubatlah atas diri-diri kalian dan permudahlah bagi kalian, dan shalatlah dengan apa yang menurutmu mudah di malam hari. Sungguh Allah mengetahui ada pada umat ini yang memiliki udzur, yang ia tidak dapat mengerjakan shalat malam; Disana ada yang udzur karena sakit, ada yang udzur karena sebab mengais rezeki, ada yang udzur karena jihad melawan musuh-musuh Allah dan menegakkan kalimat-Nya serta menyebarkan agama-Nya. Dan Allah mendahulukan amalan jihad di muka bumi yaitu jihad di jalan Allah, karena manusia membutuhkan bahkan mengharuskan untuk mencari nafkah atas dirinya dan keluarganya, dengan sebab itu semua Allah mudahkan bagi kalian untuk shalat di malam hari sesuai kemampuan kalian. Kerjakan shalat-shalat yang wajib sesuai dengan waktu-waktunya dengan sempurna, tunaikan oleh kalian zakat yang wajib atas kalian bagi yang mampu, dan infaqkan dari harta kalian dengan infaq yang baik dengan hati yang ikhlas bagi orang-orang yang berjihad di jalan Allah dan selainnya. Allah mengungkapkan infaq bagi masing-masing karena orang yang berinfaq karena untuk mendapatkan ridha Allah dan balasan dari-Nya, adalah wajib dikerjakan. Dan ketahuilah oleh kalian, barangsiapa yang berlomba-lomba untuk bersedekah di dunia, maka Allah akan balas di hari kiamat dengan kebaikan sesuai dengan apa yang kalian kerjakan di dunia. Kemudian Allah memberi petunjuk untuk beristigfar (memohon ampunan), karena manusia tidak kosong dari kesalahan dan kekurangan. Ketahuilah Allah akan menghapuskan dosa-dosa selain syirik, karena Dia adalah yang Maha Penyayang yang tidak akan mengadzab atas dosa-dosa yang diperbuat oleh manusia setelah bertaubatnya mereka, di antaranya melakukan dosa mengambil hak orang lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di awal surat Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk melakukan qiyamullail separuh malam atau sepertiganya atau dua pertiganya, dan hukum asalnya bahwa umat juga sama mengikutinya dalam hal hukum. Kemudian disebutkan dalam ayat ini bahwa Beliau melakukan hal itu dan diikuti pula oleh orang-orang mukmin yang bersamanya. Akan tetapi, karena ditentukan batas-batas waktu yang diperintahkan itu menyulitkan manusia, maka Allah memudahkannya semudah-mudahnya. Dia berfirman, “Allah menetapkan ukuran malam dan siang.” Yakni Dia yang mengetahui ukuran keduanya (malam dan siang), yang berlalu daripadanya dan yang masih tersisa. Yakni kamu tidak mengetahui batas-batas atau ukurannya dengan tepat; tanpa lebih dan kurang karena yang demikian dibutuhkan sikap jaga dan perhatian lebih, maka Allah Subhaanahu wa Ta'aala meringankan dan memerintahkan dengan yang mudah bagi mereka baik lebih dari ukuran yang ditentukan maupun kurang. Yakni yang kamu ketahui dan tidak memberatkan kamu. Oleh karena itulah, orang yang shalat di malam hari diperintahkan melakukannya selama semangat, ketika sedang lemah seperti ngantuk, maka hendaknya ia istirahat dan melakukan shalat dengan tenang dan kondisi segar. Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan sebagian sebab mengapa diberi keringanan. Dimana mereka kesulitan melakukan shalat duapertiga malam, separuhnya atau sepertiganya. Oleh karena itu, hendaknya ia melakukan shalat yang dirasakannya mudah dan ia pun tidak diperintahkan shalat sambil berdiri ketika sulit melakukannya, bahkan kalau ia kesulitan melakukan shalat sunat, maka ia boleh meninggalkannya dan ia akan mendapatkan pahala seperti yang dilakukannya ketika sehat. Dengan berdagang dan lainnya agar mereka tidak meminta-minta kepada manusia. Mereka (orang-orang musafir) sangat layak diberikan keringanan. Oleh karena itu, ia boleh mengqashar (mengurangi) shalat yang empat rakaat menjadi dua rakaat dan boleh menjama’(menggabung)nya dalam satu waktu. Allah Subhaanahu wa Ta'aala menyebutkan dua keringanan: (1) Keringanan untuk orang yang sehat lagi mukim (tidak safar) dengan memperhatikan waktu semangatnya tanpa ditentukan batasnya, dan sebaiknya ia memilih waktu shalat yang utama yaitu sepertiga malam. (2) Keringanan untuk orang yang sakit atau musafir baik safarnya untuk berdagang atau beribadah seperti berperang atau berjihad, berhaji atau berumrah dsb. maka ia memperhatikan keadaan yang tidak membebaninya. Segala puji bagi Allah karena Dia tidak menjadikan kesempitan dalam agama ini, bahkan Dia memudahkan syariat-Nya, memperhatikan keadaan hamba, maslahat agama, badan dan dunia mereka. Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan para hamba dua ibadah, dimana keduanya adalah induk ibadah dan tiangnya, yaitu mendirikan shalat dimana agama tidak akan tegak tanpanya, dan menunaikan zakat yang merupakan bukti keimanan yang di sana terdapat sikap tolong-menolong kepada orang-orang fakir dan miskin. Di dalam shalat terdapat berbuat ihsan dalam beribadah kepada Allah, dan di dalam zakat terdapat ihsan kepada hamba-hamba Allah. Dengan mengerjakan rukun, syarat dan penyempurnanya. Dengan niat mengharap ridha Allah dan dengan hati yang rela. Termasuk pinjaman yang baik adalah sedekah yang wajib maupun sunat. Selanjutnya Allah Subhaanahu wa Ta'aala mendorong untuk mengerjakan kebaikan secara umum dan melakukannya. Satu kebaikan dibalas sepuluh kebaikan kemudian menjadi tujuh ratus dan seterusnya sampai kelipatan yang banyak sesuai niat dan manfaat yang dihasilkan, wallahu a’lam. Hendaknya diketahui, bahwa satu kebaikan meskipun kecil di dunia ini tidak disia-siakan Allah, bahkan Dia akan melipatgandakannya menjadi banyak, dan bahwa kebaikan di dunia ini merupakan bahan kebaikan di negeri yang kekal; sebagai benihnya, asalnya dan asasnya. Sungguh sayang, ketika waktu berlalu bagi hamba begitu saja dengan kelalaian, sungguh rugi, ketika waktu bergulir tanpa amal saleh dan kebaikan, dan sungguh merana hati yang tidak tersentuh nasihat. Maka segala puji bagi engkau ya Allah, kepada-Mulah kami mengadu dan kepada-Mulah kami memohon pertolongan, bantulah kami untuk dapat mengisi hidup ini dengan kebaikan, yaa Arhamar raahimiin. Dalam perintah beristighfar setelah perintah mengerjakan ketaatan dan kebaikan terdapat faedah yang besar. Hal itu, karena seorang hamba tidaklah lepas dari kekurangan dalam mengerjakan perintah Allah, bisa saja dia tidak mengerjakannya sama sekali atau mengerjakannya dengan tidak sempurna, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk menutupi kekurangan itu dengan istighfar, karena seorang hamba biasa berbuat salah di malam dan siang, maka jika tidak mendapatkan rahmat Allah dan ampunan-Nya, tentu ia akan binasa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 20",
    "description": "Jalan lurus menuju tuhan mungkin dirasakan berat bagi sementara orang, maka ayat ini memberi petunjuk solusinya. Sesungguhnya tuhanmu senantiasa mengetahui bahwa engkau, wahai nabi Muhammad, terkadang berdiri untuk mengerjakan salat kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan demikian pula segolongan dari orang-orang yang bersamamu yaitu para sahabat yang mengikutimu. Allah menetapkan ukuran malam dan siang. Allah mengetahui bahwa kamu tidak dapat menentukan batas-batas waktu itu secara pasti dan rinci dalam melaksanakan salat, maka dia memberi keringanan kepadamu menyangkut apa yang telah ditetapkan-Nya sebelum ini, karena itu bacalah apa yang mudah bagimu dari Al-Qur'an. Dia mengetahui bahwa akan ada di antara kamu orang-orang yang sakit sehingga akan sulit melaksanakan salat malam seperti yang diperintahkan, dan ada juga yang berjalan di bumi yaitu bepergian jauh untuk mencari sebagian karunia Allah baik urusan perniagaan atau menuntut ilmu. Dan Allah mengetahui juga akan ada yang lain berperang di jalan Allah, maka bacalah apa yang mudah bagimu dari Al-Qur'an dan laksanakanlah salat secara baik dan berkesinambungan, tunaikanlah zakat secara sempurna dan berikanlah pinjaman kepada Allah pinjaman yang baik yaitu segala pemberian di jalan Allah di luar kewajiban zakat. Kebaikan apa saja yang kamu perbuat untuk dirimu niscaya kamu memperoleh balasan-Nya di sisi Allah sebagai balasan yang paling baik dan yang paling besar pahalanya. Dan di samping amalan tersebut maka mohonlah ampunan kepada Allah. Sungguh, Allah maha pengampun, maha penyayang. 1-2. Di akhir surah al-Muzammil berisi berita gembira bagi yang berbuat kebajikan, di awal surah ini berisi perintah untuk bersemangat menyeru kepada kebajikan. Wahai orang yang berkemul atau berselimut yakni nabi Muhammad! bangunlah dengan sungguh-sungguh dan penuh semangat, lalu berilah peringatan!."
  }
]