[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-4. Wahai orang yang berselimut dengan kain selimutnya, bangkitlah untuk shalat di malam hari kecuali sedikit darinya. Bangkitlah setengah malam, atau kurang dari setengah hingga sampai sepertiga, atau tambahlah di atas setengah hingga sampai dua pertiga. Bacalah al-Quran dengan tenang dan pelan, dengan huruf-huruf dan waqaf-waqaf yang jelas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Salatlah separuh malam jika engkau menghendaki atau salatlah kurang sedikit dari separuh malam hingga sampai sepertiganya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3-4. أَوْ زِدْ عَلَيْهِ نِّصْفَهُۥٓ أَوِ انقُصْ مِنْهُ قَلِيلًا (seperduanya atau kurangilah dari seperdua itu sedikit atau lebih dari seperdua itu) Seakan-akan dikatakan dirikanlah shalat selama dua pertiga malam, atau setengah, atau sepertiganya. Imam Ahmad dan Muslim meriwayatkan dari Sa’d bin Hisyam ia berkata: “aku bertanya kepada Aisyah: beritahukan kepadaku bagaimana Rasulullah mendirikan shalat malam.” Aisyah menjawab: “bukankah kamu telah membaca surat al-Muzzammil?” Aku balik menjawab: “Sudah.” Ia berkata: “Allah mewajibkan shalat malam lewat awal surat ini, maka Rasulullah dan para sahabatnya mendirikan shalat malam selama satu tahun, sampai-sampai kaki mereka bengkak, dan Allah masih menahan akhir surat ini di langit selama 12 bulan itu. kemudian Allah menurunkan keringanannya yang terdapat dalam akhir surat ini, sehingga shalat malam menjadi sunnah, yang sebelumnya merupakan ibadah wajib.” وَرَتِّلِ الْقُرْءَانَ تَرْتِيلًا (Dan bacalah Al Quran itu dengan perlahan-lahan) Yakni bacalah dengan perlahan dan penuh penghayatan. Dan makna membaca dengan tartil yakni membaca dengan huruf yang jelas dan memenuhi panjang pendek setiap huruf itu tanpa berlebih-lebihan dalam melafazhkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Penjelasan dari sedikit adalah separuh malam, atau mengurangi sedikit lagi kira-kira sampai sepertiga. Sebagai opsi pilihan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seperduanya, kurang sedikit dari itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Al-Muzammil adalah orang yang menutupi badannya dengan baju semakna dengan kata al-Mudatsir. Hal ini terjadi pada Rasulullah ketika Allah memuliakan beliau dengan risalah. Allah memulainya dengan menurunkan wahyu dengan mengutus Jibril menemui beliau. Rasulullah melihat sesuatu yang belum pernah beliau lihat sebelumnya dan tidak ada yang mampu bertahan atasnya melainkan hanya para rasul. Pada saat itu Rasulullah gemetar kala melihat Jibril. Kemudian Rasulullah pulang kepada istri beliau dan berkata, “Selimutilah aku, selimutilah aku.” Rasulullah menggigil ketakutan. Setelah itu datanglah jibril dan berkata, “Bacalah! Rasulullah menjawab, “Aku tidak bisa membaca.” Jibril memeluk erat beliau hingga Rosulullah kelelahan, Jibril mengajarkan bacaan padanya lalu Rasulullah pun membaca. Kemudian Allah menganugerahkan keteguhan padanya dan memberinya wahyu hingga mencapai tingkat yang belum pernah dicapai oleh para rasul sebelumnya. Subhanallah! Alangkah besarnya perbedaan antara permulaan kenabian dan akhirannya. Karena itulah Allah berfirman kepada Rasulallah dengan menyebutkan sifat seperti ini yang dilihat pada beliau pada saat pertama kali. Allah memerintahkan Rasulullah dengan berbagai ibadah yang berkaitan denganNya. Selanjutnya Allah memerintahkan beliau untuk bersabar atas gangguan kaumnya lalu memerintahkan untuk tegar dengan perintahNya dan mengumumkan dakwah beliau kepada Allah. Allah memerintah beliau dengan ibadah yang paling mulia, yaitu shalat pada waktu yang paling mantap dan utama (qiyamul lail). Di antara rahmat Allah, Dia tidak memerintahkan Rasulullah untuk menghidupkan seluruh malam dengan shalat, tapi Allah berfirman, “Bangunlah (untuk shalat) di malam hari, kecuali sedikit (darinya).” Selanjutnya Allah menentukannya, “(Yaitu) seperduanya atau kurangilah darinya,” yakni dari seperdua, “sedikit” misalnya sepertiganya, “atau lebih dari seperdua itu,” lebih dari seperdua seukuran dua pertiga malam , “dan bacalah al-Quran itu dengan perlahan-lahan,” karena membaca al-Quran dengan perlahan bisa mendatangkan perenungan, pemikiran, bisa menggerakan kalbu, beribadah dengan tanda-tanda kebesaran Allah serta bersiap-siap secara sempurna untuk itu. Allah berfirman, “Sesungguhnya Kami akan menurunkan kepadamu perkataan yang berat,” yakni, Kami akan mewahyukan al-Quran yang berat ini padamu. Yang dimaksud dengan berat adalah makna-maknanya yang agung, sifat-sifatnya yang luhur. Untuk itu, sesuatu yang sifatnya seperti ini layak dipersiapkan, dibaca secara perlahan, serta merenungkan apa yang tercakup di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 3: 1-4. Telah datang dalam shahih bukhari bahwa Nabi ﷺ ketika datang kepadanya Jibril dan Nabi pada saat itu beribadah di gua hira, kemudian turun kepadanya : ٱقْرَأْ بِٱسْمِ رَبِّكَ ٱلَّذِى خَلَقَ, {Al Alaq : 1}; Nabi pulang ke istrinya (Khadijah), dan Nabi gemetar karena seolah ada yang menakutinya di tempat yang tidak pernah ia temui yang semisal dengannya. Nabi berkata kepada istrinya : Selimuti aku, selimuti aku, sungguh aku sangat ketakutan. Kemudian Nabi kabarkan kepada istrinya atas kejadian sebenarnya. Maka Khadijah mengokohkan hatinya dan menenangkannya, kemudian ia menyelimutinya dengan kain selimut, atau berselimut dengannya. Kemudian Allah menyerunya dengan ramah dan lembut, Allah berkata : Wahai manusia yang tertutup di tempat tidurnya, letakkan penutupmu dan kain selimut yang menutupimu. kerjakan shalat malam dengan ringan (sebentar), dan bagimu masih memiliki setengah malam, atau pemudahlah shalatmu sampai datang sepertiga malam atau tambahkan setengah malam sampai datang sepertiga malam. Dan Allah memerintahkan untuk membaca Al Qur’an di sepanjang waktu shalat malam dengan bacaan yang dihayati, yakin, pelan dan perlahan, agar menolongmu paham Al Qur’an dan dapat mentadabburinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 3",
    "description": "1-4. Di akhir surah al-jinn dijelaskan tentang keagungan Al-Qur'an dan pemeliharaan Allah atas wahyu yang diturunkannya tersebut, sedangkan di awal surah ini berisi petunjuk kepada nabi Muhammad untuk mempersiapkan diri menghadapi turunnya wahyu yang berat. Wahai orang yang berselimut, yaitu nabi Muhammad! bangunlah untuk mengerjakan salat dan bermunajat kepada Allah pada malam hari, kecuali sebagian kecil dari waktu malammu dapat digunakan untuk istirahat tidur, yaitu separuhnya atau kurang sedikit dari itu, atau lebih dari seperdua itu, dan bacalah Al-Qur'an itu dengan perlahan-lahan dengan bacaan yang baik dan benar"
  }
]