[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5. Sesungguhnya Kami akan menurunkan kepadamu (wahai Nabi) al-Quran yang agung yang mengandung perintah-perintah, larangan-larangan, dan hukum-hukum syariat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sesungguhnya Kami akan menurunkan kepadamu -wahai Rasul- Al-Qur`ān, yaitu perkataan yang berat karena berisi berbagai kewajiban, hudud, hukum, adab dan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Pada ayat ini terdapat pemberitahuan kepada Nabi bahwa ayat-ayat yang akan diturunkan kepadanya merupakan firman yang mulia, berkedudukan tinggi, memiliki pengaruh yang kuat, mengandung makna-makna yang dalam, dan petunjuk-petunjuk yang mulia. Tujuan pemberitahuan ini agar beliau barsiap untuk menghadapi peristiwa-peristiwa besar, termasuk pendustaan dan gangguan dari kaumnya akibat turunnya firman Allah yang agung ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. إِنَّا سَنُلْقِى عَلَيْكَ قَوْلًا ثَقِيلًا (Sesungguhnya Kami akan menurunkan kapadamu perkataan yang berat) Yakni Kami akan mewahyukan al-Qur’an kepadamu, dan ia merupakan wahyu yang berat dalam hal kewajiban dan hukum-hukum, serta halal dan haram yang dikandungnya; kecuali bagi hati yang dikuatkan dengan taufik dan jiwa yang dihiasi dengan tauhid."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Sesungguhnya Kami akan menurunkan perkataan/ayat Al-quran yang berat kepadamu wahai Nabi Bahwa turunnya perkataan/ayat itu adalah keadaan yang memberatkan jiwa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami akan menurunkan kepadamu perkataan yang berat} Al-Qur'an yang agung yang mengandung perintah, larangan, dan batasan-batasan hukum"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-5. Al-Muzammil adalah orang yang menutupi badannya dengan baju semakna dengan kata al-Mudatsir. Hal ini terjadi pada Rasulullah ketika Allah memuliakan beliau dengan risalah. Allah memulainya dengan menurunkan wahyu dengan mengutus Jibril menemui beliau. Rasulullah melihat sesuatu yang belum pernah beliau lihat sebelumnya dan tidak ada yang mampu bertahan atasnya melainkan hanya para rasul. Pada saat itu Rasulullah gemetar kala melihat Jibril. Kemudian Rasulullah pulang kepada istri beliau dan berkata, “Selimutilah aku, selimutilah aku.” Rasulullah menggigil ketakutan. Setelah itu datanglah jibril dan berkata, “Bacalah! Rasulullah menjawab, “Aku tidak bisa membaca.” Jibril memeluk erat beliau hingga Rosulullah kelelahan, Jibril mengajarkan bacaan padanya lalu Rasulullah pun membaca. Kemudian Allah menganugerahkan keteguhan padanya dan memberinya wahyu hingga mencapai tingkat yang belum pernah dicapai oleh para rasul sebelumnya. Subhanallah! Alangkah besarnya perbedaan antara permulaan kenabian dan akhirannya. Karena itulah Allah berfirman kepada Rasulallah dengan menyebutkan sifat seperti ini yang dilihat pada beliau pada saat pertama kali. Allah memerintahkan Rasulullah dengan berbagai ibadah yang berkaitan denganNya. Selanjutnya Allah memerintahkan beliau untuk bersabar atas gangguan kaumnya lalu memerintahkan untuk tegar dengan perintahNya dan mengumumkan dakwah beliau kepada Allah. Allah memerintah beliau dengan ibadah yang paling mulia, yaitu shalat pada waktu yang paling mantap dan utama (qiyamul lail). Di antara rahmat Allah, Dia tidak memerintahkan Rasulullah untuk menghidupkan seluruh malam dengan shalat, tapi Allah berfirman, “Bangunlah (untuk shalat) di malam hari, kecuali sedikit (darinya).” Selanjutnya Allah menentukannya, “(Yaitu) seperduanya atau kurangilah darinya,” yakni dari seperdua, “sedikit” misalnya sepertiganya, “atau lebih dari seperdua itu,” lebih dari seperdua seukuran dua pertiga malam , “dan bacalah al-Quran itu dengan perlahan-lahan,” karena membaca al-Quran dengan perlahan bisa mendatangkan perenungan, pemikiran, bisa menggerakan kalbu, beribadah dengan tanda-tanda kebesaran Allah serta bersiap-siap secara sempurna untuk itu. Allah berfirman, “Sesungguhnya Kami akan menurunkan kepadamu perkataan yang berat,” yakni, Kami akan mewahyukan al-Quran yang berat ini padamu. Yang dimaksud dengan berat adalah makna-maknanya yang agung, sifat-sifatnya yang luhur. Untuk itu, sesuatu yang sifatnya seperti ini layak dipersiapkan, dibaca secara perlahan, serta merenungkan apa yang tercakup di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 5: Ketahuilah wahai Nabi Allah, akan turun Al Qur’an yang agung yang terkandung di dalamnya penjelasan halal, haram, hudud, dan apa yang berhubungan dengan jihad, dan kabar-kabar dunia dan akhirat serta selain dari itu, misal kisah-kisah Nabi dan kaum mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Kami akan mewahyukan kepadamu Al Qur’an yang berat ini; yang agung maknanya dan sifatnya. Jika demikian sifatnya, maka berhak diperhatikan dengan serius, dibaca dengan tartil dan dipikirkan isinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 5",
    "description": "Mengapa Allah memerintahkan nabi Muhammad untuk beribadah di waktu malam, alasannya disebut dalam ayat ini. Sesungguhnya kami melalui malaikat jibril akan menurunkan perkataan yang berat yaitu firman-firman Allah berupa Al-Qur'an kepadamu wahai nabi Muhammad. 6. Diperintahkannya ibadah di waktu malam adalah mengandung hikmah yang sangat besar di antaranya seperti yang disebut pada ayat ini. Sungguh, bangun untuk beribadah di waktu malam itu lebih kuat mengisi jiwa. Dan bacaan di waktu itu lebih berkesan serta lebih mudah untuk dipahami dan dihayati."
  }
]