[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6. Sesungguhnya ibadah yang dilakukan di tengah malam lebih berefek terhadap hati dan lebih jelas bacaannya, karena kosongnya hati dari kesibukan dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya waktu-waktu malam itu lebih menyentuh hati (khusyuk) dengan bacaan dan lebih tepat pengucapannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Sungguh waktu malam lebih sesuai untuk menjalankan ketaatan dan ibadah, lebih mudah untuk meraih kekhusyu’an, lebih jauh dari sifat riya’, dan lebih mendatangkan keberkahan dan pahala, karena waktu malam memiliki ketenangan, dan jauh dari kesibukan, serta hati lebih condong kepada Allah; meski juga berat bagi jiwa untuk meninggalkan tempat tidur dan bangkit dari tidur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّ نَاشِئَةَ الَّيْلِ (Sesungguhnya bangun di waktu malam) Disebut shalat malam itu dengan tahajjud jika dilaksanakan setelah bangun tidur. هِىَ أَشَدُّ وَطْـًٔا(lebih tepat (untuk khusyu’)) Yakni lebih berat untuk dilakukan daripada shalat di siang hari, sebab malam hari adalah waktu tidur. وَأَقْوَمُ قِيلًا(dan bacaan di waktu itu lebih berkesan) Yakni bacaannya lebih merasuk, lebih mudah diingat dan lebih mudah untuk khusyu’ sebab ketika itu keadaan sangat sunyi dan tenang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Sesungguhnya ibadah malam hari itu lebih bisa menyentuh jiwa dari pada ibadah pada siang hari. Juga lebih bisa menggerakkan hati, karena suasana tenang akan membantu untuk menghayati makna"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya bangun malam itu} waktu malam itu {lebih kuat dalam memberi ketenangan (hati)} lebih bisa selaras dengan hati {dan lebih mantap ucapannya} lebih benar bacaannya untuk menenangkan orang dan mengheningkan suara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Kemudian Allah menyebutkan hikmah dalam perintah qiyamul lail seraya berfirman, “Sesungguhnya bangun di waktu malam,” yakni, shalat pada waktu malam setelah tidur, “adalah lebih tepat (untuk khusyu’) dan bacaan di waktu itu lebih berkesan,” yakni, lebih dekat mencapai maksud al-Quran sehingga sesuai dengan hati dan lisan, beban menjadi ringan, apa yang diucapkan bisa dipahami, dan urusannya menjadi lurus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 6: 6-7. Ketahuilah wahai Nabi Allah, bahwa shalat yang engkau bangun di malam hari setelah tidurmu menjadikanmu berkesan di dalam hati, dan lebih mendekatkan akan maksud Al Qur’an; Karena hati lebih jernih dari kesibukan keduniaan. Adapun di waktu siang maka engkau sibuk dengan urusan kehidupanmu, sibuk dengan mencari rezeki dan menyampaikan dakwah seingga membuatmu tidak sanggup untuk menyempatkan untuk ibadah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan hikmah diperintahkan melakukan qiyamullail. Setelah tidur. Yakni lebih dekat untuk mencapai maksud Al Qur’an. Ketika itu, lisan dan hati sejalan, kesibukan berkurang, ia dapat memahami apa yang dia ucapkan dan urusannya sedang fokus. Berbeda dengan di siang hari, maka hal itu tidak dapat tercapai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 6",
    "description": "Diperintahkannya ibadah di waktu malam adalah mengandung hikmah yang sangat besar di antaranya seperti yang disebut pada ayat ini. Sungguh, bangun untuk beribadah di waktu malam itu lebih kuat mengisi jiwa. Dan bacaan di waktu itu lebih berkesan serta lebih mudah untuk dipahami dan dihayati. 7. Sebaliknya, sesungguhnya pada siang hari engkau sangat sibuk dengan urusan-urusan yang panjang dan melelahkan. Karena itu bangunlah di malam hari agar pekerjaanmu di siang hari yang banyak itu dapat sukses dengan pertolongan Allah."
  }
]