[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Sebutlah (wahai Nabi) Nama Tuhanmu, panggilah Dia dengannya, menghadaplah secara total kepadaNya dalam beribadah dan bertakwalah kepadaNya. Dia-lah pemilik timur dan barat, tidak ada sesembahan yang haq kecuali Dia, bersandarlah kepadaNya, dan serahkanlah segala urusanmu kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan berzikirlah kepada Allah dengan bermacam-macam zikir dan fokuslah kepada Allah -Subḥānahu- dengan mengikhlaskan ibadahmu untuk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan teruslah berzikir kepada Allah setiap saat, di siang dan malam hari; janganlah aktifitas di siang hari menghalangimu berzikir kepada Allah. Hendaklah kamu berzikir kepada Allah dengan sepenuh jiwa, dan tinggalkanlah segala kesibukan ketika kamu berzikir agar hatimu mendapat kekhusyu’an dan fokus menghadap Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَتَبَتَّلْ إِلَيْهِ تَبْتِيلًا (dan beribadatlah kepada-Nya dengan penuh ketekunan) Yakni menghadaplah kepada Allah dengan fokus beribadah dan berharap pahala dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Maka berlama-lamalah dalam berdzikir kepada Allah deng tasbih, tahmid, tahlil dan doa, dan menyibukkan diri dalam beribadah dan mendekatkan diri kepada Allah melalui hatimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebutlah nama Tuhanmu dan beribadahlah kepadaNya dengan sepenuh hati} dan fokuslah kepadaNya dengan sepenuhnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. “Sebutlah nama Rabbmu,” mencakup berbagai macam dzikir, “dan beribadahlah kepadaNya dengan penuh ketekunan,” yakni konsentrasi padaNya, sebab konsentrasi dan kembali kepada Allah adalah terputusnya hati dari seluruh makhluk dan penuh kecintaan terhadap Allah serta segala sesuatu yang bisa mendekatkan padaNya dan pada ridhaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 8: 8-9. Mintalah pertolongan wahai Nabi Allah atas dakwahmu dengan menyebut nama Allah dan bertasbihlah malam dan siang, dan tekunlah dalam beribadah kepada Tuhanmu dan sampaikan risalah Tuhanmu dengan secara sempurna, dan berpegang teguhlah dengan apa yang ada di sisi Tuhanmu, serta tawakal kepada-Nya; Karena Dia adalah Tuhan pemilik timur dan barat, dan berkuasa pada keduanya, serta tidak ada Tuhan yang berhak diibadahi dengan benar kecuali Dia; Engkau telah tahu itu, maka berpegang teguhlah kepada-Nya dan pasrahkan segala urusanmu kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ucapkanlah “Bismillahirrahmaanirrahiim” dalam memulai bacaanmu. Atau maksudnya perintah untuk dzikrullah. Yakni fokuskanlah beribadah dan kembali kepada-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 8",
    "description": "Meskipun di siang hari kamu sangat sibuk bukan berarti boleh melupakan Allah. Ayat ini memerintahkan untuk selalu menyebut dan mengingat Allah. Dan sebutlah nama tuhanmu, dan beribadahlah kepada-Nya dengan sepenuh hati. 9. Mengapa harus menyebut nama Allah, karena dialah tuhan timur dan barat yakni alam semesta, tidak ada tuhan yang mengendalikan alam raya selain dia, maka jadikanlah dia sebagai pelindung dan serahkanlah segala urusan hidup setelah berusaha dengan maksimal."
  }
]