[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Sebutlah (wahai Nabi) Nama Tuhanmu, panggilah Dia dengannya, menghadaplah secara total kepadaNya dalam beribadah dan bertakwalah kepadaNya. Dia-lah pemilik timur dan barat, tidak ada sesembahan yang haq kecuali Dia, bersandarlah kepadaNya, dan serahkanlah segala urusanmu kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Pemilik timur dan Pemilik barat, tidak ada sesembahan yang berhak disembah selain-Nya, maka jadikan Dia sebagai pelindung-Mu, engkau bersandar kepada-Nya dalam segala urusanmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Milik Allah kerajaan yang ada di antara timur dan barat yang meliputi seluruh makhluk; hanya Dia yang berhak disembah, maka sandarkanlah kepada-Nya segala urusanmu dan bertawakkal-lah hanya kepada-Nya, kerena Dia Maha Kuasa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. فَاتَّخِذْهُ وَكِيلًا (maka ambillah Dia sebagai pelindung) Yakni serahkanlah segala urusanmu kepada-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Allah adalah Tuhan kerajaan timur dan barat, atau Penguasa seluruh alam. Tidak ada Tuhan yang berhak disembah kecuali Dia, maka jadikanlah Allah sebaik-baik pengurus urusanmu. Hanya kepada-Nya urusanmu engkau serahkan dan pasrahkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tuhan timur dan barat. Tidak ada tuhan selain Dia. Maka jadikanlah Dia sebagai pelindung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. “(Dia-lah) Rabb masyriq dan maghrib,” ini adalah isim jenis yang mencakup seluruh arah timur dan barat. Allah adalah Rabb seluruh timur dan barat serta segala cahaya yang ada padanya serta segala sesuatu yang menjadi maslahat miliknya dari alam atas dan alam bawah. Allah adalah Rabb segala sesuatu, Pencipta dan Pengaturnya. “Tiada tuhan yang berhak disembah melainkan Dia,” yakni, tidak ada yang berhak disembah selain WajahNya Yang Agung Yang berhak diistimewakan dan dicintai, diagungkan dan dimuliakan, karena itu Allah berfirman, “Maka ambillah Dia sebagai pelindung,” yakni Penjaga dan Pengatur untuk segala urusanmu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Muzzammil ayat 9: 8-9. Mintalah pertolongan wahai Nabi Allah atas dakwahmu dengan menyebut nama Allah dan bertasbihlah malam dan siang, dan tekunlah dalam beribadah kepada Tuhanmu dan sampaikan risalah Tuhanmu dengan secara sempurna, dan berpegang teguhlah dengan apa yang ada di sisi Tuhanmu, serta tawakal kepada-Nya; Karena Dia adalah Tuhan pemilik timur dan barat, dan berkuasa pada keduanya, serta tidak ada Tuhan yang berhak diibadahi dengan benar kecuali Dia; Engkau telah tahu itu, maka berpegang teguhlah kepada-Nya dan pasrahkan segala urusanmu kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang diserahi semua urusan atau yang menjaga dan mengurus semua urusanmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Muzzammil Ayat 9",
    "description": "Mengapa harus menyebut nama Allah, karena dialah tuhan timur dan barat yakni alam semesta, tidak ada tuhan yang mengendalikan alam raya selain dia, maka jadikanlah dia sebagai pelindung dan serahkanlah segala urusan hidup setelah berusaha dengan maksimal. 10. Di samping berusaha sungguh-sungguh dan berserah diri kepada Allah, modal sukses dalam menyampaikan dakwah adalah sabar. Inilah yang ditegaskan dalam ayat ini. Dan bersabarlah wahai nabi Muhammad terhadap apa saja yang mereka katakan yang menyakitimu dan tinggalkanlah mereka dengan cara yang baik sehingga mereka tidak merasa bahwa engkau memusuhi mereka dan menaruh dendam terhadap mereka."
  }
]