[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai manusia yang takut kepada Allah dan berpegang teguh kepada perintah-perintahNYA serta menjauhi larangan-laranganNYA, DIA lah Dzat yang telah menciptakan kalian dari jiwa yang satu,yaitu adam dan darinya DIA menciptakan istrinya, yaitu hawwa’, selanjutnya Dia menyebarkandari keduanya di seluruh penjuru bumi kaum lelaki dan kaum wanita yang banyak. Dan hendaknya kalian selalu merasa diawasi Allah yang sebagian dari kalian meminta sebagian yang lain dengan NamaNYA. Hindarilah memutus hubungan silaturahim kalian. Sesungguhnya Allah selalau mengawasi seluruh keadaan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai manusia! Bertakwalah kalian kepada Rabb kalian. Karena Dia lah yang telah menciptakan kalian dari satu jiwa, yaitu bapak kalian, Adam. Dan dari Adam Dia menciptakan istrinya, Hawa, ibu kalian. Dan dari keduanya Dia menyebarkan banyak manusia laki-laki dan wanita ke berbagai penjuru bumi. Dan bertakwalah kalian kepada Allah, Żat yang nama-Nya kalian gunakan sebagai sarana untuk meminta sesuatu kepada sesama kalian. Yaitu dengan mengatakan, “Aku memintamu dengan nama Allah agar kamu sudi melakukan hal ini.” Dan takutlah kalian terhadap memutus tali persaudaraan yang mengikat kalian dengan saudara kalian. Sesungguhnya Allah Maha Mengawasi kalian. Maka tidak ada satu pun amal perbuatan kalian yang luput dari pengawasan-Nya. Dia senantiasa menghitungnya dan akan memberi kalian balasan yang setimpal dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Allah memulai surat ini dengan seruan agung bagi seluruh manusia, dengan menekankan peribadatan kepada-Nya semata melalui rasa takut terhadap-Nya dengan senantiasa menjalankan ketaatan. Dialah yang menciptakan mereka dari Adam, kemudian menciptakan istrinya, Hawa dari diri Adam. Lalu dari mereka berdua beranak pinak banyak lelaki dan perempuan yang menyebar ke berbagai tempat. Kemudian Allah mengulangi perintah-Nya dengan firman-Nya: “Takutlah kalian kepada Allah yang sebagian kalian meminta kepada yang lain menggunakan nama-Nya, dan takutlah kalian kepada-Nya dengan menyambung silaturrahim. Allah selalu mengawasi amal perbuatan manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا النَّاسُ اتَّقُوا۟ رَبَّكُمُ الَّذِى خَلَقَكُم مِّن نَّفْسٍ وٰحِدَةٍ وَخَلَقَ مِنْهَا زَوْجَهَا (Hai sekalian manusia, bertakwalah kepada Tuhan-mu yang telah menciptakan kamu dari seorang diri, dan dari padanya Allah menciptakan isterinya) Yakni menciptakan kalian dari jiwa yang satu, pertama-tama Allah menciptakan Adam, kemudian menciptakan Hawa istrinya dari Adam. وَبَثَّ مِنْهُمَا (dan dari pada keduanya Allah memperkembang biakkan) Yakni memperkembangbiakkan dari keduanya dan menyebar mereka ke penjuru dunia. رِجَالًا كَثِيرًا وَنِسَآءً ۚ (laki-laki yang banyak dan perempuan) Yakni dan perempuan yang banyak pula. وَاتَّقُوا۟ اللهَ الَّذِى تَسَآءَلُونَ بِهِۦ (Dan bertakwalah kepada Allah yang dengan (mempergunakan) nama-Nya kamu saling meminta satu sama lain) Yakni sebagian mereka meminta sebagian yang lain dengan menggunakan nama Allah. وَالْأَرْحَامَ ۚ (dan (peliharalah) hubungan silaturrahim) Yakni bertakwalah kepada Allah dan peliharalah silaturarahim maka janganlah kalian putuskan karena itu merupakan bagian dari apa yang Allah perintahkan untuk disambung. Kata (الأرحام) yakni kata yang mencakup seluruh kerabat dari laki-laki dan perempuan tanpa ada perbedaan antara yang tidak boleh dinikahi dan lainnya. رَقِيبًا (mengawasi kamu) Yakni mengawasi amalan kalian baik itu yang baik maupun yang buruk."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Surat An-nisa’ mengandung isyarat yang begitu indah; ayat pertamanya menunjukkan kekuasaan Allah SWT yang sempurna : { يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ الَّذِي خَلَقَكُمْ مِنْ نَفْسٍ وَاحِدَةٍ } “Wahai manusia! Bertakwalah kepada tuhanmu yang telah menciptakan kamu dari diri yang satu (Adam)”. Sedangkan ayat terakhir mengabarkan kesempurnaan ilmu-Nya, Allah SWT berfirman : { وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ } “Allah Maha Mengetahui segala sesuatu” (Ali ‘imron:176) Rububiyyah, uluhiyyah, keagungan, serta kemuliaan Allah ditetapkan dengan adanya dua sifat tersebut, yakni ilmu dan kekuasaan yang sempurna. Oleh karena itu wajib bagi semua manusia tuk mematuhi semua perintah-Nya dan menjauhi segala larangan-Nya, juga menjalankan semua yang telah dibebankan oleh-Nya. 2 ). Asas hubungan antara laki-laki dan perempuan dalam pandangan Islam adalah untuk saling melengkapi dengan kelebihan dan kekurangan dari masing-masing pasangan, bukan untuk berkompetisi mencari yang paling unggul di antara keduanya. Maka, Hawa tidaklah diciptakan dari tanah seperti halnya Adam, Allah SWT berfirman : { وَخَلَقَ مِنْهَا زَوْجَهَا } “Dan Allah menciptakan pasangannya (Hawa) dari (diri)nya”. Jikalau seorang lelaki dzalim kepada istrinya, maka seakan-akan dia sedang menyakiti dirinya sendiri. Juga sebaliknya jikalau perempuan menentang dan menyelingkuhi suaminya, maka dia telah menyimpang dari jalan fitrahnya. 3 ). Allah berfirman di awal surat An-nisa’: { وَخَلَقَ مِنْهَا زَوْجَهَا } “Dan Allah menciptakan pasangannya (Hawa) dari (diri)nya”. Sebuah hadist shahih telah menafsirkan potongan ayat tersebut, Rasulullah SAW bersabda : (( إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ )) “Sesungguhnya wanita diciptakan dari tulang rusuk (laki-laki)” Hadist tersebut merupakan isyarat jelas akan hubungan untuk saling melengkapi di antara lelaki dan perempuan. Olehnya perempuan diciptakan dari salah satu bagian lelaki, yakni tulang rusuknya, dan itu bertujuan agar seorang suami harus selalu mencintai pasangannya dengan perasaan cinta yang tulus serta menjaganya dari segala yang membahayakan, seperti halnya tulang rusuk yang menjaga organ dalam manusia. Dan tulang rusuk pun harus selalu di tempatnya, tetap dan tidak berpindah, karena jikalau rusuk patah atau berpindah tempat, itu akan mengakibatkan rasa sakit yang amat sangat. 4 ). Allah telah menyandingkan antara takwa terhadap-Nya dengan berbuat baik kepada sanak keluarga. Allah berfirman: { وَاتَّقُوا اللَّهَ الَّذِي تَسَاءَلُونَ بِهِ وَالْأَرْحَامَ } “Bertakwalah kepada Allah yang dengan nama-Nya kamu meminta, dan peliharalah hubungan kekeluargaan.” Itu semua bertujuan untuk menekankan bahwa merawat dan menjaga hubungan antar keluarga dan tidak memutusnya adalah hal yang sangat penting. Maka memelihara dan memberi hak-hak makhluk-Nya dengan cara yang baik, terkhusus sanak keluarga, adalah wajib, seperti halnya wajib bagi hamba untuk melaksanakan dan menjalankan semua hak-hak Allah SWT. Bahkan memelihara hubungan sanak keluarga termasuk dalam menjalankan hak-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Hakim dan lainnya meriwayatkan dari Ibnu Mas’u, dia berkata: “Sesungguhnya di dalam surah An-Nisa ini ada 5 ayat yang lebih aku sukai daripada dunia dan seisinya yaitu {Innallaha Laa Yazlimu mitsaala dzarrah} ayat 40, {In Tajtanibuu kabaaira maa tanhauna ‘amhu} ayat 31, {Innallaha Laa yaghfiru ab yusyraka bih …} ayat 48 dan 116, {Lau annahum idz zhalamu anfusahum jaauuka …} ayat 64” 1. Wahai manusia bertakwalah kepada Allah dengan mengerjakan perintahNya dan menjauhi laranganNya, Dzat yang menciptakan kalian dari satu jiwa. Dia pertama kali menciptakan jiwa itu dari tanah, yaitu Adam AS, lalu jadilah kalian menjadi satu jenis manusia. Dia menciptakan Hawa’ sebagai istri dari jenisnya supaya keduanya bisa saling sesuai dan dipersatukan dengan cinta dan kasih sayang. Kemudian Dia menyebarkan dari keduanya laki-laki dan perempuan yang banyak di bumi. Mereka takut kepada Allah yang dimintai oleh sebagian mereka dengan berkata: “Aku memintamu ya Allah untuk melakukan hal ini” Bertakwalah kalian kepada Allah dengan bersilaturahmi dan jangan sampai memotong silaturahmi. Sesungguhnya Allah memerintahkan untuk menyambungnya. Al-Arham adalah seluruh kerabat baik laki-laki maupun perempuan dari ayah dan ibu. Sesungguhnya Allah itu mengawasi amal perbuatan kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai manusia, bertakwalah kepada Tuhan kalian yang telah menciptakan kalian dari diri yang satu dan Dia menciptakan darinya pasangannya. Dia membuat berkembang biak} menyebarkan {dari keduanya} Adam dan Hawa {laki-laki dan perempuan yang banyak. Bertakwalah kepada Allah yang dengan namaNya kalian saling meminta dan hubungan kekeluargaan} hindarilah memutus hubungan kekeluargaan {Sesungguhnya Allah selalu mengawasi kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah ta'ala memulai surat ini dengan perintah untuk bertakwa kepadaNya dan anjuran untuk beribadah kepadaNya, perintah untuk menyambung silaturahim dan anjuran untuk hal itu. Allah juga menjelaskan tentang sebab-sebab yang mendorong harusnya melakukan setiap dari hal tersebut, dan bahwa hal yang mengharuskan untuk bertakwa kepadaNya adalah karena Allah itu Rabb kalian, ”yang telah menciptakan kalian, ”memberi rizki kepada kalian, memelihara kalian dengan nikmat-nikmatNya yang besar, dan diantaranya adalah penciptaan diri kalian itu, ”dari diri yang satu” dan menjadikan “dari padanya istrinya” agar sesuai dengannya, lalu ia merasa tenang kepadanya, dan dengan hal itu lengkaplah nikmat dan terwujudlah kebahagiaan. Demikian juga, diantara pendorong yang mengharuskan dan menuntut untuk bertakwa kepadaNya adalah (bahwa) kalian saling meminta dengan menyebut namaNya dan pengagungan kalian atasNYa, hingga bila kalian ingin mendapatkan hajat dan kebutuhan kalian, maka kalian bertawassul dengannya, dimana anda meminta dengan “demi Allah”. Karena itu, barangsiapa yang menghendaki hal itu kepada orang lain, ia berkata, ”saya memohon kepadamu dengan Nama Allah untuk melakukan pekerjaan”. karena dia mengetahui apa yang ada didalam hatinya berupa pengagungan kepada Allah, yang mendorong agar orang yang diminta nya dengan “Nama Allah” itu tidak menolak. Maka sebagaimana kalian mengagungkanNya dengan hal itu, agungkanlah juga Allah dengan beribadah dan bertakwa kepadaNya. Demikian juga kabar bahwa Allah Maha Mengawasi, artinya, Allah melihat hamba-hambaNya pada saat mereka diam maupun bergerak, yang dirahasiakan maupun yang ditampakkan, dan Allah mengawasi seluruh kondisi mereka, yang mengharuskan adanya rasa pengawasan Allah dan malu yang mendalam terhadapNya dengan cara konsisten dalam takwa kepadaNya dan pada pemberitaan bahwa Allah menciptakan mereka dari diri yang satu dan bahwa Allah mengembangbiakkan mereka di seluruh bagian bumi, padahal mereka berasal dari jiwa yang satu, adalah agar sebagian mereka mengasihi sebagian yang lain dan sebagian mereka berlaku lemah lembut kepada sebagian lainnya. Allah menyandingkan antara takwa kepadaNya dengan perintah untuk berbuat baik kepada keluarga dan melarang dari memutuskan hubungan silaturahim agar menegaskan akan kebenaran hal tersebut, dan bahwa sebagaimana wajibnya menunaikan hak-hak Allah, maka wajib pula untuk menegakkan hak-hak makhlukNya, khususnya yang termasuk kerabat keluarga diantara mereka, bahkan menunanikan hak-hak mereka adalah di antara hak-hak Allah yang telah diperintahkan olehNya. Perhatikanlah bagaimana Allah memulai surat ini dengan perintah secara umum untuk bertakwa, menyambung silaturahim, dan interaksi antara suami dan istri, kemudia setelah itu Allah merinci perkara-perkara tersebut dengan perincian yang sempurna dari awal surat hingga akhirnya, dimana seolah olah penjelasan surat ini didasari oleh perkara-perkara tersebut, merinci hal-hal yang disebut yaitu secara umum darinya dan menjelaskan hal-hal yang samar. Dalam firman Allah “dan dari padanya Allah menciptakan istrinya,” terdapat sebuah peringatan untuk senantiasa menjaga (memperhatikan)hak-hak para suami dan para istri dan pemenuhannya, karena para istri itu tercipta dari para suami, sehingga antara para suami dan para istri terdapat hubungan nasab yang paling dekat, hubungan yang paling kuat, dan ikatan yang paling kokoh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: اﻟﻨﺎﺱ An Naas berarti manusia, bentuk jamak dari seorang manusia. Annaas dalam bahasa arab adalah bentuk jamak yang tidak ada bentuk tunggalnya. {اﺗﻘﻮا ﺭﺑﻜﻢ} Ittaqu rabbakum Bertakwalah kepada Tuhanmu: Takut lah kepada Tuhanmu, maka jalankan lah perintah-Nya dan jauhilah larangannya. ﻣﻦ ﻧﻔﺲ ﻭاﺣﺪﺓ3 min nafsin wahidah Dari jiwa yang satu: Yaitu Adam. {ﻭﺧﻠﻖ ﻣﻨﻬﺎ ﺯﻭﺟﻬﺎ} wa kholaqo minha zaujaha Dan Dia menciptakan darinya pasangan baginya. Menciptakan Hawa dari Adam dari tulang rusuknya. {ﻭﺑﺚ} wa batstsa Dan menyebarkan serta membuat mereka berpencar dari keduanya (Adam dan hawa) laki-laki dan wanita yang banyak. {ﺗﺴﺎءﻟﻮﻥ ﺑﻪ} Tasaaluna bihi Saling meminta dengan-Nya. Seperti perkataan seseorang kepada saudaranya “Demi Allah aku meminta kepadamu untuk melakukan ini.” {ﻭاﻷﺭﺣﺎﻡ} Wal arham. Arham adalah bentuk jamak dari kata rahim. Maksud dari bertakwa kepada rahim adalah dengan menyambungnya (silaturahim) dan jangan memutuskannya. {ﺭﻗﻴﺒﺎ} Raqiban raqib bermakna pengawas yang maha mengetahui Makna Ayat: ﻳﺎ ﺃﻳﻬﺎ اﻟﻨﺎﺱ Ya Ayyuhan Nas Rabb tabaraka wa ta’ala memanggil hamba-hambanya baik yang kafir maupun yang mukmin, “Wahai manusia” dan memerintahkan kepada mereka untuk bertakwa kepada-Nya. Dan Takwa adalah berlindung dari adzab-Nya di dunia dan di akhirat dengan menyerahkan diri mereka secara utuh lahir maupun batin. Dia menyifati diriNya bahwasanya Dialah yang menciptakan mereka (manusia) dari jiwa yang satu, yaitu Adam. Dimana Dia menciptakan Adam dari seonggok tanah. Dialah yang menciptakan dari jiwa itu pasangannya, Hawa. Dialah yang menyebarkan laiki-laki dan perempuan yang banyak di atas permukaan bumi ini dari dua jiwa itu. Kemudian mengulangi perintah untuk bertakwa yang mana takwa adalah inti dari sebuah perkara, tiada kesempurnaan dan tidak ada kebahagiaan tanpa keterikatan dengan ketakwaan. Sembari berfirman, “Bertakwalah kepada Allah yang kalian saling meminta dengan-Nya dan peliharalah hubungan silaturahim...” yang maknanya adalah bertakwalah kepada Tuhan kalian yang hati kalian beriman kepada-Nya. Jika salah satu dari kalian ingin meminta kepada saudaranya, maka dia berkata,’Demi Allah, Aku meminta kepadamu, maka engkau akan memberikannya kepadaku...’ Dan jagalah hubungan Rahim jangan kau putuskan. Jika kau memutuskannya, maka akan terjadi kerusakan besar yang akan menimpa hidup kalian dan merusaknya. Allah mengancam manusia jika tidak patuh perintah-Nya berbarengan dengan takwa kepada Nya dan tidak menyambung rahim dengan perkataaan-Nya “Sesungguhnya Allah Maha Mengawasi amal-amal kalian, menghitung, menjaga dan membalasnya kepada kalian. Ketahuilah wahai manusia untuk bertakwa kepada-Nya?” Petunjuk dari ayat : 1. Keutamaan ayat ini, manakala Rosulullah selalu membacanya tatkala berkhutbah untuk suatu keperluan. ﻳﺎ ﺃﻳﻬﺎ اﻟﺬﻳﻦ ﺁﻣﻨﻮا اﺗﻘﻮا اﻟﻠﻪ ﺣﻖ ﺗﻘﺎﺗﻪ ﻭﻻ ﺗﻤﻮﺗﻦ ﺇﻻ ﻭﺃﻧﺘﻢ ﻣﺴﻠﻤﻮﻥ}} membaca ayat ini dan kemudian membaca ayat dari surat al ahzab {ﻳﺎ ﺃﻳﻬﺎ اﻟﺬﻳﻦ ﺁﻣﻨﻮا اﺗﻘﻮا اﻟﻠﻪ ﻭﻗﻮﻟﻮا ﻗﻮﻻ ﺳﺪﻳﺪا ﻳﺼﻠﺢ ﻟﻜﻢ ﺃﻋﻤﺎﻟﻜﻢ ﻭﻳﻐﻔﺮ ﻟﻜﻢ ﺫﻧﻮﺑﻜﻢ ﻭﻣﻦ ﻳﻄﻊ اﻟﻠﻪ ﻭﺭﺳﻮﻟﻪ ﻓﻘﺪ ﻓﺎﺯ ﻓﻮﺯا ﻋﻈﻴﻤﺎ} Kemudian berkata amma ba’du lalu dilanjutkan dengan menyebutkan hajat keperluannya. 2. Pentingnya bertakwa kepada Allah yang mana terulang dua kali dalam satu ayat di awal dan akhirnya. 3. Keharusan untuk menyambung silaturahim dan haram untuk memutusnya. 4. Memperhatikan persaudaraan antar indidvidu dan memperhitungkannya dalam pergaulan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 1: Hai manusia! Berbaktilah kepada Tuhan kamu yang telah jadikan kamu daripada satu diri dan la jadikan daripada jodohnya, dan Ia bangkitkan daripada mereka berdua, laki-laki yang banyak dan perempuan-perempuan, dan takutlah kepada Allah yang berminta-mintaan dengan kamu (nama)-Nya dan (peliharalah) keluarga, Allah itu Pengawas atas kamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memulai surat ini dengan perintah bertakwa kepada-Nya, mendorong mereka beribadah kepada-Nya dan menyuruh menjaga tali silaturrahim. Allah Ta'ala menerangkan sebab yang mengharuskan semua itu, yaitu karena Dia adalah Tuhan kamu yang menciptakan kamu. Demikian juga karena kamu biasa menggunakan nama-Nya untuk meminta antara yang satu dengan yang lain. Di samping itu, Dia pun selalu mengawasi kamu. Ini semua menghendaki kita untuk memiliki sikap muraqabah, rasa malu dan tetap menjaga ketakwaan kepada-Nya. Di awal surat ini, Allah Subhaanahu wa Ta'aala memerintahkan secara umum bertakwa kepada-Nya dan menyambung tali silaturrahim, dan akan disebutkan secara rincinya ketakwaan itu pada ayat-ayat selanjutnya. Nampaknya ayat-ayat selanjutnya berpangkal kepada masalah tersebut, menerangkan apa yang masih samar dalam masalah di atas. Disebutkan bahwa manusia berasal dari seorang diri adalah agar manusia menyadari bahwa bapak mereka adalah sama (Adam 'alaihis salam), di mana hal ini menghendaki mereka untuk saling menyayangi antara satu dengan lainnya. Oleh karenanya, disebutkan pula perintah memelihara hubungan silaturrahim dan tidak memutuskannya untuk memperkuat masalah ini. Disebutkan sebelumnya perintah bertakwa kepada Allah adalah agar manusia semuanya sama-sama menyembah kepada Allah dan bersatu di atasnya. Maksud daripadanya menurut jumhur (mayoritas) mufassirin ialah dari bagian tubuh (tulang rusuk) Adam 'alaihis salam. berdasarkan hadis riwayat Bukhari dan Muslim. Namun ada pula yang menafsirkan daripadanya di sini adalah dari unsur yang serupa, yakni tanah yang daripadanya Adam 'alaihis salam diciptakan. Yaitu Hawa'. Menurut kebiasaan orang Arab, apabila mereka menanyakan sesuatu atau memintanya kepada orang lain mereka mengucapkan nama Allah seperti As-aluka billah artinya \"saya bertanya atau meminta kepadamu dengan nama Allah.\" Digunakannya nama Allah adalah karena orang yang meminta mengetahui bahwa orang yang diminta tentu mengagungkan Allah Tuhannya, oleh karenanya ia tentu akan memenuhi permintaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 1",
    "description": "Setelah pada surah sebelumnya Allah menjelaskan bahwa kitab suci merupakan petunjuk jalan menuju kebahagiaan dan bahwa inti seluruh kegiatan adalah tauhid, pada surah ini Allah menjelaskan bahwa untuk meraih tujuan tersebut manusia perlu menjalin persatuan dan kesatuan, serta menanamkan kasih sayang antara sesama. Wahai manusia! bertakwalah kepada tuhanmu dengan menaati perintah-Nya dan menjauhi larangan-Nya, mensyukuri karunia dan tidak mengkufuri nikmat-Nya. Dialah Allah yang telah menciptakan kamu dari diri yang satu yaitu adam, dan Allah menciptakan pasangannya yaitu hawa dari diri-Nya yakni dari jenis yang sama dengan adam; dan dari keduanya, pasangan adam dan hawa, Allah memperkembangbiakkan menjadi beberapa keturunan dari jenis laki-laki dan perempuan yang banyak kemudian mereka berpasang-pasangan sehingga berkembang menjadi beberapa suku bangsa yang berlainan warna kulit dan bahasa (lihat: surah arrum/30: 22). Oleh karena itu, bertakwalah kepada Allah yang dengan nama-Nya kamu saling meminta pertolongan antar sesama, dengan saling membantu, dan juga peliharalah hubungan kekeluargaan dengan tidak memutuskan tali silaturahmi. Sesungguhnya Allah selalu menjaga dan mengawasimu karena setiap tindakan dan perilaku kamu tidak ada yang samar sedikit pun dalam pandangan Allah. Menjalin persatuan dan menjaga ikatan kekeluargaan adalah dasar ketakwaan yang dapat mengantarkan manusia ke tingkat kesempurnaan. Ayat berikut ini menjelaskan siapa yang harus dipelihara hak-haknya dalam rangka bertakwa kepada Allah. Dan berikanlah, wahai para wali atau orang yang diberi wasiat mengurus, kepada anak-anak yatim yang sudah dewasa lagi cerdas untuk mengelola harta mereka sendiri yang ada di dalam kekuasaanmu, dan janganlah kamu menukar harta anak yatim yang baik, lalu karena ketamakan kamu mengambil atau menukar harta mereka. Tindakan itu sama halnya menukar yang baik dengan yang buruk. Dan demikian pula, janganlah kamu makan harta mereka bersama hartamu dengan ikut memanfaatkan harta mereka demi kepentingan diri sendiri. Sungguh, tindakan menukar dan memakan itu adalah dosa yang besar. Jika kamu melakukan hal itu, kamu akan mendapat laknat dan murka dari Allah."
  }
]