[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa keluar dari negeri syirik menuju negeri islam demi lari menyelamatkan agamanya, lagi mengharap karunia tuhannya,serta bermaksud membela agamaNYA,niscaya dia akan mendapatkan di muka bumi ini tempat dan daerah tujuan yang dia akan menikmati hidup di sana dengan hal-hal yang menjadi factor penyebab kekuatannya dan kehinaan musuh-musuhnya, disertai dengan keluasan dalam rizki dan kehidupannya.Dan barangsiapa keluar dari rumahnya dengan tujuan membela agama Allah dan rosulNya serta meninggikan kalimat Allah ,lalu ajal menjemputnya sebelum dia mencapai tujuannya,maka sesungguhnya telah tetap baginya pahal amalannya pada sisi Allah,sebagai bentuk kemurahan dan kebaik dariNYa.Dan Allah maha pengampun lagi maha penyayang kepada hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. \"Barangsiapa yang berhijrah dari negeri kafir menuju negeri Islam dalam rangka mencari rida Allah, maka di tempat hijrahnya itu ia akan menemukan tempat tinggal baru dan tanah pengganti atas tanah yang ditinggalkannya. Dan di sana ia akan mendapatkan kejayaan dan rezeki yang lapang. Dan barangsiapa yang meninggalkan rumahnya untuk berhijrah kepada Allah dan rasul-Nya, kemudian ia meninggal dunia sebelum tiba di tempat hijrahnya, maka pahalanya tetap ada di sisi Allah, dan tidak ada masalah baginya bahwa ia belum sampai ke tempat hijrahnya. Dan Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya yang bertaubat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Allah mendorong dan memberi semangat kepada orang-orang yang lemah untuk berhijrah serta menjelaskan bahwa barangsiapa yang berhijrah demi mendapatkan keridhaan allah dan menegakkan agamanya niscaya dia akan mendapatkan jalan untuk mengalahkan musuh-musuhnya dan tempat tinggal yang penuh dengan kebaikan dan kemudahan setelah selamat dari kezaliman dan kehinaan. Kemudian Allah mengagungkan perkara hijrah dengan menjadikannya memiliki pahala yang besar meski hanya baru keluar dari negeri kafir dan belum sampai ke negeri tujuan berhijrah. Allah menjelaskan bahwa barangsiapa yang keluar dari rumahnya demi mendapatkan keridhaan Allah dan kasih sayang Rasulullah serta menolong agama Islam, namun kemudian ajal menjemputnya maka dia telah mendapatkan pahala berhijrah sebagai janji dari Allah. Kemudian Allah menutup ayat ini dengan ampunan dan rahmat, yakni Dia mengampuni orang-orang yang beriman atas kesalahan-kesalahan yang telah mereka lakukan, terlebih lagi orang-orang yang yang senantiasa bertaubat kepada-Nya, Dan Dia merahmati seluruh makhluk-Nya di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. وَمَن يُهَاجِرْ فِى سَبِيلِ اللهِ (Barangsiapa berhijrah di jalan Allah) Dikatakan berhijrah di jalan Allah apabila dengan tujuan yang benar dan niat yang lurus, tanpa ada tendensi sedikitpun untuk mendapatkan hal-hal keduniaan. Dalam sebuah hadist disebutkan: “Barangsiapa berhijrah kepada Allah dan Rasul-Nya maka hijrahnya itu untuk Allah dan Rasul-Nya, dan barangsiapa berhijrah demi dunia yang ingin ia dapatkan atau wanita untuk ia nikahi maka hijrahnya itu sesuai dengan apa yang ia niatkan. يَجِدْ فِى الْأَرْضِ مُرٰغَمًا (niscaya mereka mendapati di muka bumi ini tempat hijrah yang luas) Tempat untuk ia tinggal meski kaum yang ia tinggalkan itu tidak rela dan meresa diremehkan. وَسَعَةً ۚ (dan rezeki yang banyak) Yakni keluasan rezeki dan tempat tinggal. ثُمَّ يُدْرِكْهُ الْمَوْتُ (kemudian kematian menimpanya) Yakni meninggal sebelum sampai pada tempat yang ia tuju untuk berhijrah. فَقَدْ وَقَعَ أَجْرُهُۥ(maka sungguh telah tetap pahalanya) Yakni pahala hijrah secara sempurna meskipun ia belum sampai di negeri hijrah. عَلَى اللهِ ۗ( di sisi Allah) Yakni pahala itu telah ditetapkan untuknya disisi-Nya dan tidak akan terlupakan. Dari Ibnu Abbas ia berkata: Dhamrah bin Jundub pergi dari rumahnya untuk berhijrah dan ia berkata kepada kaumnya: bawalah aku dan keluarkanlah aku dari negeri syirik ini menuju Rasulullah, namun ia meninggal diperjalanan sebelum ia sampai kepada Rasulullah; maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100 Barangsiapa berhijrah di jalan Allah dengan niat yang baik dan hanya mengharap ridha Allah niscaya mereka mendapati di muka bumi ini tempat hijrah yang luas dan rezeki yang banyak meskipun dalam kekuasaan musuhnya. Barangsiapa keluar dari rumahnya dengan maksud berhijrah kepada Allah dan Rasul-Nya, kemudian kematian menimpa mereka sebelum sampai ke tempat yang dituju, maka sungguh telah tetap pahalanya di sisi Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang kepada orang-orang yang bertaubat. Ayat ini turun untuk Hubaib bin Dhomroh Al laitsi yang merupakan orang yang tua renta, dia ikut hijrah ke Madinah namun di tengah jalan dia wafat dengan mulia. Maka Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berhijrah di jalan Allah niscaya akan mendapatkan di bumi ini tempat berlindung} tempat untuk berpindah yang bisa dikunjungi {yang banyak dan lapang} dalam hal rezeki dan melakukan urusan agama {Siapa saja yang keluar dari rumahnya untuk berhijrah karena Allah dan RasulNya, kemudian meninggal} dia mati sebelum sampai ke tempat hijrah {sungguh telah ditetapkan} telah ditetapkan {pahalanya di sisi Allah. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. Ayat ini sebagai suatu penjelasan sebagai suatu anjuran untuk berhijrah dan dorongan kepada serta penjelasan tetang kemaslahatan yang terkandung di dalamnya, dan Allah Yang Maha menepati janji itu telah menjajikan bahwa barang siapa yang berhijrah kejalanNya dengan hanya mengharap keridhaanNya, ia akan mendapatkan tempat yang luas dan rezeki yang melimpah, tempat yang luas itu mencakup kemaslahatan-kemaslahatan agama, dan rizki yang melimpah mencakup, kemaslahatan-kemaslahatan dunia, yang demikian itu ketika sebagian besar manusia mengira bahwa berhijrah itu akan mengakibatkan perpecahan segala kebersamaan, kekafiran setelah kekayaan, keterhinaan setelah kemilaan dan kesusahan setelah kelapangan, padahal hijrah itu tidaklah demikian, karena sesungguhnya orang Mukmin selama ia masih ada berada di kum Misyirikin, maka agamanya berada dalam kekeritisan, tidak hanya pada ibadah-ibadahnya yang pribadi seperti shalat dan semacamnya, dan tudak juga pada ibadah-ibadahnya yang berhubungan dengan orang yang berjihad dengan perkataan maupun perbuatan dan hal-hal yang mengikutinya, karena ia tidak mampu melakukan hal tersebut, dan ia berada dalam sasaran empukdalam perkara agamanya khususnya jika tergolng orang-orang yang tertindas, namun bila ia berhijrah du jalan Allah, niscaya ia mempu menegakan agama Allah dan sesungguhnya Al-muraggamah itu adalah sebuah katakonpherensif yang mencakup segala hal yang membuat marah musuh-musuh Allah berupa perkataan dan perbuatan, dan juga mengakibatkan perolehan rezeki yang luas, dan sesungguhnya apa yang di kabarkan oleh Allah tersebut benar-benar terjadi. Maka ambilah pelajaran tersebut dari para sahabat sesungguhnya mereka ketika berhijrah di jalan Allah dan meninggalkan negeri, anak-anak, serta harta mereka karena Allah sempurnalah iman mereka dengannya, dan mereka memperoleh keimanan yang sempurna, jihad yang besar, maka pembelaan terhadap agama Allah, di mana mereka menjadi pemimpin bagi orang-orang setelah mereka, denmikian juga mereka memperoleh hal-hal yang diakibatkan oleh hal itu berupa kemenangan-kemenangan dan ghanimah-ghanimah, dimana mereka menjadi orang-orang yang jadi kaya, dan demikianlah, setiap orang yang melakukan apa yang mereka lakukan, niscaya mereka akan memperolah sampai Hari kiamat. Kemudian Allah berfirman, “Barangsiapa keluar dari rumahnya dengan maksud berhijrah kepada Allah dan RasulNya” yaitu bertujuan kepada Rabbnya, keridhaanNya dan kecintaan kepada RasulNya, pembelaan terhadap agama Allah, dan bukan bertujuan selain itu, “kemudian kematian menimpanya (sebelum sampai ke tempat yang dituju),” dengan terbunuh atau selainnya, “maka sungguh telah tetap pahalanya di sisi Allah,” yaitu sesungguhnya ia telah memperoleh pahala orang yang berhijrah yang telah mendapatkan maksudnya dengan jaminan dari Allah, yang demikian itu karena ia telah berniat dan bertekad serta adanya tindakan memulai perbuatan tersebut , maka di antara rahmat Allah kepadanya dan kepada orang-orang yang semisalnya bahwa Allah memberikan pahala untuk mereka secara penuh walaupun mereka belum menyempurnakan perbuatannya, dan Allah mengampuni apa yang teradi dari mereka berupa kelalaian dalam berhijrah dan selainnya, karena itulah Allah menutup ayat ini dengan dua namaNya yang mulia tersebut seraya berfirman, “Dan Allah Maha Pengampun lagi Maha Penyayang.” Allah mengampuni bagi kaum Mukminin apa yang telah mereka lakukan berupa kesalahan-kesalahan, khususnya orang-orang yang bertaubat dan kembali kepada Rabb mereka, Allah Maha Penyayang terhadap seluruh makhluk dengan rahmat yang membuat mereka ada atau hidup, menyehatkan mereka, memberi rizki kepada mereka berupa harta, anak cucu, kekuatan dan lain sebagainya, Maha Penyayang terhadap kaum Mukminin di mana Allah membimbing mereka kepada keimanan, mengajarkan mereka ilmu yang mengakibatkan keyakinan, memudahkan bagi mereka sebab-sebab kebahagiaan dan kemenangan, dan perkara yang membuat mereka memperoleh keuntungan yang besar, mereka akan melihat di antara rahmat dan karuniaNya yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, dan tidak pernah terbesit pada hati seorang manusia pun. Kita memohon kepada Allah agar tidak menahan kebaikanNya karena keburukan yang ada pada diri kita."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 100: Dan barangsiapa berhijrah di jalan Allah, niscaya ia bertemu di bumi itu, tempat perlindungan yang banyak dan keluasan; dan barang siapa keluar dari rumahnya karena berhijrah kepada Allah dan Rasul-Nya, kemudian sampai maut kepadanya, maka sesungguhnya (hijrah )nya itu (wajib) atas Allah, karena Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir berkata: Telah menceritakan kepada kami Ahmad bin Manshur Ar Ramaadiy, ia berkata: Telah menceritakan kepada kami Abu Ahmad Az Zubairiy, ia berkata: Telah menceritakan kepada kami Syuraik dari Amr bin Dinar dari Ikrimah dari Ibnu Abbas ia berkata tentang turunnya ayat ini, \"Innalladziina tawaffahumul malalaaa'ikatu zhaalimii anfusihim,\" bahwa di Mekah ada seorang yang dikenal dengan nama Dhamurah dari Bani Bakar, ia sedang sakit, lalu berkata kepada keluarganya, \"Keluarkanlah aku dari Mekah, karena saya menemukan kebebasan.\" Keluarganya berkata, \"Di mana kami mengeluarkan kamu?\" maka ia berisyarat dengan tangannya ke arah Madinah, maka turunlah ayat ini, \"Wa may yakhruj min baitihi muhaajiran ilallahi wa rasuulih.\" (Hadits ini para perawinya tsiqah, sedangkan Syuraik adalah Ibnu Abdillah Al Qaadhiy An Nakha'iy, dalam hapalannya ada kelemahan. Ibnu Jarir (9/115) juga meriwayatkan dari jalan Sufyan bin Uyainah dari 'Amr bin Dinar ia berkata, \"Saya mendengar Ikrimah.\" Secara mursal. Abdurrazzaq meriwayatkan dari jalan Ibnu Uyainah dari 'Amr, bahwa ia mendengar Ikrimah secara mursal. Namun Muhammad bin Syuraik Al Makkiy menyelisihi Sufyan bin Uyainah; Muhammad meriwayatkan dari 'Amr bin Dinar dari Ikrimah dari Ibnu Abbas secara maushul. Jika memang harus ditarjih, maka yang diperkuat adalah Sufyan bin Uyainah. Imam Ahmad berkata, \"Orang yang paling 'alim tentang 'Amr bin Dinar adalah Ibnu Uyainah.\" Ibnul Madini berkata, \"Ibnu Juraij dan Ibnu Uyainah adalah orang yang paling 'alim terhadap 'Amr bin Dinar.\" Dalam sebagian naskah tertulis \"Muhammad bin Syuraik\" sebagai ganti \"Syuraik\", sedangkan Muhammad bin Syuraik adalah tsiqah, namun Sufyan bin Uyainah lebih tsiqah daripadanya. Dengan demikian yang rajih, hadits tersebut adalah mursal, wallahu 'alam. Akan tetapi hadits tersebut memiliki jalan yang lain yang sampai kepada Ikrimah dari Ibnu Abbas dalam Al Mathaalib Al 'Aliyyah hal. 433 yang diriwayatkan oleh Abu Ya'la, Al Haitsami dalam Al Majma' juz 7 hal. 10 berkata, \"Para perawinya tsiqah.\" Di sana diterangkan, bahwa ia (Dhamurah) wafat di tengah perjalanan sebelum sampai kepada Nabi shallallahu 'alaihi wa sallam, dan diriwayatkan oleh Ibnu Abi Hatim. Al Haafizh menyebutkan beberapa jalan yang lain dalam Al Ishabah pada bagian biografi Janda' bin Dhamurah juz 1 hal. 253 (Diringkas dari Ash Shahiihul Musnad karya Syaikh Muqbil)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 100",
    "description": "Usai mengecam mereka yang enggan berhijrah, pada ayat ini Allah lalu memberi janji dan harapan kepada mereka yang berhijrah. Dan barang siapa berhijrah di jalan Allah dengan niat dan hanya mengharap keridaan Allah, niscaya mereka akan mendapatkan di bumi ini tempat hijrah yang luas dan menemukan rezeki yang banyak. Barang siapa keluar dari rumahnya dengan maksud berhijrah karena Allah dan rasul-Nya, kemudian kematian menimpanya sebelum sampai ke tempat yang dituju dan sebelum kembali ke rumahnya, maka sungguh, pahalanya telah ditetapkan di sisi Allah. Dan Allah maha pengampun atas segala dosa orangorang yang berhijrah atau siapa pun yang memohon ampunannya, dan maha penyayang yang senantiasa mencurahkan aneka rahmatnyadan apabila kamu bepergian di bumi untuk melakukan peperangan atau melakukan perniagaan atau lainnya, maka tidaklah berdosa kamu mengqashar salat, yaitu dengan cara memperpendek jumlah rakaat salat yang empat rakaat menjadi dua rakaat, seperti salat zuhur, asar, dan isya, jika kamu takut diserang atau takut akan bahaya yang ditimbulkan oleh orang-orang kafir yang merupakan musuhmu. Sesungguhnya orangorang kafir itu adalah musuh yang nyata bagimu."
  }
]