[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian menempuh perjalanan jauh (wahai kaum Mukminin) dimuka bumi Allah,maka tidak ada masalah dan tidak ada dosa untuk mengqashar shalat,bila kalian mengkhawatirkan serangan musuh kepada kalian saat kalian tengah mengerjakan shalat.Dahulu kebanyakan safar kaum Muslimin pada awal perkembangan islam diliputi rasa ketakutan. Dan setelah itu,mengqashar shalat merupakan rukhsakh (keringanan) dalam perjalanan dalam keadaan aman maupun saat dilanda rasa ketakutan. Sesungguhnya orang-orang kafir menampakkan permusuhan kepada kalian secara terang-terangan,maka berhati-hatilah kalian terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Apabila kalian bepergian di muka bumi, maka tidak ada dosa bagi kalian untuk mengqasar salat dari empat rakaat menjadi dua rakaat, jika kalian merasa khawatir akan mengalami sesuatu yang buruk dari orang-orang kafir (Kalian juga boleh mengqasar dalam kondisi aman sebagaimana disebutkan dalam sunah). Sesungguhnya permusuhan orang-orang kafir terhadap kalian sangat nyata dan jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101-102. Setelah Allah berfirman mengenai perkara jihad, maka kemudian dalam ayat ini Allah menyebutkan hukum-hukum yang bersangkutan dengan orang yang pergi bersafar menuju jihad atau berhijrah dijalan Allah, yaitu ketika dia hendak menjalankan salat namun takut terhadap serangan musuh. Maka jika kalian melakukan sesuatu Safar maka tidak mengapa bagi kalian meng-qashar salat dengan syarat kalian merasa takut dari serangan orang-orang kafir. Hai Rasulallah, jika engkau bersama kelompok orang-orang beriman kemudian engkau hendak menjalankan salat dengan mereka maka hendaklah engkau menjadikan mereka dua kelompok kemudian hendaklah salah satu dari kelompok tersebut mendirikan salat terlebih dahulu denganmu, sedangkan kelompok yang lain menghadap ke arah musuh untuk menjaga orang-orang yang salat agar tidak diserang. Dan hendaklah kelompok yang mendirikan salat bersamamu itu menyandang senjata-senjata mereka dan tidak meletakkannya pada waktu salat. Apabila kelompok yang mendirikan salat bersamamu ini telah sampai pada posisi sujud maka hendaklah orang-orang yang menjaga kalian itu berada di belakang kalian karena penjagaan yang paling dibutuhkan pada waktu salat adalah ketika di posisi sujud sebab mereka tidak dapat melihat siapa yang akan menyerang mereka. Kemudian kelompok kedua yang belum menjalankan salat karena sibuk melakukan penjagaan itu hendaklah menjalankan salat sebagaimana kelompok pertama menjalankannya, dan hendaklah mereka senantiasa dalam keadaan siaga dan menyandang senjata ketika salat sebagaimana yang dilakukan oleh kelompok sebelumnya. Dan musuh-musuh kalian yang kafir terhadap Allah dan apa yang telah diturunkan kepada kalian menginginkan Seandainya kalian meletakkan senjata dan meninggalkan barang-barang kalian karena sibuk menjalankan salat, agar mereka dapat menyerang kalian secara frontal dan membuat pukulan telak bagi kalian sehingga mereka dapat membunuh dan merampas harta benda kalian, maka janganlah kalian lalai dari mereka. Namun tidak berdosa bagi kalian jika kalian meletakkan senjata ketika hujan deras mengguyur kalian sehingga memberatkan kalian untuk menyandang senjata, atau kalian sedang terluka atau sakit; namun wajib bagi kalian untuk tetap bersiap siaga dalam setiap keadaan apapun, dan janganlah kalian lalai terhadap diri, senjata, dan barang-barang kalian; sebab musuh-musuh kalian sama sekali tidak lalai dan tidak mengasihi kalian. Allah telah memberikan petunjuk untuk menempuh sebab-sebab kemenangan, yaitu dengan senantiasa bersiap siaga dan mengharap pertolongan dengan selalu bersabar dan mendirikan salat demi mendapatkan balasan dan pahala di sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. وَإِذَا ضَرَبْتُمْ فِى الْأَرْضِ (Dan apabila kamu bepergian di muka bumi) Yakni melakukan safar. فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَقْصُرُوا۟ مِنَ الصَّلَوٰةِ (maka tidaklah mengapa kamu men-qashar sembahyang(mu)) Dalam ayat ini terkandung dalil bahwa mengqashar shalat tidak wajib atas orang yang melakukan safar, namun baginya pilihan, apabila ia menghendaki ia mengqashar atau menyempurnakan rakaat shalatnya. Dan makna mengqashar shalat adalah menjadikan shalat yang empat rakaat menjadi dua rakaat ketika ia dalam perjalanan/safar. إِنْ خِفْتُمْ أَن يَفْتِنَكُمُ الَّذِينَ كَفَرُوٓا۟ ۚ (jika kamu takut diserang orang-orang kafir) Secara tekstual ayat ini menunjukkan bahwa mengqashar shalat saat safar hanya boleh dilakukan dalam keadaan takut dari serangan orang-orang kafir dan tidak boleh dilakukan ketika dalam keadaan aman; akan tetapi sunnah Rasulullah telah menunjukkan bahwa Rasulullah juga mengqashar shalat ketika dalam keadaan aman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101 Apabila kamu bepergian di muka bumi, maka tidaklah mengapa kamu mengqashar sholatmu yang berjumlah empat rakaat dengan hanya dua rakaat saja. Jika kamu takut diserang orang-orang kafir yaitu dibunuh atau disiksa. Begitu juga boleh kalian mengqashar ketika waktu aman atau damai. Sesungguhnya orang-orang kafir itu adalah musuh yang nyata bagimu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kalian bepergian} berpergian {di bumi, maka tidak dosa bagi kalian} kesalahan dan dosa {untuk mengqasar shalat jika kalian takut diserang} kalian ditimpa hal buruk {orang-orang kafir. Sesungguhnya orang-orang kafir itu adalah musuh yang nyata bagi kalian} musuh yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Dua ayat ini adalah dasar dari rukhsoh untuk mengqashar dan untuk shalat saat takut (shalat khauf), Allah berfirman, ”Dan apabila kamu bepergian di muka bumi” yaitu bersafar, lahiriyah ayat ini menunjukan keringanan untuk mengqashar shalat dalam perjalanan apa pun, walaupun perjalalnan kemaksiatan, sebagaimana yang diyakini oleh madzhab Abu Hanifah, namun berbeda dengan jumhur ulama, yaitu tiga imam selain mereka, mereka tidaklah memberlakukan adanya rukhshah pada perjalanan maksiat, sebagai pengkhususan bagi ayat ini dengan arti maupun kesesuaiannya, karena sesungguhnya rukhshah tersebut merupakan kemudahan dari Allah untuk hamba hambaNya apabila mereka bermusafir agar mereka mengqasharkan shalat dan membatalkan puasanya, dan orang pelaku maksiat dalam safarnya tidaklah pantas mendapatkan keringanan. Dan firmanNya, “Maka tidaklah mengapa kamu mengqashar di antara shalat(mu),” maksudnya, tidak ada salahnya dan tidak ada dosanya atas kalian dalam hal tersebut, namun hal itu tidaklah meniadakan bahwa qashar tersebut adalah lebih utama, karena peniadaan dosa adalah sebuah penghapusan atas beberapa keraguan yang terjadi pada sebgian besar manusia, bahkan tidak juga meniadakan kewajiban, sebagaimana yang telah berlalu pada surat al-Baqarah pada firman Allah, “Sesungguhnya Shafa dan Marwa adalah sebagian dari syi’ar Allah.” (Al-Baqarah: 158). Penghapusan keraguan dalam hal ini adlah sesuatu yang jelas sekali, karena shalat itu telah tetap bagi kaum Muslimin tentang hukumnya yang wajib dengan bentuk yang sempurna tersebut, dan tidaklah hal ini menghapus dari jiwa kebanyakan orang-orang kecuali dengan menyebutkan perkara yang meniadakannya. Perkara yang menunjukkan akan keutamaan Qashar daripada menyempurnakan ada dua hal: Pertama, konsistennya Nabi SAW dalam mengqashar shalat pada seluruh perjalanannya, dan kedua, bahwa hal itu adalah suatu bentuk keringanan, kemudahan, dan rahmat bagi hamba, dan Allah SWT menyukai bila keringanan dariNya itu dilakukan sebagaimana Allah SWT membenci kemaksiatan kepadaNya itu dikerjakan. Dan FirmanNya, “Kamu mengqashar shalatmu,” dalam hal itu ada dua faidah: Pertama, bahwa seandainya Allah berfirman “Kamu mengqashar shalatmu,” niscaya qashar tersebut tidaklah terbatasi oleh batasan tertentu, dan kemungkinan saja akan diduga oleh seseorang bahwa dengan mengqashar seluruh shalat dalam satu rakaat saja telah mencukupinya, maka Allah memakai kata dalam FirmanNya, “Diantara shalat(mu),” agar hal itu menunjukkan bahwa qashar itu tebatasi dan teratur agar hal itu menunjukkan kepada perbuatan Nabi SAW dan para sahabatnya, dan kedua, bahwasanya kata, “min” menunjukkan pembagian agar diketahui bahwa mengqashar itu hanyalah beberapa shalat wajib saja dan bukan semuanya, karena shalat Shubuh dan Maghrib tidak diqashar, adapun yang diqashar adalah shalat-shalat yang empat rakaat saja, dari empat menjadi dua. Dan bila telah tetap bahwa shalat qashar itu merupakan suatu keringanan dalam safar, namun ketahuilah bahwa para ahli Tafsir berbeda pendapat tentang batasan tersebut, yaitu FirmanNya, “Jika kamu takut diserang orang-orang kafir” dimana lahiriayahnya menunjukkan bahwa tidaklah qashar itu boleh dilakukan kecuali dengan adanya dua perkara secara bersamaan yaitu safar dan rasa takut. Pangkal dari perselisihan mereka adalah tentang maksud dari FirmanNya, “Kamu mengqashar” jumlah saja atau mengqashar jumlah dan sifatnya? Dan yang masalah adalah yang terjadi pada hal pertama saja, sesungguhnya hal ini telah dipermasalahkan oleh Amirul Mukminin Umar Bin Al-Khattab R.A hingga beliau bertanya tentang hal tersebut kepada Rasulullah SAW seraya berkata, “Wahai Rasulullah SAW, mengapa kita harus mengqashar shalat padhal kita sudah merasa aman?” Maksudnya, Allah telah berfirman, “Jika kamu takut diserang orang-orang kafir,” maka Rasulullah SAW bersabda “Ia adalah sebuah sedekah yang diberikan oleh Allah SWT kepada kalian, maka terimalah sedekah Allah tersebut,” atau sebagaimana yang beliau sabdakan. Atas dasar ini maka batasan tersebut disebutkan karena merupakan kondisi yang paling banyak terjadi pada Nabi SAW beserta para sahabatnya, karena kebanyakan dari pejalanan Nabi adalah perjalanan perjalanan dalam rangka jihad. Dalam hal ini ada faidah yang lain, yaitu penjelasan tentang hikmah dan kemaslahatan dalam syariat rukhshah tersebut, Allah menjelaskan dalam ayat ini batasan perkara yang dapat dibayangkan berupa kesulitan yang sesuai untuk keringanan tersebut, yaitu bersatunya safar dengan rasa takut, namun hal itu tidaklah melazimkan untuk tidak mengqashar pada safar saja, karena safar merupakan suatu kondisi yang selalu dihadapkan dengan kesulitan. Adapun menurut bentuk yang kedua yaitu yang dimaksud dengan qashar disini adalah mengqashar bilangan dan sifatnya, karena sesungguhnya syrat tersebut sesuai dengan babnya, dan bila ditemui adanya safar dan rasa takut, maka boleh mengqashar jumlah dan sifat shalat, dan bila hanya safar saja yang ditemui, maka hanya mengqashar jumlah saja yang dibolehkan, atau bila ditemui takut saja, maka boleh mengqashar sifatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 101: Dan apabila kamu bepergian di bumi, kamu tidak mengapa maka bahwa kamu meng- atas qashar sembahyang jika kamu takut bahwa orang-orang yang kafir itu akan mengganggu kamu, karena sesungguhnya kafir-kafir itu adalah bagi kamu musuh yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata-kata \"tidak berdosa\" untuk menyingkirkan rasa was-was atau keberatan mengqashar shalat karena tidak biasa dilakukan. Qashar artinya meringkas, bisa meringkas 'adad (jumlah), yakni dengan mengerjakan shalat yang empat rakaat menjadi dua rakaat, dan bisa maksudnya qashrush sifat, yaitu meringankan rukun-rukun shalat yang 2 rakaat itu, ketika dalam perjalanan dan saat kondisi khauf (khawatir). Mengerjakan dua rakaat shalat yang empat rakaat tersebut dilakukan karena dalam perjalanan, dan meringankan sifat dilakukan karena kondisi khauf (mengkhawatirkan serangan musuh). Namun jika dalam perjalanan yang tidak mengkhawatirkan, maka hanya berlaku qashar jumlah, yakni mengerjakan shalat yang empat rakaat menjadi dua rakaat, sedangkan jika tidak dalam perjalanan (hadhar), tetapi kondisi mengkhawatirkan, maka berlaku qashrush sifat, yakni memberikan keringanan rukun-rukun shalat seperti pada shalat khauf yang disebutkan pada ayat selanjutnya. Menurut Imam Syafi'i, mengqashar adalah rukhshah (kelonggaran) sehingga tidak wajib. Namun demikian, hal itu tidaklah menafikan keutamaan qashar. Bahkan mengqashar lebih utama berdasarkan beberapa alasan: Pertama, Nabi shallallahu 'alaihi wa sallam senantiasa mengqashar shalatnya ketika safar. Kedua, mengqashar merupakan bentuk kelonggaran dan rahmat (kasih sayang) Allah kepada hamba-hamba-Nya, dan Allah Subhaanahu wa Ta'aala suka apabila rukhshah-Nya dikerjakan sebagaimana Dia tidak suka maksiat dikerjakan. Zhahir ayat ini adalah bahwa qashar shalat yang berjumlah empat menjadi dua tidak dilakukan kecuali ada dua sebab, yaitu safar dan kondisi mengkhawatirkan, oleh karena itu Umar bin Khaththab radhiyallahu 'anhu sampai bertanya kepada Rasulullah shallallahu 'alaihi wa sallam, \"Wahai Rasulullah, mengapa kita mengqashar shalat, padahal kita dalam keadaan aman?\" Maka Rasulullah shallallahu 'alaihi wa sallam bersabda: « صَدَقَةٌ تَصَدَّقَ اللَّهُ بِهَا عَلَيْكُمْ فَاقْبَلُوا صَدَقَتَهُ » . \"Ia adalah sedekah, di mana Allah memberikannya kepada kamu, maka terimalah sedekah itu.\" Dengan demikian, meskipun kita tidak dalam kondisi mengkhawatirkan, mengqashar shalat dalam safar tetap disyari'atkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 101",
    "description": "Dan apabila kamu bepergian di bumi untuk melakukan peperangan atau melakukan perniagaan atau lainnya, maka tidaklah berdosa kamu mengqashar salat, yaitu dengan cara memperpendek jumlah rakaat salat yang empat rakaat menjadi dua rakaat, seperti salat zuhur, asar, dan isya, jika kamu takut diserang atau takut akan bahaya yang ditimbulkan oleh orang-orang kafir yang merupakan musuhmu. Sesungguhnya orangorang kafir itu adalah musuh yang nyata bagimukalau pada ayat sebelumnya Allah memberikan kemudahan kepada kaum muslim untuk meng-qashar salat dalam perjalanan dan karena rasa takut, maka pada ayat ini Allah menjelaskan tata cara pelaksanaan salat itu. Dan apabila suatu ketika ada situasi yang membahayakan keselamatan, seperti karena adanya musuh dan ketika itu engkau, wahai nabi Muhammad, berada di tengah-tengah mereka, para sahabatmu, lalu engkau hendak melaksanakan salat khauf bersama-sama mereka, maka hendaklah segolongan dari mereka berdiri besertamu untuk melaksanakan salat dan segolongan yang lain menghadapi musuh yang mungkin dapat melakukan penyerangan terhadapmu dan yang bersamamu itu hendaklah menyandang senjata mereka. Kemudian apabila mereka yang salat besertamu itu melakukan sujud, yakni telah menyempurnakan satu rakaat atau telah selesai melaksanakan salat, maka hendaklah mereka itu pindah dari belakangmu untuk menghadapi musuh dan berjaga-jaga seperti yang telah dilakukan oleh kelompok yang sebelumnya, dan hendaklah datang golongan yang lain, yakni golongan kedua, yang belum salat, lalu mereka melakukan salat seperti kelompok pertama melakukannya denganmu, dan hendaklah mereka bersiap siaga dan menyandang senjata mereka. Hal ini dilakukan karena orang-orang kafir ingin dengan keinginan dan harapan yang besar agar kalian lengah terhadap senjatamu dan harta bendamu, lalu mereka menyerbu kamu sekaligus. Dan tidak ada dosa atas kamu meletakkan senjata-senjatamu, jika kamu mendapat suatu kesusahan atau kesulitan yang disebabkan karena hujan yang menyebabkan rusaknya senjata kamu atau karena kamu sakit yang menyebabkan kamu tidak dapat menyandang senjatamu, dan bersiap siagalah kamu menghadapi berbagai kemungkinan yang terjadi pada kalian akibat dari dua kondisi itu. Sungguh, Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir itu, baik di dunia maupun di akhirat."
  }
]