[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kamu (wahai nabi),berada di medan pertempuran, lalu kamu hendak mengerjakan shalat bersama mereka,maka hendaknya satu kelompok dari mereka berdiri untuk mengerjakan shalat bersamamu, dan hendaknya mereka tetap menyandang senjata-senjata mereka. lalu apabila mereka telah bersujud,hendaknya pasukan lain yang berada di belakang kalian menghadapi musuh kalian,sedang jamaah pasukan pertama menyempurnakan rakaat kedua dan bersalam.Kemudian datang jamaah pasukan yang belum mengerjakan shalat dan bermakmum kepadmu dalam rakaat pertama mereka,kemudian mereka menyelesaikan rakaat kedua sendiri. Dan hendaknya mereka selalu waspada terhadap musuh-musuh mereka dan hendaklah mereka menyandang senjata-senjata mereka.Orang-orang yang ingkar terhadap agama Allah menginginkan agar kalian itu lengah terhadap senjata dan perbekalan kalian,sehingga mereka dapat menyerbu kalian dengan satu srangan sekaliagus dan berhasil menghabisi kalian.Dan tidak ada dosa bagi kalian di waktu itu,tatkala ada sesuatu gangguan pada diri kalian seperti kondisi hujan atau kalian dalam kondisi sakit untuk meletakkan senjata-senjata kalian,dengan tetap waspada penuh.Sesungguhnya Allah telah menyediakan bagi orang-orang yang mengingkari agamaNYA siksaan yang akan menghinakan dan menistakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Apabila kamu -wahai Rasul- berada di tengah-tengah pasukan pada saat berperang melawan musuh, kemudian kamu hendak menunaikan salat bersama mereka, maka bagilah pasukan itu menjadi dua kelompok. Salah satu kelompok berdiri untuk menunaikan salat bersamamu. Dan hendaklah mereka membawa senjata mereka di dalam salat. Sedangkan kelompok yang lain bertugas menjaga kalian. Kemudian apabila kelompok yang pertama telah menunaikan salat satu rakaat bersama imam, mereka menyempurnakan salat mereka sendiri (dengan menambah satu rakaat). Setelah selesai salat, hendaklah mereka berada di belakang kalian sembari menghadap ke arah musuh. Dan hendaklah kelompok kedua yang tadinya berjaga-jaga dan belum menunaikan salat itu datang untuk menunaikan salat satu rakaat bersama imam. Kemudian apabila imam selesai salam, mereka harus menyempurnakan salat mereka sendiri (dengan menambah satu rakaat). Dan hendaklah mereka waspada terhadap musuh dan selalu membawa senjata mereka. Karena orang-orang kafir senantiasa berharap saat-saat kalian lengah terhadap senjata dan barang-barang bawaan kalian ketika sedang menunaikan salat, kemudian mereka menyerang kalian secara serentak dan menangkap kalian di saat kalian lengah. Tidak ada dosa bagi kalian jikalau kalian mendapatkan suatu gangguan akibat turunnya hujan, atau jatuh sakit, dan semacamnya, lalu kalian menaruh senjata kalian dan tidak membawanya. Waspadalah terhadap musuh kalian dengan mengerahkan segala kemampuan kalian. Sesungguhnya Allah telah menyiapkan azab yang menghinakan bagi orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. وَإِذَا كُنتَ فِيهِمْ (Dan apabila kamu berada di tengah-tengah mereka) Ini adalah kalimat yang ditujukan bagi Rasulullah dan bagi orang setelahnya yang memegang kekuasaan atau pemerintahan. Hendaklah mereka mengerjakan shalat dengan orang-orang yang bersamanya shalat khauf (ketika dalam keadaan takut), dan para sahabat dahulu mengerjakan shalat khauf ini berkali-kali setelah wafatnya Rasulullah -sebagaimana telah diketahui-. فَلْتَقُمْ طَآئِفَةٌ مِّنْهُم مَّعَكَ (maka hendaklah segolongan dari mereka berdiri (shalat) besertamu) Yakni setelah kamu menjadikan mereka dua kelompok; satu kelompok berdiri menghadap musuh dan kelompok lain berdiri bersamamu untuk shalat. وَلْيَأْخُذُوٓا۟ أَسْلِحَتَهُمْ (dengan menyandang senjata mereka) Yakni kelompok yang mendirikan shalat bersamamu dan kelompok yang menghadap musuh harus senantiasa menyandang senjata. Dan yang dimaksud adalah membawa senjata mereka agar mudah untuk mengambil dan menggunakannya ketika dibutuhkan dan agar dapat memutuskan harapan para musuh untuk mencari kesempatan menyerang. فَإِذَا سَجَدُوا۟ (kemudian apabila mereka (yang shalat besertamu) sujud) Yakni apabila kelompok yang bersenjata itu telah bersujud; yakni telah menyempurnakan rakaat atau menyempurnakan shalat. فَلْيَكُونُوا۟ مِن وَرَآئِكُمْ(maka hendaklah mereka pindah dari belakangmu) Maka hendaklah mereka pindah menghadap musuh untuk berjaga-jaga. وَلْتَأْتِ طَآئِفَةٌ أُخْرَىٰ( dan hendaklah datang golongan yang kedua) Yakni kelompok kedua yang sebelumnya menghadap musuh dan belum mendirikan shalat. فليصلوا معك (maka hendaklah mereka mendirikan shalat bersamamu) Yakni sebagaimana sifat shalat yang dilakukan oleh kelompok pertama. وَلْيَأْخُذُوا۟ (dan hendaklah mereka) Yakni kelompok yang kedua. حِذْرَهُمْ وَأَسْلِحَتَهُمْ ۗ( bersiap siaga dan menyandang senjata) Dalam ayat ini tidak dijelaskan berapa rakaat yang dilakukan oleh tiap-tiap kelompok. Dan shalat khauf disebutkan dalam sunnah dengan cara yang berbeda-beda dan sifat-sifat yang beragam dan semuanya benar dan sah, maka barangsiapa yang menjalankannya dengan salah satu cara maka ia telah menjalankan apa yang diperintahkan; dan silahkan merujuk kitab-kitab hadist untuk mempelajarinya lebih dalam dan menyesuaikannya dengan ayat ini. فَيَمِيلُونَ عَلَيْكُم مَّيْلَةً وٰحِدَةً ۚ (lalu mereka menyerbu kamu dengan sekaligus) Yakni mengerahkan seluruh kekuatan sekaligus agar tidak membutuhkan serangan kedua. أَن تَضَعُوٓا۟ أَسْلِحَتَكُمْ ۖ (meletakkan senjata-senjatamu) Allah memberi keringanan kepada mereka untuk bisa meletakkan senjata apabila mereka mendapat gangguan seperti hujan atau dalam keadaan sakit. Kemudian Allah memerintahkan mereka untuk senantiasa bersiap siaga agar mereka tidak diserang musuh ketika dalam keadaan lengah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan firman Allah : { وَإِذَا كُنْتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلَاةَ } \"Dan apabila kamu berada di tengah-tengah mereka (sahabatmu) lalu kamu hendak mendirikan shalat bersama-sama merek\", pada lafazh { لَهُمُ } menunjukkan bahwasanya seorang Imam hendaklah senantiasa lebih memperhatikan shalatnya, dan keadaan shalat orang-orang yang menjadi makmumnya, karena dalam shalatnya ia juga memikul tanggung jawab shalat makmumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102 Apabila kamu berada di tengah-tengah sahabatmu lalu kamu hendak mendirikan shalat bersama-sama mereka, maka jadilah imam untuk para tentara. Shalatlah bersama para tentara dari golongan sahabatmu, jadikanlah mereka dua golongan. Hendaklah segolongan dari mereka berdiri (shalat) besertamu dan menyandang senjata sebagai persiapan atas berbagai keadaan, sedangkan yang lain mengawasi/menghadapi musuh. Kemudian apabila mereka yang shalat besertamu telah sujud dan telah menyempurnakan satu rakaat, maka hendaklah mereka salam dan pindah dari belakangmu untuk menghadapi musuh. Kemudian hendaklah datang golongan yang kedua untuk menyempurnakan sholat, lalu bersembahyanglah mereka denganmu. Sehingga dengan begitu semua kelompok telah melakukan sholat bersamamu, dan hendaklah mereka bersiap siaga dan menyandang senjata sebagai kemungkinan bahwa orang-orang kafir menunggu kalian lengah dari senjata kalian, sehingga itu menyebabkan mereka bisa membunuh kalian dengan satu tikaman untuk mengalahkan kalian.Tidak ada dosa atasmu meletakkan senjata-senjatamu, jika kamu mendapat sesuatu kesusahan karena hujan atau karena kamu memang sakit; dan siap siagalah kamu. Sebagaimana kalian menjauhi senjata kalian sehingga musuh kalian terkena tipu daya kalian. Sesungguhnya Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir itu. Ayat ini turun ketika orang mukmin sholat dhuhur berjamaah bersama Rasul, orang-orang musyrik berkata: mereka telah mengira bahwa kami akan terkena tipu daya mereka. Mereka berkata: telah datang waktu sholat yang lebih mereka cintai daripada orang tua mereka yaitu sholat Ashar. Kemudian Jibril turun dengan ayat ini pada waktu antara dhuhur dan ashar. Mereka berada di lembah usfan dan di depan orang-orang musyrik ada Khalid bin Walid, mereka di antara orang-orang musyrik dan kiblat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kamu berada di tengah-tengah mereka, lalu kamu hendak melaksanakan shalat bersama mereka} lalu kamu hendak mendirikan shalat dengan mereka {hendaklah segolongan dari mereka berdiri bersamamu dengan menyandang senjatanya. Apabila mereka telah sujud} shalat {hendaklah mereka pindah dari belakang kalian} maka hendaklah mereka pindah dari belakang orang-orang yang shalat untuk berdiri menghadapi musuh {Lalu hendaklah datang golongan lain yang belum shalat agar mereka shalat bersamamu dan hendaklah mereka bersiap siaga} waspada {dengan menyandang senjatanya. Orang-orang kafir ingin} berharap {agar kalian lengah terhadap senjata dan harta benda kalian, lalu mereka menyerbu} menyerbu {kalian secara tiba-tiba} satu serbuan supaya mereka bisa mengagetkan kalian {Tidak ada dosa} tidak ada kesalahan {bagi kalian meletakkan senjata jika kalian mendapat suatu kesusahan, baik karena hujan maupun karena sakit dan bersiap siagalah kalian. Sesungguhnya Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Karena itulah Allah menyebutkan setelahnya tata cara dari shalat khauf dalam FirmanNya, “Dan apabila kamu berada di tengah tengah mereka (sahabatmu) lalu kamu hendak mendirikan shalat bersama sama mereka.” Maksudnya, engkau shalat menjadi imam bersama mereka, dimana engkau menegakkannya, menyempurnakan aturan aturannya, dan melakukan apa yang memang wajib bagimu dan bagi mereka, kemudian Allah menafsirkan sendiri hal tersebut seraya berfirman, “Maka hendaklah segolongan dari mereka berdiri (shalat) besertamu,” maksudnya, dan sekelompok lagi berjaga menghadap musuh, sebagaimana yang ditunjukan oleh kalimat selanjutnya,”Kemudian apabila mereka sujud” yaitu orang orang yang shalat besertamu, maksudnya, mereka telah menyempurnakan shalat, dan Allah mengungkapkan maksud shalat dengan kata sujud untuk menjelaskan tentang keutamaan sujud dan bahwasannya ia adlah merupakan salah satu rukun diantara rukun-rukun shalat, bahkan ia merupakan rukun yang paling utama, ”Maka hendaklah mereka pindah dari belakangmu (untuk menghadap musuh) dan hendaklah datang golongan yang kedua yang belum shalat,” Meraka itu adalah kelompok pertama yang berjaga menghadap musuh, “lalu shalatlah mereka denganmu,” hal ini menunjukan bahwa imam tidaklah beranjak dari tempatnya setelah bubarnya kelompok pertama yang shalat bersamanya dengan maksud menunggu kelompok kedua, dan bila mereka telah berdiri dan siap shalat, maka ia melanjutkan shalat yang tersisa darinya, kemudian imam duduk sambil menunggu para makmum dengan menyempurnakan shalat mereka dahulu kemudian imam salam bersama mereka. Ini adalah salah satu tata cara dari shalat khauf, karena sesungguhnya banyak sifat-sifat shalat khauf yang shahih dari Nabi SOLALLOHU 'ALAIHI WASALLAM, dan kesemuanya boleh dilakukan. Ayat ini menunjukan bahwa shalat jama’ah itu wajib ‘ain, hal ini karena dua alasan: Pertama, bahwasannya Allah TA'ALA memerintahkan hal tersebut dalam kondisi yang berat seperti ini, yaitu saat memuncaknya rasa takut terhadap musuh dan rasa kewaspadaan terhadap serangan mereka, dan bila Allah mewajibkan hal tersebut pada kondisi yang segmenting itu, maka kewajibannya dalam kondisi yang tenang dan aman adalah lebih utama dan lebih patut. Kedua, bahwa orang-orang yang shalat khauf banyak meninggalkan syarat-syarat dan hal-hal wajib dalam shalat biasa, dan banyak sekali dibiarkan dari mereka perbuatan-perbuatan yang membatalkan shalat pada selain shalat khauf, hali itu tidaklah menunjukan kecuali hanya untuk menegaskan akan wajibnya shalat dengan yang sunnah, dan sekiranya bukan karena wajibnya shalat jama’ah, niscaya semua hal-hal yang wajib itu tidaklah boleh ditinggalkan. Dan ayat yang mulia ini juga menunjukan bahwa yang paling utama dan paling baik adalah agar mereka shalat bersama satu imam saja walaupun hal itu mengandung suatu cacat yang tidak menjadi suatu hal yang kurang sekiranya mereka shalat dengan beberapa imam, yang demikian itu adalah demi bersatunya kalimat kaum Muslimin, keselarasan mereka dan tidak bercerai berainya kesatuan mereka, dan agar hal tersebut menjadi suatu faktor yang memberi rasa takut kepada musuh-musuh mereka. Allah TA'ALA memerintahkan untuk menyandang senjata dan bertindak waspada dalam mengerjakan shalat khauf, yang demikian itu walaupun terlihat mengandung suatu gerakan dan kesibukan di luar amalan-amalan shalat namun sesungguhnya di balik itu terdapat maslahat yang sangat besar dan lebih di utamakan, yaitu menyatukan antara shalat, berjihad, dan bertindak waspada dari musuh yang sangat berusaha keras dalam mengalahkan kaum Muslimin, menyerbu mereka, dan menjarah harta-harta benda mereka, karena itulah Allah berfirman,”Orang-orang kafir ingin supaya kamu lengah terhadap senjatamu dan harta bendamu,lalu meraka menyerbu kamu dengan sekaligus.” Kemudian Allah TA'ALA memaafkan orang-orang yang memiliki udzur berupa sakit atau karena hujan untuk meletakkan senjata mereka, akan tetapi mereka tetap harus bertindak waspada dalam FirmanNya, “Dan tidak ada dosa atas meletakkan senjata-senjatamu, jika kamu mendapat suatu kesusahan karena hujan atau karena kamu memang sakit, dan siap siagalah kamu. Sesungguhnya Allah menyediakan azab yang menghinakan bagi orang-orang kafir itu,” dan diantara siksaan yang menghinakan itu adalah apa yang telah diperintahkan oleh Allah TA'ALA kepada golonganNya yaitu orang-orang yang beriman dan para penolong agamaNya, serta orang-orang yang bertauhid untuk membunuh dan memerangi mereka dimana saja kaum Muslimin itu menemui mereka, menyerang mereka, mengepung mereka, dan mencari mereka pada segala pada segala penjuru, mengancam mereka dalam setiap kondisi serta tidak lengah dari mereka karena dikhawatirkan kaum kafir memperoleh beberapa keinginan mereka terhadap kaum Mukminin, maka milik Allah saja pujian dan sanjungan yang terbesar atas apa yang telah dikaruniakanNya terhadap kaum Mukminin dan pembelaanNya atas mereka dengan pertolonganNya dan instruksi-instruksiNya, dimana bila kaum Muslimin itu menempuhnya secara sempurna, niscaya tidaklah aka nada suatu kaum yang akan mengalahkan mereka dan tidaklah ada suatu musuh yang akan menguasai meraka dalam waktu kapanpun. Dan FirmanNya, “Kemudian apabila mereka (yang shalat besertamu) sujud (telah menyempurnakan satu rakaat), maka hendaklah mereka pindah dari belakangmu (untuk menghadapi musuh)” menunjukkan bahwa kelompok pertama tersebut menyempurnakan seluruh shalat mereka sebelum mereka beranjak pergi ke tempat penjagaan, dan bahwasanya Rasulullah SOLALLOHU 'ALAIHI WASALLAM tetap diam untuk menunggu kelompok selanjutnya sebelum beliau salam, karena telah disebutkan di atas bahwa kelompok tersebut berdiri bersama beliau menegakkan shalat, lalu Allah mengabarkan tentang keikutsertaan mereka dalam shalat, kemudian Allah menyandarkan perbuatan tersebut kepada kelompok itu saja tanpa menyandarkannya kepada Rasul, maka hal ini menunjukkan bahwa maksudnya adalah seperti yang telah kita sebutkan di atas. Dan dalam FirmanNya. “Dan hendaklah datang golongan yang kedua yang belum shalat, lalu shalatlah mereka denganmu” sebuah dalil bahwa kelompok pertama telah menyelesaikan shalat, dan bahwa seluruh shalat kelompok yang kedua bersama imam menurut realitanya pada rakaat pertama dan menurut hukumya pada rakaat mereka yang terakhir, dimana hal itu mengharuskan imam menunggu hingga mereka menyempurnakan shalat mereka, kemudian imam salam bersama mereka, hal ini sangatlah jelas bagi orang yang memperhatikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 102: Dan jika engkau ada di an- tara mereka (dalam peperangan) lalu engkau dirikan sembah yang meng-imami mereka, maka hendak- lah segolongan dari mereka ber- diri bersamamu,) dan hendaklah mereka pegang senjata-senjata mere- ka: lantas apabila mereka sudah sujud, maka hendaklah mereka ada di belakang kamu; lantas hendaklah datang segolongan lain vang belum sembahyang, maka hendaklah mereka sembahyang ber- samamu, dan hendaklah mereka ambil penjagaan mereka dan (pegang) Orang-orang yang kafir itu ingin jika kamu lalai daripada senjata- senjata kamu dan barang-barang kamu, lantas mereka bisa membawa senjata-senjata mereka. Akan tetapi tidak mengapa atas kamu jika ada halangan bagi kamu dari hujan atau adalah kamu sakit- bahwa kamu taroh senjata-senjata kamu, tetapi hendaklah kami ambil penjagaan Allah telah sediakan bagi orang- orang kafir itu adzab yang meng- hina. Surah ke 4 kamu. Sesungguhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sedangkan segolongan lagi berjaga-jaga. Allah Subhaanahu wa Ta'aala memerintahkan menyandang senjata dan bersiap siaga dalam shalat khauf meskipun di sana terdapat gerakan dan menyibukkan diri dengan sesuatu yang mengalihkan dari sebagian keadaan shalat, namun di sana terdapat maslahat yang besar, yaitu menggabung antara shalat, jihad dan bersiap siaga terhadap musuh yang berusaha mencari saat di mana kaum muslimin lengah. Yakni apabila telah selesai satu rakaat, maka diselesaikan satu rakaat lagi sendiri-sendiri, sedangkan Nabi shallallahu 'alaihi wa sallam duduk menunggu golongan yang kedua. Yaitu rakaat yang pertama, sedangkan rakaat yang kedua mereka selesaikan sendiri-sendiri dan mereka mengakhiri shalat bersama dengan Nabi shallallahu 'alaihi wa sallam. Cara di atas adalah salah di antara cara shalat khauf yang dipraktekkan Rasulullah shallallahu 'alaihi wa sallam. Dalam ayat ini juga terdapat dalil bahwa shalat berjama'ah hukumnya fardhu 'ain, karena Allah Subhaanahu wa Ta'aala memerintahkan shalat berjama'ah dalam kondisi yang mengkhawatirkan ini. Jika dalam kondisi seperti ini masih diperintahkan shalat berjama'ah, maka dalam kondisi aman lebih diperintahkan lagi. Cara shalat khauf seperti tersebut pada ayat 102 ini dilakukan dalam keadaan yang masih mungkin dikerjakan, apabila tidak memungkinkan untuk dikerjakan seperti peperangan berkecamuk dan sulit membagi dua pasukan, maka masing-masing mengerjakan shalat sesuai kemampuan, bisa sambil berjalan, naik kendaraan menghadap kiblat maupun tidak (berdasarkan surat Al Baqarah ayat 239). Ketika shalat. Inilah illat (sebab) mengapa diperintahkan menyandang senjata. Imam Bukhari meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma tentang ayat, \"In kaana bikum adzam mim matharin au kuntum mardhaa.\" Ia berkata, \"Ketika itu Abdurrahman bin 'Auf terluka.\" Al Haafizh berkata, \"Maka turunlah ayat tersebut.\" Maka segala puji bagi Allah atas nikmat-nikmat-Nya yang diberikan kepada kaum mukmin, dikuatkan-Nya mereka dan diajarkan-Nya mereka cara-cara yang jika mereka mengerjakannya secara sempurna, maka tidak ada jalan bagi musuh menguasai mereka kapan pun dan di mana pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 102",
    "description": "Kalau pada ayat sebelumnya Allah memberikan kemudahan kepada kaum muslim untuk meng-qashar salat dalam perjalanan dan karena rasa takut, maka pada ayat ini Allah menjelaskan tata cara pelaksanaan salat itu. Dan apabila suatu ketika ada situasi yang membahayakan keselamatan, seperti karena adanya musuh dan ketika itu engkau, wahai nabi Muhammad, berada di tengah-tengah mereka, para sahabatmu, lalu engkau hendak melaksanakan salat khauf bersama-sama mereka, maka hendaklah segolongan dari mereka berdiri besertamu untuk melaksanakan salat dan segolongan yang lain menghadapi musuh yang mungkin dapat melakukan penyerangan terhadapmu dan yang bersamamu itu hendaklah menyandang senjata mereka. Kemudian apabila mereka yang salat besertamu itu melakukan sujud, yakni telah menyempurnakan satu rakaat atau telah selesai melaksanakan salat, maka hendaklah mereka itu pindah dari belakangmu untuk menghadapi musuh dan berjaga-jaga seperti yang telah dilakukan oleh kelompok yang sebelumnya, dan hendaklah datang golongan yang lain, yakni golongan kedua, yang belum salat, lalu mereka melakukan salat seperti kelompok pertama melakukannya denganmu, dan hendaklah mereka bersiap siaga dan menyandang senjata mereka. Hal ini dilakukan karena orang-orang kafir ingin dengan keinginan dan harapan yang besar agar kalian lengah terhadap senjatamu dan harta bendamu, lalu mereka menyerbu kamu sekaligus. Dan tidak ada dosa atas kamu meletakkan senjata-senjatamu, jika kamu mendapat suatu kesusahan atau kesulitan yang disebabkan karena hujan yang menyebabkan rusaknya senjata kamu atau karena kamu sakit yang menyebabkan kamu tidak dapat menyandang senjatamu, dan bersiap siagalah kamu menghadapi berbagai kemungkinan yang terjadi pada kalian akibat dari dua kondisi itu. Sungguh, Allah telah menyediakan azab yang menghinakan bagi orang-orang kafir itu, baik di dunia maupun di akhirat ayat yang lalu menggambarkan pelaksanaan salat khauf dengan tata cara tersendiri dalam suasana perang. Pada ayat ini Allah memerintahkan kaum muslimin untuk melakukan zikir sesuai dengan kondisi mereka, berdiri, duduk, atau berbaring setelah selesai melakukan salat. Selanjutnya, apabila kamu telah menyelesaikan salat yang dilakukan dalam keadaan takut tersebut, ingatlah Allah sebanyak-banyaknya sesuai dengan kondisi dan kemampuan kamu, ketika kamu berdiri, pada waktu duduk, dan ketika berbaring, dan semoga dengan memperbanyak zikir itu kamu mendapat pertolongan dari Allah. Kemudian, apabila kamu telah merasa aman dari suasana menakutkan yang kamu alami yang menyebabkan kamu melaksanakannya dengan cara yang disebutkan di atas atau sudah kembali ke tempat asal kamu dari medan perang, maka laksanakanlah salat itu sebagaimana biasa sesuai dengan ketentuan yang telah ditetapkan syariat, terpenuhi rukun dan syaratnya serta sesuai dengan waktu yang telah ditentukan. Sungguh, salat yang kamu lakukan itu adalah kewajiban yang ditentukan batas-batas waktunya atas orang-orang yang beriman. Karena itu, setiap salat dalam kondisi normal itu harus dilakukan pada waktu yang ditentukan untuknya, tidak bisa dimajukan atau dimundurkan."
  }
]