[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila kalian telah mengerjakan shalat,maka tetaplah kalian mengingat Allah dalam seluruh kondisi kalian.Kemudian apabila tlah hilang rasa ketakutan itu, maka kerjakanlah shalat dengan sempurn,dan janganlah kalian menyepelekannya,karena sesungguhnya shalat itu wajib pada waktu-waktu yang telah di maklumi dalam syariat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Apabila kalian -wahai orang-orang mukmin- selesai menunaikan salat, maka berzikirlah kepada Allah dengan membaca tasbih, tahmid, dan tahlil dalam keadaan apa pun, sambil berdiri, duduk, dan berbaring. Apabila ketakutan itu sudah hilang dan kalian merasa aman, maka tunaikanlah salat secara sempurna dengan menjalankan rukun-rukunnya, hal-hal yang wajib, dan sunah-sunahnya sebagaimana yang diperintahkan kepada kalian. Sesungguhnya salat itu adalah kewajiban yang telah ditentukan waktunya bagi orang-orang mukmin. Tidak boleh menunda-nunda salat hingga melewati batas waktunya kecuali ada uzur. Ketentuan ini berlaku di waktu mukim (tinggal di kampung kalian). Sedangkan di waktu safar kalian boleh melaksanakan salat secara jamak dan qasar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. dan jika kalian telah menjalankan salat dengan cara yang seperti ini maka ingatlah Allah dalam diri kalian dengan mengingat janji-Nya akan kemenangan yang akan diberikan bagi orang-orang yang menolong agama-Nya di dunia dan pahala yang besar di akhirat dan dengan senantiasa membaca takbir, tahmid, dan doa; demikianlah hendaknya keadaan kalian di setiap waktu baik itu ketika kalian berdiri saat bertarung, ketika duduk untuk melempar anak panah, atau ketika berbaring saat sedang terluka. Hal ini karena mengingat Allah merupakan amalan yang dapat memperkuat hati, meninggikan semangat, dan membuat kesusahan dunia menjadi ringan dan mudah, serta memberikan kalian keteguhan dan kesabaran yang dapat berbuah kemenangan. Dan apabila hati kalian telah terbebas dari rasa takut dan keadaan telah kembali aman setelah peperangan berakhir, maka dirikanlah salat dengan memenuhi rukun-rukun dan syarat-syaratnya; dan janganlah kalian lalai dalam menyempurnakan gerakan-gerakan salat, tidak sebagaimana diperbolehkan bagi kalian melakukan itu ketika dalam keadaan takut. Sesungguhnya salat merupakan hukum Allah yang wajib dijalankan pada waktu-waktu yang telah ditentukan, maka maka harus dijalankan kan pada waktu-waktu tersebut sebisa mungkin; dan menjalankannya pada waktu-waktu yang telah ditentukan dengan syarat yang kurang sempurna lebih baik daripada mengakhirkannya meskipun dilakukan dengan sempurna."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. فَإِذَا قَضَيْتُمُ الصَّلَوٰةَ (Maka apabila kamu telah menyelesaikan shalat(mu)) Yakni telah menyelesaikan shalat khauf. فَاذْكُرُوا۟ اللهَ قِيٰمًا وَقُعُودًا وَعَلَىٰ جُنُوبِكُمْ ۚ (ingatlah Allah di waktu berdiri, di waktu duduk dan di waktu berbaring.) Yakni dalam keadaan apapun, bahkan dalam keadaan perang sekalipun. فَإِذَا اطْمَأْنَنتُمْ(Kemudian apabila kamu telah merasa aman) Yakni telah merasa aman dan tidak ada lagi musuh yang membuat kalian takut. فَأَقِيمُوا۟ الصَّلَوٰةَ ۚ( maka dirikanlah shalat itu) Yakni dirikanlah shalat yang telah datang waktunya dengan cara yang telah disyariatkan seperti zikir dan doa-doa, rukun-rukun shalat, dan thuma’ninah. إِنَّ الصَّلَوٰةَ كَانَتْ عَلَى الْمُؤْمِنِينَ كِتٰبًا مَّوْقُوتًا(Sesungguhnya shalat itu adalah fardhu yang ditentukan waktunya atas orang-orang yang beriman) Yakni telah ditetapkan dengan waktu tertentu, yang tiap-tiap shalat memiliki waktu awal dan akhirnya dan tidak boleh mendahulukannya atau mengakhirkannya. Karena Allah mewajibkan hamba-hamba-Nya shalat dan menentukan waktu-waktunya, maka tidak boleh seorangpun menjalankannya diluar waktu yang telah ditentukan kecuali sebab halangan syar’i seperti, tertidur, begadang, atau yang lainnya. Dan karena waktu yang telah ditentukan inilah Allah memerintahkan kalian untuk mendirikan shalat khauf dengan menyandang senjata dan dengan cara-cara tertentu dan tidak mengizinkan kalian untuk mengakhirkannya diluar waktu shalat tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Melantuntan istighfar selepas ibadah adalah rutinitas orang-orang shalih, sebagaimana Ibrahim dan anaknya selepas mendirikan kakbah, keduanya berdoa memohon kepada Allah : { وَتُبْ عَلَيْنَا } \"dan terimalah taubat kam\" [al-Baqarah : 128], dan Allah pun menyuruh kita sebagai hamba-Nya dan ummat Nabi Muhammad untuk berdizikir selepas mendirikan shalat : { فَإِذَا قَضَيْتُمُ الصَّلَاةَ فَاذْكُرُوا اللَّهَ } \"Maka apabila kamu telah menyelesaikan shalat(mu), ingatlah Allah\", dan sunnah menjelaskan agar kita memulai dzikir itu dengan Istighfar, begitupun perintah dzikir setelah Ifadhoh dari Arafah, maka apakah ada yang lebih kita butuhkan selain berdzikir kepada Allah dan memohon taufiq dan hidayah dari-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103 Maka apabila kamu telah menyelesaikan shalat, senantiasa ingatlah Allah di segala keadaanmu bahkan ketika perang. Kemudian apabila kamu telah merasa aman, maka dirikanlah shalat itu sebagaimana biasa secara sempurna. Sesungguhnya shalat itu adalah suatu kewajiban atas orang-orang yang beriman yang telah ditentukan waktunya baik awal masuk atau akhirnya, tidak boleh dipercepat maupun ditunda"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila kalian telah menyelesaikan shalat} kalia telah usai shalat {berzikirlah kepada Allah, baik dalam keadaan berdiri, duduk, maupun berbaring. Apabila kalian telah merasa aman} aman dan rasa takut telah menghilang {dirikanlah shalat itu} laksanakanlah shalat dengan sempurna sebagaimana kalian diperintahkan {Sesungguhnya shalat itu atas orang-orang mukmin merupakan kewajiban yang waktunya telah ditentukan} kewajiban yang telah ditentukan waktu-waktunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. Maksudnya, apabila kalian telah menyelesaikan shalat khauf kalian atau yang lainnya, maka berdzikirlah kepada Allah dalam berbagai kondisi dan keaadaan kalian, akan tetapi dikhusukan shalat khauf dengan hal tersebut adalah karena beberapa faidah, di antaranya: ~ Bahwasanya baiknya hati, keberuntungan, dan kebahagiaannya, adalah dengan kembali kepada Allah dalam kecintaan dan hati yang penuh dengan Dzikir kepadaNya dan pujian atasNya, dan sarana yang paling agung untuk mencapai tujuan tersebut adalah shalat, yang pada hakikatnya merupakan sebuah hubungan langsung antara seorang hamba dengan Rabbnya. ~ Bahwa dalam hal itu tergambar hakikat keimanan dan isyarat-isyarat keyakinan yang membuat Allah harus mewajibkan shalat atas hamba-hambaNya setiap sehari semalam, dan telah diketahui bahwa di dalam shalat Khauf tidak didapatkan tujuan-tujuan yang terpuji tersebut disebabkan oleh sibuknya hati dan tubuh serta rasa takut, maka Allah memerintahkan untuk menutupinya dengan dzikir setelahnya. ~ Bahwasanya takut itu mengakibatkan ketegangan hati dan perasaan khawatir yang menghadapkannya kepada kelemahan, dan bila hati telah lemah, niscaya tubuh pun akan lemah dalam menghadapi musuh, dan memperbanyak dzikir kepada Allah adalah di antara pemicu kekuatan yang terbesar bagi hati. ~ bahwa dzikir kepada Allah disertai bersabar dan teguh adalah sebab dari kemenangan dan keberuntungan dari musuh sebagaimana Allah berfirman, (Al-Anfal:45) Allah memerintahkan untuk memperbanyak dzikir kepadaNya dalam kondisi seperti ini. Dan banyak lagi faidah-faidah lainnya. Dan firmanNya, “Kemudian apabila kamu telah merasa aman, maka dirikanlah shalat itu (sebagaimana biasa),” maksudnya apabila kalian telah merasa aman dari rasa takut dan hati serta tubuh kalian telah merasakan ketenangan, maka sempurnakanlah shalat kalian secara penuh, baik lahir maupun batin dengan menegakkan rukun-rukunnya, syarat-syaratnya, kekhusyu’annya dan seluruh hal yang melengkapinya. “Sesungguhnya shalat itu adalah kewajiban yang ditentukan waktunya atas orang-orang yang beriman,” maksudnya diwajibkan pada waktu-waktunya. Hal tersebut menunjukkan kewajiban shalat, dan bahwa shalat itu memiliki waktu di mana shalat itu tidak sah kecuali pada waktunya, yaitu waktu-waktu yang telah diketahui oleh kaum Muslimin, baik anak kecil, orang tua, ulama maupun orang bodoh mereka, di mana mereka mendapatkan hal tersebut dari Nabi mereka Muhammad sholallohu 'alaihi wasallam dengan sabdanya \"sholatlah kalian seperti melihatku sedang sholat\". Firman Allah, “Atas orang-orang yang beriman” menunjukkan bahwa shalat itu adalah barometer keimanan, dan menurut keimanan nseorang hambalah shalatnya tegak dan sempurna. Yang menunjukkan hal itu adalah bahwa kaum kafir –walaupun mereka konsisten terhadap hukum-hukum kaum Muslimin seperti ahli dzimmah- tidaklah diwajibkan dengan cabang-cabang agama seperti shalat, mereka tidak diperintahkan untuk mengerjakannya, bahkan hal itu bila mereka lakukan juga tidaklah sah selama mereka masih dalam kekufuran, dan mereka tetap akan disiksa karena hal itu dank arena hukum-hukum lain di akhirat nanti."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 103: Lantas apabila kamu telah selesaikan sembahyang itu, maka hendaklah kamu ingat kepada Allah sambil berdiri dan sambil duduk, dan sambil (berbaring) atas rusuk- rusuk kamu. Tetapi apabila kamu telah tenteram, maka hendaklah kamu dirikan sembahyang (seperti biasa), karena sesungguhnya shalat itu adalah atas Mu'minin satu kewajiban yang ditentukan waktunya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dalam setiap keadaan. Hal itu, karena baiknya hati, beruntung dan bahagianya terletak pada kembalinya mereka kepada Allah Subhaanahu wa Ta'aala, mencintai-Nya dan memenuhi hati dengan mengingat dan memuji-Nya. Yang demikian dapat dilakukan, salah satunya –bahkan yang paling besarnya- adalah dengan shalat secara sempurna, di mana shalat itu pada hakikatnya merupakan penghubung antara seorang hamba dengan Tuhannya. Dalam shalat khauf yang ringkas tersebut tujuan dari shalat tidak tercapai karena hati dan badan ketika itu disibukkan oleh perkara lain, maka Allah Subhaanahu wa Ta'aala memerintakan untuk menutupi kekurangan tersebut dengan dzikrullah dalam setiap keadaan. Manfaat dzikrullah sangat banyak; hati dan badan yang sebelumnya lemah karena memerangi musuh menjadi segar kembali dengannya, karena memang dzikrullah merupakan makanan bagi hati. Demikian juga dzikrullah dengan sikap sabar dan teguh merupakan sebab keberuntungan dan kemenangan, sebagaimana firman Allah, \"Wahai orang-orang yang beriman! Apabila kamu memerangi pasukan (musuh), maka berteguh hatilah kamu dan sebutlah (nama) Allah sebanyak-banyaknya agar kamu beruntung.\" (Terj. Al Anfaal: 45), dan hikmah-hikmah lainnya yang begitu banyak. Faedah: Tentang dzikr di ayat ini ada tiga pendapat ulama: Pendapat pertama mengatakan, bahwa maksudnya kita diperintahkan juga berdzikr ketika di luar shalat, yakni ingatlah Allah dan tasbihkanlah di setiap saat dan di setiap waktu serta di setiap keadaan, baik malam maupun siang, secara sembunyi atau terang-terangan, pagi maupun petang, di darat maupun di lautan, ketika safar maupun ketika hadhar (tidak safar), ketika sehat maupun ketika sakit dan pada setiap keadaan. Maksud ayat tersebut bukanlah sebagaimana yang ditafsirkan oleh orang awam seperti menggoyang-goyang kepala ketika berdzikr atau mengendalikan nafas ketika berdzikr dsb. hal ini sama sekali tidak pernah dipraktekkan oleh Rasulullah shallallahu 'alaihi wa sallam, para sahabat dan para tabiin. Pendapat kedua mengatakan, bahwa maksudnya apabila dalam shalat kita tidak mampu berdiri, maka shalatlah sambil duduk dan bila tidak mampu sambil duduk maka shalatlah sambil berbaring. Pendapat ketiga mengatakan, bahwa maksudnya rasa takut kepada Allah (yang disertai rasa rajaa’/berharap dan cinta) meliputi mereka, baik ketika berdiri yakni ketika mereka melakukan aktifitas harian, maupun ketika duduk yakni di saat santai dan ketika berbaring, yakni ketika tidur. Yakni secara sempurna, baik zhahir maupun batin, terpenuhi syarat, rukun, khusyu' dan segala yang menyempurnakannya. Oleh karena itu tidak boleh dilewatkan waktunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 103",
    "description": "Ayat yang lalu menggambarkan pelaksanaan salat khauf dengan tata cara tersendiri dalam suasana perang. Pada ayat ini Allah memerintahkan kaum muslimin untuk melakukan zikir sesuai dengan kondisi mereka, berdiri, duduk, atau berbaring setelah selesai melakukan salat. Selanjutnya, apabila kamu telah menyelesaikan salat yang dilakukan dalam keadaan takut tersebut, ingatlah Allah sebanyak-banyaknya sesuai dengan kondisi dan kemampuan kamu, ketika kamu berdiri, pada waktu duduk, dan ketika berbaring, dan semoga dengan memperbanyak zikir itu kamu mendapat pertolongan dari Allah. Kemudian, apabila kamu telah merasa aman dari suasana menakutkan yang kamu alami yang menyebabkan kamu melaksanakannya dengan cara yang disebutkan di atas atau sudah kembali ke tempat asal kamu dari medan perang, maka laksanakanlah salat itu sebagaimana biasa sesuai dengan ketentuan yang telah ditetapkan syariat, terpenuhi rukun dan syaratnya serta sesuai dengan waktu yang telah ditentukan. Sungguh, salat yang kamu lakukan itu adalah kewajiban yang ditentukan batas-batas waktunya atas orang-orang yang beriman. Karena itu, setiap salat dalam kondisi normal itu harus dilakukan pada waktu yang ditentukan untuknya, tidak bisa dimajukan atau dimundurkanayat ini masih merupakan rangkaian tuntunan yang diberikan pada ayat 102 yang memerintahkan kaum muslim untuk berhati-hati terhadap musuh kamu. Pada ayat ini Allah memberikan tuntunan dan semangat kepada kaum muslimin. Dan janganlah kamu berhati lemah, berkecil hati, takut, dan pesimistis dalam mengejar mereka, yakni musuhmu, walaupun kamu tahu bahwa mereka memiliki kelebihan dari kamu, kekuatan mereka lebih baik, jumlah mereka lebih banyak, dan persenjataan mereka lebih lengkap. Kamu dan mereka sesungguhnya memiliki kesamaan dalam hal yang lain, yaitu bahwa jika kamu menderita kesakitan, maka ketahuilah bahwa mereka pun menderita kesakitan pula, sebagaimana kamu merasakannya, sedang kamu memiliki kelebihan lain, yaitu masih dapat mengharapkan dari Allah apa yang disebut mati syahid, pahala yang berlipat ganda, dan pertolongan yang tidak dapat mereka harapkan. Allah maha mengetahui segala kebaikan bagi semua makhluknya, mahabijaksana dalam menetapkan hukum-hukum-Nya."
  }
]