[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian kendur semangat dalam mengejar musuh kalian dan memerangi mereka.Jika kalian menderita kesakitan akibat peperangan dan dampak-dampaknya,maka musuh-musuh kalian pun demikian merasakan kesakitan yang lebih berat,meski demikian mereka tidak berhenti memerangi kalian.Maka sudah semestinya kalian lebih tangguh untuk itu daripada mereka,karena kalian mengharapkan pahala,kemenangan dan pertolongan,sedang mereka tidak mengharapkan itu.Dan Allah maha mengetahui semua keadaan kalian,juga Maha bijaksana dalam penetapan perintah dan aturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Janganlah kalian lemah dan malas -wahai orang-orang mukmin- dalam mencari musuh kalian dari kalangan orang-orang kafir. Apabila kalian merasa kesakitan akibat pembunuhan dan luka-luka yang kalian alami, sesungguhnya mereka juga merasakan sakit seperti kalian dan mengalami seperti apa yang kalian alami. Maka jangan sampai kesabaran mereka lebih besar dari kesabaran kalian. Karena kalian mengharapkan pahala, pertolongan, dan dukungan dari Allah, sedangkan mereka tidak mengharapkannya. Dan Allah Maha Mengetahui keadaan hamba-hamba-Nya lagi Maha Bijaksana dalam mengatur urusan makhluk-Nya dan menetapkan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "104. Dan janganlah kalian bersikap lemah dalam memerangi kaum yang menampakan permusuhan terhadap kalian, hendaklah kalian bersiap siaga untuk memerangi mereka setelah kalian selesai menjalankan salat dengan penuh kesiagaan, karena rasa sakit yang kalian rasakan sesungguhnya juga mereka rasakan sebab mereka juga manusia seperti kalian, dan meskipun begitu mereka tetap bersabar; maka mengapa kalian tidak bersabar padahal kalian lebih utama untuk bersabar daripada mereka? Sebab kalian mengharapkan dari Allah kemenangan agama kalian yang benar atas agama-agama lain yang batil, dan kalian mengharapkan pahala yang besar dan kenikmatan yang kekal di akhirat. Inilah yang berlaku dalam keluasan ilmu Allah, dan telah berlalu sunatullah bahwa kesudahan yang baik adalah bagi orang-orang yang bertakwa dan mereka akan mendapatkan kemenangan atas orang-orang kafir selama mereka mengamalkan petunjuk-Nya dan berjalan di atas tuntunan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. وَلَا تَهِنُوا۟ فِى ابْتِغَآءِ الْقَوْمِ ۖ (Janganlah kamu berhati lemah dalam mengejar mereka (musuhmu)) Yakni janganlah kalian lemah dalam mengejar musuh dan tunjukkanlah kepada mereka kekuatan dan keteguhan. إِن تَكُونُوا۟ تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ( Jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya) Sehingga mereka tidak lebih layak dari kalian dalam bersabar atas panasnya peperangan dan pahitnya pertempuran. وَتَرْجُونَ مِنَ اللهِ(sedang kamu mengharap dari pada Allah) Yakni berupa balasan dan pahala yang besar. مَا لَا يَرْجُونَ ۗ( apa yang tidak mereka harapkan) Karena mereka adalah orang-orang kafir dan ingkar. Sehingga kalian lebih layak untuk bersabar daripada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Segala hal yang nampak dihadapan kita dari penderitaan kaum muslimin adalah semata-mata menggambarkan semua rasa sakit yang diderita oleh jasad dan jiwa; tetapi kekuatan kita yang sebenarnya adalah apa yang di khabarkan oleh Allah bahwasanya rasa sakit itu akan tertukar : { إِنْ تَكُونُوا تَأْلَمُونَ فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمُونَ ۖ وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ } \"jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya, sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan\" Maka hendaklah setiap muslim memperkuat harapan mereka kepada Allah, karena itulah yang menjadikan mereka lebih istimewa diatas semua ummat. 2 ). Ayat ini sebagai penyemangat bagi kaum muslimin, dan penghinaan bagi orang-orang kafir, sekalipun mereka sama dalam penderitaan rasa sakit; tetapi Allah mengangkat derajat orang-orang beriman melalui firman-Nya : { وَتَرْجُونَ مِنَ اللَّهِ مَا لَا يَرْجُونَ } \"sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan\" Inilah firman Allah yang hanya dengannya setiap mukmin bersandar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104 Janganlah kamu berhati lemah dalam mengejar dan membunuh musuhmu. Jika kalian menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan pula, sebagaimana kamu menderita. Mereka tidak takut untuk memerangi kalian, namun kalian adalah lebih sabar daripada mereka, sedang kamu mengharap ridha Allah, yaitu apa yang tidak mereka harapkan sebab mereka kufur dan membangkang. Kalian lebih berhak untuk sabar daripada mereka. Allah Maha Mengetahui atas amal kalian lagi Maha Bijaksana untuk memerintahkan dan memberi larangan kepada kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah kalian merasa hina} merasa lemah {dalam mengejar kaum itu} mengejar musuh {Jika kamu menderita kesakitan} menderita karena luka dan peperangan {sesungguhnya mereka pun menderita kesakitan sebagaimana yang kalian rasakan} mereka menderita sebagaimana kalian menderita {Kalian mengharapkan} kalian mengharapkan pahala dan pertolongan {dari Allah apa yang tidak dapat mereka harapkan} apa yang tidak mereka harapkan {Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. Yaitu janganlah kalian lemah dan jangan malas dalam mengejar musuh-musuh kalian dari orang-orang kafir, maksudnya dalam memerangi mereka dan bersiap-siap menghadapi mereka, karena sesungguhnya kelemahan hati mengakibatkan kelemahan tubuh. Dan yang demikian itu akan melemahkan perjuangan terhadap musuh, akan tetapi jadilah kalian orang-orang yang kuat dan bersemangat dalam memerangi mereka. Kemudian Allah menyebutkan suatu hal yang akan menguatkan hati kaum Mukminin, yaitu Allah menyebutkan dua perkara: Pertama, bahwasanya apa pun yang menimpa kalian berupa kesedihan, kelelahan, luka dan lain sebagainya, maka hal serupa itu pun menimpa musuh-musuh kalian, maka menjadi lebih lemah dari mereka bukanlah di antara kewibawaan dan keluhuran budi kalian, karena kalian dan mereka sama-sama dalam merasakan akibat dari hal itu, karena kebiasaan yang b erlaku adalah bahwa tidaklah akan merasa lemah kecuali orang yang tertimpa bencana yang bertubi-tubi dan dikalahkan oleh musuh secara terus menerus, dan bukannya orang yang hanya pernah dikalahkan dan pernah mengalahkan. Perkara kedua, bahwasanya kalian itu mengharapkan sesuatu di sisi Allah apa yang tidak mereka harapkan, kalian mengharapkan kemenangan dengan mendapatkan pahalaNya dan keselamatan dari siksaNya, bahkan orang-orang yang khusus dalam Islam memiliki tujuan-tujuan yang jauh dan cita-cita yang tinggi untuk membela agama Allah, menegakkan syariatNya, memperluas daerah kekuasaan Islam, memberi petunjuk kepada orang-orang yang tersesat dan menghancurkan musuh-musuh agama, hal-hal tersebut akan menambah kekuatan bagi seorang Mukmin yang benar, meningkatkan semangat dan keberanian yang penuh, karena barangsiapa yang berjuang dan bersabar dalam memperoleh kemuliaan duniawi bila ia memperolehnya tidaklah sama dengan orang yang berjuang untuk memperoleh kebahagiaan dunia dan akhirat, serta kemenangan dengan memperoleh ridha Allah dan surgaNya, maka Mahasuci Allah yang telah membeda-bedakan antara hamba dan memilah-milah mereka dengan ilmu dan hikmahNya, karena itulah Allah berfirman, “Dan Allah Maha Mengetahui lagi Mahabijaksana,” yaitu ilmu dan hikmah yang sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 104: Dan janganlah kamu lemah tentang mengejar kaum Jika adalah kamu maka mereka (juga) merasa sakit seperti kamu merasa sakit, tetapi kamu mengharap dari Allah (ganjaran) yang mereka tidak harapkan; dan adalah Allah itu Pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika Nabi shallallahu 'alaihi wa sallam mengutus beberapa orang untuk mengejar Abu Sufyan dan kawan-kawannya saat mereka pulang dari perang Uhud, lalu mereka mengeluhkan luka-luka mereka. Namun meskipun mereka mendapat luka, mereka tidak takut dan mundur memerangi kamu. Di samping itu, bersikap lemah jika seperti ini keadaannya, yakni sama-sama mendapatkan luka tidaklah wajar. Yang wajar adalah jika luka dan kekalahan senantiasa menimpa kamu. Sedangkan keadaanya tidak demikian, kadang kamu menang dan kadang mereka menang. Lebih dari itu, kamu memiliki kelebihan yang menghendaki untuk tidak bersikap lemah, yaitu kamu mengharap dari Allah apa yang mereka tidak harapkan. Yaitu kemenangan dan pahala. Bahkan di antara orang-orang mukmin ada yang memiliki harapan yang tinggi, ingin membela agama Allah, menegakkan syari'at-Nya, memperluas wilayah Islam, menunjuki orang-orang yang tersesat dan menghancurkan musuh-musuh agama -Kita berharap kepada Allah, semoga Dia menggolongkan kita ke dalam golongan mukmin seperti itu, Allahumma amin-, semua ini menghendaki untuk bertambahnya kekuatan seorang mukmin, membuatnya semangat dan menjadikannya berani. Hal itu, karena orang yang berperang hanya bertujuan untuk meraih kesenangan dunia saja tidak seperti orang yang berperang untuk memperoleh kebahagiaan di dunia dan akhirat serta memperoleh keridhaan Allah dan surga-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 104",
    "description": "Ayat ini masih merupakan rangkaian tuntunan yang diberikan pada ayat 102 yang memerintahkan kaum muslim untuk berhati-hati terhadap musuh kamu. Pada ayat ini Allah memberikan tuntunan dan semangat kepada kaum muslimin. Dan janganlah kamu berhati lemah, berkecil hati, takut, dan pesimistis dalam mengejar mereka, yakni musuhmu, walaupun kamu tahu bahwa mereka memiliki kelebihan dari kamu, kekuatan mereka lebih baik, jumlah mereka lebih banyak, dan persenjataan mereka lebih lengkap. Kamu dan mereka sesungguhnya memiliki kesamaan dalam hal yang lain, yaitu bahwa jika kamu menderita kesakitan, maka ketahuilah bahwa mereka pun menderita kesakitan pula, sebagaimana kamu merasakannya, sedang kamu memiliki kelebihan lain, yaitu masih dapat mengharapkan dari Allah apa yang disebut mati syahid, pahala yang berlipat ganda, dan pertolongan yang tidak dapat mereka harapkan. Allah maha mengetahui segala kebaikan bagi semua makhluknya, mahabijaksana dalam menetapkan hukum-hukum-Nya rangkaian ayat-ayat yang lalu membicarakan banyak hal tentang orang-orang munafik dan sifat-sifat buruk yang mereka miliki yang tidak mau melakukan tuntunan, dan perintah untuk bersikap tegas kepada mereka, bahkan dengan memerangi mereka, maka pada ayat ini Allah menyebutkan bahwa kitab Al-Qur'an itu telah membawa kebenaran. Sungguh, kami, melalui malaikat jibril, telah menurunkan kitab Al-Qur'an kepadamu, nabi Muhammad, yaitu suatu kitab yang sempurna dalam segala aspeknya, yang mengandung tuntunan, petunjuk, nasihat, dan rahmat bagimu dan bagi kaummu yang membawa kebenaran, agar engkau mengadili antara semua manusia tanpa membedakan jenis kelamin, agama, posisi dan kedudukan sosial mereka dengan apa yang telah Allah ajarkan, ilhamkan, perlihatkan, dan atau tunjukkan kepadamu melalui hati dan akalmu, dan janganlah engkau menjadi penentang bagi orang yang tidak bersalah, karena membela orang-orang yang berkhianat."
  }
]