[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami telah menurunkan kepadamu (wahai rasul), al-qur;an yang berisi kebenaran,untuk memutuskan perkara diantara manusia semuanya melalui wahyu yang Allah wahyukan kepadamu dan diperlihatkanNya kepadamu.Maka janganlah kamu menjadi bagi orang-orang yang berkhianat (dengan menyembunyikan kebenaran) sebagai pembela, gara-gara apa yang mereka perlihatkan kepadamu berupa perkataaan yang tidak sejalan dengan hakikat yang sebenarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Sesungguhnya Kami menurunkan kepadamu -wahai Rasul- kitab Al-Qur`ān yang berisi kebenaran untuk memberikan keputusan yang tegas kepada manusia dalam semua urusan mereka berdasarkan apa yang Allah ajarkan dan ilhamkan kepadamu, bukan berdasarkan kecenderungan hawa nafsumu dan pendapat pribadimu. Dan janganlah kamu menjadi pembela bagi orang-orang yang mengkhianati diri mereka sendiri dan mengkhianati amanah mereka dari orang yang menuntut mereka secara hak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. إِنَّآ أَنزَلْنَآ إِلَيْكَ الْكِتٰبَ بِالْحَقِّ (Sesungguhnya Kami telah menurunkan kitab kepadamu dengan membawa kebenaran) Sebab diturunkannya ayat ini bahwa seorang lelaki dari golongan orang-orang munafik dari Bani Ubairiq mencuri makanan dan senjata dari seorang Yahudi, namun orang munafik ini menuduh orang shaleh yang melakukannya. Dan ketika sebagian orang mulai mengetahui siapa yang mencuri sebenarnya maka orang-orang dari kaum bani Ubairiq ini mulai membelanya di depan rasulullah -menuntut putusan-, hingga Rasulullah hampir menuruti tuntutan mereka karena orang yang dituduh ini tidak mempunyai alasan. Maka turunlah ayat ini. بِمَآ أَرَىٰكَ اللهُ ۚ (dengan apa yang telah Allah wahyukan kepadamu) Baik itu dengan diturunkan wahyu atau dengan apa yang dikabarkan dan ditunjukkan oleh Allah kepadanya. وَلَا تَكُن لِّلْخَآئِنِينَ خَصِيمًا (dan janganlah kamu menjadi penantang, karena (membela) orang-orang yang khianat) Yakni dengan menentang orang-orang yang dalam kebenaran demi membela mereka (orang-orang yang menuduh). Ayat ini mengandung dalil tidak dibolehkannya seseorang untuk membela orang yang diketahui bahwa ia berada posisi yang salah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "105-106 1 ). Tatkala seorang mukmin mentadabburi firman Allah : { وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا } \"dan janganlah kamu menjadi penantang (orang yang tidak bersalah), karena (membela) orang-orang yang khianat\" kemudian ia memperhatikan kenyataan yang tengah berlalu; niscaya ia akan mengetahui betapa banyaknya orang yang rela memasang badan untuk membela penyeru dan pelaku kebathilan, entah mereka bermaksud menyombongkan diri, atau mungkin mengharapkan kekayaan dan syuhroh. 2 ). Ibnu Taimiyah menceritakan tentang berkah dan kebaikan dari penerapan taujih yang mulia ini, beliau berkata : Sesungguhnya tidaklah setiap terbetik dalam benakku suatu masalah, kemudian aku beristighfar beribu kali kepada Allah, melainkan hati ini menjadi lapang dan menghilanglah segala perkara yang mengahantuiku, dan aku pun meraih apa yang aku pinta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105 Sesungguhnya Kami telah menurunkan kitab kepadamu dengan membawa kebenaran, supaya kamu mengadili antara manusia sesuai dengan apa yang telah Allah wahyukan dan rahasia-rahasia yang juga telah Allah ungkapkan kepadamu. Janganlah kamu menjadi penantang orang yang tidak bersalah, karena membela orang-orang yang khianat. Ayat ini dan ayat sesudahnya hingga ayat 116 turun untuk seorang munafik yaitu Thu’mah bin Ubairaq. Yang telah mencuri baju besi dari tetangganya yaitu Qatadah bin Nu’man dalam tas yang rapat tersembunyi kemudian dia sembunyikan pada seorang Yahudi yaitu Zaid bin Samin. Ketika mereka mencari dan mengikuti jejak tas itu menuju rumah si Yahudi, maka orang-oang mendapatinya di rumahnya. Kemudian dia berkata: bayarlah kepada Thu’mah, kemudian kaumnya bani Dhofar berusaha agar Nabi membantah para sahabat mereka itu. kemudian Nabi melakukannya dan hendak menghukum orang Yahudi tersebut. Maka Allah menurunkan ayat inna anzalna.."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah menurunkan Kitab dengan benar kepadamu agar kamu memutuskan (perkara) di antara manusia dengan apa yang telah Allah pertunjukkan kepadamu} Allah ajarkan kepadamu {Janganlah kamu menjadi penentang untuk para pengkhianat} pembela mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. Allah mengabarkkan bahwa Dia telah menurunkan kepada hamba dan RasulNya sebuah kitab dengan kebenaran, maksudnya, terjaga dari setan yang hendak mencampurnya dengan kebatilan ketika turunnya, akan tetapi ia turun dengan kebenaran dan mencakup hal-hal yang benar pula, kabar-kabarNya adalah benar, perintah dan laranganNya adalah dalil, \"Telah sempurnalah kalimat Tuhanmu (Al-Quran) sebagai kalimat yang benar dan adil.\" (Al-An’am:115). Dan Allah mengabarkan bahwa Dia menurunkannya untuk dijadikan sebagai hukum di antara manusia, dan dalam ayat lainnya, \"Dan Kami turunkan kepadamu Al Quran, agar kamu menerangkan pada umat manusia apa yang telah diturunkan kepada mereka dan supaya mereka memikirkan,\" (An-Nahl:44). Kemungkinan ayat ini adalah tentang posisi kitab ini sebagai hakim di antara manusia dalam perkara-perkara yang diperselisihkan dan diperdebatkan, dan hal tersebut adalah dalam menjelaskan seluruh perkara agama, dasar-dasarnya, dan cabang-cabangnya. Kemungkinan lain bahwa kedua ayat tersebut memiliki makna yang sama, maka sebagai hakim di sini maksudnya adalah meliputi hukum tentang darah, kehormatan, harta, seluruh hak, akidah, dan seluruh permasalahan-permasalahan hukum, dan FirmanNya, “Dengan apa yang telah Allah wahyukan kepadamu” yaitu bukan dengan hawa nafsumu, akan tetapi dengan apa yang telah Allah ajarkan dan Allah ilhamkan kepadamu, sebagaimana Firman Allah, \"dia tidak berbicara dari hawa nafsunya, tetapi dia adalah wahyu yang diwahyukan kepadanya\" (An-Najm:3-4). Ayat ini mengandung dalil tentang kema’shuman Nabi pada apa pun yang disampaikannya dari Allah berupa segenap hukum-hukum atau selainnya, dan bahwa disyaratkan untuk menjadi hakim itu adalah ilmu dan adil, karena Firman Allah, “Dengan apa yang telah Allah wahyukan kepadamu” dan Allah tidak berfirman; “dengan pendapatan,” dan Allah juga mengharuskan hakim di antara manusia agar mengetahui tentang kitab. Dan tatkala Allah memerintahkan untuk mengadili perkara di antara manusia dengan hukum yang mengandung keadilan, lalu Allah melarangnya dari kezhaliman dan kesewenang-wenangan yang merupakan suatu hal yang bertentangan dengan keadilan seraya berfirman, “Dan janganlah kamu menjadi penantang (orang yang tidak bersalah) karena (membela) orang-orang yang khianat,” maksudnya, janganlah kamu membela orang yang kalian ketahui pengkhianatan mereka yaitu seorang yang mengakui suatu barang yang bukan miliknya atau seorang yang mengingkari suatu hak yang harus dipenuhinya, baik ia ketahui dengan pasti ataupun hanya dengan prasangkanya saja. Ayat ini menunjukkan haramnya pertikaian dalam kebatilan, dan menjadi pembela bagi orang yang bersalah dalam perkara agama maupun hak-hak duniawi, dan pemahaman terbalik dari ayat ini adalah bahwa boleh membela seseorang dalam perkara persidangan yang mana orang tersebut tidak diketahui memiliki kezhaliman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "105-106. Hai Rasulullah, karena keagungan Kami maka Kami turunkan kepadamu Al-qur'an untuk menjelaskan kebenaran agar engkau dapat menentukan hukum di antara manusia sesuai dengan hukum-hukum yang Allah ajarkan kepadamu. Dan janganlah kamu menjadi pembela orang yang berkhianat dengan memojokkan orang yang menuntut haknya terhadap orang yang berkhianat itu. Dan mohonlah ampun kepada Allah atas perkara-perkara manusia yang telah kamu putuskan ketika kamu lebih condong kepada orang yang lebih fasih dalam mengungkapkan hujjah dan buktinya atau lebih condong kepada seorang muslim karena keislamannya sebab kamu berhusnudzon kepadanya. Sesungguhnya Allah mengampuni dosa yang besar bagi orang yang memohon ampun dan bertaubat kepada-Nya dan memberi taufik untuk beramal saleh setelah memberikan pahala dan menghapus siksaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 105: 105-106. Sesungguhnya Kami turunkan kepadamu dengan supaya an tara yang Allah unjukkan kepadamu; dan janganlah engkau jadi pembe- la bagi orang-orang yang khianat. telah Kitab (ini) (membawa) kebenaran, engkau menghukum di manusia dengan (faham) dan hendaklah engkau mintakan kepada Allah, karena sesungguhnya adalah Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika diturunkan, Al Qur'an terpelihara dari para setan yang hendak menyelipkan kebatilan, bahkan mereka tidak dapat mendekatinya. Al Qur'an turun dengan kebenaran, mengandung kebenaran, beritanya benar, perintah dan larangannya pun adil. Tidak dengan hawa nafsumu. Oleh karena itu, Al Qur'an merupakan penyelesai masalah di tengah-tengah manusia, baik dalam masalah 'aqidah, hukum, masalah darah, kehormatan, harta dan hak-hak lainnya. Ayat ini menunjukkan bahwa seorang hakim harus berilmu dan adil. Dalil berilmu berdasarkan firman Allah, \"dengan apa yang telah diajarkan Allah kepadamu\" dan dalil adil berdasarkan firman Allah, \"dan janganlah kamu menjadi penentang (orang yang tidak bersalah), karena (membela) orang yang khianat\", yakni janganlah kamu membela orang yang kamu ketahui khianatnya, orang yang mendakwakan sesuatu padahal bukan miliknya, orang yang mengingkari hak yang ditanggungnya, baik kamu mengetahuinya maupun berdasarkan perkiraanmu. Dalam ayat ini terdapat dalil haramnya membela kebatilan dan menjadi pengacara untuk orang yang batil. Dalam ayat tersebut juga terdapat dalil bolehnya menjadi pengacara bagi orang yang tidak diketahui berbuat zalim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 105",
    "description": "Rangkaian ayat-ayat yang lalu membicarakan banyak hal tentang orang-orang munafik dan sifat-sifat buruk yang mereka miliki yang tidak mau melakukan tuntunan, dan perintah untuk bersikap tegas kepada mereka, bahkan dengan memerangi mereka, maka pada ayat ini Allah menyebutkan bahwa kitab Al-Qur'an itu telah membawa kebenaran. Sungguh, kami, melalui malaikat jibril, telah menurunkan kitab Al-Qur'an kepadamu, nabi Muhammad, yaitu suatu kitab yang sempurna dalam segala aspeknya, yang mengandung tuntunan, petunjuk, nasihat, dan rahmat bagimu dan bagi kaummu yang membawa kebenaran, agar engkau mengadili antara semua manusia tanpa membedakan jenis kelamin, agama, posisi dan kedudukan sosial mereka dengan apa yang telah Allah ajarkan, ilhamkan, perlihatkan, dan atau tunjukkan kepadamu melalui hati dan akalmu, dan janganlah engkau menjadi penentang bagi orang yang tidak bersalah, karena membela orang-orang yang berkhianatpada ayat ini Allah memerintahkan kepada nabi Muhammad dan umatnya untuk memohon ampun. Dan mohonlah ampunan kepada Allah. Sungguh, Allah selamanya, sejak dahulu hingga kini dan masa mendatang, maha pengampun atas dosa-dosa yang telah dilakukan oleh hamba-hamba-Nya, maha penyayang kepada hamba-hamba-Nya yang beriman di dunia dan di akhirat."
  }
]