[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mintalah dari Allah ampunan dalam seluruh keadaanmu. Sesungguhnya Allah Maha pengampun bagi orang yang mengaharapkan karunia Nya dan mendapatkan ampunanNya,juga maha penyayang kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Dan mintalah maaf dan ampunan dari Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang kepada hamba-hamba-Nya yang bertaubat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. وَاسْتَغْفِرِ اللهَ ۖ (dan mohonlah ampun kepada Allah) Yakni mohonlah ampun atas pembelaanmu untuk Bani Ubairiq. Ketika itu Rasulullah telah berkata kepada orang yang menuduh: “kamu sengaja menuduh keluarga yang dikenal sebagai keluarga Islam dan shaleh, menuduh mereka dengan tuduhan pencurian tanpa memastikan terlebih dahulu dan tanpa bukti. Dan setelah ayat ini diturunkan mereka (Bani Ubairiq) mengembalikan senjata itu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "105-106 1 ). Tatkala seorang mukmin mentadabburi firman Allah : { وَلَا تَكُنْ لِلْخَائِنِينَ خَصِيمًا } \"dan janganlah kamu menjadi penantang (orang yang tidak bersalah), karena (membela) orang-orang yang khianat\" kemudian ia memperhatikan kenyataan yang tengah berlalu; niscaya ia akan mengetahui betapa banyaknya orang yang rela memasang badan untuk membela penyeru dan pelaku kebathilan, entah mereka bermaksud menyombongkan diri, atau mungkin mengharapkan kekayaan dan syuhroh. 2 ). Ibnu Taimiyah menceritakan tentang berkah dan kebaikan dari penerapan taujih yang mulia ini, beliau berkata : Sesungguhnya tidaklah setiap terbetik dalam benakku suatu masalah, kemudian aku beristighfar beribu kali kepada Allah, melainkan hati ini menjadi lapang dan menghilanglah segala perkara yang mengahantuiku, dan aku pun meraih apa yang aku pinta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106 Wahai Nabi mohonlah ampun kepada Allah tentang apa yang engkau niatkan. Sesungguhnya Allah Maha Pengampun atas orang-orang yang meminta ampun lagi Maha Penyayang kepada orang-orang yang bertaubat dan pasrah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mohonlah ampunan kepada Allah. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. “Dan mohonlah ampun kepada Allah” dari segala hal yang engkau perbuat bila memang ada, “Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang” yaitu Allah Maha Mengampuni dosa yang besar bagi orang yang memohon ampunan kepadaNya, bertaubat, dan kembali kepadaNya, dan akan membimbingnya kepada perbuatan shalih setelah itu yang mengakibatkan adanya pahala dan terlepas dari siksaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 106: 105-106. Sesungguhnya Kami turunkan kepadamu dengan supaya an tara yang Allah unjukkan kepadamu; dan janganlah engkau jadi pembe- la bagi orang-orang yang khianat. telah Kitab (ini) (membawa) kebenaran, engkau menghukum di manusia dengan (faham) dan hendaklah engkau mintakan kepada Allah, karena sesungguhnya adalah Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap kesalahan yang telah kamu lakukan, jika ada. Bagi orang yang meminta ampun kepada-Nya, bertobat dan kembali kepada-Nya, dan Dia akan memberinya taufiq untuk beramal shalih setelahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 106",
    "description": "Pada ayat ini Allah memerintahkan kepada nabi Muhammad dan umatnya untuk memohon ampun. Dan mohonlah ampunan kepada Allah. Sungguh, Allah selamanya, sejak dahulu hingga kini dan masa mendatang, maha pengampun atas dosa-dosa yang telah dilakukan oleh hamba-hamba-Nya, maha penyayang kepada hamba-hamba-Nya yang beriman di dunia dan di akhiratdan janganlah kamu, wahai nabi Muhammad dan umatmu, berdebat untuk membela orang-orang yang sengaja dan terus-menerus mengkhianati diri mereka. Sungguh, Allah tidak menyukai, yakni tidak menurunkan rahmat-Nya, kepada orang-orang yang selalu mengulangi perbuatan berkhianat dari waktu ke waktu, dan bergelimang dosa."
  }
]