[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu membela orang-orang yang berkhianat dengan bermaksiat kepaada Allah. Sesungguhnya Allah tidak mencintai orang yang amat besar pengkhianatannya lagi banyak dosanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Janganlah kamu membela seseorang yang berkhianat dan bersungguh-sungguh dalam menyembunyikan pengkhianatannya. Sesungguhnya Allah tidak menyukai para pengkhianat dan pembohong."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Hai Rasulullah janganlah engkau membela orang-orang yang berkhianat dan janganlah engkau membantu mereka ketika sedang berselisih. Sesungguhnya Allah murka terhadap orang yang suka berkhianat dan terbiasa melakukan keburukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. وَلَا تُجٰدِلْ عَنِ الَّذِينَ يَخْتَانُونَ أَنفُسَهُمْ ۚ (Dan janganlah kamu berdebat (untuk membela) orang-orang yang mengkhianati dirinya) Yakni janganlah kamu membela orang-orang yang mengkhianati diri mereka karena akibat buruk dari kemaksiatan mereka akan kembali kepada mereka. إِنَّ اللهَ لَا يُحِبُّ مَن كَانَ خَوَّانًا أَثِيمًا (Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat lagi bergelimang dosa) Makna (الخوان) yakni orang yang banyak berkhianat, dan makna (الأثيم) yakni banyak melakukan dosa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Taimiyah mengatakan : barangsiapa yang menafsirkan daripada perkataan ulama, bahwa kata الاختيان di sini adalah kezhaliman terhadap diri dengan segala dosa baik itu tersembunyi maupun dengan zhahir; maka dari perkataannya perlu dikoreksi; karena khianat hanyalah berlaku pada dosa-dosa yang dilakukan dengan sembunyi, sebagimana dalam firman Allah : { عَلِمَ اللَّهُ أَنَّكُمْ كُنْتُمْ تَخْتَانُونَ أَنْفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنْكُمْ } \"Allah mengetahui bahwasanya kamu tidak dapat menahan nafsumu, karena itu Allah mengampuni kamu dan memberi maaf kepadamu\". [al-Baqarah : 187]"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107 Janganlah kamu berdebat untuk membela orang-orang yang mengkhianati dirinya dengan perbuatan mencuri atau perbuatan zalim lainnya. Atau mereka yang berkhianat dengan maksiat dengan berlebihan. Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat lagi bergelimang dosa dan perbuatan maksiat,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah kamu berdebat} janganlah kamu menentang {untuk (membela) orang-orang yang mengkhianati diri mereka} mereka mengkhianati diri sendiri dengan berbuat maksiat {Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat} orang yang sering berkhianat {dan bergelimang dosa} banyak dosanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. “Dan janganlah kamu berdebat (untuk membela) orang-orang yang mengkhianati dirinya,” kata al-ikhtiyam dan al-Khiyamah maknanya kejahatan, kezhaliman, dan perbuatan dosa, dan ini mencakup larangan dari perdebatan untuk membela orang yang berdosa dan dihadapkan kepadanya sebuah hukuman berupa had ataupun hukuman lainnya, sesungguhnya orang seperti itu tidaklah diperdebatkan untuk membela apa yang telah dilakukannya berupa pengkhianatan atau untuk menolak perkara yang seharusnya menjadi akibat dari perbuatannya berupa hukuman syariat. “Sesungguhnya Allah tidak menyukai orang-orang yang selalu berkhianat lagi bergelimang dosa,” yaitu banyak khianatnya dan dosanya. Dan apabila kecintaan itu lenyap, niscaya yang ada adalah perkara yang sebaliknya yaitu kebencian, yang demikian ini adalah seperti alasan dari larangan yang terdahulu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 107: 107-108. Dan jangánlah engkau mem- hela orang-orang yang mengkhianati diri mereka, karena sesungguh- nya Allah tidak suka orang yang khianat, yang berdosa. Mereka bersembunyi daripada manusia, tetapi mereka tidak bersembunyi daripada Allah, padahal la ada bersama mereka di waktu mereka mengatur-atur, pada malam, perkataan yang la tidak ridla, karena adalah Allah itu mengepung apa-apa yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan maksiat. Dalam ayat ini terdapat larangan berdebat untuk membela orang yang bersalah, atau orang yang terkena hukuman baik hukuman had maupun ta'zir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 107",
    "description": "Dan janganlah kamu, wahai nabi Muhammad dan umatmu, berdebat untuk membela orang-orang yang sengaja dan terus-menerus mengkhianati diri mereka. Sungguh, Allah tidak menyukai, yakni tidak menurunkan rahmat-Nya, kepada orang-orang yang selalu mengulangi perbuatan berkhianat dari waktu ke waktu, dan bergelimang dosamereka yang selalu berkhianat dan bergelimang dosa itu dapat saja bersembunyi dari manusia, termasuk dari kamu sekalian, karena takut ketahuan pengkhianatan dan dosa yang dilakukakannya, tetapi mereka tidak dapat bersembunyi dari Allah. Hal ini disebabkan karena Allah yang mengetahui seluruh gerak-gerik mereka dan apa yang terlintas di dalam hati dan pikiran mereka, selamanya beserta mereka, kapan dan di mana pun mereka berada, dan bahkan ketika pada suatu malam yang gelap gulita lagi tersembunyi mereka tidak diridai-Nya. Dan Allah selamanya maha meliputi pengetahuan dan ilmu-Nya, mencakup seluruh apa yang mereka kerjakan, baik yang tampak maupun yang tersembunyi, yang besar maupun yang kecil, dan yang lahir maupun batin. Menetapkan keputusan rahasia yang"
  }
]