[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka bersembunyi dari pandangan manusia lantaran takut manusia melihat perbuatan buruk mereka, tetapi mereka tidak menutupi diri dari Allah dan tidak malu kepadaNya, padahal Dia selalu bersama mereka dengan ilmuNya,mengawasi mereka ketika mereka mengatur suatu siasat di malam hari yang tidak diridhai Allah. Dan Allah meliputi seluruh ucapan dan perbuatan mereka,tidak ada sesuatu pun yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Mereka bersembunyi dari manusia ketika mereka berbuat maksiat karena takut dan malu, tetapi mereka tidak bersembunyi dari Allah. Allah senantiasa bersama mereka dan mengawasi mereka. Tidak ada sesuatu pun dari mereka yang luput dari pengawasan-Nya tatkala mereka secara sembunyi-sembunyi mengatur kata-kata yang tidak pantas. Seperti membela orang yang berdosa dan menuduh orang yang tidak bersalah. Dan Allah senantiasa mengawasi apa yang mereka perbuat secara sembunyi-sembunyi maupun terang-terangan, tidak ada sesuatu pun yang luput dari pengawasan-Nya, dan Dia akan membalas mereka dengan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Kemudian Allah menjelaskan keadaan orang-orang yang suka berkhianat dan membongkar perbuatan mereka. Allah menjelaskan bahwa para pengkhianat itu selalu sembunyi-sembunyi ketika berbuat dosa, baik itu karena rasa malu atau takut akan mendapat bahaya, namun mereka tidak sembunyi dari Allah dan tidak malu kepada-Nya dengan meninggalkan perbuatan dosa tersebut akibat iman mereka yang sangat lemah, sebab sesungguhnya keimanan itu akan menghalangi seseorang untuk mengulangi perbuatan dosanya. Dan penghianat dan tidak akan terjadi kecuali akibat kelalaian atau ketidaktahuan. Barangsiapa yang mengetahui bahwa Allah melihatnya meski dalam kegelapan niscaya dia akan meninggalkan perbuatan dosa dan khianat karena rasa malu kepada-Nya dan rasa takut dari siksaan-Nya. Allah menyaksikan mereka ketika mereka sedang mengatur siasat pada malam hari dengan perkataan yang tidak diridhoi-Nya, kemudian mereka berlepas diri dari perbuatan itu dan menuduh orang lain yang melakukannya. Sesungguhnya Allah Maha Melihat perbuatan mereka, tidak ada yang tersembunyi dari-Nya sesuatu sekecil apapun baik itu di langit maupun di bumi sehingga tidak ada jalan bagi mereka untuk selamat dari siksaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. يَسْتَخْفُونَ مِنَ النَّاسِ (mereka bersembunyi dari manusia) Yakni bersembunyi dari mereka. وَلَا يَسْتَخْفُونَ مِنَ اللهِ (tetapi mereka tidak bersembunyi dari Allah) Yakni mereka tidak bersembunyi dari Allah dengan meninggalkan perbuatan buruk itu, karena jika mereka melakukannya berarti mereka tidak takut kepada Allah. Maka untuk apa mereka bersembunyi dari Allah -sedangkan mereka tidak takut kepada Allah-. إِذْ يُبَيِّتُونَ (ketika pada suatu malam mereka menetapkan keputusan rahasia) Yakni mengatur siasat diantara mereka di malam hari. مَا لَا يَرْضَىٰ مِنَ الْقَوْلِ ۚ (yang Allah tidak redlai) Yakni berupa keputusan yang mereka inginkan diantara mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108 Mereka orang-orang munafik bersembunyi dari manusia untuk menutupi aibmya, tetapi mereka tidak bersembunyi dari Allah ketika melakukan maksiat, padahal Allah maha mengetahui atas segala sesuatu. Jika mereka melakukan sesuatu maka tidak akan pernah bisa tersembunyi dari Allah. Allah Maha Meliputi (ilmu-Nya) terhadap apa yang mereka kerjakan baik yang tampak maupun tidak tampak. Ketika mereka melakukan sesuatu pada malam gelap, dan melakukan sesuatu yang tidak diridhai Allah dan mereka pun tahu. Sesungguhnya Allah Maha mengawasi dan membalas atas segala amal perbuatan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka dapat bersembunyi dari manusia} mereka bisa menutupinya dari manusia karena malu dan takut {tetapi tidak dapat bersembunyi} tetapi mereka tidak dapat menutupinya dan bersembunyi {dari Allah. Dia bersama mereka} dengan ilmu dan pengawasanNya kepada mereka {ketika pada malam hari mereka bersiasat} merencanakan hal rahasia {tentang sesuatu yang tidak diridaiNya. Allah Maha Meliputi apa yang mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Kemudian Allah menyebutkan tentang orang-orang yang berkhianat tersebut bahwa “mereka bersembunyi dari manusia, tetapi mereka tidak bersembunyi dari Allah, padahal Allah beserta mereka, ketika pada suatu malam mereka menetapkan keputusan rahasia yang Allah tidak ridhai,” yang demikian ini adalah karena lemahnya iman dan kurangnya keyakinan, yaitu rasa takut mereka kepada makhluk lebih besar daripada takut mereka kepada Allah hingga mereka sangat suka memakai jalan-jalan yang mubah dan yang haram agar tidak memiliki aib di sisi manusia, dan disamping hal tersebut mereka telah menentang Allah dengan berbuat dosa-dosa besar, mereka tidak mempedulikan pengawasan dan pemantauan Allah atas mereka, padahal Allah selalu bersama mereka dengan pengetahuan-pengetahuanNYa tentang seluruh keadaan mereka, khususnya pada saat mereka mengadakan tipu daya pada malam hari dalam perkara yang tidak diridhai oleh Allah berupa perkataan untuk menyelamatkan seorang penjahat dan menuduh seorang yang tidak bersalah dengan suatu kejahatan yang tidak diperbuatnya, dan berusaha keras untuk dihadapkan kepada Rasulullah agar beliau melakukan apa yang telah mereka sepakati dalam tipu daya mereka pada malam hari tersebut. Sesungguhnya mereka telah mengumpulkan beberapa kejahatan, mereka tidak merasa diawasi oleh Rabb langit dan bumi Yang mengawasi rahasia-rahasia mereka dan hati-hati mereka, karena itulah Allah mengancam mereka dengan FirmanNya, “Dan Allah maha meliputi (ilmuNYa) terhadap apa yang mereka kerjakan,” yaitu sesungguhnya Allah telah mengetahui semua perkara tersebut, walaupun demikian Allah tidak menyegerakan untuk mereka hukuman atas hal tersebut, akan tetapi DIa menangguhkannya untuk mereka dan menawarkan kepada mereka agar bertaubat, mengingatkan mereka untuk tidak kembali melakukan kemaksiatan mereka yang mengakibatkan hukuman yang pedih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 108: 107-108. Dan jangánlah engkau mem- hela orang-orang yang mengkhianati diri mereka, karena sesungguh- nya Allah tidak suka orang yang khianat, yang berdosa. Mereka bersembunyi daripada manusia, tetapi mereka tidak bersembunyi daripada Allah, padahal la ada bersama mereka di waktu mereka mengatur-atur, pada malam, perkataan yang la tidak ridla, karena adalah Allah itu mengepung apa-apa yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini muncul karena kelemahan iman dan kurangnya keyakinan, sehingga rasa takut kepada manusia lebih besar daripada rasa takut kepada Allah, oleh karenanya mereka berusaha mencari cara, baik yang mubah atau yang haram agar tidak terbuka aibnya di tengah-tengah manusia, mereka tidak peduli bahwa Allah melihat dan menyaksikan mereka. Padahal Dia bersama mereka dengan ilmu-Nya, di mana Dia mengetahui seluk-beluk mereka, khususnya ketika mereka merencanakan makar jahat, yaitu rencana membersihkan orang yang bersalah dan melemparkan kesalahan kepada orang yang tidak bersalah serta berusaha agar Beliau melakukan apa yang mereka rencanakan. Ilmu-Nya meliputi apa yang mereka kerjakan, namun demikian Dia tidak segera menghukum mereka, bahkan menundanya dan menawarkan tobat kepada mereka serta memperingatkan mereka untuk berhenti dari dosa, karena hal itu menyebabkan mereka mendapat hukuman yang berat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 108",
    "description": "Mereka yang selalu berkhianat dan bergelimang dosa itu dapat saja bersembunyi dari manusia, termasuk dari kamu sekalian, karena takut ketahuan pengkhianatan dan dosa yang dilakukakannya, tetapi mereka tidak dapat bersembunyi dari Allah. Hal ini disebabkan karena Allah yang mengetahui seluruh gerak-gerik mereka dan apa yang terlintas di dalam hati dan pikiran mereka, selamanya beserta mereka, kapan dan di mana pun mereka berada, dan bahkan ketika pada suatu malam yang gelap gulita lagi tersembunyi mereka tidak diridai-Nya. Dan Allah selamanya maha meliputi pengetahuan dan ilmu-Nya, mencakup seluruh apa yang mereka kerjakan, baik yang tampak maupun yang tersembunyi, yang besar maupun yang kecil, dan yang lahir maupun batin. Menetapkan keputusan rahasia yang pada ayat ini Allah mempertanyakan siapa yang dapat menentang Allah dan melindungi mereka dari azab-Nya di akhirat. Begitulah kamu! kamu berdebat untuk membela mereka, dan mungkin saja kamu dapat membela mereka dan melindungi mereka dalam kehidupan di dunia ini, tetapi siapa yang akan menentang Allah untuk membela mereka pada hari kiamat' atau siapakah yang menjadi pelindung mereka terhadap azab Allah di akhirat' tidak satu pun yang dapat melakukannya."
  }
]