[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Itulah kalian (wahai kaum Mukminin), kalian mengemukakan hujjah untuk membela orang-orang yang berbuat pengkhianatan di kehidupan dunia ini, tetapi siapakah yang akan mendebat Allah untuk membela mereka pada hari kebangkitan dan hari perhitunagn amal? Dan siapakah gerangan yang akan mengurusi urusan pengkhianatan itu pada hari kiamat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Kalian -wahai orang-orang yang membela urusan orang yang berbuat dosa- bisa berdebat untuk membela mereka di dunia guna membuktikan bahwa mereka tidak bersalah dan membebaskan mereka dari hukuman. Tetapi siapakah yang akan berdebat dengan Allah untuk membela mereka kelak di hari Kiamat, sedangkan kalian telah mengetahui keadaan mereka yang sebenarnya? Dan siapakah yang akan menjadi pelindung mereka pada hari itu? Tidak ada keraguan bahwa tidak ada satu pun yang sanggup melakukan hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Kemudian Allah memperingatkan orang-orang beriman agar tidak membantu para pengkhianat: demikianlah kalian, kalian membela mereka di dunia dan berusaha menyatakan bahwa mereka tidak bersalah, namun Siapakah yang akan membela mereka di hari kiamat melawan Allah, yaitu hari dimana lawan dan pengambilan keputusan adalah Allah yang Maha Mengetahui segala perbuatan dan keadaan mereka serta keadaan seluruh makhluk? Yakni tidak ada seorangpun yang dapat membela mereka pada hari itu atau menjadi pengganti mereka dalam menyelesaikan perkara mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. هٰٓأَنتُمْ هٰٓؤُلَآءِ (Beginilah kamu) Yang dimaksud adalah kaum (Bani Ubairiq) yang membela anggotanya, yakni si pencuri yang sesungguhnya. جٰدَلْتُمْ عَنْهُمْ فِى الْحَيَوٰةِ الدُّنْيَا فَمَن يُجٰدِلُ اللهَ عَنْهُمْ يَوْمَ الْقِيٰمَةِ(kamu sekalian adalah orang-orang yang berdebat untuk (membela) mereka dalam kehidupan dunia ini. Maka siapakah yang akan mendebat Allah untuk (membela) mereka pada hari kiamat?) Yakni ketika mereka diazab karena dosa-dosa mereka, sedangkan Allah mengetahui segala siasat yang mereka buat. أَم مَّن يَكُونُ عَلَيْهِمْ وَكِيلًا(Atau siapakah yang menjadi pelindung mereka (terhadap siksa Allah)?) Yakni untuk menolong dan membela mereka dengan mewakili siksaan atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109 Wahai kaum yang berdebat dengan batil tentang pencuri Thu’mah dan orang yang membantunya , kamu sekalian adalah orang-orang yang berdebat untuk (membela) mereka dalam kehidupan dunia ini. Maka siapakah yang akan mendebat Allah untuk membela mereka pada hari kiamat saat mereka disiksa atas dosa mereka? Atau siapakah yang menjadi pelindung mereka terhadap siksa Allah?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Begitulah kalian} orang-orang {yang kalian berdebat} membela {untuk mereka dalam kehidupan dunia ini. siapa yang akan menentang} menentang {Allah untuk (membela) mereka pada hari Kiamat? Atau siapakah yang menjadi pelindung mereka} penjaga dan pelindung dari siksaan dan hukuman Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. “Beginilah kamu, kamu sekalian adalah orang-orang yang berdebat untuk (Membela) mereka dalam kehidupan dunia ini. Maka siapakah yang akan mendebat Allah untuk (membela) mereka pada Hari Kiamat? Atau siapakah yang menjadi pelindung mereka (terhadap siksa Allah)?” maksudnya terserah kalian, kalian berdebat untuk membela mereka dalam kehidupan dunia ini dan perdebatan kalian itu dapat menolong mereka dari beberapa perkara yang mereka khawatirkan berupa rasa aib dan hilangnya kehormatan di hadapan manusia, lalu apa yang berguna dan yang bermanfaat untuk mereka? Dan siapakah yang mendebat Allah untuk menolong mereka pada Hari Kiamat kelak, ketika hujjah dihadapkan kepada mereka, sedang lisan, tangan, dan kaki, dan mereka bersaksi atas mereka sendiri tentang apa yang telah mereka perbuat? Pada hari itu Allah akan memberi mereka balasan yang setimpal menurut semestinya, dan mereka mengetahui bahwa Allah-lah Yang benar lagi Yang menjelaskan (segala sesuatu menurut hakikat yang sebenarnya), maka siapakah yang (bisa atau mampu) berdebat untuk menolong mereka terhadap Dzat Yang mengetahui rahasia dan perkara yang tersembunyi dan Dzat Yang menegakan untuk mereka saksi-saksi yang tidak mungkin lagi diingkari? Ayat ini menyimpan arahan dalam perkara untuk menimbang-nimbang antara suatu hal yang diperkirakan merupakan kemaslahatan duniawi yang mengakibatkan ditinggalkannya perintah-perintah Allah atau dikerjakannya larangan-laranganNYa dengan perkara yang mengakibatkan hilangnya pahala atau mendapat siksa dan hukuman di akhirat, sehingga hendaknya orang nafsunya memerintahkan dirinya untuk meninggalkan perintah Allah, berkata (pada dirinya), “Inilah dirimu yang telah meninggalkan perintah Allah karena malas dan lalai, lalu faidah apa yang telah kamu peroleh darinya? Dan apa yang telah hilang darimu berupa pahala akhirat? Dan apa yang dihasilkan dari tindakanmu meninggalkan perintah itu kecuali kesengsaraan, kehilangan, kegagalan, dan kerugian?” demikian juga bila nafsunya mengajaknya kepada hal-hal yang disukainya dari syahwat-syahwat yang haram, ia berkata kepadanya, “Terserah dirimu melakukan apa yang kamu sukai, karena kenikmatannya akan lenyap lalu diikuti kegelisahan, kebimbangan, penyesalan, hilangnya pahala, hadirnya hukuman, di mana sebagian dari akibat itu mencukupkan seorang yang berakal agar mengendalikan nafsu tersebut,” hal seperti ini adalah di antara perkara yang paling berguna bagi hamba untuk direnungkan olehnya, yaitu fungsi akal yang hakiki, seperti itu, sesungguhnya dengan kebodohan dan kezhalimannya, ia mendahulukan kenikmatan kenikmatan yang sesaat dan ketenangan yang sebentar walaupun mengakibatkan apa yang akan diterimanya dari hukuman-hukuman, dan hanya kepada Allah-lah kita memohon pertolongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 109: Awas! Kamu (ini) orang- orang yang telah membela mereka itu dipenghidupan dunia. Maka siapakah yang akan membela mereka pada hari Kiamat? Atau siapakah yang akan jadi pengurus atas mereka?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Siapakah yang berani menentang Allah ketika hujjah telah mengenai mereka? Siapakah yang berani menentang Allah; Tuhan yang mengetahui segala yang rahasia dan yang tersembunyi? Siapakah yang berani menentang Allah; Tuhan yang mengadakan saksi kuat yang tidak mungkin diingkari; lisan, tangan dan kaki dijadikan saksi? Dalam ayat ini terdapat bimbingan agar seseorang membandingkan antara kepentingan dunia yang didapatkan dari meninggalkan perintah dan mengerjakan larangan dengan hilangnya pahala di akhirat yang dan hukuman yang akan diperoleh. Oleh karena itu, ketika dirinya diperintahkan oleh hawa nafsunya meninggalkan perintah Allah, ia berkata kepada dirinya, \"Mengapa anda meninggalkan perintah-Nya, padahal apa manfaat yang kamu dapatkan dari meninggalkan perintah?\" Betapa banyak pahala di akhirat yang luput bagi anda?\" Bahkan karena meninggalkan perintah itu, anda mendapatkan kesengsaraan, kerugian dan kekecewaan?\" Demikian juga apabila dirinya diajak kepada kesenangan-kesenangan yang haram, dia berkata kepada dirinya, \"Ya, anda memang mengerjakan perbuatan yang anda sukai, namun kesenangannya hanya sementara, dan setelahnya kesedihan, penderitaan dan penyesalan, tidak mendapatkan pahala dan malah mendapatkan siksa\". Cukuplah sebagian dari akibat itu membuat orang yang berakal berhenti dari mengerjakannya. Memikirkan hal ini termasuk sesuatu yang paling bermanfaat bagi seorang hamba, dan seperti inilah orang yang berakal secara hakiki, berbeda dengan orang yang mengaku berakal, namun tidak seperti itu, sehingga ia mendahulukan kesenangan sementara daripada kesenangan yang kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 109",
    "description": "Pada ayat ini Allah mempertanyakan siapa yang dapat menentang Allah dan melindungi mereka dari azab-Nya di akhirat. Begitulah kamu! kamu berdebat untuk membela mereka, dan mungkin saja kamu dapat membela mereka dan melindungi mereka dalam kehidupan di dunia ini, tetapi siapa yang akan menentang Allah untuk membela mereka pada hari kiamat' atau siapakah yang menjadi pelindung mereka terhadap azab Allah di akhirat' tidak satu pun yang dapat melakukannyadan barang siapa berbuat kejahatan, atau berbuat dosa terhadap orang lain yang menimbulkan dampak buruk terhadap diri mereka, atau menganiaya dirinya, yaitu melakukan perbuatan dosa yang berdampak buruk hanya terhadap dirinya sendiri, kemudian dia memohon ampunan kepada Allah atas perbuatan dosa yang dilakukannya itu disertai penyesalan atas perbuatannya dan bertekad untuk tidak melakukannya lagi, niscaya dia akan mendapatkan Allah maha pengampun atas dosadosanya dan segala dosa yang dilakukan oleh siapa pun yang bertobat kepada-Nya, maha penyayang dengan mencurahkan rahmat dan karunia-Nya kepada mereka yang bertobat."
  }
]