[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mewasiatkan kepada kalian dan memerintahkan kalian terkait kepentingan anak-anak kalian. Bila sesorang dari kalian meninggal dunia dan dia meninggalkan anak-anak, lelaki maupun perempuan, maka harta warisan itu seluruhnya menjadi milik mereka, bagi anak lelaki setara dengan bagian dua anak perempuan, apabila tidak ada ahli waris selain mereka. Maka Jika meninggalkan anak-anak perempuan saja,maka bagi dua anak perempuan atau lebih,dua pertiga dari harta yang ditinggalkan. Apabila anak perempuannya berjumlah seorang anak saja,maka baginya setengah dari harta. Dan bagi ayah-ibu mayit, masing-masing memperoleh seperenam, jika si mayit memiliki anak, lelaki atau perempuan, berjumlah satu orang anak atau lebih. Dan apabila yang meninggal tidak mempunyai anak, sedang ahli warisnya hanya ibu-dan bapaknya, maka bagi ibunya, bagian sepertiga, dan bagi ayahnya bagian yang tersisa. Lalu jika yang meninggal mempunyai saudara, berjumlah dua orang atau lebih, baik lelaki ataupun perempuan, maka ibunya mendapatkan seperenam, ayahnya bagian yang tersisa, sedang saudara-saudara mayit tidak mendapatkan apa-apa. Cara pembagian harta warisan ini hanya dilakukan setelah disisihkannya harta yang di wasiatkan oleh orang yang meninggal dalam batasan sepertiganya atau disisihkannya nominal sebesar tanggungan hutangnya. Bapak-bapak dan anak-anak kalian yang telah di tetapkan menerima bagian harta warisan, kalian tidak mengetahui siapakah diantara mereka yang lebih mendatangkan manfaat dalam kehidupan dunia dan akhirat kalian. Maka janganlah lebih mengutamakan seseorang dari mereaka diatas yang lain. Apa yang telah Aku tetapkan ini merupakan perkara yang diwajibkan kepada kalian dari Allah. Sesungguhnya Allah maha mengetahui makhluk-makhlukNYA, juga maha bijaksana dalam perkara yang di syariatkanNYA bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Allah mewasiatkan dan memerintahkan kepada kalian perihal pembagian warisan kepada anak-anak kalian, bahwa warisan itu dibagikan kepada mereka dengan ketentuan anak laki-laki mendapatkan dua kali lipat bagian anak perempuan. Apabila si mayat (pewaris) meninggalkan anak-anak perempuan tanpa anak laki-laki, maka dua anak perempuan atau lebih mendapatkan dua pertiga dari warisan yang ditinggalkannya. Jika anak perempuannya satu orang saja, maka ia mendapatkan setengah dari warisan yang ditinggalkannya. Sedangkan ayah dan ibu si mayat masing-masing mendapatkan seperenam dari warisan yang ditinggalkannya jika si mayit mempunyai anak, baik laki-laki maupun perempuan. Namun bila si mayat tidak mempunyai anak dan tidak ada ahli waris lain selain ayah dan ibunya, maka si ibu mendapatkan sepertiga, dan sisa warisannya menjadi milik ayahnya. Apabila si mayat mempunyai dua orang saudara atau lebih, baik laki-laki maupun perempuan, baik saudara kandung maupun bukan, maka ibunya mendapatkan seperenam secara kadar pasti, dan sisanya menjadi milik sang ayah secara 'aṣabah (hak sisa dari jatah warisan). Sedangkan saudara-saudaranya tidak mendapatkan apa-apa. Pembagian warisan itu dilaksanakan setelah pelaksanaan wasiat yang diwasiatkan oleh si mayat. Namun dengan syarat wasiat itu tidak lebih dari sepertiga harta si mayat, dan setelah hutangnya dibayarkan. Allah -Ta'ālā- menjadikan pembagian harta warisan seperti itu karena kalian tidak tahu siapa di antara para orangtua dan anak-anak itu yang lebih bermanfaat bagi kalian di dunia dan di Akhirat. Karena boleh jadi si mayat berprasangka baik kepada salah satu ahli warisnya sehingga ia memberikan seluruh hartanya kepada orang tersebut; atau bisa jadi ia berprasangka buruk kepada salah satu ahli warisnya sehingga ia tidak memberinya warisan sedikit pun. Padahal kondisi yang sebenarnya bisa jadi sebaliknya. Yang mengetahui semua itu hanyalah Allah Yang Maha Mengetahui segala sesuatu. Oleh karena itulah Allah membagi warisan secara rinci dan menjadikannya sebagai ketentuan yang wajib dijalankan oleh hamba-hamba-Nya. Sesungguhnya Allah Maha Mengetahui kemaslahatan hamba-hamba-Nya, tidak ada sesuatu yang luput dari pengetahuan-Nya, dan Maha Bijaksana dalam menetapkan syariat-Nya dan mengatur makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah memerintahkan kalian dalam perkara hak anak-anak kalian dalam harta warisan. Jika salah seorang dari kalian mati dan meninggalkan anak keturunan, maka harta warisannya adalah untuk anak laki-laki dua kali lipat dari bagian anak perempuan jika tidak ada ahli waris selain anak. Jika ia meninggalkan anak-anak perempuan saja, maka jika anak perempuan berjumlah dua orang lebih maka bagi mereka dua pertiga dari harta warisan; dan jika anak perempuannya hanya seorang, maka baginya setengah harta warisan. Dan bagi kedua orangtua mayit, bagi mereka masing-masing seperenam jika mayit meninggalkan anak. Namun jika mayit tidak meninggalkan anak, maka bagi ibunya sepertiga dan bagi ayahnya dua pertiga. Namun jika mayit memiliki saudara yang berjumlah dua orang lebih, maka bagi ibu seperenam, dan ayah mendapatkan sisanya. Hak-hak bagi ahli waris ini ditunaikan setelah menjalankan wasiat si mayit yang sesuai syariat dan setelah pembayaran hutangnya. Dan tidak ada seseorang yang mengetahui pendahulu atau penerusnya yang mana yang akan dapat memberinya manfaat jika telah mati. Hukum-hukum agung ini merupakan kewajiban dari Allah, Dia Maha mengetahui perkara hamba-hamba-Nya dan Maha Bijaksana dalam menentukan syariat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. يُوصِيكُمُ اللهُ فِىٓ أَوْلٰدِكُمْ (Allah mensyari’atkan bagimu tentang anak-anakmu) Yakni anak-anak orang yang meninggal dari kalian. (wasiat) Syariat tersebut berupa penjelasan harta warisan mereka. Dan apabila diantara anak-anak tersebut terdapat anak laki-laki maka baginya sisa harta warisan setelah pembagian, sebagaimana disebutkan dalam hadist shahih yang berbunyi: (serahkalah bagian-bagian warisan itu kepada ahlinya yang berhak, dan apabila terdapat harta lebih maka itu untuk anak laki-laki yang paling dekat (hubungan keturunan dengan si mayit)). Dan apabila tidak terdapat anak laki-laki diantara mereka maka sisa harta itu diberikan kepada cucu laki-laki si mayit dari jalur anak laki-laki. لِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْنِ ۚ (bahagian seorang anak lelaki sama dengan bagahian dua orang anak perempuan) Yakni apabila terdapat anak laki-laki dan perempuan. فَإِن كُنَّ نِسَآءً فَوْقَ اثْنَتَيْنِ (dan jika anak itu semuanya perempuan lebih dari dua) Yakni apabila anak-anak dari mayit itu perempuan semua tanpa ada laki-laki. فَلَهُنَّ ثُلُثَا مَا تَرَكَ ۖ( maka bagi mereka dua pertiga dari harta yang ditinggalkan) Yakni dari harta yang ditinggalkan si mayit. Dan apabila anak perempuan itu berjumlah dua orang maka mereka juga mendapatkan dua pertiga, diqiyaskan dengan dua saudara perempuan yang disebutkan pada akhir ayat di surat ini. Dan apabila anak perempuan itu seorang saja, maka ia memperoleh separuh harta. وَلِأَبَوَيْهِ(Dan untuk dua orang ibu-bapa) Yakni untuk kedua orangtua mayit apabila masih hidup. لِكُلِّ وٰحِدٍ مِّنْهُمَا السُّدُسُ مِمَّا تَرَكَ إِن كَانَ لَهُۥ وَلَدٌ ۚ( bagi masing-masingnya seperenam dari harta yang ditinggalkan, jika yang meninggal itu mempunyai anak) Baik itu anak laki-laki atau perempuan, satu atau lebih, atau bahkan cucu. فَإِن لَّمْ يَكُن لَّهُۥ وَلَدٌ(jika orang yang meninggal tidak mempunyai anak) Tidak pula mempunyai cucu. وَوَرِثَهُۥٓ أَبَوَاهُ(dan ia diwarisi oleh ibu-bapanya (saja)) Yakni tidak ada ahli waris yang lain selain mereka berdua seperti suami atau istri, dan kedua orangtua tersebut memiliki hak waris tanpa ada sebab yang menghalangi pewarisannya. فَلِأُمِّهِ الثُّلُثُ ۚ( maka ibunya mendapat sepertiga) Dan dua pertiga sisanya untuk bapak. Namun apabila salah satu suami-istri turut menjadi ahli waris maka tidak mendapatkan kecuali sepertiga dari sisa pembagian salah satu suami-istri. فَإِن كَانَ لَهُۥٓ إِخْوَةٌ فَلِأُمِّهِ السُّدُسُ ۚ( jika yang meninggal itu mempunyai beberapa saudara, maka ibunya mendapat seperenam) Baik itu saudara laki-laki atau perempuan atau keduannya. Dan baik itu dua orang atau lebih; adapun satu orang saudara maka ia tidak menghalangi ibu dari mendapatkan sepertiga menjadi seperenam. مِنۢ بَعْدِ وَصِيَّةٍ يُوصِى بِهَآ أَوْ دَيْنٍ ۗ( (Pembagian-pembagian tersebut di atas) sesudah dipenuhi wasiat yang ia buat atau (dan) sesudah dibayar hutangnya) Yakni harta itu tidak dibagikan kepada orang-orang yang telah disebuhkan mendapat dua pertiga, sepertiga, seperenam, atau yang lainnya kecuali setelah ditunaikannya wasiat si mayit yang berkenaan dengan hartanya, dan setelah dilunasi hutangnya. Dan pelunasan hutang didahulukan sebelum penunaian wasiat, kemudian sisa dari harta tersebut dibagikan kepada para ahli waris. Adapun wasiat tidak boleh melebihi sepertiga harta kecuali dengan kerelaan para ahli waris. ءَابَآؤُكُمْ وَأَبْنَآؤُكُمْ لَا تَدْرُونَ أَيُّهُمْ أَقْرَبُ لَكُمْ نَفْعًا ۚ( orang tuamu dan anak-anakmu, kamu tidak mengetahui siapa di antara mereka yang lebih dekat (banyak) manfaatnya bagimu) Maka dari itulah Allah membagikan harta warisan sedemikian rupa, dengan membagikan kepada orangtua dan nenek moyang kalian, dan kepada anak keturunan kalian; dan tidak menyerahkan pembagiannya kepada kalian. فَرِيضَةً مِّنَ اللهِ ۗ (Ini adalah ketetapan dari Allah) Yakni hukum-hukum pada ayat ini wajib atas kalian sebagai ketetapan dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Allah memerintahkan dan mensyariatan untuk kalian tentang perkara warisan untuk anak-anak kalian yaitu agar membagikan untuk anak laki-laki sebanyak dua kali lipat bagian anak perempuan, jika ada dua gender anak. Namun jika anak-anaknya hanya perempuan dan berjumlah lebih dari 2 maka bagi mereka itu dua pertiga warisan seperta dua saudara yang hukumnya telah disebutkan di ayat terakhir dari surah ini. Dan jika hanya 1 anak perempuan saja, maka baginya itu separuh harta warisan, dan untuk masing-masing orang tua mayit (ayah atau ibu) itu seperenam jika mayit itu memiliki anak baik laki-laki atau perempuan. Dan jika mayit tidak memiliki anak sehingga tidak ada pewaris lainnya, maka bagi ibu itu sepertiga bagian dan sisanya untuk ayah. Dan jika mayit itu memiliki saudara baik laki-laki atau perempuan, maka untuk ibu itu seperenam bagian dan sisanya untuk ayah jika mayit tidak memiliki anak, karena ayah itu mencakup saudara. Dan pembagian harta warisan itu tidak dilakukan kecuali usai membayar hutang yang ada, dan tertunaikannya wasiat yang diberikan oleh mayit. Dan tidak ada yang tahu apapun yang labih bermanfaat bagi mayit di dunia dan akhirat dengan berdoa dan bersedekah. Dan hukum-hukum ini adalah kewajiban dari Allah. Dialah Dzat yang Maha Mengetahui ciptaanNya dan Maha Bijaksana dalam Mengatur dan Mentakdirkan. Jabir berkata: “Rasulullah SAW dan Abu Bakar kembali kepadaku yang tinggal bersama Bani Salamah dengan jalan kaki. Nabi SAW mendapati aku tidak tahu apapun, lalu beliau meminta air dan berwudhu kemudian memercikkan air kepadaku dan aku menghadap beliau dan berkata: “apakah yang engkau perintahkan kepadaku dalam mengatur hartaku ini?” Lalu turunlah ayat {Yuushiikumullahu …}” Ayat ini menjelaskan tentang pemberian warisan untuk kedua orang tua dan anak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah mensyariatkan kepada kalian tentang anak-anak kalian} mengharuskan kepada kalian tentang perkara pemberian warisan kepada anak-anak kalian {bagi anak laki-laki bagian} bagian {yang sama dengan bagian dua anak perempuan. Jika anak itu jumlah perempuan lebih dari dua, maka bagian mereka dua pertiga dari harta yang ditinggalkan. Jika anak perempuan itu seorang saja, dia memperoleh setengah. Untuk kedua orang tua} dan bagi orang tua dari orang yang meninggal {masing-masing mendapat seperenam dari harta yang ditinggalkan jika yang meninggal mempunyai anak. Jika yang meninggal tidak mempunyai anak dan dia diwarisi oleh kedua orang tuanya, ibunya mendapat sepertiga. Jika dia mempunyai beberapa saudara} dua saudara atau lebih baik laki-laki ataupun perempuan {ibunya mendapat seperenam setelah wasiat yang dibuatnya atau (dilunasi) utangnya} setelah dilunasi hutangnya {orang tua dan anak-anak kalian itu tidak kalian ketahui siapa di antara mereka yang lebih banyak manfaatnya bagi kalian. Ini adalah ketetapan Allah. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Ayat-ayat ini dan ayat pada akhir surat ini adalah ayat-ayat tentang warisan yang mengandung penjelasannya, ditambah hadits Abdullah bin abbas yang termaktub dalam shahih bukhari. \"berikanlah bagian warisan kepada pemiliknya, adapun yang tersisa maka untuk ahli waris lai-laki yang pertama\". Semua dalil diatas mengandung sebagian hukum-hukum warisan bahkan seluruhnya sebagaimana yang akan anda lihat nantinya, kecuali warisan untuk nenek, (ibunya ibu atau baapak)karena tidak tersebutkan dalam dail-dalil diatas. tetapi ada dalam riwayat shahih dalam assunan dari al mughirah bin syu’bah dan Muhammad bin maslamah bahwasannya nabi memberikan kepada nenek seperenam ditambah dengan adanya ijma’ para ulama atas hal tersebut. Firman Allah “Allah mensyariatkan bagimu tentang (pembagian pusakan untuk) anak-anakmu.” Maksudnya, anak-anak kalian wahai para orangtua, dimana mereka itu adalah amanah bagi kalian dan sesungguhnya Allah telah mewasiatkan mereka kepada kalian agar kalian mengurus kemaslahatan mereka, baik agama maupun dunia mereka, maka kalian harus mengajar mereka, mendidik mereka, dan menghalangi mereka dari kerusakan.memerintahkan mereka untuk taat kepada Allah dan konsisten dalam ketakwaan secara terus menerus, sebagaimana Allah berfirmanai orang-orang yang beriman, peliharalah dirimu dan keluargamu dari api neraka yang bahan bakarnya adalah manusia dan batu, ” Sebenarnya anak-anak telah diwasiatkan kepada orangtua mereka, bila para orang tua menunaikan wasiat tersebut , maka mereka mendapat balasan yang berlimpah dan bila mereka melalaikannya maka mereka berhak menerima ancaman dan siksaan. Ini diantara yag menunjukkan bahwa Allah lebih penyayang terhadap hamba-hambaNya daripada kedua orangtua, dimana Allah telah mewasiatkan kepada kedua orangtua padahal mereka telah memiliki kasih sayang yang sangat besar terhadap anak-anak mereka. Kemudian Allah menyebutkan tentang cara pewarisan mereka. Allah berfirman ”bagian seorang anak laki-laki sama dengan bagian dua orang anak perempuan.” yaitu, anak-anak atau anak dari anak laki-laki(cucu), bagian anak laki-laki sama dengan bagian dua orang anak perempuan bila tidak ada seorang ahli waris yang memiliki hak tertentu. Para ulama telah berjima’ tentang hal tersebut. Dan bahwasannya dengan adanya anak-anak maka harta warisan adalah milik mereka dan tidak ada bagian sama sekali dari anak laki-laki (cucu) dimana anak-anak tersebut adalah laki-laki dan perempuan. Ini dengan bersatunya laki-laki dan perempuan. Dalam hal ini ada dua kondisi; hanya laki-laki saja dan akan datang ketentuannya dan hanya perempuan saja. Allah telah menyebutkan hal itu dalam firmanyNya ”Dan jika anak itu semuanya perempuan lebih dari dua,” yaitu, anak perempuan atau anak perempuan dari anak laki-laki (cucu perempuan) tiga orang atau lebih.” maka bagi mereka dua pertiga dari harta yang ditinggalkan .Jika anak perempuan itu seorang saja, ”yaitu seorang anak perempuan atau anak perempuan dari anak laki-laki (cucu perempuan) “maka ia memperoleh separauh harta.” ini merupakan ijma’. Penting ditanyakan darimana diambil dasar hokum bagi dua orang anak perempuan mendapatkan duapertiga setelah adanya ijma’ akan hal tersebut? maka jawabannya adalah; bahwasannya itu diambil dari firman Allah “jika anak perempuan itu seorang saja, maka ia memperoleh separuh harta.” itu artinya, jika lebih dari satu maka hak tertentu itu beralih dari setengah dan urutan persentase setelah (setengah) tersebut adalah dua pertiga. Demikian juga firman Allah “bagian anak laki-laki sama dengan bagian anak perempuan” apabila seseorang meninggalkan seorang anak laki-laki dan anak seorang perempuan, maka anak laki-laki itu mendapatkan dua pertiga. Dan Allah telah mengabarkan bahwa bagian anak laki-laki itu seperti bagian dua anak perempuan dengan demikian itu menunjukkan bahwa dua anak perempuan mendapatkan dua pertiga. Begitu juga seorang anak perempuan apabila mendapatkan bagian sepertiga bersama saudara laki-lakinya padahal ia lebih besar kemudharatannya daripada saudara lainnya yang perempuan, maka bagian sepertiga itu bersama saudara lain yang perempuan adalah lebih utama dan lebih patut. Demikian juga firman Allah tentang dua saudara perempuan ”tetapi jika saudara perempuan itu dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal.” Itu adalah sebuah nash yang jelas tentang dua saudara perempuan. Maka apabila dua orang saudara perempuan itu dengan jauhnya jarak mereka mendapatkan dua pertiga, maka dua anak perempuan dengan dekatnya jarak adalah lebih utama dan lebih patut. Nabi saw telah memberikan kedua orang anak perempuan sa’sd dua pertiga, sebagaimana yang termaktub dalam kitab ash-shahih. Lalu apa faidah dari firman Allah “lebih dari dua?” faidah firman Allah itu hanya Allah yang lebih mengetahuinya adalah agar diketahui bahwa hak tertentu yaitu dua pertiga tersebut tidaklah bertambah dengan bertambahnya jumlah mereka lebih dari dua orang, akan tetapi jumlah tersebut untuk dua orang atau lebih. Ayat ini menunjukkan bahwa apabila didapatkan seorang anak perempuan dan satu anak beberapa anak perempuan dari anak laki-laki (cucu) maka anak perempuan itu mendapatkan setengah dan tersisa dari dua pertiga yang telah ditetapkan oleh Allah bagi anak-anak perempuan atau anak-anak perempuan dari anak laki-laki(cucu) seperenam, lalu diberikanlah bagian itu kepada seorang anak atau beberapa anak perempuan dari anak laki-laki (cucu). Oleh karena itu bagian seperenam tersebut dinamakan pelengkap bagi dua pertiga. Kondisi seperti itu terjadi juga bagi anak perempuan dari anak laki-laki (cucu) bersama anak-anak perempuan dari anak laki-laki (anaknya cucu) yang lebih bawah darinya. Ayat ini juga menunjukan bahwa ketika anak-anak perempuan itu atau anak-anak perempuan dari anak laki-laki itu telah mengambil seluruh bagian dua pertiga itu maka hilanglah bagian selain mereka (dibawah mereka) dari anak-anak perempuan dari anak-anak laki-laki , karena Allah tidak menetapkan bagian mereka kecuali dua pertiga saja dan bagian itu telah habis mereka ambil. Sekiranya mereka tidak gugur haknya, niscaya hal itu mengakibatkan ditetapkannya bagi mereka lebih banyak lagi dari dua pertiga, dan hal itu bertentangan dengan nash yang sudah ada. Ketentuan hukum-hukum tersebut telah disepakati oleh para ulama dan segala pujian hanya bagi Allah. Firman Allah “dari harta yang ditinggalkan,” menunjukkan bahwa seluruh ahli waris mewarisi apa yang ditinggalkan oleh seseorang yang meninggal, berupa rumah, perabot, emas, perak ataupun yang lainnya, hingga (diyat) denda yang belum terlaksana kecuali setelah ia meninggal juga hutang –hutang yang dipikulnya. Kemudian Allah menyebutkan warisan kedua orang tua, dalam firmannya “dan untuk dua orang ibu bapak.” yaitu, ayah orang yang meninggal atau ibunya, ”bagi masing-masingnya seperenam dari harta yang ditinggalkan jika yang meninggal itu mempunyai anak,” yaitu anak-anak si mayit atau cucu cucunya dari anak laki-lakinya, yang laki-laki maupun perempuan seorang ataupun banyak. Adapun ibu, ia mendapat tidak lebih dari seperenam bersama dengan adanya beberapa anak laki-laki tidak berhak medapat lebih dari seperenam. Apabila anak tersebut seorang perempuan atau beberapa perempuan dan tidak ada lagi warisan yang tersisa setelah pembagian hak-hak yang tertentu, seperti kedua orang tua dan dua orang anak perempuan, maka mereka tidak mempunyai bagiannya lagi dari ashabah (sisa pembagian) dan apabila masih tersisa setelah pembagian anak perempuan atau beberapa anak perempuan maka ayah mendapatkan seperenam karena hak tertentu dan sisa pembagian karena ashabah. Hal itu karena kita telah memberikan hak-hak tertentu kepada pemiliknya, dan apa yang tersisa darnya maka yang lebih berhak adalh yang lelaki dan ayah lebih berhak lebih dahulu daripada saudara si mayit, pamannya, atau yang lainnya. Jika orang yang meninggal tidak mempunyai anak dan ia diwarisin oleh ibu bapaknya (saja) maka ibunya dapat sepertiga.” maksudnya yang tersisa adalah ayah.sedang ibu hanya satu kali sandaran saja. Kemudian Allah menentukan hak bagian ibu.Itu menunjukkan bahwa sisanya adalah hak ayah. Dengan demikian diketahui bahwa ayah dalam kondisi tidak adanya anak-anak dari si mayit, tidak memiliki hak tertentu, akan tetapi ia mewarisi dengan cara ashabah seluruh harta atau apa-apa yang tersisa dari pembagian hak-hak yang tertentu. Akan tetapi apabila didapatkan bersama kedua orang tua salah seorang dari suami atau istrinya dari si mayit yang diistilahkan dengan umariyatain maka suami atau istri mengambil haknya yang tertentu, kemudian ibu mengambil sepertiga dari sisa pembagian itu dan ayah mendapat sisanya. Ini berlandaskan firman Allah “dan ia diwarisi oleh bu bapaknya (saja) maka ibunya dapat sepertiga,” yaitu sepertiga dari apa yang akan diwarisi oleh kedua orang tua tersebut dan itu terwujud dalam kedua kondisi berikut; seperenam pada kondisi (yang menjadi ahli waris adalah) suami, ayah, dan ibu atau seperempat pada kondisi(yang mewarisi adalah) istri, ayah dan ibu. Ayat itu tidak mewarisi bahwa ibu mewarisi dari sepertiga dari harta secara penuh dengan tidak adanya anak-anak si mayit, hingga dikatakan sesungguhnya kedua kondisi itu telah dikecualikan dari hal tersebut. Dan penjelasan dari hal itu adalah bahwa apa yang diambil oleh suami atau istri seperti apa yang diambil oleh orang-orang yang memiliki hutang atas si mayit, yaitu diambil dari jumlah harta si mayit secara keseluruhan dan sisa dari itu adalah hak kedua orang tua. Dan didasari pula oleh karena bila kita memberikan kepada ibu sepertiga harta warisan, pastilah bagian ibu lebih banyak dari ayah pada kondisi adanya suami, atau ayah akan mengambil pada kondisi adanya istri lebih banyak dari ibu setengah dari seperenam. Ini tidak ada kesamaannya, dan yang seharusnya adalah persamaannya dengan ayah atau ayah mengambil dua kali lipat dari apa yang diambil dari ibu. “jika yang meninggal itu mempunyai beberapa saudara, maka ibunya mendapat seperenam,” baik saudara kandung, atau seayah atau seibu, laki-laki maupun perempuan, yang mendapat warisan atau terhalang mendapat warisan dengan adanya ayah atau kakek. Akan tetapi mungkin akan dikatakan oleh sebagian orang, bahwa firman Allah “jika yang meninggal itu mempunyai bebetapa saudara” tidak secara zahir mencakup orang-orang yang tidak mendapat warisan, dengan dalil bahwa dalam ayat itu tidak terkandung orang yang terhalang oleh orang yang mendapat setengah. Dengan demikian saudara tidak terhalang dari sepertiga kecuali saudara yang mendapat warisan saja. Ini didukung oleh kenyataan bahwa hikmah terhalangnya mereka dari sepertiga adalah agar saudara yang mewarisi itu mendapatkan sejumlah harta yang cukup dan hal itu tidak ada. akan tetapi dengan syarat jumlah mereka dua atau lebih. Hal itu menjadi lebih rumit, karena lafazh “saudara” dalam ayat tersebut dengan lafazh jamak. itu dapat dijawab dengan kenyataan bahwa maksud dari lafazh itu adalah hanya untuk menunjukkan jumlah bukan jamak, dan hal ini ditegaskan dengan lafazh “dua” dan terkadang lafazh jamak itu dimaksudkan dan diartikan dengan dua, sebagaimana dalam firman Allah tentang daud dan sulaiman. ”dan kami menyaksikan keputusan yang diberikan oleh mereka itu” Dan Allah berfirman tentang saudara seibu, ”jika seseorang mati, baik laki-laki maupun perempuan yang tidak meninggalkan ayah dan tidak meninggalkan anak tetapi mempunyai seorang anak laki-laki (seibu saja) atau seorang sauadra peremuan (seibu saja) maka masing-masing dari kedua jenis sauadara itu mendapatkan seperenam harta. Tetapi jika saudara-saudara seibu itu lebih dari seorang maka mereka bersekutu dalam yang sepertiga itu.” Allah menggunakan lafazh jamak, dan yang dimaksudkan adalah dua atau lebih menurut ijma’. Dengan dasar ini maka apabila seorang mayit meninggalkan ibu, ayah dan bebetapa saudra, maka hak ibu adalah seperenam, dan sisanya adalah haka ayah. Beberpa saudara itu menghalangi ibu mendapatkan sepertiga dan ayah menghalangi mereka mendapatkan bagian, kecuali adanya dengan kemungkinan lain, yaitu hak ibu adalah sepertiga dan sisanya adalah hak ayah. Kemudian Allah berfirman ”sesudah dipenuhi wasiat yang dibuat olehnya atau sesudah dibayar hutangnya, ”maksudnya hak-hak tertentu tersebut bagian-bagiannya dan warisan-warisan itu sesungguhnya dapat berlaku dan terjadi setelah dipotong oleh hutang yang ditanggung oleh mayit hak milik Allah atau milik manusia lain. Dan juga setelah pelaksanaan wasiat yang telah diwasiatkan oleh mayit setelah meninggalnya. Sisa dari itu semualah yang menjadi harta peninggalan yang berhak diwarisi oleh para ahli waris. Dan wasiat di dahulukan dalam ayat ini padahal pelaksanaannya di akhirkan setelah hutang agar diperhatikan dengan baik karena merealisasikan wasiat itu sangatlah berat bagi para ahli waris, dan bila tidak demikian maka hutang-hutang adalah didahulukan dari wasiat dan diambil dari harta yang ada. Sedangkan wasiat adalah sah dengan hanya sepertiga saja atau kurang dari itu, bagi orang di luar keluarga yang tidak menjadi ahli waris. Selain dari itu tidak boleh dilaksanakan kecuali dengan izin dari para ahli waris. Allah berfirman ”(tentang) orang tuamu dan anak-anakmu, kamu tidak mengetahui siapa diantara mereka yang lebih dekat (banyak) manfaatnya bagimu.” Sekiranya ketentuan pembagian warisan itu dikembalikan kepada akal pikiran dan pilihan kalian, niscaya akan terjadi kemudharatan di mana hanya Allah saja yang mengetahuinya, karena tidak sempurnanya akal pikiran dan tidak adanya pengetahuan nya tentang hal-hal yang patut dan baik dalam segala waktu dan tempat. merea tidak mengetahui anak yang mana atau orang tua yang mana yang lebih berguna bagi mereka dan lebih dekat kepada tercapainya tujuan-tujuan mereka, baik agama maupun dunia. “ini adalah ketetapan dari Allah Sesungguhnya Allah Maha Mengetahui Maha Bijaksana,” maksudnya, telah ditentukan oleh Allah yang meliputi segala sesuatu dengan ilmuNya, dan berlaku bijaksana dalam syari’atNya, dan menentukan apa yang telah ditetapkanNya dengan sebaik-baik ketentuan. Akal manusia tidaklah mampu untuk menghadirkan hukum-hukum sepertiNYa yang baik dan sesuai bagi setiap zaman dan tempat, serta kondisi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻳﻮﺻﻴﻜﻢ} yushikum: mewasiatkan kepada mereka {ﻓﻲ ﺃﻭﻻﺩﻛﻢ} fi auladikum: mengenai anak-anak kalian. Anak meliputi anak laki-laki dan perempuan. {ﺣﻆ} hazhun: bagian {ﻧﺴﺎء} nisa: anak-anak perempuan yang dewasa dan anak-anak {ﺛﻠﺜﺎ ﻣﺎ ﺗﺮﻙ} tsulutsan ma taroka: satu per tiga {اﻟﺴﺪﺱ} as sudus: satu per enam {ﺇﻥ ﻛﺎﻥ ﻟﻪ ﻭﻟﺪ} in kana lahu walad: jikalau mempunya anak, laki-laki-perempuan atau anak dari anak (cucu) laki-laki-perempuan hukumnya sama. {ﻓﺈﻥ ﻛﺎﻥ ﻟﻪ ﺇﺧﻮﺓ} fa in kana lahu ikhwah: jikalau punya saudara dua orang atau lebih. {ﻣﻦ ﺑﻌﺪ ﻭﺻﻴﺔ} minba’di washiah: dibayar hutangnya kemudian dilaksanakan wasiat lalu sisa harta dibagikan untuk para ahli waris. {ﻻ ﺗﺪﺭﻭﻥ} la tadruna: tidak mengetahui {ﻓﺮﻳﻀﺔ2} faridhoh: kewajiban yang Allah wajibkan kepada kalian. {ﻋﻠﻴﻤﺎ ﺣﻜﻴﻤﺎ} ‘aliman hakiman: Maha Mengetahui hamba-Nya dan apa yang baik guna untuk mereka. Maha Bijaksana perbuatan-Nya bagi persoalan hambanya serta ketentuan-ketentuan-Nya yang berlaku kepada mereka. Makna Ayat Ayat yang agung ini (ayat nomor 11) {ﻳﻮﺻﻴﻜﻢ1 اﻟﻠﻪ ﻓﻲ ﺃﻭﻻﺩﻛﻢ ﻟﻠﺬﻛﺮ ﻣﺜﻞ ﺣﻆ اﻷﻧﺜﻴﻴﻦ} sampai akhir dan ayat yang setelahnya (ayat nomor 12){ﻭﻟﻜﻢ ﻧﺼﻒ ﻣﺎ ﺗﺮﻙ ﺃﺯﻭاﺟﻜﻢ} sampai akhir ayat adalah diturunkan untuk menjelaskan detil hukum ayat nomor 7 dan apa yang tercakup dalam syariat waris-mewaris dalam kekerabatan kaum muslimin. Dan ayat pertama (nomor 11) Allah menetapkan di dalamnya waris mewaris antara para anak dan para ayah {ﻟﻠﺬﻛﺮ ﻣﺜﻞ ﺣﻆ اﻷﻧﺜﻴﻴﻦ} “untuk laki-laki sejumlah dua bagian wanita” maknanya adalah jika seorang wanita meninggal dan meninggalkan anak-anak, laki-laki ataupun perempuan maka pembagian warisannya dengan rumus bagian pria adalah dua kali lipat jatah wanita. Jikalau meninggalkan satu anak laki-laki dan dua anak perempuan serta tiga keping dinar, maka untuk anak laki-laki adalah dua dinar dan sang putri mendapatkan satu keping dinar. Jika meninggalkan dua orang putri atau lebih dan tidak meninggalkan putra maka untuk anak-anak putri dua per tiga bagian dan sisanya untuk 'ashobah, Allah berfiman {ﻓﺈﻥ ﻛﻦ ﻧﺴﺎء ﻓﻮﻕ اﺛﻨﺘﻴﻦ ﻓﻠﻬﻦ ﺛﻠﺜﺎ ﻣﺎ ﺗﺮﻙ} Dan jika meninggalkan seorang putri, maka baginya setengah dan sisanya untuk 'ashobah dan ini adalah makna dari ayat {ﻭﺇﻥ ﻛﺎﻧﺖ ﻭاﺣﺪﺓ ﻓﻠﻬﺎ اﻟﻨﺼﻒ} Apabila sang mayit meninggalkan dua orang tua (Ayah dan ibu) dan mempunyai anak-anak laki-laki dan perempuan ,maka bagian untuk masing-masing ayah dan ibu adalah seperenam dan untuk anak-anak si mayit adalah sisanya, baik anak laki-laki ataupun perempuan. Ini adalah makan dari firman Allah: {ﻭﻷﺑﻮﻳﻪ ﻟﻜﻞ ﻭاﺣﺪ ﻣﻨﻬﻤﺎ اﻟﺴﺪﺱ ﻣﻤﺎ ﺗﺮﻙ ﺇﻥ ﻛﺎﻥ ﻟﻪ ﻭﻟﺪ} Dan apabila sang mayit itu tidak punya anak ataupun juga tidak punya cucu, maka bagi ibu si mayit adalah sepertiga . Dan jika si mayit punya saudara berjumlah dua atau lebih, maka bagian si ibu dari mayit adalah seperenam. Ini adalah makna dari firman Allah ta’ala: {ﻓﺈﻥ ﻛﺎﻥ ﻟﻪ ﺇﺧﻮﺓ ﻓﻸﻣﻪ اﻟﺴﺪﺱ} yaitu berubah dari sepertiga menjadi seperenam. Dan ini dinamakan dengan hajb (penghalang) karena saudara mendiang menghalanginya ibu mendiang dari mendapatkan sepertiga menjadi seperenam. Dan firman Allah ta’ala ﻣﻦ ﺑﻌﺪ ﻭﺻﻴﺔ ﻳﻮﺻﻲ ﺑﻬﺎ ﺃﻭ ﺩﻳﻦ} “setelah wasiat dijalankan ataupun utang” Allah Ta’ala berkehendak bahwasanya pembagian warisan itu setelah dibayarkannya hutang sang mayit dan menunaikan pembagian wasiat jikalau wasiatnya itu berupa sepertiga harta si mayit atau kurang dari sepertiga. Dan ini adalah makna firman Allah Ta’ala {ﺁﺑﺎﺅﻛﻢ ﻭﺃﺑﻨﺎﺅﻛﻢ ﻻ ﺗﺪﺭﻭﻥ ﺃﻳﻬﻢ ﺃﻗﺮﺏ ﻟﻜﻢ ﻧﻔﻌﺎ} “Ayah-ayah kalian dan anak-anak kalian, kalian tidak tahu siapa dari mereka yang paling bermanfaat untuk kalian”, Maksudnya adalah: tunaikan wasiat yang wajib seperti Allah ajarkan kepada kalian dan janganlah kalian pilih kasih karena para ahli waris itu, dari ayah-ayah dan anak-anak kalian tidaklah kalian mengetahui secara pasti yang paling bermanfaat bagi kalian di dunia dan akhirat. Karenanya bagilah harta peninggalan sang mayit dengan apa yang Allah ajarkan dalam syariatnya tanpa pilih kasih karena Allah Maha Pemberi mengetahui terhadap hambanya dan apa yang bermanfaat bagi dirinya serta yang membahayakannya. Allah bijaksana dalam mengatur perkara para hambanya, maka serahkanlah perkaramu kepada-Nya rela dengan caranya membagi, sesungguhnya itu adalah pembagian dari Allah Yang Maha Bijaksana dan Maha Mengetahui. Pelajaran dari ayat : Termasuk petunjuk dari Ayat yang mulia ini adalah: • Sesungguhnya diri Allah sendiri bertanggung jawab menangani pembagian peninggalan mayit (tarikah), tidaklah siapapun diperkenankan untuk mengakalinya sedikitpun. • Bilangan atau jumlah dua dianggap termasuk kedalam bilangan jamak. • Anak dari anak (cucu) dihukumi seperti anak dalam persoalan hajb. • Ayah adalah ahli waris yang mendapatkan warisan dengan cara ‘ashobah. Namun dia juga terkadang mendapat atau mengambil harta warisan bersama ahli waris yang telah ditetapkan kadarnya, selain dengan cara ‘ashobah tersebut. Nabi bersabda: ’Berikanlah warisan kepada ahli waris sesuai kadarnya. Dan sisa warisanya, maka diberikan kepada yang paling berhak dari kalangan laki-laki."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 11: 10-11. Sesungguhnya orang-orang yang memakan harta anak-anak yatim dengan aniaya itu, tidak lain melainkan menelan api ke perut-perut mereka, dan mereka akan masuk di api yang bernyala-nyala, Allah wajibkan kamu tentang anak-anak kamu, buat seorang (anak) laki-laki (adalah) seperti bagian dua anak perempuan; tetapi jika mereka itu (anak- anak) perempuan lebih dari dua, maka (adalah) bagi mereka dua pertiga dari apa yang ditinggalkan (oleh si mati); dan jika hanya seorang (anak) perempuan, maka adalah baginya separoh; dan adalah bagi dua ibu-bapa itu tiap-tiap seorang dari mereka seperenam dari apa yang ditinggalkan oleh si mati, jika ada baginya anak. Tetapi jika tidak ada baginya anak, sedang yang jadi warisnya itu (hanya) dua ibu-bapanya, maka buat ibunya sepertiga; lantas jika ada baginya saudara-saudara, maka buat ibunya itu seperenam, sesudah wasiat yang ia wasiatkan, dan (sesudah) hutang. Bapa-bapa kamu dan anak-anak ka- mu, tidak kamu mengetahui siapa dari mereka yang lebih manfaat hagi kamu. (Yang demikian) sebagai satu ketetapan dari Allah, karena sesungguhnya Allah itu. Pengetahui, Bijaksana. Dan kamu dapat separoh darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Jabir radhiyallahu 'anhu ia berkata: Rasulullah shallallahu 'alaihi wa sallam dan Abu Bakar menjengukku di Bani Salamah dengan berjalan kaki. Ketika itu, Nabi shallallahu 'alaihi wa sallam mendapatkanku dalam keadaan tidak sadar. Maka Beliau meminta dibawakan air, lalu berwudhu' daripadanya dan memercikkan air ke mulutku, kemudian aku sadar. Lantas aku berkata, \"Apa perintahmu kepadaku tentang hartaku (ini), wahai Rasulullah.\" Maka turunlah ayat, \"Yuushiikumullahu fii awlaadikum…dst.\" Ayat di atas (yakni ayat 11 dan 12) serta ayat terakhir surat An Nisa' adalah ayat-ayat tentang warisan, ditambah dengan hadits Ibnu Abbas radhiyallahu 'anhuma, bahwa Rasulullah shallallahu 'alaihi wa sallam bersabda: أَلْحِقُوا الْفَرَائِضَ بِأَهْلِهَا ، فَمَا بَقِىَ فَهْوَ لأَوْلَى رَجُلٍ ذَكَرٍ \"Berikanlah bagian ashabul furudh, sisanya untuk laki-laki yang terdekat.\" (HR. Bukhari dan Muslim) sudah mencakup sebagian besar hukum-hukum faraa'idh, bahkan menerangkan semuanya sebagaimana yang akan kita lihat selain warisan nenek shahih; yang tidak disebutkan di sana. Namun telah tsabit (tetap) dalam As Sunnah, dari Mughirah bin Syu'bah bahwa Nabi shallallahu 'alaihi wa sallam memberikan 1/6 kepada nenek, dan para ulama pun telah sepakat seperti itu. Ada yang menafsirkan lebih luas lagi kata-kata \"Yuushiikumullahu fii awlaadikum\", yakni wahai para orang tua, di sisi kalian ada titipan yang Allah wasiatkan terhadapnya, yaitu agar kamu memperhatikan maslahat anak-anakmu baik terkait dengan agama maupun dunia, kamu membimbing mereka dan mengajarkan adab serta menghindarkan dari mafsadat, kamu menyuruh mereka menaati Allah dan agar senantiasa bertakwa sebagaimana firman-Nya \"Quu anfusakum wa ahliikum naaraa\" (Jagalah dirimu dan keluargamu dari api neraka). Oleh karena itu, orang tua mendapatkan wasiat terhadap anak-anaknya; yakni apakah orang tua akan memenuhi wasiat itu atau mengabaikannya sehingga mereka memperoleh ancaman dan siksa. Hal ini menunjukkan bahwa Allah Ta'ala lebih sayang kepada hamba-hamba-Nya daripada sayangnya orang tua mereka, di mana Allah Ta'ala mewasiatkan para orang tua untuk memperhatikan anaknya meskipun orang tua memiliki rasa sayang yang dalam kepada anaknya. Bagian laki-laki dua kali bagian perempuan adalah karena kewajiban laki-laki lebih berat dari perempuan, seperti kewajiban membayar maskawin dan memberi nafkah. (Lihat surat An Nisaa ayat 34). Anak laki-laki di ayat ini adalah anak kandung, anaknya anak (cucu) dst. ke bawah, jika tidak ada orang yang mendapat bagian tertentu (shahib fardh) atau bagian telah diberikan kemudian ada sisa, maka anak-anak menghabisinya dengan ketentuan seorang anak laki-laki mendapat dua bagian dua anak perempuan. Jika masih ada anak kandung, maka anaknya anak (cucu) tidak mendapatkan bagian. Keadaan di atas adalah ketika berkumpul anak laki-laki dengan anak perempuan. \"Lebih dari dua\" maksudnya dua atau lebih. Hal ini sebagaimana ditunjukkan dalam hadits shahih bahwa Nabi shallallahu 'alaihi wa sallam memberikan kepada dua puteri Sa'ad 2/3. Baik anak perempuan tersebut adalah anak kandung atau puteri dari anak laki-laki. Faedah disebutkan \"lebih dari dua\" adalah untuk memberitahukan bahwa bagian 2/3 itu tidaklah bertambah meskipun jumlah anak perempuan itu banyak. Ayat yang mulia ini juga menunjukkan bahwa jika ada anak perempuan kandung seorang saja dan ada seorang atau lebih puteri dari anak laki-laki, maka anak perempuan kandung mendapatkan 1/2, sisanya dari 2/3 yaitu 1/6 diberikan kepada seorang puteri dari anak laki-laki atau lebih, inilah yang dimaksud dengan menyempurnakan menjadi 2/3. Termasuk ke dalam contoh ini adalah puteri dari anak laki-laki bersama dengan puteri dari anak laki-laki yang di bawahnya. Kata-kata \"dari harta yang ditinggalkan\" menunjukkan bahwa ahli waris mewarisi semua yang ditinggalkan si mati, baik 'aqaar (benda tidak bergerak/tidak bisa dipindahkan), perabot, emas, perak dsb. bahkan termasuk pula diyat yang tidak wajib kecuali setelah meninggalnya dan piutang yang ada pada orang lain. Berdasarkan keterangan ini, maka bahwa harta warisan itu terbagi dua: - Harta warisan yang dapat dibagi. Misalnya uang, tanah yang harga dan isinya sama, dsb. - Harta yang tidak bisa dibagi sama rata. Misalnya bangunan, tanah yang berbeda isinya, barang perkakas, kendaraan, dan lainnya. Harta yang dapat dibagi, bisa langsung diberikan berdasarkan bagiannya masing-masing. Akan tetapi, harta yang tidak bisa dibagi, harus diuangkan terlebih dahulu. Kalau tidak, maka hanya akan diperoleh angka bagian di atas kertas dalam bentuk nisbah (persentase). Artinya masing-masing ahli waris yang sudah ditetapkan bagiannya, memiliki saham atas harta tersebut. Misalnya seorang wafat meninggalkan dua buah rumah yang sama besar, tetapi beda harganya. Ia memiliki dua orang anak laki-laki, maka harta ini tidak dapat dibagi Kecuali jika mereka mau berdamai, atau saling mengikhlaskan, itu pun setelah mengetahui bagian yang seharusnya mereka terima] tetapi hanya bisa diberikan nisbah (persentase) bagian sebagaimana yang sudah diatur dalam ilmu Faraa’id. Menurut sebagian ulama termasuk juga ke dalam tarikah adalah segala sesuatu yang ditinggalkan oleh si mayyit, berupa harta yang ia peroleh selama hidupnya, atau hak dia yang ada pada orang lain seperti barang yang dihutang, atau gajinya, atau yang akan diwasiatkan, atau amanatnya, atau barang yang digadaikan atau barang baru yang diperoleh karena terbunuhnya dia, atau kecelakaan yang berupa santunan ganti rugi. Adapun barang yang tidak berhak diwarisi di antaranya adalah: a. Peralatan tidur untuk istri dan peralatan yang khusus bagi dirinya, atau pemberian suami kepada istrinya semasa hidupnya. b. Harta yang diwaqafkan oleh si mati, seperti kitab dan lainnya. c. Barang yang diperoleh dengan cara haram, seperti barang curian, hendaknya diserahkan kepada pemiliknya atau diserahkan kepada pihak yang berwajib. Perlu diketahui bahwa tidak termasuk tarikah hibah dan wasiat. Adapun hibah adalah pemberian yang dilakukan ketika si mati masih hidup, sedangkan wasiat adalah pemberian yang dilakukan ketika si mati sudah meninggal. Faedah: - Jika istri ikut mengusahakan (bekerja membeli) sebuah rumah (misalnya separuh dia yang membayarkan), maka rumah tersebut yang berhak diwariskan hanya separuh. - Jika istri ikut bekerja dengan suami atau modal dari pihak isteri dan suami sama banyak, maka kedua-duanya memiliki hak mendapat separuh. Dalam usaha mendapatkan kekayaan itu, jika suami bekerja lebih, maka ia boleh mengambil hartanya secara ma'ruf (pantas), begitu juga isteri. Semua yang disebutkan ini, jika tidak ada perjanjian antara mereka berdua lebih dahulu. Apabila ada perjanjian, maka perjanjian itu harus diikuti, hal ini disebut juga syarikatul abdaan, yakni berserikat dengan badan untuk menghasilkan harta. Yakni seorang anak perempuan kandung atau puteri dari anak laki-laki. Baik anak laki-laki atau anak perempuan. Demikian juga baik anak itu adalah anak kandung atau anaknya anak (cucu), baik seorang saja atau lebih. Bagi ibu jatahnya tidak lebih dari 1/6 ketika ada anak, adapun bapak jika bersama anak laki-laki, maka jatahnya tidak lebih dari 1/6 (tanpa ditambah sisa), namun jika anaknya seorang wanita atau beberapa orang wanita dan tidak ada sisa –seperti halnya jika ahli waris hanya ibu-bapak dan dua orang puteri yang totalnya 6/6 (dari 1/6 (bapak) + 1/6 (ibu) + 2/3 (2 puteri) sehingga tidak bersisa)- maka bapak tidak mendapatkan sisa. Tetapi jika masih ada sisa setelah diberikan bagian seorang puteri atau beberapa orang puteri, maka bapak disamping mengambil jatahnya 1/6, ia pun mengambil sisanya sebagai 'ashabah. Inilah yang dimaksud hadits, \"Berikanlah bagian ashabul furudh, sisanya untuk laki-laki yang terdekat.\" (HR. Bukhari dan Muslim) dan dalam hal ini bapak lebih dekat dengan si mati daripada saudara, paman dan lainnya. Oleh karenanya, urutan terdekat adalah bunuwwah (anak dst. ke bawah), ubuwwah (bapak dst. ke atas), ukhuwwah (saudara dan anak-anaknya) dan umuumah (paman dan anak-anaknya). Sedangkan sisanya untuk bapak, hal ini karena sebelumnya harta disandarkan kepada ibu dan bapak, lalu disebutkan bagian ibu yaitu 1/3, berarti sisanya untuk bapak. Dari sini diketahui, bahwa seorang bapak jika tidak ada anak, maka ia tidak ada fardh (bagian tertentu), bahkan mewarisi semua harta atau mewarisi sisanya setelah diberikan jatah (fardh) yang memiliki jatah. Tetapi, jika bersama ibu dan bapak ada salah satu suami atau istri –hal ini biasa disebut masalah 'Umariyyatain-, maka suami atau istri setelah mengambil bagiannya, lalu ibu mengambil 1/3 dari sisa dan sisanya untuk bapak. Contoh masalah umariyyatain adalah: - (Si mati meninggalkan) suami, ibu dan ayah, masalahnya adalah 6 (KPK antara 2 (dari ½) dan 3 (dari 1/3)), sehingga untuk suami ½ dari 6 yaitu 3, untuk ibu 1/3 dari sisa yaitu 1, dan untuk ayah sisanya yaitu 2. - Istri, ibu dan ayah, masalahnya adalah 4, untuk istri 1/4 yaitu 1, untuk ibu 1/3 dari sisanya yaitu 1, dan untuk ayah sisanya yaitu 2. Dua orang atau lebih, baik mereka laki-laki saja, atau laki-laki bersama wanita atau wanita saja, juga sama saja baik sekandung, seayah atau seibu; laki-laki atau perempuan, menjadi ahli waris (misalnya ketika bapak tidak ada) atau terhalang dengan bapak (karena ada bapak) atau kakek. Namun ada yang berpendapat bahwa zhahir ayat \" Jika yang meninggal itu mempunyai beberapa saudara \" tidak mencakup kepada yang bukan ahli waris. Oleh karena itu, yang bisa menghalangi ibu mendapatkan 1/3 hanyalah saudara yang menjadi ahli waris (seperti ketika bapak tidak ada). Jika saudara-saudara bukan ahli waris (misalnya karena ada bapak), maka mereka tidak menghalangi ibu mendapat 1/3. Namun demikian, hal ini dengan syarat jumlah saudara itu dua atau lebih. Berdasarkan keterangan di atas, maka bagian ibu ketika ada saudara: Pertama, mendapat 1/6 jika ada beberapa orang saudara yang menjadi ahli waris (seperti ketika tidak ada bapak). Kedua, mendapat 1/3 jika ada beberapa orang saudara yang bukan menjadi ahli waris (seperti ketika ada bapak). Namun ada pula yang berpendapat bahwa jika ada beberapa saudara, baik ia menjadi ahli waris atau tidak, maka ibu tetap mendapat 1/6, wallahu a'lam. Sisanya untuk bapak, dan saudara tidak mendapat apa-apa karena mahjub (terhalang). Urutannya adalah dibayarkan hutang terlebih dahulu, baru kemudian dipenuhi wasiatnya. Didahulukan kata wasiat pada ayat di atas adalah agar kita memperhatikannya, karena biasanya ahli waris berat mengeluarkannya. Hutang di ayat ini pun mencakup hutang kepada Allah maupun hutang kepada manusia. Dengan demikian, urutan yang harus dikeluarkan dari tarikah adalah sbb: - Hutang yang berkaitan dengan 'ain (benda) tarikah, misalnya ada benda milik orang lain pada harta si mati. - Biaya pengurusan jenazah - Hutang lepas, yakni yang tidak berkaitan dengan 'ain tarikah. Dalam hal ini menurut sebagian ulama didahulukan hutang kepada Allah, baru kemudian hutang kepada manusia. - Wasiat. Setelah itu dilakukan pembagian warisan. Jika sekiranya ukuran warisan diserahkan kepada akal dan pikiran kamu tentu akan timbul madharat (bahaya) yang hanya Allah yang mengetahuinya, karena keterbatasan akalmu dan tidak mengetahui hal yang lebih tepat, cocok dan dapat digunakan di setiap waktu dan setiap tempat. Kamu tidak mengetahui apakan anak atau kedua orang tua yang lebih besar manfaatnya dan lebih dekat kepada tujuan agama dan dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 11",
    "description": "Setelah ayat sebelumnya menjelaskan dampak orang yang mengabaikan hak orang lain, ayat ini menjelaskan ketentuan pembagian harta warisan yang dijelaskan Allah secara rinci agar tidak diabaikan. Allah mensyariatkan, yakni mewajibkan, kepada kamu tentang pembagian harta warisan untuk anak-anak kamu baik laki-laki atau perempuan, dewasa atau kecil, yaitu bagian seorang anak laki-laki apabila bersamanya ada anak perempuan dan tidak ada halangan yang ditetapkan agama untuk memperoleh warisan, disebabkan karena membunuh pewaris atau berbeda agama, maka ia berhak memperoleh harta warisan yang jumlahnya sama dengan bagian dua orang anak perempuan, karena lakilaki mempunyai tanggung jawab memberi nafkah bagi keluarga. Dan jika anak itu semuanya perempuan yang jumlahnya lebih dari dua dan tidak ada bersama keduanya seorang anak lelaki, maka bagian mereka adalah dua pertiga dari harta warisan yang ditinggalkan ibu atau ayahnya. Jika dia, anak perempuan, itu seorang diri saja dan tidak ada bersamanya anak laki-laki, maka dia memperoleh harta warisan setengah dari harta yang ditinggalkan orang tuanya. Demikianlah harta warisan yang diterima anak apabila orang tua mereka meninggal dunia dan meninggalkan harta. Dan apabila yang meninggal dunia adalah anak laki-laki atau perempuan, maka untuk kedua ibu-bapak mendapat bagian masing-masing seperenam dari harta yang ditinggalkan oleh sang anak. Jumlah itu menjadi hak bapak dan ibu, jika dia yang meninggal itu mempunyai anak laki-laki atau perempuan. Akan tetapi, jika dia yang meninggal itu tidak mempunyai anak laki-laki atau perempuan dan harta dia diwarisi oleh kedua ibu-bapaknya saja, maka ibunya mendapat bagian warisan sepertiga dan selebihnya untuk ayahnya. Jika dia yang meninggal itu mempunyai beberapa saudara dua atau lebih, baik saudara seibu dan sebapak, maupun saudara seibu atau sebapak saja, lelaki atau perempuan, dan yang meninggal tidak mempunyai anak, maka ibunya mendapat bagian warisan seperenam dari harta waris yang ditinggalkan, sedang ayahnya mendapat sisanya. Pembagian-pembagian tersebut di atas dibagikan kepada ahli warisnya yang berhak mendapatkan setelah dipenuhi wasiat yang dibuatnya sebelum meninggal dunia atau setelah dibayar utangnya. Allah sengaja menentukan tentang pembagian harta warisan untuk orang tua dan anak-anak kamu sedemikian rupa karena kamu tidak mengetahui hikmah di balik ketentuan itu siapa di antara mereka yang lebih banyak manfaatnya bagi kamu dari kedua orang tua dan anak-anak kalian. Ini adalah ketetapan yang turun langsung dari Allah untuk ditaati dan diperhatikan. Sungguh, Allah maha mengetahui segala sesuatu, mahabijaksana dalam segala ketetapan-ketetapan-Nya. Demikianlah ketentuan pembagian harta warisan yang ditetapkan langsung oleh Allah agar tidak terjadi perselisihan di antara ahli waris. Jika manusia yang membuat ketentuan, niscaya terjadi kecurangan dan kezaliman. Allah mahatahu hikmah di balik ketetapan dan ketentuan itusetelah dijelaskan tentang perincian bagian warisan sebab nasab, berikut ini dijelaskan tentang pembagian warisan karena perkawinan. Dan adapun bagian kamu, wahai para suami, apabila ditinggal mati istri adalah seperdua dari harta yang ditinggalkan oleh istri-istrimu, jika mereka tidak mempunyai anak darimu atau anak dari suami lain. Jika mereka yaitu istri-istrimu itu mempunyai anak laki-laki atau perempuan, maka kamu hanya berhak mendapat bagian seperempat dari harta yang ditinggalkannya setelah dipenuhi wasiat yang mereka buat sebelum mereka meninggal atau setelah dibayar utangnya apabila mereka mempunyai utang. Jika suami meninggal, maka para istri memperoleh bagian seperempat dari harta warisan yang kamu tinggalkan jika kamu tidak mempunyai anak dari mereka atau anak dari istri lain. Jika kamu mempunyai anak laki-laki atau perempuan, maka para istri memperoleh bagian seperdelapan dari harta warisan yang kamu tinggalkan setelah dipenuhi wasiat yang kamu buat sebelum kamu meninggal atau setelah dibayar utang-utangmu apabila ada utang yang belum dibayar. Jika seseorang meninggal, baik laki-laki maupun perempuan, dalam keadaan kalalah, yakni orang yang meninggal dalam keadaan tidak meninggalkan ayah dan tidak meninggalkan anak sebagai pewaris langsung, tetapi orang yang meninggal tersebut mempunyai seorang saudara laki-laki seibu atau seorang saudara perempuan seibu, maka bagi masing-masing dari kedua jenis saudara itu mendapat bagian seperenam dari harta yang ditinggalkan secara bersama-sama. Tetapi jika saudara-saudara seibu itu lebih dari seorang, maka mereka mendapat bagian secara bersama-sama dalam bagian yang sepertiga itu tanpa ada perbedaan antara laki-laki dan perempuan. Pembagian waris ini baru boleh dilakukan setelah dipenuhi wasiat yang dibuatnya sebelum meninggal atau setelah dibayar utangnya apabila mempunyai utang yang belum dilunasi. Wasiat yang dibolehkan adalah untuk kemaslahatan, bukan untuk mengurangi apalagi menghalangi seseorang memperoleh bagiannya dari harta warisan tersebut dengan tidak menyusahkan ahli waris lainnya. Demikianlah ketentuan Allah yang ditetapkan sebagai wasiat yang harus dilaksanakan dengan sepenuh hati. Allah maha mengetahui apa yang kamu kerjakan, maha penyantun dengan tidak segera memberi hukuman bagi orang yang melanggar perintah-Nya."
  }
]