[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa mengerjakan suatu perbuatan buruk lagi jelek,atau berbuat zalim terhadap dirinya sendiri dengan melakukan pelanggaran terhadap hukum Allah dan syariatNya, kemudian dia kembali kepada Allah dengan penyesalan atas apa yang telah dia perbuat,demi mengharapkan ampunanaNYa dan agar Dia berkenan menutup dosanya, niscaya akan mendapati Allah maha pengampun kepadanya dan maha penyayang terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Barangsiapa yang berbuat buruk atau menganiaya dirinya sendiri dengan berbuat dosa, kemudian ia meminta ampun kepada Allah seraya mengakui dosanya, menyesalinya, dan meninggalkannya secara total, ia akan senantiasa mendapati bahwa Allah adalah Rabb Yang Maha Pengampun atas dosa-dosanya lagi Maha Penyayang kepadanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Allah memberi dorongan untuk bertaubat dari segala dosa: Barangsiapa yang berbuat keburukan terhadap orang lain atau diri sendiri dengan melakukan kemaksiatan yang hanya berhubungan dengan dirinya seperti memberi sumpah bohong, kemudian dia memohon ampun kepada Allah niscaya dia akan mendapati Allah Maha mengampuni dosa-dosanya dan Maha mengasihinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. وَمَن يَعْمَلْ سُوٓءًا (Dan barangsiapa yang mengerjakan kejahatan) Makna (السوء) yakni perbuatan buruk yang dilakukan kepada orang lain. أَوْ يَظْلِمْ نَفْسَهُۥ(dan menganiaya dirinya) Yakni dengan melakukan kemaksiatan yang tidak berakibat pada orang lain. ثُمَّ يَسْتَغْفِرِ اللهَ(kemudian ia mohon ampun kepada Allah) Yakni memohon agar menutupi dosa yang telah ia lakukan dan menghapus akibat dari dosa itu dengan mengucapkan “Astaghfirullah” atau “Allahummaghfirlii”. يَجِدِ اللهَ غَفُورًا(niscaya ia mendapati Allah Maha Pengampun) Yakni mengampuni dosanya. رَّحِيمًا (lagi Maha Penyayang) Dan menyayanginya. Ibnu Abbas berkata: dalam ayat ini Allah mengabarkan hamba-hamba-Nya dengan kelembutan, pemaafan, kemurahan, keluasan kasih sayang, dan ampunan-Nya meskipun dosa-dosa hamba-Nya lebih besar daripada langit, bumi, dan gunung-gunung niscaya Allah akan mengampuninya selama ia bertaubat dan memohon ampun. Ayat ini juga mengandung dorongan bagi orang yang melakukan pencurian dari Bani Ubairiq agar bertaubat dan memohon ampun kepada Allah, dan Dia Maha Pengampun dan Penyayang bagi orang yang momohon ampun kepada-Nya, dan ini juga berlaku bagi seluruh hamba-Nya yang berbuat dosa kemudian memohon ampun kepada-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَمَنْ يَعْمَلْ سُوءًا أَوْ يَظْلِمْ نَفْسَهُ } \"Dan barangsiapa yang mengerjakan kejahatan dan menganiaya dirinya\" Penganiayaan terhadap diri sendiri disebut kezhaliman, karena sesungguhnya diri seorang hamba bukanlah haq miliknya yang sebenarnya, melainkan itu adalah milik Allah yang menjadi amanah setiap hamba."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110 Barangsiapa yang mengerjakan kejahatan dan menganiaya orang lain atau diri mereka sendiri dengan berbuat maksiat seperti meminum khamr, kemudian ia mohon ampun kepada Allah agar diampuni dan dihapuskan dosanya dengan memohon ampunan, maka dia akan mendapati Allah sebagai Dzat Yang Maha Pengampun atas semua dosanya lagi Maha Penyayang kepadanya dengan menerima taubatnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang berbuat kejahatan} keburukan yang kemudharatannya melanggar batas orang lain {atau menganiaya dirinya} berbuat dosa tapi tidak melanggar batas orang lain {kemudian memohon ampunan kepada Allah, niscaya akan mendapati Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. Kemudian Allah berfirman, “Dan barangsiapa yang mengerjakan kejahatan dan menganiaya dirinya, kemudian ia memohon ampun kepada Allah, niscaya ia mendapati Allah Maha Pengampun lagi Maha Penyayang,” yaitu kemudian ia memohon ampun kepada Allah dengan permohonan yang total yang mengharuskan adanya pengakuan akan dosa yang telah dilakukan, dan berlepas diri dari kesalahan tersebut, serta bertekad kuat unutk tidak mengulanginya, orang yang seperti ini telah di janjikan ampunan dan rahmat oleh Dzat yang tidak menyalah janji, lalu dia mengampuni apa yang telah ia perbuat berupa dosa dan maksiat, menghilangkan darinya perkara yang dihasilkan olehnyaberupa aib dan cela, mengambalikan kepadanya apa-apa yang telah lalu berupa amalan-amalan yang shalih, membingbingnya dalam sisa umurnya di masa depan, tidak menjadikan dosanya itu sebagai penghalang dari taufikNya, karena sesungguhnya ia telah mengampuninya, dan bila dia telah mengampuninya, maka pastilah dia mengampini apa yang menjadi konsekuensi darinya. Ketahuilah bahwa perbuatan buruk itu secara umum mencakup kemaksiatan yang kecil maupun yang besar, dan hal itu di sebut buruk karenaia akan merugikan pelakunya dengan dengan hukum umtuknya, dank arena pada dzatnya adalah buruk dan tidak baik, demikian secara umum menganiaya diri sendiri mencakup penganiayaan dirirnya dengan kesyirikan atau selainnya, namun bila kedua hal tersebut saling berdampingan satu sama lain, terkadang setiap hal itu di tafsirkan dengan perkarayang sesuai dengannya, maka perbuatan buruk di artikan dengan kezhaliman yang merugikan manusia, yaitu kezhaliman mereka terhadap darah, harta, dan kehormatan mereka, sedangkan penganiayaan diri sendri adalah dengan kezhaliman kemaksiatan yang merupakan perbuatan yang harus di pertanggungjawabkan antara Allah dan hambaNya, dan penganiayaan diri sendiri itu dinamakan sebagai kezhaliman karena jiwa seseorang itu bukan milik dirinya yang biasa ia atur semuanya, akan tetapi jiwa itu adalah milik Allah yang telah dia jamjikan sebagai amanah pada manusia dan dia perintahkan kepada manusia agar membawanya dengan adil dengan mengharuskannya berjalandi atas jalan yang lurus dengan ilmu dan amal perbuatan, beusaha menunaikan hal-hal yang telah di wajibkan atasnya, maka usahanya dalam hal yang laindari perkara di atas adalah suatu penganiayaan atas diri sendiri, sebuah penghianatan dan penyelewangan dari keadilan yang seharusnya kebalikan dari kesewanang-wenangan dan kezhaliman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 110: Dan barangsiapa mengerjakan kejahatan atau ia menganiaya dirinya kemudian ia meminta ampun kepada Allah, niscaya ia dapati Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada orang lain, baik terkait dengan darah, harta atau kehormatan mereka. Dengan berbuat maksiat antara dirinya dengan Allah. Yakni beristighfar secara sempurna dengan mengakui dosa dan menyesalinya, berhenti dari melakukannya dan berniat keras untuk tidak mengulanginya, maka Allah berjanji –sebagaimana dalam ayat di atas- akan mengampuni dan merahmati. Dia akan mengampuni dosa yang dilakukannya, menghilangkan cacat dan kekurangan yang diakibatkan dari maksiat itu, mengembalikan amal shalihnya dan memberinya taufiq di masa mendatang, dan dosanya tidak dijadikan-Nya sebagai penghalang taufiq-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 110",
    "description": "Dan barang siapa berbuat kejahatan, atau berbuat dosa terhadap orang lain yang menimbulkan dampak buruk terhadap diri mereka, atau menganiaya dirinya, yaitu melakukan perbuatan dosa yang berdampak buruk hanya terhadap dirinya sendiri, kemudian dia memohon ampunan kepada Allah atas perbuatan dosa yang dilakukannya itu disertai penyesalan atas perbuatannya dan bertekad untuk tidak melakukannya lagi, niscaya dia akan mendapatkan Allah maha pengampun atas dosadosanya dan segala dosa yang dilakukan oleh siapa pun yang bertobat kepada-Nya, maha penyayang dengan mencurahkan rahmat dan karunia-Nya kepada mereka yang bertobatdan barang siapa yang berbuat dosa, apa pun bentuk dan macam dosa yang dilakukannya, maka sesungguhnya dia mengerjakannya untuk keburukan dirinya sendiri, karena akibat dari perbuatan dosanya itu akan kembali kepada dirinya, dan Allah menjatuhkan sanksi dari perbuatannya itu kepada dirinya, bukan kepada orang lain. Dan ketahuilah bahwa semua sikap, perilaku, dan perbuatan yang kamu dan siapa pun lakukan, termasuk segala macam dosa-dosa, pasti diketahui oleh Allah karena Allah selamanya maha mengetahui semua itu, mahabijaksana memberikan ganjaran, sanksi dan hukuman kepada siapa pun secara wajar dan benar."
  }
]