[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa sengaja melakuakan perbuatan dosa, amak sesungguhnya dengan tindakkannya itu,dia hanya memudaratkan dirinya saja. Dan Allah Maha mengetahui hakikat urusan hamba-hamabaNya lagi Maha Bijaksana dalam memberi keputusan diantara makhluk-makhlukNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "111. Barangsiapa berbuat dosa kecil atau besar maka hukumannya akan ditanggung oleh dirinya sendiri, tidak akan menjalar kepada orang lain. Dan Allah Maha Mengetahui perbuatan hamba-hamba-Nya lagi Maha Bijaksana dalam mengatur urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "111. Kemudian Allah memperingatkan dari perbuatan dosa dan menyebutkan besarnya akibat buruk dari dosa tersebut: Barangsiapa yang berbuat dosa dan meyakini bahwa dia telah berbuat sesuatu yang bermanfaat baginya maka sesungguhnya perbuatan itu akan merugikan dirinya sendiri dan dia tidak akan mendapatkan manfaat darinya sedikitpun. Hal ini sebagaimana yang dipikirkan oleh orang yang tidak mengetahui akibat dosa-dosanya, baik itu di dunia maupun di akhirat seperti terbongkarnya aib, kehinaan di depan manusia dan di depan hakim yang adil, dan kehinaan di akhirat di hari yang tidak berguna lagi harta benda dan anak keturunan kecuali orang yang datang pada hari itu dengan hati yang bersih. Dengan ilmu-Nya yang Maha Luas, Allah menetapkan bagi manusia syariat-syariat yang jika dilanggar akan membahayakan diri mereka sendiri, dan dengan hikmah-Nya, Allah menetapkan siksaan bagi mereka sehingga mereka hanya merugikan diri sendiri dan sama sekali tidak merugikan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "111. وَمَن يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُۥ عَلَىٰ نَفْسِهِۦ ۚ (Barangsiapa yang mengerjakan dosa, maka sesungguhnya ia mengerjakannya untuk (kemudharatan) dirinya sendiri) Yakni akibat perbuatannya akan kembali kepadanya. Dan arti dari ayat ini adalah tidak seharusnya kerabat dari pencuri tersebut merasa malu sehingga membawa mereka dalam pembelaan yang bathil terhadapnya karena sesungguhnya dosa pencurian itu tidaklah mereka tanggung sedikitpun. وَكَانَ اللهُ عَلِيمًا حَكِيمًا (Dan Allah Maha Mengetahui lagi Maha Bijaksana) Sehingga Dia memutuskan perkara dengan kaidah yang agung ini (وَمَن يَكْسِبْ إِثْمًا فَإِنَّمَا يَكْسِبُهُۥ عَلَىٰ نَفْسِهِۦ) dan Dia mengabarkan itu kepada kalian agar kalian memutuskan perkara dengannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "111 Barangsiapa yang mengerjakan dosa dengan sengaja, maka sesungguhnya ia mengerjakannya untuk kemudharatan dirinya sendiri. Dan Allah Maha Mengetahui atas makhluk-Nya lagi Maha Bijaksana dalam segala ketetapan-Nya dan tidak akan menghukum kecuali terhadap mereka yang bermaksiat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berbuat dosa, maka sesungguhnya dia mengerjakannya untuk merugikan dirinya sendiri} membahayakan diri sendiri {Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111. Kemudian Allah berfirman,”barang siapa yang mengerjakan dosa, maka sesungguhnya ia mengerjakan untuk kemudaratan dirirnya sendiri,” hal ini mencakup seluruh perkara dosa, baik kecil maupun besar maka barang siapa yang mengerjakan suatu kemaksiatan , sengguhnya hukumannya adalah atas dirinya sendiri dan tidak berpindah kapada orang lain, baik dunia maupun akhirat, sebagaimana Allah berfirman, \"dan seorang yang berdosa tidak akan memikul dosa orang lain.\" (Al-An’am:164). Akan tetapi bila kemaksiatan itu terlihat lalu tidak diangkari, maka hukuman dan dosanya menimpa seluruhnyadan tidak akan keluar dari ketetapan ayat yang mulia ini, karena barang siapa yang meninggalkan pengingkaran yang wajib, maka sesungguhnya ia telah meninggalkan sesuatu yang wajib, maka sesungguhnya ia telah melakukan suatu keburukan, hal ini menunjukan aka keadilan Allah dan hikmahNya, dan tidak menyiksa sesorang lebih dari kemaksiatan yang di perbuatnya, karena itu Allah berfirman, “Dan Allah Maha Mengatahui Dan Maha Bijaksana,” yaitu dia memiliki ilmu dan hikmah yang sempurna, dan di antara ilmu dan hikmahNya, adalah dia mengetahui dosa dan akibatnya, sebab-sebab yang mendorong malakukkannya, dan hukum yang disiapkan karenanya, dan dia mengetahui kondisi pelaku dosa bahwa sebuah dosa yang dilakukannya adalah karena di dorong oleh jiwanya yang selalu mengajak kepada keburukan, padahal ia selalu kembali kepada Rabbnya pada kebanyakan waktunya, sesungguhnya Allah akan mengampuninya dan membimbingnya kepada taubat, namun bila telah terjadi pada dosa itu dengan kelancangan diri atas hal-halyang di haramkan dengan mengabaikan pengawasan Rabbnya dan meremahkan hukumNya maka sesungguhnya orang yang seperti ini adalah jauh dari ampunan dan jauh dari bimbingan kepada taubat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 111: Dan barang siapa kerjakan satu dosa, maka tidak lain melain- kan ia usahakan dia buat kecela- kaan dirinya, kárena adalah Allah itu Pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mencakup dosa kecil maupun dosa besar. Hukumannya baik hukuman dunia maupun akhirat ditanggung oleh dirinya, tidak ditanggung oleh yang lain sebagaimana firman Allah Ta'ala, \"Bahwasanya seorang yang berdosa tidak akan memikul dosa orang lain,\" (Terj. An Najm: 38). Akan tetapi, jika kemaksiatan nampak dan tidak diingkari, maka hukuman dan dosanya bisa menimpa secara merata, dan yang demikian masih termasuk ke dalam surat An Najm ayat 38 tersebut, karena orang yang tidak mengingkari hal yang wajib diingkari padahal dirinya mampu, maka sama saja ia telah mengerjakan kesalahan. Dalam ayat di atas terdapat bukti keadilan Allah dan kebijaksanaan-Nya, di mana Dia tidak menghukum orang lain karena kesalahan yang dilakukan oleh seseorang dan tidak menghukum lebih dari dosa yang dilakukan. Yakni Maha sempurna ilmu dan kebijaksanaan-Nya. Di antara ilmu-Nya dan kebijaksanaan-Nya adalah Dia mengetahui dosa dan apa saja yang timbul daripadanya, sebab yang mendorong untuk melakukannya, hukuman dari perbuatan yang dilakukan. Dia juga mengetahui keadaan orang yang berdosa, jika seseorang melakukannya karena hawa nafsu dalam hatinya yang memerintahkan kepada keburukan, namun ia senantiasa kembali kepada Tuhannya di setiap waktunya, maka Dia akan mengampuni dan memberinya taufiq untuk bertobat. Sebaliknya, jika kemaksiatan dilakukan karena meremehkan perhatian Allah kepadanya dan meremehkan siksa-Nya, maka orang seperti ini nampaknya jauh dari ampunan dan taufiq-Nya untuk bertobat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 111",
    "description": "Dan barang siapa yang berbuat dosa, apa pun bentuk dan macam dosa yang dilakukannya, maka sesungguhnya dia mengerjakannya untuk keburukan dirinya sendiri, karena akibat dari perbuatan dosanya itu akan kembali kepada dirinya, dan Allah menjatuhkan sanksi dari perbuatannya itu kepada dirinya, bukan kepada orang lain. Dan ketahuilah bahwa semua sikap, perilaku, dan perbuatan yang kamu dan siapa pun lakukan, termasuk segala macam dosa-dosa, pasti diketahui oleh Allah karena Allah selamanya maha mengetahui semua itu, mahabijaksana memberikan ganjaran, sanksi dan hukuman kepada siapa pun secara wajar dan benardan barang siapa berbuat kesalahan, yaitu perbuatan atau pelanggaran yang dilakukan tanpa sengaja, atau perbuatan dosa yang dilakukan dengan sengaja, kemudian dia tuduhkan atau lemparkan kesalahan dan perbuatan dosa itu kepada orang lain yang tidak bersalah, maka sungguh, dia telah memikul suatu kebohongan yang besar dan dosa yang nyata karena dia yang melakukan kesalahan dan perbuatan dosa itu."
  }
]