[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barngsiapa berbuat kesalahan tanpa sengaja atau melakukan perbuatan dosa dengan sengaja,kemudian dia melemparkan tuduhan atas apa yang dia perbuat kepada orang yang tidak bersalah yang tidak melakukan tindakan kejahatan apapun, maka sesungguhnya dia telah memikul kedustaan dan dosa yang nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "112. Barangsiapa melakukan kesalahan secara tidak sengaja atau berbuat dosa secara sengaja, kemudian ia menuduh orang lain yang tidak bersalah sebagai pelakunya, maka dengan tindakan itu ia telah memikul kebohongan yang berat dan dosa yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "112. Dan barangsiapa yang berbuat suatu kesalahan tanpa disengaja atau melakukan kesalahan dengan penuh kesadaran bahwa itu adalah suatu dosa, kemudian dia berlepas diri dan menuduh orang lain yang tidak bersalah dan mengatakan bahwa orang itulah yang melakukannya maka sungguh dia telah menimpakan kepada dirinya sendiri dosa yang sangat besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "112. وَمَن يَكْسِبْ خَطِيٓـَٔةً أَوْ إِثْمًا (Dan barangsiapa yang mengerjakan kesalahan atau dosa) Kata (الخطيئة) (kesalahan) yakni perbuatan yang dilakukan baik dengan disengaja maupun tidak disengaja. Adapun kata (الإثم) (dosa) yakni perbuatan yang hanya dilakukan dengan kesengajaan. Pendapat lain mengatakan (الخطيئة) yakni dosa kecil. Adapun (الإثم) yakni dosa besar. ثُمَّ يَرْمِ بِهِۦ بَرِيٓـًٔا فَقَدِ احْتَمَلَ بُهْتٰنًا (kemudian dituduhkannya kepada orang yang tidak bersalah, maka sesungguhnya ia telah berbuat suatu kebohongan) Makna (البهتان) yakni kebohongan yang dituduhkan pada orang yang tak bersalah sehingga ia tidak bisa mengelak dan kebingungan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan ayat ini, pembedaan kata { خَطِيئَةً } \"kesalahan \"dan { إِثْمًا } \"dosa\" karena kesalahan boleh terjadi karena adanya kesengajaan dan di luar dari kesengajaan seseorang, sedangkan \"dosa\" adalah timbul dengan kesengajaan; oleh karena itu Allah membedaakan dua kata ini, maka jika seorang hamba melakukan suatu kesalahan tanpa disengaja maka tidaklah baginya dosa, tetapi jika ia melakukan kesalahan (dosa) dengan sengaja maka dicatat baginya dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "112 Barangsiapa yang mengerjakan maksiat, kesalahan atau dosa, baik atas dasar sengaja maupun tidak. Namun tidak ada dosa yang tidak dilakukan dengan sengaja kemudian dituduhkannya kepada orang yang tidak bersalah, maka sesungguhnya ia telah berbuat suatu kebohongan dan dosa yang nyata. Buhtan adalah tuduhan kepada orang baik-baik dengan sesuatu yang tidak dia lakukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang berbuat kesalahan} dosa yang tidak disengaja {atau dosa} dosa yang disengaja {kemudian menuduhkannya} melemparkannya {kepada orang yang tidak bersalah, sungguh telah memikul} membawa {suatu kebohongan} kebohongan besar {dan dosa yang nyata} nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "112. Kemudian Allah befirman, “dan barang siapa yang mengerjakan kesalahan” yaitu dosa yangbesar, atau dosa selain dosa besar, “kemudian di tuduhkannya” yakni, menuduh dosa yang ia lakukan itu, “kepada orang-orang yang tidak bersalah” dari dosa tersebut walaupun dia melakukan dosa yang lain, ”maka sesungguhnya ia telah berbuat sesuatu kebohongan dan dosa yang nyata,” yaitu sesungguhnya ia telah memikul di atas punggungnya kebohongan terhadap orang yang tidak bersalah dan dosa yang jelas lagi nyata. Hal ini menunjukan bahwa hal tersebut merupakan dosa besar dan maksiat, yaitu melakukan kesalahan dan dosa, lalu menuduh seseorang sebagai pelakunya padahal ia tidak melakukannya, kemudian melakukan kebohongan yang keji dengan berlepas diri daro dosa itu dan di tuduhkan kapada orang yang tidak bersalah, kemudian hukuman diniawi yang di akibatkannya dari perbuatannya itu terhindar dari pelaku sebenarnya yang berhak di hukum tersebut, lalu di jatuhkan kepada orang tidak berhak di hukum. Kemudian apa yang dia akibatkanya juga darinya berupa pembicaraan orang terhadap tetuduh tersebut dan juga kerusakan-kerusakan lainnya yang kita harapkan agar Allah berikan keselamatan darinya dan dari segala keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 112: Dan barangsiapa kerjakan satu kesalahan atau satu dosa, kemudian ia tuduh kan dia atas seorang yang tidak bersalah, maka sesung- guhnya dan satu dosa yang nyata (pula). ia memikul satu dusta."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dosa kecil. Dosa besar. Ayat ini menunjukkan bahwa yang demikian termasuk dosa besar dan hal yang membinasakan seseorang, karena dia sama saja telah melakukan banyak kerusakan, di antaranya yaitu: telah mengerjakan dosa atau kesalahan, menuduhkan kesalahan kepada orang yang tidak berdosa, berbuat dusta dengan menyatakan dirinya bersih dan menuduh orang yang tidak berdosa, mengakibatkan adanya hukuman duniawi yang tidak benar, orang yang salah tidak terkena, bahkan orang yang tidak bersalah malah diberi hukuman. Demikian juga, orang yang tidak bersalah menjadi bahan pembicaraan orang lain dan mafsadat lainnya. Kita meminta kepada Allah agar dilindungi daripadanya dan dari setiap keburukan, Allahumma aamin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 112",
    "description": "Dan barang siapa berbuat kesalahan, yaitu perbuatan atau pelanggaran yang dilakukan tanpa sengaja, atau perbuatan dosa yang dilakukan dengan sengaja, kemudian dia tuduhkan atau lemparkan kesalahan dan perbuatan dosa itu kepada orang lain yang tidak bersalah, maka sungguh, dia telah memikul suatu kebohongan yang besar dan dosa yang nyata karena dia yang melakukan kesalahan dan perbuatan dosa ituayat ini menggambarkan begitu banyak nikmat dan rahmat yang Allah anugerahkan kepada nabi Muhammad, termasuk nikmat melindungi beliau dari segala upaya orang-orang munafik untuk menyesatkan beliau. Dan kalau bukan karena karunia Allah dan rahmat-Nya yang beraneka ragam yang dianugerahkan kepadamu, wahai nabi Muhammad, termasuk memelihara kamu dari kesalahan, tentulah segolongan dari mereka, orang-orang munafik, berkeinginan keras dan berusaha untuk menyesatkanmu dan memalingkan kamu dari kebenaran. Tetapi apa yang mereka inginkan dan usahakan itu hanya menyesatkan diri mereka sendiri, dan tidak membahayakanmu sedikit pun, kapan dan di mana pun. Dan juga karena Allah telah menurunkan kitab, yaitu alqur'an yang amat sempurna dengan petunjuk-petunjuk yang ada di dalamnya, yang dengannya engkau dapat mengambil keputusan yang benar dan menjadi petunjuk bagi umatmu dan juga memberikan hikmah kepadamu, yaitu pemahaman dan pengamalan melalui sunahsunahmu yang dapat diteladani, dijadikan pedoman, dan diikuti oleh umatmu dan dia juga telah mengajarkan kepadamu apa yang belum engkau ketahui, yaitu hal-hal yang belum disampaikan Allah di dalam Al-Qur'an maupun hikmah. Demikianlah karunia-karunia Allah yang dianugerahkan kepadamu dan karunia Allah yang dilimpahkan kepadamu itu sangat besar."
  }
]