[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan seandainya Allah tidak menganugerahkan nikmat kepadamu (wahai rasul), dan tidak merahmatimu dengan karunia kenabian,dan tidak memeliharamu dengan taufikNya, melalui wahyu yang diwahyukan kepadamu, niscaya akan bertekad kuat dari segolongan orang-orang yang mengkhianati diri mereka sendiri untuk menggelincirkanmu dari jalan kebenaran, namun mereka tidaklah menggelincirkan dengan usaha mereka itu kecuali diri mereka sendiri. Dan mereka tidak sanggup melancarkan gangguan kepadamu karena perlndungan Allah terhadap dirimu. Dan Allah telah menurunkan kepadamu al-qur’an dan assunnah yang berfungsi sebagai penjelasan al-qur’an, dan memberimu petunjuk kepada ilmu yang tidak kamu ketahui sebelumnya. Dan karunia yang Allah mengistimewakan dirimu dengannya merupakan perkara yang sangat besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "113. Seandainya bukan lantaran karunia Allah yang diberikan kepadamu -wahai Rasul- berupa perlindungan-Nya pada dirimu, niscaya ada sekelompok orang dari mereka yang mengkhianati diri mereka untuk menyesatkanmu dari kebenaran sehingga kamu memutuskan perkara secara tidak adil. Padahal sejatinya mereka tidak menyesatkan siapa pun selain diri mereka sendiri. Karena akibat dari upaya penyesatan mereka itu akan kembali kepada diri mereka sendiri. Allah menurunkan Al-Qur`ān dan Sunah kepadamu dan mengajarkan kepadamu petunjuk serta cahaya yang tadinya belum kamu ketahui. Dan karunia Allah yang Dia berikan kepadamu berupa kenabian dan perlindungan itu sangatlah besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "113. setelah Allah menyebutkan orang-orang yang menghianati diri mereka sendiri dan menjelaskan usaha mereka untuk menjauhkan Rasulullah dari kebenaran, maka kemudian Allah menjelaskan karunia dan kenikmatan yang telah Dia berikan kepadanya. Allah menyebutkan bahwa kalaulah bukan karena karunia-Nya kepada Rasulullah dengan menjadikannya maksum dan karena rahmat-Nya dengan menjelaskan kebenaran yang sesungguhnya, niscaya segolongan mereka akan berusaha untuk menjauhkannya dari keputusan yang adil yang sesuai dengan kebenaran yang ada. Namun sebelum mereka melakukan itu wahyu Allah memberinya yang menjelaskan kebenaran dan menegakkan tiang-tiang keadilan bagi seluruh makhluk. Dan Allah senantiasa memberinya wahyu dan mengajarinya ilmu sehingga dia sampai pada derajat ilmu yang yang tidak akan mampu seorangpun sampai pada derajat tersebut, dialah makhluk yang paling luas ilmunya dan yang paling sempurna, sehingga karunia Allah kepada Rasulullah lebih besar daripada karunia yang Allah berikan kepada setiap makhluk lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "113. وَلَوْلَا فَضْلُ اللهِ عَلَيْكَ وَرَحْمَتُهُۥ (Sekiranya bukan karena karunia Allah dan rahmat-Nya kepadamu) Kalimat ini ditujukan kepada Rasulullah. Dan yang dimaksud dengan karunia dan rahmat yang diberikan kepada Rasulullah adalah Allah memberitahukan kebenaran kepadanya dalam kisah Bani Ubairiq tadi. لَهَمَّت طَّآئِفَةٌ مِّنْهُمْ(tentulah segolongan dari mereka berkeinginan keras) Yakni kelompok orang yang membela Bani Ubairiq. أَن يُضِلُّوكَ (untuk menyesatkanmu) Yakni menyesatkanmu dari kebenaran sehingga kamu memutuskan perkara dengan menyalahkan orang yang tak bersalah dan membenarkan orang yang berbuat kejahatan. وَمَا يُضِلُّونَ إِلَّآ أَنفُسَهُمْ ۖ (Tetapi mereka tidak menyesatkan melainkan dirinya sendiri) Karena akibat perbuatan itu akan kembali kepada mereka. وَمَا يَضُرُّونَكَ مِن شَىْءٍ ۚ (dan mereka tidak dapat membahayakanmu sedikitpun kepadamu) Karena Allah-lah yang melindungimu dari manusia, dan kamu memutuskan perkara mereka berdasarkan apa yang nampak sehingga putusanmu itu tidak akan membahayakanmu -seandainya kamu memutuskan dengan putusan itu- karena wahyu belum turun kepadamu. وَأَنزَلَ اللهُ عَلَيْكَ الْكِتٰبَ (Dan (juga karena) Allah telah menurunkan Kitab) Yakni lewat ayat ini dan ayat-ayat yang lain Allah mensyariatkan bagimu hukum-hukum dan kaidah-kaidah yang mengandung kebaikan yang banyak, dan hal ini adalah hasil dari terjadinya perkara Bani Ubairiq. وَالْحِكْمَةَ (dan hikmah kepadamu) Yakni juga menurunkan sunnah disamping ayat-ayat yang Allah turunkan kepadamu. وَعَلَّمَكَ مَا لَمْ تَكُن تَعْلَمُ (dan telah mengajarkan kepadamu apa yang belum kamu ketahui) Yakni belum kamu ketahui sebelumnya. وَكَانَ فَضْلُ اللهِ عَلَيْكَ عَظِيمًا(Dan adalah karunia Allah sangat besar atasmu) Karena tidak ada karunia yang lebih besar dibandingkan kenabian dan diturunkannya wahyu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَوْلَا فَضْلُ اللَّهِ عَلَيْكَ وَرَحْمَتُهُ لَهَمَّتْ طَائِفَةٌ مِنْهُمْ أَنْ يُضِلُّوكَ } \"Sekiranya bukan karena karunia Allah dan rahmat-Nya kepadamu, tentulah segolongan dari mereka berkeinginan keras untuk menyesatkanmu\" Bahkan Nabi pun tidak lepas dari usaha orang-orang kafir untuk menyesatkannya, maka bagaimana dengan orang merasa aman dengan kesesatan kafir padal dia bukan nabi? dan bagaimana ia menyangka akan selamat dari fitnah ?! Semoga Allah senantiasa menjadikan kita istiqomah di atas kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "113 Sekiranya bukan karena karunia Allah dan rahmat-Nya kepadamu wahai Nabi, dengan memperingatkanmu atas kebenaran tentang cerita Thu’mah tentulah segolongan dari mereka berkeinginan keras untuk menyesatkanmu dari kebenaran dengan kesaksian palsu yaitu Bani Ubairaq. Tetapi mereka tidak menyesatkan melainkan dirinya sendiri, dan mereka tidak dapat membahayakanmu sedikitpun. Sebab engkau memberi keputusan atas kesaksian nyata yang engkau dengar, dan Allah telah menurunkan Alquran kepadamu dan hikmah kepadamu, dan telah mengajarkan kepadamu rahasia syariat yang belum kamu ketahui dan kemampuan untuk mengetahui kebenaran. Karunia Allah untukmu sangatlah besar dengan mengutusmu kepada seluruh manusai. Tidak ada yang lebih utama melebihi anugerah kenabian dan penurunan wahyu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalau bukan karena karunia Allah kepadamu} dengan kenabian {dan rahmatNya} perlindunganNya {tentu segolongan dari mereka berkeinginan keras} tentu segolongan bersikeras {untuk menyesatkanmu} menggelincirkanmu dari menunaikan kebenaran {Mereka tidak menyesatkan, kecuali diri sendiri dan tidak membahayakanmu sedikit pun. Allah telah menurunkan Kitab dan hikmah kepadamu} Al-Qur’an dan sunnah {serta telah mengajarkan kepadamu apa yang tadinya belum kamu ketahui. Karunia Allah atas kamu itu sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "113. Kemudian Allah menyebutkan karuniaNya atas RasulNya dengan menjaga dan melindunginya dari orang yang hendak menyesatkannya dengan berfirman, “Sekiranya bukan karena karunia Allah dan rahmatNya kepadamu, tentulah segolongan dari mereka berkeinginan keras untuk menyesatkanmu,” yang demikian itu adalah bahwa ayat-ayat yang mulia ini telah disebutkan oleh para ahli tafsir tentang sebab turunnya, yaitu bahwa sebuah keluarga telah mencuri di Madinah, dan ketika pencurian mereka hendak diperiksa, mereka khawatir aib dan cela mereka terbongkar lalu mereka mengambil barang curian itu dan meletakannya di rumah orang yang tidak bersalah, lalu pelaku pencurian itu meminta bantuan kepada kaumnya untuk datang kepada Rasulullah dan memohon kepada beliau agar membebaskan tuduhan pencurian dari teman mereka tersebut di tengah-tengah masyarakat, dan mereka berkata, bahwa ia tidaklah mencuri, namun yang mencuri itu adalah orang yang didapatkan dari rumahnya barang curian, padahal dia tidak melakukannya, lalu Rasulullah hendak membebaskan tuduhan dari teman mereka itu, namun Allah segera menurunkan ayat-ayat ini kepada beliau sebagai peringatan dan penjelasan akan kejadian tersebut serta ancaman buat Rasulullah karena membela orang-orang yang berkhianat, dan berseteru demi membela orang yang salah merupakan kesesatan, karena sesungguhnya kesesatan itu ada dua macam: kesesatan dalam pengetahuan yaitu tidak mengetahui kebenaran, dan kesesatan dalam perbuatan yaitu melakukan sesuatu yang seharusnya tidak dilakukan, karena itu Allah telah memelihara RasulNya dari bentuk yang pertama sebagaimana Allah juga menjaga beliau dari kesesatan dalam perbuatan. Lalu Allah mengabarkan bahwa tipu daya dan makar mereka akan kembali kepada diri mereka sendiri seperti halnya setiap pelaku tipu daya, yaitu FirmanNya, “Tetapi mereka tidak menyesatkan melainkan dirinya sendiri,” karena tipu daya dan siasat mereka itu tidaklah mampu memenuhi apa yang mereka inginkan dan tidak memberikan mereka kecuali hanya kegagalan, kefakiran, dosa, dan kerugian. Hal ini adalah sebuah nikmat yang besar atas Rasulullah, yang meliputi nikmat dengan perbuatan yaitu bimbingan untuk melakukan apa yang harus dilakukan dan perlindungan dari hal-hal yang diharamkan, kemudian Allah menyebutkan nikmatNya kepadanya dengan ilmu seraya berfirman, “Dan (juga karena) Allah telah menurunkan Kitab dan hikmah kepadamu” yaitu Allah menurunkan kepadamu al-Quran yang agung dan penuh hikmah yang mengandung penjelasan akan segala sesuatu dan pengetahuan tentang orang terdahulu maupun yang akan datang. Adapun hikmah yang berarti Sunnah adalah sebagaimana yang diungkapkan oleh para ulama salaf, “Sesungguhnya Sunnah itu diturunkan juga kepadanya sebagaimana al-Quran diturunkan,” atau pengetahuan akan rahasia-rahasia syariat di luar dari pengetahuan hukum-hukumnya, menempatkan sesuatu pada tempatnya dan mengatur segala perkara menurut yang semestinya, “dan telah mengajarkan kepadamu apa yang belum kamu ketahui,” hal ini mencakup segala hal yang dajarkan oleh Allah kepada beliau, dan sesungguhnya Nabi sebagaimana yang Allah gambarkan tentang beliau, sebelum kerasulan beliau, Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk. \"Sebelumnya kamu tidaklah mengetahui apakah Al Kitab (Al Quran) dan tidak pula mengetahui apakah iman itu,\"(ASy-Syura’:52). Dan FirmanNya, \"Dan Dia mendapatimu sebagai seorang yang bingung, lalu Dia memberikan petunjuk\" (Adh-Dhuha:7), Kemudian Allah tetap selalu memberikan wahyu kepadanya, mengajarkannya dan menyempurnakannya hingga beliau meningkat kepada kedudukan yang tinggi berupa ilmu yang tidak akan mampu dicapai oleh orang-orang terdahulu maupun yang akan datang, maka beliau adalah manusia yang paling berilmu secara mutlak, manusia yang paling banyak sifat-sifat kesempurnaannya dan paling sempurna dalam hal tersebut, karena itulah Allah berfirman, “Dan karunia Allah terhadap Rasulullah Muhammad adalah lebih agung daripada karuniaNYa terhadap setiap makhluk (selainnya), bentuk karunia yang diberikan Allah kepadanya tidaklah mungkin dapat diteliti dan tidak mudah untuk dihitung."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 113: Dan sekiranya tidak ada kurnia Allah atasmu dan rahmatNya niscaya segolongan dari berikhtiar akan padahal mereka tidak akan menyesatkan melainkan diri mereka (sendiri), dan tidak akan mereka bahayakanmu karena Allah telah turunkan atas- mu Kitab dan kebijaksanaan, dan Ia telah ajarkan kepadamu apa yang engkau belum tahu; dan ada- lah kurnia Allah atasmu itu besar. mereka menyesatkanmu, walaupun sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para mufassir banyak yang menyebutkan –namun kami tidak mengetahui apakah kisah ini shahih atau tidak-, bahwa sebab turun ayat di atas adalah karena salah satu keluarga yang tinggal di Madinah melakukan pencurian. Saat pencurian yang dilakukan itu diketahui, maka karena mereka takut aibnya terbuka, mereka pun menjaga pencurinya dan menuduhkan tindak pencurian itu kepada sebuah keluarga yang tidak bersalah. Pencuri tersebut meminta bantuan kepada kaumnya agar mendatangi Rasulullah shallallahu 'alaihi wa sallam; meminta Beliau agar membebaskan dirinya dari kesalahan di hadapan manusia. Kaumnya mengatakan, \"Ia tidaklah mencuri, yang mencuri adalah orang yang di rumahnya terdapat barang curian tersebut\". Hampir saja Rasulullah shallallahu 'alaihi wa sallam membebaskan orang yang bersalah tersebut, maka Allah Subhaanahu wa Ta'aala pun menurunkan ayat ini untuk mengingatkan Beliau shallallahu 'alaihi wa sallam agar tidak membela orang-orang yang berkhianat. Hal itu, karena membela orang yang batil adalah sebuah kesesatan. Perlu diketahui, bahwa kesesatan terbagi menjadi dua: kesesatan dalam ilmu dan kesesatan dalam amal. Kesesatan dalam ilmu berupa ketidaktahuan teradap kebenaran, sedangkan kesesatan dalam amal berupa mengamalkan hal yang tidak benar. Allah menjaga Nabi Muhammad shallallahu 'alaihi wa sallam dari kedua kesesatan tersebut sebagaimana dalam ayat di atas. Berupa penjagaan-Nya dari kesesatan. Yakni memalingkan kamu dari memutuskan secara adil. Karena akibat dari usaha mereka untuk menyesatkan kembalinya kepada diri mereka sendiri. Demikian juga karena tidak ada yang mereka dapatkan selain kekecewaan, tidak tercapai tujuan, mendapatkan dosa dan kerugian. Hikmah di sini adalah As Sunnah. Ada pula yang mengatakan bahwa hikmah adalah mengetahui rahasia syari'at di samping mengetahui hukum-hukum serta menempatkan sesuatu pada tempatnya. Tentang hukum dan perkara ghaib. Termasuk ke dalamnya juga semua yang diajarkan Allah kepadanya, karena Beliau shallallahu 'alaihi wa sallam sebagaimana disifatkan Allah sebelum diangkat menjadi nabi, \"Sebelumnya kamu tidak mengetahui apa kitab (Al Quran) dan tidak pula mengetahui apa iman itu…dst.\" (Terj. Asy Syuuraa: 52). Setelah itu, Allah Subhaanahu wa Ta'aala senantiasa memberi wayu, mengajarkannya dan menyempurnakannya sehingga Beliau mencapai pada derajat yang sulit dicapai oleh orang-orang yang hidup di zaman dahulu maupun yang datang kemudian, Beliau pun menjadi manusia paling berilmu dan paling sempurna. Hal ini, yakni diturunkan Al Qur'an, hikmah dan diajarkan ilmu merupakan nikmat besar bagi Nabi Muhammad shallallahu 'alaihi wa sallam setelah nikmat taufiq untuk mengerjakan kewajiban dan terpeliharanya dari setiap perkara yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 113",
    "description": "Ayat ini menggambarkan begitu banyak nikmat dan rahmat yang Allah anugerahkan kepada nabi Muhammad, termasuk nikmat melindungi beliau dari segala upaya orang-orang munafik untuk menyesatkan beliau. Dan kalau bukan karena karunia Allah dan rahmat-Nya yang beraneka ragam yang dianugerahkan kepadamu, wahai nabi Muhammad, termasuk memelihara kamu dari kesalahan, tentulah segolongan dari mereka, orang-orang munafik, berkeinginan keras dan berusaha untuk menyesatkanmu dan memalingkan kamu dari kebenaran. Tetapi apa yang mereka inginkan dan usahakan itu hanya menyesatkan diri mereka sendiri, dan tidak membahayakanmu sedikit pun, kapan dan di mana pun. Dan juga karena Allah telah menurunkan kitab, yaitu alqur'an yang amat sempurna dengan petunjuk-petunjuk yang ada di dalamnya, yang dengannya engkau dapat mengambil keputusan yang benar dan menjadi petunjuk bagi umatmu dan juga memberikan hikmah kepadamu, yaitu pemahaman dan pengamalan melalui sunahsunahmu yang dapat diteladani, dijadikan pedoman, dan diikuti oleh umatmu dan dia juga telah mengajarkan kepadamu apa yang belum engkau ketahui, yaitu hal-hal yang belum disampaikan Allah di dalam Al-Qur'an maupun hikmah. Demikianlah karunia-karunia Allah yang dianugerahkan kepadamu dan karunia Allah yang dilimpahkan kepadamu itu sangat besar sama sekali tidak ada kebaikan dari banyak pembicaraan rahasia atau bisikan-bisikan yang mereka lakukan, tetapi yang baik itu adalah orang yang menyuruh untuk bersedekah, atau berbuat makruf, yaitu perbuatan kebajikan yang sesuai dengan tuntunan agama dan sudah dikenal oleh masyarakat sebagai sesuatu yang baik, atau mengadakan perdamaian di antara manusia yang berselisih dan bertikai. Barang siapa berbuat demikian, yaitu perbuatan-perbuatan yang disebutkan di atas karena niat mencari keridaan Allah, maka kelak kami akan memberinya pa-hala yang besar, banyak dan berlipat ganda."
  }
]