[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah tidak mengampuni dosa perbuatan menyekutukan sesuatu denganNya, dan akan mengampuni selain syririk dari dosa-dosa lainnya bagi siapa saja yang Dia kehendaki diantara hamba-hambaNya. Dan barangsiapa menjadikan sekutu bagi Allah , Dzat yang tunggal dan maha esa ,dari kalangan makhluknya,maka sungguh ia telah jauh dari kebenaran denagn sejauh-jauhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "116. Sesungguhnya Allah tidak akan mengampuni dosa orang yang menyekutukan-Nya dengan sesuatu, bahkan Dia akan membuatnya kekal di Neraka. Dan Dia akan mengampuni dosa serta perbuatan maksiat lain selain syirik bagi orang yang Dia kehendaki berkat kasih sayang dan kemurahan-Nya. Barangsiapa yang menyekutukan Allah dengan sesuatu, ia telah tersesat sejauh-jauhnya dari jalan yang benar, karena ia telah menyamakan Sang Khalik dengan makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "116. Allah memperingatkan dari perbuatan syirik bahwa itu merupakan dosa yang tidak akan diampuni, dan Dia mungkin akan mengampuni Siapa yang Dia kehendaki dari orang-orang yang berbuat dosa selain dosa syirik sehingga Dia tidak akan mengazab mereka. Dan barangsiapa yang menyekutukan Allah maka dia telah tersesat dari tujuan yang benar dan menjauh dari jalan petunjuk sejauh-jauhnya, sebab kesyirikan merupakan kesesatan yang merusak akal dan memperkeruh kesucian jiwa dan menjadikan pelakunya tunduk kepada hamba yang seperti dirinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "116. إِنَّ اللهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِۦ (Sesungguhnya Allah tidak mengampuni dosa mempersekutukan (sesuatu) dengan Dia) Tafsir dari ayat ini telah disebutkan pada ayat: 48 dalam surat ini. Dikeluarkan oleh Tirmidzi dari Ali bin Abi Thalib ia berkata: “tidak ada dalam al-qur’an yang lebih aku cintai daripada ayat ini”. Yakni karena ayat ini memberi harapan bagi para pelaku maksiat sehingga mereka tidak berputus asa untuk mendapat rahmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "116 Sesungguhnya Allah tidak akan mengampuni dosa syirik yang menyembah sesembahan selain Dia. Diantara yang sama seperti itu adalah ingkar kepada rasul dan hari akhir, dan Dia mengampuni dosa selain syirik bagi siapa yang dikehendaki-Nya. Barangsiapa yang mempersekutukan (sesuatu) dengan Allah, maka sesungguhnya ia telah tersesat sejauh-jauhnya dari kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah tidak akan mengampuni karena menyekutukanNya, tetapi Dia mengampuni apa yang selain itu bagi siapa yang Dia kehendaki. Siapa pun yang menyekutukan Allah sungguh telah tersesat sangat jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "116. Ancaman ini yang menjadi akibat dari pertentangan dan perselisihan terhadap kaum Mukminin memiliki tingkatan-tingkatan yang tidak ada yang dapat menghitungnya kecuali Allah semata, yang sesuai dengan pelaku dosa, baik kecil maupun besar, di antaranya ada yang menyebabkan kekekalan dalam neraka dan mengakibatkan segala kehinaan, dan ada juga yang tidak seperti itu, dan kira-kira ayat yang kedua ini adalah sebagai perincian dari ayat yang mutlak tersebut, yaitu bahwa kesyirikan itu tidaklah akan diampuni oleh Allah, karena mengandung pelecehan terhadap Rabb semesta alam dan juga terhadap keesaanNya, penyamaan antara makhluk yang sama sekali tidak memiliki manfaat dan mudharat bagi dirinya dengan dzat yang memiliki mudharat, di mana tidak ada kenikmatan sedikitpun kecuali diriNya, dan tidak menolak keburukan kecuali dirinya, yang memiliki segala kesempurnaan mutlak dari segala sisinya, dan maha kaya dengan segala bentuknya, maka diantara hal yang paling besar kezhalimannya dan paling jauh kesesatannya adalah tidak ikhlasnya ibadah untuk dzat yang memiliki kondisi dan keagungan seperti itu, dan mengarahkan ibadah itu kepada makhluk yang tidak memiliki kondisi kesempurnaan sedikitpun dan tidak memiliki sipat kekayaan sedikitpun bahkan yang tidak memiliki apa pun kecuali ketiadaan, tidak ada wujudnya, tidak ada kesempurnaannya, tidak ada kkekayaannya, serta hanya memiliki kefakiran dari segala sisi. sedangkan kesalahan dan dosa selain syirik, maka ia terletak di bawah kehendak Allah, bila dia menghendaki, dia akan mengampuninya dengan rahmat dan hikmahNya dengan keadilan dan hikmahNya. Ayat yang mulia ini telah di jadikan dalil bahwa ijmaumat adalah hujjah, dan bahwa ijma itu adalah ma’shum, (terjaga) dari kesalahan. Yang demikian itu karena Allah telah mengancam orang yang menyelisihi jalan kaum Mukminin dengan kehinaan dan api neraka, jalan kaum Muminin ini adalah sebuah kata tunggalyang bersandar, meliputi segala perkara yang ada di kaum Mukminin, baik akidah maupun perbuatan, lalu bila mereka telah sepakat atas wajibnya sesuatu perkara atu menganjurkannya atau mengharamkannya atau memakruhkannya atau membolehkannya, maka inilah jalan mereka, dan barang siapa yang menyelisihi mereka pada sesuatu hal dari itu semua telah terjadinya ijma mereka atas hal tersebut, maka sesungguhnya mereka telah mengikuti selain jalan mereka. Kamu adalah umat yang terbaik yang dilahirkan untuk manusia, menyuruh kepada yang ma’ruf, dan mencegah dari yang munkar, dan beriman kepada Allah.\" ( Ali-imran:110) Konteks dalil dari ayat ini adalah bahwa Allah mengabarkan bahwa kaum Mukminin dari umat ini tidaklah menyuruh kecuali kepada yang ma’ruf, dan bila mereka telah sepakat atas wajibnya suatu perkara atau sunahnya, maka perkara tersebut di antara hal yang mereka perintahkan, sehingga wajiblah dengan nash ayat ini bahwa itu menjadi ma’ruf, dan tidak ada hal lagi selain yang ma’ruf itu kecuali yang munkar, demikian juga bila mereka telah sepakat atas larangan dari suatu perkara, maka perkara itu di antara hal yang mereka larang, dan tidaklah hal itu kecuali yang munkar. \" Dan demikian (pula) Kami telah menjadikan kamu (umat Islam), umat yang adil dan pilihan agar kamu menjadi saksi atas (perbuatan) manusia dan agar Rasul (Muhammad) menjadi saksi atas (perbuatan) kamu\" (Al-bagarah:143). Allah mengabarkan bahwa umat ini telah di jadikan sebagai umat yang pertengahan, artinya adil dan pilihan, agar mereka menjadi saksi atas perbuatan manusia, maksudnya menjadi saksi dalam segala perkara, bila mereka telah bersaksi atas suatu hukum bahwa Allah memerintahkan untuk melarangnya darinya, atau membolehkannya, sesungguhnya kesaksian mereka itu adalah ma’shum, karena mereka mengetahui apa yang mereka persaksikan dan berlaku adil dalam hal tersebut, sekiranya perkara ini berdeda dengan yang demikian itu, maka mereka tidaklah akan menjadi orang-orang yang adil dalam persaksian mereka dan tidak pula mereka mengetahuinya. \" Kemudian jika kamu berlainan pendapat tentang sesuatu, maka kembalikanlah ia kepada Allah (Al Quran) dan Rasul (sunnahnya),\" (An-Nisa:59). Dalam ayat ini dapat di pahami bahwasannya perkara yang mereka tidak perselisihkan akan tetapi mereka sepakati, maka tidaklah mereka diperintahkan untuk di kembalikannya kepada Al-qur’an dan as-Sunah, yang demikian itu tidaklah terjadi kecuali karena perkara tersebut sesuai dengan Al-qur’an dan as-Sunah dan tidak menyelisihi keduanya. Dalil dalil ini dan yang semacamnya menunjukan keyakinan bahwa ijma umat ini adalah suatu hujjah yang kuat, karena itulah Allah menjelaskan kejelekan keum Musyirikindalam FirmannNya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 116: Sesungguhnya Allah akan mengampunkan (dosa) yang tidak la disekutukan tetapi la akan mengampuni selain dari itu bagi siapa yang la kehendaki, karena barang siapa menyekutukan Allah. maka sesungguhnya ia telah sesat, satu kesesatan yang jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dosa syirk tidak diampuni Allah karena di dalamnya mengandung pencacatan Rabul 'alamin dan keesaan-Nya, demikian juga karena di dalam menyamakan antara makhluk yang tidak berkuasa memberi manfaat dan madharrat dengan Al Khaliq yang berkuasa memberi manfaat dan madharrat, di mana tidak ada satu pun nikmat kecuali dari-Nya dan tidak ada yang dapat menolak bahaya selain Dia. Dia memiliki kesempurnaan secara mutlak dari berbagai segi dan Maha Kaya dari segala sisi. Oleh karena itu, kezaliman yang paling besar dan kesesatan yang paling jauh adalah mengalihkan ibadah kepada makhluk yang memiliki kelemahan dan kekurangan. Dosa-dosa di bawah syirk tahta masyii'atillah (di bawah kehendak Allah); jika Allah menghendaki, maka Dia mengampuninya dengan rahmat dan kebijaksanaan-Nya, dan jika Dia menghendaki, maka Dia akan mengazabnya dengan keadilan dan kebijaksanaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 116",
    "description": "Syirik adalah perbuatan dosa yang paling besar. Karena itu, sesungguhnya Allah yang maha esa tidak akan mengampuni dosa syirik yakni mempersekutukan-Nya dengan sesuatu apa pun tanpa bertobat sebelum ia mati, dan dia mengampuni dosa yang dilakukan selain syirik itu, baik dosa besar maupun kecil, baik yang bersangkutan memohon ampun atau tidak, bagi siapa yang dia kehendaki berdasarkan kebijakannya. Dan barangsiapa mempersekutukan sesuatu dengan Allah, maka sungguh, dia telah tersesat jauh sekali sehingga sulit baginya untuk menemukan jalan kembali kepada kebenaran (lihat: surah an-nisa'/4: 48, 116; dan surah luqma'n/31: 13). Ayat yang lalu menjelaskan dosa perbuatan syirik dan kesesatan yang sangat jauh yang dialami oleh mereka musyrik, sedangkan pada ayat ini Allah menjelaskan beberapa bentuk perbuatan syirik itu. Yang mereka sembah selain Allah itu tidak lain hanyalah ina'Å¡, yaitu berhala-berhala, yang mereka buat dengan tangan mereka sendiri. Berhala-berhala itu disebut ina'Å¡, yang berasal dari kata anaÅ¡a yang serupa dengan huruf-huruf yang membentuk kata waÅ¡ana, karena mengandung makna kelemahan, keterpisahan, banyak, dan karena diyakini bahwa berhala-berhala itu adalah anak-anak perempuan. Dan oleh sebab itu, mereka tidak lain hanyalah menyembah setan yang durhaka, karena setanlah yang membawa dan mengantarkan mereka untuk melakukan perbuatan syirik itu."
  }
]