[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah Kaum musyrikin menyembah selain Allah kecuali hanya kepada berhala-berhala yang tidak dapat mendatangkan manfaat dan menimpakkan mudarat. Dan mereka sebenarnya tidaklah menyembah, kecuali kepada setan yang amat durhaka terhadap Allah, yang telah berbuat kerusakan dam melakukan kerusakan yang mencapai batas yang parah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "117. Orang-orang musyrik itu tidaklah menyembah bersama Allah selain berhala-berhala yang dinamai dengan nama-nama perempuan, seperti Lāta dan Uzzā, yang tidak dapat mendatangkan manfaat maupun mudarat. Sejatinya yang mereka sembah tidak lain adalah setan yang senantiasa durhaka kepada Rabbnya dan sama sekali tidak mengandung kebaikan. Karena setanlah yang menyuruh mereka menyembah berhala."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "117-118. Kemudian Allah menjelaskan keadaan orang-orang musyrik bahwa mereka tidaklah berdoa agar hajat mereka terpenuhi dan musibah mereka terselesaikan kecuali kepada orang-orang yang telah mati. Dahulu orang-orang musyrik tersebut sangat mengagumkan orang-orang yang telah mati dan berdoa kepada mereka sebagaimana yang dilakukan oleh kebanyakan ahli kitab dan sebagian orang Islam pada saat ini. Atau orang-orang musyrik tersebut tidak berdoa kecuali kepada perempuan seperti al-Laata dan al-'Uzza. Dahulu setiap kabilah memiliki berhala dan menyebutnya dengan perempuan milik Bani Fulan. Padahal apa yang mereka sembah itu tidak lain adalah setan yang durhaka yang tidak dapat memberi suatu kebaikan sedikitpun, sebab setanlah yang memerintahkan mereka untuk menyembah berhala tersebut, dan ketaatan mereka kepada setan merupakan bentuk penyembahan, maka dari itu Allah memberi balasan kepadanya dengan menjauhkannya dari rahmat dan karunia-nya. Setanlah yang mengajak kepada keburukan dan kebatilan dalam diri manusia dan membisikkan bisikannya ke dalam dada mereka, memberi mereka janji-janji dan angan-angan. Setan berkata: \"aku akan mengerahkan seluruh tenagaku untuk menarik orang-orang yang ada di bawah kuasa-Mu, dan mereka tidak akan dapat keluar menjadi kehendak-Mu yang telah Engkau tetapkan bagiku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "117. إِن يَدْعُونَ مِن دُونِهِۦٓ إِلَّآ إِنٰثًا (Yang mereka sembah selain Allah itu, tidak lain hanyalah berhala perempuan) Yakni apa yang mereka sembah selain Allah hanyalah berhala-berhala yang memiliki nama-nama perempuan seperti Laata, Uzza, dan Manat. Pendapat lain mengatakan yang dimaksud dengan kata “perempuan” adalah para malaikat, karena orang-orang musyrik mengatakan para malaikat adalah putri-putri Allah. Dari Dhahhak ia berkata: orang-orang musyrik mengatakan para malaikat adalah putri-putri Allah, dan kami menyembah mereka agar dapat mendekatkan kami kepada Allah sedekat-dekatnya. Dhahhak menambahkan: mereka menjadikan para malaikat sesebahan-sesembahan dan membentuk berhala mereka dengan bentuk anak-anak perempuan lalu mereka menghiasi mereka dengan perhiasan dan kalung, kemudian mereka mengatakan mereka mirip anak-anak perempuan Allah yang kami sembah (yang mereka maksudkan adalah para Malaikat). وَإِن يَدْعُونَ إِلَّا شَيْطٰنًا مَّرِيدًا (dan mereka tidak lain hanyalah menyembah syaitan yang durhaka) Yakni Iblis. Karena apabila mereka mentaatinya dalam apa yang dibujukkan kepada mereka sungguh mereka telah menyembahnya. Dan makna (المريد) yakni pembangkang lagi durhaka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "117 Yang mereka sembah selain Allah itu, tidak lain hanyalah berhala yang tidak bisa berbuat apa-apa, yaitu berhala yang mereka namai perempuan seperti Lata, Uza, Manah dan sebagainya. Orang Arab biasa menyebut sesuatu yang lemah dengan nama perempuan, dan dengan menyembah berhala itu tidak lain mereka hanyalah menyembah setan yaitu iblis, yang amat sangat durhaka kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak menyembah selain Dia} orang-orang musyrik tidak menyembah kepada selain Allah {kecuali berhala} berhala-berhala yang memiliki nama berjenis perempuan (dalam bahasa Arab), seperti Latta, Uzza, dan Manah {mereka juga tidak menyembah} mereka juga tidak menyembah {kecuali setan yang durhaka} keluar dari ketaatan kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117-118. Maksudnya, tidaklah orang-orang musyrik itu berdoa kepada selain daripada Allah kecuali wanita-wanita, yaitu patung-patung dan berhala-berhala yang dinamaka dengan nama-nama wanita seperti al-Uzza, Manat dan sebagainya. Dan suatu hal yang perlu di ketahui bahwa nama itu menunjukan kepada dzat yang dinamakan dengannya, lalu apabila nama-nama berhala mereka itu adalah nama-nama perempuan yang tidak sempurna, dengan nama-nama tersebut dan tidak adanya sipat kesempurnaan padanya, seperti yang di kabarkan oleh Allah pada beberapa tempat dalam kitabNya bahwa berhala-berhala itu tidaklah dapat menciptakan, memberi rezeki, tidak menghindarkan penyembah-penyembahannya bahkan dirinya sendiri dari kemudharatan dan tidak dapat pula mendatangkan manfaat, tidak mampu membela dirinya sendiri dan orang yang hendak berbuat jahat kepadanya, tidak memiliki pendengaran, tidak pula penglihatandan tidak pula hati, lalu bagaimana mungkin dzat yang seperti ini di sembah kemudian meninggan keihklasan kepada dzat yang memiliki nama-nama yang baik, sifat-sifat yang tinggi, pujian, kesempurnaan, keagungan, kemuliaan, kehormatan, keindahan, kasih sayang, kebaikan, karunia, keesaan, dalam mencipta dan mengatur, serta memiliki hikmah yang agung dalam mengurus dan menetapkan. Tidaklah yang seperti ini melainkan sejelek-jeleknya kejelekan yang menujukan akan kekurangan pelakunya dan keterpurukannya kepada kehinadinaan, suatu tingkatan terendah dari apa yang diperkirakan oleh seorang yang mengira-ngira atau yang di utarakan oleh orang yang membicarakannya, di samping itu ibadah mereka tersebut sesungguhnya bentuknya saja ditunjukan kepada berhala dan patung yang penuh kekurangan tersebut, namun hakikatnya tidaklah merekamenyembah kecuali kepada setan yang merupaka musuh yang nyata bagi mereka, yang menhendaki agar mereka celaka, dan selalu berusaha mencelakakan mereka dengan segala macam kemampuaanya, yang merupakan suatu keadaan yang sangat jauh dari Allah, Allah telah melaknatnya dari rahmatNya, sebagaimana Allah menjauhkanNya dari rahmatNya, ia juga berusaha menjauhkan manusia dari rahmat Allah, sesungguhnya setan itu hanya menyeru golongannya agar menjadi penghuni-penghuni neraka. Oleh sebab itu Allah mengabarkan tentang usaha setan dalam menjerumuskan manusia, menghiasi keburukan dan kejahatan unutk mereka, dan bahwa ia telah berkata kepada Rabbnya seraya bersumpah, “saya benar-benar akan mengambil dari hamba-hambamu bagian yang sudah di tentukan untukku,” yaitu yang di tentukan, setan yang terlaknat itu telah mengetahui bahwa hamba-hamba Allah yang pilihantidaklah mampu ia kuasai, sesungguhnya ia hanya berkuasa terhadap orang-orang yang mencintainya dan mendahulukan ketaatan kepadanya daripada ketaatan kepada Rabbnya. Dan setan juda telah bersumpah pada tempat yang lain bahwa ia akan benar-benar menjerumuskan mereka seluruhnya, kecuali hamba-hambMu yang pilihan di antara mereka, inilah yang diperkirakan dan di yakini oleh setan yang jahat itu, Alla mengabarkan tentang terjadinya perkara tersebut dengan FirmanNya, \" Dan sesungguhnya iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka lalu mereka mengikutinya, kecuali sebahagian orang-orang yang beriman.\" (As-Saba:20)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 117: Tidak mereka menyeru yang Jain daripada-Nya, melainkan pe- rempuan-perempuan, dan tidak me- reka menyeru melainkan setan yang durhaka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Asal arti Inaatsan dalam ayat di atas adalah perempuan-perempuan. Patung-patung berhala yang disembah oleh orang-orang Arab Jahiliyah itu biasanya diberi nama dengan nama-nama perempuan seperti Laata, Uzza dan Manah. Sudah menjadi maklum, bahwa nama menunjukkan orang yang dinamai. Jika namanya adalah nama-nama perempuan yang memang memiliki kekurangan, maka yang demikian menunjukkan kelemahan berhala-berhala itu. Hal ini sebagaimana Allah Subhaanahu wa Ta'aala telah menerangan di beberapa tempat dalam Al Qur'an tentang kelemahan berhala, yakni bahwa berhala-berhala itu tidak dapat menciptakan, memberi rezki, menolak musibah yang menimpa penyembahnya, bahkan berhala itu tidak dapat menolak bahaya yang datang menimpa dirinya. Berhala juga tidak mempunyai pendengaran, penglihatan dan hati. Jika demikian, mengapa makhluk yang begitu lemah ini disembah, sedangkan Allah yang memiliki nama-nama yang indah dan sifat-sifat yang tinggi malah tidak disembah; padahal Dia Tuhan yang berhak mendapat pujian, Tuhan yang memiliki kesempurnaan, kemuliaan, keagungan, keperkasaan, keindahan, kasih sayang, kebaikan, ihsan, sendiri dalam mencipta dan mengatur serta memiliki hikmah yang besar dalam syari'at dan qadar-Nya. Di samping itu, ibadah yang mereka arahkan kepada berhala, pada hakikatnya adalah menyembah setan; makhluk yang menjadi musuh mereka, makhluk yang menginginkan mereka binasa, dan berusaha mencari jalan untuk itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 117",
    "description": "Ayat yang lalu menjelaskan dosa perbuatan syirik dan kesesatan yang sangat jauh yang dialami oleh mereka musyrik, sedangkan pada ayat ini Allah menjelaskan beberapa bentuk perbuatan syirik itu. Yang mereka sembah selain Allah itu tidak lain hanyalah ina'Å¡, yaitu berhala-berhala, yang mereka buat dengan tangan mereka sendiri. Berhala-berhala itu disebut ina'Å¡, yang berasal dari kata anaÅ¡a yang serupa dengan huruf-huruf yang membentuk kata waÅ¡ana, karena mengandung makna kelemahan, keterpisahan, banyak, dan karena diyakini bahwa berhala-berhala itu adalah anak-anak perempuan. Dan oleh sebab itu, mereka tidak lain hanyalah menyembah setan yang durhaka, karena setanlah yang membawa dan mengantarkan mereka untuk melakukan perbuatan syirik itumereka dilaknati Allah, yaitu dijauhkan rahmat dan karunia serta kebajikan dari-Nya dan setan itu mengatakan, aku pasti akan selalu berusaha mengambil bagian tertentu yang telah engkau tentukan bagiku dari hamba-hamba-Mu yang durhaka kepada-Mu."
  }
]