[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengusirnya dari rahmatNYa.Dan setan berkata, ”aku benar-benar akan sungguh-sungguh mengambil bagian yang telah di tentukan dari hamba-hambaMu untuk aku sesatkan, dengan ucapan ataupun perbuatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "118. Oleh karena itulah Allah menjauhkannya dari rahmat-Nya. Dan setan ini bersumpah di hadapan Rabbnya dengan mengatakan, “Sungguh, aku benar-benar akan mengambil bagian tertentu dari hamba-hamba-Mu untuk kusesatkan dari jalan yang benar.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "118. لَّعَنَهُ اللهُ ۘ وَقَالَ لَأَتَّخِذَنَّ مِنْ عِبَادِكَ نَصِيبًا مَّفْرُوضًا (yang dilaknati Allah dan syaitan itu mengatakan: “Saya benar-benar akan mengambil dari hamba-hamba Engkau bahagian yang sudah ditentukan (untuk saya)) Yakni aku akan menjadikan sekelompok tertentu dari hamba-hamba Allah dibawah tipudaya-ku agar aku bisa mengeluarkan mereka dari peribadatan kepada Allah menuju kekufuran terhadap-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "118 Allah melaknat dan menjauhkan mereka dari rahmat-Nya, dan setan itu ketika dilaknat mengatakan: “Akh benar-benar akan mengambil sebagian hamba-hambaMu yang sudah ditentukan untukku, dan akan menyeret mereka dari ketaatan terhadapMu menuju kekufuran dan kemaksiatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah melaknatnya} menjauhkannya dari rahmatNya {setan berkata,“Aku benar-benar akan mengambil} sungguh aku akan menjadikan untukku {bagian tertentu dari hamba-hambaMu} bagian tertentu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "117-118. Maksudnya, tidaklah orang-orang musyrik itu berdoa kepada selain daripada Allah kecuali wanita-wanita, yaitu patung-patung dan berhala-berhala yang dinamaka dengan nama-nama wanita seperti al-Uzza, Manat dan sebagainya. Dan suatu hal yang perlu di ketahui bahwa nama itu menunjukan kepada dzat yang dinamakan dengannya, lalu apabila nama-nama berhala mereka itu adalah nama-nama perempuan yang tidak sempurna, dengan nama-nama tersebut dan tidak adanya sipat kesempurnaan padanya, seperti yang di kabarkan oleh Allah pada beberapa tempat dalam kitabNya bahwa berhala-berhala itu tidaklah dapat menciptakan, memberi rezeki, tidak menghindarkan penyembah-penyembahannya bahkan dirinya sendiri dari kemudharatan dan tidak dapat pula mendatangkan manfaat, tidak mampu membela dirinya sendiri dan orang yang hendak berbuat jahat kepadanya, tidak memiliki pendengaran, tidak pula penglihatandan tidak pula hati, lalu bagaimana mungkin dzat yang seperti ini di sembah kemudian meninggan keihklasan kepada dzat yang memiliki nama-nama yang baik, sifat-sifat yang tinggi, pujian, kesempurnaan, keagungan, kemuliaan, kehormatan, keindahan, kasih sayang, kebaikan, karunia, keesaan, dalam mencipta dan mengatur, serta memiliki hikmah yang agung dalam mengurus dan menetapkan. Tidaklah yang seperti ini melainkan sejelek-jeleknya kejelekan yang menujukan akan kekurangan pelakunya dan keterpurukannya kepada kehinadinaan, suatu tingkatan terendah dari apa yang diperkirakan oleh seorang yang mengira-ngira atau yang di utarakan oleh orang yang membicarakannya, di samping itu ibadah mereka tersebut sesungguhnya bentuknya saja ditunjukan kepada berhala dan patung yang penuh kekurangan tersebut, namun hakikatnya tidaklah merekamenyembah kecuali kepada setan yang merupaka musuh yang nyata bagi mereka, yang menhendaki agar mereka celaka, dan selalu berusaha mencelakakan mereka dengan segala macam kemampuaanya, yang merupakan suatu keadaan yang sangat jauh dari Allah, Allah telah melaknatnya dari rahmatNya, sebagaimana Allah menjauhkanNya dari rahmatNya, ia juga berusaha menjauhkan manusia dari rahmat Allah, sesungguhnya setan itu hanya menyeru golongannya agar menjadi penghuni-penghuni neraka. Oleh sebab itu Allah mengabarkan tentang usaha setan dalam menjerumuskan manusia, menghiasi keburukan dan kejahatan unutk mereka, dan bahwa ia telah berkata kepada Rabbnya seraya bersumpah, “saya benar-benar akan mengambil dari hamba-hambamu bagian yang sudah di tentukan untukku,” yaitu yang di tentukan, setan yang terlaknat itu telah mengetahui bahwa hamba-hamba Allah yang pilihantidaklah mampu ia kuasai, sesungguhnya ia hanya berkuasa terhadap orang-orang yang mencintainya dan mendahulukan ketaatan kepadanya daripada ketaatan kepada Rabbnya. Dan setan juda telah bersumpah pada tempat yang lain bahwa ia akan benar-benar menjerumuskan mereka seluruhnya, kecuali hamba-hambMu yang pilihan di antara mereka, inilah yang diperkirakan dan di yakini oleh setan yang jahat itu, Alla mengabarkan tentang terjadinya perkara tersebut dengan FirmanNya, \" Dan sesungguhnya iblis telah dapat membuktikan kebenaran sangkaannya terhadap mereka lalu mereka mengikutinya, kecuali sebahagian orang-orang yang beriman.\" (As-Saba:20)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 118: Allah telah la'natkan dia, dan ia telah berkata: \"Sesungguhnya Aku akan ambil daripada hamba- hambamu satu bahagian yang tertentu\"."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada setiap manusia ada potensi untuk baik dan ada potensi untuk jahat, setan akan mempergunakan potensi untuk jahat dalam mencelakakan manusia. Ada pula yang mengatakan bahwa maksudnya, setan yang terlaknat ini mengetahui bahwa dirinya tidak mampu menyesatkan semua hamba Allah, dan bahwa mereka tidak berkuasa apa-apa terhadap hamba-hamba Allah yang ikhlas, dia hanyalah berkuasa terhadap orang-orang yang menjadikannya sebagai kawannya, menaatinya dan meninggalkan ketaatan Ar Rahman. Setan mengambil bagian mereka, dia akan menyesatkan mereka dari jalan yang lurus; baik sesat dalam hal ilmu maupun amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 118",
    "description": "Mereka dilaknati Allah, yaitu dijauhkan rahmat dan karunia serta kebajikan dari-Nya dan setan itu mengatakan, aku pasti akan selalu berusaha mengambil bagian tertentu yang telah engkau tentukan bagiku dari hamba-hamba-Mu yang durhaka kepada-Mu dan pasti kusesatkan mereka dari jalan-Mu yang benar dan lurus, kapan pun dan di mana pun, dan akan kubangkitkan angan-angan kosong pada mereka sehingga mereka tidak dapat melakukan kebajikan-kebajikan dan akan kusuruh mereka memotong telinga-telinga binatang ternak lalu mereka benar-benar memotongnya, dan akan kusuruh mereka mengubah ciptaan Allah yang ada pada diri mereka, seperti fitrah keagaman dan keyakinan akan keesaan Allah yang sudah diikrarkan mereka pada waktu akan ditiupkan roh oleh Allah ke dalam diri mereka, dan mereka benar-benar mengubahnya, termasuk memperburuk wajah unta atau bentuk tubuhnya, padahal unta itu selama ini menjadi kendaraan mereka. Barangsiapa menjadikan setan sebagai pelindung selain Allah, maka sungguh, dia menderita kerugian yang nyata di dunia dan di akh."
  }
]