[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan benar-beanar akan aku sesatkan orang-orang yang mengikutiku dari kalangan mereka dari kebenaran,dan benar-benar akan aku janjikan mereka dengan angan-angan dan kedustaan dan sungguh-sungguh menyeru mereka untuk memotong telinga-telinga hewan ternak atau melubanginya untuk tujuan kebatilan yang akau perindah dari pandangan mereka. Dan aka sungguh-sungguh akan menyeru mereka untuk mengubah-ubah ciptaan Allah dari fitrahnya dan bentuk fisik yang ada pada makhluk.”barangsiapa menyambut seruan setan dan menjadikannya sebagai penolong baginya selain Allah, Dzat yang maha kuat lagi maha perkasa, maka sungguh dia telah binasa dengan kebinasaan yang nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "119. Dan sungguh, aku benar-benar akan menghalang-halangi mereka dari jalan-Mu yang lurus. Dan aku akan memberi mereka harapan-harapan palsu yang membuat kesesatan mereka tampak indah. Aku akan menyuruh mereka memotong-motong telinga hewan-hewan ternak untuk mengharamkan hewan-hewan yang Allah halalkan bagi mereka. Dan aku juga akan menyuruh mereka mengubah ciptaan Allah dan fitrah-Nya.” Barangsiapa yang menjadikan setan sebagai pemimpin yang mengaturnya dan patuh kepadanya, ia benar-benar telah mengalami kerugian yang nyata karena telah memberikan kesetiaannya kepada setan yang terkutuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "119. Kemudian Allah menyebutkan sumpah jadi setan yang berkata: \"Sungguh aku akan menyesatkan mereka dari jalan yang lurus dengan bisikan-bisikan dan godaan-godaan. Dan sungguh aku akan memanjangkan angan-angan mereka semampuku dengan berbagai kebatilan seperti menafikan hari kebangkitan, merasa umur yang masih panjang, mendapatkan rahmat dan ampunan di dunia dan akhirat, dan lain sebagainya yang dapat menyebabkan seseorang yang menunda-nunda taubat. Dan aku akan memerintahkan mereka untuk memotong-motong dan melubangi telinga hewan-hewan ternak sebagai tanda bahwa hewan itu haram bagi diri mereka. Dan aku akan memerintahkan mereka agar merubah ciptaan Allah yang telah dia ciptakan dengan hikmah yang sempurna agar mereka mengubahnya dengan berbagai macam pengubahan yang menyelisihi fitrah.\" Dan barangsiapa yang mengikuti setan dan godaannya maka dia telah jauh dari sebab-sebab mendapatkan rahmat dan karunia Allah, Dan dia telah jelas-jelas merugi di dunia dan di akhirat, sebab dia telah tertawan oleh angan-angan dan kurafat, melakukan suatu perbuatan tanpa petunjuk, dan tidak dapat mendapat manfaat dari akal dan keterampilan yang hanya Allah berikan kepada manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "119. وَلَأُمَنِّيَنَّهُمْ (dan akan membangkitkan angan-angan kosong pada mereka) Yakni angan-angan bathil yang timbul dari godaan dan bisikan setan. وَلَاٰمُرَنَّهُمْ فَلَيُبَتِّكُنَّ ءَاذَانَ الْأَنْعٰمِ(dan menyuruh mereka agar mereka benar-benar memotong telinga-telinga binatang ternak) Yakni mereka benar-benar memotongnya karena menaati perintahku. Dan orang-orang kafir telah benar-benar melakukan hal itu sebagai bentuk ketaatan atas perintah setan dan demi mengikuti jalannya, sehingga mereka memotong telinga-telinga baha’ir dan sawa’ib sebagaimana diketahui. وَلَاٰمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ اللهِ ۚ( dan akan aku suruh mereka (mengubah ciptaan Allah), lalu benar-benar mereka merubahnya) Menurut satu pendapat yang dimaksud adalah mengkebiri, membutakan mata, dan memotong telinga. Dan menurut pendapat lain dan merupakan pendapat yang benar yang dimaksud adalah merubah fitrah manusia sebagaimana yang Allah ciptakan berupa meng-esakan Allah dan pengakuan terhadap rububiyah, uluhiyah, dan kesempurnaan-Nya. Sebagian ulama memberi keringanandalam masalah mengkebiri hewan ternak apabila itu dimaksudkan untuk menambah manfaat dari hewan tersebut seperti agar menambah berat badan atau lainnya. Adapun dalam masalah mengkebiri manusia maka hukumnya haram dan dilarang kerena itu termasuk merubah ciptaan Allah. وَمَن يَتَّخِذِ الشَّيْطٰنَ وَلِيًّا مِّن دُونِ اللهِ(Barangsiapa yang menjadikan syaitan menjadi pelindung selain Allah) Yakni dengan mengikutinya dan mematuhi perintahnya dan menolak mengikuti perintah Allah dan mematuhi-Nya. فَقَدْ خَسِرَ خُسْرَانًا مُّبِينًا (maka sesungguhnya ia menderita kerugian yang nyata) Yakni kerugian yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "119 Saya benar-benar akan menyesatkan mereka, dan menanamkan dalam jiwa mereka kebatilan seperti umur yang panjang dan mewujudkan angan-angan, dan terus menerus dalam kemaksiatan. Dan menyuruh mereka memotong telinga-telinga binatang ternak seperti unta, sapi dan kambing layaknya memotong telinga keledai, dan mengaharamkan diri untuk memanfaatkannya. Lalu mereka benar-benar memotongnya, dan akan aku suruh mereka mengubah ciptaan Allah tidak sesuai fitrahnya, lalu benar-benar mereka merubahnya seperti merubah maskulin laki-laki secara materi atau penyerapan secara maknawi. Barangsiapa yang menjadikan setan sebagai pelindung selain Allah, serta mentaatinya, maka sesungguhnya ia menderita kerugian yang nyata."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Aku benar-benar akan menyesatkan mereka} sungguh aku akan benar-benar menghalangi mereka dari jalan petunjuk {membangkitkan angan-angan kosong mereka} sungguh aku akan mengiapkan untuk mereka angan-angan yang bohong {menyuruh mereka hingga mereka benar-benar memotong} hingga mereka benar-benar memotong {telinga hewan-hewan ternak dan menyuruh mereka hingga benar-benar mengubah ciptaan Allah. Siapa saja yang menjadikan setan sebagai pelindung selain Allah sungguh telah menderita kerugian yang nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "119. Bagian yang di tentukan di mana setan telah bersumpah kepada Allah bahwa ia akan menggoda manusia, ia menyebutkan apa yang menjadi keinginannya dari manusia, dana pa yang menjadi tujuannya untuk mereka dengan perkataanya, “Dan aku benar-benar akan menyesatkan mereka” yaitu dari jalan yang lurus, kesesatan dalam hal ilmu dan perbuatan, “Dan akan membangkitkan angan-angan kosong pada mereka,” yaitu di samping manyesatkan, membangkitkan angan-angan kosang mereka untuk memperoleh apa yang akan diperoleh oleh orang-orang yang di beri petunjuk,inilah inti dari keterpedayaan itu, dan ia tidaklah sebatas menyesatkan mereka hingga ia menghiasi kesesatan yang mereka kerjakan, danhal ini adalah tambahan keburukan setelah keburukan-kebirukan yang telah ada pada mereka, dimana mereka mengerjakan amalan-amalan penghuni neraka yang mengakibatkan hukuman dan mereka mengira bahwa amalan-amalan tersebut akan mengakibatkan surga, maka ambilah pelajaran Yahudi dan Nasrani dan semisal mereka dalam hal itu, karena sesungguhnya mereka itu adalah seperti yang Allah telah beritakan tentang mereka, \" Dan mereka (Yahudi dan Nasrani) berkata: “Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani”. Demikian itu (hanya) angan-angan mereka yang kosong belaka. Katakanlah: “Tunjukkanlah bukti kebenaranmu jika kamu adalah orang yang benar”.\" (Al-Baqarah:111), \" Demikianlah Kami jadikan setiap umat menganggap baik pekerjaan mereka.\" (Al-An’am:108), \" Katakanlah: “Apakah akan Kami beritahukan kepadamu tentang orang-orang yang paling merugi perbuatannya?” Yaitu orang-orang yang telah sia-sia perbuatannya dalam kehidupan dunia ini, sedangkan mereka menyangka bahwa mereka berbuat sebaik-baiknya.\" (Al-Kahfi:103-104). Dan Allh berfirman tentang orang-orang muafik yang berkata kepada orang-orang mukmin pada hari kiamat \" “Bukankah kami dahulu bersama-sama dengan kamu?” Mereka menjawab: “Benar, tetapi kamu mencelakakan dirimu sendiri dan menunggu (kehancuran kami) dan kamu ragu-ragu serta ditipu oleh angan-angan kosong sehingga datanglah ketetapan Allah; dan kamu telah ditipu terhadap Allah oleh (syaitan) yang amat penipu.\" (Al-Hadid:14). Dan firman Allah, “dan menyuruh mereka memotong telinga-telinga binatang ternak, lalu mereka benar-benar memotongnya,” yaitu dengan memotong telinganya, yang demikian itu seperti bahirah, sa’ibah, washilah, dan ham, Allah mengisyaratkan dengan sebagian hal itu bagi semuanya, hal yang demikian itu adalah bagian dari penyesatan yang mengakibatkan pengharaman apa yang di halalkan oleh Allah atau penghalalan apa yang diharamkan oleh Allah, dan hal itu di ikuti dengan keyakinan-keyakinan yang salah dan hukum hukum yang zhalim yang merupakan penyesatan yang paling besar. “Dan akan aku suruh mereka mengubah ciptaan Allah, lalu benar-benar mereka mengubahnya,” hal ini meliputi pengubahan penciptaan lahirriyah dengan Tatto, meruncingkan atau menajamkan gigi, mencabut alis, dan memberi celah pada gigi demi kecantikan dan semacamnya dari perkara-perkara yang menjadi sasaran setan demi memperdaya mereka, hingga mereka mengubah ciptaan Allah, yang demikian itu mengandung arti bahwa ia tidak puas dengan ciptaanya dan menuduh aib pada hikmahnya serta keyakinan bahwa yang mereka lakukan dengan tangan-tangan mereka itu lebih indah dari penciptaan Allah, mereka tidak ridha dengan aturanNya, dan hal itu juga mencakup perubahan penciptaan yang bersipat batin. Sesungguhnya Allah menciptakan makhluk dalam keadaan suci dan bernaluri untuk menerima kebenaran dan mendahulukannya hingga hadirlah setan kepada mereka lalu menggoda mereka untuk mengubah penciptaan yang indah itu, menghiasi bagi mereka keburukan , kesyirikan, kekufuran, kefasikan, dan lemak seitan dan sesungguhnya ank itu dilahirkan dalam keadaan fitrah dan suci, akan tetapi kedua orang tuanyalah yang menjadikannya sebagai Yahudi, Nasarani ataupun majusi dan semacamnya dari perubahan-perubahan akan apa yang di fitrahkan Allah kepada hama-hambanya berupa pengesaan Allah, kecintaan kepadaNya dan mengenalNya, namun kemudian dalam hal ini setan memangsa mereka seperti binatang buas dan serigala memang domba yang sendirian, dan sekiranya bukan kasih sayang Allah dan rahmatNya atas hamba-hambaNya yang ikhlas, niscaya akan terjadi pada merekaapa yang terjadi pada orang-orang yang terbujuk rayu setan, dan perkara yang terjadi pada mereka itu di sebabkan karena berpalingnya mereka dari Rabb dan pencipta mereka kepada musuh mereka yang menghendaki keburukan dari mereka dari segala bentuknya, hingga mereka merugi di dunia dan akhirat, dan kembali dengan kerugian dan kehampaan yang besar, karena itu Allah berfirman, “ Barang siapa yang menjadikan setan sebagai pelindung selain Allah, maka sesungguhnya ia menderita kerugian yang nyata,” kerugian apalagi yang paling nyata dan paling besar daripada seorang yang rugi agama dan dunianya, dicelakan oleh kesalahan dan kemaksiatannya hingga ia memperolah kesensaraan yang abadi dan hilang dari nya kenikmatan daarinya untuk selamanya? Sebagaimana juga orang yang mencintai Rabbnya, dan mendahulukan kerhidaaNya, niscaya ia akan sangat beruntung, dan sukses dengan gemilang serta menang dengan kebahagiaan di dua negeri, di dunia dan di akhirat, dan menjadi hamba yang bahagia. Maka tidaklah ada yang mamapu menahan apa yang engkau berikan dan tidak ada yang mampu memberikan apa yang engkau tahan, ya Allah, uruslah perkara kami sebagaimana engkau urus perkara oranbg-orang yang engkau cintai, dan berilah kami keafiatan sebagaimana engkau beri orang-orang keafiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 119: Dan sesungguhnya aku akan sesatkan mereka; dan sesungguhnya aku akan lalaikan mereka; dan sesungguhnya aku akan suruh mereka, hingga mereka akan belah kuping binatang-binatang ternak; dan sesungguhnya aku akan suruh mereka, hingga mereka akan mengubah bikinan Allah\". Dan barang- siapa menjadikan setan sebagai pemimpin selain dari Allah maka sesungguhnya rugilah ia, satu kerugian yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menaruh dalam hati mereka rasa lamanya hidup di dunia dan tidak adanya kebangkitan serta hisab. Ada pula yang menafsirkan, bahwa di samping menyesatkan manusia, dia juga akan menghias kesesatan itu, sehingga manusia mengira bahwa yang demikian merupakan kebaikan. Hal ini merupakan keburukan ditambah keburukan, mereka mengerjakan amalan penghuni neraka, namun mereka mengira bahwa amalan itu memasukkan ke surga sebagaimana yang menimpa orang-orang Yahudi dan Nasrani. Sebagaimana firman Allah Ta'ala, \"Dan mereka (Yahudi dan Nasrani) berkata: \"Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani\". Yang demikian (hanyalah) angan-angan mereka yang kosong belaka. \" (Terj. Al Baqarah: 111) Demikian pula seperti yang menimpa orang-orang munafik, \"Orang-orang munafik itu memanggil mereka (orang-orang mukmin) sambil berkata, \"Bukankah Kami dahulu bersama-sama dengan kamu?\" Mereka menjawab, \"Benar, tetapi kamu mencelakakan dirimu sendiri dan menunggu (kehancuran kami) dan kamu ragu- ragu serta ditipu oleh angan-angan kosong sehingga datanglah ketetapan Allah; dan kamu telah ditipu terhadap Allah oleh (setan) yang amat penipu.\" (Terj. Al Hadiid: 14) Menurut kepercayaan Arab jahiliyah, binatang-binatang yang akan dipersembahkan kepada patung-patung berhala, harus dipotong telinganya lebih dahulu, dan binatang yang seperti ini tidak boleh dikendarai dan tidak dipergunakan lagi, serta harus dilepaskan saja. Termasuk pula dalam hal ini unta Bahirah, Sa'ibad, Washilah dan Haam seperti yang disebutkan dalam Al Ma'idah ayat 103. Semua ini termasuk penyesatan setan, di mana yang demikian menghendaki mengharamkan apa yang Allah halalkan atau menghalalkan apa yang Allah haramkan. Termasuk pula kepercayaan-kepercayaan lain dan adat istiadat yang bertentangan dengan ajaran Islam, seperti pada adat-adat yang biasa dilakukan di daerah Jawa dan lainnya, mereka melakukan berbagai acara dengan adanya keyakinan-keyakinan tertentu. Misalnya memandikan keris, melempar sesaji ke tengah laut, dsb. di mana di dalamnya banyak kemusyrikan, wallahul musta'aan. Imam Thabari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas, bahwa ia membenci melakukan pengebirian, ia berkata, \"Tentang hal ini turunlah ayat, \"dan akan kusuruh mereka mengubah ciptaan Allah.\" (Hadits ini shahih sesuai syarat Muslim) Mengubah ciptaan Allah dapat berarti mengubah agama Allah dan menggantinya dengan kekafiran, menghalalkan apa yang diharamkan Allah dan mengharamkan apa yang dihalalkan-Nya. Ada pula yang menafsirkan dengan \"mengubah penampilan fisik\" untuk kecantikan, seperti melakukan tato, menipiskan gigi, mencabut alis, merenggangkan gigi dsb. hal itu, karena di dalamnya terdapat sikap tidak suka dengan ciptaan Allah, mengkritik kebijaksanaan-Nya, menganggap bahwa apa yang mereka buat dengan tangan mereka lebih baik daripada ciptaan Allah. Ada pula yang menafsirkan dengan \"Mengubah fitrah yang tertanam dalam jiwa manusia\", yakni karena Allah Subhaanahu wa Ta'aala menciptakan hamba-hamba-Nya dalam keadaan hanif (lurus), diciptakan dalam keadaan mau menerima yang hak dan lebih mengutamakannya, lalu setan pun datang dan menarik mereka dari akhlak yang mulia ini serta menghias keburukan, kesyrikkan, kekafiran, kefasikan dan kemaksiatan kepada mereka. Allah Subhaanahu wa Ta'aala menciptakan manusia di atas fitrah Islam, namun kedua orang tuanya yang mengubahnya menjadi Yahudi, Nasrani atau Majusi. Allah Subhaanahu wa Ta'aala menciptakan manusia di atas tauhid, rasa cinta dan mengenal-Nya, namun setan menyerang mereka bagaikan serigala yang yang menyerang kambing yang sedang sendiri. Kalau bukan karena kelembutan Allah dan kepemurahan-Nya kepada hamba-hamba-Nya yang ikhlas, tentu akan menimpa mereka sebagaimana yang menimpa orang-orang yang terfitnah lainnya karena berpaling dari Ar Rahman beralih mendekati setan yang terkutuk, dan barang siapa yang menjadikan setan sebagai walinya, maka sungguh ia telah menderita kerugian yang nyata. Kerugian manakah yang melebihi kerugian agama dan dunia serta dibinasakan hidupnya oleh maksiat dan dosa-dosa, di mana ia akan memperoleh kesengsaraan yang kekal dan hilangnya kenikmatan. Sebaliknya, barang siapa yang menjadikan Allah sebagai walinya dan lebih mengutamakan ridha-Nya, maka ia akan mendapatkan keberuntungan dan kebahagiaan di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 119",
    "description": "Dan pasti kusesatkan mereka dari jalan-Mu yang benar dan lurus, kapan pun dan di mana pun, dan akan kubangkitkan angan-angan kosong pada mereka sehingga mereka tidak dapat melakukan kebajikan-kebajikan dan akan kusuruh mereka memotong telinga-telinga binatang ternak lalu mereka benar-benar memotongnya, dan akan kusuruh mereka mengubah ciptaan Allah yang ada pada diri mereka, seperti fitrah keagaman dan keyakinan akan keesaan Allah yang sudah diikrarkan mereka pada waktu akan ditiupkan roh oleh Allah ke dalam diri mereka, dan mereka benar-benar mengubahnya, termasuk memperburuk wajah unta atau bentuk tubuhnya, padahal unta itu selama ini menjadi kendaraan mereka. Barangsiapa menjadikan setan sebagai pelindung selain Allah, maka sungguh, dia menderita kerugian yang nyata di dunia dan di akhayat ini menjelaskan kerugian yang dialami oleh mereka yang mengikuti setan. Setan itu memberikan janji-janji bohong semata tanpa bukti kepada mereka, dan ini semua akan membangkitkan angan-angan kosong pada mereka sehingga mereka menunda dan bahkan tidak dapat melakukan kebajikan-kebajikan. Padahal, janji-janji bohong dan anganangan kosong yang dijanjikan setan itu hanyalah tipuan belaka kepada mereka yang menyebabkan mereka sesat dari jalan Allah."
  }
]