[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagi kalian (kaum lelaki),setengah dari harta yang di tinggalkan oleh istri-istri kalian setelah mereka meninggal, jika mereka tidak mempunyai anak, baik anak lelaki atau perempuan. Jika istri-istri mempunyai anak, maka bagi kalian seperempat dari harta yang mereka tinggalkan. Kalian mendapatkan warisan itu sesudah dijalankannya wasiat mereka yang diperbolehkan oleh syariat atau pembayaran utang mereka kepada para pemiliknya. Dan bagi istri-istri kalian (wahai kaum laki-laki), seperempat dari harta yang kalian tinggalkan, jika kalian tidak mempunyai anak laki-laki atau perempuan dari istri-istri itu atau dari istri yang lain. Lalu apabila kalian memiliki anak lelaki atau perempuan,maka bagi istri-istri bagian seperdelapan dari harta yang kalian tinggalkan. Bagian seperdelapan atau seperempat ini di bagiakan rata kepada mereka. Apabila istri seorang saja,maka bagian itu menjadi hak warisnya sendirian, sesudah di penuhinya wasiat-wasiat yang kalian nyatakan, yang diperbolehkan oleh syariat atau pelunasan hutang yang menjadi tanggungan kalian. Dan apabila seseorang lelaki atau wanita meninggal,sedang dia tidak memiliki anak atau orang tua,namun memiliki saudara lelaki ataupun saudara perempuan seibu, maka masing-masing dari mereka berdua mendapatkan bagian seperenam. Apabila jumlah saudara lelaki atau perempuan seibunya berjumlah lebih dari satu, maka mereka bersekutu dalam bagian sebanyak sepertiga, yang dibagi rata diantara mereka, tanpa ada perbedaan antara lelaki dan perempuan. Aturan yang telah ditetapkan oleh Allah bagi saudara-saudara lelaki dan saudara-saudara perempuan seibu ini, mereka mengambilnya sebagai warisan bagi mereka sesudah di laksanakan wasiatnya bila ia telah mengeluarkan wasiat dengan sebagian harta dan dilunasinya utang-utang orang yang meninggal itu, yang tidak mengakibatkan mudarat terhadap ahli waris. Dengan aturan ini tuhan kalian memerintahkan kepada kalian pesan bermanfaat bagi kalian. Dan Allah maha mengetahui perkara-perkara yang akan memperbaiki keadaan makhluk-mahklukNYA, juga maha penyantun,tidak menyegerakan pada mereka dengan siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Dan kalian -wahai para suami- berhak mendapatkan setengah dari warisan yang ditinggalkan istri-istri kalian, jika mereka tidak mempunyai anak, laki-laki maupun perempuan, baik dari kalian maupun mantan suaminya yang lain. Apabila mereka (istri-istri kalian) mempunyai anak, laki-laki maupun perempuan, maka kalian mendapatkan seperempat dari harta (warisan) yang mereka tinggalkan. Warisan itu dibagikan kepada kalian setelah wasiat mereka dilaksanakan dan hutang mereka dibayarkan. Sedangkan para istri mendapatkan seperempat dari warisan yang kalian tinggalkan -wahai para suami- jika kalian tidak mempunyai anak, baik laki-laki maupun perempuan, baik dari mereka maupun dari istri yang lain. Jika kalian (para suami) mempunyai anak, laki-laki maupun perempuan, mereka (para istri) mendapatkan seperdelapan dari warisan yang kalian tinggalkan. Warisan itu dibagikan kepada mereka setelah wasiat kalian dilaksanakan dan hutang dilunasi. Apabila seorang laki-laki atau wanita meninggal dunia tanpa meninggalkan orangtua maupun anak, tetapi ia mempunyai saudara laki-laki seibu atau saudari perempuan seibu, maka masing-masing dari saudara laki-laki seibu atau saudari perempuan seibu itu mendapatkan seperenam sebagai bagian yang telah ditentukan. Apabila saudara laki-laki seibu atau saudari perempuan seibu itu lebih dari satu orang, maka mereka semua (bersama-sama) mendapatkan sepertiga sebagai bagian yang telah ditentukan. Mereka bersekutu dalam sepertiga bagian tersebut dengan hak yang sama tanpa membedakan laki-laki dan perempuan. Dan mereka mendapatkan bagian tersebut setelah wasiat si mayat dilaksanakan dan hutangnya lunas. Namun dengan syarat wasiatnya tidak merugikan ahli warisnya. Misalnya wasiat yang besarnya lebih dari sepertiga hartanya. Ketentuan hukum yang terkandung di dalam ayat ini adalah wasiat dari Allah yang diberikan dan diwajibkan kepada kalian. Dan Allah Maha Mengetahui apa yang baik bagi hamba-hamba-Nya di dunia dan Akhirat, dan Maha Penyantun, tidak tergesa-gesa menjatuhkan hukuman bagi pelaku maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah menyebutkan hak warisan bagi suami istri, saudara, dan kalalah: Bagi kalian hai para suami, setengah dari harta yang ditinggalkan istri-istri kalian jika mereka tidak memiliki anak. Jika mereka mimiliki anak dari kalian atau dari suami yang lain, maka bagi kalian seperempat dari harta yang mereka tinggalkan. Bagian ini dihitung setelah pembayaran hutang dan pelaksanaan wasiat yang sesuai syariat yang mereka tinggalkan. Dan bagi para istri, seperempat dari harta yang ditinggalkan para suami jika mereka tidak memiliki anak; namun jika mereka memiliki anak maka bagi istrinya -baik itu suami memiliki satu atau lebih istri- maka bagian mereka adalah seperdelapan. Bagian ini dihitung setelah pembayaran hutang dan pelaksanaan wasiat yang sesuai syariat yang mereka tinggalkan. Jika seorang laki-laki atau perempuan meninggal tanpa meninggalkan anak atau orangtua, sedangkan ia memiliki saudara atau saudari seibu, maka saudara atau saudari ini mendapatkan seperenam. Namun jika saudara atau saudarinya lebih dari satu maka mereka berserikat dalam bagian sepertiga. Bagian ini dihitung setelah pembayaran hutang dan pelaksanaan wasiat yang tidak merugikan para ahli waris, yaitu wasiat pemberian harta yang tidak melebihi sepertiga. Dengan perintah agung inilah Allah mewajibkan kalian kewajiban yang penuh hikmah. Allah Maha Mengetahui apa yang baik bagi hamba-hamba-Nya, dan Maha Lembut, sehingga tidak segera menimpakan azab bagi yang bermaksiat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَلَكُمْ نِصْفُ مَا تَرَكَ أَزْوٰجُكُمْ إِن لَّمْ يَكُن لَّهُنَّ وَلَدٌ ۚ (Dan bagimu (suami-suami) seperdua dari harta yang ditinggalkan oleh isteri-isterimu, jika mereka tidak mempunyai anak) Kalimat ini ditujukan untuk para suami. Maksud dari anak disini adalah anak laki-laki atau perempuan, atau anak dari anak laki-laki. Baik itu anak kandungnya atau dari suami sebelumnya. فَإِن كَانَ لَهُنَّ وَلَدٌ فَلَكُمُ الرُّبُعُ مِمَّا تَرَكْنَ ۚ( Jika isteri-isterimu itu mempunyai anak, maka kamu mendapat seperempat dari harta yang ditinggalkannya) Yakni bagian untuk suami apabila tidak ada anak adalah setengah dari harta waris, dan apabila ada anak dan keturunannya maka seperempat. وَلَهُنَّ الرُّبُعُ مِمَّا تَرَكْتُمْ إِن لَّمْ يَكُن لَّكُمْ وَلَدٌ ۚ (Para isteri memperoleh seperempat harta yang kamu tinggalkan jika kamu tidak mempunyai anak) Baik itu anak kandungnya maupun dari istri yang lain. Dan bagian untuk istri ini baik dengan adanya anak atau tidak hanya untuk dirinya apabila suaminya hanya mempunyai satu istri, namun untuk bersama apabila mempunyai lebih dari satu istri, dan masalah ini tidak ada perbedaan pendapat dikalangan para ulama. Adapun pembahasan tentang wasiat dan hutang maka sebagaimana telah disebutkan sebelumnya. وَإِن كَانَ رَجُلٌ يُورَثُ كَلٰلَةً (Jika seseorang laki-laki mati yang mewarisi kalalah) Kalalah adalah apabila si mayit tidak memiliki anak atau bapak ataupun kakek. Atau semua yang tidak mendapat warisan dengan cara ashobah seperti bapak, anak, dan kakek disebut oleh orang-orang arab dengan kalalah. Maka arti dari kalalah adalah orang yang diwarisi oleh saudara laki-laki, anak laki-laki, paman dari bapak, atau anak laki-laki paman dari bapak. أَوِ امْرَأَةٌ (maupun perempuan) Yakni perempuan yang mewarisi kalalah. وَلَهُۥٓ أَخٌ أَوْ أُخْتٌ (tetapi mempunyai seorang saudara laki-laki atau seorang saudara perempuan) Para ulama ber-ijma’ bahwa yang dimaksud dengan saudara disini adalah saudara seibu; adapun saudara sekandung dan seayah akan dijelaskan bagian warisan mereka di akhir surat ini. فَلِكُلِّ وٰحِدٍ مِّنْهُمَا السُّدُسُ ۚ( maka bagi masing-masing dari kedua jenis saudara itu seperenam harta) Baik itu laki-laki maupun perempuan apabila hanya seorang. فَإِن كَانُوٓا۟ أَكْثَرَ مِن ذٰلِكَ (Tetapi jika saudara-saudara seibu itu lebih dari seorang) Yakni lebih dari seorang baik itu yang laki-laki atau yang perempuan atau kedua-duanya. فَهُمْ شُرَكَآءُ فِى الثُّلُثِ ۚ (maka mereka bersekutu dalam yang sepertiga itu) Yakni dengan bagian yang setara antara laki-laki dan perempuan. أَوْ دَيْنٍ غَيْرَ مُضَآرٍّ ۚ( atau sesudah dibayar hutangnya dengan tidak memberi mudharat (kepada ahli waris)) Yakni hutang atau wasiat yang tidak mendatangkan mudharat bagi ahli waris dalam bentuk mudharat apapun, seperti dengan mengakui hutang yang sebenarnya tidak ia lakukan, atau dengan berwasiat yang hanya ditujukan untuk memberi mudharat bagi ahli waris, atau berwasiat untuk satu ahli waris dengan seluruh hartanya, atau berwasiat kepada orang lain melebihi sepertiga harta padahal para ahli waris tidak merelakannya; dan segala pengakuan terhadap hutang atau wasiat yang dimaksudkan untuk memberi mudharat pada ahli waris maka itu semua batal dan ditolak, dan tidak dilaksanakan baik itu sepertiga atau kurang dari itu. Ibnu Abbas mengatakan meniatkan berwasiat untuk memberi mudharat termasuk dosa besar. وَصِيَّةً مِّنَ اللهِ ۗ(wasiat (syari’at) yang benar-benar dari Allah) Maka semua wasiat yang menyelisihi wasiat Allah maka wasiat Allah-lah yang didahulukan karena wasiat-Nya lebih utama untuk diikuti dan yang selainnya harus ditinggalkan; dan itu seperti wasiat yang menangdung pilih kasih kepada sebagian ahli waris atau mengandung mudharat dari sisi tertentu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Ayat ini tentang warisan suami-istri, saudara, dan orang yang tidak punya anak dan orang tua. Wahai para suami, bagi kalian itu separuh harta warisan yang ditinggalkan oleh istri-istri kalian, jika kalian tidak memiliki anak baik laki-laki ataupun perempuan. Dan bagi kalian itu seperempat harta warisan itu jika dia punya anak dari kalian atau suami lainnya setelah hutangnya terlunasi dan wasiatnya ditunaikan. Dan bagi istri-istri itu seperempat harta warisan jika suaminya tidak mempunyai anak, namun jika punya anak maka baginya itu seperdelapan bagian, baik anaknya satu ataupun lebih banyak setelah hutangnya dilunasi, dan wasiatnya ditunaikan sebagaimana sebelumnya. Dan jika yang wafat adalah laki-laki atau wanita yang kalalah yaitu tidak punya orang tua dan anak, namun mempunyai saudara laki-laki atau perempuan dari ibunya saja, maka bagi masing-masing saudaranya itu seperenam harta warisan baik laik-laki maupun perempuan. Dan jika saudara-saudaranya itu lebihdari satu orang baik laki-laki ataupun perempuannya, maka bagi mereka itu sepertiga harta warisan yang takarannya sama antara laki-laki dan perempuan, setelah hutang dan wasiatnya ditunaikan, jika ada. Itu adalah wasiat Allah yang harus dilaksanakan agar pemberi warisan tidak memberi kemudharatan berupa hutang atau wasiat kepada ahli warisan, seperti menyerahkan hutang yang tidak seharusnya ditanggung atau wasiat yang lebih dari sepertiga jumlah warisan. Dan pemberian kemudharatan itu haram dan termasuk dosa-dosa besar. Dan Allah itu Maha Mengetahui sesuatu yang baik bagi ciptaan dan para ahli waris, dan Maha Bijaksana dengan tidak mempercepat hukumannya dan mengerti terhadap orang yang tidak tahu. Ibnu Abbas berkata: “Pemberian kemudharatan dalam wasiat itu termasuk dosa-dosa besar.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi kalian setengah dari harta yang ditinggalkan oleh istri-istri kalian, jika mereka tidak mempunyai anak} anak laki-laki atau perempuan, dari kalian atau dari selain kalian {Jika mereka mempunyai anak, maka bagi kalian seperempat dari harta yang ditinggalkannya setelah wasiat yang mereka buat atau (dilunasi) utangnya. Bagi mereka} para istri {seperempat harta yang kalian tinggalkan jika kalian tidak mempunyai anak. Jika kalian mempunyai anak, maka bagi mereka seperdelapan dari harta yang kalian tinggalkan setelah (dipenuhi) wasiat yang kalian buat atau (dilunasi) utangmu. Jika seseorang, baik laki-laki maupun perempuan yang memberi warisan tanpa mempunyai orang tua dan anak} orang yang tidak punya orang tua dan juga anak {tetapi mempunyai seorang saudara laki-laki atau seorang saudara perempuan, bagi masing-masing dari keduanya itu seperenam harta. Jika mereka lebih dari seorang, maka mereka bersama-sama mendapatkan sepertiga itu, setelah (dipenuhi) wasiat yang dibuatnya atau (dilunasi) utangnya dengan tidak menyusahkan} tanpa menyusahkan ahli waris dengan menambahkan bagian lebih dari sepertiga {Demikianlah ketentuan Allah. Allah Maha Mengetahui lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Kemudian Allah berfirman \"dan bagimu” wahai para suami, \"seperdua dari harta yang ditinggalkan oleh istri-istrimu, jika mereka tidak mempunyai anak. Jika istrimu itu mempunyai anak, maka kamu mendapat seperempat dari harta yang ditinggalkannya sesudah dipenuhi wasiat yang mereka buat atau (dan) sesudah dibayar hutangnya. (sebaliknya)para istri memperoleh seperempat harta yang kamu tinggalkan jika kamu tidak mempunyai anak. Jika kamu mempunyai anak maka para istri mendapatkan seperdelapan dari harta yang kamu tinggalkan sesudah dioeuhi wasiat dan telah dibayar hutang-hutangmu. ”termasuk dalam konteks anak yang disyaratkan adanya atau tidak adanya adalah anak mayit atau anak dari anak laki-laki mayit(cucu) laki-laki maupun perempuan, satu maupun banyak yang ada dari suami maupun dari selainnya. Dan tidak termasuk dalam hal ini anak dari anak perempuan mayit menurut ijma’ ulama. Kemudian Allah berfirman”jika seseorang mati, baik laki-laki maupun perempuan yang tidak meinggalkan ayah dan tidak meninggalkan anak, tetapi mempunyai seorang sauadar laki-laki (seibu saja) atau seorang sauadara perempuan (seibu saja),\" maksudnya, dari satu ibu sebagaimana dalam sebagian qira’at. Para ulama telah bersepakat bahwa maksud dari sauadara Di sini adalah saudara seibu. Apabila seorang mayit dalam kondisi kalalah, artinya, tidak meninggalkan anak dan tidak pula ayah, tidak kakek, tidak anak laki-laki, tidak cucu laki-laki dari anak laki-laki tidak pula anak perempuan, tidak pula cucu perempuan dari anak laki-laki dan seterusnya ke bawah. Inilah maksud kalalah sebagaimana yang ditafsirkan oleh abu bakar ash shidiq dan para ulama telah sepakat atas hal tersebut dan segala puji hanya milik Allah. ”Maka bagi masing-masing dari kedua jenis saudara itu,\" yaitu dari saudara laki-laki atau sauadara peremuan,\" seperenam harta. Tetapi jika saudara-saudara seibu itu lebih dari itu” yaitu lebih dari satu orang,\" maka mereka bersekutu dalam yang sepertiga itu. ”Maksudnya mereka tidak mendapatkan lebih dari sepertiga walaupun mereka lebih dari dua orang. Dan firman Allah, \"maka mereka bersekutu dalam yang sepertiga itu,\" menunjukkan bahwa laki-laki (dianatara) mereka sama dengan perempuan (dianatara) mereka, karena lafazh bersekutu itu menunjukkan persamaan. Lafazh \"kalalah” menunjukkan bahwa cabang (keturunan) dan seterusnya keatas menghalangi anak-anak ibu, karena Allah tidaklah menjadikan mereka ahli waris kecuali dalam kondisi kalalah, dan bila mereka tidak mewarisi secara kalalah, maka mereka tidaklah mendapatkan warisan sama sekali menurut kesepakatan ulama. Firman Allah \"maka mereka bersekutu dalam yang sepertiga itu” menunjukan bahwa saudara kandung laki-laki akan terhalang dalam kondisi yang bernama al-hamariyah, yaitu suami, ibu, saudara seibu dan saudara sekandung suami mendapatkan setengah, ibu seperenam, saudara seibu sepertiga, maka saudara sekandung gugur, karena Allah telah menyandarkan bagian sepertiga kepada saudara seibu. Sekiranya saudara sekandung bersekutu dengan mereka, niscaya itu merupakan penyatuan yang telah dipisahkan ketentuannya oleh Allah. Dan juga karena sesungguhnya saudara seibu adalah diantara pemilik hak-hak yang ditentukan sedang sauadara sekandung adalah ashabah (pemilik sisa warisan) dan sesungguhnya nabi bersabda, \"serahkan hak-hak warisan yang ditentukan kepada orang yang berhak, dan yang tersisa adalah milik kerabat laki-laki yang paling dekat. ” Pemilik hak-hak yang tertentu adalah mereka yang telah Allah tetapkan bagian-bagain mereka dalam kondisi seperti ini tidak ada yang tersisa setelah mereka hingga sauadara kandung gugur, dan inilah yang benar dalam hal ini Adapun warisan untuk saudara laki-laki dan saudara perempuan kandung atau seayah adalah tersebutkan dalam firmanNya, \"mereka meminta fatwa kepadamu (tentang kalalah). Katakanlah, Allah memberi fatwa kepadamu tentang kalalah,\" Seorang saudara kandng perempuan atau seayah berhak mendapat setengah, dan dua orang berhak mendapat dua pertiga. Seorang saudara perempuan sekandung bersama saudara perempuan se ayah atau lebih, mereka berhak mendapat setengah dan sisa dari dua pertiga adalah hak seorang saudara perempuan se ayah atau lebih, bagian itu adalah seperenam yang menyempurnakan sisa dari dua pertiga, apabila beberapa saudara perempuan sekandng menyempurnakan bagian dua pertiga, maka saudara perempuan se ayah menjadi gugur, sebagai mana yang telah berlalu pada anak perempuan dan cucu perempuan dari anak laki-laki dan apabila saudara itu laki-laki dan perempuan, maka ketentuannya adalah bagian laki-laki seperti bagian dua orang perempuan. Bila dikatakan apakah landasan hukum warisan seorang pembunuh, budak, lain agma, setengah budak, banci, kakek bersama saudara-saudara seibu, al aul, ar rad, sanak family, ashabah yang tersisa, saudara saudara perempuan selain ibu bersama beberapa anak perempuan atau cucu-cucu perempuan dari anak laki-laki diambil dari al quran atau tidak? Menurut suatu pendapat :ya, di dalamnya terdapat peringatan-peringatan dan indikasi-indikasi yang terperinci yang sangat sulit dipahami oleh orang yang tidak merenung tentangnya yang menunjukkan tentang segala yang disebutkan diatas. Tentang seorang pembunuh atau berlainan agama, diketahui secara umum bahwa mereka tidak termasuk ahli waris, hal itu dari penjelasan hikmah Allah dalam pembagian harta warisan terhadap para ahli waris menurut kedekatan mereka, manfaat mereka secara agama maupun dunia. Allah ta'ala telah mengisyaratkan akan hikmah tersebut dengan firmanNya, \"kamu tidak mengetahui siapa diantara mereka yang lebih dekat (banyak) manfaat bagimu.” Dan telah diketahui bahwa pelaku pembunuhan telah berusaha menjerumuskan orang yang akan diwarisinya kepada kemudharatan yang paling besar. Apaa yang menjadi dasar hak warisan itu tidaklah dapat dikuatkan untuk menolak bahayanya pembnuhan yang merupakan kebalikan dari manfaat yang merupakan akibat dari warisan itu. Maka dari hal itu dapat diketahui bahwa pembunuhan itu adalah penghalang terbesar yang menghalangi dari mendapatkan warisan dan memotong tali silaturahim dimana Allah berfirman tentangnya, \"orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat) didalam kitab Allah. ” Padahal telah ada kaidah syariat yang telah baku yang berbunyi; bahwa barangsiapa yang tergesa-gesa terhadap sesuatu sebelum waktunya, maka ia di hukum dengan tidak mendapatkannya. Karena itulah dan karena yang semacamnya dapat diketahui bhawa orang yang berlainan agama dengan orang yang akan diwarisi maka dia tidak mendapat warisan. yang demikian itu dikarenakan ia telah bertentangan dengan perkara yang harus ada yaitu bersambungnya garis keturunan yang mengharuskannya memperoleh warisan, dan penghalang yang berupa pertentangan pada agama yang mengakibatkan pemisah yang jelas dari segala sisi. penghalang yang besar telah menghalangi perkara yang mengharuskannya memperoleh warisan yaitu keturunan. Maka perkara yang mengakibatkan warisan itu tidak dapat di berlakukan karena adanya penghalang tadi. Hal itu, dapat dijelaskan bahwa Allah telah membuat hak-hak kaum muslimin lebih utama daripada hak-hak kekerabatan yang kafir didunia, maka apabila seorang muslim meninggal, niscaya hartanya akan berpindah kepada seseorang yang lebih utama dan lebih berhak, sehingga firman Allah menjadi, \"orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya, (daripada yang bukan kerabat) didalam kitab Allah”. apabila agama mereka sama, adapun bila saling berbeda maka persaudaraan seagama adalah yang didahulukan daripada persaudaraan sedarah semata. Ibnul al-qayyim berkata dalam jala’ al afham,\" renungkanlah makna ini dalam ayat warisan ini di mana Allah mengikat hubungan waris mewarisi ini di mana Allah mengikat hubungan waris mewarisi ini dengan lafazh \"istri” dan bukan perempuan sebagaimana firmanNya, \"dan bagimu (suami-suami) seperdua dari harta yang ditinggalkan oleh istri-istrimu,\" sebuah indikasi bahwa waris mewaris ini sesungguhnya terlaksana dengan perkawinan yang mengharuskan adanya saling berbaur dan saling berhubungan nasab, sedang seorang mukmin dan seorang kafir tidak ada persaudaraan (iman) diantara keduanya dan tidak pula saling bernasab, maka tidak ada saling mewarisi dianatara keduanya, dan rahasia kata-kata al-qur’an dan tata kalimatnya jauh melampaui akal seluruh alam”. Mengenai budak, ia tidak mewarisi dan tidak pula diwarisi, bahwa ia tidak diwarisi, itu sudah sangat jelas, karena ia tidak mempunyai harta yang dapat diwarisi, bahkan apa yang ada bersamanya itu adalah milik tuannya. Sedangkan mengenai ia tidak mewarisi karena ia tidak memiliki dan bisa saja ia memiliki, maka semuanya milik tuannya, maka ia adalah seorang yang ajnabi(bukan mahram) bagi mayit, maka ia seperti firman Allah, \"bagian seorang anak lelaki sama dengan bagian dua orang anak perempuan,\" dan \"dan bagimu (suami-suami) seperdua dari harta yang ditinggalkan oleh istri-istrimu,\" dan, \"maka bagi masing-msing dari kedua jenis saudara itu seperenam harta,\" dan semacamnya, terhadap orang-orang yang berpeluang memiliki. Sedangkan budak tidak berpeluang untuk itu, karena itu jelaslah bahwa ia tidak mendapatkan warisan. Mengenai seseorang yang setengah merdeka dan setengah budak, ia memilki hukum yang terbagi-bagi adapun yang pada dirinya ada kebebasan, maka dengan hal itu ia berhak mendapatkan apa yang telah Allah tetapkan dalam warisan, karena ada kemerdekaan pada dirinya yang berpeluang untuk memiliki. Dan apa yang ada padanya dari perbudakan maka ia tidak berpeluang untuk itu. Oleh karena itu seseorang yang setengah budak dan setengah merdeka, mereka mewarisi, diwarisi, dan menghalangi lainnya sesuai dengan kadar kemerdekaan yang ada padanya, dan apabila seorang hamba dapat terpuji dan tercela, diberi pahala dan dihukum menurut apa yang ada padanya dari hal-hal yang mengakibatkan perkara tersebut, maka ini pun demikian adanya. Tentang orang banci, tidak terlepas dari kondisinya itu dari tiga kemungkinan, yaitu sangat nyata kelakiannya, atau kewanitaannya, atau tidak jelas yang dominan. apabila nyata, perkaranya ada sudah jelas, apabila jantan, maka ia termasuk kedalam hukum yang laki-laki, dan akan tercakup kedalam nash-nash yang menerangkan tentang mereka. apabila dia musykil (tidak ada yang dominan anatara kedua jenis kelamin) tetapi antara pihak laki-laki dan perempuan tidak berbeda warisannya seperti saudara seibu, maka perkaranya juga jelas. adapun warisannya berbeda dengan kadar kelaki-lakiannya dan kadar keperemuannya, sedangkan kita belum punya cara untuk mengetahui hal itu, maka kita tidak memberikan kepadanya kadar yang paling terbesar dari keduanya, karena adanya kemungkinan berbuat zhalim terhadap ahli waris lain, dan kita juga tidak memberikannya kadar terkecil Karen takut menzhalimi dirinya, sehingga wajib ditegakkan pertengahan antara kedua perkara itu dan menempuh salah satu diantara dua jalan yang paling adil, Allah berfirman, \"berlaku adillah, karena adil itu lebih dekat kepada takwa,\" maka kita tidak memiliki jalan kepada keadilan dalam masalah ini yang lebih baik dari jalan tersebut, \"dan Allah tidak membebankan kepada suatu jiwa kecuali yang mampu diembannya\", \"maka bertakwalah kepada Allah sesuai dengan kemampuan kalian\". Adapaun warisan kakek bersama saudara laki-laki sekandung atau seayah, apakah kakek menjadi ikut ahli waris bersama mereka atau tidak? sesungguhnya kitabbullah telah menunjukkan pada apa yang dikatakan oleh abu bakar ash shidiq bahwasannya kakek menghalangi (bagian harta warisan) saudara laki-laki sekandung atau seayah, atau seibu sebagaimana ayah menghalangi mereka, dan penjelasan akan hal itu adalah bahwa kakek itu merupakan ayah seperti disebutkan dalam beberaa tempat dalam al-qur’an seperti firman Allah ”ketika yaqub kedatangan tanda tanda maut, ketika ia berkata kepada anak-anaknya, apa yang kamu sembah sepeninggalku? mereka menjawab kami akan menyembah rabbmu dan rabb nenek moyangmu, Ibrahim, ismail, dan ishaq” dan yusuf berkata \"dan aku mengikuti agam bapak-bapakku yaitu, Ibrahim, ishaq, dan ya’qub. ” Allah telah menamakan kakek dan kakeknya ayah dengan ayah, hal itu menunjukkan bahwa kakek adalah dalam posisi ayah, ia mewarisi apa yang diwarisi oleh ayah dan mengahalangi orang yang diahalangi oleh ayah Dan apabila para ulama telah sepakat, bahwa hukum kakek adalah hukum ayah ketika ayah tidak ada dalam harta peninggalan bersama anak-anaknya dan selain mereka dari beberpaa saudara, paman-paman dan anak-anak laki-laki mereka serta seluruh hukum-hukum warisan, maka seyogyanya hukum kakek juga adalah hukum ayah dalam menghalangi sauadara-saudara selain ibu. dan apabila anaknya ayah adalah sederajat dengan anaknya yang kandung, maka kenapa kakek tidak sederajat dengan posisi ayah? Dan apabila kakeknya ayah dengan anak laki-lakinya saudara laki-laki telah disepakati oleh para ulama bahwa ia menghalanginya, lalu kenapa kakeknya mayit tidak menghalangi sauadra si mayit?dan orang-orang yang berpendapat bahwa saudara mendapatkan harta waris bersama kakek tidak memilki nash, tidak juga isyarat ataupun indikasi apalagi qiyas yang shahih. Adapun masalah al-aul hukumnya diambil dari al-quran yang demikian itu adalah bahwa Allah telah mewajibkan dan menentukan bagian-bagian bagi seluruh ahli wais, dan mereka itu terbagi kepada dua kondisi kondisi sebagain mereka menghalangi sebagian yang lain, maka orang yang terhalang itu gugur tidak ikut menunggu bagian dan tidak berhak atas apapun, namun bila sebagain dari mereka tidak menghalangi sebagain yang lain, maka kondisi ini dalam beberapa bentuk pertama hak-hak tertentu itu tidak menghabiskan seluruh harta warisan, kedua, menghabiskannya dengan tanpa ada kekurangan dan kelebihan, ketiga hak-hak tertentu itu melebihi harta warisan. Maka pada kondisi yang pertama dan kedua, setiap ahli waris mendapatkan hak bagiannya secara sempurna, namun pada bentuk yang ketiga yaitu apabila hak-hak tertentu itu melebihi harta warisan, maka hal ini tidaknlepas dari dua kondisi pertama, mengurangi hak sebagian ahli waris dan hak-hak mereka yang telah ditentukan oleh Allah bagi mereka dan menyempurnakan hak bagi sebagian yang lain, hal ini adalah sebuah tindakan keberpihakan yang tidak ada dalil yang menguatkannya, dan bukanlah kekuarangan salah seorang ahli waris dari hak-haknya dalah lebih baik dari sebagian lainnya karena itu wajiblah tertuju kepada kondisi yang kedua yaitu kita memberikan setiap ahli waris dari mereka menurut keadaan yang memungkinkan dan kita bagi-bagikan seluruh harta warisan kepada ahli waris seperti hutang bagi pemilik-pemiliknya yang melebihi dari harta orang yang berhutang, dan tidak ada jalan lain untuk mencapai hal itu kecuali dengan cara al’aul, dengan demikian diketahuilah bahwa al’aul dalam ilmu faraidh telah dijelaskan oleh Allah dalam kitabNya. Dan dengan kebalikan dari cara diatas, maka diketahui cara ar rrad sesungguhnya pemilik hak-hak tertentu itu apabila tidak menghabiskan seluruh harta warisan menurut bagain bagian masing-masing, lalu terseisa dari harta warisan itu beberapa harta yang tidak ada pemiliknya berupa ashabah yang dekat maupun yang jauh, dan mengembalikan sisa harta itu kepada salah seorang ahli waris saja adalah suatu tindakan keberpihakkan yang tidak memiliki dalil, dan sebagaimana memberikan sisa harta itu kepada seseorang yang bukan sanak family adalah suatu tindakan kesewenang-wenangan, keberpihakan, dan bertentangan dengan firman Allah, \"orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya (daripada yang bukan kerabat) di dalam kitab Allah.” Maka pastilah sisa harta itu harus dikembalikan lagi kepada ahli waris menurut hak-hak tertentu mereka. Dan karena suami atau istri adalah bukan dari sanak family, maka mereka tidak berhak atas tambahan dari sisa harta itu menurut hak tertentu mereka, (menurut kelompok yang berpendapat bahwa tidak ada ar rrad bagi mereka berdua) adapun menurut pendapat yang shahih bahwa hukum suami dan istri adalah sama dengan hukum ahi waris yang lain dalam perkara ar-rrad maka dalil al-aul mencakup mereka semua. Dengan hal ini dapat diketahui juga bagian dari Dzawu al-arham (setiap kerabat mayit tidak mendapatkan hak tertentu ataupun ashabah) yaitu bila seorang mayit tidak meninggalkan ahli waris yang memilki hak tertentu dan tidak juga ashabah dan perkara hartanya berputar antara ditunjukkan kepada baitul mal untuk manfaat orang lain atau ditunjukan kepada sanak familinya yang telah disepakati yang lebih condong mendapat harta tersebut, maka yang terakhir ini adalah yang wajib dan hal tersebut dapat dimengerti dari firman Allah \"orang-orang yang mempunyai hubungan kerabat itu sebagiannya lebih berhak terhadap sesamanya( daripada yang bukan kerabat) di dalam kitab Allah” Memberikan harta tersebut kepada selain mereka adalah sebuah tindakan meninggalkan orang-orang yang lebih berhak dari selainnnya, maka dari itu, telah jelas wajibnya harta warisan tersebut diberikan untuk Dzawul al-arham, lalu apabila telah pasti pewarisan mereka, padahal telah diketahui bahwa mereka tidak memiliki bagian tertentu dalam kitabbullah, bahwa antara mereka dengan mayit ada penghubung hingga menjadikan mereka termasuk kedalam sanak familinya, maka mereka itu di posisisikan seperti orang-orang yang menjadi penghubung antara mereka dengan mayit. Adapun warisan bagi sisa ashabah yang tersisa seperti anak, saudara dan anak-anak mereka. paman-paman dan anak-anak mereka…dst. sesungguhnya nabi telah bersabda. ”serahkan hak-hak tertentu itu pada pemiliknya, dan apa yang tersisa ma ka milik kerabat laki-laki.” dan Allah berfirman ”bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat, kami jadikan pewaris-pewarisnya” Bila kita telah menyerahkan hak-hak tertentu itu kepada pemilik-pemiliknya dan tidak terdapat sisa sedikitpun, namun bila terdapat sisa, maka menjadi hak ashabah menurut posisi dan derajat mereka, karena sesungguhnya posisi ashabah itu ada lima anak, kemudian ayah lalu saudara dan anak-anak mereka, kemudian paman dan anak-anak mereka, lalu perwalian. dan yang didahulukan adalah yang paling terdekat posisinya, dan bila mereka pada satu posisi, maka yang paling dekat derajatnya dan apabila mereka dalam satu derajat, maka yang paling kuat yaitu sekandung, dan apabila mereka sama dari setiap hal, maka mereka bersekutu padanya. Sedangkan kondisi beberapa saudara perempuan selain seibu bersama anak-anak perempuan atau beberapa cucu perempuan dari anak laki-laki termasuk dalam ashabah, dimana saudara-saudara perempuan selain seibu tersebut berhak atas apa yang lebih dari hak-hak tertentu mereka, karena tidak ada satupun dalil dalam alquran yang menunjukkan bahwa sauadara perempuan itu gugur karena adanya anak perempuan, namun bila perkaranya memang demikian, lalu harta warisan setelah anak-anak perempuan itu mendapatkan hak tertentu mereka tersisa sedikit, maka sisa tersebut diberikan kepada saudara-sauadara perempuan dan tidak berpindah dari mereka kepada ashabah yang lebih jauh dari mereka seperti ank laki-laki dari saudara laki-laki atau paman dan orang-orang yang lebih jauh lagi dari mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﺃﺯﻭاﺟﻜﻢ} Azwajukum: Istri-istri kalian {ﻭﻟﺪ} walad: Anak. Anak yang dimaksud di sini adalah anak kandung (sedarah) baik putra maupun putri dan anak dari anak (cucu) juga termasuk. {اﻟﺮﺑﻊ} ar rubu’: satu per empat {ﻛﻼﻟﺔ1} kalalah: seorang yang meninggal dan tidak mempunyai seorang anak ataupun orang tua, maka yang menjadi ahli warisnya adalah saudara seibu. {ﻭﻟﻪ ﺃﺥ ﺃﻭ ﺃﺧﺖ2} wa lahu akhun au ukht: punya saudara atau saudari yakni seibu. {ﻏﻴﺮ ﻣﻀﺎﺭ} Ghairu mudhorr: “tidak membahayakan”, maksudnya adalah wasiat dan hutang tidak memudhorotkan para ahli waris {ﺣﻠﻴﻢ} halim: murah hati tidak menyegerakan hukuman terhadap maksiat. Makna Ayat: Ayat sebelumnya menjelaskan tentang pembagian warisan dari sisi nasab dan kemudian ayat ini menjelaskan pembagian warisan berdasarkan pernikahan. Dan ahli waris yang menerima karena sebab pernikahan adalah suami dan istri. Allah berfirman{ﻭﻟﻜﻢ ﻧﺼﻒ ﻣﺎ ﺗﺮﻙ ﺃﺯﻭاﺟﻜﻢ} “Dan bagi warisan kalian adalah setengah harta yang ditinggalkan istri-istri kalian.” Dan jikalau istri kalian meninggal dengan meninggalkan anak ataupun cucu, baik pria ataupun wanita, maka untuk suaminya adalah seperempat harta peninggalan sang istri. Hal ini berdasarkan firman Allah Ta’ala {ﻓﺈﻥ ﻛﺎﻥ ﻟﻬﻦ ﻭﻟﺪ ﻓﻠﻜﻢ اﻟﺮﺑﻊ ﻣﻤﺎ ﺗﺮﻛﻦ} “Jikalau para istri itu mempunya anak, maka bagi kalain seperempat dari yang ditinggalkannya.” Yang demikian itu adalah setelah dibayarkan utangnya, jikalau sang mendiang istri itu mempunyai hutang dan setelah menunaikan wasiat, jikalau mempunyai wasiat. Hal ini berdasarkan firman Allah {ﻣﻦ ﺑﻌﺪ ﻭﺻﻴﺔ ﻳﻮﺻﻴﻦﺑﻬﺎ ﺃﻭ ﺩﻳﻦ} “Setelah wasiat disampaikan atau hutang dibayar.” Ini adalah warisan dari suami. Adapun warisan untuk istri adalah seperempat jika sang suami tidak meninggalkan anak ataupun cucu baik laki-laki ataupun perempuan. Jikalau sang suami meninggalkan anak atau cucu, maka istri mendapatkan seperdelapan. Dan ini sesuai dengan firman Allah Ta’ala {ﻭﻟﻬﻦ اﻟﺮﺑﻊ ﻣﻤﺎ ﺗﺮﻛﺘﻢ ﺇﻥ ﻟﻢ ﻳﻜﻦ ﻟﻜﻢ ﻭﻟﺪ ﻓﺈﻥ ﻛﺎﻥ ﻟﻜﻢ ﻭﻟﺪ ﻓﻠﻬﻦ اﻟﺜﻤﻦ ﻣﻤﺎ ﺗﺮﻛﺘﻢ ﻣﻦ ﺑﻌﺪ ﻭﺻﻴﺔ ﺗﻮﺻﻮﻥ ﺑﻬﺎ ﺃﻭ ﺩﻳﻦ} Jikalau sang suami tidak mempunyai anak dan memiliki dua istri atau lebih, maka mereka berbagi dalam seperempat harta peninggalan si mayit dengan kadar yang sama. Dan apabila sang suami mempunya anak, maka para istri berbagi dalam seperdelapan harta si mayit dengan kadar yang sama. {ﻭﺇﻥ ﻛﺎﻥ ﺭﺟﻞ ﻳﻮﺭﺙ ﻛﻼﻟﺔ ﺃﻭ اﻣﺮﺃﺓ} “Dan jikalau seorang laki-laki atau perempuan mewariskan kepada kalalah” dan juga saat kalalah menjadi mewariskan juga. Pewarisnya adalah kalalah, kalalah adalah orang yang tidak memiliki anak ataupun orang tua. Kalalah hanya mewariskan ke saudara seibunya seperti yang disebutkan di dalam ayat ini atau juga kalalah mewariskan ke saudara seayah dan seibunya, seperti yang disebutkan dalam ayat terakhir dari surat ini. Jikalau seorang kalalah mempunyai saudara seibu, maka bagi saudaranya itu adalah seperenam. Begitu juga kalau mempunyai saudari seibupun, maka bagi saudarinya ini seperenam. Jikalau sudara kalalah ini berjumlah dua atau lebih, maka bagi mereka adalah sepertiga bagian. Allah berfirman {ﻭﺇﻥ ﻛﺎﻥ ﺭﺟﻞ ﻳﻮﺭﺙ ﻛﻼﻟﺔ ﺃﻭ اﻣﺮﺃﺓ ﻭﻟﻪ ﺃﺥ ﺃﻭ ﺃﺧﺖ ﻓﻠﻜﻞ ﻭاﺣﺪ ﻣﻨﻬﻤﺎ اﻟﺴﺪﺱ ﻓﺈﻥ ﻛﺎﻧﻮا ﺃﻛﺜﺮ ﻣﻦ ﺫﻟﻚ ﻓﻬﻢ ﺷﺮﻛﺎء ﻓﻲ اﻟﺜﻠﺚ ﻣﻦ ﺑﻌﺪ2 ﻭﺻﻴﺔ ﻳﻮﺻﻰ ﺑﻬﺎ ﺃﻭ ﺩﻳﻦ ﻏﻴﺮ ﻣﻀﺎﺭ3} “Jikalau pria atau wanita mewariskan kepada seorang kalalah dan dia memiliki seorang saudara atau saudari, maka baginya adalah seperenam. Jikalau saudaranya lebih dari satu, maka para saudaranya itu bersekutu dalam bagian sepertiga setelah pembagian wasiat atau pembayaran hutang dan maka tiada yang merugi dengan pembagian ini.”dengan memberikan wasiat lebih banyak dari sepertiga atau mengaku mempunyai hutang sementara sang mayit tidak mempunyai hutang dikarenakan ada hasad atau dendam kepada para ahli waris. Apabila terbukti bahwasanya kecurangan itu terjadi, maka wasiat tidak perlu untuk ditunaikan dan hutang tidak perlu untuk dilunasi. Allah berfirman, {ﻭﺻﻴﺔ ﻣﻦ اﻟﻠﻪ} “wasiat dari Allah” maksudnya adalah Allah mewasiatkan perihal ini, wahai kaum mukminin, sesungguhnya wasiat ini sangat layak untuk diagungkan dan diamalkan. Allah Maha Mengetahui niat-keadaan kalian, maslahat-madarat kalian, maka serahkan metode pembagiannya kepada Allah dan taatilah itu. Allah Maha Bijaksana tidak menyegerakan hukuman-Nya. Maka janganlah terpedaya kebijaksanaan-Nya karena siksanya amatlah pedih. Pelajaran dari ayat : • Petunjuk pembagian warisan suami untuk istri-istrinya dan kaum istri untuk suaminya. • Petunjuk pembagian warisan kalalah. Kalalah adalah orang yang tidak memiliki orang tua dan anak, maka ahli warisnya adalah para saudaranya (seibu atau seayah-seibu) saja. Dia dilingkupi dengan lingkupan iklil الإكيل (mahkota) di kepalanya, oleh karenanya dinamakan dengan كلالة kalalah. • Dibatalkannya wasiat atau hutang, jikalau dilandasi dengan niatan hanya untuk merugikan para ahli waris saja. • Keagungan ihwal warisan, maka wajib untuk memahaminya dan menjalankannya seperti yang telah diwasiatkan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 12: Yang ditinggalkan oleh isteri-isteri kamu, jika mereka tidak mempunyai anak. Tetapi jika mereka ada mempunyai anak, maka kamu dapat seperempat dari yang mereka tinggalkan, sesudah (diselesaikan) wasiat yang mereka wasiatkan atau hutang; dan isteri-isteri itu dapat seperempat dari yang kamu tinggalkan, jika kamu tidak mempunyai anak. Tetapi jika kamu ada mempunyai anak, maka mereka dapat seperdelapan dari yang kamu tinggalkan sesudah (diselesaikan) wasiat yang kamu wasiatkan atau hutang; dan jika adalah seseorang laki-laki atau perempuan yang di- warisi itu tidak mempunyai ibu- bapa dan anak, tetapi ada mempunyai saudara laki-laki atau dara perempuan, maka tiap-tiap seorang dari padanya dapat seperenam. Tetapi jika mereka lebih dari itu, maka mereka bersekutu pada sepertiga itu, sesudah (diselesaikan) wasiat yang diwasiatkannya atau hutang, padahal (wasiat itu) tidak menyusah kan (ahli waris), sebagai satu ketetapan dari Allah, karena Allah itu Pengetahui, Penyabar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni anak kandung atau anak dari anak laki-laki, baik laki-laki maupun perempuan, seorang atau lebih, baik lahir dari suami atau dari laki-laki lain. Namun tidak mengurangi jatah suami (1/2) atau istri (1/4) anak dari puterinya berdasarkan ijma'. Dan kakek dst. ke atas . Anak laki-laki, cucu laki-laki dari anak laki-laki, anak perempuan dan cucu perempuan dari anak laki-laki dst. ke bawah. Ahli waris yang tidak meninggalkan bapak/kakek dan anak/cucu disebut dengan kalalah. Berdasarkan ayat ini, maka bapak/kakek dan anak/cucu ketika ada menghalangi saudara/i seibu mendapatkan bagian 1/6 atau 1/3. Yakni mereka tidak lebih dari 1/3 meskipun jumlahnya lebih dari dua. Ayat ini juga menunjukkan bahwa yang laki-laki dan yang wanitanya mendapatkan bagian yang sama, karena lafaz \"syurakaa\" di ayat tersebut menunjukkan sama. Kata-kata \"Fahum syurakaa' fits tsuluts\" menunjukkan bahwa saudara sekandung menjadi gugur (tidak mendapat warisan) dalam masalah yang biasa disebut sebagai masalah Himaariyyah (dinamakan himariyyah menurut riwayat adalah karena dalam kasus seperti ini, seorang hakim pernah memutuskan bahwa saudara sekandung tidak mendapatkan bagian, sehingga yang tidak mendapatkan bagian ini berkata, \"Katakanlah ayah kami himar (keledai) atau batu yang dicampakkan ke laut, namun bukankah ibu kami satu? Mengapa saudara seibu dapat pusaka, padahal kami juga seibu dengan mereka, tetapi mengapa tidak dapat?\") ,yaitu ketika si mati meninggalkan suami, ibu, saudara/i seibu dan saudara kandung. Suami mendapatkan 1/2, ibu mendapatkan 1/6, saudara/i seibu mendapatkan 1/3, sedangkan saudara-saudara sekandung gugur (karena harta habis). Hal itu, karena Allah menyandarkan 1/3 kepada saudara/i seibu, jika sekiranya saudara-saudara sekandung ikut mengambil bagian, tentu hal ini sama saja menyatukan masalah yang Allah memisahkannya. Di samping itu, saudara/i seibu tergolong as-habul furudh (orang-orang yang berhak mendapat bagian tertentu), sedangkan saudara sekandung tergolong 'ashabah. Nabi shallallahu 'alaihi wa sallam bersabda, \"\"Berikanlah bagian ashabul furudh, sisanya untuk laki-laki yang terdekat.\" (lafaznya sudah disebutkan sebelumnya). Dalam masalah himariyyah ini, tidak ada sisa, karena bagiannya telah habis diambil oleh as-habul furudh sehingga saudara sekandung tidak mendapatkannya (gugur). Adapun bagian saudara/i sekandung atau sebapak, maka sudah disebutkan di akhir surat An Nisaa', \"Yastaftuunaka fil kalaalah…dst.\" Berdasarkan ayat tersebut seorang saudari sekandung atau sebapak mendapatkan 1/2, jika ada dua maka mendapatkan 2/3 (yakni ketika tidak ada anak/cucu, ayah/kakek dan tidak ada saudara sekandung atau sebapak). Namun seorang saudari sekandung jika bersama seorang saudari sebapak atau beberapa orang saudari sebapak mengambil 1/2, sedangkan sisanya dari 2/3 yaitu 1/6 untuk seorang saudari atau beberapa orang saudari sebapak menyempurnakan 2/3. Contoh: seorang wafat meninggalkan saudari sekandung, saudari seayah dan paman sekandung, maka saudari sekandung mendapatkan ½, saudari seayah mendapatkan 1/6 menyempurnakan 2/3 dan sisanya untuk paman. Saudari kandung mewarisi sebagai ‘ashabah ma’al ghair apabila si mati meninggalkan wanita yang termasuk far’ (anak, cucu, dst. ke bawah) yang mendapatkan warisan sebagai as-habul furuudh, sehingga saudari kandung menduduki saudara sekandung. Contoh saudari kandung mewarisi sebagai ‘ashabah ma’al ghair adalah seorang wafat meninggalkan puterinya, puteri anaknya yang laki-laki, saudari sekandung dan saudara seayah, maka untuk puteri adalah ½, untuk puteri dari anaknya yang laki-laki adalah 1/6 untuk menyempurnakan 2/3, saudari kandung mendapatkan sisanya, sedangkan saudara seayah tidak mendapatkan apa-apa. Jika beberapa orang-orang saudari sekandung menghabiskan 2/3, maka saudari-saudari sebapak gugur (tidak mendapatkan apa-apa) kecuali jika bersama mereka saudara sebapak yang berada sama dengan derajat mereka, maka mereka di'ashabahkan, sehingga sisanya untuk laki-laki dua orang bagian perempuan. Contoh: si mati meninggalkan dua orang saudari sekandung, saudari-saudari seayah dan seorang saudara seayah, maka dua orang saudari sekandung itu mendapat 2/3, dan sisanya dibagi antara saudara-saudara perempuan seayah dan saudara laki-laki seayah dengan pembagian bagian laki-laki dua kali bagian perempuan. Jika beberapa orang saudara itu terdiri dari laki-laki dan perempuan (yakni jika bersama saudari kandung ada saudara laki-laki sekandung), maka saudari kandung menempati posisi 'ashabah bil ghair, sehingga bagiannya adalah seorang saudara laki-laki adalah dua bagian perempuan. Wallahu a'lam bish shawab. Kesimpulan Kesimpulan As-habul Furuudh As-habul Furuudh dari pihak laki-laki No. Nama As-habul Furuudh Fardh Syarat 1. Ayah 1/6 Jika bersama far’/keturunan yang laki-laki (anak laki-laki atau cucu laki-laki dari anak laki-laki) 1/6 dan ‘ashabah Jika bersama anak perempuan atau cucu perempuan dari anak laki-laki ‘Ashabah Jika tidak ada far’/keturunan laki-laki atau perempuan (anak/cucu dari anak laki-laki) 2. Suami ¼ Jika bersama anak atau cucu dari anak laki-laki, baik laki-laki maupun perempuan. Jika far'nya bukan termasuk ahli waris seperti puteri dari puteri, maka ia tidaklah mengurangi bagian suami atau isteri. ½ Jika tidak ada anak atau cucu, baik laki-laki maupun perempuan, baik dari dirinya maupun suami lain 3. Kakek shahih (ayahnya ayah dst. ke atas) 1/6 Jika ada anak/cucu laki-laki 1/6 + sisa Jika ada seorang anak perempuan/cucu perempuan, dan tidak ada anak/cucu laki-laki ‘Ashabah Jika tidak ada ayah dan keturunan (anak/cucu) Tertutup Jika ada ayah 4. Bagian saudara seibu (lain bapak) 1/6 Jika sendiri, dan tidak ada anak/cucu/ayah/kakek 1/3 Jika dua orang atau lebih, dan tidak ada anak/cucu/ayah/kakek Tertutup (mahjub) Jika ada anak/cucu/ayah/kakek As-habul Furuudh dari pihak perempuan No. Nama As-habul furuudh Fardh Syarat 1. Isteri Jika isteri lebih dari satu, maka mereka membagi rata dari 1/4 atau 1/8.] 1/4 Jika tidak ada anak atau cucu dari anak laki-laki, baik dari dirinya maupun isteri lain 1/8 Jika bersama anak atau cucu dari anak laki-laki 2. Ibu 1/3 Jika tidak ada anak atau cucu dari anak laki-laki dan sejumlah (lebih dari satu) orang saudara 1/6 - Jika bersama anak atau cucu dari anak laki-laki, atau - Sejumlah (lebih dari satu) saudara, baik pria maupun wanita Baik mereka laki-laki saja, atau laki-laki bersama wanita atau wanita saja, juga sama saja baik sekandung, seayah atau seibu.] 1/3 dari sisa harta peninggalan Jika bersama ayah dan suami atau isteri 3. Nenek 1/6 (baik sendiri maupun banyak) Jika tidak ada ibu. Tetutup Jika ada ibu atau nenek yang lebih dekat kepada si mati. 4. Anak perempuan 1/2 Jika seorang diri dan tidak ada anak laki-laki 2/3 Jika dua orang atau lebih dan tidak ada anak laki-laki ‘Ashabah Jika bersama anak laki-laki, yakni bagian seorang laki-laki dua bagian wanita 5. Cucu perempuan dari anak laki-laki 1/2 Jika seorang diri dan tidak ada anak laki-laki atau anak perempuan 2/3 (dibagi rata) Jika dua orang atau lebih dan tidak ada anak/cucu laki-laki 1/6 Jika bersama seorang anak perempuan (tidak meninggalkan anak laki-laki atau cucu laki-laki) menyempurnakan 2/3 ‘Ashabah Jika bersama dengan cucu laki-laki Tertutup - Jika ada anak laki-laki, - Jika ada dua puteri atau lebih, kecuali jika bersama mereka ada cucu laki-laki dari anak laki-laki yang sederajat atau di bawah mereka sehingga mereka menjadi 'ashabah 6. Saudari kandung 1/2 Jika seorang diri dan tidak ada anak/cucu, ayah/kakek dan tidak ada saudara sekandung 2/3 Jika 2 orang atau lebih dan tidak ada anak/cucu, ayah/kakek dan tidak ada saudara sekandung ‘Ashabah bil ghair Jika bersama saudara laki-laki sekandung dan tidak ada orang-orang di atas, bagian seorang laki-laki adalah dua bagian perempuan. ‘Ashabah ma’al ghair Jika bersama anak perempuan/cucu perempuan dari anak laki-laki, ia mengambil sisanya setelah anak perempuan atau cucu perempuan mengambil bagian sebagai as-habul furudh Tertutup Ketika ada ahli waris far' yang laki-laki seperti anak/cucu dan ketika ada ahli waris ushul seperti bapak, adapun oleh kakek masih ada khilaf 7. Saudari seayah 1/2 Jika sendiri dan tidak ada anak atau cucu, saudara sebapak, saudari sekandung dan ayah/kakek. 2/3 Jika ada 2 orang atau lebih dan tidak ada anak atau cucu, saudara dan ayah/kakek. 1/6 Jika bersama-sama dengan seorang saudari kandung, tanpa saudara laki-laki. ‘Ashabah bighairih Jika ada saudara laki-laki sebapak, seorang laki-laki mendapatkan dua bagian perempuan. ‘Ashabah ma’a ghairih Jika bersama dengan anak perempuan atau cucu perempuan, ia mengambil sisanya setelah anak perempuan atau cucu perempuan mengambil bagian sebagai as-habul furudh. 8. Saudari seibu (lain bapak) 1/6 Jika sendiri, dan tidak ada anak/cucu/ayah/kakek 1/3 Jika dua orang atau lebih, dan tidak ada anak/cucu/ayah/kakek Tetutup Jika ada anak/cucu/ayah/kakek Faedah: Jika ada pertanyaan, \"Apakah hukum warisan pembunuh, budak, orang yang berbeda agama, muba'adh (budak yang separuh dirinya merdeka), khunta (banci), kakek bersama saudara-saudara bukan seibu, 'aul, radd, dzawul arham, 'ashabah lainnya, saudari-saudari tidak seibu beserta anak perempuan atau puteri dari anak laki-laki bisa diambil dari Al Qur'an?\" Jawab: \"Ya, di dalam Al Qur'an terdapat isyarat yang halus yang memang agak sulit dipahami bagi orang yang kurang cermat. Tetapi di sana ada yang menunjukkan demikian. - Tentang pembunuh dan orang yang berlainan agama, keduanya tidak mendapatkan warisan berdasarkan penjelasan hikmah ilahi yang membagikan harta kepada ahli waris sesuai kedekatan mereka dan manfaat bagi mereka baik manfaat agama maupun dunia. Hikmah ini diisyaratkan oleh firman Allah, \"Laa tadruuna ayyuhum aqrabu lakum naf'aa\" (kamu tidak mengetahui siapa di antara mereka yang lebih banyak manfaatnya bagimu). Kita mengetaui bahwa seorang pembunuh berusaha menimpakan bahaya, sehingga tidak ada dalam dirinya sesuatu yang mendorong untuk diberi warisan, di samping itu, dalam pembunuhan memutuskan tali silaturrahim, dan lagi ada kaidah \"Manis ta'jala qabla awaanihi 'uuqiba bihirmaanih\" (Barang siapa yang terburu-buru sebelum tiba waktunya, maka ia diberi hukuman dengan tidak memperolehnya). Adapun tentang berlainan agama, Ibnul Qayyim berkata dalam Jalaa'ul Afhaam, \"Perhatikanlah makna ini dalam ayat tentang warisan dan pengkaitan dari Allah Subhaanahu wa Ta'aala terhadap waris-mewarisi dengan lafaz zaujah (istri), tidak dengan lafaz mar'ah (wanita) sebagaimana dalam firman Allah Ta'ala, \"Wa lakum nishfu maa taraka azwaajukum\" (untuk kamu separuh dari harta yang ditinggalkan istri-istrimu) sebagai pemberitahuan bahwa waris-mewarisi hanyalah terjadi jika terjalin hubungan pernikahan yang menghendaki kesamaan dan keserasian. Orang mukmin dan orang kafir tidaklah sama dan tidak serasi, sehingga tidak mungkin terjadi antara keduanya saling waris-mewarisi. Rahasia satuan kata dalam Al Qur'an dan gabungannya dengan kata yang lain memang berada di atas akal seluruh makhluk.\" - Adapun budak, maka ia tidaklah mewarisi dan tidak pula diwarisi. Keadaannya tidak diwarisi adalah jelas, karena memang ia tidak memiliki harta untuk diwarisi, bahkan apa yang ada padanya semuanya untuk tuannya. Adapun keadaannya tidak mewarisi adalah karena ia tidak memiliki, kalau pun memiliki, maka itu untuk tuannya. Dengan demikian, budak adalah orang ajnabiy (asing) bagi si mati. Ayat \"Wa lakum nishfu maa taraka azwaajukum\" (dan untuk kamu separuh dari hharta yang ditinggalkan istrimu) diperuntukkan bagi orang yang siap memiliki, adapun budak tidak demikian. Dari sini diketahui, bahwa budak tidak mewarisi. - Adapun orang yang dalam dirinya terdapat separuh budak dan separuh merdeka (muba'adh), maka hukumnya terbagi dua. Bagian dirinya yang merdeka berhak mendapatkan warisan, sedangkan bagiannya yang masih budak, tidak mendapatkan warisan. Dengan demikian, hartanya dibagi dua, ia mewarisi dan diwarisi, namun dihalangi sesuai kebudakan yang ada dalam dirinya. - Adapun khuntsa (banci), maka tidak lepas dari kemungkinan diketahui apakah ia laki-laki atau wanita atau kemungkinan musykjil (samar). Jika diketahui laki-laki atau perempuan, maka masalahnya beres, namun jika musykil (misalnya memiliki kelamin ganda), maka jika bagian warisannya tidak berubah baik ia sebagai laki-laki atau perempuan –seperti halnya saudara seibu-, maka masalahnya jelas. Namun jika bagiannya berbeda jika ditentukan sebagai laki-laki atau perempuan, di antara ulama ada yang berpendapat dengan memperhatikan dari mana air kencingnya keluar. Jika tidak bisa, maka dengan memperhatikan tanda kedewasaannya (tanda bagi laki-laki misalnya tumbuh janggut dan kumis, suara besar dsb. sedangkan tanda bagi perempuan misalnya tumbuh buah dada, haidh, hamil, dsb.), namun jika tidak berhasil juga dan tidak ada cara untuk mengetahuinya, maka kita tidak memberikannya bagian yang terbesar dari dua kemungkinan (laki-laki atau perempuan) dan tidak memberikan sedikit, bahkan sisanya ditunda sampai keadaannya jelas. Atau jika terus menerus tidak jelas, maka dengan jalan tengah, yakni memberikan bagian pertengahan di antara dua kemungkinan, berdasarkan ayat, \"I'diluu huwa aqrabu lit taqwa\" (berbuat adillah, karena ia lebih dekat kepada takwa), dan Allah tidak membebani kecuali sesuai dengan kesanggupan kita. - Adapun bagian kakek bersama bersama beberapa saudara sekandung atau sebapak, yakni apakah saudara tersebut mewarisi bersamanya atau tidak, maka Al Qur'an lebih menunjukkan kepada pendapat Abu Bakar Ash Shiddiq, yakni bahwa kakek menghalangi saudara sekandung atau sebapak atau pun saudara seibu sebagaimana bapak menghalangi mereka. Hal ini, karena kakek dianggap sebagai bapak dalam beberapa ayat Al Qur'an, seperti di surat Al Baqarah: 133 dan surat Yusuf ayat 38. Jika cucu saja dianggap sebagai anak, maka kakek pun sama dianggap bapak. Para ulama juga sepakat bahwa jika kakek bagi bapak bersama putera dari saudara, maka kakek menghalangi putera dari saudara tersebut. - Adapun tentang 'aul, maka hukumnya juga diambil dari Al Qur'an, yaitu karena Allah Ta'ala juga menetapkan untuk para ahli waris bagiannya, dan mereka itu berada di antara dua kemungkinan: a. Bisa berupa saling menghalangi antara satu dengan yang lain. Jika seperti ini, maka yang dihalangi gugur, tidak dapat mendesak dan memperoleh apa-apa. b. Namun jika tidak menghalangi satu sama lain, maka bisa berupa orang-orang yang mendapat bagian tertentu tidak menghabisi tarikah (harta peninggalan) dan masih ada sisa untuk 'ashabah, atau menghabisi tanpa ditambah dan dikurang atau bagiannya dinaikkan terhadap tarikah. Dalam dua keadaan yang pertama, masing-masing mengambil jatahnya secara sempurna, sedangkan untuk keadaan yang terakhir, yakni ketika bagiannya terhadap tarikah dinaikkan, maka keadaan ini pun tidak lepas dari dua keadaan: - Kita mengurangi bagian sebagian ahli waris dan kita sempurnakan yang lain bagiannya, namun hal ini tidak tepat, karena sebagian mereka tidak lebih berhak daripada yang lain. Atau, - Kita berikan bagian masing-masing semampunya, yaitu menaikkan bagian atau fardhnya. Contoh: harta peninggalan si mati senilai 840.000,00, ahli waris terdiri dari suami, saudari kandung dan saudari seibu, maka: Ahli waris Fardh AM = 6 (KPK dari 2,2 & 6) Suami ½ x 6 3 Saudari kandung ½ x 6 3 Saudari seibu 1/6 x 6 1 Anda dapat melihat jumlah 3 + 3 + 1 = 7 melebihi asal masalah, maka cara pembagiannya tidak 3/6, 3/6 dan 1/6, tetapi menjadi 3/7, 3/7 dan 1/7. dengan ini selesailah masalahnya: 3/7 x 84.000 = 36.000 3/7 x 84.000 = 36.000 1/7 x 84.000 = 12.000 Lihat! 36.000 + 36.000 + 12.000 = 84.000 Habis bukan harta tersebut dan dapat dibagi secara adil. Inilah yang disebut dengan ‘Aul. Jika tidak di’aul tentu masih ada sisa. Kebalikan dari 'aul adalah radd, yakni ketika orang yang mendapat bagian tertentu tidak menghabisi tarikah, dan masih ada sisa, di samping itu tidak ada 'ashabah yang dekat maupun jauh. Jika sisa tersebut diberikan kepada yang bukan kerabat si mati, maka hal tersebut merupakan kezaliman serta bertentang dengan ayat \"Wa ulul arhaami ba'dhuhum awlaa biba'dhin fii kitaabillah\" (surat Al Anfal: 75), maka tidak ada jalan lain selain mengembalikan kepada pemilik bagian (as-habul furudh). Kebanyakan ulama yang memegang radd berpendapat bahwa suami atau istri tidak berhak mendapatkan radd, namun yang lain berpendapat bahwa suami atau istri juga berhak mendapatkan radd. Contoh radd: Contoh: Harta peninggalan Rp. 36.000,00 , ahli waris: saudari sekandung, saudari seayah dan ibu. Maka: Ahli waris Fardh AM = 6 menjadi 5 Dari 36.000,00 Saudari kandung ½ 3/5 x 36.000 21.600 Saudari seayah 1/6 1/5 x 36.000 7.200 Ibu 1/6 1/5 x 36.000 7.200 Menjadi 5, karena jumlah 3 + 1 + 1 = 5. - Dari sini diketahui pula masalah Dzawul arham, yakni ketika si mati tidak meninggalkan as-habul furudh, demikian pula tidak meninggalkan 'ashabah, maka harta itu bisa diserahkan kepada Baitul Maal untuk manfaat orang lain atau diberikan kepada kerabat yang disebut dzawul arham. Hal ini berdasarkan ayat, \"Wa ulul arhaam ba'dhuhum awlaa biba'dhin…dst.\" Oleh karenanya memberikan kepada orang lain padahal masih ada yang lebih dekat kepada si mati (yaitu Dzawul arham) sama saja memberikan kepada orang yang kurang berhak. Karena pembagian mereka tidak ada ketentuannya dalam kitab Allah, namun antara mereka dengan si mati ada perantara yang karenanya mereka tergolong kerabat, maka diposisikanlah mereka sesuai perantara yang menjadi perantara kepada si mati, inilah yang disebut dengan tanzil. Misalnya bibi dari pihak ayah dianggap sebagai pengganti ayah. Ia mewarisi sesuai bagian yang didapatkan ayah. Demikian pula bibi dari pihak ibu, ia mewarisi bagian ibu, dan diperlakukan layaknya ibu dalam warisan. - Adapun tentang warisan 'ashabah, seperti bunuwwah (anak), ubuwwah (bapak), ukhuwwah (saudara dan anak-anaknya) dan umumah (paman dan anak-anaknya), maka hal ini ditunjukkan oleh hadits \"Berikanlah bagian ashabul furudh, sisanya untuk laki-laki yang lebih dekat.\" Sehingga jika ada sisa, maka diberikan kepada mereka sesuai urutan tersebut, dan yang terakhir setelah paman dan anak-anaknya jika tidak ada, maka yang mewarisinya adalah yang memerdekakan atau disebut wala'. Jika 'ashabah tersebut dalam posisi yang sama, maka didahulukan yang lebih kuat, misalnya saudara sekandung dengan saudara seayah, maka saudara sekandung lebih didahulukan daripada saudara seayah. Jika sama kuatnya, maka mereka mengambil secara bersama-sama. - Adapun tentang beberapa saudari tidak seibu (yakni saudari sekandung atau sebapak) bersama dengan beberapa orang anak perempuan atau beberapa orang puteri dari anak laki-laki sebagai 'ashabah ma'a gharih yang mengambil sisanya, maka karena di dalam Al Qur'an tidak ada ayat yang menunjukkan bahwa saudari-saudari tersebut gugur karena puteri. Dengan demikian, setelah anak perempuan mengambil bagiannya, maka sisanya diberikan kepada para saudari, tidak kepada 'ashabah yang lebih jauh yaitu anak dari saudara laki-laki dan paman atau 'ashabah lainnya lebih jauh, wallahu a'lam. Yakni yang kurang dari 1/3. Wasiat ini diperuntukkan kepada selain ahli waris, adapun selain itu maka tidak diberlakukan kecuali dengan izin ahli waris. Menyusahkan ahli waris ialah melakukan tindakan-tindakan seperti: a. Mewasiatkan lebih dari sepertiga harta pusaka. b. Berwasiat dengan maksud mengurangi harta warisan. Meskpun kurang dari sepertiga bila ada niat mengurangi hak waris, juga tidak diperbolehkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 12",
    "description": "Setelah dijelaskan tentang perincian bagian warisan sebab nasab, berikut ini dijelaskan tentang pembagian warisan karena perkawinan. Dan adapun bagian kamu, wahai para suami, apabila ditinggal mati istri adalah seperdua dari harta yang ditinggalkan oleh istri-istrimu, jika mereka tidak mempunyai anak darimu atau anak dari suami lain. Jika mereka yaitu istri-istrimu itu mempunyai anak laki-laki atau perempuan, maka kamu hanya berhak mendapat bagian seperempat dari harta yang ditinggalkannya setelah dipenuhi wasiat yang mereka buat sebelum mereka meninggal atau setelah dibayar utangnya apabila mereka mempunyai utang. Jika suami meninggal, maka para istri memperoleh bagian seperempat dari harta warisan yang kamu tinggalkan jika kamu tidak mempunyai anak dari mereka atau anak dari istri lain. Jika kamu mempunyai anak laki-laki atau perempuan, maka para istri memperoleh bagian seperdelapan dari harta warisan yang kamu tinggalkan setelah dipenuhi wasiat yang kamu buat sebelum kamu meninggal atau setelah dibayar utang-utangmu apabila ada utang yang belum dibayar. Jika seseorang meninggal, baik laki-laki maupun perempuan, dalam keadaan kalalah, yakni orang yang meninggal dalam keadaan tidak meninggalkan ayah dan tidak meninggalkan anak sebagai pewaris langsung, tetapi orang yang meninggal tersebut mempunyai seorang saudara laki-laki seibu atau seorang saudara perempuan seibu, maka bagi masing-masing dari kedua jenis saudara itu mendapat bagian seperenam dari harta yang ditinggalkan secara bersama-sama. Tetapi jika saudara-saudara seibu itu lebih dari seorang, maka mereka mendapat bagian secara bersama-sama dalam bagian yang sepertiga itu tanpa ada perbedaan antara laki-laki dan perempuan. Pembagian waris ini baru boleh dilakukan setelah dipenuhi wasiat yang dibuatnya sebelum meninggal atau setelah dibayar utangnya apabila mempunyai utang yang belum dilunasi. Wasiat yang dibolehkan adalah untuk kemaslahatan, bukan untuk mengurangi apalagi menghalangi seseorang memperoleh bagiannya dari harta warisan tersebut dengan tidak menyusahkan ahli waris lainnya. Demikianlah ketentuan Allah yang ditetapkan sebagai wasiat yang harus dilaksanakan dengan sepenuh hati. Allah maha mengetahui apa yang kamu kerjakan, maha penyantun dengan tidak segera memberi hukuman bagi orang yang melanggar perintah-Nya. Apa yang dijelaskan di atas itulah batas-batas hukum yang ditetapkan Allah sebagai ketetapan yang tidak boleh dilanggar. Barang siapa taat kepada Allah dan rasul-Nya dengan mengikuti hukum-hukum Allah, maka dia akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai sebagai balasan yang Allah berikan kepada mereka. Mereka mendapatkan kenikmatan di surga dan kekal di dalamnya selalu dalam keadaan sehat dan tidak mengalami penuaan. Dan itulah kemenangan yang agung yang tidak pernah diganggu oleh ketakutan atau kesedihan sedikit pun."
  }
]