[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setan menjanjikan kepada pengikut-pengikutnya dengan janji-janji dusta dan memperdaya mereka dengan angan-angan yang menipu. Dan tidaklah setan memberikan janji kepada mereka kecuali merupakan tipuan belaka yang tidak ada kebenarnnya sama sekali dan tidak ada bukti yang menunjukannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "120. Setan memberi mereka janji-janji palsu dan memberikan harapan-harapan hampa. Padahal sesungguhnya setan tidak menjanjikan apa pun kepada mereka selain kepalsuan yang tidak punya kenyataan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "120. Kemudian Allah menyebutkan bisikan bisikan setan kepada para pengikutnya, bahwa setan menjanjikan kemiskinan kepada manusia jika mereka menginfakkan harta dijalan Allah, menakut-nakuti mereka dengan kematian apabila pergi berjihad, dan menjanjikan orang yang telah tergoda untuk fanatik terhadap pendapatnya dan menyerang orang yang menyelisihinya dengan jabatan dan ketenaran. Setan menguatkan janji-janji dan godaan-godaan ini dengan angan-angan batil. Dan apa yang dijanjikan setan hanyalah kebatilan yang menipu mereka. Mereka tidak mendapatkan dari setan apa yang mereka inginkan, maka setan menghiasi bagi mereka bahwa mereka mendapatkan manfaat dari beberapa hal, meski sebenarnya hal itu mengandung banyak kesakitan dan bahaya; sehingga orang yang berzina, berjudi, atau meminum khamr akan dibuat seakan-akan dia menikmati berbagai kenikmatan padahal sesungguhnya dia hanya menikmati kesenangan sesaat yang akhirnya akan diikuti dengan berbagai rasa sakit yang panjang di dunia dan kesudahan yang buruk berupa azab di akhirat yang tidak dapat diketahui hakikatnya kecuali oleh Allah Yang Maha Mengetahui segala-galanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "120. يَعِدُهُمْ (memberikan janji-janji kepada mereka) Yakni setan menjanjikan janji-janji palsu. وَيُمَنِّيهِمْ ۖ( dan akan membangkitkan angan-angan kosong pada mereka) Yakni angan-angan tak berguna. وَمَا يَعِدُهُمُ الشَّيْطٰنُ(padahal syaitan itu tidak menjanjikan kepada mereka) Dengan membisikkan godaan-godaan kosongnya kedalam pikiran mereka. إِلَّا غُرُورًا(selain dari tipuan belaka) Yakni menipu mereka dengan godaan-godaan dan memberi mereka bayangan bahwa itu memiliki manfaat padahal yang ada hanyalah mudharat dan bahaya. Ibnu Arafah berkata makna (الغرور) adalah apa yang kamu sukai jika kalian lihat secara kasat mata padahal jika kamu melihat hakikatnya maka itu merupakan hal yang kamu benci."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "120 Setan itu memberikan janji-janji kepada sekutu-sekutu mereka, yaitu jika mau menuruti setan dan membangkitkan angan-angan kosong mereka berupa pangkat dan harta di dunia, dan akan selamat di akhirat tanpa dibangkitkan dan dibalas. Padahal setan itu tidak menjanjikan kepada mereka selain hanya tipuan dan janji bohong belaka yang akan memperdaya mereka dengan seakan-akan menampakkan manfaatnya. Itu adalah murni keburukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setan memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong mereka. dan setan tidak menjanjikan kepada mereka, kecuali tipuan belaka} palsu, tidak ada kenyataannya sama sekali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "120. Kemudian Allah berfirman, “setan itu memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong pada mereka,” maksudnya, setan berjanji kepada orang yang berusaha di sesatkan olehnya, dan janji itu segala cara hingga ancaman sekalipun seperti Firman Allah \"setan menjanjikan kefaqiran\" (Al-Baqarah:168). Sesungguhhya setan menakut-nakuti mereka bila mereka berinfak dijalan Allah, maka mereka akan menjadi miskin, dan setan juga menakut-nakuti bila mereka hendak berjihad dengan kematian dan sebagainya seperti Firman Allah : \"sesungguhnya setan itu menakut-nakuti para walinya\" (Ali- Imran:175). Setan menakut-nakuti mereka ketika hendak mendahulukan kerodaan Allah dengan segala cara yang memugkinkan ataupun dengan yang tidak memungkinkan hingga merasuk dalam akal mereka dan seterusnya mereka malas melakukan kebaikan, demikian juga ia membuata angan-angan kosong dan batil kepada mereka dimana bila di buktikan, maka itu hany seperti fatamorgana yang tidak memiliki hakikat, karena itulah Allah berfirman, “padahal setan itu tidak menjanjikan kepada mereka selain dari tipuan belaka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 120: Ia beri perjanjian kepada me- reka, dan ia lalaikan mereka, padahal setan tidak janjikan ke- pada mereka melainkan tipuan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti janji akan berumur panjang dan sebagainya. Janji atau wa'd bisa juga berarti wa'id (ancaman) sebagaimana setan menjanjikan kemiskinan jika manusia bersedekah dan berinfak, yakni mengancam akan mendapatkan kemiskinan. Setan juga menakut-nakuti manusia, jika mereka berjihad akan terbunuh. Demikian juga setan menakut-nakuti manusia ketika mereka mencari keridhaan Allah dengan was-was yang dimasukkan ke dalam pikiran mereka sehingga mereka menjadi malas mengerjakan ibadah, dan menggantinya dengan angan-angan kosong, seperti akan hidup lama di dunia sehingga mengalihkan pandangan manusia yang sebelumnya tertuju kepada akhirat menjadi tertuju kepada dunia. Yang mereka kira akan memperolehnya serta disingkirkan keyakinan terhadap kebangkitan dan pembalasan. Seperti fatamorgana yang dari kejauhan nampak seperti ada air, namun ketika didekati ternyata tidak ada."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 120",
    "description": "Ayat ini menjelaskan kerugian yang dialami oleh mereka yang mengikuti setan. Setan itu memberikan janji-janji bohong semata tanpa bukti kepada mereka, dan ini semua akan membangkitkan angan-angan kosong pada mereka sehingga mereka menunda dan bahkan tidak dapat melakukan kebajikan-kebajikan. Padahal, janji-janji bohong dan anganangan kosong yang dijanjikan setan itu hanyalah tipuan belaka kepada mereka yang menyebabkan mereka sesat dari jalan Allah. Mereka yang tertipu dengan janji-janji bohong dan omong kosong yang dijanjikan setan itu tempatnya di neraka jahanam yang sangat menyeramkan dengan siksaan yang amat pedih, dan mereka kekal di dalamnya dan tidak akan mendapat tempat lain untuk lari dan menghindar darinya."
  }
]