[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu,tempat kembali mereka adalah neraka jahanam,dan mereka tidak akan mendapatkan tempat lari dan tempat berlindung darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "121. Orang-orang yang mengikuti langkah-langkah dan bisikan-bisikan setan itu tempat tinggalnya ialah neraka Jahanam, di sana mereka tidak akan menemukan jalan untuk melarikan diri dan berlindung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "121. Setelah menjelaskan keadaan para pengikut setan dan apa yang dijanjikan setan kepada mereka, maka kemudian Allah menyebutkan balasan bagi mereka; bahwa orang-orang yang dipermainkan oleh setan dengan godaannya atau dengan godaan orang-orang pengikut setan yang mengajak kepada kebatilan, tempat kembali mereka adalah neraka jahanam yang tidak akan mereka temukan di sana tempat untuk lari, Sebab mereka akan tertarik ke dalamnya dan berhamburan di atasnya seperti kupu-kupu yang berhamburan di atas api, sehingga wajah, pinggang, dan punggung mereka terbakar api neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "121. مَحِيصًا (tempat lari) Yakni tempat berlindung dari hal yang tidak mereka sukai yang menimpa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "121 Mereka yang mengamini janji para setan itu pada hari kiamat tempatnya adalah neraka Jahannam dan mereka tidak bisa lari darinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itu tempatnya di neraka Jahanam dan tidak akan menemukan tempat lari darinya} tempat lari dan jalan keluar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "121, “mereka itu tempatnya jahanam,” maksudnya, orang yang tunduk kepada setan dan berpaling dari Rabbnya hingga ia menjadi pengikut iblis dan golongannya di mana tempat menetap mereka adalah neraka, “dan mereka tidak memperoleh temnpat lari dari padanya,” maksudnya, mereka tidak mendapat tempat berlepas diri dan tempat bersandar, akan tetapi mereka kekal di dalamnya selama-lamanya. Dan ketika Allah menjelaskan tempat kembalinya orang-orang yang celaka yaitu wali-wali setan, lalu Allah menjelaskan tempat kembalinya orang-orang yang bahagai dan wali-walinya dalam FirmnaNya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 121: Mereka itu, tempat kembali mereka ialah jahannam; dan mereka tidak akan dapat lari daripadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang tunduk kepada setan, berpaling dari Ar Rahman dan menjadi pengikut Iblis dan rombongannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 121",
    "description": "Mereka yang tertipu dengan janji-janji bohong dan omong kosong yang dijanjikan setan itu tempatnya di neraka jahanam yang sangat menyeramkan dengan siksaan yang amat pedih, dan mereka kekal di dalamnya dan tidak akan mendapat tempat lain untuk lari dan menghindar darinya. Beberapa ayat sebelumnya menggambarkan bahwa orang-orang yang mengikuti langkah-langkah setan akan ditempatkan oleh Allah kelak di neraka jahanam. Sebaliknya, pada ayat ini Allah menggambarkan balasan bagi orang-orang yang beriman dan beramal saleh. Dan orang yang beriman dengan keimanan yang benar dan mengerjakan amal kebajikan sesuai dengan tuntunan agama, kelak di hari akhirat nanti akan kami masukkan ke dalam surga sebagai balasan atas kepatuhan dan ketaatan mereka terhadap tuntunan Allah dan rasul-Nya, yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Dan segala hal yang menjadi janji Allah itu benar dan pasti sesuai dengan kenyataan karena yang menjanjikan itu adalah Allah yang mahabenar perkataan-Nya. Dan siapakah yang lebih benar dan pasti perkataannya daripada Allah' tidak ada satu pun."
  }
]