[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang benar dalam keimanan mereka kepada Allah dan mengikutkan keimanan dengan amal-amal shalih, Allah akan memasukkan mereka kedalam surga-surga dengan karuniaNya, yang mengalir di bawah istana-istan dan pepohonannya sungai-sungai,dan mereka tinggal di sana selamanya,sebagai janji dari Allah yang tidak pernah memungkiri janjiNya. Dan tidak ada seorangpun yang lebih benar daripada Allah dalam perkataan dan janjiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "122. \"Dan orang-orang yang beriman kepada Allah dan melakukan amal saleh yang dapat mendekatkan diri mereka kepada-Nya akan Kami masukkan ke dalam surga-surga yang mengalir sungai-sungai di bawah istana-istananya. Mereka tinggal di sana untuk selama-lamanya, sebagai janji dari Allah.\" Dan janji Allah -Ta'ālā- adalah benar adanya, karena Dia tidak pernah ingkar janji. Dan tidak ada seorang pun yang lebih benar ucapannya daripada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "122. Setelah Allah menyebutkan balasan orang-orang yang mengikuti setan, maka kemudian Allah menyebutkan balasan bagi orang yang tidak menuruti godaannya. Allah menjelaskan bahwa orang-orang yang beriman dan beramal sholeh akan menikmati kenikmatan yang kekal di surga surga yang dibawahnya mengalir sungai-sungai, mereka kekal di dalamnya selama-lamanya. Ini merupakan kemenangan yang besar bagi orang yang dirinya terjaga dari kekotoran perbuatan syirik sehingga dia tidak menyekutukan Allah dan tidak membuat kesalahan di setiap waktu. Kemudian Allah menjelaskan bahwa yang dijanjikan kepada mereka merupakan janji yang tidak diragukan kebenarannya, Dia berfirman: \"janji yang Allah berikan kepada kalian itu merupakan janji yang benar. Dia Maha Kuasa untuk memberi apa yang dijanjikan dengan karunia dan kemurahannya serta keluasan rahmatnya. Adapun janji setan hanyalah perkataan dusta sebab dia tidak mampu untuk mengabulkan janjinya, dia hanya mengumbar kebatilannya kepada para pengikutnya, maka perintah atau larangannya tidak layak untuk ditaati dan nasehatnya tidak layak untuk diikuti, sebab bisikan-bisikannya hanyalah kebatilan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "122. وَعْدَ اللهِ حَقًّا ۚ (Allah telah membuat suatu janji yang benar) Yakni Allah menjanjikan mereka janji yang benar. وَمَنْ أَصْدَقُ مِنَ اللهِ قِيلًا (Dan siapakah yang lebih benar perkataannya dari pada Allah?) Yakni tidak ada yang lebih benar perkataannya daripada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "122 Orang-orang yang beriman kepada Allah dan rasul-Nya, dan mengerjakan amalan saleh berupa kewajiban maupun ketaatan, kelak akan Kami masukkan ke dalam surga yang mengalir sungai-sungai di bawah tempat tinggal di akhirat, mereka kekal di dalamnya selama-lamanya. Allah telah membuat suatu janji yang benar. Dan tidak ada yang lebih benar perkataannya dari pada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang beriman dan beramal shalih akan Kami masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Janji Allah itu benar. Siapakah yang lebih benar} tidak ada yang lebih benar {perkataannya daripada Allah} perkataannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "122. Maksudnya, “yang beriman” kepada Allah, malaikat-malaikatNya, kitab-kitabNya, rasul-rasulNya, Hari Akhir dan takdirNya yang baik maupun yang buruk sesuai dengan yang diperintahkan, yaitu berilmu, membenarkan, dan mengikrarkan, “dan mengerjakan amalan shalih” yang bersumber dari keimanan tersebut. Ini mencakup seluruh perkara yang diperintahkan, baik wajib maupun Sunnah, atas hati, lisan dan bagian-bagian tubuh lainnya, setiap perkara itu menyimpan pahala yang akan diperoleh menurut kondisi, kedudukan, dan penyrmpurnaan keimanan dana mal shalih, dan (nilai kebaikan) akan luput dari dirinya sesuai dengan kadar kekurangan yang terjadi pada keimanan dana mal tersebut, dan itu tergantung kepada apa yang telah diketahui dari hikmah Allah dan rahmatNya. Demikian juga janjiNya yang benar yang dapat diketahui dari penelaahan Kitabullah maupun Sunnah Rasulullah, karena itulah Allah menyebutkan pahala yang diperoleh dari hal tersebut dalam FirmanNya, “Kelak akan Kami masukkan ke dalam surga yang mengalir sungai-sungai di bawahnya,” di dalamnya terdapat berbagai macam kenikmatan yang belum pernah terlihat oleh mata, belum pernah terdengar oleh telinga, dan belum pernah terbersit dalam benak seorang manusia pun, berupa berbagai macam makanan dan minuman yang lezat, pemandangan-pemandangan yang indah nan menakjubkan, istri-istri yang cantic, istana dan kamar-kamar yang terhias mewah, pepohonan yang rindang, buah-buahan yang mengagumkan, suara-suara yang merdu, kenikmatan-kenikmatan yang dalam, saling mengunjungi antara saudara, saling membicarakan kenikmatan yang mereka peroleh di dalam surga, dan yang paling tertinggi dari itu semua dan paling mulia, adalah keridhaan Allah kepada mereka, kenikmatan ruh berdekatan denganNYa, mata melihat kepadaNya, telinga mendengar Firman-firmanNya yang akan melupakan mereka akan kenikmatan-kenikmatan yang mereka rasakan di surga. Sekiranya bukan karena keteguhan dari Allah buat mereka, niscaya mereka akan melayang dan meninggal karena kegirangan dan kebahagiaan, maka demi Allah, betapa manisnya kenikmatan itu! Betapa tingginya apa yang diberikan oleh Allah Yang Mahamulia kepada mereka! Apa yang mereka peroleh berupa segala kebaikan dan kebahagiaan tidak mampu digambarkan oleh seorang pun, dan sebagai pelengkap dan penyempurna dari itu semua adalah keabadian dan kekekalan berada dalam kediaman-kediaman yang tinggi tersebut. Karena itulah Allah berfirman, “Mereka kekal di dalamnya selama-lamanya. Allah telah membuat suatu janji yang benar. Dan siapakah yang lebih benar perkataannya daripada Allah?” maka benarlah Allah Yang Mahaagung, di mana FirmanNya mencapai tingkatan tertinggi dalam kebenaran, karena itulah tatkala FirmanNya adalah benar, kabarNya adalah benar, maka apa pun yang ditunjukkan dari Firman dan kabarNya itu adalah sesuai, terkandung, dan terarah, setiap dari h al itu menjadi maksud dari Kalamullah, demikian juga kalam Rasulullah, karena beliau tidaklah mengabarkan kecuali dengan perintahNya dan beliau tidak berkata kecuali dari wahyu Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 122: Dan orang-orang yang ber- iman dan beramal shalih itu, Kami akan masukkan mereka ke surga- surga yang mengalir padanya su- ngai-sungai, di dalam keadaan kekal padanya, selama-lamanya, sebagai satu perjanjian Allah yang sungguh- sungguh, karena bukankah tidak ada yang terlebih benar omongannya daripada Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah disebutkan pada ayat sebelumnya tempat kembali orang-orang yang celaka yang menjadi wali-wali setan, maka pada ayat ini disebutkan tempat kembali orang-orang yang berbahagia yang menjadi wali-wali Allah. Baik kepada Allah, malaikat-Nya, kitab-kitab-Nya,rasul-rasul-Nya, hari akhir dan kepada qadar yang baik dan yang buruk sesuai yang diperintakan kepada mereka, baik mengetahui, membenarkan maupun mengakui. Yang muncul dari keimanan. Amal saleh di sini mencakup semua yang diperintahkan, baik yang wajib maupun yang sunat, yang terkait dengan hati, lisan maupun anggota badan. Di dalamnya terdapat kenikmatan yang belum pernah dilihat oleh mata, belum pernah didengar oleh telinga dan belum pernah terlintas di hati manusia. Ada makanan dan minuman yang enak, buah-buahan yang nikmat, pemandangan indah yang menyenangkan, istri-istri yang cantik, istana dan kamar-kamar yang indah, pohon-pohon yang lebat, suara-suara menyenangkan, ada kunjungan dari ikhwan serta mengingatkan mereka terhadap masa-masa mereka ketika berada di taman-taman surga (majlis dzikr/ilmu), dan yang lebih tinggi dari semua itu adalah keridhaan Allah kepada mereka, dekat dengan-Nya dan bisa melihat-Nya serta mendengarkan firman-Nya, di mana itu semua membuat mereka lupa dengan semua kesenangan. Ditambah lagi dengan kekalnya mereka di tempat-tempat yang indah dan tinggi tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 122",
    "description": "Beberapa ayat sebelumnya menggambarkan bahwa orang-orang yang mengikuti langkah-langkah setan akan ditempatkan oleh Allah kelak di neraka jahanam. Sebaliknya, pada ayat ini Allah menggambarkan balasan bagi orang-orang yang beriman dan beramal saleh. Dan orang yang beriman dengan keimanan yang benar dan mengerjakan amal kebajikan sesuai dengan tuntunan agama, kelak di hari akhirat nanti akan kami masukkan ke dalam surga sebagai balasan atas kepatuhan dan ketaatan mereka terhadap tuntunan Allah dan rasul-Nya, yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Dan segala hal yang menjadi janji Allah itu benar dan pasti sesuai dengan kenyataan karena yang menjanjikan itu adalah Allah yang mahabenar perkataan-Nya. Dan siapakah yang lebih benar dan pasti perkataannya daripada Allah' tidak ada satu punpahala yang Allah janjikan kepada orang-orang yang beriman dan beramal saleh itu, bukanlah angan-anganmu yang kosong, wahai kaum musyrik atau kaum muslim yang belum memahami dan menghayati agama dengan benar, dan bukan pula angan-angan ahli kitab dari golongan yahudi dan nasrani, tetapi dicapai berkat karunia Allah yang dibagi-bagikan karena keberimanan dan amal saleh. Barang siapa mengerjakan kejahatan, niscaya akan dibalas sesuai dengan kejahatan itu, cepat atau lambat, dan dia tidak akan mendapatkan pelindung dan penolong yang dapat melindunginya dari azab Allah selain Allah."
  }
]