[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak dapat digapai Karunia yang agung ini hanya dengan angan-angan kosong yang kalian impi-impikan belaka wahai kaum Muslimin, dan bukan juga dengan angan-angan kosong ahli kitab dari kalangan yahudi dan nasrani. Dan sesungguhnya Ia hanya dapat digapai dengan keimanan yang benar kepada Allah dan memperbaiki amal shalih yang Allah ridha. Dan barangsiapa mengerjakan perbuatan yang buruk,niscaya akan diberi pembalasan karenanya, dan dia tidak akan mendapati selain Allah pelindung yang mengurus perkara-perkara dan kepentingannya serta penolong yang menolongnya dan menyingkirkan darinya siksaan yang buruk"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "123. Perkara keselamatan dan kemenangan tidak mengikuti apa yang kalian harapkan -wahai kaum muslimin- ataupun apa yang diharapkan oleh orang-orang ahli Kitab, melainkan mengikuti amal perbuatan. Siapa pun di antara kalian yang melakukan keburukan akan dibalas dengan keburukan pula di hari Kiamat. Dan ia tidak akan menemukan penolong yang dapat mendatangkan manfaat baginya ataupun pelindung yang dapat melindunginya dari mara bahaya selain Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "123. Bukanlah suatu kemuliaan agama dan keselamatan pengikutnya dengan seseorang di antara mereka berkata: \" sesungguhnya agama ku lebih mulia dan lebih sempurna \", namun yang seharusnya ia lakukan adalah mengamalkan petunjuknya sebab pahala tergantung pada amal, bukan pada angan-angan dan kecongkakan. Kemudian Allah menekankan dan menjelaskan dengan berfirman: \"Sesungguhnya barangsiapa yang berbuat suatu keburukan maka dia akan mendapatkan balasannya karena balasan -dalam sunnatullah- merupakan akibat dari suatu perbuatan bagi seluruh umat, tidak hanya berlaku pada sebagian umat saja sebagaimana yang dianggap oleh orang-orang yang suka berangan-angan. Dan barangsiapa yang berbuat keburukan dan berhak mendapat siksaan, maka dia tidak akan memiliki penolong selain Allah yang dapat menghindarkannya dari siksaan dan menyelamatkannya, baik itu para nabi yang mereka agung-agungkan maupun makhluk-makhluk lain yang dijadikan sebagai tuhan dan sekutu Allah oleh sebagian manusia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "123. لَّيْسَ بِأَمَانِيِّكُمْ وَلَآ أَمَانِىِّ أَهْلِ الْكِتٰبِ ۗ (itu bukanlah menurut angan-anganmu yang kosong dan tidak (pula) menurut angan-angan Ahli Kitab) Yakni masuk surga, mendapat karunia, kedekatan kepada Allah, dan keselamatan dari azab-Nya tidak dapat diraih hanya sekedar dengan berangan-angan, baik itu bagi ahli kitab yang mengatakan kami adalah anak-anak Allah dan para kekasih-Nya, serta mengatakan neraka tidak akan menyentuk kami kecuali hanya beberapa hari; atau bagi orang-orang yang beriman yang sebagian mereka mengatakan: di hari kiamat kelak akan ada orang yang menyeru: barangsiapa yang memiliki nama Muhammad maka silahkan memasuki surga, atau yang meninggal pada hari jum’at, atau dari negeri tertentu; semua hal ini adalah angan-angan kosong. Akan tetapi barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu. مَن يَعْمَلْ سُوٓءًا يُجْزَ بِهِۦ(Barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu) Semua orang yang melakukan kejahatan berupa syirik atau lainnya tanpa membedakan baik itu orang beriman atau kafir niscaya ia akan dibalas atas perbuatannya di dunia dan di akhirat. Dan semua yang menimpa orang beriman merupakan kafarat baginya meski itu hanya duri yang menusuknya. Sebagaimana hadist dari Imam Bukhari dan Muslim dari Abu Hurairah dan Abu Sa’id bahwa keduanya mendengar rasulullah bersabda: “tidaklah menimpa orang beriman berupa kelelahan, keletihan, penyakit, kesedihan, dan bahkan kegundahan dalam hati kecuali Allah akan menjadikannya kafarat atas kesalahan-kesalahannya”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Setiap pelaku kezhaliman akan mendapat balasan di dunia atas kezholimannya sebelum nanti di akhirat, begitupun dengan pendosa tas dosanya, seperti itulah yang disampaikan oleh firman Allah : { مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ } \"Barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu\", dan dapat dipastikan bahwa diantara pelaku maksiat melihat keselamatan dirinya dan hartanya dan ia menyangka bahwa azab dan balasan itu tidak ada, dan kelalaiannya terhadap perkara yang menyebabkan dirinya akan diazab, dan mungkin azab itu dalam wujud maknawi, sebagaimana yang diriwayatkan bahwasanya sebagian ahbar Bani Israil berkata : wahai tuhan betapa banyak kemaksiatan yang aku lakukan tetapi engkau tidak mendatangkan azab untukku ? lalu dikatakan kepadanya : betapa banyak siksaan yang telah aku timpakan kepadamu tetapi kamu tidak merasakannya ?! bukankan aku telah mengharamkan bagimu nikmatnya bermunajat kepadaku ? 2 ). Tertipulah orang yang telah berbuat jahat tetapi ia melihat itu bagian dari kebaikan, maka yang ia sangka tetap berada di jalan yang benar, tetapi ia lupa firman Allah : { مَنْ يَعْمَلْ سُوءًا يُجْزَ بِهِ } \"Barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "123 Agama Allah itu bukanlah menurut angan-anganmu yang kosong. Surga dan kedekatan dengan Allah juga bukan hanya dengan angan-angan dan tidak pula menurut angan-angan orang musyrik dan ahli Kitab yang mengatakan bahwa kami adalah anak Allah dan kekasih-Nya dan kami tidak akan masuk neraka kecuali hanya sebentar saja. Barangsiapa yang mengerjakan kejahatan baik kecil maupun besar, niscaya akan diberi pembalasan dengan kejahatan itu di dunia dan akhirat. Dan ia tidak mendapat pelindung dan tidak pula penolong baginya selain dari Allah yang dapat menyelamatkannya dari azab. Ayat ini turun untuk menjawab para penganut paham tiga agama yaitu Yahudi dan Nasrani yang mengklaim bahwa mereka akan selamat, dan juga Muslim yang menjawab mereka dengan perkataan: Hanya kami yang akan masuk surga. Sebab lafadz dalam ayat adalah umum, setiap kafir dan mukmin akan diberi balasan atas apa yang mereka lakukan. Balasan untuk kafir adalah neraka selamanya, adapun balasan orang mukmin adalah musibah dan penderitaan dunia, seperti kesedihan, penyakit, kesempitan dan adapun neraka telah ditentukan waktunya. Abu Shalih berkata: orang-orang yang menerima Taurat dan Injil sedang duduk bersama para penganut agama lain, setiap kelompok berkata kepada selain mereka bahwa kami lebih baik dari kalian. Sehingga turun ayat in"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidaklah sesuai angan-angan kalian} wahai orang-orang muslim apa yang dijanjikan Allah berupa pahala yang dihasilkan dari angan-angan kalian tidaklah {dan tidak pula sesuai angan-angan Ahlul kitab. Siapa saja yang mengerjakan kejahatan niscaya akan dibalas sesuai dengan itu dan dia tidak akan menemukan untuknya pelindung serta penolong selain Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "123. Maksudnya, “Bukanlah” perkara itu, keselamatan dan kesucian, “menurut angan-anganmu yang kosong dan tidak (pula) menurut angan-angan Ahli KItab,” angan-angan itu adalah percakapan jiwa yang tidak diiringi dengan perbuatan namun hanya pengakuan semata, dan sekiranya ditentang oleh angan-angan yang serupa dengannya, maka pastilah akan menjadi satu jenis dengannya, dan hal ini adalah umum pada setiap perkara, lalu bagaimanakah bila dalam perkara keimanan dan kebahagiaan yang abadi? Sesungguhnya angan-angan Ahli Kitab telah Allah kabarkan tentangnya bahwa mereka itu, \"Dan mereka (Yahudi dan Nasrani) berkata: “Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani”. Demikian itu (hanya) angan-angan mereka yang kosong belaka. Katakanlah: “Tunjukkanlah bukti kebenaranmu jika kamu adalah orang yang benar”.(Al-Baqarah:111), Dan selain mereka di antara orang-orang yang tidak menisbatkan diri kepada sebuah kitab, tidak pula kepada seorang rasul, maka mereka lebih utama dan lebih patut, demikian juga Allah memasukkan ke dalam golongan itu orang-orang yang menisbatkan diri kepada Islam atas dasar kesempurnaan keadilan dan pemenuhan hak, karena sesungguhnya sekedar menisbahkan diri kepada suatu agama itu sama sekali tidaklah bermanfaat bila seorang manusia tidak membawa keterangan yang jelas atas kebenaran pengakuannya, maka perbuatanlah yang akan membenarkan atau mendustakan pengakuan itu, karena itulah Allah berfirman, “Barangsiapa yang mengerjakan kejahatan, niscaya akan diberi pembalasan dengan kejahatan itu.” Ini mencakup semua pelaku-pelaku-pelaku perbuatan, karena keburukan itu mencakup dosa apa pun, baik kecil maupun besar, dan mencakup juga seluruh balasan, baik sedikit maupun banyak, di dunia maupun di akhirat, dan manusia dalam kaitan ini memiliki tingkatan yang berbeda-beda yang tidak diketahui kecuali oleh Allah, ada yang sedikit dan ada yang banyak. Barangsiapa yang seluruh perbuatannya adalah dosa, dan itu hanya terjadi pada orang kafir lalu bila ia meninggal sebelum bertaubat, maka akan dibalas dengan kekekalan dalam siksa yang pedih. Dan barangsiapa yang perbuatannya adalah shalih dan ia pada sebagian besar kondisinya dalam keadaan konsisten, hanya saja terkadang terjadi beberapa kesalahan atau dosa kecil, lalu apa pun yang menimpanya berupa kegundahan, kesedihan, gangguan dan sakit di tubuhnya, atau hatinya atau orang yang dicintainya atau hartanya dan semacamnya, maka sesungguhnya semua itu akan menjadi pengugur dosa-dosanya, dan hal itu adalah di antara balasan atas amalan-amalannya, yang telah Allah tentukan sebagai tindakan kasih sayang kepada hamba-hambaNya. Dan di antara kedua kondisi ini banyak sekali tingkatan-tingkatannya, balasan umum atas perbuatan yang buruk adalah dikhususkannya pada selain orang-orang yang bertaubat, karena sesungguhnya seorang yang bertaubat dari dosa adalah seperti seorang yang tidak memiliki dosa sama sekali, sebagaimana yang ditunjukkan oleh nash-nash yang ada. Dan FirmanNya, “Dan ia tidak mendapat pelindung dan tidak (pula) penolong baginya selain dari Allah” untuk menghilangkan beberapa perkara yang diperkirakan bahwa seorang yang berhak mendapat balasan atas amalannya itu kemungkinan saja memiliki pelindung atau penolong atau pemberi syafaat yang membela dirinya dari perkara yang seharusnya diterimanya, lalu Allah mengabarkan bahwa hal tersebut tidaklah ada, ia tidak memiliki pelindung yang membantunya memperoleh apa yang diinginkan dan tidak memiliki penolong yang membela dirinya dari perkara yang ditakutkan kecuali Rabbnya dan Rajanya semata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 123: Bukan dan bukan angan-angan Ahli Kitab. Barang siapa mengerjakan kejahat- an, ia akan dibalas dengan itu, dan tidak akan ia dapat selain dari Allah, seorangpun pengurus dan tidak seorangpun penolong. angan-angan kamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada pula yang menafsirkan \"keselamatan\" atau \"pernyataan bersih (rekomendasi)\". Yakni pahala di akhirat, keselamatan atau pernyataan bersih bukanlah menurut angan-angan, cita-cita dan bisikan dalam diri mereka, tetapi menurut ketentuan-ketentuan agama. \"Angan-anganmu\" di sini ada yang mengartikan dengan angan-angan kaum muslimin dan ada pula yang mengartikan angan-angan kaum musyrik. Jika angan-angan di sini ditujukan kepada kaum muslimin, maka maksudnya bahwa mengaku di lisan saja tidaklah cukup, bahkan harus ada bukti terhadap pengakuannya, yaitu amal. Amal itulah yang membenarkan pengakuan itu atau mendustakannya. Ahli Kitab berkata, \"Tidak akan masuk surga kecuali orang-orang Yahudi atau Nasrani\", kata-kata mereka hanyalah angan-angan kosong dari mereka; tidak bersandar kepada kitab maupun bersandar kepada perkataan rasul. Yakni dosa kecil atau dosa besar. Bisa dibalas di akhirat dan bisa di dunia dengan adanya musibah dan cobaan. Manusia dalam hal mengerjakan dosa berbeda-beda, tidak ada yang mengetahuinya selain Allah. Di antara mereka ada yang sedikit dosanya dan di antara mereka ada yang banyak. Jika amalannya buruk semua, dan hal ini hanya ada pada diri orang kafir, maka apabila dia meninggal tanpa bertobat dan memeluk Islam, maka ia akan dibalas dengan azab yang kekal. Namun jika amalnya baik, ia istiqamah pada sebagian besar keadaannya meskipun terkadang muncul dosa-dosa kecil, maka dengan ditimpakan rasa sedih, sakit, kelelahan dan penderitaan atau musibah yang menimpa badannya, hatinya, kekasihnya atau hartanya, maka semua itu akan menghapuskan dosa-dosanya, termasuk pula duri yang mengenainya. Rasulullah shallallahu 'alaihi wa sallam bersabda: « مَا يُصِيبُ الْمُسْلِمَ مِنْ نَصَبٍ وَلاَ وَصَبٍ وَلاَ هَمٍّ وَلاَ حُزْنٍ وَلاَ أَذًى وَلاَ غَمٍّ حَتَّى الشَّوْكَةِ يُشَاكُهَا ، إِلاَّ كَفَّرَ اللَّهُ بِهَا مِنْ خَطَايَاهُ » . \"Tidaklah seorang muslim tertimpa kelelahan, sakit, cemas, sedih, gangguan dan rasa murung, bahkan duri yang mengenainya, kecuali Allah akan menghapuskan kesalahan-kesalahannya.\" (HR. Bukhari) « مَا مِنْ شَىْءٍ يُصِيبُ الْمُؤْمِنَ حَتَّى الشَّوْكَةِ تُصِيبُهُ إِلاَّ كَتَبَ اللَّهُ لَهُ بِهَا حَسَنَةً أَوْ حُطَّتْ عَنْهُ بِهَا خَطِيئَةٌ » . \"Tidaklah sesuatu menimpa seorang mukmin, bahkan duri yang mengenainya, kecuali Allah mencatat untuknya satu kebaikan atau digugurkan satu kesalahan.\" (HR. Muslim) Hal ini untuk menghilangkan anggapan yang mungkin timbul, yakni bahwa orang yang diberi balasan itu mungkin memiliki pelindung atau penolong atau pemberi syafaat yang menghindarkan dirinya dari menerima balasan itu, maka dalam ayat ini Allah Subhaanahu wa Ta'aala menerangkan bahwa tidak ada lagi pelindung dan penolong yang dapat melindungi atau menolongnya dari sesuatu yang dikhawatirkan selain Allah Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 123",
    "description": "Pahala yang Allah janjikan kepada orang-orang yang beriman dan beramal saleh itu, bukanlah angan-anganmu yang kosong, wahai kaum musyrik atau kaum muslim yang belum memahami dan menghayati agama dengan benar, dan bukan pula angan-angan ahli kitab dari golongan yahudi dan nasrani, tetapi dicapai berkat karunia Allah yang dibagi-bagikan karena keberimanan dan amal saleh. Barang siapa mengerjakan kejahatan, niscaya akan dibalas sesuai dengan kejahatan itu, cepat atau lambat, dan dia tidak akan mendapatkan pelindung dan penolong yang dapat melindunginya dari azab Allah selain Allahdan barang siapa mengerjakan amal-amal kebajikan, yakni perbuatanperbuatan baik dan bermanfaat menurut Allah dan rasul-Nya, baik pelakunya laki-laki maupun perempuan sedang dia beriman dengan iman yang benar, maka mereka itu akan masuk ke dalam surga sebagai anugerah Allah atas mereka dan mereka tidak dizalimi atau dikurangi sedikit pun dari amal saleh yang telah mereka lakukan."
  }
]