[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa mengerjakan amal-amal shalih,baik lelaki maupun wanita,sedang dia beriman kepada Allah dan kepada apa yang diturunkan berupa kebenaran,maka mereka itu akan Allah masukkan kedalam surga tempat kenikmatan yang abadi,mereka tidak mengalami pengurangan dari pahala amalan mereka sedikitpun,kendatipun sekecil celah yang ada di permukaan biji kurma."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "124. Barangsiapa yang mengerjakan amal saleh -baik laki-laki maupun wanita- sedangkan ia beriman kepada Allah -Ta'ālā- dengan sungguh-sungguh, mereka yang berhasil memadukan antara iman dan amal itu akan masuk ke dalam Surga. Pahala amal perbuatan mereka tidak akan dikurangi sedikit pun, walau sebesar titik hitam yang ada di punggung biji kurma."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "124. Dan barangsiapa yang melakukan perbuatan baik untuk dirinya baik itu yang berhubungan dengan akhlak, adab, maupun interaksi sosial -baik dia seorang laki-laki maupun perempuan yang beriman-, maka dia akan mendapatkan derajat yang tinggi, mereka adalah orang-orang yang beramal shalih dan beriman kepada Allah dan hari akhir yang memasuki surga karena kesucian jiwa dan kebersihan ruh mereka, mereka tidak akan dikurangi pahala perbuatan mereka sedikitpun, meski hanya sebesar kulit tipis yang ada pada biji kurma."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "124. وَلَا يُظْلَمُونَ نَقِيرًا (dan mereka tidak dianiaya walau sedikitpun) Yakni tidak mengurangi sedikitpun. Dan makna dari naqir adalah lubang kecil yang ada di punggung biji kurma."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "124 Barangsiapa yang mengerjakan amal-amal saleh, baik laki-laki maupun wanita sedang ia orang yang beriman dengan sungguh-sungguh, maka mereka itu masuk ke dalam surga, pahala mereka tidak dikurangi sedikitpun walau seberat seberat naqir: yaitu ukuran biji kurma"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang beramal shalih, baik laki-laki maupun perempuan, sedangkan dia beriman, akan masuk ke dalam surga dan tidak dizalimi sedikit pun} sebesar titik yang ada di permukaan biji kurma"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "124. “Barangsiapa yang mengerjakan amal-amal shalih” termasuk dalam hal tersebut amalan-amalan hati maupun anggota badan, termasuk juga setiap pelaku perbuatan, maupun anggota badan, termasuk juga setiap pelaku perbuatan baik manusia atau jin, kecil maupun besar, laki-laki maupun perempuan, karena itulah Allah berfirman, “Baik laki-laki maupun wanita, sedang ia orang yang beriman,” ini merupakan syarat bagi seluruh amal perbuatan, tidaklah sah, tidak diterima, tidak diberikan balasan pahala dan tidak diancam dengan siksa kecuali dengan keimanan, karena perbuatan tanpa keimanan adalah seperti ranting-ranting pohon yang hilang akarnya, atau seperti bangunan di atas air, maka iman itu adalah asas, dasar, dan pondasi yang dibangun di atasnya segala sesuatu, syarat ini harus dicermati lebih baik pada setiap perbuatan yang umum, bahwa sesungguhnya semua itu disyaratkan dengannya, “maka mereka itu,” yaitu orang-orang yang menyatukan antara keimanan dana mal shalih “masuk ke dalam surga” yang mengandung segala hal yang dikehendaki oleh jiwa dan dinikmati oleh mata, “dan mereka tidak dianiaya walau sedikit pun,” maksudnya, tidak sedikit dan tidak pula banyak dari apa yang telah mereka kerjakan berupa kebaikan, akan tetapi mereka akan mendapatkan balasannya secara penuh dan sempurna lagi berlipat-lipat ganda yang banyak sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 124: Dan barang siapa mengerja- kan kebaikan-kebaikan dari laki- laki atau perempuan, padahal ia Mu'min, maka mereka itu akan masuk surga; dan tidak akan dianiaya mereka (walaupun) sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah syarat bagi semua amal, yakni amal tidaklah menjadi shalih, diterima dan membuahkan pahala serta menghindarkan siksa kecuali dengan iman. Oleh karena itu, amal tanpa iman seperti ranting pohon yang bagian bawahnya ditebang atau membuat bangunan di atas air yang bergelombang. Iman merupakan asas dan pondasi yang di atasnya dibangun segala sesuatu. Bahkan mereka akan mendapatkan pahalanya secara sempurna dan dilipatgandakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 124",
    "description": "Dan barang siapa mengerjakan amal-amal kebajikan, yakni perbuatanperbuatan baik dan bermanfaat menurut Allah dan rasul-Nya, baik pelakunya laki-laki maupun perempuan sedang dia beriman dengan iman yang benar, maka mereka itu akan masuk ke dalam surga sebagai anugerah Allah atas mereka dan mereka tidak dizalimi atau dikurangi sedikit pun dari amal saleh yang telah mereka lakukan. Dan siapakah yang lebih baik agamanya daripada orang yang dengan ikhlas, tunduk, patuh, dan berserah diri kepada Allah secara total, sedang dia mengerjakan kebaikan sesuai dengan tuntunan Allah dan rasul-Nya dan mengikuti agama ibrahim secara lurus' dan Allah telah memilih ibrahim menjadi kesayangan-Nya, karena ia berada pada tingkat kecintaan yang paling tinggi dan ketaatan yang luar biasa terhadap Allah."
  }
]