[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada seorangpun yang lebih baik agamanya daripada orang yang tunduk patuh dengan hati dan segenap anggota tubuhnya kepada Allah semata, sedang dia orang yang berbuat baik dengan ucapan dan perbuatannya mengikuti perintah tuhannya, dan mengikuti agama Ibrahim dan ajarannya, menjauhi keyakinan-keyakinan yang rusak dan ajaran-ajaran yang batil. Dan sesungguhnya Allah telah memilih Ibrahim dan menjadikannya orang kesayangganNya di antara seluruh makhlukNYa. Dan didalam ayat ini terdapat dalil penetapan sifat “khullah” bagi Allah ,yaitu derajat paling tinggi dari cinta dan pilihan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "125. Dan tidak ada orang yang agamanya lebih baik dari orang yang berserah diri kepada Allah secara lahir dan batin, mengerjakan amalnya dengan baik, dan mengikuti agama Ibrahim yang merupakan asal usul agama Muhammad -ṣallallāhu 'alaihi wa sallam- seraya memalingkan hati mereka dari kemusyrikan dan kekafiran menuju ajaran tauhid dan iman. Dan Allah telah memilih Nabi Ibrahim sebagai kekasih tercintanya (khalil) di antara makhluk-Nya yang ada."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "125. Setelah Allah menjelaskan bahwa keselamatan dan kebahagiaan bergantung kepada amal sholeh dan keimanan, maka kemudian Allah menyebutkan tingkat-tingkat kesempurnaan. Yaitu Allah menjelaskan bahwa tidak ada seorangpun yang lebih baik daripada orang yang mengikhlaskan hatinya hanya kepada Allah semata sehingga tidak mengharap kepada selain Allah ketika berdoa atau berharap, dan tidak membuat perantara antara dirinya dengan Allah, serta tidak menghadapkan pandangannya kecuali kepadanya; dan dia meyakini bahwa Allah menghubungkan antara sebab dan akibat, sehingga dia tidak meminta sesuatu kecuali dari perbendaharaan rahmatnya, dan tidak akan ada yang sampai kepada perbendaharaan ini kecuali orang yang menempuh jalan yang benar, yaitu dengan menempuh sunnatullah-sunnatullah dan sebab-sebab yang telah Allah tetapkan pada penciptaannya. Di samping keimanan yang sempurna dan suci, dia juga baik dalam beramal, menghiasi dirinya dengan akhlak yang mulia dan utama, dan meneladani Nabi Ibrahim dalam beragama yaitu dengan menjauhi berhala dan para penyembahnya dan berlepas diri dari mereka sehingga Nabi Ibrahim dapat mencapai derajat kedekatan dengan Tuhannya sehingga beliau mendapat sebutan khalilullah, beliau mendapat keistimewaan berupa kemuliaan dan derajat yang tinggi, dan dipilih untuk menjadi kekasih Allah. Dan barangsiapa yang dapat meraih derajat ini maka ia layak untuk diteladani dan diikuti Jalan hidupnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "125. وَمَنْ أَحْسَنُ دِينًا مِّمَّنْ أَسْلَمَ وَجْهَهُۥ لِلّٰهِ (Dan siapakah yang lebih baik agamanya dari pada orang yang ikhlas menyerahkan dirinya kepada Allah) Yakni mengikhlaskan dirinya kepada Allah. وَهُوَ مُحْسِنٌ (sedang diapun mengerjakan kebaikan) Yakni ia juga mengerjakan kebaikan-kebaikan. وَاتَّبَعَ مِلَّةَ إِبْرٰهِيمَ (dan ia mengikuti millah Ibrahim) Yakni agama Ibrahim, sebab ia adalah orang yang lurus. حَنِيفًا (yang lurus) Yakni yang tidak condong kepada agama-agama yang bathil, namun lurus pada agama yang benar yaitu Islam. وَاتَّخَذَ اللهُ إِبْرٰهِيمَ خَلِيلًا(Dan Allah mengambil Ibrahim menjadi kesayangan-Nya) Yakni menjadikannya orang pilihan-Nya dan mengkhususkannya dengan kemuliaan-Nya. Dan makna (الخليل) adalah kekasih terdekat yang kamu istimewakan dengan kasih sayangmu dan ia juga mengistimewakannya untukmu, serta yang kamu percayakan rahasia-rahasiamu kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "125 Tidak ada yang lebih baik agamanya dari pada orang yang ikhlas menyerahkan dirinya kepada Allah, sedang diapun mengerjakan kebaikan, dan ia mengikuti agama Ibrahim khalilullah yang lurus. Sebab dia telah membelok dari agama yang keliru menuju agama yang benar yaitu Islam. Dan Allah menjadikan Ibrahim menjadi kesayangan-Nya sebab ketulusannya dalam menghamba kepada Allah dan berjuang sekuat tenaga dalam meraih ridha Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapakah} tidak ada {yang lebih baik agamanya daripada orang yang memasrahkan dirinya} yang memasrahkan dan ikhlas dalam urusan agamanya {kepada Allah, sedangkan dia muhsin} orang yang mengerjakan amal shalih sesuai apa yang disyariatkan oleh Allah {dan mengikuti agama Ibrahim yang lurus. Allah telah menjadikan Ibrahim sebagai kekasih} teman baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "125. Maksudnya, tidaklah ada seorang pun yang paling baik agamanya daripada seorang yang menyatukan antara keikhlasan kepada Dzat yang disembah yaitu penyerahan diri hanya untuk Allah yang menunjukkan akan penyerahan hati, penghadapannya, kembalinya keikhlasannya dan penghadapan wajah serta seluruh anggota tubuh kepada Allah, “sedang dia pun” di samping keikhlasan dan penyerahan diri tersebut, “mengerjakan kebaikan” yaitu mengikuti syariat Allah yang telah Allah utus rasul-rasul dengannya dan telah Allah turunkan kitab-kitabNya dan Allah jadikan hal itu sebagai jalan bagi makhluk-makhlukNya yang terpilih dan pengikut-pengikut mereka, “dan ia mengikuti agama Ibrahim” yaitu agama dan syariatnya “yang lurus” yaitu jauh dari syirik menuju kepada pengesaan dan jauh dari menghadap kepada makhluk menuju kedekatan kepada Sang Pencipta, “dan Allah menjadikan Ibrahim sebagai kesayanganNya,” al-Khullah adalah tingkatan tertinggi dari kecintaan, tingkatan ini diperoleh oleh dua orang kesayangan Allah, yaitu Muhammad dan Ibrahim, sedangkan kecintaan dari Allah secara umum adalah kepada seluruh kaum Mukminin, dan sesungguhnya Allah menjadikan Ibrahim sebagai kesayangan, karena beliau telah menunaikan apa yang diperintahkan kepadanya, tegar dalam cobaan yang dihadapkan kepadanya hingga Allah menjadikannya sebagai imam bagi seluruh manusia dan mengambilnya sebagai kesayangan serta meninggikan sebutannya pada seluruh alam semesta."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 125: 125-126. Dan siapakah yang lebih ba- qus agamanya daripada orang yang menyerahkan dirinya kepada Allah, padahal ia berbuat kebaikan, dan ia menurut agama Ibrahim yang ikhlas? Lantaran Allah telah jadi- an Ibrahim itu kekasih-Nya. Dan kepunyaan Allah-lah apa yang di langit dan apa-apa yang di bumi; dan adalah Allah itu melihat tiap-tiap suatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengikuti syari'at rasul-Nya. Yang sesuai dengan agama Islam, meninggalkan syirk menuju tauhid dan meninggalkan berharap kepada makhluk beralih kepada Allah. Khullah (kesayangan) merupakan tingkatan tertinggi dalam hal cinta. Tingkatan khullah ini diraih oleh Nabi Ibrahim dan Nabi Muhammad shallallahu 'alaihima wa sallam, adapun mahabbah (cinta di bawah khullah), maka hal itu diberikan kepada kaum muslimin secara umum. Allah Subhaanahu wa Ta'aala mengangkat Nabi Ibrahim sebagai kesayangan-Nya karena ia mampu memenuhi semua yang diperintahkan-Nya kepadanya dan semua ujian dapat dihadapinya, oleh karena itu, Allah menjadikannya sebagai imam bagi manusia, mengangkatnya sebagai kesayangan-Nya dan meninggikan namanya di alam semesta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 125",
    "description": "Dan siapakah yang lebih baik agamanya daripada orang yang dengan ikhlas, tunduk, patuh, dan berserah diri kepada Allah secara total, sedang dia mengerjakan kebaikan sesuai dengan tuntunan Allah dan rasul-Nya dan mengikuti agama ibrahim secara lurus' dan Allah telah memilih ibrahim menjadi kesayangan-Nya, karena ia berada pada tingkat kecintaan yang paling tinggi dan ketaatan yang luar biasa terhadap Allahdan milik Allahlah apa yang ada di langit dan apa yang ada di bumi, yaitu seluruh wujud yang ada di alam raya ini, dan dia mahakuasa atas segalanya, dan pengetahuan Allah meliputi segala sesuatu, yang besar maupun yang kecil, yang tampak maupun yang tersembunyi, dan yang diucapkan maupun yang hanya terlintas di dalam hati dan pikiran manusia."
  }
]