[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepunyaan Allah lah seluruh apa yang ada di alam semesta ini, yaitu semua makhlukNya, semua itu milik Allah semata. Dan Allah meliputi segala sesuatu, tidak ada sesuatupun yang samar bagiNya dari urusan-urusan makhlukNya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "126. Allah-lah satu-satunya pemilik apa saja yang ada di langit dan yang ada di bumi. Dan Allah Maha Mengetahui, Mahakuasa lagi Maha Mengatur terhadap semua urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "126. Kemudian Allah menyebutkan sesuatu yang menjadi sebab dari hal sebelumnya, bahwa segala yang ada dilangit dan dibumi merupakan kepunyaannya. Meskipun sifat-sifat makhluk-Nya berbeda-beda namun seluruhnya merupakan kepunyaan Allah yang menyembah kepada-Nya dan tunduk kepada perintah-Nya. وكان الله بكل شيء محيطا (dan Allah meliputi segala sesuatu) yakni meliputi dalam hal kekuasaan, penciptaan, pengetahuan, pengaturan, dan keberadaan. Sebab makhluk-makhluk ini tidak tercipta dengan sendirinya dan tidak menciptakan dirinya sendiri, namun keberadaannya berasal dari keberadaan Allah Yang Maha Tinggi, sehingga keberadaan Allah meliputi segala keberadaan, maka wajib bagi setiap hamba yang bertakwa dan mengharap ampunan untuk memurnikan ketauhidan kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "126. وَلِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۚ (Kepunyaan Allah-lah apa yang di langit dan apa yang di bumi) Ayat ini merupakan isyarat bahwa ia menjadikan Nabi Ibrahim sebagai kekasih-Nya sebagai bentuk kemurahan-Nya kepadanya atas ketaatan yang telah ia kerjakan, dan bukan untuk mencari pembela atau penguat-Nya. مُّحِيطًا (Maha Meliputi) Yakni Allah meliputi segala sesuatu dengan ilmu-Nya, Dia tidak meninggalkan sesuatu yang kecil atau yang besar kecuali menghitungnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "126 Kepunyaan Allah-lah segala yang ada di langit dan apa yang di bumi, dan ini adalah isyarat bahwa Allah menjadikan Ibrahim sebagai kekasih agar Ibrahim taat kepada Allah, bukan untuk mempertingginya. Ilmu Allah Maha Meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Allah Maha Meliputi segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "126. Ayat yang mulia ini mengandung penjelasan akan pengetahuan Allah yang meliputi segala sesuatu, Allah berfirman bahwasanya Dia memiliki “apa yang di langit dana pa yang dibumi” maksudnya, seluruh hal itu adalah milikNya dan hamba-hambaNya, mereka itu adalah yang dimiliki sedang Allah adalah pemilik mereka, dan ilmuNya telah meliputi segala hal yang diketahui, pandanganNya meliputi segala hal yang didengar, kehendakNYa dan kemampuanNya terlaksana pada seluruh hal yang ada, rahmatNya meliputi seluruh penduduk bumi dan langit, Allah mengatur dengan keperkasaan dan kekuatanNya atas setiap makhluk, dan segala sesuatu tunduk kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 126: 125-126. Dan siapakah yang lebih ba- qus agamanya daripada orang yang menyerahkan dirinya kepada Allah, padahal ia berbuat kebaikan, dan ia menurut agama Ibrahim yang ikhlas? Lantaran Allah telah jadi- an Ibrahim itu kekasih-Nya. Dan kepunyaan Allah-lah apa yang di langit dan apa-apa yang di bumi; dan adalah Allah itu melihat tiap-tiap suatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni milik-Nya, ciptaan-Nya dan hamba-Nya. Ayat ini menerangkan bahwa Allah meliputi segala sesuatu, milik-Nya dan hamba-Nya segala yang ada di langit dan di bumi. Dia-lah yang memilikinya dan Dia sendiri yang mengatur mereka. Ilmu-Nya meliputi segala sesuatu, penglihatan-Nya meliputi segala sesuatu yang terlihat dan pendengaran-Nya meliputi segala sesuatu yang terdengar. Kehendak dan kekuasaan-Nya berlaku kepada semua yang ada di alam semesta. Rahmat-Nya yang luas mengena kepada penduduk langit dan bumi, dan dengan kemuliaan dan keperkasaan-Nya semua makhluk tunduk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 126",
    "description": "Dan milik Allahlah apa yang ada di langit dan apa yang ada di bumi, yaitu seluruh wujud yang ada di alam raya ini, dan dia mahakuasa atas segalanya, dan pengetahuan Allah meliputi segala sesuatu, yang besar maupun yang kecil, yang tampak maupun yang tersembunyi, dan yang diucapkan maupun yang hanya terlintas di dalam hati dan pikiran manusia. Dan mereka meminta fatwa, yaitu penjelasan hukum, kepadamu, wahai Muhammad, tentang berbagai persoalan hukum yang terkait dengan perempuan-perempuan, seperti hak dan kewajiban mereka sebagai istri. Katakanlah, wahai Muhammad, bukan aku yang memberi fatwa, tetapi Allah memberi fatwa kepada kamu tentang mereka, dan juga apa yang dibacakan kepadamu dalam al-kitab, yaitu Al-Qur'an, memfatwakan tentang para perempuan yatim yang tidak kamu berikan sesuatu yang ditetapkan untuk mereka, seperti mahar yang wajar bagi mereka dan harta warisan yang merupakan hak mereka, sedang kamu ingin menikahi mereka karena kecantikan dan kekayaan mereka, dan kamu tidak membayar mahar-mahar mereka dengan sempurna dan Allah memberi fatwa pula kepadamu tentang anak-anak yang masih dipandang lemah untuk diberikan hak-hak mereka. Dan Allah menyuruh kamu agar mengurus anak-anak yatim secara adil dalam soal harta waris dan mahar mereka. Dan kebajikan apa pun yang kamu kerjakan, termasuk sikap adil kamu dalam memberikan hak-hak mereka, sesungguhnya Allah selamanya, sejak dahulu hinga sekarang dan akan datang, maha mengetahui."
  }
]