[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila seorang wanita mengetahui dari suaminya terdapat sikap arogansi dan keangkuhan kepadanya atau acuh tak acuh kepadanya, maka tidak ada dosa atas mereka berdua untuk mengadakan kesepakatan sesuai dengan kerelaan jiwa mereka, terkait pembagian giliran menginap dan nafkah. Dan perdamaian itu lebih baik dan lebih utama. Dan jiwa-jiwa manusia tercipta dalam tabiat tamak dan kikir. Dan apabila kalian memperbaiki pergaulan kalian terhadap istri-istri kalian dan bertakwa kepada Allah dalam memperlakukan mereka, maka sesungguhnya Allah terhadap apa yang kalian perbuat berupa sikap kikir dan sifat lainnya Maha Mengetahui, tidak ada sesuatupun yang tersembunyi bagiNya,dan akan memberikan balasan kepada kalian atas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "128. Dan jika seorang wanita khawatir suaminya akan bersikap acuh tak acuh dan tidak tertarik lagi kepadanya, maka tidak ada dosa bagi keduanya untuk berdamai dengan merelakan sebagian hak si wanita, seperti hak mendapatkan nafkah dan bermalam bersama sang suami. Perdamaian di sini lebih baik daripada perceraian. Sedangkan jiwa manusia memiliki watak dasar rakus dan kikir, sehingga tidak mau merelakan haknya kepada orang lain. Maka hendaknya sepasang suami-istri berupaya mengatasi tabiat itu dengan cara melatih jiwanya untuk bersikap toleran dan berbuat baik kepada orang lain. Jika kalian bersikap baik dalam semua urusan kalian dan bertakwa kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, sesungguhnya Allah Maha Mengetahui apa yang kalian perbuat, tidak ada sesuatu pun yang luput dari pengetahuan-Nya, dan Dia akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "128. Dan jika ada dugaan seorang suami akan durhaka terhadap istrinya dengan tanda-tanda yang muncul darinya seperti enggan untuk memberi nafkah dan kasih sayang antara suami istri, menyakitinya dengan hinaan, pukulan, dan lain sebagainya, atau berpaling darinya dengan hanya sedikit berinteraksi dengannya karena telah bosan akibat umurnya yang telah tua, wajahnya yang tak lagi cantik, perilaku yang tak elok, atau karena menginginkan wanita lain. Hal ini telah terjadi maka tidak mengapa bagi keduanya untuk saling bersepakat agar memperoleh perdamaian, seperti sang istri merelakan sebagian haknya dalam hal nafkah atau tempat tinggal, atau merelakan seluruh haknya baik itu dalam hal nafkah atau sekaligus dalam hal nafkah dan tempat tinggal, ini semua agar sang istri dapat tetap bersama dengan suaminya dengan penuh kemuliaan. Atau sang istri merelakan sebagian mahar dan harta mut'ah untuk talak agar sang suami mau mentalaknya, sebagaimana dalam firman Allah: فلا جناح عليهما فيما افتدت به (maka tidak ada dosa atas keduanya tentang bayaran yang diberikan oleh isteri untuk menebus dirinya) Hal Ini diperbolehkan bagi suami Jika dia telah mendapatkan keridaan istri, karena sang istri menganggap hal itu mengandung kebaikan baginya tanpa ada suatu kezaliman dan pelecehan. Dan perdamaian lebih baik daripada perceraian dan perpisahan karena hubungan pernikahan merupakan salah satu hubungan yang paling Agung dan paling utama untuk dijaga, dan perjanjian pernikahan merupakan perjanjian yang paling kuat. Dan karena jiwa manusia sangat rentan memiliki sifat kekikiran, maka jika terdapat sesuatu yang mengharuskan dirinya untuk mengeluarkan harta maka akan timbul rasa kikir dan bakhil yang menghalanginya untuk mengeluarkan harta tersebut demi perdamaian. Para istri sangat berhasrat untuk mendapatkan hak mereka dalam pembagian, nafkah, dan perlakuan yang baik, demikian pula para suami sangat berhasrat untuk menjaga harta mereka. Maka hendaklah mereka berdua benar-benar saling memberi pengertian. Kemudian Allah mendorong agar ikatan pernikahan tetap terjaga sebisa mungkin, Dia berfirman: jika kalian saling memperbaiki hubungan dan menjauhi sebab-sebab perpisahan maka sesungguhnya Allah Maha Mengetahui segala yang kalian perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "128. وَإِنِ امْرَأَةٌ خَافَتْ مِنۢ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا (Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya) Nusyuz yang dilakukan suami terhadap istrinya berupa sikap menjauh, membenci, dan ingin berpisah dengannya. Adapun sikap tak acuh atau berpaling darinya adalah dengan tidak mengajak bicara dan tidak memberinya kasih sayang. فَلَا جُنَاحَ عَلَيْهِمَآ أَن يُصْلِحَا بَيْنَهُمَا صُلْحًا ۚ( maka tidak mengapa bagi keduanya mengadakan perdamaian yang sebenar-benarnya) Yakni dengan berbagai cara, baik itu dengan merelakan untuk tidak diberi semua atau sebagian giliran bergaul, atau merelakan sebagian nafkah atau mahar dan sang istri merelakan hal itu yang penting ia tetap dapat hidup bersamanya. وَالصُّلْحُ خَيْرٌ ۗ( dan perdamaian itu lebih baik) Yakni perdamaian yang menenangkan hati dan menghilangkan perselisihan lebih baik dari pada perceraian atau permusuhan. وَأُحْضِرَتِ الْأَنفُسُ الشُّحَّ ۚ( walaupun manusia itu menurut tabiatnya kikir) Allah mengabarkan bahwa sifat kikir itu ada pada kedua belah pihak suami-istri bahkan ada pada semua diri manusia seakan-akan tak pernah terpisah dari diri manusia dalam keadaan apapun, dan ini sudah merupakan tabiat dan sifat dasar penciptaan manusia. Maka seorang suami kikir untuk menunaikan kewajibannya kepada istri seperti mempergauli dengan pergaulan yang baik, memberi nafkah yang baik, dan lainnya, sedangkan istri juga kikir dalam memberikan hak-hak suami atas dirinya. وَإِن تُحْسِنُوا۟ وَتَتَّقُوا۟( Dan jika kamu bergaul dengan isterimu secara baik dan memelihara dirimu ) Yakni memperbaiki pergaulan dengan istri dan bertakwa kepada Allah sehingga kalian meninggalkan nusyuz dan sikap tak acuh yang tidak diperbolehkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "128 Dan jika seorang wanita khawatir akan nusyuz atau sikap tidak acuh dari suaminya, maka tidak mengapa bagi keduanya mengadakan perdamaian yang sebenar-benarnya untuk mencegah perceraian atau pergaulan yang buruk. Dengan memberikan nafkah atau memberikan sebagian mahar, sedang si istri rela untuk bertahan dalam keadaan suaminya tersebut. Dan setiap perdamaian yang bisa mendatangkan saling memahami dan saling mencintai itu lebih baik bagi mereka dari pada perpisahan dan pertengkaran. Walaupun manusia itu menurut tabiatnya kikir. Maka dalam hal ini bagi suami untuk memberikan nafkah dan pergaulan yang baik dan adapun istri memberikan hak suami. Dan jika kamu bergaul dengan isterimu secara baik dan memelihara dirimu (dari nusyuz dan sikap tak acuh), maka sesungguhnya Allah adalah Maha Mengetahui apa yang kamu niatkan dan kamu kerjakan, dan akan memberi balasan atas itu. Aisyah berkata mengenai ayat ini: Ayat ini turun untuk perempuan yang menjadi istri seorang laki-laki, namun suami itu tidak menggaulinya dengan baik dan dia ingin berpisah dengan isterinya. Dan mengharap agar menjadikan untuknya teman, dan memberikan putera, sehingga dia tidak ingin berpisah. Si isteri berkata kepadanya: jangan engkau talak aku, pertahankanlah aku dan selesaikanlah permasalahanku. Kemudian turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika seorang perempuan khawatir suaminya} suaminya {akan nusyuz} memandang rendah dan menjauhinya {atau bersikap tidak acuh, maka tida ada dosa} tidak ada kesalahan {atas keduanya untuk mengadakan perdamaian yang sebenarnya. Perdamaian itu lebih baik, walaupun manusia diciptakan kikir} manusia diciptakan serakah dan kikir {Jika kalian berbuat kebaikan dan bertakwa sesungguhnya Allah Maha Mengetahui terhadap apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "128. Maksudnya, apabila wanita khawatir akan kedurhakaan suaminya, yaitu bersikap congkak padanya, tidak suka kepadanya, dan tidak acuh kepadanya, maka dalam kondisi seperti ini sebaiknya diadakan perbaikan di antara mereka berdua, dengan cara mengugurkan beberapa haknya yang wajib atas suaminya agar ia tetap bersama suaminya tersebut, yaitu rela dengan yang lebih sedikit dari yang seharusnya berupa nafkah atau pakaian atau tempat tinggal atau pembagian hari dengan cara mengugurkan haknya atau memberikan jatah hari atau malamnya kepada suaminya atau kepada madunya, lalu bila mereka berdua telah sepakat dengan kondisi seperti itu, maka tidaklah berdosa dan tidak salah mereka berdua melakukan itu, tidak mengapa bagi suami dan tidak mengapa pula bagi istri, Karen aitu suaminya boleh tetap bersama istrinya tersebut dalam kondisi seperti itu, dan hal itu lebih baik daripada bercerai, karena itulah Allah berfirman, “Dan perdamaian itu lebih bagik (bagi mereka).” Dapat diambil dari keumuman lafazh dan makna ayat ini bahwa perdamaian antara dua orang yang masing-masing mempunyai hak atau perselisihan dalam perkara apa pun, adalah lebih baik daripada masing-masing dari mereka berdua itu saling ngotot dalam mempertahankan hak-haknya, karena dengan berdamai akan menjadi tenang dan tetap berada dalam nuansa saling cinta serta sama-sama memakai predikat sifat toleransi dan saling memaafkan, hal ini boleh dalam segala perkara, kecuali dalam perkara menghalalkan yang haram atau mengharamkan yang halal, karena sesungguhnya hal itu bukanlah merupakan suatu hukum dari hukum-hukum yang ada tidaklah akan sempurna dan terpenuhi kecuali dengan adanya tuntutan-tuntutannya dan tidak adanya penghalang-penghalangnya, maka di antara hukum tersebut adalah ketetapan yang besar ini, yaitu perdamaian, Allah menyebutkan tuntutan akan hal tersebut dan Allah mengingatkan bahwa hal itu adalah baik, dan kebaikan itu akan dicari dan disukai oleh setiap orang yang berakal, di samping itu Allah juga memerintahkan dan sangat menganjurkannya, hingga seorang Mukmin akan menambah usahanya dalam mencarinya. Dan Allah juga menyebutkan penghalangnya dalam FirmanNya, “Walaupun manusia itu menurut tabiatnya kikir,” maksudnya, jiwa manusia itu telah diciptakan memiliki watak kikir, yaitu tidak suka mengerahkan apa yang menjadi hak manusia lain, namun sangat berusaha memenuhi hak dirinya, dan jiwa itu telah diarahkan kepad hal seperti itu secara penciptaannya, dan seharusnya kalian berusaha untuk memghilangkan akhlak yang hina ini dari jiwa-jiwa kalian, dan menggantikannya dengan sifat yang bertolak belakang dengannya, yaitu berlapang dada, artinya mengerahkan hak yang menjadi kewajiban atas dirinya dan bersikap puas dengan beberapa hak untuk dirinya, dan ketika seorang manusia dapat dibimbing kepada akhlak yang baik ini, niscaya di saat itu mudahlah baginya perdamaian antara dia dengan lawan-lawannya, dan akan mudahlah jalan keluar yang menyampaikan mereka kepada yang dikehendaki bersama, berbeda dengan orang yang tidak berusaha menghilangkan sifat kikir dari jiwanya, maka pastilah akan terasa susah baginya perdamaian dan persetujuan tersebut, karena ia tidak akan rela kecuali menerima semua haknya dan ia tidak rela untuk menunaikan semua kewajibannya, apalagi bila musuhnya itu sama seperti dia, maka tambah ruwetlah perkaranya. Kemudian Allah berfirman, “Dan jika kamu bergaul dengan istrimu secara baik dan memelihara dirimu (dari nusyuz dan sikap tak acuh)” yaitu kalian berbuat baik dalam beribadah kepada Allah dengan cara seorang hamba menyembah Rabbnya seolah-olah ia melihatNya, dan bila ia tidak melihatnya, dan berbuat baik kepada makhluk dengan berbagai jalan kebaikan berupa manfaat ilmu, jabatan, atau selainnya, dan kalian bertakwa kepada Allah dengan mengerjakan seluruh perkara yang diperintahkan dan meninggalkan seluruh perkara yang dilarang, atau kalian berbuat baik dengan mengerjakan hal-hal yang diperintahkan dan kalian bertakwa dengan memeninggalkan hal-hal yang dilarang, “maka sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan,” sesungguhnya pengetahuan dan ilmuNya meliputi segala hal, baik lahir maupun batin lalu Allah menjaganya untuk kalian dan membalasnya dengan balasan yang sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 128: 127-128. Dan mereka akan minta keterangan kepadamu tentang perempuan-perempuan: \"Allah akan memberi keterangan kepada kamu di tentang mereka, dan (juga) apa-apa yang dibacakan kepada kamu di dalam Kitab (ini), di tentang anak-anak yatim perempuan yang kamu tidak mau berikan kepada mereka apa yang diwajibkan untuk mereka, padahal kamu suka bernikah dengan mereka, dan (begitu juga) di tentang anak-anak yang lemah; Katakan : padahal (kalau) kamu urus anak- anak yatim itu dengan adil, dan (kalau) kebaikan, Allah itu Mengetahui akan dia kerjakan apa-apa sesungguhnya kamu adalah. Dan jika seorang perempuan takut (terbit) dari suaminya kebencian atau perpalingan, maka tidak mengapa atas mereka berdua membikin satu perdamaian antara mereka berdua, karena perdamaian itu baik, padahal hati (manusia) itu diberi perangai kikir, tetapi jika kamu ber buat baik dan kamu berbakti, maka sesungguhnya ada- lah Aiiah itu amat Mengetahui apa yang kamu kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Aisyah radhiyallahu 'anha tentang ayat, \"Wa inimra'atun khaafat min ba'lihaa nusyuuzan aw i'raadhan.\" Ia berkata, \"Ada seorang suami yang di dekatnya ada seorang istri, di mana ia tidak mau banyak-banyak dengannya (yakni dalam hal cinta dan bergaul), si suami ingin mencerainya, lalu istrinya berkata, \"Aku jadikan bagianku halal (untuk yang lain namun aku tidak ditalak),\" Maka turunlah ayat tersebut. Imam Abu Dawud, Tirmidzi, Thayalisi, dan Hakim ia menshahihkannya, dan didiamkan oleh Adz Dzahabi, serta Ibnu Jarir meriwayatkan, bahwa ayat tersebut turun berkenaan dengan Saudah. Dalam lafaz Abu Dawud, Aisyah berkata kepada Urwah, \"Wahai putera saudariku! Rasulullah shallallahu 'alaihi wa sallam tidak melebihkan sebagian kami di atas yang lain dalam hal penggiliran, yakni tinggalnya di rumah kami. Beliau biasa mendatangi kami semua, Beliau mendekati setiap istrinya tanpa menggauli sampai tiba di tempat yang di sana adalah bagiannya lalu ia bermalam di situ. Saudah binti Zam'ah ketika tua dan khawatir akan dicerai Rasulullah shallallahu 'alaihi wa sallam berkata, \"Wahai Rasulullah, bagianku untuk Aisyah.\" Maka Rasulullah shallallahu 'alaihi wa sallam menerimanya. Aisyah berkata, \"Tentang hal itu dan yang semisalnya saya kira turun ayat, \"Wa inim ra'atun khaafat mim ba'lihaa nusyuuzan.\" Imam Hakim meriwayatkan –dan dia berkata, \"Shahih sesuai syarat Bukhari-Muslim- dan didiamkan oleh Adz Dzahabi- dari Raafi' bin Khudaij bahwa ia memiliki istri yang usianya sudah lanjut, kemudian ia menikah lagi dengan gadis. Ia lebih mengutamakan gadis tersebut, maka istri yang pertama menolak mengakui hal tersebut, Rafi' bin Khudaij pun mentalaknya sekali talak, sehingga ketika masih ada waktu rujuknya, Raafi' berkata, \"Jika kamu mau, saya akan merujuk kamu, namun kamu harus siap bersabar dengan keadaan. Dan ika kamu mau, maka saya akan membiarkan (tidak merujuk) kamu sampai waktunya habis.\" Istrinya berkata, \"Rujuk saja saya, saya siap bersabar terhadap sikap mengutamakan yang lain tersebut.\" Lalu Raafi' tetap mengutamakan gadis tersebut, sedangkan istri yang pertama ternyata tidak sabar, maka Raafi' mentalak lagi dan tetap mengutamakan gadis tersebut. Raafi' berkata, \"Itulah shulh (pendamaian), di mana telah sampai kepada kami, bahwa Allah menurunkan ayat tentangnya, \"Wa inim ra'atun khaafat….dst.\"(Yang rajih hadits ini adalah mursal, Sufyan bin 'Uyainah dan Syu'aib bin Abi Hamzah meriwayatkan secara mursal, dan dimaushulkan oleh Ma'mar sebagaimana dalam Tafsir Ibnu Ktasir, namun yang rajih adalah mursal, terlebih rawi yang memaushulkan yakni Hakim banyak wahm (perkiraan yang keliru)). Nusyuz adalah meninggalkan kewajiban bersuami isteri. Nusyuz dari pihak isteri seperti meninggalkan rumah tanpa izin suaminya. Sedangkan nusyuz dari pihak suami adalah bersikap keras terhadap isterinya, tidak mau menggaulinya, tidak mau memberikan haknya, seperti tidak memberinya nafkah dan lebih cenderung kepada istri yang lebih cantik daripadanya. Berpaling dan tidak menyukainya. Seperti isteri bersedia dikurangi beberapa haknya (misalnya dalam giliran dan nafkah) diberikan kepada istri yang lain, asalkan suaminya mau baik kembali. Namun jika istri tidak ridha dikurangi haknya, maka suami berkewajiban memenuhi haknya atau mencerainya. Yakni lebih baik daripada bercerai, bersikap nusyuz dan berpaling. Dari ayat ini dapat diambil kesimpulan, bahwa shulh (perdamaian dengan merelakan sebagian haknya) antara dua orang atau lebih yang memiliki hak lebih baik daripada menggali lebih dalam untuk mengetahui haknya, karena di dalamnya terdapat islah, hubungannya tetap baik dan merupakan sifat samahah (merelakan) yang memang terpuji. Hal ini dibolehkan dalam segala perkara, kecuali apabila menghalalkan yang haram atau mengharamkan yang halal, maka ketika itu bukanlah shulh, bahkan kezaliman. Perlu diketahui, bahwa setiap hukum tidaklah sempurna kecuali jika ada yang menghendakinya dan tidak ada penghalang, termasuk di antaranya adalah masalah di atas (shulh). Dalam ayat tersebut Allah Subhaanahu wa Ta'aala menyebutkan hal yang menghendaki shulh dan memberitahukan bahwa yang demikian adalah lebih baik. Sedangkan penghalangnya adalah kikir \"walaupun manusia itu menurut tabiatnya kikir\", oleh karena itu sepatutnya melepaskan diri dari jeratan akhlak yang rendah ini dan menggantinya dengan samahah (merelakan), yakni memenuhi kewajiban yang dibebankan kepada kita dan ridha dengan sebagian hak yang kita dapatkan. Jika seseorang diberi taufiq kepada akhlak yang mulia ini, maka akan mudah mengadakan shulh, berbeda dengan orang yang tidak berusaha menyingkirkan sifat kikir ini, maka berat sekali bersikap shulh, karena ia tidak ridah kecuali dengan semua hartanya dan tidak suka memenuhi kewajibannya, jika lawan tengkarnya sama seperti ini keadaannya, maka masalahnya pasti semakin parah. Maksudnya tabi'at manusia itu tidak mau melepaskan sebagian haknya kepada orang lain dengan seikhlas hatinya, meskipun demikian jika isteri melepaskan sebagian hak-haknya, maka boleh bagi suami menerimanya. Ada yang mengartikan, \"jika kamu berbuat ihsan\", yakni mencakup berbuat ihsan dalam beribadah kepada Allah, dengan beribadah seakan-akan dirinya melihat Allah, dan jika tidak bisa begitu maka dengan merasakan perhatian Allah kepadanya, serta berbuat ihsan kepada makhluk Allah dengan apa pun bentuknya, baik memberi manfaat harta, ilmu, kedudukan maupun lainnya. Ada yang mengartikan, \"jika kamu bertakwa kepada Allah\", yakni dengan mengerjakan segala yang diperintahkan dan meninggalkan segala yang dilarang. Ada pula yang mengartikan ayat \"wa in tuhsinuu wa tattaquu\" dengan \"dan jika kamu berbuat ihsan, yaitu dengan mengerjakan perintah, dan bertakwa, yakni dengan meninggalkan larangan. Oleh karena itu, Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 128",
    "description": "Dan jika seorang perempuan, yaitu istri, khawatir suaminya akan melakukan nusyuz (lihat surah an-nisa'/4: 34), yaitu sikap kebencian suami terhadap dirinya, aki-bat sikapnya yang buruk, usianya yang lebih tua dari suaminya, atau karena suami menginginkan perempuan lain yang lebih muda dan lebih cantik daripadanya yang mengakibatkan suami meninggalkan kewajibannya selaku suami, tidak memberikan nafkah lahir dan batin, melakukan tindakan kekerasan, dan tindakan-tindakan lainnya yang dapat mengancam keselamatan dirinya, atau khawatir suaminya bersikap tidak acuh dan berpaling dari dirinya, bahkan meninggalkannya yang dapat menyebabkan ikatan perkawinannya terancam putus, maka untuk mengatasi dan menyelesaikan persoalan tersebut keduanya dapat mengadakan musyawarah untuk mencapai perdamaian dan kesepakatan yang sebenarnya, seperti dengan cara mengurangi sebahagian dari hak-hak istri, seperti nafkah, pakaian, dan lainnya dengan harapan suami dapat kembali kepadanya. Kesepakatan dan perdamaian yang diusahakan, itu lebih baik bagi keduanya daripada perceraian, walaupun pada hakikatnya manusia itu, baik suami maupun istri, menurut tabiatnya sama-sama kikir, yaitu bahwa istri hampir hampir tidak mau menerima pengurangan hak-haknya atas nafkah lahir dan batin, dan sementara suami hampir-hampir tidak mau lagi berbagi atau kembali kepada istrinya, apalagi kalau suami sudah mencintai dan menginginkan wanita lain. Dan jika kamu bersikap baik dan memperbaiki pergaulan de-ngan istrimu dan memelihara dirimu dari nusyuz, sikap acuh tak acuh, dan sikap-sikap lain yang menimbulkan dosa, maka sungguh, Allah ma-hateliti dan maha mengetahui terhadap apa yang kamu kerjakan dan memberimu balasan yang lebih baik. Pada ayat ini Allah mengingatkan kepada mereka yang ingin berpoligami. Dan kamu, wahai para suami, tidak akan dapat berlaku adil yang mutlak dan sempurna dengan menyamakan cinta, kasih sayang, dan pemberian nafkah batin di antara istri-istri-Mu, karena keadilan itu merupakan suatu hal yang sulit diwujudkan dan bahkan di luar batas kemampuan kamu, walaupun kamu dengan sungguhsungguh sangat ingin berbuat demikian. Karena itu, janganlah kamu terlalu cenderung kepada perempuan-perempuan yang kamu cintai dan kamu ingin nikahi, sehingga kamu membiarkan istri yang lain terkatung-katung, seakan-akan mereka bukan istrimu, dan bukan istri yang sudah kamu ceraikan. Dan jika kamu mengadakan perbaikan atas kesalahan dan perbuatan dosa yang telah kamu lakukan sebelumnya dan selalu memelihara diri dari kecurangan, maka sungguh, Allah maha pengampun atas dosa-dosa yang kamu lakukan, maha penyayang dengan memberikan rahmat kepadamu."
  }
]