[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sekali-kali tidak akan sanggup kalian (wahai kaum lelaki) untuk mewujudkan perlakuan adil yang sempurna terhadap istri-istri kalian dalam hal cinta dan kecenderungan hati,bagaimana pun besarnya usaha yang sudah kalian kerahkan. Maka janganlah kalian terlalu berpaling dari istri yang tidak kalian sukai, lalu kalian membiarkannya layaknya wanita yang tidak bersuami dan juga tidak diceraikan,sehingga menyebabkan kalian berbuat dosa. Dan apabila kalian mengadakan perbaiakan terhadap sikap dan tindakan kalian,dengan berlaku adil dalam membagi giliran hari antara istri-istri kalian,dan selalu merasa diawasi oleh Allah dan takut kepadaNya, maka sesungguhnya Allah Maha pengampun terhadap hamba-hambaNya lagi maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "129. Kalian -wahai para suami- tidak akan bisa berbuat adil secara sempurna kepada istri-istri kalian dalam hal kecenderungan hati, walaupun kalian berusaha keras untuk itu. Hal itu disebabkan oleh situasi dan keadaan yang berada di luar kehendak kalian. Maka janganlah kalian memalingkan kecenderungan kalian secara penuh dari istri kalian yang tidak kalian cintai sehingga kalian menjadikannya seperti wanita yang statusnya digantung, maka dia tidak bisa disebut wanita bersuami yang mendapatkan haknya dari sang suami, dan tidak pula disebut wanita tak bersuami yang bisa berharap untuk menikah. Jika kalian memperbaiki keadaan yang ada di antara kalian dengan membawa jiwa kalian kepada sesuatu yang tidak disukainya, yakni menunaikan apa yang menjadi hak istri, dan bertakwa kepada Allah dalam menghadapinya, maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang kepada kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "129. Dan bagian dari ilmunya Hai para suami, kalian tidak akan mampu untuk selalu menegakkan keadilan diantara istri-istri kalian dalam hal kasih sayang dan kecondongan hati meski kalian telah berusaha sekuat tenaga, maka janganlah kalian berpaling sejauh-jauhnya dari istri yang tidak kalian sukai sehingga menjadikannya wanita yang terkatung-katung yang tidak memiliki suami dan tidak pula diceraikan, sehingga kalian mendapat dosa karena mendzaliminya. Dan jika kalian berbuat baik dengan melakukan apa yang diperintahkan dan bertakwa dengan meninggalkan apa yang dilarang maka sesungguhnya Allah Maha mengampuni dosa-dosa hamba-hamba-Nya dan Maha mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "129. وَلَن تَسْتَطِيعُوٓا۟ أَن تَعْدِلُوا۟ بَيْنَ النِّسَآءِ (Dan kamu sekali-kali tidak akan dapat berlaku adil di antara isteri-isteri(mu)) Yakni dalam hal rasa cinta dan berjima’ dengan tanpa ada kecondongan sama sekali kepada salah satu dari mereka; karena sudah menjadi tabiat manusia untuk condong kepada seseorang dan tidak pada yang lainnya, hal ini karena manusia tidak dapat mengatur sepenuhnya hati mereka dan menjadikannya selalu berada pada keadilan terhadap para istri. Oleh karena itulah Rasulullah pernah bersabda: “ya Allah, ini adalah pembagian yang aku mampu untuk para istri maka janganlah Engkau mencelaku dalam apa yang tidak aku mampu” فَلَا تَمِيلُوا۟ (karena itu janganlah kamu terlalu cenderung (kepada yang kamu cintai)) Dengan lebih condong dari sebagian mereka kepada sebagian lainnya. كُلَّ الْمَيْلِ (dengan kecenderungan yang sangat) Yakni sehingga kamu meninggalkan mereka sehingga posisi mereka tergantung seakan-akan orang yang tidak mempunyai suami dan tidak pula orang yang ditalak; dan itu menjadikan mereka berada dalam kemudharatan yang besar. Namun yang harus kamu lakukan adalah dengam memberi mereka bagian giliran meskipun sedikit. وَإِن تُصْلِحُوا۟ (Dan jika kamu mengadakan perbaikan) Yakni kalian perbaiki apa yang telah kalian rusak berupa urusan-urusan yang kalian tidak kalian lakukan seperti pergaulan dengan para istri dan keadilan diantara mereka. وَتَتَّقُوا۟ (dan memelihara diri) Yakni bertakwalah kepada Allah dengan meninggalkan perbuatan yang Dia benci, diantaranya adalah kecondongan kepada salah satu istri yang kalian dilarang melakukannya. فَإِنَّ اللهَ كَانَ غَفُورًا رَّحِيمًا (maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang) Yakni tidak menghukum kalian atas apa yang telah kalian lalaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat ini mengajarkan kita untuk bersegera dalam mengatasi permasalahan poligami dalam rumah tangga dan memperbaiki keadaan yang tengah terjadi : yaitu dengan memberikan keadilan atau melepaskan salah satu dari mereka, tentunya setelah mengambil semua solusi yang diberikan oleh syari'at, namun pelajaran dari ayat ini tidak sebatas pada permaslahan yang diterangkan oleh ayat, tetapi juga dapat diterapkan pada permaslahan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "129 Dan kamu sekali-kali tidak akan dapat berlaku adil di antara isteri-isterimu dalam cinta dan kesenangan, walaupun kamu sangat ingin berbuat demikian, sebab kecenderungan jiwa manusia adalah selalu lebih menyenangi salah satu melebihi yang lain, karena itu janganlah kamu terlalu cenderung kepada yang kamu cintai dan acuh kepada lainnya, sehingga kamu biarkan yang lain terkatung-katung, sehingga seakan tidak menjadi isteri namun juga tidak diceraikan. Maka jika begitu engkau telah berbuat keburukan yang besar, atau jangan kalian bedakan seorang isteri dengan isteri lainnya namun samakanlah kadar dalam memperlakukan mereka. Baik perlakuan materi dalam hal nafkah dan lainnya. Namun jika kecenderungan hati maka engkau tidak kuasa untuk memutuskannya. Dan jika kamu mengadakan perbaikan dan memelihara diri dari kecenderungan untuk lebih condong dalam perlakuan dan keadilan kepada mereka dengan menyamakannya, dan kalian takut kepada Allah sehingga memperbaiki pergaulan dengan mereka dengan meninggalkan apa yang dibenci oleh Allah maka sesungguhnya Allah Maha Pengampun atas yang sudah terjadi dan tidak akan menghukum perbuatan kalian jika kalian bertaubat. Ayat ini turun untuk Nabi dan Saudah binti Zam’ah yang sudah berusia lanjut, atau untuk Rafi’ bin Khudaij dan Khaulah binti Muhammad bin Musalamah karena sudah usia lanjut, atau untuk Abi Sanabil bin Ba’ak dan isterinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kalian sekali-kali tidak akan dapat} tidak akan maampu {berlaku adil di antara istri-istri} untuk menyamakan di antara istri-istri kalian dalam hal kecintaan dan kecenderungan hati {walaupun kalian sangat menginginkannya. Maka janganlah kalian terlalu cenderung} maka janganlah kalian melebihkan kecenderungan kalian dengan memberikan semuanya kepada istri yang kalian cintai {sehingga kalian membiarkan yang lain} sehingga kalian meninggalkan yang lain {seperti terkatung-katung} seperti istri yang tidak memiliki suami dan tidak pula ditalak {Jika kalian mengadakan perbaikan dan bertakwa sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "129. Allah mengabarkan bahwa para suami tidak akan mampu dan bukan di atas kuasa mereka untuk memberikan keadilan yang sempurna di antara istri-istri mereka, karena adil mengharuskan kecintaan secara merata, naluri yang sama rata, kecenderungan hati kepada mereka yang sama rata, kemudian melakukan hal yang menjadi tuntutan itu semua, namun hal seperti ini adalah mustahil dan tidak mungkin terjadi, karena itulah Allah mengampuni apa yang tidak mampu mereka lakukan dan melarang dari perkara yang mungkin dilakukan dalam FirmanNya, “Janganlah kamu terlalu cenderung (kepada yang kamu cintai), sehingga kamu biarkan yang lain terkatung-katung” yaitu janganlah kalian condong dengan kecenderungan yang berlebihan dimana kalian tidak memenuhi hak-hak yang wajib untuk mereka, akan tetapi lakukanlah menurut kesanggupan kalian dari keadilan itu, maka nafkah, pakaian, pembagian hari, dan semacamnya wajib atas kalian berlaku adil dalam perkara tersebut di antara mereka, berbeda dengan perkara cinta dan berjimak atau semacamnya, karena sesungguhnya seorang istri, bila suaminya meninggalkan apa yang seharusnya ia lakukan untuk istrinya, maka istrinya itu akan menjadi terkatung-katung seperti wanita yang tidak bersuami yang dapat bersantai dan berhias diri agar dapat menikah lagi, seperti tidak memiliki suami yang menunaikan hak-haknya. “Dan jika kamu mengadakan perbaikan” apa yang terjadi antara kalian dengan istri-istri kalian dengan memaksa diri kalian untuk melakukan apa yang tidak diinginkan hati kalian dengan maksud mendapatkan pahala dan menunaikan hak-hak istri, dan kalian juga mengadakan perbaikan antara kalian dengan masyarakat, dan juga perbaikan di antara masyarakat dalam hal-hal yang mereka perselisihkan, hal ini mengharuskan adanya anjuran untuk menapaki jalan apa pun yang menyampaikan kepada perbaikan secara mutlak seperti yang terdahulu, “dan memelihara diri (dari kecurangan),” maksudnya, takut kepada Allah dengan melaksanakan perintahNya, menjauhi laranganNya dan bersabar atas takdirNya, “maka sesungguhnya Allah Maha Pengampun lagi Maha Penyayang,” Dia mengampuni apa yang kalian lakukan berupa dosa-dosa dan kelalaian pada hak yang wajib atas kalian, dan Dia merahmati kalian seperti kalian menyayangi istri-istri kalian dan merahmati mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 129: Dan kamu tidak akan bisa adil (betul-betul) di antara perem- puan-perempuan, walaupun kamu mau sungguh-sungguh, lantaran itu janganlah kamu condong secon- dong-condongnya, hingga kamu tinggal kan seorang perempuan sebagai satu benda yang tergantung padahal jika kamu berbuat damai dan kamu peliharakan diri kamu, maka sesungguhnya adalah Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam hal cinta, karena yang demikian tidak sanggup dilakukan oleh seseorang. Yang dilarang berlaku tidak adil adalah dalam hal yang disanggupi seseorang, seperti dalam hal nafkah dan giliran. Sehingga memberikan giliran dan nafkah yang lebih daripada istri yang lain. Bukan sebagai janda, namun seperti wanita yang tidak bersuami. Dengan bersikap adil dalam giliran dan nafkah. Terhadap apa yang disembunyikan dalam hatimu berupa rasa cinta kepada yang satu melebihi daripada yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 129",
    "description": "Pada ayat ini Allah mengingatkan kepada mereka yang ingin berpoligami. Dan kamu, wahai para suami, tidak akan dapat berlaku adil yang mutlak dan sempurna dengan menyamakan cinta, kasih sayang, dan pemberian nafkah batin di antara istri-istri-Mu, karena keadilan itu merupakan suatu hal yang sulit diwujudkan dan bahkan di luar batas kemampuan kamu, walaupun kamu dengan sungguhsungguh sangat ingin berbuat demikian. Karena itu, janganlah kamu terlalu cenderung kepada perempuan-perempuan yang kamu cintai dan kamu ingin nikahi, sehingga kamu membiarkan istri yang lain terkatung-katung, seakan-akan mereka bukan istrimu, dan bukan istri yang sudah kamu ceraikan. Dan jika kamu mengadakan perbaikan atas kesalahan dan perbuatan dosa yang telah kamu lakukan sebelumnya dan selalu memelihara diri dari kecurangan, maka sungguh, Allah maha pengampun atas dosa-dosa yang kamu lakukan, maha penyayang dengan memberikan rahmat kepadamu. Dan jika upaya-upaya perdamaian dan kesepakatan yang telah dilakukan di antara mereka gagal dicapai dan keduanya tidak dapat disatukan kembali, dan keadaan demikian akan menyebabkan keduanya harus bercerai, maka Allah akan memberi kecukupan dalam rezekinya kepada masing-masing, suami dan istri itu, dari karunia-Nya, berupa pasangan yang lebih baik dari pasangan sebelumnya dan kehidupan yang lebih tenang daripada kehidupan sebelumnya. Dan Allah mahaluas dalam memberikan karunia-Nya, mahabijaksana dalam memberikan keputusan-keputusan kepada hamba-hamba-Nya."
  }
]