[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian itu Ketetapan-ketetapan hukum ilahiyah yang Allah syariatkan terkait anak-anak yatim, kaum wanita, dan pembagian warisan, mereupakan ajaran-ajaran syariatNYa yang menunjukan bahwa itu berasal dari sisi Allah yang maha mengetahui lagi maha bijaksana. Dan barangsiapa taat kepada Allah dan rasulNYA dalam perkara yang telah disyariatkan terhadap hamba-hambaNYA dari hukum-hukum dan perkara lain, niscaya DIA akan memasukkannya kedalam surga-surga yang penuh dengan pepohonan dan istana-istana,yang mana sungai-sungai mengalir di bawahnya dengan aliran air yang tawar. Dan mereka abadi berada didalam kenikmatannya, tidak keluar darinya. Dan balasan pahala tersebut merupakan keberuntungan yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13.Ketentuan-ketentuan hukum yang berkenaan dengan anak-anak yatim dan lain-lain tersebut di atas merupakan syariat Allah yang ditetapkan bagi hamba-hamba-Nya untuk mereka laksanakan. Barangsiapa yang taat kepada Allah dan rasul-Nya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya, Allah akan memasukkannya ke dalam surga-surga yang di bawah istana-istananya mengalir sungai-sungai, dan mereka akan tinggal di sana untuk selama-lamanya, tidak akan mati. Balasan dari Rabb itu adalah keberuntungan besar yang tidak tertandingi oleh keberuntungan manapun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Inilah hukum-hukum Allah yang tinggi derajatnya. Barangsiapa yang mentaati Allah dan rasul-Nya dalam menjalankan hukum-hukum ini dan lainnya, maka Allah akan memasukkannya ke dalam surga-surga yang di bawah pepohonannya mengalir sungai-sungai, ia akan kekal di dalamnya. Demikianlah balasan yang besar berupa kemenangan dalam surga-surga yang penuh kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. تِلْكَ (hal itu) Yakni hukum-hukum yang telah disebutkan حُدُودُ اللهِ ۚ( adalah ketentuan-ketentuan dari Allah) Karena itu tidak boleh untuk dilanggar dan dizalimi. وَمَن يُطِعِ اللهَ وَرَسُولَهُۥ (Barangsiapa taat kepada Allah dan Rasul-Nya) Yakni dalam masalah pembagian harta waris dan hukum-hukum yang lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Hukum-hukum tentang anak-anak yatim, pemberi wasiat, dan warisan itu merupakan syariat-syariat Allah yang dilimpahkan olehNya kepada para hambaNya agar mereka mengerjakannya tanpa melampaui batas. Dalam syariat itu, Dia memisahkan antara yang haq dan bathil. Dan barangsiapa menaati Allah dan rasulNya dalam pembagian warisan dan lainnya berupa perintah dan larangan, maka Allah akan memasukkannya ke dalam surga yang abadi (keabadian yang selama-lamanya) dan itu adalah kemenangan agung yang tidak adatandingannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itu adalah batas-batas Allah} syariat-syariat Allah yang Dia tentukan kepada hamba-hambaNya, supaya mereka mengetahuinya {Siapa saja yang taat kepada Allah dan RasulNya, Dia akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya. Itulah kemenangan yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Perincian tersebut yang disebutkan dalam masalah warisan merupakan hukum-hukum Allah yang harus dilaksanakan dan tidak bleh ditinggalkan atau dilalaikan, hal ini adalah dalil bahwa wasiat ahli waris telah dimansukh dengan penentuan dari Allah tentang bagian-bagian tertentu mereka, kemudian firman Allah, \"(hukum-hukum tersebut) itu adalah ketentuan-ketentuan dari Allah” maka wasiat untuk ahli waris dengan melebihi dari haknya telah termasuk sebagai suatu tindakan melampaui batas terhadap sabda beliau, \"tidak ada wasiat untuk ahli waris” Kemudian Allah menyebutkan tentang ketaatan kepadaNya dan kepada rasulNya serta bermaksiat kepada keduanya secara umum, agar termasuk dalam perkara warisan atau meninggalkan hal tersebut, Allah berfirman ”barangsiapa taat kepadada Allah dan RasulNya” dengan menunaikan perintah keduanya yang mana ketaatan terbesar kepada keduanya adalah dalam perkara tauhid, kemudian perintah-perintah mereka berdua dengan perbedaan tingkatan-tingakatannya, dan meningggalkan larangan keduanya yang mana kemaksiatan terbesar kepada keduanya adalah kesyirikan kepada Allah kemudian kemaksiatan-kemaksiatan dalam segala perbedaan tingkatanya, \"niscaya Allah memasukkannya kedalam surga yang mengalir dibawahnya sungai-sungai sedang mereka kekal didalamnya,\" barangsiapa yang menunaikan segala perintah dan meninggalakn segala larangan, maka pastilah ia masuk dalam surga dan selamat dari neraka, \"dan itulah kemenangan yang besar” dengan memperoleh keselamatan dari murka Allah dan siksaNya serta kemenangan dengan pahalaNya dan keridahaanNya dengan kenikmatan abadi yang tidak dapat diungkapkan oleh lisan manusia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata : {ﺗﻠﻚ ﺣﺪﻭﺩ اﻟﻠﻪ} tilka hududullah:tilka (itu) adalah kata tunjuk yang menuju ke seluruh yang telah berlalu dari hukum-hukum nikah, kepengasuhan anak yatim, haramnya memakan harta yatim dan pembagian warisan. Batasan-batasan Allah adalah apa yang ditentukan oleh Allah kepada kita dan dijelaskan untuk ditaati, dan haram untuk keluar darinya serta melewatinya. {اﻟﻔﻮﺯ اﻟﻌﻈﻴﻢ} Al Fauzul ‘azhim: kemenangan yang besar adalah keselamatan dari api neraka dan masuk surga Makna ayat : Tatkala Allah menjelaskan apa yang dikehendaki-Nya tentang hukum-hukum syariat dan batasan batasan agama, Dia memberikan isyarat dengan firman-Nya {ﺗﻠﻚ ﺣﺪﻭﺩ اﻟﻠﻪ} “Itu adalah batasan-batasan Allah”. Allah telah menjelaskannya dan memerintahkannya kepada kalian dengan perintah yang harus ditaati. {ﻭﻣﻦ ﻳﻄﻊ اﻟﻠﻪ ﻭﺭﺳﻮﻟﻪ} “Barang siapa menaati Allah dan Rasul-Nya” dalam perkara di atas atau yang selainnya dari perkara-perkara syariat, maka imbalannya adalah masuk ke dalam surga yang mengalir di bawahnya sungai-sungai, sungai madu, susu, khamr dan air. Dan inilah kesuksesan yang gemilang, saat Allah menyelamatkan dari api neraka dan memasukkan kedalam surga yang abadi di dalamnya selamanya. Pelajaran dari Ayat: • Penjelasan haramnya melampaui batas Allah Ta’ala. • Penjelasan imbalan menaati Allah dan Rasul-Nya, yakni keabadian disurga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 13: Dan barangsiapa ta'at kepada Allah dan Rasul-Nya, niscaya la masukkan dia di surga yang mengalir padanya sungai-sungai, hal keadaan mereka kekal padanya; dan yang demikian itu satu kejayaan yang hesar. Yang demikian itu batas- batas Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dalam masalah pembagian warisan dan masalah lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 13",
    "description": "Apa yang dijelaskan di atas itulah batas-batas hukum yang ditetapkan Allah sebagai ketetapan yang tidak boleh dilanggar. Barang siapa taat kepada Allah dan rasul-Nya dengan mengikuti hukum-hukum Allah, maka dia akan memasukkannya ke dalam surga-surga yang mengalir di bawahnya sungai-sungai sebagai balasan yang Allah berikan kepada mereka. Mereka mendapatkan kenikmatan di surga dan kekal di dalamnya selalu dalam keadaan sehat dan tidak mengalami penuaan. Dan itulah kemenangan yang agung yang tidak pernah diganggu oleh ketakutan atau kesedihan sedikit pundan barang siapa mendurhakai Allah dan rasul-Nya dengan melakukan perbuatan dosa, tidak menaati perintah-perintah-Nya, dan melanggar batas-batas hukum-Nya yang telah disyariatkan untuk hamba-hambanya, niscaya Allah akan membalas atas pelanggaran yang dilakukan dengan memasukkannya ke dalam api neraka yang penuh penderitaan, dia kekal abadi di dalamnya dan dia akan mendapat azab yang pedih dan menghinakan. Balasan yang mereka terima setimpal dengan tindakan mereka melecehkan ketentuan Allah dan meremehkan orang-orang yang mereka halangi hak-haknya."
  }
]