[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika terjadi penceraian antara seorang lelaki dan istrinya,maka sesungguhnya Allah akan memberi kecukupan kepada masing-masing dari mereka dari karunia dan keluasan rizkiNya. Sesungguhnya Allah maha luas karunia dan anugerahNya,maha bijaksana dalam keputusan yang ditetapkanNya antara hamba-hambaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "130. Dan jika sepasang suami-istri berpisah, baik dengan cara talak maupun khuluk, maka Allah akan memberikan kecukupan kepada masing-masing dari karunia-Nya yang berlimpah. Untuk si laki-laki, Allah akan memberikan istri baru yang lebih baik baginya. Dan bagi si wanita, Allah akan memberikan suami baru yang lebih baik baginya. Dan Allah benar-benar Mahaluas karunia dan kasih sayang-Nya, lagi Maha Bijaksana dalam mengatur makhluk-Nya dan menetapkan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "130. Namun jika dan yang tidak dapat menemukan kesepakatan maka tidak mengapa untuk berpisah. Dan Jika perpisahan itu terjadi, baik dengan talak atau khulu' maka Allah akan mencukupi keduanya dengan rezeki dan kemurahan-Nya, Dia Maha Luas karunia-Nya dan Maha Bijaksana dalam hukum-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "130. وَإِن يَتَفَرَّقَا يُغْنِ اللهُ كُلًّا (Jika keduanya bercerai, maka Allah akan memberi kecukupan kepada masing-masingnya) Yakni Allah akan menjadikan masing-masing tidak membutuhkan lagi yang lain, dengan menyiapkan bagi laki-laki istri yang lain yang sesuai dan menyejukkan matanya, dan bagi perempuan suami yang lain yang mempergaulinya seperti yang ia harapkan. مِّن سَعَتِهِۦ ۚ( dari limpahan karunia-Nya) Yakni juga memberi keduanya rezeki yang mencukupi. Dari Ali bin Abi Thalib bahwa ia ditanya tentang ayat ini, lalu ia menjawab: ayat ini adalah tentang seorang lelaki yang mempunyai dua istri, lalu salah satunya jelek atau telah tua sehingga ia ingin menceraikannya, maka istri tersebut menginginkan membuat kesepakatan dengannya dengan hanya meminta giliran satu malam saja dan malam-malam yang lain bagi istri yang lain asalkan dia tidak menceraikannya. Dan ini diperbolehkan asalkan ia rela, namun apabila ia membatalkan kesepakatan ini maka sang suami harus menyamakan giliran keduanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "130 Jika keduanya bercerai, setelah perdamaian dilakukan maka Allah akan memberi kecukupan kepada masing-masingnya dari limpahan karunia-Nya dan melimpahkan rezeki dengan rizki yang mencukupi kebutuhannya. Allah Maha Luas karunia-Nya lagi Maha Bijaksana dalam sehala ketetapan-Nya dan dalam menghukumi segala hal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika keduanya bercerai} suami istri dengan talak {Allah akan memberi kecukupan kepada masing-masing} masing-masing dari keduanya {dari keluasanNya} karuniaNya {Allah Maha luas lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "130. Ini adalah kondisi yang ketiga antara suami istri apabila tidak mungkin terjalin kesepakatan, maka dibolehkan untuk bercerai. Allah berfirman, “Jika keduanya bercerai,” yaitu dengan talak atau pembatal (faskh) atau khulu’ atau semacamnya, “maka Allah akan memberi kecukupan kepada masing-masing” kedua suami istri, “dari limpahan karuniaNya,” yaitu, dari karunia dan kebaikanNya yang luas lagi menyeluruh. Allah akan mencukupkan bagi suami dengan iastri lain yang lebih baik dari istri sebelumnya, dan mencukupkan istri dari karuniaNya walaupun telah terputus haknya dari suaminya. Karena sesungguhnya rizki sang istri ada pada Allah yang menjamin rizki-rizki seluruh makhluk, Yang mengurusi kemaslahatan mereka, dan bisa saja Allah akan memberikan rizki kepadanya berupa suami yang lebih baik dari suami sebelumnya. “Dan Allah Mahaluas (karuniaNya),” karuniaNya banyak, rahmatNya luas, di mana rahmat dan karuniaNYa sampai kepada titik di mana ilmuNya sampai kepadanya, akan tetapi Allah di samping itu, “Mahabijaksana,” yaitu Allah memberikan dengan kebijaksanaanNya dan menahan karena kebijaksanaanNya, dan bila hikmahNya telah ditentukan bahwa beberapa hambaNya tidak mendapatkan karuniaNya disebabkan karena hamba itu sendiri, maka hamba-hamba itu tidak berhak mendapatkan karuniaNya, Allah menahannya karena keadilan dan kebijaksanaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 130: 130-131. Dan jika mereka berdua berpisah, maka Allah akan cukup- kan tiap-tiap (se orang) dengan kur- nia-Nya, karena adalah Allah itu Luas (kurnia-Nya), Bijaksana. Bagi Allahlah apa-apa yang di langit dan apa-apa yang di bumi; dan sesungguhnya Kami telah pesan kepada mereka yang diberi Kitab dahulu daripada kamu dan (juga kepada) kamu : \"Hendaklah kamu berbakti kepada Allah, karena jika kamu kufur, maka sesungguhnya bagi Allahlah apa- apa yang di langit dan apa-apa yang di bumi, dan adalah Allah itu Kaya, Terpuji\","
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena sulit bersatu, baik dengan adanya talak (penceraian dari pihak suami), faskh (pembatalan pernikahan), khulu' (permintaan cerai dari pihak istri) dsb. Cerai merupakan solusi terakhir. Dengan memberikan pasangan lain yang lebih cocok. Dia memberikan karunia dengan hikmah (bijaksana) dan menahan dengan hikmah. Jika hikmah menghendaki untuk menahan ihsannya kepada sebagian hamba-Nya karena suatu sebab yang menghendaki hamba tersebut tidak diberikan karunia-Nya, maka Dia menahan karunia itu karena keadilan dan hikmah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 130",
    "description": "Dan jika upaya-upaya perdamaian dan kesepakatan yang telah dilakukan di antara mereka gagal dicapai dan keduanya tidak dapat disatukan kembali, dan keadaan demikian akan menyebabkan keduanya harus bercerai, maka Allah akan memberi kecukupan dalam rezekinya kepada masing-masing, suami dan istri itu, dari karunia-Nya, berupa pasangan yang lebih baik dari pasangan sebelumnya dan kehidupan yang lebih tenang daripada kehidupan sebelumnya. Dan Allah mahaluas dalam memberikan karunia-Nya, mahabijaksana dalam memberikan keputusan-keputusan kepada hamba-hamba-Nya. Dan milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, yaitu seluruh wujud yang ada di alam ini dan dia mahakuasa atas segalanya, dan sungguh, kami telah memerintahkan kepada orang-orang yahudi dan nasrani yang diberi kitab suci sebelum kamu, yaitu taurat, injil, dan zabur melalui para rasul yang telah kami utus kepada mereka dan juga kepadamu, wahai nabi Muhammad dan umatmu, agar bertakwa kepada Allah, yaitu melaksanakan apa yang diperintahkan Allah dan meninggalkan apa yang dilarang-Nya. Tetapi jika kamu ingkar terhadap kerasulan nabi Muhammad, ayat-ayat yang disampaikannya kepadamu, dan nikmat yang dianugerahkan-Nya kepadamu, maka ketahuilah bahwa sesungguhnya kekafiranmu itu tidak akan membahayakan Allah dan tidak akan mengurangi sedikit pun kekayaan-Nya, sebagaimana syukurmu dan takwamu kepada-Nya tidak akan memberi manfaat sedikit pun kepada-Nya, karena milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, dan Allah mahakaya, yang tidak membutuhkan apa pun dari hamba-hamba-Nya, zat-Nya maha terpuji, yang tidak berpengaruh sedikit pun bagi-Nya, baik karena kepatuhan maupun kemaksiatan hamba-hamba-Nya kepada-Nya."
  }
]