[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepunyaan Allah lah kerajaan yang ada dilangit dan dibumi dan yang ada berada di antara keduanya. Dan sesungguhnya kami telah mengikat janji kepada orang-orang yang telah diberi kitab suci sebelum kalian dari kalangan yahudi dan nasrani dan kami ikat janji kepada kalian juga (wahai umat Muhammad ), untuk bertakwa kepada Allah dan melaksanakan segala perinyahNya dan menjauhi segala laranyanNya, dan kami jelaskan kepada kalian bahwasanya kalian jika mengingkari keesaan Allah dan mengingkari ajaran syariatNya, maka Allah Maha kaya,tidak membutuhkan kalian,sebab segala sesuatu yang ada di langit dan dibumi adalah milikNya.Dan Allah Maha kaya,tidak membutuhkan makhlukNya;lagi maha terpuji dalam seluruh sifat dan perbuatanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "131. Hanya milik Allah semata apa yang ada di langit dan apa yang ada di bumi, serta apa yang ada di antara keduanya. Kami telah memerintahkan kepada orang-orang ahli Kitab dari kalangan Yahudi dan Nasrani, dan juga memerintahkan kepada kalian untuk menjalankan perintah-perintah Allah dan menjauhi larangan-larangan-Nya. Jika kalian mengingkari perintah ini, kalian tidak akan merugikan siapa pun selain diri kalian sendiri. Karena Allah tidak membutuhkan ketaatan kalian. Dia adalah pemilik segala sesuatu yang ada di langit dan apa saja yang ada di bumi. Dia lah Tuhan Yang Mahakaya (tidak butuh) terhadap semua makhluk-Nya, lagi Maha Terpuji atas semua sifat dan tindakan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "131. Setelah Allah memerintahkan untuk berlaku adil dan baik kepada anak-anak yatim dan orang-orang miskin, maka kemudian Allah menjelaskan bahwa dia tidak memerintahkan hal-hal tersebut karena membutuhkan amalan hamba-Nya, karena segala yang ada di langit dan di bumi merupakan makhluk dan kepunyaan Allah semata, Dialah yang mengatur seluruh alam semesta. Dia tidak mendapat kesusahan dalam memberi kekayaan kepada orang yang miskin, memberi rasa aman kepada orang yang ketakutan, dan lain sebagainya yang menunjukkan keagungan kuasa-Nya dan kesempurnaan karunia dan kebaikan-Nya. Dan kami telah memerintahkan orang-orang Yahudi dan Nasrani serta umat-umat lainnya sebelum kalian sebagaimana kami perintahkan kalian untuk bertakwa kepada Allah dalam menegakkan hukum dan syariat-Nya, sebab dengan hukum-Nya pengetahuan kalian menjadi mulia dan dengan syariat-Nya jiwa kalian menjadi suci serta kehidupan dunia dan akhirat kalian menjadi teratur. Namun jika kalian mengingkari kenikmatan dan karunia-Nya maka ketahuilah bahwa Allah adalah pemilik segala kerajaan. Keingkaran dan kemaksiatan kalian tidak akan memberi mudharat kepada-Nya sebagaimana rasa syukur dan ketakwaan kalian tidak memberi manfaat bagi-Nya. Allah memerintahkan kalian dan mereka untuk bersyukur dan bertakwa agar kalian mendapat rahmat-Nya, bukan karena Dia membutuhkan hal tersebut. Dzat Allah Maha Kaya dan Maha Terpuji sehingga tidak membutuhkan rasa syukur kalian untuk menyempurnakan diri-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "131. وَلَقَدْ وَصَّيْنَا الَّذِينَ أُوتُوا۟ الْكِتٰبَ مِن قَبْلِكُمْ (dan sungguh Kami telah memerintahkan kepada orang-orang yang diberi kitab sebelum kamu) Yakni Kami telah memerintahkan kepada mereka dalam kitab yang telah Kami turunkan kepada mereka. وَإِيَّاكُمْ (dan (juga) kepada kamu) Yakni juga Kami telah memerintahkan kepadamu dalam al-qur’an, agar kalian semua bertakwa kepada Allah. فَإِنَّ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۚ (sesungguhnya apa yang di langit dan apa yang di bumi hanyalah kepunyaan Allah) Faidah dari pengulangan kalimat ini adalah sebagai penekanan untuk mengingatkan hamba-hamba-Nya akan keluasan kerajaan-Nya dan agar mereka memikirkannya sehingga mereka mengetahui bahwa Dia tidak membutuhkan hamba-hamba-Nya dan Dia berkuasa atas mereka, dan kewajiban mereka adalah mentaati-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "131 Kemudian Allah memperingatkan atas kejadian berpisahnya dua orang ini bahwa kepunyaan Allah-lah apa yang di langit dan yang di bumi, Dia Maha kuasa dan maha memberi rizki. Sungguh Kami telah memerintahkan kepada orang-orang yang diberi kitab sebelum kamu untuk menjalankan perintah dan menjauhi larangan, jika kalian ingkar kepada syariat Allah yang ditetapkan kepada kalian maka sesungguhnya Allah adalah penguasa langit dan bumi. Kekufuran kalian tidak akan memberi dampak kepada Allah. Hal ini diulangi sebagai penekanan dan peringatan kepada para hamba atas keluasan kekuasaan Allah dan Allah berhak untuk ditaati dan tidak didurhakai. Sesungguhnya Allah Maha tidak butuh kepada makhluk-Nya, Maha terpuji dalam segala keadaan dan segala ketetapan-Nya dan Maha Kuasa atas mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Sungguh Kami telah mewasiatkan kepada orang-orang yang diberi kitab suci sebelum kalian dan juga kepada kalian agar bertakwa kepada Allah. Akan tetapi jika kalian ingkar, maka sesungguhnya hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Allah Maha kaya lagi Maha Terpuji"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "131-132. Allah memberitakan tentang luasnya kerajaanNya yang agung yang menuntut untuk dikelola dengan berbagai bentuk pengelolaan, dan diurusi dengan berbagai macam aturan, baik secara takdir maupun syariat. Pengelolaan Allah menurut syariat yanitu Dia mewasiatkan kepada orang-orang terdahulu dan orang-orang terakhir, Ahli Kitab terdahulu yang akan datang untuk bertakwa, yang mengandung perintah, larangan, dan pengadaan hukum-hukum syariat, dan balasan orang yang menegakkan wasiat tersebut dengan pahala dan hukuman bagi orang yang melalaikannya dan menyia-nyiakannya dengan pedihnya siksa neraka, karena itulah Allah berfirman, “Tetapi jika kamu kafir” dengan meninggalkan takwa kepada Allah dan kalian syirik kepada Allah di mana Allah tidaklah menurunkan suatu keterangan pun akan hal tersebut, sesungguhnya perbuatan kalian itu tidaklah memudharatkan kecuali bagi diri kalian sendiri, dan tidaklah kalian memudharatkan Allah sedikit pun, dan tidak pula kalian mengurangi kerajaanNya, Dia memiliki hamba-hamba yang lain dan lebih baik dari kalian, lebih agung dan lebih banyak, yang tunduk dan taat kepadaNya serta patuh terhadap perintahNya, karena itulah Allah menyiapkan balasan akan hal itu dalam FirmanNya, “Tetapi jika kamu kafir, maka (ketahuilah) sesungguhnya apa yang di langit dana pa yang di bumi hanyalah kepunyaan Allah, dan Allah Mahakaya lagi Maha Terpuji,” Dia memiliki kedermawanan yang sempurna, karunia yang menyeluruh yang bersumber dari perbendaharaan rahmatNya yang tidak akan berkurang dengan infak dan tidak pula berkurang dengan nafkah. karuniaNya mengalir terus siang dan malam, dan sekiranya penduduk langit dan penduduk bumi dari orang-orang terdahulu dan orang-orang yang akan datang berkumpul lalu setiap orang dari mereka memohon seluruh hal yang diangan-angankan olehnya, (maka hal itu) tidaklah akan mengurangi sedikit pun dari kerajaanNya, yang demikian itu karena Allah Mahamulia, Maha Pemberi lagi Mahaagung, pemberianNya adalah FirmanNya, siksaNya adalah FirmanNya, sesungguhnya perintahNya apabila Dia menghendaki sesuatu hanyalah berfirman kepadanya, “Jadilah” maka jadilah ia, dan merupakan kesempurnaan KekayaanNya bahwa Dia memiliki sifat yang sempurna, karena bila ada kekurangan sedikit pun dalam sisi apa pun juga, maka masih ada semacam kebutuhan kepada kesempurnaan, dan di antara sifat-sifat itu adalah kesempurnaan sifat-sifatNya. Dan di antara kesempurnaan kekayaanNya bahwa Dia tidaklah memiliki istri, tidak pula anak, tidak pula sekutu dalam kerajaanNya, tidak pula penolong, tidak pula pembela untukNya pada perkara apa pun dalam pengelolaan kerajaanNya, dan merupakan kesempurnaan kekayaanNya juga adalah kebutuhan seluruh alam langit maupun bumi dalam segala kondisi dan keadaan mereka kepadaNya, permohonan mereka kepadaNYa akan seluruh kebutuhan mereka yang tersembunyi maupun yang Nampak, lalu Allah menunaikan seluruh kebutuhan-kebutuhan mereka dan permohonan-permohonan tersebut, Allah mencukupkan mereka dan memberikan kepuasan buat mereka serta memberikan karuniaNya atas mereka dan memberi petunjuk kepada mereka dengan kasih sayangNYa. Sedang yang Maha Terpuji, merupakan salah satu nama Allah di antara nama-namanya yang mulia, yang menunjukan bahwa dia berhak atas segala pujian, kecintaan, sanjungan, dan penghormatan, yang demikikian itu adalah saat Allah menyifati dirinya dengan sifat yang terpuji yang merupakan sifat yang indah lagi Mulia, dan saata Allah memberi karuniaNya atas makhlukNya berupa kenikmatan kenikmatan yang banyak, maka Dia adalah dzat yang berhak di puji dalam segala kondisi. Dan betapa sesuainya kedua nama ini disatukan Yang Maha Kaya Lagi Maha Terpuji, Allah memiliki kesempurnaan dalam kekayaanNya, kesempuranaan dalam kekayaanNya, kesempurnaan dalam pujiananNya dan kesempuraan dalam kondisi bersatunya darinkedua nama Allah tersebut dengan yang lainNya, kemudian Allah mengulangi peenyebutan peluasan kerajaanya pada apa di langit dan apa yang ada di bumi dan bahwa Allah Maha Pemelihara atas segala sesuatu artinya Maha Mengetahui dan mengelola segala sesuatu menurut hikmahNya, karena sesungguhnya hal itu menjadi suatu kesempurnaan pemeliharaan, dan pemeliharaan itu menurut adanya ilmu terhadap perkara yang di pelihara, kemampuan dan kemamapuan atas pelaksanaan dan pengelolannya, dan pengeloaan tersebut menurut hikmhaNya, lalu apa yang kurang dari hal itu, maka berpulang pada perulangan pemelihara, sedang Allah terlepas dari segala kekurangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 131: 130-131. Dan jika mereka berdua berpisah, maka Allah akan cukup- kan tiap-tiap (se orang) dengan kur- nia-Nya, karena adalah Allah itu Luas (kurnia-Nya), Bijaksana. Bagi Allahlah apa-apa yang di langit dan apa-apa yang di bumi; dan sesungguhnya Kami telah pesan kepada mereka yang diberi Kitab dahulu daripada kamu dan (juga kepada) kamu : \"Hendaklah kamu berbakti kepada Allah, karena jika kamu kufur, maka sesungguhnya bagi Allahlah apa- apa yang di langit dan apa-apa yang di bumi, dan adalah Allah itu Kaya, Terpuji\" ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitakan tentang meratanya kepemilikan-Nya pada alam semesta, di mana hal itu menghendaki Dia mengatur semuanya dengan semua bentuk pengaturan dan bertindak kepadanya dengan berbagai bentuk tindakan, baik berupa qadar (ketetapan-Nya di alam semesta) maupun yang berupa penetapan syari'at dan menyuruh mereka mengikuti syari'at itu dengan bertakwa. Kepada wasiat itu dengan tidak mau bertakwa. Maksudnya ciptaan-Nya, milik-Nya dan hamba-Nya segala yang ada di langit dan yang ada di bumi, oleh karena itu kekafiran kalian tidaklah memadharratkan-Nya sedikit pun, bahkan malah memadharratkan diri kamu. Demikian juga kekafiran itu tidaklah mengurangi kerajaan-Nya, bahkan Dia memiliki hamba yang lebih baik dan lebih banyak dari kamu, di mana mereka selalu taat dan tunduk kepada-Nya. Tidak butuh kepada makhluk-Nya dan kepada ibadah mereka, bahkan merekalah yang butuh kepada-Nya. Dalam tindakan-Nya kepada makhluk-Nya. Dia berhak mendapatkan segala pujian dan sanjungan, karena Dia memiliki sifat-sifat terpuji dan karena nikmat-Nya yang begitu banyak yang diberikan kepada makhluk-Nya, oleh karenanya Dia Maha Terpuji dalam semua keadaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 131",
    "description": "Dan milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, yaitu seluruh wujud yang ada di alam ini dan dia mahakuasa atas segalanya, dan sungguh, kami telah memerintahkan kepada orang-orang yahudi dan nasrani yang diberi kitab suci sebelum kamu, yaitu taurat, injil, dan zabur melalui para rasul yang telah kami utus kepada mereka dan juga kepadamu, wahai nabi Muhammad dan umatmu, agar bertakwa kepada Allah, yaitu melaksanakan apa yang diperintahkan Allah dan meninggalkan apa yang dilarang-Nya. Tetapi jika kamu ingkar terhadap kerasulan nabi Muhammad, ayat-ayat yang disampaikannya kepadamu, dan nikmat yang dianugerahkan-Nya kepadamu, maka ketahuilah bahwa sesungguhnya kekafiranmu itu tidak akan membahayakan Allah dan tidak akan mengurangi sedikit pun kekayaan-Nya, sebagaimana syukurmu dan takwamu kepada-Nya tidak akan memberi manfaat sedikit pun kepada-Nya, karena milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, dan Allah mahakaya, yang tidak membutuhkan apa pun dari hamba-hamba-Nya, zat-Nya maha terpuji, yang tidak berpengaruh sedikit pun bagi-Nya, baik karena kepatuhan maupun kemaksiatan hamba-hamba-Nya kepada-Nyadan Allah menegaskan kembali pada ayat ini apa yang telah dinyatakan-Nya pada ayat sebelumnya bahwa milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Cukuplah Allah sebagai pemeliharanya, yaitu memelihara amal hamba-hamba-Nya."
  }
]