[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kepunyaan Allah lah segala sesuatu yang ada di alam semesta ini dari seluruh wujud makhluk yang ada.Dan cukuplah Allah sebagi Dzat yang menangani urusan-urusan makhlukNya yang juga pemeliharaannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "132. Dan hanya milik Allah semata apa yang ada di langit dan apa yang ada di bumi. Dan hanya Dia lah yang berhak dipatuhi. Dan cukuplah Allah yang mengatur semua urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "132-133. Kemudian Allah menegaskan kembali bahwa seluruh makhluk dan kerajaan di langit dan bumi merupakan milik Allah, dia mengaturnya sesuai dengan kehendak-Nya dalam hal pengadaan, peniadaan, menghidupkan dan mematikan. Cukuplah Allah sebagai tempat bergantung dan bertawakal urusan seluruh hamba. Jika Allah hendak memusnahkan kalian dan menciptakan manusia lain untuk mengganti kalian maka Dia maha kuasa untuk melakukan itu, karena segala yang di langit dan di bumi berada dalam genggaman-Nya dan tunduk di bawah kekuasaan-Nya, namun karena hikmah yang Dia ketahui maka Dia tidak menghendaki hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "132 Dan kepunyaan Allah-lah apa yang di langit, bumi dan semua yang ada di antaranya. Pengulangan demi pengulangan sebagai penekanan bahwa Allah Maha tidak butuh kepada makhluk. Namun makhluk lah yang membutuhkan Allah. Cukuplah Allah sebagai Pemelihara dan tempat bergantungnya segala urusan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hanya milik Allah apa yang ada di langit dan apa yang ada di bumi. Cukuplah Allah sebagai pemelihara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "131-132. Allah memberitakan tentang luasnya kerajaanNya yang agung yang menuntut untuk dikelola dengan berbagai bentuk pengelolaan, dan diurusi dengan berbagai macam aturan, baik secara takdir maupun syariat. Pengelolaan Allah menurut syariat yanitu Dia mewasiatkan kepada orang-orang terdahulu dan orang-orang terakhir, Ahli Kitab terdahulu yang akan datang untuk bertakwa, yang mengandung perintah, larangan, dan pengadaan hukum-hukum syariat, dan balasan orang yang menegakkan wasiat tersebut dengan pahala dan hukuman bagi orang yang melalaikannya dan menyia-nyiakannya dengan pedihnya siksa neraka, karena itulah Allah berfirman, “Tetapi jika kamu kafir” dengan meninggalkan takwa kepada Allah dan kalian syirik kepada Allah di mana Allah tidaklah menurunkan suatu keterangan pun akan hal tersebut, sesungguhnya perbuatan kalian itu tidaklah memudharatkan kecuali bagi diri kalian sendiri, dan tidaklah kalian memudharatkan Allah sedikit pun, dan tidak pula kalian mengurangi kerajaanNya, Dia memiliki hamba-hamba yang lain dan lebih baik dari kalian, lebih agung dan lebih banyak, yang tunduk dan taat kepadaNya serta patuh terhadap perintahNya, karena itulah Allah menyiapkan balasan akan hal itu dalam FirmanNya, “Tetapi jika kamu kafir, maka (ketahuilah) sesungguhnya apa yang di langit dana pa yang di bumi hanyalah kepunyaan Allah, dan Allah Mahakaya lagi Maha Terpuji,” Dia memiliki kedermawanan yang sempurna, karunia yang menyeluruh yang bersumber dari perbendaharaan rahmatNya yang tidak akan berkurang dengan infak dan tidak pula berkurang dengan nafkah. karuniaNya mengalir terus siang dan malam, dan sekiranya penduduk langit dan penduduk bumi dari orang-orang terdahulu dan orang-orang yang akan datang berkumpul lalu setiap orang dari mereka memohon seluruh hal yang diangan-angankan olehnya, (maka hal itu) tidaklah akan mengurangi sedikit pun dari kerajaanNya, yang demikian itu karena Allah Mahamulia, Maha Pemberi lagi Mahaagung, pemberianNya adalah FirmanNya, siksaNya adalah FirmanNya, sesungguhnya perintahNya apabila Dia menghendaki sesuatu hanyalah berfirman kepadanya, “Jadilah” maka jadilah ia, dan merupakan kesempurnaan KekayaanNya bahwa Dia memiliki sifat yang sempurna, karena bila ada kekurangan sedikit pun dalam sisi apa pun juga, maka masih ada semacam kebutuhan kepada kesempurnaan, dan di antara sifat-sifat itu adalah kesempurnaan sifat-sifatNya. Dan di antara kesempurnaan kekayaanNya bahwa Dia tidaklah memiliki istri, tidak pula anak, tidak pula sekutu dalam kerajaanNya, tidak pula penolong, tidak pula pembela untukNya pada perkara apa pun dalam pengelolaan kerajaanNya, dan merupakan kesempurnaan kekayaanNya juga adalah kebutuhan seluruh alam langit maupun bumi dalam segala kondisi dan keadaan mereka kepadaNya, permohonan mereka kepadaNYa akan seluruh kebutuhan mereka yang tersembunyi maupun yang Nampak, lalu Allah menunaikan seluruh kebutuhan-kebutuhan mereka dan permohonan-permohonan tersebut, Allah mencukupkan mereka dan memberikan kepuasan buat mereka serta memberikan karuniaNya atas mereka dan memberi petunjuk kepada mereka dengan kasih sayangNYa. Sedang yang Maha Terpuji, merupakan salah satu nama Allah di antara nama-namanya yang mulia, yang menunjukan bahwa dia berhak atas segala pujian, kecintaan, sanjungan, dan penghormatan, yang demikikian itu adalah saat Allah menyifati dirinya dengan sifat yang terpuji yang merupakan sifat yang indah lagi Mulia, dan saata Allah memberi karuniaNya atas makhlukNya berupa kenikmatan kenikmatan yang banyak, maka Dia adalah dzat yang berhak di puji dalam segala kondisi. Dan betapa sesuainya kedua nama ini disatukan Yang Maha Kaya Lagi Maha Terpuji, Allah memiliki kesempurnaan dalam kekayaanNya, kesempuranaan dalam kekayaanNya, kesempurnaan dalam pujiananNya dan kesempuraan dalam kondisi bersatunya darinkedua nama Allah tersebut dengan yang lainNya, kemudian Allah mengulangi peenyebutan peluasan kerajaanya pada apa di langit dan apa yang ada di bumi dan bahwa Allah Maha Pemelihara atas segala sesuatu artinya Maha Mengetahui dan mengelola segala sesuatu menurut hikmahNya, karena sesungguhnya hal itu menjadi suatu kesempurnaan pemeliharaan, dan pemeliharaan itu menurut adanya ilmu terhadap perkara yang di pelihara, kemampuan dan kemamapuan atas pelaksanaan dan pengelolannya, dan pengeloaan tersebut menurut hikmhaNya, lalu apa yang kurang dari hal itu, maka berpulang pada perulangan pemelihara, sedang Allah terlepas dari segala kekurangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 132: Dan bagi Allah-lah apa-apa yang di langit dan apa-apa yang di bumi, dan cukuplah Allah sebagai Pengawal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Diulangi kata-kata ini untuk memperkuat keharusan bertakwa. Ada yang mengartikan \"wakiilaa\" di atas dengan \"sebagai saksi bahwa apa yang ada di langit dan di bumi milik-Nya\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 132",
    "description": "Dan Allah menegaskan kembali pada ayat ini apa yang telah dinyatakan-Nya pada ayat sebelumnya bahwa milik Allah-lah apa yang ada di langit dan apa yang ada di bumi. Cukuplah Allah sebagai pemeliharanya, yaitu memelihara amal hamba-hamba-Nya. Dengan tegas Allah menyatakan pada ayat ini bahwa kalau Allah menghendaki untuk memusnahkanmu karena kekafiranmu terhadapnya, niscaya dimusnahkan-Nya kamu semua, wahai manusia! kemudian setelah kemusnahanmu itu, dia datangkan umat yang lain sebagai penggantimu. Dan Allah mahakuasa, dan tidak ada halangan sedikit pun bagi-Nya untuk berbuat demikian."
  }
]