[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila Allah menghendaki,niscaya Dia akan membinasakan kalian wahai sekalian manusia,dan kemudian mendatangkan kaum lain selain kalian. Dan Allah Mahakuasa untuk melakukan hal tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "133. Jika Dia menghendaki, Dia dapat membinasakan kalian -wahai manusia- serta mendatangkan makhluk lain yang patuh kepada Allah dan tidak durhaka kepada-Nya. Dan Allah mahakuasa untuk melakukan hal tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "133. إِن يَشَأْ يُذْهِبْكُمْ (Jika Allah menghendaki, niscaya Dia musnahkan kamu) Yakni membinasakan dan mematikan kalian. وَيَأْتِ بِـَٔاخَرِينَ ۚ (dan Dia datangkan umat yang lain) Yakni dengan umat selain kalian, lalu mereka tidak berprilaku seperti kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "133 Jika Allah menghendaki, niscaya Dia musnahkan kamu wahai manusia, dan Dia datangkan umat yang lain sebagai penggantimu. Dan Allah Maha Kuasa berbuat segala hal."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika Dia menghendaki, niscaya Dia musnahkan kalian} menghancurkan kalian {wahai manusia, dan Dia datangkan yang lain} kaum lain selain kalian. Allah Maha kuasa berbuat demikian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "133. Yaitu Allah Yang Mahakaya lagi Maha Terpuji, yang memiliki kekuasaan yang sempurna dan kehendak yang terlaksana pada kalian, “jika Allah menghendaki, niscaya Dia musnahkan kamu wahai manusia, dan Dia datangkan umat yang lain (sebagai penggantimu),” selain kalian yang lebih taat kepada Allah, dan lebih baik daripada kalian. Hal ini merupakan ancaman buat manusia terhadap perbuatan mereka dan kekufuran dan berpalingnnya mereka dari Rabb mereka, sesungguhnya Allah sedikitpun tidaklah lemah dari mereka bila mereka tidak mentaatiNya, akan tetapi Allah menangguhkan mereka dan menunda siksaNya dan tidak melalaikan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 133: Jika Ia kehendaki, niscaya Allah hapuskan kamu, hai manusia! Dan la akan adakan orang-orang atas lain, Allah yang demikian itu, adalah amat Berkuasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai penggantimu yang lebih taat kepada Allah dan lebih baik dari kamu. Dalam ayat ini terdapat ancaman terhadap manusia karena kekafiran mereka dan berpalingnya mereka dari Tuhan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 133",
    "description": "Dengan tegas Allah menyatakan pada ayat ini bahwa kalau Allah menghendaki untuk memusnahkanmu karena kekafiranmu terhadapnya, niscaya dimusnahkan-Nya kamu semua, wahai manusia! kemudian setelah kemusnahanmu itu, dia datangkan umat yang lain sebagai penggantimu. Dan Allah mahakuasa, dan tidak ada halangan sedikit pun bagi-Nya untuk berbuat demikian. Barang siapa di antara kalian, wahai manusia, menghendaki pahala di dunia ini sebagai ganjaran atas perbuatan baik dan amal saleh yang telah ia lakukan, maka ketahuilah bahwa di sisi Allah ada pahala dunia dan akhirat, yang lebih baik dan lebih tinggi nilainya daripada apa yang ia dapatkan di dunia ini. Lalu mengapa ia meminta yang lebih rendah, tidak meminta yang lebih tinggi nilainya' dan hendaklah hamba-Nya memohon kepada-Nya kebaikan dunia dan akhirat karena Allah maha mendengar apa yang diucapkan dan didoakan hamba-hamba-Nya, maha melihat apa yang diperbuat mereka."
  }
]