[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa dari kalian (wahai sekalian manusia),lebih suka terhadap pembalasan dunia dan berpaling dari kampung akhirat,maka disisi Allah saja balasan di dunia dan akhirat. Karena itu, maka hendaklah dia memohon dari Allah saja kebaikan dunia dan akhirat. Dialah Dzat yang memiliki keduanya. Dan Allah maha mendengar seluruh ucapan hamba-hambaNya, maha melihat seluruh niat-niat dan tindak-tanduk mereka,dan Allah akan memberikan balasan kepada mereka sesuai dengan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "134. Barangsiapa di antara kalian -wahai manusia- menginginkan balasan dunia saja untuk amal perbuatannya, hendaklah ia mengetahui bahwasanya di sisi Allah ada balasan dunia dan Akhirat. Maka seharusnya ia meminta kedua balasan tersebut dari-Nya. Dan Allah Maha Mendengar ucapan-ucapan kalian lagi Maha Melihat perbuatan-perbuatan kalian. Dan Dia akan memberi kalian balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "134. Kemudian Allah mengingatkan bahwa kebaikan dunia dan akhirat berada di tangan-Nya, jika mereka bertakwa kepadanya niscaya mereka akan mendapatkan dua kebaikan tersebut, Allah berfirman: barangsiapa yang dalam kehidupannya menginginkan kenikmatan dunia berupa harta, pangkat, dan lain sebagainya dengan usaha dan kesungguhannya, maka di sisi Allah-lah kenikmatan dunia dan akhirat yang bisa kalian dapatkan dengan akal, perasaan, dan panca indra yang telah Allah berikan kepada kalian. Maka Mintalah kedua kenikmatan tersebut, dan jangan hanya mencukupkan diri dengan kenikmatan yang paling rendah di antara keduanya yaitu kenikmatan yang fana dan meninggalkan kenikmatan yang lebih berharga yang merupakan kenikmatan yang kekal, padahal untuk mendapatkan dua kenikmatan tersebut mudah bagi kalian dan mungkin untuk kalian lakukan, dan hendaklah kalian mengucapkan: ربنا آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار (Ya Tuhan kami, berikanlah kepada kami kebaikan di dunia dan di akhirat dan jauhkanlah kami dari siksa api neraka) Allah maha mendengar perkataan hamba-hambanya ketika mereka berdoa dan bermunajat dan maha melihat segala urusan mereka pada setiap keadaan, maka hendaklah mereka senantiasa merasa diawasi oleh Allah dalam setiap perkataan dan perbuatan, karena dengan demikian maka jiwa mereka akan menjadi suci dan senantiasa memilih perbuatan yang mulia dalam setiap perkara di dunia mereka serta selalu merasa siap menghadapi kehidupan yang kekal di akhirat sebagai tempat menerima balasan dan pahala mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "134. مَّن كَانَ يُرِيدُ ثَوَابَ الدُّنْيَا (Barangsiapa yang menghendaki pahala di dunia saja) Yakni ia adalah orang yang mengharapkan kenikmatan dunia dengan amalan-amalannya, seperti orang yang berjihad untuk mendapatkan ghanimah tanpa mengharapkan pahala. فَعِندَ اللهِ ثَوَابُ الدُّنْيَا وَالْاٰخِرَةِ ۚ( karena di sisi Allah ada pahala dunia dan akhirat) Lalu bagaimana dia memilih pahala yang paling remeh dan rendah, tidakkah ia meminta apa yang ada di sisi Allah dengan amalannya yaitu pahala dunia dan akhirat sehingga ia dapat meraih keduanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "134 Barangsiapa yang menghendaki dengan perbuatannya pahala di dunia saja berupa ghanimah tanpa pahala maka pahala di dunia dan akhirat adalah milik Allah, sehingga tidak meminta yang rendah dari dua hal tersebut, dan meninggalkan pahala akhirat dan kebaikan dunia maka Allah akan memberikan dua pahala itu. Dan Allah Maha Mendengar atas segala perkataan kalian lagi Maha Melihat segala perbuatan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang menghendaki} mencari dengan amalnya {pahala dunia, maka di sisi Allah ada pahala dunia dan akhirat. Allah Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "134. Kemudian Allah memberitakan bahwa barangsiapa yang cita-cita dan keinginanNya rendah yang tidak melebihi balasan duniawi semata, dan tidak memiliki keinginan sama sekali kepada akhirat, sesungguhnya ia telah menyia-nyiakan usaha dan pandangannya, disamping itu ia tidaklah menerima balasan dunia kecuali apa yang telah Allah tetapkan untuknya, karena Allah adalah Pemilik Segala sesuatu yang memiliki balasan dunia dan akhirat, maka agar kedua hal itu diharapkan dariNya, dan dimohonkan pertolongan kepadaNya akan keduanya, dan sesungguhnya tidak akan diperoleh apa yang ada di sisiNya kecuali dengan mentaatiNya, dan tidaklah akan dipenuhi perkara-perkara dunia dan akhirat kecuali dengan memohon pertolongan kepadaNya dan mengemis kepadaNya secara terus menerus. MilikNyalah segala hikmah dalam membinbing orang yang diberi taufikNya dan dalam menghinakan orang yang dihinakan dan dalam pemberian dan laranganNya, karena itulah Allah berfirman, “ Dan Allah Maha Mendengar Lagi Maha Melihat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 134: Barangsiapa mau ganjaran dunia, maka di sisi Allah ada ganjaran dunia dan Akhirat, dan adalah Allah itu Pendengar, Penglihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap amalnya. Bagi orang yang menginginkannya, dan tidak ada yang memiliki balasan itu selain-Nya. Oleh karena itu, mengapa kamu lebih memilih yang rendah (hanya balasan di dunia), padahal tidak ada yang diperolehnya dari balasan dunia selain yang ditaqdirkan buatnya, dan mengapa kamu tidak meminta yang lebih tinggi dari itu, yaitu balasan di dunia dan di akhirat dengan cara berbuat ikhlas kepada-Nya dan menaati-Nya. Sesungguhnya orang yang mengejar dunia, seperti orang yang menanam rumput, oleh karena itu tidak akan tumbuh padi. Sebaliknya, orang yang mengejar akhirat seperti orang yang menanam padi, yakni akan tumbuh pula rumput, dan dia akan mendapatkan dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 134",
    "description": "Barang siapa di antara kalian, wahai manusia, menghendaki pahala di dunia ini sebagai ganjaran atas perbuatan baik dan amal saleh yang telah ia lakukan, maka ketahuilah bahwa di sisi Allah ada pahala dunia dan akhirat, yang lebih baik dan lebih tinggi nilainya daripada apa yang ia dapatkan di dunia ini. Lalu mengapa ia meminta yang lebih rendah, tidak meminta yang lebih tinggi nilainya' dan hendaklah hamba-Nya memohon kepada-Nya kebaikan dunia dan akhirat karena Allah maha mendengar apa yang diucapkan dan didoakan hamba-hamba-Nya, maha melihat apa yang diperbuat merekakalau pada ayat-ayat sebelumnya Allah memerintahkan untuk berlaku adil terhadap anak-anak yatim dan perempuan-perempuan, dalam ayat ini Allah memerintahkan berbuat adil terhadap semua manusia. Wahai orang-orang yang beriman! jadilah kamu secara sungguhsungguh penegak keadilan di antara umat manusia secara keseluruhan, menjadi saksi yang benar karena Allah, tanpa ada diskriminasi, walaupun terhadap dirimu sendiri atau terhadap orang-orang yang sangat dekat denganmu sekali pun, seperti ibu bapak dan kaum kerabatmu, janganlah jadikan hal itu sebagai penghalang bagimu untuk berbuat adil. Jika dia, yang terdakwa itu, kaya, janganlah kamu terpengaruh dengan kekayaannya, ataupun jika ia miskin, janganlah merasa iba karena kemiskinannya, maka Allah lebih tahu kemaslahatan atau kebaikannya. Maka janganlah kamu mengikuti hawa nafsu sehingga kamu memberi keputusan yang tidak adil dan menjadi saksi yang tidak benar, karena ingin menyimpang dari kebenaran. Dan jika kamu memutarbalikkan kata-kata dan fakta yang benar atau enggan menjadi saksi yang benar untuk menyatakan kebenaran dan menegakkannya, maka ketahuilah Allah mahateliti terhadap segala apa yang kamu kerjakan dalam setiap keputusan yang kamu ambil dan setiap kesaksian yang kamu berikan."
  }
]