[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta menjalankan syariatNya, jadilah kalian orang-orang yang senantiasa tegak menjalankan keadilan, mengemukakan persaksian karena mengaharap wajah Allah , walaupun terhadap diri kalian sendiri atau ayah-ayah dan ibu-ibu kalian atau terhadap karib kerabat kalian, bagiamanapun keadaan orang yang dipersaksikan, baik kaya maupun miskin, karena sesungguhnya Allah lebih utama memperhatikan mereka dibandingkan kalian dan lebih tahu apa yang mendatangkan kemaslahatan mereka berdua. Janganlah membawa kalian hawa nafsu dan fanatik buta untuk meninggalkan sikaf adil. Apabila kalian mengubah-ubah persaksian dengan lisan-lisan kalian,lalu kalian membawakan persaksian yang tidak sebenarnya atau berpaling darinya dengan tidak mengemukakannya atau menyembunyikannya, maka sesungguhnya Allah maha mengetahui sekecil apapun tindakan kalian dan akan memberikan balasan kepada kalian menurut perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "135. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya, jadilah orang-orang yang senantiasa berlaku adil dalam semua hal dan memberikan kesaksian yang benar untuk siapa pun. Walaupun hal itu akan merugikan diri kalian sendiri, merugikan kedua orangtua, atau karib kerabat kalian. Dan jangan sekali-kali kemiskinan atau kekayaan seseorang mendorong kalian untuk memberikan kesaksian atau menolak memberikan kesaksian. Karena Allah lebih mengerti keadaan orang yang miskin dan orang yang kaya di antara kalian dan lebih mengetahui apa yang terbaik baginya. Maka janganlah kalian mengikuti hawa nafsu kalian dalam memberikan kesaksian supaya kalian tidak menyimpang dari kesaksian yang benar. Jika kalian memalsukan kesaksian dengan memberikan kesaksian yang tidak semestinya atau menolak memberikan kesaksian, sesungguhnya Allah Maha Mengetahui apa yang kalian perbuat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "135. Setelah Allah memerintahkan untuk bersikap adil terhadap para istri dan anak-anak yatim, kemudian Allah memerintahkan untuk berbuat adil kepada seluruh kaum Mukminin secara umum, Dia berfirman: jadilah kalian orang-orang yang menegakkan keadilan di setiap perkara ketika memutuskan perkara di antara manusia, baik itu ketika kalian memegang kekuasaan, ketika menjadi hakim, atau ketika melakukan pekerjaan seperti saat menegakkan keadilan dan kesetaraan di antara istri-istri dan anak-anak. Dan jadilah kalian saksi-saksi yang selalu berpegang kepada kebenaran yang diridhoi oleh Allah tanpa pilih kasih, meskipun kesaksian itu akan merugikan kalian atau orang tua dan orang terdekat kalian seperti anak atau saudara kalian. Jika orang yang terberatkan oleh saksi yang benar itu merupakan kerabat kalian atau orang lain yang kaya ataupun miskin maka sesungguhnya Allah lebih utama daripada mereka dan syariat-Nya lebih berhak untuk diikuti; maka janganlah kalian sekali-kali berpilih kasih kepada orang yang kaya karena ingin mendapatkan imbalan atau karena takut dari gangguannya, dan jangan pula berpilih kasih kepada orang miskin karena merasa kasihan. Maka janganlah kalian mengikuti hawa nafsu agar tidak berpaling dari kebenaran. Dan jika kalian bersilat lidah dengan merubah kesaksian atau enggan untuk menyampaikan kesaksian, maka sesungguhnya Allah maha mengetahui perbuatan kalian, dia mengetahui apa yang kalian niatkan, dan dia akan membalas apa yang kalian perbuat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "135. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ كُونُوا۟ قَوّٰمِينَ بِالْقِسْطِ (Wahai orang-orang yang beriman, jadilah kamu orang yang benar-benar penegak keadilan) Yakni dengan berlaku adil dalam urusan-urusan yang mereka pegang dan yang berada dibawah tanggungjawab kalian seperti para istri dan anak. Ayat ini juga mencakup para hakim dan pemimpin. شُهَدَآءَ لِلّٰهِ (menjadi saksi karena Allah) Yakni senantiasa bersaksi karena-Nya dan mengharap keridhaan-Nya dengan bersaksi diantara manusia sebagaimana mestinya dengan penuh keadilan dan kebenaran. وَلَوْ عَلَىٰٓ أَنفُسِكُمْ أَوِ الْوٰلِدَيْنِ وَالْأَقْرَبِينَ ۚ (biarpun terhadap dirimu sendiri atau ibu bapa dan kaum kerabatmu) Berlaku adil dalam persaksian terhadap diri mereka sendiri adalah dengan mengakui kewajiban-kewajiban yang harus ia tunaikan, adapun persaksian terhadap ibu bapak adalah dengan bersaksi atas kewajiban keduanya terhadap hak orang lain. Penyebutan kedua orang tua dalam ayat ini karena berbakti kepada keduanya merupakan kewajiban dan keduannya merupakan makhluk yang paling dicintai. Kemudian Allah menyebutkan para kerabat karena biasanya merupakan tempat rasa cinta dan fanatisme. Apabila seseorang telah bersaksi atas kewajiban-kewajiban mereka niscaya untuk bersaksi atas orang lain akan lebih layak untuk berlaku adil. إِن يَكُنْ (Jika ia) Yakni orang yang dipersaksikan atasnya atau untuknya. غَنِيًّا(kaya) Lalu tidak diperhatikan karena kekayaannya agar mendapat manfaat darinya atau agar dapat menjauhi keburukannya, sehingga tidak ditegakkan persaksian atasnya. أَوْ فَقِيرًا(ataupun miskin) Lalu tidak diperhatikan karena kemiskinannya sebagai rasa kasihan padanya, sehingga tidak ditegakkan persaksian atasnya. فَاللهُ أَوْلَىٰ بِهِمَا ۖ( maka Allah lebih tahu kemaslahatannya) Yakni penegakan keadilan merupakan kewajiban dalam hukum dan persaksian dalam keadaan apapun. فَلَا تَتَّبِعُوا۟ الْهَوَىٰٓ( Maka janganlah kamu mengikuti hawa nafsu) Yakni condong kepada apa yang diinginkan hawa nafsu kalian dengan berharap dapat memberi manfaat pada diri, orang tua, dan kerabat kalian dan menjauhkan hal yang dibenci dari mereka. أَن تَعْدِلُوا۟ ۚ وَإِن تَلْوُۥٓا۟( karena ingin menyimpang dari kebenaran. Dan jika kamu memutar balikkan (kata-kata)) Yakni dengan meninggalkan apa yang wajib atas kalian dalam menentukan hukum secara adil dan persaksian yang sesuai kebenaran, dengan mengubahnya ke arah yang sesuai dengan hawa nafsu, dengan mengemukakan berbagai alasan dan halangan, padahal Allah mengetahui bahwa itu bukanlah suatu alasan bagi kalain. أَوْ تُعْرِضُوا۟( atau enggan menjadi saksi) Yakni menolak untuk memberi kesaksian dengan menyembunyikan apa yang kalian saksikan. Ayat ini mencakup para hakim dan saksi, dan untuk para saksi telah jelas, adapun untuk para hakim adalah dengan berpaling dari salah satu pihak yang berselisih, atau memutar balikkan kata-kata untuknya. Pendapat lain mengatakan ayat ini hanya khusus ditujukan untuk para saksi. Dahulu terdapat seorang laki-laki yang memiliki persaksian atas keponakannya atau kerabatnya, kemudian ia memutar balikkan kata-kata dan menyembunyikan apa yang ia lihat yang dapat menyusahkan keponakannya tersebut dengan harapan dapat mempermudah urusannya dan mendapat putusan yang ringan. فَإِنَّ اللهَ كَانَ بِمَا تَعْمَلُونَ خَبِيرًا(maka sesungguhnya Allah adalah Maha Mengetahui segala apa yang kamu kerjakan) Yakni mengetahui apa yang kalian kerjakan berupa memutar balik kata-kata dan enggan bersaksi serta segala perbuatan lainnya. Dan ini merupakan ancaman yang besar bagi orang yang tidak memberi persaksian sebagaimana mestinya, atau hakim yang memutuskan perkara tidak sesuai kebenaran karena mengikuti hawa nafsu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "135 Wahai orang-orang yang beriman, jadilah kamu orang yang benar-benar menegakkan keadilan atas segala urusan keluarga, pemutusan masalah, pemerintahan dan masyarakat di antara manusia. Menjadi saksi karena Allah dengan menegakkan persaksian dengan benar biarpun terhadap dirimu sendiri dengan sebenarnya. Ataupun kepada ibu bapak dengan benar satu sama lain. –Ini disebutkan karena kedua orang tua adalah orang yang paling dicintai oleh seorang anak.- dan atau kepada kaum kerabatmu. Sebab mereka adalah golongan yang dicintai maka tetaplah bersaksi dengan sebenarnya, jangan kalian menyelewengkan persaksian. Jika ia yang disaksikan kaya ataupun miskin, maka Allah lebih utama dari pertimbangan itu semua. Jangan kalian hormati orang kaya karena kekayaannya, dan jangan kalian sepelekan orang miskin karena kemiskinannya, sehingga kalian dengan mudah menyelewengkan persaksian. Jangan menuruti hawa nafsu untuk mendatangkan manfaat atau mudharat kepada salah satu dari mereka, sebagai pengingkaran untuk dapat berbuat adil. Atau hawa nafsu tidak bisa dijadikan dasar untuk menentukan persaksian yang benar. Jika kalian gerakkan lisan kalian untuk bersaksi dengan tidak benar atau menyeleweng dari bersaksi secara benar maka sesungguhnya Allah maha Maka sesungguhnya Allah Maha Mengetahui atas segala apa yang kamu kerjakan dan Maha memberi balasan atas perbuatan kalian. Assiddi berkata bahwa ayat ini turun untuk nabi, ketika ada si kaya dan miskin sedang bertengkar sedangkan Nabi lebih condong kepada yang miskin, dengan dasar bahwa yang miskin tidak akan menzalimi yang kaya sehingga Allah melarang untuk menjadikan dasar kaya atau miskin sebagai dasar dalam bersaksi. Maka Allah berfirman Ya ayyuhalladzina amanu kunu..."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jadilah kalian penegak} orang-orang yang menegakkan {keadilan} keadilan {dan saksi karena Allah} berlaku sebagai saksi untuk mencari ridha Allah {walaupun kesaksian itu memberatkan diri kalian sendiri} meskipun kesaksian itu memberatkan diri kalian sendiri {kedua orang tua, atau kerabat. Jika dia kaya atau miskin} Jika yang disaksikan itu kaya, maka dia tidak dijaga karena kekayaannya, dan tidak ditakuti karenanya, atau jika miskin, maka tidak dijaga karena simpati kepadanya {Allah lebih tahu tentang keduanya} lebih layak tahu tentang masing-masing dari keduanya daripada kalian {Maka janganlah kalian mengikuti hawa nafsu ketika menetapkan keadilan} karena takut menyimpang dari kebenaran. {Jika kalian memutarbalikkan} memalsukan kesaksian {atau berpaling} tidak mau memberikan kesaksian {sesungguhnya Allah Maha Mengetahui terhadap segala apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "135. Allah memerintahkan hamba-hambaNya yang beriman agar mereka menjadi “orang yang benar-benar menegakkan keadilan, menjadi saksi karena Allah,” al-Qawwam (penegak keadilan) adalah sebuah kata yang menunjukkan makna lebih (Sighah mubalagah), artinya jadilah kalian penegak keadilan dalam segala kondisi terhadap hak-hak Allah dan dan hak-hak hamba-hambaNya. Adil terhadap hak-hak Allah adalah tidak memakai nikmat-nikmatNya untuk bermaksiat kepadaNya, akan tetapi seharusnya dipergunakan dalam ketaatan kepadaNya, sedang adil terhadap hak-hak manusia adalah menunaikan segala hak-hak yang menjadi tanggung jawabmu sebagaimana engkau meminta hak-hak dirimu. Maka anda menunaikan nafkah-nafkah yang wajib dan hutang-hutang, dan bermuamalah terhadap manusia dengan akhlak dan tata karma yang Anda sendiri ingin diperlakukan dengannya, juga dengan penghargaan dan sebagainya. Di antara bentuk-bentuk keadilan yang paling agung adalah adil dalam menilai ucapan dan orang-orang yang memiliki pandangan tersebut, tidak menetapkan untuk salah satu perkataan atau salah satu dari dua orang yang berselisih hanya karena bernisbah kepadanya atau kecondongannya kepada salah satunya, akan tetapi ia harus berlaku adil di antara keduanya, dan di antara keadilan itu adalah menunaikan kesaksian yang ada padamu dalam bentuk apa pun, hingga walaupun atas orang-orang yang dicintai, bahkan atas diri sendiri, karena itulah Allah berfirman, “Menjadi saksi karena Allah biarpun terhadap dirimu sendiri atau ibu bapak dan kaum kerabatmu. jika ia kaya ataupun miskin, maka Allah lebih tahu kemaslahatannya,” maksudnya, janganlah kalian mempertimbangkan seorang yang kaya karena kekayaannya, dan seorang yang miskin dengan prasangka bahwa hal itu adalah sebagai belas kasih baginya, akan tetapi bersaksilah dengan benar atas siapa pun orangnya. Menegakkan keadilan adalah di antara perkara yang paling agung dan paling menunjukkan akan keberagaman penegak keadilan tersebut dan sikap hati-hatinya serta kedudukannya dalam Islam, maka wajiblah atas orang yang mau menasehati dirinya dan menghendaki keselamatan dirinya agar memperhatikan hal tersebut dengan sebaik-baiknya, dan selalu menjadikannya di hadapan matanya dan tujuan keinginannya, dan agar ia menghilangkan dari jiwanya segala hal yang menghalangi dan merintangi dirinya dari menegakkan keadilan atau mengamalkan keadilan tersebut, dan rintangan yang paling terbesar dalam hal itu adalah mengikuti hawa nafsu, karena itulah Allah memperingatkan agar menghilangkan rintangan tersebut dalam FirmanNya, “Maka janganlah kamu mengikuti hawa nafsu karena ingin menyimpang dari kebenaran,” yaitu janganlah kalian mengikuti syahwat diri kalian yang bertentangan dengan kebenaran, karena bila kalian mengikutinya, niscaya kalian akan menyimpang dari kebenaran dan kalian tidak diberi taufik kepada keadilan, karena sesungguhnya hawa nafsu itu akan membutakan mata hati orang tersebut hingga ia akan melihat kebenaran itu sebagai sebuah kebatilan dan kebatilan itu sebagai sebuah kebenaran, atau ia mengetahui kebenaran lalu meninggalkannya demi hawa nafsunya, maka barangsiapa yang selamat dari hawa nafsunya, niscaya ia akan diberi taufik kepada kebenaran dan akan diberi petunjuk kepada jalan yang lurus. Dan tatkala Allah menjelaskan bahwa yang wajib adalah menegakkan keadilan, Allah juga melarang dari perkara yang bertentangan dengan hal tersebut, yaitu penyimpangan lisan dari kebenaran dalam persaksian atau selainnya, dan pembelokkan kata dari kebenaran yang dimaksudkan dari segala sisinya atau dari beberapa sisinya, dan termasuk dalam hal itu adalah pembelokan kesaksian dan tidak menyempurnakannya atau penakwilan seorang saksi atas suatu hal yang lain, karena sesungguhnya ini adalah di antara bentuk penyimpangan, karena menyimpang dari kebenaran, “atau enggan menjadi saksi,” yaitu kalian meninggalkan keadilan yang ditetapkan pada kalian seperti seorang saksi yang meninggalkan kesaksiannya atau seorang hakim yang meninggalkan pengadilannya yang wajib dilakukan olehnya. “Maka sesungguhnya Allah Maha Mengetahui segala apa yang kamu kerjakan,” yaitu meliputi apa yang kalian kerjakan, mengetahui perbuatan-perbuatan kalian yang tersembunyi maupun yang Nampak, hal ini mengandung ancaman yang keras kepada orang yang menyimpang dalam berbicara atau meninggalkan yang seharusnya dikerjakan, dan yang lebih utama dan lebih patut lagi adalah orang yang menetapkan hukum dengan kebatilan atau bersaksi dengan saksi palsu, karena sesungguhnya hal tersebut adalah kejahatan yang paling besar, karena dua orang yang pertama telah meninggalkan kebenaran saja, sedang yang terakhir ini meninggalkan kebenaran dan menegakkan kebatilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 135: Hai orang-orang yang beriman! Jadilah manusia yang mendirikan keadilan, yang jadi saksi karena Allah, walaupun atas diri-diri kamu atau dua ibu-bapa (kamu) dan keluarga (kamu) yang hampir-hampir jika ia kaya atau fakir, maka Allah lebih berikan kepada mereka berdua. Lantaran itu, janganlah kamu turut hawa, sebab dikhawatiri kamu akan berpaling (dari kebenaran), karena jika kamu putar persaksian atau kamu berpaling, maka sesungguhnya adalah Allah itu amat Mengetahui"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keadilan di sini mencakup keadilan terhadap hak Allah, demikian juga keadilan terhadap hak hamba-hamba Allah. Berbuat adil terhadap hak Allah adalah dengan tidak menggunakan nikmat-Nya untuk bermaksiat kepada-Nya, bahkan menggunakannya untuk ketaaan kepada-Nya. Sedangkan keadilan terhadap hak hamba-hamba Allah adalah dengan memenuhi kewajibanmu terhadap orang lain, sebagaimana kamu menuntut hakmu. Oleh karena itu, kamu harus memberikan nafkah yang wajib kamu keluarkan, membayarkan hutang yang kamu tanggung, serta bermu'amalah dengan manusia dengan cara yang kamu suka jika kamu dimu'amalahkan seperti itu, seperti akhlak mulia, membalas jasa dsb. Di antara bentuk menegakkkan keadilan adalah bersikap adil dalam berbicara, oleh karena itu, dia tidak boleh menghukumi salah satu dari dua perkataan atau salah satu dari dua orang yang bersengketa karena ada hubungan nasab dengannya atau karena lebih cenderung kepadanya, bahkan sikapnya harus adil. Termasuk adil pula menunaikan persaksian yang diketahuinya bagaimana pun bentuknya, meskipun mengena kepada orang yang dicintainya atau bahkan mengenai dirinya sendiri. Yakni saksi yang benar. Yakni dengan mengakui kebenaran dan tidak menyembunyikannya. Oleh karena itu, jangan mempertimbangkan orang kaya karena kekayaannya dan orang miskin karena kasihan kepadanya, bahkan tetaplah kamu bersaksi terhadap kebenaran kepada siapa pun orangnya. Menegakkan keadilan termasuk perkara agung, dan yang demikian menunjukkan keadaan agama seseorang, kewara'annya dan kedudukannya dalam agama Islam. Oleh karenanya wajib bagi orang yang memperbaiki dirinya dan menginginkan keselamatan untuk memperhatikan hal ini dan menjadikannnya sebagai pusat perhatiannya serta menyingkirkan segala penghalang yang menghalanginya dari keinginan berlaku adil dan mengamalkannya. Di antara penghalang utama yang dapat menghalangi seseorang dari keadilan adalah mengikuti hawa nafsu, maka dalam ayat di atas Allah mengingatkan untuk menyingkirkan penghalang ini, Dia berfirman, \"Maka janganlah kamu mengikuti hawa nafsu karena ingin menyimpang dari kebenaran \". Hal itu, karena jika kamu mengikuti hawa nafsu, maka kamu akan menyimpang dari jalan yang benar, karena hawa nafsu biasanya membuat buta bashirah (mata hati) yang ada dalam diri seseorang sehingga ia pun melihat yang hak sebagai batil dan yang batil sebagai hak. Barang siapa yang dapat selamat dari hawa nafsunya, maka dia akan diberi taufiq kepada kebenaran dan akan ditunjuki ke jalan yang lurus. Termasuk ke dalamnya memutar balikkan fakta, tidak menyempurnakannya, saksi menta'wil kepada maksud yang lain dsb. ini semua termasuk memutar balikkan fakta. Termasuk pula jika hakim enggan memberikan keputusan terhadapnya. Oleh karena itu, Dia akan memberikan balasan kepadamu. Dalam ayat ini terdapat ancaman yang keras bagi orang yang memutar balikkan fakta atau enggan bersaksi, termasuk pula –min baab aulaa/apalagi- orang yang menghukum dengan batil atau bersaksi palsu, karena orang-orang yang sebelumnya tadi meninggalkan yang hak, adapun mereka, yakni orang yang berhukum dengan batil atau bersaksi palsu, maka dia telah meninggalkan kebenaran dan malah menegakkan yang batil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 135",
    "description": "Kalau pada ayat-ayat sebelumnya Allah memerintahkan untuk berlaku adil terhadap anak-anak yatim dan perempuan-perempuan, dalam ayat ini Allah memerintahkan berbuat adil terhadap semua manusia. Wahai orang-orang yang beriman! jadilah kamu secara sungguhsungguh penegak keadilan di antara umat manusia secara keseluruhan, menjadi saksi yang benar karena Allah, tanpa ada diskriminasi, walaupun terhadap dirimu sendiri atau terhadap orang-orang yang sangat dekat denganmu sekali pun, seperti ibu bapak dan kaum kerabatmu, janganlah jadikan hal itu sebagai penghalang bagimu untuk berbuat adil. Jika dia, yang terdakwa itu, kaya, janganlah kamu terpengaruh dengan kekayaannya, ataupun jika ia miskin, janganlah merasa iba karena kemiskinannya, maka Allah lebih tahu kemaslahatan atau kebaikannya. Maka janganlah kamu mengikuti hawa nafsu sehingga kamu memberi keputusan yang tidak adil dan menjadi saksi yang tidak benar, karena ingin menyimpang dari kebenaran. Dan jika kamu memutarbalikkan kata-kata dan fakta yang benar atau enggan menjadi saksi yang benar untuk menyatakan kebenaran dan menegakkannya, maka ketahuilah Allah mahateliti terhadap segala apa yang kamu kerjakan dalam setiap keputusan yang kamu ambil dan setiap kesaksian yang kamu berikanwahai orang-orang yang beriman! tetaplah kamu beriman kepada Allah dan rasul-Nya, nabi Muhammad, dan kepada kitab Al-Qur'an yang diturunkan kepada rasul-Nya, serta kitab-kitab yang diturunkan kepada para rasul sebelumnya. Barang siapa ingkar kepada Allah, malaikatmalaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, dan hari kemudian, maka sungguh, orang itu telah tersesat sangat jauh dari kebenaran dan petunjuk Allah."
  }
]