[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta menjalankan syariatNya, konsistenlah kalian diatas keadaan kalian berupa keimanan yang mantap kepada Allah dan rasulNya Muhammad dan dalam ketaatan kepada keduanya, dan kepada al-qur’an yang diturunkanNya kepadanya serta kepada seluruh kitab suci yang Allah turunkan kepada para rasul. Dan barangsiapa kafir kepada Allah malaikat-malaikatNya yang dimuliakan, kitab-kitabnya yang diturunkan sebagai petunjuk bagi makhluk-makhlukNya, dan para rasulNya yang Allah pilih untuk menyampaikan risalahNya, serta kepada hari akhir yang mana manusia akan bangkit dari kematian mereka untuk dihadapkan kepada Allah dan perhitungan amal hari itu,maka sungguh dia telah keluar dari agama islam dan jauh dari jalan kebenaran sejauh-jauhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "136. Wahai orang-orang yang beriman, pertahankanlah iman kalian kepada Allah dan kepada rasul-Nya, kepada Al-Qur`ān yang diturunkan kepada rasul-Nya, dan kitab-kitab yang diturunkan kepada rasul-rasul sebelumnya. Barangsiapa yang ingkar kepada Allah, malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya dan hari Kiamat, maka ia benar-benar telah menjauh dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Kemudian Allah memerintahkan hamba-hambanya yang beriman untuk menambah keimanannya agar semakin tenang dan yakin, dan membenarkan Rasulullah Muhammad sebagai penutup para nabi dan Al-quran yang diturunkan kepadanya, serta kitab-kitab yang diturunkan kepada nabi-nabi sebelumnya, karena Allah tidak membiarkan hamba-hamba-Nya di setiap zaman hidup tanpa ada petunjuk dan hidayah. Setelah Allah memerintahkan untuk beriman, kemudian Dia mengancam orang yang kafir: dan barangsiapa yang kafir terhadap Allah, para malaikat, sebagian kitab-kitab-Nya, rasul-rasul-Nya, dan hari akhir maka dia telah tersesat dari jalan yang benar yang dapat menyelamatkannya dari azab yang pedih di akhirat dan memberinya kenikmatan yang kekal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "136. ءَامِنُوا۟ بِاللهِ وَرَسُولِهِۦ (tetaplah beriman kepada Allah dan Rasul-Nya) Yakni tetaplah kalian diatas keimanan kalian dan istiqamahlah. وَالْكِتٰبِ الَّذِىٓ أَنزَلَ مِن قَبْلُ ۚ (Nya serta kitab yang Allah turunkan sebelumnya) Yakni kitab-kitab samawi. فَقَدْ ضَلَّ (maka sesungguhnya orang itu telah sesat) Yakni sesat dari jalan yang benar. ضَلٰلًۢا بَعِيدًا(sejauh-jauhnya) Maka hendaklah ia kembali ke jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "136 Wahai orang-orang yang beriman, tetaplah beriman kepada Allah dan Rasul-Nya sebagaimana firman Allah pada surat Al ahzab ayat 1 wahai Nabi bertakwalah kepada Allah, dan beriman kepada Alquran yang diturunkan kepada Nabi Muhammad, juga serta kitab yang Allah turunkan sebelumnya. Barangsiapa yang kafir, atau ingkar kepada salah satu rukun iman baik kepada malaikat-malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, dan hari kemudian, maka sesungguhnya orang itu telah sesat sejauh-jauhnya dari petunjuk dan kebenaran, maka dari itu hendaknya mereka kembali pada jalan hidayah. Ayat ini turun untuk segolongan mukmin ahli kitab. Mereka berkata kepada Rasul, kami beriman kepada engkau dan kitabmu, juga kepada Musa dan Taurat dan juga Uzair. Namun kami ingkar kepada kitab dan rasul selain itu. kemudian Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, tetaplah beriman} tetaplah atas keimanan kalian {kepada Allah, Rasul, Kitab} Al-Qur’an {yang turun kepada RasulNya, dan kitab} kitab-kitab {yang Dia turunkan sebelumnya. Siapa yang ingkar kepada Allah, para malaikatNya, kitab-kitabNya, para rasulNya, dan hari akhir sungguh dia telah tersesat sangat jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "136. Ketahuilah bahwa perintah ini bisa jadi diarahkan kepada orang yang belum masuk dalam sesuatu pun atau belum berjulukan dengan suatu pun darinya, maka perintah ini menjadi perintah untuknya agar masuk ke dalamnya, yang demikian itu adalah seperti perintah kepada orang yang belum beriman untuk beriman, seperti Firman Allah, \"Hai orang-orang yang telah diberi Al Kitab, berimanlah kamu kepada apa yang telah Kami turunkan (Al Quran) yang membenarkan Kitab yang ada pada kamu sebelum Kami mengubah muka(mu), lalu Kami putarkan ke belakang atau Kami kutuki mereka sebagaimana Kami telah mengutuki orang-orang (yang berbuat maksiat) pada hari Sabtu. Dan ketetapan Allah pasti berlaku.\" (an-NIsa:47) Atau diarahkan kepada orang yang telah masuk kedalam sesuatu, maka perintah ini menjadi perintah ini menjadi perintah untuknya agar memperbaiki apa yang didapatkan darinya atau memperoleh apa yang belum didapatkan, di antara hal itu adalah apa yang telah disebutkan oleh Allah dalam ayat ini berupa perintah untuk kaum Mukminin agar beriman, karena sesungguhnya hal itu menunjukkan suatu perintah kepada mereka dengan perkara yang memperbaiki keimanan mereka berupa keikhlasan, kejujuran, menghindari kerusakan dan bertaubat dari segala bentuk kelalaian, juga menunjukkan perintah dengan perkara yang belum ada dari seorang Mukmin berupa ilmu keimanan dan perbuatan-perbuatannya, karena setiap kali suatu nash sampai kepadanya lalu ia paham maskudnya dan meyakininya, maka hal itu adalah keimanan yang diperintahkan kepadanya. demikian juga seluruh perbuatan-perbuatan lahiriyah dan batiniyah, seluruhnya dari keimanan, sebagaimana yang ditunjukkan oleh banyak nash-nash dan telah disepakati oleh para ulama salaf umat ini, kemudian konsisten terhadap hal tersebut dan tegar di atasnya hingga maut menjemput, seperti Firman Allah, \"Hai orang-orang yang beriman, bertakwalah kepada Allah sebenar-benar takwa kepada-Nya; dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam.\" (Ali Imran:102). Dalam ayat ini, Allah memerintahkan untuk beriman kepadaNya, kepada Rasul-rasulNya, kepada al-Quran dan kitab-kitab sebelumnya. Semua itu adalah di antara keimanan yang wajib di mana seorang hamba tidaklah dikatakan beriman kecuali dengannya; beriman secara global, apabila tidak sampai kepadanya rincian tentangnya, dan beriman secara rinci bila hal bersangkutan diketahui secara rinci. Barangsiapa yang beriman dengan keimanan yang diperintahkan tersebut, sesungguhnya ia telah mendapat hidayah dan telah selamat. Barangsiapa yang kafir “kepada Allah, malaikat-malaikatNya, kitab-kitabNya, rasul-rasulNya, dan Hari kemudian, maka sungguh orang itu telah sesat sejauh-jauhnya,” yaitu, kesesatan apa lagi yang paling jauh dari kesesatan orang yang meninggalkan petunjuk yang lurus dan menempuh jalan yang menyampaikannya kepada siksa yang pedih? Ketahuilah bahwa kufur kepada sesuatu dari perkara-perkara yang disebutkan tersebut adalah seperti kufur kepada seluruhnya, karena hal itu saling berkaitan dan tidak mungkinnya keimanan kepada sebagian tanpa kepada sebagian lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 136: Dan (kepada) Kitab yang Ia telah turunkan atas Rasul-Nya dan (ke- pada) Kitab yang Ia telah turunkan lebih dahulu; karena barangsiapa tidak percaya kepada Allah dan malaikat-Nya dan kitab-kitabNya dan Rasul-rasulNya dan hari Kemudian, maka sesungguhnya sesatlah ia satu kesesatan yang jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Perlu diketahui, bahwa perintah beriman bisa tertuju kepada orang yang belum masuk dalam keimanan dan belum memiliki sifat itu, seperti perintah kepada orang yang belum beriman, \"Wahai orang-orang yang telah diberi Al Kitab, berimanlah kamu kepada apa yang telah Kami turunkan (Al Quran) yang membenarkan kitab yang ada pada kamu…dst.\" (Terj. An Nisaa': 47), bisa juga tertuju kepada orang yang sudah masuk ke dalam keimanan, maka perintah di sini untuk memperbaiki apa yang telah ada dari keimanan itu dan memunculkan apa yang belum ada, seperti pada ayat di atas, di mana Allah Subhaanahu wa Ta'aala memerintahkan kepada kaum mukmin untuk beriman. Hal ini menghendaki agar mereka memperbaiki keimanan mereka, berupa keikhlasan dan kebenarannya, serta menjauhkan imannya dari segala yang dapat merusak dan bertobat dari segala yang dapat mengurangi keimanan. Demikian juga perintah untuk mewujudkan apa yang belum ada dalam diri seorang mukmin, berupa pengetahuan keimanan dan pengamalannya. Kemudian dilanjutkan dengan istiqamah dan tetap terus di atasnya sampai wafat, sebagaimana firman Allah Ta'ala, \"Wahai orang-orang yang beriman, bertakwalah kepada Allah sebenar-benar takwa kepada-Nya; dan janganlah sekali-kali kamu mati melainkan dalam keadaan beragama Islam.\" (Terj. Ali Imran: 102). Kesesatan apa yang lebih jauh daripada kesesatan orang yang meninggalkan jalan yang lurus dan malah menempuh jalan yang mengarah kepada azab yang pedih. Perlu diketahui, bahwa mengingkari salah satu di antara yang disebutkan dalam ayat di atas sama saja mengingkari semuanya, karena adanya talazum (terikat dan tidak dapat dipisahkan yang satu dengan yang lain) dengan beriman kepada sebagiannya dan ingkar kepada sebagian yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 136",
    "description": "Wahai orang-orang yang beriman! tetaplah kamu beriman kepada Allah dan rasul-Nya, nabi Muhammad, dan kepada kitab Al-Qur'an yang diturunkan kepada rasul-Nya, serta kitab-kitab yang diturunkan kepada para rasul sebelumnya. Barang siapa ingkar kepada Allah, malaikatmalaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, dan hari kemudian, maka sungguh, orang itu telah tersesat sangat jauh dari kebenaran dan petunjuk Allah. Ayat ini secara khusus menerangkan keadaan orang-orang munafik. Sesungguhnya orang-orang yang beriman lalu kafir, kemudian beriman lagi, kemudian kafir lagi, lalu bertambah kekafirannya selamanya hingga mati dalam kekafiran, maka Allah tidak akan mengampuni mereka setelah mereka mati, dan tidak pula menunjukkan kepada mereka jalan yang lurus, yaitu jalan menuju surga."
  }
]