[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang telah memasuk dalam keimanan, kemudian mereka kembali menuju kekafiran, lalu dia kembali lagi kepada keimanan, dan kemudian meninggalkannya menuju kekafiran kembali, lantas berketetapan hati di atas kekafiran dan terus berada di atasnya, niscaya Allah tidak akan mengampuni mereka dan juga tidak menunjukan mereka kepada jalan dari jalan-jalan hidayah yang mereka akan selamat dengannya dari akibat yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "137. Sesungguhnya orang-orang yang kembali menjadi kafir setelah beriman, yaitu mereka menyatakan beriman kemudian murtad, kemudian beriman lagi, lantas murtad, dan bersikukuh mempertahankan kekafiran mereka hingga ajal menjemput mereka, niscaya Allah tidak akan mengampuni dosa-dosa mereka dan tidak akan membimbing mereka ke jalan lurus yang mengantarkan mereka kepada Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "137. Sesungguhnya keadaan orang-orang munafik selalu berganti-ganti dari keimanan menuju kekafiran, dan dari kekafiran menuju keimanan, kemudian dari keimanan kembali kepada kekafiran dan begitu seterusnya; mereka kehilangan kemampuan untuk memahami hakikat dan keutamaan keimanan. Manusia seperti mereka tidak dapat diharapkan lagi untuk mendapat petunjuk menuju kebaikan yang tidak mampu memilih hanya bermanfaat, sehingga layak bagi mereka untuk Allah jauhkan dari rahmat, keridhoan, ampunan, dan kebaikan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "137. لَّمْ يَكُنِ اللهُ لِيَغْفِرَ لَهُمْ وَلَا لِيَهْدِيَهُمْ سَبِيلًۢا (sekali-kali Allah tidak akan memberi ampunan kepada mereka, dan tidak (pula) menunjuki mereka kepada jalan yang lurus) Karena mereka jauh sekali dari keikhlasan kepada Allah dan keimanan yang benar. Dan ketidak pastian, kekufuran yang terulang-ulang, dan keingkaran yang berlarut-larut merupakan bukti bahwa mereka hanya bermain-main dengan agama, mereka tidak memiliki niat yang benar dan tujuan yang ikhlas, mereka adalah orang-orang munafik dan zindik. Apabila mereka dilihat oleh orang beriman mereka mengaku Islam, namun apabila mereka pergi mereka menunjukkan kekafiran. Ibnu Abbas berkata: “mereka tidak diampuni jika mereka tetap berada dalam kekafiran sampai meninggal”. Adapun orang kafir yang kemudian beriman dan menyucikan keimanannya serta berlepas diri dari kekafiran maka ia sungguh telah diberi hidayah oleh Allah, dan keislamannya menghapus apa yang telah lalu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "137 Sesungguhnya beberapa orang-orang munafik berada dalam kebimbangan antar kafir dan iman kemudian bertambah kekafirannya dengan memerangi rasul dan mati dalam keadaan kafir, maka sekali-kali Allah tidak akan memberi ampunan kepada mereka, dan tidak pula menunjuki mereka kepada jalan yang lurus menuju surga sebab ketetapan mereka dalam belenggu kekafiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang beriman, lalu kafir, kemudian beriman (lagi), kemudian kafir (lagi), lalu bertambah kekufurannya} mereka bersikeras pada kekufuran sampai mereka mati {Allah tidak akan mengampuni mereka dan tidak menunjukkan kepada mereka jalan} jalan menuju kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "137. Maksudnya, barangsiapa yang berulang kali terjadi kekufuran pada dirinya setelah keimanan; di mana dia mendapat petunjuk masuk Islam kemudian tersesat, melihat (kebenaran) kemudian buta, beriman kemudian kafir, dan berlanjut di atas kekufurannya bahkan kekufurannya bertambah, maka sesungguhnya ia telah jauh dari ampunan karena ia telah melakukan perkara yang merupakan penghalang terbesar yang merintanginya dalam memperoleh ampunan tersebut, sesungguhnya kekufurannya itu menjadi hukuman untuknya dan menjadi tabiat yang tidak akan lenyap darinya, sebagaimana Allah berfirman, \"Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka; dan Allah tidak memberi petunjuk kepada kaum yang fasik.\" (Ash-Shaff:5) dan \"Dan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti mereka belum pernah beriman kepadanya (Al Quran) pada permulaannya, dan Kami biarkan mereka bergelimang dalam kesesatannya yang sangat.\" (Al-An’am:110) Ayat ini menunjukkan bahwa bila kekufuran mereka tidak bertambah akan tetapi mereka kembali kepada keimanan dan meninggalkan keyakinan mereka berupa kekufuran tersebut, walaupun mereka telah berulang kali keluar dari Islam, lalu bila ketetapan tersebut dibuat untuk tindakna kekufuran, maka selain dari kekufuran seperti kemaksiatan yang tidak menyebabkan kekufuran adalah lebih utama dan lebih patut, bahwa seorang hamba bila berulang-ulang me;akukan kemaksiatan kemudian ia kembali kepada taubat, niscaya Allah akan kembali juga mengampuninya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 137: Sesungguhnya yang beriman, kemudian kufur, orang-orang remu dian beriman, kemudian kufur, kemudian beriman,kemudian kufur, kemudian bertambah kekufur- mereka, Allah tidak akan beri ampun bagi mereka dan tidak akan la tunjukkan bagi mereka satu jalan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Misalnya di samping kekafirannya, ia merendahkan Islam pula. Ada yang menafsirkan ayat di atas sebagai berikut, \"Sesungguhnya orang-orang yang beriman kepada Nabi Musa, yaitu orang-orang Yahudi, lalu kafir karena menyembah anak sapi, kemudian beriman lagi setelahnya, lalu kafir lagi kepada Nabi Isa dan bertambah lagi kekafirannya dengan Nabi Muhammad shallallahu 'alaihi wa sallam, maka Allah tidak akan mengampuni mereka selama mereka seperti itu dan tidak menunjukkan mereka jalan yang lurus.\" Yakni jauh dari taufiq dan hidayah ke jalan yang lurus. Ayat di atas juga menunjukkan bahwa jika mereka tidak bertambah kafir, bahkan kembali kepada Islam serta meninggalkan kekafirannya, maka Allah akan mengampuni mereka meskipun telah melakukan kemurtadan berkali-kali. Jika orang yang melakukan kekafiran saja seperti ini, yakni Allah akan menerima tobatnya jika dia kembali, maka terhadap dosa-dosa yang di bawahnya sudah tentu Allah akan membukakan pintu tobat kepadanya jika dia kembali bertobat, meskipun ia telah berkali-kali melakukan dosa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 137",
    "description": "Ayat ini secara khusus menerangkan keadaan orang-orang munafik. Sesungguhnya orang-orang yang beriman lalu kafir, kemudian beriman lagi, kemudian kafir lagi, lalu bertambah kekafirannya selamanya hingga mati dalam kekafiran, maka Allah tidak akan mengampuni mereka setelah mereka mati, dan tidak pula menunjukkan kepada mereka jalan yang lurus, yaitu jalan menuju surga. Sampaikanlah berita gembira sebagai ejekan dan kecaman kepada orang-orang munafik, wahai nabi Muhammad, bahwa bagi mereka di akhirat kelak siksaan yang pedih, dan bahkan mereka akan berada pada tingkat yang paling rendah, buruk, dan berat dari neraka jahanam sebagai balasan dari perbuatan mereka."
  }
]