[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kabarkanlah olehmu wahai rasul,kepada orang-orang munafik, yaitu kaum yang menampakkan keislaman secara lahir dan menyembunyikan kekafiran, bahwasanya mereka akan mendapat siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "138. Berikanlah kabar gembira -wahai Rasul- kepada orang-orang munafik yang menampakkan keimanan tetapi menyembunyikan kekafiran, bahwasanya mereka akan mendapatkan azab yang sangat menyakitkan dari sisi Allah kelak di hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "138. Kemudian Allah memerintahkan rasul-Nya untuk memberi bisyarah (kabar) kepada orang-orang munafik berupa azab yang pedih. Kata \"bisyarah\" biasanya dipakai untuk mengungkapkan kabar baik, karena kata ini diambil dari kalimat \"bisyratul wajh\" (wajah yang berseri), Namun kata ini bisa dipakai untuk mengungkapkan kabar buruk sebagai hinaan dan olok-olok."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "138. بَشِّرِ الْمُنٰفِقِينَ بِأَنَّ لَهُمْ عَذَابًا أَلِيمًا (Kabarkanlah kepada orang-orang munafik bahwa mereka akan mendapat siksaan yang pedih) Allah memerintahkan Rasul-Nya untuk memberi kabar gembira bagi mereka sebagai bentuk olokan, karena mereka tidak mendapatkan dari sisi Allah kecuali sesuatu yang tidak menyenangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "138 Kabarkanlah kepada orang-orang munafik dengan memperingatkan mereka bahwa di akhirat mereka akan mendapat siksaan yang pedih di neraka Jahannam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Berilah kabar gembira kepada orang-orang munafik bahwa sesungguhnya bagi mereka azab yang sangat pedih"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "138-139. al-Basyarah kabar gembira itu biasanya dipakai pada perkara yang baik, dan terkadang dipakai dalam perkara yang buruk dengan syarat, seperti dalam ayat ini Allah berfirman ”Kabarkanlah kepada orang-orang munafik,” yaitu orang-orang yang menampakkan Islam dan menyembunyikan kekufuran dengan kabar yang paling jelek dan paling buruk, yaitu azab yang pedih. Yang demikian itu karena mereka mencintai orang-orang kafir dan menolong mereka, membela mereka serta meninggalkan cinta dan kasih sayang kepada kepada kaum Mukminin, perkara apakah yang mendorong mereka melakukan hal tersebut? Apakah mereka mengharapkan kemuliaan dari orang-orang kafir itu? Seperti inilah kenyataan dari orang-orang munafik, prasangka mereka buruk terhadap Allah, keyakinan mereka lemah terhadap pertolongan Allah kepada kaum Mukminin, dan mereka menyaksikan beberapa faktor pendorong pada kaum kafir namun pandangan mereka pendek tentang akibat yang terjadi di balik itu, hingga membuat mereka menjadi kaum kafir sebagai penolong yang mereka banggakan dan meminta pertolongan mereka. Padahal kenyataannya adalah seluruh kemuliaan itu adalah milik Allah, dan sesungguhnya ubun-ubun para hamba ada di tangan Allah dan kehendakNya pastilah terlaksana pada mereka. Dan sesungguhnya Allah telah menjamin untuk membela agamaNya dan hamba-hambaNya yang beriman, walaupun diselingi dengan beberapa ujian dan cobaan bagi hamba-hambaNya yang beriman tersebut dan musuh berkuasa atas mereka dengan penguasaan yang bersifat sementara, karena sesungguhnya hasil akhir yang baik dan kebahagiaan itu adalah milik kaum Mukminin. Ayat ini mengandung ancaman yang besar atas tindakan menjadikan kaum kafir sebagai penolong dan pembela, dan bahwa hal seperti itu adalah di antara sifat-sifat kaum munafik, dan bahwa keimanan itu menuntut untuk mencintai kaum Mukminin dan menjadikan mereka sebagai penolong dan pembela, dan membenci kaum kafir dan memusuhi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 138: Khabarkanlah kepada orang- orang munafik itu bahwa adalah bagi mereka adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang menampakkan keislaman di luar dan menyembunyikan kekafiran di dalam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 138",
    "description": "Sampaikanlah berita gembira sebagai ejekan dan kecaman kepada orang-orang munafik, wahai nabi Muhammad, bahwa bagi mereka di akhirat kelak siksaan yang pedih, dan bahkan mereka akan berada pada tingkat yang paling rendah, buruk, dan berat dari neraka jahanam sebagai balasan dari perbuatan mereka walau mengaku beriman, mereka sebenarnya tetap dalam keadaan kufur dan menyembunyikannya. Salah satu buktinya ialah bahwa mereka adalah orang-orang yang menjadikan orang-orang kafir sebagai auliya', yakni pemimpin-pemimpin, teman-teman penolong serta pendukung meraka. Hal itu dilakukan dengan meninggalkan orang-orang mukmin, yang beriman kepada Allah dan rasul-Nya dengan iman yang mantap. Mereka seharusnya menjadikan orang mukmin itu auliya' mereka, tetapi hal itu tidak mereka lakukan. Apakah mereka, yaitu orang-orang munafik mencari kekuatan di sisi mereka, yakni orang-orang kafir untuk memberikan pertolongan dan dukungan kepada mereka' ketahuilah, wahai Muhammad dan orang-orang yang beriman, bahwa apa yang mereka lakukan itu merupakan hal yang sia-sia karena semua kekuatan itu milik Allah."
  }
]