[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang loyal kepada orang-orang kafir dan menjadikan mereka sebagai penolong-penolong bagi mereka dan meninggalkan kesetiaan kepada kaum mukminin serta tidak menginginkan jalinan kasih sayang dengan kaum mukminin. Apakah dengan cara itu mereka mencari pertolongan dan kekuatan di sisi orang-orang kafir? sesungguhnya mereka tidak punya semua itu; sebab pertolongan, kemuliaan dan kekuatan semuanya hanya milik Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "139. Azab ini dijatuhkan kepada mereka (orang-orang munafik) karena mereka menjadikan orang-orang kafir sebagai penolong dan pendukungnya, bukan orang-orang mukmin. Sungguh mengherankan bila mereka menjadikan orang-orang kafir itu sebagai penolong. Apakah mereka mengharapkan kekuatan dan perlindungan dari orang-orang kafir agar azab tersebut terangkat? Padahal kekuatan dan perlindungan itu semua hanya ada di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "139. Kemudian Allah menjelaskan sebagian sifat mereka yang layak untuk direndahkan. Orang-orang munafik itu menjadikan orang-orang kafir yang memerangi kaum muslimin sebagai kekasih dan penolong, yang tidak menjadikan kaum muslimin sebagai penolong mereka. Meskipun mereka melakukan itu demi mendapat kemenangan dan perlindungan namun sesungguhnya kemenangan dan kemuliaan adalah milik Allah yang Dia berikan kepada siapa yang Dia kehendaki, maka hendaklah mereka meminta kemuliaan itu dari Allah dengan keimanan yang benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "139. الَّذِينَ يَتَّخِذُونَ الْكٰفِرِينَ أَوْلِيَآءَ (orang-orang yang mengambil orang-orang kafir menjadi teman-teman penolong) Yakni penolong mereka dalam kekafiran dan membantu mereka dalam kesesatan. من دون المؤمنين (selain orang-orang beriman) Mereka tidak menjadikan orang-orang beriman sebagai penolong. أَيَبْتَغُونَ عِندَهُمُ الْعِزَّةَ فَإِنَّ الْعِزَّةَ لِلّٰهِ جَمِيعًا (Apakah mereka mencari kekuatan di sisi orang kafir itu? Maka sesungguhnya semua kekuatan kepunyaan Allah) Adapun izzah (kekuatan) yang berasal dari selain-Nya maka itu adalah dari curahan dan kemurahan-Nya. Makna dari izzah adalah kemenangan, kekuatan, dan keberhasilan dalam menjalankan urusan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "139 Mereka adalah orang-orang yang menjadikan orang-orang kafir menjadi teman-teman penolong dengan meninggalkan orang-orang mukmin. Apakah mereka mencari kekuatan di sisi orang kafir itu? Ini adalah suatu kesalahan, maka sesungguhnya semua kekuatan dunia dan akhirat adalah kepunyaan Allah. Dia lah yang menganugerahkan kemuliaan dengan karunia bagi para hamba yang Dia kehendaki"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menjadikan orang-orang kafir sebagai pelindung selain orang-orang mukmin. Apakah mereka mencari} apakah mereka mencari {kekuatan di sisi orang kafir itu Sesungguhnya semua kemuliaan itu} kekuatan dan kenikmatan {itu hanya milik Allah semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "138-139. al-Basyarah kabar gembira itu biasanya dipakai pada perkara yang baik, dan terkadang dipakai dalam perkara yang buruk dengan syarat, seperti dalam ayat ini Allah berfirman ”Kabarkanlah kepada orang-orang munafik,” yaitu orang-orang yang menampakkan Islam dan menyembunyikan kekufuran dengan kabar yang paling jelek dan paling buruk, yaitu azab yang pedih. Yang demikian itu karena mereka mencintai orang-orang kafir dan menolong mereka, membela mereka serta meninggalkan cinta dan kasih sayang kepada kepada kaum Mukminin, perkara apakah yang mendorong mereka melakukan hal tersebut? Apakah mereka mengharapkan kemuliaan dari orang-orang kafir itu? Seperti inilah kenyataan dari orang-orang munafik, prasangka mereka buruk terhadap Allah, keyakinan mereka lemah terhadap pertolongan Allah kepada kaum Mukminin, dan mereka menyaksikan beberapa faktor pendorong pada kaum kafir namun pandangan mereka pendek tentang akibat yang terjadi di balik itu, hingga membuat mereka menjadi kaum kafir sebagai penolong yang mereka banggakan dan meminta pertolongan mereka. Padahal kenyataannya adalah seluruh kemuliaan itu adalah milik Allah, dan sesungguhnya ubun-ubun para hamba ada di tangan Allah dan kehendakNya pastilah terlaksana pada mereka. Dan sesungguhnya Allah telah menjamin untuk membela agamaNya dan hamba-hambaNya yang beriman, walaupun diselingi dengan beberapa ujian dan cobaan bagi hamba-hambaNya yang beriman tersebut dan musuh berkuasa atas mereka dengan penguasaan yang bersifat sementara, karena sesungguhnya hasil akhir yang baik dan kebahagiaan itu adalah milik kaum Mukminin. Ayat ini mengandung ancaman yang besar atas tindakan menjadikan kaum kafir sebagai penolong dan pembela, dan bahwa hal seperti itu adalah di antara sifat-sifat kaum munafik, dan bahwa keimanan itu menuntut untuk mencintai kaum Mukminin dan menjadikan mereka sebagai penolong dan pembela, dan membenci kaum kafir dan memusuhi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 139: (Ialah yang mengambil kafir-kafir sebagai ketua, tidak Mu'minin. Apakah mereka cari kemuliaan di sisi mereka (yang kafir) itu padahal sesungguhnya sekalian kemuliaan itu adalah bagi Allah?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Inilah keadaan mereka kaum munafik, mereka bersangka buruk kepada Allah dan kurang yakin bahwa Allah akan memenangkan hamba-hamba-Nya yang mukmin, padahal kekuatan itu milik Allah semuanya, semua makhluk dalam kekuasaan-Nya, dan kehendak-Nya berlaku pada mereka. Dia menjamin akan memenangkan agama-Nya dan memenangkan hamba-hamba-Nya yang mukmin, kalau pun terkadang musuh yang menang, namun tidak selamanya, karena kemenangan terakhir akan diperoleh kaum mukmin. Dalam ayat ini terdapat ancaman memberikan wala' (loyalitas) kepada kaum kafir dan meninggalkan berwala' kepada kaum mukmin, dan bahwa yang demikian termasuk sifat orang-orang munafik, padahal keimanan yang sesungguhnya menghendaki mencintai kaum mukmin dan berwala' kepada mereka serta membenci orang-orang kafir dan memusuhi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 139",
    "description": "Walau mengaku beriman, mereka sebenarnya tetap dalam keadaan kufur dan menyembunyikannya. Salah satu buktinya ialah bahwa mereka adalah orang-orang yang menjadikan orang-orang kafir sebagai auliya', yakni pemimpin-pemimpin, teman-teman penolong serta pendukung meraka. Hal itu dilakukan dengan meninggalkan orang-orang mukmin, yang beriman kepada Allah dan rasul-Nya dengan iman yang mantap. Mereka seharusnya menjadikan orang mukmin itu auliya' mereka, tetapi hal itu tidak mereka lakukan. Apakah mereka, yaitu orang-orang munafik mencari kekuatan di sisi mereka, yakni orang-orang kafir untuk memberikan pertolongan dan dukungan kepada mereka' ketahuilah, wahai Muhammad dan orang-orang yang beriman, bahwa apa yang mereka lakukan itu merupakan hal yang sia-sia karena semua kekuatan itu milik Allah. Sungguh aneh apa yang telah mereka lakukan itu, padahal sungguh, Allah telah menurunkan ketentuan-ketentuan bagimu, wahai orang-orang yang benar-benar beriman, di dalam kitab Al-Qur'an bahwa apabila kamu mendengar ayat-ayat Allah, diingkari dan diperolok-olokkan oleh orang-orang kafir dan munafik, maka janganlah kamu duduk di tempat atau lokasi itu bersama mereka, bahkan putuskanlah pembicaraan dengan mereka, sebelum mereka memasuki pembicaraan yang lain, yaitu hal-hal yang tidak bertentangan dengan nilai-nilai islam. Karena sesungguhnya kamu, wahai orang-orang yang beriman, apabila tetap duduk bersama mereka, tentulah serupa dengan mereka dalam kekafiran dan kemunafikan. Sungguh, Allah akan mengumpulkan semua orang-orang munafik dan orang-orang kafir di neraka jahanam, sebagaimana mereka berkumpul dan bergabung dalam tujuan yang sama."
  }
]