[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa mendurhakai Allah dan rasulNYa dengan mengingkari hukum-hukum Allah dan melampaui batas yang telah disyariatkan Allah bagi hamba-hambaNYa dengan mengubah atau meninggalkan pengamalannya, niscaya DIA akan memasukkannya ke dalam neraka, dia tinggal di dalamnya, dan baginya siksaan yang menistakan dan menghinakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Barangsiapa durhaka kepada Allah dan rasul-Nya dengan mengabaikan hukum-hukum-Nya, tidak mau melaksanakannya, atau meragukannya dan melanggar batas-batas yang ditetapkan di dalam syariat-Nya, Allah akan memasukkannya ke dalam Neraka untuk tinggal di dalamnya dan menerima azab yang menghinakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. dan barangsiapa yang menyelisihi syariat Allah dan rasul-Nya, dan melanggar hukum-hukum-Nya, maka Allah akan menyiapkan baginya neraka Jahannam, ia akan kekal di dalamnya dan akan mendapat azab yang menghinakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَمَن يَعْصِ اللهَ وَرَسُولَهُۥ وَيَتَعَدَّ حُدُودَهُۥ (Dan barangsiapa yang mendurhakai Allah dan Rasul-Nya dan melanggar ketentuan-ketentuan-Nya) Yakni dengan merubah hukum-hukum ini atau dengan meninggalkan penerapannya. وَلَهُۥ عَذَابٌ مُّهِينٌ (dan baginya siksa yang menghinakan) Yang semua siksaan itu adalah kehinaan dan kerendahan. Ibnu Mas’ud berkata: Rasulullah bersabda: (belajarlah ilmu faraidh (pembagian warisan) dan ajarkanlah dia karena aku sesungguhnya akan mati, dan sungguh ilmu itu akan diangkat dan muncul berbagai fitnah, hingga ada dua orang yang berselisih dalam masalah faraidh namun tidak ada yang mampu untuk memutuskan perkara mereka)."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Semua pelaku maksiat disebut dengan jahil atau orang yang bodoh. Bisa jadi dia bodoh dan tidak mengetahui dengan buruknya apa yang dilakukan, dan bisa juga dia tidak mengetahui buruknya akibat perbuatannya tersebut bagi diri sendiri yang berupa kemurkaan Allah SWT padanya. 2 ). Ibnu Abbas berpendapat bahwa taubat pelaku maksiat diterima jika belum datang sakit ataupun maut. Lalu Ibnu Rajab meyampaikan komentarnya berkaitan dengan ayat ini: ”Ayat ini merupakan isyarat jelas bagi pelaku maksiat agar mempercepat taubatnya ketika dia masih dalam keadaan sehat segar bugar tak berpenyakit, ini lebih baik, karena di waktu itu ia bisa memperbanyak amal kebaikan guna menghapus dosa-dosanya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Dan barangsiapa melanggar perintah-perintah Allah dan rasulNya, dan melampaui batas dalam mengatur warisan dan lain-lain, sehingga tidak mau mengerjakannya atau mengganti hukum-hukum tentang hal ini, maka Allah akan memasukkannya ke dalam neraka yang abadi selama-lamanya. Dan baginya itu azab yang secara keseluruhan azab itu mengandung kehinaan, dan kerendahan. Al-Hudud di sini adalah syariat-syariat dan hukum-hukum Allah yang dibatasi untuk hamba-hambaNya supaya mereka mengerjakannya dan tidak melanggarnya. Dan batasan-batasan itu telah mengeluarkan hal-hal haram yang dilarang oleh Allah untuk mereka. Di antara itu ada batasan syariat yaitu hukumab yang telah ditentukan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang mendurhakai Allah dan RasulNya serta melanggar batas-batasNya} melampaui batas-batas dan perintah Allah {niscaya Dia akan memasukkannya ke dalam api neraka. Dia kekal di dalamnya. Baginya azab yang menghinakan} menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. ”dan barangasiapa yang mendurhakai Allah dan RasulNya” dan termasuk dalam kategori maksiat adalah kekufuran dan kemaksiatan lain yang lebih ringan darinya, sehingga tidak ada suatu syubhat pun dalam ayat itu bagi khawarij yang berpendapat bahwa pelaku-pelaku maksiat adalah kafir, karena Allah telah menyiapkan surga bagi orang-orang yang taat kepadaNya dan kepada rasulNya maka barangsiapa yang menaati Allah dengan ketaatan yang sempurna, ia akan masuk surga tanpa siksaan, dan barangsiapa yang durhaka kepada Allah dengan kedurhakaan yang sempurna dan termasuk dalam hal itu adalah kesyirikan ataupun selainnya ia akan masuk neraka dan ia kekal di dalamnya, sedangkan barangsiapa yang bercampur padanya kemaksiatan dan ketaatan maka ia memiliki penyebab pahala dan siksaan menurut apa yang ada padanya dari ketaatan dan kemaksiatan tersebut. Dan sesungguhnya sudah banyak nash nash mutawatir yang menunjukkan bahwa (ahli maksiat dari kalangan) orang-orang yang bertauhid yang melakukan ketaatan taujid tidaklah kekal dalam neraka, dan siapapun yang memilki ketauhidan maka ia menjadi penghalang baginya dari kekekalan dalam neraka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : اﻟﻌﺬاﺏ اﻟﻤﻬﻴﻦ: al ‘azdabul muhin : azab atau siksaan yang menghinakan orang yang tertimpanya dengan celaan dan hinaan serta yang semisalnya. Makna ayat : {ﻭﻣﻦ ﻳﻌﺺ اﻟﻠﻪ ﻭﺭﺳﻮﻟﻪ} “Siapa pun yang mendurhakai Allah dan Rasul-Nya” dengan melewati batas-batas itu serta pakem-pakem yang lainnya dari syariat Allah, kemudian mati dalam keadaan maksiat, maka Allah akan mencampakkannya ke dalam api neraka selamanya di dalamnya. Semoga Allah melindungi kita dari siksanya-Nya dan hukuman-Nya yang pedih. Pelajaran dari ayat : • Penjelasan ganjaran maksiat kepada Allah dan Rasul-Nya, yaitu dalam api neraka dan azab yang nista."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 14: Dan barangsiapa durhaka kepada Allah dan Rasul-Nya dan melewati batas-batas-Nya, niscaya la masukkan dia di neraka, hal kea- daan dia kekal padanya; dan ada- lah baginya 'adzab yang menghina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk ke dalam mendurhakai Allah dan rasul-Nya adalah kekafiran dan maksiat di bawahnya, oleh karenanya tidak ada alasan di ayat tersebut untuk mendukung pendapat khawarij yang mengkafirkan pelaku maksiat, karena Allah Ta'ala menjanjikan surga bagi orang yang taat kepada Allah dan Rasul-Nya, dan mengancam neraka bagi orang yang mendurhakai Allah dan Rasul-Nya. Oleh karena itu, barang siapa yang taat kepada Allah dan Rasul-Nya secara sempurna; dengan melakukan tauhid dan amal shalih di bawahnya, maka ia akan masuk ke dalam surga tanpa azab. Dan barang siapa yang mendurhakai Allah dan Rasul-Nya secara sempurna; dengan berbuat syirk dan maksiat di bawahnya, maka ia akan masuk neraka dan akan kekal di dalamnya. Namun barang siapa yang berkumpul bersamanya ketaatan dan kemaksiatan; ketaatan tidak sempurna dan kemaksiatan tidak sempurna, maka ia berhak mendapat pahala dan siksa tergantung sejauh mana ketaatan dan kemaksiatan. Nash-nash yang mutawatir menunjukkan bahwa orang-orang yang bertauhid meskipun melakukan maksiat, maka ia tidak kekal di neraka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 14",
    "description": "Dan barang siapa mendurhakai Allah dan rasul-Nya dengan melakukan perbuatan dosa, tidak menaati perintah-perintah-Nya, dan melanggar batas-batas hukum-Nya yang telah disyariatkan untuk hamba-hambanya, niscaya Allah akan membalas atas pelanggaran yang dilakukan dengan memasukkannya ke dalam api neraka yang penuh penderitaan, dia kekal abadi di dalamnya dan dia akan mendapat azab yang pedih dan menghinakan. Balasan yang mereka terima setimpal dengan tindakan mereka melecehkan ketentuan Allah dan meremehkan orang-orang yang mereka halangi hak-haknya. Setelah Allah menjelaskan peringatan bagi pelanggar ketentuan Allah terkait dengan kewarisan, selanjutnya Allah menjelaskan peringatan yang terkait dengan harga diri kaum perempuan yang mesti dijaga. Dan kamu, wahai kaum laki-laki, apabila kamu mendapati para perempuan yang melakukan perbuatan keji seperti zina atau lesbianisme di antara perempuan-perempuanmu, yakni istri-istrimu, hendaklah terhadap mereka ada empat orang saksi di antara kamu yang adil dan bisa dipercaya yang menyaksikan perbuatan mereka. Kemudian apabila mereka yakni para saksi telah memberi kesaksian dengan jelas dan tidak ada lagi keraguan terhadap kesaksian tersebut, maka kurunglah mereka yakni istri-istrimu dalam rumah tempat tinggal mereka, dan cegahlah untuk keluar rumah sampai mereka menemui ajalnya. Ketentuan tersebut sebagai pelajaran atau hukuman atas pelanggaran yang telah mereka perbuat sampai Allah memberi jalan yang lain kepadanya tentang ketetapan atau ketentuan hukum lain. Ketentuan hukum tersebut adalah hukuman had berupa dera seratus kali bagi pelaku zina gairu muhshan (lihat juga surah annur/24: 2) dan hukum rajam bagi pelaku zina yang sudah menikah (muhshan). Adapun bagi perempuan lesbian hendaknya segera bertobat dan menempuh hidup normal dengan menikahi laki-laki pilihannya."
  }
]