[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik adalah mereka yang menunggu-nunggu sesuatu yang akan menimpa kalian wahai kaum Mukminin yang berupa musibah-musibah dan peperangan. Apabila Allah menganugerahkan pada kalian bagian dari karuniaNya dan memenangkan kalian atas musuh kalian dan kalian berhasil mendapatkan harta rampasan perang mereka berkata kepada kalian, ”Bukankah kami bersama kalian dan mendukung kalian?” Dan apabila orang-orang yang mengingkari agama ini memperoleh kesempatan menang dan harta rampasan, orang-orang munafik berkata kepada orang-orang kafir, ”Bukaknkah kami telah membantu kalian dengan apa yang telah kami berikan kepada kalian dan kami melindungi kalian dari kaum MUkminin?” Allah akan megadili antara kalian dan mereka pada hari kiamat. Dan Allah tidak akan mengadakan jalan bagi orang-orang kafir untuk mengalahkan hamba-hambaNya yang shalih. Dan kesudahan bagi orang-orang yang bertakwa adalah kebaikan di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "141. Yaitu orang-orang yang menunggu-nunggu apa yang akan terjadi pada kalian, baik atau buruk. Jika kalian mendapatkan pertolongan dari Allah dan memperoleh rampasan perang, mereka berkata, “Bukankah kami bersama kalian dan menyaksikan apa yang kalian saksikan?” supaya mereka mendapatkan bagian dari rampasan perang. Dan jika orang-orang kafir mendapatkan keberuntungan, mereka (orang-orang munafik) itu berkata kepada orang-orang kafir, “Bukankah kami telah melindungi, membela dan menjaga kalian dari orang-orang mukmin dengan memberikan bantuan kepada kalian dan menelantarkan mereka?” Kelak Allah akan memberikan keputusan kepada kalian semua di hari Kiamat. Kemudian Dia akan membalas perbuatan orang-orang mukmin dengan memasukkan mereka ke dalam Surga. Dan Dia akan membalas perbuatan orang-orang munafik dengan memasukkan mereka ke dalam keraknya Neraka. Dan berkat karunia-Nya Allah tidak akan memberikan hujjah kepada orang-orang kafir terhadap orang-orang mukmin pada hari kiamat, bahkan sebaliknya Allah akan memberikan kesudahan yang baik kepada orang-orang mukmin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "141. Kemudian Allah menjelaskan beberapa keadaan orang-orang munafik tapi mereka selalu menunggu nunggu kekalahan atau kemenangan kalian. Jika Allah memberi kalian kemenangan dan penaklukan maka mereka akan mengaku termasuk golongan kalian agar dapat ikut menikmati kenikmatan dan mendapatkan harta ghanimah. Namun jika orang-orang kafir mendapat kemenangan maka orang-orang munafik tersebut akan mengaku telah menjadi penolong mereka dalam menghadapi orang-orang beriman, dengan bermalas-malasan dalam ikut berperang bersama orang-orang beriman dan mengatakan perkataan yang melemahkan semangat mereka dalam berperang. Mereka akan berkata: Akuilah bantuan kami ini kepada kalian dan berikanlah kami bagian dari harta ghanimah yang kalian dapatkan. Allah akan memutuskan perkara antara orang yang benar-benar beriman dengan orang-orang munafik yang hanya menampakkan keimanan dan menyembunyikan kekafiran mereka dengan keputusan yang adil dan sesuai dengan pahala dan siksaan masing-masing. Dia akan memberi pahala kepada para kekasihnya dan memberi siksaan bagi para musuhnya. Dan selama orang-orang beriman berpegang teguh kepada agama mereka dan mengikuti perintah dan larangan Allah serta senantiasa menyiapkan perkara-perkara yang dibutuhkan untuk membela agama, niscaya mereka tidak akan dikalahkan oleh orang-orang kafir dan berada di bawah kekuasaan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "141. الَّذِينَ يَتَرَبَّصُونَ بِكُمْ (orang-orang yang menunggu-nunggu (peristiwa) yang akan terjadi pada dirimu) Yakni menunggu-nunggu apa yang akan terjadi pada kalian baik itu kebaikan atau keburukan. فَتْحٌ مِّنَ اللهِ (kemenangan dari Allah) Kemenangan atas orang-orang kafir yang menyelisihi kalian. قَالُوٓا۟ أَلَمْ نَكُن مَّعَكُمْ (mereka berkata: “Bukankah kami beserta kamu?”) Yakni dalam keislaman dan ketaatan dalam hukum-hukum islam, maka berilah kami bagian dari ghanimah. وَإِن كَانَ لِلْكٰفِرِينَ نَصِيبٌ (Dan jika orang-orang kafir mendapat keberuntungan (kemenangan)) Yakni kemenangan atas kalian. قَالُوٓا۟( mereka berkata) Yakni berkata kepada orang-orang kafir. أَلَمْ نَسْتَحْوِذْ عَلَيْكُمْ(Bukankah kami turut memenangkanmu) Yakni “bukanlah telah kami sampaikan bahwa kami bersama kalian, akan tetapi kami masuk ke barisan orang-orang beriman untuk menakut-nakuti mereka dari kalian. وَنَمْنَعْكُم مِّنَ الْمُؤْمِنِينَ ۚ( dan membela kamu dari orang-orang mukmin?) Yakni dengan melemahkan dan menakut-nakuti mereka dari kalian agar hati mereka menjadi lemah untuk membela diri dan tidak mampu meraih kemenangan atas kalian. Dan yang dimaksud adalah mereka selalu condong kepada golongan yang menang dan menunjukkan bahwa mereka senantiasa bersama mereka melawan golongan yang kalah. Inilah keadaan orang-orang munafik. Seperti juga orang yang mengikuti jalan mereka dari sebagian orang islam yang senantiasa condong kepada orang yang memiliki harta dan jabatan, yang saat mememuinya ia akan menjilat, menunjukkan kecintaan, dan ketundukan, dan menemui orang yang tak mempunyai harta dan jabatan dengan dingin, kejam, dan akhlak yang buruk, serta melecehkan dan menghadapinya dengan segala hal yang dibenci. فَاللهُ يَحْكُمُ بَيْنَكُمْ يَوْمَ الْقِيٰمَةِ ۗ( Maka Allah akan memberi keputusan di antara kamu di hari kiamat) Pada hari ini-lah akan tersingkap kebenaran dan terlihat hati yang sesungguhnya. وَلَن يَجْعَلَ اللهُ لِلْكٰفِرِينَ عَلَى الْمُؤْمِنِينَ سَبِيلًا(dan Allah sekali-kali tidak akan memberi jalan kepada orang-orang kafir untuk memusnahkan orang-orang yang beriman) Yang dimaksud dengan (السبيل) yakni pertolongan dan kemenangan di hari kiamat, dan bukti dan alasan di dunia. Pendapat lain mengatakan maknanya bahwa Allah tidak memberi orang-orang kafir atas orang-orang beriman selama mereka menjalankan syari’at sehingga dengan itu Allah menghinakan orang-orang kafir dan munafik dan meninggikan kehormatan orang-orang beriman dengan mengangkat derajat mereka diatas orang-orang kafir dan munafik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "141 Orang-orang yang menunggu-nunggu peristiwa baik atau buruk yang akan terjadi pada dirimu, atau azab kepada kalian, maka jika kemenangan dari Allah dianugerahkan kepada kalian wahai orang mukmin berupa pertolongan atau mendapatkan harta rampasan maka mereka akan berkata: “Bukankah kami turut berperang beserta kamu dalam memperjuangkan Islam, maka berikanlah bagian kami?” Dan jika orang-orang kafir mendapat keberuntungan kemenangan mereka berkata sebagaimana yang mereka katakan pada perang Uhud, mereka berkata kepada musuh-musuh kalian orang kafir: “Bukankah kami turut memenangkanmu, dan membela kamu dari orang-orang mukmin. Namun kami tidak ikhlas melakukan itu untuk kalian. Sebab niat kami adalah menghalangi orang-orang mukmin dari kalian sampai mereka tidak mampu untuk melawan kalian” Maksudnya adalah bahwa mereka akan condong kepada pemenang. Maka Allah akan memberi keputusan di antara kamu di hari kiamat dengan adil antara orang mukmin dan munafik sehingga kebenaran akan terungkap. Dan Allah sekali-kali tidak akan memberi jalan kepada orang-orang kafir untuk memusnahkan orang-orang yang beriman selagi mereka dalam keadaan beriman dengan sungguh-sungguh, melakukan kebenaran dan perintah syariat dan tidak rela atas kebatilan. Sehingga dengan begitu derajat orang mukmin akan terangkata atas orang kafir dan munafik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menunggu-nunggu yang akan terjadi pada kalian} mereka menunggu apa yang akan terjadi pada kalian {Apabila kalian mendapat kemenangan} pertolongan dan harta rampasan {dari Allah, mereka berkata,” Bukankah Kami bersama kalian” Jika orang-orang kafir mendapat bagian} kemenangan dari peperangan {Mereka berkata “Bukankah kami turut memenangkan kalian?”} bukankah kami berpaling pada kalian dan menyertai kalian dengan bantuan dan pertolongan {membela kalian dari orang-orang mukmin”} membela kalian dari orang-orang mukmin dengan membantu kalian dan meninggalkan mereka {Allah akan memberi keputusan di antara kalian pada hari kiamat. Allah tidak akan memberi jalan} alasan {kepada orang-orang kafir untuk mengalahkan orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "141. Kemudian Allah menyebutkan penegasan perwalian orang-orang munafik kepada orang-orang kafir serta permusuhan mereka terhadap orang-orang Mukmin, maka firmaNya, “yaitu orang-orang yang menunggu peristiwa yang akan terjadi pada dirimu hai orang Mukmin,” maksudnya, mereka menunggu apa yang akan terjadi pada kalian, baik maupun buruk, dimana mereka telah menyiapkan masing-masing jawaban untuk kedua kemungkinan tersebut sesuai dengan kemunafikan mereka. “ Maka jika terjadi maka jika terjadi kemenangan dari Allah, mereka berkata, bukankah kami turut berperang beserta kamu?“ lalu mereka menampakan diri dan sikap bahwa mereka bersama kaum Mukminin secara lahir maupun batin agar mereka selamat dari celaan dan tuduhan, dan agar mereka di sertakan dalam bagian ghanimah atau fai’ serta kaum Mukminin menolong mereka. “ Dan jika orang-orang kafir dapat keberuntungan,” Allah tidak berkata , “kemenangan”, karena mereka tidaklah memperoleh kemenangan yang merupakan tonggak dasar akan pembelaan terhadap mereka yang berkelanjutan. Akan tetapi mereka mendapatkan bagian yang sementara sebagai hikmah dari Allah, maka bila demikian, “mereka berkata, “bukankah kami turut memenangkanmu\", artinya, kami membuat kalian menguasai, “dan membela kamu dari orang-orang Mumin?” Maksudnya, mereka berpura-pura pada orang-orang kafir dengan membela mereka, dan menolong mereka dari kaum Mukminin dengan segala bentuk pertolongan yang menyelamatkan mereka dari penghancuran dan pembunuhan dalam peperangan serta menampakan permusuhan dalam kaum Mukminin dan sebagainya dari perkara-perkara yang telah diketahui oleh mereka. “Maka Allah memberi keputusan di antara kamu di Hari Kiamat,” lalu Allah memberi balasan kepada kaum Mukminin secara lahit maupun batin dengan syurga, dan menyiksa orang-orang menafik laki-laki dan perempuan dan orang-orang musyirik laki-laki dan perempuan. “Dan Allah sekali-kali tidak akan memberi jalan kepada orang-orang kafir untuk memusnahkan orang-orang yang beriman,” yaitu, kekuasan dan kontrol atas mereka. Bahkan akan ada sekelompok dari kaum Mukminin yang ditolong atas kebenaran, tidaklah aka nada yang mampu memudharatkan mereka dari orang-orang yang menghinakan mereka dan tidak pula orang –orang yang bertentangan dengan mereka, dan Allah akan terus mengadakan kemenangan bagi kaum Mukminin dan menoloak kekuasaan kaum kafir, dimana semua itu di saksikan oleh mata kepala. Hingga sebagian orang Mukminin yang dikuasai oleh kelompok kaum kafir tetapi saja terhormat, mereka tidak diganggu karena agama mereka dan tidak juga mereka rendah walaupun berada di tengah-tengah orang-orang kafir; mereka tetap memiliki kemuliaan yang penuh dari Allah. Akhirnya segala pujian milik Allah, pertama dan terakhir, lahir dan batin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 141: (Mereka itu ialah) orang- orang yang menunggu-nunggu (perubahan) atas kamu, yaitu jika kamu dapat kemenangan dari Allah, mereka berkata: \"Bukankah kami beserta kamu?\" Dan jika orang- orang kafir dapat bahagian (baik), mereka berkata: \"Bukankah kami telah mengetuai kamu dan telah memalingkan kamu daripada kaum Mu'minin?\" Lantaran itu, Allah akan menghukum di antara mereka di hari Kiamat; dan Allah tidak jadikan satu jalan buat orang-orang kafir atas Mu'minin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka pun sudah menyiapkan alasan jika terjadi sesuatu yang menimpa kaum mukmin agar tidak disalahkan. dan ghanimah. Yakni sama denganmu dalam agama dan ikut berjihad. Mereka memperlihatkan, bahwa diri mereka ikut bersama kaum mukmin, baik lahir maupun batin agar tidak disalahkan, tidak dicela dan agar mereka mendapatkan ghanimah dan fai' (harta rampasan tanpa melalui peperangan). Digunakan kata \"nashiibun\" (bagian) bukan fat-h (kemenangan), karena orang-orang kafir tidak mendapatkan kemenangan yang menjadi awal untuk kemenangan selanjutnya. Kalau pun mendapatkan kemenangan, namun itu tidak selamanya. Yaitu dengan membukakan rahasia-rahasia orang mukmin dan menyampaikan hal ihwal mereka kepada orang-orang kafir, dan kalau pun mereka berperang bersama kaum mukmin, maka mereka berperang dengan tidak sepenuh hati. Dengan tidak membantu mereka dan menyampaikan kepada kaum kafir keadaan kaum mukmin atau dengan menyalahkan pendapat kaum mukmin, membuat mereka benci berperang, memberikan bantuan kepada musuh dsb. Dengan memisahkan orang-orang mukmin dan orang-orang munafik, serta memasukkan orang-orang mukmin ke dalam surga, sedangkan orang-orang munafik dimasukkan ke dalam neraka. Oleh karena itu, akan senantiasa ada segolongan kaum mukmin yang tegak di atas kebenaran meskipun mereka tidak dibantu dan banyak yang menyelisihi, dan Allah akan senantiasa mengadakan sebab kemenangan bagi kaum mukmin dan menyingkirkan kekuasaan kaum kafir terhadap kaum mukmin. Oleh karenanya, meskipun sebagian kaum muslim berada di bawah kekuasaan orang-orang kafir, namun mereka tetap dihormati, tidak direndahkan dan tidak dipermasalahkan, bahkan mereka mendapatkan kemuliaan yang sempurna dari sisi Allah, wal hamdulillah awwalan wa aakhira wa zhaahiran wa baatinan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 141",
    "description": "Orang-orang munafik yang dibicarakan pada ayat-ayat di atas adalah orang-orang yang setiap saat menunggu-nunggu peristiwa menyedihkan yang akan terjadi pada dirimu, wahai orang-orang yang beriman. Begitu konsistensinya kemunafikan mereka sehingga apabila kamu mendapat kemenangan dan pertolongan dari Allah dalam suatu peperangan melawan kaum kafir, mereka berkata, bukankah kami ikut serta dan turut berperang bersama kamu' dan jika orang kafir mendapat bagian, yaitu kemenangan dalam suatu hal dari orang-orang yang beriman, mereka berkata, bukankah kami turut memenangkanmu, dan membela kamu dari orang mukmin sehingga kamu mendapat bahagian itu' maka, ketahuilah wahai orang-orang yang beriman, bahwa Allah, yang maha mengetahui apa yang kamu lakukan dan apa yang kamu sembunyikan serta mahabijaksana dalam keputusan-Nya, akan memberi keputusan di antara kamu, wahai manusia, pada hari kiamat. Allah yang mahakuasa sekali-kali tidak akan memberi jalan kepada orang kafir di dunia ini untuk mengalahkan orang-orang beriman dan tidak pula memberi mereka sedikit pun jalan untuk menuju ke surga di akhirat nanti sesungguhnya dengan sikap dan perbuatan yang mereka lakukan seperti yang digambarkan pada ayat-ayat di atas, orang-orang munafik itu berusaha hendak menipu Allah, tetapi usaha-usaha mereka menjadi sia-sia, bahkan yang terjadi adalah sebaliknya bahwa Allah-lah yang menipu mereka dengan membiarkan mereka tetap dalam kesesatan dan penipuan mereka. Apabila mereka melaksanakan salat, baik salat-salat wajib maupun salat sunah, mereka lakukan dengan malas, yaitu mereka tidak melakukannya dengan sungguh-sungguh, tidak bersemangat, merasa sangat berat, bahkan tidak senang, karena mereka tidak merasakan nikmatnya. Kalaupun mereka melakukannya, mereka hanya bermaksud ria, ingin dilihat dan dipuji di hadapan manusia, tidak karena mengharap rida Allah dan takut akan siksaan-Nya. Dan mereka tidak mengingat Allah, yaitu salat dan zikir, kecuali di hadapan orang dan sedikit sekali, baik dari segi waktunya maupun jumlah yang dilakukannya."
  }
]