[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya cara-cara yang ditempuh orang-orang munafik merupakan bentuk tipudaya kepada Allah ,dengan apa yang mereka tampakkan dari keimanan dan apa yang mereka sembunyikan dari kekafiran mereka, lantaran persangkaan mereka bahwa hal itu akan samar bagi Allah, padahl sebenarnya Allah tengah membalas tipu daya mereka dan akan memberikan balasan kepada mereka dengan balasan yang serupa dengan amal perbuatan mereka. Dan apabila mereka, orang-orang munafik, tegak berdiri untuk mengerjakan shalat, mereka beranjak untuk mengerjakannya dalam kemalasan. Mereka hanya bertujuan riya dan sum’ah denagan shalat mereka, dan tidak mengingat-ingat dan menyebut Allah,kecuali hanya sedikit saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "142. Sesungguhnya orang-orang munafik itu menipu Allah dengan memperlihatkan keislaman dan menyembunyikan kekafiran. Padahal sesungguhnya Allah-lah yang menipu mereka. Karena Allah telah melindungi darah mereka meskipun Allah mengetahui kekafiran mereka. Dan Dia telah menyiapkan hukuman yang sangat berat bagi mereka di Akhirat. Apabila mereka berdiri untuk menunaikan salat, mereka berdiri dengan bermalas-malasan dan tidak menyukainya. Dan mereka tidak mengingat Allah kecuali hanya sendikit saja, yaitu ketika mereka berjumpa dengan orang-orang mukmin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "142. Sesungguhnya orang-orang munafik menipu Rasulullah dengan menampakkan keimanan dan menyembunyikan kekafiran mereka. Dalam ayat ini Allah mengibaratkan bahwa orang-orang munafik itu menipu Allah karena berinteraksi dengan Rasulullah dalam hal ini, sama saja dengan berinteraksi dengan Allah, dan Allah pasti akan membalas tipu daya mereka. Apabila orang-orang munafik itu hendak menjalankan shalat maka mereka akan merasa berat dan berlambat-lambat, tidak ada semangat dan rasa ingin yang mendorong mereka untuk menjalankannya; sebab mereka tidak mengharapkan pahala di akhirat dan tidak takut terhadap siksaan Allah, karena mereka tidak memiliki keimanan. Mereka hanya takut kepada manusia dan berharap agar dilihat oleh orang-orang beriman sehingga dapat dianggap sebagai golongan mereka. Dan mereka hanya menjalankan shalat sesekali saja; apabila tidak ada yang melihat mereka, maka mereka tidak menjalankan shalat; namun jika mereka bersama dengan orang banyak maka mereka akan menjalankan shalat hanya untuk riya'."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "142. إِنَّ الْمُنٰفِقِينَ يُخٰدِعُونَ اللهَ (Sesungguhnya orang-orang munafik itu menipu Allah) Dengan menunjukkan keimanan dan menyembunyikan kekafiran. وَهُوَ خٰدِعُهُمْ(dan Allah akan membalas tipuan mereka) Yakni dengan melakukan tipuan sebagaimana tipuan orang yang ingin melakukannya; dan hal itu dengan membiarkan mereka menunjukkan keislaman mereka di dunia agar harta dan darah mereka terjaga, lalu mengakhirkan siksaannya di hari akhir dan membalas tipudaya mereka dengan memasukkan mereka ke dasar neraka. وَإِذَا قَامُوٓا۟ إِلَى الصَّلَوٰةِ قَامُوا۟ كُسَالَىٰ( Dan apabila mereka berdiri untuk shalat mereka berdiri dengan malas) Mereka sholat dengan malas dan merasa berat tanpa mengharapkan pahala dan takut pada siksaan. يُرَآءُونَ(Mereka bermaksud riya) Riya’ yakni menunjukkan perbuatan baik agar dilihat orang lain, bukan untuk mentaati perintah Allah. وَلَا يَذْكُرُونَ اللهَ إِلَّا قَلِيلًا (Dan tidaklah mereka menyebut Allah kecuali sedikit sekali) Dikeluarkan oleh Imam Muslim dan Abu Dawud hadist dari Rasulullah bahwa ia menyebutkan salah satu ciri shalat orang-orang munafik dengan sabdanya: “mereka akan menunggu matahari sampai pada dua tanduk setan (hampir terbenam) lalu mereka melakukan shalat empat rakaat dengan cepat, mereka tidak berzikir kepada Allah kecuali sedikit sekali”."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Kecaman bagi orang munafiq dalam ini merupakan dalil atas wajibnya seseorang mendirikan shalat dalam keadaan \"thuma'ninah\" , menyempurnakan rukuknya, sujudnya, qiyamnya dan duduknya; karena seorang hamba tidak dapat terhindar dari kecaman dan hinaan seperti ini kecuali dengan kesempurnaan shalat dan keihlasannya untuk Allah. 2 ). Jika engkau merasa bahwa shalat yang kamu dirikan terasa berat, bahkan sekalipun itu nafilah, maka ketahuilah bahwa dalam hatimu ada nifaq; karena perasaan seperti itu hanya bagi orang-orang munafiq, yang Allah berfirman tentang mereka : { وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَىٰ } \"Dan apabila mereka berdiri untuk shalat mereka berdiri dengan malas\", dan jika kamu melihat kegembiraan dalam hatimu, ketahuilah bahwasanya itu adalah bukti kuatnya imanmu. 3 ). Sepuluh hari pertama dalam bulan dzul hijjah adalah hari-hari yang penuh dengan dzikir, takbr dan shadaqoh, serta peluang yang luas untuk kita saling berlomba-lomba memperbanyak amalan shalih, tetapi Allah menyebutkan dalam ayat-Nya tentang sifat orang munafiq : { وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا } \"Dan tidaklah mereka menyebut Allah kecuali sedikit sekali.\" dan bahwasanya mereka juga adalah : { وَلَا يُنْفِقُونَ إِلَّا وَهُمْ كَارِهُونَ } \"tidak (pula) menafkahkan (harta) mereka, melainkan dengan rasa enggan.\" maka berhati-hatilah setiap mukmin dari sifat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "142 Sesungguhnya orang-orang munafik itu menipu Allah dengan menampakkan keimanan dan menyimpan kekufuran, dan Allah akan membalas tipuan mereka. Atau akan menghukum mereka di akhirat. Dan apabila mereka berdiri untuk shalat seperti orang muslim di dunia maka mereka bermaksud menjaga keselamatan dan harta mereka saja, mereka berdiri dengan malas. Mereka bermaksud riya di hadapan manusia. Mereka tidak bermaksud menjalankan perintah agama, namun agar orang mukmin menyangka mereka beriman. Dan tidaklah mereka menyebut Allah dalam shalat mereka kecuali sedikit sekali. Itu terjadi ketika mereka terpaksa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang munafik itu hendak menipu Allah, tetapi Allah membalas tipuan mereka. Jika mereka berdiri untuk shalat, mereka melakukannya dengan malas} mereka berat hati {dan bermaksud riya di hadapan manusia. Mereka pun tidak mengingat Allah, kecuali sedikit sekali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "142. Allah memberitakan tentang orang-orang munafik yang bersipat buruk dan tanda-tanda yang jelek, dan bahwa jalan mereka adalah menipu Allah, yaitu, yaitu mereka menampakan keimanan dan menyembunyikan kekufuran dengan tindakan. Mereka mengira bahwa hal itu tidak dilihat oleh Allah danhamba-hambaNya yang lain. Padahal sebenarnya Allah-lah yang membalas tipuan mereka, karena hanya terjadinya dengan sipat dan sikap tersebut pada mereka dan konsistennya mereka padanya, itu sebenarnya tipuan terhadap diri mereka sendiri, dan tipu daya apalagi yang lebih menykitkan dari orang yang berusaha keras namun hanya menghasilkan kehinaan dan kerendahan bagi dirinya sendiri, dan tidak mendapatkan apa-apa dengan hal itu saja bahwa menunjukan pelakunya yidak berakal, di mana ia menyatukan kemaksiatan yang dipandang sebagai suatu kebaikan dan mengira bahwa hal itu adalah hasil dari akal dan tipu dayanya, dan bahwa Allah yang mengetahui keburukan yang di timbulkan oleh kebodohan dan kehinaan atas pemiliknya, dan di antara pendurtaan Allah di antara mereka adalah apa yang di sebutkan Allah dalam firmanNya, \"Pada hari ketika orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman: “Tunggulah kami supaya kami dapat mengambil sebahagian dari cahayamu”. Dikatakan (kepada mereka): “Kembalilah kamu ke belakang dan carilah sendiri cahaya (untukmu)”. Lalu diadakan di antara mereka dinding yang mempunyai pintu. Di sebelah dalamnya ada rahmat dan di sebelah luarnya dari situ ada siksa. Orang-orang munafik itu memanggil mereka (orang-orang mukmin) seraya berkata: “Bukankah kami dahulu bersama-sama dengan kamu?” Mereka menjawab: “Benar, tetapi kamu mencelakakan dirimu sendiri dan menunggu (kehancuran kami) dan kamu ragu-ragu serta ditipu oleh angan-angan kosong sehingga datanglah ketetapan Allah; dan kamu telah ditipu terhadap Allah oleh (syaitan) yang amat penipu\". (Al-Hadid : 13-14) Dan diantara sipat-sipat mereka adalah bahwa, “apabila mereka berdiri untuk shalat,” bila mereka melakukannya, yang merupakan perbuatan ketaatan yang paling agung, ”mereka berdiri dengan malas,” mereka merasa berat melakukannya dan mengerutu dalam melakukannya. Rasa malas itu tidaklah ada kecuali karena tidak adanya kehendak untuk melakukannya dalam hati mereka, dan sekiranya bukan karena hati mereka itu kosong dari keinginan kepada Allah dan kepada apa yang ada di sisiNya serta tidak ada keimanan, pastilah tidak ada rasa malas dalam diri mereka. \"mereka RIYA ingin dilihat manusia\" yaitu, inilah yang muncul sebagai rahasia diri mereka dan nilah yangmenjadi tujuan amalan mereka, ingin dilihat oleh orang lain, mereka menginginkan penglihatan manusia tertuju pada mereka sehingga mendapatkan pengagungan dan penghormatan dari mereka dan tidak ikhlas kepada Allah. Oleh karena itu \"mereka tida mengingat Allah kecuali sedikit\" karena sudah penuhnya hati mereka dengan riya, karena dzikir kepada Allah dan mendawamkannya tidak mungkin bias kecuali oleh seorang mukmin yang hatinya penuh dengan kecintaannya kepada Allah dan pengagungan kepada Nya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 142: Sesungguhnya orang-orang munafik itu menipu Allah; dan Allah (balas) menipu mereka; apabila mereka berdiri kepada shalat. berdirilah mereka dengan mereka unjuk-unjukkan malas; (amal mereka kepada) manusia; mereka tidak ingat kepada dan Allah melainkan sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menampakkan di luar sesuatu yang berbeda dengan keadaan di dalam dirinya, oleh karenanya diberlakukan kepada mereka hukum-hukum dunia berdasarkan zhahirnya. Mereka mengira bahwa hal itu tidak diketahui Allah dan tidak ditampakkan-Nya kepada hamba-hamba-Nya, padahal Allah menipu mereka, bahkan sikap mereka ini saja sebenarnya sudah menipu diri mereka sendiri, dan tipuan apa yang lebih besar daripada orang yang mengusahakan sesuatu yang merugikan dirinya. Hal itu juga menunjukkan kurangnya akal pemiliknya, di mana ia menggabung maksiat dan memandangnya baik. Termasuk tipuan-Nya kepada mereka (kaum munafik) adalah seperti yang disebutkan dalam surat Al Hadid ayat 13, \"Pada hari ketika orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman, \"Tunggulah kami supaya kami dapat mengambil sebagian dari cahayamu\". Dikatakan (kepada mereka): \"Kembalilah kamu ke belakang dan carilah sendiri cahaya (untukmu)\". lalu diadakan di antara mereka dinding yang mempunyai pintu di sebelah dalamnya ada rahmat dan di sebelah luarnya dari situ ada siksa.\" Maksudnya Alah membiarkan mereka dalam pengakuan beriman, sebab itu mereka dilayani seperti halnya orang-orang mukmin dilayani. Namun demikian, Allah telah menyediakan bagi mereka neraka sebagai pembalasan terhadap tipuan mereka itu. Padahal shalat merupakan amal ibadah yang paling utama. Rasa malas dan bosan tidaklah muncul kecuali karena hilangnya rasa cinta kepadanya di hati mereka. Jika sekiranya hati mereka rindu kepada Allah dan berharap terhadap apa yang ada di sisi-Nya, tentu tidak muncul sikap malas. Riya adalah melakukan suatu amal tidak untuk mencari keridhaan Allah tetapi untuk mencari pujian atau popularitas di masyarakat. Orang munafik melakukan shalat dengan maksud dipuji manusia, dihormati dan dimuliakan dan tidak melakukannya dengan ikhlas karena Allah Subhaanahu wa Ta'aala. Maksudnya mereka shalat hanya sesekali saja, yaitu apabila mereka berada di hadapan orang lain. Memang demikian, karena mengingat Allah tidaklah muncul kecuali dari orang mukmin yang hatinya dipenuhi rasa cinta kepada Allah dan mengagungkan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 142",
    "description": "Sesungguhnya dengan sikap dan perbuatan yang mereka lakukan seperti yang digambarkan pada ayat-ayat di atas, orang-orang munafik itu berusaha hendak menipu Allah, tetapi usaha-usaha mereka menjadi sia-sia, bahkan yang terjadi adalah sebaliknya bahwa Allah-lah yang menipu mereka dengan membiarkan mereka tetap dalam kesesatan dan penipuan mereka. Apabila mereka melaksanakan salat, baik salat-salat wajib maupun salat sunah, mereka lakukan dengan malas, yaitu mereka tidak melakukannya dengan sungguh-sungguh, tidak bersemangat, merasa sangat berat, bahkan tidak senang, karena mereka tidak merasakan nikmatnya. Kalaupun mereka melakukannya, mereka hanya bermaksud ria, ingin dilihat dan dipuji di hadapan manusia, tidak karena mengharap rida Allah dan takut akan siksaan-Nya. Dan mereka tidak mengingat Allah, yaitu salat dan zikir, kecuali di hadapan orang dan sedikit sekali, baik dari segi waktunya maupun jumlah yang dilakukannya mereka adalah orang-orang yang senantiasa dalam keadaan ragu dan bingung antara yang demikian, yaitu iman atau kafir. Mereka tidak termasuk kepada golongan ini, yaitu golongan orang-orang beriman, dan tidak pula kepada golongan itu, yaitu orang-orang kafir. Keraguan mereka disebabkan karena mereka tidak mengikuti petunjuk Allah dan memilih kesesatan. Barang siapa dibiarkan sesat oleh Allah, maka kamu, wahai Muhammad, sekali-kali tidak akan mendapatkan jalan untuk memberi petunjuk baginya."
  }
]