[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya diantara karakter orang-orang munafik adalah keragu-raguan,bimbang,dan goncang. Mereka tidak pernah tegak diatas suatu keadaan. Mereka bukan bersama kaum Mukminin dan tidak pula bersama orang-orang kafir. Dan barangsiapa yang Allah palingkan hatinya dari keimanan kepadaNya dan berpegang teguh dengan petunjukNya, maka kamu sekali-kali tidak akan mendapati baginya jalan menuju hidayah dan keyakinan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "143. Orang-orang munafik itu berada dalam kebingungan. Mereka tidak bergabung bersama orang-orang mukmin secara lahir dan batin, dan mereka tidak bersama orang-orang kafir. Tetapi secara lahiriah mereka sejalan dengan orang-orang mukmin, sedangkan secara batin mereka sejalan dengan orang-orang kafir. Barangsiapa yang disesatkan Allah, niscaya kamu -wahai Rasul- tidak akan menemukan jalan untuk memberinya petunjuk dari kesesatan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "143. Orang-orang munafik selalu terombang-ambing, terkadang mereka condong kepada orang-orang beriman dan di lain waktu mereka condong kepada orang-orang kafir. Mereka tidak pernah benar-benar bergabung dengan salah satu golongan tersebut karena mereka hanya mencari keuntungan saja, sedangkan mereka tidak mengetahui bagi golongan mana kesudahan yang baik. Apabila nampak kemenangan berada pada salah satu golongan maka mereka akan mengaku termasuk ke dalam golongan tersebut. Dan barangsiapa yang tabiatnya senantiasa tersesat dari kebenaran akibat perbuatan dan sikap yang dia lakukan, maka kamu tidak akan mampu menemukan jalan petunjuk baginya, meskipun kamu berusaha sekuat tenaga untuk meyakinkannya dengan berbagai hujjah dan dalil. Demikianlah sunatullah yang tak akan berubah dan berganti."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "143. مُّذَبْذَبِينَ بَيْنَ ذٰلِكَ (Mereka dalam keadaan ragu-ragu antara yang demikian) Yakni mereka pindah-pindah antara orang-orang beriman dan oranag-orang musyrik tanpa ada keikhlasan dalam beriman dan tidak juga berterus terang dalam kekafiran. Dalam hadist shahih dari Rasulullah beliau bersabda: perumpamaan orang munafik seperti seekor domba pinjaman bagi dua domba, kadang ke domba yang satu dan kadang ke domba yang lain sehingga ia bingung kemana akan ikut. وَمَن يُضْلِلِ اللهُ (dan barang siapa disesatkan Allah) Yakni dihinakan-Nya dan diambil taufik darinya. فَلَن تَجِدَ لَهُۥ سَبِيلًا(maka kamu sekali-kali tidak akan mendapat jalan baginya) Yakni jalan untuk mengantarkannya kepada kebanaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara sifat kemunafiqan : jika kamu dapati dirimu ragu dalam menerima hukum syari'at, maka ketahuilah bahwasanya dalam dirimu ada sifat yang tersimpan sebagaimana sifat orang-orang muafiq; karena seorang mukmin tidak akan pernah ragu dalam menerima syari'at Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "143 Mereka dalam keadaan ragu-ragu antara yang iman atau kafir,: tidak masuk kepada golongan orang-orang beriman sehingga iman mereka menjadi ikhlas dan tidak pula kepada golongan orang-orang kafir sehingga kekufuran mereka menjadi jelas. Barangsiapa yang tidak dikehendaki Allah maka kamu sekali-kali tidak akan mendapat jalan untuk memberi petunjuk dan kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka dalam keadaan ragu antara yang demikian itu} mereka ragu dan bingung antara kekufuran dan keimanan {tidak termasuk golongan (orang mukmin) ini} mereka tidak bersama orang-orang mukmin secara zhahir maupun batin {dan tidak (pula) golongan (orang kafir) itu} mereka juga tidak bersama orang-orang kafir secara zhahir maupun batin {Siapa yang dibiarkan sesat oleh Allah kamu tidak akan menemukan jalan baginya} jalan menuju hidayah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "143. “ Mereka dalam keadaan ragu-ragu antara yang demikian iman atau kafir tidak masuk kepada golongan ini orang-orang yang beriman dan tidak pula kepada golongan itu orang-orang itu.” Maksudnya mereka bimbang antara golongan orang-orang beriman dan kelompok orang-orang kafir. Mereka tidak bersama kelompok orang-orang yang beriman, lahir maupun batin dan tidak juga bersama kelompok orang-orang kafir, lahir maupun batin. Mereka memberikan batin kepada kelompok orang-orang kafir dan memberikan lahir kepada kelompok orang-orang beriman. Ini adalah kesesatan yang paling besar yang harus diperhitungkan. Karena itu Allah berfirman, “Barangsiapa yang disesatkan Allah, maka kamu sekali-kali tidak akan mendapatkan jalan untuk memberi petunuk baginya,” maksudnya, kalian tidak akan mendapat jalan lain untuk memberi petunjuk kepadanya dan tidak ada sarana untuk manyadarkan mereka untuk meninggalkan kesesatannya. Karena sesungguhnya pintu rahmat telah tertutup untuknya, dan semua berubah menjadi musibah. Sipat-sipat yang tercela ini dengan peringatan darinya, menunjukan bahwa orang-orang beriman memiliki sipat-sipat berlawanan dengan sipat-sipat yang di atas, yaitu kejujuran lahir maupun batin, serta keihklasan, dan bahwa mereka sangat diketahui dengan apa yang ada pada mereka, semangat mereka dalam shalat dan ibadah mereka serta dzikir mereka yang banyak kepada Allah. Dan bahwa mereka telah diberikan petunjuk oleh Allah dan diberikan taufikNya kepada jalan yang lurus, maka seorang yang berakal patut mengajukan dirinya diantara kedua perkara tersebut, dan memilih yang terbaik untuknya di antara kedua hal tersebut, dan hanya Allah tempat meminta pertolongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 143: Hal keadaan mereka terayun antara itu, tidak kepada mereka itu dan tidak kepada mereka ini, karena barangsiapa disesatkan oleh Allah, maka tidak akan engkau dapat satu jalan (keselamatan) baginya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka memberikan batin mereka kepada orang-orang kafir dan memberikan zhahir (laihiriah) mereka kepada kaum mukmin. Yakni kamu tidak akan menemukan cara untuk memberinya petunjuk dan tidak akan mendapatkan sarana yang dapat menghentikan kesesatannya. Hal itu, karena pintu rahmat telah tertutup baginya dan digantikan oleh hukuman. Sifat-sifat orang munafik yang disebutkan dalam ayat di atas menunjukkan bahwa kaum mukmin tidak demikian sifatnya, bahkan sebaliknya, mereka (kaum mukmin) jujur luar dan dalam serta berniat ikhlas, semangat dalam shalat dan beribadah serta banyak mengingat Allah, mereka telah ditunjuki Allah dan diberi taufik-Nya ke jalan yang lurus. Oleh karena itu, hendaknya seorang yang berakal memperhatikan keadaan dirinya, apakah sifat-sifat orang mukmin ada dalam dirinya ataukah sifat-sifat orang munafik yang ada di dalam dirinya, kemudian diperbaikinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 143",
    "description": "Mereka adalah orang-orang yang senantiasa dalam keadaan ragu dan bingung antara yang demikian, yaitu iman atau kafir. Mereka tidak termasuk kepada golongan ini, yaitu golongan orang-orang beriman, dan tidak pula kepada golongan itu, yaitu orang-orang kafir. Keraguan mereka disebabkan karena mereka tidak mengikuti petunjuk Allah dan memilih kesesatan. Barang siapa dibiarkan sesat oleh Allah, maka kamu, wahai Muhammad, sekali-kali tidak akan mendapatkan jalan untuk memberi petunjuk baginya perbuatan orang-orang munafik yang memilih orang-orang kafir sebagai auliya' mereka pada ayat di atas mendapat kecaman dari Allah. Wahai orang-orang yang beriman! janganlah kamu menjadikan orang-orang kafir sebagai auliya', yakni pemimpin-pemimpin, teman-teman penolong serta pendukung kamu, dengan meninggalkan orang-orang mukmin, yang beriman kepada Allah dan rasul-Nya dengan iman yang mantap. Maukah kamu memberi alasan yang jelas bagi Allah untuk menghukum dan menyiksamu'"
  }
]