[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta menjalankan syariatNya, janganlah kalian memberikan loyalitas kepada orang-orang yang ingkar kepada agama Allah dan kalian tinggalkan sikaf loyal dan cinta kasih kepada kaum mukminin. Apakah kalian ingin dengan cinta kalian kepada musuh-musuh kalian,untuk memberi alasan yang jelas bagi Allah atas ketidak jujuran kalian dalam keimanan kalian?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "144. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya, janganlah kalian menjadikan orang-orang yang kafir kepada Allah sebagai teman setia kalian dan mengabaikan orang-orang mukmin. Apakah dengan tindakan itu kalian ingin agar Allah memiliki alasan kuat dan jelas yang menunjukkan bahwa kalian pantas mendapatkan hukuman?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "144. Setelah Allah mengolok sikap orang-orang munafik yang selalu terombang-ambing, terkadang bersama orang-orang beriman dan di lain waktu bersama orang-orang kafir; maka kemudian Allah memperingatkan orang-orang beriman agar tidak berbuat seperti perbuatan orang-orang munafik dan melarang mereka untuk menjadikan mereka sebagai kekasih dan penolong: Apakah kalian hendak membuat hujjah yang jelas bagi Allah untuk memberi kalian siksaan ketika kalian menjadikan mereka kekasih dan penolong?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "144. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَتَّخِذُوا۟ الْكٰفِرِينَ أَوْلِيَآءَ (Hai orang-orang yang beriman, janganlah kamu mengambil orang-orang kafir menjadi wali) Yakni orang-orang istimewa kalian dan orang-orang yang kalian serahi rahasia kalian. مِن دُونِ الْمُؤْمِنِينَ (dengan meninggalkan orang-orang mukmin) Yakni meninggalkan saudara-saudara kalian dari orang-orang beriman sebagaimana yang dilakukan orang-orang munafik. أَتُرِيدُونَ أَن تَجْعَلُوا۟ لِلّٰهِ عَلَيْكُمْ سُلْطٰنًا مُّبِينًا(Inginkah kamu mengadakan alasan yang nyata bagi Allah (untuk menyiksamu)?) Yakni alasan yang jelas untuk menyiksa kalian sebab kalian menjadikan mereka para wali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "144 Hai orang-orang yang beriman, janganlah kamu menjadikan orang-orang kafir menjadi teman dekat dan penolong dengan mencintai mereka, di sisi lain dengan meninggalkan orang-orang mukmin sebagaimana yang dilakukan orang munafik. Inginkah kamu mengadakan alasan yang nyata bagi Allah atas kelemahan iman kalian sehingga kalian berhak menerima siksa sebab kalian menjadikan orang kafir sebagai penolong kalian?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, janganlah kalian menjadikan orang-orang kafir sebagai teman setia selain orang-orang mukmin. Apakah kalian ingin memberi Allah alasan yang jelas atas kalian} alasan yang jelas untuk menghukum kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "144. Tatkala Allah menyebutkan bahwa diantara sipat-sipat orang munafik itu adalah menjadikan orang-orang kafir sebagai pemimpin dan penolong dengan meninggalkan orang yang beriman, Allah melarang hamba-hambaNya yang beriman untuk menghiasi diri mereka dengan sipat yang jelek tersebut, dan melarang mereka menyerupai orang-orang munafik. Karena hal itu mengaruskan kalian ” mengadakan alasan yang nyata bagi Allah untuk menyiksamu,” Artinya hujjah yang kelas untuk menghukum kalian. Karena Allah telah mengingatkan kita dan telah mengancam kita dari hal tersebut, dan telah memberitakan tentang kemudharatannya, maka menempuh jalan tersebut setelah itu semua mengharuskan adanya hukuman. Dan pada ayat yang milia ini terdapat dalil tentang kesempurnaan keadilan Allah, dan tidaklah menyiksa seseorang sebelum ditegakan hujjah atas mereka, dan disinai ada peringatan keras dari kemaksiatan karena pelakunya telah mengadakan alasan yang nyata untuk di siksa oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 144: Hai orang-orang yang ber- iman! Janganlah kamu anggap o- rang-orang kafir itu sebagai ketua, padahal bukan dari kaum Mu'- min! Apakah kamu mau adakan satu alasan yang terang bagi Allah buat (menghukum) kamu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Wali jamaknya auliyaa, yang berarti teman yang akrab, juga berarti pelindung, penolong dan pemimpin. Setelah disebutkan sebelumnya, bahwa di antara sifat orang-orang munafik adalah menjadikan orang-orang kafir sebagai wali dengan meninggalkan kaum mukmin, maka dalam ayat di atas, Allah Subhaanahu wa Ta'aala melarang hamba-hamba-Nya yang mukmin melakukan tindakan yang sama dengan orang-orang munafik itu, dan bahwa perbuatan itu memberikan alasan yang nyata bagi Allah untuk menghukum kamu, karena Dia telah memperingatkan agar tidak melakukannya serta memberitahukan kepada kita mafsadatnya. Jika masih ditempuh juga setelah diperingatkan, maka ia layak mendapatkan hukuman. Dalam ayat ini terdapat dalil sempurnanya keadilan Allah, dan bahwa Allah tidak mengazab seseorang sebelum tegaknya hujjah. Dalam ayat ini juga terdapat peringatan dari mengerjakan maksiat, karena pelakunya sama saja memberikan alasan bagi Allah untuk menghukumnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 144",
    "description": "Perbuatan orang-orang munafik yang memilih orang-orang kafir sebagai auliya' mereka pada ayat di atas mendapat kecaman dari Allah. Wahai orang-orang yang beriman! janganlah kamu menjadikan orang-orang kafir sebagai auliya', yakni pemimpin-pemimpin, teman-teman penolong serta pendukung kamu, dengan meninggalkan orang-orang mukmin, yang beriman kepada Allah dan rasul-Nya dengan iman yang mantap. Maukah kamu memberi alasan yang jelas bagi Allah untuk menghukum dan menyiksamu' ketahuilah wahai Muhammad dan orang-orang yang beriman, bahwa sungguh, orang-orang munafik itu di akhirat kelak ditempatkan pada tingkatan yang paling bawah, paling rendah, dan paling hina dari neraka. Dan kamu, wahai Muhammad dan siapa pun, sama sekali tidak akan mendapat seorang penolong pun yang dapat memberikan pertolongan bagi mereka dari azab neraka itu."
  }
]