[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang munafik berada di tempat-tempat paling bawah dari neraka pada hari kiamat. Dan kamu wahai rasul,tidak akan mendapati penolong bagi mereka yang akan menolak dari mereka tempat kembali yang buruk itu ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "145. Sesungguhnya orang-orang munafik itu akan Allah tempatkan di kerak Neraka kelak di hari Kiamat. Dan kamu tidak akan menemukan satu penolong pun yang dapat melindungi mereka dari azab tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "145. Kemudian Allah mengabarkan kesudahan orang-orang munafik. Mereka akan berada pada derajat yang paling rendah dan dalam azab dan siksaan yang paling berat. Mereka berada dibawah orang-orang kafir karena mereka sama-sama mengingkari Allah dan memusuhi Rasulullah, dan menambahnya dengan makar, tipu daya, dan berbagai bentuk permusuhan terhadap orang-orang beriman dengan cara sembunyi-sembunyi dan tidak terasa. Mereka juga mendapat perlakuan sebagai orang Islam dan mendapatkan hak-hak sebagai orang Islam yang sebenarnya tidak layak untuk mereka dapatkan. Oleh sebab itulah mereka layak untuk mendapatkan azab yang paling berat dan mereka tidak akan mendapatkan seorang pun penolong yang dapat menyelamatkan mereka dari azab tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "145. إِنَّ الْمُنٰفِقِينَ فِى الدَّرْكِ الْأَسْفَلِ مِنَ النَّارِ (Sesungguhnya orang-orang munafik itu (ditempatkan) pada tingkatan yang paling bawah dari neraka) Makna الدرك yakni tingkatan yang mengarah turun kebawah, adapun yang mengarah keatas disebut الدرج. Menurut sebuah pendapat bahwa neraka memiliki tujuh tingkatan dan orang munafik berada dalam tingkatan yang paling bawah yakni yang disebut dengan neraka hawiyah, mereka memasukinya karena kekafiran mereka yang parah dan kesesatan mereka yang banyak. وَلَن تَجِدَ لَهُمْ نَصِيرًا(Dan kamu sekali-kali tidak akan mendapat seorang penolongpun bagi mereka) Yakni yang dapat meloloskan mereka dari dasar neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "145 Sesungguhnya pada hari kiamat orang-orang munafik itu ditempatkan pada tingkatan yang paling bawah dari neraka, yaitu Hawiyah, sebab kekufuran mereka yang sangat dan perbuatan mereka yang rusak. Dan kamu sekali-kali tidak akan mendapat seorang penolongpun yang bisa menyelamatkan mereka daari azab neraka tingkat paling bawah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang munafik itu di tingkat} tempat {paling bawah dari neraka. Kamu tidak akan mendapat seorang penolong pun bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "145. Allah memberitahukan tentang tempat kembali orang munafik yaitu bahwa mereka berada pada derajat yang paling rendah dari siksaan dan yang paling buruk kedaan hukumannya, di bawah seluruh kaum kafir. Karena mereka ini bersekutu dengan kaum kafir dalam kufur kepada Allah dan memrangi RasulNya, namun orang-orang munafik itu melebihi kaum kafir dalam konspirasi, tipu muslihat, dan kemampuan untuk mempegunakan Berbagai macam cara untuk memerangi kaum Muslimin dalam bentuk yang tidak disadari dan tidak terlihat jelas. Dan akhirnya mereka akan memperoleh semua kelebihan itu yaitu berlakunya hukum-hukum islam atas mereka dan berhaknya mereka mendapaytkan apa yang tidak di dapatkan kaum kafir. Dengan itu mereka berhak mendapatkan siksaan yang paling keras dan mereka tidak memiliki tempat untuk melarikan diri dari siksaNya dan tidak pula penolonga yang membela mereka dari sebagian siksaanNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 145: Sesungguhnya munafiqin itu ditingkatan yang paling bawah dari neraka; dan engkau tidak akan dapat bagi mereka satu penolong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal itu, karena mereka berbuat syirk kepada Allah, memerangi rasul-Nya, membuat makar dan tipu daya terhadap kaum mukmin serta melancarkan serangan kepada kaum mukmin secara diam-diam. Mereka sudah merugikan umat Islam, namun mereka disikapi oleh kaum muslim secara baik karena zhahirnya yang menampakkan keislaman. Mereka memperoleh sesuatu yang sebenarnya tidak mereka peroleh. Karena inilah mereka mendapatkan siksa yang paling keras dan tidak ada yang menolong mereka dari azab itu. Ayat ini adalah umum, mengena kepada setiap orang munafik, kecuali orang yang dikaruniakan Allah bertobat dari segala maksiat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 145",
    "description": "Ketahuilah wahai Muhammad dan orang-orang yang beriman, bahwa sungguh, orang-orang munafik itu di akhirat kelak ditempatkan pada tingkatan yang paling bawah, paling rendah, dan paling hina dari neraka. Dan kamu, wahai Muhammad dan siapa pun, sama sekali tidak akan mendapat seorang penolong pun yang dapat memberikan pertolongan bagi mereka dari azab neraka ituorang-orang munafik yang terhindar dari tempat terendah dan terhina dari neraka jahanam itu tidak lain kecuali orang-orang munafik yang bertobat, yang menyesali perbuatan mereka, meninggalkan kemunafikan, dan memohon ampun kepada Allah atas dosa-dosa dan kesalahan mereka, dan memperbaiki diri mereka dengan meninggalkan perbuatan-perbuatan dosa yang mereka lakukan sebelumnya dan kemudian meningkatkan amal-amal saleh, termasuk salat yang selama dilakukannya dengan malas dan pamrih, berpegang teguh pada agama Allah dan dengan tulus ikhlas menjalankan agama mereka karena Allah. Maka mereka itu bersama-sama orang-orang yang beriman dengan keimanan yang mantap di dalam surga dan kelak Allah akan memberikan pahala yang besar kepada orang-orang yang beriman dan juga kepada orang-orang munafik yang telah bertobat akan memperoleh ganjaran serupa."
  }
]