[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali orang-orang yang kembali kepada Allah dan bertaubat kepadaNya, serta memperbaiki apa yang telah mereka rusak dari keadaan mereka baik yang batin dan lahir mereka dan loyal kepada hamba-hambaNya yang mukminin, dan berpegangteguh terhadap agama Allah dan ikhlas kepada Allah ,maka mereka itu akan bersama kaum mukminin di dunia dan akhirat, dan Allah akan memberikan pahala yang besar kepada kaum Mukminin."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "146. Kecuali orang-orang yang kembali ke jalan Allah dengan bertaubat dari kemunafikan mereka, memperbaiki keyakinan mereka, memegang teguh janji Allah, dan melaksanakan amal perbuatan mereka secara ikhlas kepada Allah tanpa disertai unsur ria. Orang-orang yang memiliki ciri-ciri tersebut akan bergabung bersama orang-orang mukmin di dunia dan Akhirat. Dan Allah akan memberikan pahala yang sangat banyak kepada orang-orang mukmin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "136. Kemudian Allah mengabarkan bahwa azab yang berat yang disiapkan bagi orang-orang munafik tidak diperuntukkan bagi orang-orang yang telah bertaubat dari kemunafikan dan kekafiran mereka, menyesali apa yang telah mereka perbuat, dan menggantinya dengan tiga perkara: Bersungguh-sungguh dalam beramal saleh untuk membersihkan diri dari kotoran kemunafikan dengan senantiasa berbuat jujur dalam setiap perkataan dan perbuatan, menjalankan amanah dan memenuhi janji; Bersungguh-sungguh dalam bertaubat kepada Allah, mendirikan salat dengan penuh kekhusyuan dan ketundukan, senantiasa merasakan pengawasan Allah ketika sendiri maupun ketika di keramaian, berpegang teguh kepada Allah dengan menjadikan taubat dan amal sholehnya demi mendapatkan keridhaan allah, senantiasa berpegang kepada kitab Allah dan berakhlak sesuai tuntunannya, menghayati tuntunannya, mengharapkan janjinya, dan takut terhadap ancamannya, menjalankan perintahnya, dan menjauhi larangannya. Mengesakan Allah semata dan tidak menyembah selain-Nya untuk menghilangkan malapetaka atau untuk mendapatkan kebaikan dan menjadikan segala sesuatu yang berhubungan dengan agama dan ibadah hanya untuk Allah. Merekalah orang-orang yang benar-benar dan bertobat yang akan bersama dengan orang-orang beriman, sebab keimanan dan amalan mereka sama dengan orang-orang beriman, sehingga mereka dibalas dengan balasan yang sama. Allah akan memberi mereka pahala yang yang tak terkira besarnya, dan yang paling besar adalah surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "146. إِلَّا الَّذِينَ تَابُوا۟ (Kecuali orang-orang yang taubat) Yakni orang-orang munafik yang bertaubat dari kemunafikannya. وَأَصْلَحُوا۟( dan mengadakan perbaikan) Perbaikan atas pebuatan-perbuatan yang mereka rusak. وَاعْتَصَمُوا۟ بِاللهِ(dan berpegang teguh pada (agama) Allah) Yakni berpegang tegung pada-Nya dan mempercayai janji-Nya. وَأَخْلَصُوا۟ دِينَهُمْ لِلّٰهِ (dan tulus ikhlas (mengerjakan) agama mereka karena Allah) Tanpa dibarengi dengan ketaatan kepada selain-Nya. مَعَ الْمُؤْمِنِينَ ۖ (bersama-sama orang yang beriman) Yakni dalam hukum-hukum di dunia dan di akhirat. وَسَوْفَ يُؤْتِ اللهُ الْمُؤْمِنِينَ أَجْرًا عَظِيمًا (dan kelak Allah akan memberikan kepada orang-orang yang beriman pahala yang besar) Disini Allah menjelaskan apa yang disiapkan-Nya bagi orang-orang yang beriman dan orang-orang munafik yang bertaubat. Bagi mereka pahala yang sama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "146 Namun orang-orang yang taubat dari perbuatan munafik dan mengadakan perbaikan atas keburukan keadaan mereka, dan berpegang teguh pada agama Allah serta memenuhi janji kepada-Nya, dan tulus ikhlas mengerjakan agama mereka karena Allah bukan karena riya, maka mereka itu akan bersama-sama orang yang beriman dan kelak Allah akan memberikan kepada orang-orang yang beriman pahala yang besar. Seperti itulah keadaan orang yang taubat dari perbuatan munafik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Melindungi dari azab {Kecuali orang-orang yang bertaubat, memperbaiki diri, berpegang teguh pada Allah} berpegang teguh dengan janji Allah {dan ikhlas pada agama mereka karena Allah, mereka itu bersama orang-orang mukmin. Allah akan memberi orang-orang mukmin pahala} pahala {yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "146. ini umum bagi setiap orang munafik kecuali orang-orang yang di berikan oleh Allah karunia atas mereka dengan penerimaan taubat dari kesalahan dan dosa, ”dan mengadakan perbaikan,” karena Allah, lahir maupun batin, berpegang teguh dengaNya, besandar kepadaNya demi memperoleh manfaat untuk mereka dan menolak mudharat menimpa mereka , “dan tuls ihklasa mengerjakan agama mereka,” yaitu, islam, iman, ihsan karena Allah. Mereka mngharapkan wajah Allah dengan amal mereka, yang lahir maupun yang batin, terelpas dari riya dan kemunafikan. Barang siapa yang memiliki sipat tersebut, “maka mereka itu bersama orang-orang yang beriman,” yaitu, didunia, di alam barzahk, dan pada Hari Kiamat. “Dan kelak Allah akan memberikan kepada orang-orang yang beriman pahala yang besar,” yang tidak ada yang mengetahui besarnya seperti apa kecuali Allah, yaitu balasan baik yang tidak pernah dilihat oleh mata, tidak didengar oleh telinga, dan tidak pernah terbetik pada sanubari seorang manausia pun. Perhatikanlah bagaimana Allah menghususkan kata “berpegang teguh” dan “ikhlas” dan menyebutkan secara tersendiri, padahal hal itu termasuk dalam FirmanNya, “ Dan mengadakan perbaikan,” karena berpegang teguh dan ikhlas itu bagian dari perbaikan, dan keduanya sangat di butuhkan sekali, khusus pada kondisi sulit seperti itu, di mana hati kemungkinan telah dikuasai kemunafikan. Maka tidaklah akan menghilangkannya kecuali dengan berpegang teguh kapada Allah dan konsisten dalam bersandar kepadaNya serta konsisten dalam berharap kepadaNya demi menoloak kemunafikan tersebut, dan kaihklasan itu benar-benar dapat menghilangkan kemunafikan. Allah menyebutkan kedua hal itu karena keutamaan keduanya dan karena kebutuhan yang sangat kepada kedua hal itu pada kondisi seperti ini. Perhatikanlah ketika Allah menyebutkan bahwa mereka bersama kaum Mukminin. Allah tidak mengatakan bahwa dia kan memberikan pahala yang besar kepada mereka, padahal konteks ayat ini adalah untuk mereka, namun Allah berfirman, “Dan kelak Allah akan memberikan kepada orang-orang yang beriman pahala yang besar,” karena kaidah yang mulia ini akan Allah tampakan padanya dan selalu mengulangi konteksnya pada beberapa bagian-bagain kecil, lalu Allah menghendaki siksa atau pahala darinya, dan hal itu menjadi suatu yang di terima bersama antara ia denagn jenis yang termasuk di dalamnya. Allah menyiapkna pahalan sebagai balasan dari suatu ketetapan yang umum yang meliputi masalah tersebut atau masalah lainnya, agar tidak dimperkirakan adanya penghususan hukum dengan perintah yang parsial. Ini adalah di antara rahasia-rahasia Al-Qur’an yang indah; maka orang-orang yang bertaubat dari orang-orang munafik aka bersama kaum Mukmini dan mendapatkan pahala seperti pahala mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 146: Kecuali mereka yang taubat dan betul-betulkan (kesalahan-ke- salahan) (agama) Allah dan ikhlaskan agama mereka karena mereka ini beserta Mu'minin; dan Allah akan beri kepada Mu'minin ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari kemunafikan. Memperbaiki diri berarti mengerjakan perbuatan-perbuatan yang baik untuk menghilangkan akibat-akibat yang jelek dari kesalahan-kesalahan yang dilakukan. Yakni membersihkan amalan mereka dari riya' dan kemunafikan. Disebutkan kata \"berpegang teguh kepada Allah dan berbuat ikhlas\" setelah kata memperbaiki diri meskipun sudah cukup dengan kata-kata \"memperbaiki diri\" adalah karena pentingnya masalah tersebut, khususnya dalam usaha membersihkan diri dari nifak. Oleh karenanya, kemunafikan sangat sulit disingkirkan kecuali dengan benar-benar berpegang teguh kepada Allah, kembali dan meminta kepada-Nya agar disingkirkan serta berbuat ikhlas. Baik ketika di dunia, di alam barzakh maupun di hari kiamat. Yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 146",
    "description": "Orang-orang munafik yang terhindar dari tempat terendah dan terhina dari neraka jahanam itu tidak lain kecuali orang-orang munafik yang bertobat, yang menyesali perbuatan mereka, meninggalkan kemunafikan, dan memohon ampun kepada Allah atas dosa-dosa dan kesalahan mereka, dan memperbaiki diri mereka dengan meninggalkan perbuatan-perbuatan dosa yang mereka lakukan sebelumnya dan kemudian meningkatkan amal-amal saleh, termasuk salat yang selama dilakukannya dengan malas dan pamrih, berpegang teguh pada agama Allah dan dengan tulus ikhlas menjalankan agama mereka karena Allah. Maka mereka itu bersama-sama orang-orang yang beriman dengan keimanan yang mantap di dalam surga dan kelak Allah akan memberikan pahala yang besar kepada orang-orang yang beriman dan juga kepada orang-orang munafik yang telah bertobat akan memperoleh ganjaran serupaapa yang dilakukan, yaitu apa manfaat yang Allah dapatkan dengan memberikan hukuman dan siksaan terhadap kamu, jika kamu bersyukur dan beriman kepada-Nya' sama sekali tidak ada. Dan Allah selamanya, dari dahulu hingga kini dan masa akan datang, maha mensyukuri orangorang yang beriman dan beramal saleh dan memberi ganjaran kepada mereka, maha mengetahui apa yang mereka lakukan dan yang tersimpan di dalam hati mereka."
  }
]