[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak akan menyiksa kalian,bila kalian melakukan perbaikan amalan dan beriman kepada Allah dan rasulNya. Sesunguhnya Allah maha kaya,tidak membutuhkan selainNya. Dia hanya menyiksa hamba-hamba karena perbuatan dosa-dosa mereka saja. Dan Allah maha mensyukuri terhadap hamba-hambaNya atas ketaatan mereka kepadaNya juga maha mengetahui segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "147. Allah tidak akan menghukum kalian jika kalian mau bersyukur dan beriman kepada-Nya. Karena Allah -Ta'ālā- Mahabaik lagi Maha penyayang. Dia hanya menghukum kalian karena dosa-dosa kalian. Maka jikalau kalian memperbaiki amal perbuatan kalian, mensyukuri nikmat-nikmat-Nya, dan beriman kepada-Nya secara lahir dan batin, Dia tidak akan menghukum kalian. Allah Maha Mensyukuri orang yang mau mengakui nikmat-nikmat-Nya, sehingga akan memberi pahala berlimpah kepada mereka atas amalan tersebut, lagi Maha Mengetahui keimanan makhluk-Nya. Dan Dia akan memberikan balasan yang setimpal kepada setiap orang menurut amalnya masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "147. Kemudian Allah menjelaskan bahwa mereka diazab akibat kekafiran mereka terhadap kenikmatan Allah. Dia menjelaskan bahwa dia tidak mengazab seorang hamba karena ingin membalas dendam, mengharap manfaat, atau menjauhkan diri dari mudharat; sebab Dia tidak butuh terhadap makhluk-Nya, tidak perlu mengharapkan manfaat, atau menjauhkan diri dari mudharat. Seandainya mereka beriman dan bersyukur niscaya jiwa mereka akan bersih sehingga akan nampak akibat baiknya pada akal dan seluruh amal mereka yang akan berimbas baik bagi kehidupan mereka di dunia dan di akhirat, dan mereka akan berhak mendapatkan keridhaan dari Allah yang menjadikan pahala orang-orang beriman dan bersyukur sesuai dengan ilmu-Nya terhadap keadaan mereka. Mereka mendapatkan derajat lebih dari yang layak mereka dapatkan sebagai balasan atas rasa syukur dan keimanan mereka. Dan Allah memberi pahala sebagai balasan atas ketaatan yang kecil dan mengaruniakan kenikmatan yang tiada batas di akhirat atas amalan yang hanya sebentar saja."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "147. مَّا يَفْعَلُ اللهُ بِعَذَابِكُمْ إِن شَكَرْتُمْ وَءَامَنتُمْ ۚ (Mengapa Allah akan menyiksamu, jika kamu bersyukur dan beriman?) Yakni manfaat apa yang didapatkan Allah ketika mengazab kalian jika kalian adalah orang-orang yang bersyukur dan beriman; hal itu sama sekali tidak menambah kekuasaan-Nya. Sebagaimana tidak mengazab kalian juga tidak mengurangi sedikitpun kekuasaan-Nya. Adapun azab yang diberikan kepada orang-orang yang bermaksiat adalah sebagai bentuk balasan. Dalam ayat ini terdapat kelembutan ajakan bagi orang-orang munafik untuk memperbaiki diri mereka. وَكَانَ اللهُ شَاكِرًا عَلِيمًا(Dan Allah adalah Maha Mensyukuri lagi Maha Mengetahui) Yakni mensyukuri hamba-hamba-Nya yang mentaati-Nya dengan memberi mereka pahala dan menerima amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "147 Apa manfaat yang Allah dapatkan dari menyiksamu? Jika kamu bersyukur atas nikmat-Nya, dan beriman atas apa yang Dia turunkan kepada rasul-Nya, maka Allah Maha bersyukur atas ketaatan hamba-Nya, Allah Maha Menerima yang sedikit dan Maha memberi pahala yang banyak, lagi Maha Mengetahui atas segala amal dan juga Maha memberi balasan atas amal tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak akan memberikan} menciptakan {siksaan untuk kalian jika kalian bersyukur dan beriman. Allah Maha Mensyukuri lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "147. Kemudian Allah mengabarkan tetang kesempurnaan kekayaanNya dan luasNya kasih sayangNya, rahmatNya dan kebaikanNya dalam FirmanNya, “Mengapa Allah akan menyiksaMu, jika kamu bersyukur dan beriamn?” Dan kenyataanNya bahwa Allah Maha Mensyukuri lagi Maha Mengetahui., Dia memberi pahala yang banyak dan kebaikan yang luas kepada orang-orang yang bersabar meanggung beban berat karenaNya dan orang-orang yang tekun beramal. Barangsiapa yang meninggalkan sesuatu karena Allah ,niscaya Allah akan memberi hal yang terbaik darinya. Di samping itu Allah Maha Mengetahui lahiriah kalian. Dan Allah menghendaki agar kalian bertaubat, berserah diri, dan kembali kepadaNya, lalu bagaimana mungkin Allah akan menhyiksa kalian? Karena sesungguhnya Allah tidaklah mengambil balas dengan menyiksa kalian dan tidak mengambil manfaat dengan menghukum kalian. Akan tetapi seseorang yang bermaksiat tidaklah melakukan kemudharata kecuali untuk dirinya sendiri, sedang syukur itu adalah ketundukan hati, disyukuri, perbuatan anggota tubuh dan ketaatan kepadaNya, dan tidak menggunakan kenikmatan dariNya untuk bermaksiat kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 147: 147-148. Bukankah Allah tidak akan mengadzab kamu, jika kamu syukur dan beriman? Karena Allah itu Pembalas terima kasih, Pengetahui. Allah tidak suka kepada per- kataan jelek yang diperdengarkan, kecuali (dari) orang yang teraniaya, karena Allah itu Pendengar, Pengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syukur artinya tunduknya hati dan pengakuannya terhadap nikmat Allah, lisan memuji Allah dan anggota badan mengerjakan ketaatan kepada Allah, serta tidak menggunakan nikmat-Nya untuk bermaksiat. Allah mensyukuri hamba-hamba-Nya dengan memberi pahala terhadap amal-amal hamba-Nya, memaafkan kesalahannya dan menambah nikmat-Nya. Oleh karena itu, barang siapa yang meninggalkan sesuatu karena Allah, maka Allah akan memberikan ganti yang lebih baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 147",
    "description": "Apa yang dilakukan, yaitu apa manfaat yang Allah dapatkan dengan memberikan hukuman dan siksaan terhadap kamu, jika kamu bersyukur dan beriman kepada-Nya' sama sekali tidak ada. Dan Allah selamanya, dari dahulu hingga kini dan masa akan datang, maha mensyukuri orangorang yang beriman dan beramal saleh dan memberi ganjaran kepada mereka, maha mengetahui apa yang mereka lakukan dan yang tersimpan di dalam hati merekapada ayat sebelumnya Allah menerangkan orang-orang munafik dan keburukan sifat mereka. Uraian itu dapat menimbulkan kebencian dan mengundang caci maki dari kalangan kaum muslim. Maka ayat ini memberikan tuntunan kepada kaum muslim terkait dengan kata-kata yang buruk. Allah tidak menyukai perkataan buruk yang diucapkan secara terus terang, kecuali diucapkan secara terpaksa oleh orang yang dizalimi; dalam keadaan itu dibenarkan baginya mengucapkannya dalam batasbatas tertentu. Dan Allah maha mendengar, ucapan yang baik maupun yang buruk, yang diucapkan secara rahasia maupun terang-terangan, lagi maha mengetahui, segala sesuatu yang diperbuat hamba-Nya."
  }
]