[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak menyukai sesorang yang mengeraskan suara dengan ucapan yang buruk. Akan tetapi,diperbolehkan bagi orang yang terzhalimi untuk menyebut orang yang menganiayanya dengan tindakan keburukan yang ada padanya untuk menjelaskan bentuk kezhalimannya. Dan Allah Maha Mendengar ucapan yang kalian keraskan lagi Maha Mengetahui ucapan yang kalian sembunyikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "148. Allah tidak menyukai ucapan buruk yang disiarkan secara terbuka, bahkan Dia membencinya dan mengancam pelakunya. Akan tetapi orang yang dizalimi boleh mengucapkan kata-kata yang buruk secara terbuka untuk mengadukan orang yang menzaliminya, atau mengutuknya, atau membalasnya dengan ucapan yang serupa. Namun kesabaran dari orang yang dizhalimi lebih baik daripada mengeluarkan ucapan yang buruk secara terbuka. Dan Allah Maha Mendengar ucapan kalian lagi Maha Mengetahui niat kalian. Maka hindarilah ucapan yang buruk atau niat yang buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "148. Setelah Allah mengolok-olok para musuh agama melalui ayat-ayat yang telah lalu dalam surat ini dan membongkar tipu daya mereka, kemudian Allah menjelaskan kepada hamba-hamba-Nya yang beriman bahwa tidak mengapa untuk menyebutkan kezaliman orang yang zalim dan membongkar tipu daya orang yang membuat tipu daya, demi menghindari keburukan, mengambil kewaspadaan, dan melawan kezaliman. Berterus terang dan membongkar perkataan buruk yang merupakan salah satu akhlak buruk yang dilarang oleh agama kita merupakan perbuatan yang tidak disukai Allah yang tidak diharapkan ada pada diri hamba-Nya yang beriman, dan Dia tidak mengizinkan perbuatan itu dilakukan kecuali oleh orang yang terpaksa melakukannya demi menghentikan kezaliman, melawan orang yang zalim, atau menuntut hak yang dirampas; namun hal ini harus tetap dalam batasan yang diperbolehkan oleh syariat sebagai bentuk rahmat dan keadilan bagi hamba-hamba-Nya. Maka janganlah orang yang terzalimi berlebih-lebihan dalam mengungkapkannya, melanggar batasan syariat, serta berlebih-lebihan dalam menuntut hak dan membalas dendam. Dan hendaklah seorang hamba takut terhadap Tuhannya karena Dia Maha Mendengar setiap perkataan dan Maha Mengetahui segala rahasia dan perbuatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "148. لَّا يُحِبُّ اللهُ الْجَهْرَ بِالسُّوٓءِ مِنَ الْقَوْلِ (Allah tidak menyukai ucapan buruk, (yang diucapkan) dengan terus terang) Seperti ucapan hinaan dan caci maki meski yang kita hinakan itu merupakan hal yang benar. إِلَّا مَن ظُلِمَ ۚ (kecuali oleh orang yang dianiaya) Yakni orang yang dizalimi maka boleh baginya untuk berkata aku telah dizalimi si fulan. Pendapat lain mengatakan bahwa dia boleh untuk mendoakan keburukan atas orang yang menzaliminya dan mengatakan fulan telah menzalimiku atau fulan adalah orang yang zalim. Dibolehkan bagi yang dizalimi untuk mengatakan keburukan orang yang menzaliminya. Dalam hadist yang shahih disebutkan: “menunda-nunda pembayaran hutang padahal ia memiliki uang adalah kezaliman, dibolehkan untuk mengolok kehormatannya dan menghukumnya”. Namun orang yang terzalimi tidak boleh mengungkapkan lebih dari apa yang menjadi haknya, jika ia melakukan itu maka ia termasuk orang yang aniaya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "148 Allah tidak menyukai ucapan buruk, yang diucapkan dengan terus terang seperti cacian dan hinaan, Allah akan menghukum perbuatan itu. Namun untuk orang yang dianiaya maka dia hendaknya mengatakan kepada hakim atau orang yang mempunyai kekuasaan: Aku telah dizalimi oleh seseorang. Ini untuk memungkinkan mencegah kezaliman dan memenuhi haknya. Allah Maha Mendengar atas keluh kesah orang yang terzalimi, lagi Maha Mengetahui atas kezaliman orang-orang zalim, dan Maha Memberi hukuman kepada mereka. Mujahid berkata: Ada seorang yang bertamu kepada suatu kaum, kemudian kaum itu menzaliminya, kemudian dia mengadu atas kezaliman itu. Lalu turunlah ayat ini sebagai kemurahan untuk pengaduan atas kezaliman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak menyukai terang-terangan dalam perkataan buruk, kecuali keluar dari orang yang dizalimi} tetapi orang yang dizalimi, maka dia boleh secara-terang-terangan mengeluh, mengeluhkan orang yang menzaliminya, dan mendoakannya {Allah Maha Mendengar lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "148. Allah mengabarkan bahwa Dia tidak menyukai perkataan buruk yang di ucapkan dengan terang-terangan, artinya, Allah membencinya, Allah melaknatnya, dan menyiapkan hukuman atasnya. Termasuk didalamnya adalah seluruh perkataan yang buruk yang menjelekan dan menyedihkan, seperti celaan, tuduham, umpatan, dan semacamnya. Semua itu adalah diantara hala-hal yang dilarang yang sangat di benci oleh Allah. Pemahaman terbalik dari ayat ini adalah Allah menyukai perkataan yang baik, seperti dzikir dan perkataan yang baik lagi lembut. Dan FirmanNya, “kecuali oleh orang-orang yang dianiaya,’ maksudnya, ia mengadukan kezhalimanNya, dan terang-terangan menyampaikan perkara jelek kepada orang-orang yang melantangkan perkataan jelek kepadanya tanpa ia dusta atasnya, dan tidak pula melebihi dari kezhaliman yang yang dirasakanNya, dan tidak pula melebihi celaanya itu kepada selain orang yang telah menzhalimainya. Namun demikian, tindakannya untuk memaafkan dan tidak membalasnya adalah lebih utama sebagaimana dalam FirmanNya \"barang siapa yang memaafkan dan berbuat baik maka pahalanya oleh Allah\" (asy-syu’ara:40). \"Dan Allah Maha mendengar lagi Maha Mengetahui\" Ketika ayat ini mencaku semua perkataan yang buruk, yang baik dan yang mubah, Allah memberitahukan bahwa Dia Maha mendengar sehingga mendengar semua ucapan-ucapan kalian, maka wasapadalah dari berucap dengan ucapan yang dimurkai Allah yang menyebabkan kalian dihukum gara-gara ucapan itu, dalam ayat ini juga terdapat satu dorongan untuk berucap yang baik, Allah maha mengetahui segala niat-niat kalian dan dasar ucapan-ucapan kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 148: 147-148. Bukankah Allah tidak akan mengadzab kamu, jika kamu syukur dan beriman? Karena Allah itu Pembalas terima kasih, Pengetahui. Allah tidak suka kepada per- kataan jelek yang diperdengarkan, kecuali (dari) orang yang teraniaya, karena Allah itu Pendengar, Pengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dia membenci, murka dan akan menghukum pelakunya. Perkataan buruk misalnya mencela orang, memaki, menuduh, menerangkan keburukan-keburukan orang lain, menyinggung perasaan seseorang, dan sebagainya. Mafhum ayat di atas menunjukkan bahwa Allah menyukai perkataan yang baik, seperti dzikr, kata-kata yang baik dan lembut, dsb. Dengan mengemukakan kepada hakim atau penguasa keburukan-keburukan orang yang menzaliminya tanpa berdusta, menambah-nambah dan tidak sampai menyalahkan orang yang tidak berbuat zalim. Namun demikian, memaafkannya dan tidak membalasnya lebih utama. Karena ayat di atas membicarakan tentang perkataan yang buruk, demikian juga termasuk perkataan yang baik dan yang mubah, maka Allah Subhaanahu wa Ta'aala memberitahukan bahwa Dia Maha Mendengar, Dia mendengar perkataan kamu, oleh karena itu, berhati-hatilah kamu dari berkata-kata yang dapat membuat Tuhanmu benci sehingga kamu diberi hukuman. Dalam ayat ini juga terdapat dorongan untuk berkata-kata yang baik. Dia mengetahui niatmu dan sebab keluar perkataan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 148",
    "description": "Pada ayat sebelumnya Allah menerangkan orang-orang munafik dan keburukan sifat mereka. Uraian itu dapat menimbulkan kebencian dan mengundang caci maki dari kalangan kaum muslim. Maka ayat ini memberikan tuntunan kepada kaum muslim terkait dengan kata-kata yang buruk. Allah tidak menyukai perkataan buruk yang diucapkan secara terus terang, kecuali diucapkan secara terpaksa oleh orang yang dizalimi; dalam keadaan itu dibenarkan baginya mengucapkannya dalam batasbatas tertentu. Dan Allah maha mendengar, ucapan yang baik maupun yang buruk, yang diucapkan secara rahasia maupun terang-terangan, lagi maha mengetahui, segala sesuatu yang diperbuat hamba-Nya. Jika kamu menyatakan suatu kebajikan sehingga diketahui orang lain, atau menyembunyikannya sehingga tidak ada yang mengetahuinya kecuali Allah, atau memaafkan sesuatu kesalahan orang lain padahal engkau mampu membalasnya, maka sungguh Allah akan memaafkan kesalahan kamu, sebab dia maha pemaaf, mahakuasa."
  }
]