[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengajak untuk memberikan maaf dan mengawali ajakan itu dengan menyebut bahwa seorang Mukmin kadang menampakkan kebaikannya atau menyembunyikannya. Begitu pula sikapnya terhadap perbuatan yang buruk, dia kadang memperlihatkannya ketika meminta keadlian dari pelaku keburukan,atau memberi maaf dan berlapang dada. Dan memberikan maaf itu lebih baik. Sesungguhnya diantara sifat Allah adalah pemaaf terhadap hamba-hambaNya, meskipun Dia Mahakuasa untuk menyiksa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "149. Apabila kalian memperlihatkan ucapan atau tindakan yang baik, atau menutupinya, atau memaafkan orang yang berbuat jahat kepada kalian, sesungguhnya Allah Maha Pemaaf lagi Mahakuasa. Maka hendaklah sifat pemaaf itu menjadi bagian dari akhlak kalian, semoga Allah memaafkan kesalahan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "149. Setelah Allah memperbolehkan untuk menyebutkan kezaliman orang yang zalim, maka kemudian Allah menganjurkan untuk melakukan sesuatu yang lebih baik, karena menampakkan kebaikan merupakan perbuatan terpuji jika dimaksudkan untuk memberi motivasi, menguatkan semangat, dan mengingatkan orang yang lalai. Adapun menyembunyikan kebaikan adalah perbuatan yang harus dilakukan jika pelakunya tidak dapat menjamin dirinya akan selamat dari kesombongan dan sifat riya; dan salah satu hal yang dapat menjadi pertimbangan untuk menyembunyikan suatu kebaikan adalah untuk menjaga kehormatan dan perasaan para fakir miskin. Allah juga menganjurkan hamba-hamba-Nya untuk saling memaafkan, karena memberi maaf merupakan perbuatan mulia. Dan berbuat baik kepada orang lain, dan bersabar atas gangguan mereka, serta mengampuni kesalahan mereka merupakan kebaikan yang besar. Allah akan mengampuni mereka dengan ampunan yang luas dan Dia Maha Kuasa untuk melakukan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "149. أَوْ تَعْفُوا۟ عَن سُوٓءٍ (atau memaafkan sesuatu kesalahan (orang lain)) Yakni kesalahan yang ditimpakan kepada kalian. فَإِنَّ اللهَ كَانَ عَفُوًّا(maka sesungguhnya Allah Maha Pemaaf) Yakni pemaaf hamba-hamba-Nya. قَدِيرًا (lagi Maha Kuasa) Berkuasa untuk membalas perbuatan mereka, maka teladanilah Allah yang memaafkan meski ia mampu untuk membalas. Dalam hadist Abu Hurairah bahwa Rasulullah bersabda: “jika terdapat dua orang yang saling mencaci maka dosanya atas orang yang memulai diantara keduanya selama yang dizalimi tidak membalas melebihi batas”. Dan orang yang menuntut haknya secara sempurna adalah sebuah kebaikan namun apabila ia memaafkan dan merelakan maka itu lebih utama, akan tetapi ini berlaku bagi orang yang mampu menuntut haknya namun ia merelakannya karena Allah, adapun orang yang merelakan karena memang ia tidak mampu untuk menuntut maka kerelaannya ini tidak berarti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "149 Jika kamu wahai orang-orang mukmin menyatakan suatu kebaikan atau menyembunyikan atau memaafkan suatu kesalahan dadri orang lain, maka sesungguhnya Allah Maha Pemaaf bagi para hamba-Nya yang melakukan dosa, lagi Maha Kuasa untuk memberi balasan atas perbuatan mereka, maka dari itu berpegang teguhlah dalam jalan Allah dengan memberi maaf atas apa yang ditakdirkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian menampakkan} menunjukkan {atau menyembunyikan suatu kebaikan atau memaafkan suatu kesalahan} membiarkan orang yang berbuat salah kepada kalian {sesungguhnya Allah Maha Pemaaf lagi Maha kuasa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "149. Kemudian Allah berfirman, : \"jika kamu menampakan suatu kebaikan atau menyembunyikannya,” ini mencakup segala kebaikan, perkataan ,perbuatan, lahir maupun batin dan berupa wajib maupun sunah, “ atau memaafkan kasalahan orang lain,” maksudnya, dari seorang yang telah berbuat buruk pada tubuh, harta, dan kehormatan kalian, maka maafkanlah kesalahannyan tersebut. Karena balasan itu sesuai dengan perbuatan. Barangsiapa yang memaafkan karena Allah, niscaya Allah akan memaafkannya, dan barangsiap yang berbuat baik niscaya Allah akan berbuat baik kepadanya. Karena itulah Allah berfirman,” Maka sesungguhnya Allah Maha Pemaaf Lagi Maha Kuasa” maksudnya, maksudnya Allah memaafkan segala ketergelinciran hamba-hambanya dan dosa-dosa mereka yang besar. Allah menutup kekurangan mereka kemudian melakukan mereka dengan maaf yang penuh yang bersumber dari kekuatanNya. Ayat ini mengandung makna untuk mendalami makna nama-nama Allah dan sipat-sipatnya, dan bahwa penciptaan dan perintahNya itu berawal dari padaNya, dan ia adalah tuntutanya, karena itulah ketetapan hukum-hukum tersebut dikaitkan dengan nama-nama Allah yang baik sebagaimana yang terjadi pada ayat ini. Tatkala allah menyebutkan perbuatan baik dan memaafkan orang yang bersalah, Allah merangkaikan FirmanNya dengan mengarahkan kita untuk mengetahui nama-namaNya, dan bahwa hal itu akan mencukupi dari penyebutan namaNya yang khusus."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 149: Jika kamu nampakkan satu kebaikan atau kamu sembunyikan dia atau kamu ampunkan (seorang) dari satu kejelekan, maka sesungguhnya adalah Allah itu Pengampun, Maha kuasa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kebajikan di sini mencakup perkataan dan perbuatan yang baik, nampak maupun tersembunyi, wajib maupun sunat. Baik menimpa badanmu, hartamu maupun kehormatanmu, lalu kamu memaafkannya. Dia memaafkan ketergelinciran hamba-hamba-Nya dan dosa-dosa mereka yang besar, Dia akan menutupinya dan akan memberikan maaf-Nya yang sempurna yang muncul dari kekuasaan-Nya. Dalam ayat ini terdapat dorongan untuk mendalami makna dari nama-nama-Nya dan sifat-Nya, dan bahwa mencipta dan memerintah muncul daripadanya serta menjadi konsekwensinya. Oleh karena itu, Allah Subhaanahu wa Ta'aala setelah menyebutkan hukum mengakhirinya dengan Asmaa'ul Husna sebagaimana dalam ayat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 149",
    "description": "Jika kamu menyatakan suatu kebajikan sehingga diketahui orang lain, atau menyembunyikannya sehingga tidak ada yang mengetahuinya kecuali Allah, atau memaafkan sesuatu kesalahan orang lain padahal engkau mampu membalasnya, maka sungguh Allah akan memaafkan kesalahan kamu, sebab dia maha pemaaf, mahakuasasesungguhnya orang-orang yang ingkar kepada Allah dan rasulrasul-Nya, dan bermaksud membeda-bedakan antara keimanan kepada Allah dan rasul-rasul-Nya, seperti orang-orang yahudi dan orang-orang nasrani, dengan mengatakan, kami beriman kepada sebagian, yakni beriman kepada nabi musa atau nabi isa, dan kami mengingkari sebagian yang lain, tidak beriman kepada nabi Muhammad, serta dengan ucapannya itu mereka bermaksud mengambil jalan tengah antara iman atau ingkar, merekalah, yaitu orang-orang yang beriman kepada sebagian rasul-rasul Allah dan ingkar kepada sebagian rasul-rasul yang lain, orang-orang kafir yang sebenarnya. Dan kami sediakan untuk orang-orang kafir itu azab yang menghinakan sesuai dengan perbuatannya."
  }
]