[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang kafir kepada Allah dan rasul-rasulNya dari kalangan yahudi dan nasrani, dan menginginkan untuk membeda-bedakan antara Allah dan rasul-rasulNya dengan hanya beriman kepada Allah dan mendustakan rasul-rasulNya yang Allah utus kepada makhluk-makhlukNya atau mereka mengakui kebenaran sebagian rasul saja tanpa sebagian yang lain dan berprasangka bahwa sebagian mereka telah mengada-adakan kedustaan atas Nama tuhan mereka,dan mereka hendak mengadakan jalan menuju kesesatan yang mereka buat-buat sendiri dan bid’ah yang mereka ada-adakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "150. Sesungguhnya orang-orang yang ingkar kepada Allah dan ingkar kepada rasul-rasul-Nya, dan hendak membeda-bedakan antara Allah dan rasul-rasul-Nya dengan beriman kepada Allah dan ingkar kepada para rasul-Nya, dan mengatakan, “Kami beriman kepada sebagian para rasul dan ingkar kepada sebagian lainnya”, serta hendak mencari jalan tengah antara kafir dan iman yang mereka anggap dapat menyelamatkan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "150. Setelah Allah menyebutkan keadaan orang-orang munafik, mengancam mereka, dan memperingatkan dari jalan hidup mereka; Maka kemudian Allah menyebutkan keadaan orang-orang kafir, sifat-sifat mereka secara umum, dan jalan hidup mereka yang sesat. Dan Allah membongkar keburukan para pelaku kesesatan yang telah Allah perbolehkan untuk menyingkap kejahatan kejahatan mereka yang berhubungan dengan hak-hak manusia. Dan Adakah kejahatan yang lebih besar daripada berusaha membedakan antara Allah dengan para rasul-Nya yang mulia, membantah risalah mereka, dan mengingkari hubungan mereka dengan Allah demi menyesatkan manusia dari petunjuk?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "150. إِنَّ الَّذِينَ يَكْفُرُونَ بِاللهِ وَرُسُلِهِۦ (Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-rasul-Nya) Apabila seseorang kafir terhadap sebagian Rasul maka berarti ia telah kafir terhadap Allah dan seluruh Rasul. وَيُرِيدُونَ أَن يُفَرِّقُوا۟ بَيْنَ اللهِ وَرُسُلِهِۦ (dan bermaksud memperbedakan antara (keimanan kepada) Allah dan rasul-rasul-Nya) Yakni mereka kafir terhadap semua rasul disebabkan kekafiran mereka terhadap sebagian Rasul dan keimanan kepada Allah; dan ini merupakan perbuatan membeda-bedakan antara Allah dan para Rasul. وَيَقُولُونَ نُؤْمِنُ بِبَعْضٍ وَنَكْفُرُ بِبَعْضٍ (dengan mengatakan: “Kami beriman kepada yang sebahagian dan kami kafir terhadap sebahagian (yang lain)”) Mereka adalah orang-orang Yahudi yang beriman kepada Nabi Musa namun kafir terhadap Nabi Isa dan Nabi Muhammad. Termasuk juga orang-orang Nasrani yang beriman kepada Nabi Isa dan kafir terhadap Nabi Muhammad. وَيُرِيدُونَ أَن يَتَّخِذُوا۟ بَيْنَ ذٰلِكَ سَبِيلًا(serta bermaksud (dengan perkataan itu) mengambil jalan (tengah) di antara yang demikian (iman atau kafir)) Yakni menginginkan keimanan dan kekafiran menjadi agama pertengahan antara keduanya, sehingga mereka dapat membebaskan diri dari hujjah atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "150 Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-rasul-Nya, dan juga yang beriman kepada Allah namun ingkar kepada sebagian rasul atau bahkan semua rasul, dan bermaksud membedakan antara keimanan kepada Allah dan rasul-rasul-Nya, dengan mengatakan: “Kami beriman kepada yang sebagian rasul dan kami ingkar terhadap sebagian yang lain”, mereka adalah orang-orang Yahudi yang beriman kepada kerasulan Musa, namun ingkar kepada Isa dan Muhammad. Bagitu juga orang Nasrani yang beriman kepada Isa namun ingkar kepada Muhammad. Dengan perkataan itu mereka bermaksud mengambil jalan tengah antara keimanan atau kekafiran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang ingkar kepada Allah dan rasul-rasulNya dan bermaksud membeda-bedakan antara Allah dan rasul-rasulNya dengan berkata, “Kami beriman kepada sebagian dan kami mengingkari sebagian lain”} Kami beriman kepada sebagian rasul dan mengingkari sebagian lain {serta bermaksud mengambil antara itu} keimanan dan kekufuran {jalan} jalan yang mereka lalui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "150. Di sini ada dua bagian yang telah Allah jelaskan masing-masing dari keduanya: Pertama, seorang yang beriman kepada Allah, kepada seluruh rasulnya dan kitab-kitabnya, dan kedua, semua yang kafir kepada itu semua. Maka tersisa orang yang ketiga yaitu orang yang mengaku ia beriman kepada sebagian rasul dan tidak sebagian lainnya, dan bahwa hal ini adalah jalan menyelamatkan dari siksaan Allah. Sesungguhnya hal itu tiada lain hanyalah angan-angan belaka, sesungguhnya orang-orang itu menghendaki pemisahan antara Allah dan RasulNya. Sesungguhnya barangsiapa yang berwali kepada Allah secara sungguh-sungguh,niscaya ia akan berwali kepada seluruh RasulNya, karena itu merupakan kesempurnaan perwaliannya, dan barangsiapa yang memusuhi seorang rosul sesungguhnya ia telah memusuhi Allah dan memusuhi seluruh RasulNya, sebagaimana firman Allah \"barang siapa yang memusuhi Allah (sampai akhir ayat)(Al-Baqarah:98). Demikian juga halnya orang yang kafir terhadap seorang rasul sesungguhnya ia telah kafir kepada seluruh rasul, bahkan kepada rasul yang ia mengaku bahwa ia beriman kepadaNya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 150: 150-151. Sesungguhnya mereka yang kufur kepada Allah dan Rasul- rasul Nya, dan hendak membedakan antara Allah dan Rasul-rasulNya, dan berkata: Kami mau beriman kepada sebahagian dan tidak mau beriman kepada sebahagian, dan mereka hendak mengambil satu jalan di antara itu. (Maka) sebenar-benar kafir, dan Kami telah sediakan bagi orang-orang kafir itu. 'adzab yang menghina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara orang mukmin dan orang kafir ada orang yang berusaha mengambil jalan tengah, yaitu orang yang beriman kepada Allah dan ingkar kepada rasul-rasul-Nya atau beriman kepada sebagian rasul dan ingkar kepada sebagian lagi. Mereka mengira bahwa hal itu dapat menyelamatkan mereka dari azab Allah, padahal yang demikian hanyalah angan-angan kosong mereka. Orang yang beriman kepada Allah menghendaki untuk beriman kepada rasul-rasul-Nya, oleh karenanya barang siapa yang ingkar kepada salah satu rasul-Nya, maka sama saja ia telah ingkar kepada Allah dan mengingkari semua rasul. Maksudnya beriman kepada Allah, namun tidak beriman kepada rasul-rasul-Nya. Yakni sebagian rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 150",
    "description": "Sesungguhnya orang-orang yang ingkar kepada Allah dan rasulrasul-Nya, dan bermaksud membeda-bedakan antara keimanan kepada Allah dan rasul-rasul-Nya, seperti orang-orang yahudi dan orang-orang nasrani, dengan mengatakan, kami beriman kepada sebagian, yakni beriman kepada nabi musa atau nabi isa, dan kami mengingkari sebagian yang lain, tidak beriman kepada nabi Muhammad, serta dengan ucapannya itu mereka bermaksud mengambil jalan tengah antara iman atau ingkar, merekalah, yaitu orang-orang yang beriman kepada sebagian rasul-rasul Allah dan ingkar kepada sebagian rasul-rasul yang lain, orang-orang kafir yang sebenarnya. Dan kami sediakan untuk orang-orang kafir itu azab yang menghinakan sesuai dengan perbuatannyasesungguhnya orang-orang yang ingkar kepada Allah dan rasulrasul-Nya, dan bermaksud membeda-bedakan antara keimanan kepada Allah dan rasul-rasul-Nya, seperti orang-orang yahudi dan orang-orang nasrani, dengan mengatakan, kami beriman kepada sebagian, yakni beriman kepada nabi musa atau nabi isa, dan kami mengingkari sebagian yang lain, tidak beriman kepada nabi Muhammad, serta dengan ucapannya itu mereka bermaksud mengambil jalan tengah antara iman atau ingkar, merekalah, yaitu orang-orang yang beriman kepada sebagian rasul-rasul Allah dan ingkar kepada sebagian rasul-rasul yang lain, orang-orang kafir yang sebenarnya. Dan kami sediakan untuk orang-orang kafir itu azab yang menghinakan sesuai dengan perbuatannya."
  }
]