[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itulah orang-orang kafir yang sebenar-benarnya,yang tidak ada keraguan lagi padanya. Dan kami menyediakan bagi orang-orang kafir itu,siksaan yang akan menghinakan dan menistakan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "151. Orang-orang yang memilih jalan semacam itu adalah orang-orang kafir sejati. Sebab, orang yang ingkar kepada para rasul atau sebagian rasul dianggap telah ingkar kepada Allah dan para rasul-Nya. Dan untuk orang-orang kafir itu Kami telah menyiapkan azab yang menghinakan mereka kelak di hari Kiamat. Hal itu sebagai hukuman bagi mereka atas kesombongan mereka yang menolak beriman kepada Allah dan para rasul-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "151. Orang-orang yang jauh dari kebenaran itu merupakan orang-orang yang ingkar secara jelas. Dan kami telah menyiapkan bagi mereka azab yang menghinakan karena mereka telah menghina para rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "151. أُو۟لٰٓئِكَ هُمُ الْكٰفِرُونَ (merekalah orang-orang kafir) Yakni yang kafir sepenuhnya. حَقًّا ۚ (yang sebenar-benarnya) dengan sebenar-benarnya kekafiran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "151 Merekalah adalah orang-orang yang kafir dengan sebenar-benarnya. Kekufuran telah tertanam dalam hati mereka tanpa keraguan, dan itu adalah kekufuran yang hakiki. Kami telah menyediakan siksaan yang menghinakan untuk orang-orang yang kafir itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang kafir yang sebenarnya} sudah kafir dengan pasti, tidak diragukan lagi {Kami telah menyediakan untuk orang-orang kafir azab yang menghinakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151-152. Karena itulah Allah berfirman, “Merekalah orang-orang kafir yang sebenar-benarnya,” yang demikian itu agar tidak ada asumsi yang salah bahwa kedudukan mereka adalah pertengahan antara iman dan kufur. Alasan mereka disebut sebagai kafir hingga terhadap nabi yang mereka klaim bahwa mereka beriman kepadanya, bahwa setiap dalil yang menujukan dalil itu sendiri atau yang sepertinya atau yang lebih tinggi darinya adalah ada pada nabi yang mereka kafir kepadanya. Setiap syubhat yang mereka tunduhkan kepada nabi yang mereka kafir kepadanya, syubhat tersebut atau bahkan yang lebih besar darinya ada pada Rasul yang mereka Imani. Maka selain itu tidak ada lagi yang tersisa kecuali keinginan syahwat, nafsu dan sekedar pengakuan yang mungkin saja setiap orang mampu menolaknya dengan dalih yang sama sepertinya. Dan tatkala Allah menyebutkan mereka adalah orang-orang kafir dengan sebenar-benarnya, lalu Allah sebutkan hukuman yang menyeluruh bagi mereka dan untuk semua orang yang kafir seraya berfirman, “kami telah menyediakan untuk orang-orang kafir itu siksa yang menghinakan.” Sebagaimana mereka telah berlaku sombong dari beriman kepada Allah, maka Allah menghinakan mereka dengan siksaan yang menyakitkan lagi menghinakan, “ Dan orang-orang yang beriman kepada Allah dan para RasulNya.” Ini mencakup keimanan kepada seluruh kabar yang di beritakan Allah tentang diriNya dan kepada seluruh perkara yang datang dari para Rasul berupa berita-berita dan hukum-hukum, dan mereka tidak membeda-bedakan antara satu rasul pun, akan tetapi mereka beruman kepada seluruhnya. Inilah keimanan yang hakiki dan keyakinan yang di dasari oleh keterangan yang kuat. “ Kelak Allah akan memberikan kepada mereka pahalanya,” yaitu, balasan bagi keimanan mereka dan apa pun yang di hasilkan karenanya berupa amalan-amalan shalih, perkataan yang baik, dam ahklak yang terpuji. Sesuai dengan kondisinya. Dan sepeti inilah rahasia dari penyanderaan kata pahala kepada mereka. “ Dan Allah Maha Pengampun Lagi Maha Penyayang.” Allah mengampuni kesalahan-kesalahan dan menerima segala kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 151: 150-151. Sesungguhnya mereka yang kufur kepada Allah dan Rasul- rasul Nya, dan hendak membedakan antara Allah dan Rasul-rasulNya, dan berkata: Kami mau beriman kepada sebahagian dan tidak mau beriman kepada sebahagian, dan mereka hendak mengambil satu jalan di antara itu. (Maka) sebenar-benar kafir, dan Kami telah sediakan bagi orang-orang kafir itu. 'adzab yang menghina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Agar tidak ada kesan bahwa mereka berada di tengah-tengah antara keimanan dan kekafiran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 151",
    "description": "Sesungguhnya orang-orang yang ingkar kepada Allah dan rasulrasul-Nya, dan bermaksud membeda-bedakan antara keimanan kepada Allah dan rasul-rasul-Nya, seperti orang-orang yahudi dan orang-orang nasrani, dengan mengatakan, kami beriman kepada sebagian, yakni beriman kepada nabi musa atau nabi isa, dan kami mengingkari sebagian yang lain, tidak beriman kepada nabi Muhammad, serta dengan ucapannya itu mereka bermaksud mengambil jalan tengah antara iman atau ingkar, merekalah, yaitu orang-orang yang beriman kepada sebagian rasul-rasul Allah dan ingkar kepada sebagian rasul-rasul yang lain, orang-orang kafir yang sebenarnya. Dan kami sediakan untuk orang-orang kafir itu azab yang menghinakan sesuai dengan perbuatannya adapun orang-orang yang beriman dengan sesungguhnya kepada Allah dan rasul-rasul-Nya dan tidak membeda-bedakan seorang pun di antara mereka, para rasul-rasul itu, kelak Allah akan memberikan pahala yang besar kepada mereka sesuai dengan amalnya. Allah maha pengampun terhadap dosa-dosa hamba-Nya, lagi maha penyayang dengan mencurahkan rahmat-Nya yang tidak terkira kepada orang-orang yang beriman."
  }
]