[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengimani keesaan Allah dan mengakui kenabian seluruh rasul-rasulNya,dan tidak membeda-bedakan salah seorang pun di antara mereka,serta mengerjakan syariat Allah,mereka itu adalah orang-orang yang akan Allah berikan balasan dan pahala atas keimanan mereka kepada Nya dan kepada rasul-rasulNya. Dan Allah Maha pengampun kepada hamba-hambaNya lagi Maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "152. \"Dan Orang-orang yang percaya kepada Allah dan mengesakan-Nya, tidak menyekutukan-Nya dengan siapa pun, serta percaya kepada semua rasul-Nya, tidak membeda-bedakan antara rasul yang satu dengan lainnya tidak seperti yang dilakukan oleh orang-orang kafir, mereka itu akan mendapatkan ganjaran yang sangat besar sebagai balasan atas keimanan dan amal saleh mereka yang muncul dari keimanan tersebut. Sesungguhnya Allah Maha Pengampun bagi hamba-hamba-Nya yang meminta ampun lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "152. Berlawanan dengan pembahasan tentang orang-orang kafir dan tempat kesudahan mereka, pada ayat ini Allah menjelaskan kedudukan orang-orang yang beriman dan kesudahan bagi orang-orang yang beriman kepada Allah dan para rasul-Nya dan tidak membeda-bedakan antara satu Rasul dengan Rasul lainnya, namun beriman kepada mereka seluruhnya dan mengakui keutamaan mereka masing-masing. Orang-orang yang memiliki derajat yang tinggi tersebut akan kami balas amal perbuatan mereka dan kami berikan kepada mereka sebagai janji yang tidak akan diingkari atau diakhirkan. Allah Maha Pengasih dan memiliki ampunan yang luas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "152. وَلَمْ يُفَرِّقُوا۟ بَيْنَ أَحَدٍ مِّنْهُمْ (dan tidak membeda-bedakan seorangpun di antara mereka) Namun mereka beriman kepada seluruh Rasul."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "152 Orang-orang yang beriman kepada Allah dan seluruh rasul-Nya dan tidak membeda-bedakan para rasul dengan beriman kepada semuanya kelak Allah akan memberikan kepada mereka pahala yang sempurna. Dan Allah Maha Pengampun atas dosa-dosa mereka lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang beriman kepada Allah dan rasul-rasulNya dan tidak membeda-bedakan seorang pun di antara mereka, Allah akan memberi mereka} memberi mereka {pahala mereka. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "151-152. Karena itulah Allah berfirman, “Merekalah orang-orang kafir yang sebenar-benarnya,” yang demikian itu agar tidak ada asumsi yang salah bahwa kedudukan mereka adalah pertengahan antara iman dan kufur. Alasan mereka disebut sebagai kafir hingga terhadap nabi yang mereka klaim bahwa mereka beriman kepadanya, bahwa setiap dalil yang menujukan dalil itu sendiri atau yang sepertinya atau yang lebih tinggi darinya adalah ada pada nabi yang mereka kafir kepadanya. Setiap syubhat yang mereka tunduhkan kepada nabi yang mereka kafir kepadanya, syubhat tersebut atau bahkan yang lebih besar darinya ada pada Rasul yang mereka Imani. Maka selain itu tidak ada lagi yang tersisa kecuali keinginan syahwat, nafsu dan sekedar pengakuan yang mungkin saja setiap orang mampu menolaknya dengan dalih yang sama sepertinya. Dan tatkala Allah menyebutkan mereka adalah orang-orang kafir dengan sebenar-benarnya, lalu Allah sebutkan hukuman yang menyeluruh bagi mereka dan untuk semua orang yang kafir seraya berfirman, “kami telah menyediakan untuk orang-orang kafir itu siksa yang menghinakan.” Sebagaimana mereka telah berlaku sombong dari beriman kepada Allah, maka Allah menghinakan mereka dengan siksaan yang menyakitkan lagi menghinakan, “ Dan orang-orang yang beriman kepada Allah dan para RasulNya.” Ini mencakup keimanan kepada seluruh kabar yang di beritakan Allah tentang diriNya dan kepada seluruh perkara yang datang dari para Rasul berupa berita-berita dan hukum-hukum, dan mereka tidak membeda-bedakan antara satu rasul pun, akan tetapi mereka beruman kepada seluruhnya. Inilah keimanan yang hakiki dan keyakinan yang di dasari oleh keterangan yang kuat. “ Kelak Allah akan memberikan kepada mereka pahalanya,” yaitu, balasan bagi keimanan mereka dan apa pun yang di hasilkan karenanya berupa amalan-amalan shalih, perkataan yang baik, dam ahklak yang terpuji. Sesuai dengan kondisinya. Dan sepeti inilah rahasia dari penyanderaan kata pahala kepada mereka. “ Dan Allah Maha Pengampun Lagi Maha Penyayang.” Allah mengampuni kesalahan-kesalahan dan menerima segala kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 152: Dan orang-orang yang beriman kepada Allah dan Rasul-rasul Nya dan tidak membedakan antara seorangpun dari mereka (tentang wajib diimani), (maka) mereka ini akan diberi ganjarannya (oleh Allah), karena adalah Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Semuanya. Beriman kepada Allah dan rasul-rasul-Nya mencakup beriman kepada semua yang diberitakan Allah tentang Diri-Nya dan mengimani semua yang dibawa para rasul berupa berita dan hukum-hukum. Bahkan mengimani semuanya. Dia mengampuni semua kesalahan dan menerima semua kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 152",
    "description": "Adapun orang-orang yang beriman dengan sesungguhnya kepada Allah dan rasul-rasul-Nya dan tidak membeda-bedakan seorang pun di antara mereka, para rasul-rasul itu, kelak Allah akan memberikan pahala yang besar kepada mereka sesuai dengan amalnya. Allah maha pengampun terhadap dosa-dosa hamba-Nya, lagi maha penyayang dengan mencurahkan rahmat-Nya yang tidak terkira kepada orang-orang yang beriman. Orang-orang ahli kitab, yakni orang-orang yahudi, meminta kepadamu, wahai nabi Muhammad, agar engkau menurunkan sebuah kitab dari langit, yang diturunkan secara khusus kepada mereka. Janganlah karena permintaan itu engkau menjadi sedih dan jengkel kepada mereka, permintaan itu bukanlah puncak dari keburukan mereka, karena sesungguhnya mereka telah meminta kepada musa, suatu permintaan yang lebih besar keburukannya dari itu. Mereka berkata, perlihatkan Allah kepada kami secara nyata sehingga kami dapat melihat-Nya dengan mata kepala. Maka mereka disambar petir, sebagai bentuk peringatan Allah, karena kezaliman mereka. Walaupun demikian, mereka tidak berhenti berbuat aniaya dan melampaui batas. Kemudian mereka menyembah anak sapi, sesudah mereka melihat bukti-bukti yang nyata berupa keterangan-keterangan dan mukjizat yang dibawa oleh para rasul. Namun demikian, terhadap kesalahan yang mereka lakukan, kami maafkan mereka, dan telah kami berikan kepada musa kekuasaan yang nyata, untuk menghadapi sikap dan perbuatan orang-orang yahudi itu."
  }
]