[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yahudi meminta kepadamu (wahai rasul), mukjizat seperti mukjizat musa ,yang mempersaksikan kebenaranmu, yaitu kamu menurunkan kepada mereka lembaran-lembaran yang tertulis dari Allah, sebagaimana dahulu musa datang dengan membawa lempengan-lempengan dari sisi Allah. janganlah kamu mersa aneh (wahai rasul), sebab sesungguhnya para pendahulu mereka telah meminta kepada Musa mukjizat yang lebih besar dari itu. Mereka meminta supaya Musa memperlihatkan Allah kepada mereka dalam keadaan terjaga, akibatnya merekapun ditimpa siksaan yang membinasakan. dikarenakan sifat kezhaliman mereka terhadap diri mereka tatkala meminta Sesuatu hal yang tidak pantas bagi mereka.Dan setelah Allah menghidupkan mereka setelah kematian mereka, dan menyaksikan tanda-tanda kebenaran nyata melalui tangan musa yang sudah pasti menampik kesyirikan, justru mereka menyembah patung anak sapi selain Allah. Kemudian kami memaafkan mereka dari penyembahan terhadap patung anak sapi tersebut karena taubat mereka. Dan kami berikan kepada Musa hujjah agung yang menguatkan kebenaran kenabiannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "153. Orang-orang Yahudi meminta kepadamu -wahai Rasul- agar kamu menurunkan kepada mereka sebuah kitab suci sekaligus seperti yang terjadi pada Musa, sebagai tanda kebenaranmu. Tetapi jangan kamu menganggap itu masalah besar. Sebab, para pendahulu mereka pernah meminta kepada Musa sesuatu yang lebih besar dari apa yang mereka minta darimu. Mereka pernah meminta kepada Musa agar ia memperlihatkan wujud Allah secara nyata di hadapan mereka. Kemudian mereka semua disambar petir, sebagai hukuman atas perbuatan mereka tersebut. Lalu Allah menghidupkan mereka kembali. Lantas mereka menyembah patung anak sapi selain Allah, setelah mereka menerima bukti-bukti yang jelas-jelas menunjukkan keesaan dan ketunggalan Allah dalam sifat rubūbiyyah dan ulūhiyyah-Nya. Lalu Kami maafkan kesalahan mereka dan Kami berikan kepada Musa sebuah dalil yang nyata bagi kaumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "153. Orang-orang Yahudi meminta kepada Nabi Muhammad karena kecongkakan mereka, kebodohan terhadap kebesaran dan kekuasaan Allah, dan kelalaian mereka dari ketetapan dan ayat-ayat Allah. Mereka meminta kepada Rasulullah kitab yang diturunkan dari langit sehingga mereka dapat melihat dan memegangnya. Hai Muhammad, janganlah engkau heran, sebab mereka telah mengikuti jalan hidup para pendahulu mereka yang apabila melihat ayat-ayat dan mukjizat Allah maka mereka akan semakin berpaling dan tersesat dari petunjuk. Mereka telah meminta kepada Musa untuk dapat melihat Allah dengan mata telanjang, maka mereka tersambar petir sebagai balasan dan pemadam sifat pembangkangan mereka setelah melihat mukjizat. Hal ini merupakan bentuk keingkaran dan kesombongan mereka. Dan yang lebih parah dari itu, mereka malah menjadikan patung anak sapi sebagai sesembahan selain Allah setelah mereka menyaksikan mukjizat mukjizat yang mengagumkan, namun Allah tetap memberi mereka ampunan, dan mengaruniakan kepada Musa hujjah yang jelas dan mukjizat yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "153. يَسْـَٔلُكَ أَهْلُ الْكِتٰبِ (Ahli Kitab meminta kepadamu agar kamu menurunkan kepada mereka sebuah Kitab) Mereka adalah orang-orang Yahudi yang meminta kepada Rasulullah agar ia terbang ke langit dan mereka menyaksikannya, lalu turun dengan membawa kitab yang tertulis sekaligus seperti yang ia katakan agar itu menjadi bukti kebenarannya, sebagaimana Musa mendatangkan mereka kitab Taurat. Permintaan ini merupakan bentuk kebebalan mereka. فَقَدْ سَأَلُوا۟ مُوسَىٰٓ أَكْبَرَ مِن ذٰلِكَ فَقَالُوٓا۟ أَرِنَا اللهَ جَهْرَةً (Maka sesungguhnya mereka telah meminta kepada Musa yang lebih besar dari itu. Mereka berkata: “Perlihatkanlah Allah kepada kami dengan nyata) Yakni secara kasat mata. فَأَخَذَتْهُمُ الصّٰعِقَةُ (Maka mereka disambar petir) Yakni petir yang turun dari langit menyambar mereka hingga mereka mati, lalu Allah membangkitkan mereka kembali. بِظُلْمِهِمْ ۚ( karena kezalimannya) Yakni disebabkan kezaliman mereka. Karena Allah tidak mungkin dapat terlihat oleh hamba-hamba-Nya di dunia; namun hal ini bukan merupakan bukti bahwa Allah juga tidak mungkin dapat terlihat oleh hamba-hamba-Nya di hari kiamat, banyak hadist mutawatir yang menunjukkan hal ini. Dan siapa yang menjadikan ayat ini sebagai dalil atas ketidakmungkinan terlihatnya Allah di hari kiamat maka ia telah melakukan kesalahan yang jelas. Salah satu hadist dalam hal ini adalah sabda Rasulullah: “Sungguh kalian akan melihat Tuhan kalian sebagaimana kalian melihat bulan ini. Kalian akan tidak berdesak-desakan untuk melihat-Nya. Dan jika kalian mampu untuk tidak melewatkan shalat sebelum terbit matahari (subuh) dan shalat sebelum terbenamnya matahari (ashar) maka lakukanlah”. ثُمَّ اتَّخَذُوا۟ الْعِجْلَ(dan mereka menyembah anak sapi) Menjadikannya Tuhan dan menyembahnya selain Allah. Kisah dari penyembahan mereka kepada anak sapi dijelaskan dalam surat al-Baqarah: 54, surat al-A’raf: 148-153, dan surat TaHa: 88-98. الْبَيِّنٰتُ (mereka bukti-bukti yang nyata) Mukjizat-mukjizat seperti tangan yang bercahaya, tongkat, dan pembelahan laut. فَعَفَوْنَا عَن ذٰلِكَ ۚ( lalu Kami maafkan (mereka) dari yang demikian) Yakni dari yang telah mereka lakukan seperti kebebalan dan penyembahan anak sapi. وَءَاتَيْنَا مُوسَىٰ سُلْطٰنًا مُّبِينًا(Dan telah Kami berikan kepada Musa keterangan yang nyata) Yakni bukti yang jelas berupa ayat-ayat yang telah Nabi Musa datangkan. Kata الحجة)/bukti) disebut dengan (السلطان/kekuatan) karena orang yang datang dengan bukti tersebut akan dapat mengalahkan lawannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "153 Wahai rasul, ahli Kitab meminta kepadamu agar kamu menurunkan kepada mereka sebuah kitab secara sekaligus khusus untuk mereka dari langit. Mereka bermaksud meminta bukti atas kebenaran risalah kenabianmu. Sesungguhnya mereka telah meminta kepada penadahulu mereka yang lebih besar dari itu, yaitu kepada Musa. Mereka berkata kepada Musa: “Perlihatkanlah Allah kepada kami dengan nyata”. Kemudian mereka menyembah anak sapi, dan menjadikannya sesembahan selain Allah. Kata tsumma menunjukkan arti atas kelakuan terus-menerus mereka dalam kezaliman, bukan untuk menunjukkan jeda waktu. Sebab penyembahan mereka kepada anak sapi sudah mereka lakukan sebelum mereka meminta untuk melihat Allah secara nyata. Semua itu mereka lakukan bahkan setelah mukjizat beserta bukti-bukti yang nyata tentang keesaan Allah dan kenabian Musa telah mereka terima, seperti mukjizat tangan yang mengeluarkan cahaya, tongkat dan membelah lautan. Kemudian Kami maafkan perbuatan mereka yang meminta melihat Allah dan juga menyembah anak sapi. Dan telah Kami berikan kepada Musa keterangan yang nyata, kekuasaan yang nyata dan kuat. Kemudian Kami tundukkan pembangkangan mereka yang keras. Dan hujjah itu berupa kekuasaan, sebab siapa yang datang membawa hujjah maka dia akan bisa mengalahkan. Ayat ini turun untuk orang-orang Yahudi, mereka berkata kepada Nabi: Jika engkau memang seorang Nabi, maka turunkan sebuah kitab untuk kami secara sekaligus dari langit, seperti yang telah diturunkan kepada Musa. Kemudian Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ahlul kitab meminta kepadamu} orang-orang Yahudi {agar kamu menurunkan sebuah kitab dari langit kepada mereka. Sungguh mereka telah meminta kepada Musa yang lebih besar} yang lebih besar {daripada itu. Lalu mereka berkata, “Perlihatkanlah Allah kepada kami secara nyata.”} dengan jelas {Lalu petir menyambar mereka karena kezaliman mereka. Kemudian mereka menjadikan anak sapi setelah datang kepada mereka bukti-bukti nyata} ayat-ayat yang jelas {lalu Kami memaafkan} membiarkan {yang demikian itu. Kami telah menganugerahkan kepada Musa kekuasaan yang nyata} dalil yang jelas kepada kaumnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153-158. Pertanyaan ini, yang bersumber dari Ahli Kitab yang dialamatkan kepada Rasulullah adalah bentuk kedurhakaan dan usulan, dan tindakan mereka menjadikan pertanyaan ini sebagai patokan hingga mereka percaya atau mendustakan, pertanyaan itu adalah bahwa mereka meminta kepada beliau agar seluruh al-Quran diturunkan secara langsung sekali turun saja sebagaimana Taurat dan Injil diturunkan. Ini adalah tindakan kezhaliman yang sangat jauh dari mereka (dan juga kebodohan), karena sesungguhnya Rasul itu adalah seorang manusia dan seorang hamba yang diatur, beliau tidak memiliki kuasa dalam hal itu sama sekali, akan tetapi perkara itu adalah milik Allah saja, Allah –lah yang mengutus dan menurunkan apa yang dikehendaki atas hamba-hambaNya, seperti Firman Allah tentang Rasul tatkala menyebutkan ayat-ayat yang menerangkan usulan orang-orang musyrik terhadap Muhammad, \"katakanlah mahasuci tuhanku tidakla keadaanku kecuali seorang pemberi kabar gembira dan sebagai seorang utusan\" (Al-Isra:93). Demikian juga tindakan mereka menjadikan pembeda antara kebenaran dan kebatilan dengan hanya sebatas turunnya al-Kitab secara keseluruhan atau terpisah-pisah, hal itu adalah sebuah tuduhan yang tidak berdasarkan dalil sama sekali, tidak sesuai bahkan tidak ada syubhat. Lalu darimana datangnya dalil pada kenabian seorang nabi di antara nabi-nabi bahwa seorang rasul yang datang kepada kalian dengan membawa kitab yang turun secara terpisah-pisah, sehingga kalian tidak beriman kepadanya dan tidak mempercayainya? Akan tetapi turunnya al-Quran secara berangsur-angsur sesuai dengan kondisi, adalah menunjukkan akan keagungan Allah dan perhatianNya kepada orang yang kitab tersebut diturunkan kepadanya, sebagaimana Allah berfirman, “Berkatalah orang-orang yang kafir: \"Mengapa Al Quran itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah supaya Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar). Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.” (Al-Furqan: 32-33). Ketika Allah menyebutkan keberatan mereka yang batil, Allah mengabarkan bahwa perbuatan mereka yang seperti itu bukanlah suatu yang aneh bahkan telah ada sikap-sikap sebelumnya dari mereka yang jelek yang lebih buruk yang mereka tempuh bersama Rasul yang mereka klaim bahwa mereka beriman kepadanya, yaitu permohonan mereka kepada beliau agar dapat melihat Allah secara nyata, tindakan mereka menjadikan patung anak sapi sebagai tuhan yang mereka sembah, setelah mereka menyaksikan bukti-bukti nyata kekuasaan Allah dengan mata kepala mereka, dan penolakan mereka untuk meneriman hukum-hukum dari kitab mereka yaitu Taurat, hingga Allah mengangkat bukit Thur di atas kepala-kepala mereka, dan mereka di ancam bahwasannya bila mereka tidak beriman, niscaya Allah akan menjatuhkan bukit itu kepada mereka. Lalu mereka meneriman hal itu dengan mata tertunduk dan keimanan palsu yang menyerepaui iman asasi. Dan juga berupa penolakan mereka untuk memasuki pintu-pintu negeri dimana mereka di perintahkan untuk memasukinya sebagai orang-orang yang bersujud dan memohon ampun, tetapi mereka menyali perintah dan perbutan yang di wajibkan. Juga tindakan melampui batas di antara mereka terhadap hari Sabtu, sehingga Allah menghukum mereka dengan hukuman yang keji tersebut, dan diambilnya perjanjian yang kuat atas mereka namun mereka melemparnya di belakang punggung mereka dan mereka kufur kepada ayat-ayat Allah, mereka membunuh rasul-rasul tanpa haq. Dan diantara perkataan mereka adalah; sesunguhnya mereka membunuh Al-masih isa dan menyalibnya, padahal kenyataannya mereka tidaklah membunuh Al- Masih dan tidak pula menyalibnya, akan tetapi orang lain diserupakan dengannya hingga mereka membunuh orang lain tersebut dan menyalibnya. Dan perngakuan mereka bahwa hati mereka tertutup, tidak memahami apa yang dikatakan dan tidak mengerti. Mereka juga menghalangi manusia dari jalan Allah hingga mereka mengalangi manusia dari kebenaran, mengajak manusia kepada apa yang mereka yakini berupa kesesatan dan penyimpangan, dan mereka juga mengambil riba dari harta-harta yang di larang, padahal Allah melarang mereka daripadanya dan telah menegaskannya. Maka orang yang malakukan perbuatan ini tidaklah aneh bila keluar dari mereka permintaan Rasul Muhammad untuk menunjukan kitab berbentuk buku kepada mereka dari langit. Jalan ini adalah sebaik-baik jalan dalam berdebat dengan lawan yang kafir, yaitu bila terjadi sanggahan yang bathil yang membuatnya jadi syubhat baginya dan bagi orang lain dalam menolak kebenaran, agar ia menjelaskan kondisinya yang licik dan perbuatan-perbuatan mereka yang keji yang merupakan perkara yang paling jelek darinya. Agar setiap orang mengetahui bahwasanya sanggahan itu berasal dari lembah yang berbahaya, dan sungguh sebelum itu ada hal-hal yang lain yang dijadikan sanggahan. Demikian juga setiap sanggahan yang mereka utarakan atas kenabian Muhammad, mungkin dapat di lawan dengan yang sama dengannya atau dengan yang lebih kuat darinya pada kenabian orang yang mereka akui beriman kepadanya, agar kejahatan mereka selesai dengan hal tersebut dan kebathilan mereka terputus. Dan setiap hujjah yang mereka tempuh untuk menetapkan kenabian orang yang mereka Imani, dan serupa dengannya atau yang lebih kuat darinya adalah menunjukan dan menetapkan kanabian Muhammad. Dan tatkala maksud dari penyebutan kejelekan-kejelekan mereka oleh Allah itu adalah bantahan, Allah tidak meluaskan penjelasan pada bagian ini, akan tetapi Allah mengisyaratkan tentangnya dan mengindikasikan tempat-tempatnya (dalam al-Quran), dan sesungguhnya Allah telah meluaskan penjelasannya pada tempat lain yang sesuai untuk diperluas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 153: Ahlul-Kitab akan minta kepadamu supaya engkau turunkan atas mereka satu kitab dari langit, karena sesungguhnya mereka per- nah minta kepada Musa lebih besar dari itu, yaitu mereka berkata: \"Unjukkanlah Allah kepada kami dengan terang-terang\", lantas mereka disambar petir dengan sebab kezhaliman mereka, mereka menyembah anak sapi setelah datang kepada mereka keterangan, tetapi Kami ampunkan yang demikian, dan Kami beri kepada Musa kekuasaan yang nyata."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang Yahudi. Sebagaimana Taurat dan Injil yang diturunkan sekaligus. Permintaan mereka ini merupakan kezaliman dan kebodohan, karena rasul adalah manusia; hamba yang diatur, dia tidak memiliki kekuasaan apa-apa, bahkan semua urusan ada di Tangan Allah, Dia mengutus dan menurunkan sesuai yang dikehendaki-Nya. Adapun sikap mereka menjadikan pemisah antara yang hak dan yang batil dengan melihat apakah kitab itu diturunkan secara sekaligus atau tidak hanyalah dakwaan yang tidak memiliki dalil dan munasabah (kesesuaian). Bahkan diturunkannya Al Qur'an secara bertahap sesuai kondisi menunjukkan keagungan Al Qur'an dan perhatian Allah kepada orang yang diturunkan kepada Al Qur'an, sebagaimana firman Allah, \"Orang-orang kafir berkata, \"Mengapa Al Quran itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah agar Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar).--33. Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.\" (Terj. Al Qur'an: 32-33) Setelah Allah menyebutkan permintaan mereka di atas yang menunjukkan keburukan mereka, Allah menjelaskan bahwa yang demikian tidaklah asing, bahkan ada perbuatan-perbuatan buruk mereka yang lebih parah lagi dari permintaan itu, di antaranya: - Permintaan mereka untuk melihat Allah secara langsung, - Penyembahan mereka kepada anak sapi setelah mereka melihat bukti-bukti yang nyata (mukjizat) yang tidak disaksikan oleh selain mereka. - Keengganan mereka menerima hukum-hukum Taurat sampai diangkat gunung Sinai ke atas kepala mereka. Mereka diancam, bahwa jika mereka tidak mau menerimanya, maka akan dijatuhkan gunung tersebut kepada mereka, hingga akhirnya mereka mau menerima nampak seperti terpaksa. - Keengganan mereka memasuki pintu gerbang Baitulmaqdis sambil bersujud dan meminta ampunan, bahkan mereka menyelisihi perintah itu baik dengan kata-kata maupun dengan sikap. - Melanggar peraturan mengenai hari Sabat. Oleh karena itu, Allah menghukum mereka dengan hukuman yang menghinakan; menjadikan mereka sebagai kera yang hina. - Melempar perjanjian yang telah diambil dari mereka ke belakang punggungnya. - Kafir kepada ayat-ayat Allah. - Membunuh para rasul tanpa alasan yang benar. - Pernyataan mereka, bahwa mereka telah membunuh Nabi Isa 'alaihis salam dan telah menyalibnya, padahal mereka tidak membunuhnya dan tidak menyalibnya. Yang mereka bunuh dan salib adalah orang yang dimiripkan dengan Nabi Isa 'alaihis salam. - Pernyataan mereka, bahwa hati mereka terkunci; tidak memahami dan tidak mengerti apa yang Rasulullah shallallahu 'alaihi wa sallam sampaikan. - Menghalangi manusia dari jalan Allah, menghalangi manusia dari kebenaran dan mengajak mereka agar bersama di atas kesesatan. - Memakan harta haram dan riba. Semua ini dapat dibaca dari ayat 153-161 di atas. Anak sapi itu dibuat mereka dari emas, lalu mereka sembah. Dan tidak Kami musnahkan. Yakni terhadap kaumnya. Oleh karena itu, ketika Beliau memerintahkan mereka membunuh diri mereka sebagai tobatnya, mereka pun menurutinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 153",
    "description": "Orang-orang ahli kitab, yakni orang-orang yahudi, meminta kepadamu, wahai nabi Muhammad, agar engkau menurunkan sebuah kitab dari langit, yang diturunkan secara khusus kepada mereka. Janganlah karena permintaan itu engkau menjadi sedih dan jengkel kepada mereka, permintaan itu bukanlah puncak dari keburukan mereka, karena sesungguhnya mereka telah meminta kepada musa, suatu permintaan yang lebih besar keburukannya dari itu. Mereka berkata, perlihatkan Allah kepada kami secara nyata sehingga kami dapat melihat-Nya dengan mata kepala. Maka mereka disambar petir, sebagai bentuk peringatan Allah, karena kezaliman mereka. Walaupun demikian, mereka tidak berhenti berbuat aniaya dan melampaui batas. Kemudian mereka menyembah anak sapi, sesudah mereka melihat bukti-bukti yang nyata berupa keterangan-keterangan dan mukjizat yang dibawa oleh para rasul. Namun demikian, terhadap kesalahan yang mereka lakukan, kami maafkan mereka, dan telah kami berikan kepada musa kekuasaan yang nyata, untuk menghadapi sikap dan perbuatan orang-orang yahudi itu. Dan kami angkat gunung, yaitu gunung sinai, sehingga tampak seperti awan di atas kepala mereka untuk menguatkan agar mereka menepati perjanjian mereka. Dan kami perintahkan kepada mereka, masukilah pintu gerbang baitulmakdis itu sambil bersujud, dan kami perintahkan pula kepada mereka, janganlah kamu melanggar peraturan mengenai hari sabat, yaitu menjadikan hari sabat untuk beribadah kepada Allah dan tidak memancing pada hari itu. Akan tetapi, mereka mengabaikan perintah itu. Dan kami telah mengambil dari mereka perjanjian yang kukuh, yaitu perjanjian bahwa mereka akan menaati hukum Allah yang termaktub di dalam kitab taurat."
  }
]