[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kami melaknat mereka disebabkan karena pelanggaran mereka terhadap isi perjanjian tersebut, dan kekafiran mereka terhadap ayat-ayat Allah yang menunjukan kebenaran rasul-rasulNya,dan pembunuhan yang mereka lakukan terhadap nabi-nabi secara zhalim dan melampaui batas, serta ucapan mereka,”Dihati kami ada penutup-penutup,sehingga tidak bisa memahami apa yang kamu ucapkan.” Bahkan sebenarnya Allah telah melenyapkan hati mereka disebabkan kekafiran mereka, sehingga mereka tidak beriman kecuali dengan keimanan yang sedikit yang tidak bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "155. Maka Kami jauhkan mereka dari rahmat Kami akibat pelanggaran mereka terhadap perjanjian yang ditetapkan atas mereka, kekafiran mereka kepada ayat-ayat Allah, kelancangan mereka membunuh para nabi, dan ucapan mereka kepada Muhammad -ṣallallāhu 'alaihi wa sallam-, “Hati kami tertutup sehingga tidak bisa memahami apa yang kamu ucapkan.” Padahal masalahnya tidak seperti yang mereka ucapkan. Sebenarnya Allah telah mengunci mati hati mereka sehingga tidak ada kebaikan yang bisa masuk ke dalamnya. Maka mereka tidak memiliki iman kecuali hanya sedikit yang tidak ada gunanya bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "155. Allah menjelaskan berbagai penghianatan orang-orang Yahudi, yaitu melanggar perjanjian-perjanjian yang besar, mengingkari ayat-ayat Allah yang jelas, dan membunuh para nabi yang merupakan makhluk-makhluk terpilih tanpa sebab dan alasan yang dibenarkan. Kemudian mereka beralasan bahwa itu semua terjadi karena hati mereka telah menjadi keras, dan merupakan qadar yang tidak dapat terelakkan, serta telah menjadi tabiat mereka yang sulit ditinggalkan. Hati mereka yang kering dan keras merupakan balasan dan akibat dari dosa mereka yang bertumpuk-tumpuk dan selalu membangkang dan berpaling; sehingga tidak ada yang beriman dari mereka kecuali segolongan kecil saja, adapun kebanyakan mereka hanya membenarkan apa yang sesuai dengan maslahat duniawi mereka dan mendustakan apa yang menyelisihi hawa nafsu mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "155. فَبِمَا نَقْضِهِم مِّيثٰقَهُمْ (Maka, disebabkan mereka melanggar perjanjian itu) Yakni karena mereka melanggar perjanjian dengan Allah maka Kami mengharamkan atas mereka makanan-makanan yang baik yang sebelumnya Kami halalkan -dengan dalil bahwa kisah ini berlanjut sampai ayat 160 yang berbunyi: فَبِظُلْمٍ مِّنَ الَّذِينَ هَادُوا۟ حَرَّمْنَا “disebabkan kezaliman orang-orang Yahudi maka Kami haramkan…” Mereka melanggar perjanjian yang telah Allah ambil kepada mereka bahwa mereka akan menjelaskan kepada manusia sifat-sifat Nabi Muhammad. وَقَتْلِهِمُ الْأَنۢبِيَآءَ بِغَيْرِ حَقٍّ (dan mereka membunuh nabi-nabi tanpa (alasan) yang benar) Seperti Nabi Yahya, Zakariya, dan lainnya. وَقَوْلِهِمْ قُلُوبُنَا غُلْفٌۢ ۚ( dan mengatakan: “Hati kami tertutup”) (الغلف) bentuk jamak dari (الأغلف) yang berarti penutup. Yakni pada hati kami terdapat penutup sehingga kami tidak dapat memahami apa yang kamu katakan. بَلْ طَبَعَ اللهُ عَلَيْهَا بِكُفْرِهِمْ(Bahkan, sebenarnya Allah telah mengunci mati hati mereka karena kekafirannya) Yakni sebab mereka tidak menerima kebenaran bukanlah karena terdapat penutup yang mereka buat sendiri namun karena Allah mengunci hati mereka. فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا(karena itu mereka tidak beriman kecuali sebahagian kecil dari mereka) Sebab mereka tidak menjawab seruan dakwah adalah karena sedikitnya keimanan mereka atau bahkan karena memang mereka tidak memiliki keimanan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnu Taimiyah berkata : Diantara pengaruh dosa yang paling berbahaya! Allah menjadikan diantara hukumannya atas dosa anak adam dengan mengangkat dari diri mereka hidayah dan ilmu yang bermanfaat seperti firman Allah : { وَقَوْلِهِمْ قُلُوبُنَا غُلْفٌ ۚ بَلْ طَبَعَ اللَّهُ عَلَيْهَا بِكُفْرِهِمْ } \"dan mengatakan: \"Hati kami tertutup\". Bahkan, sebenarnya Allah telah mengunci mati hati mereka karena kekafirannya\" dan Allah berfiman : { فَلَمَّا زَاغُوا أَزَاغَ اللَّهُ قُلُوبَهُمْ } \"Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka\". 2 ). Satu kaum memiliki sejarah yang begitu pahit tetapi tidak menjadi hal yang menakjubkan atas apa yang telah mereka perbuat kepada saudara-saudara kita muslimin! tetapi yang hal yang paling menakutkan tatkala mempercayakan perjanjian siapa yang mengingkari perjanjiannya kepada tuhan semesta alam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "155 Maka Kami lakukan terhadap mereka beberapa tindakan, disebabkan mereka melanggar perjanjian kepada Allah untuk melakukan perintah Taurat itu, dan juga karena kekafiran mereka terhadap keterangan-keterangan yang diturunkan Allah kepada mereka. Juga karena mereka telah membunuh nabi-nabi seperti yahya dan Zakaria dan lainnya tanpa alasan yang benar. Mereka mengatakan kepada para Nabi: “Hati kami telah tertutup oleh bungkus, maka dari itu jangan engkau ajarkan apa yang kau katakan”. Bahkan, sebenarnya Allah telah mengunci mati hati mereka karena kekafirannya, sebagaimana yang mereka katakan bahwa hati mereka telah tertutup. Sehingga mereka terhalang dari iman sebagai hukuman untuk mereka karena itu hanya sedikit dari mereka yang beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka karena] maka karena {mereka melanggar perjanjian itu, ingkar terhadap ayat-ayat Allah, membunuh nabi-nabi tanpa hak, dan berkata, “Hati kami tertutup.”} dalam penutup {Sebenarnya Allah telah mengunci hati} mengunci {mereka karena kekufurannya. Maka mereka tidak beriman kecuali hanya sebagian kecil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153-158. Pertanyaan ini, yang bersumber dari Ahli Kitab yang dialamatkan kepada Rasulullah adalah bentuk kedurhakaan dan usulan, dan tindakan mereka menjadikan pertanyaan ini sebagai patokan hingga mereka percaya atau mendustakan, pertanyaan itu adalah bahwa mereka meminta kepada beliau agar seluruh al-Quran diturunkan secara langsung sekali turun saja sebagaimana Taurat dan Injil diturunkan. Ini adalah tindakan kezhaliman yang sangat jauh dari mereka (dan juga kebodohan), karena sesungguhnya Rasul itu adalah seorang manusia dan seorang hamba yang diatur, beliau tidak memiliki kuasa dalam hal itu sama sekali, akan tetapi perkara itu adalah milik Allah saja, Allah –lah yang mengutus dan menurunkan apa yang dikehendaki atas hamba-hambaNya, seperti Firman Allah tentang Rasul tatkala menyebutkan ayat-ayat yang menerangkan usulan orang-orang musyrik terhadap Muhammad, \"katakanlah mahasuci tuhanku tidakla keadaanku kecuali seorang pemberi kabar gembira dan sebagai seorang utusan\" (Al-Isra:93). Demikian juga tindakan mereka menjadikan pembeda antara kebenaran dan kebatilan dengan hanya sebatas turunnya al-Kitab secara keseluruhan atau terpisah-pisah, hal itu adalah sebuah tuduhan yang tidak berdasarkan dalil sama sekali, tidak sesuai bahkan tidak ada syubhat. Lalu darimana datangnya dalil pada kenabian seorang nabi di antara nabi-nabi bahwa seorang rasul yang datang kepada kalian dengan membawa kitab yang turun secara terpisah-pisah, sehingga kalian tidak beriman kepadanya dan tidak mempercayainya? Akan tetapi turunnya al-Quran secara berangsur-angsur sesuai dengan kondisi, adalah menunjukkan akan keagungan Allah dan perhatianNya kepada orang yang kitab tersebut diturunkan kepadanya, sebagaimana Allah berfirman, “Berkatalah orang-orang yang kafir: \"Mengapa Al Quran itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah supaya Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar). Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.” (Al-Furqan: 32-33). Ketika Allah menyebutkan keberatan mereka yang batil, Allah mengabarkan bahwa perbuatan mereka yang seperti itu bukanlah suatu yang aneh bahkan telah ada sikap-sikap sebelumnya dari mereka yang jelek yang lebih buruk yang mereka tempuh bersama Rasul yang mereka klaim bahwa mereka beriman kepadanya, yaitu permohonan mereka kepada beliau agar dapat melihat Allah secara nyata, tindakan mereka menjadikan patung anak sapi sebagai tuhan yang mereka sembah, setelah mereka menyaksikan bukti-bukti nyata kekuasaan Allah dengan mata kepala mereka, dan penolakan mereka untuk meneriman hukum-hukum dari kitab mereka yaitu Taurat, hingga Allah mengangkat bukit Thur di atas kepala-kepala mereka, dan mereka di ancam bahwasannya bila mereka tidak beriman, niscaya Allah akan menjatuhkan bukit itu kepada mereka. Lalu mereka meneriman hal itu dengan mata tertunduk dan keimanan palsu yang menyerepaui iman asasi. Dan juga berupa penolakan mereka untuk memasuki pintu-pintu negeri dimana mereka di perintahkan untuk memasukinya sebagai orang-orang yang bersujud dan memohon ampun, tetapi mereka menyali perintah dan perbutan yang di wajibkan. Juga tindakan melampui batas di antara mereka terhadap hari Sabtu, sehingga Allah menghukum mereka dengan hukuman yang keji tersebut, dan diambilnya perjanjian yang kuat atas mereka namun mereka melemparnya di belakang punggung mereka dan mereka kufur kepada ayat-ayat Allah, mereka membunuh rasul-rasul tanpa haq. Dan diantara perkataan mereka adalah; sesunguhnya mereka membunuh Al-masih isa dan menyalibnya, padahal kenyataannya mereka tidaklah membunuh Al- Masih dan tidak pula menyalibnya, akan tetapi orang lain diserupakan dengannya hingga mereka membunuh orang lain tersebut dan menyalibnya. Dan perngakuan mereka bahwa hati mereka tertutup, tidak memahami apa yang dikatakan dan tidak mengerti. Mereka juga menghalangi manusia dari jalan Allah hingga mereka mengalangi manusia dari kebenaran, mengajak manusia kepada apa yang mereka yakini berupa kesesatan dan penyimpangan, dan mereka juga mengambil riba dari harta-harta yang di larang, padahal Allah melarang mereka daripadanya dan telah menegaskannya. Maka orang yang malakukan perbuatan ini tidaklah aneh bila keluar dari mereka permintaan Rasul Muhammad untuk menunjukan kitab berbentuk buku kepada mereka dari langit. Jalan ini adalah sebaik-baik jalan dalam berdebat dengan lawan yang kafir, yaitu bila terjadi sanggahan yang bathil yang membuatnya jadi syubhat baginya dan bagi orang lain dalam menolak kebenaran, agar ia menjelaskan kondisinya yang licik dan perbuatan-perbuatan mereka yang keji yang merupakan perkara yang paling jelek darinya. Agar setiap orang mengetahui bahwasanya sanggahan itu berasal dari lembah yang berbahaya, dan sungguh sebelum itu ada hal-hal yang lain yang dijadikan sanggahan. Demikian juga setiap sanggahan yang mereka utarakan atas kenabian Muhammad, mungkin dapat di lawan dengan yang sama dengannya atau dengan yang lebih kuat darinya pada kenabian orang yang mereka akui beriman kepadanya, agar kejahatan mereka selesai dengan hal tersebut dan kebathilan mereka terputus. Dan setiap hujjah yang mereka tempuh untuk menetapkan kenabian orang yang mereka Imani, dan serupa dengannya atau yang lebih kuat darinya adalah menunjukan dan menetapkan kanabian Muhammad. Dan tatkala maksud dari penyebutan kejelekan-kejelekan mereka oleh Allah itu adalah bantahan, Allah tidak meluaskan penjelasan pada bagian ini, akan tetapi Allah mengisyaratkan tentangnya dan mengindikasikan tempat-tempatnya (dalam al-Quran), dan sesungguhnya Allah telah meluaskan penjelasannya pada tempat lain yang sesuai untuk diperluas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 155: Maka (Kami la'nat mereka) lantaran mereka pecahkan perjanjian meréka, dan (lantaran) kufur mereka kepada ayat-ayat Allah, dan (lantaran) mereka bunuh nabi-nabi dengan tidak sebenarnya, dan (lantaran) perkataan mereka: \"Hati kami telah tertutup'\", dan bahkan telah metrai atas hati mereka dengan sebab kekufuran mereka. Lantaran itu mereka tidak akan beriman melainkan sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hukuman kepada mereka adalah dengan mengutuk mereka, mereka disambar petir, menjelmakan mereka menjadi kera, dan sebagainya. Kepada Nabi Muhammad shallallahu 'alaihi wa sallam. Seperti Abdullah bin Salam dan kawan-kawannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 155",
    "description": "Maka kami hukum mereka karena mereka melanggar perjanjian itu, yaitu mereka mengabaikan perintah Allah yang termaktub di dalam kitab taurat, dan karena kekafiran mereka terhadap keterangan-keterangan Allah yang disampaikan oleh para utusan Allah, serta karena mereka telah membunuh nabi-nabi tanpa hak, tanpa alasan yang benar. Mereka membunuh nabi zakaria, nabi yahya dan lain-lainnya. Dan karena mereka mengatakan, hati kami tertutup. Maksudnya hati mereka ditutup oleh Allah, sehingga mereka merasa tidak berdosa disebabkan perbuatan itu. Ucapan yang demikian itu hanya dijadikan alasan oleh mereka. Sebenarnya, Allah telah mengunci hati mereka karena kekafirannya, karena itu hanya sebagian kecil dari mereka yang beriman kepada Allah dan kepada para rasul-Nya tanpa membedakan rasul yang satu dengan lainnyadan kami hukum juga mereka karena kekafiran mereka terhadap isa, mereka tidak percaya bahwa isa adalah utusan Allah, dan tuduhan mereka yang sangat keji yang mengandung kedustaan yang besar terhadap maryam, yaitu menuduhnya berzina padahal telah dibuktikan kesuciannya."
  }
]