[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Demikian pula kami melaknat mereka disebabkan kekafiran mereka dan kedustaan mereka terhadap Maryam atas tuduhan yang mereka tujukan kepadanya berupa perzinaan,padahal dia bersih dari tuduhan itu,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "156. Dan Kami jauhkan mereka dari rahmat karena kekafiran mereka. Dan juga karena mereka telah menuduh Maryam -‘Alaihassalām- berbuat zina atas dasar dusta belaka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "156. Dan hati yang tertutup ini akibat dari keingkaran dan tuduhan keji mereka terhadap Maryam binti Imran yang merupakan wanita yang jujur dan senantiasa beribadah kepada Allah. Mereka menuduhnya telah berbuat keji dan menodai kehormatannya, dan mendustakan kenabian anaknya Isa dan merencanakan keburukan baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "156. وَبِكُفْرِهِمْ (Dan karena kekafiran mereka) Yakni kekafiran terhadap Nabi Isa. وَقَوْلِهِمْ عَلَىٰ مَرْيَمَ بُهْتٰنًا عَظِيمًا(dan tuduhan mereka terhadap Maryam dengan kedustaan besar) Yakni menuduhnya bahwa ia berbuat keji dengan Yusuf an-Najjar, padahal Yusuf ini adalah termasuk orang yang shaleh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "156 Sebab kekafiran mereka kepada Isa AS dan tuduhan mereka terhadap sayyidah Maryam dengan kedustaan besar yaitu zina dengan Yusuf seorang tukang kayu dengan tunduhan yang sangat keji, atau dengan dengan dusta yang di luar nalar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Karena kekufuran dan ucapan mereka terhadap Maryam dengan tuduhan palsu yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153-158. Pertanyaan ini, yang bersumber dari Ahli Kitab yang dialamatkan kepada Rasulullah adalah bentuk kedurhakaan dan usulan, dan tindakan mereka menjadikan pertanyaan ini sebagai patokan hingga mereka percaya atau mendustakan, pertanyaan itu adalah bahwa mereka meminta kepada beliau agar seluruh al-Quran diturunkan secara langsung sekali turun saja sebagaimana Taurat dan Injil diturunkan. Ini adalah tindakan kezhaliman yang sangat jauh dari mereka (dan juga kebodohan), karena sesungguhnya Rasul itu adalah seorang manusia dan seorang hamba yang diatur, beliau tidak memiliki kuasa dalam hal itu sama sekali, akan tetapi perkara itu adalah milik Allah saja, Allah –lah yang mengutus dan menurunkan apa yang dikehendaki atas hamba-hambaNya, seperti Firman Allah tentang Rasul tatkala menyebutkan ayat-ayat yang menerangkan usulan orang-orang musyrik terhadap Muhammad, \"katakanlah mahasuci tuhanku tidakla keadaanku kecuali seorang pemberi kabar gembira dan sebagai seorang utusan\" (Al-Isra:93). Demikian juga tindakan mereka menjadikan pembeda antara kebenaran dan kebatilan dengan hanya sebatas turunnya al-Kitab secara keseluruhan atau terpisah-pisah, hal itu adalah sebuah tuduhan yang tidak berdasarkan dalil sama sekali, tidak sesuai bahkan tidak ada syubhat. Lalu darimana datangnya dalil pada kenabian seorang nabi di antara nabi-nabi bahwa seorang rasul yang datang kepada kalian dengan membawa kitab yang turun secara terpisah-pisah, sehingga kalian tidak beriman kepadanya dan tidak mempercayainya? Akan tetapi turunnya al-Quran secara berangsur-angsur sesuai dengan kondisi, adalah menunjukkan akan keagungan Allah dan perhatianNya kepada orang yang kitab tersebut diturunkan kepadanya, sebagaimana Allah berfirman, “Berkatalah orang-orang yang kafir: \"Mengapa Al Quran itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah supaya Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar). Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.” (Al-Furqan: 32-33). Ketika Allah menyebutkan keberatan mereka yang batil, Allah mengabarkan bahwa perbuatan mereka yang seperti itu bukanlah suatu yang aneh bahkan telah ada sikap-sikap sebelumnya dari mereka yang jelek yang lebih buruk yang mereka tempuh bersama Rasul yang mereka klaim bahwa mereka beriman kepadanya, yaitu permohonan mereka kepada beliau agar dapat melihat Allah secara nyata, tindakan mereka menjadikan patung anak sapi sebagai tuhan yang mereka sembah, setelah mereka menyaksikan bukti-bukti nyata kekuasaan Allah dengan mata kepala mereka, dan penolakan mereka untuk meneriman hukum-hukum dari kitab mereka yaitu Taurat, hingga Allah mengangkat bukit Thur di atas kepala-kepala mereka, dan mereka di ancam bahwasannya bila mereka tidak beriman, niscaya Allah akan menjatuhkan bukit itu kepada mereka. Lalu mereka meneriman hal itu dengan mata tertunduk dan keimanan palsu yang menyerepaui iman asasi. Dan juga berupa penolakan mereka untuk memasuki pintu-pintu negeri dimana mereka di perintahkan untuk memasukinya sebagai orang-orang yang bersujud dan memohon ampun, tetapi mereka menyali perintah dan perbutan yang di wajibkan. Juga tindakan melampui batas di antara mereka terhadap hari Sabtu, sehingga Allah menghukum mereka dengan hukuman yang keji tersebut, dan diambilnya perjanjian yang kuat atas mereka namun mereka melemparnya di belakang punggung mereka dan mereka kufur kepada ayat-ayat Allah, mereka membunuh rasul-rasul tanpa haq. Dan diantara perkataan mereka adalah; sesunguhnya mereka membunuh Al-masih isa dan menyalibnya, padahal kenyataannya mereka tidaklah membunuh Al- Masih dan tidak pula menyalibnya, akan tetapi orang lain diserupakan dengannya hingga mereka membunuh orang lain tersebut dan menyalibnya. Dan perngakuan mereka bahwa hati mereka tertutup, tidak memahami apa yang dikatakan dan tidak mengerti. Mereka juga menghalangi manusia dari jalan Allah hingga mereka mengalangi manusia dari kebenaran, mengajak manusia kepada apa yang mereka yakini berupa kesesatan dan penyimpangan, dan mereka juga mengambil riba dari harta-harta yang di larang, padahal Allah melarang mereka daripadanya dan telah menegaskannya. Maka orang yang malakukan perbuatan ini tidaklah aneh bila keluar dari mereka permintaan Rasul Muhammad untuk menunjukan kitab berbentuk buku kepada mereka dari langit. Jalan ini adalah sebaik-baik jalan dalam berdebat dengan lawan yang kafir, yaitu bila terjadi sanggahan yang bathil yang membuatnya jadi syubhat baginya dan bagi orang lain dalam menolak kebenaran, agar ia menjelaskan kondisinya yang licik dan perbuatan-perbuatan mereka yang keji yang merupakan perkara yang paling jelek darinya. Agar setiap orang mengetahui bahwasanya sanggahan itu berasal dari lembah yang berbahaya, dan sungguh sebelum itu ada hal-hal yang lain yang dijadikan sanggahan. Demikian juga setiap sanggahan yang mereka utarakan atas kenabian Muhammad, mungkin dapat di lawan dengan yang sama dengannya atau dengan yang lebih kuat darinya pada kenabian orang yang mereka akui beriman kepadanya, agar kejahatan mereka selesai dengan hal tersebut dan kebathilan mereka terputus. Dan setiap hujjah yang mereka tempuh untuk menetapkan kenabian orang yang mereka Imani, dan serupa dengannya atau yang lebih kuat darinya adalah menunjukan dan menetapkan kanabian Muhammad. Dan tatkala maksud dari penyebutan kejelekan-kejelekan mereka oleh Allah itu adalah bantahan, Allah tidak meluaskan penjelasan pada bagian ini, akan tetapi Allah mengisyaratkan tentangnya dan mengindikasikan tempat-tempatnya (dalam al-Quran), dan sesungguhnya Allah telah meluaskan penjelasannya pada tempat lain yang sesuai untuk diperluas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 156: Dan lantaran kekufuran mereka dan (lantaran) perkataan mereka atas Maryam satu dusta bikinan yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 156",
    "description": "Dan kami hukum juga mereka karena kekafiran mereka terhadap isa, mereka tidak percaya bahwa isa adalah utusan Allah, dan tuduhan mereka yang sangat keji yang mengandung kedustaan yang besar terhadap maryam, yaitu menuduhnya berzina padahal telah dibuktikan kesuciannyakami hukum juga mereka karena ucapan mereka, sesungguhnya kami telah membunuh al-masih, isa putra maryam, yang mereka ejek dengan menamainya rasul Allah padahal mereka tidak beriman kepadanya. Mereka mengatakan telah membunuhnya, padahal mereka tidak membunuhnya dan tidak pula menyalibnya, tetapi diserupakan bagi mereka orang yang dibunuh itu dengan nabi isa. Sesungguhnya mereka yang berselisih pendapat tentangnya, yakni tentang nabi isa, benar-benar dalam keragu-raguan tentang hal, yakni pembunuhan itu. Mereka tidak mempunyai sedikit pun pengetahuan menyangkut hal itu, yakni tentang pembunuhan nabi isa, dan apa yang mereka katakan kecuali mengikuti persangkaan belaka, dan mereka tidak membunuhnya dengan yakin. Tetapi Allah telah mengangkatnya, isa, kepada-Nya, yakni mengangkatnya ke tempat yang aman sehingga tidak dapat disentuh oleh musuh-Musuhnya. Dan Allah maha perkasa, mengalahkan musuh-Musuhnya, maha bijaksana dalam segala perbuatan-Nya."
  }
]