[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan juga disebabkan oleh ucapan mereka (demi mengejek dan memperolok-olok) ”sesungguhnya kami telah membunuh Almasih Isa bin Maryam utusan Allah, Padahal mereka sebenarnya tidak membunuhnya dan tidak menyalibnya. Bahkan mereka hanyalah menyalib seorang lelaki yang menyerupainya,karena menyangka dia adalah isa purta Maryam. Barangsiapa yang mengklaim telah membunuhnya dari kalanagn yahudi dan mengaku telah menyerahkannya kepada mereka dari kalangan nasrani,maka mereka semua terjatuh dalam keragu-raguan dan kebingungan.Tidak ada ilmu pada mereka,kecuali sekedar mengikuti persangkaan belaka. Dan mereka tidaklah membunuhnya dengan yakin,sebaliknya,mereka ragu-ragu lagi sekedar mengira-ngira saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "157. Kami juga mengutuk mereka karena ucapan mereka yang bernada bangga padahal dusta belaka, “Sesungguhnya kami telah membunuh Al-Masih Isa putra Maryam, utusan Allah.” Sedangkan mereka tidak pernah membunuhnya sebagaimana pengakuan mereka dan tidak pernah menyalibnya. Akan tetapi mereka membunuh dan menyalib seorang laki-laki yang Allah ubah wujudnya menjadi mirip dengan Isa -‘Alaihissalām-. Lalu mereka mengira bahwa yang mereka bunuh itu adalah Isa. Orang-orang Yahudi yang mengaku membunuhnya dan orang-orang Nasrani yang menyerahkannya kepada orang-orang Yahudi sama-sama bingung dan bimbang mengenai hal itu. Mereka tidak memiliki pengetahuan yang pasti. Mereka hanya mengikuti prasangka semata. Padahal prasangka itu tidak bisa membuktikan kebenaran sedikit pun. Yang pasti, mereka tidak pernah membunuh Isa dan tidak pernah menyalibnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "157- 158. mereka berhak mendapatkan balasan tersebut karena merencanakan pembunuh kisah. Namun Allah menyelamatkannya dari para musuh kemudian mewafatkannya dan mengangkatnya ke langit. Dan orang-orang yang berencana membunuh Isa itu kemudian menyalib seorang laki-laki yang menyerupainya dan menyangka dia adalah Isa Al-masih, sehingga orang-orang Yahudi menyangka telah membunuhnya, padahal mereka telah terkecoh dan tertipu oleh tipu daya dan bualan para pembesar mereka. Terjadi perselisihan sengit antara orang-orang Yahudi dan Nasrani mengenai perkara Isa dan kehidupannya. Mereka saling berselisih tentang hakikat dan risalahnya sebagaimana perselisihan mereka mengenai kematiannya. Hal ini mengakibatkan mereka terpecah menjadi banyak golongan yang semuanya tersesat dan kebingungan dalam memahami hakikat isa sehingga mereka saling mengkafirkan dan saling menuduh. Mereka membangun akidah mereka diatas prasangka-prasangka dan dugaan-dugaan dan menyulamnya dengan dongeng-dongeng dan khurafat. Namun kenyataannya tidak seperti yang mereka sangka, mereka sama sekali tidak membunuhnya, bahkan mereka sendiri tidak yakin telah membunuhnya. Namun dengan kuasa Allah Yang Maha Besar, Dia mengangkatnya ke langit dalam keadaan hidup dengan ruh dan jasadnya. Allah Maha Perkasa dalam kuasa-Nya dan Maha Bijaksana dalam pengaturan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "157. وَقَوْلِهِمْ إِنَّا قَتَلْنَا الْمَسِيحَ عِيسَى ابْنَ مَرْيَمَ رَسُولَ اللهِ (dan karena ucapan mereka: “Sesungguhnya kami telah membunuh Al Masih, Isa putra Maryam, Rasul Allah”) Mereka berdusta bahwa mereka telah membunuh Nabi Isa, dan mereka berbangga telah membunuhnya. Dan penyebutan mereka terhadap Nabi Isa dengan sebutan “Rasulullah” kemungkinan hanyalah sebagai olok-olok karena mereka sebenarnya mengingkari kerasulannya, dan tidak mengakui kalau ia merupakan benar-benar Rasul yang diutus oleh Allah. وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ (padahal mereka tidak membunuhnya dan tidak (pula) menyalibnya) Yakni Allah mengingkari pengakuan mereka bahwa mereka telah membunuh Nabi Isa dan menyalibnya. Dan ini merupakan kebohongan terbesar sepanjang sejarah. وَلٰكِن شُبِّهَ لَهُمْ ۚ (tetapi (yang mereka bunuh ialah) orang yang diserupakan dengan Isa bagi mereka) Yakni Allah menyerupakan orang lain dengan Isa, kemudian mereka membunuh orang yang mereka sangka sebagai Isa. وَإِنَّ الَّذِينَ اخْتَلَفُوا۟ فِيهِ (Sesungguhnya orang-orang yang berselisih paham tentang (pembunuhan) Isa) Sebagian mereka mengatakan: kita telah membunuhnya. Dan sebagian lain yang menyaksikan pengangkatan Isa ke langit mengatakan: kita tidak membunuhnya. Menurut pendapat lain bahwa perselisihan diantara mereka adalah karena salah satu golongan Nasrani yang disebut dengan Nasthuriyah (Nestorian) mengatakan: Isa disalib dari sisi jiwa kemanusiaannya saja dan bukan dari sisi ketuhanannya. Sedangakan golongan Malkaniyah mengatakan: bahwa Isa dibunuh dan disalib sepenuhnya, baik itu sisi kemanusiaannya maupun sisi ketuhanannya –semoga Allah membinasakan mereka— bagaimana mereka bisa berpaling. لَفِى شَكٍّ مِّنْهُ ۚ (benar-benar dalam keragu-raguan tentang yang dibunuh itu) Yakni mereka tersesat dalam keraguan mereka dan kebingungan dalam kejahilan mereka. مَا لَهُم بِهِۦ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ ۚ( Mereka tidak mempunyai keyakinan tentang siapa yang dibunuh itu, kecuali mengikuti persangkaan belaka) Mereka hanya mengikuti persangkaan yang membuat mereka kebingungan dan keraguan. وَمَا قَتَلُوهُ يَقِينًۢا(mereka tidak (pula) yakin bahwa yang mereka bunuh itu adalah Isa) Yakni mereka tidak yakin kalau mereka benar-benar membunuhnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "157 Juga karena ucapan dusta mereka: “Sesungguhnya kami telah membunuh Al Masih, Isa putra Maryam, Rasul Allah, dengan menunjukkan rasa bangga karena telah membunuh itu.” Mereka juga mengolok risalahnya, padahal mereka tidak membunuhnya dan tidak pula menyalibnya seperti yang mereka klaim, tetapi yang mereka bunuh ialah orang yang diserupakan dengan Isa bagi mereka, sehingga mereka kira mereka telah membunuhnya. Sesungguhnya orang-orang yang berselisih paham tentang pembunuhan Isa, benar-benar dalam keragu-raguan tentang yang dibunuh itu. Mereka tidak mempunyai keyakinan tentang siapa yang dibunuh itu, kecuali mengikuti persangkaan belaka, mereka tidak pula yakin bahwa yang mereka bunuh itu adalah Isa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan ucapan mereka, “Sesungguhnya kami telah membunuh Isa putra Maryam, seorang utusan Allah,” padahal mereka tidak membunuhnya dan tidak pula menyalibnya, tetapi orang yang diserupakan} Dilemparkan orang lain yang menyerupainya {kepada mereka. Sesungguhnya mereka yang berselisih pendapat tentang itu} tentang perkara Isa {maka sungguh dalam keragu-raguan} keraguan dan kebingungan {terhadapnya. Mereka benar-benar tidak mengetahui, kecuali mengikuti persangkaan belaka. Mereka tidak yakin telah membunuhnya} tidak pasti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "153-158. Pertanyaan ini, yang bersumber dari Ahli Kitab yang dialamatkan kepada Rasulullah adalah bentuk kedurhakaan dan usulan, dan tindakan mereka menjadikan pertanyaan ini sebagai patokan hingga mereka percaya atau mendustakan, pertanyaan itu adalah bahwa mereka meminta kepada beliau agar seluruh al-Quran diturunkan secara langsung sekali turun saja sebagaimana Taurat dan Injil diturunkan. Ini adalah tindakan kezhaliman yang sangat jauh dari mereka (dan juga kebodohan), karena sesungguhnya Rasul itu adalah seorang manusia dan seorang hamba yang diatur, beliau tidak memiliki kuasa dalam hal itu sama sekali, akan tetapi perkara itu adalah milik Allah saja, Allah –lah yang mengutus dan menurunkan apa yang dikehendaki atas hamba-hambaNya, seperti Firman Allah tentang Rasul tatkala menyebutkan ayat-ayat yang menerangkan usulan orang-orang musyrik terhadap Muhammad, \"katakanlah mahasuci tuhanku tidakla keadaanku kecuali seorang pemberi kabar gembira dan sebagai seorang utusan\" (Al-Isra:93). Demikian juga tindakan mereka menjadikan pembeda antara kebenaran dan kebatilan dengan hanya sebatas turunnya al-Kitab secara keseluruhan atau terpisah-pisah, hal itu adalah sebuah tuduhan yang tidak berdasarkan dalil sama sekali, tidak sesuai bahkan tidak ada syubhat. Lalu darimana datangnya dalil pada kenabian seorang nabi di antara nabi-nabi bahwa seorang rasul yang datang kepada kalian dengan membawa kitab yang turun secara terpisah-pisah, sehingga kalian tidak beriman kepadanya dan tidak mempercayainya? Akan tetapi turunnya al-Quran secara berangsur-angsur sesuai dengan kondisi, adalah menunjukkan akan keagungan Allah dan perhatianNya kepada orang yang kitab tersebut diturunkan kepadanya, sebagaimana Allah berfirman, “Berkatalah orang-orang yang kafir: \"Mengapa Al Quran itu tidak diturunkan kepadanya sekali turun saja?\"; demikianlah supaya Kami perkuat hatimu dengannya dan Kami membacanya secara tartil (teratur dan benar). Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.” (Al-Furqan: 32-33). Ketika Allah menyebutkan keberatan mereka yang batil, Allah mengabarkan bahwa perbuatan mereka yang seperti itu bukanlah suatu yang aneh bahkan telah ada sikap-sikap sebelumnya dari mereka yang jelek yang lebih buruk yang mereka tempuh bersama Rasul yang mereka klaim bahwa mereka beriman kepadanya, yaitu permohonan mereka kepada beliau agar dapat melihat Allah secara nyata, tindakan mereka menjadikan patung anak sapi sebagai tuhan yang mereka sembah, setelah mereka menyaksikan bukti-bukti nyata kekuasaan Allah dengan mata kepala mereka, dan penolakan mereka untuk meneriman hukum-hukum dari kitab mereka yaitu Taurat, hingga Allah mengangkat bukit Thur di atas kepala-kepala mereka, dan mereka di ancam bahwasannya bila mereka tidak beriman, niscaya Allah akan menjatuhkan bukit itu kepada mereka. Lalu mereka meneriman hal itu dengan mata tertunduk dan keimanan palsu yang menyerepaui iman asasi. Dan juga berupa penolakan mereka untuk memasuki pintu-pintu negeri dimana mereka di perintahkan untuk memasukinya sebagai orang-orang yang bersujud dan memohon ampun, tetapi mereka menyali perintah dan perbutan yang di wajibkan. Juga tindakan melampui batas di antara mereka terhadap hari Sabtu, sehingga Allah menghukum mereka dengan hukuman yang keji tersebut, dan diambilnya perjanjian yang kuat atas mereka namun mereka melemparnya di belakang punggung mereka dan mereka kufur kepada ayat-ayat Allah, mereka membunuh rasul-rasul tanpa haq. Dan diantara perkataan mereka adalah; sesunguhnya mereka membunuh Al-masih isa dan menyalibnya, padahal kenyataannya mereka tidaklah membunuh Al- Masih dan tidak pula menyalibnya, akan tetapi orang lain diserupakan dengannya hingga mereka membunuh orang lain tersebut dan menyalibnya. Dan perngakuan mereka bahwa hati mereka tertutup, tidak memahami apa yang dikatakan dan tidak mengerti. Mereka juga menghalangi manusia dari jalan Allah hingga mereka mengalangi manusia dari kebenaran, mengajak manusia kepada apa yang mereka yakini berupa kesesatan dan penyimpangan, dan mereka juga mengambil riba dari harta-harta yang di larang, padahal Allah melarang mereka daripadanya dan telah menegaskannya. Maka orang yang malakukan perbuatan ini tidaklah aneh bila keluar dari mereka permintaan Rasul Muhammad untuk menunjukan kitab berbentuk buku kepada mereka dari langit. Jalan ini adalah sebaik-baik jalan dalam berdebat dengan lawan yang kafir, yaitu bila terjadi sanggahan yang bathil yang membuatnya jadi syubhat baginya dan bagi orang lain dalam menolak kebenaran, agar ia menjelaskan kondisinya yang licik dan perbuatan-perbuatan mereka yang keji yang merupakan perkara yang paling jelek darinya. Agar setiap orang mengetahui bahwasanya sanggahan itu berasal dari lembah yang berbahaya, dan sungguh sebelum itu ada hal-hal yang lain yang dijadikan sanggahan. Demikian juga setiap sanggahan yang mereka utarakan atas kenabian Muhammad, mungkin dapat di lawan dengan yang sama dengannya atau dengan yang lebih kuat darinya pada kenabian orang yang mereka akui beriman kepadanya, agar kejahatan mereka selesai dengan hal tersebut dan kebathilan mereka terputus. Dan setiap hujjah yang mereka tempuh untuk menetapkan kenabian orang yang mereka Imani, dan serupa dengannya atau yang lebih kuat darinya adalah menunjukan dan menetapkan kanabian Muhammad. Dan tatkala maksud dari penyebutan kejelekan-kejelekan mereka oleh Allah itu adalah bantahan, Allah tidak meluaskan penjelasan pada bagian ini, akan tetapi Allah mengisyaratkan tentangnya dan mengindikasikan tempat-tempatnya (dalam al-Quran), dan sesungguhnya Allah telah meluaskan penjelasannya pada tempat lain yang sesuai untuk diperluas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 157: Dan (lantaran) perkataan mereka: \"Kami telah bunuh Al-Masih, Isa, anak Maryam, pesuruh Allah\", padahal mereka tidak bu- nuh dia dan mereka tidak salib dia tetapi disamarkan dan sesungguhnya orang-orang yang berselisihan (faham) di tentang itu, bagi mereka, di dalam syak padanya, adalah mereka tidak mempunyai pengetahuan di tentang itu melainkan turut sangka-sangkaan (saja), dan mereka tidak bunuh dia dengan yakin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan bangga. Mereka menyebut Isa putera Maryam itu Rasul Allah ialah sebagai ejekan, karena mereka sendiri tidak mempercayai kerasulan Isa itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 157",
    "description": "Kami hukum juga mereka karena ucapan mereka, sesungguhnya kami telah membunuh al-masih, isa putra maryam, yang mereka ejek dengan menamainya rasul Allah padahal mereka tidak beriman kepadanya. Mereka mengatakan telah membunuhnya, padahal mereka tidak membunuhnya dan tidak pula menyalibnya, tetapi diserupakan bagi mereka orang yang dibunuh itu dengan nabi isa. Sesungguhnya mereka yang berselisih pendapat tentangnya, yakni tentang nabi isa, benar-benar dalam keragu-raguan tentang hal, yakni pembunuhan itu. Mereka tidak mempunyai sedikit pun pengetahuan menyangkut hal itu, yakni tentang pembunuhan nabi isa, dan apa yang mereka katakan kecuali mengikuti persangkaan belaka, dan mereka tidak membunuhnya dengan yakin. Tetapi Allah telah mengangkatnya, isa, kepada-Nya, yakni mengangkatnya ke tempat yang aman sehingga tidak dapat disentuh oleh musuh-Musuhnya. Dan Allah maha perkasa, mengalahkan musuh-Musuhnya, maha bijaksana dalam segala perbuatan-Nya"
  }
]