[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesunguhnya tidak ada seorangpun yang tersisa dari ahli kitab setelah turunnya isa pada akhir zaman, kecuali akan beriman kepadanya sebelum dia meninggal. Dan pada hari kiamat,isa akan menjadi saksi untuk mendustakan orang-orang yang mendustakannya dan membenarkan orang-orang yang mengimaninya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "159. Semua ahli kitab -tanpa kecuali- akan beriman kepada Isa -‘Alaihissalām- setelah ia turun ke bumi pada akhir zaman dan sebelum kematiannya. Dan pada hari Kiamat kelak Isa -‘Alaihissalām- akan menjadi saksi atas amal perbuatan mereka; mana yang sesuai dengan syariat Allah dan mana menyelisihinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "159. Dan kelak pada akhir zaman, orang-orang Yahudi dan Nasrani akan mengetahui hakikat yang sebenarnya dari Isa sebelum kematiannya. Karena dia akan menjadi saksi bagi orang yang membenarkannya dan menjadi saksi atas orang yang mengingkarinya dan salah dalam mengenalnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "159. وَإِن مِّنْ أَهْلِ الْكِتٰبِ إِلَّا لَيُؤْمِنَنَّ بِهِۦ قَبْلَ مَوْتِهِۦ ۖ (Tidak ada seorangpun dari Ahli Kitab, kecuali akan beriman kepadanya (Isa) sebelum kematiannya) Yakni tidaklah meninggal seorang Yahudi atau Nasrani kecuali ia beriman kepada Isa al-Masih. Pendapat lain mengatakan maknanya adalah Nabi Isa yang kini masih hidup di langit tidak akan meninggal sampai semua Ahli Kitab beriman kepadanya pada masanya. Dan pendapat lain mengatakan maknanya adalah orang-orang dari Ahli Kitab akan mendapatkan Nabi Isa ketika ia diutus dan mereka akan beriman kepadanya. Dan yang dimaksud dengan beriman kepadanya adalah ketika ia turun di akhir zaman sebagaimana disebutkan dalam hadist-hadist. وَيَوْمَ الْقِيٰمَةِ يَكُونُ عَلَيْهِمْ شَهِيدًا(Dan di hari kiamat nanti Isa itu akan menjadi saksi terhadap mereka) Yakni Nabi Isa akan menjadi saksi atas Ahli Kitab, bersaksi bahwa orang-orang Yahudi mendustakannya dan orang-orang Nasrani melebih-lebihkannya hingga menganggapnya anak Allah, serta bersaksi bagi orang yang beriman kepadanya dengan keimanan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "159 Tidak ada seorangpun Ahli Kitab baik dari Nasrani maupun Yahudi, melainkan mereka akan beriman kepada Isa dengan benar bahwa dia adalah seorang Rasul, bukan Tuhan sebelum kewafatannya. Dan di hari kiamat nanti Isa akan menjadi saksi terhadap mereka yang mengimani atau mendustakannya. Isa akan bersaksi atas orang Yahudi yang mendustakannya, dan atas orang Nasrani yang menjadikannya Tuhan. Sehingga mereka berkata: sebenarnya dia itu Tuhan atau anak Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada} tidak ada {di antara Ahlul kitab, kecuali beriman kepadanya} Isa ketika turun dari langit di akhir zaman {menjelang kematiannya. Pada hari kiamat dia akan menjadi saksi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "159. Dan FirmanNya, “Tidak ada seorang pun dari Ahli KItab, kecuali akan beriman kepadanya (Isa) sebelum kematiannya.” Kemungkinan kata ganti di sini pada FirmanNya “sebelum kematiannya,” kembali kepada Ahli KItab. Maka atas dasar asumsi ini, setiap orang dari Ahli KItab yang akan meninggal dan mengetahui perkara dengan benar, sesungguhnya ia beriman kepada Isa, akan tetapi keimanan itu sudah tidak berguna lagi, dan merupakan keimanan yang terpaksa. Karena itu kandungan dari ancaman dan peringatan ini adalah agar mereka tidak terus-terusan dalam kondisi seperti itu di mana mereka akan menyesalinya sebelum kematian mereka, lalu bagaimanakah kondisi mereka di hari mereka dibangkitkan dan dikumpulkan? Kata ganti dalam FirmanNya, “Sebelum kematiannya” itu juga mungkin kembali kepada Isa, maka maknanya adalah, dan tidaklah seorang pun dari Ahli Kitab kecuali pasti akan beriman kepada al-Masih sebelum kematian al-Masih, yang demikian itu akan terjadi pada saat Hari Kiamat sudah dekat kelak dan penampakan tanda-tanda besarnya. Karena terrdapat banyak hadist-hadist shahih tentang akan turunnya Isa pada akhir umat ini, beliau akan membunuh Dajjal, menghapuskan jizyah, Ahli Kitab akan beriman kepadanya bersama kaum Mukminin. “Dan Pada Hari Kiamat” Isa akan menjadi saksi atas mereka dengan perbuatan-perbuatan mereka, apakah sesuai dengan syariat Allah atau tidak? Saat itu tidaklah ia akan bersaksi kecuali tentang kebatilan setiap hal yang mereka yakini yang bertentangan dengan syariat al-Quran, dan tatkala Muhammad menyeru mereka kepadanya, kita menjadi tahu dari hal itu atas dasar pengetahuan kita tentang kesempurnaan keadilan Isa dan kebenarannya, dan bahwasanya ia tidaklah akan bersaksi kecuali dengan kebenaran, hanya saja apa yang dibawa oleh Nabi Muhammad itulah yang benar dana pa yang selain dari itu adalah sesat dan batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 159: Dan tidak ada (seorang pun) dari Ahlul-Kitab melainkan mereka beriman kepadanya sebelum matinya, dan pada hari Kiamat, ia akan jadi saksi atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan, bahwa dhamir (kata ganti nama) dari kata \"mautihii\" kembalinya kepada Ahli Kitab, yakni bahwa Ahli Kitab akan beriman kepadanya ketika menyaksikan malaikat maut, namun beriman ketika itu tidaklah bermanfaat. Ada pula yang menafsirkan, bahwa dhamir \"hii\" (dia) kembalinya kepada Nabi Isa 'alaihis salam, sehingga maksudnya adalah bahwa sebelum meninggalnya Nabi Isa 'alaihis salam setelah turunnya ke dunia menjelang hari Kiamat, setiap Ahli Kitab akan beriman kepadanya sebagaimana disebutkan dalam hadits. Turunnya Nabi Isa 'alaihis salam adalah salah satu di antara tanda-tanda hari kiamat. Rasulullah shallallahu 'alaihi wa sallam bersabda: « وَالَّذِى نَفْسِى بِيَدِهِ لَيُوشِكَنَّ أَنْ يَنْزِلَ فِيكُمُ ابْنُ مَرْيَمَ حَكَماً مُقْسِطاً فَيَكْسِرَ الصَّلِيبَ ، وَيَقْتُلَ الْخِنْزِيرَ ، وَيَضَعَ الْجِزْيَةَ ، وَيَفِيضَ الْمَالُ حَتَّى لاَ يَقْبَلَهُ أَحَدٌ » . “Demi Allah yang diriku di Tangan-Nya, pasti akan turun kepada kamu putera Maryam (Isa) sebagai hakim yang adil, ia akan mematahkan salib, membunuh babi, meniadakan pajak dan harta akan melimpah ruah sehingga tidak ada seorang pun yang mau menerimanya.” (HR. Bukhari) Kata-kata “sebagai hakim yang adil” maksudnya adalah bahwa ia akan turun sebagai hakim yang memutuskan dengan syari’at Nabi Muhammad shallallahu 'alaihi wa sallam. Kata-kata “akan mematahkan salib” maksudnya ia benar-benar mematahkan salib dan membatalkan anggapan Nasrani bahwa dirinya memuliakan salib. Sedangkan kata-kata “meniadakan pajak” maksudnya adalah bahwa ketika itu orang-orang masuk ke dalam Islam, sehingga tidak ada lagi ahludz dzimmah yang membayar pajak, karena mereka semua masuk Islam. Ada juga yang mengatakan bahwa ketika Nabi Isa ‘alaihis salam turun, harta melimpah ruah sehingga tidak ada lagi orang yang mungkin diberi harta jizyah, akhirnya jizyah (pajak) ditinggalkan. Ada juga yang berpendapat bahwa hadits di atas menunjukkan bahwa syari’at jizyah berlaku sampai turunnya Nabi ‘Isa (lih. Fat-hul Bari). Ibnu Ishaq berkata, \"Nabi ‘Isa ‘alaihis salam berdo’a kepada Allah ‘Azza wa Jalla agar ajalnya ditangguhkan, agar dia dapat menyampaikan dakwah, menyempurnakan dakwahnya dan memperbanyak orang masuk ke dalam agama Allah.” Oleh karena itu, setelah Nabi Isa ‘alaihis salam turun ke dunia dan mengajak manusia kepada Islam, banyak orang-orang yang masuk Islam, bahkan sebelum wafatnya Nabi Isa ‘alaihis salam nanti, semua ahlul kitab akan beriman kepadanya dengan memeluk Islam (lih. Surat Al Maa’idah: 159) Nabi ‘Isa tinggal di bumi setelah turunnya selama tujuh tahun, lalu wafat. Jika ditambah dengan umur ketika ia belum diangkat ke langit adalah tiga puluh tiga tahun. Sehingga umur Beliau adalah 40 tahun di bumi, hal ini sebagaimana dijelaskan Ibnu Katsir dalam Al Bidayahnya. Tentang sikap mereka terhadapnya ketika Beliau diutus kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 159",
    "description": "Tidak ada seorang pun di antara ahli kitab, baik yahudi maupun nasrani, yang tidak beriman kepadanya, yakni kepada nabi isa bahwa beliau adalah utusan Allah, sebelum kematiannya, yakni sebelum kematian dari ahli kitab itu. Dan pada hari kiamat, dia, nabi isa, akan menjadi saksi terhadap mereka bahwa beliau adalah utusan Allah, dan tidak pernah menyampaikan kepada umatnya selain apa yang diperintahkan Allah agar disampaikan kepadanyamaka disebabkan karena kezaliman orang-orang yahudi, sebagaimana diterangkan dalam ayat sebelum ini, kami haramkan kepada mereka makanan yang baik-baik yang dahulu, sebelum mereka berbuat kedurhakaan itu, pernah dihalalkan, antara lain semua binatang yang berkuku sebagaimana disebutkan dalam surah al-an'a'm/6: 146; dan karena mereka sering menghalangi orang lain dari jalan Allah dengan melarang berbuat baik dan menyuruh kepada yang mungkar."
  }
]