[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dua orang yang melakukan perbuatan zina, maka hukumlah mereka berdua dengan pukulan,pengucilan,dan celaan. Maka apabila mereka sudah bertaubat dari perbuatan yang mereka terjerumus di dalamnya dan telah memperbaiki diri dengan apa yang mereka lakukan berupa amal-amal shalih, maka hentikanlah untuk menyakiti mereka berdua. Dapat diambil pelajaran dari ayat ini dan ayat sebelumnya bahwa kaum lelaki bila melakuakan perbuatan keji (zina), maka mereka dikenai hukuman-hukuman.dan perempuan dikurung serta dihukum. Kurungan berakhir dengan kematian. Sementara hukuman-hukuman berakhir dengan adanya taubat dan perbaikan diri. Ketetapan ini dahulu berlaku di awal datangnya islam.Kemudian dimansukh (diganti) dengan ajaran yang disyariatkan Allah dan rasulNYA, yaitu hukum rajam bagi lelaki muhsan dan wanita muhshanah, yakni lelaki dan wanita yang merdeka, baligh lagi berakal, yang pernah melakukan hubungan intim dalam pernikahan yang sah. Dan hukuman dera sebanyak 100 pukulan dan pengasingan selama satu tahun bagi selain mereka berdua. Sesungguhnya Allah Maha Menerima taubat hamba-hambaNYA yang mau bertaubat, lagi Maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan dua orang laki-laki yang berbuat zina, baik muḥṣan (pernah menikah) maupun gairu muḥṣan (belum pernah menikah), maka hukumlah mereka dengan lisan dan tangan. Yaitu dengan ucapan dan tindakan yang bernada merendahkan dan mengecam. Jika keduanya berhenti dari perbuatan buruk mereka dan berubah menjadi baik, maka berpalinglah dari hukuman mereka tersebut. Karena orang yang bertaubat dari dosanya seperti orang yang tidak berdosa. Sesungguhnya Allah Maha Menerima taubat hamba-hamba-Nya yang bertaubat dan Maha Penyayang kepada mereka. Hukuman semacam itu berlaku pada masa-masa awal saja. Kemudian mansukh (tidak berlaku lagi) diganti dengan hukuman cambuk dan pengasingan bagi yang belum menikah (gairu muḥṣan), dan hukuman rajam bagi yang pernah menikah (muḥṣan)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Dan pria dan wanita yang melakukan perbuatan zina, hukumannya adalah ta’zir dan pukulan dengan sandal. Namun hukuman ini dihapus dengan hukuman rajam dan cambuk, sebagaimana yang akan disebutkan dalam tafsir awal surat an-Nur. Jika dua orang ini bertaubat sebelum ditegakkan hukuman atas mereka, dan mereka memperbaiki perilaku mereka, maka janganlah kalian menghukum mereka. Sungguh Allah Maha Menerima taubat orang yang bertaubat dan Maha Mengasihi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَالَّلذَانِ يَأْتِيٰنِهَا (Dan terhadap dua orang yang melakukan perbuatan keji) Yakni laki-laki dan perempuan diantara kalian yang melakukan perbuatan keji, yaitu zina. فَـَٔاذُوهُمَا ۖ (maka berilah hukuman kepada keduanya) Yakni dengan pukulan, acuh tak acuh, dan olokan. Dan bagi perempuan yang melakukan zina hukuman berupa kurungan dan cambuk, sedangkan bagi laki-laki hukuman cambuk saja. فَإِن تَابَا (kemudian jika keduanya bertaubat) Yakni bertaubat dari perbuatan zina. وَأَصْلَحَا(dan memperbaiki diri) Dengan memperbaiki amalannya dimasa mendatang. فَأَعْرِضُوا۟ عَنْهُمَآ ۗ( maka biarkanlah mereka) Yakni biarkan mereka dan tahanlah diri kalian dalam menghukum mereka, dan hal ini berlaku sebelum turunnya hukum had sebagaimana telah disebutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Wahai hakim, bagi dua orang laki-laki yang melakukan perbuatan keji maka hukumlah mereka dengan mengecam, menegur, mengasingkan dan memukul mereka. Pemimpin itu harus memberi teguran kepada keduanya. Dan jika keduanya sudah bertaubat dari perbuatan zina sebelum melanggar batasnya, memperbaiki sikapnya, dan menyesali perbuatan keji itu, maka biarkanlah dan jangan menghukumnya. Sesungguhnya Allah itu Maha Menerima taubat dan Maha Penyayang bagi hamba-hambaNya. Ash-Shawi menyebutkan bahwa dalam ayat itu terdapat dalil tentang pengharaman perbuatan homo seksual. Dan hukuman dalam ayat ini dalan sebelumnya telah dinasakh dengan ayat tentang hukum zina dalam surah An-Nur, baik jika ingin diterapkan untuk perkara zina, dan perkara homo seksual menurut Mazhab Imam Syafi’i"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dua orang di antara kalian yang melakukannya} melakukan perbuatan zina {berilah hukuman kepada keduanya} hukumlah mereka berdua menggunakan lisan dan tangan, hukum zina itu kemudian dinasakh dengan rajam {Jika keduanya bertaubat dan memperbaiki diri}berhenti melakukan perbuatan itu dan memperbaiki amal dan mereka{biarkanlah mereka. Sesungguhnya Allah adalah Maha Penerima taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. dan demikian juga, ”terhadap dua orang yang melakukan perbuatan keji” yaitu zina, ”diantara kalian” dari kaum laki-laki maupun wanita, ”maka berilah hukuman kepada keduanya” dengan perkataan, ejekan, penghinaan, dan pemukulan yang mendidik untuk menjauhi kekejian tersebut, dengan dasar ini, maka laki-laki yang melakukan kekejian tersebut dihukum (dengan hal-hal tersebut diatas) sedangkan wanita ditahan dan dihukum dan penahanan itu ujungnya adalah kematian sedangkan hukuman ujungnya adalah taubat dan memperbaiki diri, karena itulah Allah berfirman ”kemudian jika keduanya bertaubat” yaitu kembali dari dosa yang telah mereka lakukan dan mereka menyesali perbuatan itu lalu mereka bertekad untuk tidak mengulanginya kembali, ”dan memperbaiki’ perbuatan yang menunjukan akan kebenaran taubat mereka. ”maka biarkanlah mereka” yaitu dari menghukum mereka. ”sesungguhnya Allah maha penerima taubat lagi maha penyayang” yaitu banyak sekali menerima taubat yang dilakukan orang-orang yang berdosa dan bersalah, sangat besar kasih saying dan perbuatan baikNya, dimana diantara perbuatan baikNya itu adalah menganugerahkan kepada mereka untuk bertaubat, lalu Allah menerima taubat mereka dan memaafkan apa yang telah mereka lakukan. Faidah yang dapat diambil dari kedua ayat tersebut adalah bahwa saksi perzinaan itu harus terdiri dari empat orang laki-laki mukmin, dan yang lebih utama dan yang lebih patut adalah mensyaratkan kepada mereka adanya sifat adil, karena Allah telah mengetatkan perkara kekejian ini demi menutup aib hamba-hambaNya, sehingga Allah tidak akan menerima dalam perkara itu saksi dari empat wanita saja, tidak pula bersama orang laki-laki dan juga tidak kurangg dari empat orang dan dalam bersaksi harus jelas dan terang-terangan sebagaimana yang ditunjukan oleh hadits-hadits yang shahih dan disyaratkan juga oleh ayat ini ketika Allah berfirman “hendaklah ada empat orang saksi antara kamu (yang menyaksikannya)\" dan tidaklah Allah mencukupkan hanya sampai di situ hingga berfirman ”kemudian apabila mereka telah memberi persaksian” yaitu harus ada kesaksian yang pasti tentang suatu perkara yang disaksikannya dengan mata kepala tanpa ada kesamaran dan ketidak jelasan. Dan dapat diambil dari kedua ayat itu juga bhawa hukuman dengan perkataan dan perbuatan serta penahanan telah disyariatkan oleh Allah sebagai suatu hukuman bagi suatu bentuk kemaksiatan yang mengandung pelajaran padanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻳﺄﺗﻴﺎﻧﻬﺎ} ya’tiayanihaa dua orang laki-laki yang mendatangi kekejian. {ﻓﺄﻋﺮﺿﻮا ﻋﻨﻬﻤﺎ} fa a’ridhu ‘anhumaa tinggalkanlah mereka berdua dengan hukumanku sendiri jika mereka telah menampakan taubat. Makna ayat : Sementara untuk para gadis atau selain muhshonat (perempuan yang sudah menikah) Allah berfirman perihal mereka {ﻭاﻟﺬاﻥ ﻳﺄﺗﻴﺎﻧﻬﺎ ﻣﻨﻜﻢ} “dan mereka berdua yang mendatangi zina diantara kalian”, maka hukumlah mereka dengan pukulan ringan, cacian dan hukuman dengan memenjarakan pezina perempuan, sementara untuk laki-laki yang berzina tidaklah dipenjara dan cukup untuk dipukul sampai taubat. Jika sudah taubat dan memperbaiki diri, maka dicukupkan dari hukuman. Ini adalah makna firman Allah {ﻭاﻟﺬاﻥ2 ﻳﺄﺗﻴﺎﻧﻬﺎ ﻣﻨﻜﻢ ﻓﺂﺫﻭﻫﻤﺎ ﻓﺈﻥ ﺗﺎﺑﺎ ﻭﺃﺻﻠﺤﺎ ﻓﺄﻋﺮﺿﻮا ﻋﻨﻬﻤﺎ ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﺗﻮاﺑﺎ ﺭﺣﻴﻤﺎ}. Berlakunya dua hukuman itu tidak dalam waktu lama, sampai Allah memenuhi apa yang dijanjikan-Nya dan memberikan jalan keputusan hukum yang lain. Disebutkan dalam hadits yang shohih bahwasanya Rasulullah ﷺ sedang duduk di antara para sahabatnya kemudian turunlah ayat yang berisi hukum final untuk kehajatan berzina Rasul bersabda, “Ambillah dariku, Allah telah mberikan mereka jalan keluar. Muhshon dengan muhshonah, hukumannya adalah didera seratus kali dan dirajam dengan batu. Jejaka dan gadis dera seratus kali dan diasingkan selama satu tahun.” Hadits ini yang menghentikan aturan hukuman yang telah berlalu dan berlaku untuk kaum wanita serta laki-laki. Adapun hukuman untuk kaum jejaka dan gadis, telah turun ayat yang mejelaskan sanksinya di dalam surat An Nur {اﻟﺰاﻧﻴﺔ ﻭاﻟﺰاﻧﻲ ﻓﺎﺟﻠﺪﻭا ﻛﻞ ﻭاﺣﺪ ﻣﻨﻬﻤﺎ ﻣﺎﺋﺔ ﺟﻠﺪﺓ} “Pezina perempuan dan laki-laki, deralah mereka masing-masing seratus kali”. Adapun rajam bagi muhshon (orang yang sudah menikah), telah disebutkan dalam hadits tentang rajam Ma’iz dan wanita Ghamidiyah dengan perintah Rasulullah dan rajam adalah hukuman yang harus ditegakkan sampai hari kiamat. Ini adalah hukum-hukum yang terdapat di dalam ayat nomor 15 dan 16."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 16: Dan dua orang dari antara kamu yang mengerjakan (kejelekan) itu, hendaklah kamu sakiti mereka; tetapi jika mereka bertaubat dan memperbaiki, maka hendaklah kamu berpaling dari mereka, karena sesungguhnya Allah itu adalah Penerima taubat, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Zina atau homoseks. Seperti dengan dicela, dicerca dan dipukuli sandal atau disabet. Yakni dari dosa yang dilakukannya, menyesalinya dan berniat keras untuk tidak mengulangi lagi. Berdasarkan ayat ini dan ayat sebelumnya, bahwa di awal-awal Islam laki-laki yang melakukan perbuatan keji disakiti sampai mau bertobat dan memperbaiki diri, sedangkan wanita dikurung dalam rumah sampai tiba ajalnya. Dari ayat ini dapat diambil kesimpulan bahwa menghukum dengan menyakiti baik lewat lisan dan tindakan serta menghukum dengan cara mengurung dalam rumah termasuk cara ta'zir terhadap maksiat yang dapat membuat pelakunya jera."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 16",
    "description": "Adapun jika perbuatan keji tersebut dilakukan oleh kaum laki-laki, maka ketentuan hukumannya adalah sebagai berikut. Dan terhadap dua orang laki-laki yang melakukan perbuatan keji seperti zina atau homoseksual di antara kamu dan disaksikan oleh empat orang saksi, maka berilah hukuman, wahai orang yang berwenang menjatuhkan sanksi, kepada keduanya itu, dengan sanksi teguran, celaan, atau cambukan. Jika keduanya tobat dan menyesali perbuatannya sebelum hukuman had dijatuhkan dan memperbaiki diri dengan beramal saleh terus-menerus, maka biarkanlah mereka menjalani hidup dengan tenang, jangan lagi kalian menyakiti dan mengucilkan mereka. Sungguh, Allah maha penerima tobat siapa saja yang bertobat dan menyesali kesalahannya, maha penyayang kepada hamba-hamba-Nya q pada ayat lalu ditegaskan bahwa Allah maha penerima tobat dan maha penyayang. Sesungguhnya bertobat kepada Allah yakni penerimaan tobat yang diwajibkan Allah atas diri-Nya sebagai salah satu bukti rahmat dan anugerah-Nya kepada manusia itu hanya bagi mereka yang melakukan kejahatan, baik dosa kecil maupun dosa besar, karena tidak mengerti yakni karena didorong oleh ketidaksadaran akan dampak buruk dari kejahatan itu, kemudian mereka segera bertobat kepada Allah dengan tulus disertai penyesalan yang mendalam paling lambat sesaat sebelum berpisahnya roh dari jasad. Tobat mereka itulah, yang kedudukannya cukup tinggi, yang diterima Allah. Allah maha mengetahui orang yang betul-betul jujur, tulus, dan ikhlas dalam tobatnya. Dia juga mahabijaksana dengan tidak berbuat aniaya kepada hamba-Nya, sehingga dia menerima tobat siapa yang wajar diterima dan menolak siapa yang pantas ditolak tobatnya."
  }
]