[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka disebabkan tindakan kezhaliman orang-orang yahudi akibat dosa-dosa besar yang diperbuat mereka, Allah mengharamkan atas mereka hal-hal yang baik-baik dari jenis makanan yang sebelumnya halal bagi mereka, dan juga disebabkan tindakan menghalang-halangi diri mereka dan orang lain dari agama Allah yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "160. Maka disebabkan oleh kezaliman orang-orang Yahudi, Kami haramkan kepada mereka sebagian makanan enak yang tadinya halal bagi mereka. Maka Kami haramkan kepada mereka setiap binatang yang berkuku. Sedangkan dari sapi dan kambing, Kami haramkan lemaknya bagi mereka. Dan juga disebabkan kebiasaan mereka menghalang-halangi diri mereka sendiri dan orang lain dari jalan Allah, sehingga kebiasaan menghalang-halangi kebaikan itu menjadi watak mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "160- 161. Ketika orang-orang Yahudi terus-menerus melakukan kezaliman dan tetap membangkang meski telah didatangkan kepada mereka berbagai bukti, maka Allah menghukum mereka dengan mempersempit dan mengharamkan banyak hal-hal baik yang sebelumnya halal bagi mereka. Hal ini akibat kezaliman selalu mereka lakukan dan terus menerus menghalangi agama Allah dengan segala cara; beberapa kezaliman mereka seperti memakan makanan yang haram, merubah kitab Allah untuk mereka jual dengan harga yang murah, menghalalkan pengambilan harta orang-orang Arab, dan menghalalkan riba. Tempat kembali mereka di akhirat adalah azab yang pedih yang telah Allah siapkan. Kesempitan yang Allah berikan ini merupakan balasan bagi mereka, agar mereka bertaubat. Dan barangsiapa yang tetap dalam kekafirannya maka Allah telah menyiapkan baginya azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "160. فَبِظُلْمٍ مِّنَ الَّذِينَ هَادُوا۟ (Maka disebabkan kezaliman orang-orang Yahudi) Yakni disebabkan kezaliman besar orang-orang Yahudi, berupa dosa-dosa sebagaimana telah disebutkan dalam ayat-ayat sebelumnya. حَرَّمْنَا عَلَيْهِمْ طَيِّبٰتٍ أُحِلَّتْ لَهُمْ (kami haramkan atas (memakan makanan) yang baik-baik (yang dahulunya) dihalalkan bagi mereka) Pengharaman ini bukan karena hal lain sebagaimana yang mereka klaim, mereka menganggap makanan-makanan itu telah diharamkan sebelum mereka. Makanan-makanan yang baik itu telah disebutkan dalam firman-Nya: وَعَلَى الَّذِينَ هَادُوا۟ حَرَّمْنَا كُلَّ ذِى ظُفُر Sampai akhir ayat 146 di surat al-An’am. وَبِصَدِّهِمْ (dan karena mereka menghalangi) Yakni menghalangi diri mereka sendiri dan orang lain. عَن سَبِيلِ اللهِ كَثِيرًا ( banyak (manusia) dari jalan Allah) Yakni berupa penghalangan dari mengikuti Rasulullah, dan perbuatan mereka merubah kitab dan membunuh para nabi dan para penyeru kepada kebenaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Diantara syari'at yang ditetapkan bagi kaum-kaum terdahulu adalah : diharamkannya bagi mereka sesuatu yang mereka sukai sebagai hukuman dan pelajaran atas dosa yang telah mereka perbuat, sebagaimana firman Allah : { فَبِظُلْمٍ مِنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ } \"Maka disebabkan kezaliman orang-orang Yahudi, kami haramkan atas (memakan makanan) yang baik-baik (yang dahulunya) dihalalkan bagi mereka\" Namun syari'at itu tidak diterapkan dalam syari'at islam. 2 ). Melakukan perbuatan dosa adalah salah satu penyebab jatuhnya suatu kaum dan mereka terhinakan, Allah berfirman : { فَبِظُلْمٍ مِنَ الَّذِينَ هَادُوا حَرَّمْنَا عَلَيْهِمْ طَيِّبَاتٍ أُحِلَّتْ لَهُمْ وَبِصَدِّهِمْ عَنْ سَبِيلِ اللَّهِ كَثِيرًا } \"Maka disebabkan kezaliman orang-orang Yahudi, kami haramkan atas (memakan makanan) yang baik-baik (yang dahulunya) dihalalkan bagi mereka, dan karena mereka banyak menghalangi (manusia) dari jalan Allah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "160 Sebab kezaliman yang besar dari orang-orang Yahudi dengan kufur kepada Allah dan Musa, juga karena dosa-dosa mereka yang tersebut dalam ayat sebelumnya, maka Kami haramkan atas mereka memakan makanan yang baik-baik yang dahulunya dihalalkan bagi mereka, yang disebutkan dalam surat Al an’am: 146. Juga karena mereka banyak menghalangi manusia dari risalah Nabi Muhammad dan membunuh para Nabi Allah.,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Karena kezaliman} karena kezaliman {orang-orang Yahudi, Kami mengharamkan atas mereka yang baik yang pernah dihalalkan bagi mereka; juga karena penghalangan mereka {mereka menghalangi diri mereka sendiri dan orang lain {dari jalan Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "160-161. Kemudian Allah mengabarkan bahwa Dia mengharamkan banyak perkara bagi Ahli KItab dari hal-hal yang baik yang dahulunya halal buat mereka. Ini merupakan pengharaman sebagai hukuman, disebabkan oleh kezhaliman mereka, tindakan mereka yang melampaui batas, tindakan mereka merintangi manusia dari jalan Allah,dan menghalangi mereka dari hidayah, serta tindakan mereka mengambil riba, padahal mereka telah dilarang darinya, lalu mereka menolak orang yang berbai’at kepadanya dari keadilan. Maka Allah menghukum mereka sesuai dengan jenis perbuatan mereka. Allah melarang mereka dari banyak hal yang baik yang mana mereka seharusnya menikmati kehalalannya karena semua itu memang baik. Sedangkan pengharaman yang ditetapkan atas umat ini, adalah pengharaman penyucian bagi mereka dari hal-hal yang jelek yang memudharatkan mereka dalam agama dan dunia mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 160: Maka dengan sebab kezhaliman dari orang-orang Yahudi, Kami haramkan atas mereka beberapa barang baik yang pernah dihalal- kan bagi mereka. dan dengan se- bab mereka berpaling sangat dari jalan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Lihat surat Al An'aam: 146."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 160",
    "description": "Maka disebabkan karena kezaliman orang-orang yahudi, sebagaimana diterangkan dalam ayat sebelum ini, kami haramkan kepada mereka makanan yang baik-baik yang dahulu, sebelum mereka berbuat kedurhakaan itu, pernah dihalalkan, antara lain semua binatang yang berkuku sebagaimana disebutkan dalam surah al-an'a'm/6: 146; dan karena mereka sering menghalangi orang lain dari jalan Allah dengan melarang berbuat baik dan menyuruh kepada yang mungkar. Dan, selain itu, juga karena mereka menjalankan riba yang merupakan perbuatan yang tidak manusiawi, padahal sesungguhnya mereka telah dilarang darinya, sebagaimana diterangkan di dalam kitab taurat, dan karena mereka memakan harta orang dengan cara tidak sah, cara yang batil, seperti penipuan, sogok menyogok, dan lain-lainnya. Dan kami sediakan untuk orang-orang kafir di antara mereka azab yang pedih kelak di akhirat."
  }
]