[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi,orang-orang yang menguasai ilmu secara mumpuni tentang hukum-hukum Allah dengan baik dari kalangan yahudi dan kaum Mukminin yang beriman kepada Allah dan rasulNya, mereka mengimani wahyu yang diturunkan Allah kepadamu (wahai rasul), yaitu al-qur’an dan kitab-kitab yang diturunkannya kepada rasul-rasul sebelummu seperti taurat dan injil,dan mereka mendirikan shalat pada waktu-waktunya dan mengeluarkan zakat dari harta mereka,dan mereka beriman kepada Allah dan hari kebangkitan dan pembalasan. Mereka itu orang-orang yang akan Allah berikan kepada mereka pahala yang bersar,yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "162. \"Tetapi orang-orang yang berilmu tinggi dan mumpuni dari kalangan Yahudi dan orang-orang mukmin yang percaya pada kitab suci Al-Qur`ān yang Allah turunkan kepadamu -wahai Rasul- dan juga percaya pada kitab-kitab suci yang diturunkan kepada rasul-rasul sebelummu, seperti kitab Taurat dan Injil, mendirikan salat, menunaikan zakat harta mereka, meyakini Allah sebagai Rabb Yang Maha Esa, tidak ada sekutu bagi-Nya, dan meyakini adanya hari Kiamat, mereka yang memiliki sifat-sifat tersebut akan Kami berikan pahala yang sangat besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "162. Adapun orang-orang yang Allah lindungi mereka dengan ilmu yang tinggi dan keimanan kepada apa yang diturunkan Allah serta beristiqomah di jalan Allah, maka mereka adalah orang-orang yang senantiasa menegakkan shalat dan menjaga syarat-syarat dan rukun-rukunnya, menunaikan zakat, dan menjauhi sifat berlebih-lebihan; Sebab mereka mengetahui jalan hidup para nabi dan mengimani mereka. Pengulangan penyebutan iman di sini karena keimanan merupakan hal yang manis untuk disebut sehingga pantas untuk diulang-ulang dan karena beragamnya hal-hal yang berhubungan dengannya dan banyaknya rukun-rukunnya. Penegakan shalat dan penunaian zakat dijadikan sebagai dua poros keimanan karena keduanya merupakan buah, inti, dan bukti dari keimanan tersebut. Shalat adalah ibadah yang paling agung yang berhubungan dengan hak Allah, sedangkan zakat merupakan ibadah yang paling agung yang berhubungan dengan hak makhluk. Dan keimanan merupakan pelindung yang mengelilingi dan menghiasi amalan-amalan shalih. Mereka adalah orang-orang yang ditinggikan derajatnya. Dengan keagungan Kami, Kami akan memberi mereka pahala yang tiada batas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "162. لّٰكِنِ الرّٰسِخُونَ فِى الْعِلْمِ مِنْهُمْ وَالْمُؤْمِنُونَ (Tetapi orang-orang yang mendalam ilmunya di antara mereka dan orang-orang mukmin) Makna (الراسخ) adalah orang yang memiliki ilmu yang tinggi dan ahli mengenai al-kitab. Dan yang dimaksud dengan orang-orang mukmin disini adalah ahli kitab yang beriman atau para Muhajirin dan Anshar, atau juga keduanya. يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن قَبْلِكَ ۚ( mereka beriman kepada apa yang telah diturunkan kepadamu (Al Quran), dan apa yang telah diturunkan sebelummu) Yakni inilah keadaan orang-orang yang beriman, tidak seperti orang-orang Yahudi yang membunuh dan menyakiti para Nabi. Ibnu Abbas berkata: ayat ini turun untuk Abdullah bin Salam dan dua temannya yang meninggalkan agama Yahudi kemudian masuk Islam. وَالْمُقِيمِينَ الصَّلَوٰةَ ۚ( dan orang-orang yang mendirikan shalat) Yakni yang dimaksud dengan orang-orang yang beriman adalah orang-orang yang mendirikan shalat. وَالْمُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ (dan yang beriman kepada Allah dan hari kemudian) Mereka adalah para ahli kitab yang beriman. Pendapat lain mengatakan yang dimaksud adalah orang-orang beriman dari kaum Muhajirin dan Anshar, sebagaimana telah disebutkan dalam diri mereka terdapat sifat-sifat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "162 Tetapi orang-orang Yahudi yang memiliki pemahaman mendalam tentang kitab itu dan juga orang-orang muslim, mereka beriman kepada Al-quran yang telah diturunkan kepadamu dan juga beriman kepada kitab-kitab samawi yang telah diturunkan lebih dahulu. Dan orang-orang yang mendirikan shalat pada waktunya, yang menunaikan zakat kepada yang berhak, yang beriman kepada keesaan Allah dan hari akhirat (mereka adalah orang-orang ahli kitab dan orang Islam yang beriman lebih dulu). Orang-orang itulah yang akan Kami berikan pahala yang besar kepada mereka berupa surga sebab iman dan ketaatan mereka kepada Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi orang-orang yang mendalam} yang mapan dan ahli {dalam keilmuan di antara mereka} di antara orang-orang Yahudi {dan orang-orang mukmin} Orang-orang yang diberi petunjuk Allah kepada keimanan {beriman pada apa yang diturunkan kepadamu dan apa yang diturunkan sebelummu, orang-orang yang mendirikan shalat, yang menunaikan zakat, dan yang beriman kepada Allah serta hari akhir. Mereka itu akan Kami beri pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "162. Setelah Allah membongkar aib-aib Ahli Kitab, lalu Allah menyebutkan orang-orang yang terpuji di antara mereka, seraya berfirman, “Tetapi orang-orang yang mendalam ilmunya,” yaitu orang-orang yang ilmunya tertanam dalam hati mereka dan keyakinan tertancap dalam sanubari mereka hingga membuahkan keimanan yang sempurna secara umum bagi mereka “ kepada apa yang telah diturunkan kepadamu (al-Quran), dan apa yang telah diturunkan sebelummu.” Dan membuahkan bagi mereka amal-amal shalih berupa penegakkan shalat, penunaian zakat yang merupakan dua perkara yang paling utama, yang meliputi keikhlasan kepada Dzat yang disembah dan berbuat baik kepada makhluk. Mereka beriman kepada Hari Akhir hingga mereka takut akan ancaman dan mengharapkan janji. “Orang-orang itulah yang akan Kami berikan kepada mereka pahala yang besar,” karena mereka telah menggabungkan antara ilmu, iman, dana mal shalih, serta beriman kepada kitab-kitab, rasul-rasul yang terdahulu dan yang akan datang."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 162: Tetapi orang-orang yang ma- hir tentang ilmu dari antara mere- ka dan orang-orang yang (sungguh- sungguh) beriman itu, akan beri- man kepada apa yang diturunkan kepadamu dan kepada apa 634 yang diturunkan dahulu daripada- dan (terutama) orang-orang nu yang mendirikan sembahyang dan orang-orang yang mengeluarkan zakat dan orang-orang. yang beriman kepada Allah dan hari Kemudian; mereka ini, Kami akan beri kepada mereka ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah disebutkan aib-aib Ahli Kitab, pada ayat ini disebutkan orang-orang yang terpuji di antara mereka. Sehingga keyakinan tertanam dalam hati mereka dan membuahkan keimanan, seperti yang dimiliki Abdullah bin Salam. Seperti kaum Muhajirin dan Anshar, di mana iman mereka membuahkan amal yang salih, misalnya mendirikan shalat dan menunaikan zakat, di mana keduanya merupakan amal yang paling utama. Di dalam shalat terdapat sikap ikhlas kepada Allah, dan dalam zakat terdapat ihsan kepada hamba-hamba Allah. Mereka pun beriman kepada hari akhir, oleh karenanya mereka takut terhadap ancaman dan mengharap balasan yang telah dijanjikan. Karena mereka menggabung antara berilmu, beriman dan beramal salih, serta beriman kepada kitab-kitab dan rasul-rasul yang dahulu maupun yang datang kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 162",
    "description": "Tetapi orang-orang yang mendalam ilmunya tentang ajaran Allah di antara mereka, yakni ahli kitab; dan orang-orang yang beriman di antara mereka walaupun tidak mendalam ilmunya, mereka beriman kepada apa yang diturunkan kepadamu, wahai nabi Muhammad, yaitu Al-Qur'an, dan kepada kitab-kitab yang diturunkan sebelummu, yaitu antara lain taurat, zabur, dan injil. Dan secara khusus Allah memuji mereka yaitu orang-orang yang melaksanakan salat dengan khusyuk dan menyempurnakan syarat dan rukunnya, dan selanjutnya orang-orang yang menunaikan zakat dan orang-orang yang beriman kepada Allah dan hari kemudian. Kepada mereka, orang-orang yang disebutkan di atas itu, akan kami berikan pahala yang besar kelak di akhiratsesungguhnya kami, melalui malaikat-malaikat kami, telah mewahyukan kepadamu, wahai nabi Muhammad, sebagaimana kami telah mewahyukan kepada nuh, yaitu rasul yang pertama, dan nabi-nabi yang diutus setelahnya, dan kami telah mewahyukan pula kepada ibrahim yang digelari bapak dari para nabi, ismail, putra ibrahim yang merupakan kakek buyut nabi Muhammad, dan ishak, putra ibrahim yang merupakan kakek bani israil, selanjutnya kepada putra ishak yaitu yakub dan nabi-nabi yang merupakan anak cucunya, dan kami mewahyukan kepada isa, nabi yang terakhir dari anak cucu yakub, dan kami telah mewahyukan kepada ayyub, yunus, harun, dan sulaiman, dan kami telah menganugerahkan kitab zabur kepada dawud."
  }
]