[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami telah mewahyukan kepadamu (wahai rasul),supaya menyampaikan risalah sebagaimana kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya. Dan kami wahyukan kepada Ibrahim,ismail,ya’qub,dan para asbath- (yaitu nabi-nabi yang berasal dari keturunan ya’qub yang berda di tengah suku-suku banii israil yang berjumlah dua belas) isa, ayyub, yunus, harun, serta sulaiman. Dan kami berikan zabur kepada daud yaitu kitab dan lembaran-lembaran yang tertulis."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "163. Sesungguhnya Kami telah memberikan wahyu kepadamu -wahai Rasul- sebagaimana Kami telah memberikan wahyu kepada nabi-nabi sebelummu. Jadi kamu bukanlah rasul yang pertama. Karena Kami telah memberikan wahyu kepada Nuh. Kami juga telah memberikan wahyu kepada nabi-nabi yang datang sesudahnya. Kami telah memberikan wahyu kepada Ibrahim. Dan Kami pun telah memberikan wahyu kepada kedua putranya, Ismail dan Ishaq. Juga kepada Ya’qub putra Ishaq dan juga kepada cucu-cucunya. (Mereka adalah nabi-nabi yang berada di tengah-tengah dua belas kabilah Bani Israil yang merupakan putra-putra Ya’qub -‘Alaihissalām-). Dan Kami telah memberikan kitab Zabur kepada Daud."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "163. Dengan keagungan dan kekuasaan Kami, maka Kami wahyukan kepadamu wahai nabi Sebagaimana telah Kami wahyukan kepada para nabi sebelum mu. Dari sini kita mengetahui bahwa dakwah Nabi Muhammad merupakan kelanjutan dari dakwah para nabi sebelumnya, yaitu Nabi Nuh dan nabi-nabi setelahnya. Dan Kami telah memberikan kepada Nabi Daud sebuah kitab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "163. إِنَّآ أَوْحَيْنَآ إِلَيْكَ كَمَآ أَوْحَيْنَآ إِلَىٰ نُوحٍ وَالنَّبِيِّۦنَ مِنۢ بَعْدِهِۦ ۚ (Sesungguhnya Kami telah memberikan wahyu kepadamu sebagaimana Kami telah memberikan wahyu kepada Nuh dan nabi-nabi yang kemudiannya) Yakni urusan Nabi Muhammad adalah sebagaimana urusan para nabi sebelumnya, dan Allah mengkhususkan penyebutan Nabi Nuh karena ia adalah nabi pertama yang membawa syari’at lewat lisannya. وَالْأَسْبَاطِ (dan anak cucunya) Mereka adalah kabilah-kabilah dari keturunan Nabi Ya’qub. Dan makna ayat adalah dan Kami juga telah mewahyukan kepada para Nabi yang berasal dari mereka (keturunan Nabi Ya’qub). Wallahu A’lam. وَءَاتَيْنَا دَاوُۥدَ زَبُورًا (Dan Kami berikan Zabur kepada Daud) Zabur adalah kitab yang diturunkan kepada Nabi Dawud. Imam al-Qurthubi mengatakan: Zabur terdiri dari 150 surat, didalamnya tidak terdapat penyebutan hukum, halal, atau haram, melainkan ia adalah kumpulan hikmah dan pelajaran. Dan Mazmur adalah bab yang mengandung perkataan Nabi Dawud yang ia pakai untuk meminta pertolongan kepada Allah dari musuhnya dan mendoakan kehancuran bagi mereka, dan terdapat beberapa mau’idzah (pelajaran)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "163. Sesungguhnya Kami telah mewayuhkan Al-quran kepadamu wahai Rasul sebagaimana Kami telah mewahyukan kepada Nuh, sebab Nuh adalah Rasul pertama yang membawa syariat. Juga nabi-nabi setelahnya. Kami juga telah mewahyukan kepada Ibrahim, Isma’il, Ishak, Ya’qub (Israil) dan anak cucu Ya’qub yang berjumlah 12, kemudian Isa, Ayyub, Yunus, Harun dan Sulaiman. Dan Kami berikan Zabur kepada Daud: Zabur adalah kitab dari Allah yang mengandung nasihat dan hikmah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Kami telah mewahyukan kepadamu sebagaimana Kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya. Kami telah mewahyukan pula kepada Ibrahim, Ismail, Ishaq, Ya‘qub dan keturunannya, Isa, Ayyub, Yunus, Harun, dan Sulaiman. Kami telah memberikan kepada Daud kitab Zabur} Kami memberikan kepada Dawud sebuah kitab, yaitu Zabur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "163. Allah memberitakan bahwa Dia telah mewahyukan kepada hamba dan RasulNya Muhammad, syariat yang agung dan berita-berita yang benar yang tidak Dia wahyukan kepada nabi-nabi tersebut. Ini menunjukkan beberapa faidah : ~ Bahwasanya Muhammad bukanlah rasul yang pertama, akan tetapi Allah telah mengutus sebelumnya rasul-rasul yang banyak jumlah dan bilangannya. Maka merasa aneh dan heran kepada kerasulan beliau sama sekali tidak memiliki sandaran, kecuali hanya kebodohan dan keingkaran. ~ Bahwa Allah telah mewahyukan kepadanya sama seperti mewahyukan kepada rasul-rasul tersebut berupa pokok-pokok dasar dan keadilan yang mereka sepakati, dan bahwa sebagian dari mereka membenarkan sebagian yang lain, dan sebagian lain sesuai dengan sebagian yang lain. ~ bahwa Muhammad itu adalah sama dengan rasul-rasul terdahulu, agar orang menganggapnya sebagai salah seorang dari saudara-saudaranya dari para Rasul, dakwahnya adalah dakwah mereka, akhlak mereka sama, sumber mereka satu, tujuan mereka satu, dan mereka tidak ditemani oleh orang-orang bodoh, pendusta dan tidak juga raja-raja yang zhalim. ~ Bahwa dalam penyebutan rasul-rasul tersebut dan pengungkapan mereka menunjukkan pujian terhadap mereka, sanjungan yang jujur buat mereka, penjelasan akan kondisi mereka, yang akan membuat kaum Mukminin bertambah imannya kepada mereka, kecintaan kepada mereka, mengikuti petunjuk mereka, mencontoh Sunnah mereka dan mengetahui hak-hak mereka, dan hal itu sebagai suatu landasan dari Firman Allah, \"keselamatan atas Nuh dari seluruh alam\"(Ash-Shaffat:79) dan \"keselamata atas Ibrahim\" (Ash-Shaffat: 109), kemudian, \"keselamatan atas Musa dan Harun\"(Ash-Shaffat: 120) juga, \"keselamatan atas ilyasin, sesungguhnya begitulah kami membalas orang-orang yang berbuat baik\" (Ash-Shaffat:130-131). Setiap pelaku kebaikan mendapatkan pujian yang baik di antara makhluk sesuai dengan kebaikannya, dan para rasul khususnya mereka-mereka itu ditempatkan pada tingkatan-tingkatan tertinggi dari kebaikan. Dan setelah Allah menyebutkan tentang kebersamaan mereka dalam (menerima dan menyampaikan) wahyuNya, Allah menyebutkan pengkhususan sebagian dari mereka, maka Allah menyebutkan bahwa Allah memberikan zabur kepada Dawud, yaitu sebuah kitab yang dikenal dengan al-Mazbur, di mana Allah mengistimewakan Dawud dengannya disebabkan oleh keutamaan dan kemuliaannya, dan bahwa Allah berbicara dengan Musa (secara langsung), artinya secara lisan darinya kepada Musa tanpa ada perantara hingga beliau terkenal dengan hal tersebut di seluruh alam, hingga dikatakan bahwa Musa adalah Kalimurrahman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 163: Sesungguhnya wahyukan kepadamu sebagaimana Kami telah wahyukan kepada Nuh dan nabi-nabi yang sesudah- nya, dan Kami telah wahyukan kepada Ibrahim dan Ismail dan Is-haq dan Ya'kup dan anak-cucu- nya dan Isa dan Ayub dan Yunus Kami telah beri kepada Daud (kitab) Zabur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam ayat ini terdapat beberapa faedah, di antaranya: - Nabi Muhammad shallallahu 'alaihi wa sallam bukanlah rasul yang baru, bahkan sebelumnya Allah telah mengutus pula para rasul yang jumlahnya banyak. Oleh karena itu, menganggap asing kerasulan Beliau tidaklah tepat, dan anggapan seperti itu merupakan kebodohan dan karena sikap keras menolak kebenaran. - Allah mewahyukan kepada Beliau sebagaimana Allah mewahyukan kepada rasul-rasul yang lain, berupa ushul (dasar-dasar agama) dan keadilan yang disepakati oleh semua rasul, dan bahwa satu sama lain saling membenarkan. - Nabi Muhammad shallallahu 'alaihi wa sallam termasuk para rasul, dakwah Beliau sama dengan dakwah para rasul, akhlak Beliau sama dan tujuannya pun sama. Nasab Beliuau tidak bersambung dengan orang-orang yang tidak dikenal, orang-orang yang suka berdusta apalagi dengan raja-raja yang zalim. - Disebutkan para rasul sebelumnya untuk mengangkat nama mereka dan memuji mereka serta mempelajari hal ihwal mereka. Mereka adalah orang-orang yang berbuat ihsan, dan orang-orang yang berbuat ihsan berhak mendapatkan pujian yang baik di tengah-tengah manusia, sedangkan para rasul berada dalam tingkatan paling atas dalam berbuat ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 163",
    "description": "Sesungguhnya kami, melalui malaikat-malaikat kami, telah mewahyukan kepadamu, wahai nabi Muhammad, sebagaimana kami telah mewahyukan kepada nuh, yaitu rasul yang pertama, dan nabi-nabi yang diutus setelahnya, dan kami telah mewahyukan pula kepada ibrahim yang digelari bapak dari para nabi, ismail, putra ibrahim yang merupakan kakek buyut nabi Muhammad, dan ishak, putra ibrahim yang merupakan kakek bani israil, selanjutnya kepada putra ishak yaitu yakub dan nabi-nabi yang merupakan anak cucunya, dan kami mewahyukan kepada isa, nabi yang terakhir dari anak cucu yakub, dan kami telah mewahyukan kepada ayyub, yunus, harun, dan sulaiman, dan kami telah menganugerahkan kitab zabur kepada dawuddan di antara para rasul itu ada beberapa rasul yang sungguh telah kami kisahkan mereka kepadamu sebelumnya, yakni sebelum turun ayat ini, dan ada beberapa rasul yang lain yang tidak kami kisahkan mereka kepadamu. Dan kepada musa, Allah berfirman langsung atau secara bertahap sesuai kemaslahatan dan kebutuhan umatnya."
  }
]