[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami utus rasul-rasul yang sungguh telah kami kisahkan kisah-kisah mereka kepadamu di dalam al-qur’an sebelum ayat ini,dan rasul-rasul lain yang belum kami kisahkan dalam kisah-kisah mereka kepadamu karena ada hikmah yang kami kehendaki. Dan Allah telah berbicara kepada Musa secara langsung, sebagai pemuliaan kepadanya dengan sifat ini. Dalam ayat ini terdapat penetapan sifat kalam (berbicara) bagi Allah ,sebagaimana yang sesuai dengan keagunganNya, dan sesungguhnya Dia berbicara kepada Musa dengan sebenarnya tanpa ada perantara."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "164. Dan Kami telah mengutus rasul-rasul yang Kami ceritakan kepadamu di dalam Al-Qur`ān. Dan Kami juga mengutus rasul-rasul yang tidak Kami ceritakan kepadamu di dalam Al-Qur`ān. Kami tidak menceritakan sepak terjang mereka untuk hikmah tertentu. Dan Allah telah berbicara kepada Musa -tanpa perantara- dengan cara berbicara yang sesuai dengan keagungan-Nya -Subḥānahu wa Ta'ālā- untuk memuliakan nabi Musa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "164. Dan Kami juga telah mewahyukan kepada para rasul yang lain, dan Kami telah ceritakan kepadamu kisah-kisah mereka sebelum turunnya ayat ini. Dan Kami juga telah mengutus rasul-rasul yang tidak Kami ceritakan kepadamu kisah-kisah mereka. Dan Allah telah mengistimewakan Nabi Musa dengan berfirman kepadanya secara langsung tanpa perantara."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "164. وَرُسُلًا (Dan rasul-rasul) Yakni dan Kami telah mengutus Rasul-Rasul. قَدْ قَصَصْنٰهُمْ عَلَيْكَ(yang sungguh telah Kami kisahkan tentang mereka kepadamu) Yakni Kami kisahkan kabar-kabar tentang mereka. مِن قَبْلُ (dahulu) Yakni sebelum Kami ceritakan padanya kisah-kisah mereka di surat ini. وَرُسُلًا لَّمْ نَقْصُصْهُمْ عَلَيْكَ ۚ وَكَلَّمَ اللهُ مُوسَىٰ تَكْلِيمًا (dan rasul-rasul yang tidak Kami kisahkan tentang mereka kepadamu. Dan Allah telah berbicara kepada Musa dengan langsung) Yakni berbicara dengan sebenarnya dan bukan majas, Allah mengistimewakan Nabi Musa dengan berbicara dengannya sebagai bentuk pemuliaan derajatnya, oleh sebab itulah ia dijuluki dengan ‘kalimullah’ (yang diajak bicara oleh Allah). Dalam hadist yang diriwayatkan oleh Abu Dzar yang dikeluarkan oleh Ibnu Hibban dalam kitab shahihnya ia (Abu Dzar) berkata: Aku bertanya kepada Rasulullah: Wahai Rasulullah berapa jumlah para Nabi? Ia menjawab: 124.000 orang. Aku bertanya lagi: berapa jumlah Rasul diantara mereka? Ia menjawab: 313 orang, itu adalah jumlah yang sangat banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "164 Dan Kami telah mengutus rasul-rasul lain, sungguh telah Kami sampaikan kisah mereka kepadamu wahai Rasul yang terkandung dalam ayat-ayat ini juga tentang rasul-rasul yang tidak Kami kisahkan kepadamu. Dan Allah telah berbicara kepada Musa secara langsung, tanpa perantara malaikat pembawa wahyu yaitu Jibril. Jumlah Nabi sebagaimana diriwayatkan oleh Abu Dzar adalah seratus dua puluh empat ribu, adapaun jumlah rasul adalah tiga ratus tiga belas, mereka semua berbicara dengan Allah dengan perantara Jibril"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ada beberapa rasul yang telah Kami ceritakan tentang mereka kepadamu sebelumnya dan beberapa rasul lain yang tidak Kami ceritakan tentang mereka kepadamu. Allah telah benar-benar berbicara kepada Musa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "164. Dan Allah menyebutkan bahwa di antara rasul-rasul itu ada di antara mereka yang Allah ceritakan kepada RasulNya Muhammad, dan ada di antara mereka yang tidak diceritakan kepadanya. Ini menunjukkan bahwa jumlah mereka begitu banyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 164: Dan (Kami telah utus) beberapa rasul yang Kami telah ceritakan (hal-hal) mereka kepadamu lebih dahulu dan beberapa rasul yang tidak Kami ceritakan kepadamu; dan Allah telah omong kepada Musa omongan yang terang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah disebutkan bahwa mereka bersama-sama mendapatkan wahyu, maka disebutkan pengkhususan sebagian mereka. Nabi Dawud diberi oleh Allah kitab Zabur dan Nabi Musa 'alaihis salam diajak bicara oleh-Nya secara langsung tanpa perantara. Dalam ayat tersebut juga diterangkan, bahwa para rasul tersebut ada yang dikisahkan Allah dan ada yang tidak dikisahkan-Nya, hal ini menunjukkan banyaknya jumlah mereka. Allah berbicara langsung dengan Nabi Musa 'alaihis salam merupakan keistimewaan Beliau, oleh karenanya Nabi Musa 'alaihis salam disebut Kalimullah (orang yang diajak bicara oleh Allah), sedangkan rasul-rasul yang lain mendapat wahyu dari Allah dengan perantaraan Jibril. Nabi Muhammad shallallahu 'alaihi wa sallam juga pernah berbicara secara langsung dengan Allah pada malam hari di waktu mi'raj."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 164",
    "description": "Dan di antara para rasul itu ada beberapa rasul yang sungguh telah kami kisahkan mereka kepadamu sebelumnya, yakni sebelum turun ayat ini, dan ada beberapa rasul yang lain yang tidak kami kisahkan mereka kepadamu. Dan kepada musa, Allah berfirman langsung atau secara bertahap sesuai kemaslahatan dan kebutuhan umatnya. Rasul-rasul itu adalah sebagai pembawa berita gembira kepada orang yang beriman bahwa mereka akan memperoleh pahala, dan pemberi peringatan kepada orang-orang kafir bahwa mereka akan disiksa, agar dengan diutusnya para rasul itu tidak ada alasan bagi manusia untuk membantah Allah dan ingkar kepada-Nya setelah rasul-rasul itu diutus. Allah mahaperkasa, tidak dapat dikalahkan oleh siapa pun, mahabijaksana dalam segala perbuatannya."
  }
]