[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku utus rasul-rasul kepada semua makhluk Ku dengan membawa kabar gembira berupa pahala dariKu dan memperingatkan siksaanKu, supaya tidak ada hujjah bagi manusia untuk beralasan setelah pengutusan para rasul. Dan Allah Maha perkasa dalam kekuasaanNya,lagi maha bijaksana dalam pengaturanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "165. Kami mengutus mereka untuk memberikan kabar gembira akan adanya ganjaran yang mulia bagi orang yang beriman kepada Allah, dan memberikan peringatan akan adanya azab yang pedih bagi orang yang ingkar kepada-Nya. Sehingga manusia tidak punya alasan lagi untuk membantah keputusan Allah setelah diutusnya para rasul tersebut. Dan Allah Maha Perkasa di dalam kerajaan-Nya lagi Maha Bijaksana dalam menetapkan keputusan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "165. Allah mengutus para rasul sebagai pemberi kabar gembira dan pemberi peringatan agar menjadi petunjuk, pengingat, dan hujjah bagi para makhluk; sehingga tidak ada lagi seorangpun yang bisa beralasan. Allah Maha Perkasa dalam kerajaan-Nya dan Maha Bijaksana dalam ayat ayat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "165. رُّسُلًا مُّبَشِّرِينَ وَمُنذِرِينَ (selaku rasul-rasul pembawa berita gembira dan pemberi peringatan) Yakni pembawa kabar gembira untuk orang-orang yang taat dan pemberi peringatan bagi orang-orang yang bermaksiat. لِئَلَّا يَكُونَ لِلنَّاسِ عَلَى اللهِ حُجَّةٌۢ بَعْدَ الرُّسُلِ (agar supaya tidak ada alasan bagi manusia membantah Allah sesudah diutusnya rasul-rasul itu) Yakni sebagai alasan untuk diajukan, sebagaimana dalam firman-Nya: ولو أنا أهلكناهم بعذاب من قبله لقالوا ربنا لولا ارسلت إلينا رسولا فنتبع آياتك “Dan sekiranya Kami binasakan mereka dengan suatu azab sebelum Al Quran itu (diturunkan), tentulah mereka berkata: “Ya Tuhan kami, mengapa tidak Engkau utus seorang rasul kepada kami, lalu kami mengikuti ayat-ayat Engkau” Sehingga tidak ada alasan bagi seorangpun yang dapat diajukan kepada Allah setelah Dia mengutus para Rasul. Dalam hadist Imam Bukhari dan Muslim dari Ibnu Mas’ud ia berkata: Rasulullah bersabda: “tidak ada yang lebih cemburu daripada Allah, maka dari itu Dia mengharamkan perbuatan-perbuatan keji baik itu yang nampak maupun yang tersembunyi. Dan tidak ada yang lebih menyukai pujian daripada Allah, maka dari itu Dia memuji diri-Nya. Dan tidak ada pula yang lebih suka untuk memberi alasan daripada Allah, maka dari itu Dia mengutus para Nabi sebagai pemberi kabar gembira dan peringatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "165 Mereka Kami utus selaku rasul-rasul pembawa berita gembira berupa pahala kepada orang-orang yang mentaati mereka dan pemberi peringatan akan adanya hukuman kepada orang-orang yang durhaka. Itu dimaksudkan supaya tidak ada alasan bagi manusia membantah Allah sesudah diutusnya rasul-rasul itu. Allah Maha Perkasa untuk membalas orang-orang yang kufur kepada-Nya, lagi Maha Bijaksana dalam mengutus para rasul. Ibnu Mas’ud berkata tentang sebuah hadis bahwa: tidak ada yang lebih dicintai selain ampunan dari Allah, maka dari itu Allah telah mengutus para Nabi untuk memberi kabar gembira juga peringatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Rasul-rasul sebagai pembawa berita gembira dan pemberi peringatan agar tidak ada} tidak ada {alasan} ampunan yang mana mereka bisa dimaafkan dengan itu {bagi manusia untuk membantah Allah setelah rasul-rasul itu. Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "165. Dan bahwa Allah mengutus mereka sebagai pemberi kabar gembira kepada orang yang taat kepada Allah dan mengikuti mereka, dengan kebahagiaan dunia dan akhirat, dan sebagai pemberi peringatan kepada orang yang bermaksiat kepada Allah dan menyalahi mereka, dengan kesengsaraan dunia dan akhirat. “Agar supaya tidak ada alasan bagi manusia membantah Allah sesudah diutusnya Rasul-rasul itu,” hingga mereka berkata, tidak ada seorang pemberi berita gembira dan pemberi peringatan yang datang kepada kami. Katakanlah : Sesungguhnya telah datang kepada kalian seorang pemberi kabar gembira dan pemberi peringatan, hingga tidak ada lagi hujjah (alasan) bagi makhluk atas Allah, karena Allah telah mengutus sekalian rasul-rasul, yang menjelaskan kepada mereka perkara agama mereka, perkara-perkara yang diridhai Tuhan mereka dan hal-hal yang dimurkai olehNya, jalan ke surga dan jalan ke neraka, barangsiapa yang kafir di antara mereka setelah itu, maka janganlah ia mencela kecuali dirinya sendiri. Ini merupakan kesempurnaan keagungan Allah dan hikmahNya, yaitu Dia mengutus rasul-rasul kepada mereka dan menurunkan kitab-kitab kepada mereka, dan hal itu juga di antara karunia dan kebaikanNya. Di mana manusia sangat butuh kepada para nabi dengan kebutuhan yang besar sekali yang tidak dapat dibayangkan. Allah memenuhi kebutuhan itu, maka bagiNya segala puji dan syukur, dan kita memohon kepadaNYa sebagaimana Allah telah memberikan karuniaNya dengan mengutus para nabi kepada kita agar Dia menyempurnakannya dengan taufik dalam menempuh jalan mereka. Sesungguhnya Allah Maha Memberi lagi Maha mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 165: (Yaitu) rasul-rasul yang meng gemarkan dan mengancam, supaya tidak ada bagi manusia alasan atas (menyalahkan) Allah sesudah (datang) rasul-rasul-Nya, karena adalah Allah itu Gagah, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bagi orang yang menaati Allah dan mengikuti mereka, bahwa mereka akan memperoleh kebahagiaan di dunia dan akhirat. Bagi orang yang durhaka kepada Allah dan menyelisihi mereka, bahwa mereka akan mendapatkan kesengsaraan di dunia dan akhirat. Hal ini sebagaimana yang disebutkan dalam surat Al Qashash: 47: \"Dan agar mereka tidak mengatakan ketika azab menimpa mereka disebabkan apa yang mereka kerjakan: \"Ya Tuhan kami, mengapa Engkau tidak mengutus seorang Rasul kepada kami, lalu kami mengikuti ayat-ayat Engkau dan jadilah kami termasuk orang-orang yang beriman\". (Terj. Al Qashash: 47) Para rasul telah menerangkan kepada manusia perkara agama mereka, apa saja yang diridhai Tuhan mereka dan apa yang dimurkai-Nya, telah menerangkan pula jalan-jalan ke surga dan jalan-jalan ke neraka, oleh karena itu tidak ada alasan bagi manusia untuk membantah Allah dengan mengatakan \"Belum ada yang datang kepada kami menjelaskan agama ini.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 165",
    "description": "Rasul-rasul itu adalah sebagai pembawa berita gembira kepada orang yang beriman bahwa mereka akan memperoleh pahala, dan pemberi peringatan kepada orang-orang kafir bahwa mereka akan disiksa, agar dengan diutusnya para rasul itu tidak ada alasan bagi manusia untuk membantah Allah dan ingkar kepada-Nya setelah rasul-rasul itu diutus. Allah mahaperkasa, tidak dapat dikalahkan oleh siapa pun, mahabijaksana dalam segala perbuatannya tetapi, ketahuilah bahwa Allah menjadi saksi atas kebenaran alqur'an, kitab suci yang diturunkan-Nya kepadamu, wahai Muhammad. Dia menurunkannya dengan ilmu-Nya yang amat sempurna, dan demikian pula para malaikat pun menyaksikan kebenaran Al-Qur'an itu. Dan cukuplah Allah yang menjadi saksi, sebab dia yang mengutusmu dan mewahyukan Al-Qur'an kepadamu."
  }
]