[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila kaum yahudi dan orang-orang selain mereka kafir kepadamu (wahai rasul), maka Allah bersaksi bagimu bahwa kamu sesungguhnya adalah rasulNya yang Dia telah menurunkann al-qur’an yang agung kepadamu. Allah menurunkannya dengan ilmuNya. Begitu pula para malaikat bersaksi atas kebenaran apa yang diwahyukan kepadamu. Dan persaksian Allah saja sudahlah cukup."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "166. Jika orang-orang Yahudi ingkar kepadamu -wahai Rasul- sesungguhnya Allah bersaksi tentang kebenaran kitab Al-Qur`ān yang Dia turunkan kepadamu. Di dalam kitab itu Allah menurunkan ilmu-Nya yang hendak Dia beritahukan kepada hamba-hamba-Nya perihal apa yang Dia sukai dan Dia ridai, juga apa yang Dia benci dan Dia tolak. Dan para malaikat pun bersaksi atas kebenaran agama yang kamu bawa bersama dengan kesaksian Allah. Dan cukuplah Allah sebagai saksi. Karena kesaksian-Nya bisa mencukupi kesaksian yang lain."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "166. Jika para Ahli kitab mengingkari kenabian dan kerasulanmu Hai Muhammad, maka sesungguhnya Allah bersaksi bahwa engkau adalah utusan-Nya dan risalah yang engkau bawa adalah risalah yang benar. Allah Maha Mengetahui kepada siapa Dia berikan risalah-Nya dan mengetahui siapa yang Dia beri, dan para malaikat membenarkan dan membelamu. Cukuplah Allah bagimu sebagai saksi atas kebenaranmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "166. أَنزَلَهُۥ بِعِلْمِهِۦ ۖ (Allah menurunkannya dengan ilmu-Nya) Yakni dengan ilmu-Nya yang tidak ada yang mengetahui selain-Nya dalam hal bahwa kamu (Muhammad) berhak dipilih Allah untuk diberi kenabian dan diturunkan kepadamu al-Qur’an. وَكَفَىٰ بِاللهِ شَهِيدًا (Cukuplah Allah yang mengakuinya) Maka tidak ada saksi yang lebih mulia dibandingkan dengan-Nya. Yakni maka janganlah kamu bersedih hati atas pengingkaran yang di lakukan para orang kafir terhadapmu karena pengakuan Allah cukup bagimu, begitu pula mu’jizat-mu’jizat yang Dia berikan kepadamu merupakan bukti-bukti yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "166 Mereka tidak mau mengakui Al-quran yang diturunkan kepadamu itu. Allah telah menurunkan Al-quran dengan ilmu-Nya, tidak ada yang mengetahui selain Dia, sebab engkau adalah pemilik derajat kenabian dan yang diberi Al-quran. Malaikat-malaikat pun menjadi saksi bahwa engkau adalah rasul Allah. Cukuplah Allah yang mengakuinya, karena pengakuan-Nya saja itu sudah mencukupi. Ayat ini turun ketika orang-orang musyrik berkata: Kami tidak mau mengakui bahwa engka mendapatkan wahyu. Dan sebagian orang-orang Yahudi berkata: Kami tidak tahu menahu wahai Muhammad bahwa Allah telah menjadikanmu sebagai utusan, dan ataupun telah menurunkan sesuatu kepadamu. Al-quran telah mengisahkan perkataan orang Yahudi pada surat Al an’am ayat 91. Al kalbiy berkata: Sesungguhnya para pembesar Makkah mendatangi rasul dan berkata kepada rasul: Kami bertanya kepadamu tentang Yahudi, mereka mengklaim bahwa mereka tidak mengetahui siapa kamu wahai Muhammad. Maka dari itu tunjukkan kepada kami siapa yang bisa menjadi saksi bahwa engkau adalah utusan Allah kepada kami. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi Allah bersaksi atas apa yang telah Allah turunkan kepadamu. Dia menurunkannya dengan ilmuNya} di dalamnya terdapat ilmuNya yang mengangkat para hamba {para malaikat bersaksi. Cukuplah Allah menjadi saksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "166. Tatkala disebutkan bahwa Allah menurunkan wahyu kepada RasulNya Muhammad sebagaimana Allah juga menurunkan wahyuNya kepada saudara-saudaranya para rasul sebelumnya, kemudian Allah mengabarkan tentang kesaksianNya atas kerasulan Muhammad dan kebenaran dakwah yang dibawa olehnya, dan bahwasanya Dia (Allah) “menurunkannya dengan ilmuNya,” indikasi maknanya adalah, Allah menurunkannya dengan memuat ilmuNya. Artinya, al-Quran itu mengandung ilmu-ilmu dari Allah, hukum-hukum syariat dan berita-berita ghaib yang merupakan di antara ilmu Allah yang diajarkannya kepada hamba-hambaNya. Kemungkinan lain maksud ayat ini adalah, Allah menurunkannya dengan bersumber dari ilmuNya. Maka atas dasar ini, ayat tersebut menjadi isyarat dan perhatian kepada kesaksian Allah, dan bahwa maknanya adalah, Allah menurunkan al-Quran ini yang mengandung perintah dan larangan, sedang Allah mengetahui itu semua, mengetahui kondisi orang yang diturunkan kepadanya, dan mengetahui bahwa ia akan menyeru manusia dengannya, maka barangsiapa yang menerima dan mempercayainya, niscaya ia menjadi walinya dan barangsiapa yang mendustai dan memusuhinya, maka ia adalah musuhnya, dan ia telah menghalalkan darah dan hartanya. Allah menguatkannya, menjamin pembelaannya, memenuhi permohonan-permohonannya, menghinakan musuh-musuhnya dan menolong wali-walinya. Maka apakah ada kesaksian yang lebih agung dan lebih besar dari kesaksian ini? Tidaklah mungkin bisa mencela kesaksian tersebut kecuali dengan mencela ilmu Allah, kuasaNya dan hikmahNya. Sedang pemberitaan Allah tentang kesaksian malaikat atas apa yang diturunkan kepada RasulNya, disebabkan oleh kesempurnaan iman mereka dan kemuliaan perkara yang disaksikan tersebut, dan sesungguhnya perkara yang agung itu tidaklah disaksikan kecuali oleh orang-orang yang khusus, sebagaimana Allah berfirman tentang kesaksian atas tauhid, “Allah menyatakan bahwasanya tidak ada Tuhan melainkan Dia (yang berhak disembah), Yang menegakkan keadilan. Para Malaikat dan orang-orang yang berilmu (juga menyatakan yang demikian itu). Tak ada Tuhan melainkan Dia (yang berhak disembah), Yang Maha Perkasa lagi Maha Bijaksana.”(Ali Imran: 18) Dialah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang hak agar dimenangkan-Nya terhadap semua agama. Dan cukuplah Allah sebagai saksi. (Al-Fath:28)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 166: Tetapi Allah menyaksikan (bahwa) apa yang Ia turunkan kepadamu itu, Ia turunkan dengan pengetahuan-Nya dan malaikat-malaikat (pun) menyaksikan padahal Allah itu (saja) Saksi,- cukup sebagai."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam tafsir Jalaalain diterangkan, bahwa ayat ini turun ketika orang-orang Yahudi ditanya tentang kenabian Muhammad shallallahu 'alaihi wa sallam, lalu mereka mengingkarinya, maka pada ayat di atas Allah menerangkan bahwa Allah yang menjadi saksi terhadap kenabian Muhammad shallallahu 'alaihi wa sallam, demikian juga terhadap kebenaran kitab yang diturunkan kepadanya. Bisa maksudnya, bahwa di dalamnya mengandung ilmu-Nya, yakni di dalamnya terdapat pengetahuan tentang ketuhanan, hukum-hukum syar'i, dan berita-berita ghaib, di mana hal itu termasuk ilmu Allah yang diajarkan-Nya kepada hamba-hamba-Nya. Bisa juga maksudnya, bahwa Allah menurunkannya muncul dari pengetahuan-Nya, di mana hal ini terdapat isyarat dan pemberitahuan tentang persaksian-Nya, sehingga maksudnya adalah apabila Allah menurunkan Al Qur'an yang mengandung perintah dan larangan, sedangkan Dia mengetahui hal itu, mengetahui pula keadaan orang yang diturunkan kepadanya kitab itu, Dia mengajak pula manusia kepadanya, maka barang siapa yang mendatangi sesuan itu dan membenarkannya, maka dia adalah wali-Nya, sebaliknya barang siapa yang mendustakannya dan memusuhinya, maka dia menjadi musuh-Nya, lantas persaksian apa yang lebih besar daripada persaksian ini, di mana persaksian itu tidak mungkin dicacatkan kecuali sama saja mencacatkan pengetahuan Allah, kekuasaan-Nya dan hikmah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 166",
    "description": "Tetapi, ketahuilah bahwa Allah menjadi saksi atas kebenaran alqur'an, kitab suci yang diturunkan-Nya kepadamu, wahai Muhammad. Dia menurunkannya dengan ilmu-Nya yang amat sempurna, dan demikian pula para malaikat pun menyaksikan kebenaran Al-Qur'an itu. Dan cukuplah Allah yang menjadi saksi, sebab dia yang mengutusmu dan mewahyukan Al-Qur'an kepadamu. Sesungguhnya orang-orang yang kafir, tidak percaya kepada Allah dan kepada kebenaran Al-Qur'an, dan menghalang-halangi orang lain dari jalan Allah, benar-benar telah sesat sejauh-jauhnya, dari jalan yang benar disebabkan oleh kekafirannya itu."
  }
]