[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang menentang kenabianmu dan menghalangi manusia dari islam, sungguh mereka telah jauh dari jalan kebenaran dengan sejauh-jauhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "167. Sesungguhnya orang-orang yang mengingkari kenabianmu dan menghalang-halangi manusia dari agama Islam benar-benar jauh dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "167. Allah menjelaskan keadaan orang-orang yang kafir sekaligus menghalangi jalan Allah, mereka telah tenggelam di jalan kesesatan yang tersesat di jalan yang berbelok."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "167. وَصَدُّوا۟ عَن سَبِيلِ اللهِ (dan menghalang-halangi (manusia) dari jalan Allah) Yakni dari agama Islam, dengan mengingkari kenabian Nabi Muhammad, dan dengan ucapan mereka “kami tidak mendapatkan ciri-cirinya dalam kitab kami, dan kenabian hanya diperuntukkan bagi keturunan Harun dan Dawud” serta ucapan mereka bahwa syari’at Nabi Musa tidak dinasakh (dihapus) selamanya. قَدْ ضَلُّوا۟ ضَلٰلًۢا بَعِيدًا (benar-benar telah sesat sejauh-jauhnya) Karena selain mereka kafir mereka juga menghalangi orang lain dari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "167 Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-Nya dan juga menghalang-halangi manusia dari Islam, maka benar-benar telah sesat sejauh-jauhnya dari jalan kebenaran dan jalan petunjuk. Sebab dengan kekufuran mereka sendiri telah menghalangi orang lain untuk mendapatkan kebenaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang ingkar dan menghalangi dari jalan Allah, sungguh mereka telah tersesat sangat jauh} mereka menjauh dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "167. Ketika Allah telah mengabarkan tentang dakwah para rasul, dan mengabarkan tentang dakwah penutup mereka, Muhammad, lalu Allah dan para malaikat juga bersaksi atasnya, maka itu mengharuskan kokohnya perkara yang telah ditetapkan dan disaksikan. Karena itu wajiblah mereka diyakini, diimani, dan diikuti. Kemudian Allah mengancam orang yang kufur kepada mereka (para Rasul) seraya berfirman, “Sesungguhnya orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah,” maksudnya, mereka menggabungkan pada diri mereka antara kufur dengan merintangi manusia dari jalan Allah, mereka itu adalah para pemimpin kekufuran dan penyeru-penyeru kesesatan, “mereka benar-benar telah sesat sejauh-jauhnya.” Kesesatan apalagi yang lebih besar dari kesesatan dirinya dan menyesatkan orang lain, lalu ia kembali dengan dua dosa, pulang dengan dua kerugian dan lenyap darinya dua petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 167: Sesungguhnya yang telah kufur dan berpaling dari jalan Allah itu, telah sesat satu kesesatan yang jauh. orang-orang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah menyebutkan bahwa Allah yang menjadi saksi atas kenabian Muhammad shallallahu 'alaihi wa sallam, demikian juga para malaikat-Nya, di mana hal itu menunjukkan benarnya kerasulan Muhammad shallallahu 'alaihi wa sallam dan menghendaki untuk dibenarkan, diimani dan diikuti, maka pada ayat ini Allah Subhaanahu wa Ta'aala mengancam orang-orang yang kafir kepada Beliau shallallahu 'alaihi wa sallam. Yakni dari agama Islam, yaitu dengan menyembunyikan sifat-sifat Nabi akhir zaman yang disebutkan dalam Taurat atau melakukan usaha menghalangi manusia dari agama Allah. Mereka ini adalah para pemimpin kekafiran dan para penyeru kesesatan, karena mereka menggabung antara sikap kafir dan menghalangi manusia dari jalan Allah. Oleh karena itu, kesesatan apa yang lebih besar daripada kesesatan orang yang membuat sesat dirinya dan orang lain, di mana ia membawa dua dosa, dua kerugian dan luput dari dua hidayah (hidayah bagi diri dan usaha dari dirinya menunjukkan orang lain)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 167",
    "description": "Sesungguhnya orang-orang yang kafir, tidak percaya kepada Allah dan kepada kebenaran Al-Qur'an, dan menghalang-halangi orang lain dari jalan Allah, benar-benar telah sesat sejauh-jauhnya, dari jalan yang benar disebabkan oleh kekafirannya itu sesungguhnya orang-orang yang kafir dan melakukan kezaliman dengan mempersekutukan Allah, maka Allah tidak akan mengampuni mereka, dan tidak pula akan menunjukkan kepada mereka jalan, kecuali jalan ke neraka jahanam; mereka kekal di dalamnya selama-lamanya. Dan hal itu, yakni memasukkan mereka ke neraka jahanam, adalah sangat mudah bagi Allah, sebab Allah mahakuasa atas segala sesuatu."
  }
]