[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali hanya jalan menuju neraka Jahannam,mereka tinggal di dalamnya selama-lamanya. Dan yang demikaian itu mudah bagi Allah, maka tidak ada sesuatu yang bisa melemahkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "169. Kecuali jalan yang mengantarkan mereka ke dalam neraka Jahanam untuk menetap di sana selama-lamanya. Dan hal itu sangat mudah bagi Allah. Karena tidak ada sesuatu pun yang dapat menghalangi kehendak-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "169. إِلَّا طَرِيقَ جَهَنَّمَ (kecuali jalan ke neraka Jahannam) Karena mereka melakukan perbuatan yang melazimkan mereka masuk neraka dengan pilihan mereka yang buruk dan kejahatan mereka yang berlebihan. خٰلِدِينَ فِيهَآ أَبَدًا ۚ (mereka kekal di dalamnya selama-lamanya) Yakni kekal selamanya tanpa ada akhir. وَكَانَ ذٰلِكَ(Dan yang demikian itu) Yakni kekekalan mereka dalam Jahannam itu. عَلَى اللهِ يَسِيرًا(adalah mudah bagi Allah) Karena tidak ada yang susah bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "169 Kecuali jalan ke neraka Jahannam sebab perbuatan mereka yang buruk. Mereka akan kekal di dalamnya selama-lamanya tanpa akhir. Siksa yang kekal dan azab untuk mereka itu adalah mudah bagi Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali jalan ke neraka Jahanam. Mereka kekal di dalamnya selama-lamanya. Hal itu bagi Allah sangat mudah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "168-169. Karena itulah Allah berfirman, “Sesungguhnya orang-orang yang kafir dan melakukan kezhaliman.” Kezhaliman ini merupakan tambahan atas kekufuran mereka, karena apabila kata kezhaliman dipakai secara mutlak, maka kufur itu termasuk di dalamnya, dan yang dimaksud dengan kezhaliman di sini adalah perbuatan-perbuatan kufur dan pendalamannya. Mereka itu jauh dari ampunan dan petunjuk kepada jalan yang lurus, karena itulah Allah berfirman, “Allah sekali-kali tidak akan mengampuni (dosa) mereka dan tidak (pula) akan menunjukkan jalan kepada mereka, kecuali jalan ke Neraka Jahanam.” Ampunan dan petunjuk tidak diberikan kepada mereka, karena mereka selalu dalam kesesatan mereka, dan kekufuran mereka selalu bertambah, hingga hati mereka tertutup dan jalan-jalan petunjuk terputus karena apa yang telah mereka kerjakan, \"dan tidaklah Tuhan kalian itu bertindak aniaya terhadap siapa pun dari hambaNya.\" “Dan yang demikian itu adalah mudah bagi Allah,” yaitu Allah tidak akan memperdulikan mereka dan tidak merasa berat, karena mereka tidaklah patut mendapat kebaikan dan tidak sesuai bagi mereka kecuali kondisi yang telah mereka pilih untuk diri mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 169: Melainkan jalan kejahannam kekal mereka yang selama-lamanya dan karena padanya adalah yang demikian itu mudah atas Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah tidaklah menzalimi hamba-hamba-Nya, tetapi merekalah yang memang tidak mau diajak kepada kebaikan, bahkan memilih jalan sendiri untuk diri mereka. Oleh karena itu, beruntunglah orang yang dalam hidupnya meminta petunjuk Allah dan tidak mengandalkan kemampuan dirinya yang terbatas. Yaa Hayyu Yaa Qayyum birahmatika nastaghiitsu aslih lanaa sya'nanaa kullah wa laa takilnaa ilaa anfusinaa tharfata 'ain (Wahai Yang Maha Hidup lagi Mengurus makhluk-Nya, dengan rahmat-Mu kami meminta, perbaikilah urusan kami semuanya dan janganlah Engkau menyerahkan diri kami untuk mengurus diri kami sendiri walau sedikit pun)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 169",
    "description": "Sesungguhnya orang-orang yang kafir dan melakukan kezaliman dengan mempersekutukan Allah, maka Allah tidak akan mengampuni mereka, dan tidak pula akan menunjukkan kepada mereka jalan, kecuali jalan ke neraka jahanam; mereka kekal di dalamnya selama-lamanya. Dan hal itu, yakni memasukkan mereka ke neraka jahanam, adalah sangat mudah bagi Allah, sebab Allah mahakuasa atas segala sesuatu. Wahai manusia! sungguh telah datang rasul, yaitu nabi Muhammad, kepadamu dengan membawa tuntunan kitab suci Al-Qur'an yang mengandung kebenaran dari tuhanmu, maka berimanlah kepadanya dengan iman yang benar, sesungguhnya keimanan itu lebih baik bagimu. Dan jika kamu kafir kepada Allah dan rasul-Nya, kekafiranmu itu tidak merugikan Allah sedikit pun, karena sesungguhnya milik Allah-lah apa yang di langit dan di bumi. Allah maha mengetahui siapa yang taat dan siapa yang durhaka dari hamba-Nya, mahabijaksana dengan memperlakukan hamba-Nya sesuai dengan amal perbuatannya."
  }
]