[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah hanyalah menerima taubat dari orang-orang yang mengerjakan maksiat-maksiat dan dosa-dosa lantaran ketidaktahuan mereka terhadap akibatnya dan potensinya mendatangkan kemurkaan Allah maka tiap orang yang bermaksiat kepada Allah,tanpa sengaja, atau tidak disengaja, orang itu adalah orang yang jahil(bodoh) berdasarkan pertimbangan ini, meskipun dia mengerti bahwa hal itu diharamkan. Kemudian mereka kembali kepada tuhan mereka degan penyesalan dan ketaatan sebelum menyaksikan datangnya kematian dengan jelas, maka mereka itu adalah orang-orang yang Allah menerima taubat mereka. Dan Allah maha mengetahui hamba-hambaNYA, juga Maha bijaksana dalam pengaturan dan ketetapan takdirNYA. Pelajaran dari ayat : • Taubat yang disukai Allah adalah taubanya orang yang berbuat dosa karena kebodohannya, bukan karena dia mengetahui tanpa pula dengan terus menerus lalu bertaubat dengan segera."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sesungguhnya Allah hanya menerima taubat dari orang-orang yang berbuat dosa dan maksiat karena ketidaktahuan mereka akan akibat dan dampak buruknya. Ini adalah kondisi yang ada pada diri semua orang yang berbuat dosa, baik sengaja maupun tidak sengaja. Kemudian mereka kembali ke jalan Rabb mereka sebelum ajal menjemput mereka. Mereka itulah yang akan diterima taubatnya oleh Allah dan diampuni kesalahannya. Dan Allah Maha Mengetahui keadaan makhluk-Nya lagi Maha Bijaksana dalam menetapkan takdir dan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Allah memberi kabar gembira kepada orang-orang yang bertaubat dari perbuatan maksiat akibat kebodohan mereka: Jika mereka berhenti dari kemaksiatan dan kembali kepada tuntunan Allah sebelum datang sakaratul maut, maka Allah akan menerima taubat mereka, sebab semua orang yang bermaksiat kepada Allah adalah orang bodoh, hingga mereka berhenti dari kemaksiatan. Allah Maha Mengetahui hamba-hamba-Nya dan Maha Bijaksana dalam pengaturan dan hukum-hukum-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. إِنَّمَا التَّوْبَةُ عَلَى اللهِ (Sesungguhnya taubat di sisi Allah) Yakni yang wajib bagi Allah, yang Allah wajibkan atas diri-Nya untuk menerima taubat mereka. للذين يعملون السوء (bagi orang-orang yang mengerjakan kejahatan) Yakni kemaksiatan. بِجَهٰلَةٍ(lantaran kejahilan) Yakni yang mengerjakannya dan ia tidak paham (jahil) akan kebesaran Allah. Ibnu Abbas berkata: semua yang melakukan kemaksiatan adalah jahil, karena kejahilannya maka ia bermaksiat. ثُمَّ يَتُوبُونَ مِن قَرِيبٍ(yang kemudian mereka bertaubat dengan segera) Rasulullah bersabda: sesungguhnya Allah masih menerima taubat hamba-Nya selama nyawanya belum sampai di kerongkongan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Semua pelaku maksiat disebut dengan jahil atau orang yang bodoh. Bisa jadi dia bodoh dan tidak mengetahui dengan buruknya apa yang dilakukan, dan bisa juga dia tidak mengetahui buruknya akibat perbuatannya tersebut bagi diri sendiri yang berupa kemurkaan Allah SWT padanya. 2 ). Ibnu Abbas berpendapat bahwa taubat pelaku maksiat diterima jika belum datang sakit ataupun maut. Lalu Ibnu Rajab meyampaikan komentarnya berkaitan dengan ayat ini: ”Ayat ini merupakan isyarat jelas bagi pelaku maksiat agar mempercepat taubatnya ketika dia masih dalam keadaan sehat segar bugar tak berpenyakit, ini lebih baik, karena di waktu itu ia bisa memperbanyak amal kebaikan guna menghapus dosa-dosanya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Sesungguhnya penerimaan taubat dari Allah itu merupakan pemberian anugerah dan kebaikan bagi para pelaku maksiat yang melakukan kemaksiatan dengan sembrono ketika syahwatnya meluap-luap, kemudian mereka bertaubat dari perbuatan buruk mereka dalam waktu dekat, yaitu langsung bertaubat setelah berdosa atau sebelum mati. Al-Jahalah adalah kebodohan dan ketololan. Mereka itu diterima taubatnya oleh Allah. Dan Allah itu Maha Mengetahui kelemahan manusia di hadapan syahwatnya sendiri dan keseriusannya dalam bertaubat, dan Maha Bijaksana dalam tindakanNya dan penerimaan taubatNya bagi orang yang lemah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya taubat yang pasti diterima Allah} penerimaan taubat dari Allah {itu hanya bagi mereka yang melakukan keburukan} maksiat kecil atau besar {karena kebodohan} karena mereka tidak tahu akibatnya {kemudian mereka segera bertaubat} sebelum mencapai ajalnya {Merekalah yang diterima taubatnya oleh Allah. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. taubat dari Allah terhadap hamba-hambaNya ada dua macam, pertama, taufik darNya untuk melakukan taubat itu sendiri, dan kedua, penerimaanNya akan taubat tersebut setelah dilakukan oleh sang hamba. Disini, Allah mengabarkan bahwa taubat yang hanya berhak dialamatkan kepada Allah adalah haq yang hanya Allah peruntukkan bagi DiriNya sebagai kebaikan dan anugrah dariNya bagi orang yang melakukan perbuatan dosa, yaitu kemaksiatan “lantaran kejahilan” yaitu kebodohan darinya akan akibat perbuatan itu dan konsekuensi kemurkaan dan siksaan Allah terhadapnya, kebodohannya akan pengawasan dan pengamatan Allah terhadap dirinya, kebodohannya akan hasil dari perbuatannya itu berupa berkurangnya atau hilangnya iman darinya, maka setiap pelaku kemaksiatan terhadap Allah adalah jahil dengan kondisi seperti itu walaupun ia mengetahui akan keharamannya, bahkan mengetahui keharamannya sesuatu adalah syarat suatu kemaksiatan yang mendapat hukuman karenanya, ”yang kemudian mereka bertaubat dengan segera” kemungkinan maknanya adalah kemudian mereka bertaubat sebelum menyaksikan kematian, karena Allah menerima taubat seorang hamba apabila ia bertaubat sebelum ada kepastian bahwa ia akan mati dan sebelum ada iksaan secara pasti, sedangkan setelah hadirnya kematian, maka tidaklah akan diterima dari pelaku kemaksiatan suatu taubat pun dan tidak akan diterima pula keimanan dari orang kafir, sebagaimana Allah berfirman tentang fir’aun. ”hingga bila fir’aun itu telah hamper tenggelam, berkatalah dia, ’saya percaya bahwa tidak ada tuhan melainkan rabb yang dipercayai oleh bani israil dan saya termasuk orang-orang yang berserah diri (kepada allah)” “maka tatkala mereka melihat azab kami, mereka berkata kami beriman hanya kepada Allah saja dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa kami.itulah sunnah Allah yang telah berlaku terhadap hamba-hambaNya.’” Dan Allah berfirman disini, ”dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan” yaitu kemaksiatan-kemaksiatan selain kekufuran, ”hingga apabila datang ajal kepada seseorang diantara mereka, (barulah) ia mengatakan, sesungguhnya saya bertaubat sekarang, dan tidak pula (diterima taubatnya) orang-orang yang mati sedang mereka didalam kekafiran bagi orang-orang itu telah kami sediakan siksa yang pedih.” Yang demikian itu karena taubat dalam kondisi seperti itu adalah taubat yang terpaksa yang tidak berguna bagi pelakunya, padahal sesungguhnya yang bermanfaat itu hanyalah taubat pilihan atau kesadaran. Dan kemungkinan juga makna firmanNya ”dengan segera” yaitu segera setelah perbuatan dosa tersebut yang mengharuskan adanya taubat, maka maknanya adalah bahwa barangsiapa yang bersegera dalam menarik diri sejak timbulnya dosa dan berserah diri kepada Allah serta menyesali perbuatan itu maka sesungguhnya Allah akan mengampuni dosanya, berbeda dengan orang yang terus menerus dengan dosanya dan berkelanjutan dengan aib-aibnya itu hingga menjadi sebuah sifat yang menempel pada dirinya, maka sesungguhnya akan sulit baginya untuk bertaubat secara total bahkan biasanya ia tidak mendapatkan taufik taubat dan tidak dimudahkan kepada sebab-sebabnya seperti seseorang yang melakukan perbuatan dosa atas ilmu yang jelas dan keyakinan yang dibarengi dengan sikap meremehkan pengawasan Allah terhadapnya, maka sesungguhnya ia telah menutup pintu rahmat bagi dirinya sendiri. Memang benar bahwa Allah terkadang memberikan taufik kepada hambaNya yang selalu melakukan dosa dan maksiat dengan kesengajaan dan keyakinan menuju taubat yang berguna di mana Allah akan menghapus dengan taubat itu apa-apa yang telah lalu berupa dosa-dosa dan kejahatan-kejahatannya, akan tetapi rahmat dan taufik itu lebih dekat pada orang yang pertama, oleh karena itulah Allah menutup ayat pertama tersebut dengan firmanNya ”Dan Allah Maha Mengetahui Maha Bijaksana” dan diantara ilmu Allah bhawa Dia mengetahui orang yang benar dalam taubat dan orang yang berdusta, dan akan membalas setiap dari kedua orang tersebut sesuai dengan hak keduanya menurut hikmahNYa, dan diantara hikmahNya adalah Allah akan memberikan taufik kepada orang yang hikmah dan rahmatNya menghendaki orang tersebut kepada taubat, dan Allah akan menghinakan orang yang hikmah dan keadilanNya menghendaki tidak memberi taufik kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {اﻟﺘﻮﺑﺔ} At taubah asal kata taubat adalah kembali. Dan maksudnya adalah penyesalan atas perbuatan buruk dan meninggalkannya serta tekat yang kuat untuk tidak kembali melakukannya. {اﻟﺴﻮء} As suu’ setiap hal yang membuat jiwa ini menjadi buruk. Artinya di sini adalah dosa. {ﺑﺠﻬﺎﻟﺔ} bijahaalah dengan kebodohan tanpa ada kesengajaan, tidak berkelanjutan dan bukan pula tidak peduli. Makna ayat : Ayat nomor 17 dan 18 menerangkan orang-orang yang berhak diterima taubatnya oleh Allah. Mereka adalah para pendosa yang melakukan kemaksiatan karena kebodohan mereka kemudian mereka bertaubat dengan segera tanpa ditunda dan tanpa ditangguhkan. Sementara orang-orang yang melakukan dosa sedangkan mereka mengetahuinya, berkelanjutan dan tidak bertaubat serta telah berkubang dalam dosa, maka tiadalah jaminan ampunan untuk mereka. Mereka mati tanpa ada ampunan dan perkara mereka adalah ihwal orang-orang yang mengetahui kemasiatan dan tidak betauabat sampai jikalau sakit dan nampak tanda-tanda kematian dan yakin bahwasanya dia akan mati tanpa ragu, kemudian berkata, “Bahwa sesungguhnya aku bertaubat”. Seperti perihal orang-orang kafir, mereka bertaubat tatkala telah tetap dan jelas saat kematiannya, tidaklah diterima taubat mereka selamanya. Ini adalah makna dua ayat yang mulia ini {ﺇﻧﻤﺎ اﻟﺘﻮﺑﺔ ﻋﻠﻰ اﻟﻠﻪ ﻟﻠﺬﻳﻦ ﻳﻌﻤﻠﻮﻥ اﻟﺴﻮء ﺑﺠﻬﺎﻟﺔ ﺛﻢ ﻳﺘﻮﺑﻮﻥ ﻣﻦ ﻗﺮﻳﺐ ﻓﺄﻭﻟﺌﻚ ﻳﺘﻮﺏ اﻟﻠﻪ ﻋﻠﻴﻬﻢ} yakni, Allah menerima taubat mereka yang berbuat maksiat karena kebodohannyan dan bersegera dalam taubatnya karena Dia mengetahui kelemahan para hamba-Nya, Dia bijaksana memutuskan segala sesuatu sesuai dengan tempat yang layak. Oleh karena itu, diterima taubat orang yang bermaksiat karena kebodohannya bukan karena mengeyel, sombong atau congkak. Mereka taubat dengan segera tanpa berlama-lama saat bermaksiat. Pelajaran dari ayat :"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 17: Tidak ada taubat (yang wajib) atas Allah (menerimanya) melainkan dari orang-orang yang mengerjakan kejahatan dengan kebodohan, kemudian mereka bertaubat dengan lekas. Maka mereka itu akan diberi ampun oleh Allah atas- nya, karena Allah itu Pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tobat dari Allah kepada hamba-hamba-Nya terbagi dua: berupa taufiq dari Allah untuk bertobat dan menerimanya. Termasuk \"tidak mengerti\" adalah: 1. Orang yang berbuat maksiat dengan tidak mengetahui bahwa perbuatan itu adalah maksiat kecuali setelah dipikirkan lebih dahulu. 2. Orang yang durhaka kepada Allah baik dengan sengaja atau tidak. 3. Orang yang melakukan kejahatan karena kurang kesadaran disebabkan karena sangat marah atau karena dorongan hawa nafsu. 4. Karena tidak mengerti akibatnya dan bahwa perbuatan tersebut dapat mendatangkan kemurkaan Allah serta siksa-Nya, 5. Karena tidak mengerti bahwa Allah menyaksikan dan melihatnya, 6. Karena tidak mengerti bahwa perbuatan terebut akan mengakibatkan imannya lemah atau bahkan hilang. Dengan demikian, setiap orang berbuat maksiat adalah orang yang jahil (tidak mengerti) berdasarkan pertimbangan tersebut meskipun mengetahui keharamannya. Bahkan mengetahui suatu hal haram merupakan syarat perbuatan tersebut disebut maksiat yang dikenakan siksa. Yakni sebelum ajal di kerongkongan atau sebelum menyaksikan maut dan sebelum menyaksikan azab. Bisa juga arti \"kemudian segera bertobat\" yakni segera bertobat setelah melakukan dosa tersebut, sehingga maksud ayat tersebut adalah, \"Barang siapa yang segera berhenti ketika melakukan dosa, lalu kembali kepada Allah dan menyesalinya, maka sesungguhnya Allah menerima tobatnya.\" Berbeda dengan orang yang terus-menerus berbuat dosa dan berada di atas cacatnya sehingga sifat itu menancap dalam dirinya, maka sulit baginya mewujudkan tobat yang sempurna, bahkan biasanya ia tidak diberi taufiq untuk bertobat dan tidak dipermudah sebab-sebabnya, misalnya orang yang mengerjakan keburukan atas dasar pengetahuan yang yakin dan meremehkan perhatian Allah, maka sesungguhnya ia sama saja menutup pintu rahmat bagi dirinya. Namun terkadang Allah memberikan taufiq untuk bertobat kepada orang yang selalu berbuat dosa atas dasar kesengajaan, di mana dengan tobat itu perbuatan jahatnya yang telah lalu terhapus, tetapi rahmat dan taufiq lebih dekat kepada yang pertama tadi, oleh karenanya, Allah Subhaanahu wa Ta'aala mengakhirinya ayat dengan firman-Nya, \"Wa kaanallahu 'aliiman hakiimaa\" (Allah Maha Mengetahui lagi Mahabijaksana). Termasuk ilmu-Nya adalah Dia mengetahui orang yang benar-benar bertobat dengan yang dusta, sehingga Dia membalas masing-masingnya sesuai kebijksanaan-Nya. Termasuk kebijaksanaan-Nya adalah Dia memberi taufiq untuk bertobat orang yang dikehendaki oleh kebijaksanaan dan rahmat-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 17",
    "description": "Pada ayat lalu ditegaskan bahwa Allah maha penerima tobat dan maha penyayang. Sesungguhnya bertobat kepada Allah yakni penerimaan tobat yang diwajibkan Allah atas diri-Nya sebagai salah satu bukti rahmat dan anugerah-Nya kepada manusia itu hanya bagi mereka yang melakukan kejahatan, baik dosa kecil maupun dosa besar, karena tidak mengerti yakni karena didorong oleh ketidaksadaran akan dampak buruk dari kejahatan itu, kemudian mereka segera bertobat kepada Allah dengan tulus disertai penyesalan yang mendalam paling lambat sesaat sebelum berpisahnya roh dari jasad. Tobat mereka itulah, yang kedudukannya cukup tinggi, yang diterima Allah. Allah maha mengetahui orang yang betul-betul jujur, tulus, dan ikhlas dalam tobatnya. Dia juga mahabijaksana dengan tidak berbuat aniaya kepada hamba-Nya, sehingga dia menerima tobat siapa yang wajar diterima dan menolak siapa yang pantas ditolak tobatnya. Setelah menjelaskan tobat yang diterima dan batas akhir diterimanya tobat, berikut ini dijelaskan tentang batas akhir waktu penolakan tobat serta dampak dari penolakan itu. Dan tobat yakni pengampunan dosa itu tidaklah diberikan Allah untuk mereka yang melakukan kejahatan atau kedurhakaan secara terus-menerus, silih berganti tanpa penyesalan. Tindakan tersebut dilakukan hingga apabila datang ajal kepada seseorang di antara mereka secara tiba-tiba, dan roh sudah berada di tenggorokan, atau sesaat sebelum keluarnya roh dari jasadnya, barulah dia mengatakan, saya benar-benar bertobat sekarang. Tobat dalam kondisi tersebut pada saat diperlihatkan azab yang akan menimpanya, tidaklah diterima Allah (lihat: surah ga'fir/40: 85). Dan selain itu tidak pula diterima tobat dari orang-orang yang meninggal sedang mereka dalam keadaan kafir, yakni kematiannya membawa serta kekufurannya yang tidak disertai dengan tobat. Bagi orang-orang itu telah kami sediakan azab yang pedih di akhirat dan tidak ada seorang pun yang bisa menghalangi siksaan yang akan ditimpakan kepadanya."
  }
]