[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian manusia, sungguh telah datang kepada kalian rasul kami, Muhammad ,dengan membawa risalah islam,yaitu agama yang benar dari tuhan kalian,maka berimanlah kepadanya dan ikutilah dia.Sesungguhnya beriman kepadanya itu lebih baik bagi kalian. Dan jika kalian berkelanjutan di atas kekafiran kalian,maka sesungguhnya Allah maha kaya,tidak butuh kepada kalian dan iman kalian,karena Dia adalah pemilik apa yang ada di langit dan di bumi. Dan Allah maha mengetahui ucapan-ucapan dan perbuatan-perbuatan kalian, juga Maha bijaksana dalam penetapan syariatNya dan perintahNya. Maka apabila langit dan bumi telah benar-benar tunduk kepada Allah secara kauni dan berdasarkan takdir seperti ketundukan seluruh kerajaanNya, maka sepantasnya bagi kalian untuk beriman kepada Allah dan rasulNya Muhammad dan kepada al-qur’an yang Dia turunkan kepadanya, dan menjadi orang-orang yang patuh terhadap hal itu secara syar’i, sehingga alam semesta secara keseluruhan menjadi tunduk kepada Allah,baik secara takdir kauni maupun syari. Dan di dalam ayat ini terdapat dalil tentang universalitas risalah nabi Allah dan rasulNya,Muhammad ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "170. Wahai manusia, telah datang kepada kalian seorang rasul, Muhammad -ṣallallāhu 'alaihi wa sallam- dengan membawa petunjuk dan agama yang benar dari Allah -Ta'ālā-. Maka berimanlah kalian kepada agama yang dibawanya, niscaya hal itu akan lebih baik bagi kalian di dunia dan di Akhirat. Jika kalian ingkar kepada Allah, sesungguhnya Allah tidak membutuhkan keimanan kalian dan tidak rugi dengan kekafiran kalian. Karena Dia memiliki apa saja yang ada di langit dan apa saja yang ada di bumi beserta isinya. Dan Allah Maha Mengetahui siapa yang berhak mendapatkan hidayah (petunjuk) sehingga Dia memberinya kemudahan untuk mendapatkannya, dan siapa yang tidak berhak mendapatkannya maka Dia pun membuatnya buta akan hidayah. Dan Dia Maha Bijaksana dalam firman-firman-Nya, tindakan-tindakan-Nya, ketentuan-ketentuan syariat-Nya, dan ketetapan-ketetapan takdir-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "170. Allah memberi petunjuk bagi seluruh manusia kepada kebenaran Risalah yang Rasulullah datangkan dengan menyeru mereka kepada keimanan. Dia adalah Rasul utusan Allah, dan keimanan lebih baik bagi manusia di dunia dan di akhirat. Dan dia memperingatkan seluruh manusia dari akibat kekafiran, dan kekafiran itu sama sekali tidak memberi mudharat kepada Allah sebab Dia adalah pemilik langit dan bumi. Allah Maha Mengetahui keadaan kalian dan maha bijaksana dalam mengatur urusan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "170. فَـَٔامِنُوا۟ خَيْرًا لَّكُمْ ۚ (maka berimanlah kamu, itulah yang lebih baik bagimu) Yakni berimanlah kalian karena keimanan itu lebih baik bagi kalian. وَإِن تَكْفُرُوا۟( Dan jika kamu kafir) Yakni jika kalian tetap dalam kekafiran. فَإِنَّ لِلّٰهِ مَا فِى السَّمٰوٰتِ وَالْأَرْضِ ۚ(maka sesungguhnya apa yang di langit dan di bumi itu adalah kepunyaan Allah) Karena barangsiapa yang menciptakan kalian serta langit dan bumi maka Ia tidak butuh keimanan kalian dan Dia berkuasa untuk membalas atas keburukan perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "170 Wahai manusia, sesungguhnya telah datang Rasul Muhammad itu kepadamu dengan membawa kebenaran yang diturunkan Tuhanmu, maka berimanlah kamu kepada risalahnya, keimanan itulah yang lebih baik bagimu daripada kekufuran. Jika kamu tetap dalam kekufuran kepada Allah dan rasul-Nya, maka segala yang ada di langit dan di bumi beserta kerajaan dan penghuninya adakah milik Allah. Kekufuran kalian itu tidak akan merugikan Allah sedikitpun. Allah Maha kuasa untuk memberi balasan atas amal buruk kalian. Allah Maha Mengetahui atas semua ciptaan-Nya lagi Maha Bijaksana dalam segala tindakan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia, sungguh telah datang kepada kalian seorang Rasul} Muhammad SAW {dengan kebenaran} dengan petunjuk dan agama kebenaran {dari Tuhan kalian. Maka berimanlah. Itu lebih baik bagi kalian. Jika kalian kafir, sesungguhnya milik Allahlah apa yang di langit dan di bumi. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "170. Allah memerintahkan seluruh manusia agar beriman kepada hamba dan rasulNya, Muhammad, dan Allah menyebutkan sebab diharuskannya beriman kepadanya dan manfaat dari beriman kepadanya, serta kemudharatan yang akan didapatkan dengan tidak beriman kepadanya. Adapun sebab yang mengharuskan untuk beriman kepadanya adalah, kabar Allah bahwa ia datang kepada mereka dengan membawa kebenaran. Artinya, kedatangannya itu sendiri adalah suatu kebenaran dan apa yang dibawanya berupa syariat adalah kebenaran. Seorang yang berakal akan mengetahui bahwa tetapnya orang dalam kejahilan mereka sebenarnya mereka bingung dalam kekufuran mereka dan terus didera kebimbangan. Dan risalah telah terputus dari mereka dan tidak sesuai dengan hikmah Allah dan rahmatNya. Di antara hikmah dan rahmatNya yang agung adalah mengutus Rasul kepada kaum mereka sendiri agar mengajarkan kepada mereka petunjuk dari kesesatan, dan penyimpangan dari jalan yang lurus. Maka dengan hanya memandang pada kerasulannya merupakan sebuah dalil yang kuat akan kebenaran kenabiannya. Demikian juga memperhatikan apa yang dibawa olehnya berupa syariat yang agung dan jalan yang lurus. Di sana terdapat berita-berita tentang hal-hal ghaib yang telah lampau dan yang akan datang, dan kabar tentang Allah dan Hari Akhir yang tidak mungkin diketahui kecuali dengan wahyu maupun kerasulan. Juga terdapat perintah kepada segala kebaikan, keshalihan, kematangan, keadilan, berbuat baik, kejujuran, berbakti, silaturahim, dan akhlak yang terpuji. Dan juga berupa larangan dari kejahatan, kerusakan, kezhaliman, melampaui batas, akhlak yang jelek, berdusta, dan durhaka, yang secara pasti dan sangat meyakinkan bahwa datangnya dari Allah. Dan setiap kali ilmu seorang hamba bertambah karenanya, akan bertambah pula keimanan dan keyakinannya. Maka inilah sebab yang mendorong kepada keimanan. Adapun manfaat keimanan, Allah telah mengabarkan bahwa hal itu lebih baik “bagi kalian.” Baik adalah lawan dari buruk. Maka iman lebih baik kaum Mukminin pada tubuh, hati, jiwa mereka, dunia, dan akhirat mereka. Yang demikian itu karena pengaruh yang diakibatkan olehnya, berupa kemaslahatan maupun manfaat. Setiap balasan yang segera atau tertunda, adalah buah dari keimanan. Kemenangan, petunjuk, ilmu, amal shalih, kebahagiaan, kesenangan, dan surga dan apa yang terkandung di dalamnya berupa kenikmatan, semua itu adalah sebab dari iman, sebagaimana kesengsaraan duniawi dan ukhrawi adalah karena tidak adanya keimanan atau kurangnya iman. Sedangkan mudharat karena tidak beriman kepada beliau, akan diketahui dari perkara yang berlawanan dengan akibat dari beriman kepadanya, dan bahwa seorang hamba itu tidaklah memudharatkan kecuali dirinya sendiri. Allah tidak membutuhkan dirinya, karena kemaksiatan seorang pelaku maksiat tidaklah akan memudharatkanNya. Karena itulah Allah berfirman, “Karena sesungguhnya apa yang ada di langit dan di bumi itu adalah kepunyaan Allah.” Maksudnya, seluruhnya adalah ciptaanNya, kerajaanNya, dan di bawah pengaturan dan pengelolaanNya. “Dan Allah Maha Mengetahui” akan segala sesuatu, “lagi Mahabijaksana” dalam penciptaan dan perintahNya. Dia-lah Yang Maha Mengetahui orang yang berhak mendapatkan petunjuk dan kesesatan, Mahabijaksana dalam memberikan petunjuk dan kesesatan pada tempatnya masing-masing."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 170: Hai manusia! Sesungguhnya telah datang kepada kamu Rasul itu dengan (mem bawa) kebenaran dari Tuhan kamu, Lantaran itu berimanlah, (karena yang demikian itu) baik bagi kamu; tetapi jika kamu kufur, maka sesungguhnya kepunyaan Allah-lah apa-apa yang di langit dan di bumi dan adalah Allah itu Pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala memerintahkan semua manusia untuk beriman kepada hamba-Nya dan Rasul-Nya, yaitu Muhammad shallallahu 'alaihi wa sallam, menyebutkan sebab yang mengharuskan untuk beriman dan faedah beriman serta bahaya dari tidak beriman. Sebab yang mengharuskan untuk beriman kepada Beliau adalah pemberitahuan-Nya bahwa Nabi-Nya datang kepada mereka dengan membawa kebenaran, yakni kedatangan Beliau adalah hak (benar) dan syari'at yang dibawanya juga hak. Hal itu, karena orang yang berakal mengetahui bahwa jika manusia tetap di atas kebodohan (masa jahiliyyah), berada dalam kekufuran dan lagi risalah telah putus, maka tidak sesuai dengan hikmah Allah dan rahmat-Nya jika mereka dibiarkan. Bahkan termasuk hikmah Allah dan rahmat-Nya diutus-Nya rasul kepada mereka untuk mengenalkan mana petunjuk dan mana yang sesat, mana jalan yang benar dan mana jalan yang salah. Dengan memperhatikan risalah Beliau terdapat dalil yang pasti terhadap kebenaran Beliau. Demikian juga dengan memperhatikan syari'at yang dibawa Beliau, di dalamnya terdapat berita-berita ghaib; masa lalu maupun yang akan datang, yang hal itu tidak diketahui kecuali dengan perantaraan wahyu. Belum lagi dengan perintah yang ada di dalamnya, di mana isinya memerintahkan kepada semua kebaikan, kebenaran, keadilan, ihsan, kejujuran, berbakti kepada orang tua, menyambung silaturrahim, menunaikan amanah, menepati janji, berakhlak mulia dan melarang dari semua keburukan dan kerusakan, permusuhan dan kezaliman, akhlak buruk, dusta, durhaka kepada orang tua dan memutuskan tali silaturrahim. Ini semua membuat kita semakin yakin bahwa apa yang Beliau bawa benar-benar dari sisi Allah. Adapun faedah dari keimanan, maka dalam ayat di atas disebutkan bahwa yang demikian lebih baik bagi kita. Baik di sini umum, baik untuk kebaikan badan kita, hati kita, ruh kita, dunia kita maupun akhirat kita. Hal itu karena di dalamnya mengandung banyak maslahat dan faedah. Adanya pahala di dunia dan di akhirat termasuk faedah dari keimanan, adanya pertolongan, petunjuk, ilmu, amal salih, kesenangan dan kebahagiaan, memperoleh surga dan kenikmatannya termasuk faedah dari keimanan. Sebagaimana kesengsaraan di dunia dan akhirat diakibatkan dari ketidakadaan iman atau kekurangannya. Adapun bahya dari tidak beriman, maka banyak sekali, di antaranya ia akan mendapatkan kebalikan dari apa yang didapatkannya jika beriman, dan lagi seseorang hamba jika tidak beriman tidaklah merugikan siapa pun selain dirinya sendiri, sedangkan Allah Maha Kaya, tidaklah merugikan-Nya maksiat orang-orang yang bermaksiat, bahkan kalau pun semua manusia kafir kepada Allah, maka hal itu tidaklah mengurangi kerajaan-Nya, milik Allah-lah semua yang ada di langit dan di bumi, Dia Maha Mengetahui siapa yang berhak mendapat hidayah dan siapa yang berhak mendapat kesesatan, Dia juga Maha bijaksana dalam menempatkan kepada siapa hidayah diberikan dan kepada siapa kesesatan ditimpakan. Daripada keadaanmu sekarang ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 170",
    "description": "Wahai manusia! sungguh telah datang rasul, yaitu nabi Muhammad, kepadamu dengan membawa tuntunan kitab suci Al-Qur'an yang mengandung kebenaran dari tuhanmu, maka berimanlah kepadanya dengan iman yang benar, sesungguhnya keimanan itu lebih baik bagimu. Dan jika kamu kafir kepada Allah dan rasul-Nya, kekafiranmu itu tidak merugikan Allah sedikit pun, karena sesungguhnya milik Allah-lah apa yang di langit dan di bumi. Allah maha mengetahui siapa yang taat dan siapa yang durhaka dari hamba-Nya, mahabijaksana dengan memperlakukan hamba-Nya sesuai dengan amal perbuatannyasetelah mengajak seluruh manusia untuk beriman, ayat ini menyeru kepada ahli kitab yang pada ayat-ayat lalu dilukiskan telah melampaui batas dalam kepercayaan mereka. Orang-orang nasrani melampaui batas dalam kepercayaan mereka karena menuhankan nabi isa dan orang-orang yahudi melampaui batas karena menuduh nabi isa sebagai pendusta. Kepada ahli kitab yang melampaui batas itu, ayat ini diarahkan. Wahai ahli kitab! janganlah kamu melampaui batas kewajaran yang ditetapkan oleh akal dan agama dalam melaksanakan agamamu, dan janganlah kamu mengatakan terhadap Allah kecuali yang benar. Jangan mengatakan bahwa isa adalah tuhan atau anak tuhan sebagaimana yang dikatakan oleh orang-orang nasrani, dan jangan pula mengatakan bahwa isa adalah pendusta sebagaimana dikatakan oleh orang-orang yahudi. Sungguh, al-masih isa putra maryam itu adalah utusan Allah dan yang diciptakan dengan kalimat-Nya, yaitu dengan kalimat kun (jadilah) yang menunjukkan kepada kehendaknya dan kekuasaan-Nya dalam menciptakan nabi isa, yang disampaikan-Nya kalimat itu kepada maryam, dan dengan roh dari-Nya, yang ditiupkan dengan perintah-Nya. Maka berimanlah kepada Allah dan rasul-rasul-Nya, termasuk beriman kepada nabi Muhammad, dan janganlah kamu mengatakan, yakni percaya bahwa tuhan itu tiga. Berhentilah dari mengatakan ucapan itu. Yang demikian itu lebih baik bagimu. Sesungguhnya Allah tuhan yang maha esa, tiada sekutu baginya, mahasuci dia dari anggapan mempunyai anak, sebab jika demikian berarti ia butuh kepada sesuatu, padahal milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan cukuplah Allah sebagai pelindung yang melindungi dan memelihara kamu semua."
  }
]