[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai pengikut ajaran injil,janganlah kalian melampaui batas keyakinan yang benar dalam agama kalian,dan janganlah kalian berbicara atas nama Allah kecuali kebenaran, maka janganlah kalian menjadikan bagi Dia seorang istri dan anak. Sesungguhnya isa al-masih putra Maryam hanyalah utusan Allah yang Allah utus dengan kebenaran, dan Allah menciptaknnya dengan kalimatNYa yang Allah mengutus jibril dengan membawanya kepada Maryam, yaitu firmanNYa,”kun(jadilah)”, lalu jadilah isa. Itu merupakan tiupan dari Allah yang ditiupkan oleh jibril dengan perintah tuhannya. Maka imanilah bahwa sesungguhnya Allah itu maha esa, dan berserah dirilah kalian kepadaNya. Dan berimanlah kepada para rasulNya terkait risalah yang mereka bawa dari sisi Allah. Dan janganlah kalian menjadikan isa dan ibunya sebagai sekutu bersama Allah. Berhentilah dari ucapan ini,itu lebih baik bagi kalian dari pada keyakinan yang kalian pegangi, sesungguhnya Allah itu sembahan yang satu . Apa-apa yang ada di langit dan di bumi adalah kepemilikanNya. Maka bagaimana bisa Dia memiliki istri dan anak? Dan cukuplah Allah sebagai yang mengurusi pengaturan makhlukNya dan pengendalian penghidupan mereka. Maka bertawakalah kepada Allah semata, sebab Dia akan mencukupi kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "171. Katakanlah -wahai Rasul- kepada orang-orang Nasrani, penganut kitab suci Injil, “Janganlah kalian melampaui batas yang ada di dalam agama kalian. Dan janganlah kalian berkata tentang Isa -'alaihissalām- kecuali dengan bukti yang benar. Sesungguhnya Isa putra Maryam itu hanyalah seorang rasul yang diutus oleh Allah dengan membawa kebenaran. Dia menciptakannya dengan kalimat-Nya yang dikirimkan oleh Jibril -'alaihissalām- kepada Maryam, yaitu kalimat, ‘Kun' (Jadilah), maka jadilah. Kalimat itu adalah tiupan dari Allah yang ditiupkan oleh Jibril atas perintah Allah. Maka berimanlah kalian kepada Allah dan seluruh rasul-Nya, tanpa membeda-bedakan antara yang satu dengan yang lain. Dan janganlah kalian berkata, ‘Tuhan itu ada tiga’. Berhentilah mengucapkan kata-kata yang bohong dan keliru itu. Karena menghentikan ucapan tersebut akan lebih baik bagi kalian di dunia dan di Akhirat. Sesungguhnya Allah adalah Rabb Yang Maha Esa. Dia Mahasuci tidak memiliki sekutu dan anak. Dia sama sekali tidak membutuhkannya. Dia lah pemilik apa saja yang ada di langit dan apa saja yang ada di bumi beserta isinya. Dan cukuplah Allah sebagai Pengawas serta Pengatur dalam urusan makhluk-Nya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "171. Allah melarang orang-orang Yahudi dan Nasrani untuk menggunakan panggilan yang lembut namun mengandung penghinaan, melarang dari sifat berlebihan dalam beragama, dan mengatakan sesuatu yang tidak baik yang terhadap Allah. Ini merupakan sindiran halus dan pendorong bagi mereka agar kembali merujuk kitab-kitab yang mereka imani, serta hujjah bagi mereka atas apa yang ada dalam kitab-kitab mereka berupa kabar, tanda-tanda, dan perjanjian-perjanjian yang mereka ambil untuk beriman kepada penutup para nabi dan untuk menjadi pengikut dan penolongnya. Namun betapa jauhnya mereka telah meninggalkan dan melalaikan nya! Bahkan mereka malah menyatakan permusuhan terhadap Nabi meskipun mereka mengimani kitab-kitab yang ada pada mereka. Allah juga melarang mereka dari sikap berlebih-lebihan terhadap Isa al-Masih, dan dia menjelaskan hakikat yang benar tentangnya, dia adalah seorang manusia yang diutus sebagai Rasul, sifat-sifatnya bagaimana para rasul yang lain Allah juga menentang sikap berlebih-lebihan orang-orang Yahudi mengenai Isa. Mereka mengingkari risalahnya, menuduh ibunya, dan melecehkan dakwahnya. Isa Al-masih diciptakan dengan kalimat Allah dan memberinya kehidupan, Allah menciptakan ruh untuk ditiupkan oleh malaikat ke dalam perut ibunya sehingga jadilah Isa al-Masih. Allah telah menyeru manusia untuk beriman kepada-Nya dan kepada para rasul-Nya dengan keimanan yang murni, menjelaskan hakikat Isa al-Masih, dan memperingatkan para Ahli kitab dari kesesatan dalam perkara Isa al-Masih. Maha suci Allah dari kebutuhan terhadap anak, karena kebutuhan terhadap anak merupakan keadaan orang yang butuh terhadap orang yang dapat membantunya atau menggantinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "171. يٰٓأَهْلَ الْكِتٰبِ لَا تَغْلُوا۟ فِى دِينِكُمْ (Wahai Ahli Kitab, janganlah kamu melampaui batas dalam agamamu) Makna (الغلو) yakni melewati batas dengan berlebih-lebihan atau kelalaian, dan yang termasuk berlebih-lebihan adalah orang-orang Nasrani yang menjadikan Nabi Isa sebagai tuhan, dan termasuk kelalaian adalah orang-orang Yahudi yang menjadikan Nabi Isa tidak dalam jalan yang benar. وَلَا تَقُولُوا۟ عَلَى اللهِ إِلَّا الْحَقَّ ۚ( dan janganlah kamu mengatakan terhadap Allah kecuali yang benar) Seperti perkataan orang-orang Yahudi bahwa ‘Uzair adalah anak Allah, dan perkataan orang-orang Nasrani bahwa Isa al-Masih adalah anak Allah. وَكَلِمَتُهُۥٓ أَلْقَىٰهَآ إِلَىٰ مَرْيَمَ (dan (yang diciptakan dengan) kalimat-Nya yang disampaikan-Nya kepada Maryam) Yakni yang Dia ciptakan dengan firman-Nya “kun” (jadilah), maka jadilah ia manusia meski tanpa ada ayah. وَرُوحٌ مِّنْهُ ۖ (dan (dengan tiupan) roh dari-Nya) Yakni Dia mengutus Jibril untuk meniupkan ruh kedalam Rahim Maryam sehingga ia mengandung atas izin Allah. Dan penisbatan ruh Isa kepada Allah adalah sebagai penghormatan, meski semua ruh merupakan ciptaan-Nya. فَأٰ مِنُوا۟ بِاللهِ وَرُسُلِهِۦ ۖ( Maka berimanlah kamu kepada Allah dan rasul-rasul-Nya) Yakni beriman bahwa Dia adalah Tuhan yang satu, yang tidak beranak dan tidak diperanakkan, yang tidak ada yang setara dengan-Nya; dan beriman bahwa rasul-rasul-Nya benar, tidak mendustakan mereka dan tidak berlebih-lebihan terharap mereka sehingga menjadikan mereka tuhan. وَلَا تَقُولُوا۟ ثَلٰثَةٌ ۚ( dan janganlah kamu mengatakan: “(Tuhan itu) tiga”) Yakni jangan mengatakan mereka ada tiga. Dan orang-orang Nasrani meski mereka terbagi-bagi dalam sekte-sekte namun mereka semua sepakat bahwa tuhan terbagi menjadi tiga. Dan yang dimaksud dengan tiga adalah tiga oknum, dengan menjadikan Allah sebagai satu pribadi yang memiliki tiga oknum, yakni oknum perwujudan, oknum kehidupan, dan oknum ilmu; biasanya diistilahkan sebagai bapa, anak, dan ruhul qudus. Dan menurut pendapat lain yang dimaksud dengan tuhan yang tiga adalah Allah, Maryam, dan al-Masih. Dan orang-orang Nasrani berdebat dalam hal ini dalam perdebatan yang panjang. انتَهُوا۟ خَيْرًا لَّكُمْ ۚ( berhentilah (dari ucapan itu). (Itu) lebih baik bagimu) Yakni berhentilah dari keyakinan bahwa tuhan itu tiga, dan hal itu lebih baik bagi kalian dari keberadaan kalian dalam kekafiran. سُبْحٰنَهُۥٓ أَن يَكُونَ لَهُۥ وَلَدٌ ۘ (Maha Suci Allah dari mempunyai anak) Yakni Dia disucikan dari mempunyai anak. لَّهُۥ مَا فِى السَّمٰوٰتِ وَمَا فِى الْأَرْضِ ۗ (segala yang di langit dan di bumi adalah kepunyaan-Nya) Dan apa yang kalian jadikan sebagai sekutu atau anak-Nya adalah termasuk dalam kepunyaan-Nya, dan apa yang dimuliki tidak mungkin menjadi sekutu atau anak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "171 Wahai Ahli Kitab, janganlah kamu melampaui batas dalam agamamu. Sekelompok kalian menikam Isa, namun sekelompok lain menganggapnya sebagai Tuhan. Janganlah kamu mengatakan tentang Allah kecuali hal yang benar. Jangan katakan bahwa Uzair anak Allah, dan Isa juga anak Allah. Sesungguhnya Isa Al Masih adalah tanda atau ayat kekuasaan Allah. Isa ada dan tercipta dengan perkataan kun: jadilah dalam diri Maryam lewat Jibril, dan Jibril meniupkan ruh kepadanya dari rahasia Allah, sebagaimana arwah-arwah yang Allah ciptakan. Allah menambahkannya kepada Isa sebagai bentuk penganugerahan dan penghormatan. Maka berimanlah kamu bahwa Allah adalah Maha Esa tidak punya sekutu dan bahwa rasul-rasul-Nya adalah benar sehingga jangan kalian dustakan mereka. Janganlah kamu mengatakan: “Tuhan itu ada tiga”, adapun orang Nasrani mengatakan bahwa Tuhan itu mempunyai tiga wujud yaitu bentuk wujud, kehidupan dan ilmu, juga digambarkan dengan Tuhan bapak, Tuhan ibu dan Tuhan roh kudus. Berhentilah dari ucapan yang menganggap Tuhan ada tiga itu, maka akan lebih baik dari pada engkau tetap dalam kekufuran. Sesungguhnya Allah Tuhan Yang Maha Esa, Maha Suci Allah dari persifatan untuk mempunyai anak, segala yang ada di langit dan di bumi adalah kepunyaan-Nya. Yang telah kalian jadikan anak dan sekutu bagi Allah itu semua adalah milik Allah. Sehingga ciptaan atau kepunyaan tidak mungkin sepadan atau sekutu dengan Allah. Cukuplah Allah menjadi Pemelihara segala urusan makhluk-Nya. Ayat ini turun untuk kelompok Nasrani yang mengatakan bahwa Isa adalah putera Allah. Sehingga Allah menurunkan ayat ini yaitu Janganlah engkau berlebihan dalam agamamu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Ahlul kitab, janganlah kalian berlebih-lebihan} janganlah kalian melebihi batas {dalam agama kalian dan janganlah kalian berkata terhadap Allah, kecuali yang benar. Sesungguhnya, Isa putra Maryam itu hanyalah utusan Allah dan kalimatNya yang Dia sampaikan} Dia menciptakanNya dengan kalamNya {Jadilah} kalimat yang disampaikan oleh Jibril {kepada Maryam dan ruh dariNya} tiupan dari Allah yang ditiupkan Jibril sesuai perintah Tuhannya {Maka berimanlah kepada Allah dan rasul-rasulNya dan janganlah kalian berkata, “Tiga.”} janganlah berkata,” Tuhan itu tiga” {Berhentilah. Itu lebih baik bagi kalian. Sesungguhnya Allah adalah Tuhan Yang Maha Esa. Maha suci Dia dari mempunyai anak. MilikNyalah apa yang ada di langit dan apa yang ada di bumi. Cukuplah Allah sebagai pelindung} Maha Mengurusi dan Mengatur ciptaanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "171. Allah melarang Ahli Kitab dari sikap berlebih-lebihan (ghuluw) dalam beragama, yaitu melampaui batas dari ketentuan yang disyariatkan kepada perkara yang tidak disyariatkan. Yang demikian itu adalah seperti perkataan kaum Nasrani yang melampaui batas terhadap Isa dan penempatan mereka terhadapnya melebihi dari kedudukan kenabian dan kerasulan kepada kedudukan ketuhanan yang tidak patut diberikan selain kepada Allah. Maka sebagaimana perkara asal-asalan dan lalai itu adalah perkara yang dilarang, maka melampaui batas juga dilarang. Karena itulah Allah berfirman, “Dan janganlah kamu mengatakan terhadap Allah kecuali yang benar.” Firman ini mengandung tiga perkara : Dua perkara di antaranya adalah dilarang, yaitu perkataan dusta terhadap Allah dan perkataan tanpa didasari dengan ilmu mengenai nama-namaNya, sifat-sifatNya, perbuatan-perbuatanNya, syariatNya, dan rasul-rasulNya, dan perkara ketiga adalah yang diperintahkan (kepadanya) yaitu perkataan yang benar dalam semua masalah tadi. Dan manakala hal ini adalah sebuah kaidah yang global, dan konteks ayat ini tentang Isa, Allah menegaskan tentang perkataan yang benar dalam hal itu yang bertentangan dengan klaim (keyakinan) orang-orang Yahudi dan orang-orang Nasrani, seraya berfirman, “ Sesungguhnya Al- Masih, Isa Putra Maryam itu, itu adalah utusan Allah.” Maksudnya, sebagai Rasul Allah itulah kedudukan paling tinggi dan predikat paling besar Al-Masih dari derajat kesempurnaan yang di dapatkan oleh mahkluk, yaitu derajat kerasulan, yang merupakan tingkatan paling tinggi dan posisi paling mulia. Dan bahwa ia adalah “(yang diciptakan dengan) kalimatNya dan di sampaikanNya kepada Maryam,” maksudnya, sebuah kata yang di ucapkan oleh Allah, lalu jadilah Isa dengannya. Ini adalah bentuk idhafah (kata majemuk) bernuansa pemulihan dan penghormatan. Demikian juga firmanNya, “dan dengan tiupan Ruh dariNya,” yaitu, dengan ruh-ruh yang di ciptakan olehNya, di sempurnakan dengan sipat-sipat yang luhur, dan ahklak-ahklak yang sempurna. Allah mengutus RuhNya, Jibril, lalu meniupkannya ke dalam Rahim Maryam sehingga ia mengandung Isa dengan izin Allah. Dan ketika Allah menjelaskan hakikat dari penciptaan Isa, Allah memerintahkan Ahli kitab untuk beriman kepadaNya dan kepada RasulNya, dan Allah melarang mereka menjadikanNya ketiga dari yang tiga; salah satunya adalah Isa dan keduanya adalah Maryam. Ini adalah pernyatan kaum Nasrani, semoga Allah menjelekan mereka. Dan Allah memerintahkan agar meninggalkan hal tersebut dan mengabarkan bahwa hal itu adalah lebih baik bagi mereka. Karena yang jelas, itu adalah menuju kepada keselamatan dan selain dari itu adalah jalan kehancuran. Kemudian Allah menyucikan diriNya dari sekutu dan anak seraya berfirman, “ Sesungguhnya Allah Tuhan Yang Maha Esa,” yaitu, dia sendirian dalam ketuhanan yang tidak sepatutnya ibadah di lakukan kecuali untuk diriNya semata. “Maha Suci Allah” yaitu bersih dari kekurangan dan suci “ dari mempunyai anak.” Karena sesungguhnya, “ segala yang di langit dan di bumi adalah kepunyanNya.” Seluruhnya adalah milik Allah yang butuh kepadaNya, maka sangat mustahil sekali Allah memiliki sekutu di antara mereka atau anak. Dan tatkala Allah memberikan bahwa dia adalah Raja Alam Langit dan bumi lalu Allah mengabarkan bahwa Allah mengurus kemaslahatan buat mereka, dunia maupun ahkirat, dan Allah memeliharanya dan memberikan balsan kepadaNya atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 171: Hai Ahli Kitab! Janganlah kamu melewati batas di tentang agama kamu, dan janganlah kamu berkata atas (nama) Allah melainkan (perkataan) yang benar. Al- Masih, 'Isa anak Maryam itu, tidak lain melainkan pesuruh Allah dan (bukti bagi) perkataan-Nya yang la khabarkan kepada Maryam dan (bukti bagi) tiupan ruh daripada- Nya. Lantaran itu berimanlah kepada Allah dan Rasul-rasulNya, dan janganlah kamu berkata: \"(Tuhan itu) Tiga\". Berhentilah, (karena yang demikian) baik bagi kamu. Allah itu tidak lain melainkan Tuhan yang Tunggal. Maha suci Ia daripada mempunyai anak. Ba- giNyalah apa-apa yang di langit dan apa-apa yang di bumi; dan cukuplah Allah itu jadi Pelindung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang Nasrani. Maksudnya melewati batas atau ukuran yang disyari'atkan kepada yang tidak disyari'atkan. Misalnya mengangkat Nabi Isa 'alaihis salam melebihi kedudukannya sebagai hamba, nabi dan rasul dengan menjadikannya sebagai tuhan. Demikian juga kita dilarang meremehkan nabi sebagaimana dilarang pula berlebihan atau melampaui batas terhadapnya. Dalam ayat ini terdapat larangan berdusta atas nama Allah, berkata tentang Allah tanpa ilmu baik terhadap nama-Nya, sifat-Nya, perbuatan-Nya, syari'at-Nya dan para rasul-Nya, serta memerintahkan berkata yang hak dalam semua itu. Hal ini adalah kaidah umum, namun karena ayat ini membicarakan tentang Nabi Isa 'alaihis salam, maka berkata yang hak terhadap Allah dfalam ayat ini adalah dengan menyucikan-Nya dari adanya sekutu, istri atau pun anak. Maksud kalimat yaitu kun (jadilah), sehingga Nabi Isa 'alaihis salam diciptakan tanpa bapak. Yakni di antara roh-roh yang diciptakan-Nya. Disebut tiupan dari Allah karena tiupan itu berasal dari perintah Allah. Disandarkan kepada-Nya adalah sebagai pemuliaan baginya sebagaimana pada kata \"kalimatuhu\" (kalimat-Nya). Dan beralihlah kepada Tauhid, yakni menyatakan Allah Maha Esa, tidak ada sekutu bagi-Nya. Yang satu-satunya berhak diibadati. Yakni makhluk-Nya, milik-Nya dan hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 171",
    "description": "Setelah mengajak seluruh manusia untuk beriman, ayat ini menyeru kepada ahli kitab yang pada ayat-ayat lalu dilukiskan telah melampaui batas dalam kepercayaan mereka. Orang-orang nasrani melampaui batas dalam kepercayaan mereka karena menuhankan nabi isa dan orang-orang yahudi melampaui batas karena menuduh nabi isa sebagai pendusta. Kepada ahli kitab yang melampaui batas itu, ayat ini diarahkan. Wahai ahli kitab! janganlah kamu melampaui batas kewajaran yang ditetapkan oleh akal dan agama dalam melaksanakan agamamu, dan janganlah kamu mengatakan terhadap Allah kecuali yang benar. Jangan mengatakan bahwa isa adalah tuhan atau anak tuhan sebagaimana yang dikatakan oleh orang-orang nasrani, dan jangan pula mengatakan bahwa isa adalah pendusta sebagaimana dikatakan oleh orang-orang yahudi. Sungguh, al-masih isa putra maryam itu adalah utusan Allah dan yang diciptakan dengan kalimat-Nya, yaitu dengan kalimat kun (jadilah) yang menunjukkan kepada kehendaknya dan kekuasaan-Nya dalam menciptakan nabi isa, yang disampaikan-Nya kalimat itu kepada maryam, dan dengan roh dari-Nya, yang ditiupkan dengan perintah-Nya. Maka berimanlah kepada Allah dan rasul-rasul-Nya, termasuk beriman kepada nabi Muhammad, dan janganlah kamu mengatakan, yakni percaya bahwa tuhan itu tiga. Berhentilah dari mengatakan ucapan itu. Yang demikian itu lebih baik bagimu. Sesungguhnya Allah tuhan yang maha esa, tiada sekutu baginya, mahasuci dia dari anggapan mempunyai anak, sebab jika demikian berarti ia butuh kepada sesuatu, padahal milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan cukuplah Allah sebagai pelindung yang melindungi dan memelihara kamu semuaayat selanjutnya menyatakan bahwa nabi isa bukan tuhan dan bukan pula pelindung atau juru selamat bagi umat manusia, melainkan seorang hamba Allah. Ayat ini menyatakan bahwa al-masih yang dipertuhankan oleh orang-orang nasrani sama sekali tidak enggan, tidak malu, menjadi hamba Allah yang tunduk dan taat kepada-Nya, dan begitu pula para malaikat yang terdekat kepada Allah, yakni malaikatmalaikat yang didekatkan kedudukannya di sisi Allah seperti malaikat jibril, mikail, dan israfil. Dan barang siapa enggan menyembah-Nya dan menyombongkan diri, serta tidak taat kepada perintah-Nya, maka Allah akan mengumpulkan mereka semua, baik yang enggan maupun yang menyombongkan diri, kepada-Nya, kelak di hari kemudian."
  }
]