[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak akan malu-malu dan tidak akan menolak Al-masih untuk menjadi hamba Allah. Begitu pula tidak akan enggan para malaikat yang didekatkan (kepada Allah) untuk mengakui penghambaan diri mereka kepada Allah . Dan barangsiapa yang angkuh untuk tunduk dan sombong,maka Allah akan mengumpulkan mereka semua kepadaNya pada hari kiamat dan memutuskan diantara mereka dengan putusanNYa yang adil. Dan Dia akan membalasa masing-masing kalian sesuai dengan apa yang menjadi haknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "172. Isa putra Maryam tidak akan sombong maupun congkak untuk menjadi hamba Allah. Dan para malaikat yang statusnya didekatkan oleh Allah dan derajat mereka pun dinaikkan tidak akan congkak untuk menjadi hamba-hamba Allah. Lalu bagaimana mungkin kalian menjadikan Isa sebagai tuhan? dan bagaimana bisa kaum musyrikin menjadikan para malaikat sebagai tuhan? Barangsiapa yang congkak dan enggan menjadi hamba Allah, sesungguhnya Allah akan menghimpun semua makhluk di sisi-Nya, dan Dia akan membalas setiap orang dengan balasan yang berhak diterimanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "172-173. Setelah Allah menegakkan hujjah atas orang-orang yang tersesat dalam perkara Isa, maka ayat-ayat ini diturunkan untuk menghilangkan kedustaan dan kesesatan yang sering digaungkan mengenai perkara Isa. Dia adalah hamba Allah yang tidak akan menolak untuk menjadi hamba Allah dan tidak akan enggan untuk selalu menyembah Allah; demikian pula para malaikat yang dekat dengan Allah, Meskipun mereka memiliki derajat dan kedudukan yang tinggi namun mereka tidak pernah enggan untuk menyembah Allah, karena menyembah Allah merupakan suatu kemuliaan. Kemudian Allah mengancam orang-orang yang enggan untuk menyembah-Nya bahwa nasib mereka berada di tangannya, dan Allah akan membalasnya dengan balasan yang setimpal. Orang-orang yang beriman kepada Allah dan rasulnya dan mengiringi keimanan itu dengan amalan-amalan shalih akan diberi pahala yang sempurna dan ditambah derajatnya dengan karunia-Nya. Adapun orang-orang yang sombong dan enggan untuk menyembah-Nya maka Allah akan mengazab jasad dan ruh mereka dengan azab yang pedih, dan mereka tidak akan mendapatkan orang yang mampu memenuhi keinginan dan m"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "172. لَّن يَسْتَنكِفَ الْمَسِيحُ أَن يَكُونَ عَبْدًا لِّلَّهِ (Al Masih sekali-kali tidak enggan menjadi hamba bagi Allah) Yakni tidak akan menolak untuk menyembah Allah dan ia tidak akan menganggap itu sebagai aib namun itu merupakan kemuliaan yang sesungguhnya, dan ia tidak akan meninggalkan penyembahan kepada-Nya. Orang-orang Nasrani mendapati dalam Injil bahwa Isa tunduk dan beribadah kepada Allah seraya berkata “wahai Tuhan kami yang satu”. وَلَا الْمَلٰٓئِكَةُ الْمُقَرَّبُونَ ۚ( dan tidak (pula enggan) malaikat-malaikat yang terdekat (kepada Allah)) Yakni tidak akan menyombongkan diri sehingga enggan untuk menjadi hamba Allah. وَيَسْتَكْبِرْ (dan menyombongkan diri) Yakni enggan karena kesombongan dan menganggap dirinya agung sehingga tidak mau menjadi hamba Allah. فَسَيَحْشُرُهُمْ إِلَيْهِ جَمِيعًا (nanti Allah akan mengumpulkan mereka semua kepada-Nya) Yakni mengumpulkan orang yang enggan tersebut dan yang lainnya untuk membalas mereka semuanya sesuai dengan amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "172 Al Masih sekali-kali tidak enggan menjadi hamba bagi Allah, juga tidak akan melihat itu sebagai suatu aib. Dan malaikat-malaikat yang terdekat kepada Allah seperti Jibril, Mikail juga tidak menyombongkan diri dengan enggan menjadi hamba Allah. Barangsiapa yang enggan untuk menyembah-Nya, dan menyombongkan diri, kelak Allah akan mengumpulkan mereka semua di akhirat dan akan membalas segala amal mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Isa tidak pernah enggan menjadi hamba Allah dan begitu juga para malaikat yang dekat. Siapa yang enggan} menganggap remeh dan tidak mau {menyembahNya dan menyombongkan diri} meremehkannya {maka Allah akan mengumpulkan mereka semua kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "172. Ketika Allah menyebutkan perbuatan tentang melampui batas kaum Nasrani terhadap Isa, Allah menyebutkan juga bahwa Isa itu adalah hamba dan Rasulnya, lalu Allah menyebutkan dalam ayat ini bahwa Isa tidaklah enggan beribadah kepada TuhannNya, artinya Ia tidak menolak beribadah karena membencinya, tidak dirinya “ dan tidak pula enggan malaikat-malaikat yang terdekat kepada Allah.” Allah mensucikan mereka dari sikap keengganan, dan membersihkan mereka dari kesombongan adalah lebih pasti. Meniadakan suatu hal padanya adalah penetapan akan hal yang berlawanan dengaannya. Artinya, sesungguhnya Isa dan para malaikat yang dekat kepada Allah menyukai beribadah kepada Tuham mereka, bahkan mencintai ibadah itu dan mereka berusaha melaksanakannya dengan sebaik-baikNya menurut kondisi mereka masing-masing. Maka Allah mewajibkan kemuliaan yang besar dan kemenangan yang agung itu untuk mereka, mereka tidaklah enggan menjadi hamba untuk rububiyah dan uluhiyahNya, bahkan mereka memandang hal itu sangat mereka butuhkan dengan kebutuahan yang luar biasa. Dan janganlah diperkirakan bahwa mengangkat Isa atau selainnya dari makhluk lebih tinggi derajatnya yang seharusnya yang diberikan oleh Allah untuknya dan ditinggikan dari statusnya sebagai hamba adalah suatu kesempurnaan, akan tetapi itu justru kekurangan yang sebenarnya, dan itu akan menjadi sasaran celaan dan hukuman. Karena itulah Allah berfirman, “Barangsiapa yang enggan dari menyembahNya dan menyombongkan diri, nanti Allah akan mengumpulkan mereka semua kepadaNya.” Artinya, Allah mengumpulkan seluruh mahluk kepadaNya, orang-orang yang enggan dan sombong dan juga hamba-hambaNya yang beriman, lalu Allah menegakkan pengadilan antara mereka semua dengan ketetapanNya yang adil dan balasaNya yang patut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 172: Al-Masih itu tidak malu jadi hamba Allah, dan tidak (juga) malaikat-malaikat yang dihampiri (oleh Allah), karena barangsiapa dari beribadat kepada-Nya dengan malu dan menyombong, maka la akan kumpulkan mereka kepada-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Isa 'alaihis salam dan para malaikat senang menjadi hamba Allah dan beribadah kepada-Nya. Yaitu malaikat yang berada di sekitar Arsy seperti Jibril, Mikail, Israfil dan malaikat-malaikat yang setingkat dengan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 172",
    "description": "Ayat selanjutnya menyatakan bahwa nabi isa bukan tuhan dan bukan pula pelindung atau juru selamat bagi umat manusia, melainkan seorang hamba Allah. Ayat ini menyatakan bahwa al-masih yang dipertuhankan oleh orang-orang nasrani sama sekali tidak enggan, tidak malu, menjadi hamba Allah yang tunduk dan taat kepada-Nya, dan begitu pula para malaikat yang terdekat kepada Allah, yakni malaikatmalaikat yang didekatkan kedudukannya di sisi Allah seperti malaikat jibril, mikail, dan israfil. Dan barang siapa enggan menyembah-Nya dan menyombongkan diri, serta tidak taat kepada perintah-Nya, maka Allah akan mengumpulkan mereka semua, baik yang enggan maupun yang menyombongkan diri, kepada-Nya, kelak di hari kemudian. Setelah dijelaskan bahwa semua orang yang beriman akan dikumpulkan Allah kelak di hari kiamat, pada ayat ini dikemukakan balasan yang dijanjikan kepada orang-orang yang beriman dan siksaan yang pedih bagi orang yang enggan, sombong, dan tidak mau beribadah kepada-Nya. Adapun orang-orang yang beriman dan mengerjakan kebajikan, sebagai bukti bahwa mereka tidak enggan menjadi hamba Allah, maka Allah akan menyempurnakan pahala bagi mereka di akhirat kelak dan menambah sebagian dari karunia-Nya yang tidak terhitung banyaknya. Sedangkan orang-orang yang enggan menyembah Allah, tidak taat kepada perintah-Nya, dan menyombongkan diri dengan mengingkari perintahnya itu, maka Allah akan mengazab mereka dengan azab yang pedih disebabkan kedurhakaan mereka. Dan mereka tidak akan mendapatkan pelindung dan penolong yang dapat meringankan siksa atas mereka selain Allah yang mereka enggan menyembah dan taat kepada-Nya."
  }
]