[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai sekalian manusia,sungguh telah datang kepada kalian petunjuk nyata dari tuhan kalian,yaitu rasul kami Muhammad dan risalah yang dia bawa, yang berisi bukti-btukti kebenaran dan hujjah-hujjah kuat, dan yang paling agung adalah al-qur’an al-karim yang ikut mempersaksiakan kebenaran kenabian dan risalahnya yang merupakan penutup kenabian. Dan kami turunkan kepada kalian al-qur’an sebagai petunjuk dan cahaya yang nyata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "174. Wahai manusia, telah datang kepada kalian dari Rabb kalian suatu bukti yang jelas dan hujah nyata yang dapat menghilangkan alasan dan menepis keragu-raguan -yaitu Muhammad Ṣallallāhu ‘alaihi wa sallam-. Dan Kami menurunkan kepada kalian sinar yang terang benderang, yaitu kitab suci Al-Qur`ān ini."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "174. Setelah hujjah-hujjah itu ditegakkan dan telah menjadi jelas serta syubhat-syubhat telah dipatahkan, maka kemudian Allah menunjukkan kepada seluruh manusia hakikat kebenaran risalah Nabi Muhammad, dan bukti-bukti serta mukjizat-mukjizat yang dibawa olehnya, dan yang paling agung adalah Al-qur'an yang Allah turunkan dengan keagungan, kekuasaan, pengetahuan, dan kebijaksanaan-Nya; dengan al-Qur'an Allah menegakkan hujjahnya dengan mukjizat dan penjelasannya yang indah dan menjelaskan suatu perkara dengan menggabungkan antara kebenaran wahyu dan penggunaan akal sehingga tidak ada seorangpun yang mampu beralasan dan mengatakan tidak mendapatkan penjelasan atau tidak memahaminya. Dan Allah menerangi jalan manusia dengan kandungan hikmah-hikmah, hukum-hukum, dan faidah-faidah yang ada dalam al-Qur'an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "174. يٰٓأَيُّهَا النَّاسُ قَدْ جَآءَكُم بُرْهٰنٌ مِّن رَّبِّكُمْ (Hai manusia, sesungguhnya telah datang kepadamu bukti kebenaran dari Tuhanmu) lewat kitab-kitab yang diturunkan kepada kalian dan lewat rasul-rasul yang telah diutus kepada kalian dan mu’jizat-mu’jizat yang diberikan kepada mereka. وَأَنزَلْنَآ إِلَيْكُمْ نُورًا مُّبِينًا (dan telah Kami turunkan kepadamu cahaya yang terang benderang) Yakni al-Qur’an, dan disebut sebagai cahaya karena ia dijadikan penerang dalam gelapnya kesesatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Al-qur’an adalah perjanjian yang Allah berikan kepada seluruh ummat manusia, maka apakah anda mampu menerima perjanjian itu, dan menyetujui sepenuhnya, atau anda masih ragu degan perjanjian itu ? ya, kamu bisa memilih apa yang menurut hatimu itu baik, tetapi ketahuilah sesungguhnya usia tidak akan menunggu, dan bahwasanya bumi ini terus berputas pada porosnya, sampai kamu bertemu dengan masa yang tidak akan lagi berputar dan berulang, maka bersegeralah sebelum waktu itu tiba tanpa menerima sedikitpun permohonan darimu. 2 ). { وَأَنْزَلْنَا إِلَيْكُمْ نُورًا مُبِينًا } Ayat-ayat yang dengannya bercahayalah hati, wajah, dan jalan menuju Allah. Maka carilah bekas cahaya ini di hatimu dan wajahmu dan di kehidupanmu seluruhnya. 3 ). Setelah meninggalnya Rasulullah datanglah Abu Bakr dan Umar menemui Ummu Aiman dirumahnya, dan ternyata keduanya mendapati beliau tengah menangis, kemudian dua sahabat ini berkata : tidak kah engkau mengetahui bahwa apa yang telah ditetapkan oleh Allah untuk Rasul-Nya adalah kebaikan baginya ? Ummu Aiman kemudian menjawab : tentu, namun yang aku tangisi adalah terputusnya wahyu dari langit!! Perhatikan jawaban yang menakjubkan ini, adakah diantara kaum muslimin yang merasakan hal yang sama, atau justru mereka tidak merasakan apapun dalam hatinya ?!"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "174 Hai manusia sekalian, sesungguhnya telah datang kepadamu berbagai bukti kebenaran berupa mukjizat dan bukti keesaan dari Tuhanmu. Juga dengan diturunkannya kitab-kitab dan para rasul kepada kalian. Juga telah Kami turunkan cahaya yang terang benderang yaitu Al Quran kepadamu sebagai penerang manusia dari gelapnya kesesatan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai manusia sungguh telah sampai kepada kalian bukti kebenaran} dalil yang menunjukkan, yaitu nabi Muhammad SAW {dari Tuhan kalian dan telah Kami turunkan kepada kalian cahaya yang terang} cahaya yang jelas, yaitu Al-Qur’an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "174. Allah telah memberikan karunia kepada seluruh manusia dengan apa yang telah menghantarkan kepada mereka berupa keterangan dan bukti yang nyata serta cahaya yang terang, dan menegakkan hujjah atas mereka, dan menjelaskan kepada mereka syariatNya. Allah berfirman, “Hai manusia, sungguh telah datang kepadamu bukti kebenaran dari Tuhanmu,” yaitu, hujjah-hujjah yang pasti di atas kebenaran, yang menjelaskannya, menerangkannya, dan menjelaskan yang berlawanan dengannya. Ini mencakup seluruh dalil-dalil logika maupun riwayat, dan ayat-ayat (tanda-tanda kekuasaan Allah) berupa semesta maupun di dalam diri manusia. “Kami akan memperlihatkan kepada mereka tanda-tanda (kekuasaan) Kami di segala wilayah bumi dan pada diri mereka sendiri, hingga jelas bagi mereka bahwa Al Quran itu adalah benar. Tiadakah cukup bahwa sesungguhnya Tuhanmu menjadi saksi atas segala sesuatu? “(Fushilat:53) Dan dalam FirmanNya, “Dari Tuhanmu,” terdapat apa yang menunjukkan kepada kemuliaan bukti ini dan keagungannya, yang berasal dari Tuhan kalian yang telah mendidik kalian dengan pendidikan agama maupun dunia, dan di antara didikanNya terhadap kalian yang patut untuk dipuji dan disyukuri adalah menyampaikan keterangan-keterangan kepada kalian agar Allah memberi petunjuk kepada kalian dengannya kepada jalan yang lurus dan sampai kepada surga yang penuh kenikmatan. Dan Allah menurunkan “kepadamu cahaya yang terang benderang,” yaitu al-Quran yang agung ini; yang mencakup ilmu orang-orang terdahulu dan orang-orang yang akan datang, berita-berita yang benar dan bermanfaat, perintah kepada setiap keadilan, kebaikan, dan kebaktian, larangan dari setiap kezhaliman dan kejahatan. Manusia akan berada dalam kegelapan bila mereka tidak meneranginya dengan cahaya-cahaya al-Quran, dan berada dalam kesengsaraan bila tidak mendapatkan kebaikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 174: Maka la akan siksa mereka satu siksaan yang pedih. Dan mereka tidak akan dapat buat (diri) mereka, selain dari Allah, siapapun pengurus dan tidak siapapun penolong."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bukti kebenaran ini mencakup di dalamnya dalil 'aqli, dalil naqli, ayat-ayat yang ada di alam semesta dan pada diri manusia. Di dalamnya terkandung pengetahuan tentang generasi terdahulu dan generasi kemudian, berita-berita benar yang bermanfaat, perintah mengerjakan semua keadilan, ihsan dan kebaikan serta larangan terhadap kezaliman dan keburukan. Manusia berada dalam kegelapan tanpa cahaya Al Qur'an dan berada dalam kebinasaan jika tidak mengambil cahayanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 174",
    "description": "Ayat selanjutnya menegaskan sekali lagi seruan Allah kepada seluruh umat manusia, baik ahli kitab maupun orang-orang yang beriman dari umat nabi Muhammad. Wahai manusia! sesungguhnya telah sampai kepadamu bukti kebenaran yang amat jelas dari tuhanmu, yaitu nabi Muhammad yang diutus Allah disertai bukti kenabian yang amat nyata, dan telah kami turunkan kepadamu cahaya yang terang benderang, yaitu kitab suci Al-Qur'an yang cahaya petunjuknya menerangi umat manusia. Setelah menjelaskan bukti kebenaran dan cahaya petunjuk yang diperuntukkan bagi umat manusia, ayat ini menjelaskan sikap manusia dalam menghadapi bukti kebenaran itu. Adapun orang-orang yang beriman kepada Allah dan berpegang teguh kepada tali Allah, yakni tuntunan agama-Nya yang terhimpun di dalam Al-Qur'an, maka Allah akan memasukkan mereka ke dalam rahmat dan karunia yang besar dari-Nya, yaitu surga, dan memberikan kepadanya bermacam-macam karunia, dan menunjukkan mereka jalan yang lurus dalam kehidupan di dunia dan kelak di akhirat untuk sampai kepada-Nya."
  }
]