[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapaun orang-orang yang beriman kepada Allah dengan keyakianan, ucapan, dan perbuatan,dan berpegang teguh dengan cahaya yang diturunkan kepada mereka, maka Allah akan memasukkan mereka ke dalam surga sebagai bentuk kasih sayang dan karunia dariNYa, dan memberikan taufik kepada mereka untuk menapaki jalan yang lurus yang mengantarkan ketaman-taman surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "175. Adapun orang-orang yang beriman kepada Allah dan berpegang teguh pada Al-Qur`ān yang diturunkan kepada nabi mereka, niscaya Allah akan menyayangi mereka dengan memasukkan mereka ke dalam Surga, menambah ganjaran mereka, menaikkan derajat mereka, dan membimbing mereka untuk mengikuti jalan lurus yang tidak bengkok, yaitu jalan yang mengantarkan mereka ke Surga 'Adn."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "175. Allah berjanji bagi orang-orang yang beriman dan berpegang teguh dengan tali-Nya yang kokoh akan memberinya rahmat yang luas dan karunia yang besar yang tiada batas di akhirat kelak. Dan Allah akan memberinya petunjuk kepada agama Islam syiar-syiar agung yang ada di dalam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "175. فَأَمَّا الَّذِينَ ءَامَنُوا۟ بِاللهِ وَاعْتَصَمُوا۟ بِهِۦ (Adapun orang-orang yang beriman kepada Allah dan berpegang teguh kepadanya) Yakni berpegang teguh kepada Allah, dan pendapat lain mengatakan yakni berpegang teguh kepada cahaya yang telah disebutkan tadi. وَيَهْدِيهِمْ إِلَيْهِ صِرٰطًا مُّسْتَقِيمًا (Dan menunjuki mereka kepada jalan yang lurus (untuk sampai) kepada-Nya) Tanpa ada kebengkokan. Dan ini dilakukan dengna bepegang pada agama Islam dan meninggalkan agama-agama selainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "175 Adapun orang-orang yang beriman kepada Allah dan berpegang teguh kepada agama-Nya serta Al-quran niscaya Allah akan memasukkan mereka ke dalam rahmat yang besar dari-Nya yaitu surga dan limpahan karunia-Nya berupa pahala. Allah juga akan menunjukkan kepada mereka jalan yang lurus tanpa ada bengkokan untuk sampai kepada-Nya yaitu agama Islam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang-orang yang beriman kepada Allah dan berpegang teguh padaNya} berpegang dengan Al-Qur’an {maka Allah akan memasukkan mereka ke dalam rahmat dan karunia dariNya serta menunjukkan mereka jalan} jalan {yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "175. Akan tetapi manusia terbagi menjadi dua bagian menurut keimanan kepada al-Quran dan mengambil manfaat darinya: “Adapun orang-orang yang beriman kepada Allah” yaitu mengakui keberadaanNya, menyifatiNya dengan segala sifat kesempurnaan, menyucikanNya dari segala kekurangan dan aib, “dan berpegang teguh kepada (agama) Nya” yaitu mereka bersandar dan berpegang teguh kepada Allah serta berlepas diri dari daya dan kekuatan mereka dan hanya memohon pertolongan kepada Tuhan mereka, “niscaya Allah akan memasukkan mereka ke dalam rahmat yang besar dariNya (surga) dan limpahan karuniaNya.” Maksudnya, Allah akan melingkupi mereka dengan rahmatNya yang khusus dan membimbing mereka kepada kebaikan, memenuhi mereka dengan ganjaran dan menghindarkan mereka dari cobaan dan musibah, “ dan menunjuki mereka kepada jalan yang lurus (untuk sampai) kepadaNya,” maksudnya, membimbing mereka kepada ilmu dana mal, mengetahui kebenaran dan mengamalkannya. Artinya, dan barangsiapa yang tidak beriman kepada Allah, tidak berpegang teguh kepadaNya, dan tidak mengamalkan kitab-kitabNya, niscaya Allah akan menolak mereka dari rahmatNya, menahan mereka dari limpahan karuniaNya membiarkan mereka dengan diri mereka sendiri, karena mereka tidak mendapat petunjuk , akan tetapi mereka tersesat dengan kesesatan yang nyata, sebagai hukuman buat mereka karena meninggalkan keimanan, hingga mereka memperoleh kesi-siaan dan kerugian. Kita memohon kepada Allah ampunan dan keselamatan serta kesehatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 175: Hai manusia! Sesungguhnya telah datang kepada kamu satu keterangan dari Tuhan kamu, dan Kami telah turunkan kepada kamu satu cahaya yang nyata.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada wujud-Nya dan sifat-sifat-Nya yang sempurna dan menyucikan-Nya dari segala 'aib dan kekurangan. Allah akan memberi mereka taufiq kepada ilmu dan amal; yaitu mengetahui yang hak dan mengamalkannya. Sebaliknya, orang yang tidak beriman kepada Allah, dan tidak berpegang dengan agama-Nya, maka Allah menghalangi mereka dari rahmat dan karunia-Nya, membiarkan mereka mengurus diri mereka sendiri sehingga mereka tersesat dengan kesesatan yang nyata sebagai hukuman dari meninggalkan keimanan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 175",
    "description": "Setelah menjelaskan bukti kebenaran dan cahaya petunjuk yang diperuntukkan bagi umat manusia, ayat ini menjelaskan sikap manusia dalam menghadapi bukti kebenaran itu. Adapun orang-orang yang beriman kepada Allah dan berpegang teguh kepada tali Allah, yakni tuntunan agama-Nya yang terhimpun di dalam Al-Qur'an, maka Allah akan memasukkan mereka ke dalam rahmat dan karunia yang besar dari-Nya, yaitu surga, dan memberikan kepadanya bermacam-macam karunia, dan menunjukkan mereka jalan yang lurus dalam kehidupan di dunia dan kelak di akhirat untuk sampai kepada-Nyapada ayat yang lalu Allah berjanji menuntun umat manusia dan menunjukkan kepada mereka jalan yang membawa kepada kebahagiaan, di dunia dan akhirat. Pada ayat ini dipenuhi sebagian dari janji Allah itu, yaitu berupa jawaban atas pertanyaan yang mereka ajukan. Mereka meminta fatwa kepadamu, nabi Muhammad, tentang kala'lah, yaitu seorang yang mati tidak meninggalkan ayah dan tidak meninggalkan anak. Katakanlah, Allah memberi fatwa kepadamu tentang kala'lah, yaitu jika seseorang mati dan dia tidak mempunyai anak, tetapi mempunyai saudara perempuan, maka bagiannya, yakni bagian dari saudara perempuan itu, adalah seperdua dari harta yang ditinggalkannya, dan saudaranya yang laki-laki mewarisi seluruh harta saudara perempuan, jika saudara perempuan itu mati dan saudara laki-laki itu masih hidup, ketentuan ini berlaku jika dia, saudara perempuan yang mati itu, tidak mempunyai anak. Tetapi jika saudara perempuan yang mewarisi itu berjumlah dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal. Dan jika mereka, ahli waris itu, terdiri atas saudarasaudara laki-laki dan perempuan, maka bagian seorang saudara laki-laki sama dengan bagian dua saudara perempuan. Demikian Allah menerangkan hukum tentang pembagian waris kepadamu, agar kamu tidak sesat, dalam menetapkan pembagian itu. Allah maha mengetahui segala sesuatu yang membawa kebaikan bagimu dan yang menjerumuskan kamu ke dalam kesesatan, maka taatilah segala perintah-Nya dan jauhilah segala larangan-Nya."
  }
]