[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang bertanya kepadamu (wahai rasul), tentang hukum warisan dari kalalah, yaitu orang yang meninggal tanpa meninggalkan seorang anak atau ayah. Katakanlah, ”Allah akan menerangkan hukum kepada kalian tentang itu; yaitu apabila ada seorang lelaki meninggal, tanpa memiliki anak atau ayah, sedangkan dia mempunyai saudara perempuan seayah dan seibu, atau seayah saja, maka baginya setengah dari harta warisan itu. Dan saudara lelaki sekandungnya atau seayah akan mewarisi seluruh harta warisannya, bila wanita itu meninggal dalam keadaan tidak memiliki anak dan ayah. Dan jika orang yang mati dalam keadaan kalalah itu memiliki dua saudara perempuan,maka bagi mereka berdua bagian dua pertiga dari harta yang ditinggalkan. Dan apabila ada saudara-saudara laki-laki bersama saudara-saudara perempuan itu, maka bagi seorang lelaki sebanyak bagian dua perempuan dari saudara-saudara perempuan nya. Allah menjelaskan bagi kalian pembagian harta warisan dan hukum kalalah, supaya kalian tidak tersesat dari jalan kebenaran dalam perkara pembagian warisan. Dan Allah Maha mengetahui kesudahan-kesudahan perkara-perkara dan segala sesuatu yang membawa kebaiakan bagi hamba-hambaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "176. Mereka meminta kepadamu -wahai Rasul- agar kamu memberi mereka fatwa tentang hak waris kalālah yaitu orang yang meninggal dunia tanpa meninggalkan orangtua dan anak. Katakanlah, “Allah menjelaskan ketentuan hukum mengenai hal itu. Yaitu apabila seseorang meninggal dunia sedangkan ia tidak mempunyai orangtua maupun anak, tetapi ia mempunyai seorang saudari kandung atau saudari seayah, maka saudarinya itu mendapatkan hak waris setengah dari harta warisannya secara pasti. Sedangkan saudara laki-lakinya, baik saudara kandung maupun seayah berhak mewarisi harta yang ditinggalkannya secara 'aṣabah (mengambil sisa), jika tidak ada ahli waris lain yang memiliki hak waris secara pasti. Jika ada ahli waris lain yang memiliki hak waris secara pasti, maka ia (saudara laki-laki) berhak mewarisi sisa harta setelah diambil oleh ahli waris yang memiliki hak waris secara pasti tersebut. Apabila saudari sekandung atau seayah itu lebih dari satu orang, mereka berhak mendapatkan hak waris sebesar dua pertiga. Dan apabila saudara kandung atau seayah terdiri dari laki-laki dan perempuan, mereka mewarisinya secara 'aṣabah dengan mengikuti kaidah (seorang laki-laki mendapatkan bagian seperti bagian dua orang perempuan). Artinya saudara laki-laki mendapatkan bagian dua kali lipat dari bagian saudari perempuan. Allah menjelaskan kepada kalian tentang ketentuan hukum dalam masalah kalālah dan ketentuan-ketentuan hukum lainnya yang terkait dengan pembagian harta warisan agar kamu tidak tersesat dalam masalah ini. Dan Allah Maha Mengetahui segala sesuatu. Tidak ada sesuatu pun yang luput dari pengetahuan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "176. Ayat-ayat yang ada pada surat an-Nisa ini ditutup dengan pembukaan hukum-hukum warisan yang disyariatkan oleh Allah sebagai bentuk rahmat dan hidayah bagi hamba-hamba-Nya, dan untuk menjaga hak-hak mereka serta melindungi harta mereka agar sampai kepada orang yang lebih utama untuk menerimanya sesuai dengan syariat Allah yang adil. Para sahabat bertanya kepada Rasulullah tentang seorang lelaki yang meninggal dunia namun tidak memiliki ayah atau anak sebagai ahli waris, akan tetapi dia memiliki saudari kandung atau saudari seibu. Maka Al-qur'an menjelaskan: Bagi seorang saudari setengah dari harta yang ditinggalkan oleh saudaranya. Dan seorang saudara mendapatkan seluruh harta yang ditinggalkan saudarinya jika saudarinya tersebut tidak memiliki anak, sebab seorang saudara mendapatkan bagian ashabah sehingga dia dapat mengambil seluruh sisa harta warisan setelah semua ahli waris menerima bagiannya, atau dapat mengambil seluruh harta warisan jika tidak ada ahli waris yang lain. Namun jika terdapat dua saudari maka bagi mereka dua pertiga dari harta warisan. Dan jika terdapat banyak saudara baik itu laki-laki maupun perempuan maka mereka mendapatkan bagian ashobah, yang laki-laki mendapatkan dua jatah bagian perempuan setelah semua ahli waris menerima bagiannya masing-masing jika terdapat ahli waris lain. Allah Maha Mengetahui segala kemaslahatan bagi seluruh hamba dan negeri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "176. قُلِ اللهُ يُفْتِيكُمْ فِى الْكَلٰلَةِ ۚ (Katakanlah: “Allah memberi fatwa kepadamu tentang kalalah) Penjelasan tentang kalalah telah disebutkan di awal surat an-Nisa: 12. هَلَكَ (meninggal dunia) Yakni yang mati. لَيْسَ لَهُۥ وَلَدٌ(dan ia tidak mempunyai anak) Baik itu laki-laki atau perempuan. Penyebutan anak disini tanpa menyebutkan ayah padahal ketidakpunyaan ayah merupakan termasuk syarat kalalah adalah karena kejelasan hal itu. Wallahu a’lam. وَلَهُۥٓ أُخْتٌ (dan mempunyai saudara perempuan) Dan yang dimaksud disini adalah saudara perempuan kandung atau seayah, bukan seibu; karena bagian saudari seibu adalah seperenam sebagaimana telah disebutkan. وَهُوَ يَرِثُهَآ (dan saudaranya yang laki-laki mempusakai) Yakni saudara laki-laki yang mewarisi saudara perempuannya. إِن لَّمْ يَكُن لَّهَا وَلَدٌ ۚ (jika ia tidak mempunyai anak) Yakni anak laki-laki. Dan saudara laki-laki ini juga tetap mendapat warisan selama masih tersisa harta warisan setelah dibagi. Dan seandainya seorang istri meninggal dan meninggalkan suami maka suami ini mendapat setengah dari harta warisan dan saudara laki-lakinya mendapat sisanya (setengahnya lagi) sebagai ashabah; dan inilah aturan bagi seluruh ashabah, mereka mendapat warisan seluruhnya apabila tidak ada ahli waris lainnya, dan mendapat sisa harta setelah pembagian apabila terdapat ahli waris. فَإِن كَانَتَا اثْنَتَيْنِ (tetapi jika saudara perempuan itu dua orang) Yakni apabila terdapat dua saudara perempuan atau lebih. فَلَهُمَا الثُّلُثَانِ مِمَّا تَرَكَ ۚ (maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal) Apabila ia tidak mempunyai anak sebagaimana telah dijelaskan. وَإِن كَانُوٓا۟ (Dan jika mereka) Yakni pihak-pihak yang mendapat warisan karena hubungan saudara. إِخْوَةً رِّجَالًا وَنِسَآءً(saudara-saudara laki dan perempuan) Yakni terdapat laki-laki dan perempuan. فَلِلذَّكَرِ مِثْلُ حَظِّ الْأُنثَيَيْنِ(maka bahagian seorang saudara laki-laki sebanyak bahagian dua orang saudara perempuan) Yakni dari apa yang mereka dapatkan sebagai ashabah. يُبَيِّنُ اللهُ لَكُمْ أَن تَضِلُّوا۟ ۗ (Allah menerangkan (hukum ini) kepadamu, supaya kamu tidak sesat) Yakni Allah menjelaskan hukum kalalah dan hukum-hukum lainnya karena tidak ingin kalian sesat. Umar bin Khattab berkata: tidak ada suatu masalah yang sering aku tanyakan kepada Rasulullah melebihi masalah tentang kalalah sampai-sampai beliau menusukkan jarinya ke dadaku seraya bersabda: “tidakkah cukup bagimu ayat yang turun di musim panas yang terdapat di akhir surat an-Nisa?” Umar juga berkata: tiga perkara yang sangat aku inginkan, andai Rasulullah menjelaskannya dengan penjelasan yang final (tidak meninggalkan ijtihad setelahnya): masalah (warisan) kakek, kalalah, dan pintu-pintu riba. وَاللهُ بِكُلِّ شَىْءٍ عَلِيمٌۢ( Dan Allah Maha Mengetahui segala sesuatu) Dan termasuk dari itu, Allah mengetahui pembagian harta warisan kalian kepada para kerabat dan suami-istri dengan cara terbaik yang mengandung hikmah yang dalam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "176 Mereka meminta fatwa kepadamu wahai Rasul tentang orang yang mati tanpa orangtua juga tanpa anak. Katakanlah bahwa Allah memberi fatwa kepadamu tentang kalalah, yaitu harta warisan yang tidak mempunyai asal juga tidak mempunyai cabang. Jika ada seseorang meninggal dunia, dan ia tidak mempunyai anak, baik laki-laki maupun perempuan, juga tidak mempunyai orangtua, ini adalah pengertian secara zhahir. Dan dia mempunyai saudara perempuan, kandung seayah – adapun jika saudara perempuan seibu maka baginya seperenam sebagaimana disebutkan maka bagi saudaranya yang perempuan itu seperdua dari harta yang ditinggalkannya, adapun untuk saudara perempuan beserta anaknya maka itu diserikatkan. Dan saudaranya yang laki-laki memegang seluruh harta saudara perempuan jika sang saudara perempuan tidak memiliki anak, namun jika ia tidak mempunyai anak; namun jika saudara perempuan itu mempunyai anak laki-laki maka saudara laki-laki tersebut tidak mendapatkan apapun, dan jika anaknya adalah perempuan maka untuk anak perempuan tersebut adalah setengah harta, dan sisanya untuk saudara laki-laki tersebut sebagai serikat. Tetapi jika saudara perempuan itu dua orang, maka keduanya mendapatkan dua pertiga bagian dari harta yang ditinggalkan oleh saudara laki-laki yang meninggal. Dan jika mereka ahli waris itu terdiri dari saudara-saudara laki dan perempuan, maka bagian seorang saudara laki-laki sebanyak bagian dua orang saudara perempuan. Allah menerangkan hukum kalalah ini kepadamu, supaya kamu tidak sesat dari jalan kebenaran. Dan Allah Maha Mengetahui segala sesuatu yang baik untuk para hamba-Nya. Jabir berkata: ayat tentang kalalah ini turun untukku, ketika aku sakit, dan aku mempunyai tujuh saudara perempuan, kemudian Allah menurunkan ayat: ini. Kemudian Nabi berkata kepadaku: Wahai Jabir, aku sungguh tidak melihat engkau akan meninggal sebab sakitmu ini, sesungguhnya Allah telah menurunkan ayat, segingga urusan ketiga saudara perempuanmu menjadi jelas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka meminta fatwa kepadamu} bertanya kepadamu {Katakanlah, “Allah memberi fatwa kepada kalian tentang kalālah, jika seseorang meninggal} mati {dan dia tidak mempunyai anak, tetapi mempunyai seorang saudara perempuan} saudara kandung atau saudara tiri dari Ayah {maka bagiannya seperdua dari harta yang ditinggalkannya. Adapun saudara laki-lakinya mewarisi itu jika dia tidak mempunyai anak. Akan tetapi jika saudara perempuan itu dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan. Jika mereka beberapa saudara laki-laki dan perempuan, bagian seorang saudara laki-laki sama dengan bagian} bagian {dua orang saudara perempuan. Allah menerangkan kepada kalian agar kalian tidak tersesat} agar kalian tidak tersesat dari kebenaran {Allah Maha Mengetahui segala sesuatu}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "176. Allah mengabarkan bahwa orang-orang meminta ketetapan hukum (fatwa) kepada Rasulullah dalam perkara kalalah, atas dasar Firman Allah, “Katakanlah, ‘Allah memberi fatwa kepadamu tentang kalalah,” yaitu seorang mayit yang meninggal namun tidak memiliki anak kandung, tidak pula cucu dari anak laki-laki, tidak pula ayah dan tidak pula kakek. Untuk itulah Allah berfirman, “JIka seorang meninggal dunia, dan ia tidak mempunyai anak,” yaitu, tidak laki-laki tidak juga perempuan, tidak anak kandung dan tidak pula cucu dari anak laki-laki, demikian juga ia tidak memiliki ayah dengan dalil bahwa ia diwarisi oleh saudara laki-laki maupun saudara perempuan, berdasarkan ijma’ ulama, di mana mereka tidak mendapat warisan dengan adanya ayah. Dan bila seseorang meninggal dan tidak memiliki anak dan tidak pula ayah, “dan mempunyai saudara perempuan,” yaitu yang sekandung atau satu ayah atau satu ibu, sesungguhnya hukumnya telah berlalu. “Maka bagi saudaranya yang perempuan itu seperdua dari harta yang ditinggalkannya,” maksudnya, setengah dari harta peninggalan saudara laki-lakinya berupa uang cash, rumah, perabot, dan sebagainya. Yang demikian itu adalah setelah menunaikan hutang dan wasiat, sebagaimana yang telah berlalu. “Dan saudaranya yang laki-laki” yaitu saudaranya yang laki-laki sekandung atau seayah, “mempusakai (seluruh harta saudara perempuan), jika ia tidak mempunyai anak,” tetapi tidak ditentukan untuknya suatu ketentuan, karena dia adalah ashib (mewarisi sisa) dan ia diwarisi harta tersebut keseluruhannya apabila tidak ada pemilik hak yang tertentu, atau ‘Ashabah lainnya yang bersekutu dengannya, atau apa yang tersisa dari hak-hak yang telah tertentu. “Tetapi jika saudara perempuan itu,” yaitu dua orang saudara perempuan “dua orang” atau lebih, “maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal. Dan jika mereka (ahli waris itu terdiri dari) saudara-saudara laki dan perempuan,” berkumpulnya saudara laki-laki kandung atau seayah bersama saudara perempuan, “maka bagian seorang saudara laki-laki sebanyak bagian dua orang saudara perempuan,” maka gugurlah hak tertentu milik saudara perempuan karena dijadikan ‘Ashabah oleh saudara mereka yang laki-laki. “Allah menerangkan (hukum ini) kepadamu, supaya kamu tidak sesat,” maksudnya, Allah menjelaskan hukum-hukumNya yang kalian butuhkan, Dia menerangkan dan menjelaskannya untuk kalian sebagai limpahan karunia dan kebaikan dariNya agar kalian mendapat petunjuk karena penjelasan tersebut (dan kalian ketahui) hukum-hukumNya, dan agar kalian tidak tersesat dari jalan yang lurus disebabkan karena kebodohan dan ketidaktahuan kalian. “Dan Allah Maha Mengetahui segala sesuatu,” maksudnya, mengetahui yang ghaib, yang Nampak, perkara-perkara yang lampau dan yang akan datang, mengetahui kebutuhan-kebutuhan kalian yang perlu dijelaskan dan diajarkan, lalu Dia mengajarkan ilmuNya kepada kalian yang akan berguna bagi kalian seterusnya pada setiap waktu dan setiap tempat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 176: 176-177. Maka adapun mereka yang beriman kepada Allah dan berpe- gang kepada (Qur'an) itu, Ia akan masukkan mereka di dalam rah- mat dan kurnia daripada-Nya, dan la akan pimpin mereka di jalan lurus yang (menyampaikan mereka) kepada-Nya. Mereka akan berkata kepadamu. Katakanlah: \"Allah beri fatwa kepada kamu di tentang kalalah,(yaitu) jika seorang laki-laki mati (padahal) tidak ada baginya anak, tetapi ada baginya seorang saudara perempuan, maka (saudara perempuan) ini dapat se- paroh dari apa yang ia tinggalkan; dan (saudara laki-laki) itu jadi wa- risnya (pula), jika tidak ada bagi- nya anak, Jika adalah saudara perempuan itu dua orang, maka mereka berdua dapat dua per- tiga dari apa yang ia tinggalkan; dan jika adalah mereka itu laki- laki dan perempuan, maka yang laki-laki dapat bahagian dua perempuan. Allah terangkan bagi kamu supaya kamu tidak sesat, karena Allah amat Mengetahui tiap-tiap suatu,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dari Jabir bin Abdillah ia berkata, \"Saya pernah sakit, lalu Rasulullah shallallahu 'alaihi wa sallam dan Abu Bakar menjengukku dengan berjalan kaki. Ketika itu saya pingsan, lalu Beliau berwudhu' dan menuangkan kepadaku air wudhu'nya, maka saya pun sadar. Saya bertanya, \"Wahai Rasulullah, bagaimana saya menyelesaikan masalah harta saya?\" Beliau tidak menjawab apa-apa hingga turun ayat warisan, \"Yastaftuunaka, qulillahi yuftiikum fil kalaalah…dst.\" Catatan: Telah disebutkan sebelumnya, bahwa ayat, \"Yuushiikumullahu fii awlaadikum\" (An Nisaa': 11) turun berkenaan dengan Jabir, sedangkan ayat di atas, yakni \"Yastaftuunaka…dst.\" turun berkenaan dengan Jabir pula. Al Haafizh Ibnu Katsir rahimahullah merajihkan bahwa ayat, \"Yuushiikumullahu…dst.\" turun berkenaan dengan puteri-puteri Sa'ad bin Rabii', sedangkan ayat, \"Yastaftuunaka..dst.\" turun berkenaan dengan Jabir, karena ia dia memiliki beberapa orang saudari dan tidak memiliki puteri. Kalalah adalah seseorang mati tidak meninggalkan ayah atau kakek dan anak atau cucu. Laki-laki maupun perempuan. Sekandung atau sebapak. Yakni ditinggalkan saudaranya, baik berupa uang, barang tetap (tidak bisa dipindahkan) maupun perabot. Tentunya setelah dibayarkan hutangnya dan ditunaikan wasiat sebagaimana telah diterangkan sebelumnya. Baik sekandung atau sebapak (sebagai 'ashabah). Jika saudara perempuan memiliki anak laki-laki, maka saudara laki-laki tidak mendapatkan apa-apa, atau jika memiliki anak perempuan, maka saudara laki-laki mendapatkan sisa setelah bagian anak perempuan. Namun jika yang menjadi ahli waris adalah saudara perempuan seibu saja atau saudara laki-laki seibu saja, maka bagiannya adalah 1/6 sebagaimana telah diterangkan sebelumnya (lihat An Nisaa': 12) Atau lebih, karena ayat ini turun berkenaan dengan Jabir yang wafat meninggalkan beberapa orang saudari. Tidak seibu. Termasuk di antaranya tentang warisan. Imam Bukhari dan Muslim meriwayatkan, bahwa ayat ini merupakan ayat yang terakhir turun tentang faraa'idh. Hubungan surat An Nisaa' dengan surat Al Maa'idah 1. Surat An Nisaa' menerangkan beberapa macam 'aqad, seperti perkawinan, perceraian, wasiat dan sebagainya. Sedang permulaan surat Al Maa-idah menyatakan agar hamba-hamba Allah memenuhi segala macam 'aqad-'aqad yang telah dilakukan baik terhadap Allah maupun terhadap sesama manusia di samping menerangkan 'aqad-'aqad yang lain. 2. Surat An Nisaa' mengemukakan beberapa hukum secara umum dan mendatangkan jalan untuk menetapkan suatu hukum, kemudian surat Al Maa-idah menjelaskan dan menegaskan hukum-hukum itu. 3. Sebagaimana halnya surat Al Baqarah dan surat Ali 'Imran mengemukakan hal-hal yang berhubungan dengan pokok-pokok agama seperti keesaan Allah dan kenabian, maka surat An Nisaa' dan Al Maa-idah menerangkan tentang furu' agama (hukum fiqh), seperti hal-hal yang berhubungan dengan hukum keluarga dan sebagainya. 4. Akhir surat An Nisaa' mengemukakan hujjah-hujjah atas kekeliruan orang-orang Yahudi dan Nasrani serta kekeliruan kaum musyrik dan munafik. Hal yang serupa diterangkan secara panjang lebar dalam surat Al Maaidah. 5. Surat An Nisaa' dimulai dengan Yaa ayyuhannaas yang nadanya sama dengan nada surat Makkiyyah, sedangkan surat Al Maa-idah sebagai surat Madaniyyah dimulai dengan, Yaa ayyuhal ladziina aamanu. Hal ini menyatakan bahwa meskipun nadanya berlainan, tetapi yang ditujukan oleh kedua surat ini adalah seluruh manusia. 6. Surat An Nisaa' menerangkan beberapa hukum, sedangkan surat Al Maa'idah menyempurnakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 176",
    "description": "Pada ayat yang lalu Allah berjanji menuntun umat manusia dan menunjukkan kepada mereka jalan yang membawa kepada kebahagiaan, di dunia dan akhirat. Pada ayat ini dipenuhi sebagian dari janji Allah itu, yaitu berupa jawaban atas pertanyaan yang mereka ajukan. Mereka meminta fatwa kepadamu, nabi Muhammad, tentang kala'lah, yaitu seorang yang mati tidak meninggalkan ayah dan tidak meninggalkan anak. Katakanlah, Allah memberi fatwa kepadamu tentang kala'lah, yaitu jika seseorang mati dan dia tidak mempunyai anak, tetapi mempunyai saudara perempuan, maka bagiannya, yakni bagian dari saudara perempuan itu, adalah seperdua dari harta yang ditinggalkannya, dan saudaranya yang laki-laki mewarisi seluruh harta saudara perempuan, jika saudara perempuan itu mati dan saudara laki-laki itu masih hidup, ketentuan ini berlaku jika dia, saudara perempuan yang mati itu, tidak mempunyai anak. Tetapi jika saudara perempuan yang mewarisi itu berjumlah dua orang, maka bagi keduanya dua pertiga dari harta yang ditinggalkan oleh yang meninggal. Dan jika mereka, ahli waris itu, terdiri atas saudarasaudara laki-laki dan perempuan, maka bagian seorang saudara laki-laki sama dengan bagian dua saudara perempuan. Demikian Allah menerangkan hukum tentang pembagian waris kepadamu, agar kamu tidak sesat, dalam menetapkan pembagian itu. Allah maha mengetahui segala sesuatu yang membawa kebaikan bagimu dan yang menjerumuskan kamu ke dalam kesesatan, maka taatilah segala perintah-Nya dan jauhilah segala larangan-Nyasurah ini diawali dengan perintah kepada setiap orang yang beriman agar memenuhi janji-janji yang telah diikrarkan, baik janji kepada Allah maupun janji kepada sesama manusia. Wahai orang-orang yang beriman! penuhilah janji-janji, yaitu janji-janji antara manusia dengan Allah, manusia dengan manusia, dan manusia dengan dirinya sendiri, selama janji-janji itu tidak mengharamkan yang halal dan tidak menghalalkan yang haram. Di antara janji Allah itu ialah hukum-hukum-Nya yang ditetapkan kepadamu, yaitu bahwasanya hewan ternak, yaitu unta, sapi, kambing, dihalalkan bagimu sesudah disembelih secara sah, kecuali yang akan disebutkan kepadamu haramnya, yaitu yang disebut pada ayat ketiga dari surat ini, dan juga dengan tidak menghalalkan berburu ketika kamu sedang berihram haji atau umrah. Sesungguhnya Allah menetapkan hukum halal dan haram sesuai dengan yang dia kehendaki, menurut ilmunya dan hikmah-Nya."
  }
]