[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bukanlah penerimaan taubat itu diperuntukan bagi orang-orang yang masih terus melanjutkan berbuat maksiat-maksiat dan tidak kembali kepada tuhan mereka hingga akhirnya datang kepada mereka sakaratul maut, lalu salah seorang dari mereka mengucapkan ”sesungguhnya sekarang saya mau bertauabat,” sebagaimana tidak diterimanya taubat orang-orang yang mati dalam keadaan mengingkari lagi menolak keesaan Allah dan risalah rasulNYA, Muhammad orang-orang yang masih meneruskan perbuatan maksiatnya hingga mati dan orang-orang yang ingkar yang mati dalam keadaan kafir, Kami telah menyediakan bagi mereka siksaan yang pedih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Dan Allah tidak akan menerima taubatnya orang-orang yang mempertahankan kemaksiatannya dan tidak mau bertaubat darinya hingga menghadapi sakratul maut. Dan baru ketika itu ia berkata, “Sungguh, sekarang ini aku bertaubat dari perbuatan maksiat.” Dan Allah juga tidak akan menerima taubat orang-orang yang mati dengan membawa kekafiran. Orang-orang yang gigih mempertahankan kemaksiatan dan orang-orang yang mati dengan membawa kekafiran; Kami akan menyiapkan azab yang pedih bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Allah tidak menerima taubat orang yang terus menerus berbuat maksiat, kemudian saat sakaratul maut mendatanginya ia berkata: “Ya Tuhanku, kini aku bertaubat kepada-Mu.” Dan Allah juga tidak menerima taubat orang yang mati dalam keadaan kafir. Mereka adalah orang-orang yang jauh dari rahmat Allah, Kami telah menyiapkan bagi mereka azab yang pedih. Imam at-Thabari dan Ibnu Abi Hatim mengeluarkan hadist dengan sanad hasan dari Ibnu Abbas, “firman Allah: وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّئَاتِ حَتَّىٰ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ قَالَ إِنِّي تُبْتُ الْآنَ وَلَا الَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ “Dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka, (barulah) ia mengatakan: \"Sesungguhnya saya bertaubat sekarang\". Dan tidak (pula diterima taubat) orang-orang yang mati sedang mereka di dalam kekafiran.” Kemudian Allah menurunkan ayat: إِنَّ اللَّهَ لَا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَٰلِكَ لِمَنْ يَشَاءُ ۚ وَمَنْ يُشْرِكْ بِاللَّهِ فَقَدِ افْتَرَىٰ إِثْمًا عَظِيمًا “Sesungguhnya Allah tidak akan mengampuni dosa syirik, dan Dia mengampuni segala dosa yang selain dari (syirik) itu, bagi siapa yang dikehendaki-Nya.” Allah enggan memberi ampunan bagi orang yang mati dalam keadaan kafir, dan menggantungkan nasib orang-orang yang bertauhid pada kehendak-Nya dan tidak memutus harapan mereka dari ampunan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَلَيْسَتِ التَّوْبَةُ لِلَّذِينَ يَعْمَلُونَ السَّيِّـَٔاتِ حَتَّىٰٓ إِذَا حَضَرَ أَحَدَهُمُ الْمَوْتُ (Dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan (yang) hingga apabila datang ajal kepada seseorang di antara mereka) Yakni ketika dia sudah yakin akan mati dan tidak ada harapan lagi untuk hidup. وَلَا الَّذِينَ يَمُوتُونَ وَهُمْ كُفَّارٌ ۚ (Dan tidak (pula diterima taubat) orang-orang yang mati sedang mereka di dalam kekafiran) Yakni orang-orang yang mati dalam keadaan kafir maka mereka tidak diterima taubatnya, dan meski ia bertaubat maka taubatnya tidak dianggap."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Dan taubat atas kemaksiatan itu diterima oleh Tuhan jika dilakukan ketika sekarat, dimana manusia tahu bahwa dia pasti akan mati atau dia sudah terpatri pada perbuatan maksiat itu. Maka jika dalam keadaan sekarat dia mengucapkan taubatnya: “Sesungguhnya sekarang aku bertaubat” maka itu adalah waktu dimana taubatnya tidak berguna. Begitulah penolakan taubat bagi orang yang mati dalam keadaan kufur. Telah Kami siapkan bagi mereka itu azab yang pedih dan menyakitkan pada hari kiamat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidaklah taubat itu} tidaklah penerimaan taubat itu {bagi orang-orang yang melakukan keburukan} bagi orang-orang yang tetap melakukan kemaksiatan {sehingga apabila datang ajal kepada seorang di antara mereka, dia mengatakan,“Saya benar-benar bertaubat sekarang.” Tidak juga bagi orang-orang yang mati, sementara mereka di dalam keadaan kafir. Mereka itu telah Kami sediakan} Kami menyediakan {azab yang sangat pedih bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17-18. taubat dari Allah terhadap hamba-hambaNya ada dua macam, pertama, taufik darNya untuk melakukan taubat itu sendiri, dan kedua, penerimaanNya akan taubat tersebut setelah dilakukan oleh sang hamba. Disini, Allah mengabarkan bahwa taubat yang hanya berhak dialamatkan kepada Allah adalah haq yang hanya Allah peruntukkan bagi DiriNya sebagai kebaikan dan anugrah dariNya bagi orang yang melakukan perbuatan dosa, yaitu kemaksiatan “lantaran kejahilan” yaitu kebodohan darinya akan akibat perbuatan itu dan konsekuensi kemurkaan dan siksaan Allah terhadapnya, kebodohannya akan pengawasan dan pengamatan Allah terhadap dirinya, kebodohannya akan hasil dari perbuatannya itu berupa berkurangnya atau hilangnya iman darinya, maka setiap pelaku kemaksiatan terhadap Allah adalah jahil dengan kondisi seperti itu walaupun ia mengetahui akan keharamannya, bahkan mengetahui keharamannya sesuatu adalah syarat suatu kemaksiatan yang mendapat hukuman karenanya, ”yang kemudian mereka bertaubat dengan segera” kemungkinan maknanya adalah kemudian mereka bertaubat sebelum menyaksikan kematian, karena Allah menerima taubat seorang hamba apabila ia bertaubat sebelum ada kepastian bahwa ia akan mati dan sebelum ada iksaan secara pasti, sedangkan setelah hadirnya kematian, maka tidaklah akan diterima dari pelaku kemaksiatan suatu taubat pun dan tidak akan diterima pula keimanan dari orang kafir, sebagaimana Allah berfirman tentang fir’aun. ”hingga bila fir’aun itu telah hamper tenggelam, berkatalah dia, ’saya percaya bahwa tidak ada tuhan melainkan rabb yang dipercayai oleh bani israil dan saya termasuk orang-orang yang berserah diri (kepada allah)” “maka tatkala mereka melihat azab kami, mereka berkata kami beriman hanya kepada Allah saja dan kami kafir kepada sembahan-sembahan yang telah kami persekutukan dengan Allah maka iman mereka tiada berguna bagi mereka tatkala mereka telah melihat siksa kami.itulah sunnah Allah yang telah berlaku terhadap hamba-hambaNya.’” Dan Allah berfirman disini, ”dan tidaklah taubat itu diterima Allah dari orang-orang yang mengerjakan kejahatan” yaitu kemaksiatan-kemaksiatan selain kekufuran, ”hingga apabila datang ajal kepada seseorang diantara mereka, (barulah) ia mengatakan, sesungguhnya saya bertaubat sekarang, dan tidak pula (diterima taubatnya) orang-orang yang mati sedang mereka didalam kekafiran bagi orang-orang itu telah kami sediakan siksa yang pedih.” Yang demikian itu karena taubat dalam kondisi seperti itu adalah taubat yang terpaksa yang tidak berguna bagi pelakunya, padahal sesungguhnya yang bermanfaat itu hanyalah taubat pilihan atau kesadaran. Dan kemungkinan juga makna firmanNya ”dengan segera” yaitu segera setelah perbuatan dosa tersebut yang mengharuskan adanya taubat, maka maknanya adalah bahwa barangsiapa yang bersegera dalam menarik diri sejak timbulnya dosa dan berserah diri kepada Allah serta menyesali perbuatan itu maka sesungguhnya Allah akan mengampuni dosanya, berbeda dengan orang yang terus menerus dengan dosanya dan berkelanjutan dengan aib-aibnya itu hingga menjadi sebuah sifat yang menempel pada dirinya, maka sesungguhnya akan sulit baginya untuk bertaubat secara total bahkan biasanya ia tidak mendapatkan taufik taubat dan tidak dimudahkan kepada sebab-sebabnya seperti seseorang yang melakukan perbuatan dosa atas ilmu yang jelas dan keyakinan yang dibarengi dengan sikap meremehkan pengawasan Allah terhadapnya, maka sesungguhnya ia telah menutup pintu rahmat bagi dirinya sendiri. Memang benar bahwa Allah terkadang memberikan taufik kepada hambaNya yang selalu melakukan dosa dan maksiat dengan kesengajaan dan keyakinan menuju taubat yang berguna di mana Allah akan menghapus dengan taubat itu apa-apa yang telah lalu berupa dosa-dosa dan kejahatan-kejahatannya, akan tetapi rahmat dan taufik itu lebih dekat pada orang yang pertama, oleh karena itulah Allah menutup ayat pertama tersebut dengan firmanNya ”Dan Allah Maha Mengetahui Maha Bijaksana” dan diantara ilmu Allah bhawa Dia mengetahui orang yang benar dalam taubat dan orang yang berdusta, dan akan membalas setiap dari kedua orang tersebut sesuai dengan hak keduanya menurut hikmahNYa, dan diantara hikmahNya adalah Allah akan memberikan taufik kepada orang yang hikmah dan rahmatNya menghendaki orang tersebut kepada taubat, dan Allah akan menghinakan orang yang hikmah dan keadilanNya menghendaki tidak memberi taufik kepadanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﺃﻋﺘﺪﻧﺎ} a’tadnaa kami sediakan dan siapkan. {ﺃﻟﻴﻤﺎ} Aliima menyakitkan dengan kepedihan yang sangat. Makna ayat : Kemudian firman Allah {ﻭﻟﻴﺴﺖ اﻟﺘﻮﺑﺔ ﻟﻠﺬﻳﻦ ﻳﻌﻤﻠﻮﻥ اﻟﺴﻴﺌﺎﺕ ﺣﺘﻰ ﺇﺫا ﺣﻀﺮ ﺃﺣﺪﻫﻢ اﻟﻤﻮﺕ ﻗﺎﻝ ﺇﻧﻲ ﺗﺒﺖ datang kepada mereka kemudian berkata ‘aku sungguh bertaubat sekarang’”. Seperti halnya taubat juga tidak diterima oleh Allah dari orang-orang yang hidup dalam kekafirannya, kemudian apabila datang kepada mereka kematian, merkea berkata ‘Aku telah bertaubat.’ seperti Firaun yang tatkala jelas datang kematian kepadanya dengan karamnya اﻵﻥ} “Dan taubat tidak akan diterima oleh Allah dari orang-orang yang jika dia, {ﻗﺎﻝ ﺁﻣﻨﺖ ﺃﻧﻪ ﻻ ﺇﻟﻪ ﺇﻻ اﻟﺬﻱ ﺁﻣﻨﺖ ﺑﻪ ﺑﻨﻮ ﺇﺳﺮاﺋﻴﻞ ﻭﺃﻧﺎ ﻣﻦ اﻟﻤﺴﻠﻤﻴﻦ} “Firaun berkata, ‘Aku beriman bahwa tiada yang berhak disembah kecuali Dzat yang kaum bani Israil beriman kepadanya. Dan aku termasuk orang islam (yang berserah diri)” . Maka Allah menolak taubatnya dan berfirman, {ﺁﻵﻥ ﻭﻗﺪ ﻋﺼﻴﺖ ﻗﺒﻞ ﻭﻛﻨﺖ ﻣﻦ اﻟﻤﻔﺴﺪﻳﻦ} “Sekarang? Sedangkan kau telah durhaka kepada-Ku sebelumnya. Dan kau teramasuk orang-orang yang berbuat kerusakan”. Dan Allah berfirman, {ﺃﻭﻟﺌﻚ ﺃﻋﺘﺪﻧﺎ ﻟﻬﻢ ﻋﺬاﺑﺎ ﺃﻟﻴﻤﺎ} “Merekalah yang kami persiapkan untuknya azab yang pedih” sebagai isyarat kepada setiap orang yang mati tanpa ada taubat saat melangsungkan dosa besar atau kufur dan syirik. Isyarat bahwa seorang mukmin yang bertauhid (mengesakan Allah) akan dikeluarkan dari api neraka karena imannya. Selagi orang kafir kekal di dalam bara neraka. Kita semua berlindung dari api neraka dan kekalutan di dalamnya. Pelajaran dari ayat : • Ditakutkan kepada orang-orang yang menunda-nunda dan menangguhkan taubat akan tidak diterima taubat mereka, jika sudah menemui kematiannya dan mereka tengah bergelimang dosa dan menjadi penduduk neraka. Terkadang mereka bertaubat tetapi jarang dan sedikit dari mereka yang diterima taubatnya. Taubat mereka akan diterima selama belum ada tanda-tanda kematian berdasarkan sabda Rasulullah, “Diterima sebuah taubat selama nyawa belum sampai di tenggorokan” (HR Tirmidzi dan Ahmad dengan sanad hasan) • Tidaklah diterima taubat dari orang yang sudah sakaratul maut atau sudah tampak tanda-tanda kematiannya. Begitupula orang kafir lebih layak untuk tidak diterima taubat masuk Islamnya jika sudah jelas tanda-tanda kematian seperti taubanya Firaun."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 18: Dan taubat itu bukan buat orang-orang yang mengerjakan kejahatan-kejahatan, hingga apabila hadlir maut kepada salah seorang dari mereka, (baru) ia berkata: \"Sesungguhnya aku taubat sekarang\", dan tidak pula buat orang- orang yang mati padahal mereka kafir. Mereka Kami sediakan baginya siksaan yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saat hendak dicabut nyawanya (sekarat). Hal itu, karena tobat dalam kondisi seperti ini merupakan tobat karena terpaksa. Yakni ketika mereka bertobat di akhirat saat menyaksikan azab. Allah Subhaanahu wa Ta'aala berfirman, \" Maka iman mereka tidak berguna bagi mereka ketika mereka telah melihat siksa kami. Itulah sunnah Allah yang telah berlaku terhadap hamba-hamba-Nya. dan di waktu itu binasalah orang-orang kafir.\" (Al Mu'min: 85)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 18",
    "description": "Setelah menjelaskan tobat yang diterima dan batas akhir diterimanya tobat, berikut ini dijelaskan tentang batas akhir waktu penolakan tobat serta dampak dari penolakan itu. Dan tobat yakni pengampunan dosa itu tidaklah diberikan Allah untuk mereka yang melakukan kejahatan atau kedurhakaan secara terus-menerus, silih berganti tanpa penyesalan. Tindakan tersebut dilakukan hingga apabila datang ajal kepada seseorang di antara mereka secara tiba-tiba, dan roh sudah berada di tenggorokan, atau sesaat sebelum keluarnya roh dari jasadnya, barulah dia mengatakan, saya benar-benar bertobat sekarang. Tobat dalam kondisi tersebut pada saat diperlihatkan azab yang akan menimpanya, tidaklah diterima Allah (lihat: surah ga'fir/40: 85). Dan selain itu tidak pula diterima tobat dari orang-orang yang meninggal sedang mereka dalam keadaan kafir, yakni kematiannya membawa serta kekufurannya yang tidak disertai dengan tobat. Bagi orang-orang itu telah kami sediakan azab yang pedih di akhirat dan tidak ada seorang pun yang bisa menghalangi siksaan yang akan ditimpakan kepadanya. Salah satu tradisi pada masa jahiliah adalah apabila seorang pria wafat dan meninggalkan istri, maka keluarga pria itu datang untuk memperistri tanpa memberi mahar. Boleh jadi yang memperistri tersebut adalah anak tiri, mertua atau ipar wanita tersebut. Mereka memperlakukan istri dari laki-laki yang meninggal tersebut sesuai keinginan mereka tanpa memberikan hak apalagi menaruh belas kasihan, lalu turunlah ayat ini. Wahai orang-orang beriman! tidak halal, yakni tidak dibenarkan dengan alasan apa pun, bagi kamu, laki-laki, berlaku seperti kelakuan orang-orang yang tidak beriman yaitu mewarisi harta atau diri perempuan dengan dipaksa atau tidak boleh menikah dengan laki-laki lain. Dan janganlah kamu, wahai suami, apabila telah menceraikan istri-istri kamu, menyusahkan, yakni menghalangi, mereka menikah dengan laki-laki lain. Tindakan itu kamu lakukan karena hendak mengambil kembali secara paksa sebagian dari apa saja yang telah kamu berikan kepadanya baik mahar, atau pemberian lainnya, kecuali apabila mereka sudah terbukti melakukan perbuatan keji yang nyata seperti nusyuz atau berzina, maka kamu boleh memaksa mereka menebus diri dengan mengembalikan maskawin yang telah kamu berikan, sebagai pelajaran bagi mereka. Dan bergaullah, wahai suami, dengan mereka menurut cara yang patut dan penuh kasih sayang sesuai ketentuan agama. Jika kamu tidak menyukai mereka lantaran adanya kekurangan pada diri mereka, maka bersabarlah terhadap segala kekurangan atau keterbatasan mereka. Karena boleh jadi kamu tidak menyukai sesuatu pada dirinya, padahal Allah ingin menjadikan dalam ikatan perkawinan bersamanya itu suatu kebaikan yang banyak padanya di kemudian hari. Karena, di balik kesabaran tersebut tentu ada hikmah yang banyak."
  }
]