[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berikanlah kepada anak-anak yang telah ditinggal mati oleh ayah-ayah mereka sebelum usia baligh, (sedang kalian berstatus sebagai penerima wasiat), harta-harta mereka ketika mereka telah mencapai usia baligh, dan kalian telah dapat melihat dari mereka adanya kemampuan untuk menjaga harta mereka. Dan janganlah kalian mengambil barang yang baik harta mereka dan menukar harta tersebut dengan barang buruk dari harta kalian. Dan janganlah kalian mencampuradukan antara harta mereka dengan harta milik kalian denga tujuan supaya kalian bias mencari alasan untuk bias memakan harta mereka dengan itu. Sesungguhnya orang yang lancang melakukannya, sungguh dia telah mengerjakan dosa yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan serahkanlah -wahai para pengasuh- harta anak-anak yatim (yaitu anak yang kehilangan ayahnya dan belum balig) secara lengkap apabila mereka telah balig dan dewasa. Dan janganlah kalian mengganti yang halal dengan yang haram. Yaitu mengambil yang baik dan berharga dari harta anak-anak yatim tersebut dan menggantinya dengan yang jelek lagi murah dari harta kalian. Dan janganlah kalian mengambil harta anak-anak yatim lalu digabungkan dengan harta kalian. Sesungguhnya hal itu adalah dosa besar di sisi Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Allah memerintahkan para pengasuh anak-anak yatim -yaitu anak-anak yang ditinggal mati ayah mereka sebelum usia baligh- agar menyerahkan harta mereka ketika mereka telah mencapai usia baligh, dan melarang para pengasuh tersebut dari mengambil harta terbaik anak-anak yatim itu dan menyisakan harta mereka yang tak berharga. Allah juga melarang mereka dari mencampur harta mereka dengan harta anak-anak yatim dengan maksud mencaplok harta mereka; Allah memperingatkan dari perbuatan ini karena mengandung dosa besar yang dapat menyebabkan mereka mendapat siksaan. Syeikh as-Syinqithi berkata, dalam firman Allah: “dan jangan kamu makan harta mereka bersama hartamu. Sesungguhnya tindakan-tindakan (menukar dan memakan) itu, adalah dosa yang besar” dijelaskan bahwa memakan harta anak yatim merupakan dosa besar, namun Allah tidak menjelaskan seberapa besar dosa tersebut. Akan tetapi Allah menjelaskan hal ini dalam ayat lain, yaitu dalam firman-Nya: “Sesungguhnya orang-orang yang memakan harta anak yatim secara zalim, sebenarnya mereka itu menelan api sepenuh perutnya dan mereka akan masuk ke dalam api yang menyala-nyala (neraka).” (an-Nisa: 10)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَءَاتُوا۟ الْيَتٰمَىٰٓ أَمْوٰلَهُمْ ۖ (Dan berikanlah kepada anak-anak yatim (yang sudah balig) harta mereka) Ini adalah kalimat yang ditujukan bagi para wali dan orang yang diwasiati. Dan makna yatim adalah anak yang tidak mempunyai bapak dan belum mencapai usia baligh. Dan anak-anak yatim tidak diserahi harta mereka sampai hilang sebutan yatim mereka dengan mencapai usia baligh. وَلَا تَتَبَدَّلُوا۟ الْخَبِيثَ بِالطَّيِّبِ ۖ (jangan kamu menukar yang baik dengan yang buruk) Allah melarang para wali untuk berbuat apa yang biasa dilakukan di masa jahiliyah pada harta anak yatim, mereka mengambil harta yang baik milik anak yatim kemudian menukarkannya dengan harta mereka yang buruk. Dan pendapat lain mengatakan maknanya adalah janganlah kalian memakan harta anak yatim karena itu haram dan buruk bagi kalian kemudian kalian meninggalkan harta kalian yang baik bagi kalian. وَلَا تَأْكُلُوٓا۟ أَمْوٰلَهُمْ(dan jangan kamu makan harta mereka) Yakni dengan memasukkannya ke dalam harta kalian. حُوبًا (dosa) Yakni dosa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Wahai para wali berikanlah kepada anak-anak yatim itu harta mereka ketika telah dewasa. Yatim adalah orang yang kehilangan ayahnya sebelum dewasa. Dan janganlah kalian mengambil harta anak yatim dan meletakkannya pada tempat yang buruk, yaitu dicampur dengan harta kalian. Dan janganlah kalian ambil harta mereka, untuk kalian tambahkan pada harta kalian. Sesungguhnya perbuatan tersebut adalah dosa yang amat agung. Ayat ini turun untuk leki-laki dari Bani Ghatfan yang menjaga harta keponakannya. Ketika keponakannya sudah besar dan meminta harta tersebut, pamannya tersebut mencegahnya. Lalu keduanya meminta keadilan kepada Nabi SAW , lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berilah} berilah {anak-anak yatim harta mereka. Janganlah kalian menukar yang baik dengan yang buruk} janganlah kalian menukar yang baik dari harta anak yatim dengan yang buruk dari harta kalian {dan janganlah kalian makan harta mereka bersama harta kalian.} Janganlah kalian harta anak yatim yang terkandung dalam harta kalian Sesungguhnya itu adalah dosa yang besar} dosa yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. ini merupakan wasiat pertama dari hak-hak makhluk dalam surat ini, mereka itu adalah anak-anak yatim yang telah ditinggal mati oleh ayah yang menafkahi mereka, sedang mereka masih kecil dan lemah, mereka tidak mampu memenuhi kemaslahatan mereka sendiri. Karena itu Allah yang Maha Penyayang lagi Maha Pengasih memerintahkan hamba-hambaNya agar berbuat baik kepada mereka dan agar tidak mendekati harta-harta mereka kecuali dengan cara yang baik. Dan agar memberikan kepada mereka harta-harta mereka apabila mereka telah baligh dan dewasa secara sempurna dan penuh, dan agar tidak menukar dengan yang buruk, dimana itu termasuk memakan harta anak yatim tanpa hak, ”yang baik”yaitu, yang halal yang tidak ada dosa padanya dan tidak pula tanggung jawab. “Dan jangan kamu makan harta mereka bersama hartamu.” maksudnya bersama harta kalian. Disini terdapat suatu peringatan akan buruknya memakan harta mereka dengan cara seperti itu, yang kemungkinan seseorang mampu untuk tidak melakukannya, (dan cukup) dengan apa yang telah Allah rizkikan untuknya dari hartanya sendiri. Maka barangsiapa yang berani melakukan hal itu, sesungguhnya ia telah melakukan “dosa yang besar” yaitu dosa dan kesalahan yang besar. Dan termasuk menukar yang buruk dengan yang baik adalah seorang wali mengambil harta anak yatim yang berharga dan menukarnya dengan hartanya yang paling jelek. Ayat ini juga menunjukan adanya perwakilan terhadap seorang yatim, karena diantara wajibnya memberikan harta anak yatim, adalah ketetapan perwalian orang yang mengelola hartanya, Demikian juga ayat ini menunjukan perintah untuk mengurus harta anak yatim secara baik, karena kesempurnaan pemberian hartanya kepadanya adalah penjagaan dan pemenuhannya dengan cara yang baik untunya, mengembangkannya, serta tidak menempatkannya pada hal-hal yang dikhawatirkan dan berbahaya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: اﻟﻴﺘﺎﻣﻰ Yatama bentuk jamak dari يتيم yatim baik itu putra ataupun putri, yaitu anak belum akil balig yang ayahnya telah meninggal. {ﻭﻻ ﺗﺘﺒﺪﻟﻮا اﻟﺨﺒﻴﺚ ﺑﺎﻟﻄﻴﺐ} wala tatabadalul khobitsa bith thoyyib. Alkhobitsa: Haram, Ath thoyyib: halal. Maksudnya di sini adalah: baik dan buruk. {ﺣﻮﺑﺎ ﻛﺒﻴﺮا} Huban Kabiron. Al Hub: dosa besar Makna Ayat: Tatakala Allah memerintahkan untuk menyambung silaturahmi dan melarang untuk memutusnya pada ayat sebelumnya, Dia memerintahkan pula kepada para wali anak-anak yatim agar memberikan kepada anak-anak yatim harta mereka jika sudah mencapai umur rusyd (balig) dan jika para wali sudah melihat kedewasaan pada mereka. Dan Allah berfirman {ﻭﺁﺗﻮا اﻟﻴﺘﺎﻣﻰ ﺃﻣﻮاﻟﻬﻢ} “Dan berikanlah kepada para yatim harta-harta mreka.” Dan Allah melarang mereka dari menukarkan harta para yatim yang baik dengan harta mereka yang buruk. {ﻭﻻ ﺗﺘﺒﺪﻟﻮا اﻟﺨﺒﻴﺚ} “Jangan tukarkan dengan yang buruk” yaitu yang baik dari harta mereka ditukar dengan yang buruk dari harta kalian. Yang mana hal itu adalah hal yang menyakitkan anak yatim pada harta mereka. Dan larangan untuk memakan harta anak yatim bercampur dengan harta mereka karena hal itu adalah makan harta anak yatim tanpa hak, Allah berfirman {ﻭﻻ ﺗﺄﻛﻠﻮا ﺃﻣﻮاﻟﻬﻢ ﺇﻟﻰ ﺃﻣﻮاﻟﻜﻢ} “dan janganlah kalian makan harta mereka dalam harta kalian” serta menyebutkan hal itu termasuk dalam dosa besar. Allah berfirman, {ﺇﻧﻪ ﻛﺎﻥ ﺣﻮﺑﺎ ﻛﺒﻴﺮا } “sejatinya yang demikian (memakan harta mereka) adalah dosa yang besar”, Al Hub artinya dosa. Ini adalah makna dari ayat yang pertama, {ﻭﺁﺗﻮا اﻟﻴﺘﺎﻣﻰ ﺃﻣﻮاﻟﻬﻢ ﻭﻻ ﺗﺘﺒﺪﻟﻮا اﻟﺨﺒﻴﺚ ﺑﺎﻟﻄﻴﺐ ﻭﻻ ﺗﺄﻛﻠﻮا ﺃﻣﻮاﻟﻬﻢ ﺇﻟﻰ ﺃﻣﻮاﻟﻜﻢ ﺇﻧﻪ ﻛﺎﻥ ﺣﻮﺑﺎ ﻛﺒﻴﺮا} Petunjuk dari Ayat: • Setiap harta yang haram adalah kotor dan setiap harta yang halal adalah baik. • Tidaklah halal bagi seseorang untuk menukarkan harta yang bagus seorang yatim dengan hartanya yang buruk, semisal mengambil kambing gemuk dari seorang yatim ditukar dengan kambing yang kerempeng atau mengambil kurma yang apik diganti dengan yang buruk lagi busuk. • Tidaklah halal mencampur harta yatim dan harta si pengasuh kemudian dimakan bersama-sama karena harta anak yatim adalah sebuah kezaliman."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 2: Dan berikanlah kepada anak- anak yatim itu harta-harta mereka, dan janganlah kamu menukar sesuatu yang jelek dengan yang baik, dan janganlah kamu makan harta-harta mereka ke harta-harta kamu, karena sesungguhnya yang demikian itu adalah dosa yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan dengan seorang anak yatim yang meminta harta kepada walinya, namun walinya enggan memberikan. Ayat ini merupakan wasiat pertama yang terkait dengan hak orang lain, terutama anak yatim yang ditinggal wafat bapaknya saat mereka masih kecil, lemah dan tidak ada orang yang menanggung mereka, maka Allah Subhaanahu wa Ta'aala Yang Maha Pengasih lagi Maha Penyayang memerintahkan hamba-hamba-Nya berbuat ihsan kepada mereka, tidak mendekati harta mereka kecuali dengan cara yang baik serta memberikan harta mereka secara sempurna saat mereka telah baligh dan cerdas. Misalnya menukar harta anak yatim yang bagus dengan harta milik wali yang jelek atau si wali mengambil harta anak yatim yang berharga lalu menukarnya dengan hartanya yang murah. Yakni mencampurnya dengan maksud agar dapat memakan harta mereka. Hal ini merupakan helat (cari-cari jalan untuk menghalalkan yang haram). Dalam ayat ini terdapat dalil adanya kewalian terhadap anak yatim. Di dalamnya juga terdapat perintah mengurus hartanya dengan baik, memeliharanya, mengembangkannya dan menjaganya dari bahaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 2",
    "description": "Ayat berikut ini menjelaskan siapa yang harus dipelihara hak-haknya dalam rangka bertakwa kepada Allah. Dan berikanlah, wahai para wali atau orang yang diberi wasiat mengurus, kepada anak-anak yatim yang sudah dewasa lagi cerdas untuk mengelola harta mereka sendiri yang ada di dalam kekuasaanmu, dan janganlah kamu menukar harta anak yatim yang baik, lalu karena ketamakan kamu mengambil atau menukar harta mereka. Tindakan itu sama halnya menukar yang baik dengan yang buruk. Dan demikian pula, janganlah kamu makan harta mereka bersama hartamu dengan ikut memanfaatkan harta mereka demi kepentingan diri sendiri. Sungguh, tindakan menukar dan memakan itu adalah dosa yang besar. Jika kamu melakukan hal itu, kamu akan mendapat laknat dan murka dari Allah diriwayatkan dari aisyah bahwa ayat ini turun berkaitan dengan anak yatim yang berada dalam pemeliharaan seorang wali, di mana hartanya bergabung dengan harta wali dan sang wali tertarik dengan kecantikan dan harta anak yatim itu, maka ia ingin mengawininya tanpa memberinya mahar yang sesuai, lalu turunlah ayat ini. Dan jika kamu khawatir tidak akan mampu berlaku adil terhadap hak-hak perempuan yatim yang berada di bawah kekuasaanmu, lantaran muncul keinginan kamu untuk tidak memberinya mahar yang sesuai bilamana kamu ingin menikahinya, maka urungkan niatmu untuk menikahinya, kemudian nikahilah perempuan merdeka lain yang kamu senangi dengan ketentuan batasan dua, tiga, atau empat orang perempuan saja. Tetapi jika kamu khawatir tidak akan mampu berlaku adil apabila menikahi lebih dari satu perempuan dalam hal memberikan nafkah, tempat tinggal, atau kebutuhan-kebutuhan lainnya, maka nikahilah seorang perempuan saja yang kamu sukai atau hamba sahaya perempuan yang kamu miliki dari para tawanan perang. Yang demikian itu lebih dekat pada keadilan agar kamu tidak berbuat zalim terhadap keluarga. Karena dengan berpoligami banyak beban keluarga yang harus ditanggung, sehingga kondisi seperti itu dapat mendorong seseorang berbuat curang, bohong, bahkan zalim."
  }
]