[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian menginginkan mengganti istri dengan wanita lainnya, dan kalian telah memberikan kepada istri yang hendak kalian ceraikan harta yang banyak sebagai maskawin baginya, maka tidak halal bagi kalian untuk mengambil dari maskawin tersebut sedikitpun. Apakah kalian akan tetap mengambilnya dengan jalan dusta dan mengada-ada yang nyata?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Dan jika kalian -wahai para suami- ingin menceraikan istri kalian dan menggantinya dengan yang lain, tidak ada dosa bagi kalian. Dan apabila kalian telah memberikan harta yang banyak sebagai mahar bagi istri kalian yang hendak kalian ceraikan itu, maka kalian tidak boleh mengambilnya kembali sedikit pun, karena mengambil kembali harta yang telah kalian berikan kepada istri kalian itu merupakan suatu kesewenang-wenangan dan dosa yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Jika kalian hendak menikahi wanita lain sebagai ganti dari wanita yang telah kalian ceraikan, sedangkan kalian telah memberikan mahar yang besar kepada wanita yang kalian cerai, maka tidak halal bagi kalian mengambil mahar itu sedikitpun. Apakah kalian akan mengambilnya dengan penuh kebohongan dan kedustaan yang jelas?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَءَاتَيْتُمْ إِحْدَىٰهُنَّ (sedang kamu telah memberikan kepada seseorang di antara mereka) Yakni berupa mahar atau hadiah. قِنطَارًا (harta yang banyak) Yakni ukuran seratus Rathl (sekitar 3,81 kg emas menurut madzhab Syafi’i). فَلَا تَأْخُذُوا۟ مِنْهُ شَيْـًٔا ۚ (maka janganlah kamu mengambil kembali dari padanya barang sedikitpun) Yakni apabila seorang suami mentalak istrinya karena kebancian suami tersebut terhadapnya dan bukan karena perbuatan keji yang istri lakukan -sebagaimana telah dijelaskan- maka tidak halal bagi suami untuk mengambil apa yang telah ia berikan kepadanya sedikitpun. أَتَأْخُذُونَهُۥ بُهْتٰنًا وَإِثْمًا مُّبِينًا(Apakah kamu akan mengambilnya kembali dengan jalan tuduhan yang dusta dan dengan (menanggung) dosa yang nyata?) Yakni mengambilnya dengan jalan yang tidak benar sehingga itu menjadi kezaliman dan hal yang haram."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Jika kalian menghendaki mengganti istri dengan menalak istri kalian dan menikahi wanita lainnya, lalu kalian memberi salah satu dari keduanya itu mahar yang banyak seperti sebongkah emas, yaitu harta yang sangat banyak, maka kalian tidak boleh mengambil barang yang telah kalian berikan itu, ataukah kamu akan mengambilnya dengan cara yang zalim, yaitu tidak benar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian ingin mengganti istri dengan istri yang lain} menceraikan istri dan menikahi yang lain {sedangkan kalian telah memberikan kepada salah seorang di antara mereka} salah satu istri {harta yang banyak} harta yang banyak sebagai mahar untuknya {janganlah kalian mengambilnya kembali sedikit pun. Apakah kalian akan mengambilnya kembali dengan cara dusta} dengan cara mengada-ada dan zalim {dan dosa yang nyata} nyata"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Ini semua dengan kondisi yang memungkinkan baginya untuk tetap bersama dan tidak adanya perkara yang diharamkan namun bila harus berpisah dan tidak mungkin untuk bersama lagi, maka tidaklah wajib untuk bertahan bersama, akan tetapi ketika “kamu ingin mengganti istrimu dengan istri yang lain” yaitu mentalak seorang istri dan menikahi wanita yang lain, artinya tidak ada dosa bagi kalian dalam hal tersebut dan tidak ada salahnya, akan tetapi bila “telah memberikan kepada seseorang diantara mereka” yaitu yang kalian talak atau yang kalian nikahi, ”harta yang banyak” yaitu harta yang banyak, ”maka janganlah kamu mengambil kembali dari padanya barang sedikitpun“ akan tetapi kalian harus membiarkan itu semua untuknya dan janganlah kalian mengungkit-ngunkitnya. Ayat ini menunjukan bahwa tidaklah haram memberikan mahar yang besar walaupun sesunggguhnya lebih baik dan lebih utama adalah mencontoh nabi dalam meringankan mahar. Dan hal itu dapat dipahami dari ayat ini bahwa Allah mengabarkan tentang suatu perkara yang terjadi pada mereka namun tidak mengingkari mereka akan hal tersebut, dengan demikian hal itu menunjukan bahwa perkara tersebut tidaklah haram hukumnya. Akan tetapi mahar yang besar dapat saja dilarang apabila mengandung kemudharatan dalam agama dan tidak ada mashlaat yang sepadan, kemudian Allah berfirman ”apakah kamu akan mengambilnya kembali dengan jalan tuduhan yang dusta dan dengan (menanggung) dosa yang nyata?” karena sesungguhnya hal tersebut tidaklah halal, walaupun kalian melakukan tipu daya dengan berbagi trik, sesungguhnya dosanya telah jelas."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻗﻨﻄﺎﺭا} Qinthoron: Mahar dari emas atau dari perak {ﺑﻬﺘﺎﻧﺎ ﻭﺇﺛﻤﺎ} Buhtanan wa itsman: dusta dan dibuat-buat, dosa yang haram tiada keraguan atas keharamannya, karena itu adalah perbuatan zalim. Makna ayat : Haramnya mengambil bagian dari mahar seorang wanita jika telah diceraikan oleh suaminya jika sang istri tidak berbuat zina ataupun nuzusy. Tapi karena sang suami hanya sekedar ingin menceraikan sang istri untuk menikah dengan selainnya. Dalam hal ini, tidak halal bagi sang suami untuk berbuat yang menyebabkan mudhorot kepada sang istri agar sang suami mendapatkan sesuatu dari mahar istrinya walaupun hanya sedikit. Walaupun sang suami telah memberikan sang istri ratusan kilogram emas dan mengambil sepeser maharnya apalagi mengambil satu dinar emas atau satu keping dirham dari sang istri. Ini adalah makna firman Allah : {ﻭﺇﻥ ﺃﺭﺩﺗﻢ اﺳﺘﺒﺪاﻝ ﺯﻭﺝ ﻣﻜﺎﻥ ﺯﻭﺝ ﻭﺁﺗﻴﺘﻢ ﺇﺣﺪاﻫﻦ ﻗﻨﻄﺎﺭا1 ﻓﻼ ﺗﺄﺧﺬﻭا ﻣﻨﻪ ﺷﻴﺌﺎﺗﺄﺧﺬﻭﻧﻪ ﺑﻬﺘﺎﻧﺎ} “jika kalian ingin menggantikan posisi salah satu istrimu dengan wanita yang lain dan kalian telah memberikannya emas yang banyak, maka janganlah kalian mengambil darinya sepeserpun. Apakah kalian akan mengambil secara dusta” maksudnya adalah secara zalim tanpa hak, dusta, dibuat-buat dan dengan dosa besar. Pelajaran dari ayat : • Dibolehkannya mengambil tebusan dari sang istri jikalau sang istri itu melakukan nusyuz dan zina yang jelas dan tidak diragukan lagi. • Diperbolehkan menaikkan mahar, terkadang mencapai sebesar qinthor (900 kg) meskipun mahar yang mudah terdapat lebih banyak berkah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 20: Dan jika kamu mau menukar seorang isteri di tempat seorang isteri, padahal kamu telah beri kepada salah seorang daripada mereka beberapa banyak harta, maka janganlah kamu ambil daripadanya, walaupun sedikit. Apakah (patut) kamu mau ambil (pemberian) itu dengan cara yang mengagetkan dan dosa yang terang?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya ialah menceraikan istri yang tidak disenangi dan menikah dengan istri yang baru, maka tidak mengapa. Baik wanita yang dicerai maupun wanita yang baru dinikahi. Sebagai mahar. Dalam ayat ini terdapat dalil bolehnya mahar dengan harta yang banyak, hanya saja yang lebih utama dan lebih patut adalah mengikuti anjuran Nabi shallallahu 'alaihi wa sallam yang memerintahkan untuk meringankan mahar. Namun bisa saja menjadi terlarang, yaitu ketika menetapkan mahar yang banyak dapat mengakibatkan mafsadat agama dan tidak ada maslahatnya. Yakni berikanlah secara sempurna dan jangan ditunda-tunda. Sesungguhnya mengambilnya adalah haram, meskipun kamu mencari cara untuk melegalkannya karena dosanya begitu jelas. Hal itu, karena istri sebelum akad nikah itu haram bagi suaminya, dan istri tidak ridha menghalalkan dirinya kecuali dengan mahar tersebut. Lalu bagaimana mahar yang sudah menjadi miliknya diambil, padahal dirinya dihalalkan karenanya. Di samping itu, Allah Subhaanahu wa Ta'aala juga telah mengambil perjanjian yang kokoh dengan adanya 'akad dan kesiapan menanggung kewajibannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 20",
    "description": "Dan jika kamu, wahai para suami, ingin mengganti istrimu dengan menceraikannya dan setelah menceraikannya kemudian kamu menikah dengan istri yang lain yang kamu sukai sedang kamu telah memberikan kepada seorang di antara mereka harta yang banyak sebagai mahar untuk mereka yang telah kamu ceraikan itu, maka janganlah kamu mengambil kembali walau sedikit pun pemberian itu darinya karena mahar yang telah kamu berikan itu sudah menjadi miliknya. Apakah kamu akan mengambilnya kembali harta kekayaan yang kamu jadikan mahar itu dengan jalan tuduhan yang dusta dan dengan menanggung dosa yang nyata' mengambil atau meminta kembali mahar yang telah diberikan kepada mereka adalah termasuk perbuatan zalim yang dimurkai Allah dan lantas bagaimana mungkin kamu akan mengambilnya kembali, yakni mahar atau pemberian yang telah kamu berikan kepada mereka, dengan cara paksa dan sewenang-wenang, padahal kamu telah bergaul satu sama lain sebagai suami-istri dengan menyalurkan hasrat biologis bersamanya' dan mereka telah mengambil perjanjian yang kuat dalam ikatan perkawinan sehingga menjadi pasangan istri dari kamu, ikatan perkawinan tersebut merupakan ikatan suci yang harus dijaga sehingga siapa saja yang memutus ikatan suci itu mendapat murka Allah. Nabi berpesan, bertakwalah kepada Allah dalam urusan wanita. Sesungguhnya kalian telah mengambil mereka sebagai amanat Allah dan menghalalkan kemaluan mereka dengan kalimat Allah."
  }
]