[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bagaimana bisa halal bagi kalian,untuk mengambil apa yang telah kalian serahkan kepada mereka dari maskawin, sedang masing-masing dari kalian berdua telah saling menikmati melalui hubungan badan dan merekapun telah mengambil dari kalian perjanjian yang kuat, untuk mempertahankan mereka dengan cara baik-baik atau melepas mereka dengan cara baik-baik pula."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Bagaimana mungkin kalian mengambil kembali mahar yang telah kalian berikan kepada istri kalian setelah apa yang terjadi di antara kalian. Seperti hubungan suami-isteri, cinta kasih, saling menikmati, dan mengetahui rahasia masing-masing. Sesungguhnya keinginan untuk mendapatkan harta yang ada di tangan istri setelah semua itu adalah sesuatu yang buruk dan menjijikkan. Sementara istri kalian telah mengambil perjanjian yang sangat kuat dari kalian, yaitu dirinya menjadi halal bagi kalian dengan kalimat Allah -Ta'ālā- dan syari’at-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Allah mengingkari orang yang meminta kembali mahar yang telah ia berikan: Bagaimana kalian akan mengambilnya kembali, setelah kalian saling menikmati dan telah mengambil janji yang teguh dalam akad pernikahan yang mengandung pasal hak-hak pernikahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَكَيْفَ تَأْخُذُونَهُۥ (Bagaimana kamu akan mengambilnya kembali) Ini adalah bentuk pengingkaran setelah pengingkaran sebelumnya. وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ(padahal sebagian kamu telah bergaul (bercampur) dengan yang lain sebagai suami-isteri) Ibnu Abbas berkata: yakni berjima’ وَأَخَذْنَ مِنكُم مِّيثٰقًا غَلِيظًا(Dan mereka (isteri-isterimu) telah mengambil dari kamu perjanjian yang kuat) Yakni dengan akad nikah, Apabila seorang suami menggauli istrinya atau berdua dengannya setelah akad maka istrinya berhak atasnya mahar penuh, dan diharamkan baginya untuk mengambilnya saat mentalak istrinya kecuali apabila istrinya melakukan perbuatan zina sebagaimana telah dijelaskan, dan kecuali apabila istrinya merelakan mahar itu maka itu menjadi halal bagi suami."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Bagaimana bisa kalian diperbolehkan mengambil mahar itu, sedangkan kalian telah berjima’, berkumpul dalam satu tempat, dan bergaul. Dan wanita itu telah mengambil janji yang melekat dari kalian ketika akad nikah agar menjaganya atau melepasnya dengan baik, sehingga mengambil mahar itu diharamkan kecuali melakukannya karena zina atau istrinya berbuat maksiat kepada suaminya, menurut mazhab Imam Malik dan lainnya. Hal itu juga disebutkan oleh Ibnu ‘Athiyah dalam tafsirnya (3/544)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagaimana kalian akan mengambilnya, padahal kalian telah menggauli satu sama lain} kalian telah melakukan jima’ {dan mereka pun telah membuat perjanjian yang kuat dengan kalian} janji yang kuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Sesungguhnya Allah telah menjelaskan hikmah akan hal tersebut dengan firmanNya ”bagaimana kamu akan mengambil kembali, padahal sebagian kamu telah bergaul(bercampur) dengan yang lain sebagai suami istri. Dan mereka (istri-istrimu) telah mengambil dari kamu perjanjian yang kuat” penjelasannya adalah bahwa istri sebelum akad nikah adalh haram bagi suami, dan tidaklah ia merelakan dirinya agar halal baginya kecuali dengan mahar tersebut yang telah diberikan suami kepadanya dan bila ia telah bercampur dengannya menggaulinya dan menyentuhnya dengan sentuhan yang awalnya adalah haram sebelum itu dan tidaklah ia mau menyerahkannya kecuali dengan kompensasi sesungguhnya ia telah merenggut hal yang harus di beri kompensasi maka wajiblah atasnya memberikan kompensasi tersebut lalu bagaimana mungkin ia mengambil hal yang harus diberikan kompensasi kemudian setelah itu ia mau menarik kembali kompensasi itu darinya? Inilah kezhaliman dan kesewenang-wenangan yang paling besar Allah juga telah mengambil perjanjian yang kuat dadri para suami dengan adanya akad dan (perintah untuk ) memenuhi hak-hak istrinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﺃﻓﻀﻰ ﺑﻌﻀﻜﻢ ﺇﻟﻰ ﺑﻌﺾ} afdho ba’dhokum ila ba’dh: Sampainya seorang suami menuju ke aurat istrinya, dan begitu pula seorang istri kepada suaminya. {ﻣﻴﺜﺎﻗﺎ ﻏﻠﻴﻈﺎ} mitsaqon ghalizho: Akad dan perkataan suami: menahan dengan cara yang makruf atau menceraikan dengan baik. Makna ayat : Kemudian Allah mengingkari hal tersebut dengan “Bagaimana kalian mengambilnya”, yaitu dengan menghalalkannya. Dan keadaan sebagian telah mendatangi yang sebagian lainnya, maksudnya adalah jimak (berhubungan badan). Karena mahar adalah hal yang membuat kemaluan sang istri halal bagi si suami. Bagaimana bisa dia mengambilnya kembali secara dusta dan dosa yang nyata. Allah berfirman, {ﻭﻛﻴﻒ ﺗﺄﺧﺬﻭﻧﻪ ﻭﻗﺪ ﺃﻓﻀﻰ ﺑﻌﻀﻜﻢ ﺇﻟﻰ ﺑﻌﺾ} “dan bagaimana bisa kalian mengambil maharnya padahal kalian sudah bersetubuh dengannya” Dan Allah berfirman pula {ﻭﺃﺧﺬﻥ ﻣﻨﻜﻢ ﻣﻴﺜﺎﻗﺎ ﻏﻠﻴﻈﺎ} “dan para suami telah diambil janjinya”, maksudnya adalah akad nikah dan itu adalah akad yang pasti dan berkata sang suami di akadnya dengan “aku menikahinya dalam keadaaan bersama dengan makruf atau bercerai dengan baik”. Dan bagimana ada bentuk perceraian yang baik jika sang istri disudutkan agar gugur hak maharnya atau sebagiannya. Inilah yang diingkari oleh Allah Ta’ala {ﻭﻛﻴﻒ ﺗﺄﺧﺬﻭﻧﻪ} “Bagimana bisa kalian mengambilnya?!”, sebuah kalimat tanya retorik yang berisi pengingkaran. Pelajaran dari ayat : • Wajibnya menjaga janji dan menepatinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 21: Dan bagaimana (bisa sampai hati) kamu ambil (pemberian) itu, padahal telah bersatu sebahagian dari pada kamu kepada sebahagian, serta mereka (yang jadi isteri- isteri kamu) itu telah mengambil perjanjian yang kuat dari kamu!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pernyataan ini merupakan pertanyaan untuk mencela dan mengingkari, yakni \"Dengan alasan apa?\" Yakni berjima'. Yakni ikatan pernikahan atau apa yang diperintahkan Allah berupa perintah menahan mereka dengan berbuat ma'ruf atau menceraikan mereka dengan cara yang baik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 21",
    "description": "Dan lantas bagaimana mungkin kamu akan mengambilnya kembali, yakni mahar atau pemberian yang telah kamu berikan kepada mereka, dengan cara paksa dan sewenang-wenang, padahal kamu telah bergaul satu sama lain sebagai suami-istri dengan menyalurkan hasrat biologis bersamanya' dan mereka telah mengambil perjanjian yang kuat dalam ikatan perkawinan sehingga menjadi pasangan istri dari kamu, ikatan perkawinan tersebut merupakan ikatan suci yang harus dijaga sehingga siapa saja yang memutus ikatan suci itu mendapat murka Allah. Nabi berpesan, bertakwalah kepada Allah dalam urusan wanita. Sesungguhnya kalian telah mengambil mereka sebagai amanat Allah dan menghalalkan kemaluan mereka dengan kalimat Allah. Setelah menjelaskan etika pergaulan suami istri dalam berumah tangga, maka pada ayat ini Allah menjelaskan etika seseorang terhadap ibu tirinya setelah ayahnya wafat. Dan janganlah kamu melakukan kebiasaan buruk sebagaimana yang dilakukan oleh sebagian masyarakat jahiliah, yaitu menikahi perempuan-perempuan yang telah dinikahi oleh ayahmu baik ayah kandung maupun orang tua dari ayah atau ibu, kecuali kebiasaan tersebut dilakukan pada masa yang telah lampau ketika kamu masih dalam keadaan jahiliah dan belum datang larangan tentang keharamannya. Setelah datangnya larangan itu, tindakan tersebut harus dihentikan. Sungguh, perbuatan menikahi istri-istri ayah (ibu tiri) itu merupakan tindakan buruk, sangat keji, dan dibenci oleh Allah. Dan pernikahan yang sangat tercela seperti itu merupakan seburuk-buruk jalan yang ditempuh untuk menyalurkan hasrat biologis. Apakah pantas bagi orang yang berakal sehat menikahi istri ayahnya setelah sang ayah wafat, padahal ia seperti ibu kandungnya sendiri'."
  }
]