[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian menikahi wanita yang telah dinikahi oleh ayah-ayah kalian, kecuali apa yang telah terjadi sebelumnya pada kalian,dan telah berlalu di masa jahiliyyah, maka tidak ada hukuman padanya. Sesungguhnya pernikahan anak-anak laki-laki dengan istri-istri ayah-ayah mereka merupakan perkara buruk yang amat keji dan begitu besar kebejatannya, lagi sangat dibenci, Allah memurkai pelakunya. Dan itu adalah seburuk-buruk jalan dan cara hidup yang kalian jalani pada masa jahiliyyah kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan janganlah kalian menikahi wanita-wanita yang telah dinikahi oleh bapak-bapak kalian. Karena hal itu diharamkan bagi kalian. Kecuali apa yang sudah berlalu di masa jahiliah, maka tidak ada hukuman atas hal tersebut. Hal itu disebabkan karena tindakan anak menikahi istri-istri bapaknya merupakan sesuatu yang sangat buruk. Tindakan itu dapat mengundang murka Allah bagi pelakunya dan merupakan jalan yang sangat buruk bagi orang yang memilihnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah mengharamkan pernikahan dengan istri ayah, kecuali pernikahan yang telah terjadi sebelum ada larangan ini. Pernikahan dengan istri ayah merupakan perbuatan yang sangat buruk, Allah sangat memurkainya karena itu merupakan pilihan yang sangat buruk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَا تَنكِحُوا۟ مَا نَكَحَ ءَابَآؤُكُم مِّنَ النِّسَآءِ (Dan janganlah kamu kawini wanita-wanita yang telah dikawini oleh ayahmu) Yakni larangan apa yang mereka lakukan di masa jahiliyah dengan menikahi istri ayah mereka apabila ia telah mati. إِلَّا مَا قَدْ سَلَفَ ۚ( terkecuali pada masa yang telah lampau) Yakni sebelum turunnya ayat ini, maka mereka tidak mendapat hukuman dari Allah atas perbuatan mereka. إِنَّهُۥ كَانَ فٰحِشَةً وَمَقْتًا وَسَآءَ سَبِيلًا(Sesungguhnya perbuatan itu amat keji dan dibenci Allah dan seburuk-buruk jalan) Orang-orang jahiliyah menamai pernikahan ini dengan pernikahan al-mawt (dibenci) yakni apabila seseorang menikahi istri ayah mereka apabila telah diceraikan atau ayah mereka telah meninggal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Wahai para anak, janganlah kalian menikahi istri-istri dari ayah (yang janda), sebagaimana yang terjadi di masa Jahiliyyah, kecuali yang telah dilakukan sebelum adanya pengharaman tersebut. Maka hal itu dimaafkan. Sesungguhnya pernikahan itu sangatlah buruk dan menjadi penyebab murka (kemarahan yang sangat paling dahsyat) dari Allah dan orang-orang mukmin. Dan pada zaman Jahiliyyah hal itu dinamakan nikahul Maqt, yaitu seorang laki-laki yang menikahi istri ayahnya ketika dia ditalak atau ditinggal mati. Sungguh amat buruk cara dan praktek pernikahan ini. Ibnu Abbas berkata: “Penduduk Jahiliyyah mengharamkan banyak hal kecuali istri ayah dan menikahi dua wanita yang bersaudara. Lalu Allah menurunkan ayat ini {Wa laa tankihuu …} dan ayat {An-Tajma’uu bainal ukhtaini Illa maa qad salaf} yaitu ayat selanjutnya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah kalian menikahi wanita-wanita yang telah dinikahi oleh ayah kalian, kecuali yang telah lampau} berlalu di zaman jahiliyah, yang mana itu diampuni dosanya dan keduanya tidak berpisah {Sesungguhnya itu sangat keji dan dibenci} pelakunya sangat dibenci oleh Allah {dan seburuk-buruk jalan} seburuk-buruk jalan yang ditempuh seseorang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. maksudnya janganlah kalian menikahi wanita-wanita yang telah dinikahi oleh bapak-bapak kalian, artinya ayah dan seterusnya ke atas, ”sesungguhnya perbuatan itu amat keji” yaitu perkara yang buruk, dimana hal itu adalah keji dan keburukannyapun sangat besar ”dan dibenci” oleh Allah dan makhluk bahkan hal itu seorang anak akan membenci ayahnya, dan seorang bapak akan membenci anaknya padahal ada perintah untuk berbakti kepadanya, ”dan seburuk-buruk jalan (yang ditempuh)“ yaitu jalan terjelek bagi orang yang menempuh jalan tersebut, karena hal tersebut diantara kebiasaan-kebiasaan jahiliyaah dimana islam dating untuk membersihkannya dan melepaskan diri darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata : {ﻭﻻ ﺗﻨﻜﺤﻮا ﻣﺎ ﻧﻜﺢ ﺁﺑﺎﺅﻛﻢ} walaa tankihu ma nakaha aabaa ukum: janganlah kalian menikahi wanita yang telah dinikahi ayah ataupun kakek. {ﺇﻻ ﻣﺎ ﻗﺪ ﺳﻠﻒ} illa ma qod salaf : kecuali apa yang sudah terjadi sebelum pengharaman ini ada. {ﺇﻧﻪ ﻛﺎﻥ ﻓﺎﺣﺸﺔ} innahu kana fahisyah: menikah istri ayah/kakek adalah kekejian pada puncaknya kenistaan. {ﻭﻣﻘﺘﺎ} wa maqtan: dibenci oleh setiap orang yang mempunyai fitrah yang sehat {ﻭﺳﺎء ﺳﺒﻴﻼ} wasaa sabila: adalah jalan keburukan yang ditempuh, saat menikahi istri dari ayah atau kakek. Makna ayat: Konteks ayat masih dalam penjelasan hukum-hukum syariat yang berkaitan dengan warisan, nikah dan pergaulan dengan kaum wanita. Dalam dua ayat ini Allah Ta’ala menyebutkan para mahram (yang dilarang untuk dinikahi) karena sebab nasab (garis keturunan), persusuan, dan semenda. Allah memulai dengan pengharaman menikahi istri ayah dan garis keturan ke atas setelah ayah {ﻭﻻ ﺗﻨﻜﺤﻮا4 ﻣﺎ ﻧﻜﺢ ﺁﺑﺎﺅﻛﻢ} “Dan jangan nikahi orang yang telah ayah kalian nikahi) dan Allah tidak menyebutkan “sebagian” dikarenakan mencakup semua orang yang dinikahi ayah dan dilarang juga dengan tatacara yang sudah berjalan di zaman jahiliah. Oleh karena itu Allah menyebutkan ﺇﻻ ﻣﺎ ﻗﺪ ﺳﻠﻒ “kecuali yang telah berlalu” yang terjadi di masa jahiliyah dan telah dimaafkan oleh Islam, setelah berlepas dari hal demikian dan tidak meneruskan adat itu. Dan diharamkan dalam ayat ini, istri ayah atau kakek terhadap anak atau cucu walaupun belum terjadi persetubuhan. Pelajaran dari ayat: • Pengharaman pernikahan zaman jahiliyah kecuali sebagian yang telah disetujui oleh Islam. Dan khususnya perihal istri-istri para ayah, maka istri ayah adalah haram untuk dinikahi oleh anak walaupun belum terjadi hubungan suami istri antara ayah dan istrinya, bercerai ataupun menjanda dari si ayah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 22: Dan janganlah kamu berkawin kepada perempuan-perempuan yang telah dikawini oleh bapa-bapa kamu, kecuali apa yang telah lalu,karena sesungguhnya (yang demikian) itu adalah satu kejelekan dan satu kemurkaan dan satu jalan yang jahat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir meriwayatkan dari Ibnu Abbas, ia berkata, \"Dahulu orang-orang Jahiliyah mengharamkan apa yang mereka haramkan selain istri bapak dan selain menggabung antara dua perempuan bersaudara, maka Allah menurunkan ayat, \"Wa laa tankihuu maa nakaha aabaa'ukum minan nisaa'i illaa maa qad salaf…dst.\" sampai \"Wa an tajma'uu bainal ukhtain.\" (Hadits ini para perawinya adalah para perawi kitab shahih selain Muhammad bin Abdullah Al Makhramiy, namun dia tsiqah). Termasuk kakekmu. Kejadian pada masa yang lalu dimaafkan. Baik oleh Allah maupun oleh manusia. Karena sebab itu, seorang anak menjadi benci kepada bapaknya atau bapak benci kepada anaknya, padahal anak diperintahkan berbakti kepada bapaknya. Oleh karenanya, kebiasaan jahiliyyah tersebut dihapuskan oleh Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 22",
    "description": "Setelah menjelaskan etika pergaulan suami istri dalam berumah tangga, maka pada ayat ini Allah menjelaskan etika seseorang terhadap ibu tirinya setelah ayahnya wafat. Dan janganlah kamu melakukan kebiasaan buruk sebagaimana yang dilakukan oleh sebagian masyarakat jahiliah, yaitu menikahi perempuan-perempuan yang telah dinikahi oleh ayahmu baik ayah kandung maupun orang tua dari ayah atau ibu, kecuali kebiasaan tersebut dilakukan pada masa yang telah lampau ketika kamu masih dalam keadaan jahiliah dan belum datang larangan tentang keharamannya. Setelah datangnya larangan itu, tindakan tersebut harus dihentikan. Sungguh, perbuatan menikahi istri-istri ayah (ibu tiri) itu merupakan tindakan buruk, sangat keji, dan dibenci oleh Allah. Dan pernikahan yang sangat tercela seperti itu merupakan seburuk-buruk jalan yang ditempuh untuk menyalurkan hasrat biologis. Apakah pantas bagi orang yang berakal sehat menikahi istri ayahnya setelah sang ayah wafat, padahal ia seperti ibu kandungnya sendiri'selain haram menikahi ibu tiri sebagaimana dijelaskan di atas, diharamkan pula menikahi beberapa perempuan berikut ini. Diharamkan atas kamu menikahi ibu-ibumu termasuk juga nenekmu, anak-anakmu yang perempuan termasuk cucu perempuanmu, saudara-saudaramu yang perempuan baik kandung, seayah, atau seibu, saudara-saudara ayahmu yang perempuan termasuk saudara perempuan kakek, saudara-saudara ibumu yang perempuan termasuk saudara perempuan nenek. Demikian pula anak-anak perempuan dari saudara-saudaramu yang laki-laki, maupun anak-anak perempuan dari saudara-saudaramu yang perempuan termasuk anak-anak perempuan mereka. Itulah tujuh golongan yang haram dinikahi karena hubungan nasab. Selain itu diharamkan pula menikahi ibu-ibumu yang menyusui kamu ketika kamu dahulu berada dalam masa penyusuan (lihat: surah albaqarah/2: 233, surah al-ahqa'f/26: 15). Karena ibu susu mempunyai posisi sama dengan ibu kandung, maka perempuan yang haram dinikahi karena nasab, diharamkan pula karena persusuan. Dengan demikian diharamkan atas kamu menikahi saudara-saudara perempuanmu sesusuan apabila kamu menyusu langsung pada tempat yang sama, dengan ketentuan tidak kurang dari lima kali susuan yang mengenyangkan, baik mereka menyusu sebelum kamu menyusu, atau dalam waktu bersamaan, atau setelah kamu selesai. Selain itu diharamkan pula menikahi ibu-ibu dari istrimu atau mertua, baik istri itu telah kamu gauli layaknya suami istri maupun yang belum kamu gauli. Selain itu diharamkan pula menikahi anak-anak perempuan dari istrimu yakni anak tiri yang berada dalam pemeliharaanmu dan tinggal bersama maupun anak-anak tiri yang tidak berada dalam pemeliharaanmu, keduanya sama saja. Larangan tersebut adalah jika anak tiri itu merupakan anak dari istri yang telah kamu campuri sebagaimana layaknya suami istri. Tetapi jika kamu belum campur dengan istrimu itu dan dia sudah kamu ceraikan atau istri yang belum kamu gauli itu meninggal dunia, maka tidak berdosa kamu menikahi anak-anak tiri dari bekas istri yang telah kamu ceraikan atau meninggal sebelum kamu menggaulinya. Dan diharamkan pula kamu menikahi istri-istri anak kandungmu atau menantumu sendiri. Demikian itulah ketentuan tentang keharaman menikahi perempuan untuk selama-lamanya. Adapun wanita-wanita yang haram dinikahi tetapi tidak untuk selamalamanya dijelaskan berikut ini. Dan diharamkan pula melangsungkan perkawinan dengan mengumpulkan dua perempuan yang bersaudara pada waktu yang sama, baik kedua perempuan itu kakak beradik, atau seorang perempuan dengan bibi yakni saudara perempuan ayah atau saudara perempuan ibu dari perempuan tersebut, kecuali perkawinan serupa yang telah terjadi pada masa lampau sebelum datangnya larangan ini. Sungguh yang demikian ini karena Allah maha pengampun atas segala dosa atau kekhilafan yang telah kamu lakukan, maha penyayang terhadap hamba-hamba-Nya. Agama islam melarang menikahi ibu kandung, ibu tiri, ibu susu, maupun bibi (saudara perempuan ayah atau ibu), adalah untuk menghormati kedudukan dan status mereka. Bagaimana mungkin orang yang diperintahkan Allah untuk dihormati malah dijadikan istri oleh anak sendiri' di mana letak penghormatan anak terhadap mereka, dan bagaimana dengan status anak yang lahir nanti' demikian pula larangan memperistri dua perempuan bersaudara sekaligus dalam waktu yang sama. Tindakan ini dapat menimbulkan kecemburuan besar yang berdampak pada retaknya hubungan persaudaraan. Islam sangat menjunjung tinggi hubungan kekeluargaan atau kekerabatan apabila terjalin dengan harmonis serta kokoh, dan membenci tindakan apa pun yang dapat mendorong retak bahkan putusnya hubungan tersebut."
  }
]