[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengharamkan atas kalian menikahi ibu-ibu kalian,termasuk dal itu juga nenek-nenek kalian dari jalur ayah dan ibu,dan putri-putri kalian dan mencakup anak-anak perempuan dari anak-anak sendiri dan demikian seterusnya; dan saudari-saudari kandung kalian,atau saudari seayah atau seibu;’ammah(bibi-bibi) kalian;yaitu saudari ayah-ayah dan kakek-kakek kalian,dan khalah(bibi-bibi);yaitu saudari ibu-ibu dan nenek-nenek kalian,anak-anank dan saudari-saudari lelaki kalian,dan anak-anak perempuan dari saudari-saudari kalian.Termasuk didalamnya anak-anak mereka.Dan ibu-ibu kalian yang menyusui kalian dan saudari-saudari kalian dalam persusuan. Dan sesungguhnya rasulullah telah mengharamkan melalui persusuan apa yang diharamkan melalui nasab. Dan ibu-ibu dari istri-istri kalian, sama saja kalian telah berhubungan badan dengan istri-istri kalian atau belum, dan anak-anak istri-istri kalian yang berasal dari lelaki lain yang umumnya tumbuh di dalam rumah-rumah kalian dan dibawah pengasuhan kalian. Mereka itu haram dinikahi,meskipun tidak dibawah pengasuhan kalian, dengan syarat telah terjadi hubungan badan dengan ibu-ibu mereka. Apabila kalian belum mencampuri ibu-ibu mereka,dan kalian sudah menceraikan ibu-ibu mereka atau sudah meninggal dunia sebelum terjadi hubungan badan, maka tidak masalah bagi kalian untuk menikahi putri-putri mereka. Sebagaimana Allah sudah mengharamkan atas kalian istri-istri anak-anak lelaki kalian yang berasal dari tulang sulbi kalian sendiri dan anak-anak yang dimasukkan ke dalam kategori tersebut,yaitu anak-anak kalian yang melalui persusuan. Pengharaman ini berlaku sejak terjadi akad pernikahan dengannya,baik anak lelaki tersebut telah mencampurinya atau belum mencampurinya. Dan dia mengharamkan atas kalian menggabungkan dua perempuan bersaudara dalam satu nasab atau satu persusuan dalam satu waktu,kecualai apa yang telah terjadi dan berlalu dari kalian di masa jahiliyyah. Demikian pula tidak boleh menggabungkan antara seorang wanita dengan bibinya dari jalur ayah atau ibunya, sebagaimana tertuang dalam dalil assunnah. Sesungguhnya Allah maha pengampun kepada orang-orang yang berbuat dosa bila mereka mau bertaubat, Maha penyayang terhadap mereka,tidak membebankan kepada mereka Sesuatu yang tidak mereka sanggupi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Allah mengharamkan bagi kalian menikahi ibu-ibu kalian berikut silsilah di atasnya; yakni nenek, buyut, baik dari pihak bapak maupun ibu; anak-anak perempuan kalian berikut silsilah di bawahnya; yakni, cucu perempuan dan cicit perempuan; begitu juga dengan cucu perempuan dari anak laki-laki kalian berikut silsilah di bawahnya; saudari-saudari kalian yang sekandung, seayah atau seibu; bibi-bibi kalian dari pihak bapak, begitu juga dengan bibi-bibi bapak kalian; dan bibi-bibi ibu kalian dari pihak bapaknya berikut silsilah di atasnya; bibi-bibi kalian dari pihak ibu, begitu juga dengan bibi-bibi dari bapak kalian dan ibu kalian dari pihak ibunya berikut silsilah di atasnya; anak perempuan dari saudara laki-laki kalian dan anak perempuan dari saudari kalian berikut silsilah anak-anaknya ke bawah; ibu-ibu yang menyusui kalian, saudari-saudari sepersusuan kalian, ibu-ibu (mertua) dari istri-istri kalian yang telah kalian campuri maupun yang belum kalian campuri; anak-anak perempuan dari istri-istri kalian dari suami yang lain (anak tiri) yang -pada umumnya- tumbuh dan besar di rumah kalian maupun tidak di rumah kalian, jika kalian sudah bercampur dengan istri-istri kalian tersebut, namun bila kalian belum bercampur dengan istri-istri kalian itu, maka kalian boleh menikahi anak-anak perempuan mereka itu. Dan juga diharamkan bagi kalian menikahi istri-istri dari anak-anak lelaki kandung kalian, meskipun mereka belum mencampurinya. Ketentuan hukum ini juga berlaku pada istri-istri dari anak-anak lelaki kalian dari jalur persusuan. Dan kalian juga diharamkan menggabungkan antara dua wanita bersaudara, baik dari jalur nasab maupun persusuan, kecuali apa yang sudah berlalu di masa jahiliah, karena Allah telah memaafkannya. Sesungguhnya Allah Maha Pengampun bagi hamba-hamba-Nya yang bertaubat kepada-Nya lagi Maha Penyayang kepada mereka. Dan di dalam sunah Nabi disebutkan bahwa seorang laki-laki juga diharamkan menggabungkan antara seorang wanita dengan bibinya dari pihak bapak maupun ibu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Allah mengharamkan pernikahan dengan ibu atau nenek dari jalur ayah atau ibu, dan melarang pula pernihakan dengan anak perempuan kalian, cucu perempuan, cicit perempuan, saudari kandung dari jalur ayah maupun ibu, saudari ayah dan kakek, saudari ibu dan nenek, anak perempuan dari saudara atau saudari dan anak-anak perempuan mereka, ibu sesusuan, ibu mertua dan nenek mertua, anak tiri perempuan yang telah kalian pergauli ibunya, jika belum kalian pergauli ibunya maka tidak mengapa kalian nikahi, diharamkan pula menikahi istri anak kandung, menikahi dua perempuan bersaudara dalam satu waktu baik itu saudara kandung maupun sesusuan, dan dilarang menikahi seluruh mahram seperti bibi dari jalur ayah atau ibu; semua ini kecuali pernikahan yang terjadi sebelum turunnya larangan ini, maka Allah tidak akan menghukumnya. Dia Maha Pengampun bagi hamba-Nya yang bertaubat dan Maha Pengasih bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. حُرِّمَتْ عَلَيْكُمْ أُمَّهٰتُكُمْ (Diharamkan atas kamu ibu-ibumu) Yakni diharamkan menikahi mereka, dan tercakup dalam kata dari “ibu-ibu kalian”, nenek, nenek buyut, ibu dari ayah, dan nenek dari ayah, dan seterusnya karena semuanya termasuk dalam kata ibu. وَبَنَاتُكُمْ(anak-anakmu yang perempuan) Dan meliputi cucu perempuan dan seterusnya kebawah. وَأَخَوٰتُكُمْ(saudara-saudaramu yang perempuan) Dan termasuk bibi dari jalur ayah dan ibu atau salah satunya. وَعَمّٰتُكُمْ(saudara-saudara bapakmu yang perempuan) Kata (العمة) mencakup seluruh perempuan yang merupakan saudari ayah atau saudari salah satu kakekmu. Dan bisa jadi bibi berasal dari jalur ibu seperti saudari kakek dari jalur ibu. وَخٰلٰتُكُمْ (saudara-saudara ibumu yang perempuan) Kata (الخالة) mencakup semua perempuan yang merupakan saudari ibu atau saudari salah satu nenekmu. Dan bisa jadi bibi berasal dari jalur ayah seperti saudari nenek dari jalur ayah. وَبَنَاتُ الْأَخِ (anak-anak perempuan dari saudara-saudaramu yang laki-laki) Kata (بنت الأخ) mencakup semua anak perempuan saudaramu baik itu yang secara langsung (anaknya langsung) atau dengan perantara (seperti cucu perempuan) meski dengan perantara yang jauh (seperti cicit perempuan dan seterusnya kebawah). وَأُمَّهٰتُكُمُ الّٰتِىٓ أَرْضَعْنَكُمْ(ibu-ibumu yang menyusui kamu) Yakni selama dua tahun; dan terdapat hadist-hadist shahih yang membatasinya dengan lima kali menyusui. وَأَخَوٰتُكُم مِّنَ الرَّضٰعَةِ(saudara perempuan sepersusuan) Yakni perempuan yang menyusu pada wanita yang sama denganmu. وَأُمَّهٰتُ نِسَآئِكُمْ (ibu-ibu isterimu (mertua)) Dan ia adalah ibu istrimu dan semua nenek istrimu. وَرَبٰٓئِبُكُمُ الّٰتِى فِى حُجُورِكُم (anak-anak isterimu yang dalam pemeliharaanmu dari isterimu) Yakni yang dipelihara dalam asuhanmu, dan ini bukanlah maksud dalam pengharamannya, karena (الربيبة) adalah anak perempuan istri dari suami selain dia (anak tiri), dan dinamakan (الربيبة) karena dia diasuh dalam asuhan suami terakhir. Anak tiri ini diharamkan atasnya apabila ia telah menggauli ibunya meski anak tiri ini tidak dalam asuhannya. فَإِن لَّمْ تَكُونُوا۟ دَخَلْتُم بِهِنَّ فَلَا جُنَاحَ عَلَيْكُمْ (tetapi jika kamu belum campur dengan isterimu itu (dan sudah kamu ceraikan), maka tidak berdosa kamu mengawininya) Yakni menikahi anak tiri. Adapun wanita-wanita yang lain yang diharamkan untuk dinikahi dengan perbesanan -dan mereka adalah istri ayah, istri anak, dan ibu mertua- maka mereka diharamkan atas kalian hanya dengan sempurnanya kalimat akad dengan istri meski belum bercampur dengannya. وَحَلٰٓئِلُ أَبْنَآئِكُمُ(isteri-isteri anakmu (menantu)) Yakni istri putramu, ia diharamkan atasmu hanya dengan akad meski belum bercampur dengannya. الَّذِينَ مِنْ أَصْلٰبِكُمْ(yang dari tulang sulbimu (anak kandung)) Dan bukan istri dari anak angkat kalian sebagaimana yang orang-orang jahiliyah lakukan. وَأَن تَجْمَعُوا۟ بَيْنَ الْأُخْتَيْن(dan menghimpunkan (dalam perkawinan) dua perempuan yang bersaudara) Yakni Allah juga mengaharamkan kalian untuk menikahi saudari istrinya sebelum ia berpisah dengannya baik itu dengan talak atau kematian. إِلَّا مَا قَدْ سَلَفَ ۗ( kecuali yang telah terjadi pada masa lampau) Yakni pernikahan haram yang telah terjadi sebelum turunnya ayat pengharaman ini, maka Allah tidak akan menghukum kalian atas hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23, Diharamkan bagi kalian untuk menikahi ibu dan nenek dari ayah atau ibu kalian yang lebih tua, puteri-puteri kalian dan cucu-cucu perempuan kalian yang sudah cukup umur, saudari-saudari kandung dari ayah atau ibu kalian, bibi-bibi kalian (saudara dari ayah atau kakek), dan tante-tante kalian (saudara dari ibu atau nenek dari silsilah ayah atau ibu), puteri-puteri saudara laki-laki dan saudara perempuan yang sudah cukup umur, ibu susuan yang menyusui di masa menyusui dengan menyusui sebanyak lima kali susuan, saudari sepersusuan (yaitu kamu dan dia menyusu pada satu wanita), ibu dari istri beserta neneknya, puteri-puteri istri kalian yang berada dalam penjagaan kalian dan kalian telah mencampuri ibu mereka (Ar-Raibah adalah puteri istri kalian dari suami sebelumnya) meskipun dia tinggal di rumah lain yang bukan merupakan rumah suami baru ibunya, dan kalian tidak dosa menikahinya jika sebelum mencampuri ibunya. Adapun yang diharamkan bagi para menantu laki-laki adalah istri ayah, istri anak dan ibu dari istri. Mereka diharamkan untuk dinikahi. Dan diharamkan pula istri-istri anak untuk dinikahi meskipun belum dicampuri jika anaknya itu merupakan anak kandungnya, adapun jika anak adopsi maka diperbolehkan menikahi istri-istrinya, berbeda dengan yang dilakukan penduduk Jahiliyyah. Tidak diperbolehkan pula menghimpun pernikahan antara dua saudara meskipun saudara karena persusuan, pengharaman hal itu seperti haramnya menikahi bibi dan tante, kecuali yang terjadi sebelum adanya pengharaman, maka hal tersebut tidak disalahkan. Sesungguhnya Allah itu Maha Pengampun sesuatu yang telah lalu berupa sisa-sisa amal buruk dan Maha Pengasih dengan memberikan hukum-hukum pernikahan yang di dalamnya mengandung kebaikan dan kemaslahatan bagi kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Diharamkan atas kalian ibu, anak perempuan, saudara-saudara perempuan, saudara-saudara perempuan ayah, saudara-saudara perempuan ibu, anak-anak perempuan dari saudara laki-laki, anak-anak perempuan dari saudara perempuan, ibu yang menyusui kalian, saudara-saudara perempuan sesusuan, ibu istri-istri kalian, anak-anak perempuan dari istri kalian yang dalam pemeliharaan kalian} anak dari istri-istri kalian yang bukan dari kalian yang dipelihara (umumnya) di rumah kalian {dari istri yang telah kalian campuri, tetapi jika kalian belum bercampur dengan istri kalian itu (dan sudah diceraikan), maka tidak berdosa bagi kalian} maka tidak ada kesalahan bagi kalian dalam menikahi anak perempuannya, dan istri-istri} istri-istri {anak kandung kalian, dan mengumpulkan dua perempuan yang bersaudara, kecuali yang telah lampau. Sesungguhnya Allah adalah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. ayat-ayat yang mulia ini mengandung penjelasan tentang wanita-wanita yang diharamkan karena pertalian darah, dan wanita-wanita karena sepersusuan dan wanita-wanita yang diharamkan karena perkawinan dan wanita-wanita yang diharamkan karena penyatuan dan juga wanita-wanita yang dihalalkan. Adapun wanita-wanita yang diharamkan karena pertalian darah, mereka ada tujuh kelompok sebagaimana yang disebutkan oleh Allah yaitu: ibu, yang termasuk makna ibu adalah setiap orang yang menjadi sebab kelahiran dirimu walupun jauh. kemudian anak perempuan, dan termasuk dalam makna anak perempuan adalah setiap orang yang engkau menjadi penyebab kelahirannya. saudara perempuan sekandung atau seayah atau seibu, saudara perempuan ayah yaitu seluruh seluruh saudara perempuan ayah anda atau kakek anda dan seterusnya ke atas. saudara perempuan ibu, yaitu setiap saudara perempuan ibu anda atau nenek anda dan seterusnya ke atas yang menjadi ahli waris ataupun tidak. keponakan perempuan dari saudara laki-laki dan keponakan perempuan dari saudara perempuan dan seterusnya kebawah. mereka semua itu adalah wanita-wanita yang diharamkan karena pertalian darah menurut ijma’para ulama, sebagaimana juga nash ayat yang mulia di atas. sedangkan selain dari mereka maka termasuk firman Allah “dan dihalalkan bagi kamu selain yang demikian” yang demikian itu seperti anak perempuan bibi atau paman dari ayah atau anak perempuan bibi atau paman dari ibu. Adapun wanita-wanita yang diharmakan Karena persusuan, maka sesungguhnya Allah telah menyebutkan pada ayat diatas yaitu diantara mereka adalah ibu dan saudara perempuan, hal itu adalah sebuah dalil tentang haramnya menikahi ibu, padahal hak air susunya bukanlah miliknya, sesungguhnya air susu itu adalah hak yang memiliki susu, indikasi ayat tersebut menunjukan bahwa pemilik dari air susu itu adalah ayah bagi anak susan tersebut, lalu bila telah terbukti dalam hal tersebut penamaan ayah dan ibu, maka harus terbukti pula hal-hal yang menjadi cabang dan kedua label tersebut, seperti saudara-saudara perempuan keduanya kakek nenek keduanya dan keturunan keduanya, dan nabi telah bersabda ”diharamkan dari persesusuan apa yang diharamkan dari keturunan” Dengan demikian tersebarlah pengharaman itu dari pihak ibu yang menyusui dan pemilik air susu tersebut, sebagaimana juga tersebar pada sanak family pada anak tersebut hingga pada anak keturunannya saja, akan tetapi dengan syarat sepersusuan tersebut adalah sebanyak lima kali susuan dalam usia dua tahun sebagaimana yang telah dijelaskan oleh sunnah. Adapun wanita-wanita yang diharamkan karena pernikahan adalah empat kelompok, yaitu; istri-istri bapak dan seterusnya ke atas, istri-istri anak dan seterusnya ke bawah baik yang menjadi ahli waris maupun yang terhalang ibu dari istri dan seterusnya ke atas dan mereka yang disebut tadi adalah diharamkan dengan sempurnanya akad nikah, sedangkan yang keempat adalah anak perempuan tiri, yaitu anak perempuan istrinya dan seterusnya kebawah, kelompok yang satu ini tidaklah haram kecuali bila suami telah menggauli istrinya sebagaimana Allah berfirman pada ayat ini ”anak-anak pada istrimu yang dalam pemeliharaanmu dari istri yang telah kamu campuri” dan jumhur ulama juga telah berkata ”sesungguhnya firman Allah “yang dalam pemeliharaan” sebuah pengikat yang keluar dari perkara yang sering terjadi hingga tidak memiliki arti dan makna, karena sesungguhnya anak perempuan tiri itu tetap haram (dinikahi) walaupun tdak berada dalam pemeliharaan namun ikatan tersebut memiliki dua faidah: pertama, menyimpan sebuah indikasi tentang hikmah dari pegharaman anak peremuan tiri dan bahwa ia adalah dalam posisi anak kandung maka sangatlah jelek menjadikannya halal untuk dinikahi, kedua, ikatan itu menyimpan sebuah isyarat tentang bolehnya berkhalwat dengan anak perempuan tiri, karena ia adalah dalam posisi orang-orang yang ada dalam pemeliharaannya seperti anak-anak perempuan nya sendiri dan semisalnya, Sedangkan wanita-wanta yang diharamkan karena penghimpunan maka Allah telah menyebutkan tentang penyatuan saudara perempuan kemudian Allah mengharamkannya, Dan Nabi saw juga telah mengharamkan penyatuan antara seorang perempuan dengan amah (bibi dari pihak ayah) atau khalah (bibi dari pihak ibu) maka setiap dua perempuan yang disatukan yang memliki ikatan pertalian darah adalah diharamkan seandainya diumpamakan salah seorangnya adalsh laki-laki dan lainnya adalah perempuan maka yang perempuan haram bagi yang laki-laki karena itu diharamkan menyatukan antara keduanya, yang demikian itu karena akan menjadi salah satu sebab di antara sebab-sebab putusnya tali kekeluargaan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﺃﻣﻬﺎﺗﻜﻢ} para ibu kalian: ummahat bentuk jamak dari umm. Ibu adalah mahram yang tidak boleh dinikahi, yang semisal dengan ibu adalah nenek dan wanita selanjutnya di atas nenek {ﻭﺭﺑﺎﺋﺒﻜﻢ} wa rabibikum: raba’ib adalah bentuk jamak dari rabibah dan artinya adalah anak tiri perempuan dari istri (anak tiri perempuan). {ﻭﺣﻼﺋﻞ ﺃﺑﻨﺎﺋﻜﻢ} wahalaili abnaikum: hala’il adalah bentuk jamak dari halilah yang bermakna istri anak kandung (menantu perempuan) Makna ayat : Kemudian Allah menyebutkan mahram dari nasab garis keturunan ialah ibu-nenek (dan ke atas), anak perempuan, saudari, saudari ayah (bibi), saudari ibu (bibi), anak saudara (keponakan), anak saudari (keponakan) dan merekalah tujuh golongan yang termasuk mahram (haram dinikahi) dari garis nasab. Allah berfirman : {ﺣﺮﻣﺖ ﻋﻠﻴﻜﻢ ﺃﻣﻬﺎﺗﻜﻢ ﻭﺑﻨﺎﺗﻜﻢ ﻭﺃﺧﻮاﺗﻜﻢ ﻭﻋﻤﺎﺗﻜﻢ ﻭﺧﺎﻻﺗﻜﻢ ﻭﺑﻨﺎﺕ اﻷﺥ ﻭﺑﻨﺎﺕ اﻷﺧﺖ} Allah menyebutkan pula para mahram dari persusuan {ﻭﺃﻣﻬﺎﺗﻜﻢ اﻟﻻﺗﻲ ﺃﺭﺿﻌﻨﻜﻢ ﻭﺃﺧﻮاﺗﻜﻢ ﻣﻦ اﻟﺮﺿﺎﻋﺔ} bayi yang dalam umur 2 tahun menyusu dari seorang perempuan sebanyak lima kali, maka wanita yang meyusuinya adalah mahram bagi si bayi begitu pula, ibu sang penyusu, anak-anak perempuannya, saudai-saudarinya, anak-anak perempuan dari suami wanita yang menyusuinya, ibu suami dari wanita yang menyusui sang bayi. Disebutkan bahwa kelompok orang yang diharamkan dari susuan seperti dalam kelompok yang diharamkan dalam nasab. Kemudian Allah menyebutkan orang-orang yang haram untuk dinikahi (mahram) dari semenda : {ﻭﺃﻣﻬﺎﺕ ﻧﺴﺎﺋﻜﻢ} “dan para ibu dari istri-istri kalian. Ibu dari seorang perempuan (mertua) adalah mahram bagi sang suami dengan hanya sekedar telah terjadi akad antara suami dan istri. Dan ibu sang istri menjadi mahram si suami. Allah berfirman {ﻭﺭﺑﺎﺋﺒﻜﻢ اﻟﻻﺗﻲ ﻓﻲ ﺣﺠﻮﺭﻛﻢ} “dan anak-anak perempuan dari istri-istri kalian yang ada di rumah kalian” Jika seorang pria menikahi seorang wanita dan melakukan hubungan seksual, maka tidak halal baginya untuk menikahi anak perempuan dari istrinya. Adapun apabila hanya terjadi akad pernikahan antara pria dan wanita serta belum terjadi hubungan suami istri, maka si suami boleh menikahi anak dari istrinya. Hal ini berdasarkan firman Allah : {ﻣﻦ ﻧﺴﺎﺋﻜﻢ اﻟﻻﺗﻲ ﺩﺧﻠﺘﻢ ﺑﻬﻦ ﻓﺈﻥ ﻟﻢ ﺗﻜﻮﻧﻮا ﺩﺧﻠﺘﻢ ﺑﻬﻦ ﻓﻼ ﺟﻨﺎﺡ ﻋﻠﻴﻜﻢ} “dari para istri kalian yang kalian telah bersetubuh dengan mereka, dan jika tidak terjadi persetubuhan, maka tidaklah mengapa” maksudnya tidak apa-apa dan tidak dosa. Dan termasuk para mahram dari semenda adalah istri anak (menantu) yang mana si anak telah bersenggama dengannya ataupun belum, berdasarkan firman Allah: {ﻭﺣﻼﺋﻞ ﺃﺑﻨﺎﺋﻜﻢ اﻟﺬﻳﻦ ﻣﻦ ﺃﺻﻼﺑﻜﻢ} “Dan istri-istri dari anak-anak kandung kalian” maksudnya bukan anak angkat. Adapun istri anak susuan, maka semisal dengan istri anak kandung karena susu yang diasup oleh anak susuan adalah sebabnya. Jadi status anak susuan adalah semisal dengan anak kandung dan berlaku juga hukumnya istri anak susuan semisal dengan istri anak kandung. Termasuk golongan mahram karena semenda adalah saudari dari istri. Siapapun yang menikahi seorang perempuan, tidak lah halal baginya untuk menikah dengan saudari si istri sampai sang istri meninggal atau si suami menceraikan sang istri dan selesai iddahnya berdasarkan firman Allah :{ﻭﺃﻥ ﺗﺠﻤﻌﻮا ﺑﻴﻦ اﻷﺧﺘﻴﻦ ﺇﻻ ﻣﺎ ﻗﺪ ﺳﻠﻒ} “Dan janganlah kalian mengumpulkan dua orang saudari kecuali apa yang terdahulu” maksudnya terjadi di jaman jahiliyah telah dimaafkan dengan syarat tidak terus belangsung pernikahan yang semacam ini setelah turunnya ayat ini. Pelajaran dari ayat : • Penjelasan para mahram karena nasab garis keturunan dan terdiri dari tujuh golongan, yaitu para ibu, anak-anak perempuan, para saudari, saudari ibu, saudari ayah, anak-anak perempuan dari saudara dan anak-anak perempuan dari saudari. • Penjabaran para mahram dari sebab persusuan, yaitu para mahram dari nasab. Dan anak susu diharamkan untuk menikahi ibu susuannya, anak-anak ibu susuan, saudari-saudari ibu susuan, saudari ayah (bibi) dari ibu susuan, saudari ibu (bibi) ibu susuan, anak-anak saudara ibu susuan, anak-anak suadari ibu susuan. • Penguraian para mahram dari sisi semenda, ada 7 golongan: istri ayah (sudah berhubungan seksual ataupun belum), ibu dari istrinya (baik sang pria sudah menggauli istrinya ataupun belum), anak perempuan dari istri (anak tiri) jika sudah berhubungan dengan sang istri, istri anak kandung (menantu) sudah digauli oleh anaknya ataupun belum, istri anak susuan, saudari istri selama si istri masih bersama suami belum diceraikan ataupun sang istri belum meninggal, dan para wanita muhshonah (orang yang belum diceraikan, ditinggal mati suaminya atau masih dalam masa iddah)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 23: Diharamkan atas kamu (nikah dengan) ibu-ibu kamu, dan anak-anak perempuan kamu, dan saudara-saudara perempuan kamu, dan bapa-bapa kamu punya saudara-saudara perempuan, dan ibu-ibu kamu punya saudara-saudara perempuan, dan saudara laki-laki (kamu) punya anak-anak perempuan, dan saudara-saudara perem- puan (kamu) punya anak-anak pe- rempuan, dan ibu-ibu kamu yang menyusui kamu, dan saudara-saudara perempuan kamu yang sesusu, dan isteri-isteri kamu yang punya ibu-ibu, dan anak-anak tiri yang di pangkuan kamu isteri yang kamu telah campuri, tetapi sekiranya kamu tidak cam- puri mereka, maka tidak ada halangan atas kamu, dan anak-anak laki-laki kamu sendiri punya isteri- isteri, dan (diharamkan) bahwa kamu memadukan dua saudara, kecuali apa yang telah lalu, karena sesungguhnya Allah itu adalah Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat 23 dan 24 mencakup wanita-wanita yang haram dinikahi baik karena nasab, karena sepersusuan, karena mushaharah (pernikahan), maupun karena jam' (menggabung dua pereempuan bersaudara). Demikian juga menjelaskan tentang wanita-wanita yang halal dinikahi. Yang diharamkan karena nasab adalah ibu, puteri, saudari, saudari bapak (bibi), saudari ibu (bibi dari pihak ibu), puteri dari saudara kita yang laki-laki dan puteri dari saudara kita yang perempuan. Lihat juga penjelasan masing-masingnya nanti. Selain yang disebutkan itu halal dinikahi (uhilla lakum maa waraa'a dzaalikum) seperti puteri paman dari bapak ('amm) dan puteri bibi dari bapak ('ammah), demikian pula puteri paman dari ibu (khaal) maupun puteri bibi dari ibu (khaalah). Dengan demikian, sepupu halal dinikahi. Yang diharamkan karena sepersusuan –yang disebutkan dalam ayat- adalah ibu susu dan saudari susu. Namun tidak hanya sebatas ini, karena dalam hadits disebukan, يَحْرُمُ مِنَ الرَّضَاعِ مَا يَحْرُمُ مِنَ النَّسَبِ \"Sepersusuan menjadikan mahram sebagaimana nasab.\" (HR. Bukhari dan Muslim) Maka keharaman dinikahi menyebar sebagaimana nasab. Dengan demikian, anak yang disusukan tidak boleh menikahi: 1. Wanita yang menyusuinya (karena dianggap sebagai ibunya), 2. Ibu wanita yang menyusuinya (karena ia neneknya), 3. Ibu bagi suami wanita yang menyusuinya (ia neneknya juga), 4. Saudari ibu yang menyusuinya (khaalahnya), 5. Saudari suami wanita yang menyusui (‘ammahnya), 6. Saudari sepersusuan, baik sekandung, sebapak maupun seibu. 7. Puteri anak laki-laki si wanita yang menyusuinya dan puteri dari puteri si wanita yang menyusui dst. ke bawah. Yang diharamkan karena mushaharah (pernikahan), jumlahnya ada 4, yaitu: istri bapak dst. ke atas, istri anak dst. ke bawah, baik mereka sebagai ahli waris maupun terhalang (mahjub), ibu istri kita dst. ke atas (seperti neneknya, baik dari pihak bapaknya maupun ibunya) dan anak tiri yaitu puteri dari istri kita yang lahir dari selain kita. Termasuk pula nenek baik dari pihak bapak maupun ibu dst. ke atas. Termasuk pula cucu perempuan (dari anak laki-laki maupun anak perempuan) dst. ke bawah. Baik sekandung, sebapak maupun seibu. Termasuk pula saudara-saudara kakekmu yang perempuan. Termasuk pula saudara-saudara nenekmu yang perempuan. Termasuk pula anak perempuan (cucu) dari anak saudara laki-laki maupun perempuan (baik dari saudara sekandung, sebapak maupun seibu) dst. ke bawah. Yakni yang menyusui kamu saat kamu berusia di bawah dua tahun dengan lima kali susuan. Termasuk pula anak-anak mereka yang perempuan. Yang dimaksud dengan anak-anak perempuan isterimu yang dalam pemeliharaanmu, menurut jumhur ulama termasuk juga anak tiri yang tidak dalam pemeliharaannya. Hal itu, karena kata-kata \" yang dalam pemeliharaanmu\" hanya sebagai kondisi yang biasa terjadi, sehingga tidak ada mafhum yang dijadikan pegangan daripadanya. Ada yang berpendapat, bahwa disebutkan kata \" yang dalam pemeliharaanmu\" karena dua faedah: - Mengingatkan hikmah haramnya menikahi anak tiri, karena ia menduduki puteri kita. - Menunjukkan bolehnya berkhalwat (berduaan) di rumah dengan anak tiri, wallahu a'lam. Hal ini menunjukkan bahwa jika bekas istri anak angkat, maka tidak mengapa menikahinya. Baik senasab maupun sepersusuan, yakni tidak boleh dinikahi bersama. Demikian juga dilarang menghimpun dalam pernikahan wanita tersebut bersama bibinya dari pihak bapak maupun ibu sebagaimana disebutkan dalam As Sunnah. Yang boleh adalah salah satunya, dan boleh menikahi adik dan kakaknya apabila yang satu meninggal sebagaimana Utsman menikahi dua puteri Nabi shallallahu 'alaihi wa sallam, karena puteri Nabi shallallahu 'alaihi wa sallam yang pertama meninggal, lalu ia menikahi puteri Nabi yang kedua. Hikmah dilarang demikian adalah agar tidak memutuskan tali silaturrahim antara kedua wanita yang bersaudara tersebut ketika terjadi pertengkaran. Maka dimaafkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 23",
    "description": "Selain haram menikahi ibu tiri sebagaimana dijelaskan di atas, diharamkan pula menikahi beberapa perempuan berikut ini. Diharamkan atas kamu menikahi ibu-ibumu termasuk juga nenekmu, anak-anakmu yang perempuan termasuk cucu perempuanmu, saudara-saudaramu yang perempuan baik kandung, seayah, atau seibu, saudara-saudara ayahmu yang perempuan termasuk saudara perempuan kakek, saudara-saudara ibumu yang perempuan termasuk saudara perempuan nenek. Demikian pula anak-anak perempuan dari saudara-saudaramu yang laki-laki, maupun anak-anak perempuan dari saudara-saudaramu yang perempuan termasuk anak-anak perempuan mereka. Itulah tujuh golongan yang haram dinikahi karena hubungan nasab. Selain itu diharamkan pula menikahi ibu-ibumu yang menyusui kamu ketika kamu dahulu berada dalam masa penyusuan (lihat: surah albaqarah/2: 233, surah al-ahqa'f/26: 15). Karena ibu susu mempunyai posisi sama dengan ibu kandung, maka perempuan yang haram dinikahi karena nasab, diharamkan pula karena persusuan. Dengan demikian diharamkan atas kamu menikahi saudara-saudara perempuanmu sesusuan apabila kamu menyusu langsung pada tempat yang sama, dengan ketentuan tidak kurang dari lima kali susuan yang mengenyangkan, baik mereka menyusu sebelum kamu menyusu, atau dalam waktu bersamaan, atau setelah kamu selesai. Selain itu diharamkan pula menikahi ibu-ibu dari istrimu atau mertua, baik istri itu telah kamu gauli layaknya suami istri maupun yang belum kamu gauli. Selain itu diharamkan pula menikahi anak-anak perempuan dari istrimu yakni anak tiri yang berada dalam pemeliharaanmu dan tinggal bersama maupun anak-anak tiri yang tidak berada dalam pemeliharaanmu, keduanya sama saja. Larangan tersebut adalah jika anak tiri itu merupakan anak dari istri yang telah kamu campuri sebagaimana layaknya suami istri. Tetapi jika kamu belum campur dengan istrimu itu dan dia sudah kamu ceraikan atau istri yang belum kamu gauli itu meninggal dunia, maka tidak berdosa kamu menikahi anak-anak tiri dari bekas istri yang telah kamu ceraikan atau meninggal sebelum kamu menggaulinya. Dan diharamkan pula kamu menikahi istri-istri anak kandungmu atau menantumu sendiri. Demikian itulah ketentuan tentang keharaman menikahi perempuan untuk selama-lamanya. Adapun wanita-wanita yang haram dinikahi tetapi tidak untuk selamalamanya dijelaskan berikut ini. Dan diharamkan pula melangsungkan perkawinan dengan mengumpulkan dua perempuan yang bersaudara pada waktu yang sama, baik kedua perempuan itu kakak beradik, atau seorang perempuan dengan bibi yakni saudara perempuan ayah atau saudara perempuan ibu dari perempuan tersebut, kecuali perkawinan serupa yang telah terjadi pada masa lampau sebelum datangnya larangan ini. Sungguh yang demikian ini karena Allah maha pengampun atas segala dosa atau kekhilafan yang telah kamu lakukan, maha penyayang terhadap hamba-hamba-Nya. Agama islam melarang menikahi ibu kandung, ibu tiri, ibu susu, maupun bibi (saudara perempuan ayah atau ibu), adalah untuk menghormati kedudukan dan status mereka. Bagaimana mungkin orang yang diperintahkan Allah untuk dihormati malah dijadikan istri oleh anak sendiri' di mana letak penghormatan anak terhadap mereka, dan bagaimana dengan status anak yang lahir nanti' demikian pula larangan memperistri dua perempuan bersaudara sekaligus dalam waktu yang sama. Tindakan ini dapat menimbulkan kecemburuan besar yang berdampak pada retaknya hubungan persaudaraan. Islam sangat menjunjung tinggi hubungan kekeluargaan atau kekerabatan apabila terjalin dengan harmonis serta kokoh, dan membenci tindakan apa pun yang dapat mendorong retak bahkan putusnya hubungan tersebut bila pada ayat yang lalu Allah melarang pernikahan yang menghimpun dua atau lebih perempuan bersaudara, maka ayat ini melarang seorang istri dinikahi oleh dua orang laki-laki. Dan diharamkan juga kamu menikahi perempuan yang sudah bersuami, kecuali hamba sahaya perempuan bersuami yang secara khusus kamu dapatkan melalui tawanan perang ketika suaminya tidak ikut tertawan, yang kemudian kamu miliki. Pengharaman itu sebagai ketetapan Allah atas kamu. Dan dihalalkan bagimu selain perempuan-perempuan yang demikian itu, yakni selain perempuan yang disebutkan oleh ayat sebelum ini, jika kamu berusaha bersungguh-sungguh membayar mahar dengan hartamu untuk menikahinya bukan dengan maksud untuk berzina. Maka karena kenikmatan yang telah kamu dapatkan dari mereka, istri-istri itu, segera berikanlah maskawinnya dengan sempurna kepada mereka sebagai suatu kewajiban yang harus kamu tunaikan. Tetapi tidak mengapa, artinya kamu tidak berdosa, wahai para suami, jika ternyata di antara kamu sebagai suami istri telah saling merelakannya, sebagian mahar atau keseluruhannya, setelah ditetapkan kewajiban pembayaran mahar itu secara bersama. Sungguh, Allah maha mengetahui, mahabijaksana."
  }
]