[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diharamkan juga atas kalian menikahi wanita-wanita bersuami, kecuali wanita-wanita dari mereka yang kalian tawan dalam peperangan. Sesungguhnya menikahi mereka itu halal bagi kalian, setelah melewati Memastian kosongnya Rahim-rahim mereka dengan sekali haid. Allah telah menetapkan atas kalian pengharaman menikahi mereka dan memperbolehkan menikahi wanita-wanita selain mereka dari wanita-wanita yang Allah menghalalkan kalian untuk mencari dengan harta-harta yang kalian miliki, cara untuk menjaga kehormatan kalian dari perbuatan haram. Kemudian istri-istri yang kalian telah nikmati dari mereka melalui pernikahan yang sah,maka berikanlah kepada mereka mahar-mahar mereka yang telah Allah wajibkan atas kalian.Tidak ada dosa atas kalian dalam kesepakatan yang saling meridoi yang terjalin di antara kalian untuk menambah atau mengurangi kadar mahar sesudah kewajiban membayar mahar tersebut ditentukan. Sesungguhnya Allah Maha Mengetahui urusan-urusan hamba-hambaNYA, juga Maha bijaksana dalam ketetapan-ketetapan hukum dan pengaturanNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Dan diharamkan bagi kalian menikahi wanita-wanita yang bersuami, kecuali wanita-wanita yang kalian miliki karena menjadi tawanan perang di medan jihad fi sabilillah, maka kalian boleh menggauli mereka setelah kalian mengetahui kebersihan rahim mereka dengan (menunggu) satu kali haid. Allah menetapkan hal itu bagi kalian secara wajib. Dan Allah menghalalkan wanita-wanita selain itu (untuk dinikahi) bilamana kalian menggunakan harta untuk menjaga kehormatan kalian dan melindungi kesuciannya dengan cara yang halal, bukan dengan tujuan berbuat zina. Kemudian wanita mana pun yang kalian nikmati melalui pernikahan, maka berikanlah maharnya yang Allah tetapkan sebagai kewajiban kalian. Namun tidak ada dosa bagi kalian, jika kalian saling merelakan setelah mahar yang wajib tersebut ditetapkan dengan memberikan tambahan atas mahar tersebut atau mengurangi sebagian dari mahar itu. Sesungguhnya Allah Maha Mengetahui makhluk-Nya, tidak ada sesuatu pun yang luput dari pengetahuan-Nya, lagi Maha Bijaksana dalam pengaturan-Nya dan penetapan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Setelah Allah menyebutkan wanita-wanita yang tidak boleh dinikahi, Dia menambahkan ke dalam kelompok mereka wanita-wanita yang bersuami: Dan diharamkan bagi kalian menikahi wanita-wanita yang bersuami, kecuali wanita tawanan perang melawan orang-orang musyrik, mereka boleh untuk dinikahi setelah mereka melewati masa satu kali haid. Allah mewajibkan kalian untuk menikahi mereka. Allah menghalalkan bagi kalian wanita-wanita lain selain mereka yang telah disebutkan, untuk kalian mengeluarkan harta kalian untuk menikahi mereka dengan cara yang syar’i demi menjauhi perbuatan zina dan menjauhkan para wanita dari perbuatan itu. Mahar yang kalian berikan kepada wanita yang kalian nikahi adalah kewajiban yang harus kalian tunaikan. Jika suami hendak menambah jumlah mahar atau istri tidak mau mengambil mahar dengan suka rela maka hal itu tidak berdosa. Allah menetapkan syariat-syariat ini dengan ilmu dan kebijaksanaan-Nya, dan Dia menetapkan bagi kalian batas-batas yang membedakan antara halal dan haram."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَالْمُحْصَنٰتُ مِنَ النِّسَآءِ (wanita yang bersuami) Yakni yang mempunyai suami, mereka haram bagi selain suami mereka kecuali apabila telah mentalak mereka dan telah selesai masa iddahnya. إِلَّا مَا مَلَكَتْ أَيْمٰنُكُمْ ۖ (kecuali budak-budak yang kamu miliki) Yakni budak dari tawanan di medan perang, adapun apabila membeli budak wanita yang memiliki suami maka ia tidak halal baginya kecuali apabila suaminya menceraikannya. كِتٰبَ اللهِ عَلَيْكُمْ ۚ (sebagai ketetapan-Nya atas kamu) Yakni hukum yang tetap yang tidak boleh seorangpun mengubahnya. وَأُحِلَّ لَكُم مَّا وَرَآءَ ذٰلِكُمْ(Dan dihalalkan bagi kamu selain yang demikian) Yakni yang selain yang diharamkan dalam ayat yang telah disebutkan sebelumnya. أَن تَبْتَغُوا۟ بِأَمْوٰلِكُم(mencari isteri-isteri dengan hartamu) Yakni dihalalkan bagi kalian mencari istri dari wanita yang dihalalkan bagimu dengan mahar dari harta kalian yang halal; dan janganlah memakai harta tersebut untuk mencari yang haram. مُّحْصِنِينَ (untuk dikawini) Yakni orang-orang yang menjaga kehormatan dan menjauhi perbuatan zina, yang juga bermaksud dengan ikatan pernikahan itu sebagai penjaga kehormatan sang istri. غَيْرَ مُسٰفِحِينَ ۚ (bukan untuk berzina) Yakni yang bukan yang melakukan zina. فَمَا اسْتَمْتَعْتُم بِهِۦ مِنْهُنَّ(Maka isteri-isteri yang telah kamu nikmati (campuri) di antara mereka) Yakni yang kalian nikmati dari istri-istri kalian melalui jima’ dengan cara pernikahan yang sah secara agama. فَـَٔاتُوهُنَّ أُجُورَهُنَّ(berikanlah kepada mereka maharnya) Yakni mahar yang kamu relakan untuk mereka. Rasulullah telah melarang dan mengharamkan nikah mut’ah; diriwayatkan oleh Imam Bukhari dan muslim dari Ali bin Abi Thalib ia berkata: Rasulullah telah mengharamkan nikah mut’ah dan daging keledai pada perang Khaibar. Dan dikeluarkan oleh Imam Muslim dari Rabi’ bin Saburah dari ayahnya, saburah bin ma’bad bahwa ia saat itu ia bersama Rasulullah -yakni di perang fathu Makkah, ia bersabda: “Hai manusia, sesungguhnya dulu aku mengizinkan kalian untuk mengawini para wanita dengan nikah mut’ah, dan kini Allah telah mengharamkannya hingga hari kiamat, maka barangsiapa yang melakukan hal itu maka hendaklah ia meninggalkannya dan janganlah kalian mengambil apa yang telah kalian berikan kepada istri-istri yang kalian mut’ah”. فَرِيضَةً(sebagai suatu kewajiban) Yakni mahar adalah suatu kewajiban dari Allah yang harus ditunaikan untuk para istri. وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرٰضَيْتُم بِهِۦ مِنۢ بَعْدِ الْفَرِيضَةِ ۚ( dan tiadalah mengapa bagi kamu terhadap sesuatu yang kamu telah saling merelakannya, sesudah menentukan mahar itu) Yakni dengan menambah atau mengurangi mahar tersebut setalah akad nikah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Dan diharamkan atas kalian wanita-wanita yang telah menikah, baik yang muslimah atau tidak kecuali setelah selesainya masa iddah mereka karena ditinggal mati atau ditalak, serta para tawanan perang setelah habis masa haidnya. Dan kalian diperbolehkan untuk menikah dengan selain wanita-wanita yang disebutkan itu, yaitu menikahi wanita-wanita yang dihalalkan oleh Allah bagi kalian dengan mahar, untuk menjauhkan diri dari hal-hal yang diharamkan dalam pernikahan yang syar’i, dan tidak menjadi orang yang berzina. Dan apa yang kalian nikmati dari wanita itu dilakukan dengan pernikahan yang syar’i. Maka berilah mereka mahar yang kalian senangi. Mahar adalah suatu kewajiban dari Allah SWT (bagi suami) yang harus diberikan untuk para istri. Kalian tidak berdosa bila menambah atau mengurangi mahar, atau memberikannya secara keseluruhan atau dicicil. Sesungguhnya Allah Maha Mengetahui sesuatu yang baik bagi ciptaanNya dan Maha Bijaksana dalam tindakan dan aturanNya terkait hukum-hukum ini. Ayat ini turun terkait para tahanan perang yang memiliki suami, ketika para sahabat bertanya kepada Nabi SAW tentang mereka, lalu turunlah ayat {Wal muhshonaatu minannisaai illa maa malakat aimaanukum}. Adapun firman Allah SWT {Wa laa Junaaha ‘alaikum …} diturunkan terkait para lelaki yang harus membayar mahar, lalu salah satu dari mereka merasa kesulitan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wanita-wanita yang bersuami} diharamkan atas kalian wanita-wanita yang telah menikah {kecuali hamba sahaya perempuan yang kalian miliki} hamba sahaya yang kalian miliki dengan menawan mereka dalam jihad {sebagai ketetapan Allah atas kalian} Allah menetapkan itu untuk kalian {Dihalalkan bagi kalian selain yang demikian itu} selain wanita yang disebutkan Allah {yakni kalian mencari} mencari {dengan harta kalian untuk menikahinya} kalian memiliki niat murni dan membentengi diri dari hal-hal haram {bukan untuk berzina} bukan untuk berzina {Karena kenikmatan yang telah kalian dapatkan dari mereka} maka siapa saja yang mendapatkan kenikmatan dengan menikahi mereka {berilah mereka} berilah mereka {imbalan mereka} mahar mereka {sebagai suatu kewajiban. Tidak ada dosa bagi kalian mengenai sesuatu yang saling kalian ridhai sesudah menentukan kewajiban. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. dan diantara wanita-wanita yang diharamkan dinikahi adalah “dan (diharamkan juga kamu mengawini) wanita yang bersuami” yaitu wanita-wanita yang telah memiliki suami sesungguhnya diharamkan untuk menikahi mereka selama masih dalam pengayoman suami mereka hingga mereka diceraikan dan selesai masa iddah nya “kecuali budak-budak yang kamu miliki” yaitu (yang didapatkan) dari bagian tawanan perang, artinya bila seorang perempuan kafir yang bersuami tertawan, maka halal bagi kaum muslimin setelah perempuan itu dinyatakan terlepas dari kehamilan adapun bila seorang perempuan yang telah menikah dijual atau dihibahkan maka status pernikahan nya tidaklah batal, karena pemilik yang kedua (yang membelinya atau yang menerimanya) berposisis seperti posisi pemilik pertama (yaitu hanya pemilik) ini berdasarkan kisah budak perempuan barirah ketika nabi memberikannya pilihan firmanNya “Allah telah menetapkan hokum itu sebagai ketetapanNya atas kamu” yaitu konsistenlah padanya dan tetapilah ia sebagai petunjuk karena hal itu mengandung penyembuhan dan cahaya dan juga mengandung penjelasan secara rinci antara yang halal dan yang haram. Dan termasuk dalam firmanNya “dan dihalalkan bagi kamu selain yang demikian“ setiap perempuan yang tidak disebutkan dalam ayat tersebut adalah halal lagi baik, jadi yang haram itu terbatas sebagai sebuah kasih saying drai Allah dan rahat serta kemudahan bagi hamba firmanNya “yaitu mencari istri-istri dengan hartamu” yaitu kalian memilih perempuan yang menjadi pilihan dan kesukaan kalian dari perempuan-perempuan yang telah dihalalkan oleh Allah bagi kalian ketika kalian dalam keadaan “ingin mengawini mereka” yakni menjaga diri dari perzinaan dan menjaga diri dari istri-istri kalian “bukan untuk berzina” as-safhu adalah menumpahkan air sperma pada yang halal maupun yang haram, sesungguhnya pelaku hal tersebut (perzinaan) tidaklah dikatakan menjaga istrinya karena ia telah melampiaskan syahwatnya pada yang haram, hingga lemahlah hasratnya pada yang halal akhirnya ia tidak mampu menjaga dirinya untuk istrinya. di dalam ayat ini juga terdapat isyarat yang menunjukan bahwa orang yang tidak menjaga dirinya janganlah dinikahi.atas firmanNya “ laki-laki yang berzina tidak mengawini perempuan yang berzina, atau perempuan yang musyrik dan perempuan yang berzina tidak dikawani melainkan oleh laki-laki yang berzina atau laki-laki musyrik” “maka istri-isyri yang telah kamu nikmati (campuri) dianatara mereka” yaitu perempuan-perempuan yang telah kalian nikahi, ”berikanlah kepada mereka maharnya (dengan sempurna)“ yaitu imbalan sebagai suatu timbal balik (bolehnya) menikmati, oleh karena itu apabila seorang suami telah mencampuri istrinya, maka wajiblah atasnya memberikan mahar kepadanya, ”sebagai suatu kewajiban” maksudnya pemberian mahar yang dilakukan oleh kalian kepada mereka adalah sebuah kewajiban yang telah diwajibkan oleh Allah atas kalian dan bukan bentuk penghibahan di mana bila mau ia membayarkannya dan bila menghendaki ia menahannya, atau arti dari firman Allah “sebagai suatu kewajiban” yaitu yang telah ditentukan di mana kalian telah menenttukannya, maka wajiblah atas kalian (untuk membayarnya) dan janganlah kalian kurangi darinya sedikitpun. “dan tidalah mengapa bagi kamu terhadap sesuatu yang kamu telah saling merelakannya” yaitu dengan tambahan oleh pihak suami atau pengguguran dari pihak istri atas dasar keridhaan dan kerelaan jiwa inilah pendapat dari sebagian besar para ulama ahli tafsir dan sebagain besar dari mereka berkata bahwa sesungguhnya ayat ini turun untuk menerangkan tentang nikah mut’ah terhadap perempuan dimana pada awal-awal islam hukumnya adalah halal, kemudian nabi mengharamkannya bahwa beliau memerintahkan agar menentukan waktu dan maharnya, kemudian bila telah berlalu masa yang ada diantara keduanya dan mereka berdua saling ridha setelah menentukan mahar tersebut, maka itu tidaklah haram bagi mereka berdua, “sesungguhnya Allah maha mengetahui lagi mahabijaksana” yaitu ilmu yang sempurna dan luas serta hikmah yang sempurna, dan diantara ilmu dan hikmahNya adalah Allah hokum-hukum yang menjelaskan secara terperinci anatara halal dan haram."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻭاﻟﻤﺤﺼﻨﺎﺕ} wah muhshonaat: muhshonaat bentuk jamak dari muhsonah, yang dimaksud di sini adalah wanita yang menikah. {ﺇﻻ ﻣﺎ ﻣﻠﻜﺖ ﺃﻳﻤﺎﻧﻜﻢ} illa ma malakat iamaanukum hamba sahaya yang diperoleh dengan cara perang atau jual beli. {ﻣﺎ ﻭﺭاء ﺫﻟﻜﻢ} ma waraa adzalikum: yang setelahnya, yaitu setelah apa yang diharamkan bagi kalian. {ﻏﻴﺮ ﻣﺴﺎﻓﺤﻴﻦ} ghaira musaafihiin: Al Musafih bermakna pezina. Karena kata sifah artinya zina. {ﺃﺟﻮﺭﻫﻦ ﻓﺮﻳﻀﺔ} ujurahunna faridhoh: mahar mereka pemberian yang wajib. Makna ayat: Masih dalam latar belakang tentang hal yang dapat mengharamkan pernikahan dan apa yang membolehkannya. Di dalam ayat 24 Allah menyambungkan dengan kata konjungsi ‘و’ (dan) para wanita mahram karena semenda dengan wanita yang menikah {ﻭاﻟﻤﺤﺼﻨﺎﺕ}, ialah yang mempunyai suami. Tidaklah halal menikahi wanita-wanita yang menikah kecuali setelah terjadinya perpisahan antara sang wanita dengan suami dengan cara perceraian ataupun kematian dan setelah selesai dari iddah juga. Allah mengecualikan istri-istri dari kalangan hamba sahaya, ialah wanita yang didapat dari rampasan perang yang sesuai dengan syariat, yaitu jihad di jalan Allah. Dan dalam hal ini diperbolehkan walaupun suami dari wanita rampasan perang ini belum mati di medan perang, putus sudah hubungan sang wanita dengan suaminya dan keluarganya dengan terjunnya si suami ke medan perang serta si perempuan telah menjadi budak. Allah Ta’ala mengizinkan sebagai bentuk kasih sayang kepada si budak dengan bolehnya pernikahan dengan tuan yang memilikinya. Oleh karenanya turun ayat ini berkaitan dengan para perempuan tawanan perang Authos, perang yang terjadi setelah perang Hunain. Kaum muslimin menawan para wanita dan keturunannya, maka para muslimin merasa sungkan untuk mendatangi para perempuan itu. Di antara para tawanan itu ada wanita yang menikah, maka diperbolehkan bagi kaum muslimin untuk mendekati mereka setelah perempuan tawanan masuk Islam dan tidak menggaulinya setelah mereka datang haid dan selesai haidh. Adapun bagi wanita tawanan yang belum masuk Islam, maka tidaklah halal bagi kaum muslimin karena mereka itu adalah wanita musyrik, ini adalah makna ayat firman Allah: {ﻭاﻟﻤﺤﺼﻨﺎﺕ ﻣﻦ اﻟﻨﺴﺎء ﺇﻻ ﻣﺎ ﻣﻠﻜﺖ ﺃﻳﻤﺎﻧﻜﻢ} “dan para muhshonnah dari kaum wanita kecuali para hamba sahaya kalian” Dan firman Allah {ﻛﺘﺎﺏ اﻟﻠﻪ ﻋﻠﻴﻜﻢ} yang dimaksud Allah adalah apa yang diharamkan dalam pernikahan telah ditulis olehNya dan diwajibkan kepada kaum muslimin kewajiban yang harus dan tidak boleh dilalaikan atau digampangkan. Allah berfirman: {ﻭﺃﺣﻞ ﻟﻜﻢ ﻣﺎ ﻭﺭاء ﺫﻟﻜﻢ} “Dan dihalalkan untuk kalian yang selain itu”, maksudnya adalah apa yang diharamkan oleh Allah dari para mahram karena nasab dan persusuan serta semenda dengan syarat tidak lebih dari empat istri. Hal ini gamblang dari firman Allah {ﻣﺜﻨﻰ ﻭﺛﻼﺙ ﻭﺭﺑﺎﻉ} “dua-dua, tiga-tiga atau empat-empat” dan firman yang lain disebutkan {ﺃﻥ ﺗﺒﺘﻐﻮا ﺑﺄﻣﻮاﻟﻜﻢ ﻣﺤﺼﻨﻴﻦ ﻏﻴﺮ ﻣﺴﺎﻓﺤﻴﻦ} maksudnya adalah tidaklah mengapa dengan harta kalian untuk mencari istri dari wanita-wanita yang selain diharamkan Allah, maka menikahlah degan wanita yang baik bagi kalian sesuai dengan keadaan kalian dari kalangan wanita-wanita yang menjaga diri (muhshon) dan tidak mempunyai laki-laki simpanan. Pernikahan ini diharuskan dengan menyempurnakan syarat-syarat pernikahan yang terdiri dari wali, mahar, akad dan saksi. Maka pernikahan yang tidak terpenuhi syarat-syarat ini adalah zina. Allah berfirman {ﻓﻤﺎ اﺳﺘﻤﺘﻌﺘﻢ1 ﺑﻪ ﻣﻨﻬﻦ ﻓﺂﺗﻮﻫﻦ ﺃﺟﻮﺭﻫﻦ ﻓﺮﻳﻀﺔ} “yang kalian nikmati dari para wanita, maka berikanlah mahar hak wajib mereka” Allah menghendaki setiap laki-laki yang menikahi seorang wanita dan bersetubuh dengannya, sang wanita wajib mendapatkan mahar tunai. Adapun jika belum berhubungan badan dengan sang wanita dan diceraikan, maka si wanita tidak mendapatkan kecuali setengah dari mahar yang telah disebutkan. Andai maharnya belum disebutkan, maka tiada mahar bagi si wanita tapi hanya sekedar mut’ah. Dan maksud dari ayat : {ﻓﻤﺎ اﺳﺘﻤﺘﻌﺘﻢ ﺑﻪ ﻣﻨﻬﻦ} kalian telah bersetubuh dengan mereka. Allah berfirman: {ﻭﻻ ﺟﻨﺎﺡ ﻋﻠﻴﻜﻢ ﻓﻴﻤﺎ ﺗﺮاﺿﻴﺘﻢ ﺑﻪ ﻣﻦ ﺑﻌﺪ اﻟﻔﺮﻳﻀﺔ} maksudnya adalah jika seorang laki-laki memberikan mahar kepada istrinya, dan maharnya berupa mahar yang tunai (bukan utang/kurang), maka tidaklah keduanya (suami-istri) untuk sungkan dalam hal kerelaan mahar dari istri untuk digunakan suaminya, diakhirkan dan dihibahkan semua maharnya atau sebagian. Karena itu mahar itu adalah hak si istri dan dialah yang memilikinya seperti disebutkan dalam ayat yang lalu {ﻓﺈﻥ ﻃﺒﻦ ﻟﻜﻢ ﻋﻦ ﺷﻲء ﻣﻨﻪ ﻧﻔﺴﺎ ﻓﻜﻠﻮﻩ ﻫﻨﻴﺌﺎ ﻣﺮﻳﺌﺎ}. “Kemudian jika mereka menyerahkan kepada kamu sebagian dari maskawin itu dengan senang hati, maka makanlah (ambillah) pemberian itu (sebagai makanan) yang sedap lagi baik akibatnya” Allah berfirman : {ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﻋﻠﻴﻤﺎ ﺣﻜﻴﻤﺎ} “Allah Maha Mengetahui dan Maha Bijak”, maksudnya adalah memberikan pemahaman kepada kaum mukminin bahwasanya Allah itu Maha Mengetahui terhadap keadaan mereka dan Maha Bijak dalam menentukan syariat. Hendaklah kaum mukminin menerima syariat saat dalam keadaan biasa maupun saat mendapat keringan dari Allah. ٍSesungguhnya syariat Allah memperhatikan sisi kasih sayang dan keadilan. Betapa indahnya syariat yang berdiri di atas prinsip kasih sayang dan keadilan. Ini adalah yang tercangkup dalam ayat pertama (nomor 24). Pelajaran dari Ayat: • Wanita yang sudah menikah haram untuk dinikahi orang lain sampai wanita itu berpisah dengan suaminya dengan cara talak ataupun kematian dan sampai selesai masa iddahnya. • Diperbolehkannya menikahi seorang hamba sahaya walaupun suami sang budak itu hidup dalam medan perang jika si budak sudah masuk islam, karena Islam adalah hal yang memisahkan dia dan suaminnya. • Wajibnya mahar, dan diperbolehkan kepada sorang perempuan untuk memberikan kepada istrinya sesuatu dari maharnya itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 24: Dan (diharamkan atas kamu) orang-orang yang bersuami dari perempuan-perempuan, kecuali siapa- siapa yang dimiliki oleh tangan kanan kamu sébagai satu ketetapan Allah atas kamu; dan dihalalkan bagi kamu orang-orang lain dari yang (tersebut) itu, buat kamu cari (isteri) dengan harta-harta kamu, padahal berkawin, bukan berzina. Maka siapa-siapa yang kamu mau campuri dari perempuan-pe- rempuan itu, hendaklah kamu beri kepada mereka maskawin mereka sebagai satu kewajiban; tetapi tidak mengapa kamu beridla-ridlaan sesudah ketentuan, karena sesungguhnya Allah itu Pengetahui, Bijaksana ."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dari Abu Sa'id Al Khudriy, bahwa Rasulullah shallallahu 'alaihi wa sallam pada peperangan Hunain mengirim pasukan ke Awthas, di sana mereka bertemu musuh dan berperang sehingga mereka memperoleh kemenangan serta mendapatkan para tawanan. Nampaknya sebagian sahabat Rasulullah shallallahu 'alaihi wa sallam merasa berdosa menggauli wanita yang tertawan karena masih ada suami-suami mereka yang musyrik, maka Allah Azza wa Jalla menurunkan firman Allah Ta'ala, \"Dan (diharamkan juga kamu menikahi) perempuan yang bersuami, kecuali budak-budak perempuan (tawanan perang) yang kamu miliki\", yakni mereka (tawanan perang yang perempuan) halal bagi kamu apabila telah selesai 'iddahnya.\" Iddahnya adalah dengan melahirkan jika hamil atau mengalami sekali haidh jika tidak hamil. Sampai mereka dicerai dan habis masa 'iddahnya. Maksudnya: budak-budak yang dimiliki yang suaminya tidak ikut tertawan bersamanya, maka kamu boleh menjima'i mereka meskipun mereka bersuami, namun dengan syarat setelah istibra' (pengosongan rahim, baik dengan melahirkan jika sebelumnya hamil atau dengan sekali haidh jika tidak hamil). Jika budak yang bersuami tersebut dijual atau dihibahkan meskipun halal dijima'i oleh pembeli atau penerima hibah, namun pernikahannya tetap tidak batal karena pemilik yang kedua hanya menduduki posisi pemilik pertama, juga berdasarkan hadits Barirah yang diberikan pilihan oleh Nabi shallallahu 'alaihi wa sallam, wallahu a'lam. Maka ikutilah dan jadikanlah petunjuk, karena di dalamnya terdapat obat penyembuh dan nur (cahaya), dan di dalamnya terdapat perincian tentang yang halal dan yang haram. Maksudnya selain wanita-wanita yang disebutkan dalam surat An Nisaa' ayat 23 dan 24. Oleh karena itu, yang haram terbatas, sedangkan yang halal tidak terbatas, wal hamdulillah. Berdasarkan ayat ini, maka ketika istri telah dijima'i, maka mahar menjadi tetap (wajib diberikan). Misalnya menambah, mengurangi atau tidak membayar sama sekali maskawin yang telah ditetapkan. Sebagian ahli tafsir menafsirkan bahwa ayat ini turun berkenaan dengan nikah mut'ah yang pada awal Islam dihalalkan, kemudian diharamkan oleh Nabi shallallahu 'alaihi wa sallam. Di dalam nikah mut'ah ditetapkan waktunya dan maharnya, ketika waktunya habis, lalu di antara keduanya ada yang merelakan mahar dengan menggugurkannya, maka hal itu tidak mengapa, wallahu a'lam. Allah Maha luas ilmu-Nya dan Maha sempurna hikmah (kebijaksanaan)-Nya. Di antara ilmu-Nya dan hikmah-Nya adalah menetapkan syari'at-syari'at bagi manusia dan menetapkan batasan-batasan yang memisahkan antara yang halal dengan yang haram."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 24",
    "description": "Bila pada ayat yang lalu Allah melarang pernikahan yang menghimpun dua atau lebih perempuan bersaudara, maka ayat ini melarang seorang istri dinikahi oleh dua orang laki-laki. Dan diharamkan juga kamu menikahi perempuan yang sudah bersuami, kecuali hamba sahaya perempuan bersuami yang secara khusus kamu dapatkan melalui tawanan perang ketika suaminya tidak ikut tertawan, yang kemudian kamu miliki. Pengharaman itu sebagai ketetapan Allah atas kamu. Dan dihalalkan bagimu selain perempuan-perempuan yang demikian itu, yakni selain perempuan yang disebutkan oleh ayat sebelum ini, jika kamu berusaha bersungguh-sungguh membayar mahar dengan hartamu untuk menikahinya bukan dengan maksud untuk berzina. Maka karena kenikmatan yang telah kamu dapatkan dari mereka, istri-istri itu, segera berikanlah maskawinnya dengan sempurna kepada mereka sebagai suatu kewajiban yang harus kamu tunaikan. Tetapi tidak mengapa, artinya kamu tidak berdosa, wahai para suami, jika ternyata di antara kamu sebagai suami istri telah saling merelakannya, sebagian mahar atau keseluruhannya, setelah ditetapkan kewajiban pembayaran mahar itu secara bersama. Sungguh, Allah maha mengetahui, mahabijaksana. Dan barang siapa di antara kamu, wahai kaum muslim, yang tidak mempunyai biaya yang dapat dipergunakan sebagai perbelanjaan untuk menikahi perempuan merdeka yang beriman, maka dihalalkan menikahi perempuan yang beriman dari hamba sahaya yang bukan kamu miliki tetapi dimiliki oleh saudaramu sesama muslim. Allah mengetahui keimanan yang ada dalam hati-Mu sekalian. Janganlah kamu selalu mempersoalkan masalah keturunan, karena sebagian dari kamu adalah saudara dari sebagian yang lain sama-sama keturunan adam dan hawa. Karena itu, bila kamu benar-benar tidak mampu menikahi perempuanperempuan merdeka, maka nikahilah mereka, yakni perempuan-perempuan hamba sahaya itu, dengan izin tuan yang memiliki-Nya dan berilah mereka maskawin yang pantas sesuai dengan yang berlaku di kalangan masyarakat dan kondisi hamba sahaya pada waktu itu, yang tidak memberatkan kamu dan tidak pula merugikan si perempuan dan tuannya, karena mereka adalah perempuan-perempuan yang memelihara kesucian diri mereka, bukan pezina dan bukan pula perempuan yang mengambil laki-laki lain sebagai piaraannya yang mereka sembunyikan. Apabila mereka telah berumah tangga atau bersuami, tetapi masih saja melakukan perbuatan keji dengan berbuat zina yang terbukti secara hukum, maka berilah hukuman bagi mereka yang besarnya setengah dari apa, yakni hukuman perempuan-perempuan yang merdeka dan bersuami. Kebolehan menikahi hamba sahaya itu adalah izin bagi orang-orang yang takut terjatuh terhadap kesulitan dalam upaya menjaga diri dari perbuatan zina. Tetapi jika kamu bersabar dengan cara menahan diri agar tidak berzina atau menikahi hamba sahaya, itu lebih baik bagimu daripada menikahi mereka. Allah maha pengampun, maha penyayang."
  }
]