[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa yang tidak berkemampuan baginya untuk membayar mahar-mahar wanita-wanita meredeka yang beriman, maka dia boleh menikahi selain wanita merdeka dari budak-budak wanita yang beriman. Dan Allah Maha mengetahui hakikat keimanan kalian. Sebagian kalian itu berasal dari sebagian yang lain, maka nikahilah mereka dengan persetujuan dari keluarga/pemiliknya, dan berikanlah kepada mereka mahar mereka dengan jumlah yang sesuai dengan keridoan diantara kalian dengan kerelaan hati dari kalian, sedang mereka adalah wanita-wanita yang memelihara kehormatan diri mereka dari perbuatan haram,bukan wanita-wanita yang dengan terang-terangan berbuat zina, serta bukan wanita-wanita yang diam-diam mengambil lelaki-lelaki simpanan. Apabila mereka sudah menikah dan kemudian melakukan perbuatan zina, maka mereka dikenakan hukuman (dera bukan rajam) setengah hukuman dari hukuman wanita-wanita meredeka. Ketetapan yang diperbolehkan untuk menikahi wanita-wanita hamba sahaya dengan sifat-sifat di atas, hanyalah diperbolehkan bagi orang yang merasa takut dirinya akan terjerumus kedalam perzinaan dan dia mengalami kesulitan berat untuk menahan hasrat berhubungan badan. Dan bersabar menahan hasrat menikahi hamba sahaya wanita itu disertai dengan menjaga kehormatan lebih baik dan lebih utama. Dan Allah Maha pengampun terhadap kalian,juga Maha penyayang kepada kalian, lantaran mengizinkan kalian menikahi wanita-wanita hambasahaya ketika kondisi tidak memungkinkan menikahi wanita-wanita merdeka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Barangsiapa di antara kalian -wahai para lelaki merdeka- yang tidak mampu menikahi wanita-wanita merdeka karena minimnya harta yang dimiliki, ia boleh menikahi budak-budak wanita milik orang lain. Dengan syarat apabila secara lahiriah mereka terlihat sebagai wanita-wanita beriman. Sedangkan Allah Maha Mengetahui hakikat iman dan kondisi batin mereka. Sementara kalian dan mereka (budak-budak wanita) itu memiliki kesamaan dalam hal agama dan kemanusiaan. Maka janganlah kalian merasa enggan untuk menikahi mereka. Nikahilah mereka dengan seizin tuan-tuan pemilik mereka, dan berikanlah mahar mereka tanpa mengurangi atau menunda-nunda. Ini jika mereka (budak-budak wanita) tersebut merupakan wanita-wanita yang pandai menjaga kehormatan mereka, bukan wanita-wanita yang berzina secara terang-terangan, dan bukan wanita-wanita simpanan untuk diajak berzina secara sembunyi-sembunyi. Apabila budak-budak wanita itu telah menikah, kemudian mereka berbuat zina, maka hukumannya setengah dari hukuman wanita-wanita merdeka. Yaitu lima puluh kali cambuk, dan tidak ada hukuman rajam bagi mereka. Berbeda dengan (hukuman bagi) wanita-wanita merdeka yang berbuat zina. Ketentuan diperbolehkannya menikah dengan budak-budak wanita yang beriman dan pandai menjaga kehormatannya itu adalah rukhsah (keringanan) bagi orang yang khawatir dirinya terjerumus ke dalam perbuatan zina dan tidak mampu menikah dengan wanita-wanita merdeka. Namun bersabar (menahan diri) untuk tidak menikah dengan budak-budak wanita itu lebih baik. Karena hal itu dapat menghindarkan munculnya anak-anak berstatus budak. Dan Allah Maha Pengampun bagi hamba-hamba-Nya yang bertaubat lagi Maha Penyayang kepada mereka. Salah satu bentuk kasih sayang-Nya ialah Dia menganjurkan mereka menikah dengan budak-budak wanita tatkala mereka tidak mampu menikah dengan wanita-wanita merdeka, sementara mereka khawatir terjerumus ke dalam perbuatan zina (bila mereka tidak segera menikah)."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Jika lelaki muslim yang merdeka tidak memiliki mahar untuk menikahi wanita muslimah yang merdeka, dan ia takut akan terjerumus ke dalam perbuatan zina akibat gejolak syahwat yang kuat, maka boleh baginya menikahi budaj wanita yang beriman. Karena perkara keimanan merupakan perkara yang ada dalam hati yang tidak dapat diketahui selain Allah, maka Allah menjelaskan bahwa pemilihan budak wanita yang beriman cukup dengan menilainya secara zahir saja, meski harus tetap bersungguh-sungguh dalam melihat keteguhannya beragama. Pernikahan dengan budak wanita harus dengan izin dari tuannya, tanpa izinnya maka pernikahan itu tidak sah. Budak wanita juga memiliki hak mendapatkan mahar sebagaimana hak wanita yang merdeka. Dan tidak boleh menikahi budak wanita kecuali yang suci dari perbuatan zina dan tidak memiliki kekasih simpanan. Jika budak wanita menikah kemudian terjerumus ke dalam perbuatan zina, maka harus ditegakkan had sebagaimana wanita merdeka yaitu hukuman cambuk dengan jumlah yang telah ditentukan. Allah menentukan hukum-hukum ini sebagai bentuk kasih sayang, kebaikan, dan kemurahan-Nya kepada hamba-hamba-Nya, sehingga Dia tidak mempersempit urusan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلًا (Dan barangsiapa diantara kamu (orang merdeka) yang tidak cukup perbelanjaannya) Yakni kekayaan dan kelapangan harta yang menjadikannya mampu untuk menikahi wanita Muslimah yang merdeka. فَمِن مَّا مَلَكَتْ أَيْمٰنُكُم مِّن فَتَيٰتِكُمُ الْمُؤْمِنٰتِ ۚ (ia boleh mengawini wanita yang beriman, dari budak-budak yang kamu miliki) Yakni ia diperbolehkan untuk menikahi budak wanita Muslimah yang dimiliki orang lain, namun apabila ia mampu untuk menikahi wanita Muslimah yang merdeka maka haram baginya untuk menikahi budak wanita, dan tidak dibolehkan baginya menikahi budak wanita dari ahli kitab karena tidak termasuk wanita yang beriman. وَاللهُ أَعْلَمُ بِإِيمٰنِكُم ۚ( Allah mengetahui keimananmu) Maka janganlah kalian enggan untuk menikahi budak jika memang tidak ada jalan lain, kerena keimanan sebagian budak lebih baik dari pada keimanan sebagian orang yang merdeka. بَعْضُكُم مِّنۢ بَعْضٍ ۚ( sebahagian kamu adalah dari sebahagian yang lain) Karena mereka semua merupakan anak keturunan Nabi Adam. فَانكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ(karena itu kawinilah mereka dengan seizin tuan mereka) Sehingga tidak dihalalkan menikahi budak wanita kecuali atas izin pemiliknya. وَءَاتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ(dan berilah maskawin mereka menurut yang patut) Yakni tunaikanlah pembayaran mahar kepada mereka sesuai dengan syari’at yang berlaku dan adat yang baik. مُحْصَنٰتٍ(sedang merekapun wanita-wanita yang memelihara diri) Yakni yang menjaga kehormatan diri mereka. غَيْرَ مُسٰفِحٰتٍ(bukan pezina) Yakni yang tidak mengumumkan untuk mengajak berbuat zina. ولا متخذات أخدان (dan bukan (pula) wanita yang mengambil laki-laki lain sebagai piaraannya) Yakni yang berzina dengan seseorang secara rahasia. Dahulu orang-orang arab menganggap aib wanita yang mengumumkan untuk mengajak berzina dan tidak menganggap aib orang yang mengajak berzina secara rahasia, maka Islam mengharamkan hal itu. فَإِذَآ أُحْصِنَّ (dan apabila mereka telah menjaga diri dengan kawin) Yakni ketika telah menikah. Secara tekstual ayat ini menunjukkan bahwa budak wanita yang berzina sedangkan ia belum menikah maka tidak mendapatkan hukum had dan hanya dihukum pukulan sebagai bentuk pelajaran baginya; namun dalam hadist disebutkan bahwa ia harus dihukum had sebagaimana yang lain. Dalam shahih Imam Bukhari dan Muslim dari abu Hurairah bahwa Rasulullah bersabda: apabila budak wanita milik salah satu diantara kalian berzina maka cambuklah ia sesuai hukum had, dan janganlah kalian mencerca dan mengolok-oloknya. فَإِنْ أَتَيْنَ بِفٰحِشَةٍ(kemudian mereka melakukan perbuatan yang keji) Yakni berupa perbuatan zina. فَعَلَيْهِنَّ نِصْفُ مَا عَلَى الْمُحْصَنٰتِ(maka atas mereka separo hukuman dari hukuman wanita-wanita merdeka yang bersuami) Yakni hukuman 50 kali cambukan, karena hukuman bagi yang merdeka adalah 100 kali cambukan. ذٰلِكَ لِمَنْ خَشِىَ الْعَنَتَ مِنكُمْ ۚ( itu, adalah bagi orang-orang yang takut (dari perbuatan zina) di antara kamu) Yakni dibolehkannya menikahi budak wanita adalah sebagai rukhshah (keringanan) bagi orang yang sulit menjaga diri kerena ia tidak bisa menyalurkan syahwatnya melalui pernikahan dengan wanita merdeka. وَأَن تَصْبِرُوا۟( dan kesabaran) Yakni bersabar untuk tidak menikahi budak wanita. خَيْرٌ لَّكُمْ ۗ (lebih baik bagimu) Yakni lebih baik daripada menikahi mereka, karena menikahi mereka dapat menyebabkan terjebaknya anak dalam perbudakan dan kerendahan diri."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara ilmu tafsir yang membantu dalam tadabbur al-Qur'an adalah : ilmul wujuh dan ilmu nazhoir, yaitu : ilmu yang mempelajari makna-makna kata dari konteks yang berbeda, perhatikan firman Allah : { وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلًا أَنْ يَنْكِحَ الْمُحْصَنَاتِ } makna المحصنات disini bias difahami sebagai : wanita-wanita merdeka, dan dapat juga difami sebagai : wanita-wanita yang rendah hati, dan makna dari { أُحْصِنَّ } adalah : menjaga diri dengan menikah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Dan barangsiapa tidak memiliki harta untuk menikahi wanita merdeka yang muslimah dan beriman, maka dia diperbolehkan untuk menikahi budak perempuan yang beriman, bukan yang musyrik dan ahli kitab, karena Allah lebih tahu tentang hakikat keimanan kalian, maka janganlah enggan untuk menikahi para budak wanita ketika dalam keadaan darurat karena kalian semua adalah makhluk yang diciptakan dari satu jiwa yaitu Adam AS, dan kalian sama dalam urusan agama. Maka nikahilah para budak wanita itu dengan ijin wali-wali mereka, dan berilah mereka mahar dengan baik sesuai syariat dan adat yang mana sama-sama rela, dan keadaan mereka adalah suci, bukan pezina, wanita yang mengambil para lelaki yang mengajaknya berzina secara sembunyi-sembunyi, dan bukan pula wanita yang memiliki simpanan, yaitu wanita yang berzina dengaan seorang lelaki secara rahasia. Bangsa Arab itu menyalahkan pengakuan zina, bukan yang menyembunyikannya. Dan apabila para budak wanita itu telah menjaga diri dengan menikah, lalu apabila mereka terpaksa berzina, maka mereka harus menerima separuh hukuman wanita yang merdeka, yaitu 50 cambukan saja, karena batas cambukan bagi wanita yang merdeka adalah 100 cambukan. Adapun para pezina dari golongan budak yang tidak menjaga diri, maka tidak ada, melainkan hanya untuk mendisiplinkan. Pembolehan untuk menikahi budak wanita itu bagi kalian yang takut terjerumus dalam perzinaan (Al-‘Anata adalah keadan tidak nyaman, dan takut terjerumus dalam dosa), dan bersabar untuk tidak menikahi budak itu lebih baik bagi kalian untuk menjaga kebebasan keturunan, dan Allah itu Maha Pengampun dosa hamba-hambaNya yang mau bertaubat, dan Maha Pengasih bagi mereka dengan memudahkan pengampunan tersebut untuk mereka. Namun mulai tahun 1952, negara-negara modern membuat perjanjian untuk mengakhiri perbudakan di seluruh dunia, dan islam setuju dengan hal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja di antara kalian yang tidak mempunyai biaya} kelapangan dan kemampuan {untuk menikahi perempuan merdeka} perempuan merdeka {yang mukmin, maka perempuan mukmin dari para hamba sahaya yang kalian miliki} hamba sahaya kalian {yang beriman. Allah lebih tahu tentang keimanan kalian. Sebagian kalian adalah sebagian dari yang lain} kalian dan mereka itu sama dalam agama {Maka nikahilah mereka dengan izin keluarga mereka} wali mereka {dan berilah mereka mahar} mahar mereka {dengan cara yang pantas, dengan memelihara kesucian diri} menjaga kesucian {bukan pezina} bukan wanita yang berzina {dan bukan perempuan yang mengambil laki-laki lain sebagai kekasih} laki-laki yang berzina dengan mereka secara sembunyi-sembunyi {Apabila mereka telah menikah} menikah {tetapi melakukan perbuatan keji, atas mereka adalah setengah dari hukuman} hukuman {perempuan-perempuan merdeka} perempuan yang merdeka {Hal itu bagi orang-orang yang takut terhadap dosa} zina {di antara kalian. Kesabaran kalian lebih baik bagi kalian. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. yaitu barangsiapa yang tidak mampu memberikan belanja maksudnya adalah mahar untuk menikahi wanita-wanita merdeka, artinya wanita-wanita mukminat yang merdeka, dan ia khawatir dirinya terjerumus kedalam kebinasaan yaitu perbuatan zina dan kesulitan yang banyak, maka boleh baginya menikahi budak wanita yang beriman, hal ini menurut apa yang Nampak secara lahiriyah, dan bila tidak demikian, maka Allah dalah lebih mengetahui tentang seorang mukmin, yang benar dari selainnya, karena perkara-perkara dunia dibangun atas dasr apa yang Nampak sedangkan perkara-perkara dunia dibangun atas dasar apa yang Nampak, sedangkan perkara-perkara akhirat dibangun atas dasar apa yang ada dalam batin, ”karena itu kawinilah mereka” yaitu budak-budak beriman, ”dengan seizin tuan mereka” yaitu tuan mereka, baik satu orang atau lebih. “dan berilah maskawin mereka menurut yang patut” maksudnya, walaupun mereka itu adalah budak-budak wanita, sebagaimana mahar itu wajib bagi wanita merdeka, demikian pula mahar wajib bagi wanita budak, akan tetapi tidak dibolehkan menikahi budak wanita kecuali bila mereka, ”memelihara diri” yaitu menjaga diri mereka dari perbuatan zina”bukan pezina” yaitu pelacur secara terang-terangan “dan bukan (pula) wanita yang mengambil laki-laki lain sebagai piaraannya” yaitu kekasih rahasia. Pada intinya, seorang muslim yang merdeka tidak boleh menikahi seorang budak wanita kecuali dengan empat syarat yang telah disebutkan oleh Allah yaitu; keimanan mereka, pemeliharaan diri, baik secara lahir maupun batin, ketidakmampuan dalam memberikan mahar kepada wanita merdeka dan khawatir akan perzinaan. Bila syarat-syarat tersebut terpenuhi maka boleh baginya menikahi budak wanita walaupun demikian kesabaran untuk tidak menikahi mereka adalah lebih utama, karena pernikahan itu akan menjatuhkan anak-anak nya kedalam perbudakan, sebagaimana juga pernikahan itu mengandung kehinaan dan aib. akan tetapi yang demikian itu bila ia mampu bersabar. namun bila ia tidak mampu bersabar dari hal yang haram kecuali harus menikahi budak wanita, maka harus ia lakukan, karena itulah Allah berfirman “dan kesabaran itu lebih baik bagimu dan Allah maha pengampun lagi Maha penyayang” Dan firmanNya “dan apabila mereka telah menjaga diri dengan kawin” maksudnya, apabila para budak wanita itu telah menikah atau masuk islam, maka mereka mendapatkan setengah dari apa yang ditanggung oleh wanita-wanita merdeka mendapatkan setengah dari apa yang ditanggung oleh wanita-wanita merdeka yang telah bersuami, ”dari hukuman” yang demikian itu adalah perkara yang mungkin dibagi dua yaitu cambuk, karena itu hukuman mereka adalah lima puluh kali cambukan, sedangkan hokum rajam tidak berlaku untuk budak wanita, karena rajam tidak dapat di bagi dua maka atas dasar pandangan pertama; apabila mereka belum menikah maka tidak ada had, atas mereka, hanya saja mereka harus diberikan hukuman yang membuat mereka jera agar tidak kembali pada perbuatan keji tersebut, sedangkan atas dasar pandangan kedua; sesungguhnya budak wanita selain muslimah apabila melakukan perbuatan keji harus diberikan hukuman juga. Ayat ini ditutup dengan dua nama Allah yang mulia yaitu yang maha pengampun lagi maha penyayang, hal itu karena ketetapan-ketetapan tersebut di atas merupakan rahmat bagi seluruh manusia, sebuah karunia, dan kebaikan untuk mereka, karena Allah tidak akan mempersulit mereka, akan tetapi Allah akan memberikan kelapangan kepada mereka dengan seluas-luasnya. dan kemungkinan dalam penyebutan ampunan setelah penyebutan had merupakan suatu indikasi bahwa had-had tersebut merupakan pengugur dosa, dimana Allah akan mengampuni dosa-dosa hamba-hambaNya dengan had-had tersebut seagaimana yang dijelaskan dalam hadits tentang hal tersebut. Dan hukum seorang budak laki-laki dalam perkara had tersebut adalah sama seperti hukum budak wanita, karena tidak ada perbedaan antara kedua jenis tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻃﻮﻻ} thouula: keluasan dan kemampuan untuk membayar mahar {اﻟﻤﺤﺼﻨﺎﺕ} muhshonaat: afifah para wanita yang menjaga diri {ﺃﺟﻮﺭﻫﻦ} ujuuruhunna: mahar mereka {ﻭﻻ ﻣﺘﺨﺬاﺕ ﺃﺧﺪاﻥ} wala muttakhizdati akhdaan: laki-laki idaman lain (tanpa ada ikatan pernikahan). {ﻓﺈﺫا ﺃﺣﺼﻦ} faizda uhsinna: dengan masuk Islam atau menikah, jadi makna ihshon di sini adalah keduanya (wanita Islam dan sudah menikah). {اﻟﻌﻨﺖ} Al ‘anat: Adh Dhoror (menciderai) agama dan adat. Makna ayat : Adapun ayat 25 {وَمَنْ لَمْ يَسْتَطِعْ مِنْكُمْ طَوْلاً ... 3} “Dan barangsiapa diantara kamu (orang merdeka) yang tidak cukup hartanya...” telah mencakup rahmat kasih sayang Allah kepada para hamba-Nya, tatkala seorang mukmin tidak dapat menikahi wanita merdeka karena kemampuan ekonominya kurang dan kekhawatiran adanya mudarat dalam agama (seperti berzina) atau fisiknya (dengan dikenai vonis hukum had). Diberikan keringan oleh Allah dengan bolehnya menikahi seorang wanita hamba sahaya dengan syarat dia adalah seorang mukminah, diizinkan menikah oleh majikannya dan diberi mahar. Dengan terpenuhi hal-hal tersebut telah sempurna standar ihshon, yaitu menikah dengan terpenuhi syarat-syaratnya dan bukan termasuk zina terang-terangan yang diisyaratkan dalam firman Allah {ﻏﻴﺮ ﻣﺴﺎﻓﺤﺎﺕ} dan bukan pula zina yang tersembunyi seperti yang disebutkan Allah {ﻭﻻ ﻣﺘﺨﺬاﺕ ﺃﺧﺪاﻥ}, yaitu pacar. Ini adalah makna dari firman Allah {ﻭﻣﻦ ﻟﻢ ﻳﺴﺘﻄﻊ ﻣﻨﻜﻢ ﻃﻮﻻ} “barang siapa tiada mempunyai kemampuan ekonomi untuk menikahi seorang muslimah muhshonah yang merdeka”، maka dari {ﻓﺘﻴﺎﺗﻜﻢ اﻟﻤﺆﻣﻨﺎﺕ} “para budak wanita kalian” yang bukan kafir secara lahir bukan secara batin, Adapun batin, maka diserahkan kepada Allah, oleh karenanya Allah berfriman {ﻭاﻟﻠﻪ ﺃﻋﻠﻢ ﺑﺈﻳﻤﺎﻧﻜﻢ} “dan Allah lebih mengetahui iman-iman kalian”. Firman Allah {ﺑﻌﻀﻜﻢ ﻣﻦ ﺑﻌﺾ} “kalian adalah sebagian kalian adalah dari sebagian yang lain” di dalam ayat ini ada pelipur bagi yang menikahi seorang budak karena keadaan mendesak, karena iman menghilangkan perbedaan-perbedaan diantara kaum mukminin. Kalam Allah {ﻓﺎﻧﻜﺤﻮﻫﻦ ﺑﺈﺫﻥ ﺃﻫﻠﻬﻦ ﻭﺁﺗﻮﻫﻦ ﺃﺟﻮﺭﻫﻦ ﺑﺎﻟﻤﻌﺮﻭﻑ ﻣﺤﺼﻨﺎﺕ ﻏﻴﺮ ﻣﺴﺎﻓﺤﺎﺕ} “maka nikahilah mereka dengan izin ayah-ayah mereka dan berikanlah mereka mahar dengan cara yang makruf . hal itu dikarenakan mereka adalah wanita-wanita yang mejaga diri dari zina dan tidak pula mereka memiliki laki-laki simpanan”. Dalam ayat di atas adanya penjelasan tentang dua syarat yang harus dipenuhi, dan syarat-syarat itu telah disebutkan tadi. Allah berfriman {ﻓﺈﺫا ﺃﺣﺼﻦ} “jika mereka telah menjaga diri”, maksudnya adalah para perempuan budak dengan menikah dan dengan masuk Islam. {ﻓﺈﻥ ﺃﺗﻴﻦ ﺑﻔﺎﺣﺸﺔ} “dan jika mereka mendatangi perbuatan keji”, yaitu mereka berzina, maka hukuman bagi mereka adalah setengah siksaan dari wanita muhshonah, yakni 50 kali dera dan diasingkan selam enam bulan. Sebab jikalau seorang wanita yang merdeka berbuat zina dan dia seorang gadis, hukumannya adalah 100 kali dera dan diasingkan selama satu tahun. Adapun hukuman rajam yang itu adalah hukuman yang menyebabkan mati, maka tiada setengah dari hukuman rajam. lantaran hal itu kaum mukminin memahami setengah dari siksa hukuman adalah dari hukuman dera pukulan bukan setengah hukuman rajam. Dan kesimpulan ini adalah ijmak yang tiada perselisihan di dalamnya. Allah berfirman {ﺫﻟﻚ ﻟﻤﻦ ﺧﺸﻲ اﻟﻌﻨﺖ ﻣﻨﻜﻢ} “(Kebolehan mengawini budak) itu, adalah bagi orang-orang yang takut dari perbuatan zina di antara kamu”, Allah menginginkan jalan terbaik kepada kaum mukminin yang merasa khawatir akan terjerumus melakukan zina, jikalau tidak mampu menikahi seorang yang merdeka karena kefakiran dan kebutuhannya, Allah berfirman {ﻭﺃﻥ ﺗﺼﺒﺮﻭا ... } “dan hendaklah kalian sabar…”, maksudnya adalah sabar untuk menjadi lajang lebih baik dibandingkan dengan menikah dengan budak wanita. Allah berkata {ﻭاﻟﻠﻪ ﻏﻔﻮﺭ ﺭﺣﻴﻢ} “dan Allah Maha Pengampun lagi Maha Penyayang”, yakni Maha Pengampun terhadap orang yang bertaubat dan Maha Penyayang kepada kaum mukminin oleh karenannya Dia memberikan rukhshoh keringan kepada mereka yang tidak mampu menikah dengan wanita merdeka agar menikah saja dengan budak perempuan saat dikhatirkan dapat terjerumus. Allah memberikan pula arahan kepada mereka untuk melakukan lebih baik dari menikah dengan budak dengan bersabar. Segala puji bagi Allah dan seluruh nikmat ialah milik-Nya. Pelajaran dari ayat : • Diperbolehkan menikah dengan budak perempuan bagi orang yang takut terjerumus dalam perbuatan keji dan dia tidak mampu untuk menikahi seorang wanita merdeka. • Wajibnya didirikan hukum had kepada budak perempuan yang berzina dan telah menjadi muhshonah dengan masuk Islam dan menikah. • Sabar melajang lebih baik daripada menikah dengan budak berdasarkan petunjuk dari Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 25: Dan barangsiapa dari antara kamu tidak mampu berkawin Mu'minat yang merdeka, maka (ambillah) dari yang dimiliki oleh tangan-tangan kanan kamu dari kamu yang Mu'min, karena Allah Mengetahui iman kamu, sebagian daripada kami adalah dari sebagian; maka bernikahlah kepada mereka dengan idzin ahli- ahli mereka, dan berilah mas- kawin mereka dengan cara yang baik, (lantaran) mereka berkawin bukan berzina dan bukan mengambil kekasih piaraan, tetapi apabila mereka sudah berkawin, kemudian mereka mengerjakan kejahatan, maka adalah bagi mereka separoh dari 'adzab (yang dikena- kan) atas perempuan-perempuan yang merdeka; yang demikian itu buat orang kepada zina dari antara kamu; tetapi bahwa adalah terlebih baik buat kamu; dan sesungguhnya Allah itu Pengampun, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Menurut Syaikh As Sa'diy, biaya di sini adalah mahar untuk menikahi wanita-wanita mukminah merdeka. Oleh karena itu, merasa cukuplah dengan zhahir(lahiriah)nya dan serahkanlah masalah yang tersembunyi kepada-Nya. Terkadang keimanan seorang budak lebih tinggi daripada seorang merdeka. Maksudnya orang merdeka dan budak yang dikawininya itu adalah sama-sama keturunan Adam dan hawa serta sama-sama beriman. Ada pula yang mengartikan \"kamu dan mereka (budak) sama-sama seagama, oleh karena itu jangan merasa sombong dari menikahinya\". Baik tuannya hanya seorang atau lebih. Seperti tidak menundanya dan tidak mengurangi meskipun ia seorang budak. Di mana mereka berzina dengannya secara rahasia. Oleh karena itu, jika mereka berzina padahal sudah menikah, maka didera sebanyak 50 kali dan diasingkan selama setengah tahun, dan tidak hukum ada rajam terhadap mereka. Namun jika mereka belum menikah kemudian berzina, maka mereka diberi hukuman ta'zir yang membuatnya jera sesuai pendapat hakim. Hukuman had bagi budak laki-laki dan perempuan tidak ada bedanya, karena tidak ada pembedanya. Berdasarkan ayat ini, seorang muslim yang merdeka tidak boleh menikahi budak kecuali dengan empat syarat: 1. Mereka beriman (mukminah) 2. Menjaga diri/'iffah zhahir maupun batin. 3. Tidak mampu membayar mahar wanita merdeka 4. Khawatir zina Namun demikian, bersabar dengan tidak menikai mereka lebih utama. Yakni tidak menikahi budak agar anak tidak menjadi budak, rendah dan cacat kehormatan. Terhadap hal yang telah berlalu. Syaikh As Sa'diy berkata, \"Mungkin maksud disebutkan ampunan setelah menyebutkan had terdapat isyarat bahwa had itu dapat menghapuskan dosa, di mana dengan had tersebut Allah menghapuskan dosa hamba-hamba-Nya sebagaimana disebutkan dalam hadits\"."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 25",
    "description": "Dan barang siapa di antara kamu, wahai kaum muslim, yang tidak mempunyai biaya yang dapat dipergunakan sebagai perbelanjaan untuk menikahi perempuan merdeka yang beriman, maka dihalalkan menikahi perempuan yang beriman dari hamba sahaya yang bukan kamu miliki tetapi dimiliki oleh saudaramu sesama muslim. Allah mengetahui keimanan yang ada dalam hati-Mu sekalian. Janganlah kamu selalu mempersoalkan masalah keturunan, karena sebagian dari kamu adalah saudara dari sebagian yang lain sama-sama keturunan adam dan hawa. Karena itu, bila kamu benar-benar tidak mampu menikahi perempuanperempuan merdeka, maka nikahilah mereka, yakni perempuan-perempuan hamba sahaya itu, dengan izin tuan yang memiliki-Nya dan berilah mereka maskawin yang pantas sesuai dengan yang berlaku di kalangan masyarakat dan kondisi hamba sahaya pada waktu itu, yang tidak memberatkan kamu dan tidak pula merugikan si perempuan dan tuannya, karena mereka adalah perempuan-perempuan yang memelihara kesucian diri mereka, bukan pezina dan bukan pula perempuan yang mengambil laki-laki lain sebagai piaraannya yang mereka sembunyikan. Apabila mereka telah berumah tangga atau bersuami, tetapi masih saja melakukan perbuatan keji dengan berbuat zina yang terbukti secara hukum, maka berilah hukuman bagi mereka yang besarnya setengah dari apa, yakni hukuman perempuan-perempuan yang merdeka dan bersuami. Kebolehan menikahi hamba sahaya itu adalah izin bagi orang-orang yang takut terjatuh terhadap kesulitan dalam upaya menjaga diri dari perbuatan zina. Tetapi jika kamu bersabar dengan cara menahan diri agar tidak berzina atau menikahi hamba sahaya, itu lebih baik bagimu daripada menikahi mereka. Allah maha pengampun, maha penyayangAllah zat yang maha mengetahui dan mahabijaksana secara terus menerus hendak menerangkan hukum-hukum syariat-Nya kepadamu termasuk hukum tentang hubungan laki-laki dan perempuan, dan juga secara terus-menerus hendak menunjukkan kepada kamu jalan-jalan kehidupan orang yang sebelum kamu yakni para nabi dan orang-orang saleh, dan dia secara terus-menerus pula menerima tobatmu selama kamu bertobat dengan tulus dan sepenuh hati. Allah maha mengetahui siapa di antara kamu yang bertobat dengan tulus sepenuh hati dan siapa yang hanya separuh hati, mahabijaksana dalam menetapkan hukumhukum-Nya."
  }
]