[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berkehendak melalui aturan-aturan syariat ini, untuk menerangkan kepada kalian rambu-rambu agamaNYA yang lurus dan syariatNYA yang bijaksana, dan menunjukan kalian kepada jalan para nabi dan orang-orang shalih sebelum kalian dalam perkara yang halal dan haram, dan menerima taubat kalian dengan kembali mengerjakan ketaatan-ketaatan. Dan DIA Maha Mengetahui hal yang akan memperbaiki keadaan hamba-hambaNYA, Maha bijaksana dalam ajaran yang disyariatkanNYA untuk kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Dengan penetapan syariat ini Allah -Subḥānahu- hendak menjelaskan kepada kalian rambu-rambu syariat dan agama-Nya yang akan menjamin kemaslahatan kalian di dunia dan Akhirat. Dan Allah hendak membimbing kalian ke jalan nabi-nabi sebelum kalian dalam hal penetapan halal dan haram, serta perilaku mereka yang mulia dan perjalanan hidup mereka yang terpuji agar kalian meneladaninya. Allah juga hendak membawa kalian meninggalkan kemaksiatan menuju ketaatan kepada-Nya. Dan Allah Maha Mengetahui apa yang terbaik bagi hamba-hamba-Nya sehingga menganjurkannya kepada mereka, lagi Maha Bijaksana dalam menetapkan syariat-Nya dan mengatur urusan hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Allah hendak menjelaskan kepada kalian kebaikan-kebaikan dan amalan amalan utama yang tidak nampak dari kalian, dan hendak menunjukkan kepada kalian jalan para nabi dan orang-orang shaleh dalam beragama agar kalian dapat meneladani perbuatan baik mereka. Kemudian Allah menutup ayat ini dengan menyebutkan ilmu dan hikmah-Nya, sebab hukum-hukum dan arahan-Nya bersumber dari ilmu dan hikmah-Nya, Dialah Yang Maha Mengetahui diri dan keadaan hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ (dan menunjukimu kepada jalan-jalan orang yang sebelum kamu) Mereka adalah para Nabi dan para pengikutnya, supaya kalian meneladani mereka. وَيَتُوبَ عَلَيْكُمْ ۗ (dan (hendak) menerima taubatmu) Maka dari itulah Allah memberi keringanan untuk menikahi budak wanita apabila sesuai dengan syaratnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Allah ingin menjelaskan amal ibadah yang paling utama yang dirahasiakan dari kalian, menunjukkan jalannya para nabi yang terdahulu supaya kalian bisa meneladani mereka, dan menerima taubat dosa-dosa terdahulu kalian. Dan Allah itu Maha Mengetahui urusan-urusan kalian sehingga Dia memberi kemudahan bagi kalian, dan Maha Bijaksana dalam perintah yang disyariatkan untuk kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah hendak menerangkan kepada kalian} menjelaskan kepada kalian syariat-syariat agama kalian dan kebaikan-kebaikan urusan kalian {memberi petunjuk kepada kalian} membimbing kalian {berbagai jalan} berbagai jalan {orang-orang sebelum kalian} para nabi sebelum kalian dalam penghalalan dan pengharaman, supaya kalian meneladani mereka {dan menerima taubat kalian. Allah Maha Mengetahui lagi Maha bijaksana."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. Allah mengabarkan tentang karuniaNya yang besar pemberianNya yang agung, pemeliharaanNya yang terbaik, terhadap kaum mukminin dan kemudahan agamaNya seraya berfirman ”Allah hendak menerangkan (hukum syariatNya) kepadamu” yaitu seluruh perkara yang kalian butuhkan penjelasannya berupa kebenaran dan kebatilan halal dan haram, ”dan menunjukimu kepada jalan-jalan orang yang sebelum kamu (para nabi dan shalihin) maksudnya adalah orang-orang yang telah diberi kenikmatan oleh Allah yaitu para nabi beserta para pengikut mereka dalam sejarah hidup mereka yang terpuji, perbuatan-perbuatan mereka yang lurus, akhlak-akhlak mereka yang sempurna dan taufik mereka yang menyeluruh, karena itulah Allah merealisasikan apa yang dikehendakiNya lalu menjelaskannya kepada kalian dan menerangkan dengan sejelas-jelasnya sebagaimana Allah telah menjelaskannya kepada orang-orang sebelum kalian, kemudian Allah memberi hidayah kepada kalian dengan hidayah yang agung dalam ilmu dan perbuatan. “dan hendak menerima taubatmu “ yaitu berlaku lemah lembut (terhadap kalian) pada keadaan kalian dan perkara yang disyariatkanNya bagi kalian, hingga kalian mampu melaksanakan apa yang telah Allah tetapkan dan merasa cukup dengan apa yang telah Allah halalkan hingga dosa-dosa kalian menjadi sedikit karena apa yang telah Allah mudahkan atas kalian, inilah dinatara penerimaan taubat oleh Allah atas hamba-hambaNya. dan juga diantara penerimaan taubat Allah atas mereka adalah bahwa bila mereka berbuat dosa, niscaya Allah akan membuka pintu-pintu rahmat bagi mereka dan menurunkan kepada jiwa-jiwa mereka akan menyerahkan diri dan bersikap merendahkan diri dihadapanNya kemudian Allah mengampuni mereka dengan menerima perkara yang Dia bimbing kepadanya, karena itu hanya bagiNya segala puji dan syukur atas semua itu. Dan firmanNYa “dan Alllah Maha Mengetahui Maha BIjaksana” yaitu ilmu yang sempurna, kebijaksanaan yang sempurna, dan diantara ilmuNya adalah Allah mengajarakan kepada kalian apa yang tidak kalian ketahui dianataranya adalah hal-hal yang seperti tersebut di atas dan juga had-had. dan diantara hikmahNya adalah bahwa Allah mengampuni orang yang hikmah dan rahmatNya menetapkan adanya ampunan baginya, dan menghinakan orang yang hikmah dan keadilanNya menetapkan bahwa ia tidak pantas menerima ampunan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻳﺮﻳﺪ اﻟﻠﻪ ﻟﻴﺒﻴﻦ ﻟﻜﻢ} yuriidullahu liyubayyina lakum: Allah berkehendak menjelaskan kepada kalian hal yang haram bagi kalian, dan menerangkan yang halal yang mana dapat menyempurnakan kalian dan membuat bahagia di dunia-akhirat {ﺳﻨﻦ اﻟﺬﻳﻦ ﻣﻦ ﻗﺒﻠﻜﻢ} sunanallazina minqoblikum: jalan-jalan oran-orang sebelum kalian dari golongan para nabi dan orang-orang sholih untuk diikuti, maka menjadi suci, sempurna dan selamat seperti mereka. {ﻭﻳﺘﻮﺏ ﻋﻠﻴﻜﻢ} wayatuuba ‘alaikum: mengembalikan kalian dari kesesatan jahiliayah menuju hidayah Islam. Makna Ayat: Tatkala Allah mengharamkan beberapa jenis pernikahan dan menghalalkan jenis yang lain, Allah menjelaskan sebabnya dan berfirman {ﻳﺮﻳﺪ اﻟﻠﻪ} “Allah menginginkan”, maksudnya adalah apa yang disyariatkan oleh Allah adalah bentuk penjelasan kepada kalian, mana yang yang bermanfaat dan mana yang berbahaya. Seyogyanya ambillah yang bermanfaat dan tinggalkanlah yang bermudarat. Seperti yang Allah kehendaki kepada sebelum kalian berupa jalan-jalan orang-orang sholih dari kalangan para nabi, kaum mukminin yang sholih. Agar supaya kalian menapakinya, maka kalian menjadi sempurna dan bahagia di dua kehidupan, seperti yang Allah inginkan dengan menjelaskan kepada kalian agar {ﻭﻳﺘﻮﺏ ﻋﻠﻴﻜﻢ} “agar bertaubat”, yakni kembali dari kesesatan jahiliyah menuju hidayah Islam, menjadi hidup dalam kebaikan yang suci, dan Allah Maha Mengetahui dengan apa yang bermanfaat bagi kalian dan yang mudarat terhadap kalian. Allah Maha Bijak dalam ketentuannya, maka bersyukurlah dengan melakukan ketaatan kepada-Nya dan mejauhi maksiat terhadap-Nya. Ini adalah apa yang tercakup dalam ayat 26 Pelajaran dari ayat : • Anugrah Allah untuk kita dengan menjelaskan hukum-hukum, agar jiwa kita merasa tenang dan terlaksanakan amal dengan lapang dada dan prasangka yang baik terhadap Allah. • Karunia Allah kepada kaum mukminin dengan memberikan hidayah menuju jalan orang-orang sholih dan metode para pemenang dari umat-umat terdahulu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 26: Allah hendak menerangkan kepada kamu, dan (hendak) me- nunjukkan kepada kamu cara-cara orang-orang yang dahulu daripada kamu, dan (hendak) memberi am- pun atas kamu, karena Allah itu pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Atau semua yang kamu butuhkan penjelasannya seperti perkara yang hak (benar) dan yang batil, halal dan haram. Yaitu jalan orang-orang yang diberi nikmat oleh Allah, seperti jalannya para nabi dan orang-orang saleh. Dia berbuat lembut kepada kamu dalam semua keadaan kamu dan dalam syari'at yang ditetapkan bagimu agar kamu dapat berhenti di atas batas yang Allah tetapkan, mencukupi diri dengan yang dihalalkan-Nya sehingga dosamu menjadi sedikit dengan sebab kemudahan yang diberikan Allah kepadamu, ini pun termasuk tobat-Nya kepada hamba-hamba-Nya. Termasuk tobat-Nya pula kepada mereka adalah ketika mereka berbuat maksiat dibuka-Nya untuk mereka pintu-pintu rahmat, memberikan kepada mereka rasa untuk kembali kepada-Nya, tunduk berendah diri di hadapan-Nya, kemudian Dia menerima tobat mereka, maka segala puji bagi Allah terhadap semua itu. Dalam menetapkan syari'at bagi kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 26",
    "description": "Allah zat yang maha mengetahui dan mahabijaksana secara terus menerus hendak menerangkan hukum-hukum syariat-Nya kepadamu termasuk hukum tentang hubungan laki-laki dan perempuan, dan juga secara terus-menerus hendak menunjukkan kepada kamu jalan-jalan kehidupan orang yang sebelum kamu yakni para nabi dan orang-orang saleh, dan dia secara terus-menerus pula menerima tobatmu selama kamu bertobat dengan tulus dan sepenuh hati. Allah maha mengetahui siapa di antara kamu yang bertobat dengan tulus sepenuh hati dan siapa yang hanya separuh hati, mahabijaksana dalam menetapkan hukumhukum-Nyadan ketahuilah bahwa Allah hendak menerima tobatmu yang kamu lakukan dengan tulus dan sepenuh hati, sedang orang-orang yang semata-mata hanya mengikuti keinginan hawa nafsu-Nya, menghendaki dan berupaya dengan segala cara agar kamu berpaling sejauh-jauhnya dari kebenaran."
  }
]