[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah berkehendak menerima taubat kalian, dan memafkan kesalahan-kesalahan kalian. Sedangkan orang-orang yang mengikuti nafsu syahwat mereka dan kesenangan mereka berkeinginan supaya kalian melenceng dari agama kalian sejauh-jauhnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Allah hendak menerima taubat kalian dan mengampuni kesalahan-kesalahan kalian. Sedangkan orang-orang yang mengikuti segala kecenderungan syahwat mereka dan memperturutkan hawa nafsu, mereka ingin menjauhkan kalian dari jalan yang lurus dengan sejauh-jauhnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Allah mendorong kalian untuk bertaubat dari hal-hal yang mengharuskan kalian bertaubat, sedangkan orang-orang yang menuruti syahwatnya hanya ingin agar kalian tersesat dari kebenaran dan terjerumus ke dalam kemaksiatan, sebab mereka selalu menuruti syahwat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوٰتِ (sedang orang-orang yang mengikuti hawa nafsunya itu menginginkan) Mereka adalah para pelaku zina yang ingin meluapkan syahwat mereka tanpa melihat akibat perbuatan mereka dan tanpa mempedulikan apa yang dihalalkan atau diharamkan Allah. أَن تَمِيلُوا۟( supaya kamu berpaling) Yakni menuju jalan mereka. مَيْلًا عَظِيمًا(sejauh-jauhnya) Yakni dengan kalian melakukan perbuatan mereka tanpa mempedulikan batasan-batasan syariat. Dan yang dimaksud degan syahwat disini adalah apa yang diharamkan oleh syariat dan selain apa yang dihalalkannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seorang mutadabbir berkata : \"Sedikitpun sejarah baik tidak pernah dilahirkan oleh syahwat dan kelezatan dunia! akan tetapi ada saja para penipu yang berbekal syahwat menyangka bahwa mereka sedang membumikan sejarah baru, apakah mereka sedang menampakkan kebodohan ? atau sedang berkonspirasi, atau bahkan mereka tengah menggabungkan antara kebodohan dan konspirasi ? 2 ). Meninggalkan hijab, mengumbar aurat di hadapan massa yang dilakukan oleh kaum wanita, dan pola hidup para anak muda yang menggiring kepada kerusakan, semua ini bagaikan bahan peledak dari musuh yang berjatuhan diatas kita, dan menghancurkan benteng kesatuan kita, maka apakah dengan kelalaian ini dapat menolong kita dari serangan musuh ? 3 ). { وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَنْ تَمِيلُوا مَيْلًا عَظِيمًا } \"sedang orang-orang yang mengikuti hawa nafsunya bermaksud supaya kamu berpaling sejauh-jauhnya (dari kebenaran).\" Ayat sebagai penjelas dari dzat yang Maha mengetahui segala sesuatu yang dirahasiakan dan disembunyikan, bahwasanya diatara manusia begitu banyak pihak-pihak yang mereka adalah dari kalangan wartawan, penulis, atau pemilik stasiun-stasiun televisi, mereka memiliki visi yang besar untuk mengalihkan ummat ini dari kebenaran. 4 ). Dua ayat ini membantah dan membatalkan serta mengungkap rahasia misi orang-orang yang bertekad memasukkan kerusakan kepada masyarakat, bahkan dalam misi mereka tidak pantang dengan segala akibat buruk yang bakal mereka hadapi, Allah berfirman : { وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ } \"sedang orang-orang yang mengikuti hawa nafsunya\" , { إِنَّ الَّذِينَ يُحِبُّونَ أَنْ تَشِيعَ الْفَاحِشَةُ } \"Sesungguhnya orang-orang yang ingin agar (berita) perbuatan yang amat keji itu tersiar \" Sesungguhnya misi mereka hanya berbekal nafsu, dan tidak sekali-kali mereka ingin melahirkan kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Allah hendak menerima taubat kalian dengan mengembalikan kalian dari kemaksiatan menuju ketaatan, sedangkan para pengikut hawa nafsu itu ingin agar kalian berpaling dari jalan kebenaran dengan melakukan perbuatan yang diharamkan tanpa mematuhi syariat, dan tidak memperhatikan akibatnya, serta halal-haramnya. Yang dimaksud dengan syahwat di sini adalah Sesuatu yang diharamkan oleh syari’at."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah hendak menerima taubat kalian, sedangkan orang-orang yang mengikuti syahwat} mengikuti kesenangan {ingin kalian berpaling} menjauh dari jalan istiqamah {sejauh-jauhnya} sangat jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Dan firmanNYa “dan Allah hendak menerima taubatmu” yaitu ampunan yang menghimpun ketercerai-beraian kalian, menyatukan perbedaan kalian, dan mendekatkan yang jauh dari kalian, ”sedang orang-orang yang mengikuti hawa nafsunya” yaitu mereka condong bersama nafsunya kemanapun ia condong dan mereka mendahulukan nafsunya diatas perkara yang mengandung keridhaan Allah serta menyembah hawa nafsu mereka, mereka adalah orang-orang kafir dan orang-orang ahli maksiat dari berbagai macam jenisnya yang mementingkan hawa nafsu mereka saja daripada ketaatan kepada rabb mereka, mereka itu menghendaki “supaya kamu berpaling sejauh-jauhnya (dari kebenaran)“ yaitu agar kalian menyimpang dari jalan yang lurus kepada jalan orang-orang yang dimurkai dan orang-orang yang tersesat, mereka menghendaki agar kalian menyimpang dari ketaatan Allah menju ketaatan kepada setan, dan dari hukum-hukum Dzat yang seluruh kebahagiaan itu berada pada pelaksanaan perintah dan laranganNya menuju kepada setan yang seluruh kesengsaraan berada ketika mengikutinya. Apabila kalian telah mengetahui bahwa Allah memerintahkan kalian kepada perkara yang terdapat padanya kemashlahatan, keberhasilan, dan kebahagiaan bagi kalian dan bahwasannya orang-orang yang mengikuti hawa nafsu mereka memerintahkan kalian kepada perkara yang terdapat padanya kerugian dan kesengsaraan maka pilihlah yang paling utama untuk diri kalian diantara dua pendorong tersebut carilah yang terbaik dari dua jalan tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {اﻟﺬﻳﻦ ﻳﺘﺒﻌﻮﻥ اﻟﺸﻬﻮاﺕ} llazdina yattabi’unasy syahawat: orang-orang yang memperturutkan hawa nafsunya dari kaum Yahudi, Nasrani, Majusi dan para pelaku zina. {ﺃﻥ ﺗﻤﻴﻠﻮا ﻣﻴﻼ ﻋﻈﻴﻤﺎ} an yamiiluu mailan ‘azhima: tergelincir dari jalan yang suci murni menuju jalan yang kotor dan keruh dengan melakukan pernikahan yang haram ataupun yang selainnya, menjadi jauh dari petunjuk Allah jauh sekali. Makna ayat : Lantas pada ayat 27, mencakup kabar bahwa Allah menginginkan dengan adanya penjelasan halal dan haram di dalam berbagai macam pernikahan dan hal selain pernikahan agar kaum mukminin kembali dari kehidupan yang kotor dan bejat yang mana orang terdahulu telah hidup sebelum datangnya Islam menuju jalan yang suci dan baik dalam naungan syariat yang adil dan penuh kasih sayang. Adapun orang yang mengikuti keinginan hawa nafsunya dari kalangan pezina, Nasrani dan setiap yang menyimpang dari jalan petunjuk, sesungguhnya merekalah yang menginginkan kaum mukminin menjadi melenceng seperti mereka, memanjakan diri dalam gelimang ‘kenikmatan’ dan syahwat binatang sampai-sampai kaum mukminin menjadi seperti mereka dan tiada kebaikannya sama sekali. Sekarang, tak adalah hak bagi mereka petunjuk dan arahan. Ini adalah makna dari ayat 27. Pelajaran dari ayat : • Rahmat Allah dalam bentuk penyucian kepada kaum mukminin dari kebejatan dan kesesatan jahiliyah. • Kupas tuntas tentang kepribadian manusia, yang mana pezina menginginkan seluruh umat manusiapun ikut berzina dan orang yang menyimpang pun begitu adanya, berkehendak agar semua pun ikut tersesat. Begitu adanya, setiap yang bergelimang di dalam kebejatan, keburukan atau kerusakan. Seperti halnya orang yang bersih pun akan suka dan berusaha memperbaiki keadaan manusia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 27: Dan Allah hendak memberi ampun atas kamu, tetapi orang- orang yang menurut hawa nafsunya hendak supaya kamu condong sungguh-sungguh (daripada kebe- naran)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Diulangi lagi untuk menjadikannya dasar utama melakukan semua itu. Tobat ini pun menyatukan perpecahan kamu dan mendekatkan yang sebelumnya jauh. Seperti orang-orang kafir dan para pelaku maksiat. Dari kebenaran atau dari jalan yang lurus kepada jalan orang-orang yang dimurkai dan jalan orang-orang yang sesat dengan mengerjakan yang diharamkan sehingga kamu seperti mereka. Mereka ingin menjadikan kamu berpindah dari ketaatan kepada Allah kepada ketaatan kepada setan, dari kebahagiaan kepada kesengsaraan, sedangkan Allah mengajak kamu kepada hal yang bermaslahat bagi kamu, kepada hal yang membawa keberuntungan dan kebahagiaan bagi kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 27",
    "description": "Dan ketahuilah bahwa Allah hendak menerima tobatmu yang kamu lakukan dengan tulus dan sepenuh hati, sedang orang-orang yang semata-mata hanya mengikuti keinginan hawa nafsu-Nya, menghendaki dan berupaya dengan segala cara agar kamu berpaling sejauh-jauhnya dari kebenaran. Allah juga hendak memberikan keringanan atas beban yang dipikulkan-Nya kepadamu. Oleh sebab itu, ketahuilah bahwa karena manusia diciptakan oleh Allah dalam keadaan bersifat lemah, maka tidak ada hukum-Nya yang di luar kemampuan manusia untuk memikulnya."
  }
]