[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah menghendaki dengan ajaran yang disyariatkanNYA kepada kalian suatu kemudahan dan tidak adanya kesulitan bagi diri kalian, dikarenakan sesungguhnya kalian diciptakan dalam keadaan bersifat lemah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Allah hendak meringankan syariat yang Dia tetapkan bagi kalian. Maka Dia tidak membebani kalian dengan sesuatu di luar kemampuan kalian. Karena Dia mengetahui kelemahan manusia, baik dalam jasad maupun akhlaknya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Allah menginginkan bagi kalian kemudahan, sebab agama ini menjelaskan dalam menjaga kebaikan dan menjauhi keburukan dengan cara yang paling mudah dan paling ringan. Hal ini karena rahmat dan kebaikan-Nya yang sempurna serta karena pengetahuan-Nya tentang kelemahan manusia dari berbagai sisi, terutama yang berhubungan dengan urusan wanita, oleh sebab itu Allah meringankan manusia dari apa yang tidak mampu dilakukan oleh keimanan, kesabaran, dan kekuatannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَخُلِقَ الْإِنسٰنُ ضَعِيفًا(dan manusia dijadikan bersifat lemah) Yakni lemah tak mampu untuk mengendalikan diri dan melawan hawa nafsu yang bergejolak. Maka dari itu Allah menghendaki untuk memberi keringanan bagi mereka, sehingga diperbolehkan melakukan apa yang dibolehkan di ayat yang telah dijelaskan tadi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sufyan tsauri ditanya tentang firman Allah : { وَخُلِقَ الْإِنْسَانُ ضَعِيفًا } \"dan manusia dijadikan bersifat lemah.\" apakah yang dimaksud kelemahannya ? beliau berkata : seorang wanita melintas dihadapan laki-laki, lalu mereka tidak mampu menahan diri dari melihat wanita ini dengan nafsunya, dan tidak pun mereka mendapat manfaat darinya; maka kelemahan apakah yang lebih dari ini ? 2 ). Pada firman Allah : { وَخُلِقَ الْإِنْسَانُ ضَعِيفًا } adalah menjelaskan bahwa manusia itu benar-benar lemah, didalamnya juga ada petunjuk agar manusia tidak menggiring dirinya kepada tempat-tempat maksiat, karena maksiat adalah larangan-larangan Allah. Maka siapa yang berada di dekat larangan Allah itu dikhawatirkan dia akan jatuh pada larangan tersebut\". 3 ). Kelemahan kaum laki-laki sangat jelas dalam hal fitnah wanita; oleh karena itu tatkala disebutkan ayat-ayat tentang nikah, hawa nafsu, dan ihson dalam surah An-Nisa; ayat-ayat itu kemudian ditutup dengan firman Allah : { وَخُلِقَ الْإِنْسَانُ ضَعِيفًا }, maka dari itu sangat menjadi kewajiban bagi orang-orang lemah akan imannya dan ia takut akan rusaknya agamanya agar tidak menyepelekan permasalahan ini, dan tidak sekali-kali mendekati fitnah-fitnah kaum wanita; mereka harus percaya dengan kejantanan mereka, dan kebaikan akalnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Allah ingin meringankan kalian dengan memperbolehkan untuk menikahi budak wanita. Dan manusia itu diciptakan lemah menghadapi syahwat yang sangat besar, atau menghadapi hawa nafsunya sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah hendak memberikan keringanan kepada kalian} memudahkan kalian dalam hukum-hukum syariat {dan manusia diciptakan lemah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Allah hendak memberikan keringanan kepadamu” yaitu dengan mudahnya perkara yang Allah perintahkan kalian kepadanya dan perkara yang kalian dilarang darinya, kemudian bersamaan dengan adanya kesulitan pada beberapa syariat, Allah membolehkan juga bagi kalian apa yang sangat dibutuhkan oleh keterdesakan kebutuhan kalian, seperti bangkai, darah dan semacamnya, bagi orang yang terpaksa. atau seperti menikahi budak wanita bagi seorang laki-laki merdeka dengan syarat-syarat yang telah disebutkan terdahulu, semua itu karena rahamat Allah yang sempurna, kebaikanNya yang menyeluruh dan ilmu serta hikmahNya akan kelemahan manusia dari berbagai segi, lemah dari segi postur tubuhnya, lemah dalam kehendak, lemah dalam bertekad, lemah dalam keimanan, lemah dalam kesabaran, lalu untuk menyesuaikan hal itu, Allah meringankan apa yang mereka lemah padanya, dan apa yang tidak bisa dilakukan oleh keimanan kesabaran dan kekuatannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻭﺧﻠﻖ اﻹﻧﺴﺎﻥ ﺿﻌﻴﻔﺎ} wakholaqol insaana dho’iifa: tidak sabar terhadap ujian dengan adanya kaum wanita, maka diberikan keringanan kepada mereka dengan menikahi para budak. Makna ayat : Petunjuk dalam ayat yang ke 28 adalah telah dikabarkan oleh Allah dibolehkannya untuk kaum mukminin yang tidak sanggup untuk menikahi orang merdeka untuk menikahi budak yang mukminah. Allah menghendaki yang demikian sebagai bentuk keringanan bagi mereka dan kemudahan kepada kaum mukminin, serta ungkapan rasa kasih sayang dari Allah tatkala Allah mengetahui lemahnya manusa. Tidak ada kesanggupan untuk menahan dari kebutuhannya akan wanita yang mana itu adalah tabiat dasar manusia. Tabiat dasar manusia adalah kecenderungan laki-laki kepada kaum wanita untuk menjaga keberlangsungan manusia dan hikmah yang agung. Allah berfirman {ﻳﺮﻳﺪ اﻟﻠﻪ ﺃﻥ ﻳﺨﻔﻒ ﻋﻨﻜﻢ ﻭﺧﻠﻖ اﻹﻧﺴﺎﻥ ﺿﻌﻴﻔﺎ} “Allah berkendak untuk meringankan kalian dan manusia adalah makhluk yang tercipta dalam keadaan lemah” Pelajaran dari ayat : • Sisi lemah manusia terhadap tabiat dasarnya, terutama adalah kebutuhan untuk berhubungan badan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 28: Allah hendak meringankan (keberatan) dari manusia lemah, kamu, karena itu dijadikan (bersifat) lemah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dalam syari'at. Dia memudahkan perintah dan larangan, dan ketika terjadi kesulitan dibolehkan untuk dilakukan seperti halalnya memakan bangkai bagi orang yang kelaparan dan halalnya menikahi budak bila telah cukup syarat-syaratnya. Hal itu, tidak lain karena sayang dan Ihsan-Nya kepada kamu, pengetahuan-Nya tentang lemahnya dirimu; lemah fisik, lemah 'azam, lemah iman dan lemahnya kesabaran. Oleh karenanya, Dia meringankan sesuatu yang tidak sanggup dipikul oleh kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 28",
    "description": "Allah juga hendak memberikan keringanan atas beban yang dipikulkan-Nya kepadamu. Oleh sebab itu, ketahuilah bahwa karena manusia diciptakan oleh Allah dalam keadaan bersifat lemah, maka tidak ada hukum-Nya yang di luar kemampuan manusia untuk memikulnyaayat-ayat yang lalu berbicara tentang hukum pernikahan, sementara pernikahan itu tidak bisa dilepaskan dari harta, terutama berkaitan dengan maskawin. Oleh sebab itu, ayat berikut berbicara tentang bagaimana manusia beriman mengelola harta sesuai dengan keridaan Allah. Wahai orang-orang yang beriman! janganlah sekali-kali kamu saling memakan atau memperoleh harta di antara sesamamu yang kamu perlukan dalam hidup dengan jalan yang batil, yakni jalan tidak benar yang tidak sesuai dengan tuntunan syariat, kecuali kamu peroleh harta itu dengan cara yang benar dalam perdagangan yang berlaku atas dasar suka sama suka di antara kamu yang tidak melanggar ketentuan syariat. Dan janganlah kamu membunuh dirimu atau membunuh orang lain karena ingin mendapatkan harta. Sungguh, Allah maha penyayang kepadamu dan hamba-hamba-Nya yang beriman."
  }
]