[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNYA serta melaksanakan syariatNYA, tidak halal bagi kalian untuk memakan harta sebagian kalian kepada sebagian yang lainnya tanpa didasari Haq, kecuali telah sejalan dengan syariat dan pengahasilan yang dihalalkan yang bertolak dari adanya saling rido dari kalian. Dan janganlah sebagian kalian membunuh sebagian yang lain,akibatnya kalian akan membinasakan diri kalian dengan melanggar larangan-larangan Allah dan maksiat-maksiat kepadaNYA. Sesungguhnya Allah Maha penyayang kepada kalian dalam setiap perkara yang Allah memerintahkan kalian untuk mengerjakannya dan perkara yang Allah melarang kalian melakukanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya, janganlah kalian mengambil harta orang lain secara batil (ilegal). Seperti merampas, mencuri, suap-menyuap, dan lain-lain. Kecuali harta itu menjadi barang dagangan; berlandaskan kerelaan antara pihak yang berakad. Harta semacam itulah yang halal kalian makan dan belanjakan. Dan janganlah kalian membunuh orang lain, bunuh diri, dan menjerumuskan diri kalian sendiri ke dalam kebinasaan. Sesungguhnya Allah Maha Penyayang terhadap kalian. Salah satu bentuk kasih sayang Allah kepada kalian ialah Dia mengharamkan darah, harta, dan kehormatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Setelah Allah menjelaskan cara berlaku terhadap diri dengan menikah, kemudian Allah menjelaskan cara berlaku terhadap harta yang dapat digunakan untuk menjalankan pernikahan dan pembelian budak wanita; sehingga Dia melarang hamba-hamba-Nya yang beriman dari memakan harta orang lain dengan cara yang batil, yaitu mencari harta dengan cara yang dilarang oleh syariat seperti mencuri, menipu, mengutil, berjudi, dan berinteraksi dengan riba. Namun Allah menghalalkan harta yang didapat dari perdagangan dan pekerjaan dan muamalat yang dibolehkan syariat yang dilakukan dengan suka sama suka. Kemudian Allah melarang hamba-hamba-Nya yang beriman dari saling membunuh atau benuh diri, sebab Allah mengasihi mereka. Salah satu dari rahmat-Nya adalah dengan melindungi darah dan harta mereka dan melarang untuk ditumpahkan, serta tidak membebani mereka dengan bunuh diri saat bertaubat sebagaimana cara bertaubat Bani Israil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَأْكُلُوٓا۟ أَمْوٰلَكُم بَيْنَكُم بِالْبٰطِلِ (Hai orang-orang yang beriman, janganlah kamu saling memakan harta sesamamu dengan jalan yang batil) Telah dijelaskan tafsir ayat ini pada surat al-Baqarah: 188. إِلَّآ أَن تَكُونَ تِجٰرَةً (kecuali dengan jalan perniagaan) Yakni mata pencaharian dengan jual beli, Allah menyebutkan jual beli dan bukan kegiatan pertukaran barang lainnya karena ia merupakan yang paling banyak dan paling dominan. عَن تَرَاضٍ مِّنكُمْ ۚ (yang berlaku dengan suka sama-suka) Makna (التراضي) atau suka sama suka yakni kedua belah pihak yang bertransaksi mengetahui apa yang diambilnya, tanpa ada kecurangan, penipuan, maupun penyembunyian aib, yang kemudian saling berpisah dengan penuh rasa rela. Dan pendapat lain mengatakan jika kedua belah pihak saling rela setelah terjadinya akad maka perniagaan itu halal hukumnya, meski keduanya belum berpisah. وَلَا تَقْتُلُوٓا۟ أَنفُسَكُمْ ۚ( Dan janganlah kamu membunuh dirimu) Yakni wahai kaum muslimin janganlah sebagian kalian saling membunuh sebagian lainnya kecuali dengan sebab yang telah ditetapkan dalam Syariah; dan janganlah seseorang membunuh dirinya sendiri. Dalam hadist disebutkan: “Barangsiapa membunuh dirinya sendiri dengan meminum racun, maka racunnya itu akan ia minum teguk demi teguk di neraka sedang ia kekal didalam neraka selamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Wahai orang-orang yang beriman, janganlah kalian mengambil harta selain milik kalian dengan cara yang diharamkan syariat, sepeti riba, judi, memalak, dan menipu. Namun kalian diperbolehkan untuk mengambil harta mereka dengan melakukan perniagaan yang berdasarkan pada kerelaan atau dengan kebaikan hati antara dua belah pihak, dan berpegang teguh pada syariat. At-Tijarah adalah tindakan jual-beli. At-Taradhi adalah transaksi antara dua orang yang melakukan jual-beli tanpa adanya tipuan, tindakan menutupi kecacatan barang, tindakan perjudian dan riba. Dan sebaiknya kalian tidak saling membunuh dengan cara yang zalim dan penuh kebencian, tanpa dibenarkan oleh syariat. Dan sebaiknya seseorang tidak bunuh diri. Sesungguhnya Allah Maha Pengasih terhadap kalian dengan mengharamkan dan mencegah kalian melakukan perkara tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian memakan harta di antara kalian} janganlah sebagian kalian mengambil harta sebagian lainnya {dengan cara yang bathil}dengan haram seperti riba dan secara paksa {kecuali berupa perniagaan atas dasar suka sama suka di antara kalian. Janganlah kalian membunuh diri kalian.} Janganlah sebagian kalian membunuh sebagian lainnya {Sesungguhnya Allah adalah Maha Penyayang kepada kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Allah melarang para hambaNya yang beriman dari memakan harta diantara mereka dengan cara yang batil, hal ini mencakup memakan harta dengan cara pemaksaan , pencurian, mengambil harta dengan cara perjudian, dan pencaharian yang hina bahkan bisa jadi termasuk juga dalam hal ini adalah memakan harta sendiri dengan sombong dan berlebih-lebihan, karena hal tersebut adalah termasuk kebatilan dan bukan dari kebenaran. kemudian setelah Allah mengharamkan memakan harta dengan cara yang batil, Allah membolehkan bagi merekla memakan harta dengan cara perniagaan dan pencaharian yang tidak terdapat padanya penghalang-penghalang dan yang mengandung syarat-syarat seperti saling ridha dan sebagainya. ”dan janganlah kamu membunuh dirimu” maksudnya, janganlah sebagian kalian membunuh sebagain yang lain, dan janganlah seseorang membunuh dirinya, dan termasuk dalam hal itu adalah menjerumuskan diri kedalam kehancuran dan melakukan perbuatan-perbuatan berbahaya yang mengakibatkan kematian dan kebiasaan, ”sesungguhnya Allah maha penyayang kepadamu” dan diantara rahmatNya adalah dimana Allah memelihara diri, dan harta kalian, serta melarang kalian dari menyia-nyiakan dan membinasakannya, dan Allah menjadikan adanya hukuman atas hal tersebut berupa had-had. Perhatikanlah suatu ringkasan dan penyatuan dalam firman Allah “janganlah kamu saling memakan harta sesamamu” dan “dan janganlah kamu membunuh dirimu” bagaimana firmanNya itu mencakup harta-harta selain dirimu, harta dirimu sendiri, membunuh dirimu dan membunuh selain dirimu dengan ungkapan yang begitu pendek daripada perkataan “janganlah sebagian kalian memakan harta sebagian lain dan janganlah sebagian kalian membunuh sebagian yang lain” dengan tidak mencakupnya ungkapan tersebut akan harta orang lain dan membunuh orang lain padahal menghubungkan kata dengan harta dan jiwa kepada seluruh kaum mukminin merupakan dalil bahwa kaum mukminin dalam kasih sayang mereka, mencintai dan mengasihi diantara mereka dan maslahat-maslahat mereka adalah seperti satu tubuh, dimana keimanan itulah yang menyatukan mereka pada maslahat-maslahat mereka, dunia maupun akhirat. Dan tatkala Allah melarang mereka dari memakan harta dengan cara yang batil yaitu suatu cara yang mengandung marabahaya atas diri mereka, terhadap orang yang memakannya dan orang yang mengambil hartanyalalu Allah membolehkan bagi mereka perkara yang mengandung kemaslahatan untuk mereka berupa beberapa bentuk mata pencaharian dan perniagaan serta beberapa bentuk profesi dan persewaan dengan berfirman, ”kecuali dengan jalan perniagaan yang berlaku dengan suka sama suka dianatar kamu” yaitu bahwasannya hal tersebut adalah boleh bagi kalian. dan Allah mensyaratkan adanya keridhaan dari kedua pihak padahal perkara itu adalah sebuah perniagaan hal itu menjadi suatu indikasi bahwasannya akad perniagaan itu disyariatkan bukan dari akad riba karena riba bukan lah dari perniaagaan bahkan riba itu adalah perkara yang bertentangan dengan maksud dari perniagaan.didalam perniagaan harus ada keridhaan dari kedua belah pihak dan masing-masing pihak melaksanakannya dengan penuh kesadaran dan pilihannya dan merupakan kesempurnaan dari saling merelakan adalah agar apa yang menjadi akad atasnya itu adalah suatu barang yang diketahui, karena bila tidak diketahui maka tidaklah aka nada yang namanya suka sama suka, dan agar barang tersebut mampu diserahkan, karena barang yang tidak mampu diserahkan adalah sejenis dengan tindakan perniagaan perjudian. dari perniagaan gharar (yang memiliki unsur penipuan) dengan segala bentuknya yang tidak mengandung saling suka sama suka, maka akadnya tidaklah sah. ayat ini menunjukan bahwa juga bahwa akad itu akan terlaksana (sah) dengan hal apapun yang menunjukan kepadanya berupa perkataan maupun perbuatan karena Allah telah mensyaratkan suka sama suka padanya, maka dengan jalan apapun tercapainya suka sama suka niscaya tercapai pula akadnya dengan hal tersebut. Kemudian Allah menutup ayat ini dengan firmanNya “sesungguhnya Allah Maha Penyayang kepadamu” dan diantara bentuk rahmatNya adalah Allah melindungi darah dan harta-harta kalian, memeliharanya, dan melarang kalian dari menumpuhkannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﺁﻣﻨﻮا} Aamanuu: mempercayai Allah dan Rosul-Nya. {ﺑﺎﻟﺒﺎﻃﻞ} Bil baathil: dengan tanpa hak yang memperbolehkan untuk memakannya {ﺗﺠﺎﺭﺓ} Tijaaroh: transaksi jual beli yang berkonsekuensi halal bagi pemilik barang untuk mengambil uang, dan empunya uang dihalalkan untuk mengambil barang jika tidak ada kebatilan di dalam transaksi. {ﺗﻘﺘﻠﻮا ﺃﻧﻔﺴﻜﻢ} Taqtuluu anfusakum: saling menumpahkan darah. Makna Ayat: Masih dalam konteks penjelasan yang halal dan haram dari harta, kehormatan dan jiwa. Dan dalam ayat ini (29) Allah menyeru kepada para hambanya yang beriman dengan gelar iman {ﻳﺎ ﺃﻳﻬﺎ اﻟﺬﻳﻦ ﺁﻣﻨﻮا}. Allah melarang mereka dari saling memakan harta mereka dengan cara yang batil dengan cara pencurian, penipuan, judi, riba dan hal-hal yang mengarah kepadanya dari berbagai jumlah perharaman yang lain. Allah berfirman {ﻻ ﺗﺄﻛﻠﻮا ﺃﻣﻮاﻟﻜﻢ ﺑﻴﻨﻜﻢ ﺑﺎﻟﺒﺎﻃﻞ} “janganlah kalian mekakan harta diantara kalian dengan cara batil”, yaitu tanpa diganti dengan yang baik atau kerelaan hati. Kemudian adanya pengecualian harta jual beli yang dihasilkan di atas prinsip suka rela dari dua jenis jual-beli berdasarkan hadis “jual-beli harus dilandasi dengan suka rela” dan “Jual-beli dengan prisip khiyar sebelum si penjual dan si pembeli berpisah” Allah berfirman {ﺇﻻ ﺃﻥ ﺗﻜﻮﻥ ﺗﺠﺎﺭﺓ ﻋﻦ ﺗﺮاﺽ3 ﻣﻨﻜﻢ} “Kecuali jikalau jual-beli yang dilandasi prinsip suka rela” tidaklah mengapa dikonsumsi, maka sesungguhnya itu adalah halal. Ini adalah apa yang terkandung dalam ayat seperti apa ada di dalamnya berupa keharaman pembunuhan diantara kaum mukminin. Allah berfirman {ﻭﻻ ﺗﻘﺘﻠﻮا ﺃﻧﻔﺴﻜﻢ} “Janganlah kalian saling membunuh”. Larangan mencangkup bunuh diri ataupun membunuh orang mukmin yang lain. Karena kaum muslimin seperti raga yang satu, oleh karenanya membunuh seorang muslim adalah seperti membunuh dirinya sendiri. Allah menyebutkan penjelasan keharamannya kepada kita {ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﺑﻜﻢ ﺭﺣﻴﻤﺎ} “sesungguhnya Allah Maha Penyayang kepada diri kalian. Sebab itu Allah mengharamkan saling membunuh. Ini adalah apa yang ada dalam ayat pertama (29). Pelajaran dari Ayat: • Haramnya harta seorang muslim, saat diperoleh dengan mencuri, penipu, judi atau riba. • Bolehnya berdagang dan anjuran untuk berdagang di dalam ayat di atas serta sebagai bentuk sanggahan terhadap orang-orang pandir dari kalangan Sufi yang melarang orang bekerja dengan dalih tawakal. • Ketetapan prinsip “Sesungguhnya jual beli berasaskan atas rasa suka-rela” dan prinsip “Jual-beli masih dalam status khiyar selama belum terjadi perpisahan antara sang penjual dan pembeli”. • Haramnya seorang muslim untuk bunuh diri ataupun membunuh orang lain sesama muslim karena kaum muslimin adalah umat yang satu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 29: Hai orang-orang yang beriman! Janganlah kamu makan harta-harta kamu di antara kamu dengan bathil, kecuali adalah (atas jalan) perdagangan dengan ridha antara kamu, dan janganlah kamu bunuh diri kamu, karena sesungguhnya Allah itu adalah Penyayang kepada kamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini mencakup semua jalan yang batil dalam meraih harta seperti riba, merampas, mencuri, judi dan jalan-jalan rendah lainnya, lihat pula tafsir surat Al Baqarah: 188. Di samping melarang memakan harta orang lain dengan jalan yang batil, di mana di dalamnya terdapat bahaya bagi mereka, baik bagi pemakannya maupun orang yang diambil hartanya, Allah menghalalkan kepada mereka semua yang bermaslahat bagi mereka seperti berbagai bentuk perdagangan dan berbagai jenis usaha dan keterampilan. Disyaratkan atas dasar suka sama suka dalam perdagangan untuk menunjukkan bahwa akad perdagangan tersebut bukan akad riba, karena riba bukan termasuk perdagangan, bahkan menyelisihi maksudnya, dan bahwa kedua belah pihak harus suka sama suka dan melakukannya atas dasar pilihan bukan paksaan. Oleh karena itu, jual beli gharar (tidak jelas) dengan segala bentuknya adalah haram karena jauh dari rasa suka sama suka. Termasuk sempurnanya rasa suka sama suka adalah barangnya diketahui dan bisa diserahkan. Jika tidak bisa diserahkan mirip dengan perjudian. Di sana juga terdapat dalil bahwa akad itu sah baik dengan ucapan maupun perbuatan yang menunjukkan demikian, karena Allah mensyaratkan ridha, oleh karenanya dengan cara apa pun yang dapat menghasilkan keridhaan, maka akad itu sah. Larangan membunuh diri sendiri mencakup juga larangan membunuh orang lain, sebab membunuh orang lain berarti membunuh diri sendiri, karena umat merupakan suatu kesatuan. Demikian juga terdapat larangan melakukan sesuatu yang menyebabkan dirinya binasa di dunia atau akhirat. Syaikh As Sa'diy berkata, \"Perhatikanlah kata-kata yang ringkas dan padat ini dalam firman Allah Ta'ala \"Janganlah kamu saling memakan harta sesamamu\" dan \"Dan janganlah kamu membunuh dirimu\" bagaimana di dalamnya mencakup memakan harta orang lain dan harta kamu, serta mencakup membunuh dirimu dan membunuh selainmu dengan uraian yang terbatas pada harta orang lain dan jiwa orang lain saja. Di samping itu, penyandaran harta dan jiwa kepada kaum mukmin secara umum terdapat dalil bawa kaum mukmin dalam hal rasa cinta, rasa berkasih-sayang dan dalam maslahat mereka seperti satu jasad, di mana iman yang menyatukan mereka atas maslahat agama maupun dunia.\" Di antara kasih sayang-Nya adalah menjaga darah dan hartamu dan melarang kamu merusaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 29",
    "description": "Ayat-ayat yang lalu berbicara tentang hukum pernikahan, sementara pernikahan itu tidak bisa dilepaskan dari harta, terutama berkaitan dengan maskawin. Oleh sebab itu, ayat berikut berbicara tentang bagaimana manusia beriman mengelola harta sesuai dengan keridaan Allah. Wahai orang-orang yang beriman! janganlah sekali-kali kamu saling memakan atau memperoleh harta di antara sesamamu yang kamu perlukan dalam hidup dengan jalan yang batil, yakni jalan tidak benar yang tidak sesuai dengan tuntunan syariat, kecuali kamu peroleh harta itu dengan cara yang benar dalam perdagangan yang berlaku atas dasar suka sama suka di antara kamu yang tidak melanggar ketentuan syariat. Dan janganlah kamu membunuh dirimu atau membunuh orang lain karena ingin mendapatkan harta. Sungguh, Allah maha penyayang kepadamu dan hamba-hamba-Nya yang berimandan barang siapa berbuat demikian, dalam memperoleh harta, dengan cara melanggar hukum dan dengan berbuat zalim, maka akan kami masukkan dia ke dalam neraka. Yang demikian itu, yakni menjatuhkan hukuman dengan siksaan neraka, adalah sesuatu hal yang sangat mudah bagi Allah."
  }
]