[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan jika kalian khawatir tidak bisa berbuat adil dalam memperlakukan anak-anak yatim perempuan yang berada di bawah tanggung jawab kalian, dengan tidak memberikan kepada mereka mahar-mahar mereka seperti wanita lainnya, maka tinggalkanlah mereka dan nikahi wanita-wanita yang kalian sukai sealin mereka, dua, tiga, atau empat. Lalu apabila kalian khawatir tidak dapat berbuat adil di antara mereka, maka cukuplah kalian dengan satu saja, atau dengan budak-budak perempuan yang kalian miliki. Hal itulah yang telah Aku syariatkan bagi kalian terkait anak-anak yatim perempuan dan menikahi seorang wanita sampai empat, atau cukup menikahi seorang perempuan saja ata hambasahaya perempuan yang kalian miliki, itu adalah lebih dekat untuk tidak berbuat curang dan melampaui batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Dan apabila kalian takut tidak akan dapat berlaku adil jika kalian menikah dengan anak-anak perempuan yatim yang berada di bawah perwalian kalian (boleh jadi takut mengurangi mas kawin yang seharusnya menjadi hak milik mereka, atau memperlakukan mereka secara buruk) maka hindarilah mereka dan menikahlah dengan wanita-wanita baik lainnya. Jika kalian mau, menikahlah dengan dua wanita, tiga wanita atau empat wanita. Namun jika kalian takut tidak akan dapat berlaku adil kepada mereka, maka cukuplah menikah dengan satu wanita saja. Atau bersenang-senanglah dengan budak-budak wanita yang kalian miliki, karena hak-hak mereka tidak sama dengan para istri. Ketentuan yang ada di dalam ayat tersebut yang berkenaan dengan urusan anak-anak yatim, membatasi diri dengan menikahi satu orang wanita, dan bersenang-senang dengan budak wanita itu lebih memungkinkan kalian untuk tidak berbuat sewenang-wenang dan menyimpang dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Dan jika kalian takut berbuat zalim terhadap anak-anak yatim perempuan yang kalian asuh, maka janganlah kalian menikahi mereka, dan menikahlah dengan wanita selain mereka yang telah dihalalkan bagi kalian, baik itu dua, tiga, atau empat wanita. Namun jika kalian takut tidak bisa berbuat adil dengan istri-istri kalian, maka nikahilah seorang wanita saja atau nikahilah budak wanita yang kalian miliki. Hukum ini lebih mudah untuk tidak berbuat zalim. Poligami dalam pernikahan ini secara umum bermanfaat bagi anak-anak yatim dalam hal pengasuhan mereka, sebab semakin banyak orang yang akan memberi mereka perhatian. Demikianlah hukum agung yang lebih memperhatikan hak-hak anak-anak yatim dan hak-hak para istri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَإِنْ خِفْتُمْ أَلَّا تُقْسِطُوا۟ فِى الْيَتٰمَىٰ فَانكِحُوا۟ (Dan jika kamu takut tidak akan dapat berlaku adil terhadap (hak-hak) perempuan yang yatim (bilamana kamu mengawininya), maka kawinilah) Ada seorang laki-laki yang mengasuh seorang perempuan yatim karena ia adalah wali dari anak tersebut, kemudian laki-laki ini ingin menikahinya namun tidak berlaku adil dalam maharnya, yakni tidak memberinya sebagaimana suami-suami lain memberi mahar istri-istri mereka. Maka Allah melarang para wali menikahi mereka kecuali dengan berlaku adil kepada mereka dan memantaskan mahar mereka dan seluruh hak-hak lainnya sebagai istri. Dan Allah memerintahkan kepada mereka untuk menikahi wanita-wanita lain selain mereka; yakni barangsiapa yang memungkinan besar akan lalai dalam berlaku adil terhadap perempuan yatim bersebut maka hendaklah ia tidak menikahinya, lalu menikahi wanita lainnya. مَا طَابَ (yang kamu senangi) Yakni wanita yang kalian sukai yang termasuk halal untuk kalian nikahi, adapun yang diharamkan bagi kalian maka itu bukan sesuatu yang baik bagi kalian. مِّنَ النِّسَآءِ (wanita-wanita (lain)) Yakni yang selain perempuan-perempuan yatim yang kalian asuh. مَثْنَىٰ وَثُلٰثَ وَرُبٰعَ ۖ (dua, tiga atau empat) Yakni nikahilah dua wanita, atau tiga, atau empat, dan tidak boleh lebih dari empat wanita untuk satu laki-laki. فَإِنْ خِفْتُمْ أَلَّا تَعْدِلُوا۟ فَوٰحِدَةً(emudian jika kamu takut tidak akan dapat berlaku adil, maka (kawinilah) seorang saja) Yakni apabila kalian takut tidak dapat berlaku adil diantara istri-istrimu dalam pembagian nafkah dan lainnya maka nikahilah satu istri saja dan jangan lebih dari itu. Pendapat lain mengatakan yakni tidak dapat berlaku adil dalam rasa cinta. أَوْ مَا مَلَكَتْ أَيْمٰنُكُمْ (atau budak-budak yang kamu miliki) Yakni dari budak wanita meski jumlah mereka banyak, dan yang dimaksud dengan mengawini mereka adalah dengan kepemilikan bukan dengan perkawinan; dan budak-budak tersebut tidak memiliki hak pembagian nafkah. ذٰلِكَ أَدْنَىٰٓ أَلَّا تَعُولُوا۟ (Yang demikian itu adalah lebih dekat kepada tidak berbuat aniaya) Yakni mencukupkan diri dengan satu istri lebih selamat dari kezaliman jika dibandingkan dengan pilih kasih dengan salah satu istri ketika berpologami. Imam Syafi’i berpendapat bahwa yang dimaksud dengan (ألا تعولوا) yakni agar tidak menjadi banyak tanggunganmu. Dan Sufyan ats-Tsauri berpendapat yakni agar kalian tidak menjadi miskin."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Dan jika kalian khawatir bila tidak bisa berbuat adil dalam perkara anak yatim, seperti menikahi mereka dengan mahar yang kecil, maka takutlah juga berbuat kezaliman yang lainnya, yaitu tidak berbuat adil antara perempuan yang kalian nikahi. Untuk mencegah kezaliman Allah membatasi maksimal jumlah istri. Maka nikahilah wanita yang dihalalkan bagi kalian dari golongan yang berbeda, yaitu menikahi, dua, tiga, atau empat wanita saja. Maka jika kalian khawatir tidak berbuat adil di antara mereka, maka menikahlah dengan satu orang saja, atau budak-budak bagaimanapun banyaknya jumlah mereka tanpa syarat pembagian (keadilan dalam tempat istirahat) bagi budak wanita. Dan terbatas menikahi satu wanita yang merdeka itu lebih dekat untuk tidak berbuat aniaya di antara mereka. Ayat ini turun untuk mencegah menikahi anak yatim perempuan tanpa berbuat adil dalam memberikan mas kawin sehingga tidak memberinya mas kawin yang sama dengan istri lain yang sebaya, dan mereka diperintahkan agar terbatas menikahi 4 istri saja."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian khawatir tidak akan mampu berlaku adil} berlaku adil {terhadap perempuan yatim maka nikahilah} maka nikahilah {perempuan yang baik} yang halal dan baik {dua, tiga, atau empat} dua, tiga, atau empat {Akan tetapi jika kalian khawatir tidak akan mampu berlaku adil, maka seorang saja} maka persempitlah menjadi satu wanita saja {atau hamba sahaya perempuan yang kalian miliki. Yang demikian itu lebih dekat untuk tidak berbuat zalim} lebih dekat untuk tidak berlaku sewenang-wenang dan menyimpang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Maksudnya, apabila kalian takut tidak berlaku adil terhadap wanita-wanita yatim yang ada dalam pengasuhan dan perwalian kalian, dan kalian takut tidak mampu menunaikan hak-hak mereka yang disebabkan kalian tidak mencintai mereka, maka carilah wanita-wanita selain mereka, lalu nikahilah, ”wanita-wanita (lain) yang kau senangi, ”maksudnya, wanita-wanita yang kalian pilih yang memiliki agama, harta, kecantikan, dan keturunan yang baik dan lain sebagainya di antara sifat-sifat yang mendorong untuk menikahi ereka. Pilihlah mereka menurut pendapat kalian, dan sebaik-baik sifat yang menjadi patokan dalam memilih adalah agama, sebagaimana nabi bersabda, ”wanita dinikahi karena empat hal; karena hartanya. kecantikannya, keturunannya, dan agamanya, dan pilihlah yang memiliki agama, niscaya beruntunglah kamu. ” Ayat ini menunujukan bahwa seyogyanya seseorang itu memilih wanita sebelum menikahinya, bahkan syariat telah membolehkan baginya untuk memandang wanita yang hendak dinikahinya itu agar ia benar-benar mengetahui segala hal secara pasti tentang wanita tersebut. Kemudian Allah menyebutkan jumlah wanita boleh dinikahinya seraya berfirman, ”dua, tiga, atau empat.” maksudnya, barangsiapa yang hendak menikahi dua wanita, maka boleh ia lakukan, atau tiga maka boleh ia lakukan, atau empat maka boleh ia lakukan; dan tidaklah boleh baginya melebihi dari jumlah tersebut, karena ayat ini disebutkan dalam rangka menjelaskan jumlah yang paling banyak (yang dibolehkan)maka tidaklah boleh melebihi apa yang telah Allah sebutkan berdasarkan ijma’ Yang demikian itu karena seorang laki-laki terkadang tidak mampu menahan syahwatnya hanya dengan seorang istr, karena itu dibolehkan baginya seorang istri lagi setelah seorang istri (pertama) hingga mencapai empat orang istri. Karena dengan julah empat orang wanita itu telah mencukupi bagi kaum laki-laki kecuali bagi segelintir laki-laki. Walaupun demikian, hal tersebut dibolehkan baginya apabila ia merasa mampu untuk tidak berlaku zhalim dan aniaya dan yakin dapat memenuhi hak-hak mereka semua, namun apabila ia takut dari hal-hal tersebut, maka sebaiknya ia mencukupi hanyadengan seorang istri saja atau hanya dengan budak wanitanya, karena ia tidak wajib untuk membagi malam bagi budak wanitanya tersebut. \"yang demikian itu,” yaitu mencukupkan hanya dengan seorang istri atau dengan budak wanita, ”adalah lebih dekat tidak berbuat aniaya.” yaitu berbuat zhalim. Ini menunjukan bahwa seorang hamba yang mengahdapkan dirinya kepada suatu perkara yang ditakuti bahwa ia akan melakukan kezhaliman, aniaya, dan tidak menunaikan kewajiban, walaupun perkara itu adalah suatu hal yang mubah, maka seyogyanya ia tidak melakukan hal itu. Akan tetapi ia harus konsisten terhadap hal yang baik dan selamat, karena sesungguhnya sebaik-baik perkara yang diberikan kepada seorang hamba itu adalah selamat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ﺃﻻ ﺗﻘﺴﻄﻮا alla tuqsithu: kalian tidak adil ﻣﺜﻨﻰ ﻭﺛﻼﺙ ﻭﺭﺑﺎﻉ Matsna wa tsulatsa wa ruba’: dua, tiga atau empat yang mana tidak halal lebih dari empat. ﺃﺩﻧﻰ ﺃﻻ ﺗﻌﻮﻟﻮا Adna alla ta’ulu: Lebih dekat untuk tidak condong diantara para istri. Makna ayat : Adapun makna ayat yang kedua: Allah telah memberikan petunjuk kepada para wali anak perempuan yang yatim, hendaknya mereka takut dari memperlakukan tidak adil terhadap perempuan-perempuan yatim. Jika para wali yatim menikah lebih baik untuk menikah dengan dua, tiga atau empat dari para wanita selain dengan wanita-wanita yatim yang dalam pengasuhannya. Menikah dengan dua, tiga, atau tiga sesuai dengan kemampuannya adalah lebih baik daripada menikah dengan anak yatim yang di bawah kepengasuhannya kemudian melahap harta wanita yatim tersebut sebab hak yatim tersebut itu ebih dibutuhkan oleh para kerabatnya. Ini adalah makna dari ayat {ﻭﺇﻥ ﺧﻔﺘﻢ ﺃﻻ ﺗﻘﺴﻄﻮا ﻓﻲ اﻟﻴﺘﺎﻣﻰ ﻓﺎﻧﻜﺤﻮا ﻣﺎ ﻃﺎﺏ ﻟﻜﻢ ﻣﻦ اﻟﻨﺴﺎء ﻣﺜﻨﻰ ﻭﺛﻼﺙ ﻭﺭﺑﺎﻉ} Firman Allah ta’ala {ﻓﺈﻥ ﺧﻔﺘﻢ ﺃﻻ ﺗﻌﺪﻟﻮا ﻓﻮاﺣﺪﺓ ﺃﻭ ﻣﺎ ﻣﻠﻜﺖ ﺃﻳﻤﺎﻧﻜﻢ} Allah ingin jikalau seorang mukmin takut untuk tidak berbuat adil kepada para istrinya karena ketidak mampuannya, maka menikahlah dengan satu wanita saja dan merasa cukup dengannya serta tidak menikah dengan yang lain. Atau menikah dengan budak wanitanya jikalau dia memiliki hamba sahaya, dan yang demikian itu lebih selamat daripada pernikahannya dengan anak yatim akan berakibat melencengnya seorang mukmin dan terlazimnya para wanita. Ini adalah makna ayat {ﻓﺈﻥ ﺧﻔﺘﻢ ﺃﻻ ﺗﻌﺪﻟﻮا ﻓﻮاﺣﺪﺓ ﺃﻭ ﻣﺎ ﻣﻠﻜﺖ ﺃﻳﻤﺎﻧﻜﻢ ﺫﻟﻚ ﺃﺩﻧﻰ ﺃﻻ ﺗﻌﻮﻟﻮا} Pelajaran dari ayat : • Bolehnya menikahi lebih dari satu wanita sampai 4 selama tiada ketidakadilan dan kecondongan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 3: Kamu tidak akan bisa berlaku adil tentang (perkawinan kamu dengan) anak-anak yatim, maka kawinlah beberapa perempuan yang kamu sukai: dua-dua, dan tiga-tiga, dan empat-empat; tetapi jika kamu takut bahwa kamu bisa berlaku adil (pula) maka (kawinlah) seorang saja, atau hamba- hamba yang dimiliki oleh tangan-tangan kanan kamu. Yang demikian itu, lebih hampir buat kamu terhindar dari berlaku aniaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Aisyah radhiyallahu 'anha, bahwa ada seseorang yang memiliki seorang anak yatim perempuan, lalu laki-laki itu menikahinya, dan ia memiliki seranting kurma, sehingga ia menahan wanita itu karenanya, sedangkan dalam dirinya tidak ada rasa suka terhadap si wanita, maka turunlah ayat, \"Wa in khiftum allaa tuqsithuu fil yataamaa.\" Saya kira (yakni menurut Hisyam bin Yusuf seorang rawi), \"Si yatim ini adalah sekutunya dalam ranting kurma itu dan dalam hartanya.\" Misalnya tidak memberikan mereka mahar seperti halnya wanita-wanita yang lain. Yang sesuai dengan pilihanmu, misalnya baik dalam beragama, berharta, cantik, berkedudukan dan bernasab serta sifat-sifat lain yang mendorong untuk menikahinya, namun yang utama adalah mencari yang baik agamanya (shalihah) sebagaimana yang disarankan Nabi Muhammad shallallahu 'alaihi wa sallam. Dalam ayat ini diterangkan bahwa sepatutnya seseorang memilih calon istri yang tepat sebelum menikah, bahkan syari' (penetap syari'at) membolehkannya untuk melihat wanita yang hendak dinikahi agar ia betul-betul matang dalam memilih. Jangan lebih dari empat. Berlaku adil di sini adalah perlakuan yang adil dalam memenuhi kebutuhan istri seperti dalam hal pakaian, tempat, giliran dan lain-lain yang bersifat lahiriyah. Islam memperbolehkan poligami dengan syarat dirinya bisa berlaku adil dan sanggup memenuhi hak istri yang lain. sebelum turun ayat ini poligami sudah ada, dan pernah pula dijalankan oleh para nabi sebelum Nabi Muhammad shallallahu 'alaihi wa sallam. Dalam ayat ini diterangkan bahwa batas poligami hanya sampai empat wanita saja. Karena mereka tidak memiliki hak yang sama dengan istri sehingga tidak wajib adil, seperti dalam hal giliran. Menikahi wanita sampai empat (tidak lebih), atau satu saja atau dengan budak wanita."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 3",
    "description": "Diriwayatkan dari aisyah bahwa ayat ini turun berkaitan dengan anak yatim yang berada dalam pemeliharaan seorang wali, di mana hartanya bergabung dengan harta wali dan sang wali tertarik dengan kecantikan dan harta anak yatim itu, maka ia ingin mengawininya tanpa memberinya mahar yang sesuai, lalu turunlah ayat ini. Dan jika kamu khawatir tidak akan mampu berlaku adil terhadap hak-hak perempuan yatim yang berada di bawah kekuasaanmu, lantaran muncul keinginan kamu untuk tidak memberinya mahar yang sesuai bilamana kamu ingin menikahinya, maka urungkan niatmu untuk menikahinya, kemudian nikahilah perempuan merdeka lain yang kamu senangi dengan ketentuan batasan dua, tiga, atau empat orang perempuan saja. Tetapi jika kamu khawatir tidak akan mampu berlaku adil apabila menikahi lebih dari satu perempuan dalam hal memberikan nafkah, tempat tinggal, atau kebutuhan-kebutuhan lainnya, maka nikahilah seorang perempuan saja yang kamu sukai atau hamba sahaya perempuan yang kamu miliki dari para tawanan perang. Yang demikian itu lebih dekat pada keadilan agar kamu tidak berbuat zalim terhadap keluarga. Karena dengan berpoligami banyak beban keluarga yang harus ditanggung, sehingga kondisi seperti itu dapat mendorong seseorang berbuat curang, bohong, bahkan zalimdan apabila telah mantap dalam menetapkan pilihan dan siap untuk menikah dengan wanita pujaan kamu, maka berikanlah maskawin yakni mahar kepada perempuan yang kamu nikahi sebagai pemberian yang penuh kerelaan, karena mahar merupakan hak istri dan kewajiban yang harus dipenuhi oleh suami terhadapnya. Suami tidak boleh berbuat semenamena terhadapnya atas dasar pemberian tersebut. Kemudian, jika mereka, para istri menyerahkan kepada kamu sebagian dari maskawin itu dengan senang hati sebagai hadiah untuk kalian, maka terimalah hadiah itu dan nikmatilah pemberian itu dengan senang hati. Dengan demikian, pemberian itu halal dan baik untuk kalian."
  }
]