[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa mengerjakan sesuatu yang telah Allah larang mengerjakannya berupa mengambil harta haram seperti;mencuri,merampas,menipu dengan melanggar hak orang lain dan bertindak di luar batas ajaran syariat,maka Allah kelak akan memasukkannya kedalam neraka, ia akan merasakan panasnya.Dan hal itu mudah bagi Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Barangsiapa yang melakukan hal yang dilarang itu, kemudian ia memakan harta orang lain atau melanggar haknya dengan cara membunuhnya dan sebagainya, sedangkan ia mengetahui (hukumnya) serta semena-mena, bukan karena tidak tahu atau lupa, maka Allah akan memasukkannya ke dalam Neraka yang sangat besar kelak pada اari Kiamat. Ia akan menahan panasnya dan menderita akibat siksaannya. Dan hal itu sangatlah mudah bagi Allah. Karena Dia Mahakuasa, tidak ada sesuatu pun yang dapat menghalangi kehendak-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Dan barangsiapa yang tetap melakukan apa yang diharamkan Allah seperti memakan harta orang lain dengan cara yang batil, membunuh orang lain tanpa alasan yang dibenarkan sedangkan dia mengetahui larangan ini, maka Allah akan memasukkannya ke dalam neraka. Pemberian azab ini merupakan hal mudah bagi Allah, tidak ada yang dapat menghalangi-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَمَن يَفْعَلْ ذٰلِكَ (Dan barangsiapa berbuat demikian) Yakni yang memakan harta orang lain dengan cara bathil atau yang membunuh. عدوانا وظلما (dengan melanggar hak dan aniaya) Yakni yang sengaja melakukan aniaya tanpa dasar yang dibenarkan, seperti mengambil harta orang lain dengan cara menjambret atau mencuri; atau membunuh orang lain bukan dalam rangka menegakkan qishash, had, atau menghukum orang murtad. فسوف نصليه (maka Kami kelak akan memasukkannya) Yakni memasukkannya kedalam neraka yang dahsyat. وَكَانَ ذٰلِكَ (Yang demikian itu) Yakni memasukkan ke dalam neraka itu. عَلَى اللهِ يَسِيرًا (adalah mudah bagi Allah) Karena tidak ada yang susah bagi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Barangsiapa mengambil harta orang lain secara paksa dan dengan menzalimi mereka, seperti merampok dan memalak, atau membunuh seseorang dengan sengaja dan penuh kebencian diluar hukum qishash, tanpa adanya batasan dan tindakan pembalasan dalam hal itu, maka Kami akan memasukkannya ke dalam api yang sangat besar (neraka) di akhirat. Hukuman itu sangat mudah bagi Allah, dan tidak ada apapun yang bisa melemahkanNya. Al-‘Udwan adalah menyerang orang lain disertai dengan niat, dan Az-zhulmu adalah tindakan yang menyalahi kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang berbuat demikian dengan cara melanggar aturan} melanggar yang lain {dan berbuat zalim} menzalimi diri sendiri dengan melebih-lebihkannya sebagai hukuman {maka Kami masukkan dia} Kami memasukkan dia {ke dalam neraka. Yang demikian itu adalah mudah bagi Allah} mudah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. kemudian Allah berfirman “dan barangsiapa berbuat demikian” yaitu memakan harta dengan cara yang batil dan membunuh jiwa “dengan melanggar hak dan aniaya” yaitu bukan karena tidak tahu dan lupa, ”maka kami kelak akan memasukannya kedalam neraka” yaitu yang dahsyat, sebagaimana yang ditunjukan oleh kata yang tak terbatas, ”yang demikian itu adalah mudah bagi Allah”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻋﺪﻭاﻧﺎ ﻭﻇﻠﻤﺎ} Udwanan wa zhulman: permusuhan yang ada kezalimannya. {ﻧﺼﻠﻴﻪ ﻧﺎﺭا} Nushliihi naaro: kami akan mecampakkannya kedalam api jahannam dan terbakar di dalamnya. Makna ayat : Adapun ayat 30 mengandung acaman yang tegas dengan memasukkan ke dalam api neraka dan dibakar di dalamnya bagi pembunuh seorang muslim lantaran permusuhan dan kezaliman, yakni dengan secara sengaja, terus menerus dan kezaliman murni. Allah berfirman: {ﻭﻣﻦ ﻳﻔﻌﻞ ﺫﻟﻚ} “barang siapa melakukan itu”, maksudnya membunuh. {ﻋﺪﻭاﻧﺎ ﻭﻇﻠﻤﺎ ﻓﺴﻮﻑ ﻧﺼﻠﻴﻪ ﻧﺎﺭا ﻭﻛﺎﻥ ﺫﻟﻚ} “secara permusuhan dan zalim, maka kelak akan dimasukkan ke dalam neraka (dan dibakar di dalamnya)”, {ﻋﻠﻰ اﻟﻠﻪ ﻳﺴﻴﺮا} “dan bagi Allah adalah hal yang mudah” karena kesempurnaan kemampuan-Nya untuk melaksanakan siksaan ini yang mana tidak ada yang dapat menghindar dalam berbagai kesempatan. Pelajaran dari ayat : • Ancaman yang keras berupa masuk neraka terhadap orang yang bunuh karena sebab permusuhan dan kezaliman. • Jikalau pembunuhan tanpa ada unsur permusuhan, yaitu karena ketidaksengajaan; ataupun tanpa ada kezaliman tapi dengan kesengajaan tapi dengan adanya hak, semisal ayah membunuh anaknya atau seseorang membunuh saudaranya, maka yang demikian tidak terpenuhi syarat keterlaksanaan ancaman keras ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 30: Dan barangsiapa berbuat demikian, dengan melanggar batas-batas dan aniaya, niscaya Kami akan masukkan dia di neraka; dan adalah yang demikian itu mudah atas Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni perbuatan yang dilarang seperti memakan harta dengan jalan yang batil atau membunuh diri dan orang lain. Bukan karena tidak mengerti dan lupa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 30",
    "description": "Dan barang siapa berbuat demikian, dalam memperoleh harta, dengan cara melanggar hukum dan dengan berbuat zalim, maka akan kami masukkan dia ke dalam neraka. Yang demikian itu, yakni menjatuhkan hukuman dengan siksaan neraka, adalah sesuatu hal yang sangat mudah bagi Allahdemikianlah sanksi yang akan Allah jatuhkan kepada orang-orang berbuat dosa. Pada ayat ini Allah lalu menjanjikan anugerah kenikmatan kepada orang-orang yang menjauhi dosa. Jika kamu berusaha dengan sungguh-sungguh menjauhi dosa-dosa besar terutama dosa-dosa yang bersifat penganiayaan di antara dosa-dosa besar yang telah dilarang mengerjakannya oleh Allah dan rasul-Nya, niscaya kami akan hapus kesalahan-kesalahanmu berupa dosa-dosa kecil yang kamu perbuat dan akan kami masukkan kamu ke tempat yang mulia, yakni surga dengan beraneka kenikmatan yang tiada tara."
  }
]