[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Jika kalian (wahai kaum mukminin), menjauhi dosa-dosa besar seperti perbuatan menyekutukan Allah, durhaka kepada kedua orang tua, membunuh jiwa yang tidak dibenarkan dan perkara-perkara lainnya, niscaya Kami akan menghapuskan dari kalian dosa-dosa yang lebih rendah darinya berupa dosa-dosa kecil, dan kami akan memasukkan kalian kedalam tempat yang mulia, yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Apabila kalian -wahai orang-orang mukmin- menjauhi dosa-dosa besar, seperti menyekutukan Allah (syirik), durhaka kepada orangtua, membunuh manusia, dan memakan riba, maka Kami akan mengampuni dosa-dosa kecil yang kalian lakukan dengan meleburnya dan menghapusnya, dan Kami akan memasukkan kalian ke dalam tempat yang mulia di sisi Allah, yaitu Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Dan salah satu dari karunia dan kebaikan Allah kepada hamba-hamba-Nya yang beriman adalah menjanjikan bagi mereka jika mereka menjauhi dosa-dosa besar -yaitu dosa yang menjadikan pelakunya disebut sebagai orang yang kurang peduli terhadap agamanya- maka Allah akan mengampuni segala dosa dan kesalahan mereka, dan memasukkan mereka ke dalam kebaikan yang besar berupa surga yang penuh dengan kenikmatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. إِن تَجْتَنِبُوا۟ كَبَآئِرَ مَا تُنْهَوْنَ عَنْهُ (ika kamu menjauhi dosa-dosa besar di antara dosa-dosa yang dilarang kamu mengerjakannya) Yakni apabila kalian menjauhi dosa-dosa besar yang telah dilarang Allah untuk melakukannya. نُكَفِّرْ عَنكُمْ سَيِّـَٔاتِكُمْ(niscaya Kami hapus kesalahan-kesalahanmu) Yakni dosa-dosa kecil kalian. Ibnu Abbas berkata: dosa besar adalah semua dosa yang terdapat ancaman dari Allah berupa neraka, kemurkaan, laknat, atau, azab. Dan beberapa yang disebutkan oleh Rasulullah sebagai dosa besar adalah pembunuhan, zina, memakan harta anak yatim, lari dari peperangan, sihir, durhaka kepada kedua orang tua, dan menuduh wanita Muslimah yang menjaga kehormatan melakukan perbuatan zina. وَنُدْخِلْكُم مُّدْخَلًا(dan Kami masukkan kamu) Yakni kedalam surga. كَرِيمًا(ke tempat yang mulia) Yakni tempat yang baik dan diridhai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Wahai orang-orang mukmin, jika kalian meninggalkaan dosa-dosa besar yang dilarang bagi kalian yaitu tindakan-tindakan yang diancam dan dibatasi syariat seperti menyekutukan Allah, membunuh, berzina, dan mencuri, maka Kami akan mengabaikan dosa-dosa kecil kalian, dan memasukkan kalian ke dalam surga dengan baik dan penuh keridhaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika kalian menjauhi} meninggalkan {dosa-dosa besar yang dilarang untuk kalian} dosa-dosa besar yang dilarang syariat untuk kalian {niscaya Kami menghapus kesalahan-kesalahan kalian} menghapus dosa-dosa kecil kalian {dan Kami memasukkan kalian ke tempat yang mulia} tempat yang baik yaitu surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Ini merupakan karunia Aallah dan kebaikanNya kepada hamba-hambaNya yang beriman Allah menjanjikan kepada mereka bahwa bila mereka meninggalkan dosa-dosa besar niscaya Allah akan mengampuni seluruh dosa-dosa dan kesalahan-kesalahan mereka, dan memasukan mereka kepada suatu tempat yang mulia lagi banyak kenikmatannya, yaitu surge yang meliputi hal-hal yang tidak pernah dilihat oleh mata, tidak pernah didengar oleh telinga, dan tidak pernah terlintas sama sekali di benak manusia. Dan termasuk dalam perkara meninggalkan dosa-dosa besar adalah menunaikan kewajiban-kewajiban, dimana orang yang meninggalkannya berarti telah melakukan dosa besar, seperti shalat lima waktu, shalat jum’at dan puasa Ramadan. Sebagaimana sabda nabi : \"sholat yang lma waktu, jumat ke jumat dan romadhon ke romadhon adalah penghapus dosa diantara keduanya, selama meninggalkan dosa besar\" (HR Muslim) Dan defenisi bagi dosa-dosa besar yang paling baik adalah perkara yang mengakibatkan adanya had di dunia atau adanya ancaman diakhirat atau peniadaan iman atau adanya kata laknat atau kemurkaan atasnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﺇﻥ ﺗﺠﺘﻨﺒﻮا} “in tajtanibuu” Jika kalian menjauhi. Menjauhi adalah meninggalkan sesuatu dari sisinya dengan jarak yang jauh, tidak menerima dan tidak mendekatinya. {كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ} kabaa iru maa tunhauna ‘anhu: kabair (dosa besar) adalah lawan kata dari shoghoir (dosa kecil). Dan dosa besar diketahui dengan adanya had (hukuman) bukan dengan dengan hitungan. Dosa besar adalah dosa yang diancam pelakunya oleh Allah dan Rasul-Nya, dilaknat pelakunya atau disyariatkan had kepada yang melanggarnya. Telah disebutkan di dalam hadits yang shohih penjelasan yang banyak tentang dosa besar. Wajib bagi seorang muslim untuk mengetahuinya agar bisa dijauhi. {نُكَفِّرْ} nukaffir: Kami menutup dosa dan membungkusnya, tidak kami tuntut dan kami hukum karenanya. {مُدْخَلاً كَرِيماً} mudkholan kariima: tempat masuk yang mulia, ialah surge yang merupakan kampung orang-orang yang bertakwa. Makna Ayat: Allah lah zat Yang Maha Tinggi Keagungannya, Maha Pemberi dan Mulia Kekuasaan-Nya di atas kaum mukminin dari kalangan umat Islam dengan menjanjikannya janji yang benar bahwa barang siapa yang menjauhi dosa-dosa besar, Allah akan mengampuninya dari dosa-dosa kecil yang dilakukannya dan memasukkannya ke dalam surga kampung keselamatan serta mengangkatnya kedalam ridho Allah. Allah berfirman {إِنْ تَجْتَنِبُوا كَبَائِرَ مَا تُنْهَوْنَ عَنْهُ} “jika kalian menjauhi dosa-dosa besar yang terlarang” yang dilarang oleh aku (Allah) dan Rosul, {نُكَفِّرْ عَنْكُمْ سَيِّئَاتِكُمْ} “niscaya Kami akan mengampuni dosa-dosa kalian” selama bukan dosa besar , {وَنُدْخِلْكُمْ مُدْخَلاً كَرِيماً} “dan Kami akan memasukkan kalian kedalam kemuliaan” yang mana itu adalah surga. Segala puji dan anugrah adalah milik Allah . Oleh karenanya ayat ini adalah kabar gambira bagi umat ini. Pelajaran dari Ayat: 1. wajib menjauhi semua dosa besar dan sabar dalam hal itu sampai maut menjemput. 2. Dosa dibagi menjadi dua jenis, dosa besar dan dosa kecil. Oleh karena itu wajib diketahui untuk menghindari dosa kecil dan besar sebisa mungkin. Barang siapa yang tergelincir, hendaklah dia bertaubat. Sejatinya orang yang taubat dari dosa adalah seperti orang yang tidak berdosa. 3. Surga tidak akan dimasuki kecuali oleh orang-orang yang mempunyai jiwa yang suci dengan menjauhi yang dapat mengotori hati, baik itu dosa besar, dosa kecil ataupun perbuatan keji."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 31: Jika kamu jauhi dosa-dosa besar yang dilarang kamu (mengerjakannya), niscaya Kami akan hapuskan dari kamu kesalahan-kesalahan kamu, dan Kami akan masukkan kamu di tempat masuk yang mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dosa besar adalah dosa yang ada had (hukumannya) di dunia, ancamannya di akhirat, adanya penafian keimanan, adanya laknat atau kemurkaan. Contohnya adalah membunuh, berzina dan mencuri. Menurut Ibnu Abbas, \"Jumlahnya hampir tujuh puluh dosa.\" Yakni dosa-dosamu yang kecil dengan ketaatan kamu. Hal ini termasuk karunia Allah dan ihsan-Nya kepada hamba-hamba-Nya yang mukmin, Dia menjanjikan kepada mereka jika menjauhi dosa-dosa besar, maka Dia akan menghapuskan semua dosa dan kesalahan serta memasukkan mereka ke surga. Termasuk ke dalam menjauhi dosa adalah mengerjakan kewajiban yang jika ditinggalkan pelakunya dianggap mengerjakan dosa besar, seperti shalat lima waktu, shalat Jum'at, puasa Ramadhan dsb."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 31",
    "description": "Demikianlah sanksi yang akan Allah jatuhkan kepada orang-orang berbuat dosa. Pada ayat ini Allah lalu menjanjikan anugerah kenikmatan kepada orang-orang yang menjauhi dosa. Jika kamu berusaha dengan sungguh-sungguh menjauhi dosa-dosa besar terutama dosa-dosa yang bersifat penganiayaan di antara dosa-dosa besar yang telah dilarang mengerjakannya oleh Allah dan rasul-Nya, niscaya kami akan hapus kesalahan-kesalahanmu berupa dosa-dosa kecil yang kamu perbuat dan akan kami masukkan kamu ke tempat yang mulia, yakni surga dengan beraneka kenikmatan yang tiada tara. Namun sering terjadi dalam kehidupan bahwa angan-angan untuk memperoleh sesuatu sebagaimana dimiliki orang lain bisa mendorong seseorang melakukan pelanggaran. Ayat ini berpesan agar menghindari kebiasaan berangan-angan yang menimbulkan sifat iri dan dengki kepada sesama. Dan janganlah kamu berangan-angan yang membuat kamu iri hati terhadap karunia yang telah dilebihkan oleh Allah kepada sebagian kamu atas sebagian yang lain, baik karunia itu berupa kecerdasan, kemuliaan, nama baik, pangkat, dan jabatan, maupun dalam bentuk harta benda serta kekayaan yang berlimpah. Karena bagi laki-laki ada bagian dari apa yang mereka usahakan yang sesuai dengan ketentuan Allah dan sesuai pula dengan apa yang mereka usahakan, dan begitu pula bagi perempuan pun ada bagian dari apa yang mereka usahakan sesuai petunjuk Allah dan apa yang mereka usahakan. Oleh sebab itu, janganlah berangan-angan yang menyebabkan iri hati. Mohonlah kepada Allah dengan tulus agar kamu dianugerahi-Nya sebagian dari karunia-Nya yang berlimpah ruah itu. Sungguh, Allah maha mengetahui segala sesuatu termasuk angan-angan dan iri serta kedengkian yang tersembunyi dalam hati kamu."
  }
]