[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian berharap memperoleh sesuatu yang Allah unggulkan dengannya sebagian orang di atas sebagian yang lain, berupa bakat-bakat, jumlah rizki dan lainnya. Maka sesungguhnya Allah telah menjadikan bagi kaum lelaki bagian tertentu dalam bentuk balasan sesuai amal perbuatan mereka. Dan DIA menjadikan bagian bagi para wanita dari apa yang mereka perbuat. Dan mintalah kepada Allah Dzat yang Maha mulia lagi Maha pemberi karunia, supaya DIA akan memberikan sebagian dari karuniaNYA sebagai pengganti dari sekedar berharap-harap belaka. Sesungguhnya Allah Maha Mengetahui segala sesuatu. Dan DIA lebih mengetahui apa yang memperbaiki keadaan hamba-hambaNYA terkait apa yang DIA bagi-bagikan kepada mereka berupa kebaikan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Janganlah kalian -wahai orang-orang mukmin- menginginkan kelebihan yang Allah berikan kepada sebagian dari kalian atas sebagian yang lain, supaya tidak timbul rasa benci dan iri hati. Maka tidak sepatutnya kaum wanita berharap mendapatkan sesuatu yang hanya Allah berikan kepada kaum laki-laki. Karena setiap kelompok memiliki balasan yang sesuai. Mintalah kepada Allah untuk menambahkan karunianya kepadamu. Sesungguhnya Allah Maha Mengetahui segala sesuatu. Dia memberikan kepada setiap kelompok apa yang sesuai dengannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Setelah Allah melarang orang-orang beriman daro mengambil harta orang lain dengan cara yang batil, dan membunuh orang lain, kemudian Dia melarang mereka dari rasa iri atas apa yang telah Allah lebihkan sebagian hamba-Nya dari sebagian yang lain. Sebab laki-laki memiliki kelebihan dan hak-haknya, dan perempuan juga memiliki kelebihan dan hak-haknya, maka janganlah saling iri terhadap apa yang ada dalam genggaman orang lain. Dan mintalah karunia dari Allah, sebab karunia-Nya dapat meliputi seluruh manusia. Tidak ada yang didapat dari rasa iri melainkan keletihan jiwa. Ilmu Allah meliputi segala sesuatu, Dia mengetahui siapa yang layak mendapatkan keluasan karunia dan siapa yang layak dipersempit; maka janganlah kalian menolak ketetapan Allah dengan rasa iri dan lain sebagainya. Dia Maha Mengetahui permintaan kalian terhadap karunia-Nya, dan Dia akan menjawab doa kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَلَا تَتَمَنَّوْا۟ مَا فَضَّلَ اللهُ بِهِۦ بَعْضَكُمْ عَلَىٰ بَعْضٍ (Dan janganlah kamu iri hati terhadap apa yang dikaruniakan Allah kepada sebahagian kamu lebih banyak dari sebahagian yang lain) Namun diperbolehkan menginginkan agar mempunyai seperti apa yang dipunyai orang lain tanpa mengharapkan hilangnya sesuatu itu dari orang lain tersebut. لِّلرِّجَالِ نَصِيبٌ مِّمَّا اكْتَسَبُوا۟ ۖ( bagi orang laki-laki ada bahagian dari pada apa yang mereka usahakan) Yakni berupa pahala dari amalan yang telah Allah siapkan bagi mereka. Adapun bagi laki-laki terdapat pahala jihad, gugur di jalan Allah, dan mencari nafkah halal; dan bagi perempuan terdapat pahala mengandung, melahirkan, menyusui, mengasuh anak, dan mengurus rumah. Allah telah menjadikan untuk keduanya bagian sesuai dengan kehendak dan hikmah-Nya. وَسْـَٔلُوا۟ اللهَ مِن فَضْلِهِۦٓ ۗ (dan mohonlah kepada Allah sebagian dari karunia-Nya) Yakni daripada kalian hanya sibuk berangan-angan dan saling iri maka lebih baik kalian berusaha dan memohon kebaikan dari Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jika Allah melarang hamba-Nya yang beriman dari perkara yang keinginan mereka berkaitan dengan hak Allah, Dia akan membukakan bagi mereka pintu-pintu lain yang lebih bermanfaat bagi mereka dan lebih, dan inilah bagian dari kasih saying Allah. 2 ). Dalam ayat diterangkan larangan berangan-angan dan iri hati atas ketentuan Allah, lalu bagaimana dengan orang yang mengingkari perbedaan ketentuan syari'at antara laki-laki dan perempuan, dan menyuarakan untuk meniadakannya, mereka meminta persamaan hokum antara kaum laki-laki dan perempuan ? 3 ). Hendaklah orang-orang yang mengendaki perkara-perkara yang dibolehkan dari perkara dunia dan akhirat, menjadikan kehendak mereka itu kembali kepada Allah, sekalipun kehendak dia sangat besar { وَاسْأَلُوا اللَّهَ مِنْ فَضْلِهِ } \"dan mohonlah kepada Allah sebagian dari karunia-Nya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Dan janganlah kalian berangan-angan untuk mengambil sesuatu yang dimiliki orang lain, dan ridhailah apa yang diberikan Allah untuk kalian. At-Tamanniy adalah Keinginan untuk mendapatkan sesuatu yang disukai namun mustahil untuk dwujudkan. Berangan-angan untuk mendapatkan sesuatu yang serupa dengan orang lain itu diperbolehkan, tanpa mengharapkan sesuatu itu hilang dari pemiliknya. Bagi para lelaki itu ada bagian yang dihasilkan dari usaha mereka seperti berjihad, bekerja, dan berdagang. Dan bagi para wanita itu bagian dari usaha mereka berupa menaati suami dan menjaga farji mereka. Masing-masing dari keduanya itu sama balasannya di akhirat. Maka carilah kebaikan dan pertolongan dari Allah dalam melakukan sesuatu yang diridhaiNya, serta rejeki yang halal agar tidak sibuk berangan-angan. Sesungguhnya Allah Maha Mengetahui apa yang baik bagi hamba-hambaNya dan rejeki yang dibagikan untuk mereka. Ummu Salmah berkata: “Para lelaki bisa berperang sedangkan wanita tidak. Dan sesungguhnya wanita itu mendapatkan separuh harta warisan.” Lalu Allah menurunkan ayat {Wa laa tatamannau ..} dan menurunkan ayat {Innal muslimiina wal muslimaati} [Al-Ahzab 33/ 35] untuknya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah kalian berangan-angan terhadap apa yang telah dilebihkan Allah kepada sebagian kamu atas sebagian yang lain. Bagi laki-laki ada bagian dari apa yang mereka usahakan dan bagi perempuan ada bagian dari apa yang mereka usahakan. Mohonlah kepada Allah sebagian dari karuniaNya. Sesungguhnya Allah adalah Maha Mengetahui segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah melarang kaum mukminin mengharapkan apa yang telah Allah karuniakan kepada sebagian yang lain berupa hal-hal yang mungkin dan hal-hal yang tidak mungkin, maka wanita tidak boleh berangan-angan mendapatkan kelebihan-kelebihan laki-laki dimana dengannya Allah memuliakan mereka atas wanita, demikian juga orang yang miskin dan papa tidak boleh berangan-angan menjadi kaya dan berpunya dengan sebatas angan-angan belaka, karena sesunggunya itulah yang disebut hasad , yaitu berharap agar nikmat Allah atas orang lain tersebut mejadi miliknyadan nikmat itu dihilangkan dadri orang tersebut dank arena tindakan itu menimbulkan rasa benci kepada ketentuan Allah dan menjerusmuskan kepada kemalasan yang berkepanjangan, dan angan-angan kosong yang tidak dibarengi dengan kerja dan usaha. Sesunguhnya hal yang terpuji adalah dua perkara; seorang hamba berusaha menurut kemampuannya dengan hal yang guna baginya dalam mewujudkan kemaslahatannya, dunia maupun akhirat, lalu ia memohon kepada Allah untuk memberikan karniaNya atasnya dan tidak bersandar hanya pada dirinya semata dan tidak juga pada selain tuhannya, oleh karena itu Allah berfirman ”bagi orang laki-laki ada bagian dari apa yang mereka usahakan” yaitu dari perbuatan-perbuatan mereka yang mewujudkan apa yang dikehendaki, ”dan bagi para wanita (pun) ada bagian dari apa yang mereka usahakan” setiapa dari mereka tidak akan memperoleh selain dari apa yang telah ia usahakan dan lelah karenanya. ”dan mohonlah kepada Allah sebagian dari karuniaNYa” yaitu dari seluruh kemaslahatan kalian dalam agama maupun dunia kalian kondisi seperti ini merupakan kesempurnaan seorang hamba dan tanda bagi kebahagiaannya, bukan orang yang meninggalkan kerja atau bersandar pada dirinya semata dan tidak membutuhkan rabbnya atau menyatukan dua perkara tersebut, maka orang yang seperti ini akan terhina dan merugi, firmanNya” sesungguhnya Allah Maha Mengetahui segala sesuatu” maksudnya Allah akan memberikan kepada orang yang Dia ketahui memang berhak untuk diberikan, dan menahan dari orang yang Dia ketahui memang tidak berhak diberikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {وَلا تَتَمَنَّوْا} Wala tatamannau: التمني (at tamanni) adalah keinginan dan angan untuk mendapatkan sesuatu, dan kata-kata yang sering digunakan adalah ‘andai’ atau ‘jikalau’. Jikalau angannya itu bersamaan dengan hilangnya hal yang diinginkannya dari orang yang mempunyai, maka disebut dengan hasad (iri). {مَا فَضَّلَ اللهُ بِهِ بَعْضَكُمْ} Maa fadhdholallohu bihi ba’dhokum: Apa yang Allah berikan kepada salah satu dari kalian berupa harta, ilmu, kedudukan ataupun kekuasaan. {نَصِيبٌ مِمَّا اكْتَسَبُوا} Nashibun mimmaktasabuu: bagian dari pahala dan hukuman sesusuai dengan ketaatan dan maksiat masing-masing. Makna ayat : Benar atau tidaknya kisah ummu salamah, beliau berkata: “Andaikan kami adalah kaum laki-laki, maka kami telah berjihad. Dan untuk kami adalah pahala semisal kaum pria -Maka Allah Maha Mendengar- dan orang-orang yang berangan-angan secara hasad ataupun tanpa hasad betapa banyak jumlahnya. Oleh karenanya dalam ayat ini (39) Allah melarang para hamba-Nya yang beriman untuk berangan-angan dengan sesuatu yang telah Allah lebihkan kepada sebagian dari mereka terhadap yang lain. Allah telah memberikan mereka kelebihan dan melarang berangan-angan dikarenakan hikmah-hikmah yang terkandung di dalamnya. Dan yang paling gamblang dari hikmah-hikmah di balik takdir Allah adalah rasa syukur dan sabar. Allah berfirman {وَلا تَتَمَنَّوْا مَا فَضَّلَ اللهُ بِهِ} “Janganlah berangan-angan terhadap apa yang dilebihkan oleh Allah” dari sisi ilmu, harta, kesehatan, kedudukan ataupun kekuasaan {بَعْضَكُمْ عَلَى بَعْضٍ} “sebagian dari sebagian yang lainnya”. Allah mengabarkan ketetapannya dalam perkara pahala, hukuman, pekerjaan dan amal. Maka hendaklah beramal, wahai orang yang menginginkan pahala dan ganjaran dengan melakukan hal yang bisa mengantarkan kepada hal tersebut yang berupa keimanan dan amal sholih. Dan janganlah hanya sekedar berangan-angan saja. Hendaklah orang yang takut terhadap siksa dan tercegahnya dari kenikmatan Allah untuk menahan diri dari kesyirikan dan perbuatan maksiat, janganlah mengharapkan keselamatan hanya dengan sekedar harapan. Seperti halnya orang yang menginginkan harta dan kedudukan, hendaknya beramal dengan jalan-jalan yang sudah dipakemkan dan janganlah hanya berangan saja. Karena angan-angan adalah barang dagangannya orang-orang pandir. Oleh karenanya Allah berfirman {لِلرِّجَالِ نَصِيبٌ مِمَّا اكْتَسَبُوا وَلِلنِّسَاءِ نَصِيبٌ مِمَّا اكْتَسَبْنَ} “Bagi kaum pria bagian dari apa yang mereka kerjakan; dan bagi kaum wanita bagian yang mereka kerjakan” dan dikembalikan perkara ini kepada ketentuan Allah, yaitu amal masing-masing manusia. Hal ini seperti dalam firman Allah yang lain {فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْراً يَرَهُ وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرّاً يَرَهُ} “barang siapa yang beramal sebesar biji sawi kebaikan, maka dia akan melihatnya. Dan barang siapa yang beramal sebesar biji sawi keburukan, maka dia akan melihatnya”, kemudian Allah mejelaskan ketetapanNya yang lain dalam mendapatkan hal yang diiginkan dengan berdoa kepada-Nya, Allah berfirman {وَاسْأَلُوا اللهَ مِنْ فَضْلِهِ إِنَّ اللهَ كَانَ بِكُلِّ شَيْءٍ عَلِيماً} “dan mintalah kepada Allah dari keutamannya, sesungguhnya Allah Maha Mengetahui terhadap segala sesuatu”. Siapapun yang meninta kepada Tuhannya, merengek di hadapanNya dan yakin akan dikabulkan, niscaya Allah akan memberikan kepadanya dan memberikan petunjuk kepadanya dengan mendatangkan sebab-sebab yang bisa mengantarkan kepada terkabulnya permintaannya dan dia pun dipalingkan dari hal-hal yang dapat mencegah tercapainya yang dia minta, memberikan kepadanya dengan tanpa ada sebab insya Allah. Dan Allah adalah zat yang Maha Mampu. Bahkan yang termasuk sebab-sebab yang disyariatkan adalah berdoa dan ikhlas dalam doanya. Pelajaran dari ayat : • Tercelanya berangan-angan dan tidak mau berusaha. • Haramnya perbuatan hasad • Keutaman doa yang mana doa adalah salah satu sebab yang akan mengantarkan kita kepada tercapainya keinginan kita."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 32: Dan janganlah kamu angan-angan (hendak mendapat kurnia) yang Allah telah limpahkan kepada sebahagian- daripada kamu lebih daripada sebahagian laki laki akan mendapat bahagian dari apa yang telah diusahakan dan perempuan -perempuan akan dapat bagian dari apa yang me-reka telah usahakan tetapi mintalah kepada Allah sebagian daripada kurnia-Nya karena Allah itu amat Mengetahui akan tiap-tiap sesuatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik karunia dari sisi dunia maupun agama, yang mungkin maupun tidak mungkin. Oleh karena itu, kaum wanita tidak boleh iri hati terhadap keistimewaan yang dimiliki kaum laki-laki, demikian juga orang miskin dan bercacat tidak boleh iri hati kepada orang yang kaya atau yang sempurna. Yang demikian merupakan hasad, karena dia ingin nikmat Allah yang ada pada orang lain berpindah kepada dirinya. Hal itu dilarang, karena dapat membuahkan sikap kesal terhadap taqdir Allah, membuat malas serta membuahkan angan-angan yang tidak dibarengi amal dan usaha. Yang terpuji adalah jika seorang hamba berusaha sesuai kemampuannya untuk memperoleh hal yang bermanfaat baginya baik agama maupun dunia, meminta karunia kepada Allah, tidak bersandar kepada diri serta tidak kepada sesuatu yang lain selain kepada Allah Tuhannya. Berupa pahala. Seperti jihad dan amal saleh lainnya. Berupa ketaatan kepada suami dan menjaga kehormatan. Ayat ini turun ketika Ummu Salamah berkata, \"Andaisaja kita laki-laki, sehingga kita dapat berjihad sehingga memperoleh pahala seperti yang diperoleh kaum laki-laki.\" Yakni mohonlah kepada Allah apa saja yang kamu butuhkan, niscaya Dia akan memberikannya kepadamu. Hal ini termasuk sempurnanya seorang hamba dan tanda bahagia dirinya, tidak seperti orang yang tidak beramal atau bersandar kepada dirinya tidak butuh kepada Tuhannya, atau menggabung kedua hal tersebut (tidak beramal dan bersandar kepada dirinya), orang yang seperti ini adalah orang yang rugi. Di antara pengetahuan-Nya adalah Dia mengetahui siapa yang berhak mendapatkan karunia dan mengetahui permintaan kamu. Dia memberikan orang yang diketahui-Nya berhak memperoleh pemberian-Nya dan mencegah orang yang diketahui-Nya tidak layak memperolehnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 32",
    "description": "Namun sering terjadi dalam kehidupan bahwa angan-angan untuk memperoleh sesuatu sebagaimana dimiliki orang lain bisa mendorong seseorang melakukan pelanggaran. Ayat ini berpesan agar menghindari kebiasaan berangan-angan yang menimbulkan sifat iri dan dengki kepada sesama. Dan janganlah kamu berangan-angan yang membuat kamu iri hati terhadap karunia yang telah dilebihkan oleh Allah kepada sebagian kamu atas sebagian yang lain, baik karunia itu berupa kecerdasan, kemuliaan, nama baik, pangkat, dan jabatan, maupun dalam bentuk harta benda serta kekayaan yang berlimpah. Karena bagi laki-laki ada bagian dari apa yang mereka usahakan yang sesuai dengan ketentuan Allah dan sesuai pula dengan apa yang mereka usahakan, dan begitu pula bagi perempuan pun ada bagian dari apa yang mereka usahakan sesuai petunjuk Allah dan apa yang mereka usahakan. Oleh sebab itu, janganlah berangan-angan yang menyebabkan iri hati. Mohonlah kepada Allah dengan tulus agar kamu dianugerahi-Nya sebagian dari karunia-Nya yang berlimpah ruah itu. Sungguh, Allah maha mengetahui segala sesuatu termasuk angan-angan dan iri serta kedengkian yang tersembunyi dalam hati kamu usai melarang manusia berangan-angan yang akan mendorongnya iri dan dengki atas kelebihan orang lain, termasuk dalam hal warisan, ayat ini lalu mengingatkan bahwa harta warisan itu sudah ditentukan pembagiannya oleh Allah. Dan ketahuilah bahwa untuk setiap harta peninggalan, dari apa yang ditinggalkan oleh kedua orang tua dan juga yang ditinggalkan oleh karib kerabat, kami jadikan pewaris-pewarisnya, dan juga bagi orang-orang yang kamu telah bersumpah setia dengan mereka sebagai suami istri, maka berikanlah kepada mereka bagiannya sesuai dengan kesepakatan sebelumnya. Sungguh, Allah maha menyaksikan segala sesuatu."
  }
]