[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan untuk masing-masing dari kalian, kami menjadikan ahli waris yang mewarisi harta yang ditinggalkan oleh kedua orang tua dan karib kerabat. Dan orang-orang yang kalian telah mengadakan sumpah setia dengan mereka yang didasari sumpah-sumpah yang kuat untuk saling menolong dan memberikan bagian kepada mereka dari harta warisan,maka berikanlah kepada mereka bagian yang telah ditentukan bagi mereka. Pemberian bagian warisan berdasarkan hubungan sumpah setia dahulu berlaku pada permulaan islam, kemudian dihapuskan hukumnya dengan turunnya ayat-ayat tentang warisan. sesungguhnya Allah meneliti segala sesuatu dari perbuatan-perbuatan kalian dan Dia akan memberikan balasan bagi kalian sesuai dengan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Dan kepada setiap orang di antara kalian Kami berikan 'aṣabah yang akan mewarisi harta warisan yang ditinggalkan oleh bapak-ibu dan karib kerabat. Dan berikanlah bagian warisan yang menjadi hak orang-orang yang telah menjalin ikatan sumpah yang kuat dengan kalian untuk bersekutu dan tolong-menolong. Sesungguhnya Allah Maha Menyaksikan segala sesuatu. Salah satu kesaksian Allah ialah Dia menyaksikan sumpah-sumpah serta perjanjian-perjanjian yang kalian buat itu. Namun ketentuan tentang hubungan saling mewarisi berdasarkan persekutuan itu berlaku pada masa awal Islam saja, kemudian dihapus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Setelah Allah melarang rasa iri yang buruk dan memerintahkan hamba-hamba-Nya untuk meminta karunia-Nya, Dia kemudian menjelaskan sedikit tentang perkara harta warisan, bahwa dalam penetapan hukum ini terdapat maslahat besar berupa perolehan harta warisan oleh ahli waris tanpa harus bekerja mencarinya; Dia berfirman: “Dan setiap kalian telah Kami jadikan baginya ahli waris yang menerima harta warisan dari golongan orangtua dan kerabatnya. Adapun orang-orang yang memiliki perjanjian yang kuat dengan kalian untuk saling menolong dan untuk mendapat bagian dari warisan, maka berilah mereka bagian yang telah ditetapkan. Dia Maha Meliputi segala sesuatu dengan ilmu-Nya.” Ini merupakan ancaman bagi orang yang bermaksiat dan janji bagi orang yang taat serta peringatan bahwa Dia Maha Menyaksikan hubungan silaturrahim dan perjanjian di antara kalian. Maka hendaklah kalian memenuhi janji. Namun hukum saling mewarisi antara orang-orang yang memiliki perjanjian telah dihapus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. وَلِكُلٍّ جَعَلْنَا مَوٰلِىَ مِمَّا تَرَكَ الْوٰلِدَانِ وَالْأَقْرَبُونَ ۚ (Bagi tiap-tiap harta peninggalan dari harta yang ditinggalkan ibu bapak dan karib kerabat Kami jadikan pewaris-pewarisnya) Yakni Allah menjadikan bagi setiap manusia para pewaris dari kerabat mereka yang akan menerima harta warisannya. وَالَّذِينَ عَقَدَتْ أَيْمٰنُكُمْ(Dan (jika ada) orang-orang yang kamu telah bersumpah setia dengan mereka) Dan yang dimaksud dalam ayat ini adalah ahli waris dari golongan (موالي الموالاة) yakni sekutu atau aliansi yang diangkatnya. Dahulu orang-orang jahiliyah mengatakan kepada sekutunya: “kamu mewarisi hartaku dan aku mewarisi hartamu”, dan hukum persekutuan ini berlangsung sampai pada awal Islam yang kemudian dihapus/dinasakh dengan firman Allah yang berbunyi: وأولو الأرحام بعضهم أولى ببعض في كتاب الله من المؤمنين والمهاجرين إلا أن تفعلوا إلى أوليائكم معروفا “. Dan orang-orang yang mempunyai hubungan darah satu sama lain lebih berhak (waris-mewarisi) di dalam Kitab Allah daripada orang-orang mukmim dan orang-orang Muhajirin, kecuali kalau kamu berbuat baik kepada saudara-saudaramu (seagama)” Dan bagi sekutu masih terdapat hak yang mungkin bisa diberikan melalui wasiat atau pemberian (hadiah); dan Rasulullah bersabda: لا حلف في الإسلام “tidak ada persekutuan (dalam warisan) dalam Islam”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Bagi masing-masing laki-laki dan wanita itu Kami jadikan pewaris-pewarisnya dari kerabatnya yang berhak mendapatkan warisan, dan orang-orang yang kalian masukkan dalam daftar orang yang mendapat pertolongan dan warisan, Mereka itu adalah pewaris yang berhak menerima harta warisan, yang mana seorang laki-laki bersepakat dengan laki-laki lainnya, lalu berkata: “Kamu memberi warisan kepadaku” dan “Aku menerima warisanmu”. Maka berilah bagian warisan mereka, yaitu seperenam. Kemudian keterangan tentang warisan ini dinasakh dengan firman Allah SWT {Illa An-Taf’aluu ilaa awliyaaikum ma’ruufa} [Al-Ahzab 33/6] Sesungguhnya Allah menyaksikan perbuatan kalian dan akan membalas kalian atas hal itu. Ayat ini turun untuk Abu bakar dan anaknya ketika dia menolak Islam. Lalu Abu Bakar bersumpah untuk tidak memberinya warisan, lalu ketika dia (anaknya) masuk islam, Abu Bakar diperintahkan untuk memberi anaknya bagiannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagi setiap orang} bagi setiap orang baik laki-laki dan perempuan {Kami telah menjadikan para wali} golongan yang diberi {apa yang ditinggalkan oleh kedua orang tuanya dan kerabatnya. Dan orang-orang yang telah terikat sumpah kalian} orang-orang yang kalian bersama mereka melakukan sumpah terikat untuk menolong {berikanlah bagian itu kepada mereka} maka berilah mereka bagian warisan mereka {Sesungguhnya Allah Maha Menyaksikan segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33 .FirmanNya \"dan bagi tiap-tiap” yaitu dari manusia “kami jadikan pewaris-pewarisnya” maksudnya, mereka membantunya dan ia membantu mereka dengan cara saling menghargai, membela, dan saling menolong terhadap perkara-perkara “dari harta yang ditinggalkan ibu bapak dan karib kerabat” hal ini mencakup seluruh karib kerabat berupa ushul (garis keturunan keatas/leluhur) furu’(garis keturunan ke bawah) maupun hawasyi ( kerabat) mereka itu adalah pewaris-pewaris karena kekerabatan.Kemudian Allah menyebutkan sebuah jenis yang lain dadri pewaris-pewaris tersebut dalam firmanNya ”dan jika (ada) orang-orang yang kamu telah bersumpah setia dengan mereka“ yaitu kalian berjanji kepada mereka dengan perkara yang telah kalian setujui akadnya bersama berupa akad sumpah setia untuk saling membela, membantu, dan bersekutu dalam harta dan sebagainya. Semua itu adalah diantara nikmat-nikmat Allah kepada hamba-hambaNya dimana para pewaris-pewaris tersebut saling membantu dalam suatu hal yang tidak bisa dilakukan oleh sebagian dadri mereka secara sendirian, Allah berfirman ”maka berikanlah kepada mereka bagiannya” yaitu berikanlah kepada pewaris-pewaris tersebut bagian-bagian mereka yang memang seharusnya ditunaikan berupa pembelaan, saling membantu, dan menolong dalam perkara diluar kemaksiatan kepada Allah, dan harta warisan itu milik karib kerabat dari pewaris-pewaris tersebut yang terdekat. ”sesungguhnya Allah menyaksikan segala sesuatu” yaitu menyaksikan segala sesuatu, dengan ilmuNya akan segala perkara dan pandanganNya terhadap segala gerakan-gerakan hambaNYa, serta pendengaranNya terhadap segala suara-suara mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {مَوَالِيَ} Al mawaalii: yang mendapatkan harta tinggalan dan mendapatkan warisan dari kerabat yang meninggal. {عَقَدَتْ أَيْمَانُكُمْ} ‘aqodat aimaanukum: orang-orang yang kalian ikat dengan tali perjanjian, yang mana hal itu diwujudkan dengan jabat tangan dan sumpah. {فَآتُوهُمْ نَصِيبَهُمْ} Faatuuhum nashiibahum: dan berikanlah mereka bagian dari pengarahan, wasiat dan pertolongan karena mereka bukanlah ahli waris. Makna ayat : Sesungguhnya Allah mengabarkan ketetapan hukum syar’i yang telah dijelaskan dalam konteks ayat ini, dan ketetapannya adalah bahwasanya setiap dari laki-laki dan perempuan pempunyai ahli waris yang jika mati, maka mereka akan mewariskan harta mereka dan Allah berfriman : {وَلِكُلّ جَعَلْنَا مَوَالِيَ} “setiap orang kami jadikan baginya mawaalii (orang-orang yang mendapatkan warisan darinya)”, yaitu para kerabat yang mana jikalau seorang mati, maka merekalah yang akan mendapatkan warisannya. Dan mereka itu adalah kaum laki-laki dan kaum wanita. Adapun ikatan mawaalii yang terbentuk atas dasar sumpah atau status suadara angkat saja (bukan karena ikatan rahim), maka wajib diberikan kepada mereka berupa pertolongan, arahan dan wasiat dikarenakan mereka tidak mendapatkan bagian warisan berdasarkan firman Allah {وَأُولُوا الأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ} “Dan orang-orang yang mempunyai ikatan rahim lebih didahulukan dibandingkan yang lain”. Tatkala pembagian harta dan terjadi pilih kasih dalam hasil pembagiaannya serta terkadang akan terjadi kecurangan dan kezaliman. Allah mengabarkan kepada kita bahwa Dia Maha Menyaksikan segala sesuatunya tidaklah terluput darinya perihal urusan manusia satupun, hendaklah bertakwalah kepada Allah dan janganlah berbuat maksiat. Allah berfirman {ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﻋﻠﻰ ﻛﻞ ﺷﻲء ﺷﻬﻴﺪا} “Sesungguhnya Allah Maha Menyaksikan segala sesuatunya” tiada yang terlewat dari pengawasannya satu perkara pun, maka bertakwalah, taatilah dan jangan durhaka kepada-Nya. Pelajaran dari ayat : • Ketetapan prinsip waris-mewaris dalam Islam. • Barang siapa menjanjikan pertolongan kepada seseorang dengan sumpah atau menjadikannya saudara angkat, wajib bagi yang berjanji untuk memberikan pertolongan dan bantuan serta boleh memberikan wasiat kepada yang diberikan janji berupa kurang dari sepertiga hartanya. Adapan warisan, maka tidaklah berhak. • Wajib merasa untuk diawasi oleh Allah, karena Allah Maha Mengetahui segala sesuatunya dan Maha Menyaksikannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 33: Dan buat tiap-tiap orang, Kami telah adakan ahli waris bagi telah tinggalkan, (yaitu) ibu-bapa dan keluarga yang hampir dan orang-orang yang telah diikat oleh tangan-tangan kanan kamu, Lantaran itu, berikanlah kepada mereka bahagian-bahagian mereka, karena sesungguhnya Allah itu Penyaksi atas tiap-tiap suatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "'Ashabah adalah orang yang mewarisi sisa harta setelah pemilik bagian (ashabul furudh) mengambil bagiannya atau yang mewarisi semua harta jika tidak ada as-habul furudh dan tidak mendapatkan apa-apa jika as-habul furuudh mewarisi sampai menghabiskan harta. Untuk saling membela dan mewarisi harta. Yakni 1/6. namun waris-mewarisi dengan jalan sumpah setia sudah mansukh dengan ayat \"wa ulul arhaami ba'dhuhum awlaa biba'dhin…dst\" (lihat akhir ayat surat Al Anfal)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 33",
    "description": "Usai melarang manusia berangan-angan yang akan mendorongnya iri dan dengki atas kelebihan orang lain, termasuk dalam hal warisan, ayat ini lalu mengingatkan bahwa harta warisan itu sudah ditentukan pembagiannya oleh Allah. Dan ketahuilah bahwa untuk setiap harta peninggalan, dari apa yang ditinggalkan oleh kedua orang tua dan juga yang ditinggalkan oleh karib kerabat, kami jadikan pewaris-pewarisnya, dan juga bagi orang-orang yang kamu telah bersumpah setia dengan mereka sebagai suami istri, maka berikanlah kepada mereka bagiannya sesuai dengan kesepakatan sebelumnya. Sungguh, Allah maha menyaksikan segala sesuatu. Masih dalam kaitan larangan agar tidak berangan-angan dan iri hati atas kelebihan yang Allah berikan kepada siapa pun, laki-laki maupun perempuan, ayat ini membicarakan secara lebih konkret fungsi dan kewajiban masing-masing dalam kehidupan. Laki-laki atau suami itu adalah pelindung bagi perempuan atau istri, karena Allah telah melebihkan sebagian mereka, laki-laki, atas sebagian yang lain, perempuan, dan karena mereka, yakni laki-laki secara umum atau suami secara khusus, telah memberikan nafkah apakah itu dalam bentuk mahar ataupun serta biaya hidup rumah tangga sehari-hari dari hartanya sendiri. Maka perempuan-perempuan yang saleh adalah mereka yang taat kepada Allah dan menjaga diri ketika suami tidak ada di rumah atau tidak bersama mereka, karena Allah telah menjaga diri mereka. Perempuan-perempuan yang kamu khawatirkan akan melakukan nusyuz (durhaka terhadap suami), seperti meninggalkan rumah tanpa restu suami, hendaklah kamu beri nasihat kepada mereka dengan lemah lembut dan pada saat yang tepat, tidak pada sembarang waktu, dan bila nasihat belum bisa mengubah perilaku mereka yang buruk itu, tinggalkanlah mereka di tempat tidur dengan cara pisah ranjang, dan bila tidak berubah juga, kalau perlu pukullah mereka dengan pukulan yang tidak menyakitkan tetapi memberi kesan kemarahan. Tetapi jika mereka sudah menaatimu, tidak lagi berlaku nusyuz, maka janganlah kamu mencari-cari alasan untuk menyusahkannya dengan mencerca dan mencaci maki mereka. Sungguh, Allah mahatinggi, maha-besar."
  }
]