[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum laki-laki merupakan pemimpin-pemimpin yang menjalankan tugas pengarahan terhadap kaum wanita dan memperhatikan urusan mereka, berdasarkan keistimewaan yang Allah khususkan bagi mereka berupa kepemimpinan dan keunggulan, dan berdasarkan apa yang telah diberikan kaum laki-laki kepada mereka berupa mahar-mahar dan nafkah-nafkah. Maka wanita-wanita yang shalihah yang lurus diatas ajaran syariat Allah dari mereka adalah wanita-wanita yang taat kepada allah dan kepada suami mereka,menjaga apa saja yang luput dari pengetahuan suami-suami mereka terhadap hal-hal yang mereka dipercaya untuk menjaganya dengan bantuan penjagaan dari Allah dan taufikNYA. Dan istri-istri yang kalian takutkan dari mereka keengganan untuk taat kepada kalian, maka nasihatilah mereka dengan tutur kata yang baik. Apabila tidak membuahkan hasil kepada mereka dengan tutur kata yang baik, maka pisah ranjanglah dengan mereka dan jangan mendekati mereka. Apabila mereka tidak berpengaruh bagi mereka tindakan mengucilkan tersebut, maka pukullah dengan pukulan yang tidak memudaratkan bagi mereka sedikitpun. Jika kemudian mereka taat kepada kalian,maka hindarilah berbuat zhalim kepada mereka. Maka sesungguhnya Allah Maha tinggi lagi Maha besar perwaliyanNya, dan Dia akan membalas orang yang menzolimi mereka dan melapaui batas terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Para suami adalah pemimpin bagi para istri. Mereka mengurus berbagai keperluan para istri, karena Allah memberikan kelebihan kepada para suami atas para istri; jugakarena Allah mewajibkan mereka memberikan nafkah kepada para istri dan memimpin mereka. Wanita-wanita yang saleh senantiasa taat kepada Rabb mereka, patuh kepada suami-suami mereka, dan menjaga hak-hak suami-suami mereka di saat mereka tidak ada di rumah berkat bimbingan yang Allah berikan kepada mereka. Dan wanita-wanita yang kalian khawatirkan keengganan mereka untuk patuh kepada suami-suami mereka, baik dalam bentuk ucapan maupun perbuatan, maka mulailah -wahai para suami- dengan mengingatkan mereka agar mereka takut kepada Allah. Jika mereka tidak menghiraukannya, maka jauhilah mereka di tempat tidur dengan membalikkan badan dan tidak berhubungan badan dengan mereka. Jika mereka tetap tidak menghiraukannya, maka pukullah mereka dengan pukulan yang tidak melukai. Jika mereka kembali patuh kepada kalian, maka janganlah kalian berbuat semena-mena maupun memarahi mereka. Sesungguhnya Allah Mahatinggi dari segala sesuatu, lagi Mahabesar dalam Żat dan sifat-sifat-Nya, maka takutlah kalian kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Para lelaki merupakan pemimpin bagi para wanita dengan mewajibkan mereka menjalankan hukum-hukum Allah, seperti menjaga kewajiban-kewajiban dan hukum-hukum-Nya; dan pemimpin bagi mereka dalam hal menjaga dan melindungi, serta dalam hal bekerja dan mencari rezeki. Ummu Salamah berkata: “Para lelaki dapat pergi berperang, sedangkan para wanita tidak dapat melakukannya; dan bagi kami hanya setengah bagian harta warisan jika dibandingkan dengan para lelaki.” Maka Allah menurunkan ayat: ولا تتمنوا ما فضل الله به بعضكم على بعض Dan janganlah kamu iri hati terhadap karunia yang telah dilebihkan Allah kepada sebagian kamu atas sebagian yang lain. (an-Nisa: 32). (Sunan at-Tirmidzi bab surat an-Nisa, nomor hadist 329, Syeikh al-Albani berkata: sanad hadist ini shahih). Kemudian Allah menjelaskan bahwa para wanita terbagi menjadi dua macam, yaitu wanita yang shalihah dan taat kepada Allah serta taat kepada suaminya meski disaat suaminya tidak ada, ia akan menjaga diri dan harta suaminya, hal ini berkat penjagaan dan taufik Allah baginya. Dan yang kedua adalah wanita yang kalian takutkan akan membangkang kepada suaminya dengan perkataan atau perbuatan. Cara menghadapi wanita macam ini adalah dengan mendidiknya secara bertahap; tahap pertama yaitu dengan menjelaskan hukum Allah dalam mentaati dan membangkang para suami, menganjurkannya untuk berbuat taat dan memperingatkannya dari pembangkangan, jika dengan tahap ini ia telah berubah maka inilah yang diharapkan, namun jika tidak maka hendaklah suami berpisah ranjang darinya, dengan tidak berjima dengannya. Jika pada tahap ini ia juga tidak berhenti dari pembangkangan maka boleh bagi suami untuk memukulnya dengan pukulan yang tidak melukai. Jika dengan salah satu dari tahapan ini ia berhenti dari pembangkangan dan kembali mentaati kalian, maka apa yang kalian harapkan telah tercapai, maka janganlah kalian mengolok-oloknya atas apa yang telah ia dahulu lakukan dan mengungkit aib-aibnya yang menyebabkan keburukan dalam hubungan kalian. Ingatlah bahwa Allah Yang Maha Tinggi dan Maha Besar adalah penolong mereka, Dia akan membalas orang yang menzalimi mereka. Kalian telah banyak berbuat maksiat kepada-Nya, padahal Dia Maha Tinggi dan Maha Besar, namun Allah kemudian mengampuni kalian, maka hendaklah kalian memaafkan mereka jika mereka kemudian telah kembali mentaati kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. الرِّجَالُ قَوّٰمُونَ عَلَى النِّسَآءِ (Kaum laki-laki itu adalah pemimpin bagi kaum wanita) Yakni para laki-laki adalah pembimbing bagi para istri mereka, dan kewajiban bagi para istri untuk mentaati mereka dalam perintah kebaikan yang ditujukan kepada mereka. بِمَا فَضَّلَ اللهُ بَعْضَهُمْ عَلَىٰ بَعْضٍ (oleh karena Allah telah melebihkan sebahagian mereka (laki-laki) atas sebahagian yang lain (wanita)) Yakni kelebihan ini diberikan kepada para suami karena Allah telah melebihkan mereka atas para istri berupa kelebihan akal dan perawakan sehingga mereka dapat menjadi para pemimpin, penguasa, tantara perang dan hal-hal lainnya. وَبِمَآ أَنفَقُوا۟ (dan karena mereka (laki-laki) telah menafkahkan sebagian dari harta mereka) Yakni yang mereka infakkan dari harta mereka untuk para istri berupa mahar dan nafkah-nafkah. فَالصّٰلِحٰتُ (Sebab itu maka wanita yang saleh) Yakni dari istri-istri tersebut. قٰنِتٰتٌ (yang taat kepada Allah) Yakni yang taat kepada Allah dan kepada para suami mereka, yang senantiasa menunaikan apa yang diwajibkan atas mereka yang meliputi hak-hak Allah dan hak-hak suami mereka. حٰفِظٰتٌ لِّلْغَيْبِ (memelihara diri ketika suaminya tidak ada) Yakni menjaga apa yang wajib atas mereka untuk menjaganya ketika para suami mereka tidak ada, seperti menjaga diri, kehormatan, anak-anak, rumah, dan harta. بِمَا حَفِظَ اللهُ ۚ(karena Allah telah memelihara (mereka)) Yakni dengan penjagaan, bantuan, dan taufik dari Allah bagi mereka. وَالّٰتِى تَخَافُونَ نُشُوزَهُنَّ (Wanita-wanita yang kamu khawatirkan nusyuznya) Nusyuz bermakna pembangkangan. Jika dikatakan: istri itu melakukan nusyuz, yakni apabila dia membangkang suaminya dengan tidak mentaati perintahnya, atau dia menolak suaminya yang mengajak berjima’ tanpa uzur, atau dia keluar dari rumahnya tanpa seizin suami, dan lain sebagainya. فَعِظُوهُنَّ (maka nasehatilah mereka) Yakni ingatkanlah mereka dengan apa yang diwajibkan atas mereka berupa ketaatan dan pergaulan yang baik, dan bisa juga dengan cara mengiming-imingi mereka hal yang baik atau menakut-nakuti mereka. وَاهْجُرُوهُنَّ فِى الْمَضَاجِعِ(dan pisahkanlah mereka di tempat tidur mereka) Yakni jauhilah tempat tidur mereka. Pendapat lain mengatakan yakni dengan membelakangi mereka ketika tidur tanpa meninggalkan tempat tidur mereka. وَاضْرِبُوهُنَّ ۖ(dan pukullah mereka) Yakni dengan pukulan untuk mendidik dan meluruskan, bukan pukulan karena rasa dendam dan kesewenang-wenangan. فَإِنْ أَطَعْنَكُمْ(Kemudian jika mereka mentaatimu) Yakni mentaati sebagaimana yang diharuskan dan meninggalkan nusyuz. فَلَا تَبْغُوا۟ عَلَيْهِنَّ سَبِيلًا ۗ(maka janganlah kamu mencari-cari jalan untuk menyusahkannya) Yakni dengan sesuatu yang mereka benci baik itu dengan perkataan atau perbuatan; dan janganlah kalian paksa mereka untuk mencintai kalian karena hal itu diluar kehendak mereka. إِنَّ اللهَ كَانَ عَلِيًّا كَبِيرًا(Sesungguhnya Allah Maha Tinggi lagi Maha Besar) Maka ingatlah kekuasaan Allah atas kalian, karena kekuasaan-Nya diatas segala kekuasaan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا } \"Sesungguhnya Allah Maha Tinggi lagi Maha Besar\" , ayat ini ditutup dengan pujian yang agung kepada Allah, ayat ini menjadi teguran bagi kaum laki-laki yang berbuat zholim kepada perempuan-perempuan nya, karena sesungguhnya sekalipun mereka lemah dihadapat para lelaki, dan tidak berkekuatan untuk melakukan perlawanan, tetapi sesungguhnya Allah Maha tinggi lagi Maha Besar, Dia kuasa untuk berbuat pembalasan terhadap orang-orang melakukan kezholiman dan menyiksa kaum perempuan, dan janganlah kalian berbesar hati dengan kedudukan kalian yang lebih tnggi di atas kedudukan perempuan, karena sesungguhnya Allah Maha tinggi dan berkuasa di atas kalian, Dia lebih mampu menjatuhkanmu dihadapan seuluruh makhluk. 2 ). Ibnu 'Utsaimin berkata tentang akhiran dari ayat ini { إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا } : kalimat ini menjadi teguran dan peringatan bagi orang-orang mengagung-agungkan dirinya diatas kedudukan kaum wanita, dan menjadi nasihat bagi kaum lelaki tentang kesesaan keagungan Allah, maka janganlah mereka merasa tinggi dan sombong, karena di atas mereka ada dzat yang lebih tinggi dan lebih agung, dialah Allah ta'ala. 3 ). Ketika Allah menjelaskan tingginya kedudukan kaum laki-laki dihadapan kaum perempuan, dan hak seorang suami dalam hal adab dari seorang istri, Allah kemudian menutup ayat ini dengan firman-Nya : { إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا } \"Sesungguhnya Allah Maha Tinggi lagi Maha Besar\" maka Allah menyebut keagungan dan kuasa-Nya segabai motifasi bagi kaum laki-laki, agar mereka tidak menyombongkan diri dihadapan kaum perempuan, dan melampaui batas-batas yang ditetapkan oleh Allah. 4 ). Allah menutup ayat islah antara suami-istri dengan firman-Nya { إِنَّ اللَّهَ كَانَ عَلِيًّا كَبِيرًا }, karena penyebutan sifat tingginya Allah dalam ayat ini, adalah kalimat yang paling berpengaruh untuk meredakan kezholiman terhadap kaum perempuan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Laki-laki itu berlaku sebagai pemimpin dan penjaga bagi para wanita karena dua hal (1) memiliki karakter jantan, postur tubuh, dan kelebihan pengalaman, (2) menafkahi seluruh keluarga dan membayar sedekah. Wanita-wanita yang shalihah itu taat kepada Allah dan suami-suaminya, sehingga mereka menjaga diri dan anak-anak mereka saat suami-suami mereka tidak ada, serta menjaga harta suami mereka tanpa berbuat mubazir, karena telah dijaga dan ditolong oleh Allah serta hak-hak mereka seperti keadilan dan perlakuan baik dari suami telah ditunaikan. Dan wanita-wanita yang kamu khawatirkan kecacatannya, yaitu menolak perintah suami, mencegah diri untuk melakukan perintah suami tanpa alasan, dan keluar dari rumah tanpa seijin suami, maka ingatkanlah mereka tentang sesuatu yang diwajibkan Allah atas mereka yaitu taat dan bergaul dengan baik. Buatlah mereka berhasrat terhadap pahala Allah dan takut dengan hukumanNya di akhirat. Pisahkanlah mereka di tempat tidur lain, jika tidak mau menerima nasehat melalui ucapan, dan pukullah mereka dengan lembut untuk mendisiplinkan dan memperbaiki sikap mereka, jika belum bisa memperbaiki diri dengan dipisahkan dari tempat tidur. Dan jika mereka mau menaati kalian melalui salah satu perkara ini, maka janganlah kalian menyakitinya baik dengan perkataan maupun tindakan, karena perbuatan zalim itu diharamkan. Dan janganlah kalian memberinya beban dengan sesuatu yang kalian sukai, sedangkan itu tidak bisa dilakukan dan mereka tidak punya pilihan untuk melakukannya. Sesungguhnya Allah Maha Luhur, Maha Menaklukkan, Maha Besar dan Maha Kuasa. Ayat ini turun ketika ada seorang wanita yang datang kepada Nabi SAW melaporkan suaminya yang telah menempelengnya. Lalu Rasulullah memerintahkan untuk membalasnya. Kemudian Allah menurunkan ayat {Ar-Rijaalu Qawwaamuuna …}. Lalu wanita itu kembali tanpa membalas suaminya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Laki-laki itu penanggung jawab atas para perempuan} orang yang bertanggung jawab atas kebaikan wanita dan menjaga mereka {karena Allah telah melebihkan sebagian mereka atas sebagian lainnya} karena Allah melebihkan laki-laki atas perempuan {dan karena mereka telah menafkahkan sebagian dari harta mereka. Perempuan-perempuan yang shalih adalah mereka yang taat} yang taat kepada Tuhan mereka lalu kepada suami mereka {dan menjaga diri ketika tidak ada suami mereka} menjaga sesuatu yang wajib dijaga ketika suami mereka tidak ada {karena Allah telah menjaga (mereka)} karena penjagaan Allah kepada mereka {Perempuan-perempuan yang kamu khawatirkan akan nusyuz,} tidak menaati kalian dengan ucapan atau perbuatan {nasihatilah mereka} ingatkanlah dan peringatkanlah mereka tentang hukuman Allah {tinggalkanlah mereka di tempat tidur} tempat tidur {dan pukullah mereka} pukulan yang tidak keras dan tidak buruk {Tetapi jika mereka menaati kalian, maka janganlah kalian mencari-cari jalan untuk menyusahkan mereka} maka janganlah kalian mencari jalan untuk melakukan perbuataan melebihi batas kepada mereka {Sesungguhnya Allah Maha tinggi lagi Maha besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Allah mengabarkan bahwasanya “kaum laki-laki itu adalah pemimpin bagi kaum wanita,” maksudnya, dengan cara mengharuskan mereka untuk menunaikan hak-hak Allah berupa pemeliharaan akan kewajiban-kewajiban dariNya dan melarang mereka dari berbuat kerusakan, laki-laki wajib untuk menekankan hal tersebut kepada mereka, dan laki-laki juga adalah pemimpin mereka dengan memberikan nafkah kepada mereka berupa pakaian dan tempat tinggal. Kemudian Allah menyebutkan sebab yang mengharuskan fungsi laki-laki tersebut sebagai pemimpin atas wanita dalam FirmanNya, “Oleh karena Allah telah melebihkan sebagian mereka (laki-laki) telah menafkahkan sebagian dari harta mereka,” yaitu disebabkan karena keutamaan laki-laki atas wanita dan kelebihan yang diberikan (Allah) kepada mereka atas wanita. Pengutamaan laki-laki atas wanita disebabkan dari berbagai segi; dari segi kekuasaan adalah dikhususkan bagi laki-laki, kenabian, kerasulan, pengkhususan mereka dalam berbagai macam ibadah seperti jihad, shalat Hari raya dan Shalat Jum’at, dana pa yang telah Allah berikan secara khusus buat mereka berupa akal pikiran yang matang, kesabaran, dan ketegaran yang tidak dimiliki oleh wanita, demikian juga Allah mengkhususkan mereka dengan (kewajiban memberi) nafkah kepada istri, bahkan pada sebagian besar nafkah laki-laki dikhususkan untuknya dan diistimewakan dengannya daripada wanita, dan mungkin hal ini adalah rahasia dari Firman Allah, “Karena mereka telah menafkahkan,” dan menghilangkan obyek dalam kalimat tersebut menunjukkan kepada nafkah secara umum, maka dapat diketahui dari itu semua bahwa laki-laki itu seperti wali dan tuan bagi istrinya, sedang istrinya itu adalah sebagai pendamping, tawanan, dan pelayan, maka tugas laki-laki adalah menunaikan apa yang telah Allah perintahkan untuk dilindungi, dan tugas wanita adalah melakukan ketaatan kepada Rabbnya dan ketaatan kepada suaminya, oleh Karena itulah Allah berfirman, “Sebab itu, maka wanita yang shalih, ialah yang taat” yaitu ia taat kepada Allah, “lagi memelihara diri ketika suaminya tidak ada,” yaitu, ia taat kepada suaminya hingga saat suami sedang tidak ada dengan menjaga dirinya untuk suaminya dan juga hartanya, yang demikian itu dengan penjagaan Allah bagi mereka dan bimbinganNya terhadap mereka dan bukannya dari diri mereka sendiri, karena sesungguhnya nafsu itu selalu memerintahkan kepada kejahatan, akan tetapi barangsiapa yang bertawakal kepada Allah, niscaya cukuplah baginya hal itu dari perkara yang merisaukannya berupa perkara dunia maupun agamanya. Kemudian Allah berfirman, “Wanita-wanita yang kamu khawatirkan nusyuznya” yaitu tindakan tidak taat mereka kepada para suami mereka, berupa kedurhakaan terhadap suami, baik dengan perkataan maupun perbuatan, maka sang suami boleh menghukumnya dengan yang paling mudah lalu yang mudah. “Maka nasehatilah mereka” yaitu dengan menjelaskan kepada mereka tentang hukum-hukum Allah dalam perkara ketaatan dan kedurhakaan kepada suami, menganjurkannya untuk taat, dan mengancamnya dari berbuat durhaka, bila ia kembali taat, maka itulah yang diharapkan, namun bila tidak, maka suami boleh memisahkan istri di tempat tidurnya, yaitu suami tidak menggaulinya dengan tujuan sampai perkara yang diinginkan tercapai, namun bila tidak tercapai, maka suami boleh memukulnya dengan pukulan yang tidak membahayakan (tidak meninggalkan luka), dan bila perkara yang diinginkan tercapai dengan salah satu dari cara-cara tersebut di atas kemudian mereka kembali taat kepada kalian, “maka janganlah kamu mencari-cari jalan untuk menyusahkannya,” maksudnya, karena telah tercapai apa yang kalian kehendaki, maka janganlah kalian mencelanya atas perkara-perkara yang telah berlalu tersebut dan mencari-cari kekurangan yang sangat berbahaya bila disebutkan, di mana hal itu akan menimbulkan keburukan. “Sesungguhnya Allah Mahatinggi lagi Mahabesar,” yaitu milikNya ketinggian yang mutlak dari berbagai segi dan pandangan, ketinggian dzat, ketinggian kuasa dan ketinggian kemampuan, dan Yang Mahabesar di mana tidak ada yang memiliki keagungan Dzat dan sifat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻗﻮاﻣﻮﻥ} qowwaamuun: adalah bentuk jamak dari qowwaam yang berarti orang yang melindungi, mengurus, dan memperbaiki sesuatu. {ﺑﻤﺎ ﻓﻀﻞ اﻟﻠﻪ ﺑﻌﻀﻬﻢ} Bimaa fadhdholallohu ba’dhohum: memberikan kelebihan kepada kaum laki-laki kelebihan dalam hal akal, agama dan fisik, yang mana hal itu laik untuk diberikan kepadanya status qowwaam. {ﻭﺑﻤﺎ ﺃﻧﻔﻘﻮا ﻣﻦ ﺃﻣﻮاﻟﻬﻢ} Bimaa anfaquu min amwaalihim: dengan apa yang mereka nafakahkan dari harta kaum laki-laki, ini adalah faktor lain yang dapat membuat laki-laki mendapat gelar qowwaam dibandingkan dengan kaum wanita. Karena kaum pria membayar mahar dan mencari nafkah untuk perempuan yang mana faktor ini adalah hal yang paling pantas untuk menyebabkan seseorang mendapatkan gelar qowwaam, yaitu sifat kepemimpinan. {ﻓﺎﻟﺼﺎﻟﺤﺎﺕ} fashshoolohaat: wanita sholihah adalah wanita yang menunaikan hak-hak Allah dan hak-hak suaminya.. {ﻗﺎﻧﺘﺎﺕ} qoonitaat: adalah kaum wanita yang taat kepada Allah dan para suaminya. : ﻣﻄﻴﻌﺎﺕ ﻟﻠﻪ ﻭﻷﺯﻭاﺟﻬﻦ. {ﺣﺎﻓﻈﺎﺕ ﻟﻠﻐﻴﺐ} haafizhootun lilghooib: para wanita yang menjaga kehormatannya serta menjaga harta suaminya. {ﻧﺸﻮﺯﻫﻦ} nusyuzuhunna: nusyuz adalah congkak dihadapan suami dan tidak mematuhi suami. {ﻓﻌﻈﻮﻫﻦ} fa’izhuuhunna: diberikan nasihat dengan hasungan untuk berbuat taat dan ancaman untuk berbuat maksiat. {ﻓﻼ ﺗﺒﻐﻮا ﻋﻠﻴﻬﻦ ﺳﺒﻴﻼ} falaa tabghuu ‘alaihinna sabiilaa: janganlah para pria mencari-cari cara agar mereka (para wanita) bisa dipukul setelah mereka menjadi taat kepada kalian. Makna Ayat: Diriwayatkan sebab turunnya ayat ini, bahwasanya sa’ad bin Ar Rabi’ rodhiallohu ‘anhu telah dibuat marah oleh istrinya, maka dia menampar istrinya itu. Maka orang tua si istri mengadu kepada Rasulullah ﷺ, seolah sang ayah ini menginginkan qishosh, maka Allah menurunkan ayat {اﻟﺮﺟﺎﻝ ﻗﻮاﻣﻮﻥ ﻋﻠﻰ اﻟﻨﺴﺎء ﺑﻤﺎ ﻓﻀﻞ اﻟﻠﻪ ﺑﻌﻀﻬﻢ ﻋﻠﻰ ﺑﻌﺾ ﻭﺑﻤﺎ ﺃﻧﻔﻘﻮا ﻣﻦ ﺃﻣﻮاﻟﻬﻢ} “Kaum pria adalah pemimpin terhadap kaum wanita dengan apa yang Allah lebihkan terhadap kaum wanita berupa harta yang mereka nafkahkan” berkata orang tua istri Sa’ad, “Kami menginginkan suatu hal dan Allah menghinginkan yang lain. Dan yang dikehendaki oleh Allah adalah lebih baik.”. Maka orang tua sang wanita pun rela dengan ketetapan Allah, yaitu selama sang pria masih menjadi qowwaam terhadap istrinya dengan menjaganya, membimbingnya dan meluruskannya karena laki-laki telah dianugrahi dengan akal yang lebih sempurna dibandingkan dengan perempuan; ilmu pria lebih dalam dibandingkan dengan ilmu perempuan pada umumnya. Setelah diamatinya dasar-dasar perbedaan laki-laki dengan perempuan dan konsekuensi perbedaan mereka lebih jauh ditambah dengan adanya kewajiban laki-laki memberi mahar kepada perempuan, bukan wanita yang memberi pria. Serta kewajiban pria menafkahi perempuan, bukan sebaliknya. Maka dengan adanya keharusan seorang pria untuk mengurus dan memimpin perempuan, dan itu adalah kepemimpinan yang sesuai dengan syariat. Dengan adanya kepemimpinan di tangan pria, maka pria mempunyai hak untuk dapat memukul istrinya dengan tanpa menimbulkan bekas luka ataupun mematahkan anggota tubuh, semisal dengan pukulan untuk mendidik. Dengan adanya ketetapan dari Allah tentang kepemimpinan seorang suami terhadap istrinya, Allah pun memerintahkan kaum suami untuk berbuat baik, memuliakan dan lembut kepada mereka karena kaum wanita adalah kaum yang lemah. Dan Allah memuji kaum perempuan dengan friman-Nya {ﻓﺎﻟﺼﺎﻟﺤﺎﺕ} “Maka para wanita-wanita sholihah”, mereka adalah wanita yang menunaikan hak-hak Allah dengan menaati Allah dan Rosul-Nya serta menunaikan hak suami dengan keataan, penghormatan dan khidmat kepada suami. {ﻗﺎﻧﺘﺎﺕ} qonitaat adalah wanita-wanita yang taat kepada Allah dan suaminya. {ﺣﺎﻓﻈﺎﺕ ﻟﻠﻐﻴﺐ} Haafizhoot lilghoib, yaitu para istri yang menjaga harta suami dan kehormatannya, berdasarkan hadits “Jikalau sang suami pergi, sang istri menjaga dirinya dan harta suaminya”. {ﺑﻤﺎ ﺣﻔﻆ اﻟﻠﻪ} bimaa hafizholloh, maksudnya Allah akan menjaga untuk para istri yang sholihah ini, menolong mereka, karena jikalau hal-hal itu diserahkan kepada sang istri saja sendiri, dia tidak akan sanggup untuk menjaganya satu hal pun walaupun sedikit; ini adalah apa dapat dipahami dari yang diisyaratkan oleh Allah dalam konteks ayat ini. Dan itu adalah pujian kepada para wanita sholihah dari sisi Allah yang mana kaum laki-laki wajib untuk memuliakan, berbuat baik, lembut dikarenakan lemahnya kaum wanita. Ini adalah apa yang disebutkan dan diingatkan di dalam ayat ini, yang mana hal ini adalah apa disebutkan dalam Ayat. Kesimpulan ini telah disebutkan oleh lebih dari seorang ulama salaf. Firman Allah, {ﻭاﻟﻻﺗﻲ ﺗﺨﺎﻓﻮﻥ ﻧﺸﻮﺯﻫﻦ ﻓﻌﻈﻮﻫﻦ ﻭاﻫﺠﺮﻭﻫﻦ ﻓﻲ اﻟﻤﻀﺎﺟﻊ ﻭاﺿﺮﺑﻮﻫﻦ ﻓﺈﻥ ﺃﻃﻌﻨﻜﻢ ﻓﻼ ﺗﺒﻐﻮا ﻋﻠﻴﻬﻦ ﺳﺒﻴﻼ} “Para istri yang mana kalian takut jikalau mereka melakukan nusyuz, maka nasihatilah mereka, boikot mereka di ranjang dan pukulah mereka. Jikalau mereka sudah menaati kalian, janganlah kalian mencari-cari jalan …”. Sesungguhnya Allah telah memberikan arahan kepada para suami bagaiman cara merubah istri, jika istri melakukan nusyuz (angkuh dihadapan suami, tidak menunaikan hak-hak suami yang mana konsekuensi dari ikatan pernikahan diantara mereka). Allah berfirman {ﻭاﻟﻻﺗﻲ ﺗﺨﺎﻓﻮﻥ ﻧﺸﻮﺯﻫﻦ} “dan mereka yang mana dikhawatirkan nusyuznya”, maksudnya keangkuhan mereka, yang mana tercermin dari ketidaktaatan mereka terharadap perintah suaminya, tidak pula datang ketika dipanggil suami dan tidak berhenti ketika dilarang suami, maka hendaknya para suami menenpuh jalan berikut {ﻓﻌﻈﻮﻫﻦ} “nasihatilah mereka” untuk tindakan pertama. Nasihat adalah mengingatkan bahwa suami mempunyai hak yang mana harus ditunaikan oleh istri, konsekuensi dari menyepelekan hak suami adalah kemurkaan Allah dan azabnya serta apa yang akan berakibat dari melalaikan hak suami adalah pukulan dan dicerainya si istri. Nasihat adalah dengan menyebutkan pahala bagi istri yang sholihah lagi patuh. Nasihat juga berbentuk ancaman yang berupa hukuman bagi wanita yang rusak lagi bermaksiat. Jikalau nasihat berhasil, maka dicukupkan dengan nasihat saja. Apabila tidak mempan dengan nasihat, maka dilanjutkan dengan jalan yang kedua, yakni pemboikotan (pengabaian) yang dilakukan suami kepada istri di ranjang. Boikot adalah dengan tidak mengajak berbicara dan suami tidur dengannya di satu ranjang dengan si istri. Sang suami memberikan punggungnya, maka tidak mengajak bicara sang istri, tidak berhubungan intim dengannya dan sang suami bersabat dengan hal-hal tersebut sampai si istri kembali kepada ketaatan untuk suami dan Tuhannya. Jikalau si istri terus menerus melakukan nusyuz dan tidak ada pengaruhnya setelah dilakukan hajr (boikot) di ranjang, maka perlu dilancarkan cara yang ketiga. Cara yang ketiga adalah dengan memberikan pukulan kepada si istri dengan pukulan yang tidak menimbulkan bekas, tidak melukai dan tidak pula menciderai anggota badan si istri. Dan pada akhirnya, jika si istri menaati sang suami, maka sang suami tiada hak untuk mencari-cari cara untuk melukai si istri, tidak dengan pukulan ataupun hajr berdasarkan firman Allah {فَإِنْ أَطَعْنَكُمْ} “jikalau mereka sudah menaati kalian”, maksudnya taat kepada para suami. {فَلا تَبْغُوا} “janganlah kalian menginginkan”, maksudnya mencari-cari {عَلَيْهِنَّ سَبِيلاً} “jalan-jalan terhadap mereka”, maksudnya jalan untuk melukai mereka dengan berbagai sebab, mengada-adakan alasan dan dalih yang dapat membenarkan untuk melukai si istri. Allah berkata {إِنَّ اللهَ كَانَ عَلِيّاً كَبِيراً} “Sesungguhnya Allah Maha Tinggi dan Maha Agung”, perkataan ini untuk merendahkan orang yang berkeinginan untuk lebih tinggi dari orang lain dengan kemampuan yang dimiliki, bahwa Allah adalah zat yang lebih tinggi dan lebih agung dari orang yang merendahkan selainnya. Hendaklah dia takut kepada Allah dan meninggalkan kesombongan dan keangkuhannya. Ini adalah apa yang tercakup dari ayat yang mulia ini (34). Pelajaran dari ayat : • Penetapan adanya prinsip laki-laki sebagai seorang pemimpin (qowwaam) terhadap kaum wanita terutama seorang suami adalah pemimpin istrinya. • Wajib memuliakan wanita-wanita sholihah dan berbuat baik kepada mereka. • Penjelasan penyelesaian permasalahan nusyuz seorang istri pertama kali dengan nasihat, kemudian cara kedua adalah hajr di ranjang. • Tidaklah halal dengan sebab-sebab yang berbeda dan adanya pembenaran untuk melukai memukul seorang istri atau dengan yang lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 34: Laki-laki itu pengurus atas lantaran perempuan-perempuan, Allah telah lebihkan sebahagian dari mereka atas sebahagian,) dan dengan sebab (nafkah) yang mereka belanjakan dari harta-harta mereka. Maka perempuan-perempuan yang baik itu ialah yang ta'at, yang memelihara (perkara-perkara) yang tersembunyi dengan cara yang dipeliharakan oleh Allah, dan perempuan-perempuan yang kamu takut kedurhakaannya itu hendaklah kamu nasehati mereka dan hendaklah kamu tinggalkan mereka di tempat-tempat tidur, dan hendaklah kamu pukul mereka; tetapi jika mereka ta'at kepada kamu, maka janganlah kamu cari-cari jalan buat menyusahkan mereka, karena sesungguhnya Allah itu Maha Tinggi, Maha Besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni berkuasa. Mereka berhak mengatur wanita, menekan mereka untuk memenuhi hak Allah, seperti menjaga yang fardhu dan menghindarkan bahaya dari mereka. Kaum laki-laki juga pemimpin kaum perempuan dalam arti yang memberi nafkah, pakaian dan tempat tinggal. Kelebihan laki-laki di atas perempuan dapat dilihat dari beberapa sisi, di antaranya karena kewalian khusus dimiliki laki-laki, kenabian dan kerasulan juga khusus bagi laki-laki, dikhususkan bagi mereka beberapa ibadah seperti jihad, shalat Jum'at dsb. Demikian juga dilebihkannya laki-laki dalam hal akal, kesabaran dan kekuatan yang tidak dimiliki kaum perempuan. Maksudnya taat kepada suaminya meskipun suaminya sedang tidak ada, ia memelihara rahasia dan harta suaminya. Maksudnya Allah telah mewajibkan kepada suami untuk mempergauli istrinya dengan baik. Yakni nampak tanda-tanda nusyuz. Nusyuz adalah meninggalkan kewajiban bersuami isteri. nusyuz dari pihak isteri seperti meninggalkan rumah tanpa izin suaminya. Terangkanlah kepada mereka hukum menaati suami, mendorong mereka untuk taat, takutkanlah mereka dengan siksaan Allah jika durhaka kepada suaminya. Yakni jika mereka telah menampakkan nusyuz. Dengan tidak tidur bersamanya dan tidak menggaulinya sekedar agar tujuan dapat tercapai. Dengan pukulan yang tidak keras, jika pisah ranjang tidak membut mereka berhenti dari nusyuz. Maksudnya untuk memberi pelajaran kepada istri yang dikhawatirkan pembangkangannya harus dimulai dengan memberi nasihat. Jika nasihat tidak bermanfaat, barulah dipisahkan dari tempat tidur mereka, jika tidak bermanfaat juga barulah dibolehkan memukul mereka dengan pukulan yang tidak meninggalkan bekas atau pukulan yang keras. Jika cara pertama ada manfaatnya, janganlah digunakan cara yang lain dan seterusnya. Ada pula yang menafsirkan \"Tetapi, jika mereka menaatimu, maka janganlah kamu mencari-cari alasan untuk menyusahkannya\" yakni janganlah membahas masalah yang telah lalu, mencari-cari aib yang jika dibahas malah menimbulkan madharat dan keburukan. Yakni memiliki ketinggian secara mutlak dengan segala sisi dan I'tibarat (segi); Dia Tinggi dzat-Nya, Dia tinggi kedudukan-Nya dan Tinggi pula kekuasaan-Nya. Maha besar adalah Yang tidak ada yang lebih besar dan lebih agung daripada-Nya, yang besar dzat dan sifat-Nya. Oleh karena itu, takutlah terhadap siksaan-Nya jika kamu menzalimi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 34",
    "description": "Masih dalam kaitan larangan agar tidak berangan-angan dan iri hati atas kelebihan yang Allah berikan kepada siapa pun, laki-laki maupun perempuan, ayat ini membicarakan secara lebih konkret fungsi dan kewajiban masing-masing dalam kehidupan. Laki-laki atau suami itu adalah pelindung bagi perempuan atau istri, karena Allah telah melebihkan sebagian mereka, laki-laki, atas sebagian yang lain, perempuan, dan karena mereka, yakni laki-laki secara umum atau suami secara khusus, telah memberikan nafkah apakah itu dalam bentuk mahar ataupun serta biaya hidup rumah tangga sehari-hari dari hartanya sendiri. Maka perempuan-perempuan yang saleh adalah mereka yang taat kepada Allah dan menjaga diri ketika suami tidak ada di rumah atau tidak bersama mereka, karena Allah telah menjaga diri mereka. Perempuan-perempuan yang kamu khawatirkan akan melakukan nusyuz (durhaka terhadap suami), seperti meninggalkan rumah tanpa restu suami, hendaklah kamu beri nasihat kepada mereka dengan lemah lembut dan pada saat yang tepat, tidak pada sembarang waktu, dan bila nasihat belum bisa mengubah perilaku mereka yang buruk itu, tinggalkanlah mereka di tempat tidur dengan cara pisah ranjang, dan bila tidak berubah juga, kalau perlu pukullah mereka dengan pukulan yang tidak menyakitkan tetapi memberi kesan kemarahan. Tetapi jika mereka sudah menaatimu, tidak lagi berlaku nusyuz, maka janganlah kamu mencari-cari alasan untuk menyusahkannya dengan mencerca dan mencaci maki mereka. Sungguh, Allah mahatinggi, maha-besarbila upaya yang diajarkan pada ayat-ayat sebelumnya tidak dapat meredakan sengketa yang dialami oleh sebuah rumah tangga, maka lakukanlah tuntunan yang diberikan oleh ayat ini. Dan jika kamu khawatir akan terjadi syiqa'q atau persengketaan yang kemungkinan besar membawa perceraian antara keduanya, maka kirimlah kepada suami istri yang bersengketa itu seorang juru damai yang bijaksana dan dihormati dari keluarga laki-laki dan seorang juru damai yang juga bijaksana dan dihormati dari keluarga perempuan. Jika keduanya, baik suami istri, maupun juru damai itu, bermaksud mengadakan perbaikan, niscaya Allah akan memberi taufik jalan keluar kepada suami-istri itu. Sungguh, Allah mahamengetahui atas segala sesuatu, lagi maha teliti."
  }
]