[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila kalian (wahai para wali kedua suami istri),mengetahui adanya pertengkaran antara mereka berdua yang berpotensi mengakibatkan perceraian, maka utuslah oleh kalian kepada mereka berdua penengah yang adil dari keluarga suami,dan satu penengah yang adil dari keluarga istri, supaya mereka menganalisa dan menetapkan putusan yang mengandung kemaslahatan bagi pasangan suami istri tersebut. Dan dikarenakan niat baik dua penengah untuk mengadakan perdamaian, dan pemakaian ungkapan yang baik, Allah akan memberikan taufik bagi pasangan suami istri tersebut. Sesungguhnya Allah Maha mengetahui,tidak ada satu urusan hamba-hambaNYA, juga Maha teliti terhadap apa yang dipendam oleh jiwa-jiwa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Jika kalian -wahai para wali pasangan suami-istri- merasa khawatir bahwa persengketaan yang terjadi di antara keduanya bisa berujung pada permusuhan dan pertentangan, kirimkanlah seorang laki-laki yang adil dari keluarga si suami dan seorang laki-laki yang adil dari keluarga si istri, agar kedua orang itu memutuskan sesuatu yang terbaik bagi pasangan suami-istri tersebut, baik berupa perceraian maupun kerukunan di antara keduanya. Namun kerukunan lebih disukai dan lebih diutamakan. Jika kedua utusan itu menginginkan kerukunan dan memilih jalan yang terbaik, niscaya Allah akan merukunkan pasangan suami-istri tersebut dan menghilangkan perselisihan mereka. Sesungguhnya Allah Maha Mengetahui, tidak ada sesuatu pun yang tidak diketahui-Nya dari hamba-hamba-Nya lagi Maha Mengetahui apa yang mereka sembunyikan di dalam hati mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Setelah Allah menyebutkan tahapan-tahapan yang harus dilakukan ketika istri melakukan pembangkangan berupa menasehatinya, kemudian berpisah ranjang darinya, dan kemudian memukulnya dengan pukulan yang tidak melukai, maka Allah menjelaskan setelahnya tahapan selanjutnya jika pukulan tidak membuat istri berubah, yaitu dengan meminta orang yang adil untuk memutuskan perkara mereka: Jika kalian takut terjadi perselisihan dan permusuhan antara pasangan suami-istri, maka utuslah kepada pasangan tersebut dua orang yang adil yang memiliki kecerdikan dan mampu melihat kemaslahatan yang nantinya diharapkan dapat memperbaiki perselisihan antara suami istri. Dua orang ini harus mengetahui apa yang terjadi pada suami istri tersebut dan mengetahui perbedaan dan persamaan yang ada pada suami istri, kemudian dua orang ini hendaklah melihat apa yang dituntut dari masing-masing pihak, kemudian memutuskan perkara sebagaimana semestinya, dan selama masih dimungkinkan untuk tidak terjadi perceraian maka hendaklah itu dilakukan. Allah Maha Mengetahui segala yang nampak dan yang tersembunyi, Maha Melihat segala urusan yang tersembunyi dan rahasia. Dan salah satu dari keagungan ilmu-Nya adalah Dia menetapkan hukum-hukum yang mulia ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا (Dan jika kamu khawatirkan ada persengketaan antara keduanya) Yakni apabila perselisihan diantara kedua belah pihak telah membesar dan menguat. فَابْعَثُوا۟(maka kirimlah) Yakni kepada kedua belah pihak (suami istri) حَكَمًا(seorang hakim) Yakni untuk memutuskan perkara diantara mereka berdua, dan hakim atau mediator ini dari orang yang memiliki kelayakan dalam masalah ini baik itu secara keilmuan, agama, dan sifat adil. Allah menuliskan bahwa kedua hakim atau mediator ini berasal dari kedua belah pihak suami dan istri, dan ini bisa jadi karena mereka lebih mengetahui ahwal dari suami istri, lebih dapat menjaga rahasia, dan lebih mengharapkan perdamaian diantara keduanya dan kebaikan hubungan keduanya; dan hal ini dilakukan apabila belum diketahui siapa yang bersifat buruk dan lalai diantara suami istri tersebut, adapun jika telah diketahui maka yang harus dilakukan adalah menyerahkan hak yang dilalaikan dari salah satu pasangan kepada yang berhak. Kedua hakim atau penengah tersebut harus mengerahkan seluruh kemampuannya dalam usaha memperbaiki dua pihak yang berselisih, jika mereka mampu memperbaikinya baik dengan mewajibkan pemberian nafkah baik itu sedikit atau banyak, menghentikan kelalaian yang terjadi, menahan pemberian nafkah, atau dengan hal lainnya. Dan apabila keduanya tidak mampu memperbaiki hubungan pasangan ini dan melihat bahwa perceraian lebih baik bagi mereka maka hal itu boleh mereka lakukan; namun pendapat lain mengatakan kedua hakim tersebut harus mengangkat permasalahannya ke qadhi terlebih dahulu dan perceraian pasangan ini tidak sah tanpa putusan dari qadhi. إِن يُرِيدَآ (Jika keduanya) Yakni kedua hakim atau penengah itu menghendaki إِصْلٰحًا(perbaikan) Yakni perbaikan diantara pasangan suami istri itu. يُوَفِّقِ اللهُ بَيْنَهُمَآ ۗ (niscaya Allah memberi taufik kepada suami-isteri) Yakni Allah akan memberi taufik kepada pasangan itu hingga dapat kembali kepada keakuran dan pergaulan yang baik. Dan apabila kedua hakim itu saling berselisih maka putusan yang mereka ambil tidak boleh dilaksanakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perbakilah keinginan yang akan kita capai : { إِنْ يُرِيدَا إِصْلَاحًا يُوَفِّقِ اللَّهُ بَيْنَهُمَا } \"Jika kedua orang hakam itu bermaksud mengadakan perbaikan, niscaya Allah memberi taufik kepada suami-isteri itu\" karena seseorang akan menerima taufiq tergantung seberapa besar keinginannya untuk kebaikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Jika kalian takut tentang berlanjutnya perselisihan antara suami-istri itu, maka utuslah seorang hakim dari keluarga suami dan keluarga istri yang bisa memperbaiki masalah itu dengan cara yang masuk akal dan sesuai agama. Jika dua hakim atau suami istri itu bekehendak untuk memperbaiki hubungan, maka Allah akan memberi taufik kepada dua hakim dan suami-istri tersebut sampai mereka bergaul dengan baik, atau sampai keduanya saling sepakat. Dan jika tidak maka sebaiknya bercerai. Dan jika dua hakim tersebut berselisih maka keputusan hukum suami-istri tersebut tidak bisa dilaksanakan. Sesungguhnya Allah itu Maha Mengetahui segala sesuatu dan Maha Memberitahu perkara hamba-hambaNya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika kalian khawatir terjadi persengketaan di antara keduanya} kalian mengetahui bahwa akan ada perselisihan di antara suami dan istri {maka utuslah seorang yang adil} laki-laki yang adil {dari keluarga laki-laki dan seorang yang adil dari keluarga perempuan. Jika keduanya bermaksud melakukan perdamaian} jika kedua orang yang adil itu menghendaki perdamaian di antara kedua pihak {maka Allah memberi taufik kepada keduanya} Allah memberikan taufik di antara suami istri {Sesungguhnya Allah Maha Mengetahui lagi Maha Memberi Kabar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Maksudnya, bila kalian menghawatirkan terjadinya saling sengketa antara kedua suami istri,saling menjauh dan saling menghindar sehingga setiap pihak dari sebelah pihak tersebut berada pada posisi yang berbeda, “maka kirimkanlah seorang hakam dari keluarga laki-laki dan seorang hakam dasri keluarga perempuan,”yaitu dua orang laki-laki yang baligh,adil, dan yang berakal sehat, serta mengetahui apa yang terjadi antara kedua suami istri tersebut, juga mengetahui persatuan dan perceraian, ini semua di sarikan dari kata al-hakam, karena tidaklah pantas seseorang hakam itu kecuali orang yang memiliki ciri-ciri tersebut,mereka berdua (hakam) meneliti apa yang menjadi permasalahan dari kedua pihak suami istri tersebut terhadap pihak lainya, kemudian kedua hakam itu mengaharuskan setiap dari kedua pihak tersebut untuk menunaikan apa yang harus dilakukan,namun apabila salah satu puhak tidak dapat melakukanya,maka kedua hakam itu membujuk pihak lainyaagar ridho terhadap apa yang dilakukan berupa nafkah dan sikap yang baik. Dan selama kedua hakam itu mampu menyatukan kedua belah pihak tersebut maka tidak boleh bagi mereka kedua untuk mencari jalan lain, namun bila kondisi kedua belah pihak menuju kepada posisi yang tidak mungkin untuk bersatukan dan di perbaikikecuali akan mengakibatkan permusuhan, pemutusan tali kekeluargaan, dan maksiat kepda Allah, dan kedua hakam tersebut memandang cara yang terbaik adalah perceraian, maka kedua hakam tersebut memisahkan antara kedua pihak suami istri tersebut,dalam hal itu tidaklah disyaratkan ridho suami sebagaimana yang diindasikan dalam ayat ini bahwa Allah telah menamakan mereka sebagai hakam, dan hakam itu tugasnya adalah memutuskan hukum hingga walaupun orang yang terhukum tidak ridhodengan keputusan tersebut,oleh karena itu Allah berfirman, “jika kedua hakam tersebut bermaksud mengadakan perbaikan ,niscaya Allah memberi taufik kepad suami istri itu,” yaitu di sebabkan oleh pandangan yang mengandung keberkahan dan pembicaraan yang memikat hati dan mententramkan kedua suami istri. “Sesungguhnya Allah Maha Mengetahui dan Maha Mengenal,” yaitu mengetahui segala yang lahir maupun yang batin,mengawasi perkara-perkara yang tersembunyi dan rahasia. Dan antar ilmu dan pengetahuanNya adalah bahwa Allah mensyariatkan hukum-hukum yang mulia dan syariat-syariat yang indah tersebut."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﺷﻘﺎﻕ ﺑﻴﻨﻬﻤﺎ} syiqooqo bainihimaa: pertengkaran dan permusuhan sampai terjadi salah satu dari mereka ada di sisi lawan. {ﺣﻜﻤﺎ} hakaman: penengah dalam kasus ini berdasarkan pengamatan dan hukum. Makna ayat : Adapun ayat yang kedua (35), telah terkandung di dalamnya hukum konsensus yang mana jikalau terjadi perpecahan antara suami dan istri. Suami menjadi berada di satu sisi dan sang istri berada di sisi yang lain. Terjadi suasana yang mana suami dan istri tidak ada titik temunya, tidak pula kesepakatan dan tiada kasih sayang karena sulitnya keadaan. Jalan keluar dari situasi yang sulit ini adalah dengan melakukan apa yang telah di tunjukkan oleh Allah, yaitu dengan cara wali si istri mengutus seorang penengah dari pihaknya dan penengah pula dari pihak suami. Atau suami mencari sendiri seorang penengah dan begitu pula si istri mencari sendiri seorang penengah atau dengan melibatkan hakim. Semua cara tersebut boleh adanya untuk ditempuh. Allah berkata {فَابْعَثُوا} “maka kirimkanlah” dan perintah ini ditujukan untuk kaum muslimin dengan syarat si penengah adalah seorang yang adil, berilmu dan bijak sehingga hukum dan putusan berlangsung dengan adil. Kedua belah pihak penengah mempelajari kasus yang telah terjadi terlebih dahulu dari cara kedua suami-istri dalam berpendapat. Pada para penengah untuk mengidentifikasi sebab-sebab perpecahan, dengan apa yang terjadi dengan diri suami dari rasa cinta-kasih, kebencian, kemarahan kemudian menuju kesepakatan antara kedua suami-istri, jika hal itu memungkinkan. Jika hal itu tidak mungkin, maka dengan perceraian yang berlangsung dengan kerelaan kedua belah pihak suami-istri. Dengan diketahui jika terbukti ada kezaliman diantara suami-istri itu, jika ada permintaan untuk disingkirkan kezaliman yang telah terjadi. Jika halnya sang suami adalah pelaku kezaliman, maka dia wajib menyingkirkan kezalimannya dan menunaikan kewajibannya. Andai sang istri yang berlaku zalim, dia pula yang mengangkat kezaliman atau dia mengganti dengan harta agar suaminya menjatuhkan khulu’ (cerai gugat) kepada istri. Ini adalah makna dari firman Allah {وَإِنْخِفْتُمْ شِقَاقَ بَيْنِهِمَا} “jika ditakutkan ada perpecahan diantara mereka”, rasa takut di sini adalah prediksi kuat yang tercerminkan dari tanda-tanda dan bukti-bukti, segera untuk ditindak lanjuti sebelum keadaan semakin keruh. {فَابْعَثُوا حَكَماً مِنْ أَهْلِهِ وَحَكَماً مِنْ أَهْلِهَا} “kirimkanlah penengah dari pihak suami dan dari pihak istri” karena merekalah yang paling mengerti perihal ini dibandingkan selainnya. Allah berfirman {إِنْ يُرِيدَا إِصْلاحاً} “jika mereka berdua menginginkan perdamaian”, maksudnya adalah mereka para penengah. {يُوَفِّقِ اللهُ بَيْنَهُمَا} “Allah akan memberikan petunjuk kepada mereka”, yakni jikalau maksud dari mereka adalah memperbaiki hubungan suami isteri, memperasatukannya kembali, menyingkirkan perpecahan dan perbedaan diantara mereka, maka Allah akan membantu para penengah keseriusannya dan memberikan berkah dalam jalan yang mereka tempuh serta menganugrahi keberhasilan. Allah berfirman {إِنَّ اللهَ كَانَ عَلِيماً خَبِيراً} “Sesungguhnya Allah Maha Mengetahui dan Maha Mengerti”, Allah memberikan penjelasan tatkala menjanjikan petunjuk diantara para hakim. Karena jikalau Allah tidak mengetahui dan mengerti, maka Allah tidak akan mengetahui niat para penengah dan apa yang ada di dalam dada mereka, baik untuk mendamaikan atau malah merusak. Pelajaran dari ayat : • Disyariatkan mendamaikan dan menengahi dalam perkara perpisahan diantara suami-istri dan penjelasan tentang caranya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 35: Jika kamu takut perselisihan mereka berdua, make hendaklah kamu adakan seorang hakam dari ahlinya (laki laki) dan seorang hakam dari ahlinya (perempuan).Jika mereka ini berdua mau membikin perdamaian, niscaya Allah akan beri taufik di antara dua (suarmi-isteri) itu, karena sesungguhnyaAllah itu Pengetahui, Yang sangat tahu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan ridha keduanya. Hakam atau juru damai harus seorang muslim yang mukallaf (baligh dan berakal) dan adil serta mengetahui apa yang terjadi pada kedua suami-istri, ia mewakili masing-masing suami atau istri. Dalam menyikapi, hakam memperhatikan sebab yang menjadikan kedua suami-istri bertengkar, kemudian menekan masing-masing untuk melaksanakan yang wajib, jika ternyata salah satunya tidak mampu mengerjakan yang wajib, maka kedua hakam tesebut berupaya menjadikan istri menerima (qana'ah) terhadap rezeki sedikit yang disanggupi suami atau menjadikan suami menerima sikap istri. Jika ada peluang untuk bersatu kembali dan islah, maka harus dilakukan. Namun jika kondisinya sampai kepada kondisi yang tidak mungkin untuk disatukan, bahkan jika disatukan malah akan bermusuhan, terjadi maksiat dan perkara buruk lainnya, dan kedua hakam itu memandang bahwa berpisah itu lebih baik bagi kedua suami-istri, maka hal itu dilakukan. Keputusan dua orang hakam tidak disyaratkan harus ada keridhaan dari pihak suami, karena Allah menamainya hakam (juru damai dan hakim), di samping itu hakim adalah seorang yang memutuskan masalah meskipun orang yang diputuskan tidak ridha. Hakam juga mewakili suami misalnya dalam hal talak, menerima 'iwadh (ganti dalam khulu') dsb. sedangkan mewakili istri misalnya dalam melakukan khulu'. Kedua orang hakam berijtihad dan memerintahkan yang zalim agar ruju' (kembali) atau bahkan memisahkan jika dipandang perlu. Dengan sebab saran yang baik dari hakam dan kata-kata lembut yang masuk ke dalam hati. Di antara pengetahuan dan ketelitian-Nya adalah mensyari'atkan hukum-hukum ketika terjadi pertengkaran suami dan istri serta menetapkan syari'at yang sangat indah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 35",
    "description": "Bila upaya yang diajarkan pada ayat-ayat sebelumnya tidak dapat meredakan sengketa yang dialami oleh sebuah rumah tangga, maka lakukanlah tuntunan yang diberikan oleh ayat ini. Dan jika kamu khawatir akan terjadi syiqa'q atau persengketaan yang kemungkinan besar membawa perceraian antara keduanya, maka kirimlah kepada suami istri yang bersengketa itu seorang juru damai yang bijaksana dan dihormati dari keluarga laki-laki dan seorang juru damai yang juga bijaksana dan dihormati dari keluarga perempuan. Jika keduanya, baik suami istri, maupun juru damai itu, bermaksud mengadakan perbaikan, niscaya Allah akan memberi taufik jalan keluar kepada suami-istri itu. Sungguh, Allah mahamengetahui atas segala sesuatu, lagi maha telitiayat-ayat di atas yang berbicara tentang aturan dan tuntunan kehidupan rumah tangga dan harta waris, memerlukan tingkat kesadaran untuk mematuhinya. Ayat ini menekankan kesadaran tersebut dengan menunjukkan perincian tempat tumpuan kesadaran itu dipraktikkan. Dan sembahlah Allah tuhan yang menciptakan kamu dan pasangan kamu, dan janganlah kamu sekali-kali mempersekutukan-Nya dengan sesuatu apa pun. Dan berbuat baiklah dengan sungguh-sungguh kepada kedua orang tua, juga kepada karib-kerabat, anak-anak yatim, orang-orang miskin, tetangga dekat dan tetangga jauh walaupun tetangga itu nonmuslim, teman sejawat, ibnu sabil, yakni orang dalam perjalanan bukan maksiat yang kehabisan bekal, dan hamba sahaya yang kamu miliki. Sungguh, Allah tidak menyukai dan tidak melimpahkan rahmat dan kasih sayang-Nya kepada orang yang sombong dan membanggakan diri di hadapan orang lain."
  }
]