[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan beribadahlah kepada Allah dan patuhlah kepadaNYa semata, dan janganlah kalian mengadakan bagiNYa sekutu dalam rububiyyah dan peribadahan. Dan berbuat baiklah kalian kepada kedua orang tua dan penuhi hak-hak mereka berdua, dan hak-hak karib kerabat, anak-anak yatim yang maeninggal bapak-bapaknya sedangkan mereka masih berusia sebelum balignya,orang-orang yang membutuhkan yang tidak memiliki harta untuk mencukupi dan menutupi kebutuhan mereka,tetangga yang dekat dengan kalian dan tetangga jauh,teman dalam perjalanan dan dalam pemukiman,orang yang safar yang terdesak kebutuhan dan budak-budak belian dari hamba sahaya kalian,baik lelaki maupun perempuan. Sesungguhnya Allah tidak menyukai orang-orang yang sombong dari kalangan hamba-hambaNYa lagi membanggakan diri terhadap manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sembahlah Allah saja dengan cara tunduk kepada-Nya, dan jangan menyembah selain Dia. Berbuat baiklah kepada kedua orangtua dengan memuliakan dan berbakti kepada keduanya. Berbuat baiklah kepada karib kerabat, anak-anak yatim, dan orang-orang miskin. Berbuat baiklah kepada tetangga yang memiliki hubungan kekerabatan dan tetangga yang tidak memiliki hubungan kekerabatan. Berbuat baiklah kepada sahabat yang menemani kalian. Berbuat baiklah kepada musafir yang kehabisan bekal di perjalanan. Dan berbuat baiklah kepada hamba-hamba sahaya kalian. Sesungguhnya Allah tidak menyukai orang yang suka membanggakan dirinya sendiri, sombong kepada sesama, dan gemar menyanjung dirinya sendiri secara angkuh di hadapan manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. setelah Allah memerintahkan kedua belah pihak -suami istri- untuk bergaul dengan baik, kemudian Allah memerintahkan untuk melakukan perbuatan-perbuatan yang baik. Allah memulai perintah ini dengan perintah mengesakan-Nya dengan penuh rasa cinta, ketundukan, dan ikhlas; Allah melarang perbuatan syirik, sebab Dia Memiliki kuasa mutlak dalam mengatur alam semesta ini, tanpa ada sekutu yang membantu-Nya. Kemudian Allah menyandingkan perintah ini dengan perintah berbakti kepada kedua orangtua; Ini merupakan dalil yang menunjukkan besarnya hak mereka berdua atas anak-anaknya dan kewajiban berbakti kepada keduanya. kemudian Allah memerintahkan untuk berbuat baik kepada setiap muslim yang memiliki hubungan kerabat seperti saudara, paman, dan lainnya; dan berbuat baik kepada anak-anak yatim yang telah kehilangan ayah mereka sejak masa kecil, kepada orang-orang miskin yang tidak mampu mencukupi kebutuhan mereka, kepada tetangga dekat dan tetangga jauh, Kepada orang yang selalu menyertai kita baik itu istri, tamu, atau teman dalam perjalanan, serta kepada musafir yang sedang singgah. kemudian Allah memerintahkan untuk berbuat baik kepada setiap yang kita miliki baik itu berupa budak maupun hewan peliharaan. Barangsiapa yang tidak melakukan perbuatan-perbuatan tersebut maka ia termasuk orang yang angkuh dan sombong terhadap makhluk lain. Makna ‘fakhur’ yakni suka memuji diri sendiri Karena rasa sombong dan angkuh dihadapan hamba-hamba Allah yang lain. Mereka adalah orang-orang yang kesombongan dan keangkuhan mereka menghalangi mereka untuk memenuhi hak-hak orang lain dan menjauhkan mereka dari kasih sayang dan keridhaan Allah Yang Maha Memurah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَالْمَسٰكِينِ (, orang-orang miskin) Tafsir dari kata ini telah dijelaskan pada surat al-Baqarah: 177. وَالْجَارِ ذِى الْقُرْبَىٰ (tetangga yang dekat) Yakni orang yang selain mempunyai kedekatan secara tempat tinggal juga mempunyai kedekatan secara keturunan atau nasab. وَالْجَارِ الْجُنُبِ(dan tetangga yang jauh) Yakni orang yang jauh dan asing. Dan pendapat lain mengatakan yakni orang Yahudi dan Nasrani. Tetangga memiliki hak yang berbeda-beda tergantung tingkat kedekatannya dengan kita, semakin jauh rumahnya maka semakin kecil hak mereka atas kita, dan semakin dekat rumahnya maka semakin besar hak mereka atas kita. وَالصَّاحِبِ بِالْجَنۢبِ(dan teman sejawat) Yakni teman dalam perjalanan, menuntut ilmu, belajar keterampilan, kegiatan perniagaan, dan lain sebagainya. وَابْنِ السَّبِيلِ(ibnu sabil/orang yang dalam perjalanan) Yakni yang menyinggahimu sebentar. Makna sabil yakni jalan. Wajib bagi orang yang mukim untuk berbaik hati kepada mereka. Pendapat lain mengatakan ia adalah orang yang kehabisan bekal dalam perjalanan. Dan menurut pendapat lain ia adalah tamu. وَمَا مَلَكَتْ أَيْمٰنُكُمْ ۗ (dan hamba sahayamu) Mereka adalah dari budak laki-laki dan perempuan. Rasulullah memerintahkan agar mereka diberi makan sesuai dengan makanan yang dimakan oleh tuan mereka, dan diberi pakaian seperti pakaian yang dipakai tuan mereka. مُخْتَالًا (orang-orang yang sombong) Yakni yang sombong dan angkuh atas orang lain. فَخُورًا(membangga-banggakan diri) Yakni yang suka memuji diri sendiri, dan menceritakan kebaikannya. Dan makna dari ayat ini adalah Allah tidak menyukai orang yang suka membanggakan dan menyombongkan diri. Dan Allah murka dan berpaling dari mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Abdullah bin Waqid berkata : Tidaklah kamu mendapati seburuk-buruknya penguasa melainkan dia adalah orang yang sombong dan membangga-bangakan diri, kemudian ia membaca ayat { وَمَا مَلَكَتْ أَيْمَانُكُمْ ۗ إِنَّ اللَّهَ لَا يُحِبُّ مَنْ كَانَ مُخْتَالًا فَخُورًا } \"dan hamba sahayamu. Sesungguhnya Allah tidak menyukai orang-orang yang sombong dan membangga-banggakan diri\", dan tidak pula orang yang durhaka melainkan dia adalah orang yang sombong dan pasti akan celaka, kemudian ia membacakan ayat : { وَبَرًّا بِوَالِدَتِي وَلَمْ يَجْعَلْنِي جَبَّارًا شَقِيًّا } \"dan berbakti kepada ibuku, dan Dia tidak menjadikan aku seorang yang sombong lagi celaka\" [Maryam : 32]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Sembahlah Allah dengaan sebenar-benarnya. Janganlah menyekutukanNya. Kalian wajib menaati dan berbuat baik kepada kedua orang tua, kerabat, anak yatim yang kahilangan ayahnya ketika kecil, orang-orang yang membutuhkan, tetangga dekat rumah atau memiliki hubungan dengan kalian meskipun dia non muslim, tetangga jauh atau yang masih asing, teman kerja atau teman bepergian, dan seorang musafir yang beristirahat di tengah perjalanannya (As-Sabiil adalah jalan), serta budak laki-laki dan perempuan. Sesungguhnya Allah akan membalas orang yang sombong dan meremehkan orang lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sembahlah Allah dan janganlah kalian menyekutukanNya dengan sesuatu apa pun. Berbuat baiklah kepada kedua orang tua, kerabat dekat} orang yang memiliki hubungan kerabat {anak-anak yatim, orang-orang miskin, tetangga dekat dan tetangga jauh} orang yang jarak di antara kamu dan dia jauh {teman sejawat} teman dalam perjalanan {ibnu sabil} musafir asing yang sedang berhenti dalam perjalanannya {serta hamba sahaya yang kalian miliki. Sesungguhnya Allah tidak menyukai orang yang sombong} sombong dan bangga dengan diri sendiri {lagi sangat membanggakan diri} orang yang sering membanggakan keunggulannya di atas orang-orang"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻭاﻋﺒﺪﻭا اﻟﻠﻪ} Wa’budulloha: Konteks perintah ditujukan kepada kaum mukminin. Makna wa’budu, taatilah perintahNya dan laranganNya dengan penuh kerendahan diri, cinta, dan pengagungan kepada Allah. {ﻭﻻ ﺗﺸﺮﻛﻮا ﺑﻪ ﺷﻴﺌﺎ} Walaa tusyrikuu bihi syai’a: janganlah menyembah selain Allah bersamaan dengan menyembahNya dengan berbagai bentuk ibadah yang mana untuk berbakti, semisal doa, takut, menyembelih, nazar, rukuk, sujud dan berbagai bentuk ibadah yang lain. {ﻭﺑﺬﻱ اﻟﻘﺮﺑﻰ} Wabidzil qurba: orang-orang yang mempunyai hubungan kekerabatan. {ﻭاﺑﻦ اﻟﺴﺒﻴﻞ} Wabni sabiil: musafir yang mampir meminta untuk dijamu ataupun tidak meminta dijamu. {ﻭاﻟﺠﺎﺭ ﺫﻱ اﻟﻘﺮﺑﻰ} Waljaari dzil qurba: yaitu tetangga kerabat yang mempunyai hubungan nasab dan semenda. {ﻭاﻟﺠﺎﺭ اﻟﺠﻨﺐ} Waljaaril junub: tetangga selain kerabat yang beriman ataupun yang kafir. {ﻭاﻟﺼﺎﺣﺐ ﺑﺎﻟﺠﻨﺐ} Washshoohib bil janbi: istri, teman akrab, seperti murid ataupun teman di perjalanan jauh. {ﻭﻣﺎ ﻣﻠﻜﺖ ﺃﻳﻤﺎﻧﻜﻢ} Wamaa malakat iamaanukum: para budak {ﻣﺨﺘﺎﻻ ﻓﺨﻮﺭا} Mukhtaalan: angkuh dalam berjalan. fakhuuro: membanggakan kedudukan, keturunan dan harta dengan menghitung-hitung dan menyebut-nyebutnya. Makna Ayat: Konteks ayat masih dalam hal petunjuk dari Allah kepada kaum mukminin dan penjelasan hukum syariat kepada mereka agar mereka mengetahuinya, maka dengannya mereka akan sempurna dan akan bahagia. Dalam ayat (36) Allah memerintahkan kepada orang-orang beriman untuk beribadah kepada-Nya, mengesakanNya dalam segala ibadah, berbuat ihsan kepada kedua orang tua dengan taat kepada keduanya dalam hal makruf, melakukan kebaikan dan menahan dari melukai mereka. Hal ini berlaku pula kepada para kerabat, anak-anak yatim, orang-orang miskin dan para tetangga secara mutlak. Para kerabat, tetangga atau sahabat dekat yang kental, seperti istri, teman dalam safar, pekerjaan, mengajar dan belajar serta yang semisalnya yang mana mereka adalah orang-orang yang selalu di dekat kita tidak berpisah kecuali jarang. Jadi mereka adalah yang dapat disebut sebagai Shohib bil janbi (teman dekat). Begitupula dengan ibnu sabil dan para hamba sahaya dan semua yang disebutkan didalam ayat adalah orang-orang yang lebih utama untuk diperlakukan secara ihsan. Dan jikalau tidak demikian, maka ihsan adalah perbuatan baik yang harus dilakukan kepada setiap orang, seperti firman Allah {ﻭﻗﻮﻟﻮا ﻟﻠﻨﺎﺱ ﺣﺴﻨﺎ} “Dan berkatalah kepada manusia dengan perkataan yang baik”, dan Allah di kesempatan yang lain pun berfirman {ﻭﺃﺣﺴﻨﻮا ﺇﻥ اﻟﻠﻪ ﻳﺤﺐ اﻟﻤﺤﺴﻨﻴﻦ} “berbuat baiklah, sesungguhnya Allah mencintai orang-orang yang suka berbuat baik”. Dan Allah juga berfirman {ﺇﻥ اﻟﻠﻪ ﻻ ﻳﺤﺐ ﻣﻦ ﻛﺎﻥ ﻣﺨﺘﺎﻻ ﻓﺨﻮﺭا} “Sesungguhnya Allah tidaklah menyukai orang yang berjalan dengan angkuh lagi sombong”. Ini semua menunjukkan bahwa menahan berbuat ihsan (tidak mengganggu dan mencurahkan kebaikan) adalah mahkota akhlak kikir dan sombong. Yang mana keduanya adalah seburuk-buruknya akhlak. Ini adalah apa yang ditunjukkan oleh ayat (36) Pelajaran dari Ayat: • Ketetapan 10 hak serta perintah untuk menunaikannya dengan segera. Hak-hak itu adalah: beribadah kepada Allah semata, berbuat ihsan kepada kedua orang tua dan kepada setiap orang yang telah disebutkan di dalam ayat. • Celaan untuk cara jalan yang angkuh karena kesombongan dan celaan terhadap sifat jumawa serta penjelasan tentang bencinya Allah terhadap sifat-sifat di atas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 36: Dan hendaklah kamu berbakti kepada Allah; dan jangan kamu sekutukan Dia dengan sembarang sesuatu; dan hendaklah kamu berbuat baik dengan sesungguhnya kepada ibu-bapa dan keluarga yang hampir, dan anak-anak yatim, dan orang orang miskin, dan tetangga yang hampir, dan tetangga yang jauh dan sahabat sejalan, dan anak dan siapa-siapa yang dimiliki oleh tangan-tangan kanan kamu, sesungguhnya Allah itu tidak suka kepada orang yang sombong dengan perbuatannya, sombong dengarn perkataannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Ta'ala dalam ayat ini memerintahkan kita hanya menyembah kepada-Nya saja dan mengarahkan berbagai bentuk ibadah kepada-Nya, baik berdoa, meminta pertolongan dan perlindungan, ruku' dan sujud, berkurban, bertawakkal dsb. serta masuk ke dalam pengabdian kepada-Nya, tunduk kepada perintah-Nya dan menjauhi larangan-Nya dengan rasa cinta, takut dan harap serta berbuat ikhlas dalam semua ibadah baik yang nampak (ibadah lisan dan anggota badan) maupun yang tersembunyi (ibadah hati). Allah Ta'ala juga melarang berbuat syirk, baik syirk akbar (besar) maupun syirk asghar (kecil). Syirk Akbar (besar) adalah syirk yang biasa terjadi dalam uluhiyyah maupun rububiyyah. Syirk dalam Uluhiyyah yaitu dengan mengarahkan ibadah kepada selain Allah Ta’ala, misalnya berdo’a dan meminta kepada selain Allah, ruku’ dan sujud kepada selain Allah, berkurban untuk selain Allah (seperti membuat sesaji untuk jin atau penghuni kubur), bertawakkal kepada selain Allah dan mengarahkan segala bentuk penyembahan/ibadah lainnya kepada selain Allah Ta’ala. Sedangkan syirk dalam rububiyyah yaitu menganggap bahwa di samping Allah ada juga yang ikut serta mengurus alam semesta. Syirk dalam uluhiyyah dan rububiyyah termasuk syirk akbar. Sedangkan Syirk Asghar (kecil) adalah perbuatan, ucapan atau niat yang dihukumi oleh agama Islam sebagai Syirk Asghar karena bisa mengarah kepada Syirk Akbar contohnya adalah: q Bersumpah dengan nama selain Allah. q Memakai jimat dengan keyakinan bahwa jimat tersebut sebagai sebab terhindar dari madharat (namun bila berkeyakinan bahwa jimat itu dengan sendirinya bisa menghindarkan musibah atau mendatangkan manfaat maka menjadi Syirk Akbar). q Meyakini bahwa bintang sebagai sebab turunnya hujan. Hal ini adalah Syirk Asghar karena ia telah menganggap sesuatu sebagai sebab tanpa dalil dari syara’, indra, kenyataan maupun akal. Dan hal itu bisa menjadi Syirk Akbar bila ia beranggapan bahwa bintang-bintanglah yang menjadikan hujan turun. q Riya’ (beribadah agar dipuji dan disanjung manusia). Contohnya adalah seseorang memperbagus shalat ketika ia merasakan sedang dilihat orang lain. q Beribadah dengan tujuan mendapatkan keuntungan dunia. q Thiyarah (merasa sial dengan sesuatu sehingga tidak melanjutkan keinginannya). Misalnya, ketika ia mendengar suara burung gagak ia beranggapan bahwa bila ia keluar dari rumah maka ia akan mendapat kesialan sehingga ia pun tidak jadi keluar, dsb. Pelebur dosa thiyarah adalah dengan mengucapkan, اَللّهُمَّ لَا خَيْرَ اِلَّا خَيْرُكَ وَلَا طَيْرَ اِلَّا طَيْرُكَ وَلاَ اِلهَ غَيْرُكَ َ“Ya Allah, tidak ada kebaikan kecuali kebaikan-Mu dan tidak ada nasib sial kecuali yang Engkau tentukan. Tidak ada Tuhan yang berhak disembah selain Engkau.”(HR. Ahmad) Termasuk syirk juga adalah apa yang disebutkan oleh Ibnu Abbas radhiyallahu 'anhuma berikut ketika menafsirkan ayat \"Falaa taj'aluu lillahi andaadaa…\"artinya: \"Maka janganlah kamu adakan bagi Allah tandingan-tandingan sedang kamu mengetahui\" (Al Baqarah: 22) : الْأَنْدَادُ: هُوَ الشِّرْكُ أَخْفَى مِنْ دَبِيْبِ النَّمْلِ عَلَى صَفَاةٍ سَوْدَاءَ فِي ظُلْمَةِ اللَّيْلِ؛ وَهُوَ أَنْ تَقُوْلَ: وَاللهِ، وَحَيَاتِكَ يَا فُلاَنُ وَحَيَاتِيْ، وَتَقُوْلُ: لَوْلاَ كُلَيْبَةُ هَذَا لَأَتَانَا اللَّصُوْصُ، وَلَوْلَا الْبِطُّ فِي الدَّارِ لَأَتَانَا اللَّصُوْصُ، وَقَوْلُ الرَّجُلِ لِصَاحِبِهِ: مَا شَاءَ اللهُ وَشِئْتَ، وَقَوْلُ الرَّجُلِ: لَوْلَا اللهُ وَفُلاَنٌ. لاَ تَجْعَلْ فِيْهَا فُلاَناً هَذَا كُلُّهُ بِهِ شِرْكٌ (رواه ابن أبي حاتم) \"Tandingan-tandingan tersebut adalah perbuatan syirk, di mana ia lebih halus daripada semut di atas batu yang hitam di kegelapan malam, yaitu kamu mengatakan \"Demi Allah dan demi hidupmu hai fulan\", \"Demi hidupku\", juga mengatakan \"Jika seandainya tidak ada anjing kecil ini tentu kita kedatangan pencuri\", dan kata-kata \"Jika seandainya tidak ada angsa di rumah ini tentu kita kedatangan pencuri\", juga pada kata-kata seseorang kepada kawannya \"Atas kehendak Allah dan kehendakmu\", dan pada kata-kata seseorang \"Jika seandainya bukan karena Allah dan si fulan (tentu…)\", janganlah kamu tambahkan fulan padanya, semua itu syirk.\" Kata-kata \"Jika seandainya tidak ada anjing kecil ini tentu kita kedatangan pencuri\" adalah syirk jika yang dilihat hanya sebab tanpa melihat kepada yang mengadakan sebab itu, yaitu Allah Subhaanahu wa Ta'aala atau seseorang bersandar kepada sebab dan lupa kepada siapa yang mengadakan sebab itu, yaitu Allah Azza wa Jalla. Namun, tidak termasuk syirk jika seseorang menyandarkan kepada sesuatu yang memang sebagai sebab berdasarkan dalil syar'i atau hissiy (inderawi) atau pun waqi' (kenyataan), ssebagaimana sabda Nabi shallallahu 'alaihi wa sallam tentang Abu Thalib, \"Jika seandainya bukan karena saya, tentu ia berada di lapisan neraka yang paling bawah.\" Demikian pula termasuk syirk: - Meyakini ramalan bintang (zodiak), - Melakukan pelet, sihir/santet, - Membaca jampi-jampi syirk, - Mengatakan bahwa hujan turun karena bintang ini dan itu, padahal hujan itu turun karena karunia Allah dan rahmat-Nya. - Mengatakan “Hanya Allah dan kamu saja harapanku”, “Aku dalam lindungan Allah dan kamu”, “Dengan nama Allah dan nama fulan” dan kalimat lain yang terkesan menyamakan dengan Allah Ta’ala. Perbedaan Syirk Akbar dengan Syirk Asghar adalah bahwa Syirk Akbar mengeluarkan seseorang dari Islam, sedangkan Syirk Asghar tidak. Syirk Akbar menghapuskan seluruh amal sedangkan Syirk Asghar tidak dan Syirk Akbar mengekalkan pelakunya di neraka bila pelakunya meninggal di atas perbuatan itu sedangkan Syirk Asghar tidak (yakni tahtal masyii'ah; jika Allah menghendaki, maka Dia akan menyiksanya dan jika Allah menghendaki, maka Dia akan mengampuninya), kalau pun pelakunya disiksa, namun tidak kekal. Setelah Allah memerintahkan memenuhi hak-Nya, yaitu dengan mentauhidkan-Nya, Dia juga memerintahkan untuk memenuhi hak hamba, dari mulai yang terdekat lebih dahulu, yaitu kedua orang tua. Yakni berbuat baiklah kepada mereka baik dalam hal ucapan maupun dalam hal perbuatan. Dalam hal ucapan misalnya dengan berkata-kata yang lembut dan baik kepada kedua orang tua, sedangkan dalam hal perbuatan misalnya menaati kedua orang tua dan menjauhi larangannya, menafkahi orang tua dan memuliakan orang yang mempunyai keterkaitan dengan orang tua serta menyambung tali silaturrahim dengan mereka. Baik kerabat dekat maupun jauh, yakni kita diperintah berbuat baik kepada mereka dalam ucapan maupun perbuatan, serta tidak memutuskan tali silaturrahim dengan mereka. Anak yatim adalah anak-anak yang ditinggal wafat bapaknya saat mereka masih kecil. Mereka memiliki hak yang harus ditunaikan oleh kaum muslimin. Misalnya menanggung mereka, berbuat baik kepada mereka, menghilangkan rasa sedih yang menimpa mereka, mengajari adab dan mendidik mereka sebaik-baiknya untuk maslahat agama maupun dunia mereka. Misalnya dengan memenuhi kebutuhan mereka, mendorong orang lain memberi mereka makan serta membantu sesuai kemampuan. Dekat dan jauh di sini ada yang mengartikan dengan tempat, ada pula yang mengartikan dengan hubungan kekerabatan. Yakni tetangga dekat maksudnya tetangga yang memiliki hubungan kekerabatan. Sedangkan maksud tetangga jauh adalah tetangga yang tidak memiliki hubungan kekerabatan. Tetangga yang memiliki hubungan kekerabatan memiliki dua hak, hak tetangga dan hak sebagai kerabat. Oleh karenanya, tetangga tersebut berhak mendapatkan haknya sebagai tetangga dan berhak diberlakukan secara ihsan yang ukurannya sesuai uruf (kebiasaan yang berlaku). Demikian juga tetangga yang jauh, yakni yang tidak memiliki hubungan kekerabatan pun berhak mendapatkan haknya sebagai tetangga, semakin dekat tempatnya (rumahnya), maka haknya pun semakin besar. Selaku tetangganya, hendaknya ia tidak lupa memberinya hadiah, sedekah, mengundang, bertutur kata yang baik serta bersikap yang baik dan tidak menyakitinya. Ada yang mengartikan \"teman sejawat\" dengan teman dalam perjalanan, ada pula yang mengartikan istri, dan ada pula yang mengartikan dengan \"teman\" secara mutlak. Selaku teman hendaknya diberlakukan secara baik, misalnya dengan membantunya, menasehatinya, bersamanya dalam keadaan senang maupun sedih, lapang maupun sempit, mencintai kebaikan didapatkannya dsb. Ibnu sabil ialah orang yang dalam perjalanan bukan untuk maksiat dan bekalnya habis sehingga tidak dapat melanjutkan perjalanan. Termasuk juga anak yang tidak diketahui ibu bapaknya. Ibnu Sabil memiliki hak yang ditanggung oleh kaum muslimin, yaitu dengan menyampaikan ibnu sabil ke tempat tujuannya atau kepada sebagian tujuannya, memuliakannya dan bersikap ramah terhadapnya. Mencakup budak maupun hewan yang dimilikinya. Berbuat baik kepada mereka adalah dengan memberikan kecukupan kepada mereka dan tidak membebani mereka dengan beban-beban yang berat, membantu mereka mengerjakan beban itu dan membimbing mereka terhadap hal yang bermaslahat bagi mereka. Orang yang berbuat baik kepada mereka yang disebutkan dalam ayat di atas, maka sesungguhnya dia telah tunduk kepada Allah dan bertawadhu' (berendah hati) kepada hamba-hamba Allah; tunduk kepada perintah Allah dan syari'at-Nya, di mana ia berhak memperoleh pahala yang besar dan pujian yang indah. Sebaliknya, barang siapa yang tidak berbuat baik kepada mereka yang disebutkan itu, maka sesungguhnya dia berpaling dari Tuhannya, tidak tunduk kepada perintah-Nya serta tidak bertawadhu' kepada hamba-hamba Allah, bahkan sebagai orang yang sombong; orang yang bangga terhadap dirinya lagi membanggakan diri di hadapan orang lain. Di hadapan manusia terhadap apa yang dimilikinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 36",
    "description": "Ayat-ayat di atas yang berbicara tentang aturan dan tuntunan kehidupan rumah tangga dan harta waris, memerlukan tingkat kesadaran untuk mematuhinya. Ayat ini menekankan kesadaran tersebut dengan menunjukkan perincian tempat tumpuan kesadaran itu dipraktikkan. Dan sembahlah Allah tuhan yang menciptakan kamu dan pasangan kamu, dan janganlah kamu sekali-kali mempersekutukan-Nya dengan sesuatu apa pun. Dan berbuat baiklah dengan sungguh-sungguh kepada kedua orang tua, juga kepada karib-kerabat, anak-anak yatim, orang-orang miskin, tetangga dekat dan tetangga jauh walaupun tetangga itu nonmuslim, teman sejawat, ibnu sabil, yakni orang dalam perjalanan bukan maksiat yang kehabisan bekal, dan hamba sahaya yang kamu miliki. Sungguh, Allah tidak menyukai dan tidak melimpahkan rahmat dan kasih sayang-Nya kepada orang yang sombong dan membanggakan diri di hadapan orang lain. Ayat yang lalu ditutup dengan ungkapan ketidaksenangan Allah kepada orang-orang yang sombong dan membanggakan diri. Mereka itu adalah orang yang kikir, dan juga menyuruh orang lain agar berbuat kikir dengan cara menghalangi orang lain berinfak dengan ucapan, dan memberi contoh berinfak dengan jumlah yang sangat ke-cil, dan juga secara terus menerus menyembunyikan karunia yang telah diberikan Allah kepadanya dengan tidak mau menginfakkannya. Untuk itu, kami telah menyediakan hukuman untuk orang-orang kafir dalam bentuk azab yang menghinakan atas kesombongan mereka itu."
  }
]