[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Yaitu orang-orang yang menolak berinfak dan memberi dari sebagian karunia yang Allah rizkikan kepada mereka dan memerintahkan orang lain untuk berbuat kikir dan mereka itu mengingkari nikmat-nikmat Allah dan menutup-nutupi karunia dan pemberianNYA. Dan kami menyediakan bagi orang-orang yang ingkar siksaan yang menghinakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Allah tidak menyukai orang-orang yang enggan menjalankan kewajibannya untuk menginfakkan sebagian rezeki yang Dia berikan kepada mereka, dan menyuruh orang lain untuk berbuat demikian melalui ucapan dan perbuatan mereka, serta menyembunyikan karunia yang Allah berikan kepada mereka, baik berupa rezeki, ilmu, maupun lainnya, sehingga mereka tidak mau menunjukkan perkara yang benar kepada manusia, tetapi justru menyembunyikannya dan menunjukkan perkara yang batil. Itu adalah perilaku orang-orang kafir. Dan Kami telah menyiapkan azab yang menghinakan bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Kemudian Allah mengolok-olok mereka dengan sifat yang buruk: yaitu sifat bakhil dalam menunaikan kewajiban membayar zakat serta mengajak orang lain untuk berbuat bakhil dengan perkataan dan perbuatan mereka. Mereka juga enggan dalam menyampaikan ilmu yang dapat menjadi hidayah bagi orang-orang yang tersesat dan pencerahan bagi orang-orang jahil. Mereka sebenarnya hanya berusaha merugikan diri sendiri dan orang lain, sehingga balasan yang Allah siapkan bagi mereka adalah azab pedih yang menghinakan, Mereka mendapatkan kehinaan selama-lamanya sebagai balasan atas kesombongan dan keangkuhan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. الَّذِينَ يَبْخَلُونَ (orang-orang yang kikir) Yakni yang kikir dalam menunaikan hak-hak yang diwajibkan atasnya. وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ(dan menyuruh orang lain berbuat kikir) Yakni seakan-akan merasakan kehinaan dan kerendahan dalam hati mereka ketika melihat kedermawanan orang lain. Dan ini merupakan puncak dari keburukan, kebodohan, tidak tau malu, dan kejelekan sifat. وَيَكْتُمُونَ مَآ ءَاتَىٰهُمُ اللهُ مِن فَضْلِهِۦ ۗ(dan menyembunyikan karunia Allah yang telah diberikan-Nya kepada mereka) Yakni mereka memperlihatkan kemiskinan agar tidak dilihat orang yang membutuhkan sehingga tidak meminta kepada mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Macam-macam sifat bakhil begitu banyak, maka berhat-hati lah! { الَّذِينَ يَبْخَلُونَ وَيَأْمُرُونَ النَّاسَ بِالْبُخْلِ } \"(yaitu) orang-orang yang kikir, dan menyuruh orang lain berbuat kikir\" maksud kikir dalam ayat ini dapat diartikan kikir dengan harta, dan kikir dengan ilmu dan seterusnya, karena ayat ini mencakup segala macam sifat kikir baik itu yang berkaitan dengan dunia ataupun agama, sebagaimana di ayat lain yang berbicara tentang nafkah, Allah berfirman : { ومما رزقنهم ينفقون } nafkah dalam ayat ini dapat diartikan nafkah dari harta dan nafkah dari ilmu, dan adapun nafkah dengan ilmu adalah sedekah para Nabi dan warisan mereka adalah para ulama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Orang-orang yang takabur itu adalah orang-orang yang menahan hartanya untuk menunaikan kewajibannya dan memberi hak-hak fakir-miskin, meminta orang lain untuk tidak berinfak di jalan Allah, menyembunyikan nikmat Allah yang diberikan berupa harta dan ilmu, dan berlagak diam agar tidak ada orang yang mencari mereka. Kami telah menyiapkan azab yang rendah dan hina bagi orang-orang kafir. Sa’in bin Jabir berkta: “Para ulama’ Bani Israil kikir terhadap ilmu yang mereka miliki, lalu Allah menurunkan ayat {Alladziina yabkhaluuna ..}” Dan kebanyakan para mufassir berkata: “Ayat ini turun terkait orang Yahudi yang merahasiakan penggambaran nabi Muhammad SAW dan tidak menerangkannya kepada orang-orang, sedangkan mereka tahu bahwa penggambaran tersebut tertulis dalam kitab mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang kikir, menyuruh orang lain berbuat kikir, dan menyembunyikan} menyembunyikan {karunia yang telah dianugerahkan Allah kepada mereka. Kami telah menyediakan untuk orang-orang kafir itu azab yang menghinakan} menghinakan"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻳﺒﺨﻠﻮﻥ} Yabkholuun: Tidak mau membayar kewajiban dengan baik secara mutlak. {ﻭﻳﻜﺘﻤﻮﻥ} Wayaktumuun: mengingkari apa yang diberikan Allah kepada mereka berupa ilmu, harta dan keutamaan. Makna ayat : Adapun ayat (37) mengandung celaan terhadap sifat pelit dan sombong serta ayat ini mengkritisi kekikiran para ahli kitab dan tindakkan penyembunyian kebenaran. Dan ini adalah perumpamaan mahkota kekikiran mereka. Allah berfirman {اﻟﺬﻳﻦ ﻳﺒﺨﻠﻮﻥ ﻭﻳﺄﻣﺮﻭﻥ اﻟﻨﺎﺱ ﺑﺎﻟﺒﺨﻞ ﻭﻳﻜﺘﻤﻮﻥ ﻣﺎ ﺁﺗﺎﻫﻢ اﻟﻠﻪ ﻣﻦ ﻓﻀﻠﻪ} “Orang-orang yang pelit dan memerintahkan manusia untuk berbuat pelit dan menutup-nutupi apa yang telah dikaruniakan kepada mereka dari keutamaan Allah”, yaitu harta, ilmu dan menutup-nutupi ciri-ciri Nabi Muhammad dan sifat-sifatnya yang telah ditunjukkan oleh taurat dan injil. Para ahli kitab kikir dengan harta mereka dan memerintahkan orang-orang untuk berbuat kikir yang mana mereka mengatakan kepada kaum Anshor, ‘Janganlah kalian berinfak dengan harta kalian kepada Muhammad, karena kami takut kalian menjadi fakir. Dan penjelasan bahwa para ahli kitab ini adalah orang-orang kafir yang sejati, firman Allah {وَأَعْتَدْنَا لِلْكَافِرِينَ عَذَاباً مُهِيناً} “Dan telah Kami siapkan azab yang menghinakan untuk orang orang kafir” Pelajaran dari ayat : • Haramnya kekikiran dan haram pula memerintahkan untuk berbuat kikir serta haramnya menutup-nutupi ilmu terutama ilmu syar’i."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 37: (lalah) orang orang yang bakhil) dan menyuruh manusia Supaya bakhil dan menyembunyikan apa yang Allah telah beri kepadanya dari kurnia-Nya; dan Kami telah sediakan bagi orang- orang yang kafir itu adzab yang menghina."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Terhadap sesuatu yang wajib diberikan oleh mereka atau ada hak-hak wajib yang mesti mereka keluarkan. Baik dengan ucapan maupun dengan sikap mereka. Berupa ilmu dan harta. Seperti halnya orang-orang Yahudi. Mereka menyembunyikan pengetahuan tentang kenabian Muhammad shallallahu 'alaihi wa sallam, menggantinya dengan menampilkan yang batil sehingga menghalangi manusia dari masuk ke dalam agama yang dibawa Beliau. Mereka menggabung antara sikap kikir terhadap harta, kikir terhadap ilmu dan ditambah dengan upaya merugikan diri dan orang lain. Sifat seperti ini adalah sifat yang ada dalam diri orang-orang kafir. Oleh karena itu, di akhir ayat Allah Subhaanahu wa Ta'aala berfirman, \"Kami telah menyediakan untuk orang-orang kafir…dst.\" Ada yang mengatakan bahwa maksud \"kafir\" di sini adalah kufur terhadap nikmat Allah (tidak bersyukur). Hal itu, karena kikir, menyuruh orang lain berbuat kikir dan menyembunyikan karunia Allah berarti tidak mensyukuri nikmat Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 37",
    "description": "Ayat yang lalu ditutup dengan ungkapan ketidaksenangan Allah kepada orang-orang yang sombong dan membanggakan diri. Mereka itu adalah orang yang kikir, dan juga menyuruh orang lain agar berbuat kikir dengan cara menghalangi orang lain berinfak dengan ucapan, dan memberi contoh berinfak dengan jumlah yang sangat ke-cil, dan juga secara terus menerus menyembunyikan karunia yang telah diberikan Allah kepadanya dengan tidak mau menginfakkannya. Untuk itu, kami telah menyediakan hukuman untuk orang-orang kafir dalam bentuk azab yang menghinakan atas kesombongan mereka itu. Dan termasuk ke dalam orang-orag yang sombong dan membanggakan diri itu adalah orang-orang yang menginfakkan hartanya karena ria kepada orang lain agar dilihat dan dipuji, dan juga orang-orang yang tidak beriman kepada Allah dan tidak beriman kepada hari kemudian. Barang siapa menjadikan setan sebagai temannya, karena sombong dan membanggakan diri itu adalah sifat setan, maka ketahuilah bahwa dia, setan itu, adalah teman yang sangat jahat bagi manusia."
  }
]