[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan demikian pula kami telah menyediakan siksaan ini bagi orang-orang yang menginfakkan harta mereka karena dorongan riya dan sum’ah, dan mereka tidak beriman kepada Allah baik berupa keyakinan kuat dan amal, dan tidak beriman kepada hari kiamat. Perbuatan-perbuatan buruk ini termasuk perkara-perkara yang diserukan oleh setan. Dan barangsiapa yang setan menjadi pendampingnya, maka dialah seburuk-buruk pendamping dan teman dekat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Kami juga menyediakan azab yang menghinakan bagi orang-orang yang menginfakkan hartanya dengan tujuan supaya dilihat dan dipuji oleh manusia, tidak beriman kepada Allah dan tidak percaya akan adanya hari Kiamat. Yang membuat mereka tersesat tidak lain hanyalah kegemaran mereka mengikuti setan. Barangsiapa yang berteman dan bersahabat dengan setan, maka setan adalah seburuk-buruk sahabat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. kemudian Allah mengolok-olok orang yang menginfakkan hartanya untuk tujuan riya dan sum’ah, bukan karena dasar dan keimanan kepada Allah serta mengharapkan pahala-Nya di akhirat. Ini merupakan langkah-langkah setan yang menyertai mereka. sungguh itulah seburuk-buruk makhluk yang menyertai, yang menjauhkan temannya dari surga dan menjerumuskannya ke dalam kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَالَّذِينَ يُنفِقُونَ أَمْوٰلَهُمْ رِئَآءَ النَاسِ (Dan (juga) orang-orang yang menafkahkan harta-harta mereka karena riya kepada manusia) Yakni sebagaimana yang dilakukan orang agar orang lain menganggap dirinya dermawan atau banyak bersedekah. وَمَن يَكُنِ الشَّيْطٰنُ لَهُۥ قَرِينًا (Barangsiapa yang mengambil syaitan itu menjadi temannya) Makna (القرين) adalah teman dekat atau sahabat. فَسَآءَ قَرِينًا (maka syaitan itu adalah teman yang seburuk-buruknya) Kerena ia menjerumuskannya kepada kebinasaan, menyuruh agar berbangga diri, sombong, berbuat kikir, dan berinfak dengan maksud pamer; sehingga menghalanginya untuk mendapatkan pahala dari infak di jalan kebaikan dan menghanguskan hartanya dengan berinfak di jalan kebathilan. Maka inilah seburuk-buruk teman. Dalam hadist disebutkan: “tiga golongan yang pertama-tama diseret ke neraka pada hari kiamat, dan disebutkan diantaranya orang yang memiliki harta kemudian ia menginfakkan dan mensedekahkannya agar disebut sebagai orang yang dermawan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan juga orang-orang yang menafkahkan hartanya karena riya’ dan ingin mendapatkan popularitas. Sedangkan mereka tidak beriman hanya kepada Allah, tidak juga kepada akhirat layaknya orang-orang munafik dan penduduk Mekkah, karena mereka adalah para sahabat setan. Dan barangsiapa menjadikan setan sebagai sahabatnya, maka ini adalah sahabat paling buruk baginya di neraka, karena setan itu membimbingnya menuju kehancuran seperti kesombongan, kebakhilan dan riya’"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan orang-orang yang menginfakkan hartanya karena riya kepada orang lain} supaya manusia melihat dan memuji mereka {dan tidak beriman kepada Allah, tidak pula kepada hari akhir. Siapa saja yang menjadikan setan sebagai temannya, dia adalah seburuk-buruk teman} teman sejati"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Kemudian Allah memberitakan tetang nafkah yang bersumber dari suatu tindakan riya (ingin di lihat) dan sum’ah (ingin di dengar) serta tidak beriman kepad firmaNya,”Dan juga orang-orang yang manefkahkan harta mereka karena riya kepada manusia,” maksudnya, agar orang lain melihat, memuji, dan menghormati mereka. “ Dan orang-orang yang tidak beriman kepada Allah dan kepada hari kemudian,” yaitu infak mereka tidak bersumber dari hati yang bersih yang ihklas dan keimanan kepada Allah serta mengharap balasannya, artinya adalah hal ini dari langkah-langkah setan dan perbuatan-perbuataNya, di mana ia mengajak golonganya melakukan hal tersebut, agar mereka semua menjadi penghuni-penghuni neraka yang menyala, dan terjadilah perbuatan itu dari mereka yang di sebabkan oleh setan yang selalu mengiringi mereka dan bantuanya kepada mereka dengan hal tersebut, karena itu Allah berfirman, “barangsiapa yang menjadikan setan itu sebagai temanya, maka setan itu adalah seburuk-buruk teman,” yaitu seburuk-buruknya teman dan pendamping yang menghendaki kehancuran orang yang ditemani dengan usaha yang keras untuk dapat merealisasikanya. Dan sebagaiman orang yang berlaku kikir akan apa yang telah Allah karuniakan kepadanya dan menyembunyikan apa yang telah Allah berikan kepadanya adalah seorang pendosa lagi berpaling dari Rabbnya, begitu pula orang-orang yang berinfak dan beribadah kepada selain Allah,sesungguhnya ia telah berdosa, durhaka terhadap Rabbnya, sehingga ia berhak mendapat hukuman, karena Allah memerintahkan untuk taat kepadaNya dan menunaikan perintah-perintahNya dengan ihklas,sebagaimana Allah berfirman, \"Padahal mereka tidak disuruh kecuali supaya menyembah Allah dengan memurnikan ketaatan kepada-Nya dalam (menjalankan) agama yang lurus, dan supaya mereka mendirikan shalat dan menunaikan zakat; dan yang demikian itulah agama yang lurus.\" -Al-bayinah:5- Inilah perbuatan yang akan diterima,dimana pelakunya berhak mendapatkan pahala dan pujian, oleh karena itulah Allah menganjurkan hal tersebut dalam firmanya,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻗﺮﻳﻨﺎ} Qoriina: orang yang selalu bersama tidak pernah terpisah dari sahabatnya terikat kental. Makna ayat : Maka ayat yang ke-38 adalah penjelasan tentang keadaan manusia yang selain Yahudi dan Nasrani, mereka adalah kaum munafik. Allah berfirman {وَالَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ رِئَاءَ النَّاسِ} “Dan orang-orang yang menafkahkan hartanya untuk berbuat riya’ dihadapan manusia”, yaitu berbuat agar diperhatikan untuk melindungi diri mereka dari celaan manusia dan mendapatkan pujian mereka. {وَلا يُؤْمِنُونَ بِاللهِ وَلا بِالْيَوْمِ الآخِرِ} “Mereka tidak beriman kepada Allah dan tidak pula beriman kepada hari kiamat”, karena kaum munafik adalah orang-orang kafir yang melakukan kesyirikan, mereka menampakkan Islam bentuk penyamaran agar aman saja. Oleh karenanya mereka berinfak tiadalah kecuali untuk mencari perhatian (riya’). {وَمَنْ يَكُنِ الشَّيْطَانُ لَهُ قَرِيناً فَسَاءَ قَرِيناً} “Barang siapa yang setan menjadi teman dekatnya, maka itu adalah seburuk-buruknya teman dekat.”, maksudnya adalah seburuk-buruknya teman yang dimiliki adalah setan yang menjadi teman. Pelajaran dari ayat : • Haramnya perbuatan riya’ dan celaan bagi orang yang melakukannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 38: Dan (ialah) yang membelanjakan hartanya supaya dilihat oleh manusia,) dan tidak beriman kepada Allah, dan tidak kepada hari Kemudian; dan barang siapa setan jadi sahabatnya, maka sejahat- jahat sahabatlah ia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Riya ialah melakukan sesuatu karena ingin dilihat dan dipuji orang lain. Infak mereka tidak didasari keikhlasan, keimanan kepada Allah dan mengharap pahala di hari kemudian. Tindakan mereka seperti yang disebutkan dalam ayat di atas tidak lain disebabkan mereka menjadikan setan sebagai kawannya. Padahal setan adalah seburuk-buruk kawan, karena usahanya untuk membinasakan kawannya dan berusaha merugikannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 38",
    "description": "Dan termasuk ke dalam orang-orag yang sombong dan membanggakan diri itu adalah orang-orang yang menginfakkan hartanya karena ria kepada orang lain agar dilihat dan dipuji, dan juga orang-orang yang tidak beriman kepada Allah dan tidak beriman kepada hari kemudian. Barang siapa menjadikan setan sebagai temannya, karena sombong dan membanggakan diri itu adalah sifat setan, maka ketahuilah bahwa dia, setan itu, adalah teman yang sangat jahat bagi manusiasebenarnya beriman kepada Allah dan hari kemudian serta menginfakkan sebagian dari karunia yang diberikan oleh Allah yang sangat banyak itu, tidaklah berat. Dan apa sebenarnya keberatan bagi mereka jika mereka beriman kepada Allah dan hari kemudian dan apa kesulitannya jika mereka menginfakkan sebagian, bukan seluruhnya, dari rezeki yang telah diberikan Allah kepadanya' sungguh tidak ada kesulitan sedikit pun untuk melakukan hal itu. Dan ingatlah bahwa Allah sesungguhnya maha mengetahui segala sesuatu tentang keadaan mereka"
  }
]