[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mudarat apa yang akan menimpa mereka seandainya mereka beriman kepada Allah dan hari akhir, baik dalam bentuk keyakinan maupun dengan amal, dan menginfakkan sebagian yang Allah berikan kepada mereka dengan mengharap pahala dan ikhlas? dan Allah Maha Mengetahui mereka dan apa yang mereka perbuat, dan DIA akan menghisab mereka atas semua itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Apa salahnya jika mereka beriman dengan sungguh-sungguh kepada Allah dan hari Kiamat, dan menginfakkan harta mereka di jalan Allah secara tulus dan ikhlas? Bahkan seluruh kebaikan ada di dalam hal itu. Allah Maha Mengetahui mereka, tidak ada satu pun kondisi mereka yang luput dari pengetahuan-Nya. Dan Dia akan memberikan balasan yang setimpal dengan amal perbuatan masing-masing."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Apakah musibah dan bahaya yang akan menimpa mereka jika mereka beriman kepada Allah dan hari akhir serta menginfakkan harta yang telah Allah berikan kepada mereka? Kemudian Allah menutup ayat ini dengan ancaman dan peringatan atas hal-hal buruk yang mereka sembunyikan di dalam dada mereka, yaitu dengan menyebutkan bahwa Allah Maha Mengetahui apa yang mereka sembunyikan dan Dia akan membalas perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Apakah kemudharatan yang akan menimpa mereka ketika beriman dan menginfakkan sebagian rejeki yang diberikan Allah untuk mendapatkan ridhaNya. Dan Allah itu Maha Mengetahui infak dan amal mereka, Dia akan membalas mereka atas amal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apa ruginya bagi mereka} tidak ada ruginya bagi mereka {seandainya mereka beriman kepada Allah dan hari akhir serta menginfakkan sebagian rezeki yang telah dianugerahkan Allah kepada mereka. Allah adalah Maha Mengetahui mereka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Maksudnya, apa yang menimpa mereka dan kerugian atau kesusahan apa yang akan mereka temui apabila mereka berimankepada Allah yaitu ihklas dan menginfakan sebagian harta yang telah Allah berikan kepada mereka dan telah Allah karuniakannya mereka denganya, sehingga mereka dapat menyatukan keihklasan dan berinfak? Namun ketika keihklasan itu adalah sebuah perkara yang tersembunyi antara seorang hamba dan RabbNya, tidak ada yang mampu mengetahuinya kecuali Allah, maka Allah mengabarkan mengetahuai segala keadaan dan kondisi dalam firmaNya, “Dan Allah Maha Mengetahgui Keadaan mereka.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻭﻣﺎﺫا ﻋﻠﻴﻬﻢ} wa maadzaa ‘alaihim: segala sesuatu yang membahayakan mereka ataupun yang mereka dapatkan adalah hal yang dibenci jikalau mereka beriman. Makna ayat : Ini adalah yang tercakup dalam ayat yang kedua (39), yaitu firman Allah {وَمَاذَا عَلَيْهِمْ لَوْ آمَنُوا بِاللهِ وَالْيَوْمِ الآخِرِ وَأَنْفَقُوا مِمَّا رَزَقَهُمُ اللهُ} “dan apa yang ada pada mereka jikalau mereka beriman kepada Allah dan hari akhir serta menafkahkan dari apa yang diberikan oleh Allah kepada mereka”. Ayat ini telah tercakup didalamnya pengingkaran dan celaan kepada orang-orang munafik yang menginfakkan hartanya untuk mencari perhatian manusia serta tidak beriman kepada Allah dan hari akhir, dikarenakan godaan setan dan kedekatan setan dengan meraka. Allah berfirman {وَمَاذَا عَلَيْهِمْ} “Dan apa yang ada pada mereka”, yaitu sesuatu yang mencelakakan mereka atau aral apapun yang kan menimpa mereka di dunia ataupun di akhirat. Jikalau mereka mempercayai Allah dan Rosul-Nya, menafkahkan rizki mereka untuk jalan Allah -dalam konteks pendidikan- untuk mengoreksi keimanan mereka dan tegaknya mereka untuk keluar dari lingkaran kemunafikan yang mana (setan) sahabatnyalah yang menjerumuskannya, maka Allah tidak menyebutkan ancaman untuk mereka. Dan Allah hanya berfirman {وَكَانَ اللهُ بِهِمْ عَلِيماً} “dan Allah Maha Mengetahui perihal mereka”. Ini adalah bentuk menakut-nakuti mereka karena buruknya keadaan mereka apabila mereka meneruskan kemunafikannya. Karena ilmu Allah akan berkonsekuensi hukuman kepada mereka jika mereka tidak segera bertaubat. Pelajaran dari ayat : • Celaan terhadap teman-teman dekat yang buruk karena mereka akan memerintahkan dan menyeru untuk melakukan keburukan. Kata pepatah arab: janganlah kalian tanya tentang hakikat seseorang, tanyakanlah perihat teman dekatnya Karena setiap sahabat di dalam persahabatannya ditiru"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 39: Apakah atas mereka? jika mereka beriman kepada Allah dan hari Kemudian dan mereka belanja kan sebahagian dari apa yang dikurniakan mereka? Dan adalah Allah itu amat Mengetahui akan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagaimana kikir terhadap karunia Allah dan menyembunyikan apa yang diberikan Allah merupakan kemaksiatan, demikian pula orang yang berinfak dan beribadah karena selain Allah, ia pun berdosa dan bermaksiat. Hal itu, karena Allah Subhaanahu wa Ta'aala memerintahkan menaati-Nya dengan cara ikhlas, amalan yang didasari keikhlasan itulah yang diterima Allah. Oleh karena itu, di ayat ini Allah Subhaanahu wa Ta'aala mengajak mereka yang berbuat seperti itu untuk berpikir, yakni apa keberatannya mereka beriman kepada Allah dan beribadah kepada-Nya dengan ikhlas. Yakni tidak ada mudharatnya, bahkan yang ada mudharat atau bahayanya adalah apa yang mereka yakini selama ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 39",
    "description": "Sebenarnya beriman kepada Allah dan hari kemudian serta menginfakkan sebagian dari karunia yang diberikan oleh Allah yang sangat banyak itu, tidaklah berat. Dan apa sebenarnya keberatan bagi mereka jika mereka beriman kepada Allah dan hari kemudian dan apa kesulitannya jika mereka menginfakkan sebagian, bukan seluruhnya, dari rezeki yang telah diberikan Allah kepadanya' sungguh tidak ada kesulitan sedikit pun untuk melakukan hal itu. Dan ingatlah bahwa Allah sesungguhnya maha mengetahui segala sesuatu tentang keadaan mereka ayat yang lalu ditutup dengan sebuah pernyataan bahwa Allah maha mengetahui segala sesuatu tentang keadaan orang-orang sombong dan membanggakan diri itu. Untuk mengikis kesan Allah menimpakan siksa yang melebihi batas kedurhakaan orang-orang yang sombong dan membanggakan diri itu, ayat ini memberi penegasan bahwa Allah tidak akan berlaku aniaya. Sungguh, ketahuilah bahwa Allah tidak akan menzalimi ketika menjatuhkan sanksi kepada seseorang, walaupun sebesar dzarrah yakni sesuatu yang terkecil dan teringan, dan demikian pula jika ada kebajikan, walaupun kebajikan itu hanya sekecil dzarrah, niscaya Allah akan melipatgandakan kebajikannya itu dan memberikan pahala yang besar dengan berlipat ganda dari sisi-Nya."
  }
]