[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan berikanlah oleh kalian (wahai laki-laki) kepada wanita-wanita berupa maskawin sebagai pemberian yang harus diserahkan dan kewajiban yang mengikat dari kebaikan diri kalian. Apabila diri mereka rela menyerahkan sebagian dari maskawin itu dan menghadiahkannya kepada kalian, maka ambillah dan pergunakanlah sekehendak kalian, maka itu hukumnya halal lagi baik"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan berilah wanita-wanita (yang kalian nikahi tersebut) sebuah mahar sebagai pemberian yang bersifat wajib. Jika wanita-wanita itu rela memberikan sebagian mahar mereka kepada kalian tanpa paksaan, maka terimalah dengan senang hati."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Hai orang-orang beriman, berilah mahar kepada wanita-wanita yang kalian nikahi sebagai pemberian wajib yang diberikan secara sukarela. Namun jika para wanita itu merelakan mahar itu, maka tidak mengapa kalian mengambilnya kembali sebagai harta yang baik dan halal. Dan janganlah kalian berikan kepada lelaki, perempuan, dan anak-anak yang tidak bisa menjaga harta, harta mereka yang menjadi sumber penghidupan. Namun pakailah harta mereka untuk membeli makanan dan pakaian mereka. Dan berkatalah kepada mereka dengan perkataan yang baik yang menyejukkan hati mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَءَاتُوا۟ النِّسَآءَ صَدُقٰتِهِنَّ (Berikanlah maskawin (mahar) kepada wanita (yang kamu nikahi)) Yakni mahar untuk mereka. نِحْلَةً ۚ( sebagai pemberian) Yakni pemberian dengan suka rela. فَإِن طِبْنَ لَكُمْ عَن شَىْءٍ مِّنْهُ نَفْسًا(Kemudian jika mereka menyerahkan kepada kamu sebagian dari maskawin itu dengan senang hati) Dan yang dijadikan ukuran kerelaan mereka dalam mengembalikan mahar yang telah diberikan adalah kelapangan hati mereka dan bukan sekedar persetujuan berupa kata-kata yang tidak dapat memastikan kelapangan dan kerelaan hati mereka. هَنِيٓـًٔا مَّرِيٓـًٔا (yang sedap lagi baik akibatnya) Ibnu Abbas berkata: apabila pengembalian mahar itu dilakukan tanpa ada unsur mudharat dan penipuan maka harta itu adalah harta yang sedap lagi baik akibatnya sebagaimana yang telah Allah firmankan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jikalau suami yang mengambil dan merampas harta dari istrinya dengan paksa, tanpa kerelaan darinya, membaca dan mentadabburi ayat ini, niscaya ia akan tahu bahwa apa yang ia makan dan ambil seakan-akan adalah makanan ahli neraka, menyumbat kerongkongannya, juga menyebabkan malapetaka serta musibah baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dan berilah wanita-wanita itu mahar mereka dari sesuatu yang baik bagi diri mereka, tanpa sedikitpun kalian dan wali mereka mengambil mahar tersebut. Jika jiwa mereka rela untuk melepas mahar itu, maka ambilla secara halal dan baik. Ayat ini turun untuk laki-laki yang mana ketika menikahkan anak perempuannya, dia mengambil maharnya tanpa seijin anaknya tersebut. Lalu Allah melarang mereka melakukan hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Berikanlah} berikanlah {kepada wanita (yang kalian nikahi) mahar mereka} mahar mereka {sebagai pemberian} pemberian yang wajib {Jika mereka menyerahkan kepada kalian sebagian dari itu dengan senang hati} jika mereka dengan senang hati memberikan sebagian mahar itu kepada kalian tanpa paksaan {maka terimalah pemberian itu dengan senang hati} dengan senang hati tanpa merisaukannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Dan karena banyak orang-orang (laki-laki) menzhalimi para wanita dan menindas hak-hak mereka, khususnya mahar yang berjumlah banyak yang diberikan dalam satu pemberian saja hingga memberatkan suami untuk menyerahkannya kepada istri, maka Allah memerintahkan dan menganjurkan kepada para suami untuk memberikan kepada istri-istri, ”maskawin kepada wanita(yang kamu nikahi),” yaitu mahar-mahar mereka, ”sebagai pemberian dengan penuh kerelaan,” maksudnya, dari kelapangan dada dan ketenangan jiwa. Janganlah kalian menzhalimi mereka dan berlaku curang sedikitpun pada mahar tersebut. Ayat ini menunjukan bahwa mahar itu diberikan kepada istri apabila ia telah menjadi wanita yang mukallaf dan bahwa mahar tersebut telah menjadi hak miliknya dengan adanya akad nikah, karena suami telah memberikannya kepada istrinya, dan pemberian itu menunjukan kepemilikan. “kemudian jika mereka menyerahkan kepada kamu sebagian dari maskawin itu,” yaitu dari mahar tersebut, \"dengan senang hati“ maksudnya dengan memberikan untuk kalian atas dasar kerelaan dan pilihan sendiri untuk menggugurkan sedikit darinya atau menunda membayar atau menggantinya, ”maka makanlah (ambillah) pemberian itu (sebagai makanan)yang sedap lagi baik akibatnya,” artiya tidak ada dosa atas kalian dalam hal itu dan tidakpula tanggung jawab. Ayat ini adalah dalil yang menunujukan bahwa seorang istri boleh membelanjakan hartanya sendiri hingga untuk sumbangan sekalipun, apabila ia telah dewasa. Namun bila ia belum dewasa, maka pemberiannya itu tidaklah memiliki hokum apa-apa, dan wali wanita tersebut juga tidak memiliki hak apa-apa dari mahar tersebut kecuali apa yang diberikan secara sukarela oleh wanita tersebut. Dan ayat, ”Maka kawinilah wanita-wanita (lain) yang kamu senangi.” adalah dalil yang menunjukan bahwa menikahi wanita-wanita yang buruk, tidaklah dianjurkan bahkan dilarang seperti wanita musyrik, atau wanita pezina;sebagaimana firman Allah ta'ala. ”Dan janganlah kamu menikahi wanita-wanita musrik, sebelum mereka beriman.” Dan firmanNya, ”Dan perempuan yang berzina tidak dikawini oleh laki-laki yang berzina atau laki-laki musyrik. ”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : ﺻﺪﻗﺎﺗﻬﻦ ﻧﺤﻠﺔ Shoduqotihinna nihlah: Shoduqot jamak dari Shudqoh artinya mahar. Nihlah artinya kewajiban. ﻫﻨﻴﺌﺎ Hanian: al Hani’ artinya apa yang dinikmati saat makan. ﻣﺮﻳﺌﺎ Mariia’: al Mari’ artinya sesuatu yang baik bersamaan tanpa akibat yang buruk setelahnya. Makna ayat : Makna ayat yang ke empat dan yang terakhir adalah Allah menitahkan sebuah keharusan kepada para laki-laki agar memberikan kepada kaum wanita mahar. Seorang suami ataupun yang selainnya tidaklah boleh mengambil sesuatupun dari seorang istri kecuali dengan adanya kerelaan. Jikalau sang istri rela, tidaklah mengapa untuk memakan mahar dari istri tersebut. Allah berfirman, {ﻓﺈﻥ ﻃﺒﻦ ﻟﻜﻢ ﻋﻦ ﺷﻲء ﻣﻨﻪ ﻧﻔﺴﺎ ﻓﻜﻠﻮﻩ ﻫﻨﻴﺌﺎ ﻣﺮﻳﺌﺎ} ”Jikalau mereka (para istri) itu berbaik hati untuk kalian dari maharnya, maka nikmatlah dengan senang hati” Pelajaran dari ayat : • Wajibnya seorang suami memberikan mahar dan tidaklah boleh menikmati mahar seorang istri kecuali dengan adanya izin darinya baik yang mengambil maharnya itu adalah suami sendiri (dan ini adalah maksud dari ayat ini) ataupun ayah sang wanita serta kerabatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 4: Dan berikanlah kepada perempuan-perempuan itu maskawin- maskawin mereka sebagai satu pemberian yang wajib. Tetapi jika mereka berikan kepada kamu sebagian daripadanya, dengan ridha hati mereka, bolehlah kamu makan dia dengan senang sentosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena biasanya kaum lelaki menzalimi wanita dalam hal mahar, mereka mengurangi maharnya, terlebih jika nilainya besar dan langsung diberikan, hatinya merasa berat memberikannya, maka di ayat ini Allah Subhaanahu wa Ta'aala memerintahkan untuk memberikan mahar mereka, jangan sengaja menundanya atau menguranginya. Dalam ayat ini terdapat dalil bahwa mahar diberikan kepada wanita apabila mukallaf (sudah dewasa), dan bahwa si wanita yang memilikinya. Demikian juga bahwa wali tidak berhak apa-apa terhadap maskawin itu selain pemberian yang direlakannya. Pemberian itu ialah maskawin yang besar kecilnya ditetapkan menurut persetujuan kedua pihak, karena pemberian itu harus dilakukan dengan ikhlas. Yakni wanita. Dalam ayat ini terdapat dalil bahwa si wanita berhak bertindak terhadap hartanya jika ia cerdas. Yakni dengan keridaan dan menjadi pilihannya menggugurkan sebagiannya atau menundanya atau bahkan menggantinya. Kata-kata ini \"Maka terimalah dan nikmatilah pemberian itu dengan senang hati\" untuk menghiangkan rasa tidak enak dalam hati ketika menerima pemberian tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 4",
    "description": "Dan apabila telah mantap dalam menetapkan pilihan dan siap untuk menikah dengan wanita pujaan kamu, maka berikanlah maskawin yakni mahar kepada perempuan yang kamu nikahi sebagai pemberian yang penuh kerelaan, karena mahar merupakan hak istri dan kewajiban yang harus dipenuhi oleh suami terhadapnya. Suami tidak boleh berbuat semenamena terhadapnya atas dasar pemberian tersebut. Kemudian, jika mereka, para istri menyerahkan kepada kamu sebagian dari maskawin itu dengan senang hati sebagai hadiah untuk kalian, maka terimalah hadiah itu dan nikmatilah pemberian itu dengan senang hati. Dengan demikian, pemberian itu halal dan baik untuk kaliansetelah penjelasan tentang hak-hak anak yatim yang harus dipenuhi, ayat ini menjelaskan larangan menyerahkan harta mereka bila mereka belum mampu mengurus. Dan janganlah kalian serahkan kepada orang yang belum sempurna akalnya, yaitu anak yatim atau orang dewasa yang belum mampu mengurus, harta mereka yang ada dalam kekuasaan kalian yang dijadikan Allah sebagai pokok kehidupan, penyangga hidup, penopang urusan, dan penunjang berbagai keinginan dalam kehidupan ini. Sebab, dalam kondisi seperti itu mereka akan menghabiskan harta tersebut secara sia-sia. Karena itu, berilah mereka belanja secukupnya dan pakaian selayaknya yang bisa menutupi aurat dan memperindah penampilan, dari hasil harta yang kalian usahakan itu. Bersikaplah lemah lembut dan ucapkanlah kepada mereka perkataan yang baik sehingga membuat perasaan mereka nyaman dan tenteram."
  }
]