[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah tidak mengurangi seseorang dari balasan amal perbuatan sebesar dzarrah pun. Meskipun seberat dzarrah suatu kebaikan,maka sesungguhnya Allah akan menambah dan memperbanyak bagi pemiliknya. Dan DIA memberikan anugerah kepadanya berupa tambahan, lalu DIA memberikan kepadanya pahala besar dari sisiNYA,yaitu surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Sesungguhnya Allah Mahaadil. Dia tidak akan menzalimi hamba-hamba-Nya sedikit-pun. Dia tidak akan mengurangi kebajikan mereka walau sekecil semut, dan tidak akan menambah keburukan mereka sedikit pun. Apabila kebajikannya sebesar partikel terkeci;, maka Dia akan melipat gandakan ganjarannya berkat kemurahan-Nya. Dan di samping ganjaran yang berlipat ganda itu Dia akan memberikan pahala yang sangat besar dari sisi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. setelah Allah menyebutkan bahwa mereka mendapat siksaan akibat kekafiran mereka, maka Allah mengingatkan bahwa yang Dia lakukan terhadap mereka adalah keadilan, dan Dia Maha Suci dari Kezaliman sekecil apapun. Dia tidak mengurangi seseorang dan tidak pula siksaan dari apa yang telah ditentukan, meski hanya seukuran semut kecil yang hampir tidak terlihat. Namun apabila seseorang memiliki kebaikan sebesar semut kecil maka Allah akan melipatgandakan pahalanya dan memberi balasan yang lebih besar dari apa yang telah dijanjikan. Dan jika Allah menyebutkan sesuatu itu besar, maka siapakah yang dapat mengetahui ukuran yang sebenarnya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِنَّ اللهَ لَا يَظْلِمُ مِثْقَالَ ذَرَّةٍ ۖ (Sesungguhnya Allah tidak menganiaya seseorang walaupun sebesar zarrah) Kata (الذرة) adalah bentuk tunggal dari kata (الذر), dan ia adalah semut kecil. Menurut pendapat lain ia adalah bagian dari sebutir debu. Dan maksud dari ayat ini adalah Allah tidak mengurangi sedikitpun pahala seseorang dantidak pula menambah siksaan atas dosa seseorang walau sebesar zarrah, apalagi lebih besar dari itu. وَإِن تَكُ حَسَنَةً يُضٰعِفْهَا(dan jika ada kebajikan sebesar zarrah, niscaya Allah akan melipat gandakannya) Yakni dengan berlipat-lipat. Adapun keburukan maka balasannya tidak dilipat gandakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Sesungguhnya Allah tidak menzalimi siapapun, tidak mengurangi pahala amal mereka, dan tidak pula menambahkan hukuman mereka sezarrah pun (yaitu satu bagian dari debu-debu yang bertebaran di udara). Jika takaran sezarrah ini berupa kebaikan, maka Dia akan melipat gandakannya, namun tidak melipat gandakan keburukan, dan dari keutamaanNya, Dia memberikan pahala tanpa batas atas amal shalih mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah tidak akan menzalimi walaupun sebesar zarah} sebesar semut kecil {Jika itu} jika perbuatan kalian itu {berupa kebaikan, niscaya Allah akan melipatgandakannya dan memberikan} memberikan {dari sisiNya} sisiNya { pahala} pahala {yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Allah mengabarkan tentang kesempurnaan keadilaNya, keutamaaNya dan berlepas diriNya dari perkara yang berlawanan dengan hal-hal tersebut seperti kezhaliman, baik sedikit maupun banyak, seraya berfirman, “Sesungguhnya Allah tidak menganiaya walaupun sebesar dzarrah” yaitu Allah mengurangi kebaikan-kebaikan hamba-hambaNya atau menambah keburukan-keburukanya,sebagaiman Allah juga berfirman, \"Barangsiapa yang mengerjakan kebaikan seberat dzarrahpun, niscaya dia akan melihat (balasan)nya, barangsiapa yang mengerjakan kejahatan sebesar dzarrahpun, niscaya dia akan melihat (balasan)nya pula.\" -Az-Zalzalah:7-8-. “Dan jika kebaikan sebesar dzarrah, niscaya Allah akan melipatgandakanya” yaitu hingga sepuluh kali lipat dan bahkan lebih banyak dari itu, yang sesuai dengan kondisi dan kebajikan tersebut, serta kondisi pelakunya dari segi keihklasan, rasa cinta, dan kesempurnaan. “Dan memberikan dari sisiNya pahala yang besar” yaitu sebagai pahala tambahan atas perbuatan itu sendiri berupa taufik dari amalan-amalan baik lainya dan memberikan kebaikan yang melimpah serta keberkahan yang banyak."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: الظلم azh zhulm : Kezaliman adalah menempatkan sesuatu tidak pada tempatnya. {مِثْقَالَ ذَرَّةٍ} mistqola dzarroh: mistqol adalah takaran yang berdasarkan berat. Dzarroh adalah bentuk terkecil dari suatu benda. Maksudnya adalah tampias (aerosol) atau kepala semut. الحسنة Alhasanah: Kebaikan adalah perbuatan terpuji yang makruf. {يُضَاعِفْهَا} Yudhoo’ifhaa: ingin dilipatgandakan. {مِنْ لَدُنْهُ} Minladunhu: dari sisi-Nya. {أَجْراً عَظِيماً} Ajron ‘azhima: pahala yang besar serta ganjaran yang agung. Makna Ayat: Ketika Allah memerintahkan kepada para hamba untuk beribadah kepadaNya dan berbuat baik kepada sesamanya yang telah disebutkan pada ayat-ayat sebelumnya, Allah memerintahkan untuk berinfak di jalan-Nya. Kemudian Allah mengkritisi sifat kikir, sombong, angkuh dan menyembunyikan kebenaran. Konsekuensi semua sifat-sifat ini (yang buruk maupun baik) telah disebutkan di ayat ini (40) {إِنَّ اللهَ لا يَظْلِمُ مِثْقَالَ ذَرَّةٍ وَإِنْ تَكُ حَسَنَةً يُضَاعِفْهَا وَيُؤْتِ مِنْ لَدُنْهُ أَجْراً عَظِيماً} “Sesungguhnya Allah tidaklah menzalimi sebesar biji sawi apapun itu. Jikalau itu berupa kebaikan, Allah akan melipat gandakan dan memberikan balasan yang agung dari sisi-Nya.” Allah menyebutkan keadilan dan rahmatNya dalam memberikan balasan, Maka ketika hari perhitungan Dia tidak berlaku zalim kepada hambaNya sebesar dzarroh pun, dzarroh adalah bagian terkecil dari sesuatu. Dan artinya Allah tidak akan mengurangi satu bagian dari kebaikan yang telah dilakukan dan tidak menambahkan keburukan di dalam hitungan amal buruk yang telah dilakukan. Dan jika ditemukan satu buah kebaikan dari seorang mukmin akan dilipatgandakan berlipat-lipat dari apa yang telah dia amalkan, Allah memberikannya tanpa menukar dengan pahala lain serta tidaklah mengurangi takarannya. Segala puji dan anugrah hanya milik Allah. Ini adalah apa yang terkandung dari ayat yang pertama (40) Pelajaran dari ayat : • Penjelasan tentang keadilan, kasih-sayang dan keutamaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 40: Sesungguhnya Allah tidak menganiaya (walaupun) setimbang hama; tetapi jika adalah (amal-amal) itu baik, Ia akan gandakan dia dan akan memberi, dari pihak-Nya, ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala memberitakan tentang sempurnanya keadilan Allah dan karunia-Nya dan bersihnya Allah dari kezaliman baik besar maupun kecil Zarrah artinya semut yang paling kecil. Oleh karena itu, Dia tidak mengurangi kebaikan seseorang atau menambah keburukan seseorang. Maksudnya Allah tidak akan mengurangi pahala orang-orang yang mengerjakan kebajikan walaupun sebesar zarrah, bahkan kalau dia berbuat baik, maka pahalanya akan dilipatgandakan oleh Allah menjadi sepuluh sampai tujuh ratus, bahkan lebih dari itu serta akan diberikan pahala yang besar yang tidak dapat diperkirakan oleh seseorang sesuai keadaannya, manfaatnya, keadaan pelakunya dan keikhlasannya.. Yakni dengan menambah pahala melebihi amal yang dilakukan seseorang, diberikan taufik untuk mengerjakan kebaikan dan memberikan kebaikan yang banyak. Termasuk di antaranya adalah memasukkannya ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 40",
    "description": "Ayat yang lalu ditutup dengan sebuah pernyataan bahwa Allah maha mengetahui segala sesuatu tentang keadaan orang-orang sombong dan membanggakan diri itu. Untuk mengikis kesan Allah menimpakan siksa yang melebihi batas kedurhakaan orang-orang yang sombong dan membanggakan diri itu, ayat ini memberi penegasan bahwa Allah tidak akan berlaku aniaya. Sungguh, ketahuilah bahwa Allah tidak akan menzalimi ketika menjatuhkan sanksi kepada seseorang, walaupun sebesar dzarrah yakni sesuatu yang terkecil dan teringan, dan demikian pula jika ada kebajikan, walaupun kebajikan itu hanya sekecil dzarrah, niscaya Allah akan melipatgandakan kebajikannya itu dan memberikan pahala yang besar dengan berlipat ganda dari sisi-Nya. Setelah menggambarkan perilaku orang-orang yang sombong dan membanggakan diri yang dikategorikan sebagai orang-orang kafir itu, ayat berikut menghadapkan kenyataan itu terhadap orang beriman untuk ditarik pelajaran. Maka jadikanlah bahan renungan tentang bagaimanakah kelak keadaan orang kafir itu, jika kami pada hari itu mendatangkan seorang saksi, yakni rasul, dari setiap umat, dan kami mendatangkan engkau, wahai Muhammad, sebagai saksi atas mereka, orangorang sombong dan membanggakan diri itu."
  }
]