[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bagaimana keadaaan manusia pada hari kiamat, apabila Allah mendatangkan setiap umat manusia bersama rasul mereka untuk bersaksi kepada mereka atas apa yang mereka perbuat, dan DIA mendatangkan dirimu (wahai rasul),sebagai saksi atas umatmu bahwa engkau telah menyampaikan kepada mereka risalah tuhanmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Bagaimana kondisinya kelak di hari Kiamat ketika Kami mendatangkan nabi tiap-tiap umat sebagai saksi atas amal perbuatan mereka, dan Kami mendatangkanmu -wahai Rasul- sebagai saksi atas umatmu?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Setelah Allah menyebutkan sifat adil dan kemurahan karunia-Nya, kemudian Allah melanjutkan bahwa hal tersebut berlaku dengan kesaksian para rasul yang telah Allah jadikan sebagai hujjah seluruh makhluk. Allah berfirman: apa yang akan terjadi jika kami pada hari kiamat mendatangkan bagi seluruh umat seorang saksi atas mereka untuk bersaksi atas kerusakan akidah dan keburukan amal mereka? dan kami akan mendatangkanmu sebagai saksi atas umatmu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. فَكَيْفَ إِذَا جِئْنَا مِن كُلِّ أُمَّةٍۭ بِشَهِيدٍ (Maka bagaimanakah (halnya orang kafir nanti), apabila Kami mendatangkan seseorang saksi dari tiap-tiap umat) Yakni orang yang menyeru umat-umat tersebut kepada Allah dan mengingatkan mereka dengan perjanjian-Nya akan menjadi saksi di hari kiamat atas seruan dan peringatan mereka. وَجِئْنَا بِكَ عَلَىٰ هٰٓؤُلَآءِ شَهِيدًا (dan Kami mendatangkan kamu (Muhammad) sebagai saksi atas mereka itu) Yakni kamu akan menjadi saksi atas orang-orang yang kafir dari kaummu dan atas orang-orang yang telah kamu seru."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Bagaimanakah keadaan orang-orang kafir itu, jika Kami mendatangkan seorang saksi dari masing-masing umat pada hari kiamat yang bersaksi untuk kaumnya tentang apa yang dia dapatkan ketika mereka menerima risalah dari rasul mereka. Apakah mereka akan beriman atau tetap ingkar. Dan saksi itu adalah nabi mereka sendiri. Kemudian Kami mendatangkanmu sebagai saksi atas umatmu, wahai rasul?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimanakah} urusan pada hari Kiamat {jika Kami mendatangkan dari setiap umat seorang saksi} nabi {dan Kami mendatangkanmu sebagai saksi atas mereka} sebagai saksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Kemudian Alah berfirman, “maka bagaimankah halnya orang kafir nanti apabila kami mendatangkan seorang saksi rasul dari tiap-tiap umat dan kami mendatangkan dari kaum Muhammad sebagai saksi atas mereka itu sebagai umatmu” makudnya, bagaimanakah kondisi kala itu? Dan sebagaimana terjadinya hukum yang agung tersebut menyatukan antar dzat yang menyatukan itu adalah dzat yang memiliki kesempurnaan ilmu, keadilan yang tidak bercacat dan kebijaksanaan yang agung dengan kesaksian makhluk yang paling suci yaitu para Rasul atas umat mereka bersamaan dengan pengakuan secara sadar dengan mereka yang menjadi terdakwa? Yang dmikian itu demi Allah, adalah hukum yang paling umum dan menyeluruh, yang paling adil dan paling agung, kemudian tinggalkanlah mereka pihak yang berhukum atau terdakwa mengakui akan kesempurnaan karunia, keadilan pujian dan sunjunganya, keberhasilan, kemuliaan dan kesuksesan, dan ada golongan yang sengsara dengan kehinaan, keterpurukan, dan siksa yang menghinakan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : الشهيد Asy Syahiid: menyaksikan sesuatu dengan ilmunya. Makna ayat : Kandungan ayat yang ke dua (41), ketika Allah menyebutkan balasan dan perhitungan yang ditunjukkan oleh konteks ayat ini berupa gonjang-ganjing dan ngerinya hari perhitungan amal. Allah mengajak bicara Rosul-Nya sembari berkata, {فَكَيْف إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلاءِ شَهِيداً} “Maka jikalau kita datangkan saksi dari setiap umat, kami datangkan dirimu sebagai saksi atas mereka”, maksud ayat ini adalah bagaimana jadinya keadaan pelaku kekafiran, keburukan dan kerusakan jika didatangkan kepada mereka saksi dari setiap umat untuk mempersaksikan terhadap Rosul dan kaum kafir tentang apa yang telah ditaati dan dimaksiati oleh umatnya sebagai bentuk perhitungan hisab yang sempurna dengan mendata bukti-bukti, para saksi dan ganjaran sesuai dengan kekafrian, keimanan , maksiat dan ketaatan masing-masing. Dan Kamipun mendatangkanmu, wahai Nabi Muhammad sebagai saksi terhadap mereka. Yaitu umat Nabi Muhammad yang beriman dan juga yang kafir. Hal ini sebagai bentuk kesaksian mereka bahwasanya Nabi telah menyampaikan risalahnya dan menunaikan amanatnya. Inilah yang terangkum dalam ayat yang kedua (41). Pelajaran dari ayat : • Penjelasan gonjang-ganjing hari kiamat sampai-sampai orang-orang kafir ingin diratakan dengan bumi dan mejadi debu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 41: Lantaran itu bagaimanakah (hebat keadaan nanti) apabila Kamı bawakan seorang penyaksi dari tiap-tiap ummat dan Kami bawakanmu sebagai penyaksi atas mereka itu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mahkamah tersebut merupakan mahkamah yang paling adil, yang memberikan keputusan adalah Zat yang Maha sempurna ilmu, keadilan dan kebijaksanaan, dan yang menjadi saksi adalah manusia yang paling bersih, yaitu para rasul terhadap umat mereka, belum lagi ditambah dengan pengakuan dari orang yang diberikan keputusan. Pada hari itu, sebagian orang berbahagia memperoleh keberuntungan, kemenangan, kemuliaan dan keberhasilan, dan pada hari itu sebagian lagi mendapatkan kesengsaraan, keninaan, terbukanya aib dan memperoleh azab yang menghinakan. Seorang Nabi akan menjadi saksi atas perbuatan umatnya, yakni apakah perbuatan mereka mengikuti perintah Allah atau tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 41",
    "description": "Setelah menggambarkan perilaku orang-orang yang sombong dan membanggakan diri yang dikategorikan sebagai orang-orang kafir itu, ayat berikut menghadapkan kenyataan itu terhadap orang beriman untuk ditarik pelajaran. Maka jadikanlah bahan renungan tentang bagaimanakah kelak keadaan orang kafir itu, jika kami pada hari itu mendatangkan seorang saksi, yakni rasul, dari setiap umat, dan kami mendatangkan engkau, wahai Muhammad, sebagai saksi atas mereka, orangorang sombong dan membanggakan diri itu. Karena pada hari ketika mereka dibangkitkan itu, orang yang kafir yang sombong dan membanggakan diri dan orang yang mendurhakai rasul, nabi Muhammad, berharap sekiranya mereka diratakan dengan tanah, hancur luluh menjadi tanah sehingga tidak ada yang tersisa sedikit pun dari jasmani mereka, dengan demikian mereka merasa tidak diadili lagi, padahal mereka tidak dapat menyembunyikan sesuatu kejadian apa pun dari Allah dari apa yang mereka perbuat. Sungguh hal ini menjadi pelajaran bagi orang-orang beriman"
  }
]