[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari peristiwa itu terjadi, akan berangan-angan orang-orang yang kafir kepada Allah dan menentang rasul dan tidak menaatinya,seandainya Allah menjadikan diri mereka dan permukaan tanah sama, lalu mereka berubah menjadi tanah,sehingga tidak akan di bangkitkan dan mereka tidak mampu menyembunyikan apapun dari Allah terkait apa-apa yang ada dalam diri mereka, karena Allah mengunci mulut-mulut mereka,dan anggota-anggota tubuh mereka bersaksi atas perbuatan yang dahulu mereka kerjakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Pada hari yang agung itu, orang-orang yang ingkar kepada Allah dan durhaka kepada para rasul-Nya berangan-angan sekiranya mereka berubah menjadi debu sehingga status mereka sama dengan tanah. Dan mereka tidak dapat menyembunyikan dari Allah sesuatu pun dari apa yang telah mereka perbuat. Karena Allah akan mengunci mati mulut mereka sehingga tidak bisa berbicara dan Dia akan mengizinkan anggota-anggota tubuhnya untuk memberi kesaksian atas amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Pada hari itu orang-orang yang yang kafir kepada Allah dan rasul-Nya dan bermaksiat kepada Rasul ketika melihat balasan yang didapatkan oleh umat-umat terdahulu dan balasan akibat mendustakan para rasul, Mereka akan berharap andai saja mereka hanyalah tanah yang diratakan di bumi. Mereka tidak dapat menyembunyikan rahasia dari Allah atau berdusta di depan-Nya dengan mengingkari kesyirikan dan kesesatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. لَوْ تُسَوَّىٰ بِهِمُ الْأَرْضُ (supaya mereka disamaratakan dengan tanah) Yakni mereka berangan-angan agar tanah di bumi itu terbuka kemudian mereka masuk didalamnya, lalu lubang tersebut kembali ditutup dengan tanah sebagaimana sedia kala agar mereka tidak dihadirkan dalam hari pembalasan. وَلَا يَكْتُمُونَ اللهَ حَدِيثًا (dan mereka tidak dapat menyembunyikan (dari Allah) sesuatu kejadianpun) Akan tetapi semua rahasia mereka ditampakkan kepada-Nya, dan percakapan diantara mereka diketahui dengan pasti oleh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Pada hari kiamat orang-orang kafir berharap agar Allah menyamaratakan mereka dengan bumi sehingga mereka menjadi tanah atau mereka dijatuhkan dalam bumi lalu dikubur dengan tanah, yaitu mereka berharap menjadi tanah. Dan mereka itu tidak mungkin bisa menyembunyikan sedikitpun amal mereka dari Allah SWT. Sehingga rahasia-rahasia, dan seluruh peristiwa yang mereka alami itu diketahui olehNya, dan seluruh anggota badan mereka bersaksi atas mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu} hari kiamat {orang-orang yang kafir dan mendurhakai Rasul berharap seandainya mereka diratakan dengan tanah} jika mereka dan tanah menjadi satu bagian {padahal mereka tidak dapat menyembunyikan suatu kejadian pun dari Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Oleh karena itulah Allah berfirman, “Di hari itu orang-orang kafir dan orang-orang yang mendurhakai rasul ingin” yaitu mereka menyatukan antara kufur kepada Allah dan kepada RasulNya dengan durhaka kepada Rasul, “supaya mereka disamaratakan dengan tanah,” maksudnya, tanah itu menelan mereka hingga mereka menjadi tanah dan menghilang, sebagaimana Allah berfirman, \"“Alangkah baiknya sekiranya aku dahulu adalah tanah”. -An-Naba:40- “Dan mereka tidak dapat menyembunyikan (dari Allah) suatu kejadian pun,” maksudnya adalah, bahkan mereka akan mengakui apa yang telah mereka kerjakan dan semua lisan-lisan mereka, tangan-tangan mereka, dan kaki-kaki mereka akan bersaksi terhadap apa yang telah mereka lakukan. Pada hari itu Allah akan memberi mereka balasan yang setimpal menurut semestinya, hingga mereka mengetahui bahwa Allah-lah Dzat yang Benar lagi yang menjelaskan (segala sesuatu menurut hakikat yang sebenarnya). Adapun riwayat yang menyatakan bahwasanya kaum kafir menyembunyikan kekufuran dan pengingkaran mereka, sesungguhnya hal tersebut terjadi pada beberapa kondisi pada Hari KIamat, yaitu ketika mereka mengira bahwa pengingkaran mereka akan berguna bagi mereka (sehingga terbebas) dari siksa Allah, namun bila mereka mengetahui kenyataan dan seluruh anggota badan mereka akan bersaksi atas (semua perbuatan mereka), maka saat itulah segala perkara akan jelas, hingga tindakan menyembunyikan itu tidak memiliki manfaat atau faidah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {يَوَدُّ} Yawaddu: suka. {تُسَوَّى بِهِمُ الأَرْضُ} Tusawwaa bihimul ardh: menjadi debu sejajar dengan bumi. {وَلا يَكْتُمُونَ اللهَ حَدِيثاً} Walaa yaktumuunalloha haditsa: tidak tersembunyi perkataan dari mereka. Makna ayat : Adapun ayat yang ketiga (42), maka Allah ketika menyebutkan keguncangan di hari kiamat pada ayat (41), menyebutkan pula huru-haranya, dimana orang-orang kafir yang menyukai dan durhaka kepada Rosul, jika mereka dipendam dalam tanah dan menjadi debu sampai mereka mengira tidak akan dihisab dan dibalas dengan api neraka. Dan para kafir ini pada hari itu tidak dapat menyembunyikan suatu pernyataanpun karena seluruh anggota badannya menjadi saksi dengan apa yang telah mereka lakukan dahulu. Allah berfirman {يَوْمَئِذٍ} “hari itu”, maksudnya adalah hari saat didatangkan saksi dari setiap umat. {يَوَدُّ الَّذِينَ كَفَرُوا وَعَصَوُا الرَّسُولَ لَوْ تُسَوَّى بِهِمُ الأَرْضُ} “Orang-orang kafir dan orang orang yang melakukan maksiat berharap jikalau diri mereka diratakan dengan tanah” dan menjadi debu semisal bumi. Maksud mereka agar diratakan dengan tanah adalah menjadi debu. {وَلا يَكْتُمُونَ اللهَ حَدِيثاً} “dan mereka tidak menyembunyikan satu perkataanpun”, bentuk pemberitaan bahwasanya mereka tidak sanggup untuk menyembunyikan suatu apapun dari Allah. Karena saat itu anggota tubuhnya menjadi saksi setelah mulut mereka terkunci. Seperti firman Allah di surat Yasin {الْيَوْمَ نَخْتِمُ عَلَى أَفْوَاهِهِمْ وَتُكَلِّمُنَا أَيْدِيهِمْ وَتَشْهَدُ أَرْجُلُهُمْ بِمَا كَانُوا يَكْسِبُونَ} “pada hari kami mengunci mulut mereka dari berbicara, kaki dan Pelajaran dari ayat : • Pengetahuan Rosul tentang hari persaksian terhadap hambanya pada hari kiamat, seperti yang dikabarkan oleh Abdullah bin Mas’ud, bahwasanya Rosululloh berkata pada suatu hari beliau bersabda, ‘Bacalah untukku Al Quran!’, maka aku benjawab ‘Aku membacanya untukmu sementara Al Quran itu turun kepadamu’. Rosul berkata, ‘Aku suka mendengarnya dari orang lain.’ Maka Ibnu Mas’ud berkata, ‘Aku membaca {يَا أَيُّهَا النَّاسُ اتَّقُوا رَبَّكُمُ}, sampai dengan ayat {فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ} ‘maka bagimana jika kami datangkan seorang saksi dari setiap umat’. Maka tiba-tiba kedua mata Nabi menitikkan air mata, dan dia berkata ‘Cukup.’, yaitu Berhenti dari membaca Quran untukku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 42: Pada hari itu mereka yang kufur dan durhaka kepada Rasul, suka kalau mereka disamakan dengan bumi, karena tak dapat mereka menyernbunyikan dari pada Allah satupun perkataan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya mereka terkubur oleh tanah dan menjadi tidak ada. Bahkan mereka mengiqrarkan apa yang mereka kerjakan; lisan, tangan dan kaki mereka bersaksi. Adapun dalil-dalil yang menerangkan bahwa orang-orang kafir menyembunyikan kekafiran mereka dan mereka menyangkal (mengaku tidak kafir), maka hal itu terjadi di beberapa tempat di hari kiamat, yaitu ketika mereka menyangka bahwa penyangkalan mereka dapat menyelamatkan mereka dari azab Allah. Ketika mereka mengetahui hakikat yang sebenarnya, anggota badan mereka menjadi saksi, maka ketika itu masalah pun menjadi jelas, dan tidak ada lagi tempat untuk menyembunyikan sesuatu, bahkan tidak ada manfaat dan faedahnya menyembunyikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 42",
    "description": "Karena pada hari ketika mereka dibangkitkan itu, orang yang kafir yang sombong dan membanggakan diri dan orang yang mendurhakai rasul, nabi Muhammad, berharap sekiranya mereka diratakan dengan tanah, hancur luluh menjadi tanah sehingga tidak ada yang tersisa sedikit pun dari jasmani mereka, dengan demikian mereka merasa tidak diadili lagi, padahal mereka tidak dapat menyembunyikan sesuatu kejadian apa pun dari Allah dari apa yang mereka perbuat. Sungguh hal ini menjadi pelajaran bagi orang-orang beriman pada beberapa ayat yang lalu, Al-Qur'an menggambarkan perilaku orang-orang yang sombong dan membanggakan diri serta betapa dahsyat siksa yang akan dijumpai mereka pada hari berbangkit, sampaisampai mereka menginginkan agar disamaratakan saja dengan tanah, sehingga tidak mengalami perhitungan amal sama sekali. Namun hal itu tidak akan terjadi, karena tidak ada seorang pun yang dapat sembunyi dari pengawasan Allah. Oleh sebab itu, ayat ini dan ayat berikutnya menjelaskan bagaimana seharusnya manusia hidup di dunia agar selamat dari siksaan di hari berbangkit tersebut. Caranya ialah dengan melaksanakan salat dan bagaimana salat itu ditunaikan agar bisa menyelamatkan diri dari siksa di hari berbangkit tersebut. Wahai orang yang beriman kepada Allah dan rasul-Nya, janganlah kamu mendekati tempat salat atau melaksanakan salat ketika kamu dalam keadaan mabuk, yakni hilang ingatan karena minuman keras. Dirikanlah salat jika kamu sudah sadar apa yang kamu ucapkan, dan juga jangan pula kamu hampiri masjid ketika kamu dalam keadaan junub yang mengharuskan kamu mandi wajib, kecuali hanya sekadar melewati jalan saja, boleh kamu lakukan sebelum kamu mandi junub. Adapun jika kamu sakit yang dikhawatirkan bila menyentuh air penyakit itu akan bertambah parah atau susah disembuhkan, atau kamu sedang dalam perjalanan yang jaraknya jauh, sekitar 80 km atau lebih, atau sehabis buang air, apakah itu buang air kecil atau buang air besar, atau kamu telah menyentuh perempuan, apakah itu hanya sekadar bersentuh kulit atau berhubungan suami istri, sedangkan kamu pada waktu itu tidak mendapat air, maka bertayamumlah kamu, sedengan cara usaplah wajahmu satu kali dan usap pula tanganmu, dengan mempergunakan debu atau tanah itu. Sungguh, Allah itu maha pemaaf, maha pengampun bagi hamba-hamba-Nya yang mau bertobatbagai pengganti wudu, dengan debu, atau tanah dan sejenisnya, yang baik, yakni suci,"
  }
]