[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNYA serta melaksanakan syariatNYA, janganlah kalian mendekati shalat dan jangan beranjak untuk melaksanakannya saat dalam keadaan mabuk sampai kalian bisa membedakan dan menyadari apa yang kalian ucapkan. (Dan larangan ini berlaku sebelum pengharaman yang tegas terhadap khamar (minuman keras) dalam seluruh keadaan). Dan janganlah kalian mendekati shalat ketika menimpa kalian hadast besar (junub) dan jangan pula kalian mendekati tempat-tempat shalat yaitu masjid-masjid, kecuali sesorang dari kalian yang sekedar melintasinya dari pintu kepintu, sampai kalian telah bersuci dengan mandi besar. Dan apabila kalian dalam keadaan sakit,tidak mampu mempergunakan air dalam kondisi itu,atau tengah berada dalam perjalanan jauh atau salah seorang dari kalian datang dari tempat buang hajat atau kalian mencampuri istri-istri kalian,sedang kalian tidak mendapati air untuk bersuci, maka carilah debu yang suci,lalu usaplah muka dan tangan kalian dengannya.Sesungguhnya Allah Maha banyak pemaaf dan Maha pengampun terhadap dosa-dosa kalian serta menutupinya untuk kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya! Janganlah kalian mendirikan salat sementara kalian dalam kondisi mabuk sampai kalian sadar dan bisa membedakan ucapan kalian. Ini sebelum ada larangan mengonsumsi khamar secara mutlak. Dan janganlah kalian mendirikan salat ketika kalian dalam kondisi junub, dan janganlah kalian masuk ke dalam masjid dalam kondisi tersebut kecuali sekedar melintas dan tidak berdiam diri sampai kalian mandi. Apabila kalian menderita sakit yang tidak memungkinkan untuk menggunakan air, atau kalian sedang bepergian, atau kalian berhadas (kecil), atau berhubungan badan dengan istri-istri kalian kemudian kalian tidak menemukan air, maka carilah debu yang suci, kemudian usaplah wajah dan kedua tangan kalian dengan debu tersebut. Sesungguhnya Allah Maha Pemaaf atas keteledoran kalian dan Maha Pengampun bagi kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. setelah Allah memerintahkan untuk beribadah kepadanya dengan penuh rasa ikhlas, maka kemudian Allah memerintahkan menjalankan shalat dengan penuh keikhlasan karena shalat merupakan sebaik-baik ibadah. Oleh sebab itu Allah melarang hamba-hambanya yang beriman untuk melakukan shalat ketika dalam keadaan mabuk sampai dia sadar kembali sehingga mengetahui apa yang akan dia baca dan dia dilakukan dalam shalatnya. karena seorang yang dalam keadaan mabuk tidak akan dapat menghadirkan rasa khusyu’ tidak akan dapat merasakan kehadiran Allah ketika membaca Alquran, dzikir, dan doa dalam shalat. Larangan ini mencakup larangan mendekati tempat-tempat shalat seperti masjid, sehingga orang yang mabuk harus dilarang untuk memasuki masjid. Larangan ini juga mencakup larangan mendekati shalat itu sendiri, sehingga orang yang mabuk dilarang untuk melakukan shalat atau melakukan ibadah yang lain, sebab akalnya tidak dapat memahami dengan baik apa yang diucapkan. hukum ini berlaku sebelum turunnya ayat yang mengharamkan khamr. Dan janganlah kalian mendekati shalat ketika dalam keadaan junub, kecuali hanya sekedar melewati masjid saja, tidak duduk lama di dalamnya. namun jika kalian telah mandi junub maka larangan ini ini tidak berlaku lagi. Karena ibadah shalat merupakan kewajiban yang memiliki waktu tertentu dan merupakan mengingat seseorang kepada Tuhannya, sedangkan mandi junub terkadang pada keadaan tertentu sulit dilakukan, maka Allah memberikan keringanan dalam cara menghilangkan junub, yaitu tidak menggunakan air akan tetapi dengan bertayamum ketika dalam keadaan sakit yang jika terkena air ditakutkan akan menambah parah penyakitnya, atau dalam keadaan sedang bersafar, ketika tidak mendapatkan air saat wajib berwudhu atau mandi junub. Allah memerintahkan untuk mencari tanah yang suci untuk dipakai bertayamum kemudian membasuh wajah dan tangannya dengan tanah tersebut, dengan begitu dia telah diperbolehkan untuk melakukan shalat. Kemudian Allah menutup ayat ini dengan menyatakan bahwa dia Maha Pemaaf dan Maha Pengampun bagi hamba-hambanya yang beriman dengan memudahkan apa yang dia perintahkan kepada mereka. Allah tidak membebani mereka dengan kewajiban mandi atau berwudhu ketika dalam keadaan sakit atau dengan kewajiban menunggu ketersediaan air sehingga tidak perlu mengqadha banyak shalat yang dapat memberatkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. لَا تَقْرَبُوا۟ الصَّلَوٰةَ وَأَنتُمْ سُكٰرَىٰ (janganlah kamu shalat, sedang kamu dalam keadaan mabuk) Yakni janganlah kalian shalat dalm keadaan mabuk. Atau janganlah kalian masuk masjid dalam keadaan tersebut. حَتَّىٰ تَعْلَمُوا۟ مَا تَقُولُونَ (sehingga kamu mengerti apa yang kamu ucapkan) Yakni sampai efek dari mabuk itu telah hilang dari kalian dan kalian telah kembali memahami apa yang kalian ucapkan, kerena orang mabuk tidak dapat memahami apa yang dia katakan. وَلَا جُنُبًا (jangan pula hampiri mesjid) sedang kamu dalam keadaan junub) Yakni orang yang mendapatkan janabah, yakni dari selesai berjima’, atau mengeluarkan mani karena mimpi basah atau yang lain. إِلَّا عَابِرِى سَبِيلٍ (terkecuali sekedar berlalu saja) Yakni kecuali orang yang dalam perjalanan, maka ia diperbolehkan untuk shalat dengan bertayammum. Dan pendapat lain mengatakan yakni janganlah kalian mendekati tempat-tempat shalat (masjid) sedangakan kalian dalam keadaan junub, kecuali orang yang hanya berlalu dari sisi masjid yang satu ke sisi masjid lainnya. Sehingga orang junub boleh berlalu dalam masjid tanpa duduk didalamnya. وَإِن كُنتُم مَّرْضَىٰٓ (Dan jika kamu sakit) Apabila seseorang diantara kalian takut mendapatkan bahaya jika memakai air, atau badannya lemah sehingga tidak bisa berjalan menuju sumber air. أَوْ عَلَىٰ سَفَرٍ(atau sedang dalam musafir) Diperbolehkan bertayammum bagi orang yang memenuhi syarat-syarat safar. Dan tidak disyaratkan safar tersebut merupakan safar yang diperbolehkan mengqasar shalat. Pendapat lain mengatakan orang yang mukim juga diperbolehkan bertayammum apabila tidak mendapatkan air. أَوْ جَآءَ أَحَدٌ مِّنكُم مِّنَ الْغَآئِطِ(atau datang dari tempat buang air) Kalimat ini dipakai untuk mengibaratkan kotoran yang keluar dari insan. أَوْ لٰمَسْتُمُ النِّسَآءَ(atau kamu telah menyentuh perempuan) Yakni dengan mencium atau menyentuh dengan tangan atau lainnya dengan maksud menikmati dan meluapkan syahwat. Dan pendapat lain mengatakan yang dimaksud adalah berjima’. فَلَمْ تَجِدُوا۟ مَآءً(kemudian kamu tidak mendapat air) Air di tempat yang dekat dengan kalian setelah kalian mencarinya, atau pemakaian air membahayakan kalian. فَتَيَمَّمُوا۟ (maka bertayamumlah) Maka maksudkanlah صَعِيدًا (dengan tanah) Makna (الصعيد) adalah permukaan bumi, baik itu terdapat tanah diatasnya maupun tidak karena itu merupakan bagian paling atas dari bumi atau permukaannya. Dan pendapat lain mengatakan yang dimaksud adalah tanah, sehingga tidak diperbolehkan bertayammum dengan batu atau pasir. طَيِّبًا(yang baik) Yakni suci. فَامْسَحُوا۟ بِوُجُوهِكُمْ وَأَيْدِيكُمْ ۗ (sapulah mukamu dan tanganmu) Yakni dengan tanah tersebut. إِنَّ اللهَ كَانَ عَفُوًّا غَفُورًا (Sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun) Yakni Dia memaafkan dan mengampuni kekurangan kalian, dan mengasihi kalian dengan memberikan kalian keringanan (rukhshoh) dan kelapangan sehingga kalian dapat melaksanakan shalat tanpa berwudlu atau mandi besar ketika terdapat uzur/halangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Wahai orang-orang mukmin, janganlah kalian shalat dalam keadaan mabuk sampai kalian mengerti makna bacaan kalian dalam shalat. Ini adalah salah satu tahap pengharaman khamr. Dan janganlah kalian memasuki masjid dalam keadaan junub, yaitu akibat dari jima’ atau keluar mani melalui mimpi atau cara lainnya, kecuali kalian hanya melewatinya dari satu sisi ke sisi yang lain sampai kalian mandi junub, dan jika kalian dalam keadaan sakit yang mana akan berbahaya jika terkena air atau dalam keadaan bepergian dan tidak mendapati air, atau ketika kalian menunaikan hajat, yaitu kencing atau buang air besar (yaitu hadas kecil) atau berjima’ dengan wanita (yaitu hadas besar) dan kalian tidak bisa menggunakan air untuk menghilangkan hadas tersebut, dan akan mendapatkan mudharat jika menggunakannya, atau tidak mendapati ait di tengah perjalanan, maka ambillah tanah atau batu dari permukaan bumi untuk bersuci, lalu basuhlah wajah dan kedua tangan kalian sampai siku dengan tanah itu baik untuk hadas kecil maupun hadas besar. Sesungguhnya Allah itu Maha Pemaaf dengan memberikan kemudahan dan kelapangan bagi kalian, dan Maha Pengampun atas kelalaian dan kesalahan. Permulaan ayat turun untuk para sahabat rasulallah SAW yang meminum khamr lalu menunaikan shalat sedangkan mereka mabuk sehingga mereka tidak mengetahui berapa kali mereka shalat dan bacaan shalat mereka. Dan Allah menurunkan ayat tentang bersuci menggunakan tanah yang bersih kepada rasulullah, yaitu ketika nabi terbangun bersama ‘Aisyah dan orang-orang muslim di salah satu perjalannya, sedangkan mereka tidak mempunyai air, lalu Allah SWT menurunkan ayat Tayamum, lalu mereka bertayamum."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah mendekati shalat, sedangkan kalian dalam keadaan mabuk sampai kalian sadar akan apa yang kalian ucapkan dan jangan pula dalam keadaan junub} janganlah kalian mendekati shalat dan kalian dalam keadaan junub {kecuali sekedar berlalu} janganlah kalian memasuki masjid dalam keadaan junub kecuali hanya melewatinya saja, bagi orang yang junub {sehingga kalian mandi. Jika kalian sakit, sedang dalam perjalanan} musafir {salah seorang di antara kalian kembali dari tempat buang air, atau kalian telah menyentuh} berjima’ dengan {perempuan, sedangkan kalian tidak mendapati air, maka bertayamumlah} maka sederhanakanlah {dengan debu} dengan debu {yang baik} suci {Usaplah wajah dan tangan kalian. Sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Allah melarang hamba-hambaNya yang beriman untuk tidak mendekati shalat ketika dalam kondisi mabuk hingga mereka mampu mengetahui apa yang mereka katakan, hal ini mencakup juga perkara mendekati tempat-tempat shalat, seperti masjid, maka sesungguhnya seorang yang mabuk itu tidak dibolehkan memasukinya, dan juga mencakup shalat itu sendiri, karena sesungguhnya seorang yang mabuk tidak boleh melakukan shalat, tidak juga iabadah yang lain, disebabkan karena pikirannya yang tidak lurus, dan ketidaktahuannya tentang apa yang diucapkannya, oleh karena itu Allah mengancam hal tersebut dan mensyaratkan bolehnya melakukan perkara itu ketika mengetahui apa yang diucapkan oleh orang ynag mabuk tersebut. Ayat yang mulia ini telah dinasakh oleh ayat pengharaman khamar secara mutlak, karena sesungguhnya khamar itu pada awalnya tidak diharamkan, kemudian Allah tewlah mengisyaratkan tentang keharamannya bagi hamba-hambaNya dengan FirmanNya, \"Mereka bertanya kepadamu tentang khamar dan judi. Katakanlah: \"Pada keduanya terdapat dosa yang besar dan beberapa manfaat bagi manusia, tetapi dosa keduanya lebih besar dari manfaatnya\" -Al-Baqarah:219-. Kemudian Allah melarang mereka minum khamar ketika akan mendirikan shalat sebagaimana disebutkan dalam ayat ini, kemudian Allah mengharamkannya secara mutlak dalam segala kondisi dan waktu dalam FirmanNya, Hai orang-orang yang beriman, sesungguhnya (meminum) khamar, berjudi, (berkorban untuk) berhala, mengundi nasib dengan panah, adalah termasuk perbuatan syaitan. Maka jauhilah perbuatan-perbuatan itu agar kamu mendapat keberuntungan.\" -Al-Maidah:90. Walaupun demikian sesungguhnya khamar itu akan lebih haram lagi ketika akan mendirikan shalat karena mengandung kerusakan yang besar, yaitu dengan tidak tercapainya maksud dari shalat yang merupakan ruh dari shalat dan intinya, yaitu kekhusyuan dan hadirnya hati, sedangkan khamar menutupi hati dan menghalangi dari berdzikir kepada Allah dan dari shalat. Dan di antara faidah dari makna ini adalah larangan memulai shalat dalam kondisi sangat mengantuk di mana orang tersebut tidak merasakan (mengetahui) apa yang diucapkan dan dikerjakannya, bahkan ada indikasi dari makna ini bahwa seyoyganya bagi seseorang yang hendak menegakkan shalat agar meninggalkan segala hal-hal yang menyibukkan pikirannya, seperti menahan buang air kecil atau air besar, atau hasrat untuk makan dan hal-hal lain semisalnya, sebagaimana dijelaskan tentang hal itu oleh hadist Nabi yang shahih. Kemudian Allah berfirman, “(Jangan pula hampiri masjid) sedang kamu dalam keadaan junub, terkecuali sekedar berlalu saja” yaitu janganlah kalian mendekati shalat ketika kondisi kalian sedang junub kecuali bila sekedar lewat saja, artinya kalian melewati masjid dan tidak tinggal di dalamnya, “hingga kamu mandi” maksudnya, apabila kalian telah mandi. Dan itulah batas dari larangan mendekati shalat bagi orang tersebut hanyalah melewati masjid saja. “Dan jika kamu sakit atau sedang dalam musafir atau kembali dari tempat buang air atau kamu telah menyentuh perempuan, kemudian kamu tidak mendapat air, maka bertayamumlah.” Tayamum dibolehkan bagi orang yang sakit secara mutlak, baik ada air ataupun tidak, karena alasannya adalah sakit yang membuat pemakaian air sangat berat baginya, demikian pula perjalanan jauh (safar), karena ia adalah suatu kondisi yang dihadapkan dengan susahnya mendapatkan air, apabila seorang musafir tidak mendapatkan air atau ia mendapatkannya namun hanya dapat menutupi kebutuhan pokoknya seperti minum dan lainnya, maka boleh baginya bertayamum. Demikian juga bila seseorang telah buang air kecil atau besar atau menyentuh wanita, maka dia boleh bertayamum apabila ia tidak mendapatkan air, baik saat perjalanan maupun menetap, sebagaimana hal itu ditunjukkan oleh keumuman ayat tersebut. Kesimpulannya bahwa Allah membolehkan tayamum dalam dua kondisi; di saat tidak ada air, hal ini secara mutlak, baik saat perjalanan maupun menetap, dan di saat sangat berat untuk mempergunakannya seperti sakit atau lainnya. Dan para ahli tafsir telah berbeda pendapat tentang makna Firman Allah, “Atau kamu telah menyentuh perempuan,” apakah yang dimaksud di situ adalah berjimak? Sehingga ayat ini menjadi sebuah nash yang jelas tentang bolehnya bertayamum bagi orang yang junub sebagaimana dijelaskan dalam banyak hadist, ataukah maksud darinya adalah hanya sebatas sentuhan dengan tangan, lalu hal tersebut disyaratkan dengan kondisi bila menjadi sebab keluarnya madzi, artinya sentuhan dengan adanya syahwat, maka ayat itu menjadi sebuah dalil akan batalnya wudhu karena hal tersebut. Dan para ahli fikih telah berdalil dengan Firman Allah, “Kemudian kamu tidak mendapat air” akan wajibnya usaha mencari air pada saat masuknya waktu shalat, mereka berkata; karena sesungguhnya tidaklah mungkin dikatakan bahwa tidak mendapat air bagi orang yang belum mencari, akan tetapi tidaklah dikatakan seperti itu kecuali setelah mencari. Mereka kembali berdalil dengan ayat itu bahwa air yang berubah karena disebabkan oleh sesuatu yang suci boleh –bahkan harus- bersuci dengannya, hal ini karena ia termasuk dalam ayat, “Kemudian kamu tidak mendapat air” dan air yang telah berubah karena bercampur dengan sesuatu yang suci itu juga disebut. Dalam hal itu kita dapat membagi dan menyebutnya sebagai kategori bukan air mutlak, dan dalam masalah ini perlu pembahasan. Dan ayat yang mulia ini menunjukkan disyariatkannya hukum yang agung tersebut atas umat ini, di mana dengannya Allah memberikan karunia atas mereka, yaitu syariat tayamum, dan para ulama telah bersepakat atas hal tersebut, dan segala puji hanya milik Allah. Dan bahwasanya tayamum itu dilakukan dengan tanah yang baik, yaitu segala apa yang ada di atas bumi, baik yang memiliki debu atau tidak, dan kemungkinan juga dikhususkan hanya tanah yang memiliki debu, karena Allah berfirman, “Sapulah mukamu dan tanganmu” dengannya, sedangkan tanah yang tidak memiliki debu tidaklah mungkin mengusap (wajah) dengannya. Dan FirmanNya, “Sapulah mukamu dan tanganmu” dengannya, ini adalah bagian yang harus disapu dalam bertayamum yaitu seluruh wajah dan kedua tangan hingga kedua pergelangan tangannya, sebagaimana yang ditunjukkan oleh hadist-hadist akan hal tersebut, dan disunnahkan dalam bertayamum adalah dengan satu kali tepukan saja sebagaimana yang dijelaskan oleh hadist Ammar, ayat ini juga menunjukkan bahwa tayamumnya orang yang junub sama seperti lainnya yaiitu bagian wajah dan kedua tangan. Ayat ini menunjukkan wajibnya membasuh wajah dan kedua tangan secara menyeluruh, dan bahwa tayamum hukumnya dibolehkan meskipun waktunya tidak sempit, dan bahwa mencari air itu tidaklah diminta kecuali setelah adanya sebab-sebab wajib, Wallahu a’lam. Kemudian Allah menutup ayat ini dengan FirmanNya, “Sesungguhnya Allah Maha Pemaaf lagi Maha Pengampun,” maksudnya, Allah memiliki maaf dan ampunan yang melimpah bagi hamba-hambaNya yang beriman dengan memudahkan dan meringankan dengan seringan-ringannya apa yang telah Dia perintahkan kepada mereka, di mana seorang hamba tidak akan mendapatkan kesulitan dalam menjalankannya hingga ia merasa berat karenanya. Di antara maaf dan ampunanNya yang lain adalah Allah membuka pintu taubat dan ampunan bagi orang-orang yang berbuat dosa. Allah menyeru mereka kepadanya dan menjanjikan kepada mereka ampunanNya atas dosa-dosa mereka. Dan di antara maaf dan ampunanNya juga adalah bahwa seorang Mukmin bila bertemu Allah dengan membawa dosa dan kesalahan sepenuh bumi dan hamba itu bertemu Allah sedang ia tidak mempersekutukanNya dengan sesuatu pun, maka pastilah Allah akan memberikan kepadanya ampunan sepenuh bumi pula."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {لا تَقْرَبُوا} wal taqrobuu: janganlah mendekat, sebuah perumpamaan untuk tidak masuk ke dalamnya. Atau janganlah mendekati masjid kami. {سُكَارَى} sukaaroo: bentuk jamak dari sakroon. Yaitu orang yang meminum sesuatu yang memabukkan sehingga tertutupi akalnya. {تَعْلَمُوا مَا تَقُولُونَ} ta’lamuu maa taquuluun : mengetahui apa yang kalian katakan karena hilangnya pengaruh minuman yang memabukkan ketika waktu sholat. Hal ini terjadi sebelum pengharaman khamr dan zat memabukan yang lainnya. {وَلا جُنُباً} wala junuban: junub adalah kata yang berasal dari kata janabah. Janabah adalah disebabkan oleh dua hal, jimak dan mimpi basah. {عَابِرِي سَبِيلٍ} ‘abirii sabiil: orang yang hanya sekedar masuk lewat di dalam masjid tanpa duduk di dalamnya. {الْغَائِطِ} Al ghooith : tempat untuk buang air besar. {لامَسْتُمُ النِّسَاءَ} laamastumunnisaa: berjimak dengan wanita {فَتَيَمَّمُوا صَعِيداً طَيِّباً} fatayammamuu sho’iidan thoyyiba: menuju kesucian dengan debu yang baik. {عَفُوّاً غَفُوراً} ‘afuwwan ghofuuro: Maha Pemaaf dengan tidak menyiksa dosa, Maha Pengampun kepada hamba-hamba yang taubat dari dosa. Makna Ayat: Tidak diragukan lagi bahwa ayat ini mempunyai sebab kenapa diturunkannya. Dan sebabnya adalah Abdurahman bin ‘Auf rodhiallohu ‘anhu -berdasarkan riwayat Timidzi- mengadakan perjamuan untuk sebagian sahabatnya. Kemudian mereka makan-makan dan minum-minum lalu masuk waktu sholat dan mereka menuju untuk sholat, maju salah satu diantara mereka untuk menjadi imam, dia membaca surat al kafirun sementara dia dalam keadaan mabuk, maka dia membaca ﻗﻞ ﻳﺎ ﺃﻳﻬﺎ اﻟﻜﺎﻓﺮﻭﻥ ﺃﻋﺒﺪ ﻣﺎ ﺗﻌﺒﺪﻭﻥ “Katakanlah, ‘Wahai, orang-orang kafir. Kami menyembah apa yang kalian sembah.” dan ini adalah bacaan yang sesat dengan menghilangkan kata negasi (tidak). Maka oleh karenanya turun ayat, {ﻳﺎ ﺃﻳﻬﺎ اﻟﺬﻳﻦ ﺁﻣﻨﻮا....} wahai orang -orang yang percaya kepada Allah dan Rosul-Nya {ﻻ ﺗﻘﺮﺑﻮا اﻟﺼﻼﺓ} janganlah kalian sholat saat tengah dalam pengaruh mabuk dari khomr --yang mana waktu itu adalah halal dan tidak haram-- sampai akal kalian sempurna bisa membedakan baik dan buruk, maka kalian akan mengetahui apa yang kalian katakan saat sholat. Dan janganlah kalian mendekati Masjid untuk duduk-duduk di dalamnya sementara kalian dalam keadaan junub sampai kalian mandi, kecuali bagi orang-orang junub yang hanya sekedar lewat masjid, yang mana jalan rumah sebagian kalian adalah melewati dalam masjid nabawi. {ﻭﺇﻥ ﻛﻨﺘﻢ ﻣﺮﺿﻰ} “jika kalian sakit” dengan luka yang membahayakan jika terkena air atau sakit yang mana tidak sanggup untuk menggunakan air sebagai wudhu atau mandi atau kalian {ﻋﻠﻰ ﺳﻔﺮ ﺃﻭ ﺟﺎء ﺃﺣﺪ ﻣﻨﻜﻢ ﻣﻦ اﻟﻐﺎﺋﻂ ﺃﻭ ﻻﻣﺴﺘﻢ اﻟﻨﺴﺎء} “dalam safar, datang dari buang hajat atau telah menyentuh wanita” dengan jimak atau cumbuan bersyahwat, {ﻓﻠﻢ ﺗﺠﺪﻭا ﻣﺎء} “dan kalian tidak menemukan air” untuk mandi -bagi orang junub- atau wudhu -bagi orang berhadats kecil- {ﻓﺘﻴﻤﻤﻮا ﺻﻌﻴﺪا ﻃﻴﺒﺎ} “bertayammumlah” dengan menggunakan debu untuk bersuci.{ﻓﺎﻣﺴﺤﻮا ﺑﻮﺟﻮﻫﻜﻢ ﻭﺃﻳﺪﻳﻜﻢ} “Usaplah wajah kalian dan tangan-tangan kalian” satu kali saja maka sudah cukup untuk wudhu dan mandi. Jika sudah sembut orang yang sakit atau menemukan air, maka mandilah atau wudhu dan janganlah melakukan tayammum karena sudah hilang sebab keringanan untuk bertayammum dengan hilangnya sakit atau ditemukannya air. Allah mengakhiri dengan {ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﻋﻔﻮا ﻏﻔﻮﺭا} “sesungguhnya Allah Maha Pemaaf dan Maha Pengampun”. Dengan ayat ini, Allah telah mengabarkan kepada kita tentang kesempurnaan-Nya yang mutlak dengan menyifati diri-Nya Maha Pemaaf kepada hamba-Nya yang beriman, jikalau mereka melanggar perintah-Nya. Dan Allah menyifati diri-Nya dengan Maha Pengampun atas dosa-dosa mereka jika mereka bertaubat. Oleh karenanya Allah tidak menyiksa Abdurahman dan teman-temannya ketika mereka sholat dalam keadaan mabuk yang saat itu tidak mengetahui apa yang mereka katakan. Dan Allah mengampuni mereka serta menurunkan ayat ini sebagai pembelajaran dan petunjuk bagi mereka. Petunjuk dari Ayat: • Penetapan adanya penganuliran hukum-hukum syariat dalam Quran dan Hadits • Haramnya seorang yang berjunub menetap di dalam masjid dan dibolehkannya hanya sekedar berlalu dan lewat tanpa menetap di dalam masjid. • Kewajiban mandi bagi orang junub, yaitu orang yang terkena janabah atau mimpi basah dan mendapati keluar air mani -dengan sebab berjimak dengan istrinya atau memasukan kemaluannya ke kemaluan istri tanpa ejakulasi. Dan cara mandi adalah dengan mencuci kedua lengan dan cukup berkata ‘bismillah’ serta meniatkan untuk mengangkat hadats besar kemudian beristinja dan mencuci kemaluan dan sekitarnya lalu melaksanakan wudhu, dilanjutkan dengan mencuci kedua lengan sebanyak tiga kali, diteruskan dengan berkumur, memasukkan air ke dalam hidung dan dikeluarkan kembali sebanyak tiga kali, diteruskan dengan mencuci wajah dan tangannya sampai siku, bersambung dengan menenggelamkan kedua telapak tangan kedalam air untuk menyela-nyela akar dan pangkal rambut kepala, berlanjut memberikan sedikit air ke kepala untuk dibasukkan kepadanya dari bagian atas badan sampai bawah. Dan membasuh dengan air kedua ketiak dan setiap jengkal dari tubuh dialiri dengan air seperti halnya pusar dan bagian bawah lutut. • Jika seseorang tidak mendapatkan debu karena hujan atau semisalnya, hendaknya dia bertayammum dengan segala sesuatu yang berasal dari tanah, semisal pasir, garam dan batu. Tayammum adalah dengan memukul tanah dengan kedua telapak tanah, mengusap wajah lalu kedua lengan berdasarkan hadits Ammar di dalam Ash Shohih. • Penjelasan mengenai ampunan dan Maaf dari Allah dengan ditiadakan hukuman bagi yang sholat dalam keadaan mabuk"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 43: Hai orang-orang yang beriman! Janganlah kamu hampir kepada shalat padahal kamu sedang mabuk, hingga kamu tahu apa yang kamu katakan, dan jangan (kamu hampir kepada tempat shalat padahal kamu junub, kecuali orang-orang yang melalui, hingga kamu mandi; dan jika kamu sakit atau di dalam pelayaran, atau kamu datang dari tempat buang air, atau kamu sentuh perempuan- perempuan sedang kamu tak da- pat air, maka hendaklah kamu cari debu yang bersih, lantas hendaklah kamu sapu muka-muka kamu dan tangan-tangan kamu, karena sesungguhnya Allah Pemudah Pengampun.\""
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "\"Mendekati\" di sini mencakup mendekati tempat-tempat shalat seperti masjid, dan mencakup perbuatan shalat itu sendiri, yakni tidak boleh orang yang mabuk melakukan shalat dan ibadah karena akalnya tidak sadar dan tidak mengerti apa yang dia ucapkan. Namun ayat ini sudah mansukh (dihapus) dengan ayat yang mengharamkan khamr (minuman keras) secara mutlak. Khamr diharamkan melalui tahapan-tahapan. Pada mulanya khamr belum haram, kemudian Allah Ta'ala menawarkan keharamannya kepada hamba-hamba-Nya dengan firman-Nya: \"Mereka bertanya kepadamu tentang khamar dan judi. Katakanlah: \"Pada keduanya terdapat dosa yang besar dan beberapa manfaat bagi manusia, tetapi dosa keduanya lebih besar dari manfaatnya\". Dan mereka bertanya kepadamu apa yang mereka nafkahkan. Katakanlah: \"Yang lebih dari keperluan.\" Demikianlah Allah menerangkan ayat-ayat-Nya kepadamu supaya kamu berfikir,\" (Al Baqarah: 219) Kemudian Allah Subhaanahu wa Ta'aala melarang mereka meminum khmar ketika hendak shalat sebagaimana pada ayat di atas, dan kemudian Allah Ta'ala mengharamkan secara mutlak di setiap waktu dengan firman-Nya: \"Wahai orang-orang yang beriman! Sesungguhnya (meminum) khamar, berjudi, (berkorban untuk) berhala, mengundi nasib dengan panah adalah termasuk perbuatan setan. Maka jauhilah perbuatan-perbuatan itu agar kamu mendapat keberuntungan.\" (Terj. Al Ma'idah:90) Dari ayat ini dapat diambil kesimpulan larangan melakukan shalat ketika sangat mengantuk, di mana orangnya tidak menyadari lagi apa yang diucapkan dan apa yang dilakukannya. Lebih dari itu, di sana juga terdapat isyarat bahwa sepatutnya bagi orang yang hendak shalat memutuskan segala yang dapat menyibukkan pikirannya, seperti didesak oleh buang air, lapar hendak makan dsb. Ada pula yang mengartikan \"melewati jalan\" di sini sebagai orang musafir. Yang berbahaya jika menggunakan air atau akan bertambah parah sakitnya atau membuat lama sembuhnya meskipun ada air. Kemudian tertimpa junub atau berhadats, di mana ketika safar biasanya tidak ada air atau ada air namun untuk keperluannya di tengah perjalanan, seperti untuk minum dsb. jika ia meminum air tersebut, ia akan kehausan. Yakni berhadats. Imam Syafi'i berdalih dengan ayat ini bahwa menyentuh wanita dapat membatalkan wudhu', namun menurut Ibnu Abbas, maksud \"menyentuh\" di ayat ini adalah berjima'. Ulama lain berpendapat bahwa menyentuh wanita yang membatalkan wudu' adalah menyentuh karena syahwat, di mana hal itu berkemungkinan besar keluarnya madzi. Di antara pendapat-pendapat tersebut, yang rajih adalah pendapat Ibnu Abbas, wallahu a'lam. Untuk bersuci dengannya setelah berusaha mencarinya. Ayat ini menunjukkan adanya usaha mencari air. Berdasarkan keterangan di atas, bahwa Allah Ta'ala membolehkan tayammum dalam dua keadaan: - Ketika tidak ada air, hal ini berlaku mutlak baik ketika safar maupun tidak. - Ketika kesulitan memakai air, seperti karena sakit atau karena lumpuh dan di sana tidak ada orang mengambilkan air untuknya dsb. Sha'id di ayat tersebut adalah sesuatu yang nampak di atas permukaan bumi, baik ada debunya maupun tidak. Namun ada yang berpendapat bahwa tayammum harus ada debunya, berdasarkan ayat \"Fam sahuu biwujuuhikum wa aydiikum minh\" (maka usaplah muka dan tanganmu daripadanya), karena jika tidak ada debunya bagaimana mungkin mengusapnya. Yakni sampai pergelangan sebagaimana ditunjukkan oleh hadits-hadits yang shahih, dan memukulkan telapak tangan ke tanah cukup sekali saja sebagaimana diterangkan dalam hadits Ammar; untuk muka dan telapak tangan. Faedah/catatan: Perlu diketahui, bahwa kaidah kedokteran berjalan di atas tiga perkara: - Menjaga kesehatan dari segala sesuatu yang membahayakan. - Menjaga diri dari bahaya - Menghilangkan bahaya Ketiga hal ini telah diisyaratkan dalam Al Qur'an. Menjaga kesehatan dan menjaga diri dari hal yang membahayakan, misalnya dengan adanya perintah makan dan minum serta tidak berlebih-lebihan. Allah Subhaanahu wa Ta'aala juga telah membolehkan berbuka puasa bagi musafir dan orang yang sakit untuk menjaga kesehatannya. Adapun menghilangkan bahaya, maka dengan adanya kebolehan dari Allah Ta'ala bagi orang yang ihram, di mana kepalanya terganggu oleh kutu dsb. untuk mencukurnya. Di sana terdapat isyarat untuk menghilangkan (membersihkan) hal yang lebih buruk lagi, yaitu kencing, tahi, muntah, dsb. Oleh karenanya, dia memberikan banyak kemudahan kepada hamba-hamba-Nya, di mana seorang hamba tidak kesulitan melakukannya. Di antara maaf dan ampunan-Nya adalah dengan mensyari'atkan kepada umat ini bersuci dengan debu (tayammum) sebagai pengganti air ketika kesulitan menggunakannya. Termasuk maaf dan ampunan-Nya juga adalah dengan membukakan pintu tobat kepada orang-orang yang berdosa dan mengajak mereka kepada-Nya. Dia pun menjanjikan untuk mengampuni mereka. Lebih dari itu, di antara maaf dan ampunan-Nya adalah jika seorang mukmin datang kepada-Nya dengan dosa sepenuh bumi tanpa menyekutukan-Nya dengan sesuatu, maka Dia akan datang dengan ampunan sepenuh bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 43",
    "description": "Pada beberapa ayat yang lalu, Al-Qur'an menggambarkan perilaku orang-orang yang sombong dan membanggakan diri serta betapa dahsyat siksa yang akan dijumpai mereka pada hari berbangkit, sampaisampai mereka menginginkan agar disamaratakan saja dengan tanah, sehingga tidak mengalami perhitungan amal sama sekali. Namun hal itu tidak akan terjadi, karena tidak ada seorang pun yang dapat sembunyi dari pengawasan Allah. Oleh sebab itu, ayat ini dan ayat berikutnya menjelaskan bagaimana seharusnya manusia hidup di dunia agar selamat dari siksaan di hari berbangkit tersebut. Caranya ialah dengan melaksanakan salat dan bagaimana salat itu ditunaikan agar bisa menyelamatkan diri dari siksa di hari berbangkit tersebut. Wahai orang yang beriman kepada Allah dan rasul-Nya, janganlah kamu mendekati tempat salat atau melaksanakan salat ketika kamu dalam keadaan mabuk, yakni hilang ingatan karena minuman keras. Dirikanlah salat jika kamu sudah sadar apa yang kamu ucapkan, dan juga jangan pula kamu hampiri masjid ketika kamu dalam keadaan junub yang mengharuskan kamu mandi wajib, kecuali hanya sekadar melewati jalan saja, boleh kamu lakukan sebelum kamu mandi junub. Adapun jika kamu sakit yang dikhawatirkan bila menyentuh air penyakit itu akan bertambah parah atau susah disembuhkan, atau kamu sedang dalam perjalanan yang jaraknya jauh, sekitar 80 km atau lebih, atau sehabis buang air, apakah itu buang air kecil atau buang air besar, atau kamu telah menyentuh perempuan, apakah itu hanya sekadar bersentuh kulit atau berhubungan suami istri, sedangkan kamu pada waktu itu tidak mendapat air, maka bertayamumlah kamu, sedengan cara usaplah wajahmu satu kali dan usap pula tanganmu, dengan mempergunakan debu atau tanah itu. Sungguh, Allah itu maha pemaaf, maha pengampun bagi hamba-hamba-Nya yang mau bertobatbagai pengganti wudu, dengan debu, atau tanah dan sejenisnya, yang baik, yakni suci, tidakkah kamu memperhatikan dengan saksama orang yang telah diberi bagian kitab taurat' mereka membeli kesesatan dan mereka menghendaki agar kamu tersesat menyimpang dari jalan yang benar."
  }
]