[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak mengetahui (wahai rasul), tentang kaum yahudi yang telah diberi bagian ilmu yang datang kepada mereka melalui taurat, mereka menukar kesesatan dengan hidayah ,dan meninggalkan apa yang ada pada mereka berupa hujjah-hujjah dan bukti-bukti nyata, yang menunjukkan kebenaran risalah utusan Allah, Muhammad ,serta berharap kalian (wahai kaum mukminin yang memperoleh hidayah) supaya kalian semua menyimpang dari jalan yang lurus supaya kalian sesat seperti mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Tidakkah kamu -wahai Rasul- mengetahui perihal orang-orang Yahudi yang Allah beri karunia bagian dari ilmu melalui kitab suci Taurat. Tetapi mereka menukar petunjuk itu dengan kesesatan dan berambisi untuk menyesatkan kalian -wahai orang-orang mukmin- dari jalan lurus yang dibawa oleh Rasul, supaya kalian mengikuti jalan yang menyimpang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Muhammad Tidakkah kamu melihat orang-orang yang telah diberikan kitab, bagaimana mereka terhalangi dari hidayah dan menukar hidayah itu dengan kesesatan. Mereka sendirilah yang memilih kesesatan bagi diri mereka, dan mereka ingin menyesatkan orang-orang beriman dari jalan yang lurus sebagaimana mereka tersesat. Mereka selalu membuat tipu daya terhadap kalian agar sebisa mungkin mereka kdapat mengeluarkan kalian dari agama Islam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا۟ نَصِيبًا مِّنَ الْكِتٰبِ (Apakah kamu tidak melihat orang-orang yang telah diberi bahagian dari Al Kitab) Yakni kitab taurat, dan mereka adalah kaum Yahudi. يَشْتَرُونَ الضَّلٰلَةَ (Mereka membeli (memilih) kesesatan) Yakni dengan tetap dalam agama Yahudi meski telah jelas bagi mereka bukti atas kebenaran kenabian nabi Muhammad. وَيُرِيدُونَ أَن تَضِلُّوا۟ السَّبِيلَ (dan mereka bermaksud supaya kamu tersesat (menyimpang) dari jalan (yang benar)) Disamping kesesatan mereka itu, mereka juga memakai penyembunyian kebenaran, pengingkaran, dan tipu daya mereka untuk menyesatkan kalian dari jalan kebenaran wahai orang-orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hal yang patut diperhatikan bagi setiap orang yang dikaruniakan oleh Allah keilmuan agar mereka senantiasa menjadi yang terdepan dalam menegakkan kebenaran, dan memberantas kebathilan; oleh karena itu dalam ayat ini Allah meemparkan celaan-Nya dengan begitu keras kepada siapa yang melanggar dua perkara ini { أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيبًا مِنَ الْكِتَابِ يَشْتَرُونَ الضَّلَالَةَ } \"Apakah kamu tidak melihat orang-orang yang telah diberi bahagian dari Al Kitab (Taurat)? Mereka membeli (memilih) kesesatan (dengan petunjuk)\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Wahai nabi, apakah kamu belum melihat orang-orang Yahudi yang telah diberi sebagian kitab Taurat lalu mereka mengganti kebenaran dengan kesesatan, yaitu dengan tetap beragama Yahudi setelah adanya dalil tentang kebenaran nubuwwah nabi Muhammad SAW. Dan mereka ingin menyesatkan orang-orang mukmin supaya meninggalkan agama yang benar dan membuat orang-orang mukmin itu seperti mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu melihat orang-orang yang telah diberi bagian dari Kitab} bagian pengetahuan dari Taurat {Mereka membeli kesesatan} Mereka mengganti petunjuk dengan kesesatan {dan ingin agar kalian tersesat dari jalan (yang benar)} jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Ini merupakan celaan bagi orang-orang yang “telah diberi bagian dari al-Kitab (Taurat)” dan ayat ini juga mengandung peringatan buat hamba-hambaNya agar tidak terpedaya dengan mereka dan tidak terjerumus ke dalam orang-orang yang semisal mereka, lalu Allah mengabarkan mereka tentang diri mereka sendiri, “Mereka membeli (memilih) kesesatan (dengan petunjuk)” maksudnya, mereka sangat menyukainya dan mendahulukannya sebagaimana seorang yang mengarahkan harta yang banyak untuk meraih apa yang disukainya, mereka mendahulukan kesesatan daripada petunjuk dan kekufuran daripada keimanan serta kesengsaraan daripada kebahagiaan, walaupun demikian, “mereka bermaksud suapaya kamu tersesat (menyimpang) dari jalan (yang benar)” mereka itu sangat bersemangat untuk menyesatkan kalian dengan segenap kemampuan, mereka mengerahkan segala upaya dalam hal tersebut, akan tetapi ketika Allah adalah pelindung bagi hamba-hambaNya yang beriman dan penolong mereka, maka Allah menerangkan kepada mereka tentang apa yang terkandung padanya berupa kesesatan dan penyesatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﺃﻟﻢ ﺗﺮ} ala taro: apakah kalian tidak melihat dengan hati (ilmu kalian) {ﻧﺼﻴﺒﺎ} nashiban: bagian dan jatah. {ﻳﺸﺘﺮﻭﻥ اﻟﻀﻼﻟﺔ} yasytaruunadh dholaalah: membeli kekafiran dibayar dengan iman. Makna Ayat: Diriwayatkan bahwa ayat ini diturunkan perihal Rifa’ah bin Zaid bin at Tabuut, salah seorang pembesar Yahudi di kota Madinah. Dulu dia jika berbicara kepada Nabi memlesetkan kata-kata dan berkata: “Tujukan pendengaranmu, wahai Muhammad sampai kami memahamimu.” Kemudian ternyata dia berpaling dari Islam dan Allah turunkan tiga ayat ini sampai dengan firman فَلا يُؤْمِنُونَ إِلا قَلِيلاً “maka tidaklah mereka beriman kecuali sedikit” dan Firman ini adalah penjelasan dari Firman yang lain, {ﺃﻟﻢ ﺗﺮ ﺇﻟﻰ اﻟﺬﻳﻦ ﺃﻭﺗﻮا ﻧﺼﻴﺒﺎ ﻣﻦ اﻟﻜﺘﺎﺏ ﻳﺸﺘﺮﻭﻥ اﻟﻀﻼﻟﺔ ﻭﻳﺮﻳﺪﻭﻥ ﺃﻥ تَضِلُّوا السَّبِيلَ} “Apakah kau tidak melihat orang-orang yang telah diberikan kitab, mereka membeli kesesatan dan menginginkan tersesat di jalan”, maksudnya adalah apakah tidak datang ilmu kepada kamu dan kepada para sahabatmu apa yang membuat kalian menjadi takjub? Ilmu yang diberikan kepada orang-orang yang mendapatkan kitab dan mereka adalah Rifa’ah bin Yazid dan teman-temannya dari kalangan Yahudi. Mereka telah memahami Taurat dan mengerti kebenaran agama Islam dan kejujuran Nabinya. {يَشْتَرُونَ الضَّلالَةَ} “membeli kesesatan”, yaitu kekafiran yang dibeli dan ganti dengan iman. Tatkala mereka mengingkari ciri-ciri dan sifat Nabi yang ada di dalam Taurat untuk mengukuhkan kedudukan meraka di hadapan kaum mereka, maka dengan keingkaran mereka, mereka menjadi dituankan dan dimuliakan oleh kaumnya. Bersamaan dengan itu mereka menginginkan untuk menjadi sesat -wahai kaum mukminin- dari jalan kebenaran dan petunjuk yang berupa iman kepada Allah dan Rosul-Nya dan amal dengan menaati mereka untuk mejadi lebih bahagia dan lebih sempurna. Pelajaran dari Ayat: • Penjelasan makar Yahudi kepada orang-orang beriman dengan cara menyesatkan mereka semenjak zaman Nabi sampai sekarang ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 44: Tidakkah engkau perhatikan orang-orang yang diberi sebahagian daripada Kitab itu membeli kesesatan, dan mereka ingin supaya kamu sesat jalan?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan celaan kepada mereka yang telah diberikan al kitab, namun mereka meletakkan kitab tersebut di belakang punggung mereka, mereka lebih memilih kesesatan daripada petunjuk, memilih kekafiran daripada keimanan dan memilih kesengsaraan daripada kebahagiaan. Di dalamnya terdapat peringatan bagi kaum mukmin agar tidak terpedaya oleh mereka dan tidak terjatuh seperti mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 44",
    "description": "Tidakkah kamu memperhatikan dengan saksama orang yang telah diberi bagian kitab taurat' mereka membeli kesesatan dan mereka menghendaki agar kamu tersesat menyimpang dari jalan yang benarayat-ayat yang lalu memberi petunjuk dalam rangka pembinaan masyarakat islam ke dalam, sedang ayat-ayat berikut memberi tuntunan bagaimana menghadapi musuh-Musuh yang mengganggu pembinaan masyarakat tersebut. Dan Allah pada hakikatnya lebih mengetahui tentang musuh-Musuhmu dari diri kamu sendiri. Oleh sebab itu, berserah dirilah kepada Allah. Cukuplah Allah menjadi pelindung dalam menangani kepentingan kalian dan cukuplah Allah menjadi penolong bagimu dalam menghadapi musuh-Musuh itu."
  }
]