[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Allah lebih mengetahui dari kalian (wahai orang-orang yang beriman), tentang permusuhan kaum yahudi terhadap kalian. Dan cukuplah Allah sebagai pelindung yang melindungi kalian dan cukuplah DIA sebagai penolong yang menolong kalian atas musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Allah -'azza wa jalla- lebih tahu dari kalian -wahai orang-orang mukmin- tentang siapa musuh-musuh kalian. Maka Allah memberitahu kalian tentang jati diri mereka dan menjelaskan bagaimana permusuhan mereka terhadap kalian. Cukuplah Allah sebagai Pelindung yang akan melindungi kalian dari kekuatan mereka. Dan cukuplah Allah sebagai Penolong yang akan menjaga kalian dari tipu daya serta kejahatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Allah lebih mengetahui mereka daripada kalian mengetahui mereka dia telah mengabarkan kepada kalian permusuhan mereka terhadap kalian dan apa yang mereka inginkan bagi kalian ini agar kalian senantiasa berhati-hati dalam berinteraksi dengan mereka Maha Mengetahui keadaan dan perkara mereka. Cukuplah Allah yang mengatur segala urusan dan kebaikan kalian dan cukuplah dia sebagai penolong dalam setiap kejadian. maka percayalah kepada-Nya dan cukuplah dengan pertolongan-Nya. janganlah kalian mempedulikan keburukan yang mereka buat terhadap kalian, Allahlah yang akan menolong kalian dari tipu daya dan keburukan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَاللهُ أَعْلَمُ بِأَعْدَآئِكُمْ ۚ (Dan Allah lebih mengetahui (dari pada kamu) tentang musuh-musuhmu) Yakni musuh-musuh kalian wahai orang-orang yang beriman. Mereka tidak menginginkan kecuali kesesatan kalian. Dan Allah mengabarkan kalian tentang permusuhan mereka terhadap kalian agar kalian berhati-hati terhadap mereka. وَكَفَىٰ بِاللهِ نَصِيرًا (Dan cukuplah Allah menjadi Penolong) Yakni yang menolong kalian di medan-medan peperangan. Maka cukupkanlah diri kalian dengan bantuan dan pertolongan-Nya, dan janganlah kalian mengharap bantuan dan pertolongan dari selain-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Wahai orang-orang mukmin, Allah itu lebih tahu tentang musuh-musuh kalian, dan apa yang mereka inginkan dari kalian, yaitu kesesatan. Allah memperingatkan kalian tentang mereka. Dan cukuplah Allah sebagai Dzat yang diserahi urusan-urusan kalian dan penolong kalian dalam peperangan. Maka cukuplah berada dalam wilayah dan perlindunganNya, bukan yang lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah lebih tahu tentang musuh-musuh kalian. Cukuplah Allah menjadi pelindung dan cukuplah Allah menjadi penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Oleh karena itulah Allah berfirman, “Dan cukuplah Allah menjadi Pelindung (bagimu),” yaitu Allah mengurus kondisi hamba-hambaNya, mengasihi mereka dalam segala urusan mereka, dan Allah memudahkan bagi mereka hal-hal yang menjadi kebahagiaan dan keberuntungan mereka, “Dan cukuplah Allah menjadi Penolong (bagimu)” membela orang-orang yang beriman atas musuh-musuh mereka, Allah menjelaskan kepada mereka tentang apa yang harus mereka hindari dari musuh-musuh tersebut, kemudian Dia menolong mereka atas msuuh-musuh tersebut, maka perlindungan Allah dalam hal itu adalah tercapainya kebaikan, sedang pertolonganNya adalah hilangnya keburukan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {اﻷﻋﺪاء} al a’daa: musuh adalah orang jauh darimu, suka jika kamu celaka, susah jika kamu mendapatkan manfaat. Makna ayat : {وَاللهُ أَعْلَمُ بِأَعْدَائِكُمْ} “Dan Allah lebih mengetahui para musuh-Nya” yang menyukai jika kalian celaka daripada mendapatkan kebaikan. Oleh karena Aku (Allah) kabarkan kepada kalian perihal mereka, hendaklah kalian pahami dan jauhi mereka. Hal itu supaya kalian menjadi selamat dari makar mereka dan kesesatannya. {وَكَفَى بِاللهِ وَلِيّاً} “Dan cukuplah Allah sebagai wali” untuk kalian untuk kalian bersandar kepada-Nya dan menyerahkan perkara kalian kepada-Nya. {وَكَفَى بِاللهِ نَصِيراً} “cukuplah Allah sebagai penolong” kalian dari mereka dan yang lainnya semisal mereka, maka beribadahlah kalian kepada-Nya dan bertawakallah kepada-Nya. Pelajaran dari ayat : • Cukuplah Allah dan pertolongan-Nya bagi kaum mukminin yang mana sudah memadai dibandingkan dengan memintanya kepada selain Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 45: Ketahuilah musuh-musuh kamu; dan cukuplah Allah sebagai Penolong, cukuplah Allah sebagai Pengawal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun musuh-musuhmu berusaha sekuat tenaga untuk menyesatkan kamu, namun karena Allah pelindung dan penolong orang-orang mukmin, maka tenanglah! Allah akan menolong kamu terhadap musuh-musuhmu, menerangkan sesuatu yang perlu diwaspadai dari mereka dan membantu kamu melawan musuh-musuhmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 45",
    "description": "Ayat-ayat yang lalu memberi petunjuk dalam rangka pembinaan masyarakat islam ke dalam, sedang ayat-ayat berikut memberi tuntunan bagaimana menghadapi musuh-Musuh yang mengganggu pembinaan masyarakat tersebut. Dan Allah pada hakikatnya lebih mengetahui tentang musuh-Musuhmu dari diri kamu sendiri. Oleh sebab itu, berserah dirilah kepada Allah. Cukuplah Allah menjadi pelindung dalam menangani kepentingan kalian dan cukuplah Allah menjadi penolong bagimu dalam menghadapi musuh-Musuh ituyaitu di antara orang yahudi, yang kebiasaan buruk mereka adalah mengubah perkataan dari tempat-tempatnya seperti menyangkut kenabian Muhammad. Dan mereka berkata, kami mendengar, tetapi kami tidak mau menurutinya. Dan juga mereka mengatakan pula, dengarlah, sedang engkau, nabi Muhammad, sebenarnya tidak mendengar apa pun apa yang mereka katakan. Dan selanjutnya mereka mengatakan pula, ra''ina dengan memutar-balikkan lidahnya dan dengan sengaja mencela ajaran agama. Sekiranya mereka mengatakan, kami mendengar dan patuh, sebagai ganti dari perkataan dan dengarlah, dan perhatikanlah kami, tentulah itu lebih baik bagi mereka dan lebih tepat, karena tidak menimbulkan kemungkinan keliru. Akan tetapi itu tidak mereka lakukan sehingga Allah melaknat mereka, karena kekafiran dan kedurhakaan mereka. Mereka tidak beriman kecuali hanya sedikit sekali."
  }
]