[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Diantara orang-orang yahudi ada satu golongan yang terbiasa menganti-ganti firman Allah dan merubahnya dari pengertian yang sebenarnya secara dusta atas nama Allah. Dan mereka berkata kepada rasul , ”Kami dengar ucapanmu dan kami langgar perintahmu.Dengarlah dari kami,semoga kamu tidak dapat mendengar.” Dan mereka mengatakan, ”Ra ’ina sam’aka,” maksudnya pahamilah dari kami dan pahamkanlah kami. Mereka memutar-mutar lisan mereka dengan ungkapan itu. Sebenarnya mereka hendak melecehkan beliau dengan kata ar-ru’unah (bodoh sekali), sesuai dengan Bahasa yang mereka miliki, dan melecehkan agama islam. Seandainya mereka mengatakan, ”kami dengar dan kami taati,” sebagai ganti ”dan kami langgar”,dan “Dengarlah dari kami” tanpa kata-kata “semoga kamu tidak dapat mendengar”, dan “unzhurna” sebagai ganti “ra’ina”, niscaya ungkapan itu akan lebih baik bagi mereka di sisi allah dan merupakan ucapan yang lebih lurus. Akan tetapi, Allah mengusir mereka dari rahmatNYA, lantaran kekafiran dan pengingkaran mereka terhadap kenabian Muhammad . Mereka tidak mengimani kebenaran kecuali dengan keimanan yang sangat sedikit yang tidak akan bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Di antara orang-orang Yahudi terdapat orang-orang jahat yang mengubah firman Allah yang diturunkan-Nya kepada mereka. Mereka menakwilkannya dengan takwilan yang tidak sesuai dengan apa yang Allah turunkan. Dan ketika Rasulullah -ṣallallāhu 'alaihi wa sallam- menyuruh mereka melakukan sesuatu, mereka menjawab, “Kami mendengar ucapanmu, tetapi kami membangkang perintahmu.” Dan mereka berkata, “Dengarkanlah apa yang kami katakan, semoga kamu tidak mendengar.” Dan dengan kata-kata, “rā'inā\" mereka ingin memberikan kesan bahwa mereka bermaksud mengatakan, “Perhatikanlah kami dengan pendengaranmu”. Padahal sesungguhnya mereka bermaksud mengatakan ar-ru'ūnah (sangat bodoh). Mereka memutar lidah mereka dengan kata-kata itu. Mereka bermaksud menyumpahi Rasulullah -ṣallallāhu 'alaihi wa sallam- dan menistakan agama (Islam). Seandainya mereka mengatakan, “Kami mendengar ucapanmu dan mematuhi perintahmu”, bukan mengatakan, “Kami mendengar ucapanmu tetapi kami membangkang perintahmu”, dan mengatakan, “Dengarkanlah” bukan mengatakan, “Dengarkanlah. Semoga kamu tidak mendengar”, dan mengatakan, “intaẓirnā” (perlahanlah) sampai kami memahami perkataanmu, bukan mengatakan, “rā'inā”, niscaya hal itu akan lebih baik bagi mereka daripada ucapan mereka yang pertama, dan lebih adil dari itu, karena hal itu berarti menunjukkan sopan santun dan sikap yang pantas kepada Nabi -ṣallallāhu 'alaihi wa sallam-. Akan tetapi Allah telah mengutuk dan menjauhkan mereka dari rahmat-Nya disebabkan oleh kekafiran mereka, sehingga tidak memiliki iman yang bermanfaat bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. kemudian Allah menjelaskan bagaimana mereka menjadi tersesat. hal ini karena mereka mengganti firman Allah atau menafsirkannya tidak sesuai dengan yang Allah maksudkan Sebagai bentuk kedustaan mereka terhadap Allah. mereka berkata: \"Nabi Muhammad, kami telah mendengar apa yang telah kau katakan Namun kami tidak akan mentaati Perkataanmu itu.\" ini merupakan kekafiran yang besar dari mereka. mereka juga berpaling dari kitab Allah setelah mereka memahaminya Padahal mereka mengetahui dosa dan siksaan yang akan mereka dapatkan jika melakukan hal tersebut. dan mereka berkata kepada Rasulullah: \"Dengarkanlah apa yang kami katakan, Kamu tidak mendengarkan \". mereka penampakan sikap pengagungan dihadapan Rasulullah, namun dalam hati mereka yang mereka maksud adalah untuk mencemooh Rasulullah, menghina dan membuat tipu daya terhadap agama Islam; demikianlah sikap mereka dalam setiap zaman. Kemudian Allah menunjukkan kepada mereka cara yang pantas dan beradab ketika berinteraksi dengan Rasulullah, dan dalam menjalankan ketaatan dan perintah Allah, serta bersikap lembut ketika menuntut ilmu dengan ucapan: “paham kan lah kami,dan pelan-pelan lah dalam berucap agar kami lebih mudah memahami perkataanmu.\" Namun akibat hati mereka yang keras dan perbuatan kufur yang terus-menerus mereka lakukan menjadikan Allah menjauhkan mereka dari hidayah, sehingga hanya sedikit dari mereka yang beriman seperti Abdullah bin Salam dan para sahabatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. مِّنَ الَّذِينَ هَادُوا۟ (Yaitu orang-orang Yahudi) Yakni wahai orang-orang yang beriman kalian akan ditolong Allah dari orang-orang Yahudi. Potongan ayat ini juga memiliki kemungkinan bahwa ia adalah permulaan pembicaraan, sehingga berarti, diantara orang-orang Yahudi terdapat sekelompok orang yang mengubah perkataan/wahyu. يُحَرِّفُونَ الْكَلِمَ(mereka mengubah perkataan) Yakni dengan memindahkan perkataan/wahyu itu dan menjadikannya ditempat yang lain; atau mentakwilkan dan mengartikannya dengan takwil yang tidak sebenarnya. وَيَقُولُونَ سَمِعْنَا (Mereka berkata: “Kami mendengar”) Yakni kami mendengar perkataanmu. وَعَصَيْنَا (tetapi kami tidak mau menurutinya) Yakni tidak mentaati perintahmu. وَاسْمَعْ غَيْرَ مُسْمَعٍ (Dan (mereka mengatakan pula): “Dengarlah” sedang kamu sebenarnya tidak mendengar apa-apa) Yakni sebagai doa mereka agar rasulullah tidak bisa mendengar. -semoga Allah membinasakan mereka, bagaimana mereka sampai berpaling-. Makna dari kalimat ini adalah dengarkanlah dan semoga engkau tidak bisa mendengar, dan penjelasan hal ini telah disebutkan dalam surat al-Baqarah: 104 pada tafsir kata (راعنا). لَيًّۢا بِأَلْسِنَتِهِمْ (dengan memutar-mutar lidahnya) Yakni membelokkannya dari kebenaran. Yakni mencondongkannya kepada apa yang ada dalam hati mereka sebagai bentuk keberpalingan dan keburukan mereka. وَطَعْنًا فِى الدِّينِ ۚ(dan mencela agama) Yakni dengan mengatakan seandainya dia seorang nabi niscaya dia akan mengetahui bahwa kita mencelanya. Maka Allah mengabarkan hal itu kepada nabi-Nya. وَلَوْ أَنَّهُمْ قَالُوا۟ سَمِعْنَا (Sekiranya mereka mengatakan: “Kami mendengar) Yakni mendengar perkataanmu. وَأَطَعْنَا (dan menurut) Yakni mematuhi perintahmu. وَاسْمَعْ (dan dengarlah) Yakni dengarkanlah apa yang kami katakan. وَانظُرْنَا (dan perhatikanlah kami) Sebagai ganti dari perkataan mereka (راعنا). لَكَانَ خَيْرًا لَّهُمْ (tentulah itu lebih baik bagi mereka) Lebih baik daripada perkataan yang telah mereka ucapkan. وَأَقْوَمَ (dan lebih tepat) Yakni lebih tepat dan utama daripada perkataan mereka yang pertama yaitu (سمعنا وعصينا واسمع غير مسمع وراعنا) وَلٰكِن لَّعَنَهُمُ اللهُ بِكُفْرِهِمْ فَلَا يُؤْمِنُونَ إِلَّا قَلِيلًا (akan tetapi Allah mengutuk mereka, karena kekafiran mereka. Mereka tidak beriman kecuali iman yang sangat tipis) Akan tetapi mereka tidak memilih untuk menempuh jalan yang baik maka dari itulah Allah melaknat mereka. Dan keimanan mereka adalah keimanan terhadap sebagian kitab dan mengingkari sebagian lainnya, dan mengimani sebagian Rasul dan mengingkari sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Sebagian orang-orang Yahudi memalsukan kalam Taurat dengan mentakwilkannya pada tempat yang berbeda dan menafsirkannya dengan maksud yang lain. Mereka berkata kepada Nabi: “Kami telah mendengar perkataanmu (mereka berpura-pura mempercayai nabi) namun kami mengingkari perintahmu”, yaitu mereka mengatakan itu dengan saling berbisik. “Dengarkanlah perkataan kami”, sedangkan kamu tidak bisa mendengar dengan baik, yaitu kamu tidak bisa mendengar mereka, sedangkan mereka melakukan tipu muslihat dengan ucapan itu, bahwa kamu tidak bisa mendengar sesuatu yang buruk, dan mereka berkata “Raa’ina (dari kata Ru’uunah “kebodohan”)” sedangkan mereka menipu beliau seakan berkata “Perhatikanlah kami” dengan memutar-mutar lidah mereka mengubah kebenaran menjadi bermakna buruk dan sesuai maksud hati mereka, serta mencela kenabian dan agama beliau dengan berkata: “Jika benar dia adalah Nabi, maka sungguh dia tahu bahwa kami mengutuknya” Lalu Allah menampakkan kepada beliau kebusukan niat mereka. Kalau mereka berkata kepada Nabi: “Kami mendengar ucapanmu dan menaati perintahmu, dan dengarkanlah ucapan kami, perhatikanlah kami dengan penuh kasih sayang supaya kami memahami apa yang kamu bacakan untuk kami” sebagai ganti ucapan mereka “Raa’inaa” maka sungguh itu lebih baik dan lebih patut bagi mereka daripada ucapan sebelumnya, namun mereka tidak melakukannya. Maka Allah menolak mereka dari rahmatNya, dan melaknat mereka akibat kekufuran mereka terhadap nabi dan Al-Qur’an. Mereka tidak beriman kecuali hanya sedikit, yaitu hanya sebagian, yaitu beriman kepada sebagian kitab dan rasul, namun tidak beriman pada yang lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara orang-orang Yahudi ada yang mengubah perkataan} mengubah kalam yang diturunkan Allah dalam Taurat {dari tempat-tempatnya} dari posisi dan arahnya {Mereka berkata, “Kami mendengar, tetapi kami membangkang”} Kami mendengar perkataanmu namun kami mengingkari perintahmu {“Dengarkanlah,” sedangkan tidak mendengar apa pun} mereka berkata,”Dengarkanlah apa yang kami ucapkan, tetapi kamu tidak mendengar {awasilah kami (dikatakan) dengan memutarbalikkan} memiringkan {lisan mereka dan mencela} mengejek {agama. Seandainya mereka mengatakan, “Kami mendengar dan patuh. Dengarkanlah dan perhatikanlah kami,” tentulah itu lebih baik bagi mereka dan lebih tepat} lebih adil {Akan tetapi, Allah melaknat mereka} Allah menjauhkan mereka dari rahmatNya {karena kekufuran mereka. Mereka tidak beriman, kecuali sedikit sekali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Kemudian Allah menjelaskan tentang kesesatan dan kedurhakaan mereka, serta sikap mereka mendahulukan kebatilan daripada kebenaran dalam FirmanNya, “Yaitu orang-orang Yahudi” di mana mereka itu adalah para ulama kesesatan dari kaum Yahudi, “mereka mengubah perkataan dari tempat-tempatnya,” dengan merubah lafazhnya atau maknanya atau merubah keduanya sekaligus. Dan di antara penyelewengan mereka adalah menempatkan sifat-sifat yang disebutkan dalam kitab-kitab mereka hanya sesuai bagi Nabi Muhammad pada posisi bukan itu yang dimaksudkan (menurut anggapan mereka) dan bukan pula yang dikehendaki dari ayat-ayat itu, akan tetapi yang dimaksudkan olehnya adalah selain beliau dan mereka menyembunyikan hal tersebut. Inilah kondisi mereka dalam ilmu yang merupakan seburuk-buruk kondisi, mereka telah memutar balikkan hakikat yang sebenarnya, dan menempatkan kebenaran pada kebatilan lalu mengingkari kebenaran tersebut. Adapun kondisi mereka pada amal perbuatan dan ketundukan adalah, “mereka berkata, ‘Kami mendengar, tetapi kami tidak mau menurutinya,”maksudnya, kami telah mendengarkan perkataanmu wahai Muhammad dan kami tidak menuruti perintahmu, inilah puncak dari kekufuran, kedurhakaan dan keluar dari ketundukan. Demikian juga, mereka berdialog dengan Nabi dengan seburuk-buruk dialog dan paling jauh dari tatakrama yang baik, mereka berkata. “Dengarkanlah, sedang kamu sebenarnya tidak mendengar apa-apa,”maksud mereka adalah dengarkanlah diri kami sedang kamu tidak mendengar apa-apa yang kamu sukai, akan tetapi kamu mendengar apa yang kamu benci. “Dan mereka mengatakan , Ra’ina” maksud mereka dari hal itu adalah Ru’unah yang berarti kebodohan yang sangat, sebagai ejekan kepada Rasululoh, dan mereka mengira bahwa lafadz tersebut ketika maknanya kemungkinan berbeda dari apa yang mereka maksudkan, bahwasanya lafadz itu membuat samar (tidak jelas) bagi Allah dan RasulNya, lalu mereka memanfaatkan lafadz tersebut di lisan-lisan mereka selalu mengucapkanya demi mencela agama dan menjatuhkan kehormatan Rasul, kemudian mereka mengutarakan hal tersebut secara terang-terangan di antara mereka, karena itulah Allah berfirman, “Dengan memutar-mutar lidahnya dan mencela agama.” Kemudian Allah memberikan pertunjuk kepada mereka menuju perkara yang mengandung kebaikan buat mereka daripada hal tersebut dengan berfirman, “Sekiranya mereka mengatakan, ‘kami mendengar dan menurut, dan dengarlah, dan perhatikanlah kami,’ tentu itu lebih baik bagi mereka dan lebih tepat,” hal itu karena apa yang dikandung oleh perkataan tersebut berupa dialog yang baik dan tata krama yang lembut dalam berdialog dengan Rasululoh dan termasuk dalam ketaatan kepada Allah, tunduk akan perintahnya, serta kesopanan yang baik dari mereka saat menuntut ilmu dimana mereka mengutarakan pertanyaan mereka dengan cara yang baik dan memperhatikan sikap mereka, inilah yang sepatutnya mereka tempuh, akan tetapi tabiat dan karakter mereka tidak bersih, akhirnya mereka berpaling dari hal tersebut lalu Allah mengusir mereka akibat dari kekufuran dan kedurhakaan mereka, oleh karena itu Allah berfirman, “Akan tetapi Allah mengutuk mereka, karena kekafiran mereka. Mereka tidak beriman kecuali iman yang sangat tipis.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻫﺎﺩﻭا} haaduu: orang yahudi, konon karena perkataan mereka {ﺇﻧﺎ ﻫﺪﻧﺎ ﺇﻟﻴﻚ} innaa hudnaa ilaika: kami bertaubat dan kembali {ﻳﺤﺮﻓﻮﻥ} yuharrifuun: tahrif memelesetkan perkataan dari maknanya menuju makna yang salah untuk menyesatkan. {اﻟﻜﻠﻢ} al kalim: perkataan Allah di dalam taurat. {ﻭاﺳﻤﻊ ﻏﻴﺮ ﻣﺴﻤﻊ} wasma’ ghoiro musma’: dengarkan apa yang kamu katakan, Allah tidak akan membuat kami mendengar perkataanmu. Ini adalah bentuk nyata kekafiran mereka. {ﻭﻃﻌﻨﺎ ﻓﻲ اﻟﺪﻳﻦ} wa tho’nan fid diin: mereka mencela Rosul adalah bentuk tikaman yang parah di dalam agama. {ﻭاﻧﻈﺮﻧﺎ} wanzhurnaa: tundalah untuk kami sampai kami paham. {ﻭﺃﻗﻮﻡ} wa aqwam: lebih adil dan lebih lurus. {ﻟﻌﻨﻬﻢ اﻟﻠﻪ ﺑﻜﻔﺮﻫﻢ} la’anahumullah bikufrihim: Allah melaknat kekafiran mereka dengan dihalaunya mereka dari kasih-sayang dan petunjuk-Nya karena kekafiran mereka kepada Rosul. Makna ayat : {مِنَ الَّذِينَ هَادُوا يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ} “Dan dari orang-orang Yahudi yang menyelewengkan perkataan-perkataan dari tempatnya”, maksud dari ‘perkataan-perkataan’ adalah perkataan atau firman Allah dalam Taurat. Dan penyelewengannya adalah dengan memalingkan makna Firman dari maksudnya atau dengan mengganti Firman dan merubahnya sebagai cara untuk menyesatkan manusia dan menjauhkan dari kebenaran yang seharusnya, yaitu beriman dengan Firman Allah, melafalkanya serta beramal dengannya. Kaum Yahudi berkata kepada Nabi Muhammad dan menempuh jalan kekafiran yang sengit, {سَمِعْنَا وَعَصَيْنَا وَاسْمَعْ غَيْرَ مُسْمَعٍ} “kami mendengar dan kami membangkang, dengarkanlah perkataanmu sendiri dan kami tetap tidak mendengar’, maksudnya Allah tidak akan membuat kami mendengar. {وراعنا} “perhatikanlah kami” itu adalah kata yang pada lahirnya adalah berasal dari kata perhatian dan maksudnya adalah bentuk penolakan kepada Nabi. Dan dalam hal ini mereka memaksudkannya الرعونة (dungu) yang mereka katakan kepada Rosul sebagai bentuk hinaan dan celaan kepadanya, semoga Allah melaknat, menghinakan dan memutus asal mereka. {لَيّاً بِأَلْسِنَتِهِمْ وَطَعْناً فِي الدِّينِ} maksudnya adalah karena lisan mereka melenceng dengan kalimat kalimat yang mencela Rosul yang tidak gamblang bagi mereka dan berpaling dari Rosul. Allah berfirman {وَلَوْ أَنَّهُمْ قَالُوا سَمِعْنَا وَأَطَعْنَا وَاسْمَعْ وَانْظُرْنَا} “kalau mereka berkata, ‘Kami mendengar dan kami taat, dengarkanlah kami dan lihatlah kami’, yakni intazhorna ganti dari kata raa’inan, niscaya itu akan lebih baik dan lebih benar bagi mereka, yaitu adil, lebih layak secara adab. Namun mereka tidak mengatakan itu karena Allah telah melaknat dan mengharamkan petunjuk bagi mereka karena kekafiran yang ada pada diri mereka serta tidak mau beriman kecuali hanya secuil, yakni iman yang tidak bermanfaat bagi diri mereka karena sangat sedikit yang mana iman yang secuil itu tidak dapat memperbaiki akhlak mereka, mensucikan jiwa mereka serta tak dapat menyambut mereka menuju kesempurnaan di dunia dan akhirat. Pelajaran dari ayat : • Mengupas tuntas keburukan niat dan amal kaum Yahudi di hadapan Nabi. • Orang yang memiliki keimanan yang secuil tidaklah bermanfaat baginya dalam keadaan {يَا أَيُّهَا الَّذِينَ أُوتُوا الْكِتَابَ آمِنُوا بِمَا نَزَّلْنَا مُصَدِّقاً لِمَا مَعَكُمْ مِنْ قَبْلِ أَنْ نَطْمِسَ وُجُوهاً فَنَرُدَّهَا عَلَى أَدْبَارِهَا أَوْ نَلْعَنَهُمْ كَمَا لَعَنَّا أَصْحَابَ السَّبْتِ وَكَانَ أَمْرُ اللهِ مَفْعُولاً (47) } “Wahai para ahli kitab, berimanlah dengan yang kami turunkan kepada kalian sebelum kami menghapus wajah-wajah dan membalikkan ke arah belakang, atau Kami laknat mereka seperti tatkala kami laknat para ashabus sabt, dan perkara Allah akan terlaksana”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 46: Sebahagian daripada mereka yang jadi Yahudi itu mengubah kalimah-kalimah daripada tempat- tempatnya, dan mereka berkata: \"Kami dengar, tetapi kami durhaka, dan dengarlah! Padahal engkau tidak didengar dan ra'ina\", karena mereka memutar lidah-lidah mereka dan mencela Agama, padahal jika mereka berkata: \"Kami dengar dan kami ta'at, dan dengarlah dan unzhurna\", niscaya adalah lebih baik buat mereka dan lebih lurus; tetapi Allah telah la'natkan mereka dengan sebab kekufuran mereka. Lantaran itu, tidak ada yang beriman (dari) mereka mela- inkan sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala menyebutkan contoh kesesatan mereka dan bersikerasnya mereka di atas kesesatan dan pengutamaan mereka terhadap yang batil. Yakni ulama su' (buruk) di antara mereka. Maksudnya adalah mengubah lafaz, arti kata-kata atau mengubah kedua-duanya, atau mengubah tempat, menambah atau mengurangi dsb. Contoh ayat yang mereka ubah adalah tentang sifat-sifat Nabi Muhammad shallallahu 'alaihi wa sallam. Seperti inilah keadaan mereka dalam hal ilmu; mereka merubah hakikat yang sebenarnya dan menjadikan yang hak sebagai batil, oleh karenanya mereka sesungguhnya menolak yang hak. Sedangkan keadaan mereka dalam hal amal adalah sebagaimana yang disebutkan dalam ayat di atas, mereka mengatakan, \"Kami mendengar, tetapi kami tidak mau menurutinya\". Lebih dari itu, mereka berani berkata buruk di hadapan Rasulullah shallallahu 'alaihi wa sallam dan jauh dari adab seperti yang disebutkan dalam ayat di atas. Maksudnya mereka mengatakan \"Kami mendengar\", namun hati mereka mengatakan, \"Kami tidak mau menuruti.\" Maksudnya mereka mengatakan, \"Dengarlah\", tetapi hati mereka mengatakan, \"Mudah-mudahan kamu tidak dapat mendengarkan (tuli).\" Atau maksudnya, \"Dengarlah dari kami sesuatu yang tidak kamu sukai\". Raa 'ina berarti \"sudilah kiranya kamu memperhatikan kami\". di saat para sahabat menghadapkan kata ini kepada Rasulullah shallallahu 'alaihi wa sallam, orang Yahudi pun memakai kata ini dengan digumam seakan-akan menyebut Raa'ina, padahal yang mereka katakan ialah Ru'uunah yang berarti kebodohan yang sangat, sebagai ejekan kepada Rasulullah. Inilah sebabnya, Allah menyuruh agar para sahabat Beliau menukar perkataan Raa'ina dengan kata \"Unzhurna\" yang juga sama artinya dengan Raa'ina. Sebagai ganti dari apa yang mereka ucapkan. Yakni cukup sampai di sini. Sebagai ganti kata \"Raa'inaa\". Yakni lebih adil. Karena dalam kalimat tersebut terdapat adab bicara yang baik, terlebih di hadapan Rasulullah shallallahu 'alaihi wa sallam serta taat kepada Allah, bersikap baik dalam menuntut ilmu, dan Beliau juga tentu akan memperhatikan mereka dan mendengarkan pertanyaan mereka. Akan tetapi, karena tabi'at mereka yang buruk, mereka berpaling dari saran itu, maka Allah menjauhkan mereka dari rahmat-Nya karena kekafiran dan sikap keras mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 46",
    "description": "Yaitu di antara orang yahudi, yang kebiasaan buruk mereka adalah mengubah perkataan dari tempat-tempatnya seperti menyangkut kenabian Muhammad. Dan mereka berkata, kami mendengar, tetapi kami tidak mau menurutinya. Dan juga mereka mengatakan pula, dengarlah, sedang engkau, nabi Muhammad, sebenarnya tidak mendengar apa pun apa yang mereka katakan. Dan selanjutnya mereka mengatakan pula, ra''ina dengan memutar-balikkan lidahnya dan dengan sengaja mencela ajaran agama. Sekiranya mereka mengatakan, kami mendengar dan patuh, sebagai ganti dari perkataan dan dengarlah, dan perhatikanlah kami, tentulah itu lebih baik bagi mereka dan lebih tepat, karena tidak menimbulkan kemungkinan keliru. Akan tetapi itu tidak mereka lakukan sehingga Allah melaknat mereka, karena kekafiran dan kedurhakaan mereka. Mereka tidak beriman kecuali hanya sedikit sekali. 46. Dan mereka, orang-orang yang rugi dan zalim itu, tidak akan mempunyai pelindung yang dapat menolong dan menyelamatkan mereka dari azab di akhirat nanti selain Allah yang mahakuasa. Barang siapa dibiarkan sesat oleh Allah akibat kesesatannya, tidak akan ada jalan keluar baginya untuk mendapat petunjuk. 46. Dan mereka, orang-orang yang rugi dan zalim itu, tidak akan mempunyai pelindung yang dapat menolong dan menyelamatkan mereka dari azab di akhirat nanti selain Allah yang mahakuasa. Barang siapa dibiarkan sesat oleh Allah akibat kesesatannya, tidak akan ada jalan keluar baginya untuk mendapat petunjuk. Usai melaknat orang-orang yahudi, pada ayat ini Allah menakutnakuti mereka dengan siksaan yang langsung dirasakan. Wahai orangorang yang telah diberi kitab secara utuh! berimanlah kamu kepada apa yang telah kami turunkan, yakni Al-Qur'an, yang kandungan pokoknya membenarkan kitab yang ada pada kamu yaitu taurat, yang disampaikan secara utuh kepada kalian oleh nabi musa. Oleh sebab itu, berimanlah kamu sebelum kami mengubah wajah-wajah-Mu, lalu kami putar ke belakang, atau kami kembalikan kamu ke jalan kesesatan, atau kami akan laknat mereka sebagaimana kami melaknat orang-orang yang berbuat maksiat pada hari sabat (sabtu) pada masa lampau. Dan ketetapan Allah itu pasti berlaku."
  }
]