[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai ahli kitab,berimanlah dan amalkanlah apa yang telah kami turunkan dari al-qur’an, yang membenarkan apa yang ada bersama kalian dari kitab-kitab, sebelum kami menghukum kalian akibat buruknya kelakuan kalian,dimana kami hilangkan muka-muka kalian dan kami pindahkan ke arah punggung, atau kami kutuk orang-orang yang mengadakan kerusakan tersebut dengan mengubah mereka menjadi kera dan babi. Sebagaimana kami telah melaknat orang-orang yahudi, para pelanggar larangan di hari sabtu, mereka orang-orang yang dahulu dilarang untuk berburu ikan pada hari itu, akan tetapi mereka tidak berhenti. Lalu Allah memurkai mereka dan mengusir mereka dari rahmatNYA. Dan ketetapan Allah itu pasti terlaksana dalam seluruh keadaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Wahai orang-orang yang diberi kitab dari kalangan Yahudi dan Nasrani! Berimanlah kalian kepada apa yang Kami turunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam-. Yaitu kitab suci yang datang seraya membenarkan kitab Taurat dan Injil yang ada di tangan kalian, sebelum Kami menghapus indra-indra yang ada di wajah kalian dan menjadikannya di belakang. Atau sebelum Kami menjauhkan mereka dari rahmat Allah, sebagaimana Kami telah menjauhkan orang-orang yang melanggar larangan berburu ikan di hari Sabtu dari rahmat tersebut, kemudian Allah merubah wujud mereka menjadi kera. Perintah dan ketentuan Allah -Ta'ālā- pasti terlaksana, tidak ada yang mustahil bagi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Allah menujukan firman-Nya bagi orang-orang Yahudi dan Nasrani yang ada harapan untuk beriman: “Berimanlah kepada Rasulullah Muhammad dan kepada Alquran yang diturunkan kepadanya yang sesuai dengan kitab-kitab sebelumnya, sebelum aku menimpakan kepada kalian azab akibat perbuatan buruk kalian,dengan membalikkan wajah kalian ke belakang atau menutup kalian menjadi kera dan babi, sebagaimana kami telah mengutuk orang-orang Yahudi yang melanggar kesucian hari Sabtu dengan tetap menangkap ikan Padahal mereka telah dilarang melakukannya, sehingga Allah murka terhadap mereka dan menjauhkan mereka dari rahmat-Nya. Demikianlah kehendak Allah pasti akan terlaksana dan tidak akan ada yang dapat menolaknya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. ءَامِنُوا۟ بِمَا نَزَّلْنَا (berimanlah kamu kepada apa yang telah Kami turunkan) Ini merupakan peringatan Ilahi berupa kemurkaan dari-Nya atas mereka akan datang apabila mereka tetap meneruskan perbuatan mereka, yang mana mereka mengetahui kebenaran namun tidak mengikutinya dan bahkan mengamalkan yang sebaliknya. مِّن قَبْلِ أَن نَّطْمِسَ وُجُوهًا (sebelum Kami mengubah muka(mu)) Yakni mengubah muka kalian dengan menghapus ciri-cirinya sehingga muka tersebut menjadi seperti tengkuk, dengan menghilangkan hidung, mulut, alis, dan mata. فَنَرُدَّهَا عَلَىٰٓ أَدْبَارِهَآ(lalu Kami putarkan ke belakang) Yakni setelah mengubah wajah tersebut lalu memutar kepalanya ke belakang, ke tempat tengkuk mereka. أَوْ نَلْعَنَهُمْ كَمَا لَعَنَّآ أَصْحٰبَ السَّبْتِ ۚ (atau Kami kutuki mereka sebagaimana Kami telah mengutuki orang-orang (yang berbuat maksiat) pada hari Sabtu) Dan kutukan yang diberikan atas orang yang bermaksiat pada hari sabtu adalah dengan mengubah mereka menjadi kera dan babi. Pendapat lain mengatakan yang dimaksud adalah laknat dengan laknat yang sama, sehingga mereka terlaknat dengan laknat tersebut. وَكَانَ أَمْرُ اللهِ مَفْعُولًا(Dan ketetapan Allah pasti berlaku) Yakni pasti datang, kapanpun Allah menginginkannya niscaya akan terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Wahai orang-orang Yahud yang telah diberi kitab, berimanlah kepada apa yang Kami turunkan dalam Al-Qur’an sebagai pembenar (pendukung) kitab Taurat yang ada di sisi kalian (Ini adalah peringatan Tuhan karena murka terhadap mereka) sebelum wajah-wajah (kalian) dihilangkan (menghilangkan dan menghapus tanda-tanda yang ada di wajah) dan membaliknya sehingga menghadap kebelakang, Ini adalah pembalikan wajah secara fisik, namun yang dimaksud di sini adalah pembalikan wajah secara maknawi yaitu membatalkan rencana tipu muslihat yang ditujukan terhadap Islam, lalu kalian akan dibinasakan oleh kesedihan, atau Kami akan menolak kalian dari rahmat Kami dan mengutuk kalian sebagaimana Kami mengutuk Ashabus Sabt dengan mengubahnya menjadi kera dan babi. Perintah Allah itu pasti terjadi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang telah diberi Kitab, berimanlah pada apa yang telah Kami turunkan yang membenarkan apa yang telah ada pada kalian sebelum Kami mengubah wajah-wajah} menghapus indera perasa pada wajah-wajah {lalu Kami putar ke belakang} lalu Kami mengubahnya ke arah belakang {atau Kami laknat mereka sebagaimana Kami melaknat orang-orang pada hari Sabat. Ketetapan Allah berlaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. Allah memerintahkan Ahli kitab dari kaum Yahudi dan Nasrani untuk beriman kepada Rasul Muhammad dan apa yang telah Allah turunkan kepadanya berupa Al-qur’an yang agung yang mencakup isi kitab-kitab lainya dari kitab-kitab sebelumnya yang telah ia benarkan, sesungguhnya kitab-kitab itu mengabarkan tentang Al-qur’an, dan ketika terjadi apa yang di kabarkan, mak ia menjadi bukti akan kabar tersebut, dan sesungguhnya bila mereka tidak beriman kepada Al-qur’an ini, maka sesungguhnya merekapun tidak beriman kepada kitab-kitab yang ada di tanganya, karena kitab-kitab Allah sebagianya membenarkan kitab-kitab yang lain, maka pengakuan beriman kepada sebagianya tanpa mengimani sebagian yang lain adalah sebuah pengakuan yang bathil dan tidak mungkin dapat di percaya. Dan dalam firmanya, “berimanlah kamu kapada apa yang telah kami turunkan yang membenarkan kitab yang ada pada kamu,” Ini adalah sebuah anjuran kepada mereka, dan bahwa yang sepatutnya mereka lakukan adalah bersegera beriman sebelum kaum lain selain mereka, dikarenakan Allah telah mengaruniakan kepada mereka berupa ilmu dan kitab yang mengharuskan apa yang wajib atas mereka adalah lebih besar daripada selain mereka, karena itulah Allah mengancam mereka apabila mereka tidak beriman dalam firmaNya, “Sebelum kami mengubah mukamu, lalu kami putarkan ke belakang,” ini merupakan balsan yang sesuai denga jenis amalan yang mereka perbuat, sebagaimana mereka meninggalkan kebenaran dan lebih mendahulukan kebathilan, akhirnya mereka di beri balasan yang sesuai dengan apa yang telah mereka perbuat yaitu mengubah wajah-wajah mereka sebagaiman mereka merubah kebenaran, dan memutarnya kebelakang punggung mereka yaitu menjadikan suatu hal yang paling jelek. \"atau kami melaknat mereka seperti ashabu sabt\" dengan cara mennjauhkan mereka dari rahmat-Nya dan memberi hukuman kepada mereka dengan dijadikan monyet sebagaimana telah dilakukan kepada saudara mereka yang telah melampaui batas yaitu ashabu sabt, \"maka Kami katakana kepada mereka 'jadilah kalian monyet yang hina\" \"dan segala perintah Allah akan terjadi\" \"sesungguhnya Allah jika berkehendak terhadap sesuatu, Dia berkata \"jadi\" maka jadilah\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {أُوتُوا الْكِتَابَ} : utul kitab: Yahudi dan Nasrani. Yang dimaksud di sini adalah Yahudi saja. {بِمَا نَزَّلْنَا مُصَدِّقاً} bimaa nazzalnaa mushoddiqo: Al Quran. {نَطْمِسَ وُجُوهاً} nathimsa wujuuhan: Kami (Allah) menghilangkan bekas di wajah dan menghapus mata serta melenyapkan warna hitam di mata. {فَنَرُدَّهَا عَلَى أَدْبَارِهَا} Narudduhaa ‘alaa adbaarihaa: Kami (Allah) rubah wajah-wajah menjadi tengkuk, dan tengkuk menjadi wajah. {كَمَا لَعَنَّا أَصْحَابَ السَّبْتِ} kamaa la’annaa ashhaabas sabt: Kami (Allah) laknat mereka dengan merubah mereka menjadi kera sebagai ganjaran dan azab yang hina. {وَكَانَ أَمْرُ اللهِ مَفْعُولاً} wa kaana amrullahi maf’uulaa: Perkara Allah adalah hal yang tidak lah mustahil karena tiada hal yang sulit bagi-Nya. Makna Ayat: Masih di tengah pembicaraan tentang Yahudi yang bertetangga dengan Rosul, maka dalam ayat ini Allah memanggil mereka dengan menyebut ilmu dan ma’rifah, hal itu dikarenakan mereka mempunyai kitab yang berupa Taurat sebagai perintah kepada mereka untuk beriman kepada kitab Al Quran dan beriman kepada Nabi Muhammad yang menerima Al Quran. Karena iman harus satu paket, kepada Al Quran dan kepada Nabi Muhammad juga. Allah berfirman {آمنوا} “berimanlah kalian” kepada Al Quran, kitab pembeda dan pembenar kitab yang telah bersama kalian berisi asas-asas agama, ciri-ciri Rosululloh dan perintah untuk menolongnya. Maka hendaknya kalian beriman kepadanya dan meninggalkan keraguan sebelum terjadi kutukan seperti yang telah terjadi kepada sebagian leluhur kalian menjadi kera dan babi, menimpa kepada kalian. {مِنْ قَبْلِ أَنْ نَطْمِسَ وُجُوهاً} “sebelum kami mengusap wajah-wajah”, maka Kami (Allah) menghilangkan warna hitam di mata, hidung pun rata, mulut dikunci, dan wajah menjadi tengkuk, tengkuk pun mejadi wajah berjalan mundur adalah makna dari firman {فَنَرُدَّهَا عَلَى أَدْبَارِهَا أَوْ نَلْعَنَهُمْ كَمَا لَعَنَّا أَصْحَابَ السَّبْتِ} “Kami merubah wajah-wajah menjadi di belakang atau kami laknat seperti Ashabussabt.” Ashabussabt adalah orang-orang Yahudi yang tidak mengindahkan larangan Allah dan tetap beburu di hari Sabtu. Dan berburu di hari Sabtu adalah haram bagi mereka, mereka tidak peduli dan Allah kutuk mejadi monyet. Dan yang diinginkan oleh Allah akan tercapai, tidak akan berbeda dari kehendak Allah dan tidak terlambat terjadinya karena tidaklah berat bagi Allah segala sesuatupun dan Dia Maha Mampu untuk segalanya. Pelajaran dari ayat : • Semestinya orang yang mempunyai ilmu menjadi lebih dekat dengan hidayah petunjuk Allah tetapi mereka terburu-buru untuk termakan hawa nafsu dari pada mengikuti petunjuk Allah, dengan memilih hal buruk serta terus larut di dalamnya dan ilmu mereka tidak bermanfaat. Dan orang-orang Yahudi tidak diberi petunjuk oleh Allah karena hal itu padahal sudah diserukan oleh Allah agar mereka beriman, namun tetap tidak beriman. • Kewajiban menyegerakan bertaubat sebelum diturunkannya siksa dan kutukan yang mana kedua hal itu adalah hal yang dibenci oleh Allah. • Kutukan dapat ditimpakan di wajah dengan merubah ideologi dan mental, maka bejat dan rusaklah hidup seorang manusia, itulah apa yang menimpa kaum Yahudi di Madinah. Mereka melanggar perjanjian, maka ada yang tewas dan ada pula yang terusir oleh sebab mereka berkepanjangan dalam kekafiran dan memusuhi Nabi serta kaum mukminin."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 47: Hai orang-orang yang diberi Kitab! Berimanlah kepada apa yang Kami telah turunkan, yang pada kamu, sebelum Kami hapus- mana menyetujui apa yang ada kan muka-muka, lalu Kami palingkan dia ke belakangnya, atau Kami la'nati mereka sebagaimana Kami la'nati Ashhabus-Sabt, karena adalah perintah Allah itu akan dikerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena kitab-kitab Allah antara yang satu dengan yang lainnya saling membenarkan, maka jika mereka menolak (tidak beriman) kepada salah satunya, seperti tidak beriman kepada Al Qur'an, sesungguhnya mereka sama saja tidak beriman kepada semua kitab Allah. Pada ayat ini juga terdapat dorongan bagi mereka, yakni sepatutnya mereka lebih dulu beriman kepada Al Qur'an sebelum yang lainnya karena ilmu yang telah diberikan Allah kepada mereka. Oleh karena itu, Allah mengancam dengan menghapus wajah mereka, jika tetap tidak beriman. Maksudnya ialah mengubah muka menjadi polos (tidak ada mata dan hidung) seperti bagian belakang kepala mereka. Hal ini merupakan balasan terhadap amal yang mereka kerjakan. Karena mereka telah meninggalkan kebenaran dan mengutamakan kebatilan serta memutarbalikkan fakta, yang batil menjadi hak dan yang hak menjadi batil, maka mereka diberi balasan dengan dihapuskan wajah mereka sebagaimana mereka telah menghapus kebenaran. Menjadi kera. Lihat surat Al Baqarah ayat 65 dan surat Al A'raaf ayat 163. Sebagaimana firman Allah Ta'ala, \"Sesungguhnya keadaan-Nya apabila Dia menghendaki sesuatu hanyalah berkata kepadanya, \"Jadilah!\" Maka terjadilah ia.\" (Terj. Yaasiin: 82)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 47",
    "description": "Usai melaknat orang-orang yahudi, pada ayat ini Allah menakutnakuti mereka dengan siksaan yang langsung dirasakan. Wahai orangorang yang telah diberi kitab secara utuh! berimanlah kamu kepada apa yang telah kami turunkan, yakni Al-Qur'an, yang kandungan pokoknya membenarkan kitab yang ada pada kamu yaitu taurat, yang disampaikan secara utuh kepada kalian oleh nabi musa. Oleh sebab itu, berimanlah kamu sebelum kami mengubah wajah-wajah-Mu, lalu kami putar ke belakang, atau kami kembalikan kamu ke jalan kesesatan, atau kami akan laknat mereka sebagaimana kami melaknat orang-orang yang berbuat maksiat pada hari sabat (sabtu) pada masa lampau. Dan ketetapan Allah itu pasti berlaku. Boleh jadi karena orang-orang yahudi merasa sebagai umat pilihan tuhan, sehingga mereka beranggapan kalaupun mereka membuat kedurhakaan pasti akan diampuni oleh Allah, maka dalam ayat ini mereka diperingatkan dengan keras bahwa hal itu tidak akan terjadi. Sesungguhnya Allah yang mahaperkasa tidak akan pernah mengampuni dosa karena mempersekutukan-Nya, yakni dosa syirik, dan dia mengampuni apa, yakni dosa, yang selain syirik itu bagi siapa yang dia kehendaki. Barang siapa mempersekutukan Allah dengan yang lain, maka sungguh, dia telah berbuat dosa yang besar dan menganiaya diri sendiri."
  }
]