[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah tidak mengampuni dan tidak memaafkan orang yang mempersekutukanNya dengan sesorang dari makhlukNYA, atau kafir dengan jenis kekafiran apa saja dari kufur akbar; dan DIA mengampuni dan memaafkan dosa-dosa selain kesyirikan bagi siapa yang DIA kehendaki dari hamba-hambaNYA. Dan barangsiapa mempersekutukan sesuatu dengan Allah, sesungguhnya ia telah mengerjakan perbuatan dosa yang sangat besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Sesungguhnya Allah tidak akan mengampuni dosa orang yang menyekutukan-Nya dengan makhluk-Nya. Dan Dia akan mengampuni dosa-dosa lain selain syirik bagi orang yang Dia kehendaki berdasarkan kemurahan-Nya, atau menyiksa orang yang Dia kehendaki karena dosa-dosa tersebut sesuai dengan kadar dosa yang telah diperbuatnya berdasarkan keadilan-Nya. Barangsiapa yang menyekutukan Allah dengan sesuatu, ia telah membuat dosa besar yang tidak terampuni bila orang itu mati dalam kondisi tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. setelah Allah menjelaskan bahwa ancamannya pasti akan terjadi kemudian Allah menyebutkan bahwa ancaman ini diperuntukkan bagi orang-orang yang kafir. Dia tidak akan mengampuni dosa syirik dari orang yang melakukannya tanpa bertaubat dan beriman; dan dia mengampuni selain dosa syirik, baik itu berupa dosa kemaksiatan yang besar atau yang kecil sebagai bentuk kemurahan Allah meski pelakunya belum bertobat, namun ampunan ini tidak untuk seluruh orang-orang beriman. dan Siapakah yang lebih besar dosa dan kedustaannya daripada orang yang menyamakan antara makhluk yang penuh dengan kekurangan dengan Sang Pencipta yang Maha Sempurna?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. إِنَّ اللهَ لَا يَغْفِرُ أَن يُشْرَكَ بِهِۦ (Sesungguhnya Allah tidak akan mengampuni dosa syirik) Yakni orang yang mati dalam kesyirikan dan belum bertaubat maka tidak ada kemungkinan ampunan atas dosa syiriknya. Adapun orang yang selain pelaku syirik seperti pelaku kemaksiatan dari kalangan orang-orang Islam maka mereka dibawah kehendak Allah, jika Allah akan mengampuni orang yang Dia kehendaki dan mengazab orang yang Dia kehendaki, akan tetapi Allah juga mengabarkan bahwa Dia mengampuni dosa-dosa kecil selama seseorang menjauhi dosa-dosa besar (lihat ayat 31 dalam surat ini)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Sesungguhnya Allah tidak mengampuni orang yang mati dalam keadaan musyrik dan tidak mau bertaubat dari kesyirikannya, namun Dia mengampuni dosa-dosa selain syirik bagi hamba-hambaNya yang dikehendaki untuk diampuni seperti kemaksiatan orang-orang yang melukai kaum mukminin. Barangsiapa menyekutukan Allah dengan tuhan lainnya, maka sungguh dia telah melakukan dosa besar dan melakukan dusta yang sangat berat, sehingga dia layak mendapatkan siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah tidak akan mengampuni (dosa) karena mempersekutukanNya, tetapi Dia mengampuni dosa selain itu} dosa-dosa selain syirik {bagi siapa saja yang Dia kehendaki. Siapa pun yang mempersekutukan Allah sungguh telah berbuat dosa yang sangat besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. Allah mengabarkan bahwasanya dia tidak akan mengampuni seseotang yang menyekutukaNya dari sesuatupun dari para makhluk dan dia mengampui dosa-dosa kecuali syirik, baik dosa yang kecil maupun yang besar. Yang demikian itu menurut kehendaknya dalam mengampuninya, yaitu bila hikmahnya telah mengampuninya. Adapun dosa-dosa selain syirik, sesungguhnya Allah telah menjadikan baginya banyak sekali sebab-sebab pengampunanya, seperti kebaikan-kebaikan yang menggugurkan dosa, musibah-musibah yang menghapus dosa di dunia, alam barzah dan hari kiamat, atau seperti doa sebagian kaum Mikminin untuk sebagian yang lain, atau seperti syafaatnya para pemberi syafaat, dan lebih dari itu semua adalah rahmat Allah, di mana yang paling berhak mendapatkanya adalah para ahli iman dan tauhid. Berbedea halnya dengan kesyirikan , sesungguhnya seorang musyirik telah menutup pintu-pintu ampunan bagi dirinya sendiri, dan juga telah mengnci rapat pintu-pintu rahmat, sehingga tidak berguna bagi mereka segala ketaatan selain dari ketahuidan, dan musibah-musibah yang tidak bermanfaat sama sekali baginya, \"Maka kami tidak mempunyai pemberi syafa’at seorangpun, dan tidak pula mempunyai teman yang akrab,\"(Asy-Syu’ara:100-101). Oleh karena itulah Allah berfirman, “Barangsiapa yang mempersekutukan Allah, maka sungguh ia telah berbuat dosa yang besar,” maksudnya, ia telah berbuat kejahatan yang besar, dan kezhaliman apa lagi yang paling besar dari orang yang menyamakan antara seorang makhluk yang berasal dari tanah, yang memiliki kekurangan dari segala aspeknya, di mana dirinya sendiri sangat fakir dari segala sisi, yang tidak memiliki apa pun bagi dirinya apalagi untuk orang yang menyembahnya, di mana dia tidak mampu mendatangkan manfaat, bahaya, dan tidak pula mampu mematikan, menghidupkan, apalagi membangkitkan, dengan sang Pencipta segala sesuatu, yang Mahasempurna dari segala aspeknya, di mana DiriNya Mahakaya dan tidak butuh kepada seluruh makhluk, yang pada TanganNya ada manfaat, bahaya, pemberian maupun peniadaan, dan yang tiada suatu nikmat pun yang dirasakan oleh seluruh makhluk kecuali dariNya. Maka adakah suatu hal yang lebih besar dari kezhaliman itu? Oleh karena itu Allah menetapkan bahwa pelakunya abadi dalam siksa neraka dan diharamkan mendapatkan pahala, \"Sesungguhnya orang yang mempersekutukan (sesuatu dengan) Allah, maka pasti Allah mengharamkan kepadanya surga, dan tempatnya ialah neraka, tidaklah ada bagi orang-orang zalim itu seorang penolongpun.\" (Al-Maidah:72). Ayat yang mulia ini berlaku bagi selain orang yang bertaubat, adapun orang yang bertaubat, maka akan diampuni baginya, baik dosa syirik ataupun dosa selainnya, sebagaimana Allah berfirman, \"Katakanlah: “Hai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri, janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dialah Yang Maha Pengampun lagi Maha Penyayang.\" (Az-Zumar:53) yaitu bagi orang yang bertaubat dan kembali kepadaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {لا يَغْفِرُ} la yaghfir: tidak dihapus dosanya dan tidak pula ditinggalkan dari siksaan. {أَنْ يُشْرَكَ بِهِ} an yusyriku bihi: menyembah Allah bersama dengan menyembah selain-Nya dengan mencintai selain Allah, mengagungkan, meyembelih dan beribadah kepadanya, semisal dengan berdoa kepada selain-Nya, meminta pertolongan, menyembelih serta bernazar kepada selain Allah. {وَيَغْفِرُ مَا دُونَ ذَلِكَ} wa yaghfiru maa duuna dzaalika: yaitu mengampuni dosa selain kesyirikan dan kekafiran. {لِمَنْ يَشَاءُ} liman yasyaa’: ampunan bagi orang yang dikehendaki oleh Allah dari semua dosa selain kekafiran dan kesyirikan. {افْتَرَى إِثْماً عَظِيماً} iftaroo itsman ‘azhimaa: iftaroo artinya membuat-buat , berdusta yang menyesatkan karena beribadah kepada selian Allah. itsman ‘azhimaa artinya dosa yang besar. Makna Ayat: Diriwayatkan bahwa tatkala diturunkan sebagian surat Az Zumar {قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لا تَقْنَطُوا مِنْ رَحْمَةِ اللهِ إِنَّ اللهَ يَغْفِرُ الذُّنُوبَ جَمِيعاً} “Katakanlah, wahai hamba-hambaku yang berlebihan terhadap dirinya sendiri, janganlah berputus asa dari rahmat Allah, sesungguhnya Allah mengampuni segala dosa”, bediri seorang laki-laki dan berkata, “Bagaimana denga syirik, wahai Rosul?”, maka Nabi membenci hal itu dan turunlah ayat, {إِنَّ اللهَ لا يَغْفِرُ أَنْ يُشْرَكَ بِهِ وَيَغْفِرُ مَا دُونَ ذَلِكَ لِمَنْ يَشَاءُ} “Sesungguhnya Allah tidak mengampuni jika Allah disekutukan dan mengampuni yang selain syirik untuk yang dikehendaki-Nya.”, Allah mengabarkan tentang dirinya yang tidak mengampuni dosa yang disebut dengan syirik dan kekafiran. Dan adapun dosa-dosa selainnya, baik dosa besar ataupun dosa kecil, maka berada di bawah kehendak Allah. Jika Allah menghendaki untuk mengampuni pelaku dosa, maka dia tidak akan disiksa karena dosa-dosa itu. Dan apabila Dia ingin, Dia akan menganyiksa pelaku dosa itu. Karena barang siapa yang telah melakukan kesyirikan, maka dia telah melakukan kedustaan yang sangat besar karena telah beribadah kepada suatu hal yang tidak berhak untuk disembah dan tidak berhak untuk dianggap mempunyai sifat-sifat ketuhanan. Oleh karenanya, pelaku kesyirikan serupa dengan penutur persaksian palsu dan praktisi kebatilan, dari sinilah dosanya besar. Pelajaran dari ayat : • Dahsyatnya dosa kesyirikan dan kekafiran dan yang mana dosa-doa selainnya adalah di bawah yang dua dosa ini. • Syirik adalah dosa yang tidak terampuni bagi orang yang mati tanpa taubat dari dosa ini. • Pelaku semua dosa selain syirik dan kekafiran hendaknya tidak berputus asa dari ampunan Allah namun harus tetap takut karenanya. • Syirik adalah kedustaan dan pelakunya adalah penutur kedustaan dan pelaksananya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 48: Sesungguhnya Allah tidak akan mengampuni yang la disekutui, tetapi la akan mengampuni selain dari itu bagi siapa yang la kehendaki; dan barang siapa menyekutukan Allah maka sesungguhnya ia telah membikin satu dosa yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan memasukkannya ke surga tanpa azab, atau jika Dia menghendaki, maka Dia mengazab pelaku maksiat di bawah syirk (yakni orang mukmin yang berbuat maksiat) karena dosa-dosanya kemudian Dia masukkan ke dalam surga. Dosa-dosa yang berada di bawah syirk telah Allah adakan sebab-sebab yang menghapusnya, contoh: tobatnya, istighfarnya, amal salehnya, musibah yang menimpanya di dunia, azab di alam barzakh atau di hari kiamat, peristiwa dahsyat di hari kiamat, dan dengan doa kaum mukmin antara yang satu dengan lainnya, syafaat dari orang-orang yang diberi izin memberi syafaat dan dengan rahmat (kasih sayang) Allah Ta'ala yang diberikan-Nya kepada orang yang beriman dan bertauhid. Berbeda dengan syirk, di mana pelakunya telah menutup pintu ampunan dan rahmat bagi dirinya, oleh karenanya amal baiknya tidaklah bermanfaat, demikian juga musibah yang menimpanya, dan pada hari kiamat mereka tidak memperoleh syafaat. Hal itu, karena di dalam syirk, pelakunya menyamakan antara makhluk yang lemah dari berbagai sisi dan memiliki kekurangan dengan Al Khaaliq yang Maha Sempurna dari berbagai sisi, Yang Maha Kaya tidak memerlukan makhluk-Nya, di mana tidak ada satu pun kenikmatan yang diterima makhluk kecuali berasal dari-Nya. Namun demikian, ayat ini tertuju kepada pelaku syirk yang tidak bertobat, adapun jika ia bertobat, maka Allah Subhaanahu wa Ta'aala mengampuni syirk dan dosa-dosa di bawahnya sebagaimana firman Allah: Katakanlah: \"Wahai hamba-hamba-Ku yang malampaui batas terhadap diri mereka sendiri! Janganlah kamu berputus asa dari rahmat Allah. Sesungguhnya Allah mengampuni dosa-dosa semuanya. Sesungguhnya Dia-lah yang Maha Pengampun lagi Maha Penyayang.\" (Terj. Az Zumar: 53)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 48",
    "description": "Boleh jadi karena orang-orang yahudi merasa sebagai umat pilihan tuhan, sehingga mereka beranggapan kalaupun mereka membuat kedurhakaan pasti akan diampuni oleh Allah, maka dalam ayat ini mereka diperingatkan dengan keras bahwa hal itu tidak akan terjadi. Sesungguhnya Allah yang mahaperkasa tidak akan pernah mengampuni dosa karena mempersekutukan-Nya, yakni dosa syirik, dan dia mengampuni apa, yakni dosa, yang selain syirik itu bagi siapa yang dia kehendaki. Barang siapa mempersekutukan Allah dengan yang lain, maka sungguh, dia telah berbuat dosa yang besar dan menganiaya diri sendiri perilaku kaum yahudi sungguh aneh, mereka mengaku mendapat petunjuk dan merasa sebagai umat pilihan Allah, tetapi mereka justru durhaka. Tidakkah engkau memperhatikan orang-orang yang menganggap dirinya suci, yakni orang yahudi' sebenarnya Allah yang maha mengetahui dan mahabijaksana yang berhak menyucikan siapa yang dia kehendaki dan mereka yang disucikan itu tidak dizalimi sedikit pun."
  }
]