[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak mengetahui (wahai rasul), perkara orang-orang yang memuji-muji diri mereka sendiri dan perbuatan-perbuatan mereka, dan menyifatinya dengan kesucian dan bebas dari keburukan? Allah lah semata yang memuji siapa saja yang dikehendakiNYA dari hamba-hambaNYA, karena Dia mengetahui hakikat amal perbuatan mereka sebenarnya,dan mereka tidak mengalami pengurangan pada amal perbuatan mereka sedikitpun,meski sekecil benang yang ada di belahan biji kurma."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Tidakkah kamu -wahai Rasul- mengetahui perihal orang-orang yang gemar memuji (menganggap suci) diri mereka sendiri dan amal perbuatan mereka? Padahal hanya Allah yang berhak memuji hamba-hamba-Nya yang Dia kehendaki, karena Dia Maha Mengetahui rahasia-rahasia hati. Dan Dia tidak akan mengurangi pahala amal perbuatan mereka sedikit pun, meski sebesar serat yang ada di biji kurma."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. kemudian Allah beriman kepada rasulnya untuk menghindari orang-orang Yahudi yang menganggap diri mereka suci: Hai Muhammad, Lihatlah pada orang-orang yang menganggap diri mereka suci dengan mengatakan, “Kami adalah anak-anak Allah dan para kekasih-Nya.” (al-Maidah: 18), dan mengatakan, “Tidak akan masuk surga kecuali orang-orang Yahudi dan Nasrani.\" (al-Baqarah: 111). Itu semata-mata hanyalah klaim tanpa dasar, sebab kesucian diri hanya dapat diraih dengan keimanan dan amal sholeh, sedangkan mereka tidak memiliki hal tersebut akibat kekafiran dan kezaliman mereka. Allah sekali-kali tidak menzalimi mereka sedikitpun meski hanya sekedar sebesar kulit biji kurma."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. أَلَمْ تَرَ إِلَى الَّذِينَ يُزَكُّونَ أَنفُسَهُم ۚ (Apakah kamu tidak memperhatikan orang yang menganggap dirinya bersih?) Yakni dengan mengaku-ngaku memiliki berbagai keutamaan dalam dirinya padahal ia tidak memilikinya, seperti perkataan orang Yahudi dan Nasrani: kami adalah anak-anak dan kekasih Allah, atau perkataan sebagian orang: kami tidak mempunyai dosa, kami layaknya bayi yang baru lahir. Dan pendapat lain mengatakan yakni sanjungan dan pujian sebagian orang kepada orang lain. بَلِ اللهُ يُزَكِّى مَن يَشَآءُ(Sebenarnya Allah membersihkan siapa yang dikehendaki-Nya) Karena Dia yang Maha mengetahui siapa dari hamba-Nya yang memiliki kesucian diri dan siapa yang tidak memilikinya, maka hendaklah para hamba meninggalkan anggapan mereka bahwa mereka suci sebagai bentuk kecongkakan dan pembanggaan diri. وَلَا يُظْلَمُونَ فَتِيلًا(dan mereka tidak aniaya sedikitpun) Makna (الفتيل) yakni benang yang ada di belahan biji kurma, Allah menjadikannya sebagai perumpamaan hal yang sedikit. Dan makna dari ayat ini bahwa mereka yang menganggap diri mereka suci akan disiksa atas anggapan mereka sesuai dengan dosa yang dilakukan ini dan mereka tidak dizalimi sedikitpun dengan penambahan siksaan diatas kadar yang berhak mereka dapatkan meski dengan kezaliman sebasar benang yang terdapat di biji kurma tersebut, sebagaimana pahala yang berhak mereka dapatkan tidak dikurangi sedikitpun meski sebesar benang itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Apakah kamu tidak melihat orang-orang yang menyanjung diri sendiri dengan bathil, yaitu dengan menganggap bahwa keutamaan-keutamaan itu hanya milik mereka seperti ucapan orang-orang Yahudi dan Nasrani: “Kami adalah putera-putera dan kekasih-kekasih Allah” dan perkataan sebagian orang: “Kami tidak memiliki dosa sama sekali, kami seperti anak kecil”. Katakanlah kepada mereka wahai Nabi: “Janganlah kalian memuji diri sendiri. Hanya Allahlah yang Maha Mengetahui orang yang layak disucikan (dibersihkan dari dosa) dan mereka yang tidak tidak dizalimi dengan diberi tambahan dan tidak dikurangi sedikitpun pahala mereka meskipun hanya seukuran fatil (yaitu serabut yang ada dalam biji kurma)” Ayat ini turun untuk lelaki-lelaki Yahudi yang mendatangi Rasulallah SAW dengan anak-anak mereka, lalu mereka bersumpah bahwa mereka seperti anak-anak mereka yang mana dosa-dosa mereka telah dilebur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu melihat orang-orang yang menganggap dirinya suci} meninggikan diri dan amal mereka {Sebenarnya Allah menyucikan siapa saja yang Dia kehendaki dan mereka tidak dizalimi} tidak dikurangi pahalanya {sedikit pun} sekecil serabut yang ada pada biji kurma"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Ini merupakan keheranan dari Allah kepada hamba-hambaNya dan suatu celaan bagi orang-orang yang menyucikan diri mereka dari kaum Yahudi dan Nasrani serta orang-orang yang sejalan dengan mereka, yaitu setiap orang yang menyucikan dirinya sendiri dengan suatu perkara yang tidak ada padanya, yang demikian itu bahwa Yahudi dan Nasrani berkata, \"“Kami ini adalah anak-anak Allah dan kekasih-kekasih-Nya”\" (Al-Maidah:18). Mereka juga berkata, \"“Sekali-kali tidak akan masuk surga kecuali orang-orang (yang beragama) Yahudi atau Nasrani”.\" (Al-Baaqarah:111) Ini merupakan pengakuan kosong belaka yang tidak memiliki landasan apa pun, dan yang ada landasannya adalah apa yang telah Allah tegaskan dalam al-Quran dalam FirmanNya, (Tidak demikian) bahkan barangsiapa yang menyerahkan diri kepada Allah, sedang ia berbuat kebajikan, maka baginya pahala pada sisi Tuhannya dan tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati. (Al-Baqarah:112). Mereka itulah orang-orang yang Allah sucikan, oleh karena itulah Allah berfirman dalam ayat ini, “Sebenarnya Allah membersihkan siapa yang dikehendakiNya” yaitu dengan iman dana mal shalih, dengan berlepas diri dari akhlak yang tercela dan menghiasi diri dengan akhlak yang luhur. Adapun mereka itu walaupun telah menyucikan diri atas dasar sangkaan mereka bahwa mereka berada pada suatu (derajat) dan bahwa pahala itu hanya milik mereka sendiri, maka sesungguhnya mereka hanyalah para pendusta, dan mereka tidak mendapatkan bagian sedikit pun dari pahala orang-orang yang suci, hal itu disebabkan oleh kezhaliman dan kekufuran mereka, dan bukannya kezhaliman dari Allah terhadap mereka, oleh karena itu Allah berfirman, “Dan mereka tidak dianiaya sedikit pun,” hal ini untuk menegaskan keumuman (suatu perkara), artinya, mereka sedikit pun tidak dizhalimi, meski hanya seukuran biji yang ada pada belahan atom atau sesuatu yang dibuang dari kotoran tangan dan selainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: تزكية النفس tazkiyatun nufuus: pembersihan diri dari dosa dan kesalahan. {يُزَكِّي مَنْ يَشَاءُ} yuzakii man yasyaa’: Allah membersihkan dosa orang-orang yang dikehendaki dari hamba-hambanya dengan petunjuk dari-Nya, agar beramal dengan perbuatan yang dapat membersihkan jiwa serta bantuan-Nya agar dapat beramal dengannya. الفتيل al Fatiil: benang putih yang terdapat di dalam benih atau kotoran yang melilit di antara jari seseorang di tangan atau di badannya dan itu adalah sesuatu yang sangat sepele. Makna Ayat: Konteks ayat kembali menuju tema tentang ahli kitab, Allah berfirman kepada Rosul-Nya dan kaum mukminin : {أَلَمْ تَرَ إِلَى الَّذِينَ يُزَكُّونَ أَنْفُسَهُمْ} “Apakah kalian tidak melihat orang-orang yang menganggap suci dirinya.” ini adalah ungkapan untuk sebuah rasa aneh dan nyleneh, karena seharusnya manusia tidak menganggap suci dirinya sampai ada orang yang berpendapat demikian. Para kaum Yahudi dan Nasrani berkata : {نَحْنُ أَبْنَاءُ اللهِ وَأَحِبَّاؤُهُ} “Kami adalah anak-anak Allah” dan berkata : {وَقَالُوا لَنْ يَدْخُلَ الْجَنَّةَ إِلا مَنْ كَانَ هُوداً أَوْ نَصَارَى} “tidak akan masuk surga kecuali orang Yahudi dan Nasrani”. Kaum Yahudi berkata {لَنْ تَمَسَّنَا النَّارُ إِلا أَيَّاماً مَعْدُودَاتٍ} “Kami tidak akan masuk neraka kecuali beberapa hari yang bisa dihitung” dan klaim batil mereka yang lain. Ketika Allah mengingkari hal ini yang mana mereka hidup larut di dalamnya, Allah menghalangi mereka dari iman dan masuk Islam serta Allah mengabarkan bahwa Allah lah yang berhak untuk menganggap siapa yang suci dari para hamba-Nya. Dan yang demikian dibuktikan dengan petunjuk-Nya menuju iman dan amal sholih yang akan membuat jiwa manusia mereka menjadi suci. Allah berfirman : {بَلِ اللهُ يُزَكِّي مَنْ يَشَاءُ وَلا يُظْلَمُونَ فَتِيلاً} “Bahkan Allah lah yang mensucikan orang yang dikehendaki-Nya, dan mereka tidak akan dizalimin sedikitpun” sangat sedikit dan tidak akan ditambah dalam takaran dosa seorang hamba serta tidak dikurangi kebaikannya. Pelajaran dari ayat : • Haramnya seseorang itu menganggap suci dirinya sendiri dan berbangga-bangga dengan yang demikian untuk memperoleh kekuasaan atau untuk menghindar dari kewajiban ibadah. • Allah mensucikan hamba-Nya dengan pujian di hadapan penduduk langit dan mensucikan seorang hamba dengan taufik serta iman untuk diamalkan; semisal sholat, sedekah dan ketaatan lain yang sesuai syariat untuk mensucikan dan membersihkan jiwa manusia. • Keadilan hisab (perhitungan) dan balasan di hari kiamat berdasakan firman Allah : {وَلا يُظْلَمُونَ فَتِيلاً} “dan mereka dizalimi sedikitpun”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 49: Tidakkah engkau lihat (kebodohan) orang-orang yang membersihkan dirinya? Bahkan Allah akan bersihkan siapa-siapa yang Ia kehendaki, dan mereka tidak akan dianiaya walaupun sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud di sini ialah orang-orang Yahudi dan Nasrani yang menganggap diri mereka bersih. Lihat surat Al Baqarah ayat 80 dan ayat 111 dan surat Al Maa-idah ayat 18. Yakni dengan iman dan amal saleh. Seperti pernyataan-Nya terhadap orang-orang yang beriman (memeluk Islam) dan beramal saleh, \"(Tidak demikian) bahkan barang siapa yang menyerahkan diri kepada Allah, sedangkan ia berbuat kebajikan, maka baginya pahala pada sisi Tuhannya. Tidak ada kekhawatiran terhadap mereka dan tidak (pula) mereka bersedih hati.(Terj. Al Baqarah: 112)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 49",
    "description": "Perilaku kaum yahudi sungguh aneh, mereka mengaku mendapat petunjuk dan merasa sebagai umat pilihan Allah, tetapi mereka justru durhaka. Tidakkah engkau memperhatikan orang-orang yang menganggap dirinya suci, yakni orang yahudi' sebenarnya Allah yang maha mengetahui dan mahabijaksana yang berhak menyucikan siapa yang dia kehendaki dan mereka yang disucikan itu tidak dizalimi sedikit pun setelah menjelaskan sifat buruk orang-orang yahudi tersebut, Allah mengingatkan kaum muslim lebih cermat lagi. Perhatikanlah dengan seksama, betapa mereka orang-orang yahudi itu mengada-adakan dusta terhadap Allah! dan cukuplah perbuatan mengada-ada dengan dusta itu menjadi dosa yang nyata bagi mereka."
  }
]