[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kalian berikan (wahai para wali), harta-harta kepada orang-orang yang akan menghamburkannya dari orang-orang lelaki, wanita dan anak-anak yang berada di bawah pengawasan kalian, sehingga mereka nanti akan mempergunakannnya pada cara-cara yang tidak sepatutnya. Harta-harta itu adalah merupakan tumpuan bagi kehidupan manusia. Dan berilah nafkah kepada mereka dari harta mereka dan berilah mereka pakaian darinya, dan katakanlah kepada mereka perkataan yang baik-baik dalam bentuk tutur kata yang indah dan perilaku yang baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Dan janganlah kalian -wahai para wali- menyerahkan harta kepada orang-orang yang tidak pandai membelanjakannya. Karena Allah menjadikan harta sebagai penopang kemaslahatan dan urusan kehidupan manusia, sementara mereka tidak cakap untuk mengurus dan menjaganya. Dan berikanlah nafkah serta pakaian kepada mereka dari harta tersebut. Ucapkanlah kata-kata yang baik kepada mereka. Dan berikanlah janji yang baik kepada mereka, bahwa kalian akan menyerahkan harta mereka setelah mereka dewasa dan mampu mengelolanya dengan baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَلَا تُؤْتُوا۟ السُّفَهَآءَ أَمْوٰلَكُمُ (Dan janganlah kamu serahkan kepada orang-orang yang belum sempurna akalnya, harta (mereka yang ada dalam kekuasaanmu)) Yang dimaksud disini adalah anak-anak dan orang yang lemah akalnya yang tidak mengetahui hal-hal yang dapat memperbaiki hartanya dan tidak dapat menjauhi hal-hal yang dapat menghancurkan dan menghilangkan hartanya. الَّتِى جَعَلَ اللهُ لَكُمْ قِيٰمًا (yang dijadikan Allah sebagai pokok kehidupan) Yakni harta yang dijadikan penopang urusan-urusan kalian, karena apabila harta itu hilang atau rusak maka mereka akan menjadi tanggungan bagi kalian. وَارْزُقُوهُمْ فِيهَا وَاكْسُوهُمْ (Berilah mereka belanja dan pakaian (dari hasil harta itu)) Yakni mereka sebagian harta mereka untuk menafkahi diri mereka dan mencukupi kebutuhan pakaian mereka. وَقُولُوا۟ لَهُمْ قَوْلًا مَّعْرُوفًا (dan ucapkanlah kepada mereka kata-kata yang baik) Yakni berupa janji yang baik dengan mengatakan apabila kalian telah dewasa maka kami akan mengembalikan harta ini kepada kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ayat ini merupakan perintah untuk menjaga harta agar tak diserahkan dan diatur oleh seorang yang belum sempurna akalnya. Maka, pemeliharaan ilmu dari seorang yang berusaha merusaknya dan mengutak-atiknya adalah perintah yang lebih utama, karena ilmu lebih penting daripada harta. Dan melarang orang yang berhak untuk mendapatkan harta sama dzalimnya dengan memberi harta kepada yang tidak mempunyai kapabilitas dalam mengelolanya. 2 ). Banyak orang menghabiskan hartanya untuk berfoya-foya dengan kesenangan duniawi semata; rokok, hal-hal yang haram, perayaan bid’ah yang merusak agama, dan segala hal yang sifatnya sia-sia. Lalu, jikalau ada panggilan untuk berinfak di jalan Allah, mereka mengaku-ngaku bahwa hartanya tidak cukup dan kurang, berbohong pada Yang Maha Kaya, sungguh tercela perbuatan golongan ini. 3 ). Allah berfirman dalam ayat ini: { وَلَا تُؤْتُوا السُّفَهَاءَ أَمْوَالَكُمُ } “Dan janganlah kamu serahkan kepada orang yang belum sempurna akalnya harta kamu” Allah menisbahkan harta itu pada yang memegangnya dan mengelolanya, meskipun harta itu sejatinya adalah milik orang yang belum sempurna akalnya. Dan ketika mereka, yang belum sempurna akalnya, menjadi matang dan dewasa barulah Allah menisbahkan penamaan harta tersebut pada mereka, Allah SWT berfirman: { فَإِنْ آنَسْتُمْ مِنْهُمْ رُشْدًا فَادْفَعُوا إِلَيْهِمْ أَمْوَالَهُمْ } “Kemudian jika menurut pendapatmu mereka telah cerdas (pandai memelihara harta), maka serahkanlah kepada mereka hartanya”. (QS: Ali ‘imron: 6) 4 ). Dalam ayat ini Allah memerintahkan agar memberi mereka, yang belum sempurna akalnya, uang belanja dan pakaian dari hasil pengelolaan harta mereka, dan bukan dari harta pokoknya, Allah SWT berfirman : { وَارْزُقُوهُمْ فِيهَا } “Berilah mereka belanja dan pakaian (dari hasil harta itu)”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Dan janganlah kalian memberi orang yang tidak baik dalam mengatur harta mereka karena masih kecil, boros, dan masih lemah akalnya. Harta-harta yang digunakan untuk mencukupi kehidupan mereka. Mereka memberi balasan dari harta mereka berupa rejeki untuk membelanjakannya untuk diri mereka sendiri. Ucapkanlah perkataan yang baik kepada mereka, dan berilah mereka janji yang bagus dengan memberi dorongan mereka ketika dewasa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Janganlah kalian serahkan} berikan {kepada orang-orang yang belum sempurna akalnya} orang-orang yang tidak bisa membagi {harta kalian yang dijadikan Allah sebagai pokok kehidupan kalian} pondasi kehidupan kalian {Berilah mereka belanja dari harta itu} berilah mereka makan dari harta itu {dan pakaian dan ucapkanlah kepada mereka ucapan yang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. Adalah kata jamak dari (orang yang tidak sempurna akalnya) yang artinya orang tidak becus dalam membelanjakan hartnya; baik karena tidak ada akalnya seperti orang gila atau idiot atau semacamnya, atau karena belum sempurna akalnya seperti anak kecil dan orang yang belum dewasa. Allah melarang para wali untuk menyerahkan kepada mereka harta-harta mereka karena takut disia-siakan dan dihabiskan. Karena Allah menjadikan harta itu untuk memenuhi kebutuhan hamba-hambaNya dalam kemaslahatan agama maupun dunia mereka. Dan mereka itu tidaklah pandai dalam mengurus (dan membelanjakan)harta tersebut dan memeliharanya, oleh karena itu Allah memerintahkan kepada wali(nya) agar tidak menyerahkan harta mereka kepada mereka. Akan tetapi ia harus menafkahi mereka dari harta iru, kepada hal-hal yang berkaitan dengan kebutuhan-kebutuhan mereka, dunia maupun akhirat mereka, dan agar para wali berkatakepada mereka dengan perkataan yang baik, yaitu dengan berjanji kepada mereka apabila mereka meminta harta mereka itu bahwa para wali itu akan memberikannya setelah mereka dewasa nanti, atau semacamnya. Dan agar berlaku lemah lembut dalam berbicara kepada mereka sebagai suatu keharusan untuk menghubur perasaan hati mereka. Allah menyandarkan (permasalahan) harta (orang belum sempurna akalnya) kepada para wali itu berindikasi bahwa mereka wajib mempeerlakukan harta orang yang bodoh tersebut sebagaimana mereka melakukannya pada hrta mereka sendiri berupa penjagaan, pembelanjaan, dan tidak menghadapkannya kepada hal-hal yang memsnahkannya. Ayat ini menunjukan bawa memberikan nafkah kepada orang gila, anak kecil, dan idiot itu adalah dari harta mereka sendiri, bila mereka memiliki harrta, sebagaimana firman Alllah ta'ala ”berilah mereka belanja dan pakaian (dari hasil harta itu). ” Ayat ini juga menunjukkan bahwa pernyataan wali dapat diterima tentang apa yang ia nyatakan mengenai nafkah yang memungkinkan atau pakaian, karena Allah telah menjadikan mereka sebagai orang-orang yang dapat dipercaya atas harta anak yatim itu, oleh karena itu, pernyataan orang-orang yang terpercaya harus diterima."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻭﻻ ﺗﺆﺗﻮا1} : Wala tu’tu artinya janganlah membemberi {اﻟﺴﻔﻬﺎء}: As Sufaha’ bentuk jamak safih adalah orang yang tidak bisa memanfatkan harta dengan baik. ﻗﻴﺎﻣﺎ : Qiyaman adalah suatu tumpuan yang kita berdiri dengannya. Allah jadikan harta sebagai tumpuan, yaitu tumpuan untuk kehidupan manusia, kemaslahatan dunia maupun agama. {ﻗﻮﻻ ﻣﻌﺮﻭﻓﺎ} Qaulan ma’rufan : kata-kata yang baik, maksudnya perkataan yang menyejukan jiwa tidak membuat sedih ataupun marah. Makna Ayat: Masih dalam konteks petunjuk Allah untuk segenap hamba-Nya yang beriman, menuju suatu kebaikan dan yang bermanfaat bagi perkara dunia. Serta keselamatan dan kemenangan mereka di akhirat. Allah berfirman di ayat yang pertama {ﻭﻻ ﺗﺆﺗﻮا اﻟﺴﻔﻬﺎء ﺃﻣﻮاﻟﻜﻢ اﻟﺘﻲ ﺟﻌﻞ اﻟﻠﻪ ﻟﻜﻢ ﻗﻴﺎﻣﺎ ﻭاﺭﺯﻗﻮﻫﻢ4 ﻓﻴﻬﺎ ﻭاﻛﺴﻮﻫﻢ ﻭﻗﻮﻟﻮا ﻟﻬﻢ ﻗﻮﻻ ﻣﻌﺮﻭﻓﺎ} Allah melarang para wali untuk memberikan harta yang dijadikan sebagai tumpuan hidup anak yatim kepada anak kecil, wanita atau laki-laki safih yang belum memiliki kemampuan untuk menggunakan uang secara baik. Kepandiran dalam penggunaan uang secara layak dikhawatirkan akan adanya pembelanjaan harta tidak pada tempatnya dan merusak harta dengan berbagai bentuk kerusakan, misal: israf (boros) dan yang semisalnya. Allah memerintahkan kepada para wali untuk memberikan harta sesuai kebutuhan dan pakaian dari harta para yatim itu sendiri. Allah ta’ala demikian tanpa ada isyarat untuk menggunakan harta anak yatim untuk investasi dalam perdagangan, produksi atau menikah. Adapun dalam hal pertanian, maka modal awal tetap mengendap tidak digunakan dan yang dimakan adalah keuntungannya saja. Dan berkata makruf kepada orang-orang yatim safih. Ini adalah yang Allah perintahkan dalam ayat yang pertama. Pelajaran dari Ayat: • Disyariatkannya boikot kepada orang safih (bodoh dalam penggunaan harta) guna kemaslahatannya. • Bolehnya menumbuh-kembangkan harta secara halal dengan dalil {ﻭاﺭﺯﻗﻮﻫﻢ ﻓﻴﻬﺎ} “dan berilah mereka rizki dari harta mereka”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 5: Kepada mereka yang tidak beres fikiran itu, harta-harta kamu yang Allah telah jadikan pokok penghidupan bagi kamu, tetapi berilah mereka makan padanya dan berilah mereka pakaian, dan katakanlah kepada mereka perkataan yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni para wali. Orang yang belum sempurna akalnya ialah anak yatim yang belum balig atau orang dewasa yang tidak dapat mengatur harta bendanya baik karena hilang akal seperti orang gila, maupun karena belum cerdas seperti orang yang biasa boros. Dalam ayat ini, Allah melarang para wali menmyerahkan harta mereka yang belum sempurna akalnya agar harta itu tidak habis atau binasa. Hal itu, karena Allah menjadikan harta sebagai penopang hamba-hamba-Nya untuk maslahat dunia mereka maupun agama, mereka yang belum sempurna akalnya tidak dapat mengatur hartanya dan menjaganya. Oleh karena itu, wali mereka yang bertindak, yaitu dengan mengeluarkan harta untuk makan dan pakaian mereka, serta mengeluarkan untuk sesuatu yang dharuri (penting) atau dibutuhkan mereka baik terkait dengan agama maupun dunia. Disandarkannya harta kepada para wali sebagai isyarat wajibnya bagi para wali memberlakukan harta anak yatim sebagaimana mereka memberlakukan harta mereka dengan menjaganya, bertindak tepat dan tidak membawa kepada hal-hal yang berbahaya. Yakni berikanlah mereka makanan dari harta itu. Dalam ayat ini terdapat dalil bahwa nafkah orang gila, anak kecil, orang yang kurang akalnya diambil dari harta mereka jika mereka memiliki harta. Demikian juga menunjukkan bahwa perkataan wali adalah diterima dalam hal dakwaannya berupa nafkah yang memang mungkin dan pakaian, karena Allah menjadikan mereka sebagai orang yang diberi amanat (dipercaya) terhadap harta orang-orang yang belum sempurna akalnya itu, sehingga perkataan orang yang diberi amanat adalah diterima. Misalnya dengan menerangkan kepada mereka -saat mereka meminta harta- bahwa harta akan diserahkan kepada mereka nanti setelah mereka sudah pandai mengaturnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 5",
    "description": "Setelah penjelasan tentang hak-hak anak yatim yang harus dipenuhi, ayat ini menjelaskan larangan menyerahkan harta mereka bila mereka belum mampu mengurus. Dan janganlah kalian serahkan kepada orang yang belum sempurna akalnya, yaitu anak yatim atau orang dewasa yang belum mampu mengurus, harta mereka yang ada dalam kekuasaan kalian yang dijadikan Allah sebagai pokok kehidupan, penyangga hidup, penopang urusan, dan penunjang berbagai keinginan dalam kehidupan ini. Sebab, dalam kondisi seperti itu mereka akan menghabiskan harta tersebut secara sia-sia. Karena itu, berilah mereka belanja secukupnya dan pakaian selayaknya yang bisa menutupi aurat dan memperindah penampilan, dari hasil harta yang kalian usahakan itu. Bersikaplah lemah lembut dan ucapkanlah kepada mereka perkataan yang baik sehingga membuat perasaan mereka nyaman dan tenteram. Setelah menjelaskan tentang larangan menyerahkan harta anak yatim dalam kondisi mereka belum mampu mengelola, berikutnya Allah memerintahkan agar para wali menguji terlebih dahulu kematangan berpikir, kecerdasan, dan kemampuan mereka mengelola harta sebelum menyerahkannya. Dan ujilah kecerdasan dan mental anak-anak yatim itu dengan memperhatikan keagamaan mereka, kematangan berpikir, dan cara membelanjakan harta, kemudian latihlah mereka dalam menggunakan harta itu sampai hampir mereka cukup umur untuk menikah dengan menyerahkan harta sedikit demi sedikit. Kemudian jika menurut pendapat kamu melalui uji mental tersebut dapat diketahui dengan pasti bahwa mereka betul-betul telah cerdas dan pandai dalam memelihara dan mengelola harta, maka serahkanlah kepada mereka hartanya itu, sehingga tidak ada alasan bagi kalian untuk menahan harta mereka. Dan janganlah kamu, para wali, dalam mengelola harta ikut memakannya harta anak yatim itu dan mengambil manfaat melebihi batas kepatutan, dan janganlah kamu menyerahkan harta kepada mereka dalam keadaan tergesa-gesa menyerahkannya sebelum mereka dewasa, karena kalian khawatir bila mereka dewasa mereka akan memprotes kalian. Barang siapa di antara pemelihara itu mampu mencukupi kebutuhan hidup untuk diri dan keluarganya, maka hendaklah dia menahan diri dari memakan harta anak yatim itu dan mencukupkan diri dengan anugerah dari Allah yang diperolehnya. Dan barang siapa miskin, maka bolehlah dia makan harta itu menurut cara yang patut sekadar untuk mencukupi kebutuhan hidupnya, sebagai upah atau imbalan atas pemeliharaannya. Kemudian, apabila kamu menyerahkan harta itu yang sebelumnya berada di tangan kamu kepada mereka, maka hendaklah kalian adakan saksi-saksi ketika menyerahkan harta itu kepada mereka. Dan cukuplah Allah sebagai pengawas atas segala amal perbuatan dan perilaku mereka. Dan dia memperhitungkan semua perilaku tersebut kemudian memberinya balasan setimpal."
  }
]