[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu mengetahui (wahai rasul) perihal orang-orang yahudi yang telah diberi bagian dari ilmu,mereka membenarkan semua yang disembah selain Allah, seperti berhala-berhala, setan-setan dari jenis manusia dan jin dengan pembenaran yang membawa mereka kepada berhukum dengan selain syariat Allah, dan mereka mengatakan kepada orang-orang yang kafir kepada Allah dan rasulNYA, Muhammad ,”orang-orang kafir itu lebih lurus dan lebih benar jalan mereka daripada orang-orang yang beriman itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Tidakkah kamu -wahai Rasul- mengetahui dan merasa heran terhadap ulah orang-orang Yahudi yang telah Allah beri karunia sebagian dari ilmu pengetahuan, tetapi mereka justru percaya kepada segala sesembahan selain Allah, dan secara basa-basi berkata kepada orang-orang musyrik, “Sesungguhnya mereka itu lebih benar jalannya daripada sahabat-sahabat Muhammad -ṣallallāhu 'alaihi wa sallam-.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Hai Muhammad, Lihatlah keburukan orang-orang Yahudi; mereka telah beriman kepada segala peribadatan untuk selain Allah dan mereka telah mengambil hukum dengan selain hukum yang disyariatkan oleh Allah, Bahkan mereka berkata dengan perkataan yang sangat buruk, yaitu berkata, \"sesungguhnya agama orang-orang musyrik lebih baik daripada agama Muhammad dan pengikutnya, dan orang-orang musyrik lebih benar jalannya daripada orang-orang yang beriman kepada kitab Allah dan Rasulullah.\" Namun hal ini bukanlah hal yang mengherankan dari orang-orang Yahudi, itulah yang selalu mereka lakukan dalam menyikapi kebenaran dan kebatilan, dan menyikapi pengikut kebenaran dan kebatilan. mereka memiliki sifat tamak yang tiada habisnya, hawa nafsu yang tak berkesudahan, dan rasa dengki yang tiada henti. mereka tidak mendapatkan bantuan dan pertolongan dari kebenaran dan pengikutnya dalam memuaskan ketamakan dan hawa nafsu mereka, akan tetapi Bantuan dan pertolongan Hanya mereka dapatkan dari kebatilan dan pengikutnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا۟ نَصِيبًا مِّنَ الْكِتٰبِ (Apakah kamu tidak memperhatikan orang-orang yang diberi bahagian dari Al kitab?) Mereka adalah orang-orang Yahudi. يُؤْمِنُونَ بِالْجِبْتِ (Mereka percaya kepada jibt) Yakni sihir. Dan pendapat lain mengatakan yakni berhala-berhala. وَالطّٰغُوتِ (dan thaghut) Yakni para dukun dan semua yang rela untuk disembah selain Allah, atau orang yang ditaati dalam kemasiatan. وَيَقُولُونَ لِلَّذِينَ كَفَرُوا۟ (dan mengatakan kepada orang-orang Kafir) Yakni orang-orang Yahudi mengatakan kepada orang-orang kafir quraisy. هٰٓؤُلَآءِ أَهْدَىٰ مِنَ الَّذِينَ ءَامَنُوا۟ سَبِيلًا (bahwa mereka itu lebih benar jalannya dari orang-orang yang beriman) Yakni yang beriman kepada Nabi Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Tidakkah kamu melihat ulama’ Yahudi yang diberi bagian dari ilmu tentang Taurat, mereka mempercayai Jibt (yaitu setiap sesuatu yang disembah selain Allah dari golongan setan, penyihir, atau dukun) dan Thaghut (yaitu setiap sesembahan selain Allah dan mereka nyaman dengan itu) dan mereka berkata kepada para musyrik Quraisy: “Sesungguhnya mereka itu lebih benar jalannya daripada orang-orang yang beriman kepada Muhammad” Ayat ini turun untuk Huyay bin Akhthab dan Ka’b bin Asyraf yang keduanya berkata penduduk Mekah yang menyebutkan keutamaan orang mukmin berupa jamuan, memberi minum orang-orang yang berhaji dan melepaskan tahanan: “Tetapi kalian lebih baik dan lebih benar jalannya daripada dia (daripada Muhammad)”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidakkah kamu lihat orang-orang yang telah diberi bagian dari Kitab (Taurat), mereka percaya kepada jibt dan tagut} sesuatu yang disembah dan ditaati selain Allah {serta mengatakan kepada orang-orang kafir bahwa mereka itu lebih benar jalannya daripada orang-orang yang beriman} orang-orang Yahudi berkata kepada orang-orang kafir Quraisy, bahwa kalian jalannya lebih benar daripada orang-orang yang beriman kepada Muhammad"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Ini adalah di antara keburukan-keburukan orang-orang Yahudi dan kedengkian mereka terhadap Nabi dan kaum Mukminin, bahwa akhlak mereka yang tercela dan kebiasaan atau tabiat mereka yang kotor membawa mereka kepada tindakan meninggalkan iman kepada Allah dan RasulNya kemudian menggantikannya dengan iman kepada jibt dan thagut, artinya beriman kepada segala peribadahan (yang ditujukan) kepada selain Allah atau berhukum dengan selain syariat Allah, dan termasuk dalam hal itu adalah sihir, perdukunan, dan peribadahan kepada selain Allah, dan para penyembah berhala daripada jalan kaum Mukminin, Allah berfirman, “Dan mengatakan kepada orang-orang kafir (musyrik Makkah)” yaitu karena mereka menjadikannya sebagai suatu jalan untuk menjilat dan mencari muka serta benci terhadap keimanan, “Bahwa mereka itu lebih benar jalannya dari orang-orang yang beriman.” Betapa jeleknya mereka, betapa kerasnya kedurhakaan mereka, dan betapa kerdilnya akal pikiran mereka! Bagaimana bisa mereka menempuh jalan yang berbahaya dan jurang yang menjerumuskan?! Apakah mereka mengira bahwa hal ini tersamar (tidak diketahui) oleh orang-orang yang berakal atau akan masuk ke dalam akal orang-orang yang bodoh?! Apakah sebuah agama yang dibangun atas ajaran penyembahan terhadap berhala dan patung-patung, terus-menerus dalam mengharamkan hal-hal yang baik, membolehkan hal-hal yang kotor, dan menghalalkan jumlah yang banyak dari hal-hal yang diharamkan, kezhaliman di antara makhluk serta penyamaan antara pencipta dan para makhluk yang di ciptakan, kufur kepada Allah, Rasul-rasulNya dan kitab-kitabNya, lebih utama daripada sebuah agama yang tegak di atas ajaran peribadatan kepada Yang Maha Penyayang, keikhlasan kepadaNya dalam (amal perbuatan yang dilakukan) ketika sendirian maupun di tengah-tengah khalayak, pengingkaran terhadap segala sembahan selainNya berupa patung-patung, tandingan-tandingan dan para pendusta, dan di atas ajaran menyambung silaturahim, berbuat baik kepada seluruh makhuk hingga kepada binatang sekalipun, menegakkan keadilan di antara manusia, mengharamkan segala yang buruk dan mengandung kezhaliman serta jujur dalam setiap perkataan dan perbuatan! Tidakkah apa yang mereka perbuat tersebut melainkan karean kebingungan?! Dan orang yang berkata seperti itu merupakan orang yang paling bodoh dan paling lemah akalnya, atau merupakan orang yang paling keras kedurhakaan, pembangkangan, dan penolakannya terhadap kebenaran, dan inilah yang teradi."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {بِالْجِبْتِ وَالطَّاغُوتِ} bil jibti wath thoguut: Jibt adalah suatu sebutan untuk yang disembah selain Allah, Thogut pun artinya sama. Jibt dan Thogut bisa berupa manusia ataupun berhala. أهدى سبيلا ahdaa sabiilaa: lebih banyak hidayah di kehidupan dan perilaku mereka. Makna Ayat: Diriwayatkan, bahwasanya ada sekelompok kaum Yahudi diantaranya adalah Ka’b bin Al Asyraf dan Yuyai bin Akhthob mengumpulkan pasukan untuk menyerang Rasulullah. Tatkala mereka sampai di Mekkah, kaum Quraisy berkata, “Kami bertanya kepada mereka -karena mereka adalah ahli kitab- tentang agama kita dan agama Muhammad, yang mana yang lebih baik?” Maka Kaum Yahudi berkata, “Agama kalian itu lebih baik daripada agama Muhammad. Kalian itu lebih dekat dengan petunjuk daripada Muhammad dan yang mengikutinya.”, maka Allah menurunkan ayat-ayat ini sampai dengan firman {عَظِيماً}. Berikut ini adalah penjelasannya, {أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُوا نَصِيباً مِنَ الْكِتَابِ يُؤْمِنُونَ بِالْجِبْتِ وَالطَّاغُوتِ} “Apakah kalian tidak melihat orang-orang ahli kitab yang beriman kepada Jibt dan Thoghut”, apakah tidak kamu ketahui, wahai Muhammad, bahwa orang-orang ahli kitab yang telah diberi Taurat percaya dengan keabsahan dari ibadah kepad Jibt dan Thoghut, menetapkan dan memutuskan bahwa ibadah kepada Jibt dan Thoghut itu lebih utama dari pada ibadah kepada Allah {وَيَقُولُونَ لِلَّذِينَ كَفَرُوا} “mereka berkata orang-orang kafir”, adalah kepada musyrikin Quraisy, “Agama kalian lebih baik daripada agama Muhammad. Dan kalian itu lebih mendapatkan petunjuk dalam kehidupan kalian di bidang agama dan sosial.” Bukankan sikap para Yahudi itu aneh dan mencengangkan orang-orang yang mengetahui, mengerti dan memahami agama yang benar. Kaum Yahudi telah menetapkan sebuah kebatilan dan membenarkannya. Pelajaran dari ayat : • Wajibnya mengingkari Jibt dan thoghut. • Penjelasan mengenai makar dan curangnya kaum Yahudi dan mereka tidak akan puas dari perbuatan curang, dusta dan penyesatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 51: Tidakkah engkau lihat mereka yang telah diberi sebagian daripada Kitab? Mereka beriman kepada kesesatan dan apa-apa yang melewati batas, dan mereka berkata di tentang orang- orang kafir, bahwa mereka ini lebih terpimpin di jalan yang lurus daripada orang-orang yang beriman itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan Ka'ab bin Al Asyraf dan ulama Yahudi semisalnya, yakni ketika mereka datang ke Mekah dan menyaksikan orang-orang musyrik yang terbunuh dalam perang Badar, mereka pun membangkitkan semangat kaum musyrik untuk melakukan tindakan pembalasan dan memerangi Nabi shallallahu 'alaihi wa sallam. Ibnu Jarir meriwayatkan dari Ibnu Abbas ia berkata, \"Ketika Ka'ab bin Al Asyraf tiba di Mekah, orang-orang Quraisy berkata kepadanya, \"Kamu adalah penduduk Madinah terbaik dan tokoh mereka.\" Ka'ab berkata, \"Ya.\" Mereka berkata, \"Tidakkah kamu melihat kepada laki-laki yang lemah ini yang terputus keturunannya dari kaumnya, yang menyangka bahwa dirinya lebih baik daripada kita, padahal kami orang-orang yang melakukan haji, para pelayan (ka’bah) dan para pemberi minum (jamaah haji).\" Ka'ab berkata, \"Kalian lebih baik daripadanya.\" Maka turunlah ayat, \"Inna syaani'aka huwal abtar.\"(Al Kautsar: 3) dan turun pula ayat, \"Alam tara ilalladziina…sampai, \"Falan tajida lahuu nashiiraa.\" (lihat ayat 51-52 di atas). Hadits ini disebutkan pula oleh Ibnu Katsir, ia berkata: Imam Ahmad berkata, \"Telah menceritakan kepadaku Muhammad bin Abi 'Addi hadits itu.\" Hadits ini diriwayatkan pula oleh Ibnu Hibban dalam shahihnya sebagaimana dalam Mawaarid hal. 428, dan para perawinya adalah para perawi kitab shahih, hanya saja yang rajih adalah mursal sebagaimana disebutkan dalam Takhrij Tafsir Ibnu Katsir. Jibt dan Thaghut ialah setan dan apa saja yang disembah selain Allah Subhaanahu wa Ta'aala. Hal ini termasuk perilaku buruk orang-orang Yahudi dan kedengkian mereka kepada Nabi shallallahu 'alaihi wa sallam dan kaum mukmin. Akhlak mereka yang buruk dan tabi'at mereka yang jelek membuat mereka tidak beriman kepada Allah dan rasul-Nya, bakan menggantinya dengan beriman kepada jibt dan thagut, yakni malah percaya dengan peribadatan kepada selain Allah atau menetapkan sesuatu dengan selain syari'at Allah. Termasuk ke dalam jibt dan thagut pula sihir, perdukunan, beribadah kepada selain Allah dan menaati setan. Demikian juga kekafiran dan sifat dengki mereka membuat mereka mengutamakan jalan orang-orang kafir para penyembah berhala. Yakni ketika Abu Sufyan dan kawan-kawannya berkata kepada mereka (ulama Yahudi), \"Apakah kami lebih benar jalannya, di mana kami memberi minum jama'ah haji, menjamu tamu, membebaskan tawanan dan melakukan lainnya ataukah Muhammad, di mana ia menyelisihi agama nenek moyangnya, memutuskan tali silaturrahim dan berpisah dari tanah haram?\", maka ulama Yahudi menjawab, \"Kalian (musyrik Mekah) lebih lurus jalannya daripada orang-orang yang beriman.\" Ucapan ini disampaikan sebagai tindakan pendekatan mereka dengan orang-orang kafir Mekah dan karena benci kepada keimanan. Bagaimana mungkin agama yang tegak di atas peribadatan kepada patung dan berhala, mengharamkan hal yang baik-baik, menghalalkan yang kotor, menghalalkan banyak hal yang haram, berlaku zalim kepada manusia, menyamakan antara Pencipta dengan makhluk, ingkar kepada Allah, rasul-rasul dan kitab-kitab-Nya sama atau lebih baik daripada agama yang tegak di atas peribadatan kepada Allah, berbuat ikhlas baik secara sembunyi maupun terang-terangan, mengingkari segala sesuatu yang disembah selain Allah, memerintahkan menyambung tali silaturrahim, berbuat baik kepada semua manusia, bahkan kepada hewan pula, menegakkan keadilan di antara manusia, mengharamkan kezaliman dan perkara kotor serta memerintahkan kejujuran? Tentu tidak sama, dan agama yang tegak di atas peribadatan kepada Allah dan memerintahkan berbuat ihsan tentu lebih baik, lebih benar dan lebih lurus jalannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 51",
    "description": "Di samping mengada-ada kedustaan, mereka juga melakukan kedurhakaan yang lain, yaitu percaya kepada jibt dan thagut. Tidakkah kamu memperhatikan orang-orang yang diberi bagian dari kitab taurat, yakni orang-orang yahudi itu' mereka percaya kepada jibt yakni berhala atau penyihir, dan thagut, yakni selain syariat Allah, dan mengatakan kepada orang-orang kafir musyrik mekah dengan penuh kesombongan, bahwa mereka itu lebih benar jalan-Nya daripada orang-orang yang beriman dari kaum muslimin mereka itulah orang-orang yang sangat jauh kedurhakaannya serta dilaknat oleh Allah. Dan barang siapa yang dilaknat oleh Allah, niscaya engkau tidak akan mendapatkan penolong baginya yang akan menyelamatkannya di mana pun dan kapan pun ia berada."
  }
]