[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang telah banyak kerusakan mereka dan telah menyeluruh kesesatan mereka , Allah mengusir mereka dari rahmatNYA. Dan barangsiapa dijauhkan Allah dari rahmatNYA, maka kamu tidak akan mendapatkan baginya orang yang menolongnya dan menolak siksaan yang buruk darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Orang-orang (Yahudi) yang memiliki keyakinan yang rusak itu adalah orang-orang yang dijauhkan oleh Allah dari rahmat-Nya. Dan barangsiapa yang dijauhkan oleh Allah dari rahmat-Nya, maka kamu tidak akan menemukan seorang penolong yang dapat melindunginya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. kemudian Allah mengabarkan balasan bagi orang-orang Yahudi atas perbuatan buruk mereka, bahwa Allah akan menjauhkan mereka dari rahmat-Nya dan menurunkan kepada mereka kemurkaan-Nya. barangsiapa yang kesudahannya seperti ini maka dia tidak akan mendapatkan penolong selain Allah di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. الَّذِينَ لَعَنَهُمُ اللهُ ۖ (orang yang dikutuki Allah) Karena mereka lebih mengutamakan kaum Quraisy daripada Rasulullah dan orang-orang beriman padahal kaum Quraisy kafir kepada Allah dan menyembah berhala-berhala, sehingga mereka menyelisihi kebenaran demi menuruti hawa nafsu mereka padahal mereka mengetahui kebenaran. Dan mereka tidak melakukan hal ini kecuali agar kaum Quraisy dapat membantu mereka. وَمَن يَلْعَنِ اللهُ فَلَن تَجِدَ لَهُۥ نَصِيرًا (Barangsiapa yang dikutuki Allah, niscaya kamu sekali-kali tidak akan memperoleh penolong baginya) Yakni penolong yang dapat mencegah mereka dari turunnya azab dan kemurkaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Mereka yang mengucapkan perkataan ini ditolak oleh Allah dari rahmatNya dan dihinakan olehNya. Barangsiapa dikutuk oleh Allah, maka tiada penolong baginya yang bisa menyelamatkannya dari azab dan kemurkaan Allah. Ayat ini turun untuk dua orang Yahudi yang disebutkan dalam ayat sebelumnya yang mana keduanya mengucapkan perkataan itu karena dengki kepada nabi Muhammad dan para sahabatnya. Ketika Allah menurunkan ayat ini, keduanya berkata: “Demi Allah, Kami tidak menanggung perkataan itu kecuali karena murka dan iri dengan Muhammad”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah yang dilaknat Allah. Siapa pun yang dilaknat Allah, maka kamu tidak akan mendapati dia memperoleh penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Oleh karena itulah Allah berfirman tentang mereka, “Mereka itulah orang yang dikutuk Allah” yaitu Allah mengusir mereka dari rahmatNya dan menempatkan mereka pada kemurkaanNya. “Barangsiapa yang dikutuk Allah, niscaya kamu sekali-kali tidak akan memperoleh penolong baginya,” maksudnya, yang melindunginya dan mengurus kemaslahatannya, serta menjaganya dari hal-hal yang dibenci, dan inilah puncak dari keterhinaan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : {أُولَئِكَ الَّذِينَ لَعَنَهُمُ اللهُ} “Mereka adalah orang yang dilaknat oleh Allah”, mereka telah terperosok di dalam lumpur yang nista, jauh di dalam lubang kekafiran, keburukan dan kerusakan, Allah melaknat mereka dengan menjauhkan mereka dari jalan kebenaran dan petunjuk. {وَمَنْ يَلْعَنِ اللهُ فَلَنْ تَجِدَ لَهُ} “dan orang yang dilaknat oleh Allah tidak akan kau temukan untuk mereka” wahai Rosul {نَصِيراً} “pertolongan” yang dapat menolongnya dari penelantaran yang penuh kekalahan di dalamnya yang mana akan ditempatkan di dalamnya, maka menjadi orang yang berilmu dikutuk dengan kesyirikan dan dijauhkan dari tauhid."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 52: Mereka itu ialah orang-orang yang telah dila'nat oleh Allah; dan barang siapa dila'nat oleh Allah, maka tidak bakal engkau dapat (lihat) baginya satu pembantu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang membantunya kepada hal yang bermaslahat, menjaganya dari sesuatu yang membahayakan serta menyelamatkannya dari siksa Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 52",
    "description": "Mereka itulah orang-orang yang sangat jauh kedurhakaannya serta dilaknat oleh Allah. Dan barang siapa yang dilaknat oleh Allah, niscaya engkau tidak akan mendapatkan penolong baginya yang akan menyelamatkannya di mana pun dan kapan pun ia berada pada ayat-ayat sebelumnya Allah menjelaskan bagaimana kaum yahudi dengan kesombongan mereka telah berbuat durhaka, maka pada ayat ini Allah menanyakan dasar apa yang mereka punya untuk melegalkan perbuatan demikian. Sebenarnya mereka tidak mempunyai dasar apa pun. Agar terbuka kedok mereka, ayat ini mempertanyakannya. Ataukah mereka mempunyai bagian dari kerajaan dan kekuasaan. Jelas ini tidak ada. Bahkan meskipun mereka mempunyainya, mereka tidak akan memberikan sedikit pun kebajikan kepada manusia, bukan saja karena tidak memilikinya, tetapi mereka juga sangat kikir."
  }
]