[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah mereka memiliki bagian dari kerajaan, Seandainya mereka benar memperolehnya, pastilah mereka tidak akan memberikannya sedikitpun kepada seseorang pun, meskipun sekecil celah yang ada di permukaan biji kurma?."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Mereka (Yahudi) tidak mendapatkan bagian dari kerajaan. Sekiranya mereka mendapatkan bagian dari kerajaan, niscaya mereka tidak akan memberikan sebagian darinya kepada siapa pun, walau hanya sebesar titik hitam yang ada di punggung biji kurma."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. setelah Allah menyifati orang-orang Yahudi dengan orang-orang yang sangat bodoh karena keyakinan mereka bahwa menyembah berhala lebih baik daripada menyembah Allah maka kemudian Allah menyebutkan bahwa mereka tidak akan mendapatkan kekuasaan akibat kezaliman, kedurhakaan, dan kebakhilan mereka, serta rasa cinta mereka terhadap diri sendiri; Hal ini karena kekuasaan dan kebakhilan tidak akan saling bertemu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. أَمْ لَهُمْ نَصِيبٌ مِّنَ الْمُلْكِ (Ataukah ada bagi mereka bahagian dari kerajaan (kekuasaan)?) Yakni mereka tidak memiliki bagian dari kekuasaan. Dan seandainya mereka memiliki bagian kekuasaan maka mereka tidak akan memberikannya pada orang lain meski sebesar naqir karena besarnya kebakhilan mereka dan kuatnya kedengkian mereka. Dan makna dari naqir adalah lubang kecil yang ada di punggung biji kurma."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. “Am” disini bermakna “Bal” disertai dengan alif istifham inkariy, yaitu menjadi “Apakah mereka memiliki kekuasaan” yang maknanya mereka tidak memiliki suatu bagian dari kekuasaan. Kalaupun mereka mempunyai sedikit kekuasaan, maka mereka tidak akan memberi manusia bahkan seukuran naqir (yaitu lubang di permukaan biji kurma) karena kebakhilan dan kedengkian mereka yang sangat besar."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ataukah mereka mempunyai} apakah mereka mempunya {bagian} bagian {dari kerajaan. Meskipun ada, mereka tidak akan memberikan} tidak memberikan {sedikit pun kepada manusia} seukuran titik pada bagian luar biji kurma"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “Ataukah ada bagi mereka bagian dari kerajaan (kekuasaan)?” maksudnya, mereka mengutamakan orang-orang yang mereka kehendaki (yaitu orang-orang musyrik Makkah) daripada orang-orang yang mereka kehendaki (yaitu orang-orang Mukmin) hanya bersandar kepada hawa nafsu mereka, lalu menjadikan mereka sekutu bagi Allah dalam mengurus kerajaan dan kekuasaan, seandainya mereka seperti itu halnya, niscaya mereka akan berlaku kikir dan sangat bakhil. Oleh karena itu Allah berfirman, “Kendatipun ada” yaitu seandainya mereka memiliki bagian dalam perkara kekuasaan itu, “mereka tidak akan memberikan sedikit pun (kebajikan) kepada manusia,” maksudnya (mereka tidak akan memberikan) sesuatu pun walaupun sedikit. Ini merupakan penyifatan bagi mereka dengan kebakhilan yang sangat, padahal itu dalam suatu perkiraan adanya kekuasaan mereka sebagai sekutu bagi Allah dalam kerajaanNya, kalimat ini diungkapkan dalam bentuk pertanyaan yang sudah jelas jawabannya, yaitu sesuatu yang pasti diingkari oleh setiap orang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {نَقِيراً} naqiiroo: An naqiir adalah lubang yang ada pada biji benih, ini adalah perumpaan untuk menunjukkan betapa kecilnya sesuatu. Makna ayat : Kemudian Allah berfirman dalam ayat 53 {أَمْ لَهُمْ نَصِيبٌ مِنَ الْمُلْكِ فَإِذاً لا يُؤْتُونَ النَّاسَ نَقِيراً} “Apa mereka mempunyai andil dalam kerajaan? maka mereka tidaklah memberikan kepada manusia sedikitpun”, maksudnya: mereka tidaklah mempunyai bagian dari kekuasaan seperti yang mereka dengungkan. Kalimat tanya ini adalah kalimat tanya retorik yang bermakna pengingkaran terhadap dakwah mereka yaitu kekuasaan adalah diserahkan kepada mereka. Berdasarkan fakta bahwa Mereka yang sangat kikir, jikalau seluruh kekuasan diserahkan kepada mereka, mereka tidak akan memberikan kepada seorang pun hal yang sangat sepele remeh temeh walaupun hanya sekedar sebutir biji-bijian. Ini adalah bentuk celaan kepada mereka, bahwa mereka itu sangat kikir setelah hinaan kepada mereka dengan kedunguan yang lazim, yaitu kecondongan mereka kepada kesyirikan dibandingkan kepada tauhid."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 53: Atau adakah mereka mempunyai bahagian dari kerajaan? Karena di waktu itu, mereka tidak akan beri kepada manusia (walaupun) sedikit."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sehingga mereka melebihkan siapa saja yang mereka inginkan sesuai hawa nafsu mereka. Maksudnya orang-orang yang tidak dapat memberikan kebaikan kepada manusia atau masyarakatnya karena kebakhilannya, tidak patut memegang kekuasaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 53",
    "description": "Pada ayat-ayat sebelumnya Allah menjelaskan bagaimana kaum yahudi dengan kesombongan mereka telah berbuat durhaka, maka pada ayat ini Allah menanyakan dasar apa yang mereka punya untuk melegalkan perbuatan demikian. Sebenarnya mereka tidak mempunyai dasar apa pun. Agar terbuka kedok mereka, ayat ini mempertanyakannya. Ataukah mereka mempunyai bagian dari kerajaan dan kekuasaan. Jelas ini tidak ada. Bahkan meskipun mereka mempunyainya, mereka tidak akan memberikan sedikit pun kebajikan kepada manusia, bukan saja karena tidak memilikinya, tetapi mereka juga sangat kikir. Ataukah mereka dengki kepada manusia, yakni nabi Muhammad dan kaum muslim, karena karunia yang telah diberikan Allah kepadanya. Sungguh, kami telah memberikan kitab seperti taurat, zabur, dan injil, dan hikmah kepada keluarga ibrahim, dan kami telah memberikan kepada mereka yakni keluarga ibrahim kerajaan atau kekuasaan yang besar."
  }
]