[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bahkan apakah mereka itu sebenarnya dengki kepada Muhammad atas karunia yang Allah berikan kepadanya berupa nikmat kenabian dan kerasulan, dan dengki kepada sahabat-sahabatnya atas nikmat taufik menuju kepada keimanan, dan mengimani risalah serta mengikut rasul, dan memperoleh kekuasaan dimuka bumi? Mereka mengharapkan hilangnya karunia itu dari kaum Mukminin. Sesungguhnya sebelumnya kami telah memberikan kepada keturunan Ibrahim kitab-kitab yang Allah turunkan kepada mereka dan wahyu yang diwahyukan kepada mereka yang tidak berwujud kitab yang bias dibaca. Dan kami telah memberikan kepada mereka bersama itu semua berupa kerajaan yang luas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Justru mereka (Yahudi) iri hati kepada Muhammad -ṣallallāhu 'alaihi wa sallam- dan sahabat-sahabatnya atas apa yang Allah berikan kepada mereka yang berupa kenabian, keimanan, dan kekuasaan di muka bumi. Mengapa kalangan Yahudi iri hati kepada mereka (Muhammad beserta para sahabatnya)? Sedangkan Kami telah memberikan kepada keturunan Ibrahim kitab suci yang diturunkan, dan wahyu yang Kami turunkan kepada mereka di luar kitab suci, serta kerajaan yang luas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. kamu kamu di mengolok-olok mereka atas sifat dengki yang mereka miliki karena itu merupakan sifat yang lebih buruk daripada sifat bakhil; mereka selalu menginginkan kebaikan hanya ada pada genggaman mereka, mengharapkan segala karunia Allah, dan tidak menyukai jika ada umat lain yang menyamai mereka titik Oleh sebab itu mereka dengki terhadap Muhammad atas kenabian dan ilmu yang Allah berikan kepadanya, serta kekuasaan, kepemimpinan, dan jumlah pengikut yang banyak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. أَمْ يَحْسُدُونَ النَّاسَ (ataukah mereka dengki kepada manusia) Mereka adalah orang-orang Yahudi yang dengki kepada Rasulullah dan para sahabat. عَلَىٰ مَآ ءَاتَىٰهُمُ اللهُ مِن فَضْلِهِۦ ۖ (lantaran karunia yang Allah telah berikan kepadanya?) Yang berupa kenabian, kemenangan, dan keunggulan mereka atas musuh-musuh. فقد آتينا آل إبراهيم (Sesungguhnya Kami telah memberikan Kitab dan Hikmah kepada keluarga Ibrahim) Yakni apa yang Kami berikan kepada Muhammad dan para sahabatnya bukanlah sesuatu yang baru, karena mereka mengetahui apa yang Kami berikan kepada keluarga Ibrahim. Menurut pendapat lain mereka dengki kepada Nabi Muhammad karena Allah menghalalkannya untuk menikahi Sembilan wanita. Orang-orang Yahudi tersebut mengatakan: tidak ada yang ia pikirkan kecuali menikah. Maka Allah menyebutkan apa yang dulu ada pada Nabi Ibrahim dan keturunannya seperti Nabi Dawud dan Nabi Sulaiman, mereka diberi Allah kitab, hikmah, dan kekuasaan; dan mereka memiliki istri yang lebih banyak daripada istri Rasulullah dengan perbandingan yang jauh. وَءَاتَيْنٰهُم مُّلْكًا عَظِيمًا (dan Kami telah memberikan kepadanya kerajaan yang besar) Menurut sebuah pendapat yang dimaksud adalah kerajaan Nabi Sulaiman yang dikhususkan baginya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. “Am” disini berfaedah sesuai dalam babnya, ketika tidak didahului istifham seperti pada ayat sebelumnya dan maknanya adalah ataukah orang-orang Yahudi itu dengki kepada nabi SAW dan para sahabatnya atas kenabian dan kemenangannya. Sungguh telah kami berikan Taurat, pengetahuan tentang rahasia syariat, dan kenabian untuk keluarga Ibrahim seperti Dawud AS dan Sulaiman AS. Kami juga telah memberi kekuasaan yang agung seperti kekuasaan Yusuf di Mesir, begitu juga Dawud dan Sulaiman di Syam. Maksudnya, kenapa mereka hanya dengki kepada Nabi, dan tidak dengki terhadap keluarga Ibrahim, yaitu Dawud dan Sulaiman, bahwa keduanya diberi kenabian, kitab dan kekuasaan yang agung?! Ayat ini turun ketika orang-orang Yahudi berkata kepada orang-orang kafir Arab: “Lihatlah orang yang berkata bahwa dia diutus untuk rendah hati, tidak mengisi perutnya dengan makanan, tidak memberikan perhatian kecuali hanya kepada para wanita dan hal lain semacamya ini” Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ataukah} ataukah {mereka dengki kepada manusia} rasulullah SAW dan para sahabatnya {atas karunia yang telah dianugerahkan Allah kepada mereka} kenabian, kitab, pertolongan dan kemenangan atas musuh {Sungguh Kami telah menganugerahkan kepada keluarga Ibrahim kitab dan hikmah} dan apa saja selain kitab yang dianugerahkan kepada mereka {dan Kami telah anugerahkan kerajaan yang sangat besar kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Ataukah mereka dengki kepada manusia (Muhammad) lantaran karunia yang telah Allah berikan kepadanya?” maksudnya, apakah pendorong bagi perkataan mereka itu adalah posisi mereka sebagai sekutu bagi Allah lalu mereka mendahulukan orang-orang yang mereka kehendaki?! Ataukah pendorong bagi mereka dalam hal itu adalah kedengkian terhadap Rasulullah dan kaum Mukminin atas apa yang telah Allah berikan kepada mereka dari karuniaNya? Dan yang demikian itu bukanlah suatu hal yang asing dan aneh lagi atas karunia dari Allah, “sesungguhnya Kami telah memberikan KItab dan Hikmah kepada keluarga Ibrahim, dan Kami telah memberikan kepadanya kerajaan yang besar,” yaitu karunia yang telah Allah berikan kepada Ibrahim dan anak cucunya berupa kenabian dan kitab serta kerajaan yang diberikan kepada seorang nabi dari nabi-nabiNya seperti Dawud dan Sulaiman, dan pemberian nikmat olehNya masih terus berlangsung atas hamba-hambaNya yang beriman, lalu bagaimana mungkin mereka mengingkari pemberian nikmat olehNya masih terus berlangsung atas hamba-hambaNya yang beriman, lalu bagaimana mungkin mereka mengingkari pemberian nikmat olehNya berupa kenabian dan pembelaan serta kerajaan bagi Muhammad sebagai makhluk yang paling utama, paling mulia, dan paling mengetahui tentang Allah dan paling takut kepadaNya?!"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : الحسد Al Hasad: berharap agar orang lain kehilangan suatu nikmat dan berharap untuk mendapatkan nikmat itu. {وَالْحِكْمَةَ} Wal hikmah: benar dalam perkataan dan amalan dibarengi dengan pemahaman tentang rahasia syariat Allah. Makna ayat : Dan Allah berfirman : {أَمْ يَحْسُدُونَ النَّاسَ عَلَى مَا آتَاهُمُ اللهُ مِنْ فَضْلِهِ فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ وَالْحِكْمَةَ وَآتَيْنَاهُمْ مُلْكاً عَظِيماً} “Apakah mereka iri kepada para manusia terhadap apa yang Allah beri dari keutamaan-Nya yang sudah mereka miliki sendiri. Kami (Allah) telah memberi keluarga Ibrahim kitab dan hikmah dan kami berikan kepada mereka kerajaan yang agung.” Kata ‘apakah’ di sini adalah berarti ‘bahkan’ seperti yang sebelumnya dengan permisalan yang berupa perpindahan dari keadaan yang buruk ke keadaan yang lain. Kata tanya ‘apakah’ di sini adalah bermakana pengingkaran yang diungkapkan Allah untuk sikaf kikir mereka kepada Nabi Muhammad dan kaum mukminin atas kenabian dan kedaulatan, ini adalah yang dimaksud Allah dengan manusia dalam ayat ini. Allah berfirman {فَقَدْ آتَيْنَا آلَ إِبْرَاهِيمَ الْكِتَابَ} “telah Kami berikan kepada keluarga Ibrahim berupa kitab” diantaranya suhuf ibrahim, Taurat dan Injil. Adapun ‘hikmah’ adalah sunah-sunah yang telah diajarkan oleh para nabi keturunan Ibarahim yang merupakan wahyu dari Allah. Semua hal tersebut adalah ilmu, hukum yang benar lagi lurus nan bermanfaat bagi mereka. Dan ‘kerajaan yang agung’ adalah yang dahulu dipimpin oleh Nabi Daud dan Sulaiman. Semua hal di atas telah dipahami dan dimengerti oleh kaum yahudi. Oleh karena semua hal ini kenapa mereka tidak iri dan menginginkan apa yang ada pada Nabi Muhammad dan kaum mukminin. Dan maksud dari konteks ayat adalah hinaan kepada kaum Yahudi dengan menyebutkan sifat iri seperti dalam celaan kepda mereka yang sebelumnya yang telah menyebutkan sifat kikir dan bodohnya mereka terhadap ilmu. Pelajaran dari ayat : • Tercelanya sifat iri dan kikir."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 54: Adakah (patut) mereka deng. ki kepada manusia atas (ni'mat) yang Allah telah beri kepada mereka dari kurnia-Nya? Karena sesungguhnya Kami telah beri kepada keluarga Ibrahim Kitab (agama) dan hikmah, dan Kami telah beri kepada mereka kerajaan yang besar"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kenabian, Al Quran, dan kemenangan. Seperti Musa, Dawud dan Sulaiman, padahal karunia-Nya sudah biasa diberikan kepada hamba-hamba-Nya yang mukmin, lalu bagaimana mereka dengki kepada Nabi Muhammad shallallahu 'alaihi wa sallam, seorang yang paling mulia, paling takwa dan paling takut kepada-Nya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 54",
    "description": "Ataukah mereka dengki kepada manusia, yakni nabi Muhammad dan kaum muslim, karena karunia yang telah diberikan Allah kepadanya. Sungguh, kami telah memberikan kitab seperti taurat, zabur, dan injil, dan hikmah kepada keluarga ibrahim, dan kami telah memberikan kepada mereka yakni keluarga ibrahim kerajaan atau kekuasaan yang besarmaka di antara mereka yang diberi ilmu itu ada yang beriman kepadanya, yakni nabi Muhammad dan risalahnya serta mengamalkan syariatnya, dan ada pula yang menolak ajarannya serta menghalangi orang lain beriman kepadanya. Cukuplah bagi mereka yang menolak dan menghalangi itu kelak pada hari kemudian neraka jahanam yang menyalanyala apinya."
  }
]