[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka diantara orang-orang yang telah diberi bagian ilmu itu,ada yang beriman kepada risalah Muhammad dan melaksanakan ajaran syriatNYA. Dan diantara mereka ada yang berpaling dan tidak mau memenuhi seruan dakwahnya serta menghalang-halangi manusia untuk mengikutinya. Dan cukuplah bagi kalian (wahai orang-orang yang mendustakan), Neraka Jahannam yang dinyalakan dengan bahan bakarnya berupa kalian sendiri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Di antara orang-orang ahli Kitab ada orang-orang yang beriman kepada apa yang Allah turunkan kepada Ibrahim -‘Alaihissalām- dan nabi-nabi dari keturunannya. Dan di antara mereka ada orang-orang berpaling dari beriman kepadanya. Itulah sikap mereka terhadap apa yang diturunkan kepada Nabi Muhammad -ṣallallāhu 'alaihi wa sallam-. Dan Neraka adalah azab yang setimpal bagi orang-orang ahli Kitab yang mengingkarinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. kemudian Allah menjelaskan sebab sifat dengki mereka dan meremehkan apa yang mereka dengkikan terhadap Muhammad. Sebab jika mereka dengki atas apa yang Allah berikan kepadanya maka mereka sungguh telah berbuat kesalahan, karena apa yang diberikan kepada Muhammad itu juga diberikan kepada selainnya seperti kepada keluarga Ibrahim, Allah memberi mereka kitab yang mengandung hukum-hukum syariat dan hikmah, dan kerajaan yang besar bagi anak-anak keturunannya. para nabi tersebut meskipun mendapatkan kenabian dan kerajaan namun umat mereka tidak seluruhnya beriman kepada risalah yang mereka bawa, sebagian mereka beriman dan sebagian lagi berpaling dan tetap di atas kekafirannya. Maka janganlah engkau heran Hai Muhammad terhadap sikap kaummu, sebab itulah sunatullah umat-umat dalam menyikapi nabi-nabi mereka. jika mereka tidak mendapatkan azab di dunia, maka cukuplah azab neraka jahanam yang menyala-nyala, dan itulah seburuk-buruk tempat kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. فَمِنْهُم (Maka di antara mereka) Yakni orang-orang Yahudi. مَّنْ ءَامَنَ بِهِۦ(ada orang-orang yang beriman kepadanya) Yakni kepada Nabi Muhammad. وَمِنْهُم مَّن صَدَّ عَنْهُ ۚ (dan di antara mereka ada orang-orang yang menghalangi (manusia) dari beriman kepadanya) Yakni yang berpaling darinya. Dan pendapat lain mengatakan yang dimaksud adalah mereka berpaling dari apa yang disebutkan dari percakapan tentang keluarga Nabi Ibrahim."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Di antara orang-orang Yahudi itu ada yang beriman kepada Nabi SAW dan ada yang menentangnya sehingga dia tidak beriman kepadanya. Dan cukuplab neraka Jahannam yang menyala-nyala itu bagi orang yang kufur kepada Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka} orang-orang yang dengki juga leluhur mereka {ada yang beriman kepadanya} dengan apa yang diberikan kepada Ibrahim {dan di antara mereka ada pula yang berpaling darinya} berpaling dan tidak beriman kepadanya {Cukuplah neraka Jahanam yang apinya menyala-nyala"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Maka di antara mereka (orang-orang yang dengki itu), ada orang-orang yang beriman kepadanya” yaitu kepada Muhammad sehingga dengan hal itu ia mendapatkan kebahagiaan dunia dan kemenangan di akhirat, “dan di antara mereka ada orang-orang yang menghalangi (manusia) dari beriman kepadanya” sebagai suatu kedurhakaan, kezhaliman, dan kedengkian, sehingga mereka memperoleh kesengsaraan dunia dan musuh-musuhnya yang merupakan bagian dari efek kemaksiatan mereka, “Dan cukuplah (bagi mereka) Jahanam yang menyala-nyala apinya” yang dinyalakan untuk orang-orang yang kufur kepada Allah, mengingkari kenabian para nabi-nabiNya dari kaum Yahudi dan Nasrani serta selain mereka dari berbagai macam orang-orang kafir lainnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Firman Allah 55: {فَمِنْهُمْ مَنْ آمَنَ بِهِ وَمِنْهُمْ مَنْ صَدَّ عَنْهُ} “Maka dari mereka ada yang beriman ada yang menolaknya.”, maksud ayat ini adalah ada di antara kaum Yahudi yang patuh kepada perjanjian dalam Taurat untuk beriman kepada Nabi Muhammad dan kepada risalahnya, dan jumlah mereka sedikit. {وَمِنْهُمْ مَنْ صَدَّ عَنْهُ} “dan dari mereka ada yang menolaknya”, yaitu dengan berpaling dan memalingkan manusia darinya. Dan kaum Yahudi yang menolak ini adalah mayoritas. {وَكَفَى بِجَهَنَّمَ سَعِيراً} “Cukuplah neraka Jahannam adalah tempat kembalinya” untuk orang kafir karena rasa iri dan menolak jalan Allah lantaran sifat kikir dan makarnya. Maknanya adalah cukup bagi mereka neraka Jahannam yang mempunyai neraka Sa’ir sebagai ganjaran untuknya karena kekafiran, iri hati dan kekikirannya. Kita berlindung kepada Allah dari hal yang demikian. Pelajaran dari ayat : • Berimannya sebagian Yahudi terhadap Islam dan mayoritas dari mereka mengingkari Islam padahal mereka mengtahui kebenaran Islam, wajibnya beriman dengannya dan masuk ke dalam Islam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 55: Tetapi sebahagian dari mereka ada yang beriman kepada (Kitab) itu, dan sebahagian dari mereka ada yang berpaling daripada- Nya, padahal jahannam itu cukup buat jadi pembakar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Oleh karenanya mereka mendapatkan kebahagiaan dan keberuntungan di dunia dan akhirat. Mereka akan mendapatkan kesengsaraan di dunia dan berbagai musibah sebagai hukuman terhadap kekafiran dan kemaksiatan mereka, dan di akhirat ada neraka jahannam yang sudah disiapkan untuk mereka, nas'alullahas salaamah wal 'aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 55",
    "description": "Maka di antara mereka yang diberi ilmu itu ada yang beriman kepadanya, yakni nabi Muhammad dan risalahnya serta mengamalkan syariatnya, dan ada pula yang menolak ajarannya serta menghalangi orang lain beriman kepadanya. Cukuplah bagi mereka yang menolak dan menghalangi itu kelak pada hari kemudian neraka jahanam yang menyalanyala apinyausai menjelaskan pembangkangan kaum yahudi, pada ayat ini Allah lalu menjelaskan adanya kaum selain yahudi yang juga durhaka. Sungguh, orang-orang yang kafir kepada ayat-ayat kami, siapa pun mereka, kelak akan kami masukkan ke dalam neraka sebagai ganjaran atas kekafiran mereka. Setiap kali kulit mereka sudah terbakar hangus, kami ganti dengan kulit baru yang lain, agar mereka merasakan azab yang sangat pedih. Sungguh, Allah mahaperkasa, mahabijaksana."
  }
]