[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari apa yang Allah telah turunkan berupa ayat-ayatNYA dan wahyu kitab suciNYA serta dalil-dalil dan hujjah-hujjahNYA, maka Kami akan memasukkan mereka kedalam neraka,mereka akan merasakan panasnya.Tiap kali kulit-kulit mereka terbakar,kami ganti kulit-kulit mereka dengan kuliyt-kulit yang lain, supaya terus berlangsung siksaan mereka dan rasa sakit mereka. Sesungguhnya Allah Maha perkasa, tidak ada sesuatu pun yang menolak keinginanNYA, juga Maha bijaksana dalam pengaturan dan ketetapanNYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Sesungguhnya orang-orang yang kafir kepada ayat-ayat Kami kelak pada hari Kiamat akan Kami masukkan ke dalam api Neraka yang akan meliputi mereka. Setiap kali api Neraka itu membakar kulit mereka, Kami ganti kulit yang hangus itu dengan kulit yang baru agar mereka terus-menerus merasakan azab tersebut. Sesungguhnya Allah Maha Perkasa, tidak ada yang mengalahkan-Nya, lagi Maha Bijaksana dalam semua hal yang Dia urus dan Dia tetapkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Setelah Allah menyebutkan firman-Nya: “ومنهم من صد عنه” Kemudian Allah melanjutkannya dengan menyebutkan Apa yang Dia siapkan bagi orang-orang yang kafir terhadap ayat-ayat-Nya, bahwa mereka akan masuk ke dalam api neraka yang sangat panas, setiap kali kulit mereka terbakar Allah akan menggantinya dengan kulit yang baru agar mereka terus-menerus merasakan azab tanpa henti. Akibat kekafiran dan kekebalan yang berulang kali mereka perbuat sehingga menjadi tabiat mereka, maka Allah azab bagi mereka sebagai balasan yang setimpal. kemudian Allah menutup ayat ini dengan sifatNya yaitu sifat perkasa dan bijaksana. Dia Maha Perkasa tidak ada yang dapat menghentikan apa yang dia kehendaki, Dan Dia Maha Bijaksana yang tidak mengazab hamba-Nya kecuali bagi yang berhak mendapatkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. سَوْفَ نُصْلِيهِمْ نَارًا (kelak akan Kami masukkan mereka ke dalam neraka) Yakni Kami kelak akan memasukkan mereka ke dalam neraka yang besar. كُلَّمَا نَضِجَتْ جُلُودُهُم(Setiap kali kulit mereka hangus) setiap kulit mereka hangus Allah menggantikan dengan kulit yang baru. Yakni Allah memberi mereka kulit yang baru yang belum terbakar menggantikan kulit yang telah hangus terbakar karena hal itu lebih menyakitkan dalam siksaan. Dan pendapat lain mengatakan yakni Kami akan menjadikan kulit yang telah terbakar tersebut kembali sebagaimana kulit yang baru. لِيَذُوقُوا۟ الْعَذَابَ ۗ (supaya mereka merasakan azab) Yakni karena kulit yang telah hangus terbakar akan kehilangan kemampuan untuk merasakan sakit, tidak sebagaimana kulit yang baru. Hal ini agar azab bagi mereka tetap berlangsung tanpa terputus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Sesungguhnya orang-orang yang mengingkari Al-Qur’an itu akan Kami masukkan ke dalam neraka. Setiap kali kulit mereka terbakar dan hancur, Kami ganti dengan kulit lainnya. Itu merupakan sesuatu terus terjadi, supaya mereka merasakan azab yang terus berkelanjutan dengan diperbaruinya kulit mereka. Sesungguhnya Allah Maha Kuat lagi Maha Penakluk dalam kekuasaanNya, dan Maha Bijaksana dalam tindakanNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang mengingkari ayat-ayat Kami kelak akan Kami masukkan} kami masukkan {ke dalam neraka. Setiap kali kulit mereka hangus} terbakar hangus {Kami ganti dengan kulit yang lain} bukan kulit yang sudah terbakar {agar mereka merasakan azab. Sesungguhnya Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Oleh karena itulah Allah berfirman, “Sesungguhnya orang-orang yang kafir kepada ayat-ayat Kami, kelak akan Kami masukkan mereka kedalam neraka” yaitu sangat besar menyalanya dan sangat keras panasnya, “setiap kali kulit mereka hangus” yaitu terbakar, “Kami ganti kulit mereka dengan kulit yang lain, supaya mereka merasakan azab” yaitu agar siksaan itu sampai kepada mereka dengan sebenar-benarnya, dan sebagaimana berulangnya kekufuran dan kedurhakaan mereka yang akhirnya menjadi karakter dan sifat abafi bagi mereka, Allah juga mengulang-ulang siksaanNya bagi mereka sebagai suatu balasan yang setimpal, oleh karena itu Allah berfirman, “SEsungguhnya Allah Mahaperkasa lagi Mahabijaksana” yaitu milikNya kemuliaan yang agung dan hikmah pada penciptaan, perintah, pahala, dan siksaNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻧﺼﻠﻴﻬﻢ ﻧﺎﺭا} nushliihim naaro: Kami masukkan ke dalam api neraka dan kami bakar di dalamnya. {ﻧﻀﺠﺖ ﺟﻠﻮﺩﻫﻢ} nadhijat juluuduhum: kulit mereka terbakar, terbelah-belah dan berjatuhan. {ﻟﻴﺬﻭﻗﻮا اﻟﻌﺬاﺏ} lyazduuqul ‘adzaab: berlanjutnya azab ditimpakan kepada mereka agar merasa sakit. {ﻋﺰﻳﺰا ﺣﻜﻴﻤﺎ} ‘aziizan ‘alaihim: kebanyakan, Allah menyiksa orang yang berhak untuk disiksa. Makna Ayat: Dalam dua ayat yang sebelumnya disebutkan keimanan dan kekafiran. Dan pada dua ayat ini disebutkan ancaman dan janji. Ancaman bagi orang kafir dan janji untuk orang yang beriman. Allah bersabda {ﺇﻥ اﻟﺬﻳﻦ ﻛﻔﺮﻭا ﺑﺂﻳﺎﺗﻨﺎ ﺳﻮﻑ ﻧﺼﻠﻴﻬﻢ ﻧﺎﺭا} “Sesungguhnya orang-orang yang kafir terhadap ayat-ayat kami, kelak akan kami campakkan di dalam api neraka”, mereka akan dimasukkan ke dalam api jahannam, dibakar dan dipanggang di dalamnya. {ﻛﻠﻤﺎ ﻧﻀﺠﺖ ﺟﻠﻮﺩﻫﻢ} “Setiap kali kulit mereka matang” sobek dan berjatuhan, Allah akan menggantikannya dengan kulit yang baru dengan segera untuk lekas mencicipi siksaan di seluruh anggota badannya. Allah berfirman : {ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﻋﺰﻳﺰا ﺣﻜﻴﻤﺎ} “Sesungguhnya Allah Maha Perkasa dan Bijak”, ejekan kepada mereka dari Allah tatkala eksekusi ancaman kepada mereka. Karena kata ‘Aziz (perkasa) berarti yang menang tidak ada yang bisa menghalangi pelaksanaan ancaman kepada para musuh-Nya. Seperti halnya Hakim (bijak) dalam tatanan-Nya, menyiksa orang-orang kafir dan keluar dari ketaatan Allah. Inilah apa yang terkandung di dalam ayat yang pertama (56) yang berupa ancaman bagi orang-orang kafir. Pelajaran dari ayat : • Kekafiran dan maksiat menyebabkan azab di akhirat. • Penjelasan hikmah dari digantinya kulit penduduk neraka, ialah untuk mengekalkan indra perasa agar merasakan azab."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 56: Sesungguhnya orang-orang yang telah kufur kepada ayat-ayat Kami, akan mereka di api; tiap-tiap kali masuk kulit mereka, Kami gantikan buat mereka kulit yang lainnya, supaya mereka merasakan 'adzab karena sesungguhnya adalah Allah itu Gagah, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dikembalikan kepada keadaan sebelumnya; tidak terbakar. Ayat ini menunjukkan bahwa kulit merupakan pusat rasa, apabila telah melewati kulit, maka tidak terasa lagi. Oleh karena itu, Allah mengganti lagi dengan kulit yang lain agar mereka merasakan azab. Hal itu, karena mereka berkali-kali melakukan kekafiran dan penolakan sehingga sifat itu melekat dalam diri mereka, maka Allah memberikan siksaan berkali-kali dan mengekalkannya di neraka. Tidak ada yang dapat melemahkan-Nya. Baik dalam ciptaan-Nya, dalam perintah-Nya, dalam pahala dan siksa-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 56",
    "description": "Usai menjelaskan pembangkangan kaum yahudi, pada ayat ini Allah lalu menjelaskan adanya kaum selain yahudi yang juga durhaka. Sungguh, orang-orang yang kafir kepada ayat-ayat kami, siapa pun mereka, kelak akan kami masukkan ke dalam neraka sebagai ganjaran atas kekafiran mereka. Setiap kali kulit mereka sudah terbakar hangus, kami ganti dengan kulit baru yang lain, agar mereka merasakan azab yang sangat pedih. Sungguh, Allah mahaperkasa, mahabijaksana. Sudah menjadi kebiasaan Al-Qur'an untuk menyebut sesuatu lalu menyebut lawannya. Setelah menjelaskan apa yang menimpa orang kafir, ayat ini lalu menjelaskan apa yang didapatkan oleh orang beriman. Adapun orang-orang yang beriman dengan iman yang benar dan mengerjakan kebajikan sebagai bukti dari keimanan mereka, kelak akan kami masukkan mereka ke dalam surga yang mengalir di bawahnya sungaisungai, dan mereka kekal di dalamnya selama-lamanya. Di sana, di dalam surga itu, mereka mempunyai pasangan-pasangan yang suci, dan kami masukkan mereka ke tempat yang teduh lagi nyaman yang tidak terlalu panas dan tidak pula terlalu dinginq."
  }
]