[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang telah tentram hati mereka dengan keimanan kepada Allah dan membenarkan risalah rasulNYA,Muhammad dan kemudian istiqamah diatas ketaatan, kami akan memasukkan mereka kedalam surga-surga yang mengalir dibawah istana-istana dan pohon-pohonnya sungai-sungai. Mereka bersenang-senang disana selamanya dan tidak keluar darinya.Dan bagi mereka istri-istri yang Allah sucikan dari segala kotoran,dan kami memasukkan mereka ke tempat yang penuh naungan lebat lagi luas di dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Sedangkan orang-orang yang beriman kepada Allah, mengikuti rasul-Nya, dan mengerjakan amal saleh kelak pada hari Kiamat akan Kami masukkan ke dalam Surga yang di bawah istana-istananya mengalir sungai-sungai, dan mereka akan menetap di dalamnya untuk selama-lamanya. Di dalam Surga itu mereka memiliki istri-istri yang suci dari semua kotoran. Dan Kami akan memasukkan mereka ke dalam naungan yang rindang dan lebat, yang tidak panas dan tidak dingin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Setelah Allah menyebutkan ancaman-Nya terhadap orang-orang kafir, maka Allah kemudian menyebutkan kabar gembira bagi orang-orang yang beriman sebagai balasan bagi mereka, dan agar orang-orang kafir semakin merasakan penyesalan, Dia berfirman: \"dan orang-orang yang beriman kepada Allah dan rasulnya serta beramal shalih maka Allah akan memasukkan mereka ke dalam surga-surga yang dibawahnya mengalir sungai-sungai, mereka merasakan kenikmatan yang kekal di dalamnya,mereka tidak akan merasakan kebosanan atau keluh kesah. ini semua merupakan balasan atas amal sholeh yang mereka perbuat; mereka akan mendapatkan istri-istri yang suci dari aib lahir dan batin, mereka akan berada di tempat yang teduh yang tidak panas dan tidak pula dingin. Itulah kenikmatan yang sempurna dan kekal selama-lamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. لَّهُمْ فِيهَآ أَزْوٰجٌ مُّطَهَّرَةٌ ۖ (mereka di dalamnya mempunyai isteri-isteri yang suci) Yakni suci dari kotoran-kotoran yang biasanya ada pada wanita-wanita di dunia. وَنُدْخِلُهُمْ ظِلًّا ظَلِيلًا(dan Kami masukkan mereka ke tempat yang teduh lagi nyaman) Dan makna (الظل الظليل) yakni tempat yang rimbun yang tidak dapat ditembus terik atau hawa panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57.Dan orang-orang yang beriman kepada Allah dan rasulnya, serta beramal shalih, maka akan Kami masukkan kedalam surga keabadian yang dipenuhi dengan kenikmatan, mereka tinggal di sana selama-lamanya. Dan bagi mereka itu istri-istri yang bersih dari kecacatan yang ada pada istri-istri di dunia. Kami memasukkan mereka ke dalam naungan (Kami) selama lamanya, yang mana tidak ada hawa panas di dalamnya, yaitu udara yang tidak ada panas matahari dan dingin di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman dan beramal shalih akan Kami masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selama-lamanya. Bagi mereka di sana pasangan-pasangan yang disucikan, dan Kami masukkan mereka ke tempat yang teduh lagi nyaman} naungan yang memanjang yang tidak panas dan tidak pula dingin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “Dan orang-orang yang beriman” yaitu kepada Allah dan perkara apa pun yang wajib diimani, “Dan mengerjakan amal-amal yang shalih,” baik yang wajib maupun yang Sunnah, “kelak akan Kami masukkan mereka ke dalam surga yang di bawahnya mengalir sungai-sungai; mereka kekal di dalamnya selama-lamanya; mereka di dalamnya mempunyai istri-istri yang suci” yaitu dari akhlak yang tercela dan budi pekerti yang hina dan juga dari apa yang dialami oleh wanita dunia dari setiap kotoran dan kekurangan, “dan Kami masukkan mereka ke tempat yang teduh lagi nyaman.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﺗﺠﺮﻱ ﻣﻦ ﺗﺤﺘﻬﺎ اﻷﻧﻬﺎﺭ} tajrii min tahtihal anhaar: mengalir sungai-sungai dari sela-sela pohon dan istananya. {ﻣﻄﻬﺮﺓ} muthohharoh: suci dari penyakit dan kotoran secara mutlak. {ﻇﻼ ﻇﻠﻴﻼ} dhillan dhaliila: rimbun selalu tanpa ada panas menyengat dan dingin menggigit. Makna ayat : Adapun ayat yang kedua (57) berisi kabar gembira untuk orang-orang yang beriman dan beramal sholih dengan menjauhi kesyirikan serta maksiat. Allah berfirman : {ﻭاﻟﺬﻳﻦ ﺁﻣﻨﻮا ﻭﻋﻤﻠﻮا اﻟﺼﺎﻟﺤﺎﺕ} “dan orang-orang yang beriman serta beramal sholih” yaitu setelah mereka meninggalkan kesyirikan dan maksiat. {ﺳﻨﺪﺧﻠﻬﻢ ﺟﻨﺎﺕ ﺗﺠﺮﻱ ﻣﻦ ﺗﺤﺘﻬﺎ اﻷﻧﻬﺎﺭ ﺧﺎﻟﺪﻳﻦ ﻓﻴﻬﺎ ﺃﺑﺪا ﻟﻬﻢ ﻓﻴﻬﺎ ﺃﺯﻭاﺝ ﻣﻄﻬﺮﺓ} “Kami akan memasukkan mereka ke dalam surga yang mengalir di bawahnya sungai-sungai. Mereka kekal di dalamnya selamanya”, maksudnya adalah para bidadari. Mereka adalah para wanita yang suci dari segala yang dapat mengganggu atau mengurangi kemolekan dan kecantikan mereka, terbebas dengan tanpa ada buang hajat kecil, besar ataupun haid. Allah berfirman {ﻭﻧﺪﺧﻠﻬﻢ ﻇﻼ ﻇﻠﻴﻼ} “dan Kami masukkan kedalam naungan yang teduh” rimbun dan sejuk terlindung dari panas dan dingin. Rasulullah bersabda pada suatu hari, “di surga ada sebuat pohon dinamakan pohon al khuld, penunggang kuda menyusuri naungannya sepanjang seratus tahun dan tidaklah naungannya itu terhenti.” Pelajaran dari ayat : • Iman dan amal sholih beserta dengan meninggalkan kesyirikan dan kemaksiatan adalah sebab didapatnya kenikmatan akhirat. • Surga adalah tempat kenikmatan yang terbebas dari hal-hal kotor yang merusak kemurniannya serta kebahagiaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 57: Dan orang-orang yang ber- iman dan mengerjakan (amal) yang baik-baik itu. Kami akan masukan mereka ke surga-surga yang ngalir padanya sungai-sungai, yang mereka akan kekal padanya selama-lamanya, yang adalah bagi mereka padanya jodoh-jodoh yang suci, dan Kami akan masukkan mereka di pernaungan (ni'mat) yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada Allah dan kepada yang wajib diimani lainnya. Yang wajib maupun yang sunat. Yakni suci, baik dari akhlak yang buruk dan tercela maupun dari haidh dan kotoran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 57",
    "description": "Sudah menjadi kebiasaan Al-Qur'an untuk menyebut sesuatu lalu menyebut lawannya. Setelah menjelaskan apa yang menimpa orang kafir, ayat ini lalu menjelaskan apa yang didapatkan oleh orang beriman. Adapun orang-orang yang beriman dengan iman yang benar dan mengerjakan kebajikan sebagai bukti dari keimanan mereka, kelak akan kami masukkan mereka ke dalam surga yang mengalir di bawahnya sungaisungai, dan mereka kekal di dalamnya selama-lamanya. Di sana, di dalam surga itu, mereka mempunyai pasangan-pasangan yang suci, dan kami masukkan mereka ke tempat yang teduh lagi nyaman yang tidak terlalu panas dan tidak pula terlalu dinginq dua ayat terakhir dijelaskan kesudahan dari dua kelompok mukmin dan kafir, yakni tentang kenikmatan dan siksaan, maka sekarang alqur'an mengajarkan suatu tuntunan hidup yakni tentang amanah. Sungguh, Allah yang mahaagung menyuruhmu menyampaikan amanat secara sempurna dan tepat waktu kepada yang berhak menerimanya, dan Allah juga menyuruh apabila kamu menetapkan hukum di antara manusia yang berselisih hendaknya kamu menetapkannya dengan keputusan yang adil. Sungguh, Allah yang telah memerintahkan agar memegang teguh amanah serta menyuruh berlaku adil adalah sebaik-baik yang memberi pengajaran kepadamu. Sungguh, Allah adalah tuhan yang maha mendengar, maha melihat."
  }
]