[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah memerintahkan kalian untuk menunaikan amanat yang berbeda-beda yang kalian dipercaya untuk menyampaikannya kepada para pemiliknya, maka janganlah kalian melalaikan amanat-amanat itu. Dan Dia memerintahkan kalian untuk memutuskan perkara diantara manusia dengan dasar keadilan dan obyektif, bila kalian memutuskan permasalahan diantara mereka. Dan itu adalah sebaik-baik nasihat yang Allah sampaikan kepada kalian dan memberi petunjuk kalian kepadanya. Sesungguhnya Allah Maha Mendengar ucapan-ucapan kalian,meneliti seluruh perbuatan kalian lagi Maha Melihatnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Sesungguhnya Allah menyuruh kalian menunaikan amanat kepada pemiliknya. Dan Dia menyuruh kalian, apabila kalian memutuskan perkara di antara manusia dalam semua urusan mereka, maka putuskanlah perkara mereka dengan adil, jangan memihak atau zalim dalam memutuskan. Sesungguhnya Allah mengingatkan dan memberi bimbingan yang sebaik-baiknya ke arahnya (menjaga amanat) dalam setiap kondisi kalian. Sesungguhnya Allah Maha Mendengar ucapan-ucapan kalian dan Maha Melihat perbuatan-perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Setelah Allah menyebutkan kabar gembira bagi orang-orang yang beriman dan beramal shalih, kemudian Allah mengarahkan mereka untuk berbuat dua jenis amalan Shalih, yaitu menunaikan amanat dan memberi keputusan bagi orang lain dengan adil. Firman ini ditujukan bagi setiap orang yang diberi amanat, baik itu yang berhubungan dengan hak Allah ataupun yang berhubungan dengan hak manusia, baik itu berupa jabatan, harta, dan lain sebagainya. kemudian Allah memuji perintah perintah dan larangan larangan yang telah ditetapkan-Nya karena mengandung kemaslahatan di dunia dan di akhirat dan menjauhkan dari mudharatnya, sebab yang menetapkan adalah Dzat yang Maha Mendengar dan Maha Melihat, tidak ada yang tersembunyi darinya, dan Maha Mengetahui kemaslahatan bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. إِنَّ اللهَ يَأْمُرُكُمْ أَن تُؤَدُّوا۟ الْأَمٰنٰتِ إِلَىٰٓ أَهْلِهَا (Sesungguhnya Allah menyuruh kamu menyampaikan amanat kepada yang berhak menerimanya) Kalimat ini mencakup seluruh manusia dalam menunaikan segala amanat, dan yang paling pertama adalah bagi para pemimpin dan penguasa yang wajib bagi mereka menunaikan amanat dan mencegah kezaliman, dan senantiasa berusaha menegakkan keadilan yang telah Allah limpahkan atas amanat yang telah mereka pikul dalam kebijakan-kebijakan mereka. Dan masuk dalam perintah ini juga selain mereka, sehingga mereka wajib menunaikan amanat yang mereka punya dan senantiasa berhatii-hati dalam menyampaikan kesaksian dan kabar berita. وَإِذَا حَكَمْتُم بَيْنَ النَّاسِ أَن تَحْكُمُوا۟ بِالْعَدْلِ ۚ(dan (menyuruh kamu) apabila menetapkan hukum di antara manusia supaya kamu menetapkan dengan adil) Keadilan disini adalah dengan tidak condongnya qadhi atau penguasa kepada salah satu pihak yang bersengketa, dan agar tidak mengutamakan seseorang atas orang lain dikarenakan hubungan kekerabatan, jabatan, kemaslahatan pribadi, atau hawa nafsu. Akan tetapi seorang qadhi memberi putusan bagi yang berhak sesuai dengan apa yang dijelaskan dalam al-Qur’an dan as-Sunnah. Dan seorang penguasa harus memperlakukan rakyatnya dengan sama rata tanpa mengutamakan seseorang kecuali dengan kadar keutamaan yang memang dimiliki orang tersebut, berupa keuletannya dalam beramal, atau berdasarkan pengalaman, pengetahuan, atau kekuatannya dalam berjihad, dan lain sebagainya. إِنَّ اللهَ كَانَ سَمِيعًۢا (Sesungguhnya Allah adalah Maha Mendengar) Yakni mendengar apa yang qadhi putuskan. بَصِيرًا (Maha Melihat) Yakni melihatnya ketika ia mengeluarkan putusannya, sehingga Allah mengetahui apakah ia berusaha untuk berlaku adil atau memberi putusan dengan hawa nafsu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Wahai manusia, sesungguhnya Allah memerintahkan kalian untuk memberikan amanat itu kepada ahlinya (yaitu setiap sesuatu yang diamanatkan seseorang yang merupakan hak orang lain, baik amanat yang diperuntukkan untuk Allah atau para hamba) Wahai para hakim dan wali, ketika kalian menentukan hukum di antara manusia maka kalian harus memutuskan dengan adil (yaitu wali atau hakim tidak condong kepada salah satu pihak, dia harus memutuskan dengan sesuai kebenaran yang dijelaskan dalam Al-Qur’an dan sunnah). Betapa nikmatnya sesuatu yang diajarkan (diperintahkan) oleh Allah kepada kalian, yaitu menunaikan amanah, dan menentukan hukum dengan adil. Sesungguhnya Maha Mendengar ucapan-ucapan kalian dan Maha Melihat amal-amal kalian. Ayat ini turun pada hari penaklukkan Mekah untuk Utsman bin Thalhah Al-Hajbiy dari Bani Abdud Dar, ketika Ali mengambil kunci Ka’bah darinya dengan paksa lalu membuka pintu Ka’bah dan Abbas ingin mengambil kunci tersebut, lalu Allah menurunkan ayat ini. Kemudian Rasulullan SAW memerintahkan Ali untuk mengembalikan kunci tersebut kepada Utsman dan meminta maaf kepadanya. Lalu Ustman masuk Islam ketika tahu bahwa Allah menjelaskan tentang haknya dalam ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Allah menyuruh kalian menyampaikan amanah kepada pemiliknya. Apabila kalian menetapkan hukum di antara manusia, hendaklah kalian tetapkan secara adil. Sesungguhnya Allah memberi pengajaran yang paling baik kepada kalian} sebaik-baik sesuatu yang diajarkan kepada kalian {Sesungguhnya Allah Maha Mendengar lagi Maha Melihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Amanah itu adalah setiap hal yang dipercayakan kepada seseorang dan ia diperintahkan untuk menunaikannya, Allah memerintahkan hamba-hambaNya agar menunaikan amanah, maksudnya secara sempurna dan penuh, tidak dikurangi, dicurangi, dan tidak pula dilur-ulur, dan termasuk dalam amanah di sini adalah amanah kekuasaan, harta, rahasia-rahasia, dan perintah-perintah yang tidak diketahui kecuali oleh Allah semata. Sesungguhnya para ahli fikih telah menyebutkan bahwa barangsiapa yang diserahkan kepadanya suatu amanah, maka ia wajib menjaga amanah tersebut dalam suatu tempat yang patut, mereka berkata, “Karena sesungguhnya tidaklah mungkin dapat ditunaikan kecuali dengan menjaganya, maka wajiblah hal itu dilakukan.” Dan Firman Allah, “Kepada yang berhak menerimanya,” sebuah dalil bahwa tidaklah diserahkan dan ditunaikan kepada selain orang yang berhak menerimanya, dan wakil orang tersebut adalah dalam posisinya, sehingga apabila ia menyerahkannya kepada selain orang yang berhak menerimanya, maka ia tidaklah dikatakan telah menunaikannya. “Dan (menyuruh kamu) apabila menetapkan hukum di antara manusia supaya kamu menetapkan dengan adil,” hal ini mencakup hukum di antara mereka dalam perkara darah, harta, maupun kehormatan, baik sedikit maupun banyak, terhadap yang dekat maupun yang jauh, seorang yang baik maupun yang jahat, seorang teman maupun musuh. Maksud dari adil disini adalah yang diperintahkan oleh Allah untuk berhukum dengannya yaitu apa yang disyariiatkan oleh Allah melalui lisan RasulNya berupa ketentuan-ketentuan dan hukum-hukum. Hal ini menuntut untuk mengetahui keadilan agar dapat menetapkan hukum dengannya, dan ketika perintah-perintah tersebut adalah suatu yang baik dan adil, Allah berfirman, “Sesungguhnya Allah memberi pengajaran yang sebaik-baiknya kepadamu. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat,” ini merupakan pujian dari Allah bagi perintah-perintahNya dan larangan-laranganNya, karena mencakup kemaslahatan dunia dan akhirat dan menolak kemudharatan pada keduanya, karena sesungguhnya Dzat yang mensyariatkannya adalah Maha Mendengar lagi Maha Melihat, yang tidak ada sesuatu pun yang tersembunyi bagiNya dan Dia mengetahui kemaslahatan hamba, yang mereka sendiri tidak mengetahuinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: {أَنْ تُؤَدُّوا الأَمَانَاتِ} an tu’addul amaanaat: menunaikan amanah adalah menyerahkannya kepada orang yang berhak. Amanah adalah suatu hal yang dipercayakan seseorang, berupa perkataan, pekerjaan ataupun benda. {الْعَدْلِ} al ‘adl: keadilan adalah lawan dari kezhaliman dan melenceng dengan mengurangi atau menambah. {نِعِمَّا يَعِظُكُمْ} ni’immaa ya’izhukum: memerintahkan untuk menunaikan amanah dan hukum dengan adil. Makna Ayat: Diriwayatkan bahwa ayat yang pertama {إِنَّ اللهَ يَأْمُرُكُمْ أَنْ تُؤَدُّوا الأَمَانَاتِ} “Sesungguhnya Allah memerintahkan kalian untuk menunaikan amanah-amanah”, ayat ini diturunkan dalam perkara ‘Utsman bin Tholhah al Hajabi, tatkala kunci ka’bah ditangannya sebagai orang yang biasa menjamu para jamaah haji, Rasulullah meminta kunci Ka’bah darinya pada subuh saat Fathumakkah, kemudian Rasulullah mendirikan sholat di Ka’bah sebanyak 2 rakaat lalu keluar, Al-Abbas berkata, “Berikanlah kuncinya kepadaku, wahai Rasul, untuk mengambil alih komando kebiasaan memberi makan dan minum para jamaah haji.” maka turunlah ayat ini dan ayat setelahnya, lalu Rasul membacanya kepada orang-orang, dan memanggil ‘Utsman bin Tholhah serta memberikan kepadanya kuci Ka’bah. Dikarenakan pelajaran dari ayat ini adalah dengan mengambil keumuman lafaznya bukan dikarenakan kekhususan sebab diturunkannya, maka ayat ini berlaku untuk diterapkan dalam setiap amanah. Maka wajib bagi setiap orang yang dipercayakan kepadanya suatu hal agar menjaga dan mengurusnya sampai amanah hal tersebut ditunaikan dan disampaikan kepada orang yang berhak. Oleh karenanya ayat ini membahas tentang para pemimpin kaum muslimin terlebih dahulu dengan indikasi {ﻭﺇﺫا ﺣﻜﻤﺘﻢ ﺑﻴﻦ اﻟﻨﺎﺱ ﺃﻥ ﺗﺤﻜﻤﻮا ﺑﺎﻟﻌﺪﻝ} “Jikalau kalian menghukumi di antara para manusia, maka hukumilah secara adil”, yaitu seimbang, kebalikan dari zhalim. Dan makna adil adalah menyampaikan semua hak kepada yang berhak dari setiap rakyat. Dan firman Allah {ﺇﻥ اﻟﻠﻪ ﻧﻌﻤﺎ ﻳﻌﻈﻜﻢ ﺑﻪ}, yang dikehendaki Allah adalah memerintahkan umat Islam, pemimpin ataupun rakyatnya agar menunaikan amanah dan berhukum dengan adil dan itu adalah sesuatu yang baik. Demikian pula kerena tegaknya kehidupan yang mulia adalah dengan dibangkitkannya penunaian amanah dan berhukum dengan adil. Dan firman Allah : {ﺇﻥ اﻟﻠﻪ ﻛﺎﻥ ﺳﻤﻴﻌﺎ ﺑﺼﻴﺮا} “Sesungguhnya Allah Maha mendengar dan maha melihat” di dalamnya ada anjuran kepada para manusia agar memunculkan rasa diawasi oleh Allah di dalam dirinya. Karena barang siapa yang mengingat bahwa Allah mendengar setiap perkataan dan melihat setiap perbuatanya, niscaya dia akan menjadi lurus dalam perkataan tanpa ada kedustaan serta dalam perbuatannya tidak akan ceroboh. Ini adalah apa yang ada di ayat yang pertama (58) Pelajaran dari ayat : • Wajibnya menyampaikan amanah setelah usai dijaga. • Wajibnya berlaku adil dalam menghukumi dan haramnya kezhaliman dan ketidakadilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 58: Sesungguhnya Allah memerintah kamu menunaikan amanat-amanat kepada yang berhak; dan apabila kamu menghukum antara manusia, supaya kamu menghukum dengan adil. Sesungguhnya Allah menasehati kamu dengan sebaik-baik perkara, karena sesungguhnya Allah itu adalah Pendengar, Pelihat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun ketika Ali radhiyallahu 'anhu hendak mengambil kunci Ka'bah secara paksa dari Utsman bin Thalhah pelayan Ka'bah pada saat Nabi shallallahu 'alaihi wa sallam datang ke Makkah untuk Fathu Makkah (menaklukkan Makkah). Namun Utsman bin Thalhah menolaknya dan berkata, \"Kalau seandainya aku mengetahui Beliau adalah utusan Allah, tentu aku tidak menolaknya\", maka Rasulullah shallallahu 'alaihi wa sallam memerintahkan Ali mengembalikan dan bersabda, \"Ambillah! untuk selamanya karena sudah lama\", maka Utsman pun heran, kemudian Ali membacakan ayat ini kepadanya, maka Utsman bin Thalhah masuk Islam, dan ia memberikan kunci kepada saudaranya Syaibah menjelang wafatnya, dan kunci pun dipegang oleh anak cucunya.\" Ayat di atas, meskipun turunnya berkenaan dengan sebab tertentu, namun berlaku umum berdasarkan qarinah (tanda) jama' (yang diperuntukkan untuk semua). Amanat artinya setiap yang dibebankan kepada manusia dan mereka diperintahkan melakukannya. Allah Subhaanahu wa Ta'aala memerintahkan hamba-hamba-Nya menunaikan amanat, yakni secara sempurna; tidak dikurangi dan tidak ditunda-tunda. Termasuk ke dalam amanat adalah amanat untuk beribadah (seperti shalat, zakat, puasa dsb), amanat jabatan, harta dan rahasia serta perkara-perkara yang hanya diketahui oleh Allah. Contoh menunaikan amanat dalam jabatan adalah dengan memenuhi kewajibannya, memenuhi amanat dalam harta adalah dengan menjaganya dan mengembalikan kepada pemiliknya secara utuh dan amanat dalam rahasia adalah dengan menyembunyikannya. Ayat ini menunjukkan bahwa amanat tersebut harus diserahkan kepada yang berhak menerimanya atau wakilnya. Oleh karena itu, jika tidak diserahkan kepada yang berhak menerimanya, maka sama saja belum menunaikan amanat. Baik dalam masalah darah, harta, kehormatan; kecil maupun besar. Demikian juga kepada kerabat maupun bukan, kawan maupun lawan dan orang baik maupun orang jahat. Adapun yang dimaksud adil di sini adalah dengan mengikuti syari'at Allah melalui lisan Rasul-Nya shallallahu 'alaihi wa sallam seperti dalam masalah ahkam (hukum) maupun hudud, dan hal ini menghendaki agar kita mengetahui kedilan itu agar dapat memutuskan dengannya. Kata-kata ini merupakan pujian Allah terhadap syari'at-Nya karena di dalamnya mengandung maslahat manusia di dunia dan akhirat serta menghindarkan madharat. Yang demikian. Karena yang menetapkannya adalah Tuhan yang Maha Mendengar lagi Maha Mengetahui, Dia mengetahui maslahat yang terbaik bagi hamba yang mereka tidak mengetahuinya. Semua perkataan. Semua tindakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 58",
    "description": "Dua ayat terakhir dijelaskan kesudahan dari dua kelompok mukmin dan kafir, yakni tentang kenikmatan dan siksaan, maka sekarang alqur'an mengajarkan suatu tuntunan hidup yakni tentang amanah. Sungguh, Allah yang mahaagung menyuruhmu menyampaikan amanat secara sempurna dan tepat waktu kepada yang berhak menerimanya, dan Allah juga menyuruh apabila kamu menetapkan hukum di antara manusia yang berselisih hendaknya kamu menetapkannya dengan keputusan yang adil. Sungguh, Allah yang telah memerintahkan agar memegang teguh amanah serta menyuruh berlaku adil adalah sebaik-baik yang memberi pengajaran kepadamu. Sungguh, Allah adalah tuhan yang maha mendengar, maha melihatagar penetapan hukum dengan adil tersebut dapat dijalankan dengan baik, maka diperlukan ketaatan terhadap siapa penetap hukum itu. Ayat ini memerintahkan kaum muslim agar menaati putusan hukum, yang secara hirarkis dimulai dari penetapan hukum Allah. Wahai orang-orang yang beriman! taatilah perintah-perintah Allah dalam alqur'an, dan taatilah pula perintah-perintah rasul Muhammad, dan juga ketetapan-ketetapan yang dikeluarkan oleh ulil amri pemegang kekuasaan di antara kamu selama ketetapan-ketetapan itu tidak melanggar ketentuan Allah dan rasul-Nya. Kemudian, jika kamu berbeda pendapat tentang sesuatu masalah yang tidak dapat dipertemukan, maka kembalikanlah kepada nilai-nilai dan jiwa firman Allah, yakni Al-Qur'an, dan juga nilai-nilai dan jiwa tuntunan rasul dalam bentuk sunahnya, sebagai bukti jika kamu benar-benar beriman kepada Allah dan hari kemudian. Yang demikian itu lebih utama bagimu dan lebih baik akibatnya, baik untuk kehidupan dunia kamu, maupun untuk kehidupan akhirat kelak."
  }
]