[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNYA serta melaksanakan syariatNYA, laksanakanlah perintah-perintah Allah dan janganlah kalian mendurhakaiNYa, dan penuhilah panggilan rasulNYA dengan mengikuti kebenaran yang dibawanya, dan taatilah para penguasa kalian dalam perkara selain maksiat kepada Allah. Apabila kalian berselisih paham dalam suatu perkara diantara kalian,maka kembalikanlah ketetapan hukumnya kepada kitab Allah dan Sunnah rasulNYA, Muhammad , jika kalian memang beriman dengan sebenar-benarnya kepada allah dan hari perhitungan. Mengembalikan persoalan kepada al-qur’an dan assunnah itu adalah lebih baik bagi kalian daripada berselisih paham dan pendapat atas dasar pikiran belaka dan akan lebih baik akibat dan dampaknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya! Taatlah kalian kepada Allah dan taatlah kalian kepada rasul-Nya dengan menjalankan apa yang Dia perintahkan dan menjauhi apa yang Dia larang, dan taatlah kalian kepada para pemimpin kalian sepanjang mereka tidak menyuruh kalian berbuat maksiat. Apabila kalian berselisih paham tentang sesuatu, kembalilah kepada kitabullah dan sunah nabi-Nya -ṣallallāhu 'alaihi wa sallam- terkait masalah itu, jikalau kalian benar-benar beriman kepada Allah dan hari Akhir. Sikap kembali kepada kitab suci dan sunah itu lebih baik bagi kalian daripada mempertahankan perselisihan itu dan mengandalkan pendapat akal, serta lebih baik akibatnya bagimu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. setelah Allah memerintahkan para pemimpin dan orang yang memiliki jabatan untuk bersikap adil terhadap rakyatnya, kemudian Allah memerintahkan para rakyat untuk taat kepada para pemimpin mereka; Dia berfirman: taatilah Allah jalan hukum-hukumnya, dan taatilah Rasulullah dalam setiap perintahnya, serta taatilah setiap orang yang mengatur urusan kaum muslimin. jika kalian berselisih dengan pemimpin karya dalam suatu perkara agama maka kembalilah kepada Al-quran dan as-sunnah,sebab ini merupakan asas dari keimanan serta mengandung kesudahan yang yang lebih baik bagi kalian di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. أَطِيعُوا۟ اللهَ وَأَطِيعُوا۟ الرَّسُولَ (taatilah Allah dan taatilah Rasul (Nya)) Setelah Allah memerintahkan para qadhi dan penguasa apabila mereka memutuskan perkara diantara rakyatnya agar mereka memutuskannya dengan kebenaran, maka disini Allah memerintahkan para rakyat untuk mentaati pemimpin mereka. Dan hal itu didahului dengan perintah untuk mentaati-Nya dan mentaati Rasul, karena qadhi atau penguasa apabila menyelisihi hukum Allah dan rasul-Nya maka hukum mereka tidak berlaku. وَأُو۟لِى الْأَمْرِ (dan ulil amri) Mereka adalah para Imam, Sultan, Qadhi, dan semua yang memiliki kekuasaan yang syar’i dan bukan kekuasaan yang mengikuti thaghut. Yang dimaksud dengan ketaatan kepada perintah dan larangan mereka adalah dalam apa yang bukan kemaksiatan sebagaimana telah datang hadist dari Rasulullah (tidak ada ketaatan bagi makhluk dalam kemaksiatan kepada Allah). Dan pendapat lain mengatakan yang dimaksud dengan ulil amri adalah para ulama al-qur’an dan fiqih yang menyuruh kepada kebenaran dan menfatwakannya sedang mereka memiliki ilmunya. فَإِن تَنٰزَعْتُمْ (Kemudian jika kamu berlainan pendapat) Yakni antara sebagian kalian dengan sebagian yang lain, atau sebagian kalian dengan para pemimpin. فِى شَىْءٍ (tentang sesuatu) Yang mencakup urusan-urusan keagamaan dan keduniaan. فَرُدُّوهُ إِلَى اللهِ وَالرَّسُولِ (maka kembalikanlah ia kepada Allah dan Rasul) Adapun mengembalikannya kepada Allah adalah dengan mengembalikannya kepada al-Qur’an, dan mengembalikannya kepada Rasul adalah dengan mengembalikannya kepada sunnah-sunnahnya setelah kematiannya, namun ketika ia masih hidup maka dengan bertanya dan meminta hukum dan putusan kepadanya. إِن كُنتُمْ تُؤْمِنُونَ بِاللهِ وَالْيَوْمِ الْاٰخِرِ ۚ (jika kamu benar-benar beriman kepada Allah dan hari kemudian) Pengembalian hukum kepada Allah dan rasul-Nya merupakan suatu kewajiban bagi kedua belah pihak yang berselisih, dan ini merupakan salah satu sifat dari orang yang beriman kepada Allah dan hari akhir. ذٰلِكَ (Yang demikian itu) Isyarat ini ditujukan pada pengembalian hukum yang diperintahkan tersebut. خَيْرٌ (lebih utama) Yakni lebih utama bagi kalian. وَأَحْسَنُ تَأْوِيلًا(dan lebih baik akibatnya) yakni Allah dan Rasul-Nya adalah rujukan yang lebih baik daripada anggapan kalian bahwa apabila terjadi perselisihan kalian merujuk kepada selain Allah dan rasul-Nya. Pendapat lain mengatakan yang dimaksud adalah lebih baik balasan dan bahalanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ } “Kemudian jika kamu berlainan pendapat tentang sesuatu, maka kembalikanlah ia kepada Allah (Al Quran) dan Rasul (sunnahnya)” Ayat ini menunjukkan kesempurnaan wahyu Allah, karena jika hal itu bertolak belakang maka tidaklah Allah memerintahkan untuk kembali kepada wahyu-Nya. 2 ). Pengingkaran tidak akan terjadi dalam rana umat islam kecuali mereka telah berselisih, maka dapat dipungkiri bahwa perseisihan dan perbedaan pandangan adalah satu hal yang lumrah tetapi Allah melalui firman-Nya menyampaikan kepada kita satu petunjuk yang membawa kepada keberuntungan, Allah berfirman : { فَإِنْ تَنَازَعْتُمْ فِي شَيْءٍ فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ } \"Kemudian jika kamu berlainan pendapat tentang sesuatu, maka kembalikanlah ia kepada Allah (Al Quran) dan Rasul (sunnahnya)\" , karena dengan tindakan itu semuanya akan menjadi lebih baik : { ذَٰلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلً } \"Yang demikian itu lebih utama (bagimu) dan lebih baik akibatnya\". 3 ). { فَرُدُّوهُ إِلَى اللَّهِ وَالرَّسُولِ } Dan Allah tidak mengatakan : و إلى الرسول ; karena sesungguhnya dengan kembali kepada al-qur’an sudah pasti kembali kembali Allah dan Rasul-Nya, dan apa yang Allah tetapkan hukumnya maka pada hakikatnya Rasulullah berhukum dengannya, dan apa yang Rasullah tetapkan hukumnya hakikatnya adalah hukum Allah, maka jika engkau mengembalikan suatu perkara yang kamu sedang berselisih tentangnya kepada Allah (kitab-Nya) maka kalian telah mengembalikan perkara tersebut kepada hukum Rasulullah, begitupun sebaliknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Wahai orang-orang mukmin, taatlah kepada Allah dalam apa yang diturunkanNya dalam Al-Qur’an, taatlah kepada rasulullah dalam sesuatu yang tercantum dalam sunnah dengan tegas, dan taatlah kepada ulama’ yang memerintahkan kebaikan, serta para pemimpin dan orang yang punya otoritas dalam perkara yang mereka perintahkan berupa ketaatan kepada Allah dan kebaikan yang bersifat umum terkait masalah keduniaan. Ketika kalian berselisih dalam hal yang terkait urusan agama dan dunia, maka kembalikanlah perkara tersebut kepada Al-Qur’an dan sunnah yang suci, jika kalian benar-benar beriman kepada Allah dan hari akhir, yaitu sesungguhnya hal itu merupakan tindakan orang yang beriman. Dan mengembalikan perkara tersebut kepada Al-Qur’an dan sunnah itu lebih baik bagi kalian di sisi Tuhan, dan merupakan tempat rujukan paling baik daripada kalian mengembalikannya kepada hawa nafsu kalian. Ayat ini turun untuk Abdullah bin Hudzafah yang diutus Rasulullah SAW secara rahasia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, taatilah Allah dan taatilah Rasul serta pemegang kekuasaan di antara kalian. Jika kalian berselisih} berselisih {tentang sesuatu, kembalikanlah} maka kembalikanlah keputusannya {kepada Allah dan Rasul} kepada kitab Allah dan sunnah Rasulullah SAW {jika kalian beriman kepada Allah dan hari akhir. Yang demikian itu lebih baik dan lebih bagus akibatnya} akibat dan keuntungannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Kemudian Allah memerintahkan untuk taat kepadaNya dan taat kepada RasulNya, yaitu dengan melaksanakan perintah keduanya yang wajib dan yang Sunnah, serta menjauhi larangan keduanya. Allah juga memerintahkan untuk taat kepada para pemimpin, mereka itu adalah orang-orang yang memegang kekuasaan atas manusia, yaitu para penguasa, para hakim, dan para ahli fatwa (mufti), sesungguhnya tidaklah akan berjalan baik urusan agama dan dunia manusia kecuali dengan taat dan tunduk kepada mereka, sebagai suatu tindakan ketaatan kepada Allah dan mengharap apa yang ada di sisiNya, akan tetapi dengan syarat bila mereka tidak memerintahkan kepada kemaksiatan kepada Allah, dan bila mereka memerintahkan kepada kemaksiatan kepada Allah, maka tidak ada ketaatan kepada makhluk dalam kemaksiatan kepada Allah. Dan bisa jadi inilah rahasia dari dihilangkannya kata kerja “taat” pada perintah taat kepada mereka dan penyebutannya bersama dengan taat kepada Rasul, karena sesungguhnya Rasul tidaklah memerintahkan kecuali ketaatan kepada Allah, dan barangsiapa yang taat kepadanya, sesungguhnya ia telah taat kepada Allah, adapun para pemimipin, maka syarat taat kepada mereka adalah bahwa apa yang diperintahkan bukanlah suatu kemaksiatan. Kemudian Allah memerintahkan agar mengembalikan segala pekara yang diperselisihkan oleha manusia dari perkara-perkara yang merupakan dasar-dasar agama ataupun cabang-cabangnya kepada Allah dan RasulNya, maksudnya kepada kepada kitabullah dan Sunnah RasulNya, karena pada kedua hal itu ada keputusan yang adil bagi seluruh masalah yang diperselisihkan, yaitu dengan pengungkapannya secara jelas oleh keduanya atau secara umum atau isyarat atau peringatan atau pemahaman atau keumuman makna yang dapat diqiyaskan dengannya segala hal yang sejenis dengan keumuman makna tersebut, karena sesungguhnya di atas Kitabullah dan Sunnah RasulNya agama tegak berdiri, dan tidaklah akan lurus iman seseorang kecuali dengan mengimani keduanya, maka mengembalikan perkara kepada keduanya adalah syarat keimanan, karena itulah Allah berfirman, “Jika kamu benar-benar beriman kepada Allah dan Hari Kemudian” hal ini menunjukkan bahwa barangsiapa yang tidak mengembalikan perkara-perkara yang diperselisihkan kepada keduanya, maka ia bukanlah seorang Mukmin yang hakiki, akan tetapi ia adalah seorang yang percaya thagut sebagaimana yang Allah sebutkan dalam ayat selanjutnya, “Yang demikian itu” yaitu mengembalikan kepada Allah dan RasulNya, “lebih utama (bagimu) dan lebih baik akibatnya,” karena sesungguhnya hukum Allah dan RasulNya adalah sebaik-baik hukum, seadil-adilnya, dan paling berguna bagi manusia dalam urusan agama, dunia, dam hasil akhirat mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {وَأُولِي الأَمْرِ مِنْكُمْ} wa ulil amri minkum: Ulil amri adalah para pemimpin dan ulama dari kalangan muslimin. {تَنَازَعْتُمْ فِي شَيْءٍ} tanaaza’tum fii syai’: kalian berbeda pendapat dalam suatu perkara, setiap kelompok menginginkan merebutnya dari kelompok yang lain. {فَرُدُّوهُ إِلَى اللهِ وَالرَّسُولِ} farudduu hu ilaallahi war Rasul: kembali kepada kitab Allah dan Rasulnya. {وَأَحْسَنُ تَأْوِيلاً} wa ahsana ta’wiilaa: sebaik-baiknya akibat, karena arti ta’wil perkara adalah sesuatu yang kembali kepada perkara tersebut pada akhirnya. Makna ayat : Di Ayat yang kedua (59), kala Allah memerintahkan para pemimpin kaum muslimin untuk menunaikan amanah-amanah yang mana itu adalah berupa hak-hak para rakyat, menegakan hukum diantara mereka dengan adil, memerintahkan kaum mukminin agar taat kepada Allah dan kepada Rasul terlebih dahulu kemudian taat kepada para pemimpin. Allah berfirman {ﻳﺎ ﺃﻳﻬﺎ اﻟﺬﻳﻦ ﺁﻣﻨﻮا ﺃﻃﻴﻌﻮا اﻟﻠﻪ ﻭﺃﻃﻴﻌﻮا اﻟﺮﺳﻮﻝ ﻭﺃﻭﻟﻲ اﻷﻣﺮ ﻣﻨﻜﻢ} “Wahai orang-orang yang beriman, taatilah Allah dan taatilah Rasul dan para pemimpin kalian” dan ketaatan kepada pemerintah adalah ketaatan yang terikat dengan hal yang makruf secara syariat; jika bukan hal yang makruf, maka tidak ada pilihan keuali taat kepada Allah. Berdasarkan sabda Rasul, “Ketaatan hanya dalam perbuatan makruf, tidak dinamakan sebuah ketaatan jika patuh kepada makhluk dalam berbuat maksiat pada sang Pencipta”. Firman Allah: {ﻓﺈﻥ ﺗﻨﺎﺯﻋﺘﻢ ﻓﻲ ﺷﻲء ﻓﺮﺩﻭﻩ ﺇﻟﻰ اﻟﻠﻪ ﻭاﻟﺮﺳﻮﻝ} “Apabila kalian berseteru dalam suatu hal, maka kembalikanlah kepada Allah dan Rasul”, konteks ayat ini adalah umum untuk para pemimpin juga untuk rakyat. Kapanpun terjadi perselisihan dalam perkara agama ataupun dunia, wajib untuk dikembalikan kepada Al Quran dan Sunnah Rasulullah, diterima manis ataupun pahitnya yang diputuskan oleh Allah dan Rasul. Allah berfirman pula: {ﺇﻥ ﻛﻨﺘﻢ ﺗﺆﻣﻨﻮﻥ ﺑﺎﻟﻠﻪ ﻭاﻟﻴﻮﻡ اﻵﺧﺮ} “Jikalau kalian itu beriman kepada Allah dan hari akhir”, dalam ayat ini terdapat penjelasan, bahwa iman akan berkonsekuensi dengan kepatuhan terhadap keputusan Allah dan Rasul-Nya. Faidah dari ayat ini adalah dengan mengembalikan perkara-perkara yang diperselisihkan kepada selain syariat adalah sebuah aib di dalam keimanan seorang muslim. Allah berfirman {ﺫﻟﻚ ﺧﻴﺮ ﻭﺃﺣﺴﻦ ﺗﺄﻭﻳﻼ} Allah menghendaki dari ayat itu agar manusia dalam hal permasalahan dan peradilan yang mana terdapat perbedaan pendapat di dalamnya, untuk kembali dan merujuk kepada Al Qur’an dan Hadits. Itulah hal yang baik dan tempat rujuk yang baik yang mana akan memutus perdebatan dan melaju dengan penuh amanah persatuan dan cinta damai. Pelajaran dari ayat : • Wajibnya ketaatan kepada Allah, ketaatan kepada Nabi dan kepada para pemimpin kaum muslimin dari kalangan pemerintah maupun dari ulama. Karena patuh kepada Nabi termasuk ketaatan kepada Allah; dan patuh kepada pemimpin adalah termasuk taat kepada Nabi. Rasul ﷺ bersabda, “Barang siapa yang taat kepada diriku, maka dia telah taat kepada Allah. Siapa pun yang patuh kepada pemimpinku, maka telah patuh kepada diriku. Barang siapa berbuat durhaka kepadaku, maka telah durhaka kepada Allah; dan barang siapa berbuat durhaka pada pemimpin, maka telah berbuat durhaka kepada diriku.” • Wajibnya merujuk kepada Allah dan Hadits dalam perdebatan perihal akidah, ibadah dan peradilan. • Terciptanya hasil yang terpuji dan keadaan yang baik lagi bahagia bagi umat Islam yang telah merujuk kepada Al Quran dan Hadits dalam perdebatan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 59: Hai orang-orang yang beriman! Taatlah kepada Allah dan taatlah kepada Rasul dan kepada orang-orang yang berkuasa dari antara kamu. Maka sekiranya kamu berbantahan di satu perkara, hendaklah kamu kembalikan dia kepada Allah dan Rasul, jika adalah kamu beriman ke- pada Allah dan hari Kemudian. Yang demikian itu sebaik-baik dan sebagus-bagus ta’wil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma tentang ayat, \"Athii'ullah wa athii'urrasuula wa ulil amri minkum,\" ia berkata, \"Ayat ini turun berkenaan dengan Abdullah bin Hudzafah bin Qais ketika Nabi shallallahu 'alaihi wa sallam mengirimnya dalam suatu sariyyah (pasukan kecil).\" Imam Bukhari juga meriwayatkan dari Ali radhiyallahu 'anhu, ia berkata: Nabi shallallahu 'alaihi wa sallam mengirimkan sariyyah dan mengangkat seorang Anshar sebagai pimpinannya dan memerintahkan mereka untuk menaatinya. Suatu ketika pimpinan itu marah dan berkata, \"Bukankah Nabi shallallahu 'alaihi wa sallam memerintahkan kamu menaatiku?\" Mereka menjawab, \"Ya.\" Pimpinan itu berkata, \"Kalau begitu, kumpulkanlah kepadaku kayu bakar.\" Mereka pun mengumpulkannya. Pimpinan itu berkata, \"Nyalakanlah api.\" Maka mereka menyalakan, lalu pimpinan itu berkata, \"Masuklah kamu ke dalamnya.\" Mereka pun hampir mau melakukannya, namun sebagian mereka menahan sebagian yang lain, dan mereka berkata, \"(Sesungguhnya) kami melarikan diri kepada Nabi shallallahu 'alaihi wa sallam dari api (neraka).\" Mereka tetap seperti itu hingga api itu padam sehingga hilanglah kemarahan pimpinan itu, lalu disampaikanlah berita itu kepada Nabi shallallahu 'alaihi wa sallam, kemudian Beliau bersabda, \"Jika sekiranya mereka masuk ke dalamnya, tentu mereka tidak akan keluar sampai hari kiamat. Sesungguhnya ketaatan itu hanyalah dalam hal yang ma'ruf (wajar).\" Dengan mengerjakan yang wajib maupun yang sunat dan menjauhi larangan. Termasuk ke dalam ulil amri adalah pemerintah, para hakim dan para mufti (ulama). Hal itu dikarenakan, urusan manusia baik agama maupun dunia tidak akan baik kecuali dengan tunduk dan menaati mereka sebagai bentuk ketaatan kepada Allah dan sambil berharap pahala dari sisi-Nya. Tentunya dengan syarat mereka tidak memerintahkan maksiat. Jika memerintahkan maksiat, maka tidak boleh ditaati. Dalam ayat tersebut, ketaatan kepada ulil amri tidak disebutkan ulang sebagaimana ketaatan kepada Allah dan rasul-Nya. Hal itu, karena ketaatan kepada ulil amri dengan syarat, yakni tidak memerintahkan maksiat. Faedah: Apakah pemerintah yang zalim harus ditaati juga perintahnya jika bukan maksiat? Jawab: Ya, pemerintah yang zhalim juga harus dita’ati dalam perkara yang ma’ruf (bukan maksiat serta sanggup dikerjakan), berdasarkan sabda Rasulullah shallalllahu 'alaihi wa sallam: أَلَا مَنْ وَلِيَ عَلَيْهِ وَالٍ فَرَآهُ يَأْتِي شَيْئًا مِنْ مَعْصِيَةِ اللَّهِ فَلْيَكْرَهْ مَا يَأْتِي مِنْ مَعْصِيَةِ اللَّهِ وَلَا يَنْزِعَنَّ يَدًا مِنْ طَاعَةٍ (مسلم) “Ingatlah! Barang siapa yang dipimpin oleh seorang pemimpin, lalu ia melihat pemimpinnya melakukan sebuah kemaksiatan kepada Allah. Maka bencilah maksiat yang dilakukannya, namun jangan keluar dari keta’atan kepadanya (memberontak).” (HR. Muslim) Baik dalam masalah ushuluddin (dasar-dasar agama) maupun furu' (cabang-cabangnya). Karena di dalamnya terdapat penyelesai terhadap masalah khilafiyyah, baik dengan ketegasannya, keumumannya, isyaratnya, perhatian darinya, mafhum daripadanya atau dari keumuman maknanya, di mana semua yang masih samar diqiaskan dengannya. Oleh karena itu, orang yang tidak mengembalikan masalah kepada keduanya, bukanlah seorang mukmin yang sesungguhnya, bahkan ia sama saja beriman kepada thagut sebagaimana akan diterangkan dalam ayat selanjutnya. Daripada berkata menurut pendapatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 59",
    "description": "Agar penetapan hukum dengan adil tersebut dapat dijalankan dengan baik, maka diperlukan ketaatan terhadap siapa penetap hukum itu. Ayat ini memerintahkan kaum muslim agar menaati putusan hukum, yang secara hirarkis dimulai dari penetapan hukum Allah. Wahai orang-orang yang beriman! taatilah perintah-perintah Allah dalam alqur'an, dan taatilah pula perintah-perintah rasul Muhammad, dan juga ketetapan-ketetapan yang dikeluarkan oleh ulil amri pemegang kekuasaan di antara kamu selama ketetapan-ketetapan itu tidak melanggar ketentuan Allah dan rasul-Nya. Kemudian, jika kamu berbeda pendapat tentang sesuatu masalah yang tidak dapat dipertemukan, maka kembalikanlah kepada nilai-nilai dan jiwa firman Allah, yakni Al-Qur'an, dan juga nilai-nilai dan jiwa tuntunan rasul dalam bentuk sunahnya, sebagai bukti jika kamu benar-benar beriman kepada Allah dan hari kemudian. Yang demikian itu lebih utama bagimu dan lebih baik akibatnya, baik untuk kehidupan dunia kamu, maupun untuk kehidupan akhirat kelaksetelah menjelaskan bagaimana sikap yang harus diperankan oleh orang-orang beriman, maka ayat berikutnya menjelaskan sifat buruk yang dimiliki oleh orang-orang munafik. Tidakkah engkau, wahai nabi Muhammad dan kaum muslim, memperhatikan dengan seksama dan cermat, bagaimana orang-orang yang mengaku bahwa mereka telah beriman kepada apa yang diturunkan kepadamu, yakni Al-Qur'an, dan juga beriman kepada apa yang diturunkan sebelummu, yakni taurat, zabur, dan injil' tetapi mereka, orang-orang munafik itu, masih menginginkan ketetapan hukum kepada thagut, padahal mereka telah diperintahkan oleh yang mahakuasa melalui kitab yang diturunkan-Nya, untuk mengingkari thagut itu. Dan sikap mereka seperti itu telah dipengaruhi oleh setan yang bermaksud menyesatkan mereka dari jalan Allah dengan kesesatan yang sejauh-jauhnya."
  }
]