[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ujilah orang-orang yang berda dalam pengasuhan kalian dari anak-anak yatim untuk mengetahui kemapuan mereka mengelola harta mereka dengan baik, sehingga apabila dia telah mencapai usia baligh dan kalian melihat keshalihan pribadi mereka dalam beragama dan kemampuan untuk menjaga harta benda mereka, maka serahkanlah (harta benda) itu kepada mereka, dan janganlah kalian berbuat melampaui batas terhadapnya dengan mempergunakannya bukan pada tempat yang sepatutnya dengan berlebih-lebihan dan bersegera menghabiskannya sebelum mereka mengambilnya dari kalian. Barangsiapa diantara kalian memiliki harta cukup ,hendaknya menjaga diri dengan kecukupan yang ada pada dirinya dan tidak mengambil sedikitpun dari harta anak yatim. Dan barang siapa yang miskin, hendaknya mengambil sesuai kebutuhannya saja ketika darurat. Lalu apabila kalian telah mengetahui bahwa mereka mampu menjaga harta-harta mereka setelah mereka mencapai usia baligh dan kalian serahkan harta itu kepada mereka maka persaksikanlah atas mereka, demi memastikan sampainya hak mereka dengan sempurna kepada mereka, dan agar mereka tidak mengingkari di kemudian hari. Dan cukuplah Allah bagi kalian bahwa DIA mengawasi kalian dan memperhitungkan amal perbuatan kalian sesuai apa yang kalian perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan ujilah anak-anak yatim itu -wahai para wali- apabila mereka mendekati usia balig. Yaitu memberikan sebagian harta mereka untuk mereka belanjakan sendiri. Apabila mereka mampu mengelolanya dengan baik dan kalian melihat kedewasaan mereka, maka serahkanlah harta mereka secara lengkap tanpa dikurangi sedikit pun. Dan janganlah kalian memakan harta mereka melampaui batas yang diperbolehkan Allah untuk kalian ketika kalian membutuhkannya. Dan janganlah kalian terburu-buru memakan harta mereka karena takut mereka akan mengambilnya ketika mereka balig. Barangsiapa di antara kalian yang memiliki harta yang cukup, maka sebaiknya ia menahan diri untuk tidak memakan harta anak yatim. Tetapi barangsiapa di antara kalian yang miskin dan tidak punya harta, maka sepatutnya ia makan (dari harta anak yatim) menurut kebutuhannya. Apabila kamu menyerahkan harta mereka setelah mereka balig dan dewasa, maka persaksikanlah penyerahan itu dalam rangka menjaga hak-hak dan mencegah timbulnya perselisihan. Cukuplah Allah menjadi saksi atas hal tersebut dan menjadi penghitung amal perbuatan manusia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Ujilah anak-anak yatim yang kalian usuh untuk mengetahui kemampuan mereka mengatur harta mereka, sampai masa mereka dewasa. Jika kalian mendapati mereka telah mampu menjaga agama dan harta mereka maka serahkanlah harta mereka. Dan janganlah kalian berbuat curang terhadap harta mereka dengan menghambur-hamburkan harta tersebut sebelum mereka dewasa, sebab ketika mereka dewasa, mereka akan mengambil harta tersebut. Jika pengasuh anak yatim adalah orang kaya, maka hendaklah ia tidak memakai harta anak yatim tersebut. Dan jika pengasuh itu adalah orang miskin maka tidak mengapa ia memakai harta itu sekedarnya saja atau sesuai besar kecil tenaga yang ia keluarkan dalam menjaga anak yatim dan hartanya. Jika kalian menyerahkan harta mereka setelah mereka dewasa maka datangkanlah saksi untuk menyaksikan bahwa kalian telah menyerahkan harta itu kepada anak-anak yatim itu. Dan cukuplah Allah sebagai pengawas kalian dan pemberi perhitungan terhadap kalian atas pengasuhan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَابْتَلُوا۟ الْيَتٰمَىٰ (Dan ujilah anak yatim itu) Yakni dengan memperhatikan akhlak dari anak yatim tersebut untuk mengetahui kecerdasannya dan kemampuannya dalam memperlakukan harta, dengan cara memberikannya sebagian hartanya dan menyuruhnya untuk mengatur harta tersebut agar dapat diketahui kemampuan sebenarnya dalam berurusan dengan harta. حَتَّىٰٓ إِذَا بَلَغُوا۟ النِّكَاحَ(sampai mereka cukup umur untuk kawin) Dan termasuk dari tanda-tanda baligh adalah keluarnya mani dan bulu kemaluan atau hamil dan haidh bagi perempuan. فَإِنْ ءَانَسْتُم(Kemudian jika menurut pendapatmu) Yakni jika menurut pandangan dan penglihatan kalian. مِّنْهُمْ رُشْدًا(mereka telah cerdas (pandai memelihara harta)) Yakni janganlah kalian serahkan harta anak yatim kepada mereka kecuali setelah mereka baligh dan setalah kalian berpandangan bahwa mereka telah cerdas dalam berurusan dengan harta mereka dan tidak berlaku mubadzir, dan dapat meletakkan harta tersebut ditempat yang semestinya. وَلَا تَأْكُلُوهَآ إِسْرَافًا وَبِدَارًا أَن يَكْبَرُوا۟ ۚ (Dan janganlah kamu makan harta anak yatim lebih dari batas kepatutan dan (janganlah kamu) tergesa-gesa (membelanjakannya) sebelum mereka dewasa) Yakni jangn kalian memakannya dengan berlebih-lebihan dan tergesa-gesa sebelum mereka dewasa dan mengatakan kita belanjakan harta anak-anak yatim ini sesuai keinginan kita sebelum mereka mencapai baligh lalu mengambil harta tersebut dari genggaman kita. وَمَن كَانَ غَنِيًّا فَلْيَسْتَعْفِفْ ۖ وَمَن كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ ۚ( Barang siapa (di antara pemelihara itu) mampu, maka hendaklah ia menahan diri (dari memakan harta anak yatim itu) dan barangsiapa yang miskin, maka bolehlah ia makan harta itu menurut yang patut) Yakni janganlah kalian bermewah-mewah dengan harta anak yatim dan jangan berlebihan dalam bersenang-senang dengan makanan, minuman, dan pakaian. Ada pendapat mengatakan wali yatim tidak boleh memakan harta anak yatim kecuali dengan kadar pekerjaan dia dalam harta tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Dan ujilah anak-anak yatim untuk mengatur harta mereka dengan baik sebelum dewasa. Maka ketika mereka mencapai umur dewasa, dan mendapati mereka sudah dewasa, yaitu baik dalam mengatur harta, maka berilah harta mereka tanpa ditunda-tunda, dan janganlah tergesa-gesa menggunakannya sebelum mereka dewasa, maka bagi wali yang mampu sebaiknya tidak mengambil sedikitpun harta anak yatim. Dan bagi wali yang butuh maka sebaiknya dia memakannya dengan takaran sepatutnya. Dan jika kalian membayar harta mereka setelah dewasa, maka bersaksilah bahwa mereka telah menerima hart tersebut dari kalian supaya mereka tidak mengingkari penerimaan harta tersebut. Cukuplah Allah sebagai penghisab dan pembalas amal perbuatan kalian. Ayat ini turun untuk paman Tsabit bin Rifa’ah yang bertanya kepada Nabi tentang harta anak yatim (keponakannya) yang halal baginya, dan kapankah membayarnya?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ujilah} ujilah {anak-anak yatim itu sehingga ketika mereka cukup umur untuk menikah} mereka sampai pada umur baligh {jika kalian melihat} tahu dan jelas {mereka telah pandai} pandai dalam agama dan menjaga harta {serahkanlah kepada mereka harta mereka. Janganlah kalian memakannya melebihi batas} melebihi batas yang diperbolehkan Allah kepada kalian {dan tergesa-gesa sebelum mereka dewasa} tergesa-gesa mengambil harta anak yatim {Siapa saja yang mampu, maka hendaklah dia menahan diri} maka hendaknya dia menahan diri untuk mengambil harta anak yatim {dan siapa saja yang fakir, maka bolehlah dia memakannya dengan cara yang baik} maka boleh mengambilnya sesuai kebutuhan darurat saja {Kemudian apabila kalian menyerahkan} menyerahkan {harta itu kepada mereka, hendaklah kalian adakan saksi-saksi. Cukuplah Allah sebagai pengawas (6)} pengawas dan saksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. (ujian) adalah cobaan dan latihan. Yang demikian itu adalah dengan menyerahkan sesuatu dari hartanya kepada anak yatim yang telah mendekati kedewasaan, lalu ia membelanjakan uang itu untuk kebutuhannya dengan sepatutnya menurut kondisinya saat itu, hingga jelaslah saat itu antara kedewasaannya ataupun ketidakmampuannya membelanjakan menurut yang sepatutnya. Bila ia masih belum mampu dalam membelanjakan harta, maka hartanya tidak diberikan kepadanya, dan ia masih dinyatakan tetap dalam kondisi tidak mampu membelanjakan hartanya dengan baik, walaupun ia telah mencapai umur yang cukup dewasa. Apabila telah terbukti kedewasaan dan kemampuannya dalam membelanjakan hartnya dengan baik, walaupun ia telah mencapai umur yang cukup dewasa. Apabila telah terbukti kedewasaan dan kemampuannya dalam membelanjakan harta dengan sepatutya serta telah mencapai cukup usia untuk menikah, ”maka serahkanlah kepada mereka harta-hartanya, ”secara sempurna dan seluruhnya. Dan janganlah kamu makan harta anak yatim lebih dari batas kepatutan, ”yakni melampaui batas yang halal yang dibolehkan olah Allah untuk kalian dari harta mereka, kepada yang haram yang telah diharamkan oleh Allah atas kalian dari harta mereka. “Dan janganlah kamu tergesa-gesa (membelanjakannya) sebelum mereka dewasa,” maksudnya, janganlah kamu meakan harta mereka saat mereka masih kecil, dimana mereka saat itu belum mampu mengambilnya dari kalian dan mereka juga tidak mampu melarang kalian memakannya, secara tergesa-gesa sebelum mereka menjadi dewasa, dimana mereka mengambil harta mereka dari kalian dan melarang kalian dari memakannya. Yang seperti ini adalah perkara nyata yang terjadi pada sebagian besar para wali yang tidak memiliki rasa takut kepada Allah dan tidak memiliki rasa kasih sayang terhadap orang-orang yang ia lindungi tersebut. Para wali itu melihat bahwa hal tersebut adalah suatu kesempatan bag mereka hingga mereka memanfaatkannya sebaik mungkin, dan dengan tergesa-gesa mereka mengambil apa yang diharamkan oleh Allah atas mereka. Itulah sebabnya Allah ta'ala melarang dari perbuatan seperti itu secara khusus."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻭاﺑﺘﻠﻮا اﻟﻴﺘﺎﻣﻰ} Wabtalul yatama : ujilah anak-anak yatim supaya kalian tahu apakah mereka telah layak dan sanggup membelajakan harta dengan baik. {ﺑﻠﻐﻮا اﻟﻨﻜﺎﺡ} Balaghun nikah : mencapai umur nikah, akil balig. {ﺁﻧﺴﺘﻢ} Aanastum : kalian melihat kedewasaan ketika mereka membelanjakan harta. {ﺇﺳﺮاﻓﺎ ﻭﺑﺪاﺭا} irsrafan wa bidaron : اﻹﺳﺮاﻑ al Israf adalah menggunakan harta tanpa kebutuhan penting. :اﻟﺒﺪاﺭ al Bidar adalah bersegera dengan cepat untuk memakan harta para yatim sebelum berpindah tangan kepada mereka setelah mereka mencapai kedewasaan. {ﻓﻠﻴﺴﺘﻌﻔﻒ} Fal yasa’fif mencukupkan diri dari memakan harta yatim {ﻓﻠﻴﺄﻛﻞ ﺑﺎﻟﻤﻌﺮﻭﻑ} Fal ya’kul bil ma’ruf : makanlah harta mereka sekedar kebutuhan mendesak {ﻭﻛﻔﻰ ﺑﺎﻟﻠﻪ ﺣﺴﻴﺒﺎ}Wa kafa billahi hasiba: dan Allah Maha Pengawas maka bersaksilah untuk para yatim Makna ayat : Adapun ayat yang selanjutnya Allah telah memerintahkan kita untuk menguji para yatim tatkala mencapai umur dewasa atau mendekati balig dengan cara diberikan harta dan diperintahkan untuk menjual atau membeli sesuatu. Jika mereka dapat menggunakan harta dengan baik, maka serahkanlah harta para yatim kepada diri mereka dan bersaksilah akan hal itu untuk mengantisipasi jikalau diantara mereka ada yang berkata, “hartaku belum diberikan kepadaku”. Allah berfirman {ﻭﻛﻔﻰ ﺑﺎﻟﻠﻪ ﺣﺴﻴﺒﺎ} “Cukuplah Allah Maha Penjaga, Pengawas dan Pendamping”. Allah melarang untuk memakan harta secara boros, terburu-buru sampai mereka besar. Yakni, haram bagi kalian para wali anak yatim untuk memakan harta mereka melebihi kadar kebutuhan dan bergegas memakannya saat mereka belum besar agar harta para yatim itu berpindah kepadanya. Dan memberikan rambu-rambu yang paling lurus dan paling baik dalam menafkahkan harta anak yatim seraya berfirman {ﻭﻣﻦ ﻛﺎﻥ ﻏﻨﻴﺎ} “barangsiapa diantara kalian adalah orang kaya” maka merasalah cukup dan tidak mengambil sesuatupun dari harta anak yatim. {ﻭﻣﻦ ﻛﺎﻥ ﻓﻘﻴﺮا ﻓﻠﻴﺄﻛﻞ ﺑﺎﻟﻤﻌﺮﻭﻑ} “barangsiapa fakir, maka makanlah secara makruf” . Yang demikian adalah dengan meminjam harta para yatim dan mengembalikannya saat lapang. Apabila sang wali adalah seorang yang fakir, maka boleh baginya dihitung sebagai upah seperti layaknya para pekerja. Bilamana si wali adalah orang kaya, maka bertugaslah secara Cuma-Cuma dan imbalannya dari Allah. Allah tiadalah menyia-nyiakan pahala orang yang beramal solih. Pelajaran dari ayat : • Wajib diadakan pengujian sebelum harta diserakan kepada si yatim, tidak akan terjadi penyerahan harta sebelum terlaksananya ujian • Wajibnya mengadakan persaksian saat menyerahkan harta yatim kepada pemiliknya setelah mereka mencapai umur balig dan dewasa. • Haramnya memakan harta safih dan yatim secara mutlak. • Apabila sang wali yatim adalah seorang yang kaya, maka tidaklah diperkenankan mengambil harta yatim sepeserpun. Jikalau dia adalah seorang yang miskin, maka dibolehkan untuk meminjamnya dan mengembalikannya saat sanggup. Andai kata dibutuhkan pekerja untuk mengurus si yatim, dibenarkan untuk sang wali agar mengambil upah yang layak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 6: Dan hendaklah kamu periksa anak-anak yatim, apabila mereka sampai (umur) kawin; maka kalau mereka nampak kecerdikan pada mereka, hendaklah kamu se- rahkan kepada mereka harta-harta mereka; dan janganlah kamu makan dia dengan boros dan dengan cepat sebelum mereka besar; dan barangsiapa kaya hendaklah menjauhkan diri; dan barangsiapa miskin, bolehlah ia makan dengan patut. Maka apabila kamu serahkan harta mereka, hendaklah kamu adakan saksi atas mereka; dan Allah itu cukup sebagai Pengira."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengadakan penyelidikan terhadap mereka tentang keagamaan, usaha-usaha mereka, kelakuan dan lain-lain sampai diketahui bahwa anak itu dapat dipercaya. Contoh cara mengetahui apakah mereka sudah mampu mengatur harta atau belum adalah dengan memberikan sedikit harta, kemudian diperhatikan apakah ia akan menghabiskan semua itu tanpa menyisakan untuk kebutuhannya yang akan datang atau menyisakannya. Jika ternyata ia tidak menyisakannya, maka tandanya ia belum bisa mengatur harta, maka hartanya belum bisa diserahkan kepadanya, bahkan ia masih tetap dianggap belum sempurna akalnya meskipun usianya sudah dewasa. Yakni usia baligh, baik dengan bermimpi atau sudah berusia 15 tahun. Keadaan agamanya baik dan sudah pandai memelihara harta. Melebihi batas yang dihalalkan Allah Subhaanahu wa Ta'aala. Yakni jangan memakan harta mereka saat mereka masih kecil, di mana ketika itu mereka tidak bisa mengambilnya dari kamu dan tidak bisa mencegah kamu memakannya. Hal ini adalah perkara yang sering dilakukan oleh para wali yang tidak memiliki rasa takut kepada Allah, di mana mereka menjadikan kewalian terhadap anak yatim sebagai kesempatan, bukan sebagai ibadah untuk mendekatkan diri kepada Allah, mereka pun menghabiskan harta itu sebelum anak-anak yatim dewasa. Imam Bukhari meriwayatkan dari Aisyah radhiyallahu 'anha tentang firman Allah Ta'ala, \"Barang siapa (di antara pemelihara itu) mampu, maka hendaklah dia menahan diri (dari memakan harta anak yatim itu) dan barang siapa yang miskin, maka bolehlah dia makan harta itu menurut cara yang patut.\" Bahwa ayat tersebut turun berkenaan dengan harta anak yatim, jika pengurusnya seorang yang fakir, maka ia boleh memakan sebagai ganti kepengurusannya terhadapnya, namun secara wajar. Misalnya sesuai kepengurusannya. Contoh lain memakan harta anak yatim secara ma'ruf (wajar) adalah: 1. Ia mengambilnya, namun sifatnya hanya sebagai pinjaman. 2. Ia memakannya sesuai kebutuhan tanpa berlebihan. 3. Ia mengambilnya ketika melakukan sesuatu untuk anak yatim. 4. Ia mengambilnya ketika terpaksa, jika ia sudah mampu, nanti akan dibayarnya, namun jika ia tidak mampu, maka menjadi halal. Bahwa mereka telah menerimanya dan beban kalian telah lepas agar tidak timbul pertengkaran. Perintah ini merupakan saran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 6",
    "description": "Setelah menjelaskan tentang larangan menyerahkan harta anak yatim dalam kondisi mereka belum mampu mengelola, berikutnya Allah memerintahkan agar para wali menguji terlebih dahulu kematangan berpikir, kecerdasan, dan kemampuan mereka mengelola harta sebelum menyerahkannya. Dan ujilah kecerdasan dan mental anak-anak yatim itu dengan memperhatikan keagamaan mereka, kematangan berpikir, dan cara membelanjakan harta, kemudian latihlah mereka dalam menggunakan harta itu sampai hampir mereka cukup umur untuk menikah dengan menyerahkan harta sedikit demi sedikit. Kemudian jika menurut pendapat kamu melalui uji mental tersebut dapat diketahui dengan pasti bahwa mereka betul-betul telah cerdas dan pandai dalam memelihara dan mengelola harta, maka serahkanlah kepada mereka hartanya itu, sehingga tidak ada alasan bagi kalian untuk menahan harta mereka. Dan janganlah kamu, para wali, dalam mengelola harta ikut memakannya harta anak yatim itu dan mengambil manfaat melebihi batas kepatutan, dan janganlah kamu menyerahkan harta kepada mereka dalam keadaan tergesa-gesa menyerahkannya sebelum mereka dewasa, karena kalian khawatir bila mereka dewasa mereka akan memprotes kalian. Barang siapa di antara pemelihara itu mampu mencukupi kebutuhan hidup untuk diri dan keluarganya, maka hendaklah dia menahan diri dari memakan harta anak yatim itu dan mencukupkan diri dengan anugerah dari Allah yang diperolehnya. Dan barang siapa miskin, maka bolehlah dia makan harta itu menurut cara yang patut sekadar untuk mencukupi kebutuhan hidupnya, sebagai upah atau imbalan atas pemeliharaannya. Kemudian, apabila kamu menyerahkan harta itu yang sebelumnya berada di tangan kamu kepada mereka, maka hendaklah kalian adakan saksi-saksi ketika menyerahkan harta itu kepada mereka. Dan cukuplah Allah sebagai pengawas atas segala amal perbuatan dan perilaku mereka. Dan dia memperhitungkan semua perilaku tersebut kemudian memberinya balasan setimpal diriwayatkan bahwa ummu kuhhah istri aus bin tsabit mengadukan persoalannya kepada rasulullah, bahwa setelah aus gugur dalam perang uhud, lalu harta peninggalan aus diambil seluruhnya oleh saudara laki-laki aus tanpa menyisakan sedikit pun untuk dirinya dan dua putrinya hasil perkawinannya dengan aus, kemudian turunlah ayat ini. Bagi laki-laki dewasa atau anak-anak yang ditinggal mati orang tua atau kerabatnya ada hak bagian waris dari harta peninggalan kedua orang tua dan kerabatnya yang akan diatur Allah kemudian, dan begitu pula bagi perempuan dewasa atau anak-anak yang ditinggal mati orang tua atau kerabatnya ada hak bagian waris pula dari harta peninggalan kedua orang tua dan kerabatnya, baik harta peninggalan itu jumlahnya sedikit atau banyak. Hak mewarisi itu diberikan menurut bagian yang telah ditetapkan oleh Allah."
  }
]