[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah kamu tidak mengetahui (wahai rasul), perihal orang-orang munafik yang mengaku-aku telah beriman kepada wahyu yang diturunkan kepadamu,(yaitu al-qur’an),dan kepada wahyu yang diturunkan kepada rasul-rasul sebelummu, tetapi mereka ingin berhukum dalam memutuskan perselisihan diantara mereka kepada selain ajaran yang disyariatkan Allah berupa ajaran kebatilan, padahal mereka telah diperintahkan untuk mengkufuri ajaran kebatilan? dan setan menghendaki untuk menjauhkan mereka dari jalan kebenaran sejauh-jauhnya. Dan dalam ayat ini terkandung dalil yang menunjukkan bahwa sesungguhnya iman yang benar menuntut kepatuhan kepada syariat Allah dan berhukum dengannya dalam setiap urusan dari urusan-urusan. Maka barangsiapa yang beranggapan bahwa dirinya telah beriman namun ternyata dia lebih memilih hukum thagut di atas hukum Allah, maka dia adalah seorang pembohong dalam pengakuannya itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Tidakkah kamu -wahai Rasul- melihat pertentangan yang ditunjukkan oleh orang-orang munafik dari kalangan Yahudi yang bohong dan mengaku beriman kepada kitab suci yang diturunkan kepadamu dan kitab suci yang diturunkan kepada rasul-rasul sebelummu, mereka itu ingin mencari ketentuan hukum, saat mereka berselisih paham di luar syariat Allah, yakni putusan-putusan hukum yang dibuat oleh manusia. Padahal mereka diperintahkan ingkar kepadanya. Dan setan ingin menjauhkan mereka dari kebenaran dengan sejauh-jauhnya, sehingga mereka tidak bisa menemukan jalan yang benar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60- 63. setelah Allah memerintahkan orang-orang beriman untuk taat kepada Allah dan rasulnya serta kepada para pemimpin, kemudian Allah menyebutkan keheranan-Nya terhadap orang-orang munafik yang mengaku beriman, namun ingin menentukan hukum dengan dasar selain kitab Allah dan sunah Rasulullah. ini merupakan penyesatan yang dilakukan oleh setan terhadap mereka. Jika dikatakan kepada mereka: \"Marilah menggunakan hukum Allah dan rasul-Nya.” niscaya kalian akan melihat mereka benar-benar berpaling. Jika dalam keadaan damai mereka sangat menghindari majlis Rasulullah dalam situasi seperti ini, maka bagaimana sikap mereka dalam situasi yang sulit dan merugikan. Jika mereka berbuat kejahatan maka mereka akan takut darimu akibat perbuatan mereka itu, kemudian mereka akan mendatangimu dengan keadaan rela atau terpaksa kemudian mereka akan mengucapkan sumpah bohong: \"ketika melakukan kejahatan tersebut yang kami inginkan hanyalah kebaikan dan maslahat\". Allah Maha Mengetahui kemunafikan, permusuhan, dan kebencian yang ada dalam hati merdeka, dan Allah akan membalas apa yang telah mereka perbuat; maka berhentilah mengolok mereka dan menerima alasan mereka, serta peringatkanlah mereka dari azab Allah dan larangan Allah mereka mengulangi perbuatan yang serupa."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. يُرِيدُونَ أَن يَتَحَاكَمُوٓا۟ إِلَى الطّٰغُوتِ (Mereka hendak berhakim kepada thaghut) Yakni kepada para dukun dan semua yang menegakkan hukum yang berlandaskan selain apa yang diturunkan Allah. Maka bagaimana orang-orang yang merujuk perkara mereka kepada para dukun dan thaghut mengaku sebagai orang yang beriman kepada kitab-kitab yang diturunkan Allah. وَقَدْ أُمِرُوٓا۟ أَن يَكْفُرُوا۟ بِهِۦ(padahal mereka telah diperintah mengingkari thaghut itu) Yakni kitab-kitab samawiyah tersebut memerintahkan mereka untuk mengingkari semua orang yang tidak berhukum dengan berlandaskan apa yang diturunkan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Wahai Nabi, apakah kamu tidak melihat orang-orang yang beranggapan bahwa mereka beriman kepada Al-Qur’an dan kitab-kitab samawi terdahulu seperti sebagian orang-orang Yahudi dan orang munafik yang hendak mengembalikan hukum kepada Thagut, yaitu para dukun dan setiap orang yang tidak memutuskan hukum sesuai apa yang diturunkan Allah. Bagaimana bisa hal tersebut dianggap benar oleh mereka? Padahal mereka sudah diperintahkan untuk mengingkari setiap sesuatu yang tidak diputuskan sesuai perintah Allah. Dan setan itu ingin menjerumuskan mereka ke dalam kesesatan yang jauh dari kebenaran. Ayat ini turun terkait perdebatan antara orang munafik dan orang Yahudi. Orang yahudi ingin meminta keputusan kepada nabi SAW karena beliau tidak mau menerima uang suap, dan orang munafik ingin meminta keputusan kepada para pemimpin Yahudi, karena mereka mau mengambil uang suap ketika memutuskan hukum. Kemudian ketika keduanya tidak menemukan kesepakatan, akhirnya keduanya meminta keputusan hukum kepada seorang dukun di Juhainah. Lalu Allah menurunkan ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidakkah kamu memperhatikan orang-orang yang mengaku} menyerukan kebohongan {bahwa mereka telah beriman pada apa yang diturunkan kepadamu dan pada apa yang diturunkan sebelummu. Mereka hendak menentukan keputusan kepada tagut} selain kitab Allah dan sunnah Rasulullah SAW {padahal mereka telah diperintahkan untuk mengingkarinya. Setan bermaksud menyesatkan mereka dengan kesesatan yang sangat jauh} menjauhkan mereka dari kebenaran dengan sangat jauh"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-61. Allah membuat hamba-hambaNya heran dari kondisi orang-orang munafik yang mengira bahwa mereka adalah orang-orang yang beriman kepada apa yang dibawa oleh Rasul dan apa yang datang sebelumnya, namun demikian, “mereka hendak berhakim kepada thagut” yaitu setiap orang yang berhukum dengan selain syariat Allah, maka itulah thagut, padahal sebenarnya mereka “telah diperintah mengingkari thagut itu” lalu bagaimanakah bisa bersatu antara hal ini dengan keimanan, karena sesungguhnya iman itu mengharuskan adanya ketundukan kepada syariat Allah dan ketentuanNya terhadap setiap perkara, sehingga barangsiapa yang mengaku bahwa ia seorang Mukmin lalu ia memilih hukum thagut daripada hukum Allah, maka ia adalah pendusta dalam pengakuannya itu, dan ini merupakan penyesatan setan terhadap diri mereka, karena itu Allah berfirman, “Dan setan bermaksud menyesatkan mereka (dengan) penyesatan yang sejauh-juahnya” dari kebenaran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻳﺰﻋﻤﻮﻥ} yaz’umuun: mereka berkata dusta. {ﺑﻤﺎ ﺃﻧﺰﻝ ﺇﻟﻴﻚ} bimaa unzila ilaika: Al Quran dan yang diturunkan sebelum dirimu, yaitu Taurat. {اﻟﻄﺎﻏﻮﺕ} At thoguut: setiap yang disembah selain Allah dan dia rela disembah, maksud di dalam ayat ini adalah Ka’ab bin Al Asyraf, seorang yahudi atau seorang penyihir Arab. Makna Ayat: Diriwayatkan, bahwa ada seorang munafik dan seorang yahudi berselisih dalam suatu perkara. Berkata si Yahudi, “Kita bawa gugatan kepada Muhammad. Dia akan menghukumi dengan adil dan tidak akan mengambil suap.”. Berkata si Munafik, “Kita ajukan gugatan ke Ka’ab bin al Asyraf al Yahudi.” Maka mereka pun mengajukan pengaduan kasus mereka ke hadapan Rasulullah. Rasulullah memutuskan untuk si Yahudi dan turun ayat ini : {ﺃﻟﻢ ﺗﺮ ﺇﻟﻰ اﻟﺬﻳﻦ ﻳﺰﻋﻤﻮﻥ ﺃﻧﻬﻢ ﺁﻣﻨﻮا ﺑﻤﺎ ﺃﻧﺰﻝ ﺇﻟﻴﻚ} “Apakah kamu tidak mengetahui orang-orang yang mereka menyangka diri mereka telah beriman dengan apa yang diturunkan kepadamu.” maksud ayat itu adalah si munafik. {ﻭﻣﺎ ﺃﻧﺰﻝ ﻣﻦ ﻗﺒﻠﻚ} “dan melihat orang-orang yang beriman dengan apa yang telah diturunkan sebelummu”, maksudnya adalah si Yahudi. Kalimat tanya ini adalah bentuk ungkapan rasa heran, apakah sikap mereka berdua tidak berhenti kepada ilmu mu (Muhammad). {ﻳﺮﻳﺪﻭﻥ ﺃﻥ ﻳﺘﺤﺎﻛﻤﻮا ﺇﻟﻰ اﻟﻄﺎﻏﻮﺕ} “Mereka ingin berhukum kepada thoghut” maksudnya Ka’ab bin Al Asyraf seorang dukun nista sementara Allah memerintahkan untuk mengingkarinya. {ﻭﻳﺮﻳﺪ اﻟﺸﻴﻄﺎﻥ ﺃﻥ ﻳﻀﻠﻬﻢ ﺿﻼﻻ ﺑﻌﻴﺪا} “dan setan ingin menyesesatkan mereka sesesat-sesatnya” tatkala mereka tergoda untuk mengadukan kasus mereka kepada seorang dukun, Ka’ab bin Al Asyraf. Pelajaran dari ayat : • Haramnya berhukum kepada selain Al Quran dan Sunnah Rasulullah jikalau ada yang berilmu dengan Al Quran dan Sunnah. • Wajibnya kafir/mengingkari kepada thoghut, seperti apapun wujudnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 60: Tidakkah engkau fikirkan (kesesatan) orang-orang yang berkata bahwasanya mereka telah beriman kepada apa-apa yang ditu- runkan kepadamu dan apa-apa yang diturunkan sebelummu, padahal mereka menyerahkan hukuman kepada sesuatu yang meliwati batas? sedang mereka diperintah supaya kufur kepada- telah tetapi setan mau menyesatkan mereka satu kesesatan yang jauh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Thabrani meriwayatkan dari Ibnu Abbas, ia berkata: Abu Barzah Al Aslamiy adalah seorang dukun yang memutuskan perkara di kalangan orang-orang Yahudi dalam hal yang mereka perselisihkan, lalu orang-orang musyrik pergi mendatanginya, maka Allah Azza wa Jalla menurunkan ayat, \"Alam tara ilalladziina yaz'umuuna …sampai, \"In aradnaa illaa ihsaanaw wa taufiiqaa.\" (Hadits ini disebutkan oleh Al Waahidiy dalam Asbaabunnuzul, Al Haitsami berkata dalam Majma'uzzawaa'id, \"Diriwayatkan oleh Thabrani dan para perawinya adalah para perawi kitab shahih.\" Abu Abdirrahman berkata, \"Guru Thabrani (yakni Abu Zaid Ahmad bin Yazid Al Huuthiy) tidak saya temukan biografinya, akan tetapi hadits ini dimutaba'ahkan oleh Ibrahim bin Sa'id Al Jauhari menurut Al Waahidiy. As Suyuthi dalam Lubaabunnuqul menyebutkan bahwa hadits ini sanadnya shahih. Ibnu Abi Hatim meriwayatkan dari jalan Ikrimah dari Ibnu Abbas, ia berkata: Jallas bin Shaamit, Mu'tab bin Qusyair, Raafi' bin Zaid dan Bisyr mengaku muslim, lalu beberapa orang kaumnya yang muslim mengajak menyelesaikan pertengkaran mereka kepada Nabi shallallahu 'alaihi wa sallam, namun mereka malah mengajak kepada dukun; para hakim jahiliyyah, maka Allah menurunkan ayat di atas. Ibnu Jarir meriwayatkan dari Asy Sya'biy ia berkata: Telah terjadi pertengkaran antara seorang Yahudi dan seorang munafik. Orang Yahudi berkata, \"Ayo kita selesaikan masalah ini kepada orang ahli dalam agamamu atau kepada Nabi shallallahu 'alaihi wa sallam\", karena orang Yahudi mengetahui bahwa Beliau tidak mengambil sogok dalam hal hukum, namun malah ditolak, sehingga keduanya sepakat untuk mendatangi seorang dukun di Juhainah, maka turunlah ayat di atas. Allah Subhaanahu wa Ta'aala menjadikan hamba-hamba-Nya merasa aneh terhadap sikap orang-orang munafik. Yaitu Ka'ab bin Al Asyraf; seorang yahudi yang memusuhi Nabi shallallahu 'alaihi wa sallam dan kaum muslimin. Ada pula yang mengatakan, bahwa maksud thagut di sini adalah Abu Barzah seorang tukang tenung di masa Nabi shallallahu 'alaihi wa sallam yang biasa ,memutuskan masalah di kalangan orang-orang Yahudi. Termasuk Thaghut juga adalah: 1. orang yang menetapkan hukum tidak dengan syari'at Allah. 2. berhala-berhala. Padahal keimanan menghendaki untuk tunduk kepada syari'at Allah dan menjadikannya hakim terhadap semua masalah. Oleh karena itu, barang siapa yang mengaku dirinya mukmin, tetapi ternyata ia lebih memilih hukum thagut, maka pengakuannya dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 60",
    "description": "Setelah menjelaskan bagaimana sikap yang harus diperankan oleh orang-orang beriman, maka ayat berikutnya menjelaskan sifat buruk yang dimiliki oleh orang-orang munafik. Tidakkah engkau, wahai nabi Muhammad dan kaum muslim, memperhatikan dengan seksama dan cermat, bagaimana orang-orang yang mengaku bahwa mereka telah beriman kepada apa yang diturunkan kepadamu, yakni Al-Qur'an, dan juga beriman kepada apa yang diturunkan sebelummu, yakni taurat, zabur, dan injil' tetapi mereka, orang-orang munafik itu, masih menginginkan ketetapan hukum kepada thagut, padahal mereka telah diperintahkan oleh yang mahakuasa melalui kitab yang diturunkan-Nya, untuk mengingkari thagut itu. Dan sikap mereka seperti itu telah dipengaruhi oleh setan yang bermaksud menyesatkan mereka dari jalan Allah dengan kesesatan yang sejauh-jauhnyabukan hanya sekadar enggan menjadikan rasul sebagai hakim, bahkan orang-orang munafik tersebut bertindak lebih jauh dari itu dan apabila dikatakan kepada mereka, orang-orang munafik itu, marilah tunduk dan patuh kepada apa, yakni hukum dan petunjuk, yang telah diturunkan Allah dan juga tunduk dan patuh kepada keputusan rasul, niscaya engkau, nabi Muhammad, melihat orang munafik, akibat dari kemunafikan mereka, menghalangi manusia dengan sekeras-keras-Nya darimu."
  }
]