[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka dinasihati dan dikatakan kepada mereka,”kemarilah kepada wahyu yang Allah turunkan dan kepada rasul dan petunjuknya,” kamu dapat melihat orang-orang yang menampakkan keimanan secara lahir dan menyembunyikan kekafiran,berpaling darimu dengan sejauh-jauhnya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Apabila orang-orang munafik itu diberitahu, “Marilah kembali kepada hukum yang Allah turunkan di dalam kitab suci-Nya, dan kembali kepada rasul agar dia memutuskan perselisihan yang terjadi di antara kalian,” kamu -wahai Rasul- melihat mereka benar-benar berpaling darimu dan mencari sumber hukum yang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. وَإِذَا قِيلَ لَهُمْ تَعَالَوْا۟ إِلَىٰ مَآ أَنزَلَ اللهُ وَإِلَى الرَّسُولِ رَأَيْتَ الْمُنٰفِقِينَ يَصُدُّونَ عَنكَ صُدُودًا (Apabila dikatakan kepada mereka: “Marilah kamu (tunduk) kepada hukum yang Allah telah turunkan dan kepada hukum Rasul”, niscaya kamu lihat orang-orang munafik menghalangi (manusia) dengan sekuat-kuatnya dari (mendekati) kamu) Yakni kabur dan berpaling dari berhukum kepada al-qur’an dan Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Dam ketika dikatakan kepada orang-orang Yahudi yang munafik itu: “Marilah tunduk kepada hukum dan ketentuan Allah serta rasulullah.” Maka kamu akan melihat orang-orang munafik itu menolakmu dan tidak mau memutuskan hukum dengan Al-Qur’an dan nabi SAW"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila dikatakan kepada mereka,“Marilah (patuh) pada apa yang telah diturunkan Allah dan (patuh) kepada Rasul,” kamu melihat orang-orang munafik benar-benar berpaling darimu} mereka benar-benar berpaling darimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60-61. Allah membuat hamba-hambaNya heran dari kondisi orang-orang munafik yang mengira bahwa mereka adalah orang-orang yang beriman kepada apa yang dibawa oleh Rasul dan apa yang datang sebelumnya, namun demikian, “mereka hendak berhakim kepada thagut” yaitu setiap orang yang berhukum dengan selain syariat Allah, maka itulah thagut, padahal sebenarnya mereka “telah diperintah mengingkari thagut itu” lalu bagaimanakah bisa bersatu antara hal ini dengan keimanan, karena sesungguhnya iman itu mengharuskan adanya ketundukan kepada syariat Allah dan ketentuanNya terhadap setiap perkara, sehingga barangsiapa yang mengaku bahwa ia seorang Mukmin lalu ia memilih hukum thagut daripada hukum Allah, maka ia adalah pendusta dalam pengakuannya itu, dan ini merupakan penyesatan setan terhadap diri mereka, karena itu Allah berfirman, “Dan setan bermaksud menyesatkan mereka (dengan) penyesatan yang sejauh-juahnya” dari kebenaran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {اﻟﻤﻨﺎﻓﻘﻴﻦ} al Munafiquun: bentuk jamak dari munafiq, ialah orang yang batinnya kafir dan berkedok mukmin karena takut kepada kaum muslimin. {ﻳﺼﺪﻭﻥ} yashudduun: berpaling darimu dan memalingkan orang lain juga. Makna ayat : {ﻭﺇﺫا ﻗﻴﻞ ﻟﻬﻢ ﺗﻌﺎﻟﻮا ﺇﻟﻰ ﻣﺎ ﺃﻧﺰﻝ اﻟﻠﻪ ﻭﺇﻟﻰ اﻟﺮﺳﻮﻝ} “dan jika dikatakan kepada mereka, ‘Kemarilah menuju apa yang diturunkan oleh Allah dan Rasul.” kamu akan melihat dengan heran, para munafik berpaling melarikan diri dari hukum mu dengan tanpa rela atas putusanmu kepada mereka karena adanya kekafiran dan pendustaan dari diri mereka kepada dirimu. {ﻓﻜﻴﻒ ﺇﺫا ﺃﺻﺎﺑﺘﻬﻢ ﻣﺼﻴﺒﺔ} “maka bagimana jika mereka tertimpa musibah” dan mereka” berhak mendapatkannya karena dosa-dosa mereka, apakah mereka akan bersikukuh untuk berpaling darimu? Atau apa? {ﺛﻢ ﺟﺎءﻭﻙ ﻳﺤﻠﻔﻮﻥ ﺑﺎﻟﻠﻪ} “Kemudian mereka mendatangi dirimu dan bersumpah dengan nama Allah” sembari berkata, “Tidaklah kami menginginkan kecuali berbuat baik dalam ilmu kami dan petunjuk diantara para orang yang berselisih. Ini adalah apa yang dijelaskan dalam tiga ayat ini. Pelajaran dari ayat : • Wajibnya berdakwah/menyeru menuju berhukum kepada Al Quran dan Sunnah dan wajib pula menerima dakwah tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 61: Dan apabila dikata kepada mereka: \"Marilah kepada apa yang diturunkan oleh Allah dan kepada Rasul\", engkau bisa lihat orang- orang munafik itu berpaling dari- , padamu sungguh-sungguh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya hukum yang ada dalam Al Qur'an."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 61",
    "description": "Bukan hanya sekadar enggan menjadikan rasul sebagai hakim, bahkan orang-orang munafik tersebut bertindak lebih jauh dari itu dan apabila dikatakan kepada mereka, orang-orang munafik itu, marilah tunduk dan patuh kepada apa, yakni hukum dan petunjuk, yang telah diturunkan Allah dan juga tunduk dan patuh kepada keputusan rasul, niscaya engkau, nabi Muhammad, melihat orang munafik, akibat dari kemunafikan mereka, menghalangi manusia dengan sekeras-keras-Nya darimu. Jika perilaku orang-orang munafik itu seperti yang digambarkan tersebut, bagaimana bila mereka ditimpa musibah' maka bagaimana halnya tindakan mereka apabila kelak musibah menimpa sebagai hukuman atas keengganan mereka mengikuti tuntunan Allah disebabkan perbuatan tangannya sendiri, kemudian mereka datang kepadamu, wahai nabi Muhammad dengan tunduk tetapi membawa dalih sambil bersumpah palsu, demi Allah, kami sekali-kali tidak menghendaki untuk menjadikan thagut sebagai hakim. Tiada yang kami kehendaki selain kebaikan dan kedamaian."
  }
]