[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bagiamana keadaan orang-orang munafik itu apabila musibah menimpa mereka lantaran dosa-dosa yang mereka perbuat dengan tangan-tangan mereka. Kemudian mereka datang kepadamu (wahai rosul) memberi alasan dan menguatkan kepadamu bahwa sesungguhnya mereka tidak bermaksud dengan perbuatan-perbuatan mereka kecuali berbuat baik dan mendamaikan antara pihak-pihak yang bertikai."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Lalu bagaimanakah keadaan orang-orang munafik apabila ditimpa beraneka musibah akibat dosa-dosa mereka, kemudian mereka datang kepadamu -wahai Rasul- untuk meminta maaf seraya bersumpah, “Demi Allah, kami mencari keputusan hukum dari pihak lain selain dirimu semata-mata untuk berbuat baik dan mendamaikan pihak-pihak yang berseteru\" Padahal mereka berdusta tentang hal itu. Karena berbuat baik yang sebenarnya dilakukan dengan berhukum kepada syariat yang Allah tetapkan bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. فَكَيْفَ إِذَآ أَصٰبَتْهُم مُّصِيبَةٌۢ (Maka bagaimanakah halnya apabila mereka (orang-orang munafik) ditimpa sesuatu musibah) Maka ketika itu mereka akan lemah dan tidak akan mampu menolak musibah itu. بِمَا قَدَّمَتْ أَيْدِيهِمْ (disebabkan perbuatan tangan mereka sendiri) Yakni disebabkan kemaksiatan yang mereka perbuat yang diantaranya adalah berhukum kepada para thaghut. ثُمَّ جَآءُوكَ(kemudian mereka datang kepadamu) Yakni untuk meminta uzur atas perbuatan mereka. إِنْ أَرَدْنَآ إِلَّآ إِحْسٰنًا وَتَوْفِيقًا (: “Demi Allah, kami sekali-kali tidak menghendaki selain penyelesaian yang baik dan perdamaian yang sempurna”) Yakni kami tidak menginginkan dalam berhukum kepada selainmu itu kecuali kebaikan dan bukan keburukan, dan menginginkan perdamaian diantara pihak yang berselisih, dan bukan hendak menyelisihi kamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Lalu bagaimanakah nasib mereka jika menerima hukuman Allah akibat dosa-dosa mereka atau ketika kemunafikan mereka terungkap akibat perbuatan maksiat mereka, di antaranya adalah meminta keputusan hukum kepada Thaghut, lalu mereka mendatangi kalian dengan bersumpah palsu: “Kami tidak ingin meminta keputusan kepada selainmu kecuali ingin mendapat keputusan yang baik, dan diterima oleh kedua belah pihak. Kami tidak akan menentang keputusanmu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagaimana} keadaan orang-orang munafik {apabila musibah menimpa mereka karena perbuatan mereka sendiri. Kemudian mereka datang kepadamu sambil bersumpah, “Demi Allah, kami tidak menghendaki selain kebaikan dan perdamaian.”} perdamaian di antara perseteruan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. “Maka bagaimanakah” kondisi mereka orang-orang yang tersesat, “apabila mereka (orang-orang munafik) ditimpa sesuatu musibah disebabkan perbuatan tangan mereka sendiri” berupa kemaksiatan-kemaksiatan, di antaranya adalah berhukum dengan thagut, “kemudian mereka datang kepadamu” dengan maksud untuk meminta maaf atas apa yang telah mereka lakukan seraya berkata, “Kami sekali-kali tidak menghendaki selain penyelesaian yang baik dan perdamaian yang sempurna,” maksudnya, tidakkah kami bermaksud dengan hal itu kecuali berbuat baik kepada dua belah pihak yang berselisih dan mendamaikan antara mereka, namun mereka berdusta dalam hal tersebut, karena sesungguhnya berbuat baik adalah dengan berhukum kepada Allah dan RasulNya, dan siapakah gerangan yang paling baik hukumnya daripada Allah bagi kaum yang yakin."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻣﺼﻴﺒﺔ} mushiibah: hukuman kiarenakan kekafiran dan kemunafikan mereka. { ﺇﻥ ﻳﺮﻳﺪﻭﻥ} : Apa yang kami inginkan {ﺇﻻ ﺇﺣﺴﺎﻧﺎ} illaa ihsaana: perdamaian antara orang yang bertikai. {ﻭﺗﻮﻓﻴﻘﺎ} wa taufiiqa: mengumpulkan dan melembutkan hati diantara orang-orang yang berselisih. Makna ayat : -"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 62: Tetapi bagaimanakah (hal- nya) apabila satu bahaya menge- nai mereka dengan sebab apa yang diperbuat oleh tangan-tangan me- reka, kemudian mereka datang ke- padamu bersumpah dengan (nama) Allah; \"Kami tidak maksudkan melainkan kebaikan dan perdamaian!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni karena kemaksiatan dan berhukum kepada thagut, kemudian mereka merasa butuh denganmu dalam menghadapi musibah itu. Untuk menyebutkan alasan berhukum kepada selain Beliau. Dalam berhakim kepada selainmu. Antara dua orang yang bertengkar dengan mengadakan pendekatan hukum; karena tidak siap menanggung pahitnya kebenaran. Perkataan mereka adalah dusta, padahal kebaikan dan kedamaian hanya ada pada hukum Allah dan Rasul-Nya. Allah Ta'ala berfirman, \"Apakah hukum Jahiliyah yang mereka kehendaki, dan (hukum) siapakah yang lebih baik daripada (hukum) Allah bagi orang-orang yang yakin?\" (Terj. Al Maa'idah: 50)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 62",
    "description": "Jika perilaku orang-orang munafik itu seperti yang digambarkan tersebut, bagaimana bila mereka ditimpa musibah' maka bagaimana halnya tindakan mereka apabila kelak musibah menimpa sebagai hukuman atas keengganan mereka mengikuti tuntunan Allah disebabkan perbuatan tangannya sendiri, kemudian mereka datang kepadamu, wahai nabi Muhammad dengan tunduk tetapi membawa dalih sambil bersumpah palsu, demi Allah, kami sekali-kali tidak menghendaki untuk menjadikan thagut sebagai hakim. Tiada yang kami kehendaki selain kebaikan dan kedamaian. Ayat ini membantah pengakuan orang-orang munafik, sembari memberi umat islam petunjuk tentang cara menghadapi kebohongan orang-orang munafik itu. Mereka itu adalah orang-orang yang sesungguhnya Allah mengetahui apa yang ada di dalam hatinya. Karena itu berpalinglah kamu dari mereka, yakni jangan hiraukan mereka dan jangan percaya pada ucapan dan sumpah mereka, dan berilah mereka nasihat yang menyentuh hati mereka, dan katakanlah kepada mereka perkataan yang membekas dan menghunjam pada jiwa mereka."
  }
]