[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka itu adalah orang-orang yang telah Allah mengetahui hakikat isi hati mereka yang berupa kemunafikan. Maka berpalinglah dari mereka dan peringatkanlah mereka dari buruknya keadaan mereka.Dan katakanlah kepada mereka perkataan yang menyentuh pada kalbu mereka lagi menghentikan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Mereka itu adalah orang-orang yang Allah ketahui isi hatinya yaitu berupa kemunafikan dan iktikad buruk. Maka tinggalkan -wahai Rasul- dan berpalinglah dari orang-orang tersebut. Dan jelaskanlah kepada mereka perihal ketentuan hukum Allah; dalam bentuk anjuran supaya tunduk kepada hukum Allah serta peringatan agar tidak berpaling darinya. Dan berikanlah nasihat yang mengena serta merasuk ke dalam jiwa mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. أُو۟لٰٓئِكَ الَّذِينَ يَعْلَمُ اللهُ مَا فِى قُلُوبِهِمْ (Mereka itu adalah orang-orang yang Allah mengetahui apa yang di dalam hati mereka) Yang berupa kemunafikan dan permusuhan mereka terhadap kebenaran. Dan makna dari potongan ayat ini adalah Allah mengetahui bahwa mereka adalah orang-orang munafik. فَأَعْرِضْ عَنْهُمْ (Karena itu berpalinglah kamu dari mereka) Yakni berpaling dari menerima uzur dan permohonan maaf mereka. وَعِظْهُمْ (dan berilah mereka pelajaran) Yakni takut-takutilah mereka agar tidak melakukan kemunafikan. وَقُل لَّهُمْ فِىٓ أَنفُسِهِمْ (dan katakanlah kepada mereka) Yakni katakanlah dalam hal hak mereka. Dan pendapat lain mengatakan maknanya adalah katakanlah kepada mereka dengan menyendiri dengan mereka tanpa ada orang lain selain mereka. قَوْلًۢا بَلِيغًا(perkataan yang berbekas pada jiwa mereka) Yakni memberikan pembelajaran yang sampai kepada maksud dan membekas dalam diri mereka, dan hal itu dengan menakut-nakuti mereka bahwa perbuatan mereka dapat menjerumuskan mereka kepada tumpahnya darah dan hilangnya harta mereka, atau dengan mengatakan perkataan yang membekas dalam hati mereka dan meyakinkan mereka bahwa jalan yang mereka tempuh adalah jalan yang buruk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Allah menampik perkataan mereka dengan berfirman: “Mereka itu telah diketahui oleh Allah kemunafikan dan pertentangannya terhadap kebenaran, maka janganlah menerima permohonan maaf mereka, peringatkanlah mereka tentang kemunafikan dan berilah mereka pelajaran. Al-Wa’zhu adalah perkataan yang lemah lembut yang membekas dalam jiwa. Dan katakanlah kepada mereka dengan perkataan yang membekas dalam diri mereka dengan mengancam akan menumpahkan darah dan merampas harta mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang yang diketahui oleh Allah apa yang ada di dalam hati mereka. Maka berpalinglah dari mereka} maka berpalinglah {nasihatilah mereka} Cegahlah dan peringatkanlah mereka {dan katakanlah kepada mereka} kepada diri mereka yang sebenarnya {perkataan yang membekas} yang tersampaikan dan membekas dalam diri mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Oleh karena itulah Allah berfirman, “Mereka itu adalah orang-orang yang Allah mengetahui apa yang ada di dalam hati mereka” yaitu berupa kemunafikan dan tujuan yang jelek, “karena itu berpalinglah kamu dari mereka,” maksudnya, janganlah kalian memperhatikan mereka dan janganlah kalian menghadapi apa yang mereka lakukan dana pa yang mereka ada-adakan, “dan berilah mereka pelajaran,” yaitu jelaskanlah kepada mereka tentang hukum Allah dengan mengajak mereka untuk tunduk kepada Allah dan mengancam mereka dari meninggalkannya, “dan katakanlah kepada mereka perkataan yang berbekas pada jiwa mereka,” yaitu nasihatilah mereka dengan sembunyi-sembunyi antara kalian dengan mereka, karena ssesungguhnya yang demikian itu lebih berhasil untuk memperoleh tujuan, dan bersikaplah tegas terhadap mereka dalam memperingati dan mengekang mereka dari apa yang mereka lakukan. Ayat ini adalah dalil bahwa seorang pelaku kemaksiatan walaupun dihindari namun tetap harus diberikan nasihat secara sembunyi-sembunyi dan tegas dalam memberikan nasihat tersebut dengan perkara yang dapat menghantarkan kepada apa yang diharapkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻓﺄﻋﺮﺽ ﻋﻨﻬﻢ} fa a’ridh ‘anhum: menyingkir dari mereka dan tidak menyakiti mereka. {ﻭﻋﻈﻬﻢ} wa’izhhum: perintahkan mereka dengan apa yang seyogyanya dan apa yang wajib bagi mereka. {ﻗﻮﻻ ﺑﻠﻴﻐﺎ} qoulan baliigho: argumentasi yang kuat yang menembus batas hati mereka karena kejelasan dan kefasihannya. Makna ayat : firman Allah Ta’ala : {ﺃﻭﻟﺌﻚ اﻟﺬﻳﻦ ﻳﻌﻠﻢ اﻟﻠﻪ ﻣﺎ ﻓﻲ ﻗﻠﻮﺑﻬﻢ ﻓﺄﻋﺮﺽ ﻋﻨﻬﻢ ﻭﻋﻈﻬﻢ ﻭﻗﻞ ﻟﻬﻢ ﻓﻲ ﺃﻧﻔﺴﻬﻢ ﻗﻮﻻ ﺑﻠﻴﻐﺎ} “Mereka itu adalah orang-orang yang isi hatinya telah diketahui oleh Allah, maka berpalinglah kamu dari mereka, nasihatilah mereka dan katakanlah kepada mereka dengan perkataan yang jelas.” Allah menunjuk mereka dengan kata tunjuk “itu” karena jauhnya mereka terpersok dan rendahnya mereka. Allah berfirman : {ﺃﻭﻟﺌﻚ اﻟﺬﻳﻦ ﻳﻌﻠﻢ اﻟﻠﻪ ﻣﺎ ﻓﻲ ﻗﻠﻮﺑﻬﻢ} “Mereka itu adalah orang-orang yang Allah mengetahui isi hati mereka.” yang berupa kemunafikan dan penyimpangan, oleh karena itu mereka pantas untuk mendapatkan azab dan siksa. {ﻓﺄﻋﺮﺽ ﻋﻨﻬﻢ} “berpalinglah dari mereka”, jangan menyalahkan mereka. {ﻭﻋﻈﻬﻢ} “nasihatilah mereka” kamu (Muhammad) memerintahkan kepada mereka untuk bertakwa kepada Allah dan masuk Islam secara lahir maupun batin. Sembari pula mengancam mereka dengan adanya akibat buruk dari amal-amal mereka dengan meninggalkan berhukum dengan dirimu (Muhammmad), malah berhukum kepada Thoghut. Katakanlah kepada mereka secara khusus di dada-dada mereka dengan perkataan yang baligh (lugas dan jelas) agar bisa mencapai lubuk hati mereka, maka diharap denganya akan menggerakkan hati mereka dan hilanglah kelalaian mereka kemudian mereka akan kembali. Pelajaran dari ayat : • Disunahkan berpaling dari orang yang pandir, dan disunahkan menasihati mereka dengan perkataan lugas dan jelas agar dapat sampai menembus hati mereka lalu meluluhkannya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 63: Mereka itu ialah orang-orang yang Allah tahe apa yang ada di hati mereka. Lantaran itu, hendak- lah engkau berpaling dari mereka, tetapi nasehatilah akan mereka dan katakanlah kepada mereka perkataan yang memberi bekas (mengubah) apa-apa yang ada di hati mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa kemunafikan, niat yang buruk dan udzur yang dusta. Dengan membiarkannya dan tidak mempedulikan. Jelaskanlah kepada mereka hukum Allah dan sampaikanlah targhib (dorongan) dan tarhib (ancaman). Misalnya secara sir (rahasia), karena yang demikian dapat membuahkan hasil. Dalam ayat ini terdapat dalil, bahwa pelaku maksiat, jika berpaling, maka dinasehati secara rahasia dan menasehati dengan kata-kata yang bisa membekas di hatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 63",
    "description": "Ayat ini membantah pengakuan orang-orang munafik, sembari memberi umat islam petunjuk tentang cara menghadapi kebohongan orang-orang munafik itu. Mereka itu adalah orang-orang yang sesungguhnya Allah mengetahui apa yang ada di dalam hatinya. Karena itu berpalinglah kamu dari mereka, yakni jangan hiraukan mereka dan jangan percaya pada ucapan dan sumpah mereka, dan berilah mereka nasihat yang menyentuh hati mereka, dan katakanlah kepada mereka perkataan yang membekas dan menghunjam pada jiwa mereka ayat ini menjelaskan kewajiban taat kepada Allah dan rasul sembari mencela perilaku orang-orang munafik yang mencari hakim terhadap thagut. Dan juga kami tidak mengutus seorang rasul dari semua rasul yang telah diutus, melainkan dengan membawa bukti-bukti untuk ditaati dengan izin dan perintah Allah. Dan sungguh, sekiranya mereka setelah menzalimi dirinya dengan cara berhakim kepada thagut, lalu mereka datang kepadamu, Muhammad, lalu selanjutnya mereka memohon ampunan kepada Allah dengan sepenuh hati, dan rasul pun memohonkan ampunan untuk mereka atas kesalahan yang telah mereka perbuat, niscaya mereka mendapati Allah maha penerima tobat atas kesalahan mereka, dan juga maha penyayang kepada orang-orang yang bertaubat."
  }
]