[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah kami mengutus seorang rasul dari rasul-rasul kami, kecuali agar diterima seruannya dengan kehendak Allah dan ketetapanNYA. Seandainya orang-orang yang menganiaya diri mereka dengan berbuat kesalahan-kesalahan itu datang kepadamu (wahai rasul), dalam masa hidupmu sambal bertaubat dan meminta kepada Allah agar mengampuni dosa-dosa mereka, dan kamupun memohon ampunan untuk mereka, maka mereka akan mendapati Allah Maha Penerima taubat lagi Maha penyayang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Dan tidaklah Kami mengutus seorang rasul melainkan supaya ia dipatuhi perintahnya dengan kehendak dan ketetapan Allah. Seandainya ketika mereka menganiaya diri mereka sendiri lantaran melakukan maksiat lantas datang menemuimu -wahai Rasul- di masa hidupmu seraya mengakui dan menyesali perbuatan mereka, bertaubat dan memohon ampun kepada Allah, dan kamu pun memohonkan ampun kepada Allah, niscaya mereka akan mendapati bahwa Allah menerima taubat mereka dan menyayangi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64- 65. kemudian Allah menganjurkan untuk taat kepada Rasul dengan berfirman: “Dan Kami tidaklah mengutus seorang rasul melainkan untuk ditaati dengan taufik dan pertolongan Kami. Jika mereka menzalimi diri sendiri akibat tidak rela dengan keputusanmu atau akibat mereka berhukum dengan selain hukum Allah, kemudian mereka mendatangimu dan memohon ampun kepada Allah dengan penuh keikhlasan kata meminta maaf kepadamu, kemudian kamu memohonkan ampun atas dosa mereka, niscaya Allah akan mengampuni dan merahmati mereka dengan menerima taubat dan memberi mereka pahala. kemudian Allah bersumpah dengan Dzat-Nya yang mulia bahwa mereka tidak dianggap beriman hingga mereka menjadikan Rasulullah sebagai pemutus perkara yang terjadi di antara mereka tanpa anda rasa berat atas keputusannya, dan menerima keputusan itu dengan lapang dada dan hati yang tenang, kemudian mentaatinya secara lahir dan batin."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَمَآ أَرْسَلْنَا مِن رَّسُولٍ إِلَّا لِيُطَاعَ (Dan Kami tidak mengutus seseorang rasul melainkan untuk ditaati) Yakni dalam apa yang diperintahkan dan dilarangnya. بِإِذْنِ اللهِ ۚ (dengan seizin Allah) Yakni dengan pengetahuan Allah. Pendapat lain mengatakan yakni dengan taufik-Nya. وَلَوْ أَنَّهُمْ إِذ ظَّلَمُوٓا۟ أَنفُسَهُمْ (Sesungguhnya jikalau mereka ketika menganiaya dirinya) Dengan meninggalkan ketaatan kepada rasul dan merujuk perkara mereka kepada selainnya. جَآءُوكَ (lalu datang kepadamu) Yakni dengan keadaan bertaubat dan berlepas diri dari kejahatan-kajahatan dan pembangkangan mereka. فَاسْتَغْفَرُوا۟ اللهَ (lalu memohon ampun kepada Allah) Atas dosa-dosa mereka, dan tunduk kepadamu hingga kamu menjadi pemberi syafa’at dan peminta ampunan bagi mereka. لَوَجَدُوا۟ اللهَ تَوَّابًا رَّحِيمًا (tentulah mereka mendapati Allah Maha Penerima Taubat lagi Maha Penyayang) Yakni mendapati-Nya memberi mereka taubat dan rahmat yang luas dan banyak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Keagungan permohonan ampun (istighfar) Rasulullah dibuktikan oleh Ayat ini : { فَاسْتَغْفَرُوا اللَّهَ وَاسْتَغْفَرَ لَهُمُ الرَّسُولُ } “dan Rasulpun memohonkan ampun untuk mereka” dan bahwasanya orang-orang yang dimintai ampun oleh Rasul akan mendapat syafa’atnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Kami tidak mengutus seorang rasul kecuali supaya ditaati perintah dan larangaannya dengan perintah dan ilmu Allah SWT untuk ditaati dan tidak ditentang. Dan jika mereka menzalimi diri sendiri dengan tidak menaatimu dan meminta keputusan kepada orang lain, lalu mereka mendatangimu untuk meminta maaf, kemudian mereka meminta ampun kepada Allah atas dosa mereka dan memohon kepadaNya, maka mintakanlah ampun untuk mereka wahai rasul. Sungguh mereka akan mendapati bahwa Allah itu Maha Menerima taubat yang tulus, dan Maha Pengasih bagi bagi orang-orang yang bertaubat dan memperbaiki amal ibadahnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak mengutus seorang rasul pun, kecuali untuk ditaati dengan izin Allah. Seandainya mereka setelah menzalimi diri sendiri, lalu datang kepadamu dan memohon ampunan kepada Allah, dan Rasul pun memohonkan ampunan untuk mereka, niscaya mereka mendapati Allah Maha Penerima taubat lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Allah mengabarkan tentang suatu berita di mana di antaranya mengandung perintah dan anjuran untuk taat kepada Rasul dan tunduk kepadanya, dan bahwa tujuan dari pengutusan para rasul adalah agar mereka ditaati dan dipatuhi oleh manusia yang mana para rasul tersebut di utus kepada mereka dalam segala perkara yang mereka diperintahkan kepadanya dan perkara yang mereka dilarang darinya, dan agar mereka dihormati dengan penghormatan seorang yang ditaati oleh orang yang menaati. Ayat ini mengandung penetapan akan keterpeliharaan para Rasul dari kesalahan dalam perkara yang mereka dakwahkan dari Allah dan pada apa yang mereka perintahkan kepadanya serta apa yang mereka larang darinya, karena Allah telah memerintahkan untuk taat kepada mereka secara mutlak, dan sekiranya mereka tidak ma’shum, pastilah mereka tidak akan mensyariatkan apa yang salah, ketika Allah memerintahkan hal tersebut secara mutlak, dan FirmanNya “Dengan izin Allah” maksudnya, ketaatan seorang yang taat adalah bersumber dari qadha’ Allah tentang qadarNYa, dalam ayat ini menyimpan dalil pengukuhan akan qadha dan qadar, juga anjuran untuk memohon pertolongan kepada Allah dan penjelasan bahwa manusia tidaklah akan mampu melakukan ketaatan kepada Rasul apabila Allah tidak menolongnya. Kemudian Allah mengabarkan tentang kemurahan hati beliau yang besar, kedermawanan dan dakwah beliau kepada orang yang telah berbuat kemaksiatan agar mengakui, bertaubat, dan memohon ampunan kepada Allah dalam FirmanNya “Sesungguhnya jikalau mereka ketika menganiaya dirinya datang kepadamu” yakni dengan mengakui kesalahan-kesalahan mereka dan menyadarinya. “lalu memohon ampun kepada Allah, dan Rasul pun memohonkan ampun untuk mereka, tentulah mereka mendapati Allah Maha Penerima taubat lagi Maha Penyayang” maksudnya, pastilah Allah akan menerima taubat mereka dengan ampunanNya atas kezhaliman mereka dan Allah merahmati mereka dengan menerima taubat mereka dan memberikan taufik kepadanya serta balasan atas perbuatan itu. Dan menemui Rasul seperti ini adalah khusus di saat beliau masih hidup, Karena konteks ayat tersebut menunjukkan akan hal tersebut, karena permohonan ampunan Rasul untuk mereka tidaklah mungkin terjadi kecuali disaat beliau hidup, adapun setelah kematiannya, maka sesungguhnya tidaklah boleh meminta kepadanya sesuatu pun, bahkan hal itu adalah suatu kesyirikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﺑﺈﺫﻥ اﻟﻠﻪ} bi izdnillaah: izin Allah adalah maklumat dari Allah tentang suatu hal dan perintah-Nya. {ﻇﻠﻤﻮا ﺃﻧﻔﺴﻬﻢ} zhalamuu anfusahum: menzalimi diri mereka sendiri dengan berhukum kepada thoghut serta meninggalkan berhukum kepada Rasulullah. {ﻓﺎﺳﺘﻐﻔﺮﻭا اﻟﻠﻪ} fas taghfarullah: meminta kepada Allah agar Allah mengampuni mereka dengan lafaz اﻟﻠﻬﻢ اﻏﻔﺮ ﻟﻨﺎ Allahummaghfirlanaa “Ya Allah, ampunilah kami” atau اﺳﺘﻐﻔﺮﻭا اﻟﻠﻪ istaghfirullah. Makna Ayat: Setelah diputuskan salah dan sesatnya orang munafik dan yahudi yang ingin berhukum kepada seorang thaghut, Ka’ab bin Al Asyraf dan orang munafik, yang telah diterangkan dalam ayat yang sebelumnya; Allah mengabarkan dalam ayat yang berikut, bahwa Dia tidaklah mengirim seorang Rasul sebagai utusan dari para Rasul-Nya yang berjumlah ratusan, kecuali dengan memerintahkan kaum mereka untuk taat dan mengikuti serta berhukum kepada Rasul tadi atas setiap hal yang diperselisihkan. Perintah, putusan, serta ketetapan seorang Rasul tadi itu terjadi dengan kehendak Allah dan jikalau Allah tidak menghendaki, maka tidaklah akan terjadi seperti halnya yang telah Allah kabarkan tentang orang-orang yang berbuat zalim kepada diri mereka sendiri karena telah mencari penengah dan menyerahkan putusan kepada seorang thoghut, dan mereka berpaling dari berhukum kepada mu (Muhammad). Jikalau mereka datang kepadamu (Muhammad) dan berserah diri dengan dosa-dosa mereka sembari meminta ampun kepada Allah atas dosa-dosa mereka dan kamu (Muhammad) memintakan ampun untuk mereka kepada Allah. Maksudnya kamu meminta ampun kepada Allah untuk mereka; jikalau hal ini terjadi, niscaya hal itu akan memberikan mereka hidayah untuk bertaubat dan Allah menerima taubatnya. Maka mereka akan mendapati bahwa Allah adalah {ﺗﻮاﺑﺎ ﺭﺣﻴﻤﺎ} “Maha penerima taubat dan Maha penyayang” Ini adalah makna ayat yang 64 {ﻭﻣﺎ ﺃﺭﺳﻠﻨﺎ ﻣﻦ ﺭﺳﻮﻝ ﺇﻻ ﻟﻴﻄﺎﻉ ﺑﺈﺫﻥ اﻟﻠﻪ ﻭﻟﻮ ﺃﻧﻬﻢ ﺇﺫ ﻇﻠﻤﻮا ﺃﻧﻔﺴﻬﻢ ﺟﺎءﻭﻙ ﻓﺎﺳﺘﻐﻔﺮﻭا اﻟﻠﻪ ﻭاﺳﺘﻐﻔﺮ ﻟﻬﻢ اﻟﺮﺳﻮﻝ ﻟﻮﺟﺪﻭا اﻟﻠﻪ ﺗﻮاﺑﺎ ﺭﺣﻴﻤﺎ} Pelajaran dari ayat : • Wajibnya taat kepada Rasul dalam segala yang diperintahkan dan dilarang. • Bukti kebatilan orang yang menyangka bahwa di dalam ayat ada dalil bukti bolehnya meminta istighfar kepada Rasulullah dikarenakan firman Allah {وَلَوْ أَنَّهُمْ إِذْ ظَلَمُوا أَنْفُسَهُمْ جَاءُوكَ} “dan sesungguhnya, sekiranya mereka setelah menzalimi dirinya datang kepadamu (Muhammad)” ayat ini turun tentang dua orang laki-laki yang ingin berhukum/mencari penengah yaitu Ka’ab bin Al Asyraf dan berpalingnya mereka dari Rasulullah, disyaratkan agar mereka bertaubat dan mendatangi Rasulullah serta Rasulullah meminta ampun kepada Allah untuk mereka berdua, oleh karena itu diterimalah taubat mereka berdua. Dan jikalau mereka tidak kembali ke Rasulullah, maka mereka tidak akan diampuni. Adapun orang yang selain mereka berdua, maka taubatnya tidaklah hanya sebatas kembali ke Rasulullah dan tidaklah ada permintaan ampun dari Rasullullah kepada Allah dan ini adalah perkara yang sudah terjadi ijmak. • Setiap dosa, besar ataupun kecil dikatergorikan sebagai perbuatan zalim kepada diri sendiri. Maka wajib bertaubat dengan cara istighfar, penyesalan dan niat yang kuat untuk tidak kembali lagi melakukan dosa itu bagaimana pun keadaannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 64: Dan Kami tidak utus seorang pun Rasul melainkan untuk dita'ati dengan izin Allah; dan jika mereka, sesudah menganiaya diri- diri mereka, datang kepadamu, lalu mereka minta ampun kepada Allah, dan Rasul juga mintakan ampun bagi mereka, niscaya mereka dapati Allah itu Penerima Taubat, Penyayang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyampaikan berita yang isinya terdapat perintah dan dorongan untuk menaati Rasul serta tunduk kepadanya, menyampaikan bahwa maksud diutusnya rasul tidak lain kecuali untuk ditaati dan dimuliakan. Dalam ayat ini terdapat dalil ma'shumnya para rasul dalam semua yang mereka sampaikan dari Allah Subhaanahu wa Ta'aala, dalam semua yang mereka perintahkan dan yang mereka larang. Hal itu, karena Allah Subhaanahu wa Ta'aala memerintahkan kita menaati mereka secara mutlak. Jika tidak ma'shhum, tentu kita tidak diperintahkan menaati secara mutlak. Bukan untuk didurhakai dan diselisihi. Yakni ketaatan yang dilakukan seseorang adalah berasal dari qadha' Allah dan qadar-Nya. Di ayat ini adanya penetapan terhadap iman kepada qadha' dan qadar, anjuran untuk meminta pertolongan kepada Allah dan terdapat penjelasan bahwa seseorang tidak mungkin dapat menaati Rasul jika Allah tidak membantunya. Pada ayat ini, Allah Subhaanahu wa Ta'aala mengabarkan tentang kepemurahan-Nya dan seruan-Nya kepada orang yang mengerjakan maksiat agar sadar, beristighfar dan bertobat. Dengan berhakim kepada selain Nabi Muhammad shallallahu 'alaihi wa sallam Menyadari kesalahan. Yakni sewaktu Rasulullah shallallahu 'alaihi wa sallam masih hidup, adapun setelah wafat, maka tidak boleh meminta kepada Beliau sebagai wasilah (perantara) kepada Allah, bahkan yang demikian adalah syirk. Dalam ayat ini terdapat dalil bolehnya meminta didoakan dari orang yang saleh yang masih hidup."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 64",
    "description": "Ayat ini menjelaskan kewajiban taat kepada Allah dan rasul sembari mencela perilaku orang-orang munafik yang mencari hakim terhadap thagut. Dan juga kami tidak mengutus seorang rasul dari semua rasul yang telah diutus, melainkan dengan membawa bukti-bukti untuk ditaati dengan izin dan perintah Allah. Dan sungguh, sekiranya mereka setelah menzalimi dirinya dengan cara berhakim kepada thagut, lalu mereka datang kepadamu, Muhammad, lalu selanjutnya mereka memohon ampunan kepada Allah dengan sepenuh hati, dan rasul pun memohonkan ampunan untuk mereka atas kesalahan yang telah mereka perbuat, niscaya mereka mendapati Allah maha penerima tobat atas kesalahan mereka, dan juga maha penyayang kepada orang-orang yang bertaubat setelah menjelaskan bahwa rasul diutus untuk ditaati dan tobat orang-orang munafik dapat diterima dengan syarat harus melalui permohonan nabi kepada Allah, ayat ini menjelaskan makna yang terdalam dari ketaatan kepada rasul. Maka demi tuhanmu yang maha pengasih lagi maha penyayang, mereka pada hakikatnya tidak beriman dengan iman yang sesungguhnya yang dapat diterima Allah, sebelum mereka menjadikan engkau, Muhammad, sebagai hakim dalam perkara yang mereka perselisihkan atau dalam masalah yang tidak jelas dalam pandangan mereka, sehingga kemudian setelah tidak ada rasa keberatan dalam hati mereka terhadap putusan yang engkau berikan dalam kedudukanmu sebagai hakim, dan mereka menerima keputusanmu dengan penerimaan yang sepenuhnya."
  }
]