[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah telah bersumpah dengan DzatNYa yang maha mulia, bahwa mereka itu tidak beriman dengan sebenarnya sampai mau menjadikanmu sebagai hakim penengah dalam perselisihan yang terjadi antara mereka saat kamu masih hidup, dan berhukum dengan petunjuk sunnahmu setelah kematianmu, kemudian mereka tidak mendapati rasa sesak dalam hati mereka terhadap ketetapan yang menjadi keputusan akhirmu. Dan mereka patuh terhadap hal itu dengan kepatuhan yang sempurna. Berhukum dengan apa yang telah dibawa oleh Rosululloh sholallohu alaihi wasallam yang bersumber dari kitabullah dan Sunnah dalam seluruh perkara kehidupan termasuk intisari keimanan,disertai dengan keridhaan dan penyerahan diri."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Akan tetapi masalahnya tidak seperti anggapan orang-orang munafik itu. Kemudian Allah bersumpah demi Żat-Nya -'azza wa jalla- bahwa mereka tidak bisa menjadi orang-orang mukmin sejati sebelum mereka berhukum kepada Rasulullah di masa hidup beliau dan kepada syariatnya setelah beliau wafat dalam setiap perbedaan pendapat yang terjadi di antara mereka, kemudian mereka menerima keputusan hukum yang diberikan oleh Rasulullah dengan sukarela dan lapang dada, tidak merasa sempit dada dan ragu sedikit pun, dan berserah diri secara penuh serta tunduk dalam lahir dan batin mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. فَلَا وَرَبِّكَ (Maka demi Tuhanmu) Yakni keadaan yang sesungguhnya tidak sebagaimana yang mereka klaim bahwa mereka adalah orang-orang yang beriman kepada apa yang diturunkan kepadamu dan kepada rasul sebelummu. لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ(mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim) Yakni menjadikanmu hakim diantara mereka dalam segala permasalahan mereka, dan tidak menjadikan seorangpun selainmu sebagai hakim. فِيمَا شَجَرَ بَيْنَهُمْ(terhadap perkara yang mereka perselisihkan) Yakni yang mereka perselisihkan dan mereka pertikaikan. Dan Allah mengingkari keimanan mereka yang merupakan modal utama dari amal kebaikan seorang hamba sampai mereka menjadikan Rasulullah sebagai rujukan segala perkara mereka. ثُمَّ لَا يَجِدُوا۟ فِىٓ أَنفُسِهِمْ حَرَجًا مِّمَّا قَضَيْتَ(kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan) Dan sekedar merujuk perkara kepada Rasulullah juga belum cukup sampai hal itu muncul dari lubuk hati mereka yang terdalam dengan penuh keridhaan, ketenangan, dan keteduhan hati. وَيُسَلِّمُوا۟ (dan mereka menerima) Yakni mendengarkan dan mentaati secara lahir batin. تَسْلِيمًا (dengan sepenuhnya penerimaan) Yakni yang tidak bercampur dengan menolakan atau penyelisihan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dan jika dengan berhentinya hati dari keridhoannya kepada hukum Rasul menjadikan seseorang keluar dari keimanan, sebagaimana firman Allah megatakan : { فَلَا وَرَبِّكَ لَا يُؤْمِنُونَ حَتَّىٰ يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا } “Maka demi Tuhanmu, mereka (pada hakekatnya) tidak beriman hingga mereka menjadikan kamu hakim terhadap perkara yang mereka perselisihkan, kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan, dan mereka menerima dengan sepenuhnya.” Maka bagaimana mungkin iman seseorang dapat dibenarkan sedangkan ia berpaling dari Allah ? 2 ). Bukti yang paling otentik atas kebenaran iman seseorang adalah : ketika ia berserah diri sepenuhnya kepada perintah Allah dan Rasul-Nya, tanpa ia ragu dan keberatan sedikitpun dalam dirinya { ثُمَّ لَا يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا مِمَّا قَضَيْتَ وَيُسَلِّمُوا تَسْلِيمًا } \"kemudian mereka tidak merasa dalam hati mereka sesuatu keberatan terhadap putusan yang kamu berikan, dan mereka menerima dengan sepenuhnya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Sumpah Demi Tuhanmu mereka itu tidak seperti yang mereka anggapkan, yaitu bahwa mereka benar-benar beriman sampai mereka meminta keputusan hukum kepadamu dalam semua urusan mereka, bukan kepada selainmu dalam segala hal yang terjadi di antara mereka berupa perselisihan dan pertentangan, menerima keputusanmu dengan hati yang kuat dan jiwa yang tenang, mematuhimu dengan sempurna, dan meridhai keputusanmu dengan sempurna tanpa mengeluh, menolak atau menentang. Ayat ini turun untuk Zubair bin ‘Awan dan lawannya, yaitu seorang lelaki dari kaum Anshar yang telah ikut perang Badr. Keduanya berselisih tentang jalan air, lalu Nabi SAW bersabda kepada Zubair: “Alirilah kebunmu dahulu, kemudian salurkan air ke kebun tetanggamu.” Lalu orang Anshar itu marah dan berkata: “Ya Rasulallah, apakah karena dia anak bibimu?” Maka merah padamlah muka Rasulullah saw kemudian bersabda kepada Zubair: “Siramlah kebunmu, hingga terendam pematangnya (yaitu sekat yang menahan air) Berkatalah Zubair: “Demi Allah, aku anggap ayat ini (Falaa warabbika) diturunkan berkenaan dengan peristiwa tersebut.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demi Tuhanmu, Mereka tidak} perkara itu seperti pengakuan mereka {beriman hingga meminta keputusan kepadamu dalam perkara yang diperselisihkan} yang diperselisihkan dan diperdebatkan {di antara mereka. Kemudian mereka tidak mendapati dalam diri mereka kesulitan} kesempitan dan keraguan {terhadap putusan yang kamu berikan dan mereka terima dengan sepenuhnya} mereka menerima keputusanmu dengan penerimaan secara zhahir dan batin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Kemudian Allah bersumpah dengan DzatNya yang mulia bahwasanya mereka tidaklah beriman hingga berhukum kepada RasulNya dalam perkara yang mereka perselisihkan di antara mereka, artinya segala hal yang terjadi perselisihan padanya, berbeda dengan masalah-masalah yang telah disepakati, sesungguhnya perkara-perkara seperti itu tidaklah bersandar kecuali dari al-Quran dan as-Sunnah, karena tidaklah cukup hanya berhukum kepada beliau hingga tidak ada sama sekali dari hati mereka kebencian dan kedongkolan. Dan kondisi mereka saat berhukum kepada beliau adalah dengan asumsi bahwa itulah yang paling benar, kemudian tidaklah cukup juga berhukum pada beliau itu hingga mereka menerima keputusan beliau dengan penerimaan yang baik, kelapangan adda, ketenangan jiwa, dan ketundukan lahir maupun batin. Maka (perlu diperhatikan) bahwa berhukum adalah dalam aspek keislaman, sedangkan tidak adanya keberatan (dalam menerima putusan) adalah dalam aspek keimanan, adapun penerimaan adalah dalam aspek keihsanan. Barangsiapa yang menyempurnakan tingkatan-tingkatan tersebut, maka sesungguhnya ia telah menyempurnakan semua tingkatan-tingkatan agama, dan barangsiapa yang meninggalkan sikap berhukum yang tersebut dalam ayat ini dan tidak konsisten terhadapnya, maka ia adalah kafir, dan barangsiapa yang meninggalkannya dengan konsisten, maka hukumnya adalah sama seperti orang-orang yang semisalnya dari pelaku-pelaku kemaksiatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﻳﺤﻜﻤﻮﻙ} yahkumuuk: menjadikanmu hakim sebagai penengah di antara mereka dan menyerahkan perkaranya kepadamu. {ﻓﻴﻤﺎ ﺷﺠﺮ ﺑﻴﻨﻬﻢ} fiimaa syajara bainahum: bercampurnya sisi kebenaran dengan kebatilan. {ﺣﺮﺟﺎ} haraja: berat/susah {ﻣﻤﺎ ﻗﻀﻴﺖ} mimmaa qadhaita: apa yang telah telah kau hukumi. {ﻭﻳﺴﻠﻤﻮا} wayusallimu: mereka mematuhi dengan menerima putusan dari dirimu dan menerimanya dengan sepenuhnya. Makna ayat : Adapun ayat yang kedua (65) {ﻓﻼ ﻭﺭﺑﻚ ﻻ ﻳﺆﻣﻨﻮﻥ ﺣﺘﻰ ﻳﺤﻜﻤﻮﻙ ﻓﻴﻤﺎ ﺷﺠﺮ ﺑﻴﻨﻬﻢ ﺛﻢ ﻻ ﻳﺠﺪﻭا ﻓﻲ ﺃﻧﻔﺴﻬﻢ ﺣﺮﺟﺎ ﻣﻤﺎ ﻗﻀﻴﺖ ﻭﻳﺴﻠﻤﻮا ﺗﺴﻠﻴﻤﺎ} Sesungguhnya berfirman {ﻓﻼ} “maka tidak”, maksudnya adalah perkara itu tidaklah seperti yang mereka kira. Kemudian Allah bersumpah dan berfirman: {ﻭﺭﺑﻚ ﻻ ﻳﺆﻣﻨﻮﻥ ﺣﺘﻰ ﻳﺤﻜﻤﻮﻙ} “Demi Tuhanmu, tidaklah mereka beriman sampai mereka beriman denganmu” wahai Muhammad. Yaitu mereka meminta dirimu menjadi hakim mereka tentang hal diperselisihkan setelah kau menghukumi hal itu, mereka akan mendapati dalam dada mereka keraguan yang paling rendah tehadap keabsahan hukum dan keadilanmu dengan menyerahkannya kepada dirinya dan rela. Itu adalah makna haraj yang ada di dalam firmanNya, {ﺛﻢ ﻻ ﻳﺠﺪﻭا ﻓﻲ ﺃﻧﻔﺴﻬﻢ ﺣﺮﺟﺎ ﻣﻤﺎ ﻗﻀﻴﺖ ﻭﻳﺴﻠﻤﻮا ﺗﺴﻠﻴﻤﺎ} “kemudian mereka tidak mendapati di dalam diri mereka rasa susah dari apa yang telah kau putuskan dan mereka berserah diri dengan sebenar-benarnya”. Pelajaran dari ayat : • Wajibnya berhukum kepada Al Quran dan Sunnah dan haramnya berhukum kepada selainnya. • Wajibnya ridha dan rela dengan keputusan hukum Allah dan Rasulnya serta berserah diri kepadanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 65: Tetapi Tidak! Demi Tuhanmu, mereka tidak (dikatakan) beriman hingga mereka menjadikanmu hakim dalam apa yang mereka berselisihan di antara mereka, kemudian mereka tidak merasa sempit di hati mereka tentang apa yang engkau telah putuskan serta mereka menyerah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Urwah ia berkata: Zubair bertengkar dengan seorang Anshar dalam masalah pengairan air di tanah berbatu hitam, Nabi shallallahu 'alaihi wa sallam bersabda, \"Siramilah kebunmu wahai Zubair, kemudian alirkanlah ke tetanggamu.\" Orang Anshar berkata, \"Wahai Rasulullah, (engkau menetapkan begitu) karena dia adalah putera bibimu.\" Maka merahlah wajah Rasulullah shallallahu 'alaihi wa sallam, dan bersabda, \"Alirkanlah wahai Zubair, lalu tahanlah sampai kembali ke pembatas (penuh), kemudian alirkanlah ke tetanggamu.\" Nabi shallallahu 'alaihi wa sallam memberikan hak Zubair secara sempurna dalam ketegasan hukum tersebut ketika Beliau dibuat marah oleh orang Anshar, padahal Beliau telah mengisyaratkan dengan memerintahkan hal yang di sana terdapat kelapangan bagi keduanya. Zubair berkata, \"Saya kira ayat ini, \"Fa laa wa rabbika laa yu'minuuna…dst.\" tidaklah turun kecuali berkenaan dengan itu.\" Dengan dada yang lapang, jiwa yang tenang dan ketundukan baik zahir maupun batin. Berhukum kepada Nabi Muhammad shallallahu 'alaihi wa sallam merupakan konsekwensi keislamannya, tidak adanya rasa keberatan di hati merupakan konsekwensi keimanannya dan menerima sepenuh hati merupakan konsekwensi ihsannya. Jika dalam dirinya ada semua ini, maka sempurnala tingkatan agamanya. Oleh karena itu, barang siapa yang tidak berhukum dengan hukum Allah karena tidak suka atau menganggap ada hukum yang lebih baik daripadanya, atau menghina hukum Allah, maka dia kafir, dan barang siapa yang tidak berhukum dengan hukum Allah namun dia mengakui bahwa hukum Allah yang benar dan sikapnya salah, maka ia seperti pelaku maksiat lainnya (tidak kafir, namun berdosa besar dan dihukumi zalim atau fasik)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 65",
    "description": "Setelah menjelaskan bahwa rasul diutus untuk ditaati dan tobat orang-orang munafik dapat diterima dengan syarat harus melalui permohonan nabi kepada Allah, ayat ini menjelaskan makna yang terdalam dari ketaatan kepada rasul. Maka demi tuhanmu yang maha pengasih lagi maha penyayang, mereka pada hakikatnya tidak beriman dengan iman yang sesungguhnya yang dapat diterima Allah, sebelum mereka menjadikan engkau, Muhammad, sebagai hakim dalam perkara yang mereka perselisihkan atau dalam masalah yang tidak jelas dalam pandangan mereka, sehingga kemudian setelah tidak ada rasa keberatan dalam hati mereka terhadap putusan yang engkau berikan dalam kedudukanmu sebagai hakim, dan mereka menerima keputusanmu dengan penerimaan yang sepenuhnyapada ayat-ayat yang lalu diperingatkan bahwa orang-orang munafik itu sebenarnya tidak mau menerima nabi sebagai hakim, walaupun ketentuan itu diwajibkan oleh Allah atas diri mereka. Pada ayat-ayat berikut digambarkan sikap mereka bahwa apa pun perintah tidak akan mereka lakukan disebabkan kemunafikan mereka. Dan sekalipun telah kami perintahkan kepada mereka, orang-orang munafik itu, bunuhlah dirimu, sebagaimana dulu pernah ditetapkan sanksi semacam ini terhadap orang-orang yahudi, atau keluarlah kamu dari kampung halamanmu, sebagaimana yang dilakukan oleh kaum muslim dulu dari mekah ke madinah, ternyata mereka, orang-orang munafik, tidak akan melakukannya karena lemahnya iman mereka, kecuali sebagian kecil saja dari mereka. Dan sekiranya mereka benar-benar melaksanakan perintah dan pengajaran yang diberikan oleh Allah dan rasul, niscaya itu lebih baik bagi mereka dari apa yang mereka lakukan selama ini, dan lebih menguatkan iman mereka yang selama ini terombang ambing dalam kemunafikan."
  }
]