[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kalau kami wajibkan atas orang-orang munafik yang berhukum kepada thagut itu supaya sebagian mereka membunuh sebagian yang lain, atau supaya pergi keluar meninggalkan kampung halaman mereka, tidaklah ada yang mau menyambut perintah itu,kecuali sejumlah kecil saja dari mereka. Dan seandainya mereka itu menyambut nasihat yang ditunjukan kepada mereka, maka pastilah itu akan bermanafaat bagi mereka dan akan lebih menguatkan keimanan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66-68. Dan sekiranya Kami perintahkan kepada mereka untuk saling bunuh satu sama lain, atau keluar dari kampung halaman mereka, niscaya hanya sebagian kecil saja dari mereka yang mau melakukannya. Maka hendaklah mereka memuji Allah -Ta'ālā- karena Dia tidak membebani mereka dengan sesuatu yang memberatkan mereka. Sekiranya mereka mau melakukan apa yang dinasihatkan kepada mereka, niscaya hal itu akan lebih baik bagi mereka daripada melawannya dan lebih menguatkan iman mereka. Dan niscaya Kami akan memberi mereka ganjaran yang besar dari sisi Kami. Dan Kami juga akan membimbing mereka ke jalan lurus yang akan mengantarkan mereka kepada Allah -Ta'ālā- dan surga-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66- 68. kemudian Allah mengolok-olok orang-orang munafik akibat kemaksiatan mereka. Allah menyebutkan bahwa jika mereka diwajibkan untuk membunuh diri mereka sendiri atau saling membunuh di antara mereka atau keluar dari tempat tinggal mereka agar taubat mereka diterima sebagaimana yang disyariatkan kepada Bani Israil ketika bertaubat dari penyembahan patung anak sapi, niscaya orang-orang munafik itu tidak akan mentaati kewajiban tersebut kecuali hanya sedikit dari mereka. seandainya orang-orang munafik melakukan apa yang diperintahkan kepada mereka dan meninggalkan apa yang dilarang, niscaya hal itu akan lebih baik bagi mereka daripada menyelisihi perintah dan melanggar larangan, dan niscaya Kami akan memberi mereka surga dan petunjuk menuju agama Islam yang sebenarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوٓا۟ أَنفُسَكُمْ أَوِ اخْرُجُوا۟ مِن دِيٰرِكُم (Dan sesungguhnya kalau Kami perintahkan kepada mereka: “Bunuhlah dirimu atau keluarlah kamu dari kampungmu”) Ini merupakan penjelasan betapa besarnya hak Allah atas hamba-hamba-Nya agar mereka mematuhi-Nya disetiap syariat dan perintah-Nya; bahkan seandainya Allah memerintahkan mereka untuk meninggalkan tempat tinggal dan negeri mereka sunggguh mereka wajib mentaati-Nya. Akan tetapi seandainya Allah melakukan hal itu sungguh mereka tidak ada yang mau mentaati kecuali hanya sebagian sedikit dari mereka. Diriwayatkan dari jalur periwayatan yang banyak bahwa sekelompok sahabat ketika turun ayat ini mereka berkata: “seandainya Allah melakukan hal itu niscaya kami akan mentaati-Nya, namun segala puji bagi-Nya yang tidak membebani kami dengan hal itu”. Maka Rasulullah bersabda: “sungguh dari umatku terdapat pria-pria yang keimanan dalam hati mereka lebih kokoh daripada gunung yang kokoh menjulang”. وَلَوْ أَنَّهُمْ فَعَلُوا۟ مَا يُوعَظُونَ بِهِۦ (Dan sesungguhnya kalau mereka melaksanakan pelajaran yang diberikan kepada mereka) Berupa mengikuti tuntunan syariat dan mentaati Rasulullah. لَكَانَ(tentulah hal yang demikian itu) Yakni hal itu. خَيْرًا لَّهُمْ (lebih baik bagi mereka) Baik itu di dunia maupun di akhirat. وَأَشَدَّ تَثْبِيتًا (dan lebih menguatkan) Yakni menguatkan pijakan mereka diatas kebenaran sehingga mereka tidak goyah dalam urusan agama mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara sebab-sebab terjadinya fitnah adalah : ketika engkau meninggalkan perintah-perintah syari'at, kemudian engkau menyibukkan diri dengan hal-hal yang sebenarnya tidak ada perintahnya dari syari'at, dan perkara-perkara itu bahkan tidak akan ditanya kelak : { وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ لَكَانَ خَيْرًا لَهُمْ وَأَشَدَّ تَثْبِيتًا } \"Dan sesungguhnya kalau mereka melaksanakan pelajaran yang diberikan kepada mereka, tentulah hal yang demikian itu lebih baik bagi mereka dan lebih menguatkan (iman mereka)\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Dan jika Kami mewajibkan sebagian orang yang ingin bertaubat sebagaimana yang Kami perintahkan atas Bani Israil: “Sebaiknya kalian membunuh diri kalian,” yaitu supaya seseorang membunuh dirinya sendiri, atau agar mereka saling bunuh, atau Kami perintahkan mereka untuk meninggalkan tempat tinggal dan rumah mereka, maka tidak akan ada yang mengerjakan perintah itu kecuali hanya sedikit. Dan jika mereka mengerjakan apa yang diminta kepada mereka, mau mengambil pelajaran dan pasrah, maka sungguh itu lebih baik bagi mereka baik di dunia maupun di akhirat, dan akan lebih menguatkan keyakinan, keimanan dan keteguhan langkah mereka untuk berjalan di atas kebenaran dan keimanan. Ayat ini turun untuk menunjukkan keadaan orang-orang munafik tersebut, yaitu jika hal itu diwajibkan pada suatu umat, niscaya mereka tidak akan melakukannya. Dan tidak ada yang mengerjakannya kecuali hanya sedikit orang yang benar-benar beriman seperti Tsabit bin Qays dan Ammar, dan Ibnu Mas’ud"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya Kami perintahkan} mewajibkan {kepada mereka,“Bunuhlah diri kalian atau keluarlah dari kampung halaman kalian,” niscaya mereka tidak akan melakukannya, kecuali sebagian kecil dari mereka. Seandainya mereka melaksanakan pelajaran yang diberikan kepada mereka} mereka mengambil pelajaran darinya berupa ketaatan kepada Allah {sungguh itu lebih baik bagi mereka dan lebih menguatkan} lebih menguatkan keimanannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Allah mengabarkan bahwa seandainya Allah mewajibkan kepada hamba-hambaNya perintah-perintah yang berat bagi jiwa berupa membunuh jiwa dan keluar dari negeri, niscaya tidak akan ada yang melaksanakanya kecuali hanya sedikit dari mereka dan jarang, karena itu hendaklah mereka memuji Rabb mereka dan bersyukur kepadanya atas apa yang Allah mudahkan bagi mereka dalam perintah-perintahNya yang menjadi mudah bagi siapa saja dan tidak akan berat kalau dikerjakan, hal ini mengandung isyarat bahwa sepatutnya seorang hamba memperhatikan kebalikan dari apa yang ada padanya dari hal-hal yang dibenci, agar seluruh ibadah menjadi ringan baginya, dan bertambahlah pujian dan rasa syukur kepada Rabbnya. Kemudian Allah mengabarkan bahwa seandainya mereka, “melaksanakan pelajaran yang di berikan kepada mereka,” yaitu apa yang ditugaskan kepada mereka dalam setiap waktu yang sesuai dengan perhitungannya, lalu mereka mengarahkan segala semangat dan usaha keras mereka, memepersiapkan diri untuk melaksanakannya dan menyempurnakannya, dan jiwa mereka tidak berhasrat terhadap apa yang mereka tidak akan sampai kepadanya, dan tidak juga mereka ada dihadapanya, maka inilah yang patut bagi seorang hamba untuk melihat kondisi yang mewajibkannya untuk melaksanakan perintah tersebut, lalu menyempurnakannya, kemudian ia melangkah setahap demi setahap, hingga ia sampai kepada apa yang di tentukan untuknya berupa ilmu dan amal dalam perkara agama maupun dunianya. Hal ini berbeda dengan seseorang yang jiwanya sangat menggebu terhadap suatu perkara yang ia tidak akan mencapainya dan ia pun tidak diperintahkan padanya, seseungguhnya ia hampir tidak akan sampai kepada hal itu disebabkan oleh tidak teraturnya tekad, terjadinya kemalasan, dan hilangnya semangat. Kemudian Allah menyiapkan bagi apa yang mereka peroleh dari pelaksanaan apa-apa yang diajarkan kepada mereka, yaitu ada empat perkara; Pertama, kebaikan, sebagaimana terdapat dalam firmanya, “Tentulah hal yang demikian itu lebih baik bagi mereka,” maksudnya, pastilah mereka itu akan menjadi dari bagian orang-orang yang terbaik yang memiliki sipat-sipat seperti sipat-sipat mereka berupa perbuatan baik dimana mereka diperintahkan kepadanya, ada suatu hal yang berkonsekuensi tidak ada hal yang berlawanan dengannya. Kedua, akan memperoleh keteguhan dan kekuatan serta peningkatannya, karena Allah akan meneguhkan (keyakinan) orang-orang yang beriman disebabkan oleh apa yang mereka tunaikan berupa keimanan yaitu menunaikan apa yang diajarkan kepada mereka. Allah meneguhkan kehidupan di dunia ketika terjadinya fitnah dalam perkara yang berhubungan dengan perintah, larangan, dan musibah-musibah, hingga mereka memperoleh keteguhan di mana mereka di beri taufik untuk dapat melaksanakan perintah dan meninggalkan larangan yang sangat ingin dilakukan oleh jiwa, dan ketika terjadinya cobaan-cobaan yang dilakukan oleh jiwa, dan ketika terjadinya cobaan-cobaan yang dibenci oleh seorang hamba, lalu ia dibimbing kepada keteguhan dengan taufik kepada kesabaran atau keridhoaan atau bahkan dengan kesyukuran, sehingga turunlah pertolongan Allah kepadanya agar ia mampu melaksanakanya, dan mereka juga akan memperoleh keteguhan di atas agama ketika menghadapi kematian dan juga di dalam kubur. Demikian juga, sesungguhnya seorang hamba yang melakukan apa yang diperintahkan kepadanya, ia selalu melatih diri menunaikan perintah-perintah syariat hingga ia terbiasa dengannya bahkan ia rindu kepadanya dan kepada hal-hal yang sepertinya, maka hal itu akan menjadi penolong baginya untuk tetap teguh dan mengarjakan segala ketaatan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {كَتَبْنَا عَلَيْهِمْ} katabnaa ‘alaihim : kami wajibkan kepada mereka dan telah kami wahyukan kepada mereka. {أَنِ اقْتُلُوا أَنْفُسَكُمْ} inniqtuluu anfusakum : bunuhlah diri kalian sendiri. {مَا فَعَلُوهُ إِلا قَلِيلٌ مِنْهُمْ} maa fa’aluuhu illaa qaliilun minhum : tidak melakukan pembunuhan kecuali sejumlah kecil dari mereka. {مَا يُوعَظُونَ بِهِ} maa yuu’azhuuna bih: apa yang diperintahkan kepada mereka dan mejauhi apa yang dilarang. {وَأَشَدَّ تَثْبِيتاً} wa syadda tatsbiitaa : karena iman di dalam hati mereka. Makna Ayat: Masih di tengah pembicaraan tentang mereka yang menginginkan berhukum kepada thoghut sementara mereka telah diperintahkan untuk mengingkari thoghut, Allah berfirman {وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ أَنِ اقْتُلُوا أَنْفُسَكُمْ} “Jikalau kami memerintahkan mereka untuk membunuh diri-diri mereka”, yaitu kalian membunuh sebagian dari kalian yang lain seperti halnya yang telah terjadi pada Bani Israil. Tidaklah mereka melakukannya seperti yang telah kami perintahkan kepada Bani Israil untuk keluar dari rumah-rumah mereka untuk berhijrah di jalan Kami, {مَا فَعَلُوهُ إِلا قَلِيلٌ} “tidaklah mereka melakukannya kecuali sedikit dari mereka”. Kemudian Allah menyeru mereka sembari memberikan dorongan kepada mereka dalam sebuah petunjuk, {وَلَوْ أَنَّهُمْ فَعَلُوا مَا يُوعَظُونَ بِهِ} “dan jikalau mereka melakukan apa yang kami nasihatkan kepada mereka”, yaitu apa yang disebutkan kepada mereka sebagai bentuk motivasi serta ancaman bagi mereka dari perintah-perintah ِAllah kepada mereka untuk taat dan menerima, niscaya itu adalah hal dan tempat kembali yang baik. {وَأَشَدَّ تَثْبِيتاً} “dan lebih menguatkan” iman mereka di dalam hati mereka karena ketaatan anggota badan mereka. Karena iman akan bertambah dengan ketaatan dan akan berkurang dengan kemaksiatan. Kebaikan akan membuahkan kebaikan, begitu pula keburukan akan mengahasilkan keburukan. Pelajaran dari ayat : • Allah terkadang memberikan tanggung jawab berupa beban, ujian, dan cobaan, misalnya membunuh, hijrah dari suatu negeri tetapi Allah tidak akan membebani dengan apa yang tidak disanggupi hamba-Nya. • Iman bertambah dengan ketaatan dan berkurang dengan kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 66: Dan jika Kami wajibkan atas mereka: \"Bunuhlah diri-diri kamu atau keluarlah dari kampung-kampung kamu\", niscaya mereka tidak akan berbuat dia, kecuali sedikit dari mereka, padahal jika mereka kerjakan apa yang mereka dinasehati, niscaya adalah terlebih baik buat mereka dan kuat ketetapan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Yang Maha Mengetahui segala sesuatu, termasuk keadaan hamba menyampaikan bahwa jika diperintahkan kepada hamba beban-beban yang berat seperti membunuh dirinya dan keluar dari kampung halaman, niscaya tidak ada yang melakukannya kecuali sebagian kecil di antara mereka. Oleh karena itu, hendaknya mereka memuji Allah dan bersyukur kepada-Nya karena perintah-perintah-Nya yang ringan; yang mudah dikerjakan setiap orang. Perhatikanlah shalat lima waktu yang tidak memakan waktu yang lama dengan pahala besar yang dijanjikan, shalat-shalat sunat, dzikrullah, dsb. semua ini ringan dikerjakan. Yakni menaati perintah yang diberikan secara bertahap, lalu mereka mengerahkan kemampuannya untuk dapat melakukannya dan menyempurnakannya, tidak langsung mengerjakan sesuatu yang mereka belum sanggup melakukannya. Inilah keadaan yang patut dimiliki seorang hamba, yakni memperhatikan perintah yang mesti dilakukannya, kemudian dia menyempurnakannya, lalu meningkat kepada perintah selanjutnya sedikit demi sedikit hingga mencapai sesuatu yang ditaqdirkan baginya berupa ilmu dan amal dalam urusan agama dan dunia. Berbeda dengan orang yang langsung melihat kepada perkara yang belum bisa dicapainya dan belum diperintahkannya, maka biasanya ia tidak dapat melakukannya karena perhatiannya yang tidak fokus dan munculnya kemalasan. Yakni membuat iman mereka semakin bertambah. Hal itu, karena Allah akan meneguhkan iman orang-orang mukmin karena ketaatan yang mereka kerjakan. Allah akan meneguhkan mereka di dunia, seperti ketika adanya cobaan dengan perintah, larangan dan adanya musibah, maka mereka dapat melaksanakan perintah itu, menjauhi larangan dan menyikapi musibah dengan sabar dan ridha serta bersyukur terhadap nikmat yang diberikan. Demikian pula Allah memberikan keteguhan dalam agama (istiqamah), ketika wafat dan ketika berada di kubur. Di samping itu, seorang hamba yang mengerjakan perintah itu, maka akan terbiasa melakukannya, membuatnya tidak merasa terbebani, bahkan senang kepadanya sehingga hal ini membantunya untuk tetap di atas ketaatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 66",
    "description": "Pada ayat-ayat yang lalu diperingatkan bahwa orang-orang munafik itu sebenarnya tidak mau menerima nabi sebagai hakim, walaupun ketentuan itu diwajibkan oleh Allah atas diri mereka. Pada ayat-ayat berikut digambarkan sikap mereka bahwa apa pun perintah tidak akan mereka lakukan disebabkan kemunafikan mereka. Dan sekalipun telah kami perintahkan kepada mereka, orang-orang munafik itu, bunuhlah dirimu, sebagaimana dulu pernah ditetapkan sanksi semacam ini terhadap orang-orang yahudi, atau keluarlah kamu dari kampung halamanmu, sebagaimana yang dilakukan oleh kaum muslim dulu dari mekah ke madinah, ternyata mereka, orang-orang munafik, tidak akan melakukannya karena lemahnya iman mereka, kecuali sebagian kecil saja dari mereka. Dan sekiranya mereka benar-benar melaksanakan perintah dan pengajaran yang diberikan oleh Allah dan rasul, niscaya itu lebih baik bagi mereka dari apa yang mereka lakukan selama ini, dan lebih menguatkan iman mereka yang selama ini terombang ambing dalam kemunafikanapabila mereka meksanakan perintah dan pengajaran yang diberikan oleh Allah dan rasul itu, dan dengan demikian, pasti kami berikan kepada mereka anugerah yang tidak pernah mereka bayangkan sebelumnya, serta pahala yang besar dari sisi kami."
  }
]