[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pasti kami benar-benar tunjukkan kepada mereka dan kami beri taufik kepada mereka menuju jalan Allah yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66-68. Dan sekiranya Kami perintahkan kepada mereka untuk saling bunuh satu sama lain, atau keluar dari kampung halaman mereka, niscaya hanya sebagian kecil saja dari mereka yang mau melakukannya. Maka hendaklah mereka memuji Allah -Ta'ālā- karena Dia tidak membebani mereka dengan sesuatu yang memberatkan mereka. Sekiranya mereka mau melakukan apa yang dinasihatkan kepada mereka, niscaya hal itu akan lebih baik bagi mereka daripada melawannya dan lebih menguatkan iman mereka. Dan niscaya Kami akan memberi mereka ganjaran yang besar dari sisi Kami. Dan Kami juga akan membimbing mereka ke jalan lurus yang akan mengantarkan mereka kepada Allah -Ta'ālā- dan surga-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Dan Kami akan menunjukkan kepada mereka jalan yang lurus, yang mana mereka bisa mewujudkan kebaikan dunia-akhirat melalui jalan tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan sungguh Kami telah tunjukkan kepada mereka jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Keempat, petunjuk kepada jalan yang lurus, dan ini merupakan keumuman setelah kekhususan, karena keutamaan kapada jalan yang lurus tersebut, dan apa yang dikandungnya dari ilmu kebenaran, mencintainya, mendahulukanya dan beramal dengannya, dengan ketergantungan kebahagiaan dan kemenangan padanya, maka ia sesungguhnya telah di bimbing kepada kebaikan dan akan terlepas darinya setiap keburukan dan kezhaliman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Kami berikan petunjuk di dunia dengan jalan yang lurus di dunia, yaitu Islam. Yang mana itu adalah jalan yang sempurna dan jalan yang membuat bahagia di dalam dua alam kehidupan dan petunjuk menuju kepadanya, yaitu sebuah taufik yang ia mengarahkan kepadanya dan tidak melinceng kepada selainnya. Ini adalah apa yang ada di dalam ayat-ayat ini. Pelajaran dari ayat : • Ketaatan akan berbuah manisnya iman dan akan dimasukkan kedalam surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 68: Dan niscaya Kami pimpin mereka di jalan yang lurus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ditunjukkan kepada jalan yang lurus merupakan balasan umum setelah sebelumnya disebutkan pahala secara khusus. Hal itu, karena tingginya hidayah kepada jalan yang lurus, di mana di dalamnya seseorang mengetahui yang hak (benar), mencintainya, mengutamakannya dan mengamalkannya. Bahkan kebahagiaan dan keberuntungan terletak di atasnya. Oleh karena itu, barang siapa yang ditunjukkan kepada jalan yang lurus, maka berarti ia telah diberi taufiq kepada semua kebaikan dan dihindarkan dari segala keburukan dan bahaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 68",
    "description": "Pada waktu yang bersamaan, pasti kami akan tunjukkan pula kepada mereka jalan yang lurus yang mengantarkan mereka menuju kebahagiaan hidup di dunia dan di akhiratdan barang siapa menaati Allah dengan mematuhi perintah dan menjauhi larangan-Nya, dan juga menaati rasul dengan cara memuliakan dan memperkenankan perintahnya, maka mereka yang sehari-hari beramal dengan ikhlas seperti itu, akan bersama-sama dengan orang yang diberikan nikmat oleh Allah di dalam surga, yaitu para nabi, para pencinta kebenaran, yakni para sahabat nabi, orang-orang yang mati syahid di medan perang dan orang-orang beramal saleh. Mereka itulah orang yang telah mencapai kedudukan yang tinggi di sisi Allah dan juga merekalah sebenarnya teman yang sebaik-baiknya di kehidupan dunia."
  }
]