[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa menyambut perintah-perintah Allah dan petunjuk rasulNYA,Muhammad ,mereka itu adalah orang-orang yang agung kedudukan dan nilai mereka, maka mereka berada dalam kebersamaan dengan orang-orang yang telah Allah berikan kenikmatan kepada mereka dengan surga,dari kalangan para nabi,para shiddiqin yang telah sempurna pembenaran keimanan terhadap apa-apa yang dibawa oleh para rasul,baik keyakinan,ucapan ,maupun perbuatan,dan orang-orang yang mati syahid di jalan Allah dan juga kaum Mukminin yang shalih. Dan mereka itu sebaik-baik teman-teman di dalam surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Dan barangsiapa yang taat kepada Allah dan rasul, maka ia akan bersama orang-orang yang dianugerahi Allah hak untuk masuk Surga. Yaitu para Nabi, para ṣiddīqīn yang memiliki keyakinan sempurna terhadap ajaran yang dibawa oleh rasul dan mengamalkannya dengan sungguh-sungguh, para syuhada yang gugur di jalan Allah (di medan jihad), dan orang-orang saleh yang memiliki amal perbuatan yang baik secara lahir dan batin. Sungguh mereka itulah teman-teman terbaik di dalam Surga."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69- 70. Dan barangsiapa yang menjalankan perintah Allah dan rasul-Nya dan meninggalkan apa yang dilarang Allah dan rasul-Nya, niscaya Allah akan menempatkannya di tempat yang mulia, bersama para nabi yang telah Allah karuniakan kepada mereka wahyu dan mengistimewakan mereka dengan dakwah, bersama para shiddiqin yang benar-benar beriman kepada apa-apa yang dibawa oleh para rasul sehingga mereka dapat mengetahui kebenaran dan meyakininya, dan bersama para syuhada yang berperang di jalan Allah demi meninggikan kalimat-Nya hingga mereka terbunuh, serta bersama orang-orang beriman lainnya yang baik secara lahir dan batin. Mereka mendapatkan derajat ini berkat karunia Allah, Dialah yang memberi mereka taufik dan pertolongan. Meskipun mereka sama-sama di dalam surga namun mereka berbeda-beda. Allah menutup firman-Nya dengan kalimat (وكفى بالله عليما) untuk menunjukkan bahwa orang-orang yang disebutkan tersebut Meskipun tidak diketahui oleh manusia namun Allah mengetahui mereka dan pahala berada di tangan-Nya, Dia akan membalas mereka sesuai yang Dia ketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَمَن يُطِعِ اللهَ وَالرَّسُولَ فَأُو۟لٰٓئِكَ مَعَ الَّذِينَ أَنْعَمَ اللهُ عَلَيْهِم (Dan barangsiapa yang mentaati Allah dan Rasul(Nya), mereka itu akan bersama-sama dengan orang-orang yang dianugerahi nikmat oleh Allah) Yakni dengan dimasukkan ke dalam surga dan meraih apa yang telah disiapkan Allah bagi mereka, sehingga mereka menikmati apa yang ada dalam surga; dan kenikmatan yang lebih dari itu semua adalah kebersamaan mereka dengan para pemuka orang-orang shalih. مِّنَ النَّبِيِّۦنَ وَالصِّدِّيقِينَ(, yaitu: Nabi-nabi dan para shiddiiqiin) Makna shiddiqin adalah orang-orang yang memberi pembenaran secara sepenuhnya, yakni pembenaran terhadap agama Allah, kitab-kitab, dan para Rasul-Nya, dan mereka adalah pengikut-pengikut paling utama para nabi. وَالشُّهَدَآءِ(orang-orang yang mati syahid) Yakni orang-orang yang terbunuh di jalan Allah. وَالصّٰلِحِينَ ۚ( dan orang-orang saleh) Yakni yang senantiasa mengerjakan amal-amal shalih. وَحَسُنَ أُو۟لٰٓئِكَ رَفِيقًا (Dan mereka itulah teman yang sebaik-baiknya) Yakni sebaik-baik sahabat. Dari Aisyah ia berkata: seseorang datang kepada Rasulullah yang kemudian berkata: “wahai Rasulullah, sungguh engkau lebih aku cintai daripada diriku, dan sungguh engkau lebih aku cintai daripada anakku, sungguh ketika aku berada di rumah lalu aku teringat akan dirimu maka aku tidak dapat bersabar untuk mendatangimu dan melihatmu; dan jika aku mengingat kematianku dan kematianmu maka aku tahu bahwa engkau akan masuk surga dan diangkat derajatmu bersama para nabi, dan jika aku masuk surga aku takut tidak dapat lagi melihat engkau”. Namun rasulullah tidak menjawab perkataannya, sampai malaikat Jibril turun dengan ayat ini (وَمَن يُطِعِ اللهَ وَالرَّسُولَ فَأُو۟لٰٓئِكَ مَعَ الَّذِينَ أَنْعَمَ اللهُ عَلَيْهِم.....)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Barangsiapa menaati perintah-perintah Allah dan rasulullah, maka mereka itu bersama dengan orang yang diberi nikmat dengan dimasukkan surga, mendapatkan ridha Allah, dan derajat yang luhur, yaitu para nabi yang diberi wahyu berupa syariat oleh Allah, dan orang-orang yang sangan mengimani agama Allah, kitab-kitabNya, dan para rasulnya, dan orang-orang yang beramal shalih. Itulah sebaik-baik teman di surga. Ayat ini turun untuk Tsauban, seorang sarabat Rasulullah SAW. Tsauban sangat mencintainya, sangat tidak sabar ingin bertemu dengannya, selalu mengingat akhirat dan khawatir jika dia masuk surga tidak bisa melihat rasulullah SAW karena beliau bersama dengan para Nabi, dan jika dia tidak masuk surga, maka itu baru pantas jika tidak bisa melihat beliau selamanya. Lalu Allah SWT menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang menaati Allah dan Rasul, mereka itulah orang-orang bersama orang-orang yang dianugerahi nikmat oleh Allah, yaitu para nabi, orang-orang yang benar, orang-orang yang mati syahid, dan orang-orang shalih. Mereka itulah teman yang sebaik-baiknya} teman di surga"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Maksudnya, setiap orang yang menaati Allah dan Rasulnya sesuai dengan kondisinya dan kadar kewajiban atasnya, baik laki-laki atau perempuan, anak kecil atau orang dewasa, ”mereka itu akan bersama-sama dengan orang yang dianugerahi nikmat oleh Allah,” yaitu kenikmatan agung yang menuntut kesempurnaan, kemenangan, kesempurnaan, dan kebahagiaan, “yaitu; Nabi-nabi” orang-orang yang dimuliakan oleh Allah dengan wahyuNya dan mengkhususkan mereka dalam kemuliaan itu dengan cara mengutus mereka kepada makhluknya dan menyeru mereka kepada Allah, “dan para shidiqin,” mereka itu adalah orang-orang yang kepercayaan mereka sempurna terhadap apa yang di bawa oleh para Rasul, mereka mengetahuai kebenaran dan mempercayainya dengan keyakinan diri mereka dan merealisasikannya dengan perkataan, perbuatan, keadaan, dan berdakwah kepada Allah, “dan orang-orang yang mati syahid,” demi meninggikan agama Allah lalu mereka terbunuh, “dan orang-orang yang shalih” yaitu orang-orang yang baik lahir dan batin mereka, lalu baik pula perbuatan mereka, maka setiap orang yang menaati Allah niscaya akan bersama orang-orang tersebut dan menjadi teman mereka, “dan mereka itulah teman yang sebaik-baiknya,” yakni dengan berkumpul bersama mereka dalam syurga yang penuh dengan kenikmatan, dan kesenangan dengan mereka pada posisi Rabb semesta alam."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {وَالصِّدِّيقِينَ} washshiddiiqiin: bentuk jamak dari shiddiiq, yaitu orang-orang yang jujur dan benar dalam perkataan dan perbuatan mereka dikarenakan jamaknya kejujurannya dan selalu mencari kebenaran. {وَالشُّهَدَاءِ} wasysyuhadaa : jamak dari syahid, ialah orang yang gugur di dalam peperangan dan yang semisal mereka yang telah dipersaksikan dengan keshohihan Islam mereka dengan hujah dan argumentasi yang kuat. {وَالصَّالِحِينَ} washsholihiin : jamak dari sholih, ialah orang yang menunaikan hak-hak Allah dan menunaikan hak-hak makhluk, baik jiwa dan amal serta lebih dominan kebaikannya dibandingkan dengan keburukannya. Makna ayat : Adapun ayat yang ke 69, {وَمَنْ يُطِعِ اللهَ وَالرَّسُولَ فَأُولَئِكَ مَعَ الَّذِينَ أَنْعَمَ اللهُ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ وَحَسُنَ أُولَئِكَ رَفِيقاً} “Barang siapa yang menaati Allah dan Rasul, maka mereka bersama orang-orang yang telah diberi nikmat oleh Allah, dari para nabi, shiddiqiin, syahid, dan orang-orang yang sholih. Mereka adalah teman-teman yang baik.”. Ibnu Jarir telah meriwayatkan di dalam kitab tafsirnya, bahwa ayat ini turun menjelaskan kejadian yang terjadi pada sebagian para sahabat, “Wahai Rasul, tidaklah seyogyanya kami meninggalkanmu di dunia. Karena jika kau meninggalkan kami, maka kau akan mengangkat di atas kami dan tidak kami tidak akan melihatmu.” Maka Allah menurunkan ayat: {وَمَنْ يُطِعِ اللهَ وَالرَّسُولَ فَأُولَئِك}. Dan kemikmatan yang diberikan kepada mereka adalah berupa iman kepada Allah dan ilmu terhadap apa yang dibenci dan dicintai oleh Allah serta taufik untuk melakukan apa yang disuka Allah dan menjauhi apa yang dibenci Allah di dunia ini. Dan kenikmatan yang diberikan kepada mereka di akhirat adalah para tetangga yang mulia kelak di surga akhirat sana. Shiddiq adalah orang yang beriman kepada ALlah dan Rasul serta membenarkan setiap apa yang datang bersama Rasul dan yang dikabarkannya. Para syahid adalah orang yang terbunuh di jalan Allah. Orang sholeh adalah orang yang menunaikan hak-hak Allah dan hak-hak para hamba Allah secara sempurna dan tidak ada celah. Dan firman Allah {وَحَسُنَ أُولَئِكَ رَفِيقاً} Allah menghendaki bahwa mereka adalah teman-teman yang baik di surga, senang dengan melihatnya dan duduk-duduk bersama mereka karena mereka turun untuk menemui teman-temannya dan kembali ke kedudukan dan derajat mereka lagi yang tinggi. Pelajaran dari ayat : • Menjadi teman para nabi, shiddiq, syahid dan orang-orang sholeh adalah buah dari ketaatan kepada Allah dan Rasul."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 69: Karena barang siapa ta'at kepada Allah dan Rasul, maka mereka itu adalah beserta orang- orang yang ni'mat atasnya, dari nabi-nabi dan shid-diqin dan syuhada dan shalihin, dan alangkah baiknya mereka ini sebagai sahabat rapat!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Mardawaih meriwayatkan dari Aisyah radhiyallahu 'anha ia berkata: Ada seorang lai-laki yang datang kepada Nabi shallallahu 'alaihi wa sallam dan berkata, \"Wahai Rasulullah! Sesungguhnya engkau lebih aku cintai daripada diriku sendiri, lebih aku cintai daripada keluargaku dan lebih aku cintai daripada anakku. Pernah ketika berada dalam rumah, aku ingat dirimu, maka aku tidak sabar sampai dapat melihat dirimu. Namun, jika aku mengingat kematian yang akan menimpaku dan menimpamu, maka aku pun tahu bahwa jika engkau masuk ke dalam surga, maka engkau akan diangkat bersama para nabi, dan jika aku masuk surga, aku khawatir tidak bisa melihatmu.\" Maka Nabi shallallahu 'alaihi wa sallam tidak menjawab apa-apa sampai turun kepada Beliau ayat di atas. (Al Hafizh Abu Abdillah Al Maqdisi juga meriwayatkan hadits ini dalam Shifatul Jannah, dan berkata, \"Saya tidak melihat ada masalah dalam isnadnya.\") Yakni barang siapa yang menaati Allah dan rasul-Nya sesuai keadaannya dan melakukan ukuran yang wajib baginya, baik laki-laki maupun wanita. Shiddiqin adalah orang-orang yang sangat teguh kepercayaannya kepada kebenaran rasul. Menurut Syaikh As Sa'diy, bawa shiddiqiin adalah orang-orang yang sempurna pembenaran mereka kepada semua yang dibawa para rasul, mereka mengetahui yang hak, membenarkannya dengan yakin, melakukannya baik dengan kata-kata, perbuatan maupun keadaan, dan mereka mengajak manusia kepada Allah. Selain yang disebutkan itu. Di mana mereka dapat melihat dan saling menziarahi, meskipun derajat antara masing-masingnya berbeda."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 69",
    "description": "Dan barang siapa menaati Allah dengan mematuhi perintah dan menjauhi larangan-Nya, dan juga menaati rasul dengan cara memuliakan dan memperkenankan perintahnya, maka mereka yang sehari-hari beramal dengan ikhlas seperti itu, akan bersama-sama dengan orang yang diberikan nikmat oleh Allah di dalam surga, yaitu para nabi, para pencinta kebenaran, yakni para sahabat nabi, orang-orang yang mati syahid di medan perang dan orang-orang beramal saleh. Mereka itulah orang yang telah mencapai kedudukan yang tinggi di sisi Allah dan juga merekalah sebenarnya teman yang sebaik-baiknya di kehidupan dunia yang demikian itu, yakni keadaan bersama-sama dengan para nabi, para pencinta kebenaran, orang-orang yang mati syahid, dan orangorang saleh berada di kehidupan surga, adalah karunia yang bersumber dari Allah, dan cukuplah Allah yang maha pemurah yang juga maha mengetahui pemberi ganjaran yang setimpal."
  }
]