[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagi para lelaki (baik masih kecil atau sudah dewasa) ada bagian jatah yang telah disyariatkan Allah dalam harta yang ditinggalkan oleh kedua orang tua dan karib kerabat, sedikit ataupun banyak, dalam bagian-bagian tertentu lagi sudah jelas yang Allah tetapkan bagi mereka dan bagi kaum perempuan juga seperti itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Laki-laki mempunyai bagian dari harta yang ditinggalkan oleh ibu-bapak dan kerabatnya, seperti saudara dan paman setelah mereka meninggal dunia, baik sedikit maupun banyak. Dan wanita juga mempunyai bagian dari harta yang mereka tinggalkan. Ini berbeda dengan apa yang berlaku di masa jahiliah yang tidak memberikan hak waris kepada wanita dan anak-anak. Bagian (warisan) ini adalah hak yang diterangkan dan ditentukan kadarnya oleh Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Allah memberitahukan hak-hak ahli waris dalam enam ayat yang akan disebutkan selanjutnya: Bagi kerabat laki-laki baik yang masih kecil maupun yang dewasa, bagian harta yang ditinggalkan oleh mayit. Begitu juga bagi perempuan baik yang masih kecil maupun yang dewasa bagian harta yang ditinggalkan oleh mayit baik harta yang ditinggalkan banyak maupun sedikit. Allah mewajibkan hak tertentu yang telah jelas bagi para perempuan tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. لِّلرِّجَالِ نَصِيبٌ مِّمَّا تَرَكَ الْوٰلِدَانِ وَالْأَقْرَبُونَ (Bagi orang laki-laki ada hak bagian dari harta peninggalan ibu-bapa dan kerabatnya) Yakni dari total harta yang ditinggalkan mayit meski harta tersebut hanya dapat dipakai oleh laki-laki seperti senjata atau yang hanya dapat dipakai perempuan seperti perhiasan. مِمَّا قَلَّ مِنْهُ أَوْ كَثُرَ ۚ (baik sedikit atau banyak) Pada zaman jahiliyah mereka tidak mewarisi perempuan, tidak pula mewarisi anak laki-laki kecuali yang telah mempu berperang. نَصِيبًا مَّفْرُوضًا(menurut bahagian yang telah ditetapkan) Yakni hak yang diwajibkan Allah untuk ditunaikan yang tidak boleh dibatalkan atau dikurangi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Bagi kerabat laki-laki baik kecil maupun besar itu memiliki bagian atau porsi warisan yang ditinggalkan orang-orang yang wafat. Begitu juga kerabat perempuan baik yang kecil maupun besar bagaimanapun gendernya itu berhak menerima warisan dengan takaran baik sedikit maupun banyak. Allah menjadikan warisan itu sebagai hak yang melekat dan bagian tertentu. Penduduk Jahiliyyah itu tidak memberi warisan kepada anak-anak perempuan, tidak pula anak-anak kecil laki-laki sampai mereka menyadarinya. Mereka hanya membagikan harta warisan hanya untuk para laki-laki saja. Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Bagi laki-laki ada bagian dari harta yang ditinggalkan kedua orang tua dan kerabatnya dan bagi perempuan ada bagian pula dari harta peninggalan kedua orang tua dan kerabatnya, baik sedikit maupun banyak sesuai bagian yang telah ditetapkan} yang ditetapkan bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Dahulu orang-orang arab pada zaman jahiliyyah disebabkan karena sewenang-wenangan dan kekejaman mereka, mereka tidak mewariskan harta mereka kepada orang-orang yang lemah, dari kaum wanita dan anak-anak, namun mereka menetapkan warisan hanya untuk kaum laki-laki yang kuat. Hal tersebut menurut mereka adalah karena laki-laki yang kuat itu adalah pelaku peperangan, pembunuhan, perampasan, dan pengambilan. Maka Allah Rabb yang Maha Penyayang lagi MahaBijaksana berkehendak membuat suatu syariat dimana didalam syariat itu kaum laki-laki maupun kaum wanitanya adalah sama dan kaum yang lemah dan sama kaum yang kuat. Dan Allah memulai dengan pendahuluan dalam masalah itu secara global, agar jiwa-jiwa manusia mampu menerimanya, kemudian akhirnya perinciannya hadir setelah disebutkan secara global, yang telah dirindukan kedatangannya oleh jiwa-jiwa tersebut, hingga lenyaplah kondisi yang liar tersebut, yang bersumber dari adat istiadat yang buruk. Lalu Allah berfirman, ”Bagi laki-laki ada hak bagian,” yaitu, kadar dan jumlah, ”dari harta peninggalan” yaitu apa yang ditinggalkan, ”kedua orang tua” yaitu, ibu dan ayah, ”dan kerabatnya” ini adalah bentuk redaksi penyebutan umum setelah khusus. “Dan bagi wanita ada hak bagian (pula) dari harta ibu bapak dan kerabtnya,” seolah-olah dikatakan, apakah hal tersebut menurut adat istiadat, dan mereka tunduk pada apa yang mereka kehendaki ataukah itu adalah perkara yang telah ditentukan? Lalu Allah ta'ala berfirman ”menurut bagian yang telah ditetapkan” yaitu yang telah ditentukan oleh yang Maha Mengetahui lagi MahaBijaksana. Ketentuan-ketentuan tersebut akan hadir insya Allah. Dan dalam hal ini ada dugaan yang lain, yaitu, bahwa kemungkinan saja ada seseorang yang mengira bahwa wanita dan anak-anak tidak memiliki bagian kecuali bila harta yang ditinggalkan berjumlah besar. Maka Allah menghapus dugaan tersebut dengan firmanNya ”baik sedikit atau banyak.” maka Maha luhur Allah, Dia-lah sebaik-baik pembuat penentuan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {ﻧﺼﻴﺐ} Nashib : bagian, takaran di dalam Al-Quran {اﻟﻮاﻟﺪاﻥ} Al walidan: Kedua orang tua (ayah dan ibu) {ﻭاﻷﻗﺮﺑﻮﻥ} Wal Aqrobin: Setiap kerabat. Maksudnya di sini adalah pewaris yang berhubungan secara nasab, semenda, dan walak. {ﻧﺼﻴﺒﺎ ﻣﻔﺮﻭﺿﺎ} Nashiban mafrudho: Bagian yang harus dan lazim. Makna Ayat: Dahulu orang-orang jahiliyah tidak menyisakan warisan untuk wanita dan anak-anak dengan dalih bahwa mereka itu tidak bisa menunggang kuda, membawa pangan, tidak juga menyerang musuh. Mereka mendapatkan nafkah dan tidak bisa menafkahi. Dikisahkan bahwasanya ada seorang wanita bernama Ummu Kuhhah ditinggal wafat suaminya dan menyisakan dua orang putri. Saudara suaminya melarangnya untuk mendapatkan warisan. Mengadulah Ummu Kuhhah kepada Rasul ﷺ, maka turunlah ayat ini {ﻟﻠﺮﺟﺎﻝ ﻧﺼﻴﺐ ﻣﻤﺎ ﺗﺮﻙ اﻟﻮاﻟﺪاﻥ ﻭاﻷﻗﺮﺑﻮﻥ ﻭﻟﻠﻨﺴﺎء ﻧﺼﻴﺐ ﻣﻤﺎ ﺗﺮﻙ اﻟﻮاﻟﺪاﻥ ﻭاﻷﻗﺮﺑﻮﻥ} ،Yang mana kaum wanita dan anak-anak mendapatkan warisan seperti kaum pria dewasa.{ﻣﻤﺎ ﻗﻞ ﻣﻨﻪ} yakni sedikit atau banyak jumlahnya dari harta yang ditinggalkan jumlah yang ditentukan wajib diberikan kepada pewaris, besar-kecil ataupun pria-wanita. Dan yang dimaksud dengan al walidain (kedua orang tua) adalah ayah dan ibu. Kerabat adalah para anak, saudara laki-laki, para anak perempuan, saudari-saudari, para suami dan para istri. Ini adalah yang terkandung dalam ayat ini. Petunjuk dari Ayat: • Penetapan asas waris-mewaris di dalam Islam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 7: Laki-laki dapat bahagian dari apa yang ditinggalkan oleh ibu-bapa dan keluarga yang hampir; dan perempuan-perempuan dapat baha- gian dari apa yang ditinggalkan oleh ibu-bapa dan keluarga yang hampir, dari (peninggalan) yang sedikit atau yang banyak, (yaitu) satu bahagian yang sudah ditentukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun untuk menolak kebiasaan Jahiliyyah yang tidak memberikan warisan kepada kaum wanita dan anak-anak. Anak-anak maupun kerabat. Nampaknya ada masalah yang mengganjal di hati, apakah bagiannya menurut adat yang berlaku atau kesepakatan atau ada ketentuannya, maka disebutkan bahwa bagian tersebut ada ketentuannya dari Allah Yang Maha Mengetahui lagi Mahabijaksana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 7",
    "description": "Diriwayatkan bahwa ummu kuhhah istri aus bin tsabit mengadukan persoalannya kepada rasulullah, bahwa setelah aus gugur dalam perang uhud, lalu harta peninggalan aus diambil seluruhnya oleh saudara laki-laki aus tanpa menyisakan sedikit pun untuk dirinya dan dua putrinya hasil perkawinannya dengan aus, kemudian turunlah ayat ini. Bagi laki-laki dewasa atau anak-anak yang ditinggal mati orang tua atau kerabatnya ada hak bagian waris dari harta peninggalan kedua orang tua dan kerabatnya yang akan diatur Allah kemudian, dan begitu pula bagi perempuan dewasa atau anak-anak yang ditinggal mati orang tua atau kerabatnya ada hak bagian waris pula dari harta peninggalan kedua orang tua dan kerabatnya, baik harta peninggalan itu jumlahnya sedikit atau banyak. Hak mewarisi itu diberikan menurut bagian yang telah ditetapkan oleh Allah. Setelah menjelaskan ketentuan hak warisan bagi kaum perempuan, maka pada ayat ini Allah memberi peringatan agar memperhatikan pula kerabat lain yang tidak memeroleh harta warisan dan kebetulan hadir ketika harta warisan itu dibagikan. Dan apabila sewaktu pembagian harta warisan itu hadir atau diketahui oleh beberapa kerabat yang tidak mendapatkan harta warisan, baik mereka yang hadir adalah anak-anak yatim dan orang-orang miskin yang masih ada hubungan kerabat atau tidak, maka hendaknya berilah mereka dari harta warisan itu sekadarnya yang dapat menghibur hati mereka, dan ucapkanlah kepada mereka perkataan yang baik dan benar serta perlakukanlah mereka dengan bijaksana."
  }
]