[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pemberian besar tersebut hanya berasal dari Allah semata. Dan cukuplah Allah maha mengetahui, Dia mengetahui segala keadaan hamba-hambaNYA, dan siapa saja dari mereka yang berhak memperoleh pahala besar melalui apa yang telah mereka usahakan sebelumnya berupa amal-amal shalih"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Ganjaran tersebut merupakan anugerah dari Allah kepada hamba-hamba-Nya. Dan cukuplah bagi Allah Yang Maha Mengetahui kondisi mereka dan akan memberikan balasan yang setimpal menurut amal perbuatannya masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. ذٰلِكَ الْفَضْلُ مِنَ اللهِ ۚ (Yang demikian itu adalah karunia dari Allah) Yakni masuk surga dan kebersamaan dengan para nabi dan pengikutnya adalah karunia dari Allah. وَكَفَىٰ بِاللهِ عَلِيمًا (dan Allah cukup mengetahui) Yakni mengetahui siapa yang berhak mendapat karunia dari-Nya sehingga menjadikannya termasuk orang-orang yang disebutkan tadi, dan Allah mengetahui siapa yang tidak berhak mendapatkan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Kenikmatan di surga itu adalah kenikmatan yang diberikan Allah kepada para hambaNya. Dan cukuplah Allah yang mengetahui orang yang berhak diberi keutamaan ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Itulah karunia dari Allah. Cukuplah Allah Yang Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. “Yang demikian itu adalah karunia,” yaitu apa yang mereka peroleh “dari Allah,” karena dia-lah yang membimbing mereka kepada hal tersebut dan menolong mereka atasnya, kemudian memberikan kepada mereka pahala yang tidak mampu diraih oleh amal-amal mereka, “dan cukuplah Allah sebagai Dzat yang Maha Mengetahui,” dia mengetahui kondisi hamba-hambaNya dan mengetahuai orang-orang yang berhak mendapat pahala yang melimpah karena apa yang telah mereka lakukan dari perbuatan-perbuatan shalih yang berkolerasi antara hati dan tubuh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat : Allah berfirman {ذَلِكَ الْفَضْلُ مِنَ اللهِ} maknanya adalah pertemuan dengan orang-orang baik yang ada di surga adalah keutaman dari Allah bukan sekedar karena ketaat mereka. {وَكَفَى بِاللهِ عَلِيماً} cukup Allah lah yang Maha Mengetahui dengan orang-orang yang taat kepada-Nya dan para pelaku maksiat dengan masing-masing perbuatan yang mereka lakukan, oleh karenanya ganjaran bagi mereka adil dan sesuai."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 70: Yang demikian itulah kurnia dari Allah, karena cukuplah Allah sebagai Pengetahui."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni karena karunia Allah yang diberikan kepada mereka. Hal itu, karena ketaatan mereka tidak dapat mencapainya. Terhadap pahala di akhirat, maka percayalah dengan berita yang disampaikan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 70",
    "description": "Yang demikian itu, yakni keadaan bersama-sama dengan para nabi, para pencinta kebenaran, orang-orang yang mati syahid, dan orangorang saleh berada di kehidupan surga, adalah karunia yang bersumber dari Allah, dan cukuplah Allah yang maha pemurah yang juga maha mengetahui pemberi ganjaran yang setimpal. Wahai orang-orang yang beriman! bersiapsiagalah kamu menghadapi musuh, dan majulah dengan sungguh-sungguh dan penuh keberanian ke medan pertempuran secara berkelompok yakni menyerang secara bergelombang sekelompok dengan sekelompok bila taktik ini terbaik, atau majulah bersama-sama secara serentak apabila taktik ini kamu nilai lebih efektif."
  }
]