[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang beriman ambilah sikaf waspada kalian dengan selalu dengan mempersiapakan diri menghadapi musuh kalian, lalu keluarlah untuk melawan mereka satu kelompok demi kelompok atau secara bersama-sama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya, waspadalah terhadap musuh-musuh kalian dengan melakukan upaya-upaya persiapan untuk menghadapi serangan mereka. Keluarlah untuk menghadapi mereka sekelompok demi sekelompok. Atau keluarlah untuk menghadapi mereka secara serentak. Semuanya tergantung mana yang lebih menguntungkan bagi kalian dan merugikan musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Setelah Allah mendorong orang-orang beriman untuk taat kepada-Nya dan kepada rasul-Nya, maka Allah kemudian mendorong mereka untuk melakukan ketaatan yang paling agung yang dapat menguatkan agama, yaitu berjihad. Allah memerintahkan mereka untuk senantiasa waspada dari musuh, selalu bersiap untuk bertempur dengan segala kemungkinan dan persenjataan, melawan tipu daya dan kekuatan mereka, dan keluar ke Medan jihad secara berangsur-angsur dalam kelompok atau dengan serangan secara bersama-sama, dan jangan merasa lemah sehingga dapat menjerumuskan mereka ke dalam kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. خُذُوا۟ حِذْرَكُمْ (bersiap siagalah kamu) Yakni tetaplah kalian bersiaga dari serangan para musuh yang datang secara tiba-tiba untuk menumpas kalian semuanya, maka persiapkanlah persiapan kalian. فَانفِرُوا۟ (dan majulah (ke medan pertempuran)) Yakni bangkitlah untuk berperang melawan musuh. ثُبَاتٍ (berkelompok-kelompok) Yakni dengan kelompok-kelompok. أَوِ انفِرُوا۟ جَمِيعًا (atau majulah bersama-sama) Yakni dengan maju serempak bersama seluruh pasukan agar lebih kuat dalam melawan musuh dan agar mereka aman dari penculikan musuh mereka apabila mereka maju satu persatu. Sehingga mereka harus maju secara serempak apabila itu diperlukan atau maju secara berkelompok-kelompok."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Wahai orang-orang mukmin, waspadailah serangan dadakan musuh agama, maka buatlah persiapan yang baik untuk mereka. Dan bangkitlah kalian untuk memerangi musuh secara berkelompok-kelompok yang berbeda-beda dan saling terpisah, yaitu satu kelompok lalu diikuti kelompok lainnya sesuai strategi perang atau berkumpul dalam satu bentuk pasukan. Ketika musuh memasuki markas kalian maka jihad itu sesuai kebutuhan dan kebaikan kalian saja untuk menahan siasat buruk musuh dan mengamankan diri dari jebakan dan serangannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bersiap siagalah} waspadalah terhadap musuh kalian dan tetaplah mewaspadai mereka {dan majulah} larilah menuju musuh {secara berkelompok-kelompok} kelompok demi kelompok {atau majulah bersama-sama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. Allah memerintahkan kepada hamba-hambaNya untuk beriman untuk melakukan tindakan kewaspadaan dari musuh-musuh dan dari orang-orang kafir, hal ini mencakup segala tindakan kewaspadaan dengan segala macam sebab dan sarana yang membantu memerangi musuh, menolak tipu daya dan kekuatan mereka, berupa menggunakan benteng-benteng, parit-parit, belajar menembak dan berkendara, mempelajari penemuan-penemuan baru yang dapat membantu itu semua, dan apapun yang mampu melacak tempat-tempat masuk dan keluarnya para musuh serta makar mereka, dan jihad di jalan Allah, karena itulah Allah berfirman, “Dan majulah kemedan (pertempuran) berkelompok-kelompok,” maksudnya dengan terpisah-pisah, yaitu maju dengan pasukan kecil atau besar sedang lainya menetap, “atau majulah bersama-sama,” semua itu menurut kemaslahatan yang ada, kemampuan, dan ketenangan jiwa kau Muslimin dalam agama mereka ayat ini sejalan dengan firman Allah yang lain \"Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi\" –Al-Anfal:60-."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 71: Hai orang-orang yang beriman! Ambillah persediaan kamu, lantas majulah berpuak-puak atau majulah sama sekali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk ke dalam siap siaga adalah menyiapkan sebab yang dapat digunakan untuk memerangi orang-orang kafir, menolak makar mereka dan melemahkan kekuatan mereka, misalnya membuat benteng pertahanan dan parit, membuat senjata, latihan melempar panah atau menggunakan senjata dan latihan menunggang kuda atau kendaraan serta latihan kemiliteran. Ayat ini sama dengan ayat 60 surat Al Anfal, \"Dan siapkanlah untuk menghadapi mereka kekuatan apa saja yang kamu sanggupi dan dari kuda-kuda yang ditambat untuk berperang (yang dengan persiapan itu) kamu menggentarkan musuh Allah dan musuhmu dan orang orang selain mereka yang kamu tidak mengetahuinya; sedang Allah mengetahuinya. apa saja yang kamu nafkahkan pada jalan Allah niscaya akan dibalasi dengan cukup kepadamu dan kamu tidak akan dianiaya (dirugikan).\" Seperti mengirim sariyyah (pasukan kecil). Kedua hal ini (berangkat berkelompok atau bersama-sama) dengan mempertimbangkan maslahat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 71",
    "description": "Wahai orang-orang yang beriman! bersiapsiagalah kamu menghadapi musuh, dan majulah dengan sungguh-sungguh dan penuh keberanian ke medan pertempuran secara berkelompok yakni menyerang secara bergelombang sekelompok dengan sekelompok bila taktik ini terbaik, atau majulah bersama-sama secara serentak apabila taktik ini kamu nilai lebih efektif. Dan sesungguhnya ingatlah, wahai orang-orang beriman, di antara kamu pasti ada orang yang sangat enggan dan sangat berat hati bila diajak ke medan pertempuran. Lalu jika kamu ditimpa musibah, yakni kamu mengalami kekalahan di medan perang yang mereka tidak ikut itu, dia berkata, sungguh, Allah telah memberikan nikmat kepadaku karena tidak menjadi korban dalam peperangan itu karena aku memang tidak ikut berperang bersama mereka."
  }
]