[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh jika kalian mendapatkan karunia dari Allah dan harta rampasan ,dia benar-benar akan mengucapkan lantaran dengki dan kecewa,seolah-olah tidak ada hubungan kasih sayang secara lahir antara kalian dengan dirinya, ”Duhai,seandainya aku bersama mereka,maka aku akan memperoleh apa yang mereka dapatkan berupa keselamatan,kemenangan dan harta rampasan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Dan sungguh jika kalian -wahai kaum muslimin- mendapatkan karunia Allah berupa kemenangan atau harta rampasan perang, niscaya orang yang tidak pergi ke medan perang itu berkata seolah-olah ia bukan bagian dari kalian dan seakan-akan ia tidak berteman dan tidak kenal dengan kalian, “Seandainya aku bersama mereka di medan perang itu sehingga aku mendapatkan kemenangan besar seperti mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَلَئِنْ أَصٰبَكُمْ فَضْلٌ مِّنَ اللهِ (Dan sungguh jika kamu beroleh karunia (kemenangan) dari Allah) Berupa harta ghanimah atau kemenangan. لَيَقُولَنَّ (tentulah dia mengatakan) Yakni orang munafik ini mengatakan perkataan ini dengan penuh penyesalan dan kedengkian كَأَن لَّمْ تَكُنۢ بَيْنَكُمْ وَبَيْنَهُۥ مَوَدَّةٌ (seolah-olah belum pernah ada hubungan kasih sayang antara kamu dengan dia) Yakni ia berkata: mengapa kalian tidak memberiku bagian dari harta ghanimah dan kemenangan kalian, seakan-akan belum pernah ada hubungan kasih sayang diantara kita dan seolah-olah aku tidak pernah menolong kalian. يٰلَيْتَنِى كُنتُ مَعَهُمْ فَأَفُوزَ فَوْزًا عَظِيمًا (“Wahai kiranya saya ada bersama-sama mereka, tentu saya mendapat kemenangan yang besar) Yakni ia berandai-andai kalaulah ia pergi bersama orang-orang beriman ke medan perang agar mendapat bagian dari harta ghanimah (rampasan perang), dan ia menganggap bahwa mendapat bagian ghanimah merupakan kemenangan yang besar, dan ia tidak memiliki tujuan untuk meninggikan kalimat Allah dan menolong agama Islam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "72-73 Orang-orang munafiq itu tidak menyukai saudara-saudara mereka yang mukminin sebagaimana mereka menyukai apa yang ada pada diri mereka, dan ketika musibah datang menghampiri kaum mukminin mereka senang dengan hal itu, dan ketika nikmat mengindahkan suasana kaum mukminin orang-orang munafiq itu tidak akan senang dengan kebahagiaan mereka, mereka tidak akan merasa bahagia ketika kenikmatan mengampiri orang lain, atau ketika suatu musibah terangkat dari mereka, dan barangsiapa yang tidak memberikan sesuatu yang menyenangkan mereka seperti apa yang disenangi oleh orang-orang beriman, dan membenci sesuatu pada mereka sebagaimana orang beriman membencinya, maka mereka bukanlah dari golongan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Dan jika kalian mendapatkan kebaikan, berupa kemenangan atau harta rampasan, maka dengan penuh penyesalan seakan mereka jauh dari kalian, dan seakan tidak ada kasih sayang, dan pertolongan antara dia dan kalian, orang munafik ini akan berkata: “Kenapa kalian tidak membagi harta rampasan ini denganku? Andai saja aku bersama para mujahid di peperangan ini, maka aku akan mendapatkan bagian yang melimpah dari harta rampasan itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh jika kalian mendapat karunia} harta rampasan dan kemenangan {dari Allah, tentulah dia akan mengatakan seakan-akan belum pernah ada antara kalian dengan dia hubungan kasih sayang} hubungan yang baik dan kasih sayang {“Seandainya aku dahulu bersama mereka, tentu aku akan memperoleh kemenangan yang agung.”} sehingga aku mendapat bagian yang banyak dari harta rampasan itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Kemudian Allah berfirman, “sesungguhnya jika kamu beroleh karunia kemenangan dari Allah,” yaitu kemengan dan ganimah, “tentulah dia mengatakan seolah-olah belum ada hubungan kasih sayang antara kamu dengan dia,’sekiranya saya ada bersama-sama mereka, tetu saya mendapat kemenangan yang besar’,” maksudnya ia berangan-angan sekiranya ia ikut hadir pada saat itu agar dia memperoleh ghanimah, dan tidak ada kemauan pada mereka kecuali hanya untuk itu saja, dimana seakan –akan dia bukanlah di antara kalian sekalian wahai kaum Mukminin, dan tidak pula diantara kalian dengannya kasih sayang keimanan yang mana di antara tuntutannya adalah bahwa kaum Mukminin adalah bersekutu kepada segala kemaslahatan mereka dan menolak kemudharatan dari mereka, mereka merasa bahagia dengan diperolehnya kemaslahatan itu walaupun di dapatkan oleh orang lain dari saudara-saudaranya, kaum Mukminin dan mereka akan merasa sakit dengan kehilangannya dan mereka semua berusaha bersama-sama dalam setiap perkara untuk mendapatkan manfaat bagi dunia dan bagi agama mereka, dan orang yang berangan-angan dunia saja itu tidak memiliki ruh keimanan yang di sebutkan di atas."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 73: Akan berkata ada antara kamu dan antaranya (tali) percintaan \"Alangkah baiknya jika aku telah (pergi) bersama-sama mereka, lalu akupun dapat satu pendapatan yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu kemenangan atau ghanimah. Dengan nada penyesalan. Dia berharap dirinya hadir dalam peperangan tersebut agar memperoleh ghanimah, dan tidak ada yang diinginkannya selain ghanimah saja tidak lebih, seakan-akan dirinya bukan golongan kamu wahai kaum mukmin, dan seakan-akan tidak ada hubungan keimanan antara kamu dengan dia. Padahal keimanan itu menghendaki pemiliknya agar bersama-sama dengan kaum mukmin yang lain memikul beban demi mendatangkan maslahat dan menghindarkan madharat, merasa senang ketika ketika saudaranya memperoleh kemenangan dan merasa sedih ketika saudaranya tidak memperolehnya serta berusaha bersama-sama kepada sesuatu yang dapat memperbaiki keadaan agama dan dunia mereka. Namun ternyata yang terlintas dalam hatinya hanya dunia dan kesenangannya, tidak memikirkan masalah tadi. Tetapi karena kelembutan Allah Subhaanahu wa Ta'aala, Dia tidak membuat mereka berputus asa dari rahmat-Nya serta tidak menutup pintunya, bahkan Dia tetap mengajaknya menutupi kekurangan itu dan menyempurnakan dirinya. Oleh karena itu, di ayat selanjutnya Dia mengajak mereka memperbaiki dirinya dengan berbuat ikhlas dan berangkat untuk berjihad di jalan-Nya. Memperoleh banyak ghanimah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 73",
    "description": "Dan sungguh, jika kamu mendapat karunia dari Allah berupa kemenangan dalam perang dan memperoleh ganimah tentulah dia mengatakan dengan sangat menyesal bercampur keinginan mendapatkan ganimah, seakan-akan belum pernah ada hubungan kasih sayang antara kamu, kaum muslim, dengan dia, orang munafik, wahai, sekiranya aku bersama mereka ikut dalam peperangan, tentu aku akan memperoleh kemenangan yang agung pula, yakni bangga sebagai pemenang perang dan memperoleh harta rampasan perangsetelah ayat-ayat yang lalu mengecam perilaku orang-orang munafik yang selalu berkelit bila diajak berperang, ayat-ayat berikut membangkitkan semangat untuk maju ke medan perang menghadapi musuh. Karena itu, hendaklah orang-orang yang beriman kepada Allah dan rasul-Nya menjual dalam arti menukar dan mengorbankan kehidupan dunia yang mereka miliki untuk mendapatkan kebahagiaan pada kehidupan akhirat, dengan cara berperang di jalan Allah menegakkan keadilan dan kebenaran. Dan barang siapa di antara kalian yang ikut berperang di jalan Allah, lalu gugur menjadi syahid karena dikalahkan oleh musuh atau memperoleh kemenangan selamat dari gugur di medan perang, maka kelak akan kami berikan pahala dengan nikmat yang besar kepadanya."
  }
]