[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apakah yang menghalangi kalian (wahai kaum mukminin), untuk berjihad dalam rangka membela agama Allah dan membela hamba-hambaNYA yang lemah dari kalangan lelaki,kaum perempuan dan anak-anak kecil yang mengalami tindakan aniaya, dan tidak ada alasan bagi mereka serta tidak ada sarana bagi mereka kecuali dengan memohon pertolongan kepada tuhan mereka,mereka berdoa kepadaNYA dengan mengucapkan,”wahai tuhan kami,keluarkanlah kami dari negeri ini(maksudnya Makkah) yang penduduknya berbuat kezhaliman terhadap diri mereka dengan berbuat kekafiran dan terhadap kaum mukminin dengan melancarkan gangguan. Dan jadikanlah bagi kami dari sisiMu pelindung yang menangani urusan-urusan kami,dan penolong yang menolong kami menghadapi orang-orang yang zhalim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Apa yang menjadi penghalang kalian -wahai orang-orang mukmin- pergi berjihad di jalan Allah untuk menjunjung tinggi kalimat Allah dan menyelamatkan orang-orang yang tidak berdaya, baik laki-laki, wanita, maupun anak-anak yang memohon kepada Allah, “Ya Rabb kami, keluarkanlah kami dari Makkah, karena warganya telah berbuat zalim yaitu menyekutukan Allah dan menindas hamba-hamba-Nya. Dan berilah kami seorang pemimpin dari sisi-Mu yang akan mengurus dan menjaga kami, serta seorang pelindung yang akan melindungi kami dari mara bahaya”."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75- 76. Kemudian Allah mendorong orang-orang beriman untuk menolong para laki-laki dan perempuan serta anak-anak yang lemah yang tidak memiliki kekuatan dan kemampuan untuk melawan kezaliman yang mereka dapatkan dari para musuh. Mereka disiksa dan dipaksa untuk keluar dari agama sehingga yang mampu mereka lakukan hanyalah berdoa dan memohon pertolongan dari Allah. maka Allah mengabulkan doa mereka dengan menjadikan mereka sebaik-baik penolong, yaitu Muhammad, beliau memberikan sebaik-baik perlindungan dan menolong mereka dengan pertolongan yang terbaik. Kemudian Allah menyebutkan jenis orang-orang yang berperang. Dia berfirman: sesungguhnya orang-orang yang beriman berperang dan meninggikan kalimat Allah,sedangkan orang-orang kafir berperang demi mengikuti godaan setan dan kekafiran yang mereka anggap baik. Kemudian Allah kembali mendorong orang-orang beriman untuk berperang dan menjelaskan kelemahan musuh mereka, Dia berfirman: Perangilah para penolong setan. Kalian akan mengalahkan mereka berkat kekuatan yang kalian dapatkan dari Allah, sedangkan tipu daya setan itu sangatlah lemah sehingga tidak dapat melawan pertolongan dan bantuan Allah. Dan amatlah jauh antara tekad yang berdasarkan keimanan kepada Allah dan keyakinan atas janji yang diberikan pada orang-orang yang berjihad dengan tekad yang berdasarkan tipu daya dan angan-angan kosong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَالْمُسْتَضْعَفِينَ (orang-orang yang lemah) Yakni mengapa kalian tidak berperang di jalan menolong agama Allah dan jalan menolong orang-orang yang lemah agar kalian dapat membebaskan mereka dari tawanan dan menenangkan mereka dari hal yang berat . Yang dimaksud dengan orang-orang yang lemah disini adalah orang-orang beriman yang berada di Makkah yang berada dalam tekanan orang-orang kafir, dan mereka tidak sanggup untuk pindah ke negeri yang dapat memuliakan mereka. Mereka adalah orang-orang yang didoakan Rasulullah: “Ya Allah, selamatkanlah Walid bin Walid, Salamah bin Hisyam, ‘Ayyasy bin Rabi’ah, dan orang-orang lemah dari kalangan orang-orang beriman. مِنَ الرِّجَالِ وَالنِّسَآءِ وَالْوِلْدٰنِ(baik laki-laki, wanita-wanita maupun anak-anak) Ini merupakan penjelasan dari kalimat “orang-orang yang lemah”. الْقَرْيَةِ الظَّالِمِ أَهْلُهَا (negeri ini yang zalim penduduknya) Yakni negeri Makkah, dan Allah tidak menisbatkan kezaliman kepada negeri Makkah sebagai bentuk pemuliaan bagi negeri ini."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat menyebutkan anak-anak sebagai pelengkap seruan berbuat kasih sayang, dan pengingat untuk saling mencekam kezhaliman orang-orang musyrik karena ulah mereka yang buruk hingga kepada anak-anak, ayat ini juga sebagai dalil atas terkabulnya doa mereka, dan dekatnya kesudahan dari kezholiman itu, hal itu ditunjukkan adanya kepasrahan diri kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Lalu kenapa kalian tidak mau berperang di jalan Allah dan orang-orang yang lemah, supaya kalian bisa membebaskan mereka dari tawanan orang-orang kafir. Di jaman nabi, orang-orang yang lemah adalah orang-orang mukmin yang ada di Mekah. Mereka dilarang orang-orang musyrik untuk hijrah menuju Madinah. Mereka disakiti diri dan hartanya. Nabi SAW berdoa untuk mereka: “Ya Allah, selamatkanlah Walid bin Walid, Salamah bin Hisyam, Ayyasy bi Rabi’ah dan orang-orang mukmin yang lemah.” Mereka juga berdoa: “Wahai Tuhan kami, keluarkanlah kami dari wilayah ini (yaitu Mekah) yang mana penududuknya telah zalim. Sesungguhnya mereka menzalimi kami dan mencelakai kami. Dan utuslah seorang wali dari sisiMu yang dapat diserahi urusan-urusan kami dan menjadi penolong yang menolong kami dari orang-orang zalim itu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian tidak berperang} berjihad {di jalan Allah dan (membela) orang-orang yang lemah} menyelamatkan orang-orang yang lemah {dari (kalangan) laki-laki, perempuan, dan anak-anak yang berdoa, “Wahai Tuhan kami, keluarkanlah kami dari negeri ini} Makkah {yang zalim} yang musyrik {penduduknya Berilah kami pelindung dari sisiMu dan berilah kami penolong dari sisiMu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Ini adalah dorongan dari Allah bagi hamba-hambaNya yang beriman dan pengorbanan semangat bagi mereka untuk berperang di jalanNya, dan bahwasanya hal itu telah wajib atas mereka dan menetapkan celaan yang besar terhadap mereka bila meninggalkannya. Allah berfirman, “Mengapa kamu tidak mau berperang di jalan Allah” kondisinya adalah bahwa orang-orang yang tertindas, baik laki-laki, wanita, atau anak-anak yang tidak mampu berdaya upaya dan tidak mampu mencari jalan (untuk hijrah), bersamaan dengan itu sesungguhnya mereka telah menerima kezhaliman yang sangat keras dari musuh-musuh mereka, lalu mereka berdoa kepada Allah agar berkenan mengeluarkan mereka dari kampung tersebut di mana penduduknya berlaku zhalim terhadap mereka dengan kekufuran dan kesyirikan, dan terhadap kaum Mukminin dengan gangguan dan penghalangan dari jalan Allah, dan menahan mereka dari dakwah kepada agama mereka dan dari berhijrah, mereka juga berdoa kepada Allah agar berkenan menjadikan seorang pemimpin dan penolong untuk mereka yang mampu menyelamatkan mereka dari kampung yang masyarakatnya berlaku zhalim tersebut, maka jihad yang kalian tegakan dalam bentuk yang seperti itu adalah perjuangan dan membela kehormatan kalian, karena berjihad yang merupakan perlawanan terhadap kaum kafir, sesungguhnya walaupun mengandung keutamaan yang besar dan orang yang tidak ikut berjihad akan dihadapkan dengan celaan yang besar, maka berjihad dengan menyelamatkan orang-orang yang tertindas di antara kalian adalah lebih besar ganjarannya dan lebih banyak faidahnya, dan itu termasuk dalam bentuk tindakan menolak musuh."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {وَالْمُسْتَضْعَفِينَ} wal mustadh’afiin: adalah orang yang payah, maka dianggap orang lemah oleh selainnya dan karenanya itu dia disakiti. {الْقَرْيَةِ} al qoryah: qoryah di dalam bahasa al quran adalah istilah untuk kota yang besar, metropolitan dan maksud di sini adalah mekkah. Makna ayat : Adapun ayat (75), sesungguhnya Allah setelah memerintahkan para hamba-Nya untuk berjihad dan memotivasi mereka untuk bersegera memasuki peperangan dengan firman-Nya: {وَمَا لَكُمْ لا تُقَاتِلُونَ فِي سَبِيلِ اللهِ} “dan kenapa kalian tidak berperang di jalan Allah” untuk menyembah Dia semata dan merendahkan mereka {وَالْمُسْتَضْعَفِينَ مِنَ الرِّجَالِ وَالنِّسَاءِ وَالْوِلْدَانِ} “dan orang-orang yang tergolong lemah dari kaum laki-laki, wanita dan anak-anak” orang-orang yang ditindas oleh orang-orang musryik dan disiksa karena agamanya sampai-sampai mereka terang-terangan berdoa kepada Allah seraya berkata : {رَبَّنَا أَخْرِجْنَا مِنْ هَذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ وَلِيّاً} “Wahai Tuhan kami, keluarkan kami dari kota ini yang mana penduduknya zalim dan jadikanlah kami wali di sisi-Mu” begitulah perintah kami, maka cukuplah bagi kami apa yang paling pentihng untuk kami, {وَاجْعَلْ لَنَا مِنْ لَدُنْكَ نَصِيراً} “dan jadikan bagi Kami dari sisi-Mu penolong” menolong kami dari para musuh kami, yaitu sesuatu yang bisa mencegah kalian wahai para kaum mukminin dari perang di jalan Allah agar Dia disembah semata wayang dan membebaskan orang-orang lemah dari gerombolan kamum musyrikin untuk agama mereka. Pelajaran dari ayat : • Seorang yang berjihad kembali dengan perjanjian yang agung walaupun dia gugur di medan perang, menang dan sukses. Itu adalah surga."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 75: Dan mengapakah kamu tidak mau berperang di jalan Allah dan (membela) orang-orang yang lemah dari laki-laki dan perempuan dan anak-anak yang berseru: \"Hai Tuhan kami! Keluarkanlah kami dari negeri yang penduduknya zhalim ini, dan jadikanlah bagi kami, dari pihak-Mu, seorang ke- tua, dan jadikanlah untuk kami, dari pihak-Mu, seorang pembantu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan dorongan dari Allah kepada kaum mukmin agar mau berperang di jalan-Nya, dan bahwa yang demikian harus mereka lakukan, terlebih jihad di sini adalah jihad daf' (pembelaan); membela orang-orang yang lemah dan tertindas. Mereka adalah orang-orang yang ditahan orang-orang kafir dari berhijrah dan disakiti. Allah Subhaanahu wa Ta'aala mengabulkan permohonan mereka, Dia memudahkan mereka berhijrah dan sebagian lagi tetap tinggal di Mekah sampai tiba Fat-hu Makkah (penaklukkan Mekah). Ketika fat-hu Makkah, Rasulullah shallallahu 'alaihi wa sallam mengangkat 'Ataab bin Usaid sebagai gubernur Mekah, Dia pun memberikan hak orang yang terzalimi dari orang yang menzalimi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 75",
    "description": "Demikian besar nilai di sisi Allah terhadap orang yang ikut berperang di jalan Allah. Tidak ada alasan untuk menghindar dari tugas tersebut. Oleh sebab itu, mengapa kamu tidak mau ikut dalam barisan berperang di jalan yang bertujuan utuk menegakkan agama Allah dan juga membela orang yang lemah, baik laki-laki, perempuan maupun anak-anak, apakah itu orang tua, handai tolan, atau putra-putri kamu yang masih berada di mekah terjebak dalam pengawasan orang-orang musyrik. Mereka itulah yang selalu berdoa, ya tuhan kami, keluarkanlah kami dari negeri mekah ini, bukan karena tidak senang kepada mekah ini, tetapi karena orang-orang kafir yang menjadi penduduknya dan yang mengusai kota tersebut berlaku zalim kepada kami. Ya Allah yang maha pemurah lagi maha perkasa, berilah kami pelindung dari sisi-Mu, dan berilah pula kami penolong dari sisi-Mu. Allah mengingatkan sekali lagi tentang nilai orang-orang beriman dan orang-orang kafir. Orang-orang yang beriman kepada Allah dan rasul-Nya dan berperang di jalan Allah untuk menegakkan keadilan dan kebenaran, dan orang-orang yang kafir berperang di jalan thagut dengan tujuan menebarkan kejahatan dan berbuat kezaliman. Maka oleh sebab itu, perangilah kawan-kawan setan itu agar kejahatan dan kezaliman tidak terus berkembang, karena sesungguhnya tipu daya setan dan juga kawan-kawan setan itu lemah dan rapuh."
  }
]