[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang benar dalam keimanan mereka,baik secara keyakinan maupun amal perbuatan,mereka berjihad untuk membela kebenaran dan pendukungnya. Dan orang-orang kafir berperang untuk membela kezhaliman dan beruat kerusakan di muka bumi. Maka perangilah oleh kalian (wahai kaum mukminin),orang-orang kafir dan musyrik yang menyerahkan kesetiaan kepada setan dan menaati perintahnya.Sesungguhnya pengaturan setan terhadap orang-orang yang membelanya adalah lemah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Kaum mukminin yang tulus berperang di jalan Allah untuk menjunjung tinggi kalimat Allah. Sedangkan orang-orang kafir berperang di jalan sesembahan mereka, maka perangilah kawan-kawan setan itu. Karena apabila kalian memerangi mereka, niscaya kalian akan dapat mengalahkan mereka. Sebab, upaya setan itu sangat lemah sehingga tidak menimbulkan efek yang buruk bagi orang-orang yang bertawakal kepada Allah -Ta'ālā-."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. الَّذِينَ ءَامَنُوا۟ يُقٰتِلُونَ فِى سَبِيلِ اللهِ ۖ (Orang-orang yang beriman berperang di jalan Allah) Yakni peperangan mereka dengan tujuan berperang di jalan Allah, dan bukan dengan tujuan lain. وَالَّذِينَ كَفَرُوا۟ يُقٰتِلُونَ فِى سَبِيلِ الطّٰغُوتِ(dan orang-orang yang kafir berperang di jalan thaghut) Yakni di jalan setan dan demi memenuhi godaan-godaannya yang dibisikkan kedalam hati manusia, seperti mencari ketenaran dan kemenangan dengan kebathilan, menghinakan orang lain, merampas harta orang lain, membalas dendam dengan cara yang salah, dan berbangga-bangga atas ras dan kelompok. فَقٰتِلُوٓا۟ أَوْلِيَآءَ الشَّيْطٰنِ ۖ إِنَّ كَيْدَ الشَّيْطٰنِ كَانَ ضَعِيفًا (sebab itu perangilah kawan-kawan syaitan itu, karena sesungguhnya tipu daya syaitan itu adalah lemah) Yakni tipu daya setan dan orang-orang kafir yang menikutinya adalah lemah ketika dihadapkan pada pertolongan Allah untuk hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dalam satu ayat Allah menyebutkan bahwa manusia itu lemah, kemudian dalam ayat ini Allah pun menyebutkan tentang tipu daya syaithon juga lemah { إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا } dan dua makhluq yang lemah ini ketika bertemu dalam peperangan, lalu setiap dari keduanya tidak memiliki penolong, maka itulah Allah memeritahkan manusia yang lemah ini untuk mememohon pertolongan kepada tuhan yang Maha Lembut agar mereka dijauhkan dari tipu daya syaithon yang lemah. 2 ). Begitu banyak diantara manusia yang memohon perlindungan kepada Allah dari keburukan syaithon, tetapi dalam dirinya ada rasa takut kepada syaithon, dan sifat ini selamanya tidaklah pantas bagi orang-orang yang senantiasa berada di sisi al-qur'an, yang merasa bahwasanya dia memohon perlndugan kepada dan bergantung kepada tuhan semesta alam, dan bahwasanya syaithon itu berada dalam gengaman Allah, maka tidak semestinya ia menyimpan perasaan ini dalam dirinya padahal ia mengetahui firman Allah yang menciptakan musuhnya ini : { إِنَّ كَيْدَ الشَّيْطَانِ كَانَ ضَعِيفًا } \"karena sesungguhnya tipu daya syaitan itu adalah lemah\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Orang-orang yang beriman itu berperang untuk meninggikan kalimat Allah, yaitu kalimat yang mengandung kebenaran, keadilan, tauhid, dan pertolongan terhadap agama dan syariat. Sedangkan orang-orang kafir itu berperang di jalan setan dan para pengikutnya untuk mendapatkan kekuasaan dan kejayaan dengan cara bathil. Maka perangilah para penolong setan itu wahai orang-orang mukmin. Sesungguhnya tipu muslihat setan terhadap orang-orang mukmin itu sangat lemah dan kecil, sehingga mudah dihilangkan dengan tekad dan keteguhan orang-orang mukmin. Dalam hal ini terdapat dorongan kekuatan dalam hato orang-orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang beriman berperang di jalan Allah dan orang-orang yang kafir berperang di jalan tagut} setan {Perangilah kawan-kawan} teman-teman {setan itu. Sesungguhnya tipu daya} rencana {setan itu lemah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Hal ini adalah kabar dari Allah bahwasanya kaum Mukmimin berperang di jalanNya, “dan orang-orang yang kafir berperang di jalan thagut” yaitu setan, dalam kandungan hal tersebut ada beberapa faidah, di antaranya, ~ Bahwa seberapa besar keimanan seorang hamba, maka sebesar itu pula jihadnya di jalan Allah, keikhlasannya dan ketaatannya, jihad di jalan Allah adalah di antara pengaruh keimanan, tuntutan-tuntutannya dan kebutuhan-kebutuhannya, sebagaimana perang di jalan thagut itu adalah di antara cabang-cabang kekufuran dan tuntutan-tuntutannya. ~ Bahwasanya orang yang berperang di jalan Allah seyogyanya dan sebaiknya bersabar dan tegar, yaitu sikap yang tidak dilakukan oleh selainnya. Apabila wali-wali setan bersabar dan berperang padahal mereka berada di atas kebatilan, maka ahli kebenaran adalah lebih patut untuk itu, sebagaimana Allah berfirman tentang makna itu, \"Jika kamu menderita kesakitan, maka sesungguhnya merekapun menderita kesakitan (pula), sebagaimana kamu menderitanya, sedang kamu mengharap dari pada Allah apa yang tidak mereka harapkan. \" (An-Nisa:104). ~ Bahwasanya orang yang berperang di jalan Allah bersandar pada suatu pilar yang kokoh, yaitu kebenaran dan tawakal kepada Allah, maka seorang yang kuat dan berpilar kepada yang kokoh dituntut untuk bersabar, teguh, dan bersemangat di mana tidak dituntut dari orang yang berjuang demi kebatilan yang tidak memiliki hakikat sama sekali dan tidak memiliki akibat yang baik, karena itulah Allah berfirman, “Sebab itu perangilah kawan-kawan setan itu, karena sesungguhnya tipu daya setan itu adalah lemah,” dan tipu daya itu adalah menempuh cara-cara yang tersembunyi demi membahayakan musuh, dan setan bila pun tipu dayanya telah banyak dan berbagai macam, namun semua itu sanagtlah lemah yang sama sekali tidak akan mengalahkan sekecil apa pun kebenaran dan tidak pula terhadap siasat Allah bagi hamba-hambaNya yang beriman."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {فِي سَبِيلِ الطَّاغُوتِ} fii sabiilith thoghut: menolong kesyirikan, menyokong kezaliman dan permusuhan serta menyebarkan kerusakan. Makna ayat : Kemudian di ayat yang ketiga (76), Allah mengabarkan kepada para hamba-Nya yang beriman secara khusus untuk berjihad melawan para musuh Allah dan musuh mereka dengan firman-Nya {الَّذِينَ آمَنُوا يُقَاتِلُونَ فِي سَبِيلِ اللهِ} “orang-orang yang beriman beperang di jalan Allah” karena mereka itu orang-orang yang beriman kepada Allah, janji-Nya dan ancaman-Nya. {وَالَّذِينَ كَفَرُوا يُقَاتِلُونَ فِي سَبِيلِ الطَّاغُوتِ} “dan orang-orang yang kafir berperang di jalan Thoghut” yaitu kekufuran dan kezaliman karena mereka tidak beriman kepada Allah dan dengan apa yang ada di sisi-Nya dari berbagai macam kenikmatan, tidak beriman dengan siksaan dan ancaman Allah {فَقَاتِلُوا أَوْلِيَاءَ الشَّيْطَانِ} “maka perangilah setan-setan itu” mereka adalah kaum kafir dan janganlah kalian takut kepada meraka {إِنَّ كَيْدَ الشَّيْطَانِ كَانَ} “sesungguhnya makar setan” masih {ضَعِيفاً} “lemah” dan tidak kokoh dan setan adalah para wali orang-orang kafir. Sementara pasukan kaum mukminin adalah para wali Allah. Pelajaran dari ayat : • Rasa takut kepada musuh tidaklah dapat mencegah kaum mukminin dari jihad karena kekuatan para musuh adalah kekuatan setan dan tipudaya setan adalah sesuatu yang lemah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 76: Orang-orang yang beriman itu berperang di jalan Allah; dan orang-orang yang kufur itu berperang di jalan sesuatu yang melewati batas. Lantaran itu, perangi- lah pengikut-pengikut setan, karena tipu daya setan itu adalah lemah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada beberapa faedah yang dapat diambil dari ayat ini: Pertama, jihad fii sabilillah, keikhlasan dan sejauh mana ittiba' seseorang (mengikuti Rasulullah shallallahu 'alaihi wa sallam) tergantung kadar keimanan seorang hamba. Jihad fii sabilillah merupakan pengaruh dari keimanan, konsekwensinya dan kehendaknya sebagaimana berperang di jalan thagut termasuk cabang kekafiran dan konsekwensinya. Kedua, orang-orang yang berperang di jalan Allah hendaknya bersabar dan tahan banting. Hal itu, karena kawan-kawan setan siap bersabar dan tahan banting, padahal mereka di atas kebatilan. Oleh karena itu, orang-orang yang berada di atas kebenaran lebih berhak untuk sabar dan tahan banting. Allah Subhaanahu wa Ta'aala berfirman, \"Jika kamu menderita sakit, maka sesungguhnya mereka pun menderita sakit (pula), sebagaimana kamu menderitanya, sedangkan kamu mengharap dari Allah apa yang tidak mereka harapkan. Dan Allah Maha mengetahui lagi Maha Bijaksana.\" (Terj. An Nisaa': 104) Ketiga, orang-orang yang berperang di jalan Allah berpegang dengan tiang yang kuat, yaitu kebenaran dan bertawakkal kepada Allah. Orang yang memiliki tiang yang kuat dituntut untuk lebih sabar, berani, teguh dan semangat. Berbeda dengan orang yang berada di atas kesalahan. Pada ayat di atas diterangkan bahwa tipu daya setan adalah lemah. Tipu daya adalah cara tersembunyi yang ditempuh untuk menimpakan bahaya kepada musuhnya. Dalam ayat tersebut diterangkan, bahwa setan itu meskipun telah mencari cara untuk dapat mengalahkan lawannya, namun jika berhadapan dengan kebenaran dan dengan rencana Allah, maka tipu daya itu tidak berarti apa-apa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 76",
    "description": "Allah mengingatkan sekali lagi tentang nilai orang-orang beriman dan orang-orang kafir. Orang-orang yang beriman kepada Allah dan rasul-Nya dan berperang di jalan Allah untuk menegakkan keadilan dan kebenaran, dan orang-orang yang kafir berperang di jalan thagut dengan tujuan menebarkan kejahatan dan berbuat kezaliman. Maka oleh sebab itu, perangilah kawan-kawan setan itu agar kejahatan dan kezaliman tidak terus berkembang, karena sesungguhnya tipu daya setan dan juga kawan-kawan setan itu lemah dan rapuh. Ayat-ayat yang lalu menggambarkan dua motivasi perang dan dua kelompok pada masing-masing motivasi itu. Ayat-ayat berikut menggambarkan fenomena yang ada di sebagian kelompok orang beriman yang enggan diajak berperang. Tidakkah engkau memperhatikan, wahai kaum beriman, orang-orang yang dikatakan kepada mereka, yakni orangorang yang menampakkan dirinya beriman dan minta izin berperang sebelum ada perintah berperang' dikatakan kepada mereka, tahanlah tanganmu dari berperang karena belum waktunya, laksanakanlah salat guna membangun hubungan dengan Allah, dan tunaikanlah zakat untuk membangun hubungan dengan sesama! ketika situasi telah menuntut untuk melakukan perang karena kaum muslim bertambah teraniaya, maka mereka pun diwajibkan untuk berperang, tiba-tiba sebagian mereka golongan munafik yang telah hidup nyaman pada waktu turunnya ayat ini, takut kepada manusia sebagai musuh yakni orang-orang kafir seperti takutnya kepada Allah, bahkan lebih dahsyat lagi takut dari itu. Dalam kondisi dihantui oleh rasa takut menghadapi musuh dan takut kehilangan kesenangan yang sudah diperoleh, mereka berkata, ya tuhan kami, mengapa engkau wajibkan berperang kepada kami, padahal kami belum terlepas dari kesulitan hidup' mengapa tidak engkau tunda kewajiban berperang itu kepada kami beberapa waktu lagi, agar kami dapat merasakan kesenangan ini lebih lama lagi' katakanlah, berapa lama pun kesenangan yang kalian dapatkan di dunia ini tidak ada artinya, karena kesenangan dunia itu hanya sedikit, dan kesenangan akhirat itu lebih baik karena banyak dan beraneka ragam, yang disediakan bagi orang-orang yang bertakwa mendapat pahala turut berperang dan kamu tidak akan dizalimi sedikit pun baik di dunia maupun di akhirat."
  }
]