[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidakkah kamu (wahai rasul) mengetahui perihal orang-orang yang dikatakan kepda mereka sebelum adanya izin berjihad,”tahanlah tangan-tangan kalian dari memerangi musuh-musuh kalian dari kalangan musyrikin, dan kewajiban kalian adalah mengerjakan kewajiban yang Allah wajibkan bagi kalian, berupa shalat dan membayar zakt,” maka ketika Dia mewajibakan mereka untuk berperang tiba-tiba ada segolongan dari mereka yang berubah keadaannya.Mereka malah menjadi takut terhadap manusia dan gentar menghadapi mereka,seperti ketakutan mereka kepada Allah,atau bahkan lebih kuat. Dan mereka mengumumkan persaan yang merasuki mereka berupa rasa takut yang amat besar,lalu mereka mengatakan,”Wahai tuhan kami mengapa,Engkau mewajibkan kami berperang?tidakkah engkau menangguhkan kami sampai beberapa saat lagi?” dikarenakan hasrat besar terhadap mereka sangat besar dari mereka terhadap kesenangan yang ada di kehidupan dunia. katakanlah olehmu (wahai rasul), ”Kesenangan di dunia itu sedikit,sedang kehidupan akhirat dan segala kenikmatan yang ada di dalamnya lebih agung dan lebih abadi bagi orang yang bertakwa lalu mengerjakan amal yang diperintahkan kepadanya dan menjauhi perkara yang dia larang untuk melakukannya. Tuhanmu tidaklah menzhalimi sesorang sedikitpun, meskipun sekecil benang yang ada di belahan biji kurma."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Tidakkah kamu -wahai Rasul- melihat perilaku sebagian sahabatmu yang meminta agar mereka diperintahkan berjihad, lalu disampaikan kepada mereka, “Tahanlah tanganmu dari perang, dirikanlah salat, dan tunaikanlah zakat.” Hal itu terjadi sebelum ada perintah berjihad. Kemudian setelah mereka hijrah ke Madinah dan Islam telah memiliki pertahanan yang kuat, lalu diwajibkan berperang, ternyata mereka merasa berat, sehingga sebagian dari mereka merasa takut kepada manusia sebagaimana mereka takut kepada Allah atau bahkan lebih takut lagi. Dan mereka berkata, “Ya Rabb kami, mengapa Engkau mewajibkan kami berperang? Mengapa tidak Engkau tunda sejenak sampai kami bisa menikmati (kesenangan) dunia?” Katakanlah -wahai Rasul- kepada mereka, “Kesenangan dunia itu, seberapa pun banyaknya adalah sedikit dan sementara. Sedangkan Akhirat lebih baik bagi orang yang bertakwa kepada Allah -Ta'ālā-. Karena kenikmatan Akhirat itu abadi dan amal saleh mereka tidak akan dikurangi sedikit pun, walau sebesar serat yang ada di biji kurma”."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Allah menolong sebagai para sahabat dalam menyikapi jihad di jalan-Nya dengan beriman kepada Rasulullah: Tidakkah kamu mengetahui kisah orang-orang yang meminta untuk berperang ketika mereka di Makkah, namun dikatakan kepada mereka, “Bersabarlah dahulu untuk tidak berperang karena belum datang saatnya, namun persiapkanlah diri kalian dengan melaksanakan salat, zakat, dan bersabar atas kelakuan orang-orang musyrik .” Namun ketika diwajibkan kepada mereka untuk memerangi orang-orang musyrik, ternyata sebagian dari mereka sangat takut terhadap orang-orang musyrik sebagaimana ketakutan mereka kepada Allah atau ketakutan yang lebih dari itu; mereka menempatkan ketakutan dalam diri mereka dengan berkata: “ ya Tuhan kami, Mengapa Engkau wajibkan kepada kami untuk berperang? Tidakkah engkau mundur kewajiban ini barang sebentar saja agar kami dapat sedikit beristirahat dari kesusahan yang kami dapatkan dari orang-orang kafir Makkah?” Allah berfirman, Hai Muhammad jawablah mereka: “Apa yang kalian harapkan itu hanyalah kenikmatan dunia, sedangkan dunia itu sedikit dan akan lenyap; akhirat lebih baik dan lebih mulia bagi orang-orang yang bertakwa, dan pahala amalan kalian tidak akan dikurangi sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. كُفُّوٓا۟ أَيْدِيَكُمْ (Tahanlah tanganmu (dari berperang)) Mereka adalah sebagian dari para sahabat, mereka diperintahkan untuk meninggalkan perang di Makkah lalu mereka menghadap Rasulullah dan berkata: “ Wahai Nabi Allah, dulu kami adalah orang-orang yang kuat dan mulia ketika kami masih termasuk orang-orang musyrik, lalu ketika kami beriman kami menjadi orang-orang yang tertindas”. Rasulullah menjawab: “namun aku diperintahkan untuk memaafkan (orang-orang yang memerangi kita), maka janganlah kalian perangi mereka. فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ (Setelah diwajibkan kepada mereka berperang) Yakni ketika di Madinah. Mereka malah enggan untuk pergi berperang, bukan karena mereka ragu terhadap agama Islam, namun mereka takut dari kematian dan lari dari dahsyatnya kematian. Pendapat lain mengatakan yang dimaksudkan dalam ayat ini adalah orang-orang munafik yang masuk Islam sebelum diwajibkannya perang, dan ketika perang itu diwajibkan mereka malah membencinya. يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللهِ أَوْ أَشَدَّ خَشْيَةً ۚ (mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih sangat dari itu takutnya) Yakni sebagian dari mereka takut kepada manusia seperti halnya ketakutan mereka kepada Allah, bahkan sebagian lainnya ketakutan mereka kepada manusia lebih besar daripada kepada Allah. لَوْلَآ أَخَّرْتَنَآ إِلَىٰٓ أَجَلٍ قَرِيبٍ ۗ (Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada kami sampai kepada beberapa waktu lagi?) Yakni tidakkah engkau memberi kami kesempatan sedikit lagi kami bisa menikmati hidup ini. Ayat ini mirip dengan ayat lain yang terdapat pada surat Muhammad: 20 yang berarti: “Dan orang-orang yang beriman berkata: “Mengapa tiada diturunkan suatu surat?” Maka apabila diturunkan suatu surat yang jelas maksudnya dan disebutkan di dalamnya (perintah) perang, kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati, dan kecelakaanlah bagi mereka”. قُلْ مَتٰعُ الدُّنْيَا قَلِيلٌ (Katakanlah: “Kesenangan di dunia ini hanya sebentar) Yakni cepat sekali lenyap dan tidak kekal bagi pemiliknya, sedangakan balasan akhirat lebih baik bagi kalian daripada kesenangan yang sejenak ini. وَالْاٰخِرَةُ خَيْرٌ لِّمَنِ اتَّقَىٰ( dan akhirat itu lebih baik untuk orang-orang yang bertakwa) Yakni orang-orang bertakwa diantara kalian, yang berharap balasan yang kekal. وَلَا تُظْلَمُونَ فَتِيلًا(dan kamu tidak akan dianiaya sedikitpun) Yakni walau dengan kezaliman sedikitpun. Makna (الفتيل) yakni benang tipis yang ada di belahan biji kurma."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Wahai Nabiyullah, apakah kamu tidak melihat sebagian sahabat mukmin yang dikatakan kepada mereka di Mekah: “Tahanlah tangan kalian untuk memerangi orang-orang musyrik, tunaikanlah shalat fardhu, dan berikanlah zakat kepada orang yang berhak menerimanya.” Namun ketika diwajibkan bagi mereka di Madinah untuk melakukan jihad yang terus mereka cari, sebagian mereka takut memerangi orang musyrik layaknya ketakutan mereka terhadap azab Allah. atau bahkan lebih takut terhadap azabNya, bukan karena canggung melainkan takut mati dan takut terhadap kengerian perang. Mereka berkata: “Kenapa engkau mewajibkan peperangan atas kami? Kenapa tidak engkau tangguhkan waktu kami, sehingga bisa menikmati kehidupan kami di kesempatan yang lainnya?!” Katakan kepada mereka wahai Nabi: “Kenikmatan dunia itu sangat cepat hilang, dan pahala akhirat itu lebih baik bagi kalian daripada kenikmatan yang sedikit di dunia bagi orang yang bertakwa kepada Allah dan menghendaki keabadian dan pahala yang terus menerus di antara kalian. Dan kalian tidak akan dizalimi (tidak akan dikurangi) sedikitpun pahalanya bahkan seukuran fatil yaitu sabut yang ada di biji kurma” Ayat ini turun untuk sebagian sahabat. Mereka mendapatkan banyak penderitaan dari orang-orang musyrik, lalu berkata: “Wahai Rasulullah, apakah engkau memberi ijin kami untuk memerangi mereka?” Lalu Rasulullah bersabda kepada mereka: “Tahanlah tangan kalian untuk menyakiti mereka, sesungguhnya aku belum diperintahkan untuk memerangi mereka” lalu ketika Allah memerintahkan untuk memerangi orang-orang musyrik setelah hijrah, sebagian mereka membenci hal itu dan saling membubarkan diri. Lalu Allah menurunkan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu memperhatikan orang-orang yang dikatakan kepada mereka, “Tahanlah tangan kalian} tahanlah tangan kalian untuk berperang {tegakkanlah shalat, dan tunaikanlah zakat” Ketika diwajibkan} dewajibkan {bagi mereka berperang, tiba-tiba segolongan mereka takut kepada manusia lain seperti ketakutan mereka kepada Allah, bahkan lebih takut daripada itu. Mereka berkata, “Wahai Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak} mengapa tidak {Engkau tangguhkan kepada kami beberapa waktu lagi” Katakanlah, “Kesenangan di dunia ini hanyalah sedikit, sedangkan akhirat itu lebih baik bagi orang yang bertakwa dan kalian tidak akan dizalimi sedikit pun”} sebesar serabut yang ada di biji kurma"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. Kaum Muslimin ketika masih di Makkah, mereka diperintahkan untuk mendirikan shalat dan menunaikan zakat, yaitu sebagai pelipur lara bagi kaum fakir, bukan zakat yang diketahui yang memiliki nishab dan syarat-syarat tertentu, sesungguhnya zakat seperti itu belumlah diwajibkan kecuali di Madinah, dan mereka pun belum diperintahkan untuk berjihad karena beberapa faidah di antaranya; ~ Bahwa di antara hikmah Allah adalah Dia mensyariatkan hukum-hukum kepada hamba-hambaNya dalam bentuk yang tidak memberatkan mereka, dan Allah memulai dengan yang paling penting sebelum yang penting, yang lebih mudah sebelum yang mudah. ~ Bahwasanya bila saja diperintahkan kepada mereka jihad padahal jumlah dan perlengkapan mereka yang masih sedikit ditambah jumlah musuh yang besar, niscaya hal itu akan menjadi boomerang bagi hancurnya islam, maka menjadi pertimbangan yang pasti dari sisi kemaslahatan yang besar atas kemaslahatan yang lebih kecil darinya dan hikmah-hikmah Ilahi yang lainnya. Dan sebagian kaum Mukminin merasa sangat menginginkan seandainya jihad diwajibkan atas mereka pada suatu kondisi yang mana hal itu tidak cocok untuk diwajibkan, namun yang patut pada kondisi seperti itu adalah menegakkan apa yang diperintahkan kepada mereka berupa tauhid, shalat, zakat, dan semisalnya, sebagaimana Firman Allah, \"Dan sesungguhnya kalau mereka melaksanakan pelajaran yang diberikan kepada mereka, tentulah hal yang demikian itu lebih baik bagi mereka dan lebih menguatkan (iman mereka),\" (An-Nisa:66) Kemudian ketika mereka berhijrah ke Madinah dan Islam telah kuat, maka diwajibkanlah jihad atas mereka pada waktunya yang cocok untuk itu, lalu sekelompok dari orang-orang yang sebelumnya tergesa-gesa meminta diwajibkannya jihad karena rasa takut kepada manusia (musuh), mereka lemah dan tidak berani, “Ya Rabb kami, mengapa Engkau wajibkan berperang kepada kami?” dalam hal ini tindakan itu adalah sebuah sikap keluh kesah dan sanggahan terhadap Allah, dan yang sepatutnya bagi mereka adalah menerima perintah Allah dan bersabar atas perintah-perintahNya tersebut, maka mereka telah berlaku kebalikan dari apa yang seharusnya diharapkan dari mereka, mereka berkata, “Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada kami beberapa waktu lagi?” maksudnya, mengapa engkau tidak menunda kewajiban jihad itu selama masa tertentu dan bukan saat ini, kondisi seperti ini sering kita temui diperlihatkan oleh orang-orang yang kurang matang dan tergesa-gesa dalam urusan sebelum waktunya, kebanyakannya adalah ia tidak akan bersabar atasnya ketika menunaikannya dan tidak pula teguh dalam mengembannya, akan tetapi ia sedikit sekali kesabarannya. Kemudian Allah mengingatkan mereka dari kondisi seperti itu, di mana itu merupakan tindakan tidak ikut serta dalam peperangan, dalam FirmanNya, “Katakanlah, ‘Kesenangan di dunia ini hanya sebentar dan akhirat itu lebih baik untuk orang-orang yang bertakwa’“ maksudnya, menikmati kesenangan-kesenangan dunia dan keindahan-keindahannya adalah sebentar, dan menghadapi segala kesulitan dalam ketaatan kepada Allah pada waktu yang sebentar adalah sangat mudah bagi jiwa dan ringan untuknya, karena bila ia mengetahui bahwa kesulitan yang dihadapinya itu tidak akan lama, niscaya hal itu mudah baginya, lalu bagaimana ia mampu menyamakan antara dunia dan akhirat, padahal akhirat itu lebih baik dari dunia pada dzatnya yaitu kesenangan, dan waktunya. Adapun dzatnya sebagaimana disebutkan dalam hadits nabi \"sesungguhnya tempat sedikit di surge lebih baik dari pada dunia dan isisnya\", karena kenikmatannya adalah suci dari hal-hal yang merusaknya, bahkan setiap yang terbesit dalam benak atau berputar-putar dalam pikiran berupa gambaran suatu kenikmatan, maka kenikmatan surga itu adalah lebih dari gambaran tersebut, sebagaimana Allah berfirman, \"Tak seorangpun mengetahui berbagai nikmat yang menanti, yang indah dipandang sebagai balasan bagi mereka, atas apa yang mereka kerjakan.\" (As-Sajdah:17) Allah pun berfirman melalui lisan nabiNya \"Aku menyiapkan untuk hambaku yang sholeh sesuatu yang tidak pernah dilihat mata, tidak pernah didengar telinga dan tidak pernah terbersit dalam akal fikiran\". Adapun kenikmatan dunia, sesungguhnya ia bercampur dengan berbagai macam gangguan di mana bila dibandingkan antara kelezatannya dana pa yang mengiringinya berupa berbagai macam penderitaan dan kegelisahan serta kegalauan, maka kelezatan tersebut tidaklah mempunyai prosentase sedikit pun dari segala sisinya. Adapun waktunya, sesungguhnya dunia itu sementara, usia manusia menurut usia dunia sangatlah pendek sekali, sedangkan akhirat, maka sesungguhnya ia adalah kenikmatan yang selamanya, penghuni-penghuninya kekal di dalamnya, bila seorang yang berakal mau berpikir tentang kedua negeri tersebut dan tergambar olehnya hakikat keduanya dengan sebenar-benarnya, mesti ia tahu yang mana yang harus didahulukan, diusahakan, dan bersungguh-sungguh dalam meraihnya, karena itulah Allah berfirman, “Dan akhirat itu lebih baik untuk orang yang bertakwa,” yaitu menjauhi kesyirikan dan seluruh hal-hal yang diharamkan, “dan kamu tidak akan dianiyaya sedikit pun,” maksudnya, usaha kalian untuk akhirat akan kalian dapatkan secara sempurna dan penuh dan tidak dikurangi sedikit pun darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {كُفُّوا أَيْدِيَكُمْ} kuffuu aidiakum: tahanlah tangan kalian dari peperangan. Ini adalah perintah sebelum perang diwajibkan. {كُتِبَ عَلَيْهِمُ الْقِتَالُ} kutiba ‘alaihumul qitaal: diwajibkan kepada mereka perang {يَخْشَوْنَ} yakhsyaun: mereka takut {لَوْلا أَخَّرْتَنَا} laula akhkhortanaa: Sekiranya Engkau tunda untuk kami. {فَتِيلاً} fatiilaa: fatil adalah istilah orang Arab untuk sebuah garis tipis yang ada di dalam suatu biji. Makna Ayat: Diriwayatkan bahwa beberapa sahabat Rasul memohon agar diizinkan untuk berperang dan mereka tidak diizinkan karena tidak ada sebab yang cukup untuk melakukan perang. Dan kala itu mereka diperintahkan untuk mendirikan shalat dan menunaikan zakat sembari menunggu izin dari Allah untuk Rasul agar berperang dengan kaum musyrikin. Tatkala disyariatkan untuk berperang, sekelompok di antara mereka menjadi ciut hati untuk berperang, dan mereka berkata {لَوْلا أَخَّرْتَنَا إِلَى أَجَلٍ قَرِيبٍ} “Tidakkah Engkau tunda saja untuk kamu selama beberapa waktu dekat” beragumen dengan argumentasi yang remeh. Maka dari itu Allah menurunkan dua ayat (77 dan 78) {أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّوا أَيْدِيَكُمْ} “apakah kau tidak melihat orang-orang yang diperintahkan, tahan tangan kalian” dari perang {وَأَقِيمُوا الصَّلاةَ وَآتُوا الزَّكَاةَ} “dan dirikanlah shalat serta bayarlah zakat” sembari menunggu izin dari Allah, tatkala terpenuhi hal-hal yang mengharuskan untuk terjadi perang, tatkala diwajibkannya perang dan Allah berfirman {أُذِنَ لِلَّذِينَ يُقَاتَلُونَ بِأَنَّهُمْ ظُلِمُوا} “diizinkan perang kepada orang-orang yang diperangi sebab mereka telah dizalimi” orang-orang ini pun menjadi kecut hatinya dan tidak keluar untuk melakukan perang dan berkata {لَوْلا أَخَّرْتَنَا إِلَى أَجَلٍ قَرِيبٍ} “Tidakkah Engkau tunda saja untuk kami beberapa saat” mereka dengan berkata seperti itu menginginkan bersiap-siap berhari-hari sampai mereka mati dan tidak bertemu dengan musuh yang lemah. Allah kemudian memerintahkan Rasul agar menyampaikan kepada mereka {مَتَاعُ الدُّنْيَا قَلِيلٌ وَالآخِرَةُ خَيْرٌ لِمَنِ اتَّقَى} “perbendaharaan dunia itu sedikit dan akhirat itu lebih baik bagi orang yang bertakwa” kepada Allah dengan melakukan perintah-Nya dan meninggalkan apa yang dilarang setelah dia beriman kepada Allah dan Rasul-Nya. Kelak kalian akan mendapatkan perhitungan yang baik berdasarkan amal-amal kalian dan akan dibalas oleh karena amal kalian. {وَلا تُظْلَمُونَ فَتِيلاً} “kalian tidak akan dizalimi walaupun sedikit” tidak dikurangi kebaikannya dan tidak ditambah timbangan keburukannya. Ini adalah apa yang terakandung dalam ayat yang pertama (77). Pelajaran dari ayat : • Buruknya terburu-buru dan sifat pengecut serta buruknya akibat kedua perbuatan tersebut. • Akhirat lebih baik dari dunia bagi orang yang bertakwa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 77: 77-79. Orang-orang yang (pernah) dikata kepada mereka: \"Tahanlah tangan- tangan kamu dan dirikanlah shalat dan berilah zakat', tetapi tatkala diwajibkan mereka berperang, dari mereka, takut kepada manusia sebagaimana takut kepada Allah, atau lebih sangat takut, dan mereka Tidakkah engkau fikirkan tiba-tiba segolongan berkata: \"Hai Tuhan kami! Mengapakah Engkau wajibkan kami berperang? Mengapakah tidak Engkau biarkan kami hingga ajal (kami) yang hampir?\" Katakanlah: \"Benda dunia ini sedikit, dan Akhirat itu lebih baik buat orang yang berbakti; dan kamu tidak akan dianiaya (walaupun) sedikit\". Di mana saja kamu berada, kematian akan mendapati kamu. walaupun kamu di mahligai-mahligai yang teguh\", dan jika ke baikan mengenai mereka, mereka berkata: \"Ini dari sisi Allah\", dan jika kesusahan mengenai mereka, me- \"Ini dari sisimu\". mereka berkata: Katakanlah: \"Semua itu dari sisi Allah\". Mengapakah kaum itu hampir tidak mengerti perkataan? Apa-apa keuntungan yang mengenaimu, maka (yaitu) dari Allah; dan apa-apa kerugian yang mengenaimu, maka (yaitu) dari di- rimu, karena Kami utusmu kepa- da manusia sebagai seorang rasul; dan cukuplah Allah sebagai Saksi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nasa'i meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma, bahwa Abdurrahman bin 'Auf dan kawan-kawannya mendatangi Nabi shallallahu 'alaihi wa sallam di Mekah, lalu mereka berkata, \"Wahai Rasulullah, sesungguhnya kami berada dalam kekuatan saat kami masih musyrik. Ketika kami telah beriman, kami menjadi orang-orang yang lemah.\" Beliau bersabda, \"Sesungguhnya aku diperintahkan untuk memaafkan, oleh karena itu janganlah kamu berperang.\" Ketika Allah telah memindahkan kami ke Madinah, Allah memerintahkan kami berperang, namun banyak yang menahan diri (takut).\" Maka Allah menurunkan ayat, \"Alam tara ilalladziina qiila lahum kuffuu aydiyakum wa aqiimush shalaata…dst.\"(Hadits ini para perawinya adalah para perawi kitab shahih). Kaum muslimin ketika berada di Mekah ingin sekali jika sekiranya diwajibkan berperang kepada mereka karena melihat penindasan yang dilakukan kaum musyrik kepada sebagian saudara-saudara mereka. Namun Allah Subhaanahu wa Ta'aala menyuruh mereka untuk menahan diri (tidak berperang), tetap melaksanakan shalat dan berzakat. Tetapi maksud zakat di sini bukanlah zakat yang ada nishab dan syarat-syaratnya, bahkan ikut berbagi dengan kaum fakir. Hal itu, karena zakat yang memakai nishab tidak diwajibkan kecuali ketika di Madinah. Kaum muslimin tidak diperintahkan berjihad ketika itu karena beberapa hal, di antaranya: Pertama, termasuk kebijaksanaan Allah Subhaanahu wa Ta'aala adalah menetapkan syari'at yang tidak memberatkan hamba-hamba-Nya, memulainya dari yang terpenting dan yang lebih mudah dahulu dan bisa dikerjakan. Kedua, jika diwajibkan berperang kepada mereka, sedangkan jumlah mereka sedikit dan perlengkapan kurang, tentu hal itu akan membawa kepada lenyapnya Islam, maka diperhatikan maslahat yang lebih besar. Ketiga, jihad membutuhkan persiapan, baik persiapan fisik, materi maupun persiapan mental. Persiapan mental dapat diperoleh dari pembinaan rohani dan istiqamah di atas amal shalih, di antaranya adalah mendirikan shalat. Dan karena hal-hal lain yang hanya Allah yang mengetahuinya. Tetapi ketika mereka telah berijrah ke Madinah, di mana agama Islam semakin kuat, maka berperang diwajibkan bagi mereka. Namun setelah diwajibkan berperang, sebagian kaum muslimin yang dahulu meminta disegerakan diwajibkan berperang merasa takut, lemah dan tidak sanggup sambil berkata, \"Ya Tuhan Kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tunda (kewajiban berperang) kepada kami beberapa waktu lagi?\". Padahal yang seharusnya mereka lakukan adalah tunduk kepada perintah Allah dan bersabar di atasnya. Keadaan seperti ini biasanya menimpa kepada mereka yang belum kokoh azamnya, bersegera kepada sesuatu padahal belum tiba waktunya, maka biasanya ia tidak mampu bersabar ketika tiba saatnya dan tidak sanggup memikulnya. Takut terbunuh. Karena tidak siap mati. Yakni bersenang-senang dengan kehidupan dunia hanyalah sebentar. Memikul beban ketaatan kepada Allah dalam waktu yang sebenarnya sebentar membantu seseorang untuk dapat memikul beban itu. Belum lagi ditambah dengan kenikmatan di akhirat yang sempurna; pemandangannya yang indah sampai tidak terbayangkan oleh hati, belum pernah dilihat oleh mata dan belum pernah didengar oleh telinga. Penghuninya kekal dan tidak akan mati, mereka tetap muda dan tidak akan tua, mereka bersaudara tidak bermusuh-musuhan, mereka tetap senang dan tidak pernah sedih, mereka tetap sehat dan tidak pernah sakit, mereka senantiasa memperoleh keamanan dan tidak pernah tertimpa rasa takut dan kekhawatiran. Apa yang mereka inginkan ada di hadapan tanpa perlu bekerja keras dan berusaha, makanan dan minuman enak yang dihidangkan, bidadari yang bermata jeli dan kesenangan lainnya yang amat sempurna. Semua ini menghendaki kita untuk lebih mengutamakan akhirat daripada dunia, mengejarnya dan berusaha kepadanya. Mudah-mudahan kita semua dimasukkan Allah ke dalam surga, aamiin yaa Rabbal 'aalamiin. Usahamu untuk mengejar kampung akhirat akan kamu dapatkan secara sempurna balasannya tanpa dikurangi sedikit pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 77",
    "description": "Ayat-ayat yang lalu menggambarkan dua motivasi perang dan dua kelompok pada masing-masing motivasi itu. Ayat-ayat berikut menggambarkan fenomena yang ada di sebagian kelompok orang beriman yang enggan diajak berperang. Tidakkah engkau memperhatikan, wahai kaum beriman, orang-orang yang dikatakan kepada mereka, yakni orangorang yang menampakkan dirinya beriman dan minta izin berperang sebelum ada perintah berperang' dikatakan kepada mereka, tahanlah tanganmu dari berperang karena belum waktunya, laksanakanlah salat guna membangun hubungan dengan Allah, dan tunaikanlah zakat untuk membangun hubungan dengan sesama! ketika situasi telah menuntut untuk melakukan perang karena kaum muslim bertambah teraniaya, maka mereka pun diwajibkan untuk berperang, tiba-tiba sebagian mereka golongan munafik yang telah hidup nyaman pada waktu turunnya ayat ini, takut kepada manusia sebagai musuh yakni orang-orang kafir seperti takutnya kepada Allah, bahkan lebih dahsyat lagi takut dari itu. Dalam kondisi dihantui oleh rasa takut menghadapi musuh dan takut kehilangan kesenangan yang sudah diperoleh, mereka berkata, ya tuhan kami, mengapa engkau wajibkan berperang kepada kami, padahal kami belum terlepas dari kesulitan hidup' mengapa tidak engkau tunda kewajiban berperang itu kepada kami beberapa waktu lagi, agar kami dapat merasakan kesenangan ini lebih lama lagi' katakanlah, berapa lama pun kesenangan yang kalian dapatkan di dunia ini tidak ada artinya, karena kesenangan dunia itu hanya sedikit, dan kesenangan akhirat itu lebih baik karena banyak dan beraneka ragam, yang disediakan bagi orang-orang yang bertakwa mendapat pahala turut berperang dan kamu tidak akan dizalimi sedikit pun baik di dunia maupun di akhirat. Di mana pun kamu berada, wahai orang-orang yang enggan berperang di jalan Allah, kematian itu pasti akan mendapatkan kamu, kendatipun kamu berada pada persembunyian di dalam benteng yang tinggi dan kukuh yang tidak terdapat celah sedikit pun untuk menembusnya. Jika mereka, orang-orang yang enggan itu, memperoleh kebaikan, yakni sesuatu yang menyenangkan dan menggembirakan, mereka mengatakan, ini dari sisi Allah, dan jika mereka ditimpa suatu keburukan atau kondisi yang tidak menyenangkan, mereka akan mengatakan, ini dari engkau, yakni disebabkan olehmu, wahai Muhammad. Katakanlah, semuanya datang dari sisi Allah dan karena izin-Nya. Maka mengapa orang-orang yang mengucapkan kata-kata seperti itu, yakni orang-orang munafik, hampir-hampir tidak memahami pembicaraan dan penjelasan seperti itu sedikit pun'."
  }
]