[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dimanapun kalian berada,kematian akan menemui kalian ditempat mana saja kalian berada tatkala ajal kalian telah tiba, walaupun kalian berada di dalam benteng-benteng pertahanan yang kokoh lagi jauh dari tempat-tempat pertempuran dan peperangan. Dan apabila mereka mendapatkan hal yang menyenangkan mereka berupa datangnya kesenangan dari kehidupan dunia,mereka menisbatkannya kepada allah .Dan jika terjadi pada mereka sesuatu yang tidak mereka sukai,mereka menisbatkannya kepada Rasul Muhammad sebagai bentuk kebodohan dan anggapan sebagai sumber kesialan. Mereka tidak mengetahui, bahwa semua itu berasal dari sisi allah semata sesuai dengan ketetapan qadha dan takdirNYA.Mengapa mereka tidak mendekati pemahaman yang benar terhadap ungkapan manapun yang kamu katakana kepada mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Kapan pun dan di mana pun kalian pasti akan dijemput maut apabila ajal kalian telah tiba, walaupun kalian berada di dalam istana yang kokoh dan jauh dari medan perang. Apabila orang-orang munafik itu mendapatkan sesuatu yang menyenangkan hati mereka, seperti anak dan rezeki yang banyak, mereka berkata, “Ini dari Allah.” Dan apabila mereka ditimpa kesulitan terkait anak atau rezeki, mereka menyalahkan Nabi -ṣallallāhu 'alaihi wa sallam-, dan berkata, “Kesialan ini disebabkan oleh dirimu.” Katakanlah -wahai Rasul- untuk menjawab ucapan mereka itu, “Kesenangan dan kesusahan itu semua terjadi berdasarkan kada dan kadar Allah”. Lalu mengapa orang-orang yang mengeluarkan kata-kata tersebut nyaris tidak memahami apa yang kamu sampaikan kepada mereka?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Allah menjelaskan kepada mereka keimanan yang benar kepada qadar: “Dimanapun kalian hidup kalian akan menemui kematian, meski kalian di dalam istana yang kokoh.” Jika mereka mendapatkan keimanan, mereka mengatakan bahwa itu dari Allah; namun jika mereka tertimpa musibah, mereka mengatakan bahwa itu dari Rasulullah. Katakanlah kepada mereka semua kebaikan dan keburukan merupakan ujian dari Allah. apakah yang terjadi terhadap mereka sehingga mereka hampir-hampir tidak dapat memahami perkataan apapun?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. أَيْنَمَا تَكُونُوا۟ يُدْرِككُّمُ الْمَوْتُ (Di mana saja kamu berada, kematian akan mendapatkan kamu) Dalam ayat ini terkandung dorongan bagi orang yang tidak mau pergi berperang karena takut pada kematian, dan juga terdapat penjelasan atas buruknya sifat yang ada pada mereka berupa kepengecutan dan ketakutan, karena kematian adalah sesuatu yang pasti terjadi -siapa yang tidak mati karena tebasan pedang maka ia akan mati karena hal lain- sebab-sebab kematian sangatlah banyak namun kematian tetaplah satu (berlaku bagi semuanya). بُرُوجٍ مُّشَيَّدَةٍ ۗ (benteng yang tinggi lagi kokoh) Yakni benteng yang sangat diperhatikan kualitas bangunannya dan kekuatan pertahanannya tidak akan dapat menolak datangnya kematian jika memang telah datang waktunya. وَإِن تُصِبْهُمْ حَسَنَةٌ(dan jika mereka memperoleh kebaikan) Yakni jika orang-orang munafik mendapatkan kenikmatan maka mereka menisbatkannya kepada Allah, dan jika mereka ditimpa cobaan dan musibah maka mereka menisbatkannya kepada Rasulullah. قُلْ كُلٌّ مِّنْ عِندِ اللهِ (Katakanlah: “Semuanya (datang) dari sisi Allah”) Yakni tidak sebagaimana yang kalian klaimkan, akan tetapi segala kebaikan atau musibah semuanya dengan takdir Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "78-79 1 ). { فَمَالِ هَٰؤُلَاءِ الْقَوْمِ لَا يَكَادُونَ يَفْقَهُونَ حَدِيثًا } \"Maka mengapa orang-orang itu (orang munafik) hampir-hampir tidak memahami pembicaraan sedikitpun?\" Maka jikalau orang-orang beriman tidak mengetahuinya; niscaya mereka sama halnya dengan orang-orang kuffar dan orang munafiq yang dihinakan oleh Allah dengan ayat ini. 2 ). Allah berfirman : { وَمَا أَصَابَكَ مِنْ سَيِّئَةٍ فَمِنْ نَفْسِكَ } \"dan apa saja bencana yang menimpamu, maka dari (kesalahan) dirimu sendiri.\" fawaid yang dapat diambil dari ayat ni adalah : bahwasanya manusia tidak dapat menjamin dalam dirinya selalu ada ketenangan, karena keburukan yang ia hadapi tidak lain adalah datangnya dari diri sendiri, dan tidak pula ia sibuk dengan cacian dan hinaan dari segenap manusia disekitarnya lalu mengiraukannya, hendaklah ia kembali kepada kesalahan kemudian ia bertaubat darinya, dan memohon perlindungan kepada Allah dari keburukan dirinya dan kehinaan perbuatannya, ia mesti memohon kepada Allah agar Ia melimpahkan kepadanya pertolongan dalam ketaatan kepada-Nya, maka denga itu semua ia akan meraih segala kebaikan dan menjauhkannya dari keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Kalian pasti akan mati, dan kematian itu akan menghampiri kalian dimanapun kalian berada, sekalipun di dalam benteng yang sangat kokoh. Jika orang-orang munafik itu mendapatkan kenikmatan berupa keuntungan atau harta rampasan, maka mereka akan menghubungkan nikmat itu kepada Allah SWT ketika Dia memberitahu kebaikan itu kepada mereka. Namun ketika mereka ditimpa kesusahan berupa kekeringan dan penyakit, maka mereka akan menghubungkan hal itu kepada Rasulullah SAW bahwa hal itu diterima karena beliau. Lalu Allah menampik hal itu dengan berfirman: “Katakanlah kepada mereka wahai Nabi: “Setiap kebaikan dan keburukan itu dari sisi Allah, bukan seperti yang kalian anggapkan,” Namun kaum itu hampir tidak memahami firman tersebut dan tidak menyadari bahwa setiap sesuatu itu terjadi dengan adanya keputusan dan kuasa Allah. Ibnu Abbas berkata: “Ketika beberapa orang muslim mati syahid pada hari ahad, orang-orang munafik yang tidak ikut berjihad: “Jika saja saudara-saudara kita yang mati itu bersama kami, niscaya mereka tidak akan terbunuh” Lalu Allah SWT menurunkan ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di mana pun} dimana pun {kalian berada, kematian akan mendatangi kalian} menangkap kalian {meskipun kalian berada dalam benteng yang kokoh} istana yang bisa mencegah apapun {Jika mereka memperoleh suatu kebaikan} kenikmatan berupa kesuburan dan kesejahteraan {mereka berkata, “Ini dari sisi Allah” dan jika mereka ditimpa suatu keburukan} cobaan berupa kekeringan dan kesulitan {mereka berkata, “Ini darimu} dari nasib buruk nabi Muhammad dan para sahabatnya {”Katakanlah, “Semuanya} kebaikan dan keburukan, semuanya {dari sisi Allah.” Mengapa orang-orang itu hampir tidak memahami} memahami {pembicaraan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Kemudian Allah mengabarkan bahwa tidaklah akan bermanfaat suatu kewaspadaan terhadap takdir Allah, dan bahwa seorang yang duduk berdiam diri (tidak ikut berperang) tidaklah duduknya itu menolongnya dari apa pun juga, dan Allah berfirman “Di mana saja kamu berada, kematian akan mendapatkan kamu” maksudnya, pada waktu apa pun dan tempat manapun, “kendati pun kamu di dalam benteng yang tinggi lagi kokoh” yaitu benteng-benteng yang kuat dan rumah-rumah yang tinggi. Semua ini merupakan dorongan untuk berjihad di jalan Allah, terkadang dengan cara bujukan tentang keutamaan dan pahalanya, terkadang pula dengan menakut-nakuti akan hukuman karena meninggalkannya, terkadang juga dengan mengabarkan bahwa orang-orang yang duduk-duduk saja (tidak ikut berperang) tidaklah duduk mereka itu berguna bagi mereka, dan terkadang lagi dengan memudahkan jalan kepadanya. Allah mengabarkan tentang orang-orang yang tidak mengetahui, yang berpaling dari apa yang dibawa oleh para Rasul dan menentang mereka, bahwa bila orang-orang itu memperoleh suatu kebaikan, yaitu tanah yang subur, harta yang melimpah, anak-anak yang banyak dan kesehatan, mereka berkata, “Ini adalah dari sisi Allah” dan bahwasanya bila mereka tertimpa suatu musibah, yaitu tanah yang tandus, kefakiran, penyakit, meninggalnya anak-anak mereka atau orang-orang yang mereka cintai, mereka berkata, “Ini (datangnya) dari sisi kamu (Muhammad).” Maksudnya, oleh sebab apa yang telah engkau bawa kepada kami wahai Muhammad! Mereka mengaitakan musibah itu dengan Rasulullah sebagaimana orang-orang yang seperti mereka mengait-ngaitkan suatu musibah zaman dahulu dengan Rasul-rasul Allah, sebagaimana Allah mengabarkan kaumnya firaun bahwasanya mereka \"Kemudian apabila datang kepada mereka kemakmuran, mereka berkata: “Itu adalah karena (usaha) kami”. Dan jika mereka ditimpa kesusahan, mereka lemparkan sebab kesialan itu kepada Musa dan orang-orang yang besertanya. Ketahuilah, sesungguhnya kesialan mereka itu adalah ketetapan dari Allah, akan tetapi kebanyakan mereka tidak mengetahui.\" , (Al-A’raf:131) Dan kaum Shaleh juga berkata, \"Mereka menjawab: “Kami mendapat nasib yang malang, disebabkan kamu dan orang-orang yang besertamu”. (An-Naml:47) Dan kaum (yang disebutkan dalam surat) Yasin berkata kepada Rasul-rasul mereka, \"Sesungguhnya kami bernasib malang karena kamu, sesungguhnya jika kamu tidak berhenti (menyeru kami), niscaya kami akan merajam kamu dan kamu pasti akan mendapat siksa yang pedih dari kami\" (Yasin:18) Ketika hati mereka memiliki keserupaan dalam hal kekufuran, lalu perkataan dan perbuatan mereka pun menjadi serupa, dan setiap orang yang menisbatkan terjadinya suatu keburukan atau hilangnya kebaikan terhadap apa yang dibawa oleh para Rasul atau terhadap sebagiannya, maka ia termasuk dalam celaan yang hina tersebut, Allah berfirman dalam menjawab (perkara) mereka, “Katakanlah, ‘Semuanya’ “ yaitu berupa kebaikan dan keburukan, keberuntungan dan kesialan, “(datang) dari sisi Allah,” maksudnya, dengan ketetapan dan ketentuanNYa serta penciptaNya, “maka mengapa orang-orang itu (orang munafik),” yaitu apa yang bersumber dari mereka berupa perkataan yang batil, “hampir-hampir tidak memahami pembicaraan sedikit pun?” yaitu mereka tidak memahami pembicaraan secara menyeluruh dan tidak juga mendekati pemahamannya atau mereka tidaklah memahaminya kecuali dengan pemahaman yang sangat lemah. Namun yang jelas bahwa hal itu adalah sebuah celaan bagi mereka dan kecaman atas ketidakpahaman mereka dan ketidakmengertian mereka tentang Allah dan RasulNya, yang demikian itu adalah karena kekufuran dan berpalingnya mereka. Dan termasuk dalam kandungannya adalah pujian terhadap orang yang memahami tentang Allah dan tentang RasulNya, dan anjuran terhadap hal tersebut berupa penerimaan perkataan keduanya, merenunginya dan menempuh jalan yang menyampaikan kepadanya. Sekiranya mereka memahami tentang Allah, niscaya mereka akan mengetahui bahwa kebaikan dan keburukan, keberuntungan dan kesialan semuanya adalah dengan ketentuan Allah dan ketetapanNYa, apa pun tidak akan keluar dari hal tersebut, dan bahwa para Rasul bukanlah sebagai sebab akan suatu keburukan yang terjadi, bukan mereka dan bukan juga apa yang mereka bawa, karena mereka diutus demi kemaslahatan dunia dan akhirat serta agama."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {بُرُوجٍ مُشَيَّدَةٍ} buruujin musyayyadah: benteng yang dibangun dengan batu. Makna ayat : Adapun ayat yang ke dua (78), Allah telah berfirman kepada mereka dan kepada selainnya yang takut akan peperangan dan berkecut hati untuk keluar berjihad {أَيْنَمَا تَكُونُوا يُدْرِكْكُمُ الْمَوْتُ} “dimanapun kalian, kematian akan mendatangi kalian” karena kematian akan meminta kalian dan menemukan kalian dengan pasti seperti firman Allah {قُلْ إِنَّ الْمَوْتَ الَّذِي تَفِرُّونَ مِنْهُ فَإِنَّهُ مُلاقِيكُمْ} “Katakanlah, ‘Sesungguhnya kematian yang mana kalian lari darinya niscaya akan menemui kalian walaupun kalian itu memasuki benteng-benteng yang bermenara dan tidak ada jendela. Sesungguhnya kematian akan masuk ke dalam benteng-benteng itu dan akan mengambil nyawa kalia. Setelah Allah menyebutkan sifat pengecut mereka dan ketakutan mereka, Allah menyebutkan salah paham mereka dan rusaknya perasaan mereka {وَإِنْ تُصِبْهُمْ حَسَنَةٌ يَقُولُوا هَذِهِ مِنْ عِنْدِ اللهِ وَإِنْ تُصِبْهُمْ سَيِّئَةٌ يَقُولُوا هَذِهِ مِنْ عِنْدِكَ} “jikalau kebaikan berpihak kepada mereka, mereka berkata ‘ini adalah dari Allah’. Jikalau keburukan menimpa mereka, mereka berkata, ‘ini karena kamu’.” yaitu jikalau mereka mendapatkan kebaikan berupa harta rampasan perang yang berlimpah dan kemakmuran, mereka berkata {هَذِهِ مِنْ عِنْدِ اللهِ} “ini dari Allah” bukan bentuk syukur kepada Allah tetapi mereka hanya tidak ingin menganggap Rasulullah telah mempunyai andil di segala bentuk kebaikan dari keberkahan bersamanya dan baiknya kepemimpinannya. Dan jika keburukan menimpa mereka, kemiskinan, penyakit ataupun kekalahan, mereka berkata {هَذِهِ مِنْ عِنْدِكَ} “ini darimu”, maksudnya: kamu penyebabnya. Allah berfirman kepada Rasul-Nya {كُلٌّ مِنْ عِنْدِ اللهِ} “semua dari sisi Allah” kebaikan maupun keburukan, Dia lah yang menciptakan dan yang menetapkan keteraturan dengan adanya itu serta terjadinya hal. Kemudian akibatnya dari mental mereka yang rusak, maka Allah berfirman {فَمَالِ هَؤُلاءِ الْقَوْمِ لا يَكَادُونَ يَفْقَهُونَ حَدِيثاً} “Ada apa gerangan dengan mereka yang hampir-hampir tidak paham dengan apa yang terjadi.” ini adalah apa yang ditunjukkan oleh ayat yang kedua."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 78: 77-79. Orang-orang yang (pernah) dikata kepada mereka: \"Tahanlah tangan- tangan kamu dan dirikanlah shalat dan berilah zakat', tetapi tatkala diwajibkan mereka berperang, dari mereka, takut kepada manusia sebagaimana takut kepada Allah, atau lebih sangat takut, dan mereka Tidakkah engkau fikirkan tiba-tiba segolongan berkata: \"Hai Tuhan kami! Mengapakah Engkau wajibkan kami berperang? Mengapakah tidak Engkau biarkan kami hingga ajal (kami) yang hampir?\" Katakanlah: \"Benda dunia ini sedikit, dan Akhirat itu lebih baik buat orang yang berbakti; dan kamu tidak akan dianiaya (walaupun) sedikit\". Di mana saja kamu berada, kematian akan mendapati kamu. walaupun kamu di mahligai-mahligai yang teguh\", dan jika ke baikan mengenai mereka, mereka berkata: \"Ini dari sisi Allah\", dan jika kesusahan mengenai mereka, me- \"Ini dari sisimu\". mereka berkata: Katakanlah: \"Semua itu dari sisi Allah\". Mengapakah kaum itu hampir tidak mengerti perkataan? Apa-apa keuntungan yang mengenaimu, maka (yaitu) dari Allah; dan apa-apa kerugian yang mengenaimu, maka (yaitu) dari di- rimu, karena Kami utusmu kepa- da manusia sebagai seorang rasul; dan cukuplah Allah sebagai Saksi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di ayat ini Allah Subhaanahu wa Ta'aala menerangkan bawa sikap hati-hati tidaklah dapat melawan qadar, dan orang yang duduk tidak berperang, tidaklah dapat menolak taqdir. Semua ini merupakan dorongan untuk berjihad fii sabilillah. Sesekali berupa targhib (dorongan) dengan menyebutkan keutamaan dan pahalanya, sesekali berupa tarhib (ancaman) yang berupa hukuman bagi yang meninggalkannya dan sesekali berupa pemberitahuan bahwa duduk di tempat (tidak berjihad) tidaklah berguna baginya. Yakni orang-orang yang berpaling dari apa yang dibawa rasul lagi menentangnya, seperti halnya orang-orang Yahudi. Seperti tumbuh suburnya tanaman dan tumbuhan, melimpah ruahnya harta, banyak anak dengan kondisi sehat. Seperti kekeringan, kemiskinan, sakit, meninggalnya anak-anak dan orang yang dicintainya serta musibah lainnya. Ucapan seperti ini sama seperti ucapan yang dilontarkan Fir'aun kepada Nabi Musa 'alaihis salam, \"Kemudian apabila datang kepada mereka kemakmuran, mereka berkata: \"Itu adalah karena (usaha) kami\". dan jika mereka ditimpa kesusahan, mereka lemparkan sebab kesialan itu kepada Musa dan orang-orang yang besertanya. Ketahuilah, Sesungguhnya kesialan mereka itu adalah ketetapan dari Allah, akan tetapi kebanyakan mereka tidak mengetahui.\" (Terj. Al A'raaf: 131), demikian juga seperti ucapan kaum Tsamud kepada Nabi Shalih 'alaihis salam, \"Mereka menjawab: \"Kami mendapat nasib yang malang, disebabkan kamu dan orang-orang yang besertamu\". Shaleh berkata: \"Nasibmu ada pada sisi Allah, (bukan kami yang menjadi sebab), tetapi kamu kaum yang diuji\" (Terj. An Naml: 47) Karena hati mereka sama-sama dalam kekafiran, maka ucapan dan amalan mereka juga sama. Termasuk ke dalam hal ini pula orang-orang yang menisbatkan terjadinya musibah atau hilangnya kebaikan kepada syari'at yang dibawa rasul atau sebagiannya, maka ia tergolong mereka; tergolong orang yang mendapat celaan ini. Pelajaran dan nasehat-nasehat yang disampaikan. Dalam ayat ini terdapat pujian bagi orang yang memahami apa yang datang dari Allah dan rasul-Nya (mendalami fiqh), dorongan untuk memahaminya dan dorongan untuk melakukan sesuatu yang dapat membantu ke arahnya seperti memperhatikan firman-Nya, mentadabburinya dan menempuh semua jalan yang bisa mengarah kepadanya. Jika mereka memahami apa yang datang dari Allah, tentu mereka mengetahui bahwa kebaikan dan keburukan semuanya dengan qadha' Allah dan qadar-Nya; tidak keluar daripadanya. Demikian juga bahwa para rasul 'alaihimus shalaatu was salam bukanlah sebab terhadap keburukan yang ada, baik mereka maupun apa yang mereka bawa, karena mereka tidaklah diutus kecuali untuk memperbaiki dunia dan agama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 78",
    "description": "Di mana pun kamu berada, wahai orang-orang yang enggan berperang di jalan Allah, kematian itu pasti akan mendapatkan kamu, kendatipun kamu berada pada persembunyian di dalam benteng yang tinggi dan kukuh yang tidak terdapat celah sedikit pun untuk menembusnya. Jika mereka, orang-orang yang enggan itu, memperoleh kebaikan, yakni sesuatu yang menyenangkan dan menggembirakan, mereka mengatakan, ini dari sisi Allah, dan jika mereka ditimpa suatu keburukan atau kondisi yang tidak menyenangkan, mereka akan mengatakan, ini dari engkau, yakni disebabkan olehmu, wahai Muhammad. Katakanlah, semuanya datang dari sisi Allah dan karena izin-Nya. Maka mengapa orang-orang yang mengucapkan kata-kata seperti itu, yakni orang-orang munafik, hampir-hampir tidak memahami pembicaraan dan penjelasan seperti itu sedikit pun' kebajikan apa pun yang kamu peroleh, wahai nabi Muhammad dan semua umat manusia, adalah dari sisi Allah yang maha pemurah, maha bijaksana, dan keburukan apa pun yang menimpamu, wahai Muhammad dan siapa pun selainmu, itu semua akibat dari kesalahan dirimu sendiri, karena kami mengutusmu tidak lain hanya menjadi rasul untuk menyampaikan wahyu Allah kepada seluruh manusia. Dan cukuplah Allah saja yang menjadi saksi atas kebenaranmu."
  }
]