[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila pembagian warisan di hadiri oleh karib kerabat mayit yang tidak mempunyai hak waris atau didatangi oleh anak-anak yang telah ditinggal mati oleh ayah-ayah mereka,sedang mereka masih kecil-kecil, atau orang-orang yang tidak memiliki harta untuk mencukupi mereka atau menutupi kebutuhan mereka, maka berikanlah kepada mereka sekedarnya dari harta warisan itu sebagi bentuk anjuran semata sebelum pembagian warisan kepada orang-orang yang berhak menerimanya. Dan katakanlah kepada mereka ucapan yang baik-baik, bukan ucapan yang kasar dan juga ucapan jelek."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Apabila pembagian harta warisan itu dihadiri oleh orang-orang yang tidak mempunyai hak waris dari kalangan kerabat, anak-anak yatim maupun orang-orang miskin, maka berikanlah kepada mereka -sebatas anjuran- sebagian dari harta warisan tersebut menurut kerelaan hati kalian sebelum harta warisan itu dibagi-bagi. Karena mereka sangat berharap untuk mendapatkannya, sedangkan kalian mendapatkannya tanpa bersusah payah. Dan ucapkanlah kata-kata yang baik kepada mereka, tanpa menyisipkan kata-kata yang buruk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan jika para kerabat mayit, orang-orang fakir miskin, dan anak-anak yatim yang bukan termasuk ahli waris menghadiri pembagian harta warisan, maka hendaklah kalian memberi mereka bagian dari warisan tersebut, dan berkatalah kepada mereka dengan perkataan yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَإِذَا حَضَرَ الْقِسْمَةَ أُو۟لُوا۟ الْقُرْبَىٰ (Dan apabila sewaktu pembagian itu hadir kerabat) Yakni yang bukan termasuk ahli waris. وَالْيَتٰمَىٰ وَالْمَسٰكِينُ فَارْزُقُوهُم مِّنْهُ(anak yatim dan orang miskin, maka berilah mereka dari harta itu (sekedarnya)) Yakni dengan kadar yang dapat direlakan oleh para ahli waris. قَوْلًا مَّعْرُوفًا (perkataan yang baik) Yakni perkataan baik dengan tidak menyebut-nyebut pemberiannya dan menyakiti perasaan si penerima."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan apabila saat pembagian harta warisan itu datang kerabat yang tidak berhak menerima warisan, anak-anak yatim, dan orang-orang miskin, maka berilah mereka sekedarnya dari harta warisan yang ditinggalkan mayit sebelum dibagi wahai orang-orang yang dewasa. Dan jika ada anak-anak kecil maka berilah mereka bagian kalian saja. Dan berkatalah kepada mereka dengan perkataan yang indah yang tidak mengandung hal yang menyakiti, seperti mendoakan agar diberi rejeki. Bagi kerabat, harta itu dimaafkan kerena masih kecil misalnya. Adapun bagi orang-orang yang membutuhkan itu karena untuk memuliakan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila telah hadir pada pembagian itu} pembagian warisan {beberapa kerabat, anak-anak yatim, dan orang-orang miskin, berilah mereka sebagian dari harta itu} maka berilah mereka sedikit dari harta itu untuk menyenangkan hati mereka {dan ucapkanlah kepada mereka perkataan yang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Ini adalah diantara ketentuan-ketentuan Allah yang baik lagi luhur dan menghibur hati, dimana Dia berfirman “dan apabila sewaktu pembagian itu hadir,” yaitu, pembagian harta warisan ‘kerabat” yaitu, sanak family yang tidak termasuk ahli waris, dengan landasan firman Allah, ”sewaktu pembagian” karena para ahli waris adalah orang-orang yang mendapat bagian, ”anak yatim dan orang miskin” yaitu, orang-orang yang berhak (menerima sedekah) dari orang-orang fakir, ”maka berilah mereka dari harta itu (sekedarnya)” maksudnya, berikanlah mereka ala kadarnya dari harta tersebut yang kalian dapatkan tanpa usaha, tanpa lelah, tanpa susah, dan tanpa perjuangan, karena sesungguhnya jiwa mereka menatap kepadanya dan hati mereka memandangnya. karena itu, hiburlah hati mereka dengan sesuatu yang tidak memudharatkan kalian dan bermanfaat bagi mereka. Dengan demikian dapat diambil suatu hal dari makna tersebut, bahwa setiap orang yang memandang dan menyaksikan apa yang ada di tangan manusia, seyogyanya diberikan kepadanya sekedarnya dari hal tersebut, sebagaimana nabi bersabda, ”Apabila datang kepada salah seorang diantara kalian pembantunya membawa makanannya, maka persilahkanlah ia turut duduk bersamanya, namun bila ia tidak mempersilahkannya ikut duduk bersamanya, maka berikanlah kepadanya satu atau dua suap.” atau seperti yang beliau sabdakan. “Dan dahulu para sahabat apabila telah tampak pohon mereka mulai berbuah, mereka menghadirkannya kepada Rasulullah lalu beliau mendoakan agar mendapat berkah lalu beliau melihat kepada anak-anak yang paling kecil di hadapannya dan memberikan buah tersebut kepadanya.” Hal itu karena beliau sangat mengetahui kalau anak kecil itu sangat menginginkan buah tersebut. Kondisi ini adalah bila keadaannya memungkinkan untuk diberikan, namun bila hal tersebut tidak mungkin diberikan, karena merupakan hak-hak dari orang yang tidak mampu membelanjakan hartanya dengan baik atau suatu hal yang lebih penting dari itu, maka harus dikatakan kepada mereka ”perkataan yang baik” menolak mereka dengan penolakan yag baik, perkataan yang lemah lembut tanpa kata yang keji dan kotor."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {ﺃﻭﻟﻮ اﻟﻘﺮﺑﻰ} Uluqurba: Para kerabat yang tidak termasuk dalam jajaran pewaris disebabkan karena jauhnya mereka garis nasab. {ﻓﺎﺭﺯﻗﻮﻫﻢ ﻣﻨﻪ} Farzuquhum minhu: Berilah sesuatu sebagai rezeki mereka. {ﻗﻮﻻ ﻣﻌﺮﻭﻓﺎ} Qaulan ma’rufa: Perkataan baik tiada melecehkan, menghinakan ataupun kasar. Makna kata : Adapun ayat ini mencakup keutamaan yang banyak dilalaikan oleh kaum mukminin. Yaitu di antara bentuk bakti, menyambung silaturahim dan perbuatan makruf, yaitu ketika seseorang meninggal dan mulai dibagi peninggalannya di hadapan para pewaris kemudian hadir kerabat yang tidak termasuk ahli waris karena terhalang (bagian warisannya) atau karena jauh garis nasabnya begitu pula halnya saat hadir orang fakir atau yatim -termasuk perbuatan yang makruf- adalah memberikan mereka sesuatu dari peninggalan si pewaris sebelum dibagikan dan meminta uzur jika mereka tidak mendapat bagian. Para yatim mendapatkan bagian selain harta bagian warisannya sebelum dibagikan karena para ahli waris anak-anak yatim dan anak-anak dianggap belum layak dan harta mereka berpindah -sementara- kepada yang mengasuh mereka dari kerabat. Anak yatim dan orang miskin disampaikan kepada mereka bahwasanya mereka tidak mendapatkan warisan dengan bahasa halus yang dapat diterima mereka. Ini adalah yang tercakup dalam ayat {ﻭﺇﺫا ﺣﻀﺮ5 اﻟﻘﺴﻤﺔ ﺃﻭﻟﻮ اﻟﻘﺮﺑﻰ ﻭاﻟﻴﺘﺎﻣﻰ ﻭاﻟﻤﺴﺎﻛﻴﻦ ﻓﺎﺭﺯﻗﻮﻫﻢ ﻣﻨﻪ} diberikan dari harta peninggalan sang mayit kepada anak yatim, orang miskin {ﻭﻗﻮﻟﻮا ﻟﻬﻢ ﻗﻮﻻ ﻣﻌﺮﻭﻓﺎ} dan berkata kepada mereka dengan perkataan yang baik. Pelajaran dari ayat : • Disunahkan memberikan sedekah kepada orang yang hadir dari kalangan kerabat, orang miskin ataupun yatim saat pembagian harta peninggalan. Jikalau tidak dapat memberikan sedekah kepada mereka, maka katakan dengan perkataan yang baik. Dalam hadis disebutkan, “Kalimat yang baik adalah sedekah.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 8: Dan apabila keluarga yang hampir dan anak-anak yatim dan orang-orang yang waktu pembahagian (harta), maka hendaklah kamu beri kepada mereka dari (harta) peninggalan itu dan katakanlah kepada mereka perkataan yang baik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan salah satu di antara sekian hukum yang bijaksana dan menenangkan hati. Dari ayat ini dapat kita ambil kesimpulan, bahwa siapa saja yang dalam hatinya menginginkan sesuatu yang ada di tangan kita hendaknya kita memberikan sesuatu daripadanya sekedarnya, sebagaimana disabdakan Nabi shallallahu 'alaihi wa sallam: إِذَا أَتَى أَحَدَكُمْ خَادِمُهُ بِطَعَامِهِ قَدْ كَفَاهُ عِلَاجُهُ وَ دُخَانُهُ فَلْيُجْلِسْهُ مَعَهُ فَإِنْ لَمْ يُجْلِسْهُ مَعَهُ فَلْيُنَاوِلْهُ أُكْلَةً أَوْ أُكْلَتَيْنِ \"Apabila salah seorang di antara kamu didatangi pelayannya dengan membawa makanan, sedangkan pelayannya sudah menyelesaikan tugasnya di dapur, maka ikutkanlah dia duduk bersamanya. Jika tidak diikutkan bersamanya, maka berikanlah sesuap atau dua suap makanan.\" (HR. Bukhari, Muslim, Abu Dawud, Tirmidzi dan Ibnu Majah, Shahihul Jami' no. 264). Kerabat di sini maksudnya kerabat yang tidak mempunyai hak warisan dari harta peninggalan. Pemberian sekedarnya itu tidak boleh melebihi sepertiga harta warisan, dan pemberian ini dilakukan sebelum dibagikan. Pemberian ini hukumnya sunat, sedangkan menurut Ibnu Abbas pemberian ini hukumnya wajib. Yakni jika ternyata tidak mungkin karena hal-hal tertentu, maka berbicaralah dengan mereka dengan kata-kata yang lembut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 8",
    "description": "Setelah menjelaskan ketentuan hak warisan bagi kaum perempuan, maka pada ayat ini Allah memberi peringatan agar memperhatikan pula kerabat lain yang tidak memeroleh harta warisan dan kebetulan hadir ketika harta warisan itu dibagikan. Dan apabila sewaktu pembagian harta warisan itu hadir atau diketahui oleh beberapa kerabat yang tidak mendapatkan harta warisan, baik mereka yang hadir adalah anak-anak yatim dan orang-orang miskin yang masih ada hubungan kerabat atau tidak, maka hendaknya berilah mereka dari harta warisan itu sekadarnya yang dapat menghibur hati mereka, dan ucapkanlah kepada mereka perkataan yang baik dan benar serta perlakukanlah mereka dengan bijaksana. Setelah menjelaskan anjuran berbagi sebagian dari harta warisan yang didapat kepada kerabat yang tidak mendapatkan bagian, ayat ini memberi anjuran untuk memperhatikan nasib anak-anak mereka apabila menjadi yatim. Dan hendaklah takut kepada Allah orang-orang yang sekiranya mereka meninggalkan keturunan di kemudian hari anakanak yang lemah dalam keadaan yatim yang belum mampu mandiri di belakang mereka yang mereka khawatir terhadap kesejahteraan-Nya lantaran mereka tidak terurus, lemah, dan hidup dalam kemiskinan. Oleh sebab itu, hendaklah mereka para wali bertakwa kepada Allah dengan mengindahkan perintah-Nya dan menjauhi larangan-Nya, dan hendaklah mereka berbicara dengan tutur kata yang benar, penuh perhatian dan kasih sayang terhadap anak-anak yatim dalam asuhannya."
  }
]