[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa menyambut seruan rasul sholallohu alaihi wasallam dan mengerjakan petunjuknya,maka sesunguhnya ia telah menyambut seruan allah dan melaksanakan perintahNYA.Dan barangsiapa yang berpaling dari ketaatan kepada allah dan kepada rasulNYA,maka tidaklah kami mengutusmu (wahai rasul), kepada orang-orang yang berpaling itu sebagai pengawas yang memelihara perbuatan-perbuatan mereka dan memperhitungkannya; sebab perhitungan perbuatan mereka merupakan tanggung jawab kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Barangsiapa yang taat kepada rasul dengan menjalankan perintahnya dan menjauhi larangannya, berarti ia telah taat kepada Allah. Dan barangsiapa yang menolak taat kepadamu -wahai Rasul- janganlah kamu sedih karenanya. Karena Kami mengutusmu semata-mata untuk mengawasinya dan menjaga amal perbuatannya. Dan Kami-lah yang akan menghitung serta menghisab amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Kemudian Allah berfirman kepada nabi Muhammad untuk menenangkan hatinya meringankan bebannya dan kaumnya yang selalu menyelisihinya. Firman ini sebagai bukti bahwa beliau maksum dalam setiap tindak tanduknya: Barang siapa mentaati Rasulullah karena keyakinannya bahwa beliau adalah Rasulullah yang diutus untuk menyampaikan hukum-hukum Allah kepada para makhluk, maka ia sesungguhnya telah mentaati Allah, dan ini tidak akan terjadi kecuali dengan taufik dari-Nya. Dan jika ada yang berpaling darinya maka sesungguhnya kami tidak mengutus nya untuk menjaga amalan dan tingkah laku mereka, Namun kami mengutusnya sebagai orang yang menyampaikan dan menjelaskan risalah serta pemberi nasehat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. مَّن يُطِعِ الرَّسُولَ فَقَدْ أَطَاعَ اللهَ ۖ (Barangsiapa yang mentaati Rasul itu, sesungguhnya ia telah mentaati Allah) Ayat ini menjelaskan bahwa ketaatan kepada Rasulullah merupakan ketaatan kepada Allah karena Rasulullah tidak memerintahkan kecuali apa dengan apa yang diperintahkan Allah, dan tidak melarang sesuatu kecuali terhadap apa yang dilarang oleh Allah, karena ketaatan kepada orang yang diutus merupakan ketaatan kepada yang telah mengutusnya. وَمَن تَوَلَّىٰ( Dan barangsiapa yang berpaling) Yakni yang berpaling dari ketaatan kepadamu (Muhammad) maka sebenarnya ia telah bermaksiat kepada Allah. فَمَآ أَرْسَلْنٰكَ عَلَيْهِمْ حَفِيظًا(maka Kami tidak mengutusmu untuk menjadi pemelihara bagi mereka) Yakni pemelihara amalan mereka, akan tetapi kewajibanmu hanyalah menyampaikan dan bukan untuk menjadikan hati mereka benar-benar beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Barangsiapa menaati rasulallah, maka sungguh dia telah menaati Allah karena dia adalah utusanNya. Dan barangsiapa tidak mau menaatinya dan mengingkarinya, maka sungguh dia telah mengingkari Allah. Dan kamu bukanlah pengawas amal mereka dan penjaga bagi mereka wahai rasul, yang mana kamu bisa memaksa mereka untuk berbuat baik dan beriman serta menghisab mereka, melainkan hanya seorang penyampai risalah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa yang menaati Rasul, maka sungguh telah menaati Allah. Siapa yang berpaling} berpaling dari menaatimu {maka Kami tidak mengutusmu sebagai pemelihara mereka} memelihara dan mengawasi tindakan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Maksudnya, setiap orang yang menaati Rasulullah dalam perintah-perintah dan larangan-larangannya, “Sesungguhnya ia telah menaati Allah,” karena tidaklah beliau memerintahkan dan tidaklah melarang kecuali dengan perintah Allah, syariat, wahyu dan segala apa yang diturunkanNya, hal ini menunjukkan kema’shuman Rasulullah, karena Allah memerintahkan untuk menaatinya secara mutlak, sekiranya bila beliau tidak ma’shum dalam segala hal yang disampaikannya dari Allah, nisscaya tidaklah Allah akan memerintahkan untuk menaatinya secara mutlak lalu Dia memuji hal tersebut, dan ini adalah di antara hak-hak yang dimiliki bersama, karena sesungguhnya hak-hak itu ada tiga macam: pertama, hak milik Allah yang tidak dimiliki seorang pun dari makhluk, yaitu beribadah kepada Allah, memohon kepadaNya dan segala hal yang menyertainya. Kedua, hak yang khusus milik Rasul yaitu penghormatan, pemuliaan dan pembelaan, dan ketiga, hak-hak yang dimiliki bersama yaitu iman kepada Allah dan RasulNya, mencintai dan menaati keduanya sebagaimana Allah menyatukan antara hak-hak tersebut dalam FirmanNya, \"supaya kamu sekalian beriman kepada Allah dan Rasul-Nya, menguatkan (agama)Nya, membesarkan-Nya. Dan bertasbih kepada-Nya di waktu pagi dan petang.\" (Al-Fath:9) Maka barangsiapa yang taat kepada Rasul, sesungguhnya ia telah taat kepada Allah, dan ia berhak mendapatkan pahala dan kebaikan yang disediakan karena ketaatan kepada Allah, “dan barangsiapa yang berpaling” dari ketaatan kepada Allah dan RasulNya, sesungguhnya hal itu tidaklah membahayakan kecuali bagi dirinya sendiri, dan tidak aka nada yang mampu membahayakan Allah sama sekali, “maka Kami tidak mengutusmu untuk menjadi pemelihara bagi mereka,” maksudnya (kamu tidaklah diutus untuk) memelihara perbuatan-perbuatan dan kondisi-kondisi mereka, akan tetapi Kami mengutusmu sebagai penyeru, pemberi penjelasan dan pemberi nasihat, dan sungguh engkau telah menunaikan tugasmu, maka wajiblah ganjarannya untukmu dari Allah, baik mereka mendapat petunjuk karenanya ataupun tidak mendapatkannya, sebagaimana Allah berfirman, \"Maka berilah peringatan, karena sesungguhnya kamu hanyalah orang yang memberi peringatan. Kamu bukanlah orang yang berkuasa atas mereka,\" (Al-Ghasyiyah:21-22)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 80: Barang siapa ta'at kepada Rasul itu, maka sesungguhnya (ber- arti) ia ta'at kepada Allah; tetapi barang siapa berpaling belakang, maka Kami tidak utusmu buat jadi pengawal atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketaatan tersebut harus dilakukan oleh zhahir maupun batin, di hadapan manusia maupun ketika sembunyi. Adapun orang yang menampakkan ketaatan di hadapan manusia, namun ketika sendiri atau bersama kawan-kawan yang sepertinya, ia tidak taat dan mengerjakan hal yang sebaliknya, maka sesungguhnya ketaatan yang ditampakkan itu tidaklah bermanfaat dan tidaklah berfaedah, mereka ini sama seperti orang-orang yang disebutkan dalam ayat 81 selanjutnya. Hal itu, karena Beliau tidaklah memerintah dan melarang kecuali dengan perintah Allah dan wahyu-Nya. Dalam ayat ini terdapat dalil kema'shuman Beliau (terjaganya dari kesalahan), karena Allah memerintahkan kita menaati Beliau secara mutlak. Jika Beliau tidak ma'shum dalam semua yang disampaikan dari Allah, tentu kita tidak diperintahkan menaatinya secara mutlak. Kamu (Muhammad shallallahu 'alaihi wa sallam) tidak bertanggung jawab terhadap perbuatan mereka dan tidak menjamin agar mereka tidak berbuat kesalahan. Kamu hanyalah pemberi peringatan dan kepada Allah-lah urusan mereka. Oleh karena itu, janganlah kamu dibuat risau, baik mereka mendapatkan petunjuk atau pun tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 80",
    "description": "Barang siapa menaati rasul dan mengikuti ajaran-ajarannya, maka sesungguhnya dia telah menaati Allah karena Allah yang telah mengutusnya. Dan barangsiapa berpaling dari ketaatan itu, maka ketahuilah bahwa kami tidak mengutusmu, wahai nabi Muhammad, untuk menjadi pemelihara mereka sebagai orang yang bertanggung jawab dan menjamin mereka untuk tidak berbuat kesalahan dan mereka, orang-orang munafik, mengatakan, kewajiban kami hanyalah sepenuhnya untuk selalu taat kepadamu, Muhammad. Tetapi, apabila mereka telah pergi dari sisimu, nabi Muhammad tidak lagi berada bersamamu, sebagian dari mereka, yakni para pemimpin mereka mengatur siasat di malam hari mengambil keputusan untuk sesuatu yang lain dari yang telah mereka katakan tadi. Allah melalui penugasan para malaikat-Nya mencatat setiap rencana dan siasat yang mereka atur di malam hari itu. Oleh sebab itu, maka berpalinglah dari mereka, jangan hiraukan sedikit pun, dan bertawakAllah kepada Allah. Cukuplah Allah yang mahaperkasa yang menjadi pelindung dari tipu daya mereka."
  }
]