[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah memperlihatkan orang-orang yang berpaling,(dan mereka berada di majelis Rasulullah ) ketaatan kepada rasulullah dan risalah yang dibawanya. Maka apabila mereka telah jauh dari sisi beliau dan pergi dari majelis beliau,segolongan dari mereka mengatur makar jahat pada malam hari yang berbeda jauh dari ketaatan yang mereka suarakan (dihadapan rasulullah ). Mereka tidak sadar bahwa sesungguhnya allah memperhitungkan rencana jahat yang telah mereka atur,dan akan memberikan balasan kepada mereka akibat perbuatan itu dengan balasan yang sempurna. Maka berpalainglah kamu (wahai rasul),dari mereka dan jangan pedulikan mereka;karena sesungguhnya mereka tidak dapat memadaratkanmu, dan bertawakkalah kamu kepada allah. Dan cukuplah allah bagimu sebagai pelindung dan penolong."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Orang-orang munafik akan berkata kepadamu dengan lidah mereka, “Kami akan mematuhi dan menjalankan perintahmu.” Kemudian setelah mereka pergi dari hadapanmu, sebagian dari mereka secara sembunyi-sembunyi merencanakan sesuatu yang berbeda dengan apa yang mereka sampaikan kepadamu. Tetapi Allah Maha Mengetahui apa yang mereka rencanakan. Dan Dia akan membalas tipu daya mereka itu. Maka abaikanlah mereka, karena mereka tidak akan membahayakan dirimu sedikit pun. Serahkanlah urusanmu kepada Allah dan bersandarlah kepada-Nya. Dan cukuplah Allah sebagai Pelindung yang dapat kamu jadikan sebagai sandaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Orang-orang munafik itu menempatkan ketaatan kepadamu jika mereka berada di sisimu, namun jika mereka pergi dan berada di tempat yang tidak terlihat olehmu, mereka mengatur siasat dan makar setan-setan mereka. Allah akan melindunginya dari apa yang mereka rencanakan dan akan membalas mereka dengan balasan yang sempurna. kemudian Allah menujukan firman-Nya kepada Rasulullah: janganlah kamu ada keinginan untuk membalas mereka, jangan membongkar nama-nama mereka jangan takut dari mereka, dan bertakwalah jangan urusan mereka pada Dzat yang tidak dapat ditolak kehendak-Nya, yang ilmu dan kuasa-Nya meliputi segala sesuatu; cukuplah Dia sebagai penolong bagi orang yang bertawakal kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَيَقُولُونَ طَاعَةٌ (Dan mereka (orang-orang munafik) mengatakan: “(Kewajiban kami hanyalah) taat”) Yakni apabila mereka di sisimu mereka mengatakan: kami diperintah untuk taat. فَإِذَا بَرَزُوا۟ مِنْ عِندِكَ (Tetapi apabila mereka telah pergi dari sisimu) Yakni telah keluar dari sisimu. بَيَّتَ طَآئِفَةٌ مِّنْهُمْ(sebahagian dari mereka mengatur siasat di malam hari) Sebagian mereka mengubah perkataan mereka. غَيْرَ الَّذِى تَقُولُ ۖ((mengambil keputusan) lain dari yang telah mereka katakan tadi) Yakni dengan perkataan selain perkataan yang kamu katakan kepada mereka tadi, dan perintah selain perintah yang kamu perintahkan. Pendapat lain mengatakan makna dari kalimat ini adalah mereka mengubah dan mengganti perkataanmu dalam masalah perjanjian yang kamu ambil atas mereka. وَاللهُ يَكْتُبُ مَا يُبَيِّتُونَ (Allah menulis siasat yang mereka atur di malam hari itu) Yakni menulisnya dalam kitab catatan amal mereka, dan membalas mereka atas hal itu. فَأَعْرِضْ عَنْهُمْ(maka berpalinglah kamu dari mereka) Yakni biarkanlah mereka dan urusan mereka sampai kamu mempunyai kemungkinan untuk membalas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Ketika bersamamu dan menerima perintahmu untuk melakukan sesuatu, maka orang-orang munafik itu akan berkata: “Perintahmu adalah suatu ketaatan, atau harus ditaati” Namun ketika mereka tidak bersamamu, maka suatu kelompok di antara mereka akan berdusta, berubah dan mengarah kepada kegelapan, berbeda dengan apa yang kamu sabdakan dan perintahkan kepada mereka. Dan Allah akan mencatat apa yang mereka rencanakan dan rekayasa itu di dalam catatan amal mereka supaya Dia bisa membalas mereka atas hal itu. Maka berpalinglah dari orang-orang munafik itu dan serahkanlah urusanmu kepada Allah. Cukuplah Allah sebagai penyelamat dan penolong bagimu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata} orang-orang munafik berkata kepadamu {“ketaatan”} kewajiban kami adalah taat {Apabila mereka telah pergi} berlalu {darimu, sebagian mereka} sekelompok dari orang-orang munafik {pada malam hari mengatur siasat} merencanakan sesuatu {yang berbeda dengan apa yang dikatakan} berbeda dengan apa yang mereka tampakkan kepadamu yang berupa ketaatan {Allah menulis} mengetahui {apa yang mereka siasatkan} apa yang mereka rencanakan {Berpalinglah dari mereka dan bertawakallah kepada Allah. Cukuplah Allah sebagai pelindung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. Ketaatan kepada Allah dan RasulNya haruslah secara lahir maupun batin dan dalam keadaan ramai maupun sepi. Adapun orang yang menampakkan ketaatan dan konsistensi di saat ramai, lalu bila ia sedang sendiri atau bersama orang-orang yang semisalnya ia meninggalkan ketaatan dan melakukan hal yang betentangan dengannya, sesungguhnya ketaatan yang ia tampakkan itu tidaklah bermanfaat dan tidak berguna, sungguh hal ini serupa dengan orang-orang yang Allah berfirman tentang mereka, “Dan mereka (orang-orang munafik) mengatakan, ‘(Kewajiban kami hanyalah) taat’.” Yaitu mereka menampakkan ketaatan apabila mereka berada di sisimu, “tetapi apabila mereka telah pergi dari sisimu” yaitu mereka keluar dan menyendiri pada kondisi yang tidak ada seorang pun melihat mereka, “sebagian dari mereka mengatur siasat di malam hari (mengambil keputusan) lain dari yang telah mereka katakan tadi.” Maksudnya, mereka mengatur siasat di malam hari dan kemudian berpaling dari ketaatan kepadamu, serta tidaklah mereka melakukan (di belakangmu) melainkan ke maksiatan. Di dalam Firman Allah, terdapat sebuah dalil bahwa suatu hal yang mana mereka telah konsisten terhadapnya bukanlah suatu ketaatan , karena kata at-Tabyit artinya, mengatur sebuah siasat pada malam hari dalam bentuk yang ditetapkan oleh pendapat. Kemudian Allah mengancam mereka atas apa yang telah mereka lakukan tersebut dalam FirmanNya, “Allah menulis siasat yang mereka atur di malam hari itu.” Maksudnya, Dia menyimpan siasat mereka dan akan memberikan balasan kepada mereka atas hal tersebut dengan balasan yang setimpal, hal itu adalah sebauh ancaman yang keras bagi mereka. Kemudian Allah memerintahkan RasulNya untuk menghadapi mereka dengan cara berpaling dari mereka tanpa mengecam, karena sesungguhnya mereka itu tidaklah dapat membahayakan beliau sama sekali apabila beliau bertawakal kepada Allah, memohon bantuanNya dalam membela agamaNya dan penegakkan syariatNya, karena itulah Allah berfirman, “Maka berpalinglah kamu dari mereka dan bertawakallah kepada Allah. Cukuplah Allah menjadi Pelindung.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {طَاعَةٌ} thaa’ah: kami memerintahkannya sebagai bentuk ketaatan kepadamu {بَرَزُوا} barozuu: mereka keluar Makna ayat : Dan perkataan Allah, {وَيَقُولُونَ طَاعَةٌ} “mereka berkata, ketaatan” yang berkata demikian adalah orang-orang munafik yang menganggap dirimu (Muhammad) pembawa sial salah paham dengan apa yang kamu katakana, saat kamu mengatakan ketaatan, yaitu perkara kami adalah ketaatan kepada kamu. Maksudnya perkara kami adalah ketaatan kepada kamu, yaitu kami tidak berkata-kata jikalau kau mengatakan sesuatu serta kami tidak akan memerintah apabila kamu memerintahkan sesuatu, kami itu taat kepada dirimu. {فَإِذَا بَرَزُوا} “jika mereka muncul”, yaitu keluar dari majelismu ganti kelompok dari mereka yang kau katakan dan mereka menyingkir tidak seperti orang yang mencocokinya di depanmu dan di dalam majelismu. Allah mewakilkan pencatatan kepada para malaikat mengenai keburukan dan kebatilan yang mereka rencanakan. {فَأَعْرِضْ عَنْهُمْ وَتَوَكَّلْ عَلَى اللهِ} “maka berpalinglah dari mereka dan bertawakallah kepada Allah” dan jangan pedulikan mereka {وَكَفَى بِاللهِ وَكِيلاً} “dan cukuplah Allah sebagai wakil” dan Dia cukup bagi dirimu dan pemberi kecukupan dari keburukan yang mereka rencanakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 81: 81-82. Dan mereka itu berkata:\"Kami ta'at\", tetapi apabila ber- pisah daripadamu, maka segolongan dari mereka, mereka-reka pada malam lain dari yang mereka katakan, tetapi Allah menulis apa yang mereka reka-reka pada malam itu. Lantaran itu, berpa- linglah dari mereka dan berserah dirilah kepada Allah, karena Allah itu cukup sebagai Pembela, Kalau begitu, apakah mereka tidak mau tadabbur akan Qur 'an? Karena jika adalah ia dari sisi yang lain dari Allah, niscaya mereka dapati padanya perselisihan yang banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika berada di hadapanmu. Dan berada dalam keadaan yang tidak diketahui oleh orang lain. Beralih dari ketaatan kepada maksiat. Dan akan memberikan balasan kepada mereka. Di ayat ini terdapat ancaman terhadap mereka. Yakni biarkanlah mereka dan bertawakkallah kepada Allah, karena mereka tidak dapat menimpakan bahaya apa-apa ketika kamu bertawakkal kepada Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 81",
    "description": "Dan mereka, orang-orang munafik, mengatakan, kewajiban kami hanyalah sepenuhnya untuk selalu taat kepadamu, Muhammad. Tetapi, apabila mereka telah pergi dari sisimu, nabi Muhammad tidak lagi berada bersamamu, sebagian dari mereka, yakni para pemimpin mereka mengatur siasat di malam hari mengambil keputusan untuk sesuatu yang lain dari yang telah mereka katakan tadi. Allah melalui penugasan para malaikat-Nya mencatat setiap rencana dan siasat yang mereka atur di malam hari itu. Oleh sebab itu, maka berpalinglah dari mereka, jangan hiraukan sedikit pun, dan bertawakAllah kepada Allah. Cukuplah Allah yang mahaperkasa yang menjadi pelindung dari tipu daya mereka maka tidakkah mereka menghayati, mendalami petunjuk dan ajaran yang terdapat dalam Al-Qur'an' sekiranya Al-Qur'an itu bukan wahyu yang turun dari Allah, pastilah mereka akan menemukan banyak sekali hal yang bertentangan di dalamnya."
  }
]