[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah mereka tidak mau melihat al-qur’an dan apa yang dibawa dengannya dari kebenaran dengan penglihatan yang penuh perenungan dan pengahayatan,yang datang dalam bentuk kerapian yang muhkam sehingga dapat dipastikan bahwa sesungguhnya al-qur’an berasal dari allah semata?sekiranya berasal dari selain allah,pastilah mereka akan mendapati banyak sekali kontradiksi di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Mengapa orang-orang itu tidak mau merenungkan dan mengkaji Al-Qur`ān agar mereka dapat membuktikan bahwa di dalamnya tidak terdapat pertentangan dan kerancuan? Dan supaya mereka mengetahui kebenaran dari ajaran yang kamu bawa. Sekiranya Al-Qur`ān itu berasal dari selain Allah -Ta'ālā- niscaya mereka akan menemukan banyak kerancuan dalam ketentuan-ketentuan hukum yang ada di dalamnya dan banyak pertentangan dalam makna-makna yang terkandung di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Allah memerintahkan hamba-hamba-Nya untuk mentadabburi Al-quran : Apakah mereka tidak mentadabburi wahyu yang diturunkan kepadamu sehingga mereka menjadi tidak berpaling darinya? karena dengan mentadaburinya akan tersingkap bukti-bukti kebenarannya dan bersinar cahayanya. Barang siapa yang mengamati makna makna Al-quran niscaya dia akan mendapatinya penuh keselarasan, kebenaran, dan kesempurnaan. Andaikata Al-quran ini bukan dari sisi Allah niscaya mereka akan mendapatinya saling bertentangan dan penuh dengan kedustaan dan kekurangan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. أَفَلَا يَتَدَبَّرُونَ (Maka apakah mereka tidak memperhatikan Al Quran?) Yakni apakah kalian berpaling dari al-qur’an dan tidak mentadabburinya. Yakni tidak memahami dan tidak mendalami maknanya, sesungguhnya jika mereka mentadabburinya dengan tadabbur yang sebenarnya niscaya mereka akan mendapatkannya serasi tanpa ada pertentangan dan akan memahami makna sebenarnya firman Allah: كل من عند الله (semua datang dari sisi Allah) (an-Nisa:78) Dan firman-Nya: وما أصابك من سيئة فمن نفسك (dan keburukan apapun yang menimpamu itu dari kesalahan dirimu sendiri) (an-Nisa: 79) وَلَوْ كَانَ مِنْ عِندِ غَيْرِ اللهِ لَوَجَدُوا۟ فِيهِ اخْتِلٰفًا كَثِيرًا (Kalau kiranya Al Quran itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya) Yakni perbedaan, saling bertentangan, dan tidak memiliki kesesuaian dengan kenyataan karena hal-hal ini merupakan sifat dari perkataan manusia; apalagi jika yang mengatakannya masuk dalam pembahasan hal-hal yang ghaib maka tidak akan sesuai dengan kenyataan kecuali sedikit sekali."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Orang-orang musyrik yang hidup semasa dengan Rasulullah tidak pernah senang dengan mukjizat-mukjizat beliau dan seolah-olah mereka membutakan mata dari mukjizat-mukjizat itu padahal mereka melihatnya, dan orang-orang yang dengan sengaja membutakan mata mereka dari ayat-ayat Allah, dan menjadikan telinga mereka tuli dari mendengarkan ayat-ayat Nya, mereka semua adalah orang-orang yang tidak akan mendapat kebaikan dalam hidupnya, mereka adalah orang yang terbuang dan sedikitpun tidak akan mendapat balasan kebaikan dari Allah. Oleh karena itu Allah melalui firman-Nya memperingati : { أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ } \"Maka apakah mereka tidak memperhatikan Al Quran?\" 2 ). { أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ }, Ilmu dan iman diterangkan begitu luas dalam ayat-ayat al-qur'an dan kedudukan manusia berbeda-beda tergantung pemahaman mereka tetangnya, al-qur'an dibaca oleh mereka siang dan malam tetapi kemuliaan masing-masing dapat diukur dari besarnya pemahaman mereka tentang al-qur'an, dan sesungguhnya Allah mengangkat derajat sebagian manusia diatas sebagian lainnya beberapa derajat. 3 ). Tidak sedikit orang yang mengatakan bahwa banyak ayat-ayat di dalam al-qur'an yang saling bertentangan, maka sampaikanlah kepada mereka untuk mentadabburi al-qur'an yang suci ini, dan itulah perintah Allah agar kita faham tentang firman-Nya : { أَفَلَا يَتَدَبَّرُونَ الْقُرْآنَ ۚ وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا } \"Maka apakah mereka tidak memperhatikan Al Quran? Kalau kiranya Al Quran itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya.\" , dan jika belum jelas padamu maknanya, maka hendaklah kamu mengikuti jalan orang-orang yang diberikan kepadanya pemahaman yang tiggi tentang kitab ini, yaitu orang-orang yang mengatakan : { آمَنَّا بِهِ كُلٌّ مِنْ عِنْدِ رَبِّنَا } \"Kami beriman kepada ayat-ayat yang mutasyaabihaat, semuanya itu dari sisi Tuhan kami\" dan ketahuilah bahwasanya ilmu kamulah yang kurang. 4 ). { وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا } , Ibnu Taimiyah mengatakan : \"Barangsiapa yang senantiasa berpegang teguh kepada al-qur'an dan sunnah Nabi dan apa yang menjadikan sandaran bagi para sahabat niscaya ia tidak akan ada pertentangan dalam ucapan dan aqidahnya\" 5 ). Qonun yang direncanakan dan ditetapkan oleh manusia sekalipun ia berasal dari akal fikiran orang-orang besar dan pemahamannya luas, sesungguhnya tetaplah pada qonun itu akan ada pertentangan, { وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللَّهِ لَوَجَدُوا فِيهِ اخْتِلَافًا كَثِيرًا } \"Kalau kiranya Al Quran itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya.\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Apakah mereka tidak memahami Al-Qur’an dan merenungi makna, hikmah dan pelajarannya?! Jika mereka mau mentadabburinya maka sungguh mereka akan mendapati Al-Qur’an itu selaras antara satu dengan lainnya. Jika Al-Qur’an itu dari kalam manusia, maka mereka akan mendapatinya akan saling berbeda dan mengandung banyak pertentangan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah mereka mentadaburi} merenungi {Al-Qur’an. Seandainya itu tidak dari sisi Allah, tentulah mereka menemukan pertentangan} ketidak seimbangan dan pertentangan {yang banyak di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. Allah memerintahkan agar merenungi kitabNya, yaitu berfikir tentang maknanya, memfokuskan pikiran padanya, pada asas-asasnya dan pada kesimpulannya serta hal-hal yang berkaitan dengannya, dengannya dapat dihasilkan segala kebaikan dan dibuahkan segala ilmu, dengannya iman bertambah dalam hati dan akarnya akan tertancap dalam-dalam. Sesungguhnya ia memberi tahu tentang Rabb yang harus di sembah dan segala perkara tentang segala sipat-sipat kesempurnaan dan perkara yang disucikan dariNya dari berbagai sipat kekurangan, ia memberitahukan tentang jalan yang menyampaikan kepadaNya, dan tentang sipat-sipat penghuni syurga dana pa pun yang mereka dapatkan ketika memasukinya, memberitahukan tentang musuh yang benar musuh hakiki, dan tentang jalan yang mengakibatkan siksaan serta sipat-sipat penghuninya dan hal apa pun yang ada pada mereka yang menyebabkan siksaan tersebut. Dan setiap kali hamba bertambah renungannya terhadap Al-Qur’an, niscaya pula bertambah ilmu, amal, dan kearipannya, oleh karena hal itu Allah memerintahkan kepada hal tersebut dan menganjurkannya lalu ,mengabarkan bahwa itulah maksud dari turunnya Al-Qur’an, sebagaimana Allah berfirman,\" Ini adalah sebuah kitab yang Kami turunkan kepadamu penuh dengan berkah supaya mereka memperhatikan ayat-ayatnya dan supaya mendapat pelajaran orang-orang yang mempunyai fikiran.\" (Sad:29) dan Allah juga berfirman \"Maka apakah mereka tidak memperhatikan Al Quran ataukah hati mereka terkunci?\" (Muhammad:24). Dan diantara faidah merenungi kitabulah adalah, bahwa dengan merenunginya bahwa seorang hamba akan sampi kepada derajat keyakinan dan ilmu bahwa Al-Qur’an itu adalah Kalam Allah, karena sesungguhnya ia akan menyaksikan bahwa sebagiannya membenarkan sebagaian yang lain, dan Anda akan menyaksikan hikmah-hikmah, kisah-kisah, dan kabar yang di ulang-ulang dalam Al-Qur’an dalam beberapa tempat, seluruhnya saling sesuai dan saling membenarkan, sebagaimana tidaklah membatalkan yang lainnya, dengan demikian di ketahuilah kesempurnaan Al-Qur’an dan bahwasanya ia adalah dari dzat yang ilmunya meliputi segala sesuatu, karena itulah Allah berfirman, “Kalau kirannya Al-Qur’an itu bukan dari sisi Allah, tentulah mereka mendapat pertentangan yang banyak di dalamnya,” maksudnya, ketika Al-Qur’an, itu dari sisi Allah, maka tidak aka nada perselisihan di dalamnya sama sekali."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {أَفَلا يَتَدَبَّرُونَ} afalaa yatadabbaruu: mentadaburi Al Quran, membaca satu ayat atau beberapa ayat dan mengulanginya lagi berkali-kali untuk memahami maksud Allah dari ayat itu. Makna ayat : Dan firman Allah di dalam ayat (82) {أَفَلا يَتَدَبَّرُونَ الْقُرْآنَ} “apakah mereka tidak merenungkan al Quran” yang menegur atas berpalingnya mereka, kebodohan mereka dan salah paham mereka. Andai saja mereka mau merenungi/mentadaburi al Quran yang dibacakan kepada mereka dan yang mereka dengan pagi dan petang, niscaya mereka akan mengerti bahawa Rasul adalah sesuatu yang benar adanya dan apa yang datang bersamanya adalah kebenaran. Maka mereka akan beriman, masuk Islam dengan baik keIslamannya dan berakhir kemunafikan yang telah merusak hati dan membuat bobrok akal mereka. Sesungguhnya tadabur Al Quran dengan seksama dan mengulangi ayat-ayatnya mengantarkan mereka kepada kebenaran dan menjauh dari kebatilan serta lebih dekat untuk paham, jika mereka mau mentadaburi Al Quran perkataan Allah yang bukan perkataan manusia. Jikalau Al Quran adalah perkataan manusia, maka akan ditemukan pertentangan dan perselisihan. Tapi Al Quran adalah perkataan Sang Pencipta manusia. Oleh karenanya Al Quran mempunyai kata-kata yang dalam, lafazh-lafazh yang mengena, makna-makna yang kokoh dan ayat-ayat yang penuh petunjuk kepada kebahagiaan dan kesempurnaan. Hal-hal tadi adalah bukti bahwa Al Quran perkataan Allah yang turun dengan kemuliaan Allah, benar adanya kepada utusan-Nya dan tidak ada gunanya kafir dan kemunafikan setelah adanya Al Quran. Ini adalah makna dari firman Allah {وَلَوْ كَانَ مِنْ عِنْدِ غَيْرِ اللهِ لَوَجَدُوا فِيهِ اخْتِلافاً كَثِيراً} “Jikalau Al Quran adalah dari selain Allah, niscaya akan mereka temukan pertentangan yang banyak di dalamnya.” Pelajaran dari ayat : • Wajibnya mentadaburi Al Quran untuk menguatkan iman. • Tanda bahwa al Quran adalah wahyu dan perkataan dari Allah, terbebas dari ketimpangan dan pertentangan dalam lafal dan maknanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 82: 81-82. Dan mereka itu berkata:\"Kami ta'at\", tetapi apabila ber- pisah daripadamu, maka segolongan dari mereka, mereka-reka pada malam lain dari yang mereka katakan, tetapi Allah menulis apa yang mereka reka-reka pada malam itu. Lantaran itu, berpa- linglah dari mereka dan berserah dirilah kepada Allah, karena Allah itu cukup sebagai Pembela, Kalau begitu, apakah mereka tidak mau tadabbur akan Qur 'an? Karena jika adalah ia dari sisi yang lain dari Allah, niscaya mereka dapati padanya perselisihan yang banyak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sesungguhnya mentadabburi kitab Allah merupakan kunci bagi semua ilmu, dengannya diperoleh semua kebaikan dan daripadanya digali berbagai macam ilmu, dan dengannya bertambah keimanan di hati. Semakin bertambahnya tadabbur seseorang terhadap Al Qur'an, maka semakin bertambah pula ilmu, amal dan bashirah (ketajaman pandangan)nya. Oleh karena itu, Allah memerintahkan kita mentadabburi firman-Nya dan memberitahukan bahwa untuk itulah Al Qur'an diturunkan, Allah berfirman, \"Ini adalah sebuah kitab yang Kami turunkan kepadamu penuh dengan berkah supaya mereka memperhatikan ayat-ayat-Nya dan supaya mendapat pelajaran orang-orang yang mempunyai fikiran.\" (Terj. Shaad: 29). Di antara faedah mentadabburi kitab Allah adalah seseorang dapat mencapai derajat yakin, mengetahui bahwa kitab tersebut adalah firman Allah, karena ayat yang satu dengan yang lain bersesuaian dan saling membenarkan. Kita dapat melihat tentang hukum, kisah dan berita yang diulang di beberapa tempat dalam Al Qur'an, semuanya sesuai dan saling membenarkan; tidak saling membatalkan. Dengan ini dapat diketahui kesempurnaan Al Qur'an dan bahwa ia berasal dari Allah Yang ilmu-Nya meliputi segala sesuatu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 82",
    "description": "Maka tidakkah mereka menghayati, mendalami petunjuk dan ajaran yang terdapat dalam Al-Qur'an' sekiranya Al-Qur'an itu bukan wahyu yang turun dari Allah, pastilah mereka akan menemukan banyak sekali hal yang bertentangan di dalamnya dan apabila sampai kepada mereka, orang-orang munafik itu, suatu berita yang belum dapat dibuktikan kebenarannya, baik tentang keamanan ataupun ketakutan, mereka langsung menyiarkannya dengan tujuan untuk menimbulkan kerancuan dan kekacauan. Padahal, apabila sebelum menyebarkan berita itu mereka menyerahkannya terlebih dahulu kepada rasul dan ulil amri di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya akan dapat mengetahuinya secara resmi dari mereka, yakni rasul dan ulil amri. Sekiranya bukan karena karunia dan rahmat Allah kepadamu berupa ajaran dan tuntunan hidup, tentulah kamu mengikuti langkah-langkah setan, kecuali sebagian kecil saja di antara kamu yang mengikuti petunjuk rasul."
  }
]