[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila datang kepada orang-orang yang keimanan mereka belum tertanam kuat di dalam hati mereka, suatu perkara yang mestinya disembunyikan, yang berhubungan dengan keamanan yang berdampak positif bagi islam dan kaum muslimin atau berkaitan dengan ketakutan yang menyebabkan ketidak tentraman di dalam hati mereka,mereka menyebarkan dan menyiarkannya ke tengah manusia. Sekiranya mereka mengembalikan penanganan kejadian yang datang pada mereka kepada Rasululah atau kepada ahli ilmu dan fikih, pastilah akan mengetahui hakikat perkara tersebut orang-orang yang ahli beristinbath dari mereka.Dan kalau bukan karena allah mencurahkan karunia kepada kalian dan merahmati kalian,pastilah kalian akan mengikuti setan dan bisikan-bisikannya kecuali sebagian kecil saja dari kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Apabila orang-orang munafik itu mendengar sesuatu tentang orang-orang Islam, baik terkait dengan keamanan dan kebahagiaan mereka maupun terkait ketakutan dan kesedihan mereka, maka orang-orang munafik itu langsung menyebarluaskannya. Seandainya mereka mau mengembalikan masalah itu kepada Rasulullah -ṣallallāhu 'alaihi wa sallam- dan kepada para cendekiawan serta ulama penasihat, niscaya para cendekiawan akan dapat menemukan penyelesaian yang seharusnya dilakukan terkait hal itu. Apakah harus disebarluaskan ataukah dirahasiakan? Dan kalau bukan karena karunia Allah dan rahmat-Nya terhadap kepada kalian -wahai orang-orang mukmin- niscaya kalian akan mengikuti bisikan setan, kecuali sebagian kecil dari kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Allah berfirman untuk mengingkari orang yang terburu-buru dalam menyikapi suatu urusan sebelum dia memastikan kebenarannya namun dia segera menyebarkannya kepada orang lain: Seharusnya jika datang kepada mereka suatu kabar penting yang menyangkut kemaslahatan orang banyak seperti keamanan, kabar gembira bagi kaum muslimin, atau berita genting yang mengandung musibah bagi mereka, maka hendaklah mereka memastikan kebenaran berita tersebut dan tidak terburu-buru menyebarkannya. Kemudian hendaklah mereka menyampaikan berita itu kepada Rasulullah atau orang yang berilmu dan berpengalaman yang dapat memberi pandangan terhadap berita itu dan mempertimbangkan kebaikan atau keburukan di dalamnya. Jika mereka melihat bahwa penyebaran berita itu dapat membawa kebaikan dan kebahagiaan bagi kaum muslimin, maka hendaklah mereka menyebarkannya. Namun jika penyebaran berita itu tidak membawa manfaat atau mengandung manfaat namun mudharatnya lebih besar dari manfaatnya, maka hendaklah mereka merahasiakan berita itu. Kalaulah bukan karena karunia dan rahmat Allah kepada kalian dengan adanya Rasulullah dan orang-orang yang berilmu, niscaya agama ini akan ternodai akibat tersebarnya berita-berita bohong, dan urusan-urusan kaum muslimin akan melemah, serta kebanyakan kalian akan mengikuti godaan setan. Dan mereka tidak mengikuti jejak setan karena penjagaan dari Allah berkat keteguhan di atas kebenaran yang Allah berikan kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَإِذَا جَآءَهُمْ أَمْرٌ مِّنَ الْأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا۟ بِهِۦ ۖ (Dan apabila datang kepada mereka suatu berita tentang keamanan ataupun ketakutan, mereka lalu menyiarkannya) Mereka adalah sekolompok orang-orang lemah dari kalangan orang-orang beriman. Apabila mereka mendengar berita kemenangan orang-orang beriman atau terbunuhnya musuh mereka, atau berita kekalahan atau pembunuhan orang-orang beriman mereka langsung menyiarkannya. Pendapat lain mengatakan yakni mereka apabila mendengar keberhasilan orang-orang munafik dalam melawan orang-orang beriman dan isu-isu yang tidak benar mereka langsung menyebarkan berita tersebut sehingga hal itu menimbulkan kerusakan. وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ وَإِلَىٰٓ أُو۟لِى الْأَمْرِ مِنْهُمْ(Dan kalau mereka menyerahkannya kepada Rasul dan Ulil Amri di antara mereka) Ulil amri para pemilik ilmu dan akal yang sehat yang menjadi rujukan dalam urusan-urusan mereka. Atau mereka adalah para pemimpin. لَعَلِمَهُ الَّذِينَ يَسْتَنۢبِطُونَهُۥ مِنْهُمْ ۗ( tentulah orang-orang yang ingin mengetahui kebenarannya (akan dapat) mengetahuinya dari mereka (Rasul dan Ulil Amri)) Yakni dari kesimpulan yang mereka dapatkan dari hasil pemahaman akal sehat mereka. Dan makna dari potongan ayat ini adalah seandainya mereka tidak menyebarkan kabar-kabar sampai Rasulullah atau para pemimpin yang bertanggungjawab atas itu yang akan mengabarkannya karena mereka mengetahui apa yang seharusnya diumumkan dan apa yang seharusnya dirahasiakan niscaya akan didapatkan apa yang diinginkan bersama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Dan ketika telah datang kepada orang-orang muslim yang lemah suatu perkara, maka mereka akan mendengarkan berita keamanan seperti kemenangan atau ketakutan seperti kekalahan dan peperangan dari perkara itu, lalu mereka akan menyiarkannya kepada orang-orang dan menyebarkan rumor palsu yang bisa membahayakan para pasukan. Dan jika mereka menyampaikan kabar tersebut kepada rasulullah, dan orang yang berilmu, para pemimpin, maka sungguh orang-orang yang ingin mengetahui rahasia perkara itu akan mengetahui hakikat berita tersebut dari para pemimpin, sehingga mereka bisa memastikan kebenarannya dan mengerti tentang sesuatu yang sebaiknya diumumkan atau disembunyikan, yaitu jika mereka menyerahkan kabar itu kepada rasulullah atau ulil amri, maka sungguh mereka telah melakukan sesuatu yang bisa memberi kemaslahatan, yaitu mengumumkan berita itu atau menyembunyikannya. Kalau tidak karena taufik, keutamaan, dan nikmat Allah yang diberikan kepada kalian untuk beriman, maka sungguh kalian akan mengikuti jalan setan sebagaimana orang-orang munafik itu mengikutinya. Dan firman Allah {Illa Qaliila} adalah pengecualian dari tindakan menyiarkan berita dan mencari tahu, diluar itu termasuk tindakan patuh, yaitu sungguh kalian telah mengikuti setan kecuali hanya sedikit dari kalian seperti orang-orang yang mendapatkan petunjuk yang tetap berada dalam kebenaran, ketika Allah memberi mereka akal sehat dan keinginan yang kuat yang tidak memungkinkan mereka untuk tunduk kepada setan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila datang kepada mereka} datang kepada orang-orang munafik itu {suatu perkara tentang keamanan} kemenangan dan harta rampasan {atau ketakutan} kematian dan kekalahan {mereka menyebarluaskannya} menyebarluaskan dan mengungkapkannya {Seandainya mereka menyerahkannya} mengembalikan perkara yang datang kepada mereka itu {kepada Rasul dan pemegang kekuasaan} orang-orang yang ahli dalam keilmuan pemahaman dan wawasan {di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya mengetahuinya dari mereka} maka sungguh orang-orang yang ahli dalam keilmuan, pemahaman dan wawasan itu akan tahu tentang sesuatu yang sebaiknya diungkapkan dan sesuatu yang sebaiknya disembunyikan {Jika bukan karena karunia dan rahmat Allah kepada kalian, tentulah kalian mengikuti setan, kecuali sebagian kecil saja"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Ini merupakan pengajaran dari Allah bagi hamba-hambanya tentang perbuatan mereka yang tidak patut tersebut, dan bahwa seyogyanya apabila datang kepada mereka suatu perkara penting dari perkara umum yang berkaitan dengan kebahagiaan kaum Mukminin atau dengan kekhawatiran yang mengakibatkan suatu musibah atas mereka, agar mereka memastikan terlebih dahulu dan tidak tergesa-gesa untuk menyebarkan kabar tersebut, dan sebaiknya mereka menyerahkanya kepada Rasul atau Ulil Amri diantara mereka yaitu yang memilki pandangan luas, ilmu ,nasihat, kecerdasan, dan keteguhan, dimana mereka mengetahui urusan-urusan dan mengetahui kemaslahatan dan kemudharatan, dan bila mereka memandang bahwa menyebarkannya mengandung kemaslahatan dan semangat bagi kaum Muslimin, bahkan kebahagiaan untuk mereka serta tindakan kewaspadaan terhadap musuh-musuh mereka, maka mereka bileh melakukan hal tersebut, dan bila mereka memandang apabila hal tersebut mengandung kemaslahatan, atau ada kemaslahatan padanya akan tetapi kemudhratanya lebih bersar daripada kemaslahatannya, maka janganlah meeka menyebarkannya, karena itu Allah berfirman, “tentulah orang-orang yang ingin tahu kebenarannya (akan dapat mengetahui) dari mereka Rasul dan Ulil Amri,” maksudnya, mereka dapat menyimpulkan suatu kebenaran dengan pemikiran dan pendapat-pendapat mereka yang lurus serta ilmu-ilmu yang matang. Ayat ini merupakan sebuah dalil bagi sebuah kaidah moral yaitu apabila terjadi suatu pembahasan dalam suatu perkara, seyogyanya perkara tersebut di serahkan kepada orang yang berhak atas perkara tersebut, dan tidak ada seorang pun yang didahulukan sebelumnya, karena sesungguhnya ia lebih dekat dengan kebenaran dan lebih dapat selamat dari kesalahan. Ayat ini juga mengisyaratkan tentang larangan dari sikap tergesa-gesaan dan terburu-buru dalam menyampaikan inpormasi setelah mendenganrkannya, dan seharusnya dalam perkara seperti itu perlu berpikir sebelum membicarakandan membahasnya, apakah hal ini menyimpan kemaslahatan hingga ia melakukannya ataukah hingga ia menahannya. Kemudian Allah berfirman, “kalau tidaklah karena karunia dan rahmat Allah kepadamu,”yaitu dalam membimbing, mengajarkan, dan mendidik kalian dengan apa yang belum kalian ketahui, “tentulah kamu mengikuti setan, kacuali sebagian kecil saja di antaramu,” karena manusia dengan tabiatnya adalahzhalim lagi bodoh, dan nafsunya tidaklah menyuruhnya kecuali kepada kejahatan, namun bila ia bersandar kepada Rabbnya dan berpengan teguh denganNya dan ia berjuan dalam hal tersebut, niscaya Rabbnya akan mengasihi dan membimbingnya kepada kebaikandan menjaganya dari setan yang terkutuk."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {أَذَاعُوا بِهِ} adzaa’uu bih: mereka mengungkapkan dan mengumumkannya kepada manusia. {يَسْتَنْبِطُونَهُ} yastanbithuunah: mengeluarkan maknanya yang benar. Makna ayat : {وَإِذَا جَاءَهُمْ أَمْرٌ مِنَ الأَمْنِ أَوِ الْخَوْفِ أَذَاعُوا بِهِ} “Dan jikalau datang perkara aman atau takut kepada mereka, mereka menyebarkannya.” dan ini adalah ayat (83). Allah mengabarkan perihal orang-orang ‘sakit’ itu dengan penyakit kemunafikan sebagai bentuk celaan kepada mereka, gertakan dan serangan maknawi kepada mereka. Allah berfirman {وَإِذَا جَاءَهُمْ أَمْرٌ مِنَ الأَمْنِ أَوِ الْخَوْفِ} “Dan Jikalau datang perkara aman atau takut kepada mereka”, yaitu jika datang sebagian pasukan jihad dengan perkara kemenangan atau kekalahan, mereka bergegas menyebarkan dan mengumumkannya. Dan hal demikian itu kembali ke penyakit hati mereka, karena kabar dan dimutlakkan dengan lafaz perkara. Dikarenakan keadaan aman tidaklah sama dengan keadaan perang. Jikalau ketakutan yang mereka umumkan adalah kekalahan dalam perang, mereka itu mengumumkannya dalam keadaan panik dan ketakutan karena mereka itu adalah para pengecut seperti yang telah lalu dijelaskan sebelumnya. Allah berfirman untuk memberi pembelajaran kepada mereka dan kepada selainnya apa yang seyogyanya terdapat pada orang-orang yang berjihad kala perang {وَلَوْ رَدُّوهُ إِلَى الرَّسُولِ} “Jikalau mereka mengembalikannya kepada Rasul” pemimpin tertinggi {وَإِلَى أُولِي الأَمْرِ مِنْهُمْ} “dan kepada para pemerintah mereka” dan mereka adalah para pemimpin perang dan jihad, {لَعَلِمَهُ الَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ} “niscaya orang-orang yang mengambil hukum itu dari mereka akan mengetahuinya” yakni akan nampak misteri kabar itu dan akan mengetahui konsekuensi apa yang akan terjadi darinya, jikalau itu baik, maka akan diumumkan. dan jika itu buruk, maka akan diberitakan kepada mereka. Kemudian Allah berfirman {وَلَوْلا فَضْلُ اللهِ عَلَيْكُمْ وَرَحْمَتُهُ} “Jikalau tidak ada keutamaan Allah dan kasih sayang-Nya yang diberikan kepada kalian.” wahai para orang yang beriman {لاتَّبَعْتُمُ الشَّيْطَانَ} “niscaya kalian akan mengikuti setan itu” dalam menerima isu-isu yang ada dan kabar burung yang membuat putus asa. {إِلا قَلِيلاً} “kecuali sedikit” dari kalian di antara orang-orang yang mempunyai ilmu dan akal yang jernih, karena semisal mereka tidak akan terpancing dengan provokasi, tidak terpengaruh dengan desas-desus seperti para sahabat Rasul yang senior dari kalangan Muhajirin dan Anshor rodhiallahu ‘anhum ajma’in. Pelajaran dari ayat : • Putusan penyebaran kabar perihal peperangan tidaklah diumumkan kecuali dari pihak pimpinan tertinggi agar tidak terjadi kekacauan pada barisan pasukan perang dan juga pada umat Islam. • Mayoritas orang akan terpengaruh dengan apa yang dia dengar kecuali sebagian kecil dari kalangan intelekual dan yang memahami perpolitikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 83: Dan apabila sampai kepada mereka satu urusan dari keamanan atau ketakutan; maka mereka siar-siarkan dia, padahal jika mereka kembalikan dia kepada Rasul dan kepada orang-orang yang berkuasa dari mereka, niscaya (urusan) itu diketahui oleh sebagian dari orang- orang yang menyelidikinya dan jika tidak ada kurnia Allah atas kamu dan rahmat-Nya, niscaya kamu turut setan, kecuali sedikit (dari kamu)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dari Ibnu Abbas dari Umar bin Khaththab, ia berkata, \"Ketika Nabi shallallahu 'alaihi wa sallam menjauhi istri-istrinya, aku pun masuk ke masjid ternyata orang-orang sedang melempari kerikil dan berkata, \"Rasulullah shallallahu 'alaihi wa sallam telah mentalak istri-istrinya.\" Hal itu terjadi ketika mereka belum diperintahkan berhijab. Umar berkata, \"Saya akan beritahukan hal itu hari ini.\" Maka saya menemui Aisyah dan berkata, \"Wahai puteri Abu Bakar, apakah engkau sampai menyakiti Rasulullah shallallahu 'alaihi wa sallam?\" Aisyah menjawab, \"Apa urusanmu terhadapku wahai Ibnul Khaththab, urusilah aibmu sendiri.\" Umar berkata, \"Maka saya menemui Hafshah binti Umar dan berkata kepadanya, \"Wahai Hafshah! Apakah engkau sampai menyakiti Rasulullah shallallahu 'alaihi wa sallam. Demi Allah, sesungguhnya saya tahu bahwa Rasulullah shallallahu 'alaihi wa sallam tidak menyukaimu. Kalau bukan karena saya, tentu Rasulullah shallallahu 'alaihi wa sallam sudah mentalakmu.\" Hafshah pun menangis dengan tangisan yang begitu serius. Saya pun bertanya kepadanya, \"Di mana Rasulullah shallallahu 'alaihi wa sallam?\" Ia menjawab, \"Dia sedang berada di dekat lemarinya di kamar.\" Saya pun masuk, ternyata saya menemui Ribah pelayan Rasulullah shallallahu 'alaihi wa sallam sedang duduk di palang (kayu bawah) pintu kamar sambil memanjangkan kakinya di atas kayu berlubang, yaitu batang pohon kurma yang dipakai tangga oleh Rasulullah shallallahu 'alaihi wa sallam untuk naik dan turun. Ribah melihat ke kamar, lalu melihatku dan tidak berkata apa-apa, kemudian saya keraskan suara sambil berkata, \"Wahai Ribah, izinkan saya di bersamamu untuk menghadap Rasulullah shallallahu 'alaihi wa sallam, karena saya mengira bahwa Rasulullah shallallahu 'alaihi wa sallam mengira bahwa saya datang karena Hafshah. Demi Allah, jika Rasulullah shallallahu 'alaihi wa sallam memerintahkan aku memenggal lehernya, tentu saya penggal lehernya.\" Saya keraskan suara saya. Ia pun berisyarat kepadaku agar masuk kepadanya, maka saya masuk menemui Rasulullah shallallahu 'alaihi wa sallam, ternyata Beliau sedang berbaring di atas tikar, saya pun duduk, lalu Beliau mendekatkan kainnya dan Beliau tidak mengenakan apa-apa selain itu. Ketika itu, tikarnya membekas pada rusuk Beliau. Saya melihat dengan mata saya lemari Rasulullah shallallahu 'alaihi wa sallam, ternyata di sana terdapat segenggam gandum seukuran satu shaa' (4 mud/kaupan), demikian juga daun salam di pojok kamar serta ada kulit yang digantungkan. Saya pun meneteskan air mata, lalu Beliau bertanya, \"Apa yang membuatmu menangis, wahai Ibnul Khaththab?\" Aku menjawab, \"Wahai Nabi Allah, mengapa saya tidak menangis, sedangkan tikar ini membekas pada rusukmu. Sedangkan lemarimu tidak menyimpan apa-apa selain yang saya lihat. Berbeda dengan Kaisar dan Kisra yang memperoleh banyak buah dan berada di dekat sungai yang mengalir. Sedangkan engkau utusan Allah dan pilihan-Nya dengan keadaan lemari seperti ini.\" Beliau bersabda, \"Wahai Ibnul Khaththab, tidakkah kamu ridha, untuk kita akhirat dan untuk mereka dunia?\" Saya menjawab, \"Ya.\" Ketika saya masuk menemuinya, saya melihat tampak marah di mukanya, maka saya berkata, \"Wahai Rasulullah, para istri tidak akan menyusahkan dirimu. Jika engkau mentalak mereka, maka sesungguhnya Allah bersamamu, demikian pula, malaikat-Nya, Jibril, Mikail, saya, Abu Bakar, dan kaum mukmin bersamamu. \" Saya tidaklah berbicara –wal hamdulillah- kecuali saya berharap agar dibenarkan oleh Allah. Ketika itu turunlah ayat takhyir (pemberian pilihan), \"Jika kamu berdua bertaubat kepada Allah, Maka Sesungguhnya hati kamu berdua telah condong (untuk menerima kebaikan); dan jika kamu berdua bantu-membantu menyusahkan Nabi, Maka Sesungguhnya Allah adalah Pelindungnya dan (begitu pula) Jibril dan orang-orang mukmin yang baik; dan selain dari itu malaikat-malaikat adalah penolongnya pula. ---Jika Nabi menceraikan kamu, boleh Jadi Tuhannya akan memberi ganti kepadanya dengan istri yang lebih baik daripada kamu, yang patuh,...dst.\"(Terj. At Tahrim: 4-5) Ketika itu Aisyah binti Abu Bakar dan Hafshah saling bantu-membantu menyusahkan Nabi shallallahu 'alaihi wa sallam terhadap istri-istri yang lain. Saya pun berkata, \"Wahai Rasulullah, apakah engkau mentalak mereka?\" Beliau menjawab, \"Tidak.\" Saya berkata, \"Wahai Rasulullah, sesungguhnya saya masuk ke masjid sedangkan kaum muslimin sedang melempari kerikil sambil berkata, \"Rasulullah shallallahu 'alaihi wa sallam mentalak istri-istrinya.\" Bolehkah saya turun agar saya memberitahukan mereka bahwa Engkau tidak mentalak mereka?\" Beliau menjawab, \"Ya, jika engkau mau.\" Saya senantiasa berbicara dengan Beliau sampai hilang marah dari mukanya dan sampai Beliau memperlihatkan giginya dan tersenyum, dan Beliau adalah orang yang paling bagus giginya. Nabi Allah pun turun dan aku turun bersandar dengan batang tersebut. Rasulullah shallallahu 'alaihi wa sallam turun tampak seperti berjalan di tanah, di mana Beliau tidak menyentuhnya (batang tersebut) dengan tangannya, lalu saya berkata, \"Wahai Rasulullah, Engkau berada di kamar hanya 29 hari?\" Beliau bersabda, \"Sesungguhnya sebulan itu 29 hari.\" Saya pun berdiri di pintu masjid dan menyeru dengan suara keras, \"Rasulullah shallallahu 'alaihi wa sallam tidak mentalak istri-istrinya.\" Ketika itu turunlah ayat, \"Dan apabila datang kepada mereka suatu berita tentang keamanan ataupun ketakutan, mereka lalu menyiarkannya. dan kalau mereka menyerahkannya kepada Rasul dan ulil Amri di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya (akan dapat) mengetahuinya dari mereka (Rasul dan ulil Amri)…dst.\" Sayalah yang mengetahui perkara itu, dan Allah menurunkan ayat takhyir (pilihan). Ayat ini merupakan pengajaran adab dari Allah kepada hamba-hamba-Nya terhadap perbuatan yang tidak patut mereka lakukan, dan sepatutnya bagi mereka ketika sampai masalah-masalah penting yang terkait dengan masalah umum, seperti terkait dengan keamanan, kegembiraan dan kekhawatiran yang di sana terdapat musibah bagi mereka untuk menahan diri dengan tidak segera menyampaikan berita itu, bahkan menyampaikan terlebih dulu kepada rasul dan ulil amri (para ulama dari kalangan sahabat atau orang yang memiliki pandangan tepat), di mana mereka mengetahui hal yang lebih bermaslahat. Mereka (rasul dan ulil amri) nanti akan memperhatikan berita itu, apakah jika disebarluaskan ada maslahatnya dan dapat menyemangatkan kaum muslimin serta menggembirakan mereka ataukah tidak ada maslahatnya, atau ada maslahatnya namun madharatnya lebih besar daripada maslahatnya, sehingga berita itu tidak disebarluaskan. Kaum munafik atau orang-orang yang lemah iman. Seperti berita tentang sariyyah (pasukan kecil) yang dikirim Nabi shallallahu 'alaihi wa sallam. Yakni kemenangan. Yakni kekalahan. Sehingga membuat lemah hati kaum mukmin dan Nabi shallallahu 'alaihi wa sallam sendiri merasa tersakiti. Yakni kepada Rasul dan tokoh-tokoh sahabat atau ulama di antara mereka. Dalam ayat ini terdapat dalil terhadap kaidah adab, yaitu apabila diperlukan pembahasan tentang suatu masalah, maka sepatutnya masalah tersebut diserahkan kepada ahlinya, tidak disodorkan kepada yang lain, hal itu karena yang demikian lebih dekat kepada kebenaran dan lebih selamat dari kesalahan. Demikian pula menunjukkan dilarangnya bersikap tergesa-gesa menyebarkan apa yang didengarnya dan perintah untuk memperhatikan perkara itu, apakah ada maslahatnya sehingga ia pun perlu maju atau tidak, sehingga perlu ditahan. Yakni taufiq, pengajaran adab dan ilmu yang diajarkan-Nya kepada kamu yang sebelumnya tidak kamu ketahui. Karena manusia pada tabi'atnya zalim dan jahil (bodoh), hawa nafsunya biasa menyuruh kepada keburukan. Namun apabila seseorang kembali kepada Tuhannya dan bersandar kepada-Nya, maka Allah akan berbuat lembut kepadanya, memberinya taufiq kepada semua kebaikan dan melindunginya dari godaan setan yang terkutuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 83",
    "description": "Dan apabila sampai kepada mereka, orang-orang munafik itu, suatu berita yang belum dapat dibuktikan kebenarannya, baik tentang keamanan ataupun ketakutan, mereka langsung menyiarkannya dengan tujuan untuk menimbulkan kerancuan dan kekacauan. Padahal, apabila sebelum menyebarkan berita itu mereka menyerahkannya terlebih dahulu kepada rasul dan ulil amri di antara mereka, tentulah orang-orang yang ingin mengetahui kebenarannya akan dapat mengetahuinya secara resmi dari mereka, yakni rasul dan ulil amri. Sekiranya bukan karena karunia dan rahmat Allah kepadamu berupa ajaran dan tuntunan hidup, tentulah kamu mengikuti langkah-langkah setan, kecuali sebagian kecil saja di antara kamu yang mengikuti petunjuk rasulmaka berperanglah engkau, nabi Muhammad dan kaum muslim, di jalan Allah untuk menegakkan kebenaran dan keadilan, dan ingatlah bahwa engkau tidaklah dibebani melainkan atas kewajiban yang diletakkan pada dirimu sendiri. Kobarkanlah semangat orang-orang beriman untuk berperang di jalan Allah. Mudah-Mudahan Allah menolak dengan cara mematahkan serangan orang-orang yang kafir itu. Allah sangat besar kekuatan-Nya untuk mengalahkan para penentang agama Allah itu dan sangat keras siksaan-Nya bagi kedurhakaan orang-orang munafik itu."
  }
]