[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka berjihadlah (wahai nabi),di jalan allah dan dalam rangka meninggikan kalimatNYA.Kamu tidak terikat dengan kewajiban orang lain dan tidak dimintai pertanggung jawaban dengannya. Dan doronglah kaum mukminin untuk berperang dan berjihad,serta motivasi mereka untuk mencintainya. Mudah-mudahan allah mencegah darimu dan dari mereka kebururukan orang-orang kafir dan kebengisan mereka..Dan allah jauh lebih kuat dan lebih besar siksaanNYA bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Maka berperanglah -wahai Rasul- di jalan Allah untuk menjunjung tinggi kalimat-Nya dan kamu tidak akan diminta bertanggung jawab atas perbuatan orang lain dan tidak akan diharuskan untuk itu. Karena kamu tidak diperintahkan selain mendorong dirimu sendiri ke medan perang. Lalu anjurkanlah dan doronglah orang-orang mukmin untuk pergi ke medan perang. Semoga dengan kepergianmu ke medan perang itu Allah akan meredam kekuatan orang-orang kafir. Dan Allah memiliki kekuatan yang lebih dahsyat serta hukuman yang lebih berat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Setelah Allah menjelaskan sifat munafik mereka yang menyebabkan mereka enggan pergi berjihad dan melemahkan semangat orang lain untuk berjihad, maka kemudian Allah menjadikan itu sebagai sebab agar Rasulullah menjalankan urusannya tanpa melihat sikap orang-orang munafik terhadap keputusannya, baik mereka setuju maupun tidak. Allah berfirman: Hai Muhammad, berperanglah di jalan Allah melawan orang-orang yang memerangimu, meski orang-orang munafik meninggalkanmu dan membiarkanmu berperang sendirian, selama kamu menginginkan kemenangan dalam melawan musuh. Kamu tidak dibebani untuk menyerahkan diri untuk pergi berjihad kecuali dirimu sendiri. Allah adalah pemolongmu, jika Dia berkehendak maka Dia akan menolongmu meski sendirian, seperti ketika menolongmu ketika bersama beribu-ribu pasukan, kamu tidak dibebani kecuali untuk mendorong orang-orang pergi berperang. Semoga Allah melenyapkan kekuatan orang-orang kafir dengan perang yang kalian lakukan di jalan Allah, dan semangat yang saling kalian kobarkan di antara kalian. Allah Maha Kuasa dan Maha Perkasa, dan siksa dan azab-Nya sangat keras. Dia berkuasa atas mereka di dunia dan di akhirat akibat kekafiran dan kedurhakaan mereka terhadap kebenaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. فَقٰتِلْ فِى سَبِيلِ اللهِ (Maka berperanglah kamu pada jalan Allah) Yakni berperanglah sendiri hai Muhammad. لَا تُكَلَّفُ إِلَّا نَفْسَكَ ۚ( tidaklah kamu dibebani melainkan dengan kewajiban kamu sendiri) Yakni kamu tidak bertanggungjawab atas sahabat-sahabatmu apakah mereka ikut berperang atau tidak, Allah mengharuskanmu agar melakuakan apa yang Allah perintahkan kepadamu dan tidak mengharuskanmu mempertanggungjawabkan perbuatan orang lain. وَحَرِّضِ الْمُؤْمِنِينَ ۖ( Kobarkanlah semangat para mukmin) Yakni doronglah semangat mereka untuk mengikuti peperangan dan jihad. عَسَى اللهُ أَن يَكُفَّ بَأْسَ الَّذِينَ كَفَرُوا۟ ۚ( Mudah-mudahan Allah menolak serangan orang-orang yang kafir itu) Terdapat pengharapan bagi orang-orang beriman untuk menghentikan serangan orang-orang kafir atas mereka, dan ini merupakan janji Allah, dan janji Allah pasti akan ditepati. وَاللهُ أَشَدُّ بَأْسًا (Allah amat besar kekuatan) Yakni sangat kuat serangan-Nya dan sangat besar kekuasaan-Nya. وَأَشَدُّ تَنكِيلًا (dan amat keras siksaan(Nya)) Yakni siksaan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Maka berperanglah di jalan Allah wahai Nabi, kalaupun kamu hanya sendirian, karena kamu tidak dibebani kecuali atas dirimu sendiri. Kamu tidak ditanya tentang para sahabatmu. Dan himbaulah orang-orang mukmin untuk berperang. Mudah-mudahan Allah mendukung jihad kalian dengan menghancurkan dan menyulitkan orang-orang kafir. Perlu diketahui bahwa sesungguhnya kesulitan itu aslinya adalah perang. Dan Allah itu paling dahsyat azabNya, paling agung kekuatan dan kekuasaanNya, dan paling menyakitkan dalam menyiksa."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berperanglah di jalan Allah. Kamu tidak dibebani, kecuali dengan dirimu sendiri} tidak wajib pada tindakan selainmu dan tidak pula kamu salah karena itu {Kobarkanlah semangat orang-orang mukmin} semangatilah orang-orang mukmin untuk berperang {Semoga Allah} semoga Allah {menolak} menahan {serangan} kekuatan {orang-orang yang kafir itu. Allah sangat dahsyat kekuatanNya dan sangat keras siksaanNya} hukuman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Kondisi ini adalah kondisi terbaik bagi seorang hamba, yaitu ia bejuan dalam dirinya untuk melaksanakan perintah Allah berupa jihad ataupun lainnya, dan ia juga mendorong orang lain kepada hal tersebut, terkadang seorang hamba tidak berada pada kondisi itu atau hanya berada pada salah satunya, oleh karena itu Allah berfirman kepada Rasulnya, “maka berperanglah kamu pada jalan Allah, tidaklah kamu dibebani melainkan kewajiban kami sendiri ,” maksudnya, tidak ada kemampuan bagimu terhadap selain dirimu, maka tidaklah kamu di bebankan dengan perbuatan orang lain, “dan korbankanlah semangat para Mukmin untuk berperang,” yakni, untuk berjihad, hal ini mencakup segala hal yang mampu mengobarkan semangat kaum Mukminin dan kekuatan hati mereka berupa tindakan memperkuatlahir dan batin mereka, mengabarkan tetang kelemahan musuh dan kegagalan mereladan tentang janji yang di berikan oleh Allah bagi orang-orang yang berjihad berupa pahala, dan hal yang akan di terima oleh orang-orang yang tidak ikut serta dalam peperangan berupa siksaan, hal ini dan semacamnya termasuk dari tindakan untuk mengobarkan semangat untuk berjihad. “Mudah-mudahan Allah menolak serangan kaum kafir itu,” yaitu, dengan berperangnya kalian di jalan Allah dan pengobaran semangat dari sebagian semangat kalian kepada sebgaian lainnya, “dan Allah amat besar kekuatannya,” yaitu kemampuan dan kemiliaanya, “dana mat keras siksaNya,” terhadap seorang pelaku dosa pada dirinya sendiri, dan siksaanya terhadap selainnya dirinya. Sekiranya Allah menghendaki, niscaya Allah akan mengalahkan kaum kafir dengan kekuatanNya, dan tidak akan menyisakan mereka sedikit pun juga, akan tetapi diantara hikmahnyadengan sebagian lainnya, agar jihad itu terlaksana, dan agar tumbuh keimanan yang berguna yaitu keimanan atas dasar pilihan dan bukan keimanan paksaan atau tekanan yang tidak berguna sama sekali."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna Kata: {وَحَرِّضِ الْمُؤْمِنِينَ} wa harridhdhil mu’miniin: motivasilah mereka untuk berjihad dan semangatilah mereka untuk berperang. {بَأْسَ الَّذِينَ كَفَرُوا} ba’sal lazdiina kafaruu: kekuatan orang-orang kafir dalam berperang. {وَأَشَدُّ تَنْكِيلاً} wa asyaddu tankiilaa : paling kuat tankilnya. tankil adalah pukulan seorang yang zalim dengan kuatnya sampai dijadikan sebuah istilah karena miripnya, maka ditahan dari kezaliman. Makna Ayat: Kontek ayat masih dalam siasat perang, maka dalam ayat ini: {فَقَاتِلْ فِي سَبِيلِ اللهِ لا تُكَلَّفُ إِلا نَفْسَكَ وَحَرِّضِ الْمُؤْمِنِينَ} Allah memerintahkan kepada Rasul untuk berperang melawan kaum musyikin untuk meninggikan kalimat Allah dengan hanya Allahlah satu-satunya yang berhak disembah dan berhentinya penindasan dari kaum musyrikin. Ini adalah maksud dari firman Allah {فِي سَبِيلِ اللهِ} “di jalan Allah” dan firman Allah {لا تُكَلَّفُ إِلا نَفْسَكَ} tidaklah Allah akan membebanimu kecuali dirimu sendiri, adapun orang selainmu, maka itu bukan tanggung jawabmu. Tapi tetaplah beri semangat para mukminin untuk berperang bersama dirimu dan berilah motivasi kepada mereka. Firman Allah: {عَسَى اللهُ أَنْ يَكُفَّ بَأْسَ الَّذِينَ كَفَرُوا} “semoga Allah akan menahan kekuatan orang-orang kafir.” ini adalah janji Allah yang berupa menahan kekuatan orang kafir, maka Allah akan menguasakannya kepada Rasul dan kaum mukminin, kemudian mereka menghancurkan kekuatan kaum kafir, mengalahkannya dan tidak tersisa bagi orang-orang kafir kekuatan sedikitpun dan hal itu pernah terjadi. Puji syukur dan kasih adalah milik Allah. Dan Allah adalah {أَشَدُّ بَأْساً} “lebih dahsyat kekuatannya” dari setiap orang yang mempunyai kekuatan dan {وَأَشَدُّ تَنْكِيلاً} “leboh kuat menahan” dari selainnya bagi orang-orang zalim dari kalangan musuh-musuh-Nya. Ini adalah apa yang tunjukkan dari ayat yang 84. Pelajaran dari ayat : • Penjelasan tentang keberanian Nabi Muhammad dengan dalil bahwa beliau dibebani dengan perang seorang diri dan beliau pun malaksanakannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 84: Maka berperanglah di jalan Allah, tidak diberatkan atasmu me. lainkan dirimu, tetapi kerah kanlah Mu'minin, Allah orang-orang kafir, karena Allah itu terlebih sangat Gagah dan terlebih keras siksa-Nya yang menjadi eontoh. Mudah-mudahan menyingkirkan kegagahan Barang siapa menggenapi satu kegenapan yang baik, niscaya ada- lah baginya bahagian dari itu; dan barang siapa menggenapi satu kegenapan yang jahat, niscaya ada- lah baginya tanggungan dari itu, karena adalah Allah jadi Pengawal atas tiap-tiap suatu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Keadaan ini merupakan keadaan hamba yang paling utama, yakni seorang hamba mengusahakan dirinya untuk menjalankan perintah Allah, baik jihad maupun lainnya, serta mendorong yang lain untuk melakukannya. Namun terkadang seorang hamba ada yang tidak melakukan kedua-duanya atau hanya salah satunya. Yakni kamu tidak berkuasa apa-apa terhadap selain dirimu dan kamu tidak dibebani terhadap perbuatan selain kamu. Ayat ini berhubungan dengan keengganan sebagian besar kaum muslimin Madinah untuk ikut berperang bersama Nabi shallallahu 'alaihi wa sallam ke Badar Shughra. Maka turunlah ayat ini yang memerintahkan agar Beliau shallallahu 'alaihi wa sallam tetap berangkat meskipun sendiri saja dan tidak perlu memikirkan mereka. Allah pun menolak serangan orang-orang yang kafir dengan menaruh rasa takut di hati mereka dan Abu Sufyan sendiri enggan untuk keluar (kisah lebih luasnya sudah disebutkan dahulu dalam tafsir surat Ali Imran). Hal ini mencakup segala sesuatu yang dapat menyemangatkan kaum mukmin dan menguatkan hati mereka, seperti meneguhkan pendirian mereka dengan kata-kata dan nasehat, memberitahukan lemahnya musuh, menyampaikan janji Allah berupa pahala kepada para mujahid, akibat yang didapatkan bagi orang-orang yang tidak berperang, dsb. ini semua termasuk ke dalam menyemangatkan kaum muslimin untuk berperang. Dengan jihad fi sabilillah yang kalian lakukan dan penyemangatan satu dengan yang lain. Jika Allah Ta'ala menghendaki, tentu Dia akan mengalahkan orang-orang kafir dengan kekuatan-Nya dan tidak menyisakan mereka. Akan tetapi, karena hikmah (kebijaksanaan) Allah, Dia menguji sebagian hamba-Nya dengan yang lain agar tergak jihad fii sabilillah dan tercapai iman yang bermanfaat; yaitu iman atas dasar pilihan, bukan karena terpaksa yang tidak ada manfaatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 84",
    "description": "Maka berperanglah engkau, nabi Muhammad dan kaum muslim, di jalan Allah untuk menegakkan kebenaran dan keadilan, dan ingatlah bahwa engkau tidaklah dibebani melainkan atas kewajiban yang diletakkan pada dirimu sendiri. Kobarkanlah semangat orang-orang beriman untuk berperang di jalan Allah. Mudah-Mudahan Allah menolak dengan cara mematahkan serangan orang-orang yang kafir itu. Allah sangat besar kekuatan-Nya untuk mengalahkan para penentang agama Allah itu dan sangat keras siksaan-Nya bagi kedurhakaan orang-orang munafik itubarang siapa memberi pertolongan, kapan pun dan di mana pun, dengan sebuah pertolongan yang baik, niscaya dia akan memperoleh bagian pahala dari pahala orang yang mengerjakan-Nya. Dan barang siapa memberi pertolongan dengan sebuah pertolongan yang buruk, niscaya dia akan memikul bagian dosa dari dosa orang yang mengerjakannya. Allah mahakuasa atas segala sesuatu."
  }
]