[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa mengusahakan agar orang lain mendapatkan kebaikan,maka dia mendapatkan karena syafatnya tersebut bagian dari pahala. Dan barangsiapa berusaha kuat untuk menyebarkan keburukan kepada orang lain,niscaya dia mendapatkan bagian tanggungan kesalahan dan dosa.Dan allah atas segala sesuatu maha mengawasi lagi maha memelihara."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Barangsiapa yang memberikan bantuan kepada orang lain untuk melakukan kebajikan, ia akan mendapatkan bagian dari pahalanya. Dan barangsiapa yang memberikan bantuan kepada orang lain untuk melakukandosa, ia pun akan mendapatkan bagian dari dosanya. Allah Maha Menyaksikan semua yang dilakukan oleh manusia dan Dia akan memberikan balasan yang setimpal. Maka barangsiapa yang menjadi perantara dalam upaya untuk menghasilkan kebaikan, dia akan mendapatkan bagian darinya. Dan barangsiapa yang menjadi perantara dalam upaya untuk menghasilkan keburukan, ia pun akan mendapatkan bagian darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Barangsiapa yang mengusahakan suatu urusan yang membawa kebaikan berupa kemenangan kebenaran atas kebatilan, maka ia akan mendapat kebaikan berupa kemuliaan dan harta ghanimah di dunia dan pahala yang besar di akhirat dan barangsiapa yang mengusahakan keburukan maka ia akan mendapatkan dosa sesuai dengan akibat usaha dan niat yang dilakukannya. Dan Allah Maha Mengetahui dan Maha Melihat segala maksud hamba-hamba-Nya, dan Dia akan membalas mereka sesuai dengan maksud masing-masing."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. مَّن يَشْفَعْ شَفٰعَةً حَسَنَةً يَكُن لَّهُۥ نَصِيبٌ مِّنْهَا ۖ (Barangsiapa yang memberikan syafa’at yang baik, niscaya ia akan memperoleh bahagian (pahala) dari padanya) Yang dimaksud dengan pemberi syafa’at disini adalah orang yang menyuruh dan menganjurkan orang lain untuk mengerjakan suatu perintah. Adapun syafa’at yang baik adalah syafa’at dalam kebaikan dan ketaatan, maka berangsiapa yang menganjurkan untuk berbuat kebaikan agar mendapat manfaat maka baginya bagian pahala darinya. Dan barangsiapa yang menganjurkan untuk berbuat keburukan seperti menyebarkan aib orang lain maka baginya bagian dosa dari hal tersebut. وَكَانَ اللهُ عَلَىٰ كُلِّ شَىْءٍ مُّقِيتًا (Allah Maha Kuasa atas segala sesuatu) Yakni yang mngetahui tingkat perbuatan kalian lalu Dia kelak akan membalasnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kebaikan apapun, tatkala seseorang menghampirimu dan megucapkan salam kepadamu dengan wajah tersenyum, maka balas lah dengan senyuman, dan ketika ia datang tanya senyuman, maka tetaplah berikan senyumanmu, jadilah engkau manusia yang lebih baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Barangsiapa memberikan syafaat yang baik, maka dia akan mendapatkan bagian dari pahala syafaat tersebut. Dan syafaat yang baik adalah hak bagi orang muslim atau perlindungan dari keburukan atau kemudharatan. Dan barangsiapa memberikan syafaat buruk yaitu sesuatu yang menyebabkan kemudharatan atau penderitaan atau sesuatu yang mencegah haknya orang lain, maka dia akan menerima bagian dari dosa syafaat itu. Dan Allah itu Maha Mengawasi setiap sesuatu, dan mencatat semua amal, lalu akan membalas kalian atas amal tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapa saja yang memberi pertolongan yang baik maka baginya bagian darinya} dari pahalanya {Siapa saja yang memberi pertolongan yang buruk, maka baginya bagian dari itu} bagian dari dosanya {Allah Maha kuasa atas segala sesuatu} Bersaksi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Maksud dari syafaat di sini adalah bantuan atas suatu urusan, barangsiapa yang memberikan syafaat kepada orang lain dan melakukan suatu perkara dari perbuatan-perbuatan baik bersamanya, di antaranya adalah syafaat untuk orang-orang yang teraniaya kepada para pelaku kezhaliman, ia mendapat bagian pahala dari syafaatnya itu sesuai dengan usaha, perbuatan, dan nilai manfaatnya, dan tidaklah akan berkurang sedikit pun pahala orang yang langsung berkenaan dengannya. Dan barangsiapa yang menolong orang lain dalam suatu keburukan, maka dia mendapat bagian Dari dosa sesuai dengan apa yang ia lakukan dan apa yang ia bantu. Hal ini adalah sebuah anjuran yang besar untuk saling tolong menolong dalam dalam kebaikan dan takwa, dan ancaman yang keras dari tolong menolong dalam dosa dan kejahatan. Dan Allah menetapkan hal itu dalam FirmanNya, “Dan Allah Mahakuasa atas segala sesuatu” yaitu sebagai saksi, menyimpan, dan menghitung segala perbuatan-perbuatan tersebut, lalu membalas setiap perbuatan sesuai dengan haknya masing-masing."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : الشفاعة asy syafa’ah : perantara-perantara dalam kebaikan atau keburukan. Jikalau syafa’ah dalam kebaikan, maka itu adalah hal yang baik. Jika itu adalah berupa keburukan, maka itu adalah keburukan. {كِفْلٌ مِنْهَا} kiflun minhaa: bagian darinya. {مُقِيتاً} muqiita: sanggup melakukannya, sebagai saksi dan menjaganya. Makna ayat : Adapun ayat yan selanjutnya (85), yaitu firman Allah : {مَنْ يَشْفَعْ شَفَاعَةً حَسَنَةً يَكُنْ لَهُ نَصِيبٌ مِنْهَا وَمَنْ يَشْفَعْ شَفَاعَةً سَيِّئَةً يَكُنْ لَهُ كِفْلٌ مِنْهَا وَكَانَ اللهُ عَلَى كُلِّ شَيْءٍ مُقِيتاً} ini adalah kabar dari Allah yang mana siapa saja yang memberikan syafaat (perantara) perkara yang baik, dengan mengumpulkan suara bersama penuntut kebenaran, atau menyatukan diri ke pasukan perang untuk berjuang di jalan Allah. Atau menjadi perantara untuk seseorang dan menunaikan hajat kebutuhannya, maka sesungguhnya bagi orang yang menjadi syafi’ (perantara) tersebut adalah ganjaran dan pahala. Hal ini juga berlaku {وَمَنْ يَشْفَعْ شَفَاعَةً سَيِّئَةً} “dan barang siapa yang memberikan syafaat keburukan” dengan membantu kebatilan, menjadi perantara dalam melakukan hal jelek atau meninggalkan perkara yang makruf, maka bagi syafi’ mendapat bagian dari dosa. Karena Allah Maha sanggup untuk melakukan segalanya dan menahan mengawasinya. Ini adalah apa yang ditunjukkan oleh ayat yang telah disebutkan di atas. Pelajaran dari ayat : • Bukan keharusan bagi pemerintah adalah merekrut warga negara menjadi anggota pasukan perang dengan perekrutan secara paksa. Pemerintah hanya memotivasi dan mendorong rakyatnya untuk mengikuti perang. • Keutamaan syafaat dalam perkara kebaikan dan buruknya syafaat dalam perbuatan tercela."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 85: 85-89. Dan apabila kamu diberi hor- mat dengan satu penghormatan, maka hendaklah kamu (balas) beri hormat dengan (cara) yang terle- bih baik daripadanya, atau hendak- lah kamu balas dia, karena sesungguhnya Allah itu adalah Pengira atas tiap-tiap suatu. Allah itu tidak ada Tuhan melain kan Dia. Sesungguhnya la akan kumpulkan kamu ke hari akan Kiamat tidak ada syak padanya, karena siapakah yang terlebih benar omongannya daripada Allah? Maka mengapakah kamu dua golongan tentang kaum munafik itu, padahal Allah telah menjerumuskan- mereka dengan (sebab) apa yang mereka telah usahakan? Apakah kamu orang yang telah disesatkan oleh Allah, karena barang siapa disesatkan oleh Allah, maka tidak bakal engkau dapat baginya satu jalan? sebagaimana mereka kufur supaya kamu jadi sama. Lantaran itu, janganlah kamu ambil sahabat- sahabat dari mereka, hingga mereka berhijrah di jalan Allah. Tetapi jika mereka berpaling, maka tawanlah akan mereka dan bunuh saja mereka, dan janganlah kamu jadikan dari mereka seorang sahabat dan jangan seorang pembela mereka di mana-mana bertemu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Syafa'at (pertolongan) yang baik adalah setiap syafa'at yang ditujukan untuk melindungi hak seorang Muslim atau menghindarkannya dari suatu kemadharatan. Barang siapa yang memberikan syafaat yang baik kepada orang lain, misalnya membantunya agar dapat menjalankan kebaikan, maka ia akan memperoleh bagian pahalanya sesuai amalnya, bantuan yang diberikan dan manfaatnya, tanpa dikurangi sedikit pun. Sebaliknya, barang siapa yang membantu orang lain agar dapat melakukan keburukan, maka dia menanggung dosa sesuai bantuan yang diberikannya. Dalam ayat ini terdapat dorongan untuk tolong-menolong di atas kebaikan dan ketakwaan dan larangan tolong menolong di atas dosa dan permusuhan. Syafa'at yang buruk ialah kebalikan syafa'at yang baik. Ada yang mengartikan dengan arti, \"Allah Maha Menyaksikan, Menjaga dan Memperhitungkan segala sesuatu\", oleh karena itu, Dia akan membalas masing-masingnya secara layak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 85",
    "description": "Barang siapa memberi pertolongan, kapan pun dan di mana pun, dengan sebuah pertolongan yang baik, niscaya dia akan memperoleh bagian pahala dari pahala orang yang mengerjakan-Nya. Dan barang siapa memberi pertolongan dengan sebuah pertolongan yang buruk, niscaya dia akan memikul bagian dosa dari dosa orang yang mengerjakannya. Allah mahakuasa atas segala sesuatu. Dan apabila kamu dihormati oleh siapa saja dengan suatu salam penghormatan, baik dalam bentuk perbuatan atau perlakuan, maka balaslah dengan segera penghormatan itu dengan penghormatan yang lebih baik, atau balaslah penghormatan itu yang sepadan dengan penghormatan yang diberikan-Nya. Sungguh, Allah memperhitungkan segala sesuatu menyangkut cara dan kualitas penghormatan balasan yang telah diberikan. Jika kita perhatikan, ayat salam penghormatan ini terletak di tengahtengah ayat perang. Ini bisa bermaksud menunjukkan prinsip islam yang asasi yaitu salam yang bermakna keselamatan dan kedamaian. Ia melaksanakan perang hanya untuk menetapkan kedamaian dan keselamatan di muka bumi dengan makna yang luas dan menyeluruh."
  }
]