[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila seorang muslim mengucapkan salam kepada kalian,maka jawablah dia dengan balasan salam yang lebih utama dari ungkapan salam yang dia ucapkan,baik dari segi lafazh salamnya maupun keceriaan raut muka,atau jawablah dengan ungkapan yang serupa dengan ucapan salam yang diucapkannya.Dan masing-masing akan memperoleh pahala dan balasannya.Sesungguhnya allah akan memberikan balasan terhadap segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Apabila seseorang mengucapkan salam kepada kalian, jawablah salamnya dengan ucapan salam yang lebih baik dari salam yang diucapkannya kepada kalian. Atau jawablah dengan ucapan salam yang setara dengan apa yang diucapkannya. Tetapi menjawab ucapan salam dengan ucapan yang lebih baik tentu lebih utama. Sesungguhnya Allah mencatat amal perbuatan kalian dan akan memberikan balasan yang setimpal kepada setiap orang sesuai dengan amal perbuatannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. kemudian Allah mengajarkan orang-orang beriman cara dan adab-adab mengucapkan salam yang merupakan perbuatan baik yang menjadi sebab hubungan dan kedekatan dengan orang lain. Dia berfirman: Jika seorang muslim mengucapkan salam kepadamu,maka wajib bagimu untuk membalas salam itu dengan salam yang lebih baik atau salam yang serupa dengan salam yang diucapkannya. Membalas salam dengan salam yang lebih baik hukumnya sunnah, sedangkan membalas salam dengan salam yang serupa hukumnya wajib. Allah akan mengawasi amal perbuatan hamba-hamba-Nya, baik itu yang baik maupun yang buruk dan yang kecil maupun yang besar; kemudian Dia akan membalas mereka Sesuai dengan karunia, keadilan, dan kebijaksanaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَإِذَا حُيِّيتُم بِتَحِيَّةٍ (Apabila kamu diberi penghormatan dengan sesuatu penghormatan) Penghormatan disini adalah ucapan salam. Pendapat lain mengatakan yang dimaksud adalah do’a bagi orang yang bersin. Dan para sahabat Abu Hanifah berpendapat yang dimaksud adalah pemberian hadiah. فَحَيُّوا۟ بِأَحْسَنَ مِنْهَآ(maka balaslah penghormatan itu dengan yang lebih baik dari padanya) Yakni dengan memberi jawaban lebih dari apa yang dikatakan orang yang pertama memberi penghormatan. Apabila yang pertama mengatakan: assalamu’alaikum, maka yang menjawab mengatakan: wa’alaikum salam warahmatullah, sambil menambah sopan santun dan wajah yang cerah atau memperjelas suara. Adapun hukum memberi salam adalah sunnah yang dicintai, sedangkan menjawabnya dengan jawaban yang setara hukumnya wajib. أَوْ رُدُّوهَآ ۗ( atau balaslah penghormatan itu (dengan yang serupa)) Yakni paling tidak jawablah dengan jawaban yang serupa, dan tidak boleh kurang dari itu apalagi dengan tidak menjawabnya karena itu merupakan kewajiban. حَسِيبًا (memperhitungankan) Yakni memperhitungkan segala hal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Wahai orang-orang mukmin, ketika kalian diberi penghormatan, yaitu diberi salam, maka balaslah dengan penghormatan yang lebih baik, yaitu balaslah dengan salam yang lebih baik atau minimal membalas penghormatan yang sama. Sesungguhnya Allah menghisab setiap sesuatu dan akan membalas hal itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kalian dihormati} diakui {dengan suatu penghormatan, maka balaslah penghormatan itu dengan yang lebih baik daripada itu} maka balaslah dengan penghormatan yang lebih baik dari itu {atau balaslah itu} balaslah dengan sepadan {Sesungguhnya Allah Maha Memperhitungkan segala sesuatu} memperhitungkan dan membalas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Salam penghormatan adalah sebuah kata yang bersumber dari salah seorang dari dua orang yang bertemu dengan maksud penghormatan dan doa serta segala hal yang mengiringi ucapan tersebut berupa wajah yang berseri dan semisalnya. Dan bentuk salam yang paling tinggi adalah apa yang dijelaskan oleh syariat, baik sebagai permulaan maupun jawabannya. Allah memerintahkan kaum Mukminin bahwa bila mereka diberikan ucapan salam dengan salam apa pun, maka sepatutnya mereka membalasnya dengan yang lebih baik darinya, baik perkataan maupun wajah yang berseri, atau dengan yang sama persis dengannya. Pemahaman terbalik (mafhum al- Mukhalafah) dari hal tersebut adalah larangan dari tidak membalas sama sekali atau membalasnya namun lebih rendah darinya. Dari ayat ini dapat diambil juga sebuah dalil tentang anjuran memulai salam dan ucapan selamat dari dua aspek: Pertama, bahwasanya Allah memerintahkan untuk membalasnya dengan yang lebih baik atau sama persis dengannya, hal ini menuntut bahwa ucapan penghormatan itu sangat dianjurkan oleh syariat. Kedua, dapat disarikan dari kata kerja yang menunjukkan “lebih” atau “paling” yaitu kata lebih baik, di mana hal itu menunjukkan akan adanya keikutsertaan ucapan penghormatan dan balasannya dengan baik, sebagaimana dasarnya memang seperti itu. Ada pengecualian dari keumuman ayat yang mulia tersebut bagi orang yang memberikan penghormatan dengan suatu kondisi yang tidak diperintahkan, seperti memberikan salam kepada orang yang sedang membaca al-quran atau sedang mendengarkan khutbah atau seorang yang sedang shalat dan semacamnya, sesungguhnya dalam kondisi ini tidaklah dianjurkan untuk membalas salam tersebut, demikian juga dikecualikan dari ayat ini adalah orang yang telah diperintahkan oleh syariat untuk dijauhi dan tidak diberikan ucapan penghormatan, seperti seorang pelaku maksiat yang tidak bertaubat, yang mana orang tersebut akan tercegah dari kemaksiatannya dengan tindakan itu, maka, sesungguhnya orang seperti itu dihajr (dijauhi) tidak diberikan ucapan penghormatan dan ucapan penghormatan darinya tidaklah dibalas, yang demikian itu karena bertentangan dengan kemaslahatan yang lebih besar. Dan yang termasuk dalam membalas ucapan penghormatan adalah setiap ucapan penghormatan yang telah terbiasa diucapkan oleh suatu masyarakat, dan ucapan itu bukanlah suatu yang dilarang secara syariat, maka harus dibalas sepertinya atau lebih baik darinya. Kemudian Allah menjanjikan balasan (kebaikan) atas segala perbuatan baik dan mengancam segala perbuatan buruk dengan FirmanNya, “SEsungguhnya Allah memperhitungkan segala sesuatu,” Allah menyimpan segala perbuatan-perbuatan para hamba, yang baik maupun yang buruk, yang kecil maupun yang besar, kemudian Allah akan membalas mereka dengan apa yang ditetapkan oleh karunia, keadilan, dan hikmahNya yang terpuji."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {بِتَحِيَّةٍ} bitahiyyah: mengucapkan salam, dengan Assalamu’alaikum warahmatullahi wabarakatuh. {أَوْ رُدُّوهَا} au rudduu haa: membalasnya dengan mengucapkan wa’alaikumussalam. {حَسِيباً} hasiiba: menghitung amal dan memberikan imbalannya, baik ataupun buruk. Makna ayat : Adapun ayat yang terakhir (86), sesungguhnya Allah memerintahkan kepada para hamba-Nya yang beriman agar menjawab salam dengan salam yang lebih baik, jikalau tidak lebih baik, maka dijawab dengan semisalnya. Barang siapa berkata, “Assalamu’alaikum”, maka dijawab dengan “Wa’alaikumussalam warahmatullahi”. Jika ada yang berkata “Assalamu’alaikum warahmatullah wa barakatuh”, maka dijawab “Wa’alaikumussalam warahmatullahi wabarakatuh”. Dan firman Allah: : {إِنَّ اللهَ كَانَ عَلَى كُلِّ شَيْءٍ حَسِيباً} “Sesungguhnya Allah Maha Menghitung segala sesuatu” dalam firman ini ada ungkapan untuk menenangkan diri kaum mukminin, bahwa Allah akan memberikan pahala mereka dan membalas mereka atas perbuatan baik yang telah mereka lakukan. Pelajaran dari ayat : • Afirmasi disunahkannya mengucapkan salam dan wajibnya menjawabnya dengan yang lebih baik atau semisalnya. • Penetapan penjelasan apa yang ada dalam hadits tentang diberikannya seorang muslim sepuluh kebaikan dari Assalamu’alaikum, sepuluh kebaikan lagi dari warahmatullah, dan sepuluh lagi dari wabarakatuh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 86: 85-89. Dan apabila kamu diberi hor- mat dengan satu penghormatan, maka hendaklah kamu (balas) beri hormat dengan (cara) yang terle- bih baik daripadanya, atau hendak- lah kamu balas dia, karena sesungguhnya Allah itu adalah Pengira atas tiap-tiap suatu. Allah itu tidak ada Tuhan melain kan Dia. Sesungguhnya la akan kumpulkan kamu ke hari akan Kiamat tidak ada syak padanya, karena siapakah yang terlebih benar omongannya daripada Allah? Maka mengapakah kamu dua golongan tentang kaum munafik itu, padahal Allah telah menjerumuskan- mereka dengan (sebab) apa yang mereka telah usahakan? Apakah kamu orang yang telah disesatkan oleh Allah, karena barang siapa disesatkan oleh Allah, maka tidak bakal engkau dapat baginya satu jalan? sebagaimana mereka kufur supaya kamu jadi sama. Lantaran itu, janganlah kamu ambil sahabat- sahabat dari mereka, hingga mereka berhijrah di jalan Allah. Tetapi jika mereka berpaling, maka tawanlah akan mereka dan bunuh saja mereka, dan janganlah kamu jadikan dari mereka seorang sahabat dan jangan seorang pembela mereka di mana-mana bertemu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tahiyat atau penghormatan adalah lafaz yang diucapkan oleh salah seorang ketika bertemu dengan yang lain sebagai penghormatan dan doa, termasuk pula perkara lain yang terkait dengan lafaz itu berupa muka yang berseri-seri dsb. Tahiyat yang paling tinggi adalah tahiyat yang disebutkan syara', berupa ucapan salam yang dilakukan ketika memulai dan menjawab. Ayat di atas memerintahkan kita ketika diucapkan salam penghormatan untuk menjawab dengan yang lebih baik atau sepadan. Mafhum ayat di atas adalah larangan tidak menjawab sama sekali atau menjawab yang kurang (tidak sepadan). Termasuk menjawab salam penghormatan adalah menjawab segala ucapan penghormatan yang biasa diucapkan manusia, selama ucapan tersebut tidak terlarang secara syara' dan tidak melupakan atau mengganti ucapan salam. Misalnya diucapkan kepadamu \"As Salaamu 'alaikum\". Seperti \"Wa 'alaikumus salaam wa rahmatullah wa barakaatuh\". Yakni sampai \"Wa 'alaikumus salam\" saja, meskipun yang utama adalah menjawab lebih. Namun tidak dijawab salam dari orang kafir, ahli bid'ah, orang fasik (hal itu, karena yang demikian bertentangan dengan maslahat yang lebih besar), demikian pula tidak jawab orang yang mengucapkan salam kepada orang yang buang air, kepada orang yang berada di kamar mandi dan kepada orang yang sedang makan, bahkan makruh menjawabnya selain yang terakhir, yakni jika salamnya ditujukan kepada orang yang sedang makan, maka tidak makruh menjawabnya. Adapun salam dari orang kafir, jawabannya adalah \"Wa 'alaikum\" saja. Ayat di atas juga menunjukkan anjuran memulai salam, namun tidak ditujukan kepada orang yang sedang dalam keadaan yang tidak diperintahkan memberi salam, seperti ketika sibuk membaca Al Qur'an, mendengarkan khutbah, sedang shalat dsb. Oleh karena itu, Dia menjaga semua amalan hamba-Nya, yang baik maupun yang buruk, besar maupun kecil dan akan memberikan balasan terhadapnya sesuai yang dikehendaki oleh karunia-Nya, keadilan-Nya dan hukum-Nya yang terpuji."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 86",
    "description": "Dan apabila kamu dihormati oleh siapa saja dengan suatu salam penghormatan, baik dalam bentuk perbuatan atau perlakuan, maka balaslah dengan segera penghormatan itu dengan penghormatan yang lebih baik, atau balaslah penghormatan itu yang sepadan dengan penghormatan yang diberikan-Nya. Sungguh, Allah memperhitungkan segala sesuatu menyangkut cara dan kualitas penghormatan balasan yang telah diberikan. Jika kita perhatikan, ayat salam penghormatan ini terletak di tengahtengah ayat perang. Ini bisa bermaksud menunjukkan prinsip islam yang asasi yaitu salam yang bermakna keselamatan dan kedamaian. Ia melaksanakan perang hanya untuk menetapkan kedamaian dan keselamatan di muka bumi dengan makna yang luas dan menyeluruh orang-orang yang beriman dengan sesungguhnya pasti meyakini bahwa Allah adalah maha esa, tidak ada sekutu bagi-Nya dan tidak ada tuhan selain dia, tidak ada yang patut disembah kecuali dia. Oleh sebab itu, janganlah kaum muslim lalai berbakti dan mengabdi kepada-Nya, patuhlah terhadap perintah-perintah-Nya dan tinggalkanlah laranganlarangan-Nya, karena dia pasti akan mengumpulkan kamu pada hari kiamat. Tidak satu pun yang sanggup membangkitkan dan mengumpulkan kalian selain Allah, untuk mempertanggungjawabkan semua amal yang telah kalian lakukan. Hari itu merupakan hari yang tidak diragukan terjadinya. Pada hari itu tidak ada manfaat harta kekayaan dan anak-anak kalian untuk menjadi penolong bagi kalian, dari azab Allah. Yang akan aman dari azab Allah hanyalah orang-orang yang beramal saleh sewaktu berada di dunia. Oleh sebab itu, manusia harus percaya kepada firman Allah tentang kedatangan hari kiamat itu. Siapakah yang lebih dapat dipercaya ucapannya dan benar perkataan-Nya daripada Allah' ketahuilah bahwa informasi yang bukan berasal dari Allah tidak dapat dipastikan kebenarannya, karena berita-berita itu mengandung kemungkinan benar atau kemungkinan salah. Sedangkan informasi yang bersumber dari Allah pasti benar."
  }
]