[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah semata Dzat yang maha tunggal dengan hak uluhiyahNYA atas seluruh makhluk, Dia Sungguh Dia akan benar-benar mengumpulkan kalian pada hari kiamat yang tidak ada keraguan sediktpun padanya, untuk perhitungan amal perbuatan dan pembalasannya. Dan tidak ada seorangpun yang lebih benar ucapannya daripada Allah terkait apa-apa yang Dia beritahukan tentangnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Allah yang tiada tuhan yang berhak disembah selain Dia, benar-benar akan mengumpulkan kalian dari awal sampai akhir di hari Kiamat yang tidak ada keraguan terhadapnya, untuk membalas amal perbuatan kalian. Dan tidak ada yang lebih benar ucapannya daripada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Setelah Allah menyebutkan bahwa Dia akan membuat perhitungan atas segala sesuatu, kemudian Allah menjelaskan bahwa perhitungan itu akan ada pada hari kiamat. Dia berfirman: Dialah Allah, tiada Tuhan selain Dia, maka janganlah kalian lalai dari beribadah kepada-Nya yang dari ketaatan kepada perintah dan larangan-Nya, karena dalam hal itu tak dapat kebahagiaan bagi kalian dan ketenangan bagi jiwa dan akal kalian. Allah akan mengumpulkan kalian pada hari kiamat, yaitu hari yang tidak diragukan lagi kedatangannya dan tidak diragukan lagi bahwa pada hari itu akan terjadi pemberian balasan atas segala perbuatan. Tidak ada yang lebih benar perkataannya dari-Nya, sebab perkataan-Nya berdasarkan ilmu yang meliputi segala makhluk sehingga tidak mungkin perkataannya tidak benar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. لَيَجْمَعَنَّكُمْ (Sesungguhnya Dia akan mengumpulkan kamu) Yakni mengumpulkan kalian di padang mahsyar hingga hari perhitungan di hari kiamat. إِلَىٰ يَوْمِ الْقِيٰمَةِ (di hari kiamat) Yakni hari kebangkitan dari kubur. لَا رَيْبَ فِيهِ ۗ (yang tidak ada keraguan terjadinya) Yakni terjadinya hari kiamat tidak ada keraguan sedikitpun bagi orang yang memahami bukti-bukti dari Allah. وَمَنْ أَصْدَقُ مِنَ اللهِ حَدِيثًا (Dan siapakah orang yang lebih benar perkataan(nya) dari pada Allah) Yakni tidak ada orang yang lebih benar dalam berita-beritanya dan perkataan-perkataannya daripada Allah karena kekuasaan, kesempurnaan, dan keluasan ilmu-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara keindahan dan keunggulan bahasa al-qur'an ditunjukkan pada ayat ini : { وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا } \"Dan siapakah orang yang lebih benar perkataan(nya) dari pada Allah?\" ungkapan yang lebih indah jika dibandingkan dengan : لا أحد أصدق من الله حديثا \"tidak satupun yang lebih indah perkataannya selain Allah\" ; karena konteks ayat dalam bentuk pertanyaan adalah ibaratnya sebuah tantangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87 Allah, Tuhan Yang Maha Esa, Yang Maha Kuasa. Sesungguhnya Dia Yang akan mengumpulkan kalian untuk dihisab dan diberi balasan, dan membangkitkan kalian semua dari alam kubur pada hari kiamat, tidak ada keraguan atas kebenaran akan kedatangan hari itu bagi orang-orang yang memahami bukti-bukti dan penjelasan dari Allah. Tidak ada yang lebih benar melebihi perkataan dan penjelasan Allah karena sifat Maha Kuasa dan Maha Kaya-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah, tidak ada tuhan selain Dia. Sungguh Dia pasti mengumpulkan kalian pada hari kiamat yang tidak ada keraguan di dalamnya} tidak ada keraguan di dalamnya {Siapakah yang lebih benar} tidak ada yang lebih benar {perkataannya daripada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Allah mengabarkan tentang keesaanNya, dan bahwasanya tidak ada yang berhak disembah dan tidak ada yang berhak dituhankan kecuali Allah, karena kesempurnaanNya pada Dzat dan sifat-sifatNya, dank arena hanya Dia-lah yang Esa dalam penciptaan, pengaturan, memberi nikmat, yang lahir maupun yang batin, yang demikian itu menuntut adanya perintah untuk beribadah dan mendekatkan diri kepadaNya dengan segala bentuk penyembahan, karena memang hanya Dia-lah yang berhak untuk itu, dan Dia memberikan balasan kepada hamba-hambaNya yang telah melakukan peribadahan kepadaNya atau yang telah mereka tinggalkan darinya, oleh karena itu Allah bersumpah terhadap tempat pembalasan yang pasti terjadi, yaitu Hari KIamat dalam FirmanNya, “Dia akan mengumpulkan kamu” yaitu dari orang-orang terdahulu hingga orang-orang terakhir, pada tempat yang satu, pada “Hari KIamat, yang tidak ada keraguan terjadinya,” maksudnya, tidak ada kebimbangan dan tidak ada kerancuan dalam bentuk apa pun dengan adanya dalil logika maupun dalil dari wahyu (dalil sam’i). Adapun dalil logika yaitu apa yang kita saksikan berupa menghidupkan kembali bumi yang telah mati, terjadinya penciptaan pertama di mana penciptaan selanjutnya adalah lebih mudah, dan di antara hikmah yang memastikan bahwa Allah tidaklah menciptakan makhluk itu secara sia-sia adalah mereka hidup lalu meninggal. Adapun dalil sam’i yaitu kabar dari Dzat yang paling benar tentang hal tersebut, dan bahkan Dia bersumpah atas perkara itu, karena itulah Allah berfirman, “Dan siapakah orang yang lebih benar perkataan(nya) daripada Allah?” demikian juga Allah memerintahkan RasulNya agar bersumpah atasnya pada tempat lain dalam al-Quran, seperti Firman Allah, Orang-orang yang kafir mengatakan bahwa mereka sekali-kali tidak akan dibangkitkan. Katakanlah: \"Memang, demi Tuhanku, benar-benar kamu akan dibangkitkan, kemudian akan diberitakan kepadamu apa yang telah kamu kerjakan\". Yang demikian itu adalah mudah bagi Allah.(At-Taghabun:7). Dan FirmanNYa,\"dan siapa yang lebih benar dari Allah perkataannya\" Adalah sebuah pemberitahuan bahwa perkataanNya, kabar-kabarNya dan pembicaraan-pembicaraanNYa adalah pada tingkatan kebenaran tertinggi, bahkan yang tertinggi padanya, maka setiap perkataan yang diungkapkan tentang akidah, ilmu, dan perbuatan yang bertentangan dengan apa yang dikabarkan oleh Allah adalah batil, karena bertentangan dengan kabar yang benar dan yakin, dan tidaklah mungkin hal tersebut menjadi benar."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {لا إِلَهَ إِلا هُوَ} la ilaha illa huwa: tidak ada sesembahan yang berhak disembah kecuali Dia. Makna Ayat: Tatkala Allah menyebutkan ayat-ayat sebelum ini. Dialah Al Muqit dan Al Hasib, yaitu Maha Mampu untuk menghisab dan memberi balasannya. Allah mengabarkan bahwa Dia-lah adalah sesembahan yang paling berhak untuk disembah karena sifat rububiyyah-Nya kepada para makhluk-Nya. Dialah zat yang disembah secara benar yang mana Dia adalah Rabb, pencipta, pemberi rizki, pengatur dan di tangan-Nya lah segala sesuatunya kembali dan Dia adalah yang kelak akan mengumpulkan manusia pada hari yang tiada keraguan padanya, yaitu hari kiamat. Ini adalah apa yang ditunjukkan oleh ayat {اللهُ لا إِلَهَ إِلا هُوَ لَيَجْمَعَنَّكُمْ إِلَى يَوْمِ الْقِيَامَةِ لا رَيْبَ فِيهِ} “Sesungguhnya Dia akan mengumpulkan kamu di hari kiamat, yang tidak ada keraguan terjadinya”. Tatkala kabar ini mencakup kabar gembira dan ancaman, Allah memenuhi dengan hal itu seraya berfirman {وَمَنْ أَصْدَقُ مِنَ اللهِ حَدِيثاً} “dan siapakah yang paling benar perkataannya dari pada Allah.” Ya Allah, tiada lah yang paling benar selain Engkau. Pelajaran dari ayat : • Wajib mengesakan Allah dalam beribadah kepada-Nya. • Iman dengan adanya hari kebangkitan dan hari pembalasan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 87: 85-89. Dan apabila kamu diberi hor- mat dengan satu penghormatan, maka hendaklah kamu (balas) beri hormat dengan (cara) yang terle- bih baik daripadanya, atau hendak- lah kamu balas dia, karena sesungguhnya Allah itu adalah Pengira atas tiap-tiap suatu. Allah itu tidak ada Tuhan melain kan Dia. Sesungguhnya la akan kumpulkan kamu ke hari akan Kiamat tidak ada syak padanya, karena siapakah yang terlebih benar omongannya daripada Allah? Maka mengapakah kamu dua golongan tentang kaum munafik itu, padahal Allah telah menjerumuskan- mereka dengan (sebab) apa yang mereka telah usahakan? Apakah kamu orang yang telah disesatkan oleh Allah, karena barang siapa disesatkan oleh Allah, maka tidak bakal engkau dapat baginya satu jalan? sebagaimana mereka kufur supaya kamu jadi sama. Lantaran itu, janganlah kamu ambil sahabat- sahabat dari mereka, hingga mereka berhijrah di jalan Allah. Tetapi jika mereka berpaling, maka tawanlah akan mereka dan bunuh saja mereka, dan janganlah kamu jadikan dari mereka seorang sahabat dan jangan seorang pembela mereka di mana-mana bertemu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang keesaan-Nya dan bahwa tidak ada yang berhak disembah kecuali Dia karena kesempurnaan Diri-Nya, sifat-Nya dan karena Dia sendiri saja yang menciptakan dan mengatur serta memberikan nikmat baik nikmat yang nampak maupun yang tersembunyi. Ini semua menghendaki kita untuk beribadah hanya kepada-Nya dan mendekatkan diri kepada-Nya dengan berbagai bentuk ibadah, karena hanya Dia yang berhak untuk itu dan Dia pula yang memberikan balasan terhadap perbuatan yang dikerjakan hamba. Oleh karena itu, Dia bersumpah akan terjadinya pembalasan terhadap amal itu, yaitu pada hari kiamat, Dia berfirman, \"Dia pasti akan mengumpulkan kamu pada hari kiamat\" yakni Dia akan mengumpulkan generasi terdahulu sebelum kamu dan generasi yang datang kemudian setelah kamu di satu tempat. Yang tidak ada keraguan maupun syubhat dari berbagai sisi, di mana terjadinya hari kiamat adalah perkara yang didukung ole dalil 'aqli maupun dalil naqli. Dalil 'aqlinya adalah apa yang kita saksikan, seperti dihidupkannya bumi setelah matinya, diciptakannya makhluk dariu yang sebelumnya tidak ada, dan sudah pasti pembangkitan setelah matinya lebih ringan daripada menciptakan dari yang sebelumnya tidak ada, demikian juga berdasarkan hikmah (kebijaksanaan) Allah yang menetapkan bahwa Allah tidaklah menciptakan makhluk-Nya main-main, mereka hidup dan akan mati kemudian akan diberikan balasan. Sedangkan dalil naqlinya adalah pemberitaan dari yang paling benar ucapannya, bahkan Allah bersumpah terhadap kebenarannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 87",
    "description": "Orang-orang yang beriman dengan sesungguhnya pasti meyakini bahwa Allah adalah maha esa, tidak ada sekutu bagi-Nya dan tidak ada tuhan selain dia, tidak ada yang patut disembah kecuali dia. Oleh sebab itu, janganlah kaum muslim lalai berbakti dan mengabdi kepada-Nya, patuhlah terhadap perintah-perintah-Nya dan tinggalkanlah laranganlarangan-Nya, karena dia pasti akan mengumpulkan kamu pada hari kiamat. Tidak satu pun yang sanggup membangkitkan dan mengumpulkan kalian selain Allah, untuk mempertanggungjawabkan semua amal yang telah kalian lakukan. Hari itu merupakan hari yang tidak diragukan terjadinya. Pada hari itu tidak ada manfaat harta kekayaan dan anak-anak kalian untuk menjadi penolong bagi kalian, dari azab Allah. Yang akan aman dari azab Allah hanyalah orang-orang yang beramal saleh sewaktu berada di dunia. Oleh sebab itu, manusia harus percaya kepada firman Allah tentang kedatangan hari kiamat itu. Siapakah yang lebih dapat dipercaya ucapannya dan benar perkataan-Nya daripada Allah' ketahuilah bahwa informasi yang bukan berasal dari Allah tidak dapat dipastikan kebenarannya, karena berita-berita itu mengandung kemungkinan benar atau kemungkinan salah. Sedangkan informasi yang bersumber dari Allah pasti benar. Pada ayat-ayat yang lalu Allah telah menjelaskan sifat-sifat orangorang munafik maka pada ayat ini mengkritik sikap kaum muslim yang terpecah menjadi dua golongan dalam menyikapi orang-orang munafik. Maka mengapa kamu, wahai orang-orang mukmin, terpecah menjadi dua golongan dalam menghadapi orang-orang munafik' satu golongan membela orang-orang munafik; dan golongan yang lain memerangi mereka, padahal Allah telah mengembalikan mereka yakni memandang mereka telah kembali kafir disebabkan usaha mereka sendiri, dengan ucapan, sikap dan perilaku mereka. Apakah kamu, wahai orangorang beriman, bermaksud memberi petunjuk, yaitu menilai mereka orang-orang yang memperoleh petunjuk Allah atau menciptakan petunjuk kepada orang yang telah dibiarkan sesat oleh Allah karena keinginan mereka sendiri untuk sesat' barangsiapa dibiarkan sesat oleh Allah, seperti yang dialami oleh orang-orang munafik itu, kamu, wahai Muhammad, tidak akan mendapatkan jalan apa pun untuk memberi petunjuk baginya."
  }
]