[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kenapa kalian (wahai kaum Mukminin), terkait urusan orang-orang munafik ketika kalian berbeda pendapat menjadi dua golongan,satu golongan berpendapat untuk memerangi mereka dan golongan yang lain tidak berpendapat seperti itu? Dan allah telah menjerumuskan mereka kedalam kekafiran dan kesesatan disebabkan keburukan perbuatan amal mereka. Apakah kalian menginginkan memberi hidayah kepada orang yang telah Allah palingkan hati mereka dari agamaNYA?dan orang yang Allah lalaikan dari agamanya dan dari mengikuti apa yang DIa perintahkan kepadanya,maka tidak ada jalan baginya menuju hidayah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Ada apa dengan kalian, wahai orang-orang mukmin? Kalian terbelah menjadi dua golongan yang berselisih paham tentang cara memperlakukan orang-orang munafik. Satu golongan mengusulkan untuk memerangi mereka karena kekafiran mereka. Dan golongan yang lain mengusulkan untuk tidak memerangi mereka karena keimanan mereka. Mengapa kalian berselisih paham dalam menyikapi mereka? Sedangkan Allah telah mengembalikan status mereka kepada kekafiran dan kesesatan akibat perbuatan mereka. Apakah kalian hendak memberikan petunjuk kepada orang yang tidak mendapatkan bimbingan Allah menuju kebenaran?! Barangsiapa yang disesatkan oleh Allah, niscaya kalian tidak akan menemukan jalan untuk memberinya petunjuk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Allah mengolok-olok orang-orang yang ragu dalam mengkafirkan orang-orang munafik, sehingga mereka terbagi menjadi dua golongan; padahal tanda-tanda kekafiran mereka sangat jelas: Hai orang-orang yang beriman, Mengapa kalian terbagi menjadi dua golongan dalam menyikapi orang-orang munafik dan kalian saling berselisih tentang kekafiran mereka padahal tanda-tandanya tengah sangat jelas? Janganlah kalian ragu terhadap perkara mereka dan tegaslah menyikapi bahwa mereka telah kafir, dan Allah telah menyesatkan mereka dari jalan yang benar yang kalian tempuh akibat perbuatan syirik dan kemaksiatan yang mereka lakukan, sehingga kalian tidak akan mampu mengubah sunatullah yang berlaku pada jiwa manusia demi meraih tujuan yang berbeda dengan sikap dan sifat yang telah mendarah daging akibat amalan-amalan buruk yang telah mereka kerjakan sepanjang hidup mereka. dan barangsiapa yang telah ditetapkan untuk tersesat dari jalan yang benar maka Kamu tidak akan mendapatkan jalan baginya untuk mendapatkan petunjuk, sebab kebenaran hanya memiliki satu jalan yaitu jalan fitrah yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. فَمَا لَكُمْ فِى الْمُنٰفِقِينَ فِئَتَيْنِ (Maka mengapa kamu (terpecah) menjadi dua golongan dalam (menghadapi) orang-orang munafik) Dari Mujahid ia berkata: suatu ketika sekelompok orang dari penduduk Makkah mendatangi Rasulullah dan memberinya salam dengan tujuan memamerkan keimanan mereka, kemudian mereka kembali ke kaum mereka dan kembali kepada berhala-berhala mereka; mereka berharap dengan begitu mereka dapat mendapat keamanan di golongan orang-orang beriman dan di golongan orang-orang musyrik, maka Allah memerintahkan Rasulullah untuk memerangi mereka apabila mereka tidak membiarkan Rasulullah atau membuat perjanjian damai. Makna dari potongan ayat ini adalah mengapa kalian saling berselisih dalam urusan mereka hingga kalian terbagi dalam dua pendapat? وَاللهُ أَرْكَسَهُم بِمَا كَسَبُوٓا۟ ۚ (padahal Allah telah membalikkan mereka kepada kekafiran, disebabkan usaha mereka sendiri) Yakni mengembalikan mereka kedalam kekafiran dan membalikkan mereka. Makna dari (الركس) adalah menjadikan sesuatu menjadi terbalik atau membalikkan ujung sesuatu ke ujung yang lain. Dan makna dari potongan ayat ini adalah Allah membalikkan mereka karena pebuatan yang telah mereka lakuakan yaitu mereka kembali ke negeri yang kafir. أَتُرِيدُونَ أَن تَهْدُوا۟ مَنْ أَضَلَّ اللهُ ۖ (Apakah kamu bermaksud memberi petunjuk kepada orang-orang yang telah disesatkan Allah?) Ini adalah sebagai bentuk teguran dan celaan. Karena barangsiapa yang disesatkan Allah maka tidak akan bermanfaat petunjuk dari manusia."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُمْ بِمَا كَسَبُوا } Allah memberikan teguran kepada sahabat yang saling berselisih pada perkara yang sebagian dari mereka menguntungkan orang-orang munafiq; maka hindarilah oleh kalian perselisihan sesama saudara tetapi ada maksud mendukung dan menguntungkan orang munafiq."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88 Tidak dibenarkan ada suatu perbedaan dalam menghukumi orang-orang munafik. Menjauhi mereka dan sepakat atas pengingkaran mereka adalah suatu keharusan. Lalu mengapa kalian wahai orang-orang mukmin bisa terpecah menjadi dua golongan dalam menghadapi orang-orang munafik? Satu kelompok menjadikan orang-orang munafik sebagai teman sebab ketidaktahuan mereka sendiri atas orang-orang munafik, adapun satu kelompok lainnya menjauhi orang-orang munafik, dan itulah yang dikehendaki Allah. Maka Allah telah membalik mereka – secara tersirat - orang-orang munafik kepada kekafiran, dan membungkus mereka dengan pakaian itu tidak lain karena perbuatan mereka yang berkubang dalam kekufuran dan mereka berpaling dengan pengkhianatan. Apakah kamu bermaksud memberi petunjuk kepada orang-orang yang telah disesatkan Allah? Barangsiapa yang disesatkan Allah, sekali-kali kamu tidak akan bisa untuk memberi petunjuk kepadanya. Tidak ada seorangpun yang bisa mendapatkan jalan menuju keimanan. Ayat ini turun untuk suatu kaum yang telah berangkat menuju perang Uhud bersama Rasul, namun mereka lari dari perang. Dari itu orang-orang muslim berbeda cara dalam menghadapi mereka. Satu kelompok berkata: Kami akan membunuh mereka. Adapun kelompok lain mengatakan: Kami tidak akan membunuh mereka. Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa kalian dalam (menghadapi) orang-orang munafik menjadi dua golongan} Wahai orang-orang mukmin, mengapa urusan kalian membuat kalian menjadi dua kelompok yang bertentangan dalam menghadapi urusan orang-orang munafik {padahal Allah telah mengembalikan mereka} mengembalikan mereka pada kekufuran {karena apa yang mereka kerjakan. Apakah kalian bermaksud memberi petunjuk kepada orang yang telah dibiarkan sesat oleh Allah Siapa yang dibiarkan sesat oleh Allah maka kamu tidak akan menemukan jalan baginya} jalan menuju hidayah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89. Yang dimaksud dengan orang-orang munafik yang disebutkan dalam ayat-ayat tersebut adalah orang-orang munafik yang menampakkan keislaman mereka namun mereka tidak berhijrah meninggalkan kekufuran mereka, dan sungguh ketika itu telah terjadi di antara para sahabat suatu kesimpangsiuran, di antara mereka merasa keberatan untuk membunuh orang-orang tersebut dan memutuskan ikatan mereka disebabkan oleh apa yang mereka tampakkan dari keimanan, dan sebagian lagi mengetahui kondisi orang-orang tersebut dari sinyal-sinyal perbuatan mereka lalu menetapkan kekufuran mereka, lalu Allah mengabarkan bahwasanya tidak sepatutnya kalian menjadi ragu tentang orang-orang tersebut dan janganlah kalian bimbang lagi, akan tetapi perkara mereka itu jelas dan tidak menyulitkan sama sekali, mereka telah berulang-ulang dan mereka sangat berharap dengan kondisi mereka itu akan kekufuran kalian dan agar kalian seperti mereka, lalu bila kalian telah membuktikan hal tersebut tentang mereka, “maka janganlah kamu jadikan di antara mereka penolong-penolong (mu)” hal ini menuntut agar tidak boleh mencintai mereka, karena pertemanan itu adalah cabang dari kecintaan, dan juga menuntut untuk membenci dan memusuhi mereka, karena larangan dari suatu hal adalah perintah kepada hal yang berlawanan dengannya, namun hal ini adalah suatu perkara yang bersifat sementara dengan hijrahnya mereka, dan bila mereka berhijrah, maka berlakulah atas mereka apa yang berlaku atas kaum Muslimin, sebagaimana Nabi memberlakukan hukum-hukum Islam terhadap orang-orang yang bersama dengan beliau dan ikut berhijrah dengan beliau, baik terhadap Mukmin yang hakiki maupun Mukmin yang lahirnya saja, akan tetapi bila mereka tidak berhijrah dan berpaling darinya, “maka tawan dan bunuhlah mereka di mana saja kamu menemui mereka” yaitu kapan pun dan di mana pun, ini adalah di antara dalil-dalil yang menunjukkan atas mansukhnya perang pada bulan-bulan haram sebagaimana menjadi pendapat sebagian besar para ulama, adapun orang-orang yang tidak sependapat berkata, “Ini adalah nash-nash yang mutlak yang harus dikaitkan dengan ikatan haram pada bulan-bulan haram.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {فِئَتَيْنِ} fi’atain: dua kelompok. {أَرْكَسَهُمْ} arkasahum: irtikas adalah perubahan dari keadaan baik menjadi buruk, seperti kekafiran setelah adanya iman atau kelaliman setelah adanya keamanan, dan itu adalah maksud dari ayat ini. {سَبِيلاً} sabiila: jalan menuju hidayah Makna ayat : Adapun empat ayat yang berikutnya (88, 89, 90 dan 91) telah diturunkan karena sebab dan menyelasaikan permasalahan peperangan tertentu. Adapun perkara yang menyebabkan Ayat-ayat ini turun adalah perbedaan pendapat diantara para mukminin dari kalangan para sahabat mengenai para munafik yang menampakkan keIslaman dan sangat mahir dalam bersekongkol dengan orang-orang kafir. Mereka kadang juga di Mekah dan di Madinah. Sebagian sahabat memandang bahwa hendaknya bersikap tegas kepada mereka dan menghentikan kemunafikan mereka. Dan sebagian sahabat yang lain berpendapat untuk membiarkan mereka dan bersabar kepada mereka selama terus didengungkan kepada mereka untuk beriman, semoga mereka bertaubat dengan berlalunya hari. Tatkala kedua kelompok ini terus berselisih tentang bagaimana bersikap kepada orang-orang munafik dan semakin memanas perselisihan mereka, Allah menurunkan ayat-ayat ini {فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ وَاللهُ أَرْكَسَهُمْ1 بِمَا كَسَبُوا أَتُرِيدُونَ أَنْ تَهْدُوا مَنْ أَضَلَّ اللهُ وَمَنْ يُضْلِلِ اللهُ فَلَنْ تَجِدَ لَهُ سَبِيلاً} “Maka mengapa kamu (terpecah) menjadi dua golongan dalam (menghadapi) orang-orang munafik, padahal Allah telah membalikkan mereka kepada kekafiran, disebabkan usaha mereka sendiri ? Apakah kamu bermaksud memberi petunjuk kepada orang-orang yang telah disesatkan Allah? Barangsiapa yang disesatkan Allah, sekali-kali kamu tidak mendapatkan jalan (untuk memberi petunjuk) kepadanya.”, makna ayat ini adalah apakah yang membuat kalian menjadi dua kelompok dalam perkara kaum munafik? Dan Allah telah mengembalikan mereka kepada kekafiran karena perbuatan dosa-dosa besar mereka. Apakah kalian -kaum muslimin- ingin memberikan petunjuk kepada mereka yang telah disesatkan oleh Allah. Apakah seseorang sanggup seseorang memberikan hidayah kepada orang yang telah disesatkan oleh Allah. Bagaimana? Dan orang yang telah disesatkan Allah berdasarkan perbuatan-Nya dan menyesatkan manusia, tidaklah ada yang bisa memberikan petunjuk baginya, tiada jalan menuju hidayah Allah dalam berbagai kesempatan. Kemudian Allah mengabarkan tentang kepribadian para kaum munafik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 88: 85-89. Dan apabila kamu diberi hor- mat dengan satu penghormatan, maka hendaklah kamu (balas) beri hormat dengan (cara) yang terle- bih baik daripadanya, atau hendak- lah kamu balas dia, karena sesungguhnya Allah itu adalah Pengira atas tiap-tiap suatu. Allah itu tidak ada Tuhan melain kan Dia. Sesungguhnya la akan kumpulkan kamu ke hari akan Kiamat tidak ada syak padanya, karena siapakah yang terlebih benar omongannya daripada Allah? Maka mengapakah kamu dua golongan tentang kaum munafik itu, padahal Allah telah menjerumuskan- mereka dengan (sebab) apa yang mereka telah usahakan? Apakah kamu orang yang telah disesatkan oleh Allah, karena barang siapa disesatkan oleh Allah, maka tidak bakal engkau dapat baginya satu jalan? sebagaimana mereka kufur supaya kamu jadi sama. Lantaran itu, janganlah kamu ambil sahabat- sahabat dari mereka, hingga mereka berhijrah di jalan Allah. Tetapi jika mereka berpaling, maka tawanlah akan mereka dan bunuh saja mereka, dan janganlah kamu jadikan dari mereka seorang sahabat dan jangan seorang pembela mereka di mana-mana bertemu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Para mufassir berbeda pendapat tentang sebab turun ayat di atas, ada yang mengatakan bawa sebabnya adalah ketika kaum Rasulullah shallallahu 'alaihi wa sallam dan para sahabat berangkat ke gunung Uhud untuk berperang, maka kaum munafik memisahkan diri dari mereka, maka setelah mereka pulang dari Uhud, para sahabat berbeda pendapat dalam menyikapi kaum munafik itu. Sebagian mereka mengatakan, \"Kita bunuh saja mereka\", sedangkan yang lain berkata, \"Tidak.\" Maka turunlah ayat di atas. Rasulullah shallallahu 'alaihi wa sallam pun bersabda: « إِنَّهَا تَنْفِى الرِّجَالَ كَمَا تَنْفِى النَّارُ خَبَثَ الْحَدِيدِ » . \"Sesungguhnya Madinah akan menyingkirkan orang-orang (munafik) sebagaimana api membersihkan kotoran besi.\" (HR. Bukhari) Ada pula yang mengatakan, bahwa ayat ini turun berkenaan dengan beberapa orang Arab yang datang kepada Rasulullah shallallahu 'alaihi wa sallam di Madinah. Lalu mereka masuk Islam, kemudian mereka ditimpa demam Madinah, karena itu mereka kembali kafir lalu mereka keluar dari Madinah. kemudian mereka berjumpa dengan sahabat Nabi, lalu sahabat menanyakan sebab-sebab mereka meninggalkan Madinah. Mereka menerangkan bahwa mereka ditimpa demam Madinah. Para sahabat berkata, \"Mengapa kamu tidak mengambil teladan yang baik dari Rasulullah?\" Ketika itu para sahabat terbagi menjadi dua golongan dalam menyikapi hal ini. Sebagian sahabat berpendapat bahwa mereka telah menjadi munafik, sedangkan yang sebagian lagi berpendapat bahwa mereka masih Islam. lalu turunlah ayat ini yang mencela kaum muslimin karena menjadi dua golongan itu, dan memerintahkan supaya orang-orang Arab itu ditawan dan dibunuh, jika mereka tidak mau berhijrah ke Madinah, karena mereka disamakan dengan kaum musyrik yang lain, wallahu a'lam. Maksudnya golongan orang-orang mukmin yang membela orang-orang munafik dan golongan orang-orang mukmin yang memusuhi mereka. Terjadi kesamaran sikap di antara para sahabat tentang menyikapi orang-orang munafik, sebagian mereka merasa keberatan memerangi orang-orang munafik dan memutuskan persahabatan dengan mereka karena keimanan yang mereka tampakkan, sedangkan sahabat yang lain mengetahui keadaan mereka melihat qarinah (tanda) pada perbuatan mereka yang menunjukkan kemunafikan, sehingga sahabat yang lain tersebut menghukumi mereka kafir, maka pada ayat di atas Allah Subhaanahu wa Ta'aala memberitakan bahwa tidak sepatutnya bagi mereka merasa bingung menyikapi orang-orang munafik dan tidak perlu ragu, bahkan keadaan mereka sudah jelas, mereka adalah kaum munafik yang berkali-kali melakukan kekafiran, lebih dari itu, mereka juga menginginkan agar kaum muslimin menjadi kafir sehingga sama seperti mereka. Berupa melakukan kekekafiran dan kemaksiatan. Disesatkan Allah berarti, bahwa orang tersebut sesat karena keingkarannya dan tidak mau memahami petunjuk-petunjuk Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 88",
    "description": "Pada ayat-ayat yang lalu Allah telah menjelaskan sifat-sifat orangorang munafik maka pada ayat ini mengkritik sikap kaum muslim yang terpecah menjadi dua golongan dalam menyikapi orang-orang munafik. Maka mengapa kamu, wahai orang-orang mukmin, terpecah menjadi dua golongan dalam menghadapi orang-orang munafik' satu golongan membela orang-orang munafik; dan golongan yang lain memerangi mereka, padahal Allah telah mengembalikan mereka yakni memandang mereka telah kembali kafir disebabkan usaha mereka sendiri, dengan ucapan, sikap dan perilaku mereka. Apakah kamu, wahai orangorang beriman, bermaksud memberi petunjuk, yaitu menilai mereka orang-orang yang memperoleh petunjuk Allah atau menciptakan petunjuk kepada orang yang telah dibiarkan sesat oleh Allah karena keinginan mereka sendiri untuk sesat' barangsiapa dibiarkan sesat oleh Allah, seperti yang dialami oleh orang-orang munafik itu, kamu, wahai Muhammad, tidak akan mendapatkan jalan apa pun untuk memberi petunjuk baginyamereka ingin sekali, agar kamu menjadi kafir terus-menerus dan berkesinambungan sebagaimana mereka telah menjadi kafir sejak dahulu, sehingga kamu menjadi sama dengan mereka dalam kekafiran yang terus menerus dan berkesinambungan. Oleh sebab itu, janganlah kamu, wahai orang-orang beriman, menjadikan seorang pun dari antara mereka sebagai teman-teman-Mu, sebagai penolong dan pelindung bagi kalian, sebelum mereka beriman kepada Allah dan mewujudkan keimanan mereka dengan berpindah atau meninggalkan kekufuran dan berjihad di jalan Allah. Apabila mereka berpaling, yaitu enggan meninggalkan kekufuran mereka, maka tawanlah dengan menaklukkan mereka dan bahkan bunuhlah mereka di mana pun mereka kamu temukan, baik di mekah atau di tanah haram maupun di tempat-tempat lain, dan janganlah kamu jadikan seorang pun di antara mereka sebagai teman setia untuk dimintai nasihatnya, dan jangan pula kamu jadikan penolong untuk dimintai pertolongannya dalam menghadapi musuh-Musuh kalian. Pengertian ini menunjukkan larangan bagi orang-orang beriman menjalin hubungan baik dengan orang yang memusuhi islam dan kaum muslim."
  }
]