[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang munafik menginginkan kalian (wahai kaum Mukminin),untuk mengingkari hakikat yang telah diimani oleh hati kalian, sebagaimana mereka mengingkarinya dengan hati-hati mereka. Maka kalian bersama mereka dalam pengingkara, janganlah kalian mengangkat orang-orang dekat bagi kalian dari mereka sampai mereka mau berhijrah di jalan Allah sebagai bukti kebenaran keimanan mereka. Jika mereka berpaling dari perintah yang diserukan kepada mereka, maka tangkaplah mereka di mana pun mereka berada dan bunuhlah mereka.Dan janganlah kalian mengambil pelindung dari mereka selain allah dan jangan juga menjadikannya sebagai penolong yang kalian menggantungkan pertolongan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Orang-orang munafik itu menginginkan agar kalian ingkar kepada kitab suci yang diturunkan kepada kalian sebagaimana mereka ingkar kepadanya, supaya kalian sama dengan mereka dalam hal kekafiran. Maka janganlah kalian menjadikan mereka sebagai teman-teman setia mengingat sikap permusuhan mereka kepada kalian, sampai mereka mau berhijrah di jalan Allah sebagai bukti keimanan mereka. Jika mereka menolak dan terus mempertahankan sikap mereka, maka tangkaplah mereka dan bunuhlah mereka di mana pun kalian menemukan mereka. Dan janganlah kalian menjadikan mereka sebagai pemimpin yang mengurus kepentingan kalian, atau penolong yang membantu kalian dalam melawan musuh-musuh kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89. Setelah Allah mengabarkan tentang kesesatan mereka, kemudian Allah menggabarkan angan-angan yang ada dalam hati mereka, Dia berfirman: Mereka tidak puas dengan kesesatan yang telah mereka perbuat, namun mereka juga menginginkan agar kalian menjadi seperti mereka dan menempuh jalan yang mereka tempuh sehingga Islam dapat dihancurkan. Kalian mengharapkan agar mereka mendapatkan hidayah, namun mereka mengharapkan kalian menjadi kafir dan tersesat. Kemudian Allah memerintahkan untuk berlepas diri dari mereka dengan berfirman: Janganlah kalian jadikan mereka sebagai orang-orang yang menolong kalian dalam melawan orang-orang musyrik sampai mereka mau beriman dan berhijrah dan mengikuti kalian dalam segala urusan. Jika mereka enggan untuk berhijrah di jalan Allah dan tetap di tempat mereka di luar kota Madinah, maka tangkaplah mereka jika kalian mampu dan bunuhlah mereka dimanapun kalian temui, baik itu di dalam tanah haram maupun di luarnya. Dan janganlah kalian jadikan mereka orang yang mengurusi urusan-urusan penting kalian dan janganlah kalian jadikan mereka orang-orang yang menolong kalian dalam melawan musuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. وَدُّوا۟ لَوْ تَكْفُرُونَ كَمَا كَفَرُوا۟ (Mereka ingin supaya kamu menjadi kafir sebagaimana mereka telah menjadi kafir) Orang-orang munafik menginginkan agar orang-orang beriman menjadi kafir sebagaimana mereka kafir, dan mereka mengharapkan hal tersebut sebagai bentuk keras kapala, kekufuran mereka yang terlalu, dan kesesatan mereka yang berlarut-larut. فَتَكُونُونَ سَوَآءً ۖ( lalu kamu menjadi sama (dengan mereka)) Yakni sama-sama dalam kekufuran. فَلَا تَتَّخِذُوا۟ مِنْهُمْ أَوْلِيَآءَ(Maka janganlah kamu jadikan di antara mereka penolong-penolong(mu)) Yakni jangan kalian jadikan mereka penolong-penolong sampai mereka membuktikan keimanan mereka dengan berhijrah. فَإِن تَوَلَّوْا۟ (Maka jika mereka berpaling) Yakni berpaling dari hal itu. فَخُذُوهُمْ (maka tawanlah) Yakni jika kalian dapat melakukan itu. وَاقْتُلُوهُمْ حَيْثُ وَجَدتُّمُوهُمْ ۖ (dan bunuhlah mereka di mana saja kamu menemuinya) Yakni dimanapun berada. Dan hukum ini berlaku bagi orang-orang yang mengaku Islam kemudian kembali ke negeri kafir sebab kebebalan mereka, dan bukan bagi orang-orang munafik yang tinggal di Madinah bersama orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89 Mereka orang-orang munafik berharap supaya kamu menjadi kafir dan sesat, agar orang-orang mukmin menjadi kafir sebagaimana mereka telah kafir. Lalu kalian akan menjadi sama dengan mereka dalam kekufuran. Maka jangan kamu jadikan mereka sebagai penolong-penolongmu atau teman dekat kalian. Sampai mereka mau hijrah bersama orang-orang mukmin menuju Madinah. Maka jika mereka enggan untuk hijrah dan enggan untuk beriman dengan benar, maka tawan dan bunuhlah mereka di mana saja kamu menemuinya jika kalian mampu. Janganlah kamu jadikan seorangpun di antara mereka sebagai teman dekat atau pelindung."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka sangat menginginkan} berharap {agar kalian mau menjadi kafir sebagaimana mereka telah kafir sehingga kalian sama} kalian sama dalam kekufuran {Janganlah kalian jadikan siapa pun di antara mereka sebagai teman setia sebelum mereka berpindah pada jalan Allah. Jika mereka berpaling} berpaling dari ketauhidan dan hijrah{maka tawanlah} tawanlah mereka {dan bunuhlah mereka di mana pun kalian temukan mereka. Janganlah kalian jadikan seorang pun di antara mereka sebagai teman setia dan tidak pula sebagai penolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88-89. Yang dimaksud dengan orang-orang munafik yang disebutkan dalam ayat-ayat tersebut adalah orang-orang munafik yang menampakkan keislaman mereka namun mereka tidak berhijrah meninggalkan kekufuran mereka, dan sungguh ketika itu telah terjadi di antara para sahabat suatu kesimpangsiuran, di antara mereka merasa keberatan untuk membunuh orang-orang tersebut dan memutuskan ikatan mereka disebabkan oleh apa yang mereka tampakkan dari keimanan, dan sebagian lagi mengetahui kondisi orang-orang tersebut dari sinyal-sinyal perbuatan mereka lalu menetapkan kekufuran mereka, lalu Allah mengabarkan bahwasanya tidak sepatutnya kalian menjadi ragu tentang orang-orang tersebut dan janganlah kalian bimbang lagi, akan tetapi perkara mereka itu jelas dan tidak menyulitkan sama sekali, mereka telah berulang-ulang dan mereka sangat berharap dengan kondisi mereka itu akan kekufuran kalian dan agar kalian seperti mereka, lalu bila kalian telah membuktikan hal tersebut tentang mereka, “maka janganlah kamu jadikan di antara mereka penolong-penolong (mu)” hal ini menuntut agar tidak boleh mencintai mereka, karena pertemanan itu adalah cabang dari kecintaan, dan juga menuntut untuk membenci dan memusuhi mereka, karena larangan dari suatu hal adalah perintah kepada hal yang berlawanan dengannya, namun hal ini adalah suatu perkara yang bersifat sementara dengan hijrahnya mereka, dan bila mereka berhijrah, maka berlakulah atas mereka apa yang berlaku atas kaum Muslimin, sebagaimana Nabi memberlakukan hukum-hukum Islam terhadap orang-orang yang bersama dengan beliau dan ikut berhijrah dengan beliau, baik terhadap Mukmin yang hakiki maupun Mukmin yang lahirnya saja, akan tetapi bila mereka tidak berhijrah dan berpaling darinya, “maka tawan dan bunuhlah mereka di mana saja kamu menemui mereka” yaitu kapan pun dan di mana pun, ini adalah di antara dalil-dalil yang menunjukkan atas mansukhnya perang pada bulan-bulan haram sebagaimana menjadi pendapat sebagian besar para ulama, adapun orang-orang yang tidak sependapat berkata, “Ini adalah nash-nash yang mutlak yang harus dikaitkan dengan ikatan haram pada bulan-bulan haram.”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {وَلِيّاً وَلا نَصِيراً} waliyyan wa nashiiro: wali adalah orang yang mengurusi urusanmu, nashir adalah orang yang menolongmu dari musuh. Makna ayat : Kemudian Allah memberitahukan tentang kejiwaan orang-orang munafik yang berkebalikan dari dalam diri mereka dan Allah berfirman dalam ayat yang ke-3 (89) {وَدُّوا لَوْ تَكْفُرُونَ كَمَا كَفَرُوا فَتَكُونُونَ سَوَاءً} “Mereka suka jika kalian menjadi kafir seperti diri mereka yang telah menjadi kafir dan jadilah kalian sama dengan mereka.” yaitu dalam hati mereka suka kalau kalian kafir dan kalian menjadi semisal dengan mereka dan di dalamnya adalah suatu kelaziman yaitu hilangnya keislaman, munculnya kekafiran dan kemenangan kafir. Dari sinilah Allah berfirman sembari mengharamkan sikap loyal kepada orang-orang kafir sampai mereka berhijrah. Allah berfirman {فَلا تَتَّخِذُوا مِنْهُمْ أَوْلِيَاءَ} “janganlah kamu menjadikan mereka sebagai wali-wali” yang mana kalian mendukung mereka dalam kemenangan kalian terhadap saudara mereka sesama kafir. Zhohir dari konteks ayat ini adalah orang-orang munafik ini bereda di mereka dan demikianlah mereka di sana. Allah berfirman {حَتَّى يُهَاجِرُوا فِي سَبِيلِ اللهِ} “sampai mereka berhijrah di jalan Allah.” Karena hijrah ke madinah akan memutuskan hubungan mereka dengan negeri kafir, maka pupuslah niatan mereka dan akan meninstrospeksi kejujuran mereka dalam beriman, dan mereka akan beriman secara jujur. Jikalau mereka itu berhijrah dan berpaling dari keimanan yang shohih menuju kemunafikan yang kafir, maka tabuhlah genderang peperangan melawan mereka. Allah berfirman {فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ وَجَدْتُمُوهُمْ وَلا تَتَّخِذُوا مِنْهُمْ وَلِيّاً وَلا نَصِيراً} “maka hukumlah mereka, bunuh mereka dimanapun kalian menemukannya. Dan janganlah menjadikan dari mereka wali, tidak pula menjadi penolong.” karena mereka yang telah terjerumus, maka tidaklah ada kebaikan dalam diri mereka dan tidak ada dukungan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 89: 85-89. Dan apabila kamu diberi hor- mat dengan satu penghormatan, maka hendaklah kamu (balas) beri hormat dengan (cara) yang terle- bih baik daripadanya, atau hendak- lah kamu balas dia, karena sesungguhnya Allah itu adalah Pengira atas tiap-tiap suatu. Allah itu tidak ada Tuhan melain kan Dia. Sesungguhnya la akan kumpulkan kamu ke hari akan Kiamat tidak ada syak padanya, karena siapakah yang terlebih benar omongannya daripada Allah? Maka mengapakah kamu dua golongan tentang kaum munafik itu, padahal Allah telah menjerumuskan- mereka dengan (sebab) apa yang mereka telah usahakan? Apakah kamu orang yang telah disesatkan oleh Allah, karena barang siapa disesatkan oleh Allah, maka tidak bakal engkau dapat baginya satu jalan? sebagaimana mereka kufur supaya kamu jadi sama. Lantaran itu, janganlah kamu ambil sahabat- sahabat dari mereka, hingga mereka berhijrah di jalan Allah. Tetapi jika mereka berpaling, maka tawanlah akan mereka dan bunuh saja mereka, dan janganlah kamu jadikan dari mereka seorang sahabat dan jangan seorang pembela mereka di mana-mana bertemu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meskipun mereka menampakkan keimanan di luar. Ayat ini menunjukkan agar kita tidak mencintai mereka, karena berteman menunjukkan rasa cinta kepada mereka. Demikian juga menyuruh kita membenci mereka dan memusuhinya. Namun demikian, sikap ini (membenci dan memusuhi) ada batas waktunya, yaitu sampai mereka mau berhijrah. Jika mereka berhijrah, maka mereka diberlakukan seperti halnya kaum muslimin yang lain. Hal ini sebagaimana Nabi shallallahu 'alaihi wa sallam memberlakukan orang yang berada di sekelilingnya secara sama, baik kepada orang mukmin yang sesungguhnya atau hanya menampakkan keimanan di luar saja. Yang membuktikan keimanan mereka. Yakni jika mereka tidak mau berhijrah. Yakni di mana saja dan kapan saja. Ayat ini termasuk dalil yang menunjukkan sudah mansukhnya larangan berperang di bulan haram, dan inilah pendapat jumhur ulama. Namun ulama yang tidak setuju dengan pendapat jumhur berpendapat bahwa nash-nash tersebut masih mutlak dan dibatasi oleh larangan berperang di bulan haram. Untuk menghadapi musuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 89",
    "description": "Mereka ingin sekali, agar kamu menjadi kafir terus-menerus dan berkesinambungan sebagaimana mereka telah menjadi kafir sejak dahulu, sehingga kamu menjadi sama dengan mereka dalam kekafiran yang terus menerus dan berkesinambungan. Oleh sebab itu, janganlah kamu, wahai orang-orang beriman, menjadikan seorang pun dari antara mereka sebagai teman-teman-Mu, sebagai penolong dan pelindung bagi kalian, sebelum mereka beriman kepada Allah dan mewujudkan keimanan mereka dengan berpindah atau meninggalkan kekufuran dan berjihad di jalan Allah. Apabila mereka berpaling, yaitu enggan meninggalkan kekufuran mereka, maka tawanlah dengan menaklukkan mereka dan bahkan bunuhlah mereka di mana pun mereka kamu temukan, baik di mekah atau di tanah haram maupun di tempat-tempat lain, dan janganlah kamu jadikan seorang pun di antara mereka sebagai teman setia untuk dimintai nasihatnya, dan jangan pula kamu jadikan penolong untuk dimintai pertolongannya dalam menghadapi musuh-Musuh kalian. Pengertian ini menunjukkan larangan bagi orang-orang beriman menjalin hubungan baik dengan orang yang memusuhi islam dan kaum muslim semua boleh kamu tawan dan kamu bunuh kecuali orang-orang yang lari dan menghindar dari kamu serta meminta perlindungan kepada suatu kaum, yang antara kamu dan kaum itu telah ada perjanjian damai untuk tidak saling berperang atau memerangi, termasuk orang-orang yang meminta perlindungan kepada mereka, janganlah kalian tawan dan bunuh mereka atau juga orang yang datang kepadamu sedang hati mereka merasa keberatan untuk memerangi kamu dalam membela keyakinan mereka atau memerangi kaumnya dalam membela kamu atau bersimpati kepadamu, maka jangan pula kalian menawan dan membunuh mereka. Sekiranya Allah menghendaki, niscaya diberikan-Nya kekuasaan, kekuatan dan kemampuan kepada mereka dalam menyatukan mereka semuanya atau sebagiannya untuk menghadapi kamu, maka dengan demikian pastilah mereka memerangimu. Tetapi jika mereka membiarkan kamu untuk melaksanakan perintah-perintah agama kalian tanpa ada halangan dan gangguan dari mereka, dan tidak memerangimu serta menawarkan perdamaian kepadamu, yakni menyerah, maka al."
  }
]