[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan hendaklah takut orang-orang yang seandainya meninggal dan meninggalkan di belakang mereka anak-anak yang masih kecil-kecil atau lemah, yang mereka takutkan mengalami kezhaliman atau tak terurus, maka hendaknya mereka selalu merasa diawasi oleh Allah dalam memperlakukan orang yang berada di bawah tanggungannya dari anak-anak yatim dan anak-anak lainnya, yaitu dengan cara menjaga harta benda mereka, mendidik mereka dengan baik, dan menyingkirkan segala gangguan dari mereka dan hendaklah berkata kepada mereka dengan ucapan yang sejalan dengan semangat keadilan dan yang baik-baik."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan hendaklah merasa takut orang-orang yang sekiranya mereka mati dan meninggalkan anak-anak yang masih kecil lagi lemah serta dikhawatirkan akan terlantar. Maka seharusnya mereka bertakwa kepada Allah dalam mengurus anak-anak yatim yang berada di bawah perwaliannya dengan tidak menzalimi mereka, agar setelah mereka mati, Allah menyediakan orang yang mau berbuat baik kepada anak-anak mereka sebagaimana mereka berbuat baik kepada anak-anak yatim tersebut. Dan seharusnya mereka berbuat baik terhadap hak anak-anak dari orang yang mereka hadiri wasiatnya. Yaitu mengucapkan kata-kata yang tepat kepadanya agar ia tidak membuat wasiat yang menzalimi hak ahli warisnya setelah kematiannya, dan tidak menutup dirinya sendiri dari kebaikan dengan tidak membuat wasiat sama sekali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dan para pengasuh anak yatim dan pemilik harta yang banyak hendaklah takut jika mereka mati dengan meninggalkan anak-anak kecil yang tidak mampu membelanjakan harta dengan baik; takut mereka akan berbuat zalim dan mubazir. Hendaklah orang-orang yang memelihara anak yatim dan orang miskin takut kepada Allah, yaitu dengan menunaikan hak-hak orang yang mereka pelihara dan mengatakan kepada mereka perkataan yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَلْيَخْشَ الَّذِينَ لَوْ تَرَكُوا۟ مِنْ خَلْفِهِمْ ذُرِّيَّةً ضِعٰفًا خَافُوا۟ عَلَيْهِمْ (Dan hendaklah takut kepada Allah orang-orang yang seandainya meninggalkan dibelakang mereka anak-anak yang lemah, yang mereka khawatir terhadap (kesejahteraan) mereka) Kalimat ini ditujukan bagi para wali dan yang diwasiati untuk mengasuh anak yatim yang didalamnya terdapat nasehat bagi mereka agar memperlakukan anak yatim yang mereka asuh sebagaimana mereka memperlakukan anak-anak mereka yang khawatir akan kesejahteraan anak-anak mereka setelah mereka meninggal. وَلْيَقُولُوا۟ (dan hendaklah mereka mengucapkan) Yakni para wali mengucapkan kepada anak-anak yatim. Atau orang yang hadir saat sakaratul maut mengucapkan kepada orang yang akan meninggal tersebut. قَوْلًا سَدِيدًا (perkataan yang benar) Yakni yang sesuai dengan kebenaran dan keadilan, sebagaimana telah disebutkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Dan sebaiknya orang yang pemberi wasiat itu takut menzalimi anak-anak yatim, sebagaimana mereka mengkhawatirkan anak-anak mereka dizalimi setelah mereka tinggal mati. Sebaiknya para pemberi wasiat itu bersimpati dan memberi anak-anak yatim itu kasih sayang yang diberikan untuk anak-anak mereka sendiri. Sebaiknya juga mereka bertakwa kepada Allah dalam urusan itu dengan menjaga dan mengembangkan harta anak-anak yatim itu, serta berkata kepada mereka dengan perkataan yang benar, adil, dan lemah lembut seperti “wahai anakku” sehingga membuat mereka nyaman."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hendaklah merasa takut} merasa takut {orang-orang yang seandainya meninggalkan setelah mereka, keturunan yang lemah} anak-anak yang masih kecil {mereka khawatir terhadapnya. Maka sebaiknya bertakwalah kepada Allah dan berbicaralah dengan tutur kata yang benar} yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. sebuah pendapat berkata, dialog ini ditunjukan kepada orang yang menjenguk seseorang yang sedang sekarat dan ia berlaku berat sebelah dalam wasiatnya agar orang yang menjenguk itu memerintahkan kepadanya untuk adil dalam wasiatnya tersebut dan berlaku sama rata. Dengan dalil firman Allah ta'ala ”dan hendaklah mereka mengucapkan perkataan yang benar,” yaitu yang lurus dan sesuai dengan keadilan dan kebaikan, dan bahwasannya mereka memerintahkan orang yang hendak memberikan wasiat terhadap anak-anaknya dengan perkara seperti yang mereka sukai dalam bermuamalah terhadap anak-anak mereka setelah kematian mereka sendiri. Pendapat lain berkata, yang dimaksudkan dalam ayat itu adalah para wali orang-orang yang tidak mampu membelanjakan harta dengan baik dari orang gila, anak kecil, dan orang-orang leemah agar para wali itu bermuamalah terhadap mereka dalam hal-hal yang bermanfaat bagi mereka, baik agama maupun dunia mereka sebagaimana mereka menginginkan mereka bermuamalah terhadap orang-orang yang lemah yang datang setelah mereka dari keturunan mereka. “oleh sebab itu hendaklah mereka bertakwa kepada Alllah” dalam status mereka sebagai wali orang lain, artinya yang memperlakukan mereka dalam suasana takwa kepada Allah tanpa menghina mereka, mengurus mereka dengan baik, dan mengharuskan mereka agar bertakwa kepada Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : اﻟﺨﺸﻴﺔ: al Khasyah : rasa takut dalam keadaan aman {ﻗﻮﻻ ﺳﺪﻳﺪا} Qaulan sadida: perkataan adil dan benar Makna ayat : Adapun ayat ini {ﻭﻟﻴﺨﺶ اﻟﺬﻳﻦ ﻟﻮ ﺗﺮﻛﻮا ﻣﻦ ﺧﻠﻔﻬﻢ ﺫﺭﻳﺔ ﺿﻌﺎﻓﺎ ﺧﺎﻓﻮا ﻋﻠﻴﻬﻢ ﻓﻠﻴﺘﻘﻮا اﻟﻠﻪ ﻭﻟﻴﻘﻮﻟﻮا ﻗﻮﻻ ﺳﺪﻳﺪا} mencakup petunjuk Allah untuk seorang mukmin yang hadir ketika seorang menjelang wafatnya untuk tidak berbuat culas dengan memberikan wasiat kepada ahli waris, memberikan wasiat lebih dari sepertiga bagian atau menyebutkan hutang yang bukan tanggungannya dalam rangka untuk mengalangi mendapatkan warisan. {ﻭﻟﻴﺨﺶ اﻟﺬﻳﻦ ﻟﻮ ﺗﺮﻛﻮا ﻣﻦ ﺧﻠﻔﻬﻢ} Seharusnya seorang mukmin itu takut jikalau mereka mati dan meninggalkan setelah kematian mereka anak-anak keturunnya yang lemah sebagaimana mereka takut hal ini akan terjadi kepada anak-anak selain anak-anak mereka sendiri. Selayaknya mereka bertakwa kepada Allah dan bertakwa pula untuk menjaga hak-hak waris kepada selain anak mereka. Hendaknya orang-orang yang datang dan mendengarkan penyampainan wasiat si mayit berkata dengan perkataan yang benar, tidak nakal dan tidak curang. Ini adalah yang dikandung ayat sembilan. Pelajaran dari ayat : • Wajibnya memberikan arahan dan nasihat bagi orang yang menyaksikan penyampaian wasiat hingga tidak terjadi kecurangan. • Wajib bagi orang yang mengkhawatirkan anak-anaknya untuk berbuat lurus kepada anak-anak orang lain dan Allah yang mencukupi kebutuhan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 9: Dan hendaklah berhati-hati orang-orang yang jika meninggalkan di belakang mereka anak-anak yang lemah, mereka akan khawatir kecelakaan atas mereka. Lantaran itu, hendaklah mereka takut kepada Allah dan hendaklah mereka betul berkata perkataan yang tiada mengada-ngada."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengatakan, bahwa ayat ini ditujukan kepada mereka yang menghadiri seorang yang akan meninggal, namun ia (yang akan meninggal) menetapkan wasiat yang zalim, agar mengingatkannya; menyuruh berlaku adil dalam berwasiat, menyuruhnya jika hendak bersedekah agar di bawah sepertiga harta, menyisakan untuk ahli waris dan tidak meninggalkan ahli waris dalam keadaan miskin. Inilah maksud mengatakan perkataan yang benar (lihat akhir ayat tersebut). Ada pula yang mengatakan, bahwa ayat ini ditujukan kepada para wali terhadap orang-orang yang kurang akalnya baik orang gila, anak-anak maupun orang-orang yang lemah agar mereka menyikapi orang-orang yang lemah itu seperti sikap mereka terhadap anak-anak mereka sendiri. Menurut Ibnu Abbas, bahwa ayat ini berkenaan dengan seorang yang akan meninggal, lalu orang yang hadir mendengar orang yang akan meninggal itu berwasiat yang isinya memadharatkan ahli waris, maka Allah Ta'ala memerintahkan orang yang mendengarnya itu menyuruhnya bertakwa kepada Allah, mengarahkan dan meluruskannya kepada yang benar. Ia pun hendaknya memperhatikan ahli warisnya sebagaimana dirinya senang menyikapi ahli warisnya dengan sikap yang menunjukkan kekhawatiran akan terbengkalainya mereka (ahli waris). Yakni dalam mengurus orang lain, dengan cara mengurusnya sejalan dengan ketakwaan kepada Allah, tidak merendahkan mereka, tidak membiarkan mereka dan menyuruh mereka bertakwa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 9",
    "description": "Setelah menjelaskan anjuran berbagi sebagian dari harta warisan yang didapat kepada kerabat yang tidak mendapatkan bagian, ayat ini memberi anjuran untuk memperhatikan nasib anak-anak mereka apabila menjadi yatim. Dan hendaklah takut kepada Allah orang-orang yang sekiranya mereka meninggalkan keturunan di kemudian hari anakanak yang lemah dalam keadaan yatim yang belum mampu mandiri di belakang mereka yang mereka khawatir terhadap kesejahteraan-Nya lantaran mereka tidak terurus, lemah, dan hidup dalam kemiskinan. Oleh sebab itu, hendaklah mereka para wali bertakwa kepada Allah dengan mengindahkan perintah-Nya dan menjauhi larangan-Nya, dan hendaklah mereka berbicara dengan tutur kata yang benar, penuh perhatian dan kasih sayang terhadap anak-anak yatim dalam asuhannya ayat ini memperingatkan bahaya berlaku aniaya khususnya kepada anak yatim. Sesungguhnya orang-orang yang memakan harta anak yatim secara zalim tanpa alasan yang dibenarkan menurut agama, dan menggunakannya untuk kepentingan diri mereka sendiri secara berlebihan, maka dengan perbuatan tersebut sebenarnya mereka itu memakan makanan yang haram dan kotor ibarat menelan api dalam perutnya dan tindakan mereka akan mengantar mereka masuk ke dalam api yang menyala-Nyala yaitu neraka. Tempat itu diperuntukkan bagi orangorang yang celaka."
  }
]