[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi,orang-orang yang sampai kepada suatu kaum yang antara kalian dan mereka terdapat perjanjian dan perdamaian,maka janganlah memerangi mereka. Demikian pula orang-orang yang datang kepada kalian dalam keadaan hati mereka sesak dan mereka membenci harus memerangi kalian,sebagaimana merekapun membenci untuk memerangi kaum mereka sendiri, sehingga mereka tidak bersama kalian dan tidakpula bersama kaum mereka,maka janganlah kalian perangi mereka.Seandainya allah berkehendak,niscya Dia akan menjadikan mereka berkuasa atas diri kalian,lalu pastilah mereka memerangi kalian bersama dengan musuh kalian dari kalangan musyrikin.akan tetapi alalh memalingkan mereka dari kalian dengan karunia dan kuasaNYA.Maka jika mereka meninggalkan kalian dan tidak memerangi kalian,serta tunduk patuh kepada kalian dengan pasrah menyerahkan diri,maka tidak ada hak bagi kalian untuk memerangi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Kecuali sebagian dari mereka yang datang kepada kaum yang memiliki perjanjian kuat untuk tidak berperang melawan kalian. Atau mereka yang datang kepada kalian dalam kondisi gelisah, sehingga mereka tidak memiliki keinginan untuk menyerang kalian atau menyerang kaum mereka. Seandainya Allah berkehendak memberi mereka kemampuan untuk mengalahkan kalian, niscaya Dia akan memberi kemampuan untuk mengalahkan kalian, kemudian mereka memerangi kalian. Maka terimalah anugerah Allah yang telah membebaskan kalian dari serangan mereka. Dan janganlah kalian mengusik mereka dengan tindakan pembunuhan atau penawanan. Kemudian apabila mereka menjauhi kalian sehingga tidak memerangi kalian dan tunduk kepada kalian seraya berdamai dan tidak memerangi kalian, maka Allah tidak memberi kalian jalan untuk membunuh atau menawan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. kemudian Allah mengecualikan orang-orang munafik yang tipu daya mereka Tidak dianggap berbahaya, Dia berfirman: Kecuali orang-orang munafik yang memiliki hubungan dengan kaum yang memiliki perjanjian damai dengan kaum muslimin, sehingga orang-orang munafik tersebut masuk dalam perjanjian itu dan rela dengan aturan yang ada, mereka dilarang untuk diperangi. atau orang-orang munafik yang datang kepada kalian dengan hati yang tidak mau lagi memerangi kalian atau memerangi kaum mereka. Allah merahmati kalian dengan menahan keburukan dari dua kelompok ini dan menghalangi mereka untuk tidak memerangi kalian serta memasukkan rasa takut dalam hati mereka. seandainya Allah menghendaki niscaya mereka akan menguasai kalian dengan mengilhamkan kepada mereka berbagai pandangan dan mengirimkan berita-berita yang membuat mereka memilih untuk memerangi kalian. Jika salah satu dari dua golongan ini menjauh dan tidak memerangi kalian serta menawarkan perdamaian kepada kalian, maka tidak ada jalan bagi kalian untuk menzalimi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. إِلَّا الَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍۭ بَيْنَكُمْ وَبَيْنَهُم مِّيثٰقٌ (kecuali orang-orang yang meminta perlindungan kepada sesuatu kaum, yang antara kamu dan kaum itu telah ada perjanjian (damai)) Yakni kecuali orang-orang yang mempunyai hubungan dan berlindung pada kaum yang mempunyai perjanjian damai dengan kalian baik itu sebagai tetangga atau sekutu, maka janganlah kalian perangi mereka karena perjanjian itu mencakup diri mereka. Pendapat lain mengatakan yang dimaksud dengan hubungan disini adalah hubungan kekeluargaan. أَوْ جَآءُوكُمْ حَصِرَتْ صُدُورُهُمْ(atau orang-orang yang datang kepada kamu sedang hati mereka merasa keberatan) Yakni hati mereka meresa berat untuk berperang sehingga mereka tidak memerangi kalian dan tidak pula ikut perang bersamamu memerangi kaum mereka. Hati mereka merasa berat dan enggan untuk memerangi kedua kelompok tersebut. وَلَوْ شَآءَ اللهُ لَسَلَّطَهُمْ عَلَيْكُمْ (. Kalau Allah menghendaki, tentu Dia memberi kekuasaan kepada mereka terhadap kamu) Yakni sebagai cobaan dan ujian bagi kalian, atau sebagai penyaring keimanan kalian, atau juga sebagai hukuman atas dosa-dosa kalian. فَإِنِ اعْتَزَلُوكُمْ (tetapi jika mereka membiarkan kamu) Dan tidak mencoba untuk memerangi kalian. وَأَلْقَوْا۟ إِلَيْكُمُ السَّلَمَ (serta mengemukakan perdamaian kepadamu) Yakni mereka ingin untuk berdamai dan menghentikan peperangan dengan kalian dengan perjanjian yang mereka setujui degan kalian. فَمَا جَعَلَ اللهُ لَكُمْ عَلَيْهِمْ سَبِيلًا (maka Allah tidak memberi jalan bagimu (untuk menawan dan membunuh) mereka) Yakni maka tidak halal bagi kalian memerangi, menawan, atau mengambil harta mereka kerena sikap penyerahan diri ini melarang dan mengharamkan hal itu. Dan Allah melarang orang-orang beriman untuk memerangi kedua melompok ini, yaitu kelompok orang-orang yang berada dalam perjanjian sedang mereka berpegang teguh pada perjanjian itu, dan kelompok orang-orang yang menghentikan peperangan dan mengharapkan untuk membuat perjanjian damai antara mereka dan orang-orang beriman."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90 Namun janganlah kalian bunuh orang-orang yang antara kamu dan kaum itu telah ada perjanjian damai, sebab perjanjian itu telah meliputi mereka. Juga jangan kalian bunuh orang-orang yang datang kepada kalian dan hati mereka merasa keberatan untuk memerangi kalian serta ingin bertahan hidup sehingga mereka tidak memerangi kalian dan juga tidak akan berperang bersama kalian. Kalau Allah menghendaki, tentu Dia memberi kekuasaan kepada mereka untuk memerangi kalian sebagai ujian untuk kalian dan mereka akan mampu mengalahkan kalian bersama musuh-musuh para musyrikin. Tetapi dengan keutamaan dan rahmat-Nya Allah telah menahan mereka untuk tidak memerangi dan menyakiti kalian. Jika mereka membiarkan dan tidak memerangi kalian serta menghendaki perdamaian dengan jakuab maka Allah tidak mengizinkan kalian untuk menawan, membunuh maupun mengambil harta mereka. Ayat ini turun sebagaimana ayat sebelumnya yaitu untuk kaum yang datang ke Madinah dan mereka mengklaim bahwa mereka orang-orang yang hijrah kemudian setelah itu mereka membelot. Kemudian mereka kembali ke Makkah dengan membawa barang dagangan untuk berdagang di Makkah. Kemudian mereka menemui Hilal bin Uwaimir yaitu sekutu Nabi, dia adalah orang yang menahan diri untuk membunuh orang mukmin, sehingga mereka tidak jadi berperang dengan ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang-orang yang menjalin} menjalin hubungan dan meminta pertolongan {dengan suatu kaum di antara kalian dan mereka suatu ikatan} janji {atau mereka mendatangi kalian dan berat} sempit {hati mereka untuk memerangi kalian atau memerangi kaumnya. Seandainya Allah menghendaki, niscaya Dia berikan kekuasaan kepada mereka untuk menghadapi kalian, maka mereka akan memerangi kalian. Jika mereka membiarkan kalian, maka mereka tidak memerangi kalian, dan menawarkan kepada kalian perdamaian} menyerahkan diri dan tunduk untuk melakukan perdamaian {Allah tidak memberi jalan bagi kalian untuk mereka} jalan untuk membunuh dan memerangi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. Kemudian Allah mengecualikan dalam memerangi orang-orang munafik tersebut dengan tiga kelompok: Dua kelompok di antaranya diperintahkan secara tegas untuk tidak memerangi mereka. Kelompok pertama; orang yang sampai pada suatu kaum di mana antara mereka dengan kaum Mukminin ada perjanjian dan persetujuan untuk tidak saling berperang, lalu orang tersebut bergabung bersama mereka, hingga ketentuan untuknya adalah seperti ketentuan terhadap kaum tersebut bahwa darah dan hartanya terlindungi. Kelompok kedua: sebuah kaum, di mana “hati mereka merasa keberatan untuk memerangi kamu dan memerangi kaumnya” yaitu hati mereka tetap tidak sudi untuk memerangi kalian dan tidak juga memerangi kaum mereka dan mereka lebih suka untuk tidak memerangi kedua belah pihak, maka orang-oramg tersebut Allah perintahkan juga untuk tidak diperangi, lalu Allah menyebutkan hikmah dalam hal tersebut melalui FirmanNya, “Kalau Allah menghendaki, tentu Dia memberi kekuasaan kepada mereka terhadap kamu, lalu pastilah mereka memerangimu” karena sesungguhnya perkara-perkara yang mungkin terjadi ada tiga macam; mereka bersama kalian dan ikut"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {يَصِلُونَ} yashiluun: yang menghubungkan antara mereka dan konsekuensi perjanjian damai di antara mereka. {مِيثَاقٌ} mitsaq: perjanjian. {حَصِرَتْ صُدُورُهُمْ} hashirot shuduruhum: sempit dada mereka Makna ayat : Kemudian di ayat 90, Allah mengecualikan bagi mereka dua golongan dari kaum munafik yang telah disebutkan tadi, janganlah mengambil dari mereka budak-budak serta jagan memerangi mereka. Golongan pertamanya adalalah yang telah disebutkan dalam firman-Nya {إِلا الَّذِينَ يَصِلُونَ} “kecuali orang-orang yang menyambung” yaitu kembali {إِلَى قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِيثَاقٌ} “menuju kaum yang telah ada perjanjian diantara kamu dan kalian”, maka dengan hukum meminta pertolongan kepada mereka, memohon keamanan dari mereka, maka mereka akan mengamankan kalian sampai kalian tidak akan membatalkan perjanjiannya. Golongan yang selanjutnya adalah kaum yang sempit dadanya dengan berperangnya kalian dan perangnya kaum mereka. Mereka orang-orang yang tidak senang dengan perangnya kalian dan juga tidak senang dengan perangnya kaum mereka sendiri. Jikalau mereka meninggalkamu, maka mereka tidak akan berperang dengan kalian, janganlah kalian mengajak orang seperti mereka, jangan pula memerangi mereka. Bersabarlah menghadapi mereka. Karena jika Allah menghendaki, maka Allah akan menjadikan mereka berkuasa di atas kalian, maka mereka akan menyerang kalian. Ini adalah satu kelompok. Dan ini adalah makna dari firman Allah : {أَوْ جَاءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَنْ يُقَاتِلُوكُمْ أَوْ يُقَاتِلُوا قَوْمَهُمْ وَلَوْ شَاءَ اللهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ} “atau orang-orang yang datang kepada kamu sedang hati mereka merasa keberatan untuk memerangi kamu dan memerangi kaumnya. Kalau Allah menghendaki, tentu Dia memberi kekuasaan kepada mereka terhadap kamu, lalu pastilah mereka memerangimu.” Selama Allah masih menahan mereka dari mengganggu kalian, maka tahanlah diri kalian agar untuk tidak mengganggu mereka. Ini adalah makna dari Firman Allah {فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ} “tetapi jika mereka membiarkan kamu, dan tidak memerangi kamu serta mengemukakan perdamaian kepadamu”, yaitu perdamaian dan gencatan senjata. {فَمَا جَعَلَ اللهُ لَكُمْ عَلَيْهِمْ سَبِيلاً} “maka Allah tidak memberi jalan bagimu mereka.” untuk menawan dan membunuh mereka. Pelajaran dari ayat : • Bagian yang bijak ketika bergaul dengan para munafik sesuai dengan keadaan dan situasi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 90: Kecuali orang-orang sampai kepada satu kaum yang antara kamu dan antara mereka ada satu perjanjian, atau mereka datang kepada kamu, padahal sem- pit dada mereka buat memerangi kamu atau memerangi kaum mere- ka, padahal jika Allah kehen- daki, niscaya la jadikan mereka yang berkuasa melawan kamu, lalu memerangi kamu, Lantaran itu, jika mereka tinggalkan kamu, yaitu mereka tidak memerangi kamu dan mereka tawarkan kepada kamu perdamaian, maka Allah tidak jadikan satu jalan buat kamu atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kemudian Allah mengecualikan dari memerangi orang-orang munafik tiga golongan: Pertama, dua golongan yang kita diperintahkan membiarkan mereka; salah satunya adalah orang-orang yang meminta perlindungan kepada suatu kaum yang mengikat perjanjian dengan kaum muslimin, mereka bergabung dengan kaum itu sehingga mereka sama seperti kaum tesebut yang darah dan hartanya terpelihara. Kedua, orang-orang yang berat hati (merasa keberatan) untuk memerangi kamu atau memerangi kaumnya, mereka lebih suka untuk tidak memerangi kedua-duanya. Terhadap mereka, kita diperintahkan membiarkannya pula. Ketiga, orang-orang yang mengutamakan maslahat diri mereka, mereka ingin dapat hidup bersama kamu dan aman pula bersama kaumnya. Golongan yang ketiga ini disebutkan pada ayat selanjutnya (ayat 91 surat An Nisaa'). Golongan yang ketiga ini hampir mirip dengan golongan kedua, hanyasaja golongan kedua tidak memerangi kaum muslimin karena menghormati mereka dan bukan karena kekhawatiran terhadap diri mereka. Adapun golongan ketiga, mereka tidak memerangi kaum muslimin karena takut, bukan karena menghormati, jika sekiranya mereka mendapatkan kesempatan memerangi kaum muslimin, tentu mereka akan melakukannya, bahkan mereka menunggu kesempatan itu. Terhadap golongan ketiga ini, jika tidak nampak secara jelas bahwa mereka tidak memerangi kaum muslimin, maka mereka diperangi (lihat ayat 91). Ayat ini menjadi dasar hukum suaka. Tidak memihak dan telah mengadakan hubungan dengan kaum muslimin. Ada tiga pilihan bagi mereka, yaitu: - Mereka bersama kamu dan memerangi kaum mereka. Namun hal ini tentu berat dilakukan oleh mereka. - Mereka bersama musuh yang memerangi kamu. - Tidak memerangi kedua golongan yang ada, dan yang ketiga ini tentu lebih ringan bagi mereka dan yang mereka pilih. Allah mampu membuat mereka berkuasa terhadap kamu, tetapi Dia tidak menghendaki, bahkan Dia menaruh rasa takut di hati mereka kepada kamu. Oleh karena itu, terimalah penjagaan-Nya kepada kamu dan pujilah Tuhan kamu yang menahan tangan mereka dari memerangi kamu meskipun mereka mampu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 90",
    "description": "Semua boleh kamu tawan dan kamu bunuh kecuali orang-orang yang lari dan menghindar dari kamu serta meminta perlindungan kepada suatu kaum, yang antara kamu dan kaum itu telah ada perjanjian damai untuk tidak saling berperang atau memerangi, termasuk orang-orang yang meminta perlindungan kepada mereka, janganlah kalian tawan dan bunuh mereka atau juga orang yang datang kepadamu sedang hati mereka merasa keberatan untuk memerangi kamu dalam membela keyakinan mereka atau memerangi kaumnya dalam membela kamu atau bersimpati kepadamu, maka jangan pula kalian menawan dan membunuh mereka. Sekiranya Allah menghendaki, niscaya diberikan-Nya kekuasaan, kekuatan dan kemampuan kepada mereka dalam menyatukan mereka semuanya atau sebagiannya untuk menghadapi kamu, maka dengan demikian pastilah mereka memerangimu. Tetapi jika mereka membiarkan kamu untuk melaksanakan perintah-perintah agama kalian tanpa ada halangan dan gangguan dari mereka, dan tidak memerangimu serta menawarkan perdamaian kepadamu, yakni menyerah, maka al kelak dalam waktu yang tidak lama akan kamu dapati, wahai orangorang yang beriman, golongan-golongan yang lain dari golongan orang-orang munafik yang memiliki sifat-sifat yang berbeda dengan sifat-sifat orang munafik sebelumnya, yang ingin menyatakan keimanan kepada kalian, agar dengan demikian mereka akan hidup aman bersamamu, yakni tidak mendapat gangguan dan celaan dari kalian, dan aman pula bersama kaum mereka dengan menunjukkan kekufuran mereka kepada kaumnya apabila mereka kembali kepadanya. Setiap kali mereka diajak kembali kepada fitnah, yaitu syirik, kufur, kemaksiatan dan semacamnya, mereka pun terjun dan terlibat ke dalamnya serta mengerjakannya dengan sungguh-sungguh. Karena itu, jika mereka tidak membiarkan kamu agar kamu dapat mengerjakan tuntutan agamamu dengan tidak menghalangi kamu dan tidak mau menawarkan perdamaian kepadamu dengan membuat perjanjian damai dengan kamu dan tetap mengganggu kamu, serta tidak menahan tangan mereka dari memerangimu, maka tawanlah mereka dengan menaklukkan mereka dengan cara apa pun yang dapat kamu lakukan dan bunuhlah mereka di mana saja kamu temui, dan merekalah orang yang kami berikan kepadamu alasan yang nyata untuk memerangi, menawan dan membunuh mereka akibat pelanggaran dan pengkhianatan mereka. Menurut sebagian mufasir, kedurhakaan yang digambarkan oleh ayat 89 lebih ringan dari kedurhakaan yang digambarkan pada ayat ini. Karena itu, perintah membunuh pada ayat 91 ini lebih tegas dan lebih keras dari perintah membunuh pada ayat 89."
  }
]