[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kalian akan mendapati satu kaum lain dari kalangan orang-orang munafik,mereka menghendaki ketenangan bagi jiwa mereka disisi kalian,sehingga mereka menampakkan keimanan kepada kalian dan menginginkan ketenangan bagi jiwa mereka disisi kaum mereka yang kafir,sehingga mereka menampakkan kekafiran dihadapan mereka.Tiap kali mereka dikembalikan ketempat kekafiran dan orang-orang kafir,mereka terjerumus dalam keadaan yang paling buruk.Mereka itu bila tidak berpaling dari sisi kalian,dan tidak memberikan kepasrahan penuh kepada kalian dan tidak menahan diri mereka untuk memerangi kalian,maka tangkaplah mereka dengan sekuat tenaga dan bunuhlah mereka di manapun mereka berada.Dan orang-orang yang telah sampai dalam cara hidup yang buruk ini pada batasan yang membedakan mereka dengan orang lain,mereka itulah orang-orang yang kami menjadikan alasan nyata bagi kalian untuk membunuh dan menawan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Kalian -wahai orang-orang mukmin- akan menemukan golongan lain dari kalangan munafik yang memperlihatkan iman mereka kepada kalian untuk menyelamatkan diri mereka sendiri dan memperlihatkan kekafiran mereka kepada kaum mereka yang kafir ketika kembali ke tempat mereka untuk berdamai dengan mereka. Setiap kali mereka diajak kepada kekafiran atau kemusyrikan, justru mereka semakin menjadi. Apabila orang-orang seperti itu tidak mau berhenti memerangi kalian, lalu tidak tunduk kepada kalian seraya berdamai dengan kalian maupun berhenti mengganggu kalian, maka tangkaplah mereka dan bunuhlah mereka di mana pun kalian menemukan mereka. Untuk orang-orang semacam itu Kami berikan alasan yang jelas bagi kalian untuk menangkap dan membunuh mereka, karena kecurangan dan tipu daya mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. kemudian Allah menjelaskan dan mengolok-olok segolongan orang-orang munafik. Dia berfirman: mereka adalah segolongan orang yang tidak mendapatkan hidayah Islam namun tidak berani memerangi orang-orang Islam. mereka tidak termasuk orang-orang beriman dan tidak pula termasuk orang-orang kafir. Bagi mereka arwah mereka sangat mahal namun akal mereka murah. Mereka menampakkan diri kepada kedua golongan, golongan orang beriman dan golongan orang kafir, bahwa mereka merupakan bagian dari mereka. Setiap kali Mereka ingin merasa aman dari orang-orang beriman macam mereka akan menampakan keislaman atau membuat perjanjian damai dengan orang-orang beriman. Namun apabila orang-orang musyrik mengajak mereka untuk bersama-sama memerangi orang-orang beriman maka mereka akan segera berpindah haluan dan bergabung dengan orang-orang musyrik. Demikianlah mereka berbuat setiap kali, karena mereka telah lama hidup dengan sifat kemunafikan. Jika mereka tidak juga meninggalkan kalian dan tetap ikut campur urusan kalian, anggaran membuat perjanjian damai yang bermanfaat bagi kalian, dan tidak mau berhenti memerangi kalian bersama orang-orang musyrik, maka tangkaplah mereka dan bunuhlah mereka dimanapun kalian temui, karena tidak ada yang dapat menghentikan perbuatan mereka itu selain dengan cara ini sebagaimana pengalaman yang selama ini telah terjadi. Kami telah menjadikan bagi kalian hujjah dan alasan yang jelas untuk memerangi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. سَتَجِدُونَ ءَاخَرِينَ يُرِيدُونَ أَن يَأْمَنُوكُمْ وَيَأْمَنُوا۟ قَوْمَهُمْ (Kelak kamu akan dapati (golongan-golongan) yang lain, yang bermaksud supaya mereka aman dari pada kamu dan aman (pula) dari kaumnya) Yakni dengan menunjukkan kepada kalian keislaman dan menunjukkan kepada kaumnya kekafiran agar dapat merasa aman di dua kelompok. Dan mereka adalah penduduk Tihamah yang meminta keamanan dari Rasulullah agar bisa aman darinya dan dari kaumnya. كلما ردوا إلى الفتنة (setiap kali mereka diajak kembali kepada kemusyrikan) Yakni kaum mereka mengajak mereka untuk kembali kepada kemusyrikan dan meminta mereka untuk memerangi kaum muslimin. أُرْكِسُوا۟ فِيهَا ۚ (merekapun terjun kedalamnya) Yakni berbalik dan kembali kepada kaum mereka dan urusan mereka menjadi tidak jelas sehingga mereka kebingungan, apakah mereka akan memerangi kalian atau memerangi kaum mereka atau diam saja dan membiarkan keduanya. فَإِن لَّمْ يَعْتَزِلُوكُمْ وَيُلْقُوٓا۟ إِلَيْكُمُ السَّلَمَ (Karena itu jika mereka tidak membiarkan kamu dan (tidak) mau mengemukakan perdamaian kepadamu) Yakni memberi kalian perjanjian yang menenangkan hati kalian berupa ketidak-ikutsertaan mereka dalam memerangi kalian. وَيَكُفُّوٓا۟ أَيْدِيَهُمْ(serta (tidak) menahan tangan mereka) Dari memerangi kalian. فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ ۚ( maka tawanlah mereka dan bunuhlah mereka di mana saja kamu menemuinya) Yakni dimana saja kalian menemui mereka dan kalian mampu melakukannya. سُلْطٰنًا مُّبِينًا (alasan yang nyata) Yakni bukti yang jelas untuk mengalahkan mereka dan menguasai mereka sebab mereka sangat mudah kembali kepada kesyirikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91 Kelak kamu akan dapati golongan-golongan munafik lain, yang menampakkan keislaman mereka di depan kalian dan menampakkan kekufuran mereka di depan kaum mereka. Setiap mereka diajak kaum mereka untuk kembali kepada kesyirikan dan memerangi orang muslim, mereka pun mengikuti kaumnya dan berkubang dalam fitnah dan kekufuran yang lebih dalam. Karena itu jika mereka tetap memerangi kalian dan tidak mau mengemukakan perdamaian kepada kalian, serta tidak menahan diri mereka untuk memerangi kalian, maka tawanlah mereka dan bunuhlah mereka dimana pun kalian menemui mereka. Merekalah orang-orang munafik yang Kami berikan kepadamu alasan yang nyata untuk menawan dan membunuh mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kalian akan mendapati orang lain yang menginginkan agar mereka hidup aman bersama kalian} mereka menunjukkan kepada kalian bahwa mereka masuk Islam agar mereka aman di sisi kalian dengan itu {dan aman pula bersama kaumnya} mereka menunjukkan kepada mereka bahwa mereka kafir agar mereka aman di sisi mereka dengan itu {Setiap kali mereka diajak kembali kepada fitnah} mereka di ajak kembali kepada fitnah kemusyrikan {mereka pun terjerumus ke dalamnya} mereka jatuh terjerumus di dalamnya {Jika mereka tidak membiarkan kalian} mengabaikan untuk memerangi kalian{tidak pula mau menawarkan perdamaian kepada kalian, dan tidak menahan tangan mereka, maka tawanlah dan perangilah mereka di mana saja kalian menemukan mereka} mendapati mereka {Merekalah orang-orang yang Kami berikan kepada kalian alasan yang nyata atas mereka} alasan yang jelas untuk membunuh dan memerangi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. Kelompok ketiga: sebuah kaum yang menhendaki kemaslahatan bagi mereka sendiri, terlepas dari penghormatan kalian mereka itu adalah orang-orang yang Allah berfirman tentang mereka, :kelak kamu akan dapati golongan-golngan yang lain,” yaitu di antara orang –orang munafik tersebut, “yang bermaksud agar mereka semua aman dari pada kamu,” yaitu karena tukut kepada kalian, “dana man pula dari kaumnya. Setiap mereka di ajak kembali kepada fitnah, merekapun terjun ke dalamnya,” maksudnya mereka tetap selalu dalam kekufuran dan kenifakan mereka, mereka ini menurut gambaranya adalah seperti kelompok yang kedua, akan tetapi pada hakikatnya sangatlah berbeda, karena sesungguhnya kelompok yang kedua itu meninggalkan perang terhadap kaum Mukminin sebagai suatu penghirmatan kepada kaum Mukminin dan bukan karena tukut akan diri mereka, adapun kelompok ini, mereka meninggalkan perang tersebut karena takut dan bukan penghormatan, bahkan bila mereka mendapatkan kesempatan untuk memerangi kaum Mukminin, pastilah mereka akan memberanikan diri untuk memanfaatkan kesempatan tersebut. Maka meskipun tidak begitu jelas sikap mereka dalam membiarkandan tidak memerangi kaum Mukminin, akan tetapi mereka harus di perangi, karena itulah Allah berfirma, “karena itu jika mereka tidak membiarkan kamu dan tidak mau mengemukakan perdamaian kepadamu,” yaitu mengadakan kedamaian dan perjanjian, “serta tidak menahan tangan mereka dari memerangimu, maka tawakalah mereka dan bunuhlah mereka dan merekalah orang-orang yang kami berikan kepadamu alasan yang nyata untuk menawan dan membunuh mereka,” yaitu suatu alsan yang kuat dan jelas, karena mereka adalah orang-orang yang melampui batas dan berlaku zhalim terhadap kalian dan meningglkan perdamaian, maka janganlah mereka mencela kecuali diri mereka sendiri."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : {السَّلَمَ} as silm: menyerahkan diri dan tunduk {الْفِتْنَةِ} al fitnah: kesyirikan. {ثَقِفْتُمُوهُمْ} tsaqiftumuuhum: menemukan mereka dan menguasai mereka. {سُلْطَاناً مُبِيناً} sulthonan mubiina: alasan yang jelas atas bolehnya membunuh mereka. Makna ayat ; Dan ada kelompok lain, yang Allah sebutkan hukum bergaul dengan mereka di dalam ayat yang kelima (91) yaitu firman Allah: { ستجدون قوماً آخرين} “kalian akan menemukan dua kelompok yang lian” selain dua kelompok yang tadi {يُرِيدُونَ أَنْ يَأْمَنُوكُمْ وَيَأْمَنُوا قَوْمَهُمْ} “yang bermaksud supaya mereka aman dari pada kamu dan aman (pula) dari kaumnya.” Maka mereka sebenarnya sedang bermain di atas dua tali, seperti yang telah Allah sebutkan {كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ} “setiap kali mereka dikembalikan ke dalam fitnah” yaitu kersyirikan {أُرْكِسُوا فِيهَا} “terjerumus ke dalamnya” terjatuh dan terperosok ke dalamnya, karena mereka adalah orang-orang munafik. Saat mereka (orang munafik) bersama dirimu menyembah Allah semata. Kala mereka bersama kaumnya, menyembah para berhala untuk sekedar diajak, para munafik pun menyambutnya, dan mereka pun murtad menuju kesyirikan. Ini adalah makna dari firman Allah: {كُلَّ مَا رُدُّوا إِلَى الْفِتْنَةِ أُرْكِسُوا فِيهَا} “Setiap kali mereka kembali, mereka terperosok” Dan firman Allah {فَإِنِ اعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْا إِلَيْكُمُ السَّلَمَ} “Karena itu jika mereka tidak membiarkan kamu dan (tidak) mau mengemukakan perdamaian kepadamu”, maksudnya adalah tidak menghentikan penyerangan kepadamu dan mengemukakan perdamaian kepadamu, dan itu adalah kepatuhan dan ketundukan kepadamu dan menahan tangan mereka dari memerangi kalian, {فَخُذُوهُمْ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأُولَئِكُمْ جَعَلْنَا لَكُمْ عَلَيْهِمْ سُلْطَاناً مُبِيناً} “maka tawanlah mereka dan bunuhlah mereka dan merekalah orang-orang yang Kami berikan kepadamu alasan yang nyata (untuk menawan dan membunuh) mereka”, yaitu argumentasi yang gamblang atas bolehnya menawan mereka dan membunuh mereka selama kalian mampu untuk melakukannya terhadap mereka dalam segala keadaan. Ini adalah apa yang telah disebutkan dalam lima ayat di atas dengan maklumat bahwa menahan diri dari memerangi kaum musyrikin telah dianulir di dalam ayat-ayat yang ada dalam surat At Taubah, kecuali bahwasanya bagi pemimpin kaum muslimin boleh melakukan hal ini di saat diperlukan. Karena aturan Allah tidak akan membuat orang yang melaksanakan rugi ataupun celaka. Dan akan tetapi di luar jazirah Arab tidaklah layak untuk ada dua agama. Pelajaran dari ayat : • Adanya ketetapan bahwasanya terdapat anulir (naskh) di dalam Al Quran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 91: 91-92. Kamu akan dapati beberapa orang lain yang hendak supaya mereka aman daripada kamu dan aman daripada kaum mereka. Tiap-tiap kali mereka dikembalikan kepada fitnah, terjerumus mereka padanya. itu, jika mereka tidak tinggalkan kamu dan (tidak) menawarkan perdamaian kepada kamu, dan (tidak) memberhentikan tangan- tangan mereka, maka tawanlah mereka dan bunuhlah mereka di mana-mana kamu dapati mereka, karena mereka itu Kami telah jadikan bagi kamu kekuasaan yang nyata atas mereka yaitu boleh kamu tawan, bunuh dari musyrikin yang memerangi kamu, kecuali orang tua di antara mereka, dan tidak patut bagi seseorang Mu'min membunuh seorang Mu'min, melainkan dengan keliru; dan barang siapa bunuh seorang Mu'min dengan keliru, maka (wajib atasnya) memerdekakan seorang hamba yang Mu'min dan satu denda yang (wajib) diserahkannya kepada keluarga (si mati); kecuali jika mereka sedekahkan, tetapı jika adalah si (mati) itu dari satu kaum yang jadi musuh bagi kamu, padahal ia seorang Mu'min maka (wajib atas pembunuh itu) merdekakan seorang hamba Mu'min dan jika adalah dari satu kaum yang antara kamu dan antara mereka ada satu perjanjian, maka (wajib atas pembunuh itu) satu denda yang (mesti diserahkan) kepada keluarga (si mati) dan (wajib ia) merdekakan seorang hamba Mu'min; tetapi barangsiapa tidak dapat, maka (wajib atasnya) puasa dua bulan berturut-turut, sebagai (pemberian) taubat dari Allah, karena Allah itu Pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan menampakkan keimanan di hadapan kamu. Dengan kembali kafir ketika pulang ke kaumnya. Ada yang mengatakan, bahwa mereka ini adalah Bani Asad dan Bani Ghatfan. Yakni malah memerangi kamu. Karena mereka melampaui batas dan bersikap zalim kepadamu dan tidak mau berdamai."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 91",
    "description": "Kelak dalam waktu yang tidak lama akan kamu dapati, wahai orangorang yang beriman, golongan-golongan yang lain dari golongan orang-orang munafik yang memiliki sifat-sifat yang berbeda dengan sifat-sifat orang munafik sebelumnya, yang ingin menyatakan keimanan kepada kalian, agar dengan demikian mereka akan hidup aman bersamamu, yakni tidak mendapat gangguan dan celaan dari kalian, dan aman pula bersama kaum mereka dengan menunjukkan kekufuran mereka kepada kaumnya apabila mereka kembali kepadanya. Setiap kali mereka diajak kembali kepada fitnah, yaitu syirik, kufur, kemaksiatan dan semacamnya, mereka pun terjun dan terlibat ke dalamnya serta mengerjakannya dengan sungguh-sungguh. Karena itu, jika mereka tidak membiarkan kamu agar kamu dapat mengerjakan tuntutan agamamu dengan tidak menghalangi kamu dan tidak mau menawarkan perdamaian kepadamu dengan membuat perjanjian damai dengan kamu dan tetap mengganggu kamu, serta tidak menahan tangan mereka dari memerangimu, maka tawanlah mereka dengan menaklukkan mereka dengan cara apa pun yang dapat kamu lakukan dan bunuhlah mereka di mana saja kamu temui, dan merekalah orang yang kami berikan kepadamu alasan yang nyata untuk memerangi, menawan dan membunuh mereka akibat pelanggaran dan pengkhianatan mereka. Menurut sebagian mufasir, kedurhakaan yang digambarkan oleh ayat 89 lebih ringan dari kedurhakaan yang digambarkan pada ayat ini. Karena itu, perintah membunuh pada ayat 91 ini lebih tegas dan lebih keras dari perintah membunuh pada ayat 89. Dan tidak patut, bagi seorang mukmin membunuh seorang mukmin yang lain, kecuali terjadi karena tersalah dan tidak sengaja, sebab keimanan akan menghalangi mereka untuk berbuat demikian. Barang siapa membunuh seorang mukmin, kecil atau dewasa, laki-laki atau perempuan, karena tersalah, maka wajiblah dia memerdekakan atau membebaskan seorang hamba sahaya yang beriman, yakni membebaskannya dari sistem perbudakan walau dengan jalan menjual harta yang dimilikinya untuk pembebasannya serta membayar tebusan (diat) yang diserahkan dengan baik-baik dan tulus kepada keluarganya, yakni keluarga si terbunuh itu, kecuali jika mereka, keluarga si terbunuh memberikan maaf kepada si pembunuh dengan membebaskannya dari pembayaran itu. Jika dia, yakni si terbunuh, berasal dari kaum kafir yang memusuhimu padahal dia mukmin, maka yang diwajibkan kepada si pembunuh itu hanyalah memerdekakan hamba sahaya yang beriman, tidak disertai tebusan. Dan jika dia, si terbunuh, adalah kafir dari kaum kafir yang ada, yakni memiliki perjanjian damai dan tidak saling menyerang antara mereka dengan kamu, maka wajiblah bagi si pembunuh itu membayar tebusan yang diserahkan dengan baik-baik dan tulus kepada keluarganya si terbunuh akibat adanya perjanjian itu serta diwajibkan pula memerdekakan hamba sahaya yang beriman. Barang siapa tidak mendapatkan hamba sahaya yang disebabkan karena tidak menemukannya, padahal kemampuannya ada atau karena tidak memiliki kemampuan materi untuk membebaskannya, maka hendaklah dia, si pembunuh, berpuasa selama dua bulan berturut-turut sebagai gantinya. Allah mensyariatkan hal demikian kepada kalian sebagai tobat kalian kepada Allah. Dan Allah maha mengetahui segala yang kalian lakukan, mahabijaksana untuk menetapkan hukum dan hukuman bagi kalian."
  }
]