[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada hak bagi seorang mukmin untuk berbuat melampaui batas kepada saudaranya yang mukmin dan membunuhnya tanpa hak, kecuali kejadian itu terjadi pada dirinya dalam bentuk kesalahan yang tidak ada unsur kesengajaan di dalamnya. Barangsiapa mengalami kesalahan tersebut,maka menjadi kewajibannya untuk memerdekakan seorang budak mukmin dan menyerahkan diyat dengan nominal tertentu kepada ahli waris korban,kecuali mereka bersedia menyedekahkannya bagi pelaku dan meamaafkanya.Kemudian apabila korban yang terbunuh berasal dari orang-orang kafir yang memusuhi kaum Mukminin,sedang dia seorang yang beriman kepada allah dan kepada kebenaran yang diturunkanNYa kepada rasulNYA,Muhammad ,maka kewajiabn pelaku pembunuhan adalah memerdekakan seorang budak yang beriman. Dan apabila korban berasal dari kaum yang antara kalian dan mereka terjalin perjanjian dan hubungan politik, maka kewajiban si pembunuh adalah membayar diyat yang diserahkan kepada para keluarga korban dan memerdekakan seorang budak perempuan mukmin.Barangsiapa tidak mampu memerdekakkan seorang budak perempuan mukmin,maka dia wajib berpuasa selama dua bulan berturut-turut,agar allah berkenan menerima taubat dari nya.Dan allah Maha mengetahui hakikat urusan hamba-hambaNya,juga Maha bijaksana dalam ajaran yang disyariatkanNYa kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Orang mukmin tidak boleh membunuh mukmin lainnya kecuali terjadi secara tidak sengaja. Barangsiapa yang membunuh orang mukmin secara tidak sengaja, ia harus memerdekakan seorang budak yang mukmin sebagai kafarat atas perbuatannya. Dan kerabat si pembunuh yang menjadi ahli warisnya harus membayar diat yang diserahkan kepada ahli waris orang yang dibunuh. Kecuali bila mereka memaafkan, maka diat itu gugur. Jika orang yang dibunuh itu berasal dari kaum yang memerangi kalian tetapi ia seorang mukmin, maka si pembunuh wajib memerdekakan seorang budak yang beriman, dan tidak wajib membayar diat. Jika orang yang dibunuh itu tidak beriman tetapi berasal dari kaum yang memiliki perjanjian damai dengan kalian -seperti kafir zimi-, maka kerabat si pembunuh yang menjadi ahli warisnya wajib membayar diat kepada ahli waris orang yang dibunuh. Dan si pembunuh wajib memerdekakan budak yang beriman sebagai kafarat atas perbuatannya. Jika ia tidak menemukan budak yang akan dimerdekakan atau tidak mampu membayar harganya, maka ia wajib berpuasa selama dua bulan berturut-turut tanpa berbuka di tengah-tengah masa itu, agar Allah menerima taubatnya dari perbuatan tersebut. Dan Allah Maha Mengetahui perbuatan dan niat hamba-hamba-Nya, lagi Maha Bijaksana dalam menetapkan syariat-Nya dan mengatur urusan makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92. Setelah Allah menjelaskan hukum memerangi orang-orang munafik yang menampakan keislamannya untuk menipu orang-orang beriman dan menyembunyikan kekafiran mereka serta membantu orang-orang kafir dalam memerangi orang-orang beriman, serta menjelaskan hukum orang-orang yang membuat perjanjian damai dengan kaum muslimin serta perjanjian untuk saling menolong kemudian mereka mengingkari perjanjian itu dan menjadi penolong orang-orang kafir dalam memerangi kaum muslimin. Maka kemudian Allah menyebutkan disini hukum membunuh orang beriman yang haram untuk dibunuh, Allah berfirman: bukan sifat seorang mukmin membunuh mukmin lainnya, karena keimanannya akan menghalanginya berbuat dosa besar ini dengan sengaja, namun seorang mukmin mungkin saja melakukan itu tanpa disengaja. Maka jika hal itu terjadi maka kafaratnya adalah dengan membebaskan budak yang beriman, sebab setelah ia menghilangkan nyawa seorang mukmin maka ia harus membayar kafarat dengan membebaskan satu jiwa yang mukmin. Selain itu dia juga wajib membayar diyat kepada keluarga orang yang dibunuh, kecuali jika mereka memaafkannya dan rela tidak mengambil diyat itu. Sebab kewajiban membayar diyat itu tujuannya adalah untuk membuat hati mereka rela, sehingga tidak ada lagi permusuhan dan kebencian diantara keluarga orang yang terbunuh dan antara si pembunuh, serta untuk mengganti manfaat yang hilang akibat terbunuhnya orang itu. Dan apabila mereka telah memberi maaf maka itu menunjukkan bahwa hati mereka telah rela dan hal yang ditakutkan itu tidak lagi ada. Keluarga itu telah menjadi orang-orang yang mempunyai keutamaan terhadap si pembunuh. Namun jika orang yang terbunuh merupakan musuh kalian maka orang yang membunuh wajib membayar kafarat dengan membebaskan seorang budak yang beriman, namun ia tidak wajib membayar diyat untuk keluarganya sebab mereka merupakan musuh-musuh yang memerangi kaum muslimin, sehingga mereka tidak boleh diberi harta yang dapat membantu mereka untuk memerangi kaum muslimin.. Apabila ada seorang pembunuh yang tidak dapat membebaskan seorang budak sebagai kafarat maka wajib baginya untuk berpuasa selama 2 bulan Hijriyah secara berturut-turut. Apabila dia tidak berpuasa selama sehari dalam tempo 2 bulan tersebut tanpa ada alasannya yang dapat dibenarkan syariat maka ia wajib mengurangi puasa 2 bulan itu dari awal dan puasa-puasa yang telah ia lakukan sebelumnya tidak dianggap. Puasa ini sebagai bentuk pertobatan yang disyariatkan Allah bagi kalian, agar Allah mengampuni kalian dan mensucikan jiwa kalian dari kelalaian yang dapat menyebabkan terbunuhnya seseorang tanpa disengaja. Allah Maha Mengetahui jiwa manusia dan apa yang dapat mensucikannya dan Maha Bijaksana dalam menentukan hukum-hukum yang mengandung petunjuk dan hidayah bagi kalian menuju kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. وَمَا كَانَ لِمُؤْمِنٍ أَن يَقْتُلَ مُؤْمِنًا إِلَّا خَطَـًٔا ۚ (Dan tidak layak bagi seorang mukmin membunuh seorang mukmin (yang lain), kecuali karena tersalah (tidak sengaja)) Bentuk-bentuk pembunuhan karena tersalah sangat banyak, namun hal itu disatukan dalam satu kaidah yaitu tidak adanya maksud dan kesengajaan untuk membunuh. فَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ ((hendaklah) ia memerdekakan seorang hamba sahaya yang beriman) Yakni ia wajib untuk memerdekakan budak baik itu budak laki-laki yang beriman atau budak perempuan yang beriman; ia bebaskan sebagai kafarat atas pembunuhan yang ia lakukan tanpa sengaja. وَدِيَةٌ مُّسَلَّمَةٌ إِلَىٰٓ أَهْلِهِۦٓ (membayar diat yang diserahkan kepada keluarganya (si terbunuh itu)) Makna (دية) adalah harta dengan jumlah yang ditentukan syari’at yang diberikan kepada ahli waris orang yang dibunuh sebagai ganti atas darah yang ia tumpahkan. Makna (مسلمة) yakni yang dibayarkan dan ditunaikan. Dan yang dimaksud dengan (أهل) yaitu para ahli waris. Jenis-jenis diat dan penjelasannya secara terperinci telah dijelaskan dalam sunnah Rasulullah yang suci. Dan yang diwajibkan untuk membayar diat dalam masalah ini adalah oleh para keluarga pembunuh dan bukan oleh pembunuh. إِلَّآ أَن يَصَّدَّقُوا۟ ۚ (kecuali jika mereka (keluarga terbunuh) bersedekah) Yakni kecuali jika keluarga terbunuh menyedekahkan diat itu kepada keluarga pembunuh. Pemberian maaf ini disebut dengan sedekah sebagai bentuk dorongan untuk melakukannya. فَإِن كَانَ مِن قَوْمٍ عَدُوٍّ لَّكُمْ (apabila dia berada digolongan kaum yang merupakan musuhmu) Yakni orang-orang kafir harby (yang memerangi muslimin). Jadi orang yang dulunya ikut bersama orang-orang kafir memerangi orang-orang beriman lalu masuk Islam namun tidak berhijrah dan kemudian dibunuh oleh orang-orang beriman maka tidak diwajibkan membayar diyat atas pembunuhnya, akan tetapi wajib baginya memerdekakan budak beriman, karena orang yang beriman namun tidak berhijrah maka kehormatannya berkurang. وَإِن كَانَ (Jika ia) Yakni orang islam yang terbunuh itu. مِن قَوْمٍۭ (dari kaum (kafir)) Yakni dari golongan orang-orang kafir. بَيْنَكُمْ وَبَيْنَهُم مِّيثٰقٌ (yang ada perjanjian (damai) antara mereka dengan kamu) Baik itu perjanjian sementara atau selamanya. فَدِيَةٌ مُّسَلَّمَةٌ إِلَىٰٓ أَهْلِهِۦ (maka membayar diat yang diserahkan kepada keluarganya (si terbunuh)) Yakni maka atas keluarga pembunuh membayar diyat kepada keluarga (ahli waris) terbunuh yang beragama Islam. وَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ ۖ (serta memerdekakan hamba sahaya yang beriman) Telah disebutkan penjelasannya sebelumnya. فَمَن لَّمْ يَجِدْ(Barangsiapa yang tidak memperolehnya) Yakni tidak memperoleh budak atau tidak mampu membeli budak. فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ(maka hendaklah ia (si pembunuh) berpuasa dua bulan berturut-turut) Yakni tidak menjadikan hari berbuka disiang hari diantara dua hari di hari-hari puasanya, dan apabila ia berbuka maka ia wajib mengulanginya dari awal. Adapun berbuka sebab halangan seperti haidh dan lainnya maka tidak wajib baginya untuk mengulangi. Namun terdapat perbedaan pendapat dalam masalah berbuka dikarenakan sakit. تَوْبَةً مِّنَ اللهِ (untuk penerimaan taubat dari pada Allah) Yakni Allah mensyari’atkan hal itu sebagai cara untuk menerima taubat kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92 Tidak patut seorang mukmin membunuh mukmin yang lain, kecuali karena tidak sengaja. Barangsiapa membunuh seorang mukmin karena tidak sengaja seperti melempar sesuatu sehingga mengenai seseorang hingga meninggal, maka hendaklah ia memerdekakan seorang hamba sahaya yang beriman sebagai penebus dari kesalahannya, serta membayar diyat yang diserahkan kepada keluarga ahli waris si terbunuh itu, kecuali jika ahli waris keluarga terbunuh bersedekah dengan memberi maaf kepada pembunuh dengan diyat atau separuhnya. Diyat adalah harta yang diberika sebagai ganti darah orang yang terbunuh untuk ahli warisnya. Jika si terbunuh dari golongan kaum kafir yang memerangi orang Islam, namun dia beriman, sebab telah masuk Islam namun belum hijrah maka tidak ada diyat untuk si pembunuh. Namun dia tetap wajib memerdekakan hamba sahaya yang beriman. Sebab keharamannya adalah sedikit dan agar orang-orang kafir tidak semakin kuat dengan pembayaran diyat yang kita lakukan. Namun jika si terbunuh adalah orang kafir yang sudah ada perjanjian damai dengan kalian, dan dia beriman maka wajib membayar diat untuk ahli warisnya, dan juga wajib memerdekakan hamba sahaya yang beriman. Barangsiapa yang tidak memperoleh seorang hamba sahaya, atau harta untuk membayar diyat maka hendaklah si pembunuh berpuasa dua bulan berturut-turut tanpa jeda sebagai pengganti pembayaran diyat. Namun jika tiba-tiba berbuka tanpa ada udzur wajib bagi dia untuk mengulangi puasa lagi sejak hari pertama. Udzur di sini seperti haid dan sebagainya. Semua ini disyariatkan untuk kemurahan dan kemudahan penerimaan taubat dari pada Allah bagi si pembunuh yang tidak sengaja. Dan adalah Allah Maha Mengetahui atas kebaikan untuk hamba-Nya lagi Maha Bijaksana dalam segala perbuatan-Nya dan syariat-Nya. Abu Zaid berkata bahwa ayat ini turun untuk seorang laki-laki yang terbunuh oleh Abu Darda’. Orang itu sedang menggembala kambing, dan dia beriman. Dia terbunuh, kemudian kambing-kambing itu diberi minum kepada Rasulullah. Qasim berkata bahwa ayat ini turun ketika ‘Iyash bin Rabiah Al Makhzumi membunuh Haris bin Zaid sahabat yang sangat dicintai Nabi, kemudian dia mendatangi Rasul dan ingin masuk Islam, sedang Iyash tidak sengaja hingga Haris bin Zaid terbunuh."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak patut} tidak patut {bagi seorang mukmin untuk membunuh seorang mukmin, kecuali karena tidak sengaja. Siapa saja yang membunuh seorang mukmin karena tidak sengaja maka memerdekakan seorang hamba sahaya mukmin} maka dia harus membebaskan hamba sahaya mukmin sebagai kafarat {dan (membayar) tebusan yang diserahkan} dibayarkan dan diserahkan {kepada keluarganya} ahli waris orang yang terbunuh {kecuali jika mereka membebaskan pembayaran} membayar denda kepadanya lalu mereka memberi maaf dengan itu {Jika dia dari kaum yang menjadi musuh kalian, padahal dia orang beriman, maka memerdekakan hamba sahaya mukmin. Jika dia dari kaum yang ada perjanjian antara mereka dengan kalian} perjanjian, seperti perlindungan dan perdamaian {lalu membayar tebusan yang diserahkan kepada keluarganya serta memerdekakan hamba sahaya mukmin. Siapa saja yang tidak mendapatkan (hamba sahaya) maka hendaklah berpuasa dua bulan berturut-turut sebagai cara bertaubat dari Allah. Allah Maha Mengetahui lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92. Bentuk kalimat ini adalah merupakan bentuk kalimat penilakan, artinya tidak mungkin dan mustahil sekali seorang Mukmin yang dapat membunuh Mikmin lainya, maksudnya dengan di sengaja. Hal ini merupakan sebuah berita betapa haramnya pembunuhan tersebut, dan bahwa hal tersebut akan menghilangkan keimana dengan sebanar-benarnya, dan sesungguhnya hal itu hany di lakukan oleh orang kafir atau fasik yang imannya berkurang sangat banyak dan yang dikhawatirkan terjadi hal-hal yang lebih besar darinya, karena sesungguhnya membunuh saudaranya yang telah Allah ikat dengan saudaranya tersebut sebuah ikatan persaudaraan karena iman yang menuntutagar ia mencintai saudaranya itu, menolongnya dan menghilangkan segala hal yang membahayakannya berupa gangguan; dan gangguan apalagi yang paling besar dari pembunuhan? Hal ini di benarkan oleh sabda Nabi: “janganlah kalian kembali kepada kekufuran setelah kematianku yaitu sebagian kalian membunuh sebagian yang lain.\" HR . Bukhori no. 6868 Karena itu diketahui bahwa pembunuhan merupakan kufur amali perbuatan, dan dosa yang paling besar setelah syirik kepada Allah. Dan tatkala firman Allah, “tidak layak bagi seorang Mukmin membunuh Mukmin lainnya” adalah sebuah lafadz yang umum dalam segala kondisi bahwa seorang muslim tidak akan membunuh saudara muslim lainnya dalam bentuk apa pun, lalu Allah mengecualikan dari hal tersebut pembunuhan serta ketidasengajaan, seraya berfirman,”kecuali karena ketidaksengajaan,” karena sesungguhnya orang yang salah yang tidak bermaksud membunuh, ia tidak berdosa dan tidak akan di katakana sebagai seoarng yang berani melanggar aturan Allah, akan tetapi ia sudah melakukan tindakan keji dan bentuknya pun sangat cukup untuk di katakan sangat jelek walaupun sendiri tidak bermaksud demikian, maka Allah memerintahkan membayar kaffarat (denda atas pelanggaran larangan) dan diyat (ganti rugi pembunuhan) dalam firmannya, “dan barang siapa yang membunuh seorang Mukmin karena tersalah,” baik pelaku pembunuhannya adalah laki-laki atau wanita, orang merdeka atau budak, kacil atau besar, berakal atau gila, Mukmin atau kafir, sebagaimana yang telah di tunjukan oleh kata “barangsiapa” yang menunjukan kepada keumuman, dan hal ini adalah di antara rahasia-rahasiamenempatkan kata “barangsiapa” dalam kalimat tersebut, karena kesungguhan konteks yang memakai kata “barangsiapa” dan juga sama saja, baik orang yang terbunuh adalah laki-laki atau wanita, kecil atau besar, sebagaimana yang di tunjukan oleh kata umum dalam konteks kalimat bersarat, maka hendaklah pelaku pembunuhan itu “memerdekakan hamba sahaya yang beriman” sebagai suatu denda akan hal tersebut, yang harus diambil dari hartanya. Budak tersebut mencakup; kecil maupun bersar, laki-laki atau wanita dan yang sehat maupun yang memiliki cacatmenurut sebagian pendapat para ulama, akan tetapi hikmah yang menuntut sebuah konsekuensi bahwa denda itu tidaklah terpenuhi dengan budak yang memiliki cacat, karena yang di maksudkan membebaskan budak itu adalah memanfaatkan budak dan kepemilikan kemaslahatan dirinya, namun bila budak itu akan terabaikan dengan pembebasannya tersebut dan tetapnya ia dalam perbudakan adalah lebih bermanfaat bagi dirinya,maka tidaklah terpenuhi denda tersebut, padahal firmanNya, “Memerdekakan seorang hamba sahaya,” suatu isyarat yang menunjukan akan hal tersebut, karena sesungguhnya pembebasan budak itu adalah pelepasan hak memanfaatkan budak tersebut dari seseorang kepada orang lain. Namun bila kemaslahatan tersebut tidak di jumpai, maka tidaklah tergambar adanya pembebasan, karena itu perhatikanlah hal tersebut, karena itu sangat jelas. Adapun diyat, maka hal itu diwajibkan kepada keluarga besar pelaku pembunuhan tidak sengaja atau pembunuhan yang mirip dengan sengaja, “yang di serahkan kepada keluarga si pembunuh itu,” sebagai suatu hiburan bagi hati mereka yang luka, dan yang di maksud dengan “keluarganya” di sisni, adalah ahli warisnya, karena sesungguhnya ahli waris itu akan mewarisi apa yang di tinggalkan oleh si mayit dan diyat itu termasuk dalam warisannya, dan diyat ini memiliki perincian-perincian yang lias sekali yang termuat dalam buku-buku fikih. Dan firmanNya, “kecuali jika keluarga terbunuh bersedekah” maksudnya, ahli waris terbunuh bersedekah dengan cara memaafkan keluarga pembunuh dari diyat, maka gugurlah kewajiban membayar diyat tersebut. Ayat ini mengandung anjuran kepada keluarga terbunuhuntuk memaafkan, karena Allah menamakan sikap memaafkan dengan sedekah, dan sedekah itu dangat di harapkan dalam setiap waktu, “jika ia” orang yang terbunuh, “dari kaum yang memusuhimu” yaitu dari orang-orang kafir yang boleh diperangi, “padahal ia Mukmin maka ia memerdekakan seorang hamba sahaya yang beriman” yaitu kalian tidak wajib membayar diyat kepada keluarga terbunuh, karena tidak adanya penghirmatan pada darah dan harta mereka, “dan jika” orang yang terbunuh, “dari kaum kafir yang ada perjanjian damai antara mereka dengan kamu, maka hendaklah si pembunuh membayar diyat yang di serahkan kepada keluarga terbunuh serta memerdekakan hamba sahaya yang Mukmin,” hal tersebut adalah untuk menghormati penduduknya karena adanya perjanjian dan perdamaian di antara mereka. \"maka barangsiapa yang tidak mendapatkan\" hambasahaya juga nilainya, karena begitu sulit untuk memenuhinya, dan dia tidak punya kelebihan dari kebutuhan hidupnya yang pokok, maka dia dibebaskan dari hambasahaya dengan cara \"shaum dua bulan berturut-turut\" yaitu tidak boleh berbuka diantara dua bulan tersebut tanpa uzur. Tapi jika dia berbuka karena ada uzur, maka uzur tidak memutus keberturut-turutnya tersebut, sepertu uzur sakit, haid dan semisalnya. Alan tetapi jika berbuka tanpa uzur, maka terputuslah keberturut-turutannya dan wajib baginya mengulang dari awal. \"hal itu sebagai taubat dari Allah\" yaitu ini sebagai penebus yang Allah wajibkan baginya kepada pembunuh sebagai bentuk taubat dari Allah untuk hamba-hambaNya dan sebagai rahmat bagi mereka, penghapus atas kesalahannya yang dilakukan oleh mereka kerean pengurangan dan tidak menghindari laranganNya, sebagaimana hal ini terjadi pada banyak pembunuh yang karena kesalahan. \"Dan sesungguhnya Allah Maha mengetahui lagi Maha bijaksana\" yaitu maha sempurna ilmu dan hikmahnya. Tidak ada yang samar baginya sebesar biji zaroh pun di bumi dan di langit. Dan tidak ada yang lebih kecil atau lebih besar dari itu, diwaktu kapanpun dan kondisi apapun. Dan tidak keluar dari hikmahNya dari seluruh makhluk dan syariatNya. Bahakan seluruh makhluk dan syariatNya tercakup dalam kebijaksanaanNya. Dan diantara ilmu dan hakikatnya adalah, Allah mewajibkan denda kepada seorang pembunuh yang sesuai dengan apa yang telah di lakukannya, karena ia telah menjadi penyebab hilangnya jiwa yang terhormat, dan telah mengeluarkannya dari dunia nyata menuju ketiadaan, karena itu patutlah dirinya memerdekakan seorang hamba sahaya dan mengeluarkannya dari penghambatan mahkluk kepada kebebasan yang penuh, namun bila ia tidak mendapatkan hamba sahaya tersebut, ia harus berpuasa dua bulan berturut-turut, dimana dengan berpuasanya itu ia mengeluarkan jiwanya dari penghambatan nafsu syahwat dan kelezatan kelezatan lahiriyah yang menghalangi seorang hamba dari kebahgiaanya yang abadi kepada pengambatan kepada Allahdengan meninggalkan nafsu syahwat dan kelezatan lahiriyahtersebut untuk mendekatkan diri kepadaNya dan Allah membuat masanya dengan tempo yang panjang lagi sulit dalam hal jumlah dan kewajiban berturut-turut dalam menunaikannya , Allah tidak mewajibkan memberi makan dalam kondisi ini karena tidak sesuai dengan kasusnya, bebeda dengan zhihar,sebagaimana yang akan di bahas pada masa yang akan datang, insya Allah. Dan di antara hikmahNya adalah mewajibkan diyat dalam perkara pembunuhan, walaupun tidak disengaja, agar hal itu menjadi penghalang dan perintang dari banyaknya pembunuhan yang terjadi dengan memakai sebab-sebab yang melindungi akan hal tersebut. Dan di antara hikmahNya adalah diwajibkannya diyat atas keluarga pembunuh (al-Aqilah) dalam pembunuhan tidak sengaja menurut kesepakatan para ulama, karena pembunuhnya itu bukanlah seorang yang berdosa, maka sangat berat baginya untuk memikul beban diyat yang sangat besar tersebut, maka sangatlah pantas kalau yang ikut dalam memikulnya adalah orang-orang yang antara mereka dengan pembunuh ada saling tolong-menolong, membela dan membantu dalam memperoleh kemaslahatan dan menghindari kemudharatan, dan meringankan beban mereka, karena diyat tersebut dibagi menurut kondisi dan kemampuan mereka masing-masing, dan juga ringan untuk mereka dengan masa pembayaran tiga tahun. Dan di antara hikmahg dan ilmuNya juga adalah menghibur keluarga terbunuh dari musibah pembunuhan tersebut dengan adanya diyat yang diwajibkan atas keluarga pembunuh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 92: 91-92. Kamu akan dapati beberapa orang lain yang hendak supaya mereka aman daripada kamu dan aman daripada kaum mereka. Tiap-tiap kali mereka dikembalikan kepada fitnah, terjerumus mereka padanya. itu, jika mereka tidak tinggalkan kamu dan (tidak) menawarkan perdamaian kepada kamu, dan (tidak) memberhentikan tangan- tangan mereka, maka tawanlah mereka dan bunuhlah mereka di mana-mana kamu dapati mereka, karena mereka itu Kami telah jadikan bagi kamu kekuasaan yang nyata atas mereka yaitu boleh kamu tawan, bunuh dari musyrikin yang memerangi kamu, kecuali orang tua di antara mereka, dan tidak patut bagi seseorang Mu'min membunuh seorang Mu'min, melainkan dengan keliru; dan barang siapa bunuh seorang Mu'min dengan keliru, maka (wajib atasnya) memerdekakan seorang hamba yang Mu'min dan satu denda yang (wajib) diserahkannya kepada keluarga (si mati); kecuali jika mereka sedekahkan, tetapı jika adalah si (mati) itu dari satu kaum yang jadi musuh bagi kamu, padahal ia seorang Mu'min maka (wajib atas pembunuh itu) merdekakan seorang hamba Mu'min dan jika adalah dari satu kaum yang antara kamu dan antara mereka ada satu perjanjian, maka (wajib atas pembunuh itu) satu denda yang (mesti diserahkan) kepada keluarga (si mati) dan (wajib ia) merdekakan seorang hamba Mu'min; tetapi barangsiapa tidak dapat, maka (wajib atasnya) puasa dua bulan berturut-turut, sebagai (pemberian) taubat dari Allah, karena Allah itu Pengetahui, Bijaksana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni tidak mungkin atau mustahil seorang mukmin membunuh saudaranya secara sengaja. Dalam ayat ini terdapat dalil besarnya keharaman membunuh seorang mukmin dan bahwa hal itu bertentangan sekali dengan keimanan, bahkan hal itu tidaklah muncul kecuali dari orang kafir atau orang fasik yang imannya begitu kurang. Yang demikian karena iman yang sesungguhnya mencegah seorang mukmin membunuh saudaranya, di mana Allah telah mengikat antara dia dengan saudaranya dengan persaudaraan iman, yang konsekwensinya adalah saling mencintai dan memberikan wala' serta menghindarkan sesuatu yang dapat menyakiti saudaranya. Lantas sesuatu apakah yang lebih menyakiti saudaranya daripada membunuh?. Rasulullah shallallahu 'alaihi wa sallam pernah bersabda: « لاَ تَرْجِعُوا بَعْدِى كُفَّاراً ، يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ » \"Janganlah kamu kembali kufur setelahku, yakni satu sama lain saling membunuh.\" (HR. Bukhari) Dari sini diketahui, bahwa membunuh merupakan kufur amali (kufur yang bukan terkait dengan keyakinan dan tidak mengeluarkan dari Islam) dan dosa yang amat besar setelah syirk. Seperti menembak burung, namun terkena seorang mukmin. Dalam hal ini, orang tersebut tidaklah berdosa, akan tetapi karena ia telah melakukan perbuatan buruk, di mana gambaran dari perbuatan itu sudah cukup menunjukkan keburukannya meskipun ia tidak bermaksud membunuh, maka Allah memerintahkannya untuk membayar diyat dan kaffarat. Baik yang membunuh laki-laki maupun wanita, merdeka atau budak, anak kecil atau orang dewasa, muslim atau kafir. Hal ini berdasarkan lafaz \"man\" yang menunjukkan keumuman. Baik yang terbunuh laki-laki atau wanita, anak kecil atau orang dewasa. Dengan hartanya. Hamba sahaya yang dimerdekakannya ini mencakup anak-anak atau orang dewasa, laki-laki atau perempuan, yang sehat atau yang bercacat (menurut pendapat sebagian ulama). Namun yang tepat adalah tidak bisa memerdekakan budak yang bercacat, karena tujuan memerdekakan budak adalah bermanfaat merdeka itu bagi dirinya dan ia memiliki hak terhadap manfaat dari dirinya. Apabila budak yang bercacat dimerdekakan, maka tidak bermanfaat apa-apa, dan bahkan jika tetap sebagai budak lebih bermanfaat baginya, maka tidak sah budak yang cacat tersebut dimerdekakan. Hal ini ditunjukkan pula oleh kata-kata \"Fa tahriiru raqabah\" (memerdekakan seorang hamba sahaya), di mana memerdekakan tersebut berarti membebaskan manfaat yang sebelumnya untuk orang lain menjadi untuk dirinya sendiri. Diat ialah pembayaran sejumlah harta karena suatu tindak pidana terhadap suatu jiwa atau anggota badan. Diyatnya menurut As Sunnah adalah seratus ekor unta dengan rincian; 20 bintu makhaadh, 20 bintu labun, 20 ibnu labun, 20 hiqqah dan 20 jadza'ah. Bintu makhaadh adalah unta betina yang berumur satu tahun dan masuk tahun kedua. Bintu labun adalah unta betina yang berumur dua tahun dan masuk tahun ketiga. Ibnu Labun adalah unta jantan yang berumur dua tahun dan masuk tahun ketiga. Hiqqah adalah unta betina yang berumur tiga tahun dan masuk tahun keempat. Jadza'ah adalah unta betina yang berumur empat tahun dan masuk tahun kelima] Diyat ini (yakni dalam pembunuhan tanpa sengaja dan syibhul 'amdi/mirip sengaja) ditanggung oleh keluarga pembunuh, yakni para 'ashabahnya, baik yang ushul (bapak dst. ke atas) maupun yang furu' (anak dst. ke bawah), karena si pembunuh tidak bersalah, sehingga cukup memberatkan jika sampai ia yang menanggung beban berat ini. Beban diyat tersebut dibagi antara mereka (keluarga pembunuh) selama tiga tahun, dan hakim berijtihad dalam memberikan beban kepada masing-masing mereka semampunya, misalnya yang kaya di antara keluarganya dibebani 1/2 dinar, yang keadaan ekonominya pertengahan dibebani 1/4 dinar dsb. Jika mereka tidak mampu membayar, maka dibayarkan dari Baitul maal, dan jika kesulitan dibayarkan dari baitul maal, maka dari harta pembunuh (yang tidak sengaja) itu. Yakni ahli warisnya. Bersedekah di sini maksudnya membebaskan si pembunuh dari pembayaran diat. Dalam ayat ini terdapat anjuran memaafkan, karena Allah menamainya sedekah, sedangkan sedekah itu diperintahkan. Yakni dari kalangan kaum kafir harbi (yang memerangi kaum muslimin). Yakni pembunuhnya cukup membayar kaffarat saja, yaitu dengan memerdekakan seorang budak yang beriman, dan tidak ada diyat yang diserahkan kepada keluarganya karena permusuhan dan peperangan yang mereka lancarkan kepada kaum muslimin. Seperti kaum dzimmiy (orang-orang kafir yang tinggal di bawah pemerintahan Islam dengan membayar pajak) agar diri dan harta mereka terlindungi. Yaitu 1/3 dari diyat orang mukmin, jika si terbunuh orang Yahudi atau Nasrani, dan 2/30 jika si terbunuh orang Majusi. Maksudnya tidak mempunyai hamba atau tidak memperoleh hamba sahaya yang beriman atau tidak mampu membelinya untuk dimerdekakan. Menurut sebagian ahli tafsir, puasa dua bulan berturut-turut itu adalah sebagai ganti dari pembayaran diat dan memerdekakan hamba sahaya. Tidak berbuka di salah satu hari dari dua bulan itu tanpa udzur (alasan). Namun jika ia berbuka karena 'udzur, maka udzur tersebut tidak memutuskan \"berturut-turut\" tersebut, seperti sakit, haidh dsb. Tetapi, jika dia berbuka tanpa udzur, maka terputuslah \"berturut-turut\" tersebut dan puasanya wajib dimulai dari awal. Kaffarat yang Allah wajibkan tersebut merupakan tobat dari Allah untuk hamba-hamba-Nya, sebagai rahmat-Nya kepada mereka dan menghapuskan apa saja yang mereka lakukan berupa sikap remeh dan kurang hati-hati. Tentang keadaan makhluk-Nya. Dalam aturan yang ditetapkan-Nya. Di antara kebijaksanaan-Nya adalah apa Yang Dia wajibkan kepada pembunuh, yaitu melakukan kaffarat yang memang sesuai dengan perbuatan yang dilakukan, karena ia menjadi sebab hilangnya jiwa yang terpelihara, maka sangat sesuai jika kaffaratnya adalah membebaskan seorang budak dan melepaskannya dari ikatan perbudakan kepada makhluk menjadi bebas dan merdeka. Jika ia tidak mendapatkan budak, maka dengan berpuasa selama dua bulan berturut-turut, di mana dia melepaskan dirinya dari perbudakan kepada syahwat dan kelezatan yang sesungguhnya memutuskan kebahagiaannya yang abadi, beralih menuju beribadah kepada Allah Subhaanahu wa Ta'aala untuk mendekatkan diri kepada-Nya. Allah Subhaanahu wa Ta'aala juga menetapkan waktu yang lama dan mewajibkan secara berturut-turut, serta tidak mensyari'atkan memberi orang miskin sebagai gantinya karena tidak sesuai. Termasuk kebijaksanaan-Nya pula adalah mewajibkan diyat dalam pembunuhan, meskipun tidak sengaja agar menjadi penghalang utama terhadap banyaknya pembunuhan dengan menggunakan sebab-sebab yang dapat menjaganya dari pembunuhan itu. Demikian juga termasuk kebijakasanaan-Nya adalah Dia menutupi rasa sedih yang menimpa keluarga korban dengan diyat yang Allah wajibkan diberikan kepada wali-wali korban."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 92",
    "description": "Dan tidak patut, bagi seorang mukmin membunuh seorang mukmin yang lain, kecuali terjadi karena tersalah dan tidak sengaja, sebab keimanan akan menghalangi mereka untuk berbuat demikian. Barang siapa membunuh seorang mukmin, kecil atau dewasa, laki-laki atau perempuan, karena tersalah, maka wajiblah dia memerdekakan atau membebaskan seorang hamba sahaya yang beriman, yakni membebaskannya dari sistem perbudakan walau dengan jalan menjual harta yang dimilikinya untuk pembebasannya serta membayar tebusan (diat) yang diserahkan dengan baik-baik dan tulus kepada keluarganya, yakni keluarga si terbunuh itu, kecuali jika mereka, keluarga si terbunuh memberikan maaf kepada si pembunuh dengan membebaskannya dari pembayaran itu. Jika dia, yakni si terbunuh, berasal dari kaum kafir yang memusuhimu padahal dia mukmin, maka yang diwajibkan kepada si pembunuh itu hanyalah memerdekakan hamba sahaya yang beriman, tidak disertai tebusan. Dan jika dia, si terbunuh, adalah kafir dari kaum kafir yang ada, yakni memiliki perjanjian damai dan tidak saling menyerang antara mereka dengan kamu, maka wajiblah bagi si pembunuh itu membayar tebusan yang diserahkan dengan baik-baik dan tulus kepada keluarganya si terbunuh akibat adanya perjanjian itu serta diwajibkan pula memerdekakan hamba sahaya yang beriman. Barang siapa tidak mendapatkan hamba sahaya yang disebabkan karena tidak menemukannya, padahal kemampuannya ada atau karena tidak memiliki kemampuan materi untuk membebaskannya, maka hendaklah dia, si pembunuh, berpuasa selama dua bulan berturut-turut sebagai gantinya. Allah mensyariatkan hal demikian kepada kalian sebagai tobat kalian kepada Allah. Dan Allah maha mengetahui segala yang kalian lakukan, mahabijaksana untuk menetapkan hukum dan hukuman bagi kalian. Dan barang siapa membunuh seorang mukmin dengan sengaja yakni dengan niat dan terencana, maka balasannya yang pantas dan setimpal ialah neraka jahanam yang sangat mengerikan, dia kekal di dalamnya dalam waktu yang lama disertai dengan siksaan yang amat mengerikan. Di samping hukuman itu, Allah murka kepadanya dan melaknatnya yakni menjauhkannya dan tidak memberinya rahmat, serta menyediakan azab yang besar baginya selain dari azab-azab yang disebutkan di atas di akhirat."
  }
]