[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan barangsiapa berbuat melampaui batas terhadap seorang mukmin dengan membunuhnya secara sengaja tanpa ada alasan yang dibenarkan,maka hukuman baginya adalah neraka jahanam,dia kekal disana disertai dengan kemurkaan allah kepadanya dan terusir dari rahmatNYA,jika Dia memberikannya balasan karena dosanya.Dan allah menyediakan baginya siksaan yang paling keras disebabkan apa yang telah mereka lakukan berupa tindakan kejahatan besar. Akan tetapi,allah memafkan dan melimpahkan karuniaNYA kepada orang-orang beriman,maka allah tidak membalas mereka dengan kekekalan dalam neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Barangsiapa yang membunuh orang mukmin secara sengaja tanpa hak (tidak dibenarkan oleh syariat), maka balasannya ialah dimasukkan ke dalam Neraka Jahanam untuk selama-lamanya, Allah murka kepadanya dan dijauhkan dari rahmat-Nya, serta disediakan baginya azab yang sangat besar karena ia telah melakukan dosa besar tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "93. Setelah Allah menjelaskan hukum pembunuhan tanpa disengaja, kemudian Allah menjelaskan hukum pembunuhan yang disengaja. Dia berfirman: Barang siapa yang menzalimi orang mukmin dengan disengaja sampainya mati tanpa alasan yang benar maka hukuman baginya adalah neraka jahanam, ia akan masuk ke dalam neraka tersebut sesuai dengan tingkat kejahatannya, dan Allah akan murka terhadapnya dan menjauhkannya dari rahmat-Nya. Allah akan menyiapkan azab yang berat baginya, namun Dia memberi karunia orang-orang yang beriman untuk tidak kekal didalam neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. وَمَن يَقْتُلْ مُؤْمِنًا مُّتَعَمِّدًا (Dan barangsiapa yang membunuh seorang mukmin dengan sengaja) Yakni yang sengaja membunuh seseorang padahal ia mengetahui bahwa ia adalah seorang muslim. Dan tanda bahwa seseorang membunuh dengan sengaja adalah ia membunuh dengan alat yang biasanya dipakai untuk membunuh seperti pedang atau racun. فَجَزَآؤُهُۥ جَهَنَّمُ (maka balasannya ialah Jahannam) Yakni ia berhak mendapatkan balasan ini karena dosa yang ia pikul dan ia kekal dalam nereka itu, dan ia akan mendapatkan kemurkaan dan laknat Allah, serta Allah akan menyiapkan baginya azab yang besar. Akan tetapi barangsiapa yang bertaubat niscaya Allah akan mengampuninya, dan pembunuh secara sengaja yang ingin bertaubat harus mengakui bahwa ia telah membunuh dan menyerahkan diri untuk diqishash apabila pembunuhannya diwajibkan hukum qishash atau membayar diyat apabila tidak diwajibkan hukum qishash jika ia termasuk orang yang kaya dan mampu membayar diyat seluruhnya atau sebagiannya. Adapun pembunuh secara sengaja yang hanya bertaubat dan bertekat untuk tidak mengulangi perbuatannya tanpa mengakui dan menyerahkan diri maka kita tidak bisa memastikan diterimanya taubat tersebut, dan Allah adalah Dzat yang paling penyayang, dialah yang akan memutuskan perkara hamba-hamba-Nya dalam hal yang mereka perdebatkan. Dan dalam ayat ini Allah tidak menyebutkan pertaubatan atau pembayaran kafarat bagi orang yang membunuh orang Islam secara sengaja sebagaimana Dia menyebutkannya bagi pembunuh secara tidak sengaja, dan ini menunjukkan bahwa ia tidak diterima taubatnya atau kafaratnya; namun pendapat lain menyebutkan bahwa taubatnya mungkin untuk diterima."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "93 Barangsiapa membunuh seorang mukmin dengan sengaja maka balasannya ialah abadi dalam neraka Jahannam, dan Allah murka kepadanya. Akan terhalang dari rahmat-Nya dan mengutukinya serta menyediakan azab yang besar baginya. Ayat ini turun untuk Miqyas bin Dhibabah Alkanani yang membunuh seorang laki-laki dari Bani Fahd, meskipun dia telah membayarkan diyat dari harta saudaranya yaitu Hisyam bin Dhibabah dari Bani Najar dan kembali ke Makkah dengan keadaan kafir"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang membunuh seorang mukmin dengan sengaja} berniat membunuhnya {maka balasannya adalah neraka Jahanam. Dia kekal di dalamnya. Allah murka kepadanya, melaknatnya} menjauhkannya dari rahmatNya {dan menyediakan baginya azab yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "93. Telah berlalu bahwa Allah memberitakan bahwasanya tidaklah terjadi pembunuhan terhadap seorang Mukmin oleh Mukmin yang lain, dan bahwasanya pembunuhan itu adalah di antara bentuk kufur amali. Dalam ayat ini Allah menyebutkan tentang ancaman bagi pembunuh dengan sengaja yaitu ancaman yang menggetarkan jiwa, menakutkan hati, dan membuat orang-orang yang berakal gelisah. Dan tidaklah ada hukuman yang dikeluarkan bagi dosa-dosa besar yang lebih besar dari hukuman ini, bahkan tidak ada yang sepertinya, yaitu kabar bahwa hukumannya adalah Jahanam, artinya, dosa yang besar ini telah patut menjadi satu-satunya dosa untuk diberikan hukuman kepada pelakunya dengan Jahanam dengan segala siksaan yang ada di dalamnya dan kehinaan yang nyata, kemurkaan Allah, hilangnya keselamatan dan keberuntungan, serta adanya kegagalan dan kerugian, maka hanya kepada Allah kita berlindung dari segala sebab yang menjuahkan dari rahmatNya. Ancaman ini memiliki kedudukan yang sama seperti hal-hal yang semisal dengannya dari nash-nash ancaman atas beberapa dosa-dosa besar dan kemaksiatan dengan keabadian dalam neraka atau haramnya surga. Dan sesungguhnya para ulama telah berbeda pendapat tentang penafsirannya, disamping kesepakatan mereka atas batilnya pendapat Khawarij dan Mu’tazilah yang berpendapat akan kekalnya orang-orang seperti itu (pelaku dosa besar) dalam neraka walaupun mereka ini masih bertauhid, dan yang shahih dalam penafsirannya adalah apa yang dikatakan oleh Imam Ibnul Qayyim dalam Madarij as-Salikin, di mana beliau telah menyebutkan beberapa pendapat para ulama dalam tafsir akan hal tersebut lalu beliau mengomentarinya seraya berkata; “Sekelompok ulama berpendapat, bahwa nash-nash ini atau yang semisalnya adalah di antara perkara yang disebutkan padanya tuntutan diberlakukannya hukuman. Keberadaan tuntutan hukum tidak menghatruskan adanya suatu hukuman, karena hukuman itu hanya akan terwujud jika tuntutan-tuntutannya terpenuhi dan tidak ada penghalang-penghalangnya. Maksud dari nash-nash ini adalah pemberitahuan bahwa yang demikian itu merupakan sebab yang mengakibatkan hukuman. Dan sungguh telah ada ada dalil tentang adanya penghalang-penghalang tersebut yang sebagiannya adalah ijma’ dan sebagian lagi berupa nash. Mereka menyatakan bahwa atas dasar inilah penegakkan kemaslahatan dunia dan akhirat atau kemudharatan keduanya, dan atas dasar ini juga patokan hukum-hukum syariat dan ketetapan-ketetapan takdir, dan juga merupakan tuntutan Sunnah Allah yang berlaku di dunia, dengannya ada keterkaitan antara sebab-sebab dan akibatnya sebagai suatu penciptaan dan perintah, dan sungguh Allah telah menjadikan bagi setiap hal ada hal lain yang kontradiksi dengannya yang selalu melawannya dan menghadangnya hingga hukum yang tegak adalah yang paling kuat darinya, maka kekuatan menghasilkan kesehatan dan keselamatan, dan kerusakan serta kezhaliman yang terjadi pada interaksi antara dua hal yang berlawanan tersebut adalah penghalang bagi fungsi alam. Jadi fungsi kekuatan dan hukum adalah bagi yang paling kuat darinya, demikian juga bagi kekuatan obat-obatan dan penyakit. Seorang hamba memiliki kesempatan untuk sehat dan kesempatan untuk sakit, salah satu pihak dari kedua hal itu akan menghalangi kesempurnaan pengaruh dari pihak lainnya dan melawannya, dan bila ia mampu menanggulanginya dan menang atasnya, niscaya pengaruhnya yang akan berfungsi, dari sinilah dapat diketahui pembagian makhluk yang masuk surga dan tidak masuk neraka atau sebaliknya, dan makhluk yang masuk neraka kemudian keluar darinya dan menetapnya dalam neraka adalah sesuai dengan hal-hal yang menuntut keberadaannya di neraka tersebut yang berpengaruh pada cepat atau lambatnya ia keluar dari neraka. Makhluk yang memiliki mata hati yang terang di mana ia mampu memandang dengannya segala hal yang dikabarkan oleh Allah dalam kitabNya berupa perkara tentang Hari Pembalasan dan perincian-perinciannya, hingga seolah-olah ia menyaksikannya dengan mata kepala sendiri, dan ia mengetahui bahwa hal ini adalah suatu tuntutan uluhiyah Allah, rububiyahNya, kemuliaanNya, dan hikmahNya, dan bahwasanya mustahil pada diri Allah apa yang berlawanan dengan itu semua. Dan prosentase keyakinan tersebut pada diri orang itu adalah sama dengan prosentase apa yang tidak pantas padaNya, sehingga prosentase hal tersebut berkaitan dengan bashirahnya adalah seperti prosentase (kuatnya) sinar matahari dan bintang kepada daya pandangannya. Dan inilah hakikat keimanan yang benar yang mampu membakar keburukan sebagaimana api membakar kayu, dan orang yang memiliki keimanan seperti ini, mustahil baginya terus-menerus berbuat keburukan walaupun ia pernah melakukannya dan bahkakn seringkali melakukannya, karena apa yang ada bersamanya berupa cahaya keimanan akan selalu memerintahkan kepadanya untuk memperbaharui taubat pada setiap waktu dan untuk kembali kepada Allah dalam setiap desah nafasnya. Dan inilah makhluk yang paling Allah cintai.” Berakhir perkataan beliau dan semoga Allah menyucikan jiwanya dan membalasnya untuk Islam dan kaum Muslimin dengan kebaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 93: Dan barangsiapa membunuh seorang Mu'min dengan sengaja, maka balasannya ialah jahannam yang ia akan kekal padanya dan Allah murka atasnya, dan la' nat dia dan la sediakan baginya siksa yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang menafsirkan, bahwa dia akan kekal di neraka apabila menganggap halal yang demikian. Ibnul Qayyim setelah menyebutkan pendapat para imam tentang ayat tersebut berkata dalam Madaarijus Salikin: Sebagian lagi berpendapat, nash-nash ini dan semisalnya yang disebutkan di sana hal yang menghendaki untuk diberikan hukuman, namun tidak mesti adanya hal yang menghendaki untuk dihukumi harus ada pula hukuman itu. Hal itu, karena hukum hanyalah sempurna dengan adanya konsekwensinya dan hilangnya penghalang. Tujuan nash-nash ini adalah untuk memberitahukan bahwa perbuatan ini menjadi sebab untuk memperoleh hukuman dan yang mengharuskannya, namun telah ada dalil yang menyebutkan mawaani' (penghalang); sebagiannya berdasarkan ijma' dan sebagian lagi berdasarkan nash. Tauhid menjadi penghalang (kekal di neraka) berdasarkan nash-nash mutawatir yang tidak dapat ditolak, kebaikan-kebaikan yang besar dapat menghapuskan dosa sekaligus sebagai penghalang, musibah-musibah besar yang menghapuskan dosa juga sama menjadi penghalang, ditegakkannya hudud di dunia juga sama sebagai penghalang berdasarkan nash, dan tidak ada jalan untuk meniadakan nash-nash tersebut, sehingga nash-nash tersebut harus diberlakukan dari dua sisi. Dari sinilah tegak penimbangan antara kebaikan dan keburukan karena memperhatikan sesuatu yang menghendaki adanya hukuman dan memperhatikan pula penghalangnya, dan memberlakukan yang lebih kuatnya. Mereka mengatakan, \"Atas dasar ini dibangun maslahat di dunia dan akhirat serta mafsadat keduanya. Atas dasar ini pula dibangun hukum-hukum syar'i dan hukum-hukum qadari (ketentuan Allah di alam semesta). Yang demikian merupakan konsekwensi yang diinginkan dari hikmah yang berjalan di alam semesta, dengannya pula dikaitkan antara sebab dengan musabbab, mencipta dan memerintah, Allah Subhaanahu wa Ta'aala juga telah mengadakan untuk segala sesuatu lawannya yang menolak dan mendorongnya, dan hukum diputuskan berdasarkan hal yang lebih kuat daripadanya. Kekuatan menghendaki untuk sehat wal 'afiyat, rusaknya campuran dan tindak melampaui batas menghalanginya dari mengerjakan perbuatan secara tabi'at serta menghalanginya mewujudkan kekuatan, dan hukum ditetapkan untuk yang lebih kuat di antara keduanya, demikian juga halnya kuatnya obat dan penyakit (dalam diri seseorang). Pada seorang hamba terdapat hal yang menghendaki untuk sehat dan sakit, masing-masingnya menghalangi yang lain untuk menyempurnakan pengaruhnya dan melawannya, jika ada yang lebih kuat atau yang satu yang kalah, maka yang menang lebih besar pengaruhnya. Dari sini diketahui, bahwa manusia terbagi menjadi beberapa golongan; ada yang masuk ke surga dan tidak masuk neraka, dan ada pula sebaliknya, ada pula yang masuk neraka kemudian dikeluarkan daripadanya, sehingga tinggalnya di neraka sesuai konsekwensi untuk tinggal cepat atau lambat. Siapa saja yang memiliki pandangan yang bersinar, ia dapat melihat semua yang Allah beritakan dalam kitab-Nya seperti tentang perkara akhirat dan perinciannya, maka seakan-akan ia menyaksikannya langsung. Dari sini diketahui pula bahwa hal itu merupakan konsekwensi ketuhanan-Nya, pengaturan-Nya terhadap alam semesta, keperkasaan-Nya dan kebijaksanaan-Nya dan mustahil berbeda dengan hal itu, apalagi sampai menisbatkan kepada-Nya sesuatu yang tidak layak menisbatkan kepada-Nya, oleh karena itu nisbatnya kembali kepada pandangannya sebagaimana menisbatkan matahari dan bintang dalam pandangannya. Inilah yang yakin dari keimanan, ini pula yang membakar keburukan, sebagaimana api membakar kayu, pemilik keimanan dalam posisi ini mustahil tetap di atas keburukan, meskipun pernah terjadi atau bahkan banyak, karena cahaya iman yang ada padanya memerintahkan untuk memperbarui tobat di setiap waktu dengan kembali kepada Allah di setiap hembusan nafasnya, dan inilah makhluk yang paling dicintai Allah.\" Dalam surat Al Baqarah ayat 178 sudah diterangkan, bahwa pembunuh secara sengaja dibunuh juga (diqishas), dan jika memperoleh maaf, ia hendaknya membayar diyat. Dalam As Sunnah disebutkan, bahwa antara pembunuhan secara sengaja dan tidak sengaja ada pula pembunuhan syibhul 'amdi (mirip sengaja), misalnya memukul orang lain di bagian yang tidak membunuh, memukul dengan cemeti, tongkat kecil, atau meninju bagian yang biasanya tidak membuatnya terbunuh, lalu ia meninggal, maka dalam hal ini tidak ada qishas, namun ada diyat dan kaffarat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 93",
    "description": "Dan barang siapa membunuh seorang mukmin dengan sengaja yakni dengan niat dan terencana, maka balasannya yang pantas dan setimpal ialah neraka jahanam yang sangat mengerikan, dia kekal di dalamnya dalam waktu yang lama disertai dengan siksaan yang amat mengerikan. Di samping hukuman itu, Allah murka kepadanya dan melaknatnya yakni menjauhkannya dan tidak memberinya rahmat, serta menyediakan azab yang besar baginya selain dari azab-azab yang disebutkan di atas di akhirat pada ayat yang lalu Allah telah menegaskan hukuman yang amat pedih bagi seseorang yang melakukan pembunuhan dengan sengaja. Pada ayat ini Allah memberikan peringatan kepada kaum muslim untuk berhati-hati agar tidak terjerumus ke dalam pembunuhan. Salah satu kesempatan yang memungkinkan terjadinya pembunuhan dengan sengaja itu ialah pada waktu terjadinya peperangan dengan seseorang atau sekelompok yang tidak dikenal. Wahai orang-orang yang beriman! berhati-hatilah dalam mengambil keputusan untuk membunuh seseorang. Karena itu, apabila kamu pergi melakukan perjalanan di atas bumi, baik untuk berperang dan atau untuk tugas apa pun di jalan Allah, maka telitilah dan carilah keterangan yang pasti tentang orang yang kamu hadapi itu dan jangan kamu melakukan tindakan apa pun kepadanya kalau kamu ragu dan janganlah kamu mengatakan kepada orang atau siapa pun yang mengucapkan salam, yakni orang yang mengucapkan kalimat la' ila'ha illalla'h, kepadamu, kamu bukan seorang yang beriman, lalu kamu membunuhnya dengan maksud mencari harta benda kehidupan dunia dari pembunuhan itu, padahal di sisi Allah ada harta yang banyak, yang lebih baik daripada apa yang kamu dapatkan dari harta rampasan peperangan itu, yaitu pahala yang berlipat ganda yang disediakan oleh Allah di akhirat. Begitu jugalah keadaan kamu dahulu, ketika kamu kafir, sebelum kamu beriman, menyembunyikan keimananmu, lalu Allah memberikan nikmat-Nya berupa nikmat iman kepadamu lalu kamu beriman seperti sekarang ini, maka telitilah dengan pasti sebelum kamu bertindak kepadanya. Sungguh, Allah mahateliti terhadap apa yang kamu kerjakan dan maha memberi balasan atas apa yang kamu lakukan."
  }
]