[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada allah dan rasulNYa serta melaksanakan syariatNYA,bila kalian berjalan keuar di muka bumi untuk berjihad di jalan allah,maka jadilah kalian orang-orang yang bersikap berdasarkan bukti nyata dalam perkara yang akan kalian perbuat atau perkara yang kalian tinggalkan.Dan janganlah kalian menafikkan keimanan dari orang yang tampak pada dirinya secara lahir,Sesutu yang merupakan tanda keislaman,dan tidak memerangi kalian,sebab ada kemungkinan dia seorang MUkmin yang menyembunyikan keimanannya,demi mencari kesenangan kehidupan dunia dengan sikap tersebut. Dan allah ,disisinya terdapat karunia dan pemberian yang akan mencukupi kalian.Demikianlah keadaan kalian pada permulaan islam,dimana kalian menyembunyikan keimanan kalian di hadapan kaum kalian dari kalangan kaum musyrikin.Kemudian allah menganugerahkan kenikmatan kepada kalian dan memuliakan kalian dengan keimanan dan kekuatan.Maka jadilah kalian orang-orang yang berjalan di atas bukti nyata dan pengetahuan yang benar terhadap urusan-urusan kalian.Sesungguhnya allah maha mengetahui seluruh amal perbuatan kalian,maha teliti terhadap urusan-urusan kalian sekecil-kecilnya,dan akan memberikan balasan kepada kalian atas segala perbuatan tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Wahai orang-orang yang beriman kepada Allah dan mengikuti rasul-Nya, apabila kalian pergi ke medan jihad fi sabilillah maka telitilah perihal orang yang kalian perangi. Dan janganlah kalian mengatakan kepada orang yang memperlihatkan kepada kalian sesuatu yang menunjukkan keislamannya, “Kalian bukan orang mukmin. Kalian menunjukkan keislaman kalian hanya untuk melindungi darah dan harta kalian.” Kemudian kalian membunuhnya dengan harapan kalian akan mendapatkan kesenangan duniawi yang sangat sedikit, seperti harta rampasan perang dari orang tersebut. Padahal di sisi Allah ada banyak sekali keuntungan yang lebih baik dan lebih besar dari rampasan perang itu. Dan sebelum ini kalian pun pernah berbuat seperti orang yang menyembunyikan keimanannya dari kaumnya. Kemudian Allah menganugerahi kalian agama Islam yang telah melindungi darah kalian, oleh karena itu telitilah. Sesungguhnya tidak ada perbuatan kalian yang tersembunyi bagi Allah, sekecil apa pun. Dan Dia akan memberi kalian balasan yang setimpal dengan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94. Dan janganlah kalian katakan kepada orang-orang yang taat, tidak memerangi kalian, dan menunjukkan bahwa dia termasuk Penganut Agama kalian: \"sebenarnya kamu bukanlah orang yang beriman\", kemudian kalian memeranginya Karena mengharapkan kenikmatan dunia yang fana dan akan lenyap. sesungguhnya di sisi Allah terdapat banyak rezeki dan kenikmatan yang tak terhingga, Dia Ta'ala akan memberikan harta ghanimah sehingga menjadikan kalian orang-orang yang kaya Jika dia menghendaki. Pada saat kali pertama kali kalian memeluk Islam, darah dan harta kalian terlindungi dengan kalimat syahadat yang telah kalian ucapkan tanpa menunggu bukti bahwa yang ada dalam hati kalian sesuai dengan perkataan yang kalian ucapkan. Maka hendaklah kalian memperlakukan orang-orang yang baru masuk Islam sebagaimana dahulu kalian diperlakukan dengan berpegang pada kalimat yang mereka ungkapkan, dan janganlah kalian katakan bahwa mereka mengucapkan kalimat syahadat karena takut dibunuh. Hendaklah kalian memiliki bukti yang jelas terlebih dahulu sebelum melakukan suatu perbuatan, dan janganlah hanya berpegang pada prasangka. Allah Maha Mengetahui segala perbuatan kalian, segala niatan yang mendorong kalian untuk melakukan sesuatu sama sekali tidak dapat kalian sembunyikan dari-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. إِذَا ضَرَبْتُمْ فِى سَبِيلِ اللهِ (apabila kamu pergi di jalan Allah) Yakni keluar untuk berjihad atau pergi dengan senjata kalian untuk berperang di jalan Allah. فَتَبَيَّنُوا۟ (maka telitilah) Yakni pastikanlah dulu orang yang kalian perangi bukanlah orang beriman. وَلَا تَقُولُوا۟ لِمَنْ أَلْقَىٰٓ إِلَيْكُمُ السَّلٰمَ (dan janganlah kamu mengatakan kepada orang yang mengucapkan “salam” kepadamu) Yakni janganlah kalian mengatakan ‘kalian bukan orang beriman’ kepada orang yang menyampaikan kepada kalian kalimat Islam (dua kalimat syahadat). Pendapat lain mengatakan maknanya adalah bahwa janganlah kalian mengatakan ‘kalian bukanlah orang beriman’ kepada orang yang menyampaikan salam kepada kalian dengan mengatakan “assalamualaikum”. Dari Ibnu Abbas ia berkata: seseorang dari Bani Sulaim melalui sekelompok sahabat Rasulullah sambil menggiring kambingnya, lalu ia menucapkan salam kepada para sahabat. Para sahabat lalu mengatakan: “ia tidak mengucapkan salam kepada kita kecuali agar kita tidak menyakitinya”, maka mereka menyerangnya dan membunuhnya, lalu mendatangi Rasulullah dengan harta ghanimah yang mereka dapatkan; maka turunlah ayat ini. تَبْتَغُونَ عَرَضَ الْحَيَوٰةِ الدُّنْيَا (dengan maksud mencari harta benda kehidupan di dunia) Yakni mencari harta ghanimah. فَعِنْدَ اللهِ مَغَانِمُ كَثِيرَةٌ ۚ (karena di sisi Allah ada harta yang banyak) Yakni dari harta halal yang cukup bagi kalian tanpa melanggar larangan, dan tanpa membunuh dan merampas harta orang yang telah berserah diri dan tunduk. كَذٰلِكَ كُنتُم مِّن قَبْلُ (Begitu jugalah keadaan kamu dahulu) Yakni kalian dahulu adalah orang-orang kafir lalu darah kalian jadi terlindungi setelah kalian mengucapkan kalimat syahadat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Pelajaran penting yang dapat diambil dari firman Allah ini adalah : hendaknya setiap insan jika akan menjatuhkan hukuman pada seseorang tidak menyamakan atau melebihkan keadaan hukuman yang akan dijatuhkan kepada orang tersebut, sekalipun ia pernah merasakan hal yang sama sebelumnya seperti seorang guru terhadap siswanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94 Hai orang-orang yang beriman, apabila kamu pergi berperang di jalan Allah, maka telitilah dan janganlah kamu tergesa-gesa supaya kamu tidak salah membunuh saudara muslim. Dan jangan kamu katakan kepada orang yang telah bersyahadat dan menyatakan keislamannya dengan perkataan: “Kamu bukan seorang mukmin” lalu kamu membunuhnya, dengan maksud mencari harta benda kehidupan di dunia, atau mencari harta rampasan perang. Itu semua adalah barang dunia yang akan lenyap, karena di sisi Allah ada harta dan kebaikan yang tidak terkira dari pada apa yang kalian senangi, itu semua akan kalian dapatkan selama tidak berbuat perbuatan yang terkutuk, atau jangan kalian bergerombol. Begitu jugalah keadaan kamu dahulu seperti orang-orang kafir, lalu Allah menganugerahkan petunjuk-Nya atas kamu dalam keimanan, sehingga telah terukir dalam darah kalian kalimat Islam dan syahadat, maka telitilah dan jangan tergesa-gesa dalam berperang. Sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan. Ibnu Abbas berkata bahwa orang-orang muslim bertemu dengan seorang laki-laki dan bersamanya ada harta rampasan, kemudian dia mengucapkan salam kepada orang-orang muslim: keselamatan atas kalian. Kemudian orang-orang muslim itu membunuh dan merampas harta tersebut itu. maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, apabila kalian pergi} keluar untuk berjihad {di jalan Allah, carilah penjelasan} mencari kepastian {dan janganlah kalian mengatakan kepada orang yang mengucapkan salam kepada kalian} menunjukkan kepada kalian apa yang menunjukkan keislamannya {“Kamu bukan seorang mukmin,” kalian bermaksud} kalian ingin membunuhnya {harta benda} kenikmatan {kehidupan dunia karena di sisi Allah ada harta yang banyak. Demikianlah keadaan kalian dahulu} dahulu kalian mengkhawatirkan iman kalian di Mekkah sebagaimana hal ini membuat takut imannya {lalu Allah menganugerahkan nikmat kepada kalian, maka carilah kejelasan. Sesungguhnya Allah Maha Mengetahui apa yang kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Allah memerintahkan hamba-hambaNya yang beriman apabila mereka keluar berjihad di jalanNya dan mengharap keridhaanNya agar teliti dan cermat (mencari kejelasan) dalam segala perkara-perkara yang jelas dan perkara yang tidak jelas. Perkara yang jelas dan nyata tidak butuh lagi kepada ketelitian dan kecermatan, karena hal tersebut sudah tidak diperdebatkan lagi. Adapun perkara-perkara yang yang bermasalah dan yang tidak jelas, maka sesungguhnya manusia membutuhkan ketelitian dan kehati-hatian, agar ia mengetahui apakah ia berani mengambil risiko ataukah tidak, karena ketelitian dalam perkara-perkara seperti ini akan menghasilkan faidah-faidah yang banyak sekali dan terhindar dari keburukan yang besar, di mana agama, akal, dan kematangan seorang hamba dapat diketahui dengannya. Berbeda dengan seseorang yang tergesa-gesa pada awal-awalnya terhadap suatu perkara sebelum ia meneliti dan mencari tahu hukumnya, karena sesungguhnya hal tersebut akan mengakibatkan suatu hal yang tidak diharapkan, sebagaimana yang terjadi pada orang-orang yang ditegur oleh Allah dalam ayat tersebut yaitu ketika mereka tidak meneliti lalu mereka membunuh orang yang menyerahkan dirinya kepada mereka di mana pada saat itu ada ghanimah miliknya atau harta milik orang lain bersamanya, sebagai suatu dugaan bahwa hal ini hanya sebagai suatu penghindaran diri dari pembunuhan, dan ternyata hal ini adalah suatu kesalahan, karena itulah Allah menegur mereka dalam FirmanNYa, “Dan janganlah kamu mengatakan kepada orang yang mengucapkan “salam” kepadamu, ‘Kamu bukan seorang Mukmin,’ (lalu kamu membunuhnya), dengan maksud mencari harta benda kehidupan di dunia, karena di sisi Allah ada harta yang banyak.” Maksudnya, janganlah kalian didorong oleh harta yang sementara lagi sedikit lalu melakukan perbuatan yang tidak semestinya, hingga membuat kalian luput dari pahala di sisi Allah yang banyak lagi abadi, dana pa yang ada di sisi Allah itu lebih baik dan lebih abadi. Hal ini adalah sebuah isyarat bahwa seorang hamba bila ia merasakan dorongan-dorongan jiwanya condong kepada suatu kondisi yang berasaskan hawa nafsu dan membahayakan dirinya, hendaknya ia ingatkan jiwanya itu dengan apa yang dijanjikan oleh Allah bagi orang yang mampu menahan nafsunya tersebut, dan mendahulukan keridhaan Allah daripada keridhaan dirinya sendiri, karena hal itu merupakan dorongan bagi jiwa dalam melaksanakan perintah Allah, walaupun hal itu berat baginya. Kemudian Allah berfirman dengan maksud mengingatkan mereka tentang kondisi mereka pertama kali sebelum mereka diberi petunjuk kepada Islam, “Begitu jugalah keadaan kamu dahulu, lalu Allah menganugerahkan nikmatNya ata kamu.” Maksudnya, sebagaimana Allah memberikan hidayahNya kepada kalian setelah kesesatan kalian, dan sebagaimana hidayah itu kalian dapatkan sedikit demi sedikit, begitu pula selain kalian, maka memahami secara sempurna akan kondisinya pertama kali yang kurang dan muamalahnya terhadap orang yang sama seperti kondisinya dengan tuntutan pengetahuannya tentang kondisinya pertama kali dan seruannya untuk orang tersebut dengan hikmah dan nasihat yang baik adalah di antara sebab-sebab yang paling besar dalam memberikan faidah dan manfaat kepadanya, karena itulah Allah mengulangi perintah untuk teliti dalam FirmanNya, “Maka telitilah,” dan orang yang keluar berjihad di jalan Allah dan berjuang memerangi musuh-musuh Allah serta menyiapkan diri dengan berbagai persiapan demi mengalahkan mereka, dia diperintahkan untuk teliti terhadap orang yang mengucapkan salam kepadanya, karena ada indikasi kuat yang menunjukkan bahwa tindakan itu hanyalah sebagai suatu jalan menghindar dari pembunuhan dan khawatir akan dirinya, sesungguhnya hal itu menunjukkan perintah untuk teliti dan berhati-hati dalam segala kondisi di mana terjadi suatu perkara yang samar padanya, dan seorang hamba harus meneliti masalah itu hingga masalah tersebut jelas baginya dan teranglah maksud dan kebenarannya. “Sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan,” hingga Allah membalas setiap orang atas apa yang telah diperbuat dan diniatkannya sesuai dengan apa yang diketahuiNya dari kondisi hamba-hambaNya dan niat-niat mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 94: Hai orang-orang yang ber- iman! Apabila kamu pergi (berperang) di jalan Allah, hendaklah yakinkan, dan janganlah kamu berkata kepada orang yang kamu memberi salam kepada \"Engkau bukan Mu'min\" (karena) kamu maukan benda penghidupan dunia, padahal di sisi Allah ada beberapa banyak harta. Begitulah juga keadaan kamu lebih dahulu, lalu Allah beri kurnia atas kamu. Lantaran itu, yakinkanlah, karena Allah itu adalah amat Mengetahui apa-apa yang kamu kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Ibnu Abbas radhiyallahu 'anhuma tentang ayat, \"Wa laa taquuluu liman alqaa ilaikumus salaam lasta mu'minaa.\" Ia berkata., \"Pernah ada seseorang yang sedang membawa kambingnya lalu ditemui oleh kaum muslimin, orang itu berkata, \"As Salaamu 'alaikum.\" Namun mereka malah membunuhnya dan mengambil kambingnya, maka Allah menurunkan ayat tentang hal itu sampai,\"Mencari harta benda kehidupan dunia.\" Yakni kambing tersebut. Yakni ucapan \"As Salaamu 'alaikum\" atau mengucapkan \"Laa ilaaha illallah.\" Yakni ghanimah (harta rampasan perang). Yakni sebagaimana Dia menunjuki kamu yang sebelumnya tersesat, Dia menunjuki pula orang yang lain. Demikian juga karena hidayah itu kamu peroleh sedikit demi sedikit, maka orang lain pun sama memperolehnya sedikit demi sedikit. Dengan melihatnya orang yang sempurna terhadap keadaannya yang kurang dahulu, lalu ia menyikapi orang lain dengan memperhatikan hal itu kemudian mengajak orang lain dengan hikmah dan nasehat yang baik merupakan sebab terbesar yang dapat memberinya manfaat dan orang lain pun dapat mengambil manfaat itu. Jika orang yang keluar berjihad fii sabilillah untuk memerangi musuh Allah diperintahkan untuk meneliti lebih dahulu terhadap orang yang menyampaikan salam, sedangkan qarinah (tanda) yang menunjukkan bahwa ia mengucapkan salam hanyalah untuk menjaga diri agar tidak dibunuh begitu kuat, maka dalam keadaan lain yang di sana terdapat kesamaran juga diperintahkan untuk meneliti lebih dulu sampai perkaranya jelas dan diketahui yang benar dan yang salah. Dia akan memberikan balasan terhadap amal dan niat seseorang mengikuti pengetahuan-Nya terhadap keadaan hamba dan niat mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 94",
    "description": "Pada ayat yang lalu Allah telah menegaskan hukuman yang amat pedih bagi seseorang yang melakukan pembunuhan dengan sengaja. Pada ayat ini Allah memberikan peringatan kepada kaum muslim untuk berhati-hati agar tidak terjerumus ke dalam pembunuhan. Salah satu kesempatan yang memungkinkan terjadinya pembunuhan dengan sengaja itu ialah pada waktu terjadinya peperangan dengan seseorang atau sekelompok yang tidak dikenal. Wahai orang-orang yang beriman! berhati-hatilah dalam mengambil keputusan untuk membunuh seseorang. Karena itu, apabila kamu pergi melakukan perjalanan di atas bumi, baik untuk berperang dan atau untuk tugas apa pun di jalan Allah, maka telitilah dan carilah keterangan yang pasti tentang orang yang kamu hadapi itu dan jangan kamu melakukan tindakan apa pun kepadanya kalau kamu ragu dan janganlah kamu mengatakan kepada orang atau siapa pun yang mengucapkan salam, yakni orang yang mengucapkan kalimat la' ila'ha illalla'h, kepadamu, kamu bukan seorang yang beriman, lalu kamu membunuhnya dengan maksud mencari harta benda kehidupan dunia dari pembunuhan itu, padahal di sisi Allah ada harta yang banyak, yang lebih baik daripada apa yang kamu dapatkan dari harta rampasan peperangan itu, yaitu pahala yang berlipat ganda yang disediakan oleh Allah di akhirat. Begitu jugalah keadaan kamu dahulu, ketika kamu kafir, sebelum kamu beriman, menyembunyikan keimananmu, lalu Allah memberikan nikmat-Nya berupa nikmat iman kepadamu lalu kamu beriman seperti sekarang ini, maka telitilah dengan pasti sebelum kamu bertindak kepadanya. Sungguh, Allah mahateliti terhadap apa yang kamu kerjakan dan maha memberi balasan atas apa yang kamu lakukan tidaklah sama derajat yang diperoleh antara orang beriman yang duduk, yakni yang tidak turut berperang tanpa mempunyai uzur atau halangan, yakni alasan yang dibenarkan agama, dan orang yang berjihad menegakkan agama-Nya di jalan Allah dengan harta dan jiwanya. Allah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orangorang yang duduk, tidak ikut berperang tanpa halangan yang dibenarkan agama dengan kelebihan satu derajat. Kepada masing-masing dari dua kelompok tadi, Allah menjanjikan pahala yang baik berupa surga, dan Allah melebihkan orang-orang yang berjihad, baik dengan harta atau dengan jiwa saja atas orang yang duduk dengan pahala yang besar, yaitu beberapa derajat yang didapatnya daripada-Nya, serta ampunan atas dosa-dosa mereka dan rahmat yang selalu tercurah kepada mereka. Allah maha pengampun atas dosa-dosa mereka, maha penyayang dengan curahan rahmat-Nya kepada mereka."
  }
]