[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidaklah sama antara orang yang tidak ikut serta berjihad di jalan Allah (yang bukan orang-orang yang punya udzur dari kaum Mukminin),dengan orang-orang yang berjihad di jalan Allah dengan harta-harta dan jiwa-jiwa mereka .Allah memberikan keutamaan bagi orang-orang yang berjihad atas orang-orang yang duduk tidak berjihad, dan mengangkat kedudukan mereka ke derajat yang tinggi di surga.Dan sungguh Allah telah menjanjikan kepada masing-masing dari orang-orang yang berjihad dengan harta dan jiwa mereka,dan orang-orang yang duduk(tidak berjihad) dari orang-orang yang mempunyai udzur berupa surge dikerenakan apa yang telah mereka kerahkan dan korbankan dijalan kebenaran.Dan Allah melebihkan orang-orang yang berjihad atas orang-orang yang duduk(tidak berjihad) dengan pahala yang besar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Tidaklah sama antara orang-orang mukmin yang tidak berjihad fi sabilillah tanpa alasan yang bisa diterima seperti sakit serta buta dan orang-orang mukmin yang berjihad di jalan Allah dengan mengorbankan harta benda dan diri mereka. Allah memberikan keutamaan bagi orang-orang yang berjihad di jalan Allah dengan menggunakan harta benda dan diri mereka berupa satu derajat lebih tinggi dari orang-orang yang tidak berjihad. Masing-masing dari mereka yang berjihad dan yang tidak berjihad dengan alasan yang dibenarkan akan mendapatkan ganjaran yang menjadi haknya. Akan tetapi Allah akan memberikan keutamaan kepada orang-orang yang berjihad dengan memberikan ganjaran yang lebih besar dari mereka yang tidak berjihad."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95-96. Allah menjelaskan tentang perbedaan antara orang-orang beriman yang tidak pergi berjihad -tanpa ada alasan yang dibenarkan seperti sakit, buta, berusia senja- dengan orang-orang yang berperang di jalan Allah dengan harta dan jiwa mereka. Allah mengutamakan orang-orang yang berjihad atas orang-orang yang tidak pergi berjihad dengan derajat yang tinggi di surga. dan untuk kedua Golongan ini- orang yang berjihad dan orang yang tidak berjihad- telah Allah janjikan kepada mereka surga. Allah mengutamakan orang-orang yang berjihad atas orang-orang yang tidak berjihad dengan pahala yang besar karena telah mengorbankan jiwa dan harta mereka. Dan pahala ini berupa derajat yang tinggi di surga, penghapusan dosa, dan rahmat yang luas. Dan Allah Maha Pengampun bagi hamba-Nya yang bertaubat dan Maha Pengasih terhadap seluruh hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. غَيْرُ أُو۟لِى الضَّرَرِ (yang tidak mempunyai ‘uzur) (أولي الضرر) adalah mereka yang mempunyai uzur sehingga mereka tidak bisa mengikuti jihad, dan dalam hati mereka terdapat niat dan tekat untuk pergi berjihad seandainya mereka tidak dihalangi oleh uzur tersebut; mereka mempunyai derajat dan pahala yang sama dengan para mujahidin. دَرَجَةً ۚ (satu derajat) Ini adalah penjelasan perbedaan derajat antara dua golongan yakni golongan orang-orang yang berjihad dan golongan orang-orang yang tidak ikut berjihad, dan maknanya adalah mereka yang berjihad ditinggikan dengan pujian dan sanjungan dari Allah. وَكُلًّا(Kepada masing-masing mereka) Yakni golongan orang-orang yang berjihad dan golongan orang-orang yang tidak ikut berjihad keduannya dijanjikan Allah dengan kebaikan. الْحُسْنَىٰ ۚ (pahala yang baik) Yakni balasan pahala berupa surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95 Tidaklah sama derajat dan pahala antara orang-orang mukmin yang yang tidak ikut berperang - sedangkan mereka juga tidak mempunyai halangan berupa sakit, buta atau lemah - dengan orang-orang yang berjuang untuk meninggikan kalimat Allah dengan harta dan jiwa mereka. Allah telah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orang-orang yang tidak ikut berperang satu derajat dengan menjadikan pangkat yang tinggi untuk mereka di akhirat. Kepada masing-masing antara dua kelompok itu, yaitu orang yang berperang dan tidak, Allah menjanjikan pahala yang baik (surga) atas dasar iman dan niat baik mereka dan Allah melebihkan orang-orang yang berjihad dari pada orang yang tidak ikut berperang dengan pahala yang besar, Ini adalah pleonasi (kelebihan) dan penekanan sebagaimana ayat selanjutnya. Zaid bin Tsabit berkata: Ketika aku bersama Nabi saat itu turun ayat laa yastawi.... fi sabilillah. dan tidak disebutkan ulidh dhoror. Maka Ibnu Ummi Maktum berkata bagaimana bisa, saya ini memang buta dan tidak bisa melihat. Kemudian turunlah ayat ghoiro ulid dhoror."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak sama orang-orang yang duduk} orang-orang yang tidak ikut berjihad {dari golongan orang-orang mukmin tanpa mempunyai uzur} orang-orang yang mempunyai alasan {dan orang-orang yang berjihad di jalan Allah dengan harta dan jiwa mereka. Allah melebihkan derajat orang-orang yang berjihad dengan harta dan jiwa mereka atas orang-orang yang duduk derajat. Kepada masing-masing} masing-masing kelompok dari orang-orang uang berjihad {Allah menjanjikan yang terbaik, Allah melebihkan orang-orang yang berjihad atas orang-orang yang duduk dengan pahala yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95-96. Maksudnya, tidaklah sama orang yang berjihad di antara kaum Mukminin dengan mempersembahkan diri dan hartanya dengan orang yang tidak keluar berjihad dan tidak berjuang melawan musuh-musuh Allah, hal ini merupakan anjuran untuk keluar berjihad dan dorongan kepada hal tersebut, juga ancaman dari bermalas-malasan dan tidak ikut serta tanpa ada alasan yang benar, adapun orang-orang yang memiliki udzur seperti orang sakit, orang buta, pincang dan yang tidak memiliki apa pun untuk mempersiapkan dirinya berperang, maka mereka itu tidaklah termasuk dari orang-orang yang ikut serta tanpa udzur, barangsiapa yang termasuk dalam kelompok orang yang tidak ikut serta tanpa udzur, dan barangsiapa yang termasuk dalam kelompok itu namun ia ridha dengan ketidakhadirannya dan tidak berniat ikut berjihad di jalan Allah, sekiranya tidak ada penghalang dan tidak pula ia berbisik kepada dirinya untuk berjihad, maka sesungguhnya ia termasuk dalam kelompok orang yang tidak ikut serta tanpa udzur, dan barangsiapa yang bertekad untuk ikut berjihad di jalan Allah sekiranya tidak ada penghalang dan ia berharap serta berbisik kepada dirinya untuk ikut serta, maka ia termasuk dalam kelompok orang yang ikut berjihad, karena niat yang kuat apabila diikuti oleh kondisi yang memungkinkan, baik perkataan maupun perbuatan orang itu, akan diposisikan dalam posisi orang yang berbuat. Kemudian Allah tegaskan tentang keutamaan orang-orang yang berjihad atas orang-orang yang tidak ikut serta berjihad dengan suatu derajat, yaitu kemuliaan, dan keutamaan tersebut adalah dalam bentuk global, kemudian Allah menegaskan hal tersebut dalam bentuk yang lebih rinci, menjanjikan ampunan bagi mereka yang datang dari Rabb mereka dan rahmat yang meliputi segala kebaikan dan perlindungan dari segala keburukan, dan derajat yang dijelaskan oleh Nabi dalam hadits yang tsabit darinya dalam kitab shohihain \"bahwasanya di surge itu ada 100 derajat, dan jarak setiap derajat itu adaah sejarak langit dan bumi, Allah menyiapkannya untuk para mujahid di jalan Allah\". Ganjaran yang telah disiapkan oleh Allah tersebut untuk amal berjihad serupa dengan yang ada dalam surat ash-Shaf dalam FirmanNya,: \"Hai orang-orang yang beriman, sukakah kamu aku tunjukkan suatu perniagaan yang dapat menyelamatkanmu dari azab yang pedih? (yaitu) kamu beriman kepada Allah dan Rasul-Nya dan berjihad di jalan Allah dengan harta dan jiwamu. Itulah yang lebih baik bagimu, jika kamu mengetahui. Niscaya Allah akan mengampuni dosa-dosamu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai; dan (memasukkan kamu) ke tempat tinggal yang baik di dalam jannah ‘Adn. Itulah keberuntungan yang besar Dan (ada lagi) karunia yang lain yang kamu sukai (yaitu) pertolongan dari Allah dan kemenangan yang dekat (waktunya). Dan sampaikanlah berita gembira kepada orang-orang yang beriman. Hai orang-orang yang beriman, jadilah kamu penolong (agama) Allah sebagaimana Isa ibnu Maryam telah berkata kepada pengikut-pengikutnya yang setia: “Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?” Pengikut-pengikut yang setia itu berkata: “Kamilah penolong-penolong agama Allah”, lalu segolongan dari Bani Israil beriman dan segolongan lain kafir; maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka, lalu mereka menjadi orang-orang yang menang.\" (Ash-Shaf:10-14). Perhatikanlah betapa indahnya perpindahan dari suatu kondisi kepada kondisi yang lebih tinggi darinya, sesungguhnya hal itu merupakan peniadaan akan persamaan, yang pertama anytara seorang mujahid dengan selainnya, kemudian Allah menegaskan keutamaan seorang mujahid atas seorang yang tidak ikut serta berperang dengan satu derajat, kemudian Allah berpindah kepada penyebutan akan keutamaannya dengan ampunan, rahmat, dan derajat. Perpindahan dari suatu kondisi kepada kondisi yang lebih tinggi ketika sedang mengutamakan dan memuji atau perpindahan dari suatu kondisi kepada kondisi yang lebih rendah darinya ketika sedang memberikan celaan dan hinaan adalah merupakan ungkapan yang paling indah dan paling menyentuh jiwa. Demikian pula apabila Allah mengutamakan sesuatu atas sesuatu yang lain, sementara setiap dari kedua hal tersebut memiliki keutamaan, maka Allah menjaganya dengan cara menyebut keutamaan yang mencakup bagi kedua perkara tersebut (untuk menjaga) agar tidak ada seorang pun mengira bahwa hal itu merupakan celaan terhadap hal yang tidak diutamakan (al-Mufadhal alaih), sebagaimana Allah berfirman disini, “Kepada masing-masing mereka, Allah menjanjikan pahala yang baik (surga).” Dan sebagaimana Allah juga berfirman \"dan beri kabar gembira orang-orang yang beriman\" Sebagaimana firman-Nya juga \"tidak sama dianatar kalian orang yang berinfak sebelum fath mekah dan berperang\" yakni dai orang yang tidak seperti itu. Kemudian Allah berfirman disini, “Kepada masing-masing mereka, Allah menjanjikan pahala yang baik (surga).” Oleh karena itu, seyogyanya orang yang mencari keutamaan di antara beberapa orang, kelompok dan pekerjaan agar memahami poin ini. Demikian juga seandainya ia berbicara tentang pencelaan terhadap beberapa orang atau terhadap ucapan-ucapan, ia menyebutkan suatu hal yang menunjukkan adanya kesamaan saat pengutamaan sebagian mereka atas sebagian yang lain, agar memperoleh kesempurnaan, sebagaimana jika dikatakan bahwa orang-orang Nasrani lebih baik dari orang-orang Majusi, sebaiknya ia juga berkata bahwa setiap dari kedua pihak itu adalah orang-orang kafir. Pembunuhan itu lebih keji daripada kemaksiatan yang besar yang diharamkan oleh Allah dan RasulNya. Tatkala Allah menjanjikan orang-orang yang berjihad dengan ampunan dan rahmat yang datang dari dua nama Allah yang mulia Yaitu Yang Maha Pengampun lagi Maha Penyayang, Allah menutup ayat ini dengan kedua namaNya tersebut seraya berfirman, “Dan Allah Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 95: Orang-orang yang duduk dari Mu'minin yang tidak berhalangan itu, tidak sama dengan mereka yang berperang di jalan Allah dengan harta-harta mereka dan diri- diri mereka. Allah muliakan mereka yang sungguh-sungguh bekerja de- ngan harta-harta mereka dan diri-diri mereka, lebih satu derajat daripada orang-orang yang duduk; tetapi tiap-tiap satu dari dua golongan itu, Allah telah janjikan kebaikan, dan Allah lebihkan yang bekerja keras atas orang-orang yang duduk, (dengan) ganjaran yang besar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Barra' bin 'Azib, ia berkata: Ketika turun ayat, \"Tidaklah sama antara orang beriman yang duduk (yang tidak ikut berperang)…dst.\" Rasulullah shallallahu 'alaihi wa sallam memanggil Zaid, lalu ia datang dengan membawa tulang, kemudian Beliau menuliskan di atasnya, dan Ibnu Ummi Maktum mengeluhkan buta yang menimpanya, maka turunlah ayat, \"Tidaklah sama antara orang beriman yang duduk (yang tidak ikut berperang)…dst.\" Imam Bukhari juga meriwayatkan dari Sahl bin Sa'ad As Saa'idiy ia berkata: Saya pernah melihat Marwan bin Hakam duduk di masjid, lalu saya datang dan duduk di sampingnya, kemudian ia memberitahukan kami bahwa Zaid bin Tsabit memberitahukan kepadanya bahwa Rasulullah shallallahu 'alaihi wa sallam mendiktekan kepadanya, \"Tidaklah sama antara orang beriman yang duduk (yang tidak ikut berperang)…dst.\" ia melanjutkan kata-katanya, \"Lalu datanglah Ibnu Ummi Maktum, ia yang mendiktekan ayat tersebut kepada saya. Ia (Ibnu Ummi Maktum) berkata, \"Wahai Rasulullah, jika sekiranya saya sanggup berjihad tentu saya akan berjihad -ia adalah seorang yang buta- , maka Allah Tabaaraka wa Ta'aala menurunkan ayat kepada Rasul-Nya, sedangkan ketika itu pahanya di atas pahaku sehingga aku merasakan keberatan sampai saya khawatir paha saya akan patah hingga kemudian lepas.\" Ketika itu, Allah Azza wa Jalla menurunkan ayat, \"ghairu ulidh dharar (lih. ayat di atas).\" Imam Tirmidzi meriwayatkan dari Ibnu Abbas, ia berkata tentang ayat, \"Tidaklah sama antara orang beriman yang duduk (yang tidak ikut berperang) tanpa mempunyai 'uzur (halangan)…dst.\" bahwa ia turun berkenaan dengan perang Badar dan orang-orang yang keluar ke Badar. Ketika terjadi perang Badar, Abdullah bin Jahsy dan Ibnu Ummi Maktum berkata, \"Sesungguhnya kami dua orang yang buta wahai Rasulullah, adakah rukhshah bagi kami?\" Maka turunlah ayat, \"Tidaklah sama antara orang beriman yang duduk (yang tidak ikut berperang) tanpa mempunyai 'uzur (halangan) dengan orang yang berjihad di jalan Allah dengan harta dan jiwanya. Allah melebihkan derajat orang-orang yang berjihad dengan harta dan jiwanya atas orang-orang yang duduk (tidak ikut berperang)…dst.\" Mereka yang duduk tanpa ada uzur dikalahkan oleh oleh orang-orang yang berjihad, Allah melebihkan orang-orang yang berjihad di atas orang-orang yang duduk dengan pahala yang besar.\" (Hadits ini hasan gharib dari jalan ini dari hadits Ibnu Abbas, sedangkan Muqsim (salah satu perawi) ada yang mengatakan sebagai Maula Abdullah bin Abbas, dan Muqsim dipanggil Abul Qasim, dan Abdullah bin Jahsy bukanlah seorang yang buta. Al Haafizh menguatkan dalam Al Fat-h bahwa yang benar adalah Abu Ahmad bin Jahsy sebagaimana dalam riwayat Thabari dari Al Hajjaj (9/92). Thabrani juga meriwayatkan, Al Haitsami juz 9 hal. 9 berkata, \"Para perawinya adalah tsiqah dari hadits Zaid bin Arqam yang sama seperti hadits itu.\") Dalam ayat ini terdapat dorongan untuk keluar berjihad dan tarhib (pencitraan buruk) terhadap sikap malas atau enggan berjihad tanpa udzur. Berbeda dengan orang-orang yang sedang menderita, seperti sakit, buta, pincang dan orang yang tidak memperoleh perlengkapan perang, maka mereka tidak dikatakan sebagai orang yang duduk diam tidak berjihad. Namun, jika di antara orang-orang yang menderita itu ridha dengan duduknya tidak berjihad, tidak ada niat untuk keluar berjihad fii sabilillah jika tidak ada udzur, atau bahkan tidak ada rasa ingin berjihad, maka ia tergolong orang yang duduk tidak berjihad. Tetapi, orang yang berniat keras untuk keluar berjihad fii sabilillah jika udzurnya hilang dan ia berharap sekali untuk berjihad, maka ia menduduki posisi orang yang berjihad karena niatnya yang sesungguhnya. Allah Subhaanahu wa Ta'aala menyebutkan kedudukan para mujahid secara berpindah-pindah, dari yang rendah kepada yang tinggi, lebih tinggi dst. Di awal, Allah menafikan adanya kesamaan antara orang-orang yang berjihad dengan yang tidak berjihad, selanjutnya Allah menegaskan kedudukan mujahid di atas orang yang duduk tidak berjihad dan selanjutnya Allah menjanjikan akan memberikan ampunan, rahmat dan beberapa derajat. Penyebutan secara berpindah-pindah dari bawah ke atas dst. merupakan pengutamaan dan pujian, sedangkan penyebutan dari bawah dst. ke bawah merupakan perendahan dan pencelaan. Yang demikian adalah lafaz yang paling indah dan lebih masuk ke hati. Demikian juga ketika Allah Subhaanahu wa Ta'aala melebihkan sesuatu di atas sesuatu, namun masing-masingnya mendapatkan karunianya, Allah Subhaanahu wa Ta'aala menyebutkan ihtiraz (penjagaan) agar tidak ada sangkaan keliru, seperti sangkaan tercelanya orang yang kalah keutamaannya tersebut, oleh karenanya Allah berfirman, \"Kepada masing-masing, Allah menjanjikan pahala yang baik (surga)\". Dalam ayat ini disebutkan tingginya kedudukan mujahidin secara ijmal (garis besar), dan pada ayat selanjutnya disebutkan secara tafsil (rinci), seperti dijanjikan akan mendapatkan ampunan, rahmat yang tidak lain merupakan keberhasilan mendapat semua kebaikan dan terhindar dari semua keburukan. Dalam hadits, Rasulullah shallallahu 'alaihi wa sallam menerangkan lebih rinci derajat mujahidin, yakni bahwa di surga ada 100 derajat, di mana antara derajat yang satu dengan yang lain seperti jarak antara langit dengan bumi, Allah menyiapkan derajat itu untuk orang-orang yang berjihad di jalan-Nya. Maksudnya yang tidak berperang karena uzur. Maksudnya yang tidak berperang tanpa alasan. Sebagian ahli tafsir mengartikan qaa'idiin di sini sama seperti sebelumnya, yaitu yang tidak berperang karena uzur, wallahu a'lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 95",
    "description": "Tidaklah sama derajat yang diperoleh antara orang beriman yang duduk, yakni yang tidak turut berperang tanpa mempunyai uzur atau halangan, yakni alasan yang dibenarkan agama, dan orang yang berjihad menegakkan agama-Nya di jalan Allah dengan harta dan jiwanya. Allah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orangorang yang duduk, tidak ikut berperang tanpa halangan yang dibenarkan agama dengan kelebihan satu derajat. Kepada masing-masing dari dua kelompok tadi, Allah menjanjikan pahala yang baik berupa surga, dan Allah melebihkan orang-orang yang berjihad, baik dengan harta atau dengan jiwa saja atas orang yang duduk dengan pahala yang besar, yaitu beberapa derajat yang didapatnya daripada-Nya, serta ampunan atas dosa-dosa mereka dan rahmat yang selalu tercurah kepada mereka. Allah maha pengampun atas dosa-dosa mereka, maha penyayang dengan curahan rahmat-Nya kepada merekatidaklah sama derajat yang diperoleh antara orang beriman yang duduk, yakni yang tidak turut berperang tanpa mempunyai uzur atau halangan, yakni alasan yang dibenarkan agama, dan orang yang berjihad menegakkan agama-Nya di jalan Allah dengan harta dan jiwanya. Allah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orangorang yang duduk, tidak ikut berperang tanpa halangan yang dibenarkan agama dengan kelebihan satu derajat. Kepada masing-masing dari dua kelompok tadi, Allah menjanjikan pahala yang baik berupa surga, dan Allah melebihkan orang-orang yang berjihad, baik dengan harta atau dengan jiwa saja atas orang yang duduk dengan pahala yang besar, yaitu beberapa derajat yang didapatnya daripada-Nya, serta ampunan atas dosa-dosa mereka dan rahmat yang selalu tercurah kepada mereka. Allah maha pengampun atas dosa-dosa mereka, maha penyayang dengan curahan rahmat-Nya kepada mereka."
  }
]