[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pahala besar ini berupa tempat tinggal yang tinggi di surga-surga dari Allah ,diperuntukkan bagi hamba-hambanya yang berjihad di jalanNYA secara khusus,dan disertai dengan ampunan terhadap dosa-dosa mereka dan rahmat yang luas dan mereka bersenang-senang menikmatinya di dalam surga.Dan Allah maha pengampun bagi orang yang bertaubat dan kembali kepadaNYA,juga Maha penyayang terhadap orang-orang yang taat kepadaNYA,yang berjihad di jalanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Ganjaran tersebut kedudukannya bertingkat-tingkat, serta mereka akan memperoleh ampunan atas dosa-dosa mereka dan rahmat-Nya untuk mereka. Dan Allah Maha Pengampun lagi Maha Penyayang bagi hamba-hamba-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. دَرَجٰتٍ (beberapa derajat) Ada pendapat mengatakan yang dimaksud dengan derajat disini adalah derajat yang telah disebutkan sebelumnya. Dan pendapat lain menyebutkan bahwa yang dimaksud adalah satu derajat lebih tinggi dari derajat yang didapatkan oleh orang yang tidak bisa ikut berperang karena uzur. Dari Abu Hurairah, Rasulullah bersabda: “sesungguhnya didalam surga terdapat seratus derajat yang disiapkan bagi orang-orang yang berjihad di jalan Allah, antara satu derajat dengan derajat yang lain sebagaimana antara langit dan bumi”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96 Allah telah menyiapkan kepada orang-orang yang berperang di jalan Allah dengan beberapa derajat yang tinggi di surga sesuai dengan tingkatan amal mereka, ampunan ats dosa mereka serta rahmat dari-Nya. Allah Maha Pengampun atas dosa para hamba-Nya lagi Maha Penyayang kepada orang-orang yang bertaubat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Beberapa derajat} tempat yang bertingkat {dariNya, serta ampunan dan rahmat. Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95-96. Maksudnya, tidaklah sama orang yang berjihad di antara kaum Mukminin dengan mempersembahkan diri dan hartanya dengan orang yang tidak keluar berjihad dan tidak berjuang melawan musuh-musuh Allah, hal ini merupakan anjuran untuk keluar berjihad dan dorongan kepada hal tersebut, juga ancaman dari bermalas-malasan dan tidak ikut serta tanpa ada alasan yang benar, adapun orang-orang yang memiliki udzur seperti orang sakit, orang buta, pincang dan yang tidak memiliki apa pun untuk mempersiapkan dirinya berperang, maka mereka itu tidaklah termasuk dari orang-orang yang ikut serta tanpa udzur, barangsiapa yang termasuk dalam kelompok orang yang tidak ikut serta tanpa udzur, dan barangsiapa yang termasuk dalam kelompok itu namun ia ridha dengan ketidakhadirannya dan tidak berniat ikut berjihad di jalan Allah, sekiranya tidak ada penghalang dan tidak pula ia berbisik kepada dirinya untuk berjihad, maka sesungguhnya ia termasuk dalam kelompok orang yang tidak ikut serta tanpa udzur, dan barangsiapa yang bertekad untuk ikut berjihad di jalan Allah sekiranya tidak ada penghalang dan ia berharap serta berbisik kepada dirinya untuk ikut serta, maka ia termasuk dalam kelompok orang yang ikut berjihad, karena niat yang kuat apabila diikuti oleh kondisi yang memungkinkan, baik perkataan maupun perbuatan orang itu, akan diposisikan dalam posisi orang yang berbuat. Kemudian Allah tegaskan tentang keutamaan orang-orang yang berjihad atas orang-orang yang tidak ikut serta berjihad dengan suatu derajat, yaitu kemuliaan, dan keutamaan tersebut adalah dalam bentuk global, kemudian Allah menegaskan hal tersebut dalam bentuk yang lebih rinci, menjanjikan ampunan bagi mereka yang datang dari Rabb mereka dan rahmat yang meliputi segala kebaikan dan perlindungan dari segala keburukan, dan derajat yang dijelaskan oleh Nabi dalam hadits yang tsabit darinya dalam kitab shohihain \"bahwasanya di surge itu ada 100 derajat, dan jarak setiap derajat itu adaah sejarak langit dan bumi, Allah menyiapkannya untuk para mujahid di jalan Allah\". Ganjaran yang telah disiapkan oleh Allah tersebut untuk amal berjihad serupa dengan yang ada dalam surat ash-Shaf dalam FirmanNya,: \"Hai orang-orang yang beriman, sukakah kamu aku tunjukkan suatu perniagaan yang dapat menyelamatkanmu dari azab yang pedih? (yaitu) kamu beriman kepada Allah dan Rasul-Nya dan berjihad di jalan Allah dengan harta dan jiwamu. Itulah yang lebih baik bagimu, jika kamu mengetahui. Niscaya Allah akan mengampuni dosa-dosamu dan memasukkanmu ke dalam jannah yang mengalir di bawahnya sungai-sungai; dan (memasukkan kamu) ke tempat tinggal yang baik di dalam jannah ‘Adn. Itulah keberuntungan yang besar Dan (ada lagi) karunia yang lain yang kamu sukai (yaitu) pertolongan dari Allah dan kemenangan yang dekat (waktunya). Dan sampaikanlah berita gembira kepada orang-orang yang beriman. Hai orang-orang yang beriman, jadilah kamu penolong (agama) Allah sebagaimana Isa ibnu Maryam telah berkata kepada pengikut-pengikutnya yang setia: “Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?” Pengikut-pengikut yang setia itu berkata: “Kamilah penolong-penolong agama Allah”, lalu segolongan dari Bani Israil beriman dan segolongan lain kafir; maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka, lalu mereka menjadi orang-orang yang menang.\" (Ash-Shaf:10-14). Perhatikanlah betapa indahnya perpindahan dari suatu kondisi kepada kondisi yang lebih tinggi darinya, sesungguhnya hal itu merupakan peniadaan akan persamaan, yang pertama anytara seorang mujahid dengan selainnya, kemudian Allah menegaskan keutamaan seorang mujahid atas seorang yang tidak ikut serta berperang dengan satu derajat, kemudian Allah berpindah kepada penyebutan akan keutamaannya dengan ampunan, rahmat, dan derajat. Perpindahan dari suatu kondisi kepada kondisi yang lebih tinggi ketika sedang mengutamakan dan memuji atau perpindahan dari suatu kondisi kepada kondisi yang lebih rendah darinya ketika sedang memberikan celaan dan hinaan adalah merupakan ungkapan yang paling indah dan paling menyentuh jiwa. Demikian pula apabila Allah mengutamakan sesuatu atas sesuatu yang lain, sementara setiap dari kedua hal tersebut memiliki keutamaan, maka Allah menjaganya dengan cara menyebut keutamaan yang mencakup bagi kedua perkara tersebut (untuk menjaga) agar tidak ada seorang pun mengira bahwa hal itu merupakan celaan terhadap hal yang tidak diutamakan (al-Mufadhal alaih), sebagaimana Allah berfirman disini, “Kepada masing-masing mereka, Allah menjanjikan pahala yang baik (surga).” Dan sebagaimana Allah juga berfirman \"dan beri kabar gembira orang-orang yang beriman\" Sebagaimana firman-Nya juga \"tidak sama dianatar kalian orang yang berinfak sebelum fath mekah dan berperang\" yakni dai orang yang tidak seperti itu. Kemudian Allah berfirman disini, “Kepada masing-masing mereka, Allah menjanjikan pahala yang baik (surga).” Oleh karena itu, seyogyanya orang yang mencari keutamaan di antara beberapa orang, kelompok dan pekerjaan agar memahami poin ini. Demikian juga seandainya ia berbicara tentang pencelaan terhadap beberapa orang atau terhadap ucapan-ucapan, ia menyebutkan suatu hal yang menunjukkan adanya kesamaan saat pengutamaan sebagian mereka atas sebagian yang lain, agar memperoleh kesempurnaan, sebagaimana jika dikatakan bahwa orang-orang Nasrani lebih baik dari orang-orang Majusi, sebaiknya ia juga berkata bahwa setiap dari kedua pihak itu adalah orang-orang kafir. Pembunuhan itu lebih keji daripada kemaksiatan yang besar yang diharamkan oleh Allah dan RasulNya. Tatkala Allah menjanjikan orang-orang yang berjihad dengan ampunan dan rahmat yang datang dari dua nama Allah yang mulia Yaitu Yang Maha Pengampun lagi Maha Penyayang, Allah menutup ayat ini dengan kedua namaNya tersebut seraya berfirman, “Dan Allah Maha Pengampun lagi Maha Penyayang.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 96: (Yaitu) beberapa derajat dari pada Nya dan keampunan dan rahmat, karena Pengampun, Penyayang. adalah Allah itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni dengan beberapa kedudukan, di mana yang satu berada di atas yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 96",
    "description": "Tidaklah sama derajat yang diperoleh antara orang beriman yang duduk, yakni yang tidak turut berperang tanpa mempunyai uzur atau halangan, yakni alasan yang dibenarkan agama, dan orang yang berjihad menegakkan agama-Nya di jalan Allah dengan harta dan jiwanya. Allah melebihkan orang-orang yang berjihad dengan harta dan jiwanya atas orangorang yang duduk, tidak ikut berperang tanpa halangan yang dibenarkan agama dengan kelebihan satu derajat. Kepada masing-masing dari dua kelompok tadi, Allah menjanjikan pahala yang baik berupa surga, dan Allah melebihkan orang-orang yang berjihad, baik dengan harta atau dengan jiwa saja atas orang yang duduk dengan pahala yang besar, yaitu beberapa derajat yang didapatnya daripada-Nya, serta ampunan atas dosa-dosa mereka dan rahmat yang selalu tercurah kepada mereka. Allah maha pengampun atas dosa-dosa mereka, maha penyayang dengan curahan rahmat-Nya kepada merekasesungguhnya orang-orang yang dimatikan atau dicabut nyawanya oleh malaikat maut setelah sampai ajal yang telah ditetapkan oleh Allah kepada mereka dalam kehidupan di dunia ini, sementara mereka sebelumnya berada dalam keadaan menzalimi diri mereka sendiri karena enggan melakukan tuntunan agama padahal mereka mempunyai kesanggupan, mereka, para malaikat pencabut nyawa mereka itu, bertanya kepada mereka, dalam keadaan bagaimana kamu dahulu ketika kalian hidup sehingga tidak melakukan tuntunan agama, tidak berjihad dan tidak pula berhijrah' mereka menjawab, kami dulu adalah orang-orang yang tertindas dan tak berdaya di bumi mekah. Mereka, para malaikat, berkata untuk menolak alasan mereka, bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah atau berpindah di bumi itu dari daerah kufur ke daerah lain di mana kalian dapat melakukan tuntunan agama' maka Allah menyatakan bahwa mereka yang dimatikan dalam keadaan menzalimi diri sendiri itu adalah orang-orang yang tempatnya di neraka jahanam dan mendapat siksaan yang amat pedih, dan jahanam itu seburuk-buruk tempat kembali."
  }
]