[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang telah diwafatkan mereka oleh para malaikat,sedang mereka dalam keadaan menzolimi diri mereka sendiri dengan tetap tinggal di daerah kafir dan tidak berhijrah,para malaikat bertanya kepada mereka sebagai bentuk celaan terhadap mereka, ”dalam keadaan bagaimanakah kalian terkait urusan agama kalian?”maka mereka menjawab, ”kami orang-orang yang lemah di kampung halaman kami,tidak berdaya untuk menolak kezhaliman dan penindasan dari diri kami.”maka para malaiakat menjawab untuk mencela mereka, ”bukankah bumi Allah itu luas,sehingga kalian bisa keluar dari daerah kalian menuju daerah lainnya,dimana nanti kalian akan merasa aman terhadap agama kalian?” dan mereka,tempat mereka adalah neraka,dan neraka adalah seburuk-buruk tempat kembali dan tempat berpulang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Sesungguhnya orang-orang yang dicabut nyawanya oleh para malaikat dalam kondisi menganiaya diri mereka sendiri dengan menolak meninggalkan negeri yang kafir dan berhijrah ke negeri Islam, maka para malaikat itu akan mencabut nyawa mereka sebagai teguran keras lantas berkata, “Bagaimana keadaan kalian dahulu (saat menolak hijrah)? Dan bagaimana kalian mampu membedakan diri dengan kaum musyrik? Mereka beralasan, “Ketika itu kami dalam keadaan lemah. Kami tidak mempunyai daya dan kekuatan untuk melindungi diri kami.” Lalu para malaikat menegur mereka dengan mengatakan, “Bukankah bumi Allah itu luas, sehingga kalian bisa pergi ke sana untuk melindungi agama kalian dan diri kalian dari penindasan dan tekanan?!” Maka orang-orang yang tidak mau berhijrah itu akan menempati tempat tinggal mereka di Neraka. Dan Neraka itu adalah tempat kembali dan tempat tinggal yang sangat buruk bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "97-99. Setelah Allah menjelaskan pahala bagi orang-orang yang pergi berjihad, kemudian Allah menyebutkan balasan bagi orang yang tidak pergi berjihad. Dia menyebutkan bahwa orang-orang yang diambil nyawanya oleh malaikat ketika telah datang ajal mereka saat mereka dalam keadaan menzalimi diri sendiri dengan rela tetap tinggal di rumahnya dan tidak pergi berjihad meski menanggung kehinaan dan kezaliman karena tidak mendapat kebebasan dalam menjalankan dan membela agama mereka; setelah mencabut nyawa mereka Para Malaikat akan berkata: Bagaimana kalian dahulu menjalankan agama?- yakni mereka tidak mampu menjalankan agama Padahal mereka mampu untuk berhijrah namun mereka enggan untuk melakukannya-. Mereka menjawab: \" kami tidak mampu menjalankan agama kami sebab kami di bawah tekanan orang-orang kafir sehingga kami tidak bisa menjalankan kewajiban agama\". jawaban mereka ini tidak diterima oleh malaikat sehingga malaikat menolak alasan kan yang mereka buat tersebut dengan berkata: \"Bukankah bumi Allah itu luas? Sehingga kalian dapat pergi ke tempat lain yang memungkinkan kalian untuk menjalankan perintah agama dan membebaskan kalian dari kehinaan yang tidak pantas ditanggung oleh seorang mukmin.\" Orang-orang yang Aku jelaskan keadaan mereka itu di akhirat akan Kami masukkan ke neraka jahanam akibat kewajiban yang mereka tinggalkan, dan neraka jahanam merupakan seburuk-buruk tempat kembali bagi mereka karena segala yang ada di dalamnya buruk bagi mereka. Orang-orang yang beralasan tidak mampu menjalankan agama mereka dan enggan enggan berhijrah kepada Allah dan rasulnya merupakan orang-orang yang tidak jujur dalam membuat alasan. Adapun ketidakmampuan yang sebenarnya merupakan alasan yang dapat diterima seperti orang-orang tua, orang-orang lemah, para wanita, dan anak-anak. Mereka merupakan orang-orang yang tidak memiliki jalan keluar dari masalah tersebut karena tidak mampu menaiki kendaraan atau tidak mengetahui jalan yang harus dilalui untuk berhijrah. Alasan yang dapat diterima ini dapat dikelompokkan menjadi 3 sebab yaitu, keadaan yang lemah seperti sakit atau tua, kemiskinan, dan tidak memiliki pengetahuan. Adapun yang dimaksud dengan anak-anak di sini yaitu remaja yang yang telah mendekati masa baligh yang yang telah mampu memahami sebagaimana pemahaman orang-orang dewasa sehingga mereka juga dibebani kewajiban untuk berhijrah, atau kewajiban mereka ini merupakan kewajiban wali mereka dalam membawa mereka keluar dari negeri orang-orang kafir. Orang-orang yang tidak mampu untuk berhijrah karena kelemahan atau tidak memiliki kemampuan untuk itu diharapkan Allah akan mengampuni mereka dan tidak menyiksa mereka karena tetap tinggal di Negeri orang-orang kafir. Dan Allah Maha Mengampuni dosa orang-orang yang memiliki alasan yang benar, sehingga Dia akan mengampuni dosa-dosa itu dan tidak menghukum pelakunya di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. إِنَّ الَّذِينَ تَوَفَّىٰهُمُ الْمَلٰٓئِكَةُ (Sesungguhnya orang-orang yang diwafatkan malaikat) Yakni diwafatkan malaikat dengan mencabut ruh mereka. ظَالِمِىٓ أَنفُسِهِمْ (dalam keadaan menganiaya diri sendiri) Mereka adalah orang-orang yang tidak berhijrah dari Makkah ke Madinah, dan menetap diantara orang-orang kafir yang melarang mereka untuk menunjukkan keislaman mereka dan menjalankan ibadah dan syariat agama, dan bisa jadi mereka akan dibunuh orang-orang beriman dalam peperangan melawan orang-orang kafir karena mereka tidak mengetahui bahwa mereka orang-orang yang beriman. فِيمَ كُنتُمْ ۖ (“Dalam keadaan bagaimana kamu ini?”) Para malaikat bertanya kepada mereka: “Dalam keadaan bagaimana kamu ini?” sebagai pertanyaan celaan; yakni bagaimana keadaan kalian dalam urusan agama kalian?. Pendapat lain mengatakan makna pertanyaan ini adalah “apakah kalian termasuk para sahabat Muhammad ataukah kalian adalah orang-orang musyrik?”. قَالُوا۟ كُنَّا مُسْتَضْعَفِينَ فِى الْأَرْضِ ۚ( Mereka menjawab: “kami adalah orang-orang yang tertindas di bumi”) Yakni kami tidak mampu untuk menunjukkan agama kami; maka malaikat menjawab: bukankah bumi Allah itu luas, sehingga kalian dapat berhijrah? أَلَمْ تَكُنْ أَرْضُ اللهِ وٰسِعَةً فَتُهَاجِرُوا۟ فِيهَا ۚ(“Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah di bumi itu?”) Sehingga kalian dapat terbebas dari kezaliman orang-orang kafir, dan dapat menyembah Allah bersama orang-orang beriman lainnya. Yang dimaksud dengan bumi disini adalah semua negeri yang dapat dijadikan tempat untuk berhijrah. Adapun yang dimaksud dengan kata ‘bumi’ yang pertama -yakni dalam kalimat “kami adalah orang-orang yang tertindas di bumi” adalah semua negeri yang harus berhijrah darinya. مَأْوَىٰهُمْ جَهَنَّمُ ۖ (Orang-orang itu tempatnya neraka Jahannam) Yakni mereka tidak memiliki tempat tinggal kecuali di nereka Jahannam. Ayat ini merupakan dalil diwajibkannya berhijrah dari negeri kafir menuju negeri Islam bagi orang yang tidak mampu menjalankan agamanya disana."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Seorang mutadabbir berkata : Aku belum menemukan dalam diriku pengaruh yang paling besar untuk mendorong motifasi diri seorang muslim, yang menjadikanya berkorban dengan segala yang dimilikinya demi mewujudkan cita-cita, selain daripada ayat yang mulia ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97 Sesungguhnya orang-orang yang diwafatkan malaikat dalam keadaan menganiaya diri sendiri, sebab mereka belum keluar dari negeri kufur sebagaimana hijrah dari Makkah ke Madinah pada masa awal Islam. Mereka tetap dalam kekufuran dan menyembunyikan keislaman mereka. Malaikat bertanya dengan menghina mereka: “Sebenarnya kalian ini dalam kelompok yang mana? Kalian bersama orang muslim atau orang musyrik? Mereka menjawab dengan rasa mempunyai halangan: “Kami ini adalah orang-orang yang lemah dan tidak mampu untuk mengungkapkan agama kami. Para malaikat berkata dengan kepada mereka dengan merendahkan mereka: “Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah di bumi itu dari negeri kufur menuju negeri iman?”. Orang-orang yang mengaku lemah dan rela untuk tetap bertahan di negeri kafir itu tempatnya adalah neraka Jahannam, dan Jahannam itu seburuk-buruk tempat kembali, Ayat ini turun kepada segolongan penduduk Makkah, mereka mengaku Islam namun mereka enggan untuk hijrah, mereka mengaku beriman namun menyimpan kemunafikan. Ketika perang Badr mereka berperang bersama orang musyrik melawan orang muslim, lalu mereka terbunuh. Malaikat memukul wajah dan punggung mereka. Dan para malaikat mengatakan apa yang telah dijelaskan Allah kepada mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang dicabut nyawanya oleh malaikat dalam keadaan menzalimi dirisendiri} dalam keadaan menzalimi diri sendiri dengan tidak mau hijrah dan menetap di negeri kafir {mereka bertanya, “Bagaimana kalian ini?”} Bagaimana kalian menunaikan perkara agama kalian {Mereka menjawab, “Kami adalah orang-orang yang tertindas di bumi} orang-orang yang lemah untuk tetap dalam perkara agama di negeri kafir {”Mereka bertanya, “Bukankah bumi} negeri {Allah itu luas sehingga kalian dapat berhijrah di sana”} kalian bisa pergi ke sana supaya kalian aman dalam perkara agama dan diri kalian {Maka tempat mereka itu neraka Jahanam dan itu seburuk-buruk tempat kembali"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. Ancaman yang keras ini ditujukan kepada orang yang meninggalkan hijrah hingga ia meninggal padahal ia mampu melakukannya, sesungguhnya para malaikat yang mencabut nyawanya mencelanya dengan celaan yang keras tersebut, mereka berkata kepadanya, “Dalam keadaan bagaimana kamu ini?” maksudnya, dalam kondisi bagaimana kalian dahulu? Dan dengan apa kalian berbeda dengan kaum musyrikin? Akan tetapi kalian hanya menambah jumlah kekuatan mereka, dan kemungkinan kalian membantu mereka untuk melawan kaum Mukminin, dan hilanglah dari kalian kebaikan yang banyak dan kesempatan berjihad bersama Rasulullah serta berada dengan kaum Mukminin dan membantu mereka untuk melawan musuh-musuh mereka, “mereka menjawab, ‘Kami adalah orang-orang yang tertindas di negeri (Makkah)’. “ maksudnya, kami adalah orang-orang yang lemah dan tertindas serta dizhalimi, kami tidak memiliki kemampuan untuk berhijrah, padahal mereka tidaklah jujur dalam hal tersebut, karena Allah telah mencela dan mengancam mereka, dan Allah tidaklah membebankan sesuatu atas seseorang kecuali yang mampu dilakukannya, dan Allah mengecualikan orang-orang yang benar-benar tertindas, oleh karena itu malaikat berkata kepada mereka, “Bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah di bumi itu?” ini merupakan pertanyaan pemantapan, artinya sesungguhnya telah pasti bagi setiap orang bahwa bumi Allah itu luas, maka di manapun seorang hamba berada dan ia tak mampu beribadah kepada Allah di tempat itu, sebagaimana Allah berfirman, \" Hai hamba-hamba-Ku yang beriman, sesungguhnya bumi-Ku luas, maka sembahlah Aku saja.\" (Al-Ankabut:56). Allah berfirman tentang orang-orang yang tidak memiliki udzur tersebut, “Orang-orang itu tempatnya Neraka Jahanam, dan Jahanam itu seburuk-buruk tempat kembali,” hal ini sebagaimana yang telah berlalu mengandung ungkapan penjelasan tentang sebab yang mengakibatkan hal tersebut, dan terkandung juga tuntutannya telah ada dengan adanya syarat-syaratnya dan tidak adanya penghalang-penghalangnya atau terkadang juga ada penghalang yang merintanginya. Ayat ini merupakan sebuah dalil bahwaa hijrah adalah di antara kewajiban yang paling besar, dan meninggalkannya adalah suatu hal yang diharamkan bahwa termasuk dosa-dosa besar. Dan ayat ini juga sebuah dalil bahwa setiap orang yang meninggal telah memenuhi dan melengkapi apa yang ditakdirkan untuknya berupa rezeki, ajal, dan perbuatannya, ini diambil dari lafadz “diwafatkan,” yang menunjukan akan hal tersebut, karena apabila mesih tersisa sesuatupun dari perkara-perkara tersebut, maka ia belum dikatakan telah memenuhinya, Ayat ini juga isyarat tentang keimanan kepada melaikat dan pujian kepada mereka, karena Allah telah menjadikan percakapan itu dari mereka dalam bentuk penetapan dan kebaikan dari mereka serta kecocokannya daro kondisinya,"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 97: Sesungguhnya orang-orang yang akan diterima oleh malaikat, pa da hal mereka telah menganiaya diri mereka (malaikat) akan ber- tanya: \"Di tentang apakah keadaan kamu?\" Mereka jawab: \"Adalah kami tertindas di bumi\". (Malaikat). akan berkata: \"Bukankah bumi Allah itu ada luas, buat kamu ber- hijrah padanya?\" Maka mereka itu tempat kembalinya ialah jahannam, padahal ia satu tempat kembali yang jelek."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Bukhari meriwayatkan dari Muhammad bin Abdurrahman Abul Aswad ia berkata, \"Telah ditetapkan kepada penduduk Madinah untuk mengeluarkan sepasukan (melawan penduduk Syam), saya termasuk orang yang terdaftar, maka saya bertemu Ikrimah maula Ibnu Abbas dan saya memberitahukan hal tersebut, maka ia melarang aku dengan keras dan berkata, \"Ibnu Abbas memberitahukan kepadaku, bahwa beberapa orang kaum muslimin tinggal bersama kaum musyrik sehingga memperbanyak jumlah kaum musyrik di zaman Rasulullah shallallahu 'alaihi wa sallam. Ketika (terjadi perang) dilepaslah panah sehingga mengena kepada salah seorang di antara mereka hingga tewas atau ditebas hingga tewas, maka Allah menurunkan ayat, \"Innallladziina tawaffaahumul malaa'ikatu….dst.\" Yang dimaksud dengan orang yang menzalimi diri sendiri adalah orang-orang muslim Mekah yang tidak mau hijrah bersama Nabi shallallahu 'alaihi wa sallam padahal mereka sanggup berhijrah. Mereka ditindas dan dipaksa oleh orang-orang kafir ikut bersama mereka pergi ke perang Badar; akhirnya di antara mereka ada yang terbunuh dalam peperangan itu. Yakni apa yang membedakan kamu dengan orang-orang musyrik? Bahkan kamu malah menambah banyak jumlah mereka dan terkadang kamu membantu mereka melawan kaum muslimin, kamu pun kehilangan banyak kebaikan, tidak bisa berjihad bersama rasul-Nya, tidak hidup bersama kaum muslimin dan tidak bisa membantu kaum muslimin melawan musuh mereka. Maksudnya lemah, dipaksa dan dizalimi. Sebagaimana dilakukan oleh orang-orang selain kamu. Oleh karena itu, di mana saja seorang hamba tidak bisa menjalankan agama, maka di sana ada tempat lain yang ia bisa beribadah di tempat itu karena bumi Allah itu luas. Dalam ayat di atas terdapat dalil bahwa hijrah termasuk kewajiban yang besar dan meninggalkannya adalah haram, bahkan termasuk dosa besar, yakni berhijrah dari tempat di mana ia tidak dapat menjalankan agamanya atau menampakkan syi'ar-syi'ar Islam seperti azan, shalat Jum'at, shalat jama'ah, shalat 'Ied dsb. menuju tempat yang ia dapat menjalankan agamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 97",
    "description": "Sesungguhnya orang-orang yang dimatikan atau dicabut nyawanya oleh malaikat maut setelah sampai ajal yang telah ditetapkan oleh Allah kepada mereka dalam kehidupan di dunia ini, sementara mereka sebelumnya berada dalam keadaan menzalimi diri mereka sendiri karena enggan melakukan tuntunan agama padahal mereka mempunyai kesanggupan, mereka, para malaikat pencabut nyawa mereka itu, bertanya kepada mereka, dalam keadaan bagaimana kamu dahulu ketika kalian hidup sehingga tidak melakukan tuntunan agama, tidak berjihad dan tidak pula berhijrah' mereka menjawab, kami dulu adalah orang-orang yang tertindas dan tak berdaya di bumi mekah. Mereka, para malaikat, berkata untuk menolak alasan mereka, bukankah bumi Allah itu luas, sehingga kamu dapat berhijrah atau berpindah di bumi itu dari daerah kufur ke daerah lain di mana kalian dapat melakukan tuntunan agama' maka Allah menyatakan bahwa mereka yang dimatikan dalam keadaan menzalimi diri sendiri itu adalah orang-orang yang tempatnya di neraka jahanam dan mendapat siksaan yang amat pedih, dan jahanam itu seburuk-buruk tempat kembali. Kecuali mereka yang tertindas, yang sangat lemah, baik laki-laki atau perempuan dan anak-anak yang karenanya mereka tidak berdaya dan tidak pula mengetahui jalan untuk berhijrah, maka mereka itu adalah orang-orang yang mudah-Mudahan Allah memaafkan mereka karena ketidakmampuan mereka untuk berhijrah, bukan karena pilihan dan kemauan mereka sendiri. Allah senantiasa maha pemaaf atas segala kesalahan mereka, dan maha pengampun atas segala dosa mereka."
  }
]