[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diberi uzur dari tempat kembali (yang buruk)itu, orang-orang yang lemah tak berdaya dari kaum lelaki,kaum wanita,dan anak-anak kecil yang tidak memiliki kemampuan untuk menolak tindak penindasan dan kezhaliamn yang menimpa diri mereka,serta mereka tidak tahu cara untuk membebaskan diri dari penderitaan yang mereka alami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98-99. Namun ancaman ini tidak berlaku bagi orang-orang lemah yang memiliki alasan yang dibenarkan, baik laki-laki, wanita, maupun anak-anak. Yaitu orang-orang yang tidak berdaya untuk melindungi diri mereka dari kesewenang-wenangan dan penindasan, dan tidak bisa menemukan cara untuk membebaskan diri mereka dari tekanan. Mereka itulah orang-orang yang bisa berharap mendapatkan ampunan Allah berkat kasih sayang dan belas kasih-Nya. Dan Allah Maha Pemaaf lagi Maha Pengampun bagi hamba-hamba-Nya yang bertaubat kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. إِلَّا الْمُسْتَضْعَفِينَ (kecuali mereka yang tertindas) Yakni yang benar-benar lemah. مِنَ الرِّجَالِ وَالنِّسَآءِ وَالْوِلْدٰنِ(baik laki-laki, wanita-wanita maupun anak-anak) Seperti orang-orang jompo dan lainnya. لَا يَسْتَطِيعُونَ حِيلَةً (yang tidak mampu berdaya upaya) Yakni untuk meloloskan diri dari negeri tersebut. وَلَا يَهْتَدُونَ سَبِيلًا(dan tidak mengetahui jalan (untuk hijrah)) Yakni yang tidak tahu jalan menuju negeri yang aman dan Islam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98 Kecuali mereka yang memang benar-benar lemah, seperti orang tua, orang lemah ataupun anak-anak yang tidak mampu berdaya upaya dan tidak mengetahui jalan untuk hijrah,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali mereka yang tertindas dari kalangan laki-laki, perempuan, dan anak-anak yang tidak berdaya} tidak mampu untuk berhijarah {dan tidak mengetahui jalan} mereka tidak mengetahui jalan untuk keluar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98-99. Kemudian Allah mengecualikan orang-orang yang benar-benar tertindas, orang-orang yang tidak memiliki kemampuan untuk berhijrah dalam bentuk apa pun, “dan tidak mengetahui jalan untuk berhijrah,” Allah berfirman tentang mereka, “Mereka itu, mudah-mudahan Allah memaafkannya, Dan Allah Maha Pemaaf Lagi Maha Pengampun,” kata “mudah-mudahan” menunjukan kepastian terjadinya jika sumbernya dari Allah karena tuntunan kebaikan dan kemukiaanNya. Dan pengharapan akan pahala dari orang-orang yang melakukan beberapa perbuatan mengandung faidah, yaitu bahwa orang tersebut bisa jadi benar-benar tidak memenuhinya, dan tidak melakukanya menurut bentuk yang sesuai dari yang diinginkan, akan tetapi ia lalai, maka ia tidak berhak mendapatkan pahala tersebut, wallahu ‘alam. Di dalam ayat yang mulia ini terdapat sebuah dalil bahwa orang yang tidak bisa mengerjakan suatu perintah atu selainnya, maka sesungguhnya ia di maafkan, sebagaiman Allah berfirman bagi orang-orang yang tidak mampu berjihad, \" Tiada dosa atas orang-orang yang buta dan atas orang yang pincang dan atas orang yang sakit (apabila tidak ikut berperang). Dan barangsiapa yang taat kepada Allah dan Rasul-Nya; niscaya Allah akan memasukkannya ke dalam surga yang mengalir di bawahnya sungai-sungai dan barang siapa yang berpaling niscaya akan diazab-Nya dengan azab yang pedih.\" (Al-Fath:17) dan Allah berfirman tentang keumuman segala perintah, \" Maka bertakwalah kamu kepada Allah menurut kesanggupanmu\"(At-Tagabun:16). Nabi bersabda, “Apabila aku memerintahkankepada kalian suatu perkara, maka kerjakanlah perkara itu sesuai dengan kemampuanmu.” Akan tetapi tidaklah seorang manusia itu di maafkan kecuali setelah ia mengerahkan segenap kemampuannya, namun tertutup baginya segala pintu-pintu usaha, atas dasar firmannya, “Yang Tidak Mampu Berdaya Upaya.” Ayat ini juga menyimpan sesuatu isyarat bahwa dalil tentang haji dan umrah dan semacam dari perkara yang butuh perjalannan diantara jalan menunaikannyaadalah kemampuan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat An-Nisa ayat 98: Kecuali orang-orang yang tertindas dari laki-laki dan perempuan dan kanak-kanak yang tidak berdaya dan tidak terbuka satu jalan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tidak ada kemampuan untuk berjihrah. Ayat ini menunjukkan bahwa barang siapa yang tidak sanggup menjalankan kewajiban, maka ia diberi udzur. Hal itu, karena Allah Subhaanahu wa Ta'aala tidaklah membebani kecuali sesuai kemampuannya. Akan tetapi, seseorang tidaklah diberi udzur kecuali setelah ia berusaha mengerahkan kemampuannya dan telah tertutup berbagai cara baginya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat An-Nisa Ayat 98",
    "description": "Kecuali mereka yang tertindas, yang sangat lemah, baik laki-laki atau perempuan dan anak-anak yang karenanya mereka tidak berdaya dan tidak pula mengetahui jalan untuk berhijrah, maka mereka itu adalah orang-orang yang mudah-Mudahan Allah memaafkan mereka karena ketidakmampuan mereka untuk berhijrah, bukan karena pilihan dan kemauan mereka sendiri. Allah senantiasa maha pemaaf atas segala kesalahan mereka, dan maha pengampun atas segala dosa merekakecuali mereka yang tertindas, yang sangat lemah, baik laki-laki atau perempuan dan anak-anak yang karenanya mereka tidak berdaya dan tidak pula mengetahui jalan untuk berhijrah, maka mereka itu adalah orang-orang yang mudah-Mudahan Allah memaafkan mereka karena ketidakmampuan mereka untuk berhijrah, bukan karena pilihan dan kemauan mereka sendiri. Allah senantiasa maha pemaaf atas segala kesalahan mereka, dan maha pengampun atas segala dosa mereka."
  }
]