[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Bukankah kami telah melapangkan dadamu (wahai nabi) untuk menerima syariat syariat agama,dakwah kepada Allah,dan menghiasi diri dengan keluhuran akhlak, Serta kami meringankan beban darimu dengan itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Allah telah melapangkan bagimu dadamu dan menjadikanmu senang menerima wahyu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Hai Rasulullah, Kami telah melapangkan dadamu -Pengkhususan istilah ‘dada’ karena ia merupakan tempat ilmu dan pemahaman-. Agar beliau dapat bangkit untuk berdakwah dan mampu memikul beban kenabian, serta agar menjadi teladan yang baik bagi orang-orang beriman. Ini merupakan kenikmatan yang diberikan baginya sesuai dengan segala yang beliau harapkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ (Bukankah Kami telah melapangkan untukmu dadamu?) Yakni hai Muhammad, Kami telah melapangkan dadamu untuk mengemban kenabian. Dan dengan ini Rasulullah mampu menjalankan dakwahnya dan kuat menikul beban kenabian dan penjagaan wahyu."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-3 . 1 ) . Diriwayatkan dari Hafsh bin Hamid ia berkata : Ziyad bin Hadir berkata kepadaku : \"bacakanlah kepadaku surah ini\", kemudian aku pun membacakan untuknya : { أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ , وَوَضَعْنَا عَنْكَ وِزْرَكَ , الَّذِي أَنْقَضَ ظَهْرَكَ } kemudian ia berkata : \"wahai Ibnu Ummi ziyad, beban telah memberatkan punggung Rasulullah ?! - yakni : Jika beban telah memberatkan punggung rasulullah, lalu bagaimana dengan kamu ?! , kemudian dia menangis seperti tangisan bayi. 2 ) . Apakah akmu merasakan beratnya beban itu ? { أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ , وَوَضَعْنَا } seprti itulah dosa : memberatkan punggung siapapun yang memilikinya dan melemahkan siapa saja yang tersisa dalam hatinya perasaan itu... adapun Rasulullah telah diampuni baginya segala dosa-dosa yang telah berlalu dan yang akan datang, lalu bagaimana dengan dosa saya dan dosamu ? ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Bukankah kami telah melebarkan dan meluaskan bagimu wahai Muhammad untuk menerima risalah kenabian, petunjuk dan keimanan, dan kami isi di dalamnya ilmu dan hikmah. Itu adalah ungkapan kebahagiaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bukankah Kami telah melapangkan dadamu} bukankah Kami telah melapangkan hatimu dengan keimanan, kenabian, ilmu dan hikmah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Allah berfirman kepada RasulNya, “Bukankah Kami telah melapangkan untukmu dadamu?” yakni, Kami melapangkannya untuk syariat-syariat agama, dakwah kepada Allah, bersifat dengan akhlak yang baik, mengedepankan akhirat dan mempermudahkan kebajikan sehingga tidak terasa sempit dan tertekan hingga hampir (sebelumnya) tidak tunduk pada kebaikan dan hampir tidak merasakannya lapang. “Dan Kami telah menghilangkan dari padamu bebanmu,” yakni kesalahanmu “yang memberatkan punggungmu,” sebagaimana firman-Nya : لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُسْتَقِيمًا supaya Allah memberi ampunan kepadamu terhadap dosamu yang telah lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dan memimpin kamu kepada jalan yang lurus, (QS. Al-Fath :2) “Dan Kami tinggikan bagimu sebutan (nama) mu,” yakni Kami tinggikan derajatmu dan Kami berikan pujian baik lagi luhur untukmu yang belum pernah dicapai oleh seorang pun sehingga tidaklah Allah disebut melainkan RasulNya juga disebutkan bersamaNya seperti kalimat syahadat masuk islam, adzan, iqamat, khutbah dan lainnya yang dalam kata-kata itu Allah mengagungkan sebutan RasulNya, Muhammad. Dan di hati umatnya, beliau dicintai, diagungkan, dan dimuliakan, yang tidak dimiliki oleh seorang pun selain beliau setelah Allah. Semoga Allah memberi beliau balasan atas jerih payahnya terhadap umat dengan balasan terbaik yang diberikan kepada seorang nabi atas jasa baiknya bagi umatnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ } Sungguh telah kami lapangkan dadamu wahai Muhammad, agar kamu dapat menerima wahyu ini dan mengimaninya, Allah ﷻ berfirman : { فَمَنْ يُرِدِ اللَّهُ أَنْ يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلْإِسْلَامِ ۖ وَمَنْ يُرِدْ أَنْ يُضِلَّهُ يَجْعَلْ صَدْرَهُ ضَيِّقًا حَرَجًا كَأَنَّمَا يَصَّعَّدُ فِي السَّمَاءِ } ( Barangsiapa yang Allah menghendaki akan memberikan kepadanya petunjuk, niscaya Dia melapangkan dadanya untuk (memeluk agama) Islam. Dan barangsiapa yang dikehendaki Allah kesesatannya, niscaya Allah menjadikan dadanya sesak lagi sempit, seolah-olah ia sedang mendaki langit. ) [ Al-An'am : 125 ] orang-orang yang sengsara akan merasa sempit dengan dzikir kepada Allah, dan tidak akan mereima wahyu ini dengan lapang dada, berbeda dengan orang-orang beriman sesungguhnya dada mereka akan menjadi lapang dengan ayat-ayat Allah : { الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُمْ بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ } ( (yaitu) orang-orang yang beriman dan hati mereka manjadi tenteram dengan mengingat Allah. Ingatlah, hanya dengan mengingati Allah-lah hati menjadi tenteram. ) [ Ar-Ra'd : 28 ]. Hati yang lapang dengan diturunkannta ayat-ayat Allah adalah bukti akan keimanan dalam diri seseorang, sedangkan hati yang sengsara dan sempit dengan ayat-ayat Allah menandakan tiadanya iman pada diri seseorang, Allah ﷻ berfirman : { أَفَمَنْ شَرَحَ اللَّهُ صَدْرَهُ لِلْإِسْلَامِ فَهُوَ عَلَىٰ نُورٍ مِنْ رَبِّهِ ۚ فَوَيْلٌ لِلْقَاسِيَةِ قُلُوبُهُمْ مِنْ ذِكْرِ اللَّهِ ۚ أُولَٰئِكَ فِي ضَلَالٍ مُبِينٍ } ( Maka apakah orang-orang yang dibukakan Allah hatinya untuk (menerima) agama Islam lalu ia mendapat cahaya dari Tuhannya (sama dengan orang yang membatu hatinya)? Maka kecelakaan yang besarlah bagi mereka yang telah membatu hatinya untuk mengingat Allah. Mereka itu dalam kesesatan yang nyata. ) [ Az-Zumar : 22 ] , oleh karena itu hal yang pertama kali Nabi Musa minta kepada Tuhannya ketika dia diperintahkan untuk mendatangi Fir'aun dan bala tentaranya adalah kelapangan hati, { قَالَ رَبِّ اشْرَحْ لِي صَدْرِي , وَيَسِّرْ لِي أَمْرِي , وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي , يَفْقَهُوا قَوْلِي , وَاجْعَلْ لِي وَزِيرًا مِنْ أَهْلِي , هَارُونَ أَخِي , اشْدُدْ بِهِ أَزْرِي } ( Berkata Musa: “Ya Tuhanku, lapangkanlah untukku dadaku , Dan mudahkanlah untukku urusanku , Dan lepaskanlah kekakuan dari lidahku , Supaya mereka mengerti perkataanku , Dan jadikanlah untukku seorang pembantu dari keluargaku ) setiap insan butuh degan siapa pun yang dapat membantunya, kemudian Allah berkata : { قَالَ قَدْ أُوتِيتَ سُؤْلَكَ يَا مُوسَىٰ } [ Thaha : 25 - 36 ] . Hal pertama yang diminta oleh Musa kepada tuhannya adalah kelapangan hati, agar ia mampu membawa amanah yang berat ini, dan Allah telah melapangkan hati Rasul-Nya Muhammad agar mampu menjalankan tugasnya sebagai seorang Rasul utusan Allah untuk menyebarkan risalah islam ini keseluruh penjuru dunia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Allah subhanaahu Wa Ta'ala menjelaskan nikmat_nya kepada nabi-Nya Muhammad shallallaahu 'alaihi wa sallam أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ \" Bukankah Kami telah melapangkan untukmu dadamu?,\" Pertanyaan di sini dijelaskan oleh para ulama: Itu adalah pertanyaan untuk penetapan, pertanyaan yang seperti ini sangat banyak dalam al-Quran. Ditaqdirkan (maknanya) dengan fi'il madhi yang didahului dengan قَدْ [Qad: sungguh] maka adalam firman-Nya أَلَمْ نَشْرَحْ kandungan makna sebenarnya adalah: Sungguh kami telah melapangkan bagimu dadamu, karena Allah menetapkan bahwa Dia telah melapangkan dada beliau, beginilah setiap kali anda menjumpai iatifham taqrir (pertanyaan untuk menyatakan ketetapan) maka ditakdirkan dengan fi'il madhi (kata kerja lampau) yang didahuli dengan قَد [qad] sebab mengapa ditakdirkan dengan fii; madi karena kejadiannya telah sempurna dan terjadi, sedangkan sebab ditakdirkan dengan qad karena kata qad (sungguh) berfungsi untuk mengungkapan kepastian terjadi (suatu kata kerja), sedangkan dalam ucapan orang-orang قَدْ يَجُودُ البَخِيلُ [qad yajuudul bakhil: terkadang orang pelit menjadi dermawan] Qad di sini menunjukkan taqlil (jarang/terkadang), tetapi dalam firman Allah Ta'ala: ِ قَدْ يَعْلَمُ مَا أَنْتُمْ عَلَيْهِ \" Sesungguhnya Dia mengetahui keadaan yang kamu berada di dalamnya (sekarang). \"(An-Nur: 64) qad dalam ayat ini berfungsi tahqiq tidak diragukan lagi. Allah Ta'ala berfirman: أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ \"\"Maknanya: Kami meluaskannya, kelapangan disini adalah kelapangan secara batin bukan secara bentuk nyata, kelapangan dada di sini kelapangan meneriman ketentuan Allah 'Azza wa Jalla, baik itu ketentuan syari'at dan agama-Nya dan juga ketentuan taqdir-Nya berupa musibah-musibah yang menimpa manusia, itu dikarenakan di dalam menegakkan syari'at mesti menyelisihi hawa nafsu, manusia akan mendapatkan beban dalam merealisasikan perintah-perintah Allah, dan beban saat meninggalkan keharaman-keharaman Allah. Karena itu adalah menyelisihi hawa nafsu, sedangkan jiwa ini selalu memerintahkan kepada keburukan, tidak lapang dalam menerima perintah-perintah Allah dan menjauhi larangan-larangannya, anda mendapatkan sebagian orang berat dalam melaksanakan shalat, sebagaimana Allah Ta'ala mengatakan tentang orang-orang munafiq: وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى \" Dan apabila mereka berdiri untuk salat mereka berdiri dengan malas. \"(An-Nisa: 142) di antara manusia ada yang ringan dalam mengerjakan solat, bahkan ia merindukan sholat dan menunggu-nunggunya,, sebagaimana Nabi shallallaahu 'alaihi wa sallam bersabda وَجُعِلَتْ قُرَّةُ عَيْنِي فِي الصَّلَاةِ \"Dan telah dijadikan penyejuk mataku di dalam shalat\"(1) Oleh karenanya, di dalam syari'at ini terdapat suatu yang memberatkan jiwa-jiwa, seperti menjauhi perkara-perkara haram. Sebagian orang condong untuk melakukan perkara-perkara yang haram, seperti berzina, minum khamer dan semisalnya, syari'at terasa berat baginya, dan sebagian manusia ada yang dibukakn dadanya untuk taat kepada syari'at dan menjauhi yang diharamkanoleh Allah. Perhatikanlah Yusuf 'alaihissalaam, ketika diajak oleh istri raja, setelah menutup pintu, wanita itu berkata: Ini (diriku) untukmu, ia telah bersolek dengan baju dan rias terbaik, tempat itu pun aman tidak dimasuki siapa pun, pintu-pintunya pun tertutup, ia mengatakan: Ini untukmu. Yusuf mengatakan: Aku berlindung kepada Allah, beliau meminta perlindungan kepada Rabbnya, karena kondisi tersebut sangan menekannya, pemuda berduaan dengan permaisuri raja, tempat yang kosong dan aman. Manusia tetap manusia, bisa jadi akan terbersit dalam dirinya untuk melakukannya, oleh karenanya Allah berfirman: وَلَقَدْ هَمَّتْ بِهِ وَهَمَّ بِهَا لَوْلَا أَنْ رَأَى بُرْهَانَ رَبِّهِ \"Sesungguhnya wanita itu telah bermaksud (melakukan perbuatan itu) dengan Yusuf, dan Yusuf pun bermaksud (melakukan pula) dengan wanita itu andaikata dia tiada melihat petunjuk (dari) Tuhannya.\"(Yusuf: 24) Dalam hadits shahih dari Nabi shallallaahu 'alaihi wa sallam, bahwa beliau bersabda: سَبْعَةٌ يُظِلُّهُمُ اللَّهُ فِى ظِلِّهِ يَوْمَ لاَ ظِلَّ إِلاَّ ظِلُّهُ إِمَامٌ عَادِلٌ وَشَابٌّ نَشَأَ فِي طَاعَةِ اللَّهِ وَرَجُلٌ قَلْبُهُ مُعَلَّقٌ فِى الْمَسَاجِدِ وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّى أَخَافُ اللَّهَ. وَرَجُلاَنِ تَحَابَّا فِى اللَّهِ اجْتَمَعَا عَلَيْهِ وَتَفَرَّقَا عَلَيْهِ وَرَجُلٌ تَصَدَّقَ بِصَدَقَةٍ فَأَخْفَاهَا حَتَّى لاَ تَعْلَمَ شِمَالُهُ مَا تُنْفِقُ يَمِينُهُ وَرَجُلٌ ذَكَرَ اللَّهَ خَالِيًا فَفَاضَتْ عَيْنَاهُ \"Tujuh golongan yang akan dinaungi oleh Allah dalam naungan-Nya pada hari tidak ada naungan kecuali naungan Allah: Pemimpin yang adil, pemuda yang tumbuh dalam ketaatan kepada Allah, lelaki yang hatinya terpaut dengan masjid-masjid, lelaki yang diajak seorang wanita yang memiliki kedudukan dan kecantikan, ia mengatakan aku takut kepada Allah, dan dua orang yang saling mencintai karena Allah, berkumpul karena Allah dan berpisah karena Allah, lelaki yang bersedekah sehingga tangan kirinya tidak tahu apa yang diinfakkan oleh tangan kanannya dan lelaki yang mengingat Allah sendirian, lalu berlinang kedua matanya.\"(2) Yang menjadi bukti dalam hal ini adalah sabdanya: وَرَجُلٌ دَعَتْهُ امْرَأَةٌ ذَاتُ مَنْصِبٍ وَجَمَالٍ فَقَالَ إِنِّى أَخَافُ اللَّهَ \" lelaki yang diajak (berzina) seorang wanita yang memiliki kedudukan dan kecantikan, ia mengatakan aku takut kepada Allah,\" Kelapangan dada terhadap hukum syari'at, maknyanya adalah menerima hukum syari'at, ridha kepadanya dan menerapkannya, dan mengatakan: Kami dengan dan kami ta'at, engkau juga sering mendapati dirimu terbuka untuk beribada, engkau melakukannya dengan mudah, tunduk, tenang dan ridha, terkadang juga sebaliknya, kalau bukan karena takut akan dosa anda tidak akan melakukannya, jika keragaman kondisi hati seperti ini terdapan pada seorang saja bagaimana menurut anda perbendaannya dalam banyak orang. Sedangkan kelapangan hati menerima ketentuan takdir: Seorang insan yang Allah la[angkan dadanya dalam menghadapi kenyataan yang ada, anda akan mendapatinya ridha terhadap ketetapan dan takdir Allah, tenang dengannya, ia mengatakan: Saya seorang hamba, dan Allah adalah Rabb melakukan apa pun yang Dia kehendakiu, orang yang kondisinya demikian akan selalu senang, tidak akan gundah dan bersedih, dia merasakan pedih, tetapi tidak sampai membuatnya gundah dan bersedih, oleh karenanya telah datang dalam hadits yang shahih, bahwa Nabi 'alaihishsholaatu wassalaam bersabda: عَجَبًا لأَمْرِ الْمُؤْمِنِ إِنَّ أَمْرَهُ كُلَّهُ خَيْرٌ وَلَيْسَ ذَلِكَ لأَحَدٍ إِلاَّ لِلْمُؤْمِنِ إِنْ أَصَابَتْهُ ضَرَّاءُ صَبَرَ فَكَانَ خَيْرًا لَهُ وَإِنْ أَصَابَتْهُ سَرَّاءُ شَكَرَ فَكَانَ خَيْرًا لَهُ وَ \"Betapa menakjubkannya urusan seorang mukmin, sungguh semua urusannya baik, ini tidak ada bagi seorang pun kecuali bagi seorang mukmin. Jika ia tertimpa keburukan ia sabar, maka ini baik baginya, jika ia tertimpa kesenangan ia mersyukur, ini baik baginya\"(3) Dari penjelasan tersebut, maka yang dimaksudkan dengan kelapangan hati adalah, keluasan dan kesiapannya menerima ketentuan-ketentuan Allah baik ketentuan syari'at dan ketentuan takdir, tidak merasa tertekan dengan hukum-hukum Allah secara mutlak, Nabi kita, Muhammad shallallaahu 'alaihi wa sallam memiliki bagian besar di sini, oleh karenanya anda mendapati beliau adalah orang yang paling bertakwa kepada Allah, dan orang yang paling gigih dalam melaksanakan ketaatan kepada Allah, yang terbanyak kesabarannya dalam menghadapi takdir-takdir Allah. Apa yang telah dilakukan oleh manusia kepadanya ketika beliau berdakwah? Berapa rasa sakit yang menimpa beliau? Sehingga rasa sakit beliau seperti rasa sakit dua orang dari kita digabungkan. Dari Ibnu Mas'ud radhiyallaahu 'anhu, ia berkata: Aku masuk menemui Rasulullaah shallallaahu 'alaihi wasallam, sedangkan beliau sedang sakit, maka aku mengatkan: Ya Rasulullah, sesunggungnya engkau kesakitan sangat parah, beliau bersabda: أَجَلْ إِنِّي أُوعَكُ كَمَا يُوعَكُ رَجُلَانِ مِنْكُمْ \"Benar, Sesungguhnya aku merasakan kesakitan sebanging dengan dua orang yang kesakitan dari kalian\"(4) Ketika beliau merasakan sakit saat dicabut nyawa, hingga beliau meninggalkan dunia, beliau adalah orang yang paling penyabar. Kesabaran adalah derajat tertinggi tidak dapat diperoleh kecuali dengan adanya ujian kesabaran, sedangkan urusan yang datar begitu saja maka tidakmembutuhkan kesabaran, oleh karenanya kita dapatkan para nabi adalah orang yang terbanyak ujiannya, kemudian orang-orang yang saleh, kemudian orang yang semisal mereka. (1) Dikeluarkan An-Nasa'iy (3939) dari hadits Anas radhiyallaahu 'anhu, dinyatakan shahih oleh al-Albaniy dalam shahihul-Jami' (3124) (2) Dikeluarkan oleh Bukhari (660) dan Muslim (1031) dari hadits Abu Hurairah radhiyallaahu 'anhu. (3) Dikeluarkan Muslim (2999) dari hadirs Shuhaib bin Sinan radhiyallaahu 'anhu. (4) Dikeluarkan Bukhari (5648) dan Muslim (2571)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 1: Allah memulai surat ini dengan menyatakan (sesuatu) kepada Nabi ﷺ, Allah berkata : Bukankah kami yang melapangkan dadamu wahai Nabi Allah, dengan hidayah dan iman hingga engkau memahami wahyu dan engkau mampu berbicara kepada orang-orang yang merugi dan dendam kesumat (padamu)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala berfirman menyebutkan nikmat-Nya kepada Rasul-Nya shallallahu 'alaihi wa sallam. Yakni dengan kenabian dan lainnya. Menurut Syaikh As Sa’diy maksudnya adalah, “Bukankah Kami telah meluaskan dadamu untuk menerima syariat agama dan berdakwah kepada Allah, memiliki sifat berakhlak mulia, menghadap (hati) kepada akhirat dan memudahkan kebaikan, sehingga tidak menjadi sempit dan berat yang (keadaannya) tidak tunduk kepada kebaikan dan hampir tidak ditemukan kelapangan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 1",
    "description": "1-4. Wahai nabi, bukankah kami telah melapangkan dadamu' kami telah menjadikanmu seorang nabi yang menerima syariat agama, berakhlak mulia, berwawasan luas, santun, dan sabar dalam menghadapi kepahitan hidup. Dan kami pun telah menurunkan bebanmu darimu, yang memberatkan punggungmu' kami jadikan tugasmu yang sejatinya berat, seperti menyampaikan risalah dan mendakwahkan syariat, terasa ringan. Dan kami pun telah tinggikan sebutan namamu bagimu. Kami sebut namamu secara berurutan dengan nama-ku, seperti dalam syahadat, azan, tasyahud, dan sebagainya. Itu adalah kemu'liaan tersendiri yang tidak kami berikan kepada nabi-nabi yang lain"
  }
]