[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Yang mana beban itu telah memberatkan punggungmu? Dan bukankah kami juga menjadikanmu,dengan nikmat kami kepadamu berupa kemuliaan alkhlak,berada pada kedudukan tingggi lagi mulia?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Yang telah melelahkanmu hingga hampir mematahkan punggungmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. الَّذِىٓ أَنقَضَ ظَهْرَكَ (yang memberatkan punggungmu?) Yakni seandainya beban itu berbentuk fisik pasti akan terdengar suara di punggungnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-3 . 1 ) . Diriwayatkan dari Hafsh bin Hamid ia berkata : Ziyad bin Hadir berkata kepadaku : \"bacakanlah kepadaku surah ini\", kemudian aku pun membacakan untuknya : { أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ , وَوَضَعْنَا عَنْكَ وِزْرَكَ , الَّذِي أَنْقَضَ ظَهْرَكَ } kemudian ia berkata : \"wahai Ibnu Ummi ziyad, beban telah memberatkan punggung Rasulullah ?! - yakni : Jika beban telah memberatkan punggung rasulullah, lalu bagaimana dengan kamu ?! , kemudian dia menangis seperti tangisan bayi. 2 ) . Apakah akmu merasakan beratnya beban itu ? { أَلَمْ نَشْرَحْ لَكَ صَدْرَكَ , وَوَضَعْنَا } seprti itulah dosa : memberatkan punggung siapapun yang memilikinya dan melemahkan siapa saja yang tersisa dalam hatinya perasaan itu... adapun Rasulullah telah diampuni baginya segala dosa-dosa yang telah berlalu dan yang akan datang, lalu bagaimana dengan dosa saya dan dosamu ? ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2-3. Kami letakkan dan turunkan kepadamu beban yang memberatkanmu yaitu perhatianmu yang sungguh-sungguh terhadap hidayah kaummu dan pemeliharaanmu (terhadap mereka) agar tidak menyakiti mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang memberatkan} memberatkan {punggungmu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Allah berfirman kepada RasulNya, “Bukankah Kami telah melapangkan untukmu dadamu?” yakni, Kami melapangkannya untuk syariat-syariat agama, dakwah kepada Allah, bersifat dengan akhlak yang baik, mengedepankan akhirat dan mempermudahkan kebajikan sehingga tidak terasa sempit dan tertekan hingga hampir (sebelumnya) tidak tunduk pada kebaikan dan hampir tidak merasakannya lapang. “Dan Kami telah menghilangkan dari padamu bebanmu,” yakni kesalahanmu “yang memberatkan punggungmu,” sebagaimana firman-Nya : لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُسْتَقِيمًا supaya Allah memberi ampunan kepadamu terhadap dosamu yang telah lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dan memimpin kamu kepada jalan yang lurus, (QS. Al-Fath :2) “Dan Kami tinggikan bagimu sebutan (nama) mu,” yakni Kami tinggikan derajatmu dan Kami berikan pujian baik lagi luhur untukmu yang belum pernah dicapai oleh seorang pun sehingga tidaklah Allah disebut melainkan RasulNya juga disebutkan bersamaNya seperti kalimat syahadat masuk islam, adzan, iqamat, khutbah dan lainnya yang dalam kata-kata itu Allah mengagungkan sebutan RasulNya, Muhammad. Dan di hati umatnya, beliau dicintai, diagungkan, dan dimuliakan, yang tidak dimiliki oleh seorang pun selain beliau setelah Allah. Semoga Allah memberi beliau balasan atas jerih payahnya terhadap umat dengan balasan terbaik yang diberikan kepada seorang nabi atas jasa baiknya bagi umatnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu beban yang memberatkan punggungmu, Allah ﷻ telah mengangkatnya darimu, dan telah menagmpuni pula kesalahan-kesalahan yang telah lalu dan yang akan datang, dan Dia ﷻ juga telah melimpahkan kepadamu berbagai kenikmatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Dan telah kami letakkan maknanya: Kami buang, kami maafkan darimu وِزْرَكَ : Maknanya: Dosamu. الَّذِي أَنْقَضَ ظَهْرَكَ \" yang memberatkan punggungmu?\" Maknanya yang membebani dan menyakiti, karena punggung adalah tempat memikul bawaan, jika ada bawaan yang memberatkan punggung, maka bawaan tersebut akan lebih melelahkan jika dibawa dengan selain punggung, karena bagian tubuh anda yang paling kuat untuk memikul beban adalah punggung, perhatikanlah jika anda membawa karung dengan punggung dengan anda membawanya dengan kedua tangan anda, antara dua cara tersebut terasa perbedaannya. Maknanya adalah bahwa Allah Ta'ala telah mengampuni Nabi Shallallaahu 'alaihi wa sallam, dosa dan kesalahannya, sehingga ia diampuni, Allah Tabaraka wa Ta'ala berfirman: إِنَّا فَتَحْنَا لَكَ فَتْحًا مُبِينًا (1) لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ \" Sesungguhnya Kami telah memberikan kepadamu kemenangan yang nyata, supaya Allah memberi ampunan kepadamu terhadap dosamu yang telah lalu dan yang akan datang\"(Al-Fath: 1-2) Dikatakan kepada Nabi shallallaahu 'alaihi wa sallam, ketika beliau shalat malam dan memanjangkan shalatnya hingga kedua kakinya bengkak, beliau ditanya: Mengapa engkau melakukan ini semua sedangkan dosamu yang telah lalu mau pun yang akan datang telah diampuni Allah? Beliau menjawab: أَفَلَا أَكُوْنَ عَبْدًا شَكُوْرًا \"Tidakkah aku menjadi seorang hamba yang bersyukur\"(5) Maka pengampunan dosa-dosa yang telah lampau dan yang akan datang telah ditetapkan dalam al-Quran dan as-Sunnah. Ini adalah di antara keistimewaan Rasul 'alaihissholaatau wassalaam. Tidak ada seorang pun dari manusia yang diampuni dosa yang lampau dan yang mendatang keculai Rasul shallallaahu 'alaihi wa sallam. Sedangkan orang selain beliau membutuhkan taubat dari dosa, terkada Allah Subhaanahu wa Ta'ala mengampuni dosa selain kesyirikan, tetapi Rasul 'alaihissholaatu wassalaam kita pastikan bahwa beliau telah diampuni dosa-dosanya yang lampau mau pun yang akan datang, oleh karenanya Allah berfirman: وَوَضَعْنَا عَنْكَ وِزْرَكَ (2) الَّذِي أَنْقَضَ ظَهْرَكَ \" Dan Kami telah menghilangkan dari padamu bebanmu, yang memberatkan punggungmu?\" Jika ada yang bertanya: Ayat ini dan yang kami bawakan sebagai bukti ayat, yang menunjukkan bahwa Rasul shallallaahu 'alaihi wa sallam terkadang melakukan dosa, apakan Nabi shallallaahu 'alaihi wa sallam melakukan dosa? Jawabannya: Ya, dan tidak mungkin kita menolak nash-nash karena kita menganggap tidak mungkin dosa dilakukan oleh Nabi shallallaahu 'alaihi wasallam, yang kita titik beratkan adalah seorang insan tidak berbuat dosa, namun yang lebih penting adalah seorang insan mendapatkan ampunan (atau tidak). Ini lah yang terpenting, yaitu ia memperoleh ampunan, sedangkan dia tidak pernah terjerumus dalam dosa, Nabi shallallaahu 'alaihi wa sallam telah bersabda: كُلُّ بَنِيْ آدَمَ خَطَّاءٌ وَخَيْرُ الْخَطَّائِيْنَ التَّوَّابُوْنَ \"Semua anak-anak adam berdosa, dan sebaik-baik yang berdosa adalah yang bertaubat\"(1) Pasti pernah melakukan kesalahan, tetapi terdapat perkara-perkara yang tidak mungkin terjadi dengan para nabi, seperti berdusta dan berkhianat, hal ini tidak mungkin dilakukan oleh para nabi secara mutlak. Karena jika demikian maka ini akan menjadikelemahan terhadap risalah mereka, ini adalah kemustahilan, dan perbuatan-perbuatan hina seperti berzina atau sejenisnya ini juga tidak mungkin dilakukan nabi, karena ini meniadakan (bertentangan dengan) pokok dasar kerasulan, sejatinya diutusnya risalah Rasulullah shallallaahu 'alaihi wa sallam untuk menyempurnakan akhlak yang mulia, sebagaimana beliau bersabda: إِنَّمَا بُعِثْتُ لِأُتَمِّمَ مَكَارِمَ الْأَخْلَاقِ \"Hanya saja aku diutus untuk menyempurnakan akhlak-akhlak mulia\"(2) Kesimpulannya bahwa Allah subhaanahu wa Ta'ala meletakkan dosanya Muhammad shallallaahu 'alaihi wa llam, dan menjelaskan bahwa dosa tersebut telah memebebani dan melelahkan beliau. Jika ini saja adalah dosa Rasulullah 'alaihissholatu wassalaam, maka bagaimana dengan dosa selain beliau, dan dosa-dosa kita yang membebani dan melelahkan punggung-punggung kita, tatapi seakan akan kita tidak terbebani sesuatu, itu dikarenakan lemah iman dan lemahnya ilmu kita, dan seringnya kita lalai, kita meminta agar Allah memperlakukan kita dengan kemaafan. Di sebagian atsar, dikatakan bahwa seorang mukmin, jika berbuat suatu dosa, maka seakan-akan ada gunung yang menimpa kepalanya. sedangkan orang munafik, jika berbuat suatu dosa, seakan-akan dosa tersebut seperti seekor lalat yang hinggap di hidungnya, dia tidak peduli. Adapun seorang mukmin, dosa-dosanya akan membuatnya gundah sampai ia menyudahinya dengan istighfar dan taubat, atau dengan perbuatan-perbuatan baik yang diharapkan bisa menghapus dosa-dosa itu. Jika anda mendapati hati anda lalai dari dosa-dosa maka ketahuilah bahwa hati anda sedang sakit, karena hati yang hidup, tidak mungkin betah dengan penyakitnya, dan penyakit hati-adah dosa-dosa, sebagaimana yang dituturkan oleh Ibnul Mubarak rahimahullaah: رَأَيْتُ الذُّنُوْبَ تُمِيْتُ الْقُلُوْبَ وَقَدْ يُوْرِثُ الذّلَّ إِدْمَانُهَا وَتَرْكُ الذُّنُوبِ حَيَاةُ الْقُلُوبِ وَخَيْرٌ لِنَفْسِكَ عِصْيَانُهَا Aku melihat dosa-dosa mematikan hati Dan kecanduan dosa mewariskan kehinaan Meninggalkan dosa-dosa adalah kehidupan hati Dan hal terbaik bagi dirimu adalah dengan meninggalkan dosa. Maka wajib bagi kita untak meperhatikan dan beritropeksi diri-diri kita. Jika para pedagan saja tidak akan tidur sebelum merekap catatan perdagangan mereka,berapa yang mereka simpat, berapa yang mereka infakkan, dan berapa keutungan yang mereka peroleh? Maka sungguh para pedangang akhirat harus lebih perhatian, karena perdagangan mereka lebih mulia. Perdangan pencari dunia, tujuan pendapatan mereka –jika mereka dapatkan- adalah memanjakan badan saja, dari perdagangan tersebut akan dijumpai rasa gundah dan jenuh yang sudah diketahui, jika dia mendapatkan kerugian, ia akan galau karenanya, jika di negerinya terdapat ancaman-ancaman, seperti penyamun dan pencuri maka ia lebih khawatir lagi. Tetapi perdagangan akhirat sebaliknya, يَا أَيُّهَا الَّذِينَ آمَنُوا هَلْ أَدُلُّكُمْ عَلَى تِجَارَةٍ تُنْجِيكُمْ مِنْ عَذَابٍ أَلِيمٍ (10) تُؤْمِنُونَ بِاللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ اللَّهِ بِأَمْوَالِكُمْ وَأَنْفُسِكُمْ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (11) يَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَيُدْخِلْكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ \"Hai orang-orang yang beriman, sukakah kamu Aku tunjukkan suatu perniagaan yang dapat menyelamatkan kamu dari azab yang pedih? (yaitu) kamu beriman kepada Allah dan Rasul-Nya dan berjihad di jalan Allah dengan harta dan jiwamu. Itulah yang lebih baik bagi kamu jika kamu mengetahuinya, niscaya Allah akan mengampuni dosa-dosamu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai,\" (As-Shaff: 10-12) Anda selamat dari siksa, dengan perdagangan ini Allah mengampuni dosa-dosa, dan masuk kedalam surga-surga, surga 'aden adalah surga tempat menetap dan rumah-rumah yang indah di surga aden, rumah-rumah yang bangunan dan bahan bangunannya indah, sebagaimana sabda Nabi shallalaahu 'alaihi wa sallam: جَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهَمَا وَماَ فِيْهِمَا وَجَنَّتَانِ مِنْ فِضَّةٍ آنِيَتُهَمَا وَماَ فِيْهِمَا \"Dua surga dari emas, bejana-bejananya dan segala perkakas yang ada di dalamnya dan dua surga dari perak, bejana-bejananya dan segala perkakas yang ada di dalamnya \"(3) Demi Allah andai seorang insan hanya menyisakan sekali sujud saja sejak ia baligh hingga ia mati, hal ini murah sekali jika dibandingkan dengan harta yang mulia tersebut (di surga), jika tidak memperoleh apa pun kecuali terbebas dari neraka, itu sudah cukup untuknya. Terkadang seorang insan berfikir, ia mengatakan: andai saja aku tidak dilahirkan, atau cukup bagiku jika aku terbebas dari neraka. Ini lah Umar Bin Khattab radhiyallaahu 'anhu, ia mengatakan: \"Anda saja aku menjadi sebatang pohon, andai saja ibuku tidak melahirkanku\" Karena banyak dari manusia menyangka dirinya aman, kerena ia melaksanakan sholat, berpuasa, bersedekah, berhaji, dan berbakti kepada kedua orang tuanya dan kebaikan-kebaikan semisalnya, tetapi di hatinya terdapat karang yang menghantarkan kepada su'ulkhatimah, wal-'iyaadzubilla, sebagaimana Nabi shallallaahu 'alaihi wa sallam bersabda: إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ \"Sesungguhnya salah seorang dari kalian benar-benar beramal dengan amalan penduduk surga hingga jarak antara dia dengan surga hanya satu hasta\" maksudnya: Waktu yang dekat dengan kematiannya hanya tersisa satu hasta untuk melakukan amal, karena seluruh amalannya bagai debu, dia melakukan amalan penduduk surga yang terlihat oleh manusia, padahal dia adalah penduduk neraka, sebagaimana dijelaskan dalam hadits yang shahih. Tetapi sabda beliau: حَتَّى مَا يَكُونَ بَيْنَهُ وَبَيْنَهَا إِلاَّ ذِرَاعٌ \" hingga jarak antara dia dengan surga hanya satu hasta \" tidak bermakna bahwa amalannya mendekatkan dia ke surga, namun makna yang benar adalah hingga kehidupannya tidak tersisa kecuali sesaat saja فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا \"Kemudian ia beramal dengan amalan penduduk neraka, maka ia masuk ke neraka\" Ini jika seorang insan mengamalkan kebaikan untuk manusia (tidak ikhlas) sebagaimana beliau shallallaahu 'alaihi wasallam bersabda: إِنَّ الرَّجُلَ لَيَعْمَلُ بِعَمَلِ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ \"Sesungguhny a seseorang beramal dengan amalan penduduk surga, yang terlihat oleh manusia, sedangkan dia (hakikatnya) termasuk penduduk neraka\"(4) Seorang insan apabila ia membaca hadits-hadits seperti ini akan mengkhawatirkan dirinya, khawatir riya, khawatir ujub, dankhawatir dihinakan (oleh Allah). (1) dikeluarkan oleh Tirmidzi (2499) dan Ibnu Majah (4251) dari hadits Anas radhiyallaahu 'anhu dan dinyatakan hasan oleh Al-Albaniy dalam shahihuljaami' (4515) (2) Dikeluarkan Ahmad (8729) dari hadits Abu Hurairah radhiyallaahu 'anhu, dishahihkan Al-Albaniy dalam ash-Shahihah (45) (3) Dikeluarkan Bukhari (3878) dan Muslim (180) dari hadits Abu Musa al-Asy'ariy radhiyallaahu 'anhu. (4) Dikeluarkan Bukhari (3208) dan Muslim (2643) dari hadits Abdullah Bin Mas'ud radhiyallaahu 'anhu. (5) Dikeluarkan Bukhari (1130) dan Muslim (2819) dari hadits Al-Mughirah Bin Syu'bah radhiyallaahu 'anhu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 3: Allah menjelaskan bahwasanya beban yang dibebankan dari-Nya ini sangatlah berat di punggungnya dan sulit penuh resiko karena penuh kesedihan dan kepayahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 3",
    "description": "1-4. Wahai nabi, bukankah kami telah melapangkan dadamu' kami telah menjadikanmu seorang nabi yang menerima syariat agama, berakhlak mulia, berwawasan luas, santun, dan sabar dalam menghadapi kepahitan hidup. Dan kami pun telah menurunkan bebanmu darimu, yang memberatkan punggungmu' kami jadikan tugasmu yang sejatinya berat, seperti menyampaikan risalah dan mendakwahkan syariat, terasa ringan. Dan kami pun telah tinggikan sebutan namamu bagimu. Kami sebut namamu secara berurutan dengan nama-ku, seperti dalam syahadat, azan, tasyahud, dan sebagainya. Itu adalah kemu'liaan tersendiri yang tidak kami berikan kepada nabi-nabi yang lain"
  }
]