[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Yang mana beban itu telah memberatkan punggungmu? Dan bukankah kami juga menjadikanmu,dengan nikmat kami kepadamu berupa kemuliaan alkhlak,berada pada kedudukan tingggi lagi mulia?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Dan Kami telah tinggikan bagimu namamu, karena namamu telah disebutkan di dalam azan, ikamah dan lainnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Dan Allah meninggikan dan mengharumkan namamu di dunia dan di akhirat dengan sifat-sifat yang sempurna. Dan peninggian nama ini meliputi berbagai bentuk, seperti kabar gembira dengan kenabiannya, penyebutan dan pujian baginya di langit tertinggi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَرَفَعْنَا لَكَ ذِكْرَكَ (Dan Kami tinggikan bagimu sebutan (nama)mu) Di dunia dan di akhirat, dengan berbagai hal seperti, keharusan bagi orang-orang beriman jika mereka mengucapkan ‘Aku bersaksi tiada Tuhan selain Allah’ maka mereka juga mengucapkan ‘dan aku bersaksi Muhammad adalah utusan Allah’, dan penyebutan namanya pada lafadz azan, dan dalam shalawat kepadanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Qotadah rahimahullah berkata : ِAllah mengangkat sebutan ( nama ) Rasulullah di dunia dan di akhirat, maka tidak siapapun dari para penceramah atau da'i, dan juga orang-orang shalat melainkan mereka selalu mengucapkan dua kalimat syahadat yang didalamnya Nama Rasulullah disebutkan ( أشهدة ألا إله إلا الله وأشهدة أن محمدًا رسول الله ) 2 ) . Orang-orang yang berjalan diatas manhaj Ahlussunnah mereka mati akan tetapi nama-nama mereka tetap berada dalam kehidupan, sedangkan orang-orang yang bermanhaj dengan manhaj pelaku bid'ah mereka mati dan nama-nama mereka juga mati, karena sesungguhnya mereka yang berjalan diatas manhaj Ahlussunnah telah menghidupkan risalah kebenaran yang telah Rasulullah bawakan dari tuhannya, maka mereka yang menghidupkan risalah itu mendapat bagian dari ayat ini : { وَرَفَعْنَا لَكَ ذِكْرَكَ } , adapun para pelaku bid'ah mereka telah membenci sunnah-sunnah Rasul yang disyari'atkan oleh islam, maka mereka akan mendapat bagian dari ayat ini : { إِنَّ شَانِئَكَ هُوَ الْأَبْتَرُ } \" Sesungguhnya orang-orang yang membenci kamu dialah yang terputus\" [ Al-Kautsar : 3 ]. 3 ) . Seperti halnya orang-orang membenci dan menhinakan sunnah-sunnah Rasul adalah yang terputus amalannya, maka mereka yang senantiasa menjaga sunnah-sunnah Rasul adalah orang-orang yang akan mendapat baalasan yang melimpah dan derajat mereka adalah tinggi, ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Dan kami mengangkat kedudukanmu dengan risalah kenabian dan hal lainnya di dunia dan akhirat. Di antaranya adalah dengan menyandingkan namamu dengan nama Allah dalam tasyahud, adzan, iqamah dan lain-lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan meninggikan dirimu (dengan) menyebut-nyebut kamu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1-4. Allah berfirman kepada RasulNya, “Bukankah Kami telah melapangkan untukmu dadamu?” yakni, Kami melapangkannya untuk syariat-syariat agama, dakwah kepada Allah, bersifat dengan akhlak yang baik, mengedepankan akhirat dan mempermudahkan kebajikan sehingga tidak terasa sempit dan tertekan hingga hampir (sebelumnya) tidak tunduk pada kebaikan dan hampir tidak merasakannya lapang. “Dan Kami telah menghilangkan dari padamu bebanmu,” yakni kesalahanmu “yang memberatkan punggungmu,” sebagaimana firman-Nya : لِيَغْفِرَ لَكَ اللَّهُ مَا تَقَدَّمَ مِنْ ذَنْبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعْمَتَهُ عَلَيْكَ وَيَهْدِيَكَ صِرَاطًا مُسْتَقِيمًا supaya Allah memberi ampunan kepadamu terhadap dosamu yang telah lalu dan yang akan datang serta menyempurnakan nikmat-Nya atasmu dan memimpin kamu kepada jalan yang lurus, (QS. Al-Fath :2) “Dan Kami tinggikan bagimu sebutan (nama) mu,” yakni Kami tinggikan derajatmu dan Kami berikan pujian baik lagi luhur untukmu yang belum pernah dicapai oleh seorang pun sehingga tidaklah Allah disebut melainkan RasulNya juga disebutkan bersamaNya seperti kalimat syahadat masuk islam, adzan, iqamat, khutbah dan lainnya yang dalam kata-kata itu Allah mengagungkan sebutan RasulNya, Muhammad. Dan di hati umatnya, beliau dicintai, diagungkan, dan dimuliakan, yang tidak dimiliki oleh seorang pun selain beliau setelah Allah. Semoga Allah memberi beliau balasan atas jerih payahnya terhadap umat dengan balasan terbaik yang diberikan kepada seorang nabi atas jasa baiknya bagi umatnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan Dia ﷻ telah mengangkat dan meninggikan sebutan nama Rasul-Nya di dunia dan di akhirat, maka tidak didapati nama Allah ﷻ disebutkan kecuali disebutkan pula bersama-Nya Rasulullah ﷺ , dan diantara mengangkatan sebutan itu adalah saat dikumandangkannya azan dimasjid-dimasjid, dan saat waktu iqomah, dan ketika para khatib menyampaikan khutbahnya di mimbar, begitupun ketika tasyahud dalam shalat, dan ketika seseorag mengikrarkan dirinya masuk islam dengan mengucapkan dua kalimat syahadat, karena sesorang tidak akan masuk kedalam islam kecuaali dia telah menyatakan \"Bahwa tiada tuhan yang berhak disembah selain Allah dan bahwasanya Rasulullah Muhammad ﷺ adalah utusan Allah ﷻ \" , tidak satupun dari perkara-perkara yang telah disebutkan melainkan ada didalamnya disebutkan nama Rasulullah ﷺ , seperti itulah nama beliau ﷺ diangkat dan ditinggikan kedudukannya didunia oleh Allah ﷻ , dan penyebutan itu terus berulang sepanjang kehidupan didunia. Maka lihatlah dan dengarkanlah Azan-azan yang dikumandangkan dimasjid-masjid diseluruh penjuru dunia, semua disebutkan didalamnya : أشهد أن لا إله إلا الله , أشهد أن محمدا رسول الله , seluruh masjid dipenjuru dunia mengumandangkan kalimat yang agung ini sepanjang hari dan malam secara bergantian, hal ini terjadi dengan kekuasaan Allah ﷻ . Bahkan di media-media massa pun kalimat mulia ini disebutkan ketika waktu shalat tiba dan waktu-waktu lainnya yang menyiarkan ceramah-ceramah ulama, meskipun para kaum kuffar tidak senang dengan hal ini, akan tetapi Allah ﷻ dengan kuasa-Nya hal ini tetap berjaan dengan lancar. dan orang-orang kafir itu tidak mampu untuk melarang, dan dengan adanya peristiwa ini sudah sangat cukup untuk mengingatkan kita kepada Rasulullah dan menyebutkan nama dalam sholawat diandingkan dengan perkara maulid Nabi yang bid'ah itu yang mereka katakan : kita melakukan perayaan maulid untuk mengingat beliau ﷺ , bukankah azan yang disebutkan nama Rasulullah ﷺ adalah dalam rangka menyebut dan mengingat beliau ?! nama beliau akan terus diangkat sepanang masa."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Ditinggikannya penyebutan Rasulullah shallallah 'alaihi wa sallam, tidak ada seorang pun yang meragukannya: Pertama: Karena Allah yang meninggikan penyebutannya setiap waktu shalat pada kedudukan tertinggi, yaitu ketika azan: Asy hadu allaa ilaaha illaallaaah, wa asy hadu anna muhammadan rasulullaah \" saya bersaksi tiada sesembahan yang benar kecuali Allah dan saya bersaksi bahwa Muhammad adalah utusan Allah\" Kedua: Meninggikan penyebutan beliau di setiap sholat fardhu saat duduk tasyahhud, karena tasyahhud adalah kewajiban (shalat), di dalamnya diucakan: Asy hadu allaa ilaaha illallaah wa asy hadu anna muhammadan abduhu wa rasuluh \"saya bersaksi bahwa tidak ada sesembahan yang benar selain Allah dan saya bersaksi bahwa Muhammad hamba dan utusan Allah\" Ketiga: Mengangkat penyebutannya di setiap ibadah, setiap ibadah selalu di angkat di dalamnya penyebutan Rasulullaha shallallaahu 'alaihi wa sallam, itu dikarenakan setiap ibadah, harus memenuhi dua syarat utama, yaitu ikhlas kepada Allah Ta'ala dan mengikuti Rasul 'alaihissolaatu wassalaam, dan sudah diketahui bahwa orang yang mengikuti Rasul shallallaahu 'alaihi wa sallam senantiasa menghadirkan dalam dirinya saat ibadah bahwa ia mengikuti Rasulullaah shallallaahu 'alaihi wa sallam, inilah di antara tingginya penyebutan beliau."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 4: Allah mengabarkan bahwa Ia menjadikan Nabi ﷺ seseorang yang tinggi, ditinggikan derajatnya dan menjadikan kedudukannya (misalnya) termasuk orang yang shalih dan akhlaknya yang menjadi percontohan, yang mewakili orang-orang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meninggikan nama Nabi Muhammad shallallahu 'alaihi wa sallam di sini maksudnya ialah meninggikan derajat dan mengikutkan nama Beliau dengan nama Allah Subhaanahu wa Ta'aala dalam kalimat syahadat, azan dan iqamat, tasyahhud dalam shalat, khutbah dan lain-lain serta menjadikan taat kepada Nabi shallallahu 'alaihi wa sallam termasuk taat kepada Allah. Di samping itu, Beliau sangat dicintai, dimuliakan dan dibesarkan di hati umatnya setelah Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 4",
    "description": "1-4. Wahai nabi, bukankah kami telah melapangkan dadamu' kami telah menjadikanmu seorang nabi yang menerima syariat agama, berakhlak mulia, berwawasan luas, santun, dan sabar dalam menghadapi kepahitan hidup. Dan kami pun telah menurunkan bebanmu darimu, yang memberatkan punggungmu' kami jadikan tugasmu yang sejatinya berat, seperti menyampaikan risalah dan mendakwahkan syariat, terasa ringan. Dan kami pun telah tinggikan sebutan namamu bagimu. Kami sebut namamu secara berurutan dengan nama-ku, seperti dalam syahadat, azan, tasyahud, dan sebagainya. Itu adalah kemu'liaan tersendiri yang tidak kami berikan kepada nabi-nabi yang lain. 5-6. Demikianlah nikmat-nikmat-ku kepadamu. Maka tetaplah optimis dan berharap pada perto'longan tuhanmu karena sesungguhnya beserta kesulitan apa pun pasti ada kemudahan yang menyertainya. Engkau hadapi kesulitan besar dalam menyampaikan dakwah kepada kaummu; mereka ingkar dan menentangmu, tetapi Allah memberimu kemudahan untuk menaklukkan mereka. Sesungguhnya beserta kesulitan itu pasti ada kemudahan."
  }
]