[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Jangan sampai gangguan musuhmu menyurutkanmu untuk menyebarkan risalah, karena bersama kesulitan ada jalan keluar, bersama kesulitan ada jalan keluar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Sesungguhnya bersamaan dengan kesusahan dan kesempitan itu terdapat kemudahan dan kelapangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-6. Ini merupakan janji Allah yang tegas bahwa bersama kesempitan terdapat kelapangan, bersama masalah terdapat jalan keluar, dan bersama kesukaran terdapat kemudahan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "5-6 1 ) . Kesulitan yang paling sulit dihadapi oleh Rasulullah semasa hidupnya adalah kerasnya hati kaumnya dan ketidak inginan mereka menerima risalah yang beliau sampaikan, maka kemudian Allah menjanjikan baginya dua kemudahan dibalik kesulitan yang beliau hadapi, kemudahan yang pertama adalah ketika kaum mulai memahami risalah islam itu dan mereka pun satu persatu masuk kedalam islam, adapun kemudahan yang kedua adalah tatkala Allah memberikan kemenangan kepada Rasul dan ummatnya pada penaklukan-penaklukan di kota-kota besar dan masuknya orang-orang kafir kedalam islam dengan berbondong-bondong, oleh karena itu tidak sepantasnya anda berputus asa sekalipun tantangan yang paling sulit menghadang, karena sesungguhnya itu adalah kesulitan yang setelahnya kemudahan yang membahagiakan. 2 ) . Seorang pendidik mengatakan : Terkadang suatu kesulitan menghampiri kita yang menyebabkan kita menangis bahkan menitipkan rasa sakit yang mendalam, akan tetapi aku mencoba untuk menguatkan diri dengan ayat ini : { فَإِنَّ مَعَ الْعُسْرِ يُسْرًا , إِنَّ مَعَ الْعُسْرِ يُسْرًا } dan akhirnya aku mendapkan ketenangan yang sempurna, bahkan kepada perkara yang sangat mencekap aku pun tersenyum, karena aku yakin bahwa setelah kesulitan itu ada kemudahan yang lebih banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6 Maka sesungguhnya dalam setiap kesulitan ada kelapangan yang berubah dengan cepat, seperti penderitaan Nabi SAW akibat gangguan orang-orang musyrik yang kemudian berubah menjadi kemudahan dan pertolongan kepada mereka. Ayat ini diturunkan saat orang-orang musyrik mengejek orang-orang muslim dengan kefakirannya. Ketika ayat ini diturunkan, Nabi SAW bersabda sebagaimana yang dikatakan Ibnu Jarir dari Hasan Al-Bashri: “Apakah kalian senang atas posisi kalian yang berada dalam kemudahan, kesulitan tidak akan selalu berada di atas kemudahan”. Sesungguhnya bersama kesulitan itu ada kemudahan lain dan (cara) untuk menghadapi setiap kesulitan adalah (mencari) kemudahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka sesungguhnya beserta kesulitan ada kemudahan} sesungguhnya bersama penderitaan dan kesempitan itu terdapat kesejahteraan dan kelapangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Allah berfirman, “Karena sesungguhnya sesudah kesulitan itu ada kemudahan, sesungguhnya sesudah kesulitan itu ada kemudahan.” Ini adalah berita gembira besar; setiap kali ada kesulitan dan kesusahan, selalu disertai kemudahan, hingga meski kesulitan itu terjebak di lubang biawak, niscaya kemudahan itu akan masuk dan mengeluarkannya. Penyebutan kata “kesulitan” pada kedua ayat secara definite (ma’rifat) menunjukkan keduanya sama, sedangkan penyebutan kata “kemudahan” secara indefinite (nakirah) menunjukkan berulangnya. Satu kesulitan tidak akan mengalahkan dua kemudahan. Penyebutan kata “kesulitan” secara definite dengan alif dan lam menunjukkan generalisasi, dan generalisasi itu menunjukkan bahwa semua kesulitan meski mencapai tingkat seberapa pun tapi pada akhirnya kemudahan akan menyertainya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Inilah janji Allah ﷻ kepada hamba-Nya yang beriman bahwasanya setiap kesuliatan datang menguji diri kita, maka akan datang kemudahan setelahnya, Allah ﷻ berfirman : { سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا } ( Allah kelak akan memberikan kelapangan sesudah kesempitan. ) [ At-Thalaq : 7 ] , setiap datang kesukaran, akan ada kemudahan setelahnya, dan kesukaran itu tidak berlanjur terus menerus, dan ketahuilah bahwa pertolongan bersama kesabaran, dan kelapangan bersama kesempitan, serta kesulitan bersama kemudaha, semua ini akan terus berlanjut sepanjang hidup manusia."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَإِنَّ مَعَ الْعُسْرِ يُسْرًا (5) إِنَّ مَعَ الْعُسْرِ يُسْرًا \" Karena sesungguhnya sesudah kesulitan itu ada kemudahan, sesungguhnya sesudah kesulitan itu ada kemudahan.\" Ini adalah kabar gembira dari Allah untuk Rasulullah shallallaahu 'alaihi wa sallam dan untuk semua umat islam. Kesulitan terjadi pada Rasulullah shallallaahu 'alaihi wa sallam saat beliau di mekah, beliau terhimpit, ketika beliau di Thaif , di Madinah pun demikian, menghadapi orang-orang munafik, Allah berfirman فَإِنَّ مَعَ الْعُسْرِ يُسْرًا Maksudnya: Sebagaimana kami telah melapangkan dadamu, meletakkan dosamu, meninggikan penyebutanmua, itu semua adalah kenikmatan yang besar, begitu pun kesulitan ini yang menimpamu, pasti akan diiring dengan kemudahan. فَإِنَّ مَعَ الْعُسْرِ يُسْرًا ( 5) إِنَّ مَعَ الْعُسْرِ يُسْرًا \"\"Ibnu Abbas mengatakan tentanng ayat ini: \"satu kesulitan tidak akan mengungguli dua kemudahan\". Penjabaran ucapan Ibnu Abbas radhiyallaahu 'anhuma tersebut –padahal kesulitan disebutkan dua kali dan kemudahan pun disebutkan dua kali pula-, dijabarkan oleh pakar balaghoh (sastrawan bahasa Arab): Bahwa keburukan tidak disebutkan kecuali hanya sekati saja فَإِنَّ مَعَ الْعُسْرِ يُسْرًا (5) إِنَّ مَعَ الْعُسْرِ يُسْرًا al-'Usr [pertama] diulang kembali penyebutannya di ayat kedua dengan ال [alif lam], alif lam dalam ayat ini adalah untuk al-'Ahd adz-Dzikri (penentu dalam penyebutan), sedangkan يُسر [yusr: kemudahan] tidak didatangkan dalam kondisi ma'rifat, tapi dalam kondisi nakirah (umum). Sedangkan kaedah mengatakan: Jika suatu isim datang berulang dua kali dengan bentuk ma'rifat (dengan alif lam) maka isim yang kedua adalah masih isim yang pertama, kecuali dalam kondisi tertentu, dan jika isim disebutkan dua kali dalam keadaan nakirah (umum) maka yang kesatu dan yang kedua adalah berbeda, karena yang kedua pun nakirah (tidak menunjukkan ketentuan). Dari penjelasan ini maka kedua ayat tersebut terdapat penyebutan dua kemudahan yang berbeda dalam satu kesulitan, karena al-Usr [kesulitan] diulang dengan menggunakan alif-lam (penentu) فَإِنَّ مَعَ الْعُسْرِ يُسْرًا Perkataan ini adalah berita dari Allah 'Azza wa Jalla, sedangkan berita Allah adalah berita yang palig sempurna kebendarannya, dan janjinya pasti ditepati, maka setiap kali anda mendapatkan kesusahan maka tunggulah kemudahan. Kalau kita lihat dalam urusan-urusan syari'at terlihat jelas. Misal dalam shalat: Shalatlah sambil berdiri, jika tidak mampu, maka duduklah, jika tidak mampu maka dengan berbaring. Ini adalah kemudahan. Jika anda kesulitan berdiri maka duduklah, jika anda kesulitan duduk, maka shalatlah dalam keadaan berbaring. Dalam berpuasa, jika anda tidak safar maka berpuasalah, dan jika anda tidak mampu (karena ada udzur) maka berbukalah, jika anda safar (bepergian jauh), berbukalah. Dalam haji, jika anda mampu dan mendapatkan jalannya maka berhajilah, jika tidak mampu maka anda tidak diwajibkan berhaji. Bahkan jika anda sudah memulai haji, kemudian anda dikepung musuh dan tidak memungkinkan untuk menyempurnakan haji, maka bertahallullah, dan fasakh (batalkan) hajinya lalu sembelihlah al-hadyu (sesembelihan yang mudah) sebagaimana dalam firman Allah Ta'ala: فَإِنْ أُحْصِرْتُمْ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ \" Jika kamu terkepung (terhalang oleh musuh atau karena sakit), maka (sembelihlah) korban yang mudah didapat \"(Al-Baqarah: 196) dengan demikian, setiap kesulitan yang didapati oleh setiap insan dalam ibadah pasti ada keringanan. Begitu juga dalam ketentuan taqdir Allah, yakni ketentuan takdir Allah untuk manusia berupa musibah-musibah, himpitan hidup, himpitan jiwa dan yang lainnya, janganlah putus asa, sesungguhnya disetiap kesulitan ada kemudahan, kemudahan terbeut bisa jadi berbentuk perkaran yang nampak dengan indera, contohnyaL seseorang yang fakir lalu Allah berikan kemudahan berupa kekayaan. Contoh yang lain: Seseorang yang sakit, kelelahan. Rasa sakit menekannya, lalu Allah 'azza wa Jalla menyembuhkannya, ini jika kemudahan yang terlihat. Ada pula kemudahan yang bersifat batin, yaitu bantuan Allah agar mampu bersabar, ini pun adalah kemudahan, jika Allah membantumu untuk bersabar maka kesulitan pun akan terasa mudah. Sehingga perkara sulit yang andai saja ditimpakan ke atas gunung akan menghancurkannya, dengan pertolongan dari Allah berupa kesabaran akan menjadi mudah. Kemudahan itu bukan sekedar hilangnya kesulitan secara sempurna saja, kemudahan adalah terlepas dan hilangnya himpitan, ini adalah kemudahan yang terlihat. Dan bantuan Allah kepada manusia sehingga mampu bersabar, sehingga perkara yang sulit menjadi terasa mudah baginya, kita mengatakan itu, karena kita percaya kepada janji Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 5: 5-6. Ketahuilah wahai Nabi Allah, bersamaan dengan kesempitan ada kebahagiaan; Yang akan datang kebahagiaan setelah kesempitan, dan kemudahan setelah kesulitan, maka janganlah bersedih dan jangan memaki. Karena kesulitan yang telah mendahului dan musibah-musibah yang engkau terima, setelahnya akan menjadi kemudahan. Berkata Ibnu Mas’ud : Kesulitan tidaklah mendominasi kemudahan-kemudahan, kemudian beliau membaca ayat ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 5",
    "description": "5-6. Demikianlah nikmat-nikmat-ku kepadamu. Maka tetaplah optimis dan berharap pada perto'longan tuhanmu karena sesungguhnya beserta kesulitan apa pun pasti ada kemudahan yang menyertainya. Engkau hadapi kesulitan besar dalam menyampaikan dakwah kepada kaummu; mereka ingkar dan menentangmu, tetapi Allah memberimu kemudahan untuk menaklukkan mereka. Sesungguhnya beserta kesulitan itu pasti ada kemudahan"
  }
]