[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-6. Jangan sampai gangguan musuhmu menyurutkanmu untuk menyebarkan risalah, karena bersama kesulitan ada jalan keluar, bersama kesulitan ada jalan keluar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Sesungguhnya bersamaan dengan kesusahan itu terdapat kelapangan. Jika engkau mengerti hal itu maka janganlah sampai gangguan kaummu itu membuatmu takut dan janganlah sampai hal itu menghalangi dari dakwah ke jalan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. إِنَّ مَعَ الْعُسْرِ يُسْرًا (Karena sesungguhnya sesudah kesulitan itu ada kemudahan) Yakni bersama kesulitan yang disebutkan tadi terdapat kemudahan, yang keduanya adalah dari Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "5-6 1 ) . Kesulitan yang paling sulit dihadapi oleh Rasulullah semasa hidupnya adalah kerasnya hati kaumnya dan ketidak inginan mereka menerima risalah yang beliau sampaikan, maka kemudian Allah menjanjikan baginya dua kemudahan dibalik kesulitan yang beliau hadapi, kemudahan yang pertama adalah ketika kaum mulai memahami risalah islam itu dan mereka pun satu persatu masuk kedalam islam, adapun kemudahan yang kedua adalah tatkala Allah memberikan kemenangan kepada Rasul dan ummatnya pada penaklukan-penaklukan di kota-kota besar dan masuknya orang-orang kafir kedalam islam dengan berbondong-bondong, oleh karena itu tidak sepantasnya anda berputus asa sekalipun tantangan yang paling sulit menghadang, karena sesungguhnya itu adalah kesulitan yang setelahnya kemudahan yang membahagiakan. 2 ) . Seorang pendidik mengatakan : Terkadang suatu kesulitan menghampiri kita yang menyebabkan kita menangis bahkan menitipkan rasa sakit yang mendalam, akan tetapi aku mencoba untuk menguatkan diri dengan ayat ini : { فَإِنَّ مَعَ الْعُسْرِ يُسْرًا , إِنَّ مَعَ الْعُسْرِ يُسْرًا } dan akhirnya aku mendapkan ketenangan yang sempurna, bahkan kepada perkara yang sangat mencekap aku pun tersenyum, karena aku yakin bahwa setelah kesulitan itu ada kemudahan yang lebih banyak."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5-6 Maka sesungguhnya dalam setiap kesulitan ada kelapangan yang berubah dengan cepat, seperti penderitaan Nabi SAW akibat gangguan orang-orang musyrik yang kemudian berubah menjadi kemudahan dan pertolongan kepada mereka. Ayat ini diturunkan saat orang-orang musyrik mengejek orang-orang muslim dengan kefakirannya. Ketika ayat ini diturunkan, Nabi SAW bersabda sebagaimana yang dikatakan Ibnu Jarir dari Hasan Al-Bashri: “Apakah kalian senang atas posisi kalian yang berada dalam kemudahan, kesulitan tidak akan selalu berada di atas kemudahan”. Sesungguhnya bersama kesulitan itu ada kemudahan lain dan (cara) untuk menghadapi setiap kesulitan adalah (mencari) kemudahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya beserta kesulitan ada kemudahan} sesungguhnya bersama penderitaan dan kesempitan itu terdapat kesejahteraan dan kelapangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5-6. Allah berfirman, “Karena sesungguhnya sesudah kesulitan itu ada kemudahan, sesungguhnya sesudah kesulitan itu ada kemudahan.” Ini adalah berita gembira besar; setiap kali ada kesulitan dan kesusahan, selalu disertai kemudahan, hingga meski kesulitan itu terjebak di lubang biawak, niscaya kemudahan itu akan masuk dan mengeluarkannya. Penyebutan kata “kesulitan” pada kedua ayat secara definite (ma’rifat) menunjukkan keduanya sama, sedangkan penyebutan kata “kemudahan” secara indefinite (nakirah) menunjukkan berulangnya. Satu kesulitan tidak akan mengalahkan dua kemudahan. Penyebutan kata “kesulitan” secara definite dengan alif dan lam menunjukkan generalisasi, dan generalisasi itu menunjukkan bahwa semua kesulitan meski mencapai tingkat seberapa pun tapi pada akhirnya kemudahan akan menyertainya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah ﷻ mengulangi kembali penyebutan ayat sebelumnya di ayat ini, { إِنَّ مَعَ الْعُسْرِ يُسْرًا } , penyebutan ( الْعُسْرِ ) \"kesulitan\" dengan kata yang sama, yakni kesulitan dalam dua ayat ini pada hakikatnya hanya satu kesulitan, karena penyebutan kata (الْعُسْرِ ) yaitu kata \"ma'rifah\", dalam kaidah bahasa Arab jika penyebutan kata \"ma'rifah\" disebutkan secara berulang kali maka maksudnya hanya satu, sedangkan kata ( يُسْرًا ) pada hakikatnya adalah dua kemudahan karena kata ini kedudukannya adalah \"Nakiroh\" yang jika berulang maka maksudnya berbeda, maka dari itu kesulitan yang dimaksud dalam dua ayat ini adalah satu kesulitan, sedangkan kemudahannya adalah dua kemudahan, sebagaimana yang juga disebutkan dalam sebuah hadits : (( لَنْ يَغْلِبَ عُسْرٌ يُسْرَيْنِ )) “Satu kesulitan tidak mungkin mengalahkan dua kemudahan.” * { إِنَّ مَعَ الْعُسْرِ يُسْرًا } Sesungguhnya bersama kesulitan pasti akan ada kemudahan bersamanya, dalam hadits Rasulullah ﷺ bersabda : (( لو كان العسر في حجر لدخل عليه اليسر حتى يخرجه )) \" “Seandainya kesulitan datang, lalu masuk ke dalam batu ini, niscaya kemudahan akan datang dan masuk ke dalamnya, lalu (kemudahan) akan mengeluarkannya” ** Setiap kesulitan ada kemudahan setelahnya, itulah jaminan Allah untuk Rasul-Nya Muhammad ﷺ dan untuk ummatnya, agar setiap hamba tidak putus asa dengan pertolongan Allah, sekalipun coabaan yang ia hadapi begitu berat kesabaran dan ketabahan harus ia hadirkan dalam dirinya, dan yakin bahwa kemudahan akan datang dari pertolongan Allah . * [ Riwayat-riwayat hadits ini adalah riwayat mursal, dikeluarkan oleh Ibnu Jarir Ath Thobari dalam kitab tafsirnya. Lihat Tafsir Ath Thobari, 24/496, Dar Hijr. Riwayat mursal adalah riwayat yang terputus sanadnya pada akhir sanad, yaitu setelah tabi’in. Riwayat ini dho’if (lemah) sebagaimana dikatakan oleh Syaikh Al Albani dalam Dho’iful Jaami’ no. 4784. ] . ** [ Hadits tsb adalah riwayat Thabrani dalam kitabnya ( al-kabir ) : 9977 , dari Hadits Ibnu Mas'ud , dan di lemahkan oleh Al-Albani dalam kitab ( Do'iful Jami' ) : 4834 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Lihat tafsir ayat sebelumnya"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 6: 5-6. Ketahuilah wahai Nabi Allah, bersamaan dengan kesempitan ada kebahagiaan; Yang akan datang kebahagiaan setelah kesempitan, dan kemudahan setelah kesulitan, maka janganlah bersedih dan jangan memaki. Karena kesulitan yang telah mendahului dan musibah-musibah yang engkau terima, setelahnya akan menjadi kemudahan. Berkata Ibnu Mas’ud : Kesulitan tidaklah mendominasi kemudahan-kemudahan, kemudian beliau membaca ayat ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan kabar gembira untuk Nabi Muhammad shallallahu 'alaihi wa sallam, yaitu bahwa setiap kali Beliau mendapatkan kesulitan, maka Beliau akan mendapatkan kemudahan setelahnya, dan bahwa betapa pun besar kesusahan yang Beliau alami, maka setelahnya Beliau akan merasakan kemudahan. Oleh karena itu, sebelumnya Nabi shallallahu 'alaihi wa sallam merasakan kesulitan dan penderitaan dari orang-orang kafir, selanjutnya Beliau mendapatkan kemudahan dengan diberi-Nya kemenangan atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 6",
    "description": "5-6. Demikianlah nikmat-nikmat-ku kepadamu. Maka tetaplah optimis dan berharap pada perto'longan tuhanmu karena sesungguhnya beserta kesulitan apa pun pasti ada kemudahan yang menyertainya. Engkau hadapi kesulitan besar dalam menyampaikan dakwah kepada kaummu; mereka ingkar dan menentangmu, tetapi Allah memberimu kemudahan untuk menaklukkan mereka. Sesungguhnya beserta kesulitan itu pasti ada kemudahan. 7. Maka apabila engkau telah selesai dari suatu urusan, tetaplah bekerja keras untuk urusan yang lain. Bila engkau menyelesaikan suatu urusan dunia atau berdakwah, bergegaslah bersimpuh di hadapan tuhanmu. Begitu engkau selesai beribadah, bersungguh-sungguhlah dalam ber'doa. Demikian seterusnya."
  }
]