[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Bila kamu telah menyelesaikan urusan dan kepentingan dunia,maka bersungguh sungguhlah dalam beribadah. Dan hanya kepada tuhanmu semata,berharaplah apa yang ada di sisi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Jika engkau telah tuntas dari pekerjaanmu dan telah selesai darinya, maka bersungguh-sungguhlah dalam ibadah kepada Rabbmu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Jika kamu telah menyelesaikan dakwah atau ibadah maka bersungguh-sungguhlah dalam berdoa, dan mintalah kepada Allah kebutuhanmu, serta beribadahlah dengan penuh kesungguhan. Yakni, jika kamu selesai beramal, maka mulailah dengan amalan yang lain, sehingga waktumu dapat terisi dengan amalan-amalan yang bermanfaat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. فَإِذَا فَرَغْتَ فَانصَبْ (Maka apabila kamu telah selesai (dari sesuatu urusan), kerjakanlah dengan sungguh-sungguh (urusan) yang lain) Yakni jika kamu telah selesai melakukan shalat, dakwah, atau perang, maka bersungguh-sungguhlah dalam berdoa, dan mintalah dari Allah kebutuhanmu. Atau berdirilah untuk ibadah lain."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ) . Ini adalah langkah hidup setiap muslim yang disampaikan kepada Nabi, jika kamu telah menyelesaikan suatu perkara agama, maka bergeraklah untuk memulai pekerjaan dunia, dan jika kamu telah menyelesaikan pekerjaan dunia, maka mulailah untuk mengerjakan amalan akhiratmu, setiap muslim harus hidup dengan tekun dan lelah, maka tidak sepantasnya ia mempergunakan waktunya dengan bersenang dan pengangguran. 2 ) . Seorang pendidik berkata : \"Suatu ketika di hari terakhir aku mengikuti ujian aku pernah berfikir tentang hal-hal yang akan aku lakukan pada hari-hari libur, mulai dari tidur, bermain, senda gurau dan seterusnya, seketika pikiran ini terpotong oleh suara Imam yang sedang memimpin shalat maghrib yang membaca : { فَإِذَا فَرَغْتَ فَانْصَبْ , وَإِلَىٰ رَبِّكَ فَارْغَبْ } dan aku pun tahu bahwa seorang muslim sedikitpun tidak boleh berhenti dari ketaatan kepada Allah, bahkan ia harus berpindari satu ketaatan kepada ketaatan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Maka ketika kalian lengang wahai Rasulallah setelah melaksanakan dan menyampaikan risalah itu kepada manusia, maka beristirahatlah dengan berdoa dan ibadah, dan tetaplah melakukan keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apabila kamu telah selesai} Apabila kamu tilah menyelesaikan amal dunia {maka bekerja keraslah} maka bersungguh-sungguhlah dalam beribadah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. Selanjutnya Allah memerintahkan RasulNya pada asalnya dan kaum Mukminin setelahnya untuk bersyukur padaNya dan menunaikan kewajiban atas nikmat yang diberikan seraya berfirman, “Maka apabila kamu telah selesai (dari sesuatu urusan), kerjakanlah dengan sungguh-sungguh (urusan) yang lain.” Artinya, bila kau telah usai mengerjakan urusanmu dan tidak tersisa sesuatu pun yang memberatkan di hatimu, maka bersungguh-sungguhlah dalam beribadah dan doa. “Dan hanya kepada Rabbmulah,” semata, “hendaknya kamu berharap,” yakni, besarkanlah harapanmu agar doamu dikabulkan dan janganlah seperti orang yang bermain-main seusai bekerja dan berpaling dari Rabb mereka dan berpaling dari mengingatNya sehingga kau akan menjadi orang merugi. Ada yang menafsirkan sebagai berikut, makna ayat ini adalah bila engkau selesai shalat dan setelah menyempurnakannya, maka bersungguh-sungguhlah dalam berdoa dan hanya kepada Rabbmulah hendaknya kau berharap dalam meminta apa yang kau inginkan. Orang yang bependapat demikian berdalil dengannya atas disyariatkannya berdoa dan berdzikir setelah shalat wajib. Waalahu a’lam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Jika kamu telah selesai mengerjakan kesibukan duniamu, maka berdirilah dan semangat dalam mengerjakan ibadah yang dengannya kamu akan mendapatkan akhiratmu lebih baik, dan janganlah kamu habiskan waktumu hanya untuk urusan dunia semata, tetapi seimbangkanlah dengan amalan akhirat dan dzikir kepada Allah ﷻ . Waktu yang lapang adalah nikmat dari Allah ﷻ , Rasulullah ﷺ bersabda : (( نِعْمَتَانِ مَغْبُونٌ فِيهِمَا كَثِيرٌ مِنْ النَّاسِ الصِّحَّةُ وَالْفَرَاغُ )) “Dua nikmat, kebanyakan manusia tertipu dengan keduanya, yaitu kesehatan dan waktu luang.” [ Diriwayatkan oleh Imam Bukhori : 6412 , dari hadits Ibnu 'Abbas ] , waktu luang adalah nikmat dari Allah, maka tidak sepantasnya seseorang mensia-siakan waktu luang itu dengan bermain dan kelalaian serta kemalasan , tetapi memanfaatkan waktu itu dengan memperbanyak amalan dan kebaikan baik yang bermanfaat untuk saat sekarang maupun untuk masa yang akan datang."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فَإِذَا فَرَغْتَ فَانْصَبْ (7) وَإِلَى رَبِّكَ فَارْغَبْ (8) \" Maka apabila kamu telah selesai (dari sesuatu urusan), kerjakanlah dengan sungguh-sungguh (urusan) yang lain, dan hanya kepada Tuhanmulah hendaknya kamu berharap.\" Maknanya: Jika anda telah menyelaikan pekerjaan-pekerjaan anda, maka mulailah pekerjaan lainnya, yakni: Berlelah-lelahlah untuk mengerjakan pekerjaan lainnya, janganlah dunia menyia-nyiakanmu, oleh karenanya kehidupan manusia yang menggunakan akalnya adalah kehidupan dengan kesungguhan. Setiap kali telah menyelesaikan suatu amalan, ia memuliau amalan yang lain, dan begitu seterusnya. Karena waktu akan terus dilalui manusia saat ia sadar mau pun tidur, ia sibuk atau pun kosong, waktu terus berjalan, tidak mungkin seorang pun menghentikan waktu, walau pun semua makhluk berkumpul untuk menghentikan laju matahari, sehingga waktu siang menjadi lebih lama, mereka semua tidak akan mampu. Waktu tidak mungkin dihentikan oleh siapa pun. Jika begitu, Jadikanlah hidup anda hidup dengan kesungguhan, jika anda telah menyelesaikan sebua pekerjaan maka kerjakanlah yang lainnya, jika anda telah menyesaikan amalan dunia maka lakukanlah amalan akhirat, dan jika telah menyelesaikan amalan akhirat, maka segeralah memulai pekerjaan dunia. Jika anda telah menyelesaikan sholat di hari jum'at maka bertebarlah di bumi dan carilah keutamaan dari Allah. Sholat jum'at diapit dengan dua amalan dunia يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا نُودِيَ لِلصَّلَاةِ مِنْ يَوْمِ الْجُمُعَةِ \" Hai orang-orang yang beriman, apabila diseru untuk menunaikan sholat pada hari Jumat, \" Maksudnya: Kalian tersibukkan dengan urusan dunia kalian فَاسْعَوْا إِلَى ذِكْرِ اللَّهِ وَذَرُوا الْبَيْعَ ذَلِكُمْ خَيْرٌ لَكُمْ إِنْ كُنْتُمْ تَعْلَمُونَ (9) فَإِذَا قُضِيَتِ الصَّلَاةُ فَانْتَشِرُوا فِي الْأَرْضِ وَابْتَغُوا مِنْ فَضْلِ اللَّهِ \" maka bersegeralah kamu kepada mengingat Allah dan tinggalkanlah jual beli. Yang demikian itu lebih baik bagimu jika kamu mengetahui. Apabila telah ditunaikan sholat, maka bertebaranlah kamu di muka bumi; dan carilah karunia Allah \"(Al-Jumu'ah: 9-10) Maka apabila kita telah selesai dari suatu kesibukkan, maka sibukkanlah dengan urusan lain, dan jika kita telah selesai mengerjakan suatu kesibukkan, maka sibukkanlah dengan urusan lain, dan begitu seterusnya, hendaknya manusia senantiasa bersungguh-sungguh. Apabila ada yang mengatakan: Andai saja saya selalu serius di semua kehidupanku, pasti aku akan lelah dan bosan. Kita katakan: Peristirahatanmu untuk mengembalikan semangatmu termasuk sebuah kesibukkan dan amal, yakni, kesibukkan tidak selalu bergerak. Rehatmu agar dapat mengembalikan semangatmu melakukan pekerjaan yang lain termasuk perbuatan, yang penting anda selalu menjadikan seluruh kehidupanmu seruis dan kerja."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 7: 7-8. Allah memerintahkan Nabi-Nya ﷺ : Jika telah lapang urusan dakwah kepada manusia maka bersungguh-sungguhlah dalam beribadah kepada Tuhanmu, dan jadikan cita-cita dan harapan dengan apa yang ada di sisi Allah, dan mintalah kepadan-Nya karunia. Jadilah manusia yang bertawakal kepada-Nya saja atas semua urusan dalam kehidupan; Karena Ia adalah pemilik kenikmatan dan pertolongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya, demikian pula kaum mukmin untuk bersyukur kepada-Nya dan mengerjakan kewajiban dari nikmat itu. Sebagian mufassir menafsirkan, bahwa apabila kamu (Muhammad) telah selesai berdakwah, maka beribadahlah kepada Allah; apabila kamu telah selesai mengerjakan urusan dunia, maka kerjakanlah urusan akhirat, atau apabila kamu telah selesai dari kesibukan dunia, maka bersungguh-sungguhlah dalam beribadah dan berdoa. Ada pula yang berpendapat, bahwa maksudnya adalah, apabila kamu telah selesai mengerjakan shalat, maka berdoalah. Orang yang berpendapat demikian, berdalih dengan pendapat tafsir ini, bahwa disyariatkan berdoa dan berdzikr setelah shalat fardhu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 7",
    "description": "Maka apabila engkau telah selesai dari suatu urusan, tetaplah bekerja keras untuk urusan yang lain. Bila engkau menyelesaikan suatu urusan dunia atau berdakwah, bergegaslah bersimpuh di hadapan tuhanmu. Begitu engkau selesai beribadah, bersungguh-sungguhlah dalam ber'doa. Demikian seterusnya. 8. Dan hanya kepada tuhanmulah engkau patut berharap dengan selalu bertawakal serta meng'harap rahmat dan rida-Nya."
  }
]