[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Bila kamu telah menyelesaikan urusan dan kepentingan dunia,maka bersungguh sungguhlah dalam beribadah. Dan hanya kepada tuhanmu semata,berharaplah apa yang ada di sisi-Nya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan jadikan keinginanmu dan tujuanmu hanya kepada Allah semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Dan senantiasalah menghadap kepada Tuhanmu, serahkanlah segala urusanmu hanya kepada-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَإِلَىٰ رَبِّكَ فَارْغَب (dan hanya kepada Tuhanmulah hendaknya kamu berharap) Yakni tunduklah kepada-Nya untuk menjauhi neraka dan mengharapkan surga."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Dan hanya kepada Tuhanmu engkau menghadapkan doamu dan permohonanmu, dan jangan arahkan kecenderunganmu kepada selain Tuhanmu, karena hanya Dialah yang Maha berkuasa lagi Maha mengabulkan (doa)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan hanya kepada Tuhanmu berharaplah} maka menghadap dan berharaplah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. Selanjutnya Allah memerintahkan RasulNya pada asalnya dan kaum Mukminin setelahnya untuk bersyukur padaNya dan menunaikan kewajiban atas nikmat yang diberikan seraya berfirman, “Maka apabila kamu telah selesai (dari sesuatu urusan), kerjakanlah dengan sungguh-sungguh (urusan) yang lain.” Artinya, bila kau telah usai mengerjakan urusanmu dan tidak tersisa sesuatu pun yang memberatkan di hatimu, maka bersungguh-sungguhlah dalam beribadah dan doa. “Dan hanya kepada Rabbmulah,” semata, “hendaknya kamu berharap,” yakni, besarkanlah harapanmu agar doamu dikabulkan dan janganlah seperti orang yang bermain-main seusai bekerja dan berpaling dari Rabb mereka dan berpaling dari mengingatNya sehingga kau akan menjadi orang merugi. Ada yang menafsirkan sebagai berikut, makna ayat ini adalah bila engkau selesai shalat dan setelah menyempurnakannya, maka bersungguh-sungguhlah dalam berdoa dan hanya kepada Rabbmulah hendaknya kau berharap dalam meminta apa yang kau inginkan. Orang yang bependapat demikian berdalil dengannya atas disyariatkannya berdoa dan berdzikir setelah shalat wajib. Waalahu a’lam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَإِلَىٰ رَبِّكَ } Dan hanya kepada tuhanmu lah { فَارْغَبْ } hendaknya kamu berharap, dan ini termasuk dalam pengagungan tauhid, karena pengaharapan dan mensandarkan diri hanya kepada Allah ﷻ adalah ibadah, dan ibadah wajib dengan keikhlasan kepada-Nya ﷻ . { وَإِلَىٰ رَبِّكَ فَارْغَبْ } Berharaplah kepada pahala dan kasih sayang, pendapat lain mengatakan : berharaplah kepada-Nya dengan memperbanyak doa, jika kamu telah selesai mengerjakan shalat, maka berharap kepada Allah dengan doa dan dzikir kepada-Nya, ikutilah shalatmu dengan dzikir setelahnya. Waktu yang luang adalah nikmat dari Allah ﷻ, dan pengharapan hanya disandarkan kepada-Nya, Allah ﷻ befirman : { إِنَّا إِلَى اللَّهِ رَاغِبُونَ } ( sesungguhnya kami adalah orang-orang yang berharap kepada Allah ) [ At-Taubah : 59 ] , menggantungkan harapan, dan keinginan, dan meluapkan rasa takut hanya kepada Allah ﷻ semua itu dihaturkan, tidak kepada selain-Nya, Allah ﷻ berfirman : { وَيَدْعُونَنَا رَغَبًا وَرَهَبًا ۖ وَكَانُوا لَنَا خَاشِعِينَ } ( dan mereka berdoa kepada Kami dengan harap dan cemas. Dan mereka adalah orang-orang yang khusyu’ kepada Kami. ) [ Al-Anbiya' : 90 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَإِلَى رَبِّكَ فَارْغَبْ \" dan hanya kepada Tuhanmulah hendaknya kamu berharap.\" Yakni: Jika anda melakukan pekerjaan-pekerjaan yang sudah diselesaikan kemudian anda melakukan pekerjaan lainnya maka berharaplah kepada Allah 'Azza Wa Jalla agar memperoleh pahala, ganjaran, dan pertolongan, senantiasalah bersama Allah 'Azza Wa Jalla baik sebelum dan sesudah beramal, sebelum beramal, jadikan diri anda bersama Allah sebelum beramal dengan memohon bantuannya, dan setelah beramal dengan pengharapan pahala. Dan dalam firman-Nya وَإِلَى رَبِّكَ فَارْغَبْ terdapat faedah dari sisi ilmu balaghoh إِلَى رَبِّكَ dari segi keserasian kata (idiom) ia terkait dengan ارْغَبْ, ia pun dikedepankan setelah Irghab, dan ini melahirkan faedah pembatasan makna. Maknanya: Kepada Allah saja dan tidak kepada siapa pun selain-Nya, berharaplah dalam semua urusan-urusanmu, percayalah jika setiap anda mengikat harapan anda kepada Allah 'Azza Wa Jalla, maka sesungguhnya Dia akan memudahkan urusan-urusanmu, kebanyakan manusia kurang dalam hal ini, maksudnyua kurang harapan mereka kepada Allah, anda dapati mereka cacat dalam pekerjaan-pekerjaan mereka, karena mereka tidak memiliki hubungan dengan Allah dalam amalan-amalan mereka. Kita meminta kepada Allah Subhaanahu wa Ta'ala, agar menjadikan kita bisa mengerjakan perintah-perintah-Nya, membenarkan berita-berita_nya dan sesungguhnya Dia Mahakuasa atas segala sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Insyirah ayat 8: 7-8. Allah memerintahkan Nabi-Nya ﷺ : Jika telah lapang urusan dakwah kepada manusia maka bersungguh-sungguhlah dalam beribadah kepada Tuhanmu, dan jadikan cita-cita dan harapan dengan apa yang ada di sisi Allah, dan mintalah kepadan-Nya karunia. Jadilah manusia yang bertawakal kepada-Nya saja atas semua urusan dalam kehidupan; Karena Ia adalah pemilik kenikmatan dan pertolongan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni perbesarlah harapanmu agar doamu dikabulkan dan ibadahmu diterima, dan janganlah engkau termasuk orang yang apabila telah selesai melakukan sesuatu, ia malah bermain-main dan berpaling dari Tuhan mereka dan dari mengingat-Nya sehingga engkau termasuk orang-orang yang rugi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Insyirah Ayat 8",
    "description": "Dan hanya kepada tuhanmulah engkau patut berharap dengan selalu bertawakal serta meng'harap rahmat dan rida-Nya1-3. Demi buah tin dan zaitun, demi gunung sinai, dan demi negeri mekah yang aman ini. Buah tin dan zaitun banyak tumbuh di syam dan baitul makdis, tempat para nabi diutus, antara lain nabi isa. Gunung sinai adalah tempat nabi musa bermunajat, sedangkan mekah adalah tem'pat kelahiran dan pengutusan nabi Muhammad. Ketiga nabi ini memiliki misi yang sama, yaitu mengajak manusia menuju tauhid."
  }
]