[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mengingkari bahwa hanya Allah sematalah, Tuhan yang haq, tidak ada sekutu bagiNya dan menghalang-halangi manusia dari agamaNYa, Allah melenyapkan dan membatalkan amal-amal mereka, serta membuat mereka sengsara karenanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Orang-orang yang kafir terhadap Allah dan mengalihkan manusia dari agama Allah, Allah membatalkan perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-3. Allah mengolok orang-orang kafir yang menghalangi diri mereka sendiri dan orang laing dari agama-Nya, dan memberi peringatan bahwa amalan mereka akan terhapus. Dan Allah memuji orang-orang beriman yang melaksanakan perintah-Nya dan meyakini al-Qur’an yang diturunkan kepada Nabi Muhammad, yang merupakan kitab yang benar dan firman Allah. Dan Allah memberi kabar gembira bagi mereka atas keberhasilan amal perbuatan mereka, karena Allah telah menghapus dosa-dosa mereka dan memperbaiki urusan mereka. Itu semua merupakan balasan yang adil karena orang-orang kafir telah mengikuti kesesatan setan dan tidak mentaati Allah, dan orang-orang beriman telah mengikuti petunjuk al-Qur’an dan mentaati Allah. Demikianlah Allah menjelaskan keadaan orang-orang kafir dan orang-orang beriman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الَّذِينَ كَفَرُوا۟ وَصَدُّوا۟ عَن سَبِيلِ اللهِ (Orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah) Mereka adalah orang-orang kafir Quraisy yang mengingkari Allah dan menghalang-halangi diri mereka sendiri dan orang lain dari agama Islam. أَضَلَّ أَعْمٰلَهُمْ (Allah menyesatkan perbuatan-perbuatan mereka) Yakni Allah menjadikan amalan-amalan mereka sia-sia dan akibatnya kembali kepada diri mereka sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Diriwayatkan dari Tabbrani pada ausath dari Ibnu Umar radliyallahu ‘anhuma: bahwa Nabi SAW membaca surat ini pada shalat maghrib. 1. Orang-orang yang kafir/mengingkari Allah dan rasul-Nya, dan menghalangi diri mereka dan orang lain dari kebenaran Islam, atau melarangnya. Mereka adalah para kafir Qurays, para ahli kitab dan lain-lain. Allah menolak amal perbuatan mereka dan mengurangi manfaatnya, tidak dapat menyelamatkan mereka dari kekekalan di dalam neraka. Mereka juga tidak akan mendapat pahala di akhirat, sebab kekufuran mereka. Ibnu Abbas berkata: mereka adalah penduduk Makkah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang ingkar dan menghalang-halangi dari jalan Allah} mereka menghalangi manusia dari agama Allah {Dia akan menggugurkan amal-amal mereka} Allah membatalkan amal-amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ayat-ayat ini mencakup penjelasan tentang pahala bagi orang-orang yang beriman, hukuman bagi orang-orang yang durhaka, sebab dari semua itu, dan seruan untuk manusia agar mengambil pelajaran dari semua itu. Allah berfirman, “Orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah.” Mereka adalah para pembesar orang-orang kafir dan pemimpin kesesatan, orang-orang yang menyatukan antara kekufuran terhadap Allah dan ayat- ayatNya serta menghalangi diri mereka sendiri dan orang lain dari jalan Allah, yaitu menghalangi dari keimanan yang diserukan oleh para rasul dan para pengikutnya; mereka itulah orang-orang yang, “Allah menghapus perbuatan-perbuatan mereka.” Artinya, dihapus dan mereka dibuat menderita karena perbuatan-perbuatan mereka sendiri. Perbuatan-perbuatan mereka ini mencakup perbuatan yang dilakukan untuk mengelabui kebenaran dan menipu para wali Allah, tapi Allah mengembalikan efek buruk tipu daya mereka itu pada diri mereka sendiri, mereka sama sekali tidak mendapatkan apa yang mereka harapkan mendapatkan pahala itu dihapus oleh Allah dari mereka. Penyebab semua itu adalah karena mereka mengikuti kebatilan, yaitu semua tujuan yang tidak diinginkan untuk mencari keridhaan Allah seperti menyembah berhala dan patung dan juga perbuatan-perbuatan yang bertujuan untuk menolong kebatilan, perbuatan yang dilakukan untuk mendukung kebatilan sama-sama batil."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 1: Surat ini dimulai dengan penjelasan akan buruknya balasan bagi orang-orang kafir, dan balasan yang baik bagi orang-orang yang beriman; Allah mengabarkan bahwa mereka yang menolak untuk masuk islam dan memalingkan manusia dari agama Allah, mereka adalah orang-orang kafir quraisy dan yang semisal dengan mereka; Allah menghapuskan amalan mereka yang mereka dahulu memuliakan manusia sebagaimana memuliakan tamu dan bersilaturahmi, yang mereka beramal dengan kebaikan kecuali kekufuran yang bersama mereka menjadikan amalan-amalan mereka terhapus dan lenyap."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dan setelahnya mengandung penjelasan pahala bagi kaum mukmin dan siksaan bagi orang-orang yang durhaka, sebabnya, serta mengajak manusia agar mengambil pelajaran terhadapnya. Yakni dari beriman kepada-Nya. Mereka ini adalah tokoh-tokoh kekafiran dan pemimpin kesesatan, dimana mereka menggabung antara kafir kepada Allah dan ayat-ayat-Nya dengan menghalangi diri mereka dan orang lain dari jalan Allah, yaitu beriman kepada apa yang diserukan para rasul dan pengikutnya. Maksudnya, semua amal mereka tidak mendapat bimbingan dari Allah, tidak dihargai dan tidak mendapat pahala, seperti amal mereka memberi makan orang lain dan menyambung tali silaturrahim. Mereka tidak akan melihat pahalanya di akhirat, namun mereka diberi balasan di dunia karena karunia-Nya. Menurut Syaikh As Sa’diy, amal di sini mencakup rencana jahat mereka keopada kebenaran dan kepada para wali Allah, yakni Allah Subhaanahu wa Ta'aala akan menjadikan rencana jahat tersebut berbalik kepada mereka sehingga maksud mereka gagal. Termasuk pula amal yang mereka harapkan pahalanya, maka Allah akan menghapuskannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 1",
    "description": "Ayat yang terakhir dari surah al-ahq'f menyebutkan ancaman kepada orang-orang fasik bahwa mereka akan dibinasakan oleh Allah. Ayat pertama dari surah ini menjelaskan ciri-ciri dari orang-orang fasik tersebut. Allah menjelaskan bahwasanya mereka ialah orang-orang yang kafir kepada Allah dan rasul-Nya dan menghalang-halangi manusia dari jalan Allah, yakni menghalang-halangi mereka memeluk islam atau menghalang-halangi mereka beribadah di masjidil haram. Allah menghapus segala amal mereka, maka tidak ada pahala bagi amalnya itu dan tidak menyelamatkan dari api neraka disebabkan kekafirannya. 2. Setelah Allah menyebutkan balasan bagi orang-orang kafir, kemudian dilanjutkan dengan menerangkan pahala bagi orang-orang yang beriman. Dan orang-orang yang beriman kepada Allah dan rasul-Nya dan membuktikan imannya itu dengan mengerjakan kebajikan serta ber-iman pula kepada apa yang diturunkan kepada Muhammad yaitu kitab suci Al-Qur'an; dan mereka beriman pula kepada apa yang diturunkan kepada nabi Muhammad dan nabi-nabi sebelumnya. Itulah kebenaran dari tuhan mereka yang harus ditaati oleh manusia; Allah menghapus kesalahan-kesalahan mereka, dengan mengampuninya dan memperbaiki keadaan mereka dengan menganugerahkan pertolongan baik di dunia maupun di akhirat."
  }
]