[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang kafir itu tidak berjalan di bumi Allah seraya mengambil pelajaran dari apa yang menimpa umat-umat yang mendustakan sebelum mereka? Allah menghancurkan rumah-rumah mereka, dan orang-orang kafir akan mendapatkan hukuman yang semisal dengan yang pernah menimpa umat-umat tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Apakah orang-orang yang mendustakan itu tidak berjalan di muka bumi dan memperhatikan bagaimana kesudahan orang-orang yang mendustakan sebelum mereka. Kesudahan mereka adalah kesudahan yang menyakitkan, Allah membinasakan tempat-tempat tinggal mereka, menghancurkan mereka dan menghancurkan anak-anak dan harta benda mereka. Dan pada tiap jaman dan tempat terdapat contoh dari pembalasan itu bagi orang-orang yang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. أَفَلَمْ يَسِيرُوا۟ فِى الْأَرْضِ (Maka apakah mereka tidak mengadakan perjalanan di muka bumi) Yakni di negeri kaum ‘Aad, Tsamud, kaum Nabi Luth dan lainnya, agar mereka dapat mengambil pelajaran. فَيَنظُرُوا۟ كَيْفَ كَانَ عٰقِبَةُ الَّذِينَ مِن قَبْلِهِمْ ۚ (sehingga mereka dapat memperhatikan bagaimana kesudahan orang-orang sebelum mereka) Yakni bagaimana kesudahan orang-orang kafir sebelum mereka, karena bekas-bekas azab di negeri mereka masih tersisa. دَمَّرَ اللهُ عَلَيْهِمْ ۖ (Allah telah menimpakan kebinasaan atas mereka) Yakni Allah merobohkan rumah mereka di atas mereka. Atau Allah membinasakan mereka sampai habis. وَلِلْكٰفِرِينَ أَمْثٰلُهَا(dan orang-orang kafir akan menerima (akibat-akibat) seperti itu) Yakni orang-orang kafir ini akan mendapat kesudahan seperti umat-umat kafir sebelum mereka, demikian pula bagi seluruh orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Apakah orang-orang kafir yang mendustakan rasul itu tidak pernah berpindah untuk melihat isi bumi? Sehingga mereka akan tahu bagaimana kondisi umat terdahulu, seperti kaum Tsamud, ‘Ad serta kaum Luth agar mereka memperoleh pelajaran. Padahal bekas kerusakan di tempat tinggal mereka masih terlihat. Allah telah membinasakan mereka beserta anak dan harta mereka serta mencabutnya secara mutlak. Bagi orang-orang kafir yang mendustakan Allah dan rasul-Nya akan menerima hukuman seperti itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah mereka tidak mengadakan perjalanan di bumi sehingga mereka memperhatikan bagaimana kesudahan} akhir {orang-orang yang sebelum mereka. Allah telah membinasakan mereka. Dan bagi orang-orang kafir itu hal yang serupa dengan itu} hal kesudahan seperti mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Apakah mereka yang mendustakan Rasulullah itu tidak mengadakan perjalanan supaya, “mereka dapat memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka.” Mereka tidak akan menemukan kesudahan, selain kesudahan yang buruk , mereka tidak menengok dan melihat melainkan sekeliling mereka telah binasa dan hancur, pendustaan serta kekufuran mereka pun semakin mengakar, sehingga Allah membinasakan harta dan rumah mereka. Lebih dari itu bahkan Allah menghancurkan amal dan tipu daya mereka. Orang-orang kafir di berbagai masa dan tempat mempunyai contoh-contoh kesudahan serta hukuman hina seperti ini. Sedangkan orang-orang yang beriman akan diselamatkan oleh Allah dari siksaanNya dan diberi balasan baik yang banyak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 10: Allah mencela kafir Mekkah dengan berkata : Apakah kalian tidak berjalan di muka bumi dan melihat dengan mata-mata kalian pelajaran akibat dan musibah-musibah dari kaum-kaum sebelumnya yang mendustakan para utusan mereka sebagaimana Ad, Tsamud, dan kaum Luth ?! Sungguh Allah membinasakan mereka dan mengadzab mereka serta menimpakan kepada mereka keburukan karena sebab kesyirikan, pengingkaran kepada para Nabi mereka, yang telah mereka lakukan. Dan agar mereka tahu bahwa ini adalah akhir dari kesombongan mereka dan kedustaan kepada Nabi Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu orang-orang yang mendustakan Rasul shallallahu 'alaihi wa sallam. Mereka akan menemukan bahwa yang mereka (orang-orang sebelum mereka) dapatkan adalah akibat yang paling buruk. Tidaklah mereka menengok ke kanan dan ke kiri kecuali mereka akan melihat generasi sebelum mereka yang berada di sekeliling mereka telah habis dan binasa. Allah Subhaanahu wa Ta'aala telah menghancurkan harta dan rumah-rumah mereka, bahkan menghancurkan amal dan tipu daya mereka, dan untuk orang-orang kafir di setiap zaman dan setiap tempat ada hukuman dan azab yang serupa. Adapun orang-orang mukmin, maka Allah Subhaanahu wa Ta'aala menyelamatkan mereka dari azab dan melimpahkan pahala yang besar kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 10",
    "description": "Setelah Allah mengecam perbuatan orang-orang kafir dan bahwa mereka akan masuk neraka, maka Allah menyuruh mereka supaya memperhatikan ihwal umat terdahulu dan melihat bekas peninggalan mereka. Dengan melihat keadaan yang dialami oleh umat terdahulu diharapkan mereka dapat mengambil pelajaran. Maka apakah mereka orang-orang kafir yang mendustakan Allah dan rasul-Nya tidak pernah mengadakan perjalanan di bumi di mana terdapat peninggalan umat terdahulu sehingga dapat memperhatikan bagaimana kesudahan dan akibat yang diderita oleh orang-orang yang mendustakan rasul sebelum mereka seperti yang dialami oleh kaum 'ad, kaum Samud, kaum nabi lut dan lainnya. Allah telah membinasakan jiwa, harta, dan anak keturunan mereka, dan bagi orang-orang kafir, kapan dan di mana pun akan menerima nasib yang serupa itu. 11. Hukuman itu terhadap mereka dalam firman-Nya, yang demikian itu, yakni ganjaran yang diterima oleh orang-orang yang beriman dan azab yang diderita oleh orang-orang kafir, karena Allah pelindung bagi orang-orang yang beriman yang melindungi mereka dan memberikan pertolongan; sedang orang-orang kafir tidak ada pelindung bagi mereka yang dapat menyelamatkan dari kehancuran."
  }
]