[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa yang Kami lakukan terhadap kedua kelompok itu; kelompok iman dan kelompok kafir, adalah karena Allah adalah Wali dan Penolong orang-orang beriman, sedangkan orang-orang kafir tidak memiliki wali dan penolong."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Balasan yang telah disebutkan untuk kedua golongan itu karena Allah menolong orang-orang yang beriman kepada-Nya sementara orang-orang kafir tidak mempunyai penolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Itu semua adalah wujud pertolongana Allah kepada orang-orang mukmin yang berjuang di jalan kebenaran. Sedangkan orang-orang kafir yang membangkang tidak ada penolong bagi mereka. Qatadah berkata: Ayat ini turun pada waktu perang Uhud, dan ketika itu Nabi berada di sebuah jalan bukit (la’alla ash shawab), orang-orang lantas meneriaki Nabi dengan: “Hari berganti hari, kami mempunyai Uza (sesembahan mereka), dan kalian tidak memilikinya.” Kemudian nabi berkata: Katakanlah, Allah adalah penolong kami, sementara kalian tidak punya penolong.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hal itu karena Allah adalah pelindung} penolong {bagi orang-orang yang beriman, dan orang-orang kafir tidak mempunyai pelindung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Yang demikian itu karena sesungguhnya Allah adalah pelindung orang-orang yang beriman.” Allah melindungi mereka dengan rahmatNya danb mengeluarkan mereka dari kegelapan menuju cahayaa. Allah memberikan balasan serta kemengan kepada mereka. “Dan karena sesungguhnya orang-orang kafir,” terhadap Allah di mana mereka memutuskan sendiri perlindungan dari Allah dan menolak rahmatNya dari diri mereka, ”tiada mempunyai pelindung,” yang menunjukkan mereka ke jalan keselamatan dan tidak ada yang menyelamatkan mereka dari azab dan siksaan Allah, para pelindung mereka adalah thagut yang mengeluarkan merela dari cahaya menuju kesesatan; mereka itulah penghuni neraka dan mereka kekal di dalamnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 11: Ketahuilah wahai manusia bahwa yang menyebabkan keberhasilah orang-orang yang beriman dan kemuliaan mereka dan juga adzab bagi orang-orang kafir adalah, bahwa Allah adalah Tuan bagi orang-orang beriman dan Penolong bagi mereka. Sedangkan orang-orang yang kafir kepada Allah dan mengingkari ayat-ayat Allah, maka tidak ada bagi mereka penolong, dan yang mencegah mereka dari adzab Allah yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni kemenangan bagi kaum mukmin dan kekalahan bagi kaum kafir. Dia melimpahkan rahmat-Nya kepada mereka, Dia mengeluarkan mereka dari kegelapan kepada cahaya serta yang memberikan balasan dan yang menolong mereka. Kepada Allah, karena mereka berlepas dari perlindungan Allah dan menutup pintu rahmat kepada dirinya. Yang menunjuki mereka ke jalan-jalan keselamatan, menyelamatkan mereka dari azab Allah dan siksa-Nya, bahkan pelindung mereka adalah thagut yang mengeluarkan mereka dari cahaya kepada kegelapan. Mereka itu penghuni neraka dan mereka kekal di dalamnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 11",
    "description": "Hukuman itu terhadap mereka dalam firman-Nya, yang demikian itu, yakni ganjaran yang diterima oleh orang-orang yang beriman dan azab yang diderita oleh orang-orang kafir, karena Allah pelindung bagi orang-orang yang beriman yang melindungi mereka dan memberikan pertolongan; sedang orang-orang kafir tidak ada pelindung bagi mereka yang dapat menyelamatkan dari kehancuran. 12. Setelah Allah menerangkan keadaan orang-orang mukmin dan orang-orang kafir di dunia kemudian diterangkan pula keadaan mereka di akhirat kelak. Sungguh, Allah akan memasukkan orang-orang yang beriman kepada Allah dan rasul-Nya dan membuktikan keimanan mereka dengan mengerjakan kebajikan ke dalam surga yang mengalir di bawahnya sungai-sungai sebagai penghormatan bagi keimanan mereka kepada Allah dan rasul-Nya. Dan orang-orang yang kafir menikmati ke-senangan dunia berupa harta benda dan kesenangannya yang tidak abadi dan mereka makan seperti hewan makan tanpa memikirkan kesudahan mereka; dan kelak nerakalah yang menjadi tempat tinggal bagi mereka sebagai balasan atas kekafirannya."
  }
]