[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Allah memasukkan orang-orang yang beriman kepada Allah dan RasulNya dan mengerjakan amal shalih kedalam surga-surga yang mengalir di bawah istana-istana dan pohon-pohonnya sungai-sungai sebagai penghormatan bagi mereka. Dan perumpamaan orang-orang kafir dalam urusan makan dan kenikmatan dunia adalah seperti hewan ternak yang tidak punya keinginan kecuali makan saja. Neraka Jahanam adalah tempat tinggal dan tempat kembali mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sesungguhnya Allah akan memasukkan orang-orang yang beriman kepada Allah dan Rasul-Nya serta melakukan amal saleh ke dalam Surga yang di bawah istana-istana dan pepohonannya mengalir sungai-sungai. Dan orang-orang yang kafir terhadap Allah dan Rasul-Nya, mereka bersenang-senang di kehidupan dunia dengan mengikuti syahwat mereka, dan mereka makan sebagaimana makannya binatang. Tidak ada tujuan bagi mereka selain perut dan kemaluan mereka, dan pada hari Kiamat, neraka merupakan tempat tinggal mereka yang mereka huni."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah memberi kabar gembira bagi orang-orang beriman yang menjalankan perintah Allah bahwa mereka akan mendapat pahala di akhirat. Allah akan memasukkan mereka ke dalam surga-surga yang memiliki sungai-sungai yang mengalir di bawah pepohonan di istananya. Dan Allah mengolok orang-orang kafir bahwa mereka telah bersenang-senang dengan syahwat dunia dan makan seperti binatang, karena yang mereka fikirkan hanyalah perut mereka, dan neraka Jahannam adalah tempat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَالَّذِينَ كَفَرُوا۟ يَتَمَتَّعُونَ وَيَأْكُلُونَ كَمَا تَأْكُلُ الْأَنْعٰمُ (Dan orang-orang kafir bersenang-senang (di dunia) dan mereka makan seperti makannya binatang) Yakni bersenang-senang dengan kenikmatan dunia seperti binatang ternak, mereka tidak memiliki cita-cita kecuali untuk memuaskan perut dan kemalian mereka, dan tidak memikirkan kesudahannya. وَالنَّارُ مَثْوًى لَّهُمْ(Dan jahannam adalah tempat tinggal mereka) Yakni tempat untuk mereka tinggali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Orang-orang yang beriman kepada-Nya dan rasul-Nya, serta mengamalkan perintah-Nya akan Allah masukkan ke dalam surga yang di bawah bilik dan kebun-kebunnya dialiri sungai-sungai. Adapun orang-orang yang mengingkari Allah dan rasul-Nya, mereka yang tertipu dengan kenikmatan dunia dan juga mereka yang merasa bahwa mereka seperti hewan ternak yang hanya memikirkan perut mereka akan Allah jadikan neraka Jahannam sebagai tempat kembali bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman dan beramal shalih ke dalam surga yang mengalir di bawahnya sungai-sungai. Dan orang-orang kafir bersenang-senang dan makan-makan seperti halnya hewan-hewan ternak. Neraka adalah tempat tinggal} tempat tinggal dan menetap {bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Setelah Allah menyebutkan bahwa DIa adalah pelindung orang-orang yang beriman selanjutnya Allah menyebutkan apa yang akan dilakukan pada mereka di akhirat, mulai dari masuk surga yang dibawahnya mengalir berbagai sungai yang mengairi kebun-kebun penuh bunga itu serta pohon-pohon hijau nan indah yang berbuah. Masing-masing pasangan memiliki kesenangan dan masing-masing buah memiliki kenikmatan. Setelah Allah menyebutkan bahwa orang-orang kafir itu tidak memiliki pelindung, selanjutnya Allah menyebutkan bahwa mereka diserahkan pada diri mereka sendiri, mereka pun tidak memiliki sifat sopan dan tidak memiliki sifat-sifat kemanusiaan, bahkan derajat mereka pun terhempas jauh ke bawah hingga menjadi seperti binatang yang tidak memiliki akal dan akhlak. Sebagian besar keinginan serta tujuan mereka adalah bersenang-senang dengan kenikmatan dan hawa nafsu duniawi. Gerakan mereka, baik yang Nampak maupun yang tidak Nampak berporos di sekitar kesenangan dunia tanpa menuju pada kebaikan dan kebahagiaan. Karena itulah neraka menjadi tempat kembali mereka, yaitu tempat yang telah dipersiapkan untuk mereka, mereka tidak bisa keluar darinya dan siksaan tidak diredakan untuk mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 12: Allah menyebutkan dengan lembut dan penuh kasih sayang kepada orang-orang yang beriman dan dengan penuh kemurkaan kepada orang-orang kafir, Allah mengabarkan bahwa akan memasukkan mereka yang beriman kepada Allah dan membenarkan kerisalahan utusan Allah ﷺ dan beramal dengan amalan shalih ke dalam surga yang mengalir di bawah pepohonan dan istananya sungai-sungai sebagai bentuk pemuliaan kepada mereka, dan bagi orang-orang kafir yang bermain-main di dunia yang fana, dan mereka berfoya-foya dengan kenikmataannya sebagaimana hewan ternak maka akhir dari balasannya adalah kekekalan mereka di neraka jahannam yang akan menjadi tempat tinggal mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan bahwa Dia adalah wali (Pelindung) kaum mukmin, maka Dia menyebutkan apa yang Dia lakukan untuk mereka di akhirat, yaitu dengan memasukkan mereka ke dalam surga yang di bawahnya mengalir sungai-sungai, dimana sungai-sungai itu mengairi kebun-kebun yang indah dan pohon-pohon yang berbuah. Demikian pula setelah Dia menyebutkan bahwa orang-orang kafir tidak mempunyai pelindung, maka Dia menyebutkan bahwa mereka (orang-orang kafir) diserahkan mengurus diri mereka sendiri, sehingga mereka tidak memiliki sifat yang baik dan sifat yang wajar yang seharusnya ada pada dirinya, bahkan keadaan mereka turun seperti halnya hewan ternak yang tidak punya akal dan tidak punya kelebihan, bahkan perhatian mereka dan tujuan mereka hanya ingin bersenang-senang dengan kesenangan dunia. Oleh karena itu, kita melihat aktifitas mereka baik luar maupun dalam (seperti memikirkan) hanya beredar seputar dunia, tidak lebih dari itu dan tidak menghendaki hal yang lebih baik dari itu. Maka tepatlah jika neraka tempat tinggal mereka –wal ‘iyaadz billah-, dimana mereka tidak akan dikeluarkan darinya dan tidak akan diringankan azabnya. Mereka tidak peduli terhadap akhirat, bahkan yang mereka pikirkan adalah memuaskan kebutuhan perut dan seksual mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 12",
    "description": "Setelah Allah menerangkan keadaan orang-orang mukmin dan orang-orang kafir di dunia kemudian diterangkan pula keadaan mereka di akhirat kelak. Sungguh, Allah akan memasukkan orang-orang yang beriman kepada Allah dan rasul-Nya dan membuktikan keimanan mereka dengan mengerjakan kebajikan ke dalam surga yang mengalir di bawahnya sungai-sungai sebagai penghormatan bagi keimanan mereka kepada Allah dan rasul-Nya. Dan orang-orang yang kafir menikmati ke-senangan dunia berupa harta benda dan kesenangannya yang tidak abadi dan mereka makan seperti hewan makan tanpa memikirkan kesudahan mereka; dan kelak nerakalah yang menjadi tempat tinggal bagi mereka sebagai balasan atas kekafirannya. 13. Dan betapa banyak negeri yang penduduknya mendustakan Allah dan rasul-Nya dan mereka lebih kuat dan lebih banyak jumlahnya dari penduduk negerimu yakni penduduk negeri mekah yang telah mengusirmu itu. Meskipun demikian, kami telah membinasakan mereka dengan bermacam-macam cara; maka tidak ada seorang pun yang menolong mereka dari kehancuran."
  }
]