[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Banyak penduduk negeri yang punya kekuatan lebih dari kekuatan penduduk negerimu (wahai rasul), yaitu orang-orang Makkah yang telah mengusirmu. Kami membinasakan mereka dengan berbagai macam azab, dan mereka tidak memiliki penolong yang membantu mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Berapa banyak negeri dari negeri-negeri umat yang terdahulu, lebih kuat dan mempunyai lebih banyak harta dan anak dibanding negeri Makkah yang penduduknya mengusirmu darinya, Kami menghancurkan mereka tatkala mereka mendustakan para rasul mereka, lalu mereka tidak mempunyai penolong yang menyelamatkan mereka dari siksa Allah ketika datang kepada mereka. Maka Kami tidak sulit untuk menghancurkan penduduk Makkah jika Kami menghendaki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Hai Rasulullah, betapa banyak penduduk suatu negeri yang kekuatannya lebih besar daripada kekuatan penduduk Makkah yang mengeluarkanmu darinya; di antara penduduk negeri-negeri itu telah Kami binasakan, dan mereka tidak memiliki penolong yang menghalangi azab itu dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. وَكَأَيِّن مِّن قَرْيَةٍ هِىَ أَشَدُّ قُوَّةً مِّن قَرْيَتِكَ الَّتِىٓ أَخْرَجَتْكَ أَهْلَكْنٰهُمْ (Dan betapa banyaknya negeri yang (penduduknya) lebih kuat dari pada (penduduk) negerimu (Muhammad) yang telah mengusirmu itu. Kami telah membinasakan mereka) Yakni banyak sekali umat dan penduduk negeri yang mempunyai banyak kelebihan dan kekuatan, mereka lebih kuat daripada penduduk Makkah yang telah mengusirmu; namun Kami juga telah membinasakan mereka. فَلَا نَاصِرَ لَهُمْ (maka tidak ada seorang penolongpun bagi mereka) Maka terlebih lagi kaum yang lebih lemah dari mereka yaitu kaum Quraisy."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Betapa banyak para pendahulu penduduk negeri yang lebih kuat dan tangguh dari para penduduk negerimu: Makkah. Yaitu mereka yang telah mengusirmu dari Makkah. Kami telah membinasakan orang-orang terdahulu yang membangkang itu dengan berbagai azab. Mereka tidak mempunyai penolong dari azab yang mereka terima. Ibnu Abbas berkata: Ketika rasul SAW keluar dari gua, rasul melihat ke arah kota Makkah, lalu nabi berucap: “Makkah, engkau adalah negeri Allah yang paling aku cintai, jika tidak karena aku diusir darimu, aku tidak akan meninggalkanmu. Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Betapa banyak} betapa banyak {negeri yang lebih kuat daripada negerimu yang telah mengusirmu itu. Kami telah membinasakan mereka. Tidak ada seorang pun yang menjadi penolong mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Berapa banyak negeri-negeri orang yang mendustakan yang lebih kuat dari negerimu dari segi harta, anak, sekutu, bangunan dan peralatan yang telah Kami hancurkan ketika mereka mendustakan para rasul Kami, berbagai petuah dan nasihat tidak mempan bagi mereka. Kekuatan yang mereka miliki sama sekali tidak berguna untuk melindungi mereka dari siksaan Allah. Lantas bagaimana kondisi orang-orang lemah yang ada di negerimu itu pada saat mereka mengusirmu dari negerimu, mereka mendustakan dan menentangmu, padahal engkau adalah Rasul terbaik serta yang terbaik dari seluruh manusia sejak dari yang pertama hingga yang terakhir. Bukankah mereka lebih berhak untuk dibinasakan dan disiksa daripada yang lain andai Allah tidak mengutus RasulNya membawa rahmat dan kesabaran terhadap semua orang kafir dan penentang?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 13: Kemudian Allah menghibur Nabi-Nya ﷺ agar tidak bersedih atas apa yang menimpanya dari celaan kaumnya dan karena dikeluarkannya Nabi dari negerinya Mekkah, yang beliau sangat mencintainya dan lahir di dalamnya kemudian hidup selama 53 tahun di Mekkah; Allah mengabarkan bahwa banyak dari negeri yang penduduknya lebih kuat daripada negerimu yang engkau telah dikeluarkan darinya dan kecelakaan bagi negeri tersebut karena sebab penghuninya yang kufur dan sombong. Dan tidak ada penolong dan tidak [ula yang mampu mencegah bagi mereka yang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni betapa banyak negeri-negeri orang-orang yang mendustakan yang keadaannya lebih kuat daripada penduduk negerimu yang telah mengusirmu, baik dalam hal harta, anak, penguat, bangunan maupun peralatan. Allah Subhaanahu wa Ta'aala telah membinasakan mereka ketika mereka mendustakan rasul-rasul-Nya, dimana semua nasehat tidak lagi bermanfaat bagi mereka, dan ketika itu todak ada yang menolong mereka, dan kekuatan mereka tidak berguna sama sekali bagi mereka ketika berhadapan dengan azab Allah ‘Azza wa Jalla. Lalu bagaimana dengan mereka yang lemah itu, yakni penduduk negeri yang mengusir Beliau, mendustakan Beliau dan memusuhi Beliau padahal Beliau rasul yang paling utama dan manusia terbaik?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 13",
    "description": "Dan betapa banyak negeri yang penduduknya mendustakan Allah dan rasul-Nya dan mereka lebih kuat dan lebih banyak jumlahnya dari penduduk negerimu yakni penduduk negeri mekah yang telah mengusirmu itu. Meskipun demikian, kami telah membinasakan mereka dengan bermacam-macam cara; maka tidak ada seorang pun yang menolong mereka dari kehancuran. 14. Selanjutnya dijelaskan perbedaan antara kedua golongan itu dan mengapa orang-orang mukmin ditempatkan di tempat yang mulia dan orang-orang kafir ditempatkan di tempat yang rendah. Maka apakah orang yang berpegang pada keterangan yang datang dari tuhannya, ia melihat yang baik dan melakukannya dan memandang yang buruk kemudian meninggalkannya. Apakah orang yang demikian sifatnya itu sama dengan orang yang dijadikan oleh setan terasa indah baginya perbuatan buruknya itu dan sebaliknya tampak buruk baginya perbuatan yang baik dan oleh karena itu mereka senantiasa mengikuti keinginannya yang sesat dalam melakukan atau tidak melakukan perbuatan' pasti, tidak sama."
  }
]