[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang berada di atas bukti nyata dari Tuhannya dan mengetahui keesaanNya sama dengan orang yang setan menghiasi amal buruknya, menuruti ajakannya dengan menyembah kepada selain Allah dan bermaksiat kepadaNya tanpa hujjah dan bukti? Pastilah mereka tidak sama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Apakah orang yang mempunyai bukti yang jelas dan hujah yang nyata dari Rabbnya, dan dia menyembah Rabbnya berdasarkan alasan yang nyata, sama dengan orang yang dijadikan setan memandang baik perbuatannya yang buruk dan mengikuti apa yang menjadi kecondongan hawa nafsunya dari penyembahan kepada berhala-berhala, melakukan dosa dan mendustakan para rasul?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Apakah orang yang memiliki hujjah dan ilmu dalam perkara agamanya, seperti orang yang amal buruknya dihiasi oleh setan sehingga dia menganggapnya sebagai kebaikan dan ia menuruti hawa nafsunya yang batil? Tujuan dari pengingkaran kesamaan antara orang pertama dengan orang kedua adalah untuk menetapkan kelebihan orang pertama dan mengingkari pengakuan orang-orang musyrik yang merasa lebih baik daripada orang-orang beriman. Dan yang dimaksud dengan (بينة من ربه) ‘keterangan yang datang dari Rabbnya’ adalah Allah memberi petunjuk kepadanya dan menggerakkan fikiran mereka sehingga mereka memahami dan menerima kebenaran. Dan disebutkan dari Allah untuk menunjukkan bahwa itu adalah hujjah yang benar dan sempurna."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ مِّن رَّبِّهِۦ كَمَن زُيِّنَ لَهُۥ سُوٓءُ عَمَلِهِۦ (Maka apakah orang yang berpegang pada keterangan yang datang dari Rabbnya sama dengan orang yang (shaitan) menjadikan dia memandang baik perbuatannya yang buruk itu) Yakni orang yang memiliki keyakinan kepada Tuhannya tidak sama dengan orang yang memandang baik perbuatannya dalam menyembah berhala dan menyekutukan Allah serta melakukan kemaksiatan. وَاتَّبَعُوٓا۟ أَهْوَآءَهُم(dan mengikuti hawa nafsunya?) Yakni mengikuti hawa nafsu mereka dalam menyembah berhala, dan tenggelam dalam berbagai kesesatan tanpa ada syubhat yang meragukan mereka ataupun alasan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Apakah sama antara orang yang yakin dan teguh terhadap Tuhannya, yang menyembah Tuhannya dengan cahaya dan matai hati dan antara orang-orang yang mengikuti ajakan setan untuk berbuat keburukan, seperti menyembah berhala menyekutukan Allah dan bermaksiat. Mereka menganggap perbuatan maksiat mereka sebagai kebaikan, mereka selalu menuruti hawa nafsu buruknya untuk menyembah berhala dan lain-lain, dengan tanpa dasar atau dengan dasar yang asal. Hamzah pada kalimat afaman berfungsi sebagai kata tanya untuk mengingkari atau menyanggah bahwa diantara dua olongan itu sama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang yang berpegang teguh pada keterangan} dalil dan bukti {dari Tuhannya itu seperti orang yang perbuatan buruknya dibuat terasa indah bagi mereka dan mengikuti hawa nafsu mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Tidaklah sama antara orang berpegang pada keterangan perintah Agama Allah, baik secara ilmu maupun amal, dan mengetahui kebenaran serta mengikutinya serta mengharapkan janji Allah bagi pengikut kebenaran dengan orang yang hatinya buta, yang menolak kebenaran hingga ia pun tersesat dan mengikuti hawa nafsunya tanpa petunjuk dari Allah meski demikian ia pun tetap berpendirian bahwa yang dipegangnya benar. Alangkah jauhnya perbedaan kedua golongan tersebut dan begitu besar perbedaan antara keduanya, yaitu antara pengikut kebenaran dan pengikut kesesatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 14: Allah menyebutkan bahwa tidak dapat disamakan antara siapa yang mudah dalam beramal dan kehidupannya di atas petunjuk dan dalil dari Allah dan ilmu atas perintah-perintah-Nya dan antara siapa yang setan telah membuat indah keburukan dari sebuah amalan serta mengikuti hawa nafsunya di atas segalanya. Tidak ragu lagi keduanya tidak dapat disamakan selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka ini adalah orang-orang mukmin. Mereka ini adalah orang-orang kafir. Maksudnya, tidak sama orang yang berada di atas ilmu tentang agamanya, dimana dia mengetahui yang hak dan mengikutinya, serta mengharap janji Allah bagi orang yang berada di atas yang hak, dengan orang yang buta hatinya, yang menolak kebenaran dan menghilangkannya serta mengikuti hawa nafsunya tanpa petunjuk dari Allah, disamping itu dia mengira bahwa apa yang dia pegang selama ini adalah kebenaran. Sungguh berbeda kedua golongan itu dan sungguh jauh perbandingannya!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 14",
    "description": "Selanjutnya dijelaskan perbedaan antara kedua golongan itu dan mengapa orang-orang mukmin ditempatkan di tempat yang mulia dan orang-orang kafir ditempatkan di tempat yang rendah. Maka apakah orang yang berpegang pada keterangan yang datang dari tuhannya, ia melihat yang baik dan melakukannya dan memandang yang buruk kemudian meninggalkannya. Apakah orang yang demikian sifatnya itu sama dengan orang yang dijadikan oleh setan terasa indah baginya perbuatan buruknya itu dan sebaliknya tampak buruk baginya perbuatan yang baik dan oleh karena itu mereka senantiasa mengikuti keinginannya yang sesat dalam melakukan atau tidak melakukan perbuatan' pasti, tidak sama. 15. Setelah ayat yang lalu menyatakan perbedaaan antara orang yang beriman dan orang yang kafir dan perbedaan balasan kepada mereka, ayat ini menguraikan ganjaran yang dijanjikan kepada orang yang bertakwa. Perumpamaan keadaan yang sangat indah dan menakjubkan dari taman surga yang dijanjikan kepada orang-orang yang bertakwa; di sana ada sungai-sungai yang airnya tidak payau, tidak berubah rasa dan baunya, dan sungai-sungai air susu yang tidak berubah rasanya, dan sungai-sungai khamar, yakni arak, yang tidak memabukkan sebagaimana arak dunia yang lezat rasanya bagi peminumnya dan di sana juga ada sungai-sungai madu yang murni tidak tercampur dengan sesuatu selainnya. Di dalamnya mereka memperoleh pula segala macam buah-buahan yang yang beraneka macam jenisnya dan di samping kenikmatan yang telah disebutkan itu mereka juga memperoleh ampunan dari tuhan mereka atas segala dosa yang diperbuatnya di dunia. Samakah mereka, orang yang mendapat kenikmatan surgawi dengan orang yang kekal dalam neraka, mereka terbakar oleh api neraka yang sangat panas dan diberi minuman dengan air yang mendidih sehingga karena panasnya ususnya terpotong-potong' jawabannya sangat pasti, keduanya tidak sama."
  }
]