[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sifat surga yang Allah janjikan kepada orang-orang yang bertakwa, adalah bahwa disana ada sunga-sungai besar yang airnya tidak berubah, ada sungai-sungai susu yang rasanya tidak berubah, ada sungai-sungai khamar yang lezat bagi peminumnya, ada sungai-sungai madu murni, bersih dari campuran. Orang-orang yang bertakwa di surga itu akan mendapatkan seluruh buah-buahan dengan berbagai macam dan jenisnya dan lainnya. Lebih besar dari semua itu adalah ditutupi dan diampuninya dosa-dosa mereka. Apakah orang yang ada di dalam surga sama seperti orang yang ada di dalam neraka yang tidak keluar darinya, mereka diberi minum air yang sangat-sangat panas yang menghancurkan lambung-lambung mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Kriteria Surga yang dijanjikan oleh Allah untuk orang-orang yang bertakwa kepada-Nya -dengan mengerjakan segala perintah-Nya dan menjauhi segalalarangan-Nya- untuk memasukkan mereka ke dalamnya. Di dalamnya terdapat sungai-sungai yang tidak berubah aroma dan rasanya karena lamanya menetap, ada sungai-sungai dari susu yang tidak berubah rasanya, ada sungai-sungai dari arak yang sangat nikmat bagi peminumnya dan ada sungai-sungai dari madu yang telah dibersihkan dari berbagai kotoran. Dan bagi mereka di dalamnya segala apa yang mereka inginkan dari buah-buahan serta bagi mereka apa yang lebih dari itu semua, penghapusan dosa-dosa mereka oleh Allah sehingga Allah tidak menghukum mereka. Samakah orang yang mendapat balasan seperti ini dengan orang yang tinggal di Neraka, tidak bisa keluar darinya selamanya diberi minuman dari air yang sangat panas sehingga usus-usus perut mereka putus karena air yang sangat panas itu?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Sifat surga yang Allah janjikan bagi orang-orang yang bertakwa adalah: Di dalamnya terdapat sungai-sungai air tawar yang mengalir yang tidak pernah berubah rasanya, sungai-sungai air susu yang juga tidak pernah berubah rasanya, sungai-sungai khamr yang lezat, dan sungai-sungai madu murni yang tidak tercampur dengan apapun. Di dalamnya juga terdapat berbagai jenis buah-buahan dan ampunan dari Tuhan mereka. Apakah orang yang berada dalam derajat mulia ini seperti orang yang kekal di dalam neraka Jahannam dan diberi minuman dari air mendidih yang dapat memotong-motong usus?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. مَّثَلُ الْجَنَّةِ الَّتِى وُعِدَ الْمُتَّقُونَ ۖ ((Apakah) perumpamaan (penghuni) jannah yang dijanjikan kepada orang-orang yang bertakwa) Makna (مثل الجنة) yakni sifatnya yang menakjubkan. فِيهَآ أَنْهٰرٌ مِّن مَّآءٍ غَيْرِ ءَاسِنٍ (yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya) Makna (الآسن) yakni berubah. Satu makna dengan kata (الآجن) وَأَنْهٰرٌ مِّن لَّبَنٍ لَّمْ يَتَغَيَّرْ طَعْمُهُۥ(sungai-sungai dari air susu yang tidak berubah rasanya) Yakni tidak berasa masam sebagaimana air susu di dunia yang berubah rasanya. وَأَنْهٰرٌ مِّنْ خَمْرٍ لَّذَّةٍ لِّلشّٰرِبِينَ(sungai-sungai dari khamar yang lezat rasanya bagi peminumnya) Yakni nikmat bagi mereka dan sama sekali tidak mereka benci. وَأَنْهٰرٌ مِّنْ عَسَلٍ مُّصَفًّى ۖ( dan sungai-sungai dari madu yang disaring) Sehingga tidak lagi tercampur dengan lilin, ampas, dan sesuatu yang mengotorinya. وَلَهُمْ فِيهَا مِن كُلِّ الثَّمَرٰتِ(dan mereka memperoleh di dalamnya segala macam buah-buahan) Yakni dari segala jenis buah-buahan. وَمَغْفِرَةٌ مِّن رَّبِّهِمْ ۖ( dan ampunan dari Rabb mereka) Atas dosa-dosa mereka. كَمَنْ هُوَ خٰلِدٌ فِى النَّارِ(sama dengan orang yang kekal dalam jahannam) Yakni apakah orang yang kekal berada dalam kenikmatan surga dengan sifat yang demikian seperti orang yang kekal dalam neraka? Tidaklah penghuni surga yang didalamnya terdapat buah-buahan dan sungai-sungai seperti penghuni neraka yang di dalamnya terdapat azab yang pedih. وَسُقُوا۟ مَآءً حَمِيمًا(dan diberi minuman dengan air yang mendidih) Yakni air yang sangat panas. فَقَطَّعَ أَمْعَآءَهُمْ (sehingga memotong ususnya?) Karena begitu panasnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Tidak sama, para penghuni surga dengan orang-orang yang kekal di neraka. Makna ayat ini adalah bahwa sifat/karakteristik surga yang serba menakjubkan, Allah menjanjikannya bagi orang-orang yang bertakwa. Di surga,mengalir sungai-sungai, tidak berubah rasa dan aromanya. Airnya terbuat dari susu yang tidak berubah rasanya. Juga ada sungai arak yang memuaskan peminumnya. Berbagai macam buah yang menggiurkan. Mereka pun juga mendapatkan ampunan atas kesalahan-kesalahan mereka. Berbeda, dengan para penghuni neraka, mereka kekal di dalamnya. Mereka diberi minum berupa air yang sangat panas dan mendidih, yang menghancurkan usus mereka karena panasnya. Makna yang tersirat dari itu bahwa: lalu apakah sama antara orang para penghuni surga dengan berbagai hal yang menakjubkan, dan antara orang-orang yang kekal di dalam neraka? Jawaban terangnya adalah: sama sekali tidak sama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Perumpamaan} ciri-ciri {surga yang dijanjikan kepada orang-orang yang bertakwa itu di dalamnya ada sungai-sungai yang airnya tidak payau} tidak berubah rasa dan aromanya {sungai-sungai air susu yang rasanya tidak berubah, sungai-sungai khamr yang lezat} yang lezat {bagi para peminumnya, dan sungai-sungai madu yang murni} yang bersih dari unsur lilin dan rumput {Bagi mereka di dalamnya segala macam buah dan ampunan dari Tuhan mereka itu seperti orang yang kekal dalam neraka dan diberi minuman dengan air yang mendidih} yang sangat panas {sehingga usus mereka terpotong-potong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Artinya, perumpamaan surga yang disediakan Allah untuk hamba-hambaNya yang takut akan murkaNya serta meniti keridhaanNya, yakni dengan segala sifat surga yang indah itu dimana “di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan aromanya,” yakni, tidak berubah (cita rasanya), tidak menganggu kesehatan, tidak berbau, tidak asam, dan tidak keruh, tapi air surga adalah air yang paling sejuk, bersih dan enak aromanya serta lezat rasanya, “sungai-sungai dari susu yang tiada berubah rasanya,” tidak pahit dan lainnya, dan “sungai-sungai dari khamar (arak) yang lezat rasanya bagi peminumnya,” orang yang meminumnya sangat merasakan kelezatannya, tidak seperti khamar dunia yang rasanya tidak enak, membuat kepala pening dan merusak akal, “dan sungai-sungai dari madu yang disaring,” dari sarang dan semua kotorannya, “dan mereka di dalamnya memperoleh segala macam buah-buahan,” mulai dari kurma, anggur, apel, delima, limau, buah tin dan lainnya yang tidak ada bandingannya di dunia. Semua yang mereka inginkan itu mereka dapatkan. Selanjutnya Allah berfirman, “Dan ampunan dari Rabb mereka.” Semua yang mereka takutkan sirna dengan ampunan itu. Apakah golongan ini lebih baik ataukah “orang yang kekal dalam neraka,” yang panasnya sangat membara dan azabnya berlipat-lipat, “dan diberi minuman,” di dalam neraka, “dengan air yang mendidih,” yang sangat panas, “sehingga memotong-motong ususnya?” Mahasuci Allah yang membedakan secara jauh antara kedua tempat, kedua balasan, kedua golongan orang yang beramal dan kedua perbuatan yang diperbuat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 15: Ketahuilah bahwa sifat dari surga yang Allah telah janjikan bagi orang-orang yang bertakwa; Padanya terdapat sungai-sungai dari air yang baik yang tidak berubah, dan sungai-sungai dari susu yang tidak berubah rasanya, dan sungai-sungai dari madu yang tidak didapati kekurangan. Padanya juga terdapat buah-buahan yang beraneka macam, dan nikmat yang paling besar adalah ridha Allah dan ampunan bagi mereka atas dosa dan balasannya; Bahkan dosa-dosa mereka digantikan dengan kebaikan sebagai kemulian dan kebaikan dari Allah. Maka apakah penghuni surga keadaannya sama dengan penghuni nereka dalam tempat yang mereka tidak akan keluara di dalamnya selamanya, dan penghuni neraka diberikan air mendidih sehingga sama dalam balasan atas keduanya ? Kemudian dikembalikan kondisi mereka untuk diadzab kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni sifatnya. Yaitu mereka yang menghindari kemurkaan Allah dan mengikuti keridhaan-Nya. Yakni tidak berubah seperti halnya air di dunia yang berubah ketika ada sesuatu yang mengenainya. Bahkan airnya adalah air yang paling segar, paling jernih, paling wangi dan paling lezat rasanya. Menjadi asam atau rasa lainnya. Berbeda dengan khamr di dunia, tidak lezat rasanya ketika diminum dan memabukkan. Yang telah disaring. Seperti kurma, anggur, apel, delima, tin dan lainnya yang tidak ada bandingannya di dunia. Segala yang mereka senangi dan mereka inginkan, mereka dapatkan. Dengan ampunan itu semua yang dikhawatirkan hilang. Mahasuci Allah yang membedakan antara kedua tempat itu, demikian pula balasannya, orangnya dan amalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 15",
    "description": "Setelah ayat yang lalu menyatakan perbedaaan antara orang yang beriman dan orang yang kafir dan perbedaan balasan kepada mereka, ayat ini menguraikan ganjaran yang dijanjikan kepada orang yang bertakwa. Perumpamaan keadaan yang sangat indah dan menakjubkan dari taman surga yang dijanjikan kepada orang-orang yang bertakwa; di sana ada sungai-sungai yang airnya tidak payau, tidak berubah rasa dan baunya, dan sungai-sungai air susu yang tidak berubah rasanya, dan sungai-sungai khamar, yakni arak, yang tidak memabukkan sebagaimana arak dunia yang lezat rasanya bagi peminumnya dan di sana juga ada sungai-sungai madu yang murni tidak tercampur dengan sesuatu selainnya. Di dalamnya mereka memperoleh pula segala macam buah-buahan yang yang beraneka macam jenisnya dan di samping kenikmatan yang telah disebutkan itu mereka juga memperoleh ampunan dari tuhan mereka atas segala dosa yang diperbuatnya di dunia. Samakah mereka, orang yang mendapat kenikmatan surgawi dengan orang yang kekal dalam neraka, mereka terbakar oleh api neraka yang sangat panas dan diberi minuman dengan air yang mendidih sehingga karena panasnya ususnya terpotong-potong' jawabannya sangat pasti, keduanya tidak sama. 16. Ayat-ayat yang lalu menjelaskan sifat-sifat dan perbuatan orang-orang yang beriman dan orang-orang kafir dan perolehan mereka terhadap balasan yang diberikan Allah. Selain kedua golongan itu terdapat kelompok orang dengan sifat-sifatnya yang menjadi ciri dari perbuatan mereka, yaitu orang-orang munafik. Ayat ini menjelaskan sifat-sifat orang munafik itu. Dan di antara mereka ada orang yang men-dengarkan perkataanmu tentang Al-Qur'an dan penjelasannya dengan tekun, wahai nabi Muhammad, tetapi apabila mereka telah keluar dari sisimu meninggalkan majelismu mereka berkata kepada orang yang telah diberi ilmu, yakni sahabat-sahabat nabi, untuk menanamkan keraguan terhadap perkataan nabi. Mereka bertanya dengan tujuan mencemooh dan mengolok-olok, 'apakah yang dikatakannya tadi'' itulah perbuatan orang-orang munafik seperti abdullah bin ubay dan lain-lainnya. Mereka itulah orang-orang yang dikunci hatinya oleh Allah sehingga tidak ada petunjuk yang masuk ke dalam hatinya dan oleh karena itu mereka senantiasa mengikuti keinginannya."
  }
]