[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Di antara orang-orang munafik itu ada yang mendengarkanmu (wahai nabi), tetapi tanpa pemahaman, mereka mendengar hanya untuk meremehkan dan menghina. Saat mereka meninggalkan majelismu, mereka bertanya dengan nada menyepelekan kepada orang-orang yang hadir di majlismu dari orang-orang yang berilmu tentang kitab Allah, “Apa yang tadi diucapkan oleh Muhammad sekarang?” mereka itu adalah orang-orang yang Allah tutup hati mereka rapat-rapat, sehingga tidak dapat memahami kebenaran dan tidak mendapat petunjuk dengannya, mereka mengikuti hawa nafsu mereka dalam kekafiran dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Di antara orang-orang munafik ada yang mendengarkan ucapanmu -wahai Rasul- mendengar tanpa diikuti dengan penerimaan, justru diikuti dengan penolakan, sehingga jika mereka telah keluar dari sisimu, mereka berkata kepada orang-orang yang diberi ilmu oleh Allah, “Apa yang dikatakan Rasul dalam ucapannya barusan?” Sebagai bentuk pura-pura bodoh dan penolakan dari mereka. Mereka itulah orang-orang yang Allah telah kunci mati hati-hati mereka sehingga kebaikan tidak sampai kepadanya dan mengikuti hawa nafsu mereka sehingga membutakan mereka dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Di antara orang-orang merugi itu adalah orang-orang munafik yang mendengarkanmu dengan seksama hai Rasulullah, namun jika mereka telah keluar dari majelismu, mereka berkata dengan nada menghina kepada orang-orang berilmu yang ikut menghadiri majelis: “Apa yang dikatakan Muhammad tadi?” Mereka adalah orang-orang yang jauh dari kebenaran yang Allah tutup hari mereka, sehingga mereka tidak dapat memahami dan menuruti hawa nafsu mereka dalam sifat kemunafikan. Ungkapan ayat ini menunjukkan bahwa pertanyaan seperti itu merupakan hal tercela, karena setelahnya Allah berfirman, “Mereka adalah orang-orang yang Allah tutup hatinya”, dan pertanyaan itu menunjukkan kehinaan orang yang bertanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَمِنْهُم مَّن يَسْتَمِعُ إِلَيْك (Dan di antara mereka ada orang yang mendengarkan perkataanmu) Yakni di antara orang-orang kafir yang menikmati dunia dan makan seperti hewan ternak yang makan terdapat orang-orang yang mendengarkanmu, dan mereka adalah orang-orang munafik. حَتَّىٰٓ إِذَا خَرَجُوا۟ مِنْ عِندِكَ(sehingga apabila mereka keluar dari sisimu) Dahulu orang-orang munafik ikut menghadiri majlis nasehat dan khutbah Rasulullah yang diberikan bagi kaum muslimin, namun setelah mereka keluar dari majelis itu, قَالُوا۟ لِلَّذِينَ أُوتُوا۟ الْعِلْمَ(mereka berkata kepada orang yang telah diberi ilmu pengetahuan) Yakni kepada para ulama dari kalangan para sahabat. مَاذَا قَالَ ءَانِفًا ۚ( “Apakah yang dikatakannya tadi?”) Yakni apa yang dikatakan Rasulullah tadi? Mereka menanyakan ini dengan maksud untuk memperolok. Dan maknanya adalah: aku sama sekali tidak memperhatikannya. أُو۟لٰٓئِكَ(Mereka itulah) Yakni orang-orang munafik itu. الَّذِينَ طَبَعَ اللهُ عَلَىٰ قُلُوبِهِمْ(orang-orang yang dikunci mati hati mereka oleh Allah) Sehingga mereka tidak beriman, dan hati mereka tidak condong sama sekali kepada kebaikan. وَاتَّبَعُوٓا۟ أَهْوَآءَهُمْ(dan mengikuti hawa nafsu mereka) Dalam kekafiran dan kedurhakaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Di antara orang-orang kafir, ada kelompok orang munafik yang mendengar perkataanmu waha Nabi. Kemudian setelah mereka beranjak dari tempatmu berkhutbah atau tempat dimana engkau memberi nasihat, mereka mengajukan pertanyaan kepada orang-orang yang dianggap berilmu. “Apa maksud perkataan Nabi tentang hari kiamat tadi?”, pertanyaan itu disampaikan dengan maksud mengejek dan menyombongkan diri. Mereka menganggap bahwa perkataan rasul itu adalah perkataan yang tidak bermanfaat. Mereka itulah, orang-orang yang telah Allah tutup pendengaran dan hatinya dengan kekafiran. Sehingga mereka tidak akan pernah beriman dan juga tidak mendapatkan petunjuk di jalan yang benar. Mereka tetap menuruti segala hawa nafsunya dalam berbuat kemunafikan, tanpa landasan. Anifan bermakna baru saja. Ayar ini diturunkan untuk perilaku orang munafik yang sebelumnya menyimak perkataan Nabi namun tidak merasuk dalam hatinya. Ketika perkataan nabi itu selesai, mereka bertanya kepada orang mukmin “apa yang dikatakan nabi tadi?” dengan maksud menghina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Di antara mereka} di antara orang-orang munafik {ada orang yang mendengarkan perkataanmu sehingga apabila mereka telah keluar dari sisimu, mereka berkata kepada orang yang telah diberi ilmu,“Apa yang dia katakan tadi”} barusan {Mereka itu adalah orang-orang yang dikunci} dikunci {hatinya oleh Allah dan mengikuti hawa nafsu mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Allah berfirman, “Dan di antara orang-orang munafik “ada orang yang mendengarkan perkataan (Muhammad),” mendengarkan ucapanmu bukan bermaksud untuk menerima dan menaati, tapi hatinya berpaling dari perkataan itu, dan karena itulah Allah berfirman, “Sehingga apabila mereka keluar dari sisimu, mereka berkata kepada orang yang telah diberi ilmu pengetahuan,” yang berpura-pura memahami perkataanmu serta yang mereka dengar yang tidak mereka sukai, “Apakah yang dikatakannya tadi?” yakni, apa yang dikatakannya barusan? Ayat ini adalah puncak celaan untuk mereka, sebab andai saja mereka benar-benar mencari kebaikan, tentu akan benar-benar memperhatikan dengan pendengaran mereka dan pasti akan dipahami oleh hati mereka sehingga seluruh bagian tubuh mereka tunduk, hanya saja mereka itu sebaliknya, karena itulah Allah berfirman, “Mereka itulah yang dikunci mati hati mereka oleh Allah,” yaitu Allah menutupnya serta menutup semua pintu kebaikan kebaikan yang mungkin bisa dicapai, karena mereka menurutkan keinginan mereka, dan tidaklah mereka menginginkan kecuali kebatilan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 16: Ketahuilah wahai Nabi Allah bahwa di antara mereka orang-orang munafik ada yang mendengarkan ucapanmu tanpa mengumpulkannya di dalam hatinya barang sesuatupun, sehingga jika dia keluar dari majelismu berkata mereka (munafik) atas orang-orang yang berilmu yang hadir dalam majelismu dengan penghinaan : Apa yang sebenarnya Muhammad katakan barusan ? Ketahuilah bahwa mereka adalah orang-orang munafik yang Allah tutup hati-hati mereka, mereka tidak akan paham kebenaran dan tidak pula kebenaran dapat memberi petunjuk kepadanya, mereka adalah orang-orang yang mengikuti hawa nafsu mereka dalam kekafiran dan kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu pada saat Rasulullah shallallahu 'alaihi wa sallam berceramah. Mereka ini adalah orang-orang munafik. Mereka hanya sekedar mendengar, bukan untuk menerima dan mengikuti, bahkan hati mereka berpaling darinya. Meminta pemahaman terhadap apa yang mereka dengar dari Rasulullah shallallahu 'alaihi wa sallam, padahal mereka tidak suka kepada ucapan Beliau. Sekiranya mereka menginginkan kebaikan, tentu mereka pasang telinganya dan ucapan Beliau yang begitu jelas masuk ke dalam hati mereka, dan anggota badan mereka tunduk kepadanya, akan tetapi mereka tidak demikian. Allah Subhaanahu wa Ta'aala telah mengunci hatinya dan menutup pintu-pintu kebaikan disebabkan mereka mengikuti hawa nafsunya dan tidak mereka inginkan selain kebatilan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 16",
    "description": "Ayat-ayat yang lalu menjelaskan sifat-sifat dan perbuatan orang-orang yang beriman dan orang-orang kafir dan perolehan mereka terhadap balasan yang diberikan Allah. Selain kedua golongan itu terdapat kelompok orang dengan sifat-sifatnya yang menjadi ciri dari perbuatan mereka, yaitu orang-orang munafik. Ayat ini menjelaskan sifat-sifat orang munafik itu. Dan di antara mereka ada orang yang men-dengarkan perkataanmu tentang Al-Qur'an dan penjelasannya dengan tekun, wahai nabi Muhammad, tetapi apabila mereka telah keluar dari sisimu meninggalkan majelismu mereka berkata kepada orang yang telah diberi ilmu, yakni sahabat-sahabat nabi, untuk menanamkan keraguan terhadap perkataan nabi. Mereka bertanya dengan tujuan mencemooh dan mengolok-olok, 'apakah yang dikatakannya tadi'' itulah perbuatan orang-orang munafik seperti abdullah bin ubay dan lain-lainnya. Mereka itulah orang-orang yang dikunci hatinya oleh Allah sehingga tidak ada petunjuk yang masuk ke dalam hatinya dan oleh karena itu mereka senantiasa mengikuti keinginannya. 17. Ayat sebelumnya menjelaskan orang-orang yang tertutup hatinya sehingga mereka senantiasa mengikuti jalan yang sesat, ayat ini meng-uraikan golongan yang mendapat petunjuk sehingga dimudahkan baginya menempuh jalan yang benar. Dan orang-orang yang mendapat petunjuk, yakni orang-orang yang beriman Allah akan menambah petunjuk kepada mereka sehingga bertambah terang bagi mereka jalan kepada kebenaran dan menganugerahi ketakwaan mereka dengan memberikan pertolongan dan kemudahan dalam melakukan kebajikan."
  }
]