[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mendapatkan petunjuk untuk mengikuti kebenaran, Allah menambah hidayah kepada mereka, maka hidayah mereka menjadi kuat, dan Allah juga membimbing mereka kepada takwa dan memudahkannya bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Dan orang-orang yang mendapat petunjuk kepada kebenaran dan mengikuti apa yang dibawa oleh Rasulullah -ṣallallāhu 'alaihi wa sallam-, Rabb mereka menambahkan bagi mereka petunjuk dan taufik untuk kebaikan dan memberikan mereka pemahaman untuk beramal yang menjaga mereka dari Neraka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Sedangkan orang-orang beriman yang mendapat petunjuk menuju ke jalan kebenaran, maka Allah menambah taufik dan petunjuk kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَالَّذِينَ اهْتَدَوْا۟ (Dan orang-orang yang mau menerima petunjuk) Yakni petunjuk menuju jalan kebaikan, sehingga beriman kepada Allah dan menjalankan apa yang Dia perintahkan. زَادَهُمْ (Allah menambah kepada mereka) Yakni Allah menambahkan bagi mereka. هُدًى (petunjuk) Dengan memberinya taufik, ilmu, dan pengetahuan agama. وَءَاتَىٰهُمْ تَقْوَىٰهُمْ(dan memberikan balasan ketakwaannya) Yakni Allah akan mengilhamkan kepadanya untuk bertakwa dan membantunya untuk itu dengan memudahkannya untuk melakukan amal yang Dia ridhai."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Orang-orang yang mendapat petunjuk, yaitu orang yang beriman, akan Allah anugerahkan taufik, dan juga keridhoan atas ketakwaan mereka kepada Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang mendapat petunjuk akan ditambahkan petunjuk dan dianugerahkan kepada mereka} dan diilhamkan kepada mereka {ketakwaan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Selanjutnya Allah menjelaskan kondisi orang-orang yang mendapatkan petunjuk seraya berfirman, “Dan orang-orang yang mendapat petunjuk,” dengan iman serta taat dan mengikuti apa yang diridhai Allah, “Allah menambah petunjuk kepada mereka,” sebagai rasa terimakasih Allah kepada mereka atas hal itu, “dan memberikan kepada mereka (balasan) ketakwaannya.” Artinya mereka diberi pertolongan untuk melakukan kebaikan dan dijaga dari keburukan. Kemudian Allah menjelaskan adanya dua balasan bagi orang-orang yang bertakwa: ilmu yang bermanfaat dan amal shalih."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 17: Allah menjelaskan bahwa orang-orang yang beriman yang mengikuti petunjuk (kebenaran) dan menjawab seruan Allah, sungguh Allah tambahkan cahaya kepada mereka dan ilmu, dan dikokohkan di atas ketakwaan dan dimudahkan baginya (untuk bertakwa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menerangkan keadaan orang-orang yang mendapat petunjuk. Dengan beriman, tunduk dan mengikuti keridhaan Allah Subhaanahu wa Ta'aala. Sebagai syukur-Nya kepada mereka atas hal itu. Allah Subhaanahu wa Ta'aala akan memberi mereka taufiq kepada kebaikan dan menjaga mereka dari keburukan. Dia menyebutkan dalam ayat ini bahwa orang-orang yang mendapatkan petunjuk memperoleh dua balasan; ilmu yang bermanfaat dan amal yang saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 17",
    "description": "Ayat sebelumnya menjelaskan orang-orang yang tertutup hatinya sehingga mereka senantiasa mengikuti jalan yang sesat, ayat ini meng-uraikan golongan yang mendapat petunjuk sehingga dimudahkan baginya menempuh jalan yang benar. Dan orang-orang yang mendapat petunjuk, yakni orang-orang yang beriman Allah akan menambah petunjuk kepada mereka sehingga bertambah terang bagi mereka jalan kepada kebenaran dan menganugerahi ketakwaan mereka dengan memberikan pertolongan dan kemudahan dalam melakukan kebajikan. 18. Orang munafik itu telah tertutup hatinya dari petunjuk Allah, ke-imanan mereka tidak dapat diharapkan lagi, maka bagi orang-orang munafik itu apalagi yang mereka tunggu-tunggu selain hari kiamat, yang pasti datangnya dan akan datang hari yang dijanjikan itu kepada mereka secara tiba-tiba, karena tanda-tandanya, di antaranya kehadiran nabi Muhammad sebagai nabi penutup, sungguh telah datang. Maka apa gunanya bagi mereka kesadaran mereka itu apabila hari kiamat itu sudah datang' tidak ada lagi gunanya kesadaran yang terlambat datangnya."
  }
]