[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang mendustakan itu tidak menunggu kecuali Hari Kiamat yang telah dijanjikan kepada mereka akan datang secara tiba-tiba. Tanda-tandanya telah terlihat, tetapi mereka tidak mengambil pelajaran darinya. Lalu dari mana mereka bisa mengambil pelajaran saat Hari Kiamat benar-benar datang?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Maka adakah yang ditunggu oleh orang-orang kafir itu kecuali tibanya hari Kiamat yang datang kepada mereka dengan tiba-tiba tanpa mereka ketahui sebelumnya? Tanda-tanda Kiamat sudah datang, di antaranya diutusnya Muhammad -ṣallallāhu 'alaihi wa sallam- dan terbelahnya bulan. Maka bagaimana mereka akan mengambil pelajaran apabila Kiamat sudah datang kepada mereka? Tidak mungkin mereka mendapat manfaat dari kesadaran mereka saat itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Bukankah orang-orang kafir itu hanya menungguh terjadinya hari kiamat yang dijanjikan yang mendatangi mereka secara tiba-tiba? Telah muncul sebagian tanda-tanda kedatangannya, lalu dari mana lagi mereka akan mendapat pelajaran jika hari kiamat datang kepada mereka?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. فَهَلْ يَنظُرُونَ إِلَّا السَّاعَةَ (Maka tidaklah yang mereka tunggu-tunggu melainkan hari kiamat) Yakni hari kiamat. أَن تَأْتِيَهُم بَغْتَةً ۖ(yang datang kepada mereka dengan tiba-tiba) Yakni secara tiba-tiba. فَقَدْ جَآءَ أَشْرَاطُهَا ۚ( karena sesungguhnya telah datang tanda-tandanya) Mereka telah membaca dalam kitab-kitab mereka bahwa Nabi Muhammad adalah nabi yang terakhir, sehingga pengutusannya merupakan salah satu tanda dekatnya hari kiamat. Dalam kitab shahihain dan lainnya disebutkan dari hadits Anas, ia berkata, Rasulullah bersabda: “Aku pengutusanku sebagai Rasul dan hari kiamat seperti dua hal ini.” Rasulullah sambil menunjukkan jari tengah dan telunjuknya. فَأَنَّىٰ لَهُمْ إِذَا جَآءَتْهُمْ ذِكْرَىٰهُمْ(Maka apakah faedahnya bagi mereka kesadaran mereka itu apabila Kiamat sudah datang?) Yakni dari mana mereka akan dapat mengambil pelajaran jika hari kiamat telah mendatangi mereka? Karena ketika itu bukan saatnya lagi diberikannya peringatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Apa yang ditunggu-tunggu para penduduk Makkah itu selain datangnya hari kiamat? Artinya, mereka hanya menunggu kedatangan kiamat itu yang datang tiba-tiba. Sementara mereka tetap dalam kemunafikan dan kekafiran, dan tanda kiamat pun telah banyak tampak. Lalu apa gunanya kesadaran mereka jika kiamat telah datang dengan tiba-tiba?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apa yang mereka tunggu} mereka tunggu {selain hari kiamat yang akan datang kepada mereka secara tiba-tiba} secara tiba-tiba {dan sungguh tanda-tandanya} indikasi dan tanda-tandanya {telah datang. Maka bagaimana gunanya pelajaran itu bagi mereka apabila (kiamat) itu sudah datang} maka bagaimana peringatan dan pelajaran itu berguna bagi mereka ketika kiamat itu datang kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Artinya, tidaklah mereka yang mendustakan itu menanti “melainkan Hari KIamat (yaitu) kedatangannya kepada mereka dengan tiba-tiba,” yakni secara begitu saja tanpa aba-aba sedangkan mereka tidak merasakan, “karena sesungguhnya telah datang tanda-tandanya,” yakni tanda-tanda yang menunjukkan dekatnya Hari Kiamat. “Maka apakah faidahnya bagi mereka kesadaran mereka itu apabila Hari KIamat sudah datang?” artinya, lantas dari manakah mereka bisa ingat dan bertaubat ketika Hari KIamat telah datang dan ajal mereka telah terputus? Waktu untuk ingat sudah tidak ada lagi bagi mereka, mereka telah diberi usia panjang di dunia yang andai mereka bisa mengambil peringatan, tentulah mereka ingat dan peringatan telah datang kepada mereka. Dalam penjelasan ini terdapat dorongan untuk mempersiapkan diri sebelum dijemput oleh kematian, karena kematian seseorang itulah kiamatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 18: Allah berkata kepada mereka orang-orang munafik dengan celaan : Apakah kalian menunggu hari dimana ditegakkan kepada kalian secara tiba-tiba, dan kalian tidak sadar akan hal itu ? Maka telah datang tanda-tanda kedekatan akan hal itu, namun tidak memberikan manfaat kepada kalian, dan kalian tidak juga beriman, maka mana lagi yang bisa mumbuat kalian ingat ketika datang hari kiamat ?! Dan telah dimaklumi ketika datang hari kiamat maka tidak berguna keimanan bagi yang sebelumnya tidak beriman, dan tidak akan diterima taubat pada hari itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu orang-orang yang mendustakan. Yang menunjukkan kedekatannya, seperti telah diutusnya Nabi Muhammad shallallahu 'alaihi wa sallam, terbelahnya bulan, adanya dukhan (asap), dsb. Kesadaran ketika itu tidaklah berguna karena waktunya telah berlalu, mereka telah melalui waktu yang biasanya orang yang sadar jika melaluinya akan sadar, yaitu di dunia. Di samping itu, pemberi peringatan telah datang kepada mereka. Dalam ayat ini terdapat dorongan untuk mempersiapkan diri sebelum maut datang seara tiba-tiba, karena dengan tibanya kematian, maka tibalah kiamat untuk dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 18",
    "description": "Orang munafik itu telah tertutup hatinya dari petunjuk Allah, ke-imanan mereka tidak dapat diharapkan lagi, maka bagi orang-orang munafik itu apalagi yang mereka tunggu-tunggu selain hari kiamat, yang pasti datangnya dan akan datang hari yang dijanjikan itu kepada mereka secara tiba-tiba, karena tanda-tandanya, di antaranya kehadiran nabi Muhammad sebagai nabi penutup, sungguh telah datang. Maka apa gunanya bagi mereka kesadaran mereka itu apabila hari kiamat itu sudah datang' tidak ada lagi gunanya kesadaran yang terlambat datangnya. 19. Setelah Allah menjelaskan bahwa kesadaran tidak lagi berguna setelah berakhirnya kehidupan dunia, maka Allah menyuruh rasul-Nya agar teguh pendirian dan agar memohonkan ampunan untuk para pengikutnya. Maka ketahuilah, bahwa tidak ada tuhan (yang patut disembah) selain Allah dan mohonlah ampunan atas dosamu dan atas dosa orang-orang mukmin, laki-laki dan perempuan. Dan Allah mengetahui tempat usaha kamu mencari bermacam-macam keperluan hidupmu di dunia dan mengetahui tempat tinggalmu untuk beristirahat setelah engkau bekerja sepanjang hari."
  }
]