[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketahuilah (wahai Nabi) bahwa tidak ada tuhan sembahan yang haq kecuali Allah. maka mohonlah ampunan kepada Allah atas dosamu dan mohonlah ampunan kepada Allah atas orang-orang Mukmin; laki-laki dan perempuan. Allah mengetahui tindakan kalian di siang hari saat kalian terjaga dan tempat istirahat kalian saat kalian tidur di malam hari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Maka yakinilah -wahai Rasul- bahwa tidak ada yang berhak disembah selain Allah, maka mohonkan ampunan kepada Allah untuk dosa-dosamu dan mohonkan ampunan untuk dosa-dosa orang-orang yang beriman laki-laki maupun perempuan. Allah mengetahui tingkah laku kalian pada siang hari dan tempat tinggal kalian di malam hari, tidak ada sesuatu pun bagi Allah yang luput."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Hai Rasulullah, ketahuilah bahwa tidak ada Tuhan yang berhak disembah selain Allah. Dan mohonlah ampun atas dosamu dan dosa mu’minin dan mu’minat. Allah Maha Mengetahui apa yang kalian lakukan dalam beraktifitas dan tempat istirahat kalian setelah bekerja, dan tempat kalian di alam barzakh dan ketika di akhirat, di surga atau neraka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَاعْلَمْ أَنَّهُۥ لَآ إِلٰهَ إِلَّا اللهُ (Maka ketahuilah, bahwa sesungguhnya tidak ada Ilah (sesembahan, tuhan) selain Allah) Yakni ketahuilah bahwa tidak ada Tuhan selain-Nya. وَاسْتَغْفِرْ لِذَنۢبِكَ(dan mohonlah ampunan bagi dosamu) Yakni mohonlah ampun kepada-Nya atas apa yang telah kamu lakukan. وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنٰتِ ۗ(dan bagi (dosa) orang-orang mukmin, laki-laki dan perempuan) Dengan memohonkan bagi mereka ampunan atas dosa-dosa mereka. والله يعلم متقبلكم (Dan Allah mengetahui tempat kamu berusaha) Dalam amalan-amalan kalian. وَمَثْوَىٰكُمْ (dan tempat kamu tinggal) Di kehidupan akhirat. Pendapat lain mengatakan yakni Allah mengetahui tempat kalian beramal di siang hari dan tempat kalian tidur di malam hari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Ketahuilah wahai Nabi, Dia-lah Allah yang tidak ada Tuhan yang patut disembah kecuali Dia semata. Laksanakan dan istiqamahlah kewajibanmu atasnya dengan mengesakan-Nya Mintalah ampunan kepada-Nya –ini adalah bentuk ajaran kepada umat nabi- juga mintakan ampunan kepada orang-orang mukmin. Engkau adalah orang yang lemah lembut dan menyayangi umatmu wahai Nabi. Allah Maha Tahu atas segala perbuatan kalian di negeri kalian, Allah Maha Tahu segala apa yang kalian lakukan baik malam maupun siang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketahuilah bahwa tidak ada Tuhan selain Allah serta mohonlah ampunan atas dosamu dan orang-orang mukmin laki-laki dan perempuan. Allah mengetahui tempat berkerja kalian} tempat kalian berusaha pada siang hari {dan tempat istirahat kalian} tempat istirahan kalian pada malam hari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Dalam ilmu harus ada pengakuan hati dan mengetahui makna yang diharuskan oleh apa yang diketahui, dan secara sempurnanya adalah mengamalkan keharusannya. Inilah ilmu yang diperintahkan oleh Allah, yaitu ilmu tentang memahaesakan Allah. Ilmu ini wajib hukumnya atas setiap orang dan tidak bisa gugur bagi siapa pun juga, bahkan semua orang sangat memerlukannya. Ada beberapa cara untuk mengetahui tidak ada sesembahan kecuali Allah; 1. Dan ini paling penting, adalah merenungkan nama-nama dan sifat-sifat serta perbuatan Allah yang menunjukkan pada kesempurnaan, keagungan, serta keluhuranNya. Semua itu mengharuskan kita mencurahkan tenaga guna menuhankan dan menyembah Rabb Yang Mahasempurna, yang hanya bagiNya semua pujian, keluhuran, dan keindahan. 2. Mengetahui bahwa hanya Allah sendiri yang menciptakan dan mengatur, sehingga dengan demikian akan diketahui hanya Dia semata yang berhak disembah. 3. Mengetahui bahwa hanya Allah semata yang memberi nikmat, baik yang lahir maupun batin, baik nikmat Agama (akhirat) maupun dunia, karena hal itu mengharuskan kita untuk menggantungkan hati kita, mencintaiNya dan hanya menuhankanNya, yang tiada sekutu bagiNya. 4. Apa pun yang kita lihat dan dengar tentang pahala bagi para wali Allah yang menegakkan tauhid seperti pertolongan, nikmat yang disegerakan, hukuman bagi para musuh-musuhnya yang menyekutukan Allah, dan lainnya, karena semua itu akan mendorong kita untuk mengetahui bahwa hanya Allah semata yang berhak atas semua bentuk ibadah. 5. Mengetahui sifat-sifat berhala dan sekutu-sekutu yang disembah bersama Allah dan dijadikan sebagai sembahan-sembahan, di mana semua berhala dan sekutu itu kurang dari berbagai hal; dirinya sendiri tidak bisa berbuat apa-apa dan memerlukan pertolongan dari yang lain, tidak memiliki kuasa apa pun pada dirinya dan para penyembahnya, baik memberikan manfaat maupun mara bahaya, tidak memiliki kuasa atas kematian, kehidupan dan pembangkitan. Mereka tidak bisa memberikan pertolongan kepada para penyembahnya dan sama sekali tidak bisa memberi manfaat meski sekecil biji atom pun, baik memberikan kebaikan ataupun mencegah bahaya. Mengetahui hal ini mengharuskan kita untuk mengetahui bahwa tidak ada sembahan yang berhak disembah melainkan Allah semata, serta batilnya semua sesembahan selain Allah. 6. Sesuai dan sepakatnya kitab-kitab suci Allah atas hal itu. 7. Manusia-manusia khusus adalah makhluk yang paling sempurna dari segi akhlak, akal, pandangan, kebenaran, dan ilmu, mereka adalah para rasul, nabi, ulama Rabbani yang menyaksikan bahwa tidak ada sesembahan yang wajib disembah kecuali Allah. 8. Dalil-dalil penciptaan langit serta yang terdapat di dalamnya dan penciptaan jiwa (ufuqiyyah dan nafsiyyah) yang menunjukkan keesaan Allah merupakan dalil terbesar yang dengan Bahasa yang ada menyerukan apa pun yang disematkan Allah dalam penciptaan tersebut, mulai dari kelembutan ciptaanNya, kesempurnaan hikmahNya, dan keajaiban-keajaiban ciptaanNya. Itulah berbagai cara yang diserukan oleh Allah kepada para makhluknya secara berulang-ulang bahwa tidak ada sesembahan yang berhak disembah kecuali Allah semata. Cara-cara itu disebutkan Allah dalam kitabnya dan diulang-ulang. Ketika seseorang merenungkan sebagiannya, pasti akan muncul keyakinan dan ilmu tentang hal itu. Lantas bagaimana jika semua dalil-dalil tauhid dari berbagai hal terkumpul menjadi satu? Pada saat itulah keimanan seorang hamba akan semakin kokoh dan mengetahui secara yakin laksana kekokohan gunung yang tidak bisa digoncang oleh berbagai syubhat dan khayalan. Semakin banyak dan berulangnya kebatilan serta syubhat hanya akan semakin menumbuh-kembangkan serta menambah kesempurnaan iman. Demikianlah, jika engkau membaca dalil agung dan hal besar, yaitu merenungkan al-Quran yang agung serta merenungkan ayat-ayatnya. Itulah pintu terbesar untuk mengetahui tauhid yang bisa dipahami secara terperinci dan garis besar, di mana tidak akan didapatkan pada selain al-Quran. Firman Allah, “Dan mohonlah ampunan bagi dosamu,” yakni mintalah ampunan atas dosamu pada Allah dengan melakukan amalan yang bisa mendatangkan ampunan seperti bertaubat, berdoa agar diberi ampunan, melakukan berbagai kebaikan yang bisa melebur kesalahan dan dosa, meninggalkan dosa, dan memaafkan orang-orang yang bersalah. “Dan,” mintakan ampunan juga “bagi (dosa) orang-orang Mukmin, laki-laki dan perempuan,” karena iman mereka, baik lelaki maupun perempuan memiliki hak, dan di antara hak mereka adalah didoakan agar dosanya diampuni. Karena Rasulullah diperintahkan untuk mendoakan ampunan bagi orang-orang yang beriman yang mencakup penghapusan dosa serta hukuman dari mereka, maka diharuskan juga untuk memberikan nasihat pada mereka, membuat mereka senang terhadap kebaikan seperti halnya dirinya sendiri cinta pada kebaikan, membuat mereka membenci keburukan, memerintahkan mereka pada sesuatu yang terdapat kebaikannya untuk mereka, melarang mereka dari apa-apa yang bisa membahayakan mereka, memaafkan keburukan serta aib mereka, berusaha untuk bersatu dengan mereka, agar hari mereka bisa saling menyatu sehingga rasa dengki yang bisa menyulut permusuhan dan perpecahan bisa lenyap dari hati mereka yang bisa memperbanyak dosa dan kemaksiatan. “Dan Allah mengetahui tempat kamu berusaha,” yakni, gerak-gerik kalian, pergi dan kedatangan kalian “dan tempat tinggalmu,” yakni, dimana kalian menetap. Allah mengetahui kalian, baik di kala bergerak maupun diam, sehingga akan memberikan balasan untuk kalian secara sempurna."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 19: Maka jika jelas bagimu wahai Nabi Allah apa yang telah Kami kabarkan akan kondisi orang-orang yang berbahagia dan yang menderita; Maka ketahuilah bahwa tidak ada yang disembah dengan benar kecuali hanya Allah, mintalah kepada Tuhanmu ampunan atas dosa-dosamu, dan mohonkan ampun bagi orang-orang yang beriman, ketahuilah bahwa Allah mengetahui setiap gerak-gerikmu yang engkau hidup siang dan malam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mengetahui mengharuskan untuk mengakui dengan hati dan mengenal makna (kandungan) yang dituntut untuk diketahui, dan menjadi sempurna adalah ketika mengerjakan konsekwensinya. Mengetahui keesaan Allah adalah fardhu ‘ain bagi setiap manusia. Di antara cara untuk mengetahui bahwa tidak ada Tuhan yang berhak disembah kecuali Allah adalah sebagai berikut: 1. Mentadabburi (memikirkan) nama-nama, sifat-sifat-Nya, dan perbuatan-Nya yang menunjukkan kesempurnaan-Nya, keagungan-Nya dan kebesaran-Nya. Hal itu menghendaki sseorang beribadah hanya kepada Allah Yang Mahasempurna, dimana semua pujian, kemuliaan, keagungan dan keindahan milik-Nya. 2. Mengetahui bahwa Dia yang sendiri menciptakan dan mengatur alam semesta, sehingga dari sini diketahui bahwa Dia yang satu-satunya berhak disembah. 3. Mengetahui bahwa Dia yang sendiri memberi nikmat baik yang tampak maupun yang tersembunyi, baik nikmat agama maupun nikmat dunia. Hal ini tentu akan membuat seseorang bergantung hati kepada-Nya dan mencintai-Nya serta beribadah kepada-Nya. 4. Kita telah melihat dan mendengar nikmat dan pertolongan yang Allah berikan kepada mereka yang mentauhidkan-Nya, serta hukuman-Nya kepada orang-orang yang menyekutukan-Nya. 5. Mengetahui sifat patung dan berhala yang disembah di samping Allah, ternyata ia penuh dengan kekurangan dari berbagai sisi, zatnya fakir, tidak berkuasa memberi manfaat terhadap dirinya dan para penyembahnya, tidak mampu menghidupkan dan mematikan serta tidak mampu menolong para penyembahnya. Hal ini pun sama menghasilkan pengetahuan bahwa tidak ada yang berhak disembah kecuali Allah ‘Azza wa Jalla. 6. Sepakatnya semua kitab samawi menyatakan, hanya Allah yang berhak disembah. 7. Manusia pilihan yang paling sempurna akal, akhlak, pandangan dan ilmunya, yaitu para nabi dan rasul serta para ulama bersaksi terhadap keesaan-Nya. 8. Dalil yang Allah tunjukkan di cakrawala dan pada diri manusia juga menunjukkan keesaan Allah. 9. Dll. Demikian pula dengan mentadabburi Al Qur’an dan memperhatikan ayat-ayatnya membantu sekali seseorang mengetahui tauhid, bahkan ia merupakan pintu terbesar untuk mengetahuinya. Yakni tetaplah kamu di atas pengetahuan itu, yakni bahwa tidak ada Tuhan yang berhak disembah selain Allah, karena hal itu akan bermanfaat pada hari Kiamat. Dikatakan demikian kepada Beliau, sedangkan Beliau seorang yang ma’shum adalah agar umat Beliau mengikuti Beliau, dan Beliau telah melakukan hal itu (beristighfar). Beliau shallallahu 'alaihi wa sallam bersabda, “Sesungguhnya aku meminta ampun kepada Allah dalam sehari seratus kali.” Firman-Nya, “Mohonlah ampunan atas dosamu.” Menurut Syaikh As Sa’diy, “Mintalah ampunan kepada Allah untuk dosamu, yaitu dengan mengerjakan sebab-sebab yang mendatangkan ampunan, seperti tobat, berdoa meminta ampunan, mengerjakan kebaikan, meninggalkan dosa dan memaafkan kesalahan. Ini adalah pemuliaan Beliau kepada mereka. Hal itu karena dengan sebab keimanan mereka, maka mereka memiliki hak atas orang mukmin baik laki-laki maupun wanita, di antara hak mereka adalah didoakan dan dimintakan ampunan untuk dosa mereka. Dalam perintah memintakan ampunan untuk mereka yang isinya mengandung penyingkiran dosa dan hukuman terhadap mereka terdaoat perintah untuk memberikan sikap nush-h (tulus) kepada mereka dan mencintai kebaikan diperoleh mereka serta tidak suka keburukan diperoleh mereka, memerintahkan mereka kepada hal yang baik untuk mereka dan melarang sesuatu yang membahayakan mereka, memaafkan kesalahan mereka, mendorong mereka bersatu dan menyingkirkan segala dendam yang dapat menimbulkan permusuhan dan pertengkaran, dimana hal itu dapat menambah dosa dan maksiat mereka. Dia mengetahui semua keadaanmu, dan tidak ada satu pun yang samar bagi-Nya. Oleh karena itu, berhati-hatilah jangan sampai mendurhakai-Nya. Ada pula yang mengartikan “tempat usahamu” yakni di dunia, dan “tempat tinggalmu” yakni di akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 19",
    "description": "Setelah Allah menjelaskan bahwa kesadaran tidak lagi berguna setelah berakhirnya kehidupan dunia, maka Allah menyuruh rasul-Nya agar teguh pendirian dan agar memohonkan ampunan untuk para pengikutnya. Maka ketahuilah, bahwa tidak ada tuhan (yang patut disembah) selain Allah dan mohonlah ampunan atas dosamu dan atas dosa orang-orang mukmin, laki-laki dan perempuan. Dan Allah mengetahui tempat usaha kamu mencari bermacam-macam keperluan hidupmu di dunia dan mengetahui tempat tinggalmu untuk beristirahat setelah engkau bekerja sepanjang hari. 20. Pada ayat-ayat yang lalu disebutkan sikap orang munafik, orang kafir dan orang beriman ketika mendengar ayat-ayat Al-Qur'an tentang akidah, seperti keimanan kepada kesesaan Allah, kebangkitan dan sebagainya. Pada ayat berikut disebutkan sikap mereka pada waktu mendengar ayat-ayat Allah tentang perintah berjihad di jalan Allah. Orang-orang beriman selalu menungu-nunggu perintah berjihad, bahkan mereka ingin perintah itu dinyatakan dengan tegas. Dan orang-orang yang beriman berkata, 'mengapa tidak ada suatu surah yang kandungannya berisi tentang perintah jihad yang diturunkan agar kami mengamalkan dan mengikuti perintahnya'' sedangkan bagi orang-orang munafik, bila diturunkan ayat yang mewajibkan mereka berjihad, mereka bersikap ingkar dan penuh rasa takut. Maka apabila ada suatu surah diturunkan yang jelas maksudnya dan di dalamnya tersebut perintah perang, engkau wahai nabi Muhammad, melihat orang-orang yang di dalam hatinya ada penyakit kemunafikan atau lemah imannya memandang kepadamu seperti pandangan orang yang pingsan sehingga matanya terbelalak karena takut mati menimpa mereka. Tetapi itu lebih pantas bagi mereka. (catatan : sebagian ulama memaknai 'fa awla lahum' dengan 'maka kecelakaanlah bagi mereka'. Ayat ini seakan-akan menyatakan orang yang demikian lebih baik mati daripada hidup tidak taat kepada perintah agama)."
  }
]