[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang membenarkan Allah, mengikuti syariatNya, membenarkan kitab yang Allah turunkan kepada Muhammad, dan ia adalah kebenaran yang tidak ada keraguan padanya dari Tuhan mereka, Allah memaafkan mereka, menutupi keburukan yang mereka kerjakan, tidak menghukum mereka karenanya dan memperbaiki kehidupan mereka di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Dan orang-orang yang beriman dan mengerjakan amal saleh serta beriman kepada apa yang diturunkan Allah kepada Rasul-Nya Muhammad -dan itu benar dari Rabb mereka-, Allah menghapuskan kesalahan-kesalahan mereka sehingga tidak membalas mereka karenanya dan memperbaiki urusan dunia dan Akhirat mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. وَءَامَنُوا۟ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ (serta beriman kepada apa yang diturunkan kepada Muhammad) Terdapat pendapat mengatakan bahwa ayat ini diturunkan untuk kaum Anshar. Dan pendapat lain mengatakan diturunkan untuk para Ahli Kitab yang telah beriman. Allah hanya menyebutkan keimanan kepada apa yang diturunkan kepada Nabi Muhammad –termasuk di dalamnya adalah keimanan dan amal shalih— karena ketinggian dan kemuliaan kedudukannya. وَهُوَ الْحَقُّ مِن رَّبِّهِمْ (dan itulah yang haq dari Tuhan mereka) Mereka beriman bahwa al-Qur’an itu benar dan merupakan kalamullah. كَفَّرَ عَنْهُمْ سَيِّـَٔاتِهِمْ(Allah menghapuskan kesalahan-kesalahan mereka) Yang telah mereka lakukan. Allah akan mengampuni kesalahan-kesalahan mereka itu karena keimanan dan amal shalih mereka. وَأَصْلَحَ بَالَهُمْ(dan memperbaiki keadaan mereka) Yakni memperbaiki keadaan dan urusannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Orang-orang yang beriman dan meyakini Allah serta rasul-Nya, kemudian melaksanakan perintah-perintah Allah. Meyakini kebenaran Alquran yang telah Allah turunkan kepada nabi Muhammad SAW - ini adalah bagian dari sikap khusus atas yang umum - Alquran adalah kebenaran yang teguh, tidak ada keraguan di dalamnya. Allah telah mengampuni dosa-dosa mereka, menganugerahi kehidupan yang baik, baik di dunia maupun dalam hal agama dengan taufik dan ridho-Nya. Baal bermakna keadaan/kondisi. Ibnu Abbas berkata, yang dimaksud mereka adalah kaum Anshar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang beriman, beramal shalih, dan beriman pada apa yang diturunkan kepada nabi Muhammad bahwa hal itu merupakan kebenaran dari Tuhan mereka, Allah menghapus} Allah menghapus dan menutupi {kesalahan-kesalahan mereka dan memperbaiki keadaan mereka} urusan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Sedangkan “orang-orang yang beriman,” terhadap apa yang diturunkan Allah kepada para RasulNya secara umum dan kepada Nabi Muhammad secara khusus, “dan mengerjakan amal-amal shalih,” dengan mengerjakan kewajiban-kewajiban terhadap hak-hak Allah dan hak-hak manusia, baik yang bersifat wajib maupun anjuran, “Allah menghapus kesalahan-kesalahan mereka,” yang kecil dan yang besar, dan ketika kesalahan-kesalahan mereka telah dihapus, mereka pun selamat dari azab dunia dan akhirat, “dan memperbaiki keadaan mereka.” Yakni, Allah akan memperbaiki agama, dunia, hati, dan perbuatan mereka serta memperbaiki pahala mereka dengan diperbanyak dan dibersihkan serta memperbaiki semua kondisi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 2: Allah mengabarkan bahwa mereka yang bersedekah karena Allah, beramal dengan amalan shalih dan bersaksi bahwa apa yang datang dari Muhammad ﷺ adalah kebenaran; Maka barangsiapa yang kondisinya demikian maka Allah hapuskan keburukan-keburukan dari mereka yang telah mereka kerjakan, dan Allah memperbaiki keadaan mereka; Dimana Allah memberikan petunjuk kepada amalan yang baik dan murni niat mereka dan tujuan-tujuan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengerjakan hak-hak Allah dan hak-hak hamba, baik yang wajib maupun yang sunat. Yang besar maupun yang kecil, dan jika kesalahan mereka telah dihapuskan, maka mereka akan selamat dari azab di dunia dan akhirat. Baik agama mereka, dunia mereka, hati mereka maupun amal mereka. Dia juga akan memperbaiki pahala mereka dengan mengembangkannya dan membersihkannya serta memperbaiki semua keadaan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 2",
    "description": "Setelah Allah menyebutkan balasan bagi orang-orang kafir, kemudian dilanjutkan dengan menerangkan pahala bagi orang-orang yang beriman. Dan orang-orang yang beriman kepada Allah dan rasul-Nya dan membuktikan imannya itu dengan mengerjakan kebajikan serta ber-iman pula kepada apa yang diturunkan kepada Muhammad yaitu kitab suci Al-Qur'an; dan mereka beriman pula kepada apa yang diturunkan kepada nabi Muhammad dan nabi-nabi sebelumnya. Itulah kebenaran dari tuhan mereka yang harus ditaati oleh manusia; Allah menghapus kesalahan-kesalahan mereka, dengan mengampuninya dan memperbaiki keadaan mereka dengan menganugerahkan pertolongan baik di dunia maupun di akhirat. 3. Kemudian Allah menyatakan sebab dihapusnya amal orang-orang kafir dan sebab diperbaikinya keadaan orang yang beriman. Allah berfirman, yang demikian itu, yakni balasan yang adil berupa ganjaran bagi orang-orang yang beriman dan siksaan bagi orang-orang kafir, karena sesungguhnya orang-orang kafir secara bersungguh-sungguh mengikuti yang batil dan sesat, baik dalam kepercayaan maupun amal-amal mereka, dan sesungguhnya orang-orang yang beriman mengikuti secara bersungguh-sungguh kebenaran yang diturunkan dari tuhan mereka. Demikianlah Allah membuat perumpamaan-perumpamaan bagi manusia, agar mereka mengambil pelajaran."
  }
]