[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Orang-orang yang beriman kepada Allah dan rasulNya berkata, “Mengapa tidak diturunkan satu surat dari Allah yang memerintahkan kami berjihad melawan orang-orang kafir?” maka apabila satu ayat yang muhkam penjelasannya dan hukum-hukumnya turun dengan membawa perintah jihad, kamu melihat orang-orang yang memendam keraguan dan kemunafikan dalam hati mereka kepada agama Allah, memandang kepadamu (wahai Nabi) dengan pandangan orang yang hendak pingsan karena takut mati. Maka yang lebih utama bagi orang-orang yang memendam kebimbangan dalam hati mereka, adalah menaati Allah dan mengucapkan kata-kata yang sejalan dengan syariatNya. Bila perang telah wajib, maka perintah Allah yang mewajibkannya telah datang, orang-orang munafik itu membencinya. Seandainya mereka membenarkan Allah dalam beriman dan beramal, niscaya itu lebih baik bagi mereka daripada maksiat dan menentang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Orang-orang yang beriman kepada Allah berkata dengan harapan Allah akan menurunkan kepada Rasul-Nya satu surah yang mengandung hukum perang, “Kenapa Allah tidak menurunkan surah yang menyebutkan tentang peperangan?” Jika Allah telah menurunkan surah yang muhkamah, yang tidak bisa dihapus, yang menyebutkan tentang peperangan, maka engkau -wahai Rasul- melihat orang-orang yang di dalam hatinya terdapat keraguan dari kalangan orang-orang munafik, melihat kepadamu dengan pandangan seperti orang yang pingsan karena besarnya rasa takut dan khawatir. Maka Allah pun memastikan bahwa siksa mereka sudah menghampiri mereka dikarenakan mereka lari dari peperangan dan takut terhadap peperangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20-21. Orang-orang beriman berkata kerena keinginan yang besar untuk menolong agama: “Mengapa Allah tidak menurunkan suatu surat yang menyebutkan hukum dan adab berjihad?” Namun ketika telah turun surat yang jelas hukum dan penjelasannya, dan disebutkan tentang jihad di dalamnya, kamu melihat orang-orang munafik mulai merasa ragu terhadap agama. Hai Rasulullah, mereka melihatmu dengan mata terbelalak seperti orang pingsan karena mereka takut akan mati di medan perang. Lebih baik mereka mentaati Allah dan Rasul-Nya dan berkata dengan perkataan baik dan benar yang menunjukkan keimanan yang kuat. Jika perkara telah serius dan perang telah diwajibkan, maka seandainya mereka benar-benar beriman dan beramal, maka itu lebih baik bagi mereka daripada menentang dan membangkang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20-21. وَيَقُولُ الَّذِينَ ءَامَنُوا۟ لَوْلَا نُزِّلَتْ سُورَةٌ ۖ (Dan orang-orang yang beriman berkata: “Mengapa tiada diturunkan suatu surat?”) Orang-orang beriman meminta Tuhan mereka agar Dia menurunkan kepada Rasulullah suatu surat yang memerintahkannya untuk memerangi orang-orang kafir, karena keinginan mereka yang besar untuk melakukan jihad dan meraih pahala besar yang disiapkan Allah bagi para mujahid. فَإِذَآ أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ(Maka apabila diturunkan suatu surat yang jelas maksudnya) Yakni surat yang berlaku hukumnya (tidak dinasakh). وَذُكِرَ فِيهَا الْقِتَالُ ۙ( dan disebutkan di dalamnya (perintah) perang) Yakni tentang kewajiban berjihad. Qatadah berkata: setiap surat yang menyebutkan perintah jihad adalah surat yang tetap berlaku hukumnya. Dan surat-surat al-Qur’an ini sangat berat bagi orang-orang munafik. رَأَيْتَ الَّذِينَ فِى قُلُوبِهِم مَّرَضٌ(kamu lihat orang-orang yang ada penyakit di dalam hatinya) Yakni terdapat keraguan dalam hati orang-orang munafik. يَنظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِىِّ عَلَيْهِ مِنَ الْمَوْتِ ۖ( memandang kepadamu seperti pandangan orang yang pingsan karena takut mati) Yakni mereka melihatmu seperti pandangan orang yang terbelalak matanya ketika sedang sekarat karena ketakutan mereka untuk berperang dan kecondongan mereka kepada orang-orang kafir. فَأَوْلَىٰ لَهُمْ. طَاعَةٌ وَقَوْلٌ مَّعْرُوفٌ ۚ( dan lebih baik bagi mereka untukTaat dan mengucapkan perkataan yang baik) Yakni ketaatan mereka kepada Rasulullah dan ucapan yang baik merupakan hal yang lebih baik bagi mereka. فَإِذَا عَزَمَ الْأَمْرُ (Apabila telah tetap perintah perang) Yakni jika peperangan telah pasti. فَلَوْ صَدَقُوا۟ اللهَ(jikalau mereka benar (imannya) terhadap Allah) Dalam memerangi orang-orang kafir dengan segenap kemampuan mereka. لَكَانَ خَيْرًا لَّهُمْ(niscaya yang demikian itu lebih baik bagi mereka) Daripada bermaksiat dan menyelisihi perintah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Orang-orang mukmin bertanya kepada Nabi: “Mengapa tidak diturunkan ayat yang memerintahkan berjihad? Apabila diturunkan ayat yang secara jelas memerintahkan berjihad, dan mengharuskan perang maka orang-orang munafik akan melihat kalian dengan penuh ketakutan akan kematian. Maksud orang munafik pada ayat ini, yaitu orang yang imannya hanya sedikit dan menyimpan keraguan terhadap agama di hatinya. Maka kebinasaan semakin dekat kepada mereka. Makna fa aula lahum dalam budaya Arab adalah ancaman (tahdid). Lau la bermakna pemberi motivasi untuk mendapatkan sesuatu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang beriman berkata,“Mengapa tidak} mengapa tidak {diturunkan suatu surah” Maka apabila diturunkan suatu surah yang jelas} yang jelas tidak ada penasakhan tentangnya {dan disebutkan} dan diwajibkan {di dalamnya (perintah) perang, kamu melihat orang-orang yang di dalam hatinya ada penyakit} keraguan dan kemunafikan {akan memandangmu dengan pandangan orang yang pingsan karena takut mati} yang pingsan karena takut mati {Maka itulah yang lebih pantas bagi mereka} maka kecelakaanlah dari Allah untuk mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Allah berfirman, “Dan berkata orang-orang yang beriman,” karena ingin disegerakannya berbagai perintah berat, “Mengapa tiada diturunkan suatu surat,” yakni ayat yang terdapat perintah perang, “maka apabila diturunkan suatu surat yang jelas maksudnya,” yakni yang harus dikerjakan, “ dan disebutkan di dalamnya (perintah) perang,” yang merupakan hal terberat bagi jiwa yang tidak akan bisa dilaksanakan oleh mereka yang memiliki lemah iman, dan karena itulah Allah berfirman, “kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati,” karena mereka tidak menyukai perang karena terasa berat bagi mereka. Ayat ini sama seperti yang disebutkan dalam firman Allah, “Tidakkah kamu perhatikan orang-orang yang dikatakan kepada mereka: “Tahanlah tanganmu (dari berperang), dirikanlah sembahyang dan tunaikanlah zakat!” Setelah diwajibkan kepada mereka berperang, tiba-tiba sebahagian dari mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih sangat dari itu takutnya.” -An-Nisa:77-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 20: 20-21. Allah menyebutkan bahwa orang-orang yang beriman kepada Allah dan mereka yang membenarkan Rasul-Nya ﷺ, mereka menginginkan untuk diperintah memerangi musuh, oleh karenanya mereka berkata : Tidakkah telah turun wahai Rasulullah ﷺ surat baru yang memerintahkan kami untuk berjihad melawan kafir. Adapun orang-orang munafik mereka memiliki sikap lain yang tidak memiliki permisalan yang disifatkan Allah pada ayat ini; Maka jika turun ayat yang berkenaan dengan jihad engkau akan melihat hati-hati mereka ragu akan agama Allah dan terdapat kemunafikan, mereka melihat jihad seolah-olah maut di hadapan mereka, mereka sangat takut untuk berperang. Maka seandainya benar mereka berihad melawan kafir, sungguh kebaikan bagi mereka di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Meminta perkara yang berat dengan terburu-buru. Yang dimaksud dengan surat di sini ialah surat yang berisi perintah untuk memerangi orang-orang kafir. Mereka ini adalah kaum munafik. Ayat ini seperti firman-Nya di ayat yang lain, “Tidakkah kamu perhatikan orang-orang yang dikatakan kepada mereka, \"Tahanlah tanganmu (dari berperang), dirikanlah shalat dan tunaikanlah zakat! Setelah diwajibkan kepada mereka berperang, tiba-tiba sebagian dari mereka (golongan munafik) takut kepada manusia (musuh), seperti takutnya kepada Allah, bahkan lebih dari itu takutnya. mereka berkata, \"Ya Tuhan kami, mengapa Engkau wajibkan berperang kepada kami? Mengapa tidak Engkau tangguhkan (kewajiban berperang) kepada Kami sampai kepada beberapa waktu lagi?\" Katakanlah, \"Kesenangan di dunia ini hanya sebentar dan akhirat itu lebih baik untuk orang-orang yang bertakwa, dan kamu tidak akan dianiaya sedikitpun.” (Terj. An Nisaa’: 77) Selanjutnya Allah Subhaanahu wa Ta'aala menyarankan sikap yang terbaik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 20",
    "description": "Pada ayat-ayat yang lalu disebutkan sikap orang munafik, orang kafir dan orang beriman ketika mendengar ayat-ayat Al-Qur'an tentang akidah, seperti keimanan kepada kesesaan Allah, kebangkitan dan sebagainya. Pada ayat berikut disebutkan sikap mereka pada waktu mendengar ayat-ayat Allah tentang perintah berjihad di jalan Allah. Orang-orang beriman selalu menungu-nunggu perintah berjihad, bahkan mereka ingin perintah itu dinyatakan dengan tegas. Dan orang-orang yang beriman berkata, 'mengapa tidak ada suatu surah yang kandungannya berisi tentang perintah jihad yang diturunkan agar kami mengamalkan dan mengikuti perintahnya'' sedangkan bagi orang-orang munafik, bila diturunkan ayat yang mewajibkan mereka berjihad, mereka bersikap ingkar dan penuh rasa takut. Maka apabila ada suatu surah diturunkan yang jelas maksudnya dan di dalamnya tersebut perintah perang, engkau wahai nabi Muhammad, melihat orang-orang yang di dalam hatinya ada penyakit kemunafikan atau lemah imannya memandang kepadamu seperti pandangan orang yang pingsan sehingga matanya terbelalak karena takut mati menimpa mereka. Tetapi itu lebih pantas bagi mereka. (catatan : sebagian ulama memaknai 'fa awla lahum' dengan 'maka kecelakaanlah bagi mereka'. Ayat ini seakan-akan menyatakan orang yang demikian lebih baik mati daripada hidup tidak taat kepada perintah agama). 21. Sesungguhnya yang lebih baik bagi orang yang beriman adalah taat kepada Allah dengan melaksanakan perintah-Nya dan bertutur kata yang baik sebagai bukti dari keimanan mereka. Sebab apabila perintah perang ditetapkan mereka tidak menyukainya. Padahal jika benar-benar beriman kepada Allah, pastilah mereka ikut berperang di jalan Allah, dan niscaya yang demikian itu lebih baik bagi mereka."
  }
]