[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "20-21. Orang-orang yang beriman kepada Allah dan rasulNya berkata, “Mengapa tidak diturunkan satu surat dari Allah yang memerintahkan kami berjihad melawan orang-orang kafir?” maka apabila satu ayat yang muhkam penjelasannya dan hukum-hukumnya turun dengan membawa perintah jihad, kamu melihat orang-orang yang memendam keraguan dan kemunafikan dalam hati mereka kepada agama Allah, memandang kepadamu (wahai Nabi) dengan pandangan orang yang hendak pingsan karena takut mati. Maka yang lebih utama bagi orang-orang yang memendam kebimbangan dalam hati mereka, adalah menaati Allah dan mengucapkan kata-kata yang sejalan dengan syariatNya. Bila perang telah wajib, maka perintah Allah yang mewajibkannya telah datang, orang-orang munafik itu membencinya. Seandainya mereka membenarkan Allah dalam beriman dan beramal, niscaya itu lebih baik bagi mereka daripada maksiat dan menentang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Mereka menaati perintah Allah dan mengucapkan perkataan baik yang tidak mengandung kemungkaran itu lebih baik bagi mereka. Maka jika peperangan telah diwajibkan atas mereka dan kesungguhan telah dibebankan (niscaya mereka tidak menyukainya). Seandainya mereka benar dalam keimanan mereka kepada Allah dan ketaatan mereka kepada-Nya, niscaya itu lebih baik bagi mereka daripada kemunafikan dan kemaksiatan terhadap perintah-perintah Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Ketaatan dalam melaksanakan perintah Allah dan rasul, juga perkataan yang baik serta mulia, yang menunjukkan kebaikan bagi mereka adalah lebih baik. Kata tha’at menjadi awal kalimat disebabkan kata itu adalah maushuf yang sifatnya tersirat, kalimat aslinya adalah tha’atun mukhlishatun: taat yang ikhlas. Apabila perintah dan keharusan itu benar-benar diturunkan, maka akan lebih baik jika iman mereka benar-benar teguh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketaatan dan tutur kata yang baik} itu lebih baik bagi mereka {Apabila perintah itu ditetapkan} perintah perang itu dikuatkan {Maka jika mereka benar (beriman) kepada Allah, niscaya yang demikian itu lebih baik bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Selanjutnya Allah mengajak mereka kepada apa yang lebih sesuai dengan kondisi mereka seraya berfirman, “dan lebih utama bagi mereka, taat dan mengucapkan perkataan yang baik.” Artinya, lebih baik mereka mengerjakan perintah yang ada, yang harus dikerjakan oleh mereka serta memusatkan perhatian mereka untuk melaksanakannya dan jangan terburu-buru mengharapkan sesuatu yang berat, supaya mereka merasa senang dengan keselamatan dan ampunan yang diberikan Allah. “Apabila telah tetap perintah,” yakni perintah serius dan mengharuskan, maka dalam kondisi seperti ini, “mereka benar (imannya) terhadap Allah,” dengan meminta pertolongan kepadaNya serta mencurahkan segenap tenaga untuk menunaikannya, “niscaya yang demikian itu lebih baik bagi mereka,” daripada kondisi sebelumnya karena beberapa hal, di antaranya adalah: pertama, seorang hamba yang kurang di berbagai halnya tidak memiliki kemampuan apa pun kecuali jika Allah memberinya pertolongan, karena itulah jangan meminta lebih dari perintah yang ada. Kedua, seorang hamba jika jiwanya bergantung pada sesuatu yang akan datang, maka amalnya akan lemah dan tidak mampu menunaikan tugasnya yang ada karena memikirkan tugas yang akan datang, sebab –dalam kaitannya dengan tugas yang ada- idealismenya telah berpindah pada yang lain di mana aktivitas seseorang itu mengikuti idealismenya. Sedangkan berkaitan dengan yang akan datang, tidaklah perintah datang melainkan idealismenya telah menurun dan lemah untuk mengerjakannya sehingga tidak bisa ditolong. Ketiga, orang yang banyak memiliki berbagai angan untuk masa mendatang, padahal malas untuk meengerjakan tugas yang ada sama seperti pemimpi yang bertekad untuk mengerjakan semua tugas yang akan di hadapi pada waktu yang akan datang, sehingga orang seperti ini patut dicela karena tidak mau menunaikan tugas yang dikiranya bisa ditunaikan. Sepatutnya seorang hamba mengonsentrasikan idealisme, pikiran dan kegiatannya untuk menghadapi tugas yang ada dan menunaikan tugasnya berdasarkan kemampuan. Kemudian setiap kali waktu tiba selalu dihadapi dengan semangat, idealisme tinggi yang terkonsentrasi dan tidak tercerai berai, disertai dengan meminta pertolongan para rabbNya dalam menghadapi semua itu. Dan orang seperti ini layak mendapatkan pertolongan di berbagai halnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 21: 20-21. Allah menyebutkan bahwa orang-orang yang beriman kepada Allah dan mereka yang membenarkan Rasul-Nya ﷺ, mereka menginginkan untuk diperintah memerangi musuh, oleh karenanya mereka berkata : Tidakkah telah turun wahai Rasulullah ﷺ surat baru yang memerintahkan kami untuk berjihad melawan kafir. Adapun orang-orang munafik mereka memiliki sikap lain yang tidak memiliki permisalan yang disifatkan Allah pada ayat ini; Maka jika turun ayat yang berkenaan dengan jihad engkau akan melihat hati-hati mereka ragu akan agama Allah dan terdapat kemunafikan, mereka melihat jihad seolah-olah maut di hadapan mereka, mereka sangat takut untuk berperang. Maka seandainya benar mereka berihad melawan kafir, sungguh kebaikan bagi mereka di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni yang patut bagi mereka adalah melaksanakan perintah pada saat itu dan mengerahkan kemampuan mereka untuknya serta tidak meminta disyariatkan hal yang masih berat bagi mereka dan agar mereka bergembira atas perlindungan Allah dan maaf-Nya. Dengan memohon pertolongan kepada-Nya dan mengerahkan kemampuan untuk menaati-Nya. Daripada keadaan mereka pertama tadi. Hal itu dikarenakan beberapa sebab, di antaranya: - Seorang hamba adalah lemah dari berbagai sisi dan tidak mempunyai kemampuan kecuali orang yang dibantu Allah. Oleh karena itu, janganlah ia meminta lebih dari itu. - Jika jiwa seseorang sudah terikat dengan masa mendatang, maka ia akan lemah beramal dengan amal hariannya dan amal untuk masa mendatang. Hal itu, karena perhatiannya pindah kepada yang lain, sedangkan amal tergantung pada perhatiannya, adapun masa mendatang, maka tidaklah datang kecuali setelah semangatnya menjadi lemah sehingga ia tidak terbantu. - Seorang hamba yang mengharapkan sesuatu di masa mendatang dengan keadaannya yang malas pada waktu itu, maka mirip dengan orang yang bersumpah yang sudah menetapkan dengan kemampuannya terhadap perkara di masa mendatang sehingga berpeluang besar ia tidak dapat meraihnya dan tidak dapat melakukan hal yang telah ditekadkannya. Oleh karena itu, hal yang patut dilakukan oleh seorang hamba adalah mengumpulkan cita-cita, pikiran dan semangatnya terhadap perkara pada saat itu dan mengerjakannya sesuai kesanggupan, lalu setiap kali datang waktu, ia menghadapinya dengan semangat dan cita-cita tinggi sambil meminta pertolongan kepada Tuhannya, maka orang ini layak memperoleh taufiq dalam semua urusannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 21",
    "description": "Sesungguhnya yang lebih baik bagi orang yang beriman adalah taat kepada Allah dengan melaksanakan perintah-Nya dan bertutur kata yang baik sebagai bukti dari keimanan mereka. Sebab apabila perintah perang ditetapkan mereka tidak menyukainya. Padahal jika benar-benar beriman kepada Allah, pastilah mereka ikut berperang di jalan Allah, dan niscaya yang demikian itu lebih baik bagi mereka. 22. Allah mengecam sifat orang munafik yang enggan melaksanakan perintah-Nya dalam bentuk pertanyaan yang disertai ancaman, maka apakah sekiranya kamu berkuasa, atau jika kamu berpaling dari iman, kamu akan berbuat kerusakan di bumi, menumpahkan darah, dan memutuskan hubungan kekeluargaan sehingga kamu saling membenci satu sama lain' ayat ini mencela kaum munafik yang selalu mengejar ke-senangan hidup di dunia. Seandainya orang munafik berkuasa pastilah mereka berbuat aniaya dengan menumpahkan darah, merampas harta dan memutuskan hubungan silaturahmi."
  }
]