[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila kalian berpaling dari kitab Allah dan Sunnah NabiNya, niscaya kalian akan berbuat kemaksiatan kepada Allah di muka bumi, lalu kalian kafir kepada Allah dan menumpahkan darah serta memutuskan hubungan Rahim kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan seringkali kondisi kalian apabila kalian berpaling dari keimanan terhadap Allah dan ketaatan kepada-Nya bahwa kalian membuat kerusakan di bumi dengan kekufuran dan kemaksiatan serta kalian memutuskan hubungan silaturahmi, sebagaimana kondisi kalian pada jaman jahiliyah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22-23. Jika kalian berpaling dari Islam, maka mungkin saja kalian akan kembali melakukan perbuatan jahiliyah dalam menumpahkan darah orang yang tidak boleh dibunuh, dan memutus tali silaturrahim. Orang-orang yang jauh dari kebenaran itu telah Allah jauhkan dari rahmat-Nya, sehingga Allah membuat mereka tuli dari mendengar kebenaran dan buta dari melihat jalan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. فَهَلْ عَسَيْتُمْ إِن تَوَلَّيْتُمْ أَن تُفْسِدُوا۟ فِى الْأَرْضِ وَتُقَطِّعُوٓا۟ أَرْحَامَكُمْ (Maka apakah kiranya jika kamu berkuasa kamu akan membuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan?) Yakni apakah jika kalian diberi kekuasaan untuk mengurusi urusan umat maka kalian akan berbuat kerusakan di bumi dengan saling memerangi di antara kalian dan menumpahkan darah serta memutus hubungan kekeluargaan? Pendapat lain mengatakan maknanya adalah apakah kiranya jika kalian berpaling dari ketaatan dan enggan untuk ikut berperang serta tidak mengindahkan hukum-hukumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Jika kalian diperintahkan untuk berperang dan memperjuangkan keyakinan kalian, dan kalian diberi kekuasaan maka kalian akan berbuat kerusakan, kedhaliman, fitnah, pertumpahan darah dan memutuskan hubungan persaudaraan dengan saudara-saudara kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah seandainya kalian berkuasa} jika kalian {berpaling} berpaling dari keimanan {kalian berbuat kerusakan di bumi dan memutuskan hubungan kekeluargaan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Selanjutnya Allah menyebutkan orang yang berpaling dari ketaatan terhadap Rabbnya, ia tidak bepaling menuju kebaikan melainkan menuju keburukan. Allah berfirman, “maka apakah kiranya jika kamu berkuasa kamu akan membuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan.” Artinya, terdapat dua hal; konsisten dalam menaati Allah serta menjalankan semua perintahNya dan disanalah terdapat kebaikan, petunjuk, dan keberuntungan, atau berpaling dari hal itu serta berpaling untuk tidak menaati Allah, maka tidak terdapat apap pun dalam hal ini melainkan kerusakan di muka bumi, karena mengerjakan berbagai kemaksiatan dan memutuskan tali kekeluargaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 22: Kemudian Allah menujukan perkataan-Nya kepada orang-orang kafir dengan celaan kepada mereka, Allah berkata : Apakah kalian buta dengan penolakan kalian akan perintah Allah, kalian meninggalkan perintah tersebut dan tidak mengerjakannya; Sungguh kalian rusak hidup di bumi dengan kesyirikan, dzalim, dan menumpahkan darah serta memutus tali silaturahmi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang yang berpaling dari ketaatan Tuhannya, bahwa keadaannya bukan kepada kebaikan tetapi kepada keburukan. Yakni kembali mengerjakan perbuatan orang-orang jahiliyyah. Keadaannya ada dua macam; bisa tetap di atas ketaatan kepada Allah dan mengerjakan perintah-Nya sehingga ia memperoleh kebaikan, petunjuk dan keberuntungan, atau malah berpaling dari ketaatan kepada Allah sehingga yang terjadi adalah mengadakan kerusakan di bumi dengan mengerjakan maksiat serta memutuskan tali silaturrahim."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 22",
    "description": "Allah mengecam sifat orang munafik yang enggan melaksanakan perintah-Nya dalam bentuk pertanyaan yang disertai ancaman, maka apakah sekiranya kamu berkuasa, atau jika kamu berpaling dari iman, kamu akan berbuat kerusakan di bumi, menumpahkan darah, dan memutuskan hubungan kekeluargaan sehingga kamu saling membenci satu sama lain' ayat ini mencela kaum munafik yang selalu mengejar ke-senangan hidup di dunia. Seandainya orang munafik berkuasa pastilah mereka berbuat aniaya dengan menumpahkan darah, merampas harta dan memutuskan hubungan silaturahmi. 23. Orang-orang munafik yang bersikap seperti yang disebutkan di atas, mereka itulah orang-orang yang dikutuk Allah. Mereka telah dijauhkan dari rahmat dan kasih sayang Allah, lalu dibuat tuli pendengarannya sehingga tidak dapat mengambil pelajaran dari apa yang mereka dengar, dan dibutakan penglihatannya sehingga tidak dapat mengambil manfaat dari apa yang mereka saksikan."
  }
]