[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mengapa orang-orang munafik itu tidak merenungkan nasihat-nasihat al-Quran dan hujjah-hujjahNya? Hati mereka terkunci rapat sehingga makna al-Quran sedikit pun tidak sampai kepadanya. Mereka tidak merenungkan nasihat Allah dan memahaminya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka kenapa orang-orang yang berpaling itu tidak memperhatikan Al-Qur`ān dan menelaah apa yang ada di dalamnya, kalau seandainya mereka memperhatikannya niscaya Al-Qur`ān itu akan menunjukkan kepada mereka segala kebaikan dan menjauhkan mereka dari segala keburukan, ataukah di hati mereka ada gembok-gembok yang telah memastikan tertutupnya hati sehingga nasihat tidak sampai kepadanya dan peringatan tidak bermanfaat baginya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Allah mengolok orang-orang munafik dan semua orang yang berpaling dari al-Qur’an: “Tidakkah mereka berusaha memahami al-Qur’an, agar mereka memahami hukum-hukum dan pelajaran yang ada di dalamnya. Namun hati mereka memang keras dan tertutup sehingga tidak mendapat manfaat dari al-Qur’an.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. أَفَلَا يَتَدَبَّرُونَ الْقُرْءَانَ (Maka apakah mereka tidak memperhatikan Al Quran) Sehingga mereka dapat menjalankan peringatan keras dan bukti yang jelas yang ada di dalamnya. أَمْ عَلَىٰ قُلُوبٍ أَقْفَالُهَآ(ataukah hati mereka terkunci?) Yakni apakah di hati mereka terdapat kunci-kunci yang menghalangi, sehingga mereka tidak dapat memahami dan memikirkan serta tidak dapat terbuka bagi kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Apakah mereka tidak menelaah Alquran untuk mengambil pelajaran? Namun hati mereka telah tertutup, sehingga mereka tidak faham dan tidak beriman kepada Alquran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah mereka tidak merenungi Al-Qur’an ataukah} bahkan {hati mereka sudah terkunci"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Artinya, apakah mereka yang berpaling dari Kitab Allah itu tidak mau mencerna KItab Allah tersebut serta merenungkannya dengan sebenar-benarnya? Andai mereka mau merenungkannya, tentu al-Quran akan menunjukkan mereka pada semua kebaikan dan mengingatkan mereka dari semua keburukan serta tentu hati mereka akan dipenuhi keimanan dan keyakinan, menyampaikan mereka pada harapan tertinggi serta karunia yang paling mahal, akan menunjukkan kepada mereka jalan yang mengantarkan mereka kepada Allah, surga Allah serta menunjukkan mereka hal-hal yang dapat menyempurnakannya, dan sebaliknya hal-hal yang dapat merusaknya, menjelaskan kepada mereka jalan yang bisa menyampaikan ke neraka dan akan diingatkan dari segala sesuatu yang harus diwaspadai. Dengan merenungkan al-Quran, mereka akan mengenal Rabb mereka, nama-nama, sifat-sifat serta kebaikan Allah, tentu mereka akan diberi rasa rindu untuk mendapatkan pahala yang agung serta menanamkan rasa takut dari siksaan yang menghinakan dalam diri mereka. “Ataukah hati mereka terkinci,” artinya, hati mereka telah terkunci karena karena mereka berpaling, lalai dan menentang al-Quran, sampai hati mereka dikunci sehingga tidak bisa masuk selama-lamanya? Dan inilah realitanya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 24: Allah memerintahkan untuk mentadabburi ayat Al Qur’an dan memahaminya dan melarang dari ingkar kepada ayat Al Qur’an, Allah berkata : Apakah mereka tidak mentadabburi Al Qur’an, dan menjadikan akalnya serta pikiran-pikirannya berpikir atasnya ?! Akan tetapi hati-hati mereka terkunci, sehingga mereka tidak paham dan berpikir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah mereka yang berpaling itu tidak mentadabburi Al Qur’an dan memperhatikannya dengan sebaik-baiknya, dimana jika mereka memperhatikannya sebaik-baiknya tentu ia (Al Qur’an) akan menunjukkkan mereka kepada semua kebaikan dan menjauhkan mereka dari keburukan serta memenuhi hati mereka dengan iman dan keyakinan, menyampaikan mereka kepada tuntutan yang tinggi, serta memberikan hadiah yang mahal, menerangkan kepada mereka jalan kepada Allah dan kepada surga-Nya. Demikian pula mengenalkan mereka kepada Tuhan mereka, nama-nama-Nya, sifat-Nya, dan ihsan-Nya serta akan membuat mereka rindu kepada pahala yang besar dan membuat mereka takut kepada azab yang buruk. Demikian pula dengan Al Qur’an, mereka dapat mengetahui yang hak (kebenaran). Oleh keburukan sehingga tidak bisa dimasuki kebaikan, dan tidak dapat memahaminya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 24",
    "description": "Pada ayat yang lalu Allah mengecam orang munafik yang selalu membuat kerusakan di muka bumi dan memutuskan hubungan silaturrahmi. Kecaman itu mash dilanjutkan pada ayat ini, Allah melanjutkan kecamannya dengan menyatakan, maka tidakkah mereka, orang-orang munafik itu, menghayati Al-Qur'an, yakni tidak merenungkan atau memikirkan Al-Qur'an' ataukah hati mereka sudah terkunci sehingga tidak dapat memahami petunjuknya' pertanyaan yang mengandung kecam-an itu menegaskan bahwa orang munafik itu tidak mau memperhatikan petunjuk Al-Qur'an, atau tidak memahaminya, karena hati me-reka telah terkunci. 25. Dalam ayat ini dijelaskan bahwa orang-orang yang kembali kafir setelah nyata bagi mereka adalah orang yang termakan dan terpe-ngaruh oleh tipu daya setan. Sesungguhnya orang-orang yang berbalik kepada kekafiran, setelah petunjuk itu yang disampaikan Allah melalui rasul-Nya jelas bagi mereka, maka setanlah yang merayu mereka untuk berbuat dosa dan memanjangkan angan-angan mereka. Mereka terbuai oleh angan-angan palsu, sesuai dengan dorongan hawa nafsu, sehinggga terasa indah keburukan yang mereka lakukan."
  }
]