[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang murtad dari hidayah dan iman, kembali kepada kekafiran sesudah kebenaran itu jelas bagi mereka, setanlah yang menghiasi kesalahan-kesalahan mereka dan memanjangkan angan-angan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Sesungguhnya orang-orang yang berpaling dari keimanan mereka kepada kekufuran dan kemunafikan, setelah tegaknya hujah atas mereka dan jelas bagi mereka kebenaran Nabi -ṣallallāhu 'alaihi wa sallam-, setan lah yang menjadikan mereka memandang baik kekufuran dan kemunafikan dan memberi mereka angan-angan yang panjang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25-28. Allah mengolok orang-orang yang murtad dari agama Islam dan kembali kepada kekafiran setelah mereka mengetahui jalan petunjuk. Setelah telah menghiasi jalan kesesatan bagi mereka dan menggoda mereka dengan angan-angan yang menipu. Itulah keburukan besar akibat ucapan mereka kepada orang-orang Yahudi dan Nasrani -yang membenci wahyu yang Allah turunkan kepada Nabi Muhammad-: “Kami akan mentaati kalian dalam beberapa perkara, seperti untuk tidak ikut berjihad memerangi kalian.” Namun Allah mengetahui tipu daya tersembunyi yang mereka buat. Bagaimana keadaan mereka jika para malaikat mencabut nyawa mereka dengan memukul wajah dan punggung mereka dengan cemeti dari besi? Itulah azab berat kerena mereka menganut kekafiran dan kemunafikan yang Allah murkai, dan karena kebencian mereka terhadap amal shalih yang Allah cintai, sehingga Allah membuat amal perbuatan mereka sia-sia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. إِنَّ الَّذِينَ ارْتَدُّوا۟ عَلَىٰٓ أَدْبٰرِهِم (Sesungguhnya orang-orang yang kembali ke belakang) Yakni mereka kembali menjadi orang-orang kafir sebagaimana sebelumnya. مِّنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَى ۙ( sesudah petunjuk itu jelas bagi mereka) Berupa mukjizat dan bukti yang jelas yang dibawa Rasulullah dan yang mereka imani sebelumnya. الشَّيْطٰنُ سَوَّلَ لَهُمْ(syaitan telah menjadikan mereka mudah (berbuat dosa)) Yakni setan menghiasi kesalahan-kesalahan mereka, dan memudahkan mereka untuk terjerumus di dalamnya. وَأَمْلَىٰ لَهُمْ(dan memanjangkan angan-angan mereka) Yakni setan meninggikan amal mereka dan menjanjikan kepada mereka umur yang panjang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Sesungguhnya, orang-orang yang kembali kepada kekafiran, justru setelah mendapat petunjuk iman yang jelas, mereka adalah orang munafik. Mereka mengingkari jalan kebenaran yang telah jelas bagi mereka. Setan telah membuat mereka mudah melakukan dosa dan memanjakan mereka dengan angan-angan kosong yang keliru"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang berbalik kebelakang} memisahkan diri dari keimanan dan kembali kepada kekufuran {setelah petunjuk itu jelas bagi mereka, setan menggoda mereka} menghiasi bagi mereka kekufuran dan murtad dari agama {dan memanjangkan angan-angan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Allah mengabarkan tentang kondisi orang-orang murtad dari petunjuk dan iman dan mundur ke belakang menuju kesesatan dan kekufuran bukan berdasarkan suatu dalil yang menunjukkan mereka dan juga tanpa penjelasan yang nyata, namun kemurtadan mereka itu karena ajakan musuh mereka (setan), kebatilan yang dihiasi oleh setan, sehingga terlihat baik bagi mereka serta dikte yang dilakukan setan kepada mereka. “Syaitan itu memberikan janji-janji kepada mereka dan membangkitkan angan-angan kosong pada mereka, padahal syaitan itu tidak menjanjikan kepada mereka selain dari tipuan belaka.” –An Nisa:120-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 25: Ketahuilah bahwa mereka yang murtad setelah islam dan kembali kufur setelah jelas kebenaran atasnya; Mereka telah dihiasi oleh setan akan kemurtadan mereka, dan angan-angan mereka panjang dan mereka berangan-angan berumur panjang. Mereka yang murtad tidak membuat Allah rugi dan Allah akan menghapuskan amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang keadaan orang yang murtad dari petunjuk dan iman kepada kesesatan dan kekafiran. Hal itu terjadi bukanlah karena ada dalil yang mengalihkan mereka darinya, akan tetapi karena hiasan dan rayuan musuh mereka, yaitu setan serta pemanjangan angan-angan darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 25",
    "description": "Dalam ayat ini dijelaskan bahwa orang-orang yang kembali kafir setelah nyata bagi mereka adalah orang yang termakan dan terpe-ngaruh oleh tipu daya setan. Sesungguhnya orang-orang yang berbalik kepada kekafiran, setelah petunjuk itu yang disampaikan Allah melalui rasul-Nya jelas bagi mereka, maka setanlah yang merayu mereka untuk berbuat dosa dan memanjangkan angan-angan mereka. Mereka terbuai oleh angan-angan palsu, sesuai dengan dorongan hawa nafsu, sehinggga terasa indah keburukan yang mereka lakukan. 26. Orang-orang munafik kembali kepada kekafiran, padahal tadi-Nya mereka kelihatan telah beriman, karena memihak dan bersekutu dengan orang-orang yahudi untuk memerangi orang yang beriman. Kaum munafik menyatakan bahwa mereka akan turut berperang di pihak orang-orang yahudi dari suku bani na'ir dan bani qurai'ah menghadapi kaum muslim, sekiranya orang yahudi diusir dari madinah. Yang demikian itu, yakni kesesatan dan kemurtadan itu, karena sesungguhnya mereka telah mengatakan kepada orang-orang yang tidak senang kepada apa yang diturukan Allah, yakni orang yahudi dari suku bani nadzir dan bani quraidzah atau kaum musyrik mekah yang mempunyai hubungan dengan musuh-Musuh islam di madinah, 'kami akan mematuhi kamu dalam beberapa urusan, antara lain tidak ikut berperang sebagaimana yang dianjurkan nabi Muhammad. ' tetapi Allah mengetahui rahasia mereka dan tipu daya yang mereka sembunyikan."
  }
]