[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pembiaran terhadap mereka sehingga mereka masuk kedalam kekafiran adalah disebabkan mereka berkata kepada orang-orang Yahudi yang membenci apa yang Allah turunkan, “Kami akan mematuhi kalian pada sebagian urusan yang menyelisihi hukum Allah dan rasulNya.” Allah mengetahui apa yang mereka simpan dan sembunyikan. Hendaknya seorang muslim waspada untuk taat kepada selain Allah pada apa yang bertentangan dengan ketetapan Allah dan ketetapan RasulNya, Muhammad."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Penyesatan yang terjadi pada mereka itu disebabkan karena mereka berkata secara sembunyi-sembunyi kepada orang-orang musyrik yang benci terhadap wahyu yang diturunkan kepada Rasul-Nya, “Kami akan menaati kalian dalam beberapa hal seperti keengganan untuk berperang.” Dan Allah mengetahui apa yang mereka sembunyikan dan apa yang mereka tampakkan, tidak ada sesuatupun yang tersembunyi dari-Nya, lalu Dia menunjukkan yang dikehendaki-Nya kepada Rasul-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. ذٰلِكَ بِأَنَّهُمْ قَالُوا۟ لِلَّذِينَ كَرِهُوا۟ مَا نَزَّلَ اللهُ (Yang demikian itu karena sesungguhnya mereka (orang-orang munafik) itu berkata kepada orang-orang yang benci kepada apa yang diturunkan Allah) Yakni karena orang-orang munafik yang kembali murtad berkata kepada orang-orang yang benci terhadap apa yang diturunkan Allah, yaitu orang-orang musyrik atau Yahudi. سَنُطِيعُكُمْ فِى بَعْضِ الْأَمْرِ ۖ( “Kami akan mematuhi kamu dalam beberapa urusan”) Sebagian urusan yang dimaksud adalah dalam memusuhi Rasulullah dan menyelisihi apa yang dibawanya. وَاللهُ يَعْلَمُ إِسْرَارَهُمْ (sedang Allah mengetahui rahasia mereka) Yakni rencana buruk yang mereka buat secara sembunyi-sembunyi dengan para musuh Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Kesesatan itu akibat dari perkataan orang munafik kepada orang musyrik dan Yahudi, padahal mereka tahu bahwa orang musyrik dan Yahudi membenci Alquran: “Kami akan mengikuti kalian pada beberapa perintah kalian. Diantaranya adalah membantu kalian dalam memerangi musuh dan memusuhi Muhammad yang terus menyeru kepada Islam. Allah Maha Tahu atas kelicikan kalian dibalik perkataan ini, atau apa yang kalian sembunyikan.Allah akan membuka rahasia itu, Dia Maha Tahu yang tampak maupun yang tersembunyi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan memanjangkan angan-angan dan harapan mereka {Yang demikian itu karena sesungguhnya mereka telah berkata kepada orang-orang yang tidak senang pada apa yang diturunkan Allah} kepada orang-orang musyrik yang benci terhadap turunnya Al-Qur’an kepada nabi Muhammad SAW {“Kami akan mematuhi kalian dalam beberapa urusan” Dan Allah mengetahui rahasia mereka} apa yang mereka rahasiakan dan sembunyikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Yang demikian itu,” adalah karena telah jelas petunjuk pada mereka namun mereka tidak mau menerima tapi menolaknya, dan mereka (orang-orang munafik) itu “berkata kepada orang-orang yang benci kepada apa yang diturunkan Allah,” dari orang-orang yang menampakkan permusuhan kepada Allah dan RasulNya, “Kami akan mematuhi kamu dalam beberapa urusan,” yakni orang-orang yang memiliki keinginan sama dengan mereka. Karena itulah Allah menyiksa mereka dengan kesesatan dan menempatkan mereka tetap pada jalur yang akan menyampaikan mereka pada kesengsaraan dan siksa abadi, “dan Allah mengetahui rahasia mereka,” dank arena itulah Allah membuka kedok mereka serta dijelaskan pada hamba-hambaNya yang beriman agar tidak tertipu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 26: Allah menjelaskan sebab dari kemurtadan mereka yang bahwasanya mereka berkata kepada manusia yang membenci Al Qur’an dan islam dari golongan yahudi dan munafik, mereka berkata : Kami akan mentaati kalian dan akan saling tolong menolong bersama kalian dalam memusuhi Rasul ﷺ, dan menyelisihi apa yang datang darinya. Allah kemudian menampakkan apa yang mereka katakan dan apa yang mereka sembunyikan dan pembicaraan rahasia meeka dan juga apa yang mereka perintahkan dalam senyap; Dengan ini semua, Allah singkap mereka, dan Allah jelaskan urusan mereka kepada orang-orang yang beriman agar tidak tertipu oleh mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penyesatan oleh setan itu, karena telah jelas petunjuk bagi mereka, namun mereka membenci dan menolaknya. Yaitu mereka yang terang-terangan memusuhi Allah dan Rasul-Nya. Mereka itu adalah orang-orang Yahudi. Yaitu dengan membantu memusuhi Nabi shallallahu 'alaihi wa sallam dan melemahkan semangat kaum muslimin dari berjihad. Bisa juga maksud, “Kami akan mematuhi kamu dalam beberapa urusan,” adalah kami akan mematuhi kamu dalam sebagian urusan yang sesuai dengan hawa nafsu kami. Oleh karena itu, Allah Subhaanahu wa Ta'aala menghukum mereka dengan kesesatan serta tetap berada di atas sesuatu yang membawa mereka kepada kesengsaraan dan azab. Mereka mengatakan kata-kata itu secara rahasia, namun Allah Subhaanahu wa Ta'aala menampakkannya. Oleh karena itu, Dia membuka aib mereka dan menerangkan kepada hamba-hamba-Nya yang mukmin agar mereka tidak tertipu dengannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 26",
    "description": "Orang-orang munafik kembali kepada kekafiran, padahal tadi-Nya mereka kelihatan telah beriman, karena memihak dan bersekutu dengan orang-orang yahudi untuk memerangi orang yang beriman. Kaum munafik menyatakan bahwa mereka akan turut berperang di pihak orang-orang yahudi dari suku bani na'ir dan bani qurai'ah menghadapi kaum muslim, sekiranya orang yahudi diusir dari madinah. Yang demikian itu, yakni kesesatan dan kemurtadan itu, karena sesungguhnya mereka telah mengatakan kepada orang-orang yang tidak senang kepada apa yang diturukan Allah, yakni orang yahudi dari suku bani nadzir dan bani quraidzah atau kaum musyrik mekah yang mempunyai hubungan dengan musuh-Musuh islam di madinah, 'kami akan mematuhi kamu dalam beberapa urusan, antara lain tidak ikut berperang sebagaimana yang dianjurkan nabi Muhammad. ' tetapi Allah mengetahui rahasia mereka dan tipu daya yang mereka sembunyikan. 27. Ayat ini masih berbicara tentang kaum munafik. Mereka hanya dapat melakukan kemunafikan dan tipu daya selagi mereka masih hidup. Ayat ini menjelaskan bagaimana keadaan mereka pada waktu kematian mendekati mereka. Maka bagaimana nasib dan keadaan mereka apabila malaikat maut datang untuk mencabut nyawa mereka dengan cara yang buruk dan mengerikan' pada saat nyawa dicabut para malaikat itu mengeluarkan ruh mereka dengan kasar dan terus menerus memukul wajah dan punggung mereka sebagai penghinaan' keadaan orang munafik itu sangat terhina dan sengsara dalam menghadapi kematian."
  }
]