[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana keadaan mereka saat para malaikat mencabut ruh mereka dan para malaikat itu memukuli wajah-wajah dan punggung-punggung mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Bagaimana engkau lihat siksa yang mereka rasakan dan kondisi mengenaskan yang menimpa mereka jika nyawa mereka dicabut oleh malaikat yang ditugaskan untuk mencabut nyawa mereka sambil memukul wajah mereka punggung mereka dengan cambuk-cambuk besi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. فَكَيْفَ إِذَا تَوَفَّتْهُمُ الْمَلٰٓئِكَةُ (Bagaimanakah (keadaan mereka) apabila malaikat mencabut nyawa mereka) Yakni bagaimana pengetahuan-Nya tentang rahasia mereka jika malaikat telah mencabut nyawa mereka. Pendapat lain mengatakan maknanya adalah apa yang dapat mereka perbuat ketika malaikat telah mencabut nyawa mereka. يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبٰرَهُمْ (seraya memukul-mukul muka mereka dan punggung mereka?) Yakni jika azab ditangguhkan bagi mereka maka keadaan mereka kelak akan seperti itu. Pendapat lain mengatakan bahwa hal ini ketika peperangan terjadi, dan para malaikat memberi pertolongan bagi Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Bagaimana jadinya keadaan mereka ketika malaikat mencabut nyawa mereka. Malaikat memukul-mukul muka dan punggung mereka dengan penjepit dari besi. Sehingga ruh mereka keluar dengan pedih dan keras."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka bagaimana} keadaan mereka {apabila malaikat mewafatkan mereka serta memukul wajah dan punggung mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “Bagaimanakah ,” engkau melihat kondisi mereka yang buruk serta pemandangan mereka yang mengerikan, “Apabila malaikat (maut) mencabut nyawa mereka,” yakni para malaikat yang ditugaskan untuk mencabut nyawa mereka, “seraya memukul muka dan punggung mereka,” dengan alat pemukul secara keras."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 27: Allah mengabarkan keadaan orang-orang kafir yang buruk ketika mereka meninggal dan malaikat datang di sisi mereka, para malaikat memukul wajah-wajah mereka dan punggung mereka alat pemukul yang terbuat dari besi ?!!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu dengan cambuk-cambuk dari besi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 27",
    "description": "Ayat ini masih berbicara tentang kaum munafik. Mereka hanya dapat melakukan kemunafikan dan tipu daya selagi mereka masih hidup. Ayat ini menjelaskan bagaimana keadaan mereka pada waktu kematian mendekati mereka. Maka bagaimana nasib dan keadaan mereka apabila malaikat maut datang untuk mencabut nyawa mereka dengan cara yang buruk dan mengerikan' pada saat nyawa dicabut para malaikat itu mengeluarkan ruh mereka dengan kasar dan terus menerus memukul wajah dan punggung mereka sebagai penghinaan' keadaan orang munafik itu sangat terhina dan sengsara dalam menghadapi kematian. 28. Mereka yang mengalami keadaan yang demikian itu, yakni kematian yang mengerikan, karena sesungguhnya mereka mengikuti apa yang me-nimbulkan kemurkaan Allah, seperti kemunafikan dan berbuat maksiat dan membenci apa yang menimbul'kan keridaan-Nya seperti ketulusan dalam beriman dan bersungguh-sungguh melaksanakan perintahnya, sebab itu Allah menghapus segala amal mereka. Ayat ini menyatakan bahwa kematian yang mengerikan akan menimpa kita, apabila kita sering mengerjakan maksiat, dan tidak mau mengerjakan perbuatan yang diridai-Nya."
  }
]