[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Azab yang berhak mereka rasakan dan mereka dapatkan itu adalah disebabkan mereka mengikuti apa yang membuat Allah murka, yaitu menaati setan, dan mereka membenci apa yang membuat Allah ridha, yaitu amal shalih yang diantaranya adalah berperang melawan orang-orang kafir sesudah Allah mewajibkannya atas mereka,. Allah membatalkan pahala amal mereka berupa sedekah, silaturahim, dan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Siksa pedih yang menimpa mereka ketika nyawa mereka dicabut itu karena mereka mengikuti segala apa yang menjadikan Allah murka kepada mereka berupa kekufuran, kemunafikan dan permusuhan mereka kepada Allah dan Rasul-Nya, dan mereka membenci apa yang bisa mendekatkan mereka kepada Rabb mereka dan mendapatkan rida-Nya berupa keimanan kepada Allah dan mengikuti Rasul-Nya, sehingga Allah membatalkan amal perbuatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. ذٰلِكَ (Yang demikian itu) Yakni kematian dengan keadaan seperti itu. بِأَنَّهُمُ اتَّبَعُوا۟ مَآ أَسْخَطَ اللهَ(karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah) Yakni disebabkan mereka mengikuti apa yang dimurkai Allah seperti kekafiran, kemaksiatan, dan membuat rencana jahat bersama musuh-musuh Allah dalam melawan Rasulullah dan para sahabatnya. وَكَرِهُوا۟ رِضْوٰنَهُۥ(dan karena mereka membenci keridhaan-Nya) Yakni mereka membenci apa yang diridhai Allah seperti keimanan, tauhid, dan ketaatan. فَأَحْبَطَ(sebab itu Allah menghapus) Yakni Allah melenyapkan. أَعْمٰلَهُمْ ((pahala) amal-amal mereka) Karena sebab tersebut, yaitu amal kebaikan yang telah mereka lakukan sebelum murtad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Semua itu adalah akibat perbuatan mereka melakukan hal-hal yang mendatangkan murka Allah, seperti kekafiran dan maksiat. Mereka membenci amal perbuatan yang mengarah kepada keridhoan dan ketaatan kepada Allah Maka dari itu Allah menolak amal mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang demikian itu karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan membenci keridhaanNya. Maka Dia menghapus amal-amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. “Yang demikian itu,” adalah azab yang mereka dapatkan disebabkan “karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah,” seperti kekufuran, kefasikan, dan pembangkangan, “dan (karena) mereka membenci (apa yang menimbulkan) keridhaanNya,” sehingga mereka tidak memiliki kesenangan yang bisa mendekatkan mereka kepadanya. “Sebab itu Allah menghapus (pahala) amal-amal mereka,” yaitu menghapuskan dan melenyapkan amal-amal mereka. Tidak seperti halnya orang-orang yang mengikuti apa pun yang mendatangkan keridhaan Allah serta membenci segala sesuatu yang bisa menimbulkan kemurkaanNya, orang seperti ini akan dihapus kesalahan-kesalahannya oleh Allah dan pahalanya akan dilipatgandakan oleh Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 28: Allah menjelaskan bahwa adzab ini yang menimpa mereka, dan siksaan yang menimpa mereka, karena sebab mereka mengikuti dan beramal dengan apa yang Allah murkai dan yang Allah tolak dari ucapan, amalan mereka serta meninggalkan dan membenci apa yang Allah cintai dan ridhai dari ucapan dan amalan yang di antaranya jihad di jalan Allah; Sehingga Allah hapuskan amalan-amalan mereka, dan membatalkan pahala bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni azab yang mereka peroleh itu. Seperti kekafiran, kefasikan dan kemaksiatan. Berbeda dengan orang yang mengikuti apa yang menimbulkan keridhaan-Nya dan membenci apa yang menimbulkan kemurkaan-Nya, maka orang tersebut akan dihapuskan kesalahannya, dilipatgandakan balasan dan pahalanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 28",
    "description": "Mereka yang mengalami keadaan yang demikian itu, yakni kematian yang mengerikan, karena sesungguhnya mereka mengikuti apa yang me-nimbulkan kemurkaan Allah, seperti kemunafikan dan berbuat maksiat dan membenci apa yang menimbul'kan keridaan-Nya seperti ketulusan dalam beriman dan bersungguh-sungguh melaksanakan perintahnya, sebab itu Allah menghapus segala amal mereka. Ayat ini menyatakan bahwa kematian yang mengerikan akan menimpa kita, apabila kita sering mengerjakan maksiat, dan tidak mau mengerjakan perbuatan yang diridai-Nya. 29. Atau apakah orang-orang munafik yang dalam hatinya ada penyakit memendam kebencian dan permusuhan terhadap orang-orang mukmin mengira bahwa Allah tidak akan menampakkan kedengkian dan maksud buruk mereka terhadap rasul dan umat islam' Allah yang maha mengetahui rahasia segala sesuatu akan memberitahukan kepada hamba-Nya yang beriman tentang semua rahasia jahat mereka."
  }
]