[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang munafik itu menyangka bahwa Allah tidak akan mengeluarkan apa yang ada di dalam dada mereka berupa hasad dan kebencian kepada Islam dan para pemeluknya? Tidak begitu, karena Allah akan membedakan antara orang yang jujur dengan orang yang dusta."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Apakah orang-orang yang di dalam hati mereka terdapat keraguan dari kalangan orang-orang munafik mengira bahwa Allah tidak akan mengeluarkan kedengkian mereka dan menampakkannya? niscaya Allah mengeluarkannya dengan cara memberi cobaan dengan ujian-ujian, untuk membedakan antara orang-orang yang benar-benar beriman dengan orang yang dusta dan jelaslah orang-orang yang beriman serta tampaklah orang-orang munafik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Apakah orang-orang munafik mengira Allah tidak akan menyingkap kedengkian dan keburukan yang ada dalam hati mereka?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. أَمْ حَسِبَ الَّذِينَ فِى قُلُوبِهِم مَّرَضٌ (Atau apakah orang-orang yang ada penyakit dalam hatinya mengira) Yakni orang-orang munafik mengira. أَن لَّن يُخْرِجَ اللهُ أَضْغٰنَهُمْ (bahwa Allah tidak akan menampakkan kedengkian mereka?) Allah mengancam mereka dengan ancaman akan menampakkan permusuhan dan kedengkian yang mereka sembunyikan sehingga Rasulullah dan orang-orang beriman dapat mengetahuinya, sehingga orang-orang munafik itu terbuka aibnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Apakah orang-orang yang menyimpan kedengkian di dalam hati itu menyangka bahwa Allah akan menampakkan kedengkian mereka kepada Nabi SAW dan orang mukmin.?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apakah orang-orang yang dalam hatinya ada penyakit} kemunafikan dan keraguan {itu mengira} bahkan menyangka {bahwa Allah tidak akan menampakkan kedengkian mereka} kedengkian mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Allah berfirman, “Atau apakah orang-orang yang ada penyakit dalam hatinya mengira,” yakni seperti penyakit syubhat atau syahwat yang bisa mengeluarkan hati dari kondisinya yang bersih dan lurus; bahwasanya Allah tidak akan mencabut kedengkian dan permusuhan dari hati mereka terhadap Islam dan kaum Muslimin” ini adalah dugaan yang tidak patut bagi kebijaksanaan Allah, karena Allah pasti membedakakn antara orang yang benar dan orang yang dusta dengan cara diberi ujian dan berbagai musibah yang bagi siapa pun yang keimanannya tetap kokoh, maka dialah orang yang beriman sejati. dan siapa pun yang balik ke belakang dan tidak bersabar ketika ditimpa ujian, merasa sedih serta imannya melemah, pada saat itu keluarlah kedengkian dalam hati mereka dan kemunafikannya bisa terlihat jelas. Inilah tuntutan hikmah yang ditetapkan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 29: Kemudian Allah menegur mereka orang-orang munafik dengan menyingkap rahasia-rahasia mereka dan menampakkannya, Allah berkata : Apakah mereka orang-orang yang dalam hatinya ada permusuhan dan dengki kepada islam menyangka bahwa Allah tidak akan menampakkan apa yang ada dalam hati-hati mereka dan menampakkan kepada Rasul ﷺ dan kaum muslimin atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Baik penyakit syubhat maupun syahwat. Kepada Nabi shallallahu 'alaihi wa sallam dan kaum mukmin. Yakni apakah mereka mengira bahwa Allah Subhaanahu wa Ta'aala tidak akan menampakkan apa yang ada dalam hati mereka berupa kedengkian dan permusuhan kepada Islam dan kaum muslimin? Ini adalah sangkaan yang tidak sesuai dengan kebijaksanaan Allah, karena Dia harus memisahkan antara yang benar dengan yang dusta, yaitu dengan adanya ujian dan cobaan. Orang yang tetap teguh dan tetap beriman ketika ada ujian, maka dia adalah orang mukmin yang hakiki, adapun orang yang kembali ke belakang (murtad) dan dia tidak sabar terhadapnya, maka ketika ujian datang ia keluh kesah, melemah imannya dan keluar rasa dengki dalam hatinya serta kelihatan kemunafikannya. Hal ini tentu sesuai dengan kebijaksanaan Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 29",
    "description": "Atau apakah orang-orang munafik yang dalam hatinya ada penyakit memendam kebencian dan permusuhan terhadap orang-orang mukmin mengira bahwa Allah tidak akan menampakkan kedengkian dan maksud buruk mereka terhadap rasul dan umat islam' Allah yang maha mengetahui rahasia segala sesuatu akan memberitahukan kepada hamba-Nya yang beriman tentang semua rahasia jahat mereka. 30. Pada ayat ini Allah menyatakan kepada nabi Muhammad bahwa Allah akan memberitahukan kepada nabi tentang sifat dan perbuat-an orang-orang munafik itu. Dan sekiranya kami menghendaki, niscaya kami perlihatkan sifat-sifat dan perbuatan mereka kepadamu wahai nabi Muhammad, sehingga engkau benar-benar dapat mengenal mereka dengan tanda-tandanya yang kami sampaikan dengan jelas kepadamu. Dan engkau benar-benar akan mengenal mereka dari nada bicaranya yang penuh dengan tentang tipuan, kebencian dan permusuhan, dan Allah mengetahui segala amal perbuatan kamu, tidak ada yang tersembunyi bagi Allah, baik dalam bentuk niat, ucapan maupun perbuatan."
  }
]