[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebab penyesatan dan hidayah itu adalah karena orang-orang kafir itu mengikuti setan dan menaatinya, sedangkan orang-orang beriman menaati Rasulullah, serta membenarkan cahaya dan hidayah yang dibawanya. Sebagaimana Allah menjelaskan perbuatanNya terhadap kedua kubu, pengikut kekafiran dan pengikut iman dengan apa-apa yang berhak mereka dapatkan, Allah juga membuat perumpamaan bagi manusia yang seperti mereka, sehingga setiap kaum dan setiap kubu bisa diindukkan dengan yang semisal dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Balasan yang disebutkan untuk dua golongan itu disebabkan karena orang-orang yang kafir kepada Allah mengikuti kebatilan dan orang-orang yang beriman kepada Allah dan Rasul-Nya mengikuti kebenaran dari Rabb mereka. Maka balasan bagi mereka berbeda karena perbedaan perbuatan mereka, sebagaimana Allah telah menerangkan hukum-Nya pada dua golongan ini; golongan orang-orang yang beriman dan golongan orang-orang yang kafir, Allah menjadikan mereka sebagai permisalan untuk manusia sehingga satu golongan berhadapan dengan lawannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "Orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang mukmin mengikuti yang haq dari Tuhan mereka) Yakni amalan-amalan orang-orang kafir menjadi sia-sia adalah kerena mereka mengikuti kebatilan seperti, menyekutukan Allah dan melakukan kemaksiatan. Dan penghapusan kesalahan-kesalahan orang-orang beriman adalah karena mereka memperbaiki keadaan mereka dengan mengikuti kebenaran yang telah Allah perintahkan untuk diikuti seperti mengesaakan Allah, beriman, dan menjalankan ketaatan-ketaatan. كَذٰلِكَ يَضْرِبُ اللهُ لِلنَّاسِ أَمْثٰلَهُمْ (Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka) Yakni keadaan dua golongan tersebut menjadi seperti perumpamaan dalam hal keanehannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Balasan tersebut adalah balasan yang adil, sebab mereka orang-orang kafir melakukan kebatilan dengan menyembah selain Allah dan berbuat syirik. Adapun orang-orang mukmin telah mengikuti perintah Alquran yang diturunkan Allah kepada nabi Muhammad SAW. Seperti inilah penjelasan tentang keadaan orang-orang kafir dan mukmin. Allah telah menjelaskan keadaan/nasib orang-orang kafir dan mukmin di setiap zaman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hal itu karena sesungguhnya orang-orang kafir mengikuti kebathilan} setan {dan orang-orang yang beriman mengikuti kebenaran dari Tuhan mereka. Demikianlah Allah membuat} menjelaskan {perumpamaan-perumpamaan mereka kepada manusia} keadaan yang membedakan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Penyebab semua itu adalah karena mereka mengikuti kebenaran yang lurus dan meyakininya serta semua yang dikandung oleh al-Quran yang agung ini yang berasal dari Rabb mereka yang telah mengurus mereka dengan nikmat dan mengatur mereka dengan kelembutan. Allah mengurus mereka dengan kebenaran, mereka pun mengikuti kebenaran itu hingga semua hal mereka menjadi baik. Dan karena tujuan yang dimaksudkan untuk mereka itu berhubungan dengan kebenaran yang bersumber dari Allah Yang Mahakekal, Mahabenar dan Mahanyata, maka sarana akan tetap ada, dan pahalanya pun tetap mengalir. “Demikianlah Allah membuat untuk manusia perbandingan-perbandingan bagi mereka.” Seperti itulah Allah membuat perumpamaan untuk manusia yang menjelaskan orang-orang yang baik dan orang-orang yang jahat. Masing-masing dari kedua golongan tersebut diberi sifat yang bisa diketahui dan dibedakan. Semua itu adalah agar orang-orang yang binasa, binasa setelah bukti nyata datang kepadanya, dan orang-orang yang hidup juga hidup dengan bukti nyata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 3: Allah menjelaskan bahwa kesesatan ini adalah sebab mereka yang kufur dan mengikuti kebathilan, dimana setan membujuk mereka, yang akhirnya mereka menyekutukan Allah, beramal di atas kemaksiatan, adapun hidayah untuk orang-orang yang beriman menghapuskan keburukan karena sebab mereka mengikuti kebenaran dari Tuhan mereka dan kemudian beriman kepada Allah saja dan kepada Rasulullah ﷺ, serta beramal dengan amalan shalih yang dicintai oleh Allah dan diridhai-Nya. Permisalan seperti ini adalah menjelaskan keadaan orang-orang yang beriman, dan orang-orang yang kafir telah dijelaskan oleh Allah kepada manusia akan permisalan dan keadaan mereka yang merugi dan selamat bagi yang beriman. Agar manusia dapat mengambil pelajaran dan menempuh jalan keselamatan serta menjauhkan dari jalan kesesatan dan kerugiaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penyia-nyiaan amal bagi orang-orang kafir dan penghapusan kesalahan bagi orang-orang mukmin, sebabnya adalah sebagaimana yang diterangkan dalam ayat di atas. Yaitu semua tujuan yang tidak dimaksudkan mencari keridhaan Allah Subhaanahu wa Ta'aala, seperti menyembah patung dan berhala, dan amal untuk membela yang batil. Yaitu kebenaran, keyakinan, dan apa saja yang dikandung dalam Al Qur’an. Yang mengurus mereka dengan nikmat-nikmat-Nya, mengatur mereka dengan kelembutan-Nya, Dia mendidik mereka dengan kebenaran, lalu mereka mengikutinya sehingga menjadi baik semua perkara mereka Dia menerangkan kepada mereka orang-orang yang baik dan orang-orang yang buruk, menerangkan sifat masing-masingnya agar mereka kenal dan dapat membedakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 3",
    "description": "Kemudian Allah menyatakan sebab dihapusnya amal orang-orang kafir dan sebab diperbaikinya keadaan orang yang beriman. Allah berfirman, yang demikian itu, yakni balasan yang adil berupa ganjaran bagi orang-orang yang beriman dan siksaan bagi orang-orang kafir, karena sesungguhnya orang-orang kafir secara bersungguh-sungguh mengikuti yang batil dan sesat, baik dalam kepercayaan maupun amal-amal mereka, dan sesungguhnya orang-orang yang beriman mengikuti secara bersungguh-sungguh kebenaran yang diturunkan dari tuhan mereka. Demikianlah Allah membuat perumpamaan-perumpamaan bagi manusia, agar mereka mengambil pelajaran. 4-6. Pada ayat yang lalu dan beberapa ayat sebelumnya dijelaskan ciri-ciri orang kafir dan perbuatan mereka menghalang-halangi orang-orang yang beribadah kepada Allah. Ayat ini memberikan tuntunan tentang perbuatan yang harus dilakukan kaum muslim terhadap mereka. Maka apabila kamu bertemu dengan orang-orang yang kafir yang memerangi kamu di medan perang, maka pukullah batang leher mereka, yakni perangilah dengan cara memukul batang leher mereka, itulah cara yang paling baik untuk melumpuhkan kekuatan mereka. Selanjutnya apabila kamu telah mengalahkan mereka, maka tawanlah yang masih hidup dari mereka, dan setelah itu kamu boleh membebaskan mereka tanpa tebusan atau membebaskan mereka dengan menerima tebusan berupa harta atau tukar menukar tawanan. Itulah yang kamu lakukan sampai perang selesai dan semua yang terlibat dalam peperangan meletakkan senjata. Demikianlah ketentuan yang telah ditetapkan Allah, dan sekiranya Allah menghendaki, niscaya dia membinasakan mereka tanpa melibatkan orang-orang mukmin untuk berperang, tetapi dia hendak menguji kamu satu sama lain dengan mewajibkan orang-orang mukmin memerangi orang-orang kafir yang memusuhi mereka. Orang-orang kafir yang mati dalam peperangan adalah orang-orang yang celaka di dunia dan di akhirat mendapat azab tuhan. Dan orang-orang mukmin yang gugur di dalam peperangan pada jalan Allah, Allah tidak menyia-nyiakan amal mereka, tetapi memberikan kepada mereka pahala yang besar. Allah akan memberi petunjuk kepada mereka menuju jalan kebahagiaan dan memperbaiki keadaan mereka baik di dunia maupun akhirat, dan memasukkan mereka ke dalam surga yang telah diperkenalkan-Nya kepada mereka segala keindahan dan kenikmatan di dalamnya."
  }
]