[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bila Kami berkehendak (wahai Nabi) niscaya Kami pasti menunjukkan kepadamu pribadi-pribadi mereka, sehingga kamu mengetahui mereka dengan tanda-tanda yang jelas, kamu juga akan mengetahui melalui kata-kata yang terucap oleh mulut mereka yang mengisyaratkan maksud-maksud mereka. Tidak ada yang samar bagi Allah dari amal-amal siapa yang menaatiNya dan siapa yang mendurhakaiNya. Allah akan membalas masing-masing dari mereka sesuai dengan apa yang berhak diterimanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan jika Kami menghendaki untuk memberitahumu -wahai Rasul- tentang orang-orang munafik, niscaya Kami menunjukkan kepadamu sehingga kamu tahu mereka dari tanda-tanda mereka dan tentu kamu mengetahui mereka dari gaya bicara mereka, dan Allah mengetahui perbuatan kalian, tidak ada sesuatu pun yang tersembunyi dari-Nya dan Dia akan membalas kalian atas perbuatan-perbuatan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Hai Rasulullah, seandainya Kami menghendaki niscaya Kami akan menunjukkan kepadamu orang-orang munafik sehingga kamu dapat mengetahui ciri-ciri khas mereka. Sungguh kamu pasti akan mengetahui mereka dari cara berbicara dan gerakan lidah mereka. Hai para hamba, Allah Maha Mengetahui segala perbuatan baik dan buruk kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَلَوْ نَشَآءُ لَأَرَيْنٰكَهُمْ (Dan kalau Kami kehendaki, niscaya Kami tunjukkan mereka kepadamu) Yakni niscaya Kami akan memberitahukanmu tiap-tiap mereka sehingga seakan-akan kamu benar-benar melihat mereka. فَلَعَرَفْتَهُم بِسِيمٰهُمْ ۚ (sehingga kamu benar-benar dapat mengenal mereka dengan tanda-tandanya) Yakni dengan tanda-tanda yang hanya ada pada diri mereka. وَلَتَعْرِفَنَّهُمْ فِى لَحْنِ الْقَوْلِ ۚ (Dan kamu benar-benar akan mengenal mereka dari kiasan-kiasan perkataan mereka) Makna (لحن القول) yakni isi dan tujuan dari perkataan. Dan yang dimaksud di sini adalah olokan yang mereka tujukan kepadamu dan kaum muslimin. Dikatakan bahwa setelah turunnya ayat ini tidak ada sesuatu yang mereka katakan melainkan Rasulullah akan mengetahuinya. وَاللهُ يَعْلَمُ أَعْمٰلَكُمْ(dan Allah mengetahui perbuatan-perbuatan kamu) Tidak ada yang tersembunyi dari-Nya, kemudian Dia akan membalas kalian sesuai dengan perbuatan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Jika Kami berkehendak, Kami benar-benar akan menampakkan kedengkian orang-orang munafik itu, sehingga kalian mengetahui tanda khusus yang menunjukkan kedingkian mereka. Kalian akan benar-benar tahu dari bahasa tubuh dan perkataan mereka yang menunjukkan kebohongan. Sehingga akan tampak pada kalian dan orang Islam lainnya. Allah Maha Tahu atas segala perbuatan kalian. Tidak ada yang bisa tersembunyi dari-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Seandainya Kami berkehendak, niscaya Kami menunjukkan mereka kepadamu sehingga kamu benar-benar dapat mengenali mereka melalui tanda-tanda mereka} tanda-tanda mereka {Kamu pun benar-benar akan mengenali mereka melalui dialek} pola ucapan dan maksudnya {Allah mengetahui segala amal perbuatan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Padahal Allah berfirman, “Dan kalau Kami menghendaki, niscaya Kami tunjukkan mereka kepadamu sehingga kamu benar-benar dapat mengenal mereka dengan tanda-tandanya,” yakni tanda-tanda mereka semacam guratan di wajah mereka, “dan kamu benar-benar akan mengenal mereka dari kiasan-kiasan perkataan mereka,” yakni yang disimpan di hati mereka itu pasti terlihat jelas dalam kata-kata kiasan mereka, sebab lisan adalah ruang pengenalan hati yang bisa menampakkan kebaikan atau keburukan yang tersimpan di dalam hati, “dan Allah mengetahui perbuatan-perbuatan kamu,” sehingga kalian akan dibalas atas perbuatan-perbuatan kalian itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 30: Allah menjelaskan sebagian kuasa-Nya yang nampak, Allah berkata : Kalau saja Kami berkehendak wahai Nabi Allah, kami akan tampakkan kepadamu perihal mereka dan kami tampakkan (apa yang mereka sembunyikan) di hadapan mata-mata mereka, agar kami dapat memberikan kepadamu tanda-tanda mereka secara khusus yang tanda tersebut berbeda dan nampak pada wajah-wajah mereka, dan agar nampak maksud-maksud dari tujuan ucapan mereka melalui lisan-lisan mereka dan yang dapat dipahami dari makna ucapan mereka. Allah Maha Mengetahui amalan-amalan kalian yang tidak tersembunyi bagi-Nya sesuatupun dari amalan-amalan makluk, dan Allah akan membalas kalian atas amalan-amalan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang tampak di wajah-wajah mereka. Hal itu karena nada bicara menunjukkan apa yang ada dalam lubuk hati, baik atau buruk. Lalu Dia akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 30",
    "description": "Pada ayat ini Allah menyatakan kepada nabi Muhammad bahwa Allah akan memberitahukan kepada nabi tentang sifat dan perbuat-an orang-orang munafik itu. Dan sekiranya kami menghendaki, niscaya kami perlihatkan sifat-sifat dan perbuatan mereka kepadamu wahai nabi Muhammad, sehingga engkau benar-benar dapat mengenal mereka dengan tanda-tandanya yang kami sampaikan dengan jelas kepadamu. Dan engkau benar-benar akan mengenal mereka dari nada bicaranya yang penuh dengan tentang tipuan, kebencian dan permusuhan, dan Allah mengetahui segala amal perbuatan kamu, tidak ada yang tersembunyi bagi Allah, baik dalam bentuk niat, ucapan maupun perbuatan. 31. Dan sungguh, kami benar-benar akan menguji kamu, wahai kaum muslim dengan menyuruhmu berjuang dan melakukan perbuatan berat, sehingga kami mengetahui orang-orang yang benar-benar berjihad di jalan Allah dan bersabar dalam melaksanakan kewajiban di antara kamu; dan akan kami uji perihal kamu sehingga kami mengetahui siapa di antara kamu yang benar-benar beriman dan siapa yang dusta."
  }
]