[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari bahwa Allah adalah Tuhan Yang Haq semata, tidak ada sekutu bagiNya, menghalangi manusia dari jalan Allah, menentang Rasulullah, memeranginya sesudah datang kepada mereka hujjah-hujjah dan bukti-bukti bahwa beliau adalah Nabi Allah, orang-orang itu tidak akan memudaratkan agama Allah sedikit pun. Allah akan membatalkan pahala amal mereka yang mereka kerjakan di dunia, karena mereka bukan menginginkan wajah Allah dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Sesungguhnya orang-orang yang kafir terhadap Allah dan Rasul-Nya, menghalangi diri mereka dari agama Allah dan menghalangi orang lain darinya serta mengingkari Rasul-Nya dan memusuhinya setelah jelas bagi mereka bahwa dia adalah Nabi, sekali-kali mereka tidak bisa memberi mudarat kepada Allah, akan tetapi mereka justru memberi mudarat kepada diri mereka sendiri, dan Allah akan membatalkan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Orang-orang kafir yang menghalangi orang lain dari agama Islam, dan yang memusuhi Rasulullah setelah mengetahui bahwa beliau benar-benar Nabi utusan Allah; maka segala keburukan ini tidak akan mendatangkan mudharat kepada Allah, dan Allah akan membuat amalan mereka sia-sia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَشَآقُّوا۟ الرَّسُولَ (serta memusuhi Rasul) Yakni memusuhi dan menyelisihinya. مِنۢ بَعْدِ مَا تَبَيَّنَ لَهُمُ الْهُدَىٰ( setelah petunjuk itu jelas bagi mereka) Yakni setelah mengetahui bahwa dia adalah nabi yang diutus Allah lewat mukjizat dan bukti-bukti yang jelas yang telah mereka saksikan. لَن يَضُرُّوا۟ اللهَ شَيْـًٔا(mereka tidak dapat memberi mudharat kepada Allah sedikitpun) Dengan keengganan mereka untuk beriman dan kegigihan mereka dalam kekafiran; mereka tidak memberi mudharat melainkan kepada diri mereka sendiri. وَسَيُحْبِطُ أَعْمٰلَهُمْ(Dan Allah akan menghapuskan (pahala) amal-amal mereka) Yakni menghanguskannya akibat kekafiran mereka. Pendapat lain mengatakan bahwa yang dimaksud dengan amal-amal mereka adalah segala tipu daya yang mereka buat untuk mengalahkan agama Allah, dan musibah yang mereka harap dapat menimpa Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-Nya, serta orang-orang yang menghalangi manusia untuk mengikuti Islam dan rasul SAW: yaitu orang-orang Yahudi Bani Quraidhah dan Bani Nadhir. Juga orang-orang yang memusuhi rasul, bahkan setelah mereka tahu dengan jelas bahwa Nabi Muhammad adalah utusan Allah. Kekufuran dan pembangkangan mereka terhadap Ilsam tidak akan memberi kerugian atau bahaya kepada Allah sedikitpun. Allah akan menolak segala amal baik mereka sebab kekufuran dan konspirasi mereka terhadap Islam. Ibnu Abbas berkata: Mereka adalah orang-orang yang diberi makanan ketika perang Badr. Ulama’ lain berkata bahwa mereka adalah para ahli kitab (Yahudi)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang ingkar, menghalang-halangi dari jalan Allah, dan memusuhi} menentang dan memusuhi {Rasul setelah petunjuk itu jelas bagi mereka, maka tidak akan dapat memberi mudarat kepada Allah sedikit pun. Dia akan menghapus} membatalkan {amal-amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Ini merupakan ancaman keras bagi orang yang mengumpulkan semua keburukan mulai dari kufur terhadap Allah, menghalangi manusia dari jalan Allah yang Allah bentangkan untuk sampai kepadaNya, “serta memusuhi Rasul setelah petunjuk itu jelas bagi mereka.” Artinya, mereka memusuhi dan menentang petunjuk secara sengaja dan membangkang, bukan karena ketidaktahuan dan tersesat. Mereka itu “tidak dapat memberi mudarat kepada Allah sedikit pun.” Permusuhan dan penentangan mereka itu tidak akan mengurangi kekuasaan Allah, “dan Allah akan menghapuskan (pahala) amal-amal mereka.” Semua usaha yang pernah mereka lakukan dalam menolong kebatilan akan dihapus oleh Allah karena tidak membuahkan apa pun selain kerugian. Semua amal mereka yang diharapkan mendapatkan pahala tidak diterima Allah karena tidak memenuhi syarat amal yang bisa diterima."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 32: Ketahuilah bahwa mereka yang mendustakan agama Allah dan memalingkan manusia dari keimanan kepada-Nya, dan memusuhi Rasulullah ﷺ yang jujur; Mereka adalah orang-orang yang tidak dapat merugikan Allah dengan apapun dengan sebab kekafiran mereka dan kesesatan mereka, dan Allah akan membatalkan amalan-amalan mereka yang mereka amalkan di dunia, seperti memberi makananan dan silaturahmi; Karena sebab Allah tidak menerima amalan dari diri yang kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ancaman ini merupakan ancaman keras kepada orang yang dalam dirinya terkumpul berbagai keburukan, seperti kafir kepada Allah dan menghalangi manusia dari jalan Allah. Yakni menentang Rasul dan menyelisihinya dengan sengaja, bukan karena jahil (tidak tahu). Oleh karena itu, kerajaan-Nya tidaklah berkurang karenanya. Seperti sedekah dan lainnya; mereka tidak akan melihat pahalanya di akhirat. Atau segala usaha mereka untuk membela kebatilan tidaklah membuahkan apa-apa selain kerugian dan kekecewaan, dan amal yang mereka harapkan pahalanya tidaklah membuahkan pahala karena tidak ada syarat untuk diterima."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 32",
    "description": "Pada ayat-ayat yang lalu Allah menerangkan keadaan orang-orang munafik yang selalu melaksanakan tipu daya dan maksud jahat kepada orang-orang yang beriman. Mereka mengira perbuatan jahat itu tidak diketahui oleh Allah. Pada ayat ini Allah menerangkan keadaaan orang-orang yang menghalangi manusia mengikuti jalannya setelah datang kepada mereka petunjuk. Sesungguhnya orang-orang yang kafir kepada Allah dan rasul-Nya dan menghalang-halangi orang lain dari jalan Allah untuk mengikuti agama-Nya serta memusuhi rasul setelah ada petunjuk yang jelas bagi mereka, yang menyatakan bahwa nabi Muhammad adalah rasul-Nya mereka tidak akan dapat memberi mudarat bahaya kepada Allah sedikit pun dengan sebab kekafirannya itu. Dan kelak Allah menghapus pahala segala amal mereka, disebabkan kekafirannya. 33. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! taatlah kepada Allah dan taatlah kepada rasul dengan cara melaksanakan perintah yang tercantum di dalam Al-Qur'an dan sunnah dan janganlah kamu merusakkan segala amalmu dengan melakukan maksiat kepada Allah."
  }
]