[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan rasulNya serta melaksanakan syariatNYa, taatilah Allah dan taatilah RasulNya dalam perintah dan larangan keduanya, dan janganlah kalian membatalkan pahala amal-amal kalian dengan kekafiran dan kemaksiatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Wahai orang-orang yang beriman kepada Allah dan mengamalkan apa yang disyariatkan untuknya, taatilah Allah dan taatilah Rasul dengan mengerjakan segala perintah-perintah keduanya dan menjauhi larangan-larangan keduanya dan janganlah kalian batalkan amal perbuatan kalian dengan kekufuran dan riya`."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Allah memerintahkan orang-orang beriman untuk mentaati-Nya dan mentaati rasul-Nya dalam syariat, al-Qur’an, dan sunnah yang telah dia sampaikan kepada mereka. Dan Allah melarang mereka menghapus amalan-amalan shalih yang telah mereka kerjakan akibat kembali kepada kekafiran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ أَطِيعُوا۟ اللهَ وَأَطِيعُوا۟ الرَّسُولَ (Hai orang-orang yang beriman, taatilah Allah dan taatilah Rasul) Dalam syariat-syariat yang diperintahkan kepada kalian yang terkandung dalam kitabullah dan sunnah Rasulullah. وَلَا تُبْطِلُوٓا۟ أَعْمٰلَكُمْ(dan janganlah kamu merusakkan (pahala) amal-amalmu) Yakni janganlah kalian menghanguskan kebaikan kalian dengan kemaksiatan, seperti dengan riya’ dan sum’ah serta mengungkit-ungkit pemberian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya: Patuhilah perintah Allah dan rasul-Nya yang telah disampaikan kepada kalian, baik itu syariat dari Alquran maupun sunnah (hadis nabi). Jangan kalian rusak pahala amal kalian dengan mengiringinya dengan riya’, mencari popularitas, juga kemunafikan. Jangan kalian rusak pahala amal kalian dengan maksiat dan melawan perintah Allah dan rasul-Nya. Ayat ini turun untuk beberapa sahabat, sebagai pengingat. Sehingga mereka takut bahwa dosa mereka dapat merusak pahala amal mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, taatilah Allah dan taatilah Rasul serta jangan batalkan amal-amal kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Allah memerintahkan orang-orang Mukmin dengan suatu perintah yang merupakan pelengkap segala urusan mereka dan agar kebahagiaan mereka, baik di dunia maupun di akhirat tercapai, yaitu menaati Allah dan RasulNya di berbagai masalah-masalah pokok Agama maupun cabang-cabangnya. Taat adalah menunaikan perintah Allah dan menjauhi semua yang dilarang sebagaimana yang diperintahkan dengan ikhlas dan mengikuti Sunnah Rasulullah secara sempurna. Firman Allah, “dan janganlah kamu merusakkan (pahala) amal-amalmu,” mencakup larangan untuk merusak amal setelah dilakukan, seperti dengan cara selalu membicarakannya, membangga-bangakannya, serta mempublikasikannya kepada orang lain, juga berbagai kemaksiatan yang bisa menggugurkan pahala amal baik. Larangan ini juga mencakup larangan untuk merusak amalan pada waktu dilakukan dengan cara diputus atau dengan melakukan hal-hal yang bisa merusaknya. Semua hal yang bisa membatalkan shalat, puasa, haji, dan lainnya termasuk dalam hal ini dan juga dilarang. Dengan ayat ini para ulama fikih berdalil atas haramnya membatalkan amalan wajib serta makruhnya membatalkan amalan Sunnah tanpa alasan yang mewajibkan pembatalan tersebut. Karena Sunnah tanpa alasan yang mewajibkan pembatalan tersebut. Karena Allah melarang kita untuk membatalkan amalan, maka larangan tersebut sebagai perintah bagi kita untuk memperbaiki serta menyempurnakan amalan serta menunaikannya secara layak, baik dari segi ilmu maupun praktik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 33: Wahai orang-orang yang beriman kepada Allah dan hari akhir, dan membenarkan Rasul-Nya ﷺ, tetaplah di atas ketaatan kepada Allah dan Rasul-Nya ﷺ dalam perbuatan yang diperintahkan dan menjauhi larang-larangan-Nya, dan jangan merusak amalan-amalan kalian, sehingga menjadikan amalan-amalan kalian hilang karena sebab riya dan syirik serta kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memerintahkan kaum mukmin dengan sesuatu yang dapat menyempurnakan urusan mereka, dan akan menghasilkan kebahagiaan, yaitu taat kepada Allah dan taat kepada Rasulullah shallallahu 'alaihi wa sallam baik dalam ushul (dasar-dasar agama) maupun furu’nya. Taat artinya melaksanakan perintah Allah dan menjauhi larangan-Nya dengan ikhlas dan mengikuti Rasul-Nya shallallahu 'alaihi wa sallam. Dengan berbagai maksiat. Menurut Syaikh As Sa’diy, ayat ini mencakup larangan membatalkannya setelah mengerjakannya, yaitu dengan mengerjakan sesuatu yang merusaknya, seperti menyebut-nyebutnya dan merasa ujub dengannya, berbangga dan sum’ah (ingin didengar), mengerjakan maksiat yang membuat amalnya terhapus dan menghapuskan pahalanya. Termasuk pula merusak saat mengerjakannya, yaitu dengan memutuskannya atau mengerjakan hal yang merusak atau membatalkan amalannya, seperti pembatal shalat, pembatal puasa, pembatal haji dsb. Semuanya masuk ke dalam larangan ini, dan bahwa hal itu dilarang. Para fuqaha’ berdalih dengan ayat ini untuk menerangkan haramnya memutuskan amalan wajib dan makruhnya memutuskan amalan sunat tanpa ada hal yang mengharuskan untuk diputuskan. Jika Allah Subhaanahu wa Ta'aala melarang membatalkan amalan, maka berarti Dia memerintahkan untuk memperbaikinya, menyempurnakannya dan mengerjakannya dengan cara yang dapat menjadikannya baik; yang berupa ilmu maupun amal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 33",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasul-Nya! taatlah kepada Allah dan taatlah kepada rasul dengan cara melaksanakan perintah yang tercantum di dalam Al-Qur'an dan sunnah dan janganlah kamu merusakkan segala amalmu dengan melakukan maksiat kepada Allah. 34. Sesungguhnya orang-orang yang kafir yang mengingkari keesaan Allah dan menghalang-halangi orang lain dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka Allah tidak akan mengampuni mereka. Allah tidak akan menghapus dosa mereka bahkan Allah akan menghukum mereka dan memperlihatkan keburukan mereka di hadapan para saksi kelak di hari kiamat."
  }
]