[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesunggguhnya orang-orang yang mengingkari bahwa Allah adalah satu-satunya Tuhan yang berhak disembah, tidak ada sekutu bagiNya, menghalang-halangi manusia dari agama Allah, kemudian mati di atasnya, Allah tidak akan mengampuni mereka, Allah akan mengazab mereka atas kekafiran mereka dan mempermalukan mereka di hadapan umat manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Sesungguhnya orang yang kafir terhadap Allah, memalingkan diri mereka dan memalingkan orang lain dari agama Allah kemudian mereka meninggal dalam kekufuran mereka sebelum bertobat, sekali-kali Allah tidak akan memaafkan dosa-dosa mereka dengan menutupinya, akan tetapi Allah akan membalas mereka karenanya dan memasukkan mereka ke dalam Neraka, mereka kekal di dalamnya selama-lamanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Orang-orang kafir yang menghalangi orang lain dari agama Islam dan meninggal dalam keadaan tersebut, maka Allah tidak akan mengampuni dosa-dosa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Sesungguhnya orang-orang yang mengingkari Allah dan rasul-Nya, juga orang-orang yang menghalangi orang lain untuk masuk Islam, kemudian mereka mati dalam kekafiran maka Allah tidak akan mengampuni dosa mereka. Mereka akan diazab sebab kemusyrikan mereka. Ayat ini turun untuk orang-orang yang tidak konsisten (ashhabul qalib) atau beberapa orang yang berperang dalam perang Badar. Mereka mengumumkan bahwa mereka telah membunuh orang musyrik pada perang tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang yang ingkar dan menghalang-halangi dari jalan Allah, kemudian mereka mati dalam keadaan kafir, Allah tidak akan memberi ampunan bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. Ayat ini dan ayat lain yang terdapat dalam surat al baqarah: 217 “Barangsiapa yang murtad di antara kamu dari agamanya, lalu dia mati dalam kekafiran, maka mereka itulah yang sia-sia amalannya di dunia dan di akhirat,” adalah sebagai pembatas kemutlakan semua nash tentang gugurnya amalan karena kekufuran. Yakni, gugurnya amal karena kekufuran dibatasi dengan kematian orang bersangkutan dalam kekufuran. Dalam ayat ini Allah berfirman, “Sesungguhnya orang-orang yang kafir,” terhadap Allah, malaikat, kitab-kitab Allah, rasul-rasul Allah, dan Hari Akhir, “dan menghalangi” manusia “dari jalan Allah,” dengan cara mendorong mereka agar tidak menerima kebenaran dan diajak kepada kebatilan serta dihias-hiasi, “ kemudian mereka mati dalam keadaan kafir,” sebelum bertaubat, “maka sekali-kali Allah tidak akan memberi ampun kepada mereka,” tidak dengan syafaat atau lainnya, karena Allah telah memastikan azab atas mereka. Mereka telah kehilangan pahala dan Allah telah mewajibkan mereka untuk kekal di dalam neraka, serta rahmat dari Allah Yang Maha Menyayangi dan Maha Mengampuni telah ditutup untuk mereka. Makna tersirat dari ayat ini adalah bahwa jika mereka bertaubat dari kekufuran sebelum ajal menjelang, maka Allah akan mengampuni dan merahmati mereka, serta memasukkanm mereka kedalam surga, meski mereka menghabiskan usia dalam kekufuran dan menghalang-halangi manusia dari jalan Allah serta melakukan berbagai kemaksiatan. Mahasuci Allah yang membukakan pintu-pintu rahmat untuk para hambaNya dan tidak menutupnya dari seorang pun selama yang bersangkutan masih hidup dan masih mungkin bertaubat. Mahasuci Allah Yang Mahasabar yang tidak menyegerakan siksaan bagi mereka yang durhaka, Allah justru mengampuni mereka dan memberi mereka rizki seolah-olah mereka tidak pernah mendurhakaiNya padahal Allah Kuasa untuk segera menyiksa mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 34: Ketahuilah bahwa mereka yang kafir kepada Allah dan ingkar terhadapa ayat-ayat-Nya serta mendustakan Rasul-Nya ﷺ, dan memalingkan selain mereka dari keimanan kepada Allah dan tauhid; Kemudian tidak bertaubat dari hal itu, tidak juga berislam dan kemudian mati, maka mereka adalah orang kafir; Mereka adalah orang-orang yang tidak diampuni atas dosa-dosa mereka. Dan Allah haramkan bagi mereka, tempat kembali mereka neraka selamanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini dan ayat yang disebutkan dalam surah Al Baqarah: 217, yaitu, “Barang siapa yang murtad di antara kamu dari agamanya, lalu dia mati dalam kekafiran, maka mereka itulah yang sia-sia amalannya di dunia dan di akhirat, dan mereka itulah penghuni neraka, mereka kekal di dalamnya.” Terdapat dua muqayyid (pembatas) terhadap semua nash yang mutlak yang menyebutkan batalnya amal karena kafir, yaitu jika mati di atas kekafiran. Kepada Allah, malaikat, kitab-kitab, rasul-rasul, dan hari Akhir. Dengan membuat manusia benci kepada kebenaran, mengajak kepada yang batil serta menghias kebatilan itu. Yakni belum sempat bertobat darinya. Baik dengan perantaraan syafaat maupun selainnya. Hal itu, karena mereka sudah mesti mendapatkan hukuman dan kehilangan pahala, wajib kekal di neraka serta telah ditutup dari rahmat Allah Subhaanahu wa Ta'aala Yang Maha Maha Penyayang lagi Maha Pengampun. Mafhum ayat ini menunjukkan, bahwa jika mereka bertobat sebelum matinya, maka Allah Subhaanahu wa Ta'aala akan mengampuni dan merahmati mereka serta memasukkan mereka ke surga meskipun sebelumnya mereka menghabiskan umurnya di atas kekafiran, menghalangi manusia dari jalan-Nya dan mengerjakan larangan-Nya. Maka Mahasuci Allah yang membukakan pintu rahmat kepada hamba-hamba-Nya dan tidak menutupnya dari seorang pun selama ia masih hidup dan bisa bertobat. Mahasuci Allah Yang Mahasantun yang tidak segera menyiksa orang-orang yang berbuat maksiat, bahkan memaafkan dan memberi rezeki padahal Dia berkuasa penuh atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 34",
    "description": "Sesungguhnya orang-orang yang kafir yang mengingkari keesaan Allah dan menghalang-halangi orang lain dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka Allah tidak akan mengampuni mereka. Allah tidak akan menghapus dosa mereka bahkan Allah akan menghukum mereka dan memperlihatkan keburukan mereka di hadapan para saksi kelak di hari kiamat. 35. Maka janganlah kamu lemah dan takut bertempur melawan orang musyrik dan mengajak damai untuk mencari dalih menghindari pepe-rangan karena kamulah yang lebih unggul yakni lebih mulia dari mereka karena kebenaran yang kamu miliki dan kamu perjuangkan, dan Allah pun bersama kamu. Dia yang akan membela dan memenangkan kamu dan dia tidak akan berbuat aniaya kepadamu dengan mengurangi pahala segala amalmu."
  }
]