[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka janganlah melemah (wahai orang-orang yang beriman) dalam berjihad melawan orang-orang musyrik, lalu kalian menghindari perang melawan mereka dan mengajak mereka berdamai. Kalian adalah orang-orang yang menang atas mereka dan menguasai mereka. Dan Allah bersama kalian dengan dukungan dan pertolonganNya. Di sini terkandung kabar gembira besar berupa kemenangan dan keunggulan atas musuh-musuh. Dan Allah tidak akan mengurangi pahala amal kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Maka jangalah kalian -wahai orang-orang yang beriman- lemah dalam menghadapi musuh kalian dan kalian mengajak mereka berdamai sebelum mereka mengajak kalian berdamai, sementara kalian adalah orang-orang yang berkuasa dan mengalahkan mereka, dan Allah bersama kalian dengan pertolongan-Nya dan penguatan-Nya dan sekali-kali Dia tidak mengurangi pahala amal perbuatan kalian sedikitpun, justru Dia menambahkan untuk kalian sebagai pemberian dan anugerah dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Hai orang-orang beriman, janganlah kalian meremehkan perkara jihad melawan musuh-musuh kalian dan takut melawan mereka dengan mengajak mereka untuk berdamai, padahal kalian akan menang, dan Allah akan menolong kalian dan tidak akan menghapus pahala kalian sedikitpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. فَلَا تَهِنُوا۟ (Janganlah kamu lemah) Yakni janganlah kalian bersikap lemah dalam perang. Makna (الوهن) yakni kelemahan. وَتَدْعُوٓا۟ إِلَى السَّلْمِ (dan minta damai) Yakni janganlah kalian memulai mengajak orang-orang kafir untuk berdamai, sebab hal itu menunjukkan kelemahan. Allah memerintahkan mereka agar memerangi orang-orang musyrik hingga mereka mau masuk Islam, dan Allah tidak melarang mereka untuk menerima perjanjian damai jika orang-orang musyrik meminta itu. وَأَنتُمُ الْأَعْلَوْنَ(padahal kamulah yang di atas) Yakni lebih unggul dalam persenjataan dan hujjah. Yakni kesudahan kalian adalah kemenangan, meski dalam beberapa pertempuran mereka dapat mengalahkan kalian. وَاللهُ مَعَكُمْ(dan Allah pun bersamamu) Dengan pertolongan dan bantuan bagi mereka. وَلَن يَتِرَكُمْ أَعْمٰلَكُمْ(dan Dia sekali-kali tidak akan mengurangi pahala amal-amalmu) Yakni Allah tidak akan mengurangi pahala amal perbuatan kalian sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Maka kalian jangan menjadi lemah dalam perang ini, dengan kalian mengajak orang kafir untuk berdamai. Sementara kalian direndahkan oleh orang-orang kafir ketika mereka bertemu dengan kalian. Padahal kalian lebih unggul dari mereka, baik dari kekuatan maupun landasan / hujjah. Maknanya adalah bahwa kemenangan hakiki ada pada kaum muslim, meskipun satu waktu mereka merasa/bisa lebih unggul dari kalian sesungguhnya Allah akan menolong kalian. Ingatlah bahwa pahala amal kalian tidak akan berkurang sedikitpun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka janganlah lemah} janganlah lemah dan menjadi pengecut untuk memerangi musuh {dan mengajak berdamai} perdamaian {padahal kalian lebih unggul. Allah bersama kalian dan tidak akan mengurangi amal-amal kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Selanjutnya Allah berfirman, “Janganlah kamu lemah,” yakni , janganlah kalian lemah untuk memerangi musuh-musuh kalian, sehingga kalian akan diliputi rasa takut, tapi hendaklah kalian bersabar, kokohkan niat, kuatkan diri kalian untuk berperang demi mengharap ridha Rabb kalian serta sebagai nasihat untuk Islam dan agar setan marah. “Dan” janganlah kalian “minta” berdamai dan saling membiarkan antara kalian dan musuh kalian demi mengharapkan kesenangan, “padahal,” keadaannya “kamulah yang di atas dan Allah (pun) beserta kamu dan Dia sekali-kali tidak akan mengurangi (pahala) amal-amalmu,” yakni Allah tidak akan mengurangi pahala dari amal kalian. Ketiga hal diatas masing-masingnya mewujudkan kesabaran dan menghilangkan rasa takut. Pertama, predikat mereka sebagai orang-orang yang di atas, maksudnya telah tercapai berbagai factor kemenangan dan juga diberi janji yang benar oleh Allah. Seseorang tidak akan lemah kecuali jika yang bersangkutan paling rendah dari yang lain, jumlah, peralatan, serta kekuatan lebih kecil, baik internal maupun eksternal. Kedua, Allah bersama mereka, karena mereka adalah orang-orang yang beriman. Allah akan selalu bersama orang Mukmin dengan pertolongan, kemenangan, dan pengukuhan. Hal ini akan menimbulkan kekuatan dalam hati dan membuat mereka berani maju menghadapi musuh. Ketiga, Allah tidak akan mengurangi pahala amal mereka sama sekali justru Allah akan menyempurnakan dan menambahinya, karena kemurahanNya, khususnya bagi hamba-hambaNya yang berjihad. Karena dana yang diperlukan dalam jihad itu berlipat-lipat. Allah berfirman : “Yang demikian itu ialah karena mereka tidak ditimpa kehausan, kepayahan dan kelaparan pada jalan Allah, dan tidak (pula) menginjak suatu tempat yang membangkitkan amarah orang-orang kafir, dan tidak menimpakan sesuatu bencana kepada musuh, melainkan dituliskanlah bagi mereka dengan yang demikian itu suatu amal saleh. Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik- dan mereka tiada menafkahkan suatu nafkah yang kecil dan tidak (pula) yang besar dan tidak melintasi suatu lembah, melainkan dituliskan bagi mereka (amal saleh pula) karena Allah akan memberi balasan kepada mereka yang lebih baik dari apa yang telah mereka kerjakan.”–At-Taubah:120-121- Manakala seseorang mengetahui bahwa Allah tidak akan menyia-nyiakan amal dan jihadnya, maka hal itu akan menimbulkan semangat baginya sehingga segenap usaha akan dicurahkan untuk mendapatkan pahala. Lantas bagaimana halnya jika ketiga hal tersebut terdapat dalam diri seseorang? Hal itu akan menimbulkan dorongan semangat yang amat sempurna. Itulah cara Allah memberikan dorongan, kecintaan, serta penguatan hati hamba-hambaNya untuk melakukan pekerjaan yang di dalamnya terdapat kebaikan dan keberuntungan bagi mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 35: Maka jika Allah tidak mengampuni orang-orang kafir, maka janganlah kalian wahai orang-orang yang beriman, lemah dalam memeranginya. Jangan kalian takut dan gentar, jangan pula meminta berdamai dan meminta kemurah hatian mereka, agar mereka memberikan waktu istirahat dan agar meninggalkan kalian sedangkan kalian adalah orang-orang yang dapat mengalahkan, memiliki kuasa dan di atas musuh-musuh kalian. Allah sesungguhnya bersama kalian, menolong kalian dan mengokohkan kalian. Allah akan mengganjar kalian atas jihad kalian dan kesabaran kalian serta amalan kalian yang shalih, dan tidak dikurangi sedikitpun dari pahala untuk kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni janganlah kamu lemah dan takut ketika bertemu dengan orang-orang kafir, bahkan bersabarlah dan tetap teguhlah serta kuatkanlah dirimu untuk berperang dan bersabar di dalamnya sambil mengharapkan keridhaan Tuhanmu, membela Islam dan membuat mereka murka. Dan janganlah kamu meminta damai karena ingin istirahat. Dengan memberikan bantuan dan pertolongan. Ketiga hal ini (lebih unggul, Allah bersama mereka (kaum mukmin) dan Dia tidak akan mengurangi amal mereka) menghendaki mereka untuk bersabar dan tidak bersikap lemah. Pertama, mereka lebih unggul, yakni telah sempurna segala sebab kemenangan dan mereka telah dijanjikan oleh Allah dengan janji-Nya yang benar. Seseorang tidaklah lemah kecuali apabila ia lebih kalah unggul oleh orang lain dan kurang jumlahnya dan persiapannya serta kekuatannya luar dan dalam. Kedua, Allah Subhaanahu wa Ta'aala bersama mereka, karena mereka kaum mukmin, sedangkan Allah bersama orang-orang mukmin dengan memberikan pertolongan dan bantuan-Nya. Hal ini menghendaki hati mereka menjadi kuat dan siap melawan musuh. Ketiga, Allah Subhaanahu wa Ta'aala tidak akan mengurangi amal mereka, bahkan akan menyempurnakan pahala mereka dan menambah dari sisi-Nya, terlebih dalam amalan jihad, maka infak untuknya akan dilipatgandakan sampai 700 kali lipat dan sampai kelipatan yang banyak. Allah Subhaanahu wa Ta'aala berfirman, “Tidaklah sepatutnya bagi penduduk Madinah dan orang-orang Arab Badui yang berdiam di sekitar mereka, tidak turut menyertai Rasulullah (berperang) dan tidak patut (pula) bagi mereka lebih mencintai diri mereka daripada mencintai diri rasul. Yang demikian itu ialah karena mereka tidak ditimpa kehausan, kepayahan dan kelaparan pada jalan Allah, dan tidak (pula) menginjak suatu tempat yang membangkitkan amarah orang-orang kafir, dan tidak menimpakan sesuatu bencana kepada musuh, melainkan dituliskanlah bagi mereka dengan yang demikian itu suatu amal saleh. Sesungguhnya Allah tidak menyia-nyiakan pahala orang-orang yang berbuat baik,” (Terj. At Taubah: 120) Jika seseorang mengetahui, bahwa Allah Subhaanahu wa Ta'aala tidak akan menyia-nyiakan amalnya dan jihadnya, maka hal itu mengharuskan dirinya semangat, mengerahkan kesungguhannya dalam hal yang membuahkan pahala yang besar. Lalu bagaimana jika ketiga hal ini (lebih unggul, Allah bersama mereka (kaum mukmin) dan Dia tidak akan mengurangi amal mereka) berkumpul bersama, tentu akan membuahkan semangat yang tinggi. Ini adalah dorongan dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya serta penguatan dari-Nya untuk menguatkan diri mereka terhadap sesuatu yang di sana terdapat kebaikan dan keberuntungan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 35",
    "description": "Maka janganlah kamu lemah dan takut bertempur melawan orang musyrik dan mengajak damai untuk mencari dalih menghindari pepe-rangan karena kamulah yang lebih unggul yakni lebih mulia dari mereka karena kebenaran yang kamu miliki dan kamu perjuangkan, dan Allah pun bersama kamu. Dia yang akan membela dan memenangkan kamu dan dia tidak akan berbuat aniaya kepadamu dengan mengurangi pahala segala amalmu. 36. Sesungguhnya kehidupan dunia itu bagi orang yang lengah hanyalah permainan yakni kegiatan tanpa tujuan yang benar dan senda gurau yang membawa kepada kelalaian. Jika kamu beriman kepada tuhanmu serta bertakwa dengan sebenar-benarnya dengan menunaikan perintan-Nya dan meninggalkan larangan-Nya, Allah akan memberikan pahala kepa-damu sebagai pembalasan dari amalmu dan dia tidak akan meminta hartamu, yakni dia tidak meminta hartamu seluruhnya melainkan hanya sebagian dari harta itu untuk diberikan kepada yang membutuhkan."
  }
]