[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-37. Sesungguhnya kehidupan dunia hanya permainan dan tipu daya. Bila kalian beriman kepada Allah dan RasulNya, serta bertakwa kepada Allah dengan menunaikan apa-apa yang Dia wajibkan dan menjauhi maksiat kepada-Nya, niscaya Allah memberi kalian pahala amal kalian. Allah tidak meminta kalian mengeluarkan seluruh harta kalian dalam zakat, sebaliknya Allah hanya meminta sebagian darinya. Bila Allah meminta seluruh harta kalian dan mendesak kalian mengeluarkannya, niscaya kalian menolaknya dan memegang harta kalian kuat-kuat, serta terlihatlah apa yang ada didalam hati kalian berupa kekikiran saat diminta dari kalian harta yang kalian tidak suka untuk mengeluarkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Kehidupan dunia hanyalah permainan dan senda gurau belaka, maka janganlah seorang yang berakal itu lalai dari amal Akhiratnya karena kehidupan dunia. Jika kalian beriman kepada Allah dan Rasul-Nya dan bertakwa kepada-Nya dengan mengerjakan segala perintah-perintah-Nya dan menjauhi segala larangan-larangan-Nya, niscaya Allah memberi kalian pahala amal perbuatan kalian secara sempurna, tidak dikurangi, dan Allah tidak meminta seluruh harta kalian, akan tetapi Dia meminta dari kalian yang wajib dari zakat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-37. Allah mendorong hamba-hamba-Nya agar tidak tamak kepada kehidupan dunia, dengan menyampaikan hakikat dari dunia bahwa ia hanyalah permainan jasad dan senda gurau hati. Jika kalian beriman kepada Allah dan bertakwa kepada-Nya dengan menjalankan segala perintah-Nya dan menjauhi segala larangan-Nya, maka Allah akan memberi pahala atas amalan kalian dan tidak meminta kalian menunaikan zakat dengan mengeluarkan seluruh harta yang kalian miliki, namun hanya memerintahkan mengeluarkan sebagiannya saja. Jika Allah meminta dengan paksa untuk mengeluarkan harta kalian, niscaya kalian akan berbuat kikir dan menolak untuk menjalankannya serta Allah akan menampakkan dari hati kalian sifat kebakhilan dan kebencian untuk berinfak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. إِنَّمَا الْحَيَوٰةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ ۚ (Sesungguhnya kehidupan dunia hanyalah permainan dan senda gurau) Yakni akan lenyap dan sirna, tidak akan berlangsung selamanya. وَإِن تُؤْمِنُوا۟ وَتَتَّقُوا۟ يُؤْتِكُمْ أُجُورَكُمْ(Dan jika kamu beriman dan bertakwa, Allah akan memberikan pahala kepadamu) Di akhirat kelak. Yakni pahala atas ketaatan kalian. وَلَا يَسْـَٔلْكُمْ أَمْوٰلَكُمْ (dan Dia tidak akan meminta harta-hartamu) Yakni Allah tidak memerintahkan kalian mengeluarkan zakat atau melakukan ketaatan lainnya dengan seluruh harta kalian, namun hanya memerintahkan untuk mengeluarkan sebagian saja."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Sesungguhnya, dunia dan segala kesibukannya hanyalah permainan (la’bun). Yaitu perbuatan atau kesibukan yang tidak membawa manfaat baik untuk kehidupan akhirat maupun untuk perkara-perkara yang penting. Kehidupan dunia juga berarti kesenangan sesaat (lahwun), yaitu segala sesuatu yang menyibukkan namun tidak bermanfaat. Namun jika kalian beriman kepada Allah dan rasul-Nya, bertakwa kepada-Nya dengan melaksanakan perintah dan menjauhi larangan-Nya maka Allah akan menganugerahkan pahala atas ketaatan kalian itu. Allah tidak memerintahkan kalian untuk mengeluarkan semua harta kalian, namun Allah hanya memerintahkan untuk mengeluarkan zakat wajib"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengurangi sedikitpun pahala amal kalian {Sesungguhnya kehidupan dunia itu hanyalah permainan dan senda gurau. Jika kalian beriman dan bertakwa, Allah akan memberi kalian} memberi kalian {pahala dan Dia tidak akan meminta harta-harta kalian} dan Dia tidak akan memerintahkan kalian untuk mengeluarkan seluruh harta kalian untuk berzakat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. Ini adalah dorongan dari Allah untuk hamba-hambaNya agar bersikap zuhud dalam kehidupan dunia, dengan cara memberitahukan mereka hakikat dunia, yaitu bahwa dunia adalah permainan dan senda gurau; permainan jasmaniah dan senda gurau dalam hati. Orang akan senantiasa bersenda gurau dengan harta, anak, perhiasan, kenikmatan yang di dapat dari istri, makanan, minuman, tempat tinggal, tempat duduk, pemandangan dan kepemimpinan, juga bermain-main dengan berbagai aktivitas yang tidak ada gunanya, justru berporos antara kebatilan, kellalaian dan kemaksiatan, hingga menghabiskan umur dunianya dan ajalnya tiba. Semua hal-hal duniawi akan berpaling dan meninggalkannya dan sedikit pun tidak akan didapatkan oleh seseorang, bahkan jelas-jelas Nampak kerugiannya, terhalang dari pahala serta datang siksanya. Hal ini mengharuskan mereka yang berakal untuk bersikap zuhud terhadap dunia, tidak terlalu mencintai dunia serta tidak terlalu mencurahkan perhatiannya pada keduniaan. Yang harus diperhatikan adalah seperti tang disebutkan dalam Firman Allah, “Dan jika kamu beriman serta bertakwa,” yakni beriman kepada Allah, para malaikatNya, kitab-kitabNya, rasul-rasulNya dan Hari Akhir, bertakwa kepada Allah yang merupakan keharusan serta tuntutan keimanan, yaitu beramal meniti ridhaNya secara terus menerus dan menjauhi kemaksiatan. Inilah yang bisa membawa manfaat bagi manusia dan yang seharusnya dijadikan perlombaan, diperhatikan dan diluangkan segenap usaha dalam mencarinya. Dan itulah yang dimaksudkan oleh Allah dari hamba-hambaNya sebagai rahmat dan kelembutan Allah kepada mereka agar mereka diberi balasan yang besar. Karena itulah Allah berfirman, “Dan jika kamu beriman serta bertakwa, maka Allah akan memberikan pahala kepadamu dan Dia tidak akan meminta harta-hartamu.” Artinya, Allah tidak ingin membebankan sesuatu yang memberatkan kalian dan tidak ingin menyusahkan kalian dengan mengambil harta kalian sehingga kalian hidup tanpa harta atau mengurangi sesuatu yang membahayakan kalian. Karena itulah Allah berfirman, “Jika Dia meminta harta kepadamu lalu mendesak kamu (supaya memberikan semuanya), niscaya kamu akan kikir dan Dia akan menampakkan kedengkian yang ada di hati karena kalian dituntut untuk mencurahkan sesuatu yang tidak kalian senangi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 36: Ketahuilah bahwasanya hakikat kehidupan dunia : Permainan, senda gurau dan tipuan, tidak selamanya dan juga tidak ada hisab. Maka jika kalian beriman kepada Allah dan Rasul-Nya ﷺ serta apa yang datang darinya, dan kalian jadikan antara diri kalian dan adzab Allah benteng dengan bertauhid dan mengerjakan apa yang Allah cintai dan ridhai, dan meninggalkan apa yang dibenci-Nya dan larang; Allah akan memberikan kalian pahala dan balasan di akhirat, Allah tidak menginginkan kalian terbebani dengan apa yang menyusahkan kalian dengan mengambil seluruh harta-harta kalian yang membahayakan kalian, sungguh Allah hanyalah memerintahkan kalian untuk mengeluarkan sedikit dari harta kalian dala zakat yang wajib bagi kalian, jika telah sampai nisab pada harta kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan pentazhidan (membuat zuhud/tidak suka) dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya terhadap kehidupan dunia, yaitu dengan memberitahukan hakikat keadaannya, bahwa dunia merupakan permainan dan sesuatu yang melalaikan, membuat badan bermain-main dan membuat hati lalai, sehingga seorang hamba senantiasa lalai oleh hartanya, anaknya, perhiasannya dan kesenangannya, seperti wanita, makanan, minuman, tempat tinggal dan lain-lain, sambil bermain-main dalam amal yang tidak ada faedahnya, bahkan berputar antara kesia-siaan, lalai dan maksiat sampai sempurna dunianya dan tiba ajalnya. Setelah semua ini ia tinggalkan, maka ia tidak akan memperoleh faedah apa-apa, bahkan akan memperoleh kerugian dan azab. Oleh karena itu, hal ini seharusnya membuat orang yang berakal zuhud kepadanya, tidak berharap, serta tidak peduli kepadanya, bahkan yang seharusnya ia perhatikan adalah iman dan takwa. Yakni beriman kepada Allah, malaikat-Nya, kitab-kitab-Nya, rasul-rasul-Nya, hari Akhir serta qadha’ dan qadar-Nya, dan mengerjakan ketakwaan yang menjadi bagian dari iman dan konsekwensinya, yakni dengan mengerjakan perbuatan yang diridhai-Nya secara istiqamah dan meninggalkan maksiat. Inilah yang bermanfaat bagi hamba, dan inilah yang seharusnya dikejar dan diberikan perhatian serta usaha yang serius dalam mengejarnya, dan itulah maksud yang diinginkan Allah dari hamba-hamba-Nya sebagai rahmat dan kelembutan-Nya kepada mereka agar Dia memberikan balasan yang besar untuk mereka. Dia tidak ingin membebanimu dengan sesuatu yang memberatkan kamu seperti meminta hartamu dikeluarkan semuanya atau meminta banyak dari hartamu sehingga memadharratkan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 36",
    "description": "Sesungguhnya kehidupan dunia itu bagi orang yang lengah hanyalah permainan yakni kegiatan tanpa tujuan yang benar dan senda gurau yang membawa kepada kelalaian. Jika kamu beriman kepada tuhanmu serta bertakwa dengan sebenar-benarnya dengan menunaikan perintan-Nya dan meninggalkan larangan-Nya, Allah akan memberikan pahala kepa-damu sebagai pembalasan dari amalmu dan dia tidak akan meminta hartamu, yakni dia tidak meminta hartamu seluruhnya melainkan hanya sebagian dari harta itu untuk diberikan kepada yang membutuhkan. 37. Akan tetapi Allah mengetahui sekiranya dia meminta harta kepada-Mu lalu mendesak kamu agar memberikan semuanya untuk berjihad niscaya kamu akan kikir sehingga tidak akan memberikannya karena kekikiranmu dan dia akan menampakkan kedengkianmu dikarenakan cintamu yang berlebihan kepada harta."
  }
]