[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "36-37. Sesungguhnya kehidupan dunia hanya permainan dan tipu daya. Bila kalian beriman kepada Allah dan RasulNya, serta bertakwa kepada Allah dengan menunaikan apa-apa yang Dia wajibkan dan menjauhi maksiat kepada-Nya, niscaya Allah memberi kalian pahala amal kalian. Allah tidak meminta kalian mengeluarkan seluruh harta kalian dalam zakat, sebaliknya Allah hanya meminta sebagian darinya. Bila Allah meminta seluruh harta kalian dan mendesak kalian mengeluarkannya, niscaya kalian menolaknya dan memegang harta kalian kuat-kuat, serta terlihatlah apa yang ada didalam hati kalian berupa kekikiran saat diminta dari kalian harta yang kalian tidak suka untuk mengeluarkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Jika Allah minta dari kalian seluruh harta kalian dan terus menerus dalam memintanya dari kalian niscaya kalian akan kikir dengannya, dan Allah mengeluarkan sifat tamak dan kikir yang ada dalam hati kalian, maka Allah membiarkan tidak memintanya dari kalian sebagai bentuk kelemah-lembutan-Nya terhadap kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. إِن يَسْـَٔلْكُمُوهَا (Jika Dia meminta harta kepadamu) Yakni harta kalian seluruhnya. فَيُحْفِكُمْ(lalu mendesak kamu) Para ahli tafsir mengatakan maknanya adalah memaksa kalian. تَبْخَلُوا۟ (niscaya kamu akan kikir) Dan menolak untuk menjalankan perintah. وَيُخْرِجْ أَضْغٰنَكُمْ (dan Dia akan menampakkan kedengkianmu) Yakni ketika itu kalian akan menampakkan kedengkian kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Jika Allah meminta/mendesak agar kalian mengeluarkan semua harta untuk diinfakkan di jalan-Nya, maka kalian pasti akan kikir dan enggan untuk melakukannya. Dan Allah akan menampakkan berbagai penyakit hati dari kalian seperti kedengkian, kikir, dan keenggannan untuk berinfak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Dia meminta harta itu kepada kalian} Jika Dia meminta kalian untuk memberikan seluruh harta kalian {lalu mendesak kalian} lalu memaksa meminta harta itu dari kalian {niscaya kalian akan kikir dan Dia akan menampakkan kedengkian kalian} kedengkian dan pertentangan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. Ini adalah dorongan dari Allah untuk hamba-hambaNya agar bersikap zuhud dalam kehidupan dunia, dengan cara memberitahukan mereka hakikat dunia, yaitu bahwa dunia adalah permainan dan senda gurau; permainan jasmaniah dan senda gurau dalam hati. Orang akan senantiasa bersenda gurau dengan harta, anak, perhiasan, kenikmatan yang di dapat dari istri, makanan, minuman, tempat tinggal, tempat duduk, pemandangan dan kepemimpinan, juga bermain-main dengan berbagai aktivitas yang tidak ada gunanya, justru berporos antara kebatilan, kellalaian dan kemaksiatan, hingga menghabiskan umur dunianya dan ajalnya tiba. Semua hal-hal duniawi akan berpaling dan meninggalkannya dan sedikit pun tidak akan didapatkan oleh seseorang, bahkan jelas-jelas Nampak kerugiannya, terhalang dari pahala serta datang siksanya. Hal ini mengharuskan mereka yang berakal untuk bersikap zuhud terhadap dunia, tidak terlalu mencintai dunia serta tidak terlalu mencurahkan perhatiannya pada keduniaan. Yang harus diperhatikan adalah seperti tang disebutkan dalam Firman Allah, “Dan jika kamu beriman serta bertakwa,” yakni beriman kepada Allah, para malaikatNya, kitab-kitabNya, rasul-rasulNya dan Hari Akhir, bertakwa kepada Allah yang merupakan keharusan serta tuntutan keimanan, yaitu beramal meniti ridhaNya secara terus menerus dan menjauhi kemaksiatan. Inilah yang bisa membawa manfaat bagi manusia dan yang seharusnya dijadikan perlombaan, diperhatikan dan diluangkan segenap usaha dalam mencarinya. Dan itulah yang dimaksudkan oleh Allah dari hamba-hambaNya sebagai rahmat dan kelembutan Allah kepada mereka agar mereka diberi balasan yang besar. Karena itulah Allah berfirman, “Dan jika kamu beriman serta bertakwa, maka Allah akan memberikan pahala kepadamu dan Dia tidak akan meminta harta-hartamu.” Artinya, Allah tidak ingin membebankan sesuatu yang memberatkan kalian dan tidak ingin menyusahkan kalian dengan mengambil harta kalian sehingga kalian hidup tanpa harta atau mengurangi sesuatu yang membahayakan kalian. Karena itulah Allah berfirman, “Jika Dia meminta harta kepadamu lalu mendesak kamu (supaya memberikan semuanya), niscaya kamu akan kikir dan Dia akan menampakkan kedengkian yang ada di hati karena kalian dituntut untuk mencurahkan sesuatu yang tidak kalian senangi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 37: Allah menjelaskan dari sisi hikmah dalam syariat-Nya; Allah mengabarkan bahwa seandainya Dia menuntut kalian untuk berinfak dengan semua harta kalian dan mewajibkan atas kalian dengannya; Maka sungguh kalian akan menjadi orang-orang yang bakhil dan terhalang dari perintah Allah dan yang akan nampak adalah kebencian dan kedengkian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Jika Dia meminta dari kamu mengeluarkan sesuatu yang tidak kamu sukai. Bukti bahwa jika Allah Subhaanahu wa Ta'aala meminta dari mereka harta mereka dengan mendesak mereka akan menolaknya adalah ketika mereka diajak menginfakkan harta di jalan Allah yang sesungguhnya terdapat maslahat agama maupun dunia padanya, ternyata di antara mereka ada yang bakhil, lalu bagaimana jika Dia meminta kepada mereka harta untuk hal yang belum mereka lihat maslahatnya secara segera, tentu mereka lebih menolaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 37",
    "description": "Akan tetapi Allah mengetahui sekiranya dia meminta harta kepada-Mu lalu mendesak kamu agar memberikan semuanya untuk berjihad niscaya kamu akan kikir sehingga tidak akan memberikannya karena kekikiranmu dan dia akan menampakkan kedengkianmu dikarenakan cintamu yang berlebihan kepada harta. 38. Ingatlah, wahai orang yang beriman, kamu adalah orang-orang yang diajak untuk menginfakkan sebagian dari hartamu di jalan Allah. Lalu di antara kamu yang diajak menafkahkan harta itu ada orang yang kikir, dan barangsiapa kikir maka sesungguhnya dia kikir terhadap dirinya sendiri dan merugikan diri sendiri, dan sedikit pun tidak merugikan kepada Allah. Dan Allah-lah yang mahakaya dan kamulah yang membutuhkan karunia-Nya. Karena itu jika kamu menyambut ajakan-Nya untuk bernafkah, kamu akan memperoleh keberuntungan dan jika kamu berpaling dari jalan yang benar dan menolak ajakan-Nya, dia akan membinasakan kamu dan menggantikan kamu dengan kaum yang lain, dan mereka tidak akan durhaka seperti kamu yang enggan menyambut ajakan Allah."
  }
]