[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Inilah kalian (wahai orang-orang Mukmin), kalian diajak untuk berinfak di jalan Allah dalam rangka memerangi musuh-musuhNya dan menolong agamaNya. Diantara kalian ada yang kikir tidak ingin berinfak di jalan Allah. Barangsiapa yang kikir, maka dia hanya kikir terhadap dirinya sendiri. Dan Allah Mahakaya, tidak membutuhkan kalian, sebaliknya kalianlah yang membutuhkan Allah. Bila kalian berpaling dari iman kepada Allah dan tidak menjalankan perintah-perintahNya, Dia bisa membinasakan kalian dan menghadirkan kaum yang lain, dan mereka tidak seperti kalian yang berpaling dari perintah Allah, sebaliknya mereka menaati Allah dan menaati rasulNya, serta berjihad di jalan Allah dengan harta dan jiwa mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Kalian adalah orang-orang yang diminta untuk menginfakkan sebagian dari harta kalian di jalan Allah, dan tidaklah diminta dari kalian untuk menginfakkan seluruh harta kalian, maka di antara kalian ada yang tidak mau berinfak sesuai aturan karena kikir dengan hartanya. Dan barangsiapa kikir dalam menginfakkan hartanya di jalan Allah sebenarnya ia hanya kikir terhadap dirinya sendiri dengan mengharamkan bagi dirinya pahala infak, dan Allah Mahakaya, tidak memerlukan infak kalian, sementara kalian butuh kepada-Nya. Jika kalian kembali dari Islam menuju pada kekufuran niscaya Dia akan menghancurkan kalian dan mendatangkan kaum selain kalian dan mereka tidak seperti kalian, akan tetapi mereka taat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Hai orang-orang beriman, kalian diajak untuk berinfak demi menolong agama Allah; namun sebagian kalian berbuat kikir dan enggan untuk berinfak. Barangsiapa yang kikir maka akibat dari kekikirannya akan kembali kepada dirinya sendiri dengan melewatkan pahala. Allah Maha Kaya, tidak membutuhkan kalian; sedangkan kalian membutuhkan-Nya. Jika kalian enggan mentaati-Nyya maka Allah akan mengganti kalian dengan kaum yang lain, dan kaum itu tidak akan seperti kalian dalam berpaling dari hukum-hukumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. هٰٓأَنتُمْ هٰٓؤُلَآءِ تُدْعَوْنَ لِتُنفِقُوا۟ فِى سَبِيلِ اللهِ (Ingatlah, kamu ini orang-orang yang diajak untuk menafkahkan (hartamu) pada jalan Allah) Yakni untuk berjihad dan kebaikan lainnya. فَمِنكُم مَّن يَبْخَلُ ۖ( Maka di antara kamu ada yang kikir) Yakni kikir dalam berinfak dengan sedikit dari hartanya, maka bagaimana kalian tidak kikir jika diminta untuk menginfakkan seluruh harta. وَمَن يَبْخَلْ فَإِنَّمَا يَبْخَلُ عَن نَّفْسِهِۦ ۚ( dan siapa yang kikir sesungguhnya dia hanyalah kikir terhadap dirinya sendiri) Yakni ia menghalangi dirinya mendapat pahala akibat kekikirannya. Dan jika kalian kikir dalam berinfak maka musuh akan mengalahkan kalian, sehingga kehormatan, harta, dan bahkan nyawa kalian akan hilang. وَاللهُ الْغَنِىُّ(Dan Allah-lah yang Maha Kaya) Tidak butuh terhadap harta kalian. وَأَنتُمُ الْفُقَرَآءُ ۚ( sedangkan kamulah orang-orang yang membutuhkan-Nya) Yakni membutuhkan Allah dan membutuhkan kebaikan dan rahmat dari-Nya. وَإِن تَتَوَلَّوْا۟ يَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ(an jika kamu berpaling niscaya Dia akan mengganti (kamu) dengan kaum yang lain) Yakni jika kalian enggan beriman dan bertakwa maka akan akan mendatangkan kaum yang lain yang mengganti posisi kalian, dan mereka akan lebih taat kepada Allah daripada kalian. ثُمَّ لَا يَكُونُوٓا۟ أَمْثٰلَكُم (dan mereka tidak akan seperti kamu ini) Tidak seperti kaliandalam keengganan untuk beriman dan bertakwa serta dalam kekikiran untuk berinfak di jalan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Ingat, bahwa kalianlah orang-orang mukmin yang diperintahkan untuk mengeluarkan harta kalian untuk berjuang di jalan Allah dengan mengeluarkan zakat, keperluan perang dan sebagainya. Namun di antara kalian masih ada orang-orang yang kikir untuk mengeluarkan hartanya. Maka barang siapa enggan untuk mengeluarkan zakat dan sedekah sesungguhnya dia kikir terhadap dirinya sendiri. Dia menghalangi kebaikan datang kepada dirinya sendiri. Mereka menyia-nyiakan pahala kebaikan. Sungguh Allah Maha Kaya dan tidak membutuhkan harta kalian. Kalianlah yang membutuhkan Allah. Jika kalian menolak untuk taat kepada Allah, maka Allah akan menciptakan pengganti kalian, mereka tidak akan seperti kalian yang menolak untuk beriman dan melakukan ketaatan. Mereka tidak akan kikir untuk mengeluarkan hartanya untuk kepentingan perjuangan agama Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ingatlah bahwa kalian adalah orang-orang yang diajak untuk menginfakkan di jalan Allah. Lalu di antara kalian ada orang yang kikir. Padahal siapa saja yang kikir maka sesungguhnya dia kikir terhadap dirinya sendiri} untuk diri sendiri {Allahlah Dzat Yang Maha kaya dan kalian adalah yang fakir. Jika kalian berpaling} kalian berpaling {Dia akan menggantikan (kalian) dengan kaum selain kalian dan mereka tidak seperti kalian}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Dalil bahwa Allah, seandainya menuntut dan meminta harta kalian berkali-kali , pasti kalian tidak akan memberi, adalah bahwa kalian “diajak untuk menafkahkan (hartamu) pada jalan Allah,” dalam bentuk tadi yang disitulah terdapat kebaikan kalian, baik duniawi maupun ukhrawi, “maka di antara kamu ada orang yang kikir.” Artinya, bagaimana seandainya Allah meminta dan menuntut harta kalian di luar hal yang menurut kalian tidak terdapat maslahatnya secara langsung, bukankah hal itu lebih membuat kalian untuk tidak memberikan harta? Selanjutnya Allah berfirman, “dan siapa yang kikir, sesungguhnya dia hanyalah kikir terhadap dirinya sendiri.” Karena itu artinya dia mencegah dirinya sendiri untuk mendapatkan pahala dari Allah dan dengan demikian ia kehilangan kebaikan yang banyak. Ia tidak berinfak pun sama sekali tidak membahayakan Allah, karena sesungguhnya Allah “Mahakaya sedangkan kamulah orang-orang yang membutuhkan (Nya),” yakni memerlukanNya di seluruh waktu dan dalam berbagai urusan kalian. “Dan jika kamu berpaling,” dari iman kepada Allah dan menunaikan perintahNya, “niscaya Dia akan mengganti (kamu) dengan kaum yang lain, dan mereka tidak akan seperti kamu (ini).” Artinya, tidak seperti kalian yang berpaling, tapi kaum ini menaati Allah dan RasulNya serta mencintai Allah dan RasulNya sebagaimana yang disebutkan dalam Firman Allah, “Hai orang-orang yang beriman, barangsiapa di antara kamu yang murtad dari agamanya, maka kelak Allah akan mendatangkan suatu kaum yang Allah mencintai mereka dan merekapun mencintai-Nya”-Al-Maidah:54-"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 38: Allah menutup surat ini dengan membahas infak, jihad di jalan Allah dengan raga dan harta, Allah berkata : Ingatlah kalian wahai orang-orang yang beriman, kalian diseru untuk berinfak dalam jihad kepada musuh-musuh Allah dan Kami yang menolong agama kalian. Maka di antara kalian wahai manusia ada yang bakhil berinfak ketika berjihad di jalan Allah, barangsiapa yang bakhil, maka dia bakhil dengan dirinya sendiri; Karena apa yang telah lalu dari sedekah kalian akan menjadi tumpukan pahala di akhirat kelak. Ketahuilah bahwa Allah adalah Maha Kaya dibandingkan kalian dan kalian adalah faqir yang membutuhkan Allah dalam pertolongan dan taufik, maka jika kalian menolok untuk beriman kepada Allah dan mengerjakan amalan yang diperintahkan; Sungguh kalian akan celaka, dan Allah akan gantikan pengganti kalian (kaum) yang lain kemudian di bumi tidak akan jauh dari kebaikan; Akan tetapi mereka akan mentaati Allah dan Rasul-Nya ﷺ, dan berjihad di jalan Allah dengan harta dan raga."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena dia telah menghalangi pahala Allah untuk dirinya dan banyak kebaikan yang hilang, dan hal itu juga tidak merugikan Allah meskipun sedikit. Kamu selalu membutuhkan-Nya di setiap waktu untuk segala urusan kamu. Bahkan mereka akan taat kepada Allah dan Rasul-Nya dan mencintai Allah dan Rasul-Nya sebagaimana firman-Nya di ayat lain, “Wahai orang-orang yang beriman! Barang siapa di antara kamu yang murtad dari agamanya, maka kelak Allah akan mendatangkan suatu kaum yang Allah mencintai mereka dan merekapun mencintai-Nya,…dst.” (Terj. Al Maa’idah: 54)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 38",
    "description": "Ingatlah, wahai orang yang beriman, kamu adalah orang-orang yang diajak untuk menginfakkan sebagian dari hartamu di jalan Allah. Lalu di antara kamu yang diajak menafkahkan harta itu ada orang yang kikir, dan barangsiapa kikir maka sesungguhnya dia kikir terhadap dirinya sendiri dan merugikan diri sendiri, dan sedikit pun tidak merugikan kepada Allah. Dan Allah-lah yang mahakaya dan kamulah yang membutuhkan karunia-Nya. Karena itu jika kamu menyambut ajakan-Nya untuk bernafkah, kamu akan memperoleh keberuntungan dan jika kamu berpaling dari jalan yang benar dan menolak ajakan-Nya, dia akan membinasakan kamu dan menggantikan kamu dengan kaum yang lain, dan mereka tidak akan durhaka seperti kamu yang enggan menyambut ajakan Allah. 1. Sungguh, kami telah memberikan kepadamu kemenangan yang nyata yang tidak ada keraguan sedikitpun tentang kemenangan itu."
  }
]