[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-6. Bila kalian (wahai orang-orang beriman) bertemu orang-orang kafir di medan perang, maka hadapilah mereka dengan gagah berani, tebaslah leher-leher mereka, hingga apabila kalian telah melemahkan mereka dengan banyaknya korban dari pihak mereka, kalian memporak-porandakan kekuatan mereka, maka hendaklah kalian memantapkan membelenggu para tawanan dari mereka, dan setelah itu kalian boleh berbuat baik dengan melepaskan tawanan mereka tanpa imbalan, atau mereka bisa menebus diri mereka dengan uang atau semacamnya, atau mereka jadikan budak atau di hukum mati. Lakukan itu terus hingga perang usai. Hukum di atas, yaitu Allah menguji orang-orang Mukmin dengan orang-orang kafir, dan menjadikan hari-hari berputar di antara mereka, adalah keputusan Allah. Bila Allah berkehendak, Allah bisa membuat orang-orang Mukmin menang atas orang-orang kafir tanpa perang. Tetapi Allah berkehendak menghukum orang-orang kafir melalui tangan orang-orang kalian. Maka Allah mensyariatkan jihad karena Allah hendak menguji kalian dengan orang-orang kafir dan hendak memenangkan agamaNya dengan tangan kalian. Orang-orang yang terbunuh di jalan Allah dari kalangan orang-orang beriman, Allah tidak akan membatalkan pahala amal-amal mereka. Allah akan membimbing mereka saat mereka hidup di dunia kepada ketaatan dan keridhaanNya, memperbaiki keadaan dan urusan mereka serta pahala mereka di dunia dan akhirat. Allah memasukkan mereka ke dalam surga yang telah Dia jelaskan dan terangkan kepada mereka. Allah membimbing mereka untuk menegakkan perintah-perintahNya (yang diantaranya adalah jihad di jalan Allah yang kemudian mati syahid di jalanNya). Kemudian Allah akan menunjukkan kedudukan mereka di surga bila mereka memasukinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Jika kalian -wahai orang-orang yang beriman- bertemu dengan orang-orang kafir yang memerangi kalian, maka tebaslah leher mereka dengan pedang kalian, dan teruslah perangi mereka sehingga kalian memperbanyak kematian di antara mereka (mengalahkan mereka) lalu kalian menundukkan kekuatan senjata mereka. Jika kalian telah memperbanyak kematian di antara mereka maka kencangkan tali ikatan para tawanan. Jika kalian telah menawan mereka, maka kalian mempunyai pilihan yang sesuai dengan maslahat, antara membebaskan mereka tanpa tebusan, menuntut tebusan dengan harta atau lainnya, membunuh mereka atau menjadikan mereka budak. Teruslah memerangi dan menawan mereka sehingga perang berhenti dengan keislaman orang-orang kafir atau adanya perjanjian dengan mereka. Yang telah disebutkan itu -dari cobaan orang-orang yang beriman dengan orang-orang kafir dan pergantian hari-hari serta kemenangan sebagian atas sebagian yang lain- adalah hukum Allah. Jika Allah menghendaki kemenangan melawan orang-orang kafir tanpa peperangan, niscaya terjadilah kemenangan melawan mereka, akan tetapi Allah mensyariatkan jihad untuk menguji sebagian dengan sebagian yang lain; orang yang berperang dari kalangan orang-orang yang beriman dan orang-orang yang tidak ikut berperang diuji, orang-orang kafir diuji dengan orang-orang yang beriman, jika seorang mukmin terbunuh maka ia masuk Surga, dan jika orang kafir dibunuh oleh orang mukmin maka ia masuk Neraka. Dan orang-orang yang terbunuh di jalan Allah maka Allah tidak akan menyia-nyiakan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-6. Allah mendorong orang-orang beriman agar melawan musuh dari golongan orang-orang kafir di medan peperangan dan menghancurkan kekuatan mereka. Jika kalian bertemu dengan mereka maka lawanlah mereka dengan tehnik peperangan terbaik, dan pukul-lah leher, kepala, tangan, dan kaki mereka. Hingga saat kalian telah menjadikan mereka lemah karena banyak terbunuh, maka ikatlah dengan baik para tawanan, kemudian kalian dapat memilih dalam memperlakukan mereka; baik itu kalian lepaskan mereka setelah berhenti peperangan tanpa mengambil tebusan, atau meminta mereka tebusan berupa harta atau pertukaran tawanan. Hendaklah itu yang kalian lakukan hingga selesai peperangan, itulah perintah dan ketetapan yang tegas. Seandainya Allah menghendaki niscaya Allah akan memenangkan orang-orang beriman dalam menghadapi orang-orang kafir tanpa melalui peperangan, akan tetapi Allah hendak menguji kalian dengan mensyariatkan jihad sebagai jalan menolong agama-Nya. Dan orang-orang yang terbunuh demi meninggikan kalimat Allah maka amalan mereka tidak akan sia-sia, Allah akan memberi mereka taufik menuju jalan surga dan memperbaiki urusan mereka di akhirat dengan mengampuni dosa-dosa mereka, Allah akan memasukkan mereka ke dalam surga dari delapan pintunya, dan menunjukkan tempat dan kedudukan mereka di surga."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. فَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا۟ فَضَرْبَ الرِّقَابِ (Apabila kamu bertemu dengan orang-orang kafir (di medan perang) maka pancunglah batang leher mereka) Ini merupakan perintah untuk memerangi orang-orang kafir, yaitu orang-orang musyrik dan Ahli Kitab yang tidak memiliki perjanjian damai dengan kaum muslimin. Yakni pukullah leher mereka dengan pedang. Hal ini karena pembunuhan lebih banyak dengan memotong leher dan memenggal kepala yang merupakan anggota badan yang paling tinggi. Ayat ini merupakan dorongan untuk bersikap tegas dan tanpa basa-basi dalam menghadapi orang-orang kafir harbi. حَتَّىٰٓ إِذَآ أَثْخَنتُمُوهُمْ(Sehingga apabila kamu telah mengalahkan mereka) Yakni jika kalian telah membunuh sebagian besar mereka dan menghabiskan kekuatan mereka, sehingga mereka mundur tanpa kekuatan seperti lelaki yang lemah karena luka-luka. فَشُدُّوا۟ الْوَثَاقَ(maka tawanlah mereka) Agar mereka tidak kabur. Yakni tawan dan ikatlah mereka dengan belenggu. فَإِمَّا مَنًّۢا بَعْدُ وَإِمَّا فِدَآءً(dan sesudah itu kamu boleh membebaskan mereka atau menerima tebusan) Yakni baik itu kalian lepaskan mereka atau kalian mintai tebusan. Makna (المن) yakni membebaskan tanpa tebusan. Sedangkan (الفداء) yakni harta yang dipakai oleh tawanan untuk menebus dirinya. Allah tidak menyebutkan pilihan untu membunuh mereka dalam kalimat ini karena telah disebutkan sebelumnya. حَتَّىٰ تَضَعَ الْحَرْبُ أَوْزَارَهَا ۚ( sampai perang berakhir) Yakni agar tidak ada lagi peperangan dengan orang-orang kafir. Pendapat lain mengatakan, yakni sampai musuh-musuh yang memerangi meletakkan senjata mereka, baik itu karena kekalahan merkea atau karena perjanjian damai. Ayat ini tetap berlaku hukumnya (tidak dinasakh). Seorang pemimpin kaum muslimin sebelum melemahkan musuhnya hanya dibolehkan membunuh mereka saja, adapun setelah kelemahnya pasukan musuh maka ia boleh memilih antara membebaskan mereka atau meminta tebusan dan boleh juga membunuh tawanan itu jika kemaslahatan mengharuskan itu. Namun pembebasan dan penebusan tidak dapat dilakukan kecuali setelah mengalahkan musuh, hal ini sebagaimana firman Allah: ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض “Tidak patut, bagi seorang Nabi mempunyai tawanan sebelum ia dapat melumpuhkan musuhnya di muka bumi.” (Al-Anfal:67) ذٰلِكَ وَلَوْ يَشَآءُ اللهُ لَانتَصَرَ مِنْهُمْ(Demikianlah apabila Allah menghendaki niscaya Allah akan membinasakan mereka) Yakni itulah ketetapan bagi orang-orang kafir. Allah berkuasa untuk membalas mereka dengan kebinasaan dan mengazab mereka dengan jenis azab yang Dia kehendaki tanpa peperangan dari kalian hai orang-orang beriman. وَلٰكِن (tetapi) Perintah bagi kalian untuk memerangi mereka. لِّيَبْلُوَا۟ بَعْضَكُم بِبَعْضٍ ۗ (Allah hendak menguji sebahagian kamu dengan sebahagian yang lain) Sehingga Dia mengetahui orang-orang yang berjihad di jalan-Nya dan yang bersabar terhadap ujian-Nya serta mengagungkan pahala mereka dan mengazab orang-orang kafir lewat tangan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Apabila kalian bertemu dengan musuh kalian di medan perang, yaitu orang-orang musyrik yang memerangi kalian, juga para ahli kitab yang mengingkari janji mereka untuk taat. Maka bunuhlah mereka dengan tebasan pedang kalian pada batang leher mereka dengan kuat. Kalimat tersebut adalah kalimat majas yang biasanya digunakan dalam peperangan, karena cara membunuh musuh dalam peperangan yang sering dilakukan adalah dengan menebas leher. Sehingga jika kalian telah mengalahkan mereka dengan membunuh dan melukai mereka. Atau juga kalian telah banyak membunuh dan menaklukkan mereka, maka tawan dan lakukan perjanjian pada mereka untuk membayar tebusan atau yang lainnya sebagai ganti untuk membebaskan mereka. Apabila peperangan.telah selesai, mungkin jika kalian menghendaki ingin membebaskan mereka atau meminta tebusan berupa tawanan muslim atau harta sampai perang tersebut berakhir. Sehingga sampai tidak tersisa kecuali orang-orang muslim dan kedamaian. Al auzar adalah tebusan berupa senjata, kuda, dan alat perang lainnya, baik alat berat maupun ringan. Itulah aturan dalam memerangi orang kafir yang memusuhi Islam. Allah Maha Kuasa untuk menolong orang-orang Islam meskipun tanpa berperang dengan menggagalkan, menenggelamkan atau menguncangkan mereka (gempa). Namun Allah memerintahkan kalian memerangi mereka, untuk menguji kalian dengan orang-orang kafir. Yaitu ujian untuk berjihad, dan bersabar atas ujian, sehingga dengan itu orang-orang mukmin mendapatkan pahala dan orang kafir mendapatkan siksa. Orang-orang yang berjihad untuk meninggikan kalimat Allah dan mengharap keridhoan-Nya tidak akan pernah dikurangi pahala amalnya oleh Allah. Bahkan Allah akan memberi mereka pahala dan balasan yang sempurna dan mulia. Qatadah memberi tanggapan tentang ayat Dan orang-orang yang berperang di jalan Allah bahwa ayat ini turun pada hari Ahad"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka apabila kalian bertemu dengan orang-orang yang ingkar (ketika berperang), maka tebaslah leher mereka} maka tebaslah leher mereka {Sehingga apabila kalian telah mengalahkan mereka} kalian lebih banyak membunuh mereka {maka tawanlah mereka} maka ikatlah mereka untuk ditawan {Lalu setelah iru, kalian boleh membebaskan mereka} membebaskan dari tawanan dengan tanpa tebusan {atau menerima tebusan} diganti dengan harta, atau tawanan muslim {sampai perang selesai} sampai perang berakhir, sehingga tidak ada yang tersisa kecuali orang muslim atau kedamaian {Demikianlah. Sekiranya Allah menghendaki, niscaya Dia menolong dari mereka. Akan tetapi, Dia hendak menguji} menguji {sebagian kalian dengan sebagian yang lain. Orang-orang yang terbunuh di jalan Allah, Dia tidak menyia-nyiakan} tidak membatalkan {amal-amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah berfirman memberikan petunjuk pada para hambaNya kepada kebaikan mereka serta memberikan pertolongan pada mereka atas musuh-musuh mereka, “apabila kamu bertemu dengan orang-orang kafir,” dalam peperangan, maka perangilah mereka dan tebaslah leher-leher mereka agar kalian dapat mengalahkan mereka, agar kalian dapat membasmi halangan karena keburukan mereka. Jika kalian telah melakukan hal itu dan kalian melihat para tawanan, maka lebih utama dan lebih baik adalah “kencangkanlah ikatan,” yakni dengan diikat sebagai tindakan preventif agar para tawanan tidak lari, jika mereka telah diikat, maka kaum Muslimin pun merasa tenang hatinya setelah memerangi orang-orang kafir dan merasa tenang dari keburukan mereka. Ketika orang-orang kafir berada dalam tawanan kalian, maka kalian memiliki pilihan antara membebaskan mereka tanpa imbalan harta ataupun dibebaskan dengan tebusan dari mereka, atau ditukar oleh orang-orang kafir dengan harta atau dengan tawanan Muslim yang ada di tangan mereka. Hal ini tetap berlangsung “sampai perang berhenti.” Hingga perang tidak ada lagi dan kalian berada dalam gencatan senjata dan perjanjian, karena dalam setiap tempat itu ada pembahasannya sendiri dan setiap kondisi itu memiliki hukum tersendiri. Kondisi di atas hanya berlaku ketika terjadinya perang, jika ternyata pada sebagian kesempatan tidak ada peperangan karena adanya suatu sebab, maka tidak boleh terjadi serangan maupun tawanan. “Demikianlah,” hukum yang telah disebutkan tentang kaum Mukminin yang diuji dengan perang terhadap kaum kafir serta saling bergantinya hari di antara mereka dan juga kemenangan yang silih berganti. “Apabila Allah memghendaki, niscaya Allah akan membinasakan mereka,” karena sesungguhnya Allah Mahakuasa atas segala sesuatu dan Kuasa untuk membuat orang-orang yang tidak menang dalam suatu peperangan pun hingga orang-orang Muslim bisa menghabisi semua orang kafir yang ada, “tetapi Allah hendak menguji sebagian kamu dengan sebagian yang lain,” agar jihad berdiri, yang dengan jihad ini dapat diketahui dengan jelas kondisi hamba-hamba Allah yang benar dan yang berdusta. Dan agar orang yang beriman memiliki keimanan yang benar, berdasarkan pengetahuan yang benar bukan karena mengikuti pihak yang menang, karena keimanan pihak yang menang adalah keimanan yang lemah yang hampir tidak bertahan ketika tertimpa berbagai musibah dan ujian. “Dan orang-orang yang gugur di jalan Allah,” akan mendapatkan pahala yang besar. Mereka adalah orang-orang yang memerangi kaum yang diperintahkan agar diperangi, agar kalimat Allah tinggi, mereka itulah orang-orang yang “Allah tidak akan menyia-nyiakan amal mereka.” Artinya, tidak digugurkan dan tidak dihapus, tapi diterima dan diperbanyak untuk mereka dan hasil dari amalan-amalan baik mereka itu akan Nampak di dunia dan di akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 4: Allah memerintahkan orang-orang yang beriman ketika bertemu dengan orang-orang kafir di peperangan yang berkecamuk agar mengajak orang-orang kafir masuk islam; Jika mereka mengabaikan ketika terjadi peperangan, maka wajib bagi kalian untuk menyerang leher-leher mereka, dan terus dalam keadaan menyerang sampai mereka binasa karena terbunuh, setelah itu ikatlah mereka sebagai tawanan perang, kemudian tunggulah sampai keadaan mereka membaik dan berikan pilihan yaitu mungkin dengan menjadi budak, dibunuh atau membayar fidyah, ini semua dikerjakan oleh pemimpin, maka wajib bagi kalian mengerjakan hal ini hingga selesai peperangan, ketahuilah bahwa yang telah disebutkan sebelumnya dari hukum-hukum adalah kebenaran yang diperintahkan Allah kepada kalian. Seandainya Allah berkehendak Allah mampu menghukumi kafir secara langsung dengan tanpa menuntut kepada kaum muslimin untuk berperang dan jihad, akan tetapi Allah menginginkan menginginkan adzab dengan tangan-tangan kaum muslimin dan dengannya memerintahkan kalian untuk berjihad, sebagai pelajaran bagi kalian dan mereka serta untuk menolong agama dan syariat Allah. Kemudian Allah mengabarkan bahwa mereka yang membunuh di jalan Allah tidak akan Allah hapuskan amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala membimbing hamba-hamba-Nya kepada sesuatu yang menjadi maslahat bagi mereka dan dapat memenangkan mereka terhadap musuh-musuh-Nya. Yakni jika kamu melihat bahwa menawan itu lebih baik. Jika mereka telah ditawan, maka kaum muslimin dapat menjadi tenang dari kejahatan mereka dan larinya mereka. Tanpa harta dan tanpa tebusan. Yaitu dengan tidak melepaskan mereka sampai mereka membeli diri mereka atau dibeli oleh kawan-kawan mereka dengan harta, atau mengganti dengan seorang muslim yang tertawan. Yaitu dengan masuknya mereka ke dalam Islam atau masuk ke dalam perjanjian. Atau maksudnya sampai tidak ada lagi peperangan. Oleh karena itu, apabila dalam sebagian waktu tidak ada peperangan karena suatu sebab, maka tidak ada pembunuhan dan penawanan. Yakni diujinya orang-orang mukmin dengan orang-orang kafir, digilirkannya kemenangan di antara mereka, dan menangnya sebagian mereka atas sebagian yang lain. Tanpa perlu mengadakan peperangan karena Dia Mahakuasa atas segala sesuatu, Dia berkuasa agar orang-orang kafir tidak bisa menang di satu medan pertempuran pun. Agar tegak pasar jihad, dan agar jelas keadaan hamba, yang benar dari yang dusta, dan agar beriman orang yang beriman di atas bashirah (ilmu), bukan iman atas dasar ikut-ikutan, karena hal itu adalah iman yang lemah, dimana hampir saja tidak langgeng pada seseorang saat menghadapi ujian dan cobaan. Agar kalimat-Nya tinggi, maka bagi mereka pahala yang besar. Yakni Allah tidak akan menghapuskannya dan membatalkannya, bahkan Dia akan menerimanya dan menumbuhkannya untuk mereka serta memperlihatkan hasil amal mereka di dunia dan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 4",
    "description": "4-6. Pada ayat yang lalu dan beberapa ayat sebelumnya dijelaskan ciri-ciri orang kafir dan perbuatan mereka menghalang-halangi orang-orang yang beribadah kepada Allah. Ayat ini memberikan tuntunan tentang perbuatan yang harus dilakukan kaum muslim terhadap mereka. Maka apabila kamu bertemu dengan orang-orang yang kafir yang memerangi kamu di medan perang, maka pukullah batang leher mereka, yakni perangilah dengan cara memukul batang leher mereka, itulah cara yang paling baik untuk melumpuhkan kekuatan mereka. Selanjutnya apabila kamu telah mengalahkan mereka, maka tawanlah yang masih hidup dari mereka, dan setelah itu kamu boleh membebaskan mereka tanpa tebusan atau membebaskan mereka dengan menerima tebusan berupa harta atau tukar menukar tawanan. Itulah yang kamu lakukan sampai perang selesai dan semua yang terlibat dalam peperangan meletakkan senjata. Demikianlah ketentuan yang telah ditetapkan Allah, dan sekiranya Allah menghendaki, niscaya dia membinasakan mereka tanpa melibatkan orang-orang mukmin untuk berperang, tetapi dia hendak menguji kamu satu sama lain dengan mewajibkan orang-orang mukmin memerangi orang-orang kafir yang memusuhi mereka. Orang-orang kafir yang mati dalam peperangan adalah orang-orang yang celaka di dunia dan di akhirat mendapat azab tuhan. Dan orang-orang mukmin yang gugur di dalam peperangan pada jalan Allah, Allah tidak menyia-nyiakan amal mereka, tetapi memberikan kepada mereka pahala yang besar. Allah akan memberi petunjuk kepada mereka menuju jalan kebahagiaan dan memperbaiki keadaan mereka baik di dunia maupun akhirat, dan memasukkan mereka ke dalam surga yang telah diperkenalkan-Nya kepada mereka segala keindahan dan kenikmatan di dalamnya"
  }
]