[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "4-6. Bila kalian (wahai orang-orang beriman) bertemu orang-orang kafir di medan perang, maka hadapilah mereka dengan gagah berani, tebaslah leher-leher mereka, hingga apabila kalian telah melemahkan mereka dengan banyaknya korban dari pihak mereka, kalian memporak-porandakan kekuatan mereka, maka hendaklah kalian memantapkan membelenggu para tawanan dari mereka, dan setelah itu kalian boleh berbuat baik dengan melepaskan tawanan mereka tanpa imbalan, atau mereka bisa menebus diri mereka dengan uang atau semacamnya, atau mereka jadikan budak atau di hukum mati. Lakukan itu terus hingga perang usai. Hukum di atas, yaitu Allah menguji orang-orang Mukmin dengan orang-orang kafir, dan menjadikan hari-hari berputar di antara mereka, adalah keputusan Allah. Bila Allah berkehendak, Allah bisa membuat orang-orang Mukmin menang atas orang-orang kafir tanpa perang. Tetapi Allah berkehendak menghukum orang-orang kafir melalui tangan orang-orang kalian. Maka Allah mensyariatkan jihad karena Allah hendak menguji kalian dengan orang-orang kafir dan hendak memenangkan agamaNya dengan tangan kalian. Orang-orang yang terbunuh di jalan Allah dari kalangan orang-orang beriman, Allah tidak akan membatalkan pahala amal-amal mereka. Allah akan membimbing mereka saat mereka hidup di dunia kepada ketaatan dan keridhaanNya, memperbaiki keadaan dan urusan mereka serta pahala mereka di dunia dan akhirat. Allah memasukkan mereka ke dalam surga yang telah Dia jelaskan dan terangkan kepada mereka. Allah membimbing mereka untuk menegakkan perintah-perintahNya (yang diantaranya adalah jihad di jalan Allah yang kemudian mati syahid di jalanNya). Kemudian Allah akan menunjukkan kedudukan mereka di surga bila mereka memasukinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Allah akan memberikan taufik kepada mereka untuk mengikuti kebenaran di kehidupan dunia mereka dan memperbaiki kondisi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. سَيَهْدِيهِمْ (Allah akan memberi petunjuk kepada mereka) Menuju jalan ke surga. وَيُصْلِحُ بَالَهُمْ (dan memperbaiki keadaan mereka) Yakni urusan dan keadaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Allah akan membimbing dan memberi petunjuk kepada mereka yang masih hidup kepada jalan menuju surga. Allah akan memperbaiki keadaan mereka di akhirat dengan mengampuni kesalahan dan dosa mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia akan memberi petunjuk kepada mereka dan memperbaiki keadaannya} perkara dan keadaan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Allah akan memberi petunjuk kepada mereka,” untuk menempuh jalan yang menghantarkan mereka ke surga, “dan memperbaiki keadaan mereka,” yakni, kondisi dan perihal mereka; pahala mereka sempurna dan baik, tidak ada kotoran dan kekurangan sama sekali."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 5: 5-6. Allah menejelaskan bahwa mereka para syuhada karena sebab ketaatan mereka akan diberikan petunjuk menuju keridhaan-Nya dan jalan untuk sampai ke surga, dan Allah akan perbaiki urusan dunia dan akhiratnya serta hati-hati dan niat-niat mereka, kemudian di akhirat mereka akan dimasukkan ke dalam surga yang penuh nikmat sepanjang mereka mengingingkan memasukinya. Allah telah mengabarkan dan mensifati kenikmatan tersebut kepada mereka, sehingga mereka rindu dan ingin masuk surga, dan mereka bergegas dalam beramal untuk mendapatkan kemenangann yang mengantarkan kepada surga, yang di antaranya adalah jihad di jalan Allah dan Allah juga telah mengabarkan kedudukan mereka di surga, maka jika mereka memasukinya mereka akan langsung pergi menuju ke dalam derajat/kedudukan yang telah ditentukan secara langsung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menempuh jalan ke surga. Yakni keadaan, urusan dan pahala mereka sehingga menjadi baik dan sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 5",
    "description": "4-6. Pada ayat yang lalu dan beberapa ayat sebelumnya dijelaskan ciri-ciri orang kafir dan perbuatan mereka menghalang-halangi orang-orang yang beribadah kepada Allah. Ayat ini memberikan tuntunan tentang perbuatan yang harus dilakukan kaum muslim terhadap mereka. Maka apabila kamu bertemu dengan orang-orang yang kafir yang memerangi kamu di medan perang, maka pukullah batang leher mereka, yakni perangilah dengan cara memukul batang leher mereka, itulah cara yang paling baik untuk melumpuhkan kekuatan mereka. Selanjutnya apabila kamu telah mengalahkan mereka, maka tawanlah yang masih hidup dari mereka, dan setelah itu kamu boleh membebaskan mereka tanpa tebusan atau membebaskan mereka dengan menerima tebusan berupa harta atau tukar menukar tawanan. Itulah yang kamu lakukan sampai perang selesai dan semua yang terlibat dalam peperangan meletakkan senjata. Demikianlah ketentuan yang telah ditetapkan Allah, dan sekiranya Allah menghendaki, niscaya dia membinasakan mereka tanpa melibatkan orang-orang mukmin untuk berperang, tetapi dia hendak menguji kamu satu sama lain dengan mewajibkan orang-orang mukmin memerangi orang-orang kafir yang memusuhi mereka. Orang-orang kafir yang mati dalam peperangan adalah orang-orang yang celaka di dunia dan di akhirat mendapat azab tuhan. Dan orang-orang mukmin yang gugur di dalam peperangan pada jalan Allah, Allah tidak menyia-nyiakan amal mereka, tetapi memberikan kepada mereka pahala yang besar. Allah akan memberi petunjuk kepada mereka menuju jalan kebahagiaan dan memperbaiki keadaan mereka baik di dunia maupun akhirat, dan memasukkan mereka ke dalam surga yang telah diperkenalkan-Nya kepada mereka segala keindahan dan kenikmatan di dalamnya"
  }
]