[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang membenarkan Allah dan RasulNya serta melaksanakan syariatNya, bila kalian menolong agama Allah melalui jihad di jalanNya, menjadikan kitabNya sebagai hakim, melaksnakan perintah-perintahNya dan menjauhi larangan-laranganNya, niscaya Allah memenangkan kalian atas musuh-musuh kalian dan meneguhkan kaki-kaki kalian saat perang."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Wahai orang-orang yang beriman kepada Allah dan mengerjakan apa yang telah Allah syariatkan bagi mereka, jika kalian menolong Allah dengan cara menolong Nabi-Nya dan agama-Nya serta dengan memerangi orang-orang kafir, niscaya Allah akan menolong kalian dengan memberikan kemenangan kepada kalian atas mereka dan meneguhkan kaki-kaki kalian dalam peperangan saat menghadapi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Allah memberi kabar gembira bagi orang-orang beriman bahwa jika mereka menolong agama Allah dengan berjihad di jalan-Nya dan mengikuti hukum-hukum-Nya, maka Dia akan menolong mereka dalam melawan musuh dan meneguhkan kaki mereka di medan perang."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ إِن تَنصُرُوا۟ اللهَ (Hai orang-orang mukmin, jika kamu menolong (agama) Allah) Yakni jika kalian menolong agama Allah. يَنصُرْكُمْ (niscaya Dia akan menolongmu) Menolong kalian dalam menghadapi orang-orang kafir dan memenangkan kalian. وَيُثَبِّتْ أَقْدَامَكُمْ (dan meneguhkan kedudukanmu) Ketika kalian sedang berada di medan peperangan. Pendapat lain mengatakan yakni ketika kalian melalui sirath."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Wahai orang-orang yang beriman kepada Allah dan rasul-Nya, jika kalian menolong agama Allah dan rasul-Nya dengan mendukung dan mengikuti syariatnya, maka Allah akan menolong kalian dari musuh kalian. Allah akan menetapkan langkah dan jalan kalian selama peperarngan dengan musuh kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai orang-orang yang beriman, jika kalian menolong Allah} jika kalian menolong agama Allah dan rasulNya {niscaya Dia akan menolong kalian dan meneguhkan kedudukan kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Ini adalah perintah dari Allah kepada orang-orang yang beriman agar mereka menolong (membela) Allah dengan menegakkan AgamaNya, menyeru manusia kepadaNya serta berjihad melawan musuh-musuhNya yang dilakukan dengan tujuan untuk mencari ridha Allah. Jika mereka melakukan hal itu, maka Allah akan memberikan pertolongan pada mereka dan meneguhkan kaki mereka. Artinya hati mereka diberi kesabaran, ketenangan serta keteguhan serta membuat jasad mereka bersabar menghadapi itu, dan memberikan mereka pertolongan untuk mengalahkan musuh-musuh mereka. Ini merupakan janji dari Allah Yang Mahamulia dan Mahabenar janjinya, siapa pun yang menolongNya dengan perkataan dan perbuatan, maka akan diberi pertolongan oleh Allah serta diberi kemudahan untuk mendapatkan factor-faktor kemenangan seperti keteguhan hati dan lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 7: Allah menjanjikan hamba-hamba-Nya yang beriman yaitu mereka yang membenarkan Allah dan Rasul-Nya ﷺ dan beramal dengan segera ketika bertempur dan tawadhu ketika berjihad dan bukan karena dendam dalam menolong agama Allah. Allah akan menolong mereka dan memberikan bantuan, dan mengokohkan kaki-kaki mereka; Maka sungguh pertolongan akan datang dengan kekokohan dan kesabaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan perintah Allah kepada kaum mukmin agar mereka menolong agama-Nya, berdakwah kepada-Nya, dan berjihad melawan musuh-musuh-Nya dengan mengharapkan keridhaan-Nya. Jika mereka melakukan hal itu, maka Allah Subhaanahu wa Ta'aala akan menolong mereka dan meneguhkan mereka, yakni menguatkan mereka dengan kesabaran , ketenangan, dan keteguhan serta membuat badan mereka dapat bersabar di atasnya serta menolong mereka terhadap musuh mereka. Ini adalah janji dari Allah Yang Maha Pemurah yang benar janji-Nya, bahwa barang siapa yang menolong agama-Nya baik dengan ucapan maupun perbuatan, maka Dia akan menolongnya, memudahkan sebab-sebab pertolongan, seperti keteguhan dsb. Di medan perang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 7",
    "description": "7-9. Allah menjanjikan kepada orang-orang yang beriman bahwa mereka akan mendapat kemenangan terhadap musuh-Musuhnya apabila mereka benar-benar menolong agama Allah. Janji Allah ini dinyatakan dalam ayat-Nya, wahai orang-orang yang beriman, yang percaya kepada Allah dan rasul-Nya dan mengamalkan tuntunan-Nya! jika kamu menolong agama Allah dengan berjihad memperjuangkan kebenaran di jalan Allah, niscaya dia akan menolongmu menghadapi berbagai kesulitan dan meneguhkan kedudukanmu sehingga kamu dapat mengalahkan musuh-Musuhmu. Itulah janji Allah untuk mendorong mereka orang yang beriman agar tidak segan dalam berjihad di jalan Allah. Dan orang-orang yang kafir kepada Allah dan rasul-Nya dan mengingkari tuntunan agama-Nya maka celakalah mereka baik di dunia maupun di akhirat dan Allah menghapus segala amalnya sehingga amal mereka itu sia-sia. Yang demikian itu merupakan ketetapan Allah karena mereka membenci apa yang diturunkan Allah, yakni Al-Qur'an, maka Allah menghapus segala amal mereka, yakni tidak memberikan pahala kepada amal perbuatannya"
  }
]