[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Dan orang-orang kafir, maka celaka bagi mereka, Allah menghapus pahala amal-amal mereka, karena mereka membenci kitab Allah yang turun kepad NabiNya, Muhammad, mereka mendustakannya, maka Allah membatalkan amal-amal mereka, karena amal-amal baik mereka itu hanya dalam rangka mematuhi setan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan orang-orang yang kafir terhadap Allah dan Rasul-Nya, maka bagi mereka kerugian dan kehancuran, dan Allah membatalkan pahala perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8-11. Dan orang-orang yang mendustakan Allah dan rasul-Nya akan mendapatkan kehancuran dan kehinaan, serta pahala amalan mereka akan terhapus. Tidakkah mereka berjalan di muka bumi sehingga mereka dapat menyaksikan bagaimana kesudahan umat-umat terdahulu, seperti kaum ‘Ad, Tsamud, dan kaum Nabi Luth agar mereka dapat mengambil pelajaran dari mereka? Allah telah membinasakan umat-umat itu dan sisa-sisa peninggalan mereka masih ada. Dan orang-orang yang mendustakan akan mendapatkan siksaan seperti itu. kehancuran besar yang menimpa umat-umat itu akan menimpa mereka juga, karena Allah adalah Penolong orang-orang beriman, sedangkan orang-orang kafir tidak memiliki penolong."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَالَّذِينَ كَفَرُوا۟ فَتَعْسًا لَّهُمْ (Dan orang-orang yang kafir, maka kecelakaanlah bagi mereka) Yakni kecelakaan bagi mereka. Atau keburukan bagi mereka. وَأَضَلَّ أَعْمٰلَهُمْ (dan Allah menyesatkan amal-amal mereka) Amal perbuatan mereka tidak dapat mewujudkan kebaikan yang mereka harapkan di akhirat, dan tidak dapat mewujudkan harapan mereka di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Adapun orang-orang kafir akan binasa dan dipenuhi dengan kesedihan. Allah akan menolak segala amal baik mereka sebab kekufuran mereka. Hidup mereka digunakan untuk mengabdi kepada selain Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan orang-orang yang ingkar, maka kecelakaanlah bagi mereka} penderitaan dan kehancuran bagi mereka dan tidak bisa bangkit dari hal itu {dan Dia membatalkan amal-amal mereka} Allah membatalkan pahal amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Sedangkan orang-orang yang kufur terhadap Rabb mereka dan menolong kebatilan, maka mereka itu berada dalam kecelakaan, artinya, akibat dari perbuatan mereka serta kehinaan. “Dan (Allah) menghapus amal-amal mereka.” Artinya, Allah mengugurkan amal-amal mereka yang hendak menipu daya kebenaran dan dampak dari tipu daya itu pun kembali pada diri mereka sendiri, amal-amal mereka pun batal yang mereka kira mereka lakukan untuk mencari keridhaan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 8: Adapun mereka yang kafir kepada Allah dan Rasul-Nya ﷺ mereka adalah orang-orang yang celaka, lemah dan merugi. Maka Allah tidak memberikan pahala atas amalan-amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kepada Tuhan mereka dan membela yang batil. Yang tujuannya untuk mengalahkan kebenaran, sehingga tipu daya itu kembali ke leher-leher mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 8",
    "description": "7-9. Allah menjanjikan kepada orang-orang yang beriman bahwa mereka akan mendapat kemenangan terhadap musuh-Musuhnya apabila mereka benar-benar menolong agama Allah. Janji Allah ini dinyatakan dalam ayat-Nya, wahai orang-orang yang beriman, yang percaya kepada Allah dan rasul-Nya dan mengamalkan tuntunan-Nya! jika kamu menolong agama Allah dengan berjihad memperjuangkan kebenaran di jalan Allah, niscaya dia akan menolongmu menghadapi berbagai kesulitan dan meneguhkan kedudukanmu sehingga kamu dapat mengalahkan musuh-Musuhmu. Itulah janji Allah untuk mendorong mereka orang yang beriman agar tidak segan dalam berjihad di jalan Allah. Dan orang-orang yang kafir kepada Allah dan rasul-Nya dan mengingkari tuntunan agama-Nya maka celakalah mereka baik di dunia maupun di akhirat dan Allah menghapus segala amalnya sehingga amal mereka itu sia-sia. Yang demikian itu merupakan ketetapan Allah karena mereka membenci apa yang diturunkan Allah, yakni Al-Qur'an, maka Allah menghapus segala amal mereka, yakni tidak memberikan pahala kepada amal perbuatannya"
  }
]