[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-9. Dan orang-orang kafir, maka celaka bagi mereka, Allah menghapus pahala amal-amal mereka, karena mereka membenci kitab Allah yang turun kepad NabiNya, Muhammad, mereka mendustakannya, maka Allah membatalkan amal-amal mereka, karena amal-amal baik mereka itu hanya dalam rangka mematuhi setan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Siksa yang terjadi pada mereka itu disebabkan karena mereka membenci Al-Qur`ān yang diturunkan Allah kepada Rasul-Nya karena di dalamnya terdapat tauhid kepada Allah, maka Allah menyia-nyiakan amal perbuatan mereka, lalu mereka menjadi orang yang merugi di dunia dan di Akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Kebinasaan dan penolakan amal mereka adalah sebab kebencian mereka terhadap Alquran. Maka amal mereka tertolak dan tidak mendapatkan pahala"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Demikian itu karena mereka membenci apa yang diturunkan Allah sehingga Dia menggugurkan amal-amal mereka} maka Allah membatalkan amal mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Penghapusan amal serta kecelakaan untuk orang-orang kafir itu disebabkan karena, “mereka benci kepada apa yang diturunkan Allah,” yaitu al-Quran yang diturunkan oleh Allah sebagai perbaikan untuk hamba-hamba Allah dan sebagai keberuntungan untuk mereka, namun mereka tidak mau menerimanya, justru mereka murka dan benci terhadapnya, “maka Allah menghapuskan (pahala-pahala) amal-amal mereka.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Muhammad ayat 9: Allah menjelaskan bahwa adzab bagi mereka adalah nyata karena sebab mereka membenci dan marah terhadap apa yang telah Allah turunkan kepada Nabi-Nya ﷺ dari Al Qur’an Al Adzim; Allah hapuskan amalan-amalan mereka dan meniadakannya; Sehingga tidak bermanfaat amalan-amalan tersebut di dunia dan tidak juga di akhirat. Telah dijadikan dalil hukum oleh sebagian ulama pada ayat ini atas siapa yang membenci sesuatu dari apa yang telah Allah turunkan, maka dia telah kafir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni penyia-nyiaan amal orang-orang kafir dan kecelakaan untuk mereka disebabkan karena mereka membenci apa (Al Qur’an) yang diturunkan Allah. Yang mengandung beban agama, untuk memperbaiki mereka dan sebagai keberuntungan bagi mereka. Tetapi mereka malah menolaknya, membencinya dan tidak suka kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Muhammad Ayat 9",
    "description": "7-9. Allah menjanjikan kepada orang-orang yang beriman bahwa mereka akan mendapat kemenangan terhadap musuh-Musuhnya apabila mereka benar-benar menolong agama Allah. Janji Allah ini dinyatakan dalam ayat-Nya, wahai orang-orang yang beriman, yang percaya kepada Allah dan rasul-Nya dan mengamalkan tuntunan-Nya! jika kamu menolong agama Allah dengan berjihad memperjuangkan kebenaran di jalan Allah, niscaya dia akan menolongmu menghadapi berbagai kesulitan dan meneguhkan kedudukanmu sehingga kamu dapat mengalahkan musuh-Musuhmu. Itulah janji Allah untuk mendorong mereka orang yang beriman agar tidak segan dalam berjihad di jalan Allah. Dan orang-orang yang kafir kepada Allah dan rasul-Nya dan mengingkari tuntunan agama-Nya maka celakalah mereka baik di dunia maupun di akhirat dan Allah menghapus segala amalnya sehingga amal mereka itu sia-sia. Yang demikian itu merupakan ketetapan Allah karena mereka membenci apa yang diturunkan Allah, yakni Al-Qur'an, maka Allah menghapus segala amal mereka, yakni tidak memberikan pahala kepada amal perbuatannya. 10. Setelah Allah mengecam perbuatan orang-orang kafir dan bahwa mereka akan masuk neraka, maka Allah menyuruh mereka supaya memperhatikan ihwal umat terdahulu dan melihat bekas peninggalan mereka. Dengan melihat keadaan yang dialami oleh umat terdahulu diharapkan mereka dapat mengambil pelajaran. Maka apakah mereka orang-orang kafir yang mendustakan Allah dan rasul-Nya tidak pernah mengadakan perjalanan di bumi di mana terdapat peninggalan umat terdahulu sehingga dapat memperhatikan bagaimana kesudahan dan akibat yang diderita oleh orang-orang yang mendustakan rasul sebelum mereka seperti yang dialami oleh kaum 'ad, kaum Samud, kaum nabi lut dan lainnya. Allah telah membinasakan jiwa, harta, dan anak keturunan mereka, dan bagi orang-orang kafir, kapan dan di mana pun akan menerima nasib yang serupa itu."
  }
]