[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "segala sanjungan hanya bagi Allah dengan sifat-sifatNya yang kesemuanya adalah sifat-sifat kesempurnaan, dan juga karena nikmat-nikmatNya yang tampak maupun yang tidak tampak, nikmat agama maupun duniawi, yang telah memberi karunia dengan menurunkan al-qur’an pada hamba dan rasulNya, Muhammad , dan tidak mengadakan sesuatupun ajaran yang melenceng dari kebenaran di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ungkapan pujian dengan sifat kesempurnaan dan kemuliaan, serta nikmat lahir dan batin hanya ditujukan kepada Allah semata yang telah menurunkan Al-Qur`ān kepada hamba dan utusan-Nya Muhammad -ṣallallāhu 'alaihi wa sallam-, dan sama sekali tidak menjadikan Al-Qur`ān ini bengkok dan menyimpang dari kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-4. Pujian dan syukur yang sempurna hanya bagi Allah, Tuhan yang berhak disembah yang telah menurunkan kepada hamba dan rasul-Nya, Muhammad, Al-Qur’an yang tersusun dengan kalimat-kalimat yang benar dan makna-makna yang fasih, yang tidak berbelok dari kebenaran, ia adalah kitab yang lurus dan jelas, yang isinya tidak saling bertentangan; ia digunakan sebagai peringatan orang-orang kafir dari azab neraka, dan sebagai kabar gembira bagi orang-orang beriman yang senantiasa mengerjakan amal-amal shalih bahwa mereka akan mendapat surga dan segala kenikmatan yang ada di dalamnya, mereka akan berada dalam kenikmatan itu selama-lamanya; dan al-Qur’an juga sebagai peringatan bagi orang-orang musyrik yang mendustakannya dan berkata: ‘Allah memiliki seorang anak’."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. الْحَمْدُ لِلّٰهِ الَّذِىٓ أَنزَلَ عَلَىٰ عَبْدِهِ (Segala puji bagi Allah yang telah menurunkan kepada hamba-Nya) Yakni kepada Nabi Muhammad. Allah mengajarkan hamba-hamba-Nya untuk memuji-Nya atas bertambahnya kenikmatan yang diberikan kepada mereka, dan diantara kenikmatan tersebut adalah diturunkannya al-Qur’an kepada Rasulullah, dengan al-Qur’an tersebut Allah mengabarkan beliau rahasia-rahasia tauhid, berita-berita tentang para malaikat dan para nabi, dan hukum-hukum syariat yang digunakan beliau dan umatnya untuk menyembah Allah. وَلَمْ يَجْعَل لَّهُۥ عِوَجَا (dan Dia tidak mengadakan kebengkokan di dalamnya) Yakni tidak menjadikan suatu kekurangan dalam lafadz maupun maknanya, serta tidak menjadikannya saling berbenturan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 Pada lafadz { قَيِّمًا } yakni : mustaqim (lurus) tidak berkelok dan menyimpang; lafadz ini sebagai penekanan untuk ayat sebelumnya: { وَلَمْ يَجْعَل لَّهُۥ عِوَجَا } \"dan Dia tidak mengadakan kebengkokan di dalamnya\" karena kebanyakan sesuatu yang nampak lurus, namun hakikatya tidak terlepas dari lengkungan, oleh karena itu al-Qur'an menggabungkan antara penafian penyimpangan, dan penetapan kelurusan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Disebutkan dalam hadis shahih tentang keutamaan surat ini, diantaranya: “Barangsiapa menghafal sepuluh ayat dari awal surat Al-kahfi, dia akan dijaga dari Dajjal.” Lalu : “Barangsiapa membaca sepuluh ayat dari akhir surat Al-kahfi maka dijaga dari fitnah Dajjal.” 1. Segala puji yang indah hanya bagi Allah yang telah menurunkan Al-Quran kepada hamba-Nya Muhammad sallallahu ‘alaihi wasallam dan Dia tidak mengadakan kebengkokan/cacat di dalamnya;"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Segala puji bagi Allah yang telah menurunkan kitab kepada hambaNya dan Dia tidak menjadikan untuknya kebengkokan} kebengkokan dan penyimpangan dari kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Adalah pujian bagi Allah, dengan sifat-sifatNya yang keseluruhannya merupakan sifat-sifat sempurna, nikmat-nikmatNya yang zahir maupun yang batin, nikmat agama dan dunia. Secara mutlak, nikmat Allah yang paling agung adalah Allah menurunkan al-Quran kepada hamba dan RasulNya, Muhammad. Maka, Allah memuji DzatNya. Dalam pujian tersebut, terkandung panduan bagi para hamba agar mereka memujiNya atas pengiriman seorang rasul dan diturunkannya al-Quran kepada mereka. Kemudian Allah memberikan predikat pada al-Quran dengan dua sifat yang mengandung pengertian bahwasanya al-Quran itu sempurna dari segala sisi, yaitu penafian kebengkokan dari al-Quran, dan penetapan bahwasanya al-Quran adalah permanen lagi lurus. Penafian unsur kebengkokan dari al-Quran menunjukkan bahwa tidak ada kedustaan dalam berita-beritanya, tidak ada kezhaliman dan hal-hal yang sia-sia dalam semua perintah dan larangannya. Sedangkan penetapan sifat istiqamah (lurus) menuntut bahwa al-Quran tidak memerintahkan dan tidak pula memberitakan melainkan dengan berita yang paling agung, yaitu berita-berita yang akan membuat hati penuh dengan pengetahuan, keimanan, dan pemahaman. Seperti berita-berita tentang nama-nama Allah, sifat-sifat dan perbuatan-perbuatanNya. Termasuk juga perkara-perkara ghaib yang sudah lewat maupun yang akan datang. (Mengandung makna pula) bahwa perintah-perintah dan larangan-larangannya dapat menyucikan, membersihkan, dan menumbuhkan serta menjadikan jiwa sempurna, lantaran memuat unsur keadilan yang sempurna, keseimbangan, keikhlasan, dan peribadahan kepada Allah, Penguasa alam semesta, sendirian, tiada sekutu bagiNya. Maka, patutlah pada kitab (al-Quran) yang berkarakter demikian, bahwa Allah memuji diriNya lantaran Dia yang menurunkan al-Quran dan mengagungkan DzatNya di hadapan para hambaNya dengan itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 1: Yakni segala puji bagi Allah Subhaanahu wa Ta'aala karena sifat-sifat-Nya yang semuanya merupakan sifat sempurna, dan karena nikmat-nikmat-Nya yang nampak maupun yang tersembunyi, baik nikmat agama maupun dunia, dan nikmat yang paling besar secara mutlak adalah karena Dia telah menurunkan Al Qur’an kepada hamba dan Rasul-Nya Muhammad shallallahu 'alaihi wa sallam. Di ayat ini, Dia memuji Diri-Nya, dan di dalamnya mengandung petunjuk bagi para hamba agar mereka memuji-Nya karena telah diutus kepada mereka rasul-Nya dan karena telah diturunkan kepada mereka kitab-Nya. Tidak ada dalam Al-Quran itu makna-makna yang berlawananan dan tidak ada penyimpangan dari kebenaran. Oleh karena tidak ada kebengkokan dalam kitab-Nya, maka berarti berita-beritanya tidak ada yang dusta, perintah dan larangannya tidak ada yang zalim lagi main-main."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 1",
    "description": "Pada akhir surah al-isra', rasulullah diperintah agar memuji Allah dan menyucikannya dari segala kekurangan. Surah ini dimulai dengan menyampaikan kewajaran Allah menyandang pujian itu dengan mengingatkan tentang keharusan memuji dan menaati perintahnya sesuai dengan yang digariskan agama dalam kitab suci Al-Qur'an. Segala puji hanya tertuju bagi Allah yang telah menurunkan kepada hamba-Nya, yaitu nabi Muhammad al-kitab, yakni Al-Qur'an, dan dia tidak membuat padanya kebengkokan, baik redaksi maupun maknanya. Ayat demi ayatnya saling menjelaskan tidak ada pertentangan satu dengan lainnya. Al-qur'an diturunkan sebagai bimbingan yang lurus dan sempurna, tidak berlebihan dan tidak kurang di dalam tuntutan dan hukum-hukumnya, dengan tujuan untuk memperingatkan umat manusia akan siksa yang sangat pedih dari sisi-Nya yang menimpa mereka yang tidak percaya, dan memberikan kabar gembira kepada orang-orang mukmin yang kokoh imannya yang senantiasa mengerjakan kebajikan bahwa mereka akan mendapat balasan yang baik, yaitu surga beserta kenikmatannya."
  }
]