[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah (wahai rasul) ketika sejumlah pemuda yang beriman kepada Allah mencari tempat berlindung ke dalam gua, karena takut menghadapi fitnah dari kaum mereka yang dilancarkan kepada mereka dan paksaan terhadap mereka untuk menyembah berhala-berhala. Mereka berkata, ”wahai tuhan kami, berikanlah kepada kami rahmat dari sisiMu untuk meneguhkan kami dengannya dan melindungi kami dari keburukan. Dan mudahkanlah bagi kami jalan yang benar yang mengantarkan kami untuk melakukan apa yang Engkau cintai, sehinga kami menjadi manusia-manusia yang lurus, bukan orang-orang yang sesat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Ingatlah -wahai Rasul- tatkala beberapa pemuda yang beriman melarikan diri untuk mencari perlindungan demi menyelamatkan agama mereka, lalu mereka menghaturkan doa, \"Wahai Tuhan kami! Berikanlah rahmat kepada kami dari sisi-Mu dengan mengampuni dosa-dosa kami, dan menyelamatkan kami dari makar musuh-musuh kami, serta jadikanlah iman kami dan hijrahnya kami dari orang-orang kafir sebagai petunjuk dan sikap istikamah menuju jalan kebenaran.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-12. Allah menyebutkan kepada Rasulullah kisab Ashabul kahfi, yaitu para pemuda beriman yang berlindung ke dalam gua demi menyelamatkan agama mereka dari kesyirikan dan para penganutnya. Ketika itu mereka berkata: “Ya Tuhan kami, berikanlah kepada kami rahmat dari sisi-Mu sebagai kemuliaan dari-Mu, dan perbaikilah urusan kami dalam menuju jalan yang benar”. Maka Kami berikan kepada mereka tidur panjang dalam gua kemudian Kami bangunkan mereka, agar Kami mengetahui manakah dari dua golongan yang berselisih yang lebih tepat dalam memperkirakan waktu ashabul kahfi tinggal di dalam gua."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. إِذْ أَوَى الْفِتْيَةُ ((Ingatlah) tatkala para pemuda itu mencari tempat berlindung) Yakni para pemuda ashabul kahfi. فَقَالُوا۟ رَبَّنَآ ءَاتِنَا مِن لَّدُنكَ رَحْمَةً (lalu mereka berdoa: “Wahai Tuhan kami, berikanlah rahmat kepada kami dari sisi-Mu) Yakni rahmat yang hanya datang dari Engkau, yang berupa ampunan di akhirat, keamanan dari musuh, dan rezeki di dunia. وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا(dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami) Yakni dan perbaikilah urusan yang kami lalui ini, yaitu dalam meninggalkan orang-orang kafir."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan firman Allah yang menceritakan tentang penghuni gua tatkala mereka menjauh dari kaumnya : { وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا } mereka meminta kepada Allah agar amalan mereka menjadi sebab datangnya petunjuk, maka bagaimana dengan orang-orang yang lalai dari beramal shalih, bahkan mereka sombong dengan sediktinya amalan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Ingatlah tatkala para pemuda Ashabul Kahfi itu mencari tempat berlindung ke dalam gua agar terhindar dari fitnah, lalu mereka berdoa: \"Wahai Tuhan kami, berikanlah rahmat kepada kami dari sisi-Mu secara khusus, yaitu ampunan di akhirat, dan keamanan dari musuh, rizki di dunia, serta mudahkanlah kami mendapat petunjuk yang lurus yang Engkau ridhai dan restui dengan memisahkan diri dari orang kafir\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika pemuda-pemuda itu berlindung} berlindung {ke dalam gua lalu berdoa,“Ya Tuhan kami, anugerahkanlah kepada kami} berilah kami {rahmat dari sisiMu dan mudahkanlah} mudahkanlah {bagi kami petunjuk untuk segala urusan kami”} dibimbing dan ditunjukkan kepada kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Kemudian Allah menyebutkan kisah mereka secara global. Setelah itu, diikuti dengan perinciannya. Allah berfirman, “INgatlah tatkala pemuda-pemuda itu mencari tempat berlindung,” yaitu para remaja itu “ke dalam gua.” Tindakan itu mereka tujukan untuk menjaga dan membentengi dirinya dari fitnah kaumnya terhadap mereka “lalu mereka berdoa, ‘Wahai Rabb kami, berikanlah rahmat kepada kami dari sisiMU’ .” Engkau meneguhkan kami dengannya, menjaga kami dari keburukan serta memberikan kami taufik untuk kebaikan. “Dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami (ini),” maksudnya mudahkanlah bagi kamu segala sebab kausalitas yang menyampaikan kepada petunjuk, dan perbaikilah urusan agama dan dunia kami. Mereka telah menggabungkan antara usaha dan lari dari fitnah menuju kepada lokasi yang bisa menjadi tempat persembunyian (mereka) dengan ketundukan dan permintaan mereka kepada Allah agar dimudahkan urusan-urusannya, dan tidak menyandarkan urusan-urusan kepada diri mereka sendiri dan kepada makhluk lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 10: Di ayat ini disebutkan kisah mereka secara jumlah (garis besar), dan nanti (yaitu pada ayat 13 dan seterusnya) akan disebutkan lebih rinci. Dalam keadaan takut disiksa oleh kaum mereka yang kafir karena beriman kepada Allah. Mereka menggabung antara usaha dan menjauh dari fitnah dengan sikap tadharru’ (merendahkan diri) dan meminta kepada Allah, serta tidak bersandar kepada diri dan orang lain. Oleh karena itu, Allah Subhaanahu wa Ta'aala mengabulkan doa mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 10",
    "description": "Ingatlah ketika pemuda-pemuda itu berlindung ke dalam gua, meninggalkan negerinya karena menjaga iman dan tauhidnya dari penindasan penguasa negerinya, lalu mereka berdoa, ya tuhan kami. Berikanlah rahmat kepada kami dari sisi-Mu, lindungilah kami dari orang-orang yang memfitnah kami, dan sempurnakanlah petunjuk yang lurus yang dapat mengantarkan kepada keselamatan dan kebahagiaan bagi kami dalam urusan kami, baik urusan duniawi maupun ukhrawi. Maka kami kami mengabulkan doa mereka, kami tutup telinga mereka di dalam gua itu, agar mereka tidak dapat mendengar suara, maka mereka tertidur lelap di dalam gua itu selama beberapa tahun, yaitu sekitar tiga ratus tahun seperti yang akan disebutkan pada ayat 25."
  }
]