[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "yaitu, orang-orang yang ketika di dunia pada mata mereka terdapat penutup sehingga tidak dapat memperlihatkan ayat-ayatKu dan mereka tidak kuat untuk mendengar hujjah-hujjahKu yang mengantarkan menuju keimanan kepadaKu dan kepada rasulKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Kami memperlihatkannya kepada orang-orang kafir yang ketika di dunia mata hati mereka buta dari mengingat Allah, karena pada mata mereka terdapat penghalangnya, dan mereka juga tidak sanggup mendengar ayat-ayat Allah agar menerimanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. الَّذِينَ كَانَتْ أَعْيُنُهُمْ فِى غِطَآءٍ عَن ذِكْرِى (itu orang-orang yang matanya dalam keadaan tertutup dari memperhatikan tanda-tanda kebesaran-Ku) Yaitu tanda-tanda yang disaksikan oleh orang yang senantiasa bertafakkur dan mengambil pelajaran, kemudian dia berzikir kepada Allah dengan tahlil dan tahmid. وَكَانُوا۟ لَا يَسْتَطِيعُونَ سَمْعًا (dan mereka tidak sanggup mendengar) Karena mereka selalu enggan untuk melihat dengan penglihatan mereka dan selalu berpaling dari tanda-tanda yang dapat mereka dengar."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "100-101 1 ). Allah mengatakan tatkala menampakkan neraka kepada orang-orang kafir : { وَعَرَضْنَا جَهَنَّمَ يَوْمَئِذٍ لِلْكَافِرِينَ عَرْضًا } \"Dan Kami nampakkan Jahannam pada hari itu kepada orang-orang kafir dengan jelas\" dan ketika Ia menampakkan diri orang-orang kafir kepada neraka : { وَيَوْمَ يُعْرَضُ ٱلَّذِينَ كَفَرُوا۟ عَلَى ٱلنَّارِ } \"Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka\" [ Al-Ahqaf : 20 ] neraka didekatkan kepada mereka, dan begitupun mereka didekatkan kepada neraka, sebagai tambahan siksaan bagi mereka. 2 ). { وَعَرَضْنَا جَهَنَّمَ يَوْمَئِذٍ لِلْكَافِرِينَ عَرْضًا } Pada penghujung ayat terdapat kata { عَرْضًا } dalam bentuk nakiroh, dan maknanya : nampak dengan jelas dan mengerikan hati akan ketakutan ketikan ditampakkan dihadapannya, hikmahnya agar setiap jiwa senantiasa memperbaiki dirinya dihadapan Allah, senantiasa takut akan kehadiran hari itu, dan mempersiapkan diri untuk bertemu denganya, seakan-akan ia telah berada dekat dengannya. 3 ). { ٱلَّذِينَ كَانَتْ أَعْيُنُهُمْ فِى غِطَآءٍ عَن ذِكْرِى وَكَانُوا۟ لَا يَسْتَطِيعُونَ سَمْعًا } \"Yaitu orang-orang yang matanya dalam keadaan tertutup dari memperhatikan tanda-tanda kebesaran-Ku, dan adalah mereka tidak sanggup mendengar\" ayat ini mengandung dua makna : pertama : bahwa mata mereka tertutup dari mengingat ayat-ayat Allah, dan bukti-bukti keesaan-Nya, serta keajaiban kekuasaan-Nya, kedua : bahwasanya hati mereka tertutup dari memahami al-Qur'an dan mentadabburinya, bermula dari hati yang tertutup, kemudian sampai kepada mata mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Mereka adalah orang-orang yang matanya tertutup sehingga tidak memperhatikan tanda-tanda kebesaran-Ku, berupa tanda makhluk (kauni) untuk mengesakan dan mengagungkan Allah. Mereka tidak senang mendengarkan ayat Al-quran dan juga tidak senang duduk dengan Nabi karena mereka takut menjadi beriman. Bukan tidak mendengar karena memang mereka tidak bisa mendengar, tapi karena mereka tidak mau mendengar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{orang-orang yang mata (hati)nya dalam keadaan tertutup} tabir yang tebal {dari mengingatKu dan mereka tidak sanggup mendengar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Ini adalah dampak-dampak ulah perbuatan dan balasan tindak-tanduk mereka. Sesungguhnya mereka itu di dunia, mata mereka tertutupi oleh penutup (sehingga menutup) dari mengingat Allah. Pengertiannya, mereka itu berpaling dari peringatan yang bijaksana dan al-Quran al-Karim. \"Mereka berkata: \"Hati kami berada dalam tutupan (yang menutupi) apa yang kamu seru kami kepadanya \" (Fushilat:5) Pada mata-mata mereka terdapat tabir penutup yang mengahmbat mereka dari tanda-tanda kebesaran Allah yang bermanfaat. Seperti Firman Allah, \"dan penglihatan mereka ditutup\" (Al-Baqarah:7) “Dan mereka tidak sanggup mendengar,” maksudnya tidak sanggup mendengarkan ayat-ayat Allah yang mengantarkan kepada keimanan, lantaran kebencian mereka terhadap al-Qiran dan Rasulullah. Sesungguhnya orang yang benci tidak dapat memusatkan (konsentrasi) pendengarannya kepada pperkataan orang yang dibencinya. Bila jalan-jalan ilmu dan kebaikan telah terutup dengan rapat, maka mereka tidak memiliki pendengaran, pandangan dan akal yang bermanfaat. Sungguh, mereka telah mengkufuri Allah, mengingkari ayat-ayatNya dan mendustakan para RasulNya. Akibatnya, mereka pantas menerima balasan Jahanam, dan itu adalah sejelek-jelek tempat kembali."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 101: Ada yang menafsirkan, dari Al Qur’an. Mereka tidak sanggup mendengar dari Nabi shallallahu 'alaihi wa sallam apa yang Beliau bacakan karena benci kepada Beliau. Hal itu, karena orang yang benci tidak sanggup mendengarkan kata-kata orang yang dibencinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 101",
    "description": "101. Mereka yang kafir itu adalah orang-orang yang mata kepala dan hatinya tidak digunakan untuk memperhatikan tanda-tanda kekuasaan Allah, baik yang terdapat di alam semesta maupun yang tertulis dalam kitab suci. Mata mereka selalu dalam keadaan tertutup sehingga mereka terdorong untuk berpaling dari memperhatikan tanda-tanda kebesaran-ku yang tersebar di jagad raya, dan mereka juga tidak sanggup dan enggan mendengar apalagi mematuhi seruan yang mengajak menuju kebenaran. 102. Karena sikap yang buruk itu, maka Allah mengkritik keras mereka, yang diungkapkan dalam bentuk pertanyaan. Apakah orang-orang kafir itu menyangka bahwa mereka dapat mengambil dan menjadikan hambahamba-ku yang saleh, seperti nabi isa dan uzair sebagai tuhan yang disembah dan menjadi penolong mereka di akhirat selain aku' sungguh, sikap mereka itu merupakan perilaku yang sesat. Sebagai balasannya, kami telah menyediakan neraka jahanam sebagai tempat tinggal bagi orang-orang kafir yang terus mengingkari keesaan dan kekuasaan-ku. '."
  }
]