[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang-orang yang kafir kepadaKu menyangka bahwa mereka boleh menjadikan hamba-hambaKu sebagai sesembahan selainKu agar menjadi pembela-pembela mereka? sesungguhnya Kami telah menyediakan neraka jahanam sebagai tempat tinggal bagi orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Maka apakah orang-orang yang kafir kepada Allah itu menyangka bahwa mereka dapat menjadikan hamba-hamba-Ku dari kalangan Malaikat, Rasul dan setan sebagai sesembahan yang disembah selain Aku?! Sungguh Kami telah menyediakan neraka Jahanam sebagai tempat tinggalnya orang-orang yang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Allah mengingkari dan mengolok orang-orang kafir: “Apakah orang-orang kafir mengira dengan menjadikan sebagian hamba-Ku sebagai tuhan-tuhan yang mereka sembah selain Aku dapat menolong mereka dari azab-Ku? Sungguh Kami telah menyiapkan neraka Jahannam sebagai tempat bagi orang-orang kafir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. أَفَحَسِبَ الَّذِينَ كَفَرُوٓا۟ أَن يَتَّخِذُوا۟ عِبَادِى مِن دُونِىٓ (maka apakah orang-orang kafir menyangka bahwa mereka (dapat) mengambil hamba-hamba-Ku selain Aku?) Mereka adalah para malaikat, Isa al-Masih, dan setan-setan. أَوْلِيَآءَ ۚ( menjadi penolong) Yakni menjadi sesuatu yang disembah. إِنَّآ أَعْتَدْنَا جَهَنَّمَ لِلْكٰفِرِينَ نُزُلًا(Sesungguhnya Kami telah menyediakan neraka Jahannam tempat tinggal bagi orang-orang kafir) Yakni Kami siapkan bagi mereka hidangan berupa neraka agar mereka menikmatinya saat mereka telah memasukinya sebagaimana hidangan yang disiapkan bagi tamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Maka apakah orang-orang kafir itu menyangka bahwa mereka dapat menjadikan hamba-hamba-Ku seperti malaikat, Isa, Uzair, setan-setan dan lainnya sebagai sesembahan yang menjadi penolong selain Aku? Kemudian Aku tidak akan menghukum mereka? Sesungguhnya Kami telah menyediakan neraka Jahannam tempat tinggal bagi orang-orang kafir. Annuzul adalah tempat penjamuan tamu, yang bermakna sebagai olok-olok untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah orang-orang kafir mengira} mengira {bahwa mereka bisa mengambil hamba-hambaKu menjadi penolong} sesembahan {selain Aku. Sesungguhnya Kami telah menyediakan} menyiapkan dan menyediakan {neraka Jahanam bagi orang-orang kafir sebagai tempat tinggal} tempat tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Ini bukti nyata dan penjelasan tentang kebatilan klaim kaum musyrikin yang mengingkari, yang menjadikan sebagian nabi dan wali sebagai sekutu Allah yang mereka sembah. Menurut mereka, sesembahan-sesembahan itu akan menjadi penolong bagi mereka, menyelamatkan mereka dari siksa Allah, dan mendatangkan pahala bagi mereka. Sungguh, mereka itu telah kufur kepada Allah dan RasulNya. Allah berfirman kepada mereka dengan nada pertanyaan dan pengingkaran yang menetapkan kebatilan praktik tersebut pada nalar-nalar, “maka apakah orang-orang kafir menyangka bahwa mereka (dapat) menjadikan hamba-hambaKu sebagai penolong selain Aku?” maksudnya, hal itu tidak mungkin terjadi. Seorang wali Allah tidak akan memusuhi Allah sama sekali. Sesungguhnya para wali itu akan selaras dengan (keinginan) Allah dalam kecintaan, ridha, marah, dan kebencian. Dengan makna ini, berrati mirip dengan Firman Allah, \"Dan (ingatlah) hari (yang di waktu itu) Allah mengumpulkan mereka semuanya kemudian Allah berfirman kepada malaikat: \"Apakah mereka ini dahulu menyembah kamu?\". Malaikat-malaikat itu menjawab: \"Maha Suci Engkau. Engkaulah pelindung kami, bukan mereka: bahkan mereka telah menyembah jin; kebanyakan mereka beriman kepada jin itu\". (Saba’:40-41). Barangsiapa mengklaim bahwa dia menjadikan wali Allah sebagai penolongnya yang memusuhi Allah, maka dia adalah pendusta. Ayat ini juga mengandung pengertian –dan inilah makna yang lebih tampak jelas- bahwa apakah kaum kuffar yang mengingkari Allah dan para RasulNya menyangka dapat menjadikan selain Allah sebagai penolong mereka, yang akan menolong dan memberikan manfaat bagi mereka, serta menolak gangguan dari mereka? Ini adalah prediksi yang batil dan prasangka yang rusak. Semua makhluk tidak mempunyai kemampuan memberi manfaat dan kemudharatan sedikit pun. Ini menjadi sebagaimana makna Firman Allah, \"Katakanlah: \"Panggillah mereka yang kamu anggap (tuhan) selain Allah, maka mereka tidak akan mempunyai kekuasaan untuk menghilangkan bahaya dari padamu dan tidak pula memindahkannya\". (Al-Isra: 56) \"Dan sembahan-sembahan yang mereka sembah selain Allah tidak dapat memberi syafaat;\" (Az-Zukhruf:56). Dan ayat-ayat lain yang serupa yang mana Allah mengingatkan di dalamnya bahwa orang yang mengangkat penolong selainNya untuk menolong dirinya dan setia kepadanya, adalah orang sesat, harapannya pupus dan tidak dapat meraih (meski) sebagian maksudnya. “Sesungguhnya Kami akan menyediakan Neraka Jahanam sebagai tempat tinggal orang-orang kafir,” yaitu sebagai perjamuan dan sambutan. Sejelek-jelek tempat tinggal adalah tempat mereka, dan seburuk-buruk (bagian ruang) Jahanam adalah tempat perjamuan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 102: Seperti malaikat, Nabi ‘Isa dan ‘Uzair. Yang menyelamatkan mereka dari azab Allah dan memberikan pahala-Nya. Maksud ayat ini adalah, apakah mereka mengira bahwa mengambil penolong atau tuhan selain Allah tidak membuat-Nya murka dan tidak akan dihukum oleh-Nya? Bahkan tidak demikian. Bisa juga maksudnya, apakah orang-orang kafir yang menentang para rasul mengira bahwa selain Allah ada yang bisa menolong mereka dan memberikan manfaat serta menghindarkan bahaya? Hal ini merupakan persangkaan yang batil, karena semua makhluk bukan di tangan mereka memberikan manfaat dan menimpakan madharrat (bahaya). Oleh karena itu, orang yang mencari penolong selain-Nya sungguh tersesat, kecewa dan rugi serta tidak mampu mencapaikan sebagian maksudnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 102",
    "description": "102. Karena sikap yang buruk itu, maka Allah mengkritik keras mereka, yang diungkapkan dalam bentuk pertanyaan. Apakah orang-orang kafir itu menyangka bahwa mereka dapat mengambil dan menjadikan hambahamba-ku yang saleh, seperti nabi isa dan uzair sebagai tuhan yang disembah dan menjadi penolong mereka di akhirat selain aku' sungguh, sikap mereka itu merupakan perilaku yang sesat. Sebagai balasannya, kami telah menyediakan neraka jahanam sebagai tempat tinggal bagi orang-orang kafir yang terus mengingkari keesaan dan kekuasaan-ku. '103. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir itu, 'apakah perlu kami beritahukan kepadamu tentang orang yang paling rugi perbuatannya karena jerih payah mereka hanya akan mendatangkan kesia-siaan dan tanpa ganjaran''."
  }
]