[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) kepada sekalian manusia sebagai peringatan mereka, ”apakah perlu Kami beritahukan kepada kalain tentang manusia yang paling merugi amal perbuatannya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Katakanlah wahai Rasul, \"Wahai manusia, apakah perlu Kami beritahukan kepada kalian tentang manusia yang paling rugi amal perbuatannya?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103-106. Hai Rasulullah, peringatkanlah manusia: Apakah mau Kami beritahukan siapa manusia yang paling merugi di sisi Allah? Mereka adalah orang-orang yang amal perbuatannya di dunia terhapus, sedangkan mereka mengira telah berbuat baik dalam perkataan dan perbuatan mereka. Orang-orang yang jauh dari rahmat Allah ini adalah orang-orang yang mendustakan al-Qur’an dan hari kebangkitan. Amal kebaikan mereka sirna, sehingga mereka tidak berharga dan tidak memiliki kedudukan di sisi Allah para hari kiamat. Perbuatan besar yang telah Kami jelaskan ancamannya itu balasannya adalah neraka Jahannam akibat mereka kafir kepada Allah dan menjadikan ayat-ayat Allah dan para rasul-Nya sebagai bahan hinaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. قُلْ هَلْ نُنَبِّئُكُم بِالْأَخْسَرِينَ أَعْمٰلًا (Katakanlah: “Apakah akan Kami beritahukan kepadamu tentang orang-orang yang paling merugi perbuatannya?”) Yakni wahai manusia, apakah mau Kami tunjukkan manusia yang paling merugi atas amalan mereka?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "103-104 1 ). Hikmah dari ayat ini menunjukkan bahwa ada tahapan yang mesti di tempuh oleh pelaku dakwah agar ummat dengan mudah menerima dakwahnya, maka tahapan awal dimulai dari aqidah, karena jika tidak demikian; maka amalan-amalan setelahnya akan sia-sia. 2 ). Betapa banyak orang yang rukuk dan sujud, melakukan manasik dan perbanyak ibadah, mengira bahwa sedang menghadap kepada Allah padahal ia tengah berpaling dari dari-Nya, betapa banyak yang menyangka bahwa dirinya sedang berjalan kepada-Nya padahal ia sedang pergi menjauh dari-Nya! semua itu terjadi karena tujuan yang ditempuh telah keluar dari jalur, cara yang dipilih tidak pada maksud yang benar, jalannya telah rusak, sesungguhnya semuanya tidak lepas dari kebodohan dan kelalainnya { وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا } \"sedangkan mereka menyangka bahwa mereka berbuat sebaik-baiknya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Katakanlah wahai Nabi: \"Apakah akan Kami beritahukan kepadamu tentang orang-orang yang paling rugi atas perbuatannya?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Apakah perlu kami memberitahu kalian} memberitahu kalian {orang-orang yang paling rugi perbuatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. Katakanlah wahai Muhammad, kepada orang-orang dengan nada memperingatkan dan mewanti-wanti, apakah kalian mau aku beriitahukan tentang orang-orang yang paling merugi “perbuatannya,” secara mutlak?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 103",
    "description": "103. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir itu, 'apakah perlu kami beritahukan kepadamu tentang orang yang paling rugi perbuatannya karena jerih payah mereka hanya akan mendatangkan kesia-siaan dan tanpa ganjaran''104. Orang-orang yang paling merugi itu adalah orang-orang yang sia-sia perbuatan yang telah dilakukan-Nya dalam kehidupan mereka di dunia, sedangkan ketika itu mereka mengira telah berbuat dan beramal dengan sebaik-baiknya."
  }
]