[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "sesungguhnya mereka itu adalah orang-orang yang telah sia-sia perbuatan mereka di dalam kehidupan dunia, (yaitu kaum musyrikin dari kaummu dan kaum lainnya yang tersesat dari jalan yang lurus, mereka tidak berada di atas hidayah dan ajaran yang benar) namun mereka menyangka diri mereka telah melakukan perbuatan sebaik-baiknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "104. Yaitu orang-orang yang pada hari Kiamat kelak akan melihat bahwa amalan yang mereka usahakan di dunia dahulu hanyalah sia-sia, padahal awalnya mereka mengira bahwa mereka telah berbuat sebaik-baiknya, dan akan mendapatkan manfaat dari amal mereka tersebut, namun ternyata fakta hari Kiamat bertolak belakang dengan perkiraan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "104. الَّذِينَ ضَلَّ سَعْيُهُمْ فِى الْحَيَوٰةِ الدُّنْيَا (Yaitu orang-orang yang telah sia-sia perbuatannya dalam kehidupan dunia ini) Yakni amal yang batal dan sia-sia. وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا(sedangkan mereka menyangka bahwa mereka berbuat sebaik-baiknya) Mereka tertipu dengan keadaan mereka, mereka menyangka telah melakukan kebaikan agar mendapatkan manfaat darinya; namun hakikatnya mereka adalah orang-orang yang berbuat buruk dan merugi."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "103-104 1 ). Hikmah dari ayat ini menunjukkan bahwa ada tahapan yang mesti di tempuh oleh pelaku dakwah agar ummat dengan mudah menerima dakwahnya, maka tahapan awal dimulai dari aqidah, karena jika tidak demikian; maka amalan-amalan setelahnya akan sia-sia. 2 ). Betapa banyak orang yang rukuk dan sujud, melakukan manasik dan perbanyak ibadah, mengira bahwa sedang menghadap kepada Allah padahal ia tengah berpaling dari dari-Nya, betapa banyak yang menyangka bahwa dirinya sedang berjalan kepada-Nya padahal ia sedang pergi menjauh dari-Nya! semua itu terjadi karena tujuan yang ditempuh telah keluar dari jalur, cara yang dipilih tidak pada maksud yang benar, jalannya telah rusak, sesungguhnya semuanya tidak lepas dari kebodohan dan kelalainnya { وَهُمْ يَحْسَبُونَ أَنَّهُمْ يُحْسِنُونَ صُنْعًا } \"sedangkan mereka menyangka bahwa mereka berbuat sebaik-baiknya\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "104. Yaitu orang-orang yang segala perbuatan dalam kehidupannya telah sia-sia. Sedangkan mereka menyangka bahwa mereka telah berbuat yang sebaik-baiknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang sia-sia} lenyap dan sia-sia {usaha mereka} perbuatan mereka {dalam kehidupan dunia, sedangkan mereka mengira} mengira {bahwa mereka berbuat} beramal {sebaik-baiknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "104. “Yaitu orang-orang yang telah sia-sia perbuatannya dalam kehidupan dunia ini,” maksudnya telah batal dan pupus seluruh perbuatan yang mereka kerjakan “sedang mereka menyangka bahwa mereka,” berbuat sebaik-baiknya dalam tindakan mereka. Bagaimana halnya keadaan amalan yang mereka ketahui bahwa ia ternyata batil dan berupaya menentang dan memerangi Allah dan para RasulNya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 104",
    "description": "104. Orang-orang yang paling merugi itu adalah orang-orang yang sia-sia perbuatan yang telah dilakukan-Nya dalam kehidupan mereka di dunia, sedangkan ketika itu mereka mengira telah berbuat dan beramal dengan sebaik-baiknya. 105. Mereka yang akan sia-sia usahanya dan tidak mendapat ganjaran di akhirat itu adalah orang-orang yang mengingkari ayat-ayat yang menunjukkan kebesaran, kekuasaan, dan keesaan tuhan mereka, dan mereka juga ingkar terhadap pertemuan dengan-Nya kelak di akhirat untuk mempertanggungjawabkan perbuatan mereka. Karena kekafiran dan keingkaran itu, maka sia-sia-lah semua amal mereka di dunia, dan karenanya kami tidak memberikan penimbangan terhadap amal mereka kelak pada hari kiamat. Tidak ada amal perbuatan mereka yang layak dipertimbangkan akibat kekufuran dan keingkaran mereka."
  }
]