[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang paling merugi perbuatannya itu adalah orang-orang yang mengingkari ayat-ayat tuhan mereka dan mendustakannya. Dan mereka mengingkari perjumpaan dengan Allah pada hari kiamat. Akibatnya, terhapuslah amal-amal perbuatan mereka disebabkan kekufuran mereka, dan tidaklah kami melaksanakan penilaian sedikitpun bagi mereka pada hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Mereka itu adalah orang-orang yang kafir terhadap ayat-ayat Tuhan mereka yang menunjukkan bukti keesaan-Nya, dan ingkar terhadap perjumpaan dengan-Nya, sehingga amalan mereka pun terhapus dan sia-sia belaka lantaran kekafiran mereka terhadap ayat-ayat-Nya, dan pada hari Kiamat kelak mereka sama sekali tidak memiliki kedudukan apa-apa di sisi Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. أُو۟لٰٓئِكَ الَّذِينَ كَفَرُوا۟ بِـَٔايٰتِ رَبِّهِمْ (Mereka itu orang-orang yang telah kafir terhadap ayat-ayat Tuhan mereka) Kafir terhadap tanda-tanda keesaan Allah yang berasal dari ayat-ayat kauniyah dan ayat-ayat qur’aniyah. Dan kekafiran mereka terhadap pertemuan dengan Allah adalah kekafiran mereka terhadap hari kebangkitan dan kejadian-kejadian setelahnya di akhirat kelak. فَحَبِطَتْ أَعْمٰلُهُمْ (maka hapuslah amalan-amalan mereka) Yakni amalan yang telah mereka lakukan yang mereka kira adalah amalan kebaikan. Amalan mereka dihapus disebabkan kekafiran mereka. فَلَا نُقِيمُ لَهُمْ يَوْمَ الْقِيٰمَةِ وَزْنًا (dan Kami tidak mengadakan suatu penilaian bagi (amalan) mereka pada hari kiamat) Yakni amalan mereka tidak berarti bagi Kami dan Kami tidak mempedulikan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Mereka itu orang-orang yang telah kufur terhadap ayat-ayat Allah berupa ayat kauni ataupun Al-quran untuk mengesakan-Nya. Mereka kufur terhadap hari kebangkitan dan hari perjumpaan dengan Allah di akhirat. Maka mereka meminta balasan atas amal kebaikan mereka padahal mereka kufur kepada Allah. Padahal Kami tidak menilai amalan-amalan mereka, dan mereka hanyalah orang-orang yang dihinakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itu adalah orang-orang yang ingkar terhadap ayat-ayat Tuhan mereka dan pertemuan denganNya. Maka sia-sia} sia-sia amal mereka dan Kami tidak memberikan timbangan} takaran dan tidak pula timbangan {terhadap mereka pada hari Kiamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. Barangsiapa yang merugi amal perbuatannya dan merugi atas diri dan keluarganya pada Hari Kiamat, maka ingatlah itu adalah kerugian yang nyata “mereka itu orang-orang yang kufur terhadap ayat-ayat Rabb mereka dan (kufur terhadap) perjumpaannya denganNya,” maksudnya mengingkari ayat-ayat al-Quran dan tanda-tanda kebesaran yang kasat mata, yang menunjukkan keharusan beriman kepadaNya, malaikat, para rasul kitab-kitabNya dan Hari Akhir. “Maka terhapuslah,” karena itu “amalan-amalan mereka, dan Kami tidak mengadakan suatu penilaian bagi (amalan) mereka pada Hari KIamat,” pasalnya, prosese penimbangan dilakukan dengan tujuan membandingkan kebaikan-kebaikan dengan keburukan-keburukan, dan melihat timbangan mana yang lebih berat dan lebih ringan. Sementara mereka itu tidak mempunyai kebaikan-kebaikan, karena tidak memenuhi syarat, yaitu keimanan, seperti yang Allah Firmankan, \"Dan barang siapa mengerjakan amal-amal yang saleh dan ia dalam keadaan beriman, maka ia tidak khawatir akan perlakuan yang tidak adil (terhadapnya) dan tidak (pula) akan pengurangan haknya.\" (Thaha:112). Akan tetapi, amalan mereka tetap dihitung, dan mereka dimintai pengakuannya atas amalan itu, dipermalukan di hadapan para saksi, lantas disiksa berdasarkan keburukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 105: Yakni dalil-dalil tentang keesaan-Nya baik dari Al Qur’an maupun lainnya. Maksudnya, tidak beriman kepada kebangkitan di hari kiamat, hisab dan pembalasan. Yakni tidak ada beratnya sama sekali karena kosong dari kebaikan. Akan tetapi amal mereka tetap dihitung dan dijumlahkan, lalu dibuat mereka mengakuinya, kemudian mereka dipermalukan di hadapan banyak makhluk lalu diazab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 105",
    "description": "105. Mereka yang akan sia-sia usahanya dan tidak mendapat ganjaran di akhirat itu adalah orang-orang yang mengingkari ayat-ayat yang menunjukkan kebesaran, kekuasaan, dan keesaan tuhan mereka, dan mereka juga ingkar terhadap pertemuan dengan-Nya kelak di akhirat untuk mempertanggungjawabkan perbuatan mereka. Karena kekafiran dan keingkaran itu, maka sia-sia-lah semua amal mereka di dunia, dan karenanya kami tidak memberikan penimbangan terhadap amal mereka kelak pada hari kiamat. Tidak ada amal perbuatan mereka yang layak dipertimbangkan akibat kekufuran dan keingkaran mereka. 106. Demikianlah penjelasan dan ancaman yang kami siapkan bagi mereka. Balasan yang paling tepat bagi mereka itu adalah neraka jahanam. Hal itu karena kekafiran yang telah mereka lakukan dan karena mereka telah menjadikan ayat-ayat-ku yang menunjukkan kekuasaan, kebesaran, dan keesaan-ku yang amat jelas dan rasul-rasul-ku yang mengajak mereka ke jalan yang benar sebagai bahan olok-olok."
  }
]