[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Balasan yang telah disediakan bagi mereka karena terhapusnya amalan-amalan mereka adalah neraka jahanam, disebabkan oleh kekafiran mereka kepada Allah dan mereka menjadikan ayat-ayatNya dan hujah-hujah rasulNya sebagai bahan olokan dan ejekan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Balasan yang disediakan bagi mereka berupa Jahanam itu; disebabkan karena kekafiran mereka kepada Allah, dan karena mereka menjadikan ayat-ayat-Ku yang diturunkan dan para rasul sebagai bahan olok-olok semata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Keterangan yang telah disebut di atas yaitu tidak dihitung/tidak dinilainya amal yaitu pada lafadz jazauhum dan jahannam sebab kekufuran dan olok-olok mereka atas ayat-ayat dan dakwah rasul-rasul-Ku. Itu menunjukkan bahwa amal mereka tidak dinilai. Jazauhum sebagai khobar mubtada’, dan jahannam sebagai pengganti"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah balasan mereka berupa neraka Jahanam karena mereka telah ingkar serta menjadikan ayat-ayatKu dan rasul-rasulKu sebagai bahan olok-olokan} bahan ejekan dan olok-olok bagi mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. Oleh karena itu, Allah berfirman, “Demikianlah, balasan mereka itu,” yaitu terhapusnya amalan-amalan mereka, dan tidak diadakan suatu penilaian (amalan) bagi mereka pada Hari Kiamat lantaran kehinaan dan kerendahan derajat mereka dengan sebab kekufuran mereka kepada ayat-ayat Allah dan disebabkan tindakan mereka menjadikan ayat-ayat Allah dan para RasulNya sebagai bahan ejekan, mereka memperolok dan mencemoohi [nya]. Padahal kewajiban terhadap ayat-ayat Allah dan para RaulNya adalah beriman dengan sempurna kepadanya, mengagungkannya dan menjalankannya dengan sebaik-baiknya. Sedangkan mereka telah membalikkan persoalan, sehingga urusan mereka menjadi morat-marit, mereka celaka dan diceburkan ke dalam siksaan. Usai menjelaskan kesudahan kaum kafir dan amalan-amalan mereka, maka Allah menerangkan tentang amaliah kaum Mukminin dan tempat kembali mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 106: Yakni perkara yang telah disebutkan tentang hapusnya amal mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 106",
    "description": "106. Demikianlah penjelasan dan ancaman yang kami siapkan bagi mereka. Balasan yang paling tepat bagi mereka itu adalah neraka jahanam. Hal itu karena kekafiran yang telah mereka lakukan dan karena mereka telah menjadikan ayat-ayat-ku yang menunjukkan kekuasaan, kebesaran, dan keesaan-ku yang amat jelas dan rasul-rasul-ku yang mengajak mereka ke jalan yang benar sebagai bahan olok-olok. 107. Sesungguhnya orang-orang yang beriman dan membuktikan iman mereka dengan mengerjakan kebajikan yang disertai niat untuk mendapat rida Allah, maka untuk mereka telah disediakan surga firdaus yang penuh kenikmatan sebagai ganjaran dan tempat tinggal bagi mereka."
  }
]