[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepadaKu dan membenarkan rasul-rasulKu serta beramal shalih, bagi mereka surga paling tinggi, dan paling tengah-tengah serta paling utama sebagai tempat tinggal."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Sesungguhnya orang-orang beriman dan mengerjakan amal saleh, bagi mereka disediakan tingkat tertinggi dari Surga untuk tempat tinggal sebagai penghargaan terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107-108. Orang-orang beriman yang mengakui keesaan Allah dan mengaati-Nya dengan menjalankan amalan-amalan shalih, mereka akan mendapat derajat yang paling tinggi dan kedudukan yang paling baik di surga, mereka akan tinggal di dalamnya selamanya dan mereka tidak akan meminta untuk dipindahkan darinya. Lihat surat ‘Ali Imran ayat 163, di sana disebutkan hadits marfu’ yang diriwayatkan al-Bukhari dari Abu Hurairah: “…Jika kalian meminta kepada Allah maka mintalah surga firdaus, karena ia adalah surga yang ada di tengah dan paling tinggi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. إِنَّ الَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ الصّٰلِحٰتِ (Sesungguhnya orang-orang yang beriman dan beramal saleh) Ini merupakan kebalikan dari orang-orang yang disebutkan sebelumnya. كَانَتْ لَهُمْ جَنّٰتُ الْفِرْدَوْسِ(bagi mereka adalah surga Firdaus) Makna (الفردوس) dalam istilah orang arab merupakan pepohonan yang rimbun yang kebanyakannya merupakan pohon anggur. Sedangkan yang dimaksud dengan kata tersebut dalam ayat ini adalah surga yang tertinggi. نُزُلًا(menjadi tempat tinggal) Yang disiapkan bagi mereka sebagai penghormatan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Sesungguhnya orang-orang yang beriman kepada Allah dan rasul-Nya serta beramal saleh sesuai apa yang Allah perintahkan, maka bagi mereka adalah surga Firdaus yang menjadi tempat tinggal mereka. Surga Firdaus adalah surga paling tinggi derajatnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang beriman dan beramal shalih, bagi mereka itu surga Firdaus} surge paling tinggi, paling utama dan paling pertengahan {sebagai tempat tinggal} sebagai tempat tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. “Sesungguhnya orang-orang yang beriman,” dengan hati mereka “dan beramal shalih,” dengan anggota tubuh mereka. Sifat ini mencakup seluruh bagian agama: Akidah, amaliah-amaliah, perkara ushul dan cabang yang zahir maupun batin. Mereka itu –dengan perbedaan tingkatan mereka-, dalam keimanan dan amalan shalih mereka “mereka mendapatkan Surga Firdaus,” mengandung kemungkinan bahawa yang dimaksud surge-surga Firdaus adalah surge tertinggi, yang berada di tengah dan paling istimewa. Balasan ini diperuntukkan bagi orang yang telah menyempurnakan keimanan dan amal shalih. Mereka adalah para nabi dan orang-orang yang didekatkan dengan Allah. Dan mengandung kemungkinan mengarah kepada pengertian semua hunian di surge, sehingga balasan ini menyeluruh bagi semua orang dari semua tingkatan iman, dari kalangan muqarrabin (orang-orang yang didekatkan kedudukannya kepada Allah), abrar (orang-orang baik) dan orang-orang yang hanya mempunyai amalan yang pas-pasan. Semua sesuai dengan keadaannya. Pengertian ini [lebih utama] dibandingkan yang pertama, karena sisi keumumannya dank arena penyebutan kata surge جنا تdalam bentuk jamak (plural) yang dikaitkan dengan firdaus. Lafazh Firdaus, mencakup juga makna kebun yang terisi oleh pohon kurma dan pepohonan yang rimbun. Keterangan ini berlaku pada semua surga. Surga Firdaus merupakan tempat tinggal dan wahana perjamuan bagi orang-orang yang beriman dan beramal shalih. Manakah bentuk perjamuan yang lebih mulia, besar, dan agung dibandingkan dengan cara perjamuan ini yang mengandung segala kenikmatan bagi hati, jiwa dan raga? Di dalamnya terdapat segala yang diinginkan oleh jiwa dan sedap dipandang mata, berupa hunian-hunian yang elok, taman-taman yang memikat, pohon-pohon yang berbuah, burung-burung yang berkicauan, makanan-makanan yang lezat, minuman yang menggugah minat, wanita-wanita yang cantik, pelayan-pelayan, anak-anak kecil, sungai-sungai yang mengalir, panorama-panorama yang fantastik, keindahan kasat mata dan maknawi dan kenikmatan yang lestari. Kenikmatan yang lebih tinggi, utama dan mulia, adalah menikmati kedekatan dengan ar-Rahman, memperoleh ridhaNya yang merupakan anugerah paling besar di surga, serta menikmati mellihat wajah Allah yang mulia, mendengarkan perkataan Dzat Yang Pengasih lagi Maha Penyayang. Ingatlah bentuk perjamuan itu. Alangkah agung, indah, langgeng, dan sempurnanya! Kenikmatan itut lebih agung dibandingkan apa yang dideskripsikan oleh seseorang dari seluruh makhluk atau terbetik dalam hati. Jika para hamba mengetahui sebagian saja, dengan ilmu yang meyakinkan yang menembus hati mereka, tentulah hati mereka akan melayang-layang mengharapkannya dengan penuh kerinduan, dan jiwa-jiwa mereka akan terkoyak-koyak karena rasa pedih atas perpisahan dengannya, benar-benar mereka akan berjalan ke arahnya saja, berbondong-bondong maupun sendiri-sendiri. Mereka tidak akan pernah mengutamakan dunia yang fana, kelezatan yang penuh dengan noda dan akan pudar ini, tidak melewatkan waktu-waktunya pergi sia-sia dalam keadaan mendatangkan kerugian (untuk menukarnya), dengan mempertaruhkan setiap detik untuk mendapatkan kenikmatan selama beribu-rib tahun lamanya. Akan tetapi, kelalaian begitu merata, keimanan melemah dan ilmu dangkal, serta niatan layu, maka terjadilah realitas yang ada. Tidak ada daya dan kekuatan kecuali dengan (pertolongan) Allah Yang Mahatinggi lagi Maha agung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 107: Dengan hatinya. Dengan anggota badannya. Mereka ini –meskipun tingkatan imannya berbeda-beda- akan mendapatkan surga-surga Firdaus. Maksud surga-surga Firdaus bisa bagian atas surga dan tengahnya, dan bagian yang utamanya. Balasan ini diperuntukkan bagi orang yang menyempurnakan iman dan amal saleh, yaitu para nabi dan orang-orang yang didekatkan. Bisa juga maksudnya, semua tempat-tempat di surga. Oleh karena itu, balasan ini diperuntukkan kepada semua orang yang beriman meskipun berbeda-beda tingkatannya, baik orang-orang yang didekatkan, orang-orang yang berbakti, dan orang-orang yang pertengahan; masing-masing sesuai keadaannya. Makna seperti ini nampaknya lebih utama dipegang karena keumumannya, dan karena kata “jannah” (surga) disebutkan dengan bentuk jama’ (banyak). Di samping itu, kata firdaus biasa dipakai untuk kebun yang penuh dengan buah anggur atau pohon-pohon yang lebat, dan hal ini ada pada semua surga. Oleh karena itu, surga Firdaus merupakan jamuan untuk orang-orang yang beriman dan beramal saleh. Jamuan apakah yang lebih besar daripadanya, di mana jamuan tersebut penuh dengan kenikmatan, baik bagi hati, ruh maupun badan, di dalamnya terdapat apa saja yang disenangi jiwa dan dinikmati oleh mata seperti tempat-tempat yang indah, kebun-kebun yang segar, pohon-pohon yang berbuah, burung-burung yang berkicau, makanan yang lezat, minuman yang enak, wanita yang cantik, pemandangan yang menarik, pelayanan dari anak-anak yang tetap muda, sungai-sungai yang mengalir, kenikmatan yang kekal, dan yang lebih tinggi, lebih utama dan lebih besar dari itu adalah kenikmatan dekat dengan Ar Rahman, mendapatkan ridha-Nya, melihat wajah-Nya, dan mendengarkan firman-Nya. Jika sekiranya manusia mengetahui sebagian nikmat itu dengan pengetahuan yang hakiki, tentu hati mereka akan melayang kepadanya karena merindukannya, dan mereka tidak lagi mengutamakan dunia yang fana, dan tidak akan menyia-nyiakan waktu yang ada, bahkan akan mengisinya dengan amal yang dapat memasukkan dirinya ke surga, akan tetapi kelalaian yang memenuhi dirinya, iman yang lemah, ilmu yang kurang dan keinginan yang lemah, sehingga terjadilah apa yang terjadi, wa laa haula wa laa quwwata illa billah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 107",
    "description": "107. Sesungguhnya orang-orang yang beriman dan membuktikan iman mereka dengan mengerjakan kebajikan yang disertai niat untuk mendapat rida Allah, maka untuk mereka telah disediakan surga firdaus yang penuh kenikmatan sebagai ganjaran dan tempat tinggal bagi mereka. 108. Dengan rahmat Allah yang demikian besar kepada hamba-Nya yang mematuhi ajaran-Nya, mereka akan kekal di dalamnya. Karena nikmat yang demikian banyak dan kepuasan di dalam surga itu mereka tidak ingin pindah dari sana untuk mendapatkan kenikmatan yang lain."
  }
]