[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka kekal abadi di dalamnya.Mereka tidak menginginkan pindah darinya karena suka dan kecintaan mereka terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Mereka akan tinggal kekal di dalamnya, dan sama sekali tidak akan meminta pindah darinya karena Surga tidak ditandingi oleh tempat dan balasan apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. لَا يَبْغُونَ عَنْهَا حِوَلًا (mereka tidak ingin berpindah dari padanya) Yakni mereka tidak ingin berpindah darinya kerena surga itu jauh lebih mulia dari yang lain. Imam Ahmad dan Tirmidzi mengeluarkan hadits dari Ubadah bin Shamit, bahwa Rasulullah bersabda: “Sesungguhnya di surga terdapat seratus tingkatan, setiap tingkatnya berjarak antara langit dan bumi, dan surga Firdaus adalah tingkat yang tertinggi, yang diatasnya terdapat ‘Arsy, dan dari surga Firdaus terpancar empat sungai surga, oleh sebab itu jika kalian memimta kepada Allah maka mintalah surga Firdaus."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Jika dikatakan : sesungguhnya surga itu penuh dengan kebaikan-kebaikan, maka dari segi apa untuk meyakinkan bahwa penghuninya tidak akan berpindah darinya? dijawab : bahwasanya manusia kadang kala menemukan dalam rumah yang mewah kejenuhan dan hal yang tidak ia senangi secara pribadi, sehingga membuatnya ingin berpindah ke rumah yang lainnya, namun surga tidak demikian adanya. 2 ). Coba banyangkan keadaan penghuni dunia denngan firman Allah tentang penghuni surga : { لَا يَبْغُونَ عَنْهَا حِوَلً } \"mereka tidak ingin berpindah dari padanya.\" kamu akan menemukan dari mereka yang memiliki apartemen berkeinginan untuk mempunyai rumah pribadi, setelah memilikinya ia kemudian berkeinginan untuk memiliki istana yang megah, dan seterusnya... namun tidak dengan penghuni surga; sesungguhnya semua fasilitas tempat tinggal telah tersedia untuk mereka, sehingga tidak ada lagi keinginan untuk berpindah darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Mereka kekal di dalamnya, mereka tidak ingin keluar dari surga itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka kekal} mereka kekal {di dalamnya, mereka tidak ingin} tidak ingin {pindah dari sana} pindah ke tempat lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Firman Allah, “Mereka kekal di dalamnya.” Ini kelengkapan nikmatnya, di dalamnya terdapat kenikmatan yang sempurna. Termasuk bentuk kesempurnaannya adalah bahwa nikmat tersebut tidak berhenti “mereka tidak ingin berppindah darinya,” maksudnya berpindah dan beralih. Karena mereka tidak melihat kecuali hal yang menakjubkan mereka, menceriakan mereka, menyenangkan mereka dan membahagiakan mereka. Tidak pernah menyaksikan kenikmatan yang lebih dari apa yang mereka rasakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 108: Yang demikian karena mereka tidak melihat di surga selain yang menyenangkan mereka dan mereka tidak melihat kenikmatan yang lebih daripada itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 108",
    "description": "108. Dengan rahmat Allah yang demikian besar kepada hamba-Nya yang mematuhi ajaran-Nya, mereka akan kekal di dalamnya. Karena nikmat yang demikian banyak dan kepuasan di dalam surga itu mereka tidak ingin pindah dari sana untuk mendapatkan kenikmatan yang lain. 109. Pada bagian sebelumnya banyak informasi yang Allah sampaikan, seperti kisah ashabul kahfi, khidir, dan zulkarnain. Kemudian, pada bagian akhir surah ini Allah menjelaskan betapa ilmu-Nya sangat luas. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir itu, 'seandainya semua lautan di dunia ini menjadi tinta untuk menulis kalimat- kalimat tuhanku yang mencakup semua pengetahuan, maka pasti akan habislah seluruh air lautan itu sebelum selesai penulisan kalimat-kalimat tuhanku. Demikian juga keadaannya meskipun kami datangkan tambahan lautan sebanyak itu pula untuk menuliskannya, kalimat-kalimat itu tidak akan habis."
  }
]