[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), seandainya air lautan menjadi tinta bagi pena-pena yang digunakan untuk menulis kalamullah dari ilmu dan hikmahNya serta apa yang diwahyukan olehNya kepada malaikat dan rosul-rosulNya, pastilah akan habis air laut itu sebelum habis kalimat-kalimat tersebut. Seandainya kami mendatangkan air sebanyak air laut itu pula dari lautan yang lain sebagai tinta untuk itu, niscaya pasti akan habis pula. Dalam ayat ini terdapat dalil penetapan sifat kalam bagi Allah secara hakiki yang sesuai dengan keagungan dan kesempurnaanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Katakanlah wahai Rasul, \"Sungguh kalimat-kalimat Tuhanku sangat banyak. Seandainya lautan menjadi tinta untuk menuliskannya, niscaya air lautan itu akan habis sebelum selesai penulisan kalimat-kalimat-Nya tersebut, bahkan meskipun Kami datangkan tambahan berupa laut-laut yang lain, maka ia pasti akan habis pula sebelum selesai menuliskannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Allah menjelaskan keluasan ilmu-Nya. Hai Rasulullah, katakanlah seandainya lautan di dunia adalah tinta bagi pena yang menulis kalimat-kalimat Allah, niscaya air lautan itu akan habis karena begitu banyaknya kalimat tersebut, bahkan kalimat tersebut tidak akan habis, bahkan jika Kami tambah lagi dengan air yang semisal lautan itu, sebab kalimat Allah tidak akan habis karena ilmu-Nya yang begitu luas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. قُل لَّوْ كَانَ الْبَحْرُ مِدَادًا لِّكَلِمٰتِ رَبِّى (Katakanlah: Sekiranya lautan menjadi tinta untuk (menulis) kalimat-kalimat Tuhanku) Yakni seandainya kalimat-kalimat dari ilmu dan hikmah Allah ditulis, dan air lautan dijadikan tinta untuk menulisnya niscaya lautan itu akan habis sebelum tertulis seluruh kalimat. Dan seandainya Kami datangkan lagi tinta semisal air lautan niscaya akan habis juga. Dari ayat ini dapat diambil faidah bahwa kalimat-kalimat Allah sangatlah banyak sehingga pena dan kitab tidak akan dapat cukup untuk menuliskannya semua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Katakanlah wahai Nabi: “Sekiranya lautan menjadi tinta untuk menulis kalimat-kalimat ilmu Allah yang tidak terbatas, sungguh lautan itu akan habis sebelum kalimat-kalimat dan ilmu Allah tertulis semua, meskipun Kami datangkan tambahan laut sebanyak itu pula\". Al-madad adalah tambahan atau pertolongan, maksudnya adalah bahwa makna tersebut adalah mutlak hanya dari Allah, yaitu ilmu yang tidak ada batasnya, sedangkan laut adalah sesuatu yang terbatas. Orang Yahudi berkata: Kami diberi ilmu yang banyak, juga kitab Taurat. Barang siapa yang diberi Taurat maka telah mendapat kebaikan yang banyak. Sehingga turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Seandainya lautan menjadi tinta} tinta {untuk (menulis) kalimat-kalimat Tuhanku, niscaya habislah} niscaya hilang dan habis {lautan itu sebelum kalimat-kalimat Tuhanku selesai meskipun Kami datangkan tambahan} dukungan dan tambahan {serupa itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. Maksudnya, katakanlah kepada mereka untuk memberitahukan tentang keagungan al-Bari (Dzat Pencipta) dan luasnya cakupan sifat-sifatNya, bahwasanya para hamba tidak dapat meliputinya sedikit pun “kalau sekiranya lautan,” yaitu lautan-lautan yang ada di alam ini “menjadi tinta untuk (menulis) kalimat-kalimat Rabbku,” maksudnya pohon-pohon dunia sejak pertama (tumbuh) sampai tanaman terakhkir (yang hidup), dari pohon-pohon di negeri-negeri, padang-padang dan lautan menjadi pena-pena “sungguh habislah lautan itu,” maksudnya pena-pena itu akan patah “sebelum habis (ditulis) kalimat-kalimat Rabbku.” Ini perkara yang agung, tidak dapat dikuasai oleh seorang pun. Dalam ayat yang lain, \"Dan seandainya pohon-pohon di bumi menjadi pena dan laut (menjadi tinta), ditambahkan kepadanya tujuh laut (lagi) sesudah (kering) nya, niscaya tidak akan habis-habisnya (dituliskan) kalimat Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.\" (Luqman:27). Keterangan ini termasuk cara untuk mendekatkan hakikat makna ini ke hadapan alam pikiran. Sebab benda-benda tersebut makhluk ciptaan, sedangkan semua makhluk akan berakhir dan musnah. Adapun Kalamullah, maka ia termasuk kategori sifat-sifatNya. Sedangkan sifat-sifatNya bukan makhluk, tidak ada batasan dan penghabisan. Segala keluasan dan keagungan yang dideskripsikan oleh hati, maka Allah lebih tinggi daripada itu. Beginilah sifat-sifat Allah yang lain, seperti ilmu, hikmah, kekuasaan, dan rahmatNya. Jika seluruh ilmu makhluk di kumpulkan dari generasi awal dan akhir, dari penghuni langit dan bumi niscaya (dibandingkan dengan ilmu Alah Dzat yang Mahaagung perbandingannya) adalah lebih kecil daripada (perbandingan antara) burung pipit yang masuk ke dalam laut kemudian ia mengambil (sesuatu) dengan paruhnya dari laut itu ditinjau pada kebesaran laut tersebut. Ini menunjukkan bahwa Allah mempunyai sifat-sifat yang agung luas dan sempurna, dan kepadaNya-lah segala penghabisan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 109: Kepada mereka tentang keagungan Allah, keluasan sifat-Nya dan bahwa manusia tidak mampu mencapainya. Dalam ayat lain disebutkan, “Dan seandainya pohon-pohon di bumi menjadi pena dan laut (menjadi tinta), ditambahkan kepadanya tujuh laut (lagi) setelah (kering)nya, niscaya tidak akan habis-habisnya (dituliskan) kalimat Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.” (Terj. Luqman: 27) ayat di atas termasuk pendekatakan makna agar lebih mudah dicerna, karena semua yang disebutkan itu makhluk, sedangkan makhluk ada habisnya, adapun firman Allah, maka termasuk sifat-Nya, sedangkan sifat-Nya bukan makhluk dan tidak ada batasnya. Keluasan dan kebesaran apa saja yang dibayangkan hati, maka Allah Subhaanahu wa Ta'aala lebih dari itu, demikian pula semua sifat Allah Ta’ala, seperti ilmu-Nya, hikmah-Nya, qudrat(kekuasaan)-Nya dan rahmat-Nya. Oleh karena itu, jika pengetahuan makhluk terdahulu maupun yang datang kemudian dikumpulkan, baik yang terdiri dari penghuni langit maupun penghuni bumi, tentu jika dihubungkan kepada ilmu Allah, maka lebih kecil daripada air yang diteguk oleh seekor burung dengan paruhnya ke tengah-tengah lautan. Yang demikian adalah karena Allah Subhaanahu wa Ta'aala memiliki sifat-sifat yang agung lagi luas, dan bahwa kepada-Nya kembali semua kesudahan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 109",
    "description": "109. Pada bagian sebelumnya banyak informasi yang Allah sampaikan, seperti kisah ashabul kahfi, khidir, dan zulkarnain. Kemudian, pada bagian akhir surah ini Allah menjelaskan betapa ilmu-Nya sangat luas. Wahai nabi Muhammad, katakanlah kepada orang-orang kafir itu, 'seandainya semua lautan di dunia ini menjadi tinta untuk menulis kalimat- kalimat tuhanku yang mencakup semua pengetahuan, maka pasti akan habislah seluruh air lautan itu sebelum selesai penulisan kalimat-kalimat tuhanku. Demikian juga keadaannya meskipun kami datangkan tambahan lautan sebanyak itu pula untuk menuliskannya, kalimat-kalimat itu tidak akan habis. 110. Allah memerintah nabi untuk menjelaskan jati dirinya. Katakanlah, 'sesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah diwahyukan kepadaku sesuai kehendak Allah bahwa sesungguhnya tuhan kamu yang menjadi tujuan ibadah adalah tuhan yang maha esa, baik dalam zat, sifat, maupun perbuatan-Nya. Maka, barang siapa mengharap pertemuan dengan tuhannya dan menghendaki ganjaran atas amal perbuatannya di akhirat kelak, maka hendaklah dia selalu mengerjakan kebajikan dan menjauhi semua hal keji dan mungkar serta janganlah dia mempersekutukan dengan sesuatu pun dalam beribadah kepada tuhannya. Hendaklah dia beribadah kepada-Nya dengan tulus, bukan karena ria, dan dilandasi niat untuk menggapai rida-Nya. '."
  }
]