[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami lemparkan kepada mereka tidur yang nyenyak sehingga mereka berdiam di sana dalam jangka waktu yang lama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Setelah mereka masuk dan berlindung dalam gua itu, Kami pun menutup telinga mereka agar tidak mendengar apapun, dan menidurkan mereka dalam kurun tahun yang begitu lama."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. فَضَرَبْنَا عَلَىٰٓ ءَاذَانِهِمْ (Maka Kami tutup telinga mereka) Yakni Kami tutup telinga mereka sehingga tidak dapat mendengarkan berbagai suara dengan menidurkan mereka. سِنِينَ عَدَدًا (beberapa tahun) Yakni dalam tahun-tahun yang banyak yang sudah diketahui jumlahnya, dan penjelasannya akan disebutkan pada akhir kisah mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Penggunaan kalimat \"kami tutup telinga mereka\" karena seseorang dikatakan tidur jika pendengarannya sedang tidak bekerja, sebagaimana yang juga dikatakan dalam hadits : \"Laki-laki itu telah dikencingi setan pada telinganya\" yakni : tidurnya menjadi berat sehingga ia tidak dapat bangun malam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Maka Kami tutup telinga mereka atau Kami jadikan mereka tertidur pulas sehingga tidak mendengar apa-apa selama beberapa tahun dalam gua itu,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Kami menutup telinga mereka} lalu Kami membuat mereka tertidur lelap sehingga suara tidak bisa menjangkau mereka {di dalam gua itu selama bertahun-tahun} yang jumlahnya banyak"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Oleh karena itu, Allah mengabulkan doa mereka dan mengondisikan sesuatu yang belum pernah mereka sangka. Allah berfirman, “Maka kami tutup telinga mereka dalam gua itu,” maksudnya Kami telah menidurkan mereka “beberapa tahun,” yaitu tiga ratus Sembilan tahun lamanya. Dalam tidur itu, mengandung unsur pemeliharaan terhadap kalbu-kalbu mereka dari kegoncangan dan ketakutan serta penjagaan dari (suksaan) kaumnya (dan agar menjadi sebuah bukti nyata (tentang kekuasaan Allah)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 11: Yakni Kami tidurkan mereka. Maksudnya, Allah menidurkan mereka selama 309 tahun qamariah dalam gua itu (Lihat ayat 25) sehingga mereka tidak dapat dibangunkan oleh suara apa pun. Dalam tidur mereka selama ratusan tahun itu untuk menjaga mereka dari keguncangan hati dan rasa takut, demikian pula untuk menjaga mereka dari penangkapan oleh kaum mereka, serta sebagai salah satu di antara ayat-ayat Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 11",
    "description": "Maka kami kami mengabulkan doa mereka, kami tutup telinga mereka di dalam gua itu, agar mereka tidak dapat mendengar suara, maka mereka tertidur lelap di dalam gua itu selama beberapa tahun, yaitu sekitar tiga ratus tahun seperti yang akan disebutkan pada ayat 25. Kemudian apabila telah tiba waktunya, kami bangunkan mereka dari tidur yang lelap agar kami mengetahui manakah di antara kedua golongan itu yang berselisih pendapat tentang berapa lamanya mereka tertidur di dalam gua, yang lebih tepat dalam menghitung berapa lamanya mereka tinggal dalam gua itu. Tidak ada siapa pun di antara mereka yang dapat menghitungnya dengan tepat, maka mereka pun menyerahkan urusan ini kepada Allah. Hanya Allah yang mengetahui berapa lamanya mereka tinggal di dalam gua itu."
  }
]