[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul), kepada kaum musyrikin, ”sesungguhnya aku hanyalah manusia biasa seperti kalian yang diwahyukan kepadaku dari tuhanku, ’bahwa sesungguhnya tuhan kalian adalah tuhan yang satu’ maka barangsiapa yang takut terhadap siksaan tuhannya dan mengharapkan pahalaNya dan perjumpaaan denganNya, hendaknya dia beramal shalih bagi tuhannya yang sesuai dengan tuntutan syariatNya, dan tidak menyekutukan seseorangpun denganNya dalam ibadah kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Katakanlah wahai Rasul, \"Sungguh aku ini hanyalah manusia seperti kalian, yang telah menerima wahyu bahwa Tuhan sesembahan kalian yang benar adalah Tuhan yang Esa tiada sekutu bagi-Nya, yaitu Allah.\" Maka barangsiapa yang mengharap perjumpaan dengan Tuhannya maka hendaklah ia mengerjakan amalan yang sesuai dengan syariatnya, disertai keikhlasan dalam melakukannya, dan tidak menyekutukan dengan sesuatu pun dalam beribadah kepada Tuhannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Hai Nabi, katakanlah kepada orang-orang musyrik: “Aku hanyalah seorang manusia seperti kalian yang Allah muliakan dengan wahyu, Allah memerintahkanku untuk menyampaikan kepada kalian bahwa Dia adalah Tuhan kalian Yang Satu, tidak ada sekutu bagi-Nya. maka barangsiapa yang mengharap pahala Allah dan takut dari siksaan-Nya, maka hendaklah dia mengerjakan amal shalih di dunia dan tidak menjadikan seorang makhlukpun sebagai sekutu dalam penyembahan-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. قُلْ إِنَّمَآ أَنَا۠ بَشَرٌ مِّثْلُكُمْ (Katakanlah: Sesungguhnya aku ini manusia biasa seperti kamu) Yakni aku hanyalah seorang manusia dan tidak akan berubah menjadi malaikat atau tuhan. يُوحَىٰٓ إِلَىَّ(yang diwahyukan kepadaku) Dan cukuplah ini menjadi pembeda antara beliau dengan manusia lainnya. أَنَّمَآ إِلٰهُكُمْ إِلٰهٌ وٰحِدٌ ۖ( Bahwa sesungguhnya Tuhan kamu itu adalah Tuhan yang Esa) Tidak ada sekutu bagi-Nya dalam ketuhanan. فَمَن كَانَ يَرْجُوا۟ لِقَآءَ رَبِّهِۦ (Barangsiapa mengharap perjumpaan dengan Tuhannya) Barangsiapa yang mengharapkan ini, yang merupakan harapan orang-orang beriman. فَلْيَعْمَلْ عَمَلًا صٰلِحًا (maka hendaklah ia mengerjakan amal yang saleh) Yaitu apa yang ditunjukkan oleh syariat bahwa itu merupakan amal kebaikan, yang pelakunya akan diberi pahala. وَلَا يُشْرِكْ بِعِبَادَةِ رَبِّهِۦٓ أَحَدًۢا(dan janganlah ia mempersekutukan seorangpun dalam beribadat kepada Tuhannya) Yakni janganlah menyekutukan-Nya dengan makhluk-Nya baik itu orang shalih, orang jahat, binatang, atau benda mati. Dan termasuk dalam larangan ini adalah syirik yang tersembunyi yang disebut dengan riya. Imam Ahmad dan Ibnu Sa’ad mengeluarkan hadits dari Abu Sa’id bin Abu Fadhalah al-Anshari, ia berkata: aku pernah mendengar Rasulullah bersabda: “apabila Allah telah mengumpukan orang-orang terdahulu dan orang-orang yang datang selanjutnya di hari yang tidak ada keraguan kejadiannya, maka seorang penyeru akan menyerukan “Barangsiapa yang menyekutukan Allah dengan seseorang dalam amalannya, maka hendaklah ia meminta pahalanya dari orang yang dijadikan sekutu itu, sebab Allah adalah Dzat yang tidak butuh pada sekutu.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Hikmah dari penambahan lafadz (مِّثْلُكُمْ) \"seperti kamu\" -والله أعلم- sebagai penekanan akan kesamaan Muhammad dengan manusia lainnya, dan bahwasanya tidaklah aku lebih istimewa dari kalian kecuali pada wahyu yang diturunkan kepadaku : { يُوحَىٰٓ إِلَىَّ أَنَّمَآ إِلَٰهُكُمْ إِلَٰهٌ وَٰحِدٌ } \"yang diwahyukan kepadaku: \"Bahwa sesungguhnya Tuhan kamu itu adalah Tuhan yang Esa\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Katakanlah wahai Nabi: “Sesungguhnya aku ini hanya manusia biasa seperti kamu, namun Allah mengkhususkanku dengan memberi wahyu dan risalah. Wahyu tersebut adalah yang menyebutkan bahwa sesungguhnya Tuhan itu adalah Tuhan Yang Esa tidak ada sekutu bagi-Nya. Barangsiapa mengharap perjumpaan dengan Tuhannya dengan hari kebangkitan dan pembalasan. Itu termasuk ciri orang mukmin, maka hendaklah ia mengerjakan amal yang saleh di dunia berupa segala yang ditunjukkan oleh syariat bahwa sesuatu mengandung kebaikan dan pahala. Serta tidak mempersekutukan Tuhannya dengan sesuatu apapun dalam penyembahan-Nya\". Riya’ termasuk perbuatan yang ada unsur kesyirikan, dan termasuk syirik kecil"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Sesungguhnya aku ini hanya seorang manusia seperti kalian yang diwahyukan kepadaku bahwa Tuhan kalian adalah Tuhan Yang Maha Esa” Siapa saja yang mengharapkan pertemuan dengan Tuhannya, maka hendaklah beramal shalih dan tidak mennyekutukan Tuhannya dengan siapa pun dalam beribadah}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. Maksudnya, katakanlah wahai Muhammad kepada orang-orang kafir dan selain mereka, “Sesungguhnya aku ini hanya seorang manusia seperti kamu,” maksudnya aku bukan tuhan, tidak punya andil dalam kerajaan ini, tidak memiliki pengetahuan tentang hal yang ghaib, dan tidak mengendalikan perbendaharaan Allah. Aku hanyalah manusia seperti kalian “yang diwahyukan kepadaku, ‘Bahwa Tuhanmu itu adalah Tuhan Yang Esa’,” maksudnya tidak ada sekutu bagiNya, dan tidak ada sekutu bagiNya, dan tidak ada seorang pun yanng berhak diibadahi, dengan ibadah seberat biji dzarrah pun [selainNya]. Aku mengajak kalian untuk beramal yang mendekatkan kalian kepadaNya dan menghasilkan bagi kalian pahala dan menyingkirkan hukumanNya dari kalian. Oleh karen itu, Allah berfirman, “barangsiapa mengharap perjumpaan dengan Rabbnya, maka hendaklah dia mengerjakan amal yang shalih,” yaitu amalan yang selaras dengan aturan syariat Allah, yang wajib maupun sunnah “dan janganlah dia mempersekutukan seorang pun dalam beribadah kepada Rabbnya,” maksudnya tidak berbuat riya’ dengan amalanya, tetapi hendaklah dia mengamalkannya dengan ikhlas karena Wajah Allah. Orang yang telah memadukan antara ikhlas dan mutaba’ah (meneladani Rasul) dialah orang yang meraih apa yang ia harapkan dan ia cari. Adapun orang selain ini, maka dia akan merugi di dunia dan akhirat, kesempatan kedekatan dengan Rabbnya dan perolehan ridhaNya telah hilang darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 110: Yakni aku bukanlah tuhan, dan tidak bersekutu dalam kerajaan-Nya, aku tidak mengetahui yang gaib dan tidak ada pada sisi-Ku perbendaharaan-perbendaharaan Allah. Inilah makna Muhammad shallallahu 'alaihi wa sallam sebagai hamba Allah.. Yakni aku dilebihkan di atas kamu dengan memperoleh wahyu, yang isinya bahwa Tuhan kamu adalah Tuhan yang Maha Esa, di mana tidak ada yang berhak disembah dan ditujukan berbagai ibadah kecuali Dia, tidak ada sekutu bagi-Nya. Aku mengajak kamu untuk mengerjakan amal yang dapat mendekatkan dirimu kepada-Nya, mendapatkan pahala-Nya dan dijauhkan dari siksa-Nya, yaitu dengan mengerjakan amal saleh dan tidak berbuat syirk di dalamnya. Yaitu amal yang sesuai syari’at, baik yang wajib maupun yang sunat. Seperti berbuat riya. Ayat ini menerangkan syarat diterimanya amal, yaitu ikhlas karena Allah dan mutaba’ah (sesuai dengan sunnah Rasulullah shallallahu 'alaihi wa sallam). Keduanya ibarat sayap burung, jika salah satunya tidak ada, maka burung tidak dapat terbang. Orang yang ikhlas dan mengikuti sunnah Rasulullah shallallahu 'alaihi wa sallam dalam amalnya, itulah yang memperoleh apa yang dia harapkan dan yang dia minta. Sedangkan selainnya, maka dia akan rugi di dunia dan akhirat, tidak memperoleh kedekatan dengan Tuhannya dan tidak mendapat ridha-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 110",
    "description": "110. Allah memerintah nabi untuk menjelaskan jati dirinya. Katakanlah, 'sesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah diwahyukan kepadaku sesuai kehendak Allah bahwa sesungguhnya tuhan kamu yang menjadi tujuan ibadah adalah tuhan yang maha esa, baik dalam zat, sifat, maupun perbuatan-Nya. Maka, barang siapa mengharap pertemuan dengan tuhannya dan menghendaki ganjaran atas amal perbuatannya di akhirat kelak, maka hendaklah dia selalu mengerjakan kebajikan dan menjauhi semua hal keji dan mungkar serta janganlah dia mempersekutukan dengan sesuatu pun dalam beribadah kepada tuhannya. Hendaklah dia beribadah kepada-Nya dengan tulus, bukan karena ria, dan dilandasi niat untuk menggapai rida-Nya. '1. Bila surah al-kahf ditutup dengan penegasan tentang luasnya ilmu Allah dan perintah untuk berbuat kebajikan dan bertauhid dalam ibadah kepada-Nya, maka surah maryam mengingatkan kembali manusia tentang ilmu Allah lainnya yang terkandung dalam berbagai ayat Al-Qur'an, seperti k'f h' y' 'ain s'd. Makna sesungguhnya dari ayat ini hanya diketahui oleh Allah. Tujuannya adalah menggugah perhatian manusia tentang Al-Qur'an yang penuh hikmah dan tuntunan."
  }
]