[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami bangunkan mereka dari tidur mereka, untuk Kami tampakan kepada manusia apa yang telah Kami ketahui sejak azali, sehingga jelas perbedaan pihak mana dari dua pihak yang saling berbeda pendapat yang lebih tepat dalam menghitung; apakah mereka tinggal selama sehari, atau hanya sebagian hari saja, ataukah dalam waktu yang lama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Setelah melewati masa tidur yang begitu lama, Kami pun membangunkan mereka agar Kami mengetahui -secara nyata- manakah di antara kedua golongan yang berselisih -tentang masa menetapnya mereka dalam gua- itu yang lebih tepat dalam menghitungnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. ثُمَّ بَعَثْنٰهُمْ (Kemudian Kami bangunkan mereka) Yakni Kami bangunkan mereka dari tidur mereka. لِنَعْلَمَ أَىُّ الْحِزْبَيْنِ(agar Kami mengetahui manakah di antara kedua golongan itu) Yakni golongan orang-orang beriman dan golongan orang-orang kafir yang saling berselisih tentang masa tinggal mereka dalam gua. أَحْصَىٰ( yang lebih tepat dalam menghitung) Yang lebih tepat. لِمَا لَبِثُوٓا۟ أَمَدًا (berapa lama mereka tinggal (dalam gua itu)) Lama waktu tinggal di dalam gua sambil tertidur."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Kemudian Kami bangunkan mereka, agar Kami mengetahui manakah di antara kedua golongan itu yang lebih tepat dalam menghitung berapa lama mereka tidur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Kami membangunkan mereka} membangunkan mereka dari tidur mereka {supaya Kami mengetahui manakah di antara dua golongan itu} dua golongan yang berselisih tentang lama waktu tidur mereka di dalam gua {yang lebih tepat menghitung} yang lebih tepat {atas berapa lama} lamanya dan batasnya {mereka tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. “Kemudian Kami bangunkan mereka,” yaitu dari tidur mereka. “Agar Kami mengetahui manakah di antara kedua golongan itu yang lebih tepat dalam mengitung berapa lamanya mereka tinggal (dalam gua itu),” maksudnya agar Kami mengetahui siapakah di antara mereka yang lebih tepat dalam menghitung rentang waktu mereka tinggal (di dalam gua). Sebagaimana Allah berfirman, \"Dan demikianlah Kami bangunkan mereka agar mereka saling bertanya di antara mereka sendiri. Berkatalah salah seorang di antara mereka: \"Sudah berapa lamakah kamu berada (di sini?)\". Mereka menjawab: \"Kita berada (di sini) sehari atau setengah hari\". Berkata (yang lain lagi): \"Tuhan kamu lebih mengetahui berapa lamanya kamu berada (di sini). Maka suruhlah salah seorang di antara kamu pergi ke kota dengan membawa uang perakmu ini, dan hendaklah dia lihat manakah makanan yang lebih baik, maka hendaklah dia membawa makanan itu untukmu, dan hendaklah dia berlaku lemah lembut dan janganlah sekali-kali menceritakan halmu kepada seseorang pun.\" (Al-Kahfi: 19). Berkaitan dengan mengetahui berapa lama mereka tinggal terdapat keakuratan dalam menghitung dan pengenalan tentang kesempurnaan kekuasaan Allah, hikmah dan rahmatNya. Seandainya mereka terus tidur, maka tidak ada pengetahuan tentang kisah mereka sedikit pun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 12: Kedua golongan itu ialah pemuda-pemuda itu sendiri yang berselisih tentang berapa lamanya mereka tinggal dalam gua itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 12",
    "description": "Kemudian apabila telah tiba waktunya, kami bangunkan mereka dari tidur yang lelap agar kami mengetahui manakah di antara kedua golongan itu yang berselisih pendapat tentang berapa lamanya mereka tertidur di dalam gua, yang lebih tepat dalam menghitung berapa lamanya mereka tinggal dalam gua itu. Tidak ada siapa pun di antara mereka yang dapat menghitungnya dengan tepat, maka mereka pun menyerahkan urusan ini kepada Allah. Hanya Allah yang mengetahui berapa lamanya mereka tinggal di dalam gua itu. Kami akan ceritakan kepadamu dengan rinci wahai nabi Muhammad kisah mereka yang penting dan menakjubkan itu dengan sebenarnya, tidak ada keraguan maupun kesamaran agar engkau jelaskan kepada orang-orang yang bertanya dan menjadi pelajaran bagimu dan bagi umatmu. Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada tuhan mereka dengan keimanan yang benar, tetapi mereka ditindas oleh penguasa pada masanya maka kami kukuhkan iman mereka dan kami tambahkan petunjuk kepada mereka kepada jalan yang benar."
  }
]