[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami akan menceritakan kepadamu (wahai rasul), berita tentang mereka dengan benar. Sesungguhnya para penghuni gua itu adalah para pemuda yang beriman kepada tuhan mereka dan menyambut seruanNya dan Kami menambahkan mereka petunjuk dan keteguhan di atas kebenaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Kami mengisahkan kepadamu -wahai Rasul- tentang kabar mereka dengan sebenarnya yang tidak ada dusta di dalamnya. Sungguh mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka, dan mengerjakan ketaatan kepada-Nya, sehingga Kamipun menambahkan mereka petunjuk dan keteguhan di atas kebenaran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13-14. Hai Rasulullah, Kami menceritakan kepadamu kisah agung mereka dengan benar; mereka adalah para pemuda yang beriman kepada Tuhan mereka, dan Kami tambah keteguhan mereka di atas kebenaran dan Kami kuatkan hati mereka dengan keimanan dan ketentraman, ketika mereka menyelisihi kaum mereka yang kafir dengan berkata: “Tuhan yang kami sembah adalah yang telah menciptakan tujuh langit dan bumi, kami tidak akan menyekutukan-Nya dengan tuhan-tuhan lain; sungguh jika kami menyembah selain-Nya maka kami telah berpaling jauh dari kebenaran.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. نَّحْنُ نَقُصُّ عَلَيْكَ نَبَأَهُم بِالْحَقِّ ۚ (Kami kisahkan kepadamu (Muhammad) cerita ini dengan benar) Mulai dari ayat ini terdapat perincian dari kisah ashabul kahfi yang sebelumnya masih disebutkan Allah secara umum. Yakni Kami akan menceritakan kisah mereka dengan sebenarnya, bukan kisah yang tercampuraduk dan tidak jelas yang diriwayatkan dari ahli kitab. إِنَّهُمْ فِتْيَةٌ(Sesungguhnya mereka adalah pemuda-pemuda) Yakni para pemuda yang berjumlah sedikit. ءَامَنُوا۟ بِرَبِّهِمْ وَزِدْنٰهُمْ هُدًى(yang beriman kepada Tuhan mereka, dan Kami tambah pula untuk mereka petunjuk) Yakni Kami tambah ilmu mereka tentang kebenaran dengan keteguhan dan taufik, yang mana orang-orang pada zaman mereka saling berselisih tentang kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Kami kisahkan kepadamu wahai Muhammad cerita ini dengan benar dan rinci: Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka dengan tulus, dan Kami tambah pula petunjuk dan ketetapan iman dan taufik untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menceritakan kepadamu kisah mereka} kabar tentang para pemuda itu {dengan sebenarnya} dengan benar {Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada Tuhan mereka dan Kami menambahkan petunjuk kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Ini adalah permulaan rincian kisah mereka. Sesungguhnya Allah mengkisahkannya kepada Nabi Muhammad dengan benar dan jujur yang tidak ada keraguan padanya dan tidak ada sisi kerancuan sedikit pun. “Sesungguhnya mereka itu adalah pemuda-pemuda yang beriman kepada Rabb mereka,” kata (fityah) ini merupakan bentuk plural jenis jumu’qillah (bentuk jamak yang tidak banyak). Hal itu menunjukkan bahwa mereka kurang dari sepuluh orang. Mereka beriman kepada Allah semata dan tidak ada sekutu bagiNya tanpa disertai kaumnya. Maka, Allah mensyukuri keimanan mereka, lalu menambahkan hidayah kepada mereka. Maksudnya, disebabkan oleh inti hidayah kepada keimanan, maka Allah menambahkan petunjuk kepada mereka berupa ilmu yang bermanfaat dan amal shalih. Sebagaimana Firman Allah, \"Dan Allah akan menambah petunjuk kepada mereka yang telah mendapat petunjuk. Dan amal-amal saleh yang kekal itu lebih baik pahalanya di sisi Tuhanmu dan lebih baik kesudahannya.\" (Maryam:76)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 13: Dalam ayat tersebut dipakai jama’ yang menunjukkan sedikit, yaitu kata “fityah” (beberapa pemuda), yang menunjukkan bahwa jumlah mereka di bawah sepuluh. Berupa ilmu yang bermanfaat dan amal yang saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 13",
    "description": "Kami akan ceritakan kepadamu dengan rinci wahai nabi Muhammad kisah mereka yang penting dan menakjubkan itu dengan sebenarnya, tidak ada keraguan maupun kesamaran agar engkau jelaskan kepada orang-orang yang bertanya dan menjadi pelajaran bagimu dan bagi umatmu. Sesungguhnya mereka adalah pemuda-pemuda yang beriman kepada tuhan mereka dengan keimanan yang benar, tetapi mereka ditindas oleh penguasa pada masanya maka kami kukuhkan iman mereka dan kami tambahkan petunjuk kepada mereka kepada jalan yang benar. Dan kami teguhkan hati mereka ketika mereka berdiri tampil di hadapan kaumnya atau di hadapan penguasa yang menindas dan memaksa agar mereka menyekutukan Allah, akan tetapi mereka menolaknya lalu mereka berkata, menyatakan keteguhan hatinya, tuhan kami adalah tuhan pencipta dan pemelihara langit dan bumi; kami tidak menyeru tuhan selain dia dan tidak menyembah-Nya. Sungguh, kalau kami berbuat demikian, yakni kalau kami menyeru dan menyembah tuhan selain Allah, tentu kami telah mengucapkan perkataan yang sangat jauh dari kebenaran."
  }
]