[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian sebagain mereka berkata kepada sebagian yang lain, ”kaum kita telah mengambil sesembahan-sesembahan selain Allah bagi mereka. Mengapa mereka tidak mengemukakan dalil yang jelas atas penyembahan mereka (terhadap berhala-berhala) itu? Siapakah yang lebih parah tindakan kezhalimannya daripada orang yang mengada-adakan kedustaan atas nama Allah dengan menisbatkan sekutu kepadaNya dalam ibadah kepadaNYa?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Lalu mereka saling berpandangan satu sama lain seraya berkata, \"Mereka itu kaum kami yang telah menjadikan tuhan-tuhan lain selain Allah sebagai sesembahan yang disembah, padahal mereka tidak memiliki dalil dan bukti nyata akan kebenaran sembahan-sembahan itu. Sungguh tidak ada orang yang lebih zalim dari orang yang mengada-adakan kebohongan atas Allah dengan menyandarkan sekutu bagi-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Para pemuda itu saling berdiskusi, dan bersepakat untuk pergi meninggalkan kaum mereka. Mereka berkata: “Kaum kita yang menyekutukan Allah dengan tuhan-tuhan lain, mengapa mereka tidak mendatangkan hujjah dan dalil yang jelas yang menunjukkan kebenaran penyembahan mereka! Sungguh tidak ada yang lebih zalim daripada orang yang sengaja membuat kedustaan terhadap Allah dengan menjadikan-Nya memiliki sekutu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. هٰٓؤُلَآءِ قَوْمُنَا اتَّخَذُوا۟ مِن دُونِهِۦٓ ءَالِهَةً ۖ لَّوْلَا يَأْتُونَ عَلَيْهِم بِسُلْطٰنٍۭ بَيِّنٍ ۖ (Kaum kami ini telah menjadikan selain Dia sebagai tuhan-tuhan (untuk disembah). Mengapa mereka tidak mengemukakan alasan yang terang) Yakni mengapa mereka tidak mendatangi tuhan-tuhan mereka dengan suatu alasan yang dapat menjadi pegangan. فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَىٰ عَلَى اللهِ كَذِبًا(Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah?) Dan mengatakan bahwa Allah memiliki sekutu dalam penyembahan kepada-Nya. Yakni tidak ada orang yang lebih zalim darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Kaum kami ini telah menjadikan sesembahan selain Allah. Mengapa mereka tidak mengemukakan alasan yang terang tentang kepercayaan mereka? Siapakah yang lebih zalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah? Yang telah mengklaim bahwa Allah memiliki sekutu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{“Mereka itu kaum kami yang telah menjadikan tuhan-tuhan selain Dia} selain Allah {Mengapa tidak} mengapa tidak {mereka kemukakan alasan yang jelas} bukti yang jelas {Maka siapakah yang lebih zalim daripada orang yang mengada-adakan} membuat-buat {kebohongan terhadap Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Ketika mereka menyebutkan karunia Allah kepada mereka berupa keimanan, petunjuk dan ketakwaan, kemudian mereka menoleh terhadap realita yang terjadi pada kaumnya, yang berupa menjadikan sesembahan selain Allah, para pemuda itu mencela mereka dan menjelaskan bahwa mereka melakukannya bukan atas dasar keyakinan, bahkan mereka benar-benar berada dalam kejahilan dan kesesatan. Mereka mengatakan, “Mengapa mereka tidak mengemukakan alasan yang terang (tentang kepercayaan mereka?)” yaitu dengan hujjah dan bukti nyata tentang kebatilan yang mereka pegangi. Mereka tidak mampu melakukan hal itu. Akan tetapi, tindakan itu hanyalah ucapan mengada-adakan atas nama Allah dan kedustaan terhadapNya. Ini merupakan kezhaliman yang paling besar. Oleh sebab itu, Allah berfirman, “Siapakah yang lebih zhalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah?”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 15: Setelah mereka menyebutkan nikmat yang telah diberikan Allah berupa iman dan hidayah, maka mereka beralih melihat keadaan kaum mereka yang menjadikan sesembahan selain Allah. Mereka membenci perbuatan itu dan menerangkan, bahwa perbuatan itu sama sekali tidak di atas ilmu dan keyakinan. Dengan menisbatkan sekutu bagi-Nya, padahal Dia tidak mempunyai sekutu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 15",
    "description": "Lalu mereka menunjukkan kepada kaumnya bahwa mereka itu kaum kami yang telah menjadikan tuhan-tuhan (untuk disembah) selain dia. Mereka menyekutukan Allah tanpa suatu bukti dan alasan yang jelas. Mengapa mereka tidak mengemukakan alasan yang jelas tentang kepercayaan mereka, sebagaimana kami tunjukkan bukti-bukti yang nyata tentang kekuasaan Allah, tuhan kami' maka siapakah yang lebih zalim daripada orang yang mengada-adakan kebohongan terhadap Allah' sungguh, mereka itulah orang-orang yang zalim karena mengada-adakan kebohongan terhadap Allah. Menghadapi kaumnya yang menyekutukan Allah dan penindasan penguasa negeri yang memaksa agar mereka meninggalkan kepercayaannya, maka salah satu dari pemuda itu atau beberapa dari mereka mengusulkan agar mereka meninggalkan negerinya ke tempat yang jauh. Sebagian dari mereka itu berkata, dan apabila kamu bermaksud hendak meninggalkan mereka, yakni kaumnya yang durhaka dan apa yang mereka sembah selain Allah, maka carilah tempat berlindung ke dalam gua itu, yakni sebuah gua yang telah mereka kenal dan ketahui sebelumnya, guna memelihara keyakinanmu, niscaya tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu guna memelihara dan melindungi kamu dari penganiayaan mereka dan menyediakan sesuatu yang berguna bagimu dalam urusanmu yang berkaitan dengan kebutuhan hidupmu maupun yang berkaitan dengan keyakinanmu."
  }
]