[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika kalian meninggalkan kaum kalian dengan membawa keyakinan kalian dan kalian tinggalkan sesembahan-sesembahan mereka sembah, kecuali beribadah kepada Allah, maka carilah tempat berlindung ke dalam gua yang berada di gunung untuk beribadah kepada tuhan kalian semata, niscaya tuhan kalian akan melimpahkan sebagian rahamatNya bagi kalian, sehingga Dia meliputi kalian dengannya di dunia dan akhirat dan memudahkan urusan-urusan kalian yang bermanfaat bagi kalian dalam kehidupan kalian yang terkait dengan sebab-sebab mencari penghidupan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Dan ketika kalian meninggalkan kaum kalian, menjauhi apa yang mereka sembah selain Allah, dan kalian tidak menyembah kecuali Allah saja, maka carilah tempat perlindungan ke dalam gua demi menyelamatkan agama kalian, niscaya Tuhan kalian akan melimpahkan sebagian rahmat-Nya untuk melindungi dan menjaga kalian dari musuh-musuh kalian, dan memudahkan urusan yang bermanfaat bagi kalian sebagai pengganti dari menetap di tengah-tengah kaum kalian yang kafir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Setelah kalian meninggalkan kaum kalian dan berhala-berhala mereka, maka berlindunglah ke dalam gua agar Tuhan kalian menghamparkan rahmat-Nya bagi kalian dan memudahkan makanan dan kebutuhan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَإِذِ اعْتَزَلْتُمُوهُمْ (Dan apabila kamu meninggalkan mereka) Yakni jika kalian meninggalkan dan menjauhi orang-orang yang menyembah berhala. وَمَا يَعْبُدُونَ إِلَّا اللهَ(dan apa yang mereka sembah selain Allah) Yakni dan kalian menjauhi penyembahan berhala-berhala mereka. فَأْوُۥٓا۟ إِلَى الْكَهْفِ(maka carilah tempat berlindung ke dalam gua itu) Yakni pergilah ke dalam gua dan jadikanlah sebagai tempet berlindung kalian. Yakni jika kalian telah meninggalkan mereka secara aqidah maka tinggalkanlah juga mereka dengan jasad kalian dengan berlindung ke dalam gua. يَنشُرْ لَكُمْ رَبُّكُم مِّن رَّحْمَتِهِۦ(niscaya Tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu) Yakni melapangkan kepada kalian rahmat-Nya. وَيُهَيِّئْ لَكُم مِّنْ أَمْرِكُم مِّرْفَقًا(dan menyediakan sesuatu yang berguna bagimu dalam urusan kamu) Yakni memudahkan kalian dalam urusan yang sedang kalian hadapi sehingga kalian mendapatkan kemudahan dan manfaat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara buah dari keimanan seseorang adalah menjadikan gua sempit yang tidak layak untuk dihuni, dipenuhi dengan rahmat dan ketenangan; karena ketahuilah bahwa segala urusan berada dalam kekuasaan Allah, dan segala urusan itu hakikatnya bukan tentang apa yang dilihat oleh penghuni dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Apabila kamu meninggalkan umat kamu dan sesembahan mereka selain Allah, maka carilah tempat berlindung ke dalam gua itu, niscaya Tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu dari gangguan umat kamu dan menyediakan sesuatu yang berguna bagimu dalam urusan hidup yang mendesak"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan jika kalian telah meninggalkan mereka} meninggalkan kaum kalian dengan melarikan diri membawa agama kalian {dan apa yang mereka sembah selain Allah, maka berlindunglah} berlindunglah {ke dalam gua itu. niscaya Tuhan kalian akan melimpahkan} melimpahkan {sebagian rahmatNya kepada kalian dan menyediakan} memudahkan {bagi kalian sesuatu yang berguna bagi urusan kalian”} sesuatu yang bisa kalian manfaatkan berupa sebab-sebab penghidupan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Maksudnya sebagian mereka mengatakan kepada yang lain, “Jika kalian berhasil mengasingkan diri dari kaum kalian dengan jasad-jasad dan agama kalian, maka tidaklah tersisa (suatu tindakan) kecuali menyelamatkan diri dari keburukan mereka dan menempuh langkah-langkah yang mewujudkannya. Pasalnya, para remaja itu mempunyai jalan (kekuatan) untuk memerangi kaumnya dan tidak mungkin pula tinggal bersama di tengah kaumnya dalam keadaan agama yang berbeda. “Maka carilah tempat berlindung ke dalam gua itu,” maksudnya mengungsi ke sana dan bersembunyi di dalamnya “niscaya Rabbmu akan melimpahkan sebagian rahmatNya kepadamu dan menyediakan sesuatu yang berguna bagimu dalam urusanmu” sebelumnya, Allah mengabarkan bahwa mereka berdoa kepadaNya dengan mengatakan, \"\"Wahai Tuhan kami berikanlah rahmat kepada kami dari sisi-Mu dan sempurnakanlah bagi kami petunjuk yang lurus dalam urusan kami (ini)\". (Al-Kahfi:10). Maka mereka telah menghimpun antara berlepas diri dari usaha dan kekuatan pribadi mereka dan bersandar kepada Allah untuk memperbaiki urusan mereka dan permohonan doa kepadaNya untuk tujuan tersebut dengan berkeyakinan bahwa Dia akan merealisasikannya. Tidak diragukan lagi, bahwa Allah akan mencurahkan sebagian rahmatNya kepada mereka dan menyiapkan (bagi urusan mereka) petunjuk yang luru dalam urusan mereka. Maka, Allah menjaga agama dan badan mereka serta menjadikan mereka termasuk tanda-tanda kekuasaanNya di hadapan makhluk. Allah menyebarluaskan pujian yang baik bagi mereka, yang mana ia termasuk curahan rahmatNya kepada mereka dan memudahkan segala faktor bagi mereka. Bahkan tempat untuk tidur mereka, sehingga berada dalam pemelliharaan yang paling utama. Oleh karena itu, Allah berfirman,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 16: Perkataan ini terjadi antara mereka sendiri yang timbul karena ilham dari Allah. Karena tidak sanggup menghadapi mereka dan tidak mungkin tinggal di tengah-tengah mereka. Sebagaimana disebutkan sebelumnya, bahwa mereka berdoa, “Ya Tuhan kami. Berikanlah rahmat kepada Kami dari sisi-Mu dan sempurnakanlah petunjuk yang lurus bagi kami dalam urusan Kami.” Di mana dalam doa tersebut mereka menggabung antara sikap berlepas diri dari kemampuan mereka, menghadap kepada Allah agar Dia memperbaiki urusan mereka, berdoa dengannya, dan merasa yakin dengan Allah, bahwa Dia akan melakukannya, maka sudah tentu Allah akan melimpahkan rahmat-Nya kepada mereka, menyiapkan hal yang berguna bagi mereka, menjaga agama dan badan mereka, serta menjadikan mereka termasuk di antara ayat-ayat-Nya, menyebut mereka dengan sebutan yang baik, di mana hal itu termasuk rahmat-Nya kepada mereka. Demikian pula memudahkan sebabnya untuk mereka, sampai tempat yang mereka singgahi untuk istirahat pun sangat cocok bagi mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 16",
    "description": "Menghadapi kaumnya yang menyekutukan Allah dan penindasan penguasa negeri yang memaksa agar mereka meninggalkan kepercayaannya, maka salah satu dari pemuda itu atau beberapa dari mereka mengusulkan agar mereka meninggalkan negerinya ke tempat yang jauh. Sebagian dari mereka itu berkata, dan apabila kamu bermaksud hendak meninggalkan mereka, yakni kaumnya yang durhaka dan apa yang mereka sembah selain Allah, maka carilah tempat berlindung ke dalam gua itu, yakni sebuah gua yang telah mereka kenal dan ketahui sebelumnya, guna memelihara keyakinanmu, niscaya tuhanmu akan melimpahkan sebagian rahmat-Nya kepadamu guna memelihara dan melindungi kamu dari penganiayaan mereka dan menyediakan sesuatu yang berguna bagimu dalam urusanmu yang berkaitan dengan kebutuhan hidupmu maupun yang berkaitan dengan keyakinanmu. Dan engkau, yakni siapa pun yang melihat posisi gua itu akan melihat matahari ketika terbit, condong dari gua mereka ke sebelah kanan, sehingga melalui pintu gua itu cahayanya dapat masuk dan apabila matahari itu terbenam, cahayanya menjauhi mereka ke sebelah kiri sehingga mereka tidak tersengat oleh sinarnya yang panas. Posisi gua itu tidak menghadap secara langsung ke arah matahari terbit maupun terbenam, sehingga sinarnya yang panas tidak menyengat mereka, sedang mereka berada dalam tempat yang luas di dalam gua itu. Itulah sebagian dari tanda-tanda kekuasaan dan kebesaran Allah untuk menjaga dan melindungi hambanya yang taat dan mendapat petunjuk. Barang siapa diberi petunjuk oleh Allah, karena kecenderungan hatinya untuk mendapat petunjuk maka dialah yang mendapat petunjuk; dan barang siapa disesatkan-Nya, karena kecenderungan hatinya mengingkari ayat-ayat Allah maka engkau tidak akan mendapatkan seorang penolong yang dapat memberi petunjuk kepadanya dan membimbingnya kepada jalan yang benar."
  }
]