[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "maka ketika mereka melakukannya, Allah melemparkan tidur pada mereka dan melindungi mereka. Dan engkau lihat (wahai orang yang menyiksakan mereka langsung), matahari jika terbit dari arah timur lebih menyorong ke arah kanan dari tempat mereka, dan jika terbenam, maka menjauhi mereka ke arah kiri, sedang mereka berada di tempat yang luas di dalam gua. Panasnya terik matahari tidak mengenai mereka, dan udarapun tidak putus dari mereka. Keadaan yang kami kondisikan bagi para pemuda itu termasuk bukti kuasa Allah. Barangsiapa diberi taufik oleh Allah untuk mendapatkan hidayah maka dialah yang di beri taufik menuju kebenaran, dan barangsiapa yang belum dikaruniai taufik oleh Allah untuk itu, maka engkau tidak akan menemukan baginya seorang penolong yang akan menuntutnya menuju kebenaran. Sebab pemberian taufik, atau di biarkan jauh dari hidayah hanya di tangan Allah semata."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Merekapun mengerjakan apa yang diperintahkan, dan Allah menidurkan serta menjaga mereka dari musuh-musuh mereka. Lalu engkau -wahai orang yang menyaksikan mereka- melihat apabila matahari terbit dari timur, ia condong dari gua mereka ke sebelah kanan jalan masuknya, dan apabila matahari itu terbenam ke barat, ia menjauhi mereka ke sebelah kiri sehingga mereka pun tidak terkena sinar matahari, sehingga mereka senantiasa berada dalam keteduhan, tidak diganggu oleh panas matahari. Di dalam gua itu mereka berada dalam kelapangan serta mendapatkan udara yang cukup. Semua ini menunjukkan keajaiban ciptaan Allah yang membuktikan besarnya kekuasaan-Nya. Barangsiapa yang diberi taufik oleh Allah untuk menempuh jalan petunjuk maka dia adalah orang yang benar-benar mendapat petunjuk, dan barangsiapa yang dijauhkan dan disesatkan darinya maka engkau tidak akan mendapatkan seorang penolong pun yang dapat membimbing dan memberi petunjuk padanya, karena hidayah dan petunjuk itu berada di tangan Allah, bukan di tangannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Dan kamu melihat matahari akan terbit menyondong ke arah kanan dari gua mereka dan ketika terbenam akan condong ke arah kiri, sehingga mereka tidak tertimpa panas matahari dan tidak terhalang dari manfaat sinar itu. mereka berada di tempat yang luas dalam gua itu sehingga mereka dapat bernafas dengan baik. Pengaturan dari Tuhan bagi hamba-hamba-Nya yang beriman ini merupakan bukti dari kekuasaan Allah yang besar. Dan barangsiapa yang Allah beri taufik untuk beriman maka dia adalah orang yang mendapat petunjuk, dan barangsiapa yang disesatkan Allah akibat amal buruknya maka dia tidak akan menemukan orang yang dapat memberinya petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. وَتَرَى الشَّمْسَ إِذَا طَلَعَت تَّزٰوَرُ (Dan kamu akan melihat matahari ketika terbit, condong) Yakni condong menjauh. عَن كَهْفِهِمْ ذَاتَ الْيَمِينِ(dari gua mereka ke sebelah kanan) Yakni arah kanan dari pintu gua. وَإِذَا غَرَبَت تَّقْرِضُهُمْ(dan bila matahari terbenam menjauhi mereka) Yakni condong menjauhi mereka. ذَاتَ الشِّمَالِ(ke sebelah kiri) Yakni sebelah kiri gua tidak terkena sinar matahari, namun menjauhinya. وَهُمْ فِى فَجْوَةٍ مِّنْهُ ۚ( sedang mereka berada dalam tempat yang luas dalam gua itu) Yakni mereka di tempat yang terbuka lebar. Terdapat pendapat mengatakan maknanya adalah mereka selalu berada di tempat yang teduh sepanjang siang, mereka tidak terkena sinaar matahari pada saat terbit maupun terbenam. Pendapat lain mengatakan bahwa pintu gua tersebut mengarah ke arah kiri, sehingga apabila matahari terbit maka matahari berada di sisi kanan gua, dan apabila tenggelam maka matahari berada di sisi kirinya. ذٰلِكَ مِنْ ءَايٰتِ اللهِ ۗ( Itu adalah sebagian dari tanda-tanda (kebesaran) Allah) Dalam menjaga jasad mereka dari kerusakan dalam waktu yang begitu lama."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kamu akan melihat matahari ketika terbit, condong dari pintu gua mereka ke sebelah kanan. Bila matahari terbenam, matahari menjauhi gua ke arah kiri gua sedang mereka berada dalam tempat yang luas dalam gua itu. Itu adalah cara mereka menjaga diri mereka agar tetap bisa bertahan hidup dalam setiap pergantian waktu. Itu adalah sebagian tanda-tanda kebesaran Allah. Barangsiapa yang diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk; dan barangsiapa yang disesatkan-Nya, maka kamu tidak akan mendapatkan seorang pemimpin pun yang dapat memberi petunjuk kepadanya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kamu akan melihat matahari yang ketika terbit condong} condong {dari gua mereka dari arah} arah {kanan dan ketika terbenam, menjauhi mereka} bertolak dari mereka {ke arah kiri, sedang mereka berada di tempat yang luas di dalamnya} tempat luas dari gua itu {Itu adalah sebagian dari tanda-tanda Allah. Siapa saja yang diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk. Siapa saja yang Dia sesatkan, maka kamu tidak akan menemukan baginya seorang penolong} penyelamat {yang membimbingnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Maksudnya, Allah menjaga mereka dari (sengatan) matahari, menyediakan untuk mereka sebuah gua, apabila matahari terbit, (posisinya) menyerong kea rah kanan gua. Dan ketika terbenam, (letak) matahari condong ke sebelah kiri gua. Akibatnya, sengatan panas matahari tidak mengenai mereka sehingga bisa merusak tubuh-tubuh mereka. “Mereka berada dalam tempat yang luas di dalamnya,” yaitu di dalam gua. Maksudnya, (mereka) berada di tempat yang luas. Kondisi demikian itu supaya hawa dan angina semilir mengenai mereka dan udara yang tidak baik pergi dari mereka serta rasa tersiksa di tempat yang sempit (tidak mereka rasakan), apalagi dalam masa tinggal yang lama. “Itu adalah sebagian dari tanda-tanda kebesaran Allah,” yang menunjukkan kekuasaanNya, rahmatNya, dan pengabulan doa mereka serta pemberian hidayah untuk mereka, sampai dalam masalah ini. Oleh karena itu, Allah berfirman, “Barangsiapa yang diberi petunjuk oleh Allah, maka dialah yang mendapat petunjuk,” tidak ada jalan untuk menggapai hidayah kecuali dari Allah. Dia-lah Dzat yang memberikan hidayah dan petunjuk untuk kemaslahatan dua kampung (dunia dan akhirat). “Dan barangsiapa yang disesatkanNya, maka kamu tak akan mendapatkan seorang pemimpin pun yang dapat memberi petunjuk kepadanya,” maksudnya kamu tidak mendapati seorang pun yang mengurusi dan mengaturnya sesuai dengan kondisi yang menunjukinya ke jalan kebaikan dan keberuntungan. Karena Allah telah memutuskan kesesatan padanya. Tidak ada yang dapat menolak keputusanNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 17: Oleh karena itu, mereka tidak terkena panasnya matahari. Oleh karena itu, udara dan angin sepoi-sepoi masuk mengenai mereka, tidak ada udara kotor, dan mereka tidak terganggu dengan tempat yang sempit, terlebih dengan waktu yang lama. Hal ini termasuk tanda-tanda kekuasaan Allah dan rahmat-Nya. Demikian pula sebagai pengabulan terhadap doa mereka, dan hidayah bagi mereka sampai dalam masalah ini. Tidak ada jalan untuk memperoleh hidayah kecuali dengan meminta kepada Allah. Yakni engkau tidak akan mendapatkan seorang pun yang mengarahkan dan mengaturnya kepada hal yang bermaslahat baginya; hal yang di dalamnya terdapat kebaikan dan keberuntungan baginya, karena Allah telah memutuskannya sebagai orang yang tersesat, dan tidak ada yang dapat menolak ketetapan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 17",
    "description": "Dan engkau, yakni siapa pun yang melihat posisi gua itu akan melihat matahari ketika terbit, condong dari gua mereka ke sebelah kanan, sehingga melalui pintu gua itu cahayanya dapat masuk dan apabila matahari itu terbenam, cahayanya menjauhi mereka ke sebelah kiri sehingga mereka tidak tersengat oleh sinarnya yang panas. Posisi gua itu tidak menghadap secara langsung ke arah matahari terbit maupun terbenam, sehingga sinarnya yang panas tidak menyengat mereka, sedang mereka berada dalam tempat yang luas di dalam gua itu. Itulah sebagian dari tanda-tanda kekuasaan dan kebesaran Allah untuk menjaga dan melindungi hambanya yang taat dan mendapat petunjuk. Barang siapa diberi petunjuk oleh Allah, karena kecenderungan hatinya untuk mendapat petunjuk maka dialah yang mendapat petunjuk; dan barang siapa disesatkan-Nya, karena kecenderungan hatinya mengingkari ayat-ayat Allah maka engkau tidak akan mendapatkan seorang penolong yang dapat memberi petunjuk kepadanya dan membimbingnya kepada jalan yang benar. Dan engkau, yakni siapa pun yang melihat keadaan mereka di dalam gua, mengira mereka itu tidak tidur, sebab dilihat dari pandangan matanya keadaan mereka seperti terjaga, padahal mereka tidur lelap; dan kami bolak-balikkan tubuh mereka ke kanan dan ke kiri, sehingga tidak rusak oleh tanah sedang anjing mereka seakan-akan menjaga mereka membentangkan kedua lengannya di depan pintu gua. Dan jika kamu menyaksikan keadaan mereka ketika itu, tentu kamu akan berpaling melarikan diri dari mereka dan penuh tanda tanya apa yang sesungguhnya terjadi pada mereka, dan pasti kamu akan dipenuhi rasa takut terhadap mereka sebab kamu melihat sesuatu yang sangat menakjubkan yang tidak pernah kamu lihat sebelumnya."
  }
]