[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebagaimana Kami telah mencurahkan kenikmatan kepada mereka dan menjaga mereka dalam masa yang panjang tersebut, Kami bangunkan mereka dari tidur mereka dalam bentuk fisik semula tanpa ada perubahan sedikitpun. Agar sebagian mereka bertanya kepada sebgaian yang lain, ”berapa lama waktu kita tinggal tidur di sini?” sebagain mereka berkata, ”kita tingggal selama sehari atau sebagian hari saja.” orang-orang lain yang bingung menentukan masa waktunya mengatakan, ”serahkan pengetahuan itu kepada Allah, karena tuhan kalian lebih mengetahui tentang jangka waktu kita tinggal di sini. Suruhlah salah seorang diantara kalian dengan membawa uang perak kalian ke tengah kota kita dan hendaknya dia melihat siapakah dari penduduk kota yang makanannya paling halal dan paling baik. Maka hendaklah ia membawa bekal makanan darinya untuk kalian, dan hendaklah dia belaku lemah lembut terhadap penjual dalam membelinya supaya kita tetap tidak terbongkar dan keberadaan kita tidak ketahuan. Dan hendaklah ia jangan pernah menceritakan tentang kalian kepada siapaun dari manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dan sebagaimana ajaibnya kekuasaan Kami dalam melakukan apa yang telah Kami sebutkan sebelumnya, maka Kami pun membangunkan mereka setelah berlalunya waktu yang begitu lama agar mereka saling bertanya satu sama lain tentang berapa lama mereka tertidur dalam gua tersebut. Sebagian mereka menjawab, \"Kita tertidur disini selama sehari atau setengah hari.\" Sebagian lainnya yang tidak mengetahui berapa lama mereka menetap dalam gua itu berkata, \"Tuhan kalian lebih tahu dengan jangka waktu tertidurnya kalian ditempat ini, serahkanlah pengetahuannya kepada-Nya dan kerjakan saja apa yang mendatangkan manfaat bagi kalian. Maka suruhlah salah seorang diantara kalian pergi ke negeri kita dengan membawa uang perak kalian ini, dan hendaklah ia mencari siapakah di antara penduduknya yang lebih baik makanan dan usahanya, dan hendaknya ia berhati-hati ketika masuk atau keluar darinya, dan ketika berinteraksi dengan mereka. Hendaknya ia cermat dan menjaga rahasia, tidak membiarkan seorangpun mengetahui perihal kalian, karena hal itu akan mendatangkan bahaya yang besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Ketika Kami tidurkan, Kami jaga, dan Kami bangunkan mereka, mereka saling bertanya satu sama lain tentang waktu mereka tinggal di dalam gua. Seseorang di antara mereka berkata: “Berapa lama kita tinggal dalam gua ini?” Mereka menjawab: “Kita tinggal di dalam gua ini sehari atau kurang dari itu.” Dan sebagian lagi menjawab: “Tuhan kalian lebih mengetahui berapa lama kalian tinggal di sini. Lihatlah apa yang kalian perlukan, dan utuslah salah satu dari kalian ke kota dengan membawa uang perak yang kalian miliki, lalu hendaklah dia memilih makanan yang paling baik dan halal untuk dibawa ke sini agar kalian dapat memakannya juga, dan hendaklah dia berlemah lembut dalam bermuamalah dengan orang-orang agar tidak ada seorangpun yang menyadari urusan kita."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَكَذٰلِكَ بَعَثْنٰهُمْ لِيَتَسَآءَلُوا۟ بَيْنَهُمْ ۚ (Dan demikianlah Kami bangunkan mereka agar mereka saling bertanya di antara mereka sendiri) Saling bertanya tentang lama mereka tinggal di dalam gua. قَالَ قَآئِلٌ مِّنْهُمْ كَمْ لَبِثْتُمْ ۖ( Berkatalah salah seorang di antara mereka: Sudah berapa lamakah kamu berada (disini?)”) Yakni berapa lama kalian tidur. Mereka menanyakan hal ini setelah melihat keadaan mereka tidak seperti biasanya. قَالُوا۟ لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ ۚ( Mereka menjawab: “Kita berada (disini) sehari atau setengah hari”) Para ahli tafsir berpendapat: mereka memasuki gua pada waktu pagi dan Allah membangunkan mereka pada sore hari, oleh sebab itu mereka mengatakan sehari. قَالُوا۟ رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ(Berkata (yang lain lagi): “Tuhan kamu lebih mengetahui berapa lamanya kamu berada (di sini)) Yakni kalian tidak mengetahui berapa lama kalian tinggal, dan hanya Allah-lah yang mengetahui. فَابْعَثُوٓا۟ أَحَدَكُم بِوَرِقِكُمْ هٰذِهِۦٓ( aka suruhlah salah seorang di antara kamu untuk pergi dengan membawa uang perakmu ini) Makna (الورق) adalah perak yang telah dibentuk. Menurut suatu pendapat kota yang mereka maksud adalah kota Afsus (Ephesos) yang mereka dahulu tinggali yang sekarang disebut dengan kota Tarsus, demikian juga pendapat dari al-Wahidi. Dan dikatakan juga bahwa sekarang kota itu terletak di negeri Oman-Urdun, di tempat masyhur di selatan kota yang disebut dengan ar-Raqim (ar-Rajib), kota yang banyak dikunjungi banyak orang untuk mengambil pelajaran. فَلْيَنظُرْ أَيُّهَآ أَزْكَىٰ طَعَامًا (dan hendaklah dia lihat manakah makanan yang lebih baik) Yakni memperhatikan keluarga mana yang paling baik makanannya dan paling halal mata pencahariannya. Pendapat lain mengatakan yakni yang paling benar sembelihannya, sebab kebanyakan penduduknya adalah orang-orang kafir yang menyembelih hewan untuk berhala. وَلْيَتَلَطَّفْ (dan hendaklah ia berlaku lemah-lembut) Yakni lembut dalam pandangan agar tidak dikenali atau ditipu. وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا(dan janganlah sekali-kali menceritakan halmu kepada seorangpun) Yakni jangan biarkan seorangpun mengetahui tempat persembunyian kalian."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Pada kisah ashabul kahfi kata ilmu yang dihubungkan kepada Allah terulang beberapa kali : { قَالُوا۟ رَبُّكُمْ أَعْلَمُ بِمَا } 19 , { رَّبُّهُمْ أَعْلَمُ بِهِمْ ۚ} 21, { قُل رَّبِّىٓ أَعْلَمُ بِعِدَّتِهِم مَّا يَعْلَمُهُمْ } 22, { قُلِ ٱللَّهُ أَعْلَمُ بِمَا لَبِثُوا۟ } 26, karena inti dari kisah ini adalah ketetapan mereka di atas agama Allah dan jauhnya mereka dari kebodohan kaumnya. 2 ). { فَٱبْعَثُوٓا۟ أَحَدَكُم بِوَرِقِكُمْ هَٰذِهِۦٓ إِلَى ٱلْمَدِينَةِ } Pada lafazd ini menunjukkan bahwa dibenarkan perwakilan, dan merupakan ayat yang paling kuat sebagai dalil. 3 ). Sikap kehati-hatian dan waspada dari hal yang membahayakan, dan menutupi rahasia sesuatu yang berdampak buruk jika disebarkan baik itu berdampak secara umum maupun khusus, semua ini merupakan bentuk sehatnya akal seseorang: { فَٱبْعَثُوٓا۟ أَحَدَكُم بِوَرِقِكُمْ هَٰذِهِۦٓ إِلَى ٱلْمَدِينَةِ فَلْيَنظُرْ أَيُّهَآ أَزْكَىٰ طَعَامًا فَلْيَأْتِكُم بِرِزْقٍ مِّنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا } \"Maka suruhlah salah seorang di antara kamu untuk pergi ke kota dengan membawa uang perakmu ini, dan hendaklah dia lihat manakah makanan yang lebih baik, maka hendaklah ia membawa makanan itu untukmu, dan hendaklah ia berlaku lemah-lembut dan janganlah sekali-kali menceritakan halmu kepada seorangpun.\" 4 ). Sebagian mufassir menjelaskan bahwa pada ayat { فَلْيَنظُرْ أَيُّهَآ أَزْكَىٰ طَعَامًا } yakni pilihlah makanan yang paling manis, karena pada dasarnya mereka adalah kelompok yang memisahkan diri dari kaumnya yang menyembah berhala, oleh karena itu para pemuda ini tidak membolehkan diri mereka untuk makan sembelihan dari kaum itu, ayat ini juga menunjukkan hal yang perlu kita lakukan tatkala berada dikawasan yang kurang menyediakan makanan halal. 5 ). Untuk mewujudkan suatu cita-cita yang besar diperlukan cara yang lembut dan tenang sekalipun kedudukan seseorang tinggi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Sebagaimana Kami ceritakan tidur dan penjagaan mereka, Kami bangunkan juga mereka agar mereka saling bertanya di antara mereka sendiri tentang waktu tidur mereka selama di dalam gua. Salah seorang di antara mereka berkata: Sudah berapa lamakah kamu berada disini?\". Mereka menjawab: \"Kita berada disini selama sehari atau setengah hari\". Berkata yang lain lagi: \"Tuhan kamu lebih mengetahui berapa lamanya kamu berada di sini. Maka suruhlah salah seorang di antara kamu untuk pergi ke kota dengan membawa uang perakmu ini, juga supaya dia lihat manakah makanan yang paling baik. Juga agar ia membawa makanan itu untukmu, serta berlaku lemah-lembut. Janganlah sekali-kali menceritakan keadaanmu ini kepada seorangpun.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikianlah} sebagaimana Kami menidurkan dan menjaga mereka di waktu yang lama {Kami membangunkan mereka} membangunkan mereka dari tidur mereka {agar mereka saling bertanya di antara mereka. Salah seorang di antara mereka berkata,“Sudah berapa lama kalian tinggal” Mereka menjawab,“Kita tinggal sehari atau setengah hari” Mereka berkata,“Tuhan kalian lebih mengetahui berapa lama kalian tinggal. Maka utuslah salah seorang di antara kalian dengan uang perak kalian} dengan uang perak kalian {ini ke kota. Maka hendaklah dia melihat manakah} manakah penduduk kota {yang lebih baik} lebih baik dan lebih bersih {makanannya, agar dia memberi kalian sebagian makanan} sebagian makanannya {dan hendaklah dia berlaku lemah lembut} dan hendaklah dia berlemah lembut ketika memasuki dan keluar dari kota dan ketika membeli makanan {dan janganlah memberitahu} dan janganlah memberitahu {tentang kalian kepada siapa pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Allah berfirman, “Dan demikianlah Kami bangunkan mereka,” dari tidurnya yang sangat lama “agar mereka saling bertanya di antara mereka sendiri,” maksudnya agar mereka saling berdiskusi supaya mendapat berita yang valid tentang berapa lama mereka tinggal. “Salah seorang di antara mereka berkata, ‘Sudah berapa lamakah kamu berada (di sini)?’ kKita berada (di sini) sehari atau setengah hari’ .” pernyataan ini berlandaskan prasangka orang yang mengatakan (belaka). Sepertinya, telah terjadi kekaburan pada mereka mengenai masa mereka tinggal. Oleh karena itu, “ Berkatalah (yang lain lagi), ‘Rabbmu lebih mengetahui berapa lam akamu berada (di sini)’ .” mereka mengembalikan hal tersebut kepada Dzat yang ilmuNya meliputi segala sesuatu, secara global maupun terperinci. Barangkali setelah itu Allah memberitahukan kepada mereka tentang masa tinggal mereka. Lantaran Allah membangunkan mereka agar mereka saling bertanya di antara mereka sendiri, dan Allah mengabarkan bahwa mereka saling berdiskusi dan berbicara sebatas pengetahuan mereka yang berujung pada ketidakjelasan. Maka seharusnya Allah telah mengabarkan mereka (tentang itu) secara pasti. Hal itu dapat diketahui melalui hikmah menjadikan mereka terjaga, dan bahwasanya Allah tidak melakukannya secara sia-sia. Di antara rahmatNya terhadap orang yang mencari kepastian sesuatu dalam perkara-perkara yang dituntut untuk diketahui lalu dia berusaha untuk mengetahuinya dengan batas kemampuannya, yaitu Allah menjelaskan perkara tersebut kepadanya, dan berdasarkan ayat-ayat yang disebutkan setelah FirmanNYa, \"Dan demikian (pula) Kami mempertemukan (manusia) dengan mereka, agar manusia itu mengetahui, bahwa janji Allah itu benar, dan bahwa kedatangan hari kiamat tidak ada keraguan padanya\" (Al-Kahfi:21). Seandainya kondisi mereka tidak diketahui (setelahnya), niscaya mereka tidak menjadi bukti atas apa yang Allah sebutkan (tentang hari Kebangkitan). Kemudian, tatkala mereka saling bertanya di antara sesame mereka dan terjadi peristiwa pada mereka yang Allah kabarkan, maka mereka pun mengutus salah seorang di antara mereka dengan uang perak. Maksudnya, uang beberapa dirham yang mereka bawa, agar orang tersebut membellikan makanan dari kota (yang mereka tinggalkan) unttuk mereka makan. Mereka memerintahkannya agar memilih makanan yang paling bagus. Maksudnya, makanan terbaik dan paling lezat. Dan supaya berkelakuan ramah ketika pergi, membeli serta kepulangannya. Mereka juga memerintahkan supaya dia menutup diri dalam urusannya dan tutup mulut tentang keadaan teman-temannya dan jangan sampai memberitahukan seorang pun tentang keadaan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 19: Dari tidur yang panjang. Hal itu, karena mereka memasuki gua ketika matahari terbit dan dibangunkan ketika matahari tenggelam, sehingga mereka mengira bahwa terbenamnya matahari itu adalah pada hari ketika mereka memasuki gua itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 19",
    "description": "Dan demikianlah setelah kami tidurkan mereka dalam waktu yang lama dan kami jaga mereka di dalam tidurnya itu, kami bangunkan mereka agar di antara mereka saling bertanya tentang keadaan mereka. Salah seorang di antara mereka berkata, sudah berapa lama kamu berada di sini' mereka menjawab, kita berada (di sini) sehari atau setengah hari. Mereka mengira baru satu atau setengah hari di dalam gua, sebab mereka masuk ke dalam gua pada pagi hari dan bangun dari tidur pada sore hari. Melihat keadaan di dalam gua itu dan di sekitarnya berbeda dengan apa yang disaksikan dahulu, mereka ragu berapa lama tinggal di dalam gua. Maka timbullah perbedaan pendapat di antara mereka. Kemudian berkata seorang di antara mereka, tak usah kita perdebatkan berapa lama kita di sini, tuhanmu lebih mengetahui berapa lama kamu berada di sini. Meraka merasa lapar maka salah seorang di antara mereka berkata, suruhlah salah seorang di antara kamu pergi ke kota untuk membeli makanan dengan membawa uang perakmu ini, dan hendaklah dia mencari tempat menjual makanan dan lihat manakah makanan yang lebih baik, maka belilah makanan itu dan bawalah sebagian makanan itu untukmu, dan hendaklah dia berlaku lemah lembut kepada siapa saja di kota itu dan jangan sekali-kali menceritakan halmu kepada siapa pun agar mereka tidak mengetahui keadaanmu dan tempatmu bersembunyi. Sesungguhnya jika mereka, yakni penduduk kota tempat kamu membeli makanan itu dapat mengetahui tempatmu, lalu mereka menguasai kamu, niscaya mereka akan melempari kamu dengan batu, jika kamu tetap mempertahankan keimanan kamu, atau mereka akan memaksamu kembali kepada agama mereka, yakni menyekutukan Allah dengan tuhantuhan yang lain, dan jika demikian, yakni jika kamu memeluk agama mereka, niscaya kamu tidak akan beruntung selama-lamanya baik di dunia maupun di akhirat."
  }
]