[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "2-3. Allah menjadikannya kitab yang lurus, tidak ada pertentangan dan kontradiksi di dalamnya; untuk memberikan peringatan kepada orang-orang kafir dari siksaan yang pedih yang berasal dari sisiNya, dan memberi kabar gembira bagi orang-orang yang beriman kepada Allah dan rasulNya yang beramal shalih bahwa sesungguhnya bagi mereka pahala melimpah, yaitu surga. Mereka akan berdiam dalam kenikmatan tersebut, tidak akan pergi terpisah darinya selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Tetapi Dia menjadikannya sebagai kitab yang lurus, tidak saling bertentangan dan berbeda, untuk memperingatkan orang-orang kafir akan azab yang sangat pedih dari Allah -yang telah menanti mereka, dan memberikan kabar gembira kepada orang-orang beriman yang mengerjakan amal saleh bahwa mereka akan mendapatkan ganjaran pahala yang baik, yang tidak akan ditandingi oleh jenis ganjaran apapun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. قَيِّمًا (sebagai bimbingan yang lurus) Makna (القيم) yakni yang lurus lagi tidak berbelok. Atau sebagai kitab yang menjadi acuan bagi kitab-kitab samawi sebelumnya. لِّيُنذِرَ(untuk memperingatkan) Yakni memperingatkan orang-orang kafir. بَأْسًا شَدِيدًا(siksaan yang sangat pedih) Makna (البأس) yakni azab. مِّن لَّدُنْهُ(dari sisi Allah) Yakni diturunkan oleh Allah. وَيُبَشِّرَ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصّٰلِحٰتِ أَنَّ لَهُمْ أَجْرًا حَسَنًا(dan memberi berita gembira kepada orang-orang yang beriman, yang mengerjakan amal saleh, bahwa mereka akan mendapat pembalasan yang baik) Yakni berupa balasan surga yang segala yang ada didalamnya adalah kebaikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1-2 Pada lafadz { قَيِّمًا } yakni : mustaqim (lurus) tidak berkelok dan menyimpang; lafadz ini sebagai penekanan untuk ayat sebelumnya: { وَلَمْ يَجْعَل لَّهُۥ عِوَجَا } \"dan Dia tidak mengadakan kebengkokan di dalamnya\" karena kebanyakan sesuatu yang nampak lurus, namun hakikatya tidak terlepas dari lengkungan, oleh karena itu al-Qur'an menggabungkan antara penafian penyimpangan, dan penetapan kelurusan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Sebagai bimbingan yang lurus, tidak ada pembebanan/kezhaliman dalam perintah dan hukum-hukumnya. Untuk memperingatkan siksaan yang sangat pedih dari sisi Allah dan memberi berita gembira kepada orang-orang yang beriman, yang mengerjakan amal saleh, bahwa mereka akan mendapat pembalasan yang baik berupa surga dan pahala baik."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Yang lurus} yang lurus tidak ada pertentangan di dalamnya {agar Dia memberi peringatan tentang siksa} siksa {yang sangat pedih dari sisiNya}dari sisi Allah {dan memberi kabar gembira kepada orang-orang mukmin yang beramal shalih bahwa mereka akan mendapat balasan yang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. FirmanNya, “Untuk memperingatkan akan siksaan yang sangat pedih dari sisi Allah,” maksudnya, untuk memperingatkan (para hamba) dengan al-Quran ini terhadap hukuman yang ada di sisiNya. Maksudnya, ketetapan dan keputusan Allah bagi orang yang menyelisihi perintahNya. Hukuman ini meliputi hukuman di dunia dan akhirat. Peringatan ini juga merupakan salah satu kenikmatanNya, yaitu Allah menakut-nakuti hamba-hambaNya dan memperingatkan mereka dari hal-hal yang mencelakakan dan membinasakan mereka. Sebagaimana Firman Allah tatkala Dia menyebutkan sifat neraka dalam al-Quran, \"Demikianlah Allah mempertakuti hamba-hamba-Nya dengan azab itu. Maka bertakwalah kepada-Ku hai hamba-hamba-Ku.\" (Az-Zumar:16). Termasuk (cermin) kasih sayang Allah kepada para hambaNya, adalah Allah menetapkan hukuman-hukuman yang keras bagi orang yang menyelisihi perintahNya, menjelaskannya kepada mereka dan menerangkan faktor-faktor yang dapat menjerumuskan mereka ke dalam hukuman. “Dan memberi berita gembira kepada orang-orang yang beriman, yang mengerjakan amal shalih, bahwa mereka akan mendapatkan pembalasan yang baik,” maksudnya, dan Allah menurunkan kepada hambaNya, (Muhammad) al-Quran supaya dia menyampaikan kabar gembira kepada orang-orang yang beriman kepada Allah, para RasulNYa dan kitab-kitabNya, yang keimanan mereka telah sempurna. Maka keimanan tersebut telah mewajibkan amal-amal yang shalih bagi mereka. Yaitu, amalan-amalan wajib dan mustahab yang memadukan antara keikhlasan dan mutaba’ah (mengikuti petunjuk Rasullullah). “Bahwa mereka akan mendapatkan pembalasan yang baik,” yaitu pahala yang Allah tetapkan karena keimanan dan amal kebajikan (mereka). Pahala yang paling agung dan paling mulia adalah kemenangan meraih keridhaan Allah dan masuk surge yang di dalamnya (penuh kenikmatan) yang belum pernah dilihat indra mata, belum pernah didengar oleh telinga dan belum pernah terlintas di hati manusia. Penyebutan sifat ‘yang baik’ menandakan tidak ada unsur yang mengotorinya, tidak pula mengurangi kesempurnaannya sama sekali. Sebab, seandainya dijumpai hal-hal itu, sedikit saja padanya, niscaya kebaikannya tidaklah sempurna."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 2: Kelurusan kitab ini menunjukkan, bahwa kitab ini tidaklah memberitakan, kecuali dengan berita yang paling agung; berita yang memenuhi hati dengan ma’rifat (mengenal Tuhannya), keimanan dan pandangan yang lurus, seperti berita yang menerangkan tentang nama-nama Allah, sifat-sifat-Nya dan perbuatan-Nya, termasuk pula hal-hal ghaib di masa lalu dan yang akan datang, dan bahwa perintah serta larangannya membersihkan jiwa, menumbuhkannya dan menyempurnakannya karena cakupannya yang mengandung keadilan, keikhlasan dan ibadah kepada Allah Rabbul ‘alamin. Siksaan di dunia maupun siksaan di akhirat. Termasuk rahmat (kasih-sayang)-Nya kepada hamba-hamba-Nya adalah Dia telah menetapkan hukuman berat kepada orang-orang yang menyelisihi perintah-Nya, menerangkannya kepada mereka, dan menerangkan sebab-sebab yang dapat mengarah kepadanya. Kepada orang-orang yang kafir dan yang mendurhakai perintah-Nya. Baik yang wajib maupun yang sunat, disertai ikhlas dan mutaba’ah (sesuai sunnah Rasulullah shallallahu 'alaihi wa sallam). Sebagai balasan terhadap iman dan amal saleh mereka, di mana yang paling besarnya adalah mendapatkan keridhaan Allah dan masuk ke surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 2",
    "description": "Al-qur'an diturunkan sebagai bimbingan yang lurus dan sempurna, tidak berlebihan dan tidak kurang di dalam tuntutan dan hukum-hukumnya, dengan tujuan untuk memperingatkan umat manusia akan siksa yang sangat pedih dari sisi-Nya yang menimpa mereka yang tidak percaya, dan memberikan kabar gembira kepada orang-orang mukmin yang kokoh imannya yang senantiasa mengerjakan kebajikan bahwa mereka akan mendapat balasan yang baik, yaitu surga beserta kenikmatannya. Mereka kekal di dalamnya, yakni di dalam surga, untuk selama-lamanya."
  }
]