[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kaum kalian, jika mengetahui keberadaaan kalian, niscaya mereka akan melempari kalian dengan bebatuan, sehingga merekapun dapat menghabisi kalian atau mengembalikan kalian kedalam ajaran agama mereka, akibatnya kalianpun menjadi orang-orang kafir dan tidak dapat memperoleh keingingan kalian, bila kalian melakukannya, yaitu memasuki surga yang abadi. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Sesungguhnya bila kaum kalian mengetahui keberadaan dan tempat berlindung kalian, niscaya mereka akan membunuh kalian dengan rajam, atau memaksa kalian untuk kembali ke agama mereka yang menyimpang di mana dahulu kalian memeluknya sebelum Allah menganugerahkan kalian petunjuk pada agama yang benar ini. Dan apabila kalian kembali kepadanya, maka kalian tidak akan pernah beruntung selama-lamanya, baik di kehidupan dunia ini maupun di Akhirat kelak, bahkan kalian akan merugi dengan kerugian yang besar lantaran telah meninggalkan agama yang benar yang telah ditunjukkan Allah, dan lantaran kembalinya kalian ke agama yang menyimpang tersebut.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Sungguh jika kaum kalian mengetahui urusan kalian, niscaya mereka akan melempari kalian dengan batu dan membunuh kalian; atau mereka akan memaksa kalian untuk mengembalikan kalian ke dalam agama batil mereka, dan sungguh jika mereka melakukan ini dan kalian rela untuk menjadi kafir seperti mereka niscaya kalian tidak akan mendapatkan kebaikan selamanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. إِنَّهُمْ إِن يَظْهَرُوا۟ عَلَيْكُمْ (sungguhnya jika mereka dapat mengetahui tempatmu) Yakni jika mereka mengenali kalian dan mengetahui tempat persembunyian kalian. يَرْجُمُوكُمْ(niscaya mereka akan melempar kamu dengan batu) Yakni mereka akan membunuh kalian dengan lemparan batu. أَوْ يُعِيدُوكُمْ فِى مِلَّتِهِمْ(atau memaksamu kembali kepada agama mereka) Agama yang dulu kalian anut sebelum Allah memberi kalian hidayah. وَلَن تُفْلِحُوٓا۟ إِذًا أَبَدًا(dan jika demikian niscaya kamu tidak akan beruntung selama lamanya) Jika kalian kembali ke dalam agama mereka maka kalian tidak akan beruntung baik di dunia maupun di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Sesungguhnya jika mereka para penyembah berhala penduduk Madinah dapat mengetahui tempatmu, niscaya mereka akan membunuh kamu dengan melempari dengan batu, atau memaksamu kembali kepada agama mereka, dan jika kamu kembali kepada agama mereka niscaya kamu tidak akan beruntung selama lamanya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya jika mereka mengetahui tempat kalian} mereka melihat dan mengetahui tempat kalian {niscaya mereka akan melempari kalian} membunuh kalian dengan melempari batu {atau mengembalikan kalian kepada agama mereka} membuat kalian kembali dengan paksa kepada agama mereka {Jika demikian niscaya kalian tidak akan beruntung selama-lamanya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Mereka menyebutkan bahaya yang timbul dari pengetahuan orang lain tentang mereka dan penampakan diri mereka di hadapan masyarakat, bahwa mereka akan menghadapi salah satu dari dua pilihan: dirajam dengan lemparan batu sehingga khlayak membunuh mereka dengan cara yang sangat keji karena kemurkaan kepada diri mereka dan agama mereka. Atau orang-orang menguji keteguhan mereka dalam beragama dan memurtadkan mereka kepada ajaran kaumnya. Dalam keadaan ini, kalian selama-lamanya tidak akan beruntung, bahkan merugi dalam agama, dunia, dan akhiratnya. Kedua ayat ini telah menunjukkan bebeerapa pelajaran penting: 1. Anjuran supaya berilmu dan mendiskusikannya, karena Allah membangunkan mereka untuk anjuran itu. 2. Adab bagi orang yang suatu ilmu belum jelas baginya supaya menyerahkannya kepada orang yang berilmu dan berdiam diri pada batas kemampuannya. 3. Sahnya mewakilkan dalam urusan jual-beli, dan sahnya perseroan dalam jual-beli. 4. Bolehnya memakan makanan yang baik-baik dan makanan-makanan yang lezat jika tidak melewati batas pemborosan yang dilarang. Sebagaimana Firman Allah, “Dan hendaklah dia melihat manakah makan yang lebih baik, maka hendaklah dia membawa makanan itu untukmu.” Khususnya jika seseorang tidak cocok baginya kecuali makanan model itu. Barangkali inilah sandaran kebanyakan ahli tafsir yang mengatakan bahwasanya mereka adalah anak-anak raja. Karena mereka memerintahkannya agar membeli makanan yang paling bagus yang menjadi kebiasaan santapan orang-orang kaya. 5. Anjuran agar berhati-hati dan bersembunyi serta menjauhi tempat-tempat fitnah yang mengancam agama, dan menyimpan rahasia seseorang dan saudara-saudaranya seagama. 6. Besarnya kecintaan para pemuda itu terhadap agama, larinya mereka dari segala fitnah yang mengancam agamanya, serta meninggalkan kampung halaman karena Allah. 7. Penyebutan kandungan kejelekan berupa bahaya-bahaya dan kerusakan-kerusakan yang mendorong untuk membenci dan meninggalkannya. Cara semacam ini adalah konsep kaum Mukminin terdahulu dan sekarang. Berdasarkan perkataan mereka, “Dan jika demikian niscaya kamu tidak akan beruntung selama-lamanya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 20: Dari ayat 19 dan 20 dapat diambil kesimpulan: - Dorongan untuk memperoleh ilmu dan membahasnya. - Adab bagi orang yang masih samar baginya suatu ilmu, yaitu mengembalikan kepada yang tahu, dan berhenti sampai di situ, serta mengucapkan, “Wallahu a’lam” (Allah lebih mengetahui). - Sahnya wakalah (perwakilan) dalam hal menjual dan membeli. - Bolehnya memakan makanan yang enak dan lezat apabila tidak sampai israf (belebihan) yang terlarang. Hal ini berdasarkan kata-kata, “dan hendaklah dia lihat manakah makanan yang lebih baik,” terlebih apabila seseorang tidak biasa kecuali makanan yang enak. Mungkin inilah yang dijadikan sandaran para mufassir yang menyebutkan, bahwa mereka (As-habul kahfi) ini adalah anak-anak raja yang biasanya memakan yang paling enak. - Dorongan untuk menjaga diri dan bersembunyi serta menjauhi tempat-tempat fitnah. - Perintah untuk berhijrah jika dia tidak dapat menjalankan agama di negeri tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 20",
    "description": "Sesungguhnya jika mereka, yakni penduduk kota tempat kamu membeli makanan itu dapat mengetahui tempatmu, lalu mereka menguasai kamu, niscaya mereka akan melempari kamu dengan batu, jika kamu tetap mempertahankan keimanan kamu, atau mereka akan memaksamu kembali kepada agama mereka, yakni menyekutukan Allah dengan tuhantuhan yang lain, dan jika demikian, yakni jika kamu memeluk agama mereka, niscaya kamu tidak akan beruntung selama-lamanya baik di dunia maupun di akhirat. Dan demikian pula sebagai tanda kekuasaan kami, kami perlihatkan, yakni kami pertemukan penduduk negeri dengan mereka, agar mereka mengetahui, bahwa janji Allah tentang kebangkitan sesudah kematian kiamat itu benar, dan bahwa kedatangan hari kiamat tidak ada keraguan padanya. Ketika mereka penduduk negeri itu berselisih tentang urusan mereka, yakni tentang siapa sebenarnya pemuda-pemuda itu dan berapa lama mereka tertidur di dalam gua, maka mereka bersepakat untuk mengabadikan peristiwa ini, mereka berkata, dirikanlah sebuah bangunan di atas gua yang menjadi tempat persembunyian mereka, tidak usah kita persoalkan siapa mereka dan berapa lama mereka tertidur di dalam gua, tuhan mereka lebih mengetahui tentang mereka, siapa mereka dan bagaimana keadaannya baik lahir maupun batin. Orang yang berkuasa atas urusan mereka, yakni penguasa dari penduduk negeri itu berkata, kami pasti akan mendirikan sebuah bangunan untuk mengabadikan peristiwa ini berupa rumah ibadah, yang kami bangun di atasnya, yakni di atas gua itu."
  }
]