[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagaimana Kami telah membuat mereka tidur selama bertahun-tahun yang panjang kemudian kami bangunkan mereka setelah itu, maka Kami singkapkan bagi orang-orang masa itu tentang mereka, setelah penjual menyadari jenis uang dirham yang dibawa oleh utusan mereka. Supaya umat manusai menjadi yakin bahwa sesungguhnya janji Allah untuk membangkitkan makhluk yang telah mati itu benar adanya, dan sesungguhnya hari kiamat itu pasti terjadi, tidak ada keraguan tentangnya. Yaitu ketika orang-orang telah berhasil mengetahui para penghuni gua berselisih pendapat tentang hari kiamat, ada yang menetapkannya dan ada yang mengingkarinya. Maka Allah menjadikan pengetahuan mereka tentang berita para penghuni gua sebagai hujjah bagi kaum mukminin di hadapan orang-orang yang ingkar. Dan setelah keadaaan mereka terbongkar dan mereka meninggal, sekelompok orang yang menggetahui perihal mereka mengatakan ”Dirikanlah sebuah bangunan yang akan menutup mereka di depan pintu gua. Dan biarkanlah mereka dan keadaan mereka; tuhan mereka lebih mengetahui tentang mereka.” orang-orang yang mengendalikan kekuasaan di tengah mereka berkata, ”sesungguhnya kami akan membuat tempat peribadahan di tempat mereka untuk beribadah(disana).” Dan sungguh Rasululah telah melarang menjadikan kubur-kubur para nabi dan orang shalih sebagai masjid, dan melaknat orang-orang yang melakukannya dalam beberapa pesan terakhir beliau bagi umatnya. Sebagaimana beliau juga melarang mendirikan banguan di atas kubur secara mutlak, dan mengecat dan menulis sesuatu di atasnya. sebab tindakan ini termasuk guluw(tindakan melampaui batas) yang dapat menyeret terhadap penyembahan terhadap orang yang di kubur di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Dan sebagaimana yang Kami lakukan atas mereka berupa perkara-perkara ajaib yang menunjukkan besarnya kekuasaan Kami, semisal menidurkan mereka selama bertahun-tahun, dan membangunkan mereka setelahnya, maka demikian pula Kami perlihatkan kepada penduduk negeri mereka agar mereka tahu bahwa janji Allah akan kemenangan kaum mukminin dan Hari Kebangkitan itu benar, dan bahwasanya hari Kiamat pasti akan tiba, tiada keraguan padanya. Ketika perihal para pemuda penghuni gua ini diketahui oleh orang banyak dan mereka meninggal dunia, maka orang-orang tersebut berbeda pendapat terkait apa yang harus dilakukan terhadap mereka. Sekelompok mereka mengatakan, \"Buatlah di depan pintu gua mereka suatu bangunan untuk menutupi dan melindungi mereka, Allah tentu lebih mengetahui tentang mereka, sebab kondisi mereka menunjukkan bahwa mereka memiliki keistimewaan khusus dihadapan-Nya.\" Orang-orang yang memiliki kekuasaan namun tidak memiliki ilmu dan dakwah yang benar berkata, \"Kami pasti akan mendirikan masjid di tempat mereka ini agar menjadi tempat ibadah sebagai bentuk pengagungan terhadap mereka dan peringatan akan kedudukan mereka.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Sebagaimana Kami telah membangkitkan mereka dari tidur mereka, Kami juga menyingkap perkara mereka bagi manusia pada zaman itu, agar mereka menjadikannya bukti atas keimanan kepada hari kebangkitan dan bukti bahwa hari kiamat pasti akan terjadi. Setelah orang-orang mengetahui kisah dan kematian mereka, kemudian orang-orang tersebut saling berselisih. Sebagian mereka berkata: “Dirikanlah bangunan di depan pintu gua itu agar dapat menutupi mereka, dan lupakan perkara mereka karena Allah lebih mengetahui perkara mereka.” Dan para pemilik keputusan di antara mereka berkata: “Kami akan membangun di atas mereka tempat untuk beribadah.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَكَذٰلِكَ أَعْثَرْنَا عَلَيْهِمْ (Dan demikian (pula) Kami mempertemukan (manusia) dengan mereka) Yakni Kami singkap urusan mereka bagi manusia. لِيَعْلَمُوٓا۟ أَنَّ وَعْدَ اللهِ(agar manusia itu mengetahui, bahwa janji Allah itu) Yakni janji Allah tentang hari kebangkitan. حَقٌّ(adalah benar) Terdapat pendapat mengatakan sebab tersingkapnya hakikat ashabul kahfi karena orang yang diutus ke pasar dengan membawa uang dirham dari perak yang dibuat pada zaman Diocletianus. Pada saat orang-orang yang berada di pasar melihat uang tersebut mereka menuduhnya menemukan harta karun milik Diocletianus. Maka mereka membawanya ke raja mereka –dan ketika itu agama Nasrani telah masuk ke negeri tersebut dan para rajanya telah beriman— maka pemuda itu menceritakan kisah mereka, maka raja itu dan para pengikutnya pergi ke gua tempat berlindung ashabul kahfi. وَأَنَّ السَّاعَةَ لَا رَيْبَ فِيهَآ(dan bahwa kedatangan hari kiamat tidak ada keraguan padanya) Dan agar mereka mengetahui bahwa hari kiamat tidak diragukan kejadiannya. إِذْ يَتَنٰزَعُونَ بَيْنَهُمْ أَمْرَهُمْ ۖ( Ketika orang-orang itu berselisih tentang urusan mereka) Terjadi perselisihan antara orang-orang yang menemukan mereka tentang lamanya waktu tidur mereka. فَقَالُوا۟ ابْنُوا۟ عَلَيْهِم بُنْيٰنًا ۖ( orang-orang itu berkata: “Dirikan sebuah bangunan di atas (gua) mereka) Perselisihan ini terjadi karena ketika sang raja dan para pengikutnya telah berdiri di depan para pemuda itu tiba-tiba Allah mematikan mereka. رَّبُّهُمْ أَعْلَمُ بِهِمْ ۚ( Tuhan mereka lebih mengetahui tentang mereka) Lebih mengetahui daripada orang-orang yang berselisih tentang mereka. قَالَ الَّذِينَ غَلَبُوا۟ عَلَىٰٓ أَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِم مَّسْجِدًا (Orang-orang yang berkuasa atas urusan mereka berkata: “Sesungguhnya kami akan mendirikan sebuah rumah peribadatan di atasnya”) Yakni sebagai penghormatan bagi mereka. Namun dalam syariat Nabi Muhammad, terdapat celaan bagi orang-orang terdahulu yang membangun rumah-rumah peribadatan di atas kuburan; dengan ini jelaslah bahwa yang mereka lakukan adalah suatu perbuatan bid’ah yang muncul pada agama Nasrani seiring dengan berjalannya waktu yang lama."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ قَالَ ٱلَّذِينَ غَلَبُوا۟ عَلَىٰٓ أَمْرِهِمْ لَنَتَّخِذَنَّ عَلَيْهِم مَّسْجِدًا } \"Orang-orang yang berkuasa atas urusan mereka berkata: \"Sesungguhnya kami akan mendirikan sebuah rumah peribadatan di atasnya\". ketahuilah bahwasanya sebagian besar dari penghuni kubur-kubur dari para nabi dan orang shalih membenci terhadap apa yang diperbuat di sisi kuburan mereka dari peribadatan yang tidak disyari'atkan, sampai-sampai ada dari kalangan orang jahil yang bermalam di sisinya dan lebih memilih meninggal syariat lain yang diperintahkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Sebagaimana Kami bangunkan mereka dari tidur mereka, Kami juga mempertemukan mereka dengan kaumnya, agar kaumnya itu mengetahui, bahwa janji Allah itu benar, dan bahwa kedatangan hari kiamat tidak ada keraguan padanya. Kemudian tatkala mereka bersaksi atas itu mereka beriman kepada hari kebangkitan, kemudian mereka dimatikan oleh Allah. Setelah mereka wafat, kaum mereka berdebat tentang keadaan/cerita mereka. Orang-orang itu berkata: \"Dirikan sebuah bangunan di atas gua mereka, hingga bisa menutupi mereka. -Tuhan mereka lebih mengetahui tentang perdebatan mereka-\". Orang-orang yang berkuasa atas urusan mereka berkata: \"Sesungguhnya kami akan mendirikan sebuah rumah peribadatan di atasnya\". Inilah yang menjadi syariat Islam bahwa dilarang membangun masjid di atas kubur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian Kami perlihatkan kepada mereka} Kami perlihatkan kepada mereka penduduk pada zaman itu {agar mengetahui bahwa janji Allah} untuk membangkitkan {itu benar dan hari kiamat itu tidak ada keraguan} tidak ada keraguan {padanya. Ketika mereka berselisih tentang urusan mereka (penghuni gua). lalu mereka berkata,“Dirikanlah di atas mereka} di atas pintu gua mereka {sebuah bangunan. Tuhan mereka lebih mengetahui tentang mereka (penghuni gua)” Orang-orang yang berkuasa atas urusan mereka berkata} para pemimpin negeri yang berkuasa atas urusan penduduknya {“Sungguh Kami akan mendirikan sebuah masjid di atasnya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Allah mengabarkan bahwasanya Dia memperlihatkan kepada manusia keadaan Ashabul Kahfi. Kejadian itu –wallahu a’lam- setelah mereka terjaga dan mengutus salah seorang di antara mereka untuk membeli makanan. Mereka memerintahkannya agar menyamar dan merahasiakan (perkara mereka). Maka, Allah berkehendak terhadap suatu kejadian yang berisi kemaslahatan bagi orang-orang dan tambahan pahala untuk mereka. Yaitu, ketika orang-orang menyaksikan salah satu tanda kebesaran Allah pada mereka (Ashabul Khafi) dengan mata kepala mereka bahwa janji Allah benar-benar ada, tidak ada syak dan keraguan padanya, tidak (pula) ada unsur kemustahilan setelah mereka dahulu berselisih paham tentang urusan para pemuda itu. Sebagian mengakui janji Allah dan Hari Pembalasan. Sebagian lain meniadakannya. Kemudian Allah menjadikan kisah Ashabul Kahfi kepada mereka sebagai tambahan ilmu dan keyakinan bagi kaum Mukminin dan hujjah (penggugat) bagi orang-orang yang menentang. Lalu jadilah pahala dalam perkara ini untuk mereka. Selanjutnya, Allah mempopulerkan perihal mereka dan mengangkat kedudukan mereka sehingga orang yang mengetahui tentang mereka melakukan “pengagungan”. Mereka mengatakan, “Dirikanlah sebuah bangunan di atas (gua) mereka.” Allah lebih mengetahui keadaan mereka dan tempat mereka kembali! Berkatalah orang yang berkuasa atas urusan mereka, yaitu orang-orang yang memegang wewenang urusan, “SEsungguhnya kami akan mendirikan rumah ibadah di atasnya,” maksudnya kami beribadah kepada Allah di dalamnya dan mengingat-ingat mereka serta peristiwa yang terjadi pada mereka. Perbuatan ini merupakan sebuah larangan, Nabi melarangnya dan mencela para pelakunya, bukan berarti penyebutannya di sini tidak menunjukkan celaan terhadapnya (rencana pembangunan masjid di atas kubur mereka), karena konteks pembahasan ini tentang Ashabul Kahfi dan pujian untuk mereka, dan (alasan kedua) bahwa pengagungan (bagi) Ashabul Kahfi sampai pada level di mana orang-orang mengatakan, “Dirikanlah sebuah rumah peribadatan di atasnya,” setelah ketakutan Ashabul Kahfi yang dahsyat terhadap kaumnya dan sikap kehati-hatian mereka dari detetksi terhadap keberadaan mereka hingga keadaan berubah pada tingkatan yang anda lihat. Pada kisah ini terdapat dalil bahwasanya orang yang lari menyelamatkan agamanya dari fitnah-fitnah, niscaya Allah akan menyelamatkannya, dan bahwa orang yang bersungguh-sungguh mencari keselamatan, niscaya Allah akan menyelamatkannya, dan bahwa orang yang berlindung kepada Allah, niscaya Allah akan akan melindunginya dan menjadikannya sebagai sumber hidayah bagi orang lain. Barangsiapa memikul kehinaan di jalan Allah dan mencari keridhaanNYa, niscaya kesudahan urusannya adalah kemuliaan yang agung dari arah yang tidak dia sangka. Dan apa yang ada di sisi Allah itu lebih baik bagi orang-orang yang patuh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 21: Yaitu janji-Nya akan membangkitkan manusia. Hal itu, karena yang berkuasa menidurkan mereka dalam waktu yang lama dan membiarkan mereka dalam keadaan seperti itu tanpa diberi makanan menunjukkan bahwa Dia berkuasa menghidupkan orang-orang yang telah mati. Orang-orang mukmin dan orang-orang kafir. Yang mereka perselisihkan itu adalah tentang hari kiamat; apakah hal itu akan terjadi atau tidak dan apakah kebangkitan pada hari kiamat dengan jasad atau roh ataukah dengan roh saja. Maka Allah mempertemukan mereka dengan pemuda-pemuda dalam kisah ini untuk menjelaskan bahwa hari kiamat itu pasti datang dan kebangkitan itu adalah dengan jasad dan roh. Pertemuan mereka dengan As-habul Kahfi ini menambah keyakinan kaum mukmin dan sebagai hujjah terhadap orang-orang yang mengingkari kebangkitan, dan Allah memasyhurkan kisah mereka (Ashabul Kahfi), meninggikan derajat mereka sampai orang-orang yang mengetahui tentang keadaan mereka (As-habul Kahfi) begitu memuliakan mereka. Yakni agar kita beribadah kepada Allah di situ, mengenang mereka dan mengingat peristiwa mereka. Hal ini adalah perkara yang dilarang oleh Nabi shallallahu 'alaihi wa sallam dan dicela pelakunya karena bisa mengarah kepada perbuatan syirk sebagaimana yang menimpa kaum Nabi Nuh ‘alaihis salam yang menyembah patung orang-orang saleh di antara mereka. Ayat ini tidaklah menunjukkan bahwa perbuatan tersebut tidak tercela, bahkan susunannya hanyalah menerangkan bagaimana para penghuni gua (As-habul Kahfi) itu dimuliakan sekali oleh manusia ketika itu. Dalam ayat ini terdapat dalil, bahwa orang yang pergi membawa agamanya, maka akan Allah menyelamatkannya dari fitnah, dan bahwa orang yang ingin sekali memperoleh perlindungan dari Allah, maka Allah akan melindunginya. Demikian juga menunjukkan, bahwa barang siapa yang siap menerima kehinaan di jalan Allah dan mencari keridhaan-Nya, maka akhirnya adalah kemuliaan dari arah yang tidak diduga-duga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 21",
    "description": "Dan demikian pula sebagai tanda kekuasaan kami, kami perlihatkan, yakni kami pertemukan penduduk negeri dengan mereka, agar mereka mengetahui, bahwa janji Allah tentang kebangkitan sesudah kematian kiamat itu benar, dan bahwa kedatangan hari kiamat tidak ada keraguan padanya. Ketika mereka penduduk negeri itu berselisih tentang urusan mereka, yakni tentang siapa sebenarnya pemuda-pemuda itu dan berapa lama mereka tertidur di dalam gua, maka mereka bersepakat untuk mengabadikan peristiwa ini, mereka berkata, dirikanlah sebuah bangunan di atas gua yang menjadi tempat persembunyian mereka, tidak usah kita persoalkan siapa mereka dan berapa lama mereka tertidur di dalam gua, tuhan mereka lebih mengetahui tentang mereka, siapa mereka dan bagaimana keadaannya baik lahir maupun batin. Orang yang berkuasa atas urusan mereka, yakni penguasa dari penduduk negeri itu berkata, kami pasti akan mendirikan sebuah bangunan untuk mengabadikan peristiwa ini berupa rumah ibadah, yang kami bangun di atasnya, yakni di atas gua itu. Setelah menjelaskan perbedaan pendapat penduduk negeri tentang penghuni gua itu, ayat selanjutnya menguraikan perbedaan pendapat orang-orang yang datang kemudian, termasuk kaum musyrik mekah, kaum yahudi dan nasrani pada masa nabi Muhammad. Nanti ada orang yang memperbincangkan berapa jumlah penghuni gua itu. Mereka mengatakan, jumlah mereka itu tiga orang, yang keempat adalah anjingnya, dan yang lain mengatakan, jumlah mereka lima orang, yang ke enam adalah anjingnya, perkataan itu mereka ucapkan sebagai terkaan terhadap sesuatu yang gaib tanpa dasar atau alasan apa pun; dan yang lain lagi mengatakan, jumlah mereka tujuh orang, yang ke delapan adalah anjingnya. Katakanlah wahai nabi Muhammad, terhadap mereka yang mengatakan itu, tuhanku yang memelihara dan membimbingku lebih mengetahui dari siapa pun jumlah mereka secara pasti; tidak ada yang mengetahui bilangan mereka kecuali yang diberitahu oleh Allah, dan mereka yang diberi tahu oleh Allah itu sedikit. Karena itu janganlah engkau wahai nabi Muhammad dan wahai kaum muslim berbantah tentang hal mereka, yakni ashhabul-kahf kecuali perbantahan lahir saja yang disertai bukti-bukti yang jelas dan jangan engkau menanyakan tentang mereka pemuda-pemuda ashhabul-kahf itu kepada siapa pun, setelah datang berita yang pasti dari tuhanmu."
  }
]