[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sebagain dari orang-orang yang larut dalam pembicaraan tentang urusan para pemuda penghuni gua dari kalangan ahli kitab mengatakan, ”Mereka berjumlah tiga orang yang keempat adalah anjing mereka.” golongan lain mengatakan ”mereka empat orang, dan yang kelima adalah anjing mereka.” ungkapan dua pihak itu hanya omongan dengan dasar praduga belaka, tanpa bukti dalil yang benar. Golongan ketiga menyebutkan ”mereka berjumlah tujuh orang, dan yang kedelapan ialah anjing mereka.” katakanlah (wahai rasul) ”tuhanku lebih mengetahui jumlah mereka. tidak ada yang mengetahui jumlah mereka, kecuali sedikit saja dari makhluk mereka.” maka janganlah mendebat ahli kitab tentang jumlah mereka(pemuda ashabul kahfi) itu, kecuali perdebatan pada perkara yang jelas saja, tidak sampai mendalam. akan tetapi ceritakanlah kepada mereka sebatas apa yang diberitakan oleh wahyu kepadamu saja. Janganlah kamu menanyakan kepada mereka tentang jumlah dan keadaan mereka, sebab sesungguhnya mereka tidak mengetahuinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Sebagian orang yang larut dalam kisah ini akan mengatakan tentang jumlah mereka, \"Jumlah mereka adalah tiga, yang keempat adalah anjing mereka,\" Sebagian mereka akan mengatakan, \"Jumlah mereka lima, yang keenam adalah anjing mereka.\" Dua kelompok ini menyatakan hal ini hanya mengikuti persangkaan mereka belaka tanpa disertai bukti. Kelompok lain menyatakan, \"Jumlah mereka tujuh, yang kedelapan adalah anjing mereka,\" Maka katakanlah wahai Rasul, \"Tuhanku lebih mengetahui jumlah mereka, tidak ada yang mengetahui jumlah mereka kecuali hanya sedikit dari kalangan orang-orang yang diberitahu oleh Allah,\" karena itu janganlah engkau mendebat Ahli Kitab atau selain mereka tentang jumlah atau perihal mereka yang lain, kecuali debat yang lahir saja dan tidak pada hal-hal yang detail, yaitu hanya mencukupkan diri dengan kabar yang diturunkan kepadamu berupa wahyu, dan jangan sekali-kali bertanya pada mereka (Ahli Kitab) tentang perihal mereka (para penghuni gua) sebab mereka tidak mengetahuinya sama sekali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Orang-orang yang saling berselisih mengenai kisah dan jumlah mereka akan saling mengutarakan pendapat. Sebagian mereka berkata: “Jumlah mereka tiga orang, dan yang keempat adalah anjing mereka”. Dan sebagian lainnya berkata: “Jumlah mereka lima orang dan yang keenam adalah anjing mereka.” Dua pendapat ini hanyalah perkiraan yang tidak berlandaskan dalil dan keyakinan. Dan sebagian mereka berkata: “Jumlah mereka tujuh orang dan yang keenam adalah anjing mereka.” Hai Nabi, katakanlah kepada mereka: “Tuhanku lebih mengetahui jumlah mereka yang sebenarnya; tidak ada yang mengetahui jumlah mereka kecuali sedikit orang dari hamba-Nya.” Maka janganlah kamu berdebat dengan seorangpun tentang mereka melainkan sebatas apa yang telah diwahyukan kepadamu, dan janganlah kamu bertanya seorangpun dari orang-orang Yahudi dan Nasrani tentang kisah mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. سَيَقُولُونَ ثَلٰثَةٌ رَّابِعُهُمْ كَلْبُهُمْ (Nanti (ada orang yang akan) mengatakan (jumlah mereka) adalah tiga orang yang keempat adalah anjingnya) Mereka yang mengatakan bahwa ashabul kahfi berjumlah tiga, lima, atau tujuh orang adalah orang-orang yang berselisih pada zaman Rasulullah dari kalangan ahli kitab dan kaum muslimin. وَيَقُولُونَ(dan (yang lain) mengatakan) Yakni dan sebagian lainnya mengatakan. خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًۢا بِالْغَيْبِ ۖ( “(jumlah mereka) adalah lima orang yang keenam adalah anjing nya”, sebagai terkaan terhadap barang yang gaib) Makna (الرجم بالغيب) yakni berbicara hanya dengan landasan prasangka dan firasat tanpa dasar berita yang benar. وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ ۚ( dan (yang lain lagi) mengatakan: “(jumlah mereka) tujuh orang, yang ke delapan adalah anjingnya”) Sepertinya pendapat kelompok ini lebih dekat pada pendapat yang benar, dengan dalil bahwa kelompok ini tidak dimasukkan ke dalam kelompok orang-orang yang berpendapat hanya dengan prasangka dan dugaan saja. قُل رَّبِّىٓ أَعْلَمُ بِعِدَّتِهِم(Katakanlah: “Tuhanku lebih mengetahui jumlah mereka) Wahai orang-orang yang berselisih, Allah lebih mengetahui daripada kalian. مَّا يَعْلَمُهُمْ(tidak ada orang yang mengetahui (bilangan) mereka) Yakni tidak ada yang mengetahui diri mereka terlebih lagi jumlah mereka. إِلَّا قَلِيلٌ ۗ( kecuali sedikit) Yakni beberapa orang saja. فَلَا تُمَارِ فِيهِمْ(Karena itu janganlah kamu (Muhammad) bertengkar tentang hal mereka) Makna (المراء) adalah perdebatan. إِلَّا مِرَآءً ظٰهِرًا(kecuali pertengkaran pada hal yang tampak saja) Yakni tanpa berlarut-larut dalam perdebatan itu, yakni hanya menceritakan kisah mereka dengan apa yang diwahyukan Allah saja. وَلَا تَسْتَفْتِ فِيهِم مِّنْهُمْ أَحَدًا(dan jangan kamu menanyakan tentang mereka (pemuda-pemuda itu) kepada seorangpun di antara mereka) Dan kisah yang telah diceritakan Allah kepadamu sudah cukup bagimu sehingga tidak butuh lagi untuk bertanya kepada orang yang sebenarnya tidak memiliki ilmu tentang mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ } \"dan (yang lain lagi) mengatakan: \"(jumlah mereka) tujuh orang, yang ke delapan adalah anjingnya\" dan setelahnya Allah tidak mengatakan { رَجْمًۢا بِٱلْغَيْبِ } \"sebagai terkaan terhadap barang yang gaib\" hal ini menunjukkan bahwa jumlah mereka (ashabul kahfi) adalah tujuh orang dan yang ke delapan adalah anjing yang mereka bawa, karena tatkala Allah membatalkan dua pendapat pertama, Ia diam pada pendapat yang ketiga dan itu menunjukkan kebenaran. 2 ). Al-Qurthubi menjelaskan dalam tafsirnya tentang ayat { وَلَا تَسْتَفْتِ فِيهِم مِّنْهُمْ أَحَدًا } \"dan jangan kamu menanyakan tentang mereka (pemuda-pemuda itu) kepada seorangpun di antara mereka\" diriwayat bahwa Rasulullah bertanya kepada seorang Nashrani dari Najran kemudian Allah melarang beliau untuk bertanya, ini menunjukkan dilaranganya mengambil satu hukum atau ilmu apapun dari Ahli kitab. 3 ). { وَلَا تَسْتَفْتِ فِيهِم مِّنْهُمْ أَحَدًا } Ayat ini juga menjadi dalil bahwa tidak sebaiknya seseorang meminta fatwa kepada seseorang yang bukan ahli dalam bidang tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Nanti akan ada orang yang mengatakan tentang kisah dan jumlah mereka. Tiga orang, yang keempat adalah anjingnya. Versi yang lain mengatakan: \"Jumlah mereka lima orang yang keenam adalah anjingnya\". Sebagai terkaan terhadap perkara yang gaib. Versi lain lagi mengatakan: \"Jumlah mereka tujuh orang, yang ke delapan adalah anjingnya\". Katakanlah: \"Tuhanku lebih mengetahui jumlah mereka; tidak ada orang yang mengetahui bilangan mereka kecuali sedikit\". Karena itu janganlah kamu wahai Muhammad bertengkar tentang mereka, kecuali pertengkaran lahir saja dan jangan kamu menanyakan tentang pemuda-pemuda Al-kahfi itu kepada seorangpun di antara mereka. Cukup dengan wahyu ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu mereka akan berkata} oraang-oraang yang berlarut (berdebat) tentang jumlah mereka {“ tiga orang, yang keempat adalah anjing mereka” (Sebagian) Mereka juga berkata,“ lima orang, yang keenam adalah anjing mereka” sebagai terkaan terhadap yang gaib} perkataan yang disertai dengan sangkaan tanpa keyakinan dan keilmuan di dalamnya {(Sebagian) Mereka juga berkata,“tujuh orang, yang kedelapan adalah anjing mereka” Katakanlah,“Tuhanku lebih mengetahui jumlah mereka} jumlah mereka {Tidak ada yang mengetahui mereka kecuali hanya sedikit” Maka janganlah kamu berdebat tentang hal mereka} maka janganlah kamu berdebat tentang jumlah dan keadaan mereka {kecuali perbantahan yang bagian luar saja} kecuali perdebatan yang bagian luar saja bukan mendalam, dengan membacakan untuk mereka sesuatu yang diwahyukan kepadamu {Janganlah kamu meminta penjelasan tentang mereka kepada siapa pun dari mereka} janganlah bertanya kepada siapa pun dari Ahlul kitab tentang kisah mereka dengan pertanyaan seperti meminta petunjuk, sesungguhnya mereka tidak mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Allah menceritakan tentang perselisihan Ahli KItab mengenai jumlah Ashabul Kahfi. Sebuah perselisihan yang bertolak dari terkaan mereka terhadap perkara ghaib dan omongan mereka yang mengada-ada terhadap peristiwa yang tidak mereka ketahui, dan bahwasanya, mereka terbagi menjadi tiga pendapat: Sebagian mereka mengatakan, “(Jumlah mereka) tiga orang, yang keempat adalah anjingnya.’ Sebagian lain mengatakan, “(Jumlah mereka) lima orang, yang keenam adalah anjingnya.” Dua pendapat ini, Allah sebutkan setelahnya sebagai bentuk terkaan dari mereka tentang perkara ghaib. Maka Allah menunjukkan kebatilan dua pernyataan itu. Di antara mereka ada yang mengatakan, “(Jumlah mereka) tujuh orang, yang kedelapan adalah anjingnya.” Perkataan ini –wallahu a’lam- merupakan pendapat yang benar, karena Allah mengugurkan dua pendapat pertama dan tidak mempermasalahkan perkataan berikutnya. Ini berarti menunjukkan kebenarannya. Perselisihan ini termasuk perbedaan pendapat yang tidak mengandung manfaat apa pun, dan pengetahuan tentang jumlah mereka tidak menghasilkan kemaslahatan bagi manusia, baik secara agama ataupun dunia. Oleh karena itu, Allah berfirman, “Katakanlah, ‘Rabbku lebih mengetahui jumlah mereka, tidak ada orang yang mengetahui bilangan mereka kecuali sedikit’ .” mereka itulah orang-orang yang selaras dengan kebenaran, dan mengetahui kebenaran pendapat mereka. “Karena itu janganlah kamu (Muhammad) berbantah,” berdebat dan beradu argumentasi, “tentang hal mereka, kecuali perbantahan lahir saja,” yang berdasarkan ilmu dan keyakinan, dan juga mengandung faidah. Adapun perbantahan berdasarkan kebodohan dan terkaan terhadap hal yang ghaib atau yang tidak ada faidahnya; baik pihak lawan sosok yang suka menentang atau permasalahan tersebut tidak penting dan tidak menghasilkan manfaat secara agama dengan mengetahuinya, seperti (mengetahui) jumlah para penghuni gua dan perkara serupa lainnya, maka sesungguhnya banyak diskusi dan pembahasan yang berlarut-larut tentang masalah itu hanya menyia-nyiakan waktu dan menggerogoti kecintaan hati (kepada orang lain) tanpa manfaat. “Dan jangan kamu menanyakan tentang mereka (pemuda-pemuda itu),” maksudnya tentang perkara Ashabul Kahfi “kepada seorang pun dari mereka,” yaitu Ahli KItab. Demikian itu karena landasan perkataan tentang para penghuni gua adalah terkaan dan prasangka yang tidak berpengaruh terhadap kebenaran sedikit pun. Di dalamnya, terdapat dalil larangan meminta fatwa kepada orang yang tidak layak untuk berfatwa, baik lantaran kedangkalan ilmunya dalam perkara yang ditanyakan atau karena dia tidak peduli dengan apa yang telah dia ucapkan, tidak memiliki sifat wara’ yang mengekangnya. Jika meminta fatwa kepada orang semacam ini dilarang, maka larangan terhadap dirinya untuk memberikan fatwa lebih ditekankan lagi. Pada ayat ini juga terkandung dalil bahwasanya seseorang tidak boleh dimintai fatwa dalam perkara tertentu tanpa (menutup kesempatan) pada masalah yang lain. Ia boleh diminta berfatwa dalam masalah yang ia kuasai, berbeda dengan masalah lainnya. Karena Allah tidak melarang meminta fatwa kepada mereka secara mutlak. Tetapi, Allah melarang meminta fatwa kepada mereka tentang kisah Ashabul Kahfi dan kejadian yang serupa dengannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 22: Yang dimaksud dengan orang yang akan mengatakan ini adalah orang-orang ahli kitab dan yang lainnya pada zaman Nabi Muhammad shallallahu 'alaihi wa sallam. Dua pendapat ini dikemukakan oleh orang-orang Nasrani Najran. Yakni kaum mukmin. Kedua pendapat sebelumnya (yakni pendapat Nasrani Najran) disebut sebagai “terkaan terhadap yang gaib”, sedangkan pendapat yang terakhir yang menyebutkan bahwa jumlah mereka adalah tujuh orang, sedangkan yang kedelapan adalah anjingnya, menunjukkan bahwa pendapat inilah pendapat yang benar karena tidak disebut sebagai terkaan terhadap yang gaib. Akan tetapi, karena mengetahui jumlah mereka kurang begitu bermaslahat bagi manusia, baik terkait dengan agama maupun dunia, maka pada lanjutan ayatnya Allah Subhaanahu wa Ta'aala berfirman, “Katakanlah (Muhammad), \"Tuhanku lebih mengetahui jumlah mereka; tidak ada yang mengetahui (bilangan) mereka kecuali sedikit.” Yakni perbantahan yang dibangun atas dasar ilmu dan keyakinan, dan di dalamnya pun ada faedahnya. Adapun perbantahan yang didasari atas kejahilan (kebodohan), terkaan terhadap yang gaib, atau yang tidak ada faedahnya, seperti jumlah As-habul Kahfi, dsb. maka hanya menghabiskan waktu dan membuat hati senang untuk hal-hal yang tidak ada faedahnya. Yakni di antara Ahli Kitab. Hal itu tidak lain karena jawaban mereka didasari atas perkiraan yang tidak membuahkan kebenaran. Dalam ayat ini terdapat dalil larangan meminta fatwa kepada orang yang tidak layak berfatwa, hal ini bisa karena kurangnya ilmu dalam masalah yang dipersoalkan atau karena ia kurang peduli terhadap kata-katanya dan lagi tidak punya rasa takut. Dalam ayat ini juga terdapat dalil, bahwa seseorang mungkin dilarang dimintai fatwa tentang suatu masalah, namun tidak pada masalah lain (yakni tidak mutlak; tidak bolehnya sama sekali bertanya kepadanya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 22",
    "description": "Setelah menjelaskan perbedaan pendapat penduduk negeri tentang penghuni gua itu, ayat selanjutnya menguraikan perbedaan pendapat orang-orang yang datang kemudian, termasuk kaum musyrik mekah, kaum yahudi dan nasrani pada masa nabi Muhammad. Nanti ada orang yang memperbincangkan berapa jumlah penghuni gua itu. Mereka mengatakan, jumlah mereka itu tiga orang, yang keempat adalah anjingnya, dan yang lain mengatakan, jumlah mereka lima orang, yang ke enam adalah anjingnya, perkataan itu mereka ucapkan sebagai terkaan terhadap sesuatu yang gaib tanpa dasar atau alasan apa pun; dan yang lain lagi mengatakan, jumlah mereka tujuh orang, yang ke delapan adalah anjingnya. Katakanlah wahai nabi Muhammad, terhadap mereka yang mengatakan itu, tuhanku yang memelihara dan membimbingku lebih mengetahui dari siapa pun jumlah mereka secara pasti; tidak ada yang mengetahui bilangan mereka kecuali yang diberitahu oleh Allah, dan mereka yang diberi tahu oleh Allah itu sedikit. Karena itu janganlah engkau wahai nabi Muhammad dan wahai kaum muslim berbantah tentang hal mereka, yakni ashhabul-kahf kecuali perbantahan lahir saja yang disertai bukti-bukti yang jelas dan jangan engkau menanyakan tentang mereka pemuda-pemuda ashhabul-kahf itu kepada siapa pun, setelah datang berita yang pasti dari tuhanmu. Beberapa orang quraisy bertanya kepada nabi tentang roh, kisah penghuni gua dan kisah zulkarnain. Nabi Muhammad menyuruh mereka datang besok pagi dan beliau menjanjikan akan menceritakan kepada meraka peristiwa ini. Allah memberi pelajaran dalam ayat ini, dan jangan sekali-kali engkau mengatakan terhadap sesuatu, yakni menjanjikan akan memberikan jawaban terhadap pertanyaan atau melakukan sesuatu dengan berkata aku pasti melakukan itu besok pagi, ."
  }
]