[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Dan janganlah mengatakan sesuatu yang engkau berniat untuk melakukannya, ”aku akan melakukan sesuatu itu besok.” kecuali engkau menggantungkan ucapanmu dengan kehendak Allah. Yaitu engkau mengatakan, ”insya Allah” dan ingatlah kepada tuhanmu ketika engkau lupa mengucapkan ”insya Allah” dan tiap kali engkau lupa, maka berdzikirlah(mengingat dan menyebut Allah) sebab mengingat Allah akan menghilangkan lupa. Dan katakanlah “semoga tuhanku akan menunjukan kepadaku jalan paling dekat yang mengantarkan menuju hidayah dan petunjuk yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dan jangan sekali-kali engkau -wahai Rasul- mengatakan pada sesuatu yang ingin engkau kerjakan besok harinya dengan ucapan, \"Aku pasti melakukannya besok hari,\" karena engkau belum tahu apakah benar-benar akan melakukannya atau engkau akan terhalangi untuk melakukannya? Tentunya perintah ini ditujukan juga kepada setiap muslim."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23-25. Allah menyampaikan kepada rasul-Nya agar dia menyampaikan kepada umatnya larangan tegas tentang urusan seseorang di masa depan dengan berkata ‘aku akan melakukan ini’ tanpa menyertainya dengan ucapan ‘In Sya Allah’, sebab segala sesuatu hanya terjadi dengan kehendak Allah. Dan ingatlah Tuhanmu ketika kamu lupa mengucapkan ‘In Sya Allah’. Dan setiap kali kamu lupa sesuatu maka ingatlah Allah dengan berdoa dan tunduk kepada-Nya. dan katakanlah: “Semoga Allah memberiku taufik kepada sesuatu yang lebih baik bagi agama dan duniaku.” Dan para pemuda ashabul kahfi tersebut tidur di dalam gua selama 309 tahun Qamariyah atau 300 tahun Syamsiyah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَا تَقُولَنَّ لِشَا۟ىْءٍ إِنِّى فَاعِلٌ ذٰلِكَ غَدًا (Dan jangan sekali-kali kamu mengatakan tentang sesuatu: “Sesungguhnya aku akan mengerjakan ini besok pagi) Ketika orang-orang Yahudi bertanya kepada Rasulullah tentang kisah ashabul kahfi, Rasulullah berkata kepada mereka: “aku akan memberitahu kalian besok” tanpa mengatakan InsyaAllah. Kemudian wahyu tidak turun kepadanya sehingga itu membuatnya merasa susah. Maka Allah menurunkan ayat ini. Yakni jika kamu mengatakan ‘aku akan melakukan hal itu besok’ maka sertailah dengan perkataan InsyaAllah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23-24. Jangan sekali-kali kamu mengatakan tentang sesuatu yang kamu sangka: \"Sesungguhnya aku akan mengerjakan ini besok pagi, kecuali dengan menyebut: \"Insya Allah\". Ingatlah kepada Tuhanmu dengan tasbih, takbir dan istighfar jika kamu lupa dan katakanlah: \"Mudah-mudahan Tuhanku akan memberiku petunjuk kepada yang lebih dekat kebenarannya dari pada ini\". Ibnu Abbas berkata: Nabi pernah bersumpah, kemudian hingga berlalu 40 malam. Sehingga turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jangan sekali-kali kamu mengatakan terhadap sesuatu,“Aku pasti melakukan hal itu besok”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. Larangan ini adalah sebagaimana larangan lainnya, sekalipun penyebabnya khusus dan ditujukan kepada Rasulullah, akan tetapi arah pembicaraannya umum, untuk semua kalangan mukallaf. Allah melarang seorang hamba mengatakan dalam urusan yang akan datang, “Sesungguhnya aku akan mengerjakan itu,” tanpa menggandengkannya dengan kehendak Allah. Demikian itu, karena sikap tersebut memuat sebuah larangan. Yaitu berbicara tentang perkara ghaib yang akan datang, yang mana dia tidak mengetahui apakah dia akan mengerjakannya atau tidak? Dan apakah akan terjadi atau tidak? Pada ungkapan itu (tanpa mengaitkan dengan kehendak Allah) mengandung pengertian mengembalikan sebuah perbuatan kepada kehendak seorang hamba belaka, dan sikap demikian ini dilarang lagi diharamkan. Sebab, semua kehendak adalah milik Allah. \"Dan kamu tidak dapat menghendaki (menempuh jalan itu) kecuali apabila dikehendaki Allah, Tuhan semesta alam.\" (At-Takwir: 29) Dan karena pada penyertaan kehendak Allah memuat unsur memuluskan dan memudahkan urusan, teraihnya berkah serta unsur meminta bantuan dari hamba kepada Rabbnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 23: Larangan ini meskipun ditujukan kepada Rasulullah shallallahu 'alaihi wa sallam, namun berlaku umum kepada umat Beliau, sehingga seseorang dilarang mengatakan terhadap perkara-perkara yang akan datang, “Saya akan melakukannya besok.” Tanpa menyertakan kalimat “Insya Allah” (jika Allah menghendaki). Yang demikian, karena di dalamnya sama saja berkata tentang hal yang masih gaib. Menyebutkan “Insya Allah” ada beberapa faedah, di antaranya berharap kemudahan dari Allah dan keberkahan-Nya, serta menunjukkan permintaan dari seorang hamba kepada Tuhannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 23",
    "description": "Beberapa orang quraisy bertanya kepada nabi tentang roh, kisah penghuni gua dan kisah zulkarnain. Nabi Muhammad menyuruh mereka datang besok pagi dan beliau menjanjikan akan menceritakan kepada meraka peristiwa ini. Allah memberi pelajaran dalam ayat ini, dan jangan sekali-kali engkau mengatakan terhadap sesuatu, yakni menjanjikan akan memberikan jawaban terhadap pertanyaan atau melakukan sesuatu dengan berkata aku pasti melakukan itu besok pagi, kecuali engkau janjikan hal itu dengan mengatakan insya Allah, yakni jika dikehendaki Allah. Dan ingatlah kepada tuhanmu apabila engkau lupa mengaitkan janjimu dengan kehendak Allah, begitu engkau ingat, kaitkanlah janjimu itu dengan mengatakan insya Allah dan katakanlah wahai nabi Muhammad, mudah-Mudahan tuhanku akan memberiku petunjuk kepadaku untuk menjelaskan sesuatu kepada yang lebih dekat kebenarannya daripada ini, yakni dari kisah penghuni gua dalam memberi petunjuk kepada kenabianku."
  }
]