[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "23-24. Dan janganlah mengatakan sesuatu yang engkau berniat untuk melakukannya, ”aku akan melakukan sesuatu itu besok.” kecuali engkau menggantungkan ucapanmu dengan kehendak Allah. Yaitu engkau mengatakan, ”insya Allah” dan ingatlah kepada tuhanmu ketika engkau lupa mengucapkan ”insya Allah” dan tiap kali engkau lupa, maka berdzikirlah(mengingat dan menyebut Allah) sebab mengingat Allah akan menghilangkan lupa. Dan katakanlah “semoga tuhanku akan menunjukan kepadaku jalan paling dekat yang mengantarkan menuju hidayah dan petunjuk yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Kecuali jika dalam ucapanmu tersebut engkau menyerahkan pelaksanaannya pada kehendak Allah dengan mengatakan, \"Saya akan mengerjakannya besok insyā Allah (bila Allah menghendaki).\" Dan ingatlah kepada Tuhanmu dengan kata \"insyā Allah\" bila engkau lupa mengatakannya, dan juga katakanlah, \"Aku harap semoga Tuhanku memberiku petunjuk berupa hidayah dan taufik kepada yang lebih dekat dengan perkara (kebenaran) ini.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَاذْكُر رَّبَّكَ (Dan ingatlah kepada Tuhanmu) Dengan beristighfar dan bertahlil. إِذَا نَسِيتَ(jika kamu lupa) Yakni jika kamu lupa mengatakan ‘InsyaAllah’ kemudian kamu mengingatnya di lain waktu maka katakanlah kalimat tersebut. وَقُلْ عَسَىٰٓ أَن يَهْدِيَنِ رَبِّى لِأَقْرَبَ مِنْ هٰذَا رَشَدًا(dan katakanlah: “Mudah-mudahan Tuhanku akan memberiku petunjuk kepada yang lebih dekat kebenarannya dari pada ini”) Yakni semoga Tuhanku memberiku mukjizat dan tanda yang menunjukkan kenabianku yang lebih mendekatkan pada petunjuk dan lebih kuat daripada kisah tentang ashabul kahfi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23-24. Jangan sekali-kali kamu mengatakan tentang sesuatu yang kamu sangka: \"Sesungguhnya aku akan mengerjakan ini besok pagi, kecuali dengan menyebut: \"Insya Allah\". Ingatlah kepada Tuhanmu dengan tasbih, takbir dan istighfar jika kamu lupa dan katakanlah: \"Mudah-mudahan Tuhanku akan memberiku petunjuk kepada yang lebih dekat kebenarannya dari pada ini\". Ibnu Abbas berkata: Nabi pernah bersumpah, kemudian hingga berlalu 40 malam. Sehingga turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali (mengatakan),“jika Allah menghendaki”} kecuali kamu menggantungkan ucapanmu kepada kehendaknya, maka kamu berkata, Jika Allah berkehendak {Ingatlah kepada Tuhanmu apabila kamu lupa dan katakanlah,“Mudah-mudahan Tuhanku akan memberiku petunjuk} menuntunku {kepada yang lebih dekat kebenarannya daripada ini} yang membimbing dan menunjukkan manusia kepada kebenaran itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Ketika seorang hamba itu adalah manusia yang pasti mengalami kelupaan untuk mengingat kehendak Allah, maka Dia memerintahkannya untuk mengecualikannya setelah itu bila ingat, agar terwujudkan apa yang diinginkan dan tertampik bahaya darinya. Keterangan ini terambil dari keumuman FirmanNya, “Dan ingatlah kepada Rabbmu jika kamu lupa.” Perintah mengingat Allah ketika lupa, karena dapat menghilangkan dan mengingatkan seseorang apa yang dia lupakan. Begitu juga, orang alpa lagi lupa (mengingat Allah) diperintahkan supaya menyebut nama Rabbnya agar tidak menjadi orang yang benar-benar lalai. Tatkala seorang hamba membutuhkan taufik Allah agar dapat meraih kebenaran dan tidak mengalami kesalahan dalam perkataan dan perbuatannnya, maka Allah memerintahkannya agar mengucapkan, “MUdahan-mudahan Rabbku akan memberiku petunjuk kepada yang lebih dekat kebenarannya daripada ini.” Allah memerintahkannya agar berdoa dan mengaharapNya serta percaya kepada Allah bahwa Dia akan menunjukkan kepadanya jalan paling pintas yang mengantarkan kepada kebenaran. Seharusnya seorang hamba keadaannya seperti ini lalu Dia mencurahkan segenap kesungguhannya dan mengerahkan kemampuannya dalam mencari petunjuk dan kebenaran supaya dia diberi taufik untuk tujuan itu, dan agar pertolongan datang dari Rabbnya kepada dirinya dan meluruskan seluruh perkaranya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 24: Menurut riwayat, ada beberapa orang Quraisy bertanya kepada Nabi Muhammad s.a.w. tentang roh, kisah ashhabul kahfi (penghuni gua) dan kisah Dzulqarnain lalu beliau menjawab, datanglah besok pagi kepadaku agar aku ceritakan. dan beliau tidak mengucapkan insya Allah (artinya jika Allah menghendaki). tapi kiranya sampai besok harinya wahyu terlambat datang untuk menceritakan hal-hal tersebut dan Nabi tidak dapat menjawabnya. Maka turunlah ayat 23-24 di atas, sebagai pelajaran kepada Nabi; Allah mengingatkan pula bilamana Nabi lupa menyebut insya Allah haruslah segera menyebutkannya kemudian. Oleh karena manusia memiliki sifat lupa sehingga mungkin ia tidak menyebut “Insya Allah”, maka Allah Subhaanahu wa Ta'aala memerintahkan kepadanya agar menyebutkan kalimat itu setelah ingat. Dari firman-Nya, “Dan ingatlah kepada Tuhanmu apabila engkau lupa” terdapat perintah untuk mengingat Allah dan agar jangan sampai termasuk orang-orang yang lalai. Oleh karena seorang hamba butuh kepada taufik Allah agar tetap di atas yang benar, dan tidak salah dalam ucapan dan tindakannya, maka Allah memerintahkan mengatakan kata-kata di atas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 24",
    "description": "Kecuali engkau janjikan hal itu dengan mengatakan insya Allah, yakni jika dikehendaki Allah. Dan ingatlah kepada tuhanmu apabila engkau lupa mengaitkan janjimu dengan kehendak Allah, begitu engkau ingat, kaitkanlah janjimu itu dengan mengatakan insya Allah dan katakanlah wahai nabi Muhammad, mudah-Mudahan tuhanku akan memberiku petunjuk kepadaku untuk menjelaskan sesuatu kepada yang lebih dekat kebenarannya daripada ini, yakni dari kisah penghuni gua dalam memberi petunjuk kepada kenabianku. Setelah memberikan tuntunan kepada nabi Muhammad, ayat ini meneruskan kembali kisah penghuni gua. Dan mereka tinggal dalam gua dalam keadaan tertidur di dalamnya selama tiga ratus tahun menurut perhitungan tahun syamsiah yang digunakan kaum yahudi dan nasrani dan ditambah sembilan tahun jika dihitung menurut perhitungan tahun qamariah yang digunakan oleh penduduk negeri mekah saat itu."
  }
]