[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para pemuda itu tinggal dalam keadaan tidur di gua mereka selama tiga ratus sembilan tahun lamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Dan para penghuni gua tinggal dalam gua tersebut selama tiga ratus sembilan tahun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. وَلَبِثُوا۟ فِى كَهْفِهِمْ ثَلٰثَ مِا۟ئَةٍ سِنِينَ وَازْدَادُوا۟ تِسْعًا (Dan mereka tinggal dalam gua mereka tiga ratus tahun dan ditambah sembilan tahun) Yakni mereka tertidur di dalam gua selama 309 tahun sebelum Allah membangunkan mereka kembali. Imam al-Zajjaj berpendapat yang dimaksud adalah 300 tahun Syamsiyah (Masehi) atau 309 Qamariyah (Hijriyah)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Mereka tinggal dalam gua selama tiga ratus tahun dan ditambah sembilan tahun lagi menurut tahun Hijriyah. Adapaun menurut tahun masehi selama 300 tahun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka tinggal} para penghuni gua itu tinggal {dalam gua selama tiga ratus tahun dan ditambah sembilan tahun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. Tatkala Allah melarang Rasulullah meminta fatwa kepada ahli kitab tentang perkara Ashabul Kahfi karena mereka tidak memiliki ilmu tentang hal itu, sedangkan Allah adalah Dzat yang Maha Mengetahui hal yang ghaib maupun yang nyata dan Maha Mengetahui segala sesuatu, maka Allah memberitahukan kepada RasulNya tentang berapa lama mereka tinggal. Ilmu tentang hal itu hanyalah milik Allah, karena termasuk perkara yang tersembunyi di langit dan bumi. Keghaiban kejadian itu menjadi hak khususNya. Dan apa yang Allah beritakan melalui lisan RasulNya merupakan kebenaran yang diyakini yang tidak ada keraguan padanya. Dan berita yang tidak Allah beritahukan kepada para RasulNya, maka tidak ada seorang pun dari makhluk yang dapat mengetahuinya. Firman Allah, “Alangkah terang penglihatanNya dan alangkah tajam pendengaranNya,” kekaguman terhadap kesempurnaan pendengaran dan penglihatanNYa serta jangkauan keduanya terhadap seluruh obyek yang didengar dan obyek-obyek yang terlihat setelah Dia mengabarkan tentang ilmuNya yang meliputi segala sesuatu yang diketahui, kemudian Allah menyatakan keesaanNYa dalam penjagaan yang umum dan khusus. Dia-lah Pemelihara yang berwenang mengatur seluruh alam semesta dan Pemelihara bagi hamba-hambaNya yang beriman, mengeluarkan mereka dari kegelapan menuju cahaya, memberikan taufik bagi mereka menuju jalan yang mudah, dan menjauhkan mereka dari kesulitan. Oleh karena itu, Allah berfirman, “Tidak ada seorang pelindung pun bagi mereka selain dariNya.” Maksudnya, Dia-lah yang mengurus perkara Ashabul Kahfi dengan kelembutan dan kemuliaanNya, tidak menyerahkan urusan mereka kepada seorang pun dari kalangan makhlukNya. “Dan Dia tidak mengambil seorang pun menjadi sekutuNya dalam menetapkan keputusan.” Ini mencakup putusan takdir yang bersifat kauni dan syar’i. Sesungguhnya Allah adalah Pemutus keputusan di tengah makhlukNya baik dalam masalah keputusan, ketetapan takdir, penciptaan, dan pengaturan, dan Dzat yang menjadi hakim pada mereka dengan perintah dan llaranganNya, pahala dan hukumanNya. Tatkala Allah menceritakan bahwa bagiNya perkara-perkara yang tersembunyi di langit dan bumi, maka tidak ada cara bagi makhluk untuk mengetahuinya kecuali melalui berita yang Allah kabarkan kepada para hambaNya. Al-Quran telah menghimpun banyak sekali perkara ghaib. Allah memerintahkan supaya meresponnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 25: Setelah Allah Subhaanahu wa Ta'aala melarang Beliau bertanya kepada Ahli Kitab tentang As-habul Kahfi karena mereka tidak memiliki ilmu terhadapnya, sedang Allah Subhaanahu wa Ta'aala Maha Mengetahui yang gaib dan yang nampak, maka Allah Subhaanahu wa Ta'aala memberitahukan lama mereka tinggal di gua, dan bahwa yang mengetahuinya hanya Dia, karena hal tersebut termasuk perkara gaib."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 25",
    "description": "Setelah memberikan tuntunan kepada nabi Muhammad, ayat ini meneruskan kembali kisah penghuni gua. Dan mereka tinggal dalam gua dalam keadaan tertidur di dalamnya selama tiga ratus tahun menurut perhitungan tahun syamsiah yang digunakan kaum yahudi dan nasrani dan ditambah sembilan tahun jika dihitung menurut perhitungan tahun qamariah yang digunakan oleh penduduk negeri mekah saat itu. Katakanlah kepada siapa yang tidak percaya atau membantah keterangan ini, Allah yang ilmu-Nya meliputi segala sesuatu lebih mengetahui berapa lamanya mereka tinggal di dalam gua; betapa tidak, sebab milik-Nya semua yang tersembunyi di langit dan di bumi, tidak ada sesuatu pun yang terluput dari pengetahuan-Nya. Alangkah terang penglihatan-Nya terhadap segala sesuatu dan alangkah tajam pendengaran-Nya terhadap suara; tidak ada seorang pelindung pun bagi mereka penduduk langit maupun bumi selain dia yang mahakuasa atas segala sesuatu; dan dia tidak mengambil seorang pun menjadi sekutu-Nya dalam menetapkan keputusan, sebab dia tidak membutuhkan siapa pun menjadi sekutu bagi-Nya."
  }
]