[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bila engkau (wahai rasul), ditanya tentang lama masa tinggal mereka di dalam gua, sedang engkau tidak punya pengetahuan tentang itu dan tergantung pada berita dari Allah , maka janganlah engkau menyampaikan dahulu dalam masalah itu dengan sesuatu berita apapun. akan tetapi ucapkalah, ”Allah lebih mengetahui berapa lama mereka tinggal. KepunyaanNya semua tersembunyi di langit dan dibumi. Alangkah terang penglihatan dan pendengaran Allah, serta pengetahuanNya yang meliputi segala sesuatu. Tidak ada seorangpun dari makhlukNya selainNya yang mengurusi mereka. Dia tidak punya sekutu dalam penetapan hukum, ketentuan, dan aturan syariatNya. Maha suci Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Katakanlah -wahai Rasul-, \"Allah lebih mengetahui berapa lamanya mereka tinggal di dalam gua tersebut, kami juga telah memberitahukan jangka lama tinggalnya mereka di dalamnya sehingga tidak boleh ada pendapat lain tentangnya selain firman Allah -Ta'ālā- ini, sebab Dialah semata yang menciptakan dan mengetahui segala perkara gaib di langit maupun di bumi, sungguh betapa Allah Maha Melihat dan mengetahui segala sesuatu, dan sungguh betapa Dia Maha Mendengar segala sesuatu, tidak ada seorang penolong dan pelindung pun selain Dia yang selalu memperhatikan urusan mereka, dan Dia tidak mengambil seorang pun menjadi sekutu-Nya dalam menetapkan hukum dan keputusan-Nya, sebab Dia lah satu-satunya yang menetapkan hukum dan keputusan tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Hai Nabi, katakanlah: Allah lebih mengetahui lama waktu mereka tinggal di dalam gua -sebagaimana disebutkan jelas dalam ayat sebelumnya-. Milik-Nya ilmu ghaib yang ada dalam tujuh langit dan bumi. Dia Maha Melihat dan Maha Mendengar mereka, betapa Allah Maha Melihat segala yang ada dan Maha Mendengar segala suara. Dia yang memiliki penciptaan dan urusan, tidak ada yang dapat menolak ketetapan-Nya, dan Dia tidak memiliki pembantu dan sekutu dalam ketetapan dan syariat-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. لَهُۥ غَيْبُ السَّمٰوٰتِ وَالْأَرْضِ ۖ (kepunyaan-Nya-lah semua yang tersembunyi di langit dan di bumi) Yakni yang tersembunyi dalam keduanya dan tentang kejadian-kejadian keduanya, tidak ada selain Allah yang ikut memiliki keduanya. أَبْصِرْ بِهِۦ وَأَسْمِعْ ۚ( Alangkah terang penglihatan-Nya dan alangkah tajam pendengaran-Nya) Ini merupakan kalimat takjub tentang ilmu-Nya mengenai segala hal yang dapat dilihat dan didengar. Sama bagi-Nya sesuatu yang ghaib dan yang nampak, yang tersembunyi dan yang terlihat, yang kecil dan yang besar. مَا لَهُم مِّن دُونِهِۦ مِن وَلِىٍّ(tak ada seorang pelindungpun bagi mereka selain dari pada-Nya) Kata ganti (هم) merujuk pada penghuni langit dan bumi. وَلَا يُشْرِكُ فِى حُكْمِهِۦٓ أَحَدًا (dan Dia tidak mengambil seorangpun menjadi sekutu-Nya dalam menetapkan keputusan) Allah melakukan dan melaksanakan apa yang Dia kehendaki, tidak ada seorangpun yang dimintai pendapat atau petuah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Katakanlah wahai Nabi: \"Allah lebih mengetahui berapa lama waktu mereka tinggal di gua, semua yang tersembunyi di langit dan di bumi hanya milik-Nya semata. Tidak ada yang lebih kuasa melihat dan mendengar kecuali Allah. Tidak ada satu pelindungpun bagi mereka selain Dia, dan Dia tidak mempunyai sekutu dalam menetapkan keputusan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Allah lebih mengetahui berapa lama mereka tinggal. MilikNya semua yang ghaib di langit dan di bumi. Alangkah terang penglihatanNya dan alangkah tajam pendengaranNya} Betapa Maha Melihat Allah terhaadadp segala yang ada dan Maha Mendengar terhadap setiap sesuatu yang didengar {Tidak ada pelindung pun bagi mereka selain Dia} selain Allah {dan Dia tidak mengambil seorang pun menjadi sekutu dalam keputusanNya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25-26. Tatkala Allah melarang Rasulullah meminta fatwa kepada ahli kitab tentang perkara Ashabul Kahfi karena mereka tidak memiliki ilmu tentang hal itu, sedangkan Allah adalah Dzat yang Maha Mengetahui hal yang ghaib maupun yang nyata dan Maha Mengetahui segala sesuatu, maka Allah memberitahukan kepada RasulNya tentang berapa lama mereka tinggal. Ilmu tentang hal itu hanyalah milik Allah, karena termasuk perkara yang tersembunyi di langit dan bumi. Keghaiban kejadian itu menjadi hak khususNya. Dan apa yang Allah beritakan melalui lisan RasulNya merupakan kebenaran yang diyakini yang tidak ada keraguan padanya. Dan berita yang tidak Allah beritahukan kepada para RasulNya, maka tidak ada seorang pun dari makhluk yang dapat mengetahuinya. Firman Allah, “Alangkah terang penglihatanNya dan alangkah tajam pendengaranNya,” kekaguman terhadap kesempurnaan pendengaran dan penglihatanNYa serta jangkauan keduanya terhadap seluruh obyek yang didengar dan obyek-obyek yang terlihat setelah Dia mengabarkan tentang ilmuNya yang meliputi segala sesuatu yang diketahui, kemudian Allah menyatakan keesaanNYa dalam penjagaan yang umum dan khusus. Dia-lah Pemelihara yang berwenang mengatur seluruh alam semesta dan Pemelihara bagi hamba-hambaNya yang beriman, mengeluarkan mereka dari kegelapan menuju cahaya, memberikan taufik bagi mereka menuju jalan yang mudah, dan menjauhkan mereka dari kesulitan. Oleh karena itu, Allah berfirman, “Tidak ada seorang pelindung pun bagi mereka selain dariNya.” Maksudnya, Dia-lah yang mengurus perkara Ashabul Kahfi dengan kelembutan dan kemuliaanNya, tidak menyerahkan urusan mereka kepada seorang pun dari kalangan makhlukNya. “Dan Dia tidak mengambil seorang pun menjadi sekutuNya dalam menetapkan keputusan.” Ini mencakup putusan takdir yang bersifat kauni dan syar’i. Sesungguhnya Allah adalah Pemutus keputusan di tengah makhlukNya baik dalam masalah keputusan, ketetapan takdir, penciptaan, dan pengaturan, dan Dzat yang menjadi hakim pada mereka dengan perintah dan llaranganNya, pahala dan hukumanNya. Tatkala Allah menceritakan bahwa bagiNya perkara-perkara yang tersembunyi di langit dan bumi, maka tidak ada cara bagi makhluk untuk mengetahuinya kecuali melalui berita yang Allah kabarkan kepada para hambaNya. Al-Quran telah menghimpun banyak sekali perkara ghaib. Allah memerintahkan supaya meresponnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 26: Allah Subhaanahu wa Ta'aala yang mengatur alam semesta, baik secara umum maupun khusus. Pengaturan-Nya yang bersifat umum adalah pengaturan-Nya terhadap alam semesta (dengan mencipta dan mengatur), sedangkan pengaturan-Nya yang bersifat khusus adalah pengaturan-Nya terhadap hamba-hamba-Nya yang beriman; Dia mengeluarkan mereka dari kegelapan kepada cahaya. Dia pula yang mengatur As-habul Kahfi dengan kelembutan dan kepemurahan-Nya, serta tidak menyerahkan mereka kepada salah seorang pun di antara makhluk-Nya. Keputusan atau hukum di sini mencakup keputusan-Nya di alam semesta, dan keputusan-Nya dalam syari’at. Dia yang memberikan keputusan terhadap makhluk-Nya baik secara qadari (terhadap alam semesta) maupun syar’i (dalam syari’at-Nya)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 26",
    "description": "Katakanlah kepada siapa yang tidak percaya atau membantah keterangan ini, Allah yang ilmu-Nya meliputi segala sesuatu lebih mengetahui berapa lamanya mereka tinggal di dalam gua; betapa tidak, sebab milik-Nya semua yang tersembunyi di langit dan di bumi, tidak ada sesuatu pun yang terluput dari pengetahuan-Nya. Alangkah terang penglihatan-Nya terhadap segala sesuatu dan alangkah tajam pendengaran-Nya terhadap suara; tidak ada seorang pelindung pun bagi mereka penduduk langit maupun bumi selain dia yang mahakuasa atas segala sesuatu; dan dia tidak mengambil seorang pun menjadi sekutu-Nya dalam menetapkan keputusan, sebab dia tidak membutuhkan siapa pun menjadi sekutu bagi-Nya. Sesudah selesai menceritakan kisah penguni gua, ayat ini kembali menyampaikan pesan-pesan yang disampaikan pada permulaan surah ini. Dan bacakanlah wahai nabi Muhammad apa yang diwahyukan Allah kepadamu, yaitu Al-Qur'an, kitab tuhanmu. Tidak ada siapa pun yang dapat mengubah kalimat-kalimat-Nya, yakni wahyu-Nya atau ketetapanketetapan-Nya. Dan ketahuilah engkau tidak akan dapat menemukan tempat berlindung selain kepada-Nya. Oleh karena itu, janganlah engkau lalai melaksanakan tuntunan tuhanmu."
  }
]