[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bacalah (wahai rasul), apa yang diwahyukan Allah kepadamu berupa al-qur’an karena sesungguhnya ia adalah kitab yang tidak ada yang dapat merubah kalimat-kalimatnya karena kebenaran dan keadilannya. Dan kamu tidak akan mendapatkan tempat untuk menyelamatkan diri dan tempat berlindung selain kepada tuhanmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27.\"Dan bacalah wahai Rasul, dan kerjakanlah apa yang diwahyukan kepadamu dari Al-Qur`ān. Tidak ada yang dapat mengubah kalimat-kalimat-Nya, karena semua kandungannya benar, jujur dan adil. Engkau tidak akan dapat menemukan tempat memohon pertolongan dan perlindungan selain kepada-Nya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Hai Rasulullah, bacalah al-Qur’an yang telah diwahyukan Tuhanmu kepadamu, sungguh ia adalah kitab yang tidak akan diubah kalimat-kalimatnya karena merupakan kalimat-kalimat yang benar dan adil dan ketika membacanya terdapat permohonan perlindungan kepada Allah, dan kamu tidak akan mendapatkan pelindung selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَاتْلُ مَآ أُوحِىَ إِلَيْكَ مِن كِتَابِ رَبِّكَ ۖ (Dan bacakanlah apa yang diwahyukan kepadamu, yaitu kitab Tuhanmu) Allah memerintahkan Rasulullah agar senantiasa membaca al-Qur’an. Pendapat lain mengatakan yang dimaksud adalah ikutilah apa yang kamu baca dalam al-Qur’an. لَا مُبَدِّلَ لِكَلِمٰتِهِۦ(Tidak ada (seorangpun) yang dapat merubah kalimat-kalimat-Nya) Yakni apa yang Allah kabarkan dan perintahkan tidak ada yang dapat mengubahnya. وَلَن تَجِدَ مِن دُونِهِۦ مُلْتَحَدًا(Dan kamu tidak akan dapat menemukan tempat berlindung selain dari pada-Nya) Yakni tempat berlindung yang dapat melindungimu dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Bacakanlah Alquran yang telah diwahyukan kepadamu, serta laksanakanlah perintah Alquran. Tidak ada seorangpun yang dapat merubah kalimat-kalimat-Nya. Dan kamu tidak akan dapat menemukan tempat berlindung selain Dia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bacakanlah} bacakanlah {apa yang diwahyukan kepadamu, yaitu kitab Tuhanmu. Tidak ada yang dapat mengubah kalimat-kalimatNya} tidak ada yang mengganti kalimat-kalimat Allah {dan kamu tidak akan dapat menemukan tempat berlindung} tempat berlindung yang kamu gunakan untuk berlindung {selain kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Kata ‘attilaawatu’ artinya mengikuti. Maksudnya, ikutilah apa yang Allah wahyukan kepadamu dengan mengetahui dan memahami maknanya, membenarkan berita-beritaNya, serta menaati perintah dan laranganNya. Sesungguhnya al-Quran adalah kitab yang agung, tidak ada seorang pun yang sanggup merubah kalimat-kalimatNya. Maksudnya, tidak bisa dirubah dan diganti karena aspek kebenarran dan keadilannya seta sisi keelokannya yang mengungguli setiap keindahan. \"Telah sempurnalah kalimat Tuhanmu (Al Qur'an, sebagai kalimat yang benar dan adil.\" (Al-An’am:115) Kesempurnaannya mustahil bisa dirubah atau diganti. Seandainya kalimat-kalimat tersebut memiliki cacat, niscaya akan terjadi padanya perubahan (secara keseluruhan) atau sebagian darinya. Hal ini merupakan pengagungan terhadap al-Quran, yang memuat dorongan agar menerimanya. “Dan kamu tidak akan dapat menemukan tempat berlindung selain dariNya.” Maksudnya kamu tidak akan mendapatkan tempat kembali dan tidak pula tempat meminta pertolongan selain kepada Allah. Apabila telah jelas bahwa hanya Allah semata tempat kembali dalam segala urusan , maka jelaslah bahwa Dia-lah yang berhak untuk disembah dan dicintai, baik dalam kondisi lapang maupun sempit, yang selalu dibutuhkan dalam segala keadaan dan yang diminta dalam segala tuntutan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 27: Oleh karena Allah Subhaanahu wa Ta'aala yang mengetahui hal gaib di langit dan di bumi, dan makhluk tidak mempunyai jalan untuk mengetahuinya kecuali dengan jalan yang telah diberitahukan-Nya kepada hamba-hamba-Nya. Al Qur’an itulah yang isinya banyak perkara gaib, maka Allah Subhaanahu wa Ta'aala memerintahkan untuk membacanya. Ada pula yang menafsikan dengan, “Ikutilah (Muhammad) apa yang diwahyukan kepadamu…dst.” Karena tilawah juga berarti ittiba’ (mengikuti). Tentunya dengan mengetahui maknanya dan memahaminya, membenarkan beritanya, mengikuti perintah dan menjauhi larangannya. Yakni karena kebenaran, keadilan dan keindahannya di atas semuanya. Oleh karena kesempurnaannya, maka mustahil dirubah. Dalam ayat ini terdapat ta’zhim (pengagungan) terhadap Al Qur’an, dan di dalamnya terdapat dorongan untuk mendatanginya. Oleh karena hanya kepada-Nya tempat perlindungan dalam semua urusan, maka jelas bahwa Dialah yang satu-satunya berhak diibadahi dan diharap di waktu lapang maupun sempit, dibutuhkan dalam setiap keadaan dan diminta dalam semua kebutuhan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 27",
    "description": "Sesudah selesai menceritakan kisah penguni gua, ayat ini kembali menyampaikan pesan-pesan yang disampaikan pada permulaan surah ini. Dan bacakanlah wahai nabi Muhammad apa yang diwahyukan Allah kepadamu, yaitu Al-Qur'an, kitab tuhanmu. Tidak ada siapa pun yang dapat mengubah kalimat-kalimat-Nya, yakni wahyu-Nya atau ketetapanketetapan-Nya. Dan ketahuilah engkau tidak akan dapat menemukan tempat berlindung selain kepada-Nya. Oleh karena itu, janganlah engkau lalai melaksanakan tuntunan tuhanmu. Dan bersabarlah engkau wahai nabi Muhammad bersama orang-orang yang beriman yang menyeru tuhannya pada pagi dan senja hari dengan berzikir dan berdoadengan mengharap keridaan-Nya, bukan karena mengharap kesenangan duniawi; dan janganlah kedua matamu berpaling dari mereka walaupun mereka miskin, lalu mengarah perhatianmu kepada orang-orang kafir karena mengharapkan perhiasan kehidupan dunia; dan janganlah engkau mengikuti orang yang hatinya telah kami lalaikan dari mengingat kami, sebab keengganannya mengikuti tuntunan yang kami wahyukan serta menuruti keinginannya yang teperdaya oleh kesenangan duniawi dan keadaannya yang demikian itu sudah melewati batas."
  }
]