[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bersabarlah dirimu (wahai nabi), bersama-sama dengan para sahabatmu dari orang-orang mukmin yang fakir yang beribadah kepada tuhan mereka semata dan menyeruNya di pagi hari dan sore hari, sedang mereka menginginkan wajah Allah dengan itu. dan duduklah bersama mereka dan pergauli mereka. Dan janganlah kamu palingkan pandanganmu dari mereka kepada orang lain dari kalangan orang-orang kafir untuk tujuan mencari kesenangan dengan perhiasan kehidupan duniawi. Dan janganlah kamu menaati orang yang telah Kami jadikan hatinya lalai dari mengingat Kami dan dia lebih mengutamakan keinginan hawa nafsunya ketimbang menaati penguasanya dan keadaannya dalam seluruh perbuatannya menjadi sia-sia dan binasa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Tetapkanlah dirimu untuk selalu bersama orang-orang yang menyeru Tuhannya di awal hari dan di penghujungnya dengan doa ibadah dan doa mas`alah (permohonan) secara ikhlas hanya mengharapkan keridaan-Nya. Janganlah kedua matamu berpaling dari mereka karena ingin duduk bersama orang-orang kaya dan memiliki kedudukan, dan jangan pula engkau mengikuti orang yang Kami lalaikan hatinya dari mengingat Kami, yang memerintahkan engkau untuk mengusir orang-orang miskin dari majelismu, dan hanya mengedepankan hawa nafsunya daripada ketaatan terhadap Rabbnya, dan sungguh amalannya hanyalah kesia-siaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Hai Rasulullah, bersabarlah ketika bersama para sahabatmu yang menyembah dan berdoa kepada Allah semata di waktu pagi dan petang karena mengharap keridhaan Allah; pedulilah kepada mereka dan kepada pertemuan dengan mereka, dan janganlah memalingkan pandanganku dari mereka menuju para pemuka orang-orang kafir karena kamu ingin duduk-duduk dengan mereka sebab mereka memiliki banyak kenikmatan dunia; dan janganlah kamu mentaati orang-orang yang lalai dari mengingat Allah dan mengikuti godaan setan. Sungguh urusan mereka dalam kerugian yang besar."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. وَاصْبِرْ نَفْسَكَ مَعَ الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَوٰةِ وَالْعَشِىِّ (Dan bersabarlah kamu bersama-sama dengan orang-orang yang menyeru Tuhannya di pagi dan senja hari) Yakni pada dua ujung siang. يُرِيدُونَ وَجْهَهُۥ ۖ( dengan mengharap keridhaan-Nya) Yakni mereka mengharapkan keridhaan Allah dengan ibadah mereka. وَلَا تَعْدُ عَيْنَاكَ عَنْهُمْ(dan janganlah kedua matamu berpaling dari mereka) Yakni janganlah kamu palingkan kedua matamu pada selain mereka yang memiliki harta dan perhiasan. Pendapat lain mengatakan maknanya adalah janganlah kedua matamu menyepelekan mereka. تُرِيدُ زِينَةَ الْحَيَوٰةِ الدُّنْيَا ۖ( mengharapkan perhiasan dunia ini) Yakni dengan duduk-duduk bersama pada pemilik derajat dan kekayaan. Atau ingin mendapatkan perhiasan. وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُۥ عَن ذِكْرِنَا(dan janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari mengingati Kami) Yakni Kami jadikan hatinya lalai dengan menguncinya; seperti orang-orang yang meminta Rasulullah untuk mengusir orang-orang miskin dari majlisnya. وَاتَّبَعَ هَوَىٰهُ (serta menuruti hawa nafsunya) Lebih memilih hawa nafsu daripada kebenaran sehingga memilih kesyirikan daripada mengesakan Allah. وَكَانَ أَمْرُهُۥ فُرُطًا (dan keadaannya itu melewati batas) Makna (الفرط) yakni lalai pada perintah Allah akibat kejahilannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Senantiasa bersahabat dengan orang-orang beriman, dan selalu terjaga dalam kasih sayang mereka, serta berusaha agar tidak menjauh dari mereka, adalah kebiasaan baik yang sangat membutuhkan kesabaran yang tinggi { وَٱصْبِرْ نَفْسَكَ مَعَ ٱلَّذِينَ يَدْعُونَ رَبَّهُم بِٱلْغَدَوٰةِ وَٱلْعَشِىِّ يُرِيدُونَ وَجْهَهُۥ ۖ } \"Dan bersabarlah kamu bersama-sama dengan orang-orang yang menyeru Tuhannya di pagi dan senja hari dengan mengharap keridhaan-Nya\". 2 ). { وَٱصْبِرْ نَفْسَكَ مَعَ ٱلَّذِينَ يَدْعُونَ رَبَّهُم } Sudahkah kita mentadabburi kepada siapa ayat ini ditujukan? dan bagaimana jika orang-orang yang diminta kepada kita untuk bersahabat dengan mereka adalah mereka yang lebih rendah kedudukannya! bahkan kita selalu dituntut agar menjauhi orang-orang tersebut agar menjaga citra dan kelangsungan kekayaan kita! sungguh ini adalah pelajaran yang sangat berharga bagaimana pentingnya bersahabat dengan orang-orang shalih, dan terus bersabar bersama mereka, dan bahwasanya dakwah hanya bisa ditegakkan oleh orang-orang yang dikuatkan pondasi mereka oleh tuhannya, sekalipun derajat mereka dalam kehidupan dunia sangat rendah! 3 ). Kelalaian adalah kebalikan dari ilmu, bahkan ilmu senantiasa menutupinya, dan sesungguhnya Allah telah mencela orang-orang yang senang kepada kelalaian, dan melarang menjadi bagian dari mereka, dan taat kepada mereka, serta menerima pendapat dari mereka, Allah berfirman : { وَلَا تَكُن مِّنَ ٱلْغَٰفِلِينَ } \"dan janganlah kamu termasuk orang-orang yang lalai\" [ al-A'raf : 205 ], dan Allah berfirman : { وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُۥ عَن ذِكْرِنَا } \"dan janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari mengingati Kami\". 4 ). { وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُۥ عَن ذِكْرِنَا وَٱتَّبَعَ هَوَىٰهُ } \"dan janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari mengingati Kami, serta menuruti hawa nafsunya\" Allah bahkan tidak mengatakan orang yang kami diamkan lisannya, tetapi Allah mengatakan : \" orang yang hatinya telah Kami lalaikan\" hal ini tidak diragukan lagi bahwa hati yang lalai dapat mengurangi kebaikan, dan dapat mengurangi pengaruh-pengaruh dzikir itu sendiri, seperti : kebajikan hati, dan kecenderungan hati kepada Allah, dan ketundukan hati kepada-Nya. 5 ). Tidak ada gunanya berteman dengan orang fasik yang terus menetap di atas kefasikannya, karena orang yang takut kepada Allah tidak akan bertahan di atas dosa-dosa besar, dan orang yang tidak takut kepada Allah tidak dapat dipercaya karena kerusakannya, tidak menjamin kebaikan persabahabatan dengannya, Allah telah berfirman : { وَلَا تُطِعْ مَنْ أَغْفَلْنَا قَلْبَهُۥ عَن ذِكْرِنَا وَٱتَّبَعَ هَوَىٰهُ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Bersabarlah kamu dan teguhlah bersama-sama orang-orang lemah yang menyeru Tuhannya di pagi dan senja hanya karena beribadah dan mengharap keridhaan-Nya. Janganlah palingkan kedua matamu kepada mereka yang mengharapkan perhiasan dunia ini. Janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari dzikir dan mengingat Alquran juga mengingat Kami, serta menuruti hawa nafsunya dan melewati batas. Ayat ini turun untuk kumpulan petinggi Qurays yang meminta Nabi untuk membersihkan majlis dan sahabatnya dari orang-orang miskin, agar mereka dibuatkan tempat dan perkumpulan khusus untuk mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bersabarlah} bertahanlah {bersama orang-orang yang menyeru Tuhan mereka pada pagi dan petang} permulaan siang dan akhir siang {mereka mengharap keridhaanNya. Janganlah kedua matamu berpaling dari mereka} janganlah matamu melewatkan mereka dan menuju selain mereka {karena mengharapkan perhiasan kehidupan dunia. Janganlah mengikuti orang yang hatinya telah Kami lalaikan} Kami menjadikan hatinya lalai {dari mengingat Kami serta menuruti hawa nafsunya dan urusannya melewati batas} akan binasa dan lenyap"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Allah memerintahkan NabiNya, Muhammad, sedangkan orang lain mengikutinya sebagai teladan dalam perintah dan larangan, supaya bersabar bersama orang-orang beriman, ahli ibadah yang selalu kembali kepada Allah. “Orang-orang yang menyeru Rabbnya di pagi dan senja hari,” yaitu pada permulaan pagi dan sore hari. Mereka menginginkan Wajah Allah dengan hal itu. Allah menyebutkan karrakter mereka dengan ibadah dan keikhlasan dalam melaksanakannya. Jadi, di dalamnya terdapat perintah supaya bersahabat dengan orang baik dan berusaha keras untuk berkumpul dengan mereka, sekalipun mereka itu orang-orang fakir. Karena berhubungan erat dengan mereka memberikan manfaat-manfaat yang tidak terhitung. “Dan janganlah kedua matamu berpaling dari mereka,” maksudnya pandanganmu jangalah melampaui mereka dan mengangkat penglihatanmu dari mereka “(karena) mengharapkan perhiasan kehidupan dunia ini,” sebab ia merupakan bahaya, tidak bermanfaat, penghancur kemaslahatan agama dan menjadikan hati bergantung dengan dunia. Akibatnya, pikiran dan angan-angan terfokuskan padanya. Kecintaan di hati terhadap akhirat sirna. Sesungguhnya perhiasan dunia begitu memikat orang yang melihatnya dan menyihir hati, sehingga hati itu lalai untuk mengingat Allah dan lebih menatap aneka kelezatan dan godaan syahwat. Waktunya pun sia-sia dan urusannya menjadi tidak karuan. Kemudian dia menjadi orang yang merugi dan menyesal selama-lamanya. Oleh karena itu, Allah berfirman, “Dan janganlah kamu mengikuti orang yang hatinya telah Kami lalaikan dari mengingat Kami.” Dia lalai mengingat Allah, maka Allah menghukumnya dengan menjadikannya lalai untuk mengingatNya, “serta menuruti hawa nafsunya,” maksudnya dia menjadi orang yang memperturutkan hawa nafsunya. Apa saja yang disukai oleh nafsunya, niscaya dia lakukan dan berusaha mendapatkannya sekalipun akan membinasakan dan merugikannya. Dia telah menjadikan hawa nafsunya sebagai tuhan, seperti Firman Allah, \"Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya, dan Allah membiarkannya sesat berdasarkan ilmu-Nya dan Allah telah mengunci mati pendengaran dan hatinya dan meletakkan tutupan atas penglihatannya? Maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat). Maka mengapa kamu tidak mengambil pelajaran?\" (Al-Jatsiyah:23). “Dan keadaannya itu,” maksudnya kemaslahatan agama dan duniawinya “melampaui batas,” maksudnya lenyap sia-sia lagi tidak terwujudkan. Allah melarang menaati orang seperti ini, karena ketaatan kepadanya akan mengajaknya untuk mengikutinya. Pasalnya, dia tidak menyeru kecuali kepada orang yang memiliki sifat sepertinya. Ayat ini menunjukkan bahwa orang yang seharusnya ditaati dan menjadi imam bagi orang-orang adalah orang yang hatinya penuh dengan kecintaan kepada Allah dan mencurahkannya pada lisannya, lalu dia tekun berdzikir kepada Allah, mengikuti semua keridhaanNya, lebih mendahulukannya daripada bisikan hawa nafsunya. Maka dengan itu, dia berhasil menjaga waktunya, kondisinya membaik dan tindak-tanduknya lurus, mengajak manusia kepada kenikmatan yang Allah berikan kepadanya, maka pantaslah dia diikuti dan dijadikan sebagai imam. Sabar yang disebutkan dalam ayat ini adalah bersabar dalam ketaatan kepada Allah yang mana ia merupakan jenis kesabaran yang paling tinggi. Kesempurnaan bentuk kesabaran ini, akan menyempurnakan jenis-jenis kesabaran lainnya. Dalam ayat ini terdapat kandungan mengenai disunnahkannya berdzikir, berdoa, dan beribadah pada dua penghujung siang, karena Allah memuji mereka atas perbuatan itu. Setiap perbuatan yang Allah memuji pelakunya, berarti menunjukkan bahwa Allah mencintai perbuatan itu. Dan jika Allah mencintainya, maka Dia memerintahkan dan menganjurkan orang untuk melakukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 28: Yakni tahanlah dirimu. Bukan mengharapkan perhiasan dunia. Mereka ini adalah para sahabat Rasulullah shallallahu 'alaihi wa sallam yang fakir. Dalam ayat ini terdapat perintah untuk bergaul dengan orang-orang yang baik meskipun mereka dianggap rendah oleh manusia atau keadaannya miskin. Karena hal itu berbahaya dan tidak bermanfaat serta memutuskan maslahat agama, di mana di dalamnya terdapat ketergantungan hati kepada dunia, sehingga pikiran dan perhatian tertuju kepadanya dan hilang dari hatinya cinta kepada akhirat. Yang demikian karena keindahan dunia sangat menakjubkan bagi orang yang memandangnya, mempengaruhi akalnya, sehingga membuat hati lalai dari mengingat Allah, dan akhirnya ia akan mendatangi kelezatan dunia dan mengikuti kesenangan hawa nafsunya, waktunya pun menjadi sia-sia dan keadaannya menjadi tidak terkendali, sehingga ia menjadi orang yang rugi dan menyesal selama-lamanya. Yakni dari Al Qur’an atau dari mengingat Allah. Hal itu karena ia lupa kepada Allah, maka Allah hukum dengan melalaikan hatinya dari mengingat-Nya. Meskipun di sana terdapat kerugian dan kebinasaan bagi dirinya. Yakni maslahat agama dan dunianya menjadi sia-sia. Orang yang seperti ini dilarang Allah untuk diituruti, karena menurutinya akan membuatnya terus mengikuti. Bahkan yang layak diikuti adalah orang yang hatinya penuh rasa cinta kepada Allah, mengikuti keridhaan-Nya, di mana ia mendahulukan keridhaan Allah di atas hawa nafsunya, sehingga ia dapat menjaga waktunya dan keadaannya pun menjadi baik, perbuatannya istiqamah serta mengajak manusia kepada nikmat yang dikaruniakan Allah itu kepadanya. Dalam ayat ini terdapat anjuran berdzikr, berdoa dan beribadah di penghujung siang (pagi dan petang), karena Allah memuji mereka karena perbuatan itu, dan setiap perbuatan yang dipuji Allah menunjukkan bahwa Allah mencintainya, dan jika perbuatan itu dicintai-Nya, maka berarti Dia memerintahkan dan mendorongnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 28",
    "description": "Dan bersabarlah engkau wahai nabi Muhammad bersama orang-orang yang beriman yang menyeru tuhannya pada pagi dan senja hari dengan berzikir dan berdoadengan mengharap keridaan-Nya, bukan karena mengharap kesenangan duniawi; dan janganlah kedua matamu berpaling dari mereka walaupun mereka miskin, lalu mengarah perhatianmu kepada orang-orang kafir karena mengharapkan perhiasan kehidupan dunia; dan janganlah engkau mengikuti orang yang hatinya telah kami lalaikan dari mengingat kami, sebab keengganannya mengikuti tuntunan yang kami wahyukan serta menuruti keinginannya yang teperdaya oleh kesenangan duniawi dan keadaannya yang demikian itu sudah melewati batas. Dan katakanlah wahai nabi Muhammad, kepada siapa saja bahwa kebenaran, yakni Al-Qur'an yang kusampaikan kepadamu itu datangnya dari tuhanmu; maka barangsiapa di antara kamu yang ingin beriman kepada wahyu yang kusampaikan hendaklah dia beriman, keuntungan dan manfaatnya akan kembali kepada diri mereka sendiri, dan barang siapa di antara kamu yang ingin kafir, menolak kebenaran itu, biarlah dia kafir, kerugian dan mudaratnya akan kembali kepada diri mereka sendiri. Allah menerangkan kerugian yang akan menimpa mereka dengan menyatakan, sesungguhnya kami telah menyediakan neraka bagi orang zalim, yakni mereka yang angkuh dan menolak kebenaran yang kusampaikan, yang gejolaknya mengepung mereka dari segala penjuru. Jika mereka meminta pertolongan dari panasnya api neraka itu, mereka akan diberi minum dengan air seperti cairan besi atau minyak yang keruh yang mendidih yang panasnya menghanguskan wajah bila didekatkan kepadanya. Itulah minuman yang paling buruk dan neraka tempat dihidangkan minuman itu adalah tempat istirahat yang paling jelek."
  }
]