[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan katakanlah kepada orang-orang yang lalai itu : “risalah yang aku bawa kepada kalian adalah kebenaran dari tuhan kalian. Maka barangsiapa diantara kalian yang mau mengimani dan mengamalkannya, maka segeralah dia melakukannya dan itu merupakan kebaikan bagi dirinya. Dan barangsiapa ingin mengingkari, segeralah dia melakukannya, karena dia tidaklah menzhalimi kecuali dirinya sendiri. Sesungguhnya Kami telah menyediakan bagi orang-orang kafir api yang sangat panas yang panas apinya meliputi mereka. Jika orang-orang kafir itu meminta tolong di dalam api neraka dengan meminta air minum lantaran rasa haus yang mencekik, maka akan disodorkan kepada mereka air yang seperti minyak sangat panas yang akan membakar wajah-wajah mereka. Amat buruk minuman yang tidak meyeka rasa haus mereka, bahkan menambah rasa kehausan mereka. Dan amat buruk neraka sebagai tempat tinggal dan beristirahat. Dalam ayat ini terkandung ancaman dan peringatan keras bagi orang yang berpaling dari kebenaran, dia tidak beriman kepada risalah Muhammad dan tidak mengamalkan tuntutannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Dan katakanlah -wahai Rasul- kepada mereka yang lalai dari mengingat Allah lantaran kelalaian hati mereka, \"Apa yang aku sampaikan kepada kalian adalah suatu kebenaran yang berasal dari Allah, bukan dariku, dan aku tidak akan memenuhi permintaan kalian agar mengusir orang-orang beriman. Barangsiapa di antara kalian yang hendak beriman dengan kebenaran ini, maka berimanlah, dan ganjaran pahalanya akan dimudahkan baginya. Sebaliknya, barangsiapa yang hendak kafir kepada kebenaran ini, maka hendaknya ia kafir, dan ia pasti akan merasakan pedihnya balasan siksa yang sudah menantinya.\" Sesungguhnya Kami telah menyediakan api Neraka yang besar bagi orang-orang yang menzalimi diri mereka sendiri dengan memilih kekafiran. Gejolaknya senantiasa akan mengepung mereka, sehingga tidak ada seorang pun di antara mereka yang bisa membebaskan diri darinya. Jika mereka meminta pertolongan berupa air lantaran dahsyatnya dahaga mereka, mereka akan diberi air seperti minyak kotor yang sangat panas, yang menghanguskan wajah mereka lantaran panasnya. Seburuk-buruk minuman adalah minuman yang diberikan kepada mereka. Mimunan itu sama sekali tidak menghilangkan dahaga, bahkan hanya menambahnya, dan tidak pula bisa memadamkan nyala api yang membakar kulit mereka. Dan sungguh betapa buruk tempat tinggal dan tempat istrahat yang mereka tinggali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Hai Nabi, katakanlah kepada mereka: “Yang aku datangkan adalah kebenaran dari Tuhan kalian; maka barangsiapa yang hendak mengimani dan mengikutinya, hendaklah dia melakukannya karena itu lebih baik baginya; dan barangsiapa yang hendak mengingkarinya, maka hendaklah dia melakukannya.” Secara dzahir, ini menunjukkan perintah bagi mereka, namun yang dimaksudkan adalah sebagai ancaman bagi mereka. Sungguh Kami telah menyediakan bagi orang-orang yang kafir kepada Allah neraka yang sangat panas yang pagarnya mengelilingi mereka; jika mereka meminta pertolongan dari kehausan, mereka akan diberi air yang sangat panas yang seperti minyak hitam yang dapat menghanguskan wajah. Itulah seburuk-buruk minuman yang diberikan kepada mereka, dan neraka Jahannam adalah seburuk-buruk tempat mereka. Syeikh as-Syinqithi berkata: “Secara zahir ayat ini dari sisi bahasa memberi pilihan antara kafir atau beriman; akan tetapi yang dimaksud dari ayat ini bukanlah pemberian pilihan, namun sebagai ancaman. Dan ancaman dengan ungkapan seperti ini merupakan salah satu dari cara pengungkapan dalam bahasa arab. Dan dalil bahwa yang dimaksud adalah ancaman yaitu lanjutan dari ayat ini: إِنَّآ أَعْتَدْنَا لِلظَّٰلِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا ۚ وَإِن يَسْتَغِيثُوا۟ يُغَاثُوا۟ بِمَآءٍ كَٱلْمُهْلِ يَشْوِى ٱلْوُجُوهَ ۚ بِئْسَ ٱلشَّرَابُ وَسَآءَتْ مُرْتَفَقًا “Sesungguhnya Kami telah sediakan bagi orang orang zalim itu neraka, yang gejolaknya mengepung mereka. Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek.” Ini merupakan bukti yang sangat jelas bahwa yang dimaksud adalah ancaman, sebab jika yang dimaksud adalah pemberian pilihan niscaya Allah tidak akan mengancam orang yang melakukan salah satu hal tersebut dengan azab yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. وَقُلِ (Dan katakanlah) Katakanlah kepada orang-orang yang lalai tersebut. الْحَقُّ مِن رَّبِّكُمْ ۖ( Kebenaran itu datangnya dari Tuhanmu) Dan tidak dari selain-Nya sehingga mungkin untuk diganti. Yakni aku tidak membawa kebenaran yang aku buat sendiri, namun aku mendatangkannya dari Allah. فَمَن شَآءَ فَلْيُؤْمِن وَمَن شَآءَ فَلْيَكْفُرْ ۚ( maka barangsiapa yang ingin (beriman) hendaklah ia beriman, dan barangsiapa yang ingin (kafir) biarlah ia kafir”) Yakni selama telah jelas kebenaran itu, maka orang yang kafir tidaklah disesatkan atau dizalimi melainkan oleh dirinya sendiri. إِنَّآ أَعْتَدْنَا لِلظّٰلِمِينَ(Sesungguhnya Kami telah sediakan bagi orang orang zalim itu) Yakni orang-orang yang lebih memilih kafir terhadap Allah dan ingkar terhadap para Nabi. نَارًا(neraka) Api neraka yang besar. أَحَاطَ بِهِمْ سُرَادِقُهَا ۚ( yang gejolaknya mengepung mereka) Makna (السرادق) yakni rumah yang terbuat dari kain. Dan ayat ini menyerupakan api yang mengepung orang-orang kafir dengan rumah kain yang mengelilingi penghuninya. وَإِن يَسْتَغِيثُوا۟( Dan jika mereka meminta minum) Akibat panasnya api neraka. يُغَاثُوا۟ بِمَآءٍ كَالْمُهْلِ(niscaya mereka akan diberi minum dengan air seperti besi yang mendidih) Makna (المهل) yakni segala logam yang dilelehkan dengan api seperti besi, timah, dan kuningan. Pendapat lain mengatakan maknanya adalah endapan minyak yang kotor. يَشْوِى الْوُجُوهَ ۚ( yang menghanguskan muka) Sebab minuman itu sangat panas. بِئْسَ الشَّرَابُ(Itulah minuman yang paling buruk) Seburuk-buruk minuman adalah minuman mereka ini. وَسَآءَتْ مُرْتَفَقًا(dan tempat istirahat yang paling jelek) Makna (المرتفق) yakni tempat yang dijadikan untuk beristirahat dan mencari ketenangan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Wahai Nabi katakanlah kepada orang musyrik yang meminta engkau untuk mengusir orang-orang miskin dari majlismu: \"Kebenaran dalam Alquran itu datangnya dari Allah, bukan dari hawa nafsu ataupun manusia. Termasuk adanya penggantian (nasakh mansukh) itu juga dari Allah. Maka barangsiapa yang ingin beriman kepada Islam dan Alquran hendaklah ia beriman, dan itu adalah suatu kebenaran dan kebaikan. Barangsiapa yang ingin kafir atas agama ini silakan ia kafir\". Ini adalah ancaman dan janji untuk mereka Sesungguhnya Kami telah sediakan neraka yang besar bagi orang orang zalim itu, yang gejolaknya mengepung mereka. Dan jika mereka meminta minum, niscaya mereka akan diberi minum dengan air seperti besi yang mendidih yang menghanguskan muka. Itulah minuman yang paling buruk dan tempat istirahat yang paling jelek"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Kebenaran itu} kebenaran yang datang kepada kalian {dari Tuhan kalian. Maka siapa saja yang menghendaki, hendaklah dia beriman dan siapa yang menghendaki, maka biarlah dia ingkar” Sesungguhnya Kami telah menyediakan} Kami menyediakan dan menyiapkan {neraka bagi orang-orang zalim yang gejolaknya} gejolaknya {mengepung mereka. Jika mereka meminta pertolongan} meminta bantuan dari kehausan {mereka akan diberi air seperti (cairan) besi mendidih} seperti cairan minyak {yang menghanguskan wajah. seburuk-buruk minuman dan tempat istirahat yang paling jelek} neraka itu seburuk-buruk tempat tinggal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. Maksudnya, “Katakanlah,” wahai Muhammad kepada umat manusia, bahwa “kebenaran itu datangnya dari Rabbmu,” maksudnya sungguh telah menjadi jelas antara petunjuk dengan kebatilan, kebenaran dengan kesesatan, sifat-sifat orang-orang yang berbahagia dengan sifat-sifat orang-orang yang sengsara. Demikian itu berdasarkan hasil penjelasan Allah melalui lisan RasulNya. Apabila telah jelas, Nampak, dan tidak ada kesamaran padanya “maka barangsiapa yang ingin (beriman), hendaklah dia beriman, dan barangsiapa yang ingin (kafir), biarlah dia kafir,” maksudnya tidak ada pilihan kecuali menempuh salah satu dari dua jalan sesuai dengan adanya taufik bagi seorang hamba atau tidaknya. Allah telah memberinya kehendak untuk memilih antara keimanan atau kekufuran, kebaikan dan keburukan. Barangsiapa beriman, maka sungguh dia telah diberi taufik menuju kebenaran, dan barangsiapa yang kafir, maka sungguh hujjah telah tegak atasnya, tidak ada yang memaksanya untuk beriman. Sebagaimana Firman Allah, \"Tidak ada paksaan untuk (memasuki) agama (Islam); sesungguhnya telah jelas jalan yang benar daripada jalan yang sesat.\" (Al-Baqarah:256). (Bukan berarti dalam Firman Alllah, “Maka barangsiapa yang ingin (beriman) hendaklah dia beriman, dan barangsiapa yang ingin (kafir), biarlah dia kafir,” mengandung pengertian dibolehkannya dua perbuatan tersebut. Akan tetapi, hal itu merupakan peringatan dan ancaman bagi orang yang memilih kekafiran setelah adanya penjelasan yang sempurna. Sebagaimana ayat itu memuat pengertian untuk membiarkan orang-orang yang kafir tanpa diperangi). Kemudian Allah menyebutkan tempat kembali dua golongan itu. Allah berfirman, “Sesungguhnya Kami telah sediakan bagi orang-orang yang zhalim itu,” karena kukufuran, kefasikan , dan kemaksiatan mereka “neraka yang gejolaknya mengepung mereka,” maksudnya pagar-pagarnya mengelilingi mereka, maka tidak ada celah keluar dan jalan untuk melarikan diri meninggalkannya. Api neraka membakar mereka. “Dan jika mereka meminta minum,” maksudnya meminta minum untuk melenyapkan rasa haus yang mencekik “niscaya mereka akan diberi minum dengan air seperti besi yang mendidih,” maksudnya seperti timah yang mencair atau seperti kerak minyak karena sangat panas “yang menghanguskan muka.” Maka bagaimana (jadinya) dengan usus-usus dan perut-perut mereka?! Sebagaimana Firman Allah, \"Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka). Dan untuk mereka cambuk-cambuk dari besi.\" (Al-Hajj:20-21). “Itulah minuman yang paling buruk,” yang ditujukan untuk menghilangkan rasa dahaga dan menolak sebagian azab, namun malah menjadi penambah siksa mereka dan kedahsyatan hukuman mereka. “Dan yang paling jelek,” maksudnya, neraka itu (adalah tempat yang paling jelek sebagai) “tempat istirahat.” Ini merupakan celaan tentang keadaan neraka, bahwasanya neraka merupakan seburuk-buruk tempat yang digunakan sebagai tempat beristirahat, karena tidak ada tempat nyaman di dalamnya. Akan tetapi, di dalamnya adalah siksa yang besar dan berat, yang tidak berhenti barang sesaat pun dari mereka. Mereka berduka cita di dalamnya, berputus asa dari segala kebaikan. Allah Yang Maha Pengasih telah melupakan (tidak mempedulikan) mereka berada dalam siksa sebagaimana mereka telah melupakanNya (di dunia)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 29: Yakni telah jelas mana petunjuk dan mana kesesatan. Yang demikian karena Allah telah menerangkannya melalui lisan rasul-Nya. Ketika kebenaran telah jelas dan tidak ada lagi syubhat, maka barang siapa yang ingin beriman, hendaknya ia beriman, dan barang siapa yang menghendaki kafir, maka telah tegak hujjah baginya karena telah jelas yang benar, dan ia tidak dipaksa beriman. Kalimat ini sebagai ancaman bagi mereka, dan bukan berarti tidak diperanginya orang-orang yang kafir. Namun perlu diketahui dan diingat. Yakni yang menzalimi dirinya dengan kufur, kefasikan dan kemaksiatan. Tidak ada lagi jalan keluar bagi mereka untuk meloloskan diri. Lalu bagaimana dengan perut dan usus mereka. Allah Subhaanahu wa Ta'aala berfirman, “Dengan air itu dihancur luluhkan segala apa yang ada dalam perut mereka dan juga kulit (mereka).-- Dan (azab) untuk mereka cambuk-cambuk dari besi.” (Terj. Al Hajj: 20-21) wal ‘iyaadz billah. Karena tidak menghilangkan dahaga dan tidak meringankan siksa, bahkan menambah azab di atas azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 29",
    "description": "Dan katakanlah wahai nabi Muhammad, kepada siapa saja bahwa kebenaran, yakni Al-Qur'an yang kusampaikan kepadamu itu datangnya dari tuhanmu; maka barangsiapa di antara kamu yang ingin beriman kepada wahyu yang kusampaikan hendaklah dia beriman, keuntungan dan manfaatnya akan kembali kepada diri mereka sendiri, dan barang siapa di antara kamu yang ingin kafir, menolak kebenaran itu, biarlah dia kafir, kerugian dan mudaratnya akan kembali kepada diri mereka sendiri. Allah menerangkan kerugian yang akan menimpa mereka dengan menyatakan, sesungguhnya kami telah menyediakan neraka bagi orang zalim, yakni mereka yang angkuh dan menolak kebenaran yang kusampaikan, yang gejolaknya mengepung mereka dari segala penjuru. Jika mereka meminta pertolongan dari panasnya api neraka itu, mereka akan diberi minum dengan air seperti cairan besi atau minyak yang keruh yang mendidih yang panasnya menghanguskan wajah bila didekatkan kepadanya. Itulah minuman yang paling buruk dan neraka tempat dihidangkan minuman itu adalah tempat istirahat yang paling jelek. Sesungguhnya mereka yang beriman kepada Allah dan rasul-Nya dan membuktikan keimanannya dengan mengerjakan kebajikan sesuai tuntunan kami. Kepada mereka kami memberikan pahala yang besar. Kami benar-benar tidak akan menyia-nyiakan pahala orang yang mengerjakan perbuatan yang baik itu."
  }
]