[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang beriman kepada Allah dan rasulNya dan mengerajakan amal shalih, bagi mereka balasan baik yang paling besar. Sesungguhnya Kami tidak menyia-nyiakan pahala-pahala mereka, dan tidak pula menguranginya atas kebajikan yang mereka perbuat sebaik-baiknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. \"Sesungguhnya orang-orang yang beriman kepada Allah dan beramal saleh, mereka benar-benar telah berbuat kebajikan, maka bagi mereka pahala yang besar, sebab Kami tidak menyia-nyiakan pahala orang yang mengerjakan kebajikan, namun Kami akan memberikan pahala mereka secara sempurna, tidak akan berkurang sedikitpun.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-31. Orang-orang beriman yang mengerjakan amal-amal shalih tidak akan Kami sia-siakan pahala amalan mereka tersebut. Mereka adalah orang-orang yang meraih derajat yang tinggi yang akan mendapatkan surga-surga yang mereka tinggali selamanya, di dalamnya terdapat sungai-sungai yang mengalir di bawah istana-istana mereka; mereka akan berhias di dalam surga dengan gelang-gelang emas dan memakai pakaian hijau dari sutra yang tipis dan tebal; mereka akan duduk di atas dipan-dipan dan bersandar bantal-bantal. Sungguh sebaik-baik balasan adalah surga dan kenikmatannya, dan surga adalah sebaik-baik tempat tinggal bagi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Begitu banyak yang menyangka bahwa Allah mengatakan : “Sesungguhnya kami tidak menyia-nyiakan balasan untuk manusia” tapi Allah mengatakan : { إِنَّا لَا نُضِيعُ أَجْرَ مَنْ أَحْسَنَ عَمَلًا } “tentulah Kami tidak akan menyia-nyiakan pahala orang-orang yang mengerjakan amalan(nya) dengan yang baik.” Karena yang mereka kerjakan adalah kebaikan, dan tidaklah balasan bagi untuk kebaikan adalah kebaikan pula?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Sesunggunya mereka yang beriman kepada Allah dan beramal shalih, tentulah Kami tidak akan menyia-nyiakan pahala orang-orang yang mengerjakan amalannya dengan yang baik"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang beriman dan beramal shalih, Kami benar-benar tidak akan menyia-nyiakan pahala orang yang baik perbuatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Kemudian Allah menyebut golongan yang kedua seraya berfirman, “SEsungguhnya mereka yang beriman dan beramal shalih,” maksudnya, mereka yang menggabungkan antara keimanan kepada Allah, malaikat-malaikatNya, kitab-kitabNya, rasul-rasulNYa, Hari Akhir dan takdir baik dan buruk dengan amal shalih, dari yang wajib mauoun yang mustahab, “tentulah Kami tidak akan menyia-nyiakan pahala orang-orang yang mengerjakan amalan (nya) dengan baik,” amalan yang baik maksudnya apabila seorang hamba menginginkan dengan amalannya itu Wajah Allah dan mengikuti syariat Allah, maka amalan inilah yang tidak akan disia-siakan Allah dan (juga tidak) sedikit pun (tersia-siakan). Bahkan, Allah menjaganya untuk orang-orang yang mengamalkannya dan memberikan balasan yang sempurna dengan pahala sesuai dengan amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 30: Kemudian Allah menyebutkan kelompok yang kedua. Kepada rukun iman yang enam. Yang wajib maupun yang sunat. Yakni orang yang mengerjakannya karena mencari keridhaan Allah dan sesuai sunnah Rasul-Nya. Amal orang yang seperti ini tidak akan disia-siakan Allah, bahkan Allah akan menjaganya dan akan membalasnya dengan penuh sesuai amal mereka, sesuai karunia Allah dan ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 30",
    "description": "Sesungguhnya mereka yang beriman kepada Allah dan rasul-Nya dan membuktikan keimanannya dengan mengerjakan kebajikan sesuai tuntunan kami. Kepada mereka kami memberikan pahala yang besar. Kami benar-benar tidak akan menyia-nyiakan pahala orang yang mengerjakan perbuatan yang baik itu. Mereka itulah orang-orang yang tinggi kedudukannya yang memperoleh surga 'adn, yang mengalir di antara pepohonan yang tumbuh di bawahnya sungai-sungai; di dalam surga itu mereka dihiasi dengan gelang yang terbuat dari emas dan mereka memakai pakaian berwarna hijau yang terbuat dari sutera halus dan sutera tebal, sedang mereka di dalam menikmati keindahan itu duduk sambil bersandar di atas dipan-dipan yang diberi bantal dan tirai yang indah. Itulah sebaik-baik pahala dan tempat istirahat yang indah yang memberikan manfaat dan kebahagiaan yang sebesar-besarnya."
  }
]