[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka yang beriman itu, bagi mereka surga-surga yang akan mereka diami selamanya, mengalir sungai-sungai air tawar di bawah kamar-kamar dan hunian-hunian mereka. Di dalam surga, mereka di hiasi gelang-gelang dari emas, dan mereka mengenakan pakaian-pakaian berwarna hijau yang di sulam dari sutra halus dan sutra tebal. Di dalamnya mereka duduk-duduk bersandar di atas dipan-dipan yang terhiasi oleh kelambu-kelambu yang indah. sebaik-baik pahala adalah pahala yang mereka raih dan amat baik surga menjadi hunian dan tempat tinggal bagi mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Mereka yang disifati sebagai orang yang beriman dan beramal saleh tersebut akan mendapatkan surga-surga, mereka akan tinggal di dalamnya selama-lamanya. Di bawah tempat tinggal mereka akan mengalir sungai-sungai Surga yang segar, mereka akan memakai perhiasan berupa gelang emas, memakai pakaian serba hijau yang terbuat dari sutra yang halus dan yang kasar. Mereka duduk sambil bersandar di atas dipan-dipan yang dihiasi dengan tirai-tirai yang indah. Sungguh ganjaran pahala yang paling baik adalah pahala mereka, dan betapa baik Surga yang jadi tempat mereka tinggal dan menetap di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. أُو۟لٰٓئِكَ لَهُمْ جَنّٰتُ عَدْنٍ (Mereka itulah (orang-orang yang) bagi mereka surga ‘Adn) Makna (العدن) yakni bermukim. Yakni mereka tinggal di dalam surga selamanya. تَجْرِى مِن تَحْتِهِمُ الْأَنْهٰرُ(mengalir sungai-sungai di bawahnya) Yakni di bawah kamar-kamar dan pepohonannya. يُحَلَّوْنَ فِيهَا مِنْ أَسَاوِرَ مِن ذَهَبٍ(dalam surga itu mereka dihiasi dengan gelang emas) Makna (السوار) yakni perhiasan yang dipakai di pergelangan tangan yang biasa dipakai oleh para raja di dunia. Kelak perhiasan ini akan dipakai oleh kaum laki-laki dan perempuan di surga. وَيَلْبَسُونَ ثِيَابًا خُضْرًا مِّن سُندُسٍ وَإِسْتَبْرَقٍ(dan mereka memakai pakaian hijau dari sutera halus dan sutera tebal) Makna (السندس) yakni kain sutra tipis. Dan makna (الإستبرق) adalah kain sutra tebal, atau yang disebut dengan (الديباج). Digunakannya warna hijau karena warna ini merupakan warna yang terbaik dan sesuai bagi penglihatan. مُّتَّكِـِٔينَ فِيهَا عَلَى الْأَرَآئِكِ ۚ( sedang mereka duduk sambil bersandar di atas dipan-dipan yang indah) Yakni dipan-dipan yang memiliki bantal-bantal. نِعْمَ الثَّوَابُ(Itulah pahala yang sebaik-baiknya) Yakni sebaik-baik pahala yang Allah berikan kepada mereka. وَحَسُنَتْ (dan sebaik-baik) Yakni dipan-dipan tersebut. مُرْتَفَقًا (tempat istirahat) Sebaik-baik tempat untuk bersandar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Mereka itulah orang-orang yang diberi balasan surga ´Adn, mengalir sungai-sungai di bawahnya. Dalam surga itu mereka dihiasi dengan gelang mas dan mereka memakai pakaian hijau dari sutera halus dan sutera tebal, sedang mereka duduk sambil bersandar di atas dipan-dipan yang indah. Itulah pahala yang sebaik-baiknya, dan tempat istirahat yang indah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itulah yang memperoleh surga ‘Adn} yang menetap {yang mengalir di bawahnya sungai-sungai. Mereka diberi hiasan} mereka dihiasi {di dalamnya dengan gelang emas dan mereka memakai pakaian hijau dari sutra halus dan sutra tebal} sutra tebal dan lebat {Mereka duduk-duduk sambil bersandar di atas dipan-dipan yang indah} dipan-dipan yang dihiasi dengan tabir yang indah {(Itulah) sebaik-baik pahala dan tempat istirahat yang indah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Allah menyebutkan pahala mereka dengan berfirman, “Mereka itulah orang-orang yang mendapatkan Surga ‘And, mengalir sungai-sungai di bawahnya, dalam surge itu mereka dihiasi dengan gelang emas, dan mereka memakai pakaian hijau dari sutra halus dan sutra tebal, sedang mereka tidak duduk sambil bersandar di atas dipan-dipan yang indah,” [merekalah] maksudnya mereka yang berkarakter dengan keimanan dan amal shalih mendapatkan surge-surga yang tinggi yang pepohonannya sungguh banyak, hingga menutupi orang yang berada di dalamnya, sungai-sungainya pun banyak, mengalir di bawah pepohonan yang elok dan tempat-tempat kediaman yang tinggi, perhiasan mereka di dalamnya terbuat dari emas, pakaian mereka terbuat dari sutra hijau dari jenis sutra sundus yaitu sutra yang halus dan istibraq yaitu sutra yang tebal. Mereka dalam keadaan bersandar di atas dipan-dipan yang indah, yaitu ranjang-ranjang yang dihiasi lagi diperindah dengan aksesoris yang mewah. Karena tidaklah ia dinamakan arikah (ranjang-ranjang mewah) sehingga (harus) menjadi seperti itu. Cara duduk mereka yang menyandar di atas dipan-dipan yang indah itu menunjukkan bentuk istirahat yang sempurna, hilangnya rasa capai dan kelelahan, disertai mobilitas pelayan untuk menyuguhkan sesuatu yang mereka inginkan. Sebagai penyempurna kenikmatan itu, kekekalan yang lestari dan masa menetap yang abadi, maka kampung yang mulia ini, “Adalah pahala yang sebaik-baiknya,” untuk orang-orang yang beramal “dan tempat istirahat yang indah.” Mereka merasa nyaman di dalamnya dan bersenang-senang dengan apa yang disukai oleh jiwa, membuat sejuk pandangan mata, berupa kegembiraan, kesenangan, dan kebahagiaan yang abadi, kelezatan yang berturut-turut dan kenikmatan yang melimpah. Tempat istirahat mana yang lebih bagus daripada kampung ini? Serendah-rendah tingkatan penghuninya, dia (bisa) berjalan di kerajaannya, kenikmatan, istana-istana dan kebun-kebun selama waktu dua ribu tahun. Sementara itu, dia tidak merasa melihat kenikmatan yang telah dia peroleh. Semua angan-angan dan kebutuhannya telah diberikan kepadanya. Ditambah lagi dengan kenikmatan yang tak terjangkau oleh angan-angan mereka. Bersama dengan semua itu, kenikmatan mereka tetap abadi, terus bertambah sifat-sifat dan keindahannya. Kita memohon kepada Allah agar Dia tidak mengaharamkan kita dari kebaikan apa saja yang ada di sisiNya, disebabkan keburukan yang ada pada kita berupa kelalaian dan kemaksiatan. Ayat ini dan ayat semisalnya menunjukkan bahwa perhiasan itu umum bagi laki-laki dan wanita, sebagaimana terdapat dalam hadits-hadits shahih, karena Allah menyebutkannya dalam bentuk umum dalam FirmanNya, “mereka dihiasi” begitu pula sutra dan yang sepertinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 31: Baik laki-lakinya maupun wanitanya. Hal ini menunjukkan sempurnanya peristirahatan mereka, dan telah hilang rasa lelah dari mereka, karena mereka telah bermujahadah (berkorban) di jalan Allah ketika di dunia dengan kemampuannya. Di samping itu, mereka dilayani oleh para pelayan untuk membawakan apa yang mereka inginkan. Kita memohon kepada Allah agar Dia memasukkan kita ke dalamnya meskipun amal kita begitu sedikit, Allahumma amin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 31",
    "description": "Mereka itulah orang-orang yang tinggi kedudukannya yang memperoleh surga 'adn, yang mengalir di antara pepohonan yang tumbuh di bawahnya sungai-sungai; di dalam surga itu mereka dihiasi dengan gelang yang terbuat dari emas dan mereka memakai pakaian berwarna hijau yang terbuat dari sutera halus dan sutera tebal, sedang mereka di dalam menikmati keindahan itu duduk sambil bersandar di atas dipan-dipan yang diberi bantal dan tirai yang indah. Itulah sebaik-baik pahala dan tempat istirahat yang indah yang memberikan manfaat dan kebahagiaan yang sebesar-besarnya. Dan berikanlah wahai nabi Muhammad kepada mereka, yakni orangorang musyrik yang teperdaya oleh kesenangan dunia sebuah perumpamaan yang menggambarkan dua orang laki-laki; seorang dari keduanya beriman kepada tuhan dan seorang lagi tidak; kami jadikan bagi seorang di antara keduanya, yakni kepada orang yang tidak beriman dua buah kebun anggur dan kami kelilingi kedua kebun itu dengan pohon-pohon kurma dan di antara kedua kebun itu kami buatkan ladang yang subur."
  }
]