[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan buatlah (wahai rasul) perumpamaan bagi orang-orang kafir dari kaummu; dua lelaki dari umat terdahulu yang salah satunya mukmin, yang kedua kafir, dan kami telah adakan bagi orang yang kafir dua bidang kebun dari tanaman anggur dan kami pagari dua kebun itu dengan pohon kurma yang banyak, dan di tengah kebun itu kami tumbuhkan berbagai macam tanaman yang bermanfaat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Dan berikanlah kepada mereka -wahai Rasul- suatu perumpamaan berupa dua orang; seorang kafir dan mukmin. Orang kafir tersebut Kami beri dua kebun, Kami kelilingi keduanya dengan pohon-pohon kurma. Dan di antara lahan-lahan kosong dalam kebun itu Kami buatkan ladang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32-33. Hai Rasulullah, jelaskanlah perumpamaan orang-orang kafir yang angkuh terhadap orang-orang beriman yang lemah yang seperti dua orang; orang kafir dan orang beriman. Orang yang kafir memiliki dua kebun anggur yang Kami kelilingi dengan pohon-pohon kurma dan diantara dua kebun itu Kami ciptakan berbagai macam tanaman. Setiap kebun itu menghasilkan buah yang melimpah dan buahnya tidak pernah berkurang sedikitpun. Dan di antara dua kebun itu Kami alirkan sungai air tawar untuk mengairinya selalu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. وَاضْرِبْ لَهُم مَّثَلًا (Dan berikanlah kepada mereka sebuah perumpamaan) Bagi orang-orang yang merasa mulia dengan kenikmatan dunia, dan enggan untuk berinteraksi dengan orang-orang miskin. رَّجُلَيْنِ(dua orang laki-laki) Orang mukmin dan orang kafir. Terdapat pendapat mengatakan dua orang tersebut adalah dua orang bersaudara dari golongan Bani Israil. Pendapat lain mengatakan keduanya bersaudara dari suku Makhzum, bagian dari penduduk Makkah. جَعَلْنَا لِأَحَدِهِمَا(Kami jadikan bagi seorang di antara keduanya) Yakni bagi orang yang kafir. جَنَّتَيْنِ مِنْ أَعْنٰبٍ(dua buah kebun anggur) Yakni anggur dengan berbagai macam jenis. وَحَفَفْنٰهُمَا بِنَخْلٍ(dan kami kelilingi kedua kebun itu dengan pohon-pohon korma) Yakni Kami jadikan pohon kurma mengelilingi dua kebun itu dari segala penjuru. وَجَعَلْنَا بَيْنَهُمَا زَرْعًا(dan di antara keduanya Kami buatkan ladang) Yakni diantara kebun tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dalam surah al-Kahfi Allah memberkan sebuah perumpamaan dua orang laki-laki yang salah satu dari keduanya memiliki dua kebun, ia sombong dengan hasil kebun yang dimilikinya, dan hasil dari kesombongannya itu adalah kerugian yang besar, ajaibnya : bahwasanya kisah ini datang setelah firman Allah yang memerintahkan kepada Nabi-Nya agar bersabar bersama orang-orang mukmin yang lemah, sebagai penyelisihan terhadap pembesar-pembesar quraisy, yang mereka menyombongkan diri kepada orang-orang lemah, dan akibat dari perbuatan mereka adalah kerugian yang besar, sebagaiman yang dialami oleh pemilik dua kebun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Berikanlah sebuah perumpamaan kepada mereka orang musyrik berupa dua orang laki-laki yang mukmin dan kafir. Satu orang kafir namun kaya raya, dan satu lagi miskin namun beriman. Kami jadikan bagi yang kafir dua buah kebun anggur dan kami kelilingi kedua kebun itu dengan pohon-pohon kurma dan di antara kedua kebun itu Kami buatkan ladang. Dikatakan bahwa cerita ini adalah kisah dua bersaudara Bani Israil. Mereka mendapat warisan 4000 dinar. Satu dibuat untuk kebun dan ladang, sedangkan satu lagi digunakan untuk ketaatan kepada Allah hingga menjadi miskin. Kemudian keduanya bertemu sehingga yang kaya mencela yang miskin. Terjadilah percakapan antara keduanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berikanlah kepada mereka sebuah perumpamaan, yaitu dua orang laki-laki. Kami memberikan kepada salah satunya dua kebun} dua kebun {anggur. Kami mengelilingi kedua kebun itu} meliputi keduanya {dengan pohon-pohon kurma dan Kami membuatkan di antara keduanya ladang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah berfirman kepada NabiNya, “Berikanlah perumpamaan dua orang laki-laki ini kepada umat manusia. Yaitu, orang yang mensyukuri nikmat Allah dan yang mengkufurinya serta segala sesuatu yang mereka perbuat dan katakan, peristiwa-peristiwa yang terjadi karenanya, berupa hukuman langsung dan tunda (hukuman dunia dan akhirat) serta pahala, supaya mereka dapat mengambil pelajaran tentang kondisi keduanya dan mengambil hikmah dengan apa yang terjadi pada mereka. Tidaklah pengetahuan tentang personal dua orang laki-laki itu, masa, dan tempat mereka mengandung faidah atau suatu hasil tertentu. Karena, intisari manfaat tergapai hanya dengan kisah dua orang tersebut saja. Mencari tahu tentang keterangan selain dari itu (hanya) merupakan sikap memaksakan diri. Salah satu di antara dua orang laki-laki ini, yang mengingkari nikmat Allah, maka Allah menjadikan dua kebun untuknya. Yaitu dua kebun indah “dari kebun anggur, dan Kami kelilingi kedua kebun itu dengan pohon-pohon kurma,” maksudnya dalam dua kebun ini terdapat segala jenis pepohonan, khususnya pohon yang paling bagus yaitu, anggur dan kurma. Pohon anggur berada di tengah-tengahnya, sedangkan pohon kurma meliputi dan mengelilinginya. Maka, muncullah pemandangan yang indah nan memikat, dan tampak secara nyata bahwa pepohonan dan pohon kurma tersebut (mendapatkan) sinar matahari dan angina yang akan menyempurnakan buah-buahan dan menjadikannya matang. Bersama itu pula, Allah menjadikan tanaman-tanaman di antara pepohonan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 32: Yaitu kepada orang-orang mukmin dan orang-orang kafir agar mereka mengambil pelajaran darinya. Yaitu yang satu mukmin dan yang lain kafir, serta ucapan dan perbuatan yang timbul dari diri mereka masing-masing yang nampak sekali berbeda. Yang berada di tengah-tengah tanah miliknya. Sedangkan sekelilingnya pohon-pohon kurma."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 32",
    "description": "Dan berikanlah wahai nabi Muhammad kepada mereka, yakni orangorang musyrik yang teperdaya oleh kesenangan dunia sebuah perumpamaan yang menggambarkan dua orang laki-laki; seorang dari keduanya beriman kepada tuhan dan seorang lagi tidak; kami jadikan bagi seorang di antara keduanya, yakni kepada orang yang tidak beriman dua buah kebun anggur dan kami kelilingi kedua kebun itu dengan pohon-pohon kurma dan di antara kedua kebun itu kami buatkan ladang yang subur. Kedua kebun itu menghasilkan buahnya yang banyak, dan ia tidak menzalimi pemiliknya sedikit pun, tidak pernah berkurang buahnya sepanjang masa dan kami mengalirkan sungai di celah-celah keduanya untuk menambah keindahannya."
  }
]