[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masing-masing dua kebun itu telah mendatangkan hasil buahnya dan tidak berkurang buahnya sedikitpun. Dan kamipun telah membelah anatara dua kebun itu dengan sebuah aliran sungai untuk menyirami dua kebun itu dengan mudah dan ringan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Kedua kebun itu lalu menghasilkan buah kurma, anggur, dan buah lainnya. Buahnya tidak berkurang sedikitpun, bahkan buahnya ada secara sempurna. Di antara kedua kebun itu Kami alirkan sungai agar mengairi keduanya dengan mudah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. كِلْتَا الْجَنَّتَيْنِ ءَاتَتْ أُكُلَهَا (Kedua buah kebun itu menghasilkan buahnya) Yakni buah yang dihasilkan dua kebun itu. وَلَمْ تَظْلِم مِّنْهُ شَيْـًٔا ۚ(dan kebun itu tiada kurang buahnya sedikitpun) Yakni buahnya tidak berkurang sedikitpun, tidak sebagaimana yang biasa terjadi pada kebun-kebun lainnya yang sebagian pohon berbuah lebat dan sebagian lainnya hanya berbuah sedikit. وَفَجَّرْنَا خِلٰلَهُمَا نَهَرًا(dan Kami alirkan sungai di celah-celah kedua kebun itu) Yakni Kami alirkan sungai di tengah-tengah dua kebun itu untuk mengairi keduanya terus-menerus tanpa henti."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Kedua buah kebun itu menghasilkan buahnya, dan kebun itu buahnya tidak berkurang sedikitpun. Kami alirkan sungai di celah-celah kedua kebun itu untuk mengairinya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kedua kebun itu menghasilkan buahnya} memberikan buahnya dengan sempurna {dan tidak berkurang} berkurang {sedikit pun. Kami mengalirkan} Kami mengalirkan {di celah-celah keduanya} di antara keduanya {sungai"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Tidak ada pertanyaan tentang dua kebun itu kecuali dikatakan, bagaimana buah-buahan kebun tersebut? Apakah ada air yang mencukupinya? Lalu Allah mengabarkan bahwa masing-masing dari “kedua kebun itu menghasilkan buahnya,” maksudnya, buahnya dan tanamannya berlipat ganda. Artinya, melimpah ruah. Dan sesungguhnya kebun tersebut “tiada berkurang buahnya sedikit pun,” artinya: tidak berkurang buahnya sedikit pun. Ditambah lagi, di sisi kanan-kirinya, sungai-sungai mengalir dengan deras."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 33",
    "description": "Kedua kebun itu menghasilkan buahnya yang banyak, dan ia tidak menzalimi pemiliknya sedikit pun, tidak pernah berkurang buahnya sepanjang masa dan kami mengalirkan sungai di celah-celah keduanya untuk menambah keindahannya. Dan selain kebun-kebun itu yang dimilikinya, dia juga memiliki kekayaan besar, seperti emas, perak dan kekayaan lainnya yang berlimpahlimpah sehingga membuat dirinya angkuh, maka dia berkata kepada temannya yang beriman ketika bercakap-cakap dengan dia, hartaku lebih banyak daripada hartamu yang terdiri dari kebun-kebun dan kekayaan lainnya sebagaimana engkau lihat, dan pengikutku, yakni anak-anakku, keluargaku dan pembantuku lebih kuat daripada pengikutmu, mereka pasti akan membantu dan menolongku kapan saja."
  }
]