[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sang pemilik dua kebun itu memiliki buah-buahan dan kekayaan lainnya. Maka ia berkata kepada temannya yang mukimin untuk mengobrol dengannya, sedang rasa sial dengan keadaanya sendiri menjejali jiwanya, ”aku lebih banyak memiliki harta daripada kamu, dan para pengikut serta pendukungku lebih kuat. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan pemilik dua kebun ini juga memiliki kekayaan dan buah-buah yang lain. Lalu dengan angkuh ia berkata kepada kawannya yang beriman ketika bercakap-cakap dengannya guna mempengaruhinya, \"Hartaku lebih banyak dari pada hartamu, kedudukanku lebih mulia, dan kerabat serta pengikutku lebih banyak darimu\"."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Dan pemilik dua kebun ini memiliki buah-buahan dan harta yang lain. Pemilik kebun ini berkata kepada temannya yang beriman dengan penuh kesombongan: “Aku memiliki harta yang lebih banyak darimu, dan penolong dan pembantuku lebih kuat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَكَانَ لَهُۥ (dan dia mempunyai) Yakni pemilik dua kebun itu mempunyai. ثَمَرٌ(kekayaan besar) Yakni buah-buahan yang lain selain anggur dan kurma. Pendapat lain mengatakan yang dimaksud dengan (الثمر) di sini adalah harta yang banyak yanh terdiri dari emas dan perak. فَقَالَ لِصٰحِبِهِۦ(maka ia berkata kepada kawannya) Yakni berkata kepada saudaranya yang mukmin. وَهُوَ يُحَاوِرُهُۥٓ(ketika bercakap-cakap dengan dia) Yakni ketika dia berbincang dengannya. أَنَا۠ أَكْثَرُ مِنكَ مَالًا وَأَعَزُّ نَفَرًا (Hartaku lebih banyak dari pada hartamu dan pengikut-pengikutku lebih kuat) Yakni aku lebih kuat untuk menuntut apa yang aku inginkan karena aku memiliki banyak pengikut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dia mempunyai kekayaan besar, selain kebun anggur dan kurma itu. Maka ia berkata kepada saudaranya yang mukmin ketika bercakap-cakap dengan dia: \"Hartaku lebih banyak dari pada hartamu, dan pengikut-pengikutku serta anak-anakku lebih kuat\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia juga memiliki buah-buahan} buah-buahan dan kekayaan yang banyak {lalu Dia berkata kepada kawannya ketika bercakap-cakap dengannya} dia kembali berbicara dan bercakap-cakap dengannya {“Hartaku lebih banyak daripada hartamu dan pengikutku lebih kuat”} lebih kuat kerabatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “Dan dia mempunyai,” laki-laki itu mempunyai “kekayaan besar,” (Kekayaan) yang sangat besar, sebagaimana makna yang dikandung oleh bentuk nakirah (indefinite noun). Maksudnya: kedua kebun tersebut benar-benar sempurna buahnya, sangat kuat pohon-pohonnya dan belum pernah terserang penyakit atau hal yang mencacatinya. Ini merupakan titik klimaks perhiasan dunia dalam masalah tanaman. Oleh karena itu, laki-laki ini tertipu, berbangga diri dan bermegah-megah, tapi melupakan akhiratnya. Maka berkatalah pemilik kedua kebun itu kepada temannya yang Mukmin saat mereka berdua berbincang-bincang. Yakni, sedang berdiskusi tentang sebagian kejadian hidup yang biasa berlaku dengan nada membanggakan diri di hadapan temannya (yang beriman), “Hartaku lebih banyak daripada hartamu dan pengikut-pengikutku lebih kuat.” Dia bangga karena hartanya banyak dan penolong-penolongnya yang kuat dari kalangan budak, pembantu, dan kerabat-kerabatnya. Ini merupakan sudut kejahilan darinya. Kalau bukan demikian, kebanggaan apa pun dengan hal-hal yang berada di luar fisiknya, yang tidak memiliki keutamaan psikologis dan sifat maknawi, maka kebangaannya itu ibarat kebanggaan seorang anak cengan angan-angan (kosong) yang tidak ada kepastian hakikatnya!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 34: Dengan sombong karena tertipu oleh harta kekayaannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 34",
    "description": "Dan selain kebun-kebun itu yang dimilikinya, dia juga memiliki kekayaan besar, seperti emas, perak dan kekayaan lainnya yang berlimpahlimpah sehingga membuat dirinya angkuh, maka dia berkata kepada temannya yang beriman ketika bercakap-cakap dengan dia, hartaku lebih banyak daripada hartamu yang terdiri dari kebun-kebun dan kekayaan lainnya sebagaimana engkau lihat, dan pengikutku, yakni anak-anakku, keluargaku dan pembantuku lebih kuat daripada pengikutmu, mereka pasti akan membantu dan menolongku kapan saja. Dan dia memasuki salah satu dari dua kebunnya mengajak temannya yang mukmin untuk melihat sambil membanggakan kekayaannya sedang ia zalim terhadap dirinya sendiri karena keangkuhan dan kekufurannya atas nikmat yang dianugerahkan Allah kepadanya; ia berkata kepada temannya dengan penuh keangkuhan, aku kira kebun ini tidak akan binasa selama-lamanya, ia terus membuahkan hasilnya sepanjang masa tidak putus-putusnya, ."
  }
]