[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Dan dia memasuki kebunnya, sedang dia berbuat zhalim kepada dirinya dengan kekafiran terhadap kebangkitan makhluk pasca kematiannya dan keragu-raguannya terhadap kedatangan hari kiamat. Buah-buah di kebun mencengangkan dirinya. Dan dia pun berkomentar, ”aku tidak yakin kebun ini akan binasa sepanjang hidupku. Dan aku tidak yakin bahwa sesungguhnya hari kiamat akan terjadi. Bila memang akan terjadi (sebagaimana yang engkau sangkakan wahai orang mukmin) dan aku akan dikembalikan kepada tuhanku, pasti aku akan mendapatkan di sisiNya tempat kembali dan tempat berpulang yang lebih baik daripada kebun ini, karena kemuliaaan diriku dan kedudukanku di sisiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Lalu orang kafir itu memasuki kebunnya bersama orang mukmin untuk memperlihatkan kebunnya padanya, sementara dia menzalimi dirinya sendiri dengan kekafiran dan keangkuhannya. Orang kafir itu berkata, \"Aku kira kebun yang engkau lihat ini tidak akan binasa, karena aku selalu memeliharanya agar langgeng."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35-36. Orang yang angkuh itu kemudian memasuki kebunnya dalam keadaan menzalimi diri sendiri dengan kekafirannya, dia berkata: “Aku yakin kebun ini tidak akan rusak selamanya, dan aku yakin hari kiamat tidak akan terjadi. Dan sungguh jikalau aku kembali kepada Tuhanku, pasti aku akan mendapat balasan yang paling baik dari-Nya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَدَخَلَ جَنَّتَهُۥ (Dan dia memasuki kebunnya) Para ahli tafsir mengatakan bahwa pemilik kebun ini menarik tangan saudaranya yang beriman untuk diajak masuk kebunnya dan berkeliling di dalamnya serta memperlihatkan segala hal menakjubkan yang ada di kebun itu. وَهُوَ ظَالِمٌ لِّنَفْسِهِۦ (sedang dia zalim terhadap dirinya sendiri) Sengan kekafiran dan kecongkakannya. قَالَ مَآ أَظُنُّ أَن تَبِيدَ هٰذِهِۦٓ أَبَدًا(ia berkata: “Aku kira kebun ini tidak akan binasa selama-lamanya) Yakni pemilik kebun yang kafir ini karena tinggi angan dan lalai dari rasa syukur ia mengatakan “aku yakin kebun yang kamu saksikan ini tidak akan binasa.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Firman Allah tentang seorang pemilik dua kebun : { وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٌ لِّنَفْسِهِۦ } disebutkan dengan ifrod padahal diketahui ia memiliki dua kebun, karena ayat ini tidak menjelaskan ketika pemilik kebun itu memasuki kedua kebunya secara bersamaan, dan itu tidak mungkin, namun Imam az-Zamakhsari memiliki jawaban lain namun dibantah oleh asy-Syanqithi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Dia (si kaya lagi kafir) memasuki kebunnya dengan Zhalim terhadap dirinya sendiri; ia berkata: \"Aku kira kebun ini tidak akan binasa selama-lamanya, karena di dunia dia lenyap"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia memasuki kebunnya dengan menzalimi diri sendiri} membahayakan diri sendiri dengan keangkuhan dan kekufurannya {Dia berkata,“Aku mengira bahwa kebun ini tidak akan binasa} kebun ini tidak hilang {selama-lamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. Lalu rasa bangga di hadapan temannya itu tidak cukup sampai di situ, sampai akhirnya dia menetapkan dengan kejahilan dan kebodohannya dan menyangka tatkala masuk ke dalam kebunnya “Ia berkata, ‘Aku kira kebun ini tidak akan binasa’ ,” yaitu terputus dan sirna “selama-lamanya.” Dia merasa tenang dan ridha dengan dunia serta mengingkari Hari Kebangkitan. Dia berkata, “Dan aku tidak mengira Hari KIamat itu akan datang, dan jika sekiranya aku dikembaikan kepada Rabbku,” sebagai prediksinya “pasti aku akan mendapat tempat kembali yang lebih baik daripada kebun-kebun itu,” maksudnya Dia akan memberikan kepadaku yang lebih baik daripada kedua kebun ini! Perkataan ini tidak lepas dari dua perkara, boleh jadi dia mengetahui kepastian keadaan , jadi perkataannya ini ditujukan untuk mengejek dan mengolok-olok, sehingga menjadi bentuk tambahan kekufuran kepada kekufuran (sebelumnya), atau perkataannya itu adalah benar-benar prasangka murni terhadap sebuah kepastian. Maka, jadilah dia orang yang paling bodoh, lagi pincang akalnya. Apakah terdapat korelasi antara kenikmatan dunia dengan kenikmatan akhirat, hingga dia menyangka dengan kebodohannya, barangsiapa diberi kenikmatan di dunia, pasti akan diberi kenikmatan pula di akhirat?! Bahkan pada umumnya, Allah menjauhkan dunia dari wali-wali dan orang-orang pilihanNya, lalu memudahkannya bagi musuh-musuhNYa yang tidak memiliki apa-apa di akhirat. Secara tekstual, dia mengetahui kepastian keadaan. Akan tetapi, dia mengatakan perkataan ini dalam rangka melontarkan ejekan dan olokan dengan dalil Firman Allah, “Dan dia memasuki kebunnya sedang dia zhalim terhadap dirinya sendiri.” Penetapan bahwa dia bersifat zhalim ketika memasukinya, yang kemudian muncul ucapannya yang telah terjadi itu, menunjukkan kesombongan dan kecongkakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 35: Mengajak kawannya mengelilingi kebunnya untuk memperlihatkan buah-buahannya. Yaitu dengan keangkuhan dan kekafirannya. Ia merasa tenteram dengan dunia ini, merasa ridha terhadapnya, dan sampai mengingkari adanya kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 35",
    "description": "Dan dia memasuki salah satu dari dua kebunnya mengajak temannya yang mukmin untuk melihat sambil membanggakan kekayaannya sedang ia zalim terhadap dirinya sendiri karena keangkuhan dan kekufurannya atas nikmat yang dianugerahkan Allah kepadanya; ia berkata kepada temannya dengan penuh keangkuhan, aku kira kebun ini tidak akan binasa selama-lamanya, ia terus membuahkan hasilnya sepanjang masa tidak putus-putusnya, dan aku tidak mengira bahwa hari kiamat itu akan datang dan tidak percaya kepada kebangkitan, dan sekiranya hari kiamat dan kebangkitan itu benar-benar datang seperti yang engkau katakan, lalu aku dikembalikan kepada tuhanku pada hari kebangkitan, pasti aku akan mendapat tempat kembali yang lebih baik dari pada ini, yakni lebih baik daripada keadaanku di dunia pada saat ini."
  }
]