[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "35-36. Dan dia memasuki kebunnya, sedang dia berbuat zhalim kepada dirinya dengan kekafiran terhadap kebangkitan makhluk pasca kematiannya dan keragu-raguannya terhadap kedatangan hari kiamat. Buah-buah di kebun mencengangkan dirinya. Dan dia pun berkomentar, ”aku tidak yakin kebun ini akan binasa sepanjang hidupku. Dan aku tidak yakin bahwa sesungguhnya hari kiamat akan terjadi. Bila memang akan terjadi (sebagaimana yang engkau sangkakan wahai orang mukmin) dan aku akan dikembalikan kepada tuhanku, pasti aku akan mendapatkan di sisiNya tempat kembali dan tempat berpulang yang lebih baik daripada kebun ini, karena kemuliaaan diriku dan kedudukanku di sisiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan aku tidak pernah percaya bahwa hari Kiamat itu akan terjadi, akan tetapi kehidupan kita ini adalah kehidupan yang kekal. Bahkan apabila kiamat benar-benar terjadi, kemudian aku dibangkitkan dan dikembalikan kepada Tuhanku, maka aku pasti mendapatkan tempat kembali yang lebih baik daripada kebunku ini, sebab keadaanku yang kaya raya di dunia ini menunjukkan bahwa aku akan kaya juga setelah kari kebangkitan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. وَمَآ أَظُنُّ السَّاعَةَ قَآئِمَةً (dan aku tidak mengira hari kiamat itu akan datang) Dia mengingkari adanya hari kebangkitan dan memberi tahu saudaranya bahwa dia tidak mempercayai hari kiamat dan kerusakan dunia. وَلَئِن رُّدِدتُّ إِلَىٰ رَبِّى لَأَجِدَنَّ خَيْرًا مِّنْهَا مُنقَلَبًا(dan jika sekiranya aku kembalikan kepada Tuhanku, pasti aku akan mendapat tempat kembali yang lebih baik dari pada kebun-kebun itu”) Ia mengatakan andai saja ia benar-benar di kembalikan kepada tuhannya maka ia akan mendapatkan sesuatu yang lebih baik dari pada kebun tersebut. Ia mengatakan ini karena mengukur sesuatu yang belum ada dengan sesuatu yang telah ada, ia mengira jika ia kaya di dunia maka ia juga akan kaya di akhirat. Ia merasa tinggi hati atas kekayaan yang ada padanya, padahal itu hanyalah istidraj dari Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Dan aku tidak mengira bahwa hari kiamat itu akan datang. Jika sekiranya aku kembalikan kepada Tuhanku di akhirat sebagaimana yang kamu anggapkan, pasti aku akan mendapat tempat kembali yang lebih baik dari pada tempat kembali yang kamu dapati di dunia karena saking banyaknya penduduknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak mengira bahwa hari kiamat itu akan datang} akan terjadi dan ada {dan jika aku dikembalikan kepada Tuhanku, pasti aku akan mendapat tempat kembali} tempat kembali dan kesudahan {yang lebih baik daripada itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35-36. Lalu rasa bangga di hadapan temannya itu tidak cukup sampai di situ, sampai akhirnya dia menetapkan dengan kejahilan dan kebodohannya dan menyangka tatkala masuk ke dalam kebunnya “Ia berkata, ‘Aku kira kebun ini tidak akan binasa’ ,” yaitu terputus dan sirna “selama-lamanya.” Dia merasa tenang dan ridha dengan dunia serta mengingkari Hari Kebangkitan. Dia berkata, “Dan aku tidak mengira Hari KIamat itu akan datang, dan jika sekiranya aku dikembaikan kepada Rabbku,” sebagai prediksinya “pasti aku akan mendapat tempat kembali yang lebih baik daripada kebun-kebun itu,” maksudnya Dia akan memberikan kepadaku yang lebih baik daripada kedua kebun ini! Perkataan ini tidak lepas dari dua perkara, boleh jadi dia mengetahui kepastian keadaan , jadi perkataannya ini ditujukan untuk mengejek dan mengolok-olok, sehingga menjadi bentuk tambahan kekufuran kepada kekufuran (sebelumnya), atau perkataannya itu adalah benar-benar prasangka murni terhadap sebuah kepastian. Maka, jadilah dia orang yang paling bodoh, lagi pincang akalnya. Apakah terdapat korelasi antara kenikmatan dunia dengan kenikmatan akhirat, hingga dia menyangka dengan kebodohannya, barangsiapa diberi kenikmatan di dunia, pasti akan diberi kenikmatan pula di akhirat?! Bahkan pada umumnya, Allah menjauhkan dunia dari wali-wali dan orang-orang pilihanNya, lalu memudahkannya bagi musuh-musuhNYa yang tidak memiliki apa-apa di akhirat. Secara tekstual, dia mengetahui kepastian keadaan. Akan tetapi, dia mengatakan perkataan ini dalam rangka melontarkan ejekan dan olokan dengan dalil Firman Allah, “Dan dia memasuki kebunnya sedang dia zhalim terhadap dirinya sendiri.” Penetapan bahwa dia bersifat zhalim ketika memasukinya, yang kemudian muncul ucapannya yang telah terjadi itu, menunjukkan kesombongan dan kecongkakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 36: Ia mengucapkan kalimat ini dengan nada mengolok-olok."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 36",
    "description": "Dan aku tidak mengira bahwa hari kiamat itu akan datang dan tidak percaya kepada kebangkitan, dan sekiranya hari kiamat dan kebangkitan itu benar-benar datang seperti yang engkau katakan, lalu aku dikembalikan kepada tuhanku pada hari kebangkitan, pasti aku akan mendapat tempat kembali yang lebih baik dari pada ini, yakni lebih baik daripada keadaanku di dunia pada saat ini. Temannya yang beriman berkata kepadanya sambil bercakap-cakap dengannya untuk menanggapi perkataanya yang sombong dan tidak percaya kepada tuhan, ia berkata, apakah engkau kafir kepada tuhan yang menciptakan engkau dari tanah, yakni engkau berasal dari adam yang diciptakan dari tanah, kemudian dari setetes air mani, yakni engkau sendiri sebagaimana keturunan adam berasal dari setetes air mani yang bersumber dari tumbuh-tumbuhan dan makanan yang tumbuh di tanah, lalu dia menjadikan engkau seorang laki-laki yang sempurna' adalah aneh jika engkau tetap ingkar kepada tuhan dan hari kebangkitan, serta tidak mensyukuri nikmat yang dianugerahkan tuhanmu."
  }
]