[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kawannya yang mukmin itu berkata kepadanya ketika dia berdiskusi dengannya dan menasihatinya, ”bagaimana kamu ingkar kepada Allah yang menciptakanmu dari tanah, kemudian dari tetesan air mani kedua orang tua, lalu Dia menjadikanmu makhluk yang sempurna, dengan perawakan yang sempurna?” dalam percakapan ini terdapat dalil bahwa Dzat yang maha kuasa memulai penciptaan, juga Dia maha kuasa untuk mengulang penciptaan mereka lagi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Kawannya yang mukmin berkata kepadanya sembari berusaha menyadarkannya, \"Apakah engkau telah ingkar dan kafir terhadap Żat yang menciptakan kakekmu, Adam, dari tanah? Lalu menciptakan dirimu dari air mani, kemudian engkau menjadi seorang laki-laki, dan menegakkan anggota tubuhmu sehingga menjadi sempurna? Sungguh Żat yang kuasa melakukan itu semua, pasti kuasa untuk membangkitkan dirimu kembali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37-38. Temannya yang beriman mengingkari perkataannya: “Apakah kamu ingkar terhadap Allah yang telah menciptakan awal mulamu dari tanah, kemudian dari air mani, lalu Dia menyempurnakanmu menjadi manusia? Adapun aku beriman bahwa Allah adalah Tuhanku, dan aku tidak menyekutukan-Nya dengan seorangpun."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. قَالَ لَهُۥ صَاحِبُهُۥ (Kawannya berkata kepadanya) Yakni saudaranya yang beriman berkata. أَكَفَرْتَ بِالَّذِى خَلَقَكَ مِن تُرَابٍ (Apakah kamu kafir kepada (Tuhan) yang menciptakan kamu dari tanah) Sebab Allah menciptakan Adam dari tanah, dan kamu berasal dari Adam. ثُمَّ مِن نُّطْفَةٍ ثُمَّ سَوَّىٰكَ رَجُلًا(kemudian dari setetes air mani, lalu Dia menjadikan kamu seorang laki-laki yang sempurna) yakni menjadikanmu seorang laki-laki dengan anggota tubuh yang sempurna. Dalam kalimat ini terdapat isyarat tentang bukti adanya hari kebangkitan, karena Dzat yang mampu menciptakan pertama kali juga mampu untuk mengulangi penciptaan tersebut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Cara yang paling ampun untuk menundukkan orang-orag yang menyombogkan dirinya dan mengingkari nikmat Allah adalah dengan ayat ini : mengingatkan mereka akan asal muasal penciptaannya, asal semua manusia dari yang kaya sampai yang miskin, raja-raja dan hamba sahaya, dan inilah yang mesti dilakukan oleh seorang mukmin agar menyampaikan dengan cara yang baik kepada saudaranya yang mulai menyombongkan diri { أَكَفَرْتَ بِالَّذِي خَلَقَكَ مِنْ تُرَابٍ ثُمَّ مِنْ نُطْفَةٍ ثُمَّ سَوَّاكَ رَجُلًا } \"Apakah kamu kafir kepada (Tuhan) yang menciptakan kamu dari tanah, kemudian dari setetes air mani, lalu Dia menjadikan kamu seorang laki-laki yang sempurna?\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Saudaranya yang mukmin berkata kepadanya: \"Apakah kamu kafir kepada Tuhan yang menciptakan kamu dari tanah, yaitu Adam alaihis salam. Kemudian dari setetes air mani, lalu Dia menjadikan kamu seorang laki-laki yang sempurna dengan akal dan tubuh yang sempurna?” Namun kekafirannya terhadap hari kebangkitan menjadikannya ingkar kepada Allah, serta ingkar kepada kekuasaan menciptakan yang juga berarti kuasa atas hari kebangkitan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kawannya berkata kepadanya ketika bercakap-cakap dengannya,“Apakah kamu ingkar kepada Dzat yang menciptakanmu dari tanah, kemudian dari setetes air mani, lalu Dia menjadikanmu seorang laki-laki yang sempurna"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. Temannya yang Mukmin berkata untuk menasehati dan mengingatkan keadaan pertamanya ketika Allah menjadikan dirinya di dunia dalam bentuk tersebut yaitu, “dari tanah, kemudian dari setetes air mani, lalu Dia menjadikan kamu seorang laki-laki yang sempurna,” Dia-lah Allah yang mengaruniakan kepadamu nikmat penciptaan dan bantuan, dan senantiasa mencurahkan kenikmatan kepadamu secara silih-berganti serta mengalihkanmu dari satu fase ke fase berikutnya sampai Allah menjadikanmu sebagai seorang laki-laki dengan anggota fisik yang sempurna, anggota tubuh yang teraba maupun yang abstrak. Dengan itu, Allah memudahkan bagimu segala sebab-sebab kemudahan, menyiapkan untukmu kenikmatan-kenikmatan dunia. Engkau tidak mendapatkan dunia dengan upaya dan kekuatanmu sendiri. Tetapi, karena karunia Allah kepadamu. Maka, apakah patut engkau mengingkari Allah yang telah menciptakanmu dari tanah kemudian dari setetes air mani, lalu menjadikanmu sebagai seorang laki-laki yang sempurna, sementara engkau tidak peduli dengan nikmatNya dan menyangka bahwa Dia tidak akan mampu membangkitkanmu, (dan menyangka) kalau Dia membangkitkanmu, niscaya Dia akan memberikan kepadamu karunia yang lebih baik dari kebunmu?! Ini merupakan hal yang tidak pantas dan tidak layak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 37: Menasehati dan mengingatkannya terhadap kejadiannya yang terdahulu. Yakni apakah engkau ingkar kepada Tuhan yang memberimu nikmat dengan menciptakan kamu dan memberi kenikmatan, merubah kamu dari keadaan yang satu kepada keadaan yang lain sehingga dirimu menjadi sosok manusia yang sempurna; yang lengkap dengan anggota badan baik yang dapat dirasakan maupun yang dapat dipikirkan, Dia juga yang memudahkan bagimu nikmat-nikmat dunia, dan kamu tidak memperoleh dunia dengan upaya dan kemampuanmu, bahkan dengan karunia Allah kepadamu. Oleh karena itu, pantaskah kamu kafir kepada Allah yang telah menciptakan kamu dari tanah, kemudian dari setetes mani, kemudian menjadikan kamu laki-laki yang sempurna, lalu kamu malah mengingkari nikmat-Nya dan kamu mengira bahwa Dia tidak akan membangkitkan kamu, dan sekalipun Dia membangkitkan kamu, Dia akan memberimu yang lebih baik lagi dari keadaan yang sekarang? Tentu tidak pantas.. Oleh karena itu, ketika kawannya yang mukmin melihat keadaan kawannya yang kafir dan tetap terus di atasnya, maka dia berkata menceritakan tentang keadaan dirinya sebaga rasa syukur kepada Allah dan memberitahukan tentang agama yang dipegangnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 37",
    "description": "Temannya yang beriman berkata kepadanya sambil bercakap-cakap dengannya untuk menanggapi perkataanya yang sombong dan tidak percaya kepada tuhan, ia berkata, apakah engkau kafir kepada tuhan yang menciptakan engkau dari tanah, yakni engkau berasal dari adam yang diciptakan dari tanah, kemudian dari setetes air mani, yakni engkau sendiri sebagaimana keturunan adam berasal dari setetes air mani yang bersumber dari tumbuh-tumbuhan dan makanan yang tumbuh di tanah, lalu dia menjadikan engkau seorang laki-laki yang sempurna' adalah aneh jika engkau tetap ingkar kepada tuhan dan hari kebangkitan, serta tidak mensyukuri nikmat yang dianugerahkan tuhanmu. Tetapi akuberbeda dengan engkau, aku percaya kepada tuhan, dialah Allah, tuhanku, yang menciptakan, memelihara dan menganugerahkan kepadaku berbagai macam kebaikan. Hanya dia yang aku sembah, dan aku tidak mempersekutukan tuhanku dengan sesuatu pun."
  }
]