[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "“Akan tetapi, aku tidak mengatakan seperti pernytaanmu yang menunjukan kekafiranmu. Ucapanku adalah ‘Dzat yang memberi nikmat yang memberi karunia adalah Allah, tuhanku semata. Aku tidak menyekutukan seseorangpun dalam ibadahku kepadaNya’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Namun aku tidak akan berkata seperti yang engkau katakan, akan tetapi aku berkata, \"Dia lah Allah, Mahasuci Tuhanku yang menganugerahkan kita berbagai nikmat-Nya, dan aku tidak akan menyekutukan-Nya dengan sesuatupun dalam beribadah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. لّٰكِنَّا۠ هُوَ اللهُ رَبِّى (Tetapi aku (percaya bahwa): Dialah Allah, Tuhanku) Yakni akan tetapi Allah adalah Tuhanku. وَلَآ أُشْرِكُ بِرَبِّىٓ أَحَدًا(dan aku tidak mempersekutukan seorangpun dengan Tuhanku) Tidak seperti yang kamu lakukan. 39. وَلَوْلَآ إِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَآءَ اللهُ (Dan mengapa kamu tidak mengatakan waktu kamu memasuki kebunmu “maasyaallaah) Yakni mengapa saat kamu memasuki kebunmu tidak mengatakan “MasyaaAllah”. Ini merupakan dorongan baginya agar mengakui bahwa kebun dan segala isinya itu ada dengan kehendak Allah, Allah bisa saja menghendaki untuk tetap menjaganya atau menghendaki untuk menhancurkannya. لَا قُوَّةَ إِلَّا بِاللهِ ۚ(tiada kekuatan kecuali dengan pertolongan Allah) Ini adalah dorongan baginya untuk mengakui kelemahannya, dan apa yang dapat ia lakukan untuk merawat kebun itu sebenarnya adalah karena pertolongan Allah dan bukan karena kekuatan dan kemampuannya. Dan tidak ada seorangpun yang mampu mengambil harta dan kenikmatannya kecuali Allah. Dalam hadits shahih disebutkan bahwa Rasulullah berkata kepada Abu Musa: “maukah kamu aku tunjukkan bagian dari perbendaharaan surga? Ketahuilah ia adalah kalimat Laa ilaaha illaa Allah.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Tetapi aku percaya bahwa: Dialah Allah, Tuhanku, dan aku tidak akan mempersekutukan Tuhanku dengan suatu apapun sebagaimana yang engkau lakukan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Akan tetapi aku} Akan tetapi aku tidak akan berkata seperti perkataanmu, tetapi aku akan berkata {Dia adalah Allah, Tuhanku, dan aku tidak menyekutukan sesuatu pun dengan Tuhanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. OLeh karena itu, tatkala temannya yang beriman melihat kondisinya dan konsistensinya dalam kekufuran dan kezhaliman, maka temannya itu berkata mengabarkan tentang dirinya dengan nada bersukur kepada Rabbnya dan menegaskan agamanya ketika terjadi perdebatan-perdebatan dan lontaran-lontaran syubhat, “Tetapi aku (percaya bahwa), ‘Dia-lah Allah, Rabbku, dan aku tidak mempersekutukan seorang pun dengan Rabbku’ ,” dia mengakui rububiyah Allah dan keesaanNya dalam rububiyah, dia konsisten dalam ketaatan dan ibadah kepadaNya, dan bahwasanya dia tidak akan mempersekutukanNYa dengan siapa pun dari makhlukNya. Kemudian, dia mengabarkan bahwa nikmat Allah kepadanya berupa keimanan dan Islam, sekalipun harta dan anaknya sedikit, sesungguhnya merupakan kenikmatan yang sebenarnya. Adapun kenikmatan selain itu, akan terancam musnah dan hukuman serta siksaan terhadapnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 38: Dia mengakui rububiyyah Allah dan uluhiyyahnya (keberhakan-Nya untuk diibadahi), kemudian ia memberitahukan sebagaimana pada ayat selanjutnya, bahwa nikmat yang diberikan Allah kepadanya berupa iman dan Islam meskipun harta dan anaknya sedikit merupakan nikmat hakiki, adapun nikmat selainnya akan segera hilang dan bisa mendatangkan azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 38",
    "description": "Tetapi akuberbeda dengan engkau, aku percaya kepada tuhan, dialah Allah, tuhanku, yang menciptakan, memelihara dan menganugerahkan kepadaku berbagai macam kebaikan. Hanya dia yang aku sembah, dan aku tidak mempersekutukan tuhanku dengan sesuatu pun. Dan mengapa engkau tidak mengucapkan, ketika engkau memasuki kebunmu yang subur dan penuh dengan berbagai macam buah dan tanaman ma'sya' alla'h, la' quwwata illa' billa'h, sungguh, atas kehendak Allah, semua ini terwujud, tidak ada kekuatan kecuali dengan pertolongan Allah. Semestinya engkau ucapkan kalimat itu sebagai tanda syukur kepada Allah yang menciptakan dan menganugerahkan kebaikan kepadamu. Sekiranya engkau melihat harta dan keturunanku lebih sedikit daripadamu, tidaklah mengapa, itulah anugerah tuhan yang diberikan untukku."
  }
]