[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-41. Dan mengapa sewaktu memasuki kebunmu, lalu kebunmu membuatmu berdecak kagum, kamu tidak memuji Allah dan mengucapkan, ’ini adalah kehendak Allah padaku. Tidak ada kekuatan bagiku untuk mewujudkannya kecuali dengan pertolongan Allah’ jika engkau anggap aku lebih sedikit harta dan anak-anak daripada kamu. ’ Maka semoga tuhanku memberiku sesuatu yang lebih baik daripada kebunmu dan mengambil kenikmatan darimu akibat kekafiranmu dan mengirim sisksaan dari langit pada kebunmu sehingga berubah menjadi tanah yang licin lagi gundul(gersang), di mana kaki tidak dapat menginjak dengan kuat, tanaman tidak dapat tumbuh di sana. Atau airnya yang kamu pakai untuk menyirami tanamunmu dengannya berubah menjadi surut ke dalam tanah, sehingga engkau tiidak dapat menggeluarkannya lagi, ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Dan alangkah bagusnya bila memasuki kebunmu engkau berkata, \"Māsyā Allāh, Lā Quwwata Illā billāh\" (Sungguh atas kehendak Allah semua ini terwujud, tidak ada kekuatan kecuali dengan pertolongan Allah), Dia lah yang melakukan apa yang Dia kehendaki, dan Dia Maha Kaya. Jika engkau melihatku lebih miskin dan lebih sedikit anak dari dirimu,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39-41. Mengapa kamu tidak mengatakan ketika masuk ke dalam kebunmu ‘Inilah yang Allah kehendaki bagiku, aku tidak memiliki kekuatan untuk mencapainya melainkan dengan kuasa Allah’. Jika kamu melihatku lebih sedikit harta dan keturunannya darimu, maka aku berharap Tuhanku akan memberiku apa yang lebih baik dari kebunmu, dan mengirimkan penyakit kepada kebunmu agar merusaknya atau petir yang membakarnya, sehingga ia menjadi tandus tanpa tanaman sedikitpun, atau airnya meresap jauh ke dalam tanah sehingga kamu tidak mampu mengeluarkannya untuk menyiraminya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَلَوْلَآ إِذْ دَخَلْتَ جَنَّتَكَ قُلْتَ مَا شَآءَ اللهُ (Dan mengapa kamu tidak mengatakan waktu kamu memasuki kebunmu “maasyaallaah) Yakni mengapa saat kamu memasuki kebunmu tidak mengatakan “MasyaaAllah”. Ini merupakan dorongan baginya agar mengakui bahwa kebun dan segala isinya itu ada dengan kehendak Allah, Allah bisa saja menghendaki untuk tetap menjaganya atau menghendaki untuk menhancurkannya. لَا قُوَّةَ إِلَّا بِاللهِ ۚ(tiada kekuatan kecuali dengan pertolongan Allah) Ini adalah dorongan baginya untuk mengakui kelemahannya, dan apa yang dapat ia lakukan untuk merawat kebun itu sebenarnya adalah karena pertolongan Allah dan bukan karena kekuatan dan kemampuannya. Dan tidak ada seorangpun yang mampu mengambil harta dan kenikmatannya kecuali Allah. Dalam hadits shahih disebutkan bahwa Rasulullah berkata kepada Abu Musa: “maukah kamu aku tunjukkan bagian dari perbendaharaan surga? Ketahuilah ia adalah kalimat Laa ilaaha illaa Allah.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Hubayrah tentang ayat ini berkata : { مَا شَآءَ ٱللَّهُ } tidak disebutkan dengan lafadz ( ما شاء الله كان ) atau ( لا يكون ) tetapi disebutkan dengan lafadznya yang sepert itu; bertujuan agar mencakup waktu lampau dan yang akan datang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Mengapa ketika engkau memasuki kebunmu engkau tidak mengatakan \"Maasyaallaah, laa quwwata illaa billaah sungguh atas kehendak Allah semua ini bisa terwujud, tiada kekuatan kecuali dengan pertolongan Allah.” “Sekiranya engkau menganggap aku lebih sedikit darimu dalam hal harta dan keturunan.” Nabi berkata kepada Abu Musa: “Apakah engkau mau aku tunjukkan gudang dari gudangnya surga, ialah kalimat laa quwwata illaa billaah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mengapa tidak} mengapa tidak {kamu ucapkan ketika memasuki kebunmu,”Sungguh ini semua kehendak Allah. Tidak ada kekuatan apa pun kecuali dengan (pertolongan) Allah). Jika kamu menganggap bahwa aku lebih sedikit daripada kamu dalam hal harta dan keturunan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Sahabat yang beriman berkata kepada kawannya yang kafir, “Engkau sekalipun membanggakan diri di depanku dengan harta dan anakmu yang banyak, dan kamu melihatku “lebih sedikit darimu dalam hal harta dan keturunan,” sesungguhnya sesuatu yang ada di sisi Allah lebih baik dan lebih kekal, apa yang diharapkan dari kebaikan dan curahan kebajikanNya lebih utama daripada seluruh (kenikmatan) dunia yang mana orang-orang berlomba-lomba di dalamnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 39: Meskipun anak dan hartamu banyak, dan engkau melihat diriku sedikit harta dan anak, namun apa yang ada di sisi Allah lebih baik dan lebih kekal; apa yang diharapkan dari kebaikan dan ihsan-Nya lebih utama daripada seluruh isi dunia. Dalam ayat ini terdapat petunjuk bagi kita agar merasa terhibur dengan kebaikan dari sisi Allah ketika kita kurang mendapatkan kesenangan dunia. Ayat ini juga menunjukkan, bahwa harta dan anak tidaklah bermanfaat bagi seseorang jika tidak membantunya untuk taat kepada Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 39",
    "description": "Dan mengapa engkau tidak mengucapkan, ketika engkau memasuki kebunmu yang subur dan penuh dengan berbagai macam buah dan tanaman ma'sya' alla'h, la' quwwata illa' billa'h, sungguh, atas kehendak Allah, semua ini terwujud, tidak ada kekuatan kecuali dengan pertolongan Allah. Semestinya engkau ucapkan kalimat itu sebagai tanda syukur kepada Allah yang menciptakan dan menganugerahkan kebaikan kepadamu. Sekiranya engkau melihat harta dan keturunanku lebih sedikit daripadamu, tidaklah mengapa, itulah anugerah tuhan yang diberikan untukku. Maka mudah-Mudahan tuhanku, akan memberikan kepadaku kebun yang lebih baik dari kebunmu sekarang ini; dan janganlah engkau membanggakan kekayaanmu, boleh jadi, dia suatu waktu mengirimkan petir dari langit ke kebunmu, dan memporak porandakan kebunmu sehingga kebun itu menjadi tanah yang licin, dan hilang kesuburan tanahnya, ."
  }
]