[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-41. Dan mengapa sewaktu memasuki kebunmu, lalu kebunmu membuatmu berdecak kagum, kamu tidak memuji Allah dan mengucapkan, ’ini adalah kehendak Allah padaku. Tidak ada kekuatan bagiku untuk mewujudkannya kecuali dengan pertolongan Allah’ jika engkau anggap aku lebih sedikit harta dan anak-anak daripada kamu. ’ Maka semoga tuhanku memberiku sesuatu yang lebih baik daripada kebunmu dan mengambil kenikmatan darimu akibat kekafiranmu dan mengirim sisksaan dari langit pada kebunmu sehingga berubah menjadi tanah yang licin lagi gundul(gersang), di mana kaki tidak dapat menginjak dengan kuat, tanaman tidak dapat tumbuh di sana. Atau airnya yang kamu pakai untuk menyirami tanamunmu dengannya berubah menjadi surut ke dalam tanah, sehingga engkau tiidak dapat menggeluarkannya lagi, ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Maka aku memperkirakan bahwa Allah akan memberikanku yang lebih baik dari kebunmu, dan Dia akan mengirimkan suatu bencana dari langit pada kebunmu ini, sehingga kebun itu akan menjadi tanah licin yang tidak ada tumbuhannya, yang bisa membuat kaki tergelincir lantaran licinnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. فَعَسَىٰ رَبِّىٓ أَن يُؤْتِيَنِ خَيْرًا مِّن جَنَّتِكَ (maka mudah-mudahan Tuhanku, akan memberi kepadaku (kebun) yang lebih baik dari pada kebunmu) Yakni jika kamu melihatku lebih miskin darimu maka aku berharap Allah akan memberiku rezeki berupa kebun yang lebih baik daripada kebunmu baik itu di dunia maupun di akhirat. وَيُرْسِلَ عَلَيْهَا حُسْبَانًا(dan mudah-mudahan Dia mengirimkan (petir)) Yakni mengirim sebagian dari kuasa Allah pada kebunmu. Terdapat pendapat mengatakan yang dimaksud dengan (الحسبان) adalah petir. مِّنَ السَّمَآءِ فَتُصْبِحَ صَعِيدًا زَلَقًا(dari langit kepada kebunmu; hingga (kebun itu) menjadi tanah yang licin) Yakni kebun orang kafir itu menjadi tanah yang tidak memiliki tanaman, kaki akan terpeleset di kebun tersebut karena kelicinannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Maka mudah-mudahan Tuhanku, akan memberi kebun yang lebih baik kepadaku kelak di akhirat dari pada kebunmu di dunia ini. Mudah-mudahan Dia mengirimkan petir dari langit kepada kebunmu; sebagai balasan atas kekufuranmu hingga kebun itu menjadi tanah yang licin, yang akan menggelincirkan kaki. Yaitu tanah yang tidak bisa ditanami kembali"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mudah-mudahan Tuhanku} mudah-mudahan Tuhanku {akan memberiku} memberiku {yang lebih baik daripada kebunmu dan mengirimkan kepada kebunmu} kepada kebunmu {ketentuan} azab {dari langit sehingga menjadi tanah yang licin} tanah licin yang tidak tumbuh tanaman dan tidak bisa digunakan untuk berdiri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Maka mudah-mudahan Rabbku, akan memberi kepadaku (kebun) yang lebih baik daripada kebunmu (ini); dan mudah-mudahan Dia mengirimkan kepada kebunmu,” maksudnya, (mengirimkan) kepada kebunmu yang mana karenanya engkau berbuat melampaui batas dan ia memperdayakanmu “ketentuan (petir) dari langit,” yaitu azab dengan hujan deras atau yang semacamnya “hingga (kebun itu),” lantaran azab tersebut “menjadi tanah yang licin.” Pohon-pohonnya tercabut, buah-buahannya rusak, tanaman-tanamannya tergenangi air dan kemanfaatannya lenyap."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 40: Pohon-pohonnya tercabut, buah-buahannya hancur, tanamannya tenggelam oleh air hujan, dan manfaatnya pun hilang. Dalam ayat ini terdapat dalil bolehnya mendoakan kebinasaan terhadap harta jika menjadi sebab kekufuran seseorang dan melampaui batas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 40",
    "description": "Maka mudah-Mudahan tuhanku, akan memberikan kepadaku kebun yang lebih baik dari kebunmu sekarang ini; dan janganlah engkau membanggakan kekayaanmu, boleh jadi, dia suatu waktu mengirimkan petir dari langit ke kebunmu, dan memporak porandakan kebunmu sehingga kebun itu menjadi tanah yang licin, dan hilang kesuburan tanahnya, atau airnya menjadi surut meresap ke dalam tanah, maka engkau tidak akan dapat menemukannya lagi, yakni tidak dapat menemukan lagi sumber air yang dapat mengairi kebunmu."
  }
]