[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan nyatalah apa yang dikatakan oleh orang yang mukmin itu dan terjadilah kehancuran pada kebun tersebut, dan hancurlah semua yang ada di dalamnya. Akhirnya orang kafir itu membolak-balikan dua telapak tangannya sebagai ekspresi kekecewaan dan penyesalan terhadap apa yang dia belanjakan untuk kebun itu, sedang pohon-pohonnya roboh, sebagiannya tumbang menindih pohon lainnya dan dia berkata, ”sekiranya aku menyadari nikmat-nikmat Allah dan kekuasaanNya, serta tidak menyekutukan sesuatupun denganNya.” ini adalah rasa penyesalan darinya tatkala penyesalan sudah tidak ada gunanya lagi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Lalu terjadilah apa yang diperkirakan oleh orang mukmin tersebut. Semua buah kebun orang kafir tersebut dibinasakan sehingga iapun membolak-balikkan kedua tangannya karena sangat rugi dan menyesal atas harta yang ia gunakan untuk memelihara dan menyuburkannya, namun ternyata pohon-pohon kebun itu roboh beserta tiang-tiang yang menyangga dahan anggurnya. Lalu ia berkata, \"Celakalah diriku, kenapa dahulu aku tidak beriman kepada Tuhanku semata, dan tidak menyekutukan-Nya dengan sesuatupun dalam beribadah.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42-43. Dan balasan bagi orang angkuh itu datang sehingga semua pohonnya rusak, sehingga dia memukulkan tangannya yang satu kepada tangan yang lain karena merasa sedih atas harta yang telah dikeluarkannya untuk merawat kebun itu. Atap, dinding, dan pepohonannya roboh seluruhnya; sehingga dia berkata dengan penuh penyesalan: “Aduhai aku tidak menyekutukan Tuhanku dengan sesuatu apapun”. Tidak ada orang yang dapat menolongnya dari musibah ini selain Allah, dan dia tidak dapat melindungi dirinya sendiri dari azab tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَأُحِيطَ بِثَمَرِهِۦ (Dan harta kekayaannya dibinasakan) Ini merupakan kalimat yang mengibaratkan bagaimana Allah membinasakan dan menghancurkan kekayaan orang kafir tersebut. فَأَصْبَحَ يُقَلِّبُ كَفَّيْهِ (lalu ia membulak-balikkan kedua tangannya) Yakni membolak-balikkan kedua tangannya karena penyesalannya yang begitu besar. عَلَىٰ مَآ أَنفَقَ فِيهَا (terhadap apa yang ia telah belanjakan untuk itu) Yakni membelanjakan hartanya untuk mengurus dan memelihara kebunnya. وَهِىَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا(sedang pohon anggur itu roboh bersama para-paranya) Yakni penyanggah yang digunakan untuk menyanggah pohon-pohon anggur di kebun itu roboh. Atau sebagian pepohonan di kebun itu roboh menimpa pepohonan yang lain. وَيَقُولُ يٰلَيْتَنِى لَمْ أُشْرِكْ بِرَبِّىٓ أَحَدًا(dan dia berkata: “Aduhai kiranya dulu aku tidak mempersekutukan seorangpun dengan Tuhanku) Setelah menyaksikan kehancuran kebunnya ia berangan-angan seandainya ia tidak menyekutukan Allah sehingga kebunnya dapat selamat dari kehancuran. Atau perkataannya dalam ayat ini ia maksudkan sebagai taubatnya dari kesyirikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ada orang yang terlihat ia menerima percakapan lawan bicaranya secara zhahir, akan tetapi hakikatnya hatinya senantiasa mencoba untuk mengingkari dan menyombongkan diri, maka pada akhirnya nasihat yang diberikan tidak bermanfaat baginya, hal ini sama seperti yang dikisahkan tentang seorang lelaki pemilik dua kebun, ketika temanya menasihatinya tentang iman dengan lisannya, namun lelaki itu justru menerimanya dengan kesombongan dan keangkuhan yang berakhir dengan penyesalan : { وَيَقُولُ يَٰلَيْتَنِى لَمْ أُشْرِكْ بِرَبِّىٓ أَحَدًا } \"Aduhai kiranya dulu aku tidak mempersekutukan seorangpun dengan Tuhanku\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Harta kekayaan si kafir dibinasakan dengan bencana dari langit. Lalu ia membolak-balikkan kedua tangannya sebagai tanda penyesalan terhadap apa yang telah ia belanjakan untuk itu. Adapun pohon anggur itu roboh dan dia berkata: \"Aduhai kiranya dulu aku tidak mempersekutukan Tuhanku dengan seuatu apapun\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Harta kekayaannya dibinasakan} azab itu meliputi buah-buahan dari kebunnya {lalu dia membolak-balikkan kedua telapak tangannya} menepuk-nepuknya tangannya satu sama lain karena menyesal dan berduka {terhadap apa yang telah dia belanjakan untuk itu, sedangkan pohon anggur itu roboh} jatuh {bersama penyangganya} penyangganya {dan berkata,“Aduhai sekiranya aku tidak menyekutukan sesuatu pun dengan Tuhanku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. Maka Allah mengabulkan doanya “dan harta kekayaannya dibinasakan,” maksudnya siksaan yang merata telah menimpanya dan memusnahkannya, sehingga tidak ada yang tersisa sedikit pun. (Maka) azab yang menimpa buah-buahan secara keseluruhan, berarti semua pepohonan, buah-buahan dan sawah ludes. Lalu dia pun amat menyesal dan sangat berduka cita “lalu dia membolak balikkan kedua tangannya (tanda menyesal) terhadap sesuatu yang telah ia belanjakan untuk itu,” maksudnya, (menyesal) terhadap sesuatu yang telah ia membelanjakan modal duniawi untuk kebun tersebut, sementara ia (sekarang) telah sirna dan lenyap, hingga tidak tersisa cadangan penggantinya. Maka, dia juga menyesal atas kesyirikan dan sifat keburukannnya. Oleh karena itu, Allah berfirman, “Dia berkata,’Aduhai kiranya dulu aku tidak mempersekutukan seorang pun dengan Rabbku’.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 42: Dan menyesal pula terhadap perbuatan syirk dan keburukannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 42",
    "description": "Dan harta kekayaannya dibinasakan, kebunnya hancur dan semua kekayaannya punah, lalu dia membolak-balikkan kedua telapak tangannya karena sedih dan menyesal terhadap apa yang telah dia belanjakan untuk itu yang tak terhitung banyaknya, sedang pohon anggur roboh bersama penyangganya, lalu dia berkata, betapa sekiranya dahulu aku menuruti saran temanku tidak mempersekutukan tuhanku dengan sesuatu pun. Ia menyesal, tetapi penyesalannya itu terlambat datangnya. Dan tidak ada lagi baginya segolongan pun yang dapat menolongnya selain Allah, padahal sebelumnya dia membanggakan anak-Nya, keluarganya dan pengikutnya yang diharapkan menjadi pembela dan penolongnya ketika ditimpa bencana; dan dia pun ketika itu dalam keadaan sangat lemah tidak akan dapat membela dirinya."
  }
]