[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan dia tidak memiliki golongan yang dapat dia bangga-banggakan yang melindunginya dari siksaan Allah yang turun kepadanya, dan diapun sekali-kali tidak dapat mempertahankan diri dengan jiwa dan kekuatannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Tidak ada sekelompok orang pun yang bisa menolong orang kafir ini dan menghalangi datangnya azab tersebut. Dia yang sebelumnya merasa angkuh dengan kelompok yang bisa menolongnya, padahal hal ini tidak bisa menghalangi Allah untuk membinasakan kebunnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَلَمْ تَكُن لَّهُۥ فِئَةٌ يَنصُرُونَهُۥ مِن دُونِ اللهِ (Dan tidak ada bagi dia segolonganpun yang akan menolongnya selain Allah) Yakni tidak bermanfaat baginya para pengikut yang dulu ia banggakan. وَمَا كَانَ مُنتَصِرًا(dan sekali-kali ia tidak dapat membela dirinya) Yakni kekuataannya tidak dapat mencegah Allah untuk menghancurkan kebunnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Tidak akan ada segolonganpun yang akan bisa menolongnya selain Allah; dan sekali-kali ia tidak dapat membela dirinya dari kehancuran dan balasan Tuhan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada baginya segolongan pun} sekelompok pun {yang dapat menolongnya selain Allah dan dia tidak dapat membela diri} menjadi penjaga diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. Allah berfirman, “Dan tidak ada baginya segolongan pun yang menolongnya selain Allah; dan sekali-kali dia tidak dapat membela dirinya,” maksudnya, tatkala azab menerjang kebunnya, maka hilanglah apa yang dulu dia bangga-banggakan di hadapan temannya melalui perkataannya, “Hartaku lebih banyak daripada hartamu dan pengikut-pengikutku lebih kuat.” Mereka (para pengikut itu) tidak dapat menolak azab darinya sedikit pun pada momentum yang dia sangat membutuhkannya. Dia pun tidak membela dirinya. Lalu bagaimana mungkin dia sanggup membela diri atau memiliki kemampuan untuk menang di hadapan keputusan dan takdir Allah, yang mana jika DIa telah jalankan dan takdirkan, sekiranya seluruh penghuni langit-langit dan bumi bersatu untuk mencampakkan sedikit saja, niscaya merekka tidak akan sanggup? Tidak mustahil, menilik (betapa besar) rahmat dan kelembutan Allah bahwa pemilik kebun (yang telah dilingkari oleh siksaan) keadaannya membaik dan Allah memberinya kesempatan kembali kepadaNya dan menemukan nalarnya yang lurus dan meninggalkan penentangan dan sikapnya yang melampaui batas. Dengan bukti, bahwa orang tersebut memperlihatkan penyesalannya atas tindakan kesyirikannya kepada Rabbnya, dan bahwasanya Allah telah menghilangkan dari dirinya siksap-sikap yang menyebabkannya melampaui batas dan menghukuminya di dunia. Apabila Allah menghendaki kebaikan pada seorang hamba, niscaya Allah menyegerakan hukuman baginya di dunia. Kemurahan Allah tidak terliputi oleh imajinasi-imajinasi dan akal-pikiran, tidak ada yang mengingkarinya melainkan orang zhalim lagi sangat bodoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 43: Ketika azab turun menimpa kebunnya, dan apa yang dibangga-banggakan dahulu telah hilang, baik harta maupun pengikut. Para pengikutnya meskipun banyak tidak mampu menolongnya dari azab itu, dan dia pun tidak mampu membela dirinya sendiri. Bagaimana mungkin ia dapat membela dirinya dari ketetapan Allah? Padahal jika sekiranya semua penduduk langit dan bumi berkumpul bersama untuk menolak ketetapan-Nya, maka mereka tidak akan sanggup."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 43",
    "description": "Dan tidak ada lagi baginya segolongan pun yang dapat menolongnya selain Allah, padahal sebelumnya dia membanggakan anak-Nya, keluarganya dan pengikutnya yang diharapkan menjadi pembela dan penolongnya ketika ditimpa bencana; dan dia pun ketika itu dalam keadaan sangat lemah tidak akan dapat membela dirinya. Di sana, ia menyadari bahwa pertolongan itu hanya dari Allah yang mahabenar. Dialah sebaik-baik pemberi pahala, dan sebaik-baik pemberi balasan kepada siapa yang berbuat kebajikan."
  }
]