[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dalam keadaan genting seperti ini, pembelaan dan pertolongan hanya hak Allah, Dzat yang maha haq. Dia sebaik-baik pemberi pahala dan sebaik-baik pemberi balasan bagi oarng-orang yang dibelaNya dari para hambaNya yang beriman."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Pada kondisi ini, pertolongan itu hanya milik Allah semata, Dia pasti menyediakan pahala yang terbaik bagi wali-wali-Nya yang beriman. Dia akan melipat gandakan pahala dan kebaikan mereka sebagai ganjaran bagi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Di saat keadaan yang sangat sulit itulah hanya Allah Yang Haq yang dapat memberi pertolongan. Allah akan memberi orang beriman sebaik-baik pahala dan sebaik-baik kesudahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. هُنَالِكَ الْوَلٰيَةُ لِلّٰهِ الْحَقِّ ۚ (Di sana pertolongan itu hanya dari Allah Yang Hak) Yakni pada keadaan itu pertolongan hanya dari Allah, tidak ada orang yang mampu memberi pertolongan. هُوَ خَيْرٌ ثَوَابًا(Dia adalah sebaik-baik Pemberi pahala) Bagi para kekasih-Nya di dunia dan di akhirat. وَخَيْرٌ عُقْبًا (dan sebaik-baik Pemberi balasan) dan kesudahan yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Di sana pertolongan itu hanya dari Allah Yang Haq. Dia adalah sebaik-baik Pemberi pahala dan sebaik-baik Pemberi balasan di dunia dan akhirat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Di sana} pada kondisi dan keadaan itu {pertolongan itu hanya milik Allah} pertolongan hanya milik Allah saja {Yang Maha benar. Dia adalah lebih baik pahalanya dan lebih baik kesudahannya} kesudahan bagi orang yang berharap kepadaNya dan dan memohon keamanan kepadaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “Di sana pertolongan itu hanya dari Allah yang Haq. Dia adalah sebaik-baik Pemberi pahala dan sebaik-baik Pemberi balasan.” Maksudnya, di dalam kondisi itu, yang Allah menjatuhkan hukuman pada orang yang melampaui batas dan lebih mendahulukan kehidupan dunia (sedangkan suasana kemuliaan adalah bagi orang yang beriman dan beramal shalih, mensyukuri Allah dan mengajak orang lain untuk melakukannya), (di saat itulah) menjadi jelas dan terang bahwa kepemimpinan yang haq (hanya) milik Allah semata. Barangsiapa yang beriman dan bertakwa kepada Allah, maka Allah menjadi walinya, lalu memuliakannya dengan pelbagai macam kemuliaan, dan menjauhkan darinya seluruh keburukan dan siksa. Dan barangsiapa yang tidak beriman kepada Rabbnya dan tidak mengangkatNya sebagai walinya, niscaya dan akhirat adalah sebaik-baik pahala yang diharapkan dan dinantikan. • Dalam kisah ini termuat (petikan) pelajaran dari kondisi orang-orang yang telah Allah beri kenikmatan duniawi yang berlimpah, hingga membuatnya melalaikan kehidpan akhiratnya dan berbuat melampaui batas, melakukan maksiat kepada Allah dengannya (Beranggapan), bahwasanya kesudahan nikmat-nikmat itu adalah putus dan pudar, dan bahwa meskipun ia dapat menikmatinya sejenak, namun sikapnya itu akan menghalangi (datangnya) kenikmatan-kenikmatan dalam kurun waktu yang panjang (di akhirat), dan bahwa seorang hamba sepatutnya bila terkagum-kagum dengan Sesuatu (yang dimiliki) dari harta dan anaknya, maka hendaknya dia menisbatkannya kepada Dzat yang memberikan dan mencurahkan kenikmatan sambil mengatakan , “Sungguh atas kehendak Allah. Tidak ada kekuatan kecuali dengan (pertolongan) Allah.” Supaya ia menjadi hamba yang bersyukur [kepada Allah] dan menempuh cara agar kenikmatannya lestari pada dirinya, berdasarkan Firman Allah \"Dan mengapa kamu tidak mengucapkan tatkala kamu memasuki kebunmu \"MAA SYAA ALLAH, LAA QUWWATA ILLAA BILLAH\" (Sungguh atas kehendak Allah semua ini terwujud, tiada kekuatan kecuali dengan pertolongan Allah). (Al-Kahfi: 39). •Dalam KIsah ini pula terdapat petunjuk untuk menghibur diri dari (hilangnya) kenikmatan-kenikmatan dunia dan kesenangan-kesenagannya dengan (mengingat-ingat) kebaikan-kebaikan yang berada di sisi Allah, berdasarkan Firman Allah, \" Sekiranya kamu anggap aku lebih sedikit darimu dalam hal harta dan keturunan,\" maka mudah-mudahan Tuhanku, akan memberi kepadaku (kebun) yang lebih baik daripada kebunmu (ini); dan mudah-mudahan Dia mengirimkan ketentuan (petir) dari langit kepada kebunmu, hingga (kebun itu) menjadi tanah yang licin.\" (Al-Kahfi:39-40). • Bahwasanya harta dan anak tidak bermanfaat bila tidak membantu dalam ketaatan kepada Allah . sebagaimana Firman Allah, Dan sekali-kali bukanlah harta dan bukan (pula) anak-anak kamu yang mendekatkan kamu kepada Kami sedikit pun; tetapi orang-orang yang beriman dan mengerjakan amal-amal saleh\" (Saba:37). •Kisah ini juga mengandung doa kehancuran harta orang-orang yang kekayaannya menjadi sebab sifat melampaui batas, kekufuran, dan kerugiannya. Apalagi bila dia mengunggulkan dirinya di atas kaum Mukminin dan berbangga hati di hadapan mereka. Di dalamnya mengandung (faidah) bahwa wujud wilayah perlindungan Allah (pada seseorang) atau ketiadaannya menjadi jelas dampaknya, ketika debu-debu (tabir penutup) sudah tersisihkan dan pembalasan sudah pasti datang, dan ketika para pelaku perbuatan sudah pasti datang, dan ketika para pelaku perbuatan sudah mendapatkan balasannya, maka “di sana pertolongan itu hanya dari Allah Yang Haq. Dia adalah sebaik-baik Pemberi pahala dan sebaik-baik Pemberi Balasan,” paling baik akibat dan kesudahannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 44: Yakni pada kejadian yang di sana Allah Subhaanahu wa Ta'aala memberlakukan hukuman-Nya terhadap orang-orang yang melampaui batas dan mengutamakan kehidupan dunia, serta kemuliaan dari-Nya yang diberikan kepada orang yang beriman dan beramal saleh, serta bersyukur kepada Allah dan mengajak orang lain kepadanya terdapat bukti bahwa pertolongan itu hanya dari Allah yang Mahabenar. Dalam kisah ini terdapat pelajaran, bahwa barang siapa yang menyikapi nikmat Allah dengan sikap kufur, maka kenikmatan yang diberikan kepadanya tidak lama dan akan segera lenyap, dan bahwa seorang hamba apabila merasa kagum dengan harta dan anaknya hendaknya menyandarkan nikmat itu kepada pemberinya serta mengucapkan, “Maa syaa Allah laa quwwata illaa billah” agar ia menjadi orang yang bersyukur kepada Allah yang menyebabkan nikmat itu akan tetap pada dirinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 44",
    "description": "Di sana, ia menyadari bahwa pertolongan itu hanya dari Allah yang mahabenar. Dialah sebaik-baik pemberi pahala, dan sebaik-baik pemberi balasan kepada siapa yang berbuat kebajikan. Dan berilah perumpamaan kepada mereka, semua manusia, bahwa kehidupan dunia adalah seperti air hujan yang kami turunkan dari langit, lalu menyirami tumbuh-tumbuhan maka bercampurlah dengannya tumbuhtumbuhan di muka bumi, dengan siraman air, tumbuh-tumbuhan itu menjadi subur, kemudian tidak lama sesudah itu tumbuh-tumbuhan itu menjadi kering yang diterbangkan oleh angin. Dan adalah Allah mahakuasa atas segala sesuatu. Dia mahakuasa menyuburkan tumbuh-tumbuhan dan mahakuasa pula menjadikannya layu dan kering kerontang. Demikianlah perumpamaan kehidupan dunia. Kesenangan dan kebahagiaan tidak kekal di dalamnya dan tidak berlangsung selama-lamanya."
  }
]