[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan buatkanlah wahai rasul, satu perumpamaan kepada manusia (terutama kepada orang-orang yang mempunyai sifat kesombongan dari mereka) perihal karakter dunia yang mereka telah terpedaya dengannya dalam pesona dan kesirnaannya yang cepat. Yaitu dunia itu adalah seperti air yang Allah turunkan dari langit, maka dengan itu tumbuhlah tanam-tanaman atas kehendakNya, dan berubah menjelma kehijauan. Dan tidak lama kemudian tanam-tanaman itu kering dan patah-patah yang diterbangkan oleh angin ke seluruh penjuru. Dan Allah maha kuasa atas segala sesuatu. maksudnya, mempunyai kekuasaan agung atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Dan buatkanlah -wahai Rasul- untuk orang-orang yang tertipu dengan kehidupan dunia ini suatu perumpamaan. Perumpamaan dunia dalam kefanaan dan berlalunya secara cepat, ibarat air hujan yang Kami turunkan dari langit, lalu dengan air ini tumbuh dan suburlah tumbuh-tumbuhan di bumi, kemudian tumbuh-tumbuhan ini menjadi kering kerontang yang diterbangkan angin ke tempat yang lain, sehingga tanah tempat tumbuhnya tersebut kembali seperti sedia kala. Dan sungguh Allah Maha Kuasa atas segala sesuatu, tidak ada yang bisa membuatnya lemah, Dia menghidupkan apa yang Dia kehendaki dan membinasakan pula apa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Hai Nabi, katakanlah kepada manusia perumpamaan kehidupan dunia tentang keindahannya dan cepatnya ia lenyap yang seperti air hujan yang turun dari langit, kemudian menumbuhkan tumbuhan rimbun yang berbuah lebat, lalu tidak lama setelah itu tumbuhan tersebut kering dan beterbangan diterpa angin sehingga tidak tersisa apapun. Dan Allah Maha Kuasa atas segala sesuatu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَاضْرِبْ لَهُم مَّثَلَ الْحَيَوٰةِ الدُّنْيَا (Dan berilah perumpamaan kepada mereka (manusia), kehidupan dunia) Yakni sebutkanlah kepada mereka sesuatu yang serupa dengan kehidupan dunia dalam keindahan dan kehancurannya yang cepat. فَاخْتَلَطَ بِهِۦ نَبَاتُ الْأَرْضِ (maka menjadi subur karenanya tumbuh-tumbuhan di muka bumi) Yakni karena air yang cukup sampai tanaman itu tumbuh dengan sempurna. فَأَصْبَحَ(kemudian tumbuh-tumbuhan itu) Yakni tanaman itu. هَشِيمًا(menjadi kering) Makna (الهشيم) yakni tanaman yang patah-patah dan tercerai berai setelah menjadi kering. تَذْرُوهُ الرِّيٰحُ ۗ(yang diterbangkan oleh angin) Yakni potongan-potongan tanaman itu tersebar ke segenap penjuru, sehingga tanahnya kembali gersang. Begitulah kehidupan dunia yang sirna dan tidak dapat kekal. وَكَانَ اللهُ عَلَىٰ كُلِّ شَىْءٍ مُّقْتَدِرًا(Dan adalah Allah, Maha Kuasa atas segala sesuatu) Allah menghidupkan dan mematikan dengan kuasa-Nya, tidak ada yang tidak dapat Dia lakukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Kenapa Allah menserupakan dunia dengan air? karena air sifatnya tidak dapat menetap selamanya di suatu tempat, begitu halnya dengan dunia yang tinggal hanya dalam satu keadaan saja, dan karena air tidak dapat terus mengalir dengan lurusnya dalam keadaan yang tetap, dan siapapun tidak dapat masuk ke dalam air dan ia tidak basah. juga dengan dunia tidak satupun dari makhluk yang akan selamat dari fitnah di dalamnya, dan juga air yang tersedia dengan batasannya yag telah di tentukan akan lebih bermanfaat, jika dibandingakan saat air itu meluap bahkan ia akan memberi mdorot dan kerusakan, sebagamana juga dengan dunia jika manusia hidup di dalamnya dengan memperhatikan batasan-batasan yang ditenukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Berilah perumpamaan kepada mereka orang-orang yang sombong, bahwa kehidupan dunia sebagai air hujan yang Kami turunkan dari langit, maka tumbuh-tumbuhan di muka bumi menjadi subur karenanya. Kemudian tumbuh-tumbuhan itu berubah menjadi kering sehingga terbang oleh angin. Hingga tidak berbekas apa-apa. Allah Maha Kuasa atas segala sesuatu baik menghidupkan ataupun mematikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Buatkanlah untuk mereka perumpamaan kehidupan dunia ini yaitu layaknya air yang Kami turunkan dari langit sehingga menjadi subur dengannya} dengan air itu {tumbuh-tumbuhan di bumi, kemudian menjadi kering kerontang} hancur dan lenyab {yang diterbangkan} dicabik-cabik dan dihancurkan {oleh angin. Dan Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. Allah berfirman pertama-tama kepada NabiNYa, dan terarah kepada orang yang mewarisi (misinya) sepeninggal beliau secara otomatis, “Buatkanlah untuk manusia, “perumpamaan kehidupan dunia,” agar mereka mengimajinasikannya dengan benar dan mengetahui (seluk-beluknya) zahir dan batin, membandingkannya dengan kampung akhirat, dan mengutamakan manakah yang seharuusnya dikedepankan. Sesungguhnya permisalan kehidupan dunia, ibarat air hujan yang turun ke tanah. Kemudian tumbuh-tumbuhan menjadi subur, menumbuhkan segala macam tanaman yang sedap dipandang. Pada saat perhiasan dan keindahannya menyebabkan para pemandangnya senang dan membuat orang-orang yang menyaksikannya ceria serta menawan pandangan-pandangan insan-insan yang lalai, tiba-tiba ia berubah menjadi “kering yang diterbangkan oleh angina,” akibatnya, tanaman yang indah dan bunga yang memikat serta panorama yang menarik menjadi sirna. Tanah menjadi penuh dengan debu. Focus pandangan pun beralih darinya, mata-mata berpaling darinya, menyebabkan hati sesak. Demikian pula kondisi dunia, di saat pemiliknya terpukau dengan masa mudanya, berhasil mengalahkan kawan-kawan dan teman-teman dalam masalah ini, menggemgam dirham dan dinar, memunguti bunga-bunga kelezatannya, larut dalam kenikmatan-kenikmatannya di seluruh waktunya, dan dia pun menyangka akan senantiasa berada di dalamnya di seluruh hari-harinya, sekonyong-konyong kematian mendatanginya atau kehancuran menimpa harta bendanya, kegembiraannya pun pudar, kelezatan dan kegirangannya hilang. Hatinya sesak karena didera berbagai macam kepedihan. Dia pun terpisah dengan masa mudanya, kekuatan, dan kekayaannya. Tinggal sendirian ditemani amal baik atau buruknya. Pada saat itulah, orang zhalim mengigit dua tangannya lantaran mengetahui kondisinya yang nyata dan berangan-angan bisa kembali ke dunia (untuk memperbaiki diri). Bukan untuk menuntaskan nafsu syahwatnya, akan tetapi dalam upaya menambal kukurangan-kekurangan yang dia kerjakan berupa kelalaian-kelalaian, dengan taubat dan beramal shalih. Orang yang cerdik lagi berkepribadian kuat yang meraih taufik (dari Allah) menghadirkan kondisi ini ke hadapan matanya. Kemudian berkata kepada dirinya sendiri, “Anggap saja bahwa engkau sudah mati, dan pasti engkau akan mati, kondisi manakah yang engkau pilih, tertipu dengan keindahan tempat ini (dunia) dan bersenang-senang layaknya binatang-binatang ternak yang sedang berkeliaran, ataukah beramal untuk tempat yang perjamuannya abadi dan naungannya (pun demikian). Di dalamnya terdapat apa saja yang diinginkan oleh hati dan sedap (dipandang) mata. Dengan ini bisa diketahui, apakah seorang hamba mendapatkan taufik atau tersia-siakan, memperoleh keuntungan atau kerugian.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 45: Ayat ini menerangkan, bahwa kesenangan dunia hanya sementara sehingga tidak pantas dkejar secara berlebihan. Dalam ayat ini terdapat petunjuk agar kita bersikap zuhud terhadap dunia. Sehingga tanamannya tumbuh dengan indah. Seperti inilah kehidupan dunia. Ketika seseorang menikmati masa muda dan memiliki harta yang banyak, serta bersenang-senang dengan keduanya dan sampai mengira bahwa dirinya akan tetap terus seperti itu, tiba-tiba maut datang menjemput atau hartanya binasa, kesenangannya pun hilang dan kenikmatannya pun lenyap, sehingga tinggalah ia dengan amal salehnya atau amal buruknya. Ketika itu orang yang zalim menggigit jarinya saat mengetahui hakikat keadaan dirinya dan berangan-angan untuk kembali ke dunia, bukan untuk melanjutkan memuaskan hawa nafsunya, tetapi untuk mengejar kelalaiannya dahulu dengan tobat dan amal saleh. Orang yang berakal lagi mendapat taufik tentu akan melihat dirinya dan berkata kepada dirinya, “Engkau akan mati, dan memang pasti mati, namun tempat manakah yang engkau pilih? Apakah tempat yang kenikmatannya sementara ataukah kenikmatan yang kekal abadi?” Tentu ia akan memilih tempat yang kesenangannya kekal abadi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 45",
    "description": "Dan berilah perumpamaan kepada mereka, semua manusia, bahwa kehidupan dunia adalah seperti air hujan yang kami turunkan dari langit, lalu menyirami tumbuh-tumbuhan maka bercampurlah dengannya tumbuhtumbuhan di muka bumi, dengan siraman air, tumbuh-tumbuhan itu menjadi subur, kemudian tidak lama sesudah itu tumbuh-tumbuhan itu menjadi kering yang diterbangkan oleh angin. Dan adalah Allah mahakuasa atas segala sesuatu. Dia mahakuasa menyuburkan tumbuh-tumbuhan dan mahakuasa pula menjadikannya layu dan kering kerontang. Demikianlah perumpamaan kehidupan dunia. Kesenangan dan kebahagiaan tidak kekal di dalamnya dan tidak berlangsung selama-lamanya. Harta dan anak-anak adalah perhiasan kehidupan dunia, baik dan indah sifatnya serta bermanfaat bagi manusia, tetapi dapat memperdaya dan tidak kekal; tetapi amalan-amalan yang kekal lagi saleh yang dilakukan karena Allah dan sesuai tuntunan agama adalah lebih baik pahalanya di sisi tuhanmu serta lebih baik untuk menjadi harapan yang dapat membawa kepada kebahagiaan yang kekal sampai di akhirat nanti."
  }
]