[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Harta benda dan anak-anak adalah keindahan dan kekuatan di dunia yang fana ini, sedang amal-amal shalih (terutama bacaan tasbih, tahmid, dan takbir, serta tahlil) lebih besar pahalanya di sisi tuhanmu daripada kekayaan dan anak keturunan. Amal-amal shalih ini adalah hal yang paling utama diharapkan oleh manusia yang dapat menghasilkan pahala di sisi tuhannya, sehingga dia di akhirat kelak akan memperoleh apa yang diimpikannya di dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Harta dan anak keturunan merupakan bagian dari perhiasan kehidupan dunia. Di akhirat kelak, harta tersebut tidak memberikan manfaat sama sekali kecuali bila ketika di dunia dibelanjakan pada perkara yang diridai Allah. Adapun amalan dan ucapan yang diridai di sisi Allah maka itulah yang lebih baik dari seluruh perhiasan dunia, dan merupakan perkara terbaik yang diharapkan oleh manusia, karena perhiasan dunia itu fana, sedangkan pahala amalan dan ucapan yang diridai di sisi Allah akan senantiasa kekal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Harta dan keturunan merupakan perhiasan dunia; sedangkan amal shalih dan zikir seperti tahlil, tasbih, dan tahmid lebih baik pahalanya dan lebih diharapkan balasannya di sisi Allah. Utsman bin Affan berkata: “Amalan-amalan yang kekal dan shalih adalah kalimat ‘laailaaha illa Allah, Subhanallah, Alhamdulillah, Allahu Akbar, dan laa haula walaa quwwata illa billah’.” (Diriwayatkan oleh Imam Ahmad dalam al-Musnad 1/382; pentahqiqnya berkata: sanadnya shahih. Dan diriwayatkan oleh Ibnu Jarir dalam tafsirnya 15/511-512, no. 18662. Dan sanadnya dishahihkan oleh as-Suyuthi dalam kitab ad-Durr 4/353). Dan at-Thabari meriwayatkan dengan sanad yang hasan dari Ibnu ‘Abbas, ia berkata: “amalan-amalan yang kekal dan shalih adalah ucapan zikir laailaaha illa Allah, Allahu Akbar, Subhanallah, Alhamdulillah, Tabarakallah, laa haula walaa quwwata illa billah, Astaghfirullah, Shalawat kepada Rasulullah; dan puasa, shalat, haji, sedekah, memerdekakan budak, jihad, menyambung silaturrahim, dan seluruh amalan baik. Itu semua merupakan amalan-amalan kekal dan baik yang akan kekal bagi pelakunya di surga selama masih ada langit dan bumi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. الْمَالُ وَالْبَنُونَ زِينَةُ الْحَيَوٰةِ الدُّنْيَا ۖ (Harta dan anak-anak adalah perhiasan kehidupan dunia) Yakni harta dan anak-anak yang digunakan untuk perhiasan di dunia yang tidak dijadikan untuk meraih keridhaan Allah, bukan yang dimanfaatkan untuk mendapat kehidupan akhirat. وَالْبٰقِيٰتُ الصّٰلِحٰتُ(tetapi amalan-amalan yang kekal lagi saleh) Ykani segala amal kebaikan, baik itu yang diraih dengan mengeluarkan harta atau yang diraih dengan mengerahkan tenaga. Maka amalan itu tetap terjaga di sisi Allah. خَيْرٌ عِندَ رَبِّكَ ثَوَابًا(lebih baik pahalanya di sisi Tuhanmu) Yakni lebih baik pahalanya daripada perhiasan dari harta dan anak keturunan, serta lebih banyak manfaatnya bagi pemiliknya. وَخَيْرٌ أَمَلًا(serta lebih baik untuk menjadi harapan) Yakni lebih baik daripada harapan yang diinginkan oleh pemilik harta dan anak keturunan. Imam Ahmad dan Ibnu Hibban mengeluarkan hadits dari Abu Sa’id al-Khudri bahwa Rasulullah bersabda: “Perbanyaklah amalan-amalan kebaikan yang kekal.” Beliau ditanya: “Apa itu amalan-amalan kebaikan yang kekal wahai Rasulullah?” beliau menjawab: “Itu adalah kalimat takbir, tahlil, tasbih, tahmid, dan laahaula walaa quwwata illaa billaah.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). 'ALi bin Abi Thalib berkata : Harta dan anak-anak adalah sebatas keuntungan dunia, sedangkan amalan shalih adalah keuntungan akhirat, dan terkadang Allah menggabungkan keduanya bagi kaum yang ia kehendaki. 2 ). Harta dan anak-anak disebut sebagai perhiasan dunia' karena dari harta seseorang mendaparkan keindahan dan kemanfaatan, sedangkan dari anak-anak ia mendapatkan kekuatan dan dukungan, itulah makanya disebut sebagai perhiasan dunia. 3 ). Dalam ayat penyebutan harta didahulukan sebelum penyebutan anak-anak; hal itu karena harta lebih utama dalam pikiran sebagian besar manusia; dan karena disukai oleh semua kalangan dari yang kecil sampai yang besar, muda dan tua. 4 ). { وَٱلْبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا وَخَيْرٌ أَمَلًا } \"tetapi amalan-amalan yang kekal lagi saleh adalah lebih baik pahalanya di sisi Tuhanmu serta lebih baik untuk menjadi harapan\" , { وَٱلْبَٰقِيَٰتُ ٱلصَّٰلِحَٰتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا وَخَيْرٌ مَّرَدًّا } \"Dan amal-amal saleh yang kekal itu lebih baik pahalanya di sisi Tuhanmu dan lebih baik kesudahannya\" [ Maryam : 76 ] Al-baqiyat as-Shalihat dapat dimaknai juga dengan kalimat-kalimat dzikir yang diriwayatkan dengan shahih yang paling utamanya adalah : سُبْحَانَ اللهِ، وَالْحْمدُ لِلهِ، وَلَا إِلهَ إِلَّا اللهُ، وَاللهُ أَكْبَرُ , dan barangsiapa yang belum ditaqdirkan untuk datang ke baitul harom, karena halangan atau sakit, maka janganlah ia terlewatkan pada 10 hari dari bulan dzul hijjah oleh amalan-amalan yang tidak kalah penting dari jihad di jalan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Harta dan anak-anak adalah perhiasan kehidupan dunia tetapi amalan-amalan yang kekal lagi saleh jauh lebih baik pahalanya di sisi Tuhanmu serta lebih baik untuk menjadi harapan kehidupan yang bahagia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Harta dan anak-anak adalah perhiasan kehidupan dunia, dan amal shalih} setiap amal shalih berupa perkataan dan perbuatan {itu lebih baik balasannya di sisi Tuhanmu dan lebih baik untuk menjadi harapan} dan sesuatu yang lebih utama untuk diharapkan manusia di sisi Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Oleh karena itu, Allah memberitahukan bahwa kekayaan dan anak-anak adalah “perhiasan kehidupan dunia,” maksudnya tidak ada fungsi lainnya. Perkara yang abadi bagi seorang manusia, bermanfaat dan membahagiakannya adalah amalan-amalan yang kekal lagi shalih. Ini mencakup seluruh jenis ketaatan yang wajib atau sunnah, yang bertalian dengan hak-hak Allah dan hak-hak sesame manusia, berupa shalat, zakat, sedekah, haji, umrah, bertasbih, (mengucapkan) tahmid, tahlil dan [takbir], membaca (al-Quran), mencari ilmu yang bermanfaat, melakukan amar ma’ruf dan nahi munkar, menjalin tali silaturahim, berbakti kepada kedua orang tua, melaksanakan hak-hak istri-istri, budak-budak dan hewan-hewan serta seluruh jenis perbuatan baik yang ditujukan kepada sesame manusia. Ini semua termasuk baqiyyatus shalihat (amalan-amalan yang kekal lagi shlaih). Amal perbuatan ini lebih baik pahalanya di sisi Allah, dan lebih baik untuk menjadi harapan. Pahalanya lestari dan berlipat ganda selama lamanya. Ganjaran, kebaikan, dan kegunaan amalan itu senantiasa di harap-harap di waktu yang diperlukan. Inilah yang sepatutnya (menjadi ajang) perlombaan bagi orang-orang yang berlomba dan (wahana) adu cepat bagi orang-orang yang beramal, serta (menjadi media) ketekunan untuk meraihnya bagi orang-orang yang bersungguh-sungguh. Cermatilah, bagaimana Allah menggariskan perumpamaan dunia dan kondisinya serta kepudarannya, Allah menyebutkan bahwa di dalamnya terdapat dua macam (hakikat) : jenis (pertama) yang menjadi sumber keindahannya yang akan dinikmati sejenak kemudian lenyap tanpa faidah yang kembali bagi pemiliknya. Dan bahkan tidak menutup kemungkinan dia terkena kemudaratannya yaitu harta dan anak. Dan jenis (kedua) yang abadi bagi pemiliknya secara lestari, yaitu baqiyyatush shalihat (amalan yang kekal lagi shalih)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 46: Amal kebajikan yang terus menerus di sini mencakup semua ketaatan yang wajib maupun yang sunat; baik terkait dengan hak Allah maupun hak manusia. Misalnya shalat, zakat, puasa, sedekah, haji, umrah, dzikr seperti ucapan “Subhaanallah wal hamdulillah wa laailaaha illallah wallahu akbar wa laa haula wa laa quwwata illaa billah,” membaca Al Qur’an, mencari ilmu yang bermanfaat, beramar ma’ruf dan bernahi munkar, silaturrahim, berbakti kepada orang tua, memenuhi hak istri, anak, budak, pembantu, hewan ternak, dan berbagai bentuk ihsan lainnya kepada orang lain. Karena pahalanya akan kekal dan berlipat ganda. Pahala, kebaikan dan manfaatnya diharapkan ketika dibutuhkan. Perhatikanlah bagaimana Allah Subhaanahu wa Ta'aala setelah membuat perumpamaan tentang kehidupan dunia dan keadaannya yang sementara, menyebutkan bahwa di dalam kehidupan dunia itu ada dua bagian; bagian yang menjadi perhiasannya, di mana dengannya seseorang dapat bersenang-senang namun hanya sementara dan kemudian akan lenyap dan hilang tanpa faidah yang kembali kepada pelakunya, bahkan terkadang ia malah mendapatkan madharratnya, yaitu harta dan anak. Sedangkan bagian yang kedua adalah bagian yang kekal dan bermanfaat terus menerus bagi pelakunya, itulah amal saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 46",
    "description": "Harta dan anak-anak adalah perhiasan kehidupan dunia, baik dan indah sifatnya serta bermanfaat bagi manusia, tetapi dapat memperdaya dan tidak kekal; tetapi amalan-amalan yang kekal lagi saleh yang dilakukan karena Allah dan sesuai tuntunan agama adalah lebih baik pahalanya di sisi tuhanmu serta lebih baik untuk menjadi harapan yang dapat membawa kepada kebahagiaan yang kekal sampai di akhirat nanti. Dan ingatlah pada hari yang ketika itu kami perjalankan gununggunung, yakni kami hancurkan sehingga ia menjadi bagai kapas yang beterbangan, dan engkau akan melihat bumi itu rata karena tidak ada lagi gunung, tanaman ataupun bangunan, dan kami kumpulkan mereka di padang mahsyar, tempat berkumpulnya seluruh manusia baik yang hidup dahulu maupun kemudian, dan tidak kami tinggalkan seorang pun dari mereka di dalam kuburnya, yakni di alam barzakh."
  }
]