[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatkanlah kepada mereka wahai rasul, hari dimana Kami akan melenyepkapkan gunung-gunung dari tempat-tempatnya, dan kamu akan melihat bumi tampak datar, tidak ada seseuatupun di permukaanya yang menutupinya sebelumnya berada di atasnya, yaitu makhluk-makhluk, dan kami kumpulkan manusia-manusia terdahulu dan orang-orang belakangan menuju tempat hisab. Dan Kami tidak meninggalkan seorangpun dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan ingatlah pada hari ketika Kami hilangkan gunung-gunung dari tempat asalnya, sehingga engkau melihat seluruh bumi itu tampak rata karena tidak ada gunung-gunung, pepohonan dan bangunan-bangunan. Lalu Kami kumpulkan seluruh makhluk dan Kami sama sekali tidak meninggalkan seorang pun dari mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47-48. Hai Rasulullah, peringatkanlah manusia dari hari ketika Kami melenyapkan gunung-gunung dari tempatnya, dan saat kamu melihat bumi menjadi kosong dari makhluk-makhluk yang dahulu ada di atasnya; dan Kami kumpulkan seluruh manusia dari yang terdahulu sampai yang terakhir untuk dihisab, dan Kami tidak akan melewatkan seorangpun, mereka semua akan dihadapkan kepada Tuhan semesta alam dengan berbaris-baris, tidak ada seorangpun yang terhalangi. Ketika itu akan dikatakan kepada orang-orang kafir: “Sungguh kalian telah menghadap Kami dalam keadaan tidak beralas kaki dan tidak berbusana sebagaimana keadaan kalian ketika Kami ciptakan pertama kali, namun kalian mengira tidak akan ada hati kebangkitan dan pembalasan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَيَوْمَ نُسَيِّرُ الْجِبَالَ (Dan (ingatlah) akan hari (yang ketika itu) Kami perjalankan gunung-gunung) Makna (تيسير الجبال) adalah mengangkat gunung-gunung itu dari tempatnya kemudian menjadikannya berjalan seperti awan yang berjalan. Hal ini akan terjadi di hari kiamat, sebagaimana disebutkan pada ayat lain: ويسألونك عن الجبال فقل ينسفها ربي نسفا. فيذرها قاعا صفصفا لا ترى فيها عوجا ولا أمتا “Dan mereka bertanya kepadamu tentang gunung-gunung, maka katakanlah: \"Tuhanku akan menghancurkannya (di hari kiamat) sehancur-hancurnya. Maka Dia akan menjadikan (bekas) gunung-gunung itu datar sama sekali, tidak ada sedikitpun kamu lihat padanya tempat yang rendah dan yang tinggi-tinggi.” (Ta Ha: 105-107) وَتَرَى الْأَرْضَ بَارِزَةً(dan kamu akan dapat melihat bumi itu datar) Yakni tanahnya terlihat karena gunung-gunung, pepohonan, dan bangunan yang menutupinya akan hilang. وَحَشَرْنٰهُمْ (dan Kami kumpulkan seluruh manusia) Yakni Kami akan mengumpulkan seluruh makhluk dari segala tempat menuju ke padang mahsyar setelah mereka dibangkitkan. فَلَمْ نُغَادِرْ مِنْهُمْ أَحَدًا (dan tidak kami tinggalkan seorangpun dari mereka) Yakni semuanya akan Kami kumpulkan di sana, tidak ada yang tertinggal satupun dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Ingatlah akan hari ketika Kami perjalankan gunung-gunung dari tempat asalnya laksana awan, yaitu pada hari kiamat. Dan kamu akan dapat melihat bumi itu datar dan tidak ada sesuatu apapun. Kemudian Kami kumpulkan seluruh manusia, tidak kami tinggalkan seorangpun dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari (ketika) Kami memperjalankan gunung-gunung} memindahkan gunung-gunung dari tempatnya {dan kamu melihat bumi itu rata} menjadi rata dengan jelas karena segala sesuatu di permukaannya lenyap {Kami mengumpulkan mereka} Kami mengumpulkan mereka {dan Kami tidak meninggalkan} Kami tidak membiarkan {seorang pun dari mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47-48. Allah mengabarkan tentang kondisi Hari KIamat bersama kengerian-kengerian yang merisaukan (perasaan) dan kedahsyatan-kedahsyatan yang menyentak. Allah berfirman, “Dan (ingatlah) akan hari (yang ketika itu) Kami perjalankan gunung-gunung,” maksudnya, Kami memusnahkannya dari tempat-tempatnya, menjadikannya kumpulan pasir, lantas menjelmakannya ibarat bulu yang dihambur-hamburkan, kemudian pudar dan hancur. Akhirnya, menjadi debu yang beterbangan. Bumi terpampang dan menjadi betul-betul datar, tidak ada tempat yang rendah maupun tinggi. Allah mengumpulkan semua makhluk di permukaan bumi itu, tidak meninggalkan seorang pun dari mereka. Dia menghimpun generasi manusia pertama dari perut-perut padang pasir dan dasar-dasar lautan. Dia mengumpulkan mereka setelah terpisah-pisah, dan mengembalikan bentuk mereka setelah terkoyak-koyak menjadi bentuk yang baru. Kemudian, mereka dihadapkan kepada Allah dengan berbaris untuk dilihat amalan-amalan mereka, menjatuhkan keputusan tentang mereka dengan keputusan yang adil, tanpa ada unsur kecurangan atau kezhaliman di dalamnya. Dia berkata kepada mereka, “Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada kali yang pertama,” maksudnya dalam keadaan tanpa mempunyai kekayaan, istri, dan keluarga. Tidak ada yang bersama menyertai mereka kecuali amal perbuatan yang telah mereka perbuat dan usaha-usaha dalam kebajikan maupun keburukan yang telah mereka kerjakan. Sebagaimana Firman Allah, \"Dan sesungguhnya kamu datang kepada Kami sendiri-sendiri sebagaimana kamu Kami ciptakan pada mulanya, dan kamu tinggalkan di belakangmu (di dunia) apa yang telah Kami kurniakan kepadamu; dan Kami tiada melihat besertamu pemberi syafaat yang kamu anggap bahwa mereka itu sekutu-sekutu Tuhan di antara kamu. Sungguh telah terputuslah (pertalian) antara kamu dan telah lenyap daripada kamu apa yang dahulu kamu anggap (sebagai sekutu Allah).\" (Al-An’am:94). Di sini, Allah mengarahkan pembicaraan kepada kaum yang mengingkari kebangkitan saat mereka menyaksikan kenyataannya “bahkan kamu mengklaim bahwa Kami sekali-kali tidak akan menetapkan bagi kamu waktu (memenuhi) perjanjian,” maksudnya kalian mengingkari Hari Pembalasan atas amal perbuatan dan janji serta ancamanNya. Ketahuilah, sungguh kalian sudah melihat dan merasakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 47: Di ayat ini, Allah Subhaanahu wa Ta'aala memberitakan tentang keadaan pada hari kiamat, dan apa yang terjadi pada hari itu berupa peristiwa yang dahsyat dan mengerikan. Yakni dengan menyingkirkannya dari tempatnya, lalu gunung-gunung itu dijadikan-Nya seperti bulu yang dihambur-hamburkan dan debu yang bertebaran, bumi pun nampak rata dan tidak terlihat tempat yang rendah dan yang tinggi di sana. Ketika itu, Allah Subhaanahu wa Ta'aala menghimpun manusia semuanya di bumi itu, yang terdahulu maupun yang datang kemudian, baik yang ada di perut bumi, dasar lautan, dan menghimpun mereka setelah mereka terpisah-pisah, mengembalikan mereka setelah mereka menjadi tulang-belulang sebagai makhluk yang baru, kemudian mereka dihadapkan kepada Allah sambil berbaris, agar Dia melihat amal mereka dan memberikan keputusan untuk mereka dengan adil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 47",
    "description": "Dan ingatlah pada hari yang ketika itu kami perjalankan gununggunung, yakni kami hancurkan sehingga ia menjadi bagai kapas yang beterbangan, dan engkau akan melihat bumi itu rata karena tidak ada lagi gunung, tanaman ataupun bangunan, dan kami kumpulkan mereka di padang mahsyar, tempat berkumpulnya seluruh manusia baik yang hidup dahulu maupun kemudian, dan tidak kami tinggalkan seorang pun dari mereka di dalam kuburnya, yakni di alam barzakh. Dan mereka pasti akan dibawa ke hadapan tuhanmu dengan berbaris satu saf atau banyak saf. Ketika itu Allah berfirman kepada orangorang yang tidak percaya kepada hari kebangkitan, sesungguhnya kamu datang kepada kami, sesudah kami bangkitkan dari kematianmu sebagaimana kami menciptakan kamu pada pertama kali. Kamu datang kepada kami dalam keadaan sendiri-sendiri, tanpa harta, anak, pakaian dan alas kaki, seperti ketika kamu dilahirkan, bahkan ketika kamu di dunia kamu menganggap bahwa kami tidak akan menetapkan bagi kamu waktu berbangkit untuk memenuhi perjanjian, yakni janji Allah untuk memberi setiap manusia balasan sesuai dengan amal perbuatannya."
  }
]