[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka semua dihadapkan di depan tuhanmu dengan berbaris-baris, tidak ada seorangpun dari mereka yang tertutupi. Dan sungguh kami telah membangkitkan kalian (dari kematian) dan kalain datang kepada kami sendiri-sendiri, tidak ada harta dan anak yang menyertai kalian, sebagaimana sebelumnya Kami menciptakan kalian pertama kali, Bahkan kalian menyangka Kami sekali-kali tidak akan menentukan bagi kalian waktu untuk membangkitkan kalian, dan membalasi kalian atas semua perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Dan seluruh manusia akan dihadapkan kepada Tuhan mereka dengan berbaris-baris, lalu Dia menghisab mereka, dan dikatakan kepada mereka, \"Sesungguhnya kalian datang kepada kami sendiri-sendiri dalam keadaan telanjang kaki, telanjang badan dan tidak dikhitan sebagaimana keadaan kalian ketika Kami ciptakan pertama kali, namun anehnya kalian mengklaim bahwa kalian tidak akan dibangkitkan, dan bahwasanya Kami tidak akan menetapkan bagi kalian waktu dan tempat untuk memberikan balasan atas amalan-amalan kalian.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. وَعُرِضُوا۟ عَلَىٰ رَبِّكَ صَفًّا لَّقَدْ جِئْتُمُونَا (Dan mereka akan dibawa ke hadapan Tuhanmu dengan berbaris. Sesungguhnya kamu datang kepada Kami) Yakni Kami akan katakan kepada mereka “lihatlah kini kalian telah datang kepada Kami.” كَمَا خَلَقْنٰكُمْ أَوَّلَ مَرَّةٍۭ ۚ(sebagaimana Kami menciptakan kamu pada kali yang pertama) Yakni dalam keadaan tidak beralas kaki, telanjang, dan belum disunat, sebagaimana disebutkan dalam hadits. بَلْ زَعَمْتُمْ أَلَّن نَّجْعَلَ لَكُم مَّوْعِدًا(bahkan kamu mengatakan bahwa Kami sekali-kali tidak akan menetapkan bagi kamu waktu (memenuhi) perjanjian) Yakni kalian di dunia mengatakan bahwa kalian tidak akan dibangkitkan dan Kami tidak akan menetapkan waktu untuk membalas perbuatan kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Mereka akan dibawa ke hadapan Tuhanmu dengan berbaris-baris. Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pertama kali. Bahkan kamu mengatakan dan menyangka waha para pengingkar hari kebangkitan bahwa Kami sekali-kali tidak akan menetapkan waktu untuk memenuhi perjanjian kepadamu untuk kebangkitan dan penghisaban"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka dibawa ke hadapan Tuhanmu dengan berbaris} dengan berbaris {“Sungguh kalian telah datang kepada Kami, sebagaimana Kami menciptakan kalian pertama kali} seperti Kami menciptakan kalian pertama kali satu demi satu tanpa alas kaki dan telanjang tanpa dikhitan {Bahkan kalian menganggap bahwa Kami tidak akan menetapkan bagi kalian waktu perjanjian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47-48. Allah mengabarkan tentang kondisi Hari KIamat bersama kengerian-kengerian yang merisaukan (perasaan) dan kedahsyatan-kedahsyatan yang menyentak. Allah berfirman, “Dan (ingatlah) akan hari (yang ketika itu) Kami perjalankan gunung-gunung,” maksudnya, Kami memusnahkannya dari tempat-tempatnya, menjadikannya kumpulan pasir, lantas menjelmakannya ibarat bulu yang dihambur-hamburkan, kemudian pudar dan hancur. Akhirnya, menjadi debu yang beterbangan. Bumi terpampang dan menjadi betul-betul datar, tidak ada tempat yang rendah maupun tinggi. Allah mengumpulkan semua makhluk di permukaan bumi itu, tidak meninggalkan seorang pun dari mereka. Dia menghimpun generasi manusia pertama dari perut-perut padang pasir dan dasar-dasar lautan. Dia mengumpulkan mereka setelah terpisah-pisah, dan mengembalikan bentuk mereka setelah terkoyak-koyak menjadi bentuk yang baru. Kemudian, mereka dihadapkan kepada Allah dengan berbaris untuk dilihat amalan-amalan mereka, menjatuhkan keputusan tentang mereka dengan keputusan yang adil, tanpa ada unsur kecurangan atau kezhaliman di dalamnya. Dia berkata kepada mereka, “Sesungguhnya kamu datang kepada Kami, sebagaimana Kami menciptakan kamu pada kali yang pertama,” maksudnya dalam keadaan tanpa mempunyai kekayaan, istri, dan keluarga. Tidak ada yang bersama menyertai mereka kecuali amal perbuatan yang telah mereka perbuat dan usaha-usaha dalam kebajikan maupun keburukan yang telah mereka kerjakan. Sebagaimana Firman Allah, \"Dan sesungguhnya kamu datang kepada Kami sendiri-sendiri sebagaimana kamu Kami ciptakan pada mulanya, dan kamu tinggalkan di belakangmu (di dunia) apa yang telah Kami kurniakan kepadamu; dan Kami tiada melihat besertamu pemberi syafaat yang kamu anggap bahwa mereka itu sekutu-sekutu Tuhan di antara kamu. Sungguh telah terputuslah (pertalian) antara kamu dan telah lenyap daripada kamu apa yang dahulu kamu anggap (sebagai sekutu Allah).\" (Al-An’am:94). Di sini, Allah mengarahkan pembicaraan kepada kaum yang mengingkari kebangkitan saat mereka menyaksikan kenyataannya “bahkan kamu mengklaim bahwa Kami sekali-kali tidak akan menetapkan bagi kamu waktu (memenuhi) perjanjian,” maksudnya kalian mengingkari Hari Pembalasan atas amal perbuatan dan janji serta ancamanNya. Ketahuilah, sungguh kalian sudah melihat dan merasakannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 48: Yakni sendiri-sendiri, tidak beralas kaki, telanjang dan belum disunat. Demikian pula tanpa membawa harta dan keluarga, bahkan yang dibawa adalah amal yang mereka kerjakan baik atau buruk. Lalu dikatakan kepada orang-orang yang mengingkari kebangkitan. Yang dimaksud dengan waktu di sini ialah hari kebangkitan yang telah dijanjikan Allah untuk menerima balasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 48",
    "description": "Dan mereka pasti akan dibawa ke hadapan tuhanmu dengan berbaris satu saf atau banyak saf. Ketika itu Allah berfirman kepada orangorang yang tidak percaya kepada hari kebangkitan, sesungguhnya kamu datang kepada kami, sesudah kami bangkitkan dari kematianmu sebagaimana kami menciptakan kamu pada pertama kali. Kamu datang kepada kami dalam keadaan sendiri-sendiri, tanpa harta, anak, pakaian dan alas kaki, seperti ketika kamu dilahirkan, bahkan ketika kamu di dunia kamu menganggap bahwa kami tidak akan menetapkan bagi kamu waktu berbangkit untuk memenuhi perjanjian, yakni janji Allah untuk memberi setiap manusia balasan sesuai dengan amal perbuatannya. Dan diletakkanlah, yakni diberikan kepada semua manusia kitab yang merinci amal perbuatan mereka di dunia baik yang besar maupun yang kecil, lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang tertulis di dalamnya. Mereka menyesal atas kejahatan perbuatannya ketika di dunia, dan mereka berkata, betapa celaka kami, kitab apakah ini, betapa menakjubkan, karena tidak ada yang tertinggal di dalamnya, yang kecil dan yang besar dari amal perbuatan manusia melainkan tercatat semuanya, dan mereka mendapati semua apa yang telah mereka kerjakan di dunia tertulis di dalamnya. Dan tuhanmu tidak menzalimi seorang jua pun. Amal perbuatan mereka semuanya tercatat secara sempurna dan mendapatkan pembalasan yang sesuai."
  }
]