[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diletakkanlah kitab catatan amal perbuatan setiap orang di tangan kanan atau tangan kirinya. maka orang-orang yang berbuat maksiat melihat dengan penuh ketakutan terhadap isinya akibat apa yang telah mereka perbuat dahulu berupa kejahatan-kejahatan mereka, dan mereka ketika melihatnya dengan mata kepala mereka, mengatakan, ”celaka kami! kenapa kitab ini tidak meninggalkan yang kecil-kecil dari perbuatan kami dan yang besar-besar kecuali mencatatnya?!” Dan mereka mendapati semua yang mereka lakukan di dunia ada lagi tercatat. Dan tuhanmu tidak menzhalimi seseorang sebesar biji sawi sekalipun, sehingga orang yang taat tidak terkurangi pahalanya dan orang yang bermaksiat tidak ditambah hukumannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Dan kitab catatan amalan pun diletakkan. Ada orang yang mengambil kitabnya dengan tangan kanannya, dan ada yang mengambilnya dengan tangan kirinya. Engkau -wahai insan- akan melihat orang-orang kafir merasa ketakutan terhadap apa yang tertulis di dalamnya karena mereka sudah tahu apa yang telah mereka lakukan, yaitu kekafiran dan maksiat. Mereka berkata, \"Betapa celakanya dan besarnya bencana kami! Sungguh, mengapa kitab ini tidak meninggalkan dosa yang kecil dan yang besar melainkan semuanya tersimpan dan tercatat di dalamnya.\" Dan mereka mendapati semua yang mereka kerjakan dalam kehidupan dunia ini berupa maksiat telah tercatat dan tersimpan. Sungguh -wahai Rasul-, Tuhanmu tidak menzalimi seorang pun, tidak akan menyiksa seseorang tanpa ada dosanya, dan tidak pula mengurangi pahala kebaikan orang-orang yang taat kepada-Nya sedikitpun."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Dan akan diletakkan di setiap tangan manusia kitab amalan mereka; sehingga para pelaku maksiat menjadi ketakutan karena melihat kejahatan dan dosa-dosa yang tertulis di dalamnya, dan mereka berkata: “Sungguh kerugian dan kebinasaan kita atas apa yang telah kita sia-siakan! Kitab apakah ini yang tidak melewatkan segala dosa kecil atau dosa besar?” mereka mendapati segala yang mereka lakukan di dunia tertulis di dalamnya, dan Tuhanmu tidak menzalimi seorangpun sehingga Dia tidak menyiksa seorangpun yang tidak berdosa dan tidak mengurangi pahala orang yang berbuat baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. وَوُضِعَ الْكِتٰبُ (Dan diletakkanlah kitab) Yakni kitab catatan amal yang diletakkan di padang mahsyar untuk memberi perhitungan kepada orang yang melakukan amalan yang tercatat dalam kitab tersebut. فَتَرَى الْمُجْرِمِينَ مُشْفِقِينَ مِمَّا فِيهِ (lalu kamu akan melihat orang-orang bersalah ketakutan terhadap apa yang (tertulis) di dalamnya) Yakni mereka akan ketakutan karena urusan mereka akan tersingkap di depan para makhluk serta karena azab pedih yang akan menjadi balasan mereka. وَيَقُولُونَ يٰوَيْلَتَنَا (dan mereka berkata: “Aduhai celaka kami) Yakni mereka menyeru kebinasaan atas diri mereka. مَالِ هٰذَا الْكِتٰبِ لَا يُغَادِرُ صَغِيرَةً وَلَا كَبِيرَةً إِلَّآ أَحْصَىٰهَا ۚ(kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia mencatat semuanya) Yakni tidak akan meninggalkan suatu kemaksiatan baik itu yang kecil maupun yang besar, semua akan dicatat di dalamnya. Hal ini bagi orang yang melakukan dosa besar dan belum bertaubat. Adapun orang-orang yang meninggalkan dosa besar ketika di dunia maka mereka akan mendapati dosa-dosa kecil dalam kitab amal mereka telah terhapus, sebagaimana dalil yang disebutkan dalam surat an-Nisa: 31. وَوَجَدُوا۟ مَا عَمِلُوا۟ (dan mereka dapati apa yang telah mereka kerjakan) Yakni kemaksiatan yang mereka kerjakan di dunia. حَاضِرًا ۗ (tertulis) Tercantum di dalamnya. وَلَا يَظْلِمُ رَبُّكَ أَحَدًا(Dan Tuhanmu tidak menganiaya seorang juapun) Yakni Allah tidak akan menyiksa seorang hamba-Nya yang tidak berdosa, dan tidak akan mengurangi pahala yang sesuai bagi pelaku ketaatan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Berkata 'Aun bin Abdillah : manusia telah bersorak menangis sejak ia kecil sampai mereka besar. Maka hendaklah kita senantiasa memperhatikan nasihat-nasihat dan peringatan-peringatan dari dosa kecil yang selalu diremehkan oleh banyak orang, padahal bisa saja ia bertumpuk pada diri seseorang yang akhirnya membinaskannya. 2 ). Qatadah berkata: akan ada kaum yang mengeluhkan perhitungan amalan mereka, namun mereka tidak mengeluhkan kezhaliman yang mereka kerjakan dahulu, padahal Allah tidak pernah sekalipun berbuat zhalim kepada hamba-hamba Nya, jauhiah oleh kalian meremehkan dosa-dosa yang kecil. karena sesungguhnya ia akan terus berkumpul dalam diri orang itu sampai ia dibinsakan olehnya. 3 ). Seorang mutadabbir berkata : sejak 20 tahun setiap saya membaca ayat ini, saya merasa bahwa kepada diri ini lah ditujukan ayat ini, dan saya selalu mencoba untuk mengingat-ingat kembali apa saja yang telah saya lakukan dalam sepekan dan saya tahu bahwa keburukan telah ditulis dan akan diangkat pada hari perhitungan dan tidak ada yang akan menyelamatkanku kecuali dengan memperbanyak istighfar dan taubat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Setiap kitab catatan amal diletakkan di atas tangan masing-masing manusia pada saat hari perhitungan. Yang beruntung di sebelah kanan, dan yang celaka di sebelah kiri. Lalu engkau akan melihat orang-orang bersalah ketakutan terhadap apa yang isi dari buku amal itu, dan mereka berkata: \"Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak pula yang besar, melainkan ia mencatat semuanya. Mereka dapati apa yang telah mereka kerjakan tertulis. Dan Tuhanmu tidak menganiaya/menghukum seorangpun tanpa adanya dosa dan tidak berlebihan dalam memberikan imbalan dan hukuman\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan diletakkanlah kitab} catatan amal pada tangan para hamba {lalu kamu akan melihat orang-orang yang berdosa merasa ketakutan} ketakutan {terhadap apa yang ada di dalamnya. Mereka berkata,“Celakalah kami} celakalah dan merugilah kami {kitab apakah ini, tidak meninggalkan} tidak mengabaikan {yang kecil dan tidak pula yang besar, kecuali mencatatnya”} kecuali mencatat dan menghitungnya {Mereka mendapati apa yang telah mereka kerjakan tertulis} tertulis lagi terekam {Tuhanmu tidak menzalimi seorang pun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Pada waktu itulah, buku-buku catatan amal perbuatan yang telah ditulis oleh para malaikat yang berbakti dihadirkan. Maka hati manusia melayang-layang (kosong) dan kesulitan-kesulitan semakin berat saja lantaran kejadian itu. Hampir-hampir gunung-gunung yang kokoh terkikis habis karenanya. Orang-orang jahat pun merasa ketakutan. Bila mereka menyaksikan amal perbuatan mereka terbukukan, ucapan-ucapan dan tindak tanduk mereka di perhitungkan, maka mereka berkata, “Aduhai celaka kami, kitab apakah ini yang tidak meninggalkan yang kecil dan tidak (pula) yang besar, melainkan ia (pasti) mencatat semuanya,” maksudnya kitab ini tidak meninggalkan perbuatan kecil dan besar melainkan ia pasti tercatat lagi terpelihara di dalamnya, tidak terlewatkan amalan yang sembunyi-sembunyi atau terang-terangan, di malam dan siang hari “dan mereka mendapati amal yang telah mereka kerjakan ada (tertulis).” Mereka tidak berdaya untuk mengingkarinya, “dan Rabbmu tidak menganiaya seorang pun jua.” Saat itu, mereka diberi balasan atas amalannya dan dimintai pengakuan atasnya, ditimpa kehinaan serta jatuhlah siksaan pada mereka. \"(Azab) yang demikian itu adalah disebabkan perbuatan tanganmu sendiri, dan bahwasanya Allah sekali-kali tidak menganiaya hamba-hamba-Nya.\" (Ali-Imran:182). Bahkan mereka tidak akan keluar dari keadilan dan kemurahanNYa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 49: Pencatatnya adalah para malaikat yang mulia (Al Malaa’ikatul kiram). Orang yang diletakkan kitab itu di tangan kanannya adalah orang-orang mukmin, sedangkan orang yang diletakkan kitab itu di tangan kirinya adalah orang-orang kafir. Yakni orang-orang kafir. Ketika melihat keburukan yang tertulis dalam kitab itu. Dia tidak akan menghukum seseorang tanpa dosa dan tidak mengurangi pahala orang yang beriman. Ketika itu, mereka diberi balasan sesuai apa yang tercatat dalam kitab itu, mereka mengakuinya, dan telah pasti azab baginya. Hal itu tidak lain karena perbuatan yang mereka lakukan, dan mereka tidak keluar dari keadilan dan karunia-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 49",
    "description": "Dan diletakkanlah, yakni diberikan kepada semua manusia kitab yang merinci amal perbuatan mereka di dunia baik yang besar maupun yang kecil, lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang tertulis di dalamnya. Mereka menyesal atas kejahatan perbuatannya ketika di dunia, dan mereka berkata, betapa celaka kami, kitab apakah ini, betapa menakjubkan, karena tidak ada yang tertinggal di dalamnya, yang kecil dan yang besar dari amal perbuatan manusia melainkan tercatat semuanya, dan mereka mendapati semua apa yang telah mereka kerjakan di dunia tertulis di dalamnya. Dan tuhanmu tidak menzalimi seorang jua pun. Amal perbuatan mereka semuanya tercatat secara sempurna dan mendapatkan pembalasan yang sesuai. Dan ingatlah wahai nabi Muhammad, ketika kami berfirman kepada para malaikat, sujudlah kamu kepada adam! maka mereka pun sujud memberi penghormatan kepada adam, kecuali iblis yang enggan bersujud walaupun diperintah oleh Allah. Dia, yakni iblis, adalah dari golongan jin, yang diciptakan Allah dari api oleh karenanya merasa lebih mulia dari adam yang diciptakan Allah dari tanah. Dengan keengganannya bersujud kepada adam maka dia mendurhakai perintah tuhannya. Demikianlah iblis telah menjadi musuh manusia sejak dahulu, maka pantaskah kamu, wahai manusia, menjadikan dia dan keturunannya sebagai pemimpin selain aku, padahal engkau mengetahui mereka adalah musuhmu' sangat buruklah iblis itu sebagai pengganti Allah, yang dijadikannya panutan dan sesembahan, bagi orang yang zalim."
  }
]