[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum musyrikin sama sekali tidak memiliki pengetahuan sedikitpun pada mereka atas apa yang mereka dakwakan bagi Allah, yaitu mengambil seorang anak, sebagaimana para pendahulu mereka yang mereka ikuti. Alangkah parah ungkapan buruk yang keluar dari mulut-mulut mereka. Apa yang mereka ucapkan hanyalah ucapan dusta saja."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Orang-orang yang menebarkan fitnah itu sama sekali tidak memiliki pengetahuan dan bukti atas klaim mereka bahwa Allah memiliki anak, begitu pula nenek moyang yang mereka ikuti tidak memiliki pengetahuan tentang itu. Sungguh betapa besar kejelekan kata-kata yang terlontar tanpa ilmu dari mulut mereka, tidaklah mereka menyatakannya kecuali sebagai kedustaan yang tidak berdasar dan tidak pula memiliki bukti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Mereka dan nenek moyang mereka tidak memiliki dalil yang benar dalam kedustaan mereka ini. Sungguh sangat besar kedustaan dengan kalimat busuk yang keluar dari mulut orang-orang kafir tersebut; hampir-hampir langit dan bumi tergoncang karenanya. Sungguh perkataan mereka itu adalah kedustaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. مَّا لَهُم بِهِۦ مِنْ عِلْمٍ (Mereka sekali-kali tidak mempunyai pengetahuan tentang hal itu) Yakni tentang Allah yang menjadikan baginya seorang anak. وَلَا لِاٰبَآئِهِمْ ۚ (begitu pula nenek moyang mereka) Yakni dan tidak ada dalil yang benar yang menunjukkan hal itu dari para pendahulu mereka. كَبُرَتْ كَلِمَةً تَخْرُجُ مِنْ أَفْوٰهِهِمْ ۚ( Alangkah buruknya kata-kata yang keluar dari mulut mereka) Karena besarnya keberanian mereka mengucapkan tuduhan itu kepada Allah. إِن يَقُولُونَ إِلَّا كَذِبًا(mereka tidak mengatakan (sesuatu) kecuali dusta) Tidak mengandung kebenaran sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Mereka mereka sekali-kali tidak mempunyai pengetahuan tentang hal itu, begitu pula nenek moyang mereka. Namun hanya karena meniru atau dusta. Alangkah buruknya kata-kata yang keluar dari mulut mereka; mereka tidak mengatakan sesuatu kecuali dusta"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka sama sekali tidak mempunyai pengetahuan tentang itu, tidak pula nenek moyang mereka. sangat besar} sangat besar kejelekan dan keburukan {perkataan yang keluar dari mulut mereka. Mereka tidak berkata kecuali kebohongan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4-5. . “ Dan untuk memperingatkan kepada orang-orang yang berkata, ‘Allah mengambil seorang anak’ ,” dari kalangan Yahudi, Nasrani dan orang-orang musyrik yang mengatakan perkataan keji ini. Sesunggguhnya mereka tidak mengatakan hal itu atas dasar ilmu dan keyakinan, mereka tidak memiliki ilmu, tidak pula memiliki ilmu dari nenek moyang mereka yang mereka ikuti. Bahkan, mereka hanyalah mengikuti prasangka dan keinginan-keinginan yang disukai oleh hawa nafsunya. “Alangkah jeleknya kata-kata yang keluar dari mulut mereka,” maksudnya amat besar kekejiannya dan amat parah hukumannya. Manakah kekejian yang lebih besar daripada menyandangi Allah dengan sifat bahwa Dia mengambil seorang anak yang menimbulkan konsekuensi kekuranganNya dan peran serta pihak lain (dari makhluk) kepadaNYa dalam sifat-sifat khusus rububiyah dan uluhiyah, dan mengadakan kedustaan atas namaNya?! \"Siapakah yang lebih lalim daripada orang-orang yang mengada-adakan kebohongan terhadap Allah?\" (Al-Kahfi:15). Oleh karena itu, Allah disini berfirman, “Mereka tidak mengatakan (sesuatu) kecuali dusta,” yaitu kedustaan murni, tidak ada kebenaran sedikit pun padanya. Perhatikanlah, bagaimana Allah menggugurkan perkataan ini sedikit demi sedikkit dan berpindah dari suatu kebatilan yang lebih parah. Pertama, Allah mengabarkan bahwa, “mereka sekali-kali tidak mempunyai pengetahuan tentang hal itu, begitu pula nenek moyang mereka.” Berkata atas nama Allah tanpa ilmu, tidak diragukan lagi larangan dan kebatilannya. Kemudian kedua, Allah mengabarkan bahwa perkataan tersebut adalah perkataan buruuk lagi keji. Maka Allah berfirman, “Alangkah jeleknya kata-kata yang keluar dari mulut merekka,” selanjutnya ketiga, Allah menyebutkan tingkat kejelekannya yaitu kedustaan yang meniadakan kebenaran"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 5: Yang mereka ikuti hanyalah persangkaan dan hawa nafsu; bukan ilmu. Dan alangkah besar hukuman untuknya. Karena menyifati-Nya dengan mengambil anak sama saja mencacatkan-Nya, menyertakan yang lain dalam hal rububiyyah-Nya (mengatur alam semesta) dan uluhiyyah-Nya (keberhakan untuk diibadahi), serta berdusta terhadap-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 5",
    "description": "Mereka sama sekali tidak mempunyai pengetahuan tentang hal itu, yak-ni apa yang mereka ucapkan bahwa Allah mempunyai anak, begitu pula nenek moyang mereka, yang menjadi panutan mereka tidak mempunyai pengetahuan tentang apa yang mereka ucapkan. Alangkah jeleknya kata-kata yang keluar dari mulut mereka, itulah kata-kata yang menyatakan kekufuran dan mereka dengan ucapannya itu tidak lain hanya mengatakan kebohongan belaka. Tidak ada dasar sedikit pun dan tidak ada alasan yang membenarkan apa yang diucapkannya. Maka akibat ucapan dan perbuatan kaum musyrikin itu, barangkali engkau wahai nabi Muhammad akan membunuh dirimu sendiri karena bersedih hati dan sangat kecewa setelah mereka berpaling dari dirimu dan menolak tuntunan yang engkau sampaikan, sekiranya mereka tidak beriman kepada keterangan ini, yakni Al-Qur'an. Wahai nabi Muhammad, janganlah bersedih hati karena perkataan dan perbuatan mereka. Engkau hanya diutus menyampaikan wahyu kepada mereka, dan tidak dibebankan kepadamu menjadikan mereka beriman."
  }
]