[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah ketika Kami memerintahkan para malaikat untuk bersujud kepada Adam sebagai penghormatan, bukan penyembahan kepadanya, dan kami perintahkan iblis dengan apa yang diperintahkan kepada para malaikat. Malaikatpun bersujud semua. Namun iblis yang termasuk bangsa jin keluar dari ketaatan kepada tuhannya. Dia tidak bersujud didorong oleh rasa kesombongan dan kedengkian. Apakah kalian (wahai sekalain manusia) patut menjadikan ibils dan keturunannya sebagai pembela-pembela bagi kalian yang kalian taati, dan kalian meninggalkan ketaatan kepaadaKu, padahal mereka adalah musuh kalian yang paling berbahaya? amat buruk ketaatan orang-orang zhalim kepada setan sebagai ganti ketaatan kepada Allah yang maha pengasih."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Dan ingatlah -wahai Rasul- tatkala Kami berfirman kepada para Malaikat, \"Sujudlah kalian kepada Adam sebagai sujud penghormatan,\" maka mereka pun sujud kepadanya demi mentaati perintah Tuhan mereka, kecuali iblis yang berasal dari golongan jin dan bukan dari golongan Malaikat. Dia enggan dan sombong untuk sujud, sehingga ia pun keluar dari ketaatan padaTuhannya. Maka apakah kalian -wahai manusia- pantas menjadikan dia dan keturunannya sebagai pemimpin dan penolong selain Aku, padahal mereka adalah musuh kalian? Pantaskah kalian menjadikan musuh-musuh kalian sebagai pelindung dan pemimpin? Sungguh sangat buruk dan kejilah perbuatan orang-orang zalim yang menjadikan setan sebagai pemimpin dan penolong mereka sebagai ganti dari Allah -Ta'ālā-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Hai Nabi, ingatlah ketika Kami memerintahkan para malaikat untuk bersujud kepada Adam sebagai penghormatan baginya; maka mereka bersujud semuanya kecuali Iblis yang ketika itu bersama para malaikat -dia berasal dari golongan jin-, dan dia menyelisihi perintah Allah dengan enggan bersujud karena kesombongan dan kedengkiannya. Hai manusia, apakah kalian akan menjadikannya, keturunannya, dan para pengikutnya sebagai penolong-penolong kalian, dengan mentaati mereka dan enggan mentaati-Ku padahal mereka adalah musuh kalian? Menyembah setan adalah seburuk-buruk perbuatan, yang mengganti penyembahan kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. إِلَّآ إِبْلِيسَ (kecuali Iblis) Iblis menyombongkan diri dan enggan untuk bersujud. كَانَ مِنَ الْجِنِّ(Dia adalah dari golongan jin) Oleh sebab itu ia berani untuk berdurhaka. فَفَسَقَ عَنْ أَمْرِ رَبِّهِۦٓ ۗ(maka ia mendurhakai perintah Tuhannya) Yakni keluar dari ketaatan kepada Tuhannya. أَفَتَتَّخِذُونَهُۥ وَذُرِّيَّتَهُۥٓ أَوْلِيَآءَ(Patutkah kamu mengambil dia dan turanan-turunannya sebagai pemimpin) Yakni patutkah setelah dia enggan dan durhaka kepada Allah, kemudian kalian menjadikannya dan pengikutnya sebagai pemimpin kalian. مِن دُونِى(selain daripada-Ku) Sehingga kalian mentaatinya dan tidak mentaati-Ku, dan kalian menggant-Ku dengan mereka. وَهُمْ لَكُمْ عَدُوٌّۢ ۚ(sedang mereka adalah musuhmu?) Yakni para musuh yang selalu menunggu kesempatan untuk memjerumuskan kalian ke dalam kemudharatan di setiap saat. بِئْسَ لِلظّٰلِمِينَ بَدَلًا(Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim) Yakni bukannya menjadikan Allah sebagai penolong, namun menjadikan setan sebagai penolong mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Dapat difahami bahwa dibawah ayat ini ada peringatan yang begitu lembut yang menakjubkan! yaitu seakan-akan Allah berkata bahwasanya aku memusuhi Iblis karena penolakannya untuk bersujud kepada bapakmu Adam bersama para Malaikatku, jadi permusuhan ini demi kalian, lalu apakah balasan dari permusuhan ini kalian mengadakan pertemanan dengan mereka (iblis) ? 2 ). { بِئْسَ لِلظَّٰلِمِينَ بَدَلً } \"Amat buruklah iblis itu sebagai pengganti (dari Allah) bagi orang-orang yang zalim\" kezhaliman yang amat keji bagi orang-orang yang mengganti wilayah Allah dengan wilayah Iblis dan keturunannya, yaitu dengan bersekongkol dengan Jin untuk mewujudkan kebathilan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Ingatlah ketika Kami berfirman kepada para malaikat: \"Sujudlah kamu kepada Adam, maka sujudlah mereka kecuali Iblis. Dia adalah golongan jin, maka ia mendurhakai perintah Tuhannya. Patutkah kamu menjadikan mereka dan turunan-turunan mereka sebagai pemimpin selain Aku, bahkan mereka itu adalah musuhmu? Sungguh amat buruklah iblis itu jika sebagai pengganti Allah bagi orang-orang yang zalim."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Kami berfirman kepada para malaikat,“Sujudlah kepada Adam” Lalu mereka bersujud, kecuali Iblis. Dia termasuk golongan jin, lalu dia mendurhakai perintah Tuhannya} tidak menyimpang dari ketaatan kepada Allah dengan tidak mau bersujud karena sombong {Apakah kalian (pantas) menjadikan dia dan keturunannya sebagai penolong} penolong yang kalian taati {selain Aku, padahal mereka adalah musuh} musuh {bagi kalian. (Iblis itu) seburuk-buruk pengganti bagi orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. Allah memberitahukan tentang permusuhan iblis kepada Adam dan anak-keturunanya. Allah memerintahkan para malaikat untuk bersujud kepada Adam, sebagai bentuk pemuliaan dan pengagungan serta menaati perintah Allah. Lalu mereka menaatinya “kecuali iblis. Dia adalah dari golongan jin, maka Dia mendurhakai perintah Rabbnya,” dan Allah berfirman, \"Apakah aku akan sujud kepada orang yang Engkau ciptakan dari tanah?\" (Al-Isra:61) \"Saya lebih baik daripadanya: Engkau ciptakan saya dari api sedang dia Engkau ciptakan dari tanah\". (Al-A’raf:12). Melalui ayat-ayat ini, jelaslah permusuhannya kepada Allah dan ayah kalian (adam), lalu bagaimana mungkin kamu menjadikannya “dan turunan-turunannya,” maksudnya setan-setan “sebagai pemimpin selain dari padaKu, sedang mereka adalah musuhmu. Amat buruklah iblis itu sebagai pengganti (Allah) bagi orang-orang yang zhalim,” maksudnya sejelek-jelek kepemimpinan yang mereka pilih adalah kepemimpinan setan yang tidak memerintah kecuali perbuatan yang keji dan mungkir dengan mengesampingkan wilayah (perlindungan) ar-Rahman yang mana semua kebahagiaan, keberuntungan, dan kesenangan berada di bawah pengendalianNya. Dalam ayat ini, terdapat himbauan untuk menjadikan setan sebagai musuh dan memberanikan diri untuk melakukannya, serta penyebutan faktor penyebab yang mengharuskan untuk memusuhinya. Sesungguhnya tidak ada orang yang melakukannya (mendaulat setan sebagai pimpinan) kecuali insan yang zhalim. Adakah kezhaliman yang lebih besar daripada kezhaliman seseorang yang menjadikan musuh sejatinya sebagai pemimpinnya dengan meninggalkan Pemimpin yang terpuji (Allah). Allah berfirman, \"Allah Pelindung orang-orang yang beriman; Dia mengeluarkan mereka dari kegelapan (kekafiran) kepada cahaya (iman). Dan orang-orang yang kafir, pelindung-pelindungnya ialah setan, yang mengeluarkan mereka dari cahaya kepada kegelapan (kekafiran).\" (Al-Baqarah:257) dan \"Sesungguhnya mereka menjadikan setan-setan pelindung (mereka) selain Allah,\" (Al-A’raf:30)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 50: Sujud di sini berarti menghormati dan memuliakan Adam serta sebagai pelaksanaan terhadap perintah Allah, bukan berarti sujud menghambakan diri, karena sujud menghambakan diri itu hanyalah semata-mata kepada Allah. Ada yang mengatakan, bahwa pengecualian di ayat ini adalah pengecualian muttashil (bersambung), dan ada pula yang berpendapat, bahwa pengecualian tersebut adalah pengecualian munqathi’ (terputus). Jika muttashil, maka berarti jin tergolong malaikat, namun jika munqathi’, maka berarti bahwa Iblis adalah nenek moyang jin, dan ia mempunyai keturunan, sedangkan malaikat tidak. Iblis merasa dirinya lebih baik daripada Adam karena dia diciptakan dari api, sedangkan Adam diciptakan dari tanah. Di mana engkau menaatinya. Ya, buruk sekali orang yang mengambil setan sebagai walinya menggantikan Allah Ar Rahman. Setan mengajaknya kepada perbuatan keji dan jahat, sedangkan Allah memerintahkan berbuat adil dan ihsan. Setang menjanjikannya kemiskinan, sedangkan Allah menjanjikan ampunan dan karunia-Nya, setan mengajaknya keluar dari cahaya kepada kegelapan, sedangkan Allah mengajak keluar dari kegelapan kepada cahaya. Dalam ayat ini terdapat dorongan untuk menjadikan setan sebagai musuh dan menyebutkan alasan mengapa perlu dijadikan musuh, dan bahwa tidak ada yang menjadikan setan sebagai wali(pemimpin)nya selain orang yang zalim. Kezaliman apa yang lebih besar daripada kezaliman orang yang mengambil musuhnya sebagai wali, padahal musuhnya selalu mencari cara untuk menggelincirkannya dan menjatuhkannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 50",
    "description": "Dan ingatlah wahai nabi Muhammad, ketika kami berfirman kepada para malaikat, sujudlah kamu kepada adam! maka mereka pun sujud memberi penghormatan kepada adam, kecuali iblis yang enggan bersujud walaupun diperintah oleh Allah. Dia, yakni iblis, adalah dari golongan jin, yang diciptakan Allah dari api oleh karenanya merasa lebih mulia dari adam yang diciptakan Allah dari tanah. Dengan keengganannya bersujud kepada adam maka dia mendurhakai perintah tuhannya. Demikianlah iblis telah menjadi musuh manusia sejak dahulu, maka pantaskah kamu, wahai manusia, menjadikan dia dan keturunannya sebagai pemimpin selain aku, padahal engkau mengetahui mereka adalah musuhmu' sangat buruklah iblis itu sebagai pengganti Allah, yang dijadikannya panutan dan sesembahan, bagi orang yang zalim. Bagaimana mungkin iblis engkau jadikan sebagai pengganti, padahal aku, yakni Allah, tidak menghadirkan mereka, yakni iblis dan anak cucunya untuk menyaksikan penciptaan langit dan bumi dan tidak pula menghadirkan sebagian dari mereka untuk menyaksikan penciptaan diri mereka sendiri; dan aku tidak menjadikan para penyesat itu sebagai penolong. Karena itu janganlah sekali-kali engkau jadikan iblis sebagai penolong, sebab ia hanya akan membuat dirimu celaka."
  }
]