[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Aku tidak menghadirkan iblis dan keturunannya (yang kalian taati) dalam penciptaan langit dan bumi hingga Aku meminta pertolongan mereka untuk menciptakan keduanya, dan Aku pun tidak menghadirkan sebagian mereka untuk menyaksikan penciptaan sebagian yang lain, Namun, Aku sendiri yang menciptakan semua itu tanpa penolong dan pembantu. Dan Aku tidaklah mengambil makhluk-makhluk yang menyesatkan dari kalangan setan-setan dan lainnya sebagai para penolong. Maka bagaiamana kalain(wahai manusia) mengalihkan hakKu kepada mereka dan menjadikan mereka sebagai para pelindung, bukan malah Aku, padahal Akulah semata pencipta segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Mereka yang kalian jadikan pemimpin dan penolong selain Aku, hanyalah berstatus hamba seperti kalian. Aku tidak memperlihatkan kepada mereka penciptaan langit dan bumi ketika diciptakan, bahkan saat itu mereka belum ada sama sekali. Dan Aku tidak pula memperlihatkan kepada mereka penciptaan masing-masing makhluk, sebab Akulah semata Yang Maha Esa dalam mencipta dan mengatur. Aku sekali-kali tidak akan menjadikan orang-orang yang menyesatkan dari kalangan setan manusia dan jin itu sebagai penolong, sebab Aku tidak memerlukan para penolong."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51-52. Aku tidak menjadikan Iblis dan para pengikutnya menyaksikan penciptaan tujuh langit dan bumi, dan Aku tidak pula jadikan mereka saling menyaksikan penciptaan mereka; sehingga mereka bukanlah sekutu-Ku dalam penciptaan, namun hanya Aku yang menciptakan segalanya tanpa bantuan siapapun. Dan Aku tidak menjadikan orang-orang yang menyesatkan orang lain dari kebenaran sebagai penolong-Ku. Dan ingatlah ketika Allah berkata kepada orang-orang musyrik pada hari kiamat: “Panggillah para sekutu-Ku agar mereka dapat menyelamatkan kalian dari azab-Ku”. Maka mereka memanggil mereka, namun mereka tidak menjawab sedikitpun. Dan Kami pisahkan antara mereka dan para tuhan mereka, dan Kami jadikan di antara mereka tempat kebinasaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. مَّآ أَشْهَدتُّهُمْ خَلْقَ السَّمٰوٰتِ وَالْأَرْضِ (Aku tidak menghadirkan mereka (iblis dan anak cucunya) untuk menyaksikan penciptaan langit dan bumi) Yakni mereka tidak pernah menjadi sekutu-Ku dalam mengurus alam semesta, dengan dalil Aku tidak mendatangkan mereka pada saat proses penciptaan langit dan bumi. وَلَا خَلْقَ أَنفُسِهِمْ(dan tidak (pula) penciptaan diri mereka sendiri) Dan Aku tidak meminta bantuan mereka untuk menciptakan diri mereka, namun mereka hanyalah seperti makhluk yang lain. Ini merupakan dalil yang sangat terang seterang matahari. Mereka mengakui bahwa Allah adalah Pencipta segala sesuatu. وَمَا كُنتُ مُتَّخِذَ الْمُضِلِّينَ عَضُدًا (dan tidaklah Aku mengambil orang-orang yang menyesatkan itu sebagai penolong) Yakni Aku tidak pernah menjadikan setan-setan atau orang-orang kafir sebagai penolong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Aku tidak menghadirkan mereka iblis dan anak cucunya untuk menyaksikan penciptaan langit dan bumi. Tidak pula penciptaan diri mereka sendiri, dan Aku tidak menjadikan orang-orang yang menyesatkan itu sebagai penolong"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Aku tidak membuat mereka menyaksikan penciptaan langit dan bumi, tidak pula penciptaan diri sendiri. Aku tidak menjadikan mereka yang telah menyesatkan itu sebagai penolong} sebagai penolong dan penyelamat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. Allah berfirman, “Aku tidak menghadirkan mereka (iblis dan anak cucunya) untuk menyaksikan penciptaan langit dan bumi, dan tidak (pula) penciptaan diri mereka sendiri.” Maksudnya, Kami tidak mendatangkan mereka dan tidak bertukar-pikiran dengan mereka tentang itu. Bagaimana mungkin mereka menjadi para pencipta sebagian dari itu. Akan tetapi Dzat satu-satunya yang menciptakan, mengatur, mempunyai sifat hikmah dan ketetapan takdir, adalah Allah, Pencipta segala sesuatu, yang memegang kendali di dalamnya berdasarkan hikmahNya. Bagaimana mungkin bisa diterima, penetapan sekutu-sekutu bagi Allah, dari bagsa setan-setan, dipatuhi dan ditaati seperti ketaatan kepada Allah, padahal mereka itu tidak menciptakan dan tidak menyaksikan proses penciptaan, serta tidak membantu Allah. Oleh karena itu, Allah berfirman, “Dan tidaklah Aku menjadikan orang-orang yang menyesatkan itu sebagai penolong,” yaitu para penolong yang membantu Allah pada salah satu urusanNYa. Maksudnya, ttidak patut dan tidak pantas bagi Allah untuk memberi mereka bagian dari hak pengaturan. Pasalnya, mereka itu berupaya menyesatkan umat manusia dan memusuhi Rabb mereka. Selayaknya, menjauhkan mereka (dari Allah) dan tidak mendekatkan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 51: Dan tidak mengajak mereka bermusyawarah. Bahkan Allah Subhaanahu wa Ta'aala yang sendiri mencipta dan mengatur, serta bertindak terhadapnya dengan hikmah-Nya. Namun mengapa mereka menjadikan setan sebagai sekutu-sekutu bagi Allah, yang mereka taati sebagaimana Allah ditaati, padahal setan-setan itu tidak menciptakan dan tidak hadir ketika Allah menciptakan langit dan bumi serta tidak membantu Allah Subhaanahu wa Ta'aala. Yakni tidak patut dan tidak layak bagi Allah menyertakan mereka yang suka menyesatkan untuk mengatur alam semesta, karena mereka berusaha menyesatkan manusia dan memusuhi Tuhannya, bahkan yang layak adalah menjauhkan mereka dan tidak mendekatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 51",
    "description": "Bagaimana mungkin iblis engkau jadikan sebagai pengganti, padahal aku, yakni Allah, tidak menghadirkan mereka, yakni iblis dan anak cucunya untuk menyaksikan penciptaan langit dan bumi dan tidak pula menghadirkan sebagian dari mereka untuk menyaksikan penciptaan diri mereka sendiri; dan aku tidak menjadikan para penyesat itu sebagai penolong. Karena itu janganlah sekali-kali engkau jadikan iblis sebagai penolong, sebab ia hanya akan membuat dirimu celaka. Dan ingatlah pula pada hari ketika dia berfirman kepada orang-orang yang mempersekutukan Allah, panggillah olehmu sekutu-sekutuku yang kamu anggap itu, yakni berhala-berhala yang dijadikan sesembahan oleh mereka, agar mereka memberimu syafaat. Mereka lalu memanggilnya, tetapi mereka, yakni sekutu-sekutu itu tidak membalas panggilan dan seruan mereka dan kami adakan untuk mereka, yakni yang menyembah dan yang disembah, tempat kebinasaan, yaitu neraka jahanam, siapa pun yang masuk ke dalamnya akan binasa."
  }
]