[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sebutkanlah kepada mereka ketika Allah akan berfirman kepada orang-orang musyrik pada hari kiamat, ”panggilah sekutu-sekutuKu yang dahulu kalian anggap sebagai sekutu-sekutuKu dalam ibadah agar mereka dapat menolong kalian hari ini dari siksaan Ku.” maka mereka meminta pertolongan kepada mereka, akan tetapi mereka tidak dapat memberikan pertolongan bagi orang-orang musyrik tersebut. Dan Kami adakan bagi para penyembah dan yang disembah satu tempat kebinasaan di neraka jahanam, mereka semua akan binasa di sana."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Dan sampaikan kepada mereka -wahai Rasul- tentang hari Kiamat ketika Allah berfirman kepada orang-orang yang menyekutukan-Nya di dunia, \"Panggilah oleh kalian sekutu-sekutu yang kalian klaim bahwa mereka adalah sekutu-sekutu-Ku, semoga saja mereka bisa menolong kalian,\" Mereka lalu memanggil sekutu-sekutu itu, tetapi mereka tidak membalas seruan itu dan tidak pula kuasa menolong mereka. Lalu Kami pun membuat tempat kebinasaan bagi para penyembah dan yang disembah tersebut, mereka masuki secara bersama-sama yaitu Nereka Jahanam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. وَيَوْمَ يَقُولُ نَادُوا۟ شُرَكَآءِىَ الَّذِينَ زَعَمْتُمْ (Dan (ingatlah) akan hari (yang ketika itu) Dia berfirman: “Serulah olehmu sekalian sekutu-sekutu-Ku yang kamu katakan itu”) Yakni serulah sekutu-sekutu yang dapat memberi kalian manfaat dan syafaat. Hal ini terjadi di hari kiamat. وَجَعَلْنَا بَيْنَهُم مَّوْبِقًا (dan Kami adakan untuk mereka tempat kebinasaan) Makna (الموبق) adalah lembah yang dalam yang Allah jadikan sebagai pemisah di antara mereka. Atau tempat kebinasaan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Ingatlah akan hari ketika Dia berfirman: \"Serulah sekutu-sekutu-Ku yang kamu katakan itu\". Mereka lalu memanggilnya, tetapi sekutu-sekutu itu tidak membalas seruan mereka, sehingga Kami sediakan untuk mereka dan sesembahan mereka tempat kebinasaan yang curam neraka yaitu neraka Jahannam untuk memisahkan di antara mereka. Al-Maubiq yaitu yang membinasakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari Dia berfirman} Allah berfirman kepada mereka pada hari kiamat {“Panggillah sekutu-sekutuKu yang kalian anggap”, lalu mereka memanggilnya, tetapi sekutu-sekutu itu tidak membalas mereka. Kami menjadikan di antara mereka} di antara orang-orang musyrik dan para penyembahnya {tempat kehancuran} tempat kehancuran yang dihuni bersama, yaitu neraka Jahanam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Setelah menyebutkan kondisi orang-orang yang menyekutukan (sesuatu) denganNya di dunia ini, mengugurkan syirik ini dengan tuntas, dan menetapkan kebodohan dan ketololan pelakunya, maka Allah memberitahukan keadaan hubungan mereka dengan para sekutu mereka di Hari Kiamat kelak, bahwasanya Allah berkata kepada mereka, “Kalian panggillah para sekutuKU menurut klaim kalian,” makusdnya berdasarkan persepsi kalian yang rusak. Kalau tidak demikian, maka sesungguhnya Allah tidak memiliki sekutu di bumi ataupun di langit. Maksudnya, panggillah mereka untuk memberikan kemanfaatan dan menyelamatkan kalian dari kesulitan-kesulitan ini. “Maka mereka memanggilnya, tetapi sekutu-sekutu itu tidak membalas seruan mereka,” karena kerajaan dan ketetapan hukum pada hari itu hanya milik Allah, tiada seorang pun yang dapat memberikan manfaat sekecil biji dzarrah pun bagi dirinya sendiri atau orang lain. “Dan Kami adakan untuk mereka,” yaitu antara kaum musyrikin dan sekutu-sekutu mereka “tempat kebinasaan (neraka),” yaitu tempat kehancuran, yang akan memisahkan antara kaum musyrikin dengan para sekutu mereka, menjauhkan mereka dari yang lain. Pada saat itu, menjadi teranglah permusuhan dan pengingkaran para sekutu, serta sikap berlepas dirinya mereka dari para pemujanya, seperti Firman Allah, \"Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.\" (Al-Ahqaf : 6)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 52: Setelah Allah Subhaanahu wa Ta'aala menyebutkan keadaan orang yang menyekutukan-Nya di dunia dan membatalkan perbuatan syirk, maka Dia memberitahukan keadaan mereka nanti di akhirat bersama para sekutunya, dan Dia berfirman, “Panggillah sekutu-sekutu-Ku yang kamu anggap itu.” Padahal sesungguhnya Allah tidak mempunyai sekutu baik dari langit maupun dari bumi. Yakni yang kamu anggap dapat memberi syafaat, memberi manfaat bagimu dan membebaskan dirimu dari penderitaan dan azab. Di mana mereka semua binasa di dalamnya. Ketika itu terjadilah permusuhan antara para sekutu terhadap para penyembahnya, para sekutu mengingkari mereka (para penyembahnya) dan berlepas diri dari mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 52",
    "description": "Dan ingatlah pula pada hari ketika dia berfirman kepada orang-orang yang mempersekutukan Allah, panggillah olehmu sekutu-sekutuku yang kamu anggap itu, yakni berhala-berhala yang dijadikan sesembahan oleh mereka, agar mereka memberimu syafaat. Mereka lalu memanggilnya, tetapi mereka, yakni sekutu-sekutu itu tidak membalas panggilan dan seruan mereka dan kami adakan untuk mereka, yakni yang menyembah dan yang disembah, tempat kebinasaan, yaitu neraka jahanam, siapa pun yang masuk ke dalamnya akan binasa. Dan orang yang berdosa, yaitu para pendurhaka yang ketika di dunia berbuat maksiat kepada Allah melihat neraka, lalu mereka menduga, yakni percaya bahwa mereka akan jatuh dan masuk ke dalamnya, dan mereka tidak menemukan tempat berpaling untuk menghindar darinya."
  }
]