[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang gemar berbuat dosa melihat neraka, maka merekapun yakin bahwa sesungguhnya mereka akan berada di dalamnya tanpa bisa mengelak, dan mereka tidak menemukan tempat menghindar darinya untuk meninggalkan menuju tempat kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Dan orang-orang musyrik itu melihat Neraka, merekapun merasa yakin seyakin-yakinnya bahwa mereka akan memasukinya, dan mereka sekali-kali tidak akan menemukan tempat lain untuk berpaling darinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Orang-orang kafir yang berdosa itu melihat neraka dengan mata kepala mereka, sehingga mereka yakin akan memasukinya, dan mereka tidak mendapatkan tempat melarikan diri darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. وَرَءَا الْمُجْرِمُونَ النَّارَ فَظَنُّوٓا۟ أَنَّهُم مُّوَاقِعُوهَا (Dan orang-orang yang berdosa melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya) Yakni mereka telah mengetahui dan meyakini bahwa mereka akan masuk dan tenggelam di dalam neraka. وَلَمْ يَجِدُوا۟ عَنْهَا مَصْرِفًا(dan mereka tidak menemukan tempat berpaling dari padanya) Yakni tempat berpaling atau berlindung darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Orang-orang yang berdosa itu melihat neraka, maka mereka meyakini, bahwa mereka akan jatuh ke dalamnya dan mereka tidak menemukan tempat untuk menjauh dari neraka itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang berdosa itu melihat neraka, lalu mereka yakin} mereka yakin {bahwa mereka akan jatuh ke dalamnya} akan menempatinya {dan mereka tidak menemukan tempat berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. Maksudnya, pada Hari KIamat kelak, ketika telah dilakukan perhitungan amal, masing-masing orang dari para makhluk terkotak-kotakkan berdasarkan amal perbuatan amal mereka, keputusan penjatuhan siksa telah jatuh pada kaum yang berbuat dosa, maka mereka menyaksikan Jahanam sebelum memasukinya, sehingga mereka begitu gelisah. Kerisauan mereka semakin menjadi-jadi karena mereka menyangka (meyakini) akan memasukinya. Persangkaan mereka itu, sesuai dengan keterangan para ulama tafsir berarti keyakinan. Jadi mereka benar-benar meyakini akan masuk ke dalamnya “dan mereka tidak menemukan tempat berpaling darinya,” maksudnya tempat pindah untuk beralih ke sana. Tidak ada pemberi syafaat bagi mereka tanpa izin Allah. Pada ayat ini terdapat aspek takhwif (intimidasi) dan tarhib (menakut-nakuti) yang membuat jantung dan hati berdebar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 53: Pada hari kiamat ketika hisab diselesaikan, setiap kelompok dibedakan sesuai amal mereka, dan azab sudah ditetapkan akan menimpa orang-orang yang berdosa, maka sebelum mereka masuk ke neraka, mereka melihat lebih dulu neraka, hati mereka pun gelisah, dan mereka yakin akan memasukinya dan tidak menemukan tempat berpaling darinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 53",
    "description": "Dan orang yang berdosa, yaitu para pendurhaka yang ketika di dunia berbuat maksiat kepada Allah melihat neraka, lalu mereka menduga, yakni percaya bahwa mereka akan jatuh dan masuk ke dalamnya, dan mereka tidak menemukan tempat berpaling untuk menghindar darinya. Dan sesungguhnya kami telah menjelaskan berulang-ulang kepada manusia dalam Al-Qur'an ini dengan bermacam-macam perumpamaan, baik dalam bentuk perbandingan maupun dalam bentuk kisah. Binatangbinatang yang kecil seperti nyamuk, lalat, dan lebah serta benda-benda alam yang besar seperti gunung dan samudra, dijadikan contoh untuk menarik perhatian manusia. Tetapi manusia adalah memang yang paling banyak membantah. Mereka senantiasa mencari dalih untuk membantah kebenaran ayat-ayat Allah."
  }
]