[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menerangkan dan memvariasikan di dalam al-qur’an ini banyak macam perumpamaan bagi sekalian manusia, agar mereka dapat mengambil pelajaran dengannya dan kemudian beriman. Dan manusia adalah makhluk yang paling banyak mendebat dan membantah,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Dan sungguh Kami telah menjelaskan berulang-ulang dalam Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- bermacam-macam perumpamaan agar mereka mengambil ibrah dan pelajaran darinya, akan tetapi manusia -khususnya orang kafir- memang paling banyak menampakkan bantahan tanpa hak."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Sungguh Kami telah jelaskan dalam al-Qur’an berbagai perumpamaan, hukum, dan pelajaran dengan berbagai bentuk dan cara; dan manusia memang makhluk yang paling banyak memperdebatkan kebatilan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. وَلَقَدْ صَرَّفْنَا (Dan sesungguhnya Kami telah mengulang-ulangi) Yakni Kami ulang-ulang. فِى هٰذَا الْقُرْءَانِ لِلنَّاسِ مِن كُلِّ مَثَلٍ ۚ(bagi manusia dalam Al Quran ini bermacam-macam perumpamaan) Yakni berbagai perumpamaan yang disebutkan dalam surat ini. وَكَانَ الْإِنسٰنُ أَكْثَرَ شَىْءٍ جَدَلًا (Dan manusia adalah makhluk yang paling banyak membantah) Yakni makhluk yang paling banyak membantah dari makhluk-mahkluk yang dapat membantah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Sesungguhnya Kami telah mengulang-ulangi penjelasan kepada manusia dalam Al Quran ini dengan bermacam-macam perumpamaan. Namun manusia adalah makhluk yang paling banyak membantah dengan kebatilan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menjelaskan} menjelaskan dan menerangkan {dalam Al-Qur’an ini segala perumpamaan kepada manusia. Dan manusia itu yang paling banyak membantah} berdebat dan berbantah-bantahan dengan bathil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. Allah memberitahukan tentang keagungan al-Quran, kebesaran dan nilai universalnya, bahwasanya Dia telah mengulang-ulangi bagi manusia dalam al-Quran ini “bermacam-macam perumpamaan,” dari semua cara yang mengantarkan kepada ilmu yang bermanfaat, dan kebahagiaan yang langgeng, dan setiap jalan yang memelihara dari kejelekan dan kebinasaan. Di dalamnya, (juga) terkandung perumpamaan-perumpamaan halal dan haram, balasan amal perbuatan, targhib dan tarhib, berita-berita riil yang berguna bagi hati, sebagai keyakinan, ketentraman, dan cahaya. Ini semua termasuk perkara yang mendatangkan kepasrahan terhadap al-Quran, dan menerimanya dengan tunduk serta ketaatan, tanpa penentangan terhadapnya dalam perkara apa pun. Kendatipun demikian, kebanyakan manusia justru melancarkan bantahan kebenaran setelah menjadi jelas, menyanggah dengan dasar kebatilan untuk mempecundangi kebenaran dengannya. Oleh karena itu, Allah berfirman, “Dan manusia adalah makhluk yang paling banyak membantah,” maksudnya membantah dan menentang kandungan al-Quran. Padahal, hal tersebut tidak pantas mereka lakukan dan tidak ada kesanggupan bagi mereka untuk melakukannya. Faktor yang menyebabkannya demikian, dan ketiadaan beriman (pada mereka) kepada Allah hanyalah sikap kezhaliman dan penentangan, bukan kedangkalan hujjah maupun buktinya yang nyata. Bila bukan ini alasannya, sekiranya azab datang kepada mereka dan hukuman (pada kaum) sebelum mereka mendatangi mereka, maka keadaan mereka tidak seperti ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 54: Untuk maslahat dan manfaat mereka. Sebagaimana yang tertera dalam surah Al Kahfi ini, belum dengan yang disebutkan dalam surah-surah yang lain. Hal ini menghendaki seseorang untuk menerima Al Qur’an, tunduk dan taat serta tidak menentangnya. Namun kebanyakan manusia membantah yang hak setelah jelas baginya. Padahal yang demikian tidak pantas mereka lakukan, dan bukan merupakan sikap adil. Sikap itu timbul karena kezaliman dan sifat keras, bukan karena kurangnya penjelasan, hujjah dan bukti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 54",
    "description": "Dan sesungguhnya kami telah menjelaskan berulang-ulang kepada manusia dalam Al-Qur'an ini dengan bermacam-macam perumpamaan, baik dalam bentuk perbandingan maupun dalam bentuk kisah. Binatangbinatang yang kecil seperti nyamuk, lalat, dan lebah serta benda-benda alam yang besar seperti gunung dan samudra, dijadikan contoh untuk menarik perhatian manusia. Tetapi manusia adalah memang yang paling banyak membantah. Mereka senantiasa mencari dalih untuk membantah kebenaran ayat-ayat Allah. Dan tidak ada sesuatu pun yang menghalangi manusia, yakni kaum musyrik mekah untuk beriman ketika petunjuk telah datang kepada mereka dan tidak ada juga yang menghalangi mereka memohon ampunan kepada tuhannya, kecuali keinginan menanti datangnya hukum Allah berupa sunah atau ketetapan-Nya yang telah berlaku pada umat yang terdahulu, yakni datangnya mukjizat yang mereka saksikan dengan mata kepala sendiri atau datangnya azab atas mereka dengan nyata. Mereka tidak akan beriman kecuali apabila datang azab kepada mereka sebagaimana yang ditimpakan kepada umat terdahulu. Allah sungguh tidak menghendaki keimanan seseorang dilakukan dengan terpaksa. Allah menghehendaki keimanan yang tulus, yang dilakukan dengan kesadaran, tanpa paksaan."
  }
]