[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah ada faktor yang menghalangi manusia untuk beriman (ketika datang kepada mereka rasul Muhammad dengan membawa al-qur’an) dan untuk memohon ampunan kepada tuhan mereka dan meminta maafNya bagi mereka, kecuali penentangan mereka terhadap rasul dan permintaan mereka agar mereka ditimpakan ketetapan Allah dalam membinasakan umat-umat yang mendahului mereka atau tertimpa siksaan Allah yang mereka lihat langsung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Dan bukan kekurangan penjelasan yang menghalangi antara orang-orang kafir yang durhaka itu untuk beriman kepada apa yang dibawa oleh Muhammad -ṣallallāhu 'alaihi wa sallam- dari Tuhannya, dan bukan kekurangan penjelasan juga yang menghalangi mereka untuk memohon ampunan kepada Allah atas dosa-dosa mereka. Sungguh sudah seringkali diberikan perumpamaan dalam Al-Qur`ān dan didatangkan hujah dan bukti yang nyata kepada mereka. Namun yang menghalangi mereka dari semua itu adalah permintaan mereka -yang penuh kedurhakaan- untuk ditimpakan azab umat-umat terdahulu kepada mereka, dan (permintaan mereka untuk) menyaksikan azab yang diancamkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Tidak ada yang menghalangi orang-orang kafir dari keimanan ketika Rasulullah datang dengan al-Qur’an agar mereka beriman dan meminta ampunan Allah, melainkan karena mereka menunggu datangnya kebinasaan kepada mereka seperti yang telah datang kepada umat-umat terdahulu yang mendustakan, atau menunggu mereka tertimpa azab secara yang dapat mereka lihat secara langsung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. إِلَّآ أَن تَأْتِيَهُمْ سُنَّةُ الْأَوَّلِينَ (kecuali (keinginan menanti) datangnya hukum (Allah yang telah berlalu pada) umat-umat yang dahulu) Yakni mereka tidak akan beriman dan memohon ampun kecuali ketika azab dunia akan membinasakan mereka, atau ketika mereka melihat atau mendatangi berbagai jenis azab akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Tidak ada sesuatupun yang bisa menghalangi orang musyrik Makkah dan lainnya untuk beriman kepada Allah dan rasul-Nya, ketika Alquran dan Rasul telah datang kepada mereka. Juga tidak ada yang menghalangi untuk memohon ampun kepada Tuhannya, kecuali keinginan menanti datangnya hukum Allah yang telah terjadi pada umat-umat terdahulu atau datangnya azab atas mereka dengan nyata yang membinasakan mereka seperti perang Badr. Maksudnya adalah bahwa mereka tidak memohon ampun kecuali saat benar-benar terjadi bencana dan azab di dunia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada yang menghalangi manusia untuk beriman ketika petunjuk telah datang kepada mereka dan untuk memohon ampunan kepada Tuhan mereka kecuali akan datang kepada mereka ketetapan umat yang terdahulu} ketetapan Allah untuk membinasakan orang-orang terdahulu dengan menumbangkannya {atau datang kepada mereka azab yang nyata} yang terlihat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. Maksudnya tidak ada faktor yang menghalang-halangi manusia untuk beriman –padahal keberadaan hidayah yang dapat membedakan antara petunjuk kan kesesatan, kebenaran dan kebatilan telah sampai kepada mereka dan telah tegak hujjah Allah atas mereka- dan bukan (Pula) penjelasan (yang gamblang) yang menghambat mereka (untuk beriman). Akan tetapi, sebab yang menghalangi mereka dari keimanan adalah kezhaliman dan permusuhan. Sehingga tidak ada yang ditunggu kecuali ketetapan Allah dan kebiasaanNYa pada generasi-generasi dahulu, yaitu jika mereka tidak beriman, maka disegerakan siksa pada mereka atau mereka akan menyaksikan siksa telah menyongsong mereka. Mereka benar-benar melihatnya dengan mata kepala mereka sendiri. Artinya, hendaklah mereka takut terhadapnya dan bertaubat dari kekufuran mereka, sebelum siksaan (datang) yang tidak bisa ditolak lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 55: Yakni Al Qur’an. Yaitu dengan dibinasakan seperti umat-umat terdahulu. Oleh karena itu, hendaknya mereka takut terhadapnya dan bertobat dari kekafirannya sebelum datang kepada mereka azab yang tidak dapat ditolak lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 55",
    "description": "Dan tidak ada sesuatu pun yang menghalangi manusia, yakni kaum musyrik mekah untuk beriman ketika petunjuk telah datang kepada mereka dan tidak ada juga yang menghalangi mereka memohon ampunan kepada tuhannya, kecuali keinginan menanti datangnya hukum Allah berupa sunah atau ketetapan-Nya yang telah berlaku pada umat yang terdahulu, yakni datangnya mukjizat yang mereka saksikan dengan mata kepala sendiri atau datangnya azab atas mereka dengan nyata. Mereka tidak akan beriman kecuali apabila datang azab kepada mereka sebagaimana yang ditimpakan kepada umat terdahulu. Allah sungguh tidak menghendaki keimanan seseorang dilakukan dengan terpaksa. Allah menghehendaki keimanan yang tulus, yang dilakukan dengan kesadaran, tanpa paksaan. Dan kami tidak mengutus rasul-rasul termasuk engkau wahai nabi Muhammad, melainkan sebagai pembawa kabar gembira dan pemberi peringatan kepada manusia agar mereka beriman, tetapi orang yang kafir terus-menerus membantah para rasul itu dengan cara yang batil agar dengan demikian mereka dapat melenyapkan yang hak, yakni kebenaran ayatayat Allah dan mereka menjadikan ayat-ayat-ku dan apa yang diperingatkan terhadap mereka oleh para rasul sebagai olok-olokan. Mereka berkata bahwa para rasul hanyalah seorang manusia dan apa yang dikatakan oleh mereka hanyalah kebohongan belaka."
  }
]