[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami tidak mengutus rasul-rasul ke tengah umat manusia kecuali agar para rasul itu menjadi orang-orang yang membawa kabar gembira berupa surga bagi orang-orang yang beriman dan beramal shaleh, serta memberikan kabar menakutkan bagi orang yang mengikuti kekafiran dan maksiat dari neraka. akan tetapi, kendatipun kebenaran itu sangat terang, orang-orang yang kafir tetap membantah para rasul dengan kebatilan-kebatilan sebagai bentuk penentangan agar dengan kebatilan itu, mereka dapat menghapus kebenaran yang dibawa oleh rasul. Dan mereka menjadikan kitabKu, hujjah-hujjahKu dan siksaan yang mereka diperingatkan dengannya sebagai bahan olokan dan ejekan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Dan Kami tidaklah mengutus para rasul melainkan sebagai pembawa kabar gembira untuk orang-orang beriman dan taat, dan pemberi peringatan kepada orang-orang kafir dan bermaksiat, para Rasul itu tidak memiliki kekuasaan atas hati manusia agar mereka mendapatkan petunjuk, akan tetapi orang-orang kafir itu masih saja membantah para Rasul -padahal bukti-bukti kebenarannya begitu jelas bagi mereka- dengan tujuan untuk melenyapkan perkara hak yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- dengan kebatilan mereka, dan mereka hanyalah menjadikan Al-Qur`ān ini dan ayat-ayat ancaman bagi mereka sebagai bahan candaan dan olok-olokkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Dan Kami tidaklah mengutus para rasul melainkan untuk menyampaikan kabar gembira berupa surga atau peringatan berupa neraka. Akan tetapi orang-orang yang mendustakan itu mendebat dengan perkataan-perkataan yang batil agar dapat mengalahkan kebenaran! Mereka juga menjadikan ayat-ayat qur’aniyah dan kauniyah, dan azab yang menakutkan sebagai olokan dan gurauan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. وَمَا نُرْسِلُ الْمُرْسَلِينَ (Dan tidaklah Kami mengutus rasul-rasul) Kepada setiap umat. إِلَّا مُبَشِّرِينَ(hanyalah sebagai pembawa berita gembira) Bagi orang-orang beriman. وَمُنذِرِينَ ۚ( dan sebagai pemberi peringatan) Bagi orang-orang kafir. Maka para Rasul tersebut tidak akan mampu mengambil hati mereka menuju hidayah, sebab hal itu adalah kuasa Allah semata. وَيُجٰدِلُ الَّذِينَ كَفَرُوا۟ بِالْبٰطِلِ لِيُدْحِضُوا۟ بِهِ الْحَقَّ ۖ( tetapi orang-orang yang kafir membantah dengan yang batil agar dengan demikian mereka dapat melenyap kan yang hak) Yakni agar dengan bantahan batil itu mereka dapat melenyapkan kebenaran, seperti dengan perkataan mereka kepada para Rasul ”Kalian hanyalah manusia seperti kami” dan perkataan mereka lainnya. وَاتَّخَذُوٓا۟ ءَايٰتِى(dan mereka menganggap ayat-ayat kami) Yakni menganggap al-Qur’an. وَمَآ أُنذِرُوا۟( dan peringatan-peringatan terhadap mereka) Yakni ancaman dan peringatan bagi mereka. هُزُوًا(sebagai olok-olokan) Yakni sebagai bahan ejekan untuk olokan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Kami tidak mengutus rasul-rasul kecuali hanya sebagai pembawa berita gembira dan sebagai pemberi peringatan. Tetapi orang-orang yang kafir membantah dengan kebatilan dengan berkata: “Rasul hanya membawa keburukan.” Bermaksud agar dengan demikian mereka dapat melenyapkan yang haq. Mereka menganggap ayat-ayat kami dan peringatan-peringatan terhadap mereka sebagai olok-olokan dan hinaan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami tidak mengutus rasul-rasul melainkan sebagai pembawa kabar gembira dan pemberi peringatan. orang-orang kafir membantah dengan bathil agar mereka dapat melenyapkan} agar mereka dapat melenyapkan dan menghapuskan {sesuatu yang benar. Mereka menjadikan ayat-ayatKu dan apa yang diperingatkan terhadap mereka sebagai olok-olok} ejekan dan olok-olok"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Maksudnya, Kami tidak mengutus para rasul dengan sia-sia, bahkan pula agar manusia menjadikan mereka sebagai tuhan-tuhan, dan tidak untuk menyeru umat manusia kepada (kepentingan) pribadi para rasul. Akan tetapi, Kami mengirim mereka untuk mengajak umat manusia kepada setiap kebajikan dan melarang mereka dari segala kejelekan, membawa kabar gembira bagi mereka atas ketaatan terhadap hal tersebut (perintah dan larangan) dengan pahala dunia dan balasan akhirat, memberi mereka peringatan dari pelanggarannya dengan hukuman dunia dan akhirat. Dengan itu, hujjah Allah telah tegak berdiri kepada para hambaNya. Meskipun begitu, orang-orang yang zhalim dan kafir enggan untuk berbuat sesuatu melainkan melancarkan bantahan dengan kebatilan untuk melenyapkan kebenaran. Mereka mengusahakan cara apa pun yang bisa mereka tempuh untuk memenangkan kebatilan dan melenyapkan kebenaran serta merontokkannya. Mereka mengolok-olok para rasul Allah dan ayat-ayatNya. Mereka sudah cukup gembira dengan ilmu yang mereka miliki, \"dan Allah tidak menghendaki selain menyempurnakan cahaya-Nya, walaupun orang-orang yang kafir tidak menyukai.\" (AT-Taubah:32), dan memenangkan kebenaran di atas kebatilan. \"Sebenarnya Kami melontarkan yang hak kepada yang batil lalu yang hak itu menghancurkannya, maka dengan serta merta yang batil itu lenyap\" (Al-Anbiya:18) Termasuk pengaruh sifat hikmah Allah dan rahmatNya, bahwa pengerahan orang-orang yang batil dan membantah kebenaran dengan kebatilan, termasuk penting yang menuntun kepada kejelasan al-Haq, bukti-bukti dan dalil-dalilnya yang nyata, tersingkapnya kebatilan dari sisi kerusakannya. Sebab, dengan lawannya, segala sesuatu akan lebih jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 56: Bagi orang-orang yang beriman dengan surga. Bagi orang-orang yang kafir dengan neraka. Allah Subhaanahu wa Ta'aala tidaklah mengutus para rasul main-main, tidak pula agar manusia menjadikan mereka sebagai tuhan serta tidak pula agar mereka (para rasul) menyeru untuk kepentingan dirinya. Bahkan Allah Subhaanahu wa Ta'aala menutus para rasul untuk mengajak manusia kepada kebaikan dan melarang keburukan serta memberikan kabar gembira dan peringatan. Yaitu ucapan mereka, “Apakah Allah mengutus seorang manusia menjadi rasul?” Dengan diutusnya para rasul, maka hujjah Allah bagi manusia menjadi tegak, akan tetapi orang-orang kafir tidak menghendaki selain berbantah-bantahan menggunakan yang batil untuk mengalahkan yang benar. Mereka berusaha membela yang batil sesuai kemampuan demi mengalahkan yang hak, mereka memperolok rasul-rasul Allah dan ayat-ayat-Nya serta merasa bangga dengan ilmu yang mereka miliki. Akan tetapi, Allah Subhaanahu wa Ta'aala tidak menghendaki selain menyempurnakan cahayanya meskipun orang-orang yang kafir benci. Termasuk hikmah Allah dan rahmat-Nya adalah diadakan-Nya orang-orang yang melawan kebenaran dengan kebatilan agar kebenaran semakin jelas dan kebatilan semakin terlihat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 56",
    "description": "Dan kami tidak mengutus rasul-rasul termasuk engkau wahai nabi Muhammad, melainkan sebagai pembawa kabar gembira dan pemberi peringatan kepada manusia agar mereka beriman, tetapi orang yang kafir terus-menerus membantah para rasul itu dengan cara yang batil agar dengan demikian mereka dapat melenyapkan yang hak, yakni kebenaran ayatayat Allah dan mereka menjadikan ayat-ayat-ku dan apa yang diperingatkan terhadap mereka oleh para rasul sebagai olok-olokan. Mereka berkata bahwa para rasul hanyalah seorang manusia dan apa yang dikatakan oleh mereka hanyalah kebohongan belaka. Dan siapakah yang lebih zalim, yakni tidak ada yang lebih zalim dari pada orang yang telah diperingatkan dengan ayat-ayat tuhannyadengan bermacam-macam cara, lalu dia berpaling darinya tidak mau memikirkan dan merenungkannya, dan melupakan apa yang telah dikerjakan oleh kedua tangannya, yakni kejahatan yang mereka lakukan. Sungguh, kami telah menjadikan hati mereka tertutup sehingga mereka tidak memahaminya, dan kami letakkan pula sumbatan di telinga mereka, sehingga mereka terhalang dari mendengar dan memahami ayat-ayat Allah yang terkandung dalam kitab suci. Kendatipun engkau wahai nabi Muhammad menyeru mereka kepada petunjuk agar mereka beriman dan taat kepada Allah, niscaya mereka tidak akan mendapat petunjuk untuk selama-lamanya karena kerasnya hati mereka dalam mengingkari ayat-ayat Allah."
  }
]