[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak ada orang yang lebih zhalim daripada orang yang diberi nasihat dengan ayat-ayat tuhannya yang nyata, namun dia pergi berpaling darinya menuju kebatilannya. Dia lupa apa yang telah diperbuat kedua tangannya, berupa tindakan-tindakan buruk sehingga dia tetap tidak mau kembali (kepada kebenaran). Sesungguhnya Kami menjadikan pada hati mereka penutup-penutup, sehingga mereka tidak dapat memahami al-qur’an dan tidak mengerti kebaikan yang ada di dalamnya. Dan kami jadikan pada telinga-telinga mereka sumbatan yang menyerupai ketulian. Sehingga mereka tidak dapat mendengarnya dan tidak dapat memperoleh manfaat darinya. Bila engkau ajak mereka untuk beriman, maka mereka tidak menerima dan tidak mengetahui jalan menuju Allah selama-lamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Dan tidak ada yang lebih zalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, namun ia tidak menghiraukan kandungannya berupa ancaman akan suatu azab, bahkan berpaling dari mengambil ibrah darinya, dan melupakan amalan buruknya di dunia berupa kekufuran dan maksiat yang ia tidak bertobat darinya. Sesungguhnya orang-orang yang memiliki sifat seperti ini Kami jadikan hati mereka tertutup sehingga menghalanginya untuk memahami Al-Qur`ān, dan Kami letakkan pula sumbatan di telinga mereka sehingga mereka tidak menerima apa yang mereka dengar. Kendati pun engkau menyeru mereka kepada keimanan, mereka tidak akan pernah menerima seruan itu selama hati mereka tertutup dan telinga mereka tersumbat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Tidak ada yang lebih zalim daripada orang yang diperingatkan dengan ayat-ayat Allah yang jelas namun dia melalaikannya dan melupakan dosa-dosa yang telah dia lakukan. Sungguh Kami telah menjadikan di hati mereka penutup agar mereka tidak dapat memahami al-Qur’an dan menjadikan di telinga mereka ketulian agar mereka tidak dapat mendengar kebaikan. Dan jika kamu menyeru mereka kepada keimanan niscaya mereka tidak akan mendapat petunjuk selamanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِـَٔايٰتِ رَبِّهِۦ فَأَعْرَضَ عَنْهَا (Dan siapakah yang lebih zalim dari pada orang yang telah diperingatkan dengan ayat-ayat Tuhannya lalu dia berpaling dari padanya) Dan tidak mentadabburi dan mentafakkurinya dengan sebenar-benarnya, وَنَسِىَ مَا قَدَّمَتْ يَدَاهُ ۚ( dan melupakan apa yang telah dikerjakan oleh kedua tangannya) Yakni kekafiran dan kemaksiatan yang mereka kerjakan dan mereka belum bertaubat dari perbuatan tersebut. إِنَّا جَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ(Sesungguhnya Kami telah meletakkan tutupan di atas hati mereka, (sehingga mereka tidak) memahaminya) Yakni sumbatan yang menjadi penghalang antara hati mereka dan pemahaman mengenai ayat-ayat Allah, yang berupa kebencian mereka terhadap kebenaran. وَفِىٓ ءَاذَانِهِمْ وَقْرًا ۖ( dan (Kami letakkan pula) sumbatan di telinga mereka) Yakni beban yang menghalangi mereka untuk menyimaknya. وَإِن تَدْعُهُمْ إِلَى الْهُدَىٰ فَلَن يَهْتَدُوٓا۟ إِذًا أَبَدًا(dan kendatipun kamu menyeru mereka kepada petunjuk, niscaya mereka tidak akan mendapat petunjuk selama-lamanya) Sebab Allah telah menutup hati mereka karena kekafiran dan kemaksiatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Siapakah yang lebih zalim dari pada orang yang telah diperingatkan dengan ayat-ayat Tuhannya lalu justr dia berpaling sehingga tidak mau mengambil pelajaran sedikitpun, juga melupakan perbuatan yang dilakukan kedua tangannya berupa kemaksiatan dan kekufuran? Juga tidak bertaubat atas itu semua. Sesungguhnya Kami telah meletakkan tutup di atas hati mereka, sehingga mereka tidak memahaminya. Kami letakkan pula sumbatan di telinga mereka; kendatipun kamu menyeru petunjuk kepada mereka, niscaya mereka tidak akan mendapat petunjuk selama-lamanya sebab kerasnya hati mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Siapakah} tidak ada {yang lebih zalim daripada orang yang telah diperingatkan} diberi pelajaran {dengan ayat-ayat Tuhannya, lalu dia berpaling} berpaling {darinya dan melupakan apa yang telah dikerjakan oleh kedua tangannya. Sesungguhnya Kami telah meletakkan pada hati mereka penutup} penutup {agar mereka tidak memahaminya} agar mereka tidak memahami Al-Qur’an sebagai hukuman bagi mereka {dan di telinga mereka ada sumbatan} ketulian yang parah, agar mereka tidak mendengarkannya agar paham {Jika kalian menyeru mereka kepada petunjuk, maka mereka tidak akan mendapat petunjuk untuk selama-lamanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Allah memberitahukan bahwa tidak ada tindakan kezhaliman yang paling fatal dan kejahatan yang paling besar, dari seseorang hamba yang sudah diingatkan dengan ayat-ayat Allah dan dijelaskan kepadanya kebenaran dari kebatilan, petunjuk dari kesesatan, ditakut-takuti, diperingatkan dan dianjurkan (dengan balasan baik), akan tetapi dia berpaling muka darinya, tidak sudi mengambil pelajaran dari peringatan yang diarahkan kepadanya, serta meninggalkan kebiasaan lamanya “dan melupakan sesuatu yang dikerjakan oleh kedua tangannya,” yang berpa dosa-dosa. Tidak bermuraqabah kepada ‘Allamul ghuyub (Dzat Yang Maha Mengetahui alam ghaib). Ini lebih besar kezhalimannya daripada orang yang berpaling tapi memang belum pernah didatangi ayat-ayat Allah dan belum diperingatkan dengannya –meskipun orang ini juga telah berbuat zhalim- akan tetapi orang tadi lebih dahsyat kezhalimannya daripada orang ini, karena dia melanggar atas dasar pengetahuan dan ilmu, dan lebih besar (kezhalimannya) dibandingkan orang yang keadaannya tidak demikian. Allah menghukumnya lantaran berpaling dari ayat-ayatNya dan melupakan dosa-dosanya, serta tenang dengan dirinya dalam kondisi buruk, padahal mengetahuinya, dengan hukuman menutup pintu-pintu hidayah baginya, dalam bentuk meletakkan tutup (akinnah) di atas hatinya yaitu penutup-penutup kuat yang menghalanginya untuk memahami ayat-ayat Allah meskipun dia mendengarnya. Tidak mungkin dia bisa mengusahakan pemahaman yang sanggup menembus hatinya. “Dan (Kami letakkan pula) sumbatan di telinga mereka,” maksudnya ketulian yang mengganjal mereka untuk sanggup mencapai ayat-ayat dan mendengarkannya guna mencari manfaat. Bila kondisi mereka semacam ini, maka tidak ada jalan hidayah bagi mereka. “Dan kendatipun kamu menyeru mereka kepada petunjuk, niscaya mereka tidak akan mendapat petunjuk selama-lamanya,” karena orang yang diharapkan menyambut keterangan dari penyeru adalah orang yang tidak berilmu. Sementara mereka yang telah mengetahui kemudian membutakan diri, melihat jalan kebenaran, lantas mereka tinggalkan, (dan melihat) jalan kesesatan justru mereka tempuh, maka Allah menimpakan hukuman atas mereka dengan mengunci hati-hati mereka dan mematrinya. Tidak ada rekayasa dan jalan untuk memberi hidayah kepada mereka lagi. Dalam ayat ini, terdapat takhwif (menakut-nakuti) bagi orang yang meninggalkan kebenaran setelah mengetahuinya berupa dihalanginya antara dia dengan hidayah, dan sudah tidak mungkin lagi setelah itu ada kejadian yang lebih menakutkan dan membuatnya jera dari kesesatannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 57: Diterangkan kebenaran dan petunjuk kepadanya serta diberi targhib dan tarhib. Berupa kekafiran dan kemaksiatan serta tidak merasakan pengawasan Allah Subhaanahu wa Ta'aala. Ia tidak ingat peringatan itu dan tidak kembali dari sikap itu. Ia lebih zalim daripada orang yang berpaling karena belum datang ayat-ayat Allah kepadanya, meskipun ia zalim juga, namun masih di bawah orang yang tadi. Hal itu, karena orang yang bermaksiat di atas ilmu jelas lebih besar dosanya daripada orang yang tidak seperti itu. Oleh karena orang tersebut berpaling dari ayat-ayat-Nya, melupakan dosa-dosanya, ridha dengan keburukan terhadap dirinya padahal dia mengetahui, maka Allah hukum dengan menutup pintu-pintu hidayah, yakni dengan menjadikan hatinya tertutup sehingga ia tidak dapat memahami ayat-ayat Allah meskipun mendengarnya. Jika keadaan mereka seperti ini, maka tidak ada jalan untuk menunjukkan mereka. Yang demikian karena ketika mereka melihat yang hak (benar), mereka tinggalkan, ketika melihat yang batil mereka malah menempuhnya, maka Allah hukum dengan mengunci hati mereka dan mengecapnya, sehingga tidak ada cara dan jalan untuk memberinya petunjuk. Dalam ayat di atas terdapat ancaman bagi orang yang meninggalkan kebenaran setelah mengetahuinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 57",
    "description": "Dan siapakah yang lebih zalim, yakni tidak ada yang lebih zalim dari pada orang yang telah diperingatkan dengan ayat-ayat tuhannyadengan bermacam-macam cara, lalu dia berpaling darinya tidak mau memikirkan dan merenungkannya, dan melupakan apa yang telah dikerjakan oleh kedua tangannya, yakni kejahatan yang mereka lakukan. Sungguh, kami telah menjadikan hati mereka tertutup sehingga mereka tidak memahaminya, dan kami letakkan pula sumbatan di telinga mereka, sehingga mereka terhalang dari mendengar dan memahami ayat-ayat Allah yang terkandung dalam kitab suci. Kendatipun engkau wahai nabi Muhammad menyeru mereka kepada petunjuk agar mereka beriman dan taat kepada Allah, niscaya mereka tidak akan mendapat petunjuk untuk selama-lamanya karena kerasnya hati mereka dalam mengingkari ayat-ayat Allah. Dan tuhanmu maha pengampun, memiliki kasih sayang. Jika dia hendak menyiksa mereka karena perbuatan mereka, tentu dia akan menyegerakan siksa bagi mereka, sesuai dengan hak dan keadilan-Nya. Allah dengan kasih sayang-Nya tidak menyegerakan siksaan untuk memberikan kesempatan kepada mereka untuk bertobat. Tetapi bagi mereka ada waktu tertentu untuk mendapat siksa yang mereka tidak akan menemukan tempat berlindung dari-Nya."
  }
]