[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tuhanmu maha pengampun terhadap dosa-dosa anak adam, jika mereka mau bertaubat. Dia mempunyai rahmat kepada mereka. kalau seandainya Dia menyegerakan azab bagi orang-orang yang berpaling dari ayat-ayatNya dikarenakan dosa-dosa yang mereka berbuat, dari dosa-dosa dan kesalahan, pastilah Dia akan menyegerakan azab bagi mereka. Namun Allah mahapenyantun, tidak menyegerakan siksaan. bahkan mereka itu sudah mempunyai ketentuan waktu yang mereka akan memperoleh balasannya sesuai dengan amal perbuatannya pada waktu tersebut. Tidak ada tempat berlindung dan tempat berlari darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Dan agar Muhammad -ṣallallāhu 'alaihi wa sallam- tidak mengharapkan waktu disegerakannya azab atas orang-orang yang mendustakannya, maka Allah berfirman kepadanya, \"Dan Tuhanmu -wahai Rasul- Maha Pengampun atas dosa-dosa hamba-Nya yang bertobat kepada-Nya, memiliki rahmat yang meliputi segala sesuatu, dan diantara rahmat-Nya; Dia tidak menyegerakan datangnya azab atas orang-orang yang bermaksiat agar mereka segera bertobat kepada-Nya. Seandainya Allah berkehendak menyiksa orang-orang yang berpaling itu, niscaya Dia akan menyegerakan azab bagi mereka di kehidupan dunia ini, akan tetapi Dia Maha Pemurah lagi Penyayang, Dia menunda azab bagi mereka agar mereka bertobat, bahkan mereka memiliki waktu dan tempat tertentu untuk mendapatkan azab lantaran kekafiran dan pembangkangan mereka bila mereka tidak bertobat, dan dalam azab tersebut mereka tidak akan mendapatkan tempat berlindung dari-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Allah menyampaikan keluasan rahmat dan ampunan-Nya. Seandainya Allah menyiksa orang-orang berdosa akibat dosa-dosa yang mereka lakukan niscaya mereka akan ditimpa azab di dunia secara tiba-tiba; namun Allah menangguhkan mereka agar mereka mau bertaubat. Mereka telah memiliki waktu tertentu untuk mendapat perhitungan dan siksaan, dan mereka tidak akan mendapatkan pelindung dan penyelamat selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَرَبُّكَ الْغَفُورُ ذُو الرَّحْمَةِ ۖ (Dan Tuhanmulah yang Maha Pengampun, lagi mempunyai rahmat) Yakni memiliki ampunan yang banyak dan pemilik rahmat yang luas sehingga dapat meliputi segala sesuatu, oleh sebab itu Allah tidak menyegerakan azab mereka. لَوْ يُؤَاخِذُهُم بِمَا كَسَبُوا۟ (Jika Dia mengazab mereka karena perbuatan mereka) Yang berupa berbagai kemaksiatan dan di antaranya adalah kekafiran, serta bantahan dan keberpalingan mereka terhadap kebenaran. لَعَجَّلَ لَهُمُ الْعَذَابَ ۚ (tentu Dia akan menyegerakan azab bagi mereka) Sebab mereka layak untuk mendapatkannya. بَل لَّهُم مَّوْعِدٌ (Tetapi bagi mereka ada waktu yang tertentu (untuk mendapat azab)) Yakni waktu yang telah ditentukan untuk mengazab mereka. لَّن يَجِدُوا۟ مِن دُونِهِۦ مَوْئِلًا (mereka sekali-kali tidak akan menemukan tempat berlindung dari padanya) Yakni tempat untuk mereka berlindung."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara hikmah penyebutan kisah Musa dan Khidr setelah ayat : { وَرَبُّكَ ٱلْغَفُورُ ذُو ٱلرَّحْمَةِ ۖ لَوْ يُؤَاخِذُهُم بِمَا كَسَبُوا۟ لَعَجَّلَ لَهُمُ ٱلْعَذَابَ } \"Dan Tuhanmulah yang Maha Pengampun, lagi mempunyai rahmat. Jika Dia mengazab mereka karena perbuatan mereka, tentu Dia akan menyegerakan azab bagi mereka\" Untuk memberi tahu Nabi-Nya bahwa meninggalkan Allah adalah jalan mempercepat datangnya azab bagi orang-orang musyrik; tanpa panda bulu siapa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Tuhanmulah Tuhan Yang Maha Pengampun, lagi mempunyai keluasan rahmat. Jika Dia mengazab mereka karena perbuatan mereka, tentu Dia akan menyegerakan azab bagi mereka. Tetapi bagi mereka ada waktu tertentu untuk mendapat azab. Mereka sekali-kali tidak akan menemukan tempat berlindung dari azab itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Tuhanmu Maha Pengampun lagi Maha Pemilik rahmat. Seandainya Dia hendak menyiksa mereka karena perbuatan mereka, tentu Dia akan menyegerakan siksa bagi mereka. Namun bagi mereka itu ada waktu} waktu yang telah ditentukan {yang mereka tidak akan menemukan tempat berlindung} tempat berlindung yang dia gunakan untuk berlindung {selain Dia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Kemudian Allah memberitahukan tentang luasnya ampunan dan rahmatNya, Dia mengampuni dosa-dosa dan menerima taubat orang yang bertaubat kepadaNYa. Selanjutnya, DIa mengucurkan kepadanya rahmat dan meliputinya dengan kebaikanNya. Sesungguhnya bila dia menyiksa para hambaNya atas dosa-dosa yang mereka perbuat, niscaya DIa benar-benar akan menyegerakan azab bagi mereka. Namun, Allah Mahasabar, tidak mempercepat penjatuhan hukuman. Bahkan memberikan penundaan, tapi tidak melupakan. Dan dosa pasti mendatangkan pengaruh buruknya, meskipun terjadinya agak terlambat setelah jangka waktu yang lama. Oleh karena itu, Allah berfirman, “Tetapi bagi mereka ada waktu tertentu (untuk mendapat azab) yang mereka sekali-kali tidak akan menemukan tempat berlindung darinya,” maksudnya, mereka telah mendapatkan waktu tertentu untuk menerima balasan atas amal perbuatan mereka. Pasti itu terjadi pada mereka, tidak ada alternative pilihan untuk mereka, tidak ada tempat untuk berlindung darinya, tidak ada tempat menyembunyikan dan melarikan diri darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 58: Allah Subhaanahu wa Ta'aala memberitahukan tentang luasnya ampunan dan rahmat-Nya, dan bahwa Dia mengampuni dosa-dosa semuanya. Allah akan menerima tobat orang yang bertobat, lalu melimpahkan rahmat dan ihsan-Nya. Akan tetapi Dia Maha Penyantun, tidak segera mengazab, bahkan menunda tetapi bukan berarti membiarkan, karena dosa-dosa itu tetap ada pengaruhnya meskipun telah berlalu masa yang panjang. Meskipun begitu, Dia mengajak hamba-hamba-Nya agar bertobat dan kembali kepada-Nya. Jika mereka bertobat dan kembali, maka Dia akan mengampuni dan merahmati mereka serta menyingkirkan siksaan dari mereka. Tetapi apabila mereka tetap terus di atas kezaliman dan sikap membangkang, maka ketika waktu yang dijanjikan datang, Allah akan menimpakan siksa-Nya. Seperti pada hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 58",
    "description": "Dan tuhanmu maha pengampun, memiliki kasih sayang. Jika dia hendak menyiksa mereka karena perbuatan mereka, tentu dia akan menyegerakan siksa bagi mereka, sesuai dengan hak dan keadilan-Nya. Allah dengan kasih sayang-Nya tidak menyegerakan siksaan untuk memberikan kesempatan kepada mereka untuk bertobat. Tetapi bagi mereka ada waktu tertentu untuk mendapat siksa yang mereka tidak akan menemukan tempat berlindung dari-Nya. Demikianlah azab dan siksa yang Allah timpakan kepada umatumat terdahulu. Dan penduduk negeri itu, misalnya kaum 'ad dan kaum Å amud, telah kami binasakan ketika mereka berbuat zalim, dan telah kami tetapkan waktu tertentu bagi kebinasaan mereka. Apa yang telah terjadi pada kaum 'ad dan Å amud itu dapat pula terjadi bagi siapa pun yang durhaka apabila Allah meng."
  }
]