[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "negeri-negeri yang dekat dengan kalian itu (seperti negeri kaum Hud, shaleh, luth, dan negeri kuam syuaib) Kami telah binasakan negeri-negeri itu, ketika para penduduknya berbuat kezhaliman dengan berbuat kekafiran dan Kami telah menentukan waktu dan saat untuk kebinasaan mereka, ketika mereka telah sampai pada waktu tersebut, maka siksaan menimpa mereka, lalu Allah membinasakan mereka dengannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Dan penduduk negeri kafir yang dekat dari negeri kalian itu, seperti negeri Kaum Hūd, Ṣāleḥ, dan Syu'aib, Kami telah binasakan ketika mereka menzalimi diri mereka sendiri dengan berbuat kafir dan maksiat, dan Kami telah tentukan waktu untuk kebinasaan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Itulah negeri-negeri yang dulunya makmur penduduknya, seperti negeri kaum Hud, Shalih, dan Nuh; Kami hancurkan mereka ketika mereka menzalimi diri mereka sendiri dengan kekafiran, dan kehancuran mereka telah Kami tetapkan waktunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَتِلْكَ الْقُرَىٰٓ (Dan (penduduk) negeri) Yakni negeri ‘Aad, Tsamud, dan semisalnya. أَهْلَكْنٰهُمْ لَمَّا ظَلَمُوا۟( telah Kami binasakan ketika mereka berbuat zalim) Dengan kekafiran dan kemaksiatan mereka. وَجَعَلْنَا لِمَهْلِكِهِم مَّوْعِدًا (dan telah Kami tetapkan waktu tertentu bagi kebinasaan mereka) Yakni waktu yang telah ditentukan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sebagian orang merasa heran bahkan berputus asah, mereka melihat sebagian orang-orang kafir terus berbuet kejahatan dan kezhaliman, namun demikian Allah belum mengazab mereka, akan tetapi siapa yang memahami sunatullah, dan apa yang terjadi pada ummat-ummat terdahulu tidak akan heran dengan keadaan ini, karena memahami bahwa orang-orang kafir itu sedang menjalani hidup dengan sunnah istidroj yang membawa mereka untuk terus berbuat kezhaliman, dengan demikian pada akhirnya mereka akan binasa, namun tentunya pada waktu yang telah ditetapkan oleh Allah, Allah befirman : { وَجَعَلْنَا لِمَهْلِكِهِمْ مَوْعِدًا } \"dan telah Kami tetapkan waktu tertentu bagi kebinasaan mereka\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Penduduk adanya negeri ‘Ad dan Tsamud telah Kami binasakan ketika mereka berbuat zalim atas diri mereka sendiri dengan kekufuran dan dusta kepada rasul mereka. Kami telah tetapkan waktu tertentu bagi kebinasaan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Negeri-negeri itu telah Kami binasakan ketika mereka berbuat zalim dan Kami telah menetapkan bagi kebinasaan mereka} kehancuran mereka {waktu} waktu tertentu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Ini merupakan ketetapan Allah pada orang-orang terdahulu dan yang akan datang, yaitu tidak menyegerakan penjatuhan hukuman atas mereka. Bahkan Dia mengundang mereka untuk bertaubat dan kembali (kepadaNya). Bila mereka mau bertaubat dan kembali, niscaya Allah mengampuni dan mengasihi mereka, namun kalau mereka tidak (bertaubat dan kembali) dan mereka terus melangsungkan kezhaliman dan penentangan mereka, dan waktu yang sudah ditetapkan bagi mereka sudah datang, niscaya Allah menurunkan siksaanNYa pada mereka. Oleh sebab itu, Allah berfirman “Dan (penduduk) negeri itu telah Kami binasakan ketika mereka berbuat zhalim,” maksudnya disebabkan tindakan kezhaliman mereka, bukan disebabkan kezhaliman Kami “dan telah Kami tetapkan waktu tertentu bagi kebinasaan mereka,” yaitu waktu yang sudah ditentukan, mereka tidak mendahului atau mundur darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 59: Seperti kaum ‘Aad, Tsamud, dsb. Yakni bukan karena Kami menzalimi mereka. Yang tidak maju dan tidak pula mundur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 59",
    "description": "Demikianlah azab dan siksa yang Allah timpakan kepada umatumat terdahulu. Dan penduduk negeri itu, misalnya kaum 'ad dan kaum Å amud, telah kami binasakan ketika mereka berbuat zalim, dan telah kami tetapkan waktu tertentu bagi kebinasaan mereka. Apa yang telah terjadi pada kaum 'ad dan Å amud itu dapat pula terjadi bagi siapa pun yang durhaka apabila Allah mengdan ingatlah wahai nabi Muhammad, ketika nabi musa berkata kepada pembantunya yang juga muridnya, aku tidak akan berhenti berjalan sebelum sampai ke pertemuan dua laut; atau aku akan berjalan terus sampai bertahun-tahun lamanya tanpa henti. Terdapat perbedaan pendapat tentang siapa yang dimaksud dengan pembantu atau murid nabi musa yang disebut dalam ayat ini. Menurut sebagian besar ulama, ia adalah seorang pemuda bernama yusya' bin nun, ia adalah salah seorang dari keturunan nabi yusuf. Ada juga yang berpendapat bahwa pemuda itu itu adalah kemenakan nabi musa, yakni anak saudara perempuannya. Demikian juga terdapat perbedaaan pendapat tentang apa yang dimaksud pertemuan dua laut pada ayat ini. Di antara pendapat itu mengatakan bahwa yang dimaksud dengan dua laut ialah laut merah dan laut putih, dan tempat pertemuan itu ialah danau at-timsah dan danau murrah, yang merupakan pertemuan antara teluk aqabah dan suez di laut merah."
  }
]