[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mungkin saja (engkau wahai rasul), akan membinasakan dirimu sendiri lantaran kedukaan dan kesedihan akibat penolakan kaummu dan mereka berpaling darimu, ketika mereka belum mau beriman kepada Al-qur’an ini dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Maka boleh jadi engkau -wahai Rasul- akan mencelakakan dirimu karena kecewa dan bersedih hati bila mereka tidak beriman kepada Al-Qur`ān ini. Maka janganlah engkau melakukannya sebab pemberian hidayah itu bukanlah tanggung jawabmu, akan tetapi engkau hanya bertugas untuk menyampaikan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Hai Nabi, janganlah kamu membinasakan dirimu karena kesedihan akibat mereka berpaling dari dakwahmu dan kedustaan mereka terhadap al-Qur’an."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. فَلَعَلَّكَ بٰخِعٌ نَّفْسَكَ (Maka (apakah) barangkali kamu akan membunuh dirimu) Yakni membinasakan dirimu sendiri. عَلَىٰٓ ءَاثٰرِهِمْ(setelah mereka berpaling) Yakni setelah keberpalingan mereka. إِن لَّمْ يُؤْمِنُوا۟ بِهٰذَا الْحَدِيثِ(sekiranya mereka tidak beriman kepada keterangan ini) Yakni kepada al-Qur’an. أَسَفًا (karena bersedih hati) Yakni rasa jengkel atau sedih atas perkataan mereka dan kekafiran mereka yang lain. Yakni maksud dari ayat ini adalah, wahai Muhammad, janganlah kamu terlalu membesarkan urusan ini, sebab tugasmu dalam pengutusan ini adalah agar kamu menyampaikan risalah kepada mereka, dan kamu tidak dituntut untuk memasukkan keimanan ke dalam hati mereka; oleh sebab itu janganlah kamu merusak dirimu karena kesedihan atas kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Maka apakah barangkali kamu akan membinasakan dirimu karena bersedih hati setelah mereka berpaling dari keimanan, sekiranya mereka tidak beriman kepada Al-Quran. Maka jangan sedih atas sikap mereka sebab tugas utamamu adalah menyampaikan risalah Allah, dan kamu tidak dimintai pertanggungjawaban atas beriman atau tidaknya mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Boleh jadi kamu akan mencelakakan} menghancurkan {dirimu karena bersedih} bersedih atas kekufuran mereka {keberpalingan mereka jika mereka tidak beriman kepada keterangan ini} Al-Qur’an"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. Ketika Rasulullah mempunyai animo tinggi untuk memberikan hidayah kepada manusia, berupa sekuat tenaga untuk mencapainya, maka beliau bergembira dan bersuka cita dengan tercapanya kesadaran hidayah pada orang-orang, dan (sebaliknya) bersedih hati serta berduka cita terhadap orang-orang yang mendustakan lagi sesat karena rasa iba dan kasihan beliau kepada mereka, maka Allah membimbing beliau supaya tidak menyibukkan dirinya dengan rasa iba kepada orang-orang yang tidak beriman terhadap al-Quran ini. Sebagaimana Allah berfirman dalam (ayat) yang lain, \"Boleh jadi kamu (Muhammad) akan membinasakan dirimu, karena mereka tidak beriman.\" (Asy-Syuara:3), dan Allah berfirman, \"maka janganlah dirimu binasa karena kesedihan terhadap mereka. Sesungguhnya Allah Maha Mengetahui apa yang mereka perbuat.\" (Fathir:8). Di sini Allah berfirman, “maka (apakah) barangkali kamu akan membunuh dirimu,” maksudnya membinasakan dirimu disebabkan kegalauan hati dan rasa prihatin kepada mereka. Padahal pahalamu sudah pasti ditanggung oleh Allah, sedangkan merekka itu, seandainya Allah mengetahui ada kebaikan pada diri mereka, niscaya Allah akan memberi petunjuk. Akan tetapi, Allah mengetahui bahwa mereka tidak pantas kecuali untuk api neraka saja. Oleh karena itu, Allah menelantarkan mereka, tidak memberikan hidayah kepada mereka. Maka, perhatianmu (yang menyita) dirimu lantaran kepedihan hati dan keprihatinan kepada mereka tidak ada gunanya bagimu. Dalam ayat ini dan ayat yang semisalnya terdapat pelajaran, bahwa orang yang diperintahkan menyeru manusia ke jalan Allah, wajib baginya menyampaikan dan berupaya menempuh cara yang dapat mengantarkan menuju jalan hidayah, menutup semua jalan kesesatan dan kebinasaan dengan kemampuan maksimalnya, dilandasi dengan bertawakal kepada Allah. Jika mereka mendapatkan petunjuk, maka alangkah indahnya kenikmatan hidayah itu. Kalau tidak, maka tidak perlu bersedih dan berduka cita. Sebab, perasaan itu dapat melemahkan jiwa dan menghancurkan kekuatan. Tidak ada faidahnya. Justru, (sebaiknya) tetap meneruskan pekerjaan yang dibebankan kepadanya dan berjalan kea rah sana. Adapun selain itu, maka di luar batas kemampuannya. Jika nabi Muhammad saja diberi Firman oleh Allah, \"Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi,\" (Al-Qashash:56), dan Musa berkata, \"\"Ya Tuhanku, aku tidak menguasai kecuali diriku sendiri dan saudaraku. Sebab itu pisahkanlah antara kami dengan orang-orang yang fasik itu\" (Al-Maidah:25), maka orang-orang selain mereka termasuk yang lebih utama (untuk memahami hal itu). Allah berfirman, \"Maka berilah peringatan, karena sesungguhnya kamu hanyalah orang yang memberi peringatan. Kamu bukanlah orang yang berkuasa atas mereka,\"(Al-Ghasyiah:21-22)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 6: Oleh karena Nabi shallallahu 'alaihi wa sallam ingin sekali dan bergembira jika manusia ketika itu mendapat hidayah dan Beliau berusaha sekuat tenaga untuknya, namun ketika manusia berpaling dan mendustakannya, Beliau pun bersedih karena kasihan kepada mereka, maka Allah Subhaanahu wa Ta'aala mengarahkan Beliau agar tidak menyibukkan dirinya dengan sedih memikirkan sikap mereka. Hal itu, karena pahala Beliau sudah pasti akan diberikan Allah, dan mereka yang berpaling itu, jika sekiranya Allah mengetahui bahwa dalam hati mereka ada kebaikan niscaya Dia akan memberi hidayah, akan tetapi Dia mengetahui, bahwa mereka lebih cocok masuk ke neraka, sehingga Dia telantarkan mereka dan tidak memberinya petunjuk. Oleh karena itu, sibuk dengan sedih memikirkan mereka tidak ada faedahnya bagimu. Dalam ayat ini dan yang semisalnya terdapat pelajaran, bahwa orang yang diperintahkan Allah untuk menyampaikan (seperti rasul dan orang yang diberi ilmu), tugasnya hanyalah menyampaikan dan melakukan segala sebab agar mereka memperoleh hidayah, menutup pintu kesesatan sesuai kemampuan, sambil bertawakkal kepada Allah. Jika mereka mendapatkan petunjuk, maka sungguh bagus sekali, kalau pun tidak maka jangan bersedih, karena hal itu dapat melemahkan jiwa (membuat dirinya lemas), meretakkan kekuatannya dan tidak ada faedahnya, bahkan hendaknya ia teruskan amal yang dibebankan kepadanya. Selebihnya, maka hal itu di luar kemampuan. Jika Nabi shallallahu 'alaihi wa sallam saja dikatakan tidak mampu memberi petunjuk kepada orang yang Beliau cintai, dan Nabi Musa ‘alaihis salam saja mengatakan, “Wahai Tuhanku, sesungguhnya aku tidak berkuasa selain terhadap diriku dan saudaraku.” Maka selain mereka lebih tidak mampu lagi. Allah Subhaanahu wa Ta'aala berfirman, ”Maka berilah peringatan, karena sesungguhnya kamu hanyalah orang yang memberi peringatan. -Kamu bukanlah orang yang berkuasa atas mereka,” (Terj. Al Ghaasyiyah: 21-22)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 6",
    "description": "Maka akibat ucapan dan perbuatan kaum musyrikin itu, barangkali engkau wahai nabi Muhammad akan membunuh dirimu sendiri karena bersedih hati dan sangat kecewa setelah mereka berpaling dari dirimu dan menolak tuntunan yang engkau sampaikan, sekiranya mereka tidak beriman kepada keterangan ini, yakni Al-Qur'an. Wahai nabi Muhammad, janganlah bersedih hati karena perkataan dan perbuatan mereka. Engkau hanya diutus menyampaikan wahyu kepada mereka, dan tidak dibebankan kepadamu menjadikan mereka beriman. Sesungguhnya kami telah menjadikan apa yang ada di bumi, yakni beraneka macam hewan, tumbuh-tumbuhan dan kekayaan alam yang tersimpan di dalamnya sebagai perhiasan baginya, yakni bagi bumi dan indah dipandang oleh manusia, untuk kami menguji mereka, di dalam menyikapi keindahan bumi dengan segala isinya. Dengan demikian, kami mengetahui secara nyata siapakah di antara mereka yang terbaik perbuatannya, dan siapa yang jahat dan durhaka kepada tuhannya."
  }
]