[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah ketika musa berkata kepada pelayannya, yusya’ bin Nun, ”aku akan tetap meneruskan perjalananku hingga aku sampai pada tempat pertemuan dua lautan. atau aku akan terus berjalan dalam waktu yang lama hingga berjumpa dengan orang yang shalih itu untuk aku timba darinya ilmu yang tidak aku miliki."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Dan ingatlah -wahai Rasul- ketika Musa -'alaihissalām- berkata kepada pelayannya Yūsya' bin Nūn, \"Aku tidak akan berhenti berjalan hingga sampai pada tempat pertemuan dua lautan, atau aku akan terus berjalan hingga bertahun-tahun sampai menjumpai hamba yang saleh itu dan aku belajar darinya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Allah menyebutkan kisah Musa dengan Khidhir, ketika Musa berkata kepada pembantunya, Yusya’ bin Nun: “Aku akan terus berjalan hingga sampai di pertemuan dua laut” atau “Aku akan berjalan jauh hingga sampai di tempat itu agar aku dapat bertemu dengan Khidhir yang shalih itu, supaya dia dapat menambah ilmuku darinya”. Kisah ini dimulai ketika Musa bercakap dengan Bani Israil, kemudian dia ditanya: “Siapa manusia yang paling banyak ilmunya?” Maka Musa menjawab: “Aku”, sehingga Allah mengoloknya karena dia tidak menyatakan bahwa ilmunya itu dari Allah. Kemudian Allah mewahyukan kepadanya: “Aku memiliki seorang hamba yang berada di pertemuan dua laut, dia lebih banyak ilmunya darimu.” Maka Musa bertanya: “Ya Tuhanku, bagaimana aku dapat menemuinya?” Allah menjawab: “Bawalah ikan dengan keranjang, jika kamu telah kehilangan ikan itu maka itulah tempat yang kamu tuju.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَإِذْ قَالَ مُوسَىٰ (Dan (ingatlah) ketika Musa berkata) Yakni Musa bin Imran, Nabi yang diutus kepada Fir’aun. لِفَتَىٰهُ(kepada muridnya) Dia adalah Yusya’ bin Nun, dia selalu menyertai Nabi Musa untuk menimba ilmu darinya dan untuk menjadi pelayannya. لَآ أَبْرَحُ حَتَّىٰٓ أَبْلُغَ مَجْمَعَ الْبَحْرَيْنِ(Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua lautan) Yakni aku akan terus berjalan hingga aku sampai di sana. Terdapat pendapat mengatakan yang dimaksud dengan dua lautan adalah laut Urdun dan laut Merah, yakni pertemuan antara teluk Suez dan teluk Aqabah. Pendapat lain mengatakan yakni pertemuan antara dua lautan Tangier. أَوْ أَمْضِىَ حُقُبًا (atau aku akan berjalan sampai bertahun-tahun) Yakni aku akan berjalan dalam waktu yang sangat lama. Diriwayatkan bahwa Nabi Musa ditanya: “Siapakah orang yang paling berilmu?” Nabi Musa menjawab: “aku adalah yang paling berilmu.” Maka Allah menurunkan wahyu kepadanya: “Sesungguhnya orang yang paling berilmu adalah hamba-Ku yang berada di pertemuan dua lautan.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Imam Bukhori dalam shahihnya pada kitab al-'Ilm memberi judul suatu bab dengan (bab al-Khuruj atau al-Rihlatu wa as-Safar fi Thalabi al-'Ilm) dan beliau mencantumkan dalam bab itu kisah Musa -عليه السلام- tatkala melakukan perjalanan untuk bertemu dengan Nabi Khidr; untuk menimba 'Ilmu kepada beliau, dan ketika itu Khidr sedang berada ditempat yang dimana dua aut yang saling bertemu : { وَإِذْ قَالَ مُوسَىٰ لِفَتَىٰهُ لَآ أَبْرَحُ حَتَّىٰٓ أَبْلُغَ مَجْمَعَ ٱلْبَحْرَيْنِ أَوْ أَمْضِىَ حُقُبًا } \"Dan (ingatlah) ketika Musa berkata kepada muridnya: \"Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua buah lautan; atau aku akan berjalan sampai bertahun-tahun\" yakni : waktu yang sangat panjang demi mencari dan bertemu Khidr. 2 ). Sesungguhnya apa yang dimaksud Musa sehingga ia bersusah payah melakukan perjalanan panjang dengan kesabaran yang tinggi untuk mengambil Ilmu, padahal posisi Musa sebagai Nabi Allah, menunjukkan kedudukan ilmu yang begitu tinggi, dan tingginya kedudukan orang yang memilikinya, dan besarnya ketawadhuan orang yang diambil darinya ilmu itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Ingatlah wahai Nabi ketika Musa bin Imran berkata kepada pembantu dan muridnya Yusya’ bin Nun keturunan Nabi Yusuf: \"Aku tidak akan berhenti berjalan sebelum sampai ke pertemuan dua buah lautan, - yaitu laut Urdun dan Laut Merah, atau pertemuan terusan Suez dengan teluk Uqbah. Dikatakan juga pada titik temu antara Laut putih dan samudera Antlantik- atau aku akan berjalan sampai bertahun-tahun\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika Musa berkata kepada pembantunya“} pelayannya Yusa’ bin Nun {Aku tidak akan berhenti} Aku akan terus berjalan {sampai ke pertemuan} pertemuan {dua laut atau aku akan berjalan bertahun-tahun”} berjalan sampai waktu yang lama sehingga aku mendapati orang alim ini sehingga aku bisa belajar darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Allah memberitahukan tentang NabiNya,Musa dan kecintaannya kepada kebaikan dan pencarian ilmu, bahwa beliau berkata kepada pemudanya, maksudnya, pelayannya yang menyertainya saat berada di rumah dan dalam perjalanan. Ia adalah Yusya’ bin Nun, Allah menceritakan setelah itu, “Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan sua belah lautan,” maksudnya aku akan tetap menempuh perjalan meskipun jarak semakin jauh dan kesulitan menghampiriku, sampai aku mencapai tempat pertemuan dua belah lautan. Ia adalah tempat yang sudah diwahyukan (oleh Allah) kepadanya, ‘Bahwa engkau akan menjumpai seorang hamba dari hamba-hamba Allah yang berilmu, dia memiliki ilmu yang tidak engkau punyai’. “Atau aku akan berjalan sampai bertahun-tahun,” maksudnya (sampai) jaraj yang jauh. Maknanya, kerinduan dan keinginanlah yang menyebabkan Musa berkata demikian kepada pelayannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 60: Allah Subhaanahu wa Ta'aala menerangkan tentang Nabi-Nya, yaitu Musa ‘alaihis salam, rasa cintanya kepada kebaikan dan mencari ilmu. Menurut ahli tafsir, murid Nabi Musa ‘alaihis salam itu adalah Yusya 'bin Nun, di mana ia menemani Nabi Musa ‘alaihis salam, melayaninya dan mengambil ilmu darinya. Di mana di tempat itu ada seorang hamba Allah yang dalam ilmunya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 60",
    "description": "Dan ingatlah wahai nabi Muhammad, ketika nabi musa berkata kepada pembantunya yang juga muridnya, aku tidak akan berhenti berjalan sebelum sampai ke pertemuan dua laut; atau aku akan berjalan terus sampai bertahun-tahun lamanya tanpa henti. Terdapat perbedaan pendapat tentang siapa yang dimaksud dengan pembantu atau murid nabi musa yang disebut dalam ayat ini. Menurut sebagian besar ulama, ia adalah seorang pemuda bernama yusya' bin nun, ia adalah salah seorang dari keturunan nabi yusuf. Ada juga yang berpendapat bahwa pemuda itu itu adalah kemenakan nabi musa, yakni anak saudara perempuannya. Demikian juga terdapat perbedaaan pendapat tentang apa yang dimaksud pertemuan dua laut pada ayat ini. Di antara pendapat itu mengatakan bahwa yang dimaksud dengan dua laut ialah laut merah dan laut putih, dan tempat pertemuan itu ialah danau at-timsah dan danau murrah, yang merupakan pertemuan antara teluk aqabah dan suez di laut merah. Maka ketika mereka, yakni nabi musa dan pembantunya sampai ke suatu tempat yang merupakan pertemuan dua laut itu, mereka lupa ikannya, yaitu bekal yang mereka bawa dalam perjalanan. Ketika keduanya lupa akan bekal yang mereka bawa, lalu ikan itu tiba-tiba hidup kemudian melompat dan mengambil jalannya ke laut itu menceburkan diri dan hilang tak dapat ditemukan lagi. Sungguh menakjubkan peristiwa itu. Persitiwa tersebut merupakan pertanda yang telah diketahui sebelumnya oleh nabi musa bahwa apa yang dituju telah dekat dan yang dicari hampir ditemukan."
  }
]