[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berdua pun tetap bersungguh-sungguh meneruskan perjalanan. Ketika mereka telah sampai pada tempat pertemuan dua laut, mereka berdua duduk di sisi sebuah batu. Dan mereka melupakan ikan yang Musa diperintahkan untuk membawanya sebagai perbekalan bagi mereka berdua. Dan yusya’ membawanya di dalam sebuah keranjang. Tiba-tiba ikan itu menjadi hidup dan melompat menuju laut dan mengambil jalannya yang terbuka ke laut itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Maka mereka berdua pun berjalan, dan ketika mereka berdua sampai pada tempat pertemuan dua lautan itu, mereka pun melupakan ikan yang mereka siapkan untuk bekal mereka berdua, lalu Allah menghidupkan ikan itu kembali, kemudian ikan itu mengambil jalannya kembali ke laut yang membentuk seperti ruang bawah tabah yang tak menampung air."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Setelah Musa dan pembantunya sampai di tempat bertemunya dua laut itu, mereka lupa ikan yang mereka bawa -dan ini adalah tanda mereka telah sampai di tujuan-; kemudian ikan itu kembali hidup dan melompat ke laut, dan berhenti di suatu batu di dalam air."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. فَلَمَّا بَلَغَا (Maka tatkala mereka sampai) Yakni Nabi Musa dan pembantunya. مَجْمَعَ بَيْنِهِمَا(ke pertemuan dua buah laut itu) Yakni pertemuan antara dua lautan. نَسِيَا حُوتَهُمَا(mereka lalai akan ikannya) Para ahli tafsir mengatakan bahwa Nabi Musa dan pembantunya membawa bekal ikan yang diasinkan yang dibawa dengan keranjang. Allah menjadikan hilangnya ikan tersebut sebagai alamat bagi mereka atas tercapainya apa yang mereka cari. فَاتَّخَذَ سَبِيلَهُۥ فِى الْبَحْرِ سَرَبًا(lalu ikan itu melompat mengambil jalannya ke laut itu) Yakni Allah menghidupkan ikan itu sehingga ikan tersebut melompat dan turun ke laut. Allah menyerupakan lompatan ikan ke laut seperti (السرب) yaitu lubang galian di tanah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Maka tatkala mereka sampai di pertemuan dua buah laut itu, mereka lalai akan ikannya, sejenis ikan paus. Adapun itu adalah tanda atas perwujudan permintaannya. Lalu ikan itu melompat mengambil jalannya ke laut itu. Perumpamaan lubang itu yaitu celah yang memanjang dan lerhalang lalu dia memasukinya dan bersembunyi disana"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika mereka sampai} musa dan pelayannya sampai {ke pertemuan dua laut} antara dua laut {mereka melupakan ikannya, lalu ikan itu melompat mengambil jalan ke laut itu} lalu ikan itu melompat mengambil jalannya di laut, sebuah jalan seperti terowongan yang tidak berisi air"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Ini merupakan tekad teguh darinya. Karena itu, dia menjalankannya. “Maka tatkala mereka sampai,” yaitu dia dan pelayannya “ke pertemuan dua buah laut itu, mereka lalai akan ikannya,” ada seekor ikan yang mereka bawa sebagai bekal dan makanan mereka. Ia telah diberitahu (sebelumnya) bahwa kapan saja ikan tersebut hilang, maka disitulah insan yang dia tuju berada “lalu mengambil,” yaitu ikan tersebut mengambil “jalannya,” jalannya “ke laut itu dengan pergi secara sembunyi-sembunyi,” ini termasuk tanda kebesaran Allah. Para ulama tafsir berkata, ‘SEsungguhnya ikan tersebut yang dijadikan perbekalan oleh mereka, ketika mereka sampai di tempat itu, (maka ikan itu) terkena air laut. Maka ia pergi secara sembunyi-sembunyi dengan izin Allah ke dalam lautan dan hidup bersama binatang-binatang laut lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 61: Yusya’ lupa membawa ikannya ketika berangkat, dan Musa lupa mengingatkannya. Ikan itu dibawa sebagai perbekalan keduanya dan untuk dimakan saat lapar, namun sebelumnya telah diberitahukan kepada Musa, bahwa apabila ia kehilangan ikan itu, maka di sanalah hamba itu berada. Para mufassir menerangkan, “Sesungguhnya ikan yang menjadi perbekalan keduanya, ketika mereka sampai ke tempat itu, ikan itu tersiram air laut dan terbawa ke laut dengan izin Allah, lalu menjadi hidup bersama ikan-ikan yang lain.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 61",
    "description": "Maka ketika mereka, yakni nabi musa dan pembantunya sampai ke suatu tempat yang merupakan pertemuan dua laut itu, mereka lupa ikannya, yaitu bekal yang mereka bawa dalam perjalanan. Ketika keduanya lupa akan bekal yang mereka bawa, lalu ikan itu tiba-tiba hidup kemudian melompat dan mengambil jalannya ke laut itu menceburkan diri dan hilang tak dapat ditemukan lagi. Sungguh menakjubkan peristiwa itu. Persitiwa tersebut merupakan pertanda yang telah diketahui sebelumnya oleh nabi musa bahwa apa yang dituju telah dekat dan yang dicari hampir ditemukan. Nabi musa dan pembantunya meneruskan perjalanan, maka ketika mereka telah melewati tempat hilangnya ikan itu dan keduanya hendak beristirahat sambil menyantap bekal yang mereka bawa, nabi musa berkata kepada pembantunya, bawalah kemari makanan (ikan) kita, sungguh kita telah merasa letih karena perjalanan kita yang jauh pada hari ini."
  }
]