[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika mereka meninggalkan tempat yang di situ mereka melupakan ikan, musa merasakan lapar. Diapun berkata kepada pelayannya, ”bawalah kemari makan siang kita. Sungguh kita telah mengalami kelelahan dalam perjalanan kita ini. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Maka ketika mereka telah melewati tempat itu, Musa berkata kepada pelayannya, \"Bawalah kemari makanan siang kita, sungguh kita telah merasa sangat letih karena perjalanan kita ini.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62-63. Ketika Musa telah melewati tempat bertemunya dua laut itu, dia berkata kepada Yusya’: “Bawa kemari ikannya agar kita dapat memakannya, sungguh kita telah lelah dalam berjalan”. Yusya’ menjawab: “Ingkatkah ketika kita berhenti di batu besar? Aku lupa memberitahukanmu perkara ikan itu, dan tidak ada yang membuatku lupa selain setan. Ikan yang diasinkan itu kembali hidup kemudian melompat ke air, sungguh itu adalah kejadian yang ajaib.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. فَلَمَّا جَاوَزَا (Maka tatkala mereka berjalan lebih jauh) Yakni setelah mereka melewati pertemuan dua lautan yang Allah jadikan sebagai tempat untuk bertemu dengan orang yang dituju Nabi Musa. قَالَ(berkatalah Musa) Nabi Musa berkata. لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا(kepada muridnya: “Bawalah kemari makanan kita) Nabi Musa hendak mendatanginya dengan membawa ikan mereka. لَقَدْ لَقِينَا مِن سَفَرِنَا هٰذَا نَصَبًا(sesungguhnya kita telah merasa letih karena perjalanan kita ini) Yakni rasa capek dan lelah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Pada firman Allah: { آتِنَا غَدَاءَنَا } \"bawalah kemar bekal kita\" adalah dalil dianjurkannya membawa bekal untuk suatu perjalanan, dan ini sebagai bantahan terhadap orang yang meremehkan perbekalan, mereka menembus padang pasir dan bebatuan kerikil, mengira bahwa mereka telah bertawakkal kepada Allah semata, namun ini adalah Musa nabi Allah dan hamba yang di ajak berbincang dengan-Nya juga membawa perbekalan padahal ia tahu ada tuhan yang menjaganya. 2 ). { آتِنَا غَدَاءَنَا } Perhatikan kisah Musa -عليه السلام- bersama pembantunya; akan ditemukan contoh akhlak yang mulia, dan kelembutan mu'amalah sang Nabi: beliau mengabarkan bagaimana simulasi perjalanan yang mereka tempuh, beliau juga mengikut sertakan sang pembantu dalam hidangannya, dan meminta maaf tatkala Musa berbuat salah. Namun perhatikan begitu banyak manusia memperlakukan pembantu-pembantunya, bahkan kepada anak dan murid-muridnya mereka jauh dari akhlak islam. 3 ). Pada firman Allah: { لَقَدْ لَقِينَا مِنْ سَفَرِنَا هَٰذَا نَصَبًا } adalah dalil bolehnya memberitahukan musibah sakit yang menimpa seseorang, dan itu tidak mengurangi keridhoan satu sama lainnya. 4 ). Lihatlah betapa indahnya adab dan akhlak mulia yang ada pada diri Musa bersama pembantunya: Musa yang memperlakukan pembantunya dengan lembut tidak nampak bahwa beliau sedang berhadapan dengan pembantu, dan begitu juga dengan sang pembantu yang ingin memikul tanggung jawab dengan sendirinya: { فَإِنِّى نَسِيتُ ٱلْحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيْطَٰنُ } \"maka sesungguhnya aku lupa (menceritakan tentang) ikan itu dan tidak adalah yang melupakan aku untuk menceritakannya kecuali syaitan\" padahal hakikatnya keduanya lupa dengan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Maka tatkala mereka berjalan lebih jauh, Musa berkata kepada muridnya saat waktu makan: \"Bawalah makanan kita kemari; sesungguhnya kita telah merasa letih karena perjalanan kita ini\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika mereka telah melewatinya} ketika keduanya melewati pertemuan dua lautan {Musa berkata} Musa berkata {kepada pelayannya,“Bawalah kemari makanan kita. Sungguh kita benar-benar telah merasa letih} lelah dan letih {karena perjalanan kita ini”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62. Tatkala Musa dan pelayannya telah melewati tempat pertemuan dua laut, maka Musa berkata kepada pelayannya, “Bawalah kemari makanan kita; sesungguhnya kita telah merasa letih karena perjalanan kita ini,” maksudnya kita telah merasa kepayahan disebabkan perjalanan yang melewati (tempat dua pertemuan laut). Apabila tidak demikian, maka pada perjalanan panjang yang mereka lalui sampai ke tempat dua pertemuan laut, mereka tidak merasakan keletihan sama sekali. Ini termasuk tanda-tanda kebesaran Allah dan petunjuk yang mengindikasikan kepada keberadaan apa yang dicari oleh Musa. Selain itu, sesungguhnya kerinduan yang berhubungan dengan perjalanan sampai ke tempat itu telah memudahkan jalan bagi mereka. Ketika mereka telah melampaui tujuannya, maka mereka (baru) merasakan keletihan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 62",
    "description": "Nabi musa dan pembantunya meneruskan perjalanan, maka ketika mereka telah melewati tempat hilangnya ikan itu dan keduanya hendak beristirahat sambil menyantap bekal yang mereka bawa, nabi musa berkata kepada pembantunya, bawalah kemari makanan (ikan) kita, sungguh kita telah merasa letih karena perjalanan kita yang jauh pada hari ini. Dia, yaitu pembantunya, menjawab, tahukah engkau wahai guru ketika kita tengah mencari tempat berlindung di batu tadi, untuk beristirahat, maka aku lupa meninggalkan ikan itu lalu ikan itu hilang mencebur ke laut, dan tidak ada yang membuat aku lupa, yakni lupa kepada ikan dan menyebabkan aku meninggalkannya, atau aku lupa tidak menceritakan peristiwa ini kepadamu, kecuali setan, dan sungguh ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali. Sungguh aneh, bagaimana ikan itu hidup lagi, lalu hilang mencebur ke laut, sehingga tak dapat ditemukan lagi."
  }
]