[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pelayannya berkata kepadanya, ”apakah engkau ingat ketika kita menepi ke sebuah batu tempat kita beristirahat disana? Sesungguhnya aku lupa memberitahumu apa yang terjadi pada ikan tersebut. Dan tidaklah ada yang melupakanku untuk mengabarkannya kepadamu kecuali setan. Sesungguhnya ikan yang mati itu telah muncul padanya tanda-tanda kehidupan dan melompat ke laut dan mengambil jalannya menuju ke dalam laut. Dan kejadian itu adalah perkara yang begitu menakjubkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Pemuda itu berkata, \"Tahukah engkau ketika kita mencari tempat berteduh di batu tadi?! Sungguh aku lupa menceritakan kepadamu tentang ikan tersebut, dan tidak ada yang membuatku lupa untuk mengingatkanmu kecuali setan. Sungguh ikan tersebut kembali hidup lalu mengambil jalannya ke laut dengan cara yang aneh sekali.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قَالَ أَرَءَيْتَ إِذْ أَوَيْنَآ إِلَى الصَّخْرَةِ (Muridnya menjawab: “Tahukah kamu tatkala kita mencari tempat berlindung di batu tadi) Batu tersebut terletak di tempat pertemuan dua lautan. وَمَآ أَنسَىٰنِيهُ إِلَّا الشَّيْطٰنُ أَنْ أَذْكُرَهُۥ ۚ (dan tidak ada yang melupakan aku untuk menceritakannya kecuali syaitan) Yakni menceritakan kejadian ikan yang aneh itu. وَاتَّخَذَ سَبِيلَهُۥ فِى الْبَحْرِ عَجَبًا (dan ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali) Yakni sesuatu yang aneh ada ikan yang hidup kembali setelah mati dan dimakan, tiba-tiba ia melompat ke laut, dan menyisakan bekas ia berenang di air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Muridnya menjawab: \"Tahukah kamu tatkala kita mencari tempat berlindung di batu tadi, maka sesungguhnya aku lupa menceritakan tentang ikan itu. Penyebab aku lupa bercerita tidak ada kecuali syaitan dengan berbagai bisikannya dan ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali yang mengejutkan Musa dan muridnya\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjawab} pelayannya berkata kepadanya {“apakah kamu melihat} apakah kamu mengingat {ketika kita mencari tempat berlindung} mencari tempat berlindung {di batu tadi, sesungguhnya aku lupa tentang ikan itu dan tidak ada yang membuatku lupa untuk mengingatnya, kecuali setan. Ikan itu mengambil jalannya} jalannya {ke laut dengan cara yang aneh”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. Usai mengatakan perkataan ini kepada pelayannya, sang pelayan berkata kepada Musa, “Tahukah kamu tatkala kita mencari tempat berlindung di batu tadi, maka sesungguhnya aku lupa (menceritakan tentang) ikan itu,” [maksudnya tidakkah engkau tahu ketika kita menginap tadi malam di batu tersebut di antara dua lautan itu, sesungguhnya aku lupa terhadap ikan tersebut]. “Dan tidak ada yang membuatku lupa untuk menceritakannya kecuali setan,” karena dialah penyebabnya. “Dan ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali,” maksudnya ketika ikan itu telah melompat dan menghilang ke dalam laut, maka hal itu termasuk kejadian yang mencengangkan. Para ulama tafsir mengatakan, “Jalan yang ditempuh oleh ikan itu adalah jalan tersembunyi, sedangkan dalam (pandangan) Musa dan pelayannya, itu merupakan keajaiban.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 63",
    "description": "Dia, yaitu pembantunya, menjawab, tahukah engkau wahai guru ketika kita tengah mencari tempat berlindung di batu tadi, untuk beristirahat, maka aku lupa meninggalkan ikan itu lalu ikan itu hilang mencebur ke laut, dan tidak ada yang membuat aku lupa, yakni lupa kepada ikan dan menyebabkan aku meninggalkannya, atau aku lupa tidak menceritakan peristiwa ini kepadamu, kecuali setan, dan sungguh ikan itu mengambil jalannya ke laut dengan cara yang aneh sekali. Sungguh aneh, bagaimana ikan itu hidup lagi, lalu hilang mencebur ke laut, sehingga tak dapat ditemukan lagi. Dia, nabi musa, berkata, itulah tempat yang kita cari. Nabi musa menjelaskan kepada pembantunya bahwa tempat hilangnya ikan adalah tempat beliau akan bertemu dengan seorang hamba yang saleh yang dituju dalam perjalanan ini. Lalu keduanya kembali menuju tempat hilangnya ikan itu, mengikuti jejak mereka semula. Keduanya menelusuri jejak kaki yang telah dilewati sebelumnya agar tidak tersesat jalan menuju ke semula."
  }
]