[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata, ”apa yang terjadi itulah yang kita sedang cari-cari, karena sesungguhnya itu pertanda bagiku tentang tempat hamba yang shalih itu. Maka mereka kembali menelusuri jejak-jejak langkah mereka hingga sampai ke tempat batu tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Musa berkata kepadanya, \"Itulah tempat yang kita cari, karena ia merupakan ciri tempat hamba yang saleh.\" Maka mereka pun kembali mengikuti jejak kedua kaki mereka semula, agar tidak salah jalan hingga sampai pada batu besar tersebut, dan juga pada tempat masuknya ikan ke laut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64-65. Musa berkata: “Itulah kejadian luar biasa yang kita cari.” Maka mereka berdua kembali menyusuri jejak mereka hingga sampai di batu besar tersebut. Di sana mereka menemukan Khadhir, seorang hamba yang shalih, Kami telah memberinya rahmat dari sisi Kami dan Kami telah mengajarinya ilmu istimewa yang agung."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. قَالَ ذٰلِكَ مَا كُنَّا نَبْغِ ۚ (Musa berkata: “Itulah (tempat) yang kita cari”) Yakni itulah yang kita tuju, sebab orang yang kita cari berada di sana. فَارْتَدَّا عَلَىٰٓ ءَاثَارِهِمَا قَصَصًا(Lalu keduanya kembali, mengikuti jejak mereka semula) Yakni mereka berdua kembali menapaki jalan yang telah mereka lewati sebelumnya agar keduanya tidak salah jalan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Musa berkata: \"Tempat diamana paus itu menghilang itulah tempat yang kita cari\". Lalu keduanya kembali, mengikuti jejak mereka semula supaya tidak salah jalan ke tempat berbatu itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Itulah yang kita cari”} kita cari {Lalu keduanya kembali dan menyusuri jejak mereka semula} lalu keduanya kembali ke jalan yang telah mereka lewati yang menyisakan jejak mereka sehingga mereka sampai di batu besar itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. Setelah si pelayan berkata demikian kepada Musa, yang sebelumnya telah mendapatkan janji dari Allah, bahwasanya jika dia kehilangan ikan itu, berarti akan menjumpai Khidir, maka Musa berkata, “Itulah (tempat) yang kita cari,” yang kita inginkan “Lalu keduanya kembali,” maksudnya kembali pulang “mengikuti jejak mereka semula,” mereka kembali menelusuri jejak-jejak mereka sampai (ke tempat) yang mereka lupa terhadap ikan tadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 64: Karena itu pertanda adanya orang yang kita cari di sana."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 64",
    "description": "Dia, nabi musa, berkata, itulah tempat yang kita cari. Nabi musa menjelaskan kepada pembantunya bahwa tempat hilangnya ikan adalah tempat beliau akan bertemu dengan seorang hamba yang saleh yang dituju dalam perjalanan ini. Lalu keduanya kembali menuju tempat hilangnya ikan itu, mengikuti jejak mereka semula. Keduanya menelusuri jejak kaki yang telah dilewati sebelumnya agar tidak tersesat jalan menuju ke semula. Lalu ketika keduanya telah sampai ke tempat hilangnya ikan itu, mereka menuju ke arah batu tempat mereka beristirahat beberapa waktu atau beberapa hari yang lalu. Di tempat itulah mereka berdua bertemu dengan seorang hamba yang saleh di antara hamba-hamba kami, yang telah kami berikan rahmat kepadanya dari sisi kami, berupa kenabian atau aneka macam nikmat lainnya, dan yang telah kami ajarkan ilmu kepadanya secara langsung dari sisi kami, yaitu ilmu tentang perkaraperkara gaib yang tidak dimengerti oleh manusia pada umumnya. Menurut sebagian besar mufasir yang dimaksud dengan hamba yang saleh itu adalah nabi khidr. Keunggulan ilmu yang dimiliki oleh nabi khidr, mendorong nabi musa ingin tertemu dan belajar kepadanya."
  }
]