[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka mereka berdua menjumpai seorang hamba yang shalih dari hamba-hambaKu, yaitu khadir (seorang nabi dari nabi-nabi Allah dan telah di wafatkan Allah) yang telah Kami berikan padanya rahmat dari sisi Kami dan Kami telah ajarkan kepadanya ilmu yang agung dari sisi Kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Ketika mereka tiba di tempat hilangnya ikan, mereka bertemu seorang hamba di antara hamba-hamba Kami yang saleh, yaitu Khaḍir -'alaihissalām-, yang telah Kami berikan rahmat kepadanya dari sisi Kami, dan yang telah Kami ajarkan ilmu kepadanya dari sisi Kami dengan ilmu yang tidak diketahui oleh manusia lainnya, yaitu ilmu yang akan terdapat dalam kisah ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. فَوَجَدَا عَبْدًا مِّنْ عِبَادِنَآ (Lalu mereka bertemu dengan seorang hamba di antara hamba-hamba Kami) Hamba itu adalah Khidhir, dan banyak hadits shahih yang membuktikan akan hal ini. ءَاتَيْنٰهُ رَحْمَةً مِّنْ عِندِنَا (yang telah Kami berikan kepadanya rahmat dari sisi Kami) Terdapat pendapat mengatakan yang dimaksud dengan rahmat pada ayat ini adalah kenabian. وَعَلَّمْنٰهُ مِن لَّدُنَّا عِلْمًا(dan yang telah Kami ajarkan kepadanya ilmu dari sisi Kami) Yakni Allah mengajarkan kepadanya banyak hal tentang ilmu ghaib yang hanya diketahui Allah. Nabi Musa tetap menuntut ilmu dan berkelana untuk mencarinya padahal beliau termasuk Nabi yang paling mulia, hal ini menjadi dalil bahwa tidak selayaknya seseorang meninggalkan kegiatan menuntut ilmu meski ia telah mencapai puncak keilmuannya, serta seseorang harus rendah hati di hadapan orang yang lebih tinggi ilmunya. Terdapat pendapat mengatakan bahwa Khidhir adalah seorang Nabi. Wallahu a’lam."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ketika Allah memilihkan untuk Nabi Musa -عليه السلام- seorang guru Allah memuji guru tersebut dengan firman-Nya : { فَوَجَدَا عَبْدًا مِّنْ عِبَادِنَآ ءَاتَيْنَٰهُ رَحْمَةً مِّنْ عِندِنَا وَعَلَّمْنَٰهُ مِن لَّدُنَّا عِلْمًا } \"Lalu mereka bertemu dengan seorang hamba di antara hamba-hamba Kami, yang telah Kami berikan kepadanya rahmat dari sisi Kami, dan yang telah Kami ajarkan kepadanya ilmu dari sisi Kami\", memulakan dengan lafadz rahmat sebelum lafadz ilmu; menunjukkan bahwa sifat utama seorang mu'allim adalah al-Rahmah (kasih sayang), dan dengan sifat itu akan lebih memberikan dampak yang lebih bermanfaat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Sesampainya di tempat tuuan mereka bertemu dengan seorang hamba Kami yang saleh. Menurut jumhur ahli tafsir dia adalah Nabi Khidhir, namanya adalah Balya bin Malkan. Dia telah Kami beri rahmat dari sisi Kami berupa kenabian, juga telah Kami ajarkan ilmu yang masih belum bisa diketahui khusus baginya dari sisi Kami sehingga Musa ingin bertemu dengannya untuk belajar kepadanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu mereka berdua mendapati seseorang dari hamba-hamba Kami} salah satu hamba Allah yang shalih, yaitu Khidzir AS {yang telah Kami anugerahi rahmat} kenabian {kepadanya dari sisi Kami. Kami telah mengajarkan kepadanya dari sisi Kami} dari sisi Kami {ilmu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. Ketika mereka telah sampai di sana “maka mereka bertemu dengan seorang hamba di antara hamba-hamba Kami,” yaitu Khidhir. Ia adalah seorang nabi, berdasarkan pendapat yang shahih, “yang telah Kami berikan kepadanya rahmat dari sisi Kami,” maksudnya berasal dari sisi Kami “ilmu” Dia telah memperoleh ilmu yang tidak diberikan kepada Musa, kendatipun Musa lebih berilmu daripada Khidhir pada banyak permasalahan, terutama ilmu-ilmu keimanan dan ilmu-ilmu Ushul. Pasalnya, beliau adalah salah seorang ulul ‘azmi dari kalangan para rasul yang Allah utamakan di atas seluruh makhluk dengan ilmu, amal, dan lainnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 65: Imam Bukhari meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas, dari Ubay bin Ka’ab dari Nabi shallallahu 'alaihi wa sallam, bahwa Nabi Musa pernah berdiri khutbah di tengah-tengah Bani Israil, lalu ia ditanya, “Siapakah manusia yang paling dalam ilmunya?” Ia menjawab, “Saya orang yang paling dalam ilmunya.” Maka Allah Subhaanahu wa Ta'aala menyalahkannya karena tidak mengembalikan ilmu kepada-Nya. Allah Subhaanahu wa Ta'aala kemudian mewahyukan kepadanya yang isinya, “Bahwa salah seorang hamba di antara hamba-hamba-Ku yang tinggal di tempat bertemunya dua lautan lebih dalam ilmunya daripada kamu.” Musa berkata, “Wahai Tuhanku, bagaimana cara menemuinya?” Lalu dikatakan kepadanya, “Bawalah ikan dalam sebuah keranjang. Apabila engkau kehilangan ikan itu, maka orang itu berada di sana.” Musa pun berangkat bersama muridnya Yusya’ bin Nun dengan membawa ikan dalam keranjang, sehingga ketika mereka berdua berada di sebuah batu besar, keduanya merebahkan kepala dan tidur (di atas batu itu), lalu ikan itu lepas dari keranjang dan mengambil jalannya ke laut dan cara perginya membuat Musa dan muridnya merasa aneh. Keduanya kemudian pergi pada sisa malam yang masih ada hingga tiba pagi hari. Ketika pagi harinya, Musa berkata kepada muridnya, “Bawalah kemari makanan kita, sungguh kita telah merasa letih karena perjalanan kita ini,” dan Musa tidak merasakan keletihan kecuali setelah melalui tempat yang diperintahkan untuk didatangi. Muridnya kemudian berkata kepadanya, “Tahukah engkau ketika kita mecari tempat berlindung di batu tadi, aku lupa (menceritakan tentang) ikan itu dan tidak ada yang membuat aku lupa untuk mengingatnya kecuali setan,” Musa berkata, “\"Itulah (tempat) yang kita cari.” Lalu keduanya kembali, mengikuti jejak mereka semula. Ketika mereka sampai di batu besar itu, tiba-tiba ada seorang laki-laki yang menutup dirinya dengan kain atau tertutup dengan kain, lalu Musa memberi salam kepadanya. Lalu Khadhir berkata, “Dari mana ada salam di negerimu?” Musa berkata, “Aku Musa.” Khadhir berkata, “Apakah Musa (Nabi) Bani Israil?” Ia menjawab, “Ya.” Musa berkata, “Bolehkah aku mengikutimu agar engkau mengajarkan kepadaku ilmu yang benar yang telah diajarkan kepadamu (untuk menjadi) petunjuk?\" Khadhir berkata, “Sesungguhnya engkau tidak akan sanggup bersabar bersamaku, wahai Musa?” Sesungguhnya aku berada di atas ilmu dari ilmu Allah yang Dia ajarkan kepadaku yang engkau tidak mengetahuinya, demikian pula engkau berada di atas ilmu yang Dia ajarkan kepadamu dan aku tidak mengetahuinya.” Musa berkata, “Engkau akan mendapatiku insya Allah sebagai orang yang sabar dan aku tidak akan mendurhakai perintahmu.” Keduanya pun pergi berjalan di pinggir laut, sedang mereka berdua tidak memiliki perahu, lalu ada sebuah perahu yang melintasi mereka berdua, lalu keduanya berbicara dengan penumpangnya agar mengangkutkan mereka berdua, dan ternyata diketahui (oleh para penumpangnya) bahwa yang meminta itu Khadhir, maka mereka pun mengangkut keduanya tanpa upah. Tiba-tiba ada seekor burung lalu turun ke tepi perahu kemudian mematuk sekali atau dua kali patukan ke laut. Khadhir berkata, “Wahai Musa, ilmuku dan ilmumu yang berasal dari Allah kecuali seperti patukan burung ini ke laut (yakni tidak ada apa-apanya di hadapan ilmu Allah), lalu Khadhir mendatangi papan di antara papan-papan perahu kemudian dicabutnya.” (Melihat keadaan itu) Musa berkata, “Orang yang telah membawa kita tanpa meminta imbalan, namun malah engkau lubangi perahunya agar penumpangnya tenggelam.” Khadhir berkata, “Bukankah aku telah mengatakan kepadamu, bahwa engkau tidak akan sanggup bersabar bersamaku.” Musa berkata, “Janganlah engkau hukum aku karena lupaku dan janganlah engkau bebankan aku perkara yang sulit.” Untuk yang pertama Musa lupa, maka keduanya pun pergi, tiba-tiba ada seorang anak yang sedang bermain dengan anak-anak yang lain, kemudian Khadhir memegang kepalanya dari atas, lalu menarik kepalanya dengan tangannya. Musa berkata, “Apakah engkau hendak membunuh seorang jiwa yang bersih bukan karena ia membunuh orang lain.” Khadhir berkata, “Sesungguhnya engkau tidak akan sanggup bersabar bersamaku.” –Ibnu ‘Uyainah (rawi hadits ini) berkata, “Ini lebih berat.” Keduanya pun berjalan, sehingga ketika mereka sampai ke penduduk suatu kampung, keduanya meminta agar penduduknya menjamu mereka (namun tidak diberi). Keduanya pun mendapatkan sebuah dinding yang hampir roboh, maka Khadhir menegakkannya, Khadhir melakukannya dengan tangannya. Musa pun berkata, “Sekiranya engkau mau, niscaya engkau dapat meminta imbalan untuk itu.” Khadhir berkata, “Inilah perpisahan antara aku dengan kamu.” Nabi shallallahu 'alaihi wa sallam bersabda, “Semoga Allah merahmati Musa, kita senang sekali jika ia bersabar sehingga ia menceritakan kepada kita tentang perkara keduanya.” Al Qurthubi berkata, “Dalam kisah Musa dan Khadir terdapat beberapa faedah, di antaranya bahwa Allah Subhaanahu wa Ta'aala berbuat dalam kerajaan-Nya apa yang Dia kehendaki dan menetapkan untuk makhluk-Nya dengan apa yang Dia kehendaki yang bermanfaat atau bermadharrat, sehingga tidak ada ruang bagi akal dalam hal perbuatan-perbuatan-Nya dan menyalahkan hukum-hukumnya, bahkan wajib bagi manusia untuk bersikap ridha dan menerima, karena pencapaian akal untuk memperoleh rahasia rububiyyah Allah sangat terbatas, oleh karennya tidak bisa ditujukan kepada hukum-Nya, “Mengapa begini?” dan “Bagaimana bisa begitu?”, sebagaimana tidak bisa ditujukan terhadap keberadaan dirinya, “Di mana dan dari mana?”, dan bahwa akal tidak sanggup memandang indah dan buruk, dan bahwa semua itu kembalinya kepada syara’, sehingga apa yang dikatakan indah dengan adanya pujian terhadapnya, maka hal itu adalah indah, dan apa yang dikatakan jelek, maka hal itu adalah jelek. Demikian pula (termasuk faedahnya) bahwa Allah Ta’ala dalam ketetapan-Nya memiliki hikmah-hikmah dan rahasia pada maslahat yang tersembunyi yang memang dipandang. Semua itu dengan kehendak dan iradah-Nya tanpa ada kewajiban atas-Nya dan tanpa ada hukum akal yang tertuju kepadanya. Oleh karena itu, hendaknya seseorang berhati-hati dari sikap i’tiradh (mempersoalkan atau membantah) karena ujung-ujungnya adalah kegagalan.” Beliau juga berkata, “Kami pun di sini ingin mengingatkan dua buah kekeliruan. Kesalahan Yang pertama, persangkaan sebagian orang-orang jahil, bahwa Khadhir lebih utama daripada Musa karena berpegang dengan kisah ini dan kandungannya. Hal ini tidak lain muncul dari orang yang pandangannya sempit terhadap kisah ini dan tidak melihat kelebihan yang Allah berikan kepada Musa ‘alaihis salam berupa kerasulan, mendengar langsung firman Allah, diberikan-Nya kitab Taurat yang di dalamnya tedapat pengetahuan tentang segala hal, dan sesungguhnya para nabi Bani Israil masuk di bawah syari’atnya dan pembicaraan tertuju kepada mereka dengan hukum kenabiannya bahkan Isa pun juga. Dalil-dalilnya dalam Al Qur’an banyak. Cukuplah di antaranya firman Allah Ta’ala, “Wahai Musa! Sesungguhnya aku memilih (melebihkan) kamu dari manusia yang lain (pada masamu) untuk membawa risalah-Ku dan untuk berbicara langsung dengan-Ku.\" (terj. Al A’raaf: 144). Al Qurthubi juga berkata, “Khadhir meskipun nabi namun bukan rasul berdasarkan kesepakatan. Keadaan Khadhir itu seperti salah seorang nabi di antara nabi-nabi Bani Israil, sedangkan Musa yang paling utama di antara mereka. Jika kita katakan, bahwa Khadhir bukan nabi, tetapi wali, maka nabi lebih utama daripada wali. Hal itu merupakan perkara yang jelas berdasarkan akal dan naql (wahyu). Orang yang berpendapat sebaliknya (yakni nabi lebih utama daripada wali) adalah kafir karena hal tersebut sudah maklum sekali dari syara’. Beliau juga berkata, “Kisah Khadhir bersama Musa adalah ujian bagi Musa agar diambil pelajaran. Kesalahan yang kedua, sebagian orang Zindiq menempuh jalan yang sebenarnya merobohkan hukum-hukum syari’at. Mereka berkata, “Sesungguhnya dari kisah Musa dan Kadhir dapat diambil kesimpulan, bahwa hukum-hukum syari’at yang umum hanya khusus bagi orang-orang awam dan orang-orang bodoh, adapun para wali dan orang-orang khusus, maka mereka tidak butuh kepada nash-nash tersebut, bahkan yang diinginkan dari mereka adalah apa yang terjadi dalam hati mereka, dan mereka dihukumi berdasarkan apa yang kuat dalam lintasan hati mereka karena bersihnya hati mereka dari kekotoran dan kosongnya dari penggantian. Nampak kepada mereka ilmu-ilmu ilahi dan hakikat rabbani. Mereka pun mengetahui rahasia-rahasia alam dan mengetahui hukum-hukum juz’iyyah (satuan) sehingga tidak butuh teradap hukum-hukum syari’at secara keseluruhan sebagaimana sesuai dengan Khadhir, di mana Beliau tidak butuh kepada ilmu-ilmu yang nampak baginya yang ada pada Musa, dan diperkuat oleh hadits masyhur, “Bertanyalah kepada hatimu meskipun orang-orang memberi fatwa kepadamu.” Terhadap perakatan ini, Al Qurthubi berkata, “Perkataan ini merupakan perbuatan zindiq dan kekafiran, karena mengingkari syari’at yang maklum, di mana Allah Subhaanahu wa Ta'aala telah memberlakukan ketetapan-Nya dan kalimat-Nya bahwa hukum-hukum-Nya tidak diketahui kecuali melalui para rasul yang menjadi perantara antara Dia dengan makhluk-Nya, di mana rasul-rasul tersebut menerangkan syari’at dan hukum-hukum-Nya…dst.” Hadits di atas juga memberikan faedah kepada kita agar tidak tergesa-gesa mengingkari dalam masalah yang masih mengandung kemungkinan (lihat penjelasan hadits di atas lebih lengkapnya di Fath-hul Bari karya Al Hafizh Ibnu Hajar Al ‘Asqalani). Yaitu Khidhr. Yakni rahmat kenabian menurut suatu pendapat ulama, sedangkan menurut pendapat mayoritas ulama bahwa rahmat di sini adalah rahmat kewalian, yakni ia salah seorang wali di antara wali-wali-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 65",
    "description": "Lalu ketika keduanya telah sampai ke tempat hilangnya ikan itu, mereka menuju ke arah batu tempat mereka beristirahat beberapa waktu atau beberapa hari yang lalu. Di tempat itulah mereka berdua bertemu dengan seorang hamba yang saleh di antara hamba-hamba kami, yang telah kami berikan rahmat kepadanya dari sisi kami, berupa kenabian atau aneka macam nikmat lainnya, dan yang telah kami ajarkan ilmu kepadanya secara langsung dari sisi kami, yaitu ilmu tentang perkaraperkara gaib yang tidak dimengerti oleh manusia pada umumnya. Menurut sebagian besar mufasir yang dimaksud dengan hamba yang saleh itu adalah nabi khidr. Keunggulan ilmu yang dimiliki oleh nabi khidr, mendorong nabi musa ingin tertemu dan belajar kepadanya. Nabi musa berkata kepadanya, bolehkah aku mengikutimu, yakni menjadi pengikut dan muridmu yang senantiasa bersamamu ke mana pun engkau pergi, agar engkau mengajarkan kepadaku sebagian dari ilmu yang telah diajarkan Allah kepadamu untuk menjadi petunjuk bagiku'."
  }
]