[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian musa mengucapkan salam kepadanya, dan berkata kepadanya, ”apakah engkau mau mengizinkanku mengikutimu supaya engkau dapat mengajariku ilmu yang Allah telah ajarkan padamu yang dapat aku pegangi sebagai petunjuk dan bermanfaat bagiku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Dengan penuh rendah hati dan lemah lembut, Musa berkata kepadanya, \"Bolehkan aku mengikutimu agar engkau mengajarkan kepadaku sebagian ilmu yang diajarkan oleh Allah kepadamu yang bisa memberiku petunjuk ke jalan yang benar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66-70. Setelah Musa mengucapkan salam dan berkenalan dengan Khadhir, Musa berkata: “Apakah kamu mengizinkanku untuk menyertaimu, agar kamu dapat mengajariku ilmu yang telah Allah ajarkan kepadamu sehingga dapat menunjukkanku kepada kebenaran?” Khadhir menjawab: “Kamu tidak akan mampu bersabar melihat apa yang aku lakukan.” Dan dia menegaskan lagi: “Dan bagaimana kamu dapat bersabar atas sesuatu yang tidak kamu ketahui hakikatnya?” Musa menjawab dengan mantap: “Dengan kehendak Allah, kamu akan mendapatiku sebagai orang yang sabar dan taat terhadap perintahmu.” Maka Khadhir menyetujuinya dengan syarat Musa tidak bertanya atas apa yang dia perbuat hingga dia sendiri yang menjelaskan hakikat dan sebab perbuatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. قَالَ لَهُۥ مُوسَىٰ هَلْ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا (Musa berkata kepada Khidhr: “Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang benar di antara ilmu-ilmu yang telah diajarkan kepadamu?”) Nabi Musa meminta izin agar dapat menjadi pengikutnya, agar Khidhir mengajarinya sebagian ilmu yang telah diajarkan kepadanya. Terkadang orang yang lebih mulia mengambil ilmu dari orang yang kemuliaannya di bawahnya, hal ini jika salah satunya memiliki ilmu yang belum dimiliki oleh yang lain. Dan ilmu Nabi Musa adalah ilmu yang berhubungan dengan hukum-hukum agama sedangkan ilmu Khidhir adalah ilmu tentang sebagian hal yang ghaib."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Qatadah berkata : Jika seseorang merasa cukup dengan sedikitnya ilmu yang ia miliki, maka Musa juga akan merasa cukup dengan apa yang ia miliki, akan tetapi justru beliau mengatakan kepada khidir { هَلْ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا } \"Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang benar di antara ilmu-ilmu yang telah diajarkan kepadamu?\" pada Musa adalah seorang Nabi dan Rasul. 2 ). { هَلْ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا } Ayat ini sebagai dalil bahwa seorang penuntut ilmu mengikuti gurunya, sekalipun martabat sosial sang guru lebih rendah. 3 ). { هَلْ أَتَّبِعُكَ عَلَىٰٓ أَن تُعَلِّمَنِ مِمَّا عُلِّمْتَ رُشْدًا } Memulai dengan meminta izin kepada khidir untuk ikut dengannya, dan bahwasanya Musa tidak akan mengikutinya sebelum mendapat izin darinya, dan lafadz : { أَن تُعَلِّمَنِ } menunjukkan bahwa tujuan Musa bukan untuk menguji dan menjadi keras kepala, melainkan beliau datang untuk menuntut belajar dan menambah ilmu. 4 ). Ayat ini juga mengajarkan bagaimana sebaiknya adab seorang pelajar kepada gurunya, dan tutur kata yang lembut dan sopan kepadanya, dan mengikrarkan bahwa ia belajar dari sang guru, berbeda dengan sikap orang-orang sombong yang merasa dirinya tidak butuh dengan seorang guru. 5. Kisah dengan khidir merupakan contoh sorang penuntut ilmu yang giat dan menjunjung tinggi adab kepada ulama, Musa adalah seorang Rasul, akan tetapi kedudukan itu tidak menghalanginya untuk mengambil ilmu seseorang yang lebih rendah darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Musa berkata kepada Khidhr: \"Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang diajarkan oleh Allah yang yang menuntunku menuju kebaikan? Dan terkadang orang yang utama itu meminta kepada orang yang diutamakan, dan orang alim itu rendah hati terhadap orang yang lebih alim darinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata kepadanya,“Bolehkah aku mengikutimu agar kamu mengajarkan kepadaku dari apa yang telah diajarkan kepadamu sebagai petunjuk} ilmu yang menuntunku kepada kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "66. Manakala Musa berhasil berkumpul dengan Khidhir, maka beliau berkata kepadanya dengan penuh kesopanan dan permohonan persetujuan sembari memberitahukan apa yang ia inginkan, “Bolehkah aku mengikutimu supaya kamu mengajarkan kepadaku ilmu yang benar di antara ilmu-ilmu yang telah diajarkan kepadamu,” maksudnya apakah aku boleh mengikutimu agar engkau mengajariku dari ilmu-ilmu yang telah Allah ajarkan kepadamu, yang akan kujadikan sebagai pegangan dan petunjuk, dan dengan itu aku pun bisa mengetahui kebenaran dari persoalan-persoalan itu? Khidhir telah di anugerahi Allah ilham dan karamah hingga sanggup meneropong rahasia-rahasia permasalahan yang tersembunyi pada pandangan Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 66: Musa berkata kepadanya secara sopan, bermusyawarah dan memberitahukan keinginannya. Nabi Musa ‘alaihis salam meminta kepada Khadhir agar diajarkan ilmu yang diajarkan Allah kepadanya karena menambah ilmu itu disyari’atkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 66",
    "description": "Nabi musa berkata kepadanya, bolehkah aku mengikutimu, yakni menjadi pengikut dan muridmu yang senantiasa bersamamu ke mana pun engkau pergi, agar engkau mengajarkan kepadaku sebagian dari ilmu yang telah diajarkan Allah kepadamu untuk menjadi petunjuk bagiku'mendengar keinginan nabi musa itu, dia, yakni nabi khidr, menjawab, sungguh, engkau tidak akan sanggup sabar, menahan diri bersamaku ketika engkau menyaksikan sesuatu yang aku perbuat di hadapanmu."
  }
]