[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Khadir berkata kepadnya, ”sesungguhnya engkau wahai musa, tidak akan mampu bersabar dalam mengikuti dan menyertaiku. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Khaḍir berkata, \"Sungguh engkau tidak akan sanggup bersabar atas ilmu yang engkau akan lihat dariku, karena tidak akan sesuai dengan ilmu yang engkau miliki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. قَالَ إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًا (Dia menjawab: “Sesungguhnya kamu sekali-kali tidak akan sanggup sabar bersama aku) Yakni kamu tidak akan sanggup untuk bersabar atas apa yang akan kamu lihat dari ilmuku, sebab ilmu yang kamu miliki tidak sesuai dengan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Nabi Khidhir menjawab: \"Sesungguhnya kamu sekali-kali tidak akan sanggup sabar atas apa yang kamu lihat dari ilmu dan amalku saat bersamaku."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia menjawab} Khidzir berkata kepadanya {“Sesungguhnya kamu tidak akan sanggup bersabar bersamaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Maka Khidhir berkata kepada Musa, “Aku tidak menampiknya. Akan tetapi sesungguhnya engkau ‘sekali-kali tidak akan sanggup sabar bersamaku,’ maksudnya engkau tidak mampu untuk mengikuti dan menyertaiku. Sebab, kamu akan menyaksikan obyek yang membuatmu tidak bisa bersabar dalam menghadapi perkara-perkara yang Nampak terlihat sebagai kemungkaran, sementara hakikatnya tidak demikian adanya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 67: Yakni karena engkau akan akan melihat perkara-perkara yang engkau tidak mampu bersabar terhadapnya, di mana perkara tersebut zahir(kelihatan)nya mungkar, namun sesungguhnya tidak."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 67",
    "description": "Mendengar keinginan nabi musa itu, dia, yakni nabi khidr, menjawab, sungguh, engkau tidak akan sanggup sabar, menahan diri bersamaku ketika engkau menyaksikan sesuatu yang aku perbuat di hadapanmu. Nabi khidr bertanya kepada nabi musa, dan bagaimana engkau akan dapat bersabar atas sesuatu yang aku lakukan ketika engkau menyaksikannya, sedang engkau belum mempunyai pengetahuan yang cukup tentang hal itu, yakni engkau tidak mengetahui hakikat tentang perbuatan yang saya lakukan itu."
  }
]