[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bagaimana mungkin engkau dapat bersabar menghadapi hal-hal yang akan aku perbuat yang pengetahuannya tersembunyi pada pandanganmu yang telah Allah ajarkan kepadaku?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Dan bagaimanakah engkau dapat bersabar atas suatu perbuatan yang akan engkau lihat dan engkau sendiri tidak tahu menahu tentang hal yang benar di dalamnya karena engkau akan menilainya sesuai ilmu yang sampai kepadamu?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. وَكَيْفَ تَصْبِرُ عَلَىٰ مَا لَمْ تُحِطْ بِهِۦ خُبْرًا (Dan bagaimana kamu dapat sabar atas sesuatu, yang kamu belum mempunyai pengetahuan yang cukup tentang hal itu?”) Yakni bagaimana kamu akan bersabar atas ilmu yang belum kamu ketahui hakikatnya?"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Diantara kesalahan yang sering dilakukan oleh pemuda (khususnya penuntut ilmu) mencukupkan wawasan dengan isi buku saja, dan melalaikan pengalaman penting orang-orang yang terdahulu dalam keilmuan, maka barangsiapa yang mentadabburi al-Qur'an akan tercerahkan untuk peduli terhadap perkara ini, dan inilah yang didapati oleh Khidir dari perjalanannya bersama Musa, sehingga Musa memanfaatkan lebih banyak dari perjalannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Bagaimana kamu dapat sabar wahai Musa atas sesuatu yang bahkan kamu belum mempunyai pengetahuan yang cukup tentang hal itu?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bagaimana kamu akan sanggup bersabar atas sesuatu yang kamu belum mempunyai pengetahuan tentangnya”} pengetahuan dan pemahaman tentang hakikatnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68. Oleh karena itu, dia berkata, “Dan bagaimana kamu dapat sabar atas sesuatu yang kamu belum mempunyai pengetahuan yang cukup tentang hal itu,” maksudnya, bagaimana bisa engkau bersabar menghadapi sesuatu yang engkau tidak menguasai seluk beluknya bagian luar dan dalamnya, dan tidak mengetahui tujuan dan kesudahannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 68: Yakni engkau belum mengetahui maksud dan akhirnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 68",
    "description": "Nabi khidr bertanya kepada nabi musa, dan bagaimana engkau akan dapat bersabar atas sesuatu yang aku lakukan ketika engkau menyaksikannya, sedang engkau belum mempunyai pengetahuan yang cukup tentang hal itu, yakni engkau tidak mengetahui hakikat tentang perbuatan yang saya lakukan itu. Kehendak nabi musa untuk bersama nabi khidr dan menjadi muridnya sangat kuat, maka dia berkata, insya Allah akan engkau dapati aku orang yang sabar, dan aku tidak akan menentangmu dalam urusan apa pun, yang aku saksikan ketika aku bersamamu."
  }
]