[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepadanya, ”insya Allah, engkau akan mendapatiku sebagai seorang yang bersabar terhadap apa yang akan aku lihat darimu. Aku tidak melangggar perkara yang sudah engkau perintahkan kepadaku."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Musa berkata, \"Insyā Allah engkau akan dapati aku sebagai orang yang bersabar atas apa yang nampak dari perbuatanmu, sambil terus mentaatimu, dan tidak akan menentangmu dalam urusan yang engkau perintahkan kepadaku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. قَالَ سَتَجِدُنِىٓ إِن شَآءَ اللهُ صَابِرًا (Musa berkata: “Insya Allah kamu akan mendapati aku sebagai orang yang sabar) Yakni Nabi Musa berkata kepada Khidhir “Kamu akan mendapatiku dapat bersabar untuk bersamamu dan selalu mentaatimu.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Tatkala Allah -وجل عز- memerintahkan rasul-Nya dalam surah al-Kahfi untuk tidak mengatakan mengatakan tentang sesuatu: \"Sesungguhnya aku akan mengerjakan ini besok pagi kecuali setelah mengatakan : \"Jika Allah menghendaki\"; Allah menjelaskan kepada Rasul-Nya tentang satu qudwah yang diamalkan oleh Musa tatkala ia berkata : { قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ } \"Musa berkata: “Insya Allah kamu akan mendapati aku...\". 2 ). Hal yang paling dibutuhkan oleh seorang penuntut ilmu ketika bersama gurunya adalah : kesabaran dalam menuntut ilmu, dan meninggkan adab terhadap gurunya, dan Allah telah mengumpulkan kedua komponen ini dalam ucapan Musa kepada khidir : { قَالَ سَتَجِدُنِي إِنْ شَاءَ اللَّهُ صَابِرًا وَلَا أَعْصِي لَكَ أَمْرًا } \"Musa berkata: “Insya Allah kamu akan mendapati aku sebagai orang yang sabar, dan aku tidak akan menentangmu dalam sesuatu urusanpun”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Musa berkata: \"Insya Allah engkau akan mendapatiku sebagai orang yang sabar, dan aku tidak akan menentangmu dalam suatu urusanpun serta tidak akan menentang perintah dan larangan Allah\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Musa berkata kepada Khidzir {“Jika Allah menghendaki kamu akan mendapatiku sebagai orang yang sabar dan aku tidak akan menentangmu dalam urusan apa pun”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "69. Musa berkata, “INsya Allah kamu akan mendapatkkanku sebagai seorang yang sabar, dan aku tidak akan menentangmu dalam sesuatu urusan pun.” Ini merupakan tekad Musa sebelum dijumpainya obyek ujian. Tekad itu sebuah keinginan, sementara keberadaan sabar adalah urusan lain. Karenannya, Musa tidak bisa menahan diri saat peristiwa terjadi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 69: Disebutkan kata “Insya Allah” karena Nabi Musa ‘alaihis salam belum yakin terhadap kemampuan dirinya, dan seperti inilah kebiasaan para nabi dan para wali, di mana mereka tidak merasa yakin terhadap diri mereka sedetik pun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 69",
    "description": "Kehendak nabi musa untuk bersama nabi khidr dan menjadi muridnya sangat kuat, maka dia berkata, insya Allah akan engkau dapati aku orang yang sabar, dan aku tidak akan menentangmu dalam urusan apa pun, yang aku saksikan ketika aku bersamamu. Nabi khidr memperkenankan permintaan nabi musa, tetapi dengan sebuah syarat. Dia berkata, jika engkau mengikutiku, maka janganlah engkau menanyakan kepadaku tentang sesuatu apa pun yang aku lakukan walaupun engkau tidak mengerti atau tidak menyetujuinya, sampai aku menerangkannya kepadamu bagaimana sebenarnya peristiwa itu terjadi menurut pengetahuan yang diberitahukan Allah kepadaku."
  }
]