[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kami menjadikan apa yang ada di muka bumi berupa makhluk-mahkluk lain sebagai penghias baginya dan kemanfaatan bagi para penghuninya, agar kami dapat menguji mereka, siapakah dari mereka yang terbaik amalannya dengan taat kepada Kami dan siapakah dari mereka yang paling buruk tindakannya dengan berbuat berbagai macam maksiat. Dan kami akan memberi balasan kepada masing-masing mereka dengan balasan yang sesuai."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Sesungguhnya Kami telah menjadikan segala apa yang ada di bumi ini berupa makhluk-makhluk yang beragam sebagai perhiasan dan keindahan baginya, dengan tujuan untuk Kami uji mereka; siapakah diantara mereka yang memiliki amalan paling baik lagi diridai Allah, atau siapakah diantara mereka yang memiliki amalan paling buruk, agar setiap dari mereka Kami berikan balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7-8. Kami telah menciptakan makhluk-makhluk yang ada di muka bumi sebagai penghias dan penyempurna baginya, dan agar dimanfaatkan para penghuninya, supaya Kami menguji mereka dan melihat siapa yang paling taat kepada Allah dan yang paling baik amalannya untuk kehidupan akhirat. Dan pada hari kiamat Kami akan jadikan perhiasan yang ada di muka bumi itu menjadi tanah yang tandus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. إِنَّا جَعَلْنَا مَا عَلَى الْأَرْضِ زِينَةً لَّهَا (Sesungguhnya Kami telah menjadikan apa yang di bumi sebagai perhiasan baginya) Yakni dari segala sesuatu yang layak untuk dijadikan perhiasan seperti hewan-hewan, tumbuh-tumbuhan, atau dari benda mati, serta bangunan-bangunan dan perabotan yang Allah ilhamkan kepada manusia untuk membuatnya. لِنَبْلُوَهُمْ أَيُّهُمْ أَحْسَنُ عَمَلًا(agar Kami menguji mereka siapakah di antara mereka yang terbaik perbuatannya) Yakni agar Kami menguji mereka, apakah orang tersebut baik amalnya atau tidak? Dan siapakah yang paling layak untuk diberi harta, kedudukan, kekuasaan, dan lain sebagainya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Sungguh telah tertipu oleh perhiasan dunia orang-orang yang hanya melihat dunia ini dari luarnya saja, mereka berteman dengan dunia seperti pertemanan binatang, kepentingan mereka hanya untuk menunaikan keinginan syahwatnya, dengan segala cara akan mereka lakukan, dan ketika maut datang menghampiri, mereka akan gelisa dan menyesal atas perbuatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Sesungguhnya Kami telah menjadikan apa yang di bumi seperti hewan, tumbuhan, pepohonan dan benda mati sebagai perhiasan baginya. Sebagai ujian Kami bagi mereka, siapakah di antara mereka yang terbaik perbuatannya. Sehingga posisi orang musyrik sebagai ujian dan cobaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah menjadikan apa yang ada di atas bumi sebagai perhiasan baginya agar Kami menguji mereka} menguji mereka {siapakah di antara mereka yang lebih baik perbuatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Allah mengabarkan bahwa Dia telah menjadikan semua yang ada di muka bumi, baik berupa makanan-makanan yang lezat, aneka minuman, pakaian-pakaian yang bagus, pepohonan, sungai-sungai, sawah-sawah, buah-buahan, panorama yang mengagumkan, kebun-kebun yang memikat, suara-suara yang membangkitkan semangat, rupa-rupa yang manis, emas,perak, kuda, unta, dan lain sebagainya, semuanya Allah ciptakan sebagai perhiasan untuk perkampungan ini (kehidupan dunia) dan sebagai cobaan dan ujian. “Agar Kami menguji siapakah di antara mereka yang terbaik perbuatannya,” maksudnya yang paling ikhlas dan paling benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 7: Seperti hewan, tumbuhan, sungai-sungai, tempat tinggal, pemandangan yang indah, dsb. Yakni yang paling ikhlas dan paling sesuai dengan sunnah Rasulullah shallallahu 'alaihi wa sallam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 7",
    "description": "Sesungguhnya kami telah menjadikan apa yang ada di bumi, yakni beraneka macam hewan, tumbuh-tumbuhan dan kekayaan alam yang tersimpan di dalamnya sebagai perhiasan baginya, yakni bagi bumi dan indah dipandang oleh manusia, untuk kami menguji mereka, di dalam menyikapi keindahan bumi dengan segala isinya. Dengan demikian, kami mengetahui secara nyata siapakah di antara mereka yang terbaik perbuatannya, dan siapa yang jahat dan durhaka kepada tuhannya. Dan kelak di hari kiamat, kami benar-benar akan menjadikan apa yang di atasnya, yakni apa yang ada di atas bumi menjadi tanah yang tandus lagi kering, tidak ada lagi keindahannya. Demikianlah Allah menjadikan bumi dengan segala isinya yang dipandang indah oleh manusia sebagai sarana untuk menguji siapa di antara manusia itu yang baik perbuatannya dan siapa yang berbuat jahat. Kelak di hari kiamat kebaikan dan kejahatan itu akan mendapat pembalasan yang seadil-adilnya."
  }
]