[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka khadir pun setuju dan berkata kepada Musa, ”jika engkau menyertaiku, maka janganlah engaku sekali-kali menanyakan kepadaku tentang sesuatu yang kamu ingkari, hingga nanti aku sendiri yang akan menjelaskan maksudnya kepadamu apa yang masih samar bagi dirimu tanpa bertanya dulu kepadaku. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "70. Khaḍir berkata kepada Musa, \"Jika engkau mengikutiku maka janganlah engkau menanyakan kepadaku tentang suatu perbuatan yang engkau lihat aku melakukannya hingga aku sendirilah yang memulai untuk menerangkan permasalahannya kepadamu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "70. قَالَ فَإِنِ اتَّبَعْتَنِى فَلَا تَسْـَٔلْنِى عَن شَىْءٍ (Dia berkata: “Jika kamu mengikutiku, maka janganlah kamu menanyakan kepadaku tentang sesuatu apapun) Tentang apa yang akan kamu saksikan dari perbuatan-perbuatanku yang menyelisihi ilmumu. حَتَّىٰٓ أُحْدِثَ لَكَ مِنْهُ ذِكْرًا(sampai aku sendiri menerangkannya kepadamu”) Sampai aku sendiri yang menerangkan kepadamu takwil dari perbuatanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "70. Nabi Khidhir berkata: \"Jika kamu mengikutiku, maka janganlah kamu menanyakan kepadaku tentang apapun, sampai aku sendiri menerangkan sebab-sebabnya kepadamu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Jika kamu mengikutiku} menemaniku {janganlah kamu menanyakan kepadaku tentang apa pun sampai aku menerangkannya kepadamu”} aku mulai menarangkannya kepadamu sebelum kamu bertanya kepadaku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "70. Pada saat itulah, Khidhir berpesan kepada Musa, “jika kamu mengikutiku, maka janganlah kamu menanyakan kepadaku tentang sesuatu apa pun, sampai aku sesndiri menerangkannya kepadamu,” maksudnya janganlah engkau memulai untuk melontarkan pertanyaan dan pengingkaran kepadaku, sampai akulah yang akan menerangkan kepadamu tentang itu. Ia melarang Musa untuk bertanya dan berjanji kepadanya untuk menerangkan kepadanya tentang hakikat peristiwa tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 70: Yang aku lakukan dan bersabarlah; jangan dulu mengingkari. Yakni alasannya. Maka Nabi Musa menerima syaratnya karena memperhatikan adab murid terhadap guru."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 70",
    "description": "Nabi khidr memperkenankan permintaan nabi musa, tetapi dengan sebuah syarat. Dia berkata, jika engkau mengikutiku, maka janganlah engkau menanyakan kepadaku tentang sesuatu apa pun yang aku lakukan walaupun engkau tidak mengerti atau tidak menyetujuinya, sampai aku menerangkannya kepadamu bagaimana sebenarnya peristiwa itu terjadi menurut pengetahuan yang diberitahukan Allah kepadaku. Maka berjalanlah keduanya menelusuri pantai, hingga ketika keduanya menjumpai sebuah perahu yang sedang berlayar, keduanya menaiki perahu, lalu sampai di tengah laut, dia, yakni nabi khidr, melubanginya. Dia, yakni nabi musa, tidak sabar ketika melihat nabi khidr melubangi perahu itu dan tidak dapat menyetujuinya, maka ia berkata, mengapa engkau melubangi perahu itu, sungguh perbuatan itu sangat berbahaya. Apakah engkau bermaksud untuk menenggelamkan penumpangnya' sungguh, aku bersumpah, engkau telah berbuat suatu kesalahan yang besar, yang tidak dapat dibenarkan menurut syariat."
  }
]