[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian mereka berdua mulai berjalan di tepi laut. Lalu lewatlah sebuah perahu di hadapan mereka. Maka mereka berdua memohon kepada para penumpang kapal agar dapat menumpang bersama mereka. Lalu Seusai mereka menaikinya, khadir melepas satu bagian kayu kapal tersebut, hingga menyebabkan kapal berlubang. Maka musa berkata kepadanya, ”apakah engkau melubangi kapal agar engkau dapat menenggelamkan semua penumpangnya, padahal mereka telah rela mengangkut kita tanpa bayaran?! sungguh engkau telah berbuat tindakan yang mungkar. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Ketika mereka bersepakat tentang hal itu, merekapun berjalan menuju pesisir lautan hingga menjumpai suatu kapal. Mereka pun menaiki kapal tersebut secara gratis sebagai bentuk penghormatan pemiliknya terhadap Khaḍir. Lalu Khaḍir melubangi kapal itu dengan mencabut salah satu papannya. Musa pun berkata kepadanya, \"Mengapa engkau melubangi kapal yang pemiliknya menaikkan kita di atasnya secara gratis dengan tujuan agar semua penumpangnya tenggelam?!\" Sungguh engkau telah berbuat sesuatu kesalahan yang besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71-72. Maka Musa dan Khadhir berjalan di tepi pantai hingga melintasi sebuah perahu; pemiliknya telah mengenal Khadhir, sehingga dia memberi mereka tumpangan tanpa meminta upah. Ketika mereka berdua menaiki perahu itu, Khadhir mengambil kapak dan mencabut salah satu papan perahu. Hal ini membuat Musa terheran sehingga dia berkata kepada Khadhir dengan penuh pengingkaran: “Apakah kamu melubangi perahu ini agar para penumpangnya tenggelam? Demi Allah, kamu telah melakukan kemungkaran yang besar.” Maka Khadhir berkata: “Bukankah aku telah berkata kepadamu bahwa kamu tidak akan bersabar dengan perbuatanku yang kamu lihat?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. فَانطَلَقَا (Maka berjalanlah keduanya) Yakni kemudian berlalu sebuah perahu di depan mereka, lalu mereka meminta para pemiliknya agar mereka dapat mengangkut keduanya, dan mereka mengizinkan mereka berdua. حَتَّىٰٓ إِذَا رَكِبَا فِى السَّفِينَةِ خَرَقَهَا ۖ (hingga tatkala keduanya menaiki perahu lalu Khidhr melobanginya) Terdapat pendapat mengatakan Khidhir melubangi dinding perahu untuk membuat sedikit kerusakan pada perahu tersebut, dan dia tidak membuat lubang pada sisi bawah kapal yang bersentuhan langsung dengan air agar penumpangnya tidak tenggelam. قَالَ(Musa berkata) Nabi Musa berkata kepada Khidhir. أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا(Mengapa kamu melobangi perahu itu akibatnya kamu menenggelamkan penumpangnya?) Nabi Musa mengingkari apa yang diperbuat Khidhir terhadap perahu itu, sebab secara akal itu akan membuat binasanya nyawa dan harta banyak orang. Dalam sebagian riwayat menyebutkan bahwa para pemilik perahu memberi mereka berdua tumpangan tanpa meminta imbalan, oleh sebab itu keingkaran Nabi Musa terhadap perbuatan Khidhir sangat besar. لَقَدْ جِئْتَ شَيْـًٔا إِمْرًا(Sesungguhnya kamu telah berbuat sesuatu kesalahan yang besar) yakni kamu telah berbuat sesuatu yang membahayakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Musa bergegas mengungkapkan pengingkarannya dan pembelaannya terhadap suatu kebenaran dan berkata : { أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا } \"Mengapa kamu melobangi perahu itu akibatnya kamu menenggelamkan penumpangnya?\" Musa tidak mengatakan \"akibatnya menenggelamkan kita\" ia melupakan dirinya, dan sibuk memikirkan keadaan selain darinya padahal disisi lain masing-masing orang berkata \"diriku..diriku..\" Maha suci dzat yang mengutus para Nabi dengan kebaikan akhlak pada diri mereka. 2 ). Ayat ini menunjukkan bahwa hati orang beriman pada dasarnya sudah terbentuk untuk menginkari suatu kemungkaran, dan sulit bertahan dalam kesabaran untuk menerima hal itu; karena dari kisah Musa beliau berjanji kepada Khidr untuk bersabar terhadap apapun yang ia lihat dari tingkah Khidr, namun ketika kejadiannya benar-benar terlihat di hadapannya ia harus mengingkarinya. 3 ). Musa berkata kepada Khidr tatkala ia membakar sebuah kapal : { لَقَدْ جِئْتَ شَيْـًٔا إِمْرًا } dan ia berkata tatkala Khidr membunuh seorang anak : { لَقَدْ جِئْتَ شَيْـًٔا نكراً } perbedaan keduanya adalah bahwasanya (al-Imru lebih kecil daripada al-Nukr) dan bisa saja tidak sampai ke derajat kemungkaran sebagaimana al-Nukr, namun lafadz ini mengundang takjub karena ia juga kemungkaran dan telah terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Maka keduanya berjalan, hingga tatkala keduanya menaiki perahu lalu Khidhr melobanginya. Musa berkata: \"Mengapa kamu melobangi perahu itu, sehingga kamu menenggelamkan penumpangnya?\" Sesungguhnya kamu telah berbuat sesuatu kesalahan yang besar dan aneh"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian keduanya berjalan sehingga ketika menaiki perahu, dia melubanginya} Khidzir mencabut sebagian papan-papan kapan itu {Dia berkata} Musa berkata kepadanya {“Apakah kamu melubanginya untuk menenggelamkan penumpangnya. Sungguh kamu telah berbuat suatu kesalahan yang besar”} Kamu telah berbuat kesalahan yang besar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71. “Maka berjalanlah keduanya, hingga tatkala keduanya menaiki perahu, lalu Khidhir melubanginya,” maksudnya Khidhir mencabut satu papan dari perahu tersebut. Ia mempunyai tujuan dalam melakukannya yang akan ia jelaskan (nanti). Akan tetapi, Musa tidak tahan (menyaksikannya), lantaran secara eksplisit merupakan kemungkaran. Pasalnya, tindakan itu dapat merusak perahu tersebut dan menjadi penyebab tenggelam bagi sang pemilik. Oleh karena itu, Musa berkata, “Mengapa kamu melubangi perahu itu yang akibatnya kamu menenggelamkan penumpangnya. Sesungguhnya kamu telah berbuat kesalahan yang besar,” yaitu kesalahan yang besar lagi sangat buruk. Ini termasuk cerminan ketidaksabaran Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 71: Di tepi pantai. Dengan mencabut salah satu papannya, lalu menambalnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 71",
    "description": "Maka berjalanlah keduanya menelusuri pantai, hingga ketika keduanya menjumpai sebuah perahu yang sedang berlayar, keduanya menaiki perahu, lalu sampai di tengah laut, dia, yakni nabi khidr, melubanginya. Dia, yakni nabi musa, tidak sabar ketika melihat nabi khidr melubangi perahu itu dan tidak dapat menyetujuinya, maka ia berkata, mengapa engkau melubangi perahu itu, sungguh perbuatan itu sangat berbahaya. Apakah engkau bermaksud untuk menenggelamkan penumpangnya' sungguh, aku bersumpah, engkau telah berbuat suatu kesalahan yang besar, yang tidak dapat dibenarkan menurut syariat. Mendengar pertanyaan nabi musa, lalu nabi khidr mengingatkan nabi musa akan syarat yang telah mereka sepakati. Dia, yakni nabi khidr, berkata, bukankah sudah aku katakan sebelum ini bahwa sesungguhnya engkau tidak akan mampu sabar bersamaku'."
  }
]