[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Khadir berakata kepadanya, ”sungguh telah aku katakan kepadamu sejak pertama, ’sesungguhnya engkau tidak akan sanggup bersabar menyertaiku’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Khaḍir berkata kepada Musa, \"Bukankah sudah aku katakan bahwa engkau tidak bisa bersabar melihat perbuatan yang aku lakukan?!\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Nabi Khidhir menjawab: \"Bukankah aku telah berkata: \"Sesungguhnya kamu sekali-kali tidak akan sabar atas perbuatanku?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Khidzir berkata kepada Musa {“Bukankah aku sudah mengatakan bahwa sesungguhnya kamu tidak akan sanggup bersabar bersamaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "72. Maka Khidhir berkata kepada Musa, “Bukankah aku telah berkata, ‘SEsungguhnya kamu sekali-kali tidak akan sabar bersama denganku’,” maksudnya, sudah terjadi apa yang aku beritahukan kepadamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 72",
    "description": "Mendengar pertanyaan nabi musa, lalu nabi khidr mengingatkan nabi musa akan syarat yang telah mereka sepakati. Dia, yakni nabi khidr, berkata, bukankah sudah aku katakan sebelum ini bahwa sesungguhnya engkau tidak akan mampu sabar bersamaku'nabi musa menyadari kesalahannya maka dia berkata, maafkanlah kesalahanku, janganlah engkau menghukum aku karena kelupaanku menanyakan sesuatu kepadamu sebelum engkau menerangkan kepadaku peristiwa sebenarnya, dan janganlah engkau membebani aku dengan suatu kesulitan yang tidak dapat kupikul dalam urusanku, yakni keinginanku mengikuti engkau agar aku mempelajari ilmu yang diajarkan Allah kepadamu."
  }
]