[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata untuk meminta maaf, ”janganlah engaku menyalahkan aku gara-gara aku lupa terhadap syarat yang engkau tetapkan atasku. Dan janganlah engkau membebani aku dengan satu beban berat untuk belajar darimu. Tolong perlakukanlah aku dengan mudah dan lembut. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Musa berkata kepada Khaḍir, \"Janganlah engkau menghukum aku karena kelupaanku akan janjiku, dan jangan pula engkau persempit dan bebani aku dengan suatu kesulitan dalam berjalan bersamamu.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Musa berkata untuk meminta maaf: “Maklumilah aku karena telah melupakan syaratmu itu, dan janganlah kamu membebaniku hal yang sulit, namun perlakukanlah aku dengan lembut.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَلَا تُرْهِقْنِى مِنْ أَمْرِى عُسْرًا (dan janganlah kamu membebani aku dengan sesuatu kesulitan dalam urusanku) Yakni perlakukanlah aku dengan lembut dan jangan engkau persulit aku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Musa berkata: \"Aku mohon engkau tidak menghukum aku karena kelupaanku, dan janganlah engkau memberi beban dan penderitaan dalam mengikutimu dengan tidak toleransi atas kelupaanku. Itu merupakan sesuatu yang sulit. \""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Musa berkata kepada Khidzir {“Janganlah kamu menghukumku karena kelupaanku} karena kelupaanku terhadap wasiatmu untuk tidak bertanya {dan janganlah membebaniku dengan kesulitan dalam urusanku”} janganlah membebaniku dengan penderitaan dalam menemanimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. Teguran itu merupakan bentuk kealpaan dari Musa, maka dia berkata, “Janganlah kamu menghukumku karena kealpaanku, dan janganlah kamu membebaniku dengan sesuatu kesulitan dalam urusanku,” maksudnya janganlah engkau mempersulit urusan kepada diriku, maafkanlah aku. Sesungguhnya itu terjadi karena faktor lupa. Janganlah engkau menghukum aku karena kelupaanku yang pertama kali ini. Ia memadukan antara pengakuan kesalahan dan pengajuan alasan, dan bahwa engkau wahai Khidhir tidak patut bersikap keras terhadap kawanmu ini, maka Khidhir memaafkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 73: Untuk tunduk menerima dengan tidak mengingkari. Yakni pergaulilah aku dengan sikap maaf dan memudahkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 73",
    "description": "Nabi musa menyadari kesalahannya maka dia berkata, maafkanlah kesalahanku, janganlah engkau menghukum aku karena kelupaanku menanyakan sesuatu kepadamu sebelum engkau menerangkan kepadaku peristiwa sebenarnya, dan janganlah engkau membebani aku dengan suatu kesulitan yang tidak dapat kupikul dalam urusanku, yakni keinginanku mengikuti engkau agar aku mempelajari ilmu yang diajarkan Allah kepadamu. Nabi khidr memaafkan nabi musa, lalu keduanya meninggalkan perahu dengan selamat dan turun ke pantai. Maka berjalanlah keduanya; hingga ketika keduanya berjumpa dengan seorang anak muda, maka dia dengan serta merta membunuhnya. Melihat nabi khidr membunuh anak muda itu, nabi musa tidak dapat menahan keinginannya untuk bertanya. Dia berkata, mengapa engkau bunuh jiwa yang bersih, yang suci dari kedurhakaan, bukan karena dia melakukan kedurhakaan dengan membunuh orang lain' sungguh, engkau telah melakukan sesuatu yang sangat mungkar."
  }
]