[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Khadir menerima permohonan maafnya. Kemudian mereka berdua keluar dari kapal itu. Maka ketika mereka berjalan di tepi laut, tiba-tiba mereka melihat anak kecil sedang bermain dengan sekumpulan anak-anak lainnya. kemudian khadir membunuhnya. Maka musa pun mengingkari perbuatan khadir dan berkata, ”bagaimana engkau membunuh jiwa yang masih suci, belum mencapai usia taklif, sedangkan ia tidaklah membunuh satu jiwa sehingga pantas untuk dibunuh karenanya? sungguh engkau telah melakukan perbuatan mungkar yang besar. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Maka setelah mereka turun dari kapal, mereka lalu menuju ke pantai. Lalu mereka melihat seorang anak yang belum dewasa bermain bersama teman-temannya, lalu Khaḍir membunuhnya. Musa pun berkata kepadanya, \"Mengapa engkau membunuh jiwa yang suci padahal ia tidak membuat kesalahan apapun?! Sungguh engkau telah melakukan sesuatu yang amat mungkar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Khadhir menerima permintaan maafnya. Dan setelah mereka turun dari perahu, mereka melanjutkan perjalanan; kemudian mereka bertemu dengan sekumpulan anak-anak yang sedang bermain, lalu Khadhir menangkap salah satu anak dan membunuhnya. Musa berkata dengan penuh pengingkaran: “Mengapa kamu membunuh jiwa yang tidak bersalah dan tidak melakukan dosa? Demi Allah kamu telah melakukan kemungkaran besar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. فَانطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلٰمًا فَقَتَلَهُۥ (Maka berjalanlah keduanya; hingga tatkala keduanya berjumpa dengan seorang anak, maka Khidhr membunuhnya) Saat itu anak tersebut sedang bermain dengan teman-temannya, lalu Khidhir mencabut kepalanya. قَالَ(Musa berkata) Nabi Musa berkata. أَقَتَلْتَ نَفْسًا زَكِيَّةًۢ( Mengapa kamu membunuh jiwa yang bersih) Makna (الزكية) adalah bersih dari dosa. بِغَيْرِ نَفْسٍ(bukan karena dia membunuh orang lain?) Yakni bukan karena membunuh orang yang diharamkan pembunuhannya sehingga perbuatanmu ini menjadi sebuah qishash. لَّقَدْ جِئْتَ شَيْـًٔا نُّكْرًا(Sesungguhnya kamu telah melakukan suatu yang mungkar) Yakni sesuatu yang mungkar dan mengerikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ لَقَدْ جِئْتَ شَيْئًا نُكْرًا } Sebagian ulama berdalil dengan ayat ini bahwa anak yang dimaksud dalam ayat ini telah mencapai masa baligh, namun sebagian lainnya berdalil dengan ayat yang sama bahwa anak itu belum mencapai masa baligh. Maka kelompok yang mengatakan baligh mereka mengatakan: karena pada ayat ini disebutkan lafadz { زَكِيَّةً } yang bermakna (belum dihitung baginya dosa dari kesalahannya), dan kelompok lainnya berhujjah bahwa pada ayat terdapat lafadz { بِغَيْرِ نَفْسٍ } \"bukan karena dia membunuh orang lain\"; dapat difahami bahwa jika dibunuhnya anak itu karena ia telah membunuh jiwa lain maka tidak ada masalah yang lebih panjang, dan ini menunjukkan bahwa naka itu telah baligh, kecuali jika anak itu belum baligh maka tidak wajib dijatuhkan hukuman yang sama jika saja ia telah membunuh jiwa lain. 2 ). Tatkala Musa -عليه السلام- mengingkari perbuatan Khidr yang menenggelamkan kapal sehingga Khidr berkata kepadanya : { قَالَ أَلَمْ أَقُل إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًا } \"Khidhr berkata: \"Bukankah sudah kukatakan, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku?\", juga ketika Musa kembali kepada Khidr dengan pengingkarannya terhadap pembunuhan seorang anak setelah ia berjanji bahwa tidak akan lagi menentang perlaku Khidr, Khidr kemudian berkata lagi { قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًا } \"Khidhr berkata: \"Bukankah sudah kukatakan kepadamu, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku\" dengan tambahan lafadz ( لَّكَ ) sebagai penekanan bahwa Musa benar-benar tidak sabar dengan ilmunya, dan ini merupakan kebiasaan orang-orang Arab dalam berdialog dengan orang yang mengulang-ulang penentangannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Maka setelah melangkah dari perahu keduanya berjalan lagi, hingga ketika keduanya berjumpa dengan seorang anak. Lantas Khidhr membunuh anak itu. Kemudian Musa berkata: \"Mengapa kamu tega membunuh jiwa yang masih bersih, tanpa sebab bahwa dia telah membunuh orang lain? Sesungguhnya kamu telah melakukan suatu kemungkaran dalam hal agama.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian keduanya berjalanlah hingga ketika berjumpa dengan seorang anak, dia membunuhnya. Dia berkata} Musa berkata {“Mengapa kamu membunuh jiwa yang bersih} suci dari dosa dan belum sampai dewasa {bukan karena dia membunuh orang lain. Sungguh kamu telah melakukan sesuatu yang sangat mungkar”} perkara munkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. “Maka berjalanlah keduanya; hingga tatkala keduanya berjumpa dengan seorang anak,” yaitu anak kecil “maka dia mem bunuhnya,” Khidhir membunuhnya. Kemarahan pun semakin menjadi-jadi pada Musa, kecemburuan agamanya sontak muncul ketika Khidhir membunuh seorang anak kecil yang belum berbuat dosa. “Musa berkata, ‘Mengapa kamu bunuh jiwa yang masih bersih, bukan karena dia membunuh orang lain. Sesungguhnya kamu telah melakukan suatu yang mungkar’.” Kemungkaran mana yang sebanding dengan membunuh anak kecil yang belum ternoda oleh dosa, dan ia pun tidak membunuh orang lain? Teguran Musa yang pertama muncul karena kelupaan. Sedangkan sanggahan ini bukan karena lupa, tetapi karena tidak sabar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 74: Dengan menarik kepalanya dari atas. Karena anak itu belum baligh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 74",
    "description": "Nabi khidr memaafkan nabi musa, lalu keduanya meninggalkan perahu dengan selamat dan turun ke pantai. Maka berjalanlah keduanya; hingga ketika keduanya berjumpa dengan seorang anak muda, maka dia dengan serta merta membunuhnya. Melihat nabi khidr membunuh anak muda itu, nabi musa tidak dapat menahan keinginannya untuk bertanya. Dia berkata, mengapa engkau bunuh jiwa yang bersih, yang suci dari kedurhakaan, bukan karena dia melakukan kedurhakaan dengan membunuh orang lain' sungguh, engkau telah melakukan sesuatu yang sangat mungkar. 75. Setelah memperingatkan nabi musa untuk tidak mempertanyakan hal yang dia lakukan, hamba yang saleh (nabi khidir) kembali memperingatkan nabi musa yang mempertanyakan perbuatan nabi khidir membunuh seorang anak tanpa sebab yang dibenarkan. Dia berkata, 'bukankah sudah pernah kukatakan kepadamu bahwa engkau tidak akan mampu bersikap sabar bersamaku saat melihat apa yang kulakukan''."
  }
]