[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Khadir berkata kepada Musa untuk menegurnya dan mengingatkannya, ”bukankah sudah aku katakan kepadamu, bahwa sesungguhnya engkau tidak akan bisa bersabar berjalan bersamaku terhadap apa yang engkau lihat pada tindakan-tindakanku yang engkau tidak menguasai pengetahuannya tentangnya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Khaḍir berkata kepada Musa, \"Sungguh aku telah memberitahukanmu bahwa engkau tidak akan sanggup bersabar dengan perbuatan yang akan aku lakukan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Maka Khadhir berkata: “Bukankah aku telah berkata kepadamu bahwa kamu tidak akan bersabar dengan perbuatanku yang kamu lihat?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. قال (ia berkata) Yakni Khidhir berkata. ألم أقل لك إنك لن تستطيع معي صبرا (Bukankah sudah kukatakan kepadamu, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku?) Khidhir menambahkan lafadz (لك) karena sebab dan alasan untuk menegur Nabi Musa lebih besar dan kuat, karena pelanggaran Nabi Musa terulang kembali."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Khidhr mengulangi peringatannya dengan berkata: \"Bukankah sudah kukatakan kepadamu, bahwa sesungguhnya kamu tidak akan dapat sabar bersamaku atas perbuatanku?\" kata laka ditambahkan sebagai penekanan peringatan dan pengulangan ketidaksetujuan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Khidzir berkata kepada Musa {“Bukankah aku sudah berkata kepadamu bahwa sesungguhnya kamu tidak akan mampu bersabar bersamaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "75. Khidhir berkata kepada Musa untuk menegur dan mengingatkan, “Bukankah sudah kukatakan kepadamu, bahwa kamu tidak akan dapat sabar bersamaku?”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 75",
    "description": "Setelah memperingatkan nabi musa untuk tidak mempertanyakan hal yang dia lakukan, hamba yang saleh (nabi khidir) kembali memperingatkan nabi musa yang mempertanyakan perbuatan nabi khidir membunuh seorang anak tanpa sebab yang dibenarkan. Dia berkata, 'bukankah sudah pernah kukatakan kepadamu bahwa engkau tidak akan mampu bersikap sabar bersamaku saat melihat apa yang kulakukan''76. Mendengar peringatan kedua itu, nabi musa merasa tidak enak dan malu. Namun, karena keinginan untuk memperoleh ilmu darinya sangat kuat, dia memohon agar diberi kesempatan lagi. Dia berkata kepadanya, 'jika aku bertanya lagi kepadamu tentang sesuatu yang kaulakukan setelah ini, maka jangan lagi engkau memperbolehkan aku menyertaimu dalam perjalanan ini. Sesungguhnya engkau sudah cukup bersabar terhadapku yang terlalu banyak bertanya dan engkau juga mau menerima alasan dariku dan memaafkan aku. '."
  }
]