[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata kepadanya, ”jika aku bertanya kepadamu tentang sesuatu setelah kali ini, maka tinggalkanlah aku dan janganlah engkau memperbolehkan aku mendampingimu. Sesungguhnya engkau telah cukuup memberi toleransi terkait tindakanku dan engkaupun tidak kurang dalam mengingatkan lantaran telah memberitahuku bahwa sesungguhnya aku tidak akan mampu bersabar bersamamu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Musa berkata, \"Jika aku bertanya tentang sesuatu setelah ini maka janganlah engkau membolehkan aku menyertaimu, sebab aku telah sampai pada batasan yang mengharuskan diriku berpisah denganmu, yaitu aku telah menyelisihi perintahmu sebanyak tiga kali.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Musa meminta maaf dengan penuh penyesalan: “Jika aku kembali mengingkari perbuatanmu, maka janganlah biarkan aku mengikutimu lagi, karena kamu telah banyak memberiku maaf.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. قال إن سألتك عن شيء بعدها (Musa berkata: “Jika aku bertanya kepadamu tentang sesuatu sesudah ini) Yakni setelah kali ini. فلا تصاحبني قد بلغت من لدني عذرا (maka janganlah kamu memperbolehkan aku menyertaimu, sesungguhnya kamu sudah cukup memberikan uzur padaku”) Maksud Nabi Musa adalah janganlah memperbolehkan aku menyertaimu lagi jika aku telah melanggar aturanmu sebanyak tiga kali. Ini merupakan ucapan dari seseorang yang sangat dalam penyesalannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan peristiwa yang agung ini bagaimana sikap Musa kepada temannya Khidr : { قَالَ إِنْ سَأَلْتُكَ عَنْ شَيْءٍ بَعْدَهَا فَلَا تُصَاحِبْنِي } \"Musa berkata: “Jika aku bertanya kepadamu tentang sesuatu sesudah (kali) ini, maka janganlah kamu memperbolehkan aku menyertaimu\" kemudian memohon maaf kepada Khidr karena akan menghentikan perjalanan bersamanya { قَدْ بَلَغْتَ مِنْ لَدُنِّي عُذْرًا } \"sesungguhnya kamu sudah cukup memberikan uzur padaku\" sikap yang penuh adab dan pelajaran besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Musa berkata: \"Jika aku bertanya kepadamu lagi tentang sesuatu sesudah ini, maka jangan jadikan aku mengikutimu lagi atau usirlah aku. Sesungguhnya engkau sudah cukup memberikan toleransi padaku untuk tidak mengusirku sebab pengingkaranku sebanyak tiga kali\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Musa berkata kepada Khidzir {“Jika aku bertanya kepadamu tentang sesuatu setelah ini} setelah kali ini {maka janganlah memperbolehkan aku menemanimu} maka berpisahlah dariku {Sungguh kamu telah mencapai batas memberikan uzur (maaf) kepadaku”} Kamu telah sampai batas menerima alasan dariku untuk meninggalkanku, dimana aku selalu menentangmu lagi dan lagi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Maka “dia berkata,” yaitu Musa “JIka aku bertanya kepadamu tentang sesuatu sesudah (kali) ini,” setelah kali ini “maka janganlah kamu memperbolehkan aku menyertaimu,” maksudnya engkau punya alasan dan berhak meninggalkan kesertaanku “sesungguhnya kamu sudah cukup memberikan udzur kepadaku,” maksudnya kamu telah memberi toleransi bagiku, kamu tidak pelit untuk memberi kesempatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 76: Yakni engkau telah memberiku uzur dan tidak mengurangi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 76",
    "description": "Mendengar peringatan kedua itu, nabi musa merasa tidak enak dan malu. Namun, karena keinginan untuk memperoleh ilmu darinya sangat kuat, dia memohon agar diberi kesempatan lagi. Dia berkata kepadanya, 'jika aku bertanya lagi kepadamu tentang sesuatu yang kaulakukan setelah ini, maka jangan lagi engkau memperbolehkan aku menyertaimu dalam perjalanan ini. Sesungguhnya engkau sudah cukup bersabar terhadapku yang terlalu banyak bertanya dan engkau juga mau menerima alasan dariku dan memaafkan aku. '77. Permohonan nabi musa dikabulkan oleh hamba yang saleh itu, maka keduanya berjalan meneruskan pengembaraan hingga suatu ketika keduanya sampai di suatu negeri. Mereka datang kepada penduduk setempat dan bertanya tentang negeri itu. Rasa lapar yang mendera memaksa mereka berdua meminta dijamu oleh penduduknya, tetapi mereka tidak mau menjamu mereka. Karena tidak dijamu, kemudian keduanya melanjutkan perjalanan. Tidak lama sesudah itu mereka mendapatkan dinding sebuah rumah yang hampir roboh di negeri itu. Tanpa disuruh, lalu dia, hamba yang saleh itu, menegakkannya. Dengan terheran, dia, yaitu musa, berkata kepadanya, 'jika engkau mau, niscaya engkau dapat meminta imbalan untuk pekerjaan yang telah kaulakukan itu. '."
  }
]