[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka musa dan khadir berjalan hingga menjumpai penduduk suatu kampung. Mereka berdua meminta makanan sebagai jamuan bagi mereka berdua, akan tetapi penduduk kampung tersebut menolak untuk menjamu mereka berdua. Kemudian mereka mendapati di sana ada dinding miring yang hampir-hampir roboh. Maka khadir menegakannya hingga berdiri lurus. Musa berkata kepadanya, ”jika engkau mau engkau bisa mengambil upah atas pekerjaan itu yang dapat engkau pergunakan untuk mendapatkan makanan untuk kita, karena mereka tidak memberikan jamuan kepada kita. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Maka keduanya melanjutkan perjalanan, hingga ketika keduanya sampai pada suatu negeri, mereka berdua meminta dari penduduk negeri tersebut untuk dijamu, tetapi mereka enggan menjamu mereka berdua. Kemudian di negeri tersebut, keduanya mendapatkan satu dinding rumah yang miring dan hampir jatuh dan roboh, maka Khaḍir segera memperbaikinya hingga berdiri tegak. Melihat hal ini, Musa berkata kepada Khaḍir, \"Jika engkau mau niscaya engkau dapat meminta imbalan dari pembetulan dinding ini karena kita memerlukan imbalan tersebut setelah mereka enggan menjamu kita.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Maka Khadhir menerima permintaan maafnya sekali lagi. Kemudian mereka kembali melanjutkan perjalanan hingga sampai pada para penduduk suatu negeri, mereka berdua meminta mereka makanan namun mereka menolak permintaan itu. Lalu mereka berdua mendati dinding miring yang hampir roboh, maka Khadhir mengusapnya dengan tangan sehingga dinding itu tegak kembali! Musa berkata: “Jika kamu menghendaki, kamu dapat meminta upah dari para penduduk itu karena telah memperbaiki dinding tersebut.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. فانطلقا حتى إذا أتيا أهل قرية (Maka keduanya berjalan; hingga tatkala keduanya sampai kepada penduduk suatu negeri) Terdapat pendapat mengatakan negeri tersebut adalah kota Eilat. استطعما أهلها فأبوا أن يضيفوهما (mereka minta dijamu kepada penduduk negeri itu, tetapi penduduk negeri itu tidak mau menjamu mereka) Yakni mereka enggan memberi mereka berdua jamuan yang menjadi hak bagi tamu. فوجدا فيمها جدارا يريد أن ينقض فأقامه (kemudian keduanya mendapatkan dalam negeri itu dinding rumah yang hampir roboh, maka Khidhr menegakkan dinding itu) Khidhir melihat dinding itu miring, lalu ia memperbaikinya seperti sedia kala. Dalam hadits disebutkan bahwa Khidhir hanya mengelus dinding tersebut dengan tangannya, dan dinding tersebut menjadi tegak kembali. قال (dia berkata) Nabi Musa berkata. لو شئت لاتخذت عليه أجرا (Jikalau kamu mau, niscaya kamu mengambil upah untuk itu) Yakni upah atas perbaikan dinding tersebut sehingga menjadi tegak kembali, sehingga kita dapat mempunyai sesuatu untuk membeli makanan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Maka keduanya berjalan; hingga tatkala keduanya sampai kepada penduduk suatu negeri, dikatakan negeri itu adalah Abalah atau Anthakiyah. Mereka berdua minta jamuan makan kepada penduduk negeri itu, tetapi penduduk negeri itu tidak mau menjamu mereka. Kemudian keduanya mendapati sebuah dinding rumah yang hampir roboh, maka Khidhr menegakkan dinding itu seperti semula. Kemudian. Dijelaskan dalam hadis sahih bahwasannya Nabi Khidhir mengusap dinding itu dengan tangannya, setelah dinding itu tegak lagi Musa berkata: \"Jikalau kamu mau, niscaya kamu mengambil upah untuk itu sehingga kita bisa makan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu keduanya berjalan hingga ketika keduanya sampai ke penduduk suatu negeri, mereka berdua meminta dijamu oleh penduduknya} meminta dari penduduk negeri itu makanan karena menjadi tamu {lalu mereka tidak mau} mereka menolak {menjamu keduanya. Kemudian keduanya mendapati dinding yang hampir roboh, lalu dia menegakkannya} nyaris jatuh, lalu Khidzir menyusunnya menggunakan tangannya {Dia berkata} Musa berkata kepadanya {“Jika kamu mau, kamu dapat meminta imbalan untuk itu} untuk memperbaiki dinding itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. “Maka keduanya berjalan; hingga tatkala keduanya sampai kepada penduduk suatu negeri, mereka minta dijamu kepada penduduk negeri itu,” maksudnya mereka berdua minta perjamuan kepada penduduknya, namun mereka tidak mau menyuguhi mereka berdua, “kemudian keduanya mendapatkan dalam negeri itu dinding rumah yang hampir roboh,” maksudnya [sungguh] telah rusak dan berantakan “maka dia menegakkan dinding itu,” yaitu KHidhir, maksudnya, membangun dan memperbaruinya lagi. Kemudian “dia berkata,” yaitu Musa, “JIkalau kamu mau, niscaya kamu mengambil upah untuk itu,” yaitu kepada penduduk negeri itu. Mereka tidak mau menjamu kita, padahal harus mereka lakukan, sementara itu, justru engkau membangun rumah itu tanpa upah sama sekali, padahal engkau mampu memintanya?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 77: Ada yang mengatakan, bahwa negeri itu adalah negeri Anthakiyah. Padahal yang demikian (menjamu tamu) wajib bagi mereka. Yakni karena mereka tidak menjamu kita, padahal kita butuh makan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 77",
    "description": "Permohonan nabi musa dikabulkan oleh hamba yang saleh itu, maka keduanya berjalan meneruskan pengembaraan hingga suatu ketika keduanya sampai di suatu negeri. Mereka datang kepada penduduk setempat dan bertanya tentang negeri itu. Rasa lapar yang mendera memaksa mereka berdua meminta dijamu oleh penduduknya, tetapi mereka tidak mau menjamu mereka. Karena tidak dijamu, kemudian keduanya melanjutkan perjalanan. Tidak lama sesudah itu mereka mendapatkan dinding sebuah rumah yang hampir roboh di negeri itu. Tanpa disuruh, lalu dia, hamba yang saleh itu, menegakkannya. Dengan terheran, dia, yaitu musa, berkata kepadanya, 'jika engkau mau, niscaya engkau dapat meminta imbalan untuk pekerjaan yang telah kaulakukan itu. '78. Mendengar komentar nabi musa, dia, hamba yang saleh itu, berkata, 'inilah saat perpisahan antara aku dengan engkau sebagaimana janjimu sebelumnya. Sebelum kita berpisah, aku akan memberikan penjelasan secara rinci kepadamu atas semua perbuatan yang telah aku lakukan dan membuat engkau tidak mampu bersikap sabar terhadapnya. Kesabaran dalam menuntut ilmu harus dimiliki oleh semua penuntut ilmu. Tanpa kesabaran niscaya muncul ketergesa-gesaan yang pada akhirnya akan menyebabkan kegagalan."
  }
]