[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Khadir berkata kepada musa, ”ini adalah saat perpisahan antara aku dan kamu. Aku akan memberitahukan kepadamu apa yang engkau ingkari terhadapku dari tindakan-tindakan yang aku perbuat dan yang engkau tidak mampu bersabar untuk tidak menanyakannya dan mengingkariku terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Khaḍir lalu berkata kepada Musa, \"Sikap keberatanmu terhadap diriku yang enggan meminta imbalan atas perbaikan dinding ini adalah titik pemisah antara diriku dan dirimu, dan aku akan menjelaskan padamu keterangan dan maksud perbuatan yang engkau tidak sanggup bersabar ketika menyaksikan diriku melakukannya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Khadhir berkata: “Inilah saat perpisahan kita, aku akan memberitahukanmu maksud dari perbuatanku yang membuatmu tidak dapat menahan kesabaran untuk bertanya.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. قَالَ (dia berkata) Khidhir berkata. هٰذَا فِرَاقُ بَيْنِى وَبَيْنِكَ ۚ(Inilah perpisahan antara aku dengan kamu) Yakni ucapanmu untuk mengingkariku karena tidak mengambil upah adalah pemisah diantara kita. سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ تَسْتَطِع عَّلَيْهِ صَبْرًا(kelak akan kuberitahukan kepadamu tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya) Makna (التأويل) yakni tafsir dan penjelasan tentang tujuan perbuatan-perbuatan Khidhir yang selalu diingkari Nabi Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Khidhr berkata kepada Musa: \"Inilah perpisahan antara aku dengan kamu setelah engkau mengingkari kesepakatan kita untuk ketiga kalinya. Akan kuberitahukan kepadamu maksud setiap perbuatan yang telah aku lakukan, yang kamu tidak sabar atas perbuatanku itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Khidzir berkata kepada Musa {“Inilah perpisahan antara aku dan kamu. Aku akan memberitahumu} memberitahumu {makna} tafsir {sesuatu yang kamu tidak mampu bersabar terhadapnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Pada saat itulah, Musa tidak menepati apa yang dia ucapkan. Dan Khidhir meminta pamit kepadanya, seraya “mengatakan” kepada Musa, “inilah perpisahan antara aku dengan kamu,” karena sesungguhnya engkau telah menetapkan syarat tersebut atas dirimu sendiri, sekarang sudah tidak diterima lagi alasan dan kesempatan untuk menyertai lagi. “Aku akan memberitahukan kepadamu tujuan perbuatan-perbuatan yang membuatmu tidak dapat sabar terhadapnya,” maksudnya aku akan memberitahukan kepadamu tentang apa yang engkau ingkari terhadapku, dan aku memberitakan bahwa aku mempunyai tujuan sasaran dari tindakanku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 78: Yakni karena engkau telah membuat syarat terhadap dirimu, uzur telah hilang serta kita tidak bisa bersama lagi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 78",
    "description": "Mendengar komentar nabi musa, dia, hamba yang saleh itu, berkata, 'inilah saat perpisahan antara aku dengan engkau sebagaimana janjimu sebelumnya. Sebelum kita berpisah, aku akan memberikan penjelasan secara rinci kepadamu atas semua perbuatan yang telah aku lakukan dan membuat engkau tidak mampu bersikap sabar terhadapnya. Kesabaran dalam menuntut ilmu harus dimiliki oleh semua penuntut ilmu. Tanpa kesabaran niscaya muncul ketergesa-gesaan yang pada akhirnya akan menyebabkan kegagalan. 79. Sesudah memutuskan berpisah dengan nabi musa, hamba yang saleh itu menjelaskan perbuatannya satu per satu. Dia mengatakan, 'adapun perahu yang aku lubangi itu adalah milik orang miskin yang dipergunakan untuk bekerja di laut guna mencari nafkah. Aku bermaksud merusaknya agar perahu itu tampak cacat. Aku berbuat demikian karena di hadapan mereka ada seorang raja zalim yang akan merampas setiap perahu yang masih bagus. '."
  }
]