[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun tentang kapal yang aku lubangi, sesungguhnya itu adalah kepunyaan orang-orang yang membutuhkan (mereka tidak memiliki sesuatu yang mencukupi dan menutupi kebutuhan mereka) yang bekerja di laut untuk mencari nafkah. Maka aku berniat merusaknya dengan cara melubanginya, karena dihadapan mereka ada seorang raja yang akan mengambil setiap kapal yang bagus dengan merampasnya dari para pemiliknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Adapun kapal yang engkau mengingkariku tatkala melobanginya, maka ia adalah milik orang-orang lemah yang mencari rezeki dengannya di lautan, dan mereka tidak mampu untuk mempertahankannya bila dirampas, sehingga aku pun berharap agar kapal itu tetap cacat karena aku lobangi, sehingga tidak dirampas oleh seorang raja yang kebetulan berada di hadapan mereka yang bertujuan merampas semua kapal yang bagus secara paksa dari para pemiliknya, dan ia hanya membiarkan kapal yang cacat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Adapun perahu yang aku lubangi itu adalah milik orang-orang miskin yang mereka gunakan untuk bekerja di laut demi mencari rezeki, aku sengaja melubanginya agar perahu itu memiliki kekurangan, sehingga tidak dirampas oleh raja yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. أَمَّا السَّفِينَةُ (Adapun bahtera itu) Yakni perahu yang dia lubangi. فَكَانَتْ لِمَسٰكِينَ (adalah kepunyaan orang-orang miskin) Yakni milik orang-orang lemah yang tidak mempunyai kekuatan untuk mencegah orang yang hendak menzalimi mereka. يَعْمَلُونَ فِى الْبَحْرِ(yang bekerja di laut) Dan mereka tidak memiliki harta selain perahu tersebut. Mereka menyewakan perahu tersebut untuk orang-orang yang ingin menyebrangi laut, kemudian mereka mengambil upah atas penyewaan tersebut. فَأَرَدتُّ أَنْ أَعِيبَهَا(dan aku bertujuan merusakkan bahtera itu) Dengan mencabut bagian dari perahu tersebut. وَكَانَ وَرَآءَهُم مَّلِكٌ(karena di hadapan mereka ada seorang raja) Yakni di depan mereka. Pendapat lain mengatakan yakni di belakang mereka. يَأْخُذُ كُلَّ سَفِينَةٍ غَصْبًا(yang merampas tiap-tiap bahtera) Yakni merampas semua perahu yang bagus, dan tidak mengambil perahu yang memiliki kerusakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "79-82 1 ). Mutharrif bin Abdullah berkata tentang ayat ini : { وَأَمَّا ٱلْغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } \"Dan adapun anak muda itu, maka keduanya adalah orang-orang mukmin, dan kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran\" : sesungguhnya kami mengetahui bahwa kedua ayah-ibunya begitu bahagia pada hari kelahiran anaknya, dan begitu bersedih tatkala mengatahui anaknya dibunuh, namun jika ia tetap hidup ditakutkan kebinasaan akan berpihak kepada ayah-ibunya, maka hendaklah setiap orang menerima segala ketentuan yang telah diporsikan oleh Allah untuknya; karena sesungguhnya ketetapan Allah itu lebih baik dari apa dikehendaki oleh hamba-Nya, dan ketetapan Allah untuk dirimu namun kamu membencinya itu lebih baik daripada apa yang kamu sukai. 2 ). Faidah yang dapat diambil dari firman Allah : { فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } bahwa musibah kematian seorang anak hakikatnya adalah musibah yang biasa, sekalipun mereka benar-benar dari darah daging sendiri, dan barangsiapa yang berserah diri kepada ketetapan sang pencipta niscaya kesedihannya akan segera pulih. 3 ). Perhatikan perbedaan ucapan Khidr tatkala ia menenggelamkan kapal : { فَأَرَدتُّ أَنْ أَعِيبَهَا } \"dan aku bertujuan merusakkan bahtera itu\" dan ketika membunuh seorang anak beliau berkata : { فَأَرَدْنَآ أَن يُبْدِلَهُمَا رَبُّهُمَا } \"Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka\" dan ketika mendirikan bangunan yang rusak beliau mengatakan : { فَأَرَادَ رَبُّكَ أَن يَبْلُغَآ أَشُدَّهُمَا } \"maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya\" pertanyaannya kenapa Khidr mengganti penisbatan pelaku disetiap kejadian itu? tatkala ia bermaksud kepada kerusakan kapal mengatakan : \"dan aku bertujuan\"; ia menisbatkan pengrusakan kepada dirinya sendiri tidak kepada Allah sebagai adab kepada-Nya, dan tatkala pembunuhan seorang anak ia berkata : \"Dan kami menghendaki\" dengan konteks jamak; mengingatkan bahwa perbuatan itu merupakan perintah Allah sendiri, dan pastinya ada hikmah dibaliknya, dan ketika bermaksud kepada kemaslahatan dua anak yatim ia menisbatkan kepada Allah \"maka Tuhanmu menghendaki\" ia menisbatkan kenikmatan kepada Allah. 4 ). Firman Allah : { وَكَانَ أَبُوهُمَا صَٰلِحًا } \"sedang ayahnya adalah seorang yang saleh\" terdapat beberapa faidah, diantaranya : bahwasanya seorang hamba yang shalih senantiasa dijaga oleh Allah dari dirinya sendiri sampai kepada keturunannya dan orang-orang yang selalu bersama dengannya, faidah lainnya adalah bahwasanya membantu orang-orang shalih untuk kemaslahatan mereka lebih utama daripada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Adapun perahu yang aku lubangi itu adalah milik orang-orang miskin yang bekerja di laut. Mereka hanya memiliki perahu itu untuk mencari rizki. Mereka tidak berdaya melawan orang yang zalim terhadap mereka. Mereka bekerja dengan menyewakan perahu itu. Aku bermaksud melubangi perahu itu karena di hadapan mereka ada seorang raja yang merampas semua perahu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun perahu itu adalah milik orang-orang miskin yang bekerja di laut. Aku bermaksud membuatnya cacat} membuatnya memiliki kecacatan dengan melubanginya {karena di hadapan mereka} di hadapan mereka {ada seorang raja yang mengambil setiap perahu} setiap perahu yang baik {secara paksa} secara paksa dan zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. “Adapun bahtera itu,” yang aku lubangi “adalah kepunyaan orang-orang miskin yang bekerja di laut,” yang menuntut munculnya rasa iba dan kasihan kepada mereka “lalu aku bertujuan merusak bahtera itu, karena di hadapan mereka ada seorang raja yang merampas tiap-tiap bahtera,” maksudnya mereka itu (dalam berlayar), melewati raja yang zhalim. Setiap kapal yang baik yang melewati sang raja tanpa cacat, maka dia merampasnya atau mengambilnya secara paksa. Karena itu, aku berniat melubanginya agar memiliki cacat, sehingga selamat dari (jarahan) penguasa yang zhalim itu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 79: Yang seharusnya dikasihani. Yang zalim. Yang kondisinya baik. Dengan dilubangi perahunya, maka perahu ini selamat dari rampasan raja yang zalim tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 79",
    "description": "Sesudah memutuskan berpisah dengan nabi musa, hamba yang saleh itu menjelaskan perbuatannya satu per satu. Dia mengatakan, 'adapun perahu yang aku lubangi itu adalah milik orang miskin yang dipergunakan untuk bekerja di laut guna mencari nafkah. Aku bermaksud merusaknya agar perahu itu tampak cacat. Aku berbuat demikian karena di hadapan mereka ada seorang raja zalim yang akan merampas setiap perahu yang masih bagus. '80. Dan adapun anak yang aku bunuh itu adalah putra dari kedua orang tua mukmin yang kuat dan teguh imannya, dan kami khawatir kalau dia akan memaksa kedua orang tuanya kepada kesesatan dan kekafiran, lalu keduanya tidak kuasa menolak paksaan anaknya itu karena besarnya kasih sayang mereka kepadanya."
  }
]