[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sesungguhnya Kami benar-benar menjadikan apa yang terdapat di muka bumi dari perhiasan tersebut ketika dunia berakhir berupa tanah yang tanpa tumbuh-tumbuhan sama sekali di dalamnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Dan Kami akan merubah segala apa yang ada di atasnya berupa makhluk-makhluk yang beragam menjadi tanah yang tandus lagi kosong dari tumbuhan, dan ini akan terjadi setelah berakhirnya masa kehidupan makhluk-makhluk ini, sebab itu mereka (manusia) hendaknya mengambil pelajaran darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. وَإِنَّا لَجٰعِلُونَ مَا عَلَيْهَا (Dan sesungguhnya Kami benar-benar akan menjadikan (pula) apa yang di atasnya) Yakni menjadikan perhiasan ini ketika telah habis umur dunia. صَعِيدًا(menjadi tanah rata) Yakni menjadi tanah. جُرُزًا(lagi tandus) Yang tidak terdapat tanaman dan perhiasan di atasnya. Seperti kebun yang habis dimakan belalang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Sesungguhnya pada hari kiamat kelak Kami benar-benar akan menjadikan apa yang di atasnya menjadi tanah rata lagi tandus tanpa tanaman dan hiasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar akan menjadikan apa yang di atasnya sebagai tanah} debu {yang kering} kering tidak ada tumbuhan di atasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Meskipun demikian, Allah akan menjadikan semua yang telah disebutkan sebagai obyek-obyek yang fana (sirna) lagi musnah, lenyap dan berakhir. Bumi akan kembali, “menjadi tanah yang rata lagi tandus,” telah pergi kenikmatan-kenikmatannya, sungai-sungainya berhenti (mengalir) dan bekas-bekasnya hilang sesrta kenikmatannya sirna. Inilah hakikat dunia. Allah telah mempertontonkannya dengan jelas kepada kita, seolah-olah dunia itu seperti melihat dengan dua mata kita, memperingatkan kita agar tidak terpedaya olehnya dan (juga) merangsang kita untuk lebih menyukai suatu tempat, yang kenikmatannya abadi dan penghuninya berbahagia. Semua itu merupakan rahmat Allah kepada kita. Orang yang melihat penampilan (pesona) fisik dunia semata tanpa (memperhatikan) hakikatnya, niscaya akan tertipu dengan keindahan dan perhiasannya, lalu mereka bersahabat dengannya layaknya binatang-binatang ternak (bersahabat) dan bersenang-senang dengan dunia seperti binatang-binatang yang digembalakan. Mereka tidak menoleh kepada hak Rabb mereka, dan tidak berkepentingan untuk mengenalnya. Bahkan obsesi mereka hanyalah ingin menikmati syahwat dunia dengan cara apa pun dihasilkan dan pada kesempatan kapanpun yang muncul. Mereka ini, apabila ajal mendatangi mereka, pasti mereka gundah lantaran dirinya hancur dan kenikmatannya lenyap. Bukan (merasa bersalah) disebabkan perbuatan yang telah dilakukannya berupa penyepelean aturan (Allah) dan dosa-dosa. Adapun orang yang memperhatikan hakikat dunia, memahami maksud penciptaan dunia dan dirinya, maka dia akan mengambil (bagian) dari dunia tersebut sekedar untuk dipakai merealisasikan tujuan penciptaan dirinya. Dia memanfaatkan kesempatan dalam umurnya yang berharga, lalu menjadikan dunia sebagai jembatan penyeberangan, bukan tempat bersenang-senang, tempat transit dalam perjalanan, bukan tempat menetap. Dia mengorbankan segala kemampuannya untuk mengenal Rabbnya, melaksanakan perintah-perintahNya dan memperbagus amalannya. Orang ini akan berada di tempat sebaik-baiknya di sisi Allah, dan dia layak untuk menerima segala kemuliaan, kenikmatan, dan kebahagiaan, serta penghormatan di sisi Allah. Dia melihat hakikat dunia, tatkala orang yang tertipu melongok pesona fisiknya, beramal untuk kehidupan akhiratnya tatkala para pemburu dunia beramal untuk dunia. Alangkah jauh perbedaan antara kedua golongan itu!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 8: Yakni semua perhiasan di muka bumi ini dan kesenangannnya akan binasa, hilang dan habis, dan bumi akan kembali tandus serta kering. Inilah hakikat dunia, Allah telah memperjelas kepada kita sejelas-jelasnya, memperingatkan kita agar tidak tertipu olehnya, mendorong kita untuk mencintai negeri yang kenikmatannya kekal, dan penduduknya berbahagia. Semua itu merupakan rahmat-Nya kepada kita. Namun orang yang melihat dunia zahirnya saja tanpa melihat di balik itu, maka ia akan tertipu oleh gemerlapnya dunia dan keindahannya. Mereka pun menikmati dunia seperti hewan menikmatinya, di mana yang mereka pikirkan hanya makan, minum dan bersenang-senang. Mereka tidak ingat tujuan dari diciptakannya mereka, bahkan yang di benak mereka hanyalah memuaskan hawa nafsu belaka bagaimana pun caranya, halal atau haram. Adapun mereka yang melihat hakikat dunia dan mengetahui tujuan dari diciptakannya mereka, maka dia mengambil dunia ini dan menggunakannya untuk membantu beribadah kepada Allah, dia pun mengisi waktunya dengan ketaatan. Dia juga menjadikan dunia sebagai jembatan, bukan sebaai tujuan. Dia jadikan hidupnya di dunia sebagai musafir; bukan sebagai mukim. Dia juga mengerahkan kemampuannya untuk mengenal Tuhannya, melaksanakan perintah-Nya dan memperbaiki amalnya. Orang inilah yang memperoleh tempat yang baik di sisi Allah, yang layak memperoleh kemuliaan, kenikmatan dan kesenangan. Dia melihat lebih dalam dunia ini, sedangkan orang yang tertipu hanya melihat luarnya saja, dia bekerja untuk akhiratnya, sedangkan orang yang tertipu bekerja untuk dunianya, sungguh berbeda kedua orang itu!"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 8",
    "description": "Dan kelak di hari kiamat, kami benar-benar akan menjadikan apa yang di atasnya, yakni apa yang ada di atas bumi menjadi tanah yang tandus lagi kering, tidak ada lagi keindahannya. Demikianlah Allah menjadikan bumi dengan segala isinya yang dipandang indah oleh manusia sebagai sarana untuk menguji siapa di antara manusia itu yang baik perbuatannya dan siapa yang berbuat jahat. Kelak di hari kiamat kebaikan dan kejahatan itu akan mendapat pembalasan yang seadil-adilnya. Apakah engkau mengira bahwa ashha'bul-kahfi, yaitu orang-orang yang mendiami gua, dan yang mempunyai ar-raqim itu, yaitu nama anjing mereka atau tulisan-tulisan yang memuat nama-nama mereka termasuk tanda-tanda kebesaran kami yang menakjubkan' ya, memang ashha'bulkahf dan ar-raqim adalah menakjubkan, tetapi janganlah engkau mengira bahwa itu satu-satunya tanda kebesaran kami yang menakjubkan. Sesungguhnya banyak sekali tanda-tanda kebesaran kami yang sangat menakjubkan. Penciptaan langit dan bumi dan segala sesuatu yang berada di antara keduanya adalah tanda kekuasaan kami yang sangat menakjubkan apabila engkau memperhatikannya."
  }
]