[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun anak kecil yang aku bunuh, dia dala pengetahuan Allah akan menjadi seorang manusia kafir, sedang ayah ibunya adalah orang-orang mukmin, maka kami khawatir bila anak itu tetap hidup, maka dia akan menyeret orang tuanya ke dalam kekafiran dan tindakan melampaui batas, lantaran didorong oleh rasa cinta mereka kepadanya atau karena kebutuuhan mereka kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Adapun anak muda yang engkau ingkari perbuatanku ketika membunuhnya, maka kedua orangtuanya adalah mukmin, sedangkan ia adalah kafir menurut ilmu Allah, maka kamipun khawatir jika dewasa kelak ia akan memaksa kedua orangtuanya untuk kafir dan durhaka kepada Allah lantaran kecintaan keduanya yang sangat besar terhadap dirinya, atau lantaran besarnya harapan keduanya terhadap dirinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80-81. Sedangkan anak yang aku bunuh itu adalah anak yang kafir, sedangkan kedua orangtuanya beriman, kami takut rasa cinta kepadanya akan membuat kedua orangtuanya itu mengikuti agamanya; sehingga dengan membunuhnya kami berharap Allah akan mengaruniakan mereka berdua anak yang shalih yang lebih baik daripada anak itu dan berbakti kepada kedua orang tuanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَأَمَّا الْغُلٰمُ (Dan adapun anak muda itu) Yakni anak muda yang dia bunuh. فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ(maka keduanya adalah orang-orang mukmin) Sedangkan anak itu bukanlah termasuk orang yang mukmin. فَخَشِينَآ أَن يُرْهِقَهُمَا (dan kami khawatir bahwa dia akan menjerumuskan kedua orang tuanya) Terdapat pendapat mengatakan Khidhir mengetahui hal tersebut dari Allah bahwa anak itu telah ditakdirkan menjadi orang kafir, dan kelak kekafirannya dapat menyebabkan kekafiran kedua orangtuanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "79-82 1 ). Mutharrif bin Abdullah berkata tentang ayat ini : { وَأَمَّا ٱلْغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } \"Dan adapun anak muda itu, maka keduanya adalah orang-orang mukmin, dan kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran\" : sesungguhnya kami mengetahui bahwa kedua ayah-ibunya begitu bahagia pada hari kelahiran anaknya, dan begitu bersedih tatkala mengatahui anaknya dibunuh, namun jika ia tetap hidup ditakutkan kebinasaan akan berpihak kepada ayah-ibunya, maka hendaklah setiap orang menerima segala ketentuan yang telah diporsikan oleh Allah untuknya; karena sesungguhnya ketetapan Allah itu lebih baik dari apa dikehendaki oleh hamba-Nya, dan ketetapan Allah untuk dirimu namun kamu membencinya itu lebih baik daripada apa yang kamu sukai. 2 ). Faidah yang dapat diambil dari firman Allah : { فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } bahwa musibah kematian seorang anak hakikatnya adalah musibah yang biasa, sekalipun mereka benar-benar dari darah daging sendiri, dan barangsiapa yang berserah diri kepada ketetapan sang pencipta niscaya kesedihannya akan segera pulih. 3 ). Perhatikan perbedaan ucapan Khidr tatkala ia menenggelamkan kapal : { فَأَرَدتُّ أَنْ أَعِيبَهَا } \"dan aku bertujuan merusakkan bahtera itu\" dan ketika membunuh seorang anak beliau berkata : { فَأَرَدْنَآ أَن يُبْدِلَهُمَا رَبُّهُمَا } \"Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka\" dan ketika mendirikan bangunan yang rusak beliau mengatakan : { فَأَرَادَ رَبُّكَ أَن يَبْلُغَآ أَشُدَّهُمَا } \"maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya\" pertanyaannya kenapa Khidr mengganti penisbatan pelaku disetiap kejadian itu? tatkala ia bermaksud kepada kerusakan kapal mengatakan : \"dan aku bertujuan\"; ia menisbatkan pengrusakan kepada dirinya sendiri tidak kepada Allah sebagai adab kepada-Nya, dan tatkala pembunuhan seorang anak ia berkata : \"Dan kami menghendaki\" dengan konteks jamak; mengingatkan bahwa perbuatan itu merupakan perintah Allah sendiri, dan pastinya ada hikmah dibaliknya, dan ketika bermaksud kepada kemaslahatan dua anak yatim ia menisbatkan kepada Allah \"maka Tuhanmu menghendaki\" ia menisbatkan kenikmatan kepada Allah. 4 ). Firman Allah : { وَكَانَ أَبُوهُمَا صَٰلِحًا } \"sedang ayahnya adalah seorang yang saleh\" terdapat beberapa faidah, diantaranya : bahwasanya seorang hamba yang shalih senantiasa dijaga oleh Allah dari dirinya sendiri sampai kepada keturunannya dan orang-orang yang selalu bersama dengannya, faidah lainnya adalah bahwasanya membantu orang-orang shalih untuk kemaslahatan mereka lebih utama daripada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Adapun anak muda kafir yang aku bunuh itu, kedua orang tuanya adalah orang mukmin, aku khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran. Sebab keduanya sangat mencintai anak itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun anak itu, kedua orang tuanya mukmin dan kami khawatir kalau dia akan memaksa kedua orang tuanya untuk durhaka dan kufur} Kami takut kalau dia tetap hidup maka kecintaan kedua orang tuanya akan membawa mereka untuk mengikuti agama anaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Dan adapun anak itu,” yang aku bunuh “maka kedua orang tuanya adalah orang-orang Mukmin, lalu kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekufuran.” Anak lelaki itu telah ditakdirkan, jika menginjak dewasa (kelak) akan memaksa kedua orang tuanya kepada kesesatan dan kekufuran. Maksudnya, menyeret mereka kepada tindakan kesesatan dan kekufuran, baik lantaran kecintaan mereka kepadanya atau ketergantungan mereka kepadanya, maupun lantaran dia memaksa mereka berbuat demikian. Maka aku pun membunuhnya, sebab aku mengetahui (kesudahan) anak itu, demi keselamatan agama dua orang tuanya yang beriman. Apakah ada manfaat yang lebih besar daripada kebaikan yang besar ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 80: Yakni maka aku membunuhnya untuk menyelamatkan agama ibu bapaknya. Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Ibnu Abbas radhiyallahu 'anhuma, dari Ubay bin Ka’ab, ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda: « إِنَّ الْغُلاَمَ الَّذِى قَتَلَهُ الْخَضِرُ طُبِعَ كَافِرًا وَلَوْ عَاشَ لأَرْهَقَ أَبَوَيْهِ طُغْيَانًا وَكُفْرًا » . “Sesungguhnya anak yang dibunuh oleh Khadhir sudah dicap sebagai orang kafir. Jika ia tetap hidup, maka ia akan memaksa kedua orang tuanya kepada kesesatan dan kekafiran.” Yang demikian karena kecintaan yang dalam dari orang tua kepadanya, sehingga mau menuruti keinginan anaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 80",
    "description": "Dan adapun anak yang aku bunuh itu adalah putra dari kedua orang tua mukmin yang kuat dan teguh imannya, dan kami khawatir kalau dia akan memaksa kedua orang tuanya kepada kesesatan dan kekafiran, lalu keduanya tidak kuasa menolak paksaan anaknya itu karena besarnya kasih sayang mereka kepadanya. 81. Dengan membunuhnya, maka kami, yaitu Allah dan aku dengan berbekal petunjuk dari nya, menghendaki kiranya tuhan mereka, dengan kehendak dan takdir-Nya, menggantinya dengan anak lain yang lebih baik sifat, perilaku, dan kesuciannya daripada anak yang telah aku bunuh itu dan lebih sayang kepada ibu bapaknya. '."
  }
]