[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka kami ingin agar Allah memberikan ganti bagi orangtuanya dengan anak yang lebih baik daripada anak tersebut dalam keshalihan, agama dan baktinya kepada mereka berdua,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Kemudian kami ingin agar Allah menggantikan untuk keduanya dengan seorang anak laki-laki yang lebih baik darinya dari segi agama, kesalehan, jauh dari dosa, serta lebih dicintai dan disayangi oleh kedua orangtuanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. فَأَرَدْنَآ أَن يُبْدِلَهُمَا رَبُّهُمَا خَيْرًا مِّنْهُ (Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka dengan anak lain dari anaknya itu) Yakni kami berharap Allah akan mengaruniakan kepada keduanya anak yang lebih baik daripada anak ini. زَكَوٰةً (yang lebih baik kesuciannya) Yakni suci agamanya, kesalihannya, dan suci dari dosa-dosa. وَأَقْرَبَ رُحْمًا (dan lebih dalam kasih sayangnya) Yakni lebih mengasihi kedua orangtuanya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "79-82 1 ). Mutharrif bin Abdullah berkata tentang ayat ini : { وَأَمَّا ٱلْغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } \"Dan adapun anak muda itu, maka keduanya adalah orang-orang mukmin, dan kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran\" : sesungguhnya kami mengetahui bahwa kedua ayah-ibunya begitu bahagia pada hari kelahiran anaknya, dan begitu bersedih tatkala mengatahui anaknya dibunuh, namun jika ia tetap hidup ditakutkan kebinasaan akan berpihak kepada ayah-ibunya, maka hendaklah setiap orang menerima segala ketentuan yang telah diporsikan oleh Allah untuknya; karena sesungguhnya ketetapan Allah itu lebih baik dari apa dikehendaki oleh hamba-Nya, dan ketetapan Allah untuk dirimu namun kamu membencinya itu lebih baik daripada apa yang kamu sukai. 2 ). Faidah yang dapat diambil dari firman Allah : { فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } bahwa musibah kematian seorang anak hakikatnya adalah musibah yang biasa, sekalipun mereka benar-benar dari darah daging sendiri, dan barangsiapa yang berserah diri kepada ketetapan sang pencipta niscaya kesedihannya akan segera pulih. 3 ). Perhatikan perbedaan ucapan Khidr tatkala ia menenggelamkan kapal : { فَأَرَدتُّ أَنْ أَعِيبَهَا } \"dan aku bertujuan merusakkan bahtera itu\" dan ketika membunuh seorang anak beliau berkata : { فَأَرَدْنَآ أَن يُبْدِلَهُمَا رَبُّهُمَا } \"Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka\" dan ketika mendirikan bangunan yang rusak beliau mengatakan : { فَأَرَادَ رَبُّكَ أَن يَبْلُغَآ أَشُدَّهُمَا } \"maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya\" pertanyaannya kenapa Khidr mengganti penisbatan pelaku disetiap kejadian itu? tatkala ia bermaksud kepada kerusakan kapal mengatakan : \"dan aku bertujuan\"; ia menisbatkan pengrusakan kepada dirinya sendiri tidak kepada Allah sebagai adab kepada-Nya, dan tatkala pembunuhan seorang anak ia berkata : \"Dan kami menghendaki\" dengan konteks jamak; mengingatkan bahwa perbuatan itu merupakan perintah Allah sendiri, dan pastinya ada hikmah dibaliknya, dan ketika bermaksud kepada kemaslahatan dua anak yatim ia menisbatkan kepada Allah \"maka Tuhanmu menghendaki\" ia menisbatkan kenikmatan kepada Allah. 4 ). Firman Allah : { وَكَانَ أَبُوهُمَا صَٰلِحًا } \"sedang ayahnya adalah seorang yang saleh\" terdapat beberapa faidah, diantaranya : bahwasanya seorang hamba yang shalih senantiasa dijaga oleh Allah dari dirinya sendiri sampai kepada keturunannya dan orang-orang yang selalu bersama dengannya, faidah lainnya adalah bahwasanya membantu orang-orang shalih untuk kemaslahatan mereka lebih utama daripada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Kami menghendaki, supaya Allah mengganti bagi mereka dengan anak lain yang lebih baik kesalehan, agama dan bersih dari maksiat dari anaknya itu dan lebih dalam kasih sayangnya kepada ibu bapaknya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka kami menghendaki bahwa Tuhan mereka menggantinya dengan yang lebih baik kesuciannya} kebaikan, agama dan kesuciannya dari dosa {daripada anak itu dan lebih sayang} lebih sayang dan baik kepada kedua orang tuanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. Pembunuhan tersebut, meskipun mengandung tindakan buruk kepada mereka berdua dan pemutusan keturunan mereka berdua, namun sesungguhnya Allah akan menganugerahinya keturunan yang lebih baik daripada si anak itu. Oleh karena itu, (Khidhir) berkata, “Lalu kami menghendaki, supaya Rabb mereka mengganti bagi mereka dengan anak lain yang lebih baik kesuciannya daripada anak itu dan lebih dalam kasih sayangnya (kepada ibu bapaknya),” yaitu anak yang shalih, suci dan menghormati hubungan dengan orang tuanya. Sesungguhnya anak kecil yang dibunuh tersebut, sekiranya dia dewasa nanti, niscaya dia akan durhaka kepada keduanya dan memaksa mereka kepada kekufuran dan kesesatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 81: Yakni anak yang saleh, bersih, dan berbakti kepada kedua orang tuanya. Berbeda dengan anak sebelumnya yang jika dibiarkan hingga dewasa, maka anak itu akan durhaka kepada kedua orang tuanya, bahkan akan membuat orang tuanya sesat dan kafir."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 81",
    "description": "Dengan membunuhnya, maka kami, yaitu Allah dan aku dengan berbekal petunjuk dari nya, menghendaki kiranya tuhan mereka, dengan kehendak dan takdir-Nya, menggantinya dengan anak lain yang lebih baik sifat, perilaku, dan kesuciannya daripada anak yang telah aku bunuh itu dan lebih sayang kepada ibu bapaknya. ' 82. Dan adapun dinding rumah yang aku tegakkan tanpa meminta upah itu sebetulnya adalah milik dua anak yatim di kota itu. Di bawahnya tersimpan harta bagi mereka berdua, peninggalan kedua orang tua mereka. Bila tidak aku tegakkan, lalu dinding itu roboh, aku khawatir harta itu diketahui keberadaannya dan diambil oleh orang yang tidak berhak. Dan ketahuilah bahwa ayahnya adalah seorang yang saleh yang menyimpan hartanya untuk kedua anaknya. Maka tuhanmu menghendaki harta itu tetap terjaga di tempat penyimpanannya agar keduanya sampai dewasa dan keduanya mengeluarkan simpanannya itu untuk bekal kehidupan mereka. Itu semua adalah sebagai rahmat dari tuhanmu bagi kedua anak yatim itu. Apa saja yang kuperbuat, seperti halnya yang kaulihat, bukan-lah menurut keinginan dan kemauanku sendiri, melainkan atas perintah Allah. Itulah makna dan keterangan dari perbuatan-perbuatan yang engkau tidak dapat sabar terhadapnya. ' kesalehan orang tua, seperti yang dicontohkan dalam ayat ini, pasti akan dibalas oleh Allah. Salah satu bentuk balasan Allah adalah memberi anugerah kepada anak keturunannya."
  }
]