[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun dinding rumah yang aku luruskan kemiringannya sehingga berdiri tegak, sesungguhnya milik dua anak yatim yang berada di kampung dimana dinding itu berada. Dan di bawahnya terdapat simpanan harta bagi mereka berdua berupa emas dan perak. Ayah mereka adalah orang shalih. maka tuhanmu menghendaki agar mereka mencapai masa kedewasaan mereka, memiliki kekuatan dan dapat mengeluarkan simpanan harta tersebut, sebagai rahmat dari tuhanmu terhadap mereka berdua. Dan tidaklah aku, wahai musa, melakukan semua yang engkau lihat aku melakukannya menurut kehendakku dan kemauanku pribadi. akan tetapi aku melakukannya sesuai perintah Allah. Hal-hal yang aku terangkan kepadamu latar belakangnya merupakan kesudahan perkara-perkara tersebut yang engkau tidak mampu bersabar untuk tidak menanyakannya dan mengingkariku terhadapnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Adapun dinding rumah yang aku perbaiki, dan yang engkau ingkari perbaikannya, maka ia adalah milik dua anak kecil di kota yang kita datangi, dan ayah mereka sudah wafat, sedangkan di bawah dinding itu terdapat harta peninggalan ayah mereka untuk mereka berdua. Ayahnya mereka dahulu adalah orang saleh, maka Tuhanmu -wahai Musa- menghendaki agar keduanya mencapai usia dewasa dan besar, dan mengeluarkan harta mereka yang tersimpan di bawah dinding tersebut, sebab apabila dinding tersebut roboh niscaya harta yang tersimpan tersebut akan terlihat dan kemungkinan akan hilang. Sungguh pengaturan ini merupakan rahmat dari Tuhanmu atas mereka, dan apa yang kuperbuat bukanlah atas kehendakku sendiri. Itulah keterangan dan maksud perbuatan-perbuatanku yang engkau tidak sanggup bersabar terhadapnya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Dan dinding yang aku tegakkan tanpa meminta upah itu adalah milik dua anak yatim yang ada di negeri tersebut, di bawah dinding itu terkubur harta berupa emas. Dan ayah dari dua anak yatim tersebut adalah orang yang shalih, sehingga dengan hal ini Tuhanmu menghendaki kedua anak itu mengcapai usia dewasa dan mengeluarkan harta yang ada di bawah dinding itu. Aku tidak melakukan perbuatan-perbuatan tersebut sesuai pendapatku, namun itu merupakan ilham dari Allah. Itulah tafsir yang agung dari perbuatan-perbuatan yang membuatmu tidak dapat bersabar untuk bertanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَأَمَّا الْجِدَارُ (Adapun dinding rumah itu) Yakni dinding yang dia perbaiki. فَكَانَ لِغُلٰمَيْنِ يَتِيمَيْنِ فِى الْمَدِينَةِ(adalah kepunyaan dua orang anak yatim di negeri tersebut) Yakni negeri yang telah disebutkan sebelumnya. وَكَانَ تَحْتَهُۥ كَنزٌ لَّهُمَا(dan di bawahnya ada harta benda simpanan bagi mereka berdua) Yakni harta yang banyak. Makna (الكنز) yakni harta yang terpendam dalam tanah. وَكَانَ أَبُوهُمَا صٰلِحًا (sedang ayahnya adalah seorang yang saleh) Dan keshalihan ayahnya menjadi sebab terjaganya kedua anaknya beserta harta keduanya. فَأَرَادَ رَبُّكَ أَن يَبْلُغَآ أَشُدَّهُمَا (maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya) Yakni sampai mereka telah tumbuh sempurna. وَيَسْتَخْرِجَا كَنزَهُمَا(dan mengeluarkan simpanannya itu) Mengeluarkannya dari bawah dinding tersebut, jika saja dinding itu roboh maka harta di bawahnya pasti akan keluar. رَحْمَةً مِّن رَّبِّكَ ۚ( sebagai rahmat dari Tuhanmu) Yakni pengaturan yang demikian adalah dari Allah bagi kedua anak tersebut berkat keshalihan ayah mereka. وَمَا فَعَلْتُهُۥ عَنْ أَمْرِى ۚ( dan bukanlah aku melakukannya itu menurut kemauanku sendiri) Yakni bukan dari ijtihad dan pendapatku. ذٰلِكَ تَأْوِيلُ مَا لَمْ تَسْطِع عَّلَيْهِ صَبْرًا(Demikian itu adalah tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya) Yakni itulah penjelasan dari apa yang menyempitkan kesabaranmu dan tidak dapat membuatmu tidak mengingkarinya. Ibnu Abbas meriwayatkan dari Ubay bin Ka’ab, ia berkata: Rasulullah bersabda: “Semoga Allah mencurahkan rahmat-Nya kepada kita dan kepada Nabi Musa, andai saja ia bersabar niscaya Allah akan menceritakan kepada kita tentang Khidhir, namun sayang Nabi Musa ketika itu mengatakan “Jika aku bertanya kepadamu tentang sesuatu sesudah ini maka janganlah kamu memperbolehkan aku menyertaimu”.”"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "79-82 1 ). Mutharrif bin Abdullah berkata tentang ayat ini : { وَأَمَّا ٱلْغُلَٰمُ فَكَانَ أَبَوَاهُ مُؤْمِنَيْنِ فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } \"Dan adapun anak muda itu, maka keduanya adalah orang-orang mukmin, dan kami khawatir bahwa dia akan mendorong kedua orang tuanya itu kepada kesesatan dan kekafiran\" : sesungguhnya kami mengetahui bahwa kedua ayah-ibunya begitu bahagia pada hari kelahiran anaknya, dan begitu bersedih tatkala mengatahui anaknya dibunuh, namun jika ia tetap hidup ditakutkan kebinasaan akan berpihak kepada ayah-ibunya, maka hendaklah setiap orang menerima segala ketentuan yang telah diporsikan oleh Allah untuknya; karena sesungguhnya ketetapan Allah itu lebih baik dari apa dikehendaki oleh hamba-Nya, dan ketetapan Allah untuk dirimu namun kamu membencinya itu lebih baik daripada apa yang kamu sukai. 2 ). Faidah yang dapat diambil dari firman Allah : { فَخَشِينَآ أَن يُرْهِقَهُمَا طُغْيَٰنًا وَكُفْرًا } bahwa musibah kematian seorang anak hakikatnya adalah musibah yang biasa, sekalipun mereka benar-benar dari darah daging sendiri, dan barangsiapa yang berserah diri kepada ketetapan sang pencipta niscaya kesedihannya akan segera pulih. 3 ). Perhatikan perbedaan ucapan Khidr tatkala ia menenggelamkan kapal : { فَأَرَدتُّ أَنْ أَعِيبَهَا } \"dan aku bertujuan merusakkan bahtera itu\" dan ketika membunuh seorang anak beliau berkata : { فَأَرَدْنَآ أَن يُبْدِلَهُمَا رَبُّهُمَا } \"Dan kami menghendaki, supaya Tuhan mereka mengganti bagi mereka\" dan ketika mendirikan bangunan yang rusak beliau mengatakan : { فَأَرَادَ رَبُّكَ أَن يَبْلُغَآ أَشُدَّهُمَا } \"maka Tuhanmu menghendaki agar supaya mereka sampai kepada kedewasaannya\" pertanyaannya kenapa Khidr mengganti penisbatan pelaku disetiap kejadian itu? tatkala ia bermaksud kepada kerusakan kapal mengatakan : \"dan aku bertujuan\"; ia menisbatkan pengrusakan kepada dirinya sendiri tidak kepada Allah sebagai adab kepada-Nya, dan tatkala pembunuhan seorang anak ia berkata : \"Dan kami menghendaki\" dengan konteks jamak; mengingatkan bahwa perbuatan itu merupakan perintah Allah sendiri, dan pastinya ada hikmah dibaliknya, dan ketika bermaksud kepada kemaslahatan dua anak yatim ia menisbatkan kepada Allah \"maka Tuhanmu menghendaki\" ia menisbatkan kenikmatan kepada Allah. 4 ). Firman Allah : { وَكَانَ أَبُوهُمَا صَٰلِحًا } \"sedang ayahnya adalah seorang yang saleh\" terdapat beberapa faidah, diantaranya : bahwasanya seorang hamba yang shalih senantiasa dijaga oleh Allah dari dirinya sendiri sampai kepada keturunannya dan orang-orang yang selalu bersama dengannya, faidah lainnya adalah bahwasanya membantu orang-orang shalih untuk kemaslahatan mereka lebih utama daripada orang lain."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Adapun dinding rumah yang aku perbaiki adalah milik dua orang anak yatim di kota itu. Di bawahnya ada harta benda emas simpanan bagi mereka berdua. Ayah mereka berdua adalah seorang yang saleh dan bertakwa. Sehingga aku memperbaiki dinding itu untuk menjaga harta orang tuanya. Maka Tuhanmu menghendaki agar ketika mereka dewasa mereka akan mengeluarkan simpanan itu, ini semua sebagai rahmat dari Tuhanmu sebab kesalehan ayah mereka. Aku tidak melakukan perbuatan itu menurut kemauanku sendiri, namun atas dasar ilham dari Allah Demikian itu adalah penjelasan atas perbuatan-perbuatan yang tidak dapat kamu sabari dan diami\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun dinding itu adalah milik dua anak yatim di kota itu dan di bawahnya tersimpan harta milik mereka berdua, sedangkan ayah mereka adalah orang shalih. Maka Tuhanmu menghendaki agar keduanya mencapai usia dewasa} dewasa dan kuat {dan mengeluarkan simpanannya itu sebagai rahmat dari Tuhanmu. Aku tidak melakukan itu karena kemauanku} pilihan dan kemauanku, tapi aku melakukannya dengan perintah Allah {Itulah makna} uraian {sesuatu yang kamu tidak mampu} tidak mampu {bersabar terhadapnya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. “Adapun dinding rumah itu,” yang aku bangun “maka ia adalah kepunyaan dua orang anak yatim di kota itu, dan di bawahnya ada harta benda simpanan bagi mereka berdua, sedang ayahnya adalah seorang yang shalih,” maksudnya, kondisi mereka berdua menuntut adanya rasa iba dan rahmat kepada mereka, sebab keduanya masih kecil. Kedua orang tua mereka sudah tiada. Maka Allah memelihara mereka berdua juga lantaran keshalihan kedua orang tua mereka. “Maka Rabbmu menghendaki agar supaya mereka sampai kepada kedewasaannya dan mengeluarkan simpanan itu,” karena itu, aku hancurkan dindingnya dan aku gali harta simpanan yang berada di bawah dan selanjutnya aku letakkan dan aku (bangun) kembali dengan Cuma-Cuma. “Sebagai rahmat dari Rabbmu,” maksudnya tindakan yang aku lakukan adalah sebagai bentuk kasih sayang dari Allah yang Allah berikan melalui hambaNya, Khidhir. “dan bukanlah aku melakukan itu menurut kemauanku sendiri,” maksudnya, aku tidak mengerjakan sesuatu menurut kehendak pribadiku dan murni keinginanku. Sesungguhnya itu hanyalah rahmat dari Allah dan perintahNya. “Demikian itu,” keterangan yang aku jelaskan kepadamu “adalah tujuan perbuatan-perbuatan yang kamu tidak dapat sabar terhadapnya,”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 82: Keadaan kedua anak yatim tersebut perlu diperhatikan, karena telah ditinggal wafat bapaknya ketika masih kecil. Allah menjaga keduanya karena kesalehan bapaknya. Yaitu melubangi perahu, membunuh anak muda, dan menegakkan kembali dinding yang hampir roboh. Bahkan ilham dari Allah Subhaanahu wa Ta'aala. Dalam kisah Musa dan Khadhir terdapat beberapa pelajaran, di antaranya: - Keutamaan ilmu, - Keutamaan mengadakan perjalanan untuk menuntut ilmu. Hal itu, karena Nabi Musa ‘alaihis salam lebih memilih mengadakan perjalanan panjang untuk mencari ilmu meninggalkan (sementara) mengajar dan membimbing Bani Israil. - Mendahulukan perkara yang terpenting di antara sekian yang penting. Nabi Musa ‘alaihis salam di samping mengajar, Beliau menyempatkan diri untuk belajar. Hal itu, karena air dalam sebuah teko, jika terus dituang, maka akan habis sehingga perlu diisi. - Bolehnya mengangkat pelayan baik ketika tidak safar maupun safar untuk memenuhi kebutuhannya. - Bepergian untuk mencari ilmu atau berjihad dsb. jika maslahat menghendaki untuk diberitahukan tujuannya dan kemana tujuannya, maka hal itu lebih sempurna daripada disembunyikan. Hal ini berdasarkan perkataan Nabi Musa ‘alaihis salam, \"Aku tidak akan berhenti (berjalan) sebelum sampai ke pertemuan dua laut; atau aku akan berjalan (terus sampai) bertahun-tahun.” Demikian pula sebagaimana Nabi Muhammad shallallahu 'alaihi wa sallam memberitahukan para sahabat ketika hendak pergi ke Tabuk padahal biasanya Beliau menyembunyikan. Oleh karena itu, dalam masalah ini dilihat maslahatnya. - Dihubungkannya keburukan dan sebab-sebabnya kepada setan karena godaan dan penghiasannya, meskipun semua terjadi dengan qadha’ Allah dan qadar-Nya. - Bolehnya seseorang memberitahukan keadaan dirinya yang menjadi tabi’at manusia, seperti lelah, lapar, haus, dsb. selama tidak menunjukkan marah-marah atau kesal dan kenyataannya memang demikian. - Dianjurkan memilih pelayan orang yang pandai dan cekatan agar urusan yang diinginkannya menjadi sempurna. - Dianjurkan seseorang memberikan makanan kepada pelayannya dengan makanan yang biasa dimakannya dan makan secara bersama-sama. - Pertolongan akan turun kepada seorang hamba sejauh mana ia menjalankan perintah Allah, dan bahwa orang yang mengikuti perintah Allah akan diberikan pertolongan tidak seperti selainnya. - Hendaknya seseorang memiliki sopan santun kepada guru dan berbicara kepadanya dengan perkataan yang halus. Perkataan Nabi Musa ‘alaihis salam, \"Bolehkah aku mengikutimu agar engkau mengajarkan kepadaku ilmu yang benar yang telah diajarkan kepadamu (untuk menjadi) petunjuk?\" seperti meminta pendapat, dan hal ini menunjukkan kelembutannya. Berbeda dengan orang-orang yang keras dan sombong, yang tidak menampakkan rasa butuh kepada ilmu gurunya. - Tawadhu’nya orang yang utama untuk belajar kepada orang yang berada di bawahnya. - Belajarnya seorang alim terhadap ilmu yang tidak dimilikinya kepada orang yang memilikinya, meskipun orang tersebut di bawah jauh derajatnya darinya. Oleh karena itu, tidak patut bagi seorang ahli fiqh dan ahli hadits jika ia kurang dalam ilmu nahwunya atau sharfnya atau ilmu lainnya tidak mau belajar kepada orang yang mengerti tentangnya, meskipun orang itu bukan ahli hadits atau ahli fiqh. - Penisbatan ilmu dan kelebihan lainnya kepada Allah Subhaanahu wa Ta'aala, mengakui bahwa ilmu atau kelebihannya itu berasal dari Allah. Hal ini berdasarkan kata-kata Nabi Musa ‘alaihis salam, ”Agar engkau mengajarkan kepadaku ilmu yang benar yang telah diajarkan kepadamu.” - Ilmu yang bermanfaat adalah ilmu yang membimbing kepada kebaikan. Oleh karena itu, setiap ilmu yang di sana terdapat petunjuk kepada jalan-jalan kebaikan, memperingatkan jalan-jalan keburukan, atau sarana yang bisa mengarah kepadanya, maka ilmu tersebut termasuk ilmu yang bermanfaat. - Orang yang tidak kuat bersabar untuk tetap bersama seorang guru, maka kehilangan banyak ilmu sesuai ketidaksabarannya. - Sebab untuk bisa bersabar terhadap sesuatu adalah ketika seseorang mengetahui tujuan, faedah, buahnya dan hasilnya dari sesuatu itu. - Perintah agar seseorang tidak tergesa-gesa menghukumi sesuatu sampai mengerti maksud dan tujuannya. - Menyertakan kalimat “Insya Allah” terhadap perbuatan-perbuatan hamba di masa datang. - Seorang guru apabila melihat ada maslahatnya menyuruh murid agar tidak bertanya tentang sesuatu sampai guru tersebutlah yang nanti akan memberitahukan jawaban, maka bisa dilakukan. Misalnya karena guru melihat, bahwa pemahaman si murid masih sedikit atau khawatir akalnya tidak sampai atau karena ada masalah lain yang lebih penting untuk dipelajari olehnya. - Orang yang lupa tidaklah dihukum, baik terkait dengan hak Allah maupun hak manusia. - Sepatutnya seseorang mengambil sikap memaafkan ketika bergaul dengan manusia, dan tidak sepatutnya ia membebani mereka dengan beban yang tidak disanggupinya. - Perkara-perkara dihukumi sesuai zahirnya, dan bahwa hukum-hukum duniawi dikaitkan dengannya, baik dalam hal harta, darah maupun lainnya. Hal itu, karena Nabi Musa ‘alaihis salam mengingkari Khadhir ketika melubangi perahu dan membunuh anak, di mana hal ini zahirnya adalah perkara munkar. - Tidak mengapa melakukan keburukan yang ringan agar keburukan yang besar dapat disingkirkan, dan memperhatikan maslahat yang lebih besar dengan meninggalkan maslahat yang ringan. Membunuh anak merupakan keburukan, akan tetapi membiarkannya sehingga mengakibatkan ibu bapaknya kafir maka lebih buruk lagi. - Perbuatan yang dilakukan seseorang pada harta orang lain untuk maslahat orang lain itu dan menyingkirkan mafsadat adalah dibolehkan meskipun tanpa izinnya meskipun terkadang perlu merusak sedikit harta orang lain. - Bekerja boleh di laut, sebagaimana boleh pula di daratan. - Membunuh merupakan dosa yang besar. - Membunuh karena qishas bukan merupakan kemungkaran. - Hamba yang saleh, Allah jaga dirinya dan keturunannya. - Melayani orang yang saleh adalah amalan utama. - Memiliki adab terhadap Allah dalam menggunakan lafaz. Khadhir misalnya, ia menisbatkan kepada dirinya ketika melubangi perahu, adapun terhadap perbuatan baik, maka ia menisbatkannya kepada Allah. - Seorang sahabat hendaknya menemani sahabatnya yang lain, tidak berpisah dan meninggalkannya sehingga ia mengemukakan alasan. - Sepakatnya kawan yang satu dengan yang lain dalam masalah yang tidak terlarang merupakan sebab kuatnya persahabatan. - Perbuatan yang dilakukan Khadhir adalah taqdir Allah Subhaanahu wa Ta'aala semata yang Allah jalankan melalui tangan Khadhir untuk menunjukkan kepada manusia betapa lembutnya keputusan-Nya, dan bahwa Dia menaqdirkan untuk hamba perkara-perkara yang tidak disukainya, namun di sana terdapat kebaikan untuk agamanya atau dunianya. Hal ini juga agar mereka ridha dengan qadha’ dan qadar-Nya (lihat Tafsir As Sa’diy)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 82",
    "description": "82. Dan adapun dinding rumah yang aku tegakkan tanpa meminta upah itu sebetulnya adalah milik dua anak yatim di kota itu. Di bawahnya tersimpan harta bagi mereka berdua, peninggalan kedua orang tua mereka. Bila tidak aku tegakkan, lalu dinding itu roboh, aku khawatir harta itu diketahui keberadaannya dan diambil oleh orang yang tidak berhak. Dan ketahuilah bahwa ayahnya adalah seorang yang saleh yang menyimpan hartanya untuk kedua anaknya. Maka tuhanmu menghendaki harta itu tetap terjaga di tempat penyimpanannya agar keduanya sampai dewasa dan keduanya mengeluarkan simpanannya itu untuk bekal kehidupan mereka. Itu semua adalah sebagai rahmat dari tuhanmu bagi kedua anak yatim itu. Apa saja yang kuperbuat, seperti halnya yang kaulihat, bukan-lah menurut keinginan dan kemauanku sendiri, melainkan atas perintah Allah. Itulah makna dan keterangan dari perbuatan-perbuatan yang engkau tidak dapat sabar terhadapnya. ' kesalehan orang tua, seperti yang dicontohkan dalam ayat ini, pasti akan dibalas oleh Allah. Salah satu bentuk balasan Allah adalah memberi anugerah kepada anak keturunannya. 83. Usai menjelaskan kisah perjalanan nabi musa dalam rangka mencari ilmu kepada seorang hamba yang saleh, pada ayat-ayat berikut Allah menceritakan kisah perjalanan jihad zulkarnain. Cerita itu dikisahkan untuk menjawab pertanyaan kaum kafir mekah kepada nabi Muhammad. Wahai nabi Muhammad, mereka bertanya kepadamu tentang jati diri zulkarnain. Katakanlah kepada mereka, 'dengan izin Allah, akan kubacakan kepadamu kisahnya agar kamu dapat memperoleh pelajaran darinya. '."
  }
]