[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang musyrik dari kaummu (wahai rasul) akan bertanya kepadamu mengenai Dzulqarnain, seorang raja yang shalih. katakanlah kepada mereka, ”aku akan ceritakan kepada kalain kisahnya yang akan kalian ingat dan kalian ambil pelajaran darinya. ’"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. \"Dan orang-orang musyrik dan kaum Yahudi bertanya kepadamu tentang berita Zulkarnain -wahai Rasul-, untuk menguji kebenaranmu. Maka katakanlah, \"Akan kuberitahukan kepada kalian beberapa berita tentangnya agar kalian bisa mengambil pelajaran dan peringatan.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Hai Rasulullah, Orang-orang musyrik bertanya kepadamu tentang kisah Dzulkarnain, seorang pemimpin yang shalih. Katakanlah kepada mereka: “Aku akan membacakan kepadamu kisah-kisah yang telah Allah ajarkan kepadaku, agar kalian dapat mengambil pelajaran darinya.” Seseorang bertanya kepada Ali bin Abi Thalib tentang Dzulkarnain, bagaimana dia dapat sampai di timur dan barat? Dia menjawab: “Subhanallah, telah ditundukkan baginya awan, dimudahkan baginya cara, dan dibentangkan baginya cahaya.” Kemudian Ali bertanya: “Bagaimana, perlu aku Perjelas lagi?” Maka lelaki itu diam, sehingga Ali juga diam. (al-Mukhtarah 2/32 no. 409, pentahqiqnya menshahihkan riwayat ini. Tafsir as-Shahih 4/166)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. وَيَسْـَٔلُونَكَ عَن ذِى الْقَرْنَيْنِ ۖ (Mereka akan bertanya kepadamu (Muhammad) tentang Dzulkarnain) Orang-orang yang bertanya tersebut adalah orang-orang Yahudi. Adapun tentang Dzulkarnain, terdapat pendapat mengatakan dia adalah Iskandar (Alexander) bin Philips al-Yunany, orang yang membangun kota Iskandariyah. Namun pendapat ini bermasalah sebab Iskandar adalah orang kafir dan salah seorang murid dari Ariestoteles. Pendapat lain mengatakan dia adalah Abu Karb al-Himyary. Dan pendapat lain mengatakan ia adalah seorang malaikat. Dinamakan sebagai Dzulkarnain karena ia telah mencapai tempat terbitnya matahari di sebelah timur dan tempat tenggelamnya di sebelah barat. قُلْ سَأَتْلُوا۟ عَلَيْكُم مِّنْهُ ذِكْرًا(Katakanlah: “Aku akan bacakan kepadamu cerita tantangnya”) Yakni dengan wahyu yang akan aku bacakan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). { قُلْ سَأَتْلُوا۟ عَلَيْكُم مِّنْهُ ذِكْرًا } \"Katakanlah: \"Aku akan bacakan kepadamu cerita tentangnya\" Jawaban kepada orang-orang Quraisy tatkala mereka bertanya tentang dzul Qornain, Rasulullah menjawab dengan pentunjuk tuhannya : bahwasanya beliau akan menjawab dengan jawaban yang dibutuhkan saja, yang memberikan dampak positif dan pelajaran penting, tanpa berbasa-basi dan menyelam ke dalam kata-kata yang tidak berfaedah, maka apakah hal ini disadari oleh para da'i tatkala mereka menyampaikan sesuatu namun keluar dari judul? 2 ). Membatasi ucapan pada hal-hal yang bermanfaat adalah bagian daripada manhaj qur'ani, begitulah yang disampaikan oleh Rasulullah kepada orang yang bertanya tenang dzul qornain padahal beliau diberikan oleh Allah pengetahuan tentang itu yang lebih luas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Mereka akan bertanya kepadamu wahai Nabi, tentang kisah penguasa dunia dan segala isinya yaitu raja Dzulkarnain. Mereka yang bertanya adalah orang-orang Yahudi. Katakanlah: \"Aku akan bacakan kepadamu cerita tantangnya dari Al-quran yang Allah turunkan\". Disebut dzul qarnain adalah orang yang telah mencapai ujung barat dan timur dunia"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu tentang Dzulqarnain} Dzulqarnain adalah seorang hamba yang shalih yang dijadikan raja oleh Allah di bumi, diberi pengetahuan dan hikmah, sehingga kekuasaannya mencapai bagian timur dan barat {Katakanlah,“Akan aku membacakan kepada kalian sebagian kisahnya”} beritanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Orang-orang Ahli KItab atau kaum musyrikin bertanya kepada Rasulullah tentang kisah Dzulqarnain. Maka Allah memerintahkan beliau untuk berkata, “Aku akan bacakan kepadamu cerita tentangnya” di dalam kisah ini, terdapat berita yang bermanfaat dan arah pembicaraan yang menakjubkan. Maksudnya, aku akan menceritakan kepada kalian tentang sifat-sifatnya yang bisa menjadi bahan perenungan dan pelajaran. Adapun keadaan-keadaan selain itu, maka beliau tidak membacakan (ceritanya) kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 83: Yakni orang-orang musyrik dan Ahli Kitab. Namanya adalah Iskandar, ia seorang raja, namun bukan seorang nabi. Yakni kisahnya yang dapat diambil pelajaran, adapun selain dari itu, maka tidak diceritakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 83",
    "description": "Usai menjelaskan kisah perjalanan nabi musa dalam rangka mencari ilmu kepada seorang hamba yang saleh, pada ayat-ayat berikut Allah menceritakan kisah perjalanan jihad zulkarnain. Cerita itu dikisahkan untuk menjawab pertanyaan kaum kafir mekah kepada nabi Muhammad. Wahai nabi Muhammad, mereka bertanya kepadamu tentang jati diri zulkarnain. Katakanlah kepada mereka, 'dengan izin Allah, akan kubacakan kepadamu kisahnya agar kamu dapat memperoleh pelajaran darinya. '83. Usai menjelaskan kisah perjalanan nabi musa dalam rangka mencari ilmu kepada seorang hamba yang saleh, pada ayat-ayat berikut Allah menceritakan kisah perjalanan jihad zulkarnain. 1 cerita itu dikisahkan untuk menjawab pertanyaan kaum kafir mekah kepada nabi Muhammad. ' 83. '84"
  }
]