[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami telah memberinya kekuasaan di muka bumi dan Kami telah memberikan kepadanya berbagai cara dan jalan dari segala sesuatu yang dia tempuh untuk mencapai apa saja yang dikehendakinya, berupa penaklukan berbagai kota dan mengalahkan musuh-musuh dan tujuan-tujuan lainnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Sungguh Kami telah memberikannya kedudukan di bumi, dan Kami telah memberikan padanya jalan yang bisa membuatnya mencapai semua yang ia inginkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84-86. Dengan keagungan dan kuasa Kami, Kami mudahkan bagi Dzulkarnain agar dapat menempuh jalan-jalan di muka bumi dan mengalahkan raja-rajanya; dan Kami beri dia ilmu yang dia perlukan untuk mencapai tujuannya, dan dia menggunakan cara-caranya dan berjalan ke arah barat hingga sampai di barat dan melihat matahari tenggelam di mata air yang panas -sesuai dengan penglihatan mata yang terbatas-, dan di sana dia mendapati kaum yang kafir. Maka Kami perintahkan Dzulkarnain, antara dia memerangi dan membunuh mereka atau menyeru mereka kepada keimanan dengan cara yang baik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. إِنَّا مَكَّنَّا لَهُۥ فِى الْأَرْضِ (Sesungguhnya Kami telah memberi kekuasaan kepadanya di (muka) bumi) Yakni dengan Kami mudahkan jalan untuk itu sehingga dia dapat pergi kemanapun dan dengan cara apapun yang dia inginkan. وَءَاتَيْنٰهُ مِن كُلِّ شَىْءٍ (dan Kami telah memberikan kepadanya (untuk mencapai) segala sesuatu) Yakni segala sesuatu yang ia inginkan. سَبَبًا (jalan) Yakni jalan yang mengntarkannya kepada apa yang dia inginkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Sesungguhnya Kami telah memberi kekuasaan kepadanya di muka bumi dan kekuasaan untuk mengelolanya. Kami telah memberikan kepadanya jalan untuk mencapai segala sesuatu, Baik itu berupa ilmu, pengetahuan, bangunan dan lainnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kami telah memberi kedudukan kepadanya di bumi dan Kami telah memberinya} Kami telah memberinya {jalan dari segala sesuatu} jalan berupa ilmu, kekuasaan dan alat yang dia gunakan untuk mencapai tujuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. “Sesungguhnya Kami telah memberi kekuasaan kepadanya di (muka) bumi,” maksudnya Allah menjadikannya raja dan memudahkannya untuk menerobos penjuru-penjuru bumi dan memudahkan tunduknya mereka kepadanya. “Dan Kami telah memberikan kepadanya jalan (untuk mencapai) segala sesuatu,” maksudnya Allah memberinya sebab kausalitas yang dapat mengantarkan dirinya kepada apa yang telah dicapai, untuk dipergunakan melumpuhkan negeri-negeri dan memudahkannya masuk ke wilayah-wilayah yang jauh, dan dia telah beramal dengan sebab-sebab yang Allah berikan kepadanya. Maknanya, dia mempergunakan fasilitas-fasilitas tersebut sebagaimana mestinya. Tidak setiap orang yang mempunyai sebab kausalitas mampu menjalankannya, dan tidak setiap orang sanggup memperoleh sebab kausalitas. Bila sudah terpadukan antara kesanggupan memperoleh sebab kausalitas yang hakiki dan menjalankannya, niscaya terwujudlah tujuan. Bila keduanya tidak ada atau salah satunya (tidak terpenuhi), maka tujuannya tidak terealisasikan. Sebab kausalitas yang Allah berikan kepadanya, tidak diberitahukan oleh Allah dan RasulNya kepada kita, dan riwayat-riwayat pun tidak banyak menyinggungnya dalam bentuk yang mengarah kepada keyakinan. Oleh karena itu, tidak ada kelonggaran yang bisa kita lakukan selain diam saja tentang persoalan tersebut, tidak menoleh kepada riwayat-riwayat israiliyyat yang dikutip oleh para pembawa riwayat dan kisah semacamnya. Tetapi, kita sudah mengetahui secara global bahwa ia adalah sebab kausalitaas yang kuat, variatif, bersifat internal atau eksternal. Dengan itu, ia mempunyai pasukan besar yang berjumlah banyak dan bersenjatakan memadai serta penuh keteraturan. Dengan itu pula, dia mampu menumbangkan msuuh-musuh, memudahkan perjalanan menuju belahan bumi bagian timur dan barat serta penjuru-penjuru dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 84: Allah Ta'ala memberikan kerajaan kepadanya dan membuatnya mampu mendatangi berbagai penjuru dunia. Yakni Allah Subhaanahu wa Ta'aala memberikan kepadanya sebab-sebab untuk mencapai maksudnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 84",
    "description": "Sungguh, kami telah memberi kedudukan yang tinggi dan kekuasaan yang besar kepadanya di bumi, dan kami telah memberikan pula jalan kepadanya untuk meraih segala sesuatu yang dia perlukan guna mewujudkan harapannya. 85. Zulkarnain ingin memperluas wilayah kekuasaannya, maka untuk mewujudkannya dia pun menempuh suatu jalan dengan menggunakan cara yang telah kami ajarkan kepadanya."
  }
]