[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dia lalu menempuh cara-cara dan jalan-jalan tersebut dengan mengerahkan usaha dan sungguh-sungguh."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Maka ia menggunakan segala pemberian Kami berupa sarana dan jalan untuk mencapai keinginannya, lalu ia pun menempuh jalan ke arah barat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. فَأَتْبَعَ سَبَبًا (maka diapun menempuh suatu jalan) Yakni jalan yang mengantarkannya ke tempat terbenamnya matahari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Maka diapun menempuh suatu jalan dengan arah barat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka dia menyusuri suatu jalan} maka dia ingin mencapai daerah barat, lalu dia mengambil jalan untuk mencapainya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84-85. “Sesungguhnya Kami telah memberi kekuasaan kepadanya di (muka) bumi,” maksudnya Allah menjadikannya raja dan memudahkannya untuk menerobos penjuru-penjuru bumi dan memudahkan tunduknya mereka kepadanya. “Dan Kami telah memberikan kepadanya jalan (untuk mencapai) segala sesuatu,” maksudnya Allah memberinya sebab kausalitas yang dapat mengantarkan dirinya kepada apa yang telah dicapai, untuk dipergunakan melumpuhkan negeri-negeri dan memudahkannya masuk ke wilayah-wilayah yang jauh, dan dia telah beramal dengan sebab-sebab yang Allah berikan kepadanya. Maknanya, dia mempergunakan fasilitas-fasilitas tersebut sebagaimana mestinya. Tidak setiap orang yang mempunyai sebab kausalitas mampu menjalankannya, dan tidak setiap orang sanggup memperoleh sebab kausalitas. Bila sudah terpadukan antara kesanggupan memperoleh sebab kausalitas yang hakiki dan menjalankannya, niscaya terwujudlah tujuan. Bila keduanya tidak ada atau salah satunya (tidak terpenuhi), maka tujuannya tidak terealisasikan. Sebab kausalitas yang Allah berikan kepadanya, tidak diberitahukan oleh Allah dan RasulNya kepada kita, dan riwayat-riwayat pun tidak banyak menyinggungnya dalam bentuk yang mengarah kepada keyakinan. Oleh karena itu, tidak ada kelonggaran yang bisa kita lakukan selain diam saja tentang persoalan tersebut, tidak menoleh kepada riwayat-riwayat israiliyyat yang dikutip oleh para pembawa riwayat dan kisah semacamnya. Tetapi, kita sudah mengetahui secara global bahwa ia adalah sebab kausalitaas yang kuat, variatif, bersifat internal atau eksternal. Dengan itu, ia mempunyai pasukan besar yang berjumlah banyak dan bersenjatakan memadai serta penuh keteraturan. Dengan itu pula, dia mampu menumbangkan msuuh-musuh, memudahkan perjalanan menuju belahan bumi bagian timur dan barat serta penjuru-penjuru dunia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 85: Yakni jalan menuju arah barat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 85",
    "description": "Zulkarnain ingin memperluas wilayah kekuasaannya, maka untuk mewujudkannya dia pun menempuh suatu jalan dengan menggunakan cara yang telah kami ajarkan kepadanya. 86. Zulkarnain melanjutkan perjalanannya hingga ketika dia telah sampai di suatu tempat yang sangat jauh di wilayah barat, yaitu lokasi matahari terbenam, dia melihatnya terbenam di dalam laut yang berlumpur hitam, dan di wilayah sana ditemukannya suatu kaum yang kafir dan durhaka. Kami berfirman kepadanya, 'wahai zulkarnain! engkau boleh menghukum mereka karena kedurhakaan mereka, atau kamu boleh berbuat kebaikan kepada mereka dengan mengajak mereka beriman dan berbuat kebajikan sehingga mereka menyadari kesesatan mereka dari jalan Allah. '."
  }
]