[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hingga Dzulqarnain telah sampai ke tempat terbenamnya matahari, dia mendapatinya dalam jangkauan pandangan matanya seolah-olah terbenam pada mata air yang amat panas yang berlumpur hitam. Dan dia mendapati di tempat matahari terbenam satu kaum dari manusia, kami berkata, ”wahai dzulqarnain, kamu boleh menyiksa mereka dengan membunuh mereka atau tindakan lainnya bila mereka tidak mengakui keesaan Allah, atau berbuat baik kepada mereka dengan mengajarkan hidayah kepada mereka dan menunjukan kepada mereka jalan yang lurus.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Ia lalu berjalan di muka bumi, hingga ketika ia telah sampai pada penghujung bumi dari arah terbenamnya matahari, ia melihat matahari itu terbenam di dalam lautan luas yang panas dan berlumpur hitam. Dan di tempat terbenam matahari itu ia menjumpai kaum yang kafir, maka Kami berfirman kepadanya agar ia memilih, \"Wahai Zulkarnain, engkau boleh menghukum mereka dengan hukuman bunuh atau lainnya, atau engkau boleh berbuat baik (dengan berdakwah) kepada mereka.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. حَتَّىٰٓ إِذَا بَلَغَ مَغْرِبَ الشَّمْسِ (Hingga apabila dia telah sampai ketempat terbenam matahari) Yakni sampai di ujung barat bumi. وَجَدَهَا تَغْرُبُ فِى عَيْنٍ حَمِئَةٍ(dia melihat matahari terbenam di dalam laut yang berlumpur hitam) Yakni sampai di tempat yang memiliki banyak lumpur hitam. Pendapat lain mengatakan, bisa jadi ketika Dzulkarnain sampai di tepi Samudra dia melihat Samudra itu seperti lumpur hitam. وَوَجَدَ عِندَهَا(dan dia mendapati di situ) Yakni di tempat terbanamnya matahari tersebut. قَوْمًا ۗ (segolongan umat) Mereka adalah orang-orang kafir. إِمَّآ أَن تُعَذِّبَ وَإِمَّآ أَن تَتَّخِذَ فِيهِمْ حُسْنًا (kamu boleh menyiksa atau boleh berbuat kebaikan terhadap mereka) Yakni kamu boleh menyiksa dengan membunuh mereka begitu saja, dan boleh juga dengan berbaik hati kepada mereka dengan menyeru mereka kepada kebenaran dan mengajari mereka syari’at."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Hingga apabila dia telah sampai pada tempat terbenam matahari, dan negeri paling ujung barat, dia melihat matahari terbenam di dalam laut yang berlumpur hitam. Itu terjadi karena mata yang melihat terlalu jauh. Di situ dia mendapati segolongan kaum yang kafir. Kami ilhamkan kepadanya: \"Hai Dzulkarnain, serulah mereka kepada kebenaran dan iman, serta syariat dan muamalah mereka. Engkau boleh menggunakan cara memerangi atau boleh juga berbuat kebaikan terhadap mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sehingga ketika telah sampai ke tempat terbenamnya matahari} ujung bumi bagian barat {dia mendapatinya terbenam di dalam mata air} mata air yang mengalirkan air {panas lagi berlumpur hitam} panas lagi berlumpur hitam {Di sana dia menemukan suatu kaum. Kami berfirman,“Wahai Dzulqarnain, kamu boleh menghukum atau berbuat kebaikan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. Maka Allah memberikan kepadanya Sesuatu untuk sampai ke “tempat terbenamnya matahari,” hingga melihat matahari dalam jangkauan pandang mata, seolah-olah ia “terbenam di dalam laut yang berlumpur hitam,” maksudnya yang berwarna hitam. Ini sudah menjadi pemandangan biasa bagi orang yang antara tempatnya dan garis ufuk matahari bagian barat terpisahkan oleh air. Menyaksikannya terbenam di atas , meskipun matahari sebenarnya sangat tinggi “dan dia mendapati di situ,” yaitu di tempat terbenamnya matahari “segolongan umat. Kami berkata, ‘Hai Dzulqarnain, kamu boleh menyiksa atau boleh menyiksa atau boleh berbuat kebaikan terhadap mereka’ ,” maksudnya, (kamu boleh berbuat apa saja) baik dengan cara menyiksa mereka dengan pembunuhan, pukulan, penahanan, atau cara lainnya, dan boleh juga dengan cara berbuat baik kepada mereka. Jadi, ia dihadapkan pada dua pilihan. Karena, tampaknya mereka itu orang-orang kafir, orang-orang fasik atau terdapat gejala semacam itu pada mereka. Sebab, bila mereka itu kaum Mukminin yang tidak berbuat kefasikan, niscaya tidak diperbolehkan baginya untuk menyiksa mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 86: Maksudnya, sampai ke pantai sebelah barat, di mana Dzulqarnain melihat matahari sedang terbenam. Seperti membunuh, menawan, memukul, dsb. Yaitu dengan menyeru mereka beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 86",
    "description": "Zulkarnain melanjutkan perjalanannya hingga ketika dia telah sampai di suatu tempat yang sangat jauh di wilayah barat, yaitu lokasi matahari terbenam, dia melihatnya terbenam di dalam laut yang berlumpur hitam, dan di wilayah sana ditemukannya suatu kaum yang kafir dan durhaka. Kami berfirman kepadanya, 'wahai zulkarnain! engkau boleh menghukum mereka karena kedurhakaan mereka, atau kamu boleh berbuat kebaikan kepada mereka dengan mengajak mereka beriman dan berbuat kebajikan sehingga mereka menyadari kesesatan mereka dari jalan Allah. '87. Dia, yakni zulkarnain, berkata, 'siapa saja yang berbuat zalim dan tetap kafir, kami akan menghukumnya dengan hukuman duniawi, kemudian saat kematian menjemputnya, dia akan dikembalikan kepada tuhannya, kemudian di kala itu tuhan akan mengazabnya dengan azab yang sangat keras sebagai balasan atas kedurhakaan dan keingkarannya."
  }
]