[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dzulqarnian berkata, ”adapaun orang yang menganiaya dirinya dari mereka hingga kafir kepada tuhannya, maka kami akan menyiksanya di dunia dan dia akan kembali kepada tuhannya, hingga tuhannya menyiksanya dengan siksaan yang besar di neraka jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Zulkarnain berkata, \"Barangsiapa yang berbuat syirik kepada Allah dan terus-menerus melakukannya setelah kami mengajaknya untuk menyembah Allah semata, maka kami akan menghukumnya di dunia ini dengan hukuman bunuh, dan pada hari Kiamat kelak ia akan kembali kepada Tuhannya, lalu Dia mengazabnya dengan azab yang sangat keras."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87-88. Dzulkarnain menjawab: “Orang yang menzalimi dirinya sendiri dengan tetap di atas kekafiran maka kami akan membunuhnya, sehingga dia akan dibangkitkan kepada Tuhannya dan diazab dengan azab yang sangat pedih yang tidak ada tandingannya; adapun orang yang beriman kepada Allah dan menjalankan ketaatan-Nya, maka baginya surga di akhirat dan dia akan dimudahkan dalam menjalankan kewajiban serta dia akan diperlakukan dengan baik di dunia.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. قَالَ (Berkata Dzulkarnain) Dzulkarnain berkata. أَمَّا مَن ظَلَمَ(Adapun orang yang aniaya) Yakni orang yang menganiaya dirinya sendiri dengan terus menerus dalam kesyirikan dan tidak menerima seruanku. فَسَوْفَ نُعَذِّبُهُۥ(maka kami kelak akan mengazabnya) Dengan membunuhnya di dunia. ثُمَّ يُرَدُّ إِلَىٰ رَبِّهِۦ(kemudian dia kembalikan kepada Tuhannya) Di akhirat. فَيُعَذِّبُهُۥ(lalu Tuhan mengazabnya) Di akhirat tersebut. عَذَابًا نُّكْرًا(dengan azab yang tidak ada taranya) Azab yang menghinakannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "87-88 Saat ayat menyebut orang musyrik ia memulai memulai dengan siksaannya, kemudian memujia azab Allah, dan ketika menyebut orang beriman ayat memulia dengan ampunan Allah, kemudian muamalah-Nya untuk mereka yang baik, karena bagi orang beriman adalah surga dari-Nya, sedangkan untuk orang kafir adalah azab di dunia kemudian azab di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Setelah memilih jalan dakwah yang baik, Dzulkarnain berkata : \"Adapun orang yang aniaya terhadap orang kafir, maka kami kelak akan membunuh mereka di dunia, kemudian dia kembalikan kepada Tuhannya di akhirat, lalu Tuhan mengazabnya dengan azab yang tidak ada taranya di neraka, yang belum pernah ada"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Adapun orang yang berbuat zalim} melanjutkan kekufuran dan kemusyrikannya terhadap tuhannya {akan kami hukum} akan kami hukum {Lalu dia akan dikembalikan kepada Tuhannya. Kemudian Dia mengazabnya dengan azab yang sangat keras} dahsyat dan mengerikan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Dzulqarnain mempunyai strategi syar’I yang menjadikannya pantas menerima sanjungan dan pujian, karena curahan taufik Allah kepadanya. Ia berkata, “Aku akan membagi menjadi dua bagian, “adapun orang yang berbuat aniaya,” dengan kekufuran, “maka kami kelak akan mengazabnya, kemudian dia dikembalikan kepada Rabbnya, lalu DIa mengazabnya dengan azab yang tidak ada taranya,” maksudnya, dia ditimpa dua hukuman, hukuman dunia dan hukuman akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 87: Dzulkarnain mengetahui siyasat (politik) yang syar’i berkat taufiq dari Allah kepadanya, oleh karenanya dia berkata seperti di atas. Yakni berbuat syirk. Yakni membunuhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 87",
    "description": "Dia, yakni zulkarnain, berkata, 'siapa saja yang berbuat zalim dan tetap kafir, kami akan menghukumnya dengan hukuman duniawi, kemudian saat kematian menjemputnya, dia akan dikembalikan kepada tuhannya, kemudian di kala itu tuhan akan mengazabnya dengan azab yang sangat keras sebagai balasan atas kedurhakaan dan keingkarannya. 88. Adapun orang yang beriman dan membuktikan keimanannya dengan mengerjakan kebajikan, maka dia akan mendapat pahala yang terbaik sebagai balasan atas apa yang telah diperbuatnya, dan selanjutnya akan kami sampaikan kepadanya, yaitu orang-orang beriman, perintah kami yang mudah-Mudah dan tidak memberatkannya. '."
  }
]