[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian dzulqarnain kembali ke arah timur dengan mengikuti kemudahan-kemudahan yang sudah Allah berikan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "89. Kemudian dia menempuh jalan lain menuju arah terbitnya matahari."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "89-90. Kemudian Dzulkarnain kembali ke arah timur dengan menggunakan cara-cara yang telah Allah mudahkan baginya; hingga ketika dia telah sampai di tempat terbitnya matahari, dia mendapatinya terbit menyinari kaum yang tidak memiliki bangunan yang melindungi mereka atau pepohonan yang menaungi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "89. ثُمَّ أَتْبَعَ سَبَبًا (Kemudian dia menempuh jalan (yang lain)) Yakni jalan yang bukan jalan yang sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "89. Kemudian dia menempuh jalan yang lain lagi yaitu arah timur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia mengikuti suatu jalan} Kemudian dia melewati suatu jalan lalu berjalan dari arah terbenamnya matahari menuju arah terbitnya matahari"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "89. Maksudnya, ketika sampai di tempat terbenamnya matahari, maka dia berputar balik menuju tempat terbitnya, melacak sebab kausalitas yang sudah Allah berikan kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 89: Yakni ke arah timur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 89",
    "description": "Zulkarnain berhasil menaklukkan barat. Kemudian, untuk memperluas kekuasaannya, dia dengan cara yang sama menempuh suatu jalan yang mengarahkannya ke belahan dunia yang lain, ke arah timur. 90. Zulkarnain melanjutkan perjalanan hingga suatu ketika dia sampai di kawasan timur, yaitu tempat terbit matahari. Di daerah itu didapatinya matahari bersinar di atas suatu kaum yang tidak kami buatkan suatu pelindung bagi mereka dari terik dan panasnya cahaya matahari itu."
  }
]