[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Janganlah engaku (wahai rasul), menyangka bahwa sesungguhnya kisah para penghuni gua itu dan batu pualam yang tertulis di atasnya nama-nama mereka termasuk tanda-tanda Kami yang menakjubkan lagi aneh. sebab, penciptaan langit dan bumi dan segala isinya lebih menakjubkan dari kisah itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Dan jangan sekali-kali engkau menyangka -wahai Rasul- bahwa kisah para penghuni gua, dan batu bersurat yang tertulis padanya nama-nama mereka merupakan mukjizat dan tanda-tanda kebesaran Kami yang sangat menakjubkan, akan tetapi mukjizat lainnya lebih menakjubkan dari itu seperti penciptaan langit dan bumi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Hai Nabi, apakah kamu mengira kisah para penghuni gua yang ada di gunung dari para penduduk lembah Raqim hanya sesuatu yang menakjubkan? Sungguh ayat-ayat Kami lebih menakjubkan lagi!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. أَمْ حَسِبْتَ أَنَّ أَصْحٰبَ الْكَهْفِ وَالرَّقِيمِ كَانُوا۟ مِنْ ءَايٰتِنَا عَجَبًا (Atau kamu mengira bahwa orang-orang yang mendiami gua dan (yang mempunyai) raqim itu, mereka termasuk tanda-tanda kekuasaan Kami yang mengherankan?) Yakni wahai Muhammad apakah kamu mengira hanya mereka ayat-ayat Kami yang menakjubkan? Janganlah kamu mengira demikian, sebab seluruh ayat-ayat Kami menakjubkan, dan ada yang lebih menakjubkan dari cerita mereka. Kata (الرقيم) adalah nama dari sebuah lembah atau negeri, atau papan yang tertulis diatasnya nama-nama mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Namun apakah kamu mengira wahai Nabi bahwa Ashabul Kahfi orang-orang yang berada dalam gua di atas gunung dan dinding batunya yang tertulis nama-namanya. Mereka termasuk tanda-tanda kekuasaan Kami yang menakjubkan? Ayat dan kisah ashabul kahfi ini turun ketika kaum Qurays bertanya kepada Nabi tentang tiga hal, diantaranya tentang menghadapi orang Yahudi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu mengira} apakah kamu mengira {bahwa sesungguhnya para penghuni gua dan raqīm} kitab yang di dalamnya berisi ajaran agama Isa AS {benar-benar merupakan keajaiban di antara tanda-tanda Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Istifham (kata Tanya) ini ditujukan untuk peniadaan dan larangan. Maksudnya, jangan kamu menyangka bahwa kisah Ashhabul Kahfi (penghuni gua) dan persitiwa yang terjadi pada mereka adalah perkara yang aneh pada tanda-tanda kekuasaan Allah dan perkara yang mengagumkan pada hikmahNya. (Jangan menyangka) tidak ada kisah yang sepadan dengannya dan peristiwa yang serupa dengannya. Bahkan, Allah itu memiliki tanda-tanda kekuasaanNYa yang menakjubkan nan aneh yang sangat banyak yang selevel tanda-tanda kekuasaanNYa pada Ashabul Kahfi, bahkan lebih besar darinya. Allah senantiasa memperlihatkan kepada para hamba tanda-tanda kekuasaanNya di langit, bahkan pada diri mereka sendiri yang menyebabkan kebenaran menjadi jelas dari kebatilan, (menjadi jelas pula) petunjuk dibandingkan kesesatan. Penafian ini tidak ditujukan bahwa kisah Ashabul Kahfi ini termasuk perkara yang menakjubkan. Justru, kisah ini termasuk salah satu tanda kekuasaan Allah yang membuat decak kagum. Akan tetapi, maksud peniadaan ini adalah bahwa peristiwa semacam itu sangat banyak. Terpaku dengan kisah ini saja dalam kekaguman dan keterbellalakan merupakan cermin kedangkalan ilmu dan akal. Justru, tugas seorang Mukmin adalah merenungi seluruh tanda-tanda kekuasaanNYa, yang Allah mengajak para hambaNya agar merenunginya. Karena perenungan terhadap tanda kekuasaan Allah merupakan kunci keimanan, jalan menuju ilmy dan keyakinan. Mereka dikaitkan kepada kata al-kahfi yang berarti gua yang berada di gunung. “Yang mempunyai raqim,” yaitu kitab yang di dalamnya telah tertulis nama-nama dan kisah-kisah mereka, adalah karena mereka terus bersamanya dalam masa yang sangat lama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 9: Raqim, menurut sebagian ahli tafsir adalah nama anjing, dan sebagian yang lain mengartikan batu bertulis, yang di sana tertulis nama dan nasab mereka. Tidak ayat-ayat-Nya yang lain. Bahkan ayat-ayat-Nya yang lain pun sama menakjubkan pula, oleh karena itu perlu diperhatikan dan dipikirkan, karena memperhatikan ayat-ayat-Nya merupakan kunci keimanan, jalan mencapai ilmu dan keyakinan. Allah Subhaanahu wa Ta'aala senantiasa memperlihatkan kepada hamba-hamba-Nya ayat-ayat-Nya di alam semesta dan pada diri mereka agar semakin jelas antara yang hak dengan yang batil, dan petunjuk daripada kesesatan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 9",
    "description": "Apakah engkau mengira bahwa ashha'bul-kahfi, yaitu orang-orang yang mendiami gua, dan yang mempunyai ar-raqim itu, yaitu nama anjing mereka atau tulisan-tulisan yang memuat nama-nama mereka termasuk tanda-tanda kebesaran kami yang menakjubkan' ya, memang ashha'bulkahf dan ar-raqim adalah menakjubkan, tetapi janganlah engkau mengira bahwa itu satu-satunya tanda kebesaran kami yang menakjubkan. Sesungguhnya banyak sekali tanda-tanda kebesaran kami yang sangat menakjubkan. Penciptaan langit dan bumi dan segala sesuatu yang berada di antara keduanya adalah tanda kekuasaan kami yang sangat menakjubkan apabila engkau memperhatikannya. Ingatlah ketika pemuda-pemuda itu berlindung ke dalam gua, meninggalkan negerinya karena menjaga iman dan tauhidnya dari penindasan penguasa negerinya, lalu mereka berdoa, ya tuhan kami. Berikanlah rahmat kepada kami dari sisi-Mu, lindungilah kami dari orang-orang yang memfitnah kami, dan sempurnakanlah petunjuk yang lurus yang dapat mengantarkan kepada keselamatan dan kebahagiaan bagi kami dalam urusan kami, baik urusan duniawi maupun ukhrawi."
  }
]