[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hingga apabila dia telah sampai ke tempat terbitnya matahari, dia mendapati matahari terbit menyinari suatu kaum yang tidak memiliki bangunan yang menutupi mereka dan tidak ada pepohonan yang menaungi mereka dari matahari."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Dia terus berjalan hingga ketika sampai pada tempat terbitnya matahari, ia mendapati matahari tersebut terbit bersinar pada kaum yang tidak Kami buatkan suatu pelindung bagi mereka dari cahayanya berupa rumah, dan pepohonan yang teduh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. حَتَّىٰٓ إِذَا بَلَغَ مَطْلِعَ الشَّمْسِ (Hingga apabila dia telah sampai ke tempat terbit matahari) Yakni tempat terbitnya matahari pertama kali pada permukaan bumi. وَجَدَهَا تَطْلُعُ عَلَىٰ قَوْمٍ لَّمْ نَجْعَل لَّهُم مِّن دُونِهَا سِتْرًا (dia mendapati matahari itu menyinari segolongan umat yang Kami tidak menjadikan bagi mereka sesuatu yang melindunginya dari (cahaya) matahari itu) Mereka tidak memiliki rumah dan pakaian, mereka tidak beralas kaki dan tidak berbusana serta tidak memiliki bangunan tempat tinggal. Atau maknanya adalah tidak ada yang menghalangi antara mereka dan matahari kecuali lautan. Dan disebutkan juga bisa jadi Dzulkarnain sampai di bagian bumi yang kadang disinari matahari selama sepuluh hari terus menerus tanpa tenggelam, yakni yang ada di kutub selatan bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Hingga apabila dia telah sampai ke tempat terbit matahari yaitu sebelah timur, yaitu negeri di ujung timur dia mendapati matahari itu menyinari segolongan umat yang tidak Kami anugerahkan bagi mereka sesuatu apapun yang dapet melindunginya mereka dari cahaya matahari itu, tidak ada apapun baik banguan atau baju yang melindungi mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sehingga ketika sampai di tempat terbitnya matahari} ujung bumi bagian timur {dia mendapatinya terbit pada suatu kaum yang tidak Kami buatkan suatu pelindung} tabir berupa bangunan ataupun pepohonan {bagi mereka dari matahari itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. Ia pun sampai di tempat terbitnya matahari dan “dia mendapat matahari itu menyinari segolongan umat yang Kami tidak menjadikan bagi mereka sesuatu yang melindunginya dari (cahaya) matahari itu,” maksudnya dia menyaksikan matahari terbit menyinari segolongan manusia yang tidak mempunyai pelindung dari (pancaran sinar) matahari, baik lantaran mereka yang bertolak dari ketidakteraturan, keterasingan dan keprimitifan mereka. Atau karena matahari selalu bersinar di tengah mereka, tidak pernah terbenam [dari pandangan mereka] dalam bentuk yang berarti, seperti yang dijumpai di daerah Afrika Tenggara. Lalu dia telah mencapai tempat yang pengetahuan penghuni bumi tidak dapat menjangkaunya, apalagi sampai dapat memasukinya dengan raga-raga mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 90: Mereka ini adalah orang-orang negro. Seperti pakaian atau atap karena liarnya hidup mereka dan karena tanah mereka tidak dapat didirikan bangunan di atasnya, namun mereka mempunyai terowongan yang mereka bersembunyi di sana ketika matahari terbit dan menampakkan diri ketika matahari meninggi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 90",
    "description": "Zulkarnain melanjutkan perjalanan hingga suatu ketika dia sampai di kawasan timur, yaitu tempat terbit matahari. Di daerah itu didapatinya matahari bersinar di atas suatu kaum yang tidak kami buatkan suatu pelindung bagi mereka dari terik dan panasnya cahaya matahari itu. 91. Demikianlah kisah perjalanan zulkarnain dan semua perilakunya, baik ketika dia menuju ke barat maupun timur. Dan sesungguhnya kami mengetahui segala sesuatu yang ada padanya dan diperbuatnya."
  }
]