[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian dzulqarnain berjalan dengan menempuh cara-cara dan jalan-jalan yang telah kami berikan kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "92. Kemudian ia menempuh jalan lain selain dua jalan sebelumnya, menuju arah antara timur dan barat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "92-94. Kemudian Dzulkarnain menuju tempat didirikannya benteng dengan mengikuti jalan yang telah dimudahkan Allah baginya, hingga dia sampai pada dua gunung tinggi yang menghalangi tempat dibelakangnya. Di sana dia mendapati kaum yang hampir tidak dapat memahami perkataan Dzulkarnain dan para pengikutnya. Mereka meminta pertolongan kepada Dzulkarnain: “Ya’juj dan Ma’juj -keduanya adalah dua kabilah besar dari golongan manusia- membuat kerusakan di muka bumi dengan membunuh dan merampas harta, bagaimana jika kami mengumpulkan harta kami sebagai upah bagimu untuk membuatkan kami benteng yang menghalangi kami dari mereka?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "92. ثُمَّ أَتْبَعَ سَبَبًا (Kemudian dia menempuh suatu jalan (yang lain lagi)) Yakni jalan ketiga yang membentang antara timur dan barat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92. Kemudian dia menempuh suatu jalan yang lain lagi, antara barat dan timur yaitu selatan dan utara"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian dia mengikuti suatu jalan} Kemudian dia melintasi jalan ketiga yang berbeda dengan arah timur dan barat, dia mengambil jalan dari selatan menuju ke utara"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92-93. “Kemudian dia menempuh suatu jalan (yang lain lagi). Hingga apabila dia telah sampai di antara dua buah gunung.” Para ulama tafsir berkata, “Ia pergi dari arah timur menuju utara. Maka, ia sampai di tempat antara dua gunung, yang dahulu begitu terkenal di masa itu, dua gunung yang menjadi bagian rangkaian pegunungan yang saling berhubungan, dari kiri ke kanan, sampai terhubung dengan lautan, antara Ya’juj dan Ma’juj dengan manusia ‘dan dia mendapati’, di hadapan kedua gunung itu ‘suatu kaum yang hampir tidak mengerti pembicaraann,’ lantaran keasingan bahasa mereka dan ketumpulan daya pikir dan hati mereka.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 92: Yakni dari timur menuju utara."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 92",
    "description": "Setelah berhasil menguasai kawasan timur, zulkarnain melanjutkan perjalanannya. Kemudian dia menempuh suatu jalan menuju daerah yang lain lagi. 93. Zulkarnain melanjutkan perjalanan hingga ketika dia sampai di suatu daerah di antara dua gunung tinggi dan terjal hingga sulit dilalui, didapatinya di belakang kedua gunung itu suatu kaum yang hampir tidak memahami pembicaraan zulkarnain karena perbedaan bahasa mereka."
  }
]