[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka berkata, ”wahai dzulqarnain, sesunggguhnya ya’juj dan ma’juj (mereka adalah dua umat yang besar dari bani adam) melakukan kerusakan di muka bumi dengan merusak tanaman dan keturunan. apakah boleh kami menyerahkan imbalan bagimu dan kami kumpulkan harta benda kami supaya kamu mau membuatkan dinding pemisah antara kami dengan mereka?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Mereka berkata, \"Wahai Zulkarnain! Sesungguhnya Yakjuj dan Makjuj (yaitu dua umat besar dari keturunan Adam) berbuat kerusakan di muka bumi dengan melakukan banyak pembunuhan dan kerusakan lainnya, maka bolehkah Kami membayarmu dengan harta benda kami sebagai imbalan agar engkau membuatkan dinding penghalang antara kami dan mereka?\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. قَالُوا۟ يٰذَا الْقَرْنَيْنِ إِنَّ يَأْجُوجَ وَمَأْجُوجَ مُفْسِدُونَ فِى الْأَرْضِ (Mereka berkata: “Hai Dzulkarnain, sesungguhnya Ya’juj dan Ma’juj itu orang-orang yang membuat kerusakan di muka bumi) Ya’juj dan Ma’juj adalah dua kabilah dari golongan manusia. Terdapat pendapat mengatakan mereka berasal dari Turki. Ada suatu pendapat menyatakan kerusakan yang mereka perbuat adalah berupa kezaliman, penipuan, pembunuhan, dan kerusakan-kerusakan yang lain. فَهَلْ نَجْعَلُ لَكَ خَرْجًا(maka dapatkah kami memberikan sesuatu pembayaran kepadamu) Yakni sejumlah harta yang akan kami bayarkan kepadamu. عَلَىٰٓ أَن تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا(supaya kamu membuat dinding antara kami dan mereka?”) Yakni pembatas yang menjadi penghalang antara kami dengan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ عَلَىٰٓ أَن تَجْعَلَ بَيْنَنَا وَبَيْنَهُمْ سَدًّا } \"supaya kamu membuat dinding antara kami dan mereka\" ayat ini sebagai dalil agar penjara dibuatkan untuk orang-orang yang berbuat kerusakan, sehingga menghalangi mereka untuk berinteraksi dengan siapapun sesuka mereka, mereka dikurung sampai mereka menyadari kerusakan yang telah diperbuat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Mereka berkata: \"Hai Dzulkarnain (mereka memahami ucapan dengan diterjemahkan), sesungguhnya kabilah Altatur dan Mongol yang menempati tempat bagian utara dari benua Asia, mereka membuat kerusakan di muka bumi dengan mengekspansi, membunuh, merusak tanaman dan merampas harta. Maka dapatkah kami memberikan suatu upah/bayaran kepadamu, supaya kamu membuat dinding antara kami dan mereka?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Wahai Dzulqarnain, sesungguhnya Ya’juj dan Ma’juj} dua umat dari anak cucu Adam yang sangat besar, jumlahnya banyak itu sudah ada sekarang {adalah pembuat kerusakan di bumi, dapatkah kami memberimu imbalan} imbalan dari harta kami {agar kamu membuatkan tembok penghalang antara kami dan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. Sungguh, Allah telah memberikan sebab kausalitas ilmiah bagi Dzulqarnain yang menyebabkannya sanggup memahami bahasa mereka dan memaklumi kondisi mereka, hingga Dzulqarnain bisa berkomunikasi dengan mereka, dan mereka pun dapat menjalin komunikasi dengannya. Mereka pun menyampaikan keluhan tentang gangguan dari Ya’juj Ma’juj. Mereka berdua adalah dua bangsa besar dari kalangan Bani Adam. Mereka berkata, “Sesungguhnya Ya’juj dan Ma’juj itu orang-orang yang membuat kerusakan di muka bumi,” dengan tindakan pembunuhan, merampas harta (orang lain) dan tindakan buruk lainnya “maka dapatkah kami memberikan sesuatu pembayaran kepadamu,” hadiah timbal balik “supaya kamu membuat dinding antara kami dan mereka.” Ini menunjukkan bahwa mereka tidak mampu membuat dinding sendiri dan mengetahui kemampuan Dzulqarnain. Maka mereka menyodorkan bayaran agar dia membuatnya disertai menyampaikan kepadanya tentang alasan yang mendorong mereka (meminta pertolongan), yaitu kerusakan yang ditimbulkan oleh kaum Ya’juj dan Ma’juj di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 94: Ya'juj dan Ma'juj adalah dua bangsa yang membuat kerusakan di muka bumi, sebagaimana yang telah dilakukan oleh bangsa Tartar dan Mongol. Mereka keturunan Yafits anak Nabi Nuh ‘alaihis salam. Seperti melakukan pembunuhan dan perampasan ketika keluar ke tengah-tengah manusia yang lain. Hal ini menunjukkan bahwa mereka tidak mampu membangun sendiri dinding tersebut dan mereka mengetahui kemampuan Dzulkarnain. Oleh karena itu, mereka siap memberikan upah kepada Dzulkarnain dan menyebutkan alasannya, yaitu karena Ya’juj dan Ma’juj melakukan kerusakan di bumi. Akan tetapi, Dzulkarnain adalah raja yang mukmin lagi saleh, beliau tidak tamak kepada dunia dan tidak tinggal diam membiarkan keadaan rakyatnya, bahkan tujuan beliau adalah memperbaikinya, oleh karenanya beliau mau memenuhi permintaan mereka karena ada maslahatnya, tidak meminta upah dan bersyukur kepada Allah Tuhannya yang telah memberikan kemampuan kepadanya, beliau berkata, “(Dinding) ini adalah rahmat dari Tuhanku,” (lihat ayat 98)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 94",
    "description": "Di hadapan zulkarnain, mereka berkata melalui penerjemah, 'wahai zulkarnain! sungguh saat ini kami terancam oleh suatu kaum yang bernama yakjuj dan makjuj. Keduanya itu selalu melakukan penindasan dan berbuat kerusakan di bumi. Untuk menghindarkan kami dari kekejaman mereka, maka bolehkah kami membayarmu dengan sejumlah harta sebagai imbalan agar engkau membuatkan dinding yang kuat sebagai penghalang antara kami dan mereka' kami ingin lepas dari penindasan dan kekejaman mereka. '95. Mendengar tawaran umat yang terancam itu, dia, yaitu zulkarnain yang bijaksana itu, kemudian berkata, 'apa yang telah dianugerahkan tuhan kepadaku yang meliputi kekuasaan, keluasan wilayah, dan kekayaan harta benda lebih baik daripada imbalanmu yang kau tawarkan kepadaku, maka sebagai gantinya bantulah aku dengan seluruh kekuatan yang ada, agar aku dapat membuatkan dinding yang kuat sebagai penghalang antara kamu dan mereka, sehingga kamu semua akan merasa aman karena terhindar dari serangan mereka."
  }
]