[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dzulqurnain menjawab, ”apa yang dikaruniakan tuhanku kepadaku berupa kerajaan dan kekuasaan adalah lebih baik bagiku dari harta benda kalian. maka tolonglah aku dengan kekuatan kalian, agar aku dapat membuatkan dinding antara kalian dengan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Zulkarnain berkata, \"Apa yang telah dikaruniakan Tuhanku kepadaku berupa kerajaan dan kekuasaan sungguh lebih baik daripada imbalan harta yang kalian janjikan padaku. Bantulah aku dengan mengerahkan kaum laki-laki dan menyediakan peralatan agar aku bisa membuatkan dinding penghalang antara kalian dan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "95-97. Dzulkarnain menyetujui permintaan mereka seraya berkata: “Kerajaan dan kejayaan yang telah Allah berikan kepadaku lebih baik daripada yang akan kalian berikan kepadaku; maka bantulah aku dengan kekuatan kalian untuk membuat benteng yang kokoh yang dapat menjadi penghalang antara kalian dengan Ya’juj dan Ma’juj.” Lalu Dzulkarnain meminta mereka potongan-potongan besi untuk diletakkan di tempat itu, hingga ketika besi itu telah menutupi ruang antara dua gunung tersebut dan menyamai ketinggiannya, dia memerintahkan mereka untuk menyalakan api di sana agar besi itu dapat menyatu satu sama lain dan menutup ruang antara dua gunung. Kemudian dia meminta potongan-potongan tembaga, yang kemudian dia lelehkan dan dia tuangkan di atas besi yang telah dipanaskan tersebut sehingga semakin menyatu. Benteng itu kemudian menjadi gunung yang kokoh dan licin sehingga kabilah Ya’juj dan Ma’juj tidak dapat menaiki benteng tersebut karena sangat tinggi dan licin, dan juga tidak dapat melubanginya kerena sangat kokoh dan tebal."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. قَالَ مَا مَكَّنِّى فِيهِ رَبِّى (Dzulkarnain berkata: “Apa yang telah dikuasakan oleh Tuhanku kepadaku terhadapnya) Yakni kemampuan yang Allah berikan kepadaku. خَيْرٌ (adalah lebih baik) Lebih baik dari harta kalian. فَأَعِينُونِى بِقُوَّةٍ (maka tolonglah aku dengan kekuatan) Yakni bantulah aku dengan para lelaki yang siap bekerja. Atau bantulah aku dengan peralatan untuk membangun. أَجْعَلْ بَيْنَكُمْ وَبَيْنَهُمْ رَدْمًا (agar aku membuatkan dinding antara kamu dan mereka) Makna (الردم) adalah dindiing pembatas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Dzulkarnain berkata: \"Apa yang telah dikuasakan oleh Tuhanku kepadaku sudah lebih baik, maka tolonglah aku dengan kekuatan alat-alat dan manusia, agar aku membuatkan dinding antara kamu dan mereka, yang lebih besar dan kokoh dari pada benteng, yaitu benteng/pagar yang dibangun dari batu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Dzulqarnain berkata kepada mereka {“Apa yang telah dikuasakan kepadaku oleh Tuhanku} Apa yang dilapangkan oleh Tuhanku kepadaku berupa kekuatan dan kekuasaan {lebih baik. Maka bantulah aku dengan kekuatan} dengan laki-laki dan alat untuk membangun {agar aku dapat membuatkan antara kamu dan mereka suatu tembok penghalang} penghalang yang melindungi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. Dzulqarnain bukan tipe orang yang rakus dan gandrung terhadap dunia, dan bukan tipe orang yang enggan untuk memperbaiki keadaan rakyatnya. Bahkan orientasinya adalah melakukan perbaikan. Untuk itu, dia menyambut permintaan mereka, karena mengandung kemaslahatan tanpa meminta timbal-balik. Justru dia bersyukur kepada Allah atas kekuasaan dan kemampuan yang dimiliki. Dia berkata kepada mereka, “Apa yang telah dikuasakan oleh Rabbku kepadaku terhadapnya adalah lebih baik,” maksudnya, lebih baik daripada apa yang kalian kerahkan dan berikan kepadaku. Aku hanya minta kalian untuk membantuku dengan kekuatan fisik kalian melalui tangan-tangan kalian “agar aku membuatkan dinding antara kamu dan mereka,” yaitu dinding yang akan menghalangi mereka menyeberang kepada kalian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 95: Yakni oleh karena itu, biarlah aku buatkan penghalang itu tanpa perlu diupah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 95",
    "description": "Mendengar tawaran umat yang terancam itu, dia, yaitu zulkarnain yang bijaksana itu, kemudian berkata, 'apa yang telah dianugerahkan tuhan kepadaku yang meliputi kekuasaan, keluasan wilayah, dan kekayaan harta benda lebih baik daripada imbalanmu yang kau tawarkan kepadaku, maka sebagai gantinya bantulah aku dengan seluruh kekuatan yang ada, agar aku dapat membuatkan dinding yang kuat sebagai penghalang antara kamu dan mereka, sehingga kamu semua akan merasa aman karena terhindar dari serangan mereka. 96. Zulkarnain berkata, 'berilah aku potongan-potongan besi untuk aku jadikan bahan membuat dinding penghalang yang kuat!' hingga ketika potongan-potongan besi itu telah terpasang dengan kukuh dan ketinggiannya sama rata dengan kedua puncak gunung itu, dia meminta mereka menyalakan api dan berkata, 'tiuplah api itu dengan kuat supaya besi itu panas!' ketika besi itu sudah menjadi panas dan berwarna merah seperti api karena api pembakaran yang begitu besar, dia pun berkata, 'berilah aku tembaga yang sudah dipanaskan hingga meleleh agar dapat kutuangkan ke atasnya, yaitu besi-besi panas itu sehingga menjadi bangunan dinding yang kukuh. '."
  }
]