[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berilah aku potongan-potongan besi, ”hingga tatkala mereka telah datang membawanya dan meletakannya dan mereka telah membuatnya rata setinggi dua sisi (puncak) gunung, dia berkata kepada pekerja, ”nyalakanlah api”. Maka ketika semua besi sudah berubah menjadi kobaran api, dia berkata, ”berilah aku tembaga. aku akan menuangkan tembaga padanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Bawakanlah kepadaku potongan-potongan besi,\" Maka merekapun membawakannya, lalu ia mulai membangun dinding dengan potongan-potongan besi itu di antara dua gunung tersebut, hingga ketika semua bangunannya telah terpasang sama rata dengan puncak gunung itu, ia berkata kepada para pekerja, \"Nyalakanlah api pada potongan-potongan besi ini,\" hingga ketika telah memerah, ia berkata, \"Bawakanlah padaku tembaga yang mendidih guna aku tuangkan di atasnya!\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. ءَاتُونِى زُبَرَ الْحَدِيدِ ۖ (berilah aku potongan-potongan besi) Yakni potongan-potongan besi. حَتَّىٰٓ إِذَا سَاوَىٰ بَيْنَ الصَّدَفَيْنِ (Hingga apabila besi itu telah sama rata dengan kedua (puncak) gunung itu) Makna (الصدفين) adalah dua sisi gunung yang saling berhadapan tersebut. Makna ayat ini yakni mereka memberinya potongan-potongan besi, kemudian ia mulai membangun dinding dengan potongan-potongan besi itu di antara dua gunung sampai setinggi dua gunung tersebut. قَالَ انفُخُوا۟ ۖ( berkatalah Dzulkarnain: “Tiuplah (api itu)”) Yakni Dzulkarnain berkata kepada para pekerja “tiuplah potongan-potongan besi itu dengan alat peniup. حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارًا (Hingga apabila besi itu sudah menjadi (merah seperti) api) Terdapat pendapat mengatakan bahwa dia memerintahkan agar meletakkan bahan berupa potongan besi dan bebatuan kemudian dipanaskan dengan kayu dan batu bara yang ditiup hingga memanas. Dan besi jika dipanaskan dalam api akan menjadi apo yang memerah. قَالَ ءَاتُونِىٓ أُفْرِغْ عَلَيْهِ قِطْرًا (diapun berkata: “Berilah aku tembaga (yang mendidih) agar aku kutuangkan ke atas besi panas itu”) Makna (القطر) adalah tembaga cair. Yakni tembaga cair tersebut kemudian dituangkan diatas potongan-potongan besi yang telah memerah sehingga dapat menyatukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Berilah aku potongan-potongan besi. Hingga apabila besi itu telah sama rata dengan kedua puncak gunung itu, Dzulkarnain kepada para pekerja: \"Tiuplah api itu\". Hingga bila besi itu sudah menjadi merah seperti api, diapun berkata: \"Berilah aku tembaga yang mendidih agar kutuangkan ke atas besi panas itu\". Sehingga benteng itu menjadi setinggi gunung kokoh dan licin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Berilah aku} Berilah dan serahkanlah kepadaku {potongan-potongan besi} potongan-potongan besi {Sehingga ketika itu telah sama rata dengan kedua gunung itu} sama rata di antara dua bagian gunung itu {dia berkata,“Tiuplah” Ketika besi itu sudah menjadi membara} Dzulqarnain menjadikan besi itu membara {dia pun berkata,“Berilah aku} berilah aku {cairan tembaga} tembaga yang dilelehkan {agar aku tuangkan} aku tuangkan {ke atasnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. “Berilah aku potongan-potongan besi,” yaitu potongan-potongan besi, maka mereka pun menyerahkannya kepada Dzulqaranain “hingga apabila besi itu telah sama rata dengan kedua (puncak) gunung itu,” yaitu dua gunung yang dibangun sebuah dinding di antara keduanya “berkatalah (Dzulqarnain), ‘Tiuplah’,” api itu. Maksudnya, nyalakanlah api itu sampai besar dan pergunakanlah ala-alat tiup supaya semakin besar sehingga dapat mencairkan tembaga. Ketika tembaga itu sudah meleleh yang mana dia ingin merekatkannya di antara potongan-potongan besi itu “dia pun berkata, ‘Berilah aku tembaga (yang mendidih) agar aku tuangkan ke atas besi panas itu’,” tembaga yang meleleh. Kemudian ia menuangkan lelehan tembaga pada potongan-potongan besi itu segingga dinding semakin kokoh dengan kekokohan yang dahsyat. Orang-orang yang berada di belakangnya terlindungi dari gangguan Ya’juj dan Ma’juj."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 96: Sepotongnya seukuran batu. Ketika itu di antara potongan-potongan besi itu disediakan kayu bakar dan arang, dan diletakkan di sekitarnya alat peniup api. Sehingga menyatu dengan besi tersebut."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 96",
    "description": "Zulkarnain berkata, 'berilah aku potongan-potongan besi untuk aku jadikan bahan membuat dinding penghalang yang kuat!' hingga ketika potongan-potongan besi itu telah terpasang dengan kukuh dan ketinggiannya sama rata dengan kedua puncak gunung itu, dia meminta mereka menyalakan api dan berkata, 'tiuplah api itu dengan kuat supaya besi itu panas!' ketika besi itu sudah menjadi panas dan berwarna merah seperti api karena api pembakaran yang begitu besar, dia pun berkata, 'berilah aku tembaga yang sudah dipanaskan hingga meleleh agar dapat kutuangkan ke atasnya, yaitu besi-besi panas itu sehingga menjadi bangunan dinding yang kukuh. '97. Seiring selesainya pembangunan dinding yang kuat dan tinggi itu, maka mereka, yaitu yakjuj dan makjuj dan bangsa lain, tidak akan dapat mendakinya karena bentuk dinding itu yang tinggi dan tegak, dan merek tidak akan dapat pula melubanginya karena dinding itu begitu tebal dan kuat."
  }
]