[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ya’juj dan ma’juj tidak bisa mendaki ke atas dinding itu karena tinggi dan licin. dan mereka tidak mampu melubanginya dari bagian bawah dinding karena ketebalan dan kekokohannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "97. Maka Yakjuj dan Makjuj pun tidak dapat mendakinya karena bangunan tersebut sangat tinggi, dan tidak pula dapat melobangi dari bawah karena sangat keras."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "97. فَمَا اسْطٰعُوٓا۟ أَن يَظْهَرُوهُ (Maka mereka tidak bisa mendakinya) Yakni Ya’juj dan Ma’juj tidak dapat menaiki dinding pembatas tersebut karena begitu tinggi dan licin. وَمَا اسْتَطٰعُوا۟ لَهُۥ نَقْبًا(dan mereka tidak bisa (pula) melobanginya) Dan mereka tidak dapat melubangi bagian bawah dinding tersebut karena sangat kuat dan keras."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "97. Maka mereka para Ya’juj dan Ma’juj tidak bisa merusak sebab kekokohannya dan tidak bisa memanjat sebab ketinggiannya. Juga tidak bisa melubanginya karena sangat keras"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka mereka tidak mampu} maka Ya’juj dan Ma’juj tidak mampu {mendakinya} menaikinya dengan memanjat karena ketinggian dan kelicinannya {dan tidak mampu membuat lubang} lubang, karena kekerasannya dan ketebalannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "97. “Maka mereka tidak bisa mendakinya, dan mereka tidak bisa (pula) melubanginya,” maksudnya tidak ada kemampuan bagi mereka untuk mendakinya lantaran sangat tinggi, dan tidak mampu melubanginya karena sangat kokoh lagi kuat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 97: Karena tinggi dan licin. Karena keras dan tebal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 97",
    "description": "Seiring selesainya pembangunan dinding yang kuat dan tinggi itu, maka mereka, yaitu yakjuj dan makjuj dan bangsa lain, tidak akan dapat mendakinya karena bentuk dinding itu yang tinggi dan tegak, dan merek tidak akan dapat pula melubanginya karena dinding itu begitu tebal dan kuat. 98. Setelah pembangunan dinding itu selesai, dia bersyukur kepada Allah dan berkata, 'sesungguhnya dinding ini dan kemampuan untuk membuatnya adalah rahmat dari tuhanku bagi hamba-Nya yang saleh. Dinding ini akan menjadi penghalang dari orang atau bangsa lain yang akan menyerang. Bangunan ini akan terus berdiri tegak sampai waktu yang Allah janjikan. Maka apabila janji tuhanku tentang keruntuhannya sudah datang, dia akan menghancurluluhkannya sampai berkeping-keping; dan ketahuilah bahwa janji tuhanku itu pasti benar dan akan terjadi, karena tidak ada satu pun benda yang tidak hancur pada akhirnya. '."
  }
]