[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dzulqarnain berkata, ”dinding yang aku dirikan sebagai penghalang dari kerusakan yang dilakukan ya’ij ma’juj ini merupakan rahmat dari tuhanku kepada sekalian manusia. Maka apabila sudah datang janji dari tuhanku dengan keluarnya ya’juj ma’juj (menjelang hari kiamat), Dia akan menjadikannya hancur berantakan lagi rata dengan permukaan tanah, dan janji tuhanku adalah benar adanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "98. Zulkarnain berkata, \"Dinding penghalang ini adalah rahmat dari Tuhanku agar menghalangi dan membatasi gerak gerik Yakjuj dan Makjuj dari mengadakan kerusakan di muka bumi, dan apabila telah tiba waktu yang ditentukan oleh Allah agar mereka keluar sebelum datangnya hari Kiamat, maka Dia akan menghancurkannya hingga rata dengan tanah, dan sungguh janji Allah tentang ratanya dinding itu dengan tanah, dan keluarnya Yakjuj dan Makjuj benar dan tidak akan diselisihi.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "98. Setelah Dzulkarnain selesai membangunnya, dia menyebutkan karunia Allah yang diberikan kepadanya: “Apa yang aku bangun ini adalah rahmat dari karunia Tuhanku, dan jika janji Tuhanku telah datang berupa keluarnya Ya’juj dan Ma’juj dan terjadinya hari kiamat telah dekat, maka Allah akan menjadikannya rata dengan tanah. Dan janji Allah ini pasti terjadi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "98. قَالَ هٰذَا رَحْمَةٌ مِّن رَّبِّى ۖ (Dzulkarnain berkata: “Ini (dinding) adalah rahmat dari Tuhanku) Sehingga menghalangi Ya’juj dan Ma’juj dalam membuat kerusakan di bumi. فَإِذَا جَآءَ وَعْدُ رَبِّى(maka apabila sudah datang janji Tuhanku) Yakni waktu keluarnya Ya’juj dan Ma’juj sebelum yang sudah ditentukan Tuhanku yang terjadi sebelum hari kiamat. جَعَلَهُۥ دَكَّآءَ ۖ( Dia akan menjadikannya hancur luluh) Yakni menjadi rata dengan tanah. وَكَانَ وَعْدُ رَبِّى(dan janji Tuhanku itu) Yakni janji tentang kehancuran dinding pembatas itu dan keluarnya Ya’juj dan Ma’juj sebelum terjadi kiamat. حَقًّا(adalah benar) Yakni janji yang tidak akan dilanggar. Ayat ini adalah akhir dari perkataan Dzulkarnain dalam surat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "98. Setelah selesai membangun benteng/tembok itu Dzulkarnain berkata: \"Dinding ini adalah bukti rahmat dari Tuhanku, Yang telah memberi kalian anugerah agar diganggu/diserang Ya’juj dan Ma’juj. Maka apabila ketetapan Tuhanku telah sampai pada waktunya, Dia akan menghancurkan meluluhkan dan meratakannya dengan dengan tanah. Dan janji Tuhanku itu adalah benar\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Dzulqarnain berkata {“(Tembok) ini} Tembok {adalah rahmat dari Tuhanku. Apabila janji Tuhanku telah tiba} waktu Tuhanku untuk mengeluarkan Ya’juj dan Ma’juj sebelum terjadinya kiamat {Dia akan menjadikannya hancur luluh} runtuh rata seperti tanah {Janji Tuhanku itu benar”} pasti terjadi, bukan mustahil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "98. Setelah dia melakukan tindakan yang indah dan (membangun) peninggalan yang agung ini, maka dia menisbatkan kenikmatan itu kepada Allah. Dia berkata, “Ini (dinding) adalah rahmat dari Rabbku,” maksudnya berasal dari keutamaan dan kebaikanNya yang tercurah bagiku. Inilah kondisi para khalifah (penguasa) yang shalih, saat mereka menerima kenikmatan yang agung dari Allah, niscaya rasa syukur, penetapan, dan pengakuan terhadap kenikmatan Allah semakin meningkat. Seperti yang dikatakan oleh Sulaiman ketika singgasana ratu Saba’ muncul di hadapannya, padahal jaraknya sangat jauh. Beliau berkata, \"Ini termasuk kurnia Tuhanku untuk mencoba aku apakah aku bersyukur atau mengingkari (akan nikmat-Nya).\" (An-Naml:40). Berbeda halnya dengan orang-orang yang sombong, takabur, dan congkak di atas bumi ini, kenikmatan-kenikmatan yang besar semakin menambah keburukan dan kesombongan mereka. Seperti yang dikatakan oleh Qarun ketika dikaruniai Allah perbendaharaan kekayaan yang (berat) kunci-kuncinya sungguh berat dipikul oleh sekumpulan orang kuat-kuat. Dia berkata, \"\"Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku\". (Al-Qashash:78). Dan firmanNya, “Maka apabila sudah datang janji Rabbku,” yaitu janji kemunculan Ya’juj dan Ma’juj “Dia akan menjadikannya hancur luluh,” menghancurkan dinding yang kuat dan kokoh itu sehingga roboh dengan tanah, “dan janji Rabbku itu adalah benar.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 98: Bisa juga maksudnya kemampuan untuk membuatnya. Yakni nikmat, karunia dan ihsan-Nya kepadaku, karena dinding tersebut dapat menghalangi Ya’juj dan Ma’juj keluar ke tengah-tengah manusia yang lain. Seperti inilah keadaan para pemimpin yang saleh. Ketika Allah Subhaanahu wa Ta'aala memberikan nikmat yang banyak kepadanya, maka rasa syukur dan pengakuan mereka terhadap nikmat tersebut bertambah, sebagaimana perkataan Nabi Sulaiman ketika dihadapkan kepadanya kerajaan Saba’, “Ini adalah karunia Tuhanku agar Dia mengujiku apakah aku bersyukur atau kufur,” Berbeda dengan orang-orang yang sombong dan bersikap semena-mena di bumi, nikmat-nikmat yang diberikan kepada mereka menambah mereka semakin sombong, sebagaimana yang dilakukan Qarun ketika dikaruniakan kekayaan yang besar, ia berkata, “Ini karena kepandaianku.” Nas’alullahas salaamah wal ‘aafiyah. Untuk keluarnya Ya’juj dan Ma’juj. Dari Abu Hurairah radhiyallahu 'anhu, dari Nabi shallallahu 'alaihi wa sallam, Beliau bersabda tentang dinding itu, يَحْفِرُونَهُ كُلَّ يَوْمٍ حَتَّى إِذَا كَادُوا يَخْرِقُونَهُ قَالَ الَّذِي عَلَيْهِمْ ارْجِعُوا فَسَتَخْرِقُونَهُ غَدًا فَيُعِيدُهُ اللَّهُ كَأَشَدِّ مَا كَانَ حَتَّى إِذَا بَلَغَ مُدَّتَهُمْ وَأَرَادَ اللَّهُ أَنْ يَبْعَثَهُمْ عَلَى النَّاسِ قَالَ الَّذِي عَلَيْهِمْ ارْجِعُوا فَسَتَخْرِقُونَهُ غَدًا إِنْ شَاءَ اللَّهُ وَاسْتَثْنَى قَالَ فَيَرْجِعُونَ فَيَجِدُونَهُ كَهَيْئَتِهِ حِينَ تَرَكُوهُ فَيَخْرِقُونَهُ فَيَخْرُجُونَ عَلَى النَّاسِ فَيَسْتَقُونَ الْمِيَاهَ وَيَفِرُّ النَّاسُ مِنْهُمْ \"Mereka melubanginya setiap hari, sehingga ketika mereka hampir berhasil melubanginya, pemimpin mereka berkata, \"Kembalilah! kalian bisa melubanginya besok!\", lantas Allah mengembalikan tembok itu tertutup dan seperti kemarin. Sampai apabila masa mereka sudah tiba, dan Allah hendak membangkitkan mereka di tengah-tengah manusia, maka pemimpin mereka berkata, \"Kembalilah kalian, kalian akan bisa melubanginya besok, insya Allah!\" ia mengucapkan insya Allah. Besoknya mereka kembali, sedangkan tembok itu masih seperti keadaan ketika mereka tinggalkan kemarin, lantas mereka pun berhasil melubanginya dan bisa berbaur dengan manusia. Mereka pun meminum banyak air dan orang-orang lari karena takut kepada mereka.\" (HR. Tirmidzi, Ibnu Majah dan Hakim, hadits ini shahih)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 98",
    "description": "Setelah pembangunan dinding itu selesai, dia bersyukur kepada Allah dan berkata, 'sesungguhnya dinding ini dan kemampuan untuk membuatnya adalah rahmat dari tuhanku bagi hamba-Nya yang saleh. Dinding ini akan menjadi penghalang dari orang atau bangsa lain yang akan menyerang. Bangunan ini akan terus berdiri tegak sampai waktu yang Allah janjikan. Maka apabila janji tuhanku tentang keruntuhannya sudah datang, dia akan menghancurluluhkannya sampai berkeping-keping; dan ketahuilah bahwa janji tuhanku itu pasti benar dan akan terjadi, karena tidak ada satu pun benda yang tidak hancur pada akhirnya. '99. Bila saat itu tiba, semua yang ada di bumi akan hancur, dan pada hari itu kami biarkan mereka, yaitu yakjuj dan makjuj, berbaur antara satu dengan yang lain tanpa penghalang apa pun karena dinding kukuh itu telah hancur. Ketika mereka sudah bercampur baur dan sangkakala ditiup untuk yang kedua kali, akan kami kumpulkan mereka semuanya di padang mahsyar, tempat pertemuan semua makhluk ketika itu."
  }
]