[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami biarkan ya’juj dan ma’juj (pada hari datangnya janji kami kepada mereka) datang bergelombang sebagian mereka pada sebagian yang lain dengan bercampur aduk, karena jumlah mereka yang banyak, dan ditiuplah sasangkala untuk kebangkitan. Maka Kami mengumpulkan semua makhluk untuk perhitungan amalan dan pembalasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Dan di akhir zaman nanti Kami, membiarkan sebagian makhluk berbaur dengan makhluk lainnya, lalu sangkakala akan ditiupkan dan Kami mengumpulkan seluruh makhluk agar dihisab dan diberikan balasan amalan mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "99. Pada saat Ya’juj dan Ma’juj keluar, Kami biarkan manusia terombang-ambing seperti lautan yang bergejolak karena mereka sangat banyak dan berdesakan dan keganasan Ya’juj dan Ma’juj terhadap mereka, sehingga kerusakan dan kebinasaan terjadi tersebar di seluruh muka bumi. Dan malaikat akan meniup sangkakala untuk hari kebangkitan, dan seluruh makhluk akan bangkit dan berkumpul untuk menjalani hari perhitungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. وَتَرَكْنَا بَعْضَهُمْ (Kami biarkan mereka) Yakni kami biarkan sebagian manusia. يَوْمَئِذٍ(di hari itu) Yakni hari keluarnya Ya’juj dan Ma’juj. يَمُوجُ فِى بَعْضٍ ۖ (bercampur aduk antara satu dengan yang lain) Yakni mereka saling bercampur aduk. Dan keluarnya Ya’juj dan Ma’juj merupakan salah satu tanda terjadinya kiamat telah dekat. وَنُفِخَ فِى الصُّورِ (kemudian ditiup lagi sangkakala) Terdapat pendapat mengatakan yang dimaksud adalah tiupan yang kedua, dengan dalil lanjutan dari ayat ini. فَجَمَعْنٰهُمْ جَمْعًا (lalu Kami kumpulkan mereka itu semuanya) Yakni Kami hidupkan mereka kembali setelah jasad mereka hancur menjadi tanah, kemudian mereka semua Kami kupulkan di padang mahsyar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Pada hari ketika Ya’juj dan Ma’juj keluar dari belakang benteng Kami biarkan beberapa orang itu bercampur aduk antara satu dengan yang lain, itu sebagai tanda datangnya hari kiamat. Kemudian ditiup sangkakala kedua, lalu Kami kumpulkan mereka itu semuanya setelah Kami bangkitkan untuk perhitungan amal dan pembalasan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Pada hari itu Kami membiarkan sebagian mereka} sebagian makhluk berbaur} bercampur dan berbaur {dengan sebagian yang lain. dan sangkakala} masa dimana Israfil AS meniup sangkakala {ditiup (lagi)} tiupan kedua, yaitu tiupan kebangkitan {Kami benar-benar akan mengumpulkan mereka semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. Kata ganti هم (mereka) mempunyai kemungkinan menggantikan Ya’juj dan Ma’juj. Mereka itu, bila telah muncul ke hadapan orang-orang, (disebabkan banyak dan berjubelannya di seluruh bumi), bercampur aduk satu dengan yang lain. Sebagaimana difirmankan oleh Allah, \"Hingga apabila dibukakan (tembok) Yakjuj dan Makjuj, dan mereka turun dengan cepat dari seluruh tempat yang tinggi.\" (Al-Anbiya:96). Begitu pula, kata ganti: هم (mereka) itu bisa mengarahkan kepada seluruh makhluk pada Hari Kiamat. Mereka berkumpul (jadi satu) pada hari itu, sehingga nampak sangat banyak dan bercampur aduk antara satu dengan yang lain karena kengerian-kengerian dan goncangan-goncangan hebat. Dengan dalil firman-Nya : kemudian ditiup lagi sangkakala, lalu Kami kumpulkan mereka itu semuanya, dan Kami nampakkan Jahanam pada hari itu kepada orang-orang kafir dengan jelas., yaitu orang-orang yang matanya dalam keadaan tertutup dari memperhatikan tanda-tanda kebesaran-Ku, dan adalah mereka tidak sanggup mendengar. (Al-kahfi :99-101) Maksudnya, ketika Israfil meniup sangkakala (lagi), maka Allah mengembalikan seluruh roh kepada jasadnya, kemudian menghimpun dan mengumpulkan mereka di padang Hari Kiamat, dari umat-umat terdahulu dan manusia generasi akhir, kaum kafir dan kaum Mukminin, untuk ditanya dan diperhitungkan amalan mereka serta dibalasi atas dasar amalan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Kahfi ayat 99: Yakni pada hari keluarnya. Ada pula yang menafsirkan, bahwa pada hari kiamat semua makhluk berbaur dengan yang lain. Maksudnya, tiupan yang kedua yaitu tiupan tanda kebangkitan dari kubur dan pengumpulan manusia ke padang Mahsyar, sedangkan tiupan yang pertama adalah tiupan kehancuran alam semesta ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Kahfi Ayat 99",
    "description": "Bila saat itu tiba, semua yang ada di bumi akan hancur, dan pada hari itu kami biarkan mereka, yaitu yakjuj dan makjuj, berbaur antara satu dengan yang lain tanpa penghalang apa pun karena dinding kukuh itu telah hancur. Ketika mereka sudah bercampur baur dan sangkakala ditiup untuk yang kedua kali, akan kami kumpulkan mereka semuanya di padang mahsyar, tempat pertemuan semua makhluk ketika itu. 100. Peniupan sangkakala kedua menandakan dimulainya hari kebangkitan. Pada saat itu, yakjuj-makjuj dan semua manusia dikumpulkan di padang mahsyar untuk mempertanggungjawabkan perbuatannya. Banyak peristiwa yang terjadi setelah itu. Dan kami perlihatkan neraka jahanam sebagai tempat pembalasan kepada semua orang kafir tanpa terkecuali, dengan gambaran yang jelas pada hari itu agar mereka mengetahui balasan atas perbuatan mereka dahulu."
  }
]