[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Alif lam ra. keterangan tentang huruf-huruf yang terputus-putus (diawal surat) telah berlalu di muka pada permulaan surat al-baqarah. Ayat-ayat yang agung itu adalah ayat-ayat kitab suci yang mulia (al-qur’an) yang diturunkan pada Muhammad . Yaitu ayat-ayat al-qur’an yang menerangkan semua hakikat perkara dengan sebenarnya, dengan ungkapan terbaik dan paling jelas serta paling tepat menunjukan apa yang dimaksud. Yang dimaksud dengan kitab adalah al-qur’an, Allah memadukan baginya dua nama ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Alif Lām Rā. Penjelasan tentang huruf-huruf seperti ini telah disebutkan di awal surah Al-Baqarah. Ayat-ayat ini berkedudukan tinggi yang menunjukkan bahwa ia diturunkan dari sisi Allah. Itulah ayat-ayat Al-Qur`ān yang menjelaskan Tauhid dan syariat-syariat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah disebutkan penjelasan tentang huruf muqattha’ah, dan hikmah dari huruf-huruf ini adalah untuk menjelaskan mukjizat al-Qur’an. Ayat-ayat yang mulia ini adalah bagian dari ayat-ayat kitab yang sempurna yaitu al-Qur’an yang memiliki lafadz yang fasih dan makna yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. تِلْكَ ((Surat) ini) Kata ini ditujukan pada ayat-ayat yang terkandung dalam surat ini. Dan kata al-Kitab yakni al-Qur’an. Allah mengumpulkan dua nama tersebut dalam ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Alif, laam, raa. Surat ini adalah sebagian dari ayat-ayat Alquran yang sempurna dalam berbagai segi, yaitu ayat-ayat yang jelas dan memberi penjelasan. Kumpulan dari dua kata quran dan kitab yang menunjukkan rentetan sifat dan mausuf. Penakirahan kata Alquran adalah untuk pengagungan."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Allah berfirman untuk mengagungkan kitabNya lagi untuk memujinya, ”surat ini adalah (sebagian dari) ayat ayat al kitab (yang sempurna)” ayat ayat yang menunjukan makna makna yang paling bagus dan tuntutan yang paling mulia, ”yaitu (ayat ayat) al qur’an yang memberi penjelasan” untuk fakta fakta dengan lafazh yang terindah dan paling jelas serta lebih mengarah kepada maksud pembicaraan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (الٓرۚ) “Alif laam raa” : Allah lebih mengetahui maknanya, tertulis: namun dibaca: Alif Laam Raa. (تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ) tilka aayaatul kitaab : “Itulah ayat-ayat Al-Kitab” ayat-ayat yang tersusun dari huruf-huruf muqatha’ah ini adalah ayat-ayat Al-Kitab, Al-Qur’an. Makna ayat: Karena surat ini termasuk Makiyah, maka membahas perkara-perkara yang berkaitan dengan akidah, yang terbesar adalah tauhid, nubuwah, dan kebangkitan. (الٓرۚ) Alif Laam Raa : Allah lebih mengetahui tentang maksud-Nya, dan di antara faidah huruf muqatha’ah adalah sebagai penarik perhatian pendengar, sehingga mereka fokus kepadanya ketika dibacakan. Karena mereka enggan mendengarkannya, khawatir akan terpengaruh dengannya, oleh karena itu pembuka surat ini yang belum pernah dibuat dalam perkataan mereka dapat membuat mereka terdorong untuk mendengarkan apa yang adalah setelahnya berupa Al-Qur’an. Firman-Nya : (تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ) “Itulah ayat-ayat Al-Kitab” diantara pendapat yang dibolehkan, bahwa: Inilah ayat-ayat yang tersusun dari huruf-huruf seperti (الم) (طسم) (حم) (عسق). “Itulah ayat-ayat Al-Kitab yaitu Al-Qur’an yang memberi penjelasan.” Al-Mubiin : penjelas antara kebenaran dan kebatilan, petunjuk dan kesesatan. Pelajaran dari ayat: - Al-Qur’anul Karim adalah penjelas segala sesuatu yang dibutuhkan untuk mengapai kebahagiaan seorang insan dan kesempurnaannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 1: Allah Ta’ala berfirman menyebutkan keagungan Al Qur’an dan pujian-Nya terhadapnya. Antara yang hak dan yang batil. Ada pula yang menafsirkan dengan, “Menerangkan hakikat yang sebenarnya menggunakan lafaz yang baik, jelas dan menunjukkan kepada maksud,” hal ini menghendaki manusia untuk tunduk dan menerima dengan rasa suka dan gembira. Adapun orang yang menghadapi nikmat yang besar ini dengan menolak atau kafir kepadanya, maka ia tergolong orang-orang yang mendustakan lagi sesat, di mana akan datang kepada mereka waktu yang ketika itu mereka berangan-angan seandainya mereka termasuk orang-orang Islam atau orang-orang yang tunduk dan menerimanya ketika di dunia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 1",
    "description": "Alif laam raa'. Ayat-ayat pada surah ini adalah sebagian dari ayat-ayat kitab yang sempurna, yaitu ayat-ayat Al-Qur'an yang memberi penjelasan. Orang kafir itu suatu saat nanti setelah berada di akhirat kelak kadangkadang menginginkan sekiranya mereka dahulu ketika di dunia menjadi orang muslim."
  }
]