[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "10-11. Dan sungguh Kami telah mengutus sebelummu (wahai rasul), para rasul pada umat-umat terdahulu. Lalu tidak ada seorang rasul yang datang kepada mereka kecuali mereka memperoloknya. Disini, tergantung hiburan bagi nabi karena sebagiamana orang-orang musyrik telah memperlakukan dirimu dengan berbagai gangguan, demikian pula para rasul sebelummu mengalami hal yang sama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sungguh Kami telah mengutus sebelummu -wahai Rasul- para rasul kepada umat-umat terdahulu lalu mereka mendustakan para rasul tersebut, kamu bukan Rasul pertama yang didustakan oleh umatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10-13. Hai Rasulullah, sungguh Kami telah mengutus rasul-rasul sebelummu kepada umat-umat terdahulu, akan tetapi jika datang seorang rasul kepada mereka pasti akan mereka hina. Demikianlah Kami jadikan kesesatan dan olok-olok terhadap para nabi ke dalam hati orang-orang kafir, sebagaimana Kami memasukkannya ke dalam hati orang-orang kafir yang menghina al-Qur’an. Dan telah berlaku sunnatullah bahwa Dia akan membinasakan umat-umat terdahulu yang mendustakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَلَقَدْ أَرْسَلْنَا مِن قَبْلِكَ (Dan sesungguhnya Kami telah mengutus sebelum kamu) Yakni mengutus rasul-rasul. فِى شِيَعِ الْأَوَّلِينَ(kepada umat-umat yang terdahulu) Yakni kepada umat dan golongan mereka masing-masing."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Sesungguhnya Kami telah mengutus beberapa rasul sebelum kamu kepada umat-umat dan kelompok yang terdahulu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah mengutus sebelum kamu kepada umat-umat terdahulu} berbagai umat yang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Allah berkata kepada nabiNya tatkala kaum musyrikin menyatakannya dusta, ”itu merupakan kebiasaan umat umat terdahulu dan (orang orang di) masa masa silam. Sungguh kami telah mengutus “(beberapa rasul) sebelum kamu kepada umat umat terdahulu ”yaitu beberapa rasul kepada golongan dan kelompok mereka”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فِي شِيَعِ ٱلۡأَوَّلِينَ) fii syiya’il awwaliin : “umat-umat terdahulu” kelompok dan kaum terdahulu. Makna ayat: Firman-Nya : (وَلَقَدۡ أَرۡسَلۡنَا مِن قَبۡلِكَ فِي شِيَعِ ٱلۡأَوَّلِينَ ) “Telah Kami utus (utusan) sebelummu, kepada kelompok-kelompok terdahulu” kelompok dan umat mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 10",
    "description": "Pendustaan yang dialami oleh nabi Muhammad juga terjadi pada para rasul sebelumnya. Allah menyatakan, dan sungguh, kami telah mengutus beberapa rasul sebelum kami mengutus engkau, wahai nabi Muhammad. Kami telah mengutus mereka kepada umat-umat terdahulu. Dan ingatlah wahai nabi Muhammad, setiap kali seorang rasul datang kepada mereka dengan membawa risalah dari Allah dan mengajak mereka beriman, mereka selalu memperolok-olokkannya. Karena itu, janganlah engkau berkecil hati dan bersedih menerima perlakuan buruk kaummu kepadamu, karena para rasul sebelummu juga mengalami hal demikian."
  }
]