[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Sebagaimana kami dahulu memasukan kekafiran dalam hati umat-umat terdahulu disebabkan bentuk olokan mereka kepada rasul-rasul dan pendustaan mereka, demikian pula kami akan melakukan itu pada orang-orang musyrik dari kaummu yang berbuat kejahatan. Berupa kekafiran kepada Allah dan mendustakan rasulNya tidak membenarkan al-qur’an yang diturukan kepadamu. Dan sesungguhnya telah berlalu ketetapan pada umat-umat terdahulu dengan membinasakan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Sebagaimana Kami memasukkan pendustaan di hati umat-umat tersebut, Kami juga memasukkannya di hati kaum musyrikin Makkah dengan penentangan mereka dan kebencian mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. كَذٰلِكَ نَسْلُكُهُۥ فِى قُلُوبِ الْمُجْرِمِينَ (Demikianlah, Kami mamasukkan (rasa ingkar dan memperolok-olokkan itu) kedalam hati orang-orang yang berdosa) Yakni Kami masukkan kesesatan ke dalam hati orang-orang yang berbuat kejahatan agar mereka tidak menganggap kebalikannya adalah kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Sebagaimana Kami Kami mamasukkan rasa ingkar, dusta dan olok-olok itu kedalam hati orang-orang orang-orang kafir terdahulu, Kami juga memasukkan perangai-perangai itu kepada kaummu sebab kekejaman mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Demikian itu Kami memasukkannya} memasukkannya {ke dalam hati orang-orang yang berdosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12-13. “demikianlah, kami memasukkan (rasa ingkar dan memperlok olokan itu)” maksudnya kami memasukkan sikap pendustaan “kedalam hati orang orang yang berdosa (orang orang kafir)” yaitu orang orang yang karakter khas pada mereka adalah kezhaliman dan kedustaan. Kami menghukum mereka karena hati mereka mirip dengan kekufuran dan pendustaan, maka (respon) mereka kepada para nabi dan rasul yang diutus kepada merekapun berwujud mirip dengan ejekan dan olokan serta tidak beriman. oleh karenanya, Allah berfirman ”mereka tidak beriman kepadanya(al-qur’an) dan sesungguhnya telah berlalu sunnatullah teradap orang orang dahulu” maksudnya ketetapan umum dari Allah berkaitan dengan mereka adalah dengan memusnahkan orang orang yang tidak beriman kepada ayat ayat Allah"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: (كَذَٰلِكَ نَسۡلُكُهُۥ) kadzalika naslukuhu : “Demikianlah Kami memasukkannya” yaitu pendustaan terhadap Al-Qur’an atau Nabi shallahu ‘alaihi wa sallam. Makna ayat: Pembahasan masih berkaitan dengan orang-orang yang mendustakan Nabi dan memintanya untuk menurunkan malaikat sebagai saksi bahwa dia adalah seorang rasul yang membawa kenabian, sehingga mau untuk beriman. Allah ta’ala berfirman : (كَذَٰلِكَ نَسۡلُكُهُۥ) “Demikianlah Kami masukkannya” pendustaan ini ke dalam hati orang-orang yang berdosa dari kaummu, sebagimana Kami telah memasukkannya ke dalam hati orang-orang yang mendustakan Para Rasul sebelummu, maka Dia masukkan hal itu (فِي قُلُوبِ ٱلۡمُجۡرِمِينَ) “ke dalam hati orang-orang yang berdosa.” Dari kaummu sehingga mereka tidak akan beriman kepadamu, tidak pula kepada Al-Qur’an yang turun kepadamu. Pelajaran dari ayat: • Penjelasan ketentuan Allah ta’ala atas para pendusta lagi menentang, yaitu mereka tidak akan beriman hingga mereka melihat azab yang pedih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 12",
    "description": "Perlakuan buruk sebagian dari kaummu dan penolakan mereka kepada dakwahmu tidaklah berbeda dengan apa yang dilakukan oleh orang kafir terdahulu. Ketahuilah, wahai nabi Muhammad bahwa demikianlah, kami memasukkannya, yaitu olok-olok terhadap para rasul dan risalahnya, ke dalam hati orang yang berdosa, yaitu kaum kafir yang kebejatan dan dosa mereka sudah mendarah daging. Semua ayat dan risalah para rasul tidak mampu menuntun mereka menuju iman. Karena itu, mereka tidak beriman kepadanya, yaitu Al-Qur'an atau nabi Muhammad, padahal telah berlalu sunatullah berupa kebinasaan dan kehancuran terhadap orang-orang terdahulu akibat dari perbuatan dosa dan kedurhakaan mereka."
  }
]