[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "12-13. Sebagaimana kami dahulu memasukan kekafiran dalam hati umat-umat terdahulu disebabkan bentuk olokan mereka kepada rasul-rasul dan pendustaan mereka, demikian pula kami akan melakukan itu pada orang-orang musyrik dari kaummu yang berbuat kejahatan. Berupa kekafiran kepada Allah dan mendustakan rasulNya tidak membenarkan al-qur’an yang diturukan kepadamu. Dan sesungguhnya telah berlalu ketetapan pada umat-umat terdahulu dengan membinasakan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Mereka tidak beriman kepada Al-Qur`ān yang diturunkan kepada Muhammad -ṣallallāhu 'alaihi wa sallam-. Dan sunnah Allah telah berlaku, yaitu membinasakan orang-orang yang mendustakan apa yang dibawa Rasul-rasul mereka, hendaknya orang-orang yang mendustakan itu mengambil pelajaran."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. لَا يُؤْمِنُونَ بِهِۦ ۖ (mereka tidak beriman kepadanya) Yakni mereka tidak beriman kepada al-Qur’an yang telah Kami turunkan. وَقَدْ خَلَتْ سُنَّةُ الْأَوَّلِينَ(dan sesungguhnya telah berlalu sunnatullah terhadap orang-orang dahulu) Yakni telah berlalu bagaimana Allah membinasakan mereka, sebab pendustaan dan olokan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Mereka tidak beriman dan tidak membenarkan Al Quran serta Nabi. Sesungguhnya sunnatullah terhadap orang-orang dahulu telah terjadi pada mereka berupa kesesatan dan kebinasaan sebab dusta mereka kepada Nabi mereka. Adapun ungkapan dan ancaman ini adalah untuk kafir Makkah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak beriman kepadanya} Al-Qur’an {dan telah berlalu} berlalu {sunatullah terhadap orang-orang terdahulu} cara Allah dalam membinasakan para pendusta dari umat-umat terdahulu"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ) wa qad khalat sunnatul awwaliin : “padahal telah berlalu sunnatullah terhadap orang-orang terdahulu.” Telah lalu ketentuan Allah terhadap umat-umat terdahulu. Makna ayat: Allah ta’ala berfirman : (وَقَدۡ خَلَتۡ سُنَّةُ ٱلۡأَوَّلِينَ) “Dan telah berlalu sunnatullah kepada orang-orang terdahulu.” Telah lewat, yaitu siksaan kepada para pendusta dan pengejek Rasul-Rasul. Karena mereka tidak beriman sampai mereka melihat azab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 13: Bisa juga diartikan, kepada Nabi shallallahu 'alaihi wa sallam. Maksud sunnatullah di sini adalah membinasakan orang-orang yang mendustakan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 13",
    "description": "Karena itu, mereka tidak beriman kepadanya, yaitu Al-Qur'an atau nabi Muhammad, padahal telah berlalu sunatullah berupa kebinasaan dan kehancuran terhadap orang-orang terdahulu akibat dari perbuatan dosa dan kedurhakaan mereka. Memenuhi permintaan kaum kafir untuk mendatangkan malaikat agar dapat mereka lihat wujud aslinya dan mereka dengar pesannya tidak akan pernah membuat mereka beriman. Dan bahkan kalau kami bukakan kepada mereka salah satu pintu langit, lalu mereka terus-menerus naik ke atasnya sehingga mereka dapat menyaksikan berbagai kebesaran dan kekuasaan Allah, ."
  }
]