[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Dan seandainya kami membuka bagi orang-orang kafir Makkah satu pintu langit, lalu mereka terus menaiki untuk masuk kedalamnya, hingga dapat melihat malaikat langsung, pastilah mereka tetap tidak beriman, dan akan benar-benar mengatakan, ”pandangan-pandangan kami telah terkena pengaruh sihir, dan kami berilusi melihat malaikat. Jadi, kami tidak lain adalah orang-orang yang terkena pengaruh sihir dari Muhammad pada akal-akal kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Mereka para pendusta itu tetap membangkang meskipun kebenaran menjadi jelas bagi mereka dengan dalil-dalil yang nyata. Seandainya Kami membuka satu pintu dari langit, lalu mereka menaikinya,"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14-15. Allah menjelaskan besarnya kebebalan dan penentangan orang-orang kafir terhadap kebenaran. Seandainya Allah membukakan satu pintu langit sehingga mereka dapat naik ke langit, niscaya mereka tidak juga beriman dan terus dalam pendustaan mereka dengan berkata: “Sebenarnya penglihatan kami tertipu seakan-akan kami naik ke langit akibat sihir yang dilakukan Muhammad!”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَلَوْ فَتَحْنَا عَلَيْهِم (Dan jika seandainya Kami membukakan kepada mereka) Yakni kepada orang-orang yang durhaka dan mendustakan Nabi Muhammad serta mengolok-oloknya. بَابًا مِّنَ السَّمَآءِ(salah satu dari (pintu-pintu) langit) Dan Kami jadikan mereka mampu naik ke langit. فَظَلُّوا۟ فِيهِ(lalu mereka terus menerus) Yakni di pintu tersebut. يَعْرُجُونَ (naik ke atasnya) Baik itu naik dengan suatu alat atau tanpa alat, sehingga mereka dapat menyaksikan keajaiban-keajaiban apa yang ada di langit."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14. Seandainya Kami membukakan kepada mereka salah satu pintu-pintu langit, sehingga mereka akan terus menerus naik ke atas langit,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Jika Kami membukakan pintu langit untuk mereka, lalu mereka akan terus menerus} maka bahkan mereka pada terangnya siang {naik} naik {ke atasnya} menuju pintu itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. maksudnya, seandainya setiap ayat (tanda kekuasaan Allah) yang agung datang kepada mereka, niscaya mereka tetap saja enggan beriman dan malah bersikap arogan terhadapnya. Dan “jika seandainya kami membukakan kepada mereka salah satu dari (pintu pintu langit)” sehingga mereka bisa menaikinya dan menyaksikan dengan mata kepala mereka sendiri, niscaya mereka akan berkata atas dorongan sifat dzalim dan keras kepala mereka untuk mengingkarinya, ”sesungguhnya pandangan kamilah yang dikaburkan” maksudnya pandangan pandangan mata kami tertimpa oleh kekaburan dan tabir pekat sehingga melihat sesuatu yang tidak terlihat. ”bahkan kami adalah orang orang yang kena sihir” maksudnya itu bukan realita, tapi sebuah bentuk sihir. Suatu kaum yang sudah sedemikian level pengingkaran mereka, maka sudah tentu sulit diinginkan dan diharapkan (keimanannya)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَظَلُّواْ فِيهِ يَعۡرُجُونَ) fazhalluu fiihi ya’rujuun : “lalu mereka terus menerus naik ke atasnya.” Menaikinya. Makna ayat: Firman-Nya ta’ala : (وَلَوۡ فَتَحۡنَا عَلَيۡهِم بَابٗا مِّنَ ٱلسَّمَآءِ فَظَلُّواْ) “Jikalau seandainya Kami bukakan untuk mereka sebuah pintu langit, niscaya mereka akan terus.” Yaitu para malaikat dan para pendusta itu (فِيهِ) “di sana” di pintu tersebut (يَعۡرُجُونَ) “naik.” Pelajaran dari ayat: • Permintaan para pendusta lagi berdosa untuk mendatangkan ayat-ayat seperti; melihat malaikat, itu tidak ada artinya, karena Al-Qur’an adalah tanda terbesar, namun mereka tidak beriman dengannya, oleh karena itu, seandainya pintu langit dibuka kemudian mereka naik ke atas, mereka tetap tidak akan beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 14: Yakni meskipun datang kepada mereka ayat yang besar, mereka tidak akan beriman juga bahkan akan mengatakan bahwa mereka adalah orang-orang yang disihir. Oleh karena itu, mereka tidak bisa lagi diharapkan untuk beriman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 14",
    "description": "Memenuhi permintaan kaum kafir untuk mendatangkan malaikat agar dapat mereka lihat wujud aslinya dan mereka dengar pesannya tidak akan pernah membuat mereka beriman. Dan bahkan kalau kami bukakan kepada mereka salah satu pintu langit, lalu mereka terus-menerus naik ke atasnya sehingga mereka dapat menyaksikan berbagai kebesaran dan kekuasaan Allah, mereka tentulah tidak akan beriman, bahkan mereka akan berkata, sesungguhnya pandangan kamilah yang dikaburkan dan ditutupi, bahkan kami adalah orang yang terkena sihir Muhammad dan apa yang kami lihat bukanlah sesuatu yang nyata. Perkataan mereka menunjukkan betapa kuat pengingkaran mereka terhadap tanda-tanda kekuasaan Allah."
  }
]