[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "14-15. Dan seandainya kami membuka bagi orang-orang kafir Makkah satu pintu langit, lalu mereka terus menaiki untuk masuk kedalamnya, hingga dapat melihat malaikat langsung, pastilah mereka tetap tidak beriman, dan akan benar-benar mengatakan, ”pandangan-pandangan kami telah terkena pengaruh sihir, dan kami berilusi melihat malaikat. Jadi, kami tidak lain adalah orang-orang yang terkena pengaruh sihir dari Muhammad pada akal-akal kami."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Niscaya mereka tidak akan membenarkannya, bahkan mereka berkata, “Pandangan mata kami ditutup sehingga ia tidak melihat, karena apa yang kami saksikan ini hanyalah sihir, kita ini terkena sihir.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. لَقَالُوٓا۟ (tentulah mereka berkata) Yakni orang-orang kafir akan berkata karena kedurhakaan mereka. إِنَّمَا سُكِّرَتْ أَبْصٰرُنَا(Sesungguhnya pandangan kamilah yang dikaburkan) Yakni dihalangi pandangannya. Pendapat lain mengatakan yakni mabuk akibat minuman. بَلْ نَحْنُ قَوْمٌ مَّسْحُورُونَ (bahkan kami adalah orang orang yang kena sihir) Ini merupakan penjelasan tentang kedurhakaan mereka. Apabila mereka telah melihat mukjizat yang mengharuskan mereka untuk beriman kepada Allah, para malaikat, kitab-kitab, dan para Rasul, mereka mengatakan bahwa apa yang mereka lihat hanyalah khayalan atau akal mereka telah tersihir sehingga indra mereka terganggu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Mereka orang-orang kafir sebab sifat pembangkang mereka tentu akan berkata: “Sesungguhnya pandangan kamilah yang dikaburkan, bahkan kami termasuk orang orang yang kena sihir Muhammad”.Maksud dari ini adalah bahwa mereka menekankan bahwa apa yang mereka lihat tidak ada hakikatnya, dan hanya sebuah sihir yang menipu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh mereka berkata,“Sesungguhnya pandangan kami yang dikaburkan} pandangan kami ditutup {Bahkan kami adalah kaum yang terkena sihir”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14-15. maksudnya, seandainya setiap ayat (tanda kekuasaan Allah) yang agung datang kepada mereka, niscaya mereka tetap saja enggan beriman dan malah bersikap arogan terhadapnya. Dan “jika seandainya kami membukakan kepada mereka salah satu dari (pintu pintu langit)” sehingga mereka bisa menaikinya dan menyaksikan dengan mata kepala mereka sendiri, niscaya mereka akan berkata atas dorongan sifat dzalim dan keras kepala mereka untuk mengingkarinya, ”sesungguhnya pandangan kamilah yang dikaburkan” maksudnya pandangan pandangan mata kami tertimpa oleh kekaburan dan tabir pekat sehingga melihat sesuatu yang tidak terlihat. ”bahkan kami adalah orang orang yang kena sihir” maksudnya itu bukan realita, tapi sebuah bentuk sihir. Suatu kaum yang sudah sedemikian level pengingkaran mereka, maka sudah tentu sulit diinginkan dan diharapkan (keimanannya)"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّمَا سُكِّرَتۡ) innamaa sukkirat : “Sesungguhnya telah dikaburkan” tertutup, sebagaimana يسكر النهر أو الباب: yaitu, sungai atau pintu yang tertutup. Makna ayat: Terus naik-turun selama waktu siang, niscaya merka berkata sedangkan mereka sudah berada di langit, (إِنَّمَا سُكِّرَتۡ أَبۡصَٰرُنَا) “Sesungguhnya mata kami telah ditutupi.” Tertahan dari pengelihatan yang sebenarnya, kami tidak melihat malaikat, tidak pula langit (بَلۡ نَحۡنُ قَوۡمٞ مَّسۡحُورُونَ) “Bahkan kami telah disihir.” Sehingga kami melihat sesuatu yang tidak nyata."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 15",
    "description": "Mereka tentulah tidak akan beriman, bahkan mereka akan berkata, sesungguhnya pandangan kamilah yang dikaburkan dan ditutupi, bahkan kami adalah orang yang terkena sihir Muhammad dan apa yang kami lihat bukanlah sesuatu yang nyata. Perkataan mereka menunjukkan betapa kuat pengingkaran mereka terhadap tanda-tanda kekuasaan Allah. Begitu banyak bukti kekuasaan Allah yang dapat mereka saksikan, tetapi kaum kafir tetap tidak mau mengambil pelajaran darinya. Allah berfirman, dan sungguh, kami telah menciptakan gugusan bintang di langit yang membuktikan kekuasaan kami, dan kami telah menjadikannya indah bagi orang yang memandang-Nya."
  }
]