[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan diantara bukti kuasa kami, sesungguhnya kami telah menjadikan pada langit dunia tempat-tempat beredar planet-planet yang akan berputar padanya, dan dengan itu diketahui cara mencari petunjuk jalan-jalan dan waktu-waktu, musim subur dan musim kekeringan. Dan kami telah menghiasai langit dengan bintang-bintang bagi orang-orang yang melihatnya, memperhatikan dan kemudian mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Sungguh Kami telah menjadikan bintang-bintang besar di langit yang manusia menjadikannya sebagai rambu-rambu mereka dalam perjalanan di kegelapan-kegelapan malam di daratan dan di lautan, Kami menjadikannya sebagai hiasan bagi orang-orang yang memperhatikan agar mereka menjadikannya sebagai bukti atas kemahakuasaan Allah -Subḥānahu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16-18. Allah bersumpah untuk menegaskan penjelasan besarnya kuasa Allah dalam menciptakan dan luasnya pemberian-Nya bagi para makhluk-Nya: Sungguh Kami telah membuat orbit-orbit bagi bintang dan planet-planet di langit, dan Kami hiasi langit bagi orang yang mampu melihat dan berfikir tentang keagungan Sang Pencipta, serta Kami menjaga langit dunia dari segala setan yang dijauhkan dari rahmat Allah, sedangkan setan yang mencuri kabar berita dari langit maka akan dilempari batu api sehingga dia terbakar. Istri Nabi, ‘Aisyah berkata, aku mendengar Rasulullah bersabda: “Para malaikat turun ke awan dan menyebutkan perkara yang telah ditetapkan di langit, namun setan mencuri-curi pembicaraan sehingga dia mendengar perkara tersebut, kemudian dia menyampaikannya kepada para dukun, namun para dukun itu menambahkan seratus kedustaan yang mereka buat dalam menyampaikan perkara yang akan terjadi itu.” (Shahih al-Bukhari 6/350-351, kitab permulaan penciptaan, bab malaikat, no. 3210. Shahih Muslim, kitab salam, bab haramnya perdukunan 4/1750 no. 2228)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. وَلَقَدْ جَعَلْنَا فِى السَّمَآءِ بُرُوجًا (Dan sesungguhnya Kami telah menciptakan gugusan bintang-bintang (di langit)) Makna (البروج) yakni gugusan bintang-bintang yang beredar, yang berjumlah dua belas. Pengetahuan tentang tempat-tempat bintang merupakan salah satu ilmu yang sangat penting, karena digunakan sebagai penunjuk jalan dan waktu. Dua belas gugusan ini adalah Aries, Taurus, Gemini, Cancer, Leo, Virgo, Libra, Scorpio, Sagittarius, Capricon, Aquarius, dan Pisces. وَزَيَّنّٰهَا لِلنّٰظِرِينَ(dan Kami telah menghiasi langit itu bagi orang-orang yang memandang(nya)) Dan keindahan langit yang dihiasi bintang-bintang merupakan sesuatu yang maklum bagi semua orang. Atau maknanya adalah keindahan ini hanyalah bagi orang-orang yang mentafakkurinya dan menjadikannya sarana untuk mengambil pelajaran tentang kekuasaan Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Sesungguhnya Kami telah menciptakan gugusan bintang-bintang di langit juga dua belas gugusan bintang yang masyhur. Kami telah menghiasi langit itu bagi orang-orang yang memandangnya,"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menciptakan gugusan bintang di langit} bintang-bintang yang besar {dan menjadikannya terasa indah bagi orang-orang yang memandang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Allah berfirman dalam rangka menjelaskan kesempurnaan kekuasaan dan rahmatNya kepada para makhlukNya “dan sesungguhnya kami telah menciptakan gugusan bintang bintang (dilangit)” bintang bintang bagaikan menara dan symbol yang besar dipakai sebagai (kompas) penunjuk arah pada kegelapan didaratan dan dilautan. ”dan kami telah menghiasi langit itu bagi orang orang yang memandang (nya)” karena kalau tidak ada bintang bintang, maka langit tidak mempunyai pemandangan memikat dan bentuk yang mengagumkan. Hal ini termasuk fenomena yang mengundang perenungan bagi orang orang yang menyaksikan dan pencermatan terhadap makna makna yang dikandungnya serta (mengantarkannya) mencari petunjuk menuju penciptanya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فِي ٱلسَّمَآءِ بُرُوجٗا) fis samaai buruujaa : “dilangit gugusan bintang” bintang-bintang yang dilewati oleh matahari dan bulan. Makna ayat: Firman-Nya ta’ala : (وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا) “Dan sungguh telah Kami jadikan di langit gugusan bintang” bintang-bintang yaitu tempat beredar matahari dan bulan, sehingga dengannya diketahui perhitungan hari dan tahun. Firman-Nya : (وَزَيَّنَّٰهَا) “dan Kami menghiasinya” yaitu langit dengan bintang (لِلنَّٰظِرِينَ) “bagi yang melihatnya.” Yaitu manusia. Pelajaran dari ayat: • Penjelasan tanda-tanda kekuasaan Allah ta’ala, ilmu, hikmah, dan rahmat-Nya, seperti yang terdapat pada ayat-ayat, termasuk dalam hal ini juga, dimulai dari firman-Nya : (وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا) hingga ayat ke-tujuh dari pembahasan yang mulia ini."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 16: Dalam ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala menerangkan tentang sempurnanya kekuasaan-Nya dan rahmat-Nya kepada makhluk-Nya. Demikian pula tanda-tanda yang besar yang dipakai petunjuk jalan bagi musafir di kegelapan malam baik di darat maupun lautan. Dengan bintang-bintang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 16",
    "description": "Begitu banyak bukti kekuasaan Allah yang dapat mereka saksikan, tetapi kaum kafir tetap tidak mau mengambil pelajaran darinya. Allah berfirman, dan sungguh, kami telah menciptakan gugusan bintang di langit yang membuktikan kekuasaan kami, dan kami telah menjadikannya indah bagi orang yang memandang-Nya. Dan selain itu, kami menjaganya, yakni langit, dari setiap gangguan setan yang terkutuk, ."
  }
]