[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami menjaga langit dari setiap setan terkutuk yang telah terusir dari rahmat Allah, agar ia tidak dapat mencapainya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Kami menjaga langit dari semua setan yang terusir dari rahmat Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Kami menjaga langit dari tiap-tiap syaitan yang terkutuk dengan hantaman batu, ketika mereka mencoba mencuri pendengaran dari rahasia langit, baik wahyu maupun lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjaganya} Kami menjaga langit {dari setiap setan yang terkutuk} dijauhkan dari rahmat Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. “dan kami menjaganya dari tiap tiap setan yang terutuk” saat dia mencuri pendengaran, niscaya sulut api yang berpijar mengejarnya. Dari luar, langitpun terlihat berhiaskan bintang bintang yang bersinar. Dan bagian dalamnya, terpelihara dan terhindar dari berbagai kehancuran."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (شَيۡطَٰنٖ رَّجِيمٍ ) syaithaanir rajiim : dilempar dengan api. Makna ayat: Firman-Nya : (وَحَفِظۡنَٰهَا) “Dan Kami menjaganya” langit dunia (مِن كُلِّ شَيۡطَٰنٖ رَّجِيمٍ) “dari setiap setan yang terkutuk.” Terusir lagi terlaknat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 17: Yakni dengan meteor. Oleh karena itu, apabila setan-setan hendak mencuri berita dari langit, maka mereka dilempari meteor, sehingga langit pun luarnya nampak indah dengan bintang-bintang yang bercahaya, dan dalamnya terjaga dari malapetaka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 17",
    "description": "Dan selain itu, kami menjaganya, yakni langit, dari setiap gangguan setan yang terkutuk, kecuali setan yang terus-menerus berupaya keras mencuri-curi berita yang dapat didengar dari malaikat lalu dikejar oleh semburan api yang terang."
  }
]