[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kecuali setan mencuri-curi pendengaran dari ucapan para penghuni mala’il a’la (majelis tertinggi para malaikat) pada sebagian waktu, lalu ia akan tertangkap dan dikejar oleh bintanng bercahaya terang yang akan membakarnya. Dan terkadang setan membisikan kepada temannya sebagian berita yang dicurinya sebelum bola api membakarnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Kecuali setan yang berusaha mencuri pendengaran dari para Malaikat, namun ia terkena lemparan bola api yang membakarnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. إِلَّا مَنِ اسْتَرَقَ السَّمْعَ فَأَتْبَعَهُۥ شِهَابٌ مُّبِينٌ (kecuali syaitan yang mencuri-curi (berita) yang dapat didengar (dari malaikat) lalu dia dikejar oleh semburan api yang terang) Kami menjaga langit dari para setan agar tidak mendengar suatu wahyu atau yang lainnya, dan jika ada yang hendak mencuri-curi pendengaran maka ia akan dikejar oleh api sehingga ia akan mati atau terluka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Kecuali syaitan yang mencuri-curi berita yang dapat didengar dari malaikat, lalu dia dikejar dan dibakar oleh semburan api yang terang dan menyala"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{kecuali yang mencuri} mencuri {sesuatu yang didengar, lalu dia dikejar} lalu dia diikuti dan dikejar {oleh bintang-bintang} bintang-bintang bercahaya yang membara {yang terang} yang tampak jelas dilihat oleh penduduk bumi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. “kecuali setan yang mencuri curi (berita) yang dapat didengar (dari malaikat)” maksudnya (kecuali) pada sebagian waktu terkadang setan setan berhasil mencuri curi pendengaran dengan sembunyi sembunyi dan licik “lalu ia dikejar oleh semburan api yang terang” yaitu yang terang memancar, akan membunuh atau mengikatnya. kadang kadang semburan api menangkapnya sebelum bisa mentransfernya ke para pemujanya, sehingga beritanya terputus dari bumi. Dan suatu waktu dia mampu menyampaikannya kepada mitranya, sebelum semburan api mengenainya. ia menyampaikannya kepada mitranya, sebelum semburan api mengenainya. Ia menyampaikannya dan menambahkan bersamanya seratus buah kedustaan serta menjadikan kalimat yang didengar dari langit sebagai petunjuk baginya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (شِهَابٞ مُّبِينٞ) syihaabum mubiin : “nyala api yang terang” bintang yang dilemparkan kepada setan, kemudian membakarnya, atau merobek, atau merusaknya. Makna ayat: Firman-Nya : (إِلَّا مَنِ ٱسۡتَرَقَ ٱلسَّمۡعَ) “Kecuali sebagian dari mereka yang mencuri dengar” kecuali setan-setan yang menaiki langit untuk mencuri berita dari para malaikat, lalu turun mengkabarkannya kepada wali mereka berupa para dukun dari kalangan manusia (فَأَتۡبَعَهُۥ شِهَابٞ) “maka ia akan dikejar oleh semburan” dari api (مُّبِينٞ) memberikan bekas kepada setan tersebut, dengan melukainya, merusaknya, atau membakarnya. Ayat-ayat ini, yaitu firman-Nya ta’ala : (وَلَقَدۡ جَعَلۡنَا فِي ٱلسَّمَآءِ بُرُوجٗا)... hingga akhir pembahasan yang panjang ini, dimaksudkan untuk menunjukkan kekuasaan Allah ta’ala, ilmu, hikmah, dan rahmat-Nya, yang semua ini adalah dasar dari diutusnya para Rasul dan diturunkannya kitab, untuk memberikan manusia petunjuk agar hanya beribadah kepada Rabb mereka, mereka bisa mendapatkan kesempurnaan dan kebahagiaan di dunia dan di akhirat, namun orang-orang yang mendustakan tidak mengetahuinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 18: Terkadang setan mencuri berita di langit, lalu dikejar oleh meteor yang akan membakarnya, melobanginya atau mencakarnya. Jika ia lolos (tidak kena), maka setan tersebut akan menyampaikan ke telinga wali-walinya, yang terdiri dari dukun, peramal atau paranormal, lalu walinya menggabungkan seratus kedustaan terhadap berita yang benar, demikianlah yang diterangkan dalam hadits yang shahih. Agar kata-katanya dibenarkan, maka ia (dukun) menggunakan berita yang diperoleh dari setan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 18",
    "description": "Kecuali setan yang terus-menerus berupaya keras mencuri-curi berita yang dapat didengar dari malaikat lalu dikejar oleh semburan api yang terang. Usai menyebut tanda kekuasaan-Nya di langit, Allah lalu beralih menyebut tanda kekuasaan-Nya di bumi. Allah menyatakan, dan kami telah menghamparkan bumi sebagai pijakan bagi manusia, dan kami pancangkan padanya gunung-gunung yang kukuh sebagai pasak bagi bumi agar tidak roboh dan berguncang sehingga manusia menjadi aman, serta kami ciptakan dan tumbuhkan di sana segala sesuatu, seperti tumbuhan yang beragam, menurut ukuran yang seimbang dan tepat; semuanya demi kemaslahatan makhluk-Nya."
  }
]