[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan bumi kami lapangkan dengan luas, dan kami tancapkan padanya gunung-gunung yang akan meneguhkannya, dan kami tumbuhkan padanya segala jenis tanaman yang telah ditakdirkan lagi diketahui termasuk yang dibutuhkan oleh umat manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Kami membentangkan bumi agar manusia tinggal di atasnya. Kami menjadikan padanya gunung-gunung yang kokoh agar manusia bisa hidup stabil di atas bumi. Kami menumbuhkan di bumi berbagai macam tanaman yang telah ditetapkan dan ditentukan sesuai dengan tuntutan hikmah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19-21. Dan Kami hamparkan dan luaskan bumi; dan Kami ciptakan di dalamnya gunung-gunung yang kokoh, Kami tumbuhkan berbagai jenis tumbuhan dengan terukur, teratur, dan detail. Dan Kami ciptakan di dalamnya segala yang kalian butuhkan untuk hidup berupa makanan, minuman, dan makhluk lainnya yang rezekinya bukan kalian yang menanggungnya, namun Allah yang memberi mereka rezeki. Dan tidaklah semua rezeki dan maslahat seluruh makhluk melainkan di sisi Kami perbendaharaannya, dan Kami tidak menurunkannya melainkan sesuai dengan kebutuhan dan kemaslahatan yang telah terukur."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. وَالْأَرْضَ مَددْنٰهَا (Dan Kami telah menghamparkan bumi) Yakni Kami hamparkan dan luaskan. وَأَلْقَيْنَا فِيهَا رَوٰسِىَ (dan menjadikan padanya gunung-gunung) Yakni gunung-gunung yang kokoh. وَأَنۢبَتْنَا فِيهَا مِن كُلِّ شَىْءٍ مَّوْزُونٍ (dan Kami tumbuhkan padanya segala sesuatu menurut ukuran) Yakni Kami menumbuhkan segala sesuatu di bumi dengan ukuran yang pasti. Dan pendapat lain mengatakan yakni dengan pertimbangan hikmah sesuai dengan kebutuhan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Kami telah menghamparkan bumi dan menjadikan di atasnya gunung-gunung yang menancap agar penduduk bumi tidak mengalami goncangan. Kami juga tumbuhkan berbagai tumbuhan dan tanaman di atasnya menurut ukuran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami telah menghamparkan bumi} menghamparkannya {dan Kami menancapkan padanya gunung-gunung} gunung-gunung yang teguh {dan menumbuhkan di sana segala sesuatu menurut ukuran} ukuran yang diketahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. “dan kami telah menghamparkan bumi” maksudnya kami melapangkan bumi sedemikian luasnya, supaya manusia dang bangsa binatang dapat menelusuri sampai penjuru penjurunya dan mengais rizki rizkinya dan tinggal disudut sudutnya. ”dan menjadikan padanya gunung gunung” yaitu gunung gunung yang besar yang menaga (keseimbangan) bumi dengan izin Allah (dari goncangan) agar memancangkan dan mengokohkannya sehingga tidak hancur “dan kami tumbuhkan padanya segala sesuatu menurut ukuran” yang bermanfaat lagi berharga, (sehingga) manusia dan tanah pasti membutuhkannya berupa pohon kurma, anggur, dan bermacam macam pohon dan beraneka ragam tanaman serta bahan tambang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَٱلۡأَرۡضَ مَدَدۡنَٰهَا) walardha madadnaahaa : “Dan bumi Kami lebarkan.” membentangkannya (وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ) wa alqainaa fiihaa rawaasii : “dan Kami letakkan di atasnya gunung-gunung.” Gunung-gunung yang kokoh, agar bumi tidak berguncang. (مَّوۡزُونٖ) mauzuun : “sesuai dengan ukuran.” Dengan ukuran yang telah ditentukan Allah ta’ala. Makna ayat: Pembahasan ayat masih menyebutkan berbagai tanda-tanda kekuasaan Allah, ilmu, hikmah, dan rahmat-Nya yang berkonsekuensi keimanan kepada-Nya, mempersembahkan ibadah, tauhid, dan taqarrub kepada-Nya dengan melakukan apa yang dicintai-Nya dan menjauhi apa yang dimurkai-Nya. Firman-Nya : (وَٱلۡأَرۡضَ مَدَدۡنَٰهَا) “dan Kami bentangkan bumi.” Kami membentangkannya (وَأَلۡقَيۡنَا فِيهَا رَوَٰسِيَ) “dan Kami letakkan di atasnya gunung-gunung” yang kokoh menancap di dalam bumi, sehingga bumi tidak bergerak atau mengguncang penghuninya sehingga mereka binasa. (وَأَنۢبَتۡنَا فِيهَا مِن كُلِّ شَيۡءٖ مَّوۡزُونٖ) “dan Kami tumbuhkan di dalamnya segala sesuatu sesuai dengan ukuran.” Dengan kadar yang telah Allah ta’ala tentukan. Pelajaran dari ayat 19-25: • Penjelasan bukti kekuasaan Allah, ilmu, hikmah, dan rahmat-Nya yang bergitu nampak sebagai berikut: o Penciptaan bumi, peluasan, dan penempatan gunung-gunung. o Mengutus angin untuk menggabungkan awan. o Menumbuhkan tanaman dengan keseimbangan yang teliti. o Menghidupkan makhluk kemudian mematikannya. o Turunnya hujan dengan kadar yang telah ditentukan. o Allah mengetahui siapa saja yang sudah mati, dan yang akan mati nanti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 19: Yakni Kami luaskan agar manusia dan hewan seluruhnya dapat tinggal di berbagai belahan bumi dan memperoleh rezekinya. Yakni gunung-gunung yang kokoh lagi menancap agar tidak mengguncangkan penduduknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 19",
    "description": "Usai menyebut tanda kekuasaan-Nya di langit, Allah lalu beralih menyebut tanda kekuasaan-Nya di bumi. Allah menyatakan, dan kami telah menghamparkan bumi sebagai pijakan bagi manusia, dan kami pancangkan padanya gunung-gunung yang kukuh sebagai pasak bagi bumi agar tidak roboh dan berguncang sehingga manusia menjadi aman, serta kami ciptakan dan tumbuhkan di sana segala sesuatu, seperti tumbuhan yang beragam, menurut ukuran yang seimbang dan tepat; semuanya demi kemaslahatan makhluk-Nya. Dan selain itu, kami pun telah menjadikan padanya sumber-sumber dan sarana-sarana kehidupan untuk keperluanmu, wahai manusia, baik berupa sandang, pangan, maupun papan. Dan kami ciptakan pula beragam makhluk-makhluk yang bukan kamu pemberi rezekinya, melainkan kami-lah yang menanggungnya."
  }
]