[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir akan berandai-andai ketika mereka melihat keluarnya para pelaku maksiat dari kalangan orang-orang mukmin dari neraka, sekiranya mereka dahulu juga bertauhid kepada Allah agar dapat keluar sebagaimana mereka keluar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Orang-orang kafir pada hari Kiamat akan berangan-angan seandainya mereka dulu adalah orang-orang Islam saat perkara menjadi jelas bagi mereka, dan kebatilan perbuatan kufur yang mereka lakukan di dunia telah terbukti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Mungkin orang-orang kafir akan berharap seandainya mereka dahulu beriman kepada Allah, ketika mereka telah melihat kerasnya azab pada hari kiamat, karena orang-orang beriman dapat masuk surga dan sebagian lain dapat keluar dari neraka melalui syafaat. Shalih bin Abi Tharif berkata, aku bertanya kepada Abu Sa’id al-Khudri: “Apakah kamu pernah mendengar Rasulullah menjelaskan ayat (ربما يود الذين كفروا لو كانوا مسلمين) ?” Dia menjawab, “Ya, aku pernah mendengar Rasulullah bersabda: Allah mengeluarkan sebagian orang-orang beriman dari neraka setelah memberi balasan atas dosa mereka.” Beliau melanjutkan: “Ketika Allah memasukkan mereka ke neraka bersama orang-orang musyrik, maka orang-orang musyrik itu berkata: ‘Bukankah kalian di dunia berkata kalian adalah para kekasih Allah, tapi mengapa kalian sekarang di neraka bersama kami?’ Allah mendengar perkataan mereka sehingga mengizinkan syafaat bagi mereka. Maka para malaikat dan para nabi memberi syafaat bagi mereka sehingga mereka dapat keluar dari neraka dengan izin Allah. Ketika mereka keluar dari neraka, orang-orang musyrik berkata: ‘Andai saja kami dahulu beriman seperti mereka, sehingga kami mendapat syafaat dan keluar dari neraka.’ Itulah makna firman Allah(ربما يود الذين كفروا لو كانوا مسلمين) Rasulullah melanjutkan: “Maka orang-orang yang telah keluar dari neraka itu mendapat sebutan ‘jahannamy’ karena mereka memiliki bekas hitam di wajah mereka. Maka mereka berdoa: ‘Ya Tuhan kami, hilangkanlah sebutan ini dari kami’. Maka Allah memerintahkan mereka untuk mandi di sungai yang ada di surga, sehingga bekas hitam itu dapat hilang.” (al-Ihsan 16/457-458 no. 7432, pentahqiq kitab ini berkata, hadits ini shahih dan memiliki banyak penguat, di antaranya hadits Abu Musa al-Asy’ari yang diriwayatkan Imam al-Hakim 2/242 yang dishahihkan dan disepakati Imam ad-Dzahabi dan sanadnya dishahihkan al-Albani dalam Dhilal al-Jannah no. 844. Lihat periwayatan beserta penguat-penguatnya secara detail dalam catatan kaki kitab al-Ihsan dalam halaman tersebut)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. رُّبَمَا يَوَدُّ الَّذِينَ كَفَرُوا۟ لَوْ كَانُوا۟ مُسْلِمِينَ (Orang-orang yang kafir itu seringkali (nanti di akhirat) menginginkan, kiranya mereka dahulu (di dunia) menjadi orang-orang muslim) Yakni setelah tersingkap bagi mereka kebenaran, dan jelas bagi mereka kebatilan dari kekafiran mereka, dan agama di sisi Allah adalah Islam, mereka lalu berangan-angan andai saja mereka dahulu masuk agama Islam. Akan tetapi angan-angan mereka hanya menjadi penyesalan terhadap diri mereka atas kelalaiannya dalam menjalankan kewajiban kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Orang-orang yang kafir itu kelak di akhirat seringkali menginginkan bahwa kiranya mereka dahulu ketika di dunia menjadi orang-orang muslim yang senantiasa berserah diri kepada Allah dan beriman kepada Alquran. Kata rubama di sini digunakan untuk menunjukkan arti kebanyakan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang kafir itu menginginkan} berharap {mereka dahulu menjadi orang-orang muslim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. ini merupakan salah satu faktor yang mengharuskan para makhluk untuk tunduk patuh kepadaNya, berserah diri terhadap hukumNya, dan menanggapinya dengan tangan terbuka, riang dan gembira. Sedangkan orang yang menyikapi nikmat agung ini dengan menampik dan mengingkarinya, maka dia termasuk orang orang yang mendustakan lagi sesat. Mereka akan kedatangan satu waktu, yang nantinya mereka akan berandai andai untuk menjadi orang orang muslim. maksudnya, tunduk patuh kepada hukum hukumNya. peristiwa itu terjadi tatkala tabir penutup tersingkap dan tanda tanda datangnya hari akhirat serta gejala gejala permulaan tibanya ajal tampak. Saat berada dalam suasana akhirat kelak, mereka berharap menjadi orang orang yang berserah diri, namun kesempatan sudah hilang. tapi memang mereka di dunia ini, tertipu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (يَوَدُّ) yawaddu : ”mengharapkan” mencintai dan mengharapkan seandainya ia termasuk orang-orang Islam. Makna ayat : Firman-Nya : (رُّبَمَا يَوَدُّ ٱلَّذِينَ كَفَرُواْ لَوۡ كَانُواْ مُسۡلِمِينَ) “Orang kafir terkadang menginginkan untuk menjadi orang Islam.” Allah ta’ala mengkabarkan, bahwa suatu hari nanti, hari kiamat, ketika orang-orang kafir melihat orang Islam memasuki surga, sedangkan ia memasuki neraka, ia berharap kala itu seandainya ia termasuk dari orang Islam, dan Allah terkadang menceritakan kejadian-kejadian atau perkara di dunia yang terkadang orang kafir berharap seandainya mereka menjadi orang Islam. Pelajaran dari ayat : - Peringatan bagi orang kafir dan ancaman seandainya mereka terus berada di atas kekufuran dan memerangi Islam, kelak suatu hari nanti mereka akan berangan-angan seandainya mereka termasuk dari orang Islam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 2: Bisa juga diartikan sering. Pada hari kiamat, ketika mereka menyaksikan keadaan mereka dan keadaan kaum muslimin, atau ketika datang awal-awal akhirat, dan pengantar kepada kematian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 2",
    "description": "Orang kafir itu suatu saat nanti setelah berada di akhirat kelak kadangkadang menginginkan sekiranya mereka dahulu ketika di dunia menjadi orang muslim. Wahai nabi Muhammad dan kaum muslim, apabila mereka tetap keras pada pendiriannya, biarkanlah mereka di dunia ini makan dan bersenang-senang dan terus dilalaikan oleh angan-angan kosong mereka dari beriman, mengikuti dakwahmu, dan hal-hal penting lainnya. Kelak mereka akan mengetahui akibat perbuatan buruk yang pernah mereka lakukan."
  }
]