[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah menjadikan bagi kalian di dalamnya semua yang kalian perlukan dalam hidup, seperti bahan tambang, bebatuan dan lain-lain, dan kami ciptakan bagi kalian keturunan, pelayan-pelayan dan binatang-binatang ternak yang dapat kalian manfaatkan. Rizki kalian bukanlah tanggungan kalian, akan tetapi tanggungan Allah, penguasa sekalian alam sebagai karunia dan kemurahan dariNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Kami menjadikan bagi kalian -wahai manusia- di bumi apa yang menopang hidup kalian berupa makanan dan minuman selama kalian hidup di dunia. Dan Kami menjadikan untuk selain kalian dari manusia (budak-budak) dan hewan yang kalian tidak memberi mereka rezeki apa pun yang menopang hidup mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَجَعَلْنَا لَكُمْ فِيهَا مَعٰيِشَ (Dan Kami telah menjadikan untukmu di bumi keperluan-keperluan hidup) Berupa makanan dan minuman agar menjadi penghidupanm kalian. Pendapat lain mengatakan yakni pekerjaan yang menjadi pintu-pintu rezeki sepanjang hidup. وَمَن لَّسْتُمْ لَهُۥ بِرٰزِقِينَ(dan (Kami menciptakan pula) makhluk-makhluk yang kamu sekali-kali bukan pemberi rezeki kepadanya) Yakni dan Kami ciptakan makhluk yang kalian bukanlah pemberi rezekinya, ia adalah manusia selain kalian dan hewan-hewan dengan berbagai jenisnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Kami telah menjadikan untukmu di bumi segala keperluan agar tetap hidup, berupa makanan, minuman, pakaian dan tempat tinggal. Kami juga menciptakan makhluk-makhluk yang kamu sekali-kali bukan pemberi rezeki kepada mereka yaitu para keluarga, pelayan, dan hewan melata. Sesungguhnya Allah itu Maha Pemberi Rejeki kepada semuanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami telah menjadikan di sana sumber-sumber kehidupan} sesuatu yang bisa kalian gunakan untuk bertahan hidup berupa makanan, minuman dan pakaian {untuk kalian dan kepada makhluk yang bukan kalian pemberi rezekinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. “dan kami telah menjadikan untukmu di bumi keperluan keperluan hidup” berupa lahan pertanian dan hewan ternak juga beragam penghidupan dan kerajinan, ”dan (kami menciptakan pula) makhluk makhluk yang kamu sekali kali bukan pemberi rizki kepadanya” kami memberikan anugerah kepada kalian berupa budak belian laki laki dan perempuan, dan binatang ternak untuk kepentingan dan kebaikan kalian. Rizki mereka bukan menjadi tanggungan kalian. Allah lah yang menyuguhkannya ke pada kalian dan menjamin rizki rizkinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مَعَٰيِشَ) ma’aayisy : “sumber-sumber kehidupan” bentuk jamak dari ma’isyah yaitu kebutuhan manusia berupa pangan. (وَمَن لَّسۡتُمۡ لَهُۥ بِرَٰزِقِينَ) wa man lastum lahuu bi raaziqiin : “yang bukan kalian pemberi rizkinya.” Seperti budak laki-laki dan perempuan, dan hewan ternak. Makna ayat: Firman-Nya : (وَجَعَلۡنَا لَكُمۡ فِيهَا مَعَٰيِشَ) “dan Kami jadikan didalamnya sumber-sumber kehidupan.” Yang manusia hidup dengannya, berupa biji-bijian, buah, dan semacamnya. Firman-Nya : (وَمَن لَّسۡتُمۡ لَهُۥ بِرَٰزِقِينَ) “dan bagi makhluk-makhluk yang bukan kalian pemberi rizkinya.” Namun Allah ta’ala yang memberikannya rizki, begitu juga dengan kalian, contoh lainnya; budak laki-laki ataupun perempuan dan hewan ternak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 20: Seperti sawah-ladang, hewan ternak dan berbagai pekerjaan. Untuk keperluan kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 20",
    "description": "Dan selain itu, kami pun telah menjadikan padanya sumber-sumber dan sarana-sarana kehidupan untuk keperluanmu, wahai manusia, baik berupa sandang, pangan, maupun papan. Dan kami ciptakan pula beragam makhluk-makhluk yang bukan kamu pemberi rezekinya, melainkan kami-lah yang menanggungnya. Dan tidak ada sesuatu pun dari makhluk ciptaan Allah di langit dan bumi melainkan pada sisi kamilah khazanahnya. Kami yang menguasai, mengatur, dan membagi rezekinya sesuai kehendak dan ketentuan kami. Kami tidak menurunkannya kepada mereka melainkan dengan ukuran tertentu, yakni sesuai kondisi, kebutuhan, dan keadaan mereka masing-masing."
  }
]