[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah ada sesuatu yang bermanfaat bagi hamba-hamba kecuali di sisi kami tempat penyimpanan perbendaharaannya dari seluruh jenisnya, dan kami tidak menurunkannya kecuali dengan ukuran yang telah ditentukan sebagaimana kami kehendaki dan kami inginkan. jadi tempat perbendaharaan itu adalah di tangan Allah Dia memberikannya kepada siapa saja yang dikehendakiNya dan menghalangi darinya siapasaja yang dikehendakiNya, sesuai dengan rahmarNya yang luas dan hikmahNya yang luhur."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Tidak ada sesuatu yang bermanfaat bagi manusia dan hewan-hewan kecuali Kami berkuasa mengadakannya dan membuat manusia memanfaatkannya. Kami tidak mengadakan apa yang Kami adakan dari semua itu kecuali dengan kadar yang ditentukan sesuai dengan tuntutan hikmah dan kehendak Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. وَإِن مِّن شَىْءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ (Dan tidak ada sesuatupun melainkan pada sisi Kami-lah khazanahnya) Yakni segala kekayaan berada dalam kekuasaan dan kepemilikan Allah, Allah menjadikannya dari keadaan tidak ada menjadi ada sesuai dengan takaran yang Dia kehendaki. وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٍ مَّعْلُومٍ(dan Kami tidak menurunkannya melainkan dengan ukuran yang tertentu) Yakni Kami menurunkan atau menciptakannya dari langit ke bumi bagi para makhluk sesuai dengan kebutuhan makhluk-makhluk itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Tidak ada sesuatupun, baik itu rizki atau kemanfaatan melainkan itu semua dari sisi Kami-lah gudang rizki. Kami Maha Kuasa menurunkan dan mengadakannya dari ketidakadaan. Kami tidak menurunkannya melainkan dengan ukuran yang tertentu, sesuai kebutuhan para hamba dan kesesuaian hikmah yang diturunkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidak ada sesuatu pun} tidak ada sesuatu {melainkan di sisi Kamilah perbendaharaannya dan Kami tidak menurunkannya melainkan dengan ukuran tertentu} tertentu sesuai ketentuannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. maksudnya, seluruh rizki dan macam macam takdir, tidak ada seorangpun yang mengendalikannya kecuali Allah. perbendaharaan kekayaan ada di tanganNya, Allah memberi kepada orang yang dikehendaki dan menahan (rizki) dari orang yang dikehendakiNya, tergantung pada sifat hikmah dan rahmatNya yang luas. ”dan kami tidak menurunkannya” yaitu seluruh perkara yang telah ditetapkan, misalnya hujan dan lainnya, ”melainkan dengan ukuran tertentu” sehingga tidak melebihi kapasitas yang telah ditentukan Allah dan tidak pula menyusut darinya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَمَا نُنَزِّلُهُۥٓ إِلَّا بِقَدَرٖ مَّعۡلُومٖ) wa maa nunazziluhuu illaa biqadarimma’luum : “dan tidaklah Kami menurunkannya kecuali dengan batas yang telah diketahui.” Yaitu hujan. Makna ayat: Firman-Nya (وَإِن مِّن شَيۡءٍ إِلَّا عِندَنَا خَزَآئِنُهُۥ ) “Dan tidak ada sesuatupun melainkan pada sisi Kami-lah khazanahnya, Kami tidak menurunkannya kecuali dengan ukuran tertentu.” Tidak ada sesuatupun yang bermanfaat bagi manusia, yang dibutuhkan oleh mereka untuk kelangsungan hidup mereka, kecuali Allah lah pemiliknya seperti, hujan, namun Dia menurunkannya sesuai dengan kadar yang ditentukan sesuai kebutuhan dan maslahat makhluk, seperti firman-Nya : (بيده الخير وهو على كل شيئ قدير), firman-Nya (۞وَلَوۡ بَسَطَ ٱللَّهُ ٱلرِّزۡقَ لِعِبَادِهِۦ لَبَغَوۡاْ فِي ٱلۡأَرۡضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٖ مَّا يَشَآءُۚ إِنَّهُۥ بِعِبَادِهِۦ خَبِيرُۢ بَصِيرٞ )."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 21: Termasuk rezeki. Semuanya milik Allah, di Tangan-Nya perbendaharaan-perbendaharaannya, Dia memberi kepada siapa yang Dia kehendaki dan menghalangi siapa yang Dia kehendaki sesuai hikmah-Nya dan rahmat-Nya yang luas. Termasuk pula hujan. Sesuai yang ditentukan Allah, tidak lebih dan tidak kurang."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 21",
    "description": "Dan tidak ada sesuatu pun dari makhluk ciptaan Allah di langit dan bumi melainkan pada sisi kamilah khazanahnya. Kami yang menguasai, mengatur, dan membagi rezekinya sesuai kehendak dan ketentuan kami. Kami tidak menurunkannya kepada mereka melainkan dengan ukuran tertentu, yakni sesuai kondisi, kebutuhan, dan keadaan mereka masing-masing. Dan hal lain yang membuktikan kekuasaan kami adalah bahwa kami telah meniupkan angin untuk mengawinkan butir-butir awan dan dari hasil perkawinan itu, kami turunkan hujan dari langit, lalu kami beri minum kamu sekalian, tumbuh-tumbuhan, dan hewan dengan air itu, dan bukanlah kamu, melainkan kami-lah, yang menyimpan dan menguasainya."
  }
]