[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah menghembuskan angin dan menundukannya untuk membentuk awan dan membawa air hujan, menyemaikan pepohonan, lalu dedaunannya dan kelopak buahnya mekar, juga membawa hujan, hal-hal yang baik dan yang berguna. Kemudian kami menurunkan dari awan itu air yang kami sediakan bagi minuman kalian, tanah dan biantang-binatang ternak kalian. Dan kalain tidaklah dapat menyimpannya dalam gudang-gudang penyimpanan kalian, Kami lah yang menyimpannya sebagai rahmat bagi kalian dan kebajikan bagi kalain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kami hembuskan angin yang menggiring awan, lalu Kami menurunkan hujan dari awan yang sarat dengan kandungan air, Kami memberi mereka minum dari air hujan. Kalian -wahai manusia- bukan penyimpan air ini di dalam perut bumi sehingga ia menjadi mata air dan sumur, akan tetapi Allah yang menyimpannya untuk kalian."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Dan Kami kirimkan angin yang mengumpulkan awan sehingga dapat turun hujan dan yang mengawinkan pepohonan sehingga dapat berbuah. Dan Kami jadikan hujan sebagai minuman bagi kalian dan bagi tanaman dan hewan peliharaan kalian, dan kalian tidak dapat menyimpannya, namun Kami yang menyimpan air hujan itu dalam mata air, sumur, dan sungai-sungai."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَأَرْسَلْنَا الرِّيٰحَ لَوٰقِحَ (Dan Kami telah meniupkan angin untuk mengawinkan (tumbuh-tumbuhan)) Angin mengawinkan awan dengan uap-uap air sehingga ia mengandung banyak air, dan mengawinkan pepohonan sehingga dapat berbuah. فَأَسْقَيْنٰكُمُوهُ (lalu Kami beri minum kamu dengan air itu) Yakni Kami menjadikan hujan itu untuk memberi kalian minum dan sebagai minuman untuk hewan ternak kalian dan sebagai pengairan untuk tanah ladang kalian. وَمَآ أَنتُمْ لَهُۥ بِخٰزِنِينَ(dan sekali-kali bukanlah kamu yang menyimpannya) Di dalam sumur-sumur, sungai-sungai, dan mata air."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Kami telah meniupkan angin untuk mempertemukan awan sehingga mengandung air hujan sehingga menjadi hujan. Juga meniupkan angin untuk mengawinkan tumbuh, pepohonan dan bunga-bungaan. Kami turunkan hujan dari langit, lalu Kami beri minum kamu dengan air itu, juga untuk keperluan pertanian dan peternakan. Juga untuk membersihkan bumi serta cuaca. Sekali-kali bukanlah kamu yang menyimpannya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami telah meniupkan angin untuk mengawinkan} mengawinkan awan {Lalu Kami menurunkan hujan dari langit} dari awan-awan itu {lalu memberi kalian minum dengan air itu, sedangkan kalian bukanlah orang-orang yang menyimpannya} orang yang menjaganya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. maksudnya kami menundukan angin; angin (yang mendatangkan) rahmat yang membuahi awan sebagaimana bunga jantan membuahi bunga betina. Dari situ, muncullah air dengan izin Allah. Maka Allah memberi minum kepada manusia, binatang binatang ternak mereka serta (menyirami) tanah tanah mereka. Dan Dia menyisakan air dalam perut bumi sebagai simpanan untuk kebutuhan dan kepentingan mereka, sebagai implikasi kekuasaan dan rahmatNya. ”dan sekali kali bukanlah kamu yang menyimpannya” maksudnya tidak ada kemampuan atas kalian untuk menampung dan menyimpannya. Tapi Allah-lah yang menampungnya untuk kemaslahatan kalian dan memunculkan mata air- mata air di tanah sebagai cerminan rahmat dan kebaikanNYa kepada kalian."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ) wa arsalnar riyaaha lawaaqih : “dan Kami utus angin untuk mengawinkan” menggabungkan awan, hingga terisi air, sebagaimana penyerbukan yang terjadi pada tumbuhan jantan dan betina. (وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ) wa maa antum lahuu bikhaaziniin : “dan bukanlah kalian yang menyimpan.” Kalian tidak memiliki hak atas perbendaharaan ini, sehingga kalian menghalangi dan memberi kepada yang kalian kehendaki. Makna ayat: Firman-Nya : (وَأَرۡسَلۡنَا ٱلرِّيَٰحَ لَوَٰقِحَ) “dan Kami utus angin untuk mengawinkan” menggabungkan awan dengan awan, sehingga terisi air, (فَأَنزَلۡنَا مِنَ ٱلسَّمَآءِ مَآءٗ) “Dan Kami turunkan dari langit air.” Dengan kuasa dan pengaturan Kami (فَأَسۡقَيۡنَٰكُمُوهُ وَمَآ أَنتُمۡ لَهُۥ بِخَٰزِنِينَ) “Maka Kami beri minum kalian, dan bukanlah kalian yang menyimpannya.” Kalian tidak memiliki perbendaharaannya, sehingga kalian bisa menahan dan memberikan siapa saja yang kalian kehendaki, namun Allah ta’ala sang pemilik, Dia yang menurunkan hujan pada suatu bumi, dan menahan hujan pada sisi lain."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 22: Yakni mengawinkan awan dan tumbuh-tumbuhan. Dikawinkan awan oleh angin agar muncul air dengan izin Allah, dan dikawinkan tumbuh-tumbuhan agar muncul buah. Demikian pula hewan ternak mereka dan tanah mereka yang tandus, kemudian tinggallah air itu tersimpan di dalam bumi untuk keperluan mereka yang merupakan kekuasaan dan rahmat-Nya. Kamu tidak mampu menyimpannya, akan tetapi Allah yang menyimpannya untuk kamu, mengeluarkan sumber air di bumi sebagai rahmat dan ihsan-Nya kepada kamu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 22",
    "description": "Dan hal lain yang membuktikan kekuasaan kami adalah bahwa kami telah meniupkan angin untuk mengawinkan butir-butir awan dan dari hasil perkawinan itu, kami turunkan hujan dari langit, lalu kami beri minum kamu sekalian, tumbuh-tumbuhan, dan hewan dengan air itu, dan bukanlah kamu, melainkan kami-lah, yang menyimpan dan menguasainya. Usai menjelaskan tanda-tanda kekuasaan-Nya di langit dan bumi, Allah lalu menyatakan, dan ketahuilah bahwa sungguh, kamilah yang menghidupkan apa yang ada di alam, termasuk manusia, dan kami pula yang mematikan mereka, dan kami pula yang mewarisi apa saja yang ditinggalkan oleh makhluk-makhluk itu."
  }
]