[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah mengetahui orang yang akan binasa dari kalian sejak masa Adam, dan siapa orang yang hidup dan siapa yang akan datang hingga hari kiamat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Sungguh Kami mengetahui siapa di antara kalian yang lahir dan mati terlebih dahulu sebagaimana Kami mengetahui siapa di antara kalian yang lahir dan mati belakangan, tidak ada sesuatu pun yang samar bagi Kami."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. وَلَقَدْ عَلِمْنَا الْمُسْتَقْدِمِينَ مِنكُمْ وَلَقَدْ عَلِمْنَا الْمُسْتَـْٔخِرِينَ (Dan sesungguhnya Kami telah mengetahui orang-orang yang terdahulu daripada-mu dan sesungguhnya Kami mengetahui pula orang-orang yang terkemudian) Yakni Kami mengetahui siapa yang lebih dahulu lahir dan mati dan siapa yang terakhir. Imam Hasan al-Bashri berpendapat yakni siapa yang lebih dahulu dalam ketaatan kepada Allah dan siapa yang akhir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Sesungguhnya Kami telah mengetahui generasi yang terdahulu daripada kamu. Sesungguhnya Kami mengetahui pula generasi yang setelah kamu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami telah mengetahui orang-orang yang terdahulu di antara kalian dan Kami juga mengetahui orang-orang yang akan datang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23-25. Dia-lah, sat satunya, tidak ada sekutu bagiNya, yang menghidupkan para makhluk dari ketiadaan wujud, setelah sebelumnya mereka bukanlah sesuatu yang bisa disebut, Dia mewafatkan mereka sesuai dengan ajal-ajal mereka yang telah Dia tentukan. ”dan kami (pulalah yang mewarisi” seperti firmanNya ”sesungguhnya kami mewarisi bumi dan semua orang-orang yang ada di atas nya, dan hanya kepada Kami-lah mereka dikembalikan” Perkara tersebut tidaklah sulit, dan tidak mustahil bagi Allah. Sesungguhnya Allah mengetahui para makhluk yang telah berlalu dan yang akan datang, mengetahui sesuatu yang menyusut pada mereka dan bagian tubuh mereka yang tercerai berai oleh tanah. Dialah yang kekuasaanNya dalam rupa penciptaan yang baru lagi dan menghimpun mereka semua kehadapanNya. ”sesungguhnya Dia Mahabijaksana” meletakkan segala sesuatu pada tempatnya dan menempatkannya pada kedudukannya, membalas setiap pelaku perbuatan dengan dasar amalannya. Jika baik, maka (balasannya baik), bila buruk, maka (balasannya) buruk (juga)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡمُسۡتَقۡدِمِينَ مِنكُمۡ) al-mustaqdimiin minkum : “¬orang-orang terdahulu dari kalian.\" Yang telah binasa dari keturunan Adam hingga hari kalian ini, (ٱلۡمُسۡتَ‍ٔۡخِرِينَ) wal musta’khiriin : “orang-orang yang akan datang.” di antara mereka yang masih hidup, dan yang belum terlahir, hingga hari kiamat nanti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 24: Dari sejak zaman Nabi Adam ‘alaihis salam. Yakni orang-orang yang masih hidup menjelang kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 24",
    "description": "Dan sungguh, kami mengetahui orang yang terdahulu sebelum kamu, baik tentang kehidupan maupun kematian mereka, dan kami mengetahui pula orang yang terkemudian, yaitu umat pada masa sekarang dan masa mendatang. Dan ketahuilah wahai nabi Muhammad, sesungguhnya tuhanmu yang telah memberi manusia kehidupan dan berbagai kenikmatan, dialah yang akan mematikan dan mengumpulkan mereka semua di padang mahsyar. Sungguh, dia adalah tuhan yang mahabijaksana dengan menempatkan sesuatu dengan tepat, maha mengetahui segala sesuatu, besar maupun kecil, baik yang terjadi di masa lalu, masa sekarang, maupun masa mendatang."
  }
]