[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah menciptakan Adam dari tanah kering yang bila dilubangi, akan terdengar suara darinya. Tanah yang kering ini berasal dari tanah berwarna hitam yang telah berubah warna dan bunya, karena sudah ada sejak lama."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Sungguh Kami telah menciptakan Adam dari tanah kering yang bila diketuk akan mengeluarkan suara. Tanah bahan penciptaan Adam ini berwarna hitam berbau karena umurnya yang tua."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26-27. Sungguh Kami telah menciptakan Adam dari tanah kering yang terdengar suaranya jika diketuk atau digerakkan. Dan Kami ciptakan Iblis, pendahulu bangsa jin dari api yang sangat panas sebelum penciptaan Adam yang panasnya dapat menembus pori-pori sehingga dapat membunuh karena sangat panas. ‘Aisyah berkata, Rasulullah bersabda: “Malaikat diciptakan dari cahaya, jin diciptakan dari kobaran api, sedangkan Adam diciptakan dari apa yang telah disebutkan pada kalian.” (Shahih Muslim 4/2294, kitab zuhud dan kelembutan hati, bab hadits-hadits yang berbeda-beda tema, no. 2996)."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. وَلَقَدْ خَلَقْنَا الْإِنسٰنَ (Dan sesungguhnya Kami telah menciptakan manusia) Yakni Nabi Adam. Makna (الصلصال) yakni tanah yang kering, yang mengeluarkan bunyi jika digerakkan. Dan jika tanah itu kemudian dibakar dengan api maka ia disebut (الفخار). Sedangkan makna (الحمأ) yakni tanah hitam yang telah berubah. Dan (المسنون) yakni telah berubah. Tanah yang dibasahi disebut dengan (الطين), jika kemudian ia membusuk maka disebut dengan (حمأ مسنون), dan ketika telah kering maka ia menjadi (صلصال)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Sesungguhnya Kami telah menciptakan manusia (Adam) dari tanah liat kering yang bersuara ketika digerakkan, yang berasal dari lumpur hitam yang diberi bentuk."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah menciptakan manusia} Adam AS {dari tanah liat kering} tanah yang telah kering setelah dibiarkan sampai memiliki bunyi dan suara seperti bahan tembikar {dari lumpur hitam} tanah yang telah berubah warna dan aromanya setelah lama didiamkan {yang dibentuk} berubah aromanya karena lama dibiarkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “dan sesungguhnya Kami telah menciptakan manusia” yaitu adam “dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk” maksudnya dari tanah yang telah mengering setelah ditutupi, hingga memiliki bunyi dan suara bagaikan tembikar. makna yaitu tanah yang sudah berubah warna dan baunya karena sudah terlalu lama diendapkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ) wa laqad khalaqnal insaan : “Dan sungguh telah Kami ciptakan manusia” yaitu Adam ‘alaihis salam. (مِن صَلۡصَٰلٖ) min shalshaal : “Dari tanah liat” tanah yang kering yang memiliki dengungan ketika dipukul (مِّنۡ حَمَإٖ مَّسۡنُونٖ) min hama’im masnuun : tanah hitam yang telah berubah. Makna ayat: Pembahasan masih mengenai penyebutan tanda-tanda kekuasaan Allah, Ilmu, hikmah, dan rahmat-Nya. Firman-Nya : (وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ) “Dan telah Kami ciptakan manusia” yaitu Adam (مِن صَلۡصَٰلٖ) “dari tanah” tanah kering yang mempunyai dengungan ketika dipukul (مِّنۡ حَمَإٖ مَّسۡنُونٖ) dari tanah hitam yang baunya telah berubah, ini adalah tanda dari kekuasaan Allah dan Ilmu-Nya. Pelajaran dari ayat: • Penjelasan asal penciptaan manusia, yaitu tanah, dan jin dari kobaran api."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 26: Dalam ayat ini dan setelahnya, Allah Subhaanahu wa Ta'aala menyebutkan nikmat dan ihsan-Nya kepada nenek moyang kita, Nabi Adam ‘alaihis salam, dan apa yang dilakukan musuhnya yaitu Iblis terhadapnya. Di sana terdapat peringatan kepada kita agar berhati-hati terhadap keburukan dan godaannya. Yaitu tanah yang sudah berubah warna dan baunya karena sudah lama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 26",
    "description": "Setelah menggambarkan nikmat-nikmat Allah di alam sekitar manusia, melalui ayat-ayat berikut Allah menjelaskan penciptaan manusia. Allah menyatakan, dan sungguh, kami telah menciptakan manusia, yakni adam, dari tanah liat kering yang berasal dari lumpur hitam yang diberi bentuk. Dan kami telah menciptakan jin sebelum penciptaan adam dari api yang sangat panas."
  }
]