[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami ciptakan moyang jin, yaitu iblis, sebelum penciptaan Adam, dari api yang amat panas, yang tidak ada asapnya sama sekali."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Kami menciptakan bapak jin sebelum penciptaan Adam dari api yang sangat panas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَالْجَآنَّ خَلَقْنٰهُ مِن قَبْلُ مِن نَّارِ السَّمُومِ (Dan Kami telah menciptakan jin sebelum (Adam) dari api yang sangat panas) Yang dimaksud adalah Iblis dan sebangsanya. Disebut dengan jin karena tidak terlihat oleh mata. Makna (السموم) yakni hawa panas yang keluar dari pori-pori yang biasa keluar pada siang hari yang panas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kami telah menciptakan nenek moyang jin sebelum (Adam) dari api yang sangat panas, yang tidak berasap."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan Kami telah menciptakan jin} dan Iblis yaitu nenek moyang jin {sebelum itu dari api yang sangat panas} api yang sangat panas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. “dan jin” dedengkot jin, yaitu iblis “kami menciptakannya sebelum (adam)” sebelum penciptaan Adam “dari api yang sangat panas suhunya.\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مِن نَّارِ ٱلسَّمُومِ) min naaris samuum : dari api yang tidak mengeluarkan asap yang dapat menembus pori-pori manusia. Makna ayat: (وَٱلۡجَآنَّ خَلَقۡنَٰهُ مِن قَبۡلُ) “Dan jin Kami menciptakan mereka sebelumnya” sebelum penciptaan Adam dan Al-Jaan adalah ayah dari seluruh jin, Kami menciptakannya (مِن نَّارِ ٱلسَّمُومِ) “dari api yang sangat panas.” Api yang dapat menembus pori-pori manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 27: Yakni nenek moyang jin, yaitu Iblis. Api tersebut tidak berasap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 27",
    "description": "Dan kami telah menciptakan jin sebelum penciptaan adam dari api yang sangat panas. Dan ingatlah wahai nabi Muhammad, ketika tuhanmu berfirman kepada para malaikat, sungguh, aku akan menciptakan seorang manusia, yakni adam, dari tanah liat kering yang berasal dari lumpur hitam yang diberi bentuk."
  }
]