[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai rasul), ketika tuhanmu berfirman kepada para malaikat, ”sesungguhnya Aku akan mencipatkan manusia dari tanah yang kering. Dan tanah kering ini berasal dari tanah berwarna hitam yang telah mengalami warna perubahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Ingatlah -wahai Rasul- manakala Rabbmu berfirman kepada para Malaikat dan Iblis yang ada bersama mereka, \"Sesungguhnya Aku menciptakan manusia dari tanah kering yang memiliki suara bila diketuk, hitam dan berbau."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Allah menyebutkan kisah Adam dan Iblis ketika Allah berfirman kepada para malaikat: “Aku akan menciptakan manusia dari tanah kering yang telah berubah sifatnya; jika aku telah membentuknya dan menyempurnakan ciptaannya, kemudian meniupkan ruh kepadanya sehingga menjadi hidup, maka sujudlah kalian kepadanya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Ingatlah wahai Nabi, ketika Tuhanmu berfirman kepada para malaikat: “Sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) ketika Tuhanmu berfirman kepada malaikat,“Sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering dari lumpur hitam yang dibentuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28-29. ketika hendak menciptakan Adam, Allah berkata kepada para malaikat ”sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk. Maka apabila aku telah menyempurnakan kejadiannya” dalam bentuk raga yang sempurna, ”dan telah meniupkan kedalamnya ruh (ciptaan)Ku, maka tunduklah kamu kepadanya dengan bersujud”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya : (وَإِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ) “Dan ingatlah ketika Rabbmu berfirman” ingatlah wahai Rasul Kami, ketika Rabbmu berfirman kepada para malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 28: Ketika hendak menciptakan Adam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 28",
    "description": "Dan ingatlah wahai nabi Muhammad, ketika tuhanmu berfirman kepada para malaikat, sungguh, aku akan menciptakan seorang manusia, yakni adam, dari tanah liat kering yang berasal dari lumpur hitam yang diberi bentuk. Maka apabila aku telah menyempurnakan kejadian-Nya dan aku telah meniupkan roh ciptaan-ku ke dalamnya, maka tunduklah kamu, wahai para malaikat, dengan sukarela sebagai tanda penghormatan kamu kepadanya dengan bersujud."
  }
]