[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu apabila Aku telah menciptakannya, dan Aku sempurnakan bentuk fisiknya, dan Aku tiupkan ruh padanya, maka bersujudlah padanya sebagai bentuk salam dan penghormatan, bukan sujud peribadahan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Bila Aku telah menyelesaikan pembentukannya dan menyempurnakan penciptaannya, maka sujudlah kalian untuk melaksanakan perintah-Ku dan sebagai penghormatan kepadanya.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَإِذَا سَوَّيْتُهُۥ (Maka apabila Aku telah menyempurnakan kejadiannya) Telah serasi bentuk rupanya dan telah sempurna anggota tubuhnya. وَنَفَخْتُ فِيهِ مِن رُّوحِى(dan telah meniup kan kedalamnya ruh (ciptaan)-Ku) Imam al-Qurthubi berkata: ruh adalah jasad halus yang dijadikan Allah untuk menciptakan kehidupan pada badan. Allah menisbatkan ruh kepada diri-Nya sebagai nisbat makhluk kepada Penciptanya, karena ruh adalah makhluk menakjubkan diantara makhluk-makhluk-Nya. فَقَعُوا۟ لَهُۥ سٰجِدِينَ (maka tunduklah kamu kepadanya dengan bersujud) Sujud sebagai penghormatan, dan bukan sujud sebagai penyembahan. Dan Allah memuliakan makhluk-Nya yang Dia kehendaki dengan cara yang Dia kehendaki pula."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Maka apabila Aku telah menyempurnakan penciptaannya, dan telah meniupkan ruh ciptaan-Ku kedalamnya, maka tunduklah kamu kepadanya dengan bersujud. Ruh adalah ruhani yang menakjubkan ciptaan Allah. Sebagai pemuliaan kepada Adam."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apabila Aku telah menyempurnakan} menyeimbangkan bentuknya {dan telah meniupkan ruh (ciptaan)-Ku ke dalamnya, maka tunduklah} tersungkurlah {kepadanya dengan bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28-29. ketika hendak menciptakan Adam, Allah berkata kepada para malaikat ”sesungguhnya Aku akan menciptakan seorang manusia dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk. Maka apabila aku telah menyempurnakan kejadiannya” dalam bentuk raga yang sempurna, ”dan telah meniupkan kedalamnya ruh (ciptaan)Ku, maka tunduklah kamu kepadanya dengan bersujud”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَإِذَا سَوَّيۡتُهُۥ) faidzaa sawwaituh : jika Aku telah menyempurnakannya. (فَقَعُواْ لَهُۥ سَٰجِدِينَ) faqa’uu lahuu saajidiin : maka bersujudlah kalian. Makna ayat: Sujudlah kepada Adam yaitu sujud penghormatan dan pengagungan, bukan sujud menyembah Adam, karena yang berhak disembah adalah yang memperintahkan dan ditaati yaitu Allah ta’ala. Pelajaran dari ayat: • Keutamaan sujud, karena Allah menyuruh para malaikat untuk sujud, dan mereka semua bersujud kecuali Iblis."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 29: Diidhafatkan atau dihubungkan kata roh dengan Allah Ta’ala adalah untuk menunjukkan kemuliaan Adam, sebagaimana kata “baitullah” (rumah Allah), dsb. Dimaksud dengan sujud di sini bukan menyembah, tetapi sebagai penghormatan atau sujud membungkuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 29",
    "description": "Maka apabila aku telah menyempurnakan kejadian-Nya dan aku telah meniupkan roh ciptaan-ku ke dalamnya, maka tunduklah kamu, wahai para malaikat, dengan sukarela sebagai tanda penghormatan kamu kepadanya dengan bersujud. Maka dengan segera dan serta merta bersujudlah para malaikat itu semuanya secara bersama-sama dengan penuh kepatuhan dan ketaatan, ."
  }
]