[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai rasul, biarkanlah orang-orang kafir makan dan menikmati kesenagan mereka dengan dunia mereka dan mereka sibuk dengan kerakusan terhadapnya menghanyutkan mereka dari taat kepada Allah. Mereka nanti akan mengetahui kesudahan nasib mereka yang merugi di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Biarkanlah -wahai Rasul- orang-orang yang mendustakan itu makan seperti hewan-hewan makan, menikmati kesenangan-kesenangan dunia yang sesaat, panjang angan-angan telah membuat mereka lalai dari iman dan amal saleh, mereka akan mengetahui kerugian yang mereka alami manakala mereka pulang menghadap Allah pada hari Kiamat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Hai Rasulullah, biarkanlah mereka bersenang-senang dengan makan dan minum, tenggelam dalam syahwat dunia, dan sibuk dengan keserakahan dan angan-angan yang panjang sehingga mereka lalai dari ajal yang pasti mendatangi mereka. Kesudahan mereka adalah kerugian di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. ذَرْهُمْ يَأْكُلُوا۟ وَيَتَمَتَّعُوا۟ (Biarkanlah mereka (di dunia ini) makan dan bersenang-senang) Ini merupakan ancaman bagi mereka. Yakni biarkan saja mereka, sebab mereka tidak akan keluar dari kebatilan mereka; dan tinggalkan mereka menyibukkan diri dengan makan dan bersenang-senang dengan kenikmatan dunia, karena mereka seperti hewan ternak yang hanya mementingkan hal tersebut. Dan biarkan mereka terlena dengan kenikmatan itu yang melalaikan mereka dari keimanan kepadamu, kelak mereka akan mengetahui akibat dari perbuatan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ahli 'ilmu mengatakan : kata { ذَرْهُمْ } dalam ayat ini sebagai peringatan, dan kata { فَسَوْفَ يَعْلَمُونَ } adalah peringatan lain; lalu kapan hidup ini akan selamat diantara dua peringatan itu ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Wahai Nabi, biarkanlah mereka makan dan bersenang-senang dengan dunia ini, serta dilalaikan oleh angan-angan kosong dan menjauh dari keimanan. Maka kelak mereka akan mengetahui akibat perbuatan buruk mereka ketika mendapat balasan akhirat. Ini adalah ancaman bagi mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Biarkanlah mereka} biarkanlah mereka {makan, bersenang-senang, dan dilalaikan oleh angan-angan} disibukkan oleh harapan-harapan karena umur yang panjang, angan-angan yang sampai pada mereka, dan terus-menerus pada keadaan menjauh dari keimanan dan kataatan {Mereka akan mengetahui (akibatnya)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. “biarkanlah mereka (didunia ini) makan dan bersenang senang” dengan kelezatan kelezatan (hidup) mereka “dan dilalaikan oleh angan angan kosong” maksudnya mengimpikan keabadian hidup di dunia sehingga melalaikan mereka diakhirat ”maka kelak mereka akan mengetahui (akibat perbuatan mereka)” mereka akan mengetahui bahwa keyakinan yang mereka pegangi adalah batil, amalan amalan mereka akan lenyap menjelma kerugian yang mesti mereka tanggung, janganlah mereka terpedaya dengan penangguhan tempo oleh Allah (bagi mereka). ini sudah menjadi ketetapan Allah pada umat umat manusia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (َيَتَمَتَّعُواْ) wa yatamata’uu : “dan bersenang-senang” dengan kelezatan dan syahwat. (وَيُلۡهِهِمُ ٱلۡأَمَلُۖ) wa yulhihimul amal : “dan terbuai dengan angan-angan.” Dengan panjang umur, tercapainya keinginan dan hasrat duniawi. Makna ayat : Firman-Nya : (ذَرۡهُمۡ يَأۡكُلُواْ وَيَتَمَتَّعُواْ وَيُلۡهِهِمُ ٱلۡأَمَلُۖ فَسَوۡفَ يَعۡلَمُونَ ) “Biarkanlah mereka di dunia makan dan bersenang-senang dan dilalaikan oleh angan-angan kosong mereka, kelak mereka akan mengetahui.” Tinggalkanlah mereka, wahai Rasul Kami, yaitu, tinggalkanlah orang-orang kafir makan apapun yang mereka inginkan dari makanan, bersenang-senang dengan segala syahwat dan kelezatan yang mereka miliki, dan dilalaikan oleh angan-angan mereka dari memikirkan akhir dari perkara mereka. Karena mereka hanya mengharapkan umur yang panjang dan tercapainya keinginan mereka, mereka akan mengetahui kelak ketika kembali kehadirat Allah, penguasa mereka yang sebenarnya dan sia-sialah segala apa yang mereka perbuat, mereka dahulu di dunia telah berbuat salah dengan berpaling dari kebenaran, dakwah yang benar, dan dari agama yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 3: Oleh karena itu, janganlah tertipu karena penundaan Allah terhadap mereka, karena hal itu memang Sunnah-Nya yang biasa dilakukan-Nya terhadap orang-orang yang mendustakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 3",
    "description": "Wahai nabi Muhammad dan kaum muslim, apabila mereka tetap keras pada pendiriannya, biarkanlah mereka di dunia ini makan dan bersenang-senang dan terus dilalaikan oleh angan-angan kosong mereka dari beriman, mengikuti dakwahmu, dan hal-hal penting lainnya. Kelak mereka akan mengetahui akibat perbuatan buruk yang pernah mereka lakukan. Dan Allah menegaskan bahwa kami tidak membinasakan suatu negeri pun bersama dengan penduduknya, melainkan sudah ada ketentuan dan waktu yang ditetapkan bagi kebinasaan-Nya."
  }
]