[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Maka para malaikat semuanya bersujud sebagai mana tuhan mereka memerintahakan mereka, tidak ada satupun dari mereka yang menolak. Akan tetapi iblis enggan bersujud kepada Adam bersama malaikat-malaikat yang bersujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Maka para Malaikat melaksakan perintah Allah, mereka semua sujud sebagaimana yang Allah perintahkan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30-31. Maka para malaikat mentaati perintah itu, mereka semua bersujud; akan tetapi Iblis yang ketika itu bersama para malaikat enggan untuk bersujud."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. فَسَجَدَ الْمَلٰٓئِكَةُ كُلُّهُمْ أَجْمَعُونَ (Maka bersujudlah para malaikat itu semuanya bersama-sama) Mereka bersujud saat itu juga tanpa menunda-nunda."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika ditanyakan : kenapa Allah mengatakan : { كُلُّهُمْ أَجْمَعُونَ } \"semuanya bersama-sama\", padahal maksud nya sudah didapat dengan lafazh : { فَسَجَدَ الْمَلَائِكَةُ } \"Maka bersujudlah para malaikat itu\"? al-Mubrid berkata : bahwasanya kalimat { فَسَجَدَ الْمَلَائِكَةُ } dapat difahami juga bahwa yang sujud hanya sebahagian dari mereka, oleh karena ditekankan pada akhir ayat dengan kalimat { كلهم } dengan maksud menghilangkan keraguan, kemudian juga dapat difahami bahwa sujud mereka pada masa yang berbeda-beda, maka keraguan itupun hilang dengan firman-Nya : { أَجْمَعُونَ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Maka bersujudlah para malaikat itu semuanya bersama-sama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu para malaikat itu bersujud semuanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-31. Mereka menaati perintah Rabb mereka, ”maka bersujudlah para malaikat itu semuanya bersama sama” terdapat lafazh penguatan setelah lafazh penguatan sebelumnya, untuk menandakan bahwa tidak ada satu malaikatpun yang enggan hal tersebut sebagai bentuk pengagungan (mereka) kepada perintah Allah dan pemuliaan kepada Adam, karena beliau mengetahui sesuatu yang tidak diketahui oleh para malaikat “kecuali iblis, ia enggan ikut bersama sama (malaikat) yang sujud itu” ini adalah permusuhan pertamanya kepada Adam dan keturunan beliau."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 30: Disebutkan dua kata penguat, “semuanya” dan “bersama-sama” untuk menunjukkan bahwa mereka semua sujud tanpa terkecuali. Hal ini sebagai pengagungan mereka terhadap perintah Allah, dan penghormatan keada Adam karena ia mengetahui yang tidak mereka ketahui. Hal ini menunjukkan kelebihan orang yang berilmu di atas orang yang tidak berilmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 30",
    "description": "Maka dengan segera dan serta merta bersujudlah para malaikat itu semuanya secara bersama-sama dengan penuh kepatuhan dan ketaatan, kecuali iblis; ia enggan ikut bersujud bersama-sama para malaikat yang sujud itu."
  }
]