[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Maka para malaikat semuanya bersujud sebagai mana tuhan mereka memerintahakan mereka, tidak ada satupun dari mereka yang menolak. Akan tetapi iblis enggan bersujud kepada Adam bersama malaikat-malaikat yang bersujud."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Kecuali Iblis - yang saat itu bersama para Malaikat dan ia bukan salah satu dari mereka - menolak untuk sujud kepada Adam bersama para Malaikat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. إِلَّآ إِبْلِيسَ أَبَىٰٓ أَن يَكُونَ مَعَ السّٰجِدِينَ (kecuali iblis. Ia enggan ikut besama-sama (malaikat) yang sujud itu) Terdapat pendapat mengatakan bahwa iblis termasuk dari jenis malaikat, namun ia enggan untuk bersujud karena keangkuhan dan kedengkiannya terhadap Adam, maka ia layak mendapat laknat dari Allah. Namun pendapat yang benar adalah ia bukan termasuk malaikat, namun ketika itu ia bersama para malaikat sehingga ia termasuk yang diperintah untuk bersujud, namun ia menolak melakukannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Kecuali iblis, ia enggan ikut besama-sama para malaikat yang sujud itu sebab mereka merasa lebih mulia dari Adam. Mereka menyombongkan diri karena mereka diciptakan dari api, dan Adam dari tanah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali Iblis. Ia enggan} menolak {ikut bersama para (malaikat) yang bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30-31. Mereka menaati perintah Rabb mereka, ”maka bersujudlah para malaikat itu semuanya bersama sama” terdapat lafazh penguatan setelah lafazh penguatan sebelumnya, untuk menandakan bahwa tidak ada satu malaikatpun yang enggan hal tersebut sebagai bentuk pengagungan (mereka) kepada perintah Allah dan pemuliaan kepada Adam, karena beliau mengetahui sesuatu yang tidak diketahui oleh para malaikat “kecuali iblis, ia enggan ikut bersama sama (malaikat) yang sujud itu” ini adalah permusuhan pertamanya kepada Adam dan keturunan beliau."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Maka mereka bersujud (إِلَّآ إِبۡلِيسَ أَبَىٰٓ) “kecuali Iblis, dia enggan” menolak untuk sujud. Pelajaran dari ayat: • Tercelanya hasad, itu merupakan seburuk-buruknya dosa dan berbahaya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 31: Nenek moyang jin yang tinggal di tengah-tengah malaikat. Ini merupakan awal permusuhannya kepada Adam dan anak keturunannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 31",
    "description": "Kecuali iblis; ia enggan ikut bersujud bersama-sama para malaikat yang sujud itu. Melihat keengganan dan pembangkangan iblis untuk bersujud kepada nabi adam meski mendapat perintah langsung dari Allah, dia berfirman, wahai iblis, apa sebabnya kamu tidak mau ikut sujud bersama mereka, yakni para malaikat yang sujud dengan penuh kepatuhan dan ketaatan itu'."
  }
]