[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada iblis, ”mengapa kamu tidak mau bersujud bersama malaikat?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Allah berfirman kepada Iblis setelah ia menolak untuk sujud kepada Adam, \"Apa yang membuatmu menolak untuk sujud bersama malaikat-malaikat yang telah sujud melaksanakan perintah-Ku?\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32-33. Allah berfirman kepada Iblis dengan penuh pengingkaran: “Apa yang membuatmu enggan bersujud?” Dia menjawab dengan angkuh: “Tidak layak bagiku untuk sujud kepada manusia yang diciptakan dari tanah kering yang telah berubah sifatnya.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Allah berfirman: “Hai iblis, apa sebabnya kamu tidak ikut sujud bersama-sama mereka yang sujud itu?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia} Allah SWT {berfirman,“Wahai Iblis, apa yang menyebabkanmu enggan} apa yang mencegahmu {untuk bersama mereka yang bersujud"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32-33. “Dia berfirman” yaitu Allah yang berkata, “hai iblis, apa sebabnya kamu tidak (ikut sujud) bersama sama mereka yang sujud itu. Iblis berkata ‘aku sekali kali tidak akan sujud kepada manusia yang Engkau telah menciptakannya dari tanah liat kering (yang berasal) dari lumpur hitam yang diberi bentuk” lalu dia bersikap sombong terhadap perintah Allah dan memperlihatkan permusuhannya kepada Adam dan keturunan beliau dan mengagumi diri atas (keunggulan) unsur penciptaannya seraya berkata ”aku lebih baik dari adam”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya (قَالَ يَٰٓإِبۡلِيسُ مَا لَكَ أَلَّا تَكُونَ مَعَ ٱلسَّٰجِدِينَ ) “Dia berfirman, Wahai Iblis, mengapa engkau tidak termasuk ke dalam orang-orang yang sujud?” apa yang terjadi kepadamu sehingga engkau enggan sujud bersama para malaikat?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 32",
    "description": "Melihat keengganan dan pembangkangan iblis untuk bersujud kepada nabi adam meski mendapat perintah langsung dari Allah, dia berfirman, wahai iblis, apa sebabnya kamu tidak mau ikut sujud bersama mereka, yakni para malaikat yang sujud dengan penuh kepatuhan dan ketaatan itu'mendapat pertanyaan demikian dari Allah, ia (iblis) berkata dengan pongah, aku sekali-kali tidak akan pernah sujud kepada manusia yang engkau telah menciptakannya dari tanah liat kering yang berasal dari lumpur hitam yang diberi bentuk. Aku lebih mulia daripadanya karena engkau telah menciptakan aku dari api. (lihat: surah al-a'ra'f/7: 12)."
  }
]