[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Allah berfirman kepadanya, ”maka keluarlah dari surga, karena sesungguhnya kamu telah dijauhkan dari segala kebaikan dan sesungguhnya laknatKu dan kutukanKu untuk jauh dari rahmatKu menimpa kalain hingga hari manusia dibangkitkan untuk diperhitungkan amal perbuatan mereka dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Allah berfirman kepada Iblis, \"Keluarlah kamu dari Surga! Sesungguhnya kamu itu terusir."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34-35. Allah berfirman kepadanya: “Keluarlah dari surga, karena kamu telah dijauhkan dari rahmat-Ku, dan kamu akan mendapat laknat-Ku hingga hari kiamat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. قَالَ فَاخْرُجْ مِنْهَا (Allah berfirman: “Keluarlah dari surga) Yakni dari surga. فَإِنَّكَ رَجِيمٌ(karena sesungguhnya kamu terkutuk) Yakni terlaknat dan terusir, dan orang yang terusir akan dilempari dengan batu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Allah berfirman: “Keluarlah dari surga, karena sesungguhnya kamu terkutuk dan terlaknat dari rahmat-Ku karena engkau telah membangkang dari perintah-Ku"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah berfirman,“Keluarlah dari sana} dari surga {karena sesungguhnya kamu terkutuk} diusir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35. “Allah berfirman” Allah berfirman untuk menghukum atas kekufuran dan kesombongannya, ”keluarlah dari surga, karena sesungguhnya kamu terkutuk” maksudnya terusir lagi dijauhkan dari segala kebaikan” dan sesungguhnya kutukan itu tetap menimpamu” yaitu celaan, cercaan, dan jauh dari kebaikan “sampai hari kiamat” pada ayat ini dan ayat ayat lain yang semakna terdapat petunjuk bahwa iblis akan tetap berada dalam kekufuran dan jauh dari kebaikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: Makna kata: (قَالَ فَٱخۡرُجۡ مِنۡهَا) qaala fakhruj minhaa : “Dia berfirman, Keluarkah engkau darinya.” Yaitu dari surga. (فَإِنَّكَ رَجِيمٞ) fainnka rajiim : “karena engkau sesungguhnya terkutuk.” terusir, dan terlaknat. Makna ayat: Firman-Nya ta’ala : (قَالَ فَٱخۡرُجۡ مِنۡهَا) “Maka keluarlah engkau darinya (surga)” ini adalah jawaban atas perkataan iblis : (لَمۡ أَكُن لِّأَسۡجُدَ لِبَشَرٍ) “Aku tidak akan sujud kepada manusia...” oleh karena itu, (فَٱخۡرُجۡ) “keluarlah darinya” yaitu surga (فَإِنَّكَ رَجِيمٞ) “Karena engkau terkutuk” terlempar, terusir, dan dijauhkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 34: Menghukumnya karena kekafiran dan kesombongannya. Ada yang mengatakan, dari langit. Yakni dijauhkan dari semua kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 34",
    "description": "Mendengar jawaban iblis yang bernada angkuh, dia (Allah) berfirman, kalau begitu keluarlah dari surga, wahai iblis, karena sesungguhnya kamu terkutuk. Engkau tidak pantas menerima rahmat-ku, apalagi tinggal di surga-ku. Dan sesungguhnya kutukan itu, yakni keterjauhan engkau dari rahmat-ku, tetap menimpamu di dunia sampai hari kiamat"
  }
]