[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "34-35. Allah berfirman kepadanya, ”maka keluarlah dari surga, karena sesungguhnya kamu telah dijauhkan dari segala kebaikan dan sesungguhnya laknatKu dan kutukanKu untuk jauh dari rahmatKu menimpa kalain hingga hari manusia dibangkitkan untuk diperhitungkan amal perbuatan mereka dan pembalasannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Sesungguhnya atasmu laknat dan pengusiran dari rahmat-Ku.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَإِنَّ عَلَيْكَ اللَّعْنَةَ إِلَىٰ يَوْمِ الدِّينِ (dan sesungguhnya kutukan itu tetap menimpamu sampai hari kiamat) Yakni kamu akan terus dijauhkan dari rahmat Allah sampai hari pembalasan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Sesungguhnya kutukan kepadamu berupa dijauhkan dari rahmat Allah tetap menimpamu sampai hari kiamat dan hari perhitungan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya bagimu laknat sampai hari kiamat”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34-35. “Allah berfirman” Allah berfirman untuk menghukum atas kekufuran dan kesombongannya, ”keluarlah dari surga, karena sesungguhnya kamu terkutuk” maksudnya terusir lagi dijauhkan dari segala kebaikan” dan sesungguhnya kutukan itu tetap menimpamu” yaitu celaan, cercaan, dan jauh dari kebaikan “sampai hari kiamat” pada ayat ini dan ayat ayat lain yang semakna terdapat petunjuk bahwa iblis akan tetap berada dalam kekufuran dan jauh dari kebaikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: (وَإِنَّ عَلَيۡكَ ٱللَّعۡنَةَ) “dan bagimu laknat” murka-Ku dan pengusiranmu dari langit (إِلَىٰ يَوۡمِ ٱلدِّينِ) “hingga hari pembalasan.” Yaitu hari kiamat, hari pembalasan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 35: Yakni celaan, aib dan dijauhkan dari rahmat Allah Ta’ala. Ayat ini menunjukkan bahwa Iblis senantiasa di atas kekafiran dan jauh dari kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 35",
    "description": "Mendengar jawaban iblis yang bernada angkuh, dia (Allah) berfirman, kalau begitu keluarlah dari surga, wahai iblis, karena sesungguhnya kamu terkutuk. Engkau tidak pantas menerima rahmat-ku, apalagi tinggal di surga-ku. Dan sesungguhnya kutukan itu, yakni keterjauhan engkau dari rahmat-ku, tetap menimpamu di dunia sampai hari kiamat. Kutukan Allah kepada iblis tidak membuatnya menyadari kesalahan dan kedurhakaannya, tidak pula membuatnya memohon ampun kepada Allah. Kedurhakaannya bahkan semakin menjadi. Keengganan iblis untuk bersujud lahir dari kedengkiannya terhadap nabi adam. Kedengkian itu bahkan ingin dia teruskan hingga anak cucunya. Hal ini terbukti dari permintaan iblis kepada Allah agar umurnya dipanjangkan. Ia (iblis) berkata, ya tuhanku, kalau begitu maka berilah penangguhan kepadaku, yakni berilah tenggat bagiku untuk hidup dalam waktu yang lama agar aku dapat menjerumuskan anak-cucu adam sampai hari ketika manusia dibangkitkan dari kubur pada hari kiamat."
  }
]