[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "iblis berkata, “ Wahai Tuhanku, tangguhkanlah aku di dunia hingga pada hari yang Engkau akan membangkitkan hamba-hambaMu padanya, yaitu Hari Kiamat"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Iblis berkata, \"Ya Rabbi! Berilah aku penangguhan dan jangan mematikanku hingga Hari Pembangkitan Adam dan anak-anak keturunannya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36-38. Kemudian Iblis meminta kepada Allah agar menjadikannya hidup kekal hingga hari kiamat, maka Allah mengabulkan permintaannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. قَالَ رَبِّ فَأَنظِرْنِىٓ (Berkata iblis: “Ya Tuhanku, (kalau begitu) maka beri tangguhlah kepadaku) Yakni berilah aku tenggang waktu dan janganlah Engkau matikan aku. إِلَىٰ يَوْمِ يُبْعَثُونَ(sampai hari (manusia) dibangkitkan) Yakni hari dibangkitkannya Adam dan keturunannya. Seakan-akan Iblis meminta agar tidak mati selamanya, karena jika kematiannya diakhirkan sampai datangnya hari kebangkitan maka ia tidak mati sama sekali di dunia meski hanya sehari. Pendapat lain mengatakan bahwa ia tidak meminta agar tidak mati, namun meminta agar siksaannya diakhirkan di hari kiamat dan tidak disiksa di dunia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Berkata iblis: “Ya Tuhanku, kalau begitu maka berilah penangguhan waktu kepadaku sampai hari dimana manusia dibangkitkan dari kubur"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ia} Iblis {berkata,“Wahai Tuhanku, tangguhkanlah aku} tangguhkanlah aku dan jangan matikan aku {sampai hari mereka dibangkitkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-38. “iblis berkata ‘Ya Rabbku (kalau begitu) maka beri tangguhlah kepadaku” berilah aku kesempatan “sampai hari manusia dibangkitkan” Allah berfirman (kalau begitu) maka sesungguhnya kamu termasuk orang yang diberi tangguh sampai hari (suatu) waktu yang telah ditentukan” pengabulan Allah terhadap permintaanya bukanlah bentuk pemuliaan pada dirinya. Itu hanya sekedar ujian dan cobaan dari Allah baginya dan para hambaNya. Agar menjadi jelas siapa orang yang jujur, yang menaati Allah, bukan kepada musuhNya, dari orang yang tidak demikian. karena itu Allah telah memperingatkan kita dengan peringatan yang sangat keras dan memaparkan apa saja yang iblis inginkan dari kita."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Maka yang terkutuk itu berkata, sebagaimana yang Allah firmankan (قَالَ رَبِّ فَأَنظِرۡنِيٓ) “Dia bekata (Iblis), Wahai Rabbku, tangguhkanlah aku.” Tundalah ajalku, jangan Engkau matikan aku, (إِلَىٰ يَوۡمِ يُبۡعَثُونَ) “hingga hari mereka dibangkitkan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 36: Maksudnya, iblis meminta agar dia tidak diazab sekarang, bahkan agar diberikan kebebasan hidup sampai hari kebangkitan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 36",
    "description": "Kutukan Allah kepada iblis tidak membuatnya menyadari kesalahan dan kedurhakaannya, tidak pula membuatnya memohon ampun kepada Allah. Kedurhakaannya bahkan semakin menjadi. Keengganan iblis untuk bersujud lahir dari kedengkiannya terhadap nabi adam. Kedengkian itu bahkan ingin dia teruskan hingga anak cucunya. Hal ini terbukti dari permintaan iblis kepada Allah agar umurnya dipanjangkan. Ia (iblis) berkata, ya tuhanku, kalau begitu maka berilah penangguhan kepadaku, yakni berilah tenggat bagiku untuk hidup dalam waktu yang lama agar aku dapat menjerumuskan anak-cucu adam sampai hari ketika manusia dibangkitkan dari kubur pada hari kiamat. Permintaan iblis untuk dipanjangkan umurnya dikabulkan oleh Allah. Allah berfirman, baiklah, maka sesungguhnya kamu, wahai iblis, termasuk yang diberi penangguhan, yakni dipanjangkan umurnya, sampai hari yang telah ditentukan, yakni tiupan pertama sangkakala sebagai tanda permulaan kiamat, dan pada saat itulah engkau harus mati dan mempertanggungjawabkan perbuatanmu."
  }
]