[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "37-38. Allah berfirman kepadanya, “Sesungguhnya kamu termasuk yang aku tangguhkan kematian mereka sampai hari semua mahkluk mati pada tiupan pertama, bukan hingga Hari Kebangkitan” Sesungguhnya dipenuhinya permintaan itu sebagai bentuk pengeluaran waktu dan penanguhan serta cobaan bagi bangsa jin dan manusia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Hingga waktu semua makhluk mati, saat tiupan sangkakala yang pertama.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ (sampai hari (suatu) waktu yang telah ditentukan) Yakni sampai hari kiamat, ia akan mati bersama makhluk-makhluk yang lain ketika tiupan pertama sangkakala, dan bukan diakhirkan kematiannya sampai hari kebangkitan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Sampai hari dan waktu yang telah ditentukan oleh Allah, yang telah diyakini oleh manusia yaitu hari kiamat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{sampai hari yang waktunya telah ditentukan} hari dimana para makhluk mati ketika tiupan (sangkakala) pertama"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-38. “iblis berkata ‘Ya Rabbku (kalau begitu) maka beri tangguhlah kepadaku” berilah aku kesempatan “sampai hari manusia dibangkitkan” Allah berfirman (kalau begitu) maka sesungguhnya kamu termasuk orang yang diberi tangguh sampai hari (suatu) waktu yang telah ditentukan” pengabulan Allah terhadap permintaanya bukanlah bentuk pemuliaan pada dirinya. Itu hanya sekedar ujian dan cobaan dari Allah baginya dan para hambaNya. Agar menjadi jelas siapa orang yang jujur, yang menaati Allah, bukan kepada musuhNya, dari orang yang tidak demikian. karena itu Allah telah memperingatkan kita dengan peringatan yang sangat keras dan memaparkan apa saja yang iblis inginkan dari kita."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ) ilaa yaumil waqtil ma’luum : “hingga hari yang telah ditentukan.” Ketika tiupan pertama sangkakala yang mematikan seluruh makhluk. Makna ayat: (إِلَىٰ يَوۡمِ ٱلۡوَقۡتِ ٱلۡمَعۡلُومِ) “hingga waktu yang ditentukan.” Yaitu hari kehancuran seluruh keturunan Adam, tidak tersisa dari mereka sedikitpun, ketika tiupan sangkakala pertama."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 38: Yakni waktu tiupan pertama tanda permulaan hari kiamat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 38",
    "description": "Permintaan iblis untuk dipanjangkan umurnya dikabulkan oleh Allah. Allah berfirman, baiklah, maka sesungguhnya kamu, wahai iblis, termasuk yang diberi penangguhan, yakni dipanjangkan umurnya, sampai hari yang telah ditentukan, yakni tiupan pertama sangkakala sebagai tanda permulaan kiamat, dan pada saat itulah engkau harus mati dan mempertanggungjawabkan perbuatanmu. Mengetahui permohonannya dikabulkan oleh Allah, ia (iblis) berkata, tuhanku, oleh karena engkau telah memutuskan bahwa aku sesat, yaitu mendapat kutukan dan dijauhkan dari rahmat-Mu, aku pasti akan jadikan (kejahatan) terasa indah bagi mereka, sehingga mereka menganggap baik perbuatan-perbuatan maksiat di bumi yang memalingkan dan menjauhkan mereka dari ibadah kepada-Mu, dan aku dengan segala daya dan cara akan menyesatkan mereka semuanya dari jalan lurus yang engkau ridai."
  }
]