[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Iblis berkata, “Wahai Tuhanku, lantaran Engkau telah memastikanku bersalah dan sesat, pastilah aku akan menjadikan keturunan Adam memandang indah perbuatan maksiat kepadaMu di mua bumi, dan aku benar-benar akan menyesatkan mereka semua dari jalan Hidayah, kecuali hamba-hambaMu yang Engkau berikan hidayah kepada mereka, lalu mereka mengikhlaskan ibadah kepadaMu semata, bukan pada mahklukMu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Iblis berkata, \"Ya Rabbku! Karena Engkau telah menyesatkanku, maka aku akan menggoda manusia untuk menganggap baik berbuat kemaksiatan di bumi dan aku pasti akan menyesatkan mereka dari jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39-40. Lalu Iblis menyatakan dendamnya kepada Adam dan keturunannya: “Ya Tuhanku, Engkau menyesatkanku karena Adam, maka sungguh aku akan menghiasi kemaksiatan bagi keturunan Adam di dunia; aku akan menyesatkan mereka dari jalan hidayah kecuali hamba-hamba-Mu yang beriman dan hanya menyembah-Mu semata.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. قَالَ رَبِّ بِمَآ أَغْوَيْتَنِى لَأُزَيِّنَنَّ لَهُمْ فِى الْأَرْضِ (Iblis berkata: “Ya Tuhanku, oleh sebab Engkau telah memutuskan bahwa aku sesat, pasti aku akan menjadikan mereka memandang baik (perbuatan maksiat) di muka bumi) Yakni karena Engkau telah menyesatkanku maka aku akan menggoda mereka di dunia. Godaan itu bisa dengan menjadikan manusia memandang baik perbuatan maksiat, atau menyibukkan mereka dengan perhiasan dunia dari pelaksanaan perintah Allah kepada mereka, sehingga mereka benar-benar tenggelam didalamnya. وَلَأُغْوِيَنَّهُمْ أَجْمَعِينَ(dan pasti aku akan menyesatkan mereka semuanya) Yakni aku akan menyesatkan mereka dari jalan hidayah dan menjerumuskan mereka kedalam jalan kesesatan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Iblis berkata: “Ya Tuhanku, sebab Engkau telah memutuskan bahwa aku sesat, aku bersumpah atas keagungan-Mu pasti aku akan menjadikan mereka memandang baik perbuatan maksiat di muka bumi, dan pasti aku akan menyesatkan mereka semuanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Iblis berkata,“Ya Tuhanku, karena Engkau telah menyesatkanku} menyesatkanku {sungguh aku akan menjadikan indah bagi mereka} sungguh aku akan membuat terasa bagus perbuatan maksiat bagi mereka {di bumi dan sungguh aku akan menyesatkan mereka} sungguh aku akan menyesatkan mereka {semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “iblis berkata ’Ya Rabbku oleh sebab Engaku telah memutuskan bahwa aku sesat, pasti aku akan menjadikan mereka memandang baik (perbuatan maksiat) di muka bumi” kami akan menggambaran dunia menjadi indah pada pandangan mereka dan mengajak mereka untuk mendahulukannya dibandingkan akhirat. Agar mereka menjadi manusia-manusia yang setia terhadap setiap kemaksiatan “dan pasti aku akan menyesatkan mereka semuanya” aku akan menghalang halangi mereka semua dari jalan yang lurus ’kecuali hamba haambaMu yang mukhlis diantara mereka” yaitu orang orang yang telah Engkau jadikan mereka berlaku ikhlas (kepadaMu) dan engkau pilih karena keikhlasan, keimanan, dan ketakwaan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (بِمَآ أَغۡوَيۡتَنِي) bimaa aghwaitanii : karena Engkau telah memutuskan aku sesat dan rusak. Makna ayat: Ketika yang terkutuk itu mendengar keputusan Allah kepadanya, ia berkata—seperti yang Allah kabarkan dengan firman-Nya—( قَالَ رَبِّ بِمَآ أَغۡوَيۡتَنِي) “Wahai Rabbku, karena engkau telah menyatakanku sesat,” (لَأُزَيِّنَنَّ لَهُمۡ فِي ٱلۡأَرۡضِ) “akanku hiasi mereka di dunia,” perbuatan kufur, syirik, dan dosa-dosa besar, serta (وَلَأُغۡوِيَنَّهُمۡ) “dan akan aku sesatkan mereka” pasti akanku sesatkan mereka (أَجۡمَعِينَ) “semua.” Pelajaran dari ayat: • Senjata yang paling ampuh milik Iblis untuk Bani Adam, menghiasi segala sesuatu menjadi indah, sampai perkara yang rendah dan jelek, dipoles dengan godaan-godaannya menjadi indah dan baik, hingga bani Adam melakukannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 39: Iblis akan menghias dunia bagi mereka dan mengajak mereka mengutamakannya di atas akhirat sehingga mereka tunduk untuk melakukan setiap maksiat. Yakni dari jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 39",
    "description": "Mengetahui permohonannya dikabulkan oleh Allah, ia (iblis) berkata, tuhanku, oleh karena engkau telah memutuskan bahwa aku sesat, yaitu mendapat kutukan dan dijauhkan dari rahmat-Mu, aku pasti akan jadikan (kejahatan) terasa indah bagi mereka, sehingga mereka menganggap baik perbuatan-perbuatan maksiat di bumi yang memalingkan dan menjauhkan mereka dari ibadah kepada-Mu, dan aku dengan segala daya dan cara akan menyesatkan mereka semuanya dari jalan lurus yang engkau ridai. Iblis meneruskan perkataanya, aku akan berusaha menyesatkan manusia kecuali kelompok tertentu dari hamba-hamba-Mu yang terpilih di antara mereka, yakni orang-orang yang engkau pilih dan beri taufik untuk senantiasa menaati-Mu, dan orang-orang yang disucikan dari segala kedurhakaan."
  }
]