[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan apabila mereka meminta diturunkannya siksaan pada mereka, lantaran kedustaan mereka padamu wahai rasul, maka sesunggguhnya kami tidak membinasakan satu negeri kecuali penghancurannya terjadi pada waktu yang telah ditentukan. Kami tidak membinasakan mereka hingga mereka mencapai batas itu, sebagaimana orang-orang sebelum mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Kami tidak membinasakan suatu negeri dari negeri-negeri yang zalim kecuali ia telah memiliki batas waktu yang ditentukan dalam ilmu Allah, tidak maju dan tidak mundur."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4-5. Kami tidak membinasakan penduduk suatu negeri yang zalim yang mendustakan para rasul Allah melainkan pada waktu yang telah ditetapkan, sehingga waktu kebinasaan mereka tidak dapat dimajukan atau diakhirkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ إِلَّا وَلَهَا كِتَابٌ مَّعْلُومٌ (Dan Kami tiada membinasakan sesuatu negeripun, melainkan ada baginya ketentuan masa yang telah ditetapkan) Yakni waktu yang telah ditentukan yang tertulis di sisi Allah, yang tidak mungkin disegerakan atau ditangguhkan, yang telah diketahui dan tidak akan terlupakan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Kami tidak pernah membinasakan satu negeri pun, melainkan telah tertulis baginya ketentuan masa yang telah ditetapkan kehancurannya. Itu semua telah tertulis di Lauhul Mahfudz."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak membinasakan suatu negeri, kecuali sudah ada baginya ketentuan yang ditetapkan} waktu yang ditentukan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. “dan tidaklah kami membinasakan suatu negeripun” umat manusia yang pantas untuk di timpa siksaan, ”melainkan telah ditentukan masa kebinasaannya” sudah ditentukan waktu pemusnahannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (إِلَّا وَلَهَا كِتَابٞ مَّعۡلُومٞ) illaa walahaa kitaabum ma’luum : “kecuali ia mempunyai batas yang telah ditentukan.” Batas waktu kehancuran yang ditentukan. Makna ayat : Firman-Nya : (وَمَآ أَهۡلَكۡنَا مِن قَرۡيَةٍ) “Tidaklah Kami menghancurkan suatu negeri” penduduk negeri dengan azab yang membinasakan hingga keakar-akarnya. (إِلَّا وَلَهَا كِتَابٞ) “melainkan sudah ada ketentuan” batas waktu yang telah ditentukan pada masa yang telah ditetapkan hari dan jamnya. Pelajaran dari ayat: - Penegasan akidah qadha dan qadar, tidak segala sesuatu kecuali ia telah berada di dalam pengetahuan Allah dan tertulis disisi-Nya dalam kitab takdir, dari kehidupan, kematian, keuntungan, kerugian, kebahagiaan, dan kesengsaraan, seluruh apapun yang telah ada dan yang akan terjadi telah berada di dalam ilmu Allah dan tertulis di Lauhul Mahfuzh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 4: Kapan dibinasakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 4",
    "description": "Dan Allah menegaskan bahwa kami tidak membinasakan suatu negeri pun bersama dengan penduduknya, melainkan sudah ada ketentuan dan waktu yang ditetapkan bagi kebinasaan-Nya. Ajal adalah ketetapan yang sudah Allah tentukan waktunya, karena itu tidak ada suatu umat pun yang dapat mendahului ajalnya, dan tidak pula dapat meminta penundaan darinya."
  }
]