[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "39-40. Iblis berkata, “Wahai Tuhanku, lantaran Engkau telah memastikanku bersalah dan sesat, pastilah aku akan menjadikan keturunan Adam memandang indah perbuatan maksiat kepadaMu di mua bumi, dan aku benar-benar akan menyesatkan mereka semua dari jalan Hidayah, kecuali hamba-hambaMu yang Engkau berikan hidayah kepada mereka, lalu mereka mengikhlaskan ibadah kepadaMu semata, bukan pada mahklukMu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Kecuali hamba-hamba-Mu yang Engkau pilih untuk beribadah kepada-Mu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ (kecuali hamba-hamba Engkau yang mukhlis di antara mereka) Yaitu orang-orang yang Engkau pilih untuk beribadah kepada-Mu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Kecuali hamba-hamba Engkau di antara mereka yang senantiasa ikhlas dalam menaatiMu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali hamba-hambaMu yang ikhlas di antara mereka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39-40. “iblis berkata ’Ya Rabbku oleh sebab Engaku telah memutuskan bahwa aku sesat, pasti aku akan menjadikan mereka memandang baik (perbuatan maksiat) di muka bumi” kami akan menggambaran dunia menjadi indah pada pandangan mereka dan mengajak mereka untuk mendahulukannya dibandingkan akhirat. Agar mereka menjadi manusia-manusia yang setia terhadap setiap kemaksiatan “dan pasti aku akan menyesatkan mereka semuanya” aku akan menghalang halangi mereka semua dari jalan yang lurus ’kecuali hamba haambaMu yang mukhlis diantara mereka” yaitu orang orang yang telah Engkau jadikan mereka berlaku ikhlas (kepadaMu) dan engkau pilih karena keikhlasan, keimanan, dan ketakwaan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡمُخۡلَصِينَ) al-mukhlashiin : “yang terpilih.” Yaitu orang-orang yang terpilih untuk mentaati-Mu, maka tipu dayaku tidak bekerja kepada mereka. Makna ayat: (إِلَّا عِبَادَكَ مِنۡهُمُ ٱلۡمُخۡلَصِينَ) “Kecuali hamba-hamba-Mu yang terpilih.” Iblis mengecualikan orang-orang yang telah Allah ta’ala pilih untuk mentaati-Nya, dan memuliakan mereka dengan penjagaan-Nya, merekalah orang-orang yang tidak termakan emosi dan tidak dikuasai oleh syahwat dan hawa nafsu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 40: Yang dimaksud dengan mukhlis ialah orang-orang yang telah diberi taufiq untuk menaati segala petunjuk dan perintah Allah karena keikhlasan, keimanan dan tawakkal dalam diri mereka, atau orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 40",
    "description": "Iblis meneruskan perkataanya, aku akan berusaha menyesatkan manusia kecuali kelompok tertentu dari hamba-hamba-Mu yang terpilih di antara mereka, yakni orang-orang yang engkau pilih dan beri taufik untuk senantiasa menaati-Mu, dan orang-orang yang disucikan dari segala kedurhakaan. Pernyataan iblis itu dijawab oleh Allah dengan berfirman, ini, yakni apa yang engkau katakan, baik yang engkau kecualikan maupun yang tidak, adalah jalan yang lurus, yang merupakan jalan kebenaran dan mengarah ke-pada-ku, yakni sesuatu ketentuan yang telah ditentukan dengan ketetapan dan kebijaksanaan-ku."
  }
]