[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Allah berfirman, “Ini adalah jalan lurus, tengah-tengah, yang menghantarkan kepadaKu dan pada tempat kemuliaanKu. Sesungguhnya hamba-hambaKu yang ihklas kepadaKu, Aku tidak akan menjadikan bagimu kekuasaan terhadap hati-hati mereka untuk menyesatkan mereka dengan itu dari jalan lurus. Akan tetapi, kekuasaanmu hanya ada pada orang yang mengikutimu, dari kalangan orang-orang yang sesat lagi menyekutukan Allah yang rihda dengan kekuasaanmu dan ketaatan kepadamu, sebagai ganti ketaatan kepadaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Allah berfirman, \"Ini adalah jalan lurus yang menyampaikan kepada-Ku."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41-42. Allah menjawab pernyataannya itu: “Ini adalah jalan yang Aku tetapkan dan sunnah-Ku yang tidak akan berubah: ‘Sungguh hamba-hamba-Ku yang beriman tidak akan mampu kamu sesatkan, melainkan hamba-hamba-Ku yang kafir yang mengikutimu dalam kekafiran dan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. قَالَ هٰذَا صِرٰطٌ عَلَىَّ مُسْتَقِيمٌ (Allah berfirman: “Ini adalah jalan yang lurus, kewajiban Aku-lah (menjaganya)) Yakni wajib bagi-Ku untuk menjaganya, yaitu dengan tidak memberimu kekuasaan atas hamba-hamba-Ku. Pendapat lain mengatakan maknanya adalah seperti perkataanmu saat mengancam seseorang “aku akan menghalangi jalanmu.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Allah berfirman: “Menjaga hamba-hamba-Ku yang senantiasa ikhlas adalah menjadi tanggungjawab-Ku, dan bukan wewenangmu atas penjagaan terhadap mereka.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia} Allah SWT {berfirman,“Ini adalah jalan lurus} jalan yang lurus untuk kembali kepadaku, tidak ada belokan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. Allah berfirman ”ini adalah jalan yang lurus, kewajiban Aku lah (menjaganya)” maksudnya jalan yang pertengahan, mengantarkan kepadaKu dan menuju ke tempat kemuliaanku."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (هَٰذَا صِرَٰطٌ عَلَيَّ مُسۡتَقِيمٌ) haadzaa shiraathun ‘alayya mustaqiim : ini adalah jalan yang menuju kepada-Ku dan Aku lah yang akan merawat dan menjaganya. Makna ayat: Firman-Nya ta’ala (قَالَ هَٰذَا صِرَٰطٌ عَلَيَّ مُسۡتَقِيمٌ ) “(Allah) berfirman, Inilah jalan yang menuju kepada-Ku.” Ini adalah jalan yang lurus kepada-Ku, Aku yang merawat dan menjaganya . Pelajaran dari ayat: • Terjaganya Para Rasul dan penjagaan Allah kepada para wali-Nya, sehingga mereka tidak tercemar kotoran dosa. • Jalan Allah yang lurus menuju kepada-Nya ta’ala sehingga manusia bisa sampai kepada-Nya subhanahu wa ta’ala, lalu Dia menghitung perbuatan mereka, membalas mereka atas perbuatan baik dengan kebaikan, dan buruk dengan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 41",
    "description": "Pernyataan iblis itu dijawab oleh Allah dengan berfirman, ini, yakni apa yang engkau katakan, baik yang engkau kecualikan maupun yang tidak, adalah jalan yang lurus, yang merupakan jalan kebenaran dan mengarah ke-pada-ku, yakni sesuatu ketentuan yang telah ditentukan dengan ketetapan dan kebijaksanaan-ku. Allah melanjutkan firman-Nya, sesungguhnya kamu, wahai iblis, tidak punya kuasa atas hamba-hamba-ku. Engkau tidak akan mampu menjerumuskan dan memalingkan mereka dari ketaatan kepada-ku, kecuali mereka yang mengikuti godaan-Mu dan enggan bertobat, yaitu orang yang sesat."
  }
]