[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41-42. Allah berfirman, “Ini adalah jalan lurus, tengah-tengah, yang menghantarkan kepadaKu dan pada tempat kemuliaanKu. Sesungguhnya hamba-hambaKu yang ihklas kepadaKu, Aku tidak akan menjadikan bagimu kekuasaan terhadap hati-hati mereka untuk menyesatkan mereka dengan itu dari jalan lurus. Akan tetapi, kekuasaanmu hanya ada pada orang yang mengikutimu, dari kalangan orang-orang yang sesat lagi menyekutukan Allah yang rihda dengan kekuasaanmu dan ketaatan kepadamu, sebagai ganti ketaatan kepadaku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Sesungguhnya kamu tidak mempunyai kekuasaan untuk menyesatkan hamba-hamba-Ku yang terpilih kecuali siapa yang mengikutimu dari orang-orang yang tersesat.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. إِنَّ عِبَادِى لَيْسَ لَكَ عَلَيْهِمْ سُلْطٰنٌ (Sesungguhnya hamba-hamba-Ku tidak ada kekuasaan bagimu terhadap mereka) Yang dimaksud dengan “hamba-hamba-Ku” disini adalah adalah orang-orang pilihan-Nya. إِلَّا مَنِ اتَّبَعَكَ مِنَ الْغَاوِينَ(kecuali orang-orang yang mengikut kamu, yaitu orang-orang yang sesat) dari jalan kebenaran. Yakni orang-orang yang dapat kamu kuasai adalah mereka yang mengikutimu dan memberikan tali kekang mereka kepadamu sehingga kamu dapat menggiring mereka ke neraka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Sesungguhnya hamba-hamba-Ku yang ikhlas itu tidak akan bisa engkau bisikkan kepada mereka, kecuali orang-orang yang mengikut kamu dengan kemaksiatan, kekafiran dan kesesatan, mereka itulah orang-orang yang bisa engkau pengaruhi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kamu tidak memiliki kuasa} tidak bisa menguasai {atas hamba-hambaKu kecuali mereka yang mengikutimu, yaitu orang-orang yang sesat”} orang-orang yang sesat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “sesungguhnya hamba hambaKu tidak ada kekuasaan bagimu terhadap mereka” untuk memikat mereka kepada perkara perkara yang engkau kehendaki, berupa berbagai macam kesesatan karena pengabdian diri mereka kepada Rabb mereka dan kepatuhan mereka kepada perintah perintahNya. Allah telah menolong mereka dan memelihara mereka dari (jeratan) setan. ”kecuali orang orang yang mengikutimu” lalu dia ridha dengan kepemimpinan, dan taat kepadamu sebagai ganti dari ketaatan kepada ar-rahman “yaitu orang orang yang sesat” kata lawan dari (yang mendapat petunjuk). yaitu orang yang mengetahui kebenaran tapi meningalkannya. sementara maknanya orang yang meninggalkan kebenaran tanpa tahu sebelumnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: yaitu (إِنَّ عِبَادِي لَيۡسَ لَكَ عَلَيۡهِمۡ سُلۡطَٰنٌ إِلَّا مَنِ ٱتَّبَعَكَ مِنَ ٱلۡغَاوِينَ) “Sesungguhnya hamba-hamba-Ku tidak ada kekuasaan bagimu terhadap mereka, kecuali orang-orang yang mengikut kamu, yaitu orang-orang yang sesat.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 42: Untuk mengarahkan mereka kepada kesesatan karena ibadah mereka kepada Tuhan mereka dan ketundukan mereka kepada perintah-Nya, sehingga Allah menjaga mereka dari gangguan setan. Demikian juga karena mereka senantiasa meminta hidayah kepada-Nya seperti dalam shalat, di mana shalat merupakan benteng mereka agar tidak terjatuh ke dalam kesesatan. Yakni orang yang mengetahui kebenaran lalu meninggalkannya, seperti halnya orang-orang kafir. Inilah yang disebut Ghaawiy. Termasuk pula orang-orang yang meninggalkan kebenaran karena ketidaktahuannya. Inilah yang disebut Dhaall."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 42",
    "description": "Allah melanjutkan firman-Nya, sesungguhnya kamu, wahai iblis, tidak punya kuasa atas hamba-hamba-ku. Engkau tidak akan mampu menjerumuskan dan memalingkan mereka dari ketaatan kepada-ku, kecuali mereka yang mengikuti godaan-Mu dan enggan bertobat, yaitu orang yang sesat. Allah telah menyiapkan neraka jahanam bagi orang-orang yang sesat dan enggan bertobat. Allah berfirman, dan sungguh, jahanam itu benar-benar tempat berkumpul dan tempat kembali yang telah dijanjikan untuk mereka semuanya, yakni para pengikut iblis."
  }
]