[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Dan sesungguhnya neraka yang dahsyat benar-benar menjadi tempat kembali iblis dan pengikut-pengikutnya semuanya. Ia memiliki tujuh pintu, setiap pintu berada di bawah pintu lainya. Dan bagi setiap pintu, ada jatah dan bagian dari pengikut iblis sesuai dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Sesungguhnya Jahanam adalah tempat kembali bagi Iblis dan orang-orang tersesat yang mengikutinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43-44. Neraka Jahannam adalah tempat yang dijanjikan bagi orang-orang yang sesat itu. neraka Jahannam memiliki tujuh pintu, setiap golongan pengikut Iblis memiliki pintu khusus untuk mereka masuki sesuai dengan kadar dosa mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Sesungguhnya neraka Jahannam itu benar-benar tempat yang telah diancamkan kepada mereka para pengikut syaitan semuanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya neraka Jahanam benar-benar dijanjikan untuk mereka semua"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “dan sesungguhnya jahanam itu benar-benar tempat yang telah diancamkan kepada mereka (pengikut pengikut setan) semuanya” yaitu iblis dan para pengikutnya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: (وَإِنَّ جَهَنَّمَ) “Dan Jahanam” adalah tempat yang telah dijanjikan kepadamu dan seluruh pengikutmu yang sesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 43",
    "description": "Allah telah menyiapkan neraka jahanam bagi orang-orang yang sesat dan enggan bertobat. Allah berfirman, dan sungguh, jahanam itu benar-benar tempat berkumpul dan tempat kembali yang telah dijanjikan untuk mereka semuanya, yakni para pengikut iblis. Allah lalu menggambarkan bahwa jahanam yang menjadi tempat mereka dikumpulkan dan disiksa itu mempunyai tujuh pintu. Setiap pintu telah ditetapkan untuk menjadi tempat masuk dan tempat penyiksaan bagi golongan tertentu dari mereka."
  }
]