[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "43-44. Dan sesungguhnya neraka yang dahsyat benar-benar menjadi tempat kembali iblis dan pengikut-pengikutnya semuanya. Ia memiliki tujuh pintu, setiap pintu berada di bawah pintu lainya. Dan bagi setiap pintu, ada jatah dan bagian dari pengikut iblis sesuai dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Jahanam mempunyai tujuh pintu yang mereka masuk melewatinya, setiap pintu dari pintu-pintunya akan dimasuki oleh orang-orang yang mengikuti Iblis sesuai kadar yang diketahui."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. لَهَا سَبْعَةُ أَبْوٰبٍ (Jahannam itu mempunyai tujuh pintu) Sebagai pintu masuk para penghuni neraka. Berjumlah tujuh pintu karena begitu banyaknya penghuni neraka. لِّكُلِّ بَابٍ مِّنْهُمْ(Tiap-tiap pintu) Bagi para pengikut Iblis dan orang-orang yang tersesat. جُزْءٌ مَّقْسُومٌ(untuk golongan yang tertentu dari mereka) Yakni jumlah yang telah ditentukan yang terpisah dari lainnya. Imam bukhari mengeluarkan hadits dalam kitabnya Tarikh, serta Imam Tirmidzi, dari Ibnu Umar ia berkata: Rasulullah bersabda: “neraka Jahannam memiliki tujuh pintu, salah satu pintunya diperuntukkan bagi orang yang menghunuskan pedang untuk melawan umatku.”"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Jahannam itu mempunyai tujuh pintu. Tiap-tiap pintu telah ditetapkan untuk golongan yang tertentu dari mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Neraka itu mempunyai tujuh pintu. Setiap pintu untuk golongan tertentu} bagian tertentu {dari mereka} dari para pengikut Iblis"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. “jahanam itu mempunyai tujuh pintu” setiap pintu berada di bawah pintu lainnya. ”tiap tiap pintu (telah ditetapkan) dari mereka” yaitu dari para pengikut iblis. ”untuk golongan yang tertentu” sesuai dengan tingkatan ulah (buruknya), Allah berfirman ”hati mereka dijungkirkan ke dalam neraka bersama sama orang orang yang sesat, dan bala tentara iblis semuanya”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَهَا سَبۡعَةُ أَبۡوَٰبٖ) lahaa sab’atu abwaab : pintu-pintu dari tujuh tingkatan nereka dari Jahanam, kemudian Lazha, Al-Huthamah, As-Sa’iir, Saqar, Al-Jahiim, lalu Al-Haawiyah. Makna ayat: (لَهَا سَبۡعَةُ أَبۡوَٰبٖ) “ia mempunyai tujuh pintu” karena nereka mempunyai tujuh tingkatan, setiap tingkatan terdapat pintu di atasnya yang akan dimasuki oleh penghuni tingkatan tersebut, inilah makna dari firman-Nya (لِّكُلِّ بَابٖ مِّنۡهُمۡ جُزۡءٞ مَّقۡسُومٌ) “setiap pintu telah ditetapkan untuk golongan tertentu dari mereka.” Yaitu, bagian tertentu, dan tingkatannya: Jahanam, Lazha, Al-Huthamah, As-Sa’iir, Saqar, Al-Jahiim, Al-Hawiyah. Pelajaran dari ayat: • Penjelasan bahwa Jahanam mempunyai tingkatan, satu tingkatan di atas yang lain, dan setiap tingkatan mempunyai pintu di atasnya yang dimasuki oleh penghuni tingkatan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 44: Ada yang mengartikan tujuh lapisan. Ibnu Juraij berkata, “Neraka terdiri dari tujuh tingkatan: pertama, Jahannam. selanjutnya, Lazhaa, Huthamah, Sa’ir, Saqar, Jahiim, kemudian Hawiyah.” Adh Dhahhak berkata, “Di tingkatan pertama terdapat ahli tauhid yang dimasukkan ke dalam neraka; mereka disiksa sesuai dosa mereka lalu dikeluarkan. Di lapisan kedua terdapat orang-orang Nasrani. Di lapisan ketiga terdapat orang-orang Yahudi. Di lapisan keempat terdapat orang-orang shabiin. Di lapisan kelima terdapat orang-orang Majusi. Di lapisan keenam terdapat orang-orang musyrik, dan di lapisan ketujuh terdapat orang-orang munafik.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 44",
    "description": "Allah lalu menggambarkan bahwa jahanam yang menjadi tempat mereka dikumpulkan dan disiksa itu mempunyai tujuh pintu. Setiap pintu telah ditetapkan untuk menjadi tempat masuk dan tempat penyiksaan bagi golongan tertentu dari mereka. Usai menggambarkan siksaan dalam neraka jahanam yang menanti orang-orang yang sesat dan enggan bertobat, dalam ayat-ayat berikut Allah menjelaskan balasan bagi hamba-hamba-Nya yang taat dan patuh. Allah menyatakan bahwa sesungguhnya orang yang bertakwa itu, yakni mereka yang mematuhi petunjuk Allah dan berserah diri kepada-Nya, berada dalam surga-surga. Mereka tinggal dan mendapat ganjaran di taman-taman yang keindahannya tidak dapat dilukiskan dengan kata-kata. Dan di dekat kediaman mereka dijumpai mata air yang mengalir."
  }
]