[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-48. Sesungguhnya orang-orang yang bertakwa kepada Allah dengan melaksanakan perintahnya dan menjauhi apa yang dilarang, akan ada di Kebun-kebun dan di sungai-sungai yang mengalir. Dikatakan kepada mereka, “Masuklah kalian kedalam kebun-kebun ini dengan selamat dari seluruh keburukan dan aman dari semua siksaan.” Dan kami telah mencabut sifat-sifat buruk dari diri hati-hati mereka, seperti kedengkian dan dari permusuhan. Mereka hidup di dalam surga dalam keadaan bersaudara, di mana saling mencintai satu dengan yang lain, mereka duduk di singgasana yang besar, wajah mereka saling menyapa untuk menjalin hubungan dan cinta. Di dalamnya mereka tidak merasa lelah dan payah Dan mereka di dalamnya hidup abadi di selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Sesungguhnya orang-orang yang bertakwa kepada Tuhan mereka dengan melaksanakan perintah-Nya dan menjauhi larangan-Nya berada di dalam surga-surga dan mata air-mata air."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45-48. Sungguh orang-orang bertakwa yang mentaati segala perintah dan larangan Allah akan berada dalam surga-surga yang subur, dan mata airnya tawar dan segar. Akan dikatakan kepada mereka: “Masuklah ke dalam surga dari delapan pintunya dengan penuh keselamatan dari segala keburukan dan ketakutan.” Kami mencabut kedengkian dan permusuhan dari dalam dada mereka, sehingga mereka merasakan indahnya persaudaraan dan kasih sayang. Mereka duduk saling berhadapan dengan tenang di atas dipan-dipan; mereka tidak merasakan keletihan dan mereka kekal di dalam surga. Abu said al-Khudri berkata, Rasulullah bersabda: “Orang-orang beriman yang terbebas dari neraka, mereka akan tertahan di jembatan antara surga dan neraka, mereka akan saling diqishash atas kezaliman yang terjadi di antara mereka di dunia, hingga ketika mereka telah bersih, mereka diizinkan untuk memasuki surga. Dan demi jiwa Muhammad yang ada ditangan-Nya, mereka lebih mengetahui tempat tinggal mereka di surga daripada tempat tinggal mereka di dunia.” (Shahih al-Bukhari 11/403 no. 6535, kitab ar-Riqaaq, bab qishash pada hari kiamat)."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Sesungguhnya orang-orang yang bertakwa itu berada dalam surga atau taman-taman dan berada di dekat mata air yang mengalir. Ayat ini turun kepada Salman Alfarisi yang hatinya tersakiti yang melarikan diri selama tiga hari karena takut dan tidak sadar ketika mendengar ayat Sesungguhnya Jahannam itu untuk pengikut setan semuanya [43]"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya orang-orang yang bertakwa berada dalam surga dan mata air"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Usai Allah menjelaskan apa yang dipersiapkanNya bagi para musuhNya, para pengikut iblis, berupa hukuman dan siksa yang dahsyat, maka Dia mengungkapkan apa saja yang Dia sediakan bagi para waliNya, berupa kemurahan yang besar dan kenikmatan yang lestari. 45. Allah berfirman “sesungguhnya orang orang yang bertakwa” yaitu orang orang yang khawatir (terjerumus) taat kepada setan dan ajakan ajakan yang ia serukan kepada mereka, dari segala jenis dosa dan kemaksiatan “berada dalam surga (taman taman) dan (di dekat) mata air mata air (yang mengalir)” taman taman itu telah mencakup seluruh tanaman dan semua buah buahannya yang lezat lezat yang masak disetiap saat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّ ٱلۡمُتَّقِينَ) Innal muttaqiin : “Sesungguhnya orang-orang yang bertakwa” yaitu orang-orang yang takut kepada Rabb mereka, sehingga mereka hanya menyembah-Nya dan sesuai dengan apa yang disyariatkan. Makna ayat Ketika Allah ta’ala menjelaskan balasan bagi para pengikut Iblis yang sesat, kemudian menyebutkan balasan bagi para hamba Ar-Rahman, orang-orang yang bertakwa lagi beriman, Allah ta’ala berfirman mengabarkan apa yang telah Dia siapkan bagi mereka berupa kenikmatan yang abadi (إِنَّ ٱلۡمُتَّقِينَ) “Sesungguhnya orang-orang yang bertakwa” bertakwa kepada Allah, dengan meninggalkan syirik dan maksiat (فِي جَنَّٰتٖ وَعُيُونٍ) “mereka berada di dalam taman-taman dan mata air.” Pelajaran dari ayat: • Penegasan kenikmatan surga, bahwa kenikmatannya bersifat jasmani dan rohani keduanya bersifat abadi. • Bersihnya kenikmatan surga dari segala yang mengurangi dan mengeruhkannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 45: Setelah Allah Subhaanahu wa Ta'aala menyebutkan apa yang disiapkan-Nya untuk para pengikut Iblis dari kalangan jin dan manusia berupa siksa yang pedih, maka Allah Subhaanahu wa Ta'aala menyebutkan apa yang disiapkan-Nya untuk para wali-Nya berupa karunia yang besar dan nikmat yang kekal. Taman-taman itu penuh dengan pohon-pohon yang berbuah lagi enak rasa buahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 45",
    "description": "Usai menggambarkan siksaan dalam neraka jahanam yang menanti orang-orang yang sesat dan enggan bertobat, dalam ayat-ayat berikut Allah menjelaskan balasan bagi hamba-hamba-Nya yang taat dan patuh. Allah menyatakan bahwa sesungguhnya orang yang bertakwa itu, yakni mereka yang mematuhi petunjuk Allah dan berserah diri kepada-Nya, berada dalam surga-surga. Mereka tinggal dan mendapat ganjaran di taman-taman yang keindahannya tidak dapat dilukiskan dengan kata-kata. Dan di dekat kediaman mereka dijumpai mata air yang mengalir. Ketika orang-orang yang bertakwa itu hendak memasuki pintu surga, malaikat menyambut mereka, masuklah ke dalamnya dengan sejahtera dan aman dari kekurangan, ketakutan, kesedihan, kegundahan, bahkan bencana dan malapetaka."
  }
]