[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-48. Sesungguhnya orang-orang yang bertakwa kepada Allah dengan melaksanakan perintahnya dan menjauhi apa yang dilarang, akan ada di Kebun-kebun dan di sungai-sungai yang mengalir. Dikatakan kepada mereka, “Masuklah kalian kedalam kebun-kebun ini dengan selamat dari seluruh keburukan dan aman dari semua siksaan.” Dan kami telah mencabut sifat-sifat buruk dari diri hati-hati mereka, seperti kedengkian dan dari permusuhan. Mereka hidup di dalam surga dalam keadaan bersaudara, di mana saling mencintai satu dengan yang lain, mereka duduk di singgasana yang besar, wajah mereka saling menyapa untuk menjalin hubungan dan cinta. Di dalamnya mereka tidak merasa lelah dan payah Dan mereka di dalamnya hidup abadi di selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Saat mereka masuk dikatakan kepada mereka, silakan masuk dengan keselamatan dari segala kekurangan dan aman dari segala ketakutan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. ادْخُلُوهَا (Masuklah ke dalamnya) Dikatakan kepada mereka “masuklah ke dalamnya” sebelum mereka memasukinya. Pendapat lain mengatakan maknanya adalah ketika mereka telah berada di surga kemudian mereka berpindah dari satu tingkat ke tingkat yang lain, maka akan dikatakan kepada mereka “masuklah ke dalam surga dengan keselamatan dan keamanan.” بِسَلٰمٍ ءَامِنِينَ (dengan sejahtera lagi aman) Yakni selamat dari segala marabahaya dan aman dari segala ketakutan. Atau kesejahteraan bagi mereka dari Allah Ta’ala."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Dikatakan kepada mereka orang-orang yang bertakwa: “Masuklah ke dalamnya dengan sejahtera dari segala ketakutan lagi aman dari segala yang tidak disenangi.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Masuklah ke dalamnya dengan sejahtera} dengan selamat dari petaka {dan aman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. Dikatakan kepada mereka ketika hendak memasukinya, ”masuklah kedalamnya dengan sejahtera lagi aman” dari kematian, tidur, kelelahan, dan kelesuan serta putusnya aliran kenikmatan yang mana mereka sedang larut didalamnya atau berkurangnya kenikmatan, dan juga (aman) dari penyakit, kesedihan, kerisauan, dan seluruh persoalan yang mengeruhkan pikiran”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Dan dikatakan kepada mereka, (ٱدۡخُلُوهَا بِسَلَٰمٍ ءَامِنِينَ) “masuklah kedalamnya dengan keselamatan dan keamanan.” Keselamatan selalu menyertai kalian, aman dari rasa takut dan khawatir."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 46: Sejahtera dari bencana dan malapetaka, aman dari maut, tidak lelah dan letih, kenikmatannya tidak pernah putus, tidak pernah sakit, tidak pernah sedih dan tidak pernah tua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 46",
    "description": "Ketika orang-orang yang bertakwa itu hendak memasuki pintu surga, malaikat menyambut mereka, masuklah ke dalamnya dengan sejahtera dan aman dari kekurangan, ketakutan, kesedihan, kegundahan, bahkan bencana dan malapetaka. Allah menjelaskan dalam ayat-ayat berikut kondisi kejiwaan dan hubungan timbal-balik di antara orang-orang yang bertakwa di surga. Allah menyatakan, dan di surga kelak akan kami lenyapkan segala rasa dendam, benci, dengki, dan iri yang ada dan terpendam dalam hati mereka selama di dunia. Dengan demikian, mereka merasa bersaudara dan bersahabat satu dengan lainnya dalam suasana bahagia dan gembira. Mereka duduk saling berhadapan di atas dipan-dipan yang telah disiapkan bagi mereka. (lihat: surah al-wa'qi'ah/56: 15'23)."
  }
]