[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-48. Sesungguhnya orang-orang yang bertakwa kepada Allah dengan melaksanakan perintahnya dan menjauhi apa yang dilarang, akan ada di Kebun-kebun dan di sungai-sungai yang mengalir. Dikatakan kepada mereka, “Masuklah kalian kedalam kebun-kebun ini dengan selamat dari seluruh keburukan dan aman dari semua siksaan.” Dan kami telah mencabut sifat-sifat buruk dari diri hati-hati mereka, seperti kedengkian dan dari permusuhan. Mereka hidup di dalam surga dalam keadaan bersaudara, di mana saling mencintai satu dengan yang lain, mereka duduk di singgasana yang besar, wajah mereka saling menyapa untuk menjalin hubungan dan cinta. Di dalamnya mereka tidak merasa lelah dan payah Dan mereka di dalamnya hidup abadi di selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan Kami mencabut kedengkian dan kebencian yang ada di dalam dada mereka, Kami menjadikan mereka saudara-saudara yang saling mengasihi, duduk di atas dipan-dipan besar, yang sebagian mereka saling memandang kepada sebagian lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍّ (Dan Kami lenyapkan segala rasa dendam yang berada dalam hati mereka) Makna (الغل) yakni kedengkian dan permusuhan. إِخْوٰنًا (sedang mereka merasa bersaudara) Yakni saudara seagama dan mereka saling mengasihi. عَلَىٰ سُرُرٍ مُّتَقٰبِلِينَ(duduk berhadap-hadapan di atas dipan-dipan) Yakni mereka saling bertatap muka. Makna (السرير) yakni tempat duduk yang tinggi yang disiapkan untuk tempat kebahagiaan. Diriwayatkan dari Ali bin Abi Thalib dengan sanad yang berbeda-beda, bahwa ia berkata kepada Ibnu Thalhah: sungguh aku benar-benar berharap aku dan ayahmu termasuk orang-orang yang dimaksud dalam firman Allah: وَنَزَعْنَا مَا فِى صُدُورِهِم مِّنْ غِلٍ إِخْوٰنًا عَلَىٰ سُرُرٍ مُّتَقٰبِلِينَ"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Kami telah melenyapkan segala rasa dendam, hasad yang berada dalam hati mereka para penghuni surga, sedang mereka bersaudara dan saling mencintai, duduk berhadap-hadapan di atas dipan-dipan yang tinggi. Ayat ini turun untuk Abu Bakar dan Umar sebab terlepasnya belenggu Jahiliyyah antara Bani Hasyim, Bani Addi dan Bani Tamim"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mencabut} Kami mengeluarkan {apa yang ada dalam hati mereka yang berupa dendam} dendam dan permusuhan {Mereka bersaudara duduk di atas dipan dengan berhadap-hadapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “dan kami lenyapkan segala rasa dendam yang berada dalam hati mereka” maka hati mereka senantiasa selamat dari setiap dendam, kedengkian, bersih lagi saling mencintai kepada sesama “sedang mereka merasa bersaudara duduk berhadap hadapan diatas dipan dipan” hal ini menunjukan tentang terjadinya saling berkunjung dan bertemu serta kesopanan etika diantara mereka karena setiap orang saling berhadapan dengan yang lain, tidak membelakanginya duduk bertelekan pada dipan dipan yang berhiaskan kasur, permata, dan berbagai batu batu mulia."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلٍّ) wa naza’naa maa fii shudhuurihim min ghill : “Dan Kami cabut dari dada mereka berupa kebencian.” : iri, dengki, permusuhan, dan perseteruan. (عَلَىٰ سُرُرٖ مُّتَقَٰبِلِينَ) ‘alaa suruim mutaqaabiliin : “Di atas dipan-dipan saling berhadapan.” Yaitu saling melihat satu sama lain, selama mereka duduk, ketika mereka telah pergi, dipan itu akan berputar sehingga tidak bisa melihat satu sama lain lagi. Makna ayat: Firman-Nya (وَنَزَعۡنَا مَا فِي صُدُورِهِم مِّنۡ غِلٍّ) “Dan Kami hilangkan dari dada mereka berupa kebencian.” Yaitu, Allah tidak menyisakan pada dada para penghuni surga hal yang dapat mengurangi kenikmatan surga atau mengeruhkan kebersihannya, seperti kebencian, iri, permusuhan, dan perseteruan. Firman-Nya : (إِخۡوَٰنًا عَلَىٰ سُرُرٖ مُّتَقَٰبِلِينَ) “(sedang mereka merasa) bersaudara duduk berhadap-hadapan di atas dipan-dipan.” Ketika hati mereka sudah bersih dari segala sesuatu yang dapat mengurangi dan mengkeruhkan kenikmatan surga, mereka berada di dalam kasih sayang satu sama lain, saling bersaudara, mereka disatukan dalam satu majlis duduk bersama saling berhadapan, ketika mereka ingin kembali ke istana mereka masing-masing, dipan itu berputar sehingga mereka tidak bisa melihat satu sama lain lagi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 47: Yakni satu sama lain tidak melihat tengkuk saudaranya. Hal ini menunjukkan bahwa mereka saling menziarahi dan berkumpul bersama, adab dan akhlak mereka sangat mulia, di mana masing-masing berhadap-hadapan dan tidak membelakangi, sambil bertelekan di atas dipan-dipan yang dihiasi permadani, mutiara dan berbagai perhiasan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 47",
    "description": "Allah menjelaskan dalam ayat-ayat berikut kondisi kejiwaan dan hubungan timbal-balik di antara orang-orang yang bertakwa di surga. Allah menyatakan, dan di surga kelak akan kami lenyapkan segala rasa dendam, benci, dengki, dan iri yang ada dan terpendam dalam hati mereka selama di dunia. Dengan demikian, mereka merasa bersaudara dan bersahabat satu dengan lainnya dalam suasana bahagia dan gembira. Mereka duduk saling berhadapan di atas dipan-dipan yang telah disiapkan bagi mereka. (lihat: surah al-wa'qi'ah/56: 15'23)selain itu, mereka juga tidak merasa lelah, letih, maupun jenuh di dalamnya. Mereka tidak lagi perlu bersusah payah melakukan berbagai usaha untuk memenuhi kebutuhan hidup mereka, seperti yang dulu mereka lakukan di dunia. Apa saja yang mereka butuhkan sudah tersedia di dalam surga, dan lebih dari itu, mereka pun tidak akan dikeluarkan darinya; mereka kekal dalam kenikmatan surga itu."
  }
]