[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "45-48. Sesungguhnya orang-orang yang bertakwa kepada Allah dengan melaksanakan perintahnya dan menjauhi apa yang dilarang, akan ada di Kebun-kebun dan di sungai-sungai yang mengalir. Dikatakan kepada mereka, “Masuklah kalian kedalam kebun-kebun ini dengan selamat dari seluruh keburukan dan aman dari semua siksaan.” Dan kami telah mencabut sifat-sifat buruk dari diri hati-hati mereka, seperti kedengkian dan dari permusuhan. Mereka hidup di dalam surga dalam keadaan bersaudara, di mana saling mencintai satu dengan yang lain, mereka duduk di singgasana yang besar, wajah mereka saling menyapa untuk menjalin hubungan dan cinta. Di dalamnya mereka tidak merasa lelah dan payah Dan mereka di dalamnya hidup abadi di selamanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Di dalamnya mereka tidak merasa lelah, mereka tidak dikeluarkan darinya, sebaliknya mereka kekal di dalamnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. لَا يَمَسُّهُمْ فِيهَا نَصَبٌ (Mereka tidak merasa lelah di dalamnya) Yakni rasa letih."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Perhatikan firman ayat ini : { لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ } \"Mereka tidak merasa lelah di dalamnya (surga) dan mereka sekali-kali tidak akan dikeluarkan daripadanya\", lalu bandingkan dengan ayat yang satu ini : { لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي كَبَدٍ } \"Sesungguhnya Kami telah menciptakan manusia berada dalam susah payah\" [ Al-Balad : 4 ], kamu akan mendapati bahwa diantara hal yang diinginkan oleh Allah pada hamba-Nya di hari akhir adalah : bagaimana Ia menjelaskan bahwa dunia ini penuh dengan keletihan dan kesusahan, dan kemudian Ia menjelaskan balasan atas itu semua : bahwa sesungguhnya di surga tidak akan ada keletihan sedikitpun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Mereka para penduduk surga tidak merasa lelah di dalamnya dan mereka sekali-kali tidak akan dikeluarkan dari surga, namun mereka kekal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka tidak merasa} mereka tidak merasa {lelah} lelah {di dalamnya dan tidak akan dikeluarkan darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “mereka tidak merasa lelah didalamnya” baik lahir maupun batin. Keadaan demikian karena Allah telah menciptakan mereka dalam bentuk dan kehidupan yang sempurna, yang menolak semua kehancuran. ”dan mereka sekali kali tidak akan dikeluarkan dari padanya” disegenap waktu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَا يَمَسُّهُمۡ فِيهَا نَصَبٞ) laa yamassuhum fiihaa nashab : “mereka tidak merasa letih.” Lelah. Makna ayat: Firman-Nya ta’ala (لَا يَمَسُّهُمۡ فِيهَا نَصَبٞ) “mereka tidak tertimpa keletihan dan mereka tidak pula akan keluar darinya.” Pada ayat ini terdapat dua kenikmatan, nikmat kenyamanan yang abadi, karena tidak ada keletihan dan kesulitan di surga, dan nikmat tinggal dan abadi di dalamnya (surga), karena mereka tidak akan keluar darinya selamanya. Ini adalah penegasan akan akidah kebangkitan dan pembalasan dengan penjelasan yang jelas dan gamblang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 48: Yang demikian adalah karena Allah menciptakan mereka dalam keadaan yang sempurna."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 48",
    "description": "Selain itu, mereka juga tidak merasa lelah, letih, maupun jenuh di dalamnya. Mereka tidak lagi perlu bersusah payah melakukan berbagai usaha untuk memenuhi kebutuhan hidup mereka, seperti yang dulu mereka lakukan di dunia. Apa saja yang mereka butuhkan sudah tersedia di dalam surga, dan lebih dari itu, mereka pun tidak akan dikeluarkan darinya; mereka kekal dalam kenikmatan surga itu. Usai menjelaskan kedudukan dan siksa yang Allah siapkan bagi orang-orang kafir di neraka, dan ganjaran yang dia janjikan bagi orangorang yang bertakwa di surga, Allah lalu meminta nabi Muhammad untuk menyampaikan kabar gembira kepada mereka semua, baik yang taat maupun yang durhaka. Allah berfirman, kabarkanlah, wahai nabi Muhammad, kepada hamba-hamba-ku yang taat maupun yang bergelimang dosa dan hendak bertobat bahwa aku-lah yang maha pengampun lagi maha penyayang. Dan katakan pula kepada orang-orang yang kafir dan para pendosa yang enggan bertobat bahwa sesungguhnya azab-ku adalah azab yang sangat pedih."
  }
]