[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "49-50. Beritahukanlah (wahai Rasul), kepada hamba-hambaKu bahwa sesungguhnya Aku benar-benar Maha Pengampun dan orang-orang Mukmin yang bertaubat, Maha Penyayang kepada mereka. Dan sesungguhnya siksaanKu dalah siksaan yang pedih dan menyakitkan bagi orang yang tidak mau bertaubat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Kasih tahu hamba-hamba-Ku -wahai Rasul- bahwa sesungguhnya Aku Maha Pengampun bagi siapa yang bertobat diantara mereka lagi Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49-50. Sampaikanlah dengan pasti kepada hamba-hamba-Ku bahwa Aku Maha Pengampun bagi mereka yang bertaubat dan Maha Mengasihi mereka, dan azab-Ku sangatlah pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. نَبِّئْ عِبَادِىٓ أَنِّىٓ أَنَا الْغَفُورُ الرَّحِيمُ (Kabarkanlah kepada hamba-hamba-Ku, bahwa sesungguhnya Aku-lah Yang Maha Pengampun lagi Maha Penyayang) Yakni wahai Muhammad, beritahukanlah kepada mereka bahwa aku memiliki banyak ampunan atas dosa-dosa, dan memiliki banyak kasih sayang bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Kabarkanlah kepada hamba-hamba-Ku wahai Nabi, bahwa sesungguhnya Aku-lah Yang Maha Pengampun atas dosa mereka lagi Maha Penyayang jika mereka mau bertaubat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kabarkanlah} beritahulah {kepada hamba-hambaKu bahwa sesungguhnya Akulah Dzat Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Sesudah Allah menceritakan kabar kabar yang dapat membangkitkan rasa cinta dan takut dari sesuatu yang dibuat oleh Allah, berupa surge dan neraka, maka Allah menyebutkan (dalam ayat ini) sesuatu yang membangkitkan perasaan tersebut, dengan menyebutkan sifat sifatNya. Allah berfirman “kabar kan kepada hamba hambaKu” beritahukanlah kepada mereka dengan kepastian dan di dukung oleh bukti bukti nyata, ”bahwa Aku-lah yang Maha Pengampun lagi Maha Penyayang” sesungguhnya mereka itu jika mengetahui kesempurnaan rahmat dan ampunan Allah tentu akan berusaha menempuh langkah langkah yang mengantarkan mereka menuju rahmatNya, dan meninggalkan dosa dosa dan bertaubat darinya, supaya dapat meraih ampunan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya ta’ala (نَبِّئۡ عِبَادِيٓ أَنِّيٓ أَنَا ٱلۡغَفُورُ ٱلرَّحِيمُ) “Kabarkanlah kepada hamba-hamba-Ku bahwa Aku adalah Yang Maha Pengampun lagi Maha Penyayang.” Yaitu kabarkanlah wahai Rasul Kami, kepada para hamba Kami yang beriman yang bertauhid, bahwa Rabb mereka adalah Maha Pengampun bagi mereka, jika mereka berbuat dosa dan bertaubat dari maksiat. Maha Penyayang kepada mereka, tidak menyiksa. Pelajaran dari ayat: • Janji Allah dengan ampunan bagi yang bertaubat dari orang-orang yang beriman dan bertakwa dan orang-orang yang bertauhid."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 49: Hal ini karena apabila mereka mengetahui sempurnanya rahmat dan ampunan-Nya, maka mereka akan berusaha mengerjakan sebab yang dapat mengantarkan mereka kepada rahmat-Nya, berhenti dari dosa dan bertobat darinya agar memperoleh ampunan-Nya. Meskipun demikian, mereka tidak boleh terus-menerus mengandalkan rahmat dan ampunan Allah sampai merasa aman dan tertidur nyenyak olehnya sehingga membuat mereka berani berbuat maksiat. Oleh karena itu, dalam ayat selanjutnya Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya untuk memberitahukan pula kepada hamba-hamba-Nya bahwa azab-Nya kepada para pelaku maksiat sangat pedih, di mana tidak ada yang menyamai azab-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 49",
    "description": "Usai menjelaskan kedudukan dan siksa yang Allah siapkan bagi orang-orang kafir di neraka, dan ganjaran yang dia janjikan bagi orangorang yang bertakwa di surga, Allah lalu meminta nabi Muhammad untuk menyampaikan kabar gembira kepada mereka semua, baik yang taat maupun yang durhaka. Allah berfirman, kabarkanlah, wahai nabi Muhammad, kepada hamba-hamba-ku yang taat maupun yang bergelimang dosa dan hendak bertobat bahwa aku-lah yang maha pengampun lagi maha penyayang. Dan katakan pula kepada orang-orang yang kafir dan para pendosa yang enggan bertobat bahwa sesungguhnya azab-ku adalah azab yang sangat pedih"
  }
]