[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Satu umat tidak akan melewati batas ajalnya sehingga bertambah darinya, dan tidak mendahuluinya dengan mengurangi waktunya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Satu umat dari umat-umat yang mendustakan tidak akan binasa sebelum masa yang telah ditetapkan. Bila masa itu tiba, maka itu tidak bisa ditunda sesaat pun. Karena itu orang-orang zalim jangan terkecoh bila Allah menangguhkan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. مَّا تَسْبِقُ مِنْ أُمَّةٍ أَجَلَهَا (Tidak ada suatu umatpun yang dapat mendahului ajalnya) Yakni tiak akan datang kematiannya sebelum datang ajal yang telah ditentukan. وَمَا يَسْتَـْٔخِرُونَ(dan tidak (pula) dapat mengundurkan(nya)) Maka tidak patut bagi orang yang berakal tertipu oleh penangguhan mereka sampai ajalnya ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Waktu kebinasaan suatu kaum tidak dapat dimajukan atau ditunda sedikitpun. Tidak ada suatu umatpun yang dapat menyegrakan ajalnya, dan tidak pula dapat mengundurkannya. Penyebutan kata {yasta’khirun} yang merujuk kepada {ummah} itu untuk menyimpan maknanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Tidak ada satu umat pun yang dapat menyegerakan} mendahulukan {ajalnya dan tidak pula menangguhkannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “tidak ada suatu umatpun yang dapat mendahului ajalnya, dan tidak (pula) dapat mengundurkan(nya)” (semua sudah ditentukan waktunya) kalau tidak demikan, dosa dosa pasti memperlihatkan pengaruh (buruk)nya, kendatipun tidak langsung muncul (berupa siksaan)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata : (مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا) maa tasbiqu min ummatin ajalahaa : “tidaklah suatu umat dapat menpercepat ajalnya.” Batas waktu yang telah ditentukan tidak dapat dimajukan. Kata (من) disini adalah tambahan. Makna ayat : Firman-Nya : (مَّا تَسۡبِقُ مِنۡ أُمَّةٍ أَجَلَهَا وَمَا يَسۡتَ‍ٔۡخِرُونَ ) “Tidak ada suatu umat pun yang dapat mendahului ajalnya, dan tidak pula mengakhirkannya.” Yaitu sesuai dengan tulisan takdir, karena suatu negeri yang telah Allah tetapkan kehancurannya tidak bisa mempercepat kehancuran tersebut sebelum waktunya dan tidak pula mengakhirkannya sekalipun hanya sekejap. Pada hal ini, terdapat peringatan dan ancaman bagi penduduk Mekah, karena mereka memusuhi dakwah yang benar dan Rasul yang benar, bisa jadi negeri mereka telah ditentukan kehancurannya sedangkan mereka tidak menyadarinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 5",
    "description": "Ajal adalah ketetapan yang sudah Allah tentukan waktunya, karena itu tidak ada suatu umat pun yang dapat mendahului ajalnya, dan tidak pula dapat meminta penundaan darinya. Dan tidak hanya melakukan perbuatan buruk, orang kafir juga mengucapkan perkataan yang menyakiti nabi Muhammad. Mereka berkata, wahai orang yang kepadanya diturunkan Al-Qur'an, sesungguhnya engkau, wahai Muhammad, benar-benar orang gila karena mengakui apa yang kausampaikan bersumber dari Allah."
  }
]