[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tatkala mereka masuk menemuinya, mereka berkata “ Salam (Keselamatan bagi kalian). Lalu Ibrahim menjawab salam mereka, kemudian menghidangkan makanan bagi mereka, lalu mereka tidak memakannya. Ia pun berkata, “ Sesungguhnya kami takut kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Manakala mereka datang kepada Ibrahim, mereka mengucapkan salam, maka Ibrahim menjawab dengan jawaban yang lebih baik. Ibrahim menyuguhkan anak sapi bakar agar para tamunya menyantapnya, Ibrahim menyangka mereka adalah manusia, manakala mereka tidak makan, maka Ibrahim berkata, “Sesungguhnya aku takut kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Ketika mereka memasuki rumah Ibrahim dengan mengucapkan salam, maka Ibrahim menjawab salam mereka. Namun ketika dia menyuguhkan makanan bagi mereka dan melihat tangan mereka tidak menjamahnya, ia berkata: “Sungguh kami merasa takut dari kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. قَالَ إِنَّا مِنكُمْ وَجِلُونَ (Sesungguhnya kami merasa takut kepadamu) Nabi Ibrahim mengakatan ini setelah menghidangkan kepada mereka daging sapi namun mereka tidak memakannya. Sebagaimana dikisahkan dalam surat Huud."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Ketika mereka masuk ke tempat Ibrahim, lalu mereka mengucapkan: “Salaam”. Berkata Ibrahim: “Sesungguhnya kami merasa kaget dan takut kepada kalian, karena kalian masuk tanpa izin.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika mereka berkunjung ke tempatnya, lalu mengucapkan,“Salam” Ibrahim berkata, “Sesungguhnya kami adalah orang-orang yang takut kepadamu”} orang-orang yang takut"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. “ketika mereka masuk ke tempatnya, lalu mereka masuk ke tempatnya, lalu mereka mengucapkan ‘salam’” maksudnya para malaikat melontarkan salam kepada beliau. Lantas beliau menjawab salam mereka. ”Ibrahim berkata ’sesungguhnya kami merasa takut kepadamu’” maksudnya kami merasa takut. Pasalnya, ketika mereka masuk menemui beliau, dan beliau menduga mereka sebagai tamu maka beliau lantas bersegera menuju rumahnya dan menyiapkan jamuan bagi mereka berupa daging sapi yang empuk dan menyuguhkannya kepada mereka, saat melihat tangan tangan mereka tidak menyentuhnya, maka beliau merasa takut kepada mereka, kalau mereka adalah para pencuri atau orang orang semacam itu. maka mereka berkata kepada beliau,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّا مِنكُمۡ وَجِلُونَ) innaa minkum wajiluun : Kami merasa takut, yaitu ketika mereka menolak untuk makan. Makna ayat: ketika mereka masuk menemuinya, lantas mereka berkata, Salaman.” Mereka memberi salam kepadanya dan Ibrahim membalas salam mereka, lalu memberikan mereka jamuan tamu, yaitu anak sapi bakar, sebagaimana yang telah dijelaskan pada surat Hud, kemudian menyuruh mereka untuk makan, namun mereka enggan, pada saat itu Ibrahim berkata (إِنَّا مِنكُمۡ وَجِلُونَ ) “Sesungguhnya kami merasa takut kepada kalian.” Mereka adalah Jibril, Mikail, dan Israfil dalam bentuk pemuda yang tampan, maka ketika ia mengabarkan rasa takut akan mereka—karena adat jika yang singgah di rumah seseorang, jika tidak memakan jamuannya maka tamu tersebut menginginkan keburukan. Pelajaran dari ayat: • Disyariatkan menjamu tamu, ini merupakan perbuatan yang baik lagi mulia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 52: Ketika Beliau menghidangkan makanan untuk mereka, namun mereka tidak makan. Hal ini menunjukkan, bahwa para malaikat tidak makan dan tidak minum."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 52",
    "description": "Kabarkanlah bagaimana ketika mereka masuk ke tempatnya, yaitu rumah nabi ibrahim, lalu mereka mengucapkan, 'salam kepadanya. Nabi ibrahim pun menjawab, salam. Tidak lama kemudian nabi ibrahim menyuguhkan daging sapi muda yang dipanggang. Tidak satu pun dari para tamu itu menjamah suguhan nabi ibrahim. Ini merupakan hal yang tidak wajar. Melihat keanehan itu, dia (ibrahim) berkata, kami, yakni aku dan istriku, benar-benar merasa takut kepadamu. (lihat: surah hud/11: 70)mendengar ucapan nabi ibrahim, mereka, yakni para tamu itu, berkata, janganlah engkau merasa takut atas kedatangan kami, karena sesungguhnya kami datang untuk memberi kabar gembira kepadamu dengan kelahiran seorang anak laki-laki yang sehat, yang akan tumbuh dewasa dan menjadi orang yang pandai dan luas serta dalam pengetahuannya. Kelak engkau akan memberinya nama ishak. (lihat: surah ash-shaffat/ 37: 112)."
  }
]