[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Malaikat berkata kepadanya, “janganlah kamu takut, sesungguhnya kami datang menyampaikan kabar gembira kepadamu dengan (kelahiran) seorang anak yang mempunyai ilmu yang banyak tentang agama, yaitu Ishaq.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Para utusan dari Malaikat itu berkata, “Tidak usah takut, karena kami datang mengabarimu sesuatu yang membahagiakanmu, kamu akan mempunyai seorang anak laki-laki yang alim menguasai ilmu-ilmu agama.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Para malaikat berkata: “Janganlah kamu takut, kami datang untuk menyampaikan kabar gembira bagimu bahwa kamu akan dikaruniai anak yang tinggi ilmunya yang bernama Ishaq."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. قَالُوا۟ لَا تَوْجَلْ (Mereka berkata: “Janganlah kamu merasa takut) Yakni para malaikat bekata kepadanya “janganlah kamu takut” إِنَّا نُبَشِّرُكَ بِغُلٰمٍ عَلِيمٍ (sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran seorang) anak laki-laki yang alim) Yakni anak yang memiliki banyak ilmu. Yakni kelahiran Ishaq."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Jika seseorang diantara kalian mengunjungi saudaranya dan ia mendapati pada dirinya ada rasa takut, maka hiburlah dia dengan berita yang menggembirakan; sehingga hatinya bisa menjadi tenang bersamamu, sebelum kamu berbicara dengannya tentang perkara yang kamu miliki, ambil lah pelajaran dari ayat ini : { قَالُوا لَا تَوْجَلْ إِنَّا نُبَشِّرُكَ بِغُلَامٍ عَلِيمٍ } \"Mereka berkata: \"Janganlah kamu merasa takut, sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran seorang) anak laki-laki (yang akan menjadi) orang yang alim\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Mereka berkata: “Janganlah kamu merasa takut, sesungguhnya kami memberi kabar gembira kepadamu atas kelahiran seorang anak laki-laki yang akan menjadi orang yang alim yaitu Ishaq”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka berkata,“Janganlah merasa takut} jangan takut {sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran) anak laki-laki yang alim”} memiliki banyak pengetahuan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “janganlah kamu merasa takut, sesungguhnya kami memberi kabar gembira kepadamu dengan (kelahiran seorang) anak laki laki (yang akan menjadi) orang alim” yaitu ishaq. kabar gembira ini mengandung keterangan bahwa ia adalah seorang lelaki, bukan seorang wanita ”yang akan menjadi” orang alim maksudnya ilmunya banyak"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (بِغُلَٰمٍ عَلِيمٖ) bighulaamin ‘aliim : dengan anak yang mempunyai ilmu yang luas, Ishaq ‘alaihis salam Makna ayat: (قَالُواْ لَا تَوۡجَلۡ) “Mereka berkata, ‘Janganlah takut.’” (إِنَّا نُبَشِّرُكَ بِغُلَٰمٍ عَلِيمٖ) “Kami memberikan kabar gembira akan seorang anak yang pandai.” Seorang anak yang mempunyai banyak ilmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 53: Yang dimaksud dengan seorang anak laki-laki yang alim di sini adalah Ishak ‘alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 53",
    "description": "Mendengar ucapan nabi ibrahim, mereka, yakni para tamu itu, berkata, janganlah engkau merasa takut atas kedatangan kami, karena sesungguhnya kami datang untuk memberi kabar gembira kepadamu dengan kelahiran seorang anak laki-laki yang sehat, yang akan tumbuh dewasa dan menjadi orang yang pandai dan luas serta dalam pengetahuannya. Kelak engkau akan memberinya nama ishak. (lihat: surah ash-shaffat/ 37: 112)heran dengan berita itu, dia (ibrahim) berkata, wahai tamuku, benarkah kamu memberi kabar gembira kepadaku dengan kelahiran seorang anak yang telah lama aku impikan, padahal usiaku telah lanjut dan kekuatanku pun sudah melemah' rasanya tidak mungkin lagi bagiku untuk mendapatkan anak seperti yang kamu katakan. Lalu, bagaimana kamu memberi kabar gembira tersebut; yakni bagaimana hal itu dapat terwujud' (lihat: surah hud/11: 72)."
  }
]