[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ibrahim berkata dengan terheran-heran, “ Apakah kalian memberikan kabar gembira kepadaku dengan (kehadiran) anak, sedang aku seorang yang berusia lanjut dan istriku pun demukian pula. Maka dengan keajaiban apakah kalian akan memberikan kabar kepadaku?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Ibrahim terkejut dengan kabar gembira yang mereka sampaikan, dia berkata, “Benarkah kalian memberiku kabar gembira tentang kelahiran seorang anak sesudah aku berumur lanjut begini, apa dasar kabar gembira kalian ini?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54-55. Ibrahim heran dan meminta kepastian dari berita itu: “Apakah kalian memberiku kabar gembira berupa anak, sedangkan aku dan istriku telah tua, apakah kabar gembira itu benar?” Maka para malaikat menagaskan: “Kami memberimu kabar gembira berupa perkara yang telah ditetapkan oleh Allah, maka janganlah kamu berputus asa dari kehadiran seorang anak.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. قَالَ أَبَشَّرْتُمُونِى عَلَىٰٓ أَن مَّسَّنِىَ الْكِبَرُ (Berkata Ibrahim: “Apakah kamu memberi kabar gembira kepadaku padahal usiaku telah lanjut) Yakni padahal aku telah tua. فَبِمَ تُبَشِّرُونَ(maka dengan cara bagaimanakah (terlaksananya) berita gembira yang kamu kabarkan ini?) Nabi Ibrahim merasa heran terhadap anak yang akan dikaruniakan kepadanya sedangkan ia telah lanjut usia, dan kabar gembira yang terlihat mustahil biasanya adalah kabar yang tidak benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Ibrahim berkata: “Apakah kamu memberi kabar gembira kepadaku bahwa aku akan memiliki anak padahal usiaku telah lanjut, maka dengan cara bagaimanakah berita gembira yang kamu kabarkan ini bisa terlaksana?” ini adalah kalimat tanya yang berdasar pada kebiasaan yang terjadi bukan keraguan atas kuasa Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ibrahim berkata,“Apakah kalian akan memberi kabar gembira kepadaku, padahal aku sudah kanjut usia. Maka dengan apa} dengan apa {kalian memberi kabar gembira”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Ibrahim berkata” maksudnya Ibrahim berkata kepada mereka dengan nada keheranan atas berita menggembirakan ini, ”apakah kamu memberi kabar gembira kepadaku” dengan kelahiran seorang anak “padahal usiaku telah lanjut”, ada unsur perasaan dari beliau “maka dengan bagaimanakah (terlaksananya) berita gembira padahal faktor sebab kausalitas sudah tidak ada?\""
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَبِمَ تُبَشِّرُونَ) fabima tubasysyiruun : terkejut akan kabar gembira akan seorang anak, pada umur yang sudah tua. Makna ayat: maka Ibrahim membalas mereka seraya berkata sebagaimana yang Allah ta’ala kabarkan dengan firman-Nya (قَالَ أَبَشَّرۡتُمُونِي عَلَىٰٓ أَن مَّسَّنِيَ ٱلۡكِبَرُ فَبِمَ تُبَشِّرُونَ) “Dia (Ibrahim) berkata, ‘Benarkah kalian memberi kabar gembira kepadaku padahal usiaku telah lanjut, lalu (dengan cara) bagaimana kamu memberikan (kabar gembir) tersebut?” yaitu kabar gembira akan seorang anak—padahal umurku sudah lanjut, merupakan perkara yang menakjubkan, ketika ia terkejut akan kabar gembira ini dan mulai muncul tanda-tanda keraguan akan kebenaran kabar,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 54: Dengan seorang anak. Sedangkan sebab-sebab untuk memperoleh anak tidak ada, istrinya mandul, sedangkan Nabi Ibrahim sendiri sudah sangat tua."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 54",
    "description": "Heran dengan berita itu, dia (ibrahim) berkata, wahai tamuku, benarkah kamu memberi kabar gembira kepadaku dengan kelahiran seorang anak yang telah lama aku impikan, padahal usiaku telah lanjut dan kekuatanku pun sudah melemah' rasanya tidak mungkin lagi bagiku untuk mendapatkan anak seperti yang kamu katakan. Lalu, bagaimana kamu memberi kabar gembira tersebut; yakni bagaimana hal itu dapat terwujud' (lihat: surah hud/11: 72)mereka menjawab untuk meyakinkan ibrahim, kami menyampaikan kabar gembira kepadamu dengan benar. Apa yang kami sampaikan kepadamu adalah hal yang benar adanya, dan itu akan menjadi suatu kenyataan bagimu. Maka, janganlah engkau termasuk orang yang berputus asa dari nikmat dan karunia Allah."
  }
]