[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, “Kami memberikan kabar gembira kepadamu dengan kebenaran yang diberitahukan Allah kepada kami. Maka janganlah kamu termasuk orang-orang yang terputus asa untuk mendapatkan keturunan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Para utusan dari Malaikat itu berkata kepada Ibrahim, “Kami memberimu kabar gembira kebenaran yang tidak ada keraguan padanya, karena itu jangan termasuk orang-orang yang berputus asa dari kabar gembira yang kami sampaikan kepadamu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. قَالُوا۟ بَشَّرْنٰكَ بِالْحَقِّ (Mereka menjawab: “Kami menyampaikan kabar gembira kepadamu dengan benar) Yakni dengan kabar yang pasti yang tidak akan salah. فَلَا تَكُن مِّنَ الْقٰنِطِينَ(maka janganlah kamu termasuk orang-orang yang berputus asa”) Yakni janganlah termasuk orang yang berputus asa dari kabar yang kami sampaikan kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Malaikat menjawab: “Kami menyampaikan kabar gembira kepadamu dengan benar, maka janganlah kamu menjadi orang-orang yang berputus asa dari rahmat Allah untuk mempunyai anak di usia tua”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Kami menyampaikan kabar gembira kepadamu dengan benar. Maka janganlah termasuk orang yang berputus asa”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55 “mereka menjawab ’kami menyampaikan berita gembira kepadamu dengan benar” yang tidak mengandung keraguan padanya. Sebab, sesungguhnya Allah Mahakuasa atas segala sesuatu. Sedangkan kamu teristimewakan (oleh Allah) wahai pemilik rumah ini, rahmat Allah dan keberkahanNya semoga selalu tercurahkan pada kalian. maka janganlah dianggap aneh kucuran kemurahan dan kebaikan Allah kepada kalian. ”maka janganlah kamu termasuk orang orang yang berputus asa” yaitu orang orang yang menganggap mustahil kedatangan kebaikan kepada mereka. Bahkan, engkau mesti senantiasa mengharapkan curahan kebaikan, kebajikan, dan kenikmatanNya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مِّنَ ٱلۡقَٰنِطِينَ) minal qaanithiin : orang-orang yang berputus asa. Makna ayat: Mereka berkata (بَشَّرۡنَٰكَ بِٱلۡحَقِّ فَلَا تَكُن مِّنَ ٱلۡقَٰنِطِينَ) “Kami menyampaikan kabar gembira kepadamu dengan kebenaran, maka janganlah engkau termasuk orang-orang yang berputus asa.” Pelajaran dari ayat: • Haram berputus asa dari rahmat Allah ta’ala."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 55: Karena Allah ‘Azza wa Jalla Mahakuasa atas segala sesuatu. Terlebih yang mendapat kabar gembira ini adalah ahlul bait yang mendapat rahmat Allah dan berkah-Nya, sehingga tidak perlu merasa aneh terhadap karunia Allah dan ihsan-Nya kepadanya. Yaitu orang-orang yang menganggap tidak mungkin adanya kebaikan. Oleh karena itu, tetaplah kamu mengharap karunia Allah dan ihsan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 55",
    "description": "Mereka menjawab untuk meyakinkan ibrahim, kami menyampaikan kabar gembira kepadamu dengan benar. Apa yang kami sampaikan kepadamu adalah hal yang benar adanya, dan itu akan menjadi suatu kenyataan bagimu. Maka, janganlah engkau termasuk orang yang berputus asa dari nikmat dan karunia Allah. Dia(ibrahim)berkatamenanggapi pernyataan tamunya, ketahuilah, tidak ada orang yang berputus asa dari rahmat dan karunia tuhannya kecuali orang yang sesat. Mereka adalah orang-orang yang menyimpang dari jalan tuhan atau tidak menemukan jalan yang benar, dan tidak mengetahui kekuasaan Allah. Aku bukanlah orang yang demikian, karena itu aku tidak pernah berputus asa dari rahmat-Nya."
  }
]