[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-57. Ibrahim berkata, “Tidak ada yang berputus asa dari rahmat Tuhan-nya kecuali orang-orang yang keliru yang berpaling dari jalan kebenaran.” Ibrahim berkata, “ Apakah perkara penting yang kalian datang karenanya yang datang dari Allah wahai para utusan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Ibrahim berkata, “Bukankah yang berputus asa dari rahmat Rabbnya hanyalah orang-orang yang menyimpang dari jalan Allah yang lurus?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56-57. Maka hati Ibrahim menjadi tenang dan berkata: “Tidaklah berputus asa dari rahmat Allah melainkan orang-orang yang berpaling dari jalan yang benar.” Lalu dia bertanya kepada mereka: “Urusan besar apa yang membuat kalian datang ke sini?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. قَالَ وَمَن يَقْنَطُ مِن رَّحْمَةِ رَبِّهِۦٓ إِلَّا الضَّآلُّونَ (Ibrahim berkata: “Tidak ada orang yang berputus asa dari rahmat Tuhan-nya, kecuali orang-orang yang sesat”) Yakni aku merasa heran atas kelahiaran seorang anak bagiku karena aku telah lanjut usia dan bukan karena aku putus asa dari rahmat Tuhanku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Ibrahim berkata: “Tidak ada orang yang berputus asa dari rahmat Tuhan-nya, kecuali orang-orang yang sesat dari jalan kebenaran. Orang kafir yang tidak mengetahui kesempurnaan kuasa Allah dan keluasan rahmat-Nya.” Itu menunjukkan atas kebiasaan mempunyai anak dalam usia tua adalah hal mustahil, bukan pada kuasa Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang berputus asa atas kabar gembira yang kami sampaikan {Ibrahim berkata,“Siapakah yang berputus asa} berputus asa {dari rahmat Tuhannya selain orang yang sesat”} orang-orang yang menyimpang dari jalan kebenaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. maka Ibrahim menjawab mereka dengan menuturkan “tidak ada orang yang berputus asa dari rahmat Rabbnya, kecuali orang orang yang sesat” yaitu orang orang yang tidak mempunyai bekal ilmu apapun tentang Rabb mereka dan kesempurnaan kekuasanNya. Sementara itu, orang yang telah Allah karuniai hidayah dan ilmu yang agung, maka tidak ada celah baginya untuk berputus asa kepadaNya. Pasalnya, ia mengetahui dengan porsi banyak mengenai berbagai macam sebab kausalitas dan prasarana, serta jalur jalur menuju rahmat Allah. Berikutnya pasca menyampaikan kabar gembira ini, Ibrahim mengetahui bahwa para malaikat itu diutus untuk sebuah misi yang penting,"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kemudian ia menjawab perkataan mereka menghilangkan rasa putus asa dari dirinya, karena putus asa adalah hal yang diharamkan, (وَمَن يَقۡنَطُ مِن رَّحۡمَةِ رَبِّهِۦٓ إِلَّا ٱلضَّآلُّونَ) “Tidak ada yang berputus asa dari rahmat Rabbnya kecuali orang-orang yang sesat.” Yaitu orang-orang kafir kepada kekuasaan dan rahmat Allah, karena ketidaktahuan mereka kepada Rabb mereka dan sifat-sifat-Nya yang sangat jelas terlihat dalam rahmat-Nya kepada mereka dan kenikmatan-kenikmatan yang diberikan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 56: Yaitu orang-orang yang tidak mengenal Tuhannya dan tidak mengetahui sempurnanya kekuasaan-Nya. Adapun orang yang diberi nikmat oleh Allah dengan hidayah dan ilmu, maka tidak akan berputus asa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 56",
    "description": "Dia(ibrahim)berkatamenanggapi pernyataan tamunya, ketahuilah, tidak ada orang yang berputus asa dari rahmat dan karunia tuhannya kecuali orang yang sesat. Mereka adalah orang-orang yang menyimpang dari jalan tuhan atau tidak menemukan jalan yang benar, dan tidak mengetahui kekuasaan Allah. Aku bukanlah orang yang demikian, karena itu aku tidak pernah berputus asa dari rahmat-Nya. Setelah ibrahim yakin tamu-tamunya adalah malaikat, dia berkata, apakah urusanmu yang penting selain membawa kabar gembira itu kepada kami, wahai para utusan Allah'."
  }
]