[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "56-57. Ibrahim berkata, “Tidak ada yang berputus asa dari rahmat Tuhan-nya kecuali orang-orang yang keliru yang berpaling dari jalan kebenaran.” Ibrahim berkata, “ Apakah perkara penting yang kalian datang karenanya yang datang dari Allah wahai para utusan?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Ibrahim berkata kepada mereka, “Lalu apa yang kalian bawa wahai para utusan dari Allah -Ta'ālā-?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. قَالَ فَمَا خَطْبُكُمْ أَيُّهَا الْمُرْسَلُونَ (Berkata (pula) Ibrahim: “Apakah urusanmu yang penting (selain itu), hai para utusan?”) Yakni apa kepantingan kalian, atau apa yang kalian bawa selain kabar gembira yang telah kalian sampaikan kepadaku?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Ibrahim berkata: “Apakah ada lagi urusanmu yang penting selain untuk menyampaikan berita gembira ini hai para utusan?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Lalu apa perkara kalian} apa perkara yang kalian diutus untuk menyampaikannya {wahai para utusan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. “Dia berkata” Ibrahim al-khalil berkata kepada para malaikat, ”apakah urusanmu yang penting (selain itu) hai para utusan” apakah kepentingan kalian? mengapa kalian diutus?"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (قَالَ فَمَا خَطۡبُكُمۡ) Qaala famaa khathbukum : Apakah urusan kalian? Makna ayat: Masih membahas mengenai kisah tamu Nabi Ibrahim, dan dia telah bertanya kepada mereka, sebagaimana yang Allah kabarkan melalui firman-Nya : “Dia berkata, ‘Apakah urusan kalian, wahai para utusan?” yaitu, apakah urusan kalian wahai para utusan dari sisi Allah ta’ala, karena mereka adalah malaikat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 57: Ketika mereka memberitahukan berita gembira itu, maka Ibrahim tahu bahwa mereka adalah utusan Allah yang diutus untuk urusan yang penting."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 57",
    "description": "Setelah ibrahim yakin tamu-tamunya adalah malaikat, dia berkata, apakah urusanmu yang penting selain membawa kabar gembira itu kepada kami, wahai para utusan Allah'mereka menjawab, selain membawa berita gembira tentang kelahiran anakmu, sesungguhnya kami juga diutus oleh Allah kepada kaum nabi lut yang berdosa dan durhaka. Kami diutus untuk membinasakan mereka."
  }
]