[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "58-60. Mereka berkata, “ Sesungguhnya Allah telah mengutus kami untuk menghancurkan kum Luth yang menyekutukan Allah lagi sesat jalan, kecuali Luth dan keluarganya yang beriman kepadanya. Kami tidak akan membinasakan mereka dan akan menyelamatkan mereka semua. Akan tetapi, istrinya yang kafir, kami telah menetapkan berdasarkan perintah Allah untuk membinasakannya dan orang-orang lain yang ada dalam siksaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Para utusan dari Malaikat itu berkata, “Sesungguhnya Allah mengutus kami untuk membinasakan kaum yang melakukan kerusakan besar, keburukan besar, mereka adalah kaum Lūṭ."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58-60. Mereka menjawab: “Kami diutus Allah untuk membinasakan kaum Luth yang selalu melakukan dosa yang keji. Adapun Luth dan keluarganya yang beriman akan Kami selamatkan mereka semua dari kebinasaan. Akan tetapi istrinya yang kafir itu telah kami tetapkan untuk dibinasakan bersama kaumnya yang lain dalam azab ini.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. قَالُوٓا۟ إِنَّآ أُرْسِلْنَآ إِلَىٰ قَوْمٍ مُّجْرِمِينَ (Mereka menjawab: “Kami sesungguhnya diutus kepada kaum yang berdosa) Mereka adalah kaum Nabi Luth."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Malaikat menjawab: “Kami sesungguhnya diutus kepada kaum yang kafir untuk membinasakan mereka, mereka adalah kaum Luth"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka menjawab,“Sesungguhnya kami diutus kepada kaum yang berdosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. “mereka menjawab’kami sesungguhnya diutus kepada kaum yang berdosa’” yaitu kepada kaum yang kerusakannya sudah merajalela dan keburukannya sudah besar, agar kami timpakan siksa dan hukuman atas mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِلَىٰ قَوۡمٖ مُّجۡرِمِينَ) Ilaa qaumim mujrimiin : “Kepada kaum yang berdosa.” Yaitu kaum Nabi Luth ‘alaihissalam Makna ayat: “Mereka berkata, sesungguhnya kami diutus kepada kaum yang berdosa.” Berbuat kejahatan kepada diri mereka sendiri dan orang lain, mereka orang yang melakukan liwath (homoseksual), semoga Allah melaknat mereka. Pelajaran dari ayat: • Peringatan dari perbuatan dosa dan hukuman bagi orang-orang yang berdosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 58: Yakni kaum Luth untuk membinasakan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 58",
    "description": "Mereka menjawab, selain membawa berita gembira tentang kelahiran anakmu, sesungguhnya kami juga diutus oleh Allah kepada kaum nabi lut yang berdosa dan durhaka. Kami diutus untuk membinasakan mereka. Allah menyatakan bahwa kami akan membinasakan kaum nabi lut yang berdosa, kecuali para pengikut lut. Sesungguhnya kami pasti menyelamatkan mereka semuanya dari kebinasaan itu, kecuali istrinya. Dia dibinaskan bersama kaum nabi lut lainnya. Kami telah menentukan keputusan sesuai perintah Allah kepada kami bahwa sesungguhnya dia termasuk orang yang tertinggal bersama orang kafir lainnya."
  }
]