[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "6-7. Orang-orang yang mendustakan Muhammad berkata sebagai ejekan, ”wahai orang yang diturunkan padanya al-qur’an, sesungguhnya kamu orang yang kehilangan akal sehat. Mengapa kamu tidak mendatangkan malaikat kepada kami, bila kamu memang berkata benar, untuk bersaksi mendukungmu bahwa sesungguhnya Allah telah mengutusmu?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Orang-orang kafir Makkah berkata kepada Rasulullah -ṣallallāhu 'alaihi wa sallam-, “Wahai orang yang diturunkan kepadanya Al-Qur`ān -sebagaimana pengakuannya-, sesungguhnya dengan pengakuan ini kamu adalah orang gila, kelakuanmu sama dengan kelakuan orang-orang gila."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6-8. orang-orang musyrik berkata dengan penuh penghinaan: “Hai orang yang kepadanya diturunkan al-Qur’an, sungguh kamu adalah orang gila karena mengaku sebagai seorang rasul; mengapa kamu tidak mendatangkan para malaikat kepada kami agar bersaksi atas kebenaran risalahmu jika kamu benar-benar Rasulullah.” Kami tidak menurunkan para malaikat melainkan untuk menurunkan firman-firman yang akan diturunkan dan perbuatan-perbuatan yang menimpa orang-orang kafir seperti azab bagi umat-umat yang mendustakan. Seandainya Aku menurunkan para malaikat kepada mereka sebagaimana yang mereka minta, sungguh mereka akan segera ditimpa azab tanpa ditunda-tunda lagi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَقَالُوا۟ يٰٓأَيُّهَا الَّذِى نُزِّلَ عَلَيْهِ الذِّكْرُ (Mereka berkata: “Hai orang yang diturunkan Al Quran kepadanya) Yakni orang-orang kafir Makkah berkata kepada Rasulullah dengan nada mengolok “hai orang yang diturunkan kepadanya al-Qur’an sebagaimana yang kamu klaim. إِنَّكَ لَمَجْنُونٌ(sesungguhnya kamu benar-benar orang yang gila) Yakni karena pengakuan bahwa kamu adalah Rasul Allah yang diperintah untuk menyampaikan hukum-hukum-Nya, kamu sungguh menjadi orang yang gila. Sebab bagi mereka orang yang berakal tidak mengaku dengan pengakuan semisal ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Mereka orang musyrik berkata dengan maksud mengolok: “Hai orang-orang yang diturunkan Al Quran, sesungguhnya kamu benar-benar orang yang gila.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata} orang-orang kafir Quraisy berkata {“Wahai orang yang kepadanya diturunkan Al-Qur’an} Al-Qur’an {sesungguhnya kamu benar-benar orang gila"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. maksudnya, orang orang mukadzdzibin (yang mendustakan) berkata kepada Muhammad dalam rangka untuk mengejek dan memperolok beliau, ”hai orang yang diturunkan al qur’an kepadanya” menurut persangkaanmu ”sesungguhnya kamu benar benar orang yang gila” sebab engkau mengira kami akan mengikutimu dan menyingkirkan kebudayaan kebudayaan nenek moyang kami hanya dengan ucapanmu saja."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ) nuzzila ‘alaihidz dzikr : “diturunkan kepadanya Adz-Dzikr” yaitu Al-Qur’an. Makna ayat : Firman Allah ta’ala : (وَقَالُواْ يَٰٓأَيُّهَا ٱلَّذِي نُزِّلَ عَلَيۡهِ ٱلذِّكۡرُ) “Dan mereka berkata, Wahai orang yang diturunkan kepadanya Al-Qur’an” orang-orang kafir yang mengingkari wahyu dan kenabian berkata : (إِنَّكَ لَمَجۡنُونٞ) “sungguh engkau adalah orang yang gila.” Yaitu tidak berakal, jika tidak, niscaya engkau tidak akan mengaku-ngaku kenabian. Pada perkataan mereka terdapat ejekan yang jelas kepada Rasulullah shallahu ‘alaihi wa sallam, dan ini adalah buah dari gelapnya kekafiran yang ada di dalam hati mereka. Pelajaran dari ayat: • Penjelasan mengenai ejekan dan hinaan yang telah Rasulullah shallahu ‘alaihi wa sallam terima dari kaum musyrikin."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 6: Yakni kaum kafir Mekah kepada Nabi shallallahu 'alaihi wa sallam. Kata-kata ini diucapkan oleh orang-orang kafir Mekah kepada Nabi shallallahu 'alaihi wa sallam sebagai ejekan, seakan-akan mereka berkata, “Kamu kira kami akan mengikutimu dan meninggalkan apa yang kami dapatkan dari nenek moyang kami hanya karena ucapanmu.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 6",
    "description": "Dan tidak hanya melakukan perbuatan buruk, orang kafir juga mengucapkan perkataan yang menyakiti nabi Muhammad. Mereka berkata, wahai orang yang kepadanya diturunkan Al-Qur'an, sesungguhnya engkau, wahai Muhammad, benar-benar orang gila karena mengakui apa yang kausampaikan bersumber dari Allah. Tidak hanya mengolok nabi Muhammad, mereka juga meminta beliau mendatangkan malaikat. Mereka berkata, mengapa engkau tidak mendatangkan malaikat dalam bentuk aslinya kepada kami, supaya menjadi bukti kebenaran pengakuanmu sebagai rasul, agar mereka menyampaikan pesan-pesan Allah kepada kami secara langsung, atau agar mereka menyiksa kami dengan azab dari tuhanmu, jika engkau termasuk orang yang benar'."
  }
]