[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "58-60. Mereka berkata, “ Sesungguhnya Allah telah mengutus kami untuk menghancurkan kum Luth yang menyekutukan Allah lagi sesat jalan, kecuali Luth dan keluarganya yang beriman kepadanya. Kami tidak akan membinasakan mereka dan akan menyelamatkan mereka semua. Akan tetapi, istrinya yang kafir, kami telah menetapkan berdasarkan perintah Allah untuk membinasakannya dan orang-orang lain yang ada dalam siksaan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. Kecuali istrinya, Kami memutuskannya termasuk orang-orang yang tinggal terkena azab pembinasaan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. إِلَّا امْرَأَتَهُۥ قَدَّرْنَآ ۙ إِنَّهَا لَمِنَ الْغٰبِرِينَ (kecuali istrinya. Kami telah menentukan, bahwa sesungguhnya ia itu termasuk orang-orang yang tertinggal) Kami telah tetapkan bahwa ia termasuk orang-orang yang kekal dalam azab bersama orang-orang kafir lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Kecuali istrinya. Kami telah menentukan, bahwa sesungguhnya ia termasuk orang-orang yang tertinggal bersama-sama dengan orang kafir lainnya dan akan kekal dalam azab atas kekufurannya.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali istrinya} kecuali istri Luth {Kami telah menentukan} Kami telah memutuskan {bahwa sesungguhnya dia termasuk orang-orang yang tertinggal”} orang-orang yang terkena azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59-60. “kecuali luth beserta pengikut pengikutnya” maksudnya kecuali nabi luth dan keluarganya ”kecuali istrinya, kami telah menentukan bahwa sesungguhnya ia termasuk orang orang yang tertinggal (bersama sama dengan orang kafir lainnya”, maksudnya termasuk orang orang yang tetap dirundung oleh siksa. Adapun nabi luth, maka kami benar benar mengeluarkannya dan anggota keluarganya, dan menyelamatkan mereka dari hukuman itu. Maka mulailah Ibrahim beradu argumentasi dengan para utusan itu (malaikat ) mengenai pemusnahan kaum Nabi luth, dan beliau melakukan lobby (agar siksaan itu tidak terealisasi)."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلۡغَٰبِرِينَ) Al-ghaabiriin : yang tertinggal terkena azab. Makna ayat: Makna ayat: Firman-Nya ta’ala “kecuali keluarga Luth.” Keluarganya dan orang-orang yang beriman bersamanya. “Kami akan menyelamatkan mereka seluruhnya, kecuali istrinya, kami telah menentukan.” Kami putuskan “bahwa ia termasuk orang-orang yang tertinggal.” Yang tertinggal di dalam azab, yaitu Allah telah menentukan dan menetapkan kebinasaannya bersamaan dengan orang-orang yang binasa, karena ia kafir sebagaimana mereka, sampai sini percakapan mereka bersama Ibrahim. Pelajaran dari ayat: • Tidak ada gunanya keturunan, hubungan pernikahan, dan kekerabatan, jika kekufuran dan kemaksiatan memisahkan antara keturunan dan kekerabatan, istri Luth binasa bersama orang yang binasa, dan ia tidak memberinya pertolongan padahal dia adalah istri dari seorang nabi dan rasul ‘alaihissalam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 60: Maka Ibrahim berdialog cukup lama dengan para malaikat, hingga akhirnya mereka meminta Ibrahim agar dialog tidak dilanjutkan, mereka berkata, “Wahai Ibrahim, tinggalkanlah soal jawab ini, sesungguhnya telah datang ketetapan Tuhanmu, dan Sesungguhnya mereka itu akan didatangi azab yang tidak dapat ditolak.” (Terj. Huud: 76) Mereka pun kemudian pergi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 60",
    "description": "Allah menyatakan bahwa kami akan membinasakan kaum nabi lut yang berdosa, kecuali para pengikut lut. Sesungguhnya kami pasti menyelamatkan mereka semuanya dari kebinasaan itu, kecuali istrinya. Dia dibinaskan bersama kaum nabi lut lainnya. Kami telah menentukan keputusan sesuai perintah Allah kepada kami bahwa sesungguhnya dia termasuk orang yang tertinggal bersama orang kafir lainnya. Usai mengisahkan dialog antara nabi ibrahim dengan para malaikat yang bertamu ke kediamannya, pada ayat-ayat berikut Allah mengisahkan pembinasaan kaum nabi lut. Allah menyatakan, maka ketika utusan yang sebelumnya bertamu ke rumah nabi ibrahim itu datang kepada para pengikut lut, dia berkata, sesungguh-Nya kamu, wahai para tamu, adalah orang yang tidak kami kenal. (lihat: surah al-'ankabut/29: 23)."
  }
]