[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "61-62. Maka para malaikat yang diutus kepada Luth datang, dia berkata kepada mereka, “ Sesungguhnya kalian orang-orang asing bagiku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Manakala para Malaikat datang kepada keluarga Lūṭ dalam wujud lelaki."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61-62. Ketika para malaikat itu sampai di rumah Luth, Luth berkata dengan penuh keheranan: “Kalian adalah kaum yang tidak aku kenali, apa sebenarnya yang kalian inginkan?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61-62. فَلَمَّا جَآءَ ءَالَ لُوطٍ الْمُرْسَلُونَ قَالَ إِنَّكُمْ قَوْمٌ مُّنكَرُونَ (Maka tatkala para utusan itu datang kepada kaum Luth, beserta pengikut pengikutnya. ia berkata: “Sesungguhnya kamu adalah orang-orang yang tidak dikenal) Yakni Nabi Luth berkata kepada mereka “aku tidak mengenal kalian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Maka tatkala para utusan itu datang kepada kaum Luth, beserta pengikut pengikutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka ketika para utusan itu datang kepada para pengikut Luth"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61-62. “maka tatkala para utusan itu datang kepada kaum luth berkata kepada mereka, ”sesungguhnya kamu adalah orang orang yang tidak dikenal“ maksudnya aku tidak mengenal kalian dan tidak mengetahui siapakah gerangan kalian itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Kemudian mereka berpindah menuju negeri Luth ‘alaihissalam, Allah berfirman “Maka ketika para utusan datang kepada keluarga Luth.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 61",
    "description": "Usai mengisahkan dialog antara nabi ibrahim dengan para malaikat yang bertamu ke kediamannya, pada ayat-ayat berikut Allah mengisahkan pembinasaan kaum nabi lut. Allah menyatakan, maka ketika utusan yang sebelumnya bertamu ke rumah nabi ibrahim itu datang kepada para pengikut lut, dia berkata, sesungguh-Nya kamu, wahai para tamu, adalah orang yang tidak kami kenal. (lihat: surah al-'ankabut/29: 23)usai mengisahkan dialog antara nabi ibrahim dengan para malaikat yang bertamu ke kediamannya, pada ayat-ayat berikut Allah mengisahkan pembinasaan kaum nabi lut. Allah menyatakan, maka ketika utusan yang sebelumnya bertamu ke rumah nabi ibrahim itu datang kepada para pengikut lut, dia berkata, sesungguh-Nya kamu, wahai para tamu, adalah orang yang tidak kami kenal. (lihat: surah al-'ankabut/29: 23)."
  }
]