[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "63-65. Mereka berkata, “ Janganlah kamu takut, sesunggunya kami datang dengan membawa siksaan yang diragukan kaummu dan mereka tidak mengimani. Dan kami datang dengan membawa kebenaran di sisi Allah, dan kami mengatakan ucapan yang benar. Maka keluarlah kamu dari tengah mereka bersama keluargamu yang beriman, setelah berlalunya sebagian malam. Dan berjalanlah kamu di belakang mereka, supaya tidak seorangpun yang tertinggal sehingga terkena siksaan (juga). Dan janganlah salah seorang dari kalian menengok (ke belakang). Dan cepatlah menuju tempat ke mana Allah memerintahkan kalian, supaya kalian berada di tempat yang aman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Para utusan dari Malaikat berkata kepada Lūṭ, “Jangan takut -wahai Lūṭ- karena kami datang membawa sesuatu yang disangsikan oleh kaummu, yaitu azab yang akan membinasakan mereka”."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63-64. Mereka berkata: “Kami adalah utusan Allah, kami datang membawa azab yang kaummu ragukan dan dustakan itu. Kami datang dengan kebenaran yang menjadi penentu antara kamu dengan kaummu. Kami benar-benar jujur atas apa yang kami katakan.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قَالُوا۟ بَلْ جِئْنٰكَ بِمَا كَانُوا۟ فِيهِ يَمْتَرُونَ (Para utusan menjawab: “Sebenarnya kami ini datang kepadamu dengan membawa azab yang selalu mereka dustakan) Yakni datang dengan azab yang mereka ragukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Para malaikat menjawab: “Jangan takut, Sebenarnya kami ini datang kepadamu dengan membawa azab yang selalu mereka dustakan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka menjawab,“Kami datang kepadamu membawa azab yang selalu mereka dustakan} mereka meragukan kedatangannya kepada mereka, yaitu azab"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "63. “para utusan menjawab ’sebenarnya kami ini datang kepadamu dengan membawa azab yang selalu mereka dustakan” maksudnya, kami mendatangi kalian untuk menyiksa mereka, yaitu orang orang yang meragukan kedatangan siksa dan mendustakan dirimu ketika engkau menjanjikan kepada mereka tentang kedatangannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (بِمَا كَانُواْ فِيهِ يَمۡتَرُونَ) bima kaanuu fiihi yamtaruun : “dengan apa yang mereka ragukan.” Dengan azab yang dahulu mereka ragukan kebenarannya. Makna ayat: lalu mereka pun menjawab, Kami adalah utusan Rabbmu, kami datang kepadamu dengan apa yang kaummu ragukan, yaitu azab mereka yang datang dengan segera sebagai balasan atas kekufuran dan perbuatan dosa mereka"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 63",
    "description": "Menerangkan maksud kedatangan mereka, para utusan itu menjawab, sebenarnya kami ini datang kepadamu tidak untuk berbuat jahat kepadamu, wahai nabi lut. Kami datang kemari tidak lain untuk membawa kabar buruk berupa azab pedih yang akan Allah timpakan kepada kaummu yang durhaka. Itulah azab yang selama ini selalu mereka dustakan ketika engkau menyampaikan dakwahmu kepada mereka. Dan jangalah engkau ragukan maksud kedatangan kami. Kami datang kepadamu dengan membawa kebenaran yang membuktikan kebenaran yang engkau sampaikan kepada mereka dan kesalahan mereka menolak ajakanmu untuk beriman kepada Allah. Dan sungguh, kami adalah orang yang benar dalam ucapan dan perbuatan kami."
  }
]