[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "63-65. Mereka berkata, “ Janganlah kamu takut, sesunggunya kami datang dengan membawa siksaan yang diragukan kaummu dan mereka tidak mengimani. Dan kami datang dengan membawa kebenaran di sisi Allah, dan kami mengatakan ucapan yang benar. Maka keluarlah kamu dari tengah mereka bersama keluargamu yang beriman, setelah berlalunya sebagian malam. Dan berjalanlah kamu di belakang mereka, supaya tidak seorangpun yang tertinggal sehingga terkena siksaan (juga). Dan janganlah salah seorang dari kalian menengok (ke belakang). Dan cepatlah menuju tempat ke mana Allah memerintahkan kalian, supaya kalian berada di tempat yang aman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. “Kami datang membawa kebenaran yang tidak main-main, sesungguhnya kami ini benar tentang kabar yang kami sampaikan kepadamu.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَأَتَيْنٰكَ بِالْحَقِّ (Dan kami datang kepadamu membawa kebenaran) Yaitu berupa azab yang benar-benar akan menimpa mereka. وَإِنَّا لَصٰدِقُونَ (dan sesungguhnya kami betul-betul orang-orang benar) Dalam kabar yang kami sampaikan kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Kami datang kepadamu membawa kebenaran dan sesungguhnya kami betul-betul orang-orang benar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami datang kepadamu membawa kebenaran. Sesungguhnya kami adalah orang-orang yang benar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “dan kami datang kepadamu membawa kebenaran” bukan barang guyonan ”dan sesungguhnya kami betul betul orang orang benar” atas apa yang kami ucapkan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: “Dan kami mendatangimu dengan membawa kebenaran.” Yang valid, tidak ada keraguan di dalamnya. “Dan kami sungguh orang-orang yang benar.” Dalam perkara yang kami kabarkan kepadamu, yaitu azab kaummu yang berdosa,"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 64: Yakni bukan main-main atau bercanda. Dalam perkataan kami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 64",
    "description": "Dan jangalah engkau ragukan maksud kedatangan kami. Kami datang kepadamu dengan membawa kebenaran yang membuktikan kebenaran yang engkau sampaikan kepada mereka dan kesalahan mereka menolak ajakanmu untuk beriman kepada Allah. Dan sungguh, kami adalah orang yang benar dalam ucapan dan perbuatan kami. Pernyataan para malaikat itu mampu menenangkan hati nabi lut sehingga tidak lagi meragukan maksud kedatangan mereka. Dalam keadaan demikian, mereka berpesan, maka tinggalkanlah kaummu yang kafir, wahai nabi lut, dan pergilah kamu pada akhir malam, yakni menjelang subuh, beserta keluargamu, dan ikuti serta awasi-lah mereka dengan sungguh-sungguh dari belakang, dan jangan ada di antara kamu yang menoleh ke belakang agar perjalanan kamu lancar. Dan teruskanlah perjalanan hingga kamu semua sampai ke tempat yang diperintahkan kepadamu. (lihat: surah hud/11: 81)."
  }
]