[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "63-65. Mereka berkata, “ Janganlah kamu takut, sesunggunya kami datang dengan membawa siksaan yang diragukan kaummu dan mereka tidak mengimani. Dan kami datang dengan membawa kebenaran di sisi Allah, dan kami mengatakan ucapan yang benar. Maka keluarlah kamu dari tengah mereka bersama keluargamu yang beriman, setelah berlalunya sebagian malam. Dan berjalanlah kamu di belakang mereka, supaya tidak seorangpun yang tertinggal sehingga terkena siksaan (juga). Dan janganlah salah seorang dari kalian menengok (ke belakang). Dan cepatlah menuju tempat ke mana Allah memerintahkan kalian, supaya kalian berada di tempat yang aman.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. “Bawalah keluargamu meninggalkan negeri ini sesudah malam berlalu beberapa saat, jangan ada seorang pun dari kalian yang menoleh ke belakang untuk mengetahui apa yang menimpa mereka, pergilah ke tempat yang Allah perintahkan kepada kalian.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Maka keluarlah kamu dengan keluarga dan para pengikutmu pada waktu malam, dan hendaklah kamu berada di belakang mereka untuk menjaga mereka. Dan janganlah ada seorangpun yang menoleh ke belakang demi menjaga pandangan dan hati dari kengerian azab. Berjalanlah dengan cepat sebagaimana Allah memerintahkan kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. فَأَسْرِ بِأَهْلِكَ بِقِطْعٍ مِّنَ الَّيْلِ (Maka pergilah kamu di akhir malam dengan membawa keluargamu) Tafsir dari kalimat ini telah dijelaskan pada surat Huud: 81 وَاتَّبِعْ أَدْبٰرَهُمْ(dan ikutlah mereka dari belakang) Yakni berjalanlah kamu di belakang mereka untuk mengawal mereka agar tidak ada yang tertinggal dari mereka yang menjadikannya ikut tertimpa azab. وَلَا يَلْتَفِتْ مِنكُمْ أَحَدٌ(dan janganlah seorangpun di antara kamu menoleh kebelakang) Yakni janganlah kamu dan para pengikutmu menoleh ke belakang untuk menyaksikan azab yang menimpa orang-orang kafir sehingga dapat memperlambat perjalanan kalian. وَامْضُوا۟ حَيْثُ تُؤْمَرُونَ(dan teruskanlah perjalanan ke tempat yang di perintahkan kepadamu) Yakni ke arah yang telah Kami perintahkan kepada kalian. Terdapat pendapat mengatakan, yakni ke negeri Khalil."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَلَا يَلْتَفِتْ مِنْكُمْ أَحَدٌ وَامْضُوا حَيْثُ تُؤْمَرُونَ } \"dan janganlah seorangpun di antara kamu menoleh kebelakang dan teruskanlah perjalanan ke tempat yang di perintahkan kepadamu\" jangan sekali-kali membuat waktumu terbuang dengan sia-sia hanya karena sesuatu yang tidak bermanfaat, dan mulailah fokus dengan tujuanmu yang lebih berguna; agar kemenangan berada di pihakmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Maka pergilah kamu di akhir malam dengan membawa keluarga dan pengikutmu. Ikutlah mereka dari belakang dan jangan sampa ada yang menoleh kebelakang, hingga menyebabkan dia melihat kedahsyatan azab kepada kaummu yang ingkar. Teruskanlah perjalanan ke tempat yang di perintahkan kepadamu, yaitu negeri Syam”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka berjalanlah pada akhir malam beserta keluargamu dan ikutilah mereka dari belakang} berjalanlah di belakang mereka {Jangan ada seorang pun di antara kalian menoleh ke belakang dan teruslah berjalan} teruslah berjalan {ke tempat yang diperintahkan kepada kalian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65. “maka pergilah kamu di akhir malam dengan membawa keluargamu” yaitu di tengah malam, saat mata mata terlelap, dan tidak ada seorangpun mengetahui perjalanan kalian di malam hari. ”dan janganlah seorangpun mengetahui perjalan kalian dimalam hari. ”dan janganlah seorangpun diantara kamu menoleh ke belakang” maksudnya, bahkan bergegas dan cepatlah ”dan teruskanlah perjalanan ke tempat yang diperintahkan kepadamu” seakan akan mereka disertai oleh seorang pemandu jalan yang menunjukan kemana mereka harus mengarahkan langkah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata; (حَيۡثُ تُؤۡمَرُونَ) haitsu tu’maruun : “ke tempat yang diperintahkan.” Yaitu menuju Syam, tempat yang diperintahkan untuk keluar ke sana. Makna ayat: Oleh karena itu “Maka pergilah engkau pada akhir malam berserta keluargamu,” pergilah engkau bersama keluargamu pada sebagian malam, “dan ikutilah mereka dari belakang.” Berjalanlah dibelakang mereka, dan mereka berada di depanmu, “dan jangan ada di antara kalian yang menoleh ke belakang.” Melihat kebelakang, sehingga mereka tidak melihat perkara yang tidak mengenakkan ketika azab turun kepada orang-orang yang berdosa. Pelajaran dari ayat: • Disyariatkan bersafar di malam hari untuk perjalanan yang jauh. • Disyariatkan seorang penanggung jawab dan pembesar kaum untuk berjalan di belakang pasukan atau kafilah, untuk mengecek keadaan mereka dan melihat adakah yang tertinggal karena suatu urusan, sebagaimana Rasulullah shallahu ‘alaihi wa sallam lakukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 65: Yakni ketika orang-orang sedang tidur, dan tidak ada seorang pun yang mengetahui kepergianmu. Yakni berjalanlah di belakang mereka. Yakni agar tidak melihat peristiwa dahsyat yang menimpa mereka. Lihat juga surat Hud ayat 81. Yakni Syam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 65",
    "description": "Pernyataan para malaikat itu mampu menenangkan hati nabi lut sehingga tidak lagi meragukan maksud kedatangan mereka. Dalam keadaan demikian, mereka berpesan, maka tinggalkanlah kaummu yang kafir, wahai nabi lut, dan pergilah kamu pada akhir malam, yakni menjelang subuh, beserta keluargamu, dan ikuti serta awasi-lah mereka dengan sungguh-sungguh dari belakang, dan jangan ada di antara kamu yang menoleh ke belakang agar perjalanan kamu lancar. Dan teruskanlah perjalanan hingga kamu semua sampai ke tempat yang diperintahkan kepadamu. (lihat: surah hud/11: 81)Allah menjelaskan pembinasaan atas kaum nabi lut sebagai berikut. Dan telah kami tetapkan kepadanya, yakni nabi lut, keputusan pembinasaan itu yang sungguh mengerikan. Kami telah memutuskan bahwa akhirnya mereka yang durhaka akan ditumpas habis pada waktu subuh. Tidak akan ada seorang pun dari mereka yang tersisa."
  }
]