[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Para penduduk Luth datang kepada Luth ketika mereka mengetahui tamu-tamu yang berada bersamnya. Mereka gembira dan rasa senang dengan tamu-tamunya, untuk mereka tangkap dan memaksa melekukan perbuatan keji dengan tamu-tamu itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Penduduk Sadum datang menyambut tamu-tamu Lūṭ dengan bahagia, karena mereka berharap bisa berbuat keji terhadap mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Dan para pelaku kekejian mendatangi Luth dengan penuh kebahagiaan ketika mereka mengetahui kedatangan tamu-tamunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. وَجَآءَ أَهْلُ الْمَدِينَةِ يَسْتَبْشِرُونَ (Dan datanglah penduduk kota itu (ke rumah Luth) dengan gembira (karena) kedatangan tamu-tamu itu) Yakni penduduk kota kaum Luth, yaitu kota Sodom, datang dengan penuh kegirangan atas kedatangan para tamu Nabi Luth, sebab mereka berharap dapat berbuat hal keji dengan tamu-tamu itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Penduduk kota Syam datang ke rumah Luth dengan gembira karena kedatangan tamu-tamu itu dan bermaksud menghiangkan perbuatan keji mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan datanglah penduduk kota itu} kota Sodom {dengan gembira (67)} mereka merasa senang dengan adanya tamu-tamu Luth, dengan maksud berbuat keji terhadap mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67-69. “dan datanglah penduduk kota itu (ke rumah luth)” yaitu kota tempat nabi luth berada “dengan gembira (karena kedatangan tamu tamu itu)” maksudnya mereka saling menyampaikan kabar gembira kepada sebagian lainnya tentang tamu tamu Nabi luth ketampanan wajah mereka dan kemampuan mereka untuk dapat menguasai para tamu itu. Hal itu, lantaran mereka berniat untuk melangsungkan perbuatan keji terhadap para tamu itu. Orang orang itu datang dan sampai kerumah nabi luth. Mereka mulai membujuk nabi luth supaya menyerahkan tamu tamunya. Sedangkan nabi Luth benar benar memohon perlindungan (kepada Allah) dari mereka seraya berkata ”sesungguhnya mereka adalah tamuku; maka janganlah kamu memberi malu (kepadaku) dan bertakwalah kepada Allah, dan janganlah kamu membuat aku terhina” maksudnya yakinilah pertama tama bahwa Allah itu mengawasi kalian. Jika memang tidak ada rasa takut pada kalian kepada Allah, maka janganlah kalian mempermalukan aku dihadapan tamu tamuku dan selanjutnya kalian memalukan perbuatan yang bejat dengan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَجَآءَ أَهۡلُ ٱلۡمَدِينَةِ يَسۡتَبۡشِرُونَ) wa jaa’a ahlul madiinati yastabsyiruun : “Dan datanglah penduduk kota itu dengan bergembira.” Yaitu kota Sadum, berbahagia dengan melakukan perkara yang keji. Makna ayat : Masih mengisahkan tentang Nabi Luth ‘alaihissalam, tamunya dari kalangan malaikat, dan juga kaum Luth. Allah ta’ala berfirman “Dan datanglah penduduk kota itu” yaitu kota Sadum dan penduduknya merupakan orang-orang yang melakukan perbuatan liwath. Dan firman-Nya “dengan bergembira.” Bersuka cita, bahagia karena ingin melakukan perbuatan keji."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 67: Kaum Luth ketika diberitahukan bahwa di rumah Luth terdapat beberapa orang pemuda yang ganteng -yang sebenarnya mereka adalah para malaikat-, mereka datang ke rumah Luth sambil bergembira atau satu sama lain saling memberitahukan kabar gembira karena hendak berbuat keji dengan mereka. Riwayat Luth dalam surat Al Hijr ini, tidak diceritakan menurut urutan kejadian seperti pada surat Hud."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 67",
    "description": "Usai menggambarkan peristiwa yang akan terjadi pada kaum nabi lut, melalui ayat-ayat berikut Allah menceritakan suasana sebelum dialog antara nabi lut dengan para tamunya. Kaum nabi lut melihat ada pria-pria tampan yang bertamu ke rumah nabi lut. Dan datanglah sejumlah pendurhaka dari penduduk kota itu, yakni sodom yang menjadi tempat tinggal nabi lut, ke rumah lut dengan gembira dan berduyunduyun karena kedatangan para tamu tampan itu. Mereka datang untuk mengajak para tamu itu melakukan hubungan homoseksual. Melihat sikap dan gelagat para pendurhaka yang mendatangi rumahnya, nabi lut berkata, sesungguhnya mereka yang ada di rumahku adalah tamuku yang harus kita hormati bersama. Maka, jangan kamu mempermalukan aku dengan mengajak mereka melakukan perbuatan yang tidak senonoh."
  }
]