[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-69. Luth berkata kepada mereka, “Sesungguhnya mereka itu tamu-tamuKu, dan mereka berada dalam perlindunganku, maka janganlah kalian mempermalukan aku. Takutlah dari hukuman Allah, dan janganlah kalian mengganggu mereka, akibatnya kalian akan menjerumuskan aku dalam kehinaan dan kenistaan, lantaran kalian mengganggu tamu-tamuku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "68. Lūṭ berkata kepada mereka, “Mereka adalah tamu-tamuku, janganlah membuatku malu dengan apa yang kalian inginkan dari mereka!”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "68-69. Luth berkata kepada mereka: “Mereka adalah para tamuku, janganlah kalian membuatku malu karena kalian ingin berbuat kekejian dengan mereka, takutlah kalian kepada Allah ketika ingin mengganggu kami, dan jangan membuatku terhina.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "68. قَالَ(Luth berkata) Nabi Luth berkata kepada mereka. إِنَّ هٰٓؤُلَآءِ ضَيْفِى (Sesungguhnya mereka adalah tamuku) Nabi Luth memandang mereka adalah para tamu, namun kaumnya memandang mereka adalah para lelaki rupawan sebagai ujian dari Allah, oleh sebab itu mereka sangat bernafsu kepada para tamu itu. فَلَا تَفْضَحُونِ(maka janganlah kamu membuatku malu) Dengan menawarkan mereka untuk berbuat keji, sehingga orang-orang memandangku sebagai orang yang tidak mampu melindungi orang yang bertamu kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "68. Luth berkata: “Sesungguhnya mereka adalah tamuku yang berhak dimuliakan, maka janganlah kalian mempermalukan aku dengan berbuat jahat kepada mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata} Luth berkata kepada mereka {Sesungguhnya mereka adalah tamuku. Maka jangan mempermalukanku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67-69. “dan datanglah penduduk kota itu (ke rumah luth)” yaitu kota tempat nabi luth berada “dengan gembira (karena kedatangan tamu tamu itu)” maksudnya mereka saling menyampaikan kabar gembira kepada sebagian lainnya tentang tamu tamu Nabi luth ketampanan wajah mereka dan kemampuan mereka untuk dapat menguasai para tamu itu. Hal itu, lantaran mereka berniat untuk melangsungkan perbuatan keji terhadap para tamu itu. Orang orang itu datang dan sampai kerumah nabi luth. Mereka mulai membujuk nabi luth supaya menyerahkan tamu tamunya. Sedangkan nabi Luth benar benar memohon perlindungan (kepada Allah) dari mereka seraya berkata ”sesungguhnya mereka adalah tamuku; maka janganlah kamu memberi malu (kepadaku) dan bertakwalah kepada Allah, dan janganlah kamu membuat aku terhina” maksudnya yakinilah pertama tama bahwa Allah itu mengawasi kalian. Jika memang tidak ada rasa takut pada kalian kepada Allah, maka janganlah kalian mempermalukan aku dihadapan tamu tamuku dan selanjutnya kalian memalukan perbuatan yang bejat dengan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Maka Luth berkata kepada mereka, sebagaimana yang Allah kabarkan, “Dia berkata, sesungguhnya mereka” menunjuk kepada para malaikat, “mereka adalah tamuku, maka janganlah mempermalukan aku.” Dengan kalian meminta untuk melakukan perbuatan keji dengan tamuku. Pelajaran dari ayat: • Penjelasan mengenai penghancuran kaum Luth. • Pengingkaran terhadap perbuatan keji dan ini merupakan perbuatan yang paling keji yang pernah diketahui oleh sejarah manusia, yaitu perbuatan homoseksual."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 68",
    "description": "Melihat sikap dan gelagat para pendurhaka yang mendatangi rumahnya, nabi lut berkata, sesungguhnya mereka yang ada di rumahku adalah tamuku yang harus kita hormati bersama. Maka, jangan kamu mempermalukan aku dengan mengajak mereka melakukan perbuatan yang tidak senonoh. Melanjutkan nasihatnya, nabi lut berpesan, dan bertakwalah kamu kepada Allah. Lindungi dan jagalah diri kamu dari siksa-Nya dengan menghindari perbuatan yang tidak senonoh itu. Dan janganlah sekalikali kamu membuat aku terhina akibat sikap dan perlakukan kalian kepada mereka."
  }
]