[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "68-69. Luth berkata kepada mereka, “Sesungguhnya mereka itu tamu-tamuKu, dan mereka berada dalam perlindunganku, maka janganlah kalian mempermalukan aku. Takutlah dari hukuman Allah, dan janganlah kalian mengganggu mereka, akibatnya kalian akan menjerumuskan aku dalam kehinaan dan kenistaan, lantaran kalian mengganggu tamu-tamuku.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. “Takutlah kalian kepada Allah dengan meninggalkan perbuatan keji kalian, jangan merendahkanku dengan perbuatan busuk kalian.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَاتَّقُوا۟ اللهَ (dan bertakwalah kepada Allah) Dalam urusanku ini. وَلَا تُخْزُونِ(dan janganlah kamu membuat aku terhina) Nabi Luth khawatir akan mendapatkan kehinaan jika tidak mampu melindungi para tamunya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Dan bertakwalah kepada Allah dan janganlah kamu membuat aku terhina”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bertakwalah kepada Allah dan jangan membuatku terhina”} jangan membuatku hina dengan menyinggung tamuku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67-69. “dan datanglah penduduk kota itu (ke rumah luth)” yaitu kota tempat nabi luth berada “dengan gembira (karena kedatangan tamu tamu itu)” maksudnya mereka saling menyampaikan kabar gembira kepada sebagian lainnya tentang tamu tamu Nabi luth ketampanan wajah mereka dan kemampuan mereka untuk dapat menguasai para tamu itu. Hal itu, lantaran mereka berniat untuk melangsungkan perbuatan keji terhadap para tamu itu. Orang orang itu datang dan sampai kerumah nabi luth. Mereka mulai membujuk nabi luth supaya menyerahkan tamu tamunya. Sedangkan nabi Luth benar benar memohon perlindungan (kepada Allah) dari mereka seraya berkata ”sesungguhnya mereka adalah tamuku; maka janganlah kamu memberi malu (kepadaku) dan bertakwalah kepada Allah, dan janganlah kamu membuat aku terhina” maksudnya yakinilah pertama tama bahwa Allah itu mengawasi kalian. Jika memang tidak ada rasa takut pada kalian kepada Allah, maka janganlah kalian mempermalukan aku dihadapan tamu tamuku dan selanjutnya kalian memalukan perbuatan yang bejat dengan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ) wattaqullaaha wa laa tukhzuun : “bertakwallah kepada Allah dan jangan buat aku terhina.” Janganlah kalian menghinakanku dengan mengganggu kehormatan tamuku. Makna ayat: “Dan bertakwalah kepada Allah,” takutlah kepada-Nya, “dan jangan menghinakan aku.” Merendahkan aku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 69: Karena keinginan kamu untuk berbuat keji dengan para tamuku."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 69",
    "description": "Melanjutkan nasihatnya, nabi lut berpesan, dan bertakwalah kamu kepada Allah. Lindungi dan jagalah diri kamu dari siksa-Nya dengan menghindari perbuatan yang tidak senonoh itu. Dan janganlah sekalikali kamu membuat aku terhina akibat sikap dan perlakukan kalian kepada mereka. Nasihat nabi lut tidak membuat para pendurhaka itu mengurungkan niat. Dengan angkuh dan sombong mereka berkata, dan bukankah kami sejak awal telah melarangmu, wahai lut, dari melindungi manusia; yakni para tamumu yang ingin kami ajak melakukan hubungan seksual'."
  }
]