[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Luth berkata kepada mereka, ”Ini putri-putriku, nikahilah mereka, jika kalian ingin memenuhi syahwat kalian.” Beliau menyebut wanita-wanita sebagai putri-putrinya, karena Nabi suatu umat berkedudukan sebagai ayah mereka. Dan janganlah kalian berbuat hal yang diharamkan Allah atas kalian, yaitu menyetubuhi lelaki-lelaki.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Lūṭ -'alaihissalām- berkata kepada mereka guna membela diri di hadapan para tamunya, “Itu ada anak-anak wanitaku yang termasuk dari wanita kaum kalian, maka nikahilah mereka bila kalian ingin menunaikan hajat kalian secara halal.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Luth berkata: “Ini anak-anak perempuan kaumku, menikahlah dengan mereka jika kalian hendak menjauhkan diri dari dosa.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. قَالَ هٰٓؤُلَآءِ بَنَاتِىٓ إِن كُنتُمْ فٰعِلِينَ (Luth berkata: “Inilah puteri-puteriku (kawinlah dengan mereka), jika kamu hendak berbuat (secara yang halal)”) Yakni jika kalian hendak berbuat hal keji dengan tamuku, maka lebih baik dengan putri-putriku. Nabi Luth hendak mencegah perbuatan mereka dengan sesuatu yang lebih ringan akibat buruknya. Pendapat lain mengatakan yang dimaksud adalah inilah putri-putriku, nikahilah mereka dengan cara yang halal, dan janganlah kalian melakukan hal haram. Pendapat lain mengatakan yang dimaksud oleh Nabi Luth dengan putri-putrinya adalah para istri kaumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Luth berkata: “Inilah puteri-puteriku, kawinlah dengan mereka, jika kamu hendak berbuat secara yang halal, serta jangan berbuat jahat kepada tamuku”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berkata,“Mereka itulah putri-putriku (kawinilah). Jika kalian hendak berbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-72. “luth berkata” kepada mereka lantaran semakin gentingnya keadaan yang menghimpitnya ”inilah putri putri (negeriku) (kawinlah dengan mereka) jika kamu hendak berbuat (secara yang halal)”, mereka tidak mempedulikan penuturannya. karena itu, Allah berkata kepada RasulNya, Muhammad ”demi umurmu (Muhammad) sesungguhnya mereka terombang ambing di dalam kemabukan (kesesatan)” kemabukan (mereka) ini, adalah mabuk cinta untuk melakukan perbuatan keji yang mana mereka itu sudah tidak mempedulikan cercaan dan celaan atas perbuatan itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Maka Luth menjawab mereka, seperti yang Allah kabarkan, “Dia berkata, inilah putri-putriku, jika kalian ingin melakukannya.” Inilah putri-putriku, nikahilah mereka jika kalian ingin melakukan apa yang telahku perintah dan arahkan. Pelajaran dari ayat: • Penjelasan perlindungan Luth ‘alaihissalam kepada tamunya, sehingga ia rela menebus mereka dengan putri-putrinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 71: Karena begitu beratnya beban batin yang Beliau alami."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 71",
    "description": "Mendengar ucapan dan sikap kaumnya yang keras kepala, nabi lut berkata dalam rangka memberi alternatif, mereka itulah putri-putriku dan putri-putri kaumku yang dapat kamu nikahi, jika kamu hendak berbuat, yakni melakukan hubungan seksual. Itulah cara yang halal dan terhormat bagi kalian sesuai fitrah yang Allah tetapkan. Sebelum melanjutkan kisah kaum nabi lut, Allah berfirman, demi umurmu, wahai nabi Muhammad atau nabi nuh, sungguh mereka, yakni kaum nabi lut terus saja terombang-ambing dalam kemabukan sehingga tidak akan menyadari kesesatan mereka."
  }
]