[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "72-73. Allah yang mahapencipta bersumpah dengan siapa saja yang Dia kehendaki dan dengan apa saja yang Dia kehendaki, adapun makhluk, tidak boleh baginya bersumpah kecuali dengan nama Allah, dan (disini) Allah bersumpah dengan hidupnya Muhammad sebagai penghormatan baginya. ”sesungguhnya kaum luth dalam kelalaian yang parah, mereka berjalan tak tentu arah dan semakin tidak terbendung, sampai akhirnya suara petir siksaan menyambar mereka pada waktu terbitnya matahari.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Dan demi hidupmu -wahai Rasul- sesungguhnya kaum Lūṭ benar-benar terkekang oleh nafsu syahwat mereka yang kotor."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72-73. Allah bersumpah dengan kehidupan Rasulullah Muhammad sebagai penghormatan baginya -dan tidak ada yang boleh bersumpah dengan hal ini kecuali Allah- dan penegasan atas kemurkaan-Nya terhadap kaum Luth yang tenggelam dalam kesesatan dan enggan menerima nasehat, sehingga mereka dibinasakan dengan suara yang menggelegar pada waktu terbitnya matahari."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. لَعَمْرُكَ (Demi umurmu) Para ahli tafsir bersepakat bahwa yang dimaksud dengan kata ini adalah sumpah dari Allah ta’ala dengan umur Nabi Muhammad. Allah bersumpah dengan makhluk-makhluk-Nya sesuai kehendak-Nya, seperti bintang, waktu dhuha, matahari, malam, dan lain sebagainya. إِنَّهُمْ لَفِى سَكْرَتِهِمْ يَعْمَهُونَ(sesungguhnya mereka terombang-ambing di dalam kemabukan (kesesatan)”) Makna (السكرة) disini adalah keadaan bergejolaknya syahwat yang diharamkan. Yakni mereka dalam kesesatan yang mereka lakukan tanpa kesadaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Mereka disifati dengan kemabukan yang merupakan tanda rusaknya akal, dan terombang-ambing yang menandakan rusaknya penglihatan; oleh karena itu ketergantungan seseorang dengan suatu gambar dapat dipastikan akalnya telah rusak, dan pengihatannya yang terombang-ambing, serta hatinya sedang mabuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Allah berfirman dengan sumpah: “Demi umurmu wahai Muhammad, sesungguhnya mereka terombang-ambing di dalam kemabukan atau kesesatan”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "“Demi umurmu} demi kehidupanmu wahai Muhammad {sesungguhnya mereka dalam keadaan mabuk mereka itu} kesesatan dan kelalaian mereka {terombang-ambing} ragu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-72. “luth berkata” kepada mereka lantaran semakin gentingnya keadaan yang menghimpitnya ”inilah putri putri (negeriku) (kawinlah dengan mereka) jika kamu hendak berbuat (secara yang halal)”, mereka tidak mempedulikan penuturannya. karena itu, Allah berkata kepada RasulNya, Muhammad ”demi umurmu (Muhammad) sesungguhnya mereka terombang ambing di dalam kemabukan (kesesatan)” kemabukan (mereka) ini, adalah mabuk cinta untuk melakukan perbuatan keji yang mana mereka itu sudah tidak mempedulikan cercaan dan celaan atas perbuatan itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَفِي سَكۡرَتِهِمۡ يَعۡمَهُونَ) lafii sakratihim ya’mahuun : “sungguh mereka terombang-ambing di dalam kemabukan mereka.” terombang-ambing dalam kesesatan mereka dan besarnya nafsu mereka sehingga menghilangkan akal mereka. Makna ayat: Firman-Nya ta’ala “Demi umurmu sungguh mereka terombang-ambing dalam kemabukan mereka.” yaitu demi hidupmu wahai Rasul Kami, sesungguhnya mereka, kaum Luth “dalam kemabukan.” Dalam kesesatan yang menghilangkan akal mereka, sampai mereka jatuh kederajat yang paling rendah lebih rendah dari derajat hewan. “terombang-ambing” bingung, Pelajaran dari ayat: • Kemuliaan Nabi shalallahu ‘alaihi wa sallam, sebagaimana Allah ta’ala bersumpah dengan umur beliau pada firman-Nya (لعمرك)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 72: Orang Arab biasa bersumpah dengan umur seseorang. Di sini Allah bersumpah dengan umur atau kehidupan Nabi Muhammad shallallahu 'alaihi wa sallam untuk memuliakan beliau. Namun perlu diketahui, bahwa bagi kita dilarang bersumpah dengan nama selain Allah Ta’ala. Rasulullah shallallahu 'alaihi wa sallam bersabda: مَنْ حَلَفَ بِغَيْرِ اللهِ فَقَدْ كَفَرَ اَوْ اَشْرَكَ “Barang siapa bersumpah dengan nama selain Allah, maka ia telah berbuat kufur atau syirk.” (HR. Tirmidzi dan ia menghasankannya) Mereka tidak peduli lagi dengan kritik dan celaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 72",
    "description": "Sebelum melanjutkan kisah kaum nabi lut, Allah berfirman, demi umurmu, wahai nabi Muhammad atau nabi nuh, sungguh mereka, yakni kaum nabi lut terus saja terombang-ambing dalam kemabukan sehingga tidak akan menyadari kesesatan mereka. Dalam keadaan yang demikian itu maka mereka dibinasakan oleh Allah dengan suara keras yang mengguntur yang terjadi ketika matahari akan terbit."
  }
]