[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "72-73. Allah yang mahapencipta bersumpah dengan siapa saja yang Dia kehendaki dan dengan apa saja yang Dia kehendaki, adapun makhluk, tidak boleh baginya bersumpah kecuali dengan nama Allah, dan (disini) Allah bersumpah dengan hidupnya Muhammad sebagai penghormatan baginya. ”sesungguhnya kaum luth dalam kelalaian yang parah, mereka berjalan tak tentu arah dan semakin tidak terbendung, sampai akhirnya suara petir siksaan menyambar mereka pada waktu terbitnya matahari.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Maka mereka ditimpa suara mengguntur yang membinasakan manakala matahari hendak terbit."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. فَأَخَذَتْهُمُ الصَّيْحَةُ (Maka mereka dibinasakan oleh suara keras yang mengguntur) Yakni suara yang sangat keras. Atau suara teriakan dari malaikat Jibril. مُشْرِقِينَ (ketika matahari akan terbit) Yakni saat mereka memasuki waktu terbitnya matahari."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Maka mereka dibinasakan oleh shaihah yaitu suara keras yang mengguntur, ketika matahari akan terbit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu mereka dibinasakan oleh suara keras} suara keras yang dapat menghancurkan {ketika matahari terbit} waktu matahari terbit"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "73. maka, setelah para utusan itu menjelaskan jati diri mereka pada luth, hilanglah apa yang dirasakan olehnya, berupa kesempitan dan kesulitan. Diapun menaati perintah Rabbnya dan berjalan di malam hari bersama para pengikutnya. Merekapun akhirnya selamat. Sementara itu, penduduk daerah tersebut, ”maka mereka dibinasakan oleh suara keras yang mengguntur, ketika matahari akan terbit” yaitu ketika matahari terbit, hukuman semakin dahsyat atas diri mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مُشۡرِقِينَ) musyriqiin : pada waktu matahari terbit. Makna ayat: “Maka suara keras menimpa mereka pada waktu matahari terbit.” Yaitu teriakan Jibril ‘alaihissalam menimpa mereka pada bersamaan dengan terbit matahari."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 73",
    "description": "Dalam keadaan yang demikian itu maka mereka dibinasakan oleh Allah dengan suara keras yang mengguntur yang terjadi ketika matahari akan terbit. Seiring datangnya suara keras yang mengguntur itu maka kami jungkir balikkan kota sodom dan gomorah yang menjadi tempat tinggal kaum nabi lut, dan selain itu, kami juga hujani mereka secara bertubi-tubi dengan batu dari tanah yang keras sehingga mereka hancur dan binasa."
  }
]