[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian kami membalik negeri-negeri mereka, kami balik bagian atas menjadi bagian bawah, dan kami hujani mereka dengan bebatuan dari tanah keras lagi kuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Kami membalik negeri mereka, bagian atasnya Kami menjadikan bagian bawah, Kami menghujani mereka dengan batu dari tanah liat yang membatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Maka Kami jadikan negeri mereka terbalik, permukaan tanah bagian atasnya Kami jadikan bagian bawah; dan Kami hujani mereka dengan bebatuan dari tanah yang mengeras."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "74. فَجَعَلْنَا عٰلِيَهَا سَافِلَهَا (Maka Kami jadikan bahagian atas kota itu terbalik ke bawah) Yakni Kami balik kota mereka bersama para penghuninya agar mereka terkubur dibawahnya. وَأَمْطَرْنَا عَلَيْهِمْ حِجَارَةً مِّن سِجِّيلٍ(dan Kami hujani mereka dengan batu dari tanah yang keras) Yakni dari tanah yang membatu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Maka Kami jadikan sebgaian kota itu terbalik ke bawah dan Kami hujani mereka dengan batu dari tanah yang keras"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu Kami menjadikan bagian atasnya menjadi bagian bawah dan Kami menghujani mereka dengan tanah yang membatu} tanah yang membatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74. ”maka kami jadikan bagian atas kota itu terbalik kebawah” maksudnya kami telah menjungirbalikan kota mereka, ”dan kami hujani mereka dengan batu dari tanah yang keras” batu batu itu menuntut orang orang yang berlarian (tanpa arah) ditempat itu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (مِّن سِجِّيلٍ) min sijjiil : tanah yang dibakar di neraka. Makna ayat: “Maka Kami jungkir balikkan (negeri itu).” Kami jadikan bawah negeri itu bagian atasnya, membaliknya seperti membalik telapak tangan. “lalu Kami hujani mereka” di atasnya batu-batu dari tanah yang dibakar di neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 74: Malaikat Jibril mengangkatnya ke langit, lalu menjatuhkannya dengan dibalik. Yakni tanah yang dibakar dengan api."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 74",
    "description": "Seiring datangnya suara keras yang mengguntur itu maka kami jungkir balikkan kota sodom dan gomorah yang menjadi tempat tinggal kaum nabi lut, dan selain itu, kami juga hujani mereka secara bertubi-tubi dengan batu dari tanah yang keras sehingga mereka hancur dan binasa. Sungguh, pada yang demikian itu, yaitu berita-berita dan kisah-kisah yang Allah sampaikan, benar-benar terdapat tanda-tanda kebesaran, keagungan, dan kekuasaan Allah bagi orang yang memperhatikan tanda-tanda yang diperlihatkan dan dihamparkan di alam semesta ini."
  }
]