[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-77. Sesungguhnya dalam kejadian siksaan yang menimpa mereka benar-benar terkandung pelajaran-pelajaran bagi orang-orang yang memperhatikan lagi mau mengambil pelajaran. Dan sesungguhnya negeri-negeri mereka benar-benar berada dalam lokasi yang tetap yang dapat disaksikan oleh kaum yang menempuh perjalanan jauh lagi melewatinya. Sesungguhnya dalam peristiwa penghancuran kami terhadap mereka benar-benar terdapat petunjuk nyata bagi orang-orang yang beriman dan melaksanakan syariat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Sesungguhnya negeri kaum Lūṭ berada di suatu jalan yang dikenal, musafir yang melewatinya pasti akan melihatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. وَإِنَّهَا لَبِسَبِيلٍ مُّقِيمٍ (Dan sesungguhnya kota itu benar-benar terletak di jalan yang masih tetap) Yakni kota kaum Luth itu masih terletak di tempat yang sama, yaitu terletak di jalan dari kota Madinah menuju kota Syam."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Sesungguhnya kota yang dihuni kaum Luth itu benar-benar terletak di jalan yang masih dilalui kaummu sekarang yaitu kaum Quraisy dan para manusia yang lalu lalang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya itu benar-benar terletak di jalan} sesungguhnya negeri kaum Luth terletak di jalan {yang masih tetap} tetap dilalui para musafir yang lewat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. “dan sesungguhnya kota itu” yaitu kota nabi luth “benar benar terletak di jalan yang masih tetap (dilalui manusia)” pada (jalan) yang dilewati orang orang. Setiap orang yang suka mondar mandir akan melewati kota tersebut akan mengetahui."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (لَبِسَبِيلٖ مُّقِيمٍ) labisabiilim muqiim : “jalan yang masih tetap (dilalui).” Jalan yang digunakan Quraisy untuk pergi ke Syam masih tetap ada. Makna ayat: Firman-Nya ta’ala “Sungguh negeri itu berada di jalan yang masih tetap (dilalui)” negeri yang musnah itu sungguh berada di jalan yang masih ada dan selalu dilewati oleh penduduk Mekah kala perjalanan mereka menuju Syam."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 76: Yang dimaksud negeri di sini adalah kota Sadom yang terletak dekat pantai laut Tengah. Yakni dilalui orang-orang Quraisy ketika pergi menuju Syam yang belum hilang bekas-bekasnya. Oleh karena itu, mengapa mereka tidak mengambil pelajaran."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 76",
    "description": "Dan Allah pun menegaskan bahwa se-sungguh-Nya kota itu, yakni sodom dan gomorah yang terletak di sebelah timur laut mati dan menjadi tempat tinggal kaum nabi lut, benar-benar terletak di jalan yang masih tetap dapat dilalui manusia, pun dapat disaksikan bekas-bekas kehancurannya. Sungguh, pada yang demikian itu, yaitu peristiwa-peristiwa yang digambarkan dalam kisah-kisah tentang nabi ibrahim dan nabi lut bersama kaum mereka, benar-benar terdapat tanda kekuasaan Allah bagi orang yang beriman."
  }
]