[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "75-77. Sesungguhnya dalam kejadian siksaan yang menimpa mereka benar-benar terkandung pelajaran-pelajaran bagi orang-orang yang memperhatikan lagi mau mengambil pelajaran. Dan sesungguhnya negeri-negeri mereka benar-benar berada dalam lokasi yang tetap yang dapat disaksikan oleh kaum yang menempuh perjalanan jauh lagi melewatinya. Sesungguhnya dalam peristiwa penghancuran kami terhadap mereka benar-benar terdapat petunjuk nyata bagi orang-orang yang beriman dan melaksanakan syariat Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Sesungguhnya pada peristiwa ini terkandung petunjuk bagi orang-orang yang beriman, mereka mengambil pelajaran darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. إِنَّ فِى ذٰلِكَ (Sesungguhnya pada yang demikian itu) Yakni azab yang ditimpakan Allah kepada orang-orang yang bermaksiat terhadap nabi mereka dan terus-menerus melakukan perbuatan Sodom, begal, dan kemungkaran-kemungkaran dengan terang-terangan. لَاٰيَةً لِّلْمُؤْمِنِينَ(benar-benar terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang beriman) Agar mereka dapat mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Sesungguhnya pada azab itu benar-benar terdapat tanda-tanda kekuasaan Allah bagi orang-orang yang beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya pada yang demikian itu benar-benar terdapat tanda bagi orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. “sesungguhnya pada yang demikian itu benar benar terdapat tanda tanda (kekuasaan Allah) bagi orang orang yang beriman” dalam kisah ini terkandung berbagai macam pelajaran penting, (dianatranya); perhatian Allah kepada kekasihNya, Ibrahim, karena nabi luth termasuk pengikut beliau, dan orang yang beriman kepada beliau. Seolah olah menjadi muridnya. Maka, ketika Allah berkehendak untuk menghancurkan kaum Nabi Luth, saat mereka berhak mendapatkan balasan itu maka Allah memerintahkan para utusanNya (malaikat) untuk mampir ke Nabi Ibrahim guna menyampaikan kabar gembira (mengenai kelahiran) seorang anak dan memberitahukan kepada beliau misi pengutusan mereka, hingga akhirnya beliau mempersoalkan kepada mereka tentang pemusnahan kaum luth. Sampai akhirnya para malaikat berhasil menyampaikan jawaban yang memuaskan kepada beliau, dan jiwa beliaupun lega, begitu pula luth saat mereka itu (kaum yang akan ditimpa siksa) adalah penduduk negerinya, mungkin saja rasa iba dan kasihan kepada mereka mengendalikan perasaannya. Maka Allah menakdirkan sebab kausalitas yang membuatnya semakin marah dan geram (terhadap kaumnya) sampai beliaupun menganggap waktu kedatangan pemusnahan mereka terlalu lama, ketika disampaikan kepada beliau, bahwa “sesungguhnya saat jatuhnya azab kepada mereka ialah waktu shubuh. Bukanlah waktu shubuh itu sudah dekat?” Pelajaran yang lain, bahwasannya Allah jika berkehendak untuk membinasakan suatu daerah maka keburukan dan sifat melampaui batas mereka semakin menggila. jika sudah sampai ambang batas, maka Allah menjatuhkan hukuman hukuman yang pantas mereka terima."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Pada yang demikian terdapat ayat bagi orang-orang yang beriman.” Pelajaran bagi orang-orang mukmin, sehingga mereka tidak berani menerjang keharaman Allah dan tidak melakukan maksiat. Pelajaran dari ayat: • Penjelasan bahwa azab Allah kepada orang-orang zalim adalah untuk pelajaran dan peringatan. • Penetapan kenabian Rasulullah shalallahu ‘alaihi wa sallam, karena kabar seperti ini tidak mungkin didapat kecuali melalui wahyu ilahi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 77: Di antara pelajaran yang dapat diambil dari kisah di atas adalah perhatian Allah Ta’ala kepada wali-Nya, dan bahwa Allah Subhaanahu wa Ta'aala apabila hendak membinasakan suatu negeri, kemaksiatan penduduknya semakin bertambah, dan jika sudah semakin parah, maka Allah Subhaanahu wa Ta'aala akan menurunkan hukuman-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 77",
    "description": "Sungguh, pada yang demikian itu, yaitu peristiwa-peristiwa yang digambarkan dalam kisah-kisah tentang nabi ibrahim dan nabi lut bersama kaum mereka, benar-benar terdapat tanda kekuasaan Allah bagi orang yang beriman. Setelah mengisahkan pembinasaan kaum nabi lut karena kedurhakaan mereka pada ayat-ayat sebelumnya, pada ayat berikut Allah menuturkan kisah kaum nabi syu'aib dan kebinasaan mereka. Allah berfirman, dan sesungguhnya penduduk aikah itu, yakni sebuah lokasi di wilayah madyan yang ditinggali oleh kaum nabi syu'aib, benar-benar kaum yang zalim. Mereka suka menyamun dan merampok orangorang yang melewati negeri mereka serta curang dalam menakar dan menimbang."
  }
]