[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "78-79. Dan sesungguhnya para penduduk kota yang dikelilingi oleh pepohonan, yaitu kaum syuaib, mereka berbuat kezhaliman terhadap diri mereka, dikarenakan kekafiran mereka kepada Allah dan rasul mereka yang mulia. Karena itu, kami membalas mereka dengan suara yang menggelegar dan siksaan pada hari yang mendung. Dan sesungguhnya pemukiman kaum luth dan kaum syuaib benar-benar berada pada jalan yang jelas yang dilintasi manusia dalam safar mereka, Sehingga mereka dapat mengambil pelajaran."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Kami membalas mereka dengan menimpakan azab atas mereka, sesungguhnya negeri kaum Lūṭ dan tempat kaum Syu'aib berada di jalan yang terkenal bagi siapa yang melewatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. وَإِنَّهُمَا لَبِإِمَامٍ مُّبِينٍ (Dan sesungguhnya kedua kota itu benar-benar terletak di jalan umum yang terang) Yakni kota kaum Nabi Luth dan kota kaum Nabi Syu’aib berada di jalanan yang jelas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Maka Kami binasakan mereka dengan azab di hari zhillah. Dan sesungguhnya kedua kota itu yaitu tempat tinggal kaum Luth dan kaum Syu’aib benar-benar terletak di jalan umum dan terang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka Kami membinasakan mereka. Sesungguhnya keduanya} negeri kaum Luth dan penduduk Aikah itu {terletak di satu jalur yang jelas} sungguh di jalan yang jelas bagi orang yang ingin (mengetahuinya)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. “maka kami membinasakan mereka” maka azab dari (Allah) membinasakan mereka pada hari yang dinaungi oleh mendung. Sesungguhnya itu adalah siksa pada hari yang dahsyat. ”sesungguhnya kedua kota itu” perkampungan luth dan para pemilik al-aikah. ”benar benar terletak di jalan umum yang terang” maksudnya berada di jalan yang jelas, dilalui oleh para musafir setiap saat. Diantara peninggalan mereka terdapat obyek yang jelas dapat disaksikan oleh mata penglihatan, sehingga orang orang yang berakal (dapat) mengambil pelajaran dengannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَإِنَّهُمَا لَبِإِمَامٖ مُّبِينٖ) wa innahumaa labi imaamim mubiin : “dan sungguh kedua negeri itu terletak di jalan yang nyata.” Yaitu kaum Luth dan penduduk Aikah, sungguh berada di jalan yang jelas dan terlihat. Makna ayat: Firman-Nya “Maka Kami binasakan mereka.” Kami musnahkan mereka dengan panas yang luar biasa pada hari Zhullah, dan akan ada pembahasan mengenai mereka pada surat Asy-Syu’araa Allah ta’ala berfirman “lalu mereka ditimpa azab pada hari yang gelap. Sungguh, itulah azab pada hari yang dahsyat.” Firman-Nya “Dan sungguh kedua negeri itu terletak pada jalan yang nyata.” Al-imam adalah jalan, karena manusia berjalan di atasnya sebagai penuntun, mubiin yaitu jelas. Kata ganti pada firman-Nya kembali kepada kaum Luth dan kaum Syu’aib, penduduk Aikah, bukan penduduk Madyan karena ia diutus kepada penduduk Aikah dan Madyan, dan jalan yang dimaksud, adalah rute Quraisy menuju Syam. Maksud dari penyebutan ini adalah peringatan bagi Quraisy dan pengingat bagi mereka, maka apakah mereka akan mengambil pelajaran dan sadar?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 79: Dengan suara keras yang mengguntur, gempa, dan hari yang gelap. Yakni kota kaum Luth (Sadom) dan Aikah. Yang dilalui setiap waktu oleh musafir dan sisa-sisa peninggalan mereka dapat dilihat. Oleh karena itu, tidakkah mereka mengambil pelajaran?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 79",
    "description": "Akibat dari sikap, perbuatan, dan kezaliman mereka itu maka kami membinasakan mereka, yakni kaum nabi syu'aib. Dan sesungguhnya kedua negeri itu, yakni kota sodom yang didiami kaum nabi lut dan kota aikah yang didiami kaum nabi syu'aib, terletak di satu jalur jalan raya yang masih biasa dilalui manusia hingga saat ini. Usai menuturkan kisah kaum nabi lut dan nabi syu'aib, Allah lalu menceritakan kisah kaum samud, kaum nabi saleh. Allah berfirman, dan sesungguhnya penduduk negeri a'ijr, yakni kaum samud yang mendiami suatu wilayah di wadi al-qura antara madinah dengan suriah, benar-benar telah mendustakan nabi saleh sebagai salah seorang dari para rasul yang Allah utus kepada mereka."
  }
]