[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Allah membantah mereka, ”sesungguhnya kami tidaklah mengurus malaikat kecuali dengan membawa siksaan yang tidak ada penundaan untuk dijatuhkan pada orang yang tidak beriman. Dan mereka itu ketika malaikat datang dengan membawa siksaan tidaklah diberi penangguhan lagi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Allah menjawab permintaan mereka untuk mendatangkan malaikat-malaikat, “Kami tidak menurunkan para malaikat kecuali sebatas tuntutan hikmah manakala masa pembinasaan mereka telah tiba, bila Kami mendatangkan malaikat-malaikat kepada mereka, maka mereka tidak diberi kesempatan apa pun, sebaliknya azab akan segera membinasakan mereka”."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. مَا نُنَزِّلُ الْمَلٰٓئِكَةَ إِلَّا بِالْحَقِّ (Kami tidak menurunkan malaikat melainkan dengan benar) Yakni dengan hikmah Allah dan kehendak-Nya, dan apa yang kalian usulkan ini bagi Allah tidak termasuk urusan yang mengharuskan untuk diturunkan malaikat. وَمَا كَانُوٓا۟ إِذًا مُّنظَرِينَ(dan tiadalah mereka ketika itu diberi tangguh) Yakni seandainya Kami menurunkan malaikat kemudian mereka tidak juga beriman niscaya akan disegerakan siksaan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Allah menjawab permintaan mereka dengan jawaban: “Kami tidak menurunkan malaikat melainkan dengan benar yaitu untuk membawa azab. Dengan segera. Sehingga jika memang malaikat sudah Kami turunkan maka azab mereka benar-benar sudah di depan mata. Maknanya jika Kami telah menurunkan malaikat sungguh mereka akan cepat-cepat memberi hukuman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menurunkan malaikat, kecuali dengan kebenaran} dengan risalah dan azab {Mereka tidak diberi penangguhan} ditangguhkan dan diberi tenggang waktu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7-8. “mengapa kamu tidak mendatangkan malaikat kepada kami” yang bersaksi bagi dirimu atas kebenaran risalah yang engkau bawa, ”jika kamu termasuk orang orang yang benar” ketika engkau tidak bisa mendatangkan malaikat, berarti kamu bukan orang yang jujur. Ini adalah termasuk bentuk kezhaliman dan kebodohan yang parah. Tentang tindak kezhaliman (mereka), maka sudah tampak jelas. sesungguhnya sikap itu merupakan bentuk kelancangan dan keras kepala mereka terhadap Allah dengan meminta datangnya tanda tanda buti kebenaran (nabi) yang mana Allah belum memilihnya (untuk diturunkan). Padahal, tujuan dan petunjuk yang mengarah kesana sudah tercapai tanpa menggunakannya, melalui tanda tanda kebenaran (lain) yang banyak yang menandakan kebenaran risalah yang beliau bawa. Berkaitan dengan aspek kebodohan mereka, maka sebenarnya mereka tidak bisa membedakan maslahat bagi mereka sendiri dari bahaya. Kedatangan para malaikat kepada mereka tidak berarti kebaikan bagi mereka. justru Allah tidak mengirimkan malaikat kecuali dengan al haq (siksaan) yang sudah tidak ada penundaan lagi bagi orang yang tidak mengikuti dan taat kepada beliau “dan tiadalah mereka ketika itu” maksudnya mereka tidak beriman dan tidak akan beriman “diberi tangguh” maksudnya mereka tidak akan mendapatkan kesempatan lagi (untuk bertaubat dan selamat) maka, permintaan mereka agar malaikat datang hanya akan menyegerakan kebinasaan dan kehancuran bagi diri mereka sendiri. Keaimanan tidak berada di tangan mereka, tapi ditangan Allah. “kalau sekiranya Kami turunkan malaiat kepada mereka, dan orang orang yang telah mati berbicara dengan mereka, dan Kami kumpulkan (pula) segala sesuatu kehadapan mereka, niscaya mereka tidak (juga) akan beriman, kecuali jika Allah menghendaki, tetapi kebanyakan mereka tidak mengetahui”"
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ) wa maa kaanuu idzam munzhariin : “dan mereka tidak diberi penangguhan.” Penundaan, bahkan mereka akan terkena azab ketika para malaikat turun. Makna ayat: Allah ta’ala berfirman: (مَا نُنَزِّلُ ٱلۡمَلَٰٓئِكَةَ إِلَّا بِٱلۡحَقِّ) “Tidaklah Kami menurunkan malaikat kecuali dengan kebenaran.” Turun bersama dengan kebenaran, tidak malaikat turun kecuali untuk kenegakkan kebenaran dan menghacurkan kebatilan, bukan hanya sekedar mengikuti keinginan manusia dan permintaan mereka, seandainya malaikat turun dan mereka tidak beriman, maka azab akan turun seketika (وَمَا كَانُوٓاْ إِذٗا مُّنظَرِينَ) “dan mereka tidak diberi penangguhan.” Ditunda bahkan mereka dimusnahkan saat itu juga. Pelajaran dari ayat: • Salah satu tanda di antara tanda-tanda rahmat Allah kepada manusia, mereka meminta turunnya azab, sedangkan Allah menurunkan rahmat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 8: Ketika turun malaikat membawa azab."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 8",
    "description": "Menjawab permintaan kaum kafir tersebut, Allah berfirman, kami tidak menurunkan malaikat melainkan dengan kebenaran, yaitu sesuatu yang pasti dari Allah, seperti wahyu, azab bagi pendurhaka, dan keselamatan bagi penaat, dan mereka ketika para malaikat itu diturunkan untuk membawa azab, tidak diberikan penangguhan sedikit pun. Untuk membuktikan kebenaran pengakuan nabi Muhammad bahwa ayat-ayat yang disampaikannya benar-benar berasal dari Allah, dia berfirman, sesungguhnya kamilah yang menurunkan Al-Qur'an melalui perantara malaikat jibril yang diragukan oleh kaum kafir itu, dan pasti kami pula bersama malaikat jibril dan kaum mukmin yang selalu memelihara keaslian, kesucian, dan kekekalan-Nya hingga akhir zaman."
  }
]