[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh penduduk lembah hijr telah mendustakan shaleh , Mereka adalah kaum tsamud, dengan perbuatan itu mereka telah mendustakan semua rasul Allah, sebab orang yang mendustakan satu nabi, sesungguhnya telah mendustakan nabi-nabi secara keseluruhan, karena mereka berada di atas agama yang satu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Sungguh kaum Ṡamūd, yaitu penduduk Al-Ḥijr (negeri antara Hijaz dengan Syam), telah mendustakan seluruh Rasul ketika mereka mendustakan Nabi mereka Ṣāleḥ -'alaihissalām-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80-84. Sungguh kaum nabi Tsamud yang merupakan para penduduk negeri Hijr -yang terletak di selatan Kota Madinah- telah mendustakan nabi mereka, Shalih. Kami telah mendatangkan kepada mereka berbagai mukjizat yang besar, di antaranya unta betina yang ajaib; namun mereka tetap tidak puas dan mendustakannya. Dahulu mereka memahat pegugungan yang kokoh untuk mereka jadikan tempat tinggal, dan mereka hidup dengan tenang tanpa mengkhawatirkan keselamatan dan kehidupan mereka. Namun mereka ditimpa suara menggelegar yang mengguncang dan menghancurkan negeri itu, sehingga harta dan benteng yang mereka miliki sama sekali tidak bermanfaat bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَلَقَدْ كَذَّبَ أَصْحٰبُ الْحِجْرِ الْمُرْسَلِينَ (Dan sesungguhnya penduduk-penduduk kota Al Hijr telah mendustakan rasul-rasul) Kata (الحجر) adalah nama dari pemukiman kaum Tsamud, yakni kaum dari Nabi Shalih, terletak di antara kota Makkah dan Tabuk."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Sesungguhnya penduduk-penduduk kota Al Hijr (sebuah Wadi antara Madinah dan Syam) yaitu kaum Tsamud telah mendustakan para rasul, Yaitu Nabi Shaleh, mendustakan satu rasul sama dengan mendustakan seluruh rasul."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya penduduk Hijr} penduduk yang tinggal di lembah antara Hijaz dan Syam, mereka adalah kaum Tsamud {benar-benar telah mendustakan para rasul"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. Allah memberitahukan tentang penduduk kota al hijr, mereka adalah kaum Nabi shaleh, yang tinggal di al hijr yang sudah tidak asing lagi di daerah hijaz. mereka itu telah mendustakan para rasul. maksudnya, mendustakan nabi shaleh. Barangsiapa telah mendustakan seorang rasul, maka sungguh ia telah mendustakan semua rasul, lantaran kesesuaian (substansi) dakwah mereka. Pendustaan mereka bukan kepada personelnya, akan tetapi terhadap kebenaran yang mereka bawa yang seluruh rasul ikut serta berpartisipasi mengembannya."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَصۡحَٰبُ ٱلۡحِجۡرِ) ashhaabul hijr : “Para penduduk Hijr” mereka adalah kaum Nabi Shaleh, dan tempat tinggal mereka berada di antara Madinah Nabawiyah dan Syam. Makna ayat: Ini adalah penjelasan singkat dari kisah lain, yaitu kisah para penduduk Hijr, Tsamud kaum Nabi Shaleh, Allah ta’ala berfirman : “Dan sungguh para penduduk Hijr telah mendustakan para rasul.” Ini merupakan nasihat bagi Rasulullah shalallahu ‘alaihi wa sallam, jika kaumnya dari penduduk Mekah mendustakannya, maka bersabarlah atas pendustaan mereka, karena kaum-kaum terdahulu telah mendustakan rasul mereka. Firman-Nya ta’ala “para rasul.” Mereka tidak hanya mendustakan Shaleh, karean siapapun yang mendustakan seorang rasul, maka ia telah mendustakan seluruhnya. Karena dakwah para rasul adalah satu, yaitu beribadah hanya kepada Allah sesuai dengan syariat-Nya, untuk menyempurnakan manusia dan agar mereka mendapat kebahagiaan dalam kedua hal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 80: Penduduk kota Al-Hijr ini adalah kaum Tsamud. Hijr tempat yang terletak di Wadi Qura antara Madinah dan Syam. Yang dimaksud para rasul di sini adalah Nabi Saleh. Disebutkan rasul-rasul (dalam bentuk jamak) adalah karena mendustakan seorang rasul sama dengan mendustakan semua rasul, di mana dakwah mereka adalah sama, yaitu mentauhidkan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 80",
    "description": "Usai menuturkan kisah kaum nabi lut dan nabi syu'aib, Allah lalu menceritakan kisah kaum samud, kaum nabi saleh. Allah berfirman, dan sesungguhnya penduduk negeri a'ijr, yakni kaum samud yang mendiami suatu wilayah di wadi al-qura antara madinah dengan suriah, benar-benar telah mendustakan nabi saleh sebagai salah seorang dari para rasul yang Allah utus kepada mereka. Dan kami telah mendatangkan kepada mereka tanda-tanda kekuasaan kami, yakni mukjizat kepada nabi saleh berupa unta betina yang membuktikan kerasulannya. Nabi saleh mengingatkan kaumnya untuk tidak mengganggu apalagi menyakiti unta tersebut. Namun, mereka melanggar pesan nabi saleh dan menyembelih unta itu. Mukjizat itu telah mereka saksikan, tetapi mereka selalu berpaling darinya dengan selalu abai."
  }
]