[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah mendatangkan kepada kaum Shaleh ayat-ayat kami yang menunjukan kebenaran risalah kebenaran yang di bawa oleh Shaleh, termasuk di dalamnya unta betina, namun mereka tidak memperdulikannya, dan mereka menjauh lagi berpaling darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Kami telah menyodorkan hujah-hujah dan dalil-dalil kebenaran Ṣāleḥ tentang apa yang dia bawa dari Rabbnya, di antaranya adalah unta betina, namun mereka tidak mengambil pelajaran dari bukt-bukti tersebut dan mengacuhkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. وَءَاتَيْنٰهُمْ ءَايٰتِنَا (dan Kami telah mendatangkan kepada mereka tanda-tanda (kekuasaan) Kami) Yakni Kami berikan mukjizat-mukjizat yang Kami turunkan kepada nabi mereka, diantaranya adalah unta betina. فَكَانُوا۟ عَنْهَا مُعْرِضِينَ(tetapi mereka selalu berpaling daripadanya) Yakni tidak menganggapnya. Oleh sebab itu mereka menyembelih unta itu dan melanggar perintah Nabi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Kami telah menunjukkan kepada mereka tanda-tanda kekuasaan Kami, tetapi mereka selalu berpaling dari kebenaran para rasul Kami, yaitu nabi Shaleh. Diantaranya adalah unta, lalu mereka tidak mau menerimanya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami telah mendatangkan kepada mereka ayat-ayat Kami, tetapi mereka berpaling darinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. “dan kami telah mendatangkan kepada mereka tanda tanda (kekuasaan) kami” yang menjadi bukti petunjuk akan kebenaran ajaran yang dibawa oleh shaleh kepada mereka, termasuk dalam contohnya, seekor unta yang menjadi salah satu tanda kekuasaan Allah yang agung. ”tetapi mereka selalu berpaling darinya\" karena sifat takabur dan arogansi kepada Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (وَءَاتَيۡنَٰهُمۡ ءَايَٰتِنَا) wa aatainaahum aayaatinaa : “Dan Kami telah memberikan mereka ayat-ayat Kami.” Yaitu unta, itu merupakan tanda yang terbesar. Makna ayat: Firman-Nya “Dan Kami memberikan mereka ayat-ayat Kami, namun mereka berpaling darinya.” Yang dimaksud dari ayat-ayat ini adalah unta, bahwasanya unta tersebut keluar dari sebongkah batu. Dia sehari minum dari air negeri tersebut dan berhenti disetiap rumah agar penghuninya memerah susunya sesuka hati mereka. Mereka berpaling dari tanda ini dan tidak beriman serta bertaubat kepada Allah ta’ala setelah memberikan apa yang mereka minta berupa ayat-ayat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 81: Yang menunjukkan kebenaran yang dibawa Nabi Saleh, di antaranya adalah unta betina. Sambil menyombongkan diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 81",
    "description": "Dan kami telah mendatangkan kepada mereka tanda-tanda kekuasaan kami, yakni mukjizat kepada nabi saleh berupa unta betina yang membuktikan kerasulannya. Nabi saleh mengingatkan kaumnya untuk tidak mengganggu apalagi menyakiti unta tersebut. Namun, mereka melanggar pesan nabi saleh dan menyembelih unta itu. Mukjizat itu telah mereka saksikan, tetapi mereka selalu berpaling darinya dengan selalu abai. Dan mereka, yakni kaum samud, memahat gunung-gunung batu untuk dijadikan rumah-rumah yang kokoh sebagai tempat tinggal. Rumahrumah itu mereka diami dengan rasa aman dari segala gangguan."
  }
]