[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "83-84. Maka suara halilintar siksaan menghantam mereka pada waktu pagi hari, ketika mereka di waktu pagi sekali. Maka kekayaan dan benteng-benteng di gunung tidaklah dapat menghalau siksaan Allah dari mereka bahkan tidak pula apa yang diberikan kepada mereka berupa kekuatan fisik dan kedudukan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Azab dalam bentuk halilintar menyambar mereka saat menjelang waktu Subuh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. فَأَخَذَتْهُمُ الصَّيْحَةُ مُصْبِحِينَ (Maka mereka dibinasakan oleh suara keras yang mengguntur di waktu pagi) Yakni ketika mereka memasuki waktu subuh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Maka mereka Kami binasakan dengan suara keras yang mengguntur di waktu pagi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian mereka dibinasakan oleh suara keras} sambaran siksa {pada pagi hari} waktu pagi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. “maka mereka dibinasakan oleh suara keras yang mengguntur diwaktu pagi” hati hati mereka hancur lebur dirongga rongga lambung mereka. Pagi hari itu, mereka binasa, disertai dengan kehinaan dan laknat pada mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Maka mereka tertimpa suara yang keras di waktu subuh.” Yaitu suara keras pada hari keempat, yaitu hari sabtu, lalu mereka musnah seluruhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 83: Peristiwa itu terjadi pada hari yang keempat, setelah datangnya peringatan kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 83",
    "description": "Keberpalingan mereka dari Allah dan kedurhakaan kepada-Nya kemudian membuat Allah murka. Mereka lalu dibinasakan oleh Allah pada hari keempat dari tenggat yang telah nabi saleh berikan kepada mereka untuk berpikir, dengan suatu azab berupa suara keras yang mengguntur pada pagi hari. Suara itu memicu gempa dahsyat yang membuat mereka terkubur dalam rumah-rumah mereka yang dipahat pada gunung-gunung batu itu. Azab itu datang dengan begitu dahsyat, sehingga tidak berguna lagi bagi mereka apa yang telah mereka usahakan. Mereka mengira bahwa rumah-rumah yang mereka pahat pada sisi tebing gunung yang kukuh itu akan menyelamatkan mereka, namun ternyata semua itu tidak mampu melindungi mereka dari azab Allah."
  }
]