[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami tidaklah menciptakan langit dan bumi dan semua yang ada di antara keduanya kecuali dengan benar-benar yang menunjukan kesempurnaan pencipta keduanya dan kuasaNya, dan sesungguhnya Dialah Dzat yang tidak sepatutnya ibadah dilaksanakan kecuali bagiNya semata, tiada sekutu bagiNya, dan sesungguhnya waktu yang hari kiamat akan terjadi padanya benar-benar akan datang, tidak ada keraguan padanya, agar setiap jiwa memperoleh balasan penuh atas apa yang diperbuatnya. Maka maafkanlah orang-orang musyrik itu (wahai rasul), dan berlapang dadalah terhadap mereka, serta abaikanlah apa yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Kami tidak menciptakan langit dan bumi serta apa yang ada di antara keduanya dengan batil tanpa hikmah, Kami tidak menciptakan semua itu kecuali dengan kebenaran. Sesungguhnya hari Kiamat pasti akan datang tidak bisa tidak, maka berpalinglah wahai Rasul dari orang-orang yang mendustakanmu dan maafkanlah mereka dengan maaf yang baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85-86. Dan kami tidak menciptakan tujuh langit dan bumi, serta makhluk-makhluk yang ada di dalamnya melainkan dengan keadilan; Maka barangsiapa yang selamat dari akibat kezalimannya maka sesungguhnya balasan kezaliman itu akan datang dengan segera atau suatu saat nanti. Maka bersabarlah hai Muhammad atas gangguan orang-orang musyrik dan maafkanlah mereka dengan baik tanpa mengolok dan membalas. Sungguh Tuhanmu yang menciptakan segala sesuatu, Dia menciptakan banyak generasi secara bergantian dan menciptakan makhluk-makhluk secara terus-menerus. Dia Maha Mengetahui mereka dan apa yang membawa kemaslahatan bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. إِلَّا بِالْحَقِّ ۗ (melainkan dengan benar) Yakni Kami ciptakan keduanya dengan penuh manfaat dan maslahat. Pendapat lain mengatakan yang dimaksud dengan (بالحق) adalah Allah akan membalas orang yang berbuat kebaikan dengan kebaikan dan membalas orang yang berbuat keburukan dengan keburukan. وَإِنَّ السَّاعَةَ لَاٰتِيَةٌ ۖ( Dan sesungguhnya saat (kiamat) itu pasti akan datang) Dan ketika hari kiamat telah datang, Allah akan menyiksa orang yang berhak mendapatkan azab dan memberi kebaikan orang yang berhak mendapat kebaikan. فَاصْفَحِ الصَّفْحَ الْجَمِيلَ (maka maafkanlah (mereka) dengan cara yang baik) Yakni ampuni dan maafkan mereka dan perlakukanlah mereka dengan penuh kelembutan dan pemaafan. Terdapat pendapat mengatakan bahwa perintah ini telah dinasakh (dihapus) dengan turunnya ayat yang memerintahkan untuk memerangi mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ فَاصْفَحِ الصَّفْحَ الْجَمِيلَ } Yaitu pemberian maaf yang tidak ada gunjingan di dalamnya, pemberian maaf yang baik adalah pemberian maaf yang selamat dari kebencian dan kedengkian, dan dilakukan pada posisi yang tepat misalnya bukan ketika ia sedang memberi hukuman, seperti hukuman diantara dua orang zhalim yang sedang bermusuhan ."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Kami tidak menciptakan langit dan bumi beserta segala yang ada di antara keduanya, baik makhluk maupun benda mati melainkan dengan benar. Sesungguhnya hari kiamat itu pasti akan datang tanpa keraguan, maka maafkanlah mereka dengan cara yang baik tanpa menyakiti dan membuat cemas"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami tidak menciptakan langit dan bumi serta apa yang ada di antara keduanya, melainkan dengan benar. Sesungguhnya kiamat} kiamat {pasti akan datang. Maka maafkanlah dengan cara yang baik} maka berpalinglah dari mereka dan maafkanlah dengan cara yang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. maksudnya, kami tidaklah menciptakan keduanya dengan sia sia lagi batil, sebagaimana persangkaan para musuh Allah. Bahkan kami tidaklah menciptakan keduanya “melainkan dengan benar benar” yang dari kebenaran itu (diharapkan) agar keduanya dan seisinya menjadi petunjuk atas kesempurnaan pencipta keduanya, kekuasaanNya serta keluasan rahmatNya hikmahNya dan ilmuNya yang meliputi (segala sesuatu). Dan (menunjukan) bahwa Dialah yang tidak sepatutnya ibadah dikerjakan kecuali untukNya, tiada sekutu bagiNya. “dan sesungguhnya saat (kiamat) itu pasti akan datang” tidak disangsikan lagi, sungguh penciptaan langit dan bumi lebih dahsyat dibandingkan sekedar penciptaan manusia. “maka maafkanlah (mereka) dengan cara yang baik” yaitu pemberian maaf yang tidak dibuntuti tindakan menyakiti (si penerima) justru membalas sikap buruk orang dengan kebaikan, dosa dengan ampunan, agar engkau dapat menggapai pahala dan ganjaran besar dari Rabbmu. Sesungguhnya setiap sesuatu yang (pasti) datang berarti sudah dekat. Telah tersibak sebuah pengertian yang lebih baik dari pada yang sudah saya sebutkan (di atas) yakni perkara yang diperintahkan adalah memberi maaf dengan cara yang baik. Artinya cara yang elegan yang terbebas dari unsur kedengkian dan gangguan dalam bentuk ucapan maupun tindakan, bukan pemberian maaf yang tidak baik. yaitu pemberian maaf yang tidak pada tempatnya. maka tidak boleh diberikan maaf ketika keadaan menuntut penerapan hukuman. semisal menghukum orang orang yang melampaui batas, lagi berbuat aniaya yang tidak ada terapi yang bermanfaat bagi mereka kecuali penjatuhan hukuman (pada diri mereka) inilah makna yang saya maksud."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (ٱلصَّفۡحَ ٱلۡجَمِيلَ) ashshofhal jamiil : berpalinglah dari mereka dengan tidak bersedih, ini terjadi sebelum ada perintah untuk memerangi mereka. Makna ayat: Firman-Nya “Tidaklah Kami menciptakan langit dan bumi kecuali dengan kebenaran.” Kecuali agar Aku diingat dan disyukuri. Oleh karena itu barangsiapa yang tidak mengingat-Ku, bermaksiat kepada-Ku, dan tidak mensyukuri nikmat-Ku, maka Aku akan membinasakannya. Karena Aku tidak menciptakan ciptaan yang agung ini main-main, tanpa tujuan, dan sia-sia. Firman-Nya : “Dan sungguh hari kiamat akan datang.” Benar dan tidak diragukan lagi, dan pada hati itu setiap manusia dibalas sesuai dengan apa yang telah ia kerjakan, maka janganlah sedih dan khawatir atas kaummu, karena balasan bagi mereka pasti datang. Maka bersabar dan maafkanlah mereka, dan ini merupakan makna dari firman-Nya yaitu tidak bersedih terhadap mereka. Pelajaran dari ayat: • Allah tidak menciptakan sesuatupun sia-sia, namun menciptakannya untuk beribadah dengan mengingat dan bersyukur, barangsiapa yang beribadah kepada-Nya, ia akan selamat, dan yang berpaling dari mengingat-Nya serta tidak beribadah kepada-Nya, ia akan tertimpa azab yang menghinakan di dunia dan akhirat atau hanya di akhirat, dan itu lebih keras dan lebih menghinakan. • Penjelasan bahwa memaafkan dengan cara yang baik, adalah dengan tidak menyisakan rasa kesal kepadanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 85: Yakni bukan main-main atau sesuatu yang batil sebagaimana yang disangka oleh musuh-musuh Islam. Lalu masing-masing diberikan balasan sesuai amalnya. Yakni berpalinglah dari mereka tanpa perlu keluh kesah atau maafkanlah tanpa perlu menyakiti, bahkan hendaknya perbuatan buruk orang lain dibalas dengan kebaikan dan kesalahannya dengan dimaafkan agar memperoleh pahala yang besar dari Tuhanmu. Namun tidak selamanya demikian, bahkan perlu adanya hukuman bagi orang-orang yang zalim lagi melampaui batas, jika memang membuahkan hasil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 85",
    "description": "Usai menceritakan kisah beberapa kaum yang durhaka kepada para rasul, melalui ayat ini Allah kembali menegaskan tentang penciptaan langit dan bumi. Allah menyatakan, dan kami tidak menciptakan langit dengan aneka bintang dan planet yang menghiasinya dan tidak pula kami ciptakan bumi dengan aneka makhluk di permukaannya maupun di perutnya, serta apa yang ada di antara keduanya, yakni antara langit dan bumi, baik yang tampak maupun yang tidak tampak, yang diketahui maupun tidak diketahui oleh manusia, melainkan dengan kebenaran. Kami ciptakan itu semua sebagai bukti-bukti kekuasaan kami agar manusia mau beriman. Dan sungguh, kiamat yang menjadi saat ketika semua manusia dimintai pertanggungjawaban atas amalnya, pasti akan datang. Tidak ada keraguan sedikit pun tentangnya. Maka maafkanlah kaummu yang enggan beriman, wahai nabi Muhammad, atas kecaman, gangguan, dan pendustaan mereka kepadamu. Maafkanlah mereka dengan cara yang baik. Sungguh, tuhan yang selalu memeliharamu dan membimbing-Mu, wahai nabi Muhammad, dia-lah tuhan yang maha pencipta. Dia-lah pencipta segala sesuatu di alam raya ini. Dia juga maha mengetahui segala sifat, ciri, dan keadaan makhluk-makhluk ciptaan-Nya."
  }
]