[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya tuhanmu, Dialah DZat yang maha pencipta segala sesuatu lagi mahamengetahuinya, tidak ada sesuatupun yang melemahkanNya, baik yang ada di bumi maupun langit, tidak ada yang samar bagiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Sesungguhnya Rabbmu -wahai Rasul- adalah Maha Pencipta segala sesuatu lagi Maha mengetahui tentang itu semuanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Sesungguhnya Tuhanmu, Dialah Yang Maha Pencipta segala sesuatu lagi Maha Mengetahui atas segala perbuatan makhluk-Nya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Tuhanmu adalah Dzat Yang Maha Pencipta lagi Maha Mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. “sesungguhnya Rabbmu Dialah yang Maha pencipta” yang menciptakan segala mahkluk “lagi maha mengetahui” segala sesuatu. Tidak ada seorangpun yang sanggup menghalangi Allah dari segala yang diliputi oleh ilmuNya, dan berjalan diatas penciptaanNYa. Itu berlaku pada seluruh benda yang ada."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya “Dan sungguh Rabbmu adalah Yang Maha Pencipta dan Maha Mengetahui.” Menciptakan segala sesuatu dan mengetahui tujuan penciptaannya, sekalipun ciptaan-Nya sangat banyak, Dia tetap mengetahui niat, amal, serta keadaan mereka, tidak ada yang tersembunyi dari-Nya dan kelah Dia akan mengembalikan mereka sebagaimana sediakala, menghisab, dan membalas segala perbuatan mereka. Hal ini dapat membantu Rasulullah shalallahu ‘alaihi wa sallam untuk dapat bersabar dan tegar dalam dakwah beliau, hingga datang pertolongan Allah ta’ala pada masa yang telah ditentukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 86",
    "description": "Sungguh, tuhan yang selalu memeliharamu dan membimbing-Mu, wahai nabi Muhammad, dia-lah tuhan yang maha pencipta. Dia-lah pencipta segala sesuatu di alam raya ini. Dia juga maha mengetahui segala sifat, ciri, dan keadaan makhluk-makhluk ciptaan-Nya. Setelah pada ayat-ayat sebelumnya Allah mengisahkan hinaan kaum pendurhaka kepada para rasul Allah dan siksaan yang ditimpakannya kepada mereka, dalam ayat ini Allah menjelaskan anugerah yang diberikan-Nya kepada nabi Muhammad. Allah berfirman, dan sungguh, kami telah memberikan kepadamu, wahai nabi Muhammad, tujuh ayat yang dibaca berulang-ulang dalam salat, yaitu surah al-fa'tihah dan ayat-ayat lain dari Al-Qur'an yang agung."
  }
]