[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh kami telah memberikan kepadamu (wahai nabi), surat pembuka al-qur’an yaitu surat yang berjumlah tujuh ayat yang berulang-ulang(dibaca) di daalm tiap-tiap shalat. Dan kami telah berikan padamu al-qur’an yang agung."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Kami telah memberimu surah Al-Fātiḥah yang terdiri dari tujuh ayat, dan dia adalah Al-Qur`ān yang agung."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Hai Rasulallah, sungguh Kami telah memberimu tujuh ayat yang mulia yang selalu diulang-ulang dalam setiap shalat, yaitu surat al-fatihah; dan Kami menurunkan al-Qur'an kepadamu yang mengandung hukum-hukum yang lurus dan kefasihan yang jelas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَلَقَدْ ءَاتَيْنٰكَ سَبْعًا مِّنَ الْمَثَانِى (Dan sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang) Mayoritas ahli tafsir berpendapat bahwa yang dimaksud dengan tujuh ayat ini adalah surat al-Fatihah. Dan disebut dengan (المثاني) karena surat ini diulang-ulang dalam shalat. Pendapat lain mengatakan yang dimaksud dengan (المثاني) adalah tujuh surat panjang, yakni al-Baqarah, Ali Imran, an-Nisa, al-Maidah, al-An’am, al-A’raf, dan al-Anfal. وَالْقُرْءَانَ الْعَظِيمَ(dan Al Quran yang agung) Yakni al-Qur’an seluruhnya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "87-88 1 ). Sufyan bin 'Uyainah berkata : barangsiapa yang diberikan kepada al-Qur'an, lantas ia meluaskan pandangkan kepada sesuatu dari perkara dunia ini, maka sesungguhnya ia telah merendahkan al-Qur'an; bukankah Allah tela berfirman : { وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي } \"Dan sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang\" dan firman-Nya : { وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ ۚ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ } \"Dan janganlah kamu tujukan kedua matamu kepada apa yang telah Kami berikan kepada golongan-golongan dari mereka, sebagai bunga kehidupan dunia untuk Kami cobai mereka dengannya. Dan karunia Tuhan kamu adalah lebih baik dan lebih kekal\" [ Thaha : 131 ]. Yakni : al-Qur'an. 2 ). Lihatlah bagaimana jika seseorang dikatakan kepadanya bahwa ia lebih mementingkan sesuatu yang hina dibandingkan sesuatu yang mulia? perhatikanlah ayat ini untuk memahami seberapa banyak mereka yang tergolong ke dalam kelompok ini tatkla mereka membelakangi pemberian tuhannya yang juga telah diberikan kepada Rasul-Nya : { وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang pada setiap rakaat yaitu surat Alfatihah, serta Kami turunkan juga kepadamu Al Quran yang agung yang mengandung surat itu. Alquran adalah bentuk umum dari yang khusus, dan bentuk utuh dari bagian-bagian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami benar-benar menganugerahkan kepadamu tujuh ayat yang dibaca berulang-ulang} tujuh ayat yang dibaca berulang setiap rakaat yaitu Al-fatihah {dan Al-Qur’an yang agung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. Allah menyebutkan kenikmatanNYa yang tercurahkan kepada RasulNya, ”dan sesungguhnya kami telah berikan kepadamu tujuh ayat yang dibaca berulang ulang” yang dimaksud tujuh ini menurut pendapat yang shahih adalah tujuh surat yang terpanjang yaitu surat al baqarah, ali Imran, an nisa, al maidah, al an’am, al’araf, al-anfal dan attaubah. Atau maksudnya surat al fatihah, karena berjumlah tujuh ayat. maka, kata penghubung pada “dan al qur’an yang agung” termasuk kategori pengaitan lafazh yang umum (al qur’an) pada kata yang lebih khusus, lantaran di dalam “tujuh ayat yang dibaca berulang ulang” terdapat banyak muatan tauhid, ilmu ilmu ghaib dan huku hukum yang agung serta pengulangan pengulangannya. Sedangkan menurut pendapat yang mengatakan bahwa surat al fatihah itulah sab’ul al matsani , maka maknanya ia berjumlah tujuh ayat yang diulang ulang bacaannya dalam setiap rakaat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (سَبۡعٗا مِّنَ ٱلۡمَثَانِي) sab’am minal matsaanii : yaitu tujuh ayat surat Al-Fatihah. Makna ayat: Firman-Nya : “Dan sungguh Kami telah memberikanmu tujuh ayat yang diulang-ulang, dan Al-Qur’an yang agung.” Kami telah memberikamu surat Al-Fatihah, Ummul Qur’an dan Al-Qur’an yang agung, kebaikan besar yang tidak dapat diukur. Pelajaran dari ayat: • Penjelasan barangsiapa yang diberikan Al-Qur’an maka tidak ada orang lain yang diberikan lebih baik dari itu. • Keutamaan surat Al-Fatihah, karena ia adalah As-Sab’ul Matsaani (tujuh ayat yang diulang-ulang)"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 87: Yang dimaksud tujuh ayat yang dibaca berulang-ulang adalah surat Al-Faatihah yang terdiri dari tujuh ayat. Sebagian ahli tafsir menafsirkan dengan tujuh surah yang panjang, yaitu Al-Baqarah, Ali Imran, Al-Maaidah, An-Nissa', Al 'Araaf, Al An'aam dan Al-Anfaal bersama At Taubah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 87",
    "description": "Setelah pada ayat-ayat sebelumnya Allah mengisahkan hinaan kaum pendurhaka kepada para rasul Allah dan siksaan yang ditimpakannya kepada mereka, dalam ayat ini Allah menjelaskan anugerah yang diberikan-Nya kepada nabi Muhammad. Allah berfirman, dan sungguh, kami telah memberikan kepadamu, wahai nabi Muhammad, tujuh ayat yang dibaca berulang-ulang dalam salat, yaitu surah al-fa'tihah dan ayat-ayat lain dari Al-Qur'an yang agung. Anugerah Allah kepada nabi Muhammad dan kaum mukmin berupa surah al-fa'tihah jauh lebih berharga daripada kenikmatan duniawi yang Allah berikan kepada kaum kafir. Allah mengingatkan nabi Muhammad akan hal tersebut dengan firman-Nya, wahai nabi Muhammad, jangan sekali-kali engkau tujukan pandanganmu sehingga tergiur kepada kenikmatan hidup dan kemewahan duniawi yang fana dan sesaat yang telah kami berikan kepada beberapa golongan di antara mereka, yakni kaum kafir, dan jangan pula engkau bersedih hati terhadap mereka karena keengganan mereka menerima dakwahmu menuju iman. Dan berendah hatilah engkau terhadap orang-orang yang beriman serta jagalah hubungan baikmu dengan mereka."
  }
]