[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-90. Dan janganlah kamu pandang dengan dua matamu dan janganlah kamu berangan-angan mendapatkan kesenangan yang kami berikan kepada beberapa golongan dari orang-orang kafir berupa kesenangan-kesenangan dunia, dan janganlah kamu bersedih hati atas kekafiran mereka. Dan bertawadhulah kepada orang-orang mukmin yang beriman kepada Allah dan RasulNya. Dan katakanlah sesungguhnya aku pemberi peringatan yang menjelaaskan wahyu yang dengannya manusia akan mendapatkan hidayah menuju keimanan keapaa Allah penguasa alam semesta, dan juga memperingatkan kalain dari siksaan yang bisa menimpa kalian, sebagaimana Allah telah menurunkannya pada orang-orang yang telah membagi-bagi al-qur’an denagn beriman kepada sebagiannya dan kafir kepada sebagian yang lain, dari kalanagn yahudi dan nasrani dan orang-orang kafir quraisy."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Jangan terpesona oleh kesenangan-kesenangan sementara yang Kami berikan kepada orang-orang kafir, jangan bersedih karena mereka mendustakanmu dan berendah hatilah kepada orang-orang Mukmin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88- 89. Janganlah kamu melihat dengan pandangan penuh harap kepada orang-orang kafir yang telah kami beri berbagai macam kenikmatan dunia, dan janganlah kamu bersedih atas kekafiran mereka, dan tetaplah berendah hati kepada orang-orang yang beriman kepada risalahmu. Dan katakanlah kepada manusia: “Sesungguhnya aku adalah seorang pemberi peringatan dari azab Allah dan pemberi penjelasan menuju jalan petunjuk.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. لَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِۦٓ أَزْوٰجًا مِّنْهُمْ (Janganlah sekali-kali kamu menunjukkan pandanganmu kepada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan di antara mereka) Yakni janganlah kamu arahkan pandanganmu pada perhiasan dunia karena kecintaan kepadanya. Makna (أزواج) yakni orang-orang kaya dan semisalnya. Dan kecenderungan untuk selalu memandang mereka merupakan tanda bahwa ia menginginkan kenikmatan itu. وَلَا تَحْزَنْ عَلَيْهِمْ (dan janganlah kamu bersedih hati terhadap mereka) Karena mereka tidak beriman dan tetap bersiteguh dalam kekafiran. وَاخْفِضْ جَنَاحَكَ لِلْمُؤْمِنِينَ (dan berendah dirilah kamu terhadap orang-orang yang beriman) Ini merupakan kiasan tentang perintah untuk bersikap rendah hati dan lemah lembut."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "87-88 1 ). Sufyan bin 'Uyainah berkata : barangsiapa yang diberikan kepada al-Qur'an, lantas ia meluaskan pandangkan kepada sesuatu dari perkara dunia ini, maka sesungguhnya ia telah merendahkan al-Qur'an; bukankah Allah tela berfirman : { وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي } \"Dan sesungguhnya Kami telah berikan kepadamu tujuh ayat yang dibaca berulang-ulang\" dan firman-Nya : { وَلَا تَمُدَّنَّ عَيْنَيْكَ إِلَىٰ مَا مَتَّعْنَا بِهِ أَزْوَاجًا مِنْهُمْ زَهْرَةَ الْحَيَاةِ الدُّنْيَا لِنَفْتِنَهُمْ فِيهِ ۚ وَرِزْقُ رَبِّكَ خَيْرٌ وَأَبْقَىٰ } \"Dan janganlah kamu tujukan kedua matamu kepada apa yang telah Kami berikan kepada golongan-golongan dari mereka, sebagai bunga kehidupan dunia untuk Kami cobai mereka dengannya. Dan karunia Tuhan kamu adalah lebih baik dan lebih kekal\" [ Thaha : 131 ]. Yakni : al-Qur'an. 2 ). Lihatlah bagaimana jika seseorang dikatakan kepadanya bahwa ia lebih mementingkan sesuatu yang hina dibandingkan sesuatu yang mulia? perhatikanlah ayat ini untuk memahami seberapa banyak mereka yang tergolong ke dalam kelompok ini tatkla mereka membelakangi pemberian tuhannya yang juga telah diberikan kepada Rasul-Nya : { وَلَقَدْ آتَيْنَاكَ سَبْعًا مِنَ الْمَثَانِي }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Janganlah sekali-kali kamu menunjukkan pandangan senangmu kepada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan orang-orang kafir itu. Dan juga janganlah kamu bersedih hati terhadap mereka karena mereka belum beriman dan berendah diri serta lembutlah kamu terhadap orang-orang yang beriman"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jangan sekali-kali mengarahkan pandanganmu} janganlah membuat pandanganmu tergiur {pada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan di antara mereka} beberapa golongan dari orang-orang kafir {dan janganlah bersedih atas mereka dan berendah hatilah} bersikap lembutlah dan rendah hatilah {terhadap orang-orang mukmin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. jika Allah telah memberikan kepada beliau karunia berupa al qur’an yang agung serta sab’ul matsani, berarti sungguh Allah telah menganugerahkan anugerah paling utama yang mesti dikejar kejar oleh orang orang yang berlomba (dalam kebaikan) dan karunia terbesar yang membuat kaum mukminin riang gembira. “dan katakanlah ‘dengan karunia Allah dan rahmatNya’ hendaklah dengan itu mereka bergembira. Karunia Allah dan rahmatNya lebih baik daripada apa yang mereka kumpulkan” Oleh karena itu berikutnya Allah berfirman “dan janganlah sekali kali kamu menunjukan pandanganmu pada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan dari mereka (orang orang kafir itu)” janganlah engkau terpanah oleh ketakjuban yang mendorongmu menyibukkan diri untuk berfikir tentang godaan syahwat duniawi yang sedang dinikmati oleh kaum hedonism dan menjadikan orang orang bodoh tertipu (dengan mereka). Merasa cukuplah dengan pemberian Allah bagimu, berupa matsani dan al qur’an yang agung. ”dan janganlah kamu bersedih hati terhadap mereka’ karena tidak ada kebaikan yang bisa diharapkan dari mereka dan tiada faidah yang bisa ditunggu tunggu dari mereka. Engkau mendapatkan ganti dari kalangan kaum mukminin yang lebih baik dan lebih utama. ”dan berendah dirilah kamu terhadap orang orang yang beriman” lembutkanlah sikapmu pada mereka dan perbaikilah perilakumu dengan mereka sebagai bentuk kecintaan, pemuliaan, dan kasih sayang."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (أَزۡوَٰجٗا مِّنۡهُمۡ) azwaajam minhum : berbagai golongan orang-orang kafir. (وَٱخۡفِضۡ جَنَاحَكَ) wakhfidh janaahak : “tundukkanlah sayapmu.” Berlemah lembutlah kepada kaum mukminin. Makna ayat: Oleh karena itu “Jangan sekali engkau tujukan pandanganmu” melihat “kepada kenikmatan hidup yang telah Kami berikan kepada beberapa golongan di antara mereka (orang-orang kafir)” sebagian dari pembesar-pembesar Quraisy, apa yang telah Kami berikan kepadamu lebih baik dari pada apa yang mereka miliki berupa harta dan jabatan yang mereka bersenang-senang dengan kelezatan makanan dan minuman. Firman-Nya “dan jangan engkau bersedih hati terhadap mereka.” jika mereka tidak beriman kepadamu dan mengikuti apa yang telah engkau bawa, maka urusan mereka akan kembali kepada Allah, kemudian Allah ta’ala memerintahkan beliau agar kepada sahabatnya yang beriman dengan firman-Nya “dan berendah hatilah engkau kepada orang yang beriman.” Cukuplah bagimu penjagaan dari Allah, maka tinggalkanlah orang-orang yang mendustakan yang memiliki segala kenikmatan hidup dan hiduplah bersama orang-orang yang beriman, berlemah lembut, dan sayangi mereka, karena kebaikan ada pada mereka bukan pada ornag-orang kaya lagi kafir dan durhaka. Pelajaran dari ayat: • Hendaknya para pendakwah tidak menolehkan pandangan mereka kepada apa yang dimiliki oleh orang lain berupa harta dan kekayaan, karena apa yang Allah berikan kepada mereka berupa iman, ilmu, dan takwa lebih baik dari apa yang diberikan kepada mereka berupa harta dan kekayaan. • Dianjurkannya berlemah lembut dan berkasih sayang kepada orang-orang yang beriman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 88: Oleh karena Allah Ta’ala telah memberikan sesuatu yang paling utama kepada Nabi Muhammad shallallahu 'alaihi wa sallam, yaitu Al Qur’an beserta tujuh yang dibaca berulang-ulang, maka dengan karunia Allah dan rahmat-Nya itulah seharusnya manusia bergembira. Karena hal itu lebih baik dari apa yang dikejar manusia pada umumnya berupa harta. Yakni cukupkanlah dengan pemberian Allah kepadamu berupa tujuh yang berulang-ulang dan Al Qur’an yang agung. Karena mereka tidak beriman. Hal itu, karena mereka sudah tidak dapat diharapkan lagi kebaikan dan manfaatnya. Kamu telah memiliki pengganti yang lebih baik dari orang-orang kafir, yaitu orang-orang mukmin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 88",
    "description": "Anugerah Allah kepada nabi Muhammad dan kaum mukmin berupa surah al-fa'tihah jauh lebih berharga daripada kenikmatan duniawi yang Allah berikan kepada kaum kafir. Allah mengingatkan nabi Muhammad akan hal tersebut dengan firman-Nya, wahai nabi Muhammad, jangan sekali-kali engkau tujukan pandanganmu sehingga tergiur kepada kenikmatan hidup dan kemewahan duniawi yang fana dan sesaat yang telah kami berikan kepada beberapa golongan di antara mereka, yakni kaum kafir, dan jangan pula engkau bersedih hati terhadap mereka karena keengganan mereka menerima dakwahmu menuju iman. Dan berendah hatilah engkau terhadap orang-orang yang beriman serta jagalah hubungan baikmu dengan mereka. Dan katakanlah kepada orang kafir, wahai nabi Muhammad, 'sesungguhnya aku adalah pemberi peringatan yang jelas kepada kalian tentang hukuman atas keingkaran kalian."
  }
]