[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Kami telah menurunkan al-qur’an pada nabi Muhammad dan Kamilah yang menjaga dan memeliharanya dari tambahan yang akan dibubuhkan padanya atau dikurangi, maupun akan hilangnya sesuatu darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Hanya Kami semata yang menurunkan Al-Qur`ān ini ke dalam hati Muhammad sebagai peringatan bagi manusia. Sesungguhnya Kami menjaga Al-Qur`ān ini dari penambahan, pengurangan, penggantian dan penyimpangan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Dengan keagungan dan kekuasaan Kami, Kami menurunkan al-Qur’an kepada Nabi, dan Kami akan menjaganya hingga hari kiamat dari segala pengubahan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ (Sesungguhnya Kami-lah yang menurunkan Al Quran) Yakni kitab yang mereka ingkari dan menjadi sebab penuduhanmu sebagai orang gila. وَإِنَّا لَهُۥ لَحٰفِظُونَ (dan sesungguhnya Kami benar-benar memeliharanya) Ini merupakan janji Allah untuk menjaga al-Qur’an dari pengubahan, penggantian, penambahan, pengurangan, dan segala yang tidak layak baginya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Allah telah memfasilitasi ummat ini dengan mengeluarkan para dai untuk menyerukan kepada mereka syari'at ini juga sebagai pewaris para rasul, agar mereka terus bekerja keras mempertahankan agama islam, adapun al-quran al-karim Allah telah menetapkan untuknya penjaga, sehingga jika ditambahkan di dalamnya satu hurufpun akan diketahui. 2 ). Perhatikan bagaimana Allah menjaga kitab-Nya, dan menolong agama-Nya!beberapa waktu yang lalu seorang pendeta di Amerika serikat mengumumkan akan membakar a-qur'an dan menjadi berita yang cukup viral, ia melakukan itu bermaksud agar dunia mengingkari isi yang terkandung di dalamnya, namun tidak disangka pendeta itu membatalkan keinginannya, dari titik inilah jutaan orang akan bertanya : apa sih yang ada dalam mushaf ini? apa yang terkandung di dalamnya? dan kenapa anda membatalkan pembakarannya? sejenak kita mentadabburi : { إِنَّا نَحْنُ نَزَّلْنَا الذِّكْرَ وَإِنَّا لَهُ لَحَافِظُونَ } \"Sesungguhnya Kami-lah yang menurunkan Al Quran, dan sesungguhnya Kami benar-benar memeliharanya\" , di ayat lain Allah berfirman : { يُرِيدُونَ لِيُطْفِئُوا نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَاللَّهُ مُتِمُّ نُورِهِ وَلَوْ كَرِهَ الْكَافِرُونَ } \"Mereka ingin memadamkan cahaya Allah dengan mulut (tipu daya) mereka, tetapi Allah (justru) menyempurnakan cahaya-Nya, walau orang-orang kafir membencinya\" [ As-shaff : 8 ]."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Sesungguhnya Kami lah (Allah) yang menurunkan Al Quran, dan sesungguhnya Kami juga Yang akan benar-benar memeliharanya dari pemalsuan, perubahan, penggantian, penambahan maupun pengurangan. Ini adalah jawaban atas pengingkaran dan olok-olok mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Kamilah yang menurunkan Al-Qur’an} Al-Qur’an {dan sungguh Kami pula yang memeliharanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. jika mereka jujur (dalam omongannya) cukuplah keberadaan al qur’an al azhim sebagai tanda bukti kebenarannya bagi mereka. Oleh karena itu, Allah berfirman di sini, ”sesungguhnya Kamilah yang menurunkan al qur’an” yakni al qur’an yang memuat peringatan bagi segala sesuatu yang berkaitan dengan permasalahan permasalahan dan petunjuk petunjuk yang jelas. Dalam al qur’an ini terdapat peringatan bagi orang yang menginginkan peringatan. ”dan sesungguhnya Kami benar benar melihatnya” yaitu pada waktu diturunkan dan pasca diturunkannya. Dalam masa diturunkannya, kami menjaganya dari pencurian dengar yang dilakukan setan yang terkutuk. pasca diturunkannya, Kami memeliharanya dengan meletakannya di kalbu rasulNya dan menempatkannya di hati hati umatnya. Dia memelihara lafazh lafazhnya dari pengubahan, penambahan atau pengurangan, dan memelihara makna maknanya dari perbahan. Sehingga tidak ada orang yang berkeinginan menyelewengkan maknanya, melainkan Allah pasti mengerahkan orang orang yang akan memaparkan kebenaran yang hakiki. Ini adalah termasuk tanda kebesaran Allah dan anugerah kenikmatan yang paling agung bagi para hambaNya yang beriman. Orang yang menjaganya, niscaya Allah akan memelihara keluarganya dari musuh musuh mereka, dan tidak akan menguasakan musuh yang membinasakan mereka."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ) Innaa nahnu nazzalnadz dzikr : “Sungguh Kami yang telah menurunkan Adz-Dzikr.” Al-Qur’an. Makna ayat: Firman-Nya pada ayat 9: (إِنَّا نَحۡنُ نَزَّلۡنَا ٱلذِّكۡرَ) “Sungguh Kami telah menurunkan Al-Qur’an” yaitu Al-Qur’an (وَإِنَّا لَهُۥ لَحَٰفِظُونَ) “dan Kamilah yang akan menjaganya.” Dari kepunahan, tambahan, dan pengurangan, karena ia adalah hujjah Kami atas para makhluk hingga hari kiamat, Kami menurunkan Adz-Dzikra (Al-Qur’an) sebagai petunjuk, rahmat, obat, dan cahaya, mereka menginginkan azab, sedangkan Allah menginginkan rahmat. Dan Al-Qur’an turun dengan perantara malaikat, dan para malaikat jika turun ia akan naik kembali menuju langit, sehingga tidak tersisa sebagai bukti kerasulan, kecuali Al-Qur’an, namun mereka tidak menginginkan untuk beriman, mereka bukanlah yang pertama kafir dan ingkar, telah lalu umat-umat, kaum, dan kelompok yang diutus kepada mereka Rasul dari kalangan mereka, lalu merekapun mendustakan mereka dan menentangnya. Pelajaran dari ayat: • Penjelasan penjagaan Allah terhadap Al-Qur’anul Karim dari penambahan, pengurangan, dan dari kepunahan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 9: Cukuplah sebenarnya bukti kerasulan Beliau dengan diturunkan Al Qur’anul Karim dan dijaga-Nya dari perubahan, penyelewengan, penambahan dan pengurangan. Baik ketika diturunkan maupun setelah diturunkan. Ketika diturunkan adalah dengan dijauhkan dari setan yang terkutuk dan setelah diturukan adalah dengan disimpan dalam hati Rasul-Nya dan hati sebagian umatnya, demikian juga dengan dijaga lafaznya dari perubahan, penambahan dan pengurangan serta dijaga maknanya dari penyelewengan. Oleh karena itu, tidak ada seorang pun yang hendak menyelewengkannya kecuali Allah mengadakan orang yang menerangkan kebenaran. Ayat ini memberikan jaminan terhadap kesucian dan kemurnian Al Quran selama-lamanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 9",
    "description": "Untuk membuktikan kebenaran pengakuan nabi Muhammad bahwa ayat-ayat yang disampaikannya benar-benar berasal dari Allah, dia berfirman, sesungguhnya kamilah yang menurunkan Al-Qur'an melalui perantara malaikat jibril yang diragukan oleh kaum kafir itu, dan pasti kami pula bersama malaikat jibril dan kaum mukmin yang selalu memelihara keaslian, kesucian, dan kekekalan-Nya hingga akhir zaman. Pendustaan yang dialami oleh nabi Muhammad juga terjadi pada para rasul sebelumnya. Allah menyatakan, dan sungguh, kami telah mengutus beberapa rasul sebelum kami mengutus engkau, wahai nabi Muhammad. Kami telah mengutus mereka kepada umat-umat terdahulu."
  }
]