[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "88-90. Dan janganlah kamu pandang dengan dua matamu dan janganlah kamu berangan-angan mendapatkan kesenangan yang kami berikan kepada beberapa golongan dari orang-orang kafir berupa kesenangan-kesenangan dunia, dan janganlah kamu bersedih hati atas kekafiran mereka. Dan bertawadhulah kepada orang-orang mukmin yang beriman kepada Allah dan RasulNya. Dan katakanlah sesungguhnya aku pemberi peringatan yang menjelaaskan wahyu yang dengannya manusia akan mendapatkan hidayah menuju keimanan keapaa Allah penguasa alam semesta, dan juga memperingatkan kalain dari siksaan yang bisa menimpa kalian, sebagaimana Allah telah menurunkannya pada orang-orang yang telah membagi-bagi al-qur’an denagn beriman kepada sebagiannya dan kafir kepada sebagian yang lain, dari kalanagn yahudi dan nasrani dan orang-orang kafir quraisy."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "90. Aku memperingatkan kalian agar kalian tidak ditimpa oleh apa yang telah Allah turunkan kepada orang-orang yang membagi-bagi kitab-kitab Allah menjadi beberapa bagian. Mereka mengimani sebagiannya dan mengingkari sebagian lainnya.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "90. Hai Rasulallah, Kami telah menurunkan al-Qur'an kepadamu sebagaimana Kami turunkan Taurat dan Injil kepada ahli kitab yang mengimani sebagian kitab mereka dan mengingkari sebagian lainnya, sehingga mereka terbagi menjadi dua golongan. Ibnu Abbas berkata: (كما أنزلنا على المقتسمين) yakni mereka mengimani sebagian isi kitab dan mengingkari sebagian lainnya, dan mereka adalah orang-orang Yahudi dan Nasrani. (Shahih al-bukhari, tafsir surat Al Hijr, ayat, no. 4706)"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "90. كَمَآ أَنزَلْنَا عَلَى الْمُقْتَسِمِينَ (Sebagaimana Kami telah menurunkan (azab) kepada orang-orang yang membagi-bagi (Kitab Allah) Yakni aku memperingatkan kalian dari azab yang diturunkan kepada orang-orang yang membagi-bagi. Terdapat pendapat mengatakan mereka adalah para utusan Walid bin Mughirah pada musim haji yang berjumlah enam belas orang; mereka membagi-bagi diri mereka dan saling berpencar di gang-gang yang ada di kota Makkah, mereka mengatakan kepada orang yang melewati gang tersebut “janganlah kalian tertipu oleh orang yang tersesat dari kaum kami itu, sebab ia adalah orang gila”; terkadang mereka juga mengatakan, sebab ia adalah tukang sihir, penyair, atau dukun. Oleh sebab itu mereka disebut sebagai orang-orang yang membagi-bagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "90. Kami turunkan Alquran sebagaimana Kami turunkan Alkitab kepada kaum Yahudi dan Nasrani yang telah mempersaksikan Alquran dengan haq dan batil. Mereka mengimani satu ayat dan mengingkari ayat yang lain. Kami telah menurunkan azab kepada orang-orang yang membagi-bagi Kitab Allah sebagaimana azab yang Kami turunkan pada perang Badr, Mereka adalah yang membagi Makkah dalam berbagai hari musim agar manusia berpaling dari iman kepada rasul SAW dan yang terlihat bagiku adalah pemandangan ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sebagaimana Kami telah menurunkan (azab) kepada orang yang memilah-milah} orang-orang kafir Quraisy yang memilah-milah Al-Qur’an, mereka menjadikan sebagiannya sebagai syair, sebagian lain sebagai sihir, sebagian lain sebagai ilmu perdukunan dan yang lain sebagai dongeng orang-orang terdahulu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "90. FirmanNya “sebagaimana (kami telah memberi peringatan) maka kami telah menurunkan (azab) kepada orang orang yang membagi bagi (kitab Allah) “maksudnya sebagaimana kami telah menurunkan hukuman kepada orang orang yang membagi bagi (kitab Allah) untuk mengugurkan risalah yang engkau bawa dan berusaha mengganjal orang orang dari jalan Allah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (عَلَى ٱلۡمُقۡتَسِمِينَ) alal muqtasimiin : “kepada orang-orang yang memilah-milah.” Orang-orang yang memilah-milah kitab Allah, mereka berkata, “Ini adalah syair.”, “sihir.”, “mantra.”. Makna ayat: Firman-Nya “Sebagaimana Kami telah menurunkan kepada orang-orang yang memilah-milah. Yaitu orang-orang yang menjadikan Al-Quran terbagi-bagi.” Aku memperingati kalian dengan azab yang telah Allah turunkan kepada al-muqtasimin yaitu orang-orang yang telah membagi-bagi Taurat dan Injil, mereka beriman dengan sebagiannya dan mengingkari sebagian lainnya, merekalah Yahudi dan Nashrani. Al-Muqtasimin adalah orang-orang yang bersumpah, ia akan menjadi orang yang saleh lalu Allah turunkan hukuman kepada mereka. Al-Muqtasimin adalah orang-orang yang menjadikan Al-Qur’an terbagi-bagi, mereka berkata mengenainya (Al-Qur’an): ini adalah syair, sihir, dan mantra. Al-Muqtasimin adalah orang-orang yang membagi-bagi jalan di Mekah dan menjadikannya pos pemantauan untuk menghalangi orang-orang yang datang mencari Islam. Mereka semua adalah muqtasimin, azab dan hukuman Allah pasti akan mengenai mereka. Pelajaran dari ayat: • Tidak adanya pertentangan pada kitab Allah ta’ala sebagaimana yang terjadi pada Ahlul Kitab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 90: Yang dimaksud dengan orang-orang yang membagi-bagi kitab Allah adalah orang-orang yang menerima sebagian isi kitab dan menolak sebahagian yang lain. Ada yang menafsirkan, bahwa mereka adalah orang-orang Yahudi dan Nasrani."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 90",
    "description": "Memperingatkan kaum kafir mekah tentang datangnya azab akibat penolakan mereka terhadap dakwah nabi Muhammad, Allah berfirman, sebagaimana kami telah memberi kamu peringatan, sesungguhnya kami telah menurunkan azab kepada orang yang memilahmilah kitab Allah dan menyifatinya dengan berbagai macam sifat yang batil, yaitu orang-orang yang telah menjadikan Al-Qur'an itu terbagi-bagi ke dalam berbagai macam penamaan, seperti sihir, syair, tenung, atau lainnya, dan dengan berbagai sikap; sebagiannya mereka benarkan dan sebagian yang lain mereka ingkari"
  }
]