[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan mereka itu adalah orang-orang yang menjadikan al-qur’an terbagi bermacam-macam dan dalam beberapa bagian. Sebagian mereka mengatakan, ’sihir’ dan sebagian ada lagi yang mengatakan ‘ini mantera perdukunan’. Dan sebagain yang lain ada yang mengatakan pernyataaan lainnya agar dapat menghalangi manusia dari hidayah dann memalingkannya sesuai dengan keinginan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "91. Orang-orang yang menjadikan Al-Qur`ān terbagi-bagi, mereka berkata, “Ia adalah sihir atau perdukunan atau syair.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "91. Mereka adalah orang-orang yang melanggar hak al-Qur'an karena menjadikannya bagian-bagian yang terpisah; mereka mengimani sebagian isinya dan mengingkari sebagian yang lain tergantung hawa nafsu dan kemaslahatan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "91. الَّذِينَ جَعَلُوا۟ الْقُرْءَانَ عِضِينَ ((yaitu) orang-orang yang telah menjadikan Al Quran itu terbagi-bagi) Yakni bagian yang berbeda-beda, sebagian dianggap syair, sebagian lain dianggap sihir, perdukunan, dan lain sebagainya. Pendapat lain mengatakan makna (عضين) yakni mereka beriman kepada sebagian al-Qur’an dan mengingkari sebagian lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "91. Mereka adalah orang-orang yang telah menjadikan Al Quran itu terbagi-bagi dalam bagian yang terpisah. Mereka membagi dengan yang sesuai dengan Taurat dan Injil, sisanya yang mereka anggap tidak sesuai dengan keduanya. Orang musyrik membagi Alquran dengan bagian syiir, sihir dan sebagainya. Adapun yang benar adalah pendapat kedua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(yaitu) orang-orang yang telah menjadikan Al-Qur’an itu terbagi-bagi} menjadi beberapa bagian yang terpisah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "91. “(yaitu) orang orang yang tlah menjadikan al qur’an itu terbagi bagi” yaitu menjadi berbagai jenis, bagian, potongan potongan, mereka mengotak atiknya sesuai keinginan mereka. Diantara mereka ada yang berkomentar itu adalah sihir. Sebagian mengatakan, ”itu adalah mantra perdukuknan”, sebagian yang lain menilai sebagian perkataan yang dibuat buat dan omongan omongan orang orang kafir yang lain yang mendustakan al qur’an yang menuangkan celaan mereka pada al-qur’an untuk menghalangi manusia dari petunjuk."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (جَعَلُواْ ٱلۡقُرۡءَانَ عِضِينَ) ja’alul qur’aana ‘idhiin : “mereka yang telah menjadikan Al-Qur’an terbagi-bagi.” Merekalah yang memilah-milah Al-Qur’an dan menjadikannya terbagi-bagi, عِضِيْنَ adalah jamak dari عِضَةٌ yaitu bagian dari sesuatu. Makna ayat: Firman-Nya “Sebagaimana Kami telah menurunkan kepada orang-orang yang memilah-milah. Yaitu orang-orang yang menjadikan Al-Quran terbagi-bagi.” Aku memperingati kalian dengan azab yang telah Allah turunkan kepada al-muqtasimin yaitu orang-orang yang telah membagi-bagi Taurat dan Injil, mereka beriman dengan sebagiannya dan mengingkari sebagian lainnya, merekalah Yahudi dan Nashrani. Al-Muqtasimin adalah orang-orang yang bersumpah, ia akan menjadi orang yang saleh lalu Allah turunkan hukuman kepada mereka. Al-Muqtasimin adalah orang-orang yang menjadikan Al-Qur’an terbagi-bagi, mereka berkata mengenainya (Al-Qur’an): ini adalah syair, sihir, dan mantra. Al-Muqtasimin adalah orang-orang yang membagi-bagi jalan di Mekah dan menjadikannya pos pemantauan untuk menghalangi orang-orang yang datang mencari Islam. Mereka semua adalah muqtasimin, azab dan hukuman Allah pasti akan mengenai mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 91: Yakni orang-orang Yahudi dan Nasrani yang membagi-bagi Al Quran, ada bagian yang mereka percayai dan ada pula bagian yang mereka ingkari. Ada pula yang berpendapat, bahwa mereka adalah orang-orang yang ditugaskan di jalan-jalan Mekah untuk menghalangi manusia masuk Islam. Sebagian dari mereka menyebut Al Qur’an sebagai sihir, sebagian lagi sebagai perdukunan, sedangkan sebagian lagi menyebutnya sebagai sya’ir. Kesimpulan ayat 89, 90, dan 91 adalah bahwa Allah Subhaanahu wa Ta'aala menyuruh Nabi Muhammad shallallahu 'alaihi wa sallam memperingatkan orang Yahudi dan Nasrani, bahwa Dia akan menurunkan azab kepada mereka sebagaimana Allah telah membinasakan kaum Tsamud."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 91",
    "description": "Memperingatkan kaum kafir mekah tentang datangnya azab akibat penolakan mereka terhadap dakwah nabi Muhammad, Allah berfirman, sebagaimana kami telah memberi kamu peringatan, sesungguhnya kami telah menurunkan azab kepada orang yang memilahmilah kitab Allah dan menyifatinya dengan berbagai macam sifat yang batil, yaitu orang-orang yang telah menjadikan Al-Qur'an itu terbagi-bagi ke dalam berbagai macam penamaan, seperti sihir, syair, tenung, atau lainnya, dan dengan berbagai sikap; sebagiannya mereka benarkan dan sebagian yang lain mereka ingkari. Atas perbuatan kaum kafir yang demikian, Allah pun bersumpah, maka demi tuhanmu, wahai nabi Muhammad, kami pasti akan menanyai dan meminta pertanggungjawaban kepada mereka semua di akhirat kelak tentang apa yang telah mereka kerjakan dahulu di dunia."
  }
]