[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "92-93. Maka demi tuhanmu kami benar-benar akan memperhitungkan perbuatan-perbuatan mereka pada hari kiamat dan kami benar-benar akan memberikan balasan kepada mereka semua, atas perbuatan mereka membagi-bagi al-qur’an dan kebohongan-kebohongan yang mereka ada-adakan serta menyimpangkan dan merubah-rubahnya, dan tindakan lainnya yang mereka lakukan, seperti penyembahan-penyembahan kepada patung-patung maksiat-maksiat dan dosa-dosa. Di sini terkandung peringatan keras dan larangan bagi mereka dari bertahan di atas perbuatan-perbuatan buruk ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "93. Pasti akan Kami tanyai mereka tentang apa yang mereka lakukan, berupa kekufuran dan kemaksiatan di dunia."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "93. عَمَّا كَانُوا۟ يَعْمَلُونَ (tentang apa yang telah mereka kerjakan dahulu) Yakni amalan-amalan yang mereka kerjakan di dunia. Mereka akan dihisab dan ditanyai tentang hal itu semua."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "92-93. Maka bersumpahlah demi Tuhanmu wahai Nabi, bahwa Kami pasti akan menanyai mereka semua pada hari kiamat atas kemaksiatan mereka dan tentang apa yang telah mereka kerjakan dahulu berupa dusta dan kekafiran. Pertanyaan itu adalah pertanyaan penghinaan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tentang apa yang telah mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "92-93. “maka demi Rabbmu, kami pasti akan menanyai mereka semua” yaitu seluruh orang yang mencercanya, mencelanya, dan mengotak atik serta merubahnya. ”tentang apa yang telah mereka kerjakan dahulu” dalam ayat ini, terdapat ancaman dan celaan keras terhadap mereka dalam menjalankan apa yang mereka kerjakan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna ayat: Firman-Nya : “Maka demi Rabbmu, Kami pasti akan menanyai mereka semua, tentang apa yang telah mereka kerjakan dahulu.” Allah tabaraka wa ta’ala bersumpah untuk Rasul-Nya bahwa Dia benar-benar akan menanyai mereka pada hari kiamat kelak tentang apa yang telah mereka perbuat dahulu serta akan membalas mereka, sehingga janganlah engkau menganggap besar urusan mereka, bersabarlah atas gangguan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 93",
    "description": "Atas perbuatan kaum kafir yang demikian, Allah pun bersumpah, maka demi tuhanmu, wahai nabi Muhammad, kami pasti akan menanyai dan meminta pertanggungjawaban kepada mereka semua di akhirat kelak tentang apa yang telah mereka kerjakan dahulu di dunia. Wahai nabi Muhammad, jangan kaupedulikan sikap dan tindakan kaum kafir itu terhadap Al-Qur'an. Maka sampaikanlah saja kepada mereka secara terang-terangan dan sungguh-sungguh segala apa yang diperintahkan oleh Allah kepadamu dan berpalinglah dari orang yang musyrik. Jangan kauhiraukan gangguan mereka dan teruslah berdakwah menyampaikan pesan-pesan Allah karena dia akan selalu melindungimu."
  }
]