[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka bersikaplah kamu terang-terangan dalam mendakwahkan kebenaran yang Allah memerintahakan kamu denagnnya, dan jangan perdulikan orang-orang musyrik. sesungguhnya Allah telah membersihkan kamu dari apa yang mereka katakan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "94. Maka umumkanlah -wahai Rasul- apa yang Rabbmu perintahkan kepadamu yaitu dakwah kepada-Nya, jangan menoleh kepada perkataan dan perbuatan orang-orang musyrikin."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "94-96. Maka sampaikanlah dakwahmu dengan terang-terangan agar kamu dapat menyampaikan perintah Tuhanmu, dan jangan kamu pedulikan perkataan orang-orang musyrik; karena Kami akan melindungimu dari keburukan musuh-musuhmu dari kalangan orang-orang kafir Quraisy yang selalu menghinamu. Mereka telah membuat sekutu-sekutu yang mereka sembah selain Allah, mereka akan mengetahui akibat dari kesesatan mereka itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "94. فَاصْدَعْ بِمَا تُؤْمَرُ (Maka sampaikanlah olehmu secara terang-terangan segala apa yang diperintahkan (kepadamu)) Yakni tunjukkanlah agamamu dan cerai-beraikan persatuan mereka dengan menyeru mereka kepada tauhid, karena mereka akan tercerai berai setelah kamu menyeru mereka secara terang-terangan, sebagian mereka akan beriman dan sebagian lainnya akan tetap kafir. وَأَعْرِضْ عَنِ الْمُشْرِكِينَ(dan berpalinglah dari orang-orang yang musyrik) Yakni janganlah kamu pedulikan mereka jika mereka mencelamu atas seruan yang kamu sampaikan secara terang-terangan. Diriwayatkan bahwa Rasulullah berdakwah secara sembunyi-sembunyi sampai ketika turun ayat ini beliau dan para sahabatnya mulai berdakwah secara terang-terangan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "94-95 1 ). { إِنَّا كَفَيْنَاكَ الْمُسْتَهْزِئِينَ } Kami memelihara kamu dan apa yang kamu bawakan , ini adalah janji dari Allah untuk Rasul-Nya, bahwasanya ia dilindungi daripada gangguan orang-orang yang memperoloknya, dan Allah juga memelihara Rasul-Nya daripada kekejian mereka, dan sesungguhnya semua itu telah berlaku atas kehendak-Nya; tidaklah seorangpun diantara mereka yang memperolok Rasulullah dan apa yang beliau bawa, melankan ia pasti akan dibinasakan. 2 ). Jika setiap muslim menyampaikan dengan benar perintah tuhannya sesuai dengan aturan yang disyar'atkan, niscaya ia tidak akan terganggu oleh keburukan orang-orang kafir; karena sesungguhnya Allah teah menjamin keselamatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "94. Maka sampaikanlah secara terang-terangan segala apa yang diperintahkan kepadamu dan berpalinglah dari orang-orang yang musyrik. Nabi SAW masih merasa takut untuk berdakwah sampai ayat ini turun, sehingga Nabi dan para sahabat dakwah secara terang-terangan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka sampaikanlah secara terang-terangan} sampaikan dengan terang-terangan {apa yang diperintahkan kepadamu dan berpalinglah dari orang-orang musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "94. kemudian, Allah memerintahkan RasulNya untuk tidak mempedulikan mereka dan selian mereka. Allah memerintahkan untuk menerangkan risalah yang diperintahkan olehNya dan mensosialisasikannya kepada setiap orang, sehingga tidak ada penghalang yang menghadang beliau untuk menyampaikan perintahNya dan tidak ada komentar komentar kaum yang melampaui batas yang menghentikan beliau “dan berpalinglah dari orang orang yang musyrik” maksudnya janganlah engkau memperhatikan mereka. Tinggalkan celaan dan cercaan kepada mereka untuk konsentrasi pada tugasmu."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (فَٱصۡدَعۡ بِمَا تُؤۡمَرُ) fashda’ bimaa tu’mar : sampaikanlah dengan terang-terangan segala apa yang telah diperintahkan Rabbmu. Makna ayat: firman-Nya “Maka sampaikanlah dengan terang-terangan apa yang telah diperintahkan kepadamu” sampaikan dakwah laa ilaaha illallah muhammadur rasulullah dengan terang-terangan dan apa yang diperintahkan kepadamu perkara-perkara yang harus dijelaskan, serta ajakan dan apa yang harus dijauhi. “dan berpalinglah dari orang-orang yang musyrik.” Jangan engkau hiraukan mereka. Pelajaran dari ayat: • Disyariatkanya menjelaskan kebenaran dengan terang-terangan, terutama jika tidak ada penindasan di sana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 94: Kemudian Allah Subhaanahu wa Ta'aala memerintahkan Rasul-Nya shallallahu 'alaihi wa sallam agar tidak mempedulikan orang-orang musyrik dan selainnya yang menentang Beliau, dan agar Beliau menyampaikan perintah Allah secara terang-terangan. Yakni janganlah pedulikan mereka dan jangan pula pedulikan cercaan mereka, dengan tetap menjalankan tugasmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 94",
    "description": "Wahai nabi Muhammad, jangan kaupedulikan sikap dan tindakan kaum kafir itu terhadap Al-Qur'an. Maka sampaikanlah saja kepada mereka secara terang-terangan dan sungguh-sungguh segala apa yang diperintahkan oleh Allah kepadamu dan berpalinglah dari orang yang musyrik. Jangan kauhiraukan gangguan mereka dan teruslah berdakwah menyampaikan pesan-pesan Allah karena dia akan selalu melindungimu. Meskipun kaum kafir berusaha sekuat tenaga mengganggu dan menghalangimu dari menyampaikan dakwah, sesungguhnya kami, yakni Allah, malaikat, dan orang yang dikehendaki-Nya akan selalu memelihara engkau, wahai nabi Muhammad, dari gangguan dan kejahatan orang yang memperolok-olokkan engkau dan risalah yang kausampaikan."
  }
]