[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "95-96. Sesungguhnya Kami telah memelihara kamu dari orang-orang yang mengolok-ngolok lagi menertawakanmu, dari para pembesar suku quraisy yang mengadakan sekutu bersama Allah dari patung-patung dan lainnya. Maka mereka akan mengetahui kesudahan nasib mereka di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "95. Jangan takut kepada mereka, karena Kami telah menjagamu dari orang-orang yang menghinamu dari para tokoh kaum kafir Quraisy."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "95. إِنَّا كَفَيْنٰكَ الْمُسْتَهْزِءِينَ (Sesungguhnya Kami melindungi kamu daripada (kejahatan) orang-orang yang memperolok-olok) Meski mereka adalah para pembesar orang-orang kafir, dan memiliki kekuasaan diantara mereka. Orang-orang yang menghina Rasulullah ini adalah para pemimpin penduduk Makkah yang berjumlah lima orang, yaitu Walid bin Mughirah, ‘Ash bin Wa’il, Aswad bin Mutthalib, Aswad bin Abdul Yaghuts, dan Harits bin Thalathilah. Allah membinasakan mereka semuanya dan menghentikan keburukan mereka dalam waktu singkat."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "94-95 1 ). { إِنَّا كَفَيْنَاكَ الْمُسْتَهْزِئِينَ } Kami memelihara kamu dan apa yang kamu bawakan , ini adalah janji dari Allah untuk Rasul-Nya, bahwasanya ia dilindungi daripada gangguan orang-orang yang memperoloknya, dan Allah juga memelihara Rasul-Nya daripada kekejian mereka, dan sesungguhnya semua itu telah berlaku atas kehendak-Nya; tidaklah seorangpun diantara mereka yang memperolok Rasulullah dan apa yang beliau bawa, melankan ia pasti akan dibinasakan. 2 ). Jika setiap muslim menyampaikan dengan benar perintah tuhannya sesuai dengan aturan yang disyar'atkan, niscaya ia tidak akan terganggu oleh keburukan orang-orang kafir; karena sesungguhnya Allah teah menjamin keselamatan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "95. Sesungguhnya Kami memelihara kamu dari kejahatan orang-orang yang memperolok-olokmu dari golongan musyrik Makkah, yaitu lima pembesar Makkah: Walid bin Mughirah, Ash bin Wail, Al Aswad bin Muthallib, Al Aswad bin Abdi Yaghuts, dan Harist bin Thalathalah. Allah telah membinasakan mereka semua dalam hari yang sama"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya cukuplah Kami yang memeliharamu dari orang yang memperolok-olokkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "95. “sesungguhnya kami memelihara kamu dari (kejahatan) orang orang yang memperolok olokan” terhadapmu dan risalah yang engkau bawa. Ini menjadi janji dari Allah bagi rasulNya, bahwa kaum yang mencemooh beliau tidak akan membahayakan beliau, dan cukuplah Allah yang akan menangani mereka untukmu dengan cara hukuman yang Dia kehendaki. Sungguh Allah telah melakukannya, karena tidak ada seorangpun yang menampakan penghinaan kepada diri Rasulullah dan risalah yang beliau bawa melainkan pasti Allah membinasakannya dan menghabisinya dengan cara yang mengerikan."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Firman-Nya “Sesungguhnya Kami menjaga engkau dari orang-orang yang memperolok-olok. Yaitu orang yang menganggap adanya tuhan selain Allah, kelak mereka akan mengetahuinya.” Yang dimaksud orang-orang di atas yang Allah akan jaga Rasul-Nya dari gangguan mereka adalah: Al-Walid bin Al-Mughirah, Al-‘Ash bin Wail, ‘Ady bin Qais, dan Al-Aswah bin Abdul Yaghuts, mereka semua binasa dengan cara yang berbeda-beda dalam waktu yang relatif dekat, laknat Allah ta’ala atas mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 95: Ayat ini sama seperti firman Alah Ta’ala, “Wahai Rasul, sampaikanlah apa yang diturunkan kepadamu dari Tuhanmu. Dan jika tidak kamu kerjakan (apa yang diperintahkan itu, berarti) kamu tidak menyampaikan amanat-Nya. Allah memelihara kamu dari (gangguan) manusia. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang kafir.” (Terj. Al Maa’idah: 67) Allah Subhaanahu wa Ta'aala telah melakukannya. Oleh karena itu, tidak ada seorang pun yang mengolok-olok Beliau dan apa yang Beliau bawa, kecuali Allah Ta’ala membinasakannya dengan cara yang dahsyat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 95",
    "description": "Meskipun kaum kafir berusaha sekuat tenaga mengganggu dan menghalangimu dari menyampaikan dakwah, sesungguhnya kami, yakni Allah, malaikat, dan orang yang dikehendaki-Nya akan selalu memelihara engkau, wahai nabi Muhammad, dari gangguan dan kejahatan orang yang memperolok-olokkan engkau dan risalah yang kausampaikan. Mereka yang memperolok-olokkanmu tidak lain hanyalah orang yang menganggap adanya tuhan selain Allah. Anggapan mereka ini merupakan kesalahan besar. Karena itu, mereka kelak akan mengetahui akibat yang sangat pedih dari kedurhakaan dan kesyirikan mereka."
  }
]