[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "95-96. Sesungguhnya Kami telah memelihara kamu dari orang-orang yang mengolok-ngolok lagi menertawakanmu, dari para pembesar suku quraisy yang mengadakan sekutu bersama Allah dari patung-patung dan lainnya. Maka mereka akan mengetahui kesudahan nasib mereka di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "96. Orang-orang yang mengangkat sesembahan tandingan bersama Allah, mereka akan mengetahui akibat buruk dari kesyirikan mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "96. الَّذِينَ يَجْعَلُونَ مَعَ اللهِ إِلٰهًا ءَاخَرَ ۚ ((Yaitu) orang-orang yang menganggap adanya tuhan yang lain di samping Allah) Yakni dosa mereka tidak hanya karena mengolok-olok Rasulullah, namun mereka juga memiliki dosa lain yaitu menyekutukan Allah. فَسَوْفَ يَعْلَمُونَ(maka mereka kelak akan mengetahui) Mengetahui bagaimana kesudahan mereka di akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "96. Mereka pengolok-olok adalah orang-orang yang menganggap adanya tuhan yang lain selain Allah; maka mereka kelak akan mengetahui akibat-akibatnya baik di dunia maupun di akhirat. Ayat ini turun untuk para pengolok Nabi yang bermain mata atas olokan itu, ini adalah janji untuk mereka untuk balasan di akhirat atas olok-olok dan kesyirikan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang menjadikan tuhan lain bersama Allah. Mereka kelak akan mengetahui (akibatnya)"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "96. Kemudian Allah menceritakan karakteristik mereka, bahwa sebagaimana mereka itu melancarkan gangguan kepada engkau wahai Rasulullah, maka mereka itu juga menyakiti Allah ”yaitu orang orang yang menganggap adanya ilah yang lain disamping Allah” padahal Dialah Rabb mereka, pencipta mereka dan pengatur mereka. ”maka mereka kelak akan mengetahui” akibat akibat ulah mereka saat berada di hari kiamat."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Firman-Nya “Sesungguhnya Kami menjaga engkau dari orang-orang yang memperolok-olok. Yaitu orang yang menganggap adanya tuhan selain Allah, kelak mereka akan mengetahuinya.” Yang dimaksud orang-orang di atas yang Allah akan jaga Rasul-Nya dari gangguan mereka adalah: Al-Walid bin Al-Mughirah, Al-‘Ash bin Wail, ‘Ady bin Qais, dan Al-Aswah bin Abdul Yaghuts, mereka semua binasa dengan cara yang berbeda-beda dalam waktu yang relatif dekat, laknat Allah ta’ala atas mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 96",
    "description": "Mereka yang memperolok-olokkanmu tidak lain hanyalah orang yang menganggap adanya tuhan selain Allah. Anggapan mereka ini merupakan kesalahan besar. Karena itu, mereka kelak akan mengetahui akibat yang sangat pedih dari kedurhakaan dan kesyirikan mereka. Kembali mengingatkan nabi Muhammad, Allah berfirman, dan sungguh, kami mengetahui bahwa engkau memiliki budi pekerti luhur dan toleransi yang tinggi dalam menghadapi gangguan mereka, tetapi engkau merasa sedih sehingga dadamu menjadi sempit disebabkan apa yang mereka ucapkan kepadamu berupa pendustaan, hinaan, dan olokolok mereka."
  }
]