[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan teruslah kamu berada dalam peribadaahan kepada tuhanmu sepanjang hidupmu hingga keyakinan datang kepadamu, yaitu kematian. Dan rasulullah melaksanakan perintah tuhannya ini, beliau terus kontinu dalam beribadah kepada Allah hingga keyakinan datang dari tuhannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "99. Teruslah beribadah kepada Rabbmu, istikamahlah di atas ibadah itu selama engkau hidup sampai kematian menjemputmu sementara engkau senantiasa demikian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "99. حَتَّىٰ يَأْتِيَكَ الْيَقِينُ (dan sembahlah Tuhanmu sampai datang kepadamu kematian) Yakni sembahlah Tuhanmu selalu selama kamu masih hidup."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "97-99 1 ). { وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ } Jangan menyangka bahwa ada hati yang tidak bisa dirusak ketenangannya oleh perkataan orang lain. 2 ). Hatimu terkadang terasa sempit tatkala kamu mendengarkan sesuatu yang menyakitmu, dan terkadang kamu sedih karenanya, bahkan kamu juga kerap dituduh dengan perkara yang tidak sama sekali kamu lakukan, oleh karena itu kamu membutuhnya sesuatu yang berbelas kasih kepada hatimu, dan menjauhkan segala hal yang menghawatirkanmu, lalu kamu mentadabburi ayat-ayat akhir dari surah al-Hijr : { وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ , فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُنْ مِنَ السَّاجِدِينَ } \"Dan Kami sungguh-sungguh mengetahui, bahwa dadamu menjadi sempit disebabkan apa yang mereka ucapkan , Maka bertasbihlah dengan memuji Tuhanmu dan jadilah kamu di antara orang-orang yang bersujud (shalat)\" maka kamu telah menemukan penawar yang menyembuhkanmu, begitu agungnya al-Qur'an ini. 3 ). Nabi -صلى الله عليه وسلم- diburukkan oleh dustaan kaumnya padahal mereka mengetahui kebenaranya dan jelasnya dalil-dalil beliau, maka Allah memberi petunjukinya kepada sesuatu yang dapat menolak kerisauan hatinya, Allah memulai dari perintah yang bersifat khusus, kemudian perintah yang bersifat lebih umum, yaitu : perintah khusus untuk berdzikir kepada Allah, kemudian perintah yang lebih umum yaitu shalat, kemudia perintah ibadah dengan sifatnya keseluruhan, sungguh petunjuk yang agung jika saja kita mentadabburnya. 4 ). Semakin bertambah kedekatan seorang hamba kepada Allah dan semakin meningkat kedudukannya; niscaya keteguhan hatinya dan kejujurannya akan semakin kuat, karena orang jujur tidak akan terputus permintaannya dan tidak ada rasa futur dalam mencapai keinginannya, bahkan keinginannya akan lebih sempurnya pencapaiannya, Allah ta'ala berfirman : { وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ }. 5 ). Seorang mutadabbir mengatakan setelah ia mempelajari firman Allah : { وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ } ia mengatakan : segala puji bagi Allah yang tidak memutuskan kepada kami karunianya untuk terus beribadah dan taqarrub kepada-Nya dengan memperbanyak amalan shalih di musim-musim kebaikan, bahkan lebih dari itu Allah menjadikan kedudukan Ibadah kepada-Nya terus tegak sampai kematian tiba : sedekah jariyah, ilmu yang bermanfaat, dan seorang anak yang mendoakan untuk orangtuanya. 6 ). { وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ } Tidaklah pantas bagi seorang muslim yang telah merasakan manisnya ketaatan kepada Allah pada satu bulan penuh di bulan ramadhan, kemudian ia menukarnya dengan kepahitan maksiat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "99. Serta sembahlah Tuhanmu sampai kematian datang kepadamu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan sembahlah Tuhanmu sampai datang kepadamu kepastian} kematian yang diyakini"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "99. “dan sembahlah Rabbmu sampai datang kepadamu al yaqin” yaitu sampai ajal tiba. maksudnya, kontinyulah engkau untuk mendekatkan diri kepada Allah dengan segala macam ibadah disetiap waktu. maka beliau menaati perintah Rabbnya dan senantiasa membiasakan beribadah sampai datang al yaqin (ajal) dari Rabbnya. Semoga salam selalu tercurahkan kepada beliau dengan melimpah."
  },
  {
    "title": "Aisarut Tafasir / Syaikh Abu Bakar Jabir al-Jazairi, mudarris tafsir di Masjid Nabawi",
    "description": "Makna kata: (حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ) hatta ya’tiyakal yaqiin : “hingga al-yaqiin datang kepadamu.” Yaitu kematian, beribadahlah kepada Rabbmu hingga engkau wafat. Makna ayat: firman-Nya : “dan sembahlah Rabbmu sampai yakin (ajal) datang kepadamu.” Lanjutkanlah ibadah dan ketaatan, yaitu merendahkan diri dan tunduk kepada Allah ta’ala hingga datangnya al-yaqin yaitu kematian, karena kubur adalah fase pertama dari alam akhirat, dengan wafatnya seseorang dan memasuki alam akhirat, maka imannya akan menjadi iman yang sebenarnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Hijr ayat 99: Yakni tetaplah mendekatkan diri kepada Allah Ta’ala dengan melakukan berbagai ibadah di setiap waktu sampai maut datang kepadamu. Maka Nabi shallallahu 'alaihi wa sallam melakukannya, Beliau senantiasa beribadah sampai ajal menjemput –semoga Allah melimpahkan shalawat dan salam kepadanya-."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Hijr Ayat 99",
    "description": "Dan bersama dengan itu sembahlah tuhanmu yang telah menciptakan dan menghidupkanmu, dan serahkanlah dirimu sepenuhnya kepadanya sampai yakin, yaitu ajal, datang kepadamu. Dengan melakukan hal itu maka beban perasaan yang kaupikul akibat ucapan, sikap, dan tingkah laku kaum kafir akan terasa ringan dan jiwamu pun akan merasa tenteram. Allah menegaskan bahwa ketetapan Allah, yaitu hari kiamat dan masa ketika para pendurhaka akan menerima azab, pasti datang, maka janganlah kamu, wahai para pendurhaka, meminta agar dipercepat kedatangan-Nya. Mahasuci Allah dari segala aib, kesyirikan, dan kekurangan, dan mahatinggi dia dari apa yang mereka sembah, berupa berhala atau apa pun juga yang mereka persekutukan dengan dia."
  }
]