[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "1-2. Terlihat perubahan dan rona masam Rasulullah sholallohu alaihi wasallam dan dia berpaling. Nabi berpaling karena seorang laki-laki buta (yaitu Abdullah bin ummi maktum) datang meminta bimbingan. Saat itu Rasulullah ssolallohu alaihi wasallam sedang sibuk mendakwahi para pembesar quraisy kepada islam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Rasulullah -ṣallallāhu 'alaihi wa sallam- mengerutkan wajahnya dan beliau berpaling."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1-2. Allah memberi tuntunan kepada orang-orang beriman untuk mempedulikan orang-orang lemah dengan menegur Nabi Muhammad ketika datang kepadanya seorang sahabat yang buta bernama Abdullah bin Ummi Maktum sebelum dia beriman, dia berkata: “Wahai Rasulullah, berilah aku petunjuk.” Namun ketika itu Rasulullah sedang sibuk berdakwah kepada para pemimpin kaum Quraisy; sehingga Rasulullah menampakkan wajah masam dan berpaling dari Abdullah bin Ummi Maktum."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. عَبَسَ وَتَوَلَّىٰٓ (Dia (Muhammad) bermuka masam dan berpaling) Yakni Rasulullah menekuk wajahnya dan berpaling."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "1. Wajah Nabi SAW masam sebab sulitnya atau kerepotan menyampaikan ajakan iman kepada para pembesar kaumnya. Diriwayatkan dari Tirmidzi dan Hakim dari ‘Aisyah radliyallahu ‘anha, beliau berkata: Allah menurunkan ayat Abasa wa tawalla, Muhammad berwajah masam dan berpaling terhadap Ibnu Ummi Maktum yang buta. Rasul datang, kemudian dia bertanya kepada Rasul: “Wahai Rasulullah, beri aku petunjuk.” Bertepatan saat itu Rasul tengah memberi arahan pembesar kaum musyrik yang menyebabkan Rasul menolaknya, namun di sisi lain menerima/memberi petunjuk kepada yang lain. Ibnu Ummi Maktum lantas berkata kepada Nabi SAW: “Apakah menurutmu apa yang aku katakan tadi suatu kejelekan?”, Nabi SAW menjawab: “Tidak.” Maka turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berwajah masam} Rasulullah SAW mengerutkan wajahnya {dan berpaling} berpaling"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-10 Sebab turunnya ayat-ayat mulia ini adalah seorang mukmin buta datang seraya bertanya kepada Nabi dan belajar dari beliau, kemudian ada orang kaya juga datang. Nabi amat ingin menunjukkan manusia, hanya saja beliau lebih condong pada orang kaya dan berpaling dari si buta lagi miskin demi mengharap agar si kaya mendapat petunjuk dan demi agar si kaya menyucikan hatinya. Lalu Allah menegurnya dengan tegurann lembut ini seraya berfirman; “dia (Muhammad) bermuka masam” di wajah beliau, “dan berpaling” dengan raganya karena orang buta mendatanginya. Kemudian Allah menyebutkan manfaat menyambutnya seraya berfirman, “Tahukah kamu barangkali ia,” yakni orang buta tersebut, “ingin membersihkan dirinya (dari dosa),” yaitu membersihkan diri dari akhlak tercela dan ingin berakhlak terpuji, “atau dia (ingin) mendapatkan pengajaran lalu pengajaran itu memberi manfaat kepadanya,” yakni, mendapatkan pengajaran tentang sesuatu sehingga ia mendapatkan manfaat dari pelajaran itu. Ini adalah manfaat besar dan itulah maksud diutusnya para rasul, maksud dari petuah orang yang memberi nasihat dan maksud dari peringatan orang yang memberi peringatan. Sambutanmu pada orang orang yang datang sendiri seraya memerlukanmu itu lebih layak dan wajib, sedangkan berpalingnya engkau pada orang kaya yang tidak memerlukanmu yang tidak mau bertanya dan meminta fatwa karena tidak memiliki keinginan pada kebaikan dan engkau tinggalkan orang lebih utama itu tidak layak bagimu. Tugasmu hanyalah memberi pengajaran, bila pun ia tidak mau mengambil pelajaran dengan membersihkan diri, engkau tidak akan dimintai pertanggung jawab atas perbuatan buruk yang ia lakukan. Hal ini menunjukan pada kaidah masyhur; sesuatu yang telah diketahui tidak ditinggalkan untuk sesuatu yang belum jelas. Dan menyambut murid yang memerlukan dan penuh kemauan lebiih layak dari yang lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Surah yang agung ini terkandung didalamnya pelajaran-pelajaran dan nasehat-nasehat, dan juga beberapa ayat yang merupakan peringatan dan larangan-larangan bagi mereka yang menginginkan kebaikan. Yang pertama : Allah memulia surah ini dengan peringatan-Nya kepada kepada Nabi-Nya, yaitu ketika Nabi Muhammad ﷺ dalam sebuah majlis bersama para pemuka-pemuka quraisy, mereka sedang berbincang dengan Nabi ﷺ, yang ketika itu Nabi ﷺ berkeinginan mengajak mereka untuk memeluk islam, ketika perbincangan mereka tengah berlangsung, datanglah seorang buta yaitu Abdullah bin Ummi maktum dan juga termasuk dari ( Assabiqun al.awwalun ) untuk menghadap Rasulullah ﷺ , dia menghadap Rasulullah untuk menanyakan tentang suatu perkara dalam agamanya, dan agar bertambah keilmuannya tentang islam, dia datang dengan senang hati untuk menuntut ilmu kepada Rasulullah ﷺ , akan tetapi Rasulullah ﷺ kurang senang dengan kedatangan Abdullah dikarenakan beliau sedang melakukan pertemuan dengan para Pemuka Quraisy itu dengan harapan mereka bisa memeluk agama islam, dan Abdullah bin Ummi maktum bisa bertemu Rasulullah ﷺ dilain waktu . Oleh karena kejadian diatas, Allah berfirman : { عَبَسَ وَتَوَلَّىٰ } Rasulullah bermuka masam dan diapun berpaling, Yakni : Rasulullah menampakkan wajah masamnya atas kejengkelannya dengan kedatangan Abdullah bin Ummi maktum pada kesempatan itu , dan Rasulullah pun berpaling dari Abdullah dan kembali meneruskan perbinangannya dengan para pemuka quraisy tadi . Allah menegur Rasul-Nya atas sikapnya yang bemuka masam dan berpaling dari Abdullah bin Ummi maktum."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "عَبَسَ وَتَوَلَّى \" Dia (Muhammad) bermuka masam dan berpaling\" Ini tertuju kepada Rasulullah shallallahu ‘alaihi wa sallam. Makna عَبَسَ : tampak masam pada wajahnya, menolak sesuatu dengan raut wajah, sedangkan makna تَوَلَّى maknanya: Berpaling"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 1: 1-4. Pada awal-awal surat ini (ditujukan) sebagai petunjuk untuk Nabi dalam bergaul dengan orang-orang yang lemah dari kalangan kaum muslimin. Allah menjelaskan bahwa pada wajah Rasul nampak perubahan dan bermuka masam ketika telah datang padanya seorang yang buta bernama Abdullah bin Ummi Maktum yang menanyakan kepadanya berkenaan dengan urusan agama; Maka Rasul berpaling darinya karena Abdullah Ummi Maktum memotong ucapan Rasul ketika beliau sibuk berdakwah kepada pembesar-pembasar Quraisy yang keras kepala semisal : Utbah, Syaibah, Abu Jahl, dan Walid bin Mughirah yang Rasul mendambakan keislaman pada mereka. Kemudian Allah tegur Nabi dengan berkata : Tidaklah engkau (wahai Nabi) mengetahui dirinya dan dikabarkan berkenaan dengan keadaan orang yang buta ini, maka semoga ia dengan bertanya kepadamu aka menjadikan dirinya suci dari dosa-dosanya. Atau memberikan manfaat dengan apa yang ia dengar darimu kemudian ia berpikir dan menerangi hatinya dengan cahaya keimanan. Adapun pembesar-pembesar itu yang justru wajahnya berpaling, pura-pura buta dengan apa yang engkau dakwahkan, maka sungguh engkau telah menyampaikan dakwah kepada mereka dan tidak ada kewajiban bagimu kecuali hanya menyampaikan, dan sungguh telah engkau kerjakan. Dan Allah catat dengan firman-Nya : “Abasa wa Tawallaa”. Dan Allah tidak mengatakan : Engkau Muhammad bermuka masam dan telah berpaling, yang seolah-olah berbicara dengan seseorang yang lain (selain nabi). Karena maksud Allah hanyalah mengingatkan dan memberi petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tirmidzi meriwayatkan dengan sanadnya yang sampai kepada ‘Aisyah radhiyallahu 'anha ia berkata, “Turun ayat ‘Abasa wa tawalla berkenaan dengan Ibnu Ummi Maktum seorang yang buta, ia datang kepada Rasulullah shallallahu 'alaihi wa sallam dengan berkata, “Wahai Rasulullah, bimbinglah aku.” Ketika itu di dekat Rasulullah shallallahu 'alaihi wa sallam ada salah seorang pembesar kaum musyrikin, maka Rasulullah shallallahu 'alaihi wa sallam berpaling darinya dan menghadap kepada yang lain (orang musyrik) sambil berkata, “Apakah menurutmu apa yang aku ucapkan salah?” Orang itu menjawab, “Tidak.” Karena inilah (ayat tersebut) turun.” (Hadits ini dishahihkan oleh Syaikh Al Albani dalam Shahih At Tirmidzi (3331) dan Syaikh Muqbil dalam Ash Shahiihul Musnad Min Asbaabin Nuzuul hal. 264-265)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 1",
    "description": "Jika bagian akhir surah an-n'zi''t menjelaskan tugas nabi sebagai pemberi peringatan tentang hari kiamat, maka pada permulaan surah 'abasa Allah menyebutkan siapa yang akan mendapatkan manfaat dari peringatan tersebut. Disebutkan bahwa seorang pria buta bernama 'abdull'h bin ummi makt'm, anak paman khad'jah, menghadap nabi untuk meminta petunjuk. Ketika itu nabi tengah berdakwah kepada para pemuka quraisy. Nabi kurang berkenan dengan kedatangannya. Muka nabi menjadi masam. Atas perilaku tersebut Allah menegurnya dengan halus. Teguran ini menunjukkan bahwa Al-Qur'an bukanlah perkataan nabi melainkan kal'mullah. Dengan teguran itu Allah menghendaki agar nabi Muhammad melakukan hal yang lebih utama, yaitu memperhatikan orang yang sungguh-sungguh mencari kebenaran dan berpegang teguh dengan islam. Dia, nabi Muhammad, berwajah masam karena kedatangan ibnu ummi makt'm, dan berpaling darinya untuk melanjutkan pembicaraan dengan pemuka quraisy. 2. Nabi kurang berkenan sehingga bermuka masam karena seorang buta telah datang kepadanya, yaitu 'abdull'h bin ummi makt'm. Allah menegur nabi karena lebih mementingkan bertemu dengan pemuka quraisy untuk mengajak mereka masuk islam. Dalam pandangan Allah, semestinya nabi lebih mementingkan siapa pun yang betul-betul ingin mengamalkan ajaran islam, tidak peduli ia dari kalangan fakir miskin bahkan cacat. 'abdull'h terus memanggil-manggil nabi, sedang dia karena kebutaannya tidak tahu bahwa beliau sedang bersama para pemuka quraisy (lihat: surah al-an''m/6: 52; al-kahf/18: 28)."
  }
]