[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-16. Orang yang sangat berharap bertemu denganmu, Dia takut kepada Allah karena tidak berusaha maksimal untuk mendapatkan bimbingan, Kamu justru mengabaikannya. Perkaranya tidak sebagaimana yang kamu perbuat (wahai rasul). Sesungguhnya surat ini yang mengandung hidayah yang merupakan nasihat bagimu dan bagi siapapun yang menginginkan nasihat. Barangsiapa berkehendak, dia mengingat Allah dan mengikuti wahyu NYA, Yaitu al-qur’an yang tercantum lembaran lembaran yang di agungkan dan di hormati, Kedudukannya tinggi, disucikannya dari noda keburukan,penambahan dan pengurangan, Ditangan para malaikat para penulis, para delegasi antara Allah dengan makhluk NYA, Yang mulia akhlaknya, akhlak-akhlak dan perbuatan-perbuatan mereka baik dan suci."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Justru engkau mengabaikannya karena sibuk dengan pembesar-pembesar kaum musyrik."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. فَأَنتَ عَنْهُ تَلَهَّىٰ( maka kamu mengabaikannya) Yakni kamu melalaikan dan mengabaikannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9-10. Dia yang seraya takut atas siksa Allah, dia juga buta, justru engkau abaikan dan engkau berpaling"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan kamu mengabaikannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-10 Sebab turunnya ayat-ayat mulia ini adalah seorang mukmin buta datang seraya bertanya kepada Nabi dan belajar dari beliau, kemudian ada orang kaya juga datang. Nabi amat ingin menunjukkan manusia, hanya saja beliau lebih condong pada orang kaya dan berpaling dari si buta lagi miskin demi mengharap agar si kaya mendapat petunjuk dan demi agar si kaya menyucikan hatinya. Lalu Allah menegurnya dengan tegurann lembut ini seraya berfirman; “dia (Muhammad) bermuka masam” di wajah beliau, “dan berpaling” dengan raganya karena orang buta mendatanginya. Kemudian Allah menyebutkan manfaat menyambutnya seraya berfirman, “Tahukah kamu barangkali ia,” yakni orang buta tersebut, “ingin membersihkan dirinya (dari dosa),” yaitu membersihkan diri dari akhlak tercela dan ingin berakhlak terpuji, “atau dia (ingin) mendapatkan pengajaran lalu pengajaran itu memberi manfaat kepadanya,” yakni, mendapatkan pengajaran tentang sesuatu sehingga ia mendapatkan manfaat dari pelajaran itu. Ini adalah manfaat besar dan itulah maksud diutusnya para rasul, maksud dari petuah orang yang memberi nasihat dan maksud dari peringatan orang yang memberi peringatan. Sambutanmu pada orang orang yang datang sendiri seraya memerlukanmu itu lebih layak dan wajib, sedangkan berpalingnya engkau pada orang kaya yang tidak memerlukanmu yang tidak mau bertanya dan meminta fatwa karena tidak memiliki keinginan pada kebaikan dan engkau tinggalkan orang lebih utama itu tidak layak bagimu. Tugasmu hanyalah memberi pengajaran, bila pun ia tidak mau mengambil pelajaran dengan membersihkan diri, engkau tidak akan dimintai pertanggung jawab atas perbuatan buruk yang ia lakukan. Hal ini menunjukan pada kaidah masyhur; sesuatu yang telah diketahui tidak ditinggalkan untuk sesuatu yang belum jelas. Dan menyambut murid yang memerlukan dan penuh kemauan lebiih layak dari yang lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan kamu ( Muhammad ) mengabaikan dia yang datang kepadamu dengan sifat baik yang ada pada dirinya untuk kebaikan, inilah teguran dari Allah kepada Nabi-Nya, dan dari ayat –ayat ini adalah merupakan dalil akan pentingnya kita peduli kepada sesama muslim, dan pentingnya memberikan pengajaran kepada saudara-saudara kita para muslimin , adapun dengan dakwah kepada para kuffar maka cukuplah dengan menyamaikan kepada mereka tentang islam yang benar , jika mereka menerima dakwah itu maka kesukuran bagi kita, dan jika mereka menolaknya maka itu kembali kepada Allah yang lebih tau tentang keadaan mereka . Sebagai pendakwah islam kepada para kaum kafir tugas kita hanyalah meyampaikan apa yang pantas bagi mereka , dan bukan menjadi kewajiban bagi kita untuk mengajari mereka hukum – hukum syariat Yang menjadi kewajiban kita adalah mendidik para kamu muslimin, juga mereka yang menginginkan pengetahuan , pada ayat-ayat diatas adalah kisah yang agung mengajari kita akan pentingnya kepedulian kepada sesama muslim dan menjadi kepentingan bagi sesama muslim adalah menanamkan keimanan pada diri mereka , dan menebarkan ilmu islam kepada mereka , dan itu lebih utama daripada membuntuti kaum kuffar atau lebih banyak berpihak kepada mereka , akan tetapi mereka tidak menginginkan hal itu ; dan itu termasuk meletakkan sesuatu bukan pada tempatnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَأَمَّا مَنْ جَاءَكَ يَسْعَى (8) وَهُوَ يَخْشَى (9) فَأَنْتَ عَنْهُ تَلَهَّى (10) “Dan adapun orang yang datang kepadamu dengan bersegera (untuk mendapatkan pengajaran), sedang ia takut kepada (Allah), maka kamu mengabaikannya.” Ini adalah kebalikannya: أَمَّا مَنِ اسْتَغْنَى (5) فَأَنْتَ لَهُ تَصَدَّى “Adapun orang yang merasa dirinya serba cukup, maka kamu melayaninya.”.وَأَمَّا مَنْ جَاءَكَ يَسْعَى “Dan adapun orang yang datang kepadamu dengan bersegera (untuk mendapatkan pengajaran),” maknanya: Bergegas agar meraih kesempatan untuk hadir ke majlisnya Nabi shallallaahu ‘alaihi wa sallam, وَهُوَ يَخْشَى “sedang ia takut” maknanya: Takut kepada Allah ‘Azza wa Jalla dengan hatinya, karena ia mengetahui keagungan Allah Ta’ala. فَأَنْتَ عَنْهُ تَلَهَّى “maka kamu mengabaikannya.” Membiarkan dan melalaikan, karena beliau tersibukkan dengan para tokoh Quraisy, dengan harapan mereka mendapatkan hidayah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 10: 5-10. Kemudian Allah berkata kepada Nabi-Nya dengan merinci, Allah berkata : Adapun orang-orang yang telah datang kepadamu dan ia termasuk orang yang kaya dengan hartanya namun menolak akan agama Allah, maka apakah hal seperti ini yang ia datang dengan penolakan patut untuk diurusi ucapannya ? Maka pada hal yang demikian tidak ada dosa bagimu dan kewajiban jika ia tidak mau mensucikan kotoran kekufuran dan kemaksiatannya. Adapun orang yang buta ini datang kepadamu dengan bersegera karena sebab takut dari adzab Allah dan hukuman dari-Nya, sedangkan engkau malah tersibukkan dan berpaling darinya, kemudian berpaling menuju kepada mereka pembesar-pembesar kafir untuk mendakwahinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 10",
    "description": "8-10. Dan adapun orang, yaitu 'abdull'h bin ummi makt'm, yang datang kepadamu dengan bersegera dan bersungguh-sungguh untuk mendapatkan pengajaran islam darimu, sedang dia takut akan siksa Allah jika tidak mematuhi-Nya, engkau malah mengabaikannya, berpaling darinya, tidak menghiraukannya, dan bermuka masam kepadanya. 11. Menjelaskan tujuan utama dari teguran-Nya, Allah berfirman, 'sekali-kali jangan berbuat demikian! sungguh, ajaran-ajaran Allah itu suatu peringatan bagi semua orang agar mereka kembali ke fitrah, yaitu mentauhidkan-Nya dan mengimani-Nya. '"
  }
]