[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-16. Orang yang sangat berharap bertemu denganmu, Dia takut kepada Allah karena tidak berusaha maksimal untuk mendapatkan bimbingan, Kamu justru mengabaikannya. Perkaranya tidak sebagaimana yang kamu perbuat (wahai rasul). Sesungguhnya surat ini yang mengandung hidayah yang merupakan nasihat bagimu dan bagi siapapun yang menginginkan nasihat. Barangsiapa berkehendak, dia mengingat Allah dan mengikuti wahyu NYA, Yaitu al-qur’an yang tercantum lembaran lembaran yang di agungkan dan di hormati, Kedudukannya tinggi, disucikannya dari noda keburukan,penambahan dan pengurangan, Ditangan para malaikat para penulis, para delegasi antara Allah dengan makhluk NYA, Yang mulia akhlaknya, akhlak-akhlak dan perbuatan-perbuatan mereka baik dan suci."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Seharusnya tidak demikian, sesungguhnya ajaran agama itu adalah nasihat dan peringatan bagi orang yang menerimanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11-16. Sungguh ayat-ayat ini merupakan pelajaran bagi orang yang hendak mendapat pelajaran. Maka hamba Allah yang hendak mendapat pelajaran dan peringatan dari ayat-ayat al-Qur’an niscaya dia akan mendapatkannya; dan hal ini tertulis dalam suhuf-suhuf mulia dan berkedudukan tinggi, serta suci dari segala kekurangan dan kotoran, ditulis dengan tangan para malaikat terpilih yang taat kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. كَلَّآ إِنَّهَا تَذْكِرَةٌ (Sekali-kali jangan (demikian)! Sesungguhnya ajaran-ajaran Tuhan itu adalah suatu peringatan) Yakni ayat-ayat ini atau surat ini adalah peringatan yang harus kamu sampaikan dan kamu terima dan amalkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Jangan begitu, jangan bersikap seperti itu wahai Nabi. Sesungguhnya ayat ini adalah nasehat untuk sikap tersebut"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu sibuk dan mengabaikan {Sekali-kali jangan begitu} Tidaklah selayaknya seperti yang kamu lakukan wahai rasul {Sesungguhnya hal itu} sesungguhnya surah ini {merupakan peringatan} pelajaran dan peringatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-16 Allah berfirman, “sekali-kali jangan (demikian)! Sesunggguhnya ajaran-ajaran Rabb itu adalah sesuatu peringatan,” yakni, benar nasihat ini adalah peringatan dari Allah yang dijadikan sebagai peringatan untuk hamba-hambaNya, dan Allah menjelaskan semua yang diperlukan manusia dalam kitab-Nya serta memberi penjelasan antara petunjuk dan kesesatan. Bila hal itu telah jelas, “maka barangsiapa yang menghendaki, tentulah ia memperhatikannya,” yakni mempraktikannya. Seperti yang disebutkan dalam firman Allah, “Dan katakanlah, ‘kebenaran itu datangnya dari Rabbmu; maka barangsiapa yang ingin (beriman), hendaklah ia beriman, dan barangsiapa yang ingin (kafir), biarlah ia kafir.”(Al-Kahfi:29). Kemudian Allah sebutkan tempat peringatan ini dan mengagungkannya serta mengangkat derajatnya seraya berfirman, “Di dalam kitab-kitab yang dimuliakan, yang ditinggikan,” yakni kemualiaan dan derajatnya, “lagi disucikan,” dari berbagai kotoran dan agar tidak diraih oleh tangan-tangan setan atau dicuri, tapi ia berada “di tangan para penulis (malaikat),” mereka adalah para malaikat yang menjadi duta antara Allah dan hamba-hambaNya, “yang mulia,” yakni yang banyak kebaikan dan berkahnya, “lagi berbakti,” baik hati dan baik amal mereka. Semua itu demi menjaga kitab Allah dengan mengutus para duta malaikat yang mulia, kuat, dan bertakwa, sehingga setan tidak memiliki cara untuk mendekatinya. Dan ini mengharuskan untuk diimani dan diterima."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sesungguhnya ayat-ayat itu adalah merupakan peringatan bagi setiap orang yang beriman , mereka saling mengingatkan satu sama lainnya dengan ayat-ayat yang agung itu , mereka mengambil darinya berbagai maacam pelajaran , mereka juga mentadabburinya , Aqur'an yang wahyukan kepada Nabi Muhammad penuh dengan peringatan , pelajaran dan nasehat bagi setiap kaum Muslimin , Allah juga mengatakan di ayat lain : { كَلَّا إِنَّهُ تَذْكِرَةٌ } ( Sekali-kali tidak demikian halnya. Sesungguhnya Al Quran itu adalah peringatan. ) [ Al-Mudatssir : 54 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كَلَّا “Sekali-kali jangan (demikian)!” Maknanya: Jangan lakukan seperti itu, oleh karenanya kami mengatakan: Sesungguhnya كَلَّا di sini adalah huruf yang bermakna peringatan, masudnya: Jangan lakukan seperti yang telah kamu lakukan. إِنَّهَا تَذْكِرَةٌ\" Sesungguhnya ajaran-ajaran Allah adalah suatu peringatan,\" Maknanya: Ayat-ayat quran yang Allah turunkan kepada Rasul-Nya shallallaahu ‘alaihi wa sallam تَذْكِرَةٌ peringatan yang mengingatkan manusia dengan apa-apa yang bermanfaat baginya, dan mendorong untuknya, mengingatkannya terhadap apa-apa yang membahayakannya dan memberikan nasehat untuk hati."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 11: 11-16. Maka ketahuilah wahai Nabi Allah ! Bahwasanya (urusannya) tidak demikian sebagaimana yang telah engkau perbuat; Akan tetapi urusan semisal ini, yaitu berpaling darinya tidak dibenarkan kepada orang yang mencari petunjuk dan kebenaran, meskipun engkau beranggapan bahwa berpaling ke mereka (orang-orang kafir) menyangkut islam. Dan tidaklah pada surat ini dan yang di dalamnya ada banyak petunjuk yang memberikan nasihat dan peringatan bagimu (wahai Nabi) dan bagi siapa yang menginginkan untuk mengambil pelajaran bagi hamba-hamba Allah. Ketahuilah bahwa nasihat-nasihat ini tegas dalam lembaran-lembaran yang di muliakan dan di tetapkan (Al Qur’an). Allah tinggikan ia (Rasulullah) di sisi Allah dan dibersihkan dari kesalahan. Bahwasanya utusan-utusan Allah, Allah jadikan mereka orang-orang yang shalih antara diri-Nya dan Rasul-Rasul-Nya. Dan mereka para malaikat memuliakan (bershalawat) kepadanya di sisi Allah, menuntut menjadikan utusan-Nya taat dan bersih dari dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kata “Kalla” di ayat tersebut bisa diartikan “haqqan” (Tentu atau pasti). Kepada semua makhluk. Dengannya Allah Subhaanahu wa Ta'aala memperingatkan hamba-hamba-Nya, menerangkan apa yang mereka butuhkan serta menerangkan yang benar dari yang salah sehingga mereka tidak tersesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 11",
    "description": "Menjelaskan tujuan utama dari teguran-Nya, Allah berfirman, 'sekali-kali jangan berbuat demikian! sungguh, ajaran-ajaran Allah itu suatu peringatan bagi semua orang agar mereka kembali ke fitrah, yaitu mentauhidkan-Nya dan mengimani-Nya. ' 12. Perigatan-peringatan Allah sudah sangat jelas, maka barang siapa menghendaki untuk mempelajari dengan sungguh-sungguh, tentulah dia akan memperhatikannya, menghayatinya, lalu mengamalkannya. Tidak ada yang menghalangi seseorang memperoleh peringatan itu selain hati yang penuh kesombongan dan keingkaran."
  }
]