[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-16. Orang yang sangat berharap bertemu denganmu, Dia takut kepada Allah karena tidak berusaha maksimal untuk mendapatkan bimbingan, Kamu justru mengabaikannya. Perkaranya tidak sebagaimana yang kamu perbuat (wahai rasul). Sesungguhnya surat ini yang mengandung hidayah yang merupakan nasihat bagimu dan bagi siapapun yang menginginkan nasihat. Barangsiapa berkehendak, dia mengingat Allah dan mengikuti wahyu NYA, Yaitu al-qur’an yang tercantum lembaran lembaran yang di agungkan dan di hormati, Kedudukannya tinggi, disucikannya dari noda keburukan,penambahan dan pengurangan, Ditangan para malaikat para penulis, para delegasi antara Allah dengan makhluk NYA, Yang mulia akhlaknya, akhlak-akhlak dan perbuatan-perbuatan mereka baik dan suci."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Yang ditinggikan di tempat yang tinggi, lagi suci, tidak ada kotoran maupun noda yang mengenainya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. مَّرْفُوعَةٍ (yang ditinggikan) Yakni tinggi derajatnya di sisi Allah. مُّطَهَّرَةٍۭ (lagi disucikan) Yakni tidak ada yang menyentuhnya kecuali orang-orang yang suci, dan ia terlindung dari setan-setan dan orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13-14. Sesungguhnya peringatan (Al-quran) ini tertulis dalam lembaran-lembaran yang dimuliakan dan disucikan di sisi Allah. Mulia dan tinggi di sisi Allah. Terlarang untuk disentuh kecuali oleh orang yang dalam keadaan suci dari hadats"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang ditinggikan} yang ditinggikan kedudukannya {lagi disucikan} disucikan dari kotoran, penambahan dan pengurangan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-16 Allah berfirman, “sekali-kali jangan (demikian)! Sesunggguhnya ajaran-ajaran Rabb itu adalah sesuatu peringatan,” yakni, benar nasihat ini adalah peringatan dari Allah yang dijadikan sebagai peringatan untuk hamba-hambaNya, dan Allah menjelaskan semua yang diperlukan manusia dalam kitab-Nya serta memberi penjelasan antara petunjuk dan kesesatan. Bila hal itu telah jelas, “maka barangsiapa yang menghendaki, tentulah ia memperhatikannya,” yakni mempraktikannya. Seperti yang disebutkan dalam firman Allah, “Dan katakanlah, ‘kebenaran itu datangnya dari Rabbmu; maka barangsiapa yang ingin (beriman), hendaklah ia beriman, dan barangsiapa yang ingin (kafir), biarlah ia kafir.”(Al-Kahfi:29). Kemudian Allah sebutkan tempat peringatan ini dan mengagungkannya serta mengangkat derajatnya seraya berfirman, “Di dalam kitab-kitab yang dimuliakan, yang ditinggikan,” yakni kemualiaan dan derajatnya, “lagi disucikan,” dari berbagai kotoran dan agar tidak diraih oleh tangan-tangan setan atau dicuri, tapi ia berada “di tangan para penulis (malaikat),” mereka adalah para malaikat yang menjadi duta antara Allah dan hamba-hambaNya, “yang mulia,” yakni yang banyak kebaikan dan berkahnya, “lagi berbakti,” baik hati dan baik amal mereka. Semua itu demi menjaga kitab Allah dengan mengutus para duta malaikat yang mulia, kuat, dan bertakwa, sehingga setan tidak memiliki cara untuk mendekatinya. Dan ini mengharuskan untuk diimani dan diterima."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu lembaran lembaran Al-Qur'an yang ditinggikan kedudukannya , dan bukanlah lembaran yang di remehkan ataupun di hinakan , melainkan dimuliakan dan dihormati , baik itu bentuknya maupun ayat-ayat yang terkandung didalamnya karena ayat-ayat itu merupakan perkataan mulia dari Tuhan yang maha esa . { مَرْفُوعَةٍ } yang ditinggikan kedudukan dan derajatnya { مُطَهَّرَةٍ } dan disucikan dari perkataan buruk sepeti kebohongan dan kebathilan , karena sesungguhnya Al-Qur'an adalah perkataan yang benar dan suci, tidak ada keraguan didalamnya , kebenaran yang hakiki , tiada kebohongan didalamnya , dan tiada pula hal-hal yang tdak bermanfaat bagi pembacanya , itulah sebaik-baiknya perkataan , Al-Qur'an yang agung edudukannya dan suci dari segala kebathilan , Allah berfirman : { لَا يَأْتِيهِ الْبَاطِلُ مِنْ بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنْزِيلٌ مِنْ حَكِيمٍ حَمِيدٍ } ( Yang tidak datang kepadanya (Al Quran) kebatilan baik dari depan maupun dari belakangnya, yang diturunkan dari Rabb Yang Maha Bijaksana lagi Maha Terpuji. ) [ Fusshilat : 42 ] . Itulah Al-Qur'an , yang kedudukannya ditinggikan dimuliakan dan disucikan . Oleh karena itu barang siapa yang menghinakannya dan merendahkannya , maka dia telah keluar dari islam , jikalau sekiranya seorang muslim menghina A-Qur'an dan menginjaknya atau membuangnya ketempat sempat dengan tujuan benar-benar untuk menghinakanya maka kelakuannya itu telah mengeluarkannya dari islam , dan itu termasuk dari macam-macam kemurtadan , dan merupakan bagian dari pembatal keislaman seseorang ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "فِي صُحُفٍ مُكَرَّمَةٍ (13) مَرْفُوعَةٍ مُطَهَّرَةٍ (14) \" di dalam kitab-kitab yang dimuliakan, yang ditinggikan lagi disucikan, \"Maknanya, Bahwa adz-dzikru (nama Al-Quran) yang mencakup ayat-ayat ini فِي صُحُفٍ مُكَرَّمَةٍ (13) مَرْفُوعَةٍ مُطَهَّرَةٍ (14) \" di dalam kitab-kitab yang dimuliakan, yang ditinggikan lagi disucikan,\" Diagungkan di sisi Allah, kata الصُّحُف [ash-shuhuf] adalah bentuk jamak الصَّحَائِف [ash-shihaa-if] jamak Shahifah, yaitu tempat mencatat catatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 14: 11-16. Maka ketahuilah wahai Nabi Allah ! Bahwasanya (urusannya) tidak demikian sebagaimana yang telah engkau perbuat; Akan tetapi urusan semisal ini, yaitu berpaling darinya tidak dibenarkan kepada orang yang mencari petunjuk dan kebenaran, meskipun engkau beranggapan bahwa berpaling ke mereka (orang-orang kafir) menyangkut islam. Dan tidaklah pada surat ini dan yang di dalamnya ada banyak petunjuk yang memberikan nasihat dan peringatan bagimu (wahai Nabi) dan bagi siapa yang menginginkan untuk mengambil pelajaran bagi hamba-hamba Allah. Ketahuilah bahwa nasihat-nasihat ini tegas dalam lembaran-lembaran yang di muliakan dan di tetapkan (Al Qur’an). Allah tinggikan ia (Rasulullah) di sisi Allah dan dibersihkan dari kesalahan. Bahwasanya utusan-utusan Allah, Allah jadikan mereka orang-orang yang shalih antara diri-Nya dan Rasul-Rasul-Nya. Dan mereka para malaikat memuliakan (bershalawat) kepadanya di sisi Allah, menuntut menjadikan utusan-Nya taat dan bersih dari dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Kedudukannya. Dari disentuh oleh setan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 14",
    "description": "Itulah lembaran-lembaran mulia yang ditinggikan derajatnya dan disucikan; tidak ada yang bisa mengotori bahkan menjamahnya. Lembaran-lembaran itu dijauhkan dari segala kekurangan dan tidak ada pertentangan di antara ayat-ayatnya. 15. Lembaran-lembaran itu berada di tangan para utusan, yaitu para malaikat, pesuruh Allah yang bertugas sebagai penyampai pesan-pesan-Nya."
  }
]