[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-16. Orang yang sangat berharap bertemu denganmu, Dia takut kepada Allah karena tidak berusaha maksimal untuk mendapatkan bimbingan, Kamu justru mengabaikannya. Perkaranya tidak sebagaimana yang kamu perbuat (wahai rasul). Sesungguhnya surat ini yang mengandung hidayah yang merupakan nasihat bagimu dan bagi siapapun yang menginginkan nasihat. Barangsiapa berkehendak, dia mengingat Allah dan mengikuti wahyu NYA, Yaitu al-qur’an yang tercantum lembaran lembaran yang di agungkan dan di hormati, Kedudukannya tinggi, disucikannya dari noda keburukan,penambahan dan pengurangan, Ditangan para malaikat para penulis, para delegasi antara Allah dengan makhluk NYA, Yang mulia akhlaknya, akhlak-akhlak dan perbuatan-perbuatan mereka baik dan suci."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Dan dia berada di tangan para utusan dari golongan Malaikat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. بِأَيْدِى سَفَرَةٍ (di tangan para penulis (malaikat)) Makna (السفرة) yakni para malaikat yang menjadi perantara wahyu antara Allah dengan Rasulullah. Kata ini berasal dari kata (السفارة) yakni berarti pergi dari satu kaum ke kaum lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Tertulis oleh/pada tangan-tangan malaikat yang ditulis dari Lauhil Mahfudz, para malaikatlah yang menyalurkan wahyu dari Allah kepada para rasul-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{di tangan para utusan} para utusan dari golongan malaikat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-16 Allah berfirman, “sekali-kali jangan (demikian)! Sesunggguhnya ajaran-ajaran Rabb itu adalah sesuatu peringatan,” yakni, benar nasihat ini adalah peringatan dari Allah yang dijadikan sebagai peringatan untuk hamba-hambaNya, dan Allah menjelaskan semua yang diperlukan manusia dalam kitab-Nya serta memberi penjelasan antara petunjuk dan kesesatan. Bila hal itu telah jelas, “maka barangsiapa yang menghendaki, tentulah ia memperhatikannya,” yakni mempraktikannya. Seperti yang disebutkan dalam firman Allah, “Dan katakanlah, ‘kebenaran itu datangnya dari Rabbmu; maka barangsiapa yang ingin (beriman), hendaklah ia beriman, dan barangsiapa yang ingin (kafir), biarlah ia kafir.”(Al-Kahfi:29). Kemudian Allah sebutkan tempat peringatan ini dan mengagungkannya serta mengangkat derajatnya seraya berfirman, “Di dalam kitab-kitab yang dimuliakan, yang ditinggikan,” yakni kemualiaan dan derajatnya, “lagi disucikan,” dari berbagai kotoran dan agar tidak diraih oleh tangan-tangan setan atau dicuri, tapi ia berada “di tangan para penulis (malaikat),” mereka adalah para malaikat yang menjadi duta antara Allah dan hamba-hambaNya, “yang mulia,” yakni yang banyak kebaikan dan berkahnya, “lagi berbakti,” baik hati dan baik amal mereka. Semua itu demi menjaga kitab Allah dengan mengutus para duta malaikat yang mulia, kuat, dan bertakwa, sehingga setan tidak memiliki cara untuk mendekatinya. Dan ini mengharuskan untuk diimani dan diterima."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Oleh siapakah Al-Qur'an itu di sampikan kepada Nabi Muhammad ? Dialah Malaikat yang membawa wahyu Allah itu untuk disampaikan kepada Rasul-Nya Muhammad ﷺ , dialah sebagai perantara antara Allah dan Muhammad ﷺ ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "بِأَيْدِي سَفَرَةٍ \" di tangan safarah (para penulis, malaikat)\" Safarah: Mereka adalah malaikat dinamakan Safarah kerena mereka adalah para pencatat, yang di ambil dari kata السَّفَرُ أو السَّفْرُ [as-safaru atau as-safru] yang artinya buku, seperti dalam firman Allah كَمَثَلِ الْحِمَارِ يَحْمِلُ أَسْفَارًا \" seperti keledai yang membawa (As-faaraa) kitab-kitab yang tebal\" (QS. Al-Jumu’ah: 5) Dikatakan: As-Safarah, adalah perantara antara Allah dengan makhluknya, dari kata السَّفِيْر [as-Safir:] (duta besar) perantara penghubung yang menghubungkan antar manusia, di antara bentuknya adalah seperti dalam hadits Abu Rafi’ radhiyallaahu ‘anhu bahwa Nabi shallallaahu ‘alaihi wa sallam menikahi Maimunah radhiyallaahu ‘anha sebelum beliau ihram, Abu Rafi’ mengatakan: Saya sebagai penengah perantara begi keduanya.(1) Yang benar: Mereka disebut Safarah kerena dua alasan tersebut, karena mereka adalah para perantara Allah dengan makhluknya. Jibril ‘alaihissalaam adalah perantara Allah dengan makhluk-Nya dalam menurunkan wahyu, dan mereka para penulis yang diperbuat manusia pun juga menuliskan amalan manusia kemudian mereka menyampaikannya kepada Allah ‘Azza Wa Jalla , sedangkan Allah maha mengetahui sebelum dan sesudah tertulis. (1) Dikeluarkan Tirmidziy (841). Al-Albaniy mendha'ifkan hadits ini dalam karyanya, Dha'iifu at-Tirmidziy"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 15: 11-16. Maka ketahuilah wahai Nabi Allah ! Bahwasanya (urusannya) tidak demikian sebagaimana yang telah engkau perbuat; Akan tetapi urusan semisal ini, yaitu berpaling darinya tidak dibenarkan kepada orang yang mencari petunjuk dan kebenaran, meskipun engkau beranggapan bahwa berpaling ke mereka (orang-orang kafir) menyangkut islam. Dan tidaklah pada surat ini dan yang di dalamnya ada banyak petunjuk yang memberikan nasihat dan peringatan bagimu (wahai Nabi) dan bagi siapa yang menginginkan untuk mengambil pelajaran bagi hamba-hamba Allah. Ketahuilah bahwa nasihat-nasihat ini tegas dalam lembaran-lembaran yang di muliakan dan di tetapkan (Al Qur’an). Allah tinggikan ia (Rasulullah) di sisi Allah dan dibersihkan dari kesalahan. Bahwasanya utusan-utusan Allah, Allah jadikan mereka orang-orang yang shalih antara diri-Nya dan Rasul-Rasul-Nya. Dan mereka para malaikat memuliakan (bershalawat) kepadanya di sisi Allah, menuntut menjadikan utusan-Nya taat dan bersih dari dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang menjadi perantara antara Allah dengan hamba-hamba-Nya. Ada yang menafsirkan safarah dengan malaikat para penulis."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 15",
    "description": "Lembaran-lembaran itu berada di tangan para utusan, yaitu para malaikat, pesuruh Allah yang bertugas sebagai penyampai pesan-pesan-Nya. 16. Para malaikat penulis itu adalah makhluk Allah yang mulia lagi berbakti. Mereka tidak pernah durhaka kepada-Nya dan tidak pula melanggar titah-Nya."
  }
]