[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "8-16. Orang yang sangat berharap bertemu denganmu, Dia takut kepada Allah karena tidak berusaha maksimal untuk mendapatkan bimbingan, Kamu justru mengabaikannya. Perkaranya tidak sebagaimana yang kamu perbuat (wahai rasul). Sesungguhnya surat ini yang mengandung hidayah yang merupakan nasihat bagimu dan bagi siapapun yang menginginkan nasihat. Barangsiapa berkehendak, dia mengingat Allah dan mengikuti wahyu NYA, Yaitu al-qur’an yang tercantum lembaran lembaran yang di agungkan dan di hormati, Kedudukannya tinggi, disucikannya dari noda keburukan,penambahan dan pengurangan, Ditangan para malaikat para penulis, para delegasi antara Allah dengan makhluk NYA, Yang mulia akhlaknya, akhlak-akhlak dan perbuatan-perbuatan mereka baik dan suci."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Yang mulia di sisi Rabb mereka, banyak melakukan perbuatan-perbuatan baik dan taat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. كِرَامٍۭ (yang mulia) Yakni mulia di sisi Allah. بَرَرَةٍ(lagi berbakti) Taat kepada Tuhan mereka dan memiliki keimanan yang tulus."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Malaikat-malaikat yang mulia dan luhur di sisi Allah, bertakwa kepada Allah dan taat kepada perintah Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{yang mulia lagi berbuat baik} banyak berbuat kebaikan dan ketaatan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 11-16 Allah berfirman, “sekali-kali jangan (demikian)! Sesunggguhnya ajaran-ajaran Rabb itu adalah sesuatu peringatan,” yakni, benar nasihat ini adalah peringatan dari Allah yang dijadikan sebagai peringatan untuk hamba-hambaNya, dan Allah menjelaskan semua yang diperlukan manusia dalam kitab-Nya serta memberi penjelasan antara petunjuk dan kesesatan. Bila hal itu telah jelas, “maka barangsiapa yang menghendaki, tentulah ia memperhatikannya,” yakni mempraktikannya. Seperti yang disebutkan dalam firman Allah, “Dan katakanlah, ‘kebenaran itu datangnya dari Rabbmu; maka barangsiapa yang ingin (beriman), hendaklah ia beriman, dan barangsiapa yang ingin (kafir), biarlah ia kafir.”(Al-Kahfi:29). Kemudian Allah sebutkan tempat peringatan ini dan mengagungkannya serta mengangkat derajatnya seraya berfirman, “Di dalam kitab-kitab yang dimuliakan, yang ditinggikan,” yakni kemualiaan dan derajatnya, “lagi disucikan,” dari berbagai kotoran dan agar tidak diraih oleh tangan-tangan setan atau dicuri, tapi ia berada “di tangan para penulis (malaikat),” mereka adalah para malaikat yang menjadi duta antara Allah dan hamba-hambaNya, “yang mulia,” yakni yang banyak kebaikan dan berkahnya, “lagi berbakti,” baik hati dan baik amal mereka. Semua itu demi menjaga kitab Allah dengan mengutus para duta malaikat yang mulia, kuat, dan bertakwa, sehingga setan tidak memiliki cara untuk mendekatinya. Dan ini mengharuskan untuk diimani dan diterima."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Yaitu Malaikat yang mulia akhlaqnya dan berbakti serta taat atas apa yang doperintahakan kepada mereka, dan syaithon-syaithon tidak akan mampu mendekati Al-Qur'an yang diturunkan itu , Allah berfirman : { وَمَا تَنَزَّلَتْ بِهِ الشَّيَاطِينُ , وَمَا يَنْبَغِي لَهُمْ وَمَا يَسْتَطِيعُونَ , إِنَّهُمْ عَنِ السَّمْعِ لَمَعْزُولُونَ } ( Dan Al Quran itu bukanlah dibawa turun oleh syaitan-syaitan. , Dan tidaklah patut mereka membawa turun Al Quran itu, dan merekapun tidak akan kuasa. , Sesungguhnya mereka benar-benar dijauhkan daripada mendengar Al Quran itu. ) [ Asy- Syu'ara' : 210-212 ] , mereka benar-benar dijauhkan dari Al-Qur'an , dan hanya Malaikat yang mulia lah yang membawa Al-Qur'an . Begitupun dengan kitab-kitab Allah lainnya juga dibawa oleh para malaikat yang mulia , dan syaithon tidak akan pernah bisa mendekatinya . Allah menyebut malaikat itu dengan sebutan { كِرَامٍ } dari kata ( الكَرَم ) kemuliaan , yakni yang berwibawa atau bermartabat , mereka dimuliakan oleh Allah sang pencipta dan juga dimuliakan oleh hamba-hamba Allah , berbeda dengan syaithon yang sangat dihinakan dan direndahkan dari segala hal . { بَرَرَةٍ } yaitu berbakti , adalah lawan kata dari durhaka ( bermaksiat ) , Malaikat tidak akan pernah terjerumus pada kemaksiatan dan kesalahan serta pelanggaran apapun , karena Allah telah menjaga mereka dari semua hal itu . Kemudian Allah menjelaskan keadaan manusia jika Allah belum memberikan kepadanya Hidayah , jika Dia belum memuliakannya , jika Allah belum menghendaki padanya keimanan , maka sesungguhnya dia adalah manusia paling hina , dan seburuk-buruknya makhluk , Allah berfirman : { لَقَدْ خَلَقْنَا الْإِنْسَانَ فِي أَحْسَنِ تَقْوِيمٍ , ثُمَّ رَدَدْنَاهُ أَسْفَلَ سَافِلِينَ , إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ } ( Sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya. , Kemudian Kami kembalikan dia ke tempat yang serendah-rendahnya (neraka), , Kecuali orang-orang yang beriman dan mengerjakan amal saleh; maka bagi mereka pahala yang tiada putus-putusnya. ) [ At-Tin : 4-6 ] , sedangkan mereka yang menyatakan keimanannya kepada Allah maka tempat mereka disisi Tuhannya adalah kedudukan yang paling tinggi , adapun mereka yang terperosok ke dalam perbuatan yang jahat maka sesungguhnya dia termasuk kedalam golongan makhluk yang paling buruk dan hina , Allah berfirman : { أَمْ تَحْسَبُ أَنَّ أَكْثَرَهُمْ يَسْمَعُونَ أَوْ يَعْقِلُونَ ۚ إِنْ هُمْ إِلَّا كَالْأَنْعَامِ ۖ بَلْ هُمْ أَضَلُّ سَبِيلًا } ( Atau apakah kamu mengira bahwa kebanyakan mereka itu mendengar atau memahami. Mereka itu tidak lain, hanyalah seperti binatang ternak, bahkan mereka lebih sesat jalannya (dari binatang ternak itu). ) [ Al-Furqon : 44 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "كِرَامٍ \" yang mulia \" maknanya: Mereka mulia akhlaknya, dan mulia dalam bentuk penciptaannya, karena meraka tercipta dalam bentuk terbaik, dan dengan akhlak terbaik بَرَرَةٍ adalah bentuk jamak dari البَرُّ [al-Barru] yang berarti banyak keutamaan dan kebaikannya, oleh karenanya Allah mensifati malaikat bahwa mereka pencatat yang mulia, mengetahui yang kalian (manusia) lakukan, dan mereka juga tidak enggan (sombong) untuk ibadah kepada Allah, tidak pernah letih, mereka bertasbih di waktu malam dan siang, tidak pernah bosan. Ayat ini mengandung pendidikan Allah Azza Wa Jalla kepada manusia agar tidak mementingkan person tertentu namun hendaknya lebih mementingkan yang bersifat maknawi, dan tidak mengutamakan orang yang punya kedudukan karena kedudukannya, atau orang besar karena kebesarannya, atau orang yang dekat karena kedekatannya dalam berdakwah kepada Allah , namun manusia itu semua sama rata dalam dakwah kepada Allah , yang miskin, yang kaya, besar, kecil, dekat atau jauh. Dalamnya juga terkandung, santunnya Allah ‘Azza wa Jalla dalam berinteraksi dengan Nabi shallallahu ‘alaihi wa sallam. Pertama-tama Allah berfirman: عَبَسَ وَتَوَلَّى (1) أَنْ جَاءَهُ الْأَعْمَى “Dia (Muhammad) bermuka masam dan berpaling, karena telah datang seorang buta kepadanya.” Tiga kalimat Allah tidak langsung berinteraksi dengan Nabi shallallaahu ‘alaihi wa sallam , karena jikalau itu teguran kepada Rasul secara langsung maka itu sangat keras namun kalimat tersebut datang dengan kataganti orang ke tiga عَبَسَ “Dia Berwajah masam” Kalau dilihat dari konsekuensi kondisi, maka seharusnya “ Engkau bermuka masam, engkau berpaling saat kedatangan orang buta ” Namun Allah berfirman: عَبَسَ وَتَوَلَّى “karena telah datang seorang buta kepadanya.” Allah jadikan hukumnya untuk orang yang tidak hadir, karena tidak pas Nabi shallallaahu ‘alaihi wa sallam diajak bicara dengan kata-kata yang kasar dan keras, dan agar Umat ini tidak terjadi seperti itu. Allah telah mensifati kitab-Nya ini dengan lisan arab yang jelas, dan ini diantara bentuk kejelasannya. Ayat-ayat tersebut juga mengandung dalil bolehnya menjuluki seseorang dengan pensifatan si buta, si pincak, si buta sebelah. Para ulama telah melakukannya, al-A’raj (si pincang) dari Abu Hurairah, al-A’masy (si buta sebelah) dari Ibnu Mas’ud… dan begitulah semisalnya. Ulama mengatakan: julukan dengan penyebutan aib, jika tijuannya untuk menentukan person tertentu maka hukumnya tidak mengapa. Namun jika dimaksudkan untuk menghina seseorang maka ini haram. Karena yang pertama , jika bertujuan untuk menentukan orang tertentu maka ini dibutuhkan. Dan yang kedua: jika tujuannya menghina orang lain maka ini tidak bertujuan penjelasan namun tujuannya adalah hinaan. Ada sebuah atsar yang mengatakan: “ tidaklah hinaan ditunjukkan kepada saudaramu, melaikan Allah akan merehmatinya dan Allah menimpakan cobaan kepadamu ” (1) (1) dikeluarkan Tirmidziy (2506) dari hadits Watsilah Bin Asqa' radhiyallaahu 'anhu, dinyatakan dha'if oleh Al-Albaniy dalam dha'iiful jaami' (6253)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 16: 11-16. Maka ketahuilah wahai Nabi Allah ! Bahwasanya (urusannya) tidak demikian sebagaimana yang telah engkau perbuat; Akan tetapi urusan semisal ini, yaitu berpaling darinya tidak dibenarkan kepada orang yang mencari petunjuk dan kebenaran, meskipun engkau beranggapan bahwa berpaling ke mereka (orang-orang kafir) menyangkut islam. Dan tidaklah pada surat ini dan yang di dalamnya ada banyak petunjuk yang memberikan nasihat dan peringatan bagimu (wahai Nabi) dan bagi siapa yang menginginkan untuk mengambil pelajaran bagi hamba-hamba Allah. Ketahuilah bahwa nasihat-nasihat ini tegas dalam lembaran-lembaran yang di muliakan dan di tetapkan (Al Qur’an). Allah tinggikan ia (Rasulullah) di sisi Allah dan dibersihkan dari kesalahan. Bahwasanya utusan-utusan Allah, Allah jadikan mereka orang-orang yang shalih antara diri-Nya dan Rasul-Rasul-Nya. Dan mereka para malaikat memuliakan (bershalawat) kepadanya di sisi Allah, menuntut menjadikan utusan-Nya taat dan bersih dari dosa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni taat kepada Allah Subhaanahu wa Ta'aala. Bararah juga bisa diartikan baiknya hati dan amal mereka. Semua ini merupakan bentuk penjagaan Allah terhadap kitab-Nya, yaitu dengan mengutus para malaikat yang mulia dan kuat kepada para rasul, dan tidak memberikan kesempatan bagi setan untuk menyentuh atau mencurinya. Kitab ini jelas mengharuskan untuk diimani dan diterima, akan tetapi manusia tidak menghendaki selain tetap bersikap kufur. Oleh karena itu, pada ayat selanjutnya Dia berfirman, “Celakalah manusia! Alangkah kufurnya dia!”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 16",
    "description": "Para malaikat penulis itu adalah makhluk Allah yang mulia lagi berbakti. Mereka tidak pernah durhaka kepada-Nya dan tidak pula melanggar titah-Nya. 17. Allah telah menurunkan Al-Qur'an sebagai kitab yang penuh peringatan bagi manusia agar mereka mengikuti jalan Allah, tetapi celakalah manusia, alangkah jauh mereka dari rahmat Allah, alangkah kufurnya dia kepada peringatan tuhan!."
  }
]