[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-23. Manusia kafir dilaknat dan diazab, betapa besar kekafirannya kepada tuhannya. Tidakkah dia melihat dari apa Allah menciptakannya pertama kali? Allah menciptakannya dari air yang sedikit (yaitu sperma),lalu allah menciptakannya dalam beberapa tahapan, Kemudian Allah menjelaskan baginya jalan kebaikan dan jalan keburukan, Kemudian Allah mematikannya dan menjadikan baginya satu tempat yang ia dikubur di dalamnya. Kemudian jika Allah berkehendak Dia akan menghidupkan kembali dan membangkitkannya untuk menghadapi perhitungan amal dan balasan. Perkaranya tidak sebagaimana yang diucapkan dan dilakukan oleh orang kafir ini,dia tidak menunaikan perintah Allah,yaitu beriman kepada NYA dan mentaati NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Terlaknatlah manusia yang kafir, betapa besar kekafiran mereka terhadap Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17-22. Ini merupakan doa keburukan bagi manusia yang kafir agar mendapat laknat dan dijauhkan dari rahmat Allah karena sangat ingkar terhadap nikmat-nikmat-Nya. Apakah dia mengakui dari apa Allah menciptakannya? Allah menciptakannya dari air mani, kemudian Allah menetapkan baginya tahapan-tahapan penciptaan. Kemudian Allah memudahkannya untuk keluar dari perut ibunya; dan setelah dia dewasa, Allah menjelaskan baginya jalan kebaikan dan keburukan. Kemudian Allah akan menetapkan kematian baginya dan memerintahkan untuk dikubur. Lalu Allah akan menghidupkannya untuk menjalani hisab jika Dia menghendaki itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. قُتِلَ الْإِنسٰنُ مَآ أَكْفَرَهُۥ (Binasalah manusia; alangkah amat sangat kekafirannya) Terlaknatlah orang kafir, betapa besar kekafirannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Orang kafir dilaknat selaknat-lanatnya atas kekufuran mereka. Mereka akan dipanggil dengan panggilan paling buruk"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Celakalah manusia} terkutuklah orang kafir {Alangkah kufur dia} alangkah dahsyatnya kekufurannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-23 Meski seperti itu, manusia tetap saja kufur. Karena itu Allah berfirman, “Binasalah manusia; alangkah amat sangat keakfirannya” terhadap nikmat Allah, dan alangkah hebat pembangkangannya pada kebenaran setelah kebenaran itu jelas, padahal sendiri apa? Dia hanyalah makhluk paling lemah yang diciptakan Allah dari air hina kemudian ditentukan wujudnya serta disempurnakan menjadi manusia sempurna lalu Allah menyempurnakan kekuatan lahir dan batinnya. “Kemudian dia memudahkan jalannya,” yakni Allah memudahkan baginya sebab-sebab agama dan dunia dan menunjukan pada jalan lurus serta menjelaskannya. Allah mengujinya dengan perintah dan larangan. “Kemudian Dia mematikannya dan memasukkannya ke dalam kubur,” yakni, memuliakannya dengan disemayamkan dan tidak dijadikan seperti hewan yang bangkainya dibiarkan saja tergeletak diatas tanah. “Kemudian bila Dia menghendaki, Dia membangkitkannya setelah kematian untuk pembalasan amal. Hanya Allah semata yang mengatur manusia dan mengarahkannya pada hal-hal tersebut. Tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. Meski demekian, manusia tetap saja tidak mau menunaikan perintah Allah dan tidak mau menunaikan kewajiban yang dibebankan padanya. Bahkan senantiasa bermalas-malasan tapi banyak meminta."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setelah Allah menjelaskan kedudukan Al-Qur'an , dan kedudukan orang beriman , Allah kemudian menjelaskan pada ayat ini status mereka yang dalam diri mereka ada sifat kekufuran : { قُتِلَ الْإِنْسَانُ مَا أَكْفَرَهُ } maksud dari ( قُتِلَ ) disini adalah laknat , Yakni Allah melaknat sebgian golongan dari manusia , dikarekan betapa besarnya kekufuran mereka kepada Allah , yaitu kekufuran mereka terhadap nikmat yang Allah berikan , dan kekufuran mereka terhadap Al-Qur'an . { قُتِلَ الْإِنْسَانُ } Terlaknatlah sebagian golongan dari manusia , dan yang dimaksud dari ayat ini adalah mereka orang-orang kafir , terhadap apapun mereka berbuat kufur melainkan itu hanyalah dari nafsu mereka dan kesengsaraan yang akan mereka dapati ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "قُتِلَ الْإِنْسَانُ “Binasalah manusia” قُتِلَ sebagian ulama memaknai: Terlaknat. Namun yang nampak maknanya adalah dibinasakan, karena pembunuhan mengakibatkan kebinasaan. Ini adalah uslub (gaya bahasa) yang digunakan orang arab untuk menjelekkan yang dilakukan orang yang diarahkannya. Misalnya mereka mengatakan: Fulan binasa, alangka jelek akhlaknya, fulan binasa, betapa buruk ia, dan semisalnya. Firman Allah Ta’ala الْإِنْسَانُ \"Manusia\" sebagian ulama mengatakan: yang dimaksud dengan manusia disini adalah orang kafir secara khusus, bukan semua insan, karena setelahnya Allah berfirman: مَا أَكْفَرَهُ \" alangkah amat sangat kekafirannya?\" bisa juga yang dimaksud manusia disini adalah al-Jins/jenis (mayoritas). Karena kebanyakan manusia adalah kuffar, sebagaimana ditetapkan dalam hadits yang shahih: Sesungguhnya Allah akan mengatakan di hari kiamat nanti: Wahai Adam, Adam menjawab: Aku siap menerima panggilanmu segera. Maka Allah berkata padanya: “Keluarkanlah sebagian keturunan mu sekelompok orang dari neraka” maka Adam berkata: Ya Rabb, Dari jumlah berapa segolongan penduduk neraka itu? Allah menjawab: Dari setiap seribu Sembilan ratus Sembilan puluh Sembilan. مَا أَكْفَرَهُ Sebagian ulama mengatakan: Kata Maa di sini, berfungsi istifhaamiyah (untuk kalimat tanya) maknanya: Sesuatu apakah yang ia kufuri? Apa yang menggiringnya kepada kekufuran?Sebagian Ulama mengatakan: Kalimat ini adalah termasuk kalimat ungkapan takjub; maknanya: Alangkah kafirnya dia? Kekufuran manusia itu besar, karena Allah telah memberinya akal, mengutus Rasul-rasul, menurunkan kitab-kitab, dan membentangkan bukti-bukti kebenaran, walau pun begitu ia tetap kafir, maka dari itu kekufurannya besar. Perbendaan antara kedua pendapat ini: Jika ditinjau dengan pendapat pertama, maka مَا adalah istifhamiyah, maknanya: Apa yang membuatnya kufur. Sedangkan jika ditinjau dengan pendapat kedua maka مَا disini adalah untuk mengungkapkan rasa heran/takjub. Berarti maknanya: Manusia mengherankan, bagaimana dia kafir padahal segala sesuatu sudah diberikan kepadanya dalam penjelasan kebenaran, petunjuk, kekufuran dan keimanan?! Kekufuran di sini mencakup semua macam kekufuran, di antaranya adalah mengingkari kebangkitan. Banyak dari orang-orang kafir yang mendustakan adanya kebangkitan. Mereka mengatakan: Tidak mungkin manusia dibangkitkan setelah tulang-tulangnya sudah hancur lebur, sebagaimana Allah berfirman: وَضَرَبَ لَنَا مَثَلًا وَنَسِيَ خَلْقَهُ قَالَ مَنْ يُحْيِ الْعِظَامَ وَهِيَ رَمِيمٌ “Siapakah yang dapat menghidupkan tulang belulang, yang telah hancur luluh?”(QS. Yasin: 78)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 17: 17-23. Kemudian Allah menyeru kepada orang-orang kafir, Ia berkata : Allah akan perangi orang-orang yang kufur dengan kekufuran yang sangat kepada Allah, (padahal) bersamaan dengan kekufurannya, Allah telah berbuat baik kepadanya. Lalu Allah katakan kepada mereka yang bersikukuh dengan kekufurannya : Bukankan ia (orang-orang kafir) melihat asal penciptaannya yang diciptakan dari setetes mani yang hina ? Sampai-sampai mereka tidak membutuhkan lagi keimanan kepada Rabbnya ? Dengan mani ini Allah jadikan mereka ditakdirkan menempel di rahim ibunya dengan kondisi bertahap sampai menjadi manusia. Kemudian setelah melewati tahap ini yaitu ketika hidup di dalam rahim ibunya, Allah mudahkan baginya untuk keluar (ke dunia), Allah beri petunjuk untuk hidup di bumi, Allah mudahkan untuk mendapatkan petunjuk (kebaikan) jika ia mendambakannya, dan Allah bebaskan bermaksiat jika memang itu dambaannya. Kemudian Allah beri kenikmatan (pada mukmin) ketika mati dan dikuburkan di dalam kubur, Allah berikan kemuliaan atasnya. Kemudian Allah beri kenikmatan ketika Allah berkehendak menghidupkan dan membangkitkannya setelah kematiannya untuk dihisab dan dibalas amalannya ketika dunia; Sedangkan orang-orang kafir Allah berikan cobaan dan diuji atas kesombongan dan keangkuhannya, padahal Allah telah berbuat baik kepadanya (di dunia) dan sama-yaitu dibebankan syariat; Akan tetapi ia tidak menganggap (acuh) atas apa yang telah diwajibkan oleh Rabbnya dari keimanan dan amal yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang kafir. Kepada nikmat Allah, dan alangkah kerasnya penentangannya kepada kebenaran setelah jelas, padahal siapakah dia? Dia hanyalah makhluk yang diciptakan dari sesuatu yang paling lemah; dari air yang hina lalu Allah menentukan fase-fase kejadiannya dan menyempurnakannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 17",
    "description": "Allah telah menurunkan Al-Qur'an sebagai kitab yang penuh peringatan bagi manusia agar mereka mengikuti jalan Allah, tetapi celakalah manusia, alangkah jauh mereka dari rahmat Allah, alangkah kufurnya dia kepada peringatan tuhan!18. Mengapa mereka ingkar' tidakkah mereka sadar dari apakah dia menciptakannya'."
  }
]