[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-23. Manusia kafir dilaknat dan diazab, betapa besar kekafirannya kepada tuhannya. Tidakkah dia melihat dari apa Allah menciptakannya pertama kali? Allah menciptakannya dari air yang sedikit (yaitu sperma),lalu allah menciptakannya dalam beberapa tahapan, Kemudian Allah menjelaskan baginya jalan kebaikan dan jalan keburukan, Kemudian Allah mematikannya dan menjadikan baginya satu tempat yang ia dikubur di dalamnya. Kemudian jika Allah berkehendak Dia akan menghidupkan kembali dan membangkitkannya untuk menghadapi perhitungan amal dan balasan. Perkaranya tidak sebagaimana yang diucapkan dan dilakukan oleh orang kafir ini,dia tidak menunaikan perintah Allah,yaitu beriman kepada NYA dan mentaati NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Dari air yang sedikit Allah menciptakannya lalu Allah mentakdirkan penciptaannya fase demi fase."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. مِن نُّطْفَةٍ خَلَقَهُۥ (Dari setetes mani, Allah menciptakannya) Yakni dari air yang hina. Lalu mengapa makhluk yang keluar dari saluran kencing dua kali dapat bersikap sombong? فَقَدَّرَهُۥ(lalu menentukannya) Yakni kemudian Allah menyempurnakan dan melengkapinya dengan anggota badan untuk kebaikannya, Allah menciptakan baginya dua tangan, dua kaki, dua mata, dan anggota tubuh dan panca indra lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Allah menciptakan mereka dari air mani yang hina dan sepele. Allah lalu menumbuhkan dari mani itu wujud raganya dalam beberapa proses yang berbeda. Allah juga menjadikan berbagai anggota tubuh untuk keperluaan hidupnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menciptakannya dari setetes mani} air yang sedikit {lalu menentukan takdirnya} menentukan kadarnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-23 Meski seperti itu, manusia tetap saja kufur. Karena itu Allah berfirman, “Binasalah manusia; alangkah amat sangat keakfirannya” terhadap nikmat Allah, dan alangkah hebat pembangkangannya pada kebenaran setelah kebenaran itu jelas, padahal sendiri apa? Dia hanyalah makhluk paling lemah yang diciptakan Allah dari air hina kemudian ditentukan wujudnya serta disempurnakan menjadi manusia sempurna lalu Allah menyempurnakan kekuatan lahir dan batinnya. “Kemudian dia memudahkan jalannya,” yakni Allah memudahkan baginya sebab-sebab agama dan dunia dan menunjukan pada jalan lurus serta menjelaskannya. Allah mengujinya dengan perintah dan larangan. “Kemudian Dia mematikannya dan memasukkannya ke dalam kubur,” yakni, memuliakannya dengan disemayamkan dan tidak dijadikan seperti hewan yang bangkainya dibiarkan saja tergeletak diatas tanah. “Kemudian bila Dia menghendaki, Dia membangkitkannya setelah kematian untuk pembalasan amal. Hanya Allah semata yang mengatur manusia dan mengarahkannya pada hal-hal tersebut. Tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. Meski demekian, manusia tetap saja tidak mau menunaikan perintah Allah dan tidak mau menunaikan kewajiban yang dibebankan padanya. Bahkan senantiasa bermalas-malasan tapi banyak meminta."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dari tetesan mani ! , yaitu air yang hina dan lemah , itulah asal mereka Allah menciptakan mereka dari air mani kemudian Dia menentukan anggota badannya, dan urat-urat syarafnya, dan tulang-tulangnya, dan akalnya, dan Allah juga menentukan ajal mereka, Dia juga menentukan amalan mereka, bahkan Allah pun menetukan nasib seseorang kebahagiaan atau kesengsaraan yang akan ia hadapi, semua telah Allah tentukan sebelum manusia dilahirkan kebumi, Allah telah memperhatikan dan mementingkan penciptaan manusia, berbeda dengan penciptaan binatang dan makhluk-makhluk lainnya yang diciptakan untuk kepentingan sesaat dan selesai, adapun penciptaan manusia akan ada tanggung jawab dari masing-masing indifidu, oleh karena itu Allah menjadikan makhluk-makhluk itu tunduk kepada manusia, hanya untuk kemaslahatan manusia, , Allah telah melimpahkan kepada manusia begitu banyak rezeki, dan mengutus kepada mereka Rasul-Nya, dan diturunkan kepada mereka kitab-Nya, sungguh Allah benar-benar memperhatikan keberadaan manusia dimuka bumi, akan tetapi mereka kufur akan semua nikmat yang Allah berikan. Maka bukanlah manusia itu sendiri yang menciptakan dirinya, dan tiada pencipta selain Allah, lalu kemudian mereka mengingkari dan berbuat kufur terhadap semua nikmat itu, mereka membangkang kepada Allah yang menciptakannya dan berlaku sombong, terhadap-Nya, oleh karenanya Hasan Al-Bashri mengatakan : \"Bagaimana mungkin manusia itu berlaku sombong sedangkan dia dilahirkan kemuka bumi melalui saluran air seni laki-laki dan perempuan ?! karena bahwasanya penciptaan manusia dari mani seorang laki-laki dan mani seorang perempuam, bagaimana mungkin dia menyombongkan diri ?!"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "yaitu pada firman-Nya:مِنْ نُطْفَةٍ خَلَقَهُ “Dari setetes mani, Allah menciptakannya” Maknanya: Kamu wahai manusia yang tidak meyakini kebangkitan? Dari apa kamu tercipta? Bukankah kamu tercipta dari tiada, sesuatu yang tidak dapat disebutkan sebelumnya, kemudia kamu diadakan dan kamu menjadi manusia, maka bagaimana mungkin kamu kafir terhadap kebangkitan? Oleh karenanya Allah berfirman: مِنْ نُطْفَةٍ خَلَقَهُ Nutfah makna asalnya adalah air yang sedikit, yang dimaksudkan dengan nutfah di sini adalah : air (mani) laki-laki yang memancar yang keluar dari tulang belakang dan tulang dada, yang diteteskan ke rahim perempuan sehingga ia hamil. فَقَدَّرَهُ \" lalu menentukannya.\" Maknanya: Allah menjadikannya terukur ada tahapan-tahapan: dari setetes mani, segumpal darah, segumpal daging, sebagaimana dalam hadits shahih, dari Ibnu Mas’ud radhiyallaahu ‘anhu ia berkata: Rasulullah shallallaahu ‘alaihi wa sallam telah menceritakan kepada kami, diala orang yang jujur dan terpercaya (dibenarkan): إِنَّ أَحَدَكُمْ يُجْمَعُ خَلْقُهُ فِيْ بَطْنِ أُمِّهِ أَرْبَعِيْنَ يَوْمَاً نُطْفَةً، ثُمَّ يَكُوْنُ عَلَقَةً مِثْلَ ذَلِكَ،ثُمَّ يَكُوْنُ مُضْغَةً مِثْلَ ذَلِكَ،ثُمَّ يُرْسَلُ إِلَيْهِ المَلَكُ فَيَنفُخُ فِيْهِ الرٌّوْحَ،وَيَؤْمَرُ بِأَرْبَعِ كَلِمَاتٍ: بِكَتْبِ رِزْقِهِ وَأَجَلِهِ وَعَمَلِهِ وَشَقِيٌّ أَوْ سَعِيْدٌ. فَوَالله الَّذِي لاَ إِلَهَ غَيْرُهُ إِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ حَتَّى مَا يَكُوْنُ بَيْنَهُ وَبَيْنَهَا إلاذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ فَيَدْخُلُهَا، وَإِنَّ أَحَدَكُمْ لَيَعْمَلُ بِعَمَلِ أَهْلِ النَّارِ حَتَّى مَايَكُونُ بَيْنَهُ وَبَيْنَهَا إلا ذِرَاعٌ فَيَسْبِقُ عَلَيْهِ الكِتَابُ فَيَعْمَلُ بِعَمَلِ أَهْلِ الجَنَّةِ فَيَدْخُلُهَا Sesungguhnya salah seorang dari kalian dikumpulkan penciptaannya di perut ibunya selama empat puluh hari berbentuk nutfah(setetes mani), kemudian menjadi 'alaqoh (segumpal darah) selama itu juga, kemudian menjadi mudghoh (segumpal daging) selama itu juga, kemudian diutuslah kepadanya seorang malaikat lalu ia meniupkan nyawa kepadanya dan diperintahkan untuk menuliskan empat kalimat; menuliskan rejekinya, ajalnya, perbuatannya dan apakah akan sengsara atau bahagia. Maka demi Allah yang tidak ada sesembahan yang benar selain Dia, sesungguhnya salah seorang dari kalian telah berbuat dengan perbuatan penduduk surga hingga tidak ada jarak antara dia dengan surga kecuali satu hasta, namun catatan (takdir) telah mendahuluinya, lalu ia berbuat dengan perbuatan penduduk neraka maka ia akan masuk neraka, dan sesungguhnya salah seorang dari kalian telah berbuat dengan perbuatan penduduk neraka hingga tidak ada jarak antara dia dengan neraka kecuali satu hasta, namun catatan (takdir) telah mendahuluinya, lalu ia berbuat dengan perbuatan penduduk surga maka ia akan masuk surga. (1) Manusia ada tahapan ciptaannya di perut ibunya, siapakah yang membuat tahapan-tahapan itu? Siapakah yang menghubungkan sesuatu yang dapat menumbuhkannya melalui pusar dari darah ibunya? Dialah Allah ‘Azza Wa Jalla. (1) Dileluarkan Bukhari (3208) dan Muslim (2643)"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 19: 17-23. Kemudian Allah menyeru kepada orang-orang kafir, Ia berkata : Allah akan perangi orang-orang yang kufur dengan kekufuran yang sangat kepada Allah, (padahal) bersamaan dengan kekufurannya, Allah telah berbuat baik kepadanya. Lalu Allah katakan kepada mereka yang bersikukuh dengan kekufurannya : Bukankan ia (orang-orang kafir) melihat asal penciptaannya yang diciptakan dari setetes mani yang hina ? Sampai-sampai mereka tidak membutuhkan lagi keimanan kepada Rabbnya ? Dengan mani ini Allah jadikan mereka ditakdirkan menempel di rahim ibunya dengan kondisi bertahap sampai menjadi manusia. Kemudian setelah melewati tahap ini yaitu ketika hidup di dalam rahim ibunya, Allah mudahkan baginya untuk keluar (ke dunia), Allah beri petunjuk untuk hidup di bumi, Allah mudahkan untuk mendapatkan petunjuk (kebaikan) jika ia mendambakannya, dan Allah bebaskan bermaksiat jika memang itu dambaannya. Kemudian Allah beri kenikmatan (pada mukmin) ketika mati dan dikuburkan di dalam kubur, Allah berikan kemuliaan atasnya. Kemudian Allah beri kenikmatan ketika Allah berkehendak menghidupkan dan membangkitkannya setelah kematiannya untuk dihisab dan dibalas amalannya ketika dunia; Sedangkan orang-orang kafir Allah berikan cobaan dan diuji atas kesombongan dan keangkuhannya, padahal Allah telah berbuat baik kepadanya (di dunia) dan sama-yaitu dibebankan syariat; Akan tetapi ia tidak menganggap (acuh) atas apa yang telah diwajibkan oleh Rabbnya dari keimanan dan amal yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud dengan menentukannya ialah menentukan fase-fase kejadiannya (dari mani menjadi segumpal darah lalu menjadi segumpal daging dst.), umurnya, rezekinya, dan nasibnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 19",
    "description": "Manusia hanyalah makhluk yang sangat lemah. Allah menciptakannya dari sesuatu yang hina, yaitu setetes mani. Dia menciptakannya melalui berbagai tahapan, dari tahap alaqah yang menempel di dinding rahim, lalu berubah menjadi mudgah, kemudian tahap pembentukan tulang, kemudian tahap dibungkusnya tulang itu dengan daging, lalu Allah menentukannya dan mewujudkannya dalam bentuk yang sempurna, dilengkapi dengan panca indera, akal, dan sebagainya. 20. Setelah mewujudkan manusia dalam bentuk yang sempurna, dengan kasih sayang-Nya kemudian jalannya dia mudahkan dengan cara mengeluarkannya dari perut ibunya. Dia juga memberinya kemudahan untuk membedakan kebaikan dan keburukan agar dia memilih jalan hidupnya sendiri."
  }
]