[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-23. Manusia kafir dilaknat dan diazab, betapa besar kekafirannya kepada tuhannya. Tidakkah dia melihat dari apa Allah menciptakannya pertama kali? Allah menciptakannya dari air yang sedikit (yaitu sperma),lalu allah menciptakannya dalam beberapa tahapan, Kemudian Allah menjelaskan baginya jalan kebaikan dan jalan keburukan, Kemudian Allah mematikannya dan menjadikan baginya satu tempat yang ia dikubur di dalamnya. Kemudian jika Allah berkehendak Dia akan menghidupkan kembali dan membangkitkannya untuk menghadapi perhitungan amal dan balasan. Perkaranya tidak sebagaimana yang diucapkan dan dilakukan oleh orang kafir ini,dia tidak menunaikan perintah Allah,yaitu beriman kepada NYA dan mentaati NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Kemudian setelah berbagai fase ini Allah memudahkan baginya untuk keluar dari perut ibunya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. ثُمَّ السَّبِيلَ يَسَّرَهُۥ (Kemudian Dia memudahkan jalannya) Yakni Allah kemudian memudahkannya untuk mendapatkan jalan menuju kebaikan atau keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Kemudian Allah juga memperlancar kelahiran mereka. Allah pun juga telah memberi dan memudahkan mereka jalan kebenaran maupun jalan kesesatan agar mereka memilih salah satu jalan itu. Kemudian Allah mematikannya sesuai ajal yang tertulis, Allahpun menjadikan kubur mereka untuk memuliakan mereka dengan menutupi apa yang akan mereka terima di alam kubur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{KemudianDia memudahkan jalannya} Dia memudahkan baginya jalan untuk keluar dari perut ibunya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-23 Meski seperti itu, manusia tetap saja kufur. Karena itu Allah berfirman, “Binasalah manusia; alangkah amat sangat keakfirannya” terhadap nikmat Allah, dan alangkah hebat pembangkangannya pada kebenaran setelah kebenaran itu jelas, padahal sendiri apa? Dia hanyalah makhluk paling lemah yang diciptakan Allah dari air hina kemudian ditentukan wujudnya serta disempurnakan menjadi manusia sempurna lalu Allah menyempurnakan kekuatan lahir dan batinnya. “Kemudian dia memudahkan jalannya,” yakni Allah memudahkan baginya sebab-sebab agama dan dunia dan menunjukan pada jalan lurus serta menjelaskannya. Allah mengujinya dengan perintah dan larangan. “Kemudian Dia mematikannya dan memasukkannya ke dalam kubur,” yakni, memuliakannya dengan disemayamkan dan tidak dijadikan seperti hewan yang bangkainya dibiarkan saja tergeletak diatas tanah. “Kemudian bila Dia menghendaki, Dia membangkitkannya setelah kematian untuk pembalasan amal. Hanya Allah semata yang mengatur manusia dan mengarahkannya pada hal-hal tersebut. Tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. Meski demekian, manusia tetap saja tidak mau menunaikan perintah Allah dan tidak mau menunaikan kewajiban yang dibebankan padanya. Bahkan senantiasa bermalas-malasan tapi banyak meminta."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ السَّبِيلَ } Yaitu jalan, { يَسَّرَهُ } Dia memudahkannya dan memberinya petunjuk, dalam riwayat lain dikatakan : maksud dari jalan disini adalah : keluarnya bayi dari perut ibunya ketika dilahirkan, lalu siapa yang mengeluarkan bayi itu ? : { وَاللَّهُ أَخْرَجَكُمْ مِنْ بُطُونِ أُمَّهَاتِكُمْ لَا تَعْلَمُونَ شَيْئًا وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ ۙ لَعَلَّكُمْ تَشْكُرُونَ } ( Dan Allah mengeluarkan kamu dari perut ibumu dalam keadaan tidak mengetahui sesuatupun, dan Dia memberi kamu pendengaran, penglihatan dan hati, agar kamu bersyukur. ) [ An-Nahl : 78 ]. Dan dikatakan pula, bahwa maksud dari jalan disini adalah : jalan kebenaran dan jalan kesesatan, dan boleh jadi kedua makna tersebut ada benarnya : yaitu jalan keluarnya sesorang dari perut ibunya, dan jalan yang tempuh setelah keluarnya dari perut ibunya, apakah dia berjalan diatas kebenaran, atau bahkan dia berkeinginan memilih jalan yang sesat, dan tiada satu pun yang memaksanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karenanya Allah berfirman: ثُمَّ السَّبِيلَ يَسَّرَهُ “Kemudian Dia memudahkan jalannya,” Yang dimaksud adalah memudahkan jalan, agar ia keluar dengan mudah dari perut ibunya ke dunia luar, dan setelah itu dimudahkan juga apa-apa yang disebutkan dalam firman Allah: وَهَدَيْنَاهُ النَّجْدَيْن “Dan Kami telah menunjukkan kepadanya dua jalan.”(QS. Al-Balad: 10) Allah memudahkan (rejeki)nya dengan dua susu ibunya, ia makan darinya, setelah itu Allah memudahkan dengan dibukakan pintu-pintu rejeki, dan yang lebih tinggi dan penting dari itu semua dimudahkan baginya jalan hidayah dan kebahagiaan yaitu dengan diutus kepadanya risalah-risalah rasul, dan juga diturunkan kitab-kitab suci."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 20: 17-23. Kemudian Allah menyeru kepada orang-orang kafir, Ia berkata : Allah akan perangi orang-orang yang kufur dengan kekufuran yang sangat kepada Allah, (padahal) bersamaan dengan kekufurannya, Allah telah berbuat baik kepadanya. Lalu Allah katakan kepada mereka yang bersikukuh dengan kekufurannya : Bukankan ia (orang-orang kafir) melihat asal penciptaannya yang diciptakan dari setetes mani yang hina ? Sampai-sampai mereka tidak membutuhkan lagi keimanan kepada Rabbnya ? Dengan mani ini Allah jadikan mereka ditakdirkan menempel di rahim ibunya dengan kondisi bertahap sampai menjadi manusia. Kemudian setelah melewati tahap ini yaitu ketika hidup di dalam rahim ibunya, Allah mudahkan baginya untuk keluar (ke dunia), Allah beri petunjuk untuk hidup di bumi, Allah mudahkan untuk mendapatkan petunjuk (kebaikan) jika ia mendambakannya, dan Allah bebaskan bermaksiat jika memang itu dambaannya. Kemudian Allah beri kenikmatan (pada mukmin) ketika mati dan dikuburkan di dalam kubur, Allah berikan kemuliaan atasnya. Kemudian Allah beri kenikmatan ketika Allah berkehendak menghidupkan dan membangkitkannya setelah kematiannya untuk dihisab dan dibalas amalannya ketika dunia; Sedangkan orang-orang kafir Allah berikan cobaan dan diuji atas kesombongan dan keangkuhannya, padahal Allah telah berbuat baik kepadanya (di dunia) dan sama-yaitu dibebankan syariat; Akan tetapi ia tidak menganggap (acuh) atas apa yang telah diwajibkan oleh Rabbnya dari keimanan dan amal yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Memudahkan jalan maksudnya memudahkan kelahirannya atau memberi persediaan kepadanya untuk menjalani jalan yang benar atau jalan yang sesat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 20",
    "description": "Setelah mewujudkan manusia dalam bentuk yang sempurna, dengan kasih sayang-Nya kemudian jalannya dia mudahkan dengan cara mengeluarkannya dari perut ibunya. Dia juga memberinya kemudahan untuk membedakan kebaikan dan keburukan agar dia memilih jalan hidupnya sendiri. 21. Kemudian setelah manusia menuntaskan hidupnya di dunia, dia mematikannya dengan mencabut rohnya dan menguburkannya untuk menjalani kehidupan baru di alam barzakh. Manusia tidak bisa menolak kematian; sebagaiamana dia diciptakan dari tanah, dia akan kembali ke tanah."
  }
]