[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-23. Manusia kafir dilaknat dan diazab, betapa besar kekafirannya kepada tuhannya. Tidakkah dia melihat dari apa Allah menciptakannya pertama kali? Allah menciptakannya dari air yang sedikit (yaitu sperma),lalu allah menciptakannya dalam beberapa tahapan, Kemudian Allah menjelaskan baginya jalan kebaikan dan jalan keburukan, Kemudian Allah mematikannya dan menjadikan baginya satu tempat yang ia dikubur di dalamnya. Kemudian jika Allah berkehendak Dia akan menghidupkan kembali dan membangkitkannya untuk menghadapi perhitungan amal dan balasan. Perkaranya tidak sebagaimana yang diucapkan dan dilakukan oleh orang kafir ini,dia tidak menunaikan perintah Allah,yaitu beriman kepada NYA dan mentaati NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Kemudian setelah Allah menentukan baginya umur kehidupannya, Allah mematikannya dan menjadikan baginya kuburan sebagai tempatnya hingga ia dibangkitkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. ثُمَّ السَّبِيلَ يَسَّرَهُۥ (Kemudian Dia memudahkan jalannya) Yakni Allah kemudian memudahkannya untuk mendapatkan jalan menuju kebaikan atau keburukan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20-21. Kemudian Allah juga memperlancar kelahiran mereka. Allah pun juga telah memberi dan memudahkan mereka jalan kebenaran maupun jalan kesesatan agar mereka memilih salah satu jalan itu. Kemudian Allah mematikannya sesuai ajal yang tertulis, Allahpun menjadikan kubur mereka untuk memuliakan mereka dengan menutupi apa yang akan mereka terima di alam kubur."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian Dia mematikannya lalu menguburkannya} Dia membuatkan kuburan dimana dia ditutupi di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-23 Meski seperti itu, manusia tetap saja kufur. Karena itu Allah berfirman, “Binasalah manusia; alangkah amat sangat keakfirannya” terhadap nikmat Allah, dan alangkah hebat pembangkangannya pada kebenaran setelah kebenaran itu jelas, padahal sendiri apa? Dia hanyalah makhluk paling lemah yang diciptakan Allah dari air hina kemudian ditentukan wujudnya serta disempurnakan menjadi manusia sempurna lalu Allah menyempurnakan kekuatan lahir dan batinnya. “Kemudian dia memudahkan jalannya,” yakni Allah memudahkan baginya sebab-sebab agama dan dunia dan menunjukan pada jalan lurus serta menjelaskannya. Allah mengujinya dengan perintah dan larangan. “Kemudian Dia mematikannya dan memasukkannya ke dalam kubur,” yakni, memuliakannya dengan disemayamkan dan tidak dijadikan seperti hewan yang bangkainya dibiarkan saja tergeletak diatas tanah. “Kemudian bila Dia menghendaki, Dia membangkitkannya setelah kematian untuk pembalasan amal. Hanya Allah semata yang mengatur manusia dan mengarahkannya pada hal-hal tersebut. Tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. Meski demekian, manusia tetap saja tidak mau menunaikan perintah Allah dan tidak mau menunaikan kewajiban yang dibebankan padanya. Bahkan senantiasa bermalas-malasan tapi banyak meminta."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Ketika ajalnya telah tiba, siapakah yang mewafatkannya ? Dialah Allah ﷻ, dan tiada satupun dari makhluk-Nya yang mampu menghapus kehidupan dari seseorang melainkan hanya Allah ﷻ lah yang berkuasa atas itu. Boleh saja kamu mengatakan : dia dibunuh, maka apakah yang membunuhnya dia pula yang mewafatkannya ? Maka yang kita katakan adalah : Dia mematikannya dengan izin Allah, dan dia membunuhnya dengan ketetapan-Nya pula, Allah yang berkuasa atas dirinya, sebab-sebab kematian sesorang banyak akan tetapi yang menentukan wafatnya seseorang hanya satu, Dialah Allah ﷻ . Allah telah menetapkan bahwa dia akan terbunuh, atau dengan ketetapan Allah seseorang dapat terjatuh kedalam sumur, Dia pula yang menakdirkan sesorang tertabrak oleh mobil, sesmua kejadian tersebut adalah berjalan sesuai ketetapan Allah sang pencipta dengan cara apapun itu. Atau seseorang melakukan bunuh diri, lalu apakah dengan itu dia telah mewafatkan dirinya ? maka sebaiknya yang kita katakan adalah : Allah yang telah mentapkan atau mentakdirkan dia akan membunuh dirinya. Dan setelah manusia itu dimatikan lalu apakah dia juga dibiarkan atau dibuang bersama dengan bangkai dari binatang-binatang yang mati ? tidak, {ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ } Melainkan jasad manusia yang telah wafat dengan perintah Allah agar dikuburkan diliang lahat yang tertutup, agar jasad itu terlindungi ataupun terjaga, itulah perhatian Allah kepada manusia . Maka kubur adalah merupakan salah satu nikmat dari Allah kepada umat manusia, berbeda dengan bangkai binatang keabanyakannya dibuang begitu saja sampai membusuk. Allah memerintahkan agar mayat manusia dikuburkan didalam tanah, bahkan terhadap orang kafir pun Allah memerintahkan hal yang sama, karena mereka juga manusia, berebeda halnya dengan binatang. Ketika Abu thalib ( Paman Rasulullah ) meninggal, dan meninggal diatas kekufuran, tiada satupun dari orang-orang kafir yang mengambil alih pengurusan jasadnya untuk dimakamkan, maka Rasulullah pun memerintahkan Ali bin Abi Thalib yang merupakan putra dari Abi Thalib untuk mengburkannya, karena jika seseorang meninggal tetaplah ada padanya kehormatan sekalipun dia kafir, maka sebaiknya mayat-mayat mereka tidak ditinggalkan begitu saja, itulah rahmat Allah kepada hambanya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ أَمَاتَهُ فَأَقْبَرَهُ Kemudai setelah itu Allah matikan ia, kematian adalah ketika ruh meninggalkan tubuh فَأَقْبَرَهُ Maknanya: Allah jadikan ia berada di kubur. Terkubur sebagai penutup, penghormatan dan pemuliaan baginya. Karena kalau saja manusia mati mereka di samakan seperti hewan-hewan lainnya, yang dibuang ke sampah, maka ini adalah bentuk penghinaan besar bagi orang meninggal. Tetapi Allah ‘Azza Wa Jalla mensyari’atkan kepada para hamba-Nya penguburan mayat. Oleh karenanya Ibnu Abbas radhiyallaahu ‘anhu mengatakan tentang penafsiran firman Allah Ta’ala: فَأَقْبَرَهُ “ Allah memuliakannya dengan dikuburkan ”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 21: 17-23. Kemudian Allah menyeru kepada orang-orang kafir, Ia berkata : Allah akan perangi orang-orang yang kufur dengan kekufuran yang sangat kepada Allah, (padahal) bersamaan dengan kekufurannya, Allah telah berbuat baik kepadanya. Lalu Allah katakan kepada mereka yang bersikukuh dengan kekufurannya : Bukankan ia (orang-orang kafir) melihat asal penciptaannya yang diciptakan dari setetes mani yang hina ? Sampai-sampai mereka tidak membutuhkan lagi keimanan kepada Rabbnya ? Dengan mani ini Allah jadikan mereka ditakdirkan menempel di rahim ibunya dengan kondisi bertahap sampai menjadi manusia. Kemudian setelah melewati tahap ini yaitu ketika hidup di dalam rahim ibunya, Allah mudahkan baginya untuk keluar (ke dunia), Allah beri petunjuk untuk hidup di bumi, Allah mudahkan untuk mendapatkan petunjuk (kebaikan) jika ia mendambakannya, dan Allah bebaskan bermaksiat jika memang itu dambaannya. Kemudian Allah beri kenikmatan (pada mukmin) ketika mati dan dikuburkan di dalam kubur, Allah berikan kemuliaan atasnya. Kemudian Allah beri kenikmatan ketika Allah berkehendak menghidupkan dan membangkitkannya setelah kematiannya untuk dihisab dan dibalas amalannya ketika dunia; Sedangkan orang-orang kafir Allah berikan cobaan dan diuji atas kesombongan dan keangkuhannya, padahal Allah telah berbuat baik kepadanya (di dunia) dan sama-yaitu dibebankan syariat; Akan tetapi ia tidak menganggap (acuh) atas apa yang telah diwajibkan oleh Rabbnya dari keimanan dan amal yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memuliakannya dengan menguburkannya dan tidak menjadikannya seperti makhluk yang lain yang jasadnya tidak dikubur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 21",
    "description": "Kemudian setelah manusia menuntaskan hidupnya di dunia, dia mematikannya dengan mencabut rohnya dan menguburkannya untuk menjalani kehidupan baru di alam barzakh. Manusia tidak bisa menolak kematian; sebagaiamana dia diciptakan dari tanah, dia akan kembali ke tanah. 22. Setelah manusia berada di alam barzakh sekian lama, kemudian jika dia menghendaki, dia akan membangkitkannya kembali di hari kebangkitan untuk mempertanggungjawabkan semua perbuatannya di dunia."
  }
]