[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-23. Manusia kafir dilaknat dan diazab, betapa besar kekafirannya kepada tuhannya. Tidakkah dia melihat dari apa Allah menciptakannya pertama kali? Allah menciptakannya dari air yang sedikit (yaitu sperma),lalu allah menciptakannya dalam beberapa tahapan, Kemudian Allah menjelaskan baginya jalan kebaikan dan jalan keburukan, Kemudian Allah mematikannya dan menjadikan baginya satu tempat yang ia dikubur di dalamnya. Kemudian jika Allah berkehendak Dia akan menghidupkan kembali dan membangkitkannya untuk menghadapi perhitungan amal dan balasan. Perkaranya tidak sebagaimana yang diucapkan dan dilakukan oleh orang kafir ini,dia tidak menunaikan perintah Allah,yaitu beriman kepada NYA dan mentaati NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kemudian jika Allah berkehendak membangkitkannya untuk perhitungan dan pembalasan, maka Allah membangkitkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. ثُمَّ إِذَا شَآءَ أَنشَرَهُۥ (kemudian bila Dia menghendaki, Dia membangkitkannya kembali) Yakni Allah akan menghidupkannya lagi setelah kematiannya di waktu yang Allah kehendaki."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Allah mengatakan << Kemudian bila Dia menghendaki, Dia membangkitkannya kembali >> karena peristiwa ini tidak diketahui oleh siapapun dari makhluk-Nya, hari berbangkit seluruh makhluk adalah tergantung ketetapan dan kehendak Allah semata, kapan Dia mengingnkannya maka Dia pasti akan mewujudkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Kemudian jika Allah menghendaki, mereka akan dibangkitkan dari kematian untuk perhitungan amal dan balasan atas mereka. Al Insyar adalah kehidupan setelah mati dalam waktu yang hanya Allah yang mengetahui."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kemudian jika menghendaki, Dia membangkitkannya} memghidupkannya setelah mati untuk dihisab dan dibalas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-23 Meski seperti itu, manusia tetap saja kufur. Karena itu Allah berfirman, “Binasalah manusia; alangkah amat sangat keakfirannya” terhadap nikmat Allah, dan alangkah hebat pembangkangannya pada kebenaran setelah kebenaran itu jelas, padahal sendiri apa? Dia hanyalah makhluk paling lemah yang diciptakan Allah dari air hina kemudian ditentukan wujudnya serta disempurnakan menjadi manusia sempurna lalu Allah menyempurnakan kekuatan lahir dan batinnya. “Kemudian dia memudahkan jalannya,” yakni Allah memudahkan baginya sebab-sebab agama dan dunia dan menunjukan pada jalan lurus serta menjelaskannya. Allah mengujinya dengan perintah dan larangan. “Kemudian Dia mematikannya dan memasukkannya ke dalam kubur,” yakni, memuliakannya dengan disemayamkan dan tidak dijadikan seperti hewan yang bangkainya dibiarkan saja tergeletak diatas tanah. “Kemudian bila Dia menghendaki, Dia membangkitkannya setelah kematian untuk pembalasan amal. Hanya Allah semata yang mengatur manusia dan mengarahkannya pada hal-hal tersebut. Tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. Meski demekian, manusia tetap saja tidak mau menunaikan perintah Allah dan tidak mau menunaikan kewajiban yang dibebankan padanya. Bahkan senantiasa bermalas-malasan tapi banyak meminta."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian jika Allah menghendaki, maka Dia pun membangkitkan maya-maya itu kembali dari kuburnya, agar mereka kemudian beranjak pergi menuju hari dihitungnya amal-amal mereka, yang kemudian mereka akan mendapati balasan terhadap amalan-amalan mereka dengan surga atau neraka, dan yang menentukan nasib mereka adalah amalan yang mereka lakukan didunia. Lalu tidakkah Allah telah melimpahkan kepada orang-orang kafir rezeki yang banyak, Dialah yang memeberi mereka makan dan minum, dan melindungi mereka dengan pakaian padahal mereka adalah kaum kuffar, itu disebabkan karena mereka adalah hamba Allah, itulah kasih sayang Allah kepada seluruh makhluknya, dan Allah tidak menghlangkan hak-hak hamba-Nya atas-Nya walaupun dia adalah kafir. kecuali pada hari akhir yang merupakan waktunya pembalasan atas apa yang dilakukan setiap hamba ketika didunia, jika sesorang mendapat balasan yang tidak ia inginkan, maka itu disebabkan oleh dirinya sendiri yang menyusahkan dirinya ketika didunia, yaitu dengan enggannya dia memenuhi perintah Tuhannya dan melakukan segala apa yang dilarang oleh-Nya. Allah berfiman : { فَالْيَوْمَ لَا تُظْلَمُ نَفْسٌ شَيْئًا وَلَا تُجْزَوْنَ إِلَّا مَا كُنْتُمْ تَعْمَلُونَ } ( Maka pada hari itu seseorang tidak akan dirugikan sedikitpun dan kamu tidak dibalasi, kecuali dengan apa yang telah kamu kerjakan. ) [ Yaasiin : 54 ], begitu adilnya Allah terhadap hamba-Nya dengan memberikan hak mereka yang berbuat kebaikan dan membalas perbuatan para pembuat maksiat terlebih lagi mereka yang berbuat kekufuran, dan Allah sama sekali tidak menzholimi mereka sekalipun."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ثُمَّ إِذَا شَاءَ أَنْشَرَهُ \" kemudian bila Dia menghendaki, Dia membangkitkannya kembali.\" Maknanya: Jika Allah ‘Azza Wa Jalla kehendaki أَنْشَرَهُ Maknanya: Allah membangkitkannya di hari kebangkitan, untuk membalas amal perbuatannya. Kemudian firman-Nya: أَنْشَرَهُ Yakni: Bahwa tidak ada yang menghalangi Allah ‘Azza Wa Jalla, tetapi ketetapan Allah ‘Azza Wa Jalla untuk itu belum tiba."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 22: 17-23. Kemudian Allah menyeru kepada orang-orang kafir, Ia berkata : Allah akan perangi orang-orang yang kufur dengan kekufuran yang sangat kepada Allah, (padahal) bersamaan dengan kekufurannya, Allah telah berbuat baik kepadanya. Lalu Allah katakan kepada mereka yang bersikukuh dengan kekufurannya : Bukankan ia (orang-orang kafir) melihat asal penciptaannya yang diciptakan dari setetes mani yang hina ? Sampai-sampai mereka tidak membutuhkan lagi keimanan kepada Rabbnya ? Dengan mani ini Allah jadikan mereka ditakdirkan menempel di rahim ibunya dengan kondisi bertahap sampai menjadi manusia. Kemudian setelah melewati tahap ini yaitu ketika hidup di dalam rahim ibunya, Allah mudahkan baginya untuk keluar (ke dunia), Allah beri petunjuk untuk hidup di bumi, Allah mudahkan untuk mendapatkan petunjuk (kebaikan) jika ia mendambakannya, dan Allah bebaskan bermaksiat jika memang itu dambaannya. Kemudian Allah beri kenikmatan (pada mukmin) ketika mati dan dikuburkan di dalam kubur, Allah berikan kemuliaan atasnya. Kemudian Allah beri kenikmatan ketika Allah berkehendak menghidupkan dan membangkitkannya setelah kematiannya untuk dihisab dan dibalas amalannya ketika dunia; Sedangkan orang-orang kafir Allah berikan cobaan dan diuji atas kesombongan dan keangkuhannya, padahal Allah telah berbuat baik kepadanya (di dunia) dan sama-yaitu dibebankan syariat; Akan tetapi ia tidak menganggap (acuh) atas apa yang telah diwajibkan oleh Rabbnya dari keimanan dan amal yang shalih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni membangkitkannya setelah mati untuk diberikan balasan. Allah Subhaanahu wa Ta'aala Dialah yang sendiri mengatur manusia dengan pengaturan-pengaturan ini, namun manusia belum melaksanakan perintah Allah dan apa yang diwajibkan-Nya, bahkan selalu meremehkan sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 22",
    "description": "Setelah manusia berada di alam barzakh sekian lama, kemudian jika dia menghendaki, dia akan membangkitkannya kembali di hari kebangkitan untuk mempertanggungjawabkan semua perbuatannya di dunia. 23. Allah telah mencurahkan kasih sayang-Nya kepada manusia, namun banyak dari mereka enggan bersyukur, bahkan berbuat maksiat. Sungguh suatu hal yang mengherankan. Sekali-kali jangan berbuat demikian; dia itu belum melaksanakan apa yang dia perintahkan kepadanya, yaitu beriman, beribadah, dan menaati aturan-Nya."
  }
]