[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "17-23. Manusia kafir dilaknat dan diazab, betapa besar kekafirannya kepada tuhannya. Tidakkah dia melihat dari apa Allah menciptakannya pertama kali? Allah menciptakannya dari air yang sedikit (yaitu sperma),lalu allah menciptakannya dalam beberapa tahapan, Kemudian Allah menjelaskan baginya jalan kebaikan dan jalan keburukan, Kemudian Allah mematikannya dan menjadikan baginya satu tempat yang ia dikubur di dalamnya. Kemudian jika Allah berkehendak Dia akan menghidupkan kembali dan membangkitkannya untuk menghadapi perhitungan amal dan balasan. Perkaranya tidak sebagaimana yang diucapkan dan dilakukan oleh orang kafir ini,dia tidak menunaikan perintah Allah,yaitu beriman kepada NYA dan mentaati NYA."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Tidaklah perkaranya seperti yang disangka oleh orang kafir bahwa ia telah menunaikan kewajibannya terhadap Rabbnya, padahal ia tidak menjalankan kewajiban-kewajiban yang telah Allah wajibkan atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Hendaklah orang kafir ini bertaubat, dia benar-benar tidak menjalankan perintah-perintah yang telah Allah turunkan kepada Rasulullah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. كَلَّا لَمَّا يَقْضِ مَآ أَمَرَهُۥ (Sekali-kali jangan; manusia itu belum melaksanakan apa yang diperintahkan Allah kepadanya) Sebagian mereka menjadi kafir dan sebagian lainnya bermaksiat, dan hanya sedikit orang yang menjalankan perintah-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Jangan bersikap begitu, jangan biarkan mereka dalam kekufuran. Mereka belum melakukan apa yang Allah perintahkan, seperti ibadah dan bersyukur secara sempurna, kecuali hanya sedikit"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sekali-kali tidak. Dia belum melaksanakan apa yang Dia perintahkan kepadanya} Oramg kafir itu belum melaksanakan kewajiban-kewajiban yang diperintahkan oleh Allah kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 17-23 Meski seperti itu, manusia tetap saja kufur. Karena itu Allah berfirman, “Binasalah manusia; alangkah amat sangat keakfirannya” terhadap nikmat Allah, dan alangkah hebat pembangkangannya pada kebenaran setelah kebenaran itu jelas, padahal sendiri apa? Dia hanyalah makhluk paling lemah yang diciptakan Allah dari air hina kemudian ditentukan wujudnya serta disempurnakan menjadi manusia sempurna lalu Allah menyempurnakan kekuatan lahir dan batinnya. “Kemudian dia memudahkan jalannya,” yakni Allah memudahkan baginya sebab-sebab agama dan dunia dan menunjukan pada jalan lurus serta menjelaskannya. Allah mengujinya dengan perintah dan larangan. “Kemudian Dia mematikannya dan memasukkannya ke dalam kubur,” yakni, memuliakannya dengan disemayamkan dan tidak dijadikan seperti hewan yang bangkainya dibiarkan saja tergeletak diatas tanah. “Kemudian bila Dia menghendaki, Dia membangkitkannya setelah kematian untuk pembalasan amal. Hanya Allah semata yang mengatur manusia dan mengarahkannya pada hal-hal tersebut. Tidak ada satu sekutu pun yang menyertai Allah dalam hal itu. Meski demekian, manusia tetap saja tidak mau menunaikan perintah Allah dan tidak mau menunaikan kewajiban yang dibebankan padanya. Bahkan senantiasa bermalas-malasan tapi banyak meminta."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Walaupun perhatian Allah kepada hamba-Nya begitu besar, akan tetapi sebagian besar dari umat manusia tidak mengindahkan apa yang Allah perintahkan kepada mereka, terlebih lagi dalam mentauhidkan Allah, dan mentaati segala apa yang Dia perintahkan, dan mereka bahkan tetap pada kekufuran dan pembangkangan mereka, oleh karenanya Allah mengatakan : { قُتِلَ الْإِنْسَانُ مَا أَكْفَرَهُ } ( Binasalah manusia; alangkah amat sangat kekafirannya ). Maka sungguh mengherankan jika manusia yang memiliki akal dan dengan akalnya itu ia mampu berfikir, mereka mampu menciptakan penemuan-penemuan tekhnlogi baru, mereka mampu menciptakan pesawat, mampu menciptakan berbagai macam alat peledak, dan berbagai alat tempur lainnya, mereka meyadari akan kemampuan akal dan fikiran mereka, akan tetapi mereka tidak menyadari bahwa kemampuan itu datang dari Allah dan mereka pun jauh dari syukur kepada Allah, mereka jauh dari ketaan atas segala perintah-Nya, bahkan mereka menyombongkan diri dengan kemampuan yang mereka miliki, dan tidak jarang kita mendapati seorang anak yang menjunjung tinggi ketaatannya kepada Allah maka surga lah baginya dan Ayahnya justru menjauh dari ketaatan itu dan neraka yang akan menantinya, sebagaimana hal itu terjadi pada Nabi Ibrahim yang taat kepada Allah dan Ayahnya yang membasarkan diri dengan kekufuran dan kesyirikannya kepada Allah, maka kebaikan pun akan menjumpai setiap pelaku kebaikan dan keburukan juga akan menghampiri mereka yang tetap pada kekufuran, itulah keadilan yang berlaku, Allah berfirman : { أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئَاتِ أَنْ نَجْعَلَهُمْ كَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَوَاءً مَحْيَاهُمْ وَمَمَاتُهُمْ ۚ سَاءَ مَا يَحْكُمُونَ } ( Apakah orang-orang yang membuat kejahatan itu menyangka bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal saleh, yaitu sama antara kehidupan dan kematian mereka? Amat buruklah apa yang mereka sangka itu. ) [ Al-Jatsiyah : 21] Begitu adilnya Allah yang tidak menyamakan ganjaran antara orang baik dan buruk dan mukmin dan kafir, Dia tidak menzholimi siapa pun, serta tidak memberi azab kepada siapa pun menlainkan itu merupakan balasan daripada keburukannya sendiri, dan tidak pula Allah membalas kebaikan seseorang melainkan itu adalah balasan daripada amal shalihnya ketika didunia, dan kepada mukmin yang beramal shalih akan Ia lebihkan ganjarannya, akan tetapi kepada kafir tidak ada ganjaran bagi mereka di akhirat sampai mereka menyatakan keimanan mereka kepada Allah, Allah berfirman : { مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا ۖ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَلَا يُجْزَىٰ إِلَّا مِثْلَهَا وَهُمْ لَا يُظْلَمُونَ } ( Barangsiapa membawa amal yang baik, maka baginya (pahala) sepuluh kali lipat amalnya; dan barangsiapa yang membawa perbuatan jahat maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya, sedang mereka sedikitpun tidak dianiaya (dirugikan). ) [ Al-An'am : 160 ]."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Oleh karena itu Allah berfirman: كَلَّا لَمَّا يَقْضِ مَا أَمَرَهُ \" Sekali-kali jangan; manusia itu belum melaksanakan apa yang diperintahkan Allah kepadanya,\" لمَّا [Lamma] bermaknaلَمْ [Lam] artinya: belum, dan terkadang bermakna lain dalam konteks-konteks tertentu. Maknanya: Bahwa Allah Ta’ala belum memutuskan keputusan-Nya itu (membangkitkan kembali) baik kejadiannya dan ketentuannya. Yaitu bahwa keputusan ini belum sempurna untuk membangkitkan kembali mayat itu, namun itu semua ada ketentan waktu yang ditunggu. Di sini terdapat bantahan bagi orang-orang yang mendustakan kebangkitan yang mengatakan, andai saja kabangkitan itu benar, pastilah kita akan menemui nenek moyang kita sekarang ini. ucapan ini adalah penentangan yang dusta. Karena para Rasul tidak mengatakan kepada mereka: Kalian akan dibangkitkan sekarang juga, namun rasul-rasul itu berkata: Sesugguhnya kalian dibangkitkan semua setelah mereka semua meninggal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 23: 17-23. Kemudian Allah menyeru kepada orang-orang kafir, Ia berkata : Allah akan perangi orang-orang yang kufur dengan kekufuran yang sangat kepada Allah, (padahal) bersamaan dengan kekufurannya, Allah telah berbuat baik kepadanya. Lalu Allah katakan kepada mereka yang bersikukuh dengan kekufurannya : Bukankan ia (orang-orang kafir) melihat asal penciptaannya yang diciptakan dari setetes mani yang hina ? Sampai-sampai mereka tidak membutuhkan lagi keimanan kepada Rabbnya ? Dengan mani ini Allah jadikan mereka ditakdirkan menempel di rahim ibunya dengan kondisi bertahap sampai menjadi manusia. Kemudian setelah melewati tahap ini yaitu ketika hidup di dalam rahim ibunya, Allah mudahkan baginya untuk keluar (ke dunia), Allah beri petunjuk untuk hidup di bumi, Allah mudahkan untuk mendapatkan petunjuk (kebaikan) jika ia mendambakannya, dan Allah bebaskan bermaksiat jika memang itu dambaannya. Kemudian Allah beri kenikmatan (pada mukmin) ketika mati dan dikuburkan di dalam kubur, Allah berikan kemuliaan atasnya. Kemudian Allah beri kenikmatan ketika Allah berkehendak menghidupkan dan membangkitkannya setelah kematiannya untuk dihisab dan dibalas amalannya ketika dunia; Sedangkan orang-orang kafir Allah berikan cobaan dan diuji atas kesombongan dan keangkuhannya, padahal Allah telah berbuat baik kepadanya (di dunia) dan sama-yaitu dibebankan syariat; Akan tetapi ia tidak menganggap (acuh) atas apa yang telah diwajibkan oleh Rabbnya dari keimanan dan amal yang shalih."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 23",
    "description": "Allah telah mencurahkan kasih sayang-Nya kepada manusia, namun banyak dari mereka enggan bersyukur, bahkan berbuat maksiat. Sungguh suatu hal yang mengherankan. Sekali-kali jangan berbuat demikian; dia itu belum melaksanakan apa yang dia perintahkan kepadanya, yaitu beriman, beribadah, dan menaati aturan-Nya. 24. Jika manusia bersikeras dengan keingkarannya, maka hendaklah manusia itu memperhatikan makanannya yang dia makan setiap hari; dari mana makanan itu berasal'"
  }
]