[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-32. Maka hendaknya manusia merenungkan bagaimana Allah menciptakan makanannya yang menjadi pilar kehidupannya? Kami mencurahkan air hujan ke bumi, Kemudian membelah bumi dengan apa yang keluar darinya berupa berbagai jenis tanaman, Kami menumbuhkan biji-bijian padanya, Anggur dan rumput makanan hewan ternak, Pohon zaitun,dan pohon kurma, Kebun-kebun dan pohon besar, Buah-buahan dan padang savana, Kalian menikmatinya begitu juga ternak-ternak kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Hendaknya orang yang kafir terhadap Allah itu melihat kepada makanannya, bagaimana ia mendapatkannya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24-32. Hendaklah manusia mencermati makanan mereka, bagaimana Kami mengatur dan memudahkan mereka untuk mendapatkannya? Kami menurunkan hujan deras dari langit, kemudian Kami membelah tanah dan mengeluarkan tumbuhan; di bumi Kami telah menumbuhkan biji-bijian, pohon-pohon anggur, rerumputan, pohon zaitun, pohon kurma, dan kebun-kebun yang memiliki popohonan besar dan buah yang lebat; kalian dapat memanfaatkannya bagi diri kalian sendiri dan bagi binatang ternak kalian hingga beberapa waktu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَلْيَنظُرِ الْإِنسٰنُ إِلَىٰ طَعَامِهِۦٓ (maka hendaklah manusia itu memperhatikan makanannya) Yakni hendaklah manusia memperhatikan makanan yang menjadi sebab kehidupannya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Apakah belum terdengar dan dibacakan kepadamu firman Allah : { فَلْيَنْظُرِ الْإِنْسَانُ إِلَىٰ طَعَامِهِ } ? maka berapa kali kah kamu telah memperhatikan makanan yang kamu konsumsi ? cobalah untuk melakukan hal itu dan kamu akan merasakan sesuatu yang lebih dalam hatimu, berapa kali ayat ini telah kamu dengarkan ? kemudian kamu bersegera memperhatikan dan memikirkan bagaimana agungnya ciptaan Allah yang satu ini. Sesungguhnya untuk memperhatikan dan mengamati ciptaan Allah ini sangat mudah, akan tetapi pengaruhnya terhadap hati sangat besar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Hendaknya manusia berfikir dan introspeksi, bagaimana Allah menyediakan berbagai makanan untuk mereka sebagai bekal kelangsungan hidup mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Maka hendaklah manusia itu memperhatikan makanannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 24-32 Kemudian Allah mengarahkannya untuk merenung dan berpikir pada makanannya, bagaimanakah makanan itu sampai padanya setelah melalui berbagai fase dan dimudahkan oleh Allah untuknya seraya berfirman, “Maka hendaklah manusia itu memperhatikan makanannya, sesungguhnya Kami benar-benar telah mencurahkan air (dari langit).” Yakni Kami turunkan hujan ke bumi dengan lebat, “kemudian Kami belah bumi dengan sebaik-baiknya” untuk tumbuh-tumbuhan,, “lalu Kami tumbuhkan di bumi itu,” berbagai macam makanan lezat dan hidangan nikmat, “biji-bijian,” dan ini mencakup seluruh macam biji-bijian dengan berbagai macamnya, “anggur dan sayur-sayuran,” yaitu sayur-sayuran hijau, “zaitun dan pohon kurma.” Allah menyebutkan empat macam di atas secara khusus karena manfaatnya yang besar. “Dan kebun-kebun (yang) lebat,” yakni, kebun-kebun yang di dalamnya terdapat banyak pohon yang saling berjubel satu sama lain, “dan buah-buahan serta rumput-rumputan,” buah-buahan yang disenangi orang lain, seperti buah tin, anggur, dalima, dan lainnya. Sedangkan rumput-rumputan adalah makanan hewan dan binatang ternak. Karena itu Allah berfirman, “untuk kesenanganmu dan untuk binatang-binatang ternakmu,” yang diciptakan dan ditundukkan Allah bagi kalian. Maka siapa pun yang memperhatikan berbagai nikmat ini, wajib baginya bersyukur kepada Rabbnya dan mencurahkan daya untuk kembali padaNya dan mengarah pada ketaatan, serta membenarkan berita-beritaNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Maka hendaklah manusia itu memperhatikan makanannya, pada Ayat ini Allah ingin menjelaskan ayat-ayat-Nya yang mengisyaratkan pada karunia-Nya dan rahmat-Nya kepada hamba-Nya serta nikmat yang Ia limpahkan mereka, bagaimana Allah menganugerahkan kepada mereka rezeki mekanan yang dari mereka memperoleh gizi untuk tubuh mereka, darimana kah datangnnya makanan ini ? maka Allah pun menyebutnya dalam ayat-ayat berikutnya dari surah ini : { أَنَّا صَبَبْنَا الْمَاءَ صَبًّا , ثُمَّ شَقَقْنَا الْأَرْضَ شَقًّا , فَأَنْبَتْنَا فِيهَا حَبًّا } ( Sesungguhnya Kami benar-benar telah mencurahkan air (dari langit) , Kemudian Kami belah bumi dengan sebaik-baiknya , Lalu Kami tumbuhkan biji-bijian di bumi itu ) ['Abasa : 25-27 ] makanan yang kita makan datang dari peristiwa-peristiwa tersebut yang dengannya Allah menjadikan makanan itu ada."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian Allah ‘Azza Wa Jalla mengingatkan manusia dengan apa-apa yang Allah berikan berupa kenikmatan: فَلْيَنْظُرِ الْإِنْسَانُ إِلَى طَعَامِهِ “maka hendaklah manusia itu memperhatikan makanannya.” Maknanya: Makanannya dari mana datangnya? Siapa yang mendatangkannya? Apakah ada seseorang yang menciptakannya selain Allah ‘Azza Wa Jalla? Hendaknya manusia mengingat ayat-ayat Allah Tabaaraka wa Ta’ala ini berkaitan dengan ini semua: أَفَرَأَيْتُمْ مَا تَحْرُثُونَ (63) أَأَنْتُمْ تَزْرَعُونَهُ أَمْ نَحْنُ الزَّارِعُونَ (64) لَوْ نَشَاءُ لَجَعَلْنَاهُ حُطَامًا فَظَلْتُمْ تَفَكَّهُونَ (65) إِنَّا لَمُغْرَمُونَ (66) بَلْ نَحْنُ مَحْرُومُونَ \" Maka terangkanlah kepadaku tentang yang kamu tanam? Kamukah yang menumbuhkannya ataukah Kami yang menumbuhkannya? Kalau Kami kehendaki, benar-benar Kami jadikan dia kering dan hancur; maka jadilah kamu heran tercengang. (Sambil berkata): \"Sesungguhnya kami benar-benar menderita kerugian,\" (QS. Al-Waaqi’ah: 63-67) Siapakah yang menanam tumbuhan hingga merata, dan memudahkan untuk mendapatkannya sehingga menjadi makanan bagi kita? Dialah Allah ‘Azza Wa Jalla. Oleh karena itu, Allah berfirman: لَوْ نَشَاءُ لَجَعَلْنَاهُ حُطَامًا “Kalau Kami kehendaki, benar-benar Kami jadikan dia kering dan hancur ” Maknanya: Setelah kami munculkan tumbuhan itu, kami hancurkan sehingga kalian tidak bisa memanfaatkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 24: 24-32. Kemudian Allah menunjukkan kepada manusia untuk mentadabburi terhadap urusan (mereka) yang berhubungan dengan makanan yang ia makan, dan bagaimana (makanan tersebut) bisa sampai kepadanya setelah melalui proses yang beraneka ragam. Lalu Allah mengabarkan bahwasanya Ia mampu menurunkan air dari awan menuju ke bumi. Kemudian mengalirlah air tersebut yang (kemudian) mengeluarkan tumbuhan darinya. Kemudian Allah tumbuhkan (dari bumi) macam-macam biji-bijian seperti gandum dan syaiir. Dan padanya juga Allah tumbuhkan macam-macam anggur yang lezat, dan macam-macam sayuran hijau semisal selada, parsley, daun mint dan jarjir. Allah juga tumbuhkan pohon-pohon zaitun dan pohon kurma. Dan Allah tumbuhkan di bumi kebun-kebun dan ladang-ladang yang di dalamnya banyak pepohonan beraneka ragam. Dan juga Allah tumbuhkan macam-macam buah-buahan, dan oleh karena itu pulalah yang dengannya Allah jadikan rumput ada di dalamnya; Dan rumput kering yang ia adalah makanan bagi hewan liar dan ternak. Kemudian Allah kabarkan bahwa dijadikan ini semua (yaitu makanan) karena sebab manfaat bagi mereka. Kalian dapat mengambil manfaat dan menikmatinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya Allah Subhaanahu wa Ta'aala mengarahkan manusia agar memperhatikan dan memikirkan makanannya, dan bagaimana makanan itu sampai kepadanya setelah melalui banyak tahapan karena kemudahan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 24",
    "description": "Jika manusia bersikeras dengan keingkarannya, maka hendaklah manusia itu memperhatikan makanannya yang dia makan setiap hari; dari mana makanan itu berasal' 25. Kamilah yang menyediakan makanan itu bagi mereka melalui beberapa tahap. Kamilah yang telah mencurahkan air hujan yang melimpah dari arah langit, yang berasal dari uap air yang membentuk awan yang menggumpal dan saling bertumpuk."
  }
]