[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Apa yang membuatmu tahu hakikat urusannya? bisa jadi pertanyaannya menyucikan dan membersihkan jiwanya Atau dia mendapatkan tambahan pelajaran dan nasihat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Tahukah kamu -wahai Rasul- bisa jadi orang buta ini ingin membersihkan diri dari dosa-dosanya?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3-4. Hai Rasulullah, bagaimana menurutmu jika dengan petunjukmu dia dapat menyucikan jiwa dengan petunjuk agama Islam atau mendapat pelajaran dari perkataanmu dan mengambil manfaat dari pelajaran itu?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. وَمَا يُدْرِيكَ (Tahukah kamu) Hai Muhammad. لَعَلَّهُۥ يَزَّكَّىٰٓ (barangkali ia ingin membersihkan dirinya (dari dosa)) Yakni barangkali orang buta itu hendak menyucikan diri dari dosa-dosanya dengan amal shalih lewat apa yang akan dia pelajari darimu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Bukankah Engkau sudah diajarkan wahai Nabi, barangkali seorang yang buta itu terbebas dari dosa setelah Engkau mendengar petunjuk darimu? Kemudian imannya bertambah dan dia semakin rajin beramal kebaikan?"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apakah kamu mengetahui bahwa boleh jadi dia ingin menyucikan dirinya} menyucikan diri dari dosa-dosanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-10 Sebab turunnya ayat-ayat mulia ini adalah seorang mukmin buta datang seraya bertanya kepada Nabi dan belajar dari beliau, kemudian ada orang kaya juga datang. Nabi amat ingin menunjukkan manusia, hanya saja beliau lebih condong pada orang kaya dan berpaling dari si buta lagi miskin demi mengharap agar si kaya mendapat petunjuk dan demi agar si kaya menyucikan hatinya. Lalu Allah menegurnya dengan tegurann lembut ini seraya berfirman; “dia (Muhammad) bermuka masam” di wajah beliau, “dan berpaling” dengan raganya karena orang buta mendatanginya. Kemudian Allah menyebutkan manfaat menyambutnya seraya berfirman, “Tahukah kamu barangkali ia,” yakni orang buta tersebut, “ingin membersihkan dirinya (dari dosa),” yaitu membersihkan diri dari akhlak tercela dan ingin berakhlak terpuji, “atau dia (ingin) mendapatkan pengajaran lalu pengajaran itu memberi manfaat kepadanya,” yakni, mendapatkan pengajaran tentang sesuatu sehingga ia mendapatkan manfaat dari pelajaran itu. Ini adalah manfaat besar dan itulah maksud diutusnya para rasul, maksud dari petuah orang yang memberi nasihat dan maksud dari peringatan orang yang memberi peringatan. Sambutanmu pada orang orang yang datang sendiri seraya memerlukanmu itu lebih layak dan wajib, sedangkan berpalingnya engkau pada orang kaya yang tidak memerlukanmu yang tidak mau bertanya dan meminta fatwa karena tidak memiliki keinginan pada kebaikan dan engkau tinggalkan orang lebih utama itu tidak layak bagimu. Tugasmu hanyalah memberi pengajaran, bila pun ia tidak mau mengambil pelajaran dengan membersihkan diri, engkau tidak akan dimintai pertanggung jawab atas perbuatan buruk yang ia lakukan. Hal ini menunjukan pada kaidah masyhur; sesuatu yang telah diketahui tidak ditinggalkan untuk sesuatu yang belum jelas. Dan menyambut murid yang memerlukan dan penuh kemauan lebiih layak dari yang lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kamu tidak tahu wahai Rasul bahwa kedatanga laki-laki buta ini bertujuan untuk mengamil darimu sesuatu bermanfaat bagi kesucian akhlaqnya, atau mengambil pelajaran dari akhlakmu , dia datang untuk mensucikan dirinya ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا يُدْرِيكَ “Tahukah kamu” Maknanya: Apakah yang meragukanmu tentang orang buta ini yang ingin mensucikan dirinya dan memperkuat imannya mungkin dia Ibnu Ummi Maktum يَزَّكَّى Maknanya: ia hendak membersihkan diri dari dosa-dosa dan akhlak yang tidak pantas pada orang semisal ia. Jika ini yang diharapkan orang itu maka ia lebih pantas untuk dilirik."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 3: 1-4. Pada awal-awal surat ini (ditujukan) sebagai petunjuk untuk Nabi dalam bergaul dengan orang-orang yang lemah dari kalangan kaum muslimin. Allah menjelaskan bahwa pada wajah Rasul nampak perubahan dan bermuka masam ketika telah datang padanya seorang yang buta bernama Abdullah bin Ummi Maktum yang menanyakan kepadanya berkenaan dengan urusan agama; Maka Rasul berpaling darinya karena Abdullah Ummi Maktum memotong ucapan Rasul ketika beliau sibuk berdakwah kepada pembesar-pembasar Quraisy yang keras kepala semisal : Utbah, Syaibah, Abu Jahl, dan Walid bin Mughirah yang Rasul mendambakan keislaman pada mereka. Kemudian Allah tegur Nabi dengan berkata : Tidaklah engkau (wahai Nabi) mengetahui dirinya dan dikabarkan berkenaan dengan keadaan orang yang buta ini, maka semoga ia dengan bertanya kepadamu aka menjadikan dirinya suci dari dosa-dosanya. Atau memberikan manfaat dengan apa yang ia dengar darimu kemudian ia berpikir dan menerangi hatinya dengan cahaya keimanan. Adapun pembesar-pembesar itu yang justru wajahnya berpaling, pura-pura buta dengan apa yang engkau dakwahkan, maka sungguh engkau telah menyampaikan dakwah kepada mereka dan tidak ada kewajiban bagimu kecuali hanya menyampaikan, dan sungguh telah engkau kerjakan. Dan Allah catat dengan firman-Nya : “Abasa wa Tawallaa”. Dan Allah tidak mengatakan : Engkau Muhammad bermuka masam dan telah berpaling, yang seolah-olah berbicara dengan seseorang yang lain (selain nabi). Karena maksud Allah hanyalah mengingatkan dan memberi petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menyebutkan faedah memperhatikan orang itu. Dari dosa atau dari akhlak yang tercela."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 3",
    "description": "Wahai nabi Muhammad, kami menegur sikapmu yang demikian karena tahukah engkau barangkali dia datang menghadapmu untuk minta pengajaran darimu sebab dia ingin menyucikan dirinya dari dosa dan kesalahan masa lalunya' 4. Atau tahukah engkau bila dia datang karena dia ingin mendapatkan pengajaran Al-Qur'an dan ajaran islam darimu, yang memberi manfaat kepadanya sehingga dia lebih tekun beribadah, beramal saleh, dan menjadi pengikut setiamu'."
  }
]