[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-32. Maka hendaknya manusia merenungkan bagaimana Allah menciptakan makanannya yang menjadi pilar kehidupannya? Kami mencurahkan air hujan ke bumi, Kemudian membelah bumi dengan apa yang keluar darinya berupa berbagai jenis tanaman, Kami menumbuhkan biji-bijian padanya, Anggur dan rumput makanan hewan ternak, Pohon zaitun,dan pohon kurma, Kebun-kebun dan pohon besar, Buah-buahan dan padang savana, Kalian menikmatinya begitu juga ternak-ternak kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Dan Kami tumbuhkan padanya berbagai kebun yang banyak pepohonannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. وَحَدَآئِقَ غُلْبًا (kebun-kebun (yang) lebat) Yakni pohon kurma yang berbuah lebat dan memiliki pangkal batang yang tebal."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29-30. Juga pohon zaitun dan kurma, dan kebun-kebun yang dipenuhi dengan pepohonan yang lebat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kebun-kebun} kebun-kebun {rindang} banyak pepohonannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 24-32 Kemudian Allah mengarahkannya untuk merenung dan berpikir pada makanannya, bagaimanakah makanan itu sampai padanya setelah melalui berbagai fase dan dimudahkan oleh Allah untuknya seraya berfirman, “Maka hendaklah manusia itu memperhatikan makanannya, sesungguhnya Kami benar-benar telah mencurahkan air (dari langit).” Yakni Kami turunkan hujan ke bumi dengan lebat, “kemudian Kami belah bumi dengan sebaik-baiknya” untuk tumbuh-tumbuhan,, “lalu Kami tumbuhkan di bumi itu,” berbagai macam makanan lezat dan hidangan nikmat, “biji-bijian,” dan ini mencakup seluruh macam biji-bijian dengan berbagai macamnya, “anggur dan sayur-sayuran,” yaitu sayur-sayuran hijau, “zaitun dan pohon kurma.” Allah menyebutkan empat macam di atas secara khusus karena manfaatnya yang besar. “Dan kebun-kebun (yang) lebat,” yakni, kebun-kebun yang di dalamnya terdapat banyak pohon yang saling berjubel satu sama lain, “dan buah-buahan serta rumput-rumputan,” buah-buahan yang disenangi orang lain, seperti buah tin, anggur, dalima, dan lainnya. Sedangkan rumput-rumputan adalah makanan hewan dan binatang ternak. Karena itu Allah berfirman, “untuk kesenanganmu dan untuk binatang-binatang ternakmu,” yang diciptakan dan ditundukkan Allah bagi kalian. Maka siapa pun yang memperhatikan berbagai nikmat ini, wajib baginya bersyukur kepada Rabbnya dan mencurahkan daya untuk kembali padaNya dan mengarah pada ketaatan, serta membenarkan berita-beritaNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan kebun-kebun serta taman-taman yang didalamnya ditumbuhi dengan pepohonan yang rindang, besar, dan kuat."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَحَدَائِقَ غُلْبًا \" kebun-kebun (yang) lebat, \" : حَدَائِقَ [Hada-iq] bentuk jamak untuk: حَدِيْقَة [Hadiqatun] yang artinya kebun, maksud dalam ayat ini perkebunan yang rimbun pepohonannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 30: 24-32. Kemudian Allah menunjukkan kepada manusia untuk mentadabburi terhadap urusan (mereka) yang berhubungan dengan makanan yang ia makan, dan bagaimana (makanan tersebut) bisa sampai kepadanya setelah melalui proses yang beraneka ragam. Lalu Allah mengabarkan bahwasanya Ia mampu menurunkan air dari awan menuju ke bumi. Kemudian mengalirlah air tersebut yang (kemudian) mengeluarkan tumbuhan darinya. Kemudian Allah tumbuhkan (dari bumi) macam-macam biji-bijian seperti gandum dan syaiir. Dan padanya juga Allah tumbuhkan macam-macam anggur yang lezat, dan macam-macam sayuran hijau semisal selada, parsley, daun mint dan jarjir. Allah juga tumbuhkan pohon-pohon zaitun dan pohon kurma. Dan Allah tumbuhkan di bumi kebun-kebun dan ladang-ladang yang di dalamnya banyak pepohonan beraneka ragam. Dan juga Allah tumbuhkan macam-macam buah-buahan, dan oleh karena itu pulalah yang dengannya Allah jadikan rumput ada di dalamnya; Dan rumput kering yang ia adalah makanan bagi hewan liar dan ternak. Kemudian Allah kabarkan bahwa dijadikan ini semua (yaitu makanan) karena sebab manfaat bagi mereka. Kalian dapat mengambil manfaat dan menikmatinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 30",
    "description": "27-31. Lalu di sana kami tumbuhkan biji-bijian dengan segala macam dan ragamnya, seperti biji padi dan gandum. Dan kami tumbuhkan pula di sana anggur dan sayur-sayuran, dan demikian pula zaitun dan pohon kurma yang sangat bermanfaat bagi kesehatan. Dan kami tumbuhkan juga dengan air hujan itu kebun-kebun yang rindang dan menyejukkan pandangan, menjadi tempat tinggal ber-bagai binatang, dan memproduksi oksigen. Dan dengan air hujan itu pula kami tumbuhkan pohon penghasil buah-buahan yang beraneka warna serta rerumputan"
  }
]