[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "24-32. Maka hendaknya manusia merenungkan bagaimana Allah menciptakan makanannya yang menjadi pilar kehidupannya? Kami mencurahkan air hujan ke bumi, Kemudian membelah bumi dengan apa yang keluar darinya berupa berbagai jenis tanaman, Kami menumbuhkan biji-bijian padanya, Anggur dan rumput makanan hewan ternak, Pohon zaitun,dan pohon kurma, Kebun-kebun dan pohon besar, Buah-buahan dan padang savana, Kalian menikmatinya begitu juga ternak-ternak kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Agar kalian dan hewan ternak kalian memanfaatkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31-32. Juga berbagai buah yang bermacam-macam jenis dan warna. Rerumputan untuk serangga. Allah menciptakan itu semua untuik kebutuhan kalian dan hewan ternak kalian"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{untuk kenikmatan bagi kalian dan hewan-hewan ternak kalian"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 24-32 Kemudian Allah mengarahkannya untuk merenung dan berpikir pada makanannya, bagaimanakah makanan itu sampai padanya setelah melalui berbagai fase dan dimudahkan oleh Allah untuknya seraya berfirman, “Maka hendaklah manusia itu memperhatikan makanannya, sesungguhnya Kami benar-benar telah mencurahkan air (dari langit).” Yakni Kami turunkan hujan ke bumi dengan lebat, “kemudian Kami belah bumi dengan sebaik-baiknya” untuk tumbuh-tumbuhan,, “lalu Kami tumbuhkan di bumi itu,” berbagai macam makanan lezat dan hidangan nikmat, “biji-bijian,” dan ini mencakup seluruh macam biji-bijian dengan berbagai macamnya, “anggur dan sayur-sayuran,” yaitu sayur-sayuran hijau, “zaitun dan pohon kurma.” Allah menyebutkan empat macam di atas secara khusus karena manfaatnya yang besar. “Dan kebun-kebun (yang) lebat,” yakni, kebun-kebun yang di dalamnya terdapat banyak pohon yang saling berjubel satu sama lain, “dan buah-buahan serta rumput-rumputan,” buah-buahan yang disenangi orang lain, seperti buah tin, anggur, dalima, dan lainnya. Sedangkan rumput-rumputan adalah makanan hewan dan binatang ternak. Karena itu Allah berfirman, “untuk kesenanganmu dan untuk binatang-binatang ternakmu,” yang diciptakan dan ditundukkan Allah bagi kalian. Maka siapa pun yang memperhatikan berbagai nikmat ini, wajib baginya bersyukur kepada Rabbnya dan mencurahkan daya untuk kembali padaNya dan mengarah pada ketaatan, serta membenarkan berita-beritaNya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Kemudian Allah menjelaskan hikmah dari penciptaan itu semu : { مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ } Kami telah mengeluarkan dari bumi tumbuh-tumbuhan dan buah-buahan agar kalian menikmatinya wahai manusia, kalian bersenang-senang dengannya, dan juga kami tumbuhkan berbagai macam jenis rerumputan dan buah-buahan untuk kalian beri makan kepada hewan ternak kalian, Allah memberikan kita dan hewan ternak yang kita miliki apa yang bisa kita makan untuk menambah gizi dan kekuatan bagi tubuh kita, semua ini adalah nikmat dari Allah bagi makhluk-Nya yang harus disyukuri, yang harus direnungkan dan difikirkan tentangnya, semua itu adalah bukti akan keagungan Allah dan kekuasaann-Nya serta kasih sayang-Nya kepada seluruh makhluk-Nya, agar mereka merendahkan diri dihadapan Tuhannya dan mengilhlaskan segala peribadatannya kepada Allah, karena semua kenikmatan ini tidak akan terwujud kecuali dengan izin dan kekuasaan-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "مَتَاعًا لَكُمْ وَلِأَنْعَامِكُمْ \" untuk kesenanganmu dan untuk binatang-binatang ternakmu. \" Yakni: Kami melakukan itu semua adalah bentuk pemberian kenikmatan, yang dapat memenuhi kebutuhan kalian, dan kalian menikmatinya untuk menyantap buah-buahan dengan nikmat-nikmat tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 32: 24-32. Kemudian Allah menunjukkan kepada manusia untuk mentadabburi terhadap urusan (mereka) yang berhubungan dengan makanan yang ia makan, dan bagaimana (makanan tersebut) bisa sampai kepadanya setelah melalui proses yang beraneka ragam. Lalu Allah mengabarkan bahwasanya Ia mampu menurunkan air dari awan menuju ke bumi. Kemudian mengalirlah air tersebut yang (kemudian) mengeluarkan tumbuhan darinya. Kemudian Allah tumbuhkan (dari bumi) macam-macam biji-bijian seperti gandum dan syaiir. Dan padanya juga Allah tumbuhkan macam-macam anggur yang lezat, dan macam-macam sayuran hijau semisal selada, parsley, daun mint dan jarjir. Allah juga tumbuhkan pohon-pohon zaitun dan pohon kurma. Dan Allah tumbuhkan di bumi kebun-kebun dan ladang-ladang yang di dalamnya banyak pepohonan beraneka ragam. Dan juga Allah tumbuhkan macam-macam buah-buahan, dan oleh karena itu pulalah yang dengannya Allah jadikan rumput ada di dalamnya; Dan rumput kering yang ia adalah makanan bagi hewan liar dan ternak. Kemudian Allah kabarkan bahwa dijadikan ini semua (yaitu makanan) karena sebab manfaat bagi mereka. Kalian dapat mengambil manfaat dan menikmatinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala menciptakan semua itu dan menundukkannya untukmu. Oleh karena itu, hendaknya kamu bersyukur kepada Allah, membenarkan berita-berita yang disampaikan-Nya serta rela mengorbankan pikiran dan tenagamu untuk menjalankan perintah-perintah-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 32",
    "description": "Kami tumbuhkan itu semua untuk kesenanganmu agar hidupmu makmur dan sejahtera, dan untuk kesenangan hewan-hewan ternakmu. Dengan itu semua kamu hidup tenang dan tidak bersusah payah. Kamu hanya perlu emanfaatkannya, menjaga kelestariannya, dan mengimani penciptanya sebagai bentuk rasa syukurmu kepada-Nya. 33. Kenikmatan-kenikmatan itu kelak akan diminta pertanggungjawabannya pada hari kiamat. Maka apabila datang suara tiupan sangkakala kedua yang memekakkan telinga dan menjadi penanda bangkitnya manusia dari kubur, ."
  }
]