[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-37. Saat teriakan kebangkitan pada hari kiamat datang yang karena suaranya keras terdengar oleh semua telinga, Saat itu manusia berlari dari saudaranya, Ibu dan bapaknya, Istri dan anak-anaknya. Setiap orang pada hari itu punya urusan yang membuatnya tidak mengurusi orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Maka jika tiba suara dahsyat yang memekakkan telinga yaitu tiupan sangkakala kedua."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-37. Dan jika suara keras yang memekakkan telinga telah terjadi pada hari kiamat, hari ketika seseorang menghindar dari saudara, orangtua, istri, dan anak-anaknya, karena setiap mereka memiliki urusan dan kepentingan yang menyibukkannya dari orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَفٰكِهَةً وَأَبًّا (dan buah-buahan serta rumput-rumputan) Makna (الأب) yakni segala tumbuhan yang tidak digunakan manusia untuk makanan dan tidak pula mereka tanam, seperti rumput dan tanaman lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Apabila hari kiamat telah datang dan terdengar suara sangkakala yang memekakkan telinga, sehingga akibat suara itu mereka tidak bisa mendengar"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apabila datang suara yang memekakkan} tiupan kedua yang membuat tuli pendengaran karena kengeriannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan kemudian Allah menjelaskan keadaan akhir dari kehidupan didunia ini, bahwa semua kenikmatan-kenikmatan yang telah disebutkan pada ayat-ayat sebelumnya akan tiba waktunya untuk berakhir.. kapan ? : Yaitu ketika datangnya suara yang menghancurkan dunia beserta segala isinya, itulah hari kiamat yang ditandai dengan adanya suara tiupan sangkakala yang suarannya sangat kuat dan dapat menghilangkan pendengaran, dan apakah yang terjadi ketika kiamat itu tiba ? { يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ , وَأُمِّهِ وَأَبِيهِ , وَصَاحِبَتِهِ وَبَنِيهِ , لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ } ( Pada hari ketika manusia lari dari saudaranya, , Dari ibu dan bapaknya , Dari istri dan anak-anaknya , Setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya. ) Itulah yang akan terjadi ketika kiamat itu terjadi, semua keadaan akan menjadi hancur mengerikan dan mankutkan, setiap diri tidak akan mengurusi kecuali tentangnnya masing-masing, tidak akan menyibukkan diri dengan urusan orang terdekatnya, bahkan ketika dia melihat saudaranya dan ibunya ataupun ayahnya tiada kepedulian kepada mereka sama sekali, tiada seorang pun yang dapat menolongnya dan tidak pula dapat memberi pertolongan kepada orang lain, semuanya lari dari apa yang dicintainya; karena tidak mampu untuk membantunya, itulah peristiwa yang maha dahsyat, seorang pun tidak menginginkan datang kepadanya orang lain karena dia sedang mencari tempat untuk melarikan diri, akan tetapi apakah baginya tempat untuk menyelamatkan diri ?"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "Kemudian setelah Allah ‘Azza Wa Jalla menyebutkan manusia dengan keadaannya sejak diciptakan dari nutfah, kemudian menerab di dunia, hidup lalu ia mati, Dia meyebutkan keadaan akhirat dalam pirman-Nya: فَإِذَا جَاءَتِ الصَّاخَّةُ \" Dan apabila datang suara yang memekakkan \" Maknanya: Teriakan besar yang memekakkan pendengaran-pendengaran, inilah peniupan sangkakala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 33: 33-37. Kemudian Allah tutup surat ini dengan kejadian-kejadian pada hari kiamat, Allah berkata : Dan ketika datang (secara pasti) hari kiamat dengan suara yang memekikkan telinga, maka pada hari itu (orang-orang kafir) akan menyesal. Pada hari semua manusia berlarian dari seseorang yang dicintainya. Semuanya (seolah-olah) berkata : “Yang terpenting adalah diriku…diriku”. Ia lari dari saudara-saudaranya, ibunya, bapaknya, istrinya, dan anak-anaknya. Setiap manusia pada hari itu sibuk dengan urusan masing-masing."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 33",
    "description": "Kenikmatan-kenikmatan itu kelak akan diminta pertanggungjawabannya pada hari kiamat. Maka apabila datang suara tiupan sangkakala kedua yang memekakkan telinga dan menjadi penanda bangkitnya manusia dari kubur, 34-37. Yaitu pada hari itu manusia lari dari orang yang dicintainya, seperti saudaranya, dan dari ibu dan bapaknya yang melindungi dan mengayominya, dan dari istri dan anak-anaknya yang selalu bersamanya, maka setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. Semua ingin menyelamatkan diri sendiri tanpa menghiraukan orang lain. Mereka takut dan cemas atas apa yang terjadi di hadapan mereka dan khawatir akan nasib mereka."
  }
]