[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-37. Saat teriakan kebangkitan pada hari kiamat datang yang karena suaranya keras terdengar oleh semua telinga, Saat itu manusia berlari dari saudaranya, Ibu dan bapaknya, Istri dan anak-anaknya. Setiap orang pada hari itu punya urusan yang membuatnya tidak mengurusi orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Pada hari itu seseorang lari dari saudaranya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34-36. وَأُمِّهِۦ وَأَبِيهِ وَصٰحِبَتِهِۦ وَبَنِيهِ يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ (pada hari ketika manusia lari dari saudaranya serta ibu dan bapaknya dan istri dan anak-anaknya) Mereka adalah kerabat terdekat dan paling disayang dan dikasihi. Tidak mungkin berlari dari mereka melainkan karena suatu kejadian yang mengerikan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "34-35. Diawali dengan saudara, diantara kebiasaan orang Arab mereka memulai penyebutan sesuatu karena pentingnya kedudukan yang ada pada sesuatu itu, dan hikmahnya adalah bahwasanya memulai sesuatu dapat dilakukan pada kedudukan apapun dengan menyesuaikan keadaannya, oleh karena itu terkadang memulai suatu perkara dilakukan dengan mengutamakan derajat yang tinggi, dan terkadang pula dilakukan dengan mengutamakan derajat yang rendah, adapun pada perkara yang disebutkan dalam ayat ini dimulai dari derajat yang rendah, karena tujuan utamanya adalah menjelaskan bagaimana larinya sesorang dari kerabatnya dengan mengurutkan dari derajat yang paling rendah secara bertahap, adapun jika disebutkan dari kerabat yang paling dekat maka tatkala disebutkan kerabat yang paling jauh setelahnya tidak menggambarkan faidah yang banyak, karena dapat disimpulkan bahwasanya sesorang jika lari dan menjauh dari kerabatnya yang paling dekat, maka tentulah dia akan melakukan hal yang sama pada kerabatnya yang paling jauh."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-36. Hari itu adalah hari ketika manusia meninggalkan saudaranya, karena tidak mau mau dimintai tolong. Mereka juga meninggalkan ayah, ibu, istri, dan anak-anak laki-lakinya. Meskipun yang hubungannya paling dekat dengan mereka. Mereka semua sibuk dengan urusannya sendiri untuk menyelamatkan diri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{pada hari itu manusia lari dari saudaranya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Pada hari terjadinya peristiwa itu manusia berlari meninggalkan saudaranya. Kenapa Allah memulai dari saudaranya sebelum bapaknya dan ibunya dan istrinya ? Kaerena seseorang ketika menghadapi kesusahan maka saudaranya lah yang membantunya, Allah menjadikan pada diri seseorang kekuatan untuk membantu saudaranya, akan tetapi pada hari terjadinya kiamat seorang pun tidak mampu menyelamatkan saudaranya, ketika didunia dan kehidupan masih berjalan dengan normal mereka bisa melakukan apapun untuk saudaranya, akan tetapi setelah kehidupan itu berakhir dan berpindah ke alam lain semuanya tidak dapat dilakukan kecuali sesorang hanya bisa mengurusi dirinya sendiri."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ \" pada hari ketika manusia lari dari saudaranya, \" Dari saudara kandungnya, saudara sebapak atau seibu"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 34: 33-37. Kemudian Allah tutup surat ini dengan kejadian-kejadian pada hari kiamat, Allah berkata : Dan ketika datang (secara pasti) hari kiamat dengan suara yang memekikkan telinga, maka pada hari itu (orang-orang kafir) akan menyesal. Pada hari semua manusia berlarian dari seseorang yang dicintainya. Semuanya (seolah-olah) berkata : “Yang terpenting adalah diriku…diriku”. Ia lari dari saudara-saudaranya, ibunya, bapaknya, istrinya, dan anak-anaknya. Setiap manusia pada hari itu sibuk dengan urusan masing-masing."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 34",
    "description": "34-37. Yaitu pada hari itu manusia lari dari orang yang dicintainya, seperti saudaranya, dan dari ibu dan bapaknya yang melindungi dan mengayominya, dan dari istri dan anak-anaknya yang selalu bersamanya, maka setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. Semua ingin menyelamatkan diri sendiri tanpa menghiraukan orang lain. Mereka takut dan cemas atas apa yang terjadi di hadapan mereka dan khawatir akan nasib mereka"
  }
]