[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-37. Saat teriakan kebangkitan pada hari kiamat datang yang karena suaranya keras terdengar oleh semua telinga, Saat itu manusia berlari dari saudaranya, Ibu dan bapaknya, Istri dan anak-anaknya. Setiap orang pada hari itu punya urusan yang membuatnya tidak mengurusi orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Dan lari dari istri dan anak-anaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34-36. Hari itu adalah hari ketika manusia meninggalkan saudaranya, karena tidak mau mau dimintai tolong. Mereka juga meninggalkan ayah, ibu, istri, dan anak-anak laki-lakinya. Meskipun yang hubungannya paling dekat dengan mereka. Mereka semua sibuk dengan urusannya sendiri untuk menyelamatkan diri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Serta istri} istrinya {dan anak-anaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "{ وَصَاحِبَتِهِ } dan istrinya ( وَبَنِيهِ ) dan juga anaknya yang selama ini mereka sayangi, dan anak yang menyayangi orang tuanya, pada hari itu mereka sedikitpun tidak mampu menolong satu sama lainnya, pada hari itu tidak ada lagi yang saling mengasihi dan saling menyayangi. Bahkan para Nabi pun ketika keadaan semakin genting yang dihadapi oleh manusia di padang mahsyar dan mereka pun datang berbondong-bondong kepada para Nabi untuk meminta Syafaat yang diberikan oleh Allah agar beban yang mereka hadapi dapat berkurang, akan tetapi setiap mereka mengatakan : diriku, diriku ; bahkan Nabi Isa 'Alaihissalam berkata kepada Rabbnya : Diriku, diriku, aku tidak menanyakan kepada-Mu tentang maryam Ibuku. Dan ketika mereka sampai kepada Nabi Muhammad, mereka pun meminta kepadanya Syafaat, bukan agar mereka selamat dari siksaan api neraka, atau agar mereka dapat masuk kedalam surga, melainkan agar mereka dapat selamat dari peristiwa padang mahsyar, agar mereka dapat menjalani persidangan padang mahsyar dengan selamat, itulah permintaan mereka, maka Nabi Muhammad pun mengatakan : Inlah bagianku. Kemudian Muhammad pun datang kepada Tuhannya dan tunduk bersujud dihadapan-Nya, dan berdoa kepada-Nya memuji dan mengagungkan-Nya sampai Tuhannya mengatakan : Wahai Muhammad angkatlah kepalamu, dan katakanlah apa yang ingin kamu katakan niscaya kamu akan diterima, dan berilah syafaat niscaya kamu akan dilapangkan dalam hal itu, dan Allah pun mengizinkannya untuk memberi syafaat, dan ketika itu Muhammad pun memberi syafaat kepada siapa yang meminta kepadanya agar diringankan beban yang dihadapi di padang mahsyar itu, agar mereka langsung disidang dan menuju tempat yang layak bagi mereka di surga atau neraka, Allah pun menerima syafaatnya, pada hari itu situasi dan keadaan sangat mencekam dan menakutkan, tidak satupun dari manusia yang dapat membayangkannya, dan kita manusia didunia ini seakan-akan lalai dari mengingatnya, seakan-akan peristiwa tidak akan terjadi dihadapan kita, dan seakan-akan kita tidak akan pergi ketempat itu dan menuju tempat lain agar selamat dari ketakutan yang akan terjadi pada har itu, akan tetapi sungguh semua ini darurat pasti akan terjadi dan setiap kita harus mempersiapkan diri untuknya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَصَاحِبَتِهِ Istrinya وَبَنِيهِ \" dan anak-anaknya. \"Mereka semua adalah orang-orang terdekatnya, yang paling dicintai, ia lari dari mereka semua. Ulama mengatakan: Ia lari dari orang-orang terdekatnya agar mereka tidak menuntutnya dari apa-apa yang telah ia lalaikan berkenaan hak mereka, berupa adab dan yang lainnya. Karena setiap orang pada hari itu tidak suka selamanya jika ada seseorang yang menuntut berkenaan sesuatu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 36: 33-37. Kemudian Allah tutup surat ini dengan kejadian-kejadian pada hari kiamat, Allah berkata : Dan ketika datang (secara pasti) hari kiamat dengan suara yang memekikkan telinga, maka pada hari itu (orang-orang kafir) akan menyesal. Pada hari semua manusia berlarian dari seseorang yang dicintainya. Semuanya (seolah-olah) berkata : “Yang terpenting adalah diriku…diriku”. Ia lari dari saudara-saudaranya, ibunya, bapaknya, istrinya, dan anak-anaknya. Setiap manusia pada hari itu sibuk dengan urusan masing-masing."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 36",
    "description": "34-37. Yaitu pada hari itu manusia lari dari orang yang dicintainya, seperti saudaranya, dan dari ibu dan bapaknya yang melindungi dan mengayominya, dan dari istri dan anak-anaknya yang selalu bersamanya, maka setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. Semua ingin menyelamatkan diri sendiri tanpa menghiraukan orang lain. Mereka takut dan cemas atas apa yang terjadi di hadapan mereka dan khawatir akan nasib mereka"
  }
]