[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-37. Saat teriakan kebangkitan pada hari kiamat datang yang karena suaranya keras terdengar oleh semua telinga, Saat itu manusia berlari dari saudaranya, Ibu dan bapaknya, Istri dan anak-anaknya. Setiap orang pada hari itu punya urusan yang membuatnya tidak mengurusi orang lain."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Masing-masing saat itu mempunyai perkara yang menjadikannya lupa terhadap orang lain karena dahsyatnya kepedihan pada Hari itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34-36. وَأُمِّهِۦ وَأَبِيهِ وَصٰحِبَتِهِۦ وَبَنِيهِ يَوْمَ يَفِرُّ الْمَرْءُ مِنْ أَخِيهِ (pada hari ketika manusia lari dari saudaranya serta ibu dan bapaknya dan istri dan anak-anaknya) Mereka adalah kerabat terdekat dan paling disayang dan dikasihi. Tidak mungkin berlari dari mereka melainkan karena suatu kejadian yang mengerikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Setiap orang mempunyai kesibukan masing-masing untuk menyelamatkan diri mereka sendiri. Sehingga mereka meninggalkan orang lain, bahkan keluarganya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya} menyibukkannya dari urusan orang lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Setiap orang dari mereka yaitu : saudara, ayah, ibu, istri, dan anak-anak, akan sibuk dengan urusan diri mereka sendiri, dan tidak dapat meminta pertolongan kepada orang lain, keadaan yang mengerikan itulah yang menyebabkan mereka sibuk dengan urusan diri mereka sendiri, Semoga Allah memberi kita keselamatan."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "لِكُلِّ امْرِئٍ مِنْهُمْ يَوْمَئِذٍ شَأْنٌ يُغْنِيهِ \" Setiap orang dari mereka pada hari itu mempunyai urusan yang sangat menyibukkannya. \" Setiap manusia tersibukkan dengan dirinya sendiri, tidak melihat yang lain, oleh karena itu saat Nabi shallallaahu ‘alaihi wa sallam bersabda: إِنَّكُمْ تُحْشَرُونَ يَوْمَ الْقِيَامَةِ حُفَاةً عُرَاةً غُرْلاً \"Sesungguhnya kalian akan dikumpulkan di hari kiamat dalam keadaan, tak beralas kaki, tak berbusana dan tidak dikhitan.\" ‘Aisyah radhiyallaahu ‘anha berkata? Laki-laki dan perempuan saling memandang satu sama lain? Nabi shallallaahu ‘alaihi wa sallam bersabda: اَلأَمْرُ أَعْظَمُ مِنْ أَنْ يَنظُرَ بَعْضُهُمْ إِلَى بَعْضٍ “ Perkara saat itu lebih berat dari pada saling melihat satu sama lain ”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 37: 33-37. Kemudian Allah tutup surat ini dengan kejadian-kejadian pada hari kiamat, Allah berkata : Dan ketika datang (secara pasti) hari kiamat dengan suara yang memekikkan telinga, maka pada hari itu (orang-orang kafir) akan menyesal. Pada hari semua manusia berlarian dari seseorang yang dicintainya. Semuanya (seolah-olah) berkata : “Yang terpenting adalah diriku…diriku”. Ia lari dari saudara-saudaranya, ibunya, bapaknya, istrinya, dan anak-anaknya. Setiap manusia pada hari itu sibuk dengan urusan masing-masing."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu keselamatan dirinya. Ketika itu, manusia terbagi menjadi dua golongan; golongan yang berbahagia dan golongan yang sengsara. Golongan yang berbahagia wajah mereka berseri-seri, sedangkan golongan yang sengsara, wajah mereka tertutup debu dan kegelapan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 37",
    "description": "34-37. Yaitu pada hari itu manusia lari dari orang yang dicintainya, seperti saudaranya, dan dari ibu dan bapaknya yang melindungi dan mengayominya, dan dari istri dan anak-anaknya yang selalu bersamanya, maka setiap orang dari mereka pada hari itu mempunyai urusan yang menyibukkannya. Semua ingin menyelamatkan diri sendiri tanpa menghiraukan orang lain. Mereka takut dan cemas atas apa yang terjadi di hadapan mereka dan khawatir akan nasib mereka. 38-39. Pada hari itu ada wajah-wajah yang berseri-seri. Itulah muka orang-orang yang pada saat di dunia beriman dan beramal saleh. Mereka tertawa dan bergembira ria bersama kaum mukmin yang lain. Mereka tidak takut dan khawatir akan nasib mereka karena yakin Allah akan memberi balasan dengan sebaik-baiknya."
  }
]