[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "38-40. Wajah orang-orang yang mendapatkan kenikmatan di hari itu bersinar, Bahagia dan bersuka cita, Sedangkan wajah penghuni neraka jahim gelap dan hitam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Tertawa gembira dengan apa yang telah disediakan oleh Allah dari rahmat-Nya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "38-41 1 ) Allah mendahulukan dalam ( surah 'Abasa ) penyebutan wajah-wajah yang berseri sebelum menyebutkan wajah-wajah yang dipenuhi dengan debut, sedangkan di ( surah An-Nazi'at ) Allah mendahulukan penyebutan Ahli syahwat sebebelum menyebutkan Ahli hidayah, dan maksud dari keduanya adalah; karena surah 'Abasa diawali dengan mengutamakan kedudukan salah satu orang terbaik dari kaum mukminin, dan merendahkan urusan yang sedang berlangsung pada salah satu tokoh utama kaum musyrikin, maksudnya adalah kedudukan atau nasib yang paling mulia dari kedua golongan itu menjadi tujuan pembahasan, dan kedudukan orang mukmin dalam surah ini didahulukan penyebutannya, sedangkan ( surah An-Nazi'at ) diawali dengan ancaman bagi orang-orang yang menentang adanya hari kebangkitan, maka pembicaraan selanjutnya yang sesuai dengan perbuatan mereka adalah ancaman yang akan mereka hadapi pada hari kiamat. 2 ) Corak wajah yang penuh dengan kekhwatiran Nampak dari wajah-wajah siswa setelah menerima lembaran ujiannya, dan perkara ini hanyalah semenatara, maka terlebih lagi dengan wajah-wajah yang menerima kitab mereka pada hari kiamat dengan tangan kanan dan tangan kiri ? entah wajah mereka akan menjadi { وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ , ضَاحِكَةٌ مُسْتَبْشِرَةٌ , وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ , تَرْهَقُهَا قَتَرَةٌ } , dan setelahnya adalah : kenikmatan yang terbatas, atau siksaan yang akan berlangsung selamanya, maka apakah ada yang ingin mengambil pelajaran ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38-39. Wajah orang-orang yang beriman pada hari itu sangat bercahaya, berseri-seri dan tersenyum karena bahagia atas apa yang akan mereka dapatkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{tertawa lagi gembira ria} gembira"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan mereka juga tertawa gembira dengan bahagia, bahagia atas kenikmatan yang Allah siapkan bagi mereka, dan apakah itu adalah hasil dari pembangkangan dan lalai terhadap perintah Allah ?! Tidak, itu adalah imbalan dan ganjaran dari amal shalih yang mereka lakukan ketika didunia, oleh karena itu, selagi kita msih di zaman yang memungkinkan untuk melakukan berbagai kebaikan, selagi kita msih berkesempatan melakukan sebanyak mungkin amal shalih, maka seharusnya kita mempersiapkan diri untuk menghadapi peristiwa yang menakutkan itu, dan bukan justru kita melupakan dan lalai darinya, akan tetapi harus selalu terbayang dalam benak kita, mempersiapkan diri untuknya dengan memperbanyak membaca Al-Qur'an agar kita selalu teringat akan peristiwa itu, lebih memperbanyak waktu untuk mempelajari Alqur'an yang mengingatkan dan menasihati kita akan pentingnya mmepersiapkan diri untuk menghadapai keadaan yang sangat mencekam di hari kiamat itu, hanya ALqur'an yang dapat menunjukkan kepada kita jalan yang membawa kepada keselamatan. Dan Al-Qur'an tidaklah hanya sekedar untuk dibaca, akan tetapi untuk diamalkan apa yang diperintahkan didalamnya dan menjauh dari segala apa yang dilarang. Dan tidak pula kita hanya menjadikan Al-Qur'an ini sebagai alat untuk mencari penghidupan ( nafkah ) yang darinya kita dapat meraih harta yang banyak, Akan tetapi inti dari diturunkannya Al-Qur'an agar kita mendapatkan petunjuk didalamnya, Al-Qur'an yang didalamnya terkandung berbagai macam dalil dan petunjuk yang Allah berikan kepada hamba-Nya harus selalu menjadi tujuan utama bagi seluruh umat manusia agar mempelajarinya, Dan setiap manusia akan memperjanggung jawabkan dihadapan Tuhannya bagaimana dia memperlakukan Al-Qur'an ketika didunia, dan Allah tidak meninggalkan untuk hamba-Nya selain dari Al-Qur'an, Dia memudahan bagi setiap hambanya baik yang kecil maupun yang besar, dirumah-rumah dan di masjid-masjid begitupun di sekolahan bahkan di mobil pun kita dapat membaca dan mempelajari Alqur'an. Itulah kemudahan yang Allah berikan kepada Hamba-Nya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "ضَاحِكَةٌ Maksudnya: Tersenyum, Ini muncul dari sempurnanya rasa gembira. مُسْتَبْشِرَةٌ \"gembira ria\" Maknanya: Telah diberi kabar dengan kabar baik, karena para malaikat menjumpai mereka dengan kabar gembira, para malaikat mengatakan: Salaamun ‘alaikum. Keselamatan atas kalian."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 39: 38-40. Dan pada hari yang besar ini (yaitu hari kiamat) Allah putihkan wajah-wajah mereka dan terlihat berseri-seri padanya, begitu juga nampak senyuman di wajahnya. Dan itulah wajah ahli tauhid dan ahli iman. Dan di sana terdapat wajah yang tertutup debu dan cemberut ketakutan dari apa yang telah mereka lalaikan (di dunia)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 39",
    "description": "38-39. Pada hari itu ada wajah-wajah yang berseri-seri. Itulah muka orang-orang yang pada saat di dunia beriman dan beramal saleh. Mereka tertawa dan bergembira ria bersama kaum mukmin yang lain. Mereka tidak takut dan khawatir akan nasib mereka karena yakin Allah akan memberi balasan dengan sebaik-baiknya. 40-42. Dan di sisi yang lain pada hari itu ada pula wajah-wajah manusia yang tertutup debu, pucat pasi, menghitam, dipenuhi kecemasan serta ketakutan yang sangat, tertutup oleh kegelapan akibat ditimpa kehinaan dan kesusahan. Mereka itulah orang-orang kafir yang durhaka. Mereka tidak beriman, tidak bersyukur, dan tidak pula beribadah kepada-Nya, bahkan sering berbuat maksiat. Demikianlah kesudahan umat manusia di akhirat nanti."
  }
]