[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "3-4. Apa yang membuatmu tahu hakikat urusannya? bisa jadi pertanyaannya menyucikan dan membersihkan jiwanya Atau dia mendapatkan tambahan pelajaran dan nasihat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Atau mendapat nasihat dari nasihat-nasihat yang didengarnya darimu lalu dia mendapatkan manfaat darinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. أَوْ يَذَّكَّرُ (atau dia (ingin) mendapatkan pengajaran) Atau ia hendak mendapat pelajaran dari apa yang kamu ajarkan. فَتَنفَعَهُ الذِّكْرَىٰٓ (lalu pengajaran itu memberi manfaat kepadanya?) Yakni pelajaran itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Atau barangkali dia bisa mengambil hikmah dari perkataanmu, sehingga perkataanmu itu bermanfaat baginya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{atau dia mendapatkan pengajaran} mendapat pelajaran {sehingga pengajaran itu} pelajaran itu {bermanfaat baginya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-10 Sebab turunnya ayat-ayat mulia ini adalah seorang mukmin buta datang seraya bertanya kepada Nabi dan belajar dari beliau, kemudian ada orang kaya juga datang. Nabi amat ingin menunjukkan manusia, hanya saja beliau lebih condong pada orang kaya dan berpaling dari si buta lagi miskin demi mengharap agar si kaya mendapat petunjuk dan demi agar si kaya menyucikan hatinya. Lalu Allah menegurnya dengan tegurann lembut ini seraya berfirman; “dia (Muhammad) bermuka masam” di wajah beliau, “dan berpaling” dengan raganya karena orang buta mendatanginya. Kemudian Allah menyebutkan manfaat menyambutnya seraya berfirman, “Tahukah kamu barangkali ia,” yakni orang buta tersebut, “ingin membersihkan dirinya (dari dosa),” yaitu membersihkan diri dari akhlak tercela dan ingin berakhlak terpuji, “atau dia (ingin) mendapatkan pengajaran lalu pengajaran itu memberi manfaat kepadanya,” yakni, mendapatkan pengajaran tentang sesuatu sehingga ia mendapatkan manfaat dari pelajaran itu. Ini adalah manfaat besar dan itulah maksud diutusnya para rasul, maksud dari petuah orang yang memberi nasihat dan maksud dari peringatan orang yang memberi peringatan. Sambutanmu pada orang orang yang datang sendiri seraya memerlukanmu itu lebih layak dan wajib, sedangkan berpalingnya engkau pada orang kaya yang tidak memerlukanmu yang tidak mau bertanya dan meminta fatwa karena tidak memiliki keinginan pada kebaikan dan engkau tinggalkan orang lebih utama itu tidak layak bagimu. Tugasmu hanyalah memberi pengajaran, bila pun ia tidak mau mengambil pelajaran dengan membersihkan diri, engkau tidak akan dimintai pertanggung jawab atas perbuatan buruk yang ia lakukan. Hal ini menunjukan pada kaidah masyhur; sesuatu yang telah diketahui tidak ditinggalkan untuk sesuatu yang belum jelas. Dan menyambut murid yang memerlukan dan penuh kemauan lebiih layak dari yang lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Atau mungkin dia datang untuk mendapatkan nasehat darimu wahai Rasul dan nasehat itu pastinya bermanfaan bagi dirinya , dia datang kepadamu hanya untuk itu , dan sikap Rasulullah ﷺ kepada laki-laki itu mendapatkan teguran dari Allah ﷻ , oleh karenanya Allah berkata : { وَمَا يُدْرِيكَ لَعَلَّهُ يَزَّكَّىٰ , أَوْ يَذَّكَّرُ فَتَنْفَعَهُ الذِّكْرَىٰ } ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَوْ يَذَّكَّرُ فَتَنْفَعَهُ الذِّكْرَى “atau dia (ingin) mendapatkan pengajaran, lalu pengajaran itu memberi manfaat kepadanya?” Tahukah kamu barangkali ia ingin mendapatkan pengajaran. Maksudnya: meminta nasehat sehingga nasehat itu bermanfaat baginya, Sungguh Ibnu Ummi Maktum radhiyallaahu ‘anhu lebih besar harapannya untuk menerima nasehat dan mau belajar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 4: 1-4. Pada awal-awal surat ini (ditujukan) sebagai petunjuk untuk Nabi dalam bergaul dengan orang-orang yang lemah dari kalangan kaum muslimin. Allah menjelaskan bahwa pada wajah Rasul nampak perubahan dan bermuka masam ketika telah datang padanya seorang yang buta bernama Abdullah bin Ummi Maktum yang menanyakan kepadanya berkenaan dengan urusan agama; Maka Rasul berpaling darinya karena Abdullah Ummi Maktum memotong ucapan Rasul ketika beliau sibuk berdakwah kepada pembesar-pembasar Quraisy yang keras kepala semisal : Utbah, Syaibah, Abu Jahl, dan Walid bin Mughirah yang Rasul mendambakan keislaman pada mereka. Kemudian Allah tegur Nabi dengan berkata : Tidaklah engkau (wahai Nabi) mengetahui dirinya dan dikabarkan berkenaan dengan keadaan orang yang buta ini, maka semoga ia dengan bertanya kepadamu aka menjadikan dirinya suci dari dosa-dosanya. Atau memberikan manfaat dengan apa yang ia dengar darimu kemudian ia berpikir dan menerangi hatinya dengan cahaya keimanan. Adapun pembesar-pembesar itu yang justru wajahnya berpaling, pura-pura buta dengan apa yang engkau dakwahkan, maka sungguh engkau telah menyampaikan dakwah kepada mereka dan tidak ada kewajiban bagimu kecuali hanya menyampaikan, dan sungguh telah engkau kerjakan. Dan Allah catat dengan firman-Nya : “Abasa wa Tawallaa”. Dan Allah tidak mengatakan : Engkau Muhammad bermuka masam dan telah berpaling, yang seolah-olah berbicara dengan seseorang yang lain (selain nabi). Karena maksud Allah hanyalah mengingatkan dan memberi petunjuk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dengan mengamalkannya. Ayat ini menunjukkan bahwa sepatutnya seorang alim memberikan perhatian lebih kepada penuntut ilmu yang butuh yang memang lebih semangat daripada yang lain. Dari ayat ini diambil sebuah kaedah, yaitu: لاَ يُتْرَكُ أَمْرٌ مَعْلُوْمٌ لِأَمْرٍ مَوْهُوْمٍ، وَلاَ مَصْلَحَةٌ مُتَحَقِّقَةٌ لِمَصْلَحَةٍ مُتَوَهِّمَةٌ “Perkara yang jelas tidaklah ditinggalkan karena perkara yang belum jelas, dan maslahat yang memang terwujud tidaklah ditinggalkan karena maslahat yang masih dikira-kira.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 4",
    "description": "Atau tahukah engkau bila dia datang karena dia ingin mendapatkan pengajaran Al-Qur'an dan ajaran islam darimu, yang memberi manfaat kepadanya sehingga dia lebih tekun beribadah, beramal saleh, dan menjadi pengikut setiamu' 5-6. Adapun orang yang merasa dirinya serba cukup dengan apa yang dia punya, seperti kedudukan, status sosial, dan kekayaan; sehingga dia enggan beriman kepada Allah dan mengikuti ajaranmu, maka engkau justru memberi perhatian kepadanya secara penuh agar jika dia masuk islam dan menjadi pelopor bagi pengikutnya. Dalam berdakwah kepada pemuka quraiys, nabi sebetulnya mempunyai niat yang mulia, tetapi Allah menegur perlakuan nabi kepada 'abdull'h lebih karena dia menginginkan nabi melakukan sesuatu yang lebih baik."
  }
]