[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41. Wajah-wajah mereka diliputi kehinaan. Orang-orang yang disifati dengan sifat-sifat ini adalah orang-orang yang kafir kepada nikmat nikmat Allah, mendustakan ayat-ayat NYA, berani melakukan pelanggaran dengan melakukan apa yang Allah larang, dan bersikap angkuh"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Tertutupi oleh kegelapan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. تَرْهَقُهَا قَتَرَةٌ (dan ditutup lagi oleh kegelapan) Yakni diliputi oleh kegelapan dan kesulitan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "38-41 1 ) Allah mendahulukan dalam ( surah 'Abasa ) penyebutan wajah-wajah yang berseri sebelum menyebutkan wajah-wajah yang dipenuhi dengan debut, sedangkan di ( surah An-Nazi'at ) Allah mendahulukan penyebutan Ahli syahwat sebebelum menyebutkan Ahli hidayah, dan maksud dari keduanya adalah; karena surah 'Abasa diawali dengan mengutamakan kedudukan salah satu orang terbaik dari kaum mukminin, dan merendahkan urusan yang sedang berlangsung pada salah satu tokoh utama kaum musyrikin, maksudnya adalah kedudukan atau nasib yang paling mulia dari kedua golongan itu menjadi tujuan pembahasan, dan kedudukan orang mukmin dalam surah ini didahulukan penyebutannya, sedangkan ( surah An-Nazi'at ) diawali dengan ancaman bagi orang-orang yang menentang adanya hari kebangkitan, maka pembicaraan selanjutnya yang sesuai dengan perbuatan mereka adalah ancaman yang akan mereka hadapi pada hari kiamat. 2 ) Corak wajah yang penuh dengan kekhwatiran Nampak dari wajah-wajah siswa setelah menerima lembaran ujiannya, dan perkara ini hanyalah semenatara, maka terlebih lagi dengan wajah-wajah yang menerima kitab mereka pada hari kiamat dengan tangan kanan dan tangan kiri ? entah wajah mereka akan menjadi { وُجُوهٌ يَوْمَئِذٍ مُسْفِرَةٌ , ضَاحِكَةٌ مُسْتَبْشِرَةٌ , وَوُجُوهٌ يَوْمَئِذٍ عَلَيْهَا غَبَرَةٌ , تَرْهَقُهَا قَتَرَةٌ } , dan setelahnya adalah : kenikmatan yang terbatas, atau siksaan yang akan berlangsung selamanya, maka apakah ada yang ingin mengambil pelajaran ?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40-41. Adapun wajah-wajah orang kafir pada waktu itu tertutup debu/kusam. Mereka diselimuti oleh kegelapan dan kehinaan. Karena mereka tahu bahwa mereka akan menerima siksa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{dan tertutup} ditutupi {oleh kegelapan} kegelapan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Dan diantara manusia ada yang wajahnya ditutupi oleh kegelapan karena kehinaan yang ada pada diri mereka, yaitu wajah-wajah orang-orang kafir dan para pembuat kejahatan, Allah berfirman : { يَوْمَ تَبْيَضُّ وُجُوهٌ وَتَسْوَدُّ وُجُوهٌ ۚ فَأَمَّا الَّذِينَ اسْوَدَّتْ وُجُوهُهُمْ أَكَفَرْتُمْ بَعْدَ إِيمَانِكُمْ فَذُوقُوا الْعَذَابَ بِمَا كُنْتُمْ تَكْفُرُونَ , وَأَمَّا الَّذِينَ ابْيَضَّتْ وُجُوهُهُمْ فَفِي رَحْمَةِ اللَّهِ هُمْ فِيهَا خَالِدُونَ } ( Pada hari yang di waktu itu ada muka yang putih berseri, dan ada pula muka yang hitam muram. Adapun orang-orang yang hitam muram mukanya (kepada mereka dikatakan): “Kenapa kamu kafir sesudah kamu beriman? Karena itu rasakanlah azab disebabkan kekafiranmu itu” , Adapun orang-orang yang putih berseri mukanya, maka mereka berada dalam rahmat Allah (surga); mereka kekal di dalamnya. ) [ Ali Imran : 106-107 ] Ada wajah-wajah yang memutih dengan cahaya dan ada pula wajah-wajah yang menghitam gelap dikarenakan tertutupi oleh depu yang tebal, di ayat lain Allah juga berfirman : { وَيَوْمَ الْقِيَامَةِ تَرَى الَّذِينَ كَذَبُوا عَلَى اللَّهِ وُجُوهُهُمْ مُسْوَدَّةٌ ۚ أَلَيْسَ فِي جَهَنَّمَ مَثْوًى لِلْمُتَكَبِّرِينَ } ( Dan pada hari kiamat kamu akan melihat orang-orang yang berbuat dusta terhadap Allah, mukanya menjadi hitam. Bukankah dalam neraka Jahannam itu ada tempat bagi orang-orang yang menyombongkan diri? ) [ Az Zumar : 60 ]"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "تَرْهَقُهَا قَتَرَةٌ \" dan ditutup lagi oleh kegelapan.\" Maknanya: Kegelapan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 41: 41-42. Kemudian Allah jelaskan pemilik wajah yang berdebu ini (yang nampak padanya dan menutupi wajahnya), serta hina, rendahan, hitam wajahnya dan gelap. Dan Allah akhiri pada ayat ini dengan penjelasan (bahwasanya) pemilik wajah-wajah ini dikarenakan (ketika di dunia) terkumpul padanya kekufuran dan kemaksiatan-kemaksiatan. Oleh karena itu, Allah kumpulkan pada wajahnya kegelapan dan debu yang menutupi wajahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka ini telah berputus asa dari semua kebaikan dan dikenali kesengsaraannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 41",
    "description": "40-42. Dan di sisi yang lain pada hari itu ada pula wajah-wajah manusia yang tertutup debu, pucat pasi, menghitam, dipenuhi kecemasan serta ketakutan yang sangat, tertutup oleh kegelapan akibat ditimpa kehinaan dan kesusahan. Mereka itulah orang-orang kafir yang durhaka. Mereka tidak beriman, tidak bersyukur, dan tidak pula beribadah kepada-Nya, bahkan sering berbuat maksiat. Demikianlah kesudahan umat manusia di akhirat nanti"
  }
]