[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "41. Wajah-wajah mereka diliputi kehinaan. Orang-orang yang disifati dengan sifat-sifat ini adalah orang-orang yang kafir kepada nikmat nikmat Allah, mendustakan ayat-ayat NYA, berani melakukan pelanggaran dengan melakukan apa yang Allah larang, dan bersikap angkuh"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Orang-orang yang disebutkan dengan ciri-ciri demikian itu adalah orang-orang yang telah menggabungkan antara kekafiran dan kedurhakaan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. أُو۟لٰٓئِكَ (Mereka itu) Yakni orang-orang yang berwajah kusam dan berdebu. هُمُ الْكَفَرَةُ الْفَجَرَةُ (orang-orang kafir lagi durhaka) Yakni orang-orang fasik dan pendusta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Merekalah orang-orang yang mendapat gelar orang-orang kafir dan fasik, yaitu orang-orang yang bermaksiat dan melampaui batasan Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka itulah orang-orang kafir lagi durhaka} orang-orang yang mengumpulkan kekufuran dan perbuatan yang durhaka."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 33-42 Maknanya, bila teriakan Hari Kiamat tiba, yang memecahkan telinga karena huru-haranya dan menggetarkan jiwa pada hari itu karena huru-hara yang disaksikan, serta amat memerlukannya manusia pada amal perbuatannya terdahulu, seseorang akan lari meninggalkan orang yang paling mulia baginya dan yang paling disayanginya. Seseorang akan lari meninggalkan saudara, ibu, ayah, istri, dan anaknya. Hal itu terjadi karena “setiap orang dari mereka pada hari itu mempunyai urusan yang cukup menyibukkannya,” yakni disibukkan oleh diri sendiri dan sibuk untuk membebaskan dirinya, sehingga ia tidak bisa beralih pada yang lain. Pada hari itu, manusia terbagi menjadi dua golongan; orang-orang bahagia dan orang-orang sengsara. Orang-orang wajahnya “pada hari itu berseri-seri,” yakni nampak berseri dan indah, karena tahu keberhasilan dan kemenangan mereka mendapatkan berbagai nikmat, “tertawa dan gembira ria. Dan banyak (pula) muka,” orang-orang sengsara “pada hari itu tertutup debu,” wajah mereka hitam pekat karena berputus asa dari segala kebaikan dan mengetahui kesengsaraan dan kebinasaannya. “mereka itulah,” orang-orang dengan sifat seperti itu “orang-orang kafir lagi durhaka,” yakni orang-orang yang kufur tehadap nikmat Allah, mendustakan ayat-ayatNya dan berani menerjang larangan-laranganNya. Semoga Allah memberikan kita ampunan dan keselamatan. Sesungguhnya Dia Maha Pemurah lagi Mahamulia. Segala puji hanya bagi Allah, Rabb semesta alam."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Siapakah mereka yang disifati dengan sifat-sifat tersebut ? Mereka itulah orang-orang kufur akan nikmat Allah ta'ala, serta mereka yang berbuat kejahatan dan kefasikan serta maksiat, mereka lah yang akan tertutupi wajahnya pada hari kiamat dengan debu dan kegelapan yang hina. Surah ini sangat agung dan merupakan peringatan dan pelajaran yang membawamu seakan-akan kamu menyaksikan keadaan pada peristiwa yang agung itu, bukan hal yang biasa, itulah yang dijelaskan oleh Al-Qur'an dengan sebaik-baiknya penjelasan, Al-Qur'an menjelasan segala sesuatu dengan benar dan tiada keraguan padanya, Al-Qur'an menerangkan bagaimaa keadaan kehidupan yang telah berlalu dan yang akan datang, Al-Qur'an bukanlah bagian dari cerita-cerita khayalan, atau kesimpulan dari kisah-kisah tak bermakna, melainkan AL-Qur'an adalah merupakan wahyu yang diturunkan oleh pencipta kehidupan dan kematian, Dia penguasa kehidupan dunia dan kehidupan akhirat. Dialah yang berbicara tentang segala apa yang terkandung didalam Al-Qur'an kemudian Dia wahyukan kepada Rasul-Nya Muhammad ﷺ, dan Kemudian Muhammad menyampaikan wahyu itu kepada ummat-Nya, dan saat ini telah berada di hadapan kita, lalu apakah kita merujuk kepadanya dan mentadabburi isinya, dan apkah kita mempelajari kemudian mengamalkan apa yang diperintahkan didalamnya, apakah kita takut dengan segala ancaman yang ada didalam Al-Qur'an ini ? Semoga Allah memberikan kita kemudahan untuk mengamalkan semua itu, dan menjadikan kita bagian dari para penjaga Al-Qr'an, semoga kita termasuk orang-orang yang selalu merindukan Al-Qur'an dengan mengamalkan isinya, dan mendapat petunjuk darinya, Nabi ﷺ berkata : ( وَالقُرْاَنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ ) \"Al Qur’an itu bisa menjadi pembelamu atau musuh bagimu.” (HR. Muslim no. 223) jika kalian mengamalkan apa yang diperintahkan oleh Al-Qur;an maka ia akan menjadi penolong bagi kamu di hari kiamat nanti dan akan membawamu ke surga, Allah berfirman : { إِنَّ هَٰذَا الْقُرْآنَ يَهْدِي لِلَّتِي هِيَ أَقْوَمُ وَيُبَشِّرُ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا كَبِيرًا , وَأَنَّ الَّذِينَ لَا يُؤْمِنُونَ بِالْآخِرَةِ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا } ( Sesungguhnya Al Quran ini memberikan petunjuk kepada (jalan) yang lebih lurus dan memberi khabar gembira kepada orang-orang Mu’min yang mengerjakan amal saleh bahwa bagi mereka ada pahala yang besar , Dan sesungguhnya orang-orang yang tidak beriman kepada kehidupan akhirat, Kami sediakan bagi mereka azab yang pedih. ) [ Al-Isra' : 9-10 ] ."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أُولَئِكَ هُمُ الْكَفَرَةُ الْفَجَرَةُ \" Mereka itulah orang-orang kafir lagi durhaka.\" Orang-orang yang menggabungkan antara kekufuran dan perbuatan keji. Kita memohon kepada Allah keselamatan, dan memohon kepada Allah Ta’ala agar menjadikan kita menjadi orang-orang yang wajah-wajahnya terang, tersenyum dan gembira. Sesungguhnya Dia Maha Pemberi lagi Maha Mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 42: 41-42. Kemudian Allah jelaskan pemilik wajah yang berdebu ini (yang nampak padanya dan menutupi wajahnya), serta hina, rendahan, hitam wajahnya dan gelap. Dan Allah akhiri pada ayat ini dengan penjelasan (bahwasanya) pemilik wajah-wajah ini dikarenakan (ketika di dunia) terkumpul padanya kekufuran dan kemaksiatan-kemaksiatan. Oleh karena itu, Allah kumpulkan pada wajahnya kegelapan dan debu yang menutupi wajahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu mereka yang kafir kepada nikmat Allah, mendustakan ayat-ayat-Nya dan berani mengerjakan larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 42",
    "description": "40-42. Dan di sisi yang lain pada hari itu ada pula wajah-wajah manusia yang tertutup debu, pucat pasi, menghitam, dipenuhi kecemasan serta ketakutan yang sangat, tertutup oleh kegelapan akibat ditimpa kehinaan dan kesusahan. Mereka itulah orang-orang kafir yang durhaka. Mereka tidak beriman, tidak bersyukur, dan tidak pula beribadah kepada-Nya, bahkan sering berbuat maksiat. Demikianlah kesudahan umat manusia di akhirat nanti. 1-7. Allah mengawali surah ini dengan menyebutkan dua belas peristiwa besar yang akan terjadi pada hari kiama ' disebutkan dari ayat 1 s. D. 13. Apabila matahari yang demikian besar digulung dengan mudah seperti halnya serban, hingga cahayanya memudar dan redup. Dan apabila bintang-bintang yang begitu banyak dan menghiasi cakrawala berjatuhan, tidak berada di garis edarnya lagi akibat hilangnya gaya tarikmenarik antar-benda langit. Dan apabila gunung-gunung yang demikian tegar dan kukuh dihancurkan hingga luluh lantak menjadi pasir, kemudian diempaskan oleh angin dahsyat dengan mudahnya seperti gumpalan kapas raksasa yang beterbangan. Dan apabila unta-unta yang bunting dan menjadi harta yang dibanggakan ditinggalkan begitu saja dan tidak lagi dipedulikan dan diurus oleh pemiliknya. Hal ini mengisyaratkan betapa besar kebingungan yang meliputi manusia saat kiamat tiba. Dan apabila binatang-binatang liar dikumpulkan untuk diberi balasan bila berbuat aniaya kepada sesamanya. Binatang liar yang saling memusuhi saat itu bisa dikumpulkan menjadi satu dalam suasanya yang sangat menegangkan. Dan apabila lautan dipanaskan dan dijadikan meluap. Air laut memanas akibat munculnya kobaran api mahadahsyat dari dasarnya. Dan apabila roh-roh dipertemukan dengan tubuh sehingga manusia hidup kembali dalam suasana yang sama sekali berbeda dari kehidupan dunia. Manusia saat itu bergabung dengan manusia lain yang senasib; penaat bersama penaat, begitupun sebaliknya."
  }
]