[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-7. Orang yang tidak memerlukan petunjuk-Nya, Kamu justru mengurusi dan mendengarkan ucapannya, Apa salahmu bila kamu tidak menyucikannya dari kekafirannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Adapun orang yang merasa cukup dengan dirinya karena memiliki harta dibandingkan iman kepada apa yang engkau bawa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5-7. Namun orang yang merasa tidak butuh untuk beriman kepadamu itu, kamu malah datang menghampirinya. Apa yang akan menimpamu jika orang kafir itu tidak juga masuk Islam?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Adapun orang-orang yang merasa dirinya serba cukup atas harta mereka (para pembesar Quraisy) yang tidak ingin untuk mendengarkan Alquran dan kebaikan yang Engkau bawa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang yang merasa dirinya sudah cukup"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-10 Sebab turunnya ayat-ayat mulia ini adalah seorang mukmin buta datang seraya bertanya kepada Nabi dan belajar dari beliau, kemudian ada orang kaya juga datang. Nabi amat ingin menunjukkan manusia, hanya saja beliau lebih condong pada orang kaya dan berpaling dari si buta lagi miskin demi mengharap agar si kaya mendapat petunjuk dan demi agar si kaya menyucikan hatinya. Lalu Allah menegurnya dengan tegurann lembut ini seraya berfirman; “dia (Muhammad) bermuka masam” di wajah beliau, “dan berpaling” dengan raganya karena orang buta mendatanginya. Kemudian Allah menyebutkan manfaat menyambutnya seraya berfirman, “Tahukah kamu barangkali ia,” yakni orang buta tersebut, “ingin membersihkan dirinya (dari dosa),” yaitu membersihkan diri dari akhlak tercela dan ingin berakhlak terpuji, “atau dia (ingin) mendapatkan pengajaran lalu pengajaran itu memberi manfaat kepadanya,” yakni, mendapatkan pengajaran tentang sesuatu sehingga ia mendapatkan manfaat dari pelajaran itu. Ini adalah manfaat besar dan itulah maksud diutusnya para rasul, maksud dari petuah orang yang memberi nasihat dan maksud dari peringatan orang yang memberi peringatan. Sambutanmu pada orang orang yang datang sendiri seraya memerlukanmu itu lebih layak dan wajib, sedangkan berpalingnya engkau pada orang kaya yang tidak memerlukanmu yang tidak mau bertanya dan meminta fatwa karena tidak memiliki keinginan pada kebaikan dan engkau tinggalkan orang lebih utama itu tidak layak bagimu. Tugasmu hanyalah memberi pengajaran, bila pun ia tidak mau mengambil pelajaran dengan membersihkan diri, engkau tidak akan dimintai pertanggung jawab atas perbuatan buruk yang ia lakukan. Hal ini menunjukan pada kaidah masyhur; sesuatu yang telah diketahui tidak ditinggalkan untuk sesuatu yang belum jelas. Dan menyambut murid yang memerlukan dan penuh kemauan lebiih layak dari yang lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Sedangkan orang-orang yang merasa diri serba cukup dan tidak memutuhkan petunjuk dari Allah , dan merasa bahwa dia tidak memrlukan islam , dan semua itu adalah sifat orang-orang kafir."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "أَمَّا مَنِ اسْتَغْنَى \"Adapun orang yang merasa dirinya serba cukup,\" Yakni, merasa tidak butuh karena memiliki harta yang banyak dan memiliki jabatan yang kuat, mereka Adalah pembesar yang berada di sisi Nabi shallallaahu ‘alaihi wa sallam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 5: 5-10. Kemudian Allah berkata kepada Nabi-Nya dengan merinci, Allah berkata : Adapun orang-orang yang telah datang kepadamu dan ia termasuk orang yang kaya dengan hartanya namun menolak akan agama Allah, maka apakah hal seperti ini yang ia datang dengan penolakan patut untuk diurusi ucapannya ? Maka pada hal yang demikian tidak ada dosa bagimu dan kewajiban jika ia tidak mau mensucikan kotoran kekufuran dan kemaksiatannya. Adapun orang yang buta ini datang kepadamu dengan bersegera karena sebab takut dari adzab Allah dan hukuman dari-Nya, sedangkan engkau malah tersibukkan dan berpaling darinya, kemudian berpaling menuju kepada mereka pembesar-pembesar kafir untuk mendakwahinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yaitu pembesar-pembesar Quraisy yang sedang dihadapi Rasulullah shallallahu 'alaihi wa sallam yang diharapkannya dapat masuk Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 5",
    "description": "5-6. Adapun orang yang merasa dirinya serba cukup dengan apa yang dia punya, seperti kedudukan, status sosial, dan kekayaan; sehingga dia enggan beriman kepada Allah dan mengikuti ajaranmu, maka engkau justru memberi perhatian kepadanya secara penuh agar jika dia masuk islam dan menjadi pelopor bagi pengikutnya. Dalam berdakwah kepada pemuka quraiys, nabi sebetulnya mempunyai niat yang mulia, tetapi Allah menegur perlakuan nabi kepada 'abdull'h lebih karena dia menginginkan nabi melakukan sesuatu yang lebih baik"
  }
]