[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "5-7. Orang yang tidak memerlukan petunjuk-Nya, Kamu justru mengurusi dan mendengarkan ucapannya, Apa salahmu bila kamu tidak menyucikannya dari kekafirannya?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Tidaklah engkau mendapatkan mudarat jika ia tidak mau bersuci dari dosa-dosanya dengan bertobat kepada Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَمَا عَلَيْكَ أَلَّا يَزَّكَّىٰ (Padahal tidak ada (celaan) atasmu kalau dia tidak membersihkan diri (beriman)) Yakni beban apa yang memberatkanmu jika mereka tidak beriman dan tidak mendapat petunjuk, sebab tugasmu hanyalah menyampaikan risalah; oleh sebab itu janganlah kamu pedulikan orang kafir yang demikian."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6-7. Engkau justru mengharap mereka memeluk ajaran dan beriman kepadamu. Padahal engkau tidak akan menjadi cela kalaupun mereka tidak mau menyucikan dirinya kepada Islam. Sampai menjadikanmu begitu mengharap mereka, namun menolak orang yang justru hendak meminta petunjuk kepadamu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Apa yang menimpamu kalau dia tidak menyucikan diri} Hal apa yang menimpamu jika dia tidak menyucikan diri dari kekufurannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "Ayat 1-10 Sebab turunnya ayat-ayat mulia ini adalah seorang mukmin buta datang seraya bertanya kepada Nabi dan belajar dari beliau, kemudian ada orang kaya juga datang. Nabi amat ingin menunjukkan manusia, hanya saja beliau lebih condong pada orang kaya dan berpaling dari si buta lagi miskin demi mengharap agar si kaya mendapat petunjuk dan demi agar si kaya menyucikan hatinya. Lalu Allah menegurnya dengan tegurann lembut ini seraya berfirman; “dia (Muhammad) bermuka masam” di wajah beliau, “dan berpaling” dengan raganya karena orang buta mendatanginya. Kemudian Allah menyebutkan manfaat menyambutnya seraya berfirman, “Tahukah kamu barangkali ia,” yakni orang buta tersebut, “ingin membersihkan dirinya (dari dosa),” yaitu membersihkan diri dari akhlak tercela dan ingin berakhlak terpuji, “atau dia (ingin) mendapatkan pengajaran lalu pengajaran itu memberi manfaat kepadanya,” yakni, mendapatkan pengajaran tentang sesuatu sehingga ia mendapatkan manfaat dari pelajaran itu. Ini adalah manfaat besar dan itulah maksud diutusnya para rasul, maksud dari petuah orang yang memberi nasihat dan maksud dari peringatan orang yang memberi peringatan. Sambutanmu pada orang orang yang datang sendiri seraya memerlukanmu itu lebih layak dan wajib, sedangkan berpalingnya engkau pada orang kaya yang tidak memerlukanmu yang tidak mau bertanya dan meminta fatwa karena tidak memiliki keinginan pada kebaikan dan engkau tinggalkan orang lebih utama itu tidak layak bagimu. Tugasmu hanyalah memberi pengajaran, bila pun ia tidak mau mengambil pelajaran dengan membersihkan diri, engkau tidak akan dimintai pertanggung jawab atas perbuatan buruk yang ia lakukan. Hal ini menunjukan pada kaidah masyhur; sesuatu yang telah diketahui tidak ditinggalkan untuk sesuatu yang belum jelas. Dan menyambut murid yang memerlukan dan penuh kemauan lebiih layak dari yang lainnya."
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Prof. Dr. Shalih bin Fauzan al-Fauzan, anggota Lajnah Daaimah (Komite Fatwa Majelis Ulama KSA)",
    "description": "Bukanlah menjadi urusanmu wahai Muhammad jikalau dia tidak menerima hidayah itu , kamu hanya bertanggung jawa untuk menyampaikan kebenaran itu , dan urusan apakah dia menerimanya atau tidak itu adalah urusan Allah dan hanya Dialah yang tau siapa yang berhak atas hidayah itu dan siapa yang tidak berhak atasnya . Hidayah itu ada ditangan Allah ﷻ , Allah berfirman : { وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ } ( dan Dia lebih mengetahui tentang orang orang yang mendapat petunjuk. ) [ Al-An'am : 117 ] , sedangkan Rasul hanyalah sebagai orang yang menyampaikan kebenaran yang dari dari Allah , Allah berfirman : { إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ ۗ } ( Kewajibanmu tidak lain hanyalah menyampaikan (risalah). ) [Asy - Syura : 48 ] karena seorang Nabi tidak mengetahui bagaimana hati seseorang dalam menerima hidayah itu . Akan tetapi apa yang telah Rasulullah perjuangkan agar orang-orang dapa menerima hidayah yang ia sampaikan telah memberikan hasil yang baik , dan tidak diragukan lagi bahwa Nabi tentulah sangat mencintai Abdullah bin Ummi maktum , dan dia juga mengetahui bagaimana kemampuannya serta kedudukannya diantara para sahabatnya , dia mengetahui bagaimana masuknya Abdullah kedalam islam yang merupakan bagian dari para ( Assabiqun Al awwalun ) , Nabi juga tahu bagaimana kesungguhan Abdullah bin Ummi maktum dalam mencari kebaikan , akan tetapi Rasulullah melihat bahwa sambutannya kepada pemuka quraisy itu lebih utama dari pelayanannya kepada Abdullah dengan harapan mereka dapat menerima dan masuk kedalam islam . Dan Allah pun menegur Nabi-Nya atas sikapnya tersebur pada ayat-ayat ini ,"
  },
  {
    "title": "Tafsir Juz 'Amma / Syaikh Muhammad bin Shalih al-Utsaimin, ulama besar abad 14 H",
    "description": "وَمَا عَلَيْكَ أَلَّا يَزَّكَّى “Padahal tidak ada (celaan) atasmu kalau dia tidak membersihkan diri (beriman).” Yakni : Engkau tidak memiliki tanggungan apa pun jika orang yang tidak butuh tidak mau mensucikan diri, karena tugasmu hanyalah menyampaikan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat ‘Abasa ayat 7: 5-10. Kemudian Allah berkata kepada Nabi-Nya dengan merinci, Allah berkata : Adapun orang-orang yang telah datang kepadamu dan ia termasuk orang yang kaya dengan hartanya namun menolak akan agama Allah, maka apakah hal seperti ini yang ia datang dengan penolakan patut untuk diurusi ucapannya ? Maka pada hal yang demikian tidak ada dosa bagimu dan kewajiban jika ia tidak mau mensucikan kotoran kekufuran dan kemaksiatannya. Adapun orang yang buta ini datang kepadamu dengan bersegera karena sebab takut dari adzab Allah dan hukuman dari-Nya, sedangkan engkau malah tersibukkan dan berpaling darinya, kemudian berpaling menuju kepada mereka pembesar-pembesar kafir untuk mendakwahinya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat ‘Abasa Ayat 7",
    "description": "Wahai nabi, mengapa engkau lebih mengutamakan pelayanan terhadap pemuka quraisy itu, padahal tidak ada celaan atasmu kalau dia tidak menyucikan diri dengan beriman kepada Allah' tugasmu hanyalah menyampaikan wahyu, dan setelah itu tidak ada dosa bagimu jika dia tetap berpaling dan enggan mengikuti petunjukmu. Lalu, mengapa engkau menomorduakan permintaan orang buta lagi fakir yang ingin belajar islam darimu'8-10. Dan adapun orang, yaitu 'abdull'h bin ummi makt'm, yang datang kepadamu dengan bersegera dan bersungguh-sungguh untuk mendapatkan pengajaran islam darimu, sedang dia takut akan siksa Allah jika tidak mematuhi-Nya, engkau malah mengabaikannya, berpaling darinya, tidak menghiraukannya, dan bermuka masam kepadanya."
  }
]