[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "(Tha Sin Mim). Keterangan tentang huruf-huruf yang terputus (di awal surat seperti ini) telah berlalu di muka pada permulaan Surat al-Baqarah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Ṭā` Sīn Mīm. Pembahasan tentang huruf-huruf seperti ini telah dijelaskan dalam permulaan surah Al-Baqarah"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Pada awal surat al-Baqarah telah dijelaskan tentang huruf muqattha’ah, dan hikmah dari penyebutan huruf muqattha’ah ini adalah untuk menjelaskan sisi mukjizat al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Surat ini adalah golongan ath thawasin yang menempati tempat Zabur, sebagaimana dijelaskan pada awal surat Asy syuaro. 1. Tha’, sin, mim: adalah sebagai penekanan dan menjelaskan mukjizat Alquran dengan bahasa Arab sebagaimana telah dijelaskan pada surat-surat sebelumnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ṭā Sīn Mīm"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 1: Telah berlalu penjelasan akan huruf muTelah lalu pembahasan akan huruf muqatha’ah di awal surat Al Baqarah.qatha’ah di awal surat Al Baqarah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 1",
    "description": "T' s'n m'm. 2. Ini ayat-ayat kitab Al-Qur'an yang amat mulia dan sangat tinggi kedudukannya, yang sangat jelas kebenarannya dari Allah, dan yang fungsinya menjelaskan segala macam persoalan manusia untuk mencapai kebahagiaannya."
  }
]