[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sementara itu, hati ibu Musa menjadi kosong dari semua hal yang terkait di dunia kecuali dari pikiran tentang Musa dan mengingatnya. Dan hampir saja ia menyatakan rahasia bahwa anak itu adalah putranya, sekiranya Kami tidak meneguhkan hatinya. Maka ia pun dapat bersabar dan tidak memberitahukan tentangnya, agar ia menjadi orang-orang yang beriman terhadap janji Allah dan meyakininya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Hati ibu Musa -'alaihissalām- menjadi kosong dari segala urusan dunia, kecuali urusan Musa. Hampir saja kesabarannya habis dan mengakui bahwa Musa adalah anaknya, karena besarnya keterikatan hatinya kepada anak itu, kalaulah bukan karena Kami telah ikat hatinya agar tetap tegar dan sabar, agar dia termasuk orang-orang yang beriman dan bertawakal kepada Rabbnya serta penyabar atas apa yang ditakdirkan oleh-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Ibu Musa merasakan kesedihan yang sangat dalam, dia khawatir terhadap nasib Musa setelah ia berada di dalam negeri Fir’aun. Hatinya hanya memikirkan Musa yang telah menjadi pemilik hidupnya, sehingga hampir saja dia membongkar rahasianya andai saja Allah tidak menetapkan hal itu dan meneguhkan hatinya, sehingga dia tidak jadi membongkar rahasia itu. Hatinya menjadi tenang sehingga dia termasuk orang-orang yang yakin terhadap janji Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "10. وَأَصْبَحَ فُؤَادُ أُمِّ مُوسَىٰ فٰرِغًا ۖ (Dan menjadi kosonglah hati ibu Musa) Yakni hatinya kosong dari segalanya kecuali dari memikirkan Musa, ia tidak peduli terhadap segala sesuatu ketika ia mendengar bahwa Musa sampai di tangan Fir’aun. إِن كَادَتْ لَتُبْدِى بِهِۦ(Sesungguhnya hampir saja ia menyatakan rahasia tentang Musa) Yakni ibu Musa hampir mengatakan bahwa Musa adalah anaknya akibat besarnya ketakutan dan kesedihannya. لَوْلَآ أَن رَّبَطْنَا عَلَىٰ قَلْبِهَا(seandainya tidak Kami teguhkan hatinya) Yakni seandainya Allah tidak menguatkan hatinya dengan ketenangan dan ketentraman serta keyakinan terhadap janji Allah bahwa Dia akan mengembalikan Musa ke pangkuannya, dan seandainya Allah tidak mengilhamkan kepadanya untuk bersabar. لِتَكُونَ مِنَ الْمُؤْمِنِينَ(supaya ia termasuk orang-orang yang percaya) Yakni termasuk orang-orang yang yakin dengan janji Allah bahwa Dia akan mengembalikan Musa ke pangkuannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10. Ketika ibunda nabi Musa mendengar kabar bahwa nabi Musa diambil keluarga Fir’aun, hati sang ibu menjadi kosong. Tidak ada lain kecuali hanya sibuk untuk memikirkan puteranya Sesungguhnya hampir saja ia menyatakan rahasia tentang Musa, seandainya tidak Kami teguhkan hatinya, supaya ia termasuk orang-orang yang percaya kepada janji Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Hati ibu Musa menjadi kosong} hampa dari setiap sesuatu kecuali mengingat Musa dan berduka karenanya {Sungguh hampir saja} hampir {dia mengungkapkannya} mengungkapkan bahwa dia adalah anaknya karena perasaannya yang menderita {seandainya Kami tidak meneguhkan hatinya agar dia termasuk orang-orang yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. Setelah ibunda Musa kehilangan anaknya, maka dia benar-benar merasa sangat sedih dan hatinya pun menjadi hampa karena kegusaran yang timbul sebagai reaksi dari kondisi manusiawinya, padahal Allah telah melarangnya bersedih dan merasa cemas serta menjanjikan akan mengembalikan Musa kepadanya. “Sesungguhnya hampir saja dia menyatakan rahasianya,” maksudnya, rahasia yang tersimpan di dalam hatinya, “seandainya tidak Kami teguhkan hatinya,” Kami meneguhkannya sehingga dia bisa tetap sabar dan tidak menguraikan rahasia itu, “supaya dia,” dengan kesabaran dan keteguhan hati itu, “termasuk orang-orang yang beriman.” Sebab, seseorang jika ditimpa oleh suatu musibah lalu dia bersabar dan berteguh hati, niscaya imannya bertambah karenanya. Dan hal ini dibuktikan oleh (fakta) bahwa berlanjutnya rasa sedih (berkeluh kesah) pada diri seseorang itu menunjukkan pada kelemahan imannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 10: Allah mengabarkan bahwasanya ibu Musa cemas sangat kepada anaknya, yang menjadikan hatinya kosong dari apapun kecuali dari memikirkan anaknya, sampai-sampai hampir ada rasa penyesalan padanya serta rindu (ingin) membuka rahasianya kalau saja Allah tidak teguhkan hatinya dan Allah ilhamkan kesabaran dengan janji Allah kepada orang-orang yang beriman akan janji Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah ibu Musa menghanyutkan Musa di sungai Nil, maka timbullah penyesalan dan kesedihan di hatinya karena kekhawatiran atas keselamatan Musa, bahkan hampir saja ia berteriak meminta tolong kepada orang-orang untuk mengambil anaknya itu kembali, yang akan mengakibatkan terbukanya rahasia bahwa Musa adalah anaknya sendiri. Berdasarkan ayat ini, maka seorang hamba apabila mendapatkan musibah, lalu ia bersabar, maka imannya akan bertambah. Ayat ini juga menunjukkan bahwa jika musibah dihadapi dengan sikap keluh kesah terus menerus, maka menunjukkan kelemahan imannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 10",
    "description": "Dan selanjutnya diuraikan keadaan ibu musa yang anaknya telah dipungut oleh keluarga istana, yaitu dikisahkan hati ibu musa menjadi kosong dari segala yang dirisaukannya, setelah Allah meneguhkan hatinya. Sungguh, akibat kekhawatirannya yang sangat mendalam hampir saja dia menyatakannya yakni rahasia yang dipendamnya tentang musa. Seandainya tidak kami teguhkan hatinya pastilah dia akan meng-akui bahwa anak yang dipungut fir'aun itu adalah anak kandungnya dan dia akan berteriak meminta tolong kepada orang untuk mengambil anaknya itu kembali, yang akan mengakibatkan terbukanya rahasia bahwa musa adalah anaknya sendiri. Peneguhan itu kami lakukan agar dia termasuk orang-orang yang beriman yang percaya kepada janji Allah. 11. Dan setelah hatinya mulai tenang dia yakni ibunya musa berkata kepada saudara perempuan musa, 'ikutilah dan carilah berita tentang apa yang terjadi pada dia yakni musa, dengan cara menelusuri jejak perjalanannya sejak mula dihanyutkan. ' maka perintah ibunya dia laksanakan, dan akhirnya kelihatan olehnya musa dari jauh, sedang mereka yakni fir'aun dan tentaranya tidak menyadari bahwa ada seseorang yang memperhatikan anak yang dipungut itu dari kejauhan."
  }
]