[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ibu Musa berkata kepada saudara perempuan Musa ketika hendak melemparkan Musa, “Ikutilah perjalanan Musa, tindakan apa yang diperlakukan padanya?” maka sang kakak mengikuti arah Musa dan melihatnya dari kejauhan. Sedang kaum Fir’aun tidak menyadari bahwa perempuan itu adalah saudara perempuan Musa dan ia tengah mencari tahu berita tentangnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Ibu Musa -'alaihissalām- berkata kepada saudara perempuan Musa setelah dia melemparkan Musa ke sungai, “Ikutilah jejaknya agar engkau tahu apa yang akan terjadi padanya.” Lalu saudarinya itu memantaunya dari kejauhan supaya rahasianya tidak terbuka, Fir'aun dan kaumnya tidak mengetahui bahwa dia adalah saudarinya dan bahwa dia mengikuti perkembangan kabar Musa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Ibu Musa segera mendatangi saudari Musa dan memintanya untuk mengikuti jejak Musa dan mencari kabar tentangnya serta kemana arus sungai membawanya. Saudarinya dapat melihatnya dan memperhatikannya dari jauh, dan tidak ada yang menyadari bahwa saudarinya mulai mengawasinya dari dekat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. وَقَالَتْ لِأُخْتِهِۦ قُصِّيهِ ۖ (Dan berkatalah ibu Musa kepada saudara Musa yang perempuan: “Ikutilah dia”) Yakni ikutilah ia dari belakang dan carilah berita tentangnya. فَبَصُرَتْ بِهِۦ عَن جُنُبٍ(Maka kelihatanlah olehnya Musa dari jauh) Yakni ia melihatnya dari jauh dan mendekatinya dengan sembunyi-sembunyi. وَهُمْ لَا يَشْعُرُونَ (sedang mereka tidak mengetahuinya) Yakni tidak mengetahui bahwa ia mengikuti Musa dan mencari kabar beritanya, serta tidak mengetahui bahwa ia adalah saudara Musa yang ingin menyelamatkan mereka dari kezaliman mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11. Berkatalah ibunda nabi Musa kepada saudara perempuan Musa: \"Ikutilah dia!\" Maka saudarara Musa melihatnya dari jauh, sedang mereka tidak mengetahui bahwa dia adalah saudara nabi Musa"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata kepada saudara perempuan Musa,“Ikutilah jejaknya”} ikutilah jejaknya sampai kamu mengenahui kabar tentangnya {Kemudian dia melihatnya dari kejauhan} dari kejauhan {dan mereka tidak menyadarinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. “Dan berkatalah” ibu Musa “kepada saudara Musa yang perempuan, ‘Ikutilah dia’.” Maksudnya, pergilah dan ikutilah dari belakang jejak saudaramu dan carilah kabar tentangnya, dan jangan sampai ada seseorang yang mengetahuimu dan menyadari maksudmu. Maka dia pun pergi untuk mengikutinya dari belakang, “maka kelihatan olehnya Musa dari jauh, sedang mereka tidak mengetahuinya.” Maksudnya, dia melihat Musa dengan mengawasinya melalui cara berpura-pura sebagai pelancong yang tidak mempunyai tujuan apa-apa. Ini adalah benar-benar sikap penuh pertimbangan dan ekstra hati-hati. Sebab kalau dia langsung melihat Musa dan langsung datang kepada mereka dengan sengaja, tentu mereka akan menduga bahwa dialah yang telah menghanyutkannya (di sungai), dan bisa jadi mereka bertekad menyembelih Musa sebagai hukuman terhadap keluarganya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 11: Kemudian berkata ibu Musa kepada anak perempuannya : Pergilah engkau ke sana (rumah fir’aun) dan kabarkan kepadaku (keadaan Musa), dan jangan sampai seorangpun mencurigaimu. Maka anak perempuan ibunya mengerjakan apa yang diperintahkan oleh ibu Musa. Ia melihat dari kejauhan dengan sembunyi-sembunyi, dan mereka (yang ada di istana fir’aun) tidak curiga dan tidak mengetahui bahwa ada saudara perempuan Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni agar engkau mengetahui bagaimana keadaannya. Bahwa ia saudarinya dan bahwa ia sedang mengawasi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 11",
    "description": "Dan setelah hatinya mulai tenang dia yakni ibunya musa berkata kepada saudara perempuan musa, 'ikutilah dan carilah berita tentang apa yang terjadi pada dia yakni musa, dengan cara menelusuri jejak perjalanannya sejak mula dihanyutkan. ' maka perintah ibunya dia laksanakan, dan akhirnya kelihatan olehnya musa dari jauh, sedang mereka yakni fir'aun dan tentaranya tidak menyadari bahwa ada seseorang yang memperhatikan anak yang dipungut itu dari kejauhan. 12. Selanjutnya, dikisahkan bagaimana musa kembali ke pangkuan ibunya. Allah berfirman ; dan kami cegah dia yakni musa, dengan cara membuatnya enggan menyusu kepada perempuan-perempuan yang mau menyusuinya sebelum itu yakni sebelum musa dikembalikan kepada ibunya untuk disusui. Kelurga fir'aun pun merasa cemas. Maka berkatalah dia yakni saudara perempuan musa, 'maukah aku tujukkan kepadamu, keluarga yang akan memeliharanya untukmu dan mereka dapat berlaku baik padanya ' saudara perempuan musa menyarankan agar ia disusui oleh perempuan yang tidak lain adalah ibunya sendiri."
  }
]