[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami cegah wanita-wanita yang menyusui dari Musa untuk menyusu dari mereka sebelum Kami mengembalikannya kepada ibunya. Lalu saudara perempuannya berkata, “Maukah kalian aku tunjukkan kepada kalian satu keluarga yang akan merawatnya dan menyusuinya dengan baik, serta mereka akan menyayanginya?” mereka pun menerima permintaannya itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Musa tidak mau -atas kehendak Allah- untuk disusui oleh para wanita. Maka tatkala saudari Musa melihat keinginan besar mereka untuk menyusukan Musa, dia berkata kepada mereka, “Maukah kalian aku tunjukkan satu keluarga yang bisa menyusui dan menjaganya, serta mereka berlaku baik terhadapnya?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Anak itu berada di istana Fir’aun setalah Allah menetapkan keamanan baginya dari orang yang paling zalim. Kemudian muncullah masalah penyusuannya; anak itu tidak mau menyusu kepada setiap wanita, dan Allah memberinya kedudukan di hati orang-orang, sehingga mereka harus mencari dengan sungguh-sungguh wanita yang dapat menyusuinya. Akhirnya pencarian mereka sampai pada saudarinya yang menunjukkan -dengan penuh kehati-hatian agar rahasianya tidak tersingkap- keluarga yang dapat mengasuh dan menyusuinya, dan mereka sangat baik sehingga tidak akan lalai dalam memberi kebaikan baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَحَرَّمْنَا عَلَيْهِ الْمَرَاضِعَ (dan Kami cegah Musa dari menyusu kepada perempuan-perempuan yang mau menyusui(nya)) Yakni Kami mencegahnya untuk menyusu dari wanita-wanita yang hendak menyusuinya. مِن قَبْلُ(sebelum itu) Yakni sebelum Kami mengembalikannya kepada ibunya. Istri Fir’aun meminta para wanita itu untuk menyusui Musa, namun ia tidak mau menyusu pada seorangpun dari mereka. فَقَالَتْ(maka berkatalah saudari Musa) Yakni saudari Musa berkata setelah melihatnya menolak untuk menyusu. هَلْ أَدُلُّكُمْ عَلَىٰٓ أَهْلِ بَيْتٍ يَكْفُلُونَهُۥ لَكُمْ (Maukah kamu aku tunjukkan kepadamu ahlul bait yang akan memeliharanya untukmu) Yakni yang menjamin bagi kalian untuk mengasuh dan menyusuinya. وَهُمْ لَهُۥ نٰصِحُونَ (dan mereka dapat berlaku baik kepadanya) Yakni mereka sangat sayang kepadanya dan tidak lalai dalam mengasuh dan menyusuinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12. Kami halangi Musa untuk menyusu kepada perempuan-perempuan yang mau menyusuinya sebelum kembali kepada ibunya. Kemudian saudari Musa berkata: \"Maukah kamu aku tunjukkan kepadamu satu keluarga yang akan merawatnya untukmu, dan mereka dapat mendidik, menyusui dan berlaku baik kepadanya dengan tulus?\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mencegahnya menyusu kepada perempuan-perempuan yang menyusui} Kami mencegah Musa menyusu kepada susu selain milik ibunya {sebelumnya} sebelum Kami mengembalikannya kepada ibunya {Dia berkata} saudara perempuan Musa berkata {“Maukah aku menunjukkan kepada kalian keluarga yang akan memeliharanya} yang mau menyusui dan memeliharanya {untuk kalian dan mereka dapat berlaku baik kepadanya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Di antara bentuk kasih sayang Allah kepada Musa dan ibunya adalah Allah mencegah Musa untuk menyusui dari perempuan (lain). Maka mereka membawanya ke pasar karena rasa kasihan kepadanya, barangkali di sana ada seseorang yang mencarinya. Maka datanglah saudara perempuannya itu dalam keadaan seperti tadi, “dan berkata, ‘Maukah aku tunjukkan kepadamu sebuah keluarga yang akan memeliharanya untukmu, dan mereka dapat berlaku baik kepadanya?’” inilah yang mereka inginkan, sebab mereka sangat mencintainya, sedangkan Allah mencegahnya dari menyusu kepada perempuan manapun, sehingga mereka khawatir kalau Musa meninggal."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 12: Allah kemudian mengabarkan bahwa Musa tidak ada yang menyusui dari perempuan mana pun. Pada keadaan yang demikian, hadirlah saudara perempuan Musa dan ia melihat dengan matanya sendiri bahwa mereka tidak ada yang dapat menyusui Musa. Dan ia menyarankan serta mengambil kesempatan tersebut dengan berkata : Maukah kalian aku kabarkan tentang seseorang yang mampu menyusui, yang mampu merawat, mengasuh dan menjaganya !!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Termasuk kelembutan Allah Subhaanahu wa Ta'aala kepada Musa dan ibunya adalah Dia mencegah Musa dari menyusu kepada wanita siapa pun selain ibunya. Mereka pun mencari-cari orang yang bisa menyusukannya, ketika itu saudari Nabi Musa melihatnya, namun mereka tidak mengetahui bahwa ia saudarinya. Saudarinya berkata, “Maukah kamu aku tunjukkan keluarga yang akan memeliharanya untukmu dan mereka dapat berlaku baik kepadanya?\" Ibnu Abbas berkata, “Ketika saudari Musa mengatakan seperti itu, mereka berkata kepadanya, “Tahu dari mana kamu bahwa ada orang yang siap berlaku baik dan sangat sayang kepadanya?” Saudari Musa pun berkata, “Karena ia ingin menggembirakan raja dan ingin mendapatkan manfaatnya.” Ketika itu mereka pun menuruti nasehatnya. Saat mereka sampai di hadapan ibu Nabi Musa, Musa pun mau menyusui. Mereka tidak menyadari bahwa itu adalah ibu Musa ‘alaihis salam. Mereka pun senang terhadapnya, dan mengirimkan seseorang untuk memberitahukan hal itu kepada Asiyah istri Fir’aun. Lalu dipanggillah ibu Nabi Musa serta ditawarkan untuk tinggal di rumahnya, namun ibu Nabi Musa menolak dengan alasan bahwa ia memiliki banyak anak yang harus diurus, ia akan siap mengurus jika Musa diurus di tempatnya saja. Maka Asiyah pun menerimanya dan mengirim Musa kepadanya dengan memberinya upah, di samping nafkah, pakaian dan pemberian lainnya. Subhaanallah! Nikmat yang begitu besar, anaknya kembali kepadanya, ditambah dengan mendapatkan imbalan yang banyak, Sungguh Allah tidak pernah mengingkari janji-Nya. Allah Subhaanahu wa Ta'aala berfirman, “Maka Kami kembalikan dia (Musa) kepada ibunya, agar senang hatinya dan tidak bersedih hati dan agar dia mengetahui bahwa janji Allah adalah benar, tetapi kebanyakan mereka tidak mengetahuinya.” (Terj. Al Qashshas: 13) Disebutkan dalam sebagian kitab tafsir, bahwa Musa ‘alaihis salam tinggal kembali bersama ibunya sampai masa menyapih selesai, dan ibunya mendapatkan upah karena menyusui Musa setiap hari satu dinar, dan ia mengambilnya, karena ia adalah harta kafir harbiy, lalu ibunya membawa ke hadapan Fir’aun dan tumbuhlah Nabi Musa ‘alaihis salam di sisinya, ia menaiki kendaraan kerajaan, memakai pakaian mereka, dsb. wallahu a’lam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 12",
    "description": "Selanjutnya, dikisahkan bagaimana musa kembali ke pangkuan ibunya. Allah berfirman ; dan kami cegah dia yakni musa, dengan cara membuatnya enggan menyusu kepada perempuan-perempuan yang mau menyusuinya sebelum itu yakni sebelum musa dikembalikan kepada ibunya untuk disusui. Kelurga fir'aun pun merasa cemas. Maka berkatalah dia yakni saudara perempuan musa, 'maukah aku tujukkan kepadamu, keluarga yang akan memeliharanya untukmu dan mereka dapat berlaku baik padanya ' saudara perempuan musa menyarankan agar ia disusui oleh perempuan yang tidak lain adalah ibunya sendiri. 13. Maka setelah keluarga fir'aun menyetujui usul agar musa disusui oleh seseorang. Yang tidak lain adalah ibunya kami kembalikan dia yakni musa kepada ibunya, agar senang hatinya dengan kebersamaan sang ibu dan anaknya tanpa rasa takut atau sembunyi-sembunyi dan agar dia tidak bersedih hati akibat berjauhan dan kecemasannya terhadap sang anak dan agar dia mengetahui dengan seyakin-yakinnya bahwa janji Allah untuk mengembalikan musa ke pangkuannya adalah benar sesuai dengan kenyataan. Demikianlah adanya, tetapi kebanyakan mereka yakni rezim fir'aun dan bahkan kebanyakan manusia tidak mengetahuinya."
  }
]