[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami kembalikan Musa kepada ibunya supaya matanya menjadi sejuk dengannya dan Kami tepati janji Kami kepadanya, pasalnya Musa kembali padanya dalam keadaan selamat dari dibunuh oleh Fir’aun, dan agar dia tidak bersedih atas perpisahan dengan Musa, dan agar ia yakin bahwa janji Allah itu benar dalam hal yang Dia janjikan kepadaNya berupa dikembalikannya Musa kepadanya dan menjadikannya sebagai utusan Allah. Sesungguhnya Allah tidak mengingkari janjiNya. Akan tetapi, kebanyakan orang musyrik tidak mengetahui bahwa janji Allah itu benar."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Maka kami kembalikan Musa kepada ibunya agar senang hatinya karena bisa melihatnya dari dekat dan tidak sedih karena berpisah dengannya, serta agar ibunya mengerti bahwa janji Allah untuk mengembalikan Musa kepadanya adalah benar, tidak ada keraguan padanya, akan tetapi sebagian besar dari mereka tidak mengetahui janji ini dan tidak ada seorangpun yang mengetahui bahwa dia adalah ibunya Musa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Dan terjadilah janji Allah yang tidak akan terpungkiri; anak itu sekarang berada di buaian ibunya, sehingga ibunya merasa sangat bahagia, kegalauan dan kekhawatirannya hilang seketika. Anak itu akan menjadi pelajaran dan ibrah bagi ibunya dan orang-orang yang berakal bahwa kehendak Allah pasti akan terlaksana, tidak ada yang mampu menolak ketetapan-Nya, meski seluruh penentang tidak mengetahui dan tidak menghormati kedudukan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَرَدَدْنٰهُ إِلَىٰٓ أُمِّهِۦ (Maka kami kembalikan Musa kepada ibunya) Maka saudari Musa menunjukkan mereka kepada ibu Musa sehingga mereka menyerahkannya kepada ibunya, lalu Musa langsung menerima susuannya. كَىْ تَقَرَّ عَيْنُهَا(supaya senang hatinya) Dengan anaknya yang telah kembali. وَلَا تَحْزَنَ(dan tidak berduka cita) Atas perpisahan dengannya. Terdapat sebuah riwayat dari Ibnu Abbas: bahwa ketika saudari Musa berkata kepada mereka وَهُمْ لَهُۥ نٰصِحُونَ “dan mereka dapat berlaku baik kepadanya.” Fir’aun dan kaumnya curiga kepadanya, kemudian mereka bertanya: “bagaimana kamu tahu mereka akan dapat berlaku baik dan menyayanginya?” Maka saudari Musa menjawab: “karena mereka ingin menyenangkan sang raja.” Lalu merekapun membiarkannya pergi. Setelah Musa mau menyusu kepada ibunya, istri Fir’aun jadi berbaik hati padanya dan memberinya harta dan pakaian. Yakni ibu Musa dapat menyusui anaknya dan mendapat upah dari musuhnya, dan ini merupakan pengaturan dari Allah yang Maha Bijaksana dan Maha Mengetahui. وَلِتَعْلَمَ أَنَّ وَعْدَ اللهِ(dan supaya ia mengetahui bahwa janji Allah itu) Yakni agar ia mengetahui semua janji Allah, dan salah satu janji itu bahwa Allah akan menepati janji-Nya yang Dia berikan kepada ibu Musa lewat firman-Nya: إِنَّا رَآدُّوهُ إِلَيْكِ “karena sesungguhnya Kami akan mengembalikannya kepadamu” حَقٌّ(adalah benar) Tidak akan diingkari, dan pasti terwujud. وَلٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ(tetapi kebanyakan manusia tidak mengetahuinya) Namun mereka lalai terhadap takdir dan rahasia ketetapan Allah. Atau kebanyakan manusia tidak mengetahui hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13. Maka kami kembalikan Musa kepada ibunya, supaya senang hatinya dan tidak berduka cita dan supaya ia mengetahui bahwa janji Allah itu adalah benar, tetapi kebanyakan manusia tidak mengetahui bahwa janji Allah itu pasti."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami mengembalikannya kepada ibunya agar hatinya senang dan tidak bersedih, dan agar dia mengetahui bahwa janji Allah itu benar, tetapi kebanyakan mereka tidak mengetahuinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Setelah saudara perempuannya itu mengatakan kepada mereka perkataan yang merangsang mereka agar mengasuhkannya kepada keluarga itu dengan jaminan akan dipelihar, diasuh dan diperlakukan baik, maka mereka segera memenuhi anjurannya. Lalu dia memberitahu kepada mereka dan menunjukkan di mana keluarga tersebut. “Maka Kami kembalikan Musa kepada ibunya,” sebagaimana Kami telah menjanjikannya, “supaya senang hatinya dan tidak berduka cita,” sehingga Musa terdidik di sisinya dengan sebaik mungkin yang mana sang ibu merasa aman, tenang dan bahagia dengannya serta mendapat upah yang sangat besar atas pengasuhannya itu. “Dan supaya ia mengetahui bahwa janji Allah itu adalah benar.” Maka Kami perlihatkan kepadanya dengan mata kepalanya sendiri sebagian apa yang telah Kami janjikan kepadanya agar dengan cara seperti itu hatinya menjadi tentram dan imannya makin bertambah, dan agar dia mengetahui bahwasanya janji Allah akan terpenuhi dalam melindungi Musa dan mengutusnya sebagai Rasul. “Tetapi kebanyakan manusia tidak mengetahuinya.” Apabila mereka melihat sebab kausalitas dalam keadaan rancu, maka hal itu akan mengacaukan keyakinan mereka karena mereka tidak memiliki ilmu (pengetahuan) yang cukup bahawasanya Allah menjadikan berbagai ujian dan cobaan yang sangat berat di balik perkara-perkara yang mulia dan utama yang sudah ada di depan mata. Musa pun terus berada di lingkungan keluarga Fir’aun dan di asuh di dalam kekuasaan mereka, dia bisa mengendarai berbagai jenis kendaraan dan mengenakan berbagai macam pakaian milik mereka, sedangkan ibunya dalam hal ini tetap merasa tentram. Dan oleh karena persepsi (umum) sudah melekat kuat bahwa ibunya itu adalah ibu dalam persusuan, maka tidak aneh kalau Musa sangat dekat kepadanya dan [sang ibu pun sangat menyayanginya]. Cobalah anda renungkan sejenak kasih sayang dan perlindungan (Allah) kepada nabiNya,Musa dari perangai dusta dalam rasa saling menyayangi antara dia dengan ibunya menjadi kental , yang (persepsinya) tampak bai orang lain bahwa dia adalah persusuan yang karenanya ia (sang ibu) disebut ibu, sehingga perkataan yang banyak keluar darinya dan orang-orang lain dalam masalah ini semuanya adalah kejujuran dan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 13: Dan tidaklah fir’aun dan istrinya kecuali mengiyakan hal tersebut, maka mereka berdua ditunjukkan menuju rumah ibu Musa; Maka kembalilah Musa kepada ibunya sebagaimana janji Allah, di mana ibu Musa dapat mengasuh, menjaga dan menyusuinya, dan agar ia tidak bersedih hati atas hilangnya dan jauhnya (anaknya) dari dirinya. Dan agar supaya ia faham bahwa janji Allah adalah kebenaran, tanpa keraguan padanya, akan tetapi kebanyakan manusia tidak mengetahui akan hal itu. Allah gantikan (ketaatan) ibu Musa dengan dikembalikannya Musa dan lebih dari hal itu dengan bayaran atas persusuannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Biasanya mereka apabila melihat sebabnya tidak jelas, maka iman mereka pun goyang karena pengetahuan mereka yang tidak sempurna, padahal Allah Subhaanahu wa Ta'aala mengadakan ujian yang berat dan rintangan yang besar sebelum perkara-perkara yang mengagumkan dan mulia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 13",
    "description": "Maka setelah keluarga fir'aun menyetujui usul agar musa disusui oleh seseorang. Yang tidak lain adalah ibunya kami kembalikan dia yakni musa kepada ibunya, agar senang hatinya dengan kebersamaan sang ibu dan anaknya tanpa rasa takut atau sembunyi-sembunyi dan agar dia tidak bersedih hati akibat berjauhan dan kecemasannya terhadap sang anak dan agar dia mengetahui dengan seyakin-yakinnya bahwa janji Allah untuk mengembalikan musa ke pangkuannya adalah benar sesuai dengan kenyataan. Demikianlah adanya, tetapi kebanyakan mereka yakni rezim fir'aun dan bahkan kebanyakan manusia tidak mengetahuinya. 14. Janji Allah untuk menjadikan musa sebagai salah seorang rasul dari kalangan bani lsrail itu benar. Dan kisahnya bermula dari setelah dia yakni musa dewasa dan sempurna jasmani dan akalnya, kami anugerahkan kepadanya hikmah yakni kenabian, kearifan, amal ilmiah dan pengetahuan yakni ilmu amaliah. Dan demikianlah, sebagaimana kami telah memberi balasan kepada musa atas ketaatannya, kami juga akan memberi balasan kepada orang-orang yang selalu berbuat baik."
  }
]