[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Musa memasuki kota dengan sembunyi-sembunyi ketika para penduduknya tengah lengah. Lalu dia mendapati padanya dua orang lelaki yang sedang berkelahi. Salah satunya dari kaum Musa dari kalangan Bani Israil dan lelaki lainnya dari kaum Fir’aun. Maka orang yang berasal dari kaum Musa meminta pertolongan (dari Musa) untuk melawan musuhnya. Lalu Musa meninjunya dengan kepalan tangannya, sehingga lelaki itu mati. Ketika membunuhnya, Musa berkata, “Ini adalah hasutan setan dengan menyulut emosi amarahku, sehingga aku memukulnya dan ia menjadi binasa. Sesungguhnya setan itu adalah musuh bagi anak keturunan Adam, menyesatkan dari jalan lurus, lagi sangat nyata permusuhannya.” Perbuatan Musa ini terjadi sebelum ia menjadi seorang nabi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. Musa masuk ke dalam kota saat penduduknya sedang lengah. Lalu di kota itu Musa bertemu dengan dua orang yang sedang bertengkar dan saling memukul, salah satunya berasal dari Bani Israil, kaum Musa -'alaihissalām- dan yang satunya lagi dari Qibṭi, kaum Fir'aun musuh Musa. Lalu orang yang berasal dari kaumnya meminta tolong menghadapi orang yang dari kaum Qibṭi, musuhnya. Maka Musa memukulnya dengan genggaman tangannya dan membunuhnya dengan pukulan itu karena kuatnya pukulannya. Musa berkata, “Ini adalah dari perbuatan yang diperindah oleh setan dan tipu dayanya, sesungguhnya setan adalah musuh yang menyesatkan bagi orang yang mengikutinya dengan permusuhan yang nyata. Maka apa yang terjadi padaku adalah akibat permusuhannya dan karena setan itu menyesatkan, maka ia ingin menyesatkanku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. Musa memasuki salah satu kota Fir’aun -sebelum dia diangkat menjadi nabi- dengan sembunyi-sembunyi karena dia takut dari kaum Fir’aun, ketika itu penduduk kota itu sedang beristirahat dan jalan-jalan lengang dari mereka. Ternyata terdapat dua orang yang saling berselisih, salah satunya dari Bani Israil dan yang satu lagi dari kaum Fir’aun al-Qibthi, dan kedua golongan ini saling bermusuhan. Perselisihan mereka berdua semakin tegang, sehingga orang dari Bani Israil meminta Musa agar membantunya melawan orang Qibthi; maka Musa meninjunya dan tanpa disengaja mengenai bagian rawan dari tubuh orang Qibthi sehingga dia meninggal, padahal dia tidak berniat membunuhnya. Ketika Musa melihat keadaan itu, dia berkata: “Perbuatan yang aku lakukan ini berasal dari godaan setan, dia adalah musuh yang jelas bagi manusia, dan dia selalu menyesatkan mereka dari jalan yang lurus.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. وَدَخَلَ الْمَدِينَةَ (Dan Musa masuk ke kota) Yakni dan Musa memasuki negeri Mesir raya. عَلَىٰ حِينِ غَفْلَةٍ مِّنْ أَهْلِهَا(ketika penduduknya sedang lengah) Yakni masuk dengan sembunyi-sembunyi. Terdapat pendapat mengatakan bahwa ketika Musa mengetahui kebenaran yang ada dalam agamanya itu berselisih dengan agama kaum Fir’aun dan merendahkan agama mereka, dan kabar ini telah menyebar, maka mereka menakut-nakuti Musa sehingga Musa merasa takut, oleh sebab itu ia tidak memasuki negeri Mesir kecuali dengan sembunyi-sembunyi. فَوَجَدَ فِيهَا رَجُلَيْنِ يَقْتَتِلَانِ هٰذَا مِن شِيعَتِهِۦ(maka didapatinya di dalam kota itu dua orang laki-laki yang berkelahi; yang seorang dari golongannya) Orang yang mengikutinya di atas agamanya, yaitu Bani Israil. وَهٰذَا مِنْ عَدُوِّهِۦ ۖ( dan seorang (lagi) dari musuhnya) Yakni dari kaum Fir’aun. فَاسْتَغٰثَهُ الَّذِى مِن شِيعَتِهِۦ عَلَى الَّذِى مِنْ عَدُوِّهِۦ(Maka orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya) Yakni ia meminta pertolongan kepada Musa. فَوَكَزَهُۥ مُوسَىٰ( lalu Musa meninjunya) Makna (الوكز) yakni memukulnya dengan tongkatnya. فَقَضَىٰ عَلَيْهِ ۖ( dan matilah musuhnya itu) Makna (قضى) adalah membunuhnya. Dan segala yang telah diselesaikan bermakna (قضى). Terdapat pendapat mengatakan bahwa Musa tidak bermaksud membunuh orang Mesir itu, namun ia hanya ingin mendorongnya tetapi yang terjadi ia malah memukulnya, oleh sebab itu ia berkata هٰذَا مِنْ عَمَلِ الشَّيْطٰنِۖ(“Ini adalah perbuatan syaitan) sebab ia tidak diperintahkan untuk membunuhnya. Pendapat lain mengatakan bahwa saat itu ia tidak boleh melakukan peperangan dengan mereka sebab ia telah mandapat jaminan keamanan dari mereka, sehingga ia tidak berhak untuk membunuh mereka. إِنَّهُۥ عَدُوٌّ مُّضِلٌّ مُّبِينٌ(sesungguhnya syaitan itu adalah musuh yang menyesatkan lagi nyata (permusuhannya)) Yakni musuh bagi manusia yang selalu berusaha menyesatkan mereka dengan permusuhan dan penyesatan yang nyata."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15. Musa masuk ke kota Memphis ibukota Pharaoh ketika penduduknya sedang lengah, yaitu sebelum kenabian. Di dalam kota itu dia mendapati dua orang laki-laki yang berkelahi; seorang berasal dari golongan Bani Israil dan seorang lagi dari musuhnya yaitu kaum Fir´aun. Maka orang yang berasal dari golongannya meminta pertolongan kepada nabi Musa, untuk mengalahkan orang yang berasal dari musuhnya. Lalu Musa meninjunya, dan matilah musuhnya itu. Musa berkata: \"Ini adalah perbuatan syaitan sesungguhnya syaitan itu adalah musuh yang menyesatkan lagi nyata (permusuhannya). Perkelahian itu terjadi pada saat nabi Musa masih muda, sebab nabi Musa baru mendapat wahyu saat usianya empat puluh tahun yaitu setelah menikahi puteri nabi Syu’aib."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia masuk ke kota ketika penduduknya sedang lengah. Dia mendapati di dalamnya dua laki-laki yang sedang berkelahi} saling berkelahi dan berselisih {seorang dari golongannya} dari golongan Bani Israil, yaitu kaum Musa {dan seseorang dari golongan musuhnya} dari musuhnya suku Qibthi, yaitu kaum Firʻaun {Orang yang berasal dari golongannya meminta pertolongan kepadanya atas orang dari musuhnya. Lalu Musa memukulnya} lalu Musa memukulnya dengan seluruh kepalannya {dan dia membunuhnya} membunuhnya {Dia berkata} Musa berkata {“Ini termasuk perbuatan setan. Sesungguhnya dia adalah musuh yang jelas-jelas menyesatkan”} yang tampak permusuhannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17. “Dan Musa masuk ke kota (Memphis) ketika penduduknya sedang lengah,” bisa jadi saat tidur siang atau waktu-waktu lainnya yang saat itu mereka beristirahat tidak berkeliaran, “maka dia mendapati di dalam kota itu dua orang laki-laki yang berkelahi.” Maksudnya, bertengkar dan saling memukul. “Yang seorang dari golongannya,” maksudnya berasal dari Bani Israil, “dan seorang (lagi) dari musuhnya,” bangsa Qibthi. “Maka orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya,” sebab dia telah terkenal dan diketahui oleh banyak orang bahwa dia (Musa) berasal dari Bani Israil. Dan permintaan pertolongannya kepada Musa adalah salah satu bukti yang menunjukkan bahwa Musa sudah mencapai usia yang cukup ditakuti dan dijadikan andalan dari kerajaan dan kesulitan. “Lalu Musa meninjunya.” Maksudnya, dia meninju orang yang berasal dari musuhnya unttuk memenuhi permintaan tolong orang yang berdarah Bani Israil itu, “dan matilah musuhnya itu.” Musa telah menewaskannya dengan tinjuannya itu karena kerasnya dan kekuatan Musa. Lalu Musa menyesali perbuatannya itu, dan “berkata, ‘Ini adalah perbuatan setan’,” yakni: Rayuan dan bisikannya. “Sesungguhnya setan itu musuh yang menyesatkan lagi nyata,” maka dari itu aku melakukan apa yang telah terlanjur aku lakukan disebutkan permusuhannya yang sangat nyata dan upaya kerasnya menyesatkan. Lalu dia meminta ampun seraya “berkata, ‘Ya Rabb ku, sesungguhnya aku telah menganiaya diriku sendiri, karena itu ampunilah aku.’ Maka Allah mengampuninya. Sesungguhnya Allah, DIa-lah Yang Maha Pengampun lagi Maha Penyayang,” terutama kepada orang-orang yang tunduk kembali kepadaNya, yaitu orang-orang yang segera kembali kepadaNya, yaitu orang-orang yang segera kembali bertaubat, seperti yang telah dilakukan oleh Musa. Maka Musa “berkata, ‘Ya Rabbku, demi nikmat yang telah Engkau anugerahkan kepadaku’,” yaitu berupa taubat, ampunan dan berbagai nikmat yang sangat banyak, “aku sekali-kali tiada akan menjadi penolong,” maksudnya pembela dan pembantu “bagi orang-orang yang berdosa.” Maksudnya, aku tidak akan menolong seorang pun untuk kemaksiatan. Ini adalah janji dari Musa, disebabkan karena karunia Allah atas dirinya yaitu tidak akan menolong seorang yang berbuat dosa sebagaimana telah dia lakukan dalam pembunuhan terhadap orang yang berdarah Qibthi tersebut. Ini mengartikan bahwa berbagai kenikmatan itu menuntut hamba untuk melakukan kebaikan-kebaikan dan meninggalkan keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 15: Kemudian Musa memasuki kota di waktu penduduknya lengah, maka Musa mendapati dua orang laik-laki sedang berkelahi, saling umpat dan pukul, salah satu dari keduanya adalah dari bani israil yaitu dari kaum Musa dan satu lagi dari kaum fir’aun. Ia yang dari bani israil meminta pertolongan kepada Musa dari kaum fir’auun; Maka Musa menolongnya dan dipukul oleh ia yang dari kaum fir’aun dengan keadaan Musa membela diri. Maka matilah ia yang dari kaum fir’aun karena sebab Musa yang membela diri, sedangkan Musa tidak bermaksud untuk membunuhnya. Maka musa geram dan berkata : Kejadian ini adalah hiasan setan, bisikan dan hasutan darinya, sesungguhnya setana adalah musuh yang nyata, musuh bagi bani adam, yang tersesat dari kebenaran serta jalan yang lurus, sungguh jelas permusuhannya secara nyata dan menyesatkan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, pada waktu tengah hari, di waktu penduduk sedang istirahat. Sebab terjadi perkelahian adalah seperti yang diceritakan Qatadah, yaitu, “Orang Qibthi ingin memaksa seorang dari Bani Israil membawa kayu bakar ke dapur Fir’aun, namun ia menolaknya.” Menurut Sa’id bin Jubair, bahwa ia (orang Qibthi) tersebut adalah tukang masak di dapur Fir’aun. Karena Musa ‘alaihis salam telah dikenal termasuk Bani Israil. Maka Nabi Musa ‘alaihis salam menolongnya, dan menolong orang yang terzalimi adalah wajib dalam semua syariat. Beliau (Nabi Musa) ‘alaihis salam adalah seorang yang memiliki tenaga yang kuat. Yakni membunuh. Maksudnya, Musa menyesal atas kematian orang itu disebabkan pukulannya, karena dia bukanlah bermaksud untuk membunuhnya, tetapi semata-mata membela kaumnya, dan yang demikian merupakan hiasan dan was-was setan. Oleh karena itulah terjadi perbuatan itu disebabkan permusuhannya yang nyata dan keinginannya untuk menyesatkan manusia."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 15",
    "description": "Dan setelah Musa dewasa dan setelah sekian lama tinggal di istana, pada suatu hari dia masuk ke salah satu kota di wilayah kekuasaan Fir?aun yaitu Memphis atau Ain Syams, ketika penduduknya sedang lengah, yakni saat penduduknya sedang istirahat sehingga jalan-jalan menjadi sepi. Lalu dia mendapati di dalam kota itu dua orang laki-laki sedang berkelahi; yang seorang dari golongannya yaitu seorang lbrani dari Bani lsrail, dan yang seorang lagi dari pihak musuhnya, yaitu bangsa Mesir kaum Fir?aun. Orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari pihak musuhnya. Memperkenankan permintaan itu Ialu Musa meninjunya, dan matilah musuhnya itu. Setelah menyadari kematian orang yang ditinjunya Dia yakni Musa, dengan sangat menyesal berkata, 'Yang kulakuka Ini adalah perbuatan setan yang selalu rnendorong kepada kejahatan dan kesalahan. Sungguh, dia, yakni setan itu, adalah musuh abadi manusia yang jelas menyesatkan siapa pun yang lengah.\" Musa menyesal atas kematian orang itu karena pukulannya, sebab dia bukanlah bermaksud untuk membunuhnya, tetapi hanya semata-mata membela kaumnya. lni terjadi sebelum Musa diangkat sebagai Nabi.16. Setelah Musa menyadari kesalahannya dan menyesali perbuatannya, kini dia memohon ampunan dengan berdoa, \"Ya Tuhanku, sesungguhnya aku telah menzalimi diriku sendiri karena melakukan sesuatu yang mengakibatkan kematian seseorang, walau sebenarnya aku tidak sengaja melakukannya, dan aku sadar telah dipedaya oleh setan, maka ampunilah aku atas kesalahanku itu.\" Maka Dia yakni Allah mengampuni kesalahannya. Sungguh, itu disebabkan karena Allah bukan selain-Nya, Dialah Yang Maha Pengampun bagi siapa pun yang memohon ampunan-Nya, Maha Penyayang terhadap semua mahluk-Nya, terutama orang-orang beriman."
  }
]