[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata, “Wahai Tuhanku, sesungguhnya aku telah menzhalimi diriku sendiri dengan membunuh jiwa yang Engkau tidak memerintahkan aku untuk membunuhnya. Maka ampunilah dosaku itu.” Maka Allah mengampuninya. Sesungguhnya Allah Maha Pengampun dosa-dosa hamba-hambaNya, juga Maha Penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Musa berkata sambil berdoa kepada Rabbnya dengan mengakui apa yang telah dilakukannya, “Wahai Rabbku! Sesungguhnya aku telah menganiaya diriku sendiri karena membunuh orang Qibṭi ini, maka ampunilah dosaku.” Maka Allah menjelaskan kepada kita tentang pengampunan-Nya kepada Musa. Sesungguhnya Dia Maha Pengampun bagi orang-orang yang bertobat di antara hamba-hamba-Nya dan Maha Penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Musa sangat menyesal telah melakukan pembunuhan secara tidak sengaja, sehingga dia berdoa kepada Tuhannya bahwa dia telah menzalimi dirinya sendiri dan telah terbawa amarahnya. Maka Allah mengampuni kesalahannya, karena Allah Maha mengampuni dosa hamba-hamba-Nya dan Maha Luas rahmat-Nya bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. قَالَ رَبِّ إِنِّى ظَلَمْتُ نَفْسِى فَاغْفِرْ لِى فَغَفَرَ (Musa mendoa: “Ya Tuhanku, sesungguhnya aku telah menganiaya diriku sendiri karena itu ampunilah aku”. Maka Allah mengampuni) Yakni Allah mengampuninya. لَهُۥٓ ۚ(dirinya) Atas kesalahan tersebut. إِنَّهُۥ هُوَ الْغَفُورُ الرَّحِيمُ(sesungguhnya Allah Dialah Yang Maha Pengampun lagi Maha Penyayang) Ia memohon ampun karena ia tidak memiliki hak untuk membunuh orang yang tidak bersalah yang menyebabkannya layak untuk dihukum mati."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16. Musa berdoa: \"Ya Tuhanku, sesungguhnya aku telah menganiaya diriku sendiri karena itu ampunilah aku\". Maka Allah mengampuninya, sesungguhnya Allah Dialah Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dia berdoa, “Ya Tuhanku, sesungguhnya aku telah menzalimi diriku sendiri, maka ampunilah aku.” Lalu Dia mengampuninya. Sesungguhnya Dialah Dzat Yang Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17. “Dan Musa masuk ke kota (Memphis) ketika penduduknya sedang lengah,” bisa jadi saat tidur siang atau waktu-waktu lainnya yang saat itu mereka beristirahat tidak berkeliaran, “maka dia mendapati di dalam kota itu dua orang laki-laki yang berkelahi.” Maksudnya, bertengkar dan saling memukul. “Yang seorang dari golongannya,” maksudnya berasal dari Bani Israil, “dan seorang (lagi) dari musuhnya,” bangsa Qibthi. “Maka orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya,” sebab dia telah terkenal dan diketahui oleh banyak orang bahwa dia (Musa) berasal dari Bani Israil. Dan permintaan pertolongannya kepada Musa adalah salah satu bukti yang menunjukkan bahwa Musa sudah mencapai usia yang cukup ditakuti dan dijadikan andalan dari kerajaan dan kesulitan. “Lalu Musa meninjunya.” Maksudnya, dia meninju orang yang berasal dari musuhnya unttuk memenuhi permintaan tolong orang yang berdarah Bani Israil itu, “dan matilah musuhnya itu.” Musa telah menewaskannya dengan tinjuannya itu karena kerasnya dan kekuatan Musa. Lalu Musa menyesali perbuatannya itu, dan “berkata, ‘Ini adalah perbuatan setan’,” yakni: Rayuan dan bisikannya. “Sesungguhnya setan itu musuh yang menyesatkan lagi nyata,” maka dari itu aku melakukan apa yang telah terlanjur aku lakukan disebutkan permusuhannya yang sangat nyata dan upaya kerasnya menyesatkan. Lalu dia meminta ampun seraya “berkata, ‘Ya Rabb ku, sesungguhnya aku telah menganiaya diriku sendiri, karena itu ampunilah aku.’ Maka Allah mengampuninya. Sesungguhnya Allah, DIa-lah Yang Maha Pengampun lagi Maha Penyayang,” terutama kepada orang-orang yang tunduk kembali kepadaNya, yaitu orang-orang yang segera kembali kepadaNya, yaitu orang-orang yang segera kembali bertaubat, seperti yang telah dilakukan oleh Musa. Maka Musa “berkata, ‘Ya Rabbku, demi nikmat yang telah Engkau anugerahkan kepadaku’,” yaitu berupa taubat, ampunan dan berbagai nikmat yang sangat banyak, “aku sekali-kali tiada akan menjadi penolong,” maksudnya pembela dan pembantu “bagi orang-orang yang berdosa.” Maksudnya, aku tidak akan menolong seorang pun untuk kemaksiatan. Ini adalah janji dari Musa, disebabkan karena karunia Allah atas dirinya yaitu tidak akan menolong seorang yang berbuat dosa sebagaimana telah dia lakukan dalam pembunuhan terhadap orang yang berdarah Qibthi tersebut. Ini mengartikan bahwa berbagai kenikmatan itu menuntut hamba untuk melakukan kebaikan-kebaikan dan meninggalkan keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 16: Musa berdoa kepada Tuhannya atas peristiwa yang dia alami dengan berkata : Wahai Tuhanku sungguh diriku dzalim, bersalah dengan membunuh laki-laki ini di mana aku sendiri tidak memiliki keinginan untuk membunuhnya, aku memohon ampun. Maka Allah mengabulkan dan mengampuninya serta memaafkannya, sungguh Allah banyak pengampunan-Nya bagi siapa yang meminta ampunan dari-Nya. Dialah yang maha suci dan sayang kepada hamba-Nya yang jujur akan taubatnya dan mengampuni akan dosa-dosanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 16",
    "description": "Setelah musa menyadari kesalahannya dan menyesali perbuatannya, kini dia memohon ampunan dengan berdoa, \"ya tuhanku, sesungguhnya aku telah menzalimi diriku sendiri karena melakukan sesuatu yang mengakibatkan kematian seseorang, walau sebenarnya aku tidak sengaja melakukannya, dan aku sadar telah dipedaya oleh setan, maka ampunilah aku atas kesalahanku itu. \" maka dia yakni Allah mengampuni kesalahannya. Sungguh, itu disebabkan karena Allah bukan selain-Nya, dialah yang maha pengampun bagi siapa pun yang memohon ampunan-Nya, maha penyayang terhadap semua mahluk-Nya, terutama orang-orang beriman. 17. Puji syukur atas segala anugerah dan nikmat Allah selama ini juga dia panjatkan dengan berkata, \"ya tuhanku! demi dan disebabkan nikmat yang selama ini telah engkau anugerahkan kepadaku sejak dalam perut ibu hingga tobat dan pengampunan-Mu ini, serta aneka nikmat lainnya, maka demi semua itu aku berjanji tidak akan menjadi penolong bagi orang-orong yang berdosa dalam melakukan perbuatan jahat, \"."
  }
]