[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata, “Wahai Tuhanku, melalui anugerah yang Engkau curahkan kepadaku dengan menerima taubatku, memberikan ampunan dan kenikmatan-kenikmatan yang melimpah, maka aku tidak akan menjadi penolong bagi siapa pun untuk melakukan perbuatan maksiat dan perbuatan jahatnya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Musa berkata, “Wahai Rabbku! Karena Engkau telah memberi karunia kepadaku berupa kekuatan, hikmat dan ilmu, maka aku sekali-kali tidak akan mau menjadi penolong bagi orang-orang jahat dalam melakukan kejahatan mereka.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Musa melanjutkan doanya: “Ya Allah, dengan ilmu, hikmah, dan pemahaman yang telah Engkau curahkan kepadaku sehingga aku dapat mengetahui kebenaran, maka aku tidak akan menjadi penolong orang-orang zalim, dan aku hanya akan menjadi penolong kebenaran dan orang-orang yang benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. قَالَ رَبِّ بِمَآ أَنْعَمْتَ عَلَىَّ فَلَنْ أَكُونَ ظَهِيرًا لِّلْمُجْرِمِينَ (Musa berkata: “Ya Tuhanku, demi nikmat yang telah Engkau anugerahkan kepadaku, aku sekali-kali tiada akan menjadi penolong bagi orang-orang yang berdosa”) Yakni karena Engkau telah memberiku kenikmatan barupa ilmu, hikmah, dan ampunan, maka aku tidak akan menolong orang jahat dalam melakukan kejahatannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17. Musa berkata: \"Ya Tuhanku, demi nikmat yang telah Engkau anugerahkan kepadaku, aku sekali-kali tidak akan menjadi penolong atas perbuatan dosa orang-orang yang durhaka.\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Ya Tuhanku, karena nikmat yang telah Engkau anugerahkan kepadaku, sehingga aku tidak akan menjadi penolong} penyelamat {bagi orang-orang yang berbuat durhaka”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15-17. “Dan Musa masuk ke kota (Memphis) ketika penduduknya sedang lengah,” bisa jadi saat tidur siang atau waktu-waktu lainnya yang saat itu mereka beristirahat tidak berkeliaran, “maka dia mendapati di dalam kota itu dua orang laki-laki yang berkelahi.” Maksudnya, bertengkar dan saling memukul. “Yang seorang dari golongannya,” maksudnya berasal dari Bani Israil, “dan seorang (lagi) dari musuhnya,” bangsa Qibthi. “Maka orang yang dari golongannya meminta pertolongan kepadanya, untuk mengalahkan orang yang dari musuhnya,” sebab dia telah terkenal dan diketahui oleh banyak orang bahwa dia (Musa) berasal dari Bani Israil. Dan permintaan pertolongannya kepada Musa adalah salah satu bukti yang menunjukkan bahwa Musa sudah mencapai usia yang cukup ditakuti dan dijadikan andalan dari kerajaan dan kesulitan. “Lalu Musa meninjunya.” Maksudnya, dia meninju orang yang berasal dari musuhnya unttuk memenuhi permintaan tolong orang yang berdarah Bani Israil itu, “dan matilah musuhnya itu.” Musa telah menewaskannya dengan tinjuannya itu karena kerasnya dan kekuatan Musa. Lalu Musa menyesali perbuatannya itu, dan “berkata, ‘Ini adalah perbuatan setan’,” yakni: Rayuan dan bisikannya. “Sesungguhnya setan itu musuh yang menyesatkan lagi nyata,” maka dari itu aku melakukan apa yang telah terlanjur aku lakukan disebutkan permusuhannya yang sangat nyata dan upaya kerasnya menyesatkan. Lalu dia meminta ampun seraya “berkata, ‘Ya Rabb ku, sesungguhnya aku telah menganiaya diriku sendiri, karena itu ampunilah aku.’ Maka Allah mengampuninya. Sesungguhnya Allah, DIa-lah Yang Maha Pengampun lagi Maha Penyayang,” terutama kepada orang-orang yang tunduk kembali kepadaNya, yaitu orang-orang yang segera kembali kepadaNya, yaitu orang-orang yang segera kembali bertaubat, seperti yang telah dilakukan oleh Musa. Maka Musa “berkata, ‘Ya Rabbku, demi nikmat yang telah Engkau anugerahkan kepadaku’,” yaitu berupa taubat, ampunan dan berbagai nikmat yang sangat banyak, “aku sekali-kali tiada akan menjadi penolong,” maksudnya pembela dan pembantu “bagi orang-orang yang berdosa.” Maksudnya, aku tidak akan menolong seorang pun untuk kemaksiatan. Ini adalah janji dari Musa, disebabkan karena karunia Allah atas dirinya yaitu tidak akan menolong seorang yang berbuat dosa sebagaimana telah dia lakukan dalam pembunuhan terhadap orang yang berdarah Qibthi tersebut. Ini mengartikan bahwa berbagai kenikmatan itu menuntut hamba untuk melakukan kebaikan-kebaikan dan meninggalkan keburukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 17: Musa berkata : Ya Tuhanku, sebagaimana Eengkau berikan nikmat kepadaku dengan kekuatan jisim (badan), dengan menerima taubatku dan dengan mengampuni dosa-dosaku; Maka sungguh aku tidak akan menjadi penolong bagi siapapun dari para pendosa yang melakukan dosa dan kerusakan. Musa mengatakan demikian sebagai penyempurna taubatnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti diterima tobatnya dan diampuni serta diberikan berbagai nikmat. Beliau berjanji tidak akan menolong seorang pun di atas maksiat atau tidak akan menolong orang yang bersalah. Hal ini menunjukkan bahwa nikmat yang diberikan menghendaki agar seorang hamba mengerjakan kebaikan dan meninggalkan keburukan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 17",
    "description": "Puji syukur atas segala anugerah dan nikmat Allah selama ini juga dia panjatkan dengan berkata, \"ya tuhanku! demi dan disebabkan nikmat yang selama ini telah engkau anugerahkan kepadaku sejak dalam perut ibu hingga tobat dan pengampunan-Mu ini, serta aneka nikmat lainnya, maka demi semua itu aku berjanji tidak akan menjadi penolong bagi orang-orong yang berdosa dalam melakukan perbuatan jahat, \"18. Karena pembunuhan tak disengaja yang dilakukan oleh musa itu, dia menjadi ketakutan berada di kota tempat terjadinya perkelahian dan pembunuhan itu sambil menunggu dengan perasaan cemas dan khawatir akibat yang akan diterima dari perbuatannya. Tiba-tiba orang lbrani yang kemarin meminta pertolongan yakni pada hari terjadinya perkelahian dan pembunuhan terhadap orang mesir, berteriak meminta pertolong-an lagi kepadanya. Tapi kali ini mengecam dan menghardiknya. Musa berkata kepadanya, \"engkau sungguh, orang yang nyata-Nyata sesat. \"."
  }
]