[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Karenanya, di dalam kota, Musa menjadi takut kepada Fir’aun, ia mencari tahu tentang berita yang diperbincangkan oleh masyarakat terkait dirinya dan korban yang dibunuhnya. Lalu ia melihat temannya yang kemarin beradu senjata dengan orang lain dari suku Qibthi dan meminta pertolongan darinya, maka Musa berkata kepadanya, “Sesungguhnya kamu itu benar-benar banyak berbuat penyimpangan dan nyata kesesatannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Tatkala sudah terjadi apa yang terjadi padanya yaitu pembunuhan terhadap orang Qibṭi, Musa pun mulai merasa takut di kota itu, menunggu apa yang akan terjadi. Namun tiba-tiba orang yang meminta tolong darinya dalam menghadapi musuhnya dari kaum Qibṭi kemarin meminta tolong lagi untuk menghadapi orang Qibṭi yang lain. Maka Musa berkata kepadanya, “Sesungguhnya engkau benar-benar dalam penyimpangan dan kesesatan yang nyata.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Musa meninggalkan tempat terbunuhnya orang Qibthi itu -dan berita tentang kejadian ini belum tersebar- karena dia takut akan dituntut atas pembunuhannya; dia memperhatikan berita tentang dirinya dan berusaha untuk melarikan diri dan bersembunyi. Ketika dia berjalan, dia bertemu lagi dengan orang dari Bani Israil yang dia bantu pada hari sebelumnya, orang itu sedang berselisih dengan orang Qibthi yang lain, sehingga dia meminta pertolongan dari Musa. Maka Musa berkata kepadanya: “Sungguh kamu adalah orang yang sesat, berperilaku buruk, dan gemar berselisih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. فَأَصْبَحَ فِى الْمَدِينَةِ خَآئِفًا يَتَرَقَّبُ (Karena itu, jadilah Musa di kota itu merasa takut menunggu-nunggu dengan khawatir) Yakni pada waktu pagi, Musa memasuki kota tempat ia membunuh orang Mesir itu untuk mengawasi keadaan yang tidak ia harapkan atau menunggu jalan keluar. فَإِذَا الَّذِى اسْتَنصَرَهُۥ بِالْأَمْسِ يَسْتَصْرِخُهُۥ ۚ( maka tiba-tiba orang yang meminta pertolongan kemarin berteriak meminta pertolongan kepadanya) Yakni ternyata dia adalah orang dari Bani Israil yang kemarin meminta pertolongan, ia sedang berkelahi dengan orang Mesir yang lain, ia hendak menyiksa dan menzaliminya. قَالَ لَهُۥ مُوسَىٰٓ إِنَّكَ لَغَوِىٌّ مُّبِينٌ (Musa berkata kepadanya: “Sesungguhnya kamu benar-benar orang sesat yang nyata”) Yang nyata kesesatannya. Hal ini karena ia kemarin telah menyebabkannya membunuh seseorang, dan sekarang ia hendak kembali menyebabkannya membunuh orang lain lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18. Karena itu, Musa merasa takut, menunggu-nunggu dengan khawatir akibat perbuatannya di kota itu, maka tiba-tiba orang yang meminta pertolongan kemarin berteriak meminta pertolongan kepadanya. Musa berkata kepadanya: \"Sesungguhnya kamu benar-benar orang sesat yang nyata kesesatannya\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia menjadi ketakutan berada di kota sambil menunggu} menunggu hal buruk yang akan dia dapatkan dari mereka {Tiba-tiba orang yang kemarin meminta pertolongan kepadanya berteriak-teriak meminta pertolongan kepadanya} meminta pertolongan kepadanya atas suku Qibrhi lainnya {Musa berkata kepadanya,“Sesungguhnya kamu adalah orang yang benar-benar sesat”} benar-benar sangat sesat dan buruk dalam melihat {dengan nyata} tampak kesesatannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. Setelah terjadi pembunuhan yang dilakukannya terhadap orang yang berasal dari musuhnya, maka dia menjadi “merasa takut menunggu-nunggu di kota itu,” apakah diketahui oleh keluarga Fira’un ataukah tidak? Sebenarnya dia merasa takut, karena dia tahu bahwa tidak akan seorang pun yang berani melakukan perbiatan seperti ini kecuali Musa dari Bani Israil. Ketika dia dalam keadaan seperti itu, “maka tiba-tiba orang yang meminta pertolongan kemarin,” untuk melawan musuhnya, “berteriak meminta pertolongan kepadanya,” untuk melawan seorang Qibthi lain. “Musa berkata kepadanya,” seraya mencela sikap orang itu, “Sesungguhnya kamu benar-benar orang sesat yang nyata,” maksudnya nyata kesesatannya dan menampakkan kelancangan. “Maka tatkala dia hendak memegang dengan keras,” maksudnya, Musa hendak mencengkeram dengan keras “orang yang menjadi musuh keduanya,” musuhnya dan musuh orang yang meminta pertolongan kepada Musa. Maksudnya, pada saat perkelahian sedang berlangsung antara orang dari bangsa Qibthi dan seorang berkebangsaan Israil, maka yang dari bangsa Israil ini meminta pertolongan kepada Musa, lalu jiwa kesukuan pun bangkit hingga membuat Musa bermaksud menampar orang Qibthi itu, maka “musuhnya berkata,” maksudnya orang yang dari bangsa Qibthi itu berkata kepada Musa untuk mencela tindakannya membunuh orang lain, “apakah kamu bermaksud hendak membunuhku, sebagaimana kamu kemarin telah membunuh seorang manusia? Kamu tidak bermaksud melainkan hendak menjadi orang yang berbuat sewenang-wenang di bumi ini,” karena diantara jejak terbesar dari tindakan orang yang semena-mena di bumi ini adalah membunuh jiwa manusia dengan alasan tidak benar, “dan tiadalah kamu hendak menjadi salah seorang dari orang-orang yang mengadakan perdamaian.” Kalau tidak, dan kalau seandainya kamu menghendaki perdamaian, niscaya kamu telah melerai antara aku dengannya tanpa harus membunuh salah satu (di antara kami). Maka Musa menahan diri dari membunuhnya dan sadar karena nasihat dan tegurannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 18: Jadilah Musa di kota ketakutan dengan apa yang telah ia lakukan, mengantisipasi atas peristiwa yang telah terjadi padanya. Ketika Musa seperti itu, maka ketika ada laki-laki kemarin yang meminta pertolongan maka dia berdoa agar tidak berlaku dzalim kepada laki-laki lain dari kaum fir’aun. Maka ketika laki-laki yang kemarin itu mendekat kepada Musa, ia berkata dengan marah : Sungguh engkau adalah orang yang sesat, dengan kesesatan yang banyak dan suka berselisih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah keluarga Fir’aun tahu peristiwa itu atau tidak? Beliau takut, karena sudah diketahui, bahwa tidak ada yang berani berbuat seperti itu selain Musa yang berasal dari Bani Israil. Untuk menghadapi orang Qibthi yang lain. Yakni, mencelanya. Karena perbuatanmu yang sekarang dan kemarin."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 18",
    "description": "Karena pembunuhan tak disengaja yang dilakukan oleh Musa itu, dia menjadi ketakutan berada di kota tempat terjadinya perkelahian dan pembunuhan itu sambil menunggu dengan perasaan cemas dan khawatir akibat yang akan diterima dari perbuatannya. Tiba-tiba orang lbrani yang kemarin meminta pertolongan yakni pada hari terjadinya perkelahian dan pembunuhan terhadap orang Mesir, berteriak meminta pertolong-an lagi kepadanya. Tapi kali ini mengecam dan menghardiknya. Musa berkata kepadanya, \"Engkau sungguh, orang yang nyata-nyata sesat.\"19. Kecaman itu tidak menghalangi Nabi Musa untuk menyambut permintaan pertolongan tersebut, sebab dia yakin bahwa memang orang Mesir itu yang berlaku sewenang-wenang. Maka ketika dia yakni Musa bersiap hendak memukul dengan keras orang yang menjadi musuh mereka berdua, yakni orang Mesir itu, dia yakni musuhnya yang orang Mesir berkata, \"Wahai Musa! Apakah engkau bermaksud membunuhku, sebagaimana kemarin engkau membunuh seseorang? Engkau hanya bermaksud menjadi orang yang berbuat sewenang-wenang yang memaksakan pendapatmu di negeri ini, dan engkau tidak bermaksud menjadi salah seorang dari kelompok orang-orang yang mengadakan perdamaian dan perbaikan untuk masyarakat'"
  }
]