[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka tatkala Musa hendak memukul orang Qibthi itu, ia berkata “Apakah kamu akan membunuhku sebagaimana kamu telah membunuh seseorang kemarin? Kamu itu tidak ingin kecuali menjadi seorang yang melampaui batas di muka bumi. Kamu tidak ingin menjadi bagian dari orang-orang yang mendamaikan di anatara manusia.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Tatkala Musa -'alaihissalām- hendak mencengkeram orang Qibṭi yang merupakan musuhnya dan musuhnya dan musuh orang Israil itu, orang Qibṭi tersebut mengira bahwa Musa akan memukulnya juga ketika dia mendengar Musa berkata, \"Sesungguhnya engkau benar-benar dalam penyimpangan yang nyata\", maka dia berkata kepada Musa, “Apakah engkau bermaksud membunuhku sebagaimana engkau telah membunuh orang kemarin, engkau tidaklah bermaksud melainkan menjadi seorang yang sewenang-wenang di bumi ini, membunuh dan menganiaya manusia, dan engkau tidak bermaksud untuk menjadi penengah di antara orang-orang yang sedang bertikai.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Musa hendak memukul orang Qibthi yang berbeda keyakinan dengan Musa dan orang dari Bani Israil itu. namun sepertinya orang dari Bani Israil itu lebih zalim daripada orang Qibthi, sehingga orang Qibthi itu berkata: “Hai Musa, apakah kamu hendak membunuhku sebagaimana kamu telah membunuh seseorang kemarin, sehingga membahayakan orang lain dan kembali melakukan kejahatan yang telah kamu lakukan, dan kamu tidak ingin mendamaikan dua pihak yang berselisih?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. فَلَمَّآ أَنْ أَرَادَ أَن يَبْطِشَ بِالَّذِى هُوَ عَدُوٌّ لَّهُمَا (Maka tatkala Musa hendak memegang dengan keras orang yang menjadi musuh keduanya) Yakni ketika ia hendak memukul orang Mesir yang merupakan musuh Musa dan Orang Israil itu karena telah menzalimi Bani Israil. قَالَ يٰمُوسَىٰٓ( musuhnya berkata: “Hai Musa) Yang berkata adalah orang dari Bani Israil tersebut. Ia menyangka Musa akan memukulnya. أَتُرِيدُ أَن تَقْتُلَنِى كَمَا قَتَلْتَ نَفْسًۢا بِالْأَمْسِ ۖ( apakah kamu bermaksud hendak membunuhku, sebagaimana kamu kemarin telah membunuh seorang manusia?) Ketika orang Mesir itu mendengar hal itu, ia langsung menyebarkannya, padahal sebelumnya tidak ada yang mengetahui. Pendapat lain mengatakan bahwa yang mengatakan ini adalah orang Mesir yang telah mengetahui kabar pembunuhan yang dilakukan Musa. إِن تُرِيدُ إِلَّآ أَن تَكُونَ جَبَّارًا فِى الْأَرْضِ(Kamu tidak bermaksud melainkan hendak menjadi orang yang berbuat sewenang-wenang di negeri (ini)) Makna (الجبار) adalah orang yang berbuat sesukanya dengan memukul dan membunuh tanpa melihat akibat dari perbuatannya dan tidak membalas perbuatan orang lain dengan hal yang baik. وَمَا تُرِيدُ أَن تَكُونَ مِنَ الْمُصْلِحِينَ(dan tiadalah kamu hendak menjadi salah seorang dari orang-orang yang mengadakan perdamaian”) Yakni perdamaian di antara manusia."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19. Maka tatkala Musa hendak memegang dengan keras orang yang menjadi musuh keduanya, musuhnya berkata: \"Hai Musa, apakah kamu bermaksud hendak membunuhku, sebagaimana kamu kemarin telah membunuh seorang manusia? Kamu hanya berniat menjadi orang yang berbuat sewenang-wenang di negeri (ini), dan kamu tidak hendak menjadi salah seorang dari orang-orang yang mengadakan perdamaian\". Sehingga kabar ini menyebar di semua kalangan hingga sampai pada Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika dia hendak memukul orang yang menjadi musuh mereka berdua, dia berkata} orang dari Bani Israil {“Wahai Musa, apakah kamu bermaksud membunuhku sebagaimana kemarin kamu membunuh seseorang. Kamu tidak lain kecuali hanya bermaksud menjadi orang yang sewenang-wenang di bumi dan tidak bermaksud menjadi salah satu dari orang-orang yang mengadakan perdamaian”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18-19. Setelah terjadi pembunuhan yang dilakukannya terhadap orang yang berasal dari musuhnya, maka dia menjadi “merasa takut menunggu-nunggu di kota itu,” apakah diketahui oleh keluarga Fira’un ataukah tidak? Sebenarnya dia merasa takut, karena dia tahu bahwa tidak akan seorang pun yang berani melakukan perbiatan seperti ini kecuali Musa dari Bani Israil. Ketika dia dalam keadaan seperti itu, “maka tiba-tiba orang yang meminta pertolongan kemarin,” untuk melawan musuhnya, “berteriak meminta pertolongan kepadanya,” untuk melawan seorang Qibthi lain. “Musa berkata kepadanya,” seraya mencela sikap orang itu, “Sesungguhnya kamu benar-benar orang sesat yang nyata,” maksudnya nyata kesesatannya dan menampakkan kelancangan. “Maka tatkala dia hendak memegang dengan keras,” maksudnya, Musa hendak mencengkeram dengan keras “orang yang menjadi musuh keduanya,” musuhnya dan musuh orang yang meminta pertolongan kepada Musa. Maksudnya, pada saat perkelahian sedang berlangsung antara orang dari bangsa Qibthi dan seorang berkebangsaan Israil, maka yang dari bangsa Israil ini meminta pertolongan kepada Musa, lalu jiwa kesukuan pun bangkit hingga membuat Musa bermaksud menampar orang Qibthi itu, maka “musuhnya berkata,” maksudnya orang yang dari bangsa Qibthi itu berkata kepada Musa untuk mencela tindakannya membunuh orang lain, “apakah kamu bermaksud hendak membunuhku, sebagaimana kamu kemarin telah membunuh seorang manusia? Kamu tidak bermaksud melainkan hendak menjadi orang yang berbuat sewenang-wenang di bumi ini,” karena diantara jejak terbesar dari tindakan orang yang semena-mena di bumi ini adalah membunuh jiwa manusia dengan alasan tidak benar, “dan tiadalah kamu hendak menjadi salah seorang dari orang-orang yang mengadakan perdamaian.” Kalau tidak, dan kalau seandainya kamu menghendaki perdamaian, niscaya kamu telah melerai antara aku dengannya tanpa harus membunuh salah satu (di antara kami). Maka Musa menahan diri dari membunuhnya dan sadar karena nasihat dan tegurannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 19: Maka ketika Musa mendekat ingin menolong laki-laki tersebut yang ia berasal dari kaumnya, laki-laki tersebut berkata : Apakah engkau ingin membunuhku juga wahai Musa, sebagaimana engkau membunuh laki-laki kemarin ?. Ia menyangka bahwa Musa juga akan membunuhnya, sebab Musa berkata kepadanya : Sungguh engkau dalam kesesatan yang nyata. Laki-laki tersebut kemudian berkata : (Apakah) engkau wahai Musa menjadi sombong di muka bumi, lakukanlah apa yang kamu inginkan, bunuhlah sebagaimana engkau inginkan, (atau) apakah yang kamu inginkan wahai Musa menjadi juru damai di antara manusia ?; Maka tersiarlah kabar Musa dan terkuak bahwasanya Musa membunuh dari kaum fir’aun. Maka mereka (dari kaum fir’aun) memerintahkan untuk membunuh Musa."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Selanjutnya, Nabi Musa ‘alaihis salam hendak memukul orang Qibthi itu, namun orang dari Bani Israil itu malah mengira, bahwa Musa bermaksud memukulnya ketika ia mendengar kata-kata Musa tersebut. Ia pun berkata untuk membela dirinya, “Wahai Musa! Apakah engkau bermaksud membunuhku, sebagaimana kemarin engkau membunuh seseorang?...dst.” Maka orang Qibthi yang berada di situ mendengarnya dan mengetahui bahwa orang yang melakukan pembunuhan kemarin adalah Musa, ia pun segera pergi memberitahukan Fir’aun sehingga Fir’aun marah besar dan hendak membunuh Musa."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 19",
    "description": "Kecaman itu tidak menghalangi Nabi Musa untuk menyambut permintaan pertolongan tersebut, sebab dia yakin bahwa memang orang Mesir itu yang berlaku sewenang-wenang. Maka ketika dia yakni Musa bersiap hendak memukul dengan keras orang yang menjadi musuh mereka berdua, yakni orang Mesir itu, dia yakni musuhnya yang orang Mesir berkata, \"Wahai Musa! Apakah engkau bermaksud membunuhku, sebagaimana kemarin engkau membunuh seseorang? Engkau hanya bermaksud menjadi orang yang berbuat sewenang-wenang yang memaksakan pendapatmu di negeri ini, dan engkau tidak bermaksud menjadi salah seorang dari kelompok orang-orang yang mengadakan perdamaian dan perbaikan untuk masyarakat'20. Peristiwa itu menyebar ke seluruh negeri Mesir, sampai ke telinga penguasa, sehingga mereka berencana mengambil tindakan terhadap Musa Dan yang terjadi setelah itu, seorang laki-laki yang bersimpati kepada Musa, konon ia adalah seorang keluarga Fir?aun yang beriman, datang bergegas bagaikan berlari dari ujung kota seraya berkata ketika bertemu Musa, \"Wahai Musa! Sesungguhnya para pembesar dan penguasa negeri ini sedang berunding dan mengatur rencana buruk tentang engkau untuk membunuhmu, maka oleh sebab itu keluarlah dari kota ini, sesungguhnya aku termasuk orang-orang yang tulus dalam memberi nasihat kepadamu?"
  }
]