[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ini adalah ayat-ayat al-Qur’an yang Aku turunkan kepadamu (wahai Rasul) untuk menjelaskan setiap yang dibutuhkan oleh hamba-hamba di dunia dan akhirat mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Ini adalah ayat-ayat Al-Qur`ān yang sangat jelas."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Hai Rasulullah, al-Qur’an yang Kami wahyukan kepadamu memiliki kedudukan yang tinggi, ia mengandung ayat-ayat yang jelas dan mengandung kebahagiaan manusia di dunia dan di akhirat bagi orang yang menghayati dan mengamalkannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2. Ini adalah ayat-ayat Al Quran yang nyata, jelas kebenarannya, bersih dari kesalahan, dan mengandung hukum-hukum dan syariat"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Itulah ayat-ayat kitab yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. “Ini,” ayat-ayat yang berhak dimuliakan dan diagungkan, “adalah ayat-ayat al-Kitab (al-Quran) yang menjelaskan,” bagi segala perkara yang dibutuhkan oleh manusia, seperti mengenal Rabb mereka, mengenal hak-hakNya, mengenal para WaliNya dan musuh-musuhNya, mengenal peristiwa-peristiwa dan hari-hariNya, mengenal pahala perbuatan dan balasan orang-orang yang beramal. Jadi, al-Quran ini telah menjelaskan semua itu dengan sejelas –jelasnya, menampakannya kepada manusia serta menerangkannya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 2: Surat ini dimulai dengan dengan firman-Nya تِلكَ isyarat kebesaran ayat Al Qur’an yang mulia ini di mana Allah menurunkannya kepada Nabi-Nya ﷺ, dan isyarat bahwa ayat ini menjelaskan secara gamblang hukum-hukum Allah, syariat-syariat-Nya, perintah-perintahnya, larangan-larangan-nya, urusan-urusan dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni menjelaskan mana yang hak dan mana yang batil, menjelaskan segala yang dibutuhkan hamba, seperti kebutuhan mengenal Tuhannya, mengenal hak-hak-Nya, mengenal siapa wali-Nya dan siapa musuh-Nya, mengenal peristiwa-peristiwa besar dan mengenal pembalasan terhadap amal. Termasuk di antara sekian yang dijelaskan Al Qur’an adalah kisah Musa bersama Fir’aun, di mana Al Qur’an menampilkan kisahnya dan mengulanginya di beberapa tempat, dan pada surah ini diterangkan secara lebih luasnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 2",
    "description": "Ini ayat-ayat kitab Al-Qur'an yang amat mulia dan sangat tinggi kedudukannya, yang sangat jelas kebenarannya dari Allah, dan yang fungsinya menjelaskan segala macam persoalan manusia untuk mencapai kebahagiaannya. 3. Salah satu aspek penjelasannya adalah kami melalui malaikat jibril membacakan yakni menyampaikan kepadamu sebagian yakni beberapa episode dari kisah penting nabi musa dan fir'aun, penguasa mesir pada masanya. Pembacaan dan penyampaian itu dilakukan dengan sebenar-Nya dan sesuai dengan kenyataan untuk dimanfaatkan oleh orang-orang yang beriman dengan cara menarik pelajaran dari kisah tersebut."
  }
]