[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan datanglah seorang lelaki dari ujung kota dengan berjalan cepat tergopoh-gopoh. Ia berkata kepada Musa, “Sesungguhnya para pembesar kaum Fir’aun telah berkonspirasi untuk membunuh dirimu dan mereka tengah bermusyawarah. Maka keluarlah kamu dari kota ini. Sesungguhnya aku adalah orang yang tulus menasehatimu dan mengkhawatirkan dirimu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "20. Ketika berita tersebut tersebat, maka datanglah seseorang dari ujung kota dengan tergesa-gesa karena khawatir terhadap apa yang akan terjadi terhadap Musa, dia berkata, “Wahai Musa, sesungguhnya para pembesar dari kaum Fir'aun sedang bermusyawarah untuk membunuhmu, maka keluarlah dari negeri ini, sesungguhnya aku termasuk golongan orang-orang yang memberimu nasihat karena kasihan kepadamu apabila mereka menangkap dan membunuhmu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "20. Pada saat itu, datanglah orang lain dari Bani Israil yang mengenal Musa ke tempat terjadinya perselisihan itu dari tepi kota; dia menyampaikan kepada Musa bahwa perkaranya telah diketahui kerajaan Fir’aun, dan kaumnya sedang bermusyawarah untuk membunuhnya. Kemudian dia menganjurkan agar Musa keluar dari kota itu segera; dia merasa iba terhadap Musa dan hendak menasehatinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "20. وَجَآءَ رَجُلٌ مِّنْ أَقْصَا الْمَدِينَةِ يَسْعَىٰ (Dan datanglah seorang laki-laki dari ujung kota bergegas-gegas) Makna (أقصى المدينة) adalah tempat yang paling ujung dari sebuah kota. قَالَ يٰمُوسَىٰٓ إِنَّ الْمَلَأَ يَأْتَمِرُونَ بِكَ لِيَقْتُلُوكَ(seraya berkata: “Hai Musa, sesungguhnya pembesar negeri sedang berunding tentang kamu untuk membunuhmu) Yakni mereka berunding untuk membunuhmu dan membuat tipu daya terhadapmu; sebab itu keluarlah (dari kota ini) sesungguhnya aku termasuk orang-orang yang memberi nasehat kepadamu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "20. Datanglah seorang laki-laki beriman dari ujung kota bergegas-gegas seraya berkata: \"Hai Musa, sesungguhnya pembesar negeri sedang berunding tentang kamu untuk membunuhmu, sebab itu keluarlah dari kota ini. Sesungguhnya aku termasuk orang-orang yang memberi nasehat kepadamu untuk keluar dari kota ini\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu datanglah seorang laki-laki dari ujung} dari lain {kota dengan bergegas} bergegas berjalan {dan berkata,“Wahai Musa, sesungguhnya para pembesar sedang berunding tentang dirimu} bermusyawarah tentang perkaramu {untuk membunuhmu. Maka keluarlah. Sesungguhnya aku termasuk orang-orang yang memberi nasihat kepadamu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "20. Berita tentang tindakan Musa dalam dua kasus tersebut menyebar luas hingga para pembesar Fir’aun dan Fir’aun sendiri merencanakan untuk menghabisi Musa, dan mereka mengadakan musyawarah dalam hal ini. Namun Allah telah menggerakkan hati lelaki yang tulus menasehati itu lalu dia pun segera menginformasikan kepada Musa tentang apa yang diperbincangkan oleh para pembesar mereka mengenai Musa. Allah berfirman, “Dan datanglah seorang laki-laki dari ujung kota bergegas-gegas,” maksudnya, dia berlari cepat dengan kedua kakinya karena ketulusannya kepada Musa dan khawatir kalau mereka berhasil membunuhnya sebelum Musa mengetahui “seraya berkata, ‘Hai Musa, sesungguhnya pembesar negeri sedang berunding’,” maksudnya, bermusyawarah membicarakanmu, “untuk membunuhmu, sebab itu keluarlah” dari kota ini, “sesungguhnya aku termasuk orang-orang yang memberi nasihat kepadamu,” maka patuhilah nasihatku."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 20: Maka datanglah seorang penasihat yang memiliki simpati yang datang dari dekat kota yang bergegas terburu-buru hingga bertemu dengan Musa dan ia berkata (kepada Musa) : Sungguh pembesar dari kaum sedang berunding untuk melakukan pembunuhan kepadamu, mereka membicarakan atas keadaanmu, keluarlah engkau dari kota ini, sungguh aku hanyalah penasihat yang menasihati dan merasa kasihan kepadamu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ada yang mengatakan, bahwa dia adalah orang mukmin dari keluarga Fir’aun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 20",
    "description": "Peristiwa itu menyebar ke seluruh negeri mesir, sampai ke telinga penguasa, sehingga mereka berencana mengambil tindakan terhadap musa dan yang terjadi setelah itu, seorang laki-laki yang bersimpati kepada musa, konon ia adalah seorang keluarga fir'aun yang beriman, datang bergegas bagaikan berlari dari ujung kota seraya berkata ketika bertemu musa, \"wahai musa! sesungguhnya para pembesar dan penguasa negeri ini sedang berunding dan mengatur rencana buruk tentang engkau untuk membunuhmu, maka oleh sebab itu keluarlah dari kota ini, sesungguhnya aku termasuk orang-orang yang tulus dalam memberi nasihat kepadamu'21, nasihat itu didengar oleh musa, maka menuruti nasihat itu keluarlah dia dari kota itu dengan rasa takut, waspada sambil menoleh ke kanan dan ke kiri kalau-kalau ada yang menyusul atau menangkapnya. Pada saat yang sama dia berdoa 'yatuhanku yang selama ini membimbing dan memeliharaku, selamatkanlah aku dari orang-orang yang zalim semacam fir'aun dan rezimnya itu. \"."
  }
]