[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa keluar dari kota Fir’aun dengan diliputi rasa takut, menunggu-nunggu adanya pengejaran yang dapat menyusulnya sehingga akan dapat menangkapnya. Maka Musa berdoa kepada Allah supaya berkenan menyelamatkannya dari orang-orang yang zhalim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Maka Musa mengikuti ucapan pemberi nasihat tersebut. Lalu dia keluar dari negeri itu dalam keadaan takut dan menunggu dengan cemas apa yang akan terjadi kepadanya. Lalu ia berdoa kepada Rabbnya, “Wahai Rabbku, selamatkanlah aku dari kaum yang zalim, sehingga mereka tidak mencelakakanku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Musa menerima nasehat itu dan pergi meninggalkan negeri Fir’aun untuk menyelamatkan diri dalam keadaan takut, agar dia tidak tertangkap oleh kaum Fir’aun. Musa tidak menentukan kemana dia akan pergi, dan dia berdoa kepada Allah agar Dia membenarkan langkahnya dan menyelamatkannya dari Fir’aun dan kaumnya yang zalim dan hendak membunuhnya sebagai balasan pembunuhan yang telah dia lakukan secara tidak sengaja."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. فَخَرَجَ مِنْهَا خَآئِفًا يَتَرَقَّبُ ۖ (Maka keluarlah Musa dari kota itu dengan rasa takut menunggu-nunggu dengan khawatir) Maka Musa keluar dari kota itu dengan rasa takut dari orang-orang zalim dan selalu mengawasi dari kejaran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21. Maka keluarlah Musa dari kota itu dengan rasa takut menunggu-nunggu dengan khawatir, dia berdoa: \"Ya Tuhanku, selamatkanlah aku dari orang-orang yang zalim itu\". Yaitu kaum Fir’aun"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu dia keluar dari sana} dari kota itu {dengan ketakutan dan waspada. Dia berdoa,“Ya Tuhanku, selamatkanlah aku dari kaum yang zalim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. “Maka keluarlah Musa dari kota itu dengan rasa takut menunggu-nunggu dengan khawatir” jangan-jangan dirinya dibunuh, dan dia berdoa kepada Allah seraya “mengucapkan, ‘Ya Rabbku, selamatkanlah aku dari orang-orang yang zhalim itu’,” karena sesungguhnya Musa telah bertaubat dari dosanya, dan dia melakukan perbuatan tersebut karena emosi dan tidak bermaksud membunuh, maka ancaman mereka terhadap Musa adalah kezhaliman dan kelancangan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 21: Maka Musa bergegas setelah dinasihati oleh lelaki tersebut, ia keluar dari kota ketakutan ketahuan kemudian dibunuh ketika berjumpa dengan mereka (yang merencanakan pembunuhan). Musa kemudian berdoa kepada Allah dengan keadaan ketakutan : Wahai Tuhanku selamatkan aku dan tolonglah aku dari orang-orang yang berbuat dzalim yang melanggar syariatmu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Beliau telah bertobat dari dosa itu dan melakukannya karena marah dan tanpa maksud membunuhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 21",
    "description": "21, nasihat itu didengar oleh musa, maka menuruti nasihat itu keluarlah dia dari kota itu dengan rasa takut, waspada sambil menoleh ke kanan dan ke kiri kalau-kalau ada yang menyusul atau menangkapnya. Pada saat yang sama dia berdoa 'yatuhanku yang selama ini membimbing dan memeliharaku, selamatkanlah aku dari orang-orang yang zalim semacam fir'aun dan rezimnya itu. \"22. Allah menerima doanya, dan mengarahkannya pergi ke tempat yang aman dari kejaran fir'aun dan tentaranya. Maka pergilah dia, dan ketika dia menuju ke arah negeri madyan dia berdoa lagi, \"mudah-Mudahan tuhanku memimpin aku ke jalan yang benar agar aku segera sampai di tempat yang aman dengan baik dan selamat. \"."
  }
]