[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika Musa berjalan menuju negeri Madyan dan keluar dari daerah kekuasaan Fir’aun, ia berkata, “Mudah-mudahan Tuhanku memanduku dengan sebaik-baik petunjuk menuju negeri Madyan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Dan ketika ia mulai berjalan menuju negeri Madyan, dia berkata,”Semoga Rabbku menunjukkan kepadaku jalan yang terbaik, sehingga aku tidak tersesat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Allah mengilhamkan kepada Musa agar menuju negeri Madyan, negeri itu tidak berada dalam kekuasaan Fir’aun. Dan Musa senantiasa menjaga hubungannya dengan Allah, dan dia berharap Allah menunjukkan kepadanya jalan yang aman."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. وَلَمَّا تَوَجَّهَ تِلْقَآءَ مَدْيَنَ (Dan tatkala ia menghadap kejurusan negeri Mad-yan) Yakni ke arah pemukiman kabilah Madyan untuk memasuki negeri itu. Yakni ia menempuh jalan yang mengantarkannya ke negeri Madyan. قَالَ عَسَىٰ رَبِّىٓ أَن يَهْدِيَنِى سَوَآءَ السَّبِيلِ(ia berdoa (lagi): “Mudah-mudahan Tuhanku memimpinku ke jalan yang benar”) Yakni jalan menuju Madyan agar aku tidak tersesat dari jalan yang benar."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22. Tatkala Musa menghadap ke arah negeri Madyan ia berdoa (lagi): \"Mudah-mudahan Tuhanku membimbingku ke jalan yang benar. Sehingga aku tidak salah jalan, dan mendapat jalan yang paling dekat untuk sampai kota Madyan. Maksud dadri jalan yang buruk adalah jalan yang pertengahan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika menuju ke arah negeri Madyan} ke arah Madyan {dia berdoa,“Semoga Tuhanku membimbingku ke jalan yang benar”} jalan lurus yang tidak ada bengkokan di dalamnya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. “Dan tatkala dia menghadap ke jurusan negeri Madyan.” Maksudnya, pergi menuju negeri Madyan, yaitu yang terletak di selatan Palestina, di mana di sana Fir’aun tidak mempunyai kekuasaan, “ia berdoa (lagi), ‘Mudah-mudahan Rabbku memimpinku ke jalan yang benar’,” maksudnya, ke tengah jalan yang singkat yang dapat mengantarku kepadanya dengan mudah dan nyaman. Maka Allah pun membimbingnya kepada jalan yang lurus hingga akhirnya dia sampai di Madyan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 22: Ketika Musa menuju ke negeri Madyan (negeri yang terletak di samping Palestina), ia berkata sembari berdoa kepada Tuhan-Nya : Wahai Tuhanku, tunjukilah aku kepada sebaik-baik jalan menuju Madyan dan yang termudah untuk sampai padanya. Maka Allah kabulkan permohonannya, maka sampailah Musa di negeri Madyan dengan selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Madyan adalah negeri Nabi Syu’aib, perjalanan ke sana dari Mesir membutuhkan waktu kurang lebih 8 hari. Madyan tidak berada di bawah kekuasaan Fir’aun."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 22",
    "description": "Allah menerima doanya, dan mengarahkannya pergi ke tempat yang aman dari kejaran fir'aun dan tentaranya. Maka pergilah dia, dan ketika dia menuju ke arah negeri madyan dia berdoa lagi, \"mudah-Mudahan tuhanku memimpin aku ke jalan yang benar agar aku segera sampai di tempat yang aman dengan baik dan selamat. \"23. Setelah berjalan cukup lama dan jauh, dan ketika dia sampai di sumber air negeri madyan, dia menjumpai di sana sekumpulan orang ba-Nyak yang sedang memberi minum ternak mereka, dan dia menjumpai di belakang orang banyak itu yakni di tempat yang agak jauh dari sekumpulan orang itu, dua orang perempuan sedang menghambat ternaknya, menggiring kambing gembalaannya bergerak menjauhi sumber air, sehingga tidak ikut minum bersama dengan ternak-ternak lain. Melihat keadaan kedua perempuan itu dia yakni musa dengan rasa iba dan heran berkata, \"apakah maksudmu dengan berbuat begitu menghambat ternakmu minum '\" kedua perempuan itu menjawab pertanyaan musa sekaligus mengisyaratkan kebutuhan mereka akan pertolongan, kami tidak dapat memberi minum ternak kami, sebelum penggembala-penggembala itu memulangkan ternak mereka. Kami perempuan yang lemah, tidak bisa berdesak-desakan dengan laki-laki dan tidak memiliki saudara pria, sedang ayah kami adalah orang tua yang telah lanjut usianya, tidak mampu melakukan pekerjaan ini. \"."
  }
]