[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika ia sampai di sumber air negeri Madyan, ia menyaksikan sekumpulan orang di sana memberi minuman untuk ternak-ternak mereka. Dan ia menjumpai di belakang kumpulan orang-orang itu dua orang wanita yang memisahkan diri dari manusia menahan kambing mereka dari air, karena ketidakkuatan dan kelemahan fisik mereka untuk menerobos kumpulan orang-orang lelaki, dan mereka menunggu hingga binatang-binatang ternak orang-orang pulang darinya, kemudian mereka berdua baru memberikan minum bagi ternak mereka berdua. Ketika Musa melihat mereka berdua, hati Musa merasa iba kepada mereka, kemudian bertanya kepada mereka, “apa yang kalian inginkan?” mereka menjawab, “Kami tidak mampu menerobos kumpulan orang-orang lelaki,dan kami tidak bisa memberi minum ternak-ternak kami sampa orang-orang selesai memberi minum ternak-ternak mereka, sedang ayah kami adalah orang yang sudah lanjut usia, tidak mampu memberi minum ternaknya karena kelemahan fisik dan usianya yang sudah tua.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Tatkala dia sampai di mata air negeri Madyan, tempat penduduknya mengambil air minum, ia bertemu dengan sekelompok orang yang sedang memberi minum hewan ternak mereka. Dan dia mendapati di antara mereka dua wanita yang menahan kambing-kambingnya dari air sampai semua orang selesai mengambil air. Musa -'alaihissalām- berkata kepada keduanya, “Kenapa kalian tidak mengambil air bersama orang lain?” Kedua wanita itu berkata, “Kami sudah biasa menunggu agak jauh dan tidak mengambil air hingga semua pengembala pergi, karena khawatir bercampur dengan mereka, sementara ayah kami sudah tua renta, tidak mampu mengambilkan air, maka terpaksa kami lah yang mengambil air untuk kambing-kambing kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Dan sampailah Musa di negeri Madyan, dan orang asing biasanya akan menuju sumber air karena itu menjadi tempat orang-orang berkumpul. Musa mengamati sekumpulan orang yang berdesakan untuk mengambil air; kemudian dia memusatkan pandangannya ke tepi tempat itu, dia melihat dua wanita yang menghalangi hewan-hewan ternaknya agar tidak menuju sumber air. Jiwa Musa terpanggil dan mendekati dua wanita itu untuk menanyakan keadaan mereka. Dua wanita itu menjawab bahwa mereka berdua tidak ingin memberi minum hewan ternak mereka pada saat para penggembala sedang berkumpul di sumber air, dan mereka berdua tidak akan menuju sumber air hingga orang-orang tersebut selesai memberi minum hewan ternak mereka. Dan mereka berdua mengatakan bahwa ayah mereka berdua telah tua, sehingga tidak mampu pergi ke sumber air."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. وَلَمَّا وَرَدَ مَآءَ مَدْيَنَ (Dan tatkala ia sampai di sumber air negeri Mad-yan) Yakni setelah ia sampai di sumber air penduduk Madyan. وَجَدَ عَلَيْهِ أُمَّةً مِّنَ النَّاسِ يَسْقُونَ(ia menjumpai di sana sekumpulan orang yang sedang meminumkan (ternaknya)) Ia mendapati banyak orang di sumber air itu untuk memberi minum hewan ternak mereka. وَوَجَدَ مِن دُونِهِمُ امْرَأَتَيْنِ تَذُودَانِ ۖ( dan ia menjumpai di belakang orang banyak itu, dua orang wanita yang sedang menghambat (ternaknya)) Yakni menghalangi kambing-kambing mereka berdua dari sumber air sampai orang-orang selesai memberi minum hewan ternaknya dan sampai membiarkan mereka berdua untuk mendatangi sumber air. قَالَ مَا خَطْبُكُمَا ۖ( Musa berkata: “Apakah maksudmu (dengan berbuat at begitu)?”) Yakni Musa bertanya kepada kedua wanita itu: “mengapa kalian tidak memberi minum kambing-kambing kalian bersamaan dengan orang-orang lainnya? قَالَتَا لَا نَسْقِى حَتَّىٰ يُصْدِرَ الرِّعَآءُ ۖ( Kedua wanita itu menjawab: “Kami tidak dapat meminumkan (ternak kami), sebelum pengembala-pengembala itu memulangkan (ternaknya)) Sudah menjadi kebiasaan kami menunggu sampai mereka pergi dari sumber air itu agar kami tidak bercampur baur dengan mereka atau kerena kami tidak bisa memberi minum ternak kami bersamaan dengan mereka. وَأَبُونَا شَيْخٌ كَبِيرٌ(sedang bapak kami adalah orang tua yang telah lanjut umurnya”) Yakni tidak mampu lagi memberi minum hewan ternak kami karena telah lanjut usia, oleh sebab itu kami berdua terpaksa harus memberi minum hewan ternak ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23. Tatkala Musa sampai di sumber air negeri Madyan ia menjumpai sekumpulan orang yang sedang memberi minum ternaknya. Ia menjumpai di belakang orang banyak itu, dua orang wanita yang sedang kesulitan memberi minum ternaknya karena berdesak-desakan.. Musa berkata: \"Apakah maksudmu dengan berbuat begitu?\" Kedua wanita itu menjawab: \"Kami tidak dapat memberi minum ternak kami, sebelum pengembala-pengembala itu memulangkan ternaknya, sedang bapak kami adalah orang tua yang telah lanjut usia\" Beliau tidak dapat memberi makan ternaknya sendiri. Ra’a’ adalah jamak dari ra’in."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Ketika sampai} sampai {di sumber air negeri Madyan, dia menjumpai di sana satu kelompok} kelompok {orang yang sedang memberi minum dan dia menjumpai di belakang mereka dua perempuan yang sedang menghalau} yang menahan kambing-kambingnya dari sumber air itu sampai orang-orang sepi {Dia berkata,“Apa maksud kalian”} Apa masalah kalian sehingga tidak memberi minum ternak kalian dengan orang-orang {Keduanya menjawab,“Kami tidak dapat memberi minum sehingga para penggembala itu pulang} para penggembala itu pergi dengan kambing-kambing mereka dari sumber air itu, untuk menghindari bercampur dengan laaki-laki {sedangkan ayah kami adalah orang tua yang lanjut usia”} laki-laki berumur, yang tidak mampu memberi minum ternaknya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “Dan tatkala ia sampai di sumber air negeri Madyan, dia menjumpai di sana sekumpulan orang yang sedang meminumkan” ternaknya. Penduduk Madyan ini adalah masyarakat peternak hewan yang sangat banyak, “dan dia menjumpai di belakang orang banyak itu,” di belakang sekumpulan orang itu, “dua orang wanita yang sedang menghambat,” domba-dombanya agar tidak mendekat kepada kerumunan orang banyak itu, karena keduanya merasa tidak mampu untuk berdesakan dengan kaum lelaki, dan karena kaum lelaki itu bakhil dan tidak mempunyai kepribadian baik (jiwa sosialnya) untuk membiarkan keduanya memberi minum hewan ternaknya. “Musa berkata” kepada kedua gadis itu, “Apakah maksudmu berdua?” maksudnya, bagaimana kalian dengan kondisi seperti ini? “kedua wanita menjawab, ‘Kami tidak meminumkan (ternak kami), sehingga penggembala-penggembala itu memulangkan (ternaknya)’.” Maksudnya, sudah menjadi kebiasaan bahwa kami tidak mungkin dapat meminumkan ternak sehingga para penggembala memulangkan ternak-ternaknya, lalu apabila keadaan sudah lengang, barulah kami meminumkan, “sedang bapak kami adalah orang tua yang telah lanjut umurnya,” maksudnya, sudah tidak mempunyai kekuatan untuk meminumkan ternaknya, dan kami pun tidak mempunyai daya untuk melakukannya dan kami juga tidak mempunyai orang laki-laki yang bisa berdesakan dengan para penggembala."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 23: Ketika sampai Musa di negeri Madyan, ia mendapati air yang di sekitarnya berkumpul banyak manusia memberi minum ternak-ternk mereka, dan Musa juga mendapati di belakangnya dua orang perempuan yang mengembalakan kambing dan menghalangi-halangi gembalaannya dari manusia, karena sebab pemilik kambing itu (yaitu bapak dari kedua wanita tersebut) dalam keadaan lemah, tua untuk dapat/mampu berdesak-desakan dengan banyak manusia; dan menerobos kerumunan manusia tersebut. Kemudian Musa bertanya kepada kedua wanita tersebut : Apa yang kalian berdua inginkan ?! Maka berkata keduanya : Kami tidak berharap untuk berdesak-desakan dengan para lelaki (yang berkerumun mengambil air) dan kami juga tidak mampu untuk memberi minum (ternak kami) sampai manusia selesai memberi minum ternaknya serta meninggalkan (sumber air). Bapak kami adalah laki-laki tua, tidak memiliki kekuatan baginya untuk memberi minum (ternak kami)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena mereka tidak mungkin bercampur baur dengan laki-laki yang sedang mengambilkan air minum untuk ternaknya dan karena bakhilnya mereka, sehingga setelah mereka selesai memberi minum hewan ternak mereka, maka mereka tutup kembali mulut sumur dengan batu yang besar. Yakni mengapa kamu tidak memberi minum ternakmu? Tidak kuat untuk memberi minum hewan ternaknya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 23",
    "description": "Setelah berjalan cukup lama dan jauh, dan ketika dia sampai di sumber air negeri madyan, dia menjumpai di sana sekumpulan orang ba-Nyak yang sedang memberi minum ternak mereka, dan dia menjumpai di belakang orang banyak itu yakni di tempat yang agak jauh dari sekumpulan orang itu, dua orang perempuan sedang menghambat ternaknya, menggiring kambing gembalaannya bergerak menjauhi sumber air, sehingga tidak ikut minum bersama dengan ternak-ternak lain. Melihat keadaan kedua perempuan itu dia yakni musa dengan rasa iba dan heran berkata, \"apakah maksudmu dengan berbuat begitu menghambat ternakmu minum '\" kedua perempuan itu menjawab pertanyaan musa sekaligus mengisyaratkan kebutuhan mereka akan pertolongan, kami tidak dapat memberi minum ternak kami, sebelum penggembala-penggembala itu memulangkan ternak mereka. Kami perempuan yang lemah, tidak bisa berdesak-desakan dengan laki-laki dan tidak memiliki saudara pria, sedang ayah kami adalah orang tua yang telah lanjut usianya, tidak mampu melakukan pekerjaan ini. \"24. Mendengar jawaban kedua perempuan itu, maka dia yakni musa bergegas menolong keduanya dengan memberi minum ternak kedua perempuan itu, walaupun saat itu dia sangat lapar sekali. Kedua perempuan itu meninggalkan tempat sambil mengucapkan terima kasih, kemudian dia yakni musa kembali ke tempat yang teduh untuk menghindari sengatan matahari dan beristirahat. Di tempat itu musa mencoba mengingat kembali aneka nikmat yang telah dianugerahkan kepada-Nya, lalu berdoa, 'ya tuhanku, sesungguhnya aku sangat memerlukan se-suatu kebaikan berupa makanan atau rezeki lainnya, walau sedikit, yang engkau turunkan kepadaku, dan kini aku masih membutuhkan anugerah kebaikan darimu. \"."
  }
]