[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Musa menggatikan mereka berdua memberikan minum hewan ternak mereka dan lalu berjalan menuju arah bayangan pohon dan ia berteduh dengannya, dan dia berkata, “Wahai Tuhanku, sesungguhnya aku membutuhkan kebaikan jenis apa pun yang Engkau giring kepadaku, seperti makanan.” Dan waktu itu, rasa lapar telah melilitnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Maka Musa -'alaihissalām- merasa kasihan kepada keduanya dan mengambilkan air untuk kambing mereka, kemudian dia menuju tempat teduh untuk beristirahat dan berdoa kepada Rabbnya dengan mengeluhkan kebutuhannya, “Wahai Rabbku! Sesungguhnya aku membutuhkan kebaikan yang Engkau turunkan kepadaku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Musa kemudian menuju sumber air meskipun dia merasa lelah setelah perjalanan jauh, lalu dia memberi minum hewan ternak dua wanita itu. Setelah dia selesai melakukannya, dia hendak beristirahat di bawah naungan pohon di tempat itu; lalu dia bermunajat kepada Tuhannya dan mengingat kenikmatan-kenikmatan yang telah Allah berikan kepadanya, kemudian dia menyampaikan kebutuhannya terhadap berbagai bentuk pertolongan, dan terlebih lagi pertolongan akibat keasingan dan rasa laparnya berupa tempat tinggal baginya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. فَسَقَىٰ لَهُمَا (Maka Musa memberi minum ternak itu untuk (menolong) keduanya) Setelah Musa mendengar perkataan mereka berdua, Musa kemudian membantu mereka berdua memberi minum kambing-kambing itu. ثُمَّ تَوَلَّىٰٓ إِلَى الظِّلِّ(kemudian dia kembali ke tempat yang teduh) Setelah ia selesai memberi minum kambing-kambing tersebut ia kemudian menuju tempat yang teduh dan duduk di sana. فَقَالَ رَبِّ إِنِّى لِمَآ أَنزَلْتَ إِلَىَّ مِنْ خَيْرٍ(lalu berdoa: “Ya Tuhanku sesungguhnya aku kepada suatu kebaikan yang Engkau turunkan kepadaku”) Kebaikan apapun itu. فَقِيرٌ(sangatlah memerlukan) Yakni membutuhkan hal itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24. Kemudian nabi Musa menolong keduanya untuk memberi minum ternak itu, kemudian dia kembali ke tempat yang teduh lalu berdoa: \"Ya Tuhanku sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku. Yaitu berupa makanan apapun itu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu dia memberi minum (ternak) untuk kedua perempuan itu. Kemudian dia pergi} pergi {ke tempat yang teduh, lalu berdoa,“Ya Tuhanku, sesungguhnya aku sangat memerlukan suatu kebaikan yang Engkau turunkan kepadaku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Maka Musa merasa iba dan kasihan kepada mereka berdua, “maka Musa memberi minum ternak itu untuk (menolong) keduanya,” tanpa minta imbalan upah kepada keduanya dan tidak juga mempunyai niat lain selain keridhaan Allah. Setelah dia berhasil meminumkan ternak milik kedua gadis itu, yang mana pada saat itu cuaca sangat panas sekali di tengah siang hari, hal ini terbukti dengan FirmanNya, “Kemudian dia kembali ke tempat yang teduh,” untuk beristirahat di tempat teduh itu setelah kelelahan, “lalu berkata” pada kondisi seperti itu seraya memohon karunia kepada Rabbnya, “Ya Rabbku, sesungguhnya aku sangat memerlukan sesuatu kebaikan yang Engkau turunkan kepadaku,” maksudnya, sesungguhnya aku sangat membutuhkan kebaikan yang Engkau bawakan kepadaku dan Engkau memudahkannya untukku. Ini adalah permohonan Musa melalui ungkapan kondisinya. Dia memohon kepada Allah dengan (bertawasul) dengan kondisi itu lebih mantap daripada memohon dengan ungkapan lisan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 24: Maka Musa memberikan minum ternak kedua perempuan tersebut, kemudian ia (Musa) berteduh di bawah pohon, kemudian ia berdoa, bermunajat kepada Tuhannya, dan meminta rezeki kepada-Nya : Wahai Tuhanku, sungguh aku adalah hamba yang membutuhkan kebaikan yang Engkau turunkan kepadaku, wahai Rabbku itulah kebaikan yang aku inginkan, aku juga menginginkan balasan dan ganjaran dari-Mu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Tanpa meminta upah, dan tidak ada niatnya selain mengharap keridhaan Allah. Para ahli tafsir menjelaskan bahwa para pengembala ketika selesai mendatangi sumber air, meletakkan di mulut sumur batu yang besar, lalu dua wanita itu datang memberi minum kambingnya dari sisa kambing yang lain. ‘Amr bin Maimun meriwayatkan dari Umar bin Khaththab radhiyallahu 'anhu, bahwa Musa ‘alaihis salam ketika sampai di sumber air Madyan mendapatkan sekumpulan orang yang sedang memberi minum ternaknya. Umar melanjutkan ceritanya, “Setelah mereka selesai (memberi minum), maka mereka bersama-sama mengembalikan batu ke sumur (untuk menutupinya), dan tidak ada yang mampu mengangkatnya kecuali dengan jumlah sepuluh orang. Tiba-tiba Beliau melihat ada dua orang perempuan yang sedang menghambat ternaknya, maka Musa berkata, “Ada apa dengan kamu berdua?\" Maka Keduanya menceritakan keadaannya, lalu Musa ‘alaihis salam mendatangi batu itu dan mengangkatnya (sendiri), dan tidak mengambil air kecuali satu ember sehingga kambing-kambing (mereka berdua) puas (meminumnya).” (Diriwayatkan oleh Ibnu Abi Syaibah, dan isnadnya shahih). Permintaan Beliau ini adalah dengan ucapan dan keadaannya; lisan Beliau berdoa, dan keadaan Beliau menunjukkan rasa butuh. Ayat ini sekaligus mengisyaratkan kepada kita agar senantiasa meminta kepada Allah dalam semua kebutuhan kita, baik yang terkait dengan agama (seperti meminta hidayah dan ampunan), maupun yang terkait dengan dunia (seperti meminta makan, minum dan pakaian). Demikian pula menunjukkan bahwa Allah Subhaanahu wa Ta'aala senang diminta oleh hamba-hamba-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 24",
    "description": "Mendengar jawaban kedua perempuan itu, maka dia yakni musa bergegas menolong keduanya dengan memberi minum ternak kedua perempuan itu, walaupun saat itu dia sangat lapar sekali. Kedua perempuan itu meninggalkan tempat sambil mengucapkan terima kasih, kemudian dia yakni musa kembali ke tempat yang teduh untuk menghindari sengatan matahari dan beristirahat. Di tempat itu musa mencoba mengingat kembali aneka nikmat yang telah dianugerahkan kepada-Nya, lalu berdoa, 'ya tuhanku, sesungguhnya aku sangat memerlukan se-suatu kebaikan berupa makanan atau rezeki lainnya, walau sedikit, yang engkau turunkan kepadaku, dan kini aku masih membutuhkan anugerah kebaikan darimu. \"25. Kedua perempuan yang dibantu oleh musa menceritakan kebaikan musa kepada ayah mereka. Sang ayah memerintahkan salah seorang dari putrinya untuk mengundang musa ke rumah. Kemudian datanglah kepada musa salah seorang dari kedua perempuan yang baru saja ia bantu itu. Ia datang dalam keadan berjalan dengan malu-malu karena ditugaskan bertemu muka seorang diri dengan pemuda tampan dan berwibawa yang telah membantunya untuk mengundangnya ke rumah. Menyampaikan pesan sang ayah, dia berkata, \"sesungguhnya ayahku mengundangmu untuk memberi balasan sebagai imbalan atas kebaikanmu memberi minum ternak kami. Dengan segera musa yang sedang memerlukan bantuan menceritakan kepadanya kisah mengenai dirinya dan fir'aun serta masyarakat mesir, dia yakni bapak perempuan itu berkata, \"janganlah engkau takut kekuasaan fir'aun tidak sampai ke wilayah ini, dan tuhan tidak akan mencelakakan orang-orang yang selalu berbuat baik dan dekat dengan-Nya. Tenanglah, engkau telah selamat dari orang-orang yang zalim itu. \"."
  }
]