[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian salah seorang wanita yang telah ia gantikan untuk meminumkan air bagi ternaknya berjalan ke arahnya dengan malu-malu. Wanita itu berkata, “Sesungguhnya ayahku memanggil kamu untuk memberimu imbalan atas bantuanmu memberi minum bagi (ternak) kami.” Lalu Musa berjalan bersamanya menuju ayahnya. Ketika Musa sampai pada ayah wanita itu dan menceritakan kepadanya kisah dirinya bersama Fir’aun dan kaumnya, ayah wanita itu berkata, “Janganlah takut. Kamu telah selamat dari kaum yang zhalim. Yaitu, Fir’aun dan kaumnya. Sebab, ia tidak memiliki kekuasaan atas negeri kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Ketika kedua wanita itu pulang dan mengabarkan tentang Musa kepada ayah mereka. Lalu ayah mereka mengutus salah seorang dari putrinya kepada Musa dan mengundangnya. Maka wanita itu berjalan mendatanginya dengan tersipu malu dan berkata, “Sesungguhnya ayahku mengundangmu untuk menemuinya guna membalas kebaikanmu karena telah memberi minum (ternak) kami.” Ketika Musa mendatangi ayah kedua wanita itu dan menceritakan kepadanya tentang dirinya, maka ayah kedua wanita itu berkata kepada Musa untuk menenangkannya, “Jangan takut! Engkau telah selamat dari kaum yang zalim, yaitu Fir'aun dan bala tentaranya. Sesungguhnya mereka tidak mempunyai kekuasaan atas negeri Madyan, maka mereka tidak akan mencelakaimu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Dua wanita itu kembali kepada ayah mereka, Syuaib, dan menceritakan bantuan Musa bagi mereka. Maka Syuaib memerintahkan salah satu putrinya untuk mengundangnya ke rumah. Pergilah wanita itu datang kepada Musa di sumber air dengan penuh rasa malu dan segan, ia berkata: “Ayahku memintamu untuk mendatanginya, dia ingin membalas kebaikan yang telah kamu lakukan.” Musa bersedia menerima balasan Syuaib meski hanya sekedar suguhan bagi tamu. Pergilah Musa ke rumah Syuaib bersama wanita itu; dan bertemulah Musa dengan Syuaib, kemudian dia menceritakan kezaliman yang terjadi di negeri Fir’aun, dan bagaimana peristiwa yang terjadi setelah perselisihan antara orang Qibthi dan orang Bani Israil, serta bagaimana mereka menghalalkan darah Musa. Syuaib berkata kepadanya: “Kamu telah aman dari musuhmu, kamu tidak akan tertangkap oleh orang-orang zalim.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. قَالَتْ إِنَّ أَبِى يَدْعُوكَ لِيَجْزِيَكَ أَجْرَ مَا سَقَيْتَ لَنَا ۚ (ia berkata: “Sesungguhnya bapakku memanggil kamu agar ia memberikan balasan terhadap (kebaikan)mu memberi minum (ternak) kami”) Yakni kemudian keduanya bergegas menuju ayah mereka dan bercerita kepadanya tentang orang yang membantu mereka memberi minum kambing-kambing mereka. Maka ayah mereka menyuruh salah satu putrinya itu untuk memanggilnya, maka ia mendatanginya. Mayoritas ahli tafsir mengatakan bahwa dua wanita itu adalah putri Nabi Syu’aib. Namun dalam al-Qur’an dan as-Sunnah dalil yang menunjukkan bahwa dia adalah Nabi Syu’aib. فَلَمَّا جَآءَهُۥ وَقَصَّ عَلَيْهِ الْقَصَصَ(Maka tatkala Musa mendatangi bapaknya (Syu’aib) dan menceritakan kepadanya cerita (mengenai dirinya)) Yakni Musa menceritakan segala yang terjadi padanya, mulai dari kejadian pembunuhannya terhadap orang Mesir sampai ketika ia menuju sumber air penduduk Madyan. قَالَ(Syu’aib berkata) Yakni ayah kedua wanita itu berkata. لَا تَخَفْ ۖ نَجَوْتَ مِنَ الْقَوْمِ الظّٰلِمِينَ(“Janganlah kamu takut. Kamu telah selamat dari orang-orang yang zalim itu”) Yakni selamat dari Fir’aun dan kaumnya, sebab Fir’aun tidak memiliki kekuasaan atas negeri Madyan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25. Kemudian, kedua wanita itu bergegas pulang kepada bapaknya dengan sangat cepat. Bapak mereka bertanya ada apa gerangan, sehingga keduanya bercerita tentang siapa yang membantunya memberi minum hewan ternaknya. Sehingga bapaknya memerintahkan salah satu dari dua putrinya itu untuk mengundang nabi Musa. Kemudian salah satu putrinya datang kepada nabi Musa, dia berjalan dengan malu-maul, ia berkata: \"Sesungguhnya bapakku memanggil engkau, beliau bermaksud memberi balasan terhadap kebaikanmu membantu kami untuk memberi minum ternak kami\". Maka tatkala nabi Musa mendatangi bapaknya yang tidak lain adalah nabi Syu´aib. Nabi Musa tidak mengharap balasa itu, kemudian nabi Musa memperkenalkan dirinya serta menceritakan apa yang telah beliau alami sebelumnya mengenai peristiwa pembunuhan dan ketakutannya kepada Fir’aun. Kemudian nabi Syu´aib berkata: \"Janganlah kamu takut. Kamu telah selamat dari orang-orang yang zalim itu. Fir’aun tidak mempunyai kekuasaan atas negeri Madyan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu salah seorang dari dua perempuan itu datang kepada Musa sambil berjalan dengan malu-malu. Dia berkata,“Sesungguhnya ayahku mengundangmu untuk memberi balasan sebagai imbalan karena telah memberi minum (ternak) kami” Ketika dia mendatanginya dan menceritakan kepadanya kisahnya, dia berkata,“Jangan takut. Kamu telah selamat dari orang-orang yang zalim itu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Dan Musa terus dalam kondisi seperti itu, memohon kepada Allah sambil berbolak-balik, sedangkan kedua perempuan tadi pulang menuju ayahnya dan memberitakan apa yang telah terjadi. Kemudian sang ayah menyuruh salah satu dari dari gadis iiu untuk mendatangi Musa, lalu dia pun mendatanginya “berjalan dengan malu-malu.” Ini menunjukkan keluhuran jiwanya dan akhlaknya yang mulia, sebab rasa malu itu termasuk akhlak yang terpuji, terutama bagi kaum wanita. Hal ini juga membuktikan bahwa apa yang dilakukan oleh Musa, yaitu memberikan minum ternak kedua gadis itu bukan berkedudukan sebagai kuli atau pembantu yang biasanya tidak dimalui, malah sebaliknya, Musa berbesar jiwa, si perempuan itu, melihat sesuatu yang membuatnya sangat merasa malu kepada Musa, “dia berkata” kepada Musa, “Sesungguhnya bapakku memanggil kamu agar dia memberi balasan terhadap (kebaikan) mu memberi minum (ternak) kami.” Maksudnya, bukan untuk mengungkit-ungkit kebaikanmu, melainkan engkaulah yang terlebih dahulu melakukan kebaikan kepada kami. Sesungguhnya maksud ayahku hanya memberimu imbalan atas kebaikanmu. Musa kemudian memenuhi panggilan itu. “Maka tatkala Musa mendatangi bapaknya (Syu’aib) dan menceritakan kepadanya cerita (mengenai dirinya),” dari permulaan sebab yang telah mengharuskannya melarikan diri hingga sampai kepadanya, Syua’ib berkata dengan maksud menenangkan rasa takutnya dan mengobati hatinya, “Janganlah kamu takut. Kamu telah selamat dari orang-orang yang zhalim itu.” Maksudnya, biarkan rasa takut dan rasa cemasmu pergi, karena sesungguhnya Allah telah menyelamatkanmu dari mereka, karena engkau telah sampai di tempat ini, tempat yang mereka tidak mempunyai kekuasaan atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 25: Maka kembalilah kedua perempuan tersebut menuju bapaknya dan kedua anaknya tersebut bercerita akan Musa yang memberi minum ternaknya. Maka bapaknya menyuruh salah satu dari anaknya untuk memanggil Musa. Kemudian sampailah perempuan tersebut kepada Musa dan berkata dengan penuh malu : Sungguh bapakku mengundangmu untuk membalas atas kebaikanmu memberikan minum ternak kami. Ketika Musa datang di sisi bapak kedua perempuan tersebut, Musa bercerita atas kejadian yang dia alami. Setelah selesai Musa bercerita, bapaknya berkata : Jangan takut wahai Musa dan tenangkan hatimu, sungguh Allah akan memenangkan engkau atas kaummu yang dzalim yang menyimpang dari syariat Allah, sebab mereka tidak ada kekuatan di sisi mereka di negeri yang engkau telah menginjakkan kakimu di sini (Madyan)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Hal ini menunjukkan kepribadiannya yang mulia dan akhlaknya yang terpuji, karena malu termasuk akhlak utama, terlebih bagi wanita. Ayat ini juga menunjukkan bahwa sikap Nabi Musa ‘alaihis salam memberi minum kepada keduanya tidaklah sebagai pekerja atau pelayan yang biasanya tidak memiliki rasa malu, bahkan Beliau terhormat. Oleh karena itulah, wanita ini ketika melihat akhlak Musa yang mulia, membuatnya merasa malu dengannya. Ahli tafsir berbeda pendapat tentang ayah perempuan itu siapakah dia? Ada yang berpendapat, bahwa ayah itu adalah Nabi Syu’aib inilah yang masyhur, dan di antara ulama yang menyatakan demikian adalah Al Hasan Al Bashri dan Malik bin Anas, bahkan ada hadits yang menegaskan demikian, namun dalam isnadnya perlu dipertimbangkan. Ada pula yang berpendapat bahwa Nabi Syu’aib berumur panjang setelah kaumnya dibinasakan sehingga masih hidup di zaman Nabi Musa dan menikahkan puterinya dengan Musa. Ibnu Abi Hatim meriwayatkan dari Al Hasan Al Bashri bahwa ayah itu bernama Syu’aib, namun bukan Nabi kaum Madyan. Ada pula yang berpendapat bahwa bapak itu adalah putera saudara Syu’aib. Ada pula yang mengatakan, “Putra pamannya,” dan ada pula yang berpendapat, bahwa ia adalah salah seorang dari kaum Nabi Syu’aib yang beriman, ada pula yang berpendapat bahwa namanya “Yatsarun.” Wallahu a’lam (lihat Qashashul Anbiya’ oleh Ibnu Katsir). Syaikh As Sa’diy dalam tafsirnya lebih cenderung menguatkan, bahwa ayah kedua wanita itu bukanlah Nabi Syu’aib ‘alaihis salam. Sehingga Beliau sampai di tempat ini. Menenangkan rasa kekhawatirannya. Karena engkau telah berada di tempat yang mereka tidak memiliki kekuasaan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 25",
    "description": "Kedua perempuan yang dibantu oleh musa menceritakan kebaikan musa kepada ayah mereka. Sang ayah memerintahkan salah seorang dari putrinya untuk mengundang musa ke rumah. Kemudian datanglah kepada musa salah seorang dari kedua perempuan yang baru saja ia bantu itu. Ia datang dalam keadan berjalan dengan malu-malu karena ditugaskan bertemu muka seorang diri dengan pemuda tampan dan berwibawa yang telah membantunya untuk mengundangnya ke rumah. Menyampaikan pesan sang ayah, dia berkata, \"sesungguhnya ayahku mengundangmu untuk memberi balasan sebagai imbalan atas kebaikanmu memberi minum ternak kami. Dengan segera musa yang sedang memerlukan bantuan menceritakan kepadanya kisah mengenai dirinya dan fir'aun serta masyarakat mesir, dia yakni bapak perempuan itu berkata, \"janganlah engkau takut kekuasaan fir'aun tidak sampai ke wilayah ini, dan tuhan tidak akan mencelakakan orang-orang yang selalu berbuat baik dan dekat dengan-Nya. Tenanglah, engkau telah selamat dari orang-orang yang zalim itu. \"26. Anak perempuan orang tua itu kagum kepada musa, melihat kekuatan fisiknya dan kewibawaannya ketika mengambil air minum ternak, serta kesantunannya ketika berjalan menuju rumah. Dan selanjutnya salah seorang dari kedua perempuan itu yang datang mengundang musa berkata, \"wahai ayahku! jadikanlah dia sebagai pekerja pada kita antara lain menggembalakan ternak kita, karena sesungguhnya dia adalah orang yang kuat dan terpercaya, dan sesungguhnya orang yang paling baik yang engkau ambil sebagai pekerja pada kita untuk pekerjaan apa pun ialah orang yang kuat fisik dan mentalnya dan dapat dipercaya. \"."
  }
]