[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Salah seorang wanita itu berkata kepada bapaknya, “Wahai ayah, jadikanlah ia orang yang bekerja menggembala ternak untukmu. Sesungguhnya sebaik-baik orang yang engkau pekerjakan untuk menggembalakan ternak adalah orang yang kuat untuk menjaga ternakmu lagi dapat dipercaya yang engkau tidak khawatir ia akan berkhianat dalam urusan yang engkau percayakan kepadanya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Salah satu dari putrinya berkata, “Wahai ayahandaku! Pekerjakan dia untuk menggembalakan kambing kita, dia pantas untuk engkau pekerjakan karena dia menggabungkan antara fisik yang kuat dan amanah. Dengan kekuatannya dia menjalankan tugas yang dibebankan kepadanya dan dengan amanat dia menjaga apa yang diamanatkan kepadanya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Salah satu putri Syuaib mengusulkan kepada ayahnya agar menjadikan Musa sebagai pekerjanya, sambil mengemukakan alasan bahwa sifat-sifat baik seorang pekerja ada pada diri Musa; dia memiliki tubuh yang kuat dan mampu menjaga amanah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قَالَتْ إِحْدَىٰهُمَا يٰٓأَبَتِ اسْتَـْٔجِرْهُ ۖ (Salah seorang dari kedua wanita itu berkata: “Ya bapakku ambillah ia sebagai orang yang bekerja (pada kita)) Untuk menggembalakan kambing untuk kita. إِنَّ خَيْرَ مَنِ اسْتَـْٔجَرْتَ الْقَوِىُّ الْأَمِينُ(karena sesungguhnya orang yang paling baik yang kamu ambil untuk bekerja (pada kita) ialah orang yang kuat lagi dapat dipercaya”) Yakni ia layak untuk kamu ajak bekerja karena ia memiliki dua sifat baik, yaitu kuat dan amanah; dua sifat ini jika terdapat pada seseorang maka ia akan menjadi orang yang paling layak untuk melakukan pekerjaan itu, baik itu sebagai buruh, wakil, pegawai, pengawas, atau lainnya. Sifat pertama adalah amanah, sehingga ia tidak berkhianat dalam barang orang lain yang diserahkan kepadanya. Dan kedua adalah kekuatan untuk menjalankan pekerjaan itu, termasuk di dalamnya adalah pengalaman dan semangat dalam bekerja serta kebugaran badannya. Dua sifat ini terdapat pada diri Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Salah seorang dari kedua putri yang lebih tua itu berkata: \"Wahai bapakku, jadikanlah dia sebagai orang yang merawat ternak kita, karena sesungguhnya orang yang paling baik yang engkau jadikan pekerja kita ialah orang yang kuat dan dapat dipercaya\"."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “Salah seorang dari kedua wanita itu berkata.” Maksudnya, salah satu putrinya, “Wahai ayahku, ambillah ia sebagai orang yang bekerja,” maksudnya jadikanlah dia sebagai karyawanmu untuk menggembala domba dan memberinya minum, “karena sesungguhnya dia orang yang paling baik yang kamu ambil untuk bekerja (pada kita) ialah orang yang kuat lagi dapat dipercaya,” maksudnya, sesungguhnya Musa adalah yang paling pantas untuk dijadikan sebagai pekerja, karena dia mempunyai dua sifat, yaitu kuat dan terpercaya, dan sebaik-baik pekerja adalah orang yang memiliki dua sifat itu. Yaitu kekuatan dan kemampuan untuk melakukan apa yang dibebankan kepadanya, dan amanah di dalam pekerjaannya diwujudkan dengan cara tidak berkhianat. Dua sifat ini pantas untuk dijadikan pertimbangan bagi setiap orang yang akan menyerahkan suatu pekerjaan untuk orang lain dengan upah atau lainnya. Sebab, kesalahan tidak akan terjadi kecuali karena ketiadaan dua sifat ini atau ketiadaan salah satunya. Adapun kalau keduanya ada, maka pekerja pasti akan sempurna dan terlaksana. Sebenarnya dia mengatakan hal itu karena dia telah menyaksikan sendiri kekuatan Musa pada saat meminumkan ternak keduanya dan kegigihannya yang dengannya dia dapat mengetahui kekuatan Musa. Dan dia pun menyaksikan keamanahan dan kereligiannya dan (dia merasakan pula) bahwa Musa merasa kasihan kepada mereka berdua tanpa mengharapkan imbalan dari mereka berdua, dan tujuan Musa hanyalah memperoleh Wajah Allah semata."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 26: Kemudian berkata salah satu dari perempuan tersebut kepada bapaknya : Wahai bapakku, berikan Musa upah, agar dia dapat mengembalakan dan memberikan minum ternak kami kembali, dengan sebaik-baik balasan karena kekuatan dirinya dan amanahnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk menggembala kambing dan memberi minumnya. Kedua sifat ini, “Kuat dan amanah” perlu diperhatikan ketika memilih seseorang sebagai karyawannya. Jika kedua-duanya berkumpul bersamaan, maka akan sempurnalah pekerjaan. Umar, Ibnu Abbas, Syuraih Al Qaadhiy, Abu Malik, Qatadah dan lain-lain mengatakan, “Ketika wanita itu mengatakan seperti itu, ayahnya bertanya kepadanya, “Dari mana kamu tahu demikian?” wanita itu menjawab, “Sesungguhnya dia mampu mengangkat batu besar yang tidak mungkin diangkat kecuali oleh sepuluh orang, juga pada saat aku datang (kemari) bersamanya, aku berjalan di depannya, namun ia mengatakan, “Berjalanlah di belakangku, jika hendak melewati jalan lain, lemparlah batu kecil ini agar aku tahu jalan.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 26",
    "description": "Anak perempuan orang tua itu kagum kepada musa, melihat kekuatan fisiknya dan kewibawaannya ketika mengambil air minum ternak, serta kesantunannya ketika berjalan menuju rumah. Dan selanjutnya salah seorang dari kedua perempuan itu yang datang mengundang musa berkata, \"wahai ayahku! jadikanlah dia sebagai pekerja pada kita antara lain menggembalakan ternak kita, karena sesungguhnya dia adalah orang yang kuat dan terpercaya, dan sesungguhnya orang yang paling baik yang engkau ambil sebagai pekerja pada kita untuk pekerjaan apa pun ialah orang yang kuat fisik dan mentalnya dan dapat dipercaya. \"27. Sang ayah memahami kekaguman anak perempuannya terhadap musa dan memang orang seperti musalah yang didambakan setiap perempuan untuk menjadi suami. Dengan tanpa segan dia berkata, \"sesungguhnya aku bermaksud ingin menikahkan engkau dengan salah seorang dari kedua anak perempuanku ini yang telah engkau lihat dan kenal sejak di tempat sumber air. Pernikahan itu dengan ketentuan bahwa engkau bekerja padaku selama delapan tahun dan jika engkau sempurnakan yang delapan tahun itu menjadi sepuluh tahun secara sukarela maka itu adalah suatu kebaikan darimu, bukan sebuah kewajiban yang mengikat, dan kendati itu adalah usulan dariku tetapi ketahuilah bahwa aku tidak bermaksud memberatkan engkau. Aku akan selalu berusaha menjadi orang yang menepati janji. Lnsya Allah engkau akan mendapatiku termasuk orang yang baik. \"."
  }
]