[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang tua itu berkata kepada Musa, “Sesungguhnya aku ingin menikahkan kamu dengan salah seorang putriku ini dengan syarat kamu bekerja untukku menggembala ternakku selama delapan tahun sebagai imbalannya. Apabila kamu menyempurnakan sampai sepuluh tahun, maka itu adalah satu tindakan baik darimu. Dan aku tidak ingin mempersulit dirimu dengan menjadikan masa kerjanya sepuluh tahun. Kamu akan mendapatiku insya allah termasuk orang-orang yang shalih dalam pergaulan yang baik dan menepati janji apa yang aku katakan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Ayah dari kedua wanita itu berkata kepada Musa -'alaihissalām-, “Sesungguhnya aku ingin menikahkan engkau dengan salah satu dari anakku ini dengan syarat maharnya yaitu engkau menggembalakan kambing kami selama delapan tahun, jika engkau ingin menyempurnakan sampai sepuluh tahun, maka terserah kepadamu, tidak wajib bagimu, karena perjanjiannya hanya selama delapan tahun, adapun lebih dari itu maka itu adalah tidak wajib. Aku tidak ingin membebanimu dengan sesuatu yang memberatkanmu. Engkau akan mendapatiku insya Allah termasuk orang-orang yang saleh, yang menepati janji dan tidak mengingkarinya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Syuaib menerima usulan putrinya, maka dia mulai memberi tawaran kepada Musa dengan mengungkapkan bahwa dia ingin menikahkannya dengan salah satu putrinya dan berharap maharnya berupa jasa pekerjaan dari Musa -sesuai dengan kaidah dalam syariatnya- selama delapan tahun, dan jika Musa ingin menambahnya menjadi sepuluh tahun maka itu adalah kebaikan dari dirinya. Dan Syuaib juga berkata: “Aku tidak ingin akad ini menyusahkanmu, namun aku ingin berbaik hati dan berlemah lembut padamu; karena itulah sifat orang yang shalih.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. قَالَ إِنِّىٓ أُرِيدُ أَنْ أُنكِحَكَ إِحْدَى ابْنَتَىَّ هٰتَيْنِ (katalah dia (Syu’aib): “Sesungguhnya aku bermaksud menikahkan kamu dengan salah seorang dari kedua anakku ini) Ayat ini menunjukkan disyariatkannya penawaran wali perempuan kepada lelaki yang serasi dan shalih, dan ini adalah sunnah yang tetap ada dalam agama Islam. Sebagaimana disebutkan bahwa Umar menawarkan putrinya yang bernama Hafsah kepada Utsman, kemudian kepada Abu Bakar; dan kisah ini cukup terkenal; serta kisah-kisah lain dalam hal ini yang terjadi pada masa Rasulullah maupun para sahabat. عَلَىٰٓ أَن تَأْجُرَنِى ثَمٰنِىَ حِجَجٍ ۖ (atas dasar bahwa kamu bekerja denganku delapan tahun) Yakni mahar putriku adalah dengan kamu bekerja menggembalakan kambing untukku selama delapan tahun. فَإِنْ أَتْمَمْتَ عَشْرًا فَمِنْ عِندِكَ ۖ (dan jika kamu cukupkan sepuluh tahun maka itu adalah (suatu kebaikan) dari kamu) Yakni jika kamu melengkapi pekerjaanmu yang delapan tahun menjadi sepuluh tahun, yakni menambah dua tahun untukku, maka itu merupakan kebaikan darimu dan bukan tuntutanku kepadamu. Ia menjadikan tambahan dua tahun itu sebagai bukti kebaikannya. وَمَآ أُرِيدُ أَنْ أَشُقَّ عَلَيْكَ ۚ( maka aku tidak hendak memberati kamu) Dengan mengharuskanmu untuk menyempurnakannya sepuluh tahun. سَتَجِدُنِىٓ إِن شَآءَ اللهُ مِنَ الصّٰلِحِينَ (Dan kamu Insya Allah akan mendapatiku termasuk orang-orang yang baik”) Orang yang baik dalam berinteraksi dan menepati janji."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Kemudian nabi Syu´aib menjawab: \"Sesungguhnya aku bermaksud menikahkan kamu dengan salah seorang dari kedua anakku ini, atas dasar bahwa kamu bekerja denganku delapan tahun itu sebagai mahar. Jika kamu cukupkan menjadi sepuluh tahun maka itu adalah suatu kebaikan dari kamu, maka aku tidak bermaksud membebani kamu untuk menggenapkan sepuluh tahun. Engkau (insyaAllah: jika Allah menghendaki) akan mendapatiku termasuk orang-orang yang baik dan menepati janji. Sehingga ini menjadi syariat sebagai syarat kehadiran wali perempuan dalam pernikahan\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Sesungguhnya aku bermaksud menikahkanmu} menikahkanmu {dengan salah seorang dari kedua anak perempuanku ini dengan syarat bahwa kamu bekerja padaku} kamu menjadi pekerja untukku untuk memelihara hewan ternakku {selama delapan tahun} tahun {Jika kamu menyempurnakannya sepuluh tahun, itu adalah (kebaikan) darimu. Aku tidak bermaksud memberatkanmu. Insyaallah akan akan mendapatiku termasuk orang-orang yang baik”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Lalu “dia berkata.” Maksudnya, penguasa negeri Madyan itu kepada Musa, “SEsungguhnya aku bermaksud menikahkan kamu dengan salah seorang dari kedua anakku ini, atas dasar bahwa kamu bekerja kepadaku,” maksudnya, kamu menjadi pekerjaku dengan upah “selama delapan (musim) haji,” maksudnya, delapan tahun. “Dan jika kamu cukupkan sepuluh tahun maka itu adalah (suatu kebaikan) darimu,” adalah sumbangan darimu, tidak ada sesuatu yang wajib atasmu, “aku tidak hendak memberatkanmu,” lalu aku mewajibkan sepuluh tahun kepadamu; atau aku ingin mempekerjakanmu supaya membebanimu dengan pekerjaan-pekerjaan yang ringan lagi mudah, tidak meberatkan, “dan kamu insya Allah akan mendapatiku (termasuk orang-orang yang baik.” Lalu Syu’aib membuatnya menyukai (untuk diangkat sebagai karyawan) dengan cara (membebankan) pekerjaan yang ringan dan perlakuan yang baik. Ini membuktikan bahwa lelaki yang shalih harus memperbaiki akhlaknya sebisa mungkin, dan bahwa faktor (jenis pekerjaan) yang dituntut darinya adalah lebih penting daripada faktor lainnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 27: Kemudian berkata bapak dari kedua wanita tersebut : Sungguh aku ingin engkau menikah dengan salah satu dari kedua anakku dan menjadikan maharnya berupa upah dengan menggembalakan ternak-ternakku selama 7 tahun lamanya, dan jika engkau perpanjang sampai 10 tahun, maka hal ini lebih baik untukmu dan aku. Dan aku berharap padamu agar menggembalakan ternak kami selama 10 tahun lamanya, dan engkau adalah termasuk orang-orang yang shalih wahai Musa -insya Allah- dalam memenuhi akad."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni mengembala kambingku. Dan tidak wajib kamu lakukan. Yakni, aku hanyalah membebanimu dengan pekerjaan yang ringan dan tidak berat. Keinginannya untuk memberikan kemudahan dan bermuamalah secara baik menunjukkan bahwa orang tersebut adalah orang yang saleh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 27",
    "description": "Sang ayah memahami kekaguman anak perempuannya terhadap musa dan memang orang seperti musalah yang didambakan setiap perempuan untuk menjadi suami. Dengan tanpa segan dia berkata, \"sesungguhnya aku bermaksud ingin menikahkan engkau dengan salah seorang dari kedua anak perempuanku ini yang telah engkau lihat dan kenal sejak di tempat sumber air. Pernikahan itu dengan ketentuan bahwa engkau bekerja padaku selama delapan tahun dan jika engkau sempurnakan yang delapan tahun itu menjadi sepuluh tahun secara sukarela maka itu adalah suatu kebaikan darimu, bukan sebuah kewajiban yang mengikat, dan kendati itu adalah usulan dariku tetapi ketahuilah bahwa aku tidak bermaksud memberatkan engkau. Aku akan selalu berusaha menjadi orang yang menepati janji. Lnsya Allah engkau akan mendapatiku termasuk orang yang baik. \"28. Setelah mempertimbangkan segala sesuatunya, musa menerima usulan tersebut, dan dia berkata, \"itu adalah perjanjian yang adil antara aku dan engkau. Adapun alternatif waktu yang engkau berikan, aku belum bisa memastikannya sekarang, tetapi pada prinsipnya yang mana saja dari kedua waktu yang ditentukan itu yang aku sempurnakan, maka setelah itu tidak ada tuntutan tambahan atas diriku lagi. Dan Allah menjadi saksi atas apa yang kita ucapkan. \"."
  }
]