[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Musa berkata, “Apa yang kamu katakan tadi berlaku antara aku dan kamu. Maksudnya, mana saja dari kedua tempo waktu yang aku jalani dalam bekerja, maka aku sudah memenuhi kewajiban kepadamu. Maka aku tidak akan dituntut untuk melakukan yang lebih dari itu. Dan Allah adalah saksi atas apa yang kita ucapkan, lagi Maha Pemelihara yang menyertai kita, dan Mengetahui perjanijian yang kita buat bersama.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Musa berkata, “Itulah perjanjian antara diriku dan dirimu yang mengikat kita. Tenggat mana saja yang aku tunaikan; delapan tahun atau sepuluh tahun, maka aku telah menunaikan apa yang menjadi kewajibanku, maka janganlah engkau meminta tambahan lagi kepadaku, dan Allah menjadi saksi atas apa yang kita sepakati dan Dia senantiasa memantaunya.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28. Musa menyetujui tawaran Syuaib beserta akadnya, dan membiarkan pilihan tetap ada pada dirinya apakah mengambil delapan atau sepuluh tahun, sehingga jika dia menyelesaikan salah satu tenggang waktu maka dia tidak melanggar ketentuan. Allah Maha Menyaksikan apa yang mereka berdua sepakati."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. قَالَ (Dia berkata) Yakni Musa. ذٰلِكَ بَيْنِى وَبَيْنَكَ ۖ( Itulah antara aku dan kamu) Ini adalah isyarat yang ditujukan kepada perjanjian yang mereka berdua sepakati. أَيَّمَا الْأَجَلَيْنِ قَضَيْتُ(Mana saja dari kedua waktu yang ditentukan itu aku sempurnakan) Baik itu delapan tahun maupun sepuluh tahun. فَلَا عُدْوٰنَ عَلَىَّ ۖ( maka tidak ada tuntutan tambahan atas diriku (lagi)) Maka janganlah ada kezaliman kepadaku dengan memintaku menambah apa yang telah kamu tetapkan dengan dua waktu itu. Musa menyebutkan kedua waktu itu agar mengisyaratkan bahwa delapan tahun sudah merupakan penepatan perjanjian yang telah sempurna. وَاللهُ عَلَىٰ مَا نَقُولُ وَكِيلٌ(Dan Allah adalah saksi atas apa yang kita ucapkan”) Yakni saksi dan pengawas atas syarat-syarat yang belaku yang kita utarakan ini, sehingga kita berdua tidak dapat keluar dari syarat-syarat tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Nabi Musa berkata: \"Itulah perjanjian antara aku dan engkau. Mana saja dari kedua waktu yang ditentukan itu aku sempurnakan, maka tidak ada tuntutan tambahan yang harus aku penuhi lagi lebih atau kurang dari perjanjian itu. Allah adalah saksi atas apa yang kita ucapkan, dan perjanjian itu menjadi ketetapan\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Musa berkata {“Itu antara aku dan kamu. Yang mana saja dari kedua waktu itu} mana saja dari dua waktu itu, baik delapan maupun sepuluh tahun {aku sempurnakan} aku penuhi dan sempurnakan {maka tidak ada tuntutan atas diriku} sehingga aku tidak dizalimi dengan diminta untuk melakukan lebih lama dari kedua waktu itu {Allah menjadi saksi} saksi {atas apa yang kita ucapkan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Maka “berkata” Musa menjawab permintaan orang itu, “Itulah (perjanjian) antara aku dan kamu,” maksudnya, persyaratan yang engkau sebutkan tadi, maka aku rela (menerimanya), dan sudah sempurna akad antara aku denganmu, “Mana saja dari kedua waktu yang ditentukan itu aku sempurnakan, maka tidak ada tuntutan tambahan atas diriku,” sama saja bagiku, apakah yang aku tunaikan itu yang delapan tahun atau aku dengan suka rela melebihinya, “dan Allah adalah saksi atas apa yang kita ucapkan,” menjadi penjaga yang selalu mengawasi kita dan mengetahui apa yang kita sepakati. Lelaki, si ayah gadis ini adalah penguasa negeri Madyan, dia bukan Syu’aib, sang nabi yang terkenal itu, sebagaimana dikenal di kalangan banyak orang. Sesungguhnya pendapat yang demikian itu sama sekali tidak mempunyai dalil. Yang ada adalah bahwa negeri syua’ib adalah Madyan, dan peristiwa (yang sedang dibicarakan) ini terjadi di Madyan. Lalu di mana keterkaitan antara kedua perkara ini? Dan juga, tidak diketahui adanya informasi bahwa Musa mengalami masa hidupnya Syu’aib, apa lagi dengan pribadinya? Kalau sekiranya lelaki itu adalah Syu’aib, tentu Allah menyebutnya dan tentu kedua gadis tersebut menyebut namanya. Dan pula, sesungguhnya kaumnya Syu’aib telah dimusnahkan oleh Allah karena mereka telah mendustakannya, tidak ada yang tersisa kecuali orang-orang yang beriman kepadanya. Dan Allah sudah pasti melindungi kaum Mukminin dari sikap rela mereka terhadap perbuatan menghalang-halangi dua putri nabi mereka untuk meminumkan ternaknya, sehingga harus datang seorang lelaki asing lalu berbaik hati kepada mereka berdua dan membantu meminumkan hewan ternaknya. Dan tentu Syu’aib tidak rela kalau Musa bekerja sebagai penggembala untuknya dan menjadi pembantunya, padahal Musa lebih utama dan lebih tinggi derajatnya daripadanya, kecuali kalau dikatakan bahwa hal ini terjadi sebelum kenabian Musa, maka tidak terjadi kontradiksi. Yang jelas, ia tidak bisa dijadikan sandaran klaim bahwa lekaki adalah Nabi Syu’aib tanpa dasar hadits shahih dari Nabi. Walllahu a’lam."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 28: Dan Musa berkata menjawab tawaran dari bapak kedua perempuan tadi : Sungguh aku setuju atas tawaran akad ini yang telah engkau sebutkan tadi, dan aku juga akan komitmen dengannya, mau berapa lamapun aku akan penuhi perjanjian tersebut, dan Allah menjadi saksi atas perjanjian ini, menjaga perjanjian ini dan mengokohkanku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Disebutkan dalam tafsir Al Jalaalain, bahwa selanjutnya ayah wanita itu memerintahkan puterinya memberikan tongkat kepada Musa untuk menyingkirkan binatang buas yang akan menerkam kambing-kambingnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 28",
    "description": "Setelah mempertimbangkan segala sesuatunya, musa menerima usulan tersebut, dan dia berkata, \"itu adalah perjanjian yang adil antara aku dan engkau. Adapun alternatif waktu yang engkau berikan, aku belum bisa memastikannya sekarang, tetapi pada prinsipnya yang mana saja dari kedua waktu yang ditentukan itu yang aku sempurnakan, maka setelah itu tidak ada tuntutan tambahan atas diriku lagi. Dan Allah menjadi saksi atas apa yang kita ucapkan. \"29. Setelah nabi musa menyetujui untuk menikahi salah seorang perempuan yang ditemuinya di tempat sumber air dengan syarat-syarat yang diajukan ayah perempuan itu, hiduplah ia bersama keluarganya di madyan. Maka ketika musa telah menyelesaikan pekerjaan sesuai waktu yang ditentukan itu, yaitu sepuluh tahun lamanya, dan ketika dia berangkat kembali menuju tempat kelahirannya di negeri mesir bersama de-ngan keluarganya untuk menemui ibunya dan saudara perempuannya, di tengah perjalanan dia melihat dengan sangat jelas api di lereng gunung dari arah bukit sinai. Ketika itu dia berkata kepada keluarganya, 'tunggulah di sini, jangan beranjak dari tempat ini, sesungguhnya aku melihat cahaya api di tengah kegelapan. Aku akan mendatangi api itu, mudah-Mudahan aku dapat membawa suatu berita kepadamu dari tempat api itu mengenai arah jalan yang akan kita tempuh, atau membawa sepercik api, agar kamu dapat menghangatkan badan. '."
  }
]