[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Setelah nabi Allah, Musa menepati tempo waktu selama sepuluh tahun kepada orang tersebut, yaitu tempo waktu yang lebih lama, dan berangkat bersama keluarganya menuju Mesir, dia melihat nyala api di lereng gunung. Musa berkata kepada keluarganya, “Sebentar dan tunggulah, sesungguhnya aku melihat api. Mudah-mudahan aku bisa kembali kepada kalian darinya dengan satu berita atau aku kembali kepada kalian dengan membawa nyala api agar kalian dapat menghangatkan badan dengannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Tatkala Musa telah menunaikan tenggat waktu maksimal yaitu sepuluh tahun, dan dia berangkat dengan keluarganya dari negeri Madyan menuju Mesir, ia melihat api di lereng gunung. Ia berkata kepada keluarganya, “Tetaplah di sini, aku melihat api, semoga aku bisa membawa kabar kepadamu tentang api itu atau aku membawa untuk kalian suluh api untuk menyalakan api, dengannya kalian bisa menghangatkan diri dari hawa dingin.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "29. Akhirnya Musa menyelesaikan tenggang waktu yang paling lama dari waktu yang disepakati, yaitu sepuluh tahun. Kemudian dia bertekat untuk pergi ke negeri Mesir bersama istrinya; dan ketika dia berada di tengah perjalanan, dia melihat api di sisi gunung Thur, dan dia meminta keluarganya menunggunya agar dia dapat menuju api itu dengan harapan dia mendapati orang yang menunjukkan jalan atau dia dapat meminta suluh api untuk menghangatkan diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. فَلَمَّا قَضَىٰ مُوسَى الْأَجَلَ (Maka tatkala Musa telah menyelesaikan waktu yang ditentukan) Yakni menyelesaikannya dengan waktu yang paling sempurna yaitu sepuluh tahun. وَسَارَ بِأَهْلِهِۦٓ (dan dia berangkat dengan keluarganya) Menuju Mesir. Terdapat pendapat mengatakan bahwa seorang suami dapat membawa istrinya kemanapun ia kehendaki. ءَانَسَ مِن جَانِبِ الطُّورِ نَارًا (dilihatnyalah api di lereng gunung) Yakni ia melihatnya dari kejauhan. Kalimat ini telah disebutkan tafsirnya pada surat Taha dengan jelas. قَالَ لِأَهْلِهِ امْكُثُوٓا۟ إِنِّىٓ ءَانَسْتُ نَارًا لَّعَلِّىٓ ءَاتِيكُم مِّنْهَا بِخَبَرٍ (gunung ia berkata kepada keluarganya: “Tunggulah (di sini), sesungguhnya aku melihat api, mudah-mudahan aku dapat membawa suatu berita kepadamu dari (tempat) api itu) Kalimat ini juga telah dijelaskan tafsirnya dalam surat Taha dan an-Naml. أَوْ جَذْوَةٍ(atau (membawa) sesuluh api) Makna (الجدوة) adalah sepotong bara api. لَعَلَّكُمْ تَصْطَلُونَ (agar kamu dapat menghangatkan badan”) Yakni agar kalian dapat menghangatkan badan dengan api tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Maka ketika nabi Musa telah menyelesaikan waktu yang ditentukan dengan nabi Syu’aib yaitu sepuluh tahun, lantas nabi Musa meninggalkan kota Madyan dan dengan izin nabi Syu’aib berangkat menuju Mesir bersama istrinya. Sebagai laki-laki berhak membawa pergi keluarganya kemanapun dia kehendaki. Nabi Musa lalu melihat api di lereng gunung Thursina ia berkata kepada istrinya: \"Tunggulah (di sini, aku sungguh melihat api, mudah-mudahan aku dapat membawa suatu berita kepadamu dari tempat itu) api itu atau dapat membawa sesuluh api, agar kamu dapat menghangatkan badan\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka ketika Musa telah menyelesaikan} menyempurnakan {waktu yang ditentukan itu dan berangkat dengan keluarganya, dia melihat} melihat {api di lereng gunung. Dia berkata kepada keluarganya,“Tunggulah. Sesungguhnya aku melihat api. Mudah-mudahan aku dapat membawa suatu berita kepadamu dari sana atau sepercik api} nyala api {agar kalian bisa mendapat kehangatan} kalian bisa mendapat kehangatan darinya dari hawa dingin"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “Maka tatkala Musa telah menyelesaikan waktu yang ditentukan.” Bisa jadi Musa telah menyelesaikan waktu yang wajib yang telah ditentukan atau sudah melebihinya, sebagaimana bisa diduga pada Musa dan penunaiannya, kemudian dia merasa rindu untuk berjumpa dengan kelarga, ibunda, kerabat dekat dan tanah airnya. Dan diduga pula, karena sudah lamanya masa, bahwa mereka telah melupakan apa yang telah diperbuatnya. “Dan dia berangkat dengan keluarganya,” menuju Mesir, lalu “dia melihat api di lereng gunung Thur.” maka “dia berkata kepada keluarganya, ‘Tunggulah (di sini), sesungguhnya aku melihat api, mudah-mudahan aku dapat membawa suatu berita kepadamu dari (tempat) api itu’,” atau aku membawakan cahaya api obor kepadamu, “atau (membawa) sesuluh api, agar kamu dapat menghangatkan badan.” Pada saat itu dia sudah kedinginan dan tersesat jalan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 29: Maka ketika telah sempurna waktu ditunaikannya perjanjian untuk berkhidmat dan telah memiliki istri, Musa kembali menuju Mesir dan ia juga telah melihat cahaya di samping gunung thur, ia menyangka bahwasanya yang keluar adalah api, kemudian ia meminta istrinya untuk melihat ke arah api tersebut karena ingin segera pergi barangkali (api) tersebut adalah tanda yang bermanfaat dalam rihlah mereka sehingga dapat memperjelas jalan mereka menuju ke Mesir, atau memanfaatkan api tersebut untuk menghangatkan di cuaca yang dingin. Perkataannya : لعلى كم ءاتكم منها mengabarkan bahwasanya Musa tersesat di jalan, tau dia meragukan jalan yang dia lewati, maka dia menginginkan kepastian menuju jalan yang benar."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Beliau rindu dengan keluarganya dan kampung halamannya. Setelah Musa ‘alaihis salam menyelesaikan perjanjian dengan mertuanya. Dia berangkat dengan keluarganya dengan sejumlah kambing yang diberi mertuanya, maka pada suatu malam yang gelap dan dingin, Musa ‘alaihis salam tiba di suatu tempat, di mana setiap kali Beliau menghidupkan api, ternyata api itu tidak menyala. Hal ini sangat mengherankan Musa, sehingga ia berkata kepada istrinya seperti yang disebutkan dalam ayat 29. Tentang jalan yang harus dilalui, di mana ketika itu Beliau sedang tersesat jalan dan merasakan kedinginan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 29",
    "description": "Setelah nabi musa menyetujui untuk menikahi salah seorang perempuan yang ditemuinya di tempat sumber air dengan syarat-syarat yang diajukan ayah perempuan itu, hiduplah ia bersama keluarganya di madyan. Maka ketika musa telah menyelesaikan pekerjaan sesuai waktu yang ditentukan itu, yaitu sepuluh tahun lamanya, dan ketika dia berangkat kembali menuju tempat kelahirannya di negeri mesir bersama de-ngan keluarganya untuk menemui ibunya dan saudara perempuannya, di tengah perjalanan dia melihat dengan sangat jelas api di lereng gunung dari arah bukit sinai. Ketika itu dia berkata kepada keluarganya, 'tunggulah di sini, jangan beranjak dari tempat ini, sesungguhnya aku melihat cahaya api di tengah kegelapan. Aku akan mendatangi api itu, mudah-Mudahan aku dapat membawa suatu berita kepadamu dari tempat api itu mengenai arah jalan yang akan kita tempuh, atau membawa sepercik api, agar kamu dapat menghangatkan badan. '30. Setelah berpesan kepada keluarganya, berangkatlah nabi musa. Maka ketika dia sampai ke tempat yang dilihatnya sebagai sumber api itu, dia diseru dari arah pinggir sebelah kanan lembah, dari sebatang pohon yang tumbuh di sebidang tanah yang diberkahi. Panggilan itu adalah, 'wahai musa! sungguh, aku yang engkau dengar memanggilmu ini adalah Allah, tidak ada yang patut disembah selain aku, tuhan pencipta, pemelihara dan pengawas seluruh alam!."
  }
]