[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kami membacakan kepadamu dari sebagian kisah Musa bersama bersama Fir’aun dengan benar, untuk kaum yang beriman kepada al-Qur’an ini dan membenarkan bahwa sesungguhnya al-Qur’an itu berasal dari sisi Allah dan mereka mengamalkan petunjuk-petunjuknya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Kami bacakan kepada kalian sebagian kisah Musa dan Fir'aun dengan sebenarnya, tidak ada keraguan padanya bagi orang-orang yang beriman, karena mereka lah yang bisa mengambil manfaat dari apa yang ada di dalamnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Terdapat kisah penting yang Kami bacakan kepadamu -Hai Muhammad-, yang berhubungan dengan kisah yang terjadi antara Musa dan Fir’aun. Ini merupakan kisah yang sesungguhnya yang harus diyakini oleh orang-orang beriman yang memiliki pemahaman yang benar, agar bertambah iman dan ilmu mereka dan agar hati mereka semakin teguh."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. نَتْلُوا۟ عَلَيْكَ مِن نَّبَإِ مُوسَىٰ وَفِرْعَوْنَ بِالْحَقِّ لِقَوْمٍ يُؤْمِنُونَ (Kami membacakan kepadamu sebagian dari kisah Musa dan Fir’aun dengan benar untuk orang-orang yang beriman) Yakni Kami mewahyukan kepadamu kisah keduanya dalam surat yang mulia ini kisah yang sesungguhnya agar kebenaran dan kisah para nabi yang terkandung didalamnya menjadi petunjuk dan pelajaran bagi orang-orang beriman. Adapun orang-orang kafir tidak akan mengambil manfaat dari kandungan surat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3. Kami membacakan kepadamu wahai Nabi, beberapa kisah Musa dan Fir´aun dengan kisah yang benar, agar dapat diambil berbagai pelajaran seperti kejujuran dan kemurnian untuk petunjuk orang-orang yang beriman. Sehingga mereka senantiasa berdzikir, karena mereka adalah orang-orang yang mengambil pelajaran dari kisah itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami membacakan} Kami membacakan {kepadamu sebagian dari kisah} kabar {Musa dan Firʻaun dengan sebenarnya} dengan benar {untuk kaum yang beriman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "3. Di antara bagian yang dijelaskan oleh Allah adalah kisah Nabi Musa dan Firaun. Al-Quran telah memunculkannya dan mengulanginya di dalam beberapa tempat, dan dia menguraikannya secara panjang lebar di sini, seraya berfirman, “Kami membacakan kepadamu sebagian dari kisah Musa dan Firaun dengan benar,” karena sesungguhnya berita kedua tokoh ini sangat aneh, dan informasi (tentang mereka berdua) sangat menarik “untuk orang-orang yang beriman.” Kepada merekalah pembicaraan ini diarahkan, karena mereka memiliki iman yang dengannya mereka bisa berkonsentrasi untuk menghayatinya dan menghadapinya dengan menerima dan menjadikan sisi-sisi ibrah (pelajaran) nya sebagai pedoman, dan dengannya mereka bertambah iman, keyakinan dan kebaikan. Adapun orang-orang selain mereka, maka sama sekali tidak mengambil faidah darinya kecuali penegakkan hujjah terhadap mereka. Allah memeliharanya dari mereka dan menjadikan dinding penghalang antara mereka dengannya sehingga membuat mereka tidak dapat memahaminya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 3: Allah kemudian menjelaskan bahwa akan dibacakan kepada Nabi-Nya ﷺ sesuatu dari kabar tentang Musa dan fir’aun; Seluruh bacaan ini semuanya adalah kebenaran dan kejujuran yang tiada kesamaran dan keraguan; Ayat tersebut adalah untuk kaum yang membenarkan akan Al Qur’an ini dan beramal dengan apa yang terdapat padanya hukum-hukum Allah dan peringatan-peringatan; Karena sebab mereka yang membenarkan dan mengamalkan Al Qur’an ini mendapatkan manfaat atas apa yang dibacakan kepada mereka dan juga bertambah cahaya mereka serta kebaikan dan manfaat bagi mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena berita keduanya asing, namun menarik. Karena merekalah yang dapat mengambil manfaat darinya. Kepada mereka ditujukan khithab (perkataan) ini, di mana keimanan yang ada dalam hati mereka menghendaki untuk memikirkan peristiwa itu dan menjadikannya pelajaran. Iman dan keyakinan mereka bertambah dengannya, demikian pula kebaikannya. Adapun selain mereka, maka tidak dapat mengambil faedah selain menegakkan hujjah, dan Allah menjaga kitabnya dari mereka serta mengadakan dinding sehingga mereka tidak dapat memahaminya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 3",
    "description": "Salah satu aspek penjelasannya adalah kami melalui malaikat jibril membacakan yakni menyampaikan kepadamu sebagian yakni beberapa episode dari kisah penting nabi musa dan fir'aun, penguasa mesir pada masanya. Pembacaan dan penyampaian itu dilakukan dengan sebenar-Nya dan sesuai dengan kenyataan untuk dimanfaatkan oleh orang-orang yang beriman dengan cara menarik pelajaran dari kisah tersebut. 4. Kisahnya bermula dari kesewenang-wenangan fir'aun dan rezimnya. Sungguh, fir'aun telah berbuat sewenang-wenang di muka bumi kepada Allah dengan mengaku dirinya sebagai tuhan dan juga kepada manusia dengan menjadikan penduduk negeri, mesir yang mereka kuasai-Nya berpecah belah menjadi dua kelompok besar; pertama, masyarakat mesir; dan kedua, masyarakat bani israil. Bentuk kesewenang-wenang-an itu antara lain dia menindas segolongan dari mereka yakni kelompok bani israil, dengan cara dia menyembelih anak laki-laki mereka dan membiarkan hidup sambil mempermalukan anak perempuan mereka. Sungguh, dia yakni fir'aun adalah termasuk kelompok orang yang berbuat kerusakan."
  }
]