[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Maka tatkala Musa mendatangi api itu, Allah menyerunya dari pinggir lembah sebelah kanan Musa, di tempat yang di berkahi, dari sisi sebuah pohon, “Wahai Musa, sesungguhnya Aku adalah Allah, Tuhan Penguasa alam semesta. Dan lemparkanlah tongkatmu.” Lalu Musa melemparkannya, maka tongkat itu berubah menjadi seekor ular yang bergerak-gerak cepat. Ketika Musa melihatnya bergerak-gerak seakan-akan dari bangsa ular, ia berbalik lalu menjauh darinya, dan ia tidak menoleh ke belakang karena rasa takut. Maka Tuhannya memangilnya, “Wahai Musa kembalilah kamu kepadaKu, dan jangan takut. Sesungguhnya kamu itu termasuk orang-orang yang aman dari segala hal yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Maka tatkala Musa mendatangi api yang dilihatnya, Rabbnya -Subḥānahu wa Ta'ālā- memanggilnya dari lembah sebelah kanan Musa di tempat yang diberkahi dari sebatang pohon kayu, “Wahai Musa! Inilah Aku, Allah, Rabb seluruh makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Musa pergi menuju api yang dia lihat itu; kemudian Tuhannya memanggilnya dari tepi lembah sebelah kanan di tempat yang diberkati dan ditumbuhi suatu pohon: “Hai Musa, datanglah kepada-Ku tanpa rasa takut; Aku adalah Allah, Tuhan semesta alam, dan seluruh makhluk tunduk kepada-Ku."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. فَلَمَّآ أَتَىٰهَا (Maka tatkala Musa sampai ke (tempat) api itu) Yakni ketika ia telah mendatangi api yang ia lihat tersebut. نُودِىَ مِن شٰطِئِ الْوَادِ الْأَيْمَنِ(diserulah dia dari (arah) pinggir lembah yang sebelah kanan(nya)) Yakni dari arah kanan yang berhadapan dengan sisi kiri Musa; atau sisi kiri aliran air jika lembah itu mengalirkan air, dan tafsiran ini lebih baik dan lebih benar. Allah menyebutnya dalam ayat lain, lembah suci yang bernama Tuwa. فِى الْبُقْعَةِ الْمُبٰرَكَةِ مِنَ الشَّجَرَةِ(pada tempat yang diberkahi, dari sebatang pohon kayu) Pohon itu tumbuh di pinggir lembah. Disebutkan oleh Abdullah bin Hamid dan Ibnu Jarir dari Abdullah bin Mas’ud, ia berkata: pernah disebutkan kepadaku sifat-sifat pohon yang didatangi oleh Musa, maka aku mendatanginya dengan perjalanan sehari semalam sampai pagi harinya. Ternyata pohon itu berwarna kuning kehijauan dan tumbuh subur. Kemudian aku bershalawat dan salam kepada Nabi Muhammad. Lalu untaku yang lapar hendak memakan daun pohon itu, kemudian ia memakannya sepenuh mulutnya dan mengunyahnya, namun ia tidak dapat mengunyahnya dengan baik sehingga ia memuntahkannya kembali. Kemudian aku bershalawat dan salam kepada Nabi Muhammad lagi, lalu aku pergi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Maka tatkala Musa sampai di tempat api itu, dia mendengar seruan yang memanggil namanya dari arah pinggir lembah yang berada di sebelah kanannya ketika dia menghadap ke arah Mesir. Yaitu dia berdiri pada tempat yang Allah berkahi untuk Musa, yang diberi nama Wadi yang suci (almuqaddas) untuk mendengarkan kalam dari Tuhannya yang akan memilihnya sebagai rasul. Yaitu pada pohon ‘Inab atau ‘alliq yang tumbuh di tepi wadi (lembah): \"Ya Musa, sesungguhnya aku adalah Allah, Tuhan semesta alam. Diriwayatkan dari Ibnu Humaid dan Ibnu Jarir dari Ibnu Mas’ud bahwa nabi Musa berjalan menuju pohon tersebut, apabila pohon itu telah berwarna coklat kehijauan maka akan gugur, kemudian untanya memakannya hingga memenuhi mulutnya, dan mengunyahnya namun tidak bisa menikmatinya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Lalu ketika dia mendatanginya, dia dipanggil dari pinggir} samping {lembah di sebelah kanan dari di sebidang tanah yang diberkahi dari (arah) pohon.“Wahai Musa, sesungguhnya Aku adalah Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Maka tatkala Musa sampai ke tempat api itu, diserulah dia, “Ya Musa, sesungguhnya Aku adalah Allah, Rabb semesta alam.” Allah mengabarkan kepadanya uluhiyah dan rubibiyahNya, dan dari hal itu memastikan memerintahnya agar beribadah dan mengabdi kepadaNya, sebagaimana ditegaskan di dalam ayat yang lain, \"Sesungguhnya Aku ini adalah Allah, tidak ada Tuhan (yang hak) selain Aku, maka sembahlah Aku dan dirikanlah salat untuk mengingat Aku.\" (Thaha:14)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 30: Maka ketika datang Musa (mendekati) cahaya tersebut yang telah Allah ciptakan dan sangat terkejut sampai yang dengannya adalah awal petunjukknya untuk keluarga dan ummatnya. Di mana Allah menyeru dari samping lembah, di sebelah kanan Musa di sebidang tanah yang penuh berkah, di samping pohon, Allah menyerunya : Wahai Musa perhatikanlah, bahwa yang akan mneyerumu adalah Allah Tuhanmu dan Tuhan bagi manusia seluruhnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan rububiyyah-Nya (pengaturan-Nya terhadap alam semesta) dan uluhiyyah-Nya (keberhakan-Nya untuk disembah). Di tempat dan di saat itulah Musa ‘alaihis salam diangkat menjadi rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 30",
    "description": "Setelah berpesan kepada keluarganya, berangkatlah nabi musa. Maka ketika dia sampai ke tempat yang dilihatnya sebagai sumber api itu, dia diseru dari arah pinggir sebelah kanan lembah, dari sebatang pohon yang tumbuh di sebidang tanah yang diberkahi. Panggilan itu adalah, 'wahai musa! sungguh, aku yang engkau dengar memanggilmu ini adalah Allah, tidak ada yang patut disembah selain aku, tuhan pencipta, pemelihara dan pengawas seluruh alam!. 31. Dan lemparkanlah tongkatmu supaya kamu dapat melihat sekelumit hikmah dan kekuasaan-ku. ' maka ia pun segera melemparkannya dan kemudian Allah mengubah tongkat tersebut menjadi seekor ular. Ketika dia musa melihat tongkatnya bergerak-gerak seakan-akan seekor ular kecil yang gesit padahal dia seekor ular besar, dia terkejut, takut dan lari berbalik arah ke belakang tanpa menoleh. Lalu ia mendengar Allah berfirman, 'wahai musa! kemarilah dan jangan takut melihat ular itu. Singkirkanlah rasa takut yang sedang menguasai jiwamu dan tenanglah karena sesungguhnya engkau termasuk orang yang aman dari segala sesuatu yang membahayakan. Setiap rasul yang merupakan utusan Allah tidak akan merasa takut selama dia berada di sisi-Nya. Bahkan, siapa pun yang mendekatkan diri kepada Allah ia pasti akan merasa aman dan tenteram."
  }
]