[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "30-31. Maka tatkala Musa mendatangi api itu, Allah menyerunya dari pinggir lembah sebelah kanan Musa, di tempat yang di berkahi, dari sisi sebuah pohon, “Wahai Musa, sesungguhnya Aku adalah Allah, Tuhan Penguasa alam semesta. Dan lemparkanlah tongkatmu.” Lalu Musa melemparkannya, maka tongkat itu berubah menjadi seekor ular yang bergerak-gerak cepat. Ketika Musa melihatnya bergerak-gerak seakan-akan dari bangsa ular, ia berbalik lalu menjauh darinya, dan ia tidak menoleh ke belakang karena rasa takut. Maka Tuhannya memangilnya, “Wahai Musa kembalilah kamu kepadaKu, dan jangan takut. Sesungguhnya kamu itu termasuk orang-orang yang aman dari segala hal yang buruk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Lemparkan tongkatmu!” Maka Musa melemparkan tongkatnya karena patuh pada perintah Rabbnya. Tatkala ia melihatnya bergerak dan menggeliat seperti ular gesitnya, Musa berbalik lari karena takut kepadanya dan tidak kembali dari larinya, maka Rabbnya memanggilnya, “Wahai Musa! Menghadaplah dan jangan takut kepadanya! Sesungguhnya engkau termasuk orang yang aman darinya dan dari hal lain yang engkau takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Hai Musa, lemparlah tongkat yang ada di tanganmu.” Musa melaksanakan perintah Tuhannya itu, dan berubahlah tongkat itu menjadi ular yang bergerak. Ketika gerakan ular yang besar itu semakin cepat, Musa merasa takut sehingga dia berlari menjauh tanpa menoleh ke belakang. Maka Tuhannya berfirman: “Hai Musa, mendekatlah dan janganlah kamu takut, karena kamu aman dari segala bahaya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. وَأَنْ أَلْقِ عَصَاكَ ۖ (dan lemparkanlah tongkatmu) Yakni Allah memfirmankan kalimat ini kepadanya ketika itu. Dan Kalimat ini dan setelahnya telah disebutkan tafsirnya pada surat Taha dan an-Naml. Maka Musa melempar tongkat itu maka berubah menjadi ular yang bergerak lincah. فَلَمَّا رَءَاهَا تَهْتَزُّ كَأَنَّهَا جَآنٌّ(Maka tatkala (tongkat itu menjadi ular dan) Musa melihatnya bergerak-gerak seolah-olah dia seekor ular yang gesit) Makna (الجان) adalah jenis ular yang berwarna putih. Yakni tongkat itu berubah seperti ular putih yang bergerak cepat hampir dengan seluruh tubuhnya. وَلَّىٰ مُدْبِرًا(larilah ia berbalik ke belakang) Yakni mundur. وَلَمْ يُعَقِّبْ ۚ( tanpa menoleh) Yakni tidak kembali maju. يٰمُوسَىٰٓ أَقْبِلْ وَلَا تَخَفْ ۖ إِنَّكَ مِنَ الْاٰمِنِينَ((Kemudian Musa diseru): “Hai Musa datanglah kepada-Ku dan janganlah kamu takut. Sesungguhnya kamu termasuk orang-orang yang aman) Kalimat ini telah disebutkan tafsirnya dengan jelas sebelumnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Allah berfirman kepada nabi Musa di tempat itu: “Lemparkanlah tongkatmu!” Maka dilempar dan tongkatnya menjadi ular. Musa melihatnya bergerak-gerak seolah-olah dia seekor ular yang gesit, kemudian karena takut ia lari berbalik ke belakang tanpa menoleh. Kemudian Musa diseru: \"Hai Musa kembalilah pada tempatmu, janganlah kamu takut pada ular ini. Sesungguhnya kamu termasuk orang-orang yang aman.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lemparkanlah tongkatmu” Lalu ketika dia melihatnya bergerak-gerak seperti seekor ular yang gesit, dia lari berbalik ke belakang tanpa menoleh. \"Wahai Musa, kemarilah dan jangan takut. Sesungguhnya kamu termasuk orang-orang yang aman"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. “Dan lemparkanlah tongkatmu,” lalu Musa melemparkannya. “Maka tatkala dia melihatnya bergerak-gerak” berusaha keras bergerak. Dan ia memiliki bentuk yang menakutkan “seolah-olah dia seekor ular,” yang sangat besar, “larilah dia ke belakang tanpa menoleh,. Maksudnya, Musa lari karena hatinya dikuasai rasa takut. Lalu Allah berkata kepadanya, “Hai Musa, datanglah kepadaKU dan jangalah kamu takut. Sesunggunya kamu termasuk orang-orang yang aman.” Ini adalah cara pengembalian rasa aman yang paling baik dan menghilangkan rasa takut. Sebab FirmanNya, “datanglah,” menunjukkan perintah mengharuskan ia datang dan mewajibkan dia taat. Akan tetapi, karena bisa jadi kedatangannya masih diselimuti rasa takut, maka dikatakan kepadanya, “dan jangan kamu takut,” suatu perintah kepadanya akan dua hal, yaitu datang, dan hendaknya dalam hatinya tidak ada rasa takut. Akan tetapi ada kemungkinan lain, yaitu bisa jadi dia datang dalm keadaan tidak ada rasa takut, akan tetapi dia tidak memperoleh penjagaan dari rasa aman dari hal yang tidak diinginkan, maka dari itu dikatakan, “Sesungguhnya kamu termasuk orang-orang yang aman.” Maka semenjak itu hilanglah yang dikhawatirkan dari segala sisi. Maka Musa datang tanpa ada rasa takut dan tidak pula tertakut-taluti, melainkan dia tenang dan merasa yakin dengan berita dari Rabbnya. Imannya telah bertambah dan keyakinanya menjadi sempurna. Ini adalah salah satu ayat (mukjizat) yang diperlihatkan oleh Allah kepadanya sebelum dia pergi kepada Fir’aun, agar benar-benar berada dalam keyakinan yang prima, supaya dia lebih berani menghadapinya, lebih kuat dan lebih teguh."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 31: Kemudian Allah memintanya untuk berjalan mendekati tongkat untuk percobaan sebagai mukjizat yang akan dia tampilkan kepada fir’aun dan kaumnya serta bani israil sebagai ketetapan dari kenabian dan bahwasanya ia adalah utusan Allah. Maka ketika Musa melihat tongkat yang bergerak-gerak (seperti ular), ia lari ketakutan tanpa menoleh ke arahnya. Maka Allah menyerunya : Tenanglah, tetaplah engkau ditempat dan janganlah takut karena ular (dari tongkat tersebut) dijaga oleh Allah, dan sungguh Allah adalah sebaik-baik penjaga dari tongkat dan selain darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ular jantan yang besar. Maka Nabi Musa ‘alaihis salam menghadap dengan tidak takut, bahkan merasa tenteram dan percaya dengan berita Tuhannya. Imannya bertambah dan keyakinannya sempurna. Mukjizat ini Allah perlihatkan sebelum Beliau berangkat menghadap Fir’aun agar Beliau berada di atas keyakinan yang sempurna sehingga Beliau lebih berani dan lebih kuat. Selanjutnya Allah Subhaanahu wa Ta'aala memperlihatkan mukjizat yang lain."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 31",
    "description": "Dan lemparkanlah tongkatmu supaya kamu dapat melihat sekelumit hikmah dan kekuasaan-ku. ' maka ia pun segera melemparkannya dan kemudian Allah mengubah tongkat tersebut menjadi seekor ular. Ketika dia musa melihat tongkatnya bergerak-gerak seakan-akan seekor ular kecil yang gesit padahal dia seekor ular besar, dia terkejut, takut dan lari berbalik arah ke belakang tanpa menoleh. Lalu ia mendengar Allah berfirman, 'wahai musa! kemarilah dan jangan takut melihat ular itu. Singkirkanlah rasa takut yang sedang menguasai jiwamu dan tenanglah karena sesungguhnya engkau termasuk orang yang aman dari segala sesuatu yang membahayakan. Setiap rasul yang merupakan utusan Allah tidak akan merasa takut selama dia berada di sisi-Nya. Bahkan, siapa pun yang mendekatkan diri kepada Allah ia pasti akan merasa aman dan tenteram. 32. Masukkanlah tanganmu ke dalam celah terbuka yang terdapat pada leher bajumu, niscaya dia akan keluar putih bercahaya tanpa cacat atau bukan karena penyakit, dan dekapkanlah kedua tanganmu ke dadamu apabila ketakutan agar hilang rasa takut dan kembali tenang. Jangan panik ketika kamu menyaksikan tongkat itu berubah menjadi ular atau saat tanganmu berubah putih berkilau. Tongkat yang dapat berubah menjadi ular dan tangan yang bersinar itulah dua mukjizat dari tuhanmu yang akan engkau pertunjukkan kepada fir'aun dan para pembesarnya. Sungguh, mereka adalah orang-orang fasik, yang keluar dari ketaatan kepada Allah. '"
  }
]