[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Masukkanlah tanganmu ke dalam lubang bajumu yang terbuka sampai kebagian dada dan keluarkanlah, niscaya akan keluar dalam keadaan putih seperti salju tanpa ada penyakit atau kusta. Dan dekapkanlah tanganmu ke dada agar kamu merasa aman dari rasa takut. Dua hal ini yang Aku perlihatkan kepadamu, wahai Musa, berupa berubahnya tongkat menjadi ular dan tanganmu menjadi putih bersinar tanpa ada penyakit atau kusta, merupakan dua mukjizat dari Tuhanmu ke hadapan Fir’aun dan para pembesar kaumnya. Sesungguhnya fir’aun dan pembesar-pembesarnya adalah orang-orang yang kafir."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Masukkan tangan kananmu ke dalam lengan bajumu dekat leher, niscaya tangan itu akan keluar putih bukan karena penyakit.” Maka Musa memasukkan tangannya, lalu keluarlah putih seperti salju. “Dan dekaplah tanganmu ke dadamu untuk menenangkan rasa ketakutanmu.” Maka Musa mendekapkan tangan ke dadanya, lalu hilanglah rasa takut darinya. “Kedua tanda ini, yaitu tongkat dan tangan, adalah dua mukjizat yang dikirimkan dari Rabbmu untuk menghadapi Fir'aun dan para pembesar kaumnya. Sungguh mereka adalah kaum yang menyimpang dari ketaatan kepada Allah dengan kekufuran dan perbuatan maksiat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Hai Musa, masukkanlah tanganmu ke dalam lubang bajumu hingga ke dada, kemudian keluarkanlah kembali; niscaya kamu akan melihat tanganmu berwarna putih namun bukan karena penyakit atau hal yang buruk lainnya.” Kemudian Allah memintanya untuk tidak takut terhadap perkara risalah dan mukjizatnya, dan agar dia meneguhkan diri. Dan Allah berfirman kepadanya: “Hai Musa, Aku telah menunjukkan kepadamu dua mukjizat yang besar untuk ditampakkan di depan orang-orang yang kafir, yaitu Fir’aun dan para pengikutnya; akan tetapi mereka berpaling dari jalan yang benar.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. اسْلُكْ يَدَكَ فِى جَيْبِكَ (Masukkanlah tanganmu ke leher bajumu) Yakni masukkanlah tanganmu dari lubang bajumu. Dan dalam ayat lain disebutkan: اضمم يدك إلى جناحك, yakni masukkanlah ke bawah lenganmu, agar keluar dalam keadaan berwarna putih namun bukan karena penyakit. Dan sebagaimana disebutkan dalam hadits yang diriwayatkan Imam Bukhari bahwa Musa memiliki kulit yang berwarna kecoklatan. وَاضْمُمْ إِلَيْكَ جَنَاحَكَ (dan dekapkanlah kedua tanganmu (ke dada)mu) Yakni dekapkan kedua tanganmu untuk berlindung dari ular. مِنَ الرَّهْبِ ۖ( bila ketakutan) Yakni karena rasa takut. فَذٰنِكَ(maka yang demikian itu) Isyarat ini ditujukan pada tongkat dan tangan Musa. بُرْهٰنَانِ مِن رَّبِّكَ إِلَىٰ فِرْعَوْنَ وَمَلَإِي۟هِۦٓ ۚ( adalah dua mukjizat dari Tuhanmu (yang akan kamu hadapkan kepada Fir’aun dan pembesar-pembesarnya)) Yakni bukti yang jelas dan dalil yang kuat. إِنَّهُمْ كَانُوا۟ قَوْمًا فٰسِقِينَ (Sesungguhnya mereka adalah orang-orang yang fasik”) Yakni orang-orang yang tidak taat kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. “Masukkanlah tanganmu ke leher bajumu, niscaya ia keluar cahaya putih yang tidak bercacat, bukan karena penyakit. Pada keterangan Bukhari dijelaskan bahwa nabi Musa berkulit coklat. Kemudian dekapkanlah kedua tanganmu ke dadamu bila kamu takut untuk menenangkanmu, maka yang demikian itu adalah dua mukjizat dari Tuhanmu yang akan kamu tunjukkan kepada Fir´aun dan pembesar-pembesarnya. Sesungguhnya mereka adalah orang-orang yang fasik dan membangkang untuk taat kepada Allah dan batasan-batasan-Nya\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Masukkanlah} masukkanlah {tanganmu ke leher bajumu, tangan itu akan keluar dengan keadaan putih bukan karena cacat. Dekapkanlah kedua tanganmu} tanganmu {jika kamu takut} jika kamu ingin terhindar dari rasa takut {Hal itu} dua hal itu, yaitu tongkat dan tangan yang menjadi putih {dua mukjizat} dua dalil {dari Tuhanmu kepada Firʻaun dan para pembesarnya. Sesungguhnya mereka adalah kaum yang fasik”} tidak mau taat kepada Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Kemudian Dia memperlihatkan kepadanya mukjizat yang lain, seraya berfirman, “Susupkanlah tanganmu.” Maksudnya, masukkanlah tanganmu, “ke leher bajumu, niscaya ia keluar putih tidak bercacat, bukan karena penyakit,” maka dia pun memasukkannya lalu mengeluarkannya sebagaimana disebutkan oleh Allah, “dan dekapkanlah ke dua tanganmu (ke dadamu) disebabkan ketakutan.” Maksudnya, dekapkanlah lengan tangamu ke dada agar hilang darimu rasa takut dan khawatir, “maka yang demikian itu,” yakni berubahnya tongkat menjadi ular dan keluarnya tangan menjadi putih bersinar bukan karena penyakit, “adalah dua mukjizat dari Rabbmu” maksudnya, dua hujjah yang pasti dari Allah, “kepada Fir’aun dan pembesar-pembesarnya. Sesungguhnya mereka adalah orang-orang yang fasik.” Jadi tidak cukup bagi mereka hanya sekedar pemberian peringatan dan perintah Rasul kepada mereka, melainkan harus ada mukjizat yang luar biasa jika bermanfaat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 32: Kemudian Allah memerintahkan tangan Musa ke dalam saku bajunya, maka ia akan mendapati tangannya dalam keadaan putih yang bukan sebagai penyakit seperti penyakit lepra atau yang semisalnya. Maka jika engkau takut wahai Musa maka dekaplah lenganmu satu sama lain, maka akan hilang ketakutan darimu, tenang dan tumakninahketka engkau lepaskan kembali tangan (lenganmu). Maka keduanya itu (tongkat dan putihnya tangan) sebagai hujjah yang nyata dan bukti yang nampak dan sebagai dua mukjizat yang di luar nalar sebagai bukti kenabianmu dan kerasulanmu, Kami berikan keduanya sebagai bukti atas benarnya dakwahmu kepada fir’aun dan mulianya kaummu dalam beriman kepada Allah dan mereka akan mengikuti perintahmu, karena mereka adalah kaummu yang telah keluar (kafir) dari ketaatan kepada Allah dan iman kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, meletakkan tangan ke dada leher baju. Maksudnya, karena Musa merasa takut, Allah memerintahkan untuk mendekapkan tangan ke dadanya agar rasa takut itu hilang, yang kemudian keadaannya akan kembali seperti biasanya. Karena mereka adalah orang-orang yang fasik, maka tidak cukup diperingatkan, bahkan harus ditunjukkan mukjizat kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 32",
    "description": "Masukkanlah tanganmu ke dalam celah terbuka yang terdapat pada leher bajumu, niscaya dia akan keluar putih bercahaya tanpa cacat atau bukan karena penyakit, dan dekapkanlah kedua tanganmu ke dadamu apabila ketakutan agar hilang rasa takut dan kembali tenang. Jangan panik ketika kamu menyaksikan tongkat itu berubah menjadi ular atau saat tanganmu berubah putih berkilau. Tongkat yang dapat berubah menjadi ular dan tangan yang bersinar itulah dua mukjizat dari tuhanmu yang akan engkau pertunjukkan kepada fir'aun dan para pembesarnya. Sungguh, mereka adalah orang-orang fasik, yang keluar dari ketaatan kepada Allah. ' 33. Masih dalam keadaan takut dan sambil memohon pertolongan Allah, dia musa berkata mengingat kesalahan yang pernah dilaku-kannya, 'ya tuhan pemelihara-ku, sungguh aku ketika berada di mesir sekian tahun yang lalu telah membunuh tanpa sengaja seorang dari golongan mereka, yakni penduduk negeri mesir, sehingga aku takut mereka akan membunuhku sebagai tindak balasan. Kalau mereka membunuhku maka aku tidak bisa menyampaikan risalah-Mu."
  }
]