[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-34. Musa berkata, “Wahai Tuhanku, sesungguhnya aku telah membunuh seseorang dari kaum Fir’aun. Dan aku takut mereka akan membunuhku. Dan saudaraku, Harun, lebih fasih tutur katanya daripadaku, maka utuslah dia berasamaku menjadi pendukung yang membenarku dan menggantikanku untuk menjelaskan kepada mereka. Sesungguhnya aku takut mereka akan mendustakan aku terkait ucapanku kepada mereka, ‘Sesungguhnya aku adalah seorang rasul yang di utus kepada mereka’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Musa berkata untuk mengadu kepada Rabbnya, “Sesungguhnya aku telah membunuh nyawa seorang dari golongan mereka maka aku takut mereka akan membunuhku disebabkan hal itu jika aku mendatangi mereka untuk menyampaikan risalah yang dengannya Engkau utus diriku kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33-34. Musa bukannya hendak berlepas diri dari tanggungjawab dakwah yang ditugaskan Tuhannya, akan tetapi dia ingin mendapat hal-hal yang dapat membantunya dalam menjalankan tugasnya dan melewati segala rintangan yang akan menghalangi dakwahnya. Oleh sebab itu Musa menyampaikan kepada Tuhannya Yang Maha Mengetahui bahwa dia meninggalkan kerajaan Fir’aun karena takut dari kezalimannya dan penindasan para tentaranya, sebab dia telah membunuh seseorang dari mereka dan berita tentang peristiwa ini telah tersebar ke seluruh penjuru negeri, jika mereka melihatnya pasti mereka akan membunuhnya sebagai balasan atas pembunuhan yang dia lakukan secara tidak sengaja. Dan Musa meminta agar Allah menguatkannya dengan saudaranya, Harun, dengan berkata: “Dia lebih jelas dalam mengemukakan bukti, dan aku berharap dia dapat membantuku menjelaskan bukti-bukti dari kami, agar bukti-bukti itu sampai kepada Fir’aun dan bala tentaranya dengan terpercaya, karena aku takut mereka akan segera mendustakanku.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. قَالَ رَبِّ إِنِّى قَتَلْتُ مِنْهُمْ نَفْسًا (Musa berkata: “Ya Tuhanku sesungguhnya aku, telah membunuh seorang manusia dari golongan mereka) Yakni orang Mesir yang ia pukul sampai meninggal dunia. فَأَخَافُ أَن يَقْتُلُونِ(maka aku takut mereka akan membunuhku) Yakni aku takut mereka akan menuntut balas dariku kemudian membunuhku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Musa berkata: \"Ya Tuhanku sesungguhnya aku, telah membunuh seorang manusia dari golongan mereka, dia adalah Alqabthi, maka aku takut mereka akan membunuhku.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata,“Ya Tuhanku, sesungguhnya aku telah membunuh seseorang dari mereka sehingga aku takut mereka akan membunuhku"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. Maka “berkata” Musa untuk mengemukakan alasan kepada Rabbnya dan memohon pertolongan atas apa yang dibebankan kepadanya serta mengingat akan adanya segala rintangan-rintangan yang di hadapinya agar Dia menghapus semua yang dia cemaskan, “Ya Rabbku, sesungguhnya aku telah membunuh seorang manusia dari golongan mereka,” maksudnya, “maka aku takut mereka akan membunuhku. Dan saudaraku Harun, dia lebih fasih lidahnya daripadaku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkanku,” yakni sebagai penolong dan pendukungku yang membenarkan, karena sesungghnya kebenaran itu akan menjadi lebih kuat bila disertai dengan banyaknya informasi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 33: Maka Musa membawa kerisalahan, maka ia mengadukan permasalahannya kepada Allah dengan berkata : Wahai Tuhanku dahulu aku pernah membunuh dari mereka (kaumku) yang melakukan kesalahan, sungguh aku takut pergi menuju mereka karena mereka akan mendebat dan membunuhku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni meminta uzur, dan meminta bantuan-Nya dalam tugas yang dipikulnya sambil menyebutkan penghalangnya agar Tuhannya menghilangkan apa yang dia khawatirkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 33",
    "description": "Masih dalam keadaan takut dan sambil memohon pertolongan Allah, dia musa berkata mengingat kesalahan yang pernah dilaku-kannya, 'ya tuhan pemelihara-ku, sungguh aku ketika berada di mesir sekian tahun yang lalu telah membunuh tanpa sengaja seorang dari golongan mereka, yakni penduduk negeri mesir, sehingga aku takut mereka akan membunuhku sebagai tindak balasan. Kalau mereka membunuhku maka aku tidak bisa menyampaikan risalah-Mu. 34. Karena itu, lindungilah aku dan mantapkanlah hatiku karena tiada perlindungan kecuali dari-Mu, dan sebagaimana engkau ketahui ada ikatan yang membelenggu lidahku, sedangkan saudaraku, harun, dia lebih fasih lidahnya dan lebih lancar bicaranya daripada aku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan perkataan-ku dalam menyampaikan pesan-pesan suci dari-Mu; sungguh, aku takut mereka, fir`aun dan kaumnya, akan mendustakanku. '."
  }
]