[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "33-34. Musa berkata, “Wahai Tuhanku, sesungguhnya aku telah membunuh seseorang dari kaum Fir’aun. Dan aku takut mereka akan membunuhku. Dan saudaraku, Harun, lebih fasih tutur katanya daripadaku, maka utuslah dia berasamaku menjadi pendukung yang membenarku dan menggantikanku untuk menjelaskan kepada mereka. Sesungguhnya aku takut mereka akan mendustakan aku terkait ucapanku kepada mereka, ‘Sesungguhnya aku adalah seorang rasul yang di utus kepada mereka’.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Dan saudaraku, Harun, dia lebih jelas dari diriku dalam berbicara, maka utuslah dia bersamaku untuk membantuku apabila Fir'aun dan kaumnya mendustakanku. Sesungguhnya aku khawatir mereka akan mendustakanku sebagaimana kebiasaan umat-umat terdahulu terhadap para Rasul mereka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. وَأَخِى هٰرُونُ هُوَ أَفْصَحُ مِنِّى لِسَانًا (Dan saudaraku Harun dia lebih fasih lidahnya daripadaku) Sebab lidah Musa memiliki kesusahan untuk berbicara. فَأَرْسِلْهُ مَعِىَ رِدْءًا يُصَدِّقُنِىٓ ۖ( maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku) Makna (الردء) adalah penolong. Musa memberi syafaat bagi Harun saudaranya, agar menjadi Rasul sepertinya untuk membantunya dalam menjalankan tugas kerasulan. إِنِّىٓ أَخَافُ أَن يُكَذِّبُونِ(sesungguhnya aku khawatir mereka akan mendustakanku”) Jika Harun tidak bersamaku, sebab lidahku tidak fasih berbicara."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Dan saudaraku Harun dia lebih fasih lidahnya daripada aku, maka utuslah dia bersamaku sebagai pembantuku dalam menyampaikan risalah, dan membenarkan apa yang aku sampaikan, serta menetapkan hujjah dan menunjukkan dalil. Sesungguhnya aku khawatir mereka akan mendustakanku\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun saudaraku Harun, dia lebih fasih} lebih jelas {lidahnya daripada aku. Maka utuslah dia bersamaku sebagai pembantu} pendukungku {untuk membenarkan (perkataan)ku. Sesungguhnya aku takut mereka akan mendustakanku”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33-34. Maka “berkata” Musa untuk mengemukakan alasan kepada Rabbnya dan memohon pertolongan atas apa yang dibebankan kepadanya serta mengingat akan adanya segala rintangan-rintangan yang di hadapinya agar Dia menghapus semua yang dia cemaskan, “Ya Rabbku, sesungguhnya aku telah membunuh seorang manusia dari golongan mereka,” maksudnya, “maka aku takut mereka akan membunuhku. Dan saudaraku Harun, dia lebih fasih lidahnya daripadaku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkanku,” yakni sebagai penolong dan pendukungku yang membenarkan, karena sesungghnya kebenaran itu akan menjadi lebih kuat bila disertai dengan banyaknya informasi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 34: Kemudian ia berkata : Wahai Tuhanku, ini adalah saudaraku yang bernama Harun yang keadaannya lebih fasih (lisannya) daripadaku, dan lebih jelas ucapannya daripada diriku, maka aku utus ia untuk bersamaku(untuk) membantu dan membenarkanku, sungguh aku takut mereka semua mendustakanku."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Nabi Musa ‘alaihis salam selain merasa takut kepada Fir'aun juga merasa dirinya kurang lancar berbicara menghadapi Fir'aun. Maka Beliau memohon kepada Allah agar dia mengutus Harun ‘alaihis salam bersamanya, yang lebih fasih lidahnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 34",
    "description": "Karena itu, lindungilah aku dan mantapkanlah hatiku karena tiada perlindungan kecuali dari-Mu, dan sebagaimana engkau ketahui ada ikatan yang membelenggu lidahku, sedangkan saudaraku, harun, dia lebih fasih lidahnya dan lebih lancar bicaranya daripada aku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan perkataan-ku dalam menyampaikan pesan-pesan suci dari-Mu; sungguh, aku takut mereka, fir`aun dan kaumnya, akan mendustakanku. '35. Sebagai pernyataan dikabulkannya permohonan nabi musa dan untuk menenangkan hatinya, dia Allah berfirman, 'kami akan menguatkan engkau, yakni membantumu dengan mengutus pula saudaramu, nabi harun, yang akan bertugas membantu dan memperjelas argumentasimu sesuai permintaanmu, dan selain itu kami berikan kepadamu berdua kekuasaan yang besar berupa kekuatan dan dukungan dengan berbagai mukjizat, maka mereka tidak akan dapat mencapaimu dengan menyakitimu dan mengalahkanmu. Karena itu, berangkatlah kamu berdua melaksanakan tugas dengan membawa mukjizat yang bersumber dari kami. Yakinlah bahwa dengan izin Allah pada akhirnya kamu berdua dan orang yang mengikuti kamu yang akan menang atas orang-orang kafir itu. '."
  }
]