[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada Musa, “Kami akan menguatkan kamu dengan saudaramu dan Kami menjadikan bagi kalian kekuatan hujjah atas Fir’aun dan kaumnya. Maka mereka tidak dapat mencapai kalian berdua dengan melancarkan keburukan. Kalian berdua (wahai Musa dan Harun) dan orang-orang yang beriman kepada kalian berdua adalah orang-orang yang menang atas Fir’aun dan kaumnya, disebabkan mukjizat-mukjizat yang Kami berikan dan kandungannya yang menunjukkan kepada kebenaran.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Allah berfirman sebagai jawaban atas seruan Musa, “Aku akan menguatkanmu -wahai Musa- dengan mengutus saudaramu bersamamu sebagai Rasul yang akan membantumu, dan Kami akan berikan hujah dan dukungan bagi kalian berdua atas musuh-musuh kalian, maka mereka tidak akan mampu menimpakan keburukan yang kalian benci. Dengan mukjizat dari Kami, kalian berdua dan orang-orang yang mengikuti kalian dari kalangan orang-orang yang beriman akan menang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Allah mengabulkan permintaan Musa, dan menjamin akan menguatkannya dengan saudaranya, Harun, serta akan menyertai mereka berdua dengan hujjah-hujjah yang kuat yang dapat merasuk ke dalam hati orang yang mendengar mereka berdua, sehingga mereka tidak akan berlaku buruk kepada mereka berdua. Kemudian Allah memberi kabar gembira bahwa kelompok orang-orang beriman yang terdiri dari Musa, Harun dan para pengikutnya akan mendapat kemenangan berkat mukjizat-mukjizat yang jelas yang mereka miliki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. قَالَ سَنَشُدُّ عَضُدَكَ بِأَخِيكَ (Allah berfirman: “Kami akan membantumu dengan saudaramu) Allah mengabulkan permintaannya dan menjadikan Harus sebagai Rasul dan menguatkan Musa dengan Harun. وَنَجْعَلُ لَكُمَا سُلْطٰنًا(dan Kami berikan kepadamu berdua kekuasaan yang besar) Yakni bukti dan hujjah, atau kekuatan untuk melawan Fir’aun dan kaumnya. فَلَا يَصِلُونَ إِلَيْكُمَا ۚ(maka mereka tidak dapat mencapaimu) Untuk menyakiti kalian berdua, dan kekuatan mereka tidak akan mampu mengalahkan kalian. بِـَٔايٰتِنَآ(dengan membawa mukjizat Kami) Yakni kalian dapat melawan mereka dengan mukjizat-mukjizat Kami. Atau pergilah kalian berdua dengan membawa mukjizat-mukjizat Kami. أَنتُمَا وَمَنِ اتَّبَعَكُمَا الْغٰلِبُونَ (kamu berdua dan orang yang mengikuti kamulah yang akan menang) Ini merupakan kabar gembira bagi mereka berdua dan penguat hati mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Allah berfirman menjawab doa nabi Musa: \"Kami akan membantumu dengan mengutus saudaramu sebagai rasul. Kami akan berikan kepada kalian berdua sebagai hujjah dan bukti yang akan menaklukkan kaum Fir’aun. Sehingga mereka tidak dapat mengunggulimu atau menyakitimu. Maka berangkatlah kamu berdua dengan membawa mukjizat Kami, kamu berdua dan orang yang mengikuti kamulah yang akan menang. Al’adldu adalah antara siku dan bahu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berfirman,“Kami akan menguatkan dukungan untukmu} Kami akan menguatkan urusanmu dan meneguhkan orang yang di sampingmu {dengan saudaramu dan Kami akan memberikan kepada kalian mukjizat} dalil dan bukti {Sehingga mereka tidak akan dapat mencapai kalian} sehingga tidak ada jalan bagi mereka untuk menyakiti kalian {dengan membawa mukjizat Kami} dengan sebab ayat Kami {Kalian berdua dan orang yang mengikuti kalian adalah orang-orang yang menang”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Lalu Allah mengabulkan permohonannya, seraya berfirman, “Kami akan memperkuatmu dengan saudaramu,” maksudnya, Kami akan menolongmu dan memperkuatmu dengannya. Kemudian Allah menghapuskan darinya rasa takut dibunuh, seraya berfirman, “dan Kami berikan kepadamu berdua kekuasaan yang besar,” yakni : kekuasaan dan kemampuan berdakwah dengan hujjah (argument) dan wibawa ilahiyah terhadap musuh mereka berdua, “maka mereka tidak dapat mencapaimu,” hal ini disebabkan mukjizat-mukjizat Kami dan kebenaran yang dibuktikannya serta rasa takut yang ditimbulkannya terhadap orang yang langsung melihatnya. Dengannyalah kalian berdua akan memperoleh kekuasaan, dan dengannya pula tipu daya musuh kalian akan tertolak, dan mukjizat itu bagi kalian menjadi lebih kuat daripada bala tentara yang berjumlah besar dan berperlengkapan lengkap, “kamu berdua dan orang yang mengikuti kamulah yang menang.” Ini adalah janji kepada Musa pada saat itu, sedangkan dia saat itu sendirian. Ia pun benar-benar kembali ke negerinya setelah sekian lama buron. Keadaan pun terus berkembang dan permasalahan-permasalahan terus silih berganti hingga apa yang dijanjikan kepadanya benar-benar dilaksanakan. Dan Allah memberikan kepadanya kekuasaan terhadap manusia dan negeri, ia dan para pengikutnya akhirnya meraih kemenangan dan kesuksesan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 35: Maka Allah kabulkan permintaan Musa dan berkata kepadanya : Kami akan teguhkan engkau dan saudaramu wahai Musa yang telah kami karuniakan kenabian kepadanya (Harun) sesuai permohonanmu, dan Kami akan berikan kepada kalian berdua kemulian. Berkata Ja’far : Ketakutan pada hati musuh dan kecintaan pada hati wali-wali-Nya; Maka tidak akan menimpa kepadamu penjara atau adzab, dan kalian akan mengalahkan dan mendapatkan pertolongan dengan izin Allah dengan sebab tanda-tanda kuasa Kami dan apa yang menunjukkan atas kebenaran. Dan atas hal ini terdapat kabar gembira dan keteguhan bagi keduanya (Musa dan Harun)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa mampu berdakwah dengan hujjah dan mendapatkan kewibawaan dari Allah sehingga merasa terhormat di hadapan musuh mereka. Yang demikian disebabkan ayat-ayat Allah (mukjizat yang diberikan-Nya), dan karena ayat-ayat itu menunjukkan kebenaran serta membuat takjub orang yang melihatnya, sehingga mereka berdua (Musa dan Harun) memiliki kekuasaan dan terhindar dari tipu daya musuh, bahkan mereka seperti memiliki bala tentara dengan jumlah yang banyak dan perlengkapan yang kuat sehingga tidak takut berhadapan dengan Fira’un yang kejam dan memiliki banyak pasukan. Inilah janji Allah untuk Musa dan Harun di waktu itu, padahal mereka hanya berdua, pulang ke kampung halamannya setelah pergi darinya. Keadaan pun berubah sehingga akhirnya sempurnalah janji Allah dan Beliau beserta pengikutnya memperoleh kemenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 35",
    "description": "Sebagai pernyataan dikabulkannya permohonan nabi musa dan untuk menenangkan hatinya, dia Allah berfirman, 'kami akan menguatkan engkau, yakni membantumu dengan mengutus pula saudaramu, nabi harun, yang akan bertugas membantu dan memperjelas argumentasimu sesuai permintaanmu, dan selain itu kami berikan kepadamu berdua kekuasaan yang besar berupa kekuatan dan dukungan dengan berbagai mukjizat, maka mereka tidak akan dapat mencapaimu dengan menyakitimu dan mengalahkanmu. Karena itu, berangkatlah kamu berdua melaksanakan tugas dengan membawa mukjizat yang bersumber dari kami. Yakinlah bahwa dengan izin Allah pada akhirnya kamu berdua dan orang yang mengikuti kamu yang akan menang atas orang-orang kafir itu. '36. Setelah mendapat wahyu, nabi musa bersama keluarga kembali ke mesir dan bersama nabi harun berangkatlah mereka berdua menghadapi fir`aun dan kaumnya. Maka ketika musa datang kepada mereka, fir'aun dan pengikutnya, dengan membawa misi kenabian yang diperkuat dengan mukjizat yang bersumber dari kami yang sangat nyata kebenarannya, mereka mengingkari apa yang mereka saksikan seraya berkata, 'ini tidak lain hanyalah sihir yang dibuat-buat, yakni ilusi yang memperdayai dan mengelabui mata kita, dan dia sebenarnya hanya mengada-ngada dengan menyatakan bahwa itu bersumber dari tuhan semesta alam, dan di samping itu kami tidak pernah mendengar ajaran yang seperti ini pada nenek moyang kami dahulu hingga kini, sehingga kami tidak dapat membenarkan dan mengikuti apa yang disampaikannya itu. '"
  }
]