[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Ketika Musa mendatangi Fir’aun dan menyodorkan kepadanya seluruh dalil dan hujjah Kami yang menjadi saksi akan kebenaran risalah yang dibawa Musa dari sisi Tuhannya, mereka berkata kepada Musa, “Tidaklah yang kamu bawa kepada kami ini kecuali tipuan sihir saja yang kamu buat-buat dengan kebohongan dan kebatilan. Dan kami belum pernah mendengar seruan yang kamu ajak kami kepadanya dari para pendahulu kami yang telah meninggal sebelum kami.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Maka tatkala Musa -'alaihissalām- mendatangi mereka dengan membawa mukjizat-mukjizat Kami yang jelas, mereka berkata, “Ini tidak lain hanyalah kedustaan yang dibuat-buat oleh Musa, kami tidak pernah mendengar hal ini dari bapak-bapak kami yang terdahulu. Seandainya hal itu benar, niscaya kami telah mendengar yang semisal dengannya tentang umat-umat yang terdahulu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Musa dan saudaranya, Harun, memulai dakwahnya kepada Fir’aun dengan berbagai mukjizat yang menegaskan kebenaran mereka berdua, karena jiwa manusia condong kepada pengakuan yang dikuatkan dengan bukti yang luar biasa; akan tetapi Fir’aun dan para pengikutnya menyikapi mukjizat-mukjizat itu dengan penuh keraguan: “Itu hanyalah sihir yang dilakukan dengan mahir, adapun pengakuan mereka adalah perkataan yang pertama kali kami dengar, dan nenek moyang kami tidak pernah mendengarnya sama sekali.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. فَلَمَّا جَآءَهُم مُّوسَىٰ بِـَٔايٰتِنَا بَيِّنٰتٍ قَالُوا۟ مَا هٰذَآ إِلَّا سِحْرٌ مُّفْتَرًى (Maka tatkala Musa datang kepada mereka dengan (membawa) mukjizat-mukjizat Kami yang nyata, mereka berkata: “Ini tidak lain hanyalah sihir yang dibuat-buat) Yakni kebohongan yang kamu buat-buat sendiri. وَمَا سَمِعْنَا بِهٰذَا(dan kami belum pernah mendengar ini) Yakni pengakuan kenabian yang kamu datangkan ini. Atau kami tidak pernah mendengar sihir seperti ini. فِىٓ ءَابَآئِنَا الْأَوَّلِينَ(pada nenek moyang kami dahulu) Yakni tidak pernah terjadi pada zaman nenek moyang kami, padahal peradaban mereka sangat maju, maka jelaslah kalau Musa adalah pembohong."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Maka tatkala Musa datang kepada Fir’aun dan kaumnya dengan membawa bukti-bukti Kami berupa mukjizat-mukjizat untuk menunjukkan kebenaran kenabiannya. Mereka berkata: \"Ini tidak lain hanyalah sihir yang dibuat-buat dan tipuan Musa atas nama Allah. Kami belum pernah mendengar seruan yang seperti ini pada nenek moyang kami dahulu\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Musa mendatangi mereka dengan mukjizat Kami yang nyata} yang jelas {mereka berkata,“Ini tidak lain kecuali sihir yang dibuat-buat} dibuat-buat {dan kami tidak pernah mendengar ini dari nenek moyang kami dahulu”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36. Lalu Musa pergi dengan membawa risalah Tuhannya. “Maka tatkala Musa datang kepada mereka dengan (membawa) mukjizat-mukjizat Kami yang nyata,” yang sangat jelas pembuktiannya terhadap kebenaran apa yang ia katakan kepada mereka, tidak ada kekurangan dan ketidakjelasan di dalamnya, “mereka berkata” secara zhalim, sombong dan keras kepala, “Ini tidak lain hanyalah sihir yang dibuat-buat,” sebagaimana dikatakan oleh Fir’aun dalam kondisi yang mana pada saat itu kebenaran menjadi jelas, mengalahkan kebatilan, kebatilan sirna dan para petinggi yang mengetahui hakikat permasalahan pun tunduk kepadanya: Sesungguhnya ia adalah pemimpinmu yang mengajarkan sihir kepadamu sekalian. (Thaha:71). Demikianlah. Dan Fir’aun adalah seorang yang cerdik yang tidak bermoral, yang telah berbuat makar dan tipu muslihat yang telah mencapai pada tingkat sebagaimana telah dikisahkan oleh Allah kepada kita. Ia sebenarnya telah mengetahui bahwa tidak ada yang bisa menurunkan mukjizat-mukjizat itu selain Rabb Pencipta langit dan bumi, hanya saja kebinasaan telah mengalahkannya . “Dan Kami belum pernah mendengar ini pada nenek moyang kami dahulu.” Mereka benar-benar telah berdusta dalam hal ini. Sebab Allah telah mengangkat Yusuf sebagai rasul sebelum Musa, seperti yang difirmankan Allah, \"Dan sesungguhnya telah datang Yusuf kepadamu dengan membawa keterangan-keterangan, tetapi kamu senantiasa dalam keraguan tentang apa yang dibawanya kepadamu, hingga ketika dia meninggal, kamu berkata: \"Allah tidak akan mengirim seorang (rasul pun) sesudahnya\". Demikianlah Allah menyesatkan orang-orang yang melampaui batas dan ragu-ragu.\" (Ghafir:34)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 36: Maka ketika datang Musa dan (Harun) menuju fir’aun menyampaikan kerisalahannya kepada mereka serta dua tanda-tanda (tongkat dan putihnya tangan) yang menunjukkan atas kebenaran Musa, maka terkuasailah para pembesar beserta fir’aun yang sebenarnya juga mengetahui kebenarannya sebagaimana Allah berfirman : Dan mereka mengingkarinya karena kedzaliman dan kesombongan mereka (QS : An-Naml 14). Maka setelah mereka melihat tanda-tanda ini, mereka berkata kepada Musa dengan angkuh : Tidaklah apa yang engkau datangkan ini wahai Musa kecuali hanyalah sihir yang menipu dan dusta, dan kami tidaklah pernah mendengar seruan semisal ini dari bapak-bapak kami yang terdahulu."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Secara zalim, sombong dan membangkang. Sebagaimana yang dikatakan Fir’aun ketika kebenaran telah jelas dan kebatilan kalah, “Sesungguhnya dia (Musa) adalah pemimpinmu yang mengajarkan kepadamu ilmu sihir.” Fir;aun memang pintar namun tidak bersih sehingga berbuat licik, sampai-sampai melakukan berbagai macam tipu daya seperti yang telah diceritakan Allah kepada kita, padahal dia mengetahui bahwa tidak ada yang mendatangkan mukjizat yang besar itu kecuali Allah Tuhan langit dan bumi, akan tetapi kecelakaan lebih menguasai dirinya, sehingga dia tidak beriman dan malah menentangnya. Ucapan mereka ini dusta, padahal Allah telah mengutus sebelum Musa rasul-Nya Yusuf ‘alaihis salam. Allah Subhaanahu wa Ta'aala berfirman, “Dan sesungguhnya telah datang Yusuf kepadamu dengan membawa keterangan-keterangan, tetapi kamu senantiasa dalam keraguan tentang apa yang dibawanya kepadamu, hingga ketika dia meninggal, kamu berkata, \"Allah tidak akan mengirim seorang (rasul pun) setelahnya. Demikianlah Allah menyesatkan orang-orang yang melampaui batas dan ragu-ragu.” (Terj. Al Mu’min: 34)"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 36",
    "description": "Setelah mendapat wahyu, nabi musa bersama keluarga kembali ke mesir dan bersama nabi harun berangkatlah mereka berdua menghadapi fir`aun dan kaumnya. Maka ketika musa datang kepada mereka, fir'aun dan pengikutnya, dengan membawa misi kenabian yang diperkuat dengan mukjizat yang bersumber dari kami yang sangat nyata kebenarannya, mereka mengingkari apa yang mereka saksikan seraya berkata, 'ini tidak lain hanyalah sihir yang dibuat-buat, yakni ilusi yang memperdayai dan mengelabui mata kita, dan dia sebenarnya hanya mengada-ngada dengan menyatakan bahwa itu bersumber dari tuhan semesta alam, dan di samping itu kami tidak pernah mendengar ajaran yang seperti ini pada nenek moyang kami dahulu hingga kini, sehingga kami tidak dapat membenarkan dan mengikuti apa yang disampaikannya itu. ' 37. Dan sebagai jawaban bagi fir'aun dan kaumnya, dia musa menjawab, 'tuhan pemelihara-ku yang menciptakan aku dan kamu serta memberi aneka bukti kebenaran lebih mengetahui dari aku, kamu dan siapa pun tentang siapa yang pantas membawa petunjuk dari sisi-Nya dan dia-lah yang akan menetapkan dengan adil siapa yang akan mendapat kesudahan yang baik di akhirat. Jangan berlaku zalim, sebab sesungguhnya telah menjadi ketetapan Allah bahwa orang-orang yang zalim selamanya tidak akan mendapat kemenangan. '."
  }
]