[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Musa berkata kepada Fir’aun, “Tuhanku lebih mengetahui daripada kami siapa orang yang berada di atas kebenaran yang datang dengan membawa petunjuk yang lurus dari sisiNya dan orang yang akan memperoleh kesudahan yang terpuji di negeri akhirat. Sesungguhnya orang-orang yang berbuat kezhaliman tidaklah mendapat kemenangan meraih apa yang mereka inginkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Musa berkata menyeru Fir'aun, “Rabbku mengetahui orang yang benar, yang membawa petunjuk dari sisi-Nya, dan mengetahui siapa yang akan mendapatkan balasan yang baik di Akhirat. Sesungguhnya orang-orang yang zalim tidak akan beruntung untuk mendapatkan keinginannya dan tidak akan selamat dari apa yang mereka takuti.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Musa menjawab: “Tuhanku Maha Mengetahui siapa yang mengatakan kebenaran dan yang teguh di atas jalan yang lurus, dan Maha Mengetahui siapa yang akan mendapat kesudahan yang baik di kehidupan akhirat.” Jawaban Musa ini menunjukkan lemahnya hujjah mereka dan buruknya kesudahan yang akan mereka dapatkan. Dan sungguh tidak ada kemenangan bagi orang-orang yang menzalimi diri mereka sendiri dengan menghalangi diri mereka dari memahami kebenaran, dan yang menzalimi orang lain dengan merampas hak-hak mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَقَالَ مُوسَىٰ رَبِّىٓ أَعْلَمُ بِمَن جَآءَ بِالْهُدَىٰ مِنْ عِندِهِۦ (Musa menjawab: “Tuhanku lebih mengetahui orang yang (patut) membawa petunjuk dari sisi-Nya) Yang dimaksud Musa adalah dirinya; dia mengatakannya dengan cara ini agar tidak langsung berterus terang terhadap tujuannya sebelum ia menjelaskan bukti-bukti bagi mereka. وَمَن تَكُونُ لَهُۥ عٰقِبَةُ الدَّارِ ۖ( dan siapa yang akan mendapat kesudahan (yang baik) di negeri akhirat) Yakni Allah lebih mengetahui siapa yang akan memperoleh kemenangan pada akhirnya. إِنَّهُۥ لَا يُفْلِحُ الظّٰلِمُونَ (Sesungguhnya tidaklah akan mendapat kemenangan orang-orang yang zalim”) Yakni tidak dapat meraih hasil yang baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Musa kemudian menjawab: \"Tuhanku lebih mengetahui bahwa aku dalam kebenaran adapun kalian dalam kesalahan. Dia lebih tahu siapa yang patut membawa petunjuk dari sisi-Nya dan siapa yang akan mendapat akhir yang baik di akhirat yaitu surga. Serta siapa yang akan mendapat pertolongan di dunia. Sesungguhnya orang-orang yang zalim tidak akan mendapat kemenangan berupa kebaikan\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata,“Tuhanku lebih mengetahui siapa yang datang dengan petunjuk dari sisiNya dan siapa yang akan mendapat kesudahan di akhirat} kesudahan yang terpuji di akhirat {Sesungguhnya orang-orang zalim itu tidak beruntung”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "37. “Musa menjawab” ketika mereka beranggapan bahwa apa yag dibawanya itu adalah sihir dan kesesatan, dan bahwa apa yang mereka anut itu yang benar, “Rabbku lebih mengetahui orang yang (patut) membawa petunjuk dari sisiNya dan siapa yang akan mendapat kesudahan (yang baik) di akhirat,” maksudnya, apabila pertemuan dengan kalian ini tidak berguna dan begitu pula penampakan ayat-ayat (mukjizat) yang sangat jelas ini, dan kalian bersikap enggan kecuali semakin tenggelam di dalam kesesatan kalian dan bersikukuh pada kekafiran kalian, maka Allah-lah yang mengetahui orang yang mendapat petunjuk dan yang lainnya, serta mengetahui siapa yang mendapat kesudahan terbaik di akhirat: kami atau kalian. “Sesungguhnya orang-orang yang zhalim tidaklah akan mendapat kemenangan.” Maka kesudahan yang baik, kemenangan dan kesuksesan akhirnya diperoleh oleh Musa dan para pengikutnya, sedangkan bagi mereka adalah kerugian dan kesudahan yang sangat buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 37: Kemudian Musa berkata kepada fir’aun : Ketahuilah wahai fir’aun, bahwa Tuhanku maha mengetahui kepada siapa hidayah itu datang dan kebenaran serta mengetahui siapa yang akan mendapatkan kebaikan hidayah dan akhir yang baik di dunia dan akhirat, sungguh telah berjalan sunnah Allah bahwa orang-orang yang dzalim tidak akan pernah selamat atas kedzalimannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka mengatakan, bahwa apa yang dibawa Musa adalah sihir dan kesesatan, dan bahwa apa yang mereka pegang selama ini adalah hak (benar). Ternyata yang memperoleh kemenangan dan kesudahan yang baik adalah Musa ‘alaihis salam dan para pengikutnya. Sedangkan orang-orang yang mendustakan Beliau memperoleh kerugian dan kesudahan yang buruk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 37",
    "description": "Dan sebagai jawaban bagi fir'aun dan kaumnya, dia musa menjawab, 'tuhan pemelihara-ku yang menciptakan aku dan kamu serta memberi aneka bukti kebenaran lebih mengetahui dari aku, kamu dan siapa pun tentang siapa yang pantas membawa petunjuk dari sisi-Nya dan dia-lah yang akan menetapkan dengan adil siapa yang akan mendapat kesudahan yang baik di akhirat. Jangan berlaku zalim, sebab sesungguhnya telah menjadi ketetapan Allah bahwa orang-orang yang zalim selamanya tidak akan mendapat kemenangan. '38. Dan ketika tidak kuasa lagi untuk mendebat nabi musa, karena jelas dan kuatnya argumentasi yang disampaikan, dengan nada me-nyombongkan diri fir'aun berkata, 'wahai para pembesar kaumku! aku tidak mengetahui ada tuhan bagimu selain aku yang patut disembah. Guna mengetahui kebenaran atau kebohongan musa yang menyatakan ada tuhan pemelihara alam raya, maka bakarlah tanah liat untukku wahai haman untuk membuat batu bata dan bahan bangunan lainnya, kemudian buatkanlah segera bangunan dan istana yang tinggi untukku agar aku dapat naik melihat tuhannya musa, dan aku yakin bahwa dia termasuk pendusta dalam dakwaannya. '"
  }
]