[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Fir’aun berkata kepada para pembesar kaumnya, “Wahai para pembesarku, aku tidak mengetahui Tuhan bagi kalian yang berhak disembah selain aku. Nyalakanlah api (wahai Haman) di atas tanah liat agar menjadi kokoh dan buatkanlah bagiku suatu bangunan yang memjulang tinggi, supaya aku dapat melihat Tuhan Musa yang dia sembah dan dia menyeru (manusia) untuk menyembahNya. Dan sesungguhnya aku yakin dia termasuk orang-orang yang berbohong dalam ucapan yang dikatakannya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. Fir'aun berkata menyeru para pembesar dari kaumnya, “Wahai pembesar kaumku! Aku tidak tahu tuhan bagi kalian selain diriku. Maka bakarlah tanah liat bagiku wahai Hāmān dan buatkan untukku bangunan yang tinggi dengan harapan aku bisa melihat Tuhannya Musa dan berhadapan dengannya. Dan sesungguhnya aku yakin bahwa Musa seorang pendusta atas pengakuannya sebagai utusan dari Allah kepadaku dan kepada kaumku.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Fir’aun hendak meneguhkan keyakinan di kepala para pengikutnya bahwa dia adalah tuhan. Dia menganggap dirinya mengetahui segala hal, seandainya ada tuhan selain dirinya maka dia pasti akan mengetahuinya. Dan Musa telah menyampaikan bahwa Tuhannya adalah Tuhan langit; maka Fir’aun menampakkan diri sebagai orang yang hendak mencari kebenaran, sehingga dia ingin mencapai tempat tinggi yang menjulang ke langit dan percaya para pengikutnya tidak akan berani mencari kebenaran sesungguhnya. Maka dia meminta menterinya, Haman, untuk menyalakan tungku untuk mengeringkan tanah liat untuk membuat batu bata yang akan digunakan untuk membangun bangunan yang menjulang tinggi ke langit. Dia berkata: “Agar aku dapat menaiki bangunan itu sehingga aku dapat melihat Tuhan, dan aku yakni yang dikatakan Musa hanya kebohongan dan pengakuan saja.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَقَالَ فِرْعَوْنُ يٰٓأَيُّهَا الْمَلَأُ مَا عَلِمْتُ لَكُم مِّنْ إِلٰهٍ غَيْرِى (Dan berkata Fir’aun: “Hai pembesar kaumku, aku tidak mengetahui tuhan bagimu selain aku) Fir’aun yang terlaknat tetap teguh pada pengakuannya yang sesat agar dapat memperdaya kaumnya, padahal ia mengetahui bahwa Tuhannya adalah Allah; namun ia kembali pada kesombongan dan keangkuhannya, dan berusaha menyesatkan kaumnya dengan segenap kemampuannya. فَأَوْقِدْ لِى يٰهٰمٰنُ عَلَى الطِّينِ(Maka bakarlah hai Haman untukku tanah liat) Yakni bakarlah tanah liat agar menjadi bahan untuk bangunan. فَاجْعَل لِّى صَرْحًا(kemudian buatkanlah untukku bangunan yang tinggi) Yakni istana yang tinggi. لَّعَلِّىٓ أَطَّلِعُ إِلَىٰٓ إِلٰهِ مُوسَىٰ( supaya aku dapat naik melihat Tuhan Musa) Yakni agar aku naik dan melihat Tuhannya sehingga aku dapat mempercayainya. وَإِنِّى لَأَظُنُّهُۥ مِنَ الْكٰذِبِينَ(dan sesungguhnya aku benar-benar yakin bahwa dia termasuk orang-orang pendusta”) Fir’aun mencoba untuk memperdaya kaumnya dan menampakkan diri bahwa ia hanya orang yang mencari kebenaran."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Fir´aun berkata: \"Hai pembesar kaumku, aku tidak mengetahui tuhan bagi kalian lagi selain aku.” Inilah yang menunjukkan kesombongan Fir’aun. Kemudian Fir’aun berkata lagi: “Wahai Haman (menteri Fir’aun), bakarkan tanah liat untukku, kemudian buatkanlah bangunan/istana yang tinggi supaya aku dapat naik melihat Tuhan Musa, sehingga aku yakin bahwa dia utusan dari Allah. Dan sesungguhnya aku benar-benar yakin bahwa dia seorang pendusta\". Ini adalah kekeliruan pemahaman Fir’aun yang dia sampaikan kepada kaumnya bahwa dia mengaku sebagai pembawa kebenaran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Firʻaun berkata,“Wahai para pembesar, aku tidak mengetahui ada Tuhan bagi kalian selain aku. Wahai Haman, bakarlah} bakarlah {tanah liat untukku, kemudian buatkanlah untukku bangunan yang tinggi} bangunan yang tinggi {agar aku dapat naik melihat} agar aku bisa melihat {Tuhannya Musa. Sesungguhnya aku yakin bahwa dia termasuk orang-orang yang berbohong”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. “Dan Fir’aun berkata” dengan lancang kepada Allah untuk mengelabui kaumnya yang bodoh lagi kurang berakal, “Hai pembesar kaumku, aku tidak mengetahui sembahan bagimu selain aku.” Maksudnya, akulah semata tuhan dan sembahan kalian. Dan sekiranya di sana ada sembahan selain aku, tentu aku mengetahuinya! Lihatlah kesombongan besar Fir’aun. Ia tidak mengatakan, “Tidak ada bagi kalian sembahan selain Aku!” malah dengan sombongnya dia mengatakan, “aku tidak mengetahui sembahan bagi kalian selain Aku!” Yang demikian ini dikarenakan Fir’aun dalam pandangan mereka adalah orang yang alim lagi mulia, yang mana apa pun yang diucapkannya, maka itulah yang haq; dan apa pun yang ia perintahkan, maka mereka menaatinya. Setelah dia mengatakan perkataan yang mengandung arti bahwa di sana ada sembahan selain dia ini, dia ingin membuktikan penafian yang di dalamnya ada makna kemungkinan. Maka dari itu ia berkata kepada Haman, “hai Haman, bakarlah untukku tanah liat,” supaya Haman membuatkan untuknya batu bata dari tanah liat, “kemudian buatlah untukku bangunan yang tinggi,” bangunan pencakar langit, “supaya aku dapat naik melihat sembahan Musa, dan sesungguhnya aku benar-benar yakin bahwa dia,” seorang pendusta, akan tetapi kami akan membuktikan keyakinan ini dan akan kami perlihatkan kepada kalian kedustaan Musa. Perhatikanlah kelancangan ini terhadap Allah, yang belum pernah dilakukan oleh seorang manusia pun (sebelumnya)! Ia mendustakan Musa dan mengklaim dirinya adalah Allah, dan dia menafikan kalau dirinya memiliki pengetahuan tentang sembahan yang haq, dan ia telah melakukan sarana-sarana untuk bisa melihat sembahannya Musa. Semua ini adalah propaganda belaka. Akan tetapi anehnya, para pembesar yang mengklaim bahwa mereka adalah orang-orang elit kerajaan yang mengatur seluruh permasalahan kerajaan, bagaimana bisa akal mereka dipermainkan oleh si lelaki (durjana) ini dan direndahkan pikiran mereka! Ini semua terjadi karena kefasikan mereka yang telah menjadi karakter yang mengakar pada jiwa mereka dank arena kacau-balaunya agama mereka, yang kemudian diikuti oleh kerusakan akal pikiran mereka. Kami memohon kepada Allah keteguhan hati dalam beriman, dan agar engkau tidak menyimpangkan hati kami setelah memberinya petunjuk, dan Engkau anugerahkan kepada kami dari sisi-Mu rahmat. Sesungguhnya Engkau-lah yang Maha Pemberi karunia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 38: Kemudian, bahwasanya fir’aun mengambil kedudukan dengan berbuat dosa, ia berkuasa di atas kesewenang-wenangan dan berkata karena takut (ditinggalkan) kaumnya : Wahai manusia, sungguh aku tidak pernah mengetahui bahwasanya kalian beribadah kepada selainku; Maka bangunlah untukku wahai utusanku haman, sebuah bangunan yang terbuat dari tembikar, buatkan untukku dalam bentuk yang tinggi; Agar aku dapat naik ke langit melihat Tuhan Musa dengan kedua mataku yang manusia diseru untuk mengibadahi-Nya, sungguh aku sangat yakin dengan betul bahwa Musa adalah termasuk orang-orang pendusta yang berdusta dengan lisannya. 39. Maka fir’aun bersifat angkuh, dia dan bala tentaranya di bumi Mesir dengan tanpa kebenaran sama sekali, mereka meyakini bahwasanya setelah mereka mati, mereka tidak akan dibangkitkan kembali. Mereka meyakini bahwa tidak ada hari kiamat bagi mereka (tidak ada hisab dan siksa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bersikap berani terhadap Tuhannya dan mengelabui kaumnya yang bodoh dan kurang akal. Setelah Fir’aun mengucapkan kata-kata ini yang di dalamnya mengandung kemungkinan ada Tuhan selainnya, maka Fir’aun hendak menguatkan ketidakadaan Tuhan selainnya. Perhatikanlah keberaniaan makhluk yang lemah dan kecil ini kepada Allah Subhaanahu wa Ta'aala, ia mendustakan Rasul-Nya dan mengaku dirinya tuhan serta mencoba menguatkan dirinya dengan membuat bangunan yang tinggi untuk melihat Tuhan Musa dan kita. Akan tetapi, sungguh aneh para pembesar yang mengatur kerajaan, bagaimana akal mereka dapat dipermainkan oleh satu orang ini (Fir’aun), orang yang merusak agama dan akal mereka. Ini tidak lain karena keadaan mereka juga fasik dan sifat itu telah menancap dalam diri mereka. Oleh karena itu, kami meminta kepada-Mu ya Allah agar Engkau meneguhkan kami di atas keimanan dan tidak memalingkan hati kami kepada kesesatan setelah Engkau beri kami petunjuk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 38",
    "description": "Dan ketika tidak kuasa lagi untuk mendebat nabi musa, karena jelas dan kuatnya argumentasi yang disampaikan, dengan nada me-nyombongkan diri fir'aun berkata, 'wahai para pembesar kaumku! aku tidak mengetahui ada tuhan bagimu selain aku yang patut disembah. Guna mengetahui kebenaran atau kebohongan musa yang menyatakan ada tuhan pemelihara alam raya, maka bakarlah tanah liat untukku wahai haman untuk membuat batu bata dan bahan bangunan lainnya, kemudian buatkanlah segera bangunan dan istana yang tinggi untukku agar aku dapat naik melihat tuhannya musa, dan aku yakin bahwa dia termasuk pendusta dalam dakwaannya. ' 39. Sungguh apa yang diucapkan dan direncanakan oleh fir'aun adalah sesuatu yang tidak masuk akal. Ini disebabkan hatinya bejat dan dia fir'aun dan bala tentaranya berlaku sombong di bumi mesir tanpa alasan yang benar, dan mereka dengan sikapnya itu mengira bahwa mereka tidak akan dikembalikan di akhirat nanti kepada kami untuk mendapatkan penghitungan dan pembalasan."
  }
]