[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Fir’aun dan bala tentaranya telah berbuat kesombongan di negeri Mesir tanpa alasan yang dibenarkan untuk mau membenarkan Musa dan para mengikutinya terhadap dakwah yang ia serukan kepada mereka. Dan mereka beranggapan bahwa sesungguhnya mereka tidak akan dibangkitkan setelah kematian mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Fir'aun dan bala tentaranya bertambah sombong, tidak mau menerima kebenaran, dan mereka menguasai negeri Mesir secara tidak benar serta mengingkari adanya kebangkitan. Mereka mengira bahwa mereka tidak akan dikembalikan kepada Kami pada hari Kiamat untuk perhitungan amal dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Fir’aun dan para pengikutnya berbuat angkuh di seluruh penjuru Mesir, mereka sangat semena-mena dan zalim, jauh dari ketaatan kepada kebenaran dan orang-orang yang benar, dan tidak menyangka mereka akan kembali kepada Kami pada hari mata menjadi terbelalak."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. وَاسْتَكْبَرَ هُوَ وَجُنُودُهُۥ فِى الْأَرْضِ بِغَيْرِ الْحَقِّ (dan berlaku angkuhlah Fir’aun dan bala tentaranya di bumi tanpa alasan yang benar) Yang dimaksud dengan bumi adalah negeri Mesir. Makna (الاستكبار) adalah merasa mulia tanpa alasan yang benar, sebab ia tidak memiliki hujjah untuk menghentikan apa yang dibawa oleh Musa dan tidak memiliki alasan untuk melawan mukjizat Musa. وَظَنُّوٓا۟ أَنَّهُمْ إِلَيْنَا لَا يُرْجَعُونَ(dan mereka menyangka bahwa mereka tidak akan dikembalikan kepada Kami) Yang dimaksud dengan dikembalikan adalah dibangkitkan. Karena kebodohan dan keangkuhan mereka, mereka yakin bahwa kiamat dan hisab itu tidak akan terjadi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Justru Fir´aun beserta bala tentaranya di bumi Mesir berlaku semakin angkuh tanpa alasan yang benar. Istikbar adalah sombong tanpa kebenaran, bahkan dengan niat permusuhan, karena mereka tidak mampu menyanggah hujjah Musa. Mereka menyangka bahwa mereka tidak akan dikembalikan kepada Kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia dan bala tentaranya bersikap sombong di bumi tanpa (alasan yang) benar. Mereka mengira bahwa sesungguhnya mereka tidak dikembalikan kepada Kami"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. Allah berfirman, “Dan berlaku angkuhlah Fir’aun dan bala tentaranya di bumi (Mesir) tanpa alasan yang benar,” mereka bertindak sewenang-wenang terhadap hamba-hamba Allah dan menimpakan azab terhadap mereka, dan mereka menyombongkan diri terhadap para utusan Allah dan ayat-ayat (bukti-bukti) yang mereka bawa. Mereka mendustakannya dan beranggapan bahwa apa yang mereka anut itu lebih tinggi dan lebih utama daripadanya, “dan mereka menyangka bahwa mereka tidak akan dikembalikan kepada Kami,” maka dari itulah mereka lancang. Sebab, kalau tidak, maka kalau saja mereka mengetahui atau menduga bahwa mereka akan dikembalikan kepada Allah, niscaya mereka tidak akan melakukan tindakan yang telah mereka lakukan itu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 39: Kemudian, bahwasanya fir’aun mengambil kedudukan dengan berbuat dosa, ia berkuasa di atas kesewenang-wenangan dan berkata karena takut (ditinggalkan) kaumnya : Wahai manusia, sungguh aku tidak pernah mengetahui bahwasanya kalian beribadah kepada selainku; Maka bangunlah untukku wahai utusanku haman, sebuah bangunan yang terbuat dari tembikar, buatkan untukku dalam bentuk yang tinggi; Agar aku dapat naik ke langit melihat Tuhan Musa dengan kedua mataku yang manusia diseru untuk mengibadahi-Nya, sungguh aku sangat yakin dengan betul bahwa Musa adalah termasuk orang-orang pendusta yang berdusta dengan lisannya. 39. Maka fir’aun bersifat angkuh, dia dan bala tentaranya di bumi Mesir dengan tanpa kebenaran sama sekali, mereka meyakini bahwasanya setelah mereka mati, mereka tidak akan dibangkitkan kembali. Mereka meyakini bahwa tidak ada hari kiamat bagi mereka (tidak ada hisab dan siksa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka bersikap sombong terhadap hamba-hamba Allah dan menimpakan azab yang berat kepada mereka, bersikap sombong terhadap para rasul Allah dan terhadap apa yang mereka bawa dari-Nya, serta menyangka bahwa apa yang mereka pegang selama ini lebih tinggi dan lebih hebat. Kalau seandainya mereka mereka mengetahui, bahwa mereka akan kembali kepada Allah Subhaanahu wa Ta'aala, tentu mereka tidak akan bersikap seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 39",
    "description": "Sungguh apa yang diucapkan dan direncanakan oleh fir'aun adalah sesuatu yang tidak masuk akal. Ini disebabkan hatinya bejat dan dia fir'aun dan bala tentaranya berlaku sombong di bumi mesir tanpa alasan yang benar, dan mereka dengan sikapnya itu mengira bahwa mereka tidak akan dikembalikan di akhirat nanti kepada kami untuk mendapatkan penghitungan dan pembalasan. 40. Maka sebagai akibat keangkuhan dan kedurhakaan mereka dan setelah itu mencapai puncaknya kami siksa dia, yakni fir'aun dan bala tentaranya, lalu kami lemparkan mereka ke dalam laut merah seperti melempar batu-batu kecil yang tidak berarti sehingga mereka semua mati tenggelam. Maka perhatikanlah, wahai nabi Muhammad dan siapa pun yang mengetahui peristiwa itu, bagaimana kesudahan buruk yang me-nimpa orang yang zalim."
  }
]