[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Fir’aun itu telah menyombongkan diri dan bertindak sewenang-wenang di muka bumi dan menjadikan para penduduknya bergolongan-golongan yang terpecah belah. Ia menindas sebagian dari mereka, yaitu orang-orang Bani Israil, menyembelih anak-anak lelaki mereka dan membiarkan hidup perempuan-perempuan mereka untuk dijadikan pembantu dan bahan penghinaan. Sesungguhnya ia termasuk manusia yang melakukan kerusakan di muka bumi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. Sesungguhnya Fir'aun telah berbuat sewenang-wenang di Negeri Mesir, menjadikan penduduknya bergolongan-golongan dan memisahkan antara golongan-golongan itu, menindas salah satu dari golongan itu, yaitu Bani Israel dengan cara membunuh anak-anak lelaki dari mereka dan membiarkan hidup kaum wanitanya untuk dijadikan sebagai pembantu, sebagai bentuk terendah dalam menghinakan mereka, dan sesunguhnya Fir'aun termasuk orang-orang yang membuat kerusakan di muka bumi dengan kezaliman, kesewenang-wenangan dan kesombongan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Ayat-ayat ini menjelaskan secara umum kisah nyata yang telah disebutkan dengan menegaskan perbuatan Fir’aun yang ingin berlaku sombong dan semena-mena serta menjadikan penduduk negerinya terpecah belah dan saling bermusuhan; Fir’aun telah menyalakan permusuhan di antara mereka, agar mereka tetap menyembah dirinya. Dia telah merendahkan Bani Israil, memperbudak mereka, dan memaksa mereka menuruti hawa nafsunya. Dia bertekat untuk menyembelih seluruh anak laki-laki Bani Israil yang lahir agar mereka tidak dapat membahayakan kekuasaannya, dan membiarkan hidup anak perempuan untuk digunakan sebagai pelayan dan untuk menghinakan mereka. Orang durhaka ini termasuk orang-orang yang berbuat kerusakan di muka bumi."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. إِنَّ فِرْعَوْنَ عَلَا فِى الْأَرْضِ (Sesungguhnya Fir’aun telah berbuat sewenang-wenang di muka bumi) Yakni berbuat angkuh dan berlaku kejam dengan kekuasaannya di negeri Mesir, dan ia mengaku sebagai tuhan serta memperbudak penduduk mesir. وَجَعَلَ أَهْلَهَا شِيَعًا(dan menjadikan penduduknya berpecah belah) Yakni menjadikan mereka berkelompok-kelompok untuk melakukan pelayanan baginya, mereka melayaninya sesuai yang ia kehendaki dan mereka mentaatinya, sehingga kelompok-kelompok itu saling menguasai. يَسْتَضْعِفُ طَآئِفَةً مِّنْهُمْ(dengan menindas segolongan dari mereka) Golongan ini adalah Bani Israil. يُذَبِّحُ أَبْنَآءَهُمْ وَيَسْتَحْىِۦ نِسَآءَهُمْ ۚ( menyembelih anak laki-laki mereka dan membiarkan hidup anak-anak perempuan mereka) Fir’aun menyembelih anak laki-laki mereka dan membiarkan anak perempuan mereka. Terdapat pendapat mengatakan hal ini karena para peramal pada zaman itu memberi tahu Fir’aun bahwa kekuasaannya akan lenyap di tangan anak laki-laki dari Bani Israil. Al-Zajjaj berkata: yang mengherankan dari kebodohan Fir’aun adalah jika peramal itu memang benar maka sebenarnya pembunuhan yang ia lakukan tidak akan bermanfaat, dan jika peramal itu berdusta pembunuhan itu juga tidak bermakna. Dan pembenaran perkataan seperti ini merupakan kebodohan pula, sebab para peramal dan dukun tidak mengetahui hal ghaib sedikitpun, dan secara syariat tidak dibolehkan membenarkan perkataan yang seperti ini. Dan bisa jadi yang dimaksud dengan pembunuhan anak laki-laki Bani Israil hanyalah kiasan tentang perbudakan yang terjadi saat itu, atau hanya sekedar kabar-kabar yang disampaikan oleh Bani Israil dari pada Nabi mereka tentang kedatangan Nabi Musa. Waallahu a’lam. إِنَّهُۥ كَانَ مِنَ الْمُفْسِدِينَ(Sesungguhnya Fir’aun termasuk orang-orang yang berbuat kerusakan) Yakni berbuat kerusakan di bumi dengan kemaksiatan, kekejaman, dan pembunuhan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Lihatlah pelajaran dari ayat ini, bagaimana dahulu Fir'aun membunuh anak-anak karena takut dengan kehadiran Musa, namun ternyata Musa dibesarkan di rumahnya sendiri."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4. Sesungguhnya Fir´aun telah berbuat kesombongan dan kecongkakan di negeri Mesir. Dia mengklaim dirinya sebagai Tuhan, dan meminta penduduk untuk menyembahnya. Dia berbuat sewenang-wenang dan menjadikan penduduknya berpecah belah, dengan menindas segolongan dari mereka, menyembelih anak laki-laki mereka dan membiarkan hidup anak-anak perempuan mereka. Sesungguhnya Fir´aun termasuk orang-orang yang berbuat kerusakan dengan itu semua"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Firʻaun telah berbuat sewenang-wenang} sombong dan sewenang-wenang {di bumi} negeri Mesir {dan menjadikan penduduknya terpecah-belah} kelompok=kelompok yang terpisah {Dia menindas segolongan dari mereka. Dia menyembelih anak laki-laki mereka dan membiarkan hidup anak perempuannya} membiarkan anak perempuan mereka untuk dijadikan pelayan dan direndahkan {Sesungguhnya dia termasuk orang-orang yang berbuat kerusakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Awal kisah ini adalah, “Sesungguhnya Fir'aun telah berbuat sewenang-wenang di muka bumi,” dalam kerajaan, kekuasaan, bala tentara dan tiraninya, sehingga dia menjadi orang yang berbuat sewenang-wenang, bukan termasuk orang yang mulia di bumi ini, “dan menjadikan penduduknya berpecah belah,” maksudnya, menjadi kelompok-kelompok yang berpecah belah. Dia bertindak terhadap mereka semaunya, dia menerapkan apa saja dari kekuatan dan kekejamannya terhadap mereka menurut kemauannya, “dengan menindas segolongan dari mereka,” golongan yang dimaksud adalah Bani Israil yang telah diutamakan oleh Allah atas sekalian manusia, yang seharusnya Fir’aun memuliakan dan menghormati mereka. Namun, dia malah menindas mereka setelah dia melihat bahwa mereka sudah tidak memiliki daya (kekuatan) yang dapat melindungi mereka dari apa yang dikehendakinya terhadap mereka. Maka dia pun sama sekali tidak peduli terhadap mereka dan tidak pula memperhatikan keadaan (kedudukan) mereka, sampai pada kondisi yang sangat buruk, yaitu “menyembelih anak laki-laki mereka dan membiarkan hidup anak-anak perempuan mereka,” karena dia khawatir kalau jumlah mereka akan menjadi banyak, lalu mereka mendominasi negerinya kemudian mereka memiliki kekuatan. “Sesungguhnya Fir’aun termasuk orang-orang yang berbuat kerusakan,” yang sama sekali tidak mempunyai tujuan (visi) untuk perbaikan agama maupun kebaikan dunia. Ini salah satu bentuk tindakan merusak yang dilakukannya di bumi ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 4: Allah kemudian mengabarkan kepada Nabi-Nya ﷺ bahwasanya fir’aun adalah melampaui batas dan sombong di bumi mesir, dan menerobos atas setiap batasan-batasan dengan keangkuhan dan kedzaliman. Allah jadikan keluarganya golongan-golongan yang terpisah dalam mengikuti dirinya, dikhususkan satu golongan dari golongan-golongan yang lain yang mereka adalah bani israil dengan kehinaan, kekalahan dan kegelapan; Karena sebab mereka beserta menteri-menteri serta pelayan-pelayan bagi penguasa sebelumnya. Dan di antara kehinaan mereka adalah menyembelih anak-anak mereka, dan menjauhkan laki-laki dan perempuan di antara mereka, oleh sebab itu fir’aun adalah termasuk para perusak yang sangat buruk di bumi mesir dengan kerusakan yang parah dan kedzaliman yang tidak kalah buruknya, sampai-sampai dia menjadikan dirinya di angkat melebihi manusia pada umumnya. Sungguh kalimatullah itu tinggi, maka jika kekuasaan tidak tunduk dengan perintah Allah, sungguh kembalinya hanyalah kebinasaan, sebagaiman akhir dari kehidupan fir’aun yaitu Allah binasakan dengan ditenggelamkan di laut, dia (fir’aun) dan bala tentaranya semua."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia bertindak semaunya terhadap mereka dan memberlakukan untuk mereka sesuatu yang ia inginkan karena berkuasa terhadap mereka. Yaitu Bani Israil, di mana mereka adalah umat yang Allah lebihkan pada masa itu di atas umat-umat yang lain, sehingga pantas untuk dimuliakan oleh Fir’aun. Tetapi kenyataannya, Fir’aun malah menindas mereka karena dilihatnya mereka tidak memiliki kekuatan untuk menolak keinginannya, sehingga Fir’aun tidak peduli lagi mau berbuat apa terhadap mereka sampai akhirnya ia berani menyembelih anak laki-laki mereka yang baru lahir karena khawatir jumlah Bani Israil semakin banyak sehingga memenuhi negerinya dan akhirnya menguasai kerajaannya. Yang baru lahir. Fir’aun melakukan hal itu karena kekhawatiran kerajaannya akan hancur berdasarkan berita yang sampai kepadanya dari sebagian dukun, bahwa akan lahir dari Bani Israil seorang anak yang akan menjadi sebab hilangnya kerajaan Fir’aun. Ada pula yang berpendapat, bahwa sebab ia membunuh anak laki-laki dari kalangan Bani Israil adalah karena berita yang sampai kepadanya dari orang-orang Qibth (Mesir), di mana mereka mendengar cerita dari kaum Bani Isra’il yang mereka warisi dari Nabi Ibrahim ‘alaihissalam, bahwa akan keluar dari keturunannya seorang anak yang akan menggulingkan kekuasaan raja Mesir. Wallahu a’lam. Yakni tergolong orang-orang yang tidak memiliki keinginan untuk mengadakan perbaikan terhadap keadaan agamanya dan dunianya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 4",
    "description": "Kisahnya bermula dari kesewenang-wenangan fir'aun dan rezimnya. Sungguh, fir'aun telah berbuat sewenang-wenang di muka bumi kepada Allah dengan mengaku dirinya sebagai tuhan dan juga kepada manusia dengan menjadikan penduduk negeri, mesir yang mereka kuasai-Nya berpecah belah menjadi dua kelompok besar; pertama, masyarakat mesir; dan kedua, masyarakat bani israil. Bentuk kesewenang-wenang-an itu antara lain dia menindas segolongan dari mereka yakni kelompok bani israil, dengan cara dia menyembelih anak laki-laki mereka dan membiarkan hidup sambil mempermalukan anak perempuan mereka. Sungguh, dia yakni fir'aun adalah termasuk kelompok orang yang berbuat kerusakan. 5. Penindasan dan pembunuhan anak-anak lelaki yang dilakukan fir'aun itu adalah guna mempertahankan kekuasaan-Nya, dan kami di masa mendatang hendak memberi karunia kepada orang-orang yang tertindas di bumi mesir itu, yakni bani israil, dan hendak menjadikan mereka pemimpin yang diteladani dalam segala hal, dan menjadikan mereka orang-orang yang mewarisi kekuasaan dan harta benda di dunia yang serupa atau melebihi apa yang dimiliki oleh fir'aun."
  }
]