[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami menyiksa Fir’aun dan bala tentaranya, lalu Kami lemparkan mereka semua ke dalam laut dan Kami tenggelamkan mereka semua. Maka lihatlah (wahai Rasul) bagaimana kesudahan orang-orang yang menzhalimi diri mereka sendiri dengan berbuat kafir kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Maka Kami hukum Fir'aun dan bala tentaranya dengan melemparkan mereka ke dalam lautan, tenggelam dan binasa seluruhnya. Maka perhatikanlah -wahai Rasul- bagaimana tempat tujuan dan akhir dari kehidupan orang-orang yang zalim. Tempat tujuan dan akhir mereka adalah kehancuran."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Habislah ajal yang telah Kami tetapkan bagi mereka. Mereka tetap berbuat zalim dan melakukan kerusakan di muka bumi; hingga ketika datang balasan Kami, Kami giring mereka menuju laut kemudian Kami tenggelamkan mereka. Hai Rasulullah, lihatlah bagaimana kesudahan orang-orang zalim yang berpaling dari jalan yang lurus?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "40. فَأَخَذْنٰهُ وَجُنُودَهُۥ (Maka Kami hukumlah Fir’aun dan bala tentaranya) Setelah mereka terus menerus dalam kekafiran dan keterlaluan dalam kekafiran itu. فَنَبَذْنٰهُمْ فِى الْيَمِّ ۖ (lalu Kami lemparkan mereka ke dalam laut) Yakni Kami tenggelamkan mereka ke dalam lautan. Kalimat ini telah dijelaskan sebelumnya. فَانظُرْ كَيْفَ كَانَ عٰقِبَةُ الظّٰلِمِينَ (Maka lihatlah bagaimana akibat orang-orang yang zalim) Yakni lihatlah Hai Muhammad, bagaimana kesudahan orang-orang kafir ketika mereka menjadi binasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Maka Kami hukum Fir´aun dan bala tentaranya, lalu Kami lemparkan mereka ke dalam laut. Maka lihatlah wahai Nabi, bagaimana akhir dari orang-orang yang zalim itu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menghukum dia dan bala tentaranya. Kami menenggelamkan mereka ke dalam laut} Kami hempaskan mereka ke dalam laut {Perhatikanlah bagaimana kesudahan orang-orang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. “Maka Kami hukumlah Fir’aun dan bala tentaranya” di saat sikap keras kepala dan kecongkakan mereka berlanjut, “lalu Kami lemparkan mereka ke dalam laut. Maka lihatlah bagaimana akibat orang-orang yang zhalim,” akibatnya adalah hukuman yang paling buruk dan paling merugikan yaitu siksaan dunia yang berkelanjutan dan berhubungan dengan siksaan akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 40: Allah mengabarkan bahwa Dia akan mengadzab fir’aun dan bala tentaranya dengan adzab yang keras; Di mana mereka semua Allah masukkan di dalam lautan, kemudian lautan tersebut Allah hempaskan pada mereka, sehingga mereka tenggelam. Lihatlah wahai Nabi Allah dengan pandangan penuh perenungan dan pelajaran bagaimana kesudahan mereka yang dzalim dan kufur kepada Rabb-Nya. Maka segala puji bagi Allah yang mengadzab thagut di dunia, dan yang akan mendapatkan adzab kerasdi akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ketika mereka tetap membangkang. Di mana akhir kesudahannya adalah kebinasaan. Ia merupakan kesudahan yang paling buruk dan paling sengsara, di dunia mendapatkan hukuman yang sangat buruk dan berlanjut dengan hukuman di akhirat, nas’alullahas salaamah wal ‘aafiyah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 40",
    "description": "Maka sebagai akibat keangkuhan dan kedurhakaan mereka dan setelah itu mencapai puncaknya kami siksa dia, yakni fir'aun dan bala tentaranya, lalu kami lemparkan mereka ke dalam laut merah seperti melempar batu-batu kecil yang tidak berarti sehingga mereka semua mati tenggelam. Maka perhatikanlah, wahai nabi Muhammad dan siapa pun yang mengetahui peristiwa itu, bagaimana kesudahan buruk yang me-nimpa orang yang zalim. 41. Dan sesuai dengan kehendak serta jati diri mereka kami jadikan mereka para pemimpin kekufuran dan kedurhakaan yang selalu mengajak manusia yang lemah jiwa dan akalnya kepada perbuatan buruk yang menyebabkan mereka masuk ke neraka, dan dengan demikian mereka akan menjadi penghuni neraka, sehingga pada hari kiamat mereka tidak akan ditolong, karena mereka kafir dan selalu mendustakan rasul utus-an tuhan."
  }
]