[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami jadikan Fir’aun dan kaumnya sebagai pemimpin menuju neraka yang akan diikuti oleh orang-orang kafir dan fasik. Dan pada Hari Kiamat, mereka tidak mendapatkan pertolongan. Hal itu disebabkan oleh kekafiran dan pendustaan mereka terhadap utusaan Tuhan mereka dan ketetapan hati mereka untuk terus mengerjakannya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "41. Kami jadikan mereka sebagai teladan bagi orang-orang yang melampaui batas dan orang-orang sesat yang mengajak kepada Neraka, karena mereka menyebarkan kekufuran dan kesesatan. Dan pada hari Kiamat nanti mereka tidak mendapat pertolongan dengan tidak diselamatkan dari siksa, justru siksa mereka dilipat gandakan karena mereka telah membuat sunah yang buruk dan mengajak kepada kesesatan. Dituliskan bagi mereka dosa amal perbuatan mereka dan dosa perbuatan orang-orang yang mengikuti mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "41. Allah mengetahui kesesatan mereka dan keburukan yang ada dalam diri mereka, sehingga Allah menyiapkan bagi mereka sebab-sebab yang membuat mereka menjadi contoh bagi para pengikut mereka dalam menuruti syahwat dan berpaling dari petunjuk. Mereka telah menghiasi bagi para pengikut itu berbagai perbuatan yang dapat menjerumuskan pelakunya ke dalam neraka, dan mereka tidak akan menemukan orang yang dapat menolong mereka untuk menjauhkan mereka dari azab."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "41. وَجَعَلْنٰهُمْ أَئِمَّةً يَدْعُونَ إِلَى النَّارِ ۖ (Dan Kami jadikan mereka pemimpin-pemimpin yang menyeru (manusia) ke neraka) Kami jadikan mereka pemimpin yang diikuti dan ditaati oleh orang-orang kafir, mereka menyeru para pengikutnya menuju neraka. Ini juga merupakan penjelasan bagi para thaghut dan para pemimpin yang berlaku sewenang-wenang bagaimana mereka menyikapi para da’i yang menyeru kepada kebenaran dan menghalangi usaha yang mereka keluarkan di jalan Allah, yang mana mereka ini meniru dan menempuh jalan Fir’aun dan kaumnya. وَيَوْمَ الْقِيٰمَةِ لَا يُنصَرُونَ (dan pada hari kiamat mereka tidak akan ditolong) Yakni tidak ada yang mampu menolong dan menghalangi mereka dari azab Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "41. Kami jadikan mereka percontohan pemimpin-pemimpin yang akan menyeret manusia ke dalam neraka dan pada hari kiamat mereka tidak akan mendapat pertolongan dari azab yang mereka terima"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami menjadikan mereka para pemimpin} pemimpin untuk kesesatan {yang mengajak ke neraka. Pada hari kiamat mereka tidak akan ditolong"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "41. “Dan Kami jadikan mereka pemimpin-pemimpin yang menyeru ke neraka,” maksudnya, Kami menjadikan Fir’aun dan para pembesarnya sebagai para pemimpin yang dijadikan panutan dan diikuti dari belakang menuju negeri kenistaan dan kesengsaraan. “Dan pada Hari Kiamat mereka tidak akan ditolong,” dari azab Allah. Mereka sangatlah lemah untuk menolaknya dari diri mereka, dan mereka sama sekali tidak mempunyai seorang pembela ataupun penolong dari selain Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 41: Allah jadikan fir’aun dan kaumnya sebagai pemimpin yang penuh penghinaan di mana mereka diseru menuju jahannam, dan di hari kiamat, tiada penolong bagi mereka dan tiada yang menyelamatkan mereka dari adzab yang keras."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Karena mengajak manusia berbuat syirk dan kemaksiatan. Dari azab Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 41",
    "description": "Dan sesuai dengan kehendak serta jati diri mereka kami jadikan mereka para pemimpin kekufuran dan kedurhakaan yang selalu mengajak manusia yang lemah jiwa dan akalnya kepada perbuatan buruk yang menyebabkan mereka masuk ke neraka, dan dengan demikian mereka akan menjadi penghuni neraka, sehingga pada hari kiamat mereka tidak akan ditolong, karena mereka kafir dan selalu mendustakan rasul utus-an tuhan. 42. Dan kami susulkan laknat kepada mereka di dunia ini berupa kehinaan dan kemurkaan dari kami; sedangkan pada hari kiamat mereka termasuk orang-orang yang dijauhkan dari kebaikan, rahmat dan karunia Allah. Adakah siksa yang lebih pedih dari itu semua' untuk menghindari azab tersebut, Allah memberi jalan keselamatan kepada manusia di zaman nabi musa, yaitu dengan berpegang teguh kepada kita suci taurat se-perti dijealskan pada ayat berikut."
  }
]