[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami iringkan pada Fir’aun dan kaumnya di dunia ini kehinaan dan kemurkaan Kami kepada mereka, dan pada Hari Kiamat mereka termasuk orang-orang yang perbuatan mereka dinilai buruk dan mereka dijauhkan dari rahmat allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "42. Dan Kami tambahkan atas siksa mereka di dunia ini berupa kehinaan dan pengusiran, dan pada hari Kiamat nanti mereka adalah orang-orang yang dijauhkan dari rahmat Allah, dimurkai Allah dan dicela oleh hamba-hamba-Nya yang beriman."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "42. Allah menetapkan laknat di dunia bagi Fir’aun dan para pengikutnya melalui lisan para nabi dan orang-orang beriman setiap kali kisah mereka disebutkan. Dan pada hari kiamat mereka adalah orang-orang yang selalu disertai kehinaan dalam neraka Jahannam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "42. وَأَتْبَعْنٰهُمْ فِى هٰذِهِ الدُّنْيَا لَعْنَةً ۖ (Dan Kami ikutkanlah laknat kepada mereka di dunia ini) Sehingga setiap orang yang menyebut mereka akan melaknat mereka. وَيَوْمَ الْقِيٰمَةِ هُم مِّنَ الْمَقْبُوحِينَ (dan pada hari kiamat mereka termasuk orang-orang yang dijauhkan (dari rahmat Allah)) Makna (المقبوح) adalah terusir dan termurkai. Dan pendapat lain mengatakan maknanya adalah memiliki tubuh yang cacat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "42. Kami turunkan laknat kepada mereka di dunia ini; atau terhalang dari rahmat Kami. Pada hari kiamat mereka termasuk orang-orang yang dijauhkan dari rahmat Allah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mengikutkan kepada mereka} Kami menyematkan kepada mereka {di dunia ini laknat} kehinaan dan kejauhan dari rahmat {dan pada hari kiamat mereka termasuk orang-orang yang dijauhkan} orang-orang yang tercela dan orang-orang yang dijauhkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "42. “Dan Kami ikutkan laknat kepada mereka di dunia ini.” Maksudnya, dan Kami ikutkan kepada mereka sebagai tambahan hukuman dan kehinaan mereka di dunia ini kutukan, mereka dikutuk. Dan mereka mendapatkan dari manusia sebutan buruk, kebencian dan celaan. Ini sudah menjadi masalah yang bisa disaksikan. Jadi, mereka adalah para pemimpin yang dikutuk di dunia, dan mereka adalah terdepan, “dan pada hari kiamat mereka adalah termasuk orang-orang yang dijauhkan (dari rahmat Allah).\" Yang dijauhkan, dihnakan akibat perbuatan mereka, yang berkumpul pada mereka kebencian Allah, kebencian manusia, dan kebencian diri mereka sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 42: Allah mengabarkan bahwa fir’aun dan kaumnya berhak mendapatkan kehidupan dunia yang penuh laknat yang semestinya dan kehinaan pada mereka, adapun pada hari kiamat mereka termasuk orang-orang yang jauh dari rahmat Allah, dan sekeras-keras manusia yang mendapatkan adzab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sebagai tambahan terhadap azab dan penghinaan mereka. Nama mereka di hadapan semua makhluk begitu buruk, dibenci dan dicela oleh mereka. Berkumpul dalam diri mereka kemurkaan dari Allah, dari makhluk-Nya dan dari diri mereka sendiri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 42",
    "description": "Dan kami susulkan laknat kepada mereka di dunia ini berupa kehinaan dan kemurkaan dari kami; sedangkan pada hari kiamat mereka termasuk orang-orang yang dijauhkan dari kebaikan, rahmat dan karunia Allah. Adakah siksa yang lebih pedih dari itu semua' untuk menghindari azab tersebut, Allah memberi jalan keselamatan kepada manusia di zaman nabi musa, yaitu dengan berpegang teguh kepada kita suci taurat se-perti dijealskan pada ayat berikut. 43. Kisah bani israil ditutup oleh ayat ini dengan menjelaskan dasar kepemimpinan nabi musa, setelah ayat yang lalu menjelaskan kepemimpinan fir`aun dalam kekufuran. Sambil bersumpah Allah berfirman, dan demi keagungan dan kekuasaan kami, sungguh, telah kami berikan kepada musa kitab taurat yang mengandung hukum dan petunjuk kebahagiaan bagi masyarakat bani israil, setelah kami binasakan umat-umat terdahulu, seperti kaum nabi nu', kaum nabi hud (`ad), kaum nabi 'alih (Samud), kaum nabi lu' dan penduduk negeri madyan. Kitab itu kami anugerahkan untuk menjadi pelita cahaya bagi hati manusia yang sebelumnya berada dalam kegelapan dan tidak me-ngetahui kebenaran, dan juga agar menjadi petunjuk bagi yang memerhatikan kandungannya, serta menjadi jalan untuk mendapatkan rahmat bagi yang melaksanakannya. Semua itu kami anugerahkan agar mereka mendapat pelajaran dari apa yang ada di dalamnya, sehingga bergegas menjalankan perintah dan menjauhi larangan, dan juga agar mereka selalu mengingat kebesaran Allah dan aneka anugerah-Nya."
  }
]