[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah memberikan kepada Musa kitab Taurat setelah Kami membinasakan umat-umat sebelum dia (seperti kaum Nuh, Ad, Tsamud dan kaum Luth serta penduduk Madyan). Di dalam kitab taurot itu terdapat petunjuk-petunjuk bagi Bani Israil. Dengan itu, mereka dapat mengetahui hal-hal yang bermanfaat bagi mereka dan perkara-perkara yang membahayakan mereka. Dan di dalamya terdapat rahmat bagi orang yang mengamalkannya dari mereka. Mudah-mudahan mereka mau mengngat-ingat nikmat-nikmat Allah yang tercurah pada mereka, lalu mereka mensyukuri Allah atas nikmat tersebut dan tidak kafir terhadapNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "43. Dan Kami telah memberi Musa kitab Taurat setelah Kami mengutus para Rasul Kami kepada umat-umat terdahulu. Dan mereka mendustakan para Rasul Kami, sehingga Kami binasakan mereka dikarenakan kedustaan mereka terhadap para Rasul. Di dalam kitab Taurat itu terdapat ajaran yang menjadikan manusia mengerti apa yang bermanfaat bagi mereka sehingga mereka mengerjakannya, dan apa yang berbahaya bagi mereka sehingga mereka bisa menghindarinya, dan di dalamnya terdapat petunjuk untuk mereka kepada kebaikan, sebagai rahmat karena di dalamnya terdapat kebaikan dunia dan kebaikan Akhirat, agar mereka mengingat nikmat yang telah dianugerahkan Allah kepada mereka sehingga mereka bersyukur kepada-Nya dan beriman kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "43. Telah berlaku sunnatullah di bumi, bahwa Allah akan mengutus para rasul sebagai pemberi kabar gembira dan peringatan kepada umat-umat terdahulu, seperti kaum Nuh, Ad, dan Tsamud; dan jika umat-umat itu mendustakan para rasul maka siksaan Allah akan datang untuk membinasakan mereka. Kemudian Allah mengutus Musa kepada Bani Israil dan menurunkan Taurat kepadanya yang dapat menjadikan mereka mampu melihat jalan petunjuk dan meraih rahmat Allah. Semoga mereka mengingat kenikmatan-kenikmatan yang Allah berikan kepada mereka, sehingga mereka dapat mensyukurinya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "43. وَلَقَدْ ءَاتَيْنَا مُوسَى الْكِتٰبَ (Dan sesungguhnya telah Kami berikan kepada Musa Al-Kitab) Yakni kitab Taurat. مِنۢ بَعْدِ مَآ أَهْلَكْنَا الْقُرُونَ الْأُولَىٰ( sesudah Kami binasakan generasi-generasi yang terdahulu) Yakni setelah kaum Nabi Nuh, kaum Aad, Tsamud, dan lain sebagainya. Pendapat lain mengatakan yakni setelah Kami binasakan Fir’aun dan kaumnya serta Kami tenggelamkan Qarun ke dalam tanah. بَصَآئِرَ لِلنَّاسِ(untuk menjadi pelita bagi manusia) Yakni Kami memberinya kitab agar menjadi penerang dan petunjuk bagi manusia menuju kebenaran dan agar mereka dapat menyelamatkan diri mereka dari kesesatan. وَرَحْمَةً (dan rahmat) Yakni rahmat Allah yang Dia berikan kepada mereka. لَّعَلَّهُمْ يَتَذَكَّرُونَ(agar mereka ingat) Yakni mengingat nikmat-nikmat ini, sehingga mereka bersyukur dan beriman kepada Allah serta memenuhi seruan-Nya menuju kebaikan bagi mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "43. Sesungguhnya telah Kami berikan kepada Musa Al-Kitab Taurat sesudah Kami binasakan generasi-generasi yang terdahulu. Yaitu kaum Nuh, kaum ‘Ad, kaum Tsamud, kaum Luth dan lainnya. Sebagai pembuka mata dan penerang bagi mereka kaum Bani Israi menuju agama mereka, serta untuk menjadi pelita bagi manusia dan petunjuk dan rahmat bagi orang yang beriman, agar mereka ingat dan mengambil pelajaran dari kitab tersebut."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sungguh Kami benar-benar menganugerahkan kepada Musa kitab} Taurat {setelah Kami membinasakan generasi} umat-umat {terdahulu sebagai penerang bagi manusia} penjelasan yang memperlihatkan kepada manusia hal-hal yang benar {petunjuk, dan rahmat agar mereka mendapat pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "43. “Dan sungguh telah Kami berikan kepada Musa al-kitab,” yaitu Taurat, “sesudah Kami binasakan generasi-generasi yang terdahulu,” yaitu orang-orang yang mana akhir kehidupan mereka adalah pembinasaan umum terhadap Fir’aun dan bala tentaranya. Ini adalah satu dalil yang membuktikan bahwa setelah turunnya Taurat itu pembinasaan umum selesai, dan dimulailah jihad melawan orang-orang kafir dengan pedang. “Untuk menjadi pelita bagi manusia,” maksudnya, di dalam Kitab taurat yang diturunkan kepada Musa, terdapat pelita-pelita bagi manusia, yaitu perkara-perkara yang dengannya mereka dapat melihat apa yang bermanfaat dan apa yang membahayakan mereka. Sehingga hujjah tegak terhadap orang yang durhaka, dan dimanfaatkan oleh orang yang beriman, sehingga hujjah itu menjadi rahmat baginya dan petunjuk menuju jalan yang lurus. Maka dari itu Allah berfirman, “Dan petunjuk dan rahmat, agar mereka ingat.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 43: Allah kemudian mengabarkan bahwa Dia menurunkan Taurat setelah binasanya fir’aun dan yang bersamanya beserta umat-umat terdahulu yang bermaksiat kepada utusan-utusan Allah; Semisal kaum Nuh, Hud, Shalih kemudian Allah menjelaskan bahwasanya Taurat ini, yang diturunkan kepada Musa, di dalamnya terdapat ilmu untuk bani israil yang menerangi hati yang menginginkan kebenaran dan mengikutinya, padanya juga terdapat hidayah dan cahaya bagi mereka, serta rahmat bagi siapa yang beramal dengannya (Taurat), mudah-mudahan mereka mendapatkan kenikmatan dari Allah dan menjadi orang-orang yang bersyukur."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Seperti kaum Nuh, ‘Aad, Tsamud dan Fir’aun bersama bala tentaranya. Ini adalah dalil, bahwa setelah turun kitab Taurat, maka hilanglah pembinasaan secara merata dan disyariatkan jihad melawan orang-orang kafir. Yakni menjadi cahaya bagi hati mereka, membuat mereka dapat melihat hakikat sesuatu dan kesudahannya serta dapat melihat hal yang bermanfaat bagi mereka dan hal yang tidak bermanfaat, sebagai hujjah bagi pelaku maksiat dan bermanfaat bagi orang-orang mukmin, sebagai rahmat baginya dan petunjuk ke jalan yang lurus."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 43",
    "description": "Kisah bani israil ditutup oleh ayat ini dengan menjelaskan dasar kepemimpinan nabi musa, setelah ayat yang lalu menjelaskan kepemimpinan fir`aun dalam kekufuran. Sambil bersumpah Allah berfirman, dan demi keagungan dan kekuasaan kami, sungguh, telah kami berikan kepada musa kitab taurat yang mengandung hukum dan petunjuk kebahagiaan bagi masyarakat bani israil, setelah kami binasakan umat-umat terdahulu, seperti kaum nabi nu', kaum nabi hud (`ad), kaum nabi 'alih (Samud), kaum nabi lu' dan penduduk negeri madyan. Kitab itu kami anugerahkan untuk menjadi pelita cahaya bagi hati manusia yang sebelumnya berada dalam kegelapan dan tidak me-ngetahui kebenaran, dan juga agar menjadi petunjuk bagi yang memerhatikan kandungannya, serta menjadi jalan untuk mendapatkan rahmat bagi yang melaksanakannya. Semua itu kami anugerahkan agar mereka mendapat pelajaran dari apa yang ada di dalamnya, sehingga bergegas menjalankan perintah dan menjauhi larangan, dan juga agar mereka selalu mengingat kebesaran Allah dan aneka anugerah-Nya. 44. Setelah selesai dipaparkan kisah nabi musa, Allah menyampaikan kepada nabi Muhammad tentang penegasan tentang kenabian dan kerasulannya. Dan engkau wahai nabi Muhammad tidak bersama nabi musa berada di sebelah barat lembah suci 'uwa di gunung ''r ketika kami menyampaikan perintah kepada musa untuk menyampaikan risalah dan menghadapi fir`aun, dan engkau tidak pula hidup sezaman de-ngannya sehingga termasuk orang-orang yang menyaksikan kejadian itu. Namun demikian engkau dapat mengetahuinya secara benar, padahal engkau pun tidak pandai membaca atau pernah belajar. Ini bukti bahwa engkau mendapat wahyu dari Allah. Maka, bagaimana kaummu mendustakan risalahmu sedangkan kamu hanya membacakan kabar orang-orang terdahulu pada mereka'."
  }
]