[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": ". Dan tidaklah kamu (wahai Rasul) berada di sisi sebelah barat dari Musa ketika Kami bebankan kepadanya perintah dan larangan Kami, dan kamu tidaklah termasuk orang-orang yang menyaksikannya, sehingga dapat dikatakan bahwa ia sampai kepadamu melalui jalan ini."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "44. Dan tidaklah engkau -wahai Rasul- hadir di samping lereng gunung sebelah barat dari Musa -'alaihissalām- tatkala Kami menyampaikan perintah kepada Musa dengan mengutusnya kepada Fir'aun dan para pembesarnya, dan engkau tidak termasuk orang-orang yang hadir hingga engkau mengerti kabar tentang hal itu lalu engkau mengisahkannya kepada manusia. Dan apa yang engkau ceritakan kepada mereka adalah wahyu dari Allah kepadamu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "44. Hai Rasulullah, Kami telah membacakan kepadamu kisah-kisah tentang Nabi Musa. Kamu tidak berada di sisi gunung sebelah barat dari lembah yang terletak di sebelah kanan ketika Kami menetapkan perjanjian Kami kepada Musa dan Kami tugaskan dia untuk mengemban risalah; dan kamu tidak termasuk orang yang menyaksikan kejadian itu sehingga dapat mengetahui kejadian sebenarnya; serta kamu dan kaummu bukan termasuk orang-orang yang mengetahui kisah para rasul dan umat-umat terdahulu. Dan jika telah jelas bahwa mengetahui kisah-kisah ini secara terperinci tidak mungkin dapat dilakukan kecuali dengan menyaksikannya secara langsung, maka jelaslah bahwa kisah-kisah ini berasal dari wahyu Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "44. وَمَا كُنتَ بِجَانِبِ الْغَرْبِىِّ (Dan tidaklah kamu (Muhammad) berada di sisi yang sebelah barat) Yakni Hai Muhammad, kamu tidak pernah berada di sisi barat dari lembah Sinai, ketika Musa bermunajat kepada Tuhannya. Dari sini jelas bahwa lembah itu mengalirkan air dari arah timur ke utara, sebab arah barat tidak akan berada di sisi kanan kecuali jika air itu mengalir dari arah timur ke barat. إِذْ قَضَيْنَآ إِلَىٰ مُوسَى الْأَمْرَ(ketika Kami menyampaikan perintah kepada Musa) Yakni ketika Kami mengambil perjanjian darinya dan Kami tegaskan perintah kepadanya untuk menyampaikan risalah kepada Fir’aun dan kaumnya. وَمَا كُنتَ مِنَ الشّٰهِدِينَ(dan tiada pula kamu termasuk orang-orang yang menyaksikan) Yakni tidak menyaksikan hal itu, sehingga kamu dapat mengetahui kejadian sebenarnya untuk kamu ceritakan kepada kaummu. Dengan demikian jelaslah bahwa kisah itu berasal dari Allah dengan wahyu yang disampaikan kepada Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "44. Dan engkau wahai Muhammad tidaklah berada di sisi gunung sebelah barat ketika nabi Musa bermunajat. Yaitu ketika Kami menyampaikan wahyu kepada Musa berupa kitab Taurat dan perintah untuk menyampaikan risalah kepada Fir’aun dan kaumnya. Engkau juga bukan termasuk orang-orang yang menyaksikan peristiwa zaman itu, maka pelajari dan sampaikanlah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak berada di sebelah barat} bukit di bagian barat {ketika Kami menyampaikan} membuat perjanjian {risalah} risalah untuk Fir’aun dan kaumnya {kepada Musa. Kamu juga tidak termasuk orang-orang yang menyaksikan} termasuk orang-orang yang hadir pada waktu itu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "44. Setelah Allah menceritakan kepada RasulNya apa yang telah dikisahkanNya, berupa kabar-kabar ghaib di atas, maka Dia mengingatkan hamba-hambaNya bahwa ini semua adalah kabar ilahi murni; Rasulullah sama sekali tidak punya jalan untuk mengtahui selain dari jalur wahyu. Maka dari itu, Dia berfirman, “Dan tidaklah kamu (Muhammad) berada di sisi yang sebelah barat,” maksudnya di sebelah barat bukit Thur pada waktu Kami memberikan keputusan kepada Musa, “dan tiada pula kamu termasuk orang-orang yang menyaksikan” semua itu, sehingga dikatakan “bahwa sesungguhnya berita itu sampai kepadamu dari jalur ini.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 44: Allah berfirman kepada Nabi-Nya Muhammad ﷺ : Tidaklah engkau ada di atas gunung Thur yang terletak di sebelah barat, ketika Allah berbicara dengan Musa, dan Allah membebankan perintah-perintah dan larangan-larangan, engkau tidaklah menyaksikannya sampai Kami yang mengisahkannya kepada kaummu, dan semua itu adalah termasuk dari ilmu ghaib yang Kami kabarkan keada engkau."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menceritakan kepada Rasul-Nya (Nabi Muhammad shallallahu 'alaihi wa sallam) apa yang Dia ceritakan, seperti berita-berita di masa lalu, maka Allah Subhaanahu wa Ta'aala mengingatkan manusia bahwa berita tersebut adalah berita murni dari Allah, tidak ada jalan bagi rasul untuk mengetahuinya kecuali dengan jalan wahyu. Maksudnya, di sebelah barat lembah suci Thuwa, lihat surat Thaha ayat 12. Sehingga dikatakan, bahwa engkau mengetahuinya karena ikut hadir ketika itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 44",
    "description": "Setelah selesai dipaparkan kisah nabi musa, Allah menyampaikan kepada nabi Muhammad tentang penegasan tentang kenabian dan kerasulannya. Dan engkau wahai nabi Muhammad tidak bersama nabi musa berada di sebelah barat lembah suci 'uwa di gunung ''r ketika kami menyampaikan perintah kepada musa untuk menyampaikan risalah dan menghadapi fir`aun, dan engkau tidak pula hidup sezaman de-ngannya sehingga termasuk orang-orang yang menyaksikan kejadian itu. Namun demikian engkau dapat mengetahuinya secara benar, padahal engkau pun tidak pandai membaca atau pernah belajar. Ini bukti bahwa engkau mendapat wahyu dari Allah. Maka, bagaimana kaummu mendustakan risalahmu sedangkan kamu hanya membacakan kabar orang-orang terdahulu pada mereka'45. Engkau tidak mengalami peristiwa-peristiwa itu, tetapi kami telah menciptakan beberapa umat dalam berbagai generasi setelah nabi musa, dan telah berlalu atas mereka masa yang panjang, sehingga mereka lupa dengan perjanjian yang telah mereka ambil dan meninggalkan perintah Allah. Kami utus engkau untuk memperbaharui kembali dakwah yang pernah disampaikan oleh nabi-nabi terdahulu. Dan demikian pula engkau wahai nabi Muhammad tidak tinggal bersama-sama penduduk madyan dengan membacakan ayat-ayat kami kepada mereka, sehingga dapat memberitahu penduduk mekah tentang kabar mereka. Engkau tidak tinggal bersama mereka di madyan, akan tetapi kami telah me-ngutus rasul-rasul dan kami beritahukan kepadamu tentang kisah-kisah mereka melalui wahyu."
  }
]