[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, Kami telah menciptakan umat-umat manusia setelah Musa. Lalu mereka hidup sekian lama sehingga melupakan perjanjian dengan Allah dan mereka meninggalkan perintahNya. Dan kamu tidaklah tinggal di kota Madyan untuk membacakan kitab Kami, lalu kamu mengetahui sejarah mereka dan memberitahukan itu (kepada orang lain). Akan tetapi, berita yang kamu bawa tentang Musa itu adalah wahyu dan menjadi saksi pembenar atas risalahmu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "45. Akan tetapi Kami telah mengadakan beberapa umat dan generasi setelah Musa hingga berlalu masa yang panjang dan disibukkan dengan berbagai pekerjaan sehingga mereka lupa terhadap perjanjian dengan Allah. Dan engkau tidak tinggal di negeri Madyan, membacakan ayat-ayat Kami kepada penduduknya, akan tetapi Kami mengutusmu dari sisi Kami, dan Kami wahyukan kepadamu tentang berita Musa dan menetapnya dia di Madyan, lalu engkau menceritakan kepada manusia apa yang telah Allah wahyukan kepadamu tentang hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "45. Hai Rasulullah, Kami telah menciptakan banyak umat antara zaman Nabi Musa dan zamanmu, dan masa yang berlalu sangat panjang sehingga para makhluk melupakan syariat Allah, dan berpaling dan lalai dari perjanjian-Nya. Hai Rasulullah, kamu tidak pernah tinggal bersama penduduk Madyan agar kamu dapat menceritakan kisah Nabi Musa kepada kaummu, akan tetapi Kami mengutusmu dengan wahyu dari Kami, sehingga Kami mengajarimu apa yang kamu dan kaummu tidak ketahui sebelumnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "45. وَلٰكِنَّآ أَنشَأْنَا قُرُونًا (Tetapi Kami telah mengadakan beberapa generasi) Yakni Kami telah menciptakan beberapa umat antara zaman Nabi Musa sampai zamanmu Hai Muhammad. فَتَطَاوَلَ عَلَيْهِمُ الْعُمُرُ ۚ( dan berlalulah atas mereka masa yang panjang) Yakni berlalu masa yang cukup panjang sehingga syariat-syariat dan hukum-hukum agama banyak dirubah dan agama-agama banyak dilupakan sehingga mereka melalaikan perintah Allah dan melupakan perjanjian dengan-Nya. Dalam ayat ini dapat diambil dalil bahwa Allah telah mengambil perjanjian dengan Musa tentang Nabi Muhammad dan keimanan kepadanya. Namun setelah berlalu masa yang panjang dan telah lewat generasi ke generasi selanjutnya, mereka melupakan perjanjian itu dan enggan memenuhinya. وَمَا كُنتَ ثَاوِيًا فِىٓ أَهْلِ مَدْيَنَ(dan tiadalah kamu tinggal bersama-sama penduduk Mad-yan) Yakni kamu tidak bermukim bersama mereka sebagaimana Nabi Musa, yang menjadikanmu dapat menceritakan kisah mereka kepada penduduk kota Makkah dengan kisahmu sendiri. تَتْلُوا۟ عَلَيْهِمْ ءَايٰتِنَا(dengan membacakan ayat-ayat Kami kepada mereka) Yakni untuk membacakan ayat-ayat Kami bagi mereka dan mempelajar ayat-ayat itu agar kamu dapat menceritakannya kepada kaummu di kota Makkah. Pendapat lain mengatakan bahwa ini merupakan awal kalimat, seakan-akan dikatakan kepadanya “lihatlah sekarang dirimu membacakan kepada umatmu.” وَلٰكِنَّا كُنَّا مُرْسِلِينَ(tetapi Kami telah mengutus rasul-rasul) Yakni tetapi Kami telah mengutusmu kepada penduduk Makkah dan Kami turunkan kepadamu kisah-kisah ini; kalaulah bukan karena ini niscaya kamu tidak akan mengetahui kisah-kisah tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "45. Tetapi Kami telah menciptakan beberapa generasi yang berbeda-beda setelah zaman nabi Musa. Berlalulah atas mereka masa yang panjang, masa yang panjang antara zaman nabi Musa AS dan zaman nabi Muhammad SAW. Mereka menyelewangkan janji/ajaran nabi Musa untuk beriman kepada nabi Muhammad SAW. Wahyu dan syariat itu telah diselewengkan. Dan engkau wahai Rasul tidak tinggal bersama-sama penduduk Madyan dengan membacakan ayat-ayat Kami kepada mereka sebagaimana yang telah dilakukan nabi Musa, namun engkau membaca dan mengingatkan ayat Kami kepada penduduk Makkah. Adapun engkau adalah utusan Kami untuk penduduk Makkah. Kami telah wahyukan kepadamu kitab yang menerangkan tentang peristiwa terdahulu, jika tidak begitu maka engkau tidak akan tahu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Akan tetapi Kami telah menciptakan} menciptakan {beberapa umat} beberapa umat setelah Musa {dan telah berlalu atas mereka masa yang panjang} telah berlalu atas mereka zaman yang lama sehingga mereka melupakan perjanjian itu dan tidak mau memenuhinya {Kamu juga tidak tinggal} tinggal {bersama penduduk Madyan, (sehingga) membacakan ayat-ayat Kami kepada mereka. Akan tetapi Kamilah yang mengutus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "45. “Tetapi Kami telah mengadakan beberapa generasi, lalu berlalulah atas mereka masa yang panjang” sehingga ilmu menjadi punah dan ayat-ayatNya dilupakan, lalu Kami mengutusmu pada waktu yang mana kebutuhan kepadamu sangat penting dan kepada syariat yang Kami ajarkan dan Kami wahyukan kepadamu juga sangat dibutuhkan, “dan tiadalah kamu tinggal,” bermukim “bersama-sama penduduk Madyan dengan membacakan ayat-ayat Kami kepada mereka.” Maksudnya, kamu ajarkan kepada mereka dan kamu belajar kepada mereka sehingga kamu dapat memberitakan sesuatu yang telah kamu beritakan tentang perihal Musa di Madyan, “tetapi Kami telah mengutus rasul-rasul.” Maksudnya, akan tetapi kabar (berita) yang kamu bawa tentang Musa ini adalah merupakan satu imbas dari imbas-imbas pengutusan dari Kami untukmu dan wahyu yang kamu sama sekali tidak bisa mengetahuinya tanpa pengutusan risalah dari Kami."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 45: Ketahuilah wahai Nabi Allah, bahwasanya Allah menghendaki sesudah Musa umat-umat yang panjang umurnya; Kemudian lupa akan perjanjian Musa dan dari mempelajari syariat-syariatnya serta karena sebab terputusnya wahyu. Kemudian Allah datangkan engkau dan menjadikan engkau utusan Allah, dan dikabarkan kepadamu tentang Musa dan selainnya. Yang bersamaan dengan itu, engkau tidak dijadikan penduduk dari Madyan sehingga engkau membacakan kitab (taurat) dan mengetahui secara langsung kisah Musa, akan tetapi engkau adalah utusan (rasul) yang diwahyukan padamu berita akan rasul-rasul sebelummu, agar Allah menjadikan kokoh hatimu, dan juga sebagai persaksian atas kerisalahanmu serta menjadi pelajaran bagi mereka yang mengambil pelajaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Nabi Musa ‘alaihis salam. Pesan dan perjanjian sudah dilupakan, pengetahuan agama semakin pudar dan wahyu telah terputus, maka Allah mengutus Nabi Muhammad shallallahu 'alaihi wa sallam sebagai rasul serta mewahyukan kepada Beliau berita tentang Nabi Musa dan lainnya. Sehingga engkau mengetahui kisah mereka, lalu menyampaikannya. Maksudnya, berita yang engkau bawa baik tentang Nabi Musa maupun tentang umat-umat terdahulu adalah atsar (hasil) dari pengutusan Kami kepadamu dan wahyu yang tidak ada jalan bagimu untuk mengetahuinya jika Kami tidak mengutusmu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 45",
    "description": "Engkau tidak mengalami peristiwa-peristiwa itu, tetapi kami telah menciptakan beberapa umat dalam berbagai generasi setelah nabi musa, dan telah berlalu atas mereka masa yang panjang, sehingga mereka lupa dengan perjanjian yang telah mereka ambil dan meninggalkan perintah Allah. Kami utus engkau untuk memperbaharui kembali dakwah yang pernah disampaikan oleh nabi-nabi terdahulu. Dan demikian pula engkau wahai nabi Muhammad tidak tinggal bersama-sama penduduk madyan dengan membacakan ayat-ayat kami kepada mereka, sehingga dapat memberitahu penduduk mekah tentang kabar mereka. Engkau tidak tinggal bersama mereka di madyan, akan tetapi kami telah me-ngutus rasul-rasul dan kami beritahukan kepadamu tentang kisah-kisah mereka melalui wahyu. 46. Dan engkau wahai nabi Muhammad tidak berada di dekat gunung ''r di sinai ketika kami menyeru nabi musa dan memilihnya untuk menyampaikan pesan-pesan suci. Tetapi kami utus engkau sebagai rahmat dari tuhanmu, agar engkau memberi peringatan kepada kaum masyarakat arab yang tidak didatangi oleh pemberi peringatan dalam kurun waktu yang cukup lama sebelum engkau, agar dengan peringatanmu itu mereka mendapat pelajaran."
  }
]