[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu (wahai Rasul) juga tidak berda di sisi Gunung Thursina ketika Kami menyeru Musa dan kamu juga tidak menyaksikan apa pun dari kejadian itu sehingga kamu menjadi tahu sendiri. Akan tetapi, Kami mengutusmu sebagai rahmat dari sisi Tuhanmu, agar kamu memperingatkan kaum yang belum pernah di datangi seorang pemberi peringatan (rasul) sebelummu, supaya mereka ingat akan kebaikan yang kamu bawa lalu mereka melaksanakannya, dan keburukan yang kamu larang darinya sehingga mereka menjauhinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "46. Dan tidaklah engkau berada di samping lereng gunung tatkala Kami menyeru Musa dan mewahyukan kepadanya apa yang Kami wahyukan hingga engkau bisa menceritakan tentang hal itu, akan tetapi Kami mengutusmu sebagai rahmat dari Rabbmu atas manusia. Lalu Kami wahyukan kepadamu cerita tentang hal itu agar engkau memberi peringatan kepada kaum yang belum pernah datang kepada mereka sebelummu seorang Rasul pun yang mengingatkan mereka, agar mereka mengambil pelajaran dan beriman terhadap ajaran yang engkau bawa kepada mereka dari sisi Allah -Subḥānahu-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "46. Hai Rasulullah, dan kamu tidak berada di sisi barat gunung Thur, ketika Kami menyeru Musa untuk pertemuan dengan Kami, dan Kami turunkan lauh-lauh yang berisi Taurat kepadanya; sedangkan kamu tidak menyaksikan kejadian itu sedikitpun sehingga kamu dapat mengetahui, akan tetapi Kami mengutusmu sebagai rahmat dan petunjuk dari Tuhanmu, agar kamu memberi peringatan bagi menduduk Makkah dan sekitarnya karena tidak ada yang memberi mereka peringatan sebelumnya sehingga kesesatan merajalela di sana. Semoga mereka menerima kebaikan yang kamu datangkan dan mengamalkannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "46. وَمَا كُنتَ بِجَانِبِ الطُّورِ إِذْ نَادَيْنَا (Dan tiadalah kamu berada di dekat gunung Thur ketika Kami menyeru (Musa)) Yakni dan kamu juga hai Muhammad, tidak berada di sisi gunung yang disebut dengan Thur, ketika Kami menyeru kepada Musa. وَلٰكِن رَّحْمَةً مِّن رَّبِّكَ(tetapi (Kami beritahukan itu kepadamu) sebagai rahmat dari Tuhanmu) Yakni akan tetapi Kami wahyukan kepdamu al-Qur’an, dan Kami ceritakan kepadamu kisah Musa dan firman Allah kepadanya, ini merupakan rahmat dari tuhanmu. لِتُنذِرَ قَوْمًا مَّآ أَتَىٰهُم مِّن نَّذِيرٍ مِّن قَبْلِكَ(supaya kamu memberi peringatan kepada kaum (Quraisy) yang sekali-kali belum datang kepada mereka pemberi peringatan sebelum kamu) Yang dimaksud dengan kaum disini adalah penduduk Makkah; mereka belum pernah didatangkan seorang pemberi peringatan sebelumnya. لَعَلَّهُمْ يَتَذَكَّرُونَ(agar mereka ingat) Yakni agar mereka mengambil pelajaran dari peringatanmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "46. Engkau juga tidak berada di dekat gunung Thur ketika Kami menyeru Musa, tetapi Kami beritahukan itu kepadamu sebagai rahmat dari Tuhanmu. Supaya engkau memberi peringatan kepada kaum Quraisy dan lainnya. Belum ada atau belum pernah datang seorang pemberi peringatan sebelum kamu kepada mereka, agar mereka bisa mengambil pelajaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu juga tidak di dekat gunung} gunung {ketika Kami memanggil. Akan tetapi (kamu tahu) karena rahmat dari Tuhanmu agar kamu memberi peringatan kepada kaum yang belum didatangi oleh seorang pemberi peringatan sebelum kamu agar mereka mendapat pelajaran"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "46. “Dan tiadalah kamu berada di dekat gunung Thur ketika Kami menyeru” Musa dan ketika Kami memerintahnya pergi mendatangi kaum yang zhalim dan menyampaikan risalah Kami kepada mereka serta memperlihatkan kepada mereka mukjizat-mukjizat dan keajaiban-keajaiban Kami yang telah Kami ceritakan kepadamu itu. Yang dimaksud adalah bahwa perisiwa-peristiwa yang telah terjadi pada Nabi Musa di beberapa tempat tersebut, lalu kamu menveritakannya sebagaimana adanya tanpa menambah atau menguranginya adalah tidak lepas dari dua hal. Yang pdertama: Kamu telah mengahadirinya dan menyaksikannya, atau kamu telah pergi ke tempatnya lalu kamu mempelajarinya dari penduduk negeri itu, maka pada saat itu bisa jadi (kabar peristiwa itu) tidak menunjukkan padamu bahwa kamu adalah utusan Allah. Sebab perkara-perkara yang diberitakan berdasarkan kesaksian dan penelitian termasuk perkara-perkara umum yang tidak khusus bagi para nabi saja. Akan tetapi itu semua sudah diketahui dan sudah diyakini bahwasanya ia tidak pernah ada dan tidak pernah terjadi. Jadi, para pendukungmu dan para musuhmu mengetahui ketiadaannya. Maka sudah pasti yang kedua ini, yaitu bahwa berita ini datang kepadamu dari Allah, wahyuNya serta pengangkatan rasul. Maka dapat dibuktikan dengan dalil yang pasti akan kebenaran kerasulanmu dan rahmat Allah kepada manusia melaluimu. Maka dari itu Dia berfirman, “Tetapi (Kami beritahukan itu kepadamu) sebagai rahmat dari Rabbmu, supaya kamu memberi peringatan kepada kaum yang sekali-kali belum datang kepada mereka pemberi peringatan sebelum kamu.” Maksudnya, kaum Arab dan suku Quraisy. Sebab kerasulan itu tidak diketahui oleh mereka pada saat diutusnya seorang Rasul dan jauh berabad-abad sebelumnya, “agar mereka mempelajari” rincian kebaikan kemudian mengerjakannya, dan keburukan lalu mereka meninggalkannya. Apabila kedudukanmu seperti ini, maka kewajiban mereka adalah segera beriman kepadamu dan mensyukuri nikmat yang tidak ternilai harganya ini dan tidak akan terpenuhi kesyukurannya. Penyampaian peringatan Muhammad kepada orang-orang Arab itu sama sekali tidak menafikan keberadaannya sebagai utusan kepada selain mereka. Karena sesungguhnya dia adalah orang Arab, dan orang pertama yang langsung beliau dakwahi adalah orang-orang Arab, sehingga kerasulan beliau pada asalnya untuk mereka dan untuk selain mereka selanjutnya, sebagaimana ditegaskan oleh Allah, \"Patutkah menjadi keheranan bagi manusia bahwa Kami mewahyukan kepada seorang laki-laki di antara mereka\"(Yunus:2) dan \"Katakanlah: \"Hai manusia sesungguhnya aku adalah utusan Allah kepadamu semua,\" (Al-A’raf:158)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 46: Allah mengabarkan kepada Nabi-Nya Muhammad ﷺ bahwasanya Ia dekat dari gunung thur ketika Allah menyeru Musa dan berbicara dengannya. Dan sungguh (Muhammad) tidak melihat dengan rinci akan kisah yang Allah kisahkan, akan tetapi Allah mengisahkan dan mengabarkan kisah tersebut. Allah mengutusnya (Muhammad) dengan rahmat-Nya untuk memberi kabar (peringatan) kepada kaumnya dengan menyebutkan kisah Musa tersebut. Dan tidaklah Muhammad hanyalah datang sebagai pemberi peringatan sebagaimana utusan sebelumnya, semoga mereka mengingat dan mengagungkan Allah dengan adanya peringatan tersebut."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni ketika Allah memerintahkannya untuk mendatangi orang-orang yang zalim (Fir’aun dan kaumnya) dan menyampaikan kepada mereka risalah-Nya serta memperlihatkan ayat-ayat-Nya. Kesimpulannya adalah, bahwa peristiwa yang dialami Nabi Musa ‘alaihis salam di beberapa tempat yang dikisahkan-Nya itu tidak lepas dari dua kemungkinan: (1) Beliau (Nabi Muhammad shallallahu 'alaihi wa sallam) hadir dan menyaksikan lalu Beliau mempelajarinya dari mereka. Jika seperti ini, maka berarti Beliau bukan utusan Allah, karena perkara yang disampaikan dari hasil penelitian adalah perkara yang di sana ikut serta pula yang lain (tidak hanya para nabi saja, yang lain pun bisa). Akan tetapi, mereka (orang-orang kafir) sudah mengetahui, bahwa tidak mungkin seperti itu, karena Beliau tidak sezaman dengan mereka, maka sudah pasti yang benar adalah kemungkinan kedua; (2) Bahwa berita tersebut datang dari sisi Allah berupa wahyu karena Beliau adalah utusan Allah. Dengan demikian, jelaslah bahwa Muhammad shallallahu 'alaihi wa sallam adalah seorang rasul dan kita semua menjadi saksi terhadapnya, sekaligus sebagai rahmat Allah bagi hamba-hamba Allah. Yakni mereka dapat mengetahui kebaikan secara lebih rinci sehingga mereka dapat mengerjakannya, serta mengetahui lebih rinci keburukan, sehingga mereka dapat meninggalkannya. Jika Beliau seperti ini kedudukannya, maka yang wajib dilakukan mereka adalah segera beriman dan mensyukuri nikmat yang besar ini. Perlu diketahui, bahwa peringatan Beliau kepada orang-orang Arab tidak berarti khusus kepada mereka tidak kepada selain mereka, bahkan risalah Beliau untuk semua manusia; bangsa Arab maupun ‘Ajam (non Arab). Tertuju pertama kali kepada orang Arab adalah karena Beliau adalah orang Arab, Al Qur’an yang diturunkan kepada Beliau berbahasa Arab dan orang yang pertama kali mendapatkan dakwah Beliau adalah orang-orang Arab. Oleh karena itu, risalah Beliau kepada orang-orang Arab adalah sebagai asalnya, sedangkan selain mereka mengikuti. Hal ini berdasarkan firman Allah Ta’ala, “Katakanlah, \"Wahai manusia! Sesungguhnya aku adalah utusan Allah kepadamu semua,…dst.” (Terj. Al A’raaf: 158)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 46",
    "description": "Dan engkau wahai nabi Muhammad tidak berada di dekat gunung ''r di sinai ketika kami menyeru nabi musa dan memilihnya untuk menyampaikan pesan-pesan suci. Tetapi kami utus engkau sebagai rahmat dari tuhanmu, agar engkau memberi peringatan kepada kaum masyarakat arab yang tidak didatangi oleh pemberi peringatan dalam kurun waktu yang cukup lama sebelum engkau, agar dengan peringatanmu itu mereka mendapat pelajaran. 47. Dan agar mereka tidak mengatakan ketika azab menimpa mereka yang sebenarnya bukan kami penyebabnya, tetapi disebabkan apa yang me-reka kerjakan, 'ya tuhan kami, mengapa engkau tidak mengutus seorang rasul yang memberi tuntunan dan peringatan kepada kami, agar kami mengikuti ayat-ayat engkau dan termasuk orang mukmin. ' agar mereka tidak beralasan demikian, kami utus engkau kepada mereka dan kepada alam semesta sebagai pembawa berita gembira dan peringatan dari tuhan."
  }
]