[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan supaya ketika siksaan menimpa orang-orang kafir itu dikarenakan kekafiran mereka terhadap Tuhan mereka, mereka tidak mengatakan, “Wahai Tuhan Kami, mengapa Engkau tidak mengutus kepada kami seorang rasul sebelumnya lalu kami akan mengikuti ayat-ayatMu yang diturunkan di dalam kitabMu dan kami menjadi orang-orang yang beriman kepadamu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "47. Dan agar mereka tidak berkata -tatkala mereka mendapat hukuman ilahiyah karena kekufuran dan kemaksiatan yang mereka kerjakan- dengan beralasan tidak ada seorang Rasul pun yang diutus kepada mereka, “Kenapa Engkau tidak mengutus kepada kami seorang rasul sehingga kami mengikuti ayat-ayat-Mu dan menjalankannya serta kami menjadi orang-orang beriman yang menjalankan perintah-perintah Rabb mereka.” Kalau bukan karena hal itu, niscaya Kami segerakan hukuman atas mereka, akan tetapi Kami menunda hukuman tersebut dari mereka hingga kami memutus alasan mereka dengan mengirim seorang Rasul kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "47. Hai Rasulullah, kalaulah bukan karena musibah mereka disebabkan kesyirikan dan dosa-dosa yang mereka lakukan dan kemudian mereka berkata: “Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami agar kami hidup di atas petunjuk ayat-ayat-Mu dan menjadi orang-orang yang beriman kepadanya”; niscaya Kami tidak akan mengutusmu kepada mereka, Kami mengutusmu agar mereka tidak lagi beralasan. Seandainya Kami mengazab mereka, niscaya mereka akan berkata: “Allah tidak mengutus seorang rasulpun kepada kami.” Dan mereka mengira itu dapat menjadi alasan bagi mereka, akan tetapi mereka tidak lagi memiliki alasan karena Kami telah menegakkan hujjah dengan mengutusmu kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "47. وَلَوْلَآ أَن تُصِيبَهُم مُّصِيبَةٌۢ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَيَقُولُوا۟ رَبَّنَا لَوْلَآ أَرْسَلْتَ إِلَيْنَا رَسُولًا (Dan agar mereka tidak mengatakan ketika azab menimpa mereka disebabkan apa yang mereka kerjakan: “Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami) Yakni mengapa Engkau tidak mengutus seorang Rasul dari sisi-Mu untuk mengabarkan kepada kami apa yang Engkau perintahkan bagi kami. فَنَتَّبِعَ ءَايٰتِكَ(lalu kami mengikuti ayat-ayat Engkau) Yakni ayat-ayat yang diturunkan dengan jelas. وَنَكُونَ مِنَ الْمُؤْمِنِينَ (dan jadilah kami termasuk orang-orang beriman) Yakni beriman kepada ayat-ayat itu. Makna ayat ini adalah seandainya Aku mengazab mereka sebelum Aku mengutusmu niscaya mereka akan berkata: zaman pengutusan para Rasul telah lama berlalu, dan Allah tidak pernah mengutus kepada kami seorang Rasul.” Mereka mengira itu adalah alasan bagi mereka, namun Kami sempurnakan hujjah atas mereka dan Kami hilangkan alasan mereka dengan pengutusanmu kepada mereka hai Muhammad."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "47. Jika kaummu tidak ditunjukkan kepada suatu musibah seperti azab dunia dan akhirat, sehingga ketika azab menimpa mereka disebabkan apa yang telah mereka kerjakan, mereka tidak akan mengatakan: \"Ya Tuhan kami, mengapa Engkau tidak mengutus seorang rasul kepada kami, lalu kami mengikuti ayat-ayat Engkau dan jadilah kami termasuk orang-orang mukmin\". Jika bukan karena itu Kami tidak akan mengutusmu sebagai Rasul untuk menunjukkan hujjah kepada mereka. Maksudnya bahwa pengutusan nabi dan semua rasul sebelumnya adalah untuk menampik hujjah mereka untuk tidak mengutus rasul sebagai pembawa peringatan. Kata lau la adalah berfungsi menunjukkan kecondongan untuk mendapatkan sesuatu yang terkandung dalam kalimat sesudahnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Seandainya saja mereka ditimpa musibah} hukuman {karena apa yang dikerjakan tangan mereka, maka mereka tidak berkata,“Ya Tuhan kami, mengapa tidak} mengapa tidak {Engkau utus seorang rasul kepada kami agar kami mengikuti ayat-ayatMu dan termasuk orang-orang mukmin”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "47. “Kalau saja mereka tidak ditimpa azab disebabkan apa yang mereka kerjakan,” yaitu kekafiran dan berbagai maksiat, tentu mereka mengatakan, “Ya Rabb kami, mengapa Engkau tidak mengutus seorang rasul kepada kami, lalu kami mengikuti ayat-ayatMu dan jadilah kami termasuk orang-orang Mukmin,” maka dari itu Kami mengutusmu wahai Muhammad, untuk menolak alasan mereka dan memotong perkataan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 47: Allah berkata kepada kaum musyrik arab (quraisy) : Sekiranya keadaan mereka (tetap demikian), akan turun musibah berupa adzab, sebagai hukuman yang disebabkan atas penyimpangan mereka dari kesyirikan, kekafiran dan keangkuhan yang mereka lakukan, mereka suatu saat akan berkata : Wahai Rabb kami kalau sekiranya engkau turunkan utusan kepada kami sebelumnya, maka kami akan mengikuti ayat-ayat-Mu dengan jujur membenarkan utusan-Mu dan kami akan menjadi orang-orang yang beriman dengan ayat-ayat tersebut dan dengan yang datang (perintah maupun larangan) darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Berupa kekafiran dan kemaksiatan. Yakni, oleh karena itulah Kami mengutus engkau wahai Muhammad untuk menyingkirkan hujjah mereka dan agar mereka tidak berbicara seperti itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 47",
    "description": "Dan agar mereka tidak mengatakan ketika azab menimpa mereka yang sebenarnya bukan kami penyebabnya, tetapi disebabkan apa yang me-reka kerjakan, 'ya tuhan kami, mengapa engkau tidak mengutus seorang rasul yang memberi tuntunan dan peringatan kepada kami, agar kami mengikuti ayat-ayat engkau dan termasuk orang mukmin. ' agar mereka tidak beralasan demikian, kami utus engkau kepada mereka dan kepada alam semesta sebagai pembawa berita gembira dan peringatan dari tuhan. 48. Maka ketika rasulullah telah datang kepada mereka dengan membawa kebenaran yang sempurna berupa Al-Qur'an yang berasal dari sisi kami, dengan nada ingkar mereka berkata, 'mengapa tidak diberikan kepadanya, yakni nabi Muhammad, bukti kebenaran risalah dalam bentuk mukjizat inderawi dan kitab suci yang diturunkan sekaligus seperti apa yang telah diberikan kepada musa dahulu, misalnya tongkat yang berubah menjadi ular, atau tangan yang tampak bersinar cemerlang dan lain-lain'' mereka, yakni kaum musyrik mekah, berkata demikian padahal bukankah sebelumnya mereka itu telah ingkar juga kepada apa yang diberikan kepada musa dahulu' mereka dahulu berkata, 'nabi musa dan nabi harun adalah dua pesihir yang bantu-membantu dan saling benar-membenarkan. ' dan mereka juga berkata, 'sesungguhnya kami sama sekali tidak mempercayai masing-masing mereka itu. '."
  }
]