[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka ketika Muhammad datang kepada orang-orang itu sebagai pemberi peringatan bagi mereka, mereka mengatakan, “Mengapa orang yang di utus kepada kami tidak diberikan kepadanya apa yang diberikan kepada Musa berupa mukjizat-mukjizat yang dapat dilihat oleh mata dan satu kitab yang turun sekaligus?” katakanlah (wahai rasul) kepada mereka, “Bukankah kaum Yahudi telah kafir kepada apa yang dibawa Musa sebelumnya? Dan mereka berkata tentang Taurat dan al-Qur’an, ‘Dua sumber sihir yang saling mendukung dalam pengaruh sihirnya’, dan mereka berkata, ‘Kami kafir terhadap keduanya’?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "48. Maka tatkala datang kepada mereka Muhammad dengan risalah dari Rabbnya, mereka berkata, “Kenapa Muhammad tidak diberi mukjizat seperti mukjizat-mukjizat yang diberikan kepada Musa yang menunjukkan bahwa dia adalah utusan dari Rabbnya, seperti tangan dan tongkat.” Katakan -wahai Rasul- sebagai jawaban kepada mereka, “Bukankah Yahudi telah mengingkari apa yang diberikan kepada Musa sebelumnya, dan mereka berkata sebagaimana disebutkan dalam Taurat dan Al-Qur`ān, 'Keduanya adalah sihir yang saling menguatkan.' Dan berkata, \"Sesungguhnya kami ingkar terhadap Taurat maupun Al-Qur`ān.\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "48. Ketika Kami mengutus Nabi Muhammad kepada orang-orang musyrik Makkah dengan membawa kebenaran yang jelas, mereka berkata: “Mengapa Allah tidak memberinya seperti apa yang telah diberikan kepada Musa berupa mukjizat-mukjizat yang dapat disaksikan dan kitab yang diturunkan sekaligus.” Mereka membuat-buat alasan ketika Rasul Kami datang membawa petunjuk kepada mereka. Maka Allah membantah mereka: “Orang-orang musyrik Makkah telah ingkar terhadap mukjizat-mukjizat Musa sebagaimana mereka mengingkari ayat-ayat Muhammad, dan mereka berkata, ‘Musa dan Muhammad saling bantu membantu untuk mendatangkan sihir, dan kami mengingkari mereka berdua’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "48. فَلَمَّا جَآءَهُمُ الْحَقُّ مِنْ عِندِنَا قَالُوا۟ لَوْلَآ أُوتِىَ مِثْلَ مَآ أُوتِىَ مُوسَىٰٓ ۚ (Maka tatkala datang kepada mereka kebenaran dari sisi Kami, mereka berkata: “Mengapakah tidak diberikan kepadanya (Muhammad) seperti yang telah diberikan kepada Musa dahulu?”) Yakni ketika kebenaran datang kepada para penduduk Makkah dengan diutusnya Muhammad dan diturunkannya al-Qur’an, mereka berkata dengan penuh kedurhakaan mereka: “mengapa Rasul itu tidak diberi mukjizat seperti mukjizat yang diberikan kepada Musa yang diantaranya adalah kitab Taurat yang diturunkan kepadanya lengkap sekaligus.” Maka Allah membantah mereka dengan firman-Nya: أَوَلَمْ يَكْفُرُوا۟ بِمَآ أُوتِىَ مُوسَىٰ مِن قَبْلُ ۖ( Dan bukankah mereka itu telah ingkar (juga) kepada apa yang telah diberikan kepada Musa dahulu?) Yakni orang-orang kafir Quraish telah ingkar terhadap mukjizat-mukjizat Musa sebagaimana telah ingkar pula terhadap mukjizat-mukjizat Muhammad. قَالُوا۟ سِحْرَانِ تَظٰهَرَا(mereka dahulu telah berkata: “Musa dan Harun adalah dua ahli sihir yang bantu membantu”) Yakni saling membantu dalam kebohongan. وَقَالُوٓا۟ إِنَّا بِكُلٍّ كٰفِرُونَ (Dan mereka (juga) berkata: “Sesungguhnya kami tidak mempercayai masing-masing mereka itu”) Yakni tidak percaya kepada Taurat dan al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "48. Maka tatkala kebenaran dari sisi Kami sampai kepada penduduk Makkah yaitu berupa diutusnya nabi Muhammad SAW, serta Alquran yang diturunkan kepadanya lantas mereka berkata: \"Mengapa gerangan Muhammad tidak diberi sesuatu seperti apa yang telah diberikan kepada Musa dahulu? Yaitu Taurat yang diberikan secara langsung sekaligus?\". Allah menjawab: “Bukankah mereka itu telah ingkar juga kepada apa yang telah diberikan kepada Musa dahulu sebagaimana mereka ingkar kepada apa yang telah Kami turunkan kepada nabi Muhammad?”; ketika Yahudi bertanya tentang Muhammad dengan perkataan: “Sesungguhnya kami telah mendapati penjelasan sifat dan gambaran tentang Muhammad.” Atas apa yang mereka temukan pada Taurat dan Alquran mereka berkata: \"Musa dan Muhammad adalah dua ahli sihir yang saling bantu, mereka saling membenarkan satu sama lain.” Dan mereka juga berkata: \"Sesungguhnya kami tidak mempercayai kedua utusan dan kedua kitab itu, yaitu Musa dan Muhammad\""
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika telah datang kepada mereka kebenaran dari sisi Kami, mereka berkata,“Mengapa tidak} mengapa tidak{diberikan kepadanya (sesuatu) seperti apa yang telah diberikan kepada Musa” Bukankah mereka itu telah mengingkar apa yang diberikan kepada Musa sebelumnya. Mereka berkata,“dua (kitab) sihir yang saling menguatkan”} mereka berkata Taurat dan Al-Qur’an adalah dua kitab sihir yang saling mendukung satu sama lain {Mereka berkata, “Sesungguhnya kami mengingkari masing-masing dari keduanya”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "48. “Maka tatkala datang kepada mereka kebenaran,” yang tidak ada keraguan di dalamnya “dari sisi Kami” yaitu al-Quran yang telah Kami wahyukan kepadamu, “mereka berkata” seraya mendustakanya dan menolak dengan suatu yang tidak bisa dijadikan sebagai paham penolakan, “Mengapakah tidak diberikan kepadanya (Muhammad) seperti yang telah diberikan kepada Musa dahulu.” Maksudnya, diturunkan kepadanya sebuah kitab dari langit sekaligus. Artinya : selagi ia diturunkan secara berserakan, maka itu berarti bukan dari Allah. Dalil apa dalam hal ini? Syubhat apa yang membuktikan bahwa ia bukan dari Allah ketika diturunkan secara terpisah-pisah? Bahkan di antara kesempurnaan al-Quran ini dan perhatian Allah kepada orang yang al-Quran diturunkan kepadanya adalah penurunan al-Quran secara terpisah-pisah (bertujuan) untuk meneguhkan hati RasulNya dengan cara itu, dan untuk terjadinya penambahan iman bagi orang-orang yang beriman, \"Tidaklah orang-orang kafir itu datang kepadamu (membawa) sesuatu yang ganjil, melainkan Kami datangkan kepadamu suatu yang benar dan yang paling baik penjelasannya.\" (Al-Furqan:33). Dan juga, sesungguhnya analogi mereka kepada kitab Nabi Musa adalah analogi yang sudah mereka rusak sendiri. Lalu bagaimana bisa mereka menganalogikannya kepada kitab yang telah mereka ingkari dan tidak mereka yakini? Maka dari itu Allah berfirman, “Dan bukankah mereka itu telah ingkar (juga) kepada Kitab yang diberikan kepada Musa dahulu; mereka dahulu telah berkata, ‘Dua ahli sihir yang bantu membantu’.” Maksudnya, al-Quran dan Taurat saling bantu-membantu di dalam sihirnya dan di dalam menyesatkan manusia. “Dan mereka (juga) berkata, ‘Sesungguhnya kami tidak mempercayai masing-masing mereka itu’.” Dengan demikian terbuktilah bahwa mereka hendak membatalkan kebenaran dengan sesuatu yang tidak bisa dijadikan argument, dan hendak merusaknya dengan sesuatu yang tidak bisa dirusak, mereka mengucapkan perkataan-perkataan yang kontradiksi. Itutlah kebiasaan setiap orang kafir. Maka dari itu Allah menegaskan bahwa mereka kafir kepada dua kitab dan dua rasul tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 48: Akan tetapi ketika telah datang utusan ﷺ kepada mereka dengan sebenar-benarnya dari sisi Allah, mereka pura-pura ling-lung dan berkata sembari plin-plan : Tidakkah kami menginginkan apa yang ada pada Muhammad, akan tetapi kami menginginkan apa yang ada di sisi Muhammad berupa mukjizat yang dapat dilihat, dan satu kitab yang secara langsung turun (tanpa berangsur-angsur)!. Maka katakanlah wahai Nabi Allah kepada mereka orang-orang musyrik : Apakah ayat-ayat Musa menjadikan kalian beriman kepada Musa atau menjadikan engkau tetap beriman kepada fir’aun dan kaumnya ?! Bukankah kalian kufur atas apa yang diberikan kepada fir’aun ?! Kemudian orang-orang musyrik berkata : Sesungguhnya Al Qur’an dan Taurat yang datang kepada Muhammad dan Musa adalah kedua sihir yang saling tolong menolong dalam kesesatan; Kemudian mereka berkata : Kami, dengan apa yang datang kepada Muhammad dan Musa kufur (menolak); Mereka adalah para pengingkar Nabi Allah atas apa yang diturunkan kepada keduanya (mereka) tidak beriman. Hal ini adalah kejelasan bahwa mereka tidak menginginkan kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mendustakan sambil memprotesnya. Seperti tangannya yang bercahaya, tongkatnya yang berubah menjadi ular, dan lain-lain. Bisa juga maksudnya, mengapa tidak diturunkan kepada Muhammad shallallahu 'alaihi wa sallam kitab secara sekaligus sebagaimana kitab Taurat yang diturunkan secara sekaligus kepada Musa ‘alaihis salam. Padahal termasuk kesempurnaan Al Qur’an ini dan perhatian Allah kepada orang yang diturunkan Al Qur’an kepadanya adalah diturunkan-Nya kitab itu secara berangsur-angsur untuk meneguhkan hati rasul-Nya dan menambah keimanan orang-orang mukmin. Pengqiyasan mereka terhadap Al Qur’an dengan kitab Taurat adalah qiyas yang mereka batalkan sendiri, karena mereka mengqiyaskan dengan kitab yang mereka sendiri mengingkarinya dan tidak beriman. Oleh karena itulah, Allah Subhaanahu wa Ta'aala berfirman, “Bukankah mereka itu telah ingkar (juga) kepada apa yang diberikan kepada Musa dahulu?” Yakni Al Qur’an dan Taurat. Dalam sihirnya dan dalam menyesatkan manusia. Dari sini diketahui, bahwa maksud mereka tidak lain hanyalah untuk membatalkan yang hak dengan sesuatu yang bukan merupakan alasan, mereka juga hendak membatalkan dengan sesuatu yang sebenarnya tidak dapat membatalkan, ucapan mereka saling berlawanan dan bertentangan, dan seperti inilah keadaan semua orang kafir tanpa terkecuali. Oleh karena itulah, ditegaskan bahwa mereka kafir kepada dua kitab (Taurat dan Al Qur’an) dan dua rasul itu (Musa dan Muhammad ‘alaihimash shalaatu was salaam). Di samping itu, kekekafiran mereka kepada keduanya bukanlah karena hendak mencari yang hak dan memilih yang terbaik, akan tetapi karena mengikuti hawa nafsu sebagaimana diterangkan dalam ayat selanjutnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 48",
    "description": "Maka ketika rasulullah telah datang kepada mereka dengan membawa kebenaran yang sempurna berupa Al-Qur'an yang berasal dari sisi kami, dengan nada ingkar mereka berkata, 'mengapa tidak diberikan kepadanya, yakni nabi Muhammad, bukti kebenaran risalah dalam bentuk mukjizat inderawi dan kitab suci yang diturunkan sekaligus seperti apa yang telah diberikan kepada musa dahulu, misalnya tongkat yang berubah menjadi ular, atau tangan yang tampak bersinar cemerlang dan lain-lain'' mereka, yakni kaum musyrik mekah, berkata demikian padahal bukankah sebelumnya mereka itu telah ingkar juga kepada apa yang diberikan kepada musa dahulu' mereka dahulu berkata, 'nabi musa dan nabi harun adalah dua pesihir yang bantu-membantu dan saling benar-membenarkan. ' dan mereka juga berkata, 'sesungguhnya kami sama sekali tidak mempercayai masing-masing mereka itu. '49. Untuk menyanggah argumentasi mereka, Allah perintahkan kepada rasul-Nya, katakanlah kepada mereka wahai nabi Muhammad, 'apabila kamu tidak beriman kepada taurat dan Al-Qur'an, datangkanlah olehmu, secara sendiri-sendiri atau bersama-sama, sebuah kitab dari sisi Allah yang kitab itu lebih memberi petunjuk daripada kedua-Nya, yakni taurat dan Al-Qur'an, atau yang semisal dengannya, niscaya aku akan mengikutinya. Lakukanlah jika kamu memang orang yang benar dalam prasangka kamu bahwa apa yang kami datangkan itu adalah sihir. '."
  }
]