[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "katakanlah (wahai Rasul) kepada mereka, “Datangkanlah oleh kalian satu kitab dari sisi Allah yang lebih lurus petunjuknya daripada Taurat dan al-Qur’an, niscaya aku akan mengikutinya, jika kalian adalah orang-orang yang benar dalam pengakuan kalian.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "49. Katakan -wahai Rasul- kepada mereka, “Datangkan suatu kitab yang diturunkan dari Allah yang lebih bisa memberi petunjuk daripada Taurat dan Al-Qur`ān, jika kalian mampu mendatangkannya maka niscaya aku akan mengikutinya, jika kalian memang benar dalam apa yang kalian tuduhkan bahwa Taurat dan Al-Qur`ān adalah sihir.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "49. Jika demikian mereka bersikap terhadap kitab-kitab dan rasul-rasul Allah, maka katakanlah kepada mereka -Hai Rasulullah-: “Mengapa kalian tidak mendatangkan kitab dari Allah yang mengandung hidayah yang mengalahkan apa yang diturunkan kepada Musa dan Muhammad? Jika kalian dapat melakukan ini maka aku akan mengikuti petunjuk kitab itu jika kalian memang benar dalam berkata.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "49. قُلْ فَأْتُوا۟ بِكِتٰبٍ مِّنْ عِندِ اللهِ هُوَ أَهْدَىٰ مِنْهُمَآ (Katakanlah: “Datangkanlah olehmu sebuah kitab dari sisi Allah yang kitab itu lebih (dapat) memberi petunjuk daripada keduanya) Yakni daripada Taurat dan al-Qur’an. إِن كُنتُمْ صٰدِقِينَ (jika kamu sungguh orang-orang yang benar) Yakni jika kalian benar dalam menerangkan dua Rasul atau dua kitab itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "49. Katakanlah wahai Rasul sebagai jawaban atas kekufuran mereka kepada dua kitab ini: \"Maka kalian hadirkan saja sebuah kitab dari sisi Allah yang kitab itu lebih bisa leboih bagus dalam rangka memberi petunjuk daripada Alquran dan Taurat Niscaya aku akan mengikutinya, jika kamu memang orang-orang yang benar atas apa yang kalian katakan\"."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Datangkanlah sebuah kitab dari sisi Allah yang lebih banyak memberi petunjuk daripada keduanya} daripada Taurat dan Al-Qur’an {niscaya aku akan mengikutinya, jika kalian adalah orang-orang yang benar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "49. Akan tetapi, apakah kekafiran mereka kepada keduanya sebagai upaya untuk mencari kebenaran dan mengikuti perintah yang ada pada mereka itu lebih baik daripada keduanya, ataukah hanya sekedar hawa nafsu? Allah berfirman seraya mengharuskan mereka dengan hal itu, “Katakanlah, ‘Datangkanlah olehmu sebuah kitab dari sisi Allah yang kitab itu lebih (dapat) memberi petunjuk daripada keduanya’,” maksudnya, daripada Taurat dan al-Quran “niscaya aku mengikutinya, jika kamu sungguh orang-orang yang benar,” tidak ada jalan bagi mereka dan bagi selain mereka untuk menghadirkan seperti keduanya, karena sesungguhnya dunia ini semenjak diciptakan oleh Allah belum pernah menyaksikan seperti dua kitab ini sebagai ilmu, petunjuk, penjelasan, dan rahmat untuk manusia. Ini merupakan puncak keadilan dari seorang da’i kalau ia mengatakan, “Tujuanku adalah kebenaran, petunjuk dan jalan yang lurus, dan sesungguhnya aku datang kepada kalian dengan membawa kitab yang mencakup hal-hal itu semua yang sejalan dengan kitab Nabi Musa; maka kita semua wajib mematuhi dan mengikuti keduanya, karena keduanya sebagai petunjuk dan kebenaran. Jika kalian bisa datang kepadaku dengan satu kitab dari sisi Allah yang lebih baik daripada keduanya, niscaya aku mengikutinya, namun jika tidak, maka aku sama sekali tidak akan meninggalkan petunjuk dan kebenaran yang telah aku ketahui disebabkan sesuatu yang bukan petunjuk dan kebenaran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 49: Allah memerintahkan Nabi-Nya Muhammad ﷺ agar memerintahkan kepada kaumnya, agar mereka mendatangkan Al Kitab (pemberi petunjuk) dan sebaik-baik (kitab) yaitu Al Qur’an yang mulia dan lebih afdhal dari Taurat. Di mana mereka (orang-orang musyrik) sebelumnya telah berjanji untuk beriman kepada Taurat, namun apabila mereka jujur dari klaim mereka, akan tetapi jauh dari klaim mereka. Maksudnya adalah :dalam memahami dan mengikuti Al Qur’an."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini merupakan sikap inshaf yang sempurna, yaitu mengikuti yang terbaik. Namun ternyata tidak ada kitab yang lebih baik daripada keduanya, sehingga ia tidak mengikuti selainnya. Sudah pasti, tidak ada jalan bagi mereka dan selain mereka untuk mendatangkan yang semisal dengan Al Qur’an, karena tidak ada satu pun kitab yang muncul ke dunia yang lebih hebat daripada keduanya, baik pengetahuannya, petunjuknya, penjelasannya dan rahmatnya bagi makhluk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 49",
    "description": "Untuk menyanggah argumentasi mereka, Allah perintahkan kepada rasul-Nya, katakanlah kepada mereka wahai nabi Muhammad, 'apabila kamu tidak beriman kepada taurat dan Al-Qur'an, datangkanlah olehmu, secara sendiri-sendiri atau bersama-sama, sebuah kitab dari sisi Allah yang kitab itu lebih memberi petunjuk daripada kedua-Nya, yakni taurat dan Al-Qur'an, atau yang semisal dengannya, niscaya aku akan mengikutinya. Lakukanlah jika kamu memang orang yang benar dalam prasangka kamu bahwa apa yang kami datangkan itu adalah sihir. '50. Sudah barang tentu mereka tidak akan mampu mendatangkannya. Maka jika mereka tidak mampu menjawab tantanganmu untuk mendatangkan kitab berisi petunjuk yang lebih baik daripada al-qur`an, bahkan yang semisal dengannya, atau jika mereka tidak menyambut ajakanmu untuk beriman, maka ketahuilah wahai nabi Muhammad atau siapa pun, bahwa mereka tidak lagi memiliki dalih atau alasan penolakan. Dan dengan begitu, jika mereka tetap menolak, maka se-sungguhnya mereka hanyalah mengikuti keinginan hawa nafsu mereka tanpa alasan yang kuat dan benar, dan dengan demikian mereka pada hakikatnya tidak memperoleh petunjuk, bahkan mereka adalah orang-orang yang sesat. Dan siapakah yang lebih sesat daripada orang yang mengikuti keinginan hawa nafsunya tanpa mendapat petunjuk dari Allah sedikit pun dan tanpa memiliki pijakan yang logis' pastilah tidak ada yang lebih sesat daripada mereka. Sungguh, Allah tidak memberi petunjuk kepada orang-orang yang zalim yang melampaui batas-batas yang telah ditentukan oleh Allah."
  }
]