[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami berkehendak untuk mencurahkan karunia Kami kepada orang-orang yang ditindas Fir’aun di muka bumi dan Kami jadikan mereka sebagai para pemimpin dalam kebaikan dan penyeru kepadanya, dan Kami jadikan mereka orang-orang yang mewarisi tanah (Mesir) setelah kebinasaan Fir’aun dan kaumnya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "5. Kami ingin menganugerahkan kepada Bani Israel yang telah ditindas oleh Fir'aun di negeri Mesir dengan menghancurkan musuh mereka dan menghentikan penindasan atas mereka serta menjadikan mereka sebagai pemimpin-pemimpin yang diikuti dalam kebenaran, dan dengan menjadikan mereka sebagai para pewaris yang mewarisi wilayah Syam yang penuh berkah setelah kebinasaan Fir'aun, sebagaimana Allah -Ta'ālā- berfirman, \"Dan Kami wariskan kepada kaum yang telah ditindas itu negeri-negeri bahagian baratnya yang telah Kami beri berkah padanya...\""
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "5. Dengan keagungan dan kekuasaan Kami, Kami hendak memberi orang-orang yang ditindas dan dizalimi Fir’aun di negeri Mesir, dia memberi mereka berbagai macam siksaan dan hinaan. Kami juga hendak memberi karunia kepada mereka dengan membebaskan mereka dari perbudakan dan kehinaan agar mereka mendapatkan kekuatan, sehingga mereka dapat menjadi teladan dalam kebaikan dan petunjuk; dan mereka telah mendapatkannya pada waktu yang lama, Allah telah mewariskan kepada mereka negeri Mesir dan memberi mereka kekuasaan yang luas."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "5. وَنُرِيدُ أَن نَّمُنَّ عَلَى الَّذِينَ اسْتُضْعِفُوا۟ فِى الْأَرْضِ (Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi (Mesir)) Yakni Kami menghendaki dengan pengaturan Kami yang sempurna untuk memberi karunia bagi mereka setelah mereka tertindas, oleh sebab itu Allah menyiapkan bagi mereka pengutusan Musa sebagai Rasul dan memberinya berbagai mukjizat agar ia dapat membebaskan Bani Israil dari Mesir, serta membinasakan Fir’aun dan bala tentaranya sebagaimana yang akan dijelaskan dengan lebih terperinci. وَنَجْعَلَهُمْ أَئِمَّةً(dan hendak menjadikan mereka pemimpin) Yakni menjadi pemimpin dan penyeru kepada kebaikan serta penguasa atas orang lain. وَنَجْعَلَهُمُ الْوٰرِثِينَ(dan menjadikan mereka orang-orang yang mewarisi (bumi)) Yakni mewarisi tanah suci Baitul Maqdis, sebagaimana disebutkan dalam firman Allah: وأورثنا القوم الذين كانوا يستضعفون مشارق الأرض ومغاربها التي باركنا فيها “Dan Kami pusakakan kepada kaum yang telah ditindas itu, negeri-negeri bahagian timur bumi dan bahagian baratnya yang telah Kami beri berkah padanya.” (al-A’raf: 137)"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "5. Kami hendak memberi karunia kepada orang-orang Mesir yang tertindas itu. Kami juga hendak menjadikan mereka pemimpin dan penuntun kepada kebaikan. Serta Kami akan menjadikan mereka orang-orang yang mewarisi tanah yang suci yaitu Baitul Muqaddas, serta mewarisi kerajaan, kekuatan dan pemerintahan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami berkehendak untuk memberi karunia} memberi nikmat dan kelebihan {kepada orang-orang yang tertindas di bumi itu, menjadikan mereka para pemimpin} pemimpin yang diarahkan dalam kebaikan {dan menjadikan mereka orang-orang yang mewarisi} yang memiliki tanah Fir’aun dan kerajaannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "5. “Dan Kami hendak memberi karunia kepada orang-orang yang tertindas di bumi,” dengan cara Kami menghilangkan dari mereka materi-materi penindasan, dan membinasakan orang yang melawan mereka dan menelantarkan orang yang memerangi mereka, “dan hendak menjadikan mereka pemimpin,” di dalam agama. Hal ini tentu tidak akan bisa diraih kalau mereka masih tertindas. Maka harus ada keteguhan kekuasaan dan power yang sempurna di bumi ini, “dan mejadikan mereka orang-orang yang mewarisi,” bumi ini, yaitu orang-orang yang memiliki kesudahan yang baik (kemenangan) di dunia sebelum akhirat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 5: Allah mengabarkan bahwa Dia membinasakan fir’aun yang berlebihan, yang dzalim karena sebab akan mengkaruniakan (kepada penduduk mesir) yang ditindas dan dihinakan fir’aun dari kalangan bani israil. Allah hendak jadikan mereka pemimpin dan raja yang baik, dan menjadikan mereka pewaris di muka bumi setelah kebinasaan fir’aun (thagut) yang buruk dan kaumnya yang dzalim. Inilah keinginan Allah, Allah jadikan fir’aun dan istrinya pengasuh Musa sampai pada usia baligh yang berkuasa dan memerangi bangsa qibthi, kemudian memerangi madyan, karena takut akan tuntutan madya atas darah qibthi, di mana Musa bertemu dengan seorang laki-laki shalih yang dikatakan namanya adalah Syuaib, Syuaib memperkerjakan dan menikahkan anak perempuannya dengan Musa. Kemudian Musa kembali menuju mesir menjadi Nabi dan Rasul yang menyeru fir’aun kepada tauhid sampai akhir dari kehidupan yang telah dikenal dari kisah kematian fir’aun."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dalam kebaikan, dan hal ini tidak mungkin tercapai jika kondisinya lemah, bahkan mereka perlu diberi keteguhan di bumi serta diberikan kemampuan yang sempurna. Maksudnya, negeri Syam, Mesir dan negeri-negeri sekitarnya yang pernah dikuasai Fir'aun. Setelah kerajaannya runtuh, negeri-negeri tersebut diwarisi Bani Israil. Mereka memperoleh akibat yang baik di dunia sebelum di akhirat nanti."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 5",
    "description": "Penindasan dan pembunuhan anak-anak lelaki yang dilakukan fir'aun itu adalah guna mempertahankan kekuasaan-Nya, dan kami di masa mendatang hendak memberi karunia kepada orang-orang yang tertindas di bumi mesir itu, yakni bani israil, dan hendak menjadikan mereka pemimpin yang diteladani dalam segala hal, dan menjadikan mereka orang-orang yang mewarisi kekuasaan dan harta benda di dunia yang serupa atau melebihi apa yang dimiliki oleh fir'aun. 6. Dan selain itu kami juga akan teguhkan kedudukan mereka di muka bumi dengan mengutus dua orang nabi dari kalangan mereka, yaitu nabi musa dan nabi harun, untuk membimbing mereka, dan kami perlihatkan kepada fir'aun dan haman bersama bala tentaranya dan para pendukung mereka berdua apa yang selalu mereka takutkan dari mereka. Fir'aun selalu takut bahwa kerajaannya akan dihancurkan oleh bani israil, dan akan terusir dari negeri mesir, karena itu dia membunuh anak-anak laki-laki yang lahir di kalangan bani lsrail. Apa yang ditakutkannya itu sungguh akan terjadi."
  }
]