[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka jika mereka tidak menyambut seruan dakwahmu dengan membawa kitab, dan tidak ada hujjah apa pun yang tersisa lagi bagi mereka, maka ketahuilah sesunggguhnya mereka hanyalah mengikuti hawa nafsu mereka belaka. Dan tidak ada orang yang lebih besar kesesatannya daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah. Sesungguhnya Allah tidak memberikan taufik untuk berada di atas kebenaran kepada kaum yang berbuat zhalim yang melanggar perintah Allah dan telah melampaui batas-batas ketetapanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "50. Jika mereka tidak mampu menjawab tantanganmu untuk mendatangkan suatu kitab yang lebih ampuh memberi petunjuk dibandingkan Taurat dan Al-Qur`ān, maka bisa dipastikan bahwa pendustaan mereka terhadap Taurat dan Al-Qur`ān tidak berdasarkan dalil, akan tetapi didasari oleh hawa nafsu, dan tidak ada seorangpun yang lebih sesat daripada orang yang mengikuti hawa nafsunya tanpa petunjuk dari Allah -Subḥānahu-. Sesungguhnya Allah tidak memberikan hidayah dan petunjuk kepada kaum yang zalim terhadap diri mereka sendiri dengan pengingkaran terhadap Allah dan permusuhan terhadap Rasul-Nya serta menghadapkan kebenaran yang datang kepada mereka dari Allah dengan kebatilan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "50. Jika mereka menutup telinga dan buta terhadap seruanmu serta tidak mampu melakukan tantanganmu, maka yakinlah mereka adalah kaum yang hanya mengikuti hawa nafsu mereka dan menutup penglihatan mereka dari cahaya Taurat dan al-Qur’an. Dan tidak ada orang yang lebih sesat daripada orang yang rela menjadi orang yang jauh dari petunjuk Allah Yang Maha Mengetahui. Sungguh Allah tidak memberi petunjuk kepada kebenaran bagi orang yang menyelisihi perintah-Nya dan senantiasa dalam kezaliman dan kesesatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "50. فَإِن لَّمْ يَسْتَجِيبُوا۟ لَكَ (Maka jika mereka tidak menjawab (tantanganmu)) Yakni jika mereka tidak menjalankan apa yang telah kamu perintahkan kepada mereka berupa mendatangkan kitab dari Tuhan yang lebih dapat memberi petunjuk daripada Taurat dan al-Qur’an. Pendapat lain mengatakan maknanya adalah jika mereka tidak menyambutmu dengan beriman kepada apa yang kau datangkan. فَاعْلَمْ أَنَّمَا يَتَّبِعُونَ أَهْوَآءَهُمْ ۚ( ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu mereka) Yakni pendapat-pendapat mereka yang sesat dan sangkaan-sangkaan palsu mereka, yang tidak dilandasi dengan hujjah dan bukti. وَمَنْ أَضَلُّ مِمَّنِ اتَّبَعَ هَوَىٰهُ بِغَيْرِ هُدًى مِّنَ اللهِ ۚ( Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikitpun) Yakni tidak ada orang yang lebih sesat darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "50. Maka jika mereka tidak menjawab tantanganmu atau tidak bisa melakukannya, serta tidak beriman kepada wahyu yang telah diberikan kepadamu, maka ketahuilah wahai Rasul bahwa sesungguhnya mereka hanya mengikuti hawa nafsu mereka saja. Nafsu adalah kesenangan atau kecondongan yang tanpa dasar. Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya tanpa mendapat petunjuk dari Allah sedikitpun? Maksudnya adalah tidak ada yang lebih sesat daripada mereka. Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zalim kepada diri mereka sendiri dalam kekufuran dan berlarut-larut di dalam kekufuran itu."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika mereka tidak menjawab, maka ketahuilah bahwa mereka hanya mengikuti hawa nafsu mereka. Siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya tanpa petunjuk dari Allah. Sesungguhnya Allah tidak memberi petunjuk kepada kaum yang zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "50. “Maka jika mereka tidak menjawab (tantangan) mu,” kemudian mereka tidak mampu mendatangkan satu kitab yang lebih lurus (utama) daripada Taurat dan al-quran, “maka ketahuilah bahwa mereka hanyalah mengikuti hawa nafsu mereka belaka,” maksudnya, maka ketahuilah bahwa sesungguhnya mereka tidak mau mengikutimu bukan berarti mereka pergi kepada suatu kebenaran yang mereka ketahui atau kepada suatu petunjuk, karena sesungguhnya hal itu hanyalah menuruti hawa nafsu mereka. “Dan siapakah yang lebih sesat daripada orang yang mengikuti hawa nafsunya dengan tidak mendapat petunjuk dari Allah sedikit pun.” Jadi, dia adalah orang yang paling sesat, karena ketika ditawarkan kepadanya petunjuk dan jalan yang lurus yang dapat mengantarkan kepada Allah dan kepada negeri kemuliaanNya (surge), dia tidak menghiraukannya dan tidak pula mendatanginya, sedangkan ketika dibujuk oleh hawa nafsunya untuk menelurusi jalan-jalan yang dapat menjerumuskan kepada kebinasaan dan kesengsaraan, maka dia pun mengikutinya dan meninggalkan petunjuk. Maka apakah ada seseorang yang lebih sesat daripada orang yang seperti itu karakternya? Akan tetapi, sesungguhnya kezhalimannya, sikap melampaui batas dan tidak ada kecintaan kepada kebenaran ittulah yang sebenarnya telah membuatnya tetap berada pada kesesatannya dan tidak diberi petunjuk oleh Allah. Maka dari itu Dia berfirman, “Sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang zhalim.” Yaitu orang-orang yang kezhaliman telah menjadi karakternya, sikap keras kepala telah menjadi sifatnya. Petunjuk telah datang kepada mereka namun mereka menolaknya. Hawa nafsu menawarkan diri kepada mereka lalu mereka mengikutinya. Mereka telah menutup rapat pintu-pintu dan jalan-jalan hidayah terhadap diri mereka, dan mereka membuka pintu-pintu dan jalan-jalan kesesatan untuk mereka. Maka mereka terombang-ambing di dalam kesesatan dan kezhaliman, dan mereka terseret-seret dalam kesengsaraan dan kebinasaan. Dan pada FirmanNya, “Maka jika mereka tidak menjawab (tantanganmu) ketahuilah bahwa sesungguhnya mereka hanyalah mengikuti hawa nafsu,” ini sebuah dalil yang menunjukkan kepada (bukti) bahwa setiap orang yang tidak memenuhi seruan rasul dan beralih kepada ajaran yang bertentangan dengan ajaran Rasul itu, maka sesungguhnya dia tidak beralih kepada petunjuk, melainkan beralih kepada hawa nafsu."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 50: Maka jika mereka tidak mampu memenuhi tuntutanmu wahai Nabi Allah untuk mendatangkan seutama-utama dari Al Qur’an; Ketahuilah wahai Nabi Allah bahwasanya mereka mengikuti hawa nasfu mereka, dan tidaklah ada yang lebih sesat dari yang mengikuti hawa nafsunya sendiri serta berjalan dengan tanpa hidayah dari Allah dibelakangnya. Sungguh Allah tidak memberi petunjuk, tidak juga hidayah dan tidak meridhai bagi kaum yang dzalim dan pendusta akan syariat-syariat Allah dan yang mereka mengikuti hawa nafsu mereka. Ayat ini menunjukkan atas siapa yang mengikuti hawa nafsu, tidaklah tercela jika memang tidak menyelisih syariat Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bahwa mereka tidak mengikutimu bukan karena mencari yang hak dan hidayah, tetapi sekedar menuruti hawa nafsu. Maksudnya, tidak ada yang lebih sesat. Orang yang seperti ini termasuk orang yang paling sesat, ketika disodorkan petunjuk dan jalan yang lurus yang menyampaikan kepada Allah dan surga-Nya, tetapi ia tidak mempedulikannya dan tidak mendatanginya, bahkan hawa nafsunya mengajak dirinya untuk menempuh jalan yang mengarah kepada kebinasaan dan kesengsaraan, dirinya pun mengikuti dan meninggalkan petunjuk. Siapakah yang lebih sesat daripada orang yang seperti ini sifatnya? Kezaliman, sikap melampaui batas dan tidak menyukai kebaikan membuatnya ingin tetap di atas kesesatannya dan Allah tidak menunjuki orang yang seperti ini. Oleh karena itulah, Allah Subhaanahu wa Ta'aala menerangkan, bahwa Dia tidak akan memberi petunjuk kepada orang-orang zalim, yaitu mereka yang sudah melekat dengan kezaliman dan sikap membangkang, ketika kebenaran datang, ia malah menolaknya dan ketika disodorkan hawa nafsu, ia malah mengikutinya. Mereka telah menutup untuk diri mereka pintu-pintu hidayah dan jalannya serta membuka pintu-pintu kesesatan dan jalannya. Oleh karena itu, mereka bingung dalam kesesatannya dan terombang-ambing dalam kesengsaraannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 50",
    "description": "Sudah barang tentu mereka tidak akan mampu mendatangkannya. Maka jika mereka tidak mampu menjawab tantanganmu untuk mendatangkan kitab berisi petunjuk yang lebih baik daripada al-qur`an, bahkan yang semisal dengannya, atau jika mereka tidak menyambut ajakanmu untuk beriman, maka ketahuilah wahai nabi Muhammad atau siapa pun, bahwa mereka tidak lagi memiliki dalih atau alasan penolakan. Dan dengan begitu, jika mereka tetap menolak, maka se-sungguhnya mereka hanyalah mengikuti keinginan hawa nafsu mereka tanpa alasan yang kuat dan benar, dan dengan demikian mereka pada hakikatnya tidak memperoleh petunjuk, bahkan mereka adalah orang-orang yang sesat. Dan siapakah yang lebih sesat daripada orang yang mengikuti keinginan hawa nafsunya tanpa mendapat petunjuk dari Allah sedikit pun dan tanpa memiliki pijakan yang logis' pastilah tidak ada yang lebih sesat daripada mereka. Sungguh, Allah tidak memberi petunjuk kepada orang-orang yang zalim yang melampaui batas-batas yang telah ditentukan oleh Allah. 51. Dan demi keagungan dan kekuasaan kami, sungguh, kami telah menyampaikan perkataan ini, yaitu Al-Qur'an kepada mereka secara berkesinambungan. Sebagian turun menyusul yang lain, sesuai kebutuhan. Al-qur'an juga diturunkan secara berturut-turut dalam bentuk janji, ancaman, kisah-kisah dan pelajaran-pelajaran, semua itu agar mereka selalu mengingatnya, merenungi dan mempercayai apa yang ada di dalamnya."
  }
]