[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Kami telah menguraikan dengan rinci dan menerangkan al-Qur’an sebagai rahmat bagi kaummu, wahai Rasul, mudah-mudahan mereka mau mengingat-ingat dan mengambil pelajaran darinya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "51. Kami telah menyampaikan kepada orang-orang musyrik dan orang-orang Yahudi dari Bani Israel cerita tentang umat-umat terdahulu dan hukuman yang Kami timpakan kepada mereka tatkala mereka mendustakan para Rasul Kami dengan harapan mereka bisa mengambil pelajaran dari hal itu lalu mereka beriman sehingga tidak ditimpa apa yang telah menimpa umat-umat terdahulu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "51. Kami menurunkan al-Qur’an secara berangsur-angsur, bukan turun semuanya sekaligus; kandungannya tersusun antara ajakan, ancaman, kisah-kisah, dan hukum-hukum, sehingga jadilah firman yang mengandung mukjizat. Semoga mereka mentadabburi maknanya sehingga menjadi sebab hidayah bagi mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "51. وَلَقَدْ وَصَّلْنَا لَهُمُ الْقَوْلَ (Dan sesungguhnya telah Kami turunkan berturut-turut perkataan ini (Al Quran) kepada mereka) Yakni Kami menurunkannya berturut-turut dan Kami utus satu Rasul setelah Rasul yang lain dan setiap Rasul itu saling membenarkan rasul-rasul sebelumnya. لَعَلَّهُمْ يَتَذَكَّرُونَ(agar mereka mendapat pelajaran) Karena takut akan diturunkan azab sebagaimana azab yang diturunkan kepada orang-orang sebelum mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "51. Sungguh Kami menurunkan Al-Qur’an secara berturut-turut supaya isinya saling berhubungan. Dan Kami mengutus satu per satu rasul kepada manusia. Barangkali mereka mau mengambil pelajaran, lalu beriman dan taat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh Kami telah merincikan} merincikan dan menjelaskan {perkataan itu kepada mereka} Al-Qur’an {agar mereka mengingat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "51. “Dan sesungguhnya telah Kami turunkan berturut-turut perkataan ini kepada mereka.” Maksudnya, Kami telah mengangsurnya, meneruskannya dan menurunkannya sedikit demi sedikit sebagai rahmat (kasih sayang) dan anugerah kepada mereka “agar mereka mendapat pelajaran,” ketika ayat-ayatNya berulang-ulang (datang) kepada mereka, penjelasan-penjelasannya diturunkan kepada mereka saat dibutuhkan. Sehingga turunnya secara berangsur-angsur itu menjadi rahmat bagi mereka, lalu kenapa mereka menolak apa yang sebenarnya menjadi maslahat mereka sendiri?"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 51: Kemudian Allah menegaskan dan menetapkan bahwa Dia menurunkan ayat-ayat Al Qur’an ini dengan berangsur-angsur, dan dijelaskan bahwasanya di dalam (Al Qur’an) terdapat penjelasan atas umat-umat yang telah lalu, kemudian Nabi menyampaikan dan membacakan kepada kaumnya, (dan) semoga mereka berpikir, mentadabburi dan mengambil pelajaran darinya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ibnu Jarir berkata: Telah menceritakan kepadaku Bisyr bin Adam, ia berkata: Telah menceritakan kepada kami ‘Affan bin Muslim, ia berkata: Telah menceritakan kepada kami Hammad bin Salamah, ia berkata: Telah menceritakan kepada kami ‘Amr bin Dinar dari Yahya bin Ja’dah (dari Rifa’ah Al Qurazhi), ia berkata: Ayat ini turun berkenaan dengan sepuluh orang, dan saya salah satunya, “Dan sungguh, Kami telah menyampaikan perkataan ini (Al Quran) kepada mereka agar mereka selalu mengingatnya.” (Hadits ini diriwayatkan pula oleh Thabrani juz 5 hal. 46 dan 47. Haitsami berkata dalam Majma’uzzawa’id juz 7 hal. 88, “Diriwayatkan oleh Thabrani dengan dua isnad; salah satunya bersambung dan para perawinya tsiqah, yaitu hadits ini, sedangkan hadts yang lain terputus.”) Allah Subhaanahu wa Ta'aala menyampaikan Al Qur’an dan menurunkannya secara berangsur-angsur karena rahmat dan kelembutan-Nya, di mana di antara faedahnya adalah agar dapat dipahami dengan baik. Yaitu karena ayat-ayat-Nya diulang dan penjelasannya turun saat dubutuhkan. Oleh karena itulah, turunnya secara berangsur-angsur adalah rahmat bagi mereka, sehingga tidak pantas bagi mereka memprotes sesuatu yang maslahatnya untuk mereka.. Beberapa faedah dan pelajaran yang dapat diambil dari kisah Nabi Musa dengan Fir’aun di atas 1. Hanya orang-orang mukmin saja yang dapat mengambil pelajaran dari ayat-ayat Allah dan peristiwa-peristiwa yang diberlakukan-Nya terhadap umat-umat terdahulu yang kafir. Semakin tinggi imannya, maka semakin bertambah pula pengambilan ‘ibrah (pelajaran)nya, dan bahwa Allah hanyalah mengarahkan kisah untuk mereka. Adapun selain mereka, maka Allah tidak peduli terhadapnya, dan lagi ayat-ayat-Nya tidak menjadi cahaya dan petunjuk bagi mereka. 2. Allah Subhaanahu wa Ta'aala apabila menginginkan terjadinya sesuatu, maka Dia siapkan sebab-sebabnya dan memberlakukannya sedikit demi sedikit dan bertahap; tidak sekaligus. 3. Kaum yang tertindas, meskipun sangat tertindas sekali tidak patut baginya bersikap lemah dari menuntut haknya dan berputus asa untuk bangkit kepada yang lebih tinggi, terlebih apabila mereka terzalimi sebagaimana Allah Subhaanahu wa Ta'aala menyelamatkan Bani Israil kaum yang ditindas oleh Fir’aun dan para pemukanya, lalu Allah Subhaanahu wa Ta'aala memberikan kedudukan kepada mereka di bumi serta menjadikan mereka berkuasa. 4. Suatu umat selama dalam keadaan tertindas; maka mereka tidak mampu menuntut haknya, tidak mampu menegakkan perkara agamanya maupun dunianya serta tidak memiliki kepemimpinan. 5. Kelembutan Allah Subhaanahu wa Ta'aala terhadap ibu Nabi Musa ‘alaihis salam, peringanan-Nya terhadap musibah yang menimpanya dengan kabar gembira, yakni bahwa Allah akan mengembalikan kepadanya anaknya dan menjadikannya termasuk rasul. 6. Allah Subhaanahu wa Ta'aala menakdirkan untuk hamba-Nya sebagian kesusahan agar dia memperoleh kegembiraan yang lebih besar dari itu atau terhindar dari keburukan yang lebih besar dari itu, sebagaimana Dia menakdirkan kepada ibu Nabi Musa ‘alaihis salam kesedihan yang berat itu, namun menjadi sarana agar anaknya kembali kepadanya dengan cara yang membuat tenang jiwanya, sejuk penglihatannya dan bertambah gembira. 7. Rasa takut secara tabi’at tidaklah menafikan keimanan, sebagaimana yang terjadi pada ibu Nabi Musa dan Musa ‘alaihis salam itu sendiri. 8. Iman dapat bertambah dan berkurang, dan termasuk hal yang menambahkan keimanan dan memperkuat keyakinan adalah bersabar ketika menghadapi sesuatu yang mencemaskan dan peneguhan dari Allah ketika kondisi seperti itu, sebagaimana firman Allah Ta’ala, “Seandainya tidak Kami teguhkan hatinya, agar dia termasuk orang-orang yang beriman,” yakni agar bertambah keimanannya dan tenteram hatinya. 9. Termasuk nikmat yang paling besar dari Allah kepada hamba-Nya adalah peneguhan Allah kepadanya dan penjagaan-Nya terhadap hatinya ketika terjadi hal yang mengkhawatirkan dan ketika menghadapi peristiwa yang menegangkan, karena dengan begitu ia dapat berbicara tepat dan berbuat bijak, berbeda dengan keadaaan ketika ia sedang risau, takut dan gelisah, maka pikirannya menjadi hilang, konsentrasinya menjadi kacau dsb. 10. Seorang hamba, jika mengetahui bahwa qadha’ dan qadar serta janji Allah pasti terlaksana, maka ia tidak meremehkan dalam mengerjakan sebab, dan hal itu (mengerjakan sebab) tidaklah menafikan keimanannya kepada berita Allah. Hal itu, karena Allah telah berjanji kepada ibu Nabi Musa ‘alaihis salam untuk mengembalikan kepadanya anaknya. Meskipun ia yakin terhadap janji Allah tersebut, namun ia tetap berusaha agar anaknya kembali, sampai-sampai ia mengutus saudara Musa untuk menelusuri anaknya. 11. Bolehnya seorang wanita untuk keluar memenuhi kebutuhannya dan berbicara dengan laki-laki selama sesuai dengan norma-norma syari’at dan tidak ada kekhawatiran timbulnya fitnah sebagaimana yang terjadi pada saudari Musa dan dua wanita penduduk Madyan yang berbicara dengan Nabi Musa ‘alaihis salam. 12. Bolehnya mengambil upah terhadap kafalah (menanggung) dan radhaa’ (penyusuan) serta menunjukkan orang yang siap melakukannya. 13. Termasuk rahmat Allah kepada hamba-Nya yang lemah yang hendak dimuliakan-Nya adalah Dia memperlihatkan di antara ayat-ayat-Nya dan bukti-bukti-Nya yang membuat imannya bertambah, sebagaimana Allah mengembalikan Musa kepada ibunya agar ibunya mengetahui bahwa janji Allah adalah benar. 14. Membunuh orang kafir yang mempunyai ikatan baik dengan ‘akad maupun dengan ‘uruf (adat yang berlaku) adalah tidak boleh, karena Nabi Musa ‘alaihis salam menganggap pembunuhannya terhadap orang Qibthi yang kafir sebagai dosa dan Beliau meminta ampunan kepada Allah dari dosa itu. 15. Orang yang membunuh jiwa dengan tanpa hak, tergolong orang yang sewenang-wenang yang hendak mengadakan kerusakan di bumi. 16. Pemberitahuan orang lain kepada seseorang mengenai keadaan orang tersebut dengan maksud agar ia berhati-hati terhadap suatu bahaya yang mungkin sekali terjadi, tidaklah termasuk namimah (adu domba), bahkan terkadang menjadi wajib, sebagaimana pemberitahuan seseorang yang datang dari ujung kota kepada Musa menasihatinya agar segera meninggalkan kota tersebut. 17. Jika seseorang takut dibunuh atau dibinasakan jika tetap tinggal di suatu tempat, maka janganlah ia tetap di sana, karena sama saja menjatuhkan dirinya ke jurang kebinasaan. 18. Ketika dua mafsadat berhadapan, maka dilakukan mafsadat yang lebih ringan. 19. Seorang peneliti dalam suatu ilmu ketika perlu menyampaikan dan tidak ada salah satu di antara dua pendapat yang rajih baginya, maka ia meminta petunjuk kepada Tuhannya serta meminta agar ditunjuki kepada yang lebih tepat di antara dua pendapat itu setelah hatinya bermaksud mencari yang hak, karena sesungguhnya Allah tidak akan mengecewakan orang yang seperti ini keadaannya. 20. Sayang kepada makhluk dan berbuat ihsan kepada orang yang dia kenal dan yang tidak dia kenal termasuk akhlak para nabi, dan termasuk ihsan adalah memberi minum hewan ternak dan membantu orang yang tidak mampu. 21. Dianjurkan ketika berdoa menerangkan keadaan dirinya meskipun Allah sudah mengetahuinya, karena Allah Subhaanahu wa Ta'aala senang kepada permohonan yang sungguh-sungguh dari hamba-Nya dan menampakkan kehinaan dirinya. 22. Malu termasuk akhlak yang terpuji, terlebih dari orang-orang yang mulia. 23. Membalas kebaikan orang lain adalah kebiasaan baik yang dilakukan dari sejak dahulu. 24. Seorang hamba apabila melakukan suatu amal karena Allah, lalu mendapatkan imbalan, maka tidaklah tercela. Sebagaimana yang dilakukan Nabi Musa ‘alaihis salam ketika Beliau menerima balasan dari orang tua negeri Madyan tersebut, di mana Beliau tidak memintanya dan hatinya pun tidak menginginkan imbalan. 25. Disyariatkannya ijarah (menyewa atau mengupah), dan bahwa ijarah bisa berlaku dalam hal menggembala kambing dan sebagainya dari orang yang tidak mampu bekerja, selanjutnya dikembalikan kepada uruf (kebiasaan). 26. Boleh menyewa dengan memberikan manfaat, meskipun manfaatnya adalah bisa menikah. 27. Pilihan seorang untuk puterinya laki-laki yang dia pilih tidaklah tercela. 28. Sebaik-baik pekerja adalah orang yang kuat lagi terpercaya. 29. Termasuk akhlak yang mulia adalah seseorang berbuat ihsan kepada karyawan dan pembantunya serta tidak memberatkan pekerjaannya. 30. Bolehnya melakukan ‘akad ijarah dan lainnya tanpa menghadirkan saksi berdasarkan firman ayat, “Dan Allah menjadi saksi terhadap apa yang kita ucapkan.” 31. Termasuk hukuman paling besar adalah ketika seseorang menjadi pemimpin dalam keburukan dan kesesatan, dan hal itu tergantung sejauh mana penentangannya terhadap ayat-ayat Allah Subhaanahu wa Ta'aala, sebagaimana termasuk nikmat yang paling besar yang diberikan Allah kepada hamba-Nya adalah dijadikan-Nya sebagai pemimpin kebaikan, yang memberi petunjuk lagi mendapat petunjuk. 32. Dalam kisah tersebut tedapat bukti kenabian dan kerasulan Muhammad shallallahu 'alaihi wa sallam, di samping dalam perintah dan larangan juga terdapat bukti kebenaran Beliau, demikian pula pada kepribadian Beliau (lihat Taisirul Karimir Rahmaan karya Syaikh As Sa’diy rahimahullah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 51",
    "description": "Dan demi keagungan dan kekuasaan kami, sungguh, kami telah menyampaikan perkataan ini, yaitu Al-Qur'an kepada mereka secara berkesinambungan. Sebagian turun menyusul yang lain, sesuai kebutuhan. Al-qur'an juga diturunkan secara berturut-turut dalam bentuk janji, ancaman, kisah-kisah dan pelajaran-pelajaran, semua itu agar mereka selalu mengingatnya, merenungi dan mempercayai apa yang ada di dalamnya. 52. Siapa pun yang membuka mata hati dan pikirannya menyangkut Al-Qur'an tentu dia akan beriman. Buktinya adalah orang-orang yang telah kami berikan kepada mereka al-kitab, yakni taurat dan injil, sebelum datang Al-Qur'an, kemudian beriman kepada kitab tersebut dan membenarkan apa yang ada di dalamnya tentang Muhammad dan kitab sucinya, maka sesungguhnya mereka telah beriman pula kepadanya, yakni Muhammad dan Al-Qur'an."
  }
]