[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang telah Kami berikan kepada mereka al-Kitab sebelum al-Qur’an (yaitu orang-orang Yahudi dan Nasrani yang tidak mengubah ajaran mereka) mereka itu beriman kepada al-Qur’an dan kepada Muhammad"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "52. Orang-orang yang teguh beriman kepada Taurat sebelum diturunkannya Al-Qur`ān, mereka beriman kepada Al-Qur`ān berdasarkan kabar dan kriteria yang mereka dapati di dalam kitab-kitab mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "52. Dan jika ada yang bertanya: “Apakah ada orang yang beriman kepada al-Qur’an sebelum ia diturunkan kepadamu?” Maka jawablah: “Segolongan orang yahudi dan Nasrani yang beriman kepada kitab yang diturunkan kepada mereka sebelum kitab-kitab itu diubah telah beriman kepada al-Qur’an dan kepada rasul yang mendapat wahyu al-Qur’an.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "52. الَّذِينَ ءَاتَيْنٰهُمُ الْكِتٰبَ مِن قَبْلِهِۦ (Orang-orang yang telah Kami datangkan kepada mereka Al Kitab sebelum Al Quran) Yakni sebelum al-Qur’an. هُم بِهِۦ يُؤْمِنُونَ(mereka beriman (pula) dengan Al Quran itu ) Allah mengabarkan bahwa orang-orang yang telah diberikan kitab dan mempercayainya dengan sebenar-benarnya maka mereka akan beriman pula kepada al-Qur’an, mereka adalah sebagian ahli kitab seperti Abdullah bin Salam dan orang-orang lainnya yang beriman dari mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "52. Orang-orang yang Kami beri kitab Tuhan sebelum Al-Qur’an itu membenarkan Al-Qur’an dan nabi Muhammad SAW karena isinya sesuai dengan apa yang terkandung dalam kitab mereka. Di antara mereka itu adalah Abdullah bin Salam dan orang yang masuk Islam melalui dua kitab. Ayat ini diturunkan untuk para ahli kitab yang selalu berada dalam kebenaran sampai Allah mengutus Muhammad SAW kemudian mereka mengimaninya. Di antara mereka adalah Salman Al-Farisi dan Abdullah bin Salam"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang telah Kami beri kitab sebelumnya} sebelum Al-Qur’an {mereka beriman kepadanya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "52. Allah menjelaskan keagungan al-Quran, kejernihan dan kebenarannya, dan bahwa sesungguhnya para ahli ilmu sebenarnya mengetahuinya dan beriman kepadanya, mereka mengakui bahwa al-quran itu haq (benar) seraya berfirman, “Orang-orang yang telah kami datangkan kepada mereka al-Kitab sebelum al-Quran.” Mereka adalah orang-orang ahli Taurat dan Injil yang tidak merubah dan tidak mengganti (Taurat dan Injil), “mereka kepadanya,” maksudnya, kepada al-quran dan nabi yang datang membawanya, “beriman.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 52: Allah menjelaskan bahwa (kepada) mereka yang telah datang satu kitab, yaitu Taurat dan Injil yang mereka adalah yahudi dan nashrani sebelum turunnya Al Qur’an kepada Muhammad ﷺ dan isinya belum diganti dan diselewengkan, maka mereka adalah termasuk orang-orang yang takut akan kedudukan Allah; Mereka akan beriman terhadap Al Qur’an dan Muhammad ﷺ tergantung dari apa yang telah sampai kepada mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini turun berkenaan dengan segolongan orang yang masuk Islam dari kalangan Yahudi (seperti Abdullah bin Salam dan kawan-kawannya) dan Nasrani (yang datang dari Habasyah dan Syam). Ayat ini menerangkan keagungan Al Qur’an dan kebenarannya, di mana orang-orang yang berilmu mengetahuinya dan mengimaninya serta mengakui kebenarannya. Yaitu kitab Taurat dan Injil yang masih murni."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 52",
    "description": "Siapa pun yang membuka mata hati dan pikirannya menyangkut Al-Qur'an tentu dia akan beriman. Buktinya adalah orang-orang yang telah kami berikan kepada mereka al-kitab, yakni taurat dan injil, sebelum datang Al-Qur'an, kemudian beriman kepada kitab tersebut dan membenarkan apa yang ada di dalamnya tentang Muhammad dan kitab sucinya, maka sesungguhnya mereka telah beriman pula kepadanya, yakni Muhammad dan Al-Qur'an. 53. Karena itu mereka menerimanya dengan tulus, dan apabila Al-Qur'an dibacakan kepada mereka, dengan bergegas tanpa banyak berpikir mereka berkata, 'kami telah beriman kepadanya, karena sesungguhnya Al-Qur'an itu adalah suatu kebenaran yang sempurna dari tuhan pemelihara kami. Dan kami telah mengetahui Muhammad dan kitab sucinya sebelum kitab itu diturunkan. Sungguh, sebelumnya kami adalah orang muslim yang tunduk patuh dan berserah diri kepada Allah. '."
  }
]