[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apabila dibacakan al-Qur’an ini kepada orang-orang yang telah Kami berikan kepada mereka al-Kitab, mereka akan mengatakan, “Kami mengimaninya, dan kami mengamalkan kandungannya. Sesungguhnya ia merupakan kebenaran dari Tuhan kami. Sesungguhnya sebelum turunnya al-qur’an, kami adalah orang yang berserah diri dan mengesakan Allah karena agama Allah itu satu, yaitu Islam.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "53. Ketika dibacakan kepada mereka, maka mereka berkata, “Kami beriman kepadanya, sesungguhnya Al-Qur`ān itu adalah benar adanya tidak ada keraguan padanya bahwa ia diturunkan dari Rabb kami. Sesungguhnya sebelum kedatangan Al-Qur`ān ini kami telah beriman kepadanya berdasarkan keimanan kami kepada kitab risalah yang dibawa oleh para Rasul sebelumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "53. Dan jika orang-orang terdahulu yang beriman itu mendengar al-Qur’an dibacakan, maka mereka akan berkata: “Kami beriman kepadanya karena ia mengandung hidayah yang diturunkan Tuhan kami, dan kami beriman kepadanya sebelum ia diturunkan kepada Muhammad, karena agama di sisi Allah hanyalah Islam.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "53. إِنَّهُ الْحَقُّ مِن رَّبِّنَآ (sesungguhnya Al Quran itu adalah suatu kebenaran dari Tuhan kami) Yakni kebenaran yang kami ketahui bahwa itu turun dari Tuhan kami. إِنَّا كُنَّا مِن قَبْلِهِۦ مُسْلِمِينَ(sesungguhnya kami sebelumnya adalah orang-orang yang membenarkan(nya)) Yakni tulus mengesakan Allah. Atau beriman kepada Muhammad dan apa yang dibawanya karena kami mengetahui dia disebutkan dalam Taurat dan Injil, yakni kabar gembira tentang kedatangannya dan ia akan diutus di akhir zaman dan akan diturunkan al-Qur’an kepadanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "53. Ketika dibacakan Al-Qur’an kepada mereka, mereka berkata: “Kami mengimaninya dan kami membenarkan bahwa Al-Qur’an itu adalah kalam Allah SWT dan kebenaran pasti yang kami kenal, yang diturunkan untuk nabi Muhammad SAW. Sesungguhnya kami adalah orang-orang yang ikhlas mengesakan dan beribadah kepada Allah sebelum turunnya Al-Qur’an”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila dibacakan kepada mereka, mereka berkata,“Kami beriman kepadanya. Sesungguhnya (Al-Qur’an) itu adalah suatu kebenaran dari Tuhan kami. Sesungguhnya sebelum ini kami adalah orang-orang muslim”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "53. “Dan apabila dibacakan (al-quran itu) kepada mereka,” mereka mendengarnya dengan baik dan tunduk, dan “mereka berkata, ‘Kami beriman kepadanya, sesungguhnya al-Quran itu adalah suatu kebenaran dari Rabb kami,” karena ia sejalan dengan apa yang diajarkan oleh para rasul, dan sesuai dengan apa yang dijelaskan di dalam kitab-kitab suci (samawi), dan karena ia mencakup berita-berita yang benar, perintah-perintah dan larangan-larangan yang sesuai dengan tujuan hikmah. Merekalah orang-orang yang kesaksiannya berguna dan perkataannya bermanfaat. Sebab mereka tidak mengatakan sesuatu yang mereka katakan melainkan berdasarkan ilmu dan pandangan yang benar, karena mereka adalah orang-orang yang ahli ( banyak pengalaman) dan ahli kitab-kitab (terdahulu), sedangkan, penolakan dan penentangan selain mereka terhadap kebenaran tidak menunjukkan adanya syubhat (kerancuan pemikiran), apalagi berpatok pada hujjah. Sebab mereka, kalau tidak bodoh lagi menentang kebenaran. Allah berfirman, \"Katakanlah: \"Berimanlah kamu kepadanya atau tidak usah beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Qur'an dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud,\" (Al-Isra:107). Dan FirmanNya, “sesungguhnya kami sebelumnya adalah orang-orang [Muslim].” Oleh karena itu kami tetap berpegang teguh kepada iman yang telah dikaruniakan Allah kepada kami, maka kami membenarkan al-Quran ini, kami beriman kepada kitab suci yang pertama dan kitab suci yang terakhir, sedangkan orang-orang selain kami, maka pendustaan mereka terhadap al-Quran ini telah membatalkan iman mereka kepada kitab sebelumnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 53: Allah mengabarkan bahwa jika Al Qur’an dibacakan kepada mereka yang telah datang kitab (Taurat dan Injil yang masih asli tanpa perubahan) kepada mereka (yahudi dan nashrani), mereka berkata : Kami membenarkan Al Qur’an, dan mengamalkan perintah-perintah dan larangan-larangannya di dalamnya, ia adalah kebenaran dari sisi Rabb kami, sungguh kami sebelum diturunkannya Al Qur’an, kami adalah orang yang berserah diri kepada Allah dengan mentauhidkannya dan tunduk dengan ketaatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni maka mereka mendengarkan dan tunduk kepadanya. Karena sejalan dengan yang dibawa para rasul dan sesuai dengan yang disebutkan dalam kitab-kitab, di samping itu beritanya benar, perintah dan larangannya sangat bijaksana. Persaksian dan ucapan mereka ini bermanfaat bagi mereka, karena keluar atas dasar ilmu dan bashirah (mata hati) di mana mereka adalah orang-orang yang adil. Adapun Ahli Kitab yang lain yang menolaknya, maka keadaannya antara jahil (tidak tahu), pura-pura jahil atau menentang yang hak. Oleh karena itulah dalam ayat lain Allah berfirman, “Katakanlah, \"Berimanlah kamu kepadanya atau tidak perlu beriman (sama saja bagi Allah). Sesungguhnya orang-orang yang diberi pengetahuan sebelumnya apabila Al Quran dibacakan kepada mereka, mereka menyungkur atas muka mereka sambil bersujud,” (Terj. Al Israa’: 107) Yakni orang yang mentauhidkan (mengesakan) Allah. Oleh karena itu, Allah meneguhkan kami di atas keimanan sehingga kami benarkan pula Al Qur’an, kami imani kitab sebelumnya dan kitab yang datang sekarang, sedangkan selain kami membatalkan keimanannya kepada kitab sebelumnya karena mendustakan Al Qur’an ini."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 53",
    "description": "Karena itu mereka menerimanya dengan tulus, dan apabila Al-Qur'an dibacakan kepada mereka, dengan bergegas tanpa banyak berpikir mereka berkata, 'kami telah beriman kepadanya, karena sesungguhnya Al-Qur'an itu adalah suatu kebenaran yang sempurna dari tuhan pemelihara kami. Dan kami telah mengetahui Muhammad dan kitab sucinya sebelum kitab itu diturunkan. Sungguh, sebelumnya kami adalah orang muslim yang tunduk patuh dan berserah diri kepada Allah. '54. Orang-orang yang beriman kepada Al-Qur'an dan apa yang diturunkan sebelumnya mereka itu yang sungguh jauh dan tinggi kedudukannya di sisi Allah akan diberi pahala dua kali, yakni berlipat ganda, karena beriman kepada taurat dan Al-Qur'an, disebabkan kesabaran mereka atas penderitaan yang mereka terima demi mempertahankan keimanan dan mengutamakan amal saleh. Dan di antara sifat-sifat mereka adalah mereka menolak kejahatan dengan memberi maaf, bahkan membalasnya dengan amal kebaikan, dan mereka juga adalah para dermawan yang menginfakkan sebagian dari rezeki yang telah kami berikan kepada mereka di jalan kebaikan."
  }
]