[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-55. Orang-orang yang telah disebutkan sifat-sifat (ciri-ciri) nya itu, mereka diberi pahala dua kali atas keimanan mereka terhadap kitab suci mereka dan keimanan mereka terhadap al-Qur’an dengan kesabaran mereka. Dan termasuk karakter mereka, bahwasanya mereka menolak keburukan dengan kebaikan, dan mereka menafkahkan sebagian yang Kami rizkikan kepada meeka di jalan kebaikan dan kebajikan. Apabila mereka mendengar perkataan batil, mereka tidak memfokuskan pendengaran mereka untuk menyimaknya. Mereka berkata, “Bagi kami amal-amal kami dan kami tidak akan membelok darinya. Dan bagi kalian perbuatan-perbuatan kalian dan dosanya menjadi tanggungan kalian sendiri. Kami tidak ingin menyibukkan diri untuk membantah kalian, sedang kalian tidaklah mendengar dari kami kecuali hal-hal baik saja. Kami tidak ingin berkomunikasi kepada kalian atas dasar kebodohan kalian. Sebab sesungguhnya kami tidak ingin jalan orang-orang jahil dan tidak menyukainya.” Ini termasuk kata-kata terbaik yang diucapkan para da’i yang mengajak manusia kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "54. Orang-orang yang disebutkan dengan kriteria tersebut, Allah memberi pahala amal perbuatan mereka dua kali lipat karena kesabaran mereka dalam beriman kepada kitab mereka dan kepada Muhammad -ṣallallāhu 'alaihi wa sallam- tatkala beliau diutus sebagai Rasul, dan mereka menebus dosa-dosa yang pernah mereka kerjakan dengan kebaikan dari amal perbuatan mereka yang saleh serta mereka menafkahkan di jalan kebaikan apa yang Kami rezekikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "54. Orang-orang yang mendapat petunjuk itu layak mendapat kebaikan yang luas, mereka akan mendapat pahala atas keimanan mereka, dan pahala mereka akan dilipatgandakan dua kali lipat karena mereka telah beriman kepada kitab yang diturunkan kepada nabi mereka dan beriman kepada al-Qur’an yang diturunkan kepada Muhammad; mereka juga mendapat pahala atas kesabaran mereka dalam menghadapi musibah dan membalas perbuatan buruk dengan perbuatan baik serta senantiasa menginfakkan harta mereka di jalan Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "54. أُو۟لٰٓئِكَ يُؤْتَوْنَ أَجْرَهُم مَّرَّتَيْنِ (Mereka itu diberi pahala dua kali) Imam bukhari, Muslim dan lainnya mengeluarkan hadits dari Abu Musa al-Anshari, ia berkata, Rasulullah bersabda: “terdapat tiga golongan yang akan mendapat pahala dua kali lipat: yaitu, orang dari ahli kitab yang beriman kepada kitab yang pertama dan kitab setelahnya; seorang lelaki yang memiliki budak wanita, lalu ia memeliharanya dengan baik, kemudian ia memerdekakannya dan menikahinya; serta budak lelaki yang sangat tekut beribadah kepada Tuhannya dan memberi nasehat kepada tuannya.” بِمَا صَبَرُوا۟( disebabkan kesabaran mereka) Yakni karena kesabaran dan keteguhannya di atas keimanan terhadap kitab pertama dan kitab setelahnya serta terhadap Nabi yang pertama dan nabi setelahnya. وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ(dan mereka menolak kejahatan dengan kebaikan) Yakni menyikapi dengan kesabaran dan perkataan yang baik terhadap gangguan yang mereka temui dari kaum mereka yang lain yang belum beriman kepada al-Qur’an. Pendapat lain mengatakan maknanya adalah mengganti kemaksiatan dengan ketaatan. وَمِمَّا رَزَقْنٰهُمْ يُنفِقُونَ(dan sebagian dari apa yang telah Kami rezekikan kepada mereka, mereka nafkahkan) Yakni menafkahkan harta mereka dalam ketaatan dan apa yang diperintahkan oleh syariat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "54. Mereka itu orang-orang yang diberi pahala untuk kedua kalinya karena keimanan mereka kepada dua kitab dan dua rasul, yaitu kitab mereka dan Al-Qur’an, rasul mereka dan Muhammad SAW, sebagai hasil dari kesabaran mereka atas penderitaan yang diterima dari kaum mereka, amal ibadah mereka sesuai dua kitab, dan keimanan mereka kepada dua nabi. Mereka membalas penderitaan yang ditujukan kepada mereka dengan perkataan yang baik atau membalas kemaksiatan dengan ketaatan. Mereka juga menginfakkan harta mereka untuk mencari ridha Allah SWT."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka itu diberi pahala dua kali karena kesabaran mereka. Mereka menolak} mereka menolak {kejahatan dengan kebaikan dan menginfakkan sebagian rezeki yang telah Kami anugerahkan kepada mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "54. “Mereka itu,” orang-orang yang beriman kepada dua kitab, “diberi pahala dua kali,” yaitu pahala atas iman mereka kepada kitab yang terdahulu dan pahala atas iman kepada kitab yang terakhir, “disebabkan kesabaran mereka,” dalam beriman dan tetap beramal. Mereka sama sekali dalam hal ini tidak pernah digoyahkan oleh suatu syubhat (pemikiran rancu) apa pun, dan kedudukan serta syahwat sama sekali tidak bisa menghalangi mereka untuk beriman, “dan” di antara karakter mereka yang mulia, yang sebenarnya merupakan pengaruh iman mereka yang benar adalah bahwa sesungguhnya mereka “menolak kejahatan dengan kebaikan.” Maksudnya, prinsip dan jalan hidup mereka adalah selalu beruat kebaikan (ihsan)terhadap setiap orang, sampai kepada orang yang berbuat buruk kepada mereka, baik dengan perkataan ataupun perbuatan, malah mereka membalasnya dengan perkataan yang terpuji dan perbuatannya yang baik, karena pengetahuan mereka kepada akhlak moral yang sangat agung ini, dan mereka sadar bahwa tidak ada yang bisa membimbingnya kesana kecuali Allah, Pemilik karunia yang sangat besar."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 54: Allah kemudian menjelaskan bahwasanya mereka yang beriman dengan dua kitab akan diganjar dengan dua ganjaran : Balasan atas keimanan mereka terhadap kitab yang diturunkan kepada mereka sebelumnya dan ganjaran atas keimanan mereka dengan Al Qur’an. Kemudian mereka mengikuti Nabi mereka yang pertama (yang diutus kepada mereka serta kepada Muhammad ﷺ, dan mereka bersabar dengan mengikuti kebenaran dan juga atas celaan dari ketaatan dan menjauhi maksiat, Telah datang di dalam shahihain dari hadits Abu Musa secara marfu’ : Tiga golongan yang memiliki dua balasan bagi mereka, dan disebutkan salah satu dari mereka : Seorang laki-laki dari ahli kitab yang beriman dengan nabinya dan beriman kepada Muhammad ﷺ. Disebutkan oleh Allah bahwa di antara sifat mereka orang-orang shalih dari ahli kitab adalah mereka menjaga dari keburukan dengan kebaikan, mereka adalah orang-orang yang berbuat kebaikan dalam setiap kondisi, mereka juga menginfakkan harta-harta mereka mengharap ridha Allah dan mencari wajah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni pahala karena iman yang pertama dan iman yang kedua. Untuk tetap beriman dan mengamalkannya. Kedudukan dan hawa nafsu tidak menghalangi mereka beriman. Di antara akhlak mereka yang utama, yang timbul dari iman yang benar adalah mereka menolak kejahatan dengan kebaikan. Kebiasaan mereka adalah berbuat ihsan kepada setiap orang bahkan kepada orang yang berbuat jahat kepada mereka baik dengan ucapannya maupun dengan perbuatannya, mereka membalasnya dengan ucapan yang baik dan perbuatan yang baik karena mereka mengetahui keutamaan akhlak yang mulia ini dan bahwa tidak ada orang yang diberi taufik kepadanya kecuali orang yang memperoleh keberuntungan yang besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 54",
    "description": "Orang-orang yang beriman kepada Al-Qur'an dan apa yang diturunkan sebelumnya mereka itu yang sungguh jauh dan tinggi kedudukannya di sisi Allah akan diberi pahala dua kali, yakni berlipat ganda, karena beriman kepada taurat dan Al-Qur'an, disebabkan kesabaran mereka atas penderitaan yang mereka terima demi mempertahankan keimanan dan mengutamakan amal saleh. Dan di antara sifat-sifat mereka adalah mereka menolak kejahatan dengan memberi maaf, bahkan membalasnya dengan amal kebaikan, dan mereka juga adalah para dermawan yang menginfakkan sebagian dari rezeki yang telah kami berikan kepada mereka di jalan kebaikan. 55. Dan sifat mereka lainnya adalah apabila mereka mendengar perkataan yang buruk, yang tidak bermanfaat bagi kebaikan hidup dunia dan akhirat, mereka memelihara kehormatan diri mereka dengan berpaling darinya dan berkata, 'bagi kami amal-amal kami yang benar dan tidak akan kami tinggalkan dan bagimu amal-amal kamu yang batil yang dosanya akan kalian tanggung sendiri. Semoga selamatlah kamu. Selamat berpisah, kami akan membiarkan dan tidak mencampuri urusan kamu, karena kami tidak ingin bergaul dengan orang-orang bodoh, yang tidak enggan berpegang teguh pada ajaran Allah. '."
  }
]