[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "54-55. Orang-orang yang telah disebutkan sifat-sifat (ciri-ciri) nya itu, mereka diberi pahala dua kali atas keimanan mereka terhadap kitab suci mereka dan keimanan mereka terhadap al-Qur’an dengan kesabaran mereka. Dan termasuk karakter mereka, bahwasanya mereka menolak keburukan dengan kebaikan, dan mereka menafkahkan sebagian yang Kami rizkikan kepada meeka di jalan kebaikan dan kebajikan. Apabila mereka mendengar perkataan batil, mereka tidak memfokuskan pendengaran mereka untuk menyimaknya. Mereka berkata, “Bagi kami amal-amal kami dan kami tidak akan membelok darinya. Dan bagi kalian perbuatan-perbuatan kalian dan dosanya menjadi tanggungan kalian sendiri. Kami tidak ingin menyibukkan diri untuk membantah kalian, sedang kalian tidaklah mendengar dari kami kecuali hal-hal baik saja. Kami tidak ingin berkomunikasi kepada kalian atas dasar kebodohan kalian. Sebab sesungguhnya kami tidak ingin jalan orang-orang jahil dan tidak menyukainya.” Ini termasuk kata-kata terbaik yang diucapkan para da’i yang mengajak manusia kepada Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "55. Jika orang-orang yang beriman dari kalangan ahli kitab mendengar ucapan yang batil, mereka berpaling darinya dan tidak menghiraukannya serta berkata kepada orang-orang yang mengucapkannya, “Bagi kami pahala amalan kami dan bagi kalian pahala amalan kalian. Kalian selamat dari celaan dan gangguan kami, lalu kami tidak ingin bergaul dengan orang-orang bodoh karena akan menyebabkan bahaya dan gangguan terhadap agama dan dunia kami.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "55. Dan termasuk sifat golongan yang beriman ini adalah jika mereka mendengar perkataan batil maka mereka akan berpaling darinya dan berkata kepada pelakunya: “Kami memiliki jalan hidup dari Tuhan yang berbeda dengan jalan hidup yang kalian miliki, sehingga kami tidak menyibukkan pendengaran kami dengan hal yang tidak bermanfaat dan tidak melayani kejahilan kalian, namun kami akan berkata kepada kalian, ‘Keamanan dan keselamatan dari kami bagi kalian, kami tidak ingin bersama orang-orang yang jahil atau berdebat dengan mereka’.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "55. وَإِذَا سَمِعُوا۟ اللَّغْوَ أَعْرَضُوا۟ عَنْهُ (Dan apabila mereka mendengar perkataan yang tidak bermanfaat, mereka berpaling daripadanya) Karena kemuliaan dan kesucian mereka serta adab mereka yang sesuai syariat. Makna (اللغو) disini adalah perkataan yang mereka dengar dari orang-orang musyrik yang menghina mereka dan agama mereka. وَقَالُوا۟ لَنَآ أَعْمٰلُنَا وَلَكُمْ أَعْمٰلُكُمْ(dan mereka berkata: “Bagi kami amal-amal kami dan bagimu amal-amalmu) Yakni akibat buruk dari kekafiran mereka tidak akan menimpa kami, serta akibat baik keimanan kami tidak akan mereka rasakan. سَلٰمٌ عَلَيْكُمْ (kesejahteraan atas dirimu) Yang dimaksud dengan salam disini adalah salam perpisahan. Maknanya adalah semoga keamanan dan keselamatan menyertai kalian, kami tidak akan membalas kalian dengan keburukan dan tidak akan membalas apa yang kalian lakukan. لَا نَبْتَغِى الْجٰهِلِينَ (kami tidak ingin bergaul dengan orang-orang jahil) Yakni kami tidak mengharap pertemanan dengan orang-orang jahil."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "55. Ketika mereka mendengar ucapan yang sia-sia yaitu cacian, cemoohan dan ejekan dari orang-orang kafir, maka mereka menghindarinya dengan sopan dan penuh penghormatan serta berkata: “Bagi kami amal kami berupa keimanan dan agama, dan bagi kalian amal kalian berupa agama kalian. Kekufuran kalian tidak membahayakan sedikit pun bagi kami, begitu juga iman kami tidak membahayakan kalian. Semoga keselamatan atas kalian, Salam perpisahan dan salam keamanan dari kami. Kami tidak akan membalas kalian dengan keburukan. Kami tidak mencari persahabatan dengan orang-orang bodoh dan tidak juga menginginkannya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apabila mendengar perkataan yang buruk} perkataan yang sia-sia {mereka berpaling darinya dan berkata,“Bagi kami amal kami dan bagi kalian amal kalian, semoga keselamatan kepada kalian} Semoga keselamatan kepada kalian dari kami. Kami tidak akan membalas perkataan buruk kalian dengan sesuatu yang serupa {kami tidak ingin (bergaul dengan) orang-orang bodoh”} Kami tidak ingin menemani orang-yang tidak tahu dan bodoh, dan kami tidak mau bergaul dengan mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "55. “Dan apabila mereka mendengar perkataan yang sia-sia” dari seorang jahil (bodoh) yang menegur mereka dengan ucapan sia-sia itu, “mereka berkata” seperti yang dikatakan oleh ‘ibadurrahman, orang-orang yang berakal, “Bagi kami amal-amal kami, dan bagimu amal-amalmu.” Maksudnya, semuanya akan mendapat balasan sesuai dengan pekerjaan yang dikerjakannya sendiri, dia sama sekali tidak akan menanggung dosa orang lain sedikit pun. Konsekuensi semua itu adalah bahwa mereka berlepas diri dari apa yang dilakukan oleh orang-orang jahil (bodoh), seperti perbuatan sia-sia, batil dan perkataan yang tidak ada gunanya. “Semoga kesejahteraan atas dirimu,” maksudnya, kalian tidak akan mendengar dari kami selain kebaikan, dan kami tidak akan berbicara kepada kalian sesuai dengan tuntutan kebodohan kalian. Sebab, jika kalian rela dengan perbuatan tercela seperti ini, maka kami akan menjauhkan diri kami darinya, dan kami akan menjaga diri kami untuk terlibat di dalamnya, “kami tidak ingin bergaul dengan orang-orang jahil,” dari semua sisi."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 55: Allah menjelaskan sifat mereka orang-orang shalih, bahwasanya mereka : Jika mendengar sesuatu dari orang yang bodoh akan keburukan dan kebathilan, maka mereka berpaling dan pergi darinya dengan adab islam dan yang sesuai dengan syariat, mereka tidak ridha, tidak terjerumus karena sebab keburukan; Bahkan mereka membantah dengan mengatakan : Bagi kami amalan kami yang akan dibalas, dan bagi kalian apa yang kalian amalkan yang akan dibalas. Semoga keselamatan bagi kalian, dan kami tidak akan menggubris dan melawan kalian, akan tetapi (keinginan kami) bahwasanya kami tidak menginginkan bergaul terhadap orang-orang yang bodoh kepada Allah, kepada agama-Nya dan syariat-Nya.\\"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Dari orang yang jahil. Sebagaimana perkataan ibaadurrahman, lihat Al Furqaan: 63. Yakni, masing-masing akan mendapatkan balasan sesuai amal yang dikerjakannya, ia tidak menanggung dosa orang lain dan orang lain pun tidak menanggung dosanya. Ini menunjukkan, bahwa mereka berlepas diri dari orang-orang yang jahil, yakni dari perkataan dan perbuatan mereka yang sia-sia serta pembicaraan yang tidak ada faedahnya. Bisa juga diartikan, bahwa kamu akan selamat atau aman dari gangguan kami, yakni kami tidak akan membalasnya, atau kamu tidak mendengarkan dari kami selain kebaikan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 55",
    "description": "Dan sifat mereka lainnya adalah apabila mereka mendengar perkataan yang buruk, yang tidak bermanfaat bagi kebaikan hidup dunia dan akhirat, mereka memelihara kehormatan diri mereka dengan berpaling darinya dan berkata, 'bagi kami amal-amal kami yang benar dan tidak akan kami tinggalkan dan bagimu amal-amal kamu yang batil yang dosanya akan kalian tanggung sendiri. Semoga selamatlah kamu. Selamat berpisah, kami akan membiarkan dan tidak mencampuri urusan kamu, karena kami tidak ingin bergaul dengan orang-orang bodoh, yang tidak enggan berpegang teguh pada ajaran Allah. '56. Hidayah yang mengantar seseorang menerima dan melaksanakan tuntunan Allah bukanlah wewenang manusia, atau dalam batas kemampuannya, tetapi semata-mata wewenang dan hak prerogatif Allah. Di sini Allah menjelaskan hakikat tersebut dengan penegasan, sungguh, engkau wahai nabi Muhammad, tidak dapat memberi petunjuk dalam bentuk hidayah tawf'q yang menjadikan seseorang menerima dengan baik dan melaksanakan ajaran Allah kepada orang yang engkau kasihi, meski engkau sangat berhasrat untuk memberi petunjuk kepada kaummu. Engkau hanya mampu memberi hidayah irsy'd, dalam arti memberi petunjuk dan memberitahu tentang jalan kebahagiaan, tetapi Allahlah yang memberi petunjuk keimanan hidayah kepada orang yang dia kehendaki-Nya bila dia bersedia menerima hidayah dan membuka hatinya untuk itu, dan dia lebih mengetahui orang-orang yang mau menerima petunjuk."
  }
]