[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya kamu (wahai Rasul) tidak bisa memberikan hidayah taufik kepada orang yang kamu inginkan memperoleh hidayah. Akan tetapi, urusan itu berada di tangan Allah, Dia memberikan hidayah kepada orang yang dikehendakiNya untuk Dia beri hidayah menuju keimanan dan memberikan taufik kepadanya menuju hidayah itu. Dan Dia lebih mengetahui orang-orang yang pantas menerima hidayah dan kemudian Dia menunjukkannya kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "56. Sesungguhnya engkau -wahai Rasul- tidak mampu memberi petunjuk kepada orang yang engkau cintai semisal Abu Ṭalib dan selainnya agar mendapat keimanan, akan tetapi Allah sajalah yang memberikan petunjuk kepada orang yang dikehendaki-Nya, dan Dia Mahatahu siapa yang di dalam ilmu-Nya termasuk orang-orang yang mendapatkan hidayah kepada jalan yang lurus."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "56. Allah berfirman kepada Rasulullah untuk menghibur hatinya dan menghilangkan kesedihannya dengan menyampaikan agar dia menyerahkan urusan hidayah kepada Allah semata: Hai Muhammad, kamu tidak dapat memberi hidayah taufik kepada agama Islam bagi orang yang kamu kehendaki, namun kamu hanya berkewajiban menyampaikan risalah; dan Allah memberi hidayah taufik kepada siapa yang Dia kehendaki, Dia memiliki hikmah yang dalam dan Dia Maha Mengetahui siapa yang termasuk orang-orang yang mendapat hidayah dan berhak mendapatkannya; Dia memberi hidayah sesuai dengan kemampuan fitrah seseorang dalam berpandangan yang benar dan menerima kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "56. إِنَّكَ لَا تَهْدِى مَنْ أَحْبَبْتَ (Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi) Dan itu bukan urusanmu. وَلٰكِنَّ اللهَ يَهْدِى مَن يَشَآءُ ۚ( tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya) Yakni yang Allah kehendaki untuk mendapat petunjuk. وَهُوَ أَعْلَمُ بِالْمُهْتَدِينَ(dan Allah lebih mengetahui orang-orang yang mau menerima petunjuk) Yakni Allah mengetahui orang yang layak mendapat petunjuk. Ayat ini diturunkan untuk Abu Thalib saat ia enggan untuk masuk Islam, padahal Rasulullah sangat ingin menjadikannya beriman. Namun akhirnya ia mati di atas agama Abdul Mutthalib (kemusyrikan), sebagaimana disebutkan dalam kitab Shahihain dan lainnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "56. Wahai Nabi, sesungguhnya kamu tidak bisa memberi petunjuk kepada orang untuk beriman sesuai kehendakmu, namun Allahlah yang memberi petunjuk orang yang dikehendaki untuk mendapat petunjuk dengan kuasa dan kehendakNya, lalu membantunya untuk beriman. Dialah Dzat yang Maha mengetahui orang-orang yang siap untuk mendapatkan petunjuk. Ayat ini turun sebagaimana hadits yang diriwayatkan dalam Shahih Muslim, Tirmidzi dan lainnya tentang Abu Thalib saat menolak untuk masuk Islam meskipun Nabi SAW sangat menginginkan dia beriman, kemudian dia mati dalam keadaan mengikuti agama Abdul Muthalib."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya kamu tidak (bisa) memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada siapa saja yang Dia kehendaki. Dia lebih mengetahui tahu orang-orang yang mendapat petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "56. Allah mengabarkan bahwasanya engkau, wahai Muhammad, -dan apalagi selain kamu-, tidak akan mampu memberikan hidayah kepada siapa pun, walau terhadap orang yang paling kamu cintai. Sebab, hal ini merupakan perkara yang tidak mampu dilakukan oleh manusia. Yaitu hidayah taufik (bimbingan) dan menimbulkan iman di dalam hati. Sebenarnya hati hanya di Tangan Allah; Dia memberikan petunjukNya kepada orang yang dikehendakiNya, dan Dia lebih mengetahui tentang orang yang layak diberi petunjuk, kemudian Dia memberinya petunjuk, dari orang yang tidak layak mendapatkannya sehingga Dia menetapkannya dalam kesesatannya. Adapun tentang penetapan hidayah milik Rasululah yang terdapat dalam FirmanNya, \"Dan sesungguhnya kamu benar-benar memberi petunjuk kepada jalan yang lurus.\" (Asyura:52), maksudnya adalah Hidayah Bayan wa al-Irsyad (memberikan penjelasan dan arahan). Jadi, Rasulullah itu hanya menjelaskan jalan yang lurus, menganjurkannya dan mengerahkan seluruh kemampuan di dalam membimbing manusia agar menelusurinya. Adapun tentang kemampuan beliau menciptakan iman di dalam hati mereka dan memberikan taufik kepada mereka untuk beramal, maka sama sekali beliau tidak bisa. Oleh karena itu, kalau sekiranya beliau mampu melakukannya, tentu beliau memberikan hidayah kepada orang yang banyak berbuat baik kepada beliau, membela dan melindungi beliau dari kaumnya, yaitu pamannya, Abu THalib. Namun beliau tetap berbuat ihsan (baik) dalam bentuk mengajaknya untuk masuk Islam dan nasihat yang sangat tulus yang lebih besar daripada yang dilakukan oleh pamannya terhadap beliau. Akan tetapi hidayah tetap ada di Tangan Allah."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 56: Ketahuilah wahai Nabi Allah, sungguh engkau tidak akan dapat menunjuki kepada keimanan sebagaimana yang engkau inginkan, karena Dialah yang maha mengetahui akan harapan bagi mereka yang berharap hidayah yang mereka telah siap menerimanya; Maka janganlah engkau bersedih, karena pamanmu Abu Thalib dan selainnya tidak menjawab keimanan (yang engkau seru)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Imam Muslim meriwayatkan dengan sanadnya yang sampai kepada Abu Hurairah ia berkata: Rasulullah shallallahu 'alaihi wa sallam bersabda kepada pamannya menjelang wafatnya, “Katakanlah, “Laailaahaillallah” agar aku dapat bersaksi dengannya untukmu di hadapan Allah.” Namun ia menolaknya, maka Allah menurunkan ayat, “Sungguh, engkau (Muhammad) tidak dapat memberi petunjuk kepada orang yang engkau kasihi,…dst.” Dalam ayat ini, Allah Subhaanahu wa Ta'aala memberitahukan, bahwa Nabi Muhammad shallallahu 'alaihi wa sallam tidaklah mampu memberikan hidayah taufiq (untuk mengikuti) kepada siapa pun, termasuk orang yang paling Beliau cintai seperti paman Beliau Abu Thalib. Beliau hanyalah memberikan hidayah irsyad (menunjukkan dan memberitahukan mana yang hak dan mana yang batil, mana jalan yang lurus dan mana jalan yang bengkok). Hidayah taufiq berada di Tangan Allah Subhaanahu wa Ta'aala, Dia menunjuki siapa saja yang Dia kehendaki sehingga ia mau menempuhnya, Dia mengetahui siapa yang cocok memperoleh hidayah-Nya sehingga Dia berikan hidayah dan mengetahui siapa yang tidak cocok memperoleh hidayah sehingga Dia biarkan di atas kesesatannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 56",
    "description": "Hidayah yang mengantar seseorang menerima dan melaksanakan tuntunan Allah bukanlah wewenang manusia, atau dalam batas kemampuannya, tetapi semata-mata wewenang dan hak prerogatif Allah. Di sini Allah menjelaskan hakikat tersebut dengan penegasan, sungguh, engkau wahai nabi Muhammad, tidak dapat memberi petunjuk dalam bentuk hidayah tawf'q yang menjadikan seseorang menerima dengan baik dan melaksanakan ajaran Allah kepada orang yang engkau kasihi, meski engkau sangat berhasrat untuk memberi petunjuk kepada kaummu. Engkau hanya mampu memberi hidayah irsy'd, dalam arti memberi petunjuk dan memberitahu tentang jalan kebahagiaan, tetapi Allahlah yang memberi petunjuk keimanan hidayah kepada orang yang dia kehendaki-Nya bila dia bersedia menerima hidayah dan membuka hatinya untuk itu, dan dia lebih mengetahui orang-orang yang mau menerima petunjuk. 57. Dan untuk menjelaskan alasan mengapa mereka tetap memegang teguh kepercayaan yang mereka anut selama ini, mereka orang-orang musyrik mekkah berkata kepada rasul, 'jika kami mengikuti petunjuk itu dengan memeluk islam dan bergabung bersama engkau, wahai nabi Muhammad, yang ajaranmu sangat berbeda dengan kepercaya-an masyarakat arab, niscaya kami akan diusir dari negeri kami, diculik dan kekuasaan kami akan direbut. ' mereka bohong dengan alasan mereka itu. Allah membantah alasan mereka itu dengan berfirman, 'bagaimana mereka berucap demikian, padahal bukankah kami telah meneguhkan kedudukan mereka dalam tanah haram, yakni tanah suci mekah, dengan menjadikan wilayah tempat tinggal mereka sebagai negeri yang aman dari serangan dan pembunuhan; yang terus-menerus dan senantiasa sepanjang waktu didatangkan ke tempat itu buah-buahan dari segala macam tumbuh-tumbuhan sebagai rezeki bagimu dari sisi kami kendati mereka kafir' sungguh, dalih mereka itu tidak logis dan apa yang mereka khawatirkan itu tidak terjadi, tetapi kebanyakan mereka tidak mengetahui keagungan karunia tersebut."
  }
]