[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir Makkah berkata, “jika kami mengikuti kebenaran yang kamu bawa kepada kami dan kami berlepas diri dari para pembela dan tuhan-tuhan (kami), niscaya kami akan diusir dari tempat kami dengan dibunuh, ditawan dan terampas kekayaan kami.” Bukankah Kami telah menjadikan mereka berkuasa di negeri yang aman, di mana Kami mengharamkan atas manusia untuk menumpahkan darah di dalamnya, dipasok kepadanya buah-buahan dari segala sesuatu (tumbuhan) sebagai rizki dari sisi Kami? akan tetapi, kebanyakan kaum musyrikin tidak mengerti urgensi kenikmatan-kenikmatan yang tercurah kepada mereka itu, sehingga mereka tidak mensyukuri Dzat yang telah melimpahkan karunia itu kepada mereka dan tidak menaatiNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "57. Orang-orang musyrik dari penduduk Makkah berkata sebagai alasan tidak mengikuti Islam dan tidak beriman kepadanya, “Jika kami mengikuti Islam yang engkau bawa niscaya musuh-musuh kami akan mengusir kami dari negeri kami dengan segera.” Bukankah Kami telah meneguhkan bagi orang-orang musyrik itu Tanah Haram yang di dalamnya diharamkan pertumpahan darah dan kezaliman, mereka aman di dalamnya dari serbuan orang lain terhadap mereka, didatangkan kepada mereka segala macam buah-buahan sebagai rezeki dari sisi Kami yang Kami berikan kepada mereka, akan tetapi kebanyakan dari mereka tidak mengetahui apa yang telah Allah rezekikan kepada mereka lalu mereka bersyukur kepada Allah atasnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "57. Orang-orang musyrik Makkah telah terbiasa dengan kekafiran dan kerusakan akidah, sehingga mereka mengajukan berbagai alasan batil yang menghalangi mereka masuk Islam, mereka berkata: “Hai Muhammad, jika kami beriman kepadamu dan berlepas diri dari tuhan-tuhan kami, maka kabilah-kabilah arab yang ada di sekitar kami akan menyerang, menculik, dan menawan kami; dan kami tidak memiliki kekuatan untuk melawan mereka.” Allah membantah perkataan mereka bahwa Dia telah menjadikan mereka di tanah haram (suci) yang aman, orang yang tinggal di sana akan aman dari pembunuhan dan penawanan; dan Allah mendatangkan kepada mereka buah-buahan dengan berbagai jenis dan rasa dari negeri lain sebagai rezeki bagi mereka. Allah telah memberi mereka keamanan dan rezeki saat tidak ada yang mampu memberi mereka keamanan dan rezeki jika mereka masuk Islam. Mereka hanya perlu berpaling dari keterikatan mereka dengan kekafiran dan mengingat segala kenikmatan yang telah Allah berikan kepada mereka. Tanah suci yang mereka tinggali bukanlah keistimewaan yang diberikan oleh kabilah-kabilah arab bagi mereka, akan tetapi mayoritas mereka tidak mengetahuinya, sehingga mereka beranggapan agama Islam akan mendatangkan kezaliman kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "57. وَقَالُوٓا۟ إِن نَّتَّبِعِ الْهُدَىٰ مَعَكَ نُتَخَطَّفْ مِنْ أَرْضِنَآ (Dan mereka berkata: “Jika kami mengikuti petunjuk bersama kamu, niscaya kami akan diusir dari negeri kami”) Yakni orang-orang musyrik Quraisy dan pengikutnya mengatakan: hai Muhammad, jika kami masuk agamamu, niscaya orang-orang arab yang lain akan merampas tanah kami (yakni tanah Makkah), dan kami tidak memiliki kekuatan untuk melawan mereka. أَوَلَمْ نُمَكِّن لَّهُمْ حَرَمًا ءَامِنًا(Dan apakah Kami tidak meneguhkan kedudukan mereka dalam daerah haram (tanah suci) yang aman) Bukankah Kami telah menjadikan tanah ini aman bagi mereka, tidak ada seorangpun yang menzalimi keluarganya, sehingga kalian sangat aman dari serangan orang arab yang lain. يُجْبَىٰٓ إِلَيْهِ ثَمَرٰتُ كُلِّ شَىْءٍ(yang didatangkan ke tempat itu buah-buahan dari segala macam (tumbuh-tumbuhan)) Yakni segala macam buah-buahan didatangkan ke sana dari berbagai tempat. وَلٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَ (Tetapi kebanyakan mereka tidak mengetahui) Karena kebodohan dan kelalaian mereka yang sangat, serta mereka tidak memikirkan kesudahan urusan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "57. Orang-orang musyrik Quraisy berkata: “Jika kami masuk agamamu wahai Muhammad, maka bangsa Arab akan menawan kami dari tanah kami yaitu Mekah, dengan menjauhkan kami dari negeri kami.” Kemudian Allah menanggapi mereka: “Bukankah Kami telah menjadikan Mekah aman.” Buah-buahan dan rejeki-rejeki dibawa ke dalamnya dari berbagai tempat sebagai bentuk rejeki dari Kami bagi mereka. Akan tetapi kebanyakan mereka tidak mengetahui bahwa yang Kami firmankan itu benar. Mereka itu tidak tahu dan tidak mau berpikir tentang hakikat perkara-perkara itu. Maknanya jika ini adalah keadaan mereka, yaitu penyembah berhala, lalu bagaimana bisa Kami membuat mereka ketakutan dan keluar dari rumah, jika mereka telah melekatkan diri untuk mensucikan Ka’bah dan menyatu dengannya. Ibnu Abbas berkata: “Sesungguhnya orang-orang dari suku Quraisy berkata kepada Nabi SAW: “Jika kami mengikutimu, maka orang-orang akan menawan kami” kemudian turunlah ayat ini”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata,“Jika mengikuti petunjuk bersamamu, niscaya kami akan diusir} maka kami akan diusir dalam keadaan dibunuh dan ditawan {dari negeri kami” “Bukankah Kami telah mengukuhkan kedudukan mereka di tanah haram yang aman, yang didatangkan} dibawa dan dikumpulkan {ke tempat itu buah-buahan dari setiap jenis sebagai rezeki dari sisi Kami”} sisi Kami {Akan tetapi kebanyakan mereka tidak mengetahui"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "57. Allah mengabarkan bahwasanya orang-orang yang mendustakan dari kaum Quraisy dan penduduk Makkah berkata kepada Rasulullah, “Jika kami mengikuti petunjuk bersama kamu, niscaya kami akan diserang dari negeri kami,” dengan pembunuhan, penawanan, dan perampasan harta benda. Sebab semua orang telah memusuhimu dan menyalahimu. Maka kalau kami mengikkutimu, niscaya kami menghadapi permusuhan semua orang, sedangkan kami tidak mempunyai daya untuk menghadapi mereka. Perkataan ini menunjukkan sikap buruk sangka terhadap Allah, bahwa Allah tidak akan menolong agamaNya, tidak akan meninggikan kalimatNya. Bahkan, akan membuat manusia mengalahkan para penganut agamaNya, lalu mereka menimpakan siksaan terhadap mereka. Mereka mengira bahwa kebatilan akan mengungguli kebenaran. Maka Allah berfirman seraya menjelaskan keadaan mereka yang terlindungi dari masyarakat luar dan bahwasanya Allah telah mengistimewakan mereka dengannya, seraya berfirman, “Dan apakah Kami tidak meneguhkan kedudukan mereka dalam daerah haram yang aman, yang didatangkan ke tempat itu buah-buahan dari segala macam (tumbuh-tumbuhan) untuk menjadi rizki (bagimu) dari sisi Kami?” maksudnya, tidakkah Kami telah menjadikan mereka berkuasa dan bertempat tinggal dengan teguh di tanah haram yang banyak didatangi oleh para delegasi dan menjadi tempat tujuan para peziarah? Ia telah diharamkan oleh orang yang dekat dan yang jauh, maka penduduknya tidak akan diganggu, dan mereka pun tidak akan dilecehkan sedikit ataupun banyak. Padahal kondisinya, semua daerah yang ada di sekitarnya telah diliputi rasa takut dari segala penjuru, penduduknya tidak merasa aman dan tidak pula merasa tentram. Maka hendaklah mereka (penduduk Makkah) memuji Allah Rabb mereka atas rasa aman yang menyeluruh ini, yang tidak dimiliki oleh selain mereka, dan atas rizki yang berlimpah ruah yang dibawa kepada mereka dari segala tempat, berupa berbagai buah-buahan, makanan, dan barang-barang lainnya yang dengannya mereka dapat mengambil keuntungan dan bersenang-senang; dan hendaklah mereka mengikuti Rasul yang mulia ini agar rasa aman dan kesejahteraan menjadi sempurna. Dan jangan sampai mereka mendustakannya dan kufur terhadap nikmat Allah, sehingga mereka merubah keadaan aman mereka menjadi rasa takut, kemuliaan mereka akan berubah menjadi kehinaan, dan kekayaan mereka menjadi kefakiran."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 57: Berkata orang-orang kafir quraisy kepada Nabi ﷺ : Sungguh kami khawatir jika kami beriman kepadamu serta mengikutimu, maka bangsa arab akan saling merampas tanah kami dengan peperangan dan perampasan, dengan memenjarakan dan menangkap (kami). Apakah mereka orang-orang kafir tidak melihat bahwasanya Kamilah yang menjadikan mereka tetap di atas negeri mereka dengan aman dan tanpa kesulitan dan Kami jugalah yang menjadikan di hati-hati mereka kecintaan atas tanah haram ? Apakah mereka tidak melihat bahwasanya negeri ini terdapat banyak buah-buahan (tidak sebagaimana negeri lain) dan makanan, perkebunan dari segala macamnya ? Akan tetapi kebanyakan dari mereka tidak mengetahui apa yang mereka diberikan kenikmatan atasnya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni orang-orang yang mendustakan dari kalangan kaum Quraisy dan penduduk Mekah. Termasuk pula dibunuh, ditawan dan dirampas harta kami. Karena orang-orang telah memusuhimu dan menyelisihimu, jika kami mengikutimu, maka berarti kami siap dimusuhi oleh semua manusia, sedangkan kami tidak memiliki kemampuan. Ucapan ini menunjukkan buruk sangkanya mereka kepada Allah, dan menyangka bahwa Allah tidak akan memenangkan agama-Nya serta meninggikan kalimat-Nya. Mereka menyangka bahwa orang-orang yang mendustakan berada di atas orang-orang yang beriman, sehingga nanti mereka akan menimpakan siksaan yang pedih dan mereka mengira bahwa yang batil akan mengalahkan yang hak. Maka pada lanjutan ayatnya, Allah menjelaskan keadaan mereka secara khusus daripada yang lain serta kelebihan yang Allah berikan kepada mereka. Di mana mereka aman dari penyerangan dan pembunuhan yang dilakukan oleh sebagian orang Arab kepada yang lain. Tempat tersebut dikunjungi oleh banyak orang, dihormati oleh orang yang dekat maupun jauh, dan penduduknya tidak dibuat ribut, sedangkan tempat-tempat yang lain di sekeliling mereka diliputi ketakutan dari berbagai sisi, penduduknya tidak aman dan tenteram, oleh karena itu hendaklah mereka puji dan syukuri Tuhan mereka karena nikmat yang sempurna itu dan karena rezeki yang banyak yang didatangkan kepada mereka dari setiap tempat, dan hendaknya mereka mengikuti Rasul yang mulia ini (Nabi Muhammad shallallahu 'alaihi wa sallam) agar keamanan dan rezeki yang banyak itu menjadi sempurna untuk mereka, serta hendaknya mereka tidak mendustakannya dan bersikap sombong atas nikmat Allah itu yang mengakibatkan keadaan mereka yang sebelumnya aman menjadi ketakutan, mulia menjadi hina, dan kaya menjadi miskin. Oleh karena itulah pada ayat selanjutnya Allah Subhaanahu wa Ta'aala mengancam mereka dengan mengingatkan tindakan-Nya terhadap umat-umat sebelum mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 57",
    "description": "Dan untuk menjelaskan alasan mengapa mereka tetap memegang teguh kepercayaan yang mereka anut selama ini, mereka orang-orang musyrik mekkah berkata kepada rasul, 'jika kami mengikuti petunjuk itu dengan memeluk islam dan bergabung bersama engkau, wahai nabi Muhammad, yang ajaranmu sangat berbeda dengan kepercaya-an masyarakat arab, niscaya kami akan diusir dari negeri kami, diculik dan kekuasaan kami akan direbut. ' mereka bohong dengan alasan mereka itu. Allah membantah alasan mereka itu dengan berfirman, 'bagaimana mereka berucap demikian, padahal bukankah kami telah meneguhkan kedudukan mereka dalam tanah haram, yakni tanah suci mekah, dengan menjadikan wilayah tempat tinggal mereka sebagai negeri yang aman dari serangan dan pembunuhan; yang terus-menerus dan senantiasa sepanjang waktu didatangkan ke tempat itu buah-buahan dari segala macam tumbuh-tumbuhan sebagai rezeki bagimu dari sisi kami kendati mereka kafir' sungguh, dalih mereka itu tidak logis dan apa yang mereka khawatirkan itu tidak terjadi, tetapi kebanyakan mereka tidak mengetahui keagungan karunia tersebut. 58. Mereka tidak mengambil pelajaran dari sejarah generasi masa lampau yang mendapatkan sanksi dan kebinasaan. Dan padahal betapa banyak negeri bersama penduduknya yang sudah bersenang-senang dalam kehidupannya yang telah kami binasakan akibat keangkuhan dan kedurhakaan penduduknya dengan tidak mensyukuri kenyamanan hidup yang telah kami anugerahkan kepada mereka. Maka lihatlah, itulah tempat kediaman mereka yang tidak didiami lagi oleh manusia setelah mereka, karena penduduknya telah dipunahkan dan kediaman mereka sudah tidak layak huni, kecuali sebagian kecil yang digunakan secara singkat oleh orang-orang yang kebetulan melewatinya. Setelah kebinasaan para pendurhaka itu, tidak ada lagi yang memiliki kota itu, dan kamilah yang mewarisinya. ' setelah mereka hancur, tempat itu sudah kosong dan tidak dimakmurkan lagi, hingga kembalilah ia kepada pemiliknya yang hakiki yaitu Allah."
  }
]