[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan banyak dari penduduk negeri-negeri yang telah Kami binasakan ketika kehidupan mereka telah melalaikan mereka dari keimanan kepada rasul-rasul, lalu mereka ingkar dan berbuat aniaya. Maka itulah kediaman-kediaman mereka, tidak dihuni sepeninggal mereka kecuali sebagian kecil saja darinya. Dan Kami adalah pewaris para hamba, Kami mematikan mereka, kemudian mereka dikembalikan kepada Kami, lalu Kami memberikan balasan kepada mereka sesuai dengan amal perbuatan mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "58. Betapa banyak negeri yang mengingkari nikmat Allah kepada mereka, lalu mereka tenggelam dalam dosa dan kemaksiatan, maka Kami kirimkan kepada mereka siksa yang membinasakan. Tempat kediaman mereka yang punah itu dilalui oleh manusia, tidak didiami setelah para pemiliknya kecuali sedikit saja dari orang-orang yang melewatinya, dan Kami lah pewaris yang mewarisi langit, bumi dan yang ada pada keduanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "58. Anggapan-anggapan batil dari orang-orang musyrik Makkah ini dapat mengundang kemurkaan Tuhan semesta alam; demikianlah keadaan umat-umat yang ingkar terhadap kenikmatan dari Allah dan tidak mengakui karunia yang telah diberikan kepada mereka, sehingga Allah membinasakan mereka; dan inilah tempat tinggal mereka yang kosong yang mengisahkan kisah mereka, mereka tidak menyisakan seorangpun penerus, namun mereka semua binasa tanpa tersisa; dan tempat tinggal itu tidak lagi terurus sehingga menjadi ibrah bagi orang lain. Tidak terlihat lagi orang di dalamnya melainkan orang yang sekedar lewat saja atau ingin mengambil ibrah dari kebinasaan mereka tanpa berada di sana dalam waktu yang lama; tidak ada yang mewarisi apa yang mereka tinggalkan selain Kami. Dan ini semua adalah bukti kemurkaan Allah kepada mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "58. وَكَمْ أَهْلَكْنَا مِن قَرْيَةٍۭ بَطِرَتْ مَعِيشَتَهَا ۖ (Dan berapa banyaknya (penduduk) negeri yang telah Kami binasakan, yang sudah bersenang-senang dalam kehidupannya) Dahulu mereka dalam kehidupan yang mewah dan lapang sehingga mereka ingkar terhadap kenikmatan Allah ini, maka mereka dibinasakan. Imam Atha’ berkata: mereka dahulu hidup dalam keangkuhan, mereka memakan rezeki dari Allah namun menyembah berhala-berhala. فَتِلْكَ مَسٰكِنُهُمْ لَمْ تُسْكَن مِّنۢ بَعْدِهِمْ إِلَّا قَلِيلًا ۖ( maka itulah tempat kediaman mereka yang tiada di diami (lagi) sesudah mereka, kecuali sebahagian kecil) Yakni negeri itu tidak ditinggali manusia setelahnya kecuali sebentar saja, seperti orang yang sekedar melewatinya dalam perjalanan, ia akan singgah di sana sehari atau dua hari, dan selanjutnya akan menjadi negeri yang kosong. وَكُنَّا نَحْنُ الْوٰرِثِينَ(Dan Kami adalah Pewaris(nya)) Sebab mereka tidak meninggalkan ahli waris yang mewarisi tempat tinggal dan harta mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "58. Berapa banyak (Banyak) penduduk negeri yang memiliki kehidupan sejahtera dan aman yang telah Kami hancurkan. Mereka tidak mau berterima kasih atas nikmat(Ku), berlaku sewenang-wenang dan sombong. Tindakan tidak mau berterima kasih itu adalah kezaliman, keangkuhan dan pengabaian terhadap kebenaran Allah. Kemudian tempat-tempat mereka kosong dan tidak ada yang tinggal di dalamnya setelah mereka kecuali dalam waktu singkat, seperti musafir yang singgah di sana selama sehari atau beberapa hari karena ada sisa-sisa buruh dari kemaksiatan mereka. Dan Kami adalah pewaris rumah-rumah mereka jika tidak ada satupun orang yang menggantikan mereka di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Betapa banyak} Banyak sekali {negeri yang telah Kami binasakan karena telah dibuat angkuh oleh kesenangan hidupnya} durhaka dan ingkar terhadap kesenangan hidup mereka {Maka itulah tempat tinggal mereka yang tidak ditinggali setelah mereka, kecuali sebagian kecil. Kamilah yang mewarisinya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "58. Oleh karena itu, Allah mengancam mereka dengan ancaman yang telah dilakukanNya terhadap umat-umat terdahulu sebelum mereka, seraya berfirman, “Dan betapa banyaknya (penduduk) negeri yang telah Kami binasakan, yang sudah bersenang-senang dalam kehidupannya.” Maksudnya, mereka menyombongkannya, melalaikannya dan sibuk dengannya hingga tidak beriman kepada para rasul. Oleh karenanya, mereka dibinasakan oleh Allah, dimusnahkan kenikmatan dari mereka dan ditimpakan bencana (azab) terhadap mereka, “maka itulah tempat kediaman mereka yang tiada didiami (lagi) sesudah mereka, kecual sebagian kecil,” karena bertubi-tubinya kebinasaan dan kehancuran yang menimpa mereka, dan (karena) keterasingannya dari orang-orang sesudah mereka, “dan Kami adalah pewarisnya” untuk hamba-hamba. Kami matikan mereka, kemudian seluruh kenikmatan yang telah Kami anugerahkan kepada mereka kembali kepada Kami, kemudian Kami kembalikan mereka kepada Kami, lalu Kami memberi balasan kepada mereka atas amal perbuatan mereka."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 58: Allah mengabarkan bahwa kebanyakan negeri yang hidup padanya ketenangan dari kehidupan (yang baik) dan sejahtera, maka tidak ada tauhid kepada Allah pada mereka (penududuknya), tidak pula ada keimanan kepada Allah dan Rasul-Nya ﷺ, dan sungguh mereka berhak untuk binasa dan musnah, dan tersisa mereka orang-orang miskin di antara mereka di mana mereka hidup dan menyaksikan atas kelakuan bejat mereka, dan tidaklah tertinggal dari mereka kecuali hanya beberapa saja dari manusia. Sungguh Allah yang memiliki urusan dan memberikan kepada mereka beserta orang-orang miskin di antara mereka. Allah akan bangkitkan mereka dan akan Allah balas mereka berdasarkan amalan-amalan yang mereka kerjakan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang telah berbangga-bangga dan dibuat lalai oleh kesenangan yang diperolehnya sehingga tidak beriman kepada para rasul, lalu Allah membinasakan mereka, menghilangkan kesenangan itu dan menimpakan hukuman. Karena kebinasaan berturut-turut menimpa mereka sehingga membuat generasi setelah mereka takut menempatinya kecuali sekedar lewat saja. Maksudnya, setelah mereka hancur tempat itu kosong dan tidak diramaikan lagi, sehingga kembalilah ia kepada pemiliknya yang hakiki yaitu Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 58",
    "description": "Mereka tidak mengambil pelajaran dari sejarah generasi masa lampau yang mendapatkan sanksi dan kebinasaan. Dan padahal betapa banyak negeri bersama penduduknya yang sudah bersenang-senang dalam kehidupannya yang telah kami binasakan akibat keangkuhan dan kedurhakaan penduduknya dengan tidak mensyukuri kenyamanan hidup yang telah kami anugerahkan kepada mereka. Maka lihatlah, itulah tempat kediaman mereka yang tidak didiami lagi oleh manusia setelah mereka, karena penduduknya telah dipunahkan dan kediaman mereka sudah tidak layak huni, kecuali sebagian kecil yang digunakan secara singkat oleh orang-orang yang kebetulan melewatinya. Setelah kebinasaan para pendurhaka itu, tidak ada lagi yang memiliki kota itu, dan kamilah yang mewarisinya. ' setelah mereka hancur, tempat itu sudah kosong dan tidak dimakmurkan lagi, hingga kembalilah ia kepada pemiliknya yang hakiki yaitu Allah. 59. Jangan menduga bahwa kehancuran negeri-negeri terjadi dengansewenang-wenang. Tidak, Allah maha adil, dan karena itu tuhanmu tidak mungkin akan membinasakan negeri-negeri di sekitar mekah dan atau penduduknya pada masamu, wahai nabi Muhammad, betapa pun besarnya kedurhakaan mereka, sebelum dia mengutus seorang rasul di ibukotanya, yaitu mekah, yang membacakan ayat-ayat kami kepada mereka; dan tidak pernah pula terjadi kami membinasakan penduduk negeri setelah kami mengutus rasul atau pemberi peringatan; kecuali penduduknya melakukan kezaliman terhadap diri mereka sendiri dengan kufur dan maksiat kepada Allah, sehingga mereka pantas menerima hukuman."
  }
]