[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan tidaklah Tuhanmu (wahai Rasul) membinasakan negeri-negeri yang berada di sekitar Makkah pada masamu sehingga diutus di ibukota (makah) itu seorang rasul yang membacakan ayat-ayat Kami kepada mereka. Dan Kami tidaklah membinasakan negeri-negeri kecuali penduduknya dalam keadaan berbuat kezhaliman terhadap diri mereka dengan kafir kepada Allah dan berbuat maksiat kepadaNya. Maka dengan itu, mereka pantas mendapatkan hukuman dan siksaan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "59. Dan tidaklah Rabbmu -wahai Rasul- menghancurkan suatu negeri hingga memutus alasan penduduknya dengan mengirimkan seorang Rasul di ibukota negeri itu sebagaimana Kami mengutusmu di Ibukota, dan tidaklah Kami menghancurkan penduduk suatu negeri sementara mereka istikamah dalam kebenaran, akan tetapi Kami menghancurkan mereka jika mereka berbuat kezaliman dengan melakukan kekafiran dan perbuatan maksiat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "59. Dan termasuk sunnatullah, bahwa Allah tidak akan menetapkan kebinasaan bagi penduduk negeri yang ada di sekitar Makkah sebelum Dia mengutus di negeri yang besar -dan ketika itu Makkah adalah negeri yang paling besar di arab- seorang rasul yang membacakan ayat-ayat Allah kepada mereka dan mengajak mereka menuju kebenaran yang jelas. Dan Tuhanmu tidak akan membinasakan penduduk negeri kecuali setelah mereka menyatakan akan tetap di dalam kekafiran dan kesyirikan; tidakkah kamu melihat mereka sebagai orang-orang yang layak mendapat siksaan dari Allah?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "59. وَمَا كَانَ رَبُّكَ مُهْلِكَ الْقُرَىٰ حَتَّىٰ يَبْعَثَ فِىٓ أُمِّهَا رَسُولًا يَتْلُوا۟ عَلَيْهِمْ ءَايٰتِنَا ۚ (Dan tidak adalah Tuhanmu membinasakan kota-kota, sebelum Dia mengutus di ibukota itu seorang rasul yang membacakan ayat-ayat Kami kepada mereka) Yakni Rasul yang memberi peringatan kepada mereka dan membacakan ayat-ayat Allah bagi mereka, serta menyampaikan apa yang telah Allah perintahkan kepada mereka dan pahala apa yang disiapkan bagi orang yang mentaati-Nya dan siksaan bagi orang yang bermaksiat kepada-Nya. Terdapat pendapat mengatakan yang dimaksud dengan ibukota di sini adalah kota Makkah. وَمَا كُنَّا مُهْلِكِى الْقُرَىٰٓ( dan tidak pernah (pula) Kami membinasakan kota-kota) Yakni setelah Kami utus seorang Rasul ke ibukota tersebut. إِلَّا وَأَهْلُهَا ظٰلِمُونَ(kecuali penduduknya dalam keadaan melakukan kezaliman) Mereka telah layak dibinasakan akibat kezaliman dan kekafiran mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "59. Pembinasaan penduduk negeri yang kafir itu bukanlah kebiasaan Tuhanmu, jadi Dia mengutus di ibukota suatu negeri seorang rasul yang membacakan kepada mereka ayat-ayat yang Kami turunkan kepadanya untuk mengajak mereka beriman dan beramal shalih. Urusan Kami bukanlah menghancurkan suatu negeri kecuali penduduknya bersikeras atas kekufuran dan mendustakan para rasul"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tuhanmu tidak akan membinasakan negeri-negeri, sehingga Dia mengutus di ibukotanya} daerah paling besar dan paling agung dari negeri itu {seorang rasul yang membacakan ayat-ayat Kami kepada mereka. Kami tidak membinasakan negeri-negeri, kecuali penduduknya dalam keadaan zalim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "59. Di antara kebijaksanaan dan rahmatNya adalah Dia tidak menyiksa umat (bangsa) hanya karena berdasarkan kekafiran mereka sebelum ditegakannya hujjah terhadap mereka, yaitu dengan diutusnya para Rasul kepada mereka. Maka dari itu Dia berfirman, “Dan tidaklah Rabbmu membinasakan kota-kota,” maksudnya, karena kekafiran dan kezhaliman mereka, “sehingga Dia mengutus di ibukota itu,” maksudnya, di kampung-kampung dan di kota-kota tempat mereka tinggal dan yang serupa dengannya, di mana mereka biasa pulang pergi, di mana segala sesuatu di sekitarnya mencari rumput, yaitu suatu daerah yang kabar beritanya tidak samar lagi (terkenal), “seorang rasul yang membacakan ayat-ayat Kami kepada mereka,” yang membuktikan kebenaran ajaran yang dibawanya dan keshahihan sesuatu yang mereka serukan, sehingga perkataan (seruan) nya sampai kepada orang yang jauh dan yang dekat. Beda halnya kalau para rasul diutus di kota-kota yang jauh dan daerah-daerah yang terpencil. Yang demikian ini akan membuat dakwah tersembunyi (tidak dikenal) dan bersifat kasar (kurang luwes). Sedangkan kota-kota besar adalah tempat dimana diperkirakan dakwah akan lebih mudah diketahui dan lebih bisa tersebar. Dan biasanya penduduk kota itu lebih tidak kasar daripada orang lain (orang-orang badui, yang tidak berbudaya), “ dan tidak pernah pula Kami membinasakan kota-kota kecuali penduduknya dalam keadaan melakukan kezhaliman,” dengan berbuat kekufuran dan berbagai maksiat, mereka berhak ditimpa azab. Walhasil, bahwa Allah tidak akan mengazab seseorang kecuali karena kezhalimannya dan adanya penegakan hujjah atasnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 59: Kemudian Allah menjelaskan bahwa hikmah dari-Nya dan keadilan-Nya adalah Dia tidak akan membinasakan suatu negeri sampai Allah utus utusan padanya (Rasul), sebagai bukti yang nyata yang menjadi hujjah, di mana Rasul tersebut menyeru untuk mengibadahi Allah saja dan meninggalkan kesyirikan. Kemudian Allah menjelaskan bahwasanya Dia tidak akan membinasakan negeri ini kecuali penduduknya mendzalimi diri-diri mereka sendiri dengan kesyirikan, dan memperbolehkan diri-diri mereka menerobos syariat Allah dan mereka juga dalam keadaan mendustakan para Nabi-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di antara hikmah dan rahmat Allah adalah Dia tidak mengazab suatu umat pun karena kekafiran dan kemaksiatan mereka kecuali setelah ditegakkan hujjah, dengan diutus para rasul kepada mereka. Yakni di pusat kota yang sering didatangi manusia, di mana berita di sana mudah tersiar ke berbagai daerah. Yang menunjukkan benarnya apa yang mereka bawa dan benarnya seruan mereka serta memberikan peringatan kepada mereka sebelum azab datang, sehingga firman-Nya sampai kepada orang yang dekat maupun jauh, berbeda dengan pengutusan rasul di daerah-daerah terpencil yang biasanya keadaannya tersembunyi dan penduduknya terlalu kolot, adapun di daerah kota, biasanya berita mudah tersiar dan penduduknya tidak terlalu kolot. Dengan kekafiran dan kemaksiatan lagi berhak mendapatkan hukuman. Kesimpulannya, Allah Subhaanahu wa Ta'aala tidaklah mengazab seorang pun kecuali karena kezalimannya dan setelah ditegakkan hujjah kepadanya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 59",
    "description": "Jangan menduga bahwa kehancuran negeri-negeri terjadi dengansewenang-wenang. Tidak, Allah maha adil, dan karena itu tuhanmu tidak mungkin akan membinasakan negeri-negeri di sekitar mekah dan atau penduduknya pada masamu, wahai nabi Muhammad, betapa pun besarnya kedurhakaan mereka, sebelum dia mengutus seorang rasul di ibukotanya, yaitu mekah, yang membacakan ayat-ayat kami kepada mereka; dan tidak pernah pula terjadi kami membinasakan penduduk negeri setelah kami mengutus rasul atau pemberi peringatan; kecuali penduduknya melakukan kezaliman terhadap diri mereka sendiri dengan kufur dan maksiat kepada Allah, sehingga mereka pantas menerima hukuman. 60. Kaum musyrik enggan beriman karena khawatir diculik, ditawan dan dirampas hartanya. Sebenarnya, bahaya yang harus ditakuti itu adalah yang bersumber dari Allah akibat kedurhakaan. Kerugian jiwa dan harta di dunia tidak seberapa kerugian di akhirat akibat durhaka kepada tuhan. Dan ketahuilah bahwa apa saja; kekayaan, jabatan, keturunan dan lainnya, yang diberikan oleh Allah melalui siapa pun kepada kamu, maka itu adalah kesenangan hidup duniawi dan perhiasannya yang bersifat terbatas dan sementara, sehingga akan segera lenyap dan binasa; sedang apa yang di sisi Allah di akhirat kelak, yang disediakan untuk untuk orang-orang yang taat kepada-Nya, adalah lebih baik karena tidak mengandung bahaya dan mudarat, dan di samping itu lebih kekal karena tidak akan punah sama sekali. Tidakkah kamu menggunakan akal pikiran sehingga kamu mengerti mana yang baik dan mana yang buruk'."
  }
]