[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami kokohkan kekuasaan bagi mereka di muka bumi dan Kami menjadikan Fir’aun, Haman dan bala tentara mereka menyaksikan dari golongan yang tertindas ini apa yang mereka takuti, berupa kebinasaan mereka dan sirnanya kerajaan mereka serta terusirnya mereka dari negeri-negeri mereka sendiri oleh seseorang yang terlahir dari Bani Israil."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "6. Dan kami ingin meneguhkan mereka di negeri Mesir dengan menjadikan mereka sebagai penguasa atas Mesir dan menjadi penentu di Mesir, serta menjadikan Fir'aun dan penolongnya yang terbesar yaitu Haman dan bala tentaranya yang menolong keduanya dalam menjalankan kekuasaan mereka melihat apa yang mereka khawatirkan berupa habisnya dan hancurnya kekuasaan mereka di tangan seorang anak lelaki dari Bani Israil."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "6. Dan janji Kami ini meliputi peneguhan kekuasaan mereka dan pemberian sebab-sebab yang dapat mengokohkan kerajaan mereka di negeri Mesir. Adapun Fir’aun, menterinya -Haman-, dan bala tentara yang mentaati perintah mereka berdua akan melihat dengan mata kepala mereka bahaya yang datang dari arah yang mereka khawatirkan, yaitu dari anak lelaki yang dilahirkan dari Bani Israil yang telah Allah siapkan untuk merealisasikan tugasnya, meskipun anak ini tumbuh dalam naungan istana Fir’aun. Bukankah Allah berkuasa merealisasikan kehendak-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "6. وَنُمَكِّنَ لَهُمْ فِى الْأَرْضِ (dan akan Kami teguhkan kedudukan mereka di muka bumi) Yakni Kami akan jadikan mereka berkuasa di muka bumi sehingga mereka dapat berbuat apa yang mereka inginkan. وَنُرِىَ فِرْعَوْنَ وَهٰمٰنَ وَجُنُودَهُمَا(dan akan Kami perlihatkan kepada Fir’aun dan Haman beserta tentaranya) Yakni dan Allah akan memperlihatkan kepada Fir’aun. مِنْهُم(dari mereka) Yakni dari orang-orang yang tertindas tersebut. مَّا كَانُوا۟ يَحْذَرُونَ(apa yang selalu mereka khawatirkan dari mereka itu) Yakni yang selalu mereka hindari, yaitu kehancuran kerajaan mereka serta kebinasaan mereka di tangan seseorang yang dilahirkan dari Bani Israil yang tertindas."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "6. Akan Kami teguhkan kedudukan mereka di muka bumi. Juga akan Kami perlihatkan kepada Fir´aun dan Haman beserta tentaranya apa yang selalu mereka khawatirkan dari Bani Israil. Mereka takut kekuasaan mereka tumbang, takut binasa oleh seorang laki-laki dari suku mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami meneguhkan kedudukan} Kami menyediakan sebab-sebab mendapat kedudukan dan kemampuan {bagi mereka di bumi dan memperlihatkan kepada Firʻaun, Haman, dan bala tentara mereka apa yang selalu mereka takutkan dari mereka} yang mereka takutkan berupa hilangnya kekuasaan mereka di tangan laki-laki dari Bani Israil"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "6. “Dan akan Kami teguhkan kedudukan mereka di muka bumi.” Semua permasalahan ini berkaitan dengan kehendak (iradah) Allah adan sudah menjadi suratan keinginanNya “dan”, demikian pula Kami menghendaki agar “diperlihatkan kepada Fir’aun dan Hanan,” menterinya, “beserta tentaranya,” yang dengannya menyerang, berkeliling, mereka berbuat semena-mena dan berbuat zhalim “terhadap mereka,” maksudnya , terhadap golongan yang tertindas tersebut, “apa yang selalu mereka khawatirkan,” berupa kekhawatiran diusir dari kampung halaman mereka. Maka dari itu mereka berupaya keras untuk menumpas mereka, mematahkan kekuatan mereka dan membunuh anak-anak laki-laki mereka yang merupakan wadah dari kekuatan itu. Semua ini telah dikehendaki olleh Allah, dan apabila Dia telah menghendaki maka Dia mudahkan sebab-sebabnya dan membentangkan jalannya. Hal ini pun seperti itu. Allah telah menakdirkan dan telah memberlakukan segala sebab, -yang tidak disadari baik oleh para wali (pembela) Nya maupun oleh musuh-musuhNya-, yang dapat mengantarkan kepada maksud tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 6: Allah mengabarkan bahwasanya Allah menginginkan atas bani israil kokoh di muka bumi (setelah lemah) dan mempertunjukkan kepada fir’aun dan haman, dan sisa-sisa dari tentara mereka berdua atas apa yang mereka khawatirkan dan takutkan dari kerajaan mereka berdua melalui peran bani israil."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Di negeri Mesir dan Syam. Ini semua tergantung iradah dan kehendak Allah. Fir'aun selalu khawatir bahwa kerajaannya akan dihancurkan oleh Bani Israil, oleh karena itulah dia membunuh anak laki-laki yang lahir dari kalangan Bani Israil. Ayat ini menyatakan bahwa akan terjadi apa yang dikhawatirkannya itu. Allah Subhaanahu wa Ta'aala apabila menginginkan sesuatu, maka Dia memudahkan sebab-sebabnya dan menyiapkan jalannya, demikian pula dalam masalah ini. Dia telah menakdirkan dan menjalankan sebab-sebabnya yang tidak diketahui oleh wali-wali-Nya dan musuh-musuh-Nya, di mana sebab tersebut dapat mencapai kepada maksud yang dikehendaki Allah Subhaanahu wa Ta'aala. Awal sebab yang dimunculkan Allah adalah Dia mengadakan Rasul-Nya Musa ‘alaihis salam, yang Dia jadikan sebagai orang yang akan menyelamatkan Bani Israil ini melalui tangannya dan dengan sebabnya, di mana ketika itu sedang terjadi peristiwa yang mengerikan, yaitu penyembelihan terhadap anak laki-laki yang lahir. Allah mengilhamkan kepada ibu Nabi Musa agar menyusuinya dan tetap bersamanya. Jika ia khawatir terhadap anaknya, maka Allah mengilhamkan agar ia memasukkan bayinya ke dalam peti lalu menghanyutkannya ke sungai Nil."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 6",
    "description": "Dan selain itu kami juga akan teguhkan kedudukan mereka di muka bumi dengan mengutus dua orang nabi dari kalangan mereka, yaitu nabi musa dan nabi harun, untuk membimbing mereka, dan kami perlihatkan kepada fir'aun dan haman bersama bala tentaranya dan para pendukung mereka berdua apa yang selalu mereka takutkan dari mereka. Fir'aun selalu takut bahwa kerajaannya akan dihancurkan oleh bani israil, dan akan terusir dari negeri mesir, karena itu dia membunuh anak-anak laki-laki yang lahir di kalangan bani lsrail. Apa yang ditakutkannya itu sungguh akan terjadi. 7. Kehancuran kerajaan fir'aun terjadi melalui seorang laki-laki yang telah dipersiapkan, yaitu nabi musa dan langkahnya bermula dari kami ilhamkan berupa bisikan di dalam hati kepada ibunya musa yang anaknya akan berperan dalam kehancuran fir'aun dan kekuasaannya, bahwa, \"susuilah dia yakni musa, anakmu itu dengan tenang. Dan apabila engkau khawatir terhadapnya misalnya khawatir ada yang melihatmu menyusui anak lelaki atau khawatir jangan sampai anakmu dibunuh atas perintah fir'aun sebagaimana anak-anak lelaki lainnya, maka hanyutkanlah dia ke sungal nil setelah engkau letakkan dia di sebuah tempat yang dapat mengapung. Dan janganlah engkau takut dia akan tenggelam atau mati kelaparan atau akan terganggu oleh apa pun dan jangan pula bersedih hati karena kepergiannya, sesungguhnya kami akan mengembalikannya kepadamu dalam keadaan sengat bugar; dan setelah dewasa kami akan menjadikannya salah seorang dari kelompok para rasul yang diutus kepada bani israil. '."
  }
]