[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apa saja yang diberikan kepada kalian (wahai manusia) dari segala sesuatu berupa harta benda dan anak-anak, maka sesungguhnya itu hanyalah merupakan kenikmatan yang kalian bersenang-senang dengannya di kehidupan dunia ini dan merupakan perhiasan yang dijadikan penghias. Sedang apa yang ada di sisi Allah bagi orang-orang yang taat dan loyal kepadaNya adalah lebih baik dan lebih kekal; karena bersifat langgeng tanpa pernah habis. Maka apakah kalian tidak memiliki akal (wahai sekalian kaum) untuk merenung dengannya, sehingga kalian menjadi tahu antara kebaikan dari keburukan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "60. \"Apa yang diberikan oleh Rabb kalian itu adalah sesuatu yang kalian nikmati dan kalian gunakan untuk berhias dalam kehidupan dunia ini, kemudian setelah itu akan habis, sedang apa yang ada di sisi Allah berupa pahala yang agung di Akhirat itu lebih baik dan lebih kekal dari pada kenikmatan dunia dan perhiasannya, apakah kalian tidak memahami hal tersebut sehingga kalian mengutamakan sesuatu yang kekal atas sesuatu yang fana?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "60. Hai Manusia, segala kenikmatan yang Kami berikan yang kalian rasakan dan kalian harapkan akan selalu kalian dapatkan, merupakan kenikmatan yang diciptakan bagi kalian di kehidupan dunia dan perhiasan yang kalian pakai untuk menghias diri. Akan tetapi ketahuilah bahwa kenikmatan akhirat yang kekal yang ada di sisi Allah lebih baik bagi kalian; maka janganlah kalian menganggap keamanan, rezeki, dan kesehatan merupakan puncak dari tujuan kalian, sehingga kalian lalai dari mencari kenikmatan yang kekal. Tidakkah kalian mencari apa yang bermanfaat bagi kalian dengan akal yang telah Allah karuniakan bagi kalian, dan menyadari kebaikan yang hakiki bagi kalian?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "60. وَمَآ أُوتِيتُم مِّن شَىْءٍ فَمَتٰعُ الْحَيَوٰةِ الدُّنْيَا وَزِينَتُهَا ۚ (Dan apa saja yang diberikan kepada kamu, maka itu adalah kenikmatan hidup duniawi dan perhiasannya) Kalian akan menikmati itu selama kehidupan kalian kemudian kalian akan dipisahkan darinya atau ia akan dipisahkan dari kalian. وَمَا عِندَ اللهِ(sedang apa yang di sisi Allah) Yakni pahala dan balasan-Nya. خَيْرٌ(adalah lebih baik) Lebih baik daripada kenikmatan yang akan lenyap tersebut, sebab pahala dari Allah adalah kenikmatan yang tidak tercampur dengan keburukan. وَأَبْقَىٰٓ ۚ( dan lebih kekal) Sebab ia akan berlangsung selamanya, sedangkan kenikmatan dunia cepat sekali lenyap. أَفَلَا تَعْقِلُونَ (Maka apakah kamu tidak memahaminya?) Memahami bahwa yang kekal lebih baik daripada yang lenyap."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "60. Dan apa saja yang Kami berikan berupa kanikmatan dunia itu hanya harta benda yang sedikit dan hiasan nyata yang dapat kalian nikmati dalam kehidupan dunia kalian kemudian menghilang dari pandangan kalian. Dan apa yang ada di sisi Allah berupa pahala dan balasan akhirat di surga itu lebih baik daripada harta yang menghilang karena pahala itu abadi. Apakah kalian tidak berpikir bahwa sesuatu yang abadi itu lebih baik daripada suatu kefanaan yang akan hilang?!"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Apa pun yang dianugerahkan kepada kalian} sesuatu yang diberikan kepada kalian {adalah kesenangan hidup dunia dan perhiasannya, dan apa yang ada di sisi Allah itu lebih baik dan lebih kekal} lebih kekal {Apakah kalian tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "60. Ini adalah dorongan dari Allah kepada hamba-hambaNya untuk bersikap zuhud di dunia dan tidak terpedaya dengannya, dan untuk selalu mengharapkan kehidupan akhirat, menjadikannya sebagai tujuan dan dambaan seseorang. Dan Allah mengabarkan kepada mereka bahwa seluruh apa saja yang diberikan kepada manusia, seperti emas, perak, berbagai hewan ternak, harta benda, wanita, anak-anak, berbagai jenis makanan, minuman, dan berbagai kelezatan, semuanya adalah kenikmatan kehidupan dunia dan perhiasannya. Maksudnya, semua itu hanya dinikmati dalam waktu yang relative singkat, kesenangan sementara, penuh dengan kesulitan, bercampur dengan himpatan. Ia hanya bisa dijadikan sebagai perhiasan dalam waktu yang singkat untuk berbangga-bangga dan riya; kemudian ia akan sirna dengan cepat, dan ia akan musnah semuanya, dan pelakunya tidak akan mendapatkan sesuatu kecuali penyesalan, keluh kesah, kegagalan dan tidak mendapatkan kebaikan. “Sedang apa yang di sisi Allah” berupa kenikmatan abadi dan kehidupan yang menyenangkan “adalah lebih baik dan lebih kekal” lebih utama kualitas dan kuantitasnya, dan ia kekal abadi sepanjang masa. “Maka apakah kamu tidak memahaminya?” maksudnya, apakah kalian tidak mempunyai akal untuk mempertimbangkannya, yang mana dari dua perkara itu yang seharusnya diutamakan? Dan negeri yang mana yang lebih berhak untuk dikerahkan amal perbuatan untuknya? Hal ini membuktikan bahwa hal itu sesuai (dengan kadar) kesadaran akal seseorang, maka dia akan lebih mengutamakan akhirat daripada dunia; dan bahwa sebenarnya tidaklah seseorang lebih mengutamakan kehidupan dunia melainkan karena akalnya kurang!"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 60: Allah menjelaskan bahwasanya mereka (manusia) tidaklah diberikan kehidupan menyenangkan dan bahagia di dunia (kecuali) hanyalah kesenangan yang sebentar dan fana, dan kehidupan dunia hanyalah kesenangan yang sementara yang akan terputus. Wahai manusia, janganlah kalian tertipu padanya, ketahuilah bahwasanya apa yang di sisi Allah dari ganjaran dan kenikmatan, itulah sebaik-baik dari kenikmatan dunia yang akan tersisa dan kekal. Apakah akal-akal kalian tidak memikirkannya sehingga membuat kalian paham atas hakikat hal tersebut ?! Yang akan membuat sesuatu yang kekal di atas sesuatu yang fana."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini merupakan dorongan dari Allah Subhaanahu wa Ta'aala kepada hamba-hamba-Nya untuk bersikap zuhud terhadap dunia dan tidak tertipu olehnya serta lebih berharap kepada kesenangan di akhirat (surga) serta menjadikan hal itu sebagai cita-citanya. Allah Subhaanahu wa Ta'aala memberitahukan, bahwa semua yang diberikan kepada manusia, baik emas, perak, hewan, perhiasan, barang-barang, wanita, anak-anak, makanan dan minuman serta kenikmatan duniawi lainnya, adalah kesenangan kehidupan dunia dan perhiasannya, yakni dipakai bersenang-senang dalam waktu sesaat dan terbatas, penuh dengan kekurangan, kesusahan dan kesedihan, kemudian akan segera hilang dan habis sehingga pemiliknya kecewa dan rugi. Selanjutnya akan fana’ (binasa). Berupa kenikmatan yang kekal dan kehidupan yang sejahtera. Yakni lebih baik sifatnya dan jumlahnya lagi kekal selama-lamanya. Maksudnya, tidakkah kamu memiliki akal sehingga kamu dapat menimbang, manakah yang lebih layak didahulukan dan negeri mana yang lebih layak diutamakan; yang kekal atau sementara? Hal ini menunjukkan, bahwa semakin cerdas akal seseorang, maka semakin besar pengutamaannya kepada akhirat, dan bahwa tidaklah seseorang mengutamakan dunia, kecuali karena kekurangan pada akalnya. Oleh karena itulah, pada ayat selanjutnya, Allah Subhaanahu wa Ta'aala menyadarkan akal agar mau menimbang kesudahan dari mengutamakan dunia dengan kesudahan dari mengutamakan akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 60",
    "description": "Kaum musyrik enggan beriman karena khawatir diculik, ditawan dan dirampas hartanya. Sebenarnya, bahaya yang harus ditakuti itu adalah yang bersumber dari Allah akibat kedurhakaan. Kerugian jiwa dan harta di dunia tidak seberapa kerugian di akhirat akibat durhaka kepada tuhan. Dan ketahuilah bahwa apa saja; kekayaan, jabatan, keturunan dan lainnya, yang diberikan oleh Allah melalui siapa pun kepada kamu, maka itu adalah kesenangan hidup duniawi dan perhiasannya yang bersifat terbatas dan sementara, sehingga akan segera lenyap dan binasa; sedang apa yang di sisi Allah di akhirat kelak, yang disediakan untuk untuk orang-orang yang taat kepada-Nya, adalah lebih baik karena tidak mengandung bahaya dan mudarat, dan di samping itu lebih kekal karena tidak akan punah sama sekali. Tidakkah kamu menggunakan akal pikiran sehingga kamu mengerti mana yang baik dan mana yang buruk'61. Maka, jika demikian itu halnya, apakah sama orang yang kami janjikan kepadanya suatu janji yang baik, yaitu surga dengan segala kenikmatannya yang abadi, lalu berkat anugerah kami dia memperolehnya, apakah dia itu sama dengan orang yang kami berikan kepadanya kese-nangan hidup duniawi, tetapi tidak dipergunakannya untuk mencari kebahagiaan hidup di akhirat, sehingga kemudian pada hari kiamat dia termasuk orang-orang yang diseret ke dalam neraka untuk dimintakan pertanggunggjawaban dan diberi balasan' tentu tidaklah sama. Yang pertama adalah orang yang beriman dan beramal saleh yang berhak mendapatkan janji baik Allah berupa pahala dan surga, dan yang kedua adalah orang kafir yang mengerjakan keburukan serta tertipu oleh kesenangan dunia dan perhiasannya, yang akan binasa dalam siksaan."
  }
]