[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Apakah orang yang Kami janjikan dari hamba-hamba Kami atas ketaatannya kepada kami dengan surga, lalu dia mendapatkan apa yang dijanjikan kepadanya dan ia menuju kesana, sama seperti orang yang Kami berikan kenikmatan duniawi kepadanya di kehiduan dunia ini, lalu dia bersenang-senang dengannya dan lebiih mengutamakan kenyamanan hidup duniawi dibandingkan ukhrawi, kemudian dia di Hari Kiamat termasuk orang-orang yang diajukan untuk menghadapi perhitungan perbuatan-perbuatan dan pembalasannya? Dua golongan itu tidak sama. Maka hendaklah orang yang berakal memilih pilihan yang terbaik bagi dirinya, yaitu taat kepada Allah dan mengharap keridhaanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "61. Samakah antara orang yang Kami janjikan baginya surga di Akhirat dan segala kenikmatan yang kekal di dalamnya dengan orang yang Kami berikan kenikmatan padanya berupa harta dan perhiasan di kehidupan dunia, kemudian pada اari Kiamat ia termasuk orang yang dimasukkan ke dalam neraka Jahanam?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "61. Tidak sama antara orang yang mendapat janji berupa pahala dari Kami pada hari kiamat, sehingga dia berusaha kehidupannya penuh dengan amal shalih sesuai dengan apa yang Kami inginkan, dengan orang yang tertipu oleh kenikmatan yang fana di kehidupan dunia dan dia akan menghadap kepada Kami pada hari kiamat dalam keadaan sendiri; apakah sama antara keduanya dalam apa yang disiapkan bagi mereka berdua?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "61. أَفَمَن وَعَدْنٰهُ وَعْدًا حَسَنًا (Maka apakah orang yang Kami janjikan kepadanya suatu janji yang baik) Kami janjikan kepadanya surga dan segala kenikmatan yang ada didalamnya yang tak terhitung jumlahnya. فَهُوَ لٰقِيهِ(lalu ia memperolehnya,) Yakni pasti akan meraihnya, sebab Allah tidak akan mengingkari janji-Nya. كَمَن مَّتَّعْنٰهُ مَتٰعَ الْحَيَوٰةِ الدُّنْيَا(sama dengan orang yang Kami berikan kepadanya kenikmatan hidup duniawi) Yang diberi sebagian kenikmatan dunia yang Allah kehendaki, sedangkan kenikmatan itu cepat sekali lenyap dan habis. ثُمَّ هُوَ يَوْمَ الْقِيٰمَةِ مِنَ الْمُحْضَرِينَ (kemudian dia pada hari kiamat termasuk orang-orang yang diseret (ke dalam neraka)?) Yakni orang-orang yang didatangkan untuk diazab di neraka. Apakah mereka berdua sama?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "61. Maka apakah orang yang Kami janjikan surga dan kenikmatannya dengan janji yang ikhlas dan pasti diwujudkan sebagai balasan baik atas amalnya, lalu dia menerima dan menyadarinya sebagai sesuatu yang tidak mustahil karena Allah tidak mungkin mengingkari janji itu sama dengan orang yang Kami beri kenikmatan dunia yang segera hilang dan berbaur dengan penderitaan dan kesulitan kemudian pada hari kiamat dia termasuk orang-orang yang dihadirkan untuk dihisab dan disiksa di neraka? Apakah keduanya sama?! Ayat ini diturunkan untuk Nabi SAW dan Abu Jahal bin Hisyam atau untuk Hamzah dan Abu Jahal"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka apakah orang yang Kami janjikan kepadanya suatu janji yang baik lalu dia memperolehnya} lalu dia mengetahui dan mendapatkannya {itu sama seperti orang yang Kami beri kesenangan hidup dunia, kemudian pada hari kiamat dia termasuk orang-orang yang dibawa} digiring menuju neraka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "61. Oleh karenanya Allah mengingatkan akal untuk melakukan pertimbangan antara akibat orang yang lebih mengutamakan dunia dengan orang yang lebih mengutamakan akhirat, seraya berfirman, “Maka apakah orang yang Kami janjikan kepadanya suatu janji yang baik (surge) lalu dia memperolehnya,” maksudnya, apakah sama orang yang beriman, yang selalu berupaya sekuat tenaga untuk akhirat, sedangkan dia telah berbuat berdasarkan janji Rabbnya, yaitu ia akan memperoleh pahala yang baik, yaitu surge dan segala kenikmatan agung yang ada di dalamnya, lalu dia pasti memperolehnya, tidak diragukan lagi, sebab itu adalah janji dari Dzat Yang Maha Pemurah yang Mahabenar janjiNya, Dia tidak pernah mengingkari janji kepada seorang hamba yang berbuat untuk mendapat keridhaan Rabbnya dan menjauhi murkaNya, “sama dengan orang yang Kami berikan kepadanya kenikmatan hidup duniawi” sehingga dia dapat mengambil dan memberi, makan dan minum, bersenang-senang sebagaimana hewan-hewan ternak bersenang-senang. Ia sibuk dengan dunianya dengan melupakan akhiratnya, sama sekali tidak peduli terhadap petunjuk Allah, tidak mau tunduk kepada para rasul, lalu dia terus seperti itu, dia tidak membekali diri dari dunianya kecuali kerugian dan kebinasaan. “Kemudian dia pada hari Kiamat termasuk orang-orang yang dihadirkan (ke neraka)” untuk dihisab. Dan dia sudah dikenal tidak pernah mempersiapkan kebaikan untuk dirinya sendiri, dan dia hanya mempersiapkan hal-hal yang membahayakan dirinya, dia pun beralih ke negeri pembalasan amal perbuatan. Lalu bagaimana menurut kalian, ke mana dia akan kembali? Apa dugaan kalian? Apa yang akan diperlakukan terhadapnya? Maka orang yang berakal hendaklah memilih untuk dirinya apa yang lebih baik untuk dijadikan pilihan, mana yang lebih berhak dari dua perkara ini untuk diutamakan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 61: Apakah sama seorang hamba yang beriman yang ia dijanjikan dengan janji yang pasti, yang tiada keraguan padanya dengan dimasukkan ke dalam surga jika hamba tersebut beriman dan bertakwa serta beramal dengan amalan shalih, di mana seorang hamba tersebut jauh dari kenikmatan dunia yang fana dan ia tersibukkan dengan urusan akhirat ?! Kemudian apakah sama hisab dan balasannya ? Jawabannya adalah tidak sama, sama sekali antara keduanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni apakah sama seorang mukmin yang berusaha untuk akhirat karena mengingat janji Allah di akhirat berupa surga dan kenikmatan yang ada di dalamnya dengan orang yang mengambil kesenangan dunia, yang makan dan minum serta bersenang-senang sebagaimana hewan, sibuk dengan dunianya sampai lupa dengan akhirat, tidak mempedulikan petunjuk Allah dan tidak tunduk kepada rasul-Nya, dan ia tetap seperti itu, di mana ia tidak mengambil bekal dari dunia ini selain kerugian dan kebinasaan? Apakah keduanya sama? Selain itu, di akhirat ia termasuk orang yang dihadapkan untuk dihisab sedangkan dirinya tidak menyiapkan kebaikan untuk dirinya, bahkan hal yang membahayakan yang dia siapkan, bagaimanakah keadaannya nanti dan apa yang dapat dia lakukan dengan amalnya itu? Oleh karena itu, hendaknya orang yang berakal melihat keadaan dirinya, mana yang lebih dia pilih dan dia dahulukan serta apa yang telah dia siapkan? Sesungguhnya orang yang diberi kenikmatan hidup duniawi, tetapi tidak mempergunakannya sama sekali untuk mencari kebahagiaan hidup di akhirat, maka dia siap diseret ke dalam neraka. Yang memiliki kekurangan, keterbatasan dan tidak kekal."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 61",
    "description": "Maka, jika demikian itu halnya, apakah sama orang yang kami janjikan kepadanya suatu janji yang baik, yaitu surga dengan segala kenikmatannya yang abadi, lalu berkat anugerah kami dia memperolehnya, apakah dia itu sama dengan orang yang kami berikan kepadanya kese-nangan hidup duniawi, tetapi tidak dipergunakannya untuk mencari kebahagiaan hidup di akhirat, sehingga kemudian pada hari kiamat dia termasuk orang-orang yang diseret ke dalam neraka untuk dimintakan pertanggunggjawaban dan diberi balasan' tentu tidaklah sama. Yang pertama adalah orang yang beriman dan beramal saleh yang berhak mendapatkan janji baik Allah berupa pahala dan surga, dan yang kedua adalah orang kafir yang mengerjakan keburukan serta tertipu oleh kesenangan dunia dan perhiasannya, yang akan binasa dalam siksaan. 62. Dan ingatlah dan ingatkan pula umatmu, wahai nabi Muhammad, tentang siksa yang akan dialami oleh orang-orang musyrik di akhirat kelak, yaitu pada hari ketika mereka berdiri di hadapan Allah untuk dimintakan pertanggungjawaban, dia menyeru mereka dengan panggilan yang menghinakan dan berfirman, 'di manakah sembahan-sembahan yang kamu anggap sebagai sekutu-sekutu-ku yang dahulu kamu sangka sebagai tuhan-tuhan yang akan membela dan menolong kamu''."
  }
]