[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pada hari Allah menyeru orang-orang yang menyekutukan para wali dan berhala-berhala denganNya di dunia ini, kemudian Allah berfirman kepada mereka, “Manakah sekutu-sekutuKu yang dahulu kalian beranggapan bahwa mereka adalah sekutu-sekutu bagiKu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "62. Dan pada hari ketika Rabb -Subḥānahu wa Ta'ālā- menyeru mereka, “Mana sekutu-sekutu kalian yang dahulu kalian sembah selain Aku dan kalian yakini mereka adalah sekutu-sekutu bagi-Ku?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "62. Hai manusia, ingatlah hari ketika Allah menyeru orang-orang musyrik yang menyembah selain Dia: “Dimanakah orang-orang yang kalian anggap sebagai sekutu-sekutu itu? Panggillah mereka untuk menyelamatkan kalian dan memberi kalian syafaat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "62. وَيَوْمَ يُنَادِيهِمْ (Dan (ingatlah) hari (di waktu) Allah menyeru mereka) Allah menyeru orang-orang musyrik. فَيَقُولُ(seraya berkata) Kemudian Dia berfirman kepada mereka. أَيْنَ شُرَكَآءِىَ الَّذِينَ كُنتُمْ تَزْعُمُونَ(“Di manakah sekutu-sekutu-Ku yang dahulu kamu katakan?”) Yakni yang kalian katakan bahwa mereka akan menolong dan memberi syafaat bagi kalian?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "62. Wahai Nabi, dan ingatlah hari dimana Allah memanggil orang-orang musyrik itu pada hari kiamat dengan panggilan ejekan. Dia berfirman kepada mereka: “Dimana sekutu-sekutu yang kalian anggap sebagai sekutu-sekutuKu?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) hari ketika Dia menyeru mereka} Allah menyeru orang-orang musyrik itu {dan berfirman,“Di manakah sekutu-sekutuKu yang dahulu selalu kalian sangkakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62-63. Ini adalah informasi dari Allah tentang apa yang akan Dia tanyakan kepada manusia di Hari Kiamat kelak, dan bahwa Dia akan menanyakan kepada mereka tentang prinsi-prinsip segala sesuatu, tentang ibadah kepada Allah dan memenuhi seruan para rasul, seraya berfiman, “dan (ingatlah) pada hari di waktu Allah menyeru mereka,” maksudnya, Allah menyeru orang-orang yang menyekutukan sesuatu dengan Allah, mereka menyembahnya dan berharap mendapatkan manfaat darinya dan dapat menolak bahaya dari mereka. Allah menyeru mereka untuk menjelaskan kepada mereka ketidakberdayaan para sekutu itu dan kesesatan mereka, “seraya berkata, ‘Dimanakah sekutu-sekutuKu’.” Sesungguhnya Allah sama sekali tidakn mempunyai sekutu, akan tetapi hal ini diungkapkan berdasarkan anggapan dan kedustaan yang mereka lakukan; oleh karena itu Allah berfirman, “yang dahulu kamu katakan?” di mana mereka saat ini? Mana manfaat mereka? Mana pencegahan mereka? Sebagaimana dimaklumi, bahwa pada saat itu akan menjadi jelas sekali bahwa sembahan yang mereka sembah dan yang mereka harapkan adalah palsu (batil) sirna dan begitu pula harapan mereka kepadanya. Saat itulah mereka mengakui diri mereka sesat dan celaka. Oleh karenanya, Dia berfirman, “Berkatalah orang-orang yang telah tetap hukuman atas mereka,” yaitu para pemimpin dan para pembesar dalam kekafiran dan kejahatan, sambil mengakui kesesatan dan penyesatan mereka, “Ya Rabb kami, mereka inilah,” para pengikut, “orang-orang yang kami sesatkan itu; kami telah menyesatkan mereka sebagaimana kami (sendiri) sesat.” Maksudnya, semua kami sudah sama-sama sesat dan sudah pasti mendapatkan putusan azab, “kami menyatakan berlepas diri (dari neraka) kepadaMu,” dari peribadatan mereka. Maksudnya, kami berlepas diri dari mereka dan dari amal perbuatan mereka, “mereka sekali-kali tidak menyembah kami.” Sebenarnya mereka hanya menyembah setan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 62: Yaitu di mana hari yang terdapat seruan Allah kepada orang-orang musyrik, seraya Allah berkata kepada mereka : Di mana sekutu-sekutu itu, yang kalian menyekutukanku ?!!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ini adalah pemberitahuan dari Allah Subhaanahu wa Ta'aala tentang pertanyaan-Nya nanti kepada semua makhluk, dan bahwa Dia akan bertanya tentang perkara yang paling penting, yaitu tentang ibadah mereka kepada Allah di mana karena itulah mereka diciptakan, demikian pula tentang jawaban terhadap para rasul. Yakni untuk menerangkan lemahnya sekutu-sekutu itu (patung dan berhala yang mereka sembah selain Allah). Serta menerangkan kesesatan mereka. Yakni di mana mereka, mana manfaatnya dan mana bukti mereka mampu membela kamu? Ketika itu jelaslah, bahwa sekutu-sekutu yang mereka sembah selain Allah itu adalah batil, lenyap zatnya dan apa yang mereka harapkan darinya. Oleh karena itulah, mereka mengakui kesesatannya. Hal ini menunjukkan bahwa sekutu-sekutu itu hanyalah sangkaan dan kedustaan mereka, padahal Allah tidak memiliki sekutu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 62",
    "description": "Dan ingatlah dan ingatkan pula umatmu, wahai nabi Muhammad, tentang siksa yang akan dialami oleh orang-orang musyrik di akhirat kelak, yaitu pada hari ketika mereka berdiri di hadapan Allah untuk dimintakan pertanggungjawaban, dia menyeru mereka dengan panggilan yang menghinakan dan berfirman, 'di manakah sembahan-sembahan yang kamu anggap sebagai sekutu-sekutu-ku yang dahulu kamu sangka sebagai tuhan-tuhan yang akan membela dan menolong kamu''63. Mendengar pertanyaan itu, orang-orang yang sudah pasti akan mendapatkan hukuman Allah, yaitu para pemimpin kaum kafir, berkata, 'ya tuhan pemelihara dan pelimpah aneka nikmat kepada kami, kami mengaku bahwa mereka inilah orang-orang yang dahulu kami sesatkan itu, melalui ucapan, tindakan dan keteladanan kami. Dengan mengharap akan dibebaskan atau diringankan dari siksa mereka melontarkan pengakuan dengan berkata, 'kami mengaku telah menyesatkan mereka sebagaimana kami sendiri sesat. Tetapi hal itu karena mereka sendiri telah memilih dan menerima kekufuran sebagaimana halnya kami. Pada hari ini, kami menyatakan kepada engkau berlepas diri dari segala sesuatu tentang mereka, dan juga dari kekufuran yang mereka pilih di dunia. Mereka sekali-kali tidak menyembah atau menaati kami, tetapi mereka menyembah dan menuruti hawa nafsu mereka sendiri. '."
  }
]