[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang yang sudah ditetapkan tertimpa siksaan, yaitu mereka para penyeru kepada kekufuran berkata, “Wahai Tuhan kami, mereka inilah yang telah kami sesatkan, kami menyesatkan mereka sebagaimana kami telah sesat jalan. Kami berlepas diri kepada Engkau untuk membela dan menolong mereka. Mereka itu tidaklah menyembah kami. Sesungguhnya mereka itu hanyalah menyembah setan-setan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "63. Maka orang-orang yang pasti mendapatkan siksa dari kalangan penyeru pada kekafiran berkata, ”Wahai Rabb kami, mereka yang telah kami sesatkan sebagaimana kami sendiri telah tersesat, kami berlepas dari mereka kepada-Mu, mereka tidaklah menyembah kami, akan tetapi mereka menyembah setan-setan.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "63. Maka menjawablah orang-orang yang berhak mendapat azab dari golongan para pemimpin dan pembesar orang-orang kafir serta orang-orang yang menghiasi kerusakan kepada orang lain sebagai kebaikan: “Ya Tuhan kami, mereka adalah orang-orang yang kami ajak menuju kesesatan sehingga mereka tersesat sebagaimana kami tersesat, kami berlepas diri dari penyembahan mereka kepada kami; dan tidak ada yang mampu menolong kami. Para pengikut kami itu telah menuruti hawa nafsu mereka, sedangkan kami mengakui ketuhanan-Mu.” Mereka berlepas diri dari para pengikut mereka yang sesat, dan mengira itu akan meringankan azab mereka atau dapat menjauhkan para pengikut itu dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "63. قَالَ الَّذِينَ حَقَّ عَلَيْهِمُ الْقَوْلُ (Berkatalah orang-orang yang telah tetap hukuman atas mereka) Pada hari kebangkitan, akan berkata orang-orang yang berhak mendapatkan azab, yaitu para pemimpin kesesatan yang dijadikan oleh orang-orang kafir sebagai tuhan-tuhan: رَبَّنَا هٰٓؤُلَآءِ الَّذِينَ أَغْوَيْنَآ(“Ya Tuhan kami, mereka inilah orang-orang yang kami sesatkan itu) Yakni kami ajak pengikut-pengikut kami ke dalam kesesatan. أَغْوَيْنٰهُمْ كَمَا غَوَيْنَا ۖ( ami telah menyesatkan mereka sebagaimana kami (sendiri) sesat) Yakni kami sesatkan mereka seperti kesesatan kami. تَبَرَّأْنَآ إِلَيْكَ ۖ( kami menyatakan berlepas diri (dari mereka) kepada Engkau) Yakni para pemimpin kesesatan dan setan-setan itu berlepas diri dari orang-orang yang mentaati mereka. مَا كَانُوٓا۟ إِيَّانَا يَعْبُدُونَ(mereka sekali-kali tidak menyembah kami”) Yakni akan tetapi mereka dahulu menyembah hawa nafsu mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "63. Orang-orang yang telah ditetapkan azabnya pada hari kiamat, yaitu para pemimpin Kafir itu berkata: “Ya Tuhan Kami, itulah orang-orang yang kami seru menuju kesesatan dan kesyirikan lalu mereka ikut. Kami menyesatkan mereka sebagaimana kami sendiri sesat. Kami berlepas diri kepadaMu dari mereka dan kekufuran mereka. Mereka tidak menyembah kami, melainkan menyembah hawa nafsu mereka”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang sudah pasti mendapatkan hukuman} yang pasti menerima azab {berkata,“Ya Tuhan kami, mereka inilah orang-orang yang kami sesatkan} Kami sesatkan {Kami telah menyesatkan mereka sebagaimana kami telah tersesat} Kami menyesatkan mereka sebagaimana kami tersesat {Kami berlepas diri (dari mereka) kepadaMu. Mereka sekali-kali tidaklah menyembah kami”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "62-63. Ini adalah informasi dari Allah tentang apa yang akan Dia tanyakan kepada manusia di Hari Kiamat kelak, dan bahwa Dia akan menanyakan kepada mereka tentang prinsi-prinsip segala sesuatu, tentang ibadah kepada Allah dan memenuhi seruan para rasul, seraya berfiman, “dan (ingatlah) pada hari di waktu Allah menyeru mereka,” maksudnya, Allah menyeru orang-orang yang menyekutukan sesuatu dengan Allah, mereka menyembahnya dan berharap mendapatkan manfaat darinya dan dapat menolak bahaya dari mereka. Allah menyeru mereka untuk menjelaskan kepada mereka ketidakberdayaan para sekutu itu dan kesesatan mereka, “seraya berkata, ‘Dimanakah sekutu-sekutuKu’.” Sesungguhnya Allah sama sekali tidakn mempunyai sekutu, akan tetapi hal ini diungkapkan berdasarkan anggapan dan kedustaan yang mereka lakukan; oleh karena itu Allah berfirman, “yang dahulu kamu katakan?” di mana mereka saat ini? Mana manfaat mereka? Mana pencegahan mereka? Sebagaimana dimaklumi, bahwa pada saat itu akan menjadi jelas sekali bahwa sembahan yang mereka sembah dan yang mereka harapkan adalah palsu (batil) sirna dan begitu pula harapan mereka kepadanya. Saat itulah mereka mengakui diri mereka sesat dan celaka. Oleh karenanya, Dia berfirman, “Berkatalah orang-orang yang telah tetap hukuman atas mereka,” yaitu para pemimpin dan para pembesar dalam kekafiran dan kejahatan, sambil mengakui kesesatan dan penyesatan mereka, “Ya Rabb kami, mereka inilah,” para pengikut, “orang-orang yang kami sesatkan itu; kami telah menyesatkan mereka sebagaimana kami (sendiri) sesat.” Maksudnya, semua kami sudah sama-sama sesat dan sudah pasti mendapatkan putusan azab, “kami menyatakan berlepas diri (dari neraka) kepadaMu,” dari peribadatan mereka. Maksudnya, kami berlepas diri dari mereka dan dari amal perbuatan mereka, “mereka sekali-kali tidak menyembah kami.” Sebenarnya mereka hanya menyembah setan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 63: Maka berkatalah gembong-gembong kesesatan dan imam-imam sesat (yang pantas bagi mereka untuk diadzab), mereka berkata : Wahai Tuhan kami, merekalah para pengikut kami yang telah kami sesatkan dan kami jerumuskan sebagaimana keadaan kami, setiap dari kami telah menyekutukan-Mu dan tersesat, kami telah bertabaruk kepada selain-Mu yaitu kepada sekutu-sekutu selain-Mu beserta amalan-amalan mereka yang kami telah beribadah kepada mereka (sesembahan-sesembahan selain-Mu), bahkan kami telah mengikuti hawa nafsu mereka dan menyembah setan-setan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, para pemimpin kekafiran dan keburukan berkata sambil mengakui kesesatannya, atau bisa juga maksud “orang-orang yang sudah pasti akan mendapatkan hukuman” adalah mereka (sesembahan-sesembahan orang kafir) yang disekutukan dengan Allah. Yakni para pengikutnya. Yakni bahwa mereka menyesatkan pengikut-pengikutnya adalah dengan kemauan pengikut-pengikut itu sendiri, bukan karena paksaan dari pihak mereka, sebagaimana mereka sendiri sesat karena kemauan mereka pula. Demikian pula ibadah yang mereka lakukan. Yang mereka sembah adalah setan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 63",
    "description": "Mendengar pertanyaan itu, orang-orang yang sudah pasti akan mendapatkan hukuman Allah, yaitu para pemimpin kaum kafir, berkata, 'ya tuhan pemelihara dan pelimpah aneka nikmat kepada kami, kami mengaku bahwa mereka inilah orang-orang yang dahulu kami sesatkan itu, melalui ucapan, tindakan dan keteladanan kami. Dengan mengharap akan dibebaskan atau diringankan dari siksa mereka melontarkan pengakuan dengan berkata, 'kami mengaku telah menyesatkan mereka sebagaimana kami sendiri sesat. Tetapi hal itu karena mereka sendiri telah memilih dan menerima kekufuran sebagaimana halnya kami. Pada hari ini, kami menyatakan kepada engkau berlepas diri dari segala sesuatu tentang mereka, dan juga dari kekufuran yang mereka pilih di dunia. Mereka sekali-kali tidak menyembah atau menaati kami, tetapi mereka menyembah dan menuruti hawa nafsu mereka sendiri. '64. Tidak hanya sampai di situ kecaman dan siksaan batin yang mere-ka peroleh. Dan pada hari kiamat dikatakan kepada mereka yang menyekutukan Allah, 'serulah sekutu-sekutumu yang dahulu kamu sembah selain Allah, agar dapat membantu kamu dalam situasi sulit ini seba-gaimana dugaan kamu ketika masih hidup. ' lalu, karena bingung tidak mengetahui apalagi yang harus mereka kerjakan, mereka menyerunya, tetapi yang diseru tidak menyambutnya, dan saat itu mereka semua melihat azab yang tersedia dan yakin bahwa mereka akan disiksa dengannya. Ketika itu mereka menyesal dan berkeinginan sekiranya mereka dahulu menerima petunjuk kebenaran, sehingga mereka tidak mendapat siksa. Tetapi apalah artinya penyesalan di kemudian hari."
  }
]