[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dikatakan kepada orang-orang yang menyekutukan Allah pada Hari Kiamat, “Panggillah sekutu-sekutu kalian yang dahulu kalian sembah selain Allah. orang-orang itu memanggil sekutu-sekutu itu, akan tetapi sekutu-sekutu itu tidak menyambut panggilan mereka. Seandainya mereka dahulu di dunia menerima petunjuk menuju kebenaran, pastilah mereka tidak disiksa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "64. Dan dikatakan kepada mereka, “Serulah sekutu-sekutu kalian agar menyelamatkan kalian dari kehinaan yang kalian alami.” Maka mereka menyeru sekutu-sekutu mereka dan para sekutu tersebut tidak menjawab seruan mereka, dan mereka menyaksikan azab yang disiapkan untuk mereka. Sekiranya mereka dahulu termasuk orang-orang yang mendapat petunjuk pada kebenaran, niscaya tidaklah mereka terjerumus ke dalam azab."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "64. Pada hari kiamat orang-orang musyrik akan diseru: “Panggillah sekutu-sekutu yang dahulu kalian sembah selain Allah, agar mereka dapat menjauhkan kalian dari azab.” Maka mereka mulai meminta pertolongan, namun tidak ada seorangpun yang menjawab atau memberi sedikit pertolongan bagi mereka. Mereka menyaksikan dengan mata kepala mereka sendiri azab yang telah menunggu mereka, sehingga mereka yakin para sekutu mereka tidak mampu menolong mereka sedikitpun. Seandainya mereka menerima kebenaran ketika di dunia niscaya mereka tidak akan melihat azab itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "64. وَقِيلَ ادْعُوا۟ شُرَكَآءَكُمْ (Dikatakan (kepada mereka) “Serulah olehmu sekutu-sekutu kamu”) Dikatakan kepada orang-orang kafir dari golongan manusia: mintalah tolong kepada tuhan-tuhan kalian yang dahulu kalian sembah selain Allah di dunia, agar mereka menolong dan membela kalian. فَدَعَوْهُمْ (lalu mereka menyerunya) Ketika itu juga. فَلَمْ يَسْتَجِيبُوا۟ لَهُمْ(maka sekutu-sekutu itu tidak memperkenankan (seruan) mereka) Dan mereka tidak dapat memberi manfaat sedikitpun bagi mereka. وَرَأَوُا۟ الْعَذَابَ ۚ( dan mereka melihat azab) Yakni pengikut dan yang diikuti sama-sama melihat azab ketika azab itu didatangkan kepada mereka dan telah mengepung mereka. لَوْ أَنَّهُمْ كَانُوا۟ يَهْتَدُونَ (kiranya mereka dahulu menerima petunjuk) Yakni seandainya mereka menerima petunjuk niscaya itu akan menyelamatkan mereka dan tidak akan melihat azab."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "64. Dan dikatakan kepada orang-orang kafir: “Panggillah berhala-berhala yang kalian anggap sebagai sekutu-sekutu Allah, supaya mereka menolong dan menyelamatkan kalian” Lalu mereka memanggil berhala-berhala itu, namun tidak menjawab mereka karena memang tidak mampu menjawab. Dan dua golongan yaitu pengikut dan orang yang diikuti melihat azab yang menimpa mereka. Lalu mereka berangan-angan jika saja mereka adalah orang-orang yang mendapat petunjuk di dunia menuju kebenaran, maka mereka akan selamat dari siksa ini saat melihat azab ini di akhirat. Jawab dari {Law} itu sudah dipahami dalam konteks kalam tersebut yaitu {wa ra’aul ‘adzaab}"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dikatakan,“Serulah sekutu-sekutu kalian”, lalu mereka menyerunya, tetapi mereka (yang diseru) tidak menjawabnya. Mereka melihat} mereka melihat {azab. seandainya mereka dahulu menerima petunjuk} mereka mengharapkan seandainya mereka di dunia dulu termasuk orang-orang yang menerima petunjuk"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "64. “Dikatakan” kepada mereka, “Serulah olehmu sekutu-sekutumu,” sebagaimana dambaan kalian untuk mendapatkan manfaat dari mereka, maka diperintahlah mereka untuk memanggil sesembahan-sesembahan mereka dalam waktu yang sangat sullit itu, di mana penyembah sangat butuh kepada sembahannya. “Lalu mereka menyerunya,” agar menolong mereka atau menyelamatkan mereka dari azab Allah barang sedikit, “namun sekutu-sekutu itu tidak memperkenankan (seruan) mereka.” Maka saat itu orang-orang kafir mengetahui bahwa mereka adalah orang-orang yang dusta, yang berhak mendapat siksa; “dan mereka melihat azab,” yaitu yang akan menimpa mereka. Mereka melihatnya dengan mata kepala setelah mereka sebelumnya mendustakan dan mengingkarinya. “Kalau sekiranya dahulu mereka menerima petunjuk,” maka tentu mereka tidak ditimpa azab yang pasti menimpa mereka, dan tentu mereka tidak ditimpa azab yang pasti menimpa mereka, dan tentu mereka diberi petunjuk ke jalan menuju surge; sebagaimana mereka mendapat petunjuk saat di dunia. Akan tetapi mereka tidak mencari petunjuk, maka dari itu mereka tidak diberi petunjuk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 64: Dikatakan kepada mereka orang-orang kafir dengan perendahan dan penghinaan : Panggillah sesembahan-sesembahan kalian yang telah kalian ibadahi selain Allah; Untuk menolong dan menyelamatkan kalian dari apa yang menimpa kalian. Maka mereka menyeru sesembahan mereka, akan tetapi tidak ada yang menjawab seruan mereka dan tidak bermanfaat seruan mereka, maka tahulah mereka bahwa sesembahan-sesembahan mereka bukanlah siapa-siapa, kemudian ditimpakanlah adzab bagi mereka yang mereka pantas menerimanya dan mereka takutkan. Kalau sekiranya mereka tertunjuki dengan keimanan dan tauhid maka sungguh mereka tidak akan tertimpa demikian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Untuk memberi manfaat kepadamu atau menghindarkan azab. Mereka diperintahkan memanggil sekutu-sekutu itu untuk menolong mereka saat itu. Orang-orang yang kafir itu akhirnya menyadari bahwa bahwa mereka telah berdusta dan berhak mendapatkan hukuman. Dengan mata kepala mereka setelah sebelumnya mereka mendustakan dan mengingkarinya. Bisa juga diartikan, “Kalau sekiranya mereka mendapatkan petunjuk, tentu tidak akan terjadi hal itu, dan tentu mereka akan ditunjuki ke surga.”"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 64",
    "description": "Tidak hanya sampai di situ kecaman dan siksaan batin yang mere-ka peroleh. Dan pada hari kiamat dikatakan kepada mereka yang menyekutukan Allah, 'serulah sekutu-sekutumu yang dahulu kamu sembah selain Allah, agar dapat membantu kamu dalam situasi sulit ini seba-gaimana dugaan kamu ketika masih hidup. ' lalu, karena bingung tidak mengetahui apalagi yang harus mereka kerjakan, mereka menyerunya, tetapi yang diseru tidak menyambutnya, dan saat itu mereka semua melihat azab yang tersedia dan yakin bahwa mereka akan disiksa dengannya. Ketika itu mereka menyesal dan berkeinginan sekiranya mereka dahulu menerima petunjuk kebenaran, sehingga mereka tidak mendapat siksa. Tetapi apalah artinya penyesalan di kemudian hari. 65. Setelah dikecam karena perbuatan syirik, mereka ditanyai tentang sikap mereka terhadap para rasul Allah. Dan ingatlah, dan ingatkan pula umatmu wahai nabi Muhammad pada hari ketika dia menyeru mereka, dan berfirman, 'apakah jawabanmu terhadap para rasul ketika mereka mengajak kamu beriman dan beramal saleh''."
  }
]