[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan pada hari Allah menyeru orang-orang musyrik tersebut, lalu berfirman, “Dengan jawaban apa kalian menjawab rasul-rasul terkait risalah yang Kami utus mereka kepada kalian dengan membawanya?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "65. Dan pada hari ketika Rabb mereka menyeru mereka, “Apa jawaban kalian kepada para Rasul-Ku yang telah Aku utus kepada kalian?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "65. Dan datanglah seruan kedua bagi seluruh orang musyrik pada hari kiamat sebagai olokan bagi mereka. Allah menyeru mereka dengan kehadiran para saksi: “Apa yang kalian katakan kepada para rasul yang diutus kepada kalian, ketika mereka mengajak kalian untuk mengesakan Allah dan meninggalkan para sekutu?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "65. وَيَوْمَ يُنَادِيهِمْ فَيَقُولُ مَاذَآ أَجَبْتُمُ الْمُرْسَلِينَ (Dan (ingatlah) hari (di waktu) Allah menyeru mereka, seraya berkata: “Apakah jawabanmu kepada para rasul?”) Yakni bagaimana kalian menjawab para Nabi yang diutus kepada kalian ketika mereka menyampaikan risalah-Ku?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "65. Dan hari dimana Allah memanggil orang-orang kafir dengan panggilan ejekan, lalu berfirman kepada mereka: “Apa jawaban kalian terhadap para nabi yang diutus?”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{(Ingatlah) hari ketika Dia menyeru mereka lalu berfirman,“Apa jawaban kalian terhadap para rasul”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-66. “Dan hari di waktu Allah menyeru mereka, seraya berkata, ‘Apakah jawabanmu kepada para rasul?’” apakah kalian membenarkan mereka dan apakah kalian mengikuti mereka? Ataukah kalian mendustakan dan menyalahi mereka? “Maka gelaplah bagi mereka segala macam alasan pada hari itu, karena itu mereka tidak saling Tanya-menanya.” Maksudnya, mereka tidak bingung akan jawaban dari pertanyaan ini, tetapi mereka tidak mendapatkan petunjuk kepada jawaban yang benar. Sudah dimaklumi bahwa pada keadaan itu tidak ada yang bisa menyelamatkan kecuali ketegasan dalam memberikan jawaban yang benar yang sesuai dengan keadaan mereka, yaitu jawaban : “Kami memenuhi seruan mereka dengan iman dan patuh.” Akan tetapi karena mereka mengetahui bahwa mereka telah mendustakan para rasul dan telah menentang perintah mereka, maka mereka sama sekali tidak berbicara apa-apa, dan mereka juga tidak mungkin saling memberitahu tentang apa yang harus mereka jadikan jawaban, walaupun berupa kedustaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 65: Pada hari itu, Allah menyeru mereka (orang-orang musyrik) dengan berkata bertanya kepada mereka : Dengan akan kalian memenuhi seruan para utusan-utusan Kami ? Apakah kalian mengikuti (seruan) mereka atau membenarkan mereka ? Atau kalian kufur kepada utusan-utusan kami dan mendustakan mereka ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni, apakah kamu membenarkan mereka dan mengikutinya atau mendustakan mereka dan menyelisihinya?"
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 65",
    "description": "Setelah dikecam karena perbuatan syirik, mereka ditanyai tentang sikap mereka terhadap para rasul Allah. Dan ingatlah, dan ingatkan pula umatmu wahai nabi Muhammad pada hari ketika dia menyeru mereka, dan berfirman, 'apakah jawabanmu terhadap para rasul ketika mereka mengajak kamu beriman dan beramal saleh''66. Maka gelap dan tidak tampak lah bagi mereka berita-berita penting dan segala macam alasan untuk menjawab pertanyaan pada hari itu, sehingga mereka bungkam tidak dapat menjawab dan karena itu pula mereka tidak saling bertanya, sebab semua telah yakin bahwa tidak ada jawaban yang dapat menyelamatkan mereka."
  }
]