[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka alasan-alasan menjadi kabur bagi mereka, mereka tidak tahu lagi apa yang akan mereka jadikan alasan. Sebagian mereka tidak saling bertanya kepada sebagian yang lain dengan pertanyaan yang bermanfaat tentang apa yang mereka jadikan alasan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "66. Maka apa yang mereka jadikan sebagai alasan menjadi tidak jelas, mereka tidak ingat sama sekali, dan mereka tidak saling bertanya kepada sebagian yang lain dikarenakan rasa terkejut yang dahsyat menimpa mereka, karena mereka yakin bahwa mereka sedang menuju siksa."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "66. Mereka tidak dapat mengajukan alasan, tidak mampu menjawab, tidak meminta penjelasan tentang berbagai hal pada waktu yang sulit ini, dan tidak saling bertanya tentang apa yang dapat menyelamatkan mereka. Hal ini karena mereka sangat tersudutkan, sehingga mereka hanya terdiam."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "66. فَعَمِيَتْ عَلَيْهِمُ الْأَنۢبَآءُ يَوْمَئِذٍ (Maka gelaplah bagi mereka segala macam alasan pada hari itu) Yakni mereka tidak dapat lagi mendapat alasan, sehingga mereka seperti orang buta yang tidak dapat melihat jalan mereka dan tidak mendapat orang yang mampu menuntun mereka untuk mengantarkan mereka ke tempat yang aman. فَهُمْ لَا يَتَسَآءَلُونَ(karena itu mereka tidak saling tanya menanya) Yakni mereka tidak saling bertanya dan tidak mampu menyampaikan alasan serta tidak tahu bagaimana mereka akan menjawab; sebab Allah telah telah menghilangkan uzur mereka di dunia sehingga mereka tidak memiliki uzur dan alasan di hari kiamat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "66. Karena sangat bingung, maka tertutuplah bagi mereka berita-berita dan hujjah yang bisa menyelamatkan mereka pada hari kiamat sehingga mereka tidak saling bertanya dan menjawab satu sama lain tentang suatu apapun serta tidak menyadari tentang jawaban mereka karena sangat terkejut. Maknanya adalah mereka tidak mendapatkan berita yang mengandung keselamatan, sehingga berita-berita itu seperti tertutup dan tidak memberi mereka petunjuk. Mereka juga tidak mendapatkan jawaban dari orang lain yang dapat menolong mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka tertutuplah} tertutuplah {bagi mereka segala alasan} alasan-alasan dan uzur {pada hari itu. dan mereka tidak saling bertanya} mereka tidak bisa bertanya satu sama lain"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "65-66. “Dan hari di waktu Allah menyeru mereka, seraya berkata, ‘Apakah jawabanmu kepada para rasul?’” apakah kalian membenarkan mereka dan apakah kalian mengikuti mereka? Ataukah kalian mendustakan dan menyalahi mereka? “Maka gelaplah bagi mereka segala macam alasan pada hari itu, karena itu mereka tidak saling Tanya-menanya.” Maksudnya, mereka tidak bingung akan jawaban dari pertanyaan ini, tetapi mereka tidak mendapatkan petunjuk kepada jawaban yang benar. Sudah dimaklumi bahwa pada keadaan itu tidak ada yang bisa menyelamatkan kecuali ketegasan dalam memberikan jawaban yang benar yang sesuai dengan keadaan mereka, yaitu jawaban : “Kami memenuhi seruan mereka dengan iman dan patuh.” Akan tetapi karena mereka mengetahui bahwa mereka telah mendustakan para rasul dan telah menentang perintah mereka, maka mereka sama sekali tidak berbicara apa-apa, dan mereka juga tidak mungkin saling memberitahu tentang apa yang harus mereka jadikan jawaban, walaupun berupa kedustaan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 66: Maka berat bagi mereka untuk menjawab pertanyaa tersebut, tanpa hujjah, mereka tidak dapat menjawab, dan tidak dapat bertanya antara satu sama lain di antara mereka (dan) dengan apa mereka akan menjawab."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sudah maklum (diketahui), bahwa tidak ada cara yang dapat menyelamatkan dalam kondisi seperti itu kecuali menjawab dengan jawaban yang benar yang sesuai dengan keadaan, yaitu menjawab dengan iman dan ketundukan, akan tetapi karena mereka mengetahui sikap pendustaan dan penentangan mereka, maka mereka tidak mengucapkan apa pun, dan tidak mungkin bagi mereka saling bertanya-tanya antara sesama mereka tentang apa yang mereka harus jawab meskipun dusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 66",
    "description": "Maka gelap dan tidak tampak lah bagi mereka berita-berita penting dan segala macam alasan untuk menjawab pertanyaan pada hari itu, sehingga mereka bungkam tidak dapat menjawab dan karena itu pula mereka tidak saling bertanya, sebab semua telah yakin bahwa tidak ada jawaban yang dapat menyelamatkan mereka. 67. Demikian itulah keadaan orang yang mati dalam keadaan musyrik. Maka adapun orang yang berbuat syirik dan kufur, lalu bertobat dan beriman secara baik dan benar, serta membuktikan keimanannya itu dengan mengerjakan kebajikan dengan penuh keikhlasan, maka mudah-Mudahan dia termasuk orang yang beruntung memperoleh kebahagiaan di dunia dan akhirat."
  }
]