[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Adapun orang yang bertaubat dari kalangan kaum musyrikin dan ia mengikhlaskan ibadah bagiNya serta mengamalkan apa yang diperintahkan Allah dan RasulNya, maka dia termasuk orang-orang yang beruntung di dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "67. Adapun orang-orang musyrik yang bertobat dari kekufuran mereka, beriman kepada Allah dan para Rasul-Nya, dan melakukan amal saleh, maka semoga mereka menjadi bagian dari orang-orang yang beruntung mendapatkan balasan yang mereka inginkan dan selamat dari ancaman yang mereka takuti."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "67. Jika orang-orang yang tidak beriman telah mendapat kerugian pada peristiwa itu, maka terdapat sekelompok orang yang bertaubat dari kepercayaan syirik dan menempuh jalan keimanan dan amal shalih, diharapkan mereka akan meraih derajat kemenangan dan keberuntungan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "67. فَأَمَّا مَن تَابَ (Adapun orang yang bertaubat) Bertaubat dari kesyirikan dan kemaksiatan. وَءَامَنَ وَعَمِلَ صٰلِحًا فَعَسَىٰٓ أَن يَكُونَ مِنَ الْمُفْلِحِينَ(dan beriman, serta mengerjakan amal yang saleh, semoga dia termasuk orang-orang yang beruntung) Yakni orang-orang yang meraih kebahagiaan dunia dan akhirat yang mereka harapkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "67. Adapun orang yang bertaubat dari kesyirikan dan kemaksiatan lalu beriman kepada Allah dan rasulNya, serta beramal shalih dengan mengerjakan perkara-perkara yang diperintahkah, maka di sisi Allah dia termasuk orang-orang yang menang dengan menginginkan surga dan keridhaan (Allah). Dan sebagai adat penghormatan, {‘Asaa} merupakan doa supaya suatu hal dwujudkan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Adapun orang yang bertaubat, beriman, dan beramal shalih, maka mudah-mudahan termasuk orang-orang yang beruntung} orang-orang yang berhasil dan menang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "67. Setelah Allah menjelaskan pertanyaan kepada manusia tentang sesembahan mereka dan tentang para rasul mereka, maka di sini Dia menjelaskan jalan yang digunakan seseorang untuk dapat selamat dari azab Allah. Sesungguhnya tidak ada keselamatan kecuali bagi orang yang telah bertaubat dari syirik dan kemaksiatan, beriman kepada Allah, lalu hanya beribadah kepadaNya, dan beriman kepada para RasulNya lalu membenarkan mereka, serta melakukan amal shalih dengan cara mengikuti para rasul. “Semoga dia menjadi,” orang yang mengumpulkan karakter-karakter tersebut, “termasuk orang-orang yang beruntung,” yang meraih harapan dan selamat dari hal-hal yang menakutkan. Sesungguhnya tidak ada jalan menuju keberuntungan tanpa melakukan perkara-perkara tersebut."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 67: Adapun bagi mereka yang bertaubat (di dunia) dari orang-orang musyrik dan beriman kepada Allah saja, mengesakan-Nya dengan ibadah kepadanya serta membenarkan dengan keimanan dan amalan shalih, maka mereka adalah orang-orang yang selamat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan pertanyaan-Nya kepada makhluk tentang sesembahan mereka dan tentang rasul yang diutus kepada mereka, maka Allah menyebutkan jalan yang dengannya seorang hamba dapat selamat dari siksa Allah, yaitu dengan bertobat dari syirk dan maksiat, beriman kepada Allah lalu menyembah-Nya, beriman kepada para rasul-Nya lalu membenarkan mereka, beramal saleh sambil mengikuti rasul-Nya. Yakni orang-orang yang memperoleh janji Allah."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 67",
    "description": "Demikian itulah keadaan orang yang mati dalam keadaan musyrik. Maka adapun orang yang berbuat syirik dan kufur, lalu bertobat dan beriman secara baik dan benar, serta membuktikan keimanannya itu dengan mengerjakan kebajikan dengan penuh keikhlasan, maka mudah-Mudahan dia termasuk orang yang beruntung memperoleh kebahagiaan di dunia dan akhirat. 68. Begitulah yang akan dialami orang-orang musyrik di akhirat kelak. Semuanya kembali kepada hikmah dan kebijaksanaan Allah dalam segala hal, termasuk menjadikan hati yang terbuka untuk menerima hidayah dan hati yang tertutup. Dan tuhan pemeliharamu menciptakan apa dan siapa yang dia kehendaki untuk diciptakan, dan memilih apa dan siapa yang dia kehendaki untuk menerima anugerah dan mengemban amanat dari-Nya. Sekali-kali bagi mereka yang diciptakan, baik manusia maupun selainnya, tidak ada pilihan lain kecuali menerima ketetapan-Nya, suka atau tidak suka. Mahasuci Allah dari segala sifat dan tindakan yang buruk atau salah dan mahatinggi dia dari apa yang mereka persekutukan dengan mengangkat berhala-berhala sebagai sembahan selain Allah. Apa pun yang dialami oleh manusia, senang atau sedih, bukan mereka yang memilihnya, tetapi Allah yang memilihnya, sehingga harus diterima dengan lapang dada. Manusia hanya diminta untuk berusaha semaksimal mungkin dan menyerahkan hasilnya kepada Allah."
  }
]