[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Tuhanmu mengetahui apa-apa yang disembunyikan oleh hati makhluk-makhlukNya dan apa-apa yang mereka tampakkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "69. Dan Rabbmu mengetahui apa yang disembunyikan oleh hati dan apa yang diungkapkannya, tidak ada sesuatu pun yang tersembunyi dari-Nya dan Dia akan memberi balasan atas hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "69. Hai Muhammad, Tuhanmu Maha Mengetahui perkataan dan perbuatan yang disembunyikan dan ditampakkan oleh para hamba-Nya. Adakah para sesembahan kalian itu menyamai derajat-Nya?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "69. وَرَبُّكَ يَعْلَمُ مَا تُكِنُّ صُدُورُهُمْ (Dan Tuhanmu mengetahui apa yang disembunyikan (dalam) dada mereka) Yakni kesyirikan yang mereka sembunyikan dalam dada mereka. وَمَا يُعْلِنُونَ(dan apa yang mereka nyatakan) Yakni kesyirikan yang mereka tampakkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "69. Wahai Nabi, Hanya Tuhanmulah yang mengetahui apa yang disembunyikan di dalam dada-dada makhlukNya dan apa yang mereka tampakkan dengan lisan mereka berupa mengumpat nabi dan lain-lain."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan Tuhanmu mengetahui apa yang disembunyikan} disembunyikan {dada mereka dan apa yang mereka nyatakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "68-70. Ayat-ayat ini mengandung penjelasan tentang cakupan penciptaan Allah terhadap seluruh makhluk, kehendakNya berlaku bagi semua ciptaan, kewenanganNya memilih dan mengistimewakan siapa saja dari manusia dengan perintah, waktu, dan tempat. Sedangkan manusia, siapa pun dia, sama sekali tidak memiliki perintah dan kewenangan memilih; dan bahwa Allah suci dari semua yang mereka persekutukan kepadaNya, berupa sekutu, tandingan, pembantu, anak, istri dan lainnya dari apa saja yang dipersekutukan kepadaNya oleh kaum Musyrikin; dan bahwa sesungguhnya Dia yang mengetahui sesuatu yang disembunyikan oleh hati manusia dan apa saja yang mereka tampakkan; dan bahwa Dia semata sembahan yang terpuji di duia dan akhirat karena sifat-sifat keagungan dan keindahan yang dimilikiNya, dan karena Dia-lah yang telah menganugerahkan kebaikan dan karunia kepada manusia; dan bahwa Dia-lah hakim di dunia dan di akhirat: di dunia dengan ketentuan qadari (takdir) yang jejaknya adalah seluruh apa yang telah Dia cipatakan; dan hukum agama yang jejaknya adalah seluruh syariat, perintah dan laranganNya. Dan di akhirat Dia-lah yang memberikan keputusan dengan ketentuanNya yang bersifat qadari dan jaza’I (pembalasan). Maka dari itu, Dia berfirman, “Hanya kepadaNya-lah kamu dikembalikan.” Maka, kelak Dia akan memberikan pembalasan masing-masing kalian sesuai dengan perbuatannya, berupa amal yang baik dan yang buruk."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 69: Allah mengabarkan bahwasanya Dialah yang maha mengetahui sesuatu yang tersembunyi di hati-hati mereka dan atas apa yang mereka tampakan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 69",
    "description": "Dan, di samping itu, tuhan pemeliharamu wahai rasul, mengetahui apa yang disembunyikan dalam dada mereka berupa permusuhan terhadapmu, dan apa yang mereka nyatakan secara lisan, berupa celaan-celaan kepadamu dan protes terhadap pemilihan dirimu sebagai penyampai pesan-pesan suci. 70. Dan tuhanmu yang mengetahui apa yang disembunyikan dalam dada mereka dan apa yang mereka nyatakan itu dialah Allah yang mahabenar. Tidak ada tuhan yang mahakuasa dan berhak disembah selain dia. Segala puji hanya bagi-Nya di dunia atas segala nikmat dan petunjuk-Nya, dan pujian di akhirat hanya bagi-Nya atas keadilan dan pahala dari-Nya, dan hanya bagi-Nya pula segala penentuan keputusan menyangkut segala sesuatu, dan setelah mati hanya kepada-Nya kamu dikembalikan untuk dimintakan pertanggung-jawaban dan mendapat balasan."
  }
]