[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Dan Kami ilhamkan kepada ibunya Musa ketika melahirkannya dan mengkhawatirkannya dari disembelih oleh Fir’aun sebagaimana ia telah menyembelihi anak-anak Bani Israil, “Susuilah dia dengan hati tenang. Lalu bila kamu khawatir berita si anak akan diketahui, maka letakkanlah dia di dalam kotak dan hanyutkanlah dia ke sungai Nil, tanpa rasa khawatir terhadap Fir’aun dan kaumnya untuk membunuhnya, dan tanpa ada rasa kesedihan atas kepergiannya. Sesungguhnya Kami akan mengembalikan putramu kepadamu dan mengutusnya sebagai seorang rasul.” Maka sang ibu meletakkan putranya di dalam suatu kotak dan menghanyutkannya ke sungai Nil. Kemudian orang-orang Fir’aun menemukan dan mengambilnya. Maka itulah kesudahan kejadian tersebut, itulah yang Allah takdirkan untuk menjadikan Musa sebagai musuh bagi mereka dengan menyelisihi agama mereka dan membuat mereka terperosok kepada kesedihan dengan menenggelamkan mereka dan melenyapan kerajaannya ditangn Musa. Sesungguhnya Fir’aun dan Haman dan para pendukung mereka adalah orang-orang yang berdosa lagi menyekutukan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "7. Dan Kami ilhamkan kepada ibunya Musa -'alaihissalām-, susuilah dia hingga apabila engkau merasa khawatir terhadap keselamatannya dari Fir'aun dan kaumnya yang hendak membunuhnya, letakkanlah dia di dalam sebuah peti lalu lemparkan ke laut, dan janganlah engkau khawatir akan tenggelam atau khawatir dari Fir'aun dan janganlah pula engkau sedih karena berpisah dengannya, sesungguhnya Kami akan mengembalikannya kepadamu dalam keadaan hidup dan menjadikannya sebagai salah seorang Rasul yang diutus Allah kepada para makhluk-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "7. Anak yang menjadi sebab terealisasinya kehendak Allah bagi Bani Israil telah dilahirkan, dan ibunya khawatir terhadapnya dari kezaliman tentara Fir’aun sehingga dia merasa bingung. Maka Allah memberi ilham kepadanya berupa keyakinan dalam hatinya, kemudian dia menyusui anak itu agar badannya kuat dan menyembunyikannya dari pandangan orang lain. Dan ketika ibunya merasakan bahaya mengancam anaknya, Allah mewahyukan agar dia menyiapkan keranjang bagi anaknya dan membiarkannya terbawa arus sungai nil, dan hendaklah dia tidak mengkhawatirkannya dan bersedih hati atas perpisahan dengannya; Allah menjamin akan menjaga dan mengembalikannya kepada ibunya, dan Allah akan menjadikannya seorang rasul."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "7. وَأَوْحَيْنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنْ أَرْضِعِيهِ ۖ (Dan kami ilhamkan kepada ibu Musa; “Susuilah dia) Yakni Kami ilhamkan dan bisikkan ke dalam hatinya; hal ini berbeda dengan wahyu yang diberikan kepada para Rasul. فَإِذَا خِفْتِ عَلَيْهِ(dan apabila kamu khawatir terhadapnya) Yakni terhadap Fir’aun dengan sampainya kabar kelahiran Musa kepada Fir’aun. فَأَلْقِيهِ فِى الْيَمِّ(maka jatuhkanlah dia ke sungai) Yakni sungai Nil. Kisah bagaimana ia menghanyutkan Musa ke sungai telah disebutkan pada surat Taha ayat 39. وَلَا تَخَافِى وَلَا تَحْزَنِىٓ ۖ( Dan janganlah kamu khawatir dan janganlah (pula) bersedih hati) Yakni janganlah khawatir ia akan tenggelam atau hilang, dan janganlah bersedih hati karena berpisah darinya. إِنَّا رَآدُّوهُ إِلَيْكِ(karena sesungguhnya Kami akan mengembalikannya kepadamu) Mengembalikannya kepadamu dalam waktu dekat dengan cara yang dapat menyelamatkannya. وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ(dan menjadikannya (salah seorang) dari para rasul) Yakni para Rasul yang Kami utus kepada para hamba."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "7. Kami ilhamkan kepada ibu Musa; \"Susuilah dia, dan apabila kamu khawatir terhadapnya dari ancaman Fir’aun. Maka jatuhkanlah dia ke sungai Nil, janganlah kamu khawatir bahwa dia akan terbunuh dan janganlah pula bersedih hati atas perpisahan dengannya. Karena sesungguhnya Kami akan mengembalikannya kepadamu, dan Kami akan menjadikannya salah seorang nabi dan rasul. Ayat ini mengandung dua perintah dan dua larangan, dan dua kabar gembira dalam kalimat ijaz yang menunjukkan nilai balaghah, fasahah, dan mukjizat Alquran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Kami mengilhamkan} memberi ilham {kepada ibu Musa,“Susuilah dia. Jika kamu khawatir atas dirinya, makahanyutkanlah dia ke sungai} sungai Nil {Janganlah takut dan janganlah bersedih. Sesungguhnya Kami pasti mengembalikannya kepadamu dan menjadikannya sebagai salah seorang rasul”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "7. Permulaannya adalah tatkala Allah memunculkan RasulNya, Musa yang Dia jadikan sebagai penyelamat Bangsa Israil melalui tangan dan sebabnya. Dan pada waktu rasa takut yang sangat mendalam itu menyelimuti mereka di mana Fir’aun bersama para pengikutnya menyembelih anak-anak laki-laki mereka, maka Allah mengilhami ibunda Musa agar menyusuinya dan membiarkan Musa tinggal bersama dirinya, “dan apabila kamu khawatir terhadapnya,” karena kamu merasa seseorang yang kamu takuti akan mengambil Musa untuk diserahkan kepada mereka, “maka jatuhkanlah dia ke sungai.” Yaitu sungai Nil di MEsir, dimuat di dalam peti yang tertutup, “dan janganlah kamu khawatir dan jangan (pula) bersedih hati, karena sesungguhnya Kami akan mengembalikannya kepadamu, dan menjadikannya (salah seorang) dari para rasul.” Allah menggembirakannya bahwa Dia akan mengembalikan Musa ke pangkuannya, dan bahwa Musa akan tumbuh besar dan selamat dari tipu daya mereka dan Dia akan menjadikannya sebagai Rasul. Ini merupakan kabar gembira yang sangat luar biasa. Pengajuan berita gembira ini kepada ibunda Musa ialah agar hatinya merasa tenang dan rasa kekhawatirannya reda."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 7: Kemudian Allah mewahyukan kepada ibu Musa wahyu berupa ilham agar menyusui Musa, ketika ia takut kepada fir’aun dan bala tentaranya, maka Allah ilhamkan agar menghanyutkan Musa ke dalam sungai setelah ditempatkan di dalam kotak kayu, dan Allah ilhamkan ibunya agar supaya tidak perlu khawatir atas Musa dan agar tidak pula bersedih, karena Musa dalam pertolongan Allah dalam penjagaannya. Allah akan selalu menjaganya dan akan mengembalikan kepada ibunya serta menjadikan Musa termasuk utusan-utusan Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Akan tenggelam. Karena berpisah dengannya. Ini adalah berita gembira yang sangat agung. Allah mendahulukan berita ini kepada ibu Nabi Musa agar hatinya tenteram dan hilang rasa kekhawatirannya, maka ia melakukan yang diperintahkan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 7",
    "description": "Kehancuran kerajaan fir'aun terjadi melalui seorang laki-laki yang telah dipersiapkan, yaitu nabi musa dan langkahnya bermula dari kami ilhamkan berupa bisikan di dalam hati kepada ibunya musa yang anaknya akan berperan dalam kehancuran fir'aun dan kekuasaannya, bahwa, \"susuilah dia yakni musa, anakmu itu dengan tenang. Dan apabila engkau khawatir terhadapnya misalnya khawatir ada yang melihatmu menyusui anak lelaki atau khawatir jangan sampai anakmu dibunuh atas perintah fir'aun sebagaimana anak-anak lelaki lainnya, maka hanyutkanlah dia ke sungal nil setelah engkau letakkan dia di sebuah tempat yang dapat mengapung. Dan janganlah engkau takut dia akan tenggelam atau mati kelaparan atau akan terganggu oleh apa pun dan jangan pula bersedih hati karena kepergiannya, sesungguhnya kami akan mengembalikannya kepadamu dalam keadaan sengat bugar; dan setelah dewasa kami akan menjadikannya salah seorang dari kelompok para rasul yang diutus kepada bani israil. '8. Berdasarkan wahyu yang berupa ilham tersebut maka ibu musa menghanyutkannya di sungai dan setelah mengapung beberapa saat dia dipungut oleh keluarga fir'aun agar pada akhirnya kelak dia yakni musa yang dipungut itu menjadi musuh karena menantang ajaran fir'aun, dan menjadi sumber dan penyebab kesedihan bagi mereka yakni fir'aun dan rezimnya, karena dialah akan menghancurkan mereka. Sungguh, fir'aun dan haman bersama bala tentaranya dan pendukung-pendukungnya adalah orang-orang bersalah dan berdosa karena berencana melakukan itu dengan sengaja dan disertai kebulatan tekad."
  }
]