[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai Rasul), “Beritahukanlah kepadaku (wahai sekalian manusia) bila Allah menjadikan bagi kalian malam terus-menerus sampai hari kiamat, siapakah tuhan selain Allah yang akan mendatangkan sinar bagi kalian yang kalian jadikan sumber cahaya dengannya. Apakah kalian tidak mendengar dengan pendengaran yang melahirkan pemahaman dan penerimaan?"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "71. Katakanlah -wahai Rasul- kepada orang-orang musyrik, “Kabarkan kepadaku, jika Allah menjadikan untuk kalian malam terus menerus tidak terputus hingga hari Kiamat, maka adakah sesembahan selain Allah yang mendatangkan cahaya seperti cahaya siang? Tidakkah kalian mendengar hujah ini dan tidakkah kalian mengerti bahwa tidak ada tuhan selain Allah yang mendatangkan hal itu kepada kalian?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "71. Hai Rasulullah, katakanlah: “Katakan kepadaku jika Allah menetapkan malam dengan kegelapannya selama-lamanya hingga hari kiamat; Adakah Tuhan selain Allah yang mampu memberi cahaya yang terang bagi kalian? Apakah kalian tidak mendengar kenyataan ini sehingga kalian dapat mengakui betapa menakjubkannya ciptaan Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "71. قُلْ أَرَءَيْتُمْ (Katakanlah: “Terangkanlah kepadaku) Yakni beritahukan kepadaku. إِن جَعَلَ اللهُ عَلَيْكُمُ الَّيْلَ سَرْمَدًا(jika Allah menjadikan untukmu malam itu terus menerus sampai hari kiamat) Yakni malam yang berlangsung terus menerus tanpa datang siang setelahnya. Yakni seandainya waktu yang ia lalui dalam kehidupan mereka adalah malam hari terus menerus sampai hari kiamat, niscaya mereka tidak akan sanggup menjalankan kegiatan mereka dan tidak akan mampu mencari makan, minum, dan penghidupan yang menjadi asas kehidupan mereka. مَنْ إِلٰهٌ غَيْرُ اللهِ يَأْتِيكُم بِضِيَآءٍ ۖ (siapakah Tuhan selain Allah yang akan mendatangkan sinar terang kepadamu?) Apakah kalian ada tuhan-tuhan kalian yang kalian sembah yang mampu menyingkap kegelapan yang kekal itu dengan cahaya yang kalian manfaatkan untuk mencari penghidupan dan agar kalian dapat melihat apa yang kalian butuhkan serta menumbuhkan tanaman dan perkabunan kalian dan kehidupan hewan ternak kalian. أَفَلَا تَسْمَعُونَ(Maka apakah kamu tidak mendengar?”) Yakni dengan pendengaran yang penuh pemahaman dan pengamatan?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "71. Katakanlah: “Beritahulah aku, jika Allah menjadikan untuk kalian malam yang terus-menerus berkesinambungan sampai hari kiamat dan tidak ada siang di dalamnya, siapa Tuhan selainNya yang mendatangkan untuk kalian siang yang di dalamnya ada cahaya. Apakah kalian tidak mendengar hal itu dengan memahami dan memikirkannya?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Bagaimana pendapat kalian} beritahulah aku {jika Allah menjadikan untukmu malam itu terus-menerus} terus-menerus berlanjut {sampai hari kiamat. Maka siapakah Tuhan selain Allah yang akan mendatangkan sinar kepada kalian} cahaya yang kalian gunakan untuk mencari sumberkehidupan dan melihat di dalamnya {Apakah kalian tidak mendengar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Ini adalah karunia dari Allah terhadap hamba-hambaNya. Dia mengajak mereka bersyukur kepadaNya, melaksanakan pengabdian kepadaNya dan menunaikan hakNya, karena Dia telah menjadikan untuk mereka sebagian dari rahmat Nya berupa siang, agar mereka dapat mencari karunia Allah dan bertebaran untuk mencari rizki dan penghidupan di bawah cahayaNya, dan berupa malam agar mereka merasakan ketenagan dan kedamaian, agar jasad dan jiwa mereka beristirahat dari kelelahan beraktivitas di siang hari. Ini semua bagian dari karunia dan rahmatNya kepada hamba-hambaNYa (manusia). Apakah ada seseorang yang mampu melakukan hal itu? Kalau saja “Allah menjadikan untukmu malam itu terus menerus sampai Hari Kiamat, sipakah tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar” nasihat-nasihat Allah dan ayat-ayatNya dengan penuh penghayatan, menerima dan patuh? Dan jika “Allah menjadikan untukmu siang itu terus-menerus sampai Hari KIamat, siapakah tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan” sisi-sisi yang bisa diambil pelajarannya dan letak-letak berbagai bukti. sehingga mata hati kalian menjadi terang dan kalian dapat menelusuri jalan yang lurus? Dan berkenaan dengan malam Dia mengatakan, “Maka apakah kamu tidak mendengar?” sedangkan tentang siang Dia mengatakan, “Maka apakah kamu tidak memperhatikan? Karena kekuatan mendengar di malam hari itu lebih kuat daripada kekuatan melihat, dan sebaliknya pada siang hari. Di dalam ayat-ayat di atas terkandung peringatan bahwa seorang hamba hendaklah merenungkan karunia dan nikmat-nikmat Allah kepadanya dan berupaya mengenalnya dan menganalogikannya dengan kondisi ketidakberdayaannya. Sebab apabila dia membandingkan antara kondisi keberadaan nikmat tersebut dengan kondisi ketiadaannya, maka akalnya akan menyadari letak kebaikan Allah. Berbeda halnya dengan orang yang sudah terbiasa dengan berbagai kebiasaan, dan dia melihat bahwa yang menjadi kebiasaan ini adalah perkara yang akan terus berlanjut, sedangkan mata hatinya buta, tidak bisa memuji Allah atas nikmatNya dan tidak bisa merasakan betapa sangat butuhnya dia kepada nikmat-nikmat tersebut setiap saat, maka hal yang seperti ini tidak akan menimbulkan pikiran (kesadaran) untuk bersyukur dan tidak pula mengingat (Allah)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 71: Katakanlah wahai Nabi Allah kepada seluruh manusia : Apakah kalian tidak melihat, kalau Allahlah yang telah menjadikan bagi kalian malam yang berlangsung terus menerus sampai hari kiamat; Apakah di sana ada tuhan selain Allah yang dia mampu mendatangkan kepada kalia siang (yang) padanya terdapat sinar terang sehingga kalian dapat melihat dan mengerjakan pekerjaan-pekerjaan kalian ?! Apakah kalian tidak mendengar nasihat-nasihat Allah dengan pendengaran yang mendalam serta berpikir ?!"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ayat ini menjelaskan nikmat Allah kepada hamba-hamba-Nya, di mana Dia mengajak mereka mensyukuri-Nya, melaksanakan ibadah kepada-Nya dan memenuhi hak-Nya. Dia menjadikan untuk mereka karena rahmat-Nya siang agar mereka mencari karunia Allah dan bertebaran mencari rezeki-Nya, dan Dia jadikan malam agar mereka dapat tenang dan beristirahat. Badan dan diri mereka dapat beristirahat dari kelelahan bekerja di siang hari, ini merupakan karunia Allah dan rahmat-Nya kepada hamba-hamba-Nya. Apakah ada yang mampu berbuat seperti itu? Untuk mencari penghidupan. Nasehat-nasehat Allah dan ayat-ayat-Nya yang menghasilkan pemahaman lalu kamu berhenti berbuat syirk."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 71",
    "description": "Sebagai bukti atas kuasa Allah dan ilmunya yang menyeluruh serta kewajaran-Nya untuk dipuja dan dipuji, katakanlah wahai nabi Muhammad, kepada siapa saja yang meragukan itu semua, 'bagaimana pendapatmu, jika Allah menjadikan untukmu malam dengan kegelapan dan keheningannya itu terus-menerus demikian tanpa adanya siang sampai hari kiamat. Siapakah tuhan selain Allah yang akan mendatangkan sinar terang kepadamu yang kamu pakai untuk melihat dengan baik, bekerja dan melakukan aktivitas lainnya' kamu pasti tidak punya tuhan yang dapat melakukan hal itu selain Allah. Lalu, jika demikian apakah kamu tidak mau mendengar untuk menjadikannya sebagai bahan renungan dan pelajaran''72. Katakanlah juga kepada mereka wahai nabi Muhammad, 'bagai-mana pendapatmu, jika Allah menjadikan untukmu semua siang yang demikian terang itu terus-menerus demikian tanpa adanya malam yang gelap dan hening sampai hari kiamat. Siapakah tuhan selain Allah yang akan mendatangkan malam kepadamu sebagai waktu istirahatmu dari kelelahan akibat aktivitas di siang hari' kamu pasti tidak punya tuhan selain Allah yang dapat melakukan hal itu. Nah, jika demikian apakah kamu tidak memperhatikan tanda-tanda kebesaran Allah berupa perputaran siang dan malam sehingga kalian beriman dan mendapatkan petunjuk''."
  }
]