[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah kepada mereka, “Beritahukanlah kepadaku, bila Allah menjadikan siang hari terus-menerus untuk kalian sampai Hari Kiamat, maka siapakah tuhan selain Allah yang dapat mendatangkan malam bagi kalian untuk kalian beristirahat dan menenangkan diri padanya? Tidakkah kalian melihat dengan mata-mata kalian terjadinya pergantian malam dan siang?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "72. Katakan -wahai Rasul- kepada mereka, “Kabarkan kepadaku jika Allah menjadikan siang untuk kalian terus menerus hingga hari Kiamat, maka siapa sesembahan selain Allah yang bisa mendatangkan malam untuk istirahat kalian agar kalian bisa berhenti dari penatnya kerja di siang hari? Tidakkah kalian melihat tanda-tanda ini dan kalian mengerti bahwa tiada tuhan yang berhak disembah selain Allah yang mendatangkan semua itu untuk kalian?”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "72. Hai Rasulullah, katakanlah: “Katakanlah kepadaku jika Allah menetapkan siang selama-lamanya hingga hari kiamat; Adakah Tuhan selain Allah yang mampu mendatangkan malam yang tenang bagi kalian sehingga kalian merasakan ketenangan dan ketentraman? Tidakkah kalian melihat kenyataan ini sehingga kalian dapat mengakui betapa menakjubkannya ciptaan Allah?”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "72. قُلْ أَرَءَيْتُمْ إِن جَعَلَ اللهُ عَلَيْكُمُ النَّهَارَ سَرْمَدًا إِلَىٰ يَوْمِ الْقِيٰمَةِ (Katakanlah: “Terangkanlah kepadaku, jika Allah menjadikan untukmu siang itu terus menerus sampai hari kiamat) Yakni yang menjadikan waktu yang ia lalui dalam kehidupan mereka adalah siang secara terus menerus sampai hari kiamat. مَنْ إِلٰهٌ غَيْرُ اللهِ يَأْتِيكُم بِلَيْلٍ تَسْكُنُونَ فِيهِ ۖ( siapakah Tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya?) Yakni beristirahat pada malam hari dari rasa capek dan rasa lelah, dan beristirahat dari pekerjaan mereka. أَفَلَا تُبْصِرُونَ(Maka apakah kamu tidak memperhatikan?”) Yakni melihat manfaat yang besar ini dengan penuh kesadaran dan mengambil pelajaran, sehingga kalian berhenti dari menyembah selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "72. Katakanlah juga: “Beritahulah aku, jika Allah menjadikan untuk kalian siang yang terus-menerus berkelanjutan sampai hari kiamat, siapa Tuhan selainNya yang memberi kalian malam yang kalian gunakan untuk berlindung di dalamnya dan bersistirahat dari lelah, letih dan mencari rejeki? Apakah kalian tidak melihat kebermanfaatan ini dan balasan yang kalian berikan kepadaNya (Allah) berupa perbuatan salah dengan melakukan kesyirikan, sedangkan kalian akan dikembalikan kepadaNya?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Katakanlah,“Bagaimana pendapat kalian jika Allah menjadikan untuk kalian siang itu terus-menerus sampai hari Kiamat. Maka siapakah Tuhan selain Allah yang akan mendatangkan malam kepada kalian sehingga kalian istirahat} kalian istirahat {di dalamnya. Apakah kalian tidak memperhatikan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Ini adalah karunia dari Allah terhadap hamba-hambaNya. Dia mengajak mereka bersyukur kepadaNya, melaksanakan pengabdian kepadaNya dan menunaikan hakNya, karena Dia telah menjadikan untuk mereka sebagian dari rahmat Nya berupa siang, agar mereka dapat mencari karunia Allah dan bertebaran untuk mencari rizki dan penghidupan di bawah cahayaNya, dan berupa malam agar mereka merasakan ketenagan dan kedamaian, agar jasad dan jiwa mereka beristirahat dari kelelahan beraktivitas di siang hari. Ini semua bagian dari karunia dan rahmatNya kepada hamba-hambaNYa (manusia). Apakah ada seseorang yang mampu melakukan hal itu? Kalau saja “Allah menjadikan untukmu malam itu terus menerus sampai Hari Kiamat, sipakah tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar” nasihat-nasihat Allah dan ayat-ayatNya dengan penuh penghayatan, menerima dan patuh? Dan jika “Allah menjadikan untukmu siang itu terus-menerus sampai Hari KIamat, siapakah tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan” sisi-sisi yang bisa diambil pelajarannya dan letak-letak berbagai bukti. sehingga mata hati kalian menjadi terang dan kalian dapat menelusuri jalan yang lurus? Dan berkenaan dengan malam Dia mengatakan, “Maka apakah kamu tidak mendengar?” sedangkan tentang siang Dia mengatakan, “Maka apakah kamu tidak memperhatikan? Karena kekuatan mendengar di malam hari itu lebih kuat daripada kekuatan melihat, dan sebaliknya pada siang hari. Di dalam ayat-ayat di atas terkandung peringatan bahwa seorang hamba hendaklah merenungkan karunia dan nikmat-nikmat Allah kepadanya dan berupaya mengenalnya dan menganalogikannya dengan kondisi ketidakberdayaannya. Sebab apabila dia membandingkan antara kondisi keberadaan nikmat tersebut dengan kondisi ketiadaannya, maka akalnya akan menyadari letak kebaikan Allah. Berbeda halnya dengan orang yang sudah terbiasa dengan berbagai kebiasaan, dan dia melihat bahwa yang menjadi kebiasaan ini adalah perkara yang akan terus berlanjut, sedangkan mata hatinya buta, tidak bisa memuji Allah atas nikmatNya dan tidak bisa merasakan betapa sangat butuhnya dia kepada nikmat-nikmat tersebut setiap saat, maka hal yang seperti ini tidak akan menimbulkan pikiran (kesadaran) untuk bersyukur dan tidak pula mengingat (Allah)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 72: Katakanlah kepada mereka wahai Nabi Allah : Apakah kalian tidak melihat kalau Allahalah yang menjadikan bagi kalian siang yang berlangsung terus menerus sampai hari kiamat; Apakah di sana terdapat tuhan selain Allah, yang dapat mendatangkan kepada kalian malam yang kalian padanya berdiam diri dan terlelap serta beristirahat ?! Apakah kalian tidak melihat atas nikmat ini dan bukti-bukti yang menunjukkan atas kuasa Allah dan hikmah dari-Nya sebagai bukti kemaha esa’an-Nya ! Dan atas kemulian yang diberikan oleh-Nya kepada anak Adam serta menetapkan kebaikan bagi kemaslahatan mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni bagian-bagian yang perlu kamu ambil sebagai pelajaran sehingga bashirah(mata hati)mu bersinar dan kamu pun akhirnya mau menempuh jalan yang lurus, atau maksudnya, “Apakah kamu tidak memperhatikan kesalahan yang kamu lakukan, sehingga kamu berhenti dari berbuat syirk.” Allah Subhaanahu wa Ta'aala mengatakan, “Apakah kamu tidak mendengar?\" untuk malam hari, dan mengatakan, “Apakah kamu tidak memperhatikan?\" untuk siang hari. Karena mendengar lebih kuat di malam hari daripada kuatnya penglihatan, sedangkan di siang hari penglihatan lebih kuat daripada kuatnya pendengaran. Dalam ayat ini terdapat peringatan agar seorang hamba memikirkan nikmat yang Allah berikan dan mengqiaskannya jika sekiranya tidak ada, karena ketika seseorang menimbang antara keadaan ketika adanya dengan keadaan ketika tidak adanya, maka dapat mengingatkan akal betapa besarnya nikmat itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 72",
    "description": "Katakanlah juga kepada mereka wahai nabi Muhammad, 'bagai-mana pendapatmu, jika Allah menjadikan untukmu semua siang yang demikian terang itu terus-menerus demikian tanpa adanya malam yang gelap dan hening sampai hari kiamat. Siapakah tuhan selain Allah yang akan mendatangkan malam kepadamu sebagai waktu istirahatmu dari kelelahan akibat aktivitas di siang hari' kamu pasti tidak punya tuhan selain Allah yang dapat melakukan hal itu. Nah, jika demikian apakah kamu tidak memperhatikan tanda-tanda kebesaran Allah berupa perputaran siang dan malam sehingga kalian beriman dan mendapatkan petunjuk''73. Dan adalah karena rahmat-Nya yang mencakup segala sesuatu, dia jadikan untukmu malam dan siang secara bergantian. Dengan keduanya Allah menganugerahkan kepada kamu banyak manfaat. Dia menjadikan malam gelap gulita agar kamu beristirahat pada malam hari setelah sepanjang hari kamu bekerja sehingga memerlukan istirahat. Dan dia jadikan siang terang benderang agar kamu bersungguh-sungguh mencari sebagian karunia-Nya pada siang hari yang terang itu, dan juga agar kamu bersyukur kepada-Nya atas segala nikmat yang dianugerahkan-Nya kepadamu."
  }
]