[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan di antara bentuk rahmatNya kepada kalian (wahai sekalian manusia) Dia menjadikan malam dan siang dan membedakan antara keduanya. Malam Dia jadikan gelap agar kalian mendapatkan ketenangan padanya dan tubuh-tubuh kalian dapat beristirahat. Dan Dia menjadikan siang bercahaya bagi kalian supaya kalian dapat mencari penghidupan kalian padanya dan agar kalian bersyukur kepada Allah atas limpahan nikmatNya tersebut pada kalian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "73. Di antara kasih sayang-Nya bahwa Dia -Subḥānahu- menjadikan untuk kalian malam yang gelap untuk beristirahat setelah kalian merasa letih karena kerja di siang hari, dan menjadikan siang yang terang agar kalian bisa berusaha untuk mencari rezeki pada waktu itu dan agar kalian mensyukuri nikmat Allah atas kalian dan tidak mengkufurinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "73. Allah memberi karunia kepada para hamba-Nya berupa rahmat yang luas; Dia telah menciptakan bagi mereka siang dan malam agar mereka mendapatkan manfaat dari keadaan keduanya yang silih berganti secara teratur, Allah telah menetapkan pergerakannya dengan perhitungan, sehingga manusia dapat memanfaatkan kegelapan malam yang membawa ketenangan dan ketentraman, and memanfaatkan cahaya siang untuk bekerja mencari penghidupan. Bukankah kenikmatan-kenikmatan yang agung itu menjadikan Allah layak disyukuri dan diesakan?"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "73. وَمِن رَّحْمَتِهِۦ جَعَلَ لَكُمُ الَّيْلَ وَالنَّهَارَ لِتَسْكُنُوا۟ فِيهِ وَلِتَبْتَغُوا۟ مِن فَضْلِهِۦ (Dan karena rahmat-Nya, Dia jadikan untukmu malam dan siang, supaya kamu beristirahat pada malam itu dan supaya kamu mencari sebahagian dari karunia-Nya) Yakni Allah menciptakan bagi kalian dua makhluk yang agung ini yaitu siang dan malam, agar kalian dapat berusaha dan bekerja serta dapat beristirahat dan mencari ketenangan, dengan begitu kehidupan kalian dapat berjalan dengan baik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "73. Dan di antara rahmat Allah SWT kepada manusia yaitu menjadikan malam dan siang bergantian supaya kalian bisa berlindung dan beristirahat dari lelah di malam hari dan mencari rejeki dari keutamaan Allah dengan berbagai usaha di siang hari serta supaya kalian bersyukur kepada Allah atas nikmat yang diberikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Berkat rahmatNya, Dia menjadikan untuk kalian malam dan siang agar kalian beristirahat pada malam hari} agar kalian bisa bersitirahat pada malam hari dari kelelahan {dan agar kalian mencari sebagian karuniaNya} dan agar kalian mencari sebagian dari rezeki Allah di siang hari {dan agar kalian bersyukur"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "71-73. Ini adalah karunia dari Allah terhadap hamba-hambaNya. Dia mengajak mereka bersyukur kepadaNya, melaksanakan pengabdian kepadaNya dan menunaikan hakNya, karena Dia telah menjadikan untuk mereka sebagian dari rahmat Nya berupa siang, agar mereka dapat mencari karunia Allah dan bertebaran untuk mencari rizki dan penghidupan di bawah cahayaNya, dan berupa malam agar mereka merasakan ketenagan dan kedamaian, agar jasad dan jiwa mereka beristirahat dari kelelahan beraktivitas di siang hari. Ini semua bagian dari karunia dan rahmatNya kepada hamba-hambaNYa (manusia). Apakah ada seseorang yang mampu melakukan hal itu? Kalau saja “Allah menjadikan untukmu malam itu terus menerus sampai Hari Kiamat, sipakah tuhan selain Allah yang akan mendatangkan sinar terang kepadamu? Maka apakah kamu tidak mendengar” nasihat-nasihat Allah dan ayat-ayatNya dengan penuh penghayatan, menerima dan patuh? Dan jika “Allah menjadikan untukmu siang itu terus-menerus sampai Hari KIamat, siapakah tuhan selain Allah yang akan mendatangkan malam kepadamu yang kamu beristirahat padanya? Maka apakah kamu tidak memperhatikan” sisi-sisi yang bisa diambil pelajarannya dan letak-letak berbagai bukti. sehingga mata hati kalian menjadi terang dan kalian dapat menelusuri jalan yang lurus? Dan berkenaan dengan malam Dia mengatakan, “Maka apakah kamu tidak mendengar?” sedangkan tentang siang Dia mengatakan, “Maka apakah kamu tidak memperhatikan? Karena kekuatan mendengar di malam hari itu lebih kuat daripada kekuatan melihat, dan sebaliknya pada siang hari. Di dalam ayat-ayat di atas terkandung peringatan bahwa seorang hamba hendaklah merenungkan karunia dan nikmat-nikmat Allah kepadanya dan berupaya mengenalnya dan menganalogikannya dengan kondisi ketidakberdayaannya. Sebab apabila dia membandingkan antara kondisi keberadaan nikmat tersebut dengan kondisi ketiadaannya, maka akalnya akan menyadari letak kebaikan Allah. Berbeda halnya dengan orang yang sudah terbiasa dengan berbagai kebiasaan, dan dia melihat bahwa yang menjadi kebiasaan ini adalah perkara yang akan terus berlanjut, sedangkan mata hatinya buta, tidak bisa memuji Allah atas nikmatNya dan tidak bisa merasakan betapa sangat butuhnya dia kepada nikmat-nikmat tersebut setiap saat, maka hal yang seperti ini tidak akan menimbulkan pikiran (kesadaran) untuk bersyukur dan tidak pula mengingat (Allah)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 73: Dan di antara dari rahmat Allah atas kalian (wahai manusia), Allah pilihkan bagi kalian dengan menjadikan bagi kalian malam untuk kalian tinggal dan tinggal padanya, kemudian Allah jadikan siang mengikuti malam agar kalian menyebar ketikan datang waktu siang, kalian bekerja padanya untuk memenuhi kebutuhan-kebutuhan kalian sehingga bertahan hidup dan mulia kehidupan kalian; Semoga kalian mengetahui nikmat Allah atas kalian, sehingga menjadikan kalian memiliki rasa syukur dengan mentauhidkan-Nya dan mengikuti para utusan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 73",
    "description": "Dan adalah karena rahmat-Nya yang mencakup segala sesuatu, dia jadikan untukmu malam dan siang secara bergantian. Dengan keduanya Allah menganugerahkan kepada kamu banyak manfaat. Dia menjadikan malam gelap gulita agar kamu beristirahat pada malam hari setelah sepanjang hari kamu bekerja sehingga memerlukan istirahat. Dan dia jadikan siang terang benderang agar kamu bersungguh-sungguh mencari sebagian karunia-Nya pada siang hari yang terang itu, dan juga agar kamu bersyukur kepada-Nya atas segala nikmat yang dianugerahkan-Nya kepadamu. 74. Dan sebagai bentuk kecaman dan ancaman terhadap orang-orang musyrik, ingatlah, dan ingatkan pula umatmu, wahai nabi Muhammad, pada hari ketika mereka berdiri di hadapan Allah untuk dimintakan pertanggungjawaban, dia menyeru mereka yang musyrik itu de-ngan panggilan yang menghinakan, dan berfirman, 'di manakah sekutu-sekutu-ku yang dahulu kamu sangka sebagai tuhan-tuhan yang akan membela dan menolong kamu''."
  }
]