[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pada hari Allah memanggil kaum musyrikin, lalu Allah berfirman kepada mereka, “Dimanakah sekutu-sekutuKu yang kalian anggap di dunia merupakan sekutu-sekutuKu?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "74. Pada hari Rabb mereka memanggil mereka dengan berfirman, “Mana sekutu-sekutu yang kalian sembah disamping menyembah-Ku dan kalian mengklaimnya sebagai sekutu-sekutu bagi-Ku ?"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "74. Dan ini adalah seruan lain sebagai olokan dan teguran. Allah menyeru orang-orang yang berani berbuat syirik: “Dimanakah orang-orang yang kalian anggap sebagai sekutu-Ku, datangkanlah siapa saja dari mereka yang kalian kehendaki agar mereka dapat menyelamatkan kalian dari tempat kembali yang telah menunggu kalian ini?"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "74. Wahai Nabi, Ingatlah hari dimana Allah memanggil orang-orang musyrik pada hari kiamat dengan panggilan ejekan. Dia berfirman kepada mereka: “Dimana sekutu-sekutu yang kalian anggap di dunia sebagai penolong dan penyelamat kalian?!”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) hari ketika Dia menyeru mereka dengan berfirman,“Di manakah sekutu-sekutuKu yang dahulu selalu kalian sangkakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74-75. Maksudnya, dan pada hari di mana Allah memanggil orang-orang yang telah mempersekutukanNya, yang beralih dari menyembah Allah kepada selain Allah, yaitu mereka yang beranggapan bahwa Allah mempunyai sekutu-sekutu yang berhak disembah, mereka dapat memberikan manfaat dan bisa menimpakan bahaya. Maka nanti di hari kiamat, Allah hendak memperlihatkan kelancangan dan kedustaan anggapan mereka serta pendustaan mereka terhadap diri mereka sendiri. Allah memanggil mereka, “Di manakah sekutu-sekutuKU yang dahulu kamu katakan?” maksudnya, menurut keyakinan mereka, bukan berdasarkan perintah, seperti dikatakan oleh Allah, \"Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.\" (Yunus: 66). Maka apabila mereka itu telah hadir, Allah mengambil “dari tiap-tiap umat” dari umat-umat yang mendustakan “seorang saksi,” yang memberikan kesaksian atas apa yang telah terjadi di dunia, yaitu perbuatan syirik dan keyakinan mereka. Mereka (yang dipilih itu) tak ubahnya seperti orang-orang pilihan. Allah memilih dari para tokoh pendusta itu orang yang siap menghadapi pertengakaran dan debat membela saudara-saudara mereka. Mereka semua satu pandangan. Lalu apabila mereka telah muncul dalam persidangan, “Kami berkata, ‘tunjukkanlah bukti kebenaranmu’.” Maksudnya, alasan dan argument kalian yang membuktikan kebenaran perbuatan syiriik kalian. Apakah Kami telah menyuruh kalian melakukan itu? Apakah para rasulKu juga memerintahkannya pada kalian? Apakah kalian menemukan hal itu di dalam kitab-kitab suciKu? Apakah di antara mereka ada orang yang berhak mendapat ketuhanan? Apakah mereka (para sekutu itu) berguna bagi kalian? Atau dapat mencegah azab Allah dari kalian? Atau mereka bisa melindungi kalian? Jika benar demikian, maka silahkan mereka melakukannya, jika di antara mereka ada yang mampu maka hendaklah mereka memperlihatkannya kepada kalian jika mereka benar-benar memiliki kemampuan. “Maka tahulah mereka,” pada saat itu akan kepalsuan dan kerusakan keyakinan mereka, dan “bahwasanya yang haq itu kepunyaan Allah”. Pertengkaran telah menimpa mereka, argument mereka habis, sedangkan argument Allah sangat jelas. “Dan lenyaplah dari mereka apa yang dahulunya mereka ada-adakan,” yaitu kedustaan dan kebohongan. Ia sirna, habis, dan lenyap. Mereka pun mengetahui bahwasanya Allah benar-benar telah berbuat adil terhadap mereka, di mana DIa tidak menempatkan siksa kecuali terhadap orang-orang yang berhak menyandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 74: Pada hari itu Allah menyeru siapa yang menyekutukan-Nya dalam peribadatan, Allah berkata kepada mereka : Di mana mereka yang mengklaim bahwasanya mereka adalah sekutu-Ku !?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Pada hari Kiamat, Allah Subhaanahu wa Ta'aala ingin menampakkan sikap beraninya mereka kepada Allah, dustanya sangkaan mereka dan bahwa pada akhirnya mereka mendustakan diri mereka sendiri. Yakni yang dahulu kamu sangka bahwa mereka adalah sekutu-sekutu bagi Allah, mereka berhak disembah, dapat memberi manfaat dan menimpakan bahaya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 74",
    "description": "Dan sebagai bentuk kecaman dan ancaman terhadap orang-orang musyrik, ingatlah, dan ingatkan pula umatmu, wahai nabi Muhammad, pada hari ketika mereka berdiri di hadapan Allah untuk dimintakan pertanggungjawaban, dia menyeru mereka yang musyrik itu de-ngan panggilan yang menghinakan, dan berfirman, 'di manakah sekutu-sekutu-ku yang dahulu kamu sangka sebagai tuhan-tuhan yang akan membela dan menolong kamu''75. Kaum musyrik tidak dapat menjawab. Oleh karenanya Allah menghadirkan saksi, dan untuk maksud itu, Allah berfirman; kami datangkan dari setiap umat seorang saksi, yaitu nabi dan rasul yang dahulu diutus kepada mereka, yang bersaksi atas kedurhakaan yang mereka lakukan di dunia. Lalu pada saat itu, kami katakan kepada orang-orang yang melanggar di antara mereka, 'kemukakanlah bukti kebenaranmu yang kamu gunakan untuk membenarkan kemusyrikan'. Mereka tidak mampu mendatangkannya, maka dengan segera tahulah dan sadarlah mereka bahwa yang hak, yaitu kebenaran dalam hal ketuhanan dan lain-lain, itu hanya milik Allah dan lenyaplah dari mereka lagi binasa apa yakni kebohongan-kebohongan, yang dahulu ketika di dunia mereka selalu ada-adakan. Semua itu tidak berguna bagi mereka, dan hanya mendatangkan bahaya dan menjerumuskan mereka ke dalam neraka."
  }
]