[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan Kami ambil dari tiap-tiap umat dari umat-umat yang mendustakan, seorang saksi (yaitu nabi mereka) yang bersaksi atas apa yang terjadi di dunia dari perbuatan syirik mereka dan pendustaan yang mereka lakukan terhadap rasul-rasul mereka. Kemudian Kami berfirman kepada umat-umat yang mendustakan rasul-rasul mereka dan risalah yang mereka bawa dari sisi Allah, “Tunjukkanlah bukti-bukti kalian atas perbuatan kalian menyekutukan sesuatu obyek dengan Allah.” Maka mereka sadar bahwa sesungguhnya bukti yang kuat milik Allah telah menyanggah mereka. Dan sesungguhnya kebenaran itu kepunyaan Allah, dan lenyaplah apa yang mereka ada-adakan atas nama Tuhan mereka. Itu tidak bermanfaat bagi mereka. Bahkan mencelakai mereka dan menjerumuskan mereka ke Neraka Jahanam."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "75. Dan telah Kami hadirkan untuk setiap umat itu Nabinya yang menjadi saksi atas mereka dengan kekufuran dan pendustaan yang telah mereka lakukan, lalu Kami katakan kepada para pendusta dari umat-umat itu, “Berikan hujah-hujah dan dalil-dalil kalian atas kekufuran dan pendustaan yang kalian lakukan.” Maka terputuslah hujah-hujah mereka dan mereka meyakini bahwa kebenaran yang tidak ada keraguan padanya hanya milik Allah. Dan lenyaplah dari mereka sekutu-sekutu bagi Allah -Subḥānahu- yang dahulu mereka ada-adakan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "75. Di hari yang sulit ini Kami mengeluarkan seorang saksi dari setiap umat -yaitu nabi mereka- untuk bersaksi atas kedustaan mereka terhadap para rasul ketika di kehidupan dunia. Kemudian Allah menghadap kepada orang-orang musyrik dan meminta alasan yang menyebabkan mereka menuruti hawa nafsu mereka sehingga mereka menjadikan tuhan selain Allah; akan tetapi mereka diam dan tidak mampu menjawab dan mereka yakni kebenaran yang nyata adalah milik Allah. Dan lenyaplah kedustaan-kedustaan yang dahulu mereka dengungkan, sehingga mereka tidak lagi memiliki alasan yang dapat mereka pegang dan mereka tidak memiliki orang yang dapat memberi syafaat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "75. وَنَزَعْنَا مِن كُلِّ أُمَّةٍ شَهِيدًا (Dan Kami datangkan dari tiap-tiap umat seorang saksi) Yang memberi kesaksian atas mereka pada hari kiamat, mereka adalah para Nabi. Pendapat lain mengatakan mereka adalah orang-orang adil dari setiap umat. فَقُلْنَا هَاتُوا۟ بُرْهٰنَكُمْ(lalu Kami berkata “Tunjukkanlah bukti kebenaranmu”) Yakni sampaikanlah hujjah dan dalil kalian bahwa Aku memiliki sekutu. Ketika itu mereka akan mengakui dan tidak mampu menyampaikan dalil mereka. فَعَلِمُوٓا۟ أَنَّ الْحَقَّ لِلّٰهِ (maka tahulah mereka bahwasanya yang hak itu kepunyaan Allah) Yakni hak ketuhanan hanya milik Allah dan mereka akan mengetahui bahwa Dia tidak memiliki sekutu. وَضَلَّ عَنْهُم مَّا كَانُوا۟ يَفْتَرُونَ (dan lenyaplah dari mereka apa yang dahulunya mereka ada-adakan) Yakni lenyap dan sirna kedustaan yang dulu mereka ada-adakan di dunia bahwa Allah memiliki sekutu yang berhak disembah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "75. Dan dari tiap umat, Kami keluarkan seorang saksi bagi mereka, yaitu nabi mereka yang bersaksi untuk mereka atas apa yang mereka lakukan. Kami berkata kepada mereka: “Datangkanlah bukti atas kebenaran ucapan kalian tentang kesyirikan dan sesuatu yang kalian tuduhkan.” Saat itu juga mereka tahu bahwa hak ketuhanan itu hanya milik Allah. Tidak ada sekutu baginya dalam hal itu. Maka lenyaplah dari mereka sesuatu yang mereka rekayasa di dunia berupa kebathilan, yaitu bahwa di sisi Allah itu ada sekutu lainnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kami mendatangkan} Kami mengeluarkan {dari setiap umat seorang saksi} nabi yang bersaksi atas umatnya {lalu Kami katakan,“Datangkanlah bukti kebenaran kalian”} hadirkanlah dalil-dalil kalian bahwa Aku memiliki sekutut {Lalu mereka mengetahui bahwa yang hak itu milik Allah dan lenyaplah} hilanglah {dari mereka apa yang dahulu mereka ada-adakan} mereka buat-buat berupa dusta terhadap Allah, bahwa ada tuhan-tuhan yang disembah bersamaNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "74-75. Maksudnya, dan pada hari di mana Allah memanggil orang-orang yang telah mempersekutukanNya, yang beralih dari menyembah Allah kepada selain Allah, yaitu mereka yang beranggapan bahwa Allah mempunyai sekutu-sekutu yang berhak disembah, mereka dapat memberikan manfaat dan bisa menimpakan bahaya. Maka nanti di hari kiamat, Allah hendak memperlihatkan kelancangan dan kedustaan anggapan mereka serta pendustaan mereka terhadap diri mereka sendiri. Allah memanggil mereka, “Di manakah sekutu-sekutuKU yang dahulu kamu katakan?” maksudnya, menurut keyakinan mereka, bukan berdasarkan perintah, seperti dikatakan oleh Allah, \"Dan orang-orang yang menyeru sekutu-sekutu selain Allah, tidaklah mengikuti (suatu keyakinan). Mereka tidak mengikuti kecuali prasangka belaka, dan mereka hanyalah menduga-duga.\" (Yunus: 66). Maka apabila mereka itu telah hadir, Allah mengambil “dari tiap-tiap umat” dari umat-umat yang mendustakan “seorang saksi,” yang memberikan kesaksian atas apa yang telah terjadi di dunia, yaitu perbuatan syirik dan keyakinan mereka. Mereka (yang dipilih itu) tak ubahnya seperti orang-orang pilihan. Allah memilih dari para tokoh pendusta itu orang yang siap menghadapi pertengakaran dan debat membela saudara-saudara mereka. Mereka semua satu pandangan. Lalu apabila mereka telah muncul dalam persidangan, “Kami berkata, ‘tunjukkanlah bukti kebenaranmu’.” Maksudnya, alasan dan argument kalian yang membuktikan kebenaran perbuatan syiriik kalian. Apakah Kami telah menyuruh kalian melakukan itu? Apakah para rasulKu juga memerintahkannya pada kalian? Apakah kalian menemukan hal itu di dalam kitab-kitab suciKu? Apakah di antara mereka ada orang yang berhak mendapat ketuhanan? Apakah mereka (para sekutu itu) berguna bagi kalian? Atau dapat mencegah azab Allah dari kalian? Atau mereka bisa melindungi kalian? Jika benar demikian, maka silahkan mereka melakukannya, jika di antara mereka ada yang mampu maka hendaklah mereka memperlihatkannya kepada kalian jika mereka benar-benar memiliki kemampuan. “Maka tahulah mereka,” pada saat itu akan kepalsuan dan kerusakan keyakinan mereka, dan “bahwasanya yang haq itu kepunyaan Allah”. Pertengkaran telah menimpa mereka, argument mereka habis, sedangkan argument Allah sangat jelas. “Dan lenyaplah dari mereka apa yang dahulunya mereka ada-adakan,” yaitu kedustaan dan kebohongan. Ia sirna, habis, dan lenyap. Mereka pun mengetahui bahwasanya Allah benar-benar telah berbuat adil terhadap mereka, di mana DIa tidak menempatkan siksa kecuali terhadap orang-orang yang berhak menyandangnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 75: Kami hadirkan pada hari kiamat setiap umat sebagai saksi, di mana Nabi mereka sebagai saksi atas umat mereka dari perbuatan syirik dan pendustaan, kemudian Allah berkata kepada mereka umat-umat yang mendustakan : Datangkanlah bukti-bukti kalian dan jelaskan dalil-dalil kalian yang mengokohkan kalian dari berbuat kesyirikan dan kedustaan kepada para Rasul. Maka mereka paham bahwa kesyirikan dan kekafiran mereka adalah bathil, dan menjadi jelas bagi mereka bahwa agama yang benar di sisi Allah adalah dengan tauhid dan mengesakan-Nya dengan ibadah, sembari lenyaplah bagi mereka penyelisihan mereka akan kedustaan mereka, pengada-adaan mereka atas nama Allah dan mendustakan para utusan-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yang dimaksud saksi di sini ialah rasul yang telah diutus kepada mereka waktu di dunia. Ada pula yang menafsirkan, bahwa Allah Subhaanahu wa Ta'aala mendatangkan salah seorang dari mereka (yang mendustakan) seorang yang menjadi tokohnya yang siap membela kawan-kawannya, yang kemudian ditanya oleh Allah, \"Kemukakanlah bukti kebenaranmu,” Yakni yang membenarkan perbuatan syirkmu. Apakah Kami memerintahkan demikian atau para rasul kami memerintahkan demikian? Apakah hal tersebut disebutkan dalam salah satu di antara kitab-kitab yang Kami turunkan? Terhadap perbuatan syirkmu. Maksudnya, pada waktu itu mereka yakin, bahwa apa yang telah diterangkan Allah dengan perantaraan Rasul-Nya itulah yang benar dan bahwa hanya Allah yang berhak disembah; tidak selain-Nya. Ketika di dunia, yaitu bahwa Allah memiliki sekutu, Mahasuci Allah dari apa yang mereka ada-adakan itu."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 75",
    "description": "Kaum musyrik tidak dapat menjawab. Oleh karenanya Allah menghadirkan saksi, dan untuk maksud itu, Allah berfirman; kami datangkan dari setiap umat seorang saksi, yaitu nabi dan rasul yang dahulu diutus kepada mereka, yang bersaksi atas kedurhakaan yang mereka lakukan di dunia. Lalu pada saat itu, kami katakan kepada orang-orang yang melanggar di antara mereka, 'kemukakanlah bukti kebenaranmu yang kamu gunakan untuk membenarkan kemusyrikan'. Mereka tidak mampu mendatangkannya, maka dengan segera tahulah dan sadarlah mereka bahwa yang hak, yaitu kebenaran dalam hal ketuhanan dan lain-lain, itu hanya milik Allah dan lenyaplah dari mereka lagi binasa apa yakni kebohongan-kebohongan, yang dahulu ketika di dunia mereka selalu ada-adakan. Semua itu tidak berguna bagi mereka, dan hanya mendatangkan bahaya dan menjerumuskan mereka ke dalam neraka. 76. Setelah pada ayat-ayat di awal surah berbicara tentang kekuatan dan kekuasaan fir`aun yang berakhir dengan kebinasaan karena kedurhakaan dan kezaliman, di sini Allah memaparkan kekuatan harta dan pengetahuan yang juga berakhir dengan kebinasaan saat disertai dengan kedurhakaan dan keangkuhan. Allah berfirman; sesungguhnya karun termasuk kaum musa yang hidup semasa dengannya dan konon adalah anak nabi musa. Tetapi meski berasal dari keluarga terhormat dia melampaui batas dengan berlaku zalim terhadap mereka dan sombong. Ia adalah seorang yang kami beri nikmat dengan memasukkannya ke dalam kelompok kaum nabi musa, dan kami telah menganugerahkan pula kepadanya perbendaharaan harta yang kunci-kunci gudang tempat penyimpanan hartanya itu sungguh sangat banyak sehingga terasa berat dipikul oleh sejumlah orang yang kuat-kuat. Itu baru kuncinya, ada pun harta kekayaannya, tidak mungkin dapat dipikul oleh orang yang sangat banyak sekali pun. Ingatlah ketika ia terpedaya oleh nikmat Allah yang dikaruniakan kepadanya dengan mengingkari dan tidak mensyukurinya, kaumnya menasihatinya dengan berkata kepadanya, 'janganlah engkau terlalu bangga dengan harta kekayaan yang engkau miliki, kebanggaan yang menjadikanmu melupakan Allah yang menganugerahkan nikmat itu sehingga tidak bersyukur kepada-Nya. Sungguh, Allah tidak menyukai orang yang membanggakan diri. ' orang-orang kafir mekkah yang menentang nabi Muhammad. Telah tertipu oleh harta mereka, sebab kekayaan mereka digunakan untuk menindas kaum muslim. Padahal, harta benda mereka sangat sedikit jika dibandingkan dengan harta karun. Orang kaya yang angkuh dan zalim akan berakhir dengan kebinasaan."
  }
]