[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya Qarun itu termasuk dari kaum Musa. Dia berbuat melampaui batas dalam kesombongan dan otoriter terhadap orang-orang. Dan Kami telah memberikan kepada Qarun dari perbendaharaan harta kadar yang sangat melimpah, sampai-sampai kuncinya sungguh-sungguh berat dipikul oleh banyak orang berfisik kuat. Ketika itu, kaumnya berkata kepadanya, “janganlah kamu berlaku congkak dengan penuh kegirangan dengan kekayaan yang ada padamu. Sesungguhnya Allah tidak menyukai orang-orang yang congkak yang tidak mensyukuri Allah atas pemberian yang diberikanNya kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "76. Sesungguhnya Qārūn itu dari kaum Musa -'alaihissalām-, lalu ia berlaku sombong terhadap mereka. Dan Kami telah memberinya perbendaharaan harta yang kunci-kunci lemari tempat menyimpan hartanya terasa berat bagi sekumpulan orang-orang kuat untuk memikulnya, tatkala kaumnya berkata kepadanya, “Janganlah kamu bergembira dengan berlebihan, sesungguhnya Allah tidak menyukai orang-orang yang bergembira dengan sombong, justru Allah memurkainya dan menyiksanya karena hal itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "76. Kaum Quraisy memandang harta sebagai ukuran kehormatan dan kekuasaan mereka; maka Allah membuat perumpamaan bagi bagi orang-orang musyrik itu dengan umat-umat terdahulu. Qarun adalah kerabat Nabi Musa, dia mengumpulkan harta yang banyak dan menampakkan kesombongan dan keangkuhan serta enggan untuk mensyukuri nikmat. Dalam firman Allah [وءاتيناه] ‘Dan Kami memberinya’, untuk menjelaskan siapa yang telah memberinya kekayaan sehingga tidak layak bagi Qarun untuk sombong. Qarun menyimpan hartanya di dalam ruang penyimpanan yang membutuhkan banyak alat untuk membukanya dan alat itu sangat berat meskipun dipikul oleh sekelompok orang yang kuat. Dan terjadilah percakapan antara Qarun dan kaumnya yang beriman, mereka menasehatinya agar tidak bersikap angkuh dan terlalu bangga. Sesungguhnya Allah tidak menyukai orang yang membanggakan diri seperti itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "76. إِنَّ قٰرُونَ كَانَ مِن قَوْمِ مُوسَىٰ (Sesungguhnya Karun adalah termasuk kaum Musa) An-Nakha’i, Qatadah, dan lainnya berpendapat bahwa Qarun adalah keponakan Nabi Musa. فَبَغَىٰ عَلَيْهِمْ ۖ( maka ia berlaku aniaya terhadap mereka) Yakni benar-benar berlaku sewenang-wenang dan sombong terhadap kaumnya dan enggan untuk mentaati Musa dan beriman kepada Allah. وَءَاتَيْنٰهُ مِنَ الْكُنُوزِ(dan Kami telah menganugerahkan kepadanya perbendaharaan harta) Makna (الكنز) adalah harta yang disimpan. مَآ إِنَّ مَفَاتِحَهُۥ(yang kunci-kuncinya) Yakni kunci-kunci tempat menyimpan hartanya. لَتَنُوٓأُ بِالْعُصْبَةِ أُو۟لِى الْقُوَّةِ (sungguh berat dipikul oleh sejumlah orang yang kuat-kuat) Yakni sekelompok lelaki masih akan merasa berat jika hendak mengangkatnya. Lalu bagaimana dengan ukuran harta bendanya itu sendiri? إِذْ قَالَ لَهُۥ قَوْمُهُۥ لَا تَفْرَحْ ۖ ((Ingatlah) ketika kaumnya berkata kepadanya: “Janganlah kamu terlalu bangga) Yakni janganlah kamu sombong dan angkuh. إِنَّ اللهَ لَا يُحِبُّ الْفَرِحِينَ (sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri”) Yakni oran-orang yang sombong yang tidak bersyukur kepada Allah atas apa yang telah Dia berikan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "76. Sesungguhnya Qarun adalah anak dari pamannya nabi Musa dari kaum Bani Israil. Dia sombong terhadap kaumnya dengan (membanggakan) hartanya yang sangat banyak dan ingin memimpin mereka. Kami memberinya (Qarun) harta yang sangat melimpah dan terpelihara. Sesungguhnya kunci-kunci gudang hartanya sangat berat dipikul oleh kumpulan orang-orang kuat yang banyak. Ketika kaumnya berkata padanya: “Kamu tidak akan bahagia dengan membanggakan harta yang banyak, sesungguhnya Allah tidak meridhai orang-orang sombong yang tidak bersyukur kepadaNya atas apa yang diberikan kepadanya” Kemudian dia marah dan menghukum mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya Qarun termasuk kaum Musa. Dia berlaku angkuh terhadap mereka} Dia sombong kepada mereka {Kami telah menganugerahkan kepadanya} Kami memberinya {perbendaharaan harta} harta-harta yang disimpan dalam peti-peti {yang kunci-kuncinya} yang kunci-kunci dari petinya {sungguh berat dipikul} sungguh berat dipikul oleh banyak orang {oleh sejumlah orang yang kuat-kuat. Ketika kaumnya berkata kepadanya,“Janganlah terlalu bangga} jangan terlalu bangga dengan banyaknya harta {Sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "76. Allah mengabarkan tentang kondisi Qarun, apa yang telah dia perbuat, apa yang ditimpakan terhadapnya, dia telah diberi nasihat dan ditegur. Allah berfirman, “Sesungguhnya Qarun adalah termasuk kaum Musa,” maksudnya, dari bangsa Isra’il , yaitu orang-orang yang mampu mengungguli manusia lainnya dan melebihi mereka di zamannya. Allah telah menganugerahkan kepada mereka segala sesuatu yang dianugerahkanNya. Pada awalnya keadaan mereka selaras dengan (keadaan) istiqamah. Akan tetapi Qarun telah berbuat semena-mena terhadap kaumnya, dia menjadi congkak karena harta benda yang berlimpah yang membuat congkak orang yang diberi anugerah dengannya, “Dan Kami telah menganugerahkan kepadanya perbendaharaan harta.” Maksudnya, perbendaharaan harta kekayaan yang sangat besar, “yang kunci-kuncinya sungguh berat dipikul oleh sejumlah orang yang kuat-kuat.” Ushbah adalah sepuluh hingga Sembilan orang, hingga tujuh orang. Artinya: hingga kunci-kunci perbendaharaan harta kekayaannya dirasa sangat berat untuk dipikul oleh sekelompok manusia. Itu kunci-kuncinya. Lalu bagaimana dengan perbendaharaan-perbendaharaannya (gudang-gudangnya). “Ingatlah ketika kaumnya berkata kepadanya” seraya menasehati dan mengingatkannya dari kecongkakannya, “janganlah kamu terlalu bangga; sesungguhnya Allah tidak menyukai orang-orang yang terlalu membanggakan diri.” Maksudnya, jangan kamu bangga dengan harta kekayaan yang sangat besar ini, lalu kamu membangga-banggakannya dan membuatmu lalai terhadap akhirat, karena sesungguhnya Allah tidak suka kepada orang-orang yang membanggakannya, yaitu orang-orang yang tenggelam dalam mencintainya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 76: Pada akhir kisah ini datang kisah qarun, di mana Allah kabarkan bahwasanya qarun adalah bagian dari kaum Musa, akan tetapi dzalim terhadap sesamanya dan menjadi penolong fir’aun. Allah kemudian kabarkan bahwa Ia memberikan qarun harta dan perbendaharaan harta yang banyak dan saking banyaknya sampai-sampai berat kuncinya ketika dibawa oleh beberapa laki-laki. Telah dinasihati ia oleh bani israil akan dirinya dan hartanya, sebab Allah tidak menyukai mereka yang menisbatkan karunia Allah kepada selain dari-Nya; Di mana qarun menisbatkan karunia Allah karena sebab kepiawaiannya, kesombongannya dan lain sebagainya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan keadaan Qarun, perbuatan yang dilakukan olehnya, dan bahwa ia telah dinasihati sebelumnya. Karun adalah salah seorang anak paman Nabi Musa ‘alaihis salam atau termasuk Bani Israil. Dengan bersikap sombong. Jika kuncinya saja sudah berat, lalu bagaimana dengan harta kekayaannya. Yang mukmin dari kalangan Bani Israil. Dengan kenikmatan yang besar itu dan sampai membuatnya lalai dari akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 76",
    "description": "Setelah pada ayat-ayat di awal surah berbicara tentang kekuatan dan kekuasaan fir`aun yang berakhir dengan kebinasaan karena kedurhakaan dan kezaliman, di sini Allah memaparkan kekuatan harta dan pengetahuan yang juga berakhir dengan kebinasaan saat disertai dengan kedurhakaan dan keangkuhan. Allah berfirman; sesungguhnya karun termasuk kaum musa yang hidup semasa dengannya dan konon adalah anak nabi musa. Tetapi meski berasal dari keluarga terhormat dia melampaui batas dengan berlaku zalim terhadap mereka dan sombong. Ia adalah seorang yang kami beri nikmat dengan memasukkannya ke dalam kelompok kaum nabi musa, dan kami telah menganugerahkan pula kepadanya perbendaharaan harta yang kunci-kunci gudang tempat penyimpanan hartanya itu sungguh sangat banyak sehingga terasa berat dipikul oleh sejumlah orang yang kuat-kuat. Itu baru kuncinya, ada pun harta kekayaannya, tidak mungkin dapat dipikul oleh orang yang sangat banyak sekali pun. Ingatlah ketika ia terpedaya oleh nikmat Allah yang dikaruniakan kepadanya dengan mengingkari dan tidak mensyukurinya, kaumnya menasihatinya dengan berkata kepadanya, 'janganlah engkau terlalu bangga dengan harta kekayaan yang engkau miliki, kebanggaan yang menjadikanmu melupakan Allah yang menganugerahkan nikmat itu sehingga tidak bersyukur kepada-Nya. Sungguh, Allah tidak menyukai orang yang membanggakan diri. ' orang-orang kafir mekkah yang menentang nabi Muhammad. Telah tertipu oleh harta mereka, sebab kekayaan mereka digunakan untuk menindas kaum muslim. Padahal, harta benda mereka sangat sedikit jika dibandingkan dengan harta karun. Orang kaya yang angkuh dan zalim akan berakhir dengan kebinasaan. 77. Nasihat di atas tidak berarti seseorang hanya boleh beribadah murni (mah'ah) dan melarang memperhatikan dunia. Berusahalah sekuat tenaga dan pikiran untuk memperoleh harta, dan carilah pahala negeri akhirat dengan apa yang telah dianugerahkan Allah kepadamu di dunia, berupa kekayaan dan karunia lainnya, dengan menginfakkan dan menggunakannya di jalan Allah. Akan tetapi pada saat yang sama janganlah kamu lupakan bagianmu dari kenikmatan di dunia dengan tanpa berlebihan. Dan berbuatbaiklah kepada semua orang dengan bersedekah sebagaimana atau disebabkan karena Allah telah berbuat baik kepadamu dengan mengaruniakan nikmat-Nya, dan janganlah kamu berbuat kerusakan dalam bentuk apa pun di bagian mana pun di bumi ini, dengan melampaui batas-batas yang telah ditetapkan oleh Allah. Sungguh, Allah tidak menyukai orang yang berbuat kerusakan dan akan memberikan balasan atas kejahatan tersebut."
  }
]