[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan carilah pahala negeri akhirat pada apa yang Allah berikan kepadamu berupa harta benda, dengan mengamalkan ketaatan kepada Allah melalui harta itu di dunia ini. Dan janganlah kamu lupakan bagianmu dari dunia dengan jalan bersenang-senang di dunia ini dengan hal-hal yang halal, tanpa berlebihan. Dan berbuat baiklah kepada orang-orang dengan memberikan sedekah, sebagaimana Allah telah berbuat baik kepadamu dengan (memberikan) harta yang banyak. Dan janganlah kamu mencari apa yang diharamkan oleh Allah berupa tindakan berbuat kerusakan di muka bumi dan penganiayaan terhadap kaummu. Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan dan Dia akan membalas mereka atas amal perbuatan buruk mereka.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "77. Dan mohonlah kepada Allah pahala di kehidupan Akhirat terkait harta yang telah diberikan Allah kepadamu, dengan cara menginfakkannya pada jalan-jalan kebaikan dan janganlah kamu lupa bagianmu dari makan, minum, pakaian dan kenikmatan-kenikmatan lainnya, tanpa berlebih-lebihan dan tidak sombong. Dan perbaikilah hubungan dengan Rabbmu dan dengan hamba-hamba-Nya sebagaimana Rabbmu Yang mahasuci berbuat baik kepadamu. Dan janganlah kamu berbuat kerusakan di muka bumi dengan melakukan kemaksiatan dan meninggalkan ketaatan, sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan di muka bumi dengan perbuatan tersebut, justru Dia murka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "77. Hai Qarun, carilah kenikmatan yang kekal di akhirat melalui infak di jalan kebaikan, karena sebaik-baik harta adalah harta yang digunakan pemiliknya untuk berinfak di jalan Allah, sebab harta itu adalah harta Allah, Dia memberikannya kepada siapa yang Dia kehendaki. Kami tidak mengolokmu yang telah mendapatkan kenikmatan dunia melalui cara yang dihalalkan Allah. Hai Qarun, bersyukur kepada Allah atas apa yang telah diberikan kepadamu dapat membuatmu bersungguh-sungguh dalam berinfak. Perintah kebaikan ini juga bermakna larangan berbuat kerusakan di bumi yang kamu tinggali. Dan ingatlah bahwa Allah tidak menyukai hamba-Nya yang sombong dan angkuh, Dia akan memberi perhitungan kepada seluruh makhluk atas apa yang telah mereka kerjakan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "77. وَابْتَغِ فِيمَآ ءَاتَىٰكَ اللهُ الدَّارَ الْاٰخِرَةَ ۖ (Dan carilah pada apa yang telah dianugerahkan Allah kepadamu (kebahagiaan) negeri akhirat) Maka belanjakanlah harta itu pada apa yang diridhai Allah, bukan digunakan untuk menyombongkan diri. وَلَا تَنسَ نَصِيبَكَ مِنَ الدُّنْيَا ۖ( dan janganlah kamu melupakan bahagianmu dari (kenikmatan) duniawi) Yakni janganlah kamu lalaikan bagianmu di dunia dalam menikmati hartamu yang halal. وَأَحْسِن كَمَآ أَحْسَنَ اللهُ إِلَيْكَ ۖ( dan berbuat baiklah (kepada orang lain) sebagaimana Allah telah berbuat baik kepadamu) Dengan kenikmatan yang telah Allah berikan kepadamu di dunia. وَلَا تَبْغِ الْفَسَادَ فِى الْأَرْضِ ۖ( dan janganlah kamu berbuat kerusakan di (muka) bumi) Yakni janganlah kamu bermaksiat kepada Allah di bumi. إِنَّ اللهَ لَا يُحِبُّ الْمُفْسِدِينَ(Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan) Yakni kerusakan di bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "77. Carilah dalam sesuatu yang diberikan Allah kepadamu itu pahala akhirat dengan menginfakkannya untuk mencari ridhaNya dan menaatiNya, bukan untuk berlaku angkuh dan sewenang-wenang. Janganlah lupa untuk berinfak dalam hal yang dihalalkan Allah kepadamu dan berbuat baiklah kepada hamba-hambaNya dengan bersedekah sebagaimana Allah berbuat baik kepadamu dan memberimu nikmat berupa harta dan penghormatan. Jangan kamu gunakan harta benda untuk bermaksiat kepada Allah, sesungguhnya Dia tidak meridhai orang-orang yang merusak dengan berbuat maksiat di dunia dan akan membalas mereka atas perbuatan mereka"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dan carilah} carilah {pada apa yang telah dianugerahkan Allah kepadamu} yang diberikan kepadamu {(pahala) akhirat, dan janganlah melupakan bagianmu} janganlah mengabaikan bagianmu {di dunia. Berbuat baiklah sebagaimana Allah telah berbuat baik kepadamu dan janganlah berbuat kerusakan di bumi. Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "77. “Dan carilah pada apa yang telah dianugerahkan Allah kepadamu (kebahagiaan) negeri akhirat.” Maksudnya memperoleh sesuatu yang ada di sisi Allah dan bersedekahlah; dan jangan sekali-kali kamu merasa cukup dengan hanya sekedar memperoleh kepuasan nafsu dan meraih berbagai kelezatan, “dan janganlah kamu melupakan bagianmu dari duniawi.” Maksudnya, Kami tidak memerintahmu agar menyedekahkan seluruh harta kekayaanmu sehingga engkau menjadi terlantar, akan tetapi berinfaklah untuk akhiratmu dan bersenang-senanglah dengan harta duniamu dengan tidak merusak agamamu dan tidak pula membahayakan akhiratmu, “dan berbuat baiklah,” kepada hamba-hamba Allah, “sebagaimana Allah telah berbuat baik” kepadamu dengan menganugerahimu harta kekayaan ini, “dan janganlah kamu berbuat kerusakan di (muka) bumi,” dengan bersikap sombong dan berbuat berbagai maksiat terhadap Allah serta tenggelam di dalam kenikmatan dengan melupakan Pemberi nikmat itu. “Sesungguhnya Allah tidak menyukai orang-orang yang berbuat kerusakan.” Bahkan Allah akan menyiksa mereka atas perbuatan itu dengan siksaan yang paling berat."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 77: Berkata jama’ah (dari bani israil) menasihatinya dan menunjukinya : Mintalah (wahai qarun) atas pemberian Allah kepadamu dari harta ini, balasan (pahala) untuk akhirat, dan beramal dengan amalan yang Allah ridhai dari sisi kebaikan, dan janganlah engkau tinggal syarat halal dan haram atas hartamu, bagimu untuk beribadah dengan jujur dan makruf, sebagaimana Allah telah membaguskanmu dan memberikan harta ini yang banyak, dan janganlah engkau berbuat dzalim di muka bumi dengna harta ini; Sebab Allah tidak mengingkan orag-orang yang berbuat kerusakan. Akan tetapi qarun congkak dan sombong, dia mengklaim bahwa hartanya atas jerih payah dan kepiawaiannya, dan ia tetap berada dalam keadaan demikian sampai Allah jatuhkan dan benamkan di bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni engkau wahai Qarun telah memiliki sarana-sarana untuk mengejar akhirat yang tidak dimiliki oleh selainmu. Oleh karena itu, carilah pahala di sisi Allah dengan harta-hartamu, seperti menyedekahkannya sebagian dari rezeki itu di jalan Allah dan jangan hanya digunakan untuk memuaskan nafsu. Berupa harta, yakni agar engkau infakkan di jalan Allah. Yakni Allah tidaklah memerintahkannya untuk menyedekahkan semua hartanya sehingga hartanya habis tanpa bersisa, bahkan sisihkanlah hartamu untuk akhirat, dan silahkan bersenang-senang dengan duniamu, namun tidak sampai melubangi agamamu dan merusak akhiratmu. Yaitu dengan bersikap sombong serta mengerjakan kemaksiatan, dan sibuk dengan nikmat itu sampai lupa kepada Pemberi nikmat (Allah)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 77",
    "description": "Nasihat di atas tidak berarti seseorang hanya boleh beribadah murni (mah'ah) dan melarang memperhatikan dunia. Berusahalah sekuat tenaga dan pikiran untuk memperoleh harta, dan carilah pahala negeri akhirat dengan apa yang telah dianugerahkan Allah kepadamu di dunia, berupa kekayaan dan karunia lainnya, dengan menginfakkan dan menggunakannya di jalan Allah. Akan tetapi pada saat yang sama janganlah kamu lupakan bagianmu dari kenikmatan di dunia dengan tanpa berlebihan. Dan berbuatbaiklah kepada semua orang dengan bersedekah sebagaimana atau disebabkan karena Allah telah berbuat baik kepadamu dengan mengaruniakan nikmat-Nya, dan janganlah kamu berbuat kerusakan dalam bentuk apa pun di bagian mana pun di bumi ini, dengan melampaui batas-batas yang telah ditetapkan oleh Allah. Sungguh, Allah tidak menyukai orang yang berbuat kerusakan dan akan memberikan balasan atas kejahatan tersebut. 78. Karun tidak menanggapi nasihat kaumnya, lupa diri dan tetap melupakan karunia Allah kepadanya. Dengan penuh kesombongan dia berkata, 'sesungguhnya aku diberi harta yang banyak ini, semata-mata karena ilmu dan kemampuan yang ada padaku. Tidak ada jasa siapa pun atas perolehanku itu. Semua karena kepandaianku dalam mengumpulkan harta. ' demikian jawab karun. Tidakkah dia tahu dan sadar, bahwa Allah telah membinasakan umat-umat yang tidak jauh dari masa sebelumnya, yakni sebelum karun, yang lebih kuat fisik dan kemampuan serta pembantu-pembantu mereka daripadanya, dan lebih banyak mengumpulkan harta daripada karun' sungguh kedurhakaan karun telah demikian jelas, dan oleh karenanya, orang-orang yang berdosa seperti karun itu tidak perlu ditanya tentang dosa-dosa mereka, karena Allah telah mengetahui hal itu. Mereka akan masuk neraka, dan hanya akan dita-Nya dengan pertanyaan yang menghinakan."
  }
]