[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Qarun berkata kepada kaumnya yang menasehatinya, “Aku di anugerahi perbendaharaan kekayaan ini, disebabkan oleh apa yang aku miliki berupa ilmu pengetahuan dan kemampuan.” Dan apakah Qarun tidak mengetahui bahwa sesungguhnya Allah telah melenyapkan umat-umat manusia sebelum dirinya yang memiliki kekuatan yang lebih besar daripadanya dan lebih banyak mengumpulkan harta kekayaan? Dan orang-orang yang berdosa tidak perlu ditanya tentang dosa-dosa mereka, karena Allah telah mengetahuinya. Mereka itu ditanya dengan pertanyaan untuk tujuan menjelek-jelekkan dan penetapan pengakuan (mereka) saja. Dan Allah akan menghukum mereka atas apa yang Dia ketahui dari mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "78. Qārūn berkata, “Sesungguhnya aku mendapatkan harta ini karena pengetahuan dan kekuasaan yang aku punyai, karena itu aku berhak atas harta ini dengan alasan tersebut.” Tidakkah Qārūn mengetahui bahwa Allah telah menghancurkan umat-umat sebelumnya yang lebih kuat dan lebih banyak mengumpulkan harta? Tidaklah berguna bagi mereka kekuatan mereka dan harta-harta mereka. Dan pada hari Kiamat orang-orang yang berbuat jahat tidak ditanya tentang dosa-dosa mereka karena Allah sudah mengetahuinya. Adapun pertanyaan yang ditujukan kepada mereka adalah pertanyaan yang menunjukkan kehinaan dan celaan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "78. Qarun menanggapi nasehat orang-orang beriman dengan tetap bersikap angkuh dan ingin membuat mereka diam dan berhenti menasehati: “Tidaklah aku mendapatkan harta melainkan dengan ilmuku yang tinggi mengenai cara memperbanyak harta.” Hai Qarun, kamu lalai dari menghayati keadaan yang terjadi pada umat-umat terdahulu ketika orang-orang yang lebih berkuasa dan lebih kaya darimu berbuat kerusakan dan kezaliman, maka mereka mendapat kemurkaan Allah sehingga Dia membinasakan mereka atas perbuatan buruk yang telah mereka lakukan. Dan tidak perlu menanyakan dosa orang-orang yang bermaksiat, karena Allah Maha Mengetahuinya, dan mereka tidak akan dapat lari dari siksaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "78. قَالَ إِنَّمَآ أُوتِيتُهُۥ عَلَىٰ عِلْمٍ عِندِىٓ ۚ (Karun berkata: “Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku”) Yakni ilmunya dalam pekerjaan dan perniagaan. Pendapat lain mengatakan yakni ilmunya mengenai harta berharga yang terpendam. أَوَلَمْ يَعْلَمْ أَنَّ اللهَ قَدْ أَهْلَكَ مِن قَبْلِهِۦ مِنَ الْقُرُونِ مَنْ هُوَ أَشَدُّ مِنْهُ قُوَّةً(Dan apakah ia tidak mengetahui, bahwasanya Allah sungguh telah membinasakan umat-umat sebelumnya yang lebih kuat daripadanya) Yang dimaksud dengan (القرون) adalah umat-umat terdahulu. وَأَكْثَرُ جَمْعًا ۚ( dan lebih banyak mengumpulkan harta?) Yakni mengumpul harta. Seandainay harta dan kekuatan menunjukkan kemuliaan seseorang maka Allah tidak akan membinasakan mereka. وَلَا يُسْـَٔلُ عَن ذُنُوبِهِمُ الْمُجْرِمُونَ (Dan tidaklah perlu ditanya kepada orang-orang yang berdosa itu, tentang dosa-dosa mereka) Yakni janganlah kamu bertanya para malaikat kelak tentang orang-orang yang berdosa, sebab mereka mengetahui mereka dari tanda-tandanya kerena mereka akan dibangkitkan dengan wajah yang hitam membiru."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "78. Qarun pun menjawab kaumnya: “Sesungguhnya harta ini kudapatkan dengan pengetahuanku dan kemahiranku dalam bekerja dan berdagang” Apakah dia tidak mengetahui bahwa sesungguhnya Allah menghancurkan umat-umat terdahulu sebelumnya dengan mengazab mereka, sedangkan mereka itu lebih kuat dan lebih memiliki banyak harta daripada dia (Salah satu bukti yang menunjukkan bahwa kekuatan dan harta itu bukan merupakan keutamaan). Orang-orang jahat yang suka bermaksiat itu tidak ditanya tentang dosa-dosa mereka dengan bentuk teguran dan menggali informasi, karena Allah SWT selalu mengamati dosa-dosa mereka, namun mereka akan ditanya dengan bentuk pertanyaan ejekan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dia berkata} Qarun berkata {“Sesungguhnya aku diberi itu semata-mata karena ilmu yang ada padaku”} sesungguhnya aku mendapatkan perbendaharaan harta ini kaarena aku memiliki ilmu dan kemampuan {Apakah dia tidak tahu bahwa sesungguhnya Allah telah membinasakan sebelum dia generasi} umat-umat {yang lebih kuat daripada dia dan lebih banyak mengumpulkan harta. Orang-orang yang durhaka itu tidak ditanya tentang dosa-dosa mereka"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "78. Maka “berkatalah” Qarun untuk menolak nasihat mereka dan kafir terhadap karunia Tuhannya, “Sesungguhnya aku hanya diberi harta itu, karena ilmu yang ada padaku.” Maksudnya, sesungguhnya aku memperoleh harta kekayaan ini karena usahaku dan pengetahuanku tentang berbagai bentuk model usaha dan kepandaianku. Atau : berdasarkan pengetahuan Allah tentang keadaanku. Dia telah mengetahui bahwa aku memang berhak untuk itu. Lalu kenapa kalian menasehatiku atas pemberian yang Allah berikan kepadaku? Lalu Allah berfirman untuk menjelaskan bahwa pemberianNya bukan berarti bukti atas baiknya keadaan orang yang mendapatkan pemberian, “Dan apakah dia tidak mengetahui, bahwasanya Allah sungguh telah membinasakan umat-umat sebelumnya yang lebih kuat daripadanya, dan lebih banyak mengumpulkan harta?” maka apa yang (bisa menjadi) penghalang untuk membinasakan Qarun, sedangkan ketetapan dan sunnah Kami masih tetap berlaku, yaitu membinasakan orang yang semisal Qarun, bahkan lebih hebat daripada Qaarun, apabila dia melakukan hal-hal yang mengakibatkan kebinasaan? “Dan tidaklah perlu ditanya kepada orang-orang yang berdosa itu tentang dosa-dosa mereka,” akan tetapi Allah-lah yang akan menghukum mereka dan menyiksa mereka sesuai dengan perbuatan mereka yang Dia ketahui. Jadi, kalau mereka mengklaim bahwa mereka berkondisi baik dan mereka mengaku selamat, maka ucapan mereka itu bukan berarti diterima, dan itu juga bukan pencegah azab dari mereka sedikit pun, karena dosa-dosa mereka tidak tersembunyi. Maka pengingkaran mereka terhadap dosa-dosa adalah pengingkaran yang tidak pada tempatnya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 78: Mereka (salah satu dari bani israil) menjawab perkataan qarun yang congkak dan sombong dengan berkata : Sesungguhnya tidaklah engkau diberikan harta ini melainkan karena kepiawain dan keterempilan (yang aku) ajarkan dari sisi ikhtiar dan pengetahuan akan ilmu perdagangan dan keuntungan. Maka Allah membantah qarun dan salah satu dari bani israil : Apakah engkau wahai qarun tidak mengetahui bahwasanya Allah membinasakan orang yang lebih sombong, lebih kaya hartanya darimu, dari orang-orang yang mendahuluimu, yang dzalim ? Kemudian Allah menjelaskan bahwa mereka para pendosa tidak ditanya akan dosa mereka, maksudnya adalah mereka tidak dimintai keterangan (informasi), mereka hanyalah ditanya akan pertanyaan yang membuka kedok (mempermalukan) mereka, karena bahwasanya Allah maha tahu atas hal tersebut, sebagaimana yang telah tercatat oleh malaikat (atas amalan-amalan) mereka; Dan mereka akan mendapatkan adzab dengan segera, adzab yang pedih."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Membantah nasehat kaumnya lagi kufur kepada nikmat Tuhannya. Maksudnya, aku memperoleh harta itu karena usaha dan pengalamanku dengan berbagai macam usaha serta karena kepandaianku atau karena Allah mengetahui keadaannku; Dia mengetahui bahwa aku cocok memperolehnya, oleh karena itu mengapa kamu menasihatiku tentang pemberian Allah kepadaku? Allah Subhaanahu wa Ta'aala berfirman menerangkan, bahwa pemberian-Nya tidaklah menunjukkan bahwa keadaan orang yang diberi itu baik. Yakni, apa yang menghalangi untuk dibinasakannya Qarun, padahal sunnatullah berlaku untuk membinasakan orang yang seperti itu jika ia memang melakukan perbuatan yang menghendaki untuk dibinasakan. Yakni, Allah akan menghukum mereka, mengazab mereka sesuai yang Dia ketahui tentang mereka. Oleh karena itu, meskipun mereka menetapkan keadaan yang baik untuk diri mereka, bersaksi bahwa mereka berhak selamat, namun ucapan itu tidaklah diterima, dan bahwa hal itu tidaklah menolak azab sedikit pun, karena dosa mereka tidaklah samar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 78",
    "description": "Karun tidak menanggapi nasihat kaumnya, lupa diri dan tetap melupakan karunia Allah kepadanya. Dengan penuh kesombongan dia berkata, 'sesungguhnya aku diberi harta yang banyak ini, semata-mata karena ilmu dan kemampuan yang ada padaku. Tidak ada jasa siapa pun atas perolehanku itu. Semua karena kepandaianku dalam mengumpulkan harta. ' demikian jawab karun. Tidakkah dia tahu dan sadar, bahwa Allah telah membinasakan umat-umat yang tidak jauh dari masa sebelumnya, yakni sebelum karun, yang lebih kuat fisik dan kemampuan serta pembantu-pembantu mereka daripadanya, dan lebih banyak mengumpulkan harta daripada karun' sungguh kedurhakaan karun telah demikian jelas, dan oleh karenanya, orang-orang yang berdosa seperti karun itu tidak perlu ditanya tentang dosa-dosa mereka, karena Allah telah mengetahui hal itu. Mereka akan masuk neraka, dan hanya akan dita-Nya dengan pertanyaan yang menghinakan. 79. Nasihat yang disampaikan kepada karun tidak digubris olehnya. Bahkan, keangkuhannya semakin menjadi-jadi. Maka keluarlah dia kepada kaumnya, di depan khalayak ramai, dengan membangga-banggakan kemegahannya dan mempertontonkan kekayaan dan keku-atan yang dimilikinya, sehingga membuat silau orang yang lemah imannya. Melihat itu, orang-orang yang selalu menginginkan kehidupan dunia sebagai tumpuan dan tujuan hidupnya berkata, 'mudah-Mudahan kita mempunyai harta kekayaan dan kedudukan seperti apa yang telah diberikan kepada karun, sesungguhnya dia benar-benar mempunyai keberuntungan yang besar di dunia. ' mereka tertipu olehnya dan ber-angan-angan untuk memiliki seperti yang dikaruniakan kepada karun, yaitu harta benda dan keberuntungan yang besar dalam kehidupan. Padahal semua itu akan binasa bila tidak beriman."
  }
]