[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Qarun keluar menemui kaumnya dalam perhiasan kemegahannya, guna memamerkan kebesaran dan limpahan kekayaannya. Dan ketika orang-orang yang menghendaki kemewahan kehidupan dunia menyaksikannya, mereka berkata, “Semoga saja kita mempunyai apa yang diberikan kepada Qarun berupa kekayaan dan kemewahan serta kedudukan tinggi. Sesungguhnya Qarun benar-benar memiliki bagian besar dari kenikmatan dunia."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "79. Lalu Qārūn keluar sambil mengenakan kemegahannya dengan menampakkan kesombongannya. Teman-teman Qārūn yang menginginkan perhiasan kehidupan dunia berkata, “Alangkah baiknya apabila kami mendapatkan perhiasan dunia sebagaimana yang diberikan kepada Qārūn, sesungguhnya Qārūn benar-benar mempunyai keberuntungan yang cukup dan besar.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "79. Qarun tidak menghiraukan nasehat dari kaumnya, kemudian dia keluar dari tempat tinggalnya dengan penuh kesombongan bersama kendaraan, harta, dan pelayannya. Pemandangan ini membuat orang-orang yang lemah imannya yang terbuai oleh keindahan dunia dari akibat buruk yang hadir setelah menikmatinya. Mereka ingin sekali mendapatkan kenikmatan dunia sehingga mereka mengganggap Qarun sebagai orang yang mendapat jatah yang banyak dari kenikmatan itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "79. فَخَرَجَ عَلَىٰ قَوْمِهِۦ فِى زِينَتِهِۦ ۖ (Maka keluarlah Karun kepada kaumnya dalam kemegahannya) Qarun keluar dengan membawa harta kemewahannya yang membuat kagum setiap orang yang melihatnya, oleh sebab itu orang yang melihatnya berangan-angan untuk memiliki harta seperti milik Qarun. قَالَ الَّذِينَ يُرِيدُونَ الْحَيَوٰةَ الدُّنْيَا(Berkatalah orang-orang yang menghendaki kehidupan dunia) Dan kemegahannya. يٰلَيْتَ لَنَا مِثْلَ مَآ أُوتِىَ قٰرُونُ إِنَّهُۥ لَذُو حَظٍّ عَظِيمٍ (“Moga-moga kiranya kita mempunyai seperti apa yang telah diberikan kepada Karun; sesungguhnya ia benar-benar mempunyai keberuntungan yang besar”) Yakni ia adalah orang yang beruntung karena memiliki harta yang banyak di dunia. Terdapat perselisihan pendapat tentang siapa orang yang mengatakan hal ini; terdapat pendapat mengatakan bahwa mereka adalah orang-orang yang beriman di zaman itu. Dan pendapat lain mengatakan mereka adalah orang-orang kafir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "79. Maka pada suatu hari, keluarlah Qarun kepada kaumnya dengan melakukan konvoi megah dan khusus dengan penuh hiasan harta, baju emas dan sutra, kuda-kuda, dan para pengawal. Dan ketika melihatnya, para penduduk dunia yang tertipu oleh perhiasannya berkata: “Andai saja kami memiliki harta benda seperti yang diberikan kepada Qarun berupa kekayaan dan kehormatan. Sesungguhnya Qarun itu pemilik nasib yang sangat beruntung di dunia”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu dia keluarlah kepada kaumnya dengan perhiasannya. Orang-orang yang menginginkan kehidupan dunia berkata,“Andai saja kita mempunyai harta seperti yang telah diberikan kepada Qarun. Sesungguhnya dia benar-benar mempunyai bagian yang besar”} bagian yang melimpah dari dunia"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "79. Qarun pun terus dalam sikap pembangkangan, kocongkakan, dan tidak mau menerima nasihat kaumnya karena bangga diri dan sombong, dia telah bangga diri dan terpedaya dengan harta yang dikaruniakan kepadanya, “maka keluarlah dia,” pada suatu hari, “dalam kemegahannya,” maksudnya, dalam keadaan yang paling megah dari harta kekayaannya. Ia memang memiliki harta yang luar biasa; ia pun sudah bersiap-siap dan berdandan dengan dandanan mewah yang dapat dilakukannya. Kemegahan itu biasanya, pada orang semisal dia adalah sangat luar biasa. Kemegahan yang mengumpulkan (seluruh) perhiasan dunia, keindahan, kemegahan dan kebanggaannya, sehingga mata terbelalak melihatnya, dandanannya menakjubkan hati, dan perhiasannya mencengangkan jiwa, sehingga manusia yang memandangnya terbagi menjadi dua kelompok. Masing-masing berbicara sesuai dengan kemauan dan harapan yang dimilikinya, lalu “berkatalah orang-orang yang menghendaki kehidupan dunia.” Maksudnya, orang-orang yang keinginannya terpaku padanya, dan dunia menjadi akhir dambaannya, mereka tidak memiliki impian kepada selainnya, “Moga-moga kiranya kita mempunyai seperti sesuatu yang telah diberikan kepada Qarun,” yaitu harta kekayaan dunia, kenikmatan dan kemewahannya, “sesungguhnya dia benar-benar mempunyai keberuntungan yang besar.” Mereka membenarkan bahwa Qarun adalah orang yang mendapat keberuntungan yang sangat besar, kalau saja keadaan seperti itu menjadi harapan mereka, sementara di balik kehidupan dunia ini tidak ada kehidupan yang lain. Sungguh dia telah dikarunia puncak kesenangan dari kesenangan dunia; dia mampu melakukan semua apa yang ia mau dengan harta kekayaan itu. Inilah keberuntungan yang sangat besar menurut keinginan mereka! Sungguh impian yang telah menjadikan hal seperti itu sebagai puncak harapan dan angan-angannya adalah benar-benar impian yang paling hina, paling rendah dan paling tidak bernilai. Ia sama sekali tidak memiliki sedikit keinginan untuk naik kepada harapan-harapan yang tinggi dan dambaan-dambaan yang bernilai mulia."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 79: Allah kemudian mengabarkan keadaan qarun yang suatu hari keluar dengan sebaik-baik perhiasan kepada kaumnya, sehingga kaumnya takjub ketika mereka melihatnya,menginginkan perhiasan dalam kehidupan dunia dengan berkata : Kiranya kami diberikan sebagaimana qarun dari perbendaharaan dan kesenangan dunia maka sungguh kami memiliki kebaikan dan keuntungan yang besar dari keduniaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Qarun senantiasa membangkang dan bersikap sombong, tidak menerima nasehat kaumnya sambil bersikap ujub (bangga diri) dan harta yang diperolehnya membuatnya tertipu. Karun keluar dalam satu iring-iringan yang lengkap dengan pengawal, hamba sahaya dan segala kemewahannya untuk memperlihatkan kemegahannya kepada kaumnya. Ketika orang-orang melihatnya, maka terbagilah dua golongan; golongan yang menginginkan kehidupan dunia dan golongan yang berilmu. Harapan mereka tertuju dan terbatas sampai di dunia. Kalau sekiranya kehidupan itu hanya di dunia yang fana ini saja, maka memang itu adalah keberuntungan yang besar, karena ia memperoleh kenikmatan yang luar biasa, di mana semua kebutuhannya terpenuhi, namun sayang kenikmatan itu tidak sempurna, terbatas dan hanya sementara, sedangkan di sana ada kehidupan yang kekal abadi dan kenikmatannya pun sempurna, yaitu surga."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 79",
    "description": "Nasihat yang disampaikan kepada karun tidak digubris olehnya. Bahkan, keangkuhannya semakin menjadi-jadi. Maka keluarlah dia kepada kaumnya, di depan khalayak ramai, dengan membangga-banggakan kemegahannya dan mempertontonkan kekayaan dan keku-atan yang dimilikinya, sehingga membuat silau orang yang lemah imannya. Melihat itu, orang-orang yang selalu menginginkan kehidupan dunia sebagai tumpuan dan tujuan hidupnya berkata, 'mudah-Mudahan kita mempunyai harta kekayaan dan kedudukan seperti apa yang telah diberikan kepada karun, sesungguhnya dia benar-benar mempunyai keberuntungan yang besar di dunia. ' mereka tertipu olehnya dan ber-angan-angan untuk memiliki seperti yang dikaruniakan kepada karun, yaitu harta benda dan keberuntungan yang besar dalam kehidupan. Padahal semua itu akan binasa bila tidak beriman. 80. Tetapi orang-orang yang dianugerahi ilmu oleh Allah dalam bentuk ilmu yang bermanfaat tidak tertipu oleh itu semua. Mereka memberi nasihat kepada orang-orang yang tertipu itu dengan berkata, 'celakalah kamu jika bersikap dan berkeyakinan seperti itu! bertakwalah kepada Allah dan taatlah kepada-Nya. Ketahuilah, pahala dan kenikmatan yang disediakan oleh Allah di sisi-Nya lebih baik bagi orang-orang yang ber-iman dan mengerjakan kebajikan dari pada kekayaan yang dimiliki dan dipamerkan oleh karun, dan pahala yang besar itu hanya diperoleh oleh orang-orang yang sabar dan tabah dalam melaksanakan konsekuensi keimanan dan amal saleh serta menerima ujian dan cobaan dari Allah. '."
  }
]