[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "7-8. Dan Kami ilhamkan kepada ibunya Musa ketika melahirkannya dan mengkhawatirkannya dari disembelih oleh Fir’aun sebagaimana ia telah menyembelihi anak-anak Bani Israil, “Susuilah dia dengan hati tenang. Lalu bila kamu khawatir berita si anak akan diketahui, maka letakkanlah dia di dalam kotak dan hanyutkanlah dia ke sungai Nil, tanpa rasa khawatir terhadap Fir’aun dan kaumnya untuk membunuhnya, dan tanpa ada rasa kesedihan atas kepergiannya. Sesungguhnya Kami akan mengembalikan putramu kepadamu dan mengutusnya sebagai seorang rasul.” Maka sang ibu meletakkan putranya di dalam suatu kotak dan menghanyutkannya ke sungai Nil. Kemudian orang-orang Fir’aun menemukan dan mengambilnya. Maka itulah kesudahan kejadian tersebut, itulah yang Allah takdirkan untuk menjadikan Musa sebagai musuh bagi mereka dengan menyelisihi agama mereka dan membuat mereka terperosok kepada kesedihan dengan menenggelamkan mereka dan melenyapan kerajaannya ditangn Musa. Sesungguhnya Fir’aun dan Haman dan para pendukung mereka adalah orang-orang yang berdosa lagi menyekutukan Allah."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "8. Maka ibunya mengikuti apa yang telah Kami ilhamkan kepadanya supaya meletakkannya di dalam sebuah peti dan melemparkannya di laut, lalu keluarga Fir'aun menemukannya dan mengambilnya, agar terjadi apa yang diinginkan oleh Allah yaitu Musa akan menjadi musuh bagi Fir'aun, Allah menghancurkan kerajaannya melalui tangan Musa, untuk menghapuskan kesedihan mereka. Sesungguhnya Fir'aun dan menterinya, Hāmān dan para penolong mereka adalah orang-orang yang berbuat dosa karena kekufuran mereka, kesewenang-wenangan mereka dan perusakan mereka di muka bumi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "8. Para pelayan Fir’aun memungut keranjang itu dari permukaan air karena rasa kasihan terhadap Musa, agar keselamatannya menjadi sebab terealisasikannya ketetapan Allah. Anak kecil ini kelak akan menjadi sebab kehancuran kerajaan Fir’aun, karena dia akan menjadi musuh bagi pembesar Fir’aun dan penentang keyakinannya, serta sumber penderitaannya. Fir’aun, Haman -menterinya-, dan para pengikutnya layak mendapat kesudahan yang buruk sebagai balasan bagi mereka akibat kesyirikan dan dosa-dosa yang telah mereka lakukan, serta kezaliman mereka terhadap Bani Israil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "8. فَالْتَقَطَهُۥٓ ءَالُ فِرْعَوْنَ (Maka dipungutlah ia oleh keluarga Fir’aun) Mereka mengambil peti yang mengangkut Musa dari sungai. لِيَكُونَ لَهُمْ عَدُوًّا وَحَزَنًا ۗ( yang akibatnya dia menjadi musuh dan kesedihan bagi mereka) Mereka mengambilnya dengan tujuan untuk menjadikannya anak dan penyejuk pandangan bagi mereka, dan bukan untuk menjadikannya musuh. Namun kelak ia akan menjadi musuh dan kesedihan bagi mereka. إِنَّ فِرْعَوْنَ وَهٰمٰنَ وَجُنُودَهُمَا كَانُوا۟ خٰطِـِٔينَ (Sesungguhnya Fir’aun dan Haman beserta tentaranya adalah orang-orang yang bersalah) Yakni orang-orang yang bermaksiat dan berdosa dalam setiap perkataan dan perbuatan mereka terhadap Bani Israil, seperti menyiksa, memperbudak, dan membunuh anak laki-laki mereka dan membiarkan hidup anak perempuan mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "8. Maka dipungutlah/diasuhlah nabi Musa oleh keluarga Fir´aun yang akibatnya dia menjadi musuh dan sumber kesedihan bagi mereka. Fungsi lam adalah lam akibat atau shairurah untuk menunjukkan sebagai suatu akibat bahwa Musa akan menjadi musuh mereka. Alhazan adalah sebab kesedihan, adapun alhuzn adalah berduka. Sesungguhnya Fir´aun dan Haman beserta tentaranya adalah orang-orang yang bersalah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian keluarga Firʻaun memungutnya} lalu keluarga Fir’aun mengambilnya dari sungai tanpa mencarinya dan kehendak (untuk mencarinya {agar dia menjadi musuh dan kesedihan bagi mereka. Sesungguhnya Firʻaun, Haman, dan bala tentara mereka adalah orang-orang salah} orang-orang yang berdosa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "8. Sepertinya dia sudah merasa mengkhawatirkan putranya dan harus melakukan apa yang diperintahkan kepadanya, maka dia pun menghanyutkannya di sungai, dan Allah menggiringnya hingga Musa dipungut oleh “keluarga Firaun,” sehingga Musa menjadi barang temuan mereka, dan merekalah yang langsung menemukannya, “agar dia menjadi musuh dan kesedihan bagi mereka.” Maksudnya, agar akibat dan akhir dari penemuan ini adalah dia menjadi musuh bagi mereka dan kesedihan yang menyedihkan mereka, disebabkan sikap hati-hati itu tidak akan berguna bila berhadapan dengan takdir, dan bahwa orang yang mereka takuti dari kaum Bani Israil telah ditetapkan oleh Allah untuk menjadi pemimpin mereka, yang tumbuh besar dalam asuhan mereka dan di bawah pengawasan dan tanggungan mereka. Bila dicermati dan direnungkan, maka Anda akan menemukan di balik itu semua berbagai kemaslahatan bagi Bani Israil dan mencegah banyak permasalahan yang membahayakan mereka serta menolak banyak tindakan melampaui batas sebelum kerasulannya (Musa), di mana beliau menjadi termasuk golongan pembesar kerajaan; dan sudah menjadi tabiat bahwa dia melakukan pembelaan terhadap hak-hak bangsanya. Di samping itu, dia adalah seorang yang memiliki kemauan keras dan semangat yang berapi-api. Oleh karenanya, kondisi yang menimpa bangsa yang tertindas, -dimana kehinaan dan penghinaan telah sampai kepada titik klimaks seperti yang dikisahkan oleh Allah sebagiannya-, telah sampai (pada batas yang) membuat sebagian individunya menentang bangsa yang kejam lagi semena-mena di muka bumi ini, sebagaimana akan di jelaskan nanti. Ini adalah awal (pengantar) bagi sebuah kemenangan. Sebab, sesungguhnya Allah telah menetapkan bahwa di antara sunnah-sunnahNya yang berlaku adalah Dia menjadikan segala permasalahan berjalan secara bertahap, sedikit demi sedikit, tiak datang sekaligus. “Sesungguhnya Firaun dan Hanan beserta tentaranya adalah orang-orang yang bersalah.” Maksudnya, lalu Kami ingin menghukum keduanya atas kesalahan mereka berdua, dan Kami membuat tipu daya terhadap mereka atas makar dan tipu daya yang mereka lakukan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 8: Maka ibu Musa berbuat sebagaimana apa yang Ia perintahkan. Kemudian sampailah kotak kayu tersebut ke pinggiran istana fir’aun; Maka diambillah oleh tentaranya untuk menyelamatkan Musa dari fir’aun. Mereka tidak mengetahui bahwa yang diambil (Musa) tersebut akan menjadi kesedihan bagi mereka, dan menjadi sebab kebinasaan mereka. Allah kemudian menjelaskan bahwa fir’aun dan utusan-utusannya (Haman dan tentara-tentaranya) semuanya terjatuh dalam kesalahan, dosa yang menggabungkan antara dosa, kedzaliman, dan kekufuran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka memungut peti itu, lalu membawanya dan menaruhnya di hadapan Fir’aun, lalu dikeluarkanlah bayi Musa dari peti itu. Yakni agar akibat dari memungutnya adalah ia menjadi musuh mereka dan membuat mereka sedih karena sikap waspada dari mereka jika kerajaannya digulingkan tidaklah mengangkat takdir, dan karena orang yang mereka khawatirkan itu -tanpa mereka sadari- ternyata tumbuh besar di bawah asuhan mereka. Di samping itu, mereka sebenarnya tidak ingin memungut bayi itu. Jika kita perhatikan peristiwa ini, kita akan menemukan di dalamnya berbagai maslahat bagi Bani Israil, menyingkirkan beban berat yang menimpa mereka selama ini, mencegah tindak penganiayaan yang sebelumnya menimpa mereka, dsb. karena Nabi Musa ‘alaihis salam termasuk pembesar di kerajaan Fir’aun. Maka dari itu, tentu adanya pembelaan terhadap hak bangsa yang lemah ini (Bani Israil), sedangkan Nabi Musa ‘alaihis salam sendiri memiliki niat yang luhur dan semangat yang membara. Oleh karena itulah, sampai ada di antara bangsa yang lemah ini seorang yang berani menentang bangsa yang sombong itu (kaum Fir’aun). Ini merupakan awal kemenangan, karena Allah Subhaanahu wa Ta'aala termasuk sunnah-Nya yang berlaku adalah mengadakan perkara secara bertahap, tidak sekaligus. Haman adalah mentri Fir’aun. Oleh karena itulah, Allah ingin memberikan hukuman kepada mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 8",
    "description": "Berdasarkan wahyu yang berupa ilham tersebut maka ibu musa menghanyutkannya di sungai dan setelah mengapung beberapa saat dia dipungut oleh keluarga fir'aun agar pada akhirnya kelak dia yakni musa yang dipungut itu menjadi musuh karena menantang ajaran fir'aun, dan menjadi sumber dan penyebab kesedihan bagi mereka yakni fir'aun dan rezimnya, karena dialah akan menghancurkan mereka. Sungguh, fir'aun dan haman bersama bala tentaranya dan pendukung-pendukungnya adalah orang-orang bersalah dan berdosa karena berencana melakukan itu dengan sengaja dan disertai kebulatan tekad. 9. Setelah musa dipungut dan dilihat oleh keluarga istana, istri fir'aun berkata, 'dia, yakni anak itu adalah penyejuk mata hati bagiku dan bagimu wahai suamiku, fir'aun. Karena itu janganlah kamu wahai fir'aun dan jangan juga siapa pun yang engkau perintahkan membunuhnya seperti yang terjadi pada anak-anak lelaki bani israil mendidiknya dengan baik atau kita ambil dia menjadi anak angkat jika ternyata ia tidak ditemukan oleh orang tuanya'. Demikian ucapan istri fir'aun ketika ia bersama suaminya dan siapa yang ada di sekelilingnya, sedang mereka tidak menyadari apa yang akan terjadi setelah fir'aun memeliharanya di istana."
  }
]