[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang dianugerahi ilmu tentang Allah dan syariatNya serta memahami hakikat-hakikat perkara dengan sebenarnya berkata kepada orang-orang yang mengatakan, “Semoga saja kita mempunyai apa yang diberikan kepada Qarun”, “Celaka kalian! Bertakwalah kepada Allah dan taatlah kepadaNya. Pahala dari Allah yang diperuntukkan bagi orang yang beriman kepadaNya dan rasul-rasulNya dan melakukan amal-amal shalih itu adalah lebih baik daripada apa yang diberikan kepada Qarun. dan tidaklah menerima nasihat ini dan diberi taufik untuk memahami dan melakukannya kecuali orang-orang yang mau bersungguh-sungguh menundukkan jiwanya dan bersabar dalam ketaatan kepada Tuhannya serta menjauhi maksiat-maksiat kepadaNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "80. Dan orang-orang yang diberi ilmu tatkala mereka melihat Qārūn di dalam kemegahannya dan mendengarkan apa yang diangankan oleh teman-temannya, “Celaka kalian, balasan Allah di kehidupan Akhirat dan kenikmatan yang disiapkan oleh Allah bagi orang-orang yang beriman kepada-Nya dan beramal saleh itu lebih baik daripada apa yang diberikan kepada Qārūn dari perhiasan dunia.” Dan tidaklah bisa mengucapkan ucapan ini dan mengamalkan apa yang menjadi keharusannya kecuali orang-orang sabar yang bersabar dalam mengutamakan pahala yang ada di sisi Allah daripada kenikmatan fana yang ada di dunia."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "80. Akan tetapi terdapat kelompok lain yang Allah beri mereka pemahaman dan kebijaksanaan dalam menilai segala sesuatu dengan penilaian yang benar, dan lebih mementingkan kehidupan akhirat daripada kehidupan dunia, serta tidak terlena oleh kemilau harta yang fana. Mereka heran terhadap orang beriman yang hatinya terpaut dengan keindahan dunia dan berharap mendapatkannya: “Apa yang Allah siapkan bagi orang-orang beriman yang mengerjakan amal shalih dengan pahala yang luas kebaikannya dan lebih layak diharapkan; dan tidak ada yang mampu meraih itu melainkan orang-orang yang sabar, sebab kesabaran adalah jalan terbaik utuk meraih derajat yang tinggi.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "80. وَقَالَ الَّذِينَ أُوتُوا۟ الْعِلْمَ (Berkatalah orang-orang yang dianugerahi ilmu) Mereka adalah para pendeta Bani Israil, mereka berkata kepada orang-orang yang beangan-angan mendapat harta seperti milik Qarun: وَيْلَكُمْ ثَوَابُ اللهِ خَيْرٌ(“Kecelakaan yang besarlah bagimu, pahala Allah adalah lebih baik) Yakni pahala Allah di akhirat lebih baik daripada apa yang mereka angan-angankan. لِّمَنْ ءَامَنَ وَعَمِلَ صٰلِحًا(bagi orang-orang yang beriman dan beramal saleh) Dalam harta yang diberikan Allah kepadanya baik itu sedikit maupun banyak. وَلَا يُلَقَّىٰهَآ(dan tidak diperoleh pahala itu) Yakni kalimat yang mereka ucapkan ini tidak akan masuk ke hati seseorang dan mengamalkannya kecuali orang yang bersabar. إِلَّا الصّٰبِرُونَ (kecuali oleh orang-orang yang sabar) Bersabar atas ketaatan kepada Allah dan menyabarkan diri mereka dari syahwat, sehingga mereka tidak mengharapkan kenikmatan dunia yang fana dengan tujuan agar dapat menyombongkan diri di muka bumi dan membuat kerusakan di dalamnya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "80. Orang yang memiliki ilmu tentang keadaan akhirat dan apa yang dijanjikan Allah di dalamnya yaitu para pendeta Bani Israil berkata: “Celakalah kalian! (yang dimaksud disini adalah cemoohan dan cacian, yaitu jangan kalian ucapkan kata yang salah ini. Pada mulanya, itu adalah kata-kata yang menunjukkan pada kehancuran) Pahala dan nikmat Allah di surga bagi orang yang beriman kepada Allah dan rasulNya, mengerjakan perintah-perintahNya dan beramal shalih dalam harta benda yang diberikanNya itu lebih baik daripada apa yang mereka angan-angankan.” Dan orang yang mendapat pahala itu tidak akan bertemu surga kecuali orang-orang yang bersabar dalam ketaatan dan menjauhi kemaksiatan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Orang-orang yang dianugerahi ilmu berkata,“Celakalah kalian, pahala Allah lebih baik bagi orang-orang yang beriman dan beramal shalih. (ucapan itu) tidak diperoleh} perkataan dan amal ibadah ini tidak diperoleh {kecuali untuk orang-orang yang sabar”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "80. “Dan berkatalah orang-orang yang dianugerahi ilmu.” Yaitu mereka yang mengetahui hakikat segala sesuatu dan melihat kepada esensi dunia di saat mereka (golongan yang pertama) hanya melihat kepada bagian luarnya saja. “Kecelakaan yang besarlah bagimu,” dengan nada prihatin terhadap apa yang mereka dambakan untuk diri mereka, sambil melihat kondisi mereka tidak setuju dengan perkataan mereka. “Pahala Allah,” yang sekarang berupa kelezatan beribadah, mencintaiNYa, kembali kepadaNya, dan menghadap kepadaNya, dan kelak di akhirat, berupa surge dan segala isinya yang diinginkan oleh jiwa dan sedap dipandang mata itu lebih lebih tinggi nilainya daripada yang rendah. Sungguh tidak ada yang akan menerima hal demikian dan mendapat taufik untuknya “kecuali orang-orang yang sabar,” yaitu mereka yang menahan diri mereka semata-mata untuk taat kepada Allah, menahan diri mereka dari kedurhakaan terhadap Allah, dan menerima takdir-takdir Allah yang menyakitkan; mereka sabar atas gemerlap dunia dan kenikmatannya sehingga tidak memalingkan mereka dari Allah, dan tidak menjadi penghalang antara mereka dengan tujuan mereka diciptakan. Merekalah orang-orang yang mengutamakan pahala dari Allah atas dunia fana ini."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 80: Akan tetapi mereka yang Allah berikan kekayaan (yang sebenarnya) adalah mereka yang Allah berikan ilmu syari, maka ketahuilah akan hakikat dunia dan kehinaannya. Mereka berkata kepada para pecinta dunia yang fana : Ketahuilah wahai kaum jika memang kalian mengetahui akibat dari dunia yang fana atas negeri akhirat yang kekal, maka ketahuilah bahwa ganjaran dari Allah adalah sungguh diberikan bagi siapa yang beriman dan beramal shalih di dunia dan akhirat yang bahwasanya akhirat adalah sebaik-baik dan seutama-utamanya atas apa yang kalian angan-angankan, tidak akan diberikan keutamaan ini serta amalan ini kecuali bagi mereka yang bersabar diatas ketaatan kepada Allah dan sabar menjauhi maksiat dan sabar atas segala takdir-Nya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Mereka mengetahui hakikat sesuatu, melihat bagian dalam dunia ini ketika orang banyak hanya melihat bagian luar. Sambil merasakan sakit hati karena harapan kaumnya yang salah, meratapi keadaan mereka dan mengingkari perkataan mereka. Di dunia dengan merasakan kenikmatan beribadah, mencintai-Nya dan menghadap kepada-Nya, sedangkan di akhirat berupa surga dengan kenikmatan yang ada di dalamnya yang disenangi oleh jiwa dan indah dipandang mata. Daripada yang diberikan kepada Qarun di dunia. Bisa juga maksudnya, bahwa tidak ada yang diberi taufik kepadanya kecuali orang-orang yang sabar. Di atas ketaatan kepada Allah dan menjauhi maksiat, serta bersabar terhadap takdir Allah yang terasa pedih. Mereka bersabar terhadap kesenangan dunia sehingga tidak membuat mereka lalai dari beribadah kepada Tuhan mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 80",
    "description": "Tetapi orang-orang yang dianugerahi ilmu oleh Allah dalam bentuk ilmu yang bermanfaat tidak tertipu oleh itu semua. Mereka memberi nasihat kepada orang-orang yang tertipu itu dengan berkata, 'celakalah kamu jika bersikap dan berkeyakinan seperti itu! bertakwalah kepada Allah dan taatlah kepada-Nya. Ketahuilah, pahala dan kenikmatan yang disediakan oleh Allah di sisi-Nya lebih baik bagi orang-orang yang ber-iman dan mengerjakan kebajikan dari pada kekayaan yang dimiliki dan dipamerkan oleh karun, dan pahala yang besar itu hanya diperoleh oleh orang-orang yang sabar dan tabah dalam melaksanakan konsekuensi keimanan dan amal saleh serta menerima ujian dan cobaan dari Allah. '81. Sebagai akibat dari sikapnya yang sombong dan keras kepala dalam kedurhakaan, meski telah dinasihati, maka sangat wajar bila kami benamkan dia dengan cara melongsorkan tanah sehingga ia terbenam bersama rumah, harta benda dan seluruh perhiasannya ke dalam perut bumi. Maka tidak ada baginya satu golongan pun, baik keluarga maupun lainnya, yang akan menolongnya dari azab tersebut selain Allah, dan dia tidak termasuk orang-orang yang dapat membela diri ketika datang azab Allah."
  }
]