[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Maka Kami membenamkan Qarun dan rumahnya ke dalam bumi. Maka tidak ada bala tentara yang menolongnya selain Allah. dan tidaklah ia bisa mempertahankan diri dari (siksaan) Allah bila siksaanNya telah menimpanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "81. Maka Kami benamkan Qārūn ke dalam tanah bersama rumahnya dan apa yang ada di dalamnya sebagai bentuk balasan terhadapnya atas perilakunya yang melampaui batas. Lalu ia tidak mempunyai suatu golongan pun selain Allah yang menolongnya, dan tidak pula ia termasuk orang yang bisa menolong dirinya sendiri."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "81. Beberapa saat setelah Qarun keluar dengan membawa keindahan dunianya, Allah mendatangkan siksaan baginya di dunia; Allah menenggelamkannya bersama hartanya ke dalam tanah dan menjadikan tanah bagian atas terbalik menjadi bagian bawahnya. Qarun berusaha meminta pertolongan dari golongan yang bersamanya, akan tetapi tidak ada seorangpun yang dapat menolongnya dari keadaan itu, dan dia tidak mendapatkan keberuntungan sedikitpun setalah turunnya ketetapan dan siksaan Allah kepadanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "81. فَخَسَفْنَا بِهِۦ وَبِدَارِهِ الْأَرْضَ (Maka Kami benamkanlah Karun beserta rumahnya ke dalam bumi) Allah meneggelamkan dirinya dan rumahnya sampai terbenam dan lenyap ke dalam tanah. فَمَا كَانَ لَهُۥ مِن فِئَةٍ يَنصُرُونَهُۥ مِن دُونِ اللهِ (Maka tidak ada baginya suatu golonganpun yang menolongnya terhadap azab Allah) Yakni ia tidak memiliki orang-orang yang dapat menolongnya dan mencegah azab Allah yang ditimpakan kepadanya. وَمَا كَانَ (Dan tiadalah ia) Terhadap dirinya. مِنَ الْمُنتَصِرِينَ(termasuk orang-orang (yang dapat) membela (dirinya)) Yakni tidak dapat mengelak penenggelaman yang menimpanya dan mampu menolong dirinya meski ia memiliki banyak harta."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "81. Dan saat Qarun tertipu dengan banyaknya harta itu, Allah membenamkannya beserta harta benda, rumah dan daerah yang dihuninya ke dalam bumi. Dia (Allah) membenamkannya, melenyapkannya dan mengubah derajat tingginya menjadi derajat rendah. Dan dia (Qarun) tidak memiliki kumpulan penolong yang dapat menyelamatkannya untuk melindungi dan menghalanginya dari siksa dan kehancuran selain Allah. Dan tidak ada yang bisa mencegah apa yang diterima olehnya berupa azab dibenamkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu Kami membenamkan dia bersama rumahnya ke dalam bumi. Maka tidak ada baginya satu golongan} kelompok {pun yang akan menolongnya selain Allah dan dia tidak termasuk orang-orang yang membela diri"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "81. Tatkala kondisi kezhaliman dan kemegahan sudah memuncak bagi Qarun, harta kekayaan pun telah menghiasinya, dan kesombongan pun telah menguasai dirinya, maka dia ditimpa azab secara mendadak. “Maka Kami timbun Qarun beserta rumahnya ke dalam bumi,” sebagai balasan setimpal atas perbuatannya. Oleh karena dia telah mengangkat dirinya (sombong) di atas hamba-hamba Allah, maka Allah menurunkannya pada derajat manusia yang paling rendah. Dia ditenggelamkan bersama semua harta yang telah menjadikan dirinta terpedaya, yaitu rumah, seluruh harta benda dan kekayaannya. “Maka tidak ada baginya suatu golongan pun” satu kelompok, satu kumpulan, para pembantu dan para tentara, “yang menolongnya terhadap azab Allah, dan tiadalah dia termasuk orang-orang (yang dapat) membela (dirinya),” maksudnya, kala azab menimpanya, dia tidak ditolong dan tidak bisa menolong dirinya sendiri."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 81: Ketika qarun menempati kedudukan tertinggi, serta kagum terhadap dirinya sendiri, Allah tenggelamkan dirinya di bumi, Allah hilangkan dari muka bumi. Tidak berguna harta bendanya dan yang sebaliknya justru ia tertimpa adzab dan kebinasaan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Saat kesombongan Karun dan ujub (bangga dirinya) semakin meningkat. Sebagai balasan yang sesuai dengan amalnya. Oleh karena dia meninggikan dirinya di hadapan hamba-hamba Allah, maka Allah menempatkannya pada bagian yang paling bawah, demikian pula rumah dan harta bendanya. Ketika azab datang, dia tidak ditolong dan tidak dapat membela diri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 81",
    "description": "Sebagai akibat dari sikapnya yang sombong dan keras kepala dalam kedurhakaan, meski telah dinasihati, maka sangat wajar bila kami benamkan dia dengan cara melongsorkan tanah sehingga ia terbenam bersama rumah, harta benda dan seluruh perhiasannya ke dalam perut bumi. Maka tidak ada baginya satu golongan pun, baik keluarga maupun lainnya, yang akan menolongnya dari azab tersebut selain Allah, dan dia tidak termasuk orang-orang yang dapat membela diri ketika datang azab Allah. 82. Dan orang-orang yang kemarin mengangan-angankan dengan penuh harapan untuk mendapatkan kedudukan seperti kedudukan yang dira-ihnya itu mengulang-ulang kata-kata penyesalan setelah mereka merenungi apa yang menimpa karun. Mereka berkata, 'aduhai, benarlah kiranya Allah yang melapangkan rezeki bagi siapa yang dia kehendaki di antara hamba-hamba-Nya, baik yang mukmin maupun yang kafir, pandai atau tidak, mulia atau hina. Dan sebaliknya, Allah membatasi dan menyempitkan rezeki bagi siapa yang dia kehendaki di antara hamba-hamba-Nya. Sekiranya Allah tidak melimpahkan karunia-Nya pada kita, berupa petunjuk kepada keimanan dan menjaga kita dari keterjerumusan dalam kesesatan dan kesombongan, tentu dia telah membenamkan kita pula sebagaimana dialami oleh karun. Aduhai, benarlah kiranya tidak akan beruntung orang-orang yang mengingkari nikmat Allah, baik di dunia maupun di akhirat kelak. '."
  }
]