[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang memimpikan keadaan Qarun kemarin mengatakan dengan hati hancur, mawas diri lagi takut dari jatuhnya siksaan Allah pada mereka, “Sesungguhnya Allah melapangkan rizki bagi siapa saja yang Dia kehendaki dari para hambaNya dan mempersempit (rizki) bagi orang yang Dia kehendaki dari mereka. Kalaulah sesungguhnya Allah tidak melimpahkan kenikmatan kepada kita di mana Dia tidak menghukum kita atas apa yang kita ucapkan, maka Dia benar-benar akan membenamkan kita sebagaimana yang dilakukan kepada Qarun. Tidakkah kamu tahu bahwa sesungguhnya orang-orang kafir tidak beruntung di dunia maupun di akhirat?”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "82. Dan orang-orang yang menginginkan harta dan perhiasan yang dipunyai Qārūn sebelum terbenam berkata dengan mengambil pelajaran darinya, “Bukankah kami mengetahui bahwa Allah memberi rezeki kepada yang dikehendaki-Nya dari para hamba-hamba-Nya dan menyempitkan rezeki bagi yang dikehendaki-Nya dari mereka. Kalaulah Allah tidak memberi karunia kepada kami dan tidak menyiksa kami karena ucapan kami, tentulah Dia membenamkan kita juga sebagaimana Dia membenamkan Qārūn. Sesungguhnya orang-orang kafir itu tidak akan mendapat kemenangan, baik di dunia maupun di Akhirat, justru langkah dan tujuan mereka menuju kerugian di dunia dan Akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "82. Kejadian itu menjadikan orang-orang yang mengharapkan kekayaan Qarun menyesal dan kembali berserah diri kepada hikmah Allah yang Dia tetapkan, mereka berkata: “Sungguh mengerikan peristiwa dan kesudahan yang buruk ini, dan sungguh menakjubkan kekuasaan Allah terhadap makhluk-Nya. Allah telah menetapkan rezeki bagi hamba-hamba-Nya; meluaskan rezeki bagi yang Dia kehendaki dan menyempitkannya bagi yang Dia kehendaki. Mereka semua adalah hamba-Nya, maka mereka harus ridha terhadap apa yang Allah tetapkan bagi mereka. Kalaulah bukan karena karunia Allah kepada kita dan menjauhkan kita dari kesombongan karena kekayaan fana yang kita dapatkan, niscaya Allah juga akan menimpakan kepada kita kesudahan yang buruk. Dan sekarang telah jelas orang-orang kafir tidak akan mendapat keberuntungan dan keselamatan di dunia dan di akhirat.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "82. وَأَصْبَحَ الَّذِينَ تَمَنَّوْا۟ مَكَانَهُۥ بِالْأَمْسِ (Dan jadilah orang-orang yang kemarin mencita-citakan kedudukan Karun itu) Yakni tidak lama setelah itu. يَقُولُونَ وَيْكَأَنَّ اللهَ يَبْسُطُ الرِّزْقَ لِمَن يَشَآءُ مِنْ عِبَادِهِۦ وَيَقْدِرُ ۖ( berkata: “Aduhai, benarlah Allah melapangkan rezeki bagi siapa yang Dia kehendaki dari hamba-hambanya dan menyempitkannya) Yakni setiap mereka berkata dengan penuh penyesalan atas andai-andai yang mereka lakukan: “telah jelas bagiku sekarang apa yang dulu belum jelas bahwa keputusan ini berada di tangan Allah, Dia memberi kepada yang Dia kehendaki sehingga melapangkan kehidupannya, serta menyempitkan siapa yang Dia kehendaki sebagai ujian dan cobaan baginya.” لَوْلَآ أَن مَّنَّ اللهُ عَلَيْنَا(kalau Allah tidak melimpahkan karunia-Nya atas kita) Dengan rahmat-Nya, dan kalaulah Allah tidak melindungi kita dari kezaliman dan kesombongan yang dilakukan Qarun, serta karena Allah tidak menghukum kita atas angan-angan yang kami, niscaya Allah akan membenamkan kita pula. لَخَسَفَ بِنَا ۖ( benar-benar Dia telah membenamkan kita (pula)) Sebagaimana telah menenggelamkan Qarun. وَيْكَأَنَّهُۥ لَا يُفْلِحُ الْكٰفِرُونَ (Aduhai benarlah, tidak beruntung orang-orang yang mengingkari (nikmat Allah)”) Yakni mereka tidak akan meraih apa yang mereka harapkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "82. Orang-orang yang sebelumnya berangan-angan tentang kedudukan dan kekayaan Qarun berkata: “Aduhai kasihan, Apakah kamu tidak melihat bahwa sesungguhnya Allah melapangkan dan memberikan rejeki bagi hambaNya yang dikehendaki dan menyempitkan serta membatasi rejeki bagi hambaNya yang dikehendaki sebagai suatu ujian dan cobaan sesuai kehendak dan kebijaksanaanNya). Kalau Allah tidak melimpahkan kelembutan, kasih sayang dan kebaikan kepada kami serta tidak menghukum kami dengan apa yang kami miliki maka sungguh Dia (Allah) akan membenamkan kami ke dalam bumi sebagaimana membenamkan Qarun dan sesungguhnya orang-orang yang ingkar dengan (membanggakan) usaha mereka, seperti Qarun itu tidak beruntung”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang yang kemarin berangan-angan tentang kedudukannya itu berkata,“Aduhai benarlah} mengapa kita tidak tahu bahwa {Allah melapangkan} melapangkan {rezeki bagi siapa saja yang Dia kehendaki dari para hamba-hambaNya. Dia juga menyempitkan} Dia juga menyempitkan siapa saja yang Dia kehendaki {Seandainya Allah tidak melimpahkan karuniaNya kepada kita, tentu Dia telah membenamkan kita pula. Aduhai benarlah} mengapa kita tidak tahu bahwa {tidak akan beruntung orang-orang yang ingkar"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "82. “Dan jadilah orang-orang yang kemarin mencita-citakan kedudukan Qarun itu.” Maksudnya, orang-orang yang menginginkan kehidupan dunia yang mengatakan, “Kalau saja kita memiliki seperti apa yang dikaruniakan kepada Qarun,” “mereka berkata” sambil berkeluh kesah, mengambil pelajaran dan dengan rasa takut akan ditimpa azab, “Aduhai, benarlah Allah melapangkan rizki bagi siapa yang Dia kehendaki dari hamba-hambaNya dan menyempitkannya.” Maksudnya, menyempitkan rizki terhadap orang yang Dia kehendaki. Maka saat itu kami tahu bahwa pelapangan harta (rizki) kepada Qarun sama sekali tidak menunjukkan pada adanya kebaikan padanya; kami keliru dalam perkataan, “Ia sesungguhnya orang yang mendapat karunia yang sangat besar.” “Kalau Allah tidak melimpahkan karuniaNya atas kita.” Dia tidak menghukum kami atas perkataan yang telah kami katakan. Kalau saja buka karuniNya dan kemurahanNya, “benar-benar Dia telah menimbun kita (pula).” Dengan demikian, kebinasaan Qarun telah menjadi siksaan baginya, pelajaran dan nasihat bagi yang lain, sampai-sampai orang-orang yang membanggakannya, dapat kamu ketahui bagaimana mereka menyesal, dan pemikiran mereka yang sebelumnya berubah. “Aduhai benarlah, tidak beruntung orang-orang yang mengingkari,” baik di dunia ini maupun di akhirat kelak."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 82: Jadilah mereka yang berangan-angan semisal dengan qarun akan harta bendanya terperangah dan berkata : Sungguh Allah meluaskan bagi siapa yang Dia kehendaki dan menyempitkan bagi siapa yang Dia kehendaki, Dialah pemilik hikmah yang agung, sekiranya Ia tidak maha pemurah, sungguh kami dan apa yang Ia berikan kepada kami sungguh akan Allah benamkan sebagaimana qarun, karena sebab kami yang berangan-angan dan takjub akan harta qarun. Ketahuilah sesungguhnya orang-orang kafir yang mendustakan (Allah dan Nabi-Nya) tidak akan pernah selamat dan sukses di dunia dan tidak pula di akhirat. Kata ويكأن adalah kata yang menunjukkan ketakjuban dan keheranan sebagai bentuk puncak ketakjuban."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Sambil merasa sakit hatinya, mengambil pelajaran dan takut tertimpa azab seperti yang menimpa Karun. Yakni ketika seperti ini, kami pun mengetahui bahwa pelapangan rezeki untuk Karun tidaklah menunjukkan bahwa dia di atas kebaikan dan bahwa ucapan kami yang menyatakan bahwa dia memperoleh keberuntungan yang besar ternyata salah. Oleh karena itu, kebinasaan Karun merupakan hukuman baginya, pelajaran dan nasehat bagi selainnya. Di dunia maupun akhirat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 82",
    "description": "Dan orang-orang yang kemarin mengangan-angankan dengan penuh harapan untuk mendapatkan kedudukan seperti kedudukan yang dira-ihnya itu mengulang-ulang kata-kata penyesalan setelah mereka merenungi apa yang menimpa karun. Mereka berkata, 'aduhai, benarlah kiranya Allah yang melapangkan rezeki bagi siapa yang dia kehendaki di antara hamba-hamba-Nya, baik yang mukmin maupun yang kafir, pandai atau tidak, mulia atau hina. Dan sebaliknya, Allah membatasi dan menyempitkan rezeki bagi siapa yang dia kehendaki di antara hamba-hamba-Nya. Sekiranya Allah tidak melimpahkan karunia-Nya pada kita, berupa petunjuk kepada keimanan dan menjaga kita dari keterjerumusan dalam kesesatan dan kesombongan, tentu dia telah membenamkan kita pula sebagaimana dialami oleh karun. Aduhai, benarlah kiranya tidak akan beruntung orang-orang yang mengingkari nikmat Allah, baik di dunia maupun di akhirat kelak. '83. Begitulah akhir kisah karun yang binasa karena keangkuhannya. Kebahagiaan yang hakiki, yaitu di akhirat kelak, tidak akan diperoleh oleh orang seperti karun. Kenikmatan negeri akhirat itu kami jadikan bagi orang-orang yang tidak menyombongkan diri dengan kekuasaan yang dimilikinya dan tidak berbuat kerusakan di bumi dengan melakukan kemaksiatan dan kejahatan. Dan kesudahan yang baik itu, yaitu surga, hanya bagi orang-orang yang bertakwa, yaitu orang-orang yang kalbunya penuh dengan keimanan karena rasa takut kepada Allah, sehingga mereka melakukan apa yang diridai Allah."
  }
]