[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Negeri akhirat itu Kami jadikan kenikmatannya bagi orang-orang yang tidak menghendaki sikap sombong terhadap kebenaran di muka bumi dan kerusakan di sana. Dan tempat kesudahan yang baik (yaitu surga) adalah bagi orang-orang yang membentengi diri dari siksaan Allah, melakukan amal ketaatan, dan meninggalkan perkara-perkara yang diharamkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "83. Negeri Akhirat itu kami jadikan sebagai negeri kenikmatan dan kemuliaan bagi orang-orang yang tidak menginginkan kesombongan di muka bumi yang menjadikannya lupa dengan keimanan kepada Yang Hak dan mengikutinya, dan bagi orang-orang yang tidak menginginkan kerusakan di muka bumi. Dan kesudahan yang baik berupa kenikmatan Surga dan keridaan Allah yang merupakan bagian dari kenikmatan itu, hanyalah untuk orang-orang yang bertakwa kepada Rabb mereka dengan mengerjakan segala yang diperintahkan Allah dan menjauhi segala yang dilarang-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "83. Itulah kehidupan yang tidak ada lagi kehidupan setelahnya yang memiliki kenikmatan kekal. Kehidupan akhirat itu bagi orang-orang yang memiliki derajat yang tinggi yang tidak berpaling dari kebenaran, tidak berbuat zalim, menyukai kebaikan. Dan itulah kesudahan yang baik yang Allah jadikab bagi orang-orang yang bertakwa dan menyiapkan bekal untuk pertemuan dengan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "83. تِلْكَ الدَّارُ الْاٰخِرَةُ (Negeri akhirat itu) Yakni kemuliaan, kedudukan, dan kenikmatan yang ada di sana adalah yang diberikan di surga. Isyarat dengan (تلك) adalah untuk memuliakan dan mengagungkan balasan di surga, berbanding terbalik dengan penghinaan terhadap kenikmatan dunia yang diberikan kepada Qarun dan orang-orang semisalnya. نَجْعَلُهَا لِلَّذِينَ لَا يُرِيدُونَ عُلُوًّا فِى الْأَرْضِ (Kami jadikan untuk orang-orang yang tidak ingin menyombongkan diri di (muka) bumi) Yakni angkuh dan sombong terhadap orang-orang beriman. وَلَا فَسَادًا ۚ( dan berbuat kerusakan) Yakni melakukan kemaksiatan kepada Allah di dunia. Adapun berbuat kerusakan telah jelas bahwa perbuatan itu dilarang dalam keadaan apapun. Sedangkan derajat yang tinggi maka itu dilarang jika berupa kesombongan dengan meremehkan orang lain dan menzalimi mereka. Adapun keinginan untuk meraih derajat yang tinggi dalam kebenaran dan agama atau rasa suka kepada pakaian, kendaraan, dan tempat tinggal yang bagus tidak termasuk dalam larangan ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "83. Surga dan kenikmatannya itu (Penggunaan isim isyarah pada kata surga itu untuk mengagungkan dan memuliakannya, dan sebaliknya untuk merendahkan harta dunia yang diberikan kepada Qarun dan orang-orang yang serupa dengannya) Kami berikan untuk orang-orang yang tidak menginginkan derajat tinggi dengan cara yang salah, tidak ingin menyombongkan diri di bumi, tidak angkuh kepada manusia, tidak menzalimi manusia dan tidak melakukan kemaksiatan. (Inilah) balasan yang layak bagi orang yang takut dengan azab Allah dengan melakukan ketaatan dan meninggalkan kemunkaran."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Negeri akhirat itu Kami jadikan untuk orang-orang yang tidak menyombongkan diri} sombong {dan tidak berbuat kerusakan di bumi. Kesudahan itu bagi orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "83. Ketika Allah mengisahkan tentang Qarun dan harta kekayaan dunia yang dianugerahkan kepadanya, serta akhir kesudahan yang menimpanya, dan bahwa orang-orang yang beriman mengatakan, “Pahala Allah itu lebih baik bagi orang yang beriman dan beramal shalih, maka Allah mengajak untuk mencintai negeri akhirat dan Dia menginformasikam jalan yang bisa mengantarkan kepadanya, seraya berfirman, “Negeri akhirat itu,” yang diberitakan oleh Allah di dalam kitab-kitab suciNya dan dikabarkan oleh para rasulNya, yaitu negeri yang menghimpun seluruh kenikmatan, dan tersingkir darinya segala yang dapat mengotori dan menyempitkan, “Kami jadikan” sebagai negeri dan tempat tinggal “untuk orang-orang yang tidak ingin menyombongkan diri dan berbuat kerusakan di bumi.” Maksudnya, mereka sama sekali tidak mempunyai niat. Bagaimana mungkin akan berbuat kesombongan di muka bumi ini terhadap hamba-hamba Allah, takabur terhadap mereka dan terhadap kebenaran? “Dan tidak pula berbuat kerusakan,” ini mencakup seluruh kemaksiatan. Kalau mereka sudah tidak mempunyai niat (keinginan) untuk berbuat sombong di muka bumi ini dan tidak pula kerusakan, maka sudah pasti keinginan mereka terpusatkan kepada Allah, dan tujuan mereka adalah negeri akhirat, sikap mereka adalah merendahkan diri terhadap hamba-hamba Allah, tunduk kepada kebenaran dan beramal shalih. Mereka itulah orang-orang yang bertakwa, yaitu orang-orang yang memperoleh keberuntungan. Oleh karena itu, Dia berfirman, “Dan kesudahan (yang baik) itu.” Maksudnya, suasana keberuntungan dan kesuksesan yang pasti dan terus adalah bagi orang yang bertakwa kepada Allah. Sedangkan selain mereka, sekalipun mereka memperoleh sebagian dari keunggulan (duniawi) dan kelapangan, namun itu semua tidak akan lama waktunya dan akan musnah dalam waktu yang singkat. Dapat diketahui dari uraian dalam ayat di atas bahwa orang-orang yang menginginkan kesombongan di muka bumi atau kerusakan, mereka di akhirat tidak mempunyai bagian, dan mereka juga tidak mendapatkan bagian sedikit pun darinya."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 83: Ketahuilah wahai manusia bahwasanya negeri akhirat itu dan apa yang ada padanya dari kenikmatan surga akan Kami jadikan dan Kami khususkan bagi mereka yang tidak menginginkan kedudukan, kesombongan dan juga merasa tinggi kepada sesama orang-orang yang beriman, dan juga akan diberikan bagi mereka yang tidak berbuat kerusakan di muka bumi dengan kesyirikan dan kemaksiatan, semua itu adalah balasan yang terpuji dan keberhasilan dengan keimanan dan yang mengerjakan perintah-perintah-Nya dan meninggalkan kesyirikan pada-Nya serta jauh dari kemaksiatan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Setelah Allah Subhaanahu wa Ta'aala menyebutkan Karun dan kesenangan dunia yang diberikan kepadanya serta kesudahan yang diperolehnya, maka Allah Subhaanahu wa Ta'aala mendorong manusia agar mengutamakan akhirat (surga) serta menyebutkan sebab yang dapat menyampaikan ke sana. Yang dimaksud negeri akhirat di sini ialah kebahagiaan dan kenikmatan di akhirat. Mereka tidak memiliki keinginan agar berada di atas hamba-hamba Allah, bersikap sombong kepada mereka (dengan merendahkannya) dan kepada kebenaran (dengan menolaknya). Jika mereka tidak berkeinginan seperti itu, maka berarti keinginan mereka adalah tertuju kepada Allah dan kepada negeri akhirat, keadaan mereka tawadhu’ kepada hamba-hamba Allah, serta tunduk kepada kebenaran dan beramal saleh. Dengan melakukan maksiat. Maksudnya, keberuntungan dan keberhasilan di dunia dan di akhirat. Meskipun awalnya mereka mengalami berbagai penderitaan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 83",
    "description": "Begitulah akhir kisah karun yang binasa karena keangkuhannya. Kebahagiaan yang hakiki, yaitu di akhirat kelak, tidak akan diperoleh oleh orang seperti karun. Kenikmatan negeri akhirat itu kami jadikan bagi orang-orang yang tidak menyombongkan diri dengan kekuasaan yang dimilikinya dan tidak berbuat kerusakan di bumi dengan melakukan kemaksiatan dan kejahatan. Dan kesudahan yang baik itu, yaitu surga, hanya bagi orang-orang yang bertakwa, yaitu orang-orang yang kalbunya penuh dengan keimanan karena rasa takut kepada Allah, sehingga mereka melakukan apa yang diridai Allah. 84. Barangsiapa datang pada hari kiamat dengan membawa amal kebaikan yang penuh ketulusan dan sesuai tuntunan yang diajarkan oleh Allah dan rasul-Nya, maka dia akan mendapat pahala berlipat ganda, mulai dari sepuluh hingga tujuh ratus kali, bahkan tidak terbatas, yang lebih baik daripada kebaikannya itu; dan barang siapa datang dengan membawa amal kejahatan dalam bentuk kekufuran dan kemaksiatan, maka orang-orang yang telah mengerjakan kejahatan itu hanya diberi balasan seimbang dengan apa yang dahulu selalu mereka kerjakan."
  }
]