[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Barangsiapa yang datang pada Hari Kiamat dengan membawa tauhid yang murni kepada allah dan amal-amal shalih sesuai dengan ajaran yang disyariatkan Allah, maka baginya pahala yang besar yang lebih baik dari itu, yaitu surga dan kenikmatan yang abadi. Dan barangsiapa yang datang dengan membawa perbuatan-perbuatan buruk, maka orang-orang yang berbuat keburukan tidaklah diberi balasan atas perbuatan mereka kecuali sesuai dengan apa yang mereka perbuat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "84. Barangsiapa membawa kebaikan pada hari Kiamat -baik berupa salat, zakat, puasa dan lain-lain- maka baginya pahala yang lebih baik dari kebaikan tersebut karena pahala baginya dilipat gandakan hingga sepuluh kali lipat. Dan barangsiapa membawa keburukan pada hari Kiamat -baik berupa kekufuran, makan riba, zina dan lain-lain- maka orang-orang yang melakukan keburukan itu tidak diganjar kecuali seperti apa yang mereka lakukan tanpa ada tambahan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "84. Allah adalah pemilik hari pembalasan, Dia menentukan kedudukan makhluk-Nya pada hari itu sebagaimana yang Dia kehendaki sesuai dengan catatan amal setiap makhluk; barangsiapa yang mengerjakan sekecil apapun kebaikan maka Allah akan melipatgandakan balasan kebaikannya, dan barangsiapa yang mengerjakan sekecil apapun keburukan maka Allah akan membalasnya dengan balasan yang setimpal tanpa ada kezaliman karena yang memberi balasan adalah Maha Raja Yang Maha Adil."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "84. مَن جَآءَ بِالْحَسَنَةِ فَلَهُۥ خَيْرٌ مِّنْهَا ۖ (Barangsiapa yang datang dengan (membawa) kebaikan, maka baginya (pahala) yang lebih baik daripada kebaikannya itu) Yakni Allah akan membalasnya dengan balasan sepuluh kali lipat sampai tujuh ratus kali lipat. وَمَن جَآءَ بِالسَّيِّئَةِ فَلَا يُجْزَى الَّذِينَ عَمِلُوا۟ السَّيِّـَٔاتِ إِلَّا مَا كَانُوا۟ يَعْمَلُونَ(dan barangsiapa yang datang dengan (membawa) kejahatan, maka tidaklah diberi pembalasan kepada orang-orang yang telah mengerjakan kejahatan itu, melainkan (seimbang) dengan apa yang dahulu mereka kerjakan) Yakni melainkan sesuai dengan apa yang mereka kerjakan tanpa pengurangan atau penambahan. Dan bisa jadi Allah akan mengampuni mereka dengan rahmat dan karunia-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "84. Barangsiapa datang pada hari kiamat dengan membawa perbuatan baik, yaitu iman dan amal shalih, maka baginya itu pahala yang lebih baik dari amalnya dengan diberi 10 amal baik serupa yang digandakan sebanyak 70 kali lipat. Dan Barangsiapa datang dengan membawa perbuatan munkar yang buruk yaitu kekufuran dan kemaksiatan, maka tidak ada balasan bagi orang yang mengerjakan keburukan kecuali balasan yang serupa dengan perbuatannya di dunia tanpa dilipat gandakan atau ditambahi"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Siapa saja yang datang dengan kebaikan, maka baginya yang lebih baik daripada kebaikannya itu. Siapa saja yang datang dengan kejahatan, maka orang-orang yang telah mengerjakan kejahatan itu tidak dibalas melainkan dengan apa yang selalu mereka kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "84. Allah mengabarkan tentang pelipatgandaan karuniaNya dan kesempurnaan keadilanNya, seraya berfirman, “Barangsiapa yang datang dengan (membawa) kebaikan,” Dia mempersyaratkan di dalam kebaikan itu harus dibawa oleh si pelaku. Sebab bisa jadi dia melakukannya akan tetapi dibarengi dengan sesuatu yang tidak bisa diterima, atau sesuatu yang dapat membatalkannya. Orang yang seperti ini tidak disebut datang dengan membawa kebaikan. kebaikan adalah kata jenis (bermakna umum) mencakup seluruh apa yang diperintahkan Allah dan RasulNya, berupa perkataan dan perbuatan yang lahir dan yang batin, yang berhubungan dengan hak Allah dan hak-hak manusia. “maka dia mendapatkan (pahala) yang lebih baik daripada kebaikannya itu,” maksudnya, yang lebih besar dan lebih banyak. Di dalam ayat lain disebutkan, \"maka baginya 10 kali lipat\" (Al-An’Am: 160). Pelipatgandaan kebaikan ini adalah suatu keharusan. Dan kadang-kadang ia dibarengi dengan sebab-sebab yang bisa menambah pelipatgandaan pahalanya, seperti yang difirmankan Allah, \"dan Allah melipatgandakan bagi orang yang Dia kehendaki, dan Allah Dzat yang Maha Luas rahmat-Nya dan Maha mengetahui\" (Al-Baqarah:261), tergantung kepada keadaan pelaku, amal, manfaat, kedudukan dan tempatnya. “Dan barangsiapa yang datang dengan (membawa) kejahatan,” yaitu segala hal yang dilarang oleh pembuat syariat dengan larangan yang bermakna pengharaman, “maka orang-orang yang telah mengerjakan kejahatan itu tidaklah diberi pembalasan, melainkan (seimbang) dengan apa yang dahulu mereka kerjakan.” Sebagaimana Firman Allah, \"Barang siapa membawa amal yang baik maka baginya (pahala) sepuluh kali lipat amalnya; dan barang siapa yang membawa perbuatan yang jahat maka dia tidak diberi pembalasan melainkan seimbang dengan kejahatannya, sedang mereka sedikit pun tidak dianiaya (dirugikan).\" (Al-An’Am:160)."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 84: Kemudian Allah berkata : Barangsiapa yang beramal dengan kebaikan saja, sungguh Allah akan mencukupi segala amalannya, Allah akan gandakan pahalanya menjadi 700 ganjaran kepada ganjaran-ganjaran yang utaman dan Allah muliakan dirinya. Dan barangsiapa yang beramal dengan keburukan dengan melakukan apa yang Allah larang, Allah tidak akan membalas kecuali dengan semisal yang ia amalkan dari keburukan dan tidak Allah gandakan balasannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Allah Subhaanahu wa Ta'aala memberitahukan tentang berlipatgandanya karunia-Nya dan sempurnanya keadilan-Nya. Kebaikan di sini mencakup semua yang diperintahkan Allah dan Rasul-Nya, berupa ucapan, amal yang tampak maupun tesembunyi (seperti amal hati), baik yang terkait dengan hak Allah maupun hak hamba-hamba-Nya. Yaitu mendapatkan sepuluh kebaikan dan bisa lebih dari itu tergantung niat, kondisi orang yang beramal, amal yang dikerjakannya, manfaatnya, sasarannya, dsb. Mencakup semua yang dilarang Alah dan Rasul-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 84",
    "description": "Barangsiapa datang pada hari kiamat dengan membawa amal kebaikan yang penuh ketulusan dan sesuai tuntunan yang diajarkan oleh Allah dan rasul-Nya, maka dia akan mendapat pahala berlipat ganda, mulai dari sepuluh hingga tujuh ratus kali, bahkan tidak terbatas, yang lebih baik daripada kebaikannya itu; dan barang siapa datang dengan membawa amal kejahatan dalam bentuk kekufuran dan kemaksiatan, maka orang-orang yang telah mengerjakan kejahatan itu hanya diberi balasan seimbang dengan apa yang dahulu selalu mereka kerjakan. 85. Setelah diuraikan tentang negeri akhirat yang merupakan negeri tempat kembali semua makhluk, di sini ditekankan kembali bahwa semua akan menuju ke sana dan menerima balasan dan ganjaran, termasuk nabi Muhammad. Sesungguhnya Allah yang menurunkan Al-Qur'an dan mewajibkan engkau wahai nabi Muhammad untuk menyampaikan pesan-pesan Al-Qur'an dan berpegang teguh kepadanya, benar-benar akan mengembalikanmu ke tempat kembali, yaitu kota mekah, atau akhirat kelak. Inilah suatu janji dari tuhan bahwa nabi Muhammad akan kembali ke mekah sebagai orang yang menang, dan ini sudah terjadi pada tahun kedelapan hijriah, pada waktu nabi menaklukkan mekah. Ini merupakan suatu mukjizat bagi nabi Muhammad. Katakanlah wahai nabi Muhammad, kepada orang-orang musyrik, 'tuhanku mengetahui dengan ilmu yang tiada bandingannya tentang orang yang datang membawa petunjuk dan orang yang berada dalam kese-satan yang nyata yang diketahui oleh setiap orang berakal yang memiliki pengetahuan yang benar. '."
  }
]