[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesunggguhnya Dzat yang menurunkan al-Qur’an kepadamu (wahai Rasul) dan mewajibkan atas kamu untuk menyampaikannya dan berpegang teguh dengannya, Dia benar-benar akan mengembalikanmu ke tempat yang kamu keluar darinya, yaitu Makkah. Katakanlah wahai Rasul kepada kaum musyrikin, “Tuhanku lebih mengetahui orang yang datang membawa hidayah dan orang yang berada dalam kejauhan yang nyata dari kebenaran.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "85. Sesungguhnya yang menurunkan Al-Qur`ān kepadamu dan mewajibkanmu untuk menyampaikannya serta mengamalkan isinya benar-benar akan mengembalikanmu ke kota Makkah dengan kemenangan. Katakan -wahai Rasul- kepada orang-orang musyrik, “Rabbku lebih mengetahui siapa yang membawa petunjuk dan siapa yang berada dalam kesesatan yang nyata dari petunjuk dan kebenaran.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "85. Hai Rasulullah, Allah-lah yang menurunkan al-Qur’an kepadamu dan mewajibkanmu untuk menyampaikannya serta memerintahkanmu untuk berpegang teguh kepadanya. Allah pasti akan mengembalikanmu ke tempat tinggal pertamamu, yaitu di Makkah setelah kamu pergi meninggalkannya. Hai Rasulullah, katakanlah kepada orang-orang musyrik dari kaummu yang berpaling dari seruan kebenaran: “Tuhanku mengetahui siapa yang mengikuti kebenaran dan petunjuk, dan lurus jalannya; dan siapa yang berada dalam kesesatan yang jelas dari jalan yang benar.” Dan akan jelas saat kamu telah kembali ke tempat tinggalmu bahwa Allah telah menolongmu dan menghinakan musuh-musuhmu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "85. إِنَّ الَّذِى فَرَضَ عَلَيْكَ الْقُرْءَانَ (Sesungguhnya yang mewajibkan atasmu (melaksanakan hukum-hukum) Al Quran) Yakni Allah menurunkan kepadamu al-Qur’an dan memerintahkanmu untuk mengamalkan hukum-hukum yang terdapat di dalamnya. لَرَآدُّكَ إِلَىٰ مَعَادٍ ۚ( benar-benar akan mengembalikan kamu ke tempat kembali) Yakni kamu akan dikembalikan ke kota Makkah dengan menakhlukkannya dan memenangkannya. Allah memenuhi janji-Nya kepada nabi Muhammad yang Dia tekankan atas diri-Nya ini, sehingga Nabi Muhammad dapat menakhlukkan Makkah setelah delapan tahun sejak ia keluar dari Makkah; Allah telah memuliakannya dan memenangkan tentara-Nya serta menolong agama Islam. Imam Mujahid berpendapat yang dimaksud dengan ayat ini adalah Allah akan mengembalikanmu di hari kiamat, sebab seluruh manusia ketika itu akan kembali hidup. قُل رَّبِّىٓ أَعْلَمُ مَن جَآءَ بِالْهُدَىٰ وَمَنْ هُوَ فِى ضَلٰلٍ مُّبِينٍ(Katakanlah: “Tuhanku mengetahui orang yang membawa petunjuk dan orang yang dalam kesesatan yang nyata”) Ini merupakan jawaban bagi orang-orang kafir Makkah setelah mereka mengatakan kepada Rasulullah: “sungguh kamu berada dalam kesesatan.” Dan yang dimaksud dengan orang yang membawa petunjuk adalah Rasulullah dan orang yang berada dalam kesesatan adalah orang-orang musyrik."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "85. Sesungguhnya Dzat yang menurunkan Al-Qur’an untukmu dan mewajibkanmu untuk mengerjakan hukum-hukumnya itu akan mengembalikanmu ke negerimu, Mekah (Ini adalah isyarat untuk berhijrah dari Mekah, kemudian dikembalikan lagi kepadanya sebagai seorang pemenang. Ayat ini juga untuk mengenalkan bahwa surah itu adalah surah Makkiyah). Wahai Rasulallah, katakanlah kepada orang-orang musyrik itu: “Tuhanku lebih tahu daripada aku dan kalian tentang orang yang datang dengan membawa petunjuk (yaitu Nabi SAW) dan orang yang berada dalam kesesatan yang nyata (yaitu mereka yang musyrik)”. Adh-Dhahhak berkata: “Saat Nabi SAW keluar dari Mekah dan sampai di daerah Juhfah, beliau merindukan Mekah. Lalu Allah menurunkan ayat {Innalladzi faradha…}”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya Dzat yang mewajibkan} yang menurunkan {kepadamu Al-Qur’an benar-benar akan mengembalikanmu ke tempat kembali} benar-benar akan mengembalikanmu ke Mekkah sebagaimana kamu keluar dari sana {Katakanlah,“Tuhanku lebih mengetahui siapa yang membawa petunjuk dan siapa yang berada dalam kesesatan yang nyata”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "85. Allah berfirman, “Sesungguhnya yang mewajibkan atasmu al-Quran,” maksudnya, Dzat yang menurunkannya dan mewajibkan hukum-hukum yang ada di dalamnya, yang menjelaskan halal dan haram, dan yang memerintahmu menyampaikannya kepada seluruh manusia dan menyerukan hukum-hukumnya kepada seluruh orang-orang mukallaf, sangatlah tidak selaras dengan hikmahNya kalau kehidupan ini hanyalah kehidupan dunia ini saja tanpa ada pemberian pahala kepada manusia dan tanpa pemberian sanksi. Akan tetapi Dia harus mengembalikanmu kepada tempat kembali dimana orang-orang yang berbuat buruk (akan diberi balasan) sesuai dengan kemaksiatan mereka. Sesungguhnya kamu telah menjelaskan petunjuk (pedoman hidup) kepada mereka, dan kamu telah menerangkan jalan yang benar kepada mereka. Jika kalau mereka mengikutimu, maka itulah bagian dan kebahagiaan mereka. Dan kalau mereka enggan, melainkan (berbuat) durhaka terhadapmu dan melecehkan petunjuk yang kamu ajarkan serta lebih mengutamakan kebatilan yang ada pada mereka atas kebenaran, maka tidak ada lagi tempat untuk perdebatan, dan tidak ada lagi yang tersisa kecuali pemberian pembalasan atas amal perbuatan dari Allah yang mengetahui yang ghaib dan yang nyata, yang mewujudkan dan yang meniadakan. Oleh karena itu, Allah berfirman, “Rabbku mengetahui orang yang membawa petunjuk dan orang yang dalam kesesatan yang nyata.” Dan sudah diketahui bahwa RasulNya adalah yang berada di atas petunjuk lagi membimbing kepada petunjuk, sedangkan para lawannya adalah orang-orang yang sesat lagi menyesatkan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 85: Ketahuilah wahai Nabi Allah bahwasanya yang menurunkan kepadamu Al Qur’an dan mewajibkan kepadamu untuk menyampaikan serta berpegang teguh dengannya sebagai peribadatanmu di Mekkah setelah engkau hijrah darinya, maka katakanlah kepada mereka (wahai Nabi) kepada orang-orang musyrik : Sungguh Tuhanku sajalah yang mengetahui orang-orang yang diberi petunjuk dan siapa yang ia tersesat dengan kesesatan yang nyata, akan datang setiap dari kita balasan. Maka jika amalan tersebut baik, akan mendapatkan kebaikan, dan jika buruk akan mendapatkan keburukan."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni Allah Subhaanahu wa Ta'aala yang menurunkan Al Qur’an, mewajibkan hukum-hukumnya (untuk diamalkan), menerangkan yang halal dan yang haram dan memerintahkan Beliau untuk menyampaikan Al Qur’an kepada manusia. Yang dimaksud dengan tempat kembali di sini ialah kota Mekah, di mana Beliau rindu pergi kepadanya. Ini adalah suatu janji dari Allah bahwa Nabi Muhammad shallallahu 'alaihi wa sallam akan kembali ke Mekah sebagai orang yang menang, dan ini sudah terjadi pada tahun kedelapan hijrah saat Nabi shallallahu 'alaihi wa sallam menaklukkan Mekah. Ini merupakan suatu mukjizat bagi Nabi. Bisa juga maksudnya, bahwa Allah Subhaanahu wa Ta'aala akan mengembalikan Beliau dan selain Beliau ke akhirat, yang di sana amal mereka diberikan balasan. Ayat ini turun sebagai jawaban terhadap perkataan kaum kafir Mekah, bahwa Beliau berada dalam kesesatan. Sudah maklum, bahwa Rasulullah shallallahu 'alaihi wa sallam Beliaulah yang mendapatkan petunjuk lagi memberi petunjuk, sedangkan musuh-musuh Beliau jelas sebagai orang-orang yang sesat lagi menyesatkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 85",
    "description": "Setelah diuraikan tentang negeri akhirat yang merupakan negeri tempat kembali semua makhluk, di sini ditekankan kembali bahwa semua akan menuju ke sana dan menerima balasan dan ganjaran, termasuk nabi Muhammad. Sesungguhnya Allah yang menurunkan Al-Qur'an dan mewajibkan engkau wahai nabi Muhammad untuk menyampaikan pesan-pesan Al-Qur'an dan berpegang teguh kepadanya, benar-benar akan mengembalikanmu ke tempat kembali, yaitu kota mekah, atau akhirat kelak. Inilah suatu janji dari tuhan bahwa nabi Muhammad akan kembali ke mekah sebagai orang yang menang, dan ini sudah terjadi pada tahun kedelapan hijriah, pada waktu nabi menaklukkan mekah. Ini merupakan suatu mukjizat bagi nabi Muhammad. Katakanlah wahai nabi Muhammad, kepada orang-orang musyrik, 'tuhanku mengetahui dengan ilmu yang tiada bandingannya tentang orang yang datang membawa petunjuk dan orang yang berada dalam kese-satan yang nyata yang diketahui oleh setiap orang berakal yang memiliki pengetahuan yang benar. '86. Dan engkau wahai nabi Muhammad tidak pernah, yakni pada masa sebelum turunnya wahyu pertama, menduga dan mengharap agar kitab Al-Qur'an itu diturunkan kepadamu, tetapi ternyata ia diturunkan oleh Allah kepadamu. Hal ini adalah sebagai rahmat yang sangat besar dari tuhanmu, bagi dirimu dan seluruh makhluk di alam raya ini, sebab itu ingatlah nikmat tersebut, dan tetaplah menyampaikannya. Janganlah sekali-kali engkau menjadi penolong bagi orang-orang kafir, ."
  }
]