[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kamu (wahai Rasul) tidaklah pernah mengharapkan turunnya al-Qur’an kepadamu. Akan tetapi, Allah mencurahkan rahmatNya kepadamu, lalu menurunkannya kepadaMu, maka bersukurlah kepada Allah atas nikmat-nikmatNya. Dan janganlah kamu sekali-kali menjadi penolong bagi orang-orang yang berbuat kesyirikan dan kesesatan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "86. Sebelum diangkat menjadi Rasul, engkau -wahai Rasul- tidak berangan-angan untuk mendapatkan Al-Qur`ān sebagai wahyu dari Allah, akan tetapi rahmat Allah -Subḥānahu- mengharuskan diturunkannya Al-Qur`ān kepadamu, maka janganlah sekali-kali engkau menjadi penolong bagi orang-orang kafir dalam kesesatan yang mereka lakukan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "86. Hai Rasulullah, kamu tidak pernah menunggu-nunggu agar Allah mengutusmu kepada para hamba dan agar Kami menurunkan kitab kepadamu; sebab itu semua adalah rahmat dari Tuhanmu. Dan Allah memilihmu untuk memikul beban risalah merupakan bukti bahwa Allah tidak akan meninggalkanmu; dan Allah telah menyiapkan bagimu kemenangan besar. Hai Rasulullah, janji dari Tuhanmu ini menjadikanmu menjauhi berbasa-basi dengan orang-orang kafir dan membantu mereka dalam kesesatan. Ini juga merupakan peringatan bagi orang-orang beriman agar tidak condong kepada orang-orang kafir."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "86. وَمَا كُنتَ تَرْجُوٓا۟ أَن يُلْقَىٰٓ إِلَيْكَ الْكِتٰبُ (Dan kamu tidak pernah mengharap agar Al Quran diturunkan kepadamu) Yakni sebelum diistimewakan Allah dengan kenabian dan risalah, kamu belum pernah mengharap Kami akan mengutusmu kepada para hamba dan menurunkan kepadamu al-Qur’an. إِلَّا رَحْمَةً مِّن رَّبِّكَ ۖ( tetapi ia (diturunkan) karena suatu rahmat yang besar dari Tuhanmu) Yakni akan tetapi turunnya al-Qur’an kepadamu merupakan rahmat dari Tuhanmu karena keutamaan-Nya, bukan karena usahamu atau hakmu. فَلَا تَكُونَنَّ ظَهِيرًا لِّلْكٰفِرِينَ(sebab itu janganlah sekali-kali kamu menjadi penolong bagi orang-orang kafir) Yakni janganlah kamu menjadi penolong mereka dengan berbasa-basi dengan mereka dan menjadikan mereka teman dekat dan mengorbankan dakwah yang harus kamu sampaikan dan terangkan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "86. Sebelum menjadi nabi, kamu tidak pernah berangan-angan bahwa Al-Qur’an akan diwahyukan kepadamu, Wahai Rasul. Akan tetapi Al-Qur'an ini diwahyukan kepadamu sebagai bentuk rahmat dari Tuhanmu, yaitu bentuk kasih sayang kepadamu. Maka jangan sekali-kali kamu menjadi penolong orang-orang kafir terkait agama yang mereka serukan kepadamu dengan mengikuti mereka dan menanggapi permintaan mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kamu tidak mengharap} mengharap {agar kitab itu} Al-Qur’an itu {diturunkan} diturunkan {kepadamu melainkan sebagai rahmat dari Tuhanmu. Maka janganlah sekali-kali menjadi penolong} penolong {bagi orang-orang kafir"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "86. “Dan kamu tidak pernah mengharap agar al-Quran diturunkan kepadamu.” Maksudnya, kamu tidak pula menghadapinya, “tetapi ia diturunkan karena suatu rahmat yang besar dari Rabbmu,” kepadamu dan kepada umat manusia. Lalu Dia mengutusmu dengan Kitab al-Quran yang dengannya Dia merahmati semesta alam; dan Dia mengajarkan kepada mereka segala sesuatu yang belum mereka ketahui; Dia menyucikan mereka dan mengajarkan kepada mereka al-Quran dan hikmah, walaupun sebelumnya mereka benar-benar berada di dalam “kesesatan yang nyata.” Kalau kamu sudah mengetahui bahwa Dia menurunkan al-Quran kepadamu sebagai rahmat dariNya, maka kamu mengetahui bahwa seluruh apa yang diperintahkanNya dan yang dilarangNya merupakan rahmat dan karunia dari Allah. Maka sebab itu jangan sekali-kali di dalam dadamu ada rasa keberatan terhadapnya, dan kamu mengira bahwa orang yang menyelisihinya itu lebih baik dan lebih bermanfaat. “Sebab itu janganlah kamu sekali-kali menjadi penolong bagi orang-orang kafir.” Maksudnya, menjadi penolong mereka atas kekafiran yang mereka anut. Di antara tindakan menolong mereka adalah ungkapan terhadap sebagian darinya, “Sesungguhnya Al-Quran itu berlawanan dengan hikmah, maslahat dan manfaatnya.”"
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 86: Janganlah engkau wahai Nabi Allah tergesa-gesa dan berharap untuk segera turun Al Qur’an ini, akan tetapi karena sebab kasih sayang Tuhanmu lah engkau akan mengetahui, engkau akan mendapatkan karunia dari Allah yang meliputi engkau; Maka Allah turunkan kepadamu Al Qur’an ini , maka janganlah engkau meminta pertolongan kepada orang-orang kafir yang menolak segala hal."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Maksudnya, Al Quranul karim itu diturunkan bukanlah karena Nabi Muhammad shallallahu 'alaihi wa sallam mengharap agar diturunkan, melainkan karena rahmat dari Allah untuk Beliau dan untuk selain Beliau. Dia mengutus Beliau dengan membawa kitab Al Qur’an ini, yang dengannya alam semesta mendapat rahmat, dengan turunnya Al Qur’am diajarkan kepada mereka sesuatu yang sebelumnya mereka tidak ketahui, dengannya diri mereka disucikan diberi bimbingan, di mana sebelumnya mereka dalam kesesatan yang nyata. Jika kita mengetahui, bahwa diturunkan-Nya Al Qur’an adalah karena rahmat-Nya, maka dapat kita ketahui bahwa semua yang diperintahkan dan semua yang dilarang merupakan rahmat dan karunia-Nya. Oleh karena itu, jangan sampai ada dalam hati kita rasa sempit terhadapnya dan mengira bahwa orang yang menyelisihinya lebih baik dan lebih bermanfaat. Terhadap agama mereka dan terhadap kekafiran mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 86",
    "description": "Dan engkau wahai nabi Muhammad tidak pernah, yakni pada masa sebelum turunnya wahyu pertama, menduga dan mengharap agar kitab Al-Qur'an itu diturunkan kepadamu, tetapi ternyata ia diturunkan oleh Allah kepadamu. Hal ini adalah sebagai rahmat yang sangat besar dari tuhanmu, bagi dirimu dan seluruh makhluk di alam raya ini, sebab itu ingatlah nikmat tersebut, dan tetaplah menyampaikannya. Janganlah sekali-kali engkau menjadi penolong bagi orang-orang kafir, 87. Dan jangan sampai mereka menghalang-halangi engkau wahai nabi Muhammad untuk menyampaikan ayat-ayat Allah, setelah ayat-ayat itu diturunkan oleh Allah kepadamu, dan serulah manusia dengan sekuat kemampuanmu melalui dakwah yang santun dan bijak kepada agama Allah agar mereka beriman kepada tuhanmu, jangan bosan berdakwah kendati mereka enggan mendengar atau menghalang-halangi, dan sekali-kali dalam keadaan apa pun janganlah engkau diam tidak menegur kedurhakaan yang mengandung kemusyrikan, apalagi merestuinya, karena jika demikian engkau termasuk orang-orang musyrik yang mempersekutukan tuhan."
  }
]