[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kaum musyrikin menjadi penghambat bagimu untuk menyebarkan ayat-ayat Tuhanmu dan hujjah-hujjahNya, setelah Kami menurunkannya kepadamu. Dan sampaikanlah risalah dari Tuhanmu dan janganlah kamu termasuk orang-orang yang menyekutukan Allah dalam aspek apa pun."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "87. Dan jangan sampai orang-orang musyrik itu menghalangimu dari ayat-ayat Allah setelah diturunkannya kepadamu sehingga engkau tidak membacanya dan menyampaikannya, dan serulah manusia menuju keimanan kepada Allah dan tauhid-Nya serta menjalankan syariat-Nya, dan janganlah sekali-kali kamu menjadi bagian dari orang-orang musyrik yang menyembah selain Allah disamping menyembah-Nya, akan tetapi jadilah bagian dari orang-orang bertauhid yang tidak menyembah selain Allah semata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "87. Hai Rasulullah, Janganlah gangguan dan tipu daya orang-orang kafir menghentikanmu dari menyampaikan risalah, membaca ayat-ayat al-Qur’an, dan mengamalkannya setalah Allah menurunkannya kepadamu. Dan serulah manusia menuju Allah dan keesaan-Nya, menjalankan kewajiban-kewajiban-Nya, dan menjauhi larangan-larangan-Nya. dan janganlah sekali-kali mendekati kesyirikan. Jika Rasulullah diperintahkan dengan perkara-perkara ini, maka orang-orang beriman lebih utama untuk menjalankan perintah ini."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "87. وَلَا يَصُدُّنَّكَ عَنْ ءَايٰتِ اللهِ بَعْدَ إِذْ أُنزِلَتْ إِلَيْكَ ۖ (Dan janganlah sekali-kali mereka dapat menghalangimu dari (menyampaikan) ayat-ayat Allah, sesudah ayat-ayat itu diturunkan kepadamu) Yakni Hai Muhammad, janganlah sekali-kali orang-orang kafir dan perkataan, kedustaan, dan gangguan mereka itu menghalangimu untuk membacakan ayat-ayat Allah dan mengamalkannya setelah itu diwajibkan atasmu. وَادْعُ إِلَىٰ رَبِّكَ ۖ (dan serulah mereka kepada (jalan) Tuhanmu) Yakni ajaklah manusia menuju Allah dan untuk mengesakan-Nya serta mengamalkan kewajiban-kewajiban terhadap-Nya dan menjauhi kemaksiatan kepada-Nya. dan janganlah sekali-sekali kamu termasuk orang-orang yang mempersekutukan-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "87. Dan sungguh mereka tidak dapat menghalangimu untuk membaca, mengamalkan dan menyampaikan ayat-ayat Allah dengan cemoohan mereka sesudah Allah menurunkan ayat-ayat itu kepadamu dan mewajibkanmu (mengamalkannya). Serulah manusia untuk mengesakan Tuhanmu, menyembahNya dan mengamalkan syariatNya. Dan jangan sekali-kali kamu termasuk orang-orang yang menyekutukan Allah dengan membantu mereka. Sesungguhnya jika kamu menghormati mereka dalam suatu hal, maka kamu termasuk golongan mereka. Dalam hal itu ada saran kepada selainnya. Hal serupa juga ada di ayat selanjutnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah sekali-kali menghalangimu} menghalangimu {untuk (menyampaikan) ayat-ayat Allah setelah ayat-ayat itu diturunkan kepadamu. Serulah (manusia) menuju Tuhanmu dan janganlah sekali-kali termasuk dalam golongan orang-orang musyrik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "87. “Dan janganlah sekali-kali mereka dapat menghalangimu dari ayat-ayat Allah, sesudah ayat-ayat itu diturunkan kepadamu,” akan tetapi sampaikanlah dan laksanakanlah, dan janganlah kamu mempedulikan makar mereka dan jangan sekali-kali hal itu menipumu darimu, dan jangan kamu ikuti kemauan mereka, “dan seluruh mereka kepada Rabbmu,” maksudnya, jadikanlah dakwah kepada Tuhanmu sebagai puncak tujuanmu dan sebagai visi amalmu. Segala sesuatu yang menyelisihi itu, seperti riya’, sum’ah atau menyetujui kehendak ahli batil, maka tolaklah. Karena sesungguhnya hal itu bisa menyebabkan ikut serta bersama mereka dan membantu mereka atas kehendak yang mereka suka. Maka dari itu, Allah berfirman, “Dan janganlah sekali-kali kamu termasuk orang-orang yang mempersekutukan Rabb,” baik dalam kesyirikan mereka ataupun dalam sendi-sendi dan cabang-cabangnya, yang merupakan pengumpul semua kemaksiatan."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 87: Orang-orang kafir tidak akan mengusirmu wahai Nabi Allah (yaitu ketika engkau membacakan) ayat-ayat Allah setelah Allah turunkan kepadamu, dan engkau akan tersibukkan membacanya dan menyampaikannya serta beramal dengannya, serulah wahai Nabi Allah manusia kepada jalan tauhid dan iman, dan meninggalkan kesyrikn dan kekufuran, dan janganlah engkau termasuk orang-orang yang musyrik. Ini adalah ayat sebagai perintah Allah kepada Nabi ﷺ, begitu juga perintah kepada ulama dan dai setelah Nabi ﷺ, sebab ungkapan itu ditinjau dari keumuman lafadz."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Bahkan sampaikanlah dan jangan pedulikan makar mereka serta jangan mengikuti hawa nafsu mereka. Agar mentauhidkan-Nya dan beribadah kepada-Nya. Bisa juga maksudnya, jadikanlah dakwahmu kepada Allah karena-Nya menjadi pusat perhatianmu, semua yang menyalahinya maka tolaklah, seperti karena riya, sum’ah, dan mengikuti hawa nafsu orang-orang yang berada di atas kebatilan, karena yang demikian menjadikan engkau bersama mereka dan membantu perkara mereka."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 87",
    "description": "Dan jangan sampai mereka menghalang-halangi engkau wahai nabi Muhammad untuk menyampaikan ayat-ayat Allah, setelah ayat-ayat itu diturunkan oleh Allah kepadamu, dan serulah manusia dengan sekuat kemampuanmu melalui dakwah yang santun dan bijak kepada agama Allah agar mereka beriman kepada tuhanmu, jangan bosan berdakwah kendati mereka enggan mendengar atau menghalang-halangi, dan sekali-kali dalam keadaan apa pun janganlah engkau diam tidak menegur kedurhakaan yang mengandung kemusyrikan, apalagi merestuinya, karena jika demikian engkau termasuk orang-orang musyrik yang mempersekutukan tuhan. 88. Dan jangan pula engkau sembah tuhan yang lain selain Allah. Tidak ada tuhan pengendali dan penguasa seluruh alam yang berhak disembah selain dia yang maha esa lagi mahakekal itu. Segala sesuatu pasti binasa dan fana, kecuali Allah. Segala keputusan di dunia dan akhirat menjadi wewenang-Nya, dan hanya kepada-Nya kamu dan seluruh makhluk dikembalikan."
  }
]