[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan janganlah kamu menyembah tuhan lain bersama Allah. sebab tidak ada yang berhak diibadahi selain Allah. Segala sesuatu itu akan hancur dan lenyap kaecuali wajahNya. BagiNya segala penentuan hokum dan kepadaNya kalian akan kembali setelah kematian kalian untuk menghadapi perhitungan amal dan balasannya. Dalam ayat ini terkandung penetapan sifat “wajah” bagi Allah sesuai dengan kesempurnaan dan kebesaran keagunganNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "88. Dan janganlah engkau menyembah tuhan lain disamping menyembah Allah, tidak ada yang berhak disembah selain-Nya. Segala sesuatu akan binasa kecuali wajah-Nya Yang Mahasuci. Hanya milik-Nya lah hukum, dengannya Dia menghukumi sekehendak-Nya dan hanya kepada-Nya sajalah kalian akan dikembalikan pada hari Kiamat untuk mendapatkan perhitungan dan pembalasan."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "88. Hai Rasulullah, Tidak ada Tuhan yang berhak disembah selain Allah, maka tidak boleh bagimu dan orang selainmu untuk menjadikan sesembahan selain Allah. Allah telah menetapkan kehancuran bagi seluruh makhluk, termasuk segala yang disembah selain Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "88. وَلَا تَدْعُ مَعَ اللهِ إِلٰهًا ءَاخَرَ ۘ لَآ إِلٰهَ إِلَّا هُوَ ۚ( Janganlah kamu sembah di samping (menyembah) Allah, tuhan apapun yang lain. Tidak ada Tuhan (yang berhak disembah) melainkan Dia) Sebab Dia-lah Tuhan yang Esa yang berkuasa atas segala sesuatu; sedangkan selain-Nya tidak akan mampu memberimu mudharat atau manfaat. كُلُّ شَىْءٍ(Tiap-tiap sesuatu) Apapun itu. هَالِكٌ إِلَّا وَجْهَهُۥ ۚ( pasti binasa, kecuali Allah) Yakni kecuali Dzat-Nya. لَهُ الْحُكْمُ(Bagi-Nya-lah segala penentuan) Yakni ketetapan yang pasti terjadi. Allah menentukan apa yang Dia kehendaki dan Menetapkan apa yang Dia inginkan. وَإِلَيْهِ تُرْجَعُونَ(dan hanya kepada-Nya-lah kamu dikembalikan) Ketika kalian dibangkitkan, untuk membalas kebaikan orang yang berbuat baik dan keburukan orang yang berbuat buruk. Dan kalian tidak akan dikembalikan kepada selain Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "88. Dan janganlah kamu menyembah Allah bersama Tuhan lainnya. Tiada Tuhan yang haq disembah kecuali hanya Allah, Tiada sekutu bagiNya. Setiap sesuatu yang ada di alam ini pasti rusak kecuali Dzat Allah SWT. Dialah Dzat Yang Maha Abadi lagi Maha Kekal. Miliknya itu ketentuan dan aturan. Dan hanya kepadaNyalah kalian dikembalikan saat hari kebangkitan dengan dibangunkan dari kubur kalian lalu membalas kalian sesuai perbuatan kalian."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Janganlah menyembah} menyembah {Tuhan yang lain bersama Allah. Tidak ada tuhan selain Dia. Segala sesuatu pasti binasa, kecuali DzatNya. BagiNyalah segala putusan dan hanya kepadaNya kalian dikembalikan}"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "88. “Janganlah kamu sembah di samping (menyembah) Allah, tuhan-tuhan yang lain,” akan tetapi tuluskanlah ibadahmu hanya kepada Allah, karena sesungguhnya “tidak ada tuhan (yang berhak disembah) kecuali Dia,” jadi, tidak ada seorang pun yang berhak dipertuhankan, dicintai dan disembah kecuali Allah, yang Maha sempurna lagi Mahakekal, yang “tiap-tiap sesuatu pasti binasa, kecuali Allah.” Kalau segala sesuatu itu binasa lagi sirna kecuali Dia, maka beribadah kepada yang binasa lagi palsu itu batil (kepalsuan) karena kebatilan tujuan dan kerusakan akhir kesudahannya. “BagiNYa-lah segala penentuan,” di dunia dan akhirat, “daan hanya kepadaNya-lah” bukan kepada selain Dia “kamu dikembalikan.” Apabila sesuatu selain Allah itu batil (palsu) lagi binasa, sedangkan Allah Dia-lah yang Mahakekal yang tiada sembahan yang haq kecuali Dia, dan kepunyaanNya keputusan di dunia dan akhirat, dan kepadaNya tempat kembali seluruh makhluk untuk diberikan pembalasan atasal perbuatan mereka, maka menjadi pasti atas orang yang mempunyai akal sehat untuk beribadah hanya kepada Allah semata, tiada sekutu bagiNya, dan beramal melakukan apa saja yang dapat menjadikannya dekat kepadaNya dan mewaspadai murka dan siksaNya, serta khawatir menghadap kepadaNya dengan tidak bertaubat atau tidak berhenti dari kesalahan dan dosa-dosa."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 88: Bersihkan wahai Nabi Allah ibadahmu kepada Allah dengan tauhid, dan janganlah engkau menyeru tuhan-tuhan yang lain bersamaan dengan Allah; Karena tidak ada sesembahan yang benar kecuali hanyalah Allah, segala sesuatu binasa kecuali wajah Allah, Dialah pemilik takdir yang adil di dunia dan akhirat, kepada-Nya lah tempat kembali segala makhluk seluruhnya, akan Allah ganjar segala amalan makhluk. Jika baik, maka ganjarannya baik, jika buruk ganjarannya buruk. Firman-Nya وجهه pendapat yang pertama adalah dzat-Nya, yaitu segala sesuatu fana dan tersisa dzat-Nya yang kekal lagi suci, Allah mutlakkan wajah sebagai dzat Allah. Pendapat yang kedua adalah kekalnya amal shalih yang ketika (manusia) beramal dengan niat mencari wajah-Nya, pendapat ini dipilih oleh Syaikhul Islam Ibnu Taimiyyah, ia berkata : Berkata segolongan dari salaf bahwa setiap amalan akan musnah kecuali apa yang ia niatkan untuk mencari wajah Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Yakni segala sesuatu akan binasa kecuali Allah Ta’ala, wajah-Nya tetap kekal, dan jika wajah-Nya kekal, maka berarti Zat-Nya juga kekal. Apabila segala sesuatu selain Allah akan binasa, maka berarti beribadah kepada selain Allah, di mana dia akan binasa adalah perkara yang sangat batil dan rusak. Di dunia dan akhirat. Untuk diberikan balasan. Oleh karena itu, hendaknya orang yang berakal beribadah kepada Allah saja, mengerjakan amal yang mendekatkan diri kepada-Nya, berhati-hati terhadap kemurkaan-Nya serta berhati-hati jangan sampai datang menemui Tuhannya dalam keadaan belum bertobat, dan belum mau berhenti dari dosa-dosa dan kesalahannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 88",
    "description": "Dan jangan pula engkau sembah tuhan yang lain selain Allah. Tidak ada tuhan pengendali dan penguasa seluruh alam yang berhak disembah selain dia yang maha esa lagi mahakekal itu. Segala sesuatu pasti binasa dan fana, kecuali Allah. Segala keputusan di dunia dan akhirat menjadi wewenang-Nya, dan hanya kepada-Nya kamu dan seluruh makhluk dikembalikan. 1. Alif l'm m'm adalah huruf-huruf fonemis yang digunakan untuk menerangkan bahwa Al-Qur'an, sebagai suatu mukjizat, terdiri atas huruf-huruf yang dapat mereka ucapkan dengan baik, di samping untuk menarik perhatian orang-orang yang mendengarnya serta mema-lingkan perhatian mereka kepada kebenaran."
  }
]