[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ketika istri Fir’aun melihatnya, Allah menaruh rasa sayang di hatinya, dan dia berkata kepada Fir’aun, “Anak kecil ini akan menjadi sumber kebahagiaan bagiku dan bagimu. Maka janganlah kalian membunuhnya. Mungkin saja kita akan mendapatkan kebaikan melaluinya atau kita jadikan ia sebagai anak.” Fir’aun dan keluarganya tidak menyadari bahwa kehancuran mereka adalah melalui kedua tangan anak itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "9. Ketika Fir'aun hendak membunuhnya, istrinya berkata, “Anak ini adalah sumber kebahagian bagiku dan bagimu, janganlah engkau membunuhnya, semoga ia bisa bermanfaat bagi kita sebagai pembantu atau kita jadikan dia sebagai anak angkat.” Mereka tidak mengetahui apa yang akan terjadi pada kerajaan mereka di tangan anak itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "9. Para pelayan membawa anak itu dan meletakkannya di hadapan Fir’aun dan istrinya; dan ketika itu anak-anak lelaki dari Bani Israil pasti terancam dibunuh sebagaimana hukum yang ditetapkan Fir’aun. Akan tetapi Asiyah -istri Fir’aun- merasa kasihan terhadap Musa dan Allah memasukkan rasa cinta kepadanya ke dalam hatinya, sehingga dia ingin agar suaminya tidak membunuh anak tersebut, dan Asiyah sangat dicintai Fir’aun. Istrinya memberi harapan bahwa anak itu akan menjadi sumber kebahagiaan baginya dan bagi suaminya, dan menjadi penyejuk mata dan menyenang hati. Jika anak ini dibesarkan dalam asuhannya, kita berharap dia akan bermanfaat bagi kita dan menjadikannya seperti anak sendiri. Namun mereka tidak mengetahui kehendak Allah bahwa kehancuran kerajaan dan kekejaman mereka akan ada di tangan anak tersebut."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "9. وَقَالَتِ امْرَأَتُ فِرْعَوْنَ قُرَّتُ عَيْنٍ لِّى وَلَكَ ۖ (Dan berkatalah isteri Fir’aun: “(Ia) adalah penyejuk mata hati bagiku dan bagimu) Yakni istri Fir’aun berkata kepadanya: “anak ini akan menjadi sumber kebahagiaan bagi diriku dan dirimu” لَا تَقْتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ(Janganlah kamu membunuhnya, mudah-mudahan ia bermanfaat kepada kita) Sehingga kita mendapatkan kebaikan darinya. أَوْ نَتَّخِذَهُۥ وَلَدًا(atau kita ambil ia menjadi anak) Istri Fir’aun tidak memiliki keturunan, maka ia meminta Musa dari Fir’aun, dan Fir’aun mengabulkannya. وَهُمْ لَا يَشْعُرُونَ (sedang mereka tiada menyadari) Yakni mereka tidak menyadari bahwa kebinasaan mereka berada di tangan Musa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "9. Istri Fir´aun yaitu Asiyah seorang mukminah, dia adalah keturunan dari raja Mesir pada zaman nabi Yusuf. Ketika Ketika Fir’aun telah berniat membunuh nabi Musa, Asiyah berkata: \"Ia adalah penyejuk mata hati bagiku dan bagimu. Janganlah kamu membunuhnya, mudah-mudahan ia bermanfaat kepada kita. Dia memiliki tanda/sinyal kebaikan atau kita bisa menjadikannya sebagai anak angkat\", sedang mereka tiada menyadari"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Istri Firʻaun berkata,“Dia adalah penyejuk hati bagiku} sumber kebahagiaan dan kegembiraan bagiku {dan bagimu. Janganlah membunuhnya. Mudah-mudahan dia memberi manfaat bagi kita atau kita mengambilnya sebagai anak” Mereka tidak menyadari} mereka tidak menyadari bahwa kehancuran mereka itu ada di tangannya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "9. Dan tatkala keluarga Firaun telah memungutnya, maka Allah menjadikan permaisuri Firaun yang mulia lagi beriman, yaitu Asiyah binti Muzahim jadi sangat menyayanginya, “dan berkata,” anak ini adalah “penyejuk mata hati bagiku dan bagimu.” Janganlah kamu membunuhnya.” Maksudnya, biarkanlah dia hidup untuk kita agar hati menjadi sejuk dengannya dan kehidupan kita menjadi bahagia karenanya, “mudah-mudahan dia bermanfaat kepada kita atau kita ambil dia menjadi anak.” Maksudnya, tidak terlepas (dari dua pilihan) : bisa jadi dia menjadi selayaknya para pembantu yang selalu bekerja untuk kepentingan kita, atau kita mengangkatnya satu derajat lebih tinggi dari itu, yaitu kita menjadikannya sebagai anak kita, kita muliakan dan kita banggakan. Allah menakdirkan Musa bahwa dia memberikan manfaat bagi istri Fir a’un yang telah mengatakan ungkapan di atas. Sebab, ketika Musa telah menjadi penyejuk hatinya, dan dia pun sangat mencintainya, maka Musa terus menjadi seperti anak kandungnya sendiri sampai besar, kemudian Allah mengangkatnya sebagai nabi lalu sebagai seorang rasul, maka istri Fir’aun segera masuk Islam dan beriman kepadanya. Semoga Allah meridhainya dan membuatnya ridha (memeluk Islam). Allah berfirman [tentang] dialog dan tawar menawar tentang masalah Musa ini berfirman, “sedangkan mereka tidak menyadari,” apa yang telah menjadi goresan qalam dan takdir dari semenjak tibanya hingga kepada apa yang telah dia capai. Ini merupakan kelembutan Allah. Kalau saja mereka menyadari, tentu masalahnya akan menjadi lain."
  },
  {
    "title": "An-Nafahat Al-Makkiyah / Syaikh Muhammad bin Shalih asy-Syawi",
    "description": "Surat Al-Qashash ayat 9: Ketika istri fir’aun melihat anak ini (Musa) di dalam kotak kayu, ia ber-empati atasnya, dan dimasukkan dalam hatinya kasih sayang. Ia berkata kepada fir’aun dan tentaranya : Janganlah kalian membunuh anak ini, tinggalkanlah ia bagiku agar menjadi penyejuk pandangan bagi kami, dan supaya ada pada kami kebahagiaan karena sebab dirinya dan supaya menjadikannya pelayan kami atau kami pungut sebagai anak-anak kami. Allah kemudian menjelaskan bahwa istri fir’aun dan tentara-tentaranya mengatakan demikian dalam keadaan tidak mengetahui bahwa kebinasaan thaghut (fir’aun dan bala tentaranya) akan terjadi melalui tangannya (Musa)."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Ia bernama Asiyah binti Muzahim. Ketika Fir’aun dan orang-orang dekatnya hendak membunuhnya. Maka mereka pun menataatinya. Yakni, ia bisa menjadi pelayan kita yang membantu urusan kita atau kita tinggikan kedudukannya menjadi anak angkat kita yang kita muliakan. Allah Subhaanahu wa Ta'aala menakdirkannya, bahwa ia (Musa) ternyata bermanfaat bagi istri Fir’aun. Ketika Musa menjadi penyejuk matanya dan ia mencintainya sekali sehingga seperti anak kandungnya, sampai pada usia dewasa dan Allah mengangkatnya menjadi nabi dan rasul, ternyata ia segera masuk Islam dan beriman kepada Musa radhiyallahu 'anha. Akibat yang akan mereka alami. Hal ini termasuk kelembutan Allah Subhaanahu wa Ta'aala."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Qashash Ayat 9",
    "description": "Setelah musa dipungut dan dilihat oleh keluarga istana, istri fir'aun berkata, 'dia, yakni anak itu adalah penyejuk mata hati bagiku dan bagimu wahai suamiku, fir'aun. Karena itu janganlah kamu wahai fir'aun dan jangan juga siapa pun yang engkau perintahkan membunuhnya seperti yang terjadi pada anak-anak lelaki bani israil mendidiknya dengan baik atau kita ambil dia menjadi anak angkat jika ternyata ia tidak ditemukan oleh orang tuanya'. Demikian ucapan istri fir'aun ketika ia bersama suaminya dan siapa yang ada di sekelilingnya, sedang mereka tidak menyadari apa yang akan terjadi setelah fir'aun memeliharanya di istana. 10. Dan selanjutnya diuraikan keadaan ibu musa yang anaknya telah dipungut oleh keluarga istana, yaitu dikisahkan hati ibu musa menjadi kosong dari segala yang dirisaukannya, setelah Allah meneguhkan hatinya. Sungguh, akibat kekhawatirannya yang sangat mendalam hampir saja dia menyatakannya yakni rahasia yang dipendamnya tentang musa. Seandainya tidak kami teguhkan hatinya pastilah dia akan meng-akui bahwa anak yang dipungut fir'aun itu adalah anak kandungnya dan dia akan berteriak meminta tolong kepada orang untuk mengambil anaknya itu kembali, yang akan mengakibatkan terbukanya rahasia bahwa musa adalah anaknya sendiri. Peneguhan itu kami lakukan agar dia termasuk orang-orang yang beriman yang percaya kepada janji Allah."
  }
]