[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta menjalankan syariatNya, sempurnakanlah perjanjian-perjanjian Allah yang dipertegas, berupa keimanan terhadap ajaran-ajaran syariat agama dan ketundukan kepadanya. Dan penuhilah perjanjian sebagian kelian atas sebagian yang lain berupa amanat, jual-beli dan akad-akad lainnya yang tidak bertentangan dengan Kitabullah dan Sunnah rasulNya, Muhammad . Sungguh Allah telah mengahalalkan bagi kalian binatang-binatang ternak, seperti unta, sapi dan kambing, kecuali apa yang telah dijelaskan kepada kalian, yaitu diharamkannya bangkai, darah, dan lainnya, serta diharamkannya binatang buruan ketika kalian tengah dalam kondisi ihram. Sesungguhnya Allah menetapkan hukum apa saja yang dikehendakiNya sesuai dengan hikmah dan keadilanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "1. Wahai orang-orang yang beriman kepada Allah! Sempurnakanlah perjanjian-perjanjian yang saling mengikat kuat antara kalian dengan pencipta kalian dan antara kalian dengan makhluk-Nya. Dan Allah telah menghalalkan bagi kalian -sebagai wujud kasih sayang-Nya kepada kalian- binatang-binatang ternak, seperti unta, sapi, dan kambing, kecuali binatang yang pengharamannya dibacakan kepada kalian. Dan kecuali binatang buruan darat yang diharamkan bagi kalian pada saat kalian melaksanakan ihram haji atau umrah. Sesungguhnya Allah menetapkan hukum atas apa yang Dia kehendaki dengan menghalalkan atau mengharamkannya sesuai dengan kebijaksanaan-Nya. Maka tidak ada seorang pun yang bisa memaksa-Nya. Dan tidak ada seorang pun yang mampu menyanggah ketetapan hukum-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "1. Seruan pertama pada surat ini mengajak orang-orang beriman untuk memenuhi setiap akaf. Dan akad-akad ini meliputi setiap akad yang dibuat Allah terhadap hamba-hamba-Nya dan hukum-hukum yang ditetapkan bagi mereka, dan setiap akad yang dibuat antar sesama hamba seperti akad amanah, jual-beli, dan akad-akad lain yang diperbolehkan oleh syariat. Dan bagian dari rahmat dan kemudahan yang Allah berikan kepada hamba-hamba-Nya, Dia menghalalkan bagi mereka segala sesuatu yang mengandung kebaikan dan manfaat, seperti unta sapi, kambing, domba dan hewan-hewan serupa bisa digembalakan; semua itu halal bagi mereka kecuali yang mendapat pengecualian dari Allah, sebagaimana diharamkannya perburuan bagi orang yang sedang menjalankan ihram haji, umrah, atau keduanya meskipun perburuan itu dilakukan di luar tanah suci. Penutup ayat ini dijadikan sebagai penegasan atas hukum yang telah disebutkan. Allah adalah Pencipta dan Pemilik segala sesuatu, tidak ada yang boleh menentang hukum-Nya dan menolak ketetapan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "1. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوٓا۟ أَوْفُوا۟ بِالْعُقُودِ ۚ (Hai orang-orang yang beriman, penuhilah aqad-aqad itu) Yakni akad yang diambil oleh Allah dan dilazimkan-Nya terhadap hamba-hamba-Nya berupa hukum-hukum. Maka para hamba memegang akad itu dengan perkataan: sami’naa waa atha’naa, dan perkataan lainnya. Dan termasuk pula akad yang mereka ikatkan diantara mereka berupa akad-akad muamalat atau penepatan janji dalam hal saling membantu –bukan dalam hal dosa dan permusuhan-. Dan makna dari ayat ini adalah penuhilah akad Allah terhadap kalian dan akad diantara kalian. أُحِلَّتْ لَكُم بَهِيمَةُ الْأَنْعٰم(Dihalalkan bagimu binatang ternak) Kata (الأنعام) yakni sebutan bagi unta, sapi, dan kambing. إِلَّا مَا يُتْلَىٰ عَلَيْكُمْ(kecuali yang akan dibacakan kepadamu) Yakni apa yang disebutkan Allah pengharamannya di ayat selanjutnya seperti bangkai dan lainnya. غَيْرَ مُحِلِّى الصَّيْدِ وَأَنتُمْ حُرُمٌ ۗ( dengan tidak menghalalkan berburu ketika kamu sedang mengerjakan haji) Ini adalah pengecualian dalam penghalalan hewan ternak. Yakni dihalalkan hewan ternak kecuali yang kalian buru sedangkan kalian dalam keadaan berihram. Karena haram hukumnya bagi orang yang berihram untuk berburu hewan darat dan memakan hasil buruannya, baik itu bermuhrim untuk haji atau umrah atau keduannya. Dan diharamkan pula berburu hewan buruan yang ada di Kawasan tanah haram Makkah baik itu bagi orang yang berihram atau tidak."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ayat yang agung penuh dengan hikmah, satu ayat yang tidak lebih dari dua baris mengandung beberapa penting dalam agama : ajakan dan peringatan, perintah dan larangan, halal dan haram, kententuan muthlaq dan muqoyyad, pengumuman dan pengecualian, pujian dan kabar berita, Mahasuci dzat yang yang begitu agung perkataannya ini !"
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "Keutamaan: Imam Ahmad dan yang lainnya meriwayatkan dari Aisyah tentang surat Al-maidah: “Ini adalah surat yang terakhir kali turun, engkau tidak akan mendapati makanan yang halal kecuali jadikan sebagai yang halal, dan juga tidak akan mendapati yang haram kecuali haramkanlah.” Di antara surat ini ada yang turun saat Haji Wada’ yaitu ayat Alyauma akmaltu.... (ayat 3). Juga ada yang turun ketika Fathu Makkah yaitu: Wa laa yajrimannakum syana’aanu ...(2). 1 Hai orang-orang yang beriman, penuhilah janji-janji yang telah Allah persaksikan kepada para hamba-Nya. Atau janji yang telah diambil sebagian para hamba dari hamba yang lain dalam pergaulan yang diperbolehkan oleh syariat. Dihalalkan bagi kalian binatang ternak, yaitu unta, sapi, dan kambing yang disembelih sesuai syariat, kecuali binatang-binatang yang telah disebutkan Allah dalam ayat berikut yang Allah mengharamkannya berupa bangkai dan lainnya. Dengan tidak menghalalkan berburu ketika kamu sedang mengerjakan haji atau umrah. Sesungguhnya Allah menetapkan hukum-hukum menurut yang dikehendaki-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, penuhilah janji-janji} janji-janji terikat di antara kalian, Allah, dan manusia {Dihalalkan bagi kalian hewan ternak} unta, sapi, dan kambing {kecuali apa yang disebutkan} dibacakan {kepada kalian tanpa menghalalkan berburu} tidak diperbolehkan berburu {ketika kalian sedang berihram} berihram untuk haji atau umrah {Sesungguhnya Allah menetapkan hukum sesuai dengan yang Dia kehendaki"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "1. Ini adalah perintah dari Allah kepada hamba-hambaNya yang beriman, untuk memenuhi perjanjian yang merupakan konsekuensi dari keimanan. Memenuhi perjanjian , maksudnya menyempurnakan, melengkapi, tidak menguranginya dan tidak membatalkannya. Ini meliputi perjanjian antara hamba dan Rabbnya dalam bentuk memengang taguh tugas ubudiyah, menunaikannya dengan sebaik-baiknya dan tidak mengurangi hak-haknya sedikitpun, juga perjanjian seorang hamba dengan Rasululah yaitu dengan mentaati dan mengikutinya, dan perjanjian seorang hamba dengan kedua orang tua dan kerabat, dengan berbuat baik kepada kedua orang tua dan silaturahim kepada kerabat dengan tidak memutuskannya, juga antara hamba dengan temannya dengan menunaikan hak pertemanan dalam keadaan kaya, miskin, mudah, dan sulit. Juga antara hamba dengan manusia dalam bentuk transaksi-transaksi muamalah seperti jual beli, sewa meyewa, dan lain-lain, akad sukarela seperti hibah dan lain-lain. Bahkan meliputi hak-hak kaumMuslimin sebagaimana Allah jelaskan pada FirmanNya, \"sesungguhnya orang mukmin itu bersaudara\" (Al-Hujurat:10) Yaitu dengan saling bahu membahu dan tolong menolong di atas kebenaran, saling menyayangi dan tidak saling tidak memutuskan hubungan. Ini mencakup seluruh pokok-pokok dan cabang-cabang Agama. Semuanya masuk kedalam akan yang di perintahkan oleh Allah untuk di tunaikan. Ayat ini di gunakan sebagai dalil bahwa pada dasarnya semua dasar dan syarat adalah di bolehkan dan bahwa ia terlaksana dengan ucapan dan perbuatan yang menunjukan kepadanya karena ia di sebutka secara mutlak. Kemudian Allah menjelaskan nikmatNya kepada hamba-hambaNya, “dihalalkan untukmu.” Maksudnya, dihalalkan buatmu sebagai rahmat umtukmu. “Hewan ternak” yaitu: Unta, sapi dan domba, bahkan bisa jadi yang liar darinya termasuk kedalamnya, kijang, zebra, dan hewan-hewan buruan lainnya. Sebagian sahabat berdalil dengan ayat ini atas kehalaln janin yang mati di dalam perut induknya setelah induknya di sembelih. “ Kecuali atas apa yang di bacakan atas kalian,” maksudnya, yang di haramkan dari binatang ternak tersebut dalam Firman Allah, “Diharamkan atas kalian bangkai,darah dan daging babi,” sampai ahkir ayat. Semua yang di sebut dalam ayat ini walaupun ia termasuk hewan ternak adalah haram hukumnya. Ketika pembolehan binatang ternak berlaku umum di seluruh kondisi dan waktu, maka dikecualikan darinya binatang buruan dalam keadaan ihram. FirmanNya, “dan tidak menghalalkan berburu ketika kamu sedang mengerjakan haji.” Artinya, di halalkan bagimu binatang ternak dalam kondisi apa pun, kecuali, dimana kalian di beri predikat sebagai orang yang tidak menghalalkan berburu, ketika kalian sedang mengerjakan haji. Maksudnya, kamu berani mebunuhnya dalam kedaan ihram. Karena hal itu tidak halal bagimu jika binatang itu adalah binatang buruan seperti kijang dan sejenisnya. Binatang buruan itu adalah binatang yang halal dagingnya dan liar. “sesungguhnya Allah menetapkan hukum menurut yang di hendakiNya.” Maksudnya apa pun yang diinginkan oleh Allah, maka dia memutuskan hukumnya dengan hukuman yang sesuai dengan hikmahNya, sebagaimana halnya dia telah memerintahkan kamu agar menjauhi perjanjian demi menjaga kemaslahatanmu dan menolak mudharat bagimu, dan Allah menghalalkna bagimu binatang ternak sebagai rahmat bagimu dan mengharamkan apa yang di kecualikan darinya, berupa binatang-binatang yang memiliki krateria khusus seperti bangkai dan sejenisnya; untuk melindungi dan menjaga kalian dan juga binatang buruan dalam kondisi ihram untuk menghormati dan menghargai ihram itu sendiri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 1: Aqad (perjanjian) mencakup janji prasetia hamba kepada Allah dan perjanjian yang dibuat oleh manusia dalam pergaulan sesamanya. Syaikh As Sa'diy berkata, \"Ini merupakan merupakan perintah Allah kepada hamba-hamba-Nya yang mukmin untuk mengerjakan konsekwensi daripada iman, yaitu memenuhi janji, yakni menyempurnakannya, melengkapinya, tidak membatalkan dan tidak mengurangi. Hal ini mencakup akad (perjanjian) yang dilakukan antara seorang hamba dengan Tuhannya berupa mengerjakan ibadah kepada-Nya, mengerjakannya secara sempurna, tidak mengurangi di antara hak-hak itu. Demikian juga mencakup antara seseorang dengan rasul-Nya, yaitu dengan menaatinya dan mengikutinya, mencakup pula antara seseorang dengan kedua orang tuanya dan kerabatnya, yakni dengan berbakti kepada mereka dan menyambung tali silaturrahim dengan mereka dan tidak memutuskannya. Demikian pula akad antara seseorang dengan kawan-kawannya berupa mengerjakan hak-hak persahabatan di saat kaya dan miskin, lapang dan sempit. Termasuk pula akad antara seseorang dengan yang lain dalam akad mu'amalah, seperti jual beli, menyewa, dsb. Termasuk pula akad tabarru'at (kerelaan), seperti hibah dsb. bahkan termasuk pula memenuhi hak kaum muslimin yang telah Allah akadkan hak itu di antara mereka dalam firman-Nya, \"Sesungguhnya kaum mukmin itu bersaudara.\" (Terj. Al Hujurat: 10) dengan cara saling tolong-menolong di atas kebenaran, membantunya, saling bersikap lembut dan tidak memutuskan hubungan.\" Berdasarkan ayat ini pula bahwa hukum asal dalam akad dan syarat adalah mubah, dan bahwa hal itu dipandang sah dengan perkataan atau perbuatan yang menunjukkan demikian karena kemutlakannya. Seperti unta, sapi dan kambing. Bahkan bisa masuk juga ke dalamnya hewan liar dari binatang-binatang tersebut, kijang, keledai liar (bukan keledai negeri) dan binatang-binatang buruan. Sebagian sahabat Nabi radhiyallahu 'anhum ada yang berdalil dengan ayat ini untuk membolehkan janin yang mati dalam perut induknya, setelah induknya disembelih. Yakni karena kamu, sebagai rahmat dari-Nya. Seperti yang akan disebutkan dalam ayat 3 surat Al Maa'idah. Seperti halal dan haram. Tanpa ada yang menentangnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 1",
    "description": "Surah ini diawali dengan perintah kepada setiap orang yang beriman agar memenuhi janji-janji yang telah diikrarkan, baik janji kepada Allah maupun janji kepada sesama manusia. Wahai orang-orang yang beriman! penuhilah janji-janji, yaitu janji-janji antara manusia dengan Allah, manusia dengan manusia, dan manusia dengan dirinya sendiri, selama janji-janji itu tidak mengharamkan yang halal dan tidak menghalalkan yang haram. Di antara janji Allah itu ialah hukum-hukum-Nya yang ditetapkan kepadamu, yaitu bahwasanya hewan ternak, yaitu unta, sapi, kambing, dihalalkan bagimu sesudah disembelih secara sah, kecuali yang akan disebutkan kepadamu haramnya, yaitu yang disebut pada ayat ketiga dari surat ini, dan juga dengan tidak menghalalkan berburu ketika kamu sedang berihram haji atau umrah. Sesungguhnya Allah menetapkan hukum halal dan haram sesuai dengan yang dia kehendaki, menurut ilmunya dan hikmah-Nya. Ayat berikut berisi hukum-hukum Allah yang berkaitan dengan tata cara pelaksanaan ibadah haji. Wahai orang-orang yang beriman! janganlah kamu melanggar syiar-syiar kesucian Allah, yakni segala amalan yang dilakukan dalam melaksanakan ibadah haji seperti tata cara melakukan tawaf dan sa'i, serta tempat-tempat mengerjakannya, seperti kakbah, safa, dan marwah, jangan engkau melanggarnya dengan berburu ketika dalam keadaan ihram dan jangan pula melanggar kehormatan bulanbulan haram, yaitu bulan zulkaidah, zulhijah, muharram, dan rajab, janganlah pula engkau melanggar kehormatannya dengan berperang pada bulan itu kecuali untuk membela diri ketika diserang. Jangan pula mengganggu hadyu, yaitu hewan-hewan kurban yang dihadiahkan kepada kakbah untuk mendekatkan diri kepada Allah, hewan-hewan itu disembelih di tanah haram dan dihadiahkan dagingnya kepada fakir miskin, dan qala'id, hewan-hewan kurban yang diberi tanda, dikalungi dengan tali sebagai tanda yang menunjukkan bahwa hewan itu telah dipersiapkan untuk dikurbankan dan dihadiahkan, dan jangan pula mengganggu orang-orang yang mengunjungi baitulharam, untuk melaksanakan ibadah haji atau umrah, mereka mencari karunia berupa keuntungan duniawi, dan keridaan yang berupa ganjaran dari tuhannya. Akan tetapi, apabila kamu telah menyelesaikan ihram, maka bolehlah kamu berburu apabila kamu mau. Jangan sampai kebencian sebagian kamu kepada suatu kaum karena mereka menghalang-halangimu dari mengunjungi masjidilharam, mendorongmu berbuat melampaui batas kepada mereka dengan cara membunuh mereka atau melakukan kejahatan kepada mereka. Dan tolong-menolonglah kamu dalam mengerjakan kebajikan, melakukan yang diperintahkan Allah, dan takwa, takut kepada larangannya, dan jangan tolong-menolong dalam berbuat dosa, melakukan maksiat dan permusuhan, sebab yang demikian itu melanggar hukum-hukum Allah. Bertakwalah kepada Allah, takut kepada Allah dengan melakukan perintah-Nya dan meninggalkan larangan-Nya, karena sungguh Allah sangat berat siksaan-Nya kepada orang-orang yang tidak taat kepada-Nya."
  }
]