[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan orang-orang yang mengingkari keesaan Allah yang menunjukkan kepada kebenaran yang nyata, dan mendustakan dalil-dalilNya yang dibawa oleh para rasul, mereka itulah para penghuni neraka yang akan berada di sana selamanya"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "10. Sedangkan orang-orang yang ingkar kepada Allah dan mendustakan ayat-ayat-Nya, mereka itu penghuni-penghuni Neraka yang akan masuk ke dalamnya sebagai hukuman atas kekafiran dan pendustaan mereka. Mereka akan menetap di sana sebagaimana seorang sahabat yang selalu setia dengan sahabatnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "10. Adapun kesudahan orang-orang kafir yang mendustakan ayat-ayat Allah adalah menuju neraka jahanam sesuai dengan ketetapan yang adil dari Allah, Dia Maha Mengetahui amal perbuatan mereka dan Maha Bijaksana dalam ketetapan dan hukum-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "10 Adapun orang-orang yang kafir atas adanya Allah juga kafir atas kemahaesaan-Nya, dan mendustakan ayat-ayat yang diturunkan kepada para rasul yang mulia, mereka itu adalah penghuni neraka dan kekal di dalamnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Adapun orang-orang yang ingkar dan mendustakan ayat-ayat Kami, mereka itulah penghuni neraka Jahim"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "10. “Adapun orang-orang kafir dan mendustakan ayat-ayat Kami,” yang menunjukkan kebenaran yang jelas, lalu mereka mendustakannya setelah kebenaran itu terbukti, “maka mereka itu adalah penghuni neraka,” yang selalu tetap di dalamnya, seperti seseorang yang selalu bersama dengan temannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 10: Setelah membuktikan hakikat sebenarnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 10",
    "description": "Setelah itu, Allah menyatakan pembalasan yang akan ditimpakan kepada orang-orang kafir. Adapun orang-orang yang kafir yang menolak ajakan rasul dan mendustakan ayat-ayat kami yang disampaikan melalui rasul-rasul kami, mereka itulah yang akan menjadi penghuni neraka. Mereka kekal di dalamnya selama-lamanya ayat ini sekali lagi mengingatkan orang-orang beriman agar mensyukuri anugerah keselamatan dari gangguan musuh. Wahai orangorang yang beriman! ingatlah nikmat Allah yang dianugerahkan kepadamu, ketika suatu kaum, yakni orang-orang kafir mekah dan orangorang yahudi bani naa'ir, bermaksud hendak menyerangmu dengan tangannya untuk membunuhmu dan para sahabat yang bersamamu dengan cara yang licik, lalu Allah menahan tangan mereka dari kamu sehingga mereka tidak dapat melaksanakan niatnya berbuat jahat kepadamu. Dan bertakwalah kepada Allah pada setiap waktu dan dalam segala keadaan, dan hanya kepada Allah-lah, tidak kepada selain-Nya, hendaknya orang-orang beriman itu bertawakal, menyerahkan segala keputusan kepada Allah yang memutuskan segala sesuatu sesuai ilmu-Nya yang mahaluas dan kekuasaan-Nya yang mahabesar."
  }
]