[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Katakanlah (wahai rasul) ”tidak sama antara yang buruk dengan yang baik dari segala sesuatu, maka orang kafir tidak sama dengan orang Mukmin, dan pelaku maksiat tidak sama dengan orang yang taat, orang bodoh tidak sama dengan orang Alim, pelaku bid’ah tidak sama dengan orang yang mengikuti Sunnah, harta haram tidak lah sama dengan harta halal, dan sekandanya membuatmu heran (wahai manusia) dengan banyaknya perkara-perkara buruk dan pendukungnya, maka bertakwalah kepada Allah wahai orang yang memiliki akal-akal yang matang, dengan menjauhi segala yang buruk-buruk dan melakukan hal-hal yang baik, supaya kalian beruntung dengan meraih tujuan yang paling agung, yaitu keridhaan Allah dan meraih surga."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "100. Katakanlah -wahai Rasul-, \"Tidaklah sama antara sesuatu yang baik dan sesuatu yang buruk dilihat dari sisi mana pun, walaupun sesuatu yang buruk itu banyak jumlahnya. Karena banyaknya jumlah sesuatu tidak menunjukkan kemuliaannya. Maka bertakwalah kalian -wahai orang-orang yang berakal sehat- kepada Allah dengan meninggalkan sesuatu yang buruk dan melakukan sesuatu yang baik. Mudah-mudahan kalian berhasil mendapatkan Surga.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "100. Hai Rasulallah, Katakanlah bahwa tidak sama antara yang buruk dengan yang baik; orang kafir tidak sama dengan orang mukmin, orang bodoh tidak sama dengan orang yang berilmu, kegelapan tidak sama dengan cahaya, dan harta yang haram tidak sama dengan harta yang halal. Maka janganlah tertipu dengan jumlah keburukan yang melebihi jumlah kebaikan, karena bisa jadi Allah memperbanyak harta orang-orang kafir dengan hikmah yang terkandung dibaliknya yang Dia ketahui. Takarannya bukanlah dengan banyak atau sedikit, namun dengan kebaikan dan manfaatnya meskipun sedikit. Maka bertakwalah kepada Allah hai orang-orang yang memiliki akal yang sehat, dan taatilah perintah-Nya serta jauhilah larangan-Nya agar kalian dapat meraih kebahagiaan di dunia dan di akhirat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "100. قُل لَّا يَسْتَوِى الْخَبِيثُ وَالطَّيِّبُ (katakanlah: “Tidak sama yang buruk dengan yang baik) Yakni yang halal tidak sama dengan yang haram. Pendapat lain mengatakan yakni orang kafir tidak sama dengan orang beriman. Pendapat lain mengatakan yakni orang bermaksiat tidak sama dengan orang yang taat. Pendapat lain mengatakan yakni sesuatu yang buruk tidak sama dengan yang baik. وَلَوْ أَعْجَبَكَ كَثْرَةُ الْخَبِيثِ ۚ( meskipun banyaknya yang buruk itu menarik hatimu) Karena keburukan sesuatu akan menghilangkan faidahnya, menghapus berkahnya, dan menjauhkan manfaatnya. فَاتَّقُوا۟ اللهَ يٰٓأُو۟لِى الْأَلْبٰبِ(maka bertakwalah kepada Allah hai orang-orang berakal) Yakni pilihlah amal-amal yang baik daripada yang buruk, dan bersamalah dengan orang-orang yang shaleh dan jangan dengan yang jahat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "100. Wahai rasul, katakanlah: “Halal dan haram, kafir dan mukmin, yang taat dan yang bermaksiat itu tidak sama, meskipun banyaknya orang yang berbuat kerusakan itu membuatmu tertarik. Maka bertakwalah kepada Allah dengan menjauhi yang haram dan menunaikan yang halal, supaya kalian menang di dunia dan akhirat.” Ayat ini turun terkait seorang laki-laki yang mengumpulkan harta dengan menjual khamr sebelum adanya pengharaman hal itu, lalu dia ingin berbuat ketaatan kepada Allah melalui hal itu. Kemudian Nabi SAW, memberitahunya bahwa dia tidak mendapat pahala atas infaknya untuk haji, jihad atau sedekah. Sesungguhnya Allah tidak menerima sesuatu kecuali yang baik. Lalu Allah SWT menurunkan ayat ini untuk memberi pembenaran kepadanya (nabi Muhammad)"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Katakanlah,“Tidaklah sama yang buruk dengan yang baik meskipun banyaknya yang buruk itu menarik hatimu. Maka bertakwalah kepada Allah wahai orang-orang yang berakal sehat agar kalian beruntung.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "100. “Katakanlah” kepada manusia dalam rangka memberikan mereka semangat kepada kebaikan dan memperingatkan mereka dari keburukan. “Tidak sama yang buruk dengan yang baik,” dalam segala hal. Iman dengan kekufuran tidaklah sama, ketaatan dengan kemaksiatan tidaklah sama, penduduk surga dengan penghuni neraka tidaklah sama, perbuatan yang baik dengan perbuatan buruk tidaklah sama, harta yang haram dengan harta yang halal tidaklah sama. “Meskipun banyaknya yang buruk itu menarik hatimu,” karena yang buruk itu tidak berguna sedikit pun bagi pemiliknya, justru membahayakan agama dan dunianya. “Maka bertakwalah kepada Allah hai orang-orang yang berakal, agar kamu mendapat keberuntungan.” Allah memerintahkan orang-orang yang berakal sempurna dan yang memiliki pandangan yang lurus. Allah mengarahkan pembicaraan kepada mereka. Mereka itulah yang diperhatikan dan diharapkan menjadi baik. Kemudian Allah memberitakan bahwa keberuntungan bergantung kepada takwa yang merupakan ketaatan kepadaNya pada perintah dan laranganNya. Barangsiapa bertakwa kepadaNya, maka dia beruntung total. Barangsiapa membuang takwa, maka dia akan merugi dan tidak beruntung."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 100: Yakni kepada manusia untuk memperingatkan mereka agar tidak mengerjakan perbuatan buruk dan mendorong mereka agar mengerjakan perbuatan baik. Tidaklah sama kekafiran dengan keimanan, ketaatan dengan kemaksiatan, amal buruk dengan amal baik, yang haram dengan yang halal, dan penghuni neraka dengan penghuni surga. Karena ia tidaklah bermanfaat apa-apa bagi pelakunya, bahkan merugikan dirinya baik di dunia maupun di akhirat. Karena merekalah yang masih bisa diharapkan kebaikannya. Ayat ini menerangkan bahwa keberuntungan hanya bisa didapat dengan ketakwaan, barang siapa yang meninggalkan ketakwaan, maka ia akan mendapatkan kerugian dan hilangnya keberuntungan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 100",
    "description": "Katakanlah, wahai nabi Muhammad, tidaklah sama yang buruk, kekufuran, kemusyrikan, kemunafikan, dan harta yang haram dengan yang baik, iman, tauhid, kejujuran, dan harta yang halal; meskipun banyaknya keburukan itu, kekayaan hasil korupsi dan harta yang diperoleh dengan cara yang haram secara lahiriah, menarik hatimu, karena tertarik kepada kenikmatan, kepuasan dan kemudahan, serta kebanggaan sebagai seorang yang kaya; maka bertakwalah kepada Allah dengan menjauhkan diri kamu dari kekufuran, kemusyrikan, dan kemunafikan, serta dari harta yang haram; wahai orang-orang yang mempunyai akal sehat sehingga kamu berpikir jernih dan mendalam agar kamu beruntung dunia dan akhirat. Wahai orang-orang yang beriman, yang membenarkan Allah dan rasul-Nya! janganlah kamu menanyakan kepada nabimu hal-hal yang jika diterangkan kepadamu justru menyusahkan dan berdampak buruk bagi kamu. Sebab dalam islam yang terpenting bukan bertanya, tetapi semangat untuk melaksanakan. Sebaliknya jika kamu bertanya kepada nabi tentang masalah-masalah itu ketika Al-Qur'an sedang diturunkan, niscaya jawabannya akan diterangkan kepadamu dengan sejelas-jelasnya. Allah telah memaafkan kamu tentang hal itu, menanyakan masalah-masalah yang sudah jelas bagi orang-orang beriman. Dan Allah maha pengampun kepada orang-orang yang menyadari kesalahannya dengan bertobat, dan maha penyantun kepada seluruh hamba-hamba-Nya."
  }
]