[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, janganlah kamu bertanya-tanya tentang sesuat terkait perkara-perkara agama yang kalian tidak diperintahkan menjalankannya sama sekali, seperti pertanyaan tentang perkara-perkara yang belum terjadi atau yang mengakibatkan munculnya keberatan-keberatan dalam syariat, yang seandainya kalian dibebani dengannya, pastilah akan menyengsarakan kalian. Dan apabila kalian bertanya tentang itu saat rasululah masih hidup dan ketika wahyu al-qur’an masih turun, niscaya akan dijelaskan hukumnya bagi kalian dan kalian mungkin saja mendapat beban menjalankannya, lalu kalian tidak sanggup untuk melaksanakannya, dan Allah menanggalkannya, demi membebaskan hamba-hambaNya dari tanggunagn tersebut. Dan Allah Maha pengampun bagi hamba-hambaNYa bila mereka bertaubat, juga maha penyantun kepada mereka maka Dia tidak akan menyiksa mereka ketika mereka sudah sungguh-sungguh bertaubat kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "101. Wahai orang-orang yang beriman! Janganlah kalian bertanya kepada rasul kalian tentang hal-hal yang tidak kalian butuhkan dan tidak membantu kalian dalam mengurus urusan agama kalian. Karena apabila hal-hal semacam itu dijelaskan kepada kalian, maka kalian akan mengalami kesulitan. Dan jika kalian menanyakan hal-hal yang tidak boleh kalian tanyakan itu, pada saat turunnya wahyu kepada rasul, niscaya hal-hal tersebut akan dijelaskan kepada kalian. Dan itu sangat mudah bagi Allah. Sesungguhnya Allah telah melewatkan hal-hal yang tidak dibicarakan oleh Al-Qur`ān. Maka janganlah kalian menanyakannya. Karena jika kalian menanyakannya, maka turunlah wahyu yang akan membebani kalian pada ketentuan hukumnya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "101. Ini merupakan pengajaran dari Allah bagi hamba-hamba-Nya yang beriman dan larangan bagi mereka untuk tidak bertanya tentang sesuatu yang tidak memiliki faedah dan tidak dibutuhkan; karena bisa jadi jika hal itu dijelaskan akan menjadi sesuatu yang buruk dan memberatkan bagi mereka. Jika Al-quran yang turun mengandung jawaban dari pertanyaan itu maka itulah jawabannya, namun jika tidak turun dengan membawa jawaban maka janganlah sekali-kali seseorang dari kalian berkata: \"Al-quran tidak dapat menjawab pertanyaan itu.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "101. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ لَا تَسْـَٔلُوا۟ عَنْ أَشْيَآءَ (Hai orang-orang yang beriman, janganlah kamu menanyakan hal-hal) Yakni janganlah kalian menanyakan Rasulullah apa-apa yang tidak penting untuk kalian tanyakan dan tidak membantu kalian dalam urusan agama kalian. إِن تُبْدَ لَكُمْ تَسُؤْكُمْ (yang jika diterangkan kepadamu akan menyusahkan kamu) Yakni apabila dijelaskan malah akan menyusahkan kalian. Karena bertanya tentang apa yang tidak bermanfaat dan tidak dibutuhkan bisa jadi akan menjadi sebab diwajibkannya hal tersebut atas si penanya dan orang lain. وَإِن تَسْـَٔلُوا۟ عَنْهَا حِينَ يُنَزَّلُ الْقُرْءَانُ(dan jika kamu menanyakan di waktu Al Quran itu diturunkan) Yakni saat Rasulullah berada diantara kalian dan wahyu masih diturunkan kepada kalian. تُبْدَ لَكُمْ (niscaya akan diterangkan kepadamu) Yakni akan dijelaskan untuk kalian lewat jawaban langsung dari Nabi atau lewat wahyu yang diturunkan. عَفَا اللهُ عَنْهَا ۗ (Allah memaafkan (kamu) tentang hal-hal itu) Yakni terdapat banyak hal yang memang tidak dibahas dalam al-qur’an dan kalian tidak dibebani apapun tentang hal-hal tersebut, maka janganlah kalian menanyakannya. Namun jika kalian menanyakannya maka ayat al-qur’an akan diturunkan untuk membebani kalian dengan hukum permasalahan tersebut. Maka janganlah kalian terlalu banyak bertanya. Rasulullah bersabda: “orang muslim yang paling banyak berdosa atas muslim lainnya adalah orang yang bertanya sesuatu yang tidak diharamkan, yang kemudian diharamkan karena pertanyaannya”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "101. Wahai orang-orang yang beriman, janganlah kalian bertanya tentang hal-hal yang tidak bermakna bagi urusan agama kalian dan akan menyusahkan kalian jika diterangkan di saat turunnya wahyu, karena pertanyaan tentang hal tersebut akan menjadi sebab dijawabnya pertanyaan tersebut. Dan jika kalian menanyakannya saat turunnya wahyu, maka hal tersebut akan diterangkan untuk kalian. Allah memaafkan hal-hal yang tidak disebutkan Al-Qur’an itu. Dan Allah itu Maha Pengampun bagi orang yang meminta ampunan lagi Maha Pemurah sehingga tidak mempercepat hukuman. Ayat ini turun terkait pertanyaan suatu kaum, yang merupakan pertanyaan untuk mengolok-olok, seperti “dimana untanya dan siapa ayahnya”, dan juga (diturunkan) terkait Al-Aqra’ bin Habis ketika bertanya tentang menunaikan haji setiap tahunnya, lalu Nabi SAW bersabda: “Jika aku berkata iya, maka kamu wajib melakukannya, dan sungguh, kalian tidak sanggup.”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian menanyakan hal-hal yang jika diterangkan} ditunjukkan {kepada kalian, maka itu akan menyusahkan kalian} membuat sedih kalian karena apa yang ada di dalamnya adalah sesuatu yang mempersulit {Jika kalian menanyakannya ketika Al-Qur’an sedang diturunkan, maka akan diterangkan kepada kalian. Allah telah memaafkan} membiarkan {tentang hal itu} tentang pertanyaan-pertanyaan kalian yang telah berlalu, maka janganlah kalian kembali kepada sesuatu yang menyerupainya {Allah Maha Pengampun lagi Maha Penyantun"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "101. Allah melarang hamba-hambaNya yang beriman bertanya tentang perkara-perkara yang jika dijelaskan justru membawa keburukan dan kesedihan bagi mereka. Hal itu seperti pertanyaan sebagain kaum muslimin kepada Rasululah tentang bapak-bapak mereka dan tentang keadaan mereka di syurga atau di neraka. Hal seperti ini seandainya dijelaskan kepada penanya tidak akan mendatangkan kebaikan. Juga pertanyaan seperti tentang perkara-perkara yang tidak terjadi, dan pertanyaan yang berakibat diturunkannya hukum-hukum yang berat dalan syariat yang menyusahkan umat. Juga seperti pertanyaan tentang sesuatu yang tidak berguna. Adapun pertanyaan yang tidak berakibat apa pun dari yang telah di sebutkan, maka ia diperintahkan. Sebagaimana Firman Allah, \"Kami tiada mengutus rasul rasul sebelum kamu (Muhammad), melainkan beberapa orang-laki-laki yang Kami beri wahyu kepada mereka, maka tanyakanlah olehmu kepada orang-orang yang berilmu, jika kamu tiada mengetahui.\" ( Al-Anbiya:7) “ Dan jika kamu menanyakan di waktu Al-Qur’an itu sedang di turunkan, niscaya akn diterngakan kepadaMu.” Maksudnya, jika pertanyaan itu pas pada momenNya, ketika Al-Qur’an diturunkan kepadaMu, dan kamu bertanya tentang ayat-ayat yang muskil atau hukum yang samar bagiMu pada waktu di mana turunnya dari langit adalah sesuatu yang memungkinkan, “ niscaya akan di terangkan kepadMu”; dijelaskan dan dipaparkan kepadaMu. Maka diamlah terhadap masalah yang Allah padaNya. “ Allah memaafkan kamu tentang hal-hal itu.” Maksudnya, Allah diam karena memberi maaf kepada hamba-hambaNya jadi semua yang Allah diamkan adalah termasuk yang dia bolehkan atau maafkan. “ Dan Allah Maha Penyayang Lagi Maha Peyantun,” selalu memberi ampunan, dikenal dengan kebaikan dan kebijaksanaaNya. Carilah ampun dan kebaikanNya. Mohonlah rahmat dan ridhoNya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 101: Ayat ini turun ketika para sahabat banyak bertanya kepada Nabi shallallahu 'alaihi wa sallam tentang perkara-perkara yang jika diterangkan kepada mereka, tentu akan memberatkan mereka dan membuat mereka sedih. Misalnya pertanyaan mereka kepada Rasulullah shallallahu 'alaihi wa sallam tentang keadaan nenek moyang mereka apakah di surga atau di neraka. Pertanyaan seperti ini tidak ada kebaikannya bagi mereka, termasuk juga pertanyaan yang tidak terjadi. Demikian juga pertanyaan yang mengakibatkan beban-beban berat dalam syari'at, pertanyaan yang tidak berguna, dsb. namun jika lepas dari semua ini, maka pertanyaan tersebut disyari'atkan. Imam Bukhari meriwayatkan dari Anas radhiyallahu 'anhu ia berkata: Nabi shallallahu 'alaihi wa sallam pernah menyampaikan khutbah yang belum pernah saya dengar sebelumnya, Beliau bersabda, \"Jika sekiranya kamu mengetahui apa yang aku ketahui, tentu kamu akan sedikit tertawa dan banyak menangis.\" Maka para sahabat Rasulullah shallallahu 'alaihi wa sallam menutup muka mereka dengan menangis sedih, lalu ada seorang sahabat yang bertanya, \"Siapakah bapak saya?\" Beliau menjawab, \"Si fulan.\" Maka turunlah ayat ini, \"Laa tas'aluu 'an asy-yaa'a in tubda lakum tasu'kum…dst.\" Imam Bukhari juga meriwayatkan dari Ibnu Abbas, ia berkata: Beberapa orang ada yang bertanya kepada Rasulullah shallallahu 'alaihi wa sallam sambil bercanda. Ada yang bertanya, \"Siapa bapak saya?\" ada pula seorang yang kehilangan untanya berkata, \"Di mana unta saya?\" maka Allah menurunkan ayat, \"Yaa ayyuhalladziina aamanuu laa tas'aluu 'an asy-yaa'a in tubda lakum tasu'kum…dst.\" Thabari meriwayatkan dari Abu Hurairah ia berkata, \"Rasulullah shallallahu 'alaihi wa sallam pernah berkhutbah kepada kami dan bersabda, \"Wahai manusia! Allah mewajibkan kamu berhaji.\" Lalu Mihshan Al Asadiy bangkit dan bertanya, \"Apakah setiap tahun wahai Rasulullah?\" Beliau menjawab, \"Sesungguhnya jika aku mengatakan \"Ya.\" Tentu wajib dilakukan (setiap tahun). Jika sudah wajib, lalu kamu meninggalkannya tentu kamu akan tersesat. Diamlah terhadap apa yang aku diamkan, karena binasanya orang-orang sebelum kamu adalah karena pertanyaan mereka dan menyelisihi para nabi.\" Maka Allah menurunkan ayat, \"Yaa ayyuhalladziina aamanuu laa tas'aluu 'an asy-yaa'a in tubda lakum tasu'kum…dst.\" Yakni pertanyaan yang diajukan pada tempatnya, seperti ketika Al Qur'an diturunkan, dengan bertanya tentang maksud ayat yang masih musykil atau hukum yang masih samar dalam waktu yang masih mungkin diturunkan wahyu, maka akan diterangkan kepada kamu. Jika tidak demikian, maka hendaklah diam terhadap sesuatu yang didiamkan Allah Ta'ala. Oleh karena itu, jangan kamu ulangi. Atau maksudnya, Allah memaafkan tentang hal-hal yang didiamkan-Nya. Dia senantiasa memiliki sifat mengampuni, terkenal santun dan ihsan, oleh karena itu mintalah ampunan dan ihsan-Nya, dan carilah rahmat dan keridhaan-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 101",
    "description": "Wahai orang-orang yang beriman, yang membenarkan Allah dan rasul-Nya! janganlah kamu menanyakan kepada nabimu hal-hal yang jika diterangkan kepadamu justru menyusahkan dan berdampak buruk bagi kamu. Sebab dalam islam yang terpenting bukan bertanya, tetapi semangat untuk melaksanakan. Sebaliknya jika kamu bertanya kepada nabi tentang masalah-masalah itu ketika Al-Qur'an sedang diturunkan, niscaya jawabannya akan diterangkan kepadamu dengan sejelas-jelasnya. Allah telah memaafkan kamu tentang hal itu, menanyakan masalah-masalah yang sudah jelas bagi orang-orang beriman. Dan Allah maha pengampun kepada orang-orang yang menyadari kesalahannya dengan bertobat, dan maha penyantun kepada seluruh hamba-hamba-Nya. Wahai orang-orang beriman, sesungguhnya suatu kaum sebelum kamu, yaitu kaum yahudi umat nabi musa, sungguh telah memohon kepada nabi musa agar bisa melihat Allah dengan nyata, tetapi setelah permohonan itu dipenuhi, mereka tidak sanggup melihat-Nya dan pingsan. Kemudian mereka menjadi kafir setelah Allah memberikan bukti bahwa mereka tidak akan pernah sanggup melihat Allah."
  }
]