[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya pertanyaan-pertanyaan sejenis ini telah ditanyakan oleh satu kaum sebelum kalian kepada rosul-rosul mereka. Tapi tatkala mereka di perintah menjalankannya, mereka mengingkarinya dan tidak melaksanakannya. Maka hati-hatilah, jangan sampai kalian seperti mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "102. Orang-orang sebelum kalian pernah menanyakan hal-hal semacam itu, kemudian tatkala mereka dibebani ketentuan hukum tertentu ternyata mereka tidak mau menjalankannya. Kemudian mereka menjadi kafir karenanya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "102. Kaum-kaum sebelum kalian seperti Yahudi dan Nasrani telah meminta agar diturunkan bagi mereka suatu ayat, kemudian Allah menantang mereka, jika mereka tidak beriman dengan ayat itu niscaya Allah akan membinasakan mereka. Namun ketika ayat itu telah diturunkan yang diwajibkan atas mereka untuk melaksanakan hukumnya, ternyata mereka mendustakannya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "102. قَدْ سَأَلَهَا قَوْمٌ مِّن قَبْلِكُمْ ثُمَّ أَصْبَحُوا۟ بِهَا كٰفِرِينَ (Sesungguhnya telah ada segolongsn manusia sebelum kamu menanyakan hal-hal yang serupa itu, kemudian mereka tidak percaya kepadanya) Yakni mereka menanyakan hal yang serupa dari sisi bahwa hal itu tidak butuh untuk ditanyakan, dan bukan merupakan hal asasi dalam agama, kemudian ketika mereka diwajibkan, mereka tidak menjalankannya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "102. Sungguh suatu kaum sebelum kalian telah bertanya seperti demikian tentang sesuatu yang tidak diperlukan, dan ketika mereka diberi jawaban tentang hukumnya, mereka tidak melakukannya karena keberatan, lalu mereka menjadi orang-orang yang ingkar karena tidak mengerjakannya. Kaum tersebut adalah sebagian orang dari Bani Israil. Mereka bertanya baik melalui ucapan maupun keadaan, seperti bertanya tengtang cara hidup pendeta yang mana mereka tidak mengumumkan tuntutan tentang hal itu, namun sebenarnya mereka sudah mengumumkannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh suatu kaum sebelum kalian telah menanyakan itu, kemudian mereka menjadi kafir karena itu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "102. Pertanyaan-peritanyaan ini di mana kamu di larang dariNya, “ sungguh telah ada segolongan manusia sebelum kamu yang menanyakan hal-hal seperti itu.” Artinya, pertanyaan yang mirip dan sejenis dengannya dengan pertanyaan yang di dasari oleh pembangkangan bukan oleh sikap meminta petunjuk, manakala ia di jelaskan kepada mereka dan hadir kepada mereka, “ mereka tidak percaya kepadaNya,” sebagaimana sabda Nabi dalam hadits yang shahih, “apa yang aku larang bagimu, maka jauhilah, apa yang aku perintahkan, maka lakukanlah semampumu, karena yang mencelakakan orang-orang sebelummu adalah banyakNya pertanyaan dan perselisihan mereka terhadap nabi-nabi mereka.” HR. Bukhori : 7288"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 102: Maksudnya setelah diterangkan kepada mereka perkara yang mereka tanyakan itu, mereka tidak menaatinya, kemudian mereka menjadi kafir. Dalam hadits, Rasulullah shallallahu 'alaihi wa sallam bersabda: مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوْهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِيْنَ مَنْ قَبْلَكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلاَفُهُمْ عَلَى أَنْبِيَائِهِمْ . \"Apa yang aku larang, maka jauhilah dan apa yang aku perintahkan maka laksanakanlah semampu kamu. Sesungguhnya binasanya orang-orang sebelum kamu adalah karena mereka banyak bertanya dan karena penentangan mereka terhadap nabi-nabi mereka. (HR. Bukhari dan Muslim) Hadits ini menunjukkan larangan bertanya tentang hal yang tidak dibutuhkannya, demikian juga menunjukkan larangan bertanya dengan maksud ta’annut/takalluf (membebani diri), main-main dan melecehkan.” Oleh karena itu, Zaid bin Tsabit jika ditanya tentang sesuatu ia berkata, “Apakah ini benar terjadi?” Jika mereka mengatakan, “Tidak” maka Zaid bin Tsabit mengatakan, “Tinggalkanlah (pertanyaan itu) sampai benar-benar terjadi.” Banyak bertanya tidaklah menunjukkan baiknya keadaan agama seseorang, dan tidak menunjukkan kewara’annya. Adapun bertanya tentang Al Qur’an atau hadits dalam arti ingin memahami maksudnya, maka tidak mengapa (termasuk juga bertanya tentang hal yang benar-benar terjadi), lain halnya bertanya tentang masalah yang tidak ada habis-habisnya maka dalam hal ini seharusnya dihindari dan dijauhi. Dalam hadits tersebut terdapat isyarat agar kita menyibukkan diri dengan perkara yang lebih penting; yang dibutuhkan saat itu daripada perkara yang saat itu belum dibutuhkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 102",
    "description": "Wahai orang-orang beriman, sesungguhnya suatu kaum sebelum kamu, yaitu kaum yahudi umat nabi musa, sungguh telah memohon kepada nabi musa agar bisa melihat Allah dengan nyata, tetapi setelah permohonan itu dipenuhi, mereka tidak sanggup melihat-Nya dan pingsan. Kemudian mereka menjadi kafir setelah Allah memberikan bukti bahwa mereka tidak akan pernah sanggup melihat Allah ayat ini menjelaskan tentang kaum kafir mekah yang membuatbuat kedustaan kepada Allah. Allah tidak pernah mensyariatkan adanya bahirah, yaitu unta betina yang telah beranak lima kali dan anak yang kelima itu jantan, lalu unta betina itu dibelah telinganya, dilepaskan, tidak boleh ditunggangi lagi, dan tidak boleh diambil air susunya. Allah juga tidak mensyariatkan sa'ibah, yaitu unta betina yang dibiarkan bebas karena suatu nazar. Masyarakat arab jahiliah ketika hendak melakukan sesuatu atau perjalanan jauh biasa bernazar menjadikan unta mereka sa'ibah bila maksud atau perjalanannya berhasil dan selamat. Tidak ada juga syariat tentang washilah, yaitu jika seekor domba betina melahirkan anak kembar dampit, maka anak yang jantan disebut washilah; ia tidak boleh disembelih, melainkan harus dipersembahkan kepada berhala. Allah juga tidak mensyariatkan ha'm, yaitu unta jantan yang tidak boleh diganggu lagi karena telah membuahi unta betina sepuluh kali. Perlakuan terhadap bahirah, sa'ibah, washilah, dan ha'm adalah kepercayaan arab jahiliah; tetapi orang-orang kafir membuat-buat kedustaan terhadap Allah dengan meyakini bahwa semuanya merupakan ketetapan Allah; dan kebanyakan mereka tidak mengerti sedikit pun makna dan maksud dari mitologi tersebut."
  }
]