[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah tidak pernah mensyariatkan bagi kaum Musyrikin aturan yang mereka ada-adakan sendiri terkait binatang-binatang ternak, dengan tidak mau memanfaatkan sebagain binatang itu dan mempersembahkannya bagi berhala-berhala. yaitu bahirah yang diiris telinganya setelah melahirkan beberapa anak, sa’ibah yang dibiarkan bagi berhala-berhala, washilah, betina yang kelahiran anak betinanya terjadi setelah kelahiran anak betina sebelumnya, ham, yaitu pejantan dari unta bila dilahirkan dari tulang sulbinya sekian banyak anak unta. Akan tetapi, orang-orang kafir menisbatkan aturan itu kepada Allah sebagai kedustaan atas NamaNYa. Dan kebanyakan orang kafir tidak bisa memisahkan kebenaran dari kebatilan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "103. Allah menghalalkan hewan ternak, dan Dia tidak pernah mengharamkan hewan ternak yang diharamkan oleh orang-orang musyrik atas diri mereka untuk menghormati berhala-berhala mereka. Seperti hewan baḥīrah (yaitu unta yang dipotong telinganya apabila sudah melahirkan dalam jumlah tertentu), sāibah (yaitu unta yang sudah mencapai usia tertentu akan dibiarkan bebas sebagai persembahan untuk berhala-berhala mereka), waṣīlah (yaitu unta yang melahirkan unta betina kemudian melahirkan unta betina lagi) dan ḥāmī (yaitu unta jantan yang ditugaskan mengawini unta betina sampai melahirkan anak-anak unta dalam jumlah tertentu). Akan tetapi orang-orang kafir telah berdusta dan mengada-ada bahwa Allah telah mengharamkan hewan-hewan tersebut. Dan kebanyakan orang-orang kafir tidak bisa membedakan antara kebenaran dan kebatilan serta halal dan haram."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "103. Allah membatalkan pengharaman yang dilakukan orang-orang jahiliyah pada sesuatu yang dihalalkan Allah yang mereka lakukan dengan penuh kedustaan terhadap-Nya; seperti: 1. Merobek telinga unta betina sebagai tanda bahwa unta itu haram agar tidak ada seorangpun yang mengganggunya. Unta itu dilarang untuk diminum susunya, ditunggangi, atau au diambil bulunya. Unta itu mereka sebut dengan al-bahirah, yaitu unta betina yang telah melahirkan berkali-kali; 2. Unta yang dibiarkan liar karena untuk membayar nazar seseorang yang bernazar: Jika Allah menyelamatkan ku dari penyakit ini atau memberiku kedudukan ini niscaya aku akan melakukan ini; unta ini mereka sebut dengan as-sa'ibah, yaitu unta yang dibiarkan untuk berhala berhala; 3. Al-Wasilah, yaitu unta yang melahirkan dua unta betina secara berturut-turut. 4. Al-Ham, yaitu unta jantan yang memiliki beberapa anak dari hasil pembuahannya Orang-orang kafir menisbatkan perbuatan itu kepada Allah, maka Allah membantah mereka bahwa Dia tidak memberi nama unta-unta itu dan tidak pula mensyariatkan perbuatan itu sebagai suatu hukum atau peribadatan, namun mereka menisbatkan kepada Allah secara dusta. Kebanyakan orang-orang kafir itu tidak mau menggunakan akal mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "103. مَا جَعَلَ اللهُ مِنۢ بَحِيرَةٍ (Allah sekali-kali tidak pernah mensyari’atkan adanya bahiirah) Bahirah merupakan unta betina yang dahulu oleh orang-orang Jahiliyah disobek telinganya dan air susunya dipersembahkan untuk para thaghut, dan tidak ada orang yang boleh memerahnya; dan sobekan ditelinganya merupakan sebagai tanda akan hal itu. وَلَا سَآئِبَةٍ (saaibah) Yaitu unta jantan atau betina yang dibiarkan bebas sebagai bentuk nazar dari seseorang seperti disembuhkan dari suatu penyakit atau bisa sampai ke rumahnya setelah safar; unta ini tidak boleh dilarang untuk makan atau minum dan tidak boleh ditunggangi. وَلَا وَصِيلَةٍ (washiilah) Ada pendapat mengatakan ia adalah unta betina apabila melahirkan anak betina setelah anak betina sebelumnya maka anak itu untuk mereka, dan apa bila melahirkan anak jantan maka anak unta tersebut untuk para sesembahan mereka. وَلَا حَامٍ ۙ (haam) Yakni unta pejantan yang menghasilkan sepuluh anak dari pembuahannya, maka ia tidak boleh ditunggangi, dan tidak boleh dilarang untuk makan atau minum. وَلٰكِنَّ الَّذِينَ كَفَرُوا۟ يَفْتَرُونَ عَلَى اللهِ الْكَذِبَ ۖ (Akan tetapi orang-orang kafir membuat-buat kedustaan terhadap Allah) Yakni mereka mengharamkan hal-hal ini sebagai bentuk peribadatan padahal Allah tidak mengharamkan hal-hal tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "103. Allah tidak mensyariatkan pengharaman atas penduduk Jahiliyah itu Bahirah (yaitu unta betina yang telinganya terbelah, dan susunya dipersembahkan untuk pengorbanan, atau untuk berhala, karena telah beranak sebanyak 5 unta yang semuanya betina kecuali yang terakhir adalah jantan), Saibah (yaitu unta yang dipersembahkan untuk tuhan-tuhan mereka dengan bernazar jika salah satu dari mereka sembuh dari penyakit atau sampai di rumahnya) dan Washilah (yaitu kambing betina yang melahirkan anak kembar jantan dan betina, sehingga dikatakan bahwa kambing betina itu wasilah bagi saudara jantannya), dan Haam (unta jantan yang telah membuat hamil unta betina sebanyak 10 kali, sehingga tidak boleh ditunggangi dan tidak boleh untuk mengangkut barang), akan tetapi orang-orang musyrik Arab itu membuat-buat kebohongan terhadap Allah dengan mengharamkan perkara-perkara ini. Dan kebanyakan mereka itu tidak berpikir bahwa itu adalah rekayasa terhadap Allah dan tindakan yang tidak menggunakan akal dan pikiran"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Allah tidak pernah menetapkan} mensyariatkan {sedikit pun tentang baḥīrah} unta betina yang dipotong telinganya ketika melahirkan beberapa anak dari perutnya {sāi’bah} unta betina yang ditinggalkan untuk dipersembahkan kepada berhala karena untuk membebaskan dari penyakit, dan keselamatan dari kehancuran {waṣīlah} unta betina yang ketika melahirkan unta kembar lalu ditinggalkan untuk dipersembahkan kepada Thagut {dan tidak pula ḥām}unta jantan yang telah dilahirkan ddari tulang sulbinya beberapa anak unta, maka tidak boleh ditunggangi, dan tidak pula untuk membawa barang {Akan tetapi, orang-orang kafir membuat-buat kedustaan terhadap Allah dan kebanyakan mereka tidak mengerti"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "103. Ini adalah celaan terhadap orang-orang musyrik yang membuat syariat dalam agama yang tidak di izinkan oleh Allah. Dan mengharamkan apa yang di halalkan oleh Allah. Dengan akal mereka yang rusak, mereka menjadikan sebagian ternak mereka haram menurut istilah mereka yang menentang apa yang di turunkan oleh Allah FirmanNya, “ Allah sekali-kali tidak pernah mensyariatkan adanya bahirah,” yaitu, unta betina yang di belah telinganya kemudian mereka mengharamkan untuk menaikinya. Menurut mereka ia harus di hormati. “ Sa’ibah,” yaitu, unta atau sapi betina atau domba yang telah mencapai sesuatu yang mereka sepakati. Mereka membiarkanNya, tidak dikendarai, tidak dibebani, dan tidak di makan dan dari sebagain mereka bernadzar menyisihkan sebagain hartanya untuk di jadikan sa’ibah. “ Dan ham.” Yakni, unta jantan yang tidak boleh dikendarai dan dibebani jika ia telah mencapai kondisi yang di kenal di antara mereka. Semua itu di haramkan oleh orang-orang musyrik tanpa bukti dan dalil. Ia hanyalah kedustaan atas Nama Allah yang keluar dari kebodohan dan kedunguan mereka. Oleh karena itu dia berfirman, “ akan tetapi orang-orang kafir membuat-buat kedustaan terhadap Allah, dan kebanyakan mereka tidak mengerti,” tanpa dalil naqli dan tanpa dalil aqli."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 103: Ayat ini merupakan celaan terhadap orang-orang musyrik yang menetapkan aturan agama yang tidak diizinkan Allah, mereka mengharamkan apa yang dihalalkan Allah, mereka mengharamkan binatang ternak berdasarkan pendapat mereka semata. Bahiirah adalah unta betina yang telah beranak lima kali dan anak kelima itu jantan, lalu unta betina itu dibelah telinganya, dilepaskan, tidak boleh ditunggangi lagi dan tidak boleh diambil air susunya. Saaibah adalah unta betina yang dibiarkan pergi ke mana saja karena suatu nazar; tidak ditunggangi, tidak dipakai memikul barang dan tidak disembelih. Seperti, jika seorang Arab Jahiliyah akan melakukan sesuatu atau perjalanan yang berat, maka ia biasa bernazar akan menjadikan untanya saaibah jika maksudnya berhasil atau perjalanannya selamat. Washiilah adalah seekor domba betina melahirkan anak kembar yang terdiri dari jantan dan betina, maka yang jantan ini disebut washiilah, tidak boleh disembelih dan diserahkan kepada berhala. Ada yang berpendapat, bahwa washiilah adalah seekor unta betina yang melahirkan anak betina, kemudian lahir lagi betina tanpa diselangi anak laki-laki. Unta ini d tidak disembelih dan diserahkan kepada berhala. Haam adalah unta jantan yang tidak boleh diganggu lagi, karena telah membuntingkan unta betina beberapa kali. Unta ini sama diserahkan kepada berhala dan dibiarkan tidak ditunggangi dan tidak boleh dipikul barang-barang di atasnya. Binatang-binatang yang disebutkan itu dianggap haram oleh orang-orang musyrik tanpa dalil, bahkan atas dasar dusta yang disandarkan kepada Allah, muncul dari kejahilan mereka dan tidak menggunakan akalnya. Dengan demikian, perbuatan mereka tidak didukung dalil naqli maupun dalil 'aqli. Meskipun begitu, mereka merasa ujub (bangga) dengan pendapat mereka yang tegak di atas kejahilan dan kezaliman."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 103",
    "description": "Ayat ini menjelaskan tentang kaum kafir mekah yang membuatbuat kedustaan kepada Allah. Allah tidak pernah mensyariatkan adanya bahirah, yaitu unta betina yang telah beranak lima kali dan anak yang kelima itu jantan, lalu unta betina itu dibelah telinganya, dilepaskan, tidak boleh ditunggangi lagi, dan tidak boleh diambil air susunya. Allah juga tidak mensyariatkan sa'ibah, yaitu unta betina yang dibiarkan bebas karena suatu nazar. Masyarakat arab jahiliah ketika hendak melakukan sesuatu atau perjalanan jauh biasa bernazar menjadikan unta mereka sa'ibah bila maksud atau perjalanannya berhasil dan selamat. Tidak ada juga syariat tentang washilah, yaitu jika seekor domba betina melahirkan anak kembar dampit, maka anak yang jantan disebut washilah; ia tidak boleh disembelih, melainkan harus dipersembahkan kepada berhala. Allah juga tidak mensyariatkan ha'm, yaitu unta jantan yang tidak boleh diganggu lagi karena telah membuahi unta betina sepuluh kali. Perlakuan terhadap bahirah, sa'ibah, washilah, dan ha'm adalah kepercayaan arab jahiliah; tetapi orang-orang kafir membuat-buat kedustaan terhadap Allah dengan meyakini bahwa semuanya merupakan ketetapan Allah; dan kebanyakan mereka tidak mengerti sedikit pun makna dan maksud dari mitologi tersebut. Dan apabila dikatakan kepada mereka, yakni masyarakat arab jahiliah itu, marilah kita mengikuti apa yang diturunkan Allah berupa alqur'an yang melarang menyembah berhala, dan yang diturunkan kepada rasul berupa ajaran islam dengan beriman kepada Allah dan rasul-Nya, serta menerima kebenaran Al-Qur'an, mereka menjawab dengan perasaan bangga, cukuplah bagi kami apa yang kami dapati dari nenek moyang kami, tradisi yang sudah mengakar pada masyarakat arab. Mereka menutup diri dari kebenaran dan bangga dengan leluhur mereka. Apakah mereka akan mengikuti nenek moyang mereka dengan meneruskan tradisi menyembah berhala dan berbuat kebohongan kepada Allah, walaupun nenek moyang mereka itu tidak mengetahui apa-apa tentang kebenaran dan tidak pula mendapat petunjuk dari Allah'"
  }
]