[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, haruskanlah diri kalian untuk menjalankan ketaatan kepada Allah dan menjauihi larangan-laranganNya, dan konsistenlah dalam keadaan tersebut, meskipun manusia tidak menerima seruan kalian. Maka apabila kalian melaksanakan hal itu, maka kesesatan orang yang sesat tidak memudaratkan diri kalian selama kalian tetap di atas jalan istiqamah dan kalian perintahkan hal yang ma’ruf dan melarang perbuatan mungkar. Kepada Allah tempat kembali kalian semua di akhirat. Dia akan memberitahukan kepada kalian tentang amal perbuatan kalian dan memberikan balasan bagi kalian atas amal-amal itu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "105. Wahai orang-orang yang beriman! Jagalah diri kalian dengan melakukan hal-hal yang berguna. Orang yang tersesat dan tidak mengikuti seruan kalian, mereka tidak akan mendatangkan mudarat bagi diri kalian, jika kalian sendiri telah mengikuti jalan yang benar. Salah satu bukti bahwa diri kalian mengikuti jalan yang benar ialah kalian melakukan amar makruf nahi mungkar. Hanya kepada Allah kalian akan dikembalikan pada hari Kiamat kelak. Kemudian Dia akan memberitahu kalian apa yang pernah kalian perbuat di dunia. Dan Dia akan memberi kalian balasan yang setimpal dengan itu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "105. Setelah Allah menyebutkan kesombongan orang-orang musyrik ketika mendengar kebenaran, maka kemudian Allah menyatakan pemaklumannya bagi kaum muslimin yang menjalankan kewajiban berdakwah kepada kebaikan; karena seorang da'i hanya berkewajiban menyampaikan agama yang benar dengan hujjah-hujjah dan bukti-bukti, namun jika orang-orang tidak mau menerima dakwahnya maka tidak ada dosa baginya, karena hidayah hanya datang dari Allah, sebagaimana yang disebutkan dalam firman-Nya: إنك لا تهدي من أحببت ولكن الله يهدي من يشاء “Sesungguhnya kamu tidak akan dapat memberi petunjuk kepada orang yang kamu kasihi, tetapi Allah memberi petunjuk kepada orang yang dikehendaki-Nya.” (Al-Qashash: 56) Allah meminta hamba-hamba-Nya yang beriman agar menempuh cara Al-quran dalam mengajak kebaikan dan melarang kemungkaran. Dan janganlah mereka mengikuti jalan orang-orang yang menyelisihi Allah, yaitu orang-orang yang menganut nenek moyang mereka yang tidak memiliki hidayah maupun tuntunan. Hai orang-orang beriman, tetaplah kalian menjalankan dakwah; dan kesesatan orang-orang musyrik dan keberpalingan orang-orang kafir tidak akan membawa mudharat bagi kalian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "105. عَلَيْكُمْ أَنفُسَكُمْ ۖ (jagalah dirim) Yakni jagalah diri kalian dan jangan pedulikan orang lain. لَا يَضُرُّكُم(tiadalah akan memberi mudharat kepadamu) Yakni kesesatan itu tidak akan memberi kalian mudharat. مَّن ضَلَّ(orang yang sesat) Dari manusia. إِذَا اهْتَدَيْتُمْ ۚ( apabila kamu telah mendapat petunjuk) Yakni dalam diri kalian. Ayat ini adalah bagi orang yang tidak mampu menegakkan kewajiban amar ma’ruf nahi munkar, dan telah yakin hal itu tidak akan memberi efek bagaimanapun juga, atau ia khawatir terhadap dirinya akan mendapat madharat, maka dibolehkan baginya keninggalkan kewajiban ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "105. Wahai orang-orang mukmin, perbaikilah diri kalian dengan mendekatkan diri kepada Allah SWT, membimbing orang yang tidak tahu, memerintahkan kebaikan dan mencegah kemungkaran. Jika kalian melakukan hal itu, niscaya orang yang tersesat tidak akan membahayakan kalian, jika kalian sudah mendapatkan petunjuk. Hanya kepada Allahlah tempat kembali kalian semua pada hari kiamat, lalu Dia akan memberitahu kalian tentang amal kalian lalu membalas kalian atas amal tersebut. Ayat ini turun ketika Nabi SAW menerima pajak dari ahli kitab dan orang Majusi, lalu karena heran dengan nabi Muhammad, orang-orang munafik Arab berkata dan beranggapan bahwa Allah telah memerintahkannya untuk memerangi seluruh manusia sampai mereka masuk Islam. Dan dia tidak menerima pajak kecuali dari ahli kitab. Kami tidak mendapatinya kecuali menerima dari orang-orang Musyrik ahli Hajar sesuatu yang ditolak dari orang-orang musyrik Arab, lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, jagalah diri kalian} kalian harus menjaga dan memperbaiki diri kalian {orang yang sesat itu tidak akan membahayakan kalian apabila kalian telah mendapat petunjuk. Hanya kepada Allah tempat kembali kalian semua, lalu Dia akan menerangkan kepada kalian} memberi kabar kalian {apa yang selama ini kalian kerjakan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "105. Firman Allah, “ Hai orang-orang yang beriman, jagalah diriMu,” maksudnya, bersungguh-sungguhlah dalam memperbaiki, menyempurnakan, dan mengharuskanNya berjalan di atas jalan yang lurus. Karena jika kamu baik, maka kamu tidak terkenal mudharat oleh orang-orang yang tersesat dari jalan yang lurus dan tidak mendapatkan petunjuk kepada agama yang benar, dia hanya merugikan diriNya sendiri. Ini tidak menunjukan bahwa meninggalkan amal ma'rup dan nahyi mungkar tidak merugikan seorang hamba, karena hidayahnya tidak sempurna kecuali dengan melakukan amal ma’rup dan nahyi mungkar yang wajib atasnya. Benar, jia dia tidak mampu mengingkari yang mungkar dengan tangan dan lisanNya lalu dia mengingkariNya dengan hatiNya, maka kesesatan orang lain tidak merugikanNya. FimanNya, “ Hanya kepada Allah kamu semuanya kembali,” yakni tempat berkumpulmu pada Hari Kiamat adalah di hadapan Allah. “ Maka Dia akan menerangkan kepadamu apa yang telah kamu kerjakan,” yang baik atau yang buruk."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 105: Yakni berusahalah memperbaiki dirimu, menyempurnakannya dan tetap berada di atas jalan yang lurus. Apabila kamu telah berada di atas jalan yang lurus, maka tidaklah membahayakan kamu orang yang tersesat, ia hanyalah membahayakan dirinya sendiri. Akan tetapi tidaklah berarti bahwa orang lain kemudian tidak disuruh berbuat yang ma'ruf dan mencegah dari yang munkar. Amr ma'ruf dan nahi munkar menjadi tidak wajib adalah ketika kekikiran ditaati oleh manusia, dunia diutamakan dan masing-masing manusia bangga dengan pendapatnya, sehingga amr ma'ruf tidak dipedulikan lagi. Akan tetapi, tetap beramr ma'ruf dan bernahi munkar adalah lebih utama."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 105",
    "description": "Dalam ayat ini ditegaskan agar orang-orang beriman memiliki keteguhan sikap dalam beragama. Wahai orang-orang yang beriman! jagalah dirimu dari kebodohan dan pembangkangan dengan memperkuat ilmu dan amal, serta memperhatikan kualitas iman dan ketaatan kepada Allah; karena orang yang sesat itu, karena kebodohannya, tidak akan sanggup membahayakanmu dengan menjadikan kamu tergelincir, apabila kamu telah mendapat petunjuk dari Allah dan kamu mengikuti petunjuk ini dengan teguh. Hanya kepada Allah kamu semua akan kembali pada hari kiamat, kemudian dia akan menerangkan kepadamu semua yang kamu lakukan dengan menampilkan catatan amal secara lengkap dan menyeluruh sehingga terinci apa yang telah kamu kerjakan selama hidup di dunia. Allah menekankan kejujuran dalam menerima dan melaksanakan wasiat. Wahai orang-orang yang beriman! perhatikanlah pesan ini. Apabila tanda-tanda kematian sudah dekat kepada salah seorang di antara kamu dengan melihat dan merasakan tanda-tanda tersebut, sedang dia akan berwasiat kepada ahli waris tentang harta, maka hendaklah wasiat itu disaksikan oleh dua orang yang adil di antara kamu, kaum kerabat yang sama-sama muslim; atau dua orang yang berlainan agama dengan kamu, jika tidak ada kaum kerabat yang sama-sama muslim. Hal ini terutama, jika kamu dalam perjalanan di bumi, baik perjalanan bisnis maupun perjalanan sosial, lalu kamu ditimpa kematian dalam perjalanan tersebut; maka hendaklah kamu, wahai orang-orang beriman! menahan kedua saksi itu yang menghadap kamu menjelang waktu salat menunggu hingga usai salat di masjid agar keduanya bersumpah dengan nama Allah di hadapan orang banyak, jika kamu ragu-ragu atas kejujuran kedua saksi itu, demi Allah kami tidak akan mengambil keuntungan dengan sumpah ini, sekecil apa pun, walaupun dia karib kerabat, dan kami tidak menyembunyikan sesuatu pun dalam kesaksian atas nama Allah ini; sesungguhnya jika demikian, yakni menyembunyikan sesuatu dalam kesaksian ini, tentu kami termasuk orang-orang yang berdosa kepada Allah dan berbuat jahat kepada ahli waris."
  }
]