[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta melaksanakan syariatNya, apabila telah dekat datangnya kematian kepada salah seorang diantara kalian, hendaknya dia mempersaksikan kepada dua orang terpecaya dari kaum Muslimin atas wasiatnya maupun dua orang dari selain kaum Muslimin dalam keadaan mendesak dan tidak ada orang selain mereka berdua dari kalangan kaum Muslimin, yang mana kalian mempersaksikan kepada mereka berdua ketika kalian dalam perjalanan jauh di muka bumi, lalu kematian datang kepada kalian. Dan apabila kalian meragukan persaksian mereka berdua, tahanlah mereka berdua dulu setelah shalat, (maksudnya shalat kaum Muslmin terutama shalat Ashar), kemudian mereka berdua bersumpah atas nama Allah dengan sumpah yang ikhlas, tanpa mengharapakan imbalan duniawi, dan tidak pula bersikap melunak dihadapan kaum kerabat mereka berdua, serta tidak menyembunyikan persaksian yang ada pada mereka karena Allah, dan sesungguhnya bila mereka melakukan hal-hal tersebut, maka mereka berdua termasuk orang-orang yang berbuat dosa,"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "106. Wahai orang-orang yang beriman! Apabila kematian salah seorang di antara kalian sudah dekat, ditandai dengan munculnya salah satu dari tanda-tanda kematian, maka hendaklah dia mempersaksikan wasiatnya kepada dua orang muslim yang adil atau dua orang kafir manakala dibutuhkan jika tidak ada dua orang muslim. Hal itu bila kalian bepergian kemudian ajal datang menjemput. Dan jika kalian ragu akan kesaksian kedua orang saksi itu, maka tahanlah keduanya sesudah salat. Kemudian mintalah keduanya bersumpah demi Allah bahwa keduanya tidak akan menjual pahala mereka dari Allah dengan imbalan apa pun, tidak akan berpihak kepada salah satu kerabat, dan tidak akan menyembunyikan kesaksian mereka demi Allah. Dan jika keduanya melakukan hal tersebut, mereka akan tergolong orang-orang yang berdosa dan durhaka kepada Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "106. Allah memberi petunjuk kepada hamba-hamba-Nya yang beriman menuju apa yang dapat membawa kebahagiaan kehidupan di dunia, terlebih lagi dalam perkara wasiat ketika ajal akan menjemput. Jika seseorang dalam keadaan safar, kemudian merasa ajalnya telah dekat; maka hendaklah dia mencari dua saksi yang memiliki agama yang kuat untuk menyampaikan amanah wasiat kepada mereka. Namun jika dia tidak dapat menemukan dua muslim yang dikenal sebagai orang yang amanah, maka tidak mengapa dia mencari dua orang yang bukan muslim ketika benar-benar harus menulis wasiat. Jika kalian ragu terhadap kejujuran dan kesaksian mereka berdua maka mintalah mereka berdua untuk berdiri di depan kaum muslimin setelah shalat ashar untuk bersumpah dengan nama Allah bahwa mereka menjadi saksi tanpa mendapat balasan duniawi dan bukan karena ada hubungan kekerabatan, dan bersumpah bahwa mereka berdua tidak akan menyembunyikan sedikitpun dari kesaksian itu."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "106. يٰٓأَيُّهَا الَّذِينَ ءَامَنُوا۟ شَهٰدَةُ بَيْنِكُمْ (Hai orang-orang yang beriman bersaksilah diantara kalian) Ayat ini serta dua ayat selanjutnya merupakan ayat-ayat yang paling sulit dalam al-qur’an untuk dijelaskan baik itu secara tata bahasa maupun hukum yang dikandungnya. Makna (الشهادة) yakni persaksian yang disampaikan oleh para saksi. إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ (apabila salah seorang kamu menghadapi kematian) Yakni telah datang tanda-tandanya. حِينَ الْوَصِيَّةِ اثْنَانِ (ketika dia akan berwasiat, oleh dua orang) Yakni persaksian dua orang. ذَوَا عَدْلٍ مِّنكُمْ (yang adil di antara kamu) Yakni dari orang-orang beriman. أَوْ ءَاخَرَانِ مِنْ غَيْرِكُمْ (atau dua orang yang berlainan agama dengan kamu) Yakni dari orang kafir. Ayat ini merupakan dalil dibolehkannya persaksian orang kafir atas orang beriman dalam urusan wasiat ketika dalam keadaan safar. إِنْ أَنتُمْ ضَرَبْتُمْ فِى الْأَرْضِ (jika kamu dalam perjalanan dimuka bumi) Yakni pada saat melakukan safar. فَأَصٰبَتْكُم مُّصِيبَةُ الْمَوْتِ ۚ (lalu kamu ditimpa bahaya kematian) Yakni apabila turun musibah kematian dan kalian menginginkan untuk berwasiat namun kalian tidak mendapatkan saksi dari kalangan orang-orang beriman. –lalu kalian mengambil dua saksi dari orang kafir—, kemudian keduanya pergi kepada ahli waris membawa wasiat dan peninggalan si masit, namun mereka ragu terhadap keduanya dan menuduh mereka berkhianat. تَحْبِسُونَهُمَا مِنۢ بَعْدِ الصَّلَوٰةِ (Kamu tahan kedua saksi itu sesudah sembahyang (untuk bersumpah)) Yakni tahanlah keduanya untuk bersumpah setelah shalat ashar. Pendapat lain mengatakan: setelah shalat apapun. فَيُقْسِمَانِ بِاللهِ(lalu mereka keduanya bersumpah dengan nama Allah) Yakni kedua saksi dari orang kafir tersebut bersumpah dengan nama Allah atas wasiat itu. إِنِ ارْتَبْتُمْ(jika kamu ragu-ragu) Yakni kalian ragu bahwa keduanya itu berbohong. لَا نَشْتَرِى بِهِۦ ثَمَنًا(“(Demi Allah) kami tidak akan membeli dengan sumpah ini harga yang sedikit) Yakni kami berdua bersumpah dengan nama Allah bahwa kami tidak sedang menjual kebaikan dari Allah dengan hal yang remeh ini, sehingga membuat kami bersumpah secara bohong, demi harta yang kalian tuduhkan pada kami ini. وَلَوْ كَانَ ذَا قُرْبَىٰ ۙ (walaupun dia karib kerabat) Yakni meski orang yang diberi kesaksian merupakan kerabatnya, tapi kami tetap memilih untuk berkata benar dan jujur. وَلَا نَكْتُمُ شَهٰدَةَ اللهِ (dan tidak (pula) kami menyembunyikan persaksian Allah) Ini merupakan termasuk dari permasalahan yang dipersaksikan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "106. Wahai orang-orang mukmin, jika tanda-tanda kematian telah tiba (atas seseorang), maka harus ada kesaksian oleh dua orang muslim yang adil dan mengerti atas wasiatnya, atau kesaksian dua orang lain yang tidak muslim yang sedang berpergian. Kalian (selayaknya) menahan kedua orang itu untuk bersaksi setelah shalat ashar jika keduanya muslim, dan jika tidak muslim maka tungguh setelah sembahyang keduanya. Itu merupakan waktu yang ditakuti untuk berdusta, dan jika kalian (masih) meragukan keduanya, maka sebaiknya mereka bersumpah demi Allah “Kami tidak mengganti nasib (baik) kami dari Allah SWT dengan kerendahan dunia atau kami tidak mengganti kebenaran sumpah dengan hal sampingan yang bersifat keduniaan, jadi kami tidak akan berdusta untuk mendapatkan harta yang akan diklaim, meskipun yang bersaksi itu adalah kerabat. Kami juga tidak akan merahasiakan persaksian Allah yang benar yang telah diperintahkan, jika kami melakukan hal itu, maka kami termasuk orang-orang yang bermaksiat”. Ayat ini turun untuk dua laki-laki Nasrani yang terus berbolak-balik berniaga di Mekah. Keduanya ditemani seorang Quraisy dari Bani Sahm, lalu dia sekarat di (tengah) perjalanan dan mewasiati keduanya dengan suatu harta wasiat, kemudian keduanya memberikan wasiat itu kepada keluarganya, dan menyembunyikan satu cangkir (gelas) perak yang dihias dengan emas, lalu cangkir itu didapati oleh suatu kaum dari penduduk Mekah, meskipun keduanya telah bersumpah di hadapan Nabi SAW bahwa keduanya tidak menyembunyikannya dan tidak mengetahuinya. Lalu para kerabat dari Bani Sahm mengambilnya dan dua orang dari mereka bersumpah demi Allah “Sesungguhnya cangkir ini adalah cangkir sahabat kami, dan kesaksian kami lebih benar daripada kesaksian dua orang itu, dan kami tidaklah bersalah” Lalu turunlah ayat ini"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, kesaksian} bersaksilah {di antara kalian, apabila telah datang} telah dekat {kepada salah seorang dari kalian kematian, ketika akan berwasiat, ada dua orang yang adil di antara kalian} dari orang-orang muslim {atau dua orang selain kalian} orang non muslim {jika kalian dalam perjalanan} sedang dalam perjalanan {di bumi lalu kalian ditimpa kematian. Tahanlah kedua saksi itu} mintalah keduanya untuk berhenti {setelah shalat agar keduanya bersumpah} bersumpah {dengan nama Allah, jika kalian ragu} ragu dalam kesaksian keduanya {“Kami tidak akan mengambil dengan sumpah ini suatu keuntungan} Kami tidak akan menjual nasib kami dari Allah dengan ganti harta dunia yang bisa kami ambil {walaupun dia karib kerabat} meskipun yang orang yang diberi kesaksian memiliki hubungan kerabat dengan kami {dan kami tidak menyembunyikan kesaksian Allah. Sesungguhnya jika demikian tentu kami termasuk orang-orang yang berdosa.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "106. Allah memberitakan sekaligus memerintahkan untuk menghadirkan dua orang saksi atas wasiat, jika tanda-tanda kematian sudah mendatangi seseorang, hendaknya wasiatNya di tulis dengan kesaksian dua orang yang adil di mana keduanya termasuk orang yang kesaksiannya di terima. “ Atau ada dua orang yang berlainan agama dengan kamu,” yakni dari pemeluk agama lain, Yahudi atau Nasrani atau selainnya. Hal itu dalam kondisi mendesak dan tidak adanya kaum Muslimin. “ jika kamu dalam perjalanan di muka bumi lalu kamu di timpa bahaya kematian.” Maksudnya, jadikan keduanya sebagai saksi. Allah tidak memerintahkan agar keduanya di angkat menjadi saksi kecuali karena ucapan keduanya dalam kondisi tersebut memang di terima. Di tegaskan kepada keduanya dengan cara keduanya di tahan, “ sesudah sembahyang untuk bersumpah,” yang mereka agungkan, “ lalu mereka keduanya bersumpah dengan Nama Allah,” bahwa keduanya jujur, tidak merubah dan tidak menganti. Ini “ jika kamu ragu-ragu” terhadap kesaksian keduanya. Jika kamu mempercayai keduanya, maka tidak perlu bersumpah dengan cara itu. Keduanya berkata, “ (Demi Allah) kami tidak akan menukar sumpah ini,” yakni sumpah kami “ dengan harga yang sedikit untuk kepentingan seseorang,” dengan cara berdusta untuk mendapatkan harta dunia. “Walaupun dia karib kerabat,” kami tidak memandangNya hanya karena kedekatan kepada kami. “Dan tidak pula kami menyembunyikan persaksian Allah,” justru kami menunaikannya seperti yang kami dengar. “ Sesungguhnya kami kalau demikian.” Yakni kalau kami menyembunyikan, “ tentulah termasuk orang-orang yang berdusta.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 106: Imam Bukhari meriwayatkan dari Ibnu Abbas ia berkata, \"Ada seorang dari Bani Sahm keluar bersafar bersama Tamim Ad Daariy (sewaktu Tamim belum masuk Islam) dan 'Addiy bin Badaa', lalu orang yang berasal dari Bani Sahm itu meninggal di negeri yang tidak terdapat seorang muslim. Ketika Tamim dan Addiy datang membawa harta peninggalannya, mereka kehilangan wadah dari perak yang berukiran daun pohon kurma dari emas, maka Rasulullah shallallahu 'alaihi wa sallam membuat mereka bersumpah, kemudian wadah itu ditemukan di Mekah, mereka berkata, \"Kami membelinya dari Tamim Ad Daariy dan Addiy.\" Lalu dua orang wali dari orang Bani Sahm itu bangkit dan bersumpah dengan mengatakan, \"Sesungguhnya persaksian kami lebih berhak (diterima) dari persaksian mereka berdua,\" dan wadah itu diberikan kepada saudara mereka. Kepada merekalah turun ayat, \"Yaa ayyuhalladziina aamanuu syahaadatu bainikum idzaa hadhara ahadakumul mautu...dst.\" Dalam ayat ini, Allah Subhaanahu wa Ta'aala memerintahkan mengangkat dua orang saksi terhadap wasiat yang hendak dibuat ketika seseorang kedatangan tanda-tanda kematiannya. Mengambil orang lain yang tidak seagama dengan sebagai saksi dibolehkan, jika tidak ada orang Islam yang akan dijadikan saksi. Yakni setelah shalat 'Ashar, di mana bermaksiat di waktu itu dosanya lebih besar. Di dalam hadits riwayat Muslim disebutkan: « ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ حَلَفَ عَلَى يَمِينٍ بَعْدَ صَلاَةِ الْعَصْرِ عَلَى مَالِ مُسْلِمٍ فَاقْتَطَعَهُ » . \"Ada tiga orang yang tidak diajak bicara oleh Allah, tidak diperhatikan-Nya dan bagi mereka azab yang pedih; seseorang yang bersumpah setelah shalat Ashar terhadap harta seorang muslim, lalu ia mengambilnya.\" Terhadap persaksian itu. Jika yakin (tidak meragukan persaksian itu), maka tidak perlu diadakan sumpah. Bahkan kami akan menyampaikannya sesuai yang kami ketahui atau kami dengar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 106",
    "description": "Allah menekankan kejujuran dalam menerima dan melaksanakan wasiat. Wahai orang-orang yang beriman! perhatikanlah pesan ini. Apabila tanda-tanda kematian sudah dekat kepada salah seorang di antara kamu dengan melihat dan merasakan tanda-tanda tersebut, sedang dia akan berwasiat kepada ahli waris tentang harta, maka hendaklah wasiat itu disaksikan oleh dua orang yang adil di antara kamu, kaum kerabat yang sama-sama muslim; atau dua orang yang berlainan agama dengan kamu, jika tidak ada kaum kerabat yang sama-sama muslim. Hal ini terutama, jika kamu dalam perjalanan di bumi, baik perjalanan bisnis maupun perjalanan sosial, lalu kamu ditimpa kematian dalam perjalanan tersebut; maka hendaklah kamu, wahai orang-orang beriman! menahan kedua saksi itu yang menghadap kamu menjelang waktu salat menunggu hingga usai salat di masjid agar keduanya bersumpah dengan nama Allah di hadapan orang banyak, jika kamu ragu-ragu atas kejujuran kedua saksi itu, demi Allah kami tidak akan mengambil keuntungan dengan sumpah ini, sekecil apa pun, walaupun dia karib kerabat, dan kami tidak menyembunyikan sesuatu pun dalam kesaksian atas nama Allah ini; sesungguhnya jika demikian, yakni menyembunyikan sesuatu dalam kesaksian ini, tentu kami termasuk orang-orang yang berdosa kepada Allah dan berbuat jahat kepada ahli waris. Jika terbukti kedua saksi itu berbuat dosa, ini berkaitan dengan dua orang nasrani, tamim ad-da'riy dan 'adiy bin badda, yang menerima wasiat dari budail yang wafat waktu berdagang di syam dan berbohong dalam persaksiannya dengan bersumpah palsu di hadapan nabi Muhammad; maka dua orang yang lain, yaitu dua orang saksi dari keluarga yang meninggal, menggantikan kedudukannya menjadi dua saksi, yaitu dua saksi yang termasuk di antara ahli waris yang berhak menjadi saksi dan lebih dekat hubungan nasabnya kepada yang meninggal, lalu keduanya bersumpah dengan nama Allah, dengan disaksikan oleh orang banyak, sungguh, kesaksian kami lebih layak diterima daripada kesaksian kedua saksi itu, tamim ad-da'riy dan 'adiy bin badda yang berbeda agama dan menyembunyikan barang milik budail, dan kami, dua saksi dari keluarga yang meninggal, tidak melanggar batas dalam kesaksian ini. Sesungguhnya jika kami berbuat demikian, curang dan tidak adil, tentu kami termasuk orang-orang zalim terhadap diri sendiri."
  }
]