[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudia apabila wali-wali mayit mendapati dua saksi yang disebutkan itu telah berbuat dosa dengan melakukan pengkhianatan dalam persaksian atau wasiat, maka hendaknya ada dua orang wali-wali mayit yang menggantikan posisi mereka berdua, lalu keduanya bersumpah dengan nama Allah (dan mengatakan) ”persaksian kami yang jujur ini lebih pantas untuk diterima daripada persaksian dusta mereka berdua, dan kami tidaklah melanggar garis kebenaran dalam persaksian kami. Sesungguhnya kami apabila kami bertindak aniaya dan menyampaikan persaksian yang tidak sesuai dengan fakta kebenaran, benar-benar termasuk orang-orang yang berbuat kezhaliman lagi melampaui batas-batasan Allah”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "107. Jika sesudah pengambilan sumpah itu keduanya menunjukkan kebohongan dalam kesaksiannya atau sumpahnya, atau memperlihatkan gejala pengkhianatan, maka sebaiknya ada dua orang dari lingkungan terdekat si mayat yang menggantikan keduanya untuk bersaksi atau bersumpah atas hal yang sebenarnya. Lalu keduanya bersumpah dengan nama Allah, sesungguhnya kesaksian kami atas kebohongan dan pengkhianatan kedua orang itu lebih benar daripada kesaksian keduanya atas kejujuran dan amanah mereka berdua. Kami tidak melakukan sumpah palsu. Sungguh jika kami memberikan kesaksian palsu niscaya kami akan termasuk ke dalam golongan orang-orang zalim yang melanggar larangan Allah."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "107. Namun jika terbongkar bahwa kedua saksi yang telah bersumpah itu berhak mendapatkan dosa karena berdusta, menyembunyikan kesaksian, atau berkhianat dan mengambil sebagian harta warisan yang diamanahkan kepada mereka; maka hendaklah dua orang yang lain dari ahli waris si mayit mengganti posisi mereka, dan dua orang pengganti ini harus dari ahli waris yang paling dekat dengan mayit -yakni sebisa mungkin orang yang paling dekat dan paling berhak mendapatkan warisannya-, maka dua orang ini harus bersumpah dengan nama Allah bahwa kesaksian dua saksi yang berkhianat atas wasiat si mayit itu tidak benar, dan tuduhan kami ini bukankah tuduhan yang batil, dan kami tidak melanggar kebenaran; dan jika kami melanggar kebenaran dan mengatakan tuduhan batin maka sungguh kami termasuk orang-orang yang zalim."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "107. فَإِنْ عُثِرَ عَلَىٰٓ أَنَّهُمَا اسْتَحَقَّآ إِثْمًا (Jika diketahui bahwa kedua (saksi itu) membuat dosa) Yakni apabila diketahui setelah persaksian dua saksi tersebut bahwa keduanya berbuat dosa dengan berbohong saat bersaksi atau bersumpah, atau terdapat pengkhianatan. فَـَٔاخَرَانِ يَقُومَانِ مَقَامَهُمَا(maka dua orang yang lain menggantikannya) Maka dua orang lain menggantikan posisi dua orang sebelumnya untuk bersaksi atau bersumpah sesuai dengan kebenaran. مِنَ الَّذِينَ اسْتَحَقَّ عَلَيْهِمُ الْأَوْلَيٰنِ(dari ahli waris yang berhak yang lebih dekat kepada orang yang meninggal (memajukan tuntutan)) Yakni dari orang terdekat si mayit. فَيُقْسِمَانِ بِاللهِ(lalu keduanya bersumpah dengan nama Allah) Yakni bersumpah atas dua saksi dari orang kafir tersebut bahwa dua orang ini telah berbohong dan berkhianat. أحق من شهادتهما (lebih benar daripada persaksian mereka berdua) Yang mengaku bahwa keduanya benar dan amanah. وَمَا اعْتَدَيْنَآ (dan kami tidak melanggar batas) Yakni kami tidak melakukan sumpah ini untuk berbohong atas mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "107. Jika setelah bersumpah didapati bahwa kedua saksi itu telah melakukan dosa, yaitu pengkhianatan atau kebohongan dalam bersaksi atau bersumpah, maka yang berhak bersaksi dan bersumpah dengan benar yaitu dua saksi lainnya dari ahli waris yang berhak atas wasiat dan termasuk kerabat dari mayit yang menempati posisi dua saksi sebelumnya. Lalu keduanya bersumpah demi Allah bahwa “Sungguh sumpah kami lebih benar daripada sumpah dua saksi itu, dan kami tidak melanggar kebenaran dalam sumpah. Dan sungguh jika kami melanggarnya dengan berkhianat atau berdusta, yaitu kami berdusta, maka kami termasuk orang-orang yang menzalimi diri sendiri"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Jika terbukti} terbukti setelah bersumpah {kedua saksi itu berbuat} memperkenankan {perbuatan dosa} pengkhianatan {maka dua orang yang lain menggantikan kedudukannya, di antara orang-orang yang berhak yaitu ahli waris} maka dua laki-laki lain dari kerabat orang yang mati yang berhak atas wasiat berdiri menggantikan kedudukan dua orang yang saksi itu {lalu keduanya bersumpah dengan nama Allah, “Sungguh kesaksian kami lebih layak} lebih benar dan lebih pasti {daripada kesaksian kedua saksi itu, dan kami tidak melanggar batas} Kami tidak melanggar batas kebenaran dalam sumpah kami {Sesungguhnya jika demikian, tentu kami termasuk orang-orang yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "107. “Jika di ketahui bahwa keduaNya.” Yakni, kedua orang saksi itu “berbuat dosa” dengan terciumnya indikasi kebohongan dan penghianatan. “maka dua orang yang lain di antara ahli waris yang berhak yang lebih dekat kepada orang yang meninggal memajukan tuntutan untun menggantinya.” Maksudnya, ada dua orang dari keluarga mayit yang mana keduanya termasuk keluarga yang paling dekat dengan mayit. “lalu keduanya bersumpah dengan Nama Allah, ‘Sesungguhnya persaksian kami lebih layak di terima daripada persaksian kedua saksi itu’.” Yakni kedua orang saksi itu telah berdusta, merubah dan berkhianat. “Dan kami tidak melanggar batas, sesugguhnya kami kalau demikian tentulah termasuk orang-orang yang menganiaya diri sendiri,” yaitu, jika kami berbuat zhalim, melampui batas, dan bersaksi tanpa kebenaran."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 107: Yakni diketahui berdasarkan qarinah (tanda) yang menunjukkan keduanya berdusta dan berkhianat. Maksudnya melakukan khianat (kecurangan) dalam persaksiannya atau berdusta, misalnya mengaku bahwa keduanya telah melakukan transaksi jual beli dengan si mati sebelum matinya atau mengaku bahwa si mati telah berwasiat untuk mereka berdua. Yakni hendaknya dua orang dari wali yang terdekat dengan si mati bangkit lalu bersumpah bahwa kedua saksi itu telah berdusta, telah merubah wasiat (pesan si mati) dan berkhianat. Pengkhususan sumpah yang diambil dari dua orang kerabat terdekat adalah karena masalahnya yang khusus, yaitu sebagaimana dalam hadits yang diriwayatkan oleh Bukhari, bahwa ada seorang dari Bani Sahm keluar safar bersama Tamim Ad Dariy dan Addi bin Baddaa', di mana keduanya adalah orang Nasrani, maka orang yang berasal dari Bani Sahm itu wafat di negeri yang tidak terdapat seorang muslim. Ketika keduanya datang membawa tarikahnya (harta peninggalannya), keluarganya kehilangan sebuah wadah dari perak yang berukiran daun pohon kurma dari emas, maka keduanya melaporkan kepada Nabi shallallahu 'alaihi wa sallam, sehingga turunlah ayat di atas, lalu Beliau menyuruh mereka berdua bersumpah, kemudian wadah itu pun ditemukan di Mekah, dan orang yang memegang wadah itu berkata, \"Kami membelinya dari Tamim dan Addi\", maka turunlah ayat setelahnya. Kemudian bangkitlah dua orang wali orang Bani Sahm yang meninggal itu dan keduanya bersumpah. Dalam sebuah riwayat Tirmidzi disebutkan, \"Amr bin 'Ash dan yang lain dari mereka bangkit, lalu bersumpah, di mana keduanya adalah kerabat terdekat si mati.\" Dalam riwayat lain disebutkan lebih jelas, \"Maka orang dari Bani Sahm itu sakit dan mewasiatkan kepada dua orang itu (Tamim dan Addi) agar menyampaikan harta yang ditinggalkannya kepada keluarganya. Ketika orang itu telah wafat, maka kedua orang itu mengambil wadah dan menyerahkan selebihnya kepada keluarganya.\" Yakni bersaksi namun isinya tidak benar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 107",
    "description": "Jika terbukti kedua saksi itu berbuat dosa, ini berkaitan dengan dua orang nasrani, tamim ad-da'riy dan 'adiy bin badda, yang menerima wasiat dari budail yang wafat waktu berdagang di syam dan berbohong dalam persaksiannya dengan bersumpah palsu di hadapan nabi Muhammad; maka dua orang yang lain, yaitu dua orang saksi dari keluarga yang meninggal, menggantikan kedudukannya menjadi dua saksi, yaitu dua saksi yang termasuk di antara ahli waris yang berhak menjadi saksi dan lebih dekat hubungan nasabnya kepada yang meninggal, lalu keduanya bersumpah dengan nama Allah, dengan disaksikan oleh orang banyak, sungguh, kesaksian kami lebih layak diterima daripada kesaksian kedua saksi itu, tamim ad-da'riy dan 'adiy bin badda yang berbeda agama dan menyembunyikan barang milik budail, dan kami, dua saksi dari keluarga yang meninggal, tidak melanggar batas dalam kesaksian ini. Sesungguhnya jika kami berbuat demikian, curang dan tidak adil, tentu kami termasuk orang-orang zalim terhadap diri sendiri. Dengan cara itu, dua saksi yang termasuk di antara ahli waris yang berhak menjadi saksi dan lebih dekat hubungan nasabnya dengan almarhum, lebih patut memberikan kesaksiannya menurut yang sebenarnya, bahwa kendi emas itu milik budail sebagaimana tercantum dalam surat wasiat yang disisipkan pada barang-barang yang dititipkan kepada dua teman bisnisnya yang beragama nasrani; dan mereka, tamim ad-da'riy dan 'adiy bin badda, merasa takut sumpahnya yang palsu akan dikembalikan kepada ahli waris, yakni dikonfrontir dengan sumpah mereka, setelah mereka bersumpah dengan benar di hadapan rasulullah. Sumpah saksisaksi yang berlainan agama itu ditolak dengan bersumpahnya saksisaksi yang terdiri dari kerabat. Orang-orang yang bersumpah itu akan mendapat balasan di dunia dan akhirat. Bertakwalah kepada Allah, wahai orang-orang yang beriman, dan dengarkanlah dengan saksama perintah-Nya. Dan Allah tidak memberi petunjuk kepada orang-orang yang fasik, yakni para pelaku dosa besar untuk kembali kepada yang lurus, karena sikap mereka yang terus-menerus berbuat dosa besar sehingga kalbu mereka tertutup."
  }
]