[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ketetapan hukum ketika muncul kecurigaan terhadap dua saksi tersebut, dalam bentuk bersumpah setelah shalat dan tidak menerima persaksian keduanya, lebih dekat untuk mendatangkan persaksian menurut apa yang sebenarnya, dikarenakan takut akan siksaan akhirat atau kekhawatiran ditolaknya sumpah-sumpah dusta oleh orang-orang yang benar setelah sumpahnya, maka terbongkarlah dari orang-orang yang berdusta yang ditolak sumpahnya di dunia ketika pengkhiantannya terkuak. Dan takutlah kalian kepada Allah (wahai sekalain manusia) dan hendaklah kalian selalu merasa di awasi olehNya agar kalian tidak bersumpah dengan dusta dan tidak mengambil harta haram dengan sumpah-sumpah kalian. Dan dengarkanlah nasihat yang dituju kepada kalian. Dan Allah tidak memberi hidayah kepada orang-orang yang fasik yang telah keluar dari jalur ketaatan kepadaNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "108. Hal tersebut yakni meminta dua orang saksi bersumpah sesudah salat ketika ada keraguan terhadap kesaksian keduanya dan penolakan atas kesaksian kedua saksi itu, lebih dekat untuk membuat kedua saksi tersebut memberikan kesaksian dengan cara yang dibenarkan oleh syariat. Sehingga keduanya tidak mengubah maupun mengkhianati kesaksian mereka. Dan juga lebih dekat untuk membuat kedua saksi itu khawatir kalau-kalau kesaksian keduanya ditolak oleh sumpahnya para ahli waris yang bertolak belakang dengan kesaksian keduanya, sehingga aib keduanya terbongkar. Dan takutlah kalian kepada Allah dengan tidak melakukan kebohongan maupun pengkhianatan dalam bersaksi dan bersumpah. Dan dengarkanlah apa yang diperintahkan kepada kalian dengan pendengaran yang disertai penerimaan. Karena Allah tidak akan menolong orang-orang yang tidak taat kepada-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "108. Sesungguhnya kewajiban orang yang diberi amanat menjaga wasiat dengan bersaksi di depan orang banyak setelah shalat dan bersumpah dengan sumpah yang teguh ini, merupakan cara yang paling baik agar para saksi menjalankan kesaksiannya dengan sempurna tanpa mengubah kesaksian, karena mereka akan mengagungkan Allah, takut dari azab-Nya, mengharap pahala-Nya, atau takut terbuka aib mereka karena kesaksian mereka dibantah oleh saksi dari ahli waris sehingga mereka berhak mendapatkan dosa. Karena barangsiapa yang tidak takut kepada Allah dengan tetap berdusta atau berkhianat karena keimanan yang lemah, maka ketakutannya dari tersingkapnya aib di depan orang banyak akan menghalanginya dari berdusta. Hai orang-orang yang beriman, bertakwalah kepada Allah ketika menjalankan kesaksian, amanah, dan segala sesuatu; Dan dengarlah dengan penuh ketaatan untuk menerima hukum-hukum ini dan semua yang disyariatkan Allah bagi kalian. Jika kalian tidak bertakwa dan mendengar maka kalian termasuk orang-orang fasik yang melanggar perintah Allah yang dijauhkan dari petunjuk-Nya serta berhak mendapat siksaan-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "108. ذٰلِكَ أَدْنَىٰٓ أَن يَأْتُوا۟ بِالشَّهٰدَةِ عَلَىٰ وَجْهِهَآ (Itu lebih dekat untuk (menjadikan para saksi) mengemukakan persaksiannya menurut apa yang sebenarnya) Yakni lebih dekat bagi para saksi yang menanggung persaksian tentang wasiat untuk bersaksi sesuai dengan yang seharusnya. Maka janganlah kalian mengganti wasiat itu dan jangan berkhianat. أَوْ يَخَافُوٓا۟ أَن تُرَدَّ أَيْمٰنٌۢ بَعْدَ أَيْمٰنِهِمْ ۗ (dan (lebih dekat untuk menjadikan mereka) merasa takut akan dikembalikan sumpahnya (kepada ahli waris) sesudah mereka bersumpah) Yakni ahli waris diberi hak untuk bersumpah, sehingga dapat bersumpah dengan sumpah yang menyelisihi apa yang dipersaksikan oleh para saksi, maka ketika itu keburukan para saksi bisa terbongkar. Kesimpulan dari hal ini bahwa orang yang telah didatangi sakaratul maut namun tidak mendapati dua saksi muslim maka ia boleh meminta persaksian dua orang kafir untuk wasiatnya. Apabila para ahli waris merasa ragu terhadap keduanya maka keduanya harus bersumpah bahwa mereka telah bersaksi dengan sebenar-benarnya, tidak menyembunyikan persaksian sedikitpun, dan tidak berkhianat terhadap peninggalan si mayit sesuatu apapun. Dan apabila setelah itu terbongkar apa yang tidak sesuai dengan sumpah mereka berdua atau terbongkar bahwa ada peninggalan mayit yang mereka berdua akui telah menjadi milik mereka, maka dua orang dari ahli waris harus bersumpah –bahwa itu adalah hak ahli waris— dan isi sumpah ini harus dijalankan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "108. Aturan tersebut adalah jawaban tentang sumpah atas ahli waris yang lebih dekat untuk mengemukakan kesaksian yang sebenarnya tanpa adanya pengkhianatan dan penyimpangan atas wasiat itu, atau agar mereka takut sumpah mereka dikembalikan kepada ahli waris yang diakui setelah melakukan sumpah sehingga mereka bersumpah atas pengkhianatan dan kebohongan mereka, lalu perkara mereka itu diketahui. Maka bertakwalah kepada Allah dengan meninggalkan pengkhianatan dan kebohongan, dan perhatikanlah perintahNya. Allah itu tidak menyelamatkan kaum yang tidak taat, dan tidak menunjukkan mereka menuju jalan kebaikan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Hal itu lebih dekat} lebih dekat {untuk membuat mereka memberikan kesaksian yang sebenarnya} yang sesungguhnya tanpa mengubahnya {atau mereka merasa takut akan dikembalikan sumpahnya setelah mereka bersumpah. Bertakwalah kepada Allah dan dengarkanlah. Allah tidak memberi petunjuk kepada kaum yang fasik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "108. Allah menjelaskan hikmah persaksian itu, penegasaNya, dan pengembaliaNya kepada keluarga mayit manakala pengkhianatan kedua orang saksi itu terbukti. “ Itu lebih dekat untuk menjadikan para saksi mengemukakan persaksiannya menurut apa yang sebenarnya,” ketika di tegaskan kapada keduanya dengan penegasan-penegasan itu. “ Dan lebih dekat untuk menjadikan mereka merasa takut akan di kembalikan sumpahnya kepada ahli waris sesudah mereka bersumpah.” Yakni, sumpah mereka di tolak lalu di kembalikan kepada keluarga mayit. “ Dan Allah tidak memberi petunjuk kepada orang-orang yang fasik,” yakni, kepasikan adalah sipat mereka, mereka tidak ingin menuju ke jalan yang lurus. Kesimpulan ayat ini adalah apabila tanda-tanda kematian, mendatangi seseorang apabila sedang dalam perjalanan atau lainya yang biasanya sulit untuk menemukan saksi-saksi yang dipercaya, maka hendaknya dia berwasiat dengan kesaksian dua orang saksi Muslim yang adil. Jika yang ada hany dua orang saksi yang kafir, maka di bolehkan berwasiat kapada keduanya. Jika keluarga mayit meragukan keduanya. Maka mereka meminta keduanya untuk bersumpah setelah shalat di laksanakan bahwa mereka berdua tidak menganti, maka dari itu keduanya terbebas dari tuntunan hak yang di arahkan kepada keduanya. Jika keluarga mayit tidak mempercayai keduanya dan mereka menemukan kondisi kedustaan kedua saksi itu, maka jika mereka berkehendak, mereka bisa menunjuk dua orang dari kalangan mereka. Kedua orang ini bersumpah dengan Nama Allah bahwa kesaksian keduanya adalah lebih layak untuk di terima daripada kesaksian dua saksi yang pertama yang telah berkhianat dan berdusta, maka mereka berhak atas apa yang mereka klaim dari keduanya. Ayat-ayat yang mulia ini turun pada kisah Tamim ad-Dari dan Adi bin Bada’ yang terkenal manakala al-Adawi berwasiat kepada keduanya. Wallahu a’lam. Ayat ini mengandung beberapa hukum: Diantaranya, adalah disyariatkannya wasiat. Hendaknya orang yang menghadapi kematian berwasiat. Diantaranya, adalah bahwa wasiat adalah sah walaupun seseorang dalam kondisi menghadapi kematian, selama akalnya berfungsi. Diantaranya, adalah bahwa kesaksian dalam wasiat harus dengan dua orang yang adil. Di antaranya, adalah bahwa kesaksian orang kafir dalam wasiat ini dan dalam hal yang sepertinya adalah diterima karena adanya kebutuhan, dan ini adalah pendapat Ahmad. Banyak ulama yang mengklaim bahwa ayat ini adalah Mansukh, ini adalah klaim yang tak berdalil. Di antaranya, adalah bahwa bisa di ambil dari isyarat dan makna hukum bahwa kesaksian orang kafir pada waktu tidak adanya saksi lain selain mereka bahkan dalam masalah selain ini adalah diterima, sebagaimana hal itu adalah pendapat Syaikhul Islam. Diantranya, adalah bolehnya seorang Muslim bepergian bersama orang kafir jika tidak ada yang dikhawatirkan. Diantaranya, adalah dibolehkannya bepergian untuk niaga. Diantaranya, adalah bahwa jika kedua orang saksi diragukan dan tidak ada indikasi pengkhianatan keduanya sementara keluarga mayit ingin menegaskan sumpah atas mereka, maka keduanya ditahan setelah shalat (dilaksanakan) untuk bersumpah dengan cara yang disebutkan oleh Allah. Diantaranya, adalah bahwa jika tidak ada tuduhan dan keraguan, maka tidak ada keperluan untuk menahan keduanya untuk menegaskan sumpah atas keduanya. Diantaranya, adalah besarnya perkara kesaksian di mana Allah menisbatkannya kepada DiriNya, ia wajib diperhatikan dan ditunaikan dengan adil. Diantranya, adalah dibolehkannya menguji dua orang saksi jika keduanya diragaukan, keduanya dipisah untuk mengetahui kesaksiannya. Diantaranya, adalah jika muncul indikasi yang menunjukkan kebohongan dua penerima wasiat itu dalam hal ini, maka dua orang dari keluarga mayit harus bersumpah dengan Nama Allah bahwa sumpah kami lebih jujur daripada sumpaah mereka bedua, keduanya telah berdusta dan berkhianat kemudian apa yang mereka klaim diberikan kepada keduanya. Indikasi ditambah sumpah, keduanya menduduki posisi bukti."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 108: Mengembalikan sumpah kepada wali si mati (ahli waris) ketika nampak sikap khianat dari kedua saksi. Yakni para saksi. Tanpa memutarbalikan dan berkhianat. Maksud \"sumpah itu dikembalikan\" adalah saksi-saksi yang berlainan agama itu ditolak, dan sumpah yang dipegang adalah sumpah saksi-saksi yang terdiri dari karib kerabat, atau berarti orang-orang yang bersumpah itu akan mendapat balasan di dunia (seperti terbuka aibnya) dan akhirat, karena melakukan sumpah palsu, akhirnya mereka tidak jadi bersumpah palsu. Kesimpulan: Jika seseorang bersafar, lalu ia merasakan akan meninggal di perjalanan itu, maka hendaknya ia berwasiat kepada dua orang saksi yang muslim dan adil. Jika tidak ada orang muslim, maka tidak mengapa dua orang non muslim. Akan tetapi, karena keadaan mereka yang kafir, maka para ahli waris jika meragukan keduanya menyuruh dua saksi itu bersumpah setelah shalat Ashar, bahwa keduanya tidak akan berkhianat, tidak akan berdusta dan merubah apa yang dipesankan si mati. Dengan sumpah ini, mereka dibebaskan dari hak yang ditujukan kepada keduanya. Jika ahli waris tidak membenarkan keduanya dan mengetahui berdasarkan qarinah, bahwa keduanya berdusta, maka jika ahli waris menghendaki, mereka angkat dua orang dari mereka untuk bersumpah dengan nama Allah yang isinya menyatakan bahwa sumpah mereka lebih berhak diikuti daripada sumpah kedua orang tadi. Dari ayat di atas dapat ditarik beberapa hukum, di antaranya: - Berwasiat itu disyari'atkan, dan sepatutnya bagi orang yang merasakan akan meninggal untuk berwasiat. - Wasiat bisa dijadikan pegangan, meskipun seseorang sedang dalam keadaan akan wafat, selama ia masih sadar terhadap apa yang diucapkannya. - Persaksian orang kafir dalam hal ini diterima karena darurat, inilah yang dipegang oleh Imam Ahmad. Adapun ulama yang lain berpendapat, bahwa hukum tersebut sudah mansukh (dihapus), namun pendapat tersebut tidak ada dalilnya. - Seorang muslim boleh bersafar dengan orang non muslim, jika tidak berbahaya. - Bolehnya bepergian jauh untuk berdagang. - Para saksi, jika masih diragukan meskipun tidak ada qarinah yang menunjukkan bahwa keduanya berdusta, maka ahli waris boleh menyuruhnya bersumpah setelah shalat agar lebih yakin. - Jika saksi tidak tertuduh, maka tidak butuh ditahan dan disuruh bersumpah. - Persaksian merupakan masalah penting, oleh karena itu harus diperhatikan dan ditegakkan secara adil. - Boleh mengetes para saksi jika masih diragukan. Misalnya dengan memisahkan mereka berdua, di mana seorang-seorang yang ditanya. - Jika ada qarinah yang menunjukkan bahwa kedua saksi itu berdusta, maka dua orang dari ahli waris boleh bangkit meluruskan. Dengan tidak berkhianat dan berdusta."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 108",
    "description": "Dengan cara itu, dua saksi yang termasuk di antara ahli waris yang berhak menjadi saksi dan lebih dekat hubungan nasabnya dengan almarhum, lebih patut memberikan kesaksiannya menurut yang sebenarnya, bahwa kendi emas itu milik budail sebagaimana tercantum dalam surat wasiat yang disisipkan pada barang-barang yang dititipkan kepada dua teman bisnisnya yang beragama nasrani; dan mereka, tamim ad-da'riy dan 'adiy bin badda, merasa takut sumpahnya yang palsu akan dikembalikan kepada ahli waris, yakni dikonfrontir dengan sumpah mereka, setelah mereka bersumpah dengan benar di hadapan rasulullah. Sumpah saksisaksi yang berlainan agama itu ditolak dengan bersumpahnya saksisaksi yang terdiri dari kerabat. Orang-orang yang bersumpah itu akan mendapat balasan di dunia dan akhirat. Bertakwalah kepada Allah, wahai orang-orang yang beriman, dan dengarkanlah dengan saksama perintah-Nya. Dan Allah tidak memberi petunjuk kepada orang-orang yang fasik, yakni para pelaku dosa besar untuk kembali kepada yang lurus, karena sikap mereka yang terus-menerus berbuat dosa besar sehingga kalbu mereka tertutup. Ingatlah suatu peristiwa penting pada hari kiamat, ketika Allah mengumpulkan para rasul, sejak nabi adam hingga nabi Muhammad, lalu dia bertanya kepada mereka, apa jawaban atau tanggapan umat terhadap misi dakwah kamu sekalian' apakah mereka menanggapinya dengan iman atau dengan kufur' apakah dengan iman yang taat atau iman yang fasik' mereka, para rasul, menjawab, saat itu umat hadir guna menyaksikan tanya jawab ini, kami tidak tahu tentang itu setelah kami wafat. Sesungguhnya engkaulah sendiri yang maha mengetahui segala yang gaib, karena pengetahuan-Mu meliputi segala sesuatu."
  }
]