[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ingatlah (wahai sekalian manusia), hari kiamat adalah hari di mana Allah akan mengumpulkan rasul-rasul , lalu Dia akan bertanya kepada mereka tentang jawaban umat-umat mereka ketika mereka menyeru umat-umat mereka kepada tauhid, lalu mereka menjawab, ”tidak ada pengetahuan dari kami tentang itu. Kami tidak tahu apa yang ada di dalam hati manusia dan tidak tahu perkara-perkara yang mereka ada-adakan sepeninggal kami. Sesungguhnya Engkau mengetahui segala sesuatu, baik yang tampak maupun yang tersembunyi. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "109. Ingatlah -wahai manusia- akan hari Kiamat yang Allah akan mengumpulkan semua rasul-Nya dan berfirman kepada mereka, “Apa jawaban umat-umat kalian yang Aku tugaskan kalian berdakwah kepada mereka?” Mereka menjawab seraya menyerahkan jawabannya kepada Allah, “Kami tidak tahu. Hanya Engkaulah Yang Maha Mengetahui, wahai Rabb kami. Sesungguhnya hanya Engkaulah yang mengetahui perkara-perkara yang gaib.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "109. Setelah berakhir pembahasan tentang persaksian atas wasiat para makhluk, Allah berpindah membahas pembahasan yang sesuai, yaitu tentang persaksian para rasul atas wasiat Sang Pencipta, karena agama-agama merupakan wasiat Allah yang harus disampaikan kepada para makhluk. Hai manusia, ingatlah pada hari kiamat ketika Allah mengumpulkan para rasul ketika Dia bertanya kepada mereka -dan Allah Maha Mengetahui jawaban umat-umat kepada para Rasul-, pertanyaan ini dimaksudkan untuk mengolok para umat tersebut dan menegakkan hujjah atas orang-orang kafir di antara mereka. Allah bertanya: Apa jawaban umat kalian tentang tauhid dan menyembah Allah Semata? Apakah mereka menjawab dengan beriman atau mereka ingkar dan menyombongkan diri? Para rasul tersebut tidak mampu untuk menjawab, dan menyerahkannya kepada Allah dengan berkata: kami tidak mengetahui kecuali apa yang telah Engkau ajarkan kepada kami sedangkan kami tidak mengetahui apa yang terjadi dengan umat-umat kami setelah kami pergi. Dan Engkau Maha Mengetahui segala hal ghaib."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "109. يَوْمَ يَجْمَعُ اللهُ الرُّسُلَ ((Ingatlah), hari di waktu Allah mengumpulkan para rasul) Yakni di hari kiamat. فَيَقُولُ مَاذَآ أُجِبْتُمْ ۖ( lalu Allah bertanya (kepada mereka): “Apa jawaban kaummu terhadap (seruan)mu?”) Yakni apa jawaban umat-umat kalian yang Allah utus kalian kepada mereka? قَالُوا۟ لَا عِلْمَ لَنَآ ۖ( Para rasul menjawab: “Tidak ada pengetahuan kami (tentang itu)) Padahal mereka mengetahui jawaban apa yang diberikan umat mereka, akan tetapi mereka mengatakan ini sebagai bentuk kelemahan mereka dan mengembalikan jawabannya kepada Allah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "109. Wahai rasulullah, ingatlah hari dimana para rasul dikumpulkan, yaitu hari kiamat. Allah akan berdirman: “Apakah jawaban kaum kalian?” Dengan menunjukkan kelemahan mereka dan untuk berserah diri kepada Allah, mereka berkata: “Kami tidak tahu apa-apa di hadapan ilmu-Mu yang meliputi segala sesuatu. Sesungguhnya Engkau mengetahui jawaban mereka, dan apa yang tersembunyi dan yang tampak oleh manusia."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "(Ingatlah) pada hari ketika Allah mengumpulkan para rasul, lalu Dia bertanya, “Apa jawaban yang kalian dapat} apa yang dijawab oleh umat kalian {dari seruan kalian” Mereka menjawab, “Kami tidak tahu. Sesungguhnya Engkaulah Yang Maha Mengetahui segala yang ghaib.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "109. Allah memberitakan tentang Hari Kiamat serta ketakutan dan kengerian besar yang ada pada hari itu, bahwa Allah akan mengumpulkan seluruh rasul dan bertanya kepada mereka, “Apa jawaban kaummu terhadap (seruan) mu?” maksudnya, apa reaksi umatmu terhadap dakwahmu. Mereka menjawab, “Tidak ada pemgetahuan kami (tentang itu),” karena ilmu adalah milikMu ya Rabbi, Engkau lebih Mengetahui daripada kami. “Sesungguhnya Engkaulah yang mengetahui pekara yang ghaib.” Engkau mengetahui perkara yang ghaib dan yang Nampak."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 109: Yaitu hari kiamat. Para rasul tidak mengetahui sikap umat mereka terhadap seruan mereka, karena kedahsyatan hari kiamat. Setelah keadaan tenang, barulah mereka memberikan kesaksian."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 109",
    "description": "Ingatlah suatu peristiwa penting pada hari kiamat, ketika Allah mengumpulkan para rasul, sejak nabi adam hingga nabi Muhammad, lalu dia bertanya kepada mereka, apa jawaban atau tanggapan umat terhadap misi dakwah kamu sekalian' apakah mereka menanggapinya dengan iman atau dengan kufur' apakah dengan iman yang taat atau iman yang fasik' mereka, para rasul, menjawab, saat itu umat hadir guna menyaksikan tanya jawab ini, kami tidak tahu tentang itu setelah kami wafat. Sesungguhnya engkaulah sendiri yang maha mengetahui segala yang gaib, karena pengetahuan-Mu meliputi segala sesuatu. Pada ayat yang lalu telah dijelaskan bahwa Allah mengajukan pertanyaan kepada para rasul pada umumnya, bagaimana tanggapan umat terhadap misi kerasulan mereka. Pada ayat ini Allah berbicara di padang mahsyar dengan nabi isa. Ingatlah ketika Allah mengumpulkan para rasul pada hari kiamat, ketika itu Allah berfirman kepada nabi isa, wahai isa putra maryam! ingatlah nikmat-ku, yang telah dianugerahkan kepadamu dan kepada ibumu di dunia, sewaktu aku menguatkanmu, ketika ibumu mengandungmu, dengan kehadiran ruhulkudus, malaikat jibril yang meniupkan roh ke dalam rahim ibumu; juga ketika menguatkan engkau sehingga engkau dapat berbicara dengan manusia pada waktu masih dalam buaian, di luar adat kebiasaan; dan setelah dewasa sewaktu menyampaikan misi kerasulan, setelah jibril menyampaikan wahyu kepada kamu. Dan ingatlah ketika aku, melalui jibril, mengajarkan menulis kepadamu, juga mengajarkan hikmah, kearifan, taurat, yang diturunkan kepada nabi musa, dan injil yang berisi ajaran tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Dan ingatlah mukjizat yang diberikan kepadamu, ketika engkau membentuk dari tanah berupa burung dengan seizin-ku, karena engkau tidak memiliki daya dan kekuatan kecuali daya dan kekuatan-ku; kemudian engkau meniupnya, sehingga burung itu benar-benar hidup, lalu menjadi seekor burung yang sebenarnya, juga dengan seizin-ku. Dan ingatlah, mukjizat yang lain, ketika engkau menyembuhkan orang yang buta sejak lahir yang secara lahiriah tidak mungkin sembuh; dan engkau juga dapat menyembuhkan orang yang berpenyakit kusta, yang pada umumnya sulit disembuhkan, dengan seizin-ku. Dan ingatlah, kenikmatan-ku kepadamu, ketika engkau mengeluarkan orang mati dari sebuah kuburan tua yang sudah bertahuntahun mati menjadi hidup kembali, juga dengan seizin-ku. Dan ingatlah, kenikmatan yang sangat berharga, ketika aku menghalangi bani israil dari rencana mereka untuk membunuhmu, sewaktu engkau menyampaikan kepada mereka keterangan-keterangan yang nyata, berdasarkan wahyu tentang bukti-bukti kerasulan dengan beberapa mukjizat, lalu orangorang kafir di antara mereka berkata, dengan sombong, ini tidak lain, semua keanehan yang diperlihatkan isa kepada kita, hanyalah sihir yang nyata, bukan mukjizat atau bukti kebenaran."
  }
]