[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta menjalankan syariatNya, ingatlah oleh kalian nikmat yang Allah limpahkan kepada kalian dari nikmat aman dan dilontarkannya rasa takut pada hati musuh-musuh kalian yang hendak menyerang kalian. lalu Allah memalingkan mereka dari kalian dan menghalangi mereka untuk melancarkan apa yang mereka rencanakan pada kalian. Dan bertakwalah kepada Allah dan gentarlah kepadaNya, serta bertawakalah kepada Allah semata dalam seluruh urusan agama dan dunia kalian, serta percayalah terhadap bantuan dan pertolonganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "11. Wahai orang-orang yang beriman kepada Allah! Ingatlah dengan hati dan lisan kalian akan karunia yang Allah berikan kepada kalian, yaitu rasa aman yang Dia berikan kepada kalian dan rasa takut yang Dia masukkan ke dalam hati musuh-musuh kalian tatkala mereka hendak mengangkat tangan mereka untuk menyerang dan mencelakakan kalian, tetapi kemudian Allah memalingkan perhatian mereka dari kalian dan melindungi kalian dari serangan mereka. Dan takutlah kalian kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan hanya kepada Allah-lah seharusnya orang-orang mukmin bersandar dalam mencari kemaslahatan agamawi maupun duniawi mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "11. Allah menyeru hamba-hamba-Nya yang beriman dan mengingatkan mereka atas nikmat nikmat yang telah Allah berikan berupa keamanan dan perlindungan dari tipu daya musuh. Betapa banyak keburukan dan musibah yang telah Allah jauhkan dari mereka! Betapa banyak Allah telah menjauhkan mereka dari tangan-tangan yang hendak melakukan kejahatan dan gangguan! Betapa besar kelembutan Allah kepada para kekasih-Nya! Maka hendaklah mereka bertakwa kepada Allah, karena Dialah yang mencukupkan dan menjaga mereka dan hanya kepada Dialah hendaklah mereka takut. Barangsiapa yang berlindung dengan ketakwaan kepada-Nya niscaya Dia akan mendapat perlindungan dan penjagaan. Dan barangsiapa yang bertawakal kepada-Nya niscaya dia akan dicukupkan. Dan hanya kepada-Nya lah orang-orang yang beriman bertawakal. Apabila seorang Mukmin bertakwa dan bertawakal kepada-Nya maka tidak akan ada tipu daya yang membuatnya takut dan tidak akan terkalahkan oleh pasukan orang-orang jahat. Dan tawakkal tidak akan terealisasi kecuali dengan kesungguhan untuk menempuh sebab-sebab yang dapat mengantarkan kepada tujuan dan dengan semangat yang tinggi untuk mencapainya. Karena berjalan di atas sunnatullah merupakan jalan satu-satunya untuk mencapai tujuan dan keselamatan yang diharapkan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "11. إِذْ هَمَّ قَوْمٌ أَن يَبْسُطُوٓا۟ (di waktu suatu kaum bermaksud hendak menggerakkan tangannya kepadamu) Dari Ibnu Abbas bahwa orang-orang dari Bani Nadhir hendak melempar Rasulullah dan para sahabatnya dengan batu,maka malaikat Jibril mendatanginya dan mengabarkan apa yang mereka rencanakan, lalu Rasulullah dan para sahabatnya berdiri. Maka turunlah ayat ini. Pendapat lain mengatakan: sebab turunnya ayat ini adalah sebagaimana yang diriwayatkan oleh Jabir bin Abdullah bahwa Rasulullah beristirahat di sebuah tempat, dan para sahabatnya berpencar dibawah-bawah pohon untuk berteduh. Lalu Rasulullah menggantungkan pedangnya disebuah dahan, kemudian datanglah seorang arab badui mengambil pedangnya dan menghunuskannya dan mengarahkannya ke Rasulullah, sambil mengatakan: “siapakah yang akan mencegahku (untuk membunuhmu)?”. Rasulullah menjawab: “Allah”. Lalu orang badui itu kembali memasukkan pedang pada sarung pedangnya. Kemudian Rasulullah memanggil para sahabatnya dan menceritakan apa yang telah dilakukan orang badui itu, sedangkan orang badui itu duduk disampingnya tanpa dihukum oleh Rasulullah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "11 Hai orang-orang yang beriman, ingatlah kamu akan nikmat Allah yang diberikan-Nya kepadamu, di waktu suatu kaum bermaksud hendak menggerakkan tangannya kepadamu untuk berbuat jahat. Yaitu para kafir Qurays dan Yahudi Bani Nadhir yang berniat membunuh Nabi beserta para sahabat maka Allah menahan tipu daya dam usaha mereka dari kamu. Dan bertakwalah kepada Allah dengan menjalankan syariat-Nya, dan hanya kepada Allah sajalah orang-orang mukmin itu harus bertawakkal, Dialah penjaga mereka dari segala keburukan. Ibnu Abbas berkata: Sesungguhnya Bani Nadhir bermaksud untuk melempar batu kepada Nabi beserta para sahabat. Kemudian datanglah Jibril, maka Jibril memberitahu niatan mereka. Maka Rasul dan para sahabat pun beranjak dan turunlah ayat ini. Ini adalah pendapat jumhur ulama’, dan ada sekelompok ulama yang berpendapat dengan riwayat Jabir: Sebab turunnya ayat adalah kelakuan seorang Arab Ghurats bin Harits dalam peperangan yang terdapat papan-papan dengan Bani Maharib. Saat itu Nabi turun, kemudian orang-orang berpencar untuk berteduh di bawah pohon ‘adhah/syajar barriy. Kemudian Nabi menyandarkan pedangnya pada pohon. Kemudian datang seorang Arab dengan membawa pedang kepada Nabi. Kemudian mengayunkannya kepada Nabi. Orang itu berkata : Siapa yang dapat menyelamatkanmu dariku? Nabi menjawab: Allah. Kemudian orang itu mengatakan perkataannya dua atau tiga kali. Dan Nabi berkata: Allah. Kemudian orang itu memasukkan pedang itu ke sarung pedang. Nabi kemudian memanggil para sahabat, dan memberitahu kejadian/perbuatan orang Arab itu, dan dia sedang duduk di dekat Nabi dan Nabi tidak membalasnya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, ingatlah nikmat Allah kepada kalian ketika suatu kaum bermaksud} berniat {menyerang kalian dengan tangan mereka} mereka menjulurkan tangan mereka untuk berbuat keburukan kepada kalian untuk memperlambat kalian {lalu Dia menahan} menahan {tangan mereka dari kalian. Bertakwalah kepada Allah dan hanya kepada Allahlah hendaknya orang-orang mukmin itu bertawakal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "11. Allah mengingatkan hamba-hambaNya, kaum Mukminin dengan nikmat- nikmatNya yang besar, dan mengajak mereka untuk mengingatnya dengan hati dan ucapan. Dan bahwasanya sebagaimana mereka menganggap pembunuhan terhadap musuh, merampas hartanya, negerinya dan menawannya sebagai nikmat, maka hendaknya mereka menganggap kenikmatanNYa kepada mereka dalam bentuk ditahannya tangan-tangan jahat menjamah mereka dan digagalkannya tipu daya musuh-musuh menimpa mereka, dan juga sebagai nikmat. Karena para musuh telah berniat melakukan sesuatu dan mereka mengira mampu melakukannya, jika mereka tidak mampu mewujudkan itu terhadap orang-orang Mukmin maka itu adalah pertolongan Allah kepada hamba-hambaNya yang beriman; yang mana mereka selayaknya bersyukur kepada Allah atas itu, dan menyembahNya dan mengingatNya. Ini mencakup siapa pun yang berniat jahat kepada orang-orang Mukmin, baik itu kafir, munafik atau pembangkang, dimana Allah menahan keburukannya dari orang-orang Mukmin, maka itu masuk di dalam ayat ini. Kemudian Allah memerintahkan mereka melakukan sesuatu yang membantu mereka meraih kemenangan atas musuh mereka dalam segala urusan mereka, maka Dia berfirman, “Dan hendaknya hanya kepada Allah sajalah orang-orang Mukmin itu harus bertawakal,” yakini berpegangan padaNya dalam mendatangkan kebaikan agama dan dunia dari berlepas diri dari hanya berpedoman pada daya dan kekuatan mereka. Hendaklah mereka percaya sepenuhnya kepada Allah dalam meraih harapan. Dan tawakal seorang hamba adalah sesuai dengan kadar imannya dan ia termasuk kewajiban hati yang di sepakati."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 11: Dalam ayat ini, Allah Subhaanahu wa Ta'aala mengingatkan nikmat-nikmat-Nya kepada hamba-hamba-Nya yang mukmin dan mendorong mereka untuk mengingatnya baik dengan hati maupun lisan. Di antara nikmat itu adalah menghalangi musuh dari menyerang mereka secara tiba-tiba, di mana hal itu merupakan pertolongan Allah kepada mereka yang patut mereka syukuri. Kemudian Allah memerintahkan mereka menggunakan tawakkal kepada Allah untuk melawan musuh mereka dan dalam menghadapi segala urusan. Yakni orang-orang kafir Quraisy. Termasuk pula orang kafir lainnya dan orang munafik. Bertawakkal adalah bersandar kepada Allah dalam mendatangkan maslahat, baik maslahat agama maupun dunia serta berlepas diri dari kemampuan dan kekuatan yang ada pada diri, dan merasa yakin dengan Allah dalam usaha menghasilkan semua yang diinginkan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 11",
    "description": "Ayat ini sekali lagi mengingatkan orang-orang beriman agar mensyukuri anugerah keselamatan dari gangguan musuh. Wahai orangorang yang beriman! ingatlah nikmat Allah yang dianugerahkan kepadamu, ketika suatu kaum, yakni orang-orang kafir mekah dan orangorang yahudi bani naa'ir, bermaksud hendak menyerangmu dengan tangannya untuk membunuhmu dan para sahabat yang bersamamu dengan cara yang licik, lalu Allah menahan tangan mereka dari kamu sehingga mereka tidak dapat melaksanakan niatnya berbuat jahat kepadamu. Dan bertakwalah kepada Allah pada setiap waktu dan dalam segala keadaan, dan hanya kepada Allah-lah, tidak kepada selain-Nya, hendaknya orang-orang beriman itu bertawakal, menyerahkan segala keputusan kepada Allah yang memutuskan segala sesuatu sesuai ilmu-Nya yang mahaluas dan kekuasaan-Nya yang mahabesar. Setelah mengingatkan orang-orang yang beriman agar senantiasa melaksanakan kewajiban dan mensyukuri nikmat yang dianugerahkan Allah kepada mereka, pada ayat ini diingatkan sikap dan perilaku ahli kitab terhadap perjanjian-perjanjian mereka dengan Allah, agar orang-orang yang beriman tidak mengalami apa yang menimpa ahli kitab itu. Dan sungguh, Allah telah mengambil perjanjian dari bani israil, sebagaimana kami telah mengambil perjanjian pula dari kamu, wahai kaum muslim, dan kami telah mengangkat dengan mengutus nabi musa untuk memilih dua belas orang pemimpin di antara mereka yang bertugas membimbing mereka. Jumlah itu ditentukan sesuai dengan jumlah suku-suku bani israil pada masa itu. Dan Allah berfirman kepada bani israil, aku bersamamu, senantiasa melindungi dan menolong kamu, jika kamu memenuhi perjanjianmu dengan-ku. Bagian selanjutnya dari ayat ini menyebutkan sebagian dari tugas-tugas yang dibebankan kepada mereka. Sungguh, jika kamu melaksanakan salat dengan baik dan benar sesuai dengan syarat-syarat dan rukunnya, dan menunaikan dengan sempurna kewajiban zakat serta beriman kepada rasul-rasul-ku seluruhnya, dan kamu bantu mereka, kamu dukung dengan dukungan yang kuat dari gangguan orang-orang yang memusuhinya, dan kamu pinjamkan kepada Allah pinjaman yang baik dengan bersedekah dan berinfak di jalan Allah, pasti akan aku hapus kesalahan-kesalahanmu, dan pasti akan aku masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Tetapi barang siapa kafir di antaramu dengan melanggar perjanjian dengan-ku setelah itu, yakni setelah diikatnya perjanjian itu, maka sesungguhnya dia telah tersesat dari jalan yang lurus."
  }
]