[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Ingatlah ketika Allah berfirman pada hari kiamat ”Wahai Isa purta Maryam, ingatlah NikmatKu yang tercurah kepadamu ketika Aku menciptakanmu tanpa ada seorang ayah, dan yang tercurah pada ibumu ketika Aku menjatuhkan pilihan padanya di antara wanita yang ada di alam semasta dan Aku telah bersihkan dia dari tuduhan yang dilancarkan kepadanya.” Dan diantara nikmat-nikmat yang tercurah kepada Isa bahwa Dia menguatkan dan menolongnya dengan jibril , dia berbicara dengan manusia saat masih berupa bayi yang menyusu sebelum waktunya bisa bicara, dan menyeru mereka kepada Allah saat dia dewasa sungguh telah berkumpul seluruh kekuatannya dan sempurna kedewasaannya dengan wahyu yang Allah wahyukan kepadanya berupa tauhid. Dan diantara Nikmat lainnya, bahwasannya Allah mengajarkan kepadanya cara menulis dan merangkai huruf dengan baik tanpa ada seorang guru. Dan Dia menganugerahkan kepadanya kekuatan pemahaman dan daya tangkap tinggi dan mengajarkan kepadanya taurat yang diturunkan kepada Musa dan injil yang diturunkanNya kepadanya sebagai hidayah bagi manusia. Dan diantara kenikmatan-kenikmatan tersebut, sesungguhnya dia membentuk rupa sesuatu dari tanah seperti bentuk burung, lalu dia meniupnya, dan kemudian menjadi seekor burung atas izin Allah. Dan diantara nikmat-nikmat itu, dia juga dapat menyembuhkan orang yang buta sejak lahir sehingga dapat melihat dan menyembuhkan orang yang berpenyakit lepra(kusta) sehingga kulitnya kembali sehat atas izin Allah. selain itu, dia memohon kepada Allah akan berkenan menghidupkan orang-orang mati, lalu mereka bangkit dari kubur-kubur mereka hidup-hidup. Dan semua itu terjadi atas kehendak Allah dan izinNya, dan itu merupakan mukjizat-mukjizat amat terang yang menguatkan kenabian Isa . Kemudian Allah mengingatkan kepadanya kenikmatan yang tercurah padanya, ketika Dia mencegah Bani israil saat mereka mengincar untuk membunuhnya. Sesungguhnya dia telah datang dengan membawa mukjizat-mukjizat yang jelas lagi menunjukan kenabiannya. Tapi kemudian orang-orang yang kafir dari mereka mengatakan, ”sesungguhnya bukti-bukti yang nyata yang dibawa oleh Isa merupakan sihir yang nyata. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "110. Dan ingatlah tatkala Allah berfirman kepada Isa -‘Alaihissalām-, “Wahai Isa putra Maryam, ingatlah akan nikmat yang Aku berikan kepadamu tatkala Aku menciptakanmu tanpa seorang ayah. Dan ingatlah nikmat yang Aku berikan kepada ibumu, Maryam -‘Alaihassalām- saat Aku memilihnya di antara wanita-wanita yang ada pada masanya. Dan ingatlah salah satu nikmat yang Aku berikan kepadamu ketika Aku mendukungmu dengan menghadirkan Malaikat Jibril -‘Alaihissalām-. Kamu berbicara kepada manusia -sewaktu kamu masih bayi- berkat doa yang mereka panjatkan kepada Allah. Dan kamu berbicara kepada mereka setelah dewasa untuk menyampaikan risalah yang Aku perintahkan untuk kamu sampaikan kepada mereka. Dan ingatlah nikmat yang Aku berikan kepadamu tatkala Aku mengajarkan kepadamu tulis-menulis, mengajarkan kitab suci Taurat yang Aku turunkan kepada Musa -‘Alaihissalām-, dan mengajarkan kitab suci Injil yang Aku turunkan kepada kalian. Dan Aku juga mengajarkan kepadamu rahasia-rahasia, faidah-faidah, dan hikmah-hikmah yang ada di balik syariat agama. Dan nikmat lain yang Aku berikan kepadamu, kamu mampu membuat bentuk seperti burung dari tanah liat kemudian kamu tiup, dan langsung berubah menjadi burung. Kamu dapat menyembuhkan orang yang buta sejak lahir dan orang yang sakit lepra hingga kulitnya menjadi sembuh total. Bahkan kamu dapat menghidupkan orang yang sudah mati melalui doa yang kamu panjatkan kepada Allah. Semuanya terjadi atas izin-Ku. Nikmat lain yang Aku berikan kepadamu ialah Aku melindungi dirimu dari orang-orang Bani Israil tatkala mereka berniat membunuh dirimu setelah kamu datang kepada mereka dengan membawa mukjizat-mukjizat yang nyata. Namun mereka menolaknya dan mengatakan bahwa apa yang dibawa oleh Isa tidak lebih dari sihir yang nyata."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "110. Dan ingatlah ketika Allah berfirman kepada Isa bin Maryam: Ingatlah kenikmatan agung yang Aku berikan kepadamu dan kepada ibumu; yaitu ketika Aku menguatkanmu dengan malaikat Jibril; menciptakanmu tanpa seorang ayah, memilih ibumu diantara wanita-wanita seluruh alam dengan mensucikan dirinya dari segala tuduhan yang diarahkan kepadanya; mengajarkanmu menulis; membuatmu dapat berbicara ketika masih dalam buaian mengenai urusan dakwah yang akan kamu lakukan ketika telah dewasa; memberimu hikmah -ilmu yang bermanfaat yang dapat memunculkan keinginan untuk beramal-, mengajarkanmu Taurat yang aku turunkan kepada Musa dan Injil yang aku turunkan kepadamu sebagai petunjuk bagi manusia, yang mengandung hikmah, hukum-hukum, dan kabar gembira tentang kedatangan penutup para nabi; kamu membuat tanah liat yang berbentuk burung kemudian kamu meniupnya sehingga tanah liat itu berubah menjadi burung sungguhan dengan izin-Ku; dan kamu menyembuhkan orang yang buta sehingga dapat melihat kembali, menyembuhkan orang kusta sehingga kulitnya menjadi sehat kembali dengan izin Allah; kamu berdoa kepada Allah agar dapat mengeluarkan orang-orang mati dari kubur dalam keadaan hidup dengan izin Allah. Allah mengungkapkan kata \"menghidupkan\" dengan kata mengeluarkan sebagaimana dalam firman-Nya: وأحيينا به بلدة ميتا كذلك الخروج “Dan Kami hidupkan dengan (air) itu negeri yang mati (tandus).” (Qaf: 11) Dan dalam firman-Nya: أءذا كنا ترابا وءاباؤنا أئنا لمخرجون \"Apakah setelah kita menjadi tanah dan (begitu pula) bapak-bapak kita; apakah sesungguhnya kita akan dikeluarkan (dari kubur)?” (An-Naml: 67) Dan ingatlah kenikmatan yang Aku berikan kepadamu ketika Aku menghalangi bani Israel saat hendak membunuh dan menyalibmu; mereka merencanakan itu ketika orang-orang kafir di antara mereka mendustakanmu dan mereka mengatakan bahwa bukti-bukti dan penjelasan yang kamu bawa merupakan sihir yang kamu lakukan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "110. اذْكُرْ نِعْمَتِى عَلَيْكَ وَعَلَىٰ وٰلِدَتِكَ ((Ingatlah), ketika Allah mengatakan: “Hai Isa putra Maryam, ingatlah nikmat-Ku kepadamu dan kepada ibumu) Allah menyebutkan kenikmatan yang diberikan kepada Isa dan ibunya, yang dimaksudkan agar umat-umat yang lain mengetahui bahwa mereka berdua diistemewakan Allah dengan kemuliaan dari-Nya, dan diutamakan dengan derajat yang tinggi, serta sebagai bentuk olokan bagi orang-orang yang menjadikan mereka berdua Tuhan, dengan menjelaskan bahwa kenikmatan yang dikaruniakan kepada mereka berdua berasal dari Allah dan keduanya termasuk hamba-hamba-Nya yang tidak memiliki kuasa atas diri mereka. إِذْ أَيَّدتُّكَ بِرُوحِ الْقُدُسِ(di waktu Aku menguatkan kamu dengan ruhul qudus) Yakni menguatkanmu dengan roh yang suci yang mendapat keistimewaan dari Allah. Pendapat lain mengatakan bahwa ia adalah malaikat Jibril. تُكَلِّمُ النَّاسَ فِى الْمَهْدِ(Kamu dapat berbicara dengan manusia di waktu masih dalam buaian) Saat ia masih bayi. وَكَهْلًا ۖ( dan sesudah dewasa) Yakni tidak bicaramu tidak ada bedanya di dua masa tersebut. وَإِذْ عَلَّمْتُكَ الْكِتٰبَ(dan (ingatlah) di waktu Aku mengajar kamu al-kitab) Yakni menulis. وَالْحِكْمَةَ (dan al-hikmah) Yakni perkataan yang berisi hikmah. وَإِذْ تَخْلُقُ مِنَ الطِّينِ كَهَيْـَٔةِ الطَّيْرِ (dan (ingatlah pula) diwaktu kamu membentuk dari tanah (suatu bentuk) yang berupa burung) Yakni kamu membentuk tanah dengan bentuk seekor burung. فَتَنفُخُ فِيهَا (kemudian kamu meniup kepadanya) Kepada bentuk burung tersebut. فَتَكُونُ طَيْرًۢا (lalu bentuk itu menjadi burung) Sebagaimana burung-burung yang lain. وَتُبْرِئُ الْأَكْمَهَ (Dan (ingatlah) di waktu kamu menyembuhkan orang yang buta) Yakni yang buta. وَإِذْ تُخْرِجُ الْمَوْتَىٰ (dan (ingatlah) di waktu kamu mengeluarkan orang mati) Mengeluarkan dari kubur mereka dalam keadaan hidup, sehingga hal itu menjadi mu’jizat yang besar. بِإِذْنِى ۖ (dengan seizin-Ku) Semuanya berasal dari Allah, sedangkan Nabi Isa tidak melakukan kecuali apa yang diperintahkan Allah kepadanya. وَإِذْ كَفَفْتُ(dan (ingatlah) di waktu Aku menghalangi) Yakni Aku halangi dan alihkan. بَنِىٓ إِسْرٰٓءِيلَ عَنكَ(Bani Israil darimu) Ketika mereka hendak membunuhmu. إِذْ جِئْتَهُم بِالْبَيِّنٰتِ (di kala kamu mengemukakan kepada mereka keterangan-keterangan yang nyata) Yakni dengan mu’jizat-mu’jizat yang jelas. فَقَالَ الَّذِينَ كَفَرُوا۟ مِنْهُمْ إِنْ هٰذَآ إِلَّا سِحْرٌ مُّبِينٌ (lalu orang-orang kafir diantara mereka berkata: “Ini tidak lain melainkan sihir yang nyata”) Ketika mereka menganggap hal itu sebagai sesuatu yang luar biasa dan takjub dengan hal itu maka mereka tidak bisa mengingkari dengan sepenuhnya, maka dari itu mereka menganggap hal itu sebagai sihir."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "110. Wahai rasulullah, ingatlah ketika Allah berfirman: “Wahai Isa, ingatlah nikmatKu atas dirimu dan ibumu yang Aku pilih untuk memberi pengertian kepada para umat tentang keistimewaan dan kemuliaan yang dimiliki keduanya dan menghina orang yang menjadikan keduanya sebagai tuhan, ketika Aku menguatkanmu melalui Ruhul Qudus, yaitu Jibril AS, yang mana kamu bisa berbicara dengan manusia di masa kecil, dan masa tua setelah melewati 30 tahun untuk menyampaikan risalah Tuhanmu, dan ketika aku mengajarkanmu menulis atau membuat garis untuk menulis, ilmu yang bermanfaat, pemahaman makna, kitab Taurat yang diturunkan atas Musa, dan kitab Injil yang diturunkan atas dirimu, serta ketika kamu membuat dan membentuk sesuatu seperti bentuk burung dari bahan tanah dengan kehendakKu, lalu kamu meniup bentuk burung itu dan menjadi burung yang hidup dan bergerak sesuai perintahKu, dan kamu melepaskan orang buta (yang melahirkan anak yang buta) dan orang yang berpenyakit kusta (yang ditimpa kusta, yaitu bercak putih di tubuh yang meninggalkan rasa yang sangat gatal) dengan kehendak dan perintahKu, serta ketika kamu mengeluarkan orang-orang mati dari kuburan mereka dalam keadaan hidup dengan perintahKu, Yang sebenarnya melakukan itu adalah Allah dan Isa hanyalah wasilah. Dan ingatlah nikmatKu atasmu ketika kamu memalingkan dan mencegah Bani Israil yang berencana membunuhmu setelah kamu membawa bukti-bukti, dan mukjizat nyata yang membuktikan pada kenabianmu untuk mereka”, lalu orang-orang kafir di antara mereka berkata: “Apa yang kamu bawa kepada kami ini tidak lain kecuali sihir yang nyata”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Ketika Allah berfirman, “Wahai Isa putra Maryam, ingatlah nikmatKu kepadamu dan kepada ibumu sewaktu Aku menguatkanmu} menguatkanmu {dengan Ruhul qudus} Jibril AS {Kamu dapat berbicara dengan manusia pada waktu masih dalam buaian dan setelah dewasa. ketika Aku mengajarimu menulis} menulis {dan hikmah} pemahaman {Taurat, dan Injil. ketika kamu membentuk} membentuk {dari tanah sesuatu seperti bentuk} bentuk {burung, dengan seizinKu, kemudian kamu meniupnya, lalu menjadi seekor burung dengan seizinKu. Dan ketika kamu menyembuhkan} meenyembuhkan {orang yang buta sejak lahir} orang yang dilahirkan buta {dan orang yang berpenyakit kusta dengan seizinKu. dan ketika kamu mengeluarkan orang mati dengan seizinKu. ketika Aku menghalangi} mencegah {Bani Israil darimu saat kamu mengemukakan kepada mereka keterangan-keterangan yang nyata, lalu orang-orang kafir di antara mereka berkata, “Ini tidak lain hanyalah sihir yang nyata.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "110. “(Ingatlah), ketika Allah mengatakan, ‘Hai Isa putra Maryam, ingatlah dengan hati dan lisanmu. Laksanakan kewajiban-kewajibannya sebagai bentuk bersyukur kepada Tuhanmu yang mana Dia telah memberimu nikmat-nikmat yang tidak diberikan kepada selainmu. “Di waktu Aku menguatkan kamu dengan ruh al-Qudus.” Yaitu di waktu Aku mendukungmu dengan wahyu yang menyucikanmu dan membersihkanmu sehingga kamu memiliki kekuatan untuk melaksnakan perintah Allah dan berdakwah di jalanNya. Ada pendapat yang mengatakan bahwa yang dimaksud dengan ruh al-Qudus adalah JIbril, dan bahwa Allah membantu Isa dengannya, dia selalu menyertainya dan meneguhkannya dalam kondisi-kondisi sulit. “Kamu dapat berbicara dengan manusia di waktu masih dalam buaian dan sesudah dewasa.” Yang dimaksud dengan berbicara di sini bukan sekedar berbicara yang biasa (bagi anak kecil), akan tetapi berbicara yang dimengerti bagi pembicara dan lawan bicara, yaitu dakwah kepada Allah, dan dalam bidang ini Isa memiliki apa yang dimiliki oleh saudara-saudaranya dari kalangan rasul-rasul Ulul Azmi dalam bentuk penyampaian risalah pada waktu dewasa dan dakwah kepada kebaikan serta larangan terhadap keburukan. Dia unggul dari mereka dengan dapat berbicara di waktu bayi, dia berkata, \"Berkata Isa: “Sesungguhnya aku ini hamba Allah, Dia memberiku Al Kitab (Injil) dan Dia menjadikan aku seorang nabi, dan Dia menjadikan aku seorang yang diberkati di mana saja aku berada, dan Dia memerintahkan kepadaku (mendirikan) shalat dan (menunaikan) zakat selama aku hidup;\" (Maryam:30-31). “Dan (ingatlah) di waktu Aku mengajar kamu al-KItab dan hikmah.” Kitab ini meliputi kitab-kitab terdahulu khususnya Taurat. Dia termasuk Nabi Bani Israil yang paling mengetahui tentangnya setelah Musa. Ia juga menguasai Injil yang Allah turunkan kepadanya. Dan hikmah adalah pengetahuan tentang rahasia-rahasia syariat, faidah-faidahnya, hukumnya, dakwah, dan pengajaran dengan baik dan memperhatikan apa yang harus diperhatikan sebaik-baiknya. “Dan (Ingatlah pula) di waktu kamu membentuk dari tanah (suatu bentuk) yang berupa burung.” Yakni berbentuk burung tanpa ruh. “Kemudian kamu meniup padanya, lalu bentuk itu menjadi burung (yang sebenarnya),” dengan izin Allah. “Dan (ingatlah), waktu kamu menyembuhkan orang yang buta sejak dalam kandungan ibu.” Yakni tanpa penglihatan dan tanpa mata. “Dan orang yang berpenyakit sopak dengan seizinKu, dan (ingatlah) di waktu kamu mengeluarkan orang mati dari kubur (menjadi hidup) dengan seizinKu.” Ini adalah bukti-bukti yang jelas dan mukjizat yang luar biasa di mana para dokter dan lain-lain tidak mampu melakukannya. Dengannya Allah mendukung dan menguatkan Isa dan dakwahnya. “Dan (Ingatlah) di waktu Aku menghalangi Bani Israil (dari keinginan mereka membunuh kamu) di kala kamu mengemukakan kepada mereka keterangan-keterangan yang nyata, lalu orang-orang kafir di antara mereka berkata,” ketika kebenaran datang kepada mereka yang didukung dengan keterangan-keterangan yang menuntun kepada iman, “Ini tidak lain melainkan sihir yang nyata.” Dan mereka ingin membunuh Isa dan berusaha untuk itu, maka Allah menahan tangan mereka dan menjaga serta melindungi Isa dari mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 110: Yakni sebutlah oleh lisanmu dan ingatlah dalam hatimu, serta kerjakanlah konsekwensinya berupa sikap syukur kepada Tuhanmu, karena telah memberimu nikmat yang tidak diberikann-Nya kepada selainmu. Yakni bersyukurlah kepadanya. Ada yang mengartikan Rohulqudus di sini adalah roh dan wahyu, yakni Allah Subhaanahu wa Ta'aala menguatkan Nabi Isa 'alaihis salam dengan roh dan wahyu yang menyucikan dirinya dan menjadi penguat dalam menjalankan perintah Allah dan mengajak manusia kepada-Nya. Ada pula yang mengartikan roh di sini adalah malaikat Jibril, di mana malaikat Jibril senantiasa mendampinginya dan mengokohkannya di saat-saat yang berat. Berbicara di sini bukanlah sekedar berbicara, tetapi berbicara di sini adalah berbicara yang bermanfaat, yaitu da'wah ilallah. Seseorang disebut \"dewasa\" apabila telah berusia 30 tahun ke atas sampai 50 tahun. Menurut pengarang tafsir Al Jalaalain, bahwa maksudnya adalah setelah Beliau turun lagi ke dunia menjelang kiamat, karena Beliau diangkat sebelum menginjak dewasa. Ada yang mengartikan lafaz \"kitab\" (lih. ayat di atas) dengan kitab-kitab terdahulu, terutama Taurat, di mana Beliau adalah orang yang paling mengetahui isi Taurat setelah Nabi Musa 'alaihis salam. Hikmah adalah mengetahui rahasia syari'at, faedah dan hukumnya, bagus dalam berdakwah dan mengajar, serta memperhatikan apa yang perlu diperhatikan. Semua ini merupakan mukjizat Beliau yang mengalahkan ilmu kedokteran yang masyhur ketika itu. Ini semua merupakan nikmat Allah kepada hamba dan rasul-Nya Isa 'alaihis salam, Allah mengajak beliau untuk bersyukur kepada-Nya, maka Nabi Isa 'alaihis salam melakukannya serta bersikap sabar dalam berdakwah sebagaimana saudara-saudaranya dari kalangan para nabi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 110",
    "description": "Pada ayat yang lalu telah dijelaskan bahwa Allah mengajukan pertanyaan kepada para rasul pada umumnya, bagaimana tanggapan umat terhadap misi kerasulan mereka. Pada ayat ini Allah berbicara di padang mahsyar dengan nabi isa. Ingatlah ketika Allah mengumpulkan para rasul pada hari kiamat, ketika itu Allah berfirman kepada nabi isa, wahai isa putra maryam! ingatlah nikmat-ku, yang telah dianugerahkan kepadamu dan kepada ibumu di dunia, sewaktu aku menguatkanmu, ketika ibumu mengandungmu, dengan kehadiran ruhulkudus, malaikat jibril yang meniupkan roh ke dalam rahim ibumu; juga ketika menguatkan engkau sehingga engkau dapat berbicara dengan manusia pada waktu masih dalam buaian, di luar adat kebiasaan; dan setelah dewasa sewaktu menyampaikan misi kerasulan, setelah jibril menyampaikan wahyu kepada kamu. Dan ingatlah ketika aku, melalui jibril, mengajarkan menulis kepadamu, juga mengajarkan hikmah, kearifan, taurat, yang diturunkan kepada nabi musa, dan injil yang berisi ajaran tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Dan ingatlah mukjizat yang diberikan kepadamu, ketika engkau membentuk dari tanah berupa burung dengan seizin-ku, karena engkau tidak memiliki daya dan kekuatan kecuali daya dan kekuatan-ku; kemudian engkau meniupnya, sehingga burung itu benar-benar hidup, lalu menjadi seekor burung yang sebenarnya, juga dengan seizin-ku. Dan ingatlah, mukjizat yang lain, ketika engkau menyembuhkan orang yang buta sejak lahir yang secara lahiriah tidak mungkin sembuh; dan engkau juga dapat menyembuhkan orang yang berpenyakit kusta, yang pada umumnya sulit disembuhkan, dengan seizin-ku. Dan ingatlah, kenikmatan-ku kepadamu, ketika engkau mengeluarkan orang mati dari sebuah kuburan tua yang sudah bertahuntahun mati menjadi hidup kembali, juga dengan seizin-ku. Dan ingatlah, kenikmatan yang sangat berharga, ketika aku menghalangi bani israil dari rencana mereka untuk membunuhmu, sewaktu engkau menyampaikan kepada mereka keterangan-keterangan yang nyata, berdasarkan wahyu tentang bukti-bukti kerasulan dengan beberapa mukjizat, lalu orangorang kafir di antara mereka berkata, dengan sombong, ini tidak lain, semua keanehan yang diperlihatkan isa kepada kita, hanyalah sihir yang nyata, bukan mukjizat atau bukti kebenaran. Allah lalu mengingatkan nabi isa tentang kenikmatan lain yang sangat berharga, yaitu mendapat pengikut setia. Dan ingatlah, wahai rasulullah dan sampaikan kepada umatmu, ketika aku mengilhamkan kepada al-hawa'riyyun, para pengikut setia nabi isa, berimanlah kamu kepada-ku dan kepada rasul-ku, yakni nabi isa. Mereka, al-hawa'riyyun, menjawab dengan meyakinkan, kami telah beriman kepada Allah dan rasul-Nya, dan saksikanlah, wahai rasul, nabi isa, bahwa kami adalah orang-orang yang setia mematuhi perintah-perintahmu, yang berserah diri kepada Allah secara total."
  }
]