[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Isa putra maryam mengabulkan permintaan para pembela setia itu, lalu dia berdoa kepada tuhannya sembari mengucapkan, ”wahai tuhan kami, turunkanlah kepada kami hidangan makanan dari langit, yang akan kami jadikan hari turunnya hidangan itu sebagai hari raya kami yang akan kami agungkan dan diagungkan oleh orang-orang setelah kami. Dan hidangan itu akan menjadi tanda dan hujjah dariMu (ya Allah) yang menunjukan keesaanMu dan atas kebenaran kenabianku. Dan karuniakanlah kepada kami dari pemberianMu yang melimpah. dan Engkaulah sebaik-baik pemberi rizki. ”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "114. Kemudian Isa mengabulkan permintaan mereka. Dan ia pun berdoa kepada Allah, “Ya Rabb kami, turunkanlah kepada kami hidangan makanan yang pada hari turunnya dapat kami jadikan sebagai hari raya yang kami agungkan sebagai ungkapan rasa syukur kami kepada-Mu. Dan juga dapat menjadi tanda dan bukti atas keesaan-Mu dan kebenaran dari agama yang kubawa. Dan berilah kami rezeki yang dapat membantu kami dalam beribadah kepada-Mu. Sedangkan Engkau -wahai Rabb kami- sebaik-baik pemberi rezeki”."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "114. Maka Isa bin Maryam menyetujui permintaan mereka, kemudian dia berdoa: ya Tuhan kami, turunkanlah kepada kami hidangan yang hari turunnya akan menjadi hari raya bagi orang-orang yang bersama kami dan orang-orang setelah kami, dan hidangan itu menjadi bukti atas keesaan-Mu dan kebenaran kenabianku bahwa aku adalah utusan-Mu kepada Bani Israil. Dan Engkau adalah sebaik-baik pemberi rezeki."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "114. قَالَ عِيسَى ابْنُ مَرْيَمَ اللَّـهُمَّ رَبَّنَآ أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَآءِ تَكُونُ لَنَا عِيدًا (Isa putera Maryam berdoa: “Ya Tuhan kami turunkanlah kiranya kepada kami suatu hidangan dari langit (yang hari turunnya) akan menjadi hari raya bagi kami) Yakni hari turunnya hidangan itu menjadi hari raya bagi kami. لِّأَوَّلِنَا وَءَاخِرِنَا (yaitu orang-orang yang bersama kami dan yang datang sesudah kami) Yakni bagi orang yang berada di zaman kami dan orang yang datang setelah kami dari keturunan kami dan lainnya. وَءَايَةً مِّنكَ ۖ (dan menjadi tanda bagi kekuasaan Engkau) Yakni bukti dan hujjah yang jelas atas kesempurnaan kuasa-Mu, dan kebenaran pengutusan-Mu kepada Rasul-Rasul-Mu. وَارْزُقْنَا (beri rzekilah kami) Yakni rezeki yang membantu kami untuk menjalankan ibadah kepada-Mu. وَأَنتَ خَيْرُ الرّٰزِقِينَ (dan Engkaulah pemberi rezeki Yang Paling Utama) Bahkan tidak ada yang memberi rezeki kecuali diri-Mu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "114. Ketika melihat keteguhan Hawariyun dan keinginan mereka agar diturunkan hidangan, Isa pun berdoa: “Ya Allah Tuhan Kami, turunkanlah atas kami hidangan dari langit yang mana waktu turunnya hidangan itu menjadi hari raya dan hari bahagia untuk orang-orang di masa kami dan setelah kami, dan menjadi bukti nyata atas kuasaMu dan kebenaran risalah rasulMu, dan berilah rejeki yang bisa kami gunakan sebagai alasan untuk bersyukur dan beribadah kepadaMu. Engkaulah sebaik-baik pemberi rejeki, sebaik-baik pemberi, bahkan hakikatnya tiada pemberi rejeki selain Engkau”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Isa putra Maryam berdoa, “Ya Allah, Ya Tuhan kami, turunkanlah kepada kami hidangan dari langit yang akan menjadi hari raya bagi kami} hari turunnya makanan itu menjadi hari raya bagi kami yang kami agungkan {yaitu bagi orang-orang yang sekarang maupun yang datang setelah kami} orang-orang yang di zaman kami dan orang-rang yang datang setelah kami {dan menjadi tanda bagi kekuasaanMu} tanda dariMu atas keesaanMu dan kebenaran kenabianku {Berilah kami rezeki. Engkaulah sebaik-baik pemberi rezeki.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "111-120. MaksudNya ingatlah nikmatKu kepadamu manakala aku memudahkan untukmu mendapatkan pengikut-pengikut dan penolong-penolong, maka aku ilhamkan kepada Hawariyyin (pembela dan pengikut setia), dan aku bisikan iman kepadaKu dan RasulKu kedalam hati mereka, dan aku ilhamkan melalui lisanmu yakni aku memerintahkan kepada mereka melalui wahyu yang datang kepadamu dari Allah, maka mereka menjawab dan meresponnya dengan baik, mereka berkata, “ kami telah beriman dan saksikanlah wahai Rasul bahwa sesungguhnya kami adalah orang-orang yang patuh kepada seruanMu.” Mereka menggabungkan antara Islam yang zahir yang di dasari ketundukan dengan amal yang di dasari dengan iman batin yang mengeluarkan pemiliknya dari kemunafikan dan iman yang lemah. Para Hawariyyin itu adalah orang-orang yang menolong, seperti kata Isa kepada mereka, \"Hai orang-orang yang beriman, jadilah kamu penolong (agama) Allah sebagaimana Isa ibnu Maryam telah berkata kepada pengikut-pengikutnya yang setia: “Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?” Pengikut-pengikut yang setia itu berkata: “Kamilah penolong-penolong agama Allah”, lalu segolongan dari Bani Israil beriman dan segolongan lain kafir; maka Kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka, lalu mereka menjadi orang-orang yang menang.\" ( Ash- Shaff:14) “Ingatlah ketika pengikut-pengikut Isa berkata, ‘ Hai Isa putra Maryam bersediakah Tuhanmu menyediakan hidangan dari langit kepada kami?’” maksudNya, meja makanan dengan makanan. Ini bukan karena keraguan mereka terhadap kuasa Allah dan kemampuaNya untuk itu, akan tetapi itu usulan yang sopan dari mereka. Karena permintaan terhadap kekuasaan Allah bertentangan dengan ketundukan kepada kebenaran, dan ucapan yang keluar dari para hawariyyin bisa jadi mengarah kesana. Maka Isa menasehati mereka dan berkata, “ bertakwalah kepada Allah jika kamu benar-benar orang-orang yang beriman.” Karena seorang Mukmin akan bertakwa karena imanNya untuk selalu bertakwa, tunduk kepada perintah Allah dan tidak menuntut turunnya tanda-tanda kekuasaan Allah yang tidak di ketahui apa yang terjadi sesudah itu. Hawariyyin menjelaskan bahwa bukan itu maksud mereka, akan tetapi maksud mereka adalah baik yaitu karena kebutuhan, mereka berkata, “ Kami akan memakan hidangan itu.” Ini adalah bukti bahwa mereka memerlukannya, “ dan supaya tenteram hati kami” dengan iman ketika kami melihat tanda-tanda kekuasaan Allah denga mata kepala kami sehingga iman kami menjadi ain al-yaqin (setelah sebelumnya adalah ilmu al-yaqin) seperti Ibrahim kekasih Allah yang meminta kepada Allah untuk di tujukan bagaimana menghidupka orang mati. Allah berfirman \"Dan (ingatlah) ketika Ibrahim berkata: “Ya Tuhanku, perlihatkanlah kepadaku bagaimana Engkau menghidupkan orang-orang mati”. Allah berfirman: “Belum yakinkah kamu?” Ibrahim menjawab: “Aku telah meyakinkannya, akan tetapi agar hatiku tetap mantap (dengan imanku) Allah berfirman: “(Kalau demikian) ambillah empat ekor burung, lalu cincanglah semuanya olehmu. (Allah berfirman): “Lalu letakkan diatas tiap-tiap satu bukit satu bagian dari bagian-bagian itu, kemudian panggillah mereka, niscaya mereka datang kepadamu dengan segera”. Dan ketahuilah bahwa Allah Maha Perkasa lagi Maha Bijaksana.\" (Al-Baqarah:260). Seorang hamba memerlukan tambahan ilmu, keyakinan, dan iman setiap saat. Oleh karena itu Allah berfirman, “Dan supaya kami yakin bahwa kamu telah berkata benar kepada kami,” yakni, kami mengetahui apa yang kamu bawa, bahwa ia adalah benar. “Dan kami menjadi orang-orang yang menyksikan hidangan itu.” Yakni, ia membawa kebaikanbagi orang yang datang sesudah kami. Kami menjadi saksi dalam hal ini, maka hujjah pun tegak dan bukti semakin bertambah kuat dengan itu. Manakala Isa mendengar itu dan mengetahui maksud mereka, dia mengabulkan permintaan mereka, dia bero’a, “ Ya Tuhan Kami, turunkanlah sekiranya kepada kami suatu hidangan kepada kami dari langit yang hari turunnya akan mejadi hari raya yaitu bagi orang-orang yang bersama kami kami dan yang datang sesudah kami, dan menjadi tanda bagi kekuasaanMu.” Maksudnya, hari turunnya di jadikan hari raya dan musim bagi memperingati hari bessar dari kekuasaan Allah itu ia kan selalu di ingatdan tidak di lupakan selama waktu dan tahun terus berganti, sebagaimana Allah menjadikan hari raya di manasik kamu Muslimin sebagai momen untuk mengingat kebesaranNya dan mengingat jalan para Rasul dan Sunnah mereka yang lurus, karunia dan kebaikanNya untuk mereka, “ Berilah Kami Rezeki, da Engkaulah Pemberi Rezeki yang paling utama.” Yakni di jadikan ia sebagai rezeki kami. Isa memohon agar hidangan itu di turunkan untuk dua kemaslahatan: Pertama, kemaslahatan agama, yaitu sebagai tanda kekuasan Allah yang kekal, dan Kedua, kemaslahatan dunia sebagai rezeki. “Allah berfirman, ‘Sesungguhnya aku akan menurunkan hidangan itu kapadamu, barangsiapa yang kafir sesudah di turunkannya hidangan itu, maka sesungguhnya aku akan menyiksanya dengan siksaan yang tidak pernah aku timpakan kepada seorang pun di antara umat manusia’.” Karena dia menyaksikan tanda kekusaan Allah yang mengagumkan dan dia kafir karena kesombongan dan pengingkaran, maka dia berhak mendapatkan siksa yang pedihdan hukuman yang berat. Ketahuilah bahwa Allah berjanji hendak menurunkannya, Dia mengancam mereka dengan ancaman itu jika mereka mengingkarinya, tetapi Dia tidak menyatakan akan menurunkannya. Ada kemungkinan, karena mereka tidak memilih ini. Ini di tunjukan bahwa ia tidak di sebut di dalam Injil yang ada di tangan orang-orang Nasrani dan sama sekali tidak ada indikasi ( bahwa itu terjadi ). Kemungkinan lain ia sudah di turunkan seperti yang di janjikan oleh Allah, karena Dia tidak menyelisihi janji, tetapi masalah ini tidak di singgung di dalam Injil, karena ia termasuk bagian di mana mereka di ingatkan denganNya tetapi mereka melupakanNya. Atau mereka memang tidak di sebt dalam Injil sama sekali, karena ia telah di warisi dari generasi ke generasi. Generasi berikut mengambil dari generasi sebelumnya, maka Allah merasa itu cukup tanpa harus di singgug di dalam Injil, dan makna ini di dukung oleh FirmanNya, “ dan kami jadikan orang-orang yang meyaksikan hidangan itu.” Dan Allah lebih mengetahui kenyataan yang sebenarnya. “Dan ingatlah ketika Allah berfirman, ‘ Hai Isa putra Maryam, adakah kamu mengatakan kepada manusia, ‘ Jadikanlah aku dan ibuku dua orang Tuhan selain Allah?’” ini adalah celaan terhadap orang-orang nasrani yang berkata, “ sesungguhnya Allah adalah satu dari tiga.” Maka Allah berfirman kepada Isa. Isa sendiri berlepas diri dari ucapan tersebut, dia berkata, “ Maha Suci Engkau” dari ucapan buruk ini dan dari segala yang tidak layak untukMu. “ Tidaklah patut bagu mengcapkan apa yang bukan hakku.” Yakni tidak layak dan tidak patut bagiku mengatakan sesuatu yang bukan sifat dan hakku, karena tiada suatu makhlukpun dari malaikat yang dekat kepada Allah, para nabi yang di utus, dan tidak pula selain mereka yang berhak menduduki derajat ketuhanan. Semuanya hany para hamba yang di atur, makhluk yang tunduk, dan fakir lagi tidak berdaya. “ Jika aku pernah mengatkanNya, maka tentulah engkau telah mengtahuiNya. Engkau mengetahui apa yang ada pada diriku dan aku tidak mengetahui apa yang ada pada diriMu.” Karena engkau lebih mengetahui apa yang keluar dariku, Engkau Maha Mengetahui yang ghaib. Ini termasuk kesempurnaan adab Al-Masih dalam berdialog dengan RabbNya, di mana dia tidak menjawab, “ Aku tidak mengatakan apa pun.” Tetapi dia hany menympaikan ucapan yang menafikan dari dirinya bahwa dia mengucapkan ucapan ucapan tersebut yang bertentangan dengan kedudukanNya yang mulia. Dan bahwa ini termasuk perkara yang mustahil, dan dia menyuciakan Allah dari itu dengan kesempurnaan dan mengembalikan ilmuNya kepada Dzat yang mengetahui yang ghaid dan yang Nampak. Kemudian dia secara jelas menyebutkan apa yang di perintahkan kepada Bani Israil, “Aku tidak pernah mengatakan kepada mereka kecuali apa-apa yang Engkau perintahkan kepadaKu untuk mengatakanNya,” aku hanyalah hamba yang mengikuti dan aku tidak lancang terhadap kebesaranMu, “Sembahlah Allah, Tuhanku, dan TUhanmu.” Yakni aku tidak memerintahkan mereka kecuali dengan ibadah kepada Allah semata dan mengikhlaskan agama untukNya yang mengandung larangan untuk mengangkat diriku dan ibuku dua tuhan selain Allah dan penjelasan bahwa aku hanyalah seorang hamba, sebagaimana Allah adalah Rabbmu, Dia juga Rabbku. “Dan aku menjadi saksi terhadap mereka, selama aku berada di antara mereka.” Aku menjadi saksi atas orang yang menunaikan perkara ini dan yang tidak menunaikan. “Maka setelah Engkau wafatkan (angkat) aku, Engkaulah yang mengawasi mereka.” Yang mengetahui rahasia-raahasia dana pa yang mereka sembunyikan. “Dan Engkau adalah Maha Menyaksikan atas segala sesuatu,” dengan ilmu, pendengaran, dan penglihatan. IlmuMu meliputi segala sesuatu yang diketahui, pendengaranMu meliputi segala sesuatu yang didengar dan penglihatanMu meliputi segala sesuatu yang dilihat. Engkau membalas para hamba dengan kebaikan dan keburukan yang Engkau ketahui pada mereka. “Jika Engkau menyiksa mereka, maka sesungguhnya mereka adalah hamba-hambaMU,” Engkau lebih menyayangi mereka daripada diri mereka sendiri dan Engkau lebih mengetahui keadaan mereka. Kalau mereka bukan hamba-hamba yang Bengal niscaya Engkau tidak menyiksa mereka. “Dan jika Engkau mengampuni mereka, maka sesungguhnya Engkau-lah Yang Mahaperkasa lagi Mahabijaksana.” Maksudnya, ampunanMu keluar dari kebijaksanaan dan kuasa yang sempurna, tidak seperti orang yang memaafkan dan mengampuni karena kelemahan dan ketidakmampuan. “Mahabijaksana,” di mana di antara kebijaksanaanNya adalah mengampuni orang yang melakukan sebab-sebab ampunan. “Allah berfirman,” menjelaskan keadaan hamba-hambaNya pada Hari Kiamat, siapa yang lulus dan siapa yang celaka, siapa yang berbahagia dan siapa yang sengsara, “Ini adalah suatu hari yang bermanfaat bagi orang-orang yang benar kebenaran mereka.” Orang-orang yang benar adalah orang-orang yang lurus dan petunjuk yang benar. Di Hari Kiamat mereka mendapatkan buah kebenaran ini jika Allah mendudukkan mereka di kursi kejujuran di sisi Maharaja Yang Maha Berkuasa. Oleh karena itu Allah berfirman, “Bagi mereka surga yang dibawahnya mengalir sungai-sungai, mereka kekal di dalamnya selama-lamanya, Allah ridha terhadap mereka dan mereka pun ridha terhadapNYa. Itulah keberuntungan yang paling besar.” Sementara itu orang-orang yang dusta adalah sebaliknya, mereka akan memikul mudarat kedustaan, kebohongan, dan buah amal mereka yang rusak. “Kepunyaan Allah-lah langit dan bumi.” Karena Dia-lah Penciptanya, yang mengatur dengan hukum takdirNya, hukum syar’iNya, dan hukum pembalasanNya. Oleh karena itu Dia berfirman, “Dan DIa Mahakuasa atas segala sesuatu.” Tidak ada sesuatu pun yang melemahkanNya, justru segala sesuatu tunduk kepada kehendakNya dan patuh kepada perintahNya"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 114: Yang akan dikenang dan dimuliakan. Dan tanda bagi kenabiannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 114",
    "description": "Nabi isa putra maryam menjawab permohonan al-hawa'riyyun dengan berdoa kepada Allah, ya tuhan kami, yang menguasai semua urusan, turunkanlah kepada kami hidangan yang lezat, nikmat, dan penuh berkah dari langit secara langsung, yang peristiwa turunnya hidangan ini akan menjadi hari raya, yakni menjadi peristiwa penting bagi kami, yaitu bagi orang-orang yang sekarang bersama kami, al-hawa'riyyun, maupun yang datang setelah kami, yaitu orang-orang yang beriman kepada Allah dan nabi Muhammad; dan turunnya hidangan ini akan menjadi tanda bagi kekuasaan engkau sekaligus menjadi mukjizat bagiku. Kami pun memohon kepada-Mu, ya Allah, berikanlah kepada kami rezeki yang halal dan berkah, karena engkaulah sebaik-baik pemberi rezeki kepada seluruh makhluk dengan adil dan merata. Allah mengabulkan doa nabi isa. Allah berfirman, sungguh, aku akan menurunkan hidangan itu kepadamu, wahai al-hawa'riyyun sebagaimana kalian minta, tetapi barang siapa di antara kamu setelah hidangan itu turun, menjadi kafir dengan mempertuhankan nabi isa dan ibunya, maryam, maka sungguh, aku akan mengazabnya di akhirat dengan azab khusus yang tidak pernah aku timpakan kepada seorang pun, baik sebelum maupun sesudah kamu di antara umat manusia seluruh alam. Kekufuran mereka itu ialah telah mempertuhankan manusia, yaitu nabi isa dan ibunya, setelah Allah mengutus para nabi dan rasul yang menegaskan bahwa tidak ada tuhan selain Allah dan tidak ada ibadah kecuali kepada-Nya. Isa putra maryam itu seorang rasul Allah dan maryam itu seorang perempuan salehah. Keduanya adalah manusia, tidak akan pernah menjadi tuhan."
  }
]