[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan sungguh Allah telah mengambil perjanjian yang dikukuhkan atas bani israil agar mereka mengikhlaskan ibadah hanya untukNya semata, dan Allah memerintahkan Musa untuk mengangkat dua belas pemimpin bagi mereka sesuai dengan jumlah suku-suku mereka, lalu mereka mengambil ikrar setia dari Bani israil untuk mendengar dan taat kepada Allah dan RasulNya serta kitabNya. Dan Allah berfirman kepada Bani israil, ”Sesungguhnya aku bersama kalian dengan perlindungan dan pertolonganKu. Sungguh jika kalian menegakkakn shalat, menyerahkan zakat yang wajib kepada orang-orang yang berhak menerimanya dan membenarkan rasul-rasul terkait apa yang mereka kabarkan kepada kalian dan kalian membela mereka, serta berinfak dijalanKu, pastilah aku akan hapuskan dari kalian dosa-dosa kalian, dan aku benar-benar masukkan kalian ke dalam surga-surga yang mengalir dibawah istana-istana dan pohon-pohonnya sungai-sungai. Maka barangsiapa mengingkari perjanjian tersebut dari kalian, sungguh dia telah melenceng dari jalan kebenaran menuju jalan kesesatan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "12. Allah telah mengambil perjanjian yang kokoh atas orang-orang Bani Israil dengan hal-hal yang akan disebutkan sebentar lagi. Dan Allah mengangkat dua belas orang pemimpin untuk mereka. Setiap pemimpin bertanggung jawab untuk memimpin anak buahnya. Allah berfirman kepada orang-orang Bani Israil, “Sesungguhnya Aku bersama kalian dengan memberikan pertolongan dan dukungan apabila kalian menunaikan salat dengan cara yang sesempurna mungkin, membayar zakat harta kalian, percaya kepada semua rasul-Ku tanpa membeda-bedakan satu sama lain, menghormati serta mendukung perjuangan mereka, dan membelanjakan harta kalian untuk kebaikan. Apabila kalian mau melaksanakan semua itu, pasti Aku akan menghapus dosa-dosa yang pernah kalian perbuat, dan kelak pada hari Kiamat, Aku akan memasukkan kalian ke dalam surga-surga yang di bawah istana-istananya mengalir sungai-sungai. Barangsiapa yang ingkar setelah pengambilan janji yang kokoh ini, berarti ia telah menyimpang dari jalan yang benar dengan sadar dan sengaja.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "12. Allah mengabarkan dengan penegasan yang kuat tentang peristiwa besar dalam sejarah Bani Israil ketika Dia mengambil perjanjian-perjanjian atas mereka. Dan menjadikan di antara mereka orang-orang yang memiliki pengetahuan yang luas yang menjadi tumpuan pada urusan kaum dan keluarga mereka dan sebagai rujukan bagi segala urusan mereka. Allah mendorong mereka untuk menepati dan memenuhi perjanjian yang telah mereka buat, dan Dia memberi kabar gembira kepada mereka bahwa Dia akan selalu bersama mereka, akan menjaga dan menolong mereka, dan menjanjikan bagi mereka ampunan dan pahala jika mereka mau menjaga shalat, menunaikan zakat, beriman dan patuh kepada rasul-rasul Allah, membela dan mengagungkan mereka, serta menginfakkan harta mereka di jalan kebaikan. Jika mereka melakukan ini niscaya Allah akan menghapus dosa-dosa mereka dan memasukkan mereka ke dalam surga-surga yang teduh yang dipenuhi dengan buah-buahan yang matang dan sungai-sungai yang mengalir. Namun Barang siapa yang ingkar kepada Allah setelah itu, dengan melanggar perjanjian atau mengingkarinya maka ia sungguh telah tersesat dari jalan kebenaran yang lurus."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "12. وَلَقَدْ أَخَذَ اللهُ مِيثٰقَ بَنِىٓ إِسْرٰٓءِيلَ (Dan sesungguhnya Allah telah mengambil perjanjian (dari) Bani Israil) Yakni mengambil perjanjian yang tercantum dalam akhir ayat ini. وَبَعَثْنَا مِنْهُمُ اثْنَىْ عَشَرَ نَقِيبًا ۖ (dan telah Kami angkat diantara mereka 12 orang pemimpin) Makna (النقيب) yakni pemimpin kaum yang dipilih untuk mengatur urusan mereka. Pendapat lain mengatakan para pemimpin tersebut ditugaskan untuk menjadikan pengikutnya beriman dan bertaqwa kepada Allah. Dan inilah makna dari pengangkatan mereka. وَقَالَ اللهُ إِنِّى مَعَكُمْ ۖ (dan Allah berfirman: “Sesungguhnya Aku beserta kamu) Kalimat ini ditujukan untuk bani Israil. Yakni inilah isi dari perjanjian ini. Dan maknanya adalah bahwa Aku bersamamu lewat pertolongan dan bantuan. لَئِنْ أَقَمْتُمُ الصَّلَوٰةَ (sesungguhnya jika kamu mendirikan shalat) Yakni kalian mendirikannya dengan sempurna sebagaimana yang disyari’atkan Allah. وَءَاتَيْتُمُ الزَّكَوٰةَ(dan menunaikan zakat) Yakni sedekah yang diwajibkan Allah atas mereka. وَءَامَنتُم بِرُسُلِى وَعَزَّرْتُمُوهُمْ (serta beriman kepada rasul-rasul-Ku dan kamu bantu mereka) Yakni dengan mengagungkan mereka, melawan musuh-musuh mereka, dan menolong mereka. وَأَقْرَضْتُمُ اللهَ قَرْضًا حَسَنًا (dan kamu pinjamkan kepada Allah pinjaman yang baik) Yakni kalian meninfakkannya di jalan kebaikan. فَمَن كَفَرَ بَعْدَ ذٰلِكَ (Maka barangsiapa yang kafir di antaramu sesudah itu) Yakni sesudah perjanjian ini. فَقَدْ ضَلَّ سَوَآءَ السَّبِيلِ (sesungguhnya ia telah tersesat dari jalan yang lurus) Yakni keluar dari jalan yang mengantarkan mereka menuju karidhaan Allah. Ini juga yang dilakukan oleh Rasulullah ketika hendak berhijrah ke Madinah, ketika suku Aus dan Khazraj menerima dakwahnya, ia menjadikan mereka dua belas kelompok, dan mengambil dari mereka perjanjian bahwa mereka tidak akan menyekutukan Allah, mendirikan syaari’at-syari’at Islam, dan melindungi serta menolongnya; dan menjanjikan mereka surga bagi mereka jika mereka memenuhi hal-hal tersebut; sebagaimana disebutkan dalam sejarah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Shalat adalah amalan terbesar seorang hamba, maka jika ia baik niscaya segala urusannya akan baik dunia dan akhirat, dan dalam keadaan bergulirnya fitnah kehidupan dunia yang kita jalani, serta besarnya tinggat kebutuhan, manusia tidak butuh mengantung kebutuhannya kepada selain Allah jika shalatnya baik, karena dengan karunia dari Allah semua prmasalahan akan terselesaikan : { إِنِّي مَعَكُمْ ۖ لَئِنْ أَقَمْتُمُ الصَّلَاةَ } \"Sesungguhnya Aku beserta kamu, sesungguhnya jika kamu mendirikan shalat\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "12 Dan sesungguhnya Allah telah mengambil perjanjian yang teguh dari Bani Israil untuk melaksanakan perintah ayat ini. Dan telah Kami angkat diantara mereka 12 orang pemimpin untuk menuntun mereka agar dapat memenuhi janjinya. Mereka adalah para pembesar mereka. Allah berfirman: “Sesungguhnya Aku beserta kamu, sesungguhnya jika kamu mendirikan shalat dengan menyempurnakan rukunnya dan menunaikan zakat yang telah diwajibkan kepadamu, serta beriman kepada rasul-rasul-Ku dan kamu bantu mereka dan kamu infakkan harta kalian kepada Allah dengan baik dan hanya mengharap keridhoan Allah maka sesungguhnya Aku akan menutupi dosa-dosamu. Dan sesungguhnya kelak di akhirat kamu akan Kumasukkan ke dalam surga yang kekal yang didalamnya mengalir sungai-sungai. Maka barangsiapa yang kafir di antaramu sesudah itu atas perjanjuan ini, maka dia benar-benar telah keliru dan keluar dari jalan yang menuntunnya kepada keridhaan dan keselamatan. Inilah perlakuan Nabi kepada suku Aus dan Khazraj pada Baiat Aqabah sebelum Hijrah ke Madinah. Nabi meminta baiat atau janji kepada mereka seperti yang telah disebutkan dan menjadikan 12 pemimpin untuk mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, Allah benar-benar telah mengambil perjanjian dengan Bani Israil dan Kami telah mengutus} mengangkat {di antara mereka dua belas orang pemimpin} pemimpin {Allah berfirman,“Aku bersama kalian. Sungguh jika kalian mendirikan shalat, menunaikan zakat, beriman kepada rasul-rasulKu dan membantu mereka} memuliakan dan menolong mereka {serta meminjamkan kepada Allah} berinfak di jalan Allah {pinjaman yang baik} infak dengan ikhlas dan baik bagi orang lain {pasti akan Aku hapus} akan Aku hapus {kesalahan-kesalahan kalian dan akan Aku masukkan kalian ke dalam surga yang mengalir di bawahnya sungai-sungai. Siapa saja yang kafir di antara kalian setelah itu, sungguh dia telah tersesat dari jalan yang lurus.”} menyimpang dari jalan yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "12. Allah memberitahukan bahwa dia telah mengambil perjanjian yang berat dan tegas di atas Bani Israil, dan ia menyebutkan kriteria perjanjian itu dan pahala mereka jika mereka melaksankannya dan dosa mereka jika mereka tidak melaksanakannya. Kemudian Allah menyatakan bahwa mereka tidak melakukannya, sekaligus menyebutkan dengan apa Dia menghukum mereka. FirmanNya, “ Dan sungguh Allah telah mengambil perjanjian dari Bani Israil,” yakni, perjanjian mereka yang berat lagi tegas. “ Dan telah kami angkat di antara mereka dua belas orang pemimpin,” maksudnya kepala dan pembesar yang lainya agar dia berpungsi sebagai pengawas, dan pendorong mereka untuk menunaikan apa yang diperintahkan kepada mereka, dan sebagai penyeru yang mengajak mereka. Allah berfirman kepada para pemimpin yang memikul tugas dan tanggung jawab, “Sesungguhnya aku beserta kamu,” yaitu dengan bantuan dan pertolongan, karena pertolongan tergantung kepada beratnya beban. Kemudian Allah menyebutkan perjanjianNya kepada mereka dengan FirmanNya, “Sesungguhnya bila kamu mendirikan shalat,” secara lahir maupun batin, dengan melakukan apa yang lazim dan semestinya di lakukan terus menerus, “dan menunaukan zakat,” dengan memberikannya kepada orang-orang yang berhak menerimanya. “ Serta beriman kepada Rasul-RasulKu,” seluruhnya di mana yang paling utama dan yang paling sempurna di antara mereka adalah Muhammad. “Dan kamu membantu mereka,” artinya, kalian mengagungkan, menghormati dan menaati mereka sebagamana semestinya. “ Dan kamu pinjamkan kepada Allah pinjaman yang baik,” yaitu, sedekah dan berbuat baik yang bersumber dari kejujuran, keihklasan dan hasil usaha yang baik. Jika kalian malakukan itu maka, ”sesungguhnya aku akan menghapus dosa-dosamu dan memasukanmu ke dalam syurga yang mengalir di bawahnya sungai-sungai.” Allah mengumpulkan untuk mereka dua hal: meraih apa yang dicintai yaitu syurga dan kenikmatan di dalamnya dengan di tolaknya sesuatu yang tidak di inginkan dengan dilemburkannya dosa-dosa dan di angkatnya hukuman yang merupakan akibat darinya. “Maka barangsiapa yang kafir diantara kamu sesudah itu,” yaitu sesudah perjanjian yang di tegaskan dengan sumpah dan kewajiban-kewajiban yang diiringi dengan dorongan dengan menyebutkan pahalanya, “maka sesungguhnya dia telah tersesat dari jalan yang lurus,” maksudnya tersesat dengan sengaja dan tahu, maka dia berhak mendapatkan hukuman dan tidak mendapatkan pahala yang mana hal itu memang berhak diraih oleh orang-orang yang sesat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 12: Yang akan disebutkan perjanjian itu di sini. Yang menjadi pengawas orang-orang yang berada di bawahnya, agar dia memantau mereka dan mendorong mereka mengerjakan apa yang diperintahkan. Kepada para pemimpin itu sekaligus sebagai penanggung jawab. Dengan memberikan bantuan dan pertolongan. Maksudnya berinfak di jalan-Nya dengan hati yang ikhlas."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 12",
    "description": "Setelah mengingatkan orang-orang yang beriman agar senantiasa melaksanakan kewajiban dan mensyukuri nikmat yang dianugerahkan Allah kepada mereka, pada ayat ini diingatkan sikap dan perilaku ahli kitab terhadap perjanjian-perjanjian mereka dengan Allah, agar orang-orang yang beriman tidak mengalami apa yang menimpa ahli kitab itu. Dan sungguh, Allah telah mengambil perjanjian dari bani israil, sebagaimana kami telah mengambil perjanjian pula dari kamu, wahai kaum muslim, dan kami telah mengangkat dengan mengutus nabi musa untuk memilih dua belas orang pemimpin di antara mereka yang bertugas membimbing mereka. Jumlah itu ditentukan sesuai dengan jumlah suku-suku bani israil pada masa itu. Dan Allah berfirman kepada bani israil, aku bersamamu, senantiasa melindungi dan menolong kamu, jika kamu memenuhi perjanjianmu dengan-ku. Bagian selanjutnya dari ayat ini menyebutkan sebagian dari tugas-tugas yang dibebankan kepada mereka. Sungguh, jika kamu melaksanakan salat dengan baik dan benar sesuai dengan syarat-syarat dan rukunnya, dan menunaikan dengan sempurna kewajiban zakat serta beriman kepada rasul-rasul-ku seluruhnya, dan kamu bantu mereka, kamu dukung dengan dukungan yang kuat dari gangguan orang-orang yang memusuhinya, dan kamu pinjamkan kepada Allah pinjaman yang baik dengan bersedekah dan berinfak di jalan Allah, pasti akan aku hapus kesalahan-kesalahanmu, dan pasti akan aku masukkan ke dalam surga yang mengalir di bawahnya sungai-sungai. Tetapi barang siapa kafir di antaramu dengan melanggar perjanjian dengan-ku setelah itu, yakni setelah diikatnya perjanjian itu, maka sesungguhnya dia telah tersesat dari jalan yang lurus. Tetapi, karena mereka melanggar janjinya dengan mengingkarinya bahkan membunuh rasul-rasul Allah, maka kami melaknat mereka, mereka kami jauhkan dari rahmat kami, dan kami jadikan hati mereka keras membatu, tidak dapat menerima ajakan beriman dan berbuat kebajikan, sebagaimana sesuatu yang keras membatu tidak dapat dibentuk lagi. Mereka suka mengubah firman Allah dari tempatnya, di antaranya keterangan-keterangan dalam kitab taurat tentang kedatangan nabi Muhammad dan sifat-sifatnya, dan mereka dengan sengaja melupakan sebagian pesan yang telah diperingatkan kepada mereka, di antaranya agar mereka beriman kepada nabi Muhammad. Engkau, wahai nabi Muhammad, senantiasa akan melihat dan mendengar, baik secara langsung maupun tidak langsung, pengkhianatan dari mereka terhadap dirimu, yakni pengkhianatan orang-orang yang menyatakan janji beriman kepada nabi Muhammad, kecuali sekelompok kecil di antara mereka yang tidak berkhianat, maka maafkanlah mereka atas kesalahan yang mereka perbuat, dan biarkan mereka, yakni jangan hiraukan mereka. Dengan demikian, engkau telah berbuat baik dengan membalas keburukan dengan kebaikan. Sungguh, Allah menyukai orang-orang yang berbuat baik."
  }
]