[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Lalu disebabkan oleh pelanggaran kaum yahudi terhadap perjanjian yang telah dilakukan pada mereka, kami usir mereka dari rahmat kami dan kami jadikan hati-hati mereka keras, sulit melunak untuk menerima keimanan, mereka mengubah kalamullah yang diturunkanNya pada Musa , yaitu taurat, dan meninggalkan sebagian pesan yang telah diperingatkan kepada mereka, sehingga mereka tidak mengamalkannya. Dan kamu (wahai rasul), akan senantiasa menjumpai dari kaum yahudi pengkhianatan dan kecurangan. Mereka itu berada di atas karakter para pendahulu mereka, kecuali sebagian kecil saja dari mereka. Maka maafkanlah bentuk interaksi buruk mereka kepadamu, dan berlapang dadalah menghadapi mereka, karena sesungguhnya Allah mencintai orang-orang yang berbuat baik dengan memaafkan dan berlapang dada terhadap orang yang berbuat buruk kepadanya. (demikianlah para pembela kebatilan mendapatkan jalan untuk mewujudkan tujuan-tujuan buruk mereka denagn cara mengubah-ubah kalamullah, dan mentakwilnya dengan arti yang tidak tepat. Maka apabila mereka tidak punya jalan untuk mengubah-ubah dan mentakwil,mereka meninggalkan apa-apa yang tidak sejalan denagn hawa nafsu mereka dari ajaran syariat Allah yang tidak ada yang bertahan di atasnya,kecuali sebagian kecil dari mereka yang Allah jaga)."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "13. Karena mereka telah melanggar perjanjian kokoh yang diambil atas mereka itu, maka Kami jauhkan mereka dari rahmat Kami dan Kami ubah hati mereka menjadi kasar dan keras sehingga tidak ada satu pun kebaikan yang bisa memasukinya dan tidak ada satu pun nasihat yang berguna baginya. Mereka suka mengubah kata-kata dalam susunan kalimatnya dengan cara mengganti kata-katanya dan menakwilkan maknanya dengan makna yang sesuai dengan selera mereka. Dan mereka tidak mau mengindahkan sebagian peringatan yang diberikan kepada mereka. Dan kamu -wahai Rasul- akan senantiasa menemukan pengkhianatan mereka kepada Allah dan hamba-hamba-Nya yang beriman. Hanya sedikit saja dari mereka yang menepati perjanjian yang diambil atas mereka. Maka maafkanlah mereka dan jangan menghukum mereka. Lupakanlah kesalahan mereka. Karena sikap itu merupakan sikap yang baik. Dan Allah menyukai orang-orang yang berbuat baik."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "13. Namun karena mereka melanggar perjanjian dan enggan mengikuti kebenaran maka mereka layak mendapatkan laknat, dijauhkan dari rahmat Allah, diharamkan dari kenikmatan-Nya, dan hati mereka dijadikan keras sehingga tidak peduli dengan kebaikan, tidak dapat menjadi lembut ketika berdzikir dan mendengar nasehat, dan tidak dapat terbuka untuk menerima ayat-ayat Allah agar dapat kembali ke jalan-Nya, sampai-sampai mereka berani bermain-main dengan ayat-ayat Allah dengan menambahkan, mengurangi, dan mengubah maknanya dengan takwil-takwil yang sesat dan tidak meletakkan lafadznya pada makna yang tepat sehingga ini menjadi tabiat dan kebiasaan mereka. Maka tidaklah mengherankan jika perbuatan mereka ini membuat mereka lupa terhadap kenikmatan yang banyak yang telah diingatkan kepada mereka yang berupa kebaikan dan hidayah. Dan kejahatan-kejahatan orang Yahudi yang silih berganti merupakan bukti bahwa mereka telah melanggar perjanjian-perjanjian dan bukti kebiasaan mereka menipu dan berkhianat, sehingga tidaklah berlalu suatu hari kecuali mereka membuat kejahatan-kejahatan yang tak terhingga di dalamnya. Allah telah menyeru dan menganjurkan untuk memaafkan dan memaklumi kesalahan untuk menyatukan hati dan menghilangkan kebencian. Allah mencintai hamba-hamba-Nya yang beriman yang membalas keburukan dengan kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "13. فَبِمَا نَقْضِهِم مِّيثٰقَهُمْ (karena mereka melanggar janjinya) Yakni disebabkan pelanggaran orang-orang Yahudi terhadap perjanjian dengan Allah. لَعَنّٰهُمْ(Kami kutuki mereka) Yakni Kami usir dan jauhkan mereka dari rahmat Kami. وَجَعَلْنَا قُلُوبَهُمْ قٰسِيَةً ۖ( dan Kami jadikan hati mereka keras membatu) Yakni keras dan tidak dapat menampung kebaikan dan tidak pula memahami dan menerima kebaikan tersebut. يُحَرِّفُونَ الْكَلِمَ عَن مَّوَاضِعِهِۦ ۙ( Mereka suka merubah perkataan (Allah) dari tempat-tempatnya) Yakni menggantinya dengan hal lain atau mentakwilkannya dengan takwil yang tidak benar. (lihat tafsir surat an-Nisa: 46) وَلَا تَزَالُ تَطَّلِعُ عَلَىٰ خَآئِنَةٍ مِّنْهُمْ (dan kamu (Muhammad) senantiasa akan melihat kekhianatan dari mereka) Makna (الخائنة) yakni perbuatan khianat, bohong, dan fujur. فَاعْفُ عَنْهُمْ وَاصْفَحْ ۚ (maka maafkanlah mereka dan biarkan mereka) Allah memerintahkan Rasulullah untuk memaafkan, membiarkan, dan meninggalkan peperangan dengan mereka. Lalu ayat ini dinasakh dengan surat at-Taubah:29 yang berbunyi: قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر “perangilah orang-orang yang tidak beriman kepada Allah dan tidak pula beriman kepada hari akhir” Allah memerintahkannya dalam ayat ini untuk memerangi mereka sampai mereka mau membayar jizyah dengan penuh kerendahan dan kehinaan."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Ibnu Mas'ud berkata : Sesunguhnya banyak diantara umat manusia melupakan sebagian dari ilmunya karena maksiat, kemudian beliau membaca firman Allah : { فَبِمَا نَقْضِهِمْ مِيثَاقَهُمْ لَعَنَّاهُمْ وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً ۖ يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ ۙ وَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ ۚ } \"(Tetapi) karena mereka melanggar janjinya, Kami kutuki mereka, dan Kami jadikan hati mereka keras membatu. Mereka suka merubah perkataan (Allah) dari tempat-tempatnya, dan mereka (sengaja) melupakan sebagian dari apa yang mereka telah diperingatkan dengannya\" 2 ). Sufyan in 'Uyainah ditanya : Apakah ilmu pengetahuan seseorang akan rusak karena dosa yang menimpa dirinya ? beliau kemudian berkata : bukankah Allah telah berfirman : { فَبِمَا نَقْضِهِمْ مِيثَاقَهُمْ لَعَنَّاهُمْ وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً ۖ يُحَرِّفُونَ الْكَلِمَ عَنْ مَوَاضِعِهِ ۙ وَنَسُوا حَظًّا مِمَّا ذُكِّرُوا بِهِ } \"(Tetapi) karena mereka melanggar janjinya, Kami kutuki mereka, dan Kami jadikan hati mereka keras membatu. Mereka suka merubah perkataan (Allah) dari tempat-tempatnya, dan mereka (sengaja) melupakan sebagian dari apa yang mereka telah diperingatkan dengan\" yaitu kitab Allah, yang merupakan sebaik-baiknya ilmu, dan peringatan terbesar yang akan mebiming mereka kepada kebenaran. 3 ). Memberi maaf bukanlah sebuah kekalahan, sebagaimana yang difahami sebagian orang, Allah berfirman : { فَاعْفُ عَنْهُمْ وَاصْفَحْ } \"maka maafkanlah mereka dan biarkan mereka\" , sungguh ini adalah kemenangan yang hakiki."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "13 Tetapi karena mereka melanggar janjinya, Kami jauhkan mereka dari rahmat kami, dan Kami jadikan hati mereka keras membatu dan tidak bisa menerima nasehat dan juga kebaikan. Mereka suka merubah perkataan Allah dari tempat-tempatnya atau tidak sesuai yang benar. Mereka sengaja melupakan sebagian dari janji-janji dan perintah agama yang telah diperingatkan kepada mereka. Dan kamu wahai Rasul senantiasa akan melihat pengkhianatan dan dusta dari mereka, kecuali hanya sedikit diantara mereka yang beriman atas risalahmu. Maka maafkanlah mereka, jangan engkau perangi mereka dan biarkanlah mereka. Sesungguhnya Allah menyukai atau menetapkan langkah orang-orang yang berbuat baik dan memberi maaf. Kemudian dinasakh dengan ayat 29 surat Attaubah: Qaatilulladzina"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{karena} karena {mereka melanggar janjinya, Kami melaknat mereka} Kami menjauhkan mereka dari rahmat Kami {dan Kami menjadikan hati mereka keras membatu} keras dan kaku. {Mereka suka mengubah firman-firman dari tempat-tempatnya, dan mereka melupakan} mengabaikan {sebagian} bagian {pesan yang telah diperingatkan kepada mereka. Kamu senantiasa akan melihat pengkhianatan} pengkhinatan {dari mereka, kecuali sekelompok kecil di antara mereka. Maka maafkanlah mereka dan biarkanlah. Sesungguhnya Allah menyukai orang-orang baik"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "13. Seolah-olah di katakan, “ Ada apa gerangan? Apa yang mereka lakukan? Apakah mereka menunaikan perjanjian yang telah Allah ambil atas mereka atau mereka mengingkarinya?” Allah menjelaskan bahwa mereka mengkhianatinya. Dia berfirman, “(Tetapi) karena mereka melanggar janjinya.” Artinya karena itulah Kami menghukum mereka dengan beberapa hukuman: Pertama: “Kami laknat mereka,” maksudnya, Kami jauhkan dan Kami usir mereka dari rahmat Allah karena mereka sendirilah yang telah menutup pintu rahmat, dengan melanggar perjanjian yang telah di ambil atas mereka yang merupakan penyebabnya yang paling besar. Kedua: FirmanNYa, “Dan Kami jadikan hati mereka keras membatu,” artinya, kasar, di mana nasihat tidak dapat mempengaruhinya, ayat-ayat dan peringatan tidak ada gunanya baginya. Berita gembira tidak mengugah mereka, peringatan keras yang menakutkan pun tidak berpengaruh apa pun, dan ini termasuk hukuman terbesar atas seorang hamba yang hatinya seperti itu, bahkan petunjuk dan kebaikan justru menambah keburukannya. Ketiga: Bahwa mereka merubah perkataan Allah dari tempat-tempatnya, artinya mereka ditimpakan bala pada diri mereka yaitu (kecintaan) merubah dan mengganti, maka ucapan diinginkan oleh Allah mereka beri makna yang tidak diinginkan oleh Allah dan RasulNya. Keempat: Bahwasanya mereka “(senagaja) melupakan sebagian dari apa yang mereka telah diperingatkan dengannya.” Mereka telah diberi peringatan dengan Taurat dan dengan apa yang diturunkan oleh Allah kepada Musa, maka mereka sengaja melupakan sebagian darinya. Ini mencakup melupakan ilmunya, bahwa mereka melupakannya dan ia pun hilang dari mereka dan apa yang Allah membuat mereka lupa kepadanya, banyak yang sudah tidak ada, dan itu merupakan hukuman dariNya atas mereka. Ini juga mencakup melupakan pelaksanaan yang berarti meninggalkan, mereka tidak diberi taufik untuk menunaikan apa yang diperintahkan kepada mereka. Dan ini dijadikan sebagai bukti atas Ahli Kitab dengan pengingkaran mereka terhadap sebagian dari apa yang telah disebutkan di dalam kitab mereka atau terjadi di zaman mereka bahwa itu termasuk yang mereka lupakan. Kelima: Pengkhianatan yang terus menerus, yang mana “kamu wahai Muhammad senantiasa akan melihat pengkhianatan dari mereka,” yaitu pengkhianatan kepada Allah dan hamba-hambaNya yang beriman. Di antara pengkhianatan mereka yang paling besar adalah penggelapan mereka terhadap dugaan yang benar dari orang yang menasehati dan berbuat baik kepada mereka dan membiarkan mereka di atas kekufuran; ini adalah pengkhianat besar. Sifat-sifat buruk ini bisa dimiliki oleh siapa pun yang memiliki sifat-sifat mereka. Siapa pun yang tidak melaksanakan apa yang diperintahkan oleh Allah dan menunaikan apa yang telah Dia wajibkan, maka Dia mendapatkan bagian laknat, kekerasan hati, ditimpa sikap merubah ucapan Allah. Dia tidak diberi taufik kepada kebenaran, dan melupakan sebagian dari apa yang mereka telah diperingatkan darinya, serta dia pasti ditimpa oleh penyakit berkhianat. Semoga Allah memberi kita keselamatan. Allah menamakan apa yang mereka diingatkan dengannya sebagai “bagian” karena ia adalah bagian terbesar, dan selainnya hanyalah bagian-bagian duniawi. Firman Allah: “Maka keluarlah Karun kepada kaumnya dalam kemegahannya. Berkatalah orang-orang yang menghendaki kehidupan dunia: \"Moga-moga kiranya kita mempunyai seperti apa yang telah diberikan kepada Karun; sesungguhnya ia benar-benar mempunyai keberuntungan yang besar\". (Al-Qashash:79). Dia berfirman tentang bagian yang berharga, “Sifat-sifat yang baik itu tidak dianugerahkan melainkan kepada orang-orang yang sabar dan tidak dianugerahkan melainkan kepada orang-orang yang mempunyai keuntungan yang besar.” (Fushshilat:35). Firman Allah, “Kecuali sedikit di antara mereka,” artinya yang sedikit ini memenuhi perjanjian Allah atas mereka, maka Allah memberi mereka taufik dan petunjuk ke jalan yang lurus. “Maka maafkanlah mereka dan biarkanlah mereka,” maksudnya, janganlah kamu menghukum mereka karena mereka telah menyakitimu di mana sebenarnya itu menuntut pemaafan darimu. Biarkanlah mereka, karena itu termasuk berbuat baik. Dan Allah “menyukai orang-orang yang berbuat baik.” Dan ihsan itu adalah bahwa kamu beribadah kepada Allah seolah-olah kamu melihatNya, kalaupun kamu tidak melihatNya, maka Dia melihatmu. Dan terkait dengan makhluk, ihsan adalah memberikan manfaat agama dan dunia buat mereka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 13: Menjauhkan mereka dari rahmat-Nya. Semua nasehat, ayat-ayat dan peringatan tidak bermanfaat bagi mereka. Targhib tidak membuat mereka terdorong mengerjakan perintah dan tarhib tidak membuat mereka berhenti mengerjakan larangan. Maksudnya merubah arti kata-kata, tempat atau menambah dan mengurangi, di antaranya tentang sifat-sifat Nabi Muhammad shallallahu 'alaihi wa sallam. Demikian juga mereka mena'wil maknanya yang tidak sesuai dengan makna yang diinginkan Allah dan rasul-Nya. Seperti pesan untuk mengikuti Nabi yang akan datang kepada mereka, yaitu Nabi Muhammad shallallahu 'alaihi wa sallam. Seperti melanggar perjanjian dan lainnya. Yaitu mereka yang masuk Islam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 13",
    "description": "Tetapi, karena mereka melanggar janjinya dengan mengingkarinya bahkan membunuh rasul-rasul Allah, maka kami melaknat mereka, mereka kami jauhkan dari rahmat kami, dan kami jadikan hati mereka keras membatu, tidak dapat menerima ajakan beriman dan berbuat kebajikan, sebagaimana sesuatu yang keras membatu tidak dapat dibentuk lagi. Mereka suka mengubah firman Allah dari tempatnya, di antaranya keterangan-keterangan dalam kitab taurat tentang kedatangan nabi Muhammad dan sifat-sifatnya, dan mereka dengan sengaja melupakan sebagian pesan yang telah diperingatkan kepada mereka, di antaranya agar mereka beriman kepada nabi Muhammad. Engkau, wahai nabi Muhammad, senantiasa akan melihat dan mendengar, baik secara langsung maupun tidak langsung, pengkhianatan dari mereka terhadap dirimu, yakni pengkhianatan orang-orang yang menyatakan janji beriman kepada nabi Muhammad, kecuali sekelompok kecil di antara mereka yang tidak berkhianat, maka maafkanlah mereka atas kesalahan yang mereka perbuat, dan biarkan mereka, yakni jangan hiraukan mereka. Dengan demikian, engkau telah berbuat baik dengan membalas keburukan dengan kebaikan. Sungguh, Allah menyukai orang-orang yang berbuat baik sebagaimana orang-orang bani israil mengingkari janjinya, demikian pula yang diperbuat oleh orang-orang nasrani. Dan di antara orang-orang yang mengatakan, kami ini orang nasrani, pengikut nabi isa, dan pembela ajarannya, kami telah mengambil perjanjian mereka, sebagaimana kami telah mengambil perjanjian dengan orang-orang yahudi, tetapi mereka dengan sengaja melupakan sebagian pesan yang telah diperingatkan kepada mereka di dalam kitab injil, maka kami timbulkan permusuhan dan kebencian di antara mereka, kelompok yang satu di antara orang-orang nasrani itu mengkafirkan kelompok lainnya dan mereka terus bertikai hingga hari kiamat. Dan kelak, yakni pada hari kiamat, Allah akan memberitakan kepada mereka apa yang telah mereka kerjakan yakni keburukan yang mereka lakukan dan memberikan balasan terhadap perbuatan mereka."
  }
]