[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan kami telah mengambil atas orang-orang yang mengaku-ngaku sebagai para pengikut Isa al-masih, (padahal mereka bukan pengikut-pengikutnya) dengan janji kuat yang telah Kami ambil dari bani israil, agar mereka mau berjalan mengikuti rasul mereka, dan menolong, serta mendukungnya. kemudian mereka mengganti agama mereka dan meninggalkan sebagian pesan yang telah diperingatkan kepada mereka, mereka tidak mau mengamalkannya, sebagaimana telah dilakukan oleh kaum yahudi. Kemudian kami munculkan di tengah mereka permusuhan dan kebencian hingga hari kiamat. Dan Kami akan memberitahukan kepada mereka apa yang dahulu mereka perbuat pada hari perhitungan amal, dan akan menyiksa mereka atas perbuatan buruk mereka tersebut."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "14. Sebagaimana Kami mengambil perjanjian yang kokoh atas orang-orang Yahudi, Kami pun mengambilnya atas orang-orang yang mengaku bahwa mereka adalah pengikut Isa -‘alaihissalām-. Tetapi kemudian mereka tidak mengindahkan sebagian peringatan yang diberikan kepada mereka seperti para pendahulu mereka dari kalangan Yahudi. Dan Kami lemparkan ke tengah-tengah mereka rasa permusuhan dan kebencian, sehingga mereka senantiasa saling menyerang, saling bertengkar, dan saling mengafirkan satu sama lain. Dan kelak Allah akan memberitahu mereka apa yang pernah mereka perbuat, dan akan memberi mereka balasan yang setimpal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "14. Allah menjelaskan keadaan golongan lain yang mengaku sebagai penolong Isa Al-masih. Namun bagaimana mereka mengakui itu padahal telah diambil perjanjian dari mereka namun mereka melupakan dan menggantinya, dan mereka terjerumus ke dalam kesesatan dan sikap berlebih-lebihan sehingga mereka terpecah-belah menjadi golongan-golongan yang banyak. Keadaan mereka itu merupakan balasan karena telah melupakan perjanjian dan karena sifat permusuhan dan kebencian telah merasuki hati mereka dan tinggal di hati mereka, sehingga mereka tidak dapat bersatu dan tidak saling menyayangi; namun mereka saling berperang, dan yang kuat menzalimi yang lemah. Dan setiap golongan dari mereka mengaku bahwa merekalah yang berada di atas kebenaran dan menganggap golongan lain berada dalam kekafiran. Dan Alla"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "14. وَمِنَ الَّذِينَ قَالُوٓا۟ إِنَّا نَصٰرَىٰٓ أَخَذْنَا مِيثٰقَهُمْ (Dan diantara orang-orang yang mengatakan: “Sesungguhnya kami ini orang-orang Nasrani”, ada yang telah kami ambil perjanjian mereka) Yakni Kami mengambil dari orang-orang Nasrani perjanjian dengan mereka, seperti perjanjian dengan Bani Israil sebelumnya. فَنَسُوا۟ حَظًّا مِّمَّا ذُكِّرُوا۟ بِهِۦ(tetapi mereka (sengaja) melupakan sebagian dari apa yang mereka telah diberi peringatan dengannya) Yakni mereka melalaikan banyak perjanjian yang telah mereka sepakati. فَأَغْرَيْنَا بَيْنَهُمُ الْعَدَاوَةَ وَالْبَغْضَآءَ(maka Kami timbulkan di antara mereka permusuhan dan kebencian) Yakni antara orang-orang Yahudi dan Nasrani. Pendapat lain mengatakan yakni permusuhan antara orang-orang Nasrani sendiri, yang terpecah menjadi kelompok Ya’qubiyah, Nasthuriyah, dan Malakaniyah; dan mereka saling mengkafirkan satu sama lain dan saling menunjukkan permusuhan diantara mereka. وَسَوْفَ يُنَبِّئُهُمُ اللهُ بِمَا كَانُوا۟ يَصْنَعُونَ (Dan kelak Allah akan memberitakan kepada mereka apa yang mereka kerjakan) Yakni mereka akan mendapatkan balasan atas pelanggaran mereka terhadap perjanjian itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "14 Dan juga Kami ambil janji/baiat yang teguh kepada orang-orang Nashrani untuk mentaati Allah dan mengikuti para Rasul. Seperti janji Bani Israil. Kemudian mereka meninggalkan atau tidak memperdulikan diantara janji mereka, dan hukum-hukum syariat. Sehingga Kami timbulkan permusuhan dan kemarahan di antara Yahudi dan Nashrani, atau khususnya di antara orang Nashrani. Sehingga terpecah menjadi kelompok-kelompok, sekte-sekte, saling mengingkari Kami timbulkan di antara mereka permusuhan dan kebencian sampai hari kiamat. Dan kelak Allah akan memberitakan kepada mereka apa yang mereka kerjakan juga akan diberi balasan atas pengkhianatan janji mereka."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Dari orang-orang yang berkata, “Sesungguhnya kami adalah orang Nasrani,” Kami telah mengambil perjanjian. Lalu mereka melupakan sebagian pesan yang telah diperingatkan kepada mereka. Lalu Kami menimbulkan} Kami menimbulkan dan meletakkan {permusuhan dan kebencian di antara mereka hingga hari kiamat. Allah akan memberitakan kepada mereka} memberitahukan kepada mereka {apa yang selama ini mereka perbuat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "14. Maksudnya, sebagaimana Kami telah mengambil perjanjian dari orang Yahudi, maka Kami juga mengambil perjanjian dari orang-orang yang berkata, “Kami adalah Nasara bagi Isa bin Maryam,” dan mereka mentazkiyah diri mereka dengan iman kepada Allah dan Rasul-rasulNya serta apa yang mereka bawa, akan tetapi mereka juga membatalkan perjanjian “dan melupakan dengan sengaja sebagian dari apa yang mereka telah diperingatkan darinya” baik melupakan ilmu maupun melupakan amal. “Maka Kami timbulkan di antara mereka permusuhan dan kebencian sampai Hari Kiamat,” maksudnya, Kami kuasakan sebagian dari mereka atas sebagian yang lain, di antara mereka timbul kerusuhan dan kedengkian yang menyebabkan sebagian dari mereka membenci dan memusuhi sebagian yang lain sampai Hari KIamat. Ini adalah perkara yang nyata terjadi, di mana orang-orang Nasrani selalu dan senantiasa dalam kebencian, permusuhan, dan persengketaan. “Dan kelak Allah akan memberitakan kepada mereka apa yang selalu mereka kerjakan.” Lalu Dia akan menghukum mereka karenanya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 14: Sebagaimana orang-orang Yahudi diambil janjinya. Yakni Kami berikan kekuasaan sebagiannya terhadap sebagian yang lain dan timbul permusuhan antara sesama mereka sampai hari kiamat seperti yang kita saksikan, di mana orang-orang Nasrani antara yang satu dengan yang lain senantiasa dalam kebencian, permusuhan dan pertengkaran. Serta akan memberikan balasan terhadapnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 14",
    "description": "Sebagaimana orang-orang bani israil mengingkari janjinya, demikian pula yang diperbuat oleh orang-orang nasrani. Dan di antara orang-orang yang mengatakan, kami ini orang nasrani, pengikut nabi isa, dan pembela ajarannya, kami telah mengambil perjanjian mereka, sebagaimana kami telah mengambil perjanjian dengan orang-orang yahudi, tetapi mereka dengan sengaja melupakan sebagian pesan yang telah diperingatkan kepada mereka di dalam kitab injil, maka kami timbulkan permusuhan dan kebencian di antara mereka, kelompok yang satu di antara orang-orang nasrani itu mengkafirkan kelompok lainnya dan mereka terus bertikai hingga hari kiamat. Dan kelak, yakni pada hari kiamat, Allah akan memberitakan kepada mereka apa yang telah mereka kerjakan yakni keburukan yang mereka lakukan dan memberikan balasan terhadap perbuatan merekasetelah ayat-ayat yang lalu menjelaskan perilaku buruk kedua kelompok ahli kitab, yahudi dan nasrani, ayat ini mengajak mereka agar beriman kepada nabi Muhammad. Wahai ahli kitab, kaum yahudi dan nasrani, pemilik kitab suci yang diturunkan kepada nabi musa dan nabi isa! sungguh, rasul kami yang diberitakan kedatangannya oleh nabi musa dan nabi isa, yaitu nabi Muhammad, telah datang kepadamu, menjelaskan kepadamu banyak hal dari isi yang terkandung dalam kitab yang kamu sembunyikan, seperti kedatangan nabi Muhammad dan banyak pula yang dibiarkannya, tidak dijelaskan karena tidak membawa maslahat bagi kamu. Sungguh, telah datang kepadamu cahaya dari Allah, yakni nabi Muhammad, dan kitab, yakni Al-Qur'an, yang menjelaskan segala sesuatu yang diperlukan manusia dalam kehidupan beragam."
  }
]