[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai Ahli kitab dari kalangan yahudi dan nasrani, sungguh telah datang kepada kalian Rasul kami, Muhammad ,yang menjelaskan kepada kalian banyak hal yang kalian tutup-tutupi dari manusia yang terdapat dalam taurat dan injil, dan dia akan meninggalakan penjelasan hal-hal yang tidak sejalan dengan tuntutan hikmah. Sungguh telah datang kepada kalian dari Allah cahaya dan kitab yang nyata, yaitu al-qur’an al-karim."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "15. \"Wahai orang-orang ahli kitab dari kalangan Yahudi yang memiliki kitab suci Taurat dan orang-orang Nasrani yang memiliki kitab suci Injil, utusan Kami telah datang kepada kalian, Muhammad -ṣallallāhu 'alaihi wa sallam- yang menerangkan banyak hal yang dahulu kamu sembunyikan dari kitab suci yang diturunkan kepada kalian. Dan ia memaafkan banyak kesalahan kalian yang tidak ada kemaslahatan di dalamnya selain membuka aib kalian. Kitab suci Al-Qur`ān dari sisi Allah telah datang kepada kalian sebagai cahaya yang menerangi jalan dan kitab suci yang menjelaskan segala hal yang dibutuhkan oleh umat manusia, baik yang berkaitan dengan urusan duniawi maupun ukhrawi."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "15. setelah Alquran membahas keadaan dua golongan, yaitu golongan Yahudi dan Nasrani, maka kemudian Allah menyeru mereka untuk beriman kepada Nabi Muhammad yang datang untuk menjelaskan kepada mereka berbagai kejadian dan kenyataan yang ada dalam Taurat dan Injil yang banyak disembunyikan. Banyak kejadian dan kenyataan yang disembunyikan dan dilalaikan oleh para pendeta dari para pengikut mereka, seperti ayat-ayat yang menjelaskan sifat-sifat nabi, ayat tentang hukum rajam, dan kenyataan-kenyataan serta hukum-hukum lainnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "15. قَدْ جَآءَكُمْ رَسُولُنَا (sesungguhnya telah datang kepadamu Rasul Kami) Yakni Nani Muhammad. يُبَيِّنُ لَكُمْ كَثِيرًا مِّمَّا كُنتُمْ تُخْفُونَ مِنَ الْكِتٰبِ(menjelaskan kepadamu banyak dari isi Al Kitab yang kamu sembunyi kan) Yakni kitab yang diturunkan kepada kalian yaitu Taurat dan Injil, seperti menyembunyikan ayat yang menjelaskan tentang hukuman Rajam, dan kisah tentang orang-orang yang melanggar di hari sabtu yang kemudian dikutuk menjadi kera. وَيَعْفُوا۟ عَن كَثِيرٍ ۚ( dan banyak (pula yang) dibiarkannya) Yakni yang mereka sebunyikan dan tidak mereka jelaskan kepada manusia. Pendapat lain mengatakan maknanya adalah Allah memaafkan kebanyakan dari mereka sehingga tidak menghukum meraka atas perbuatan yang mereka lakukan. قَدْ جَآءَكُم مِّنَ اللهِ نُورٌ(Sesungguhnya telah datang kepadamu cahaya dari Allah) Cahaya yakni Nabi Muhammad. Pendapat lain mengatakan yakni agama Islam atau al-Qur’an."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "15 Hai Yahudi dan Nasrani, sesungguhnya telah datang kepadamu Rasul Kami Muhammad, yang menjelaskan kepadamu tentang banyak isi Al-Kitab yang kamu sembunyikan, yaitu Taurat dan Injil. Banyak ayat-ayat kalian sembunyikan yang dibiarkannya seperti ayat rajam, dan merubah ahshab Sabt menjadi kera. Sesungguhnya telah datang kepadamu cahaya dari Allah berupa Al-quran atau islam atau Muhammad yang menerangkan jalan kebenaran dan petunjuk, dan Kitab yang menerangkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Ahlul kitab, sungguh rasul Kami telah datang kepada kalian untuk menerangkan} menjelaskan {banyak hal yang kalian sembunyikan} sembunyikan {dari kitab suci dan mereka juga membiarkan} membiarkan {banyak hal Sungguh telah datang kepada kalian dari Allah sebuah cahaya} cahaya, yaitu nabi Muhammad SAW {dan kitab yang jelas} Al-Qur’an yang jelas"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "15. Setelah Allah menjelaskan bahwa Dia telah mengambil perjanjian atas orang-orang Yahudi dan Nasrani dan bahwa mereka membatalkannya kecuali hanya sedikit dari mereka, maka Allah memerintahkan mereka semua agar beriman kepada Muhammad, Allah berhujjah atas mereka dengan ayat yang qath’i (tak terbantahkan) yang menunjukkan kebenaran kenabiannya, yaitu bahwa dia menjelaskan banyak perkara yang mereka sembunyikan dari manusia bahkan dari orang-orang awam dari pemeluk agama mereka sendiri. Jika mereka adalah orang-orang yang ditunjuk dalam urusan ilmu, dan pada waktu itu tidak seorang pun yang memiliki ilmu kecuali apa yang mereka miliki, maka orang yang benar-benar ingin mendapatkan ilmu tidak memiliki jalan untuk mengetahuinya kecuali dari mereka, maka kehadiran Rasulullah dengan membawa al-Quran yang agung ini di mana dengannya dia menjelaskan apa yang mereka rahasiakan di antara mereka, sementara beliau adalah seorang yang ummi (buta huruf) tidak membaca dan tidak menulis, maka itu adalah bukti terkuat atas kerasulannya. Itu seperti sifat Muhammad dalam kitab-kitab mereka dan tercantumkannya berita gembira tentang kedatangannya dalam kitab-kitab mereka, juga penjelasan tentang ayat rajam dan lain sebagainya. “Dan banyak pula yang dibiarkannya,” maksudnya tidak menjelaskan apa yang tidak dituntut oleh hikmah. “Sungguh telah datang kepadamu cahaya dari Allah,” yaitu al-Quran yang digunakan sebagai penerang dalam kegelapan, kebodohan, dan kesesatan, “Dan kitab yang menerangkan” segala perkara dunia dan agama, ilmu tentang Allah, nama-nama, sifat-siifatNya dan perbuatan-perbuatanNya serta hukum-hukum syar’I dan hukum-hukum yang berkaitan dengan balasan, di mana semua itu diperlukan oleh manusia."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 15: Taurat dan Injil. Seperti ayat tentang rajam dan lainnya. Jika tidak ada maslahatnya selain membuka aibmu atau tidak sejalan dengan hikmah-Nya. Cahaya di sini maksudnya Nabi Muhammad shallallahu 'alaihi wa sallam, sedangkan kitab, maksudnya adalah Al Quran. Adapula yang mengartikan \"cahaya\" di sini dengan Al Qur'an, di mana kegelapan kebodohan dan kesesatan dapat diterangi olehnya. Sedangkan maksud kitab yang menjelaskan adalah bahwa kitab Al Qur'an menerangkan segala yang dibutuhkan manusia tentang perkara agama maupun perkara dunia, seperti pengetahuan tentang Allah, nama-nama-Nya, sifat dan perbuatan-Nya, demikian juga pengetahuan tentang hukum-hukum syari'at-Nya dan hukum-hukum jazaa'i (pembalasan terhadap amal)."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 15",
    "description": "Setelah ayat-ayat yang lalu menjelaskan perilaku buruk kedua kelompok ahli kitab, yahudi dan nasrani, ayat ini mengajak mereka agar beriman kepada nabi Muhammad. Wahai ahli kitab, kaum yahudi dan nasrani, pemilik kitab suci yang diturunkan kepada nabi musa dan nabi isa! sungguh, rasul kami yang diberitakan kedatangannya oleh nabi musa dan nabi isa, yaitu nabi Muhammad, telah datang kepadamu, menjelaskan kepadamu banyak hal dari isi yang terkandung dalam kitab yang kamu sembunyikan, seperti kedatangan nabi Muhammad dan banyak pula yang dibiarkannya, tidak dijelaskan karena tidak membawa maslahat bagi kamu. Sungguh, telah datang kepadamu cahaya dari Allah, yakni nabi Muhammad, dan kitab, yakni Al-Qur'an, yang menjelaskan segala sesuatu yang diperlukan manusia dalam kehidupan beragam Allah menyatakan sekali lagi pada ayat ini jalan keselamatan bagi orang-orang yang beriman yaitu dengan mengikuti petunjuk dan tuntunan kitab suci Al-Qur'an. Dengan kitab itulah Allah memberi petunjuk kepada orang yang dengan sungguh-sungguh mengikuti keridaan-Nya, mengantarkan ke jalan keselamatan, yaitu dengan beriman kepada-Nya, dan dengan kitab itu pula Allah mengeluarkan orang itu dari gelap gulita, yaitu kegelapan kufur kepada Allah dan mengantarkan kepada cahaya, yaitu iman kepada Allah, dengan izin-Nya, dan menunjukkan ke jalan yang lurus, jalan kebahagiaan, baik di dunia maupun di akhirat."
  }
]