[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah memberi petunjuk dengan kitab yang nyata ini kepada orang-orang yang mengikuti keridhaan Allah ke jalan-jalan keamanan dan keselamatan, dan mengeluarkan mereka dengan izinNya dari kegelapan-kegelapan kekafiran menuju cahaya keimanan, dan memberikan taufik bagi mereka menuju agamaNya yang lurus."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "16. Melalui kitab ini Allah menunjukkan orang yang mengikuti apa yang diridai-Nya, yaitu iman dan amal saleh ke jalan yang menyelamatkannya dari azab Allah, yaitu jalan menuju Surga, dan mengeluarkannya dari gelapnya kekafiran dan kemaksiatan menuju terangnya keimanan dan ketaatan atas izin-Nya, serta membimbingnya ke jalan yang lurus, yaitu agama Islam."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "16. Nabi Muhammad merupakan cahaya dari Allah, sebab dia datang membawa petunjuk dan kebenaran. Dan Al-quran juga merupakan cahaya yang agung dan kitab yang jelas, sebab ia menerangi Jalan bagi manusia, menjelaskan apa yang samar bagi mereka, dan meruntuhkan gelapnya keraguan dan kebingungan; ia adalah petunjuk menuju jalan hidayah dan keselamatan di dunia dan di akhirat, yang dapat mengeluarkan dari gelapnya berbagai fitnah dan kesesatan menuju cahaya keselamatan dan petunjuk."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "16. يَهْدِى بِهِ اللهُ مَنِ اتَّبَعَ رِضْوٰنَهُۥ (Dengan kitab itulah Allah menunjuki orang-orang yang mengikuti keridhaan-Nya) Yakni mengikuti apa yang diridhai Allah. سبل السلام (jalan-jalan keselamatan) Yakni jalan-jalan keselamatan yang menjauhkan dari azab menuju ke nageri kesejahteraan yaitu surga yang tidak ada kekurangan didalamnya. وَيُخْرِجُهُم مِّنَ الظُّلُمٰتِ (dan (dengan kitab itu pula) Allah mengeluarkan orang-orang itu dari gelap gulita) Yakni gelapnya kekafiran. إِلَى النُّورِ(kepada cahaya) Yakni cahaya Islam. Ikrimah berkata: sesungguhnya Rasulullah pernah didatangi orang-orang Yahudi lalu menanyainya tentang hukum rajam. Maka Rasulullah bertanya kepada mereka: “siapakah orang yang paling berilmu diantara kalian?”. Merekapun menunjuk pada Ibnu Shuriyya, lalu Rasulullah memintanya untuk bersumpah atas nama Dzat yang menurunkan Taurat kepada Musa, mengangkat bukit Thur, dan atas perjanjian-perjanjian yang mereka ambil; maka orang itu merasa gemetar dan berkata: ketika telah banyak orang yang berzina diantara kami, kami mencambuk mereka sebanyak 100 kali dan kami mencukur rambut mereka –yakni mereka meninggalkan hukum rajam– . maka Rasulullah menghukum para pezina dari kaum Yahudi dengan hukuman rajam. Dan turunlah ayat ini."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "16 Dengan kitab Al-quran itulah Allah menunjuki orang-orang yang mengikuti keridhaan-Nya ke jalan keselamatan dari bencana dunia dan akhirat. Dan dengan kitab itu pula) Allah mengeluarkan orang-orang itu dari kegelapan kekufuran dan kebodohan menuju cahaya keimanan dan ilmu yang terang benderang dengan taufik dan kehendak-Nya, dan menunjuki mereka ke jalan yang lurus yaitu Islam. Ini disebutkan yang kedua sebagai penjelas bahwa jalan Islam adalah jalan yang lurus."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Dengannya Allah menunjukkan kepada orang yang mengikuti ridhaNya jalan-jalan keselamatan} jalan-jalan keselamatan dari azab {mengeluarkan mereka dari berbagai kegelapan menuju cahaya dengan izinNya, dan menunjukkan kepada mereka jalan} jalan {yang lurus"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "16. Kemudian Allah menyebutkan siapa yang meraih petunjuk dengan al-Quran ini, dan apa sebab yang membuat seorang hamba meraih itu, maka FirmanNya “Dengan kitab itu Allah menunjuki orang-orang yang mengikuti keridhaanNya ke jalan keselamatan.” Maksudnya, Allah memberi petunjuk kepada orang yang bersungguh-sungguh dan berusaha keras mencapai ridha Allah dan meletakkan target yang baik yaitu jalan keselamatan yang menyelamatkan pemiliknya dari azab dan mengantarkannya ke negeri keselamatan, yaitu keilmuan tentang kebenaran dan mengamalkannya secara global dan terperinci. Dan mengeluarkan mereka dari kegelapan kekufuran, bid’ah, kemaksiatan, ilmu dan dzikir. Semua itu adalah hidayah dengan izin Allah, di mana apa yang Dia kehendaki pasti terjadi dana pa yang tidak Dia kehendaki tidak akan terjadi. “Dan Dia menunjuki mereka ke jalan yang lurus.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 16: Berupa mengetahui yang benar dan mengamalkannya, di mana hal itu dapat membawanya ke Darussalam (surga). Allah mengeluarkan mereka dari gelapnya kekafiran kepada cahaya iman, dari gelapnya kebid'ahan kepada cahaya sunnah, dari gelapnya kemaksiatan kepada cahaya taat, dari gelapnya kebodohan kepada cahaya pengetahuan dan dari gelapnya kelalaian kepada cahaya dzikr."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 16",
    "description": "Allah menyatakan sekali lagi pada ayat ini jalan keselamatan bagi orang-orang yang beriman yaitu dengan mengikuti petunjuk dan tuntunan kitab suci Al-Qur'an. Dengan kitab itulah Allah memberi petunjuk kepada orang yang dengan sungguh-sungguh mengikuti keridaan-Nya, mengantarkan ke jalan keselamatan, yaitu dengan beriman kepada-Nya, dan dengan kitab itu pula Allah mengeluarkan orang itu dari gelap gulita, yaitu kegelapan kufur kepada Allah dan mengantarkan kepada cahaya, yaitu iman kepada Allah, dengan izin-Nya, dan menunjukkan ke jalan yang lurus, jalan kebahagiaan, baik di dunia maupun di akhirat setelah menjelaskan fungsi diutusnya para rasul dan kedatangan kitab suci sebagai petunjuk ke jalan keselamatan, ayat ini menjelaskan bahwa salah satu kegelapan yang menyelubungi jiwa dan pikiran ahli kitab adalah kepercayaan mereka tentang tuhan. Sungguh, telah kafir orang-orang, yakni segolongan orang-orang nasrani, yang berkata, sesungguhnya Allah itu dialah al-masih putra maryam, yakni bahwa isa al-masih adalah tuhan atau anak tuhan. Keyakinan mereka itu sungguh sesat. Untuk membuktikan kesesatan itu, katakanlah, wahai nabi Muhammad, siapakah yang dapat menghalang-halangi kehendak Allah, jika dia hendak membinasakan al-masih putra maryam itu beserta ibunya dan seluruh manusia yang berada di bumi' tentu tidak ada. Dan milik Allah-lah kerajaan langit dan bumi dan apa yang ada di antara keduanya. Semuanya tunduk dan patuh kepada kehendak Allah. Dia menciptakan apa yang dia kehendaki sesuai dengan cara yang dipilih-Nya, di antaranya menciptakan seorang manusia tanpa ayah yaitu nabi isa. Dan Allah mahakuasa atas segala sesuatu."
  }
]