[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sungguh telah kafir kaum nasrani yang mengatakan bahwa sesungguhnya Allah itu adalah Isa –almasih putra Maryam. Katakanlah (wahai Rasul), kepada orang-orang bodoh dari kalangan Nasrani itu, ”Seandainya isa al-masih adalah tuhan, sebagaimana yang mereka klaim, tentulah dia akan sanggup menolak ketetapan Allah, apabila ketetapan itu datang kepadanya untuk membinasakannya dan membinasakan ibunya dan seluruh orang yang berada di muka bumi semuanya. Dan sungguh ibunda isa telah meninggal, namun Isa tidak dapat menepis kematian dari ibunya. Begitu pula, dia tidak dapat menghalnginya dari dirinya sendiri. Karena sesungguhnya mereka berdua adalah termasuk hamba-hamba Allah, yang tidak mampu menolak kematian dari diri mereka berdua. Maka ini merupakan dalil yang menunjukan bahwa sesungguhnya isa adalah manusia biasa seperti layaknya segenap anak keturunan Adam, Dan semua objek yang ada di langit dan muka bumi adalah milik Allah, Dia menciptakan apa yang dikehendakiNya dan mengadakannya. Dan Dia maha kuasa atas segala sesuatu. Atas dasar itu, hakikat tauhid menuntut pengesaan Allah dengan memiliki sifat-sifat Rububiyah dan Uluhiyah, maka tidak ada siapapun yang menyertaiNya dari makhlukNya dalam hal tersebut. Dan kebanyakan manusia terjerumus kedalam kesyirikan dan kesesatan akibat pengkultusan mereka terhadap pribadi para nabi dan orang-orang shalih, sebagaimana kaum nasrani mengkultuskan pribadi isa al-masih. Maka alam smesta ini semuanya adalah milik Allah dan hak menciptakan ada di tanganNya semata. Dan apa yang muncul dari kejadian luar biasa dan tanda-tanda kekuasaan, semua itu kembali tergantung kepada Allah. Dia menciptakan apa saja yang dikehendakiNya dan berbuat apa yang diinginkanNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "17. Sungguh telah kafir orang-orang Nasrani yang mengatakan bahwa Allah adalah Isa putra Maryam. Katakanlah kepada mereka -wahai Rasul-, “Siapa yang mampu mencegah Allah jika Dia membinasakan Al-Masih Isa putra Maryam, membisanakan ibunya, dan membinasakan semua orang yang ada di muka bumi jika Dia berkehendak membinasakan mereka? Jika tidak ada seorang pun yang mampu mencegah Allah melakukan hal itu, berarti tidak ada tuhan yang berhak disembah selain Allah sedangkan mereka semua, yaitu Isa, ibunya, dan makhluk-makhluk lainnya adalah ciptaan Allah. Langit dan bumi beserta isinya adalah milik Allah. Dia bisa menciptakan apa saja yang Dia kehendaki. Salah satu ciptaan-Nya ialah Isa -‘alaihissalām-, ia seorang hamba dan utusan Allah. Dan Allah Mahakuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "17. Ayat ini menegaskan kekafiran orang yang meyakini bahwa Isa al-Masih adalah anak Allah. Dia hanyalah manusia biasa yang diangkat menjadi rasul yang tidak mampu mendatangkan manfaat atau mudharat bagi dirinya sendiri. Dan jika Allah berkehendak untuk membinasakan Isa dan ibunya serta seluruh manusia yang ada di bumi maka tidak ada seorang makhluk pun yang mampu menghalangi-Nya. Dan seluruh yang ada di langit dan di bumi merupakan milik Allah dan di bawah kekuasaan-Nya, tidak ada seorang makhluk pun yang mampu menjauhkan dirinya dari mudharat yang telah ditetapkan Allah baginya, terlebih lagi menjauhkan orang lain dari apa yang akan menimpanya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "17. لَّقَدْ كَفَرَ الَّذِينَ قَالُوٓا۟ إِنَّ اللهَ هُوَ الْمَسِيحُ ابْنُ مَرْيَمَ ۚ (Sesungguhnya telah kafirlah orang-orang yang berkata: “Sesungguhnya Allah itu ialah Al Masih putera Maryam”) Yakni akibat perkataan mereka ini mereka menjadi kafir. قُلْ فَمَن يَمْلِكُ مِنَ اللهِ شَيْـًٔا (Katakanlah: “Maka siapakah (gerangan) yang dapat menghalang-halangi kehendak Allah) Yakni siapakah yang mampu menghalangi Allah. إِنْ أَرَادَ أَن يُهْلِكَ الْمَسِيحَ (jika Dia hendak membinasakan Al Masih) Apabila tidak ada yang mampu menghalangi-Nya maka diketahui bahwa DIa-lah Tuhan, tiada tuhan selain Dia, tidak ada sesembahan yang berhak disembah selain Dia. Andai saja Isa al-Masih adalah Tuhan niscaya ia dapat melakukan sesuatu dan mampu membebaskan dirinya dari keburukan. Dan kalian mengaku bahwa ia disalib dan dibunuh, lalu mengapa ia tidak membela diri agar tidak disalib dan dibunuh seandainya ia adalah tuhan. Ia juga tidak mampu membela ibunya dari kematian ketika mendatanginya. Saat ia tidak dapat membelanya maka ia lebih tidak mampu lagi untuk membela kalian dari keputusan Allah. يَخْلُقُ مَا يَشَآءُ ۚ (Dia menciptakan apa yang dikehendaki-Nya) Sebagaimana menciptakan Isa dari ibunya tanpa ayah."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "17 Sesungguhnya mereka telah menjadi kafir orang-orang yang berkata: “Sesungguhnya Allah itu ialah Al Masih putera Maryam”. Katakanlah wahai Rasul: “Maka siapakah gerangan yang dapat menghalang-halangi kehendak Allah, jika Dia hendak membinasakan Al Masih putera Maryam itu beserta ibunya dan seluruh orang-orang yang berada di bumi semuanya?”. Meskipun Isa diklaim sebagai Tuhan oleh orang Nasrani maka dia tidak akan kuasa sedikitpun untuk menahan kebinasaan atau kematian yang datang kepadanya atau ibunya. Dia tidak kuasa atas itu, dan dia lebih tidak kuasa untuk menahan ketentuan Allah untuk kalian. Kepunyaan Allah-lah kerajaan langit dan bumi dan apa yang ada diantara keduanya; Dia menciptakan apa yang dikehendaki-Nya. Dan Allah Maha Kuasa atas segala sesuatu dan tidak ada sesuatu apapun yang dapat melemahkan-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sungguh, benar-benar telah ingkar orang-orang yang berkata, “Sesungguhnya Allah itulah Isa putra Maryam.” Katakanlah, “Siapakah yang dapat menghalang-halangi Allah} Siapakah yang mampu mencegah Allah untuk memerintahkan sesuatu {jika Dia hendak membinasakan Isa putra Maryam, ibunya, dan seluruh yang berada di bumi” Milik Allahlah kerajaan langit, bumi, dan apa yang ada di antara keduanya. Dia menciptakan apa yang Dia kehendaki. Allah Maha kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "17. Manakala Allah menyebutkan pengambilan janji atas orang-orang Yahudi dan Nasrani dan bahwa mereka tidak menunaikannya, justru mereka melanggarnya, maka Allah menyebutkan perkataan mereka yang buruk. Allah menyebutkan perkataan orang-orang Nasrani, perkataan yang tidak diucapkan oleh siapa pun selain mereka yaitu, bahwa Allah adalah al-Masih bin Maryam, dengan alasan karena dia dilahirkan tanpa bapak, maka mereka meyakini padanya dengan keyakinan yang batil ini, padahal Hawa sama dengannya, dia diciptakan tanpa ibu, bahkan Adam, dia lebih luar biasa, karena dia diciptakan tanpa bapak dan ibu. Mengapa mereka tidak menyematkan gelar ketuhanan kepada keduanya seperti yang mereka lakukan kepada al-Masih? Ini menunjukkan bahwa ucapan mereka itu hanyalah sekedar mengikuti hawa nafsu tanpa bukti dan argument. Maka Allah membantah mereka dengan dalil aqli (logika) yang jelas. Maka FirmanNya, “Katakanlah, ‘Maka siapakah gerangan yang dapat menghalang-halangi kehendak Allah, jika Dia hendak membinasakan al-Masih putra Maryam berserta ibunya dan seluruh orang—orang yang berada di bumi semuanya?’ “ jika orang-orang yang disebutkan dalam ayat ini tidak memiliki kemampuan untuk melindungi diri seandainya Allah hendak membinasakan mereka, maka hal itu menunjukkan kebatilan ketuhanan orang yang tidak mampu menolak kebinasaan dan tidak memiliki kekuatan untuk menyelamatkan diri darinya. Di antara bukti-bukti lain adalah, bahwa “kepunyaan Allah,” semata “kerajaan langit dan bumi.” Dia mengatur mereka dengan hukum alam, hukum syar’i dan hukuman balasan. Mereka adalah para makhluk yang dimiliki oleh Allah yang diatur. Apakah layak seorang hamba, makhluk yang miskin menjadi Tuhan Yang Mahakaya dari segala segi? Ini adalah kemustahilan paling besar. Dan tidak ada bukti dari kekaguman mereka dari penciptaan al-Masih putra Maryam tanpa bapak, karena Allah “menciptakan apa yang dikehendakiNya.” Jika Dia berkehendak, maka Dia menciptakan dari bapak dan ibu seperti manusia pada umumnya, jika Dia berkehendak, maka dari bapak tanpa ibu seperti Hawa, dan jika Dia berkehendak, maka dari ibu tanpa bapak seperti Isa, serta jika Dia berkehendak, maka tanpa bapak dan ibu seperti Adam. Allah menciptakan makhlukNya bermacam-macam dengan kehendakNya yang pasti terlaksana yang tiada sesuatu pun yang menghalang-halanginya. Oleh karena itu Dia berfirman, “Dan Allah Maha Berkuasa atas segala sesuatu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 17: Perkataan ini diucapkan oleh salah satu sekte Nasrani, yaitu sekte Ya'qubiyyah. Alasan mereka adalah karena Nabi Isa 'alaihis salam lahir tanpa bapak, padahal ada yang lebih aneh lagi, yaitu Hawa' yang diciptakan tanpa ibu, dan Adam diciptakan tanpa bapak dan ibu. Hal ini menunjukkan bahwa ucapan mereka ini hanya didasari hawa nafsu tanpa bukti dan dalil sama sekali. Kalau seandainya Al Masih adalah tuhan, tentu dia mampu menghalanginya. Semua yang ada di langit dan di bumi milik Allah dan diatur-Nya, oleh karenanya apakah layak milik-Nya sekaligus sebagai hamba-Nya yang fakir menjadi tuhan yang disembah. Oleh karena itu, tidaklah aneh jika Al Masih Isa putera Maryam diciptakan tanpa bapak, karena Allah menciptakan apa yang Dia kehendaki. Jika Dia menghendaki, Dia menciptakan manusia dari laki-laki dan wanita seperti halnya manusia semuanya, dan jika Dia menghendaki, Dia ciptakan seseorang dari laki-laki tanpa wanita seperti halnya Hawa', dan jika Dia menghendaki, Dia ciptakan seseorang dari wanita tanpa laki-laki seperti Isa, dan jika Dia menghendaki, Dia ciptakan seseorang tanpa laki-laki dan wanita seperti Adam 'alaihis salam."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 17",
    "description": "Setelah menjelaskan fungsi diutusnya para rasul dan kedatangan kitab suci sebagai petunjuk ke jalan keselamatan, ayat ini menjelaskan bahwa salah satu kegelapan yang menyelubungi jiwa dan pikiran ahli kitab adalah kepercayaan mereka tentang tuhan. Sungguh, telah kafir orang-orang, yakni segolongan orang-orang nasrani, yang berkata, sesungguhnya Allah itu dialah al-masih putra maryam, yakni bahwa isa al-masih adalah tuhan atau anak tuhan. Keyakinan mereka itu sungguh sesat. Untuk membuktikan kesesatan itu, katakanlah, wahai nabi Muhammad, siapakah yang dapat menghalang-halangi kehendak Allah, jika dia hendak membinasakan al-masih putra maryam itu beserta ibunya dan seluruh manusia yang berada di bumi' tentu tidak ada. Dan milik Allah-lah kerajaan langit dan bumi dan apa yang ada di antara keduanya. Semuanya tunduk dan patuh kepada kehendak Allah. Dia menciptakan apa yang dia kehendaki sesuai dengan cara yang dipilih-Nya, di antaranya menciptakan seorang manusia tanpa ayah yaitu nabi isa. Dan Allah mahakuasa atas segala sesuatu kesesatan lainnya yang terjadi pada orang-orang yahudi dan nasrani adalah bahwa mereka menganggap dirinya sebagai anak dan sebagai kekasih Allah. Ayat ini meluruskan pandangan mereka. Orang yahudi dan nasrani, masing-masing dari mereka itu mempunyai keyakinan dan berkata, kami adalah anak-anak Allah dan kekasih-kekasih-Nya, selain kami bukanlah anak-anak-Nya atau kekasih-Nya. Perkataan mereka itu tidak benar. Oleh karena itu, katakanlah, mengapa Allah menyiksa kamu karena dosa-dosamu' jika benar kamu anak-anak Allah dan kekasihnya, niscaya dia tidak akan menyiksamu. Tidak, kamu bukanlah anak Allah dan bukan pula kekasih-Nya! kamu adalah manusia biasa di antara orang-orang yang dia ciptakan. Mereka akan disiksa apabila berdosa, dan diberi pahala apabila berbuat kebajikan. Dia mengampuni siapa yang dia kehendaki di antara para hamba-Nya itu, termasuk orang-orang yahudi dan nasrani, dan menyiksa siapa yang dia kehendaki dengan seadil-adilnya. Dan milik Allah seluruh kerajaan langit dan bumi serta apa yang ada di antara keduanya, semua berada di bawah kendali kekuasaan-Nya. Dan kepada-Nya, yakni kepada Allah semata-mata, semua akan kembali."
  }
]