[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan telah mengaku-ngaku Kaum yahudi dan kaum nasrani bahwa sesungguhnya mereka adalah anak-anak Allah dan orang-orang kesayanganNya. Katakanlah (wahai Rasul) kepada mereka, ”mengapa Dia menyiksa kalian dikarenakan dosa-dosa kalian? seandainya kalian betul orang-orang kesayanganNya, niscaya Dia tidak akan menyiksa kalian. Allah tidak mencintai kecuali orang yang taat kepadaNya,” Dan katakanlah kepada mereka, ”Bahkan sebenarnya kalian itu makhluk seperti seluruh anak cucu adam pada umumnya. jika kalian berbuat baik, niscaya kalian akan diberi balasan kebaikan atas perbuatan baik kalian, dan jika kalian berbuat keburukan, niscaya kalian diberi balasan keburukan atas perbuatan buruk kalian. Allah mengampuni siapa saja yang dikehendakiNya dan menyiksa siapa saja yang dikehendakiNya. Dia lah pemilik kerajaan hakiki, mengendalikannya sesuai dengan apa yang dikehendakiNya. Dan hanya kepadaNya lah tempat kembali, lalu Dia memutuskan diantara para hambaNya dan memberikan balasan bagi masing-masing orang sesuai dengan apa yang berhak dia dapatkan.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "18. Orang-orang Yahudi dan Nasrani masing-masing mengaku, “Kami adalah anak-anak Allah dan kekasih-kekasih-Nya.” Katakanlah -wahai Rasul- untuk menjawab pengakuan mereka itu, “Mengapa Allah mengazab kalian disebabkan dosa-dosa yang kalian perbuat?” Jika memang kalian adalah kekasih-kekasih Allah sebagaimana pengakuan kalian, pasti Dia tidak akan mengazab kalian dengan membunuh dan mengubah wujud di dunia dan dengan api Neraka di Akhirat. Karena Allah tidak akan mengazab orang yang dicintai-Nya. Kalian hanyalah manusia biasa sebagaimana manusia pada umumnya. Siapa yang berbuat baik Allah akan membalasnya dengan Surga. Dan siapa yang berbuat buruk Dia akan menghukumnya dengan api Neraka. Allah dapat mengampuni siapa saja yang Dia kehendaki dengan karunia-Nya. Dan Dia dapat mengazab siapa saja yang Dia kehendaki dengan keadilan-Nya. Hanya Allah-lah satu-satu-Nya pemilik kerajaan langit dan bumi beserta isinya. Dan hanya kepada-Nya segala sesuatu akan kembali."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "18. Orang-orang Yahudi dan Nasrani mengaku sebagai anak-anak dan para kekasih Allah. Sebenarnya apa bukti kecintaan Allah kepada mereka? Dan apa yang telah mereka perbuat untuk mendapatkan kecintaan Allah? Apakah seorang kekasih akan lalai terhadap urusan dan hak-hak kekasihnya serta memberinya sesuatu yang tidak ia sukai? Atau apakah mereka tidak seperti apa yang mereka akui? Benar, mereka adalah manusia biasa seperti manusia lainnya, bahkan mereka telah menanggung banyak kesalahan. Dan semua makhluk sama di hadapan Allah, dyia mengazab atau mengampuni siapa yang Dia kehendaki. Jika Dia mengazab, maka Dia mengazab dengan keadilan-Nya; dan jika dia mengampuni maka Dia mengampuni dengan dan karunia-Nya. Semua merupakan hamba-hamba-Nya. Dia mengatur mereka sesuai dengan kehendak-Nya, dan kepada-Nyalah tempat mereka kembali."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "18. وَقَالَتِ الْيَهُودُ وَالنَّصٰرَىٰ نَحْنُ أَبْنٰٓؤُا۟ اللهِ وَأَحِبّٰٓؤُهُۥ ۚ (Orang-orang Yahudi dan Nasrani mengatakan: “Kami ini adalah anak-anak Allah dan kekasih-kekasih-Nya”) Orang-orang Yahudi menyatakan bagi diri mereka sendiri apa yang mereka nyatakan bagi ‘Uzair yang mana mereka mengatakan ‘Uzair adalah anak Allah. Dan Orang-orang Nasrani menyatakan bagi diri mereka sendiri apa yang mereka nyatakan bagi Isa al-Masih yang mana mereka mengatakan Isa adalah anak Allah. Mereka semua menyatakan mereka adalah para kekasih Allah dan ini hanyalah klaim sesat dan angan-angan kosong mereka. قُلْ فَلِمَ يُعَذِّبُكُم بِذُنُوبِكُم ۖ (Katakanlah: “Maka mengapa Allah menyiksa kamu karena dosa-dosamu?”) Lalu mengapa Allah menyiksa kalian karena dosa yang mereka kerjakan, dengan siksaan kebinasaan dan kutukan dan dengan neraka di hari kiamat nanti sebagaimana yang mereka akui. Sebenarnya seorang anak merupakan bagian dari ayahnya, dan seorang ayah tidak akan melakukan sesuatu yang mustahil ia lakukan kepada anaknya. Sedangkan Allah mengazab kalian maka ini menjadi bukti bahwa kalian adalah pembohong. بَلْ أَنتُم بَشَرٌ مِّمَّنْ خَلَقَ ۚ (tetapi kamu adalah manusia(biasa) diantara orang-orang yang diciptakan-Nya) Yakni dari jenis yang diciptakan Allah sebagaimana hamba-hamba-Nya yang lain. Allah akan menghisab mereka atas perbuatan baik dan buruk mereka dan membalas semuanya sesuai dengan amalnya. Ibnu ‘Abbas berkata: Nu’man bin Adha’, Bahry bin ‘Amr, dan Syas bin ‘Ady mendatangi Rasulullah kemudian mereka berkata kepadanya, dan Rasulullah juga berkata kepada mereka dan mengajak mereka beriman kepada Allah serta memperingati mereka atas siksa-Nya. Kemudian mereka menjawab: kamu sama sekali tidak menakut-nakuti kami hai Muhammad, karena kami adalah anak-anak Allah dan para kekasih-Nya. Maka Allah menurunkan firman-Nya: وقالت اليهود والنصارى نحن أبناء الله..."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ibnu Katsir menyebutkan bahwa beberapa orang syaikh bertanya kepada sahabatnya : dimana kamu dapati dalam al-qur'an seorang kekasih tidak menyiksa orang yang ia cintai? kemudian syaikh itu membaca : { وَقَالَتِ الْيَهُودُ وَالنَّصَارَىٰ نَحْنُ أَبْنَاءُ اللَّهِ وَأَحِبَّاؤُهُ ۚ قُلْ فَلِمَ يُعَذِّبُكُمْ بِذُنُوبِكُمْ } \"Orang-orang Yahudi dan Nasrani mengatakan: \"Kami ini adalah anak-anak Allah dan kekasih-kekasih-Nya\". Katakanlah: \"Maka mengapa Allah menyiksa kamu karena dosa-dosamu?\" Ibnu katsir lalu mengomentari : \"dan inilah yang dikatakan oleh Hasan\""
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "18 Orang-orang Yahudi dan Nasrani mengatakan: “Kami ini adalah anak-anak Allah dan kekasih-kekasih-Nya”. Seperti perkataan orang Yahudi tentang Uzair bahwa dia adalah anak Allah. Dan Nasrani berkata bahwa Isa juga putera Allah. Maka Allah tidak akan mengazab kami, dan doa itu adalah doa yang batil. Katakanlah kepada mereka wahai rasul: “Jika memang kalian benar, maka mengapa Allah menyiksa kamu karena dosa-dosamu dengan kematian dan penghilangan, juga dengan azab neraka di akhirat, sebaimana yang kalian ketahui?” Sesungguhnya kekasih tidak akan pernah mengazab orang yang dicintainya, sedangkan kalian sedang diazab. Kamu bukanlah anak-anak Allah dan kekasih-kekasih-Nya, tetapi kamu adalah manusia biasa diantara orang-orang yang diciptakan-Nya. Dia mengampuni bagi siapa yang dikehendaki-Nya dengan karunia-Nya dan menyiksa siapa yang dikehendaki-Nya dengan keadilan-Nya. Dan Kepunyaan Allah-lah kerajaan langit bumi dan di antara keduanya. Dan kepada Allah-lah kembali segala sesuatu. Yang maha membalas setiap orang berdasar perbuatannya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Orang-orang Yahudi dan Nasrani berkata, “Kami adalah anak-anak Allah dan kekasih-kekasihNya.” Katakanlah, “Mengapa Allah menyiksa kalian karena dosa-dosa kalian Sebaliknya kalian adalah manusia biasa di antara makhluk yang Dia ciptakan. Dia mengampuni siapa saja yang Dia kehendaki dan menyiksa siapa saja yang Dia kehendaki. Milik Allahlah kerajaan langit, bumi, dan apa yang ada di antara keduanya, dan kepadaNya tempat kembali.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "18. Di antara ucapan-ucapan orang Yahudi dan Nasrani adalah bahwa masing-masing mengklaim sesuatu yang batil, dengannya mereka mentazkiyah (memuji) diri mereka, masing-masing mengatakan, “Kami adalah anak-anak Allah dan kekasih-kekasihNya.” Anak menurut Bahasa mereka adalah kekasih, mereka tidak bermaksud anak dalam arti yang sebenarnya, karena itu bukan keyakinan mereka, kecuali keyakinan orang-orang Nasrani pada al-Masih Isa bin Maryam. Allah membantah klaim tanpa bukti ini, “Katakanlah, ‘Maka mengapa Allah menyiksamu karena dosa-dosamu.” Artinya, kalau seandainya kamu adalah kekasih-kekasihNya, niscaya Dia tidak mengazabmu, karena Allah tidak mencintai kecuali orang-orang yang melaksanakan apa-apa yang diridhaiNya.” Hukum keadilan dan karunia berlaku atasmu, dimana “Dia mengampuni siapa yang dikehendakiNya dan menyiksa siapa yang dikehendakiNYa,” jika mereka melakukan sebab-sebab ampunan dan sebab-sebab azab. “Dan kepunyaan Allah-lah kerajaan langit dan bumi, serta apa yang ada di antara keduanya. Dan kepada Allah-lah (segala sesuatu) kembali.” Artinya, apa yang membuatmu mendapatkan keutamaan itu secara khusus sementara kamu hanyalah salah satu ciptaanNya dan salah satu dari apa-apa yang akan kembali kepadaNya di Hari Akhir lalu Dia membalasmu sesuai dengan perbuatanmu?"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 18: Orang-orang Yahudi dan Nasrani menganggap bersih diri mereka dengan mengatakan, \"Kami adalah anak-anak Allah dan kekasih-Nya\", Maha Suci Allah dari anggapan tersebut. Anak menurut bahasa mereka adalah kekasih, bukan anak dalam arti anak yang sesungguhnya, karena hal itu bukanlah madzhab mereka, kecuali madzhab mereka dalam hal Al Masih. Pada ayat di atas, Allah membantah anggapan tersebut. Yakni kalau kamu memang kekasih-kekasih-Nya, tentu Dia tidak akan menyiksamu. Berlaku kepadamu hukum-hukum adil dan ihsan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 18",
    "description": "Kesesatan lainnya yang terjadi pada orang-orang yahudi dan nasrani adalah bahwa mereka menganggap dirinya sebagai anak dan sebagai kekasih Allah. Ayat ini meluruskan pandangan mereka. Orang yahudi dan nasrani, masing-masing dari mereka itu mempunyai keyakinan dan berkata, kami adalah anak-anak Allah dan kekasih-kekasih-Nya, selain kami bukanlah anak-anak-Nya atau kekasih-Nya. Perkataan mereka itu tidak benar. Oleh karena itu, katakanlah, mengapa Allah menyiksa kamu karena dosa-dosamu' jika benar kamu anak-anak Allah dan kekasihnya, niscaya dia tidak akan menyiksamu. Tidak, kamu bukanlah anak Allah dan bukan pula kekasih-Nya! kamu adalah manusia biasa di antara orang-orang yang dia ciptakan. Mereka akan disiksa apabila berdosa, dan diberi pahala apabila berbuat kebajikan. Dia mengampuni siapa yang dia kehendaki di antara para hamba-Nya itu, termasuk orang-orang yahudi dan nasrani, dan menyiksa siapa yang dia kehendaki dengan seadil-adilnya. Dan milik Allah seluruh kerajaan langit dan bumi serta apa yang ada di antara keduanya, semua berada di bawah kendali kekuasaan-Nya. Dan kepada-Nya, yakni kepada Allah semata-mata, semua akan kembali. Setelah meluruskan pandangan ahli kitab tentang tuhan, ayat ini menyatakan sekali lagi tentang kedatangan nabi Muhammad. Wahai ahli kitab, yakni orang-orang yahudi dan nasrani! sungguh, rasul kami, yaitu nabi Muhammad, telah datang kepadamu menjelaskan syariat kami kepadamu dan meluruskan apa yang keliru dari keyakinan dan perilaku kamu ketika terputus pengiriman rasul-rasul dalam masa yang sangat lama, lebih dari enam ratus tahun antara masa nabi isa dengan diutusnya nabi Muhammad, agar kamu tidak mengatakan, kelak ketika kamu mempertanggungjawabkan dosa dan kesalahan kamu, tidak ada yang datang kepada kami, baik seorang pembawa berita gembira yang memberitakan kepada kami ganjaran bagi orang yang berbuat kebajikan maupun seorang pemberi peringatan yang mengingatkan kami akan siksa bagi orang yang berbuat dosa. Sungguh, telah datang kepadamu pembawa berita gembira dan pemberi peringatan. Dan Allah mahakuasa atas segala sesuatu."
  }
]