[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yahudi dan nasrani, sesungguhnya telah datang kepada kalian rasul kami, Muhammad , yang menjelaskan kepada kalian kebenaran dan hidayah sesudah masa kekosongan antara pengutusannya dan pengutusan isa putra Maryam, supaya kalian tidak berkata, ”tidak datang kepada kami seorang pembawa kabar gembira dan pemberi peringatan,” Maka tida ada alasan bagi kalian setelah diutusnya Muhammad kepada kalian. Maka Sesungguhnya telah datang kepada kalian dari Allah seorang rasul yang membawa kabar gembira bagi orang yang beriman kepadanya, dan memperingatkan orang yang mendurhaikainya. Dan Allah mahakuasa atas segala sesuatu, termasuk menyiksa pelaku maksiat dan memberi pahala orang yang taat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "19. Wahai orang-orang ahli Kitab dari kalangan Yahudi dan Nasrani, telah datang kepada kalian rasul Kami, Muhammad -ṣallallāhu 'alaihi wa sallam- setelah terputusnya para rasul dan munculnya kebutuhan mendesak akan pengutusan seorang rasul, agar kalian tidak beralasan dengan mengatakan, “Tidak ada rasul yang datang kepada kami untuk menyampaikan kabar gembira akan adanya ganjaran dari Allah dan memperingatkan kami akan adanya hukuman dari-Nya.” Maka Muhammad -ṣallallāhu 'alaihi wa sallam- datang kepada kaliam untuk menyampaikan kabar gembira akan adanya ganjaran dari Allah dan memperingatkan kalian akan adanya hukuman dari-Nya. Dan Allah Mahakuasa atas segala sesuatu, tidak ada sesuatu pun yang dapat menghalangi-Nya. Salah satu kekuasaan-Nya ialah mengutus para rasul dan menutupnya dengan Muhammad -ṣallallāhu 'alaihi wa sallam-."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "19. Kemudian datanglah seruan kepada para Ahli kitab untuk memberitahukan mereka tentang kedatangan penutup para nabi setelah hilangnya jalan-jalan yang menuntun kepada kebenaran dan berlalunya masa fatrah (masa terhentinya pengutusan nabi sementara waktu). Nabi ini membawa penjelasan dan bukti-bukti yang jelas agar mereka tidak memiliki alasan dan uzur di hadapan Allah. Allah Maha Kuasa untuk mengutus para rasul dan menguatkan mereka dengan mukjizat-mukjizat yang kuat dan bukti-bukti yang jelas, dan Maha Kuasa untuk menolong mereka dan menghinakan orang-orang yang berpaling dari mereka."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "19. يٰٓأَهْلَ الْكِتٰبِ قَدْ جَآءَكُمْ رَسُولُنَا (Hai Ahli Kitab, sesungguhnya telah datang kepada kamu Rasul Kami) Yakni kepada Muhammad. عَلَىٰ فَتْرَةٍ مِّنَ الرُّسُلِ (ketika terputus (pengiriman) rasul-rasul) Pengutusan para Rasul terputus beberapa waktu sebelum diutusnya Nabi Muhammad. أَن تَقُولُوا۟ مَا جَآءَنَا مِنۢ بَشِيرٍ وَلَا نَذِيرٍ ۖ( agar kamu tidak mengatakan: “Tidak ada datang kepada kami baik seorang pembawa berita gembira maupun seorang pemberi peringatan”) Yakni agar kalian tidak mengatakan perkataan ini sebagai alasan atas kelalaian kalian. فَقَدْ جَآءَكُم(Sesungguhnya telah datang kepadamu) Yakni janganlah kalian beralasan karena telah datang kepada kalian pembawa berita gembira dan pemberi peringatan, yaitu Nabi Muhammad. Ibnu Abbas berkata: waktu antara kelahiran Nabi Isa dengan Nabi Muhammad adalah 569 tahun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "19 Hai orang-orang Yahudi dan Nasrani, sesungguhnya telah datang kepada kamu Rasul Kami Muhammad, yang menjelaskan agama yang benar kepadamu ketika terputus pengiriman rasul-rasul. Kisaran waktu antara pengutusan Isa dan Muhammad adalah 611 tahun. Hal itu agar ketika hari perhitungan, sebagai alibi kamu tidak mengatakan: “Tidak ada yang datang kepada kami baik seorang pembawa berita gembira berupa surga maupun seorang pemberi peringatan berupa neraka.” Maka jangan membuat alasan, karena sesungguhnya telah datang kepadamu pembawa berita gembira dan pemberi peringatan. Dia adalah Muhammad yang lahir pada tahun 571 tahun gajah. Allah Maha Kuasa atas segala sesuatu yang mengutus rasul sesuai kebutuhan. Dia lah penyelamat dan tidak ada keraguan atasNya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai Ahlul kitab, sungguh telah datang kepada kalian rasul Kami} nabi Muhammad SAW {untuk memberi penjelasan kepada kalian setelah beberapa saat terhentinya} terhentinya {(pengutusan) rasul-rasul agar kalian tidak berkata} agar kalian tidak berkata {“Tidak ada yang datang kepada kami, baik pembawa berita gembira maupun pemberi peringatan.” Sungguh, telah datang kepada kalian pembawa berita gembira dan pemberi peringatan. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "19. Allah menyeru Ahli Kitab karena Dia telah memberikan nikmatNya kepada mereka dalam bentuk kitab yang diberikan kepada mereka agar mereka beriman kepada RasulNya Muhammad dan bersyukur kepada Allah yang telah mengutusnya kepada mereka “pada saat pengiriman rasul-rasul terputus,” dan kebutuhan mereka yang mendesak kepadanya, dan ini adalah di antara yang menyeru untuk beriman kepadaNYa dan bahwa rasul itulah yang menjelaskan seluruh tuntutan ilahiyah dan hukum-hukum syar’i. Allah telah memotong argumentasi mereka dalam hal ini agar mereka tidak mengatakan, “Tidak datang kepada kami seorang pembawa berita gembira dan tidak pula seorang pemberi peringatan.” Sungguh telah datang kepadamu pembawa berita gembira dan pemberi peringatan.” Dia menyampaikan berita gembira dengan pahala dunia dan akhirat dan amal-amal yang mengantarkan kepadanya dan sifat para pengamalnya. “Dan Allah Maha Berkuasa atas segala sesuatu.” Segala sesuatu tunduk dan patuh kepada kekuasaanNYa, tidak ada sesuatu pun yang sulit bagiNYa. Dan di antara kekuasaanNya adalah Dia mengutus para Rasul dan menurunkan kitab-kitab dan bahwa Dia memberi pahala kepada orang yang taat dan menghukum orang yang membangkang."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 19: Dalam ayat ini, Allah mengajak Ahli Kitab untuk beriman kepada Rasul-Nya Muhammad shallallahu 'alaihi wa sallam dan bersyukur kepada Allah yang telah mengutus Beliau ketika terjadi kekosongan rasul, di mana mereka sedang membutuhkan kedatangan rasul. Jarak terputusnya rasul antara Nabi Isa 'alaihis salam dengan Nabi Muhammad shallallahu 'alaihi wa sallam kira-kira 569 tahun. Ketika kamu diazab. Beliau datang dengan memberi kabar gembira berupa pahala baik segera atau nanti, memberitahukan amalan yang mendatangkan pahala itu dan sifat orang-orang yang mengamalkannya. Demikian juga memberi peringatan dengan azab atau hukuman baik segera atau nanti, memberitahukan amalan yang mendatangkan azab itu serta sifat orang-orang yang melakukannya. Di antaranya dengan menyiksa kamu jika kamu tidak mengikuti rasul yang diutus-Nya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 19",
    "description": "Setelah meluruskan pandangan ahli kitab tentang tuhan, ayat ini menyatakan sekali lagi tentang kedatangan nabi Muhammad. Wahai ahli kitab, yakni orang-orang yahudi dan nasrani! sungguh, rasul kami, yaitu nabi Muhammad, telah datang kepadamu menjelaskan syariat kami kepadamu dan meluruskan apa yang keliru dari keyakinan dan perilaku kamu ketika terputus pengiriman rasul-rasul dalam masa yang sangat lama, lebih dari enam ratus tahun antara masa nabi isa dengan diutusnya nabi Muhammad, agar kamu tidak mengatakan, kelak ketika kamu mempertanggungjawabkan dosa dan kesalahan kamu, tidak ada yang datang kepada kami, baik seorang pembawa berita gembira yang memberitakan kepada kami ganjaran bagi orang yang berbuat kebajikan maupun seorang pemberi peringatan yang mengingatkan kami akan siksa bagi orang yang berbuat dosa. Sungguh, telah datang kepadamu pembawa berita gembira dan pemberi peringatan. Dan Allah mahakuasa atas segala sesuatu. Ayat-ayat yang lalu berbicara tentang pengingkaran janji orangorang yahudi dan nasrani yang diikuti dengan peringatan Allah bahwa banyak sekali kenikmatan yang dianugerahkan Allah kepada mereka, tetapi mereka tidak bersyukur dan tidak mematuhi perintah-Nya. Ayat ini menyatakan sekali lagi kenikmatan Allah yang dianugerahkan kepada mereka. Dan ingatlah, wahai nabi Muhammad, dan ingatkan pula orang-orang yang beriman, ketika musa berkata kepada kaumnya untuk menasihati mereka, wahai kaumku, yakni orang-orang yahudi! ingatlah akan nikmat Allah kepadamu ketika dia mengangkat nabi-nabi di antaramu yang banyak jumlahnya, yakni para nabi leluhur mereka yaitu nabi yakub dan anak cucunya, dan menjadikan kamu sebagai orangorang merdeka, memiliki istri dan pelayan-pelayan layaknya raja setelah kamu tertindas bertahun-tahun lamanya oleh fir'aun. Dan ingatlah pula bahwa Allah telah memberikan nikmat kepada kamu, yaitu apa yang belum pernah diberikan kepada seorang pun di antara umat yang lain. Di antara nikmat yang diturunkan Allah kepada bani israil adalah manna dan salwa', melindungi mereka dengan awan, dan mengutus nabi-nabi yang banyak jumlahnya."
  }
]