[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan rasulNya serta menjalankan syariatNya, janganlah kalian melewati batasan-batasan Allah dan rambu-rambuNya, dan janganlah kalian menghalalkan peperangan di bulan-bulan haram, yaitu, Bulan dzulqadah, dzulhijjah, muharram, dan rajab. Dan ketetapan ini berlaku pada permulaan perkembangan islam. Dan janganlah kalian menghalalkan kehormatan binatang hadyu dan jangan pula binatang-binatang yang leher-lehernya telah dikalungi sesuatu. Hal itu karena mereka meletakkan kalung-kalung berbentuk kuciran-kuciran dari bulu domba atau unta pada batang lehernya sebagai pertanda bahwa binatang-binatang ternak tersebut diperuntukkan sebagai hadyu dan pembawanya adalah orang yang hendak mengerjakan ibadah haji. Dan janganlah kalian menghalalkan tindakan memerangi orang-orang yang bermaksud mendatangi Masjidil Haram yang mengharapkan dari Allah karunia yang dapat memperbaiki kualiatas kehidupan dunia mereka dan mendatangkan keridhaan tuhan mereka. Apabila kalian telah selesai dari ihram kalian, maka halal bagi kalian binatang buruan. Dan janganlah menyeret kalian rasa kebencian kalian terhadap satu kaum gara-gara mereka menghalang-halangi kalian untuk memasuki masjidil haram, sebagimana yang terjadi pada tahun perjanjian Hudaibiyah, membuat kalian mengabaikan perbuatan adil terhadap mereka. Dan tolong-menolonglah di antara kalian wahai kaum Mukminin,dalam mengerjakan kebaiakan dan ketakwaan kepada Allah. Dan janganlah kalian saling menolong dalam perbuatan yang memuat dosa,maksiat, dan pelanggaran terhadap batasan-batasan Allah, dan wasapadalah kalian dari melanggar perintah Allah, karena sesungguhnya Dia amat dahsyat siksaanNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "2. Wahai orang-orang yang beriman! Janganlah kalian menghalalkan hal-hal yang dilarang oleh Allah, yang kalian diperintahkan-Nya untuk menghormatinya, dan jauhilah larangan-larangan ihram, seperti memakai pakaian yang berjahit, serta hindarilah larangan-larangan tanah haram, seperti berburu binatang. Janganlah kalian melakukan peperangan di bulan-bulan haram (Zulkaidah, Zulhijah, Muharam, dan Rajab). Janganlah kalian menghalalkan (mengganggu) binatang-binatang hadyu (sembelihan) yang disembelih di tanah suci dengan cara merampasnya atau semacamnya, atau menghalang-halanginya agar tidak sampai ke tempat penyembelihannya. Janganlah kalian menghalalkan binatang-binatang hadyu yang diberi kalung sebagai tanda bahwa binatang itu adalah binatang hadyu. Dan janganlah kalian menghalalkan (mengganggu) orang-orang yang sedang pergi ke Baitullah yang suci untuk mencari keuntungan dari perdagangan dan mengharap rida Allah. Apabila kalian telah selesai bertahalul dari ihram haji atau umrah, dan telah keluar dari tanah haram, maka berburulah jika kalian mau. Dan jangan sekali-kali kebencian kalian kepada suatu kaum, karena mereka telah menghalang-halangi kalian dari Masjidilharam, mendorong kalian untuk berbuat sewenang-wenang dan tidak berlaku adil kepada mereka. Dan tolong-menolonglah kalian wahai orang-orang mukmin dalam mengerjakan apa yang diperintahkan kepada kalian dan meninggalkan apa yang terlarang bagi kalian. Dan takutlah kalian kepada Allah dengan senantiasa patuh kepada-Nya dan tidak durhaka kepada-Nya. Sesungguhnya Allah Mahakeras hukuman-Nya kepada orang yang durhaka kepada-Nya, maka waspadalah terhadap hukuman-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "2. Seruan Allah kepada hamba-hamba-Nya yang beriman ini untuk melarang mereka menodai ibadah dan kewajiban-Nya atau lalai dalam mengerjakan kewajiban-kewajiban itu. Sebagaimana melarang menodai bulan-bulan haram, yaitu: Rajab, Syawal, Dzulhijjah, dan Dzulqo'dah, dalam bulan-bulan ini dilarang melakukan peperangan kecuali jika terzalimi. Dan tidak diperbolehkan mengganggu hewan hadyu yang digiring oleh orang-orang yang menunaikan haji dan umrah, terlebih lagi hewan hadyu yang telah diberi kalung dengan tujuan untuk mengagungkan Allah. Dan tidak diperbolehkan menghalangi orang yang menuju Baitul haram untuk menjalankan manasik ketika dia telah memulainya. Bagaimana dia dihalangi sedangkan dia mengharapkan karunia dan keridhaan yang besar dari Pencipta dan Pengatur segala urusannya? Dan janganlah kebencian terhadap suatu kaum membuat kalian menzalimi dan merampas hak mereka karena itu merupakan kejahatan yang keji. Setelah Allah melarang berbuat zalim, kemudian Dia memerintahkan untuk saling membantu dan tolong-menolong dalam perkara birr dan taqwa; birr yaitu segala perbuatan baik, sedangkan takwa yaitu rasa takut dari Allah dan menjauhi segala larangan-Nya serta menjalankan segala perintah-Nya. Dan Allah melarang untuk saling tolong-menolong dalam perkara dosa dan kezaliman, karena ini bukanlah akhlak orang yang beriman. Kemudian Allah memerintahkan hamba-hamba-Nya untuk bertakwa dan mengancam mereka yang menyelisihi perintah-Nya dengan azab yang berat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "2. لَا تُحِلُّوا۟ شَعٰٓئِرَ اللهِ (janganlah kamu melanggar syi’ar-syi’ar Allah) Yang dimaksud disini adalah seluruh tempat manasik haji seperti Shafa, Marwah, dan lainnya. Maka janganlah kalian melanggarnya dengan menguranginya atau berusaha untuk menghalangi orang yang ingin mengagungkannya dan beribadah didalamnya. Dan menurut pendapat lain yang dimaksud dengan syi’ar-syi’ar disini adalah kewajiban-kewajiban Allah dan larangan-larangan-Nya. وَلَا الشَّهْرَ الْحَرَامَ (dan jangan melanggar kehormatan bulan-bulan haram) Yakni bulan haram yang empat: Dzul Qa’dah, Dzul Hijjah, al-Muharram, dan Rajab. Maka janganlah kalian menghalalkannya dengan berperang diwaktu itu. وَلَا الْهَدْىَ (jangan (mengganggu) binatang-binatang hadyu) Yakni binatang yang dihadiahkan (dikurbankan) untuk Allah berupa unta, sapi, atau kambing. Allah melarang mereka untuk menghalalkan hewan hadyu dengan merampasnya dari pemiliknya atau menghalanginya dari Baitul Haram. وَلَا الْقَلٰٓئِدَ (dan binatang-binatang qalaa-id) Yakni hewan-hewan hadyu yang diberi kalung ketika dikurbankan menuju Baitul Haram. Dan bentuk pelanggarannya adalah dengan mencurinya. Allah menyebutkannya setelah hewan hadyu sebagai bentuk penekanan dalam perintah menjaga hadyu. وَلَآ ءَآمِّينَ الْبَيْتَ الْحَرَامَ (dan jangan (pula) mengganggu orang-orang yang mengunjungi Baitullah) Yakni janganlah kalian mengganggu orang-orang yang hendak menuju Baitulharam. Makna potongan ayat ini adalah janganlah kalian menghalalkan darah dan harta mereka, dan janganlah kalian halangi orang yang menuju Baitul Haram untuk berhaji, umrah, orang beriman yang ingin memetap atau berdagang didalamnya. Pendapat lain mengatakan: sebab diturunkannya ayat ini adalah bahwa orang-orang musyrik dahulu melakukan haji, umrah, dan berkurban dengan hadyu; lalu orang-orang beriman ingin menyerang mereka, maka turunlah ayat: يا أيها الذين آمنوا لا تحلوا شعائر الله “Hai orang-orang yang beriman, janganlah kamu melanggar syi’ar-syi’ar Allah…(sampai akhir ayat) Kemudian ayat ini dinasakh hukumnya dengan firman-Nya: فلا تقربوا المسجد الحرام بعد عامهم هذا “maka janganlah mereka mendekati Masjidilharam sesudah tahun ini” Dan pendapat lain mengatakan: ayat ini tidak dinasakhkan dan tetap berlaku bagi kaum muslimin yang menjalankan haji dan umrah. يَبْتَغُونَ فَضْلًا مِّن رَّبِّهِمْ وَرِضْوٰنًا ۚ( sedang mereka mencari kurnia dan keridhaan dari Tuhannya) Yakni yang mencari karunia dan keuntungan dalam perdagangan dan keridhaan Allah dalam ibadah haji mereka. وَإِذَا حَلَلْتُمْ(dan apabila kamu telah menyelesaikan ibadah haji) Yakni selesai berihram. فَاصْطَادُوا۟ ۚ( maka bolehlah berburu) Yakni ditempat selain tanah haram. وَلَا يَجْرِمَنَّكُمْ شَنَـَٔانُ قَوْمٍ(Dan janganlah sekali-kali kebencian(mu) kepada sesuatu kaum) Yakni perbuatan mereka menghalangi kalian dari masjidilharam yang membuat kalian benci terhadap mereka membawa kalian untuk berbuat tidak adil terhadap mereka. وَتَعَاوَنُوا۟ عَلَى الْبِرِّ وَالتَّقْوَىٰ ۖ (Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa) Yakni hendaklah kalian saling tolong menolong dalam hal tersebut. وَلَا تَعَاوَنُوا۟ عَلَى الْإِثْمِ (dan jangan tolong-menolong dalam berbuat dosa) Yakni bermaksiat kepada Allah. وَالْعُدْوٰنِ ۚ (dan pelanggaran) Yakni perbuatan yang mengandung kezaliman kepada orang lain"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Alangkah baiknya seorang hamba tatkala ia pergi menunaikan manasiknya turut merasakan keindahan ayat ini, semoga menjadikannya terus istiqomah di atas syari'at Allah. 2 ). Berkata al-Mawardy : Perintah Allah kepada hamba-hamba Nya untuk saling tolong menolong dalam kebaikan, dan Dia menyandingkan perintah itu dengan Taqwa kepada-Nya : { وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ } \"Dan tolong-menolonglah kamu dalam (mengerjakan) kebajikan dan takwa\", adalah karena dengan taqwa sesorang hamba akan meraih kerdhoan dari-Nya, dan dengan kebaikan dia akan meraah. 3 ). { وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ } Ayat ini tidak membedakan antara tolong menolong dalam kebaikan untuk maslahat keidupan dunia (yang sebenarnya dibolehkan oleh syari'at) dan maslahat untuk kebahagiaan akhirat. 4 ). Jumhur Imam mengatakan : Tidak dihalalkan bagi setiap muslim menjual kepada orang-orang Nashrani sesuatu apapun dari maslahat hari raya mereka: apakah itu dalam bentuk makanan ataupun pakaian, dan tidak pula mereka meminjamkan kendaraan kepada orang-orang Nashrani, serta tidak membantu mereka dalam perkata keagaamaan mereka, karena sesungguhnya itu termasuk dukungan dan mengagungkan kesyirikan mereka dan kekafiran mereka, Dan perlu diperhatikan oleh setiap pemimpin untuk melarang kaum muslimin dari perbuatan itu; Allah ta'la berfirman : { وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَىٰ ۖ وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ }."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "2 Hai orang-orang yang beriman, janganlah kalian melanggar ketentuan ibadah haji kalian seperti shafa dan marwa atau lainnya dengan melakukan pelanggaran. Yaitu segala yang telah diatur oleh syariat atau segala yang menjadi ketentuan atau tanda suatu ibadah haji atau umroh, baik dari ihram, thawaf atau sa’i. Dan jangan melanggar kehormatan bulan-bulan haram, yaitu empat bulan, Dzul Qo’dah, Dzul Hijjah, Muharrom dan Rajab. Jangan mengganggu binatang-binatang yang menuntun menuju Baitullah, yaitu unta, sapi atau domba betina yang kalian jadikan atau kalian ganggu untuk sampai kepada Baitullah. Juga jangan kalian ganggu binatang-binatang ternak yang berkalung dengan anting-anting ketika memberikannya kepada orang-orang fakir dengan merampasnya, kemudian kalian kalungi dengan anting-anting untuk menandai sehingga tidak dikenali lagi. Jangan pula mengganggu orang-orang yang mengunjungi Baitullah sedang mereka mencari laba berdagang dan juga kurnia dan keridhaan dari Tuhannya dengan melaksanakan ibadah. Apabila kamu telah menyelesaikan ibadah haji kalian, maka kalian dibolehkan berburu selain binatang haram. Dan janganlah sekali-kali kebencianmu kepada sesuatu kaum karena mereka menghalang-halangi kamu dari Masjidil haram pada tahun Hudaibiyah, mendorongmu berbuat aniaya kepada mereka. Dan tolong-menolonglah kamu dalam mengerjakan kebajikan dan takwa dan meninggalkan kemungkaran. Dan jangan tolong-menolong kalian dalam berbuat dosa dan pelanggaran kepada Allah dan menzalimi manusia. Takutlah kamu kepada azab Allah, sesungguhnya Allah amat berat siksa-Nya kepada orang-orang yang bermaksiat dan tidak bertaubat. Ayat ini turun ketika sebagian sahabat Nabi mencoba menghalangi beberapa orang musyrikin dari Umroh ketika tahun Hudaibiyah, kemudian orang-orang musyrik berkata: kami menghalangi mereka sebagaimana kelompok mereka telah menghalangi kami"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, janganlah kalian melanggar} melanggar {syiar-syiar Allah} hal-hal yang diharamkan Allah {jangan pula bulan-bulan haram} dan janganlah kalian melanggar larangan berperang di bulan-bulan haram yang ada 4 {jangan pula hadyu} janganlah kalian menghalangi hewan ternak yang diserahkan ke Baitullah {dan tidak pula qalā’id} janganlah kalian menghalangi hadyu yang diberi kalung {dan jangan pula para pengunjung Baitul haram} jangan pula kalian mengganggu orang-orang yang hendak ke Baitullah {mereka mencari} mencari {karunia dan ridha Tuhannya. Apabila kalian telah bertahalul, maka berburulah. Janganlah sampai mendorong kalian} membawa kalian {suatu kebencian} kebencian {kepada suatu kaum} karena {karena mereka menghalang-halangi kalian dari Masjidil haram, untuk berbuat melampaui batas. Tolong-menolonglah kalian dalam kebajikan} melaksanakan perintah {dan ketakwaan} menghindari larangan {dan jangan tolong-menolong dalam berbuat dosa} kemaksiatan {dan permusuhan} melanggar orang lain {Bertakwalah kepada Allah, sesungguhnya Allah sangat berat hukumanNya"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "2. Firman Allah, “ Hai orang-orang yang beriman, janganlah kamu melanggar syiar-syiar Allah,” maksudnya apa-apa yang di haramkannya dimana Allah telah memerintahkanmu agar mengagungkannya dan tidak melanggarnya. Larangan ini meliputi larangan melakukannya dan meyakini kehalalannya. Ia meliputi larangan melakukan perbuatan buruk yang meyakini bolehnya. Termasuk dalam hal ini adalah perkara-perkara yang di haramkan pada waktu ihram dan perkara-perkara yang di haramkan di daerah haram. Termasuk pula apa yang dinyatakan oleh FirmanNya “ Dan janganlah kamu melanggar kehormatan bulan-bulan haram.” Maksudnya, janganlah kamu menodainya dengan melakukan peperangan dan kezhaliman yang bermacam-macam di dalamnya sebagaimana Firman Allah, “Sesungguhnya bilangan bulan pada sisi Allah adalah dua belas bulan, dalam ketetapan Allah di waktu Dia menciptakan langit dan bumi, di antaranya empat bulan haram. Itulah (ketetapan) agama yang lurus, maka janganlah kamu menganiaya diri kamu dalam bulan yang empat itu, dan perangilah kaum musyrikin itu semuanya sebagaimana merekapun memerangi kamu semuanya, dan ketahuilah bahwasanya Allah beserta orang-orang yang bertakwa.” (At-taubah:36). Jumhur ulama berpendapat bahwa larangan berperang di bulan-bulan haram adalah mansukh dengan FirmanNya “Apabila sudah habis bulan-bulan Haram itu, maka bunuhlah orang-orang musyrikin itu dimana saja kamu jumpai mereka, dan tangkaplah mereka. Kepunglah mereka dan intailah ditempat pengintaian. Jika mereka bertaubat dan mendirikan sholat dan menunaikan zakat, maka berilah kebebasan kepada mereka untuk berjalan. Sesungguhnya Allah Maha Pengampun lagi maha Penyayang.” (At-taubah:5). Dan ayat lain bersipat umum kandungannya adalah perintah untuk memerangi kaum kafir secara mutlak dan ancaman bagi yang tida berpartisipitasi dalam memerangi mereka dan di dukung lagi oleh kenyatan bahwa nabi memerangi pendudk Thaif di bulan Dzulqa’dah dan ia adalah salah satu bulan haram. Ulama lain berpendapat bahwa berperang di bulan haram tidak mansukh berdasarkan ayat ini dan lainnya yang padanya terdapat larangan secara khusus. Dan dalil yang umum tersebut, mereka sinkronkan dengan makna tersebut. Mereka berpendapat, bahwa dalil-dalil yang mutlak harus di tafsirkan dengan dalil-dalil yang muqayyad. Sebagian ulama meletakkan perincian, mereka berkata, “Tidak boleh memulai perang di bulan-bulan Haram. Adapun melanjutkannya jika ia telah dimulai sebelumnya maka itu boleh. Pendapat ini menafsirkan perang Nabi terhadap penduduk Tha’if, karena peperangan melawan mereka telah dimulai di HUnain dan itu terjadi di bulan Syawal (yang belum masuk bulan haram).” Semuan itu berlaku untuk peperangan yang tidak bertujuan untuk membela diri. Adapun jika kaum Muslimin membela diri karena orang-orang kafir yang memulai, maka kaum Muslimin boleh memerangi mereka untuk mebela diri di bulan-bulan Haram atau selainnya berdasarkan ijma’ para ulama. FirmanNya, “jangan mengganggu binatang-binatang hadyu dan qala’id.” Maksudnya janganlah kamu menghalalkan binatang hadyu yang di giring ke baitullah pada pelaksanaan ibadah haji atau umrah selainya, baik unta ataupun yang lain. Janganlah kamu mengahalang-halanginya untuk sampai di tempat penyembelihannya. Janganlah kamu mengambilnya dengan mencurinya atau lainya. Janganlah kamu menyia-nyiakannya atau membebaninya di atas batas kemampuannya karena dikhawatirkan ia mati sebelum sampai ke tempat penyembelihannya. Akan tetapi hormatilah ia dan hormati orang-orang yang datang membawanya. “ Jangan menggangu binatang qala’id.” Qala’id adalah salah satu macam hadyu yang hkusus, yaitu, hadyu yang dilingkari kalung tali yang di sematkan olehnya untuk menampakan syiar-syiar Allah, mendorong orang-orang untuk mengikuti dan mengajarkan sunah kepada mereka agar diketahui bahwa ia adalah hadyu dan supaya ia di muliakan. Karena itu, memberi kalung kepada binatang hadyu adalah termasuk syiar-syiar yang disunnahkan. “Jangan mengganggu orang-orang yang mengunjungi baitullah.” Yaitu mereka yang memang bermaksud mendatanginya “ sedang mereka mencari karunia dan keridhaan dari Tuhannya.” Maksudnya barang siapa yang medatangi baitullah, sementara tujuannya adalah perniagaan dan pekerjaan yang di bolehkan, atau tujuannya mencari ridha Allah dengan haji, umrah, thawaf, shalat dan ibadah-iabdah yang lainnya, maka janganlah kamu menimpakan keburukan kepadanya, dan menghinakan, akan tetapi muliakanlah dia dan hirmatilah orang-orang yang datang berkunjung ke rumah RabbMu. Termasuk dalam perintah ini adalah menjamin terciptanya keamanan jalan-jalan yang menghubungkan ke baitullah, menjadikan orang-orang yang medatanginya merasa tenang dan lega tanpa kekhawatiran terhadap diri mereka dari pembunuhan dan yang lebih kecil dari pembunuhan, tanpa tajut terhadap harta mereka dari rampokan, pemalakan, dan lain-lain. Ayat ini di khususkan oleh Firman Allah, “Hai orang-orang yang beriman, Sesungguhnya orang-orang yang musyrik itu najis, maka janganlah mereka mendekati Masjidilharam sesudah tahun ini. Dan jika kamu khawatir menjadi miskin, maka Allah nanti akan memberimu kekayaan kepadamu dari karunia-Nya, jika Dia menghendaki. Sesungguhnya Allah Maha Mengetahui lagi Maha Bijaksana.” (At-Taubah:28). Orang-orang musyirik tidak di beri kesempatan untuk masuk daerah haram. Penghususan larangan untuk tidak mengganggu orang-orang yang mengunjungi Baitullah demi mencari ridha Allah dan karunia Allah dalam ayat ini menunjukan bahwa barangsiapa yang mendatanginya untuk melakukan penyimpangan dengan melakukan kemaksiatan, maka menghalangi orang yang bertujuannya seperti itu agar tidak membuat kerusakan di Baitullah adalah termasuk kesempurnaan penghormatan kepada Baitullah Al-Haram, sebagaimana Firman Allah, “Sesungguhnya orang-orang yang kafir dan menghalangi manusia dari jalan Allah dan Masjidilharam yang telah Kami jadikan untuk semua manusia, baik yang bermukim di situ maupun di padang pasir dan siapa yang bermaksud di dalamnya melakukan kejahatan secara zalim, niscaya akan Kami rasakan kepadanya sebahagian siksa yang pedih.” (Al-Hajj:25). Ketika Allah melarang mereka berburu pada waktu ihram, Allah berfirman, “ Dan apabila kamu telah menyelesaikan ibadah haji, maka bolehlah kamu berburu.” Maksudnya, jika kamu telah menyelesaikan haji dan umrah dengan bertahallul dari keduanya dan kamu telah keluar dari daerah Haram, maka halal untukmu berburu. Keharaman menjadi hilang. Dan perintah yang datang sesudah larangan hukumnya di kembalikan kepada hukum sebelum larangn itu ada. “Dan janganlah sekali-kali kebencianmu pada suatu kaum karena mereka mengahalang-halangimu dari Masjidil Haram mendorongmu berbuat aniaya kepada mereka.” Maksudnya kebencian suatu kaum, permusuhan, dan kezhaliman mereka terhadap kalian, dimana mereka menghalangimu dari Masjidil Haram jangan sampai mendorongmu untuk berbuat semena-mena kepada mereka untuk balas dendam. Seorang hamba harus senantiasa berpijak kepada perintah Allah dan menempuh jalan keadilan, walaupun dia dijahati atau di dzalimi atau di aniaya. Dia tidak boleh berdusta kepada orang berdusta kepadanya, atau menghianati orang yang menghianatinya. “Dan tolong menolonglah kamu dalam menolong kebaikan dan takwa.” Maksudnya, hendaknya sebgaian dari kamu membantu segaian yang lain dalam kebaikan. Kebajikan adalah nama yang mengumpulkan segalan perbuatan, baik lahir maupun batin, baik hak Allah maupun hak manusia yang di cintai dan diridhai oleh Allah. Dan takwa disini adalah nama yang mengumpulkan sikap meninggalkan segala perbuatan-perbuatan lahir dan batin yang di benci oleh Allah dan RasulNya. Setiap perbuatan baik yang di perintahkan untuk di kerjakan atau setiap perbiatan buruk yang diperintahkan untuk di jauhi, maka seorang hamba di perintahkan untuk melaksanakannya sendiri dan dengan bantuan dari orang lain dari kalangan saudara-saudaranya yang beriman, baik dengan ucapan atau perbuatan yang mamacu dan mendorong kepadanya. “Dan janganlah kamu saling tolong menolong dalam perbuatan dosa,” yaitu, saling mendorong melakukan kemaksiatan, di mana pelakunya memikul beban berat dosa. “Dan pelanggaran,” yaitu pelanggaran terhadap manusia pada darah, harta, dan kehormatan mereka. Seorang hamba wajib menghentikan diri dari segala kemaksiatan dan kezhaliman lalu membantu orang lain untuk meninggalkannya. “Dan bertakwalah kamu kepada Allah, sesungguhnya Allah amat berat siksaNYa.” Ialah, atas orang yang bermaksiat kepadaNya dan berani melanggar perkara-perkara yang diharamkannya. Karena itu berhati-hatilah terhadap perkara-perkara yang diharamkan agar hukumanNya tidak menimpa kalian di dunia dan akhirat."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 2: Syi'ar Allah adalah segala amalan yang dilakukan dalam rangka ibadah haji dan tempat-tempat mengerjakannya. Syi'ar bisa juga diartikan rambu-rambu agamanya. Ada pula yang mengartikan syi'ar-syi'ar di sini dengan \"larangan-larangan-Nya\", yakni jangan dilanggar. Melanggar syi'ar-syi'ar kesucian Allah misalnya mengerjakan larangan ihram, seperti berburu sewaktu ihram, demikian juga mengerjakan larangan-larangan di tanah haram. Maksudnya antara lain bulan Haram (bulan Zulkaidah, Zulhijjah, Muharram dan Rajab), tanah Haram (Mekah) dan Ihram, yakni dilarang melakukan peperangan di bulan-bulan itu. Jumhur ulama berpendapat bahwa larangan berperang di bulan haram sudah mansukh (dihapus) berdasarkan ayat 5 surat At Taubah, demikian juga berdasarkan ayat-ayat yang umum yang memerintahkan memerangi orang-orang kafir secara mutlak, di samping itu, Nabi Muhammad shallallahu 'alaihi wa sallam sendiri memerangi penduduk Tha'if di bulan Dzulqa'dah; salah satu bulan haram. Sedangkan ulama yang lain berpendapat, bahwa larangan berperang di bulan-bulan haram tidaklah mansukh berdasarkan ayat ini dan ayat yang lain, mereka mena'wil yang mutlaknya kepada yang muqayyad. Mereka juga merincikan, \"Tidak boleh memulai peperangan di bulan haram, adapun melanjutkan dan menyelesaikannya jika mulainya terjadi di bulan lain, maka boleh\", mereka juga mena'wil peperangan yang dilakukan Nabi shallallahu 'alaihi wa sallam terhadap penduduk Tha'if, bahwa peperangan tersebut di Hunain mulainya pada bulan Syawwal. Ini semua jika bukan peperangan daf' (pembelaan diri), namun jika peperangan daf', yakni orang-orang kafir yang memulainya, maka dibolehkan bagi kaum muslimin membalasnya, baik di bulan haram maupun lainnya berdasarkan ijma' para ulama. Yaitu binatang (unta, lembu, kambing, biri-biri) yang dibawa ke ka'bah untuk mendekatkan diri kepada Allah, disembelih ditanah Haram dan dagingnya dihadiahkan kepada fakir miskin dalam rangka ibadah haji. Kita tidak boleh mengganggunya, termasuk pula menghalangi dari sampai ke tempatnya, mencurinya dsb. Yaitu binatang had-yu yang diberi kalung, supaya diketahui orang bahwa binatang itu untuk dibawa ke Ka'bah. Yang dimaksud dengan karunia adalah keuntungan yang diberikan Allah dalam perniagaan. Dengan haji, umrah, thawaf, shalat dan ibadah lainnya. Yakni jangan menyakitinya, menghinanya, bahkan muliakanlah dan hormatilah orang-orang yang berkunjung ke rumah-Nya. Termasuk ke dalam hal ini adalah mengamankan jalan menuju Baitullah, membuat tenang orang-orang yang pergi berkunjung ke Baitullah dan membuat mereka bisa beristirahat, tanpa ada rasa takut dibunuh, dijambret hartanya dan dibajak. Namun demikian, ayat ini ditakhshis dengan firman Allah Ta'ala di surat At Taubah ayat 28, yang di sana disebutkan bahwa orang-orang musyrik tidak boleh masuk ke tanah haram. Larangan mengganggu ini jika ia menuju baitullah dengan maksud mencari karunia (rezeki) Allah dan keridhaan-Nya, namun jika maksudnya melakukan kejahatan, maka termasuk menghormati tanah haram adalah menghalanginya dari melakukan kejahatan. Bagi orang yang bermaksiat kepada-Nya dan berani mengerjakan yang diharamkan-Nya. Oleh karena itu, berhati-hatilah terhadap yang diharamkan agar kamu tidak mendapatkan siksaan-Nya cepat atau lambat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 2",
    "description": "Ayat berikut berisi hukum-hukum Allah yang berkaitan dengan tata cara pelaksanaan ibadah haji. Wahai orang-orang yang beriman! janganlah kamu melanggar syiar-syiar kesucian Allah, yakni segala amalan yang dilakukan dalam melaksanakan ibadah haji seperti tata cara melakukan tawaf dan sa'i, serta tempat-tempat mengerjakannya, seperti kakbah, safa, dan marwah, jangan engkau melanggarnya dengan berburu ketika dalam keadaan ihram dan jangan pula melanggar kehormatan bulanbulan haram, yaitu bulan zulkaidah, zulhijah, muharram, dan rajab, janganlah pula engkau melanggar kehormatannya dengan berperang pada bulan itu kecuali untuk membela diri ketika diserang. Jangan pula mengganggu hadyu, yaitu hewan-hewan kurban yang dihadiahkan kepada kakbah untuk mendekatkan diri kepada Allah, hewan-hewan itu disembelih di tanah haram dan dihadiahkan dagingnya kepada fakir miskin, dan qala'id, hewan-hewan kurban yang diberi tanda, dikalungi dengan tali sebagai tanda yang menunjukkan bahwa hewan itu telah dipersiapkan untuk dikurbankan dan dihadiahkan, dan jangan pula mengganggu orang-orang yang mengunjungi baitulharam, untuk melaksanakan ibadah haji atau umrah, mereka mencari karunia berupa keuntungan duniawi, dan keridaan yang berupa ganjaran dari tuhannya. Akan tetapi, apabila kamu telah menyelesaikan ihram, maka bolehlah kamu berburu apabila kamu mau. Jangan sampai kebencian sebagian kamu kepada suatu kaum karena mereka menghalang-halangimu dari mengunjungi masjidilharam, mendorongmu berbuat melampaui batas kepada mereka dengan cara membunuh mereka atau melakukan kejahatan kepada mereka. Dan tolong-menolonglah kamu dalam mengerjakan kebajikan, melakukan yang diperintahkan Allah, dan takwa, takut kepada larangannya, dan jangan tolong-menolong dalam berbuat dosa, melakukan maksiat dan permusuhan, sebab yang demikian itu melanggar hukum-hukum Allah. Bertakwalah kepada Allah, takut kepada Allah dengan melakukan perintah-Nya dan meninggalkan larangan-Nya, karena sungguh Allah sangat berat siksaan-Nya kepada orang-orang yang tidak taat kepada-Nyapada ayat yang lalu telah dijelaskan beberapa perbuatan yang diharamkan. Ayat ini menguraikan lebih terperinci makanan-makanan yang diharamkan. Ada sepuluh jenis makanan yang diharamkan, semuanya berasal dari hewan. Diharamkan bagimu memakan bangkai, darah yang keluar dari tubuh, sebagaimana tersebut dalam surah alan'a'm/6: 145, daging babi, dan daging hewan yang disembelih bukan atas nama Allah, demikian pula diharamkan daging hewan yang tercekik, yang dipukul, yang jatuh, yang ditanduk, dan yang diterkam binatang buas, kecuali yang sempat kamu sembelih. Hewan yang tercekik, yang dipukul, yang jatuh, yang ditanduk, dan yang diterkam binatang buas adalah halal hukumnya kalau sempat disembelih sebelum mati. Dan diharamkan pula hewan yang disembelih untuk berhala. Dan diharamkan pula mengundi nasib dengan anak panah. Orang arab jahiliah menggunakan anak panah untuk menentukan apakah mereka akan melakukan suatu perbuatan atau tidak. Mereka mengambil tiga buah anak panah yang belum memakai bulu, masing-masing anak panah itu ditulis dengan kata-kata lakukan, jangan lakukan, dan anak panah yang ketiga tidak ditulis apa-apa. Semua anak panah itu diletakkan dalam sebuah tempat dan disimpan dalam kakbah. Bila mereka hendak melakukan suatu perbuatan, maka mereka meminta agar juru kunci kakbah mengambil salah satu dari tiga anak panah itu. Mereka melakukan perbuatan atau tidak melakukan perbuatan sesuai dengan bunyi kalimat yang tertulis dalam anak panah yang diambilnya. Kalau yang terambil anak panah yang tidak ada tulisannya, maka undian diulangi sekali lagi. Janganlah melakukan yang demikian itu karena itu suatu perbuatan fasik. Pada hari ini, yaitu pada waktu haji wada', haji terakhir yang dilakukan oleh nabi Muhammad, orang-orang kafir telah putus asa untuk mengalahkan agamamu, sebab itu janganlah kamu takut kepada mereka, tetapi takutlah kepada-ku. Pada hari ini telah aku sempurnakan agamamu untukmu, dan telah aku cukupkan nikmat-ku bagimu, dan telah aku ridai islam sebagai agamamu. Tetapi barang siapa dalam keadaan terpaksa, dibolehkan memakan makanan yang diharamkan oleh ayat ini karena lapar, bukan karena ingin berbuat dosa, maka sungguh, Allah maha pengampun, maha penyayang."
  }
]