[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai kaumku, masuklah kalian kenegeri yang disucikan ,yaitu baitul maqdis dan juga tempat sekitarnya, yang Allah janjikan kalian akan memasukinya dan memerangi orang-orang kafir yang ada di dalamnya. Dan janganlah kalian kembali dari memerangi orang-orang yang menjajah, maka kalian akan merugi karena tidak mendapatkan kebaikan dunia dan kebaikan akhirat.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "21. Musa berkata, “Wahai kaumku! Masuklah kalian ke tanah suci (Baitulmakdis dan sekitarnya) yang telah Allah janjikan kepada kalian bahwa kalian akan memasukinya dan memerangi orang-orang kafir yang ada di sana, dan kalian tidak akan tunduk kepada para penjajah yang kejam, supaya kalian tidak merugi di dunia dan di Akhirat.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "21. Setelah Allah mengingatkan kenikmatan kenikmatan yang telah diberikan kepada mereka, dan mengingatkan masa lalu mereka yang belum lama dan kesudahan urusan mereka dalam hal hidayah dan kejayaan untuk mempersiapkan mereka melakukan kewajiban yang telah menunggu mereka ini. Kemudian Allah memerintahkan mereka untuk memasuki Baitul Maqdis dan mengabarkan bahwa mereka telah ditetapkan untuk memasukinya, sebagai penegas perintah dan pendorong bagi mereka untuk segera melaksanakannya. Maka sesungguhnya yang perlu mereka lakukan hanyalah segera melaksanakannya karena mereka telah mendapat jaminan. Namun jika mereka enggan menjalankan perintah Allah maka mereka telah berpaling dan mundur dengan membawa kegunaan dan kerugian."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "21. الْأَرْضَ الْمُقَدَّسَةَ (tanah suci) Yakni tanah Palestina. Dan makna (المقدسة) yakni disucikan, atau diberkahi. الَّتِى كَتَبَ اللهُ لَكُمْ (yang telah ditentukan Allah bagimu) Yakni ditakdirkan untuk kalian berdasarkan ilmu Allah. Dan dijadikan sebagai tempat tinggal mereka ketika mereka masih taat kepada-Nya. Dan ketika mereka rusak, Allah mengeluarkan mereka. وَلَا تَرْتَدُّوا۟ عَلَىٰٓ أَدْبَارِكُمْ (dan janganlah kamu lari kebelakang) Yakni janganlah kalian meninggalkan perintah-Ku dan ketaatan kepada-Ku serta apa yang Aku wajibkan atas kalian berupa peperangan melawan orang-orang yang perkasa karena takut dan lemah. فَتَنقَلِبُوا۟ خٰسِرِينَ (maka kamu menjadi orang-orang yang merugi) Yakni rugi atas kebaikan dunia dan akhirat."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "21 Musa juga berkata: Hai kaumku, masuklah ke tanah suci Palestina yang telah disucikan Allah dari berhala karena di sana banyak diutus Nabi-nabi. Allah telah menentukan bahwa kalian memasukinya, selagi kalian berbuat baik dalam keimanan dan ketaatan. Jika kalian rusak dan menjauh dari ketaatan bahkan tidak mau kembali dan lari ke belakang karena takut kepada musuh, maka kamu menjadi orang-orang yang merugi atas kebaikan dunia dan pahala akhirat."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Wahai kaumku, masuklah ke tanah suci} tanah yang disucikan yaitu Baitul Maqdis dan daerah sekitarnya {yang telah Allah tentukan bagi kalian} Allah mewajibkan atas kalian untuk memasukinya dan menjanjikan kalian untuk memasukinya {dan janganlah berbalik ke belakang} janganlah kalian melanggar perintah {sehingga kalian kembali} kembali {menjadi orang-orang yang rugi.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "21. Oleh karena itu Musa berkata, “Wahai kaumku, masuklah ke tanah suci (Palestina) yang telah ditentukan oleh Allah bagimu.” Musa menyampaikan kepada mereka berita yang menenangkan diri mereka jika mereka percaya dan beriman kepada berita Allah. Allah telah menentukan bahwa mereka akan memasukinya dan mereka akan menang atas musuh mereka. “Dan janganlah kamu lari,” artinya, jangan mundur “ke belakang, karena kamu akan menjadi orang-orang yang merugi.” Kamu merugi di dunia karena lepasnya kemenangan atas musuhmu dari tanganmu dan hilangnya kesempatan untuk membebaskan negerimu, dan kamu juga rugi akhirat karena kamu kehilangan pahala, dank arena pelanggaranmu itu, maka kamu berhak mendapatkan hukuman."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 21: Maksudnya, tanah Palestina itu ditentukan Allah bagi kaum Yahudi selama mereka beriman dan taat kepada Allah. Dengan tidak mendapatkan kemenangan terhadap musuh dan tidak dapat menaklukkan negeri sendiri, dan di akhirat tidak memperoleh pahala bahkan berhak memperoleh hukuman karena maksiatnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 21",
    "description": "Nabi musa selanjutnya berkata kepada kaumnya, wahai kaumku! masuklah ke tanah suci, yaitu tanah palestina yang disucikan dari kemusyrikan karena banyaknya nabi-nabi yang diutus di tanah itu, itulah tanah yang telah ditentukan Allah bagimu dalam ilmu-Nya yang azali untuk memasukinya dan merasakan kedamaian di dalamnya apabila engkau beriman dan taat kepada perintah-Nya, dan janganlah kamu berbalik ke belakang karena takut kepada musuh, nanti kamu menjadi orang yang rugi di dunia dan akhirat karena kamu tidak mempercayai jaminan Allah bahwa tanah itu ditetapkan Allah bagimu untuk memasukinya. Mereka tidak serta merta menuruti perintah nabi musa yang menyuruh agar mereka memasuki tanah palestina. Sebaliknya, mereka bahkan menyatakan keengganan untuk memasukinya karena takut kepada para penjahat perkasa yang tengah menduduki tanah itu. Mereka, kaum bani israil itu, berkata, wahai musa! sesungguhnya di dalam negeri itu yang kami diperintahkan untuk memasukinya ada orang-orang yang sangat kuat dan kejam, yakni orang-orang kana'an, yang akan menindas dan berbuat jahat kepada kami. Kami tidak akan memasukinya sebelum mereka keluar darinya tanpa kami berperang melawan mereka. Kami tidak sanggup mengusirnya karena mereka sangat perkasa. Jika mereka keluar dari sana, niscaya kami akan masuk ke negeri itu."
  }
]