[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Mereka menjawab, ”Wahai musa,sesungguhnya di dalamnya ada kaum yang sangat perkasa lagi kuat-kuat, tidak ada kekuatan bagi kami untuk memerangi mereka. Dan sesungguhnya kami tidak mungkin masuk,sedang mereka masih ada di dalamya. Maka bila mereka telah pergi darinya, barulah kami akan masuk.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "22. Kaumnya menjawab, “Wahai Musa! Sesungguhnya di tanah suci itu ada orang-orang yang memiliki kekuatan dan pasukan yang kuat. Inilah yang menghalangi kami untuk masuk ke sana. Kami tidak akan masuk ke sana selama mereka masih ada di sana. Karena kami tidak memiliki daya dan kekuatan untuk berperang melawan mereka. Jika mereka keluar dari sana (Baitul Maqdis) kami akan masuk ke sana.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "22. Setelah semua ini kemudian mereka menampakkan sifat kepengecutan mereka dan mulai mengingkari perjanjian mereka dengan Allah. Mereka berkata kepada nabi mereka: sesungguhnya di dalam Baitul Maqdis pendapat kaum yang kuat dan bengis, kami takut dari kekejaman mereka dan Kami tidak akan mampu melawan mereka. Kemudian mereka memberi syarat; jika kaum itu keluar dari Baitul Maqdis maka mereka baru akan mau memasukinya agar mereka dapat masuk dalam keadaan aman dan selamat."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "22. قَالُوا۟ يٰمُوسَىٰٓ إِنَّ فِيهَا قَوْمًا جَبَّارِينَ (Mereka berkata: “Hai Musa, sesungguhnya dalam negeri itu ada orang-orang yang gagah perkasa) Yakni kaum yang memiliki badan yang tinggi besar lagi perkasa, mereka adalah kaum Amaliq dari bangsa Kan’an. فَإِن يَخْرُجُوا۟ مِنْهَا فَإِنَّا دٰخِلُونَ(Jika mereka ke luar daripadanya, pasti kami akan memasukinya) Ini adalah keterusterangan mereka bahwa mereka menolak untuk masuk adalah karena sebab ini (adanya kaum yang gagah perkasa)"
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "22-23 1 ). Ketika orang-orang telah melemah maka bangkitlah kamu diatas pendirian yang benar, perhatikan kisah penaklukan Baitul Maqdis dan bagaimana Bani Israil berkata kepada Musa 'alaihissalam : { يَا مُوسَىٰ إِنَّ فِيهَا قَوْمًا جَبَّارِينَ وَإِنَّا لَنْ نَدْخُلَهَا حَتَّىٰ يَخْرُجُوا مِنْهَا فَإِنْ يَخْرُجُوا مِنْهَا فَإِنَّا دَاخِلُونَ } \"Hai Musa, sesungguhnya dalam negeri itu ada orang-orang yang gagah perkasa, sesungguhnya kami sekali-kali tidak akan memasukinya sebelum mereka ke luar daripadanya. Jika mereka ke luar daripadanya, pasti kami akan memasukinya\", maka satu-santunya pegangan yang dengan soeang hamba akan menjadi kuat dan kokoh adalah al-Qur'an. 2 ). Jika jalan telah tertutup bagimu untuk melakukan suatu perintah syar'ah, atau kamu ragu untuk melakukannya karena takut akan kekuatan yang hilang dari dirimu, maka tetaplah teguh diatas jalan-Nya dan senantiasalah bertawakkal kepada Allah : { فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ ۚ وَعَلَى اللَّهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ } \"maka bila kamu memasukinya niscaya kamu akan menang. Dan hanya kepada Allah hendaknya kamu bertawakkal, jika kamu benar-benar orang yang beriman”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "22 Mereka Bani Israil berkata: “Hai Musa, sesungguhnya dalam negeri itu ada orang-orang yang sangat gagah perkasa, mereka adalah keturunan Kan’an dan Amalik. Jabbar adalah yang memenuhi keinginan manusia. Sesungguhnya kami sekali-kali tidak akan memasukinya sebelum mereka ke luar darinya. Dan mereka menyerahkan kota itu kepada kami tanpa ada peperangan. Jika mereka ke luar darinya, pasti kami akan memasukinya”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Wahai Musa, sesungguhnya di dalamnya ada kaum yang sangat kuat} besar badannya dan tinggi perawakannya {Kami tidak akan memasukinya sebelum mereka keluar. Jika mereka keluar dari sana, kami pasti akan masuk.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "22. Mereka menjawab dengan jawaban dengan jawaban lemahnya jiwa-jiwa mereka, kepicikan dan ketidak pedulian mereka terhadap perintah Allah dan RasulNya, “Hai Musa, sesungguhnya di dalam negeri itu terdapat orang-orang gagah perkasa,” yakni, orang-orang yang sangat kuat lagi berani, inilah yang mengalangi kami untuk masuk kedalamnya, “sesungguhnya kami sekali-kali tidak akan memasukinya sebelum mereka keluar darinya. Jika mereka keluar darinya, pasti kami akan memasukinya,” ini adalah sipat pengecut dan tidak punya keyakinan, karena jika tidak, seandainya mereka sedikit memiliki kesadaran, niscaya mereka akan tahu bahwa mereka adalah menusia biasa, dan bahwa orang yang kuat adalah orang yang telah Allah bantu dengan kekuatn dari sisiNya, karena tiada daya dan kekuatan kecuali karena Allah, niscaya mereka akan tahu bahwa mereka akan menang atas musuh mereka, karena Allah telah menjanjikan itu kepada mereka secara khusus."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 22: Kata-kata ini keluar dari sifat pengecut dan lemahnya keyakinan. Jika mereka berpikir matang, tentu mereka akan mengetahui bahwa mereka semua berasal dari keturunan Adam, orang yang kuat adalah orang yang diberikan kekuatan oleh Allah, karena tidak ada daya dan kekuatan kecuali dengan pertolongan Allah, dan tentu mereka akan mengetahui bahwa mereka akan menang, karena Allah telah menjanjikan kemenangan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 22",
    "description": "Mereka tidak serta merta menuruti perintah nabi musa yang menyuruh agar mereka memasuki tanah palestina. Sebaliknya, mereka bahkan menyatakan keengganan untuk memasukinya karena takut kepada para penjahat perkasa yang tengah menduduki tanah itu. Mereka, kaum bani israil itu, berkata, wahai musa! sesungguhnya di dalam negeri itu yang kami diperintahkan untuk memasukinya ada orang-orang yang sangat kuat dan kejam, yakni orang-orang kana'an, yang akan menindas dan berbuat jahat kepada kami. Kami tidak akan memasukinya sebelum mereka keluar darinya tanpa kami berperang melawan mereka. Kami tidak sanggup mengusirnya karena mereka sangat perkasa. Jika mereka keluar dari sana, niscaya kami akan masuk ke negeri itu. Di antara orang-orang bani israil itu ada dua orang yang setia dan taat kepada perintah nabi musa, yaitu yosua bin nun dan kalaeb bin yefune, keduanya adalah pemimpin-pemimpin bani israil yang semuanya ada dua belas orang sebagaimana disebut dalam ayat 12 surah ini. Berkatalah dua orang laki-laki di antara mereka yang bertakwa, orang yang takut kepada Allah, atau di antara mereka yang takut kepada para penjahat yang perkasa itu, yang telah diberi nikmat oleh Allah, dengan penuh semangat, serbulah mereka melalui pintu gerbang negeri itu. Jika kamu memasukinya niscaya kamu akan menang. Dan Allah telah menjanjikan kemenangan itu, maka bertawakAllah kamu hanya kepada Allah, jika kamu orang-orang yang beriman dengan sebenar-benar iman kepada Allah."
  }
]