[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Berkatalah dua orang lelaki dari orang-orang yang takut kepada Allah , yang Allah telah limpahkan kenikmatan kepada mereka berdua untuk menaati Allah dan menaati rasulNya, kepada Bani israil, ”masuklah kepada mereka para penjajah itu melalui pintu gerbang kota mereka, sebagai satu bentuk ikhtiar. Kemudian apabila kalian telah memasuki pintu gerbang niscaya kalian akan dapat mengalahkan mereka. Dan hanya kepada Allah lah hendaknya kalian bertawakal, jika kalian orang-orang yang beriman kepada rasulNya terkait risalah yang dia bawa kepada kalian, lagi mengamalkan syariatNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "23. Dua orang sahabat Musa yang merasa takut kepada Allah dan takut pada hukuman-Nya serta mendapatkan bimbingan Allah untuk patuh kepada-Nya berkata kepada kaumnya untuk mendorong mereka agar menjalankan perintah Musa -‘Alaihissalām-, “Hadapilah para penjajah yang kejam itu dengan memasuki pintu gerbang kota. Jika kalian berhasil mendobrak pintu gerbang itu dan masuk ke dalam kota, niscaya -dengan izin Allah- kalian akan dapat mengalahkan mereka. Kalian harus percaya akan sunatullah yang menggantungkan pertolongan pada usaha-usaha berupa iman kepada Allah dan menyiapkan alat-alat yang diperlukan. Dan bersandarlah serta bertawakkallah kalian hanya kepada Allah jika kalian benar-benar beriman kepada-Nya. Karena iman kepada Allah mengharuskan berserah diri kepada-Nya -Subḥānahu-”."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "23. Namun akan tetap ada orang-orang yang akan membela kebenaran meskipun mereka hanya sedikit. Dan inilah dua lelaki pilihan yang shalih, mereka berdiri dengan gagah untuk membela kebenaran sehingga Allah catat mereka di dalam kitab-Nya yang paling agung dan mulia. Itulah kejantanan dan keberanian yang akan tampak pada peristiwa-peristiwa yang besar, yang senantiasa diiringi rasa takut kepada Allah. Karena barangsiapa yang takut kepada Allah niscaya dia tidak akan takut kepada selain-Nya, dan barangsiapa yang tidak takut kepada Allah niscaya dia akan takut dari segalanya. Oleh sebab itu, mereka berani menyampaikan nasehat yang agung: \"Hendaklah kalian segera memasuki Baitul Maqdis dengan usaha yang sungguh-sungguh dan taatilah Tuhan kalian, ikutilah nabi kalian, dan seranglah benteng-benteng musuh kalian itu, niscaya kalian akan meraih kemenangan. Berusahalah dengan sungguh-sungguh dan bertakwalah kepada Allah jika kalian termasuk orang-orang yang beriman, karena tawakal merupakan sifat orang beriman. Dan tingkat tawakal tergantung tingkat keimanan.\""
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "23. قَالَ رَجُلَانِ (Berkatalah dua orang) Yakni Yusya’ dan Kalab bin Yufanna, dan mereka berdua termasuk dari 12 pemimpin bani Israil. مِنَ الَّذِينَ يَخَافُونَ(diantara orang-orang yang takut) Yakni takut kepada Allah. Pendapat lain mengatakan yang dimaksud adalah keduanya termasuk orang-orang yang takut pada kelemahan dan kepengecutan Bani Israil. أَنْعَمَ اللهُ عَلَيْهِمَا (yang Allah telah memberi nikmat atas keduanya) Yakni dengan kenikmatan iman dan yakin akan mendapat apa yang dijanjikan kepada mereka berupa kemenangan dan kejayaan. ادْخُلُوا۟ عَلَيْهِمُ الْبَابَ(Serbulah mereka dengan melalui pintu gerbang (kota) itu) Yakni pintu negeri yang dihuni orang-orang yang gagah perkasa tersebut. فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غٰلِبُونَ ۚ( maka bila kamu memasukinya niscaya kamu akan menang) Keduanya mengatakan ini sebagai bentuk kepercayaan mereka atas janji Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "22-23 1 ). Ketika orang-orang telah melemah maka bangkitlah kamu diatas pendirian yang benar, perhatikan kisah penaklukan Baitul Maqdis dan bagaimana Bani Israil berkata kepada Musa 'alaihissalam : { يَا مُوسَىٰ إِنَّ فِيهَا قَوْمًا جَبَّارِينَ وَإِنَّا لَنْ نَدْخُلَهَا حَتَّىٰ يَخْرُجُوا مِنْهَا فَإِنْ يَخْرُجُوا مِنْهَا فَإِنَّا دَاخِلُونَ } \"Hai Musa, sesungguhnya dalam negeri itu ada orang-orang yang gagah perkasa, sesungguhnya kami sekali-kali tidak akan memasukinya sebelum mereka ke luar daripadanya. Jika mereka ke luar daripadanya, pasti kami akan memasukinya\", maka satu-santunya pegangan yang dengan soeang hamba akan menjadi kuat dan kokoh adalah al-Qur'an. 2 ). Jika jalan telah tertutup bagimu untuk melakukan suatu perintah syar'ah, atau kamu ragu untuk melakukannya karena takut akan kekuatan yang hilang dari dirimu, maka tetaplah teguh diatas jalan-Nya dan senantiasalah bertawakkal kepada Allah : { فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَالِبُونَ ۚ وَعَلَى اللَّهِ فَتَوَكَّلُوا إِنْ كُنْتُمْ مُؤْمِنِينَ } \"maka bila kamu memasukinya niscaya kamu akan menang. Dan hanya kepada Allah hendaknya kamu bertawakkal, jika kamu benar-benar orang yang beriman”."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "23 Berkatalah dua orang diantara orang-orang yang takut kepada Allah. Mereka adalah Yusya’ dan Kalib bin Yufna yaitu anggota dari 12 pemimpin. Allah telah memberi nikmat atas keduanya dengan iman dan keteguhan atas janji pertolongan Allah kepada mereka: “Serbulah mereka melalui pintu gerbang kota orang-orang Jabbarin itu. Maka bila kamu memasukinya niscaya kamu akan menang dengan izin Allah”. Mereka berdua berkata seperti itu sebab mereka yakin dan teguh atas janji Allah."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Lalu berkata dua orang laki-laki di antara orang-orang yang bertakwa} takut kepada Allah {yang keduanya telah diberi nikmat oleh Allah} Allah memuliakan kepada keduanya dengan pertolongan, keteguhan dan kepercayaan kepada janjiNya {“Masukilah pintu gerbang negeri itu} pintu negeri itu {Jika kalian memasukinya, kalian pasti akan menang. Bertawakallah hanya kepada Allah, jika kalian adalah orang-orang mukmin.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "23. “ Berkatalah dua orang dia antara orang-orang yang takut,” kepada Allah. Keduanya mendorong kaumNya, membangkitkan mereka untuk melawan musuh mereka, dan merebut negeri mereka, “ yang Allah telah beri nikmat kepada keduanya,” dengan taufik dan khalimatul khaq dalam kondisi yang mana ucapan seperti itu sangat di butuhkan dan Allah memberi nikmat kepada mereka dalam bentuk kesabaran dan keyakinan (kata mereka berdua), “ Serbulah mereka dengan memasuki gerbang kota, bila kamu memasukinya maka kamu akan menang,: maksudnya, antara dirimu dengan kemenangan atas mereka hanyalah keberanianmu atas mereka dengan menyerbu melalui pintu gerbang, jika kamu menyerbu mereka maka mereka akan di kalahkan. Kemudian keduanya meminta kaumnya menyiapkan persiapan yang paling kuat, keduanya berkata, “ Dan hanya kepada Allah hendaknya kamu bertawakal jika kamu benar-benar orang yang beriman.” Karena bertawakal kepada Allah khususnya dalam kondisi seperti ini, memudahkan perkara dan memberi kemenangan atas musuh. Ini menunjukan kewajiban tawakal, dan tawakalnya seorang hamba tergantung imannya."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 23: Ada yang mengatakan bahwa dua orang itu adalah Yusya' dan Kalib yang tergolong pimpinan kaumnya, di mana Nabi Musa 'alaihis salam mengutus keduanya untuk memeriksa kaum yang kuat dan kejam itu. Keduanya menyembunyikan keadaan kaum tersebut selain kepada Nabi Musa 'alaihis salam, berbeda dengan para pemimpin yang lain, mereka memberitahukan keadaan itu kepada orang-orang yang berada di bawahnya sehingga mereka ketakutan. Keduanya mengatakan seperti itu karena yakin dengan pertolongan Allah dan bahwa Dia akan memenuhi janji-Nya. Tawakkal kepada Allah merupakan persiapan yang paling kuat, memudahkan urusan dan memenangkan mereka ketika melawan musuh."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 23",
    "description": "Di antara orang-orang bani israil itu ada dua orang yang setia dan taat kepada perintah nabi musa, yaitu yosua bin nun dan kalaeb bin yefune, keduanya adalah pemimpin-pemimpin bani israil yang semuanya ada dua belas orang sebagaimana disebut dalam ayat 12 surah ini. Berkatalah dua orang laki-laki di antara mereka yang bertakwa, orang yang takut kepada Allah, atau di antara mereka yang takut kepada para penjahat yang perkasa itu, yang telah diberi nikmat oleh Allah, dengan penuh semangat, serbulah mereka melalui pintu gerbang negeri itu. Jika kamu memasukinya niscaya kamu akan menang. Dan Allah telah menjanjikan kemenangan itu, maka bertawakAllah kamu hanya kepada Allah, jika kamu orang-orang yang beriman dengan sebenar-benar iman kepada Allah. Setelah orang-orang yahudi menolak perintah dua utusan nabi musa, yaitu yosua bin nun dan kalaeb bin yefune, mereka berkata, wahai musa! meski engkau menyuruh kami untuk masuk ke kana'an yang merupakan daerah orang palestina, sampai kapan pun kami tidak akan memasukinya selama mereka, yaitu penduduknya yang merupakan orang-orang kuat lagi besar, masih ada di dalamnya. Karena itu, lebih baik pergilah engkau bersama tuhanmu, dan kemudian berperanglah kamu berdua untuk mengalahkan mereka. Sementara kalian berperang, biarlah kami tetap berada dan menanti di sini saja sambil menunggu hasil dari perjuanganmu."
  }
]