[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kaum Musa berkata kepadanya,”Sesungguhnya kami sekali-kali tidak akan memasuki kota itu selama-lamanya, selama orang-orang penjajah itu masih berada di dalamnya. Maka pergilah kamu wahai musa bersama tuhanmu, lalu perangilah mereka. Adapun kami,akan duduk-duduk disini, dan tidak akan bergerak memerangi mereka. Ini adalah bentuk keras kepala mereka untuk terus melanggar perintah Musa ."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "24. Kaum Musa dari kalangan Bani Israil bersikeras untuk menentang perintah nabi mereka, Musa -‘Alaihissalām- dengan mengatakan, “Sungguh, kami tidak akan masuk ke dalam kota selama para penjajah yang kejam itu berada di sana. Pergilah kamu -wahai Musa- bersama Rabbmu. Lalu berperanglah kalian berdua. Kami akan tetap duduk di sini. Kami tidak mau berperang bersama kalian berdua.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "24. Akan tetapi Bani Israel tetap pada sikap awal mereka. Mereka tetap membangkang dan tetap enggan menjalankan perintah. Mereka menjawab perintah nabi mereka dengan jawaban orang pengecut tanpa ada rasa kepedulian dan kesopanan untuk menegaskan bahwa mereka tidak akan memasuki Baitul Maqdis selama kaum yang kejam itu masih berada di dalamnya. Jika kaum itu telah keluar maka mereka baru bersedia untuk memasukinya dengan penuh kemenangan tanpa harus menumpahkan darah, mengotori kaki, atau memberikan sedikit pengorbanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "24. قَالُوا۟ (Mereka berkata) Yakni Bani Israil berkata kepada Nabi Musa. إِنَّا لَن نَّدْخُلَهَآ أَبَدًا مَّا دَامُوا۟ فِيهَا ۖ (kami sekali sekali tidak akan memasukinya selama-lamanya, selagi mereka ada didalamnya) Perkataan ini mereka katakan karena ketakutan dan kepengecutan mereka, atau juga karena kebebalan dan keberanian mereka dalam melanggar perintah Allah dan Rasul-Nya. فَاذْهَبْ أَنتَ وَرَبُّكَ فَقٰتِلَآ(karena itu pergilah kamu bersama Tuhanmu, dan berperanglah kamu berdua) Mereka mengatakan ini karena mereka jahil tentang Allah dan sifat-sifat-Nya, serta kekafiran mereka terhadap yang diwajibkan atas mereka. إِنَّا هٰهُنَا قٰعِدُونَ(sesungguhnya kami hanya duduk menanti disini saja) Yakni kami akan tetap di tempat ini, tidak maju bersamamu tidak pula mundur. Dan tempat itu berada di bukit Bani Musyrif diatas tanah suci bagian Urdun."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "24 Mereka orang-orang Israil berkata: “Hai Musa, kami sekali sekali tidak akan memasuki kota itu selama-lamanya, selagi mereka ada di dalamnya. Ini adalah perkataan yang diiringi rasa pengecut. Karena itu pergilah kamu bersama Tuhanmu, dan berperanglah kalian berdua, sesungguhnya kami hanya duduk menanti disini saja dan tidak akan meninggalkan tempat”. Ini adalah perkataan orang yang tidak mengerti akan Allah dan sifat-sifat-Nya, dan ingkar kepada Allah dan rasul-Nya."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka berkata, “Wahai Musa, sesungguhnya kami tidak akan memasukinya} tidak akan memasuki negeri orang-orang yang kuat itu {sampai kapan pun selama mereka masih ada di dalamnya. Jadi pergilah kamu bersama Tuhanmu, lalu berperanglah kamu berdua. Sesungguhnya kami tetap berada di sini saja.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "24. Perkataan dari dua orang ini tidak berhasil dan dorongan itu tidak berguna, maka mereka mengucapkan ucapan yang kalah dan terhina, “ Hai, Musa kami sekali-kali tidak akan memasukinya selama-lamanya, selagi mereka ada di dalamnya, karena itu pergilah kamu bersama RabbMu, dan berperanglah kamu berdua sesungguhnya kami hanya duduk menanti di sini saja.” Alangkah buruknya ucapan mereka ini, betapa jeleknya sikap mereka kepada Nabi mereka dalam kondisi yang sulit lagi sempit ini, dimana keadaan menuntut secara mendesak untuk menolong Nabi mereka dan membela harga diri mereka. Dengan ucapan ini dan yang sepertinya, jelaslah perbedaan umat-umat yang lain dengan umat Muhammad yang mana para sahabat berkata kepada Rasululoh ketika beliau meminta pendapat tentang peprangan pada perang badar, meski beliau tidak mengharuskan itu kepada mereka, mereka berkata “ya Rasululoh, seandainya engkau membawa kami menyebrangi lautan, niscaya kami akan mengarunginya bersama kamu. Seandainya kamu membawa kami ke Birk al- Ghimad niscaya tak seorangpun dari kami yang tertingal. Kami tidak mengatakan apa yang di katakan oleh kaum Musa kepada Musa, “Pergilah kamu bersama Rabbmu dan berperanglah kamu berdua, sesungguhnya kami hanya duduk menanti disini saja.” Akan tetapi pergilah engkau dengan Rabbmu, berperanglah, kamipun ikut berperang bersamamu di depanmu, di belakangmu, dan di samping kiri dan kananmu.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 24: Sungguh keji sekali perkataan yang ditujukan kepada nabi mereka ini, berbeda dengan para sahabat Nabi Muhammad shallallahu 'alaihi wa sallam ketika bermusyawarah untuk berperang di Badar, mereka berkata kepada Nabi Muhammad shallallahu 'alaihi wa sallam, \"Wahai Rasulullah, jika engkau mengarungi laut ini, niscaya kami akan mengarungi bersamamu, dan jika engkau mengajak kami ke Barkulghimad (wilayah di dekat Mekah kira-kira menempuh lima hari untuk menuju ke sana dari pinggir laut), niscaya tidak ada seorang pun meninggalkanmu.\" Kami tidak akan berkata-kata seperti yang diucapkan kaum Musa kepada Musa, \"Pergilah kamu bersama Tuhanmu, dan berperanglah kamu berdua. Biarlah kami tetap (menanti) di sini saja\" akan tetapi (kami mengatakan), \"Pergilah kamu bersama Tuhanmu, dan berperanglah kamu berdua, kami pun ikut berperang bersamamu, baik di depanmu atau di belakangmu, di kananmu atau di kirimu.\""
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 24",
    "description": "Setelah orang-orang yahudi menolak perintah dua utusan nabi musa, yaitu yosua bin nun dan kalaeb bin yefune, mereka berkata, wahai musa! meski engkau menyuruh kami untuk masuk ke kana'an yang merupakan daerah orang palestina, sampai kapan pun kami tidak akan memasukinya selama mereka, yaitu penduduknya yang merupakan orang-orang kuat lagi besar, masih ada di dalamnya. Karena itu, lebih baik pergilah engkau bersama tuhanmu, dan kemudian berperanglah kamu berdua untuk mengalahkan mereka. Sementara kalian berperang, biarlah kami tetap berada dan menanti di sini saja sambil menunggu hasil dari perjuanganmu. Mendengar penolakan dari kaumnya, dia, musa, mengadu kepada Allah dan berkata, ya tuhanku, aku hanya dapat menguasai diriku sendiri dan saudaraku, harun, dan aku tidak mampu mengajak kaumku untuk menaati perintah-Mu. Oleh karena itu, hendaknya engkau pisahkan antara kami yang selalu taat pada-Mu dengan orang-orang yang fasik yang tidak mau mendengarkan ketetapan-Mu itu."
  }
]