[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian Musa menghadap kepada tuhannya seraya berdoa, ”sesungguhnya aku tidak berkuasa, kecuali atas diriku dan saudaraku. Maka berilah keputusan hukum antara kami dan kaum yang berbuat kefasikan itu.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "25. Musa berkata kepada Rabbnya, “Ya Rabb, aku tidak punya kuasa atas siapa pun selain diriku dan saudaraku, Harun. Maka jauhkanlah kami berdua dari orang-orang yang menentang perintah-Mu dan perintah rasul-Mu.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "25. Ketika itu Nabi Musa tidak lagi memiliki pilihan kecuali menghadap kepada Sang Pencipta dan Penolongnya, dengan menjelaskan bahwa dia tetap di atas perjanjian dan siap untuk menjalankan perintah dengan saudaranya. Nabi Musa dan saudaranya yakin dengan janji Allah. Dan keduanya menampakan kesedihan dan penyesalan atas apa yang dilakukan kaumnya serta berharap mereka tidak dikelompokkan bersama orang-orang yang menentang perintah-Nya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "25. قَالَ (Berkata) Yakni Musa berkata. رَبِّ إِنِّى لَآ أَمْلِكُ إِلَّا نَفْسِى وَأَخِى ۖ (Ya Tuhanku, aku tidak menguasai kecuali diriku sendiri dan saudaraku) Dia mengatakannya karena telah putus asa dalam mengajak mereka. Yakni mereka telah keluar dari ketaatan kepadaku. فَافْرُقْ بَيْنَنَا وَبَيْنَ الْقَوْمِ الْفٰسِقِينَ(Sebab itu pisahkanlah antara kami dengan orang-orang yang fasik itu) Yakni pisahkanlah kami dari golongan mereka, dan janganlah Engkau sertakan kami dalam siksaan yang Engkau timpakan kepada mereka. Pendapat lain mengatakan maknanya adalah maka selesaikanlah urusan kami dengan mereka."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Memisahakan diri dari kelompok orang-orang durhaka adalah kebiasaan dan menjadi karakteristik orang-orang baik, karena teman yang buruk adalah seperti pandai besi ketika engkau bersamanya bisa jadi membakar pakaianmu atau engkau mendapatkan aroma yang tidak sedap darinya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "25 Musa seketika itu berkata: “Ya Tuhanku, aku tidak mempunyai sesuatu apapun kecuali diriku sendiri dan saudaraku Harun. Sebab itu, untuk menolong agama-Mu, pisahkanlah antara kami dengan orang-orang yang fasik itu, atau orang-orang yang keluar dari ketaatan kepada-Mu”."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Musa berkata, “Ya Tuhanku, aku tidak mempunyai kekuasaan apa pun} aku tidak menentukan hukum {kecuali atas diriku sendiri dan saudaraku. Maka pisahkanlah} pisahkanlah {antara kami dan kaum yang fasik itu.”} orang-orang yang tidak menaatimu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "25. Manakala Musa melihat kebelakang mereka, dia berkata, “ Wahai Rabbku, aku tidak menguasai kecuali diriku sendiri dan sudaraku,” yakni, kami tidak berkuasa berperang melawan mereka dan aku tidak kuat menghadapi mereka, “ maka dari itu pisahkanlah di antara kami dan orang-orang yang fasik itu,” maksudnya, putuskanlah hukumanmu diantara kami, dengan Engkau turunkan kepada mereka hukuman sesuai dengan hikmahMu. Hal ini menunjukan bahwa ucapan mereka dan perbuatan mereka termasuk dosa besar yang membuat mereka menjadi fasik."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 25: Yakni kami tidak sanggup memerangi mereka hanya berdua dan kami tidak mampu memaksa mereka (umatku). Yakni \"Berikanlah keputusan antara kami dengan mereka, dengan menurunkan hukuman sesuai kebijaksanaan-Mu\". Hal ini menunjukkan bahwa perkataan dan sikap mereka termasuk dosa besar yang menjadikan mereka dihukumi sebagai orang-orang fasik."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 25",
    "description": "Mendengar penolakan dari kaumnya, dia, musa, mengadu kepada Allah dan berkata, ya tuhanku, aku hanya dapat menguasai diriku sendiri dan saudaraku, harun, dan aku tidak mampu mengajak kaumku untuk menaati perintah-Mu. Oleh karena itu, hendaknya engkau pisahkan antara kami yang selalu taat pada-Mu dengan orang-orang yang fasik yang tidak mau mendengarkan ketetapan-Mu itu. Setelah menerima pengaduan nabi musa, Allah berfirman, jika memang demikian sikap mereka, maka negeri atau daerah kana'an, yang sekarang dikenal dengan daerah gurun sinai sampai tepi sungai yordan, itu terlarang buat mereka, dan mereka tidak akan memasukinya selama empat puluh tahun. Selanjutnya, selama kurun waktu yang panjang itu, sebagai hukumannya mereka akan mengembara kebingungan, karena tidak memiliki tempat yang tetap di bumi sekitar kana'an. Maka janganlah engkau, hai musa, bersedih hati karena memikirkan nasib orangorang yang fasik itu."
  }
]