[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah berfirman kepada nabiNya,Musa ,”sesungguhnya tanah yang disucikan ini haram dimasuki oleh kaum yahudi selama empat puluh tahun. Mereka akan berjalan tak tahu arah di muka bumi dalam keadaan bingung. Maka janganlah kamu bersedih wahai Musa,terhadap kaum yang keluar dari ketaatan kepadaKu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "26. Allah berfirman kepada nabi-Nya, Musa -‘Alaihissalām-, “Sesungguhnya Allah mengharamkan orang-orang Bani Israil memasuki tanah suci selama 40 tahun. Mereka akan tersesat dan kebingungan di muka bumi tak tahu jalan pulang selama masa tersebut. Jadi, wahai Musa! janganlah kamu merasa iba terhadap orang-orang yang menentang perintah Allah. Karena hukuman yang menimpa mereka itu adalah akibat dari kedurhakaan dan dosa-dosa mereka sendiri.”"
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "26. Maka Allah menghukum Bani Israil dengan menjadikan mereka terombang-ambing di Padang Sina dan mengharamkan mereka memasuki Baitul Maqdis selama 40 tahun. Dan Allah memerintahkan kepada Nabi Musa untuk tidak berbelas kasihan terhadap mereka, karena mereka adalah orang-orang yang enggan berbuat taat dan selalu menampakkan kemaksiatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "26. قَالَ فَإِنَّهَا (Allah berfirman: “(Jika demikian), maka sesungguhnya negeri itu) Yakni tanah suci Baitulmaqdis. مُحَرَّمَةٌ عَلَيْهِمْ ۛ (iharamkan atas mereka) Yakni atas orang-orang yang bermaksiat disebabkan penolakan mereka untuk memerangi orang-orang yang gagah perkasa. أَرْبَعِينَ سَنَةً ۛ (selama empat puluh tahun) Yakni tidak lebih dari itu. Dikatakan bahwa tidak satupun diantara orang yang mengatakan “kami tidak akan memasukinya” dapat masuk ke negeri tersebut. يَتِيهُونَ فِى الْأَرْضِ ۚ (mereka akan berputar-putar kebingungan di bumi) Yakni kebingungan di suatu negeri, datang dan pergi tanpa arah. Yang dimaksud adalah negeri Sina dan Naqab, dan ketika itu Nabi Musa bersama mereka. Ibnu Abbas berkata: mereka kebingungan selama 40 tahun, sampai Musa, Harun, dan orang-orang yang berumur lebih dari 40 tahun meninggal dunia. Setelah berlalu 40 tahun Yusya bin Nun berdiri bersama mereka, dan ia adalah orang yang mengurusi Bani Israil setelah Nabi Musa, dan ia adalah orang yang menakhlukkan negeri Baitul maqdis bersama dengan generasi yang telah dibina oleh Musa dengan penuh kesungguhan dan kesabaran."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Sejenak kita mentelaah kisah angkuh, dan sikap Bani Israil terhadap Nabi Musa dan Harun, setelah perjalanan panjang, dan perjuangan yang begitu besar; kamu akn mendapati disetiap kisah mereka ada pelajaran berharga bagi setiap 'alim dan dai ataupun Imam, yaitu burhan atas keteguhan mereka di atas manhaj yang benar. 2 ). Ketika kaum Musa menolak untuk memasuki baitul maqdis! datanglah dua orang hamba Allah yang mulia ini berencana memecahkan permasalahan melalui risalah kebenaran yang mereka bawa, meskipun demikian keduanya belum mampu merubah situasi, bahkan kaum itu bersikeras untuk memberontak; sedangkan Allah senantiasa memuji keduanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "26. Allah SWT berfirman: “Sesungguhnya tanah suci itu diharamkan bagi orang-orang Bani Israil yang bermaksiat itu untuk memasukinya selama 40 tahun yang mana mereka tersesat di padang pasir, (yaitu tanah Sinai) kebingungan dan tidak mendapatkan petunjuk untuk keluar dari sana, akibat keengganan mereka untuk memerangi orang-orang Jabarin. Dan bersama mereka itu Musa dan Harun yang meninggal di gurun. Dan ketika telah berlangsung 40 tahun Yusha’ bin Nun mengurus mereka. Dia menemui generasi baru di Palestina. Maka janganlah bersedih wahai Musa atas hukuman kaum yang tidak taat kepada Allah SWT”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Allah berfirman, “Sesungguhnya itu diharamkan bagi mereka selama empat puluh tahun. Mereka akan mengembara kebingungan} mereka tersesat kebingungan {di bumi. Maka janganlah kamu bersedih} maka janganlah kamu bersedih {atas kaum yang fasik itu.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "26. “ Allah berfirman,” menjawab doa Musa, “ jika demikian maka negeri itu di haramkan atas mereka selama empat puluh tahun mereka akan berputar-putar kebingungan di bumi itu.” Maksudnya hukuman atas mereka adalah Kami haramkan masuk negeri yang telah Allah tentukan bagi mereka selama empat puluh tahun, dalam kurun waktu itu juga mereka tersesat tak tentu arah di muka bumi, tidak tahu arah dan tidak dapat ketenangan. Ini adalah hukuman dunia, mungkin Allah menghapus dosa mereka dengannya dan menolak hukuman yang lebih besar darinya. Disini terdapat dalil bahwa hukuman atas dosa, bisa berbentuk hilangnya nikmat atau tertolaknya nikmat dimana sebabnya telah ada atau ia tertunda ke waktu lain. Barangkali hikmah dari kurun tersebut adalah supaya mayoritas orang-orang yang mengucapkan perkatan tersebut mati, yaitu ucapan yang keluar dari hati yang tidak memiliki kesabaran dan keteguhan bahkan hati mereka telah terbiasa terhadap penjajahan musuh mereka, tetapi hati mereka sama sekali tidak punya keinginan untuk meningkatkan ke derajat yang membawa kepada kemuliaan dan kehormatan. Setelah mereka mati, agar muncul generasi baru di mana akal mereka telah siap untuk melawan musuh, menolak penjajahan dan penindasan yang menghalangi kebahagiaan. Manakala Allah mengetahui bahwa hambanya Musa sangat menyayangi mahkluk Allah, khususnya kaumnya, bahwa dia bisa jadi merasa iba terhadap mereka kasih sayangnya mendorongnya merasa kasihan kepada mereka dengan hukuman itu, atau mendoronganya berdo’a kepada Allah agar mengangkat hukuman itu, meskipun Allah telah memastikannya, maka Allah berfirman, “ maka jangnlah kamu bersedih hati mmemikirkan nasib orag-orang fasik itu,” artinya jangan menyesali dan jangan bersedih karena mereka telah fasik, dan kefasikan mereka itulah yng menybabkan turannya hukuman itu kepada mereka, bukan karena kami menzhalimi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 26: Hal ini termasuk hukuman duniawi, bisa jadi Allah menghapuskan kesalahan mereka dengan hukuman itu dan menghindarkan hukuman yang lebih besar dari mereka. Dalam ayat ini terdapat dalil, bahwa hukuman (di dunia) terhadap dosa bisa dengan menghilangkan nikmat yang ada atau untuk menghindarkan hukuman yang lebih besar lagi. Karena Allah mengetahui, bahwa hamba dan Rasul-Nya Musa 'alaihis salam sangat sayang kepada semua manusia, khususnya umatnya, dan karena rasa sayang tersebut menjadikan Beliau kasihan kepada umatnya terkena hukuman itu atau bahkan ada keinginan untuk dihilangkan hukuman itu, maka Allah menyuruh agar tidak bersedih terhadap mereka, karena mereka telah berbuat fasik sehingga layak dihukum, bukan berarti menzalimi mereka. Disebutkan dalam riwayat, bahwa mereka (Bani Israil) tersebut mengadakan perjalanan di muka bumi dengan bersusah payah. Saat tiba di pagi hari, mereka berada di tempat mereka mengawali perjalanan, demikian juga jika mengadakan perjalanan di siang hari, sehingga mereka binasa semuanya kecuali orang yang usianya belum mencapai dua puluh tahun. Ada yang mengatakan, bahwa jumlah mereka 600.000 orang, dan dalam keadaan seperti itu Nabi Musa 'alaihis salam dan Nabi Harun wafat, mereka memperoleh rahmat, sedangkan bagi yang lain sebagai hukuman. Menjelang wafatnya, Nabi Musa 'alaihis salam berdoa kepada Allah agar didekatkan ke tanah suci tersebut sejauh lemparan batu, maka Allah mendekatkannya sebagaimana disebutkan dalam hadits. Kemudian Yusya' diangkat menjadi nabi setelah 40 tahun mereka mengembara, dan selanjutnya Beliau memerintahkan kaumnya memerangi orang-orang yang kuat dan kejam itu, ia pun berangkat dengan sisa orang yang ada dan memerangi mereka pada hari Jum'at. Ketika itu, matahari ditahan sesaat untuk mereka sampai mereka selesai berperang. Imam Ahmad meriwayatkan dalam Musnadnya, إِنَّ الشَّمْسَ لَمْ تُحْبَسْ عَلَى بَشَرٍ إِلاَّ ِليُوْشَعَ لَيَالِي سَارَ إِلَى بَيْتِ الْمَقْدِسِ \"Sesungguhnya matahari tidaklah ditahan bagi manusia kecuali terhadap Yusya' pada malam hari saat ia berangkat perang ke Baitulmaqdis.\" Mungkin hikmah dilarangnya Baitulmaqdis bagi mereka selama 40 tahun adalah agar orang-orang yang mengucapkan kata-kata ini –yang menunjukkan keadaan hatinya yang tidak sabar- wafat, sehingga digantikan oleh generasi yang baru yang siap mengalahkan musuh, tidak suka diperbudak serta tidak suka dihinakan dan siap berjihad."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 26",
    "description": "Setelah menerima pengaduan nabi musa, Allah berfirman, jika memang demikian sikap mereka, maka negeri atau daerah kana'an, yang sekarang dikenal dengan daerah gurun sinai sampai tepi sungai yordan, itu terlarang buat mereka, dan mereka tidak akan memasukinya selama empat puluh tahun. Selanjutnya, selama kurun waktu yang panjang itu, sebagai hukumannya mereka akan mengembara kebingungan, karena tidak memiliki tempat yang tetap di bumi sekitar kana'an. Maka janganlah engkau, hai musa, bersedih hati karena memikirkan nasib orangorang yang fasik itu. Setelah Allah mengisahkan kedurhakaan bani israil, pada ayat ini diceritakan pula tentang kedengkian salah seorang putra nabi adam. Kisah ini diawali dengan perintah kepada nabi Muhammad untuk mengisahkannya. Dan ceritakanlah, wahai Muhammad, yang sebenarnya kepada mereka, yaitu kaum yahudi, tentang kisah kedua putra adam, yaitu qabil dan habil, ketika keduanya mempersembahkan kurban, maka kurban yang dipersembahkan dengan penuh keikhlasan oleh salah seorang dari mereka berdua, yaitu habil, diterima, dan dari yang lain, yaitu qabil, tidak diterima. Dia, qabil, menjadi tidak senang dengan kenyataan ini dan kemudian berkata, sungguh, aku pasti akan membunuhmu! mendengar ancaman ini, dia, habil, berkata, sesungguhnya Allah hanya menerima amal perbuatan dari orang yang bertakwa."
  }
]