[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan ceritakanlah olehmu (wahai rasul) kepada bani israil satu berita tentang dua putra Adam, qabil dan habil, dan itu merupakan berita yang benar, ketika mempersembahkan masing-masing dari mereka berdua kurban (yaitu sesuatu yang dijadikan untuk mendekatkan diri kepada Allah .) Kemudian Allah menerima kurban habil,karena dia seorang yang bertakwa, dan tidak menerima kurban dari qabil, karena sesungguhnya dia bukan seorang yang bertakwa. Karena itu, Qabil iri terhadap saudaranya, dan berkata, ”aku akan benar-benar membunuhmu”. Kemudian habil menjawab, ”sesungguhnya Allah hanya mau menerima dari orang-orang yang takut kepadaNYa.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "27. Dan ceritakanlah -wahai Rasul- kepada orang-orang Yahudi yang pendengki dan zalim itu perihal dua putra Adam, yaitu Qabil dan Habil, dengan cerita yang benar dan tidak diragukan. Yaitu tatkala keduanya mempersembahkan kurbannya masing-masing untuk mendekatkan diri kepada Allah. Kemudian Allah menerima kurban yang dipersembahkan oleh Habil, karena ia merupakan orang yang bertakwa. Tetapi Allah tidak menerima kurban yang dipersembahkan oleh Qabil, karena ia bukanlah orang yang bertakwa. Lalu Qabil memprotes diterimanya kurban yang dipersembahkan oleh Habil karena iri hati. Dan Qabil pun berkata, “Aku benar-benar akan membunuhmu, Habil!” Habil menjawab, “Sesungguhnya Allah hanya mau menerima kurban dari orang yang bertakwa kepada-Nya dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "27. Dalam kisah ini dijelaskan kejahatan pertama yang terjadi di sejarah manusia dan sebab yang mendorong terjadinya kejahatan tersebut, sehingga kisah ini layak untuk dibaca untuk diambil faedahnya. Kisah ini diawali dengan dua manusia bersaudara yang bersaing dalam mempersembahkan kurban. Salahsatunya mempersembahkan sesuatu yang paling baik yang dia miliki dengan penuh keikhlasan dan harapan agar kurbannya diterima; sedangkan saudaranya tidak bersemangat dalam bersaing sehingga dia hanya mempersembahkan sesuatu yang paling buruk yang dia miliki, kemudian dia duduk menunggu kurbannya diterima. Maka Allah menerima kurban yang dipersembahkan oleh orang yang Shalih dan tidak menerima kurban dari orang kedua. Hal ini membuatnya marah dan berkata: \"Sungguh Aku akan membunuhmu!\" Dia berterus terang menyampaikan apa yang ada dalam hatinya tanpa berpikir sebab korbannya ditolak. Namun Habil menjawabnya dengan tenang untuk memadamkan api kebencian yang membara di dalam hati saudaranya, dengan berusaha memahamkan bahwa persaingan untuk mendapatkan keridhaan Allah merupakan Medan yang luas yang cukup bagi seluruh hamba-Nya, dan pahala yang ada di sisi Allah tidak terbatas. Maka untuk apa bersempit dada dan bersedih hati, sedangkan kesempatan terbuka luas? Dan mengapa seorang hamba tidak sibuk memperbaiki dirinya, memurnikan dan mengikhlaskan niatnya, dan memperbaiki amalannya? Hai saudaraku, sesungguhnya amalan akan diterima dari orang-orang yang bertakwa, maka jadilah orang yang bertaqwa agar Allah menerima amalanmu. Penyebutan ketakwaan pada keadaan seperti ini bertujuan agar dia takut dan berhenti dari niat jahatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "27. وَاتْلُ عَلَيْهِمْ نَبَأَ ابْنَىْ ءَادَمَ (Ceritakanlah kepada mereka kisah kedua putera Adam) Nama keduanya adalah Qabil dan Habil. Dikatakan bahwa kurban yang dipersembahkan Qabil adalah seikat biji-bijian karena ia bekerja dengan bercocok tanam, ia memilih hasil terburuk dari hasil tanamnya. Adapun kurban dari Habil berupa kambing kibas karena ia adalah penggembala, ia memilih dari kambing terbaiknya. Maka Allah menerima kurban yang dipersembahkan Habil dan mengangkatnya ke surga dan tidak menerima kurban dari Qabil. Oleh sebab itu Qabil dengki terhadap saudaranya Habil, ia berkata kepadanya: Aku akan membunuhmu. Hal itu disebabkan kecemburuan dan kedengkiannya. إِنَّمَا يَتَقَبَّلُ اللهُ مِنَ الْمُتَّقِين (Sesungguhnya Allah hanya menerima (korban) dari orang-orang yang bertakwa) Seakan-akan Habil berkata kepada saudaranya: sesungguhnya kamu mendapatkan hal yang menimpamu itu adalah karena perbuatanmu sendiri. Karena sebenarnya kurbanmu tidak diterima karena kamu tidak bertakwa."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Ali bin Thalib berkata : Hndaklah kalian lebih bersemangat dalam melakukan satu amalan agar Allah menerima amalan tersebut ketimbang beramal untuk memperbanyak amalan tersebut, Allah berfirman : { إِنَّمَا يَتَقَبَّلُ اللَّهُ مِنَ الْمُتَّقِينَ } \"Sesungguhnya Allah hanya menerima (korban) dari orang-orang yang bertakwa\"."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "27. Dan ceritakanlah kepada kaummu wahai Nabi, tentang berita Qabil dan Habil sebagaimana kisah yang sebenarnya, tatkala keduanya memberikan dua qurban, yaitu sesuatu yang digunakan untuk mendekatkan diri kepada Allah berupa hewan sembelihan, sedekah dan lain-lain. Lalu Allah menerima qurban Habil yang berupa biri-biri, karena dia adalah penggembala biri-biri dan memilihkan biri-biri paling baik. Namun Allah tidak menerima qurban Qabil yang berupa seikat tanaman, karena dia seorang petani dan memilihkan tanamannya yang paling buruk. Lalu Qabil marah dengan saudaranya dan berkata dengan penuh kecemburuan dan kedengkian: “Sungguh aku akan membunuhmu” Hal itu karena Allah menerima qurban Habil. Lalu Habil berkata: “Sesungguhnya Allah menerima qurban dari orang-orang yang bertakwa yang takut kepadaNya dan menjalankan perintah-perintahNya” Seakan-akan dia berkata: “(Qurbanmu ditolak) akibat tidak adanya ketakwaan dalam dirimu”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Bacakanlah} ceritakanlah {kepada mereka berita} kabar {tentang dua putra Adam} Qabil dan Habil {dengan sebenarnya. Ketika keduanya mempersembahkan kurban, kemudian diterima dari salah satunya} Habil {dan tidak diterima dari yang lain} Qabil {Dia (Qabil) berkata, “Sungguh aku pasti akan membunuhmu.” Dia berkata} Habil {“Sesungguhnya Allah hanya menerima orang-orang yang bertakwa"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "27. Maksudnya, ceritakan dan sampaikan kepada manusia antara dua persoalan yang terjadi anatar dua anak putra Adam yang benar. Bacakan dengan benar dukan dusta, dengan sungguh-sunguh, bukan main-main, agar orang-orang yang ingin mengambil pelajaran bisa mengambil pelajaran. Zahir dari ayat ini bahwa kedua putra Adam ini adalah putra kandungnya, hal ini di tunjukan oleh Zahir dalam konteks ayat, dan ini adalah pendapat mayoritas ulama tafsir. Artinya, bacakan berita keduanya kepada mereka, pada saat keduanya mengeluarkan kurban yang membawa mereka kepada keadaan yang terjadi, “ ketika keduanya mempersembahkan kurban.” Artinya, masing-masing mengeluarkan sesuatu dari hartanya dengan tujuan mendekatkan diri kepada Allah, “ maka di terima dari salah seorang mereka berdua dan tak di terima dari yang lain.” Hal itu di ketahui dari berita langit atau kebisaan yang berlaku pada umat terdahulu bahwa tanda di terimanya kurban oleh Allah adalah turunnya api dari langit dan memakannya. “ Dia berkata,” yakni, anak yang lain yang kurbannya tidak diterima karena kedengkian dan kebencian, “ Aku pasti membunuhmu.” Lalu yang lain menjawab dengan lembut, “ Sesungguhnya Allah hanya menerima kurban dari orang yang bertakwa.” Apa dosa dan kesalahanku sehingga kamu hendak membunuhku? Hanya karena aku bertakwa kepada Allah yang merupakan kewajiban atasku, atasmu, dan atas siapapun. Dan tafsir yang paling benar tentang “ orang-orang yang bertakwa” di sini, adalah orang-orang yang bertakwa kepada Allah dalam perbuatan itu, di mana ia di niatkan ikhlas karena Allah dan mengikuti Sunnah Rasululoh."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 27: Para mufassir mengatakan, namanya Qabil dan Habil, dan menurut zhahirnya bahwa keduanya adalah anak kandung Nabi Adam 'alaihis salam. Disebutkan bahwa Habil mempersembahkan seekor kambing, sedangkan Qabil mempersembahkan tanaman. Di antara dua kurban itu, yang diterima adalah kurban Habil dengan turunnya api dari langit lalu memakan kurban itu. Hal itu menjadikan Qabil iri terhadap Habil. Bertakwa di sini adalah dengan mengerjakan amal ikhlas karena Allah dan mengikuti tuntunan-Nya melalui para nabi dan rasul."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 27",
    "description": "Setelah Allah mengisahkan kedurhakaan bani israil, pada ayat ini diceritakan pula tentang kedengkian salah seorang putra nabi adam. Kisah ini diawali dengan perintah kepada nabi Muhammad untuk mengisahkannya. Dan ceritakanlah, wahai Muhammad, yang sebenarnya kepada mereka, yaitu kaum yahudi, tentang kisah kedua putra adam, yaitu qabil dan habil, ketika keduanya mempersembahkan kurban, maka kurban yang dipersembahkan dengan penuh keikhlasan oleh salah seorang dari mereka berdua, yaitu habil, diterima, dan dari yang lain, yaitu qabil, tidak diterima. Dia, qabil, menjadi tidak senang dengan kenyataan ini dan kemudian berkata, sungguh, aku pasti akan membunuhmu! mendengar ancaman ini, dia, habil, berkata, sesungguhnya Allah hanya menerima amal perbuatan dari orang yang bertakwa. Selanjutnya habil mengatakan, sungguh, jika engkau memang benar-benar berniat untuk menggerakkan tanganmu kepadaku untuk membunuhku, maka ketahuilah bahwa aku tidak akan membalas dengan menggerakkan tanganku kepadamu untuk membunuhmu. Sesungguhnya aku sangat takut kepada murka dan ancaman Allah bila melakukan perbuatan itu. Dialah Allah, tuhan seluruh alam."
  }
]