[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Dan habil berkata untuk menasihati saudaranya, ”Apabila kamu mengacungkan tanganmu kepadaku untuk membunuhku, maka kamu tidak akan mendapati aku berbuat seperti perbuatanmu. Sesungguhnya aku takut kepada Allah, tuhan semua makhluk."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "28. Sungguh, jika kamu mengulurkan tanganmu ke arahku untuk membunuhku, aku tidak akan membalasnya. Aku bukan pengecut, tetapi aku takut kepada Allah, Rabb segenap makhluk."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "28-29. Saudara yang shalih ini terus memberikan nasehat secara perlahan-lahan dengan membangkitkan rasa persaudaraan dan memperingatkannya dari perbuatan buruk yang dia rencanakan. Dia berkata: \"Aku tidak akan membalas perbuatanmu dengan perbuatan yang serupa yang dapat membuatku terjerumus denganmu ke dalam kesalahan dan kejahatan yang sama. Sehingga aku tidak membalasmu bukan karena kelemahan dan ketidakmampuan, Namun karena aku takut kepada Allah, Tuhanku, Tuhanmu, dan Tuhan seluruh makhluk. Membunuh jiwa manusia merupakan permusuhan terhadap apa yang telah Allah ciptakan dan pelihara.\" Kemudian sampailah nasehatnya ini pada puncaknya sebagai seruannya yang terakhir, dengan harapan jiwa saudaranya yang lemah itu dapat tersadarkan dan takut terhadap kesudahan yang buruk jika tetap melakukan kejahatan itu; sebab selama saudaranya tetap ingin membunuhnya maka pembelaan diri tidak akan lagi berguna, dan biarlah orang yang berbuat kejahatan menanggung akibat kejahatannya dan memikul dosa-dosa orang yang dizaliminya sehingga membuatnya terperosok ke dalam neraka jahanam. Ini merupakan peringatan terakhir bagi saudaranya dengan harapan dia mau mengurungkan niatnya, setelah dia menjelaskan bahwa apa yang dia niatkan merupakan kezaliman, dan tempat bagi orang-orang yang zalim adalah neraka. Nasehat ini untuk menyadarkan bahwa niatnya itu menyelisihi keinginannya berupa keburukan dan kebinasaan dan untuk menuntunnya kepada niatan yang baik berupa keselamatan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "28. لَئِنۢ بَسَطتَ إِلَىَّ يَدَكَ لِتَقْتُلَنِى (Sungguh kalau kamu menggerakkan tanganmu kepadaku untuk membunuhku) Yakni jika kamu benar-benar ingin membunuhku. مَآ أَنَا۠ بِبَاسِطٍ يَدِىَ إِلَيْكَ لِأَقْتُلَكَ ۖ( aku sekali-kali tidak akan menggerakkan tanganku kepadamu untuk membunuhmu) Yakni aku tidak akan berniat membunuhmu. Penyerahan diri Habil untuk dibunuh ini sebagaimanadisebutkan dalam hadist: “jika kalian berada dalam pertikaian antara saudara maka jadilah seperti yang terbaik dari dua anak Adam”. Adapun dalam syari’at kita maka kita dibolehkan untuk membela diri sesuai Ijma para ulama. Dan membela diri adalah hal yang dianjurkan; dan terdapat perbedaan pendapat dalam masalah wajibnya membela diri, dan pendapat yang benar adalah pendapat yang mewajibkannya karena itu termasuk dalam melarang kemungkaran, dan berlandaskan firman Allah: والذين إذا أصابهم البغي هم ينتصرون “dan (bagi) orang-orang yang apabila mereka diperlakukan dengan zalim mereka membela diri”. Serta firman-Nya: ولولا دفع الله الناس بعضهم ببعض لفسدت الأرض “Seandainya Allah tidak menolak (keganasan) sebahagian umat manusia dengan sebagian yang lain pasti rusaklah bumi ini” Hukum ini adalah untuk pertikaian antar saudara seiman dan disebabkan oleh syubhat. Adapun yang bukan pertikaian antar saudara seiman dan kedua belah pihak merasa bahwa kelompoknya memerangi kelompok lainnya di jalan Allah maka dikatakan bahwa tidak membela diri lebih baik dan utama sebagaimana dalil-dalil ayat tersebut serta hadist-hadist yang sejalan dengan itu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "28. Sungguh jika kamu bermaksud membunuhku dengan zalim dan penuh kebencian, maka aku tidak akan berniat membunuhmu. Ini adalah dorongan dan pengorbanan diri agar tidak menzalimi orang lain. Sesungguhnya aku takut dengan hukuman Allah karena memusuhimu. Hal ini terjadi pada syariatnya nabi Adam, namun dalam syariat kita, maka diperbolehkan untuk melindungi diri, bahkan sebagian mereka mengharuskan untuk membela diri karena hal itu bisa mencegah kemungkaran. Dan yang paling utama ketika dalam keadaan kacau dan penuh keraguan, maka sebaiknya tidak membalas."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya jika kamu menggerakkan} menjulurkan {tangan kalian kepadaku untuk membunuhku, aku tidak akan menggerakkan} menjulurkan {tanganku kepadamu untuk membunuhmu. Sesungguhnya aku takut kepada Allah, Tuhan semesta alam"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "28. Kemudian dia (Habil) berkata kepada saudaranya, bahwa ia tidak ingin membunuhnya sebagai yang memulai dan tidak juga demi membela diri Dia berkata, “ Sungguh kalau kamu menggerakkan tanganmu kepadaku untuk membunuhku, aku sekali-kali tidak akn menggerakan tanganku kepadamu untuk membunuhmu.” Hal itu bukan karena aku takut atau karena aku tidak mampu, akan tetapi aku, “takut kepada Allah Rabb alam semesta.” Orang yang takut kepada Allah, tidaka melakukan dosa, lebih-lebih dosa besar. Ini mengandung ancaman bagi orang yang ingin membunuh, bahwa kamu harus takut dan bertakwa kepada Allah."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 28: Orang yang takut kepada Allah tentu tidak berani mengerjakan dosa-dosa, terutama dosa-dosa besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 28",
    "description": "Selanjutnya habil mengatakan, sungguh, jika engkau memang benar-benar berniat untuk menggerakkan tanganmu kepadaku untuk membunuhku, maka ketahuilah bahwa aku tidak akan membalas dengan menggerakkan tanganku kepadamu untuk membunuhmu. Sesungguhnya aku sangat takut kepada murka dan ancaman Allah bila melakukan perbuatan itu. Dialah Allah, tuhan seluruh alam. Sesudah mengungkapkan sikapnya, kemudian habil mengatakan, sesungguhnya, dengan perbuatanmu yang zalim ini, aku ingin agar engkau kelak di akhirat akan kembali dengan membawa dosa karena telah membunuh-ku dan dosamu sendiri sebagai akibat dari ketidakikhlasanmu, maka engkau kelak akan menjadi penghuni neraka yang abadi, dan itulah balasan yang ditetapkan Allah bagi orang yang zalim."
  }
]