[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya aku ingin kamu pulang dengan memikul dosa pembunuhan terhadap diriku dan dosamu yang telah menjadi tanggunganmu sebelumnya, lalu kamu menjadi penghuni neraka dan menetap didalamnya. Itulah balasan bagi orang-orang yang melampaui batas."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "29. Lantas ia (Habil) melanjutkan sambil menakutinya, \"Sesungguhnya aku menginginkan agar kamu kembali dengan membawa dosa pembunuhan terhadapku secara sengaja dan semena-mena lalu digabungkan dengan dosa-dosamu yang telah lalu, sehingga kamu termasuk penghuni Neraka yang akan masuk dan menetap di sana kelak pada hari Kiamat. Itu adalah balasan bagi orang-orang yang melampaui batas. Dan aku tidak ingin kembali dengan membawa dosa pembunuhan terhadapmu maupun menjadi penghuni Neraka.”"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "29. إِنِّىٓ أُرِيدُ أَن تَبُوٓأَ بِإِثْمِى (Sesungguhnya aku ingin agar kamu kembali dengan (membawa) dosaku) Yakni dengan dosa telah membunuhku. وَإِثْمِكَ(dan dosamu sendiri) Yakni dosa-dosamu yang telah kamu lakukan sebelum membunuhku."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "29. Sesungguhnya aku ingin kamu kembali kepada Tuhanmu dengan membawa dosa karena membunuhku dan dosamu sendiri yang menjadi sebab ditolaknya qurbanmu"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya aku ingin kembali dengan dosa} kembali dengan dosa membunuh {dan dosamu} dosamu sebelum itu {sehingga kamu akan termasuk penghuni neraka. Itulah balasan bagi orang-orang yang zalim.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "29. “ Sesungguhnya aku ingin agar kamu kembali,” yakni, pulang, “ dengan membawa dosa membunuhku dan dosamu sendiri,” maksudnya jika masalahnya hanya berkisar pada aku sebagai pembunuh atau sebagai korban, maka aku akan memilih yang kedua, agar kamu memikul dua dosa sekaligus. “ Maka kamu akan menjadi penghuni neraka dan demikian itulah pembalasan bagi orang-orang yang zhalim.” Ini menunjukan bahwa pembunuhan termasuk dosa besar dan penyebab masuk neraka."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 29: Ayat ini menunjukkan bahwa membunuh termasuk dosa yang sangat besar."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 29",
    "description": "Sesudah mengungkapkan sikapnya, kemudian habil mengatakan, sesungguhnya, dengan perbuatanmu yang zalim ini, aku ingin agar engkau kelak di akhirat akan kembali dengan membawa dosa karena telah membunuh-ku dan dosamu sendiri sebagai akibat dari ketidakikhlasanmu, maka engkau kelak akan menjadi penghuni neraka yang abadi, dan itulah balasan yang ditetapkan Allah bagi orang yang zalim. Pernyataan habil tersebut memberi pengaruh pada qabil, maka ia agak ragu untuk melakukan pembunuhan, tetapi nafsu qabil dengan kuat mendorongnya untuk membunuh saudaranya, sehingga muncullah keberaniannya dan kemudian dia pun benar-benar membunuh saudaranya itu, maka jadilah dia termasuk orang yang merugi dunia dan akhirat."
  }
]