[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Allah mengharamkan atas kalian bangkai, yaitu binatang yang telah berakhir dikehidupannya tanpa proses penyembelihan, juga mengharamkan atas kalian darah yang mengalir yang dikeluarkan, daging babi, dan binatang-binatang yang disebut nama selain Allah ketika penyembelihannya, hewan yang tercekik yang nafasnya terhenti hingga mati, juga binatang yang dipukul dengan tongkat atau batu hingga mati, juga binatang yang jatuh dari tempat yang lebih tinggi atau tercebur ke dalam sumur hingga mati, dan binatang yang dihantam oleh binatang lainnya dengan tanduknya hingga mati. Dan Allah juga mengaharamkan atas kalian binatang-binatang yang dimangsa oleh hewan-hewan buas, seperti singa, harimau, serigala, dan hewan lainnya. Dan Allah mengecualikan dari apa yang diharamkanNya dari binatang yang tercekik dan sterusnya, binatang-binatang yang sempat kalian sembelih sebelum mati, ia menjadi halal bagi kalian. Dan Allah mengharamkan atas kalian binatang-binatang yang disembelih untuk selain Allah yang ditunjukkan untuk diibadahi, seperti bebatuan dan lainnya. Dan Allah juga mengharamkan atas kalian untuk mencari tahu nasib yang ditentukan atau belum ditentukan bagi kalian dengan azlam, yaitu anak panah-anak panah yang dahulu mereka pergunakan untuk mengundi nasib, jika mereka menginginkan suatu maksud tertentu sebelum melakukannya. Hal-hal yang disebutkan dalam ayat ini dari perkara-perkara yang diharamkan, jika dilanggar, merupakan tindakan keluar dari perintah Allah dan ketaatan kepadaNya menuju maksiat kepadaNya. Hari ini telah sirna harapan besar orang-orang kafir terhadap agama kalian agar kalian meninggalkan agama kalian untuk kembali kepada kesyirikan,setelah aku menangkan kalian atas mereka. Maka janganlah kalian takut kepada mereka,tetapi takutlah hanya kepadaKu. Pada hari ini, telah kusempurnakan bagi kalian agama kalian, agama islam, dengan mewujudkan kemenangan dan kesempurnaan ajaran syariat. Dan telah kusempurnakan bagi kalian nikmat-nikmatKu dengan mengeluarkan kalian dari kegelapan-kegelapan masa jahiliyah menuju cahaya keimanan, dan Aku telah ridoi bagi kalian islam sebagai agama kalian, maka berpegang teguhlah dengan kuat, janganlah kalian melepaskannya. Barangsiapa dalam kondisi kelaparan terpaksa memakan daging bangkai, tanpa ada keinginan sengaja berbuat dosa, maka dia boleh memakannya. Sesungguhnya Allah maha pengampun lagi Maha penyayang kepadanya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "3. Allah mengharamkan bagi kalian binatang yang mati tanpa disembelih. Allah juga mengharamkan bagi kalian darah yang mengucur, daging babi, binatang yang disembelih dengan menyebut nama selain Allah, binatang yang mati karena dicekik, dipukul, jatuh dari tempat yang tinggi, ditanduk oleh binatang lain, dan binatang yang diterkam oleh binatang buas seperti singa, harimau, serigala. Kecuali bila kalian mendapati binatang-binatang tersebut masih hidup kemudian kalian menyembelihnya, maka binatang itu halal bagi kalian. Dia juga mengharamkan bagi kalian binatang yang disembelih untuk berhala. Dan Dia juga mengharamkan bagi kalian mencari tahu nasib kalian melalui beberapa batang kayu panjang, yaitu bisa dari bebatuan atau anak panah yang tertulis di sana \"Lakukan\" dan \"Jangan lakukan\" lantas tulisan mana yang keluar, maka itulah yang dikerjakan. Melakukan perbuatan-perbuatan terlarang tersebut berarti keluar dari ketaatan kepada Allah. Pada hari ini, orang-orang kafir telah putus asa untuk membuat kalian murtad maupun membuat kalian meninggalkan agama Islam tatkala mereka melihat kekuatan Islam. Maka janganlah kalian takut kepada mereka, tetapi takutlah kepada-Ku saja. Pada hari ini telah Aku sempurnakan bagi kalian agama kalian, yaitu agama Islam, dan telah Aku cukupkan bagi kalian nikmat-Ku yang lahir maupun yang batin. Dan telah Aku pilihkan agama Islam sebagai agama kalian. Maka Aku tidak akan menerima agama lain selain Islam. Barangsiapa yang kelaparan dan terpaksa memakan bangkai, tanpa ada kecenderungan untuk berbuat dosa, maka tidak ada dosa baginya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "3. Allah mengharamkan bangkai yaitu hewan yang mati tanpa disembelih; darah yang mengucur ketika proses penyembelihan yang dahulu orang-orang jahiliyah suka memasaknya, atau darah yang sengaja dipancarkan dari hewan yang masih hidup untuk dimasak; daging babi; hewan yang disembelih untuk selain Allah, seperti hewan yang disembelih untuk berhala, api, jin, atau segala sesembahan selain Allah; hewan yang mati karena tercekik, baik itu yang tercekik dengan sendirinya maupun yang sengaja dicekik; hewan yang mati karena pukulan baik itu dengan tongkat, besi, atau kayu; hewan yang mati karena terjatuh, baik itu terjatuh dari tempat yang tinggi atau terjatuh ke dalam sumur dan lain sebagainya; hewan yang mati karena tertanduk; hewan yang mati karena dimangsa hewan buas yang belum sempat disembelih; hewan yang disembelih untuk dipersembahkan bagi batu-batu sesembahan, yaitu batu-batu yang ditancapkan di sekitar berhala-berhala; hewan yang disembelih untuk memenuhi konsekuensi dari pengundian nasib dengan anak panah -yaitu anak panah yang digunakan oleh orang-orang jahiliyah untuk mengetahui nasib kebaikan atau keburukan mereka- dan ini merupakan salah satu bentuk dari perdukunan dan menebak hal yang ghaib. Semua hal ini tidak sesuai dengan syariat dan agama Allah. Para musuh-musuh Allah telah berputus asa dari memadamkan cahaya Islam setelah Allah memenangkannya, maka janganlah kalian takut terhadap mereka namun takutlah kepada Allah yang telah menyempurnakan agama bagi kita, memenuhi hidup kita dengan kenikmatan, meridhoi agama Islam bagi kita, dan memilih Islam untuk kita anut dan memilihkan Islam untuk menjadikan kita penganutnya. Ini semua merupakan rahmat dan karunia Allah kepada kita, maka wajib bagi kita untuk ridha terhadap syariat Islam, manhajnya, dan adab-adab yang ada di dalamnya. Dan barangsiapa yang terpaksa untuk memakan makanan-makanan haram ini karena kelaparan, maka tidak mengapa baginya untuk memakannya dengan kadar sekedar untuk menyambung nyawanya tanpa ada keinginan untuk memakannya secara berlebihan sehingga dia menjadi orang yang bermain-main dengan dosa dan menikmati perbuatan yang sesungguhnya haram, sebab sesungguhnya dia diperbolehkan untuk memakannya hanya karena dia dalam keadaan terjepit. Allah akan mengampuninya atas tindakan berlebih-lebihan yang dulu dia lakukan, dan ini merupakan rahmat dari Allah. Dari Thoriq bin Syihab, dia berkata: Seseorang dari kaum Yahudi berkata kepada Umar Bin Khattab: wahai Amirul Mukminin, Kalian membaca satu ayat dalam kitab kalian, yang seandainya ayat itu diturunkan kepada orang-orang Yahudi niscaya kami akan menjadikan hari diturunkannya sebagai hari raya. Umar menjawab: demi Allah, sungguh aku mengetahui pada hari apa, kapan dan di mana ayat ini diturunkan kepada Rasulullah, dan di mana Rasulullah ketika ayat ini diturunkan. Ayat ini diturunkan pada petang hari di hari Arafah yang bertepatan dengan hari Jumat, dan demi Allah ketika itu kami berada di padang Arafah dan Rasulullah sedang berdiri di Arafah. Dan alhamdulillah keduanya (hari Arafah dan hari Jumat) merupakan hari raya bagi kami. Shahih Bukhari, kitab al-magahzi, bab haji wada', no. 4145. Shahih Muslim, tafsir 2312/4, 3017/4."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "3. حُرِّمَتْ عَلَيْكُمُ الْمَيْتَةُ وَالدَّمُ وَلَحْمُ الْخِنزِيرِ وَمَآ أُهِلَّ لِغَيْرِ اللهِ بِهِۦ (Diharamkan bagimu (memakan) bangkai, darah, daging babi, (daging hewan) yang disembelih atas nama selain Allah) Tafsir dari potongan ayat ini telah disebutkan di surat al-Baqarah:173. وَالْمُنْخَنِقَةُ(yang tercekik) Yakni yang mati karena tercekik baik itu disebabkan oleh hewan itu sendiri maupun oleh manusia atau lainnya. Dahulu orang-orang jahiliyah mencekik kambing hingga mati lalu memakannya. وَالْمَوْقُوذَةُ(yang terpukul) Yakni yang dipukul dengan batu atau tongkat sampai mati tanpa disembelih. وَالْمُتَرَدِّيَةُ(yang jatuh) Yakni yang terjatuh dari tempat tinggi sampai mati. وَالنَّطِيحَةُ (yang ditanduk) Yakni yang ditanduk oleh hewan lain sampai mati tanpa sempat disembelih. وَمَآ أَكَلَ السَّبُعُ (dan diterkam binatang buas) Yakni yang dimangsa oleh hewan bertaring seperti singa, harimau, serigala, atau heina sampai mati tanpa sempat disembelih. إِلَّا مَا ذَكَّيْتُمْ(kecuali yang sempat kamu menyembelihnya) Kalimat ini kembali pada kata “yang tercekik” dan setelahnya. Yakni apabila kamu sempat menyembelih hewan-hewan yang disebutkan tadi sebelum mati. وَمَا ذُبِحَ عَلَى النُّصُبِ(dan (diharamkan bagimu) yang disembelih untuk berhala) Sebagai bentuk pengagungan bagi berhala itu. Makna (النصب) yakni berhala yang mereka tancapkan kemudian mereka sembah dan mereka sirami dengan darah sembelihan. Imam Mujahid berkata: ia adalah batu ayng berada di sekitar Makkah yang dijadikan tempat menyembelih hewan untuk sesembahan. وَأَن تَسْتَقْسِمُوا۟ بِالْأَزْلٰمِ ۚ( Dan (diharamkan juga) mengundi nasib dengan anak panah) Undian dengan anak panah dalam tradisi orang-orang Arab ada tiga; yang pertama tertulis diatasnya “lakukan”, yang kedua tertulis “jangan lakukan”, dan yang ketiga tertulis “coba lagi”. Apabila mereka ingin mengetahui nasib mereka dalam pernikahan, perjalanan, atau urusan penting, mereka memasukkan undian itu kedalam kantong, lalu mereka memasukkan tangannya untuk mengambil salah satunya; apabila yang keluar adalah yang pertama maka ia melakukan apa yang telah ia inginkan, dan apabila keluar yang kedua maka ia meninggalkan apa yang ia ingin lakukan sebelumnya, dan apabila keluar yang ketiga maka ia mengulangi undiannya sampai keluar yang pertama atau kedua. Makna (الاستقسام) adalah meminta bagian atau nasib. Allah mengharamkannya karena menjerumuskan orang untuk mengaku mengetahui hal ghaib, dan karena hal ini termasuk perdukunan. ذٰلِكُمْ فِسْقٌ ۗ( itu adalah kefasikan) Makna kefasikan adalah keluar dari ketaatan kepada Allah. الْيَوْمَ يَئِسَ الَّذِينَ كَفَرُوا۟ مِن دِينِكُمْ (Pada hari ini orang-orang kafir telah putus asa untuk (mengalahkan) agamamu) Yakni mereka dihinggapi keputusasaan dalam mengalahkan agama kalian dan mengembalikan kalian kedalam kekafiran. فَلَا تَخْشَوْهُمْ (sebab itu janganlah kamu takut kepada mereka) Yakni janganlah kalian takut mereka akan mengalahkan kalian atau menghancurkan agama kalian. الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ (Pada hari ini telah Kusempurnakan untuk kamu agamamu) Yakni menyempurnakan hukum-hukumnya yang dibutuhkan orang-orang beriman berupa halal dan haram. Ayat ini diturunkan pada saat haji wada’ ketika wukuf di padang Arafah, saat itu adalah hari Jum’at. Dan Allah telah memenangkan Islam dan menolong nabi-Nya. Allhamdulillah. وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِى (dan telah Ku-cukupkan kepadamu nikmat-Ku) Yakni dengan disempurnakan agama dan ditakhlukkannya Makkah serta dengan keputusasaan orang-orang kafir untuk mengalahkan kalian, sebagaimana yang telah Aku janjikan kepada kalian lewat firman-Ku: ولأتم نعمتي عليكم وَرَضِيتُ لَكُمُ الْإِسْلٰمَ(dan telah Ku-ridhai Islam itu) Yang mana kalian telah memeluknya hari ini. دِينًا (jadi agama bagimu) Yang kekal sampai hari akhir. فَمَنِ اضْطُرَّ فِى مَخْمَصَةٍ(Maka barang siapa terpaksa karena kelaparan) Yakni barangsiapa yang dalam keadaan darurat karena kelaparan sehingga memaksanya untuk memakan bangkai dan makanan-makanan yang diharamkan lainnya. غَيْرَ مُتَجَانِفٍ لِّإِثْمٍ ۙ (tanpa sengaja berbuat dosa) Tanpa berniat untuk bermaksiat kepada Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "1 ). Seorang Yahudi berkata kepada Umar : Wahai amirul mu'minin, jika seandainya ayat ini diturunkan kepada kami : { الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا } \"Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu\", sungguh kami akan menjadikan waktu diturunkannya ayat ini hari raya, Umar kemudian berkata : sesungguhnya aku mengetahui hari diturunkannya ayat ini, yaitu pada hari 'Arofah yang bertepatan pada hari Jum'at. Dan menjadi pertanyaan adalah : seberapa banyak dari kaum muslimin yang mengetahui seberapa berharganya hari itu seperti yang diketahui oleh Yahudi tersebut ?! 2 ). Imam Malik bin Anas berkata : Barangsiapa yang mengadakan hal baru dalam perkara agama yang belum pernah diketahui dan dikerjakan oleh para salaf, sungguh dia telah mengklaim bahwa Rasulullah telah berkhianat kepada Agama ini, karena Allah telah berfirman : { الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ } maka syari'at yang tidak pernah ada pada hari itu, tidak dapat dijadikan syari'at untuk saat ini. 3 ). Ibnu Katsir dalam tafsirnya berkata : Pada hari 'Arafah Allah menurunkan firman-Nya : { الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ الْإِسْلَامَ دِينًا } \"Pada hari ini telah Kusempurnakan untuk kamu agamamu, dan telah Ku-cukupkan kepadamu nikmat-Ku, dan telah Ku-ridhai Islam itu jadi agama bagimu\" <dan ini adalah nikmat Allah yang terbesar untuk ummat ini yaitu dengan menyempurnakan agama mereka, maka tidaklah mereka memerlukan agama selain agama Allah, dan tidak kepada Nabi selain Nabi mereka; oleh karena itu Allah menjadikan Muhamad sebagai Nabi penutup para Nabi, maka tiada sesuatu yang halal kecuali apa yang dihalalkan olehnya, dan tidak pula sesuatu yang haram kecuali apa yang diharamkan olehnya, dan tidak ada agama kecuali apa yang disya'atlannya> 4 ). Diantara mukjizat balagah dari al-Qur'an ditunjukkan oleh ayat ini : { الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي } dari kita perhatikan lafazh \"الدين\" diibaratkan dengan kata \"الكمال\" , dan lafazh \"النعمة\" diibaratkan dengan kata \"التمام\" yaitu -و الله أعلم- bahwa kata \"الكمال\" berarti sempurna yang tidak lagi ada tambahan diatasnya, maka dari itu kita mengetahui bahwa agama ini tidak bzutuh lagi dengan syari'at tambahan; karena ia telah sempurna, sedangkan kata \"التمام\"berarti cukup dan butuh tambahan untuk mencapai derajat الكمال, hal itu pun mengajarkan kita bahwa nikmat selalu berbeda dari zaman ke zaman setelahnya, maka apa yang dinikmati oleh kaum faqir saat ini belum tentu dirasakan oleh Harun ar-Rasyid di zamannya. 5 ). Dalam hadits yang diriwayatkan oleh Imam Bukhari-Muslim bahwasanya seorang Yahudi berkata kepada Umar : Jikalau sekiranya ayat ini diturunkan kepada kami, niscaya kami akan membuat satu hari raya di hari turunya ayat ini, kemudian Umar memberi tahu kapan diturunkan ayat ini. Pelajaran yang dapat kita ambil dari kisah ini adalah : bahwasanya Umar tidak menhadakan perkara baru dalam agama ini dalam bentuk hari raya untuk mengikuti perkataan Yahudi, karena Umar mengetahui bahwa hari raya dalam Islam harus berdasarkan dalil syar'i yang shahih."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "3 Diharamkan bagimu memakan daging bangkai, yaitu segala hewan yang mati tanpa disembelih secara aturan syariat. Juga jangan memakan darah, daging dari semua anggota tubuh babi, dan daging hewan yang disembelih atas nama selain Allah, yang tercekik, yang terpukul dengan kayu atau batu, yang jatuh dari tempat tinggi kemudian mati, yang ditanduk kemudian mati, dan diterkam binatang buas seperti serigala, harimau atau anjing hutan, kecuali yang sempat kamu sembelih dari yang mati karena sebab-sebab yang telah disebutkan yang masih hidup dan bergerak-gerak setelah disembelih. Dan diharamkan bagimu hewan yang disembelih untuk berhala yang dipasang para musyrik di sekitar Ka’bah, sebagai pemujaan untuk para sesembahannya. Dan diharamkan juga mengundi nasib dengan anak panah, mengundi nasib dengan anak panah yang ditaruh dalam wadah, kemudian dikeluarkan salah satu anak panah itu dan diketahuilah nasibnya. Azlam atau alat untuk mengundi nasib itu menurut orang Arab ada tiga macam, yaitu yang ditulis pada salah satu anak panah dengan tulisan: kerjakanlah, dan ditulis pada anak panah lainnya dengan: jangan lakukan, dan yang jenis ketiga dengan ditulis: jangan hiraukan, tidak ada sesuatu apapun padanya. Misal untuk mengetahui akhir dari suatu perjalanan atau pernikahan, dan untuk mengetahuinya diundi dengan Azlam. Jika yang keluar adalah jenis yang ketiga maka diulang memukul Azlam tersebut hingga keluar tulisan kerjakan atau jangan dikerjakan. Hal itu diharamkan sebab berusaha mengetahui sesuatu yang ghaib seperti peramal. Orang-orang yang telah disebutkan dalam keharaman tersebut adalah dalam kefasikan, atau di luar ketaatan kepada Allah, dan itu adalah kekufuran yang sangat besar. Pada hari ini orang-orang kafir telah putus asa untuk mengalahkan agamamu, sebab itu janganlah kamu takut kepada mereka dan takutlah kepada-Ku dan jangan melanggar perintah dan larangan-Ku. Pada hari ini telah Kusempurnakan untuk kamu agamamu tentang halal dan haram, dan telah Ku-cukupkan kepadamu nikmat-Ku dengan menyelamatkanmu dari orang-orang kafir dan telah Ku-ridhai Islam itu jadi agama bagimu. Maka barang siapa terpaksa karena kelaparan tanpa sengaja berbuat dosa dengan memakan yang diharamkan, maka tidak dianggap sebagai dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang dan tidak akan menghukumnya. Ayat ini turun ketika hari Jumat, pada hari Arafah, setelah ashar dalam situasi Haji Wada’, tahun ke-10 Hijrah. Nabi berada di atas untanya yang bernama al ghadlba’. Seorang Yahudi berkata: jika ayat ini turun kepada kami suatu hari maka pasti kami akan menjadikan hari itu sebagai hari raya. Ibnu Abbas berkata: ayat ini turun pada dua hari yang mulia, yaitu bertepatan dengan hari Jumat dan hari Arafah"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Diharamkan bagi kalian bangkai} Allah mengharamkan hewan yang mati bukan karena disembelih {darah, daging babi, dan yang disembelih bukan atas nama Allah} apa disebutkan ketika menyembelihnya adalah nama selain Allah {yang tercekik} bangkai yang mati karena tercekik {yang dipukul} bangkai yang mati karena dipukul {yang jatuh} bangkai yang mati karena jatuh dari ketinggian {yang ditanduk} bangkai yang mati karena tandukan hewan lain {dan yang diterkam binatang buas, kecuali yang (sempat) kalian sembelih} hewan yang disebutkan itu sempat disembelih {apa yang disembelih untuk berhala} diharamkan atas kalian apa yang disembelih untuk para berhala {dan mengundi nasib dengan anak panah} Diharamkan atas kalian untuk mencari tahu apa yang dinasibkan untuk kalian dengan anak panah {itu suatu perbuatan fasik} melanggar ketaatan kepada Allah {Pada hari ini orang-orang kafir telah putus asa untuk agama kalian} untuk mengalahkan agama kalian dan mengeluarkan kalian dari itu {Maka janganlah kalian takut kepada mereka, tetapi takutlah kepadaKu. Pada hari ini telah Aku sempurnakan agama kalian untuk kalian, telah Aku cukupkan nikmatKu bagi kalian, dan telah Aku ridhai} Aku pilih {Islam sebagai agama kalian. Maka siapa yang terpaksa} terpaksa {karena lapar} karena lapar {bukan karena ingin} bukan karena berkehendak {berbuat dosa, sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 3: Perlu diketahui, bahwa Allah tidaklah mengharamkan sesuatu kecuali untuk menjaga dan memelihara hamba-hamba-Nya dari bahaya yang ada dalam sesuatu yang haram itu, terkadang Allah menerangkan bahayanya dan terkadang tidak. Bangkai adalah binatang yang mati tanpa melalui penyembelihan secara syar'i. Hal ini diharamkan karena bahaya yang ada di dalamnya, yaitu ketika darah tertahan dalam tubuhnya yang menyebabkan kuman-kuman hidup subur di sana dan karena pada umumnya matinya binatang tersebut diakibatkan oleh penyakit, yang jika dikonsumsi dapat membahayakan kesehatan. Namun dikecualikan daripadanya adalah bangkai ikan dan belalang, maka hukumnya halal. Yakni darah yang mengalir, sebagaimana disebutkan dalam surat Al An'aam ayat 145. Hal ini mencakup semua anggota badannya. Disebutkan \"daging babi\" padahal ada binatang kotor lainnya yang terdiri dari binatang buas bertaring, karena Ahli Kitab menyangka bahwa daging babi dihalalkan bagi mereka, maka Allah membantahnya, dan bahwa daging babi termasuk binatang kotor. Maksudnya adalah binatang yang tercekik, yang dipukul, yang jatuh, yang ditanduk dan yang diterkam binatang buas adalah halal jika sempat disembelih sebelum mati. Jika tidak sempat disembelih, maka tergolong bangkai. Al Azlaam artinya anak panah yang belum memakai bulu. orang Arab Jahiliyah menggunakan anak panah yang belum memakai bulu untuk menentukan apakah mereka akan melakukan suatu perbuatan atau tidak. Caranya adalah mereka ambil tiga buah anak panah yang belum pakai bulu, dan ditulis masing-masingnya dengan, \"Lakukanlah\", \"Jangan lakukan\", sedangkan yang ketiga tidak ditulis apa-apa, kemudian diletakkan dalam sebuah tempat dan disimpan dalam Ka'bah. Apabila mereka hendak melakukan sesuatu, maka mereka meminta supaya juru kunci ka'bah mengambil sebuah anak panah itu. Terserah nanti apakah mereka akan melakukan atau tidak, sesuai dengan tulisan anak panah yang diambil itu. kalau yang terambil anak panah yang tidak ada tulisannya, maka undian diulang sekali lagi. Dalam ayat ini Allah mengharamkan perbuatan itu dan perbuatan yang semisal dengannya, serta menggantinya dengan syari'at shalat istikharah (meminta pilihan kepada Allah) dalam semua urusan mereka. Fasik artinya keluar dari ketaatan kepada Allah beralih kepada ketaatan kepada setan. Yang dimaksud dengan hari ini adalah hari 'Arafah pada saat haji wada' (tahun ke-10 H), haji terakhir yang dilakukan oleh Nabi Muhammad shallallahu 'alaihi wa sallam. Ketika itu orang musyrik tidak melakukan haji dan tidak berthawaf di Baitullah dengan telanjang. Atau membuat kamu murtad. Yakni dengan menyempurnakan syari'at, baik yang nampak maupun yang tersembunyi, baik terkait dengan masalah ushul (dasar-dasar agama) maupun masalah furu' (cabang). Oleh karena itu, Al Qur'an dan As Sunnah memberikan kecukupan kepada kita dalam semua hukum-hukum agama, baik ushul maupun furu', karenanya barang siapa yang menyangka bahwa untuk mengetahui akidah dan hukum butuh mempelajari ilmu kalam, maka dia jahil dan dakwaannya batil. Baik dengan disempurnakan agama maupun dengan masuk ke Mekah dalam keadaan aman. Yani terpaksa memakan makanan yang diharamkan. Ada yang mengartikan \"bukan karena ingin berbuat dosa\" di sini dengan bukan orang yang cenderung berbuat dosa, seperti qaathi'uth thariq (pembajak) dan pemberontak, oleh karenanya mereka ini meskipun darurat tetap tidak halal memakan yang haram, ada pula yang mengartikan \"bukan karena ingin berbuat dosa\" dengan tidak memakan yang haram kecuali dalam kondisi darurat dan tidak memakannya melebihi kecukupan saat dalam kondisi darurat."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 3",
    "description": "Pada ayat yang lalu telah dijelaskan beberapa perbuatan yang diharamkan. Ayat ini menguraikan lebih terperinci makanan-makanan yang diharamkan. Ada sepuluh jenis makanan yang diharamkan, semuanya berasal dari hewan. Diharamkan bagimu memakan bangkai, darah yang keluar dari tubuh, sebagaimana tersebut dalam surah alan'a'm/6: 145, daging babi, dan daging hewan yang disembelih bukan atas nama Allah, demikian pula diharamkan daging hewan yang tercekik, yang dipukul, yang jatuh, yang ditanduk, dan yang diterkam binatang buas, kecuali yang sempat kamu sembelih. Hewan yang tercekik, yang dipukul, yang jatuh, yang ditanduk, dan yang diterkam binatang buas adalah halal hukumnya kalau sempat disembelih sebelum mati. Dan diharamkan pula hewan yang disembelih untuk berhala. Dan diharamkan pula mengundi nasib dengan anak panah. Orang arab jahiliah menggunakan anak panah untuk menentukan apakah mereka akan melakukan suatu perbuatan atau tidak. Mereka mengambil tiga buah anak panah yang belum memakai bulu, masing-masing anak panah itu ditulis dengan kata-kata lakukan, jangan lakukan, dan anak panah yang ketiga tidak ditulis apa-apa. Semua anak panah itu diletakkan dalam sebuah tempat dan disimpan dalam kakbah. Bila mereka hendak melakukan suatu perbuatan, maka mereka meminta agar juru kunci kakbah mengambil salah satu dari tiga anak panah itu. Mereka melakukan perbuatan atau tidak melakukan perbuatan sesuai dengan bunyi kalimat yang tertulis dalam anak panah yang diambilnya. Kalau yang terambil anak panah yang tidak ada tulisannya, maka undian diulangi sekali lagi. Janganlah melakukan yang demikian itu karena itu suatu perbuatan fasik. Pada hari ini, yaitu pada waktu haji wada', haji terakhir yang dilakukan oleh nabi Muhammad, orang-orang kafir telah putus asa untuk mengalahkan agamamu, sebab itu janganlah kamu takut kepada mereka, tetapi takutlah kepada-ku. Pada hari ini telah aku sempurnakan agamamu untukmu, dan telah aku cukupkan nikmat-ku bagimu, dan telah aku ridai islam sebagai agamamu. Tetapi barang siapa dalam keadaan terpaksa, dibolehkan memakan makanan yang diharamkan oleh ayat ini karena lapar, bukan karena ingin berbuat dosa, maka sungguh, Allah maha pengampun, maha penyayang. Setelah ayat yang lalu menjelaskan makanan-makanan yang diharamkan, ayat ini menerangkan makanan-makanan yang dihalalkan. Mereka bertanya kepadamu, wahai nabi Muhammad, apakah yang dihalalkan bagi mereka. Katakanlah, yang dihalalkan bagimu adalah makanan yang baik-baik, yang sesuai dengan selera kamu selama tidak ada tuntunan agama yang melarangnya, dan buruan yang ditangkap oleh binatang pemburu, seperti anjing, singa, harimau, burung yang telah kamu latih untuk berburu, binatang yang kamu latih menurut apa yang telah diajarkan Allah kepadamu. Maka makanlah apa yang ditangkapnya untukmu, bukan untuk dimakan binatang pemburu itu, dan sebutlah nama Allah, sewaktu kamu melepas binatang pemburu itu. Dan bertakwalah kepada Allah, sungguh, Allah sangat cepat perhitungan-Nya."
  }
]