[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Hawa nafsu Qabil memperindah pandangannya untuk melakukan tindakan membunuh saudaranya, lalu dia benar-benar membunuhnya, sehingga ia termasuk orang-orang yang merugi, yang telah menjual akhirat mereka dengan kehidupan dunia mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "30. Kemudian Qabil digoda oleh nafsu amarahnya untuk membunuh saudaranya, Habil, secara semena-mena. Lalu Qabil benar-benar membunuhnya. Maka Qabil pun termasuk orang-orang yang merugi di dunia dan di akhirat."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "30. Saudara yang sholeh ini telah mengerahkan seluruh usahanya untuk menasehati saudaranya agar membatalkan niatnya dan menjauhkannya dari kejahatan. Namun Apakah saudara yang keras hati ini mau Mendengarkan nasehat saudaranya? Bagaimana mungkin, sedangkan jiwanya yang telah dipenuhi dengan kedengkian telah menghiasi niatan buruk itu dan telah bersiap untuk menyerang saudaranya yang soleh dengan penuh keberingasan. Perbuatan buruk seperti itu tidak akan dianggap remeh kecuali oleh jiwa yang durhaka, sehingga ia hanya akan mendapatkan kerugian. Dan Adakah kerugian yang lebih besar daripada membunuh jiwa yang tak bersalah demi memenuhi hawa nafsu dan memuaskan hati yang dipenuhi dengan kebencian dan kedengkian? Dan Adakah kerugian yang lebih besar daripada harus menanggung bagian dari dosa seluruh kejahatan tindak pembunuhan yang ada di bumi, dan dijauhkan jadi ketenangan hidup dan selalu dihantui rasa penyesalan?!"
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "30. فَطَوَّعَتْ لَهُۥ نَفْسُهُۥ قَتْلَ أَخِيهِ (Maka hawa nafsu Qabil menjadikannya menganggap mudah membunuh saudaranya) Yakni hawa nafsunya mempermudah dan mendorongnya melakukan perbuatan itu, serta memberinya gambaran bahwa membunuh saudaranya dengan kedua tangannya cukup mudah dan itu merupakan kehormatan baginya."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "30-31 1 ). Pelajaran berharga dari dua ayat ini adalah : - Dalil awal mula peradaban manusia di muka bumi, yaitu ketika Qabil berusaha menyembunyikan perkara buruk yang telah berlaku karenanya. - Awal mula manusia mengambil ilmu dengan cara taqlid dan percobaan. - Dan bukti awal mula manusia mengambil ilmu dari makhluk yang lebih lemah darinya, sebagaimana manusia diperumpamakan seperti hewan ketika disebabkan oleh zina. 2 ). { فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ } \"sebab itu dibunuhnyalah, maka jadilah ia seorang diantara orang-orang yang merugi\", { فَعَقَرُوهَا فَأَصْبَحُوا نَادِمِينَ } \"Kemudian mereka membunuhnya, lalu mereka menjadi menyesa\" [asy-syu'ara' : 157] , tidak ada pembatas antara dorongannya melakukan kejahatan itu, dan kerugian dan penyesalan yang mendalam dalam dirinya, kecuali hanya beberapa saat yang ia perlukan untuk melakukan kejahatannya, sungguh penyesalan yang panjang bagi orang-orang yang tergesa-gesa! 3 ). { فَأَصْبَحَ مِنَ النَّادِمِينَ } \"Karena itu jadilah dia seorang diantara orang-orang yang menyesal\" , bahkan jika ia berusaha menyembunyikan jejak kekejin itu, tetapi banyang-banyang kejahatan itu akan menjadi menghancurkannya, dan bisikan perbuatan ingkar itu akan terus berbaring dibenaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "30. Lalu hawa nafsunya menggoda dan memudahkannya untuk membunuh saudaranya, Habil. Lalu dia membunuh Habil dengan zalim dan penuh kedengkian, dan dia termasuk orang-orang yang merugi di akhirat karena telah membunuh saudaranya sehingga dia akan disiksa dengan separuh siksaan (seluruh) penghuni neraka dan dengan separuh siksaan lainnya sebab dia menanggung kejahatan pembunuhan yang terjadi pada manusia, karena dialah orang pertama yang melakukan pembunuhan"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian hawa nafsunya mendorongnya} mebujuk dan menggodanya {untuk membunuh saudaranya. Lalu dia pun membunuhnya sehingga dia termasuk orang-orang yang rugi"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "30. Ucapan itu tidak berhasil menyadarkan dan membuat takut calon pelaku pembunuhan yang kriminal itu, dia masih berminat dan berkesan bulat sehingga hawa nafsunya menyeretnya untuk membunuh saudaranya yang menurut pertimbangan syara’ dan tabia’t seharusnya di hormati. “ Maka dia membunuhnya, maka jadilah ia seorang di antara orang-orang yang merugi,” merugi dunia dan akhirat, dan dia telah membuat contoh membunuh ini bagi setiap pembunuh. Dan barang siapa yang memulai dengan Sunnah yang buruk, maka dia memikul dosanya dan dosa orang yang melakukannya sampai Hari Kiamat. Oleh karena itu dalam hadist sahih Nabi bersabda, “ Tiada satu jiwapun yang di bunuh kecuali anak Adam yang pertama (Qabil) menanggung bagian dosa, karena ia adalah orang yang pertama kali membuat contoh pembunuhan.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 30: Dan ia menjadi contoh pertama yang melakukan pembunuhan, dan barang siapa yang mencontohkan keburukan, maka dia menanggung dosa itu dan menanggung dosa orang-orang yang mengikutinya. Oleh karena itu, Rasulullah shallallahu 'alaihi wa sallam bersabda: « لاَ تُقْتَلُ نَفْسٌ ظُلْماً إِلاَّ كَانَ عَلَى ابْنِ آدَمَ الأَوَّلِ كِفْلٌ مِنْ دَمِهَا ، لأَنَّهُ أَوَّلُ مَنْ سَنَّ الْقَتْلَ » . \"Tidaklah seorang jiwa dibunuh secara zalim, kecuali anak Adam yang pertama (Qabil) ikut menanggung darahnya, karena ia adalah orang yang pertama mencontohkan pembunuhan.\" (HR. Bukhari) Di dunia dan akhirat karena membunuhnya. Di samping itu, ia juga tidak mengetahui tindakan apa yang harus dilakukan terhadap mayat saudaranya, karena ia merupakan mayat pertama di muka bumi, lalu dibawalah mayatnya di atas punggungnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 30",
    "description": "Pernyataan habil tersebut memberi pengaruh pada qabil, maka ia agak ragu untuk melakukan pembunuhan, tetapi nafsu qabil dengan kuat mendorongnya untuk membunuh saudaranya, sehingga muncullah keberaniannya dan kemudian dia pun benar-benar membunuh saudaranya itu, maka jadilah dia termasuk orang yang merugi dunia dan akhiratsesudah melakukan pembunuhan, qabil tidak tahu apa yang harus diperbuat dengan mayat saudaranya, karena peristiwa ini merupakan yang pertama terjadi. Kemudian Allah mengutus seekor burung gagak yang menggali tanah dengan menggunakan cakarnya untuk diperlihatkan kepadanya, qabil, bagaimana dia seharusnya menguburkan mayat saudaranya yang baru saja dibunuhnya. Melihat peristiwa itu, qabil berkata, oh, celaka aku! mengapa aku tidak berpikir dan mampu berbuat seperti yang dilakukan burung gagak ini, sehingga dengan cara itu aku dapat menguburkan mayat saudaraku ini' maka ia menggali tanah untuk menguburkan mayat habil, dan jadilah dia termasuk orang yang sangat menyesal atas perbuatan yang telah dilakukannya."
  }
]