[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "31 Setelah Qabil membunuh saudaranya, ia belumlah tahu tindakan yang harus ia perbuat dengan jasadnya. Kemudian Allah mengirimkan seekor burung gagak yang mengagali-gali lubang di tanah untuk mengubur burung gagak yang telah mati di dalamnya, untuk menunjukan kepada qabil bagaimana mengubur jasad saudaranya. Lalu Qabil kaget dan berkata, ”apakah aku tidak mampu melakukan seperti yang diperbuat oleh gagak itu, sehingga aku dapat menutup aurat saudaraku?\" kemudian diapun mengubur saudaranya, lalu Allah menghukumya dengan penyesalan setelah sebelumnya dia kembali dengan memikul kerugian."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "31. Lalu Allah mengutus seekor burung gagak menggali tanah untuk mengubur burung gagak lain yang mati di hadapan Qabil. Allah bermaksud mengajarkan kepada Qabil tentang bagaimana cara mengubur jasad saudaranya, Habil. Dan ia pun termasuk orang-orang yang menyesal."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "31. Setelah dia melakukan kejahatan itu, dia merasakan kebingungan yang tidak terlalu lama, karena Allah mengutus kepadanya makhluk yang memberinya petunjuk apa yang harus dilakukan. seekor burung gagak hinggap di tanah dan mulai menggali; dari sini dia mulai memahami isyarat yang diberikan dan mengetahui apa yang harus dilakukan. Dia mulai kecewa terhadap dirinya karena sebelumnya tidak mampu mengurus jenazah saudaranya dan merasakan penyesalan atas apa yang telah diperbuatnya."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "31. فَبَعَثَ اللهُ غُرَابًا يَبْحَثُ فِى الْأَرْضِ لِيُرِيَهُۥ كَيْفَ يُوٰرِى سَوْءَةَ أَخِيهِ ۚ (Kemudian Allah menyuruh seekor burung gagak menggali-gali di bumi untuk memperlihatkan kepadanya (Qabil) bagaimana seharusnya menguburkan mayat saudaranya) Saat ia telah membunuhnya ia tidak tahu bagaimana menguburnya karena ia adalah mayat pertama dari bani Adam. Maka Allah mengutus dua ekor burung gagak yang bersaudara lalu saling membunuh, lalu salah satunya berhasil membunuh saudaranya, maka ia menggali lubang untuknya kemudian menguburnya. قَالَ يٰوَيْلَتَىٰٓ( Berkata Qabil: “Aduhai celaka aku) Ini adalah kalimat penyesalan dan kesedihan. Yakni celaka dan binasalah aku! Ibnu Mas’ud berkata: Rasulullah bersabda: “tidaklah terbunuh seseorang atas dasar kezaliman kecuali anak Adam yang pertama mendapat bagian dosa atas tumpahnya darah tersebut, karena ialah yang memulai pembunuhan pertama kali”. فَأُوٰرِىَ سَوْءَةَ أَخِى ۖ( lalu aku dapat menutup aurat saudaraku ini) Yakni mayatnya. Yang ia tutupi dengan menguburnya dalam tanah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "30-31 1 ). Pelajaran berharga dari dua ayat ini adalah : - Dalil awal mula peradaban manusia di muka bumi, yaitu ketika Qabil berusaha menyembunyikan perkara buruk yang telah berlaku karenanya. - Awal mula manusia mengambil ilmu dengan cara taqlid dan percobaan. - Dan bukti awal mula manusia mengambil ilmu dari makhluk yang lebih lemah darinya, sebagaimana manusia diperumpamakan seperti hewan ketika disebabkan oleh zina. 2 ). { فَقَتَلَهُ فَأَصْبَحَ مِنَ الْخَاسِرِينَ } \"sebab itu dibunuhnyalah, maka jadilah ia seorang diantara orang-orang yang merugi\", { فَعَقَرُوهَا فَأَصْبَحُوا نَادِمِينَ } \"Kemudian mereka membunuhnya, lalu mereka menjadi menyesa\" [asy-syu'ara' : 157] , tidak ada pembatas antara dorongannya melakukan kejahatan itu, dan kerugian dan penyesalan yang mendalam dalam dirinya, kecuali hanya beberapa saat yang ia perlukan untuk melakukan kejahatannya, sungguh penyesalan yang panjang bagi orang-orang yang tergesa-gesa! 3 ). { فَأَصْبَحَ مِنَ النَّادِمِينَ } \"Karena itu jadilah dia seorang diantara orang-orang yang menyesal\" , bahkan jika ia berusaha menyembunyikan jejak kekejin itu, tetapi banyang-banyang kejahatan itu akan menjadi menghancurkannya, dan bisikan perbuatan ingkar itu akan terus berbaring dibenaknya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "31. Qabil bingung akan melakukan apa terhadap tubuh saudaranya, dan bagaimana dia akan menyembunyikannya, karena Habil merupakan mayat pertama dari anak Adam. Lalu Allah mengutus dua burung gagak yang saling membunuh. Salah satu gagak itu membunuh gagak lainnya, lalu dia membuat lubang dan menimbunnya dengan tanah, supaya Allah bisa mengajarkan (Qabil) bagaimana dia menutupi tubuh saudaranya yang mana dia akan disakiti jika orang-orang melihatnya. Lalu Qabil berkata: “Celakalah aku (Itu adalah pengakuan ketika ditimpa sesuatu yang menyakitkan) mengapa aku tidak bisa melakukan sesuatu seperti gagak ini. Aku akan menguburkan tubuh saudaraku” Lalu dia menguburnya dalam tanah dan menyesal karena telah membunuhnya"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kemudian Allah mengirim} mengutus {seekor burung gagak untuk menggali} menggali {tanah supaya Dia bisa memperlihatkan kepadanya bagaimana cara mengubur} menutupi {mayat} jasad {saudaranya. Dia berkata, “Celakalah aku! Mengapa aku tidak mampu berbuat seperti burung gagak ini sehingga aku dapat mengubur} menutup {mayat saudaraku} jasad saudaraku {Maka jadilah dia termasuk orang-orang yang menyesal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "31. Manakala dia membunuh saudaranya dan tidak tahu apa yang harus dilakukan kepadanya, karena dia adalah mayit pertama dari anak Adam, “maka Allah menyuruh seekor burung gagak menggali-gali di bumi.” Artinya, membuat liang untuk mengubur gagak yang mati lainnya, “untuk memperlihatkan kepadanya,” dengan perbuatannya itu, “bagaimana seharusnya dia mengubur aurat (mayat) saudaranya,” yaitu, tubuhnya, karena tubuh mayit adalah aurat. “Karena itu jadilah dia seseorang di antara orang-orang yang menyesal.” Begitulah akibat dari dosa dan kemaksiatan yaitu penyesalan dan kerugian."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 31: Untuk menguburkan burung gagak yang lain yang mati. Dari ayat ini dapat dipahami, bahwa manusia banyak pula mengambil pelajaran dari alam dan agar ia tidak segan-segan mengambil pelajaran dari yang lebih rendah tingkatan pengetahuannya. Inilah akibat kemaksiatan, yaitu kerugian dan penyesalan."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 31",
    "description": "Sesudah melakukan pembunuhan, qabil tidak tahu apa yang harus diperbuat dengan mayat saudaranya, karena peristiwa ini merupakan yang pertama terjadi. Kemudian Allah mengutus seekor burung gagak yang menggali tanah dengan menggunakan cakarnya untuk diperlihatkan kepadanya, qabil, bagaimana dia seharusnya menguburkan mayat saudaranya yang baru saja dibunuhnya. Melihat peristiwa itu, qabil berkata, oh, celaka aku! mengapa aku tidak berpikir dan mampu berbuat seperti yang dilakukan burung gagak ini, sehingga dengan cara itu aku dapat menguburkan mayat saudaraku ini' maka ia menggali tanah untuk menguburkan mayat habil, dan jadilah dia termasuk orang yang sangat menyesal atas perbuatan yang telah dilakukannya. Pembunuhan yang dilakukan qabil ini ternyata berdampak panjang bagi kehidupan manusia. Oleh karena itu, kemudian kami tetapkan suatu hukum bagi bani israil, dan juga bagi seluruh masyarakat manusia, bahwa barang siapa membunuh seseorang tanpa alasan yang dapat dibenarkan, dan bukan pula karena orang itu membunuh orang lain, atau bukan karena berbuat kerusakan di bumi, maka dengan perbuatannya itu seakan-akan dia telah membunuh semua manusia, karena telah mendorong manusia lain untuk saling membunuh. Sebaliknya, barang siapa yang siap untuk memelihara dan menyelamatkan kehidupan seorang manusia, maka seakan-akan, dengan perilakunya itu, dia telah memelihara kehidupan semua manusia. Sesungguhnya, untuk menjelaskan ketetapan ini, rasul kami telah datang kepada mereka dengan membawa keterangan-keterangan yang jelas untuk mereka dan juga semua manusia sesudahnya. Tetapi kemudian banyak di antara manusia yang tidak memperhatikan dan melaksanakannya, sehingga mereka setelah itu bersikap melampaui batas dan melakukan kerusakan di bumi dengan pembunuhan-pembunuhan yang dilakukannya."
  }
]