[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Disebabkan tindak kriminal pembunuhan tersebut, kami mensyariatkan kepada bani israil bahwa siapa saja yang membunuh seorang manusia, tanpa sebab yang dibenarkan seperti tuntutan qishash, membuat kerusakan di muka bumi dengan berbagai jenis kerusakan yang menuntut penjatuhan vonis bunuh, seperti kesyrikan dan muharabah (tindakan memerangi Allah dan RasulNya), maka seakan-akan dia membunuh manusia semuanya terkait dampak hukumnya yang memaksa datangnya hukuman berat dari Allah. Dan bahwasannya orang yang menahan diri dari membunuh jiwa yang Allah haramkan, maka seakan-akan dia telah menghidupkan manusia semuanya. Maka menjaga kehormatan jiwa satu orang sama dengan menjaga kehormatan jiwa semuanya. Dan sesungguhnya telah datang kepada bani israil rasul-rasul kami dengan membawa hujjah-hujjah dan dalil-dalil yang menunjukan kebenaran apa yang mereka dakwahkan kepadanya untuk beriman kepada tuhan mereka dan menjalankan ajaran yang diwajibkan kepada mereka. Kemudian kebanyakan orang dari mereka setelah kedatangan para rasul kepada mereka, benar-benar berbuat melampaui batas-batas yang ditentukan Allah dengan melakukan larangan-larangan Allah dan meninggalkan perintah-perintahNya."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "32. Karena Qabil telah membunuh saudaranya, Habil, maka Kami beritahukan kepada Bani Israil, bahwasanya orang yang membunuh seseorang tanpa alasan yang dibenarkan, seperti kisas (membunuh atau melukai orang lain), membuat kerusakan di muka bumi dengan melakukan kekafiran, atau melakukan perampokan, maka seolah-olah ia telah membunuh seluruh umat manusia. Karena baginya tidak ada bedanya antara orang yang tidak bersalah dan pelaku kejahatan. Sedangkan seseorang yang tidak membunuh orang lain yang Allah -Ta'ālā- haramkan, dan berkeyakinan bahwa orang tersebut haram dibunuh, maka seolah-olah dia telah menghidupkan seluruh umat manusia. Karena sikapnya tersebut menjamin keselamatan seluruh umat manusia. Dan rasul-rasul Kami telah datang kepada orang-orang Bani Israil dengan membawa hujah-hujah yang jelas dan bukti-bukti yang nyata. Namun demikian banyak dari mereka yang melanggar aturan-aturan Allah dengan melakukan perbuatan-perbuatan maksiat dan melawan perintah rasul-rasul mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "32. Karena besarnya kejahatan menumpahkan darah orang yang tidak bersalah maka Allah mewajibkan kepada Bani Israil melalui kitab-kitab-Nya dan lisan para rasul-Nya, bahwa barangsiapa yang membunuh orang yang tidak berhak untuk dibunuh -yaitu yang tidak membunuh orang lain atau berbuat kerusakan di muka bumi-, maka seakan-akan dengan kejahatannya itu dia telah membunuh seluruh manusia. Sehingga membunuh satu orang sama dengan membunuh seluruh bangsa; dan orang yang menyelamatkan satu orang sama dengan menyelamatkan seluruh manusia, seperti orang yang menyelamatkan orang yang tenggelam atau terbakar, dokter yang mengobati orang sakit, polisi yang menghentikan kejahatan sebelum terjadi, hakim yang menghukum mati orang yang membunuh, dan semua orang yang mempunyai peran dalam menyelamatkan orang lain. Allah telah mengutus rasul-rasul-Nya kepada Bani Israil dengan hujjah-hujjah yang kuat dan syariat-syariat yang lurus, namun kebanyakan mereka tetap melakukan kefasikan dan kerusakan di muka bumi dengan pertumpahan darah, penodaan kehormatan, dan perampasan harta orang lain."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "32. مِنْ أَجْلِ ذٰلِكَ (Oleh karena itu ) Yakni kisah dua anak Adam ini merupakan sebab ditetapkannya hukum yang disebutkan dalam ayat ini bagi bani Israil. Allah mengkhususkan bagi bani Israil karena mereka adalah umat pertama yang mendapat ancaman keras dalam masalah pembunuhan, dan karena banyak sekali menumpahkan darah, serta karena mereka membunuh para nabi. بِغَيْرِ نَفْسٍ (bukan karena orang itu (membunuh) orang lain) Yakni bukan karena orang tersebut wajib dijatuhi hukuman qishash. أَوْ فَسَادٍ فِى الْأَرْضِ (atau bukan karena membuat kerusakan dimuka bumi) Yakni berbuat kesyirikan. Pendapat lain mengatakan yakni melakukan pembegalan, menumpahkan darah, melanggar kehormatan, penjambretan, menzalimi orang lain tanpa alasan, merobohkan bangunan, menebang pohon-pohon, dan mengeringkan sungai. فَكَأَنَّمَا قَتَلَ النَّاسَ جَمِيعًا (maka seakan-akan dia telah membunuh manusia seluruhnya) Mujahid berkata: bahwa orang yang membunuh orang Islam dengan sengaja maka Allah akan membalasnya dengan neraka Jahannam, kemurkaan, laknat, dan azab yang besar. Dan jika ia membunuh manusia seluruhnya maka balasannya pun seperti itu, tidak lebih. وَمَنْ أَحْيَاهَا(Dan barangsiapa yang memelihara kehidupan seorang manusia) Yakni yang memaafkan orang yang berhak dibunuh. Mujahid berkata: memelihara kehidupannya adalah dengan menyelamatkan seseorang dari tenggelam, kebakaran, bangunan runtuh, atau mara bahaya. فَكَأَنَّمَآ أَحْيَا النَّاسَ جَمِيعًا ۚ( maka seolah-olah dia telah memelihara kehidupan manusia semuanya) Yakni wajib bagi semua orang untuk berterima kasih kepadanya. Pendapat lain mengatakan, seakan-akan ia mendapatkan pahala menyelamatkan seluruh manusia. ثُمَّ إِنَّ كَثِيرًا مِّنْهُم بَعْدَ ذٰلِكَ فِى الْأَرْضِ لَمُسْرِفُونَ (kemudian banyak diantara mereka sesudah itu sungguh-sungguh melampaui batas dalam berbuat kerusakan dimuka bumi) Yakni meskipun bani Israil telah mendapat ancaman yang berat yang telah ditetapkan atas mereka, namun masih banyak dari mereka yang menzalimi diri mereka dengan melakukan pembunuhan yang dilarang dan perusakan di muka bumi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "32. Karena terjadinya permusuhan ini, Kami menetapkan atas Bani Israil atau seluruh manusia bahwa membunuh manusia dengan kesengajaan dan penuh kebencian, bukan karena korban itu membunuh orang lain, maka pelaku harus diqishash, atau pembunuhan itu dilakukan bukan karena korban melakukan kerusakan di bumi seperti memotong jalan (merampok) dan mengalirkan darah secara zalim, maka seakan-akan dia telah membunuh seluruh manusia, sehingga neraka Jahannam, kebencian dan laknat Allah itu layak baginya. Dan barangsiapa menyelamatkan jiwa dari bencana tenggelam, kebakaran, kehancuran, dan mengampuni orang yang seharusnya dibunuh, maka seakan-akan dia dia itu menyelamatkan hidup seluruh manusia dari kehancuran, sehingga dia layak menerima rasa terima kasih kalian. Dan sungguh telah datang kepada mereka para utusan Kami dengan membawa keterangan syariat dan hukum, namun kebanyakan Bani Israil setelah itu tetap berlaku boros di bumi dengan melakukan kemaksiatan dan menentang perintah Allah, serta membunuh para nabi."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Untuk itu} untuk membalas pembunuhan Qabil terhadap saudaranya secara zalim {Kami menetapkan} Kami menentukan {bagi Bani Israil bahwa siapa yang membunuh seseorang bukan karena telah membunuh orang lain} bukan pembunuhan orang yang wajib diberlakukan hukum qisas {atau karena telah berbuat kerusakan di bumi, maka seakan-akan dia telah membunuh semua manusia. Siapa yang memelihara kehidupan seorang manusia, dia seakan-akan telah memelihara kehidupan semua manusia. Sungguh rasul-rasul Kami benar-benar telah datang kepada mereka dengan keterangan-keterangan yang nyata} dalil-dalil yang jelas {Kemudian sesungguhnya banyak di antara mereka setelah itu melampaui batas di bumi} melampaui batas-batas Allah"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "32. Allah berfirman, “Oleh karena itu,” yaitu, yang Kami sebutkan tentang kisah kedua putra Adam, pembunuhan salah seorang dari keduanya terhadap yang lain, dan dia memulai contoh pembunuhan bagi orang yang datang sesudahnya, dan bahwa akibat pembunuhan adalah buruk dan merupakan kerugian di dunia dan akhirat, “Kami tetapkan suatu hukum bagi Bani Israil,” yaitu kaum yang menerima kitab-kitab langit, “Bahwa barangsiapa yang membunuh seorang manusia, bukan karena orang itu (membunuh) orang lain atau bukan karena membuat kerusakan di muka bumi,” yakni tanpa alasan yang benar, “maka seakan-akan dia telah membunuh manusia seluruhnya.” Karena dia tidak memiliki penyeru yang mengajaknya kepada pembedaan bahwa dia tidak melakukan pembunuhan kecuali dengan kebenaran. Manakala dia berani membunuh jiwa yang tidak berhak untuk dibunuh, maka jelaslah bahwa menurutnya tidak ada perbedaan antara yang dibunuh ini dengan yang lainnya. Hal itu hanya didorong oleh ajakan hawa nafsunya yang menyeru kepada perbuatan buruk; karena keberaniannya membunuh, maka seolah-olah dia membunuh seluruh manusia. Begitu pula orang yang menghidupkan satu jiwa, artinya, membiarkannya dan tidak membunuhnya walaupun di dalam dirinya terdapat dorongan untuk melakukan itu, akan tetapi rasa takutnya kepada Allah menghalang-halanginya melakukannya, maka dia itu seperti menghidupkan seluruh manusia karena rasa takutnya kepada Allah menghalanginya membunuh orang yang tidak berhak dibunuh. Ayat ini menunjukkan bahwa membunuh dibolehkan dalam satu dari dua kondisi: Pertama: membunuh orang yang membunuh satu jiwa tanpa alasan yang benar dan dilakukan dengan sengaja. Orang ini halal untuk dibunuh jika dia mukallaf, setara, dan bukan wali dari korban. Kedua: membunuh pembuat kerusakan di muka bumi dengan merusak agama, badan dan harta manusia seperti orang-orang kafir yang murtad, orang-orang yang memerangi, para penyeru kepada bid’ah di mana kejahatan mereka tidak bisa dihadang kecuali dengan membunuh mereka. Begitu pula para pembegal dan orang-orang yang seperti mereka yang menyerang orang-orang untuk mengambil harta mereka atau membunuh mereka. “Dan sungguh telah datang kepada mereka rasul-rasul Kami dengan membawa keterangan-keterangan yang jelas,” yang tidak menyisakan alasan lagi bagi siapa pun. “Kemudian banyak di antara mereka,” yakni manusia, “sesudah itu,” yaitu penjelasan yang pasti untuk menjadi hujjah yang menuntut sikap lurus dimuka bumi, “sungguh-sungguh telah melampaui batas,” dengan melakukan kemaksiatan dan penyelisihan terhadap rasul-rasul yang diutus dengan membawa hujjah-hujjah dan keterangan-keterangan yang jelas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 32: Yakni oleh karena tindakan pembunuhan itu. Hukum ini bukanlah ditetapkan kepada Bani Israil saja, tetapi ditetapkan untuk semua manusia. Yakni membunuh orang bukan karena qishas. Seperti murtad, zina setelah menikah, membajak jalan (qath'uth thariq) dsb. Ayat ini menunjukkan bahwa membunuh hanyalah dibolehkan dalam dua keadaan: Pertama, karena seseorang membunuh satu jiwa tanpa alasan yang benar dan dengan sengaja, maka pembunuhnya halal dibunuh, jika si pembunuh sudah mukallaf (baligh dan berakal) dan bukan sebagai bapak bagi si terbunuh. Kedua, karena mengadakan kerusakan di bumi, misalnya merusak agama, menyakiti badan manusia atau hartanya, seperti orang murtad dan pembajak. Allah memandang bahwa membunuh seseorang seperti membunuh manusia seluruhnya, karena seseorang adalah anggota masyarakat dan karena membunuh seseorang berarti membunuh juga keturunannya. Demikian juga karena membunuh tanpa alasan yang dibenarkan menunjukkan bahwa ia tidak membedakan antara orang yang dibunuh itu dengan orang yang lainnya yang tidak bersalah, dan menunjukkan tindakan yang dilakukannya didorong oleh hawa nafsunya yang menyuruh kepada keburukan, oleh karenanya ketika ia membunuhnya sama saja ia membunuh manusia semuanya, wallahu a'lam. Dengan tidak membunuhnya. Yakni mukjizat yang membuat manusia tidak memiliki alas an untuk menolaknya. Yakni setelah kedatangan rasul membawa keterangan yang nyata. Tetap melakukan kemaksiatan dan menyelisihi rasul, baik dengan melakukan kekufuran, pembunuhan dan kemaksiatan lainnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 32",
    "description": "Pembunuhan yang dilakukan qabil ini ternyata berdampak panjang bagi kehidupan manusia. Oleh karena itu, kemudian kami tetapkan suatu hukum bagi bani israil, dan juga bagi seluruh masyarakat manusia, bahwa barang siapa membunuh seseorang tanpa alasan yang dapat dibenarkan, dan bukan pula karena orang itu membunuh orang lain, atau bukan karena berbuat kerusakan di bumi, maka dengan perbuatannya itu seakan-akan dia telah membunuh semua manusia, karena telah mendorong manusia lain untuk saling membunuh. Sebaliknya, barang siapa yang siap untuk memelihara dan menyelamatkan kehidupan seorang manusia, maka seakan-akan, dengan perilakunya itu, dia telah memelihara kehidupan semua manusia. Sesungguhnya, untuk menjelaskan ketetapan ini, rasul kami telah datang kepada mereka dengan membawa keterangan-keterangan yang jelas untuk mereka dan juga semua manusia sesudahnya. Tetapi kemudian banyak di antara manusia yang tidak memperhatikan dan melaksanakannya, sehingga mereka setelah itu bersikap melampaui batas dan melakukan kerusakan di bumi dengan pembunuhan-pembunuhan yang dilakukannya. Pada ayat ini Allah menjelaskan hukuman bagi perampok dan pengganggu keamanan umum, yang acap kali juga disertai pembunuhan. Dalam kaitan ini ditetapkan bahwa hukuman bagi orang-orang yang memerangi Allah dan rasul-Nya, yaitu orang-orang yang tidak berdosa dan tidak bersalah, dan membuat kerusakan di bumi, balasannya tidak ada lain hanyalah dibunuh bila membunuh atau disalib bila membunuh dan mengambil harta, atau dipotong tangan dan kaki mereka secara silang bila mengambil harta, tetapi tidak membunuh, atau diasingkan dari tempat kediamannya bila hanya menakut-nakuti. Ketetapan hukuman yang demikian itu merupakan kehinaan bagi mereka di dunia yang disebabkan perilaku mereka, dan di akhirat mereka pasti akan mendapat azab yang besar."
  }
]