[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya balasan bagi orang-orang yang memerangi Allah dan menentangNya dengan melancarkan permusuhan kepadaNya,serta berbuat melampaui batas terhadap hukum-hukumNya dan hukum-hukum rasulNya dan melakuakn perbuatan kerusakan di muka bumi dengan membunuh jiwa manusia dan merampas harta benda, supaya mereka itu dibunuh, disalib dan dibunuh (disalib maksudnya pelaku kriminal diikat di batang kayu), atau di potong tangan kanan orang yang memerangi manusia dan kaki kirinyai .Apabila dia belum mau bertaubat, maka di potong (juga) tangan kiri dan kaki kanannya, atau mereka diasingkan ke tempat lain selain tempatnya sendiri, dan ditahan di dalam penjara daerah tersebut,sampai tampak jelas taubat mereka. Dan Balasan ini Allah persiapkan bagi orang-orang yang memerangi itu merupakan kehinaan di dunia dan di akhirat mereka akan mendapat siksaan pedih,bila mereka tidak bertaubat."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "33. Tidak ada balasan yang pantas bagi orang-orang yang memerangi Allah dan rasul-Nya, dan menantang-Nya dengan menebar permusuhan serta kerusakan di muka bumi dengan cara membunuh, merampok, dan menebar teror selain dibunuh tanpa disalib, atau dibunuh dengan cara disalib di atas kayu atau sejenisnya, atau dipotong tangan kanan dan kaki kirinya, kemudian apabila ia mengulanginya maka dipotonglah tangan kiri dan kaki kanannya, atau diusir dari kampung halamannya. Hukuman itu merupakan kehinaan besar bagi mereka di dunia. Dan di Akhirat kelak mereka akan mendapatkan azab yang sangat besar."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "33. Ayat ini menjelaskan balasan bagi orang-orang yang memerangi Allah dan rasul-Nya. Memerangi dan mengganggu orang-orang beriman merupakan bentuk dari perbuatan memerangi Allah dan rasul-Nya, dan keluar dari ketaatan. Hukum ini berlaku bagi seluruh orang yang memerangi, baik itu di perkampungan maupun di kota, di jalan maupun di rumah. Orang yang merampok, menebar ketakutan, berbuat kerusakan di muka bumi, balasannya adalah dibunuh, atau disalib tanpa belas kasih, atau dipotong kaki dan tangannya secara menyilang -dipotong tangan kanannya sebatas pergelangan tangan dan kaki kirinya sebatas mata kaki-, atau diusir dari negeri itu. Maka orang yang membunuh dan merampas harta hukumannya adalah dibunuh dan disalib; orang yang merampas harta namun tidak membunuh hukumannya adalah dipotong kaki dan tangannya secara menyilang; sedangkan orang yang menebar ketakutan namun tidak membunuh maupun merampas harta hukumannya adalah diusir dari negeri itu. Hukuman ini merupakan kehinaan bagi mereka di dunia, sedangkan di akhirat mereka akan mendapatkan azab yang pedih yang tak tertahankan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "33. إِنَّمَا جَزٰٓؤُا۟ الَّذِينَ يُحَارِبُونَ اللهَ وَرَسُولَهُۥ (Sesungguhnya pembalasan terhadap orang-orang yang memerangi Allah dan Rasul-Nya) Ayat ini diturunkan bagi orang-orang beriman yang melakukan begal dan kerusakan di muka bumi. Ayat ini juga mencakup orang musyrik dan lainnya yang melakukan dos yang telah disebutkan dalam ayat ini. Yang dimaksud dengan memerangi Allah adalah bermaksiat kepada-Nya. Dan yang dimaksud dengan memerangi Rasul adalah dengan mengangkat senjata untuk melawannya; dan termasuk didalamnya orang yang memerangi orang-orang beriman baik di masa Rasulullah maupun setelahnya apabila ia keluar untuk memerangi orang-orang dengan senjata, menghalangi jalan untuk merampas harta, membunuh jiwa yang tak bersalah tanpa ada syubhat, atau keinginan untuk memperbaiki keadaan atau melawan kerusakan. وَيَسْعَوْنَ فِى الْأَرْضِ فَسَادًا (dan membuat kerusakan di muka bumi) Yakni yang membuat kerusakan didalamnya. أَن يُقَتَّلُوٓا۟ (mereka dibunuh) Yakni apabila mereka membunuh orang yang tidak bersalah. أَوْ يُصَلَّبُوٓا۟( atau disalib) Yakni dengan digantung tubuhnya diatas batang pohon atau kayu. Mereka disalib bila mereka merampas harta dan membunuh. Dikatakan bahwa penyaliban dilakukan setelah orang tersebut dihukum mati, dan tidak boleh disalib sebelum dibunuh agar ia tidak terhalang untuk melakukan shalat. Dan penjelasan yang lebih terperinci terdapat pada kitab-kitab fiqih dalam bab hukuman bagi tukang begal. أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُم مِّنْ خِلٰفٍ(atau dipotong tangan dan kaki mereka dengan bertimbal balik) Hukuman ini diberikan jika mereka merampas harta tanpa melakukan pembunuhan. Dan yang dimaksud dengan pemotongan ini adalah dengan memotong tangan kanan dan kaki kiri saja. أَوْ يُنفَوْا۟ مِنَ الْأَرْضِ ۚ (atau dibuang dari negeri) Hukuman ini diberikan apabila mereka tidak melakukan pembunuhan dan tidak pula mengambil harta. Para tukang begal yang memiliki senjata ini harus diburu dengan mengerahkan pasukan berkuda dan pejalan kaki sampai tertangkap dan dihukum atau sampai ia kabur keluar dari negeri Islam. Imam Syafi’I mengatakan mereka harus dikeluarkan dari suatu negeri ke negeri lain. Dan mereka harus ditangkap agar ditegakkan atasnya hukuman had. Imam Malik mengatakan mereka harus diasingkan dari negeri tempat ia melakukan kejahatan menuju negeri lain lalu ia dipenjara disana seperti hukuman bagi pezina. Dan secara tekstual ayat ini menunjukkan bahwa mereka diusir dari tempat ia melakukan kejahatan tanpa hukuman penjara atau lainnya. Pendapat lain mengatakan pemimpinlah yang menentukan hukuman bagi orang-orang yang memerangi ini dengan satu diantara ketiga hukuman yang ada. ذٰلِكَ لَهُمْ خِزْىٌ فِى الدُّنْيَا ۖ (Yang demikian itu (sebagai) suatu penghinaan untuk mereka didunia) Makna (الخزي) yakni kehinaan dan penghinaan."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "33. Sesungguhnya balasan orang-orang yang melawan wali-wali Allah dan rasulNya, dan berbuat kerusakan di bumi dengan memotong jalan, menebar fitnah, mengganggu keamanan, dan melakukan permusuhan terhadap jiwa dan harta benda, maka sebaiknya mereka dibunuh, jika mereka hendak membunuh (kalian) atau menyalib mereka, jika mereka hendak membunuh dan mengambil harta (kalian), atau memotong tangan dan kaki mereka secara silang, yaitu dengan memotong tangan kanan dari bagian pergelangan, dan kaki kiri dari bagian mata kaki saja, jika mereka hanya hendak mengambil harta dan tidak ingin membunuh, atau mengasingkan mereka dari bumi, yaitu mengusir mereka ke negeri lain jika mereka hanya menakut-nakuti manusia, tidak hendak membunuh dan mengambil harta. Balasan bagi mereka itu adalah kehinaan di dunia. Dan bagi mereka di akhirat azab neraka yang sangat dahsyat. Ibnu Abbas dan Adh-Dhahak berkata: “Sesungguhnya ayat ini turun karena suatu kaum dari ahli kitab melanggar perjanjian yang dibuat dengan rasulullah SAW dan melakukan pemotongan jalan, serta berbuat kerusakan di bumi” Dan Jumhur (ulama’) berkata: “Ayat ini turun terkait suatu kaum dari suku ‘Ukl dan Urainah (keduanya adalah suku) yang membunuh orang-orang muslim yang menggembalakan unta, lalu mereka memberi minum unta tersebut. Kemudian rasulullah SAW mengutus untuk mencari jejak mereka dan akhirnya mereka ketemu. Lalu dia memberikan perintah untuk menghukum mereka sebagaimana perlakukan mereka terhadap para penggembala itu, yaitu perlakuan yang sama.” Ayat ini untuk perampok orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Sesungguhnya balasan bagi orang-orang yang memerangi Allah dan rasulNya serta membuat kerusakan di bumi hanyalah dibunuh} hukuman selain salib jika mereka melakukan kejahatan pembunuhan saja {disalib} dibunuh dengan disalib jika mereka melakukan kejahatan lain yang disertai pembunuhan seperti perampokan {dipotong tangan dan kaki mereka secara silang} dipotong bagian kanan dari tangannya dan bagian kiri dari kakinya atau bagian kiri dari tangannya dan bagian kanan dari kakinya {atau diasingkan} dijauhkan {dari tempat kediamannya. Yang demikian itu merupakan kehinaan} kehinaan dan hal yang memalukan {bagi mereka di dunia dan di akhirat mereka mendapat azab yang sangat berat"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "33. Orang-orang yang memerangi Allah dan RasulNya adalah orang-orang yang memaklumkan sikap permusuhan secara terbuka, mereka membuat kerusakan di muka bumi dengan kekufuran, pembunuhan, perampasan harta, dan meneror keamanan jalan. Yang masyhur adalah bahwa ayat ini berbicara tentang hukum para pembegal yang menghadang manusia di desa-desa dan daerah-daerah terpencil lalu mereka merampas harta, menakut-nakuti dan membunuh, akibatnya orang-orang menjadi takut untuk melewati jalan di mana mereka berada, maka jalan pun terputus karena itu. Maka Allah menyampaikan bahwa hukuman bagi mereka pada saat had ditegakkan (ditimpakan) atas mereka, adalah salah satu dari hukuman-hukuman tersebut. Para ulama tafsir berselisih pendapat apakah hukum dalam ayat ini berdasarkan kepada pilihan, dalam arti, pemimpin atau wakilnya menghukum para pembegal dengan hukuman yang sesuai dengan kemaslahatan yang dipandangnya dengan memilih satu dari hukuman-hukuman dalam ayat ini, dan inilah zahir ayat, atau hukuman mereka berdasarkan kepada kejahatan mereka, di mana masing-masing kejahatan memiliki hukuman yang sesuai dengannya sebagaimana hal itu ditunjukkan oleh ayat dengan hikmah dan kesesuaiannya dengan hikmah Allah, bahwa jika mereka membunuh dan mengambil harta, maka membunuh dan menyalib mereka adalah keharusan, supaya mereka dikenal dan menjadi hina, dan orang-orang selain mereka tidak berani melakukan seperti yang mereka lakukan. Jika mereka membunuh tanpa mengambil harta, maka mereka hanya dibunuh saja (qishash). Jika mereka mengambil harta tanpa membunuh, maka tangan dan kaki mereka harus dipotong secara berselang-seling; tangan kanan dan kaki kiri. Jika mereka membuat ketakutan tanpa membunuh dan mengambil harta, maka mereka dibuang dari negeri mereka, mereka tidak diizinkan berlindung di suatu tempat dalam negeri (kaum Muslimin) sampai terlihat taubatnya. Ini adalah pendapat Ibnu Abbas dan banyak imam, sekali pun terdapat perbedaan di antara mereka dalam beberapa perincian. “Hal itu,” yakni hukuman tersebut “sebagai suatu penghinaan untuk mereka di dunia,” yakni sebagai cacat dan aib. “Dan di akhirat mereka memperoleh siksaan yang besar.” Ini menunjukkan bahwa pembegalan termasuk dosa terbesar, penyebab aib di dunia dan azab di akhirat dan bahwa pelakunya adalah orang yanhg memerangi Allah dan RasulNya. Jika telah diketahui besarnya kadar dosa ini, maka diketahui bahwa membersihkan bumi dari perusak, menjamin keamanan jalan dan fasilitas umum dari pembunuhan, perampasan harta dan peneror orang-orang yang aman adalah termasuk kebaikan yang besar dan ketaatan yang mulia dan bahwa itu adalah perbaikan di muka bumi, sebagaimana kebalikannya adalah kerusakan di muka bumi."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 33: Ayat ini turun berkenaan dengan orang-orang Urainah saat mereka ke Madinah dan merasakan sakit di sana, maka Nabi shallallahu 'alaihi wa sallam mengizinkan mereka mendatangi unta, meminum kencing dan susunya. Ketika mereka sudah sehat, mereka malah membunuh pengembalanya dan membawa pergi untanya. Imam Abu Dawud meriwayatkan dari Anas bin Malik hadits orang-orang Urainah, ia berkata, \"Rasulullah shallallahu 'alaihi wa sallam mengirim sekelompok orang untuk mencari mereka, lalu mereka ditangkap. Maka Allah menurunkan tentang hal tersebut ayat, \"Innamaa jazaa'ullladziina yuhaaribuunallaha wa rasuulahu…dst.\" Yakni dengan menyerang kaum muslimin, terang-terangan memusuhi dan mengadakan kerusakan di muka bumi, melakukan pembunuhan, merampas harta dan mengacaukan keamanan. Melakukan pembajakan, yakni tindakan menghadang manusia baik di kota maupun di desa, lalu merampas harta mereka, membunuh dan menakut-nakuti manusia sehingga jalan yang ditempuh mereka menjadi tidak aman. Maksudnya adalah memotong tangan kanan dan kaki kiri; dan jika melakukan lagi, maka dipotong tangan kiri dan kaki kanan. Para mufassir berbeda pendapat, yakni apakah hukuman di atas menunjukkan pilihan, dalam arti bahwa imam (pemerintah) atau wakilnya boleh melakukan hukuman mana saja sesuai yang dipandangnya bermaslahat, atau apakah hukuman tersebut disesuaikan dengan tindakan kejahatan yang dilakukan, di mana masing-masing kejahatan ada hukuman tersendiri?. Untuk pendapat pertama berdasarkan dengan zhahir lafaz ayat tersebut. Sedangkan pandapat kedua memandang bahwa penyesuaian hukuman sejalan dengan kebijaksanaan Allah Ta'ala. Oleh karena itu, hukuman bunuh jika pembajak itu melakukan pembunuhan, hukuman bunuh dan penyaliban dilakukan jika pembajak melakukan pembunuhan, ditambah dengan mengambil harta manusia, agar dijadikan pelajaran bagi orang lain. Namun jika hanya mengambil harta saja tanpa melakukan pembunuhan, maka dengan dipotong tangan dan kaki secara silang. Sedangkan hukuman dengan diasingkan atau yang semisalnya seperti pemenjaraan, jika pembajak tersebut mengacaukan keamanan (menakut-nakuti). Hal ini menunjukkan bahwa membajak merupakan dosa yang sangat besar, di mana hal itu menghendaki pelakunya untuk dihinakan dan diazab di akhirat. Jika demikian berat hukuman yang ditimpakan kepada pembajak, maka hal ini menunjukkan bahwa membersihkan bumi dari pengrusak, mengamankan jalan dari adanya pembajakan termasuk amal shalih yang amat besar, ketaatan utama dan termasuk memperbaiki bumi."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 33",
    "description": "Pada ayat ini Allah menjelaskan hukuman bagi perampok dan pengganggu keamanan umum, yang acap kali juga disertai pembunuhan. Dalam kaitan ini ditetapkan bahwa hukuman bagi orang-orang yang memerangi Allah dan rasul-Nya, yaitu orang-orang yang tidak berdosa dan tidak bersalah, dan membuat kerusakan di bumi, balasannya tidak ada lain hanyalah dibunuh bila membunuh atau disalib bila membunuh dan mengambil harta, atau dipotong tangan dan kaki mereka secara silang bila mengambil harta, tetapi tidak membunuh, atau diasingkan dari tempat kediamannya bila hanya menakut-nakuti. Ketetapan hukuman yang demikian itu merupakan kehinaan bagi mereka di dunia yang disebabkan perilaku mereka, dan di akhirat mereka pasti akan mendapat azab yang besarketetapan hukuman ini berlaku bagi seluruh manusia, kecuali bagi orang-orang yang bertobat, menyesali perbuatannya, dan tidak lagi mengulanginya sebelum kamu dapat menguasai mereka; maka ketahuilah bahwa orang yang seperti ini layak diberi ampunan, karena sesungguhnya Allah itu maha pengampun, maha penyayang."
  }
]