[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Akan tetapi, orang yang datang dari orang-orang yang memerangi itu sebelum kalian menangkap mereka, bahkan dia datang dengan taat lagi menyesal, maka sesungguhnya telah gugur atas dirinya hak yang menjadi milik Allah. Ketahuilah (wahai kaum mukminin), bahwa Allah maha pengampun terhadap hamba-hambaNya lagi maha penyayang kepada mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "34. Kecuali mereka yang sudah bertaubat sebelum kalian -wahai para pemimpin- berhasil menangkap mereka. Ketahuilah bahwa Allah Maha Pengampun lagi Maha Penyayang bagi mereka setelah pertaubatan tersebut. Salah satu bentuk kasih sayang-Nya ialah membatalkan hukuman mereka."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "34. Allah memberi pengecualian bagi orang yang bertaubat sebelum tertangkap dan orang kafir harbi yang kemudian masuk Islam, karena Islam menghapus dosa-dosa yang dilakukan sebelumnya. Adapun orang yang memerangi Allah dan rasul-Nya dari kalangan Ahlul kiblat yang kemudian bertaubat sebelum tertangkap, maka perkaranya dengan Allah telah selesai, namun perkaranya dengan sesama manusia berubah hutang nyawa atau harta tetap berlaku. Dan wali pihak terbunuh mempunyai hak untuk memaafkannya, dan pemilik piutang berhak mengikhlaskan hartanya. Ayat ini ditutup dengan dua nama Allah yang agung untuk mendorong hamba-hamba-Nya agar mau memaafkan orang yang bertaubat sebelum tertangkap."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "34. مِن قَبْلِ أَن تَقْدِرُوا۟ عَلَيْهِمْ ۖ (sebelum kamu dapat menguasai (menangkap) mereka) Allah memberi pengecualian bagi orang-orang yang bertaubat sebelum mereka tertangkap, maka orang yang telah bertaubat sebelum ia ditangkap setelah memerangi Allah dan Rasul-Nya serta berbuat kerusakan tidak mendapat hukuman yang tertulis dalam ayat sebelumnya. Beberapa ulama berpendapat bahwa pertaubatan tidak menjatuhkan hukuman qishash dan hak-hak orang lain atasnya meski ia belum tertangkap. Adapun pertaubatan setelah ia tertangkap maka itu tidak menjatuhkan (menghindarkan) hukuman yang termaktub dalam ayat sebelumnya. Dan orang yang memiliki hak darah atasnya tidak memiliki keputusan atasnya, dan tidak pula dibolehkan untuk mengampuninya, namun perkaranya dikembalikan kepada pemimpin/penguasa."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "34. Kecuali orang-orang yang bertaubat dari perbuatan penyerangan itu sebelum mereka dikuasai (tertangkap), maka mereka tidak dihukum dengan hukuman-hukuman yang disebutkan itu. Allah menerima taubat hamba-hambaNya yang mau bertaubat dengan menunaikan hak-hak Allah, dan hak-hak para hamba seperti harta harus dibayarkan kepada pemiliknya (keluarga korban)."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Kecuali orang-orang yang bertaubat sebelum kalian dapat menangkapnya. Maka ketahuilah bahwa sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "34. “ Kecuali orang-orang yang bertaubat di antara mereka sebelum kamu dapat menangkap mereka,” yakni dari orang-orang yang memerangi Allah dan RasulNya di atas itu. “ Maka ketahuilah bahwa Allah Maha Pengampun Lagi Maha Penyayang.” Maksudnya, gugur hukuman yang menjadi hak Allah yaitu pembunuhan, penyaliban, pemotongan tangan dan pengusiran. Gugur juga hak Bani Adam jika pelakunya adalah kafir, kemudian ia masuk islam, tetapi jika pelakunya adalah muslim, maka hak Bani Adam yaitu nyawa dan harta tidak gugur darinya. Mafhum ayat menunjukan bahwa taubatnya muharib setelah ia di tangkap, tidak mengugurkan hukuman-hukuman apa pun itu. Hikmah dalam hal ini jelas. Dan jika taubat terjadi sebelum tertangkap, itu dapat menghalangi pelaksanaan had pada kejahatan tadi, maka lebih-lebih hudud yang lain jika pelakunya bertaubat sebelum di tangkap."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 34: Disebutkan kata-kata \"maka ketahuilah, bahwa Allah Maha Pengampun lagi Maha Penyayang\" tidak dengan kata-kata, \"Maka janganlah kamu tegakkan had kepada mereka\" menunjukkan bahwa dengan tobat hak-hak Allah menjadi gugur (seperti keharusan dibunuh, disalib, dipotong tangan dan kaki secara silang atau diasingkan), namun tidak gugur hak manusia (seperti karena membunuh dan mengambil harta) sebagaimana diterangkan oleh penyusun tafsir Al Jalalain. Menurut Syaikh As Sa'diy, jika muharib (pembajak) sebelumnya non muslim, lalu masuk Islam, maka hak Allah maupun hak manusia gugur. Namun jika muharibnya muslim, lalu bertobat, maka hak Allah gugur, namun hak manusia tidak gugur. Jika tobat dilakukan muharib sebelum ditangkap, maka tidak diberlakukan hukuman had hirabah (pembajakan) terhadapnya, demikian juga dalam had-had yang lain jika pelakunya bertobat sebelum ditangkap."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 34",
    "description": "Ketetapan hukuman ini berlaku bagi seluruh manusia, kecuali bagi orang-orang yang bertobat, menyesali perbuatannya, dan tidak lagi mengulanginya sebelum kamu dapat menguasai mereka; maka ketahuilah bahwa orang yang seperti ini layak diberi ampunan, karena sesungguhnya Allah itu maha pengampun, maha penyayangsesudah dijelaskan tentang hukuman para pengacau keamanan dan pelanggar larangan Allah dan rasul-Nya karena dengki dan ketidaktaatan mereka, maka ayat ini memerintahkan orang mukmin untuk bertakwa dan melakukan perbuatan baik. Wahai orang-orang yang beriman! bertakwalah kamu sekalian kepada Allah dengan ibadah dan melaksanakan semua perintah-Nya, dan carilah wasilah, jalan yang paling tepat, untuk mendekatkan diri kepada-Nya, dan berjihadlah, yakni berjuanglah, di jalan-Nya dengan melakukan kebaikan dan membantu mereka yang memerlukan. Semua perintah ini dimaksudkan agar kamu menjadi lebih beruntung, baik ketika di dunia maupun kelak di akhirat."
  }
]