[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Wahai orang-orang yang beriman kepada Allah dan RasulNya serta menjalankan syariatNya, takutlah kepada Allah dan dekatkanlah diri kalian kepadaNya dengan cara taat kepadaNya dan beramal denga sesuatu yang diridahaanNya, dan berjihadlah di jalanNya, supaya kalian mengggapai keberuntungan dengan memperoleh surga-surgaNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "35. Wahai orang-orang yang beriman! Bertakwalah kalian kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Dan berusahalah kalian untuk mendekatkan diri kepada-Nya dengan menunaikan apa yang Dia perintahkan kepada kalian dan menjauhi apa yang Dia larang. Dan berjuanglah kalian melawan orang-orang kafir untuk mengharap rida-Nya, agar kalian bisa mendapatkan apa yang kalian cari dan menghindari apa yang kalian takuti, manakala kalian melaksanakan kewajiban (berjuang) tersebut."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "35. Setelah Allah menjelaskan keadaan orang yang terancam mendapat kemurkaannya karena berbuat kerusakan di muka bumi, maka kemudian Dia menyuruh hamba-hambanya yang beriman untuk menjelaskan kepada mereka jalan menuju keridhaan-nya dan memerintahkan mereka untuk bertakwa, karena ketakwaan merupakan benteng yang aman dan kokoh bagi diri dan masyarakat. Dan masyarakat yang bertaqwa merupakan masyarakat yang sholeh dan diliputi keamanan serta selalu mengharap keridhaan Allah. Keamanan dan perlindungan bagi masyarakat dari musuh-musuh tidak akan terealisasi kecuali dengan menegakkan jihad; karena jihad merupakan jalan untuk mendapat keamanan, ketentraman, dan keadilan. Masyarakat yang beriman anggotanya akan saling berlomba-lomba untuk meraih keridhaan Allah Semata dengan berbagai amal ketaatan dan berjihad di jalannya dengan segala kekuatan dan persiapan yang dia miliki demi meninggikan kalimatnya dan melindungi hamba-hambanya. Masyarakat yang aman dan tentram tidak memiliki ruang bagi kejahatan dan kerusakan sehingga tidak membutuhkan biaya yang besar untuk mewujudkan keamanan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "35. وَابْتَغُوٓا۟ إِلَيْهِ الْوَسِيلَةَ (dan carilah jalan yang mendekatkan diri kepada-Nya) Yakni carilah apa yang dapat mendekatkanmu kepada Allah. Makna dari (الوسيلة) yakni pendekatan dan pembenaran ketakwaan dan perbuatan-perbuatan lainnya yang dapat mendekatkan seorang hamba kepada tuhannya. وَجٰهِدُوا۟ فِى سَبِيلِهِۦ(dan berjihadlah pada jalan-Nya) Yakni perangilah orang yang tidak diterima agamanya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "35. Wahai orang-orang mukmin, bertakwalah kepada Allah dengan menunaikan syariat dan hukum-hukumNya. Dan carilah sesuatu yang terhubung dengan Allah dan ridhaNya, yaitu amal shalih. Al-Washilah adalah jalan untuk mendekat. Dan berusahalah untuk meninggikan kalimat agama (Islam) supaya kalian dapat meraih keberhasilan dan surga."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Wahai orang-orang yang beriman, bertakwalah kepada Allah, carilah} carilah {wasilah kepadaNya} kedekatan dengan menaatiNya {dan berjihadlah di jalanNya agar kalian beruntung"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "35. Ini adalah perintah dari Allah kepada hamba-hambaNya yang beriman agar mereka bertakwa dan berhati-hati terhadap murka dan amarahNya, yang mana itu adalah merupakan konsekuensi dari iman, hal itu dengan bersungguh-sungguh dan mengeluarkan segala kemampuan yang dimiliki untuk menjauhi kemaksiatan hati, lisan dan anggota badan, baik lahir maupun batin yang di murkai oleh Allah, dan memohon pertolongan kepada Allah agar bisa meninggalkannya, supaya dengan itu dia selamat dari murka dan azabNya. “ Dan carilah jalan yang bisa mendekatkan diri kepadaNya,” artinya, kedekatan kepadanya, bagian pahala di sisiNya dan kecintan kepadaNya, dan hal itu dengan melaksanakan kewajibannya yang terkait dengan hati, seperti mencintai dijalan-Nya dan mencintainya karenaNya, rasa takut, berharap, kembali kepadaNya, dan tawakal, juga melaksanakan kewajiban-kewajibanNya yang terkait dengan badan, seperti zakat dan haji dan kewajiban-kewajiban yangh terkait dengan keduanya seperti shalat, macam-macam dzikir, bacaan, macam-macam perbuatan baik kepada mahkluk dengan ilmu, harta kedudukan, badan dan nasihat kepada hamba-hamba Allah. Semua amal-amal ini mendekatkan kepada Allah. Dan seorang hamba berusaha mendekatkan diri kepada Allah sehingga dia mencintainya, dan jika dia telah mencintainya, maka Dia menjadi pendengarannya yang dengannya Dia mendengar, penglihatannya yang dengannya Dia melihat, tangannya yang dengannya Dia bekerja dan kakinya yang denganya dia berjalan dan Allah menjawab Do’anya. Kemudian Allah menghususkan jihad di jalanNya dari amal-amal yang mendekatkan kepadaNya, dan jihad itu mengeluarkan segala daya dalam memerangi orang kafir dengan harta, nyawa, pandangan, lisan, dan usaha untuk menjunjung Agama Allah dengan apa yang mampu untuk di lakukan oleh seorang hamba, Karena bentuk ini termasuk kemuliaan yang mulia dan ibadah yang paling utama, juga karena barangsiapa yang menunaikannya, maka dia pasti menunaikan yang lainnya, bahkan lebih baik. “ Supaya kamu mendapatkan keberuntungan,” yaitu jika kamu bertakwa kepada Allah dengan meninggalkan kemaksiatan dan kamu mencari cara medekatkan diri kepadaNya dengan melakukan ketaatan dan berjihad di jalanNya demi mencari ridhaNya. Keberuntungan itu adalah keberhasilan meraih dan mendapatkan apa yang diinginkan dan selamat dari apa yang tidak diinginkan, hakikatnya adalah kebahagiaan abdi dan nikmat yang lenggeng."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 35: Ayat ini merupakan perintah Allah kepada hamba-hamba-Nya yang mukmin untuk mengerjakan konsekwensi dari keimanan berupa ketakwaan kepada Allah dan berhati-hati terhadap hal yang mendatangkan kemurkaan-Nya, caranya adalah dengan berusaha sekuat tenaga menjauhi hal yang dimurkai Allah yang berupa maksiat, baik maksiat hati, lisan maupun anggota badan yang nampak atau tersembunyi, serta meminta pertolongan kepada Allah untuk meninggalkannya dan dapat mengerjakan perintah Allah. Misalnya dengan mengerjakan amalan sunat setelah amalan wajib. Jika seorang hamba mendekatkan diri kepada Allah dengan mengerjakan banyak ibadah (termasuk ibadah pula bermu'amalah/berhubungan dengan orang lain mengikuti ajaran Islam), maka Allah akan mencintainya, dan apabila Allah mencintainya, maka Allah akan menjadikan gerakannya dilakukan karena-Nya, dan Allah akan mengabulkan doa dan permintaan-nya. Selanjutnya, Allah mengkhususkan di antara sekian jalan itu dengan jihad fii sabilillah, yakni dengan mengerahkan kemampuannya untuk memerangi orang-orang kafir, baik dengan harta, jiwa, saran, lisan dan segala usaha membela agama Allah sesuai kemampuannya, karena jihad termasuk ketaatan utama dan pendekatan diri yang utama. Di samping itu, karena orang yang melakukannya biasanya mampu mengerjakan yang lainnya. Yakni jika kamu bertakwa kepada Allah dengan menjauhi maksiat, mencari jalan untuk mendekatkan diri kepada Allah dengan melakukan ketaatan serta berjihad di jalan-Nya untuk meninggikan kalimat-Nya, maka kamu akan beruntung, dalam arti akan memperoleh apa yang kamu inginkan dan selamat dari apa yang kamu khawatirkan, di mana hal itu pada hakikatnya merupakan kebahagiaan dan kenikmatan yang sesungguhnya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 35",
    "description": "Sesudah dijelaskan tentang hukuman para pengacau keamanan dan pelanggar larangan Allah dan rasul-Nya karena dengki dan ketidaktaatan mereka, maka ayat ini memerintahkan orang mukmin untuk bertakwa dan melakukan perbuatan baik. Wahai orang-orang yang beriman! bertakwalah kamu sekalian kepada Allah dengan ibadah dan melaksanakan semua perintah-Nya, dan carilah wasilah, jalan yang paling tepat, untuk mendekatkan diri kepada-Nya, dan berjihadlah, yakni berjuanglah, di jalan-Nya dengan melakukan kebaikan dan membantu mereka yang memerlukan. Semua perintah ini dimaksudkan agar kamu menjadi lebih beruntung, baik ketika di dunia maupun kelak di akhirat. Sesungguhnya orang-orang yang kafir, yaitu mereka yang tidak mau bertakwa kepada Allah dan tidak mau membersihkan diri dari dosa, serta mengingkari keesaan-Nya pasti akan mendapat balasan. Seandainya mereka memiliki segala apa yang ada di bumi dan ditambah dengan sebanyak itu lagi yang kemudian dipergunakan untuk menebus diri mereka agar terlepas dari azab pada hari kiamat akibat keingkarannya, niscaya semua itu tidak akan diterima Allah sebagai tebusan dari mereka. Oleh karena itu, di akhirat mereka tetap akan mendapat azab yang pedih. 37."
  }
]