[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Sesungguhnya orang-orang yang mengingkari keesaan Allah dan syariatNya, seandainya mereka itu memiliki semua yang ada dimuka bumi dan memiliki yang setara dengannya lagi, dan mereka ingin menebus diri mereka pada hari kiamat dari siksaan Allah dengan apa yang mereka miliki tersebut, niscaya Allah tidak menerima tebusan itu dari mereka. Dan bagi mereka siksaan yang menyakitkan."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "36. Sungguh, sekiranya orang-orang yang ingkar kepada Allah dan rasul-Nya, masing-masing memiliki semua yang ada di bumi ini ditambah dengan jumlah yang sama lalu mereka mempergunakannya untuk menebus diri mereka dari azab Allah di hari Kiamat, niscaya tebusan itu tidak akan diterima, dan mereka tetap akan mendapatkan azab yang pedih."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "36. Setelah Allah menyebutkan jalan untuk mendekatkan diri kepada-Nya dan meraih keridhaan-Nya, maka kemudian Allah menjelaskan keadaan orang-orang kafir bahwa pintu untuk meraih keridhaan Allah yang ada di depan mereka telah tertutup, karena mereka tidak membukanya ketika di dunia. Maka dari itu seandainya mereka memiliki segala kekayaan dan perbendaharaan yang ada di bumi atau bahkan dua kali lipat dari itu, kemudian mereka hendak menebus diri mereka agar dapat selamat dari azab di akhirat dan mendekat kepada Allah niscaya itu semua tidak akan diterima. Dan bagaimana itu akan diterima, sedangkan ketika di dunia mereka hanya diminta untuk menginfakkan sedikit saja namun mereka enggan? Maka di akhirat tempat kembali mereka adalah azab neraka yang pedih."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "36. إِنَّ الَّذِينَ كَفَرُوا۟ لَوْ أَنَّ لَهُم مَّا فِى الْأَرْضِ جَمِيعًا (Sesungguhnya orang-orang yang kafir sekiranya mereka mempunyai apa yang dibumi ini seluruhnya) Berupa harta, manfaat, dan tanah air. وَمِثْلَهُۥ مَعَهُۥ(dan mempunyai yang sebanyak itu) Dan ditambah lagi dengan yang sebanyak itu. لِيَفْتَدُوا۟ بِهِۦ مِنْ عَذَابِ يَوْمِ الْقِيٰمَةِ (untuk menebusi diri mereka dengan itu dari azab hari kiamat) Yakni niscaya mereka akan mengajukan hal-hal tersebut kepada Allah sebagai ganti agar mereka tidak mendapatkan azab. مَا تُقُبِّلَ مِنْهُمْ ۖ (niscaya tidak akan diterima dari mereka) Yakni tidak diterima tebusan tersebut."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "36. Jika orang kafir menebus azab akhirat dengan seluruh yang dimilikinya di dunia lalu dilipatgandakan lagi, niscaya tebusan itu tidak akan diterima. Dan bagi mereka itu azab yang pedih dan menyakitkan."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Sesungguhnya orang-orang kafir, seandainya memiliki segala apa yang ada di bumi dan ditambah lagi yang seperti itu, lalu digunakan untuk menebus diri mereka dari azab hari kiamat, niscaya semua itu tidak akan diterima dari mereka. Bagi mereka azab yang sangat pedih} menyakitkan"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. Allah mengabarkan tentang buruknya keadaan orang-orang kafir (kepada Allah) dan tempat kembali mereka yang jelek pada Hari KIamat. Bahwa seandainya mereka menebus azab Allah dengan emas sepenuh jagat dan ditambah dengan yang sepertinya, maka itu tidak berguna dan tidak diterima, karena waktu penebusan telah habis, yang tersisa hanyalah azab yang pedih yang menyakitkan dan kekal di mana mereka tidak keluar darinya untuk selama-lamanya dan akan menetap di dalamnya untuk masa yang tidak berujung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 36",
    "description": "Sesungguhnya orang-orang yang kafir, yaitu mereka yang tidak mau bertakwa kepada Allah dan tidak mau membersihkan diri dari dosa, serta mengingkari keesaan-Nya pasti akan mendapat balasan. Seandainya mereka memiliki segala apa yang ada di bumi dan ditambah dengan sebanyak itu lagi yang kemudian dipergunakan untuk menebus diri mereka agar terlepas dari azab pada hari kiamat akibat keingkarannya, niscaya semua itu tidak akan diterima Allah sebagai tebusan dari mereka. Oleh karena itu, di akhirat mereka tetap akan mendapat azab yang pedih. 37 ketika merasakan betapa pedihnya azab di akhirat nanti, mereka ingin sekali untuk keluar dari neraka yang merupakan tempat hukumannya, tetapi ternyata mereka tidak akan dapat keluar dari sana. Akibat dari sikap dan perilakunya, di akhirat kelak mereka akan mendapat azab yang kekal."
  }
]