[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Orang-orang kafir itu menginginkan keluar dari neraka dikarenakan apa yang mereka hadapi didalamnya berupa kesengsaraan-kesengsaraan, tetapi tidak ada jalan bagi mereka untuk mewujudkan hal itu. Dan bagi mereka siksaan yang abadi."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "37. Mereka ingin keluar dari neraka jika telah memasukinya. Tetapi mana mungkin mereka bisa keluar dari sana? Mereka tidak akan keluar dari sana dan mereka akan mendapatkan siksa yang tidak ada hentinya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "37. Kemudian Allah menjelaskan keadaan mereka di neraka jahanam dan usaha mereka untuk dapat keluar darinya. Namun mereka tidak akan mampu keluar dari neraka, bahkan mereka akan tinggal selama-lamanya di dalam azab yang tidak akan pernah berakhir dan mereka tidak akan memiliki jalan untuk melarikan diri."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "37. وَمَا هُم بِخٰرِجِينَ مِنْهَا ۖ (padahal mereka sekali-kali tidak dapat keluar daripadanya) Ayat ini ditujukan bagi orang-orang kafir dan bukan bagi pelaku maksiat dari orang-orang beriman."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "Dua mutiara dari penjelasan Ibnu Taimiyah tentang ayat ini : Pertama : { وَلَهُمْ عَذَابٌ مُقِيمٌ } \"dan mereka beroleh azab yang kekal\" bagi mereka rasa sakit yang kekal dalam jiwa akan dirasakan di dunia dan di akhirat : kegundahan, kesedihan, dan hati yang selalu gelap; karena kekafiran dan kemaksiatan pasti akan mendatangkan rasa sakit tiada henti, oleh karena itu kita mendapati sebagian besar dari mereka tidak memperbaiki pola hidup kecuali dengan cara yang menghilangkan akal, dan mematikan hati seperti : mengkonsumi hal-hal yang memabukkan, atau mendengarkan dedangan alat musik, dan sebagainya. Kedua : Balasan sebaliknya dari apa yang Allah seritakan untuk orang-orang kafir, adalah firman Allah : { أُولَٰئِكَ سَيَرْحَمُهُمُ اللَّهُ } \"Mereka itu akan diberi rahmat oleh Allah\" [at-Taubah : 71] sesungguhnya Allah menyegerakan bagi orang-orang beriman rahmat di dalam hati-hati mereka, dan di semua lapis-lapis kehidupan yang mereka jalani, seperti yang mereka rasakan dari manisnya iman dan sungguh mereka benar-benar akan merasakan buah dari semua itu, hati-hati mereka senantiasa terasa lapang."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "37. Orang-orang kafir itu ingin keluar dari neraka dengan cara yang berbeda-beda, namun mereka tidak akan keluar dari sana selamanya. Dan bagi mereka itu azab yang abadi. Dan hal ini tidak mencakup orang-orang yang berbuat maksiat terhadap orang-orang mukmin"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Mereka ingin keluar dari neraka, tetapi tidak akan dapat keluar dari sana. Bagi mereka azab yang kekal} kekal"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "36-37. Allah mengabarkan tentang buruknya keadaan orang-orang kafir (kepada Allah) dan tempat kembali mereka yang jelek pada Hari KIamat. Bahwa seandainya mereka menebus azab Allah dengan emas sepenuh jagat dan ditambah dengan yang sepertinya, maka itu tidak berguna dan tidak diterima, karena waktu penebusan telah habis, yang tersisa hanyalah azab yang pedih yang menyakitkan dan kekal di mana mereka tidak keluar darinya untuk selama-lamanya dan akan menetap di dalamnya untuk masa yang tidak berujung."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 37",
    "description": "Ketika merasakan betapa pedihnya azab di akhirat nanti, mereka ingin sekali untuk keluar dari neraka yang merupakan tempat hukumannya, tetapi ternyata mereka tidak akan dapat keluar dari sana. Akibat dari sikap dan perilakunya, di akhirat kelak mereka akan mendapat azab yang kekal. Bila pada ayat yang lalu dijelaskan tentang hukuman bagi orang yang memerangi Allah dan rasul-Nya dan membuat kekacauan, maka pada ayat ini diterangkan tentang hukuman bagi pencuri. Setiap kejahatan pasti ada hukumannya. Adapun setiap orang laki-laki maupun perempuan yang mencuri, maka potonglah tangan keduanya sebagai balasan atas perbuatan buruk dan bertentangan dengan syariat yang mereka lakukan, dan hal itu juga sebagai siksaan dari Allah sesuai dengan peringatan-Nya. Sungguh dengan ketetapan dan peringatan ini, Allah mahaperkasa, mahabijaksana."
  }
]