[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Pencuri laki-laki dan pencuri perempuan, potonglah oleh kalian wahai para penguasa tangan mereka, dengan dasar tuntutan syariat, sebagai pembalasan bagi mereka berdua atas perbuatan mengambil harta manusia dengan cara yang tidak benar, serta sebagai sanksi yang dengan itu Allah hendak menghalangi orang lain berbuat serupa dengan perbuatan mereka. Dan Allah maha perkasa dalam kerajaanNya, Juga maha bijaksana dalam perintah dan laranganNYa."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "38. \"Potonglah -wahai para pejabat yang berwenang- tangan kanan setiap laki-laki dan wanita yang mencuri. Itu adalah balasan dan hukuman dari Allah atas perbuatannya mengambil harta orang lain secara ilegal. Dan hukuman itu bertujuan untuk menakut-nakuti si pelaku dan orang-orang lainnya.\" Dan Allah Maha Perkasa, tidak ada sesuatupun yang dapat mengalahkan-Nya, lagi Maha Bijaksana dalam menetapkan ketentuan-Nya dan menentukan syariat-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "38. Allah menjelaskan dalam ayat ini balasan orang yang mencuri dan menebar rasa takut. Allah menyebutkan pencuri perempuan setelah menyebutkan pencuri laki-laki dalam ayat ini agar tidak ada yang beranggapan jika seorang perempuan mencuri maka tidak ada hukuman baginya sebagai bentuk rasa kasihan kepadanya. Dan Allah mendahulukan penyebutan pencuri laki-laki daripada pencuri perempuan karena kaum laki-laki lebih berani melakukan kejahatan ini, dan kebanyakan kasus pencurian dilakukan oleh laki-laki. Allah memerintahkan untuk memotong tangan kanan pencuri, yaitu pada pergelangan tangan sebagaimana hal ini dijelaskan dalam sunnah. Ini merupakan hukum yang adil yang tidak mengandung kezaliman, sebagai balasan bagi para pencuri dan pencegah bagi setiap orang yang hendak melakukan kejahatan ini. Yang menetapkan hukum ini adalah Sang Pencipta Yang Maha Perkasa. Dalam syariat-Nya terdapat pemuliaan bagi para kekasih-Nya di dunia dan di akhirat, dan hinaan bagi orang-orang yang menyelisihi-Mya dan melanggar perintah-Nya. Dia Maha Perkasa sehingga tidak ada yang dapat menghalangi-Nya, dan Dia Maha Bijaksana dalam menetapkan syariat dan ketentuan, Dia menetapkan hukum-hukum ini dengan penuh hikmah dan kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "38. وَالسَّارِقُ وَالسَّارِقَةُ (Laki-laki yang mencuri dan perempuan yang mencuri) Setelah Allah menyebutkan hukum bagi orang yang mengambil harta orang lain secara terang-terangan yakni para pelaku begal, Allah melanjutkannya dengan menyebutkan hukum orang yang mengambil harta orang lain secara sembunyi-sembunyi yakni pencuri. Pencurian adalah perbuatan mengambil sesuatu dengan cara sembunyi dari penglihatan orang lain. فَاقْطَعُوٓا۟ أَيْدِيَهُمَا(potonglah tangan keduanya) Yakni tangan kanan dari kedua orang tersebut, yang dipotong di pergelangan tangan. Pencurian yang dijatuhi hukum had (potong tangan) jika barang yang dicuri setara dengan seperempat dinar atau lebih, apabila kurang dari itu maka tidak mendapat hukuman potong tangan; dan barang tersebut sebelumnya harus berada dalam tempat penyimpanan, apabila dicuri dari selain tempat penyimpanan maka tidak ada hukum potong tangan; oleh sebab itu koruptor dan penjambret tidak dihukum potong tangan. جَزَآءًۢ بِمَا كَسَبَا (pembalasan bagi apa yang mereka kerjakan) Yakni melakukan pencurian. نَكٰلًا (dan sebagai siksaan) Yakni siksaan yang memberi efek jera bagi para pencuri. مِّنَ اللهِ ۗ (dari Allah) Oleh sebab itu janganlah merasa sedih atas hukuman yang dijatuhkan kepada mereka."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "38. Dan hukuman bagi pencuri, yaitu tindakan mengambil harta orang lain secara sembunyi-sembunyi berupa manik-manik dengan takaran senilai seperempat dinar adalah pemotongan tangan dari bagian pergelangan untuk mencegahnya melakukan pencurian lagi, sebagai hukuman dari Allah, dan siksaan dahsyat yang digunakan sebagai pelajaran bagi orang lain. Allah adalah Dzat Maha Kuat, yang tidak mungkin ditaklukkan, dan Maha Bijaksana terhadap ciptaan dan aturanNya. Al-Kalbi berkata: “Ayat ini turun terkait Thu’mah bin Ubairaq, yaitu pencuri baju besi, sebagaimana kisahnya yang telah dijelaskan di surah An-Nisa’ ayat 105”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "{Laki-laki maupun perempuan yang mencuri, potonglah tangan keduanya} tangan kanan dari keduanya {sebagai balasan atas perbuatan yang mereka lakukan dan sebagai siksaan} hukuman {dari Allah. Allah Maha perkasa lagi Maha bijaksana"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "38. Pencuri adalah orang yang mengambil harta orang lain yang terpelihara (berharga) secara sembunyi-sembunyi tanpa kerelaannya. Perbuatan itu termasuk dosa besar yang berakibat hukuman yang buruk yaitu potong tangan kanan, seperti yang ada pada bacaan (qira’ah) sebagian sahabat. Dan batasan tangan secara mutlak hanya sampai pada pergelangan tangan. Jika dia mencuri, maka tangannya dipotong dipergelangan lalu dicelup minyak panas agar pembuluh darah menyempit dan darah berhenti. Akan tetapi as-Sunnah meletakan pembatasan terhadap keumuman ini dari beberapa segi: Di antaranya adalah keterjagaan, artinya, pencurian dilakukan terhadap harta yang terjaga dan keterjagaan harta adalah sesuatu yang digunakan untuk melindunginya menurut kebiasaan yang berlaku. Seandainya dia mencuri harta yang tidak terjaga, maka dia tidak terkena hukuman potong tangan. Di antaranya lagi, adalah harta yang dicuri mencapai satu nishab, yaitu seperempat dinar, atau tiga dirham atau senilai dengan salah satunya. Seandainya dia mencuri kurang dari itu, maka dia tidak terkenal hukuman potong tangan. Bisa jadi ini diambil dari kata mencuri dan maknanya, karena kata mencuri berarti mengambil sesuatu dengan cara yang tidak menjaga diri darinya, hal itu jika harta tersebut terjaga, jika tidak, maka itu bukanlah pencurian secara syar’i. Termasuk ke dalam hikmah adalah dibebaskannya hukum potong tangan karena mengambil sesuatu yang sedikit dan tidak berharga, karena penentuan memang diperlukan, maka penentuan syar’ilah yang dijadikan sebagai pentakhshish al-Quran. Hikmah dari hukum potong tangan adalah demi menjaga dan melindungi harta dengan memotong tangan yang melakukan kejahatan kepadanya. Jika pencuri mengulangi perbuatannya, maka dipotong kaki kirinya, jika dia masih mengulangi, maka ada yang bilang potong tangan kirinya lalu kaki kanannya. Ada yang berpendapat dipenjara sampai mati. FirmanNya, “Sebagai pembalasan terhadap apa yang mereka kerjakan,” artinya, hukuman potong tangan itu adalah sebagai balasan bagi pencuri atas harta orang yang dicurinya. “Dan sebagai siksaan dari Allah,” maksudnya, hukuman dan pelajaran bagi pencuri dan yang lain. Agar para pencuri menjadi jera jika mereka tahu bahwa mereka akan dipotong jika mencuri. “Dan Allah Mahaperkasa lagi Mahabijaksana,” Mahaperkasa, maka Dia meletakkan hukuman dengan memotong tangan pencuri."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 38: Mencuri adalah mengambil harta orang lain yang terpelihara secara sembunyi-sembunyi tanpa keridhaannya. Ia termasuk dosa besar karena hukumannya yang begitu buruk, yaitu dipotong tangannya. Jika telah dipotong tangannya, maka tangannya dipanaskan dalam minyak agar urat-urat tertutup sehingga darah berhenti. Keumuman pencurian yang berlaku potong tangan di ayat tersebut dibatasi dengan beberapa hal berikut: - Hirz, yakni pencurian dilakukan dari tempat yang terjaga atau tersimpan secara uruf (kebiasaan yang berlaku), jika mencuri bukan dari tempat yang terjaga, maka tidak berlaku potong tangan. - Barang yang dicuri harus mencapai nishabnya, yaitu 1/4 dinar atau 3 dirham atau senilai dengan salah satunya, jika di bawah dari nilai ini, maka tidak berlaku potong tangan. Yakni tangan kanannya dari kuu' (pergelangannya atau sebelah bawah ibu jari). Jika melakukan lagi, maka dipotong kaki kirinya dari persendian kakinya. Jika mengulangi lagi, maka dipotong tangan kirinya, dan jika melakukan lagi, maka dipotong kaki kanannya. Jika melakukan lagi, diberi hukuman ta'zir, seperti dengan dipenjara sampai mati. Sekaligus sebagai pelajaran bagi para pencuri yang lain sehingga mereka tidak jadi mencuri."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 38",
    "description": "Bila pada ayat yang lalu dijelaskan tentang hukuman bagi orang yang memerangi Allah dan rasul-Nya dan membuat kekacauan, maka pada ayat ini diterangkan tentang hukuman bagi pencuri. Setiap kejahatan pasti ada hukumannya. Adapun setiap orang laki-laki maupun perempuan yang mencuri, maka potonglah tangan keduanya sebagai balasan atas perbuatan buruk dan bertentangan dengan syariat yang mereka lakukan, dan hal itu juga sebagai siksaan dari Allah sesuai dengan peringatan-Nya. Sungguh dengan ketetapan dan peringatan ini, Allah mahaperkasa, mahabijaksana. Yang dijelaskan itu merupakan ketetapan Allah, tetapi barang siapa bertobat setelah melakukan kejahatan itu, menyesalinya, dan memperbaiki diri, serta berjanji untuk tidak mengulanginya, maka sesungguhnya Allah menerima tobatnya yang dilakukan dengan sepenuh hati. Sungguh, Allah maha pengampun, maha penyayang."
  }
]