[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Kemudian barangsiapa yang bertaubat setelah mencuri dan memperbaiki diri dalam seluruh perbuatannya, maka sesungguhnya Allah akan menerima taubatnya. Sesubngguhnya Allah maha pengampun bagi hamba-hambaNya lagi maha penyayang terhadap mereka."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "39. Barangsiapa yang bertaubat kepada Allah dari tindakan mencuri dan memperbaiki perbuatannya, sesungguhnya Allah akan menerima taubatnya sebagai anugerah dari-Nya. Karena Allah Maha Mengampuni dosa-dosa hamba-hamba-Nya yang bertaubat, lagi Maha Penyayang kepada mereka. Akan tetapi hukuman hudud tidak gugur dari mereka dengan pertaubatan tersebut bilamana urusannya telah sampai ke tangan pihak yang berwenang."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "39. Maka Barangsiapa yang menyesali perbuatan buruk yang telah lalu, mengejar kembali apa yang telah ia lewatkan, berhenti dari kezaliman, dan memperbaiki perbuatan-perbuatan buruknya, niscaya Allah akan menerima taubatnya dan memperbaiki urusannya. Dia Maha Mengampuni segala dosa, meskipun dosa itu amat besar, dan Maha Menyayangi hamba-hamba-Nya yang bertaubat. Dan sebagaimana Allah telah menerima taubat orang yang bertaubat, maka hendaklah masyarakat juga menerimanya sebagai saudara yang baik dan anggota masyarakat yang bermanfaat, bukan malah mengucilkannya dari kehidupan bermasyarakat sehingga ia dapat kembali ke dalam jurang kejahatan dan bergabung dengan golongan orang-orang jahat karena dijauhi oleh orang-orang yang baik. Tidak ada pekerjaan baik yang dapat ia kerjakan, rumah yang dapat menampungnya, dan teman-teman yang dapat menggandeng tangannya menuju kebaikan."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "39. فَمَن تَابَ مِنۢ بَعْدِ ظُلْمِهِۦ وَأَصْلَحَ (Maka barangsiapa bertaubat (di antara pencuri-pencuri itu) sesudah melakukan kejahatan itu dan memperbaiki diri) Yakni barangsiapa yang bertaubat dan memperbaiki perbuatannya setelah tangannya dipotong karena mencuri maka Allah akan menerima taubatnya. Rasulullah bersabda kepada pencuri setelah dipotong tangannya: “bertaubatlah kepada Allah, niscaya Allah akan menerima taubatmu”. Dalam sunnah telah ditetapkan bahwa apabila perkara-perkara yang melazimkan hukuman had jika telah diangkat kepada Imam atau pemimpin maka hukuman tersebut tidak boleh diganggu gugat dan tidak boleh dibatalkan lagi."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "39. Barangsiapa bertaubat dari tindakan mencuri dan menyesal atas perbuatannya yang lalu, yaitu setelah dia mencuri dan sebelum dia dihadapkan kepada hakim, lalu memperbaiki amalnya dengan mengembalikan barang curian kepada pemiliknya, dan memperbaiki seluruh amalnya, maka sesungguhnya Allah itu menerima taubatnya. Sesungguhnya Allah itu Maha Pengampun bagi orang yang meminta ampunan dan Maha Penyayang bagi orang yang bertaubat dan berserah diri."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Maka siapa saja yang bertaubat} kembali kepada Allah {setelah melakukan kezaliman} mencuri {dan memperbaiki diri, sesungguhnya Allah menerima taubatnya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "39. “Maka barangsiapa bertaubat (di antara pencuri-pencuri itu) sesudah melakukan kejahatan itu dan memperbaiki diri, maka sesungguhnya Allah menerima taubatnya. Sesungguhnya Allah Maha Pengampun lagi Maha Penyayang.” Allah mengampuni siapa yang bertaubat meninggalkan dosa-dosa dan memperbaiki amal perbuatan dan aib-aib."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 39: Namun demikian, tobatnya itu tidak menggugurkan hak anak Adam, berupa pemotongan tangan dan pengembalian haknya. Tetapi jika pemiliknya memaafkan sebelum dilaporkan kepada pemerintah, maka pemotongan tangan gugur."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 39",
    "description": "Yang dijelaskan itu merupakan ketetapan Allah, tetapi barang siapa bertobat setelah melakukan kejahatan itu, menyesalinya, dan memperbaiki diri, serta berjanji untuk tidak mengulanginya, maka sesungguhnya Allah menerima tobatnya yang dilakukan dengan sepenuh hati. Sungguh, Allah maha pengampun, maha penyayangsesudah mengingatkan tentang ketetapan dan syariat-Nya, Allah kemudian menekankan bahwa hanya dia penguasa alam semesta ini. Peringatan ini diungkapkan dengan pertanyaan retorika sebagai berikut, tidakkah kamu tahu bahwa Allah yang telah mencipta semua yang ada adalah juga yang memiliki seluruh kerajaan langit dan bumi. Selain itu, dia akan menyiksa siapa saja yang dia kehendaki karena telah melakukan kejahatan dan mengampuni siapa yang dia kehendaki karena telah bertobat. Sungguh Allah mahakuasa atas segala sesuatu."
  }
]