[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Bertanya kepadamu Para sahabatmu (wahai nabi), tentang apa yang di halalkan bagi mereka untuk dimakan? , maka katakanlah kepada mereka,”dihalalkan bagi kalian yang baik-baik dan binatang yang kalian latih dia dari binatang yang memiliki cakar atau bergigi taring, seperti anjing, cheetah, elang dan binatang serupa lainnya yang dapat di latih. Kalian melatihnya guna mengejar binatang buruan bagi kalian dari apa yang Allah ajarkan bagi kalian. Maka makanlah apa-apa yang ditangkapnya untuk kalian dan sebutlah nama Allah ketika melepaskannya untuk berburu. Dan takutlah kepada Allah dalam perkara yang Dia perintahkan dan Dia larang bagi kalian. Sesungguhnya Allah Maha cepat perhitunganNya.”"
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "4. \"Sahabat-sahabatmu bertanya kepada kamu -wahai Rasul- tentang makanan yang halal bagi mereka.\" Katakanlah wahai Rasul, “Allah menghalalkan bagi kalian memakan makanan-makanan yang baik. Dan juga menghalalkan bagi kalian memakan binatang yang ditangkap oleh binatang-binatang terlatih dan bertaring, seperti anjing dan singa, atau burung-burung yang berkuku tajam, seperti burung elang yang kalian latih untuk berburu dan kalian ajari sebagian dari ilmu berupa tata caranya yang Allah berikan kepada kalian, sehingga menjadi binatang yang apabila diperintah, maka ia jalankan perintah itu, dan apabila dilarang ia patuhi larangan tersebut. Maka makanlah binatang buruan yang berhasil ditangkapnya, walaupun ia membunuhnya. Tetapi bacalah bismillah ketika kalian melepaskannya (untuk berburu). Dan takutlah kalian kepada Allah dengan menjalankan perintah-perintah-Nya dan menjauhi larangan-larangan-Nya. Sesungguhnya Allah Mahacepat penghitungan-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "4. Setelah Allah menjelaskan hewan-hewan yang diharamkan bagi mereka, maka kemudian Allah menjelaskan apa yang dihalalkan bagi mereka. Segala yang nikmat untuk dimakan dan sesuai dengan tabiat manusia maka makanannya itu halal dan baik. Oleh sebab itu Islam mensyariatkan penyembelihan dan mengharamkan makanan yang menjijikan, bangkai, dan hewan yang belum sempat disembelih sebelum mati. Dan Allah menghalalkan hasil buruan dari anjing, burung, atau hewan buas lain yang digunakan untuk berburu yang telah kalian latih. Ini merupakan sebagian dari ilmu yang bermanfaat yang Allah ajarkan kepada kalian. Sebutlah nama Allah ketika menyembelih hewan buruan saat kalian dapati masih dalam keadaan hidup, dan bertakwalah kepada Allah dalam setiap urusan kalian karena perhitungannya kelak akan datang. Dia akan memberi keputusan antara para hamba-Nya dengan cepat. Ini merupakan ancaman bagi orang-orang yang melanggar batasan-batasan dari Allah."
  },
  {
    "title": "Zubdatut Tafsir Min Fathil Qadir / Syaikh Dr. Muhammad Sulaiman Al Asyqar, mudarris tafsir Universitas Islam Madinah",
    "description": "4. وَمَا عَلَّمْتُم مِّنَ الْجَوَارِحِ (dan (buruan yang ditangkap) oleh binatang buas yang telah kamu ajar) Yakni dihalalkan bagi kalian hasil buruan dari binatang buas yang kalian latih untuk berburu seperti anjing, harimau, dan hewan buas lainnya; atau dari binatang buas jenis ungags seperti elang dan alap-alap. Imam al-Qurthubi berkata: apabila anjing belum memakan hasil buruannya namun melukainya dengan gigitan atau cakaran, sedangkan yang memakainya untuk berburu adalah orang Islam dan dia menyebutkan nama Allah ketika melepaskannya maka hasil buruannya itu halal untuk dimakan, dan tidak ada perselisihan diantara para ulama dalam hal ini. مُكَلِّبِينَ(dengan melatih nya untuk berburu) Makna (المكلب) yakni pelatih anjing dan hewan buas lainnya untuk melatih keahlian berburu. تُعَلِّمُونَهُنَّ مما علمكم الله (kamu mengajarnya menurut apa yang telah diajarkan Allah kepadamu) Yakni dengan akal yang telah Allah ciptakan untuk kalian yang memberimu cara bagaimana melatih hewan-hewan tersebut hingga dapat dimanfaatkan untuk berburu. Tanda bahwa seekor anjing telah mampu untuk berburu setelah dilatih adalah kemampuannya untuk mendapatkan hewan buruan berkali-kali tanpa memakannya. فَكُلُوا۟ مِمَّآ أَمْسَكْنَ عَلَيْكُمْ (Maka makanlah dari apa yang ditangkapnya untukmu) Apabila anjing itu memakan hewan buruan maka sebenarnya ia memakannya untuk dirinya dan bukan untuk tuannya sehingga hewan buruan itu haram untuk dimakan. Sebagaimana sabda Rasulullah kepada ‘Adiy bin Hatim: “apabila kamu melepas anjing yang telah dilatih, dan kamu mengucapkan nama Allah, maka makanlah hasil buruannya. Namun apabila anjing itu memakannya maka janganlah kamu memakannya karena aku khawatir anjing itu memangsanya untuk dirinya sendiri”. وَاذْكُرُوا۟ اسْمَ اللهِ عَلَيْهِ (dan sebutlah nama Allah atas binatang buas itu) Yakni menyebut nama Allah ketika melepaskannya, karena jika ia tidak menyebutnya maka hasil buruannya menjadi haram, kecuali apabila ia memang lupa menyebutkannya. Dan jika si pemburu mendapati hewan hasil buruannya masih hidup maka hendaklah ia menyembelihnya dengan menyebut nama Allah."
  },
  {
    "title": "Li Yaddabbaru Ayatih / Markaz Tadabbur di bawah pengawasan Syaikh Prof. Dr. Umar bin Abdullah al-Muqbil, professor fakultas syari'ah Universitas Qashim - Saudi Arabia",
    "description": "{ وَمَا عَلَّمْتُمْ مِنَ الْجَوَارِحِ مُكَلِّبِينَ } \"dan (buruan yang ditangkap) oleh binatang buas yang telah kamu ajar dengan melatih nya untuk berburu\", diantara kemuliaan Ilmu : bahwa ayat ini menjelaskan tidak dibolehkan memakan buruan kecuali apa yang ditangkap oleh binatang buas pintar seperti anjing yang diajar; lihatlah bahkan binatang menjadi istimewa dengan ilmu."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "4 Mereka menanyakan kepadamu wahai Nabi: “Apakah yang dihalalkan bagi mereka?”. Katakanlah: “Dihalalkan bagimu yang baik-baik untuk dirimu dan tidak diharamkan oleh syariat dan buruan yang ditangkap oleh binatang buas yang telah kamu latih untuk berburu; seperti burung elang atau rajawali, atau dari binatang buas seperti anjing. Yang kalian latih semua anggota tubuhnya cara untuk memburu dengan membunuh mangsa buruan tanpa memakannya lebih dari tiga kali. Dan kamu mengajarinya menurut adab berburu sebagaimana yang telah diajarkan Allah kepadamu. Maka makanlah dari apa yang ditangkapnya untukmu, dan bukan yang telah dimakan oleh hewan pemburu itu, jika kalian memakan yang telah dimakan itu maka itu tidak halal. Dan sebutlah nama Allah atas binatang buas itu waktu melepaskannya. Dan bertakwalah kepada Allah dengan senantiasa menjalankan perintah-Nya, sesungguhnya Allah amat cepat hisab-Nya pada hari kiamat jika telah dekat. Abu Rafi’ berkata: Rasul memerintahkanku untuk membunuh anjing, kemudian orang-orang berkata: wahai Rasul, apa yang dihalalkan untuk kami dari umat ini yang engkau perintahkan untuk membunuhnya? Maka turunlah ayat ini."
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Mereka bertanya kepadamu, “Apakah yang dihalalkan bagi mereka?” Katakanlah,“Yang dihalalkan bagi kalian adalah yang baik-baik dan binatang pemburu yang telah kalian ajari} diperbolehkan bagi kalian pemburu dan burung yang kalian ajari {yang kalian latih} yang kalian ajari untuk berburu {kalian mengajarinya} mengajarinya untuk mengambil buruan {menurut apa yang telah diajarkan Allah kepada kalian. Maka makanlah apa yang ditangkapnya untuk kalian dan sebutlah nama Allah. Bertakwalah kepada Allah. Sesungguhnya Allah sangat cepat perhitunganNya.”"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "4. Allah berfirman kepada NabiNya Muhammad, “Mereka menanyakan kepadamu apakah yang dihalalkan bagi mereka?” artinya, dari makanan-makanan. “Katakanlah, ‘Dihalalkan bagimu yang baik-baik’ ,” yaitu, makanan yang mengandung manfaat, atau kelezatan yang tidak memudaratkan badan dan akal. Maka termasuk di dalamnya semua biji-bijian dan buah-buahan yang ada di desa-desa dana lam terbuka. Termasuk di dalamnya seluruh binatang laut dan seluruh binatang darat, kecuali apa yang dikecualikan oleh peletak syariat, Allah dan RasulNya seperti binatang buas dan binatang-binatang yang keji (menjijikan) sebagaimana dinyatakan secara jelas dalam FirmanNya, (Yaitu) orang-orang yang mengikut Rasul, Nabi yang ummi yang (namanya) mereka dapati tertulis di dalam Taurat dan Injil yang ada di sisi mereka, yang menyuruh mereka mengerjakan yang ma'ruf dan melarang mereka dari mengerjakan yang mungkar dan menghalalkan bagi mereka segala yang baik dan mengharamkan bagi mereka segala yang buruk dan membuang dari mereka beban-beban dan belenggu-belenggu yang ada pada mereka. Maka orang-orang yang beriman kepadanya. memuliakannya, menolongnya dan mengikuti cahaya yang terang yang diturunkan kepadanya (Al Quran), mereka itulah orang-orang yang beruntung.” (Al-A’raf:157). “Dan buruan yang ditangkap oleh binatang buas ( yang telah kamu ajari),” maksudnya, dihalalkan bagimu binatang buruan yang ditangkap oleh binatang buas yang telah kamu latih untuk berburu… dan seterusnya, (sebagaimana) ayat tersebut sampai akhir. Ayat ini menunjukkan beberapa perkara : Pertama: kasih sayang dan rahmat Allah kepada hambaNya, di mana Allah memperluas jalan-jalan yang halal, dan menghalalkan apa yang tidak mereka sembelih dari binatang buruan yang ditangkap oleh binatang-binatang buas yang telah dilatih. Binatang-binatang untuk berburu disini adalah anjing, singa, elang, dan lain-lain yang menangkap dengan taring dan cakarnya. Kedua: Hendaknya binatang buas yang dipakai untuk berburu adalah binatang yang terlatih, menurut kebiasaan (negeri setempat) yang dianggap memenuhi syarat bahwa ia terlatih, jika diberi syarat untuk berangkat, maka ia berangkat, jika dilarang, maka ia berhenti, dan jika ia menangkap binatang buruan, maka ia tidak memakannya. Oleh karena itu Allah berfirman, “Kamu mengajarnya menurut apa yang telah diajarkan Allah kepadamu. Maka makanlah dari apa yang ditangkapnya untukmu.” Maksudnya, dia menangkap binatang buruan untuk dirimu. Jika binatang buas itu memakannya berarti ia tidak mengetahui bahwa ia menangkap untuk majikannya, mungkin ia menangkap untuk dirinya sendiri. Ketiga : Hendaknya binatang buas atau burung pemangsa melukainya berdasarkan Firman Allah, “Binatang buas (yang memangsa),” dan ini harus sejalan dengan binatang yang mati tercekik yang telah dijelaskan pada ayat sebelumnya, seandainya anjing atau lainnya mencekiknya atau dia membunuhnya dengan tindihannya yang berat, maka hewan buruan itu tidak halal. Hal ini berpijak kepada pendapat bahwa yang dimaksud dengan binatang buas adalah binatang yang melukai binatang buruan dengan taring atau cakarnya. Dan pendapat yang masyhur adalah bahwa yang di maksud dengan binatang buas di sini adalah binatang penghasil yakni penangkap dan pemburu binatang buruan. Berdasarkan ini, maka tidak diharuskan melukai. Wallahu a’lam. Keempat: Dibolehkannya memiliki anjing untuk berburu sebagaimana dalam hadist shahih. Walaupun secara umum memiliki anjing adalah diharamkan; karena dibolehkannya berburu dengannya dan melatihnya menunjukkan bolehnya memiliki anjing. Kelima: Binatang buruan, walaupun terkena air liur anjing adalah suci, karena Allah membolehkannya dan tidak menyinggung harusnya mencucinya, itu menunjukkan kesuciannya. Keenam: Ayat ini mengandung keutamaan ilmu, binatang buas yang dilatih. Karena ia dilatih maka binatang buruan yang ditangkapnya menjadi halal, tapi yang tidak dilatih, maka binatang buruannya tidak halal. Ketujuh: Bahwa menyibukkan diri dengan melatih anjing atau burung pemangsa atau selainnya tidaklah tercela, bukan termasuk perbuatan sia-sia lagi batil, akan tetapi ia adalah pekerjaan yang boleh menjadi keinginan, karena ia sarana keppada kehalalan binatang-binatang buruan dan dapat dimanfaatkan. Kedelapan: Ayat ini mengandung dalil bagi orang yang membolehkan menjual anjing pemburu, dia berkata, “Karena boleh, jadi dia tidak mendapatkannya kecuali dengan itu.” Kesembilan: Ayat ini mengandung dalil diwajibkannya membaca bismillah pada saat melepas binatang pemburu dan jika dia tidak membaca bismillah dengan sengaja, maka apa yang dibunuh oleh binatang pemburu tidak halal. Kesepuluh: Boleh memakan hasil tangkapan binatang pemburu, baik ia membunuhnya atau tidak dan bahwa jika ia membawa tangkapannya kepada majikannya sementara tangkapan itu masih hidup, maka ia tidak halal kecuali dengan disembelih. Kemudian Allah mendorong hamba-hambaNya kepada takwa dan memperingatkan mereka akan adanya hisab (perhitungan amal) pada Hari KIamat, dan bahwa ia telah dekat. Firman Allah “Dan bertakwalah kepada Allah, sesungguhnya Allah amat cepat hisabNya.”"
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 4: Yakni makanan yang di dalamnya mengandung manfaat dan lezat, tanpa ada bahaya bagi badan maupun akal. Mafhum ayat ini menunjukkan haramnya makanan kotor menjijikan sebagaimana ditegaskan dalam ayat lain (lih. Al A'raaf: 157). Ayat ini menunjukkan beberapa hal, di antaranya: - Kelembutan Allah dan rahmat-Nya kepada hamba-hamba-Nya, Dia membuka lebar kepada mereka jalur-jalur yang halal. Dia menghalalkan kepada mereka makanan yang tidak mereka sembelih, yang diburu oleh binatang-binatang pemburu, seperti anjing, binatang buas atau burung yang buas. - Disyaratkan binatang pemburu tersebut harus terlatih yang menurut 'uruf (adat kebiasaan) sudah terlatih. Tanda sudah terlatih adalah disuruh mengejar buruan, ia mau mengejar, disuruh berhenti, ia menahan diri dan jika disuruh menahan buruan tidak memakannya, binatang buruan itu mau dan tidak memakannya. Jika binatang itu memakannya, maka tidak halal dimakan. - Demikian pula disyaratkan, bahwa binatang yang diburu dilukai oleh binatang buruannya berdasarkan kata-kata \"jawaarih\" (artinya yang melukai). Oleh karena itu, jika binatang buruannya mencekiknya atau membunuhnya dengan membebaninya, lalu buruannya mati, maka buruan itu haram dimakan. Hanyasaja yang masyhur arti jawarih adalah kawaasib, yakni binatang yang dapat menghasilkan buruan, sehingga syarat ini tidak tepat. - Disyaratkan menyebut nama Allah ketika melepas binatang buruan (lihat lanjutan ayatnya), dan bahwa jika pemiliknya tidak menyebut nama Allah dengan sengaja, maka haramlah binatang hasil buruan yang dimatikan oleh binatang buruannya. - Bolehnya memiliki anjing buruan, namun jika tidak untuk ini maka haram. - Sucinya bagian binatang yang diburu, yang disentuh oleh mulut anjing buruan, karena Allah tidak menyuruh untuk mencucinya. - Keutamaan ilmu, karena binatang yang sudah dilatih (memiliki ilmu) buruan yang dilakukannya menjadi halal, berbeda jika binatang itu tidak terlatih (tidak memiliki ilmu), di mana hasil buruannya haram. - Menyibukkan diri dengan melatih anjing atau binatang buas lainnya untuk berburu bukanlah perkara tercela, karena ada maksud dan tujuannya, yaitu agar binatang hasil buruannya halal dan dapat dimanfaatkan. - Di dalam ayat ini terdapat hujjah bagi orang yang berpendapat bolehnya menjual anjing buruan, karena biasanya untuk memilikinya hanya dengan cara seperti itu. - Boleh memakan hasil buruannya, hidup atau mati, hanya saja jika masih hidup, maka belum halal kecuali dengan menyembelihnya. Maksudnya binatang buas itu dilatih menurut kepandaian yang diperolehnya dari pengalaman; pikiran manusia dan ilham dari Allah tentang melatih binatang buas dan cara berburu. Yaitu buruan yang ditangkap binatang buas terlatih yang semata-mata untukmu dan tidak dimakan sedikitpun olehnya. Adapun jika dimakan, maka hal itu menunjukkan tidak diketahui apakah binatang itu diterkamnya untuk pemiliknya atau untuk dirinya. Hal ini termasuk syarat bolehnya memakan binatang buruannya."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 4",
    "description": "Setelah ayat yang lalu menjelaskan makanan-makanan yang diharamkan, ayat ini menerangkan makanan-makanan yang dihalalkan. Mereka bertanya kepadamu, wahai nabi Muhammad, apakah yang dihalalkan bagi mereka. Katakanlah, yang dihalalkan bagimu adalah makanan yang baik-baik, yang sesuai dengan selera kamu selama tidak ada tuntunan agama yang melarangnya, dan buruan yang ditangkap oleh binatang pemburu, seperti anjing, singa, harimau, burung yang telah kamu latih untuk berburu, binatang yang kamu latih menurut apa yang telah diajarkan Allah kepadamu. Maka makanlah apa yang ditangkapnya untukmu, bukan untuk dimakan binatang pemburu itu, dan sebutlah nama Allah, sewaktu kamu melepas binatang pemburu itu. Dan bertakwalah kepada Allah, sungguh, Allah sangat cepat perhitungan-Nya. Ayat ini masih berkaitan dengan ayat yang lalu memberikan jawaban atas pertanyaan orang yang beriman tentang apa saja yang dihalalkan bagi mereka. Pada hari ini dihalalkan bagimu segala yang baik-baik. Makanan, yakni binatang halal yang disembelih ahli kitab itu halal bagimu selagi tidak bercampur dengan barang-barang yang haram, dan makananmu halal pula bagi mereka, maka kamu tidak berdosa memberikannya kepada mereka. Dan dihalalkan bagimu menikahi perempuan-perempuan yang menjaga kehormatan di antara perempuanperempuan yang beriman dan halal pula menikahi perempuan-perempuan yang menjaga kehormatan di antara orang-orang yang diberi kitab sebelum kamu, yaitu orang-orang yahudi dan nasrani, apabila kamu membayar maskawin mereka untuk menikahinya, yakni melangsungkan akad nikah secara sah, tidak dengan maksud berzina dan bukan untuk menjadikan perempuan piaraan. Demikian Allah menetapkan hukum-hukum-Nya untuk dijadikan tuntunan bagi orang-orang yang beriman. Barang siapa kafir setelah beriman, maka sungguh, sia-sia amal mereka, dan di akhirat dia termasuk orang-orang yang rugi."
  }
]