[
  {
    "title": "Tafsir Al-Muyassar / Kementerian Agama Saudi Arabia",
    "description": "Tidak kah kamu tahu wahai rasul, bahwa sesungguhnya Allah adalah pencipta alam semesta, pengatur dan penguasanya, dan sesungguhnya Dia maha kuasa berbuat apa yang Dia kehendaki? Dia menyiksa siapa saja yang dikehendakiaNya dan mengampuni siapa saja yang kehendakinNya. Dan Dia maha kuasa atas segala sesuatu."
  },
  {
    "title": "Tafsir Al-Mukhtashar / Markaz Tafsir Riyadh, di bawah pengawasan Syaikh Dr. Shalih bin Abdullah bin Humaid (Imam Masjidil Haram)",
    "description": "40. Wahai Rasul! Kamu telah mengetahui bahwa Allah adalah pemilik kerajaan langit dan bumi. Dia berhak melakukan apa pun yang Dia kehendaki di sana. Dia berhak menyiksa siapa pun yang Dia kehendaki dengan keadilan-Nya. Dan Dia berhak mengampuni siapa pun yang Dia kehendaki dengan anugerah-Nya. Sesungguhnya Allah Mahakuasa atas segala sesuatu. Tidak ada sesuatu pun yang dapat menghalangi-Nya."
  },
  {
    "title": "Tafsir Al-Madinah Al-Munawwarah / Markaz Ta'dzhim al-Qur'an di bawah pengawasan Syaikh Prof. Dr. Imad Zuhair Hafidz, professor fakultas al-Qur'an Universitas Islam Madinah",
    "description": "40. Ayat ini menegaskan hukum-hukum yang telah disampaikan sebelumnya. Yang menetapkan syariatkan hukum ini adalah Dzat Yang memiliki kekuasaan penuh atas hamba-hamba-Nya. Dan Penguasa berhak mengatur kekuasaan-Nya sesuai kehendakcNya, mengazab siapa yang Dia kehendaki dengan keadilan-Nya dan mengampuni siapa yang Dia kehendaki dengan rahmat dan kelembutan-Nya. Dia Maha Kuasa untuk melaksanakan ancaman-Nya dan memenuhi janji-Nya karena tidak ada yang mampu menghalangi-Nya."
  },
  {
    "title": "Tafsir Al-Wajiz / Syaikh Prof. Dr. Wahbah az-Zuhaili, pakar fiqih dan tafsir negeri Suriah",
    "description": "40. Lalu Allah memberitahukan tentang illah dari hukum-hukum atas para penyerang dan perampok itu dengan berfirman: “Wahai Rasul, apakah kamu tidak mengerti bahwa Allah adalah Dzat yang Merajai langit dan Bumi, dan Dzat yang mengatur segala sesuatu di dalamnya dengan penuh hikmah dan keadilan. Dia mengazab orang yang dikehendaki untuk diazab dan mengampuni orang yang dikehendaki mendapat ampunan. Allah itu Maha Berkuasa atas segala sesuatu. Tidak ada satupun di dunia dan akhirat yang mampu menaklukkanNya”"
  },
  {
    "title": "Tafsir Ash-Shaghir / Fayiz bin Sayyaf As-Sariih, dimuraja’ah oleh Syaikh Prof. Dr. Abdullah bin Abdul Aziz al-‘Awaji, professor tafsir Univ Islam Madinah",
    "description": "Tidakkah kamu tahu bahwa sesungguhnya milik Allahlah kerajaan langit dan bumi. Dia menyiksa siapa saja yang Dia kehendaki dan mengampuni siapa saja yang Dia kehendaki. Allah Maha kuasa atas segala sesuatu"
  },
  {
    "title": "Tafsir as-Sa'di / Syaikh Abdurrahman bin Nashir as-Sa'di, pakar tafsir abad 14 H",
    "description": "40. Hal itu karena Allah adalah pemilik kerajaan langit dan bumi. Dia melakukan tindakan padanya sesuai dengan apa yang Dia kehendaki: Menentukan takdir, meletakkan hukum-hukum syar’I, mengampuni dan menyiksa sesuai dengan hikmah, rahmat dan ampunanNYa yang luas."
  },
  {
    "title": "Hidayatul Insan bi Tafsiril Qur'an / Ustadz Marwan Hadidi bin Musa, M.Pd.I",
    "description": "Surat Al-Ma’idah ayat 40: Termasuk di antaranya adalah menyiksa dan mengampuni kepada siapa yang Dia kehendaki."
  },
  {
    "title": "Tafsir Ringkas Kementrian Agama RI / Surat Al-Ma’idah Ayat 40",
    "description": "Sesudah mengingatkan tentang ketetapan dan syariat-Nya, Allah kemudian menekankan bahwa hanya dia penguasa alam semesta ini. Peringatan ini diungkapkan dengan pertanyaan retorika sebagai berikut, tidakkah kamu tahu bahwa Allah yang telah mencipta semua yang ada adalah juga yang memiliki seluruh kerajaan langit dan bumi. Selain itu, dia akan menyiksa siapa saja yang dia kehendaki karena telah melakukan kejahatan dan mengampuni siapa yang dia kehendaki karena telah bertobat. Sungguh Allah mahakuasa atas segala sesuatu. Pada ayat yang lalu diterangkan tentang hukuman bagi pencuri, sementara ayat ini menjelaskan sikap orang yahudi terhadap hukum dalam kitab taurat. Keterangan ini diawali dengan peringatan kepada rasulullah. Wahai rasul! janganlah engkau disedihkan karena mereka berlomba-lomba dalam kekafirannya dan menampakkan permusuhan, karena Allah pasti akan melindungimu. Ketahuilah bahwa mereka adalah orang-orang munafik yang mengatakan dengan mulut mereka, kami telah beriman, padahal hati mereka meyakini yang lain, dan mereka sesungguhnya belum beriman; dan waspadalah juga terhadap orang-orang yahudi yang sangat suka mendengar berita-berita bohong yang diungkapkan oleh pendeta-pendetanya, dan mereka juga sangat suka mendengar perkataan-perkataan orang lain yang belum pernah datang kepadamu yang menjelek-jelekkanmu. Mereka tidak segan-segan untuk mengubah katakata dalam kitab taurat dari makna yang sebenarnya, seperti mengubah hukum rajam bagi pezina menjadi menghitamkan wajah dan cambukan, atau diselewengkan pengertiannya. Mereka mengatakan kepada utusan yang diperintahkan untuk bertanya kepada rasulullah tentang hukum bagi pezina, jika ini, seperti yang mereka lakukan, yang diberikan kepadamu, yaitu hukum yang sudah diubah, terimalah, dan jika kamu diberi hukum yang bukan ini, maka hati-hatilah dan jangan diterima. Barang siapa dikehendaki Allah untuk dibiarkan sesat karena keangkuhan dan keras kepalanya, sedikit pun engkau tidak akan mampu menolak suatu akibat atau hukuman apa pun dari Allah untuk menolongnya. Karena pilihan pada kesesatan, maka mereka itu adalah termasuk orang-orang yang sudah tidak dikehendaki Allah untuk diberi petunjuk agar dapat menyucikan hati mereka. Di dunia mereka pasti akan mendapat kehinaan akibat sikapnya itu, dan di akhirat mereka pasti akan mendapat azab yang besar karena kesesatannya"
  }
]